[
  {
    "headline": "Talk to sponsors of violence, Buhari tells Catholic bishops",
    "summarized_story": "), on Tuesday, called on the Nigeria’s Catholic bishops to keep on speaking truth to power and extend their message of change to violent non-state actors.\nOver the years, the Church has modelled profound approaches in challenging the impunity of some state actors and errant power.\nIt is evident that we cannot create fraternity and harmony in West Africa without our faith communities.”Delivering his address, the President, Reunion of Episcopal Conferences of West Africa, Archbishop Ignatius Kaigama, asked political leaders to work harder to deliver good governance to the people.\nHe maintained that Catholic bishops in the region, without becoming politically partisan, would continue to ring out their prophetic voices on behalf of the voiceless multitude suffering.\nIn his remarks, the President of the Catholic Bishops’ Conference of Nigeria, Most Revd."
  },
  {
    "headline": "NAPTIP demands more funding to tackle trafficking",
    "summarized_story": "The National Agency for Prohibition of Trafficking in Persons and Other Related Matters has called on the Federal Government to increase and regularise funding for the agency.\nMorka noted that the organisation’s challenges were many, and its funding poor compared to its tasks.\nHe said, “Our challenges are enormous; our funding is inadequate for this kind of job we are expected to do.\nWe need to be classified as a proper security agency because our job is similar to others.\nThe appointment of three Director Generals for NAPTIP in less than six months is not good for stability."
  },
  {
    "headline": "OTC 2022: PETAN advocates independent path to energy transition",
    "summarized_story": "By Udeme Akpan & Ediri EjohTHE Petroleum Technology Association of Nigeria, PETAN, has called on Nigeria and other African nations to chart their independent energy transition paths.\nHe made this known while declaring open the Nigerian Pavilion at the 2022 OTC which has, “Energy Transition and the Future of Africa” as its theme .\nPETAN and Nigeria have built capacities, capabilities and visibility.\nPETAN has been the host of the Nigerian pavilion for over 15 years.\n“And we have been fully supported by the Nigerian National Petroleum Corporation (now NNPC Limited) which is in transition."
  },
  {
    "headline": "Obaseki, Ehanire seek increased private partnership to improve healthcare system",
    "summarized_story": "By Gabriel Enogholase, BENINGovernor Godwin Obaseki of Edo State and the Minister of Health, Dr Osagie Ehanire have called for more private sector involvement in achieving a strong and effective healthcare system that would guarantee the delivery of quality and efficient healthcare services to citizens.\nThe duo made the call during a dinner organised for members of the Association of Nigeria Physicians in the Americas, ANPA, who are in Edo State on a one-week medical mission, providing specialised healthcare services to the people of Edo State.\nDuring the medical mission, no fewer than 5,000 Edo residents benefitted from the free surgical intervention and treatments for heart, kidney, eye and other ailments.\nHailing the association for the free medical outreach, Obaseki said the mission had provided better healthcare for the Edo people.\nYou also engaged in capacity building as you interchanged skills and made your colleagues here locally improve their knowledge."
  },
  {
    "headline": "Group flays incidences of violations, attacks on press by security agents",
    "summarized_story": "By Ibrahim Hassan-WuyoA group, Africa Media Development Foundation (AMDF), has expressed worry over the high incidences of violations and attacks on the Press by security agents, on the orders of people in authority, and sometimes by aggrieved members of the public, who take the law into their hands.\nThe AMDF, therefore, saluted journalists in Africa, and others around the world, who remained on the frontline to practice journalism, despite the attacks, threats, imprisonment, loss and blackmail.\nThis was contained in a statement issued by Iliya Kure, Executive Director, AMDF on Tuesday.\nHe said ” as we mark the 2022 World Press Freedom Day, we remember each of the 55 journalists killed worldwide in the last one year (UNESCO figures), who died in line of duty, or because of their journalistic practice.”“Overtime, Press Freedom in Africa has remained an issue of concern, with high incidences of violations and attacks on the Press by security agents, on the orders of people in authority, and sometimes by aggrieved members of the public, who take the law into their hands.”“The World Press Freedom Day, observed every 3rd May, is set aside by the United Nations to serve as a reminder “to governments of the need to respect their commitment to Press Freedom and is also a day of reflection among media professionals about issues of press freedom and professional ethics.”“Like every Press Freedom stakeholder, AMDF is concerned with increasing cases of harassment, arrests, imprisonment, torture and digital attacks on journalists for no other reason, other than doing their work.”“We therefore call on governments and security agencies in Africa to respect the freedom of the press at all times.”“We also call on journalists to adhere strictly to the code of journalism ethics each time they write their stories.”“AMDF aligns with the 2022 theme, “Journalism Under Digital Siege”, which is a reflection of the many challenges confronting journalists in the discharge of their duties.”“This is particularly important because the trend of online attacks on media is significantly increasing, with women journalists worst hit.\nA recent statistic by UNESCO shows “a shocking prevalence of harassment online”, where nearly three-quarters of female media professionals had experienced online violence linked to their work.”“In respect to this, AMDF will on Thursday 12th May hold a virtual panel discussion via zoom, drawing journalists from different countries of Africa to discuss.”“While AMDF continues to speak against impunity and injustice against journalists, we call on all stakeholders to join us in our resolve to continue in the fight against Press Freedom until the press in Africa is free from attacks and violence.”"
  },
  {
    "headline": "Joint Security Forces neutralize bandits in Rafi LGA of Niger",
    "summarized_story": "In an attempt by terrorists/armed bandits to disrupt the peaceful Eid-el-fitr celebration in Niger State, joint security forces engaged and neutralized the hoodlums in Rafi LGA of the State.\nOn 02/05/2022 at about 1700hrs, armed bandits on motorcycles attempted to attack Kawo, Uregi villages in Rafi LGA to disrupt Sallah celebration in the State.\nOn the receipt of this information, joint security tactical teams responded swiftly and mobilised to the area where the hoodlums were engaged around Uregi, Kiribo villages and as a result, about ten bandits were neutralized, 14 kidnapped citizens were rescued and seven motorcycles recovered with arms from them.\nGovernor of Niger State Abubakar Sani Bello commended the gallantry efforts of the security personnel, including the local vigilante members who are supposed to be with their families and loved ones to celebrate Sallah, but rather chose to remain vigilante in the forest to provide security for Nigerlites.\nHe reassured them of his commitment and determination to ensure peace is restored in all the troubled communities."
  },
  {
    "headline": "S/Kaduna crisis: Statement against SOKAPU sponsored by our killers, indigenes allege",
    "summarized_story": "This was as the Southern Kaduna Professionals lamented that the governor of Kaduna State, Nasir Ahmed el-Rufai, has abandoned the people of Southern Kaduna to their fate in spite of incessant attacks by their enemies.\nHowever, we have to console ourselves considering the level of hunger in the country and Kaduna State in particular.\nAçcording to the Southern Kaduna Professionals,” Privileged and very reliable information available to us suggest that Rev.\n” We wish to unequivocally say here that men of Operation Safe Haven are not doing what they should do in Southern Kaduna.\nWe are not going to surrender our land to anyone no matter how highly placed,” the statement by the Southern Kaduna Professionals further read."
  },
  {
    "headline": "Niger Joint security team repel attack in Niger community, kill 10 terrorists",
    "summarized_story": "The Niger State Joint Security team has allegedly neutralized no fewer than ten bandits and rescued fourteen persons at Kawo, Uregi villages in Rafi local government area of the state.\nThe incident occurred on Monday at about 5 pm during the Sallah festivities in the area.\nUmar commended the gallant efforts of the security personnel, including the local vigilante members who he said abandoned their families during Sallah, to stand guard in the forests and provide security for indigenes.\nThe Commissioner said, ” the Governor appreciates this uncommon sacrifice and encouraged the security agencies not to relent in their efforts towards mitigating against terrorism/banditry and other criminality in the State”.\nUmar then reassured the people of the government’s commitment and determination to ensure peace is restored in all the troubled communities."
  },
  {
    "headline": "Yobe: Fact check your sources, information before publishing – NUJ to newsmen",
    "summarized_story": "The Nigeria Union of Journalists, (NUJ), Yobe State Council has tasked working Journalists in the state to be professionals in their reportage and fact-check information before publishing or broadcasting.\nRajab Mohammed, Chairman, Yobe State Council gave the charge in a statement marking this year’s World Press Freedom Day which comes with the theme: ‘Journalism under digital siege’.\nThe Chairman said fact-checking information can reduce incidences of lawsuits against media practitioners.\nOn the 2023 general elections, Rajab appealed to politicians to shun campaigns of calumny and insist on a smooth transition.\nThis year’s World Press Freedom Day theme: “Journalism under digital siege” spotlights the multiple ways in which journalism is endangered by surveillance and digitally-mediated attacks on journalists, and the consequences of all this on public trust in digital communications."
  },
  {
    "headline": "UN chief, Guterres in Nigeria, visits Boko Haram victims in Borno",
    "summarized_story": "United Nations (UN) Secretary-General, Antonio Guterres landed in Nigeria on Tuesday.\nGuterres visited the Borno capital, Maiduguri, where he met Boko Haram victims and Internally Displaced Persons (IDPs).\nThe chief consoled them and expressed UN’s commitment to ensure their welfare remain a top priority.\nGovernor Babagana Zulum briefed Guterres on the humanitarian crisis and thanked the world body for its efforts over the years.\nNAN reports that Guterres could not make his scheduled visit to the border town of Banki due to time factor."
  },
  {
    "headline": "Lassa fever: Expert urges FG, states to recruit more health inspectors",
    "summarized_story": "Prof. Tanimola Akande has urged federal and state governments to increase the number of environmental health inspectors to reduce the spread of Lassa fever.\nThe expert said the incidence of Lassa fever in most states was worrisome and required concerted efforts.\nWe need to have functional health inspectors that will go around houses as done in the 60s.\nAkande said health inspectors should extend their scope of focus beyond abattoirs and marketplaces for a more healthier environment.\n“The way we dump refuse arbitrarily would encourage the breeding of rats, let’s encourage people to dispose of refuse appropriately”, the expert counselled."
  },
  {
    "headline": "Attack on soldiers: Army urged to withdraw personnel from Agulu checkpoint",
    "summarized_story": "General Officer Commanding the 82 Division of the Nigerian Army, Major General Lagbaja, has been urged to withdraw his personnel from Agulu in Anaocha Local Government Area of Anambra State.\nThe call came following an attack on the personnel by gunmen at a military checkpoint last week, which led to a huge exchange of gunfire, causing injuries on many and deaths.\nMaduagwu among other reasons said the location of the army checkpoint in the community is the busy Agulu town hall, stating that exchange of gunfire in such area could lead to heavy civilian casualties.\nIn the letter of appeal, Maduagwu called on the GOC to see reasons to relocate the checkpoint to a safer area.\nThis checkpoint is situated directly in front of Agulu Unity Hall which attracts heavy human and vehicular traffic with thriving commercial activities around the vicinity."
  },
  {
    "headline": "There may be no Nigeria without zoning in 2023",
    "summarized_story": "Ijaw leader Edwin Clark has warned there may be no Nigeria without zoning in 2023.\nThe leader of the Pan Niger Delta Forum (PANDEF) said any attempt to scuttle the zoning policy may scuttle national unity.\n“Nigeria stood on three legs, and it has never been steady since one of the legs was destroyed during the Civil War.\nIf zoning which will heal the wounds is not done, there will be no Nigeria.\n“The North believes their population can be used to oppress other Nigerians."
  },
  {
    "headline": "IGP upgrades police criminal database, forensic investigation",
    "summarized_story": "The Inspector-General of Police (IGP) Usman Baba, has ordered effective upgrade and relaunch of the Nigeria Police Crime and Incident Database (NPC & IDB) Centre for providing additional aid to police operatives in acquiring credible electronic criminal databases.\n“Similarly, the IGP has ordered a full-scale upgrade of all Police Forensic laboratories and digital resource centres across the nation.\nHe equally tasked Forensic Unit officers of the Force Criminal Investigations Department (FCID) to effectively apply advanced knowledge acquired at various capacity-building workshops organized in collaboration with foreign agencies and other governmental bodies, ministries, departments and agencies of governments at all levels,” he said.\nThe police boss emphasised that these developments are in line with his policing agenda to incorporate the application of cutting-edge technology and intelligence-led policing model to operational and investigation functions in consonance with international best practices.\nHe assured Nigerians of the dedication of his administration to bestowing the nation with a people-oriented, endearing and professional police force."
  },
  {
    "headline": "2023: Southern Nigeria's turn to produce next president",
    "summarized_story": "Akeredolu made call in a statement, tagged “Our Party, APC, Must Tread The Path Of Equity”, which was made available to newsmen on Tuesday in Akure.\n“The leadership of the party ensured that the principle of rotational representation guided its decision at the just-concluded convention,” he said.\nIt is the turn of the Southern part of the country to produce the next President.\n“The party leadership should have no difficulty in making pronouncement on this very important issue, just as it has fixed various fees for the purchase of forms.\n“We must not keep our party men and women guessing on the position of the leadership of the party."
  },
  {
    "headline": "Speak on zoning now, Akeredolu tells Adamu",
    "summarized_story": "Ondo Governor Oluwarotimi Akeredolu has urged the national leadership of the All Progressives Congress(APC) under Senator Abdullahi Adamu to immediately make a pronouncement on which zone will produce the presidential candidate of the party.\nAkeredolu said the principle of rotational representation guided the party’s leadership decision at the just-concluded national convention.\nAkeredolu, in a statement he personally signed in Akure, insisted that it was the turn of the South to produce the next President.\nThe Ondo Governor said the party leadership should have no difficulty in making pronouncement on the important issue of zoning just as it has fixed various fees for the purchase of forms.\n“We must not keep our party men and women guessing on the position of the leadership of the party."
  },
  {
    "headline": "Ilorin monarch endorses Abdulrazaq for second term",
    "summarized_story": "Emir of Ilorin, Alhaji Ibrahim Sulu-Gambari has urged Kwara Governor AbdulRahman AbdulRazaq to seek for a second term in office.\nSulu- Gambari hinged his endorsement of the Governor for a second term on his (Abdulrazaq)’s ‘wonderful performance.\nThe Emir said this in Ilorin, the state capital at this year Bareke at the Government House as part of activities marking Eid- el- Fitr .\n“It is an individual’s right enshrined in the constitution of Nigeria that if you do the first time of four years you may also contest for the second term.\nYour Excellency, go ahead in your aspiration to become second-term Governor in Kwara state."
  },
  {
    "headline": "2023: South should produce president –Akeredolu",
    "summarized_story": "From Bamigbola Gbolagunte, AkureOndo State Governor, Rotimi Akeredolu, yesterday, declared that it was the turn of the South to produce president in 2023 and so would be disingenuous for anyone to oppose power shift to the region.\nAkeredolu, chairman, South West Governors Forum, stated this in a statement tagged: ‘Our party, APC, must tread the path of equity’ urged leaders of the All Progressives Congress (APC) to make public the zoning arrangement.\nPart of the statement read: “It is the turn of the southern part of the country to produce the next President.\nThe party leadership should have no difficulty in making pronouncement on this very important issue, just as it has fixed various fees for the purchase of forms.\nThe Ondo governor said the current democratic dispensation is anchored on the unwritten convention driven by a principle of equity."
  },
  {
    "headline": "Okoro, Madubuko rejoice over The Sun awards",
    "summarized_story": "chairman and Chief Executive Officer of Corinthia Villa Hotel, Abuja, Chief Augustine Okoro and Chairman, De Chico Group, Chief Benson Madubuko, have described The Sun as a unique brand whose annual awards are recognition for hard work.\nSpeaking separately when the Managing Director/Editor-in-Chief, The Sun Publishing Limited, Onuoha Ukeh, led Management teams to present letters announcing their selection for the awards, Okoro and Madubuko said The Sun awards are credible.\nOkoro said the recognition will spur him to work harder to create more job opportunities for Nigerians.\nHe said: “For me, I’m really not crazy about awards but The Sun award is different and I believe I merit this award.\nOn why Okoro was chosen, he said: “We recognise your investments in the hospitality industry."
  },
  {
    "headline": "Why terrorism is worsening –Kaduna gov",
    "summarized_story": "From Noah Ebije, Kaduna and Tunde Omolehin, SokotoKaduna State Governor, Nasir El-Rufai has said terrorism would not have festered if security agencies had sustained the measures he adopted to tackle insecurity when he assumed office in 2015.\n“We created a specialised Ministry of Internal Security, and we continue to support the federal security agencies with logistics and other resources.\nHe said the traditional institutions should mobilise their networks to expose them and support the security forces with local intelligence.\n“The Kaduna State Government will continue to do everything it can to mobilise and support the federal security agencies to defeat terrorists and criminals that menace our people,’’ he said.\nMeanwhile, Sultan of Sokoto, Sa’ad Abubakar, has advised leadership of the Nigerian Army to re-strategise their tactics in the ongoing war against terrorism."
  },
  {
    "headline": "Akande, Osoba convene S’ West APC presidential aspirants meeting",
    "summarized_story": "Others are Speaker Femi Gbajabiamila, deputy senate leader, Ajayi Boroffice, APC governors from the South West and other stakeholders.\nOsoba confirmed the meeting in Paris, France yesterday, saying it was meant to bring peace in the South West.\nIt was, however, learnt that the essence of the Lagos meeting is to bring all the candidates to a round table to ensure the South West does not lose out in the contest for the APC presidential ticket.\nThe thinking of conveners of the meeting is that the South West sacrificed most for the emergence of President Muhammadu Buhari and should be rewarded with the presidential ticket.\nThere is also the fear that if the South West fails to put its house in order, it may lose the ticket to the South South or the South East."
  },
  {
    "headline": "PDP’s hope for smooth presidential primary under threat",
    "summarized_story": "By Emma EmeozorThe hope of the Peoples Democratic Party (PDP) to hold a crisis-free presidential primary appear to have been threatened as the party and one of its presidential aspirants, Cosmos Ndukwe lock horn in court.\nNdukwe had asked the lower court to stop the party’s Primary Election Planning Committee headed by Senator Samuel Anyanwu from going ahead with the exercise after he was declared ineligible to participate in the primary.\nNdukwe specifically prayed the court to halt the presidential primary until his suit is determined.\nAmong others, the appellant, (Senator Anyanwu) claimed that the Judge erred in law by denying him fair hearing in breach of section 36(1) of the 1999 Constitution.\n“The learned trial judge erred in entertaining an exparte motion which seeks to stop the presidential primary election of the appellant without hearing notice,” Anyanwy had argued."
  },
  {
    "headline": "Bury Zoning and Bury Nigeria, South/Middle Belt Leaders Warn",
    "summarized_story": "They declared that another eight years of northern presidency, after President Muhammadu Buhari, was unacceptable.\nThey said they were prepared for those attempting to upturn a practice – zoning – that had sustained the country.\nThe group warned that any attempt to kill and bury the age-long power rotation agreement between the north and south was tantamount to an attempt to kill and bury Nigeria.\nThe Southern and Middle Belt leaders also warned Abdullahi’s NEF, and wondered if the northern body was now out to dissolve the country.\nThey have our absolute support for the Southern and Middle Belt Leaders’ Forum and we stand firmly by them."
  },
  {
    "headline": "Buhari: Rescuing Kidnapped Train Passengers Delicate, Requires Wisdom",
    "summarized_story": "•Assures families victims will safely return•Says terrorists using captives as human shields, making their rescue difficultDeji Elumoye and Udora OrizuPresident Muhammadu Buhari, yesterday, said rescuing the kidnapped passengers of the Kaduna-bound train that was recently attacked by terrorists was a delicate situation, which required wisdom, utmost caution, and proper handling.\nBuhari, however, assured the families of the victims that efforts were on-going to ensure the safe return of all those held captive by the terrorists.\nHe directed security agencies and the Nigerian Railway Corporation (NRC) to provide more regular and detailed information to the victims’ families on their condition and efforts to save them.\nTerrorists had on March 28 attacked a Kaduna-bound train, killing no fewer than nine people, injuring several others, and abducting most of the passengers.\nSERAP also sued the president for his failure to secure the safe release of those held captive by the terrorists."
  },
  {
    "headline": "Banks, Others’ Borrowings from CBN Fell by 66% to N1.4trn in Four Months",
    "summarized_story": "Finance experts attributed the development to improved business environment post Covid-19, stressing that this paved the way for banks and merchant banks to halt borrowing from the CBN this year.\nOn his part, the Vice President, Highcap Securities Limited, Mr. David Adnori said uncertainty in the nation’s economy forced banks and merchant banks to shun borrowing from CBN.\nAccording to him: “Banks and merchant banks have excess liquidity and might not need to borrow from CBN.\nHe stressed that the nation’s economy in 2021, had normalised, giving room for banks and merchant banks to reduce borrowing from the CBN in 2022.\nAdeyeye explained that banks and merchant banks are maintaining effective risk management in a move to cut down down non-performing Loan (NPL) in the financial sector."
  },
  {
    "headline": "FIFA Fines Nigeria $.15m, Bars Fans from Moshood Abiola National Stadium Abuja",
    "summarized_story": "Duro IkhazuagbeWorld football governing body, FIFA, has imposed a fine of $150,000 on Nigeria following the disturbances that followed Super Eagles’ 1-1 draw with Ghana in a 2022 World Cup playoff at the Moshood Abiola National Stadium in Abuja.\nThe draw led to the non-qualification of Nigeria for the 2022 World Cup in Qatar.\nIn addition to the fine, fans have been barred from the Moshood Abiola Stadium in Abuja as Nigeria will play host to Sierra Leone in the first qualifying match of the 2023 AFCON next month.\nOver 60,000 fans crammed the stadium in Nigeria’s last game of the qualifiers for the World Cup in Qatar.\nThe fans’ action resulted in speculations in the local media that the stadium may not witness any international game in the foreseeable future."
  },
  {
    "headline": "2023: Two Groups Move to Stop PDP Convention over Power Rotation, Zoning",
    "summarized_story": "The kernel of their cases are that the PDP over the years had a tradition of power rotation and zoning.\nThe PDP had fixed May 28, for the conduct of its presidential primary election and to that effect screened the 17 aspirants who obtained the presidential form to run in the 2023 election.\nAs of last week, it was obvious that the PDP was not considering zoning its Presidential ticket to the south as being clamoured by southern governors and other leaders in the zone.\nThe PDP asked the court to strike out the suit for want of jurisdiction and also dismiss it for being “statute-barred”.\nIt is the ruling party that should be concerned with zoning, but not the PDP."
  },
  {
    "headline": "Large Crowd Welcomes AAC Presidential Aspirant, Sowore As He Campaigns Inside Ondo Lake",
    "summarized_story": "Nigerians in large numbers on Tuesday welcomed human rights activist and presidential hopeful of the African Action Congress (AAC), Omoyele Sowore, as he paid a visit to his home state, Ondo.\nSowore, who paid a visit to Ondo Lake, said to him personally, that the lake was like home as it brought back pleasant memories of the past.\nHe further emphasised the importance of tourism of any economy, stating that had the industry been promoted in Nigeria, the Ondo Lake would have been receiving visitors from all over the world.\nHe, however, identified the problem with the lake as oil pollution, which makes it impossible for people to consume the water.\n“I heard the governor of Ondo State, in one of their jamborees was saying they want to create a fish pond inside the lake, they don't have sense.”More Photos:"
  },
  {
    "headline": "Large Crowd Welcomes AAC Presidential Aspirant, Sowore As He Campaigns Inside Ondo Lake",
    "summarized_story": "Nigerians in large numbers on Tuesday welcomed human rights activist and presidential hopeful of the African Action Congress (AAC), Omoyele Sowore, as he paid a visit to his home state, Ondo.\nSowore, who paid a visit to Ondo Lake, said to him personally, that the lake was like home as it brought back pleasant memories of the past.\nHe further emphasised the importance of tourism of any economy, stating that had the industry been promoted in Nigeria, the Ondo Lake would have been receiving visitors from all over the world.\nHe, however, identified the problem with the lake as oil pollution, which makes it impossible for people to consume the water.\n“I heard the governor of Ondo State, in one of their jamborees was saying they want to create a fish pond inside the lake, they don't have sense.”More Photos:"
  },
  {
    "headline": "EXCLUSIVE: Nigerian Police Academy Commandant, Ahmad Accused Of Islamisation Agenda, Separation Of Meals Between Cadets, Other Discriminatory Policies",
    "summarized_story": "The officers, while speaking with SaharaReporters, accused Ahmad, an Assistant Inspector-General of Police of marginalisation and a subtle islamisation agenda.\nAccording to them, postings of police officers in the Academy to offices are biased and sectional in nature.\n“Postings of police officers in the Academy to offices are biased and sectional in nature.\nAt the cadet's dining, cadets are separated because of the fasting of the Muslims with special meals and treatments for the Muslims and regular for that of Christian cadets.\n“With the introduction of the optional head scarfs for Muslim female serving police officers, the female cadets on training in the Academy now use scarfs."
  },
  {
    "headline": "EXCLUSIVE: Nigerian Police Academy Commandant, Ahmad Accused Of Islamisation Agenda, Separation Of Meals Between Cadets, Other Discriminatory Policies",
    "summarized_story": "The officers, while speaking with SaharaReporters, accused Ahmad, an Assistant Inspector-General of Police of marginalisation and a subtle islamisation agenda.\nAccording to them, postings of police officers in the Academy to offices are biased and sectional in nature.\n“Postings of police officers in the Academy to offices are biased and sectional in nature.\nAt the cadet's dining, cadets are separated because of the fasting of the Muslims with special meals and treatments for the Muslims and regular for that of Christian cadets.\n“With the introduction of the optional head scarfs for Muslim female serving police officers, the female cadets on training in the Academy now use scarfs."
  },
  {
    "headline": "PHOTONEWS: Nigeria's Corruption-riddled Attorney-General Malami Launches New Hotel Few Days After Being Exposed For Distributing Multi-billion Naira Vehicles As Bribes To APC Party Officials In Kebbi",
    "summarized_story": "You may also like"
  },
  {
    "headline": "Oshiomhole to declare presidential bid Wednesday, says aide",
    "summarized_story": "Victor Oshioke, media aide to Adams Oshiomhole, former national chairman of the All Progressives Congress (APC), says his principal will announce his intention to contest the presidency on Wednesday.\nHe added that the event was scheduled to hold on an earlier date, but was later postponed for further consultations.\nAdvertisement“We apologise for the short notice and hope that your love for Comrade Adams Aliyu Oshiomhole will motivate you to attend, irrespective of any unforeseen constraints.”The development comes weeks after Oshiomhole declared his interest in contesting for a seat in the senate.\nSpeaking at an event to mark his birthday in April, Oshiomhole had expressed his intention to represent Edo north in the upper legislative chamber in the 2023 polls.\nAdvertisementMeanwhile, Francis Alimikhena, the senator currently representing the constituency, has purchased his nomination and expression of interest forms to contest for the senate seat in the 2023 general election."
  },
  {
    "headline": "Oshiomhole to declare presidential bid Wednesday, says aide",
    "summarized_story": "Victor Oshioke, media aide to Adams Oshiomhole, former national chairman of the All Progressives Congress (APC), says his principal will announce his intention to contest the presidency on Wednesday.\nHe added that the event was scheduled to hold on an earlier date, but was later postponed for further consultations.\nAdvertisement“We apologise for the short notice and hope that your love for Comrade Adams Aliyu Oshiomhole will motivate you to attend, irrespective of any unforeseen constraints.”The development comes weeks after Oshiomhole declared his interest in contesting for a seat in the senate.\nSpeaking at an event to mark his birthday in April, Oshiomhole had expressed his intention to represent Edo north in the upper legislative chamber in the 2023 polls.\nAdvertisementMeanwhile, Francis Alimikhena, the senator currently representing the constituency, has purchased his nomination and expression of interest forms to contest for the senate seat in the 2023 general election."
  },
  {
    "headline": "2023: North will benefit more if southerner becomes president, says Ndume",
    "summarized_story": "Ali Ndume, senator representing Borno south district, says the northern region will benefit more if a southerner becomes president in 2023.\nThe current president comes from the north and if you look at it analytically, the south benefitted more.\nIf the president comes from the south, we will benefit more just as we did previously during Jonathan’s administration,” he said.\n“In terms of infrastructure, the south benefitted more because the second Niger bridge will be completed very soon.\nWithout fear of any contradiction, we will benefit more if the president comes from the south.”"
  },
  {
    "headline": "2023: North will benefit more if southerner becomes president, says Ndume",
    "summarized_story": "Ali Ndume, senator representing Borno south district, says the northern region will benefit more if a southerner becomes president in 2023.\nThe current president comes from the north and if you look at it analytically, the south benefitted more.\nIf the president comes from the south, we will benefit more just as we did previously during Jonathan’s administration,” he said.\n“In terms of infrastructure, the south benefitted more because the second Niger bridge will be completed very soon.\nWithout fear of any contradiction, we will benefit more if the president comes from the south.”"
  },
  {
    "headline": "Insurgents attack Chibok community, dislodge troops",
    "summarized_story": "Kautukari, a community in Chibok LGA of Borno state, is currently under attack by suspected fighters of the Islamic State of West Africa Province (ISWAP).\nA resident told TheCable that the insurgents invaded the community around 6pm on Tuesday and started shooting randomly.\nAdvertisementMeanwhile, the development comes months after suspected Boko Haram insurgents attacked Kawtakare, Korohuma and Pemi in Chibok LGA.\nFour persons were reportedly killed in the attack while a total of 110 building were set ablaze by the insurgents.\nDuring the attack on January 14, the insurgents were said to have invaded the area with different of weapons and started shooting sporadically."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "CAR becomes first African country to legalise crypto",
    "summarized_story": "The Central African Republic (CAR) has just become the first African country to adopt bitcoin as a legal tender.\nAfter El Salvador, CAR is just the second country in the world to legalise it.\nKenya, Nigeria, Togo, South Africa, Ghana, and Tanzania are also featured in its Top 20 Global Crypto Adoption Index.\nIn fact, at 11%, CAR has the fifth-lowest internet penetration rate in Africa, and this brings into question the feasibility of crypto adoption in the country.\nNot sure how BEAC (central bank for 6 central African countries that use XAF currency tied to Euro) will react."
  },
  {
    "headline": "Your data or your life?",
    "summarized_story": "Mental health care over data privacyWhat happens to your data when you die?\nOn the flip side is the ever golden question: Are Africans concerned about data privacy and security?\nWhile mental health care is becoming popular in Africa, does this mean we are better off sticking to traditional mental health care?\nEven though these apps typically make mental health care more accessible, the report suggests that access to mental health care may come at the expense of privacy.\nWill you choose data privacy over your mental health or vice-versa?"
  },
  {
    "headline": "Why funding news slowed down in April",
    "summarized_story": "Share this article:African startup funding news appeared to have slowed down in April.\nIn the episode of the Techpoint Africa podcast, our editorial team explores the trend, and other interesting global tech news this week.\n0:29 – Mental health & prayer apps and your privacyRead Mozilla Foundation’s report for context7:48 – Why Central African Republic has adopted Bitcoin as official currency19:51 – Why Nigeria’s Eden life acquired Kenya’s Lynk27:06 – Why funding news slowed down in AprilRegister for the Techpoint Africa Blockchain Summit by visiting blockchain.techpoint.africa.\nYou can also share interesting parts using the #TechpointAfricaPodcast hashtag.\nTechpoint Africa Techpoint Africa is a digital media company that amplifies the best innovations out of Africa through its media, data, and events."
  },
  {
    "headline": "Here are the confirmed speakers for the Techpoint Africa Blockchain Summit",
    "summarized_story": "Share this article:On May 21, 2022, the biggest blockchain and Web3 focused event — Techpoint Africa Blockchain Summit (TABS 2022), will be held at Four Points by Sheraton, Victoria Island Lagos.\nSpeaker at Techpoint Africa Blockchain SummitFisayo Fosudo is a visual storyteller, finance and technology video producer with over 250,000 subscribers.\nSpeaker at The Techpoint Africa Blockchain Summit.\nSpeaker at Techpoint Africa Blockhain Summit.\nSpeaker at Techpoint Africa Blockchain SummitSenator Ihenyen is the current President of Stakeholders in Blockchain Technology Association of Nigeria (SiBAN), a self-regulatory body in Nigeria’s emerging blockchain industry."
  },
  {
    "headline": "Earnipay leverages embedded finance to deliver frictionless transactions to drive on-demand salary earning.",
    "summarized_story": "This article is a Brand Press post.\nBrand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\nFor more information, visit earnipay.comBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Mushe (XMU) Joins TikTok Owners ByteDance in a Contest of Clashing Metaverses",
    "summarized_story": "This article is a Brand Press post.\nBrand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nMushe (XMU) recently made a less publicized announcement of its own planned metaverse, but the details should interest anyone interested in virtual commercialization.\nLearn more about Mushe (XMU)Official Website: https://www.mushe.world/Presale Registration: https://portal.mushe.world/sign-upTelegram: https://t.me/MusheWorldXMUTwitter: https://twitter.com/Mushe_WorldInstagram: https://www.instagram.com/mushe_world/Brand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Antonio Guterres, UN Secretary-General makes first visit to Nigeria",
    "summarized_story": "United States Secretary-General, Antonio Guterres, has arrived Nigeria on a two-day official visit and is currently in Borno State, the epicentre of the Boko Haram insurgency for more than a decade.\nThis is the first visit by the U.N. secretary-general to Nigeria since his appointment.\nThe visit is part of his annual Ramadan solidarity visits to nations, according to the United Nations information centre in Nigeria.\nGuterres will then head to Nigeria’s capital to meet with President Muhammadu Buhari and Vice President Yemi Osibanjo and other top cabinet officials, the centre added.\nBefore arriving in Nigeria, Guterres already visited Senegal and Niger."
  },
  {
    "headline": "Digital transformation crucial to future of African banking – Report",
    "summarized_story": "Digital transformation is the future of African banking.\nHowever, concerns over the speed of transformation and the nature of the changes being implemented have been on the minds of experts, a recent report on African Banking Digital Transformation by African Banker magazine and Backbase shows.\nA total of 39 percent of respondent banks now invest at least three million dollars yearly for digital transformation and innovation.\nOut of the African banks who participated in the survey, 49 percent said that they had greatly increased the speed of implementation because of Covid-19.\n“In this context, it is no surprise that the need to transform banking practices seems widely accepted,” the report stated."
  },
  {
    "headline": "Bonny Terminal gets certification as first eco-port in sub-Saharan Africa",
    "summarized_story": "The NLNG Ship Management Limited (NSML) has said that the Bonny Terminal owned by the Nigeria LNG has been certified as the first eco-port in sub-Saharan Africa.\nAbdul-Kadir Ahmed, managing director of NSML told BusinessDay in an interview in Lagos that the certification means that the Bonny Terminal is being run in accordance with the highest standard of environmental management.\n“One critical element that gets me worked up in shipping is the impact of plastics and debris on our waterway.\nAhmed further said that NSML has been reaching out to the community around the Bonny Terminal to clean up their waterfront as well because NSML is not the only one in the waterway.\nAwareness means educating people because a lot of people still do not understand the impact of plastics."
  },
  {
    "headline": "Obaseki moves to end street begging, urges stakeholders’ support – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has affirmed the government’s zero tolerance for street begging, noting that the state will begin the arrest and prosecution of parents of out-of-school children, as part of efforts to tackle the menace of street begging in the state.\nThe governor said, “We believe that basic education is the right for every Edo child; it’s their right and it’s free and compulsory.\nWe will link education with street begging and street children.\n“In the next few weeks or months, we will not allow street begging in Edo anymore.\nWe will make sure those hard-to-reach areas in the riverine communities will have teachers to teach the children."
  },
  {
    "headline": "Obaseki, Ehanire seek increased private partnership to improve healthcare system – Nigerian Observer",
    "summarized_story": "The duo made the call during a dinner organized for members of the Association of Nigeria Physicians in the Americas (ANPA) who are in Edo State on a one-week medical mission, providing specialised healthcare services to the people of Edo State.\nDuring the medical mission, over 5,000 Edo residents benefitted from the free surgical intervention and treatments for heart, kidney, eye and other ailments.\nHailing the association for the free medical outreach, Obaseki said the mission has provided better healthcare for Edo people.\nHe said, “We have received the fundamental benefit of hope to Edo people as you gave renewed life to Edo people.\nYou also engaged in capacity building as you interchanged skills and made your colleagues here locally improve their knowledge."
  },
  {
    "headline": "Obaseki inspects progress of work on Labour House, to finalises on construction of 7.2km Temboga Road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said the government is commencing the construction the 7.2km Temboga Road in Ikpoba-Okha Local Government Area (LGA) of the state to decongest traffic around Ramat and its environs within the Benin metropolis.\nObaseki disclosed this when he was led on an inspection of ongoing construction of the Edo Labour House Complex, in Benin City, by the state chairman of the Nigeria Labour Congress (NLC), Mr. Odion Olaye.\nThe governor said, “We are finalising the design of Temboga Road; it’s about 7.2km to the end.\nOnce they finalize with the design in the next few weeks, we will award the contract.\nIt has a multipurpose hall which can be put into commercial use to generate income."
  },
  {
    "headline": "PHOTOS: Workers’ Day Celebration In Edo – Nigerian Observer",
    "summarized_story": "Check AlsoThe Governor of Edo State, Mr. Godwin Obaseki, has congratulated Muslims in the state as …"
  },
  {
    "headline": "IPOB’s murder of Igbo soldier, husband evidence of terrorism against Ndigbo – Army",
    "summarized_story": "Recall that the intending couple were murdered and subsequently beheaded by the gunmen on Saturday, April 30, 2022.\nThe Army in a statement by Gen. Onyema Nwachukwu, its spokesperson, on Tuesday, noted that the decision of the separatist group to commit the act against an Igbo daughter in Private Mathew, was evidence of its acts of terrorism against the Igbo.\n“This gruesome murder, in which they did not spare even their own child, clearly depicts callousness, impenitence and is indisputably, a brazen act of terrorism perpetrated by IPOB/ESN.\nWhile we deeply condole with the families, relations and close associates of the victims, the NA has commenced investigation to unmask and bring the criminals to book.\n“Members of the public are please enjoined to oblige security agencies actionable information that will lead to the arrest of these criminals.”"
  },
  {
    "headline": "UN secretary general, António Guterres arrives Borno State [PHOTOS]",
    "summarized_story": "Professor Babagana Zulum, governor of Borno State, on Tuesday, recieved United Nations Secretary General, António Guterres, in Maiduguri, the state capital.\nThe UN chief is in Nigeria on a two-day visit, as part of his tour of West African countries battling insurgency.\nGuterres was in Borno to assess humanitarian situation resulting from the decade-long Boko Haram insurgency in the North-East.\nHe will meet Nigeria’s president, Muhammadu Buhari on the impact of terrorism in the country, as well as meet families affected by the more than a decade long insurgency."
  },
  {
    "headline": "EFCC asked to probe Abubakar Malami over 200 SUV gift to Kebbi APC leaders",
    "summarized_story": "HURIWA said it is relying on the Freedom Of Information Act to make the demand public.\n“The EFCC must probe Malami and his so-called friends whose names are not mentioned by the AGF’s spokesman.\nWhat is their pedigree to afford 200 lush SUVs?\n“The anti-corruption agency must quit its keeping cool whilst ministers like Malami allegedly fritter millions buying cars for delegates, buying nomination forms.\nSo we aren’t indicating the minister of Justice but we are of the humble opinion that there have to be FULL DISCLOSURES on the donors if any."
  },
  {
    "headline": "Power supply in Nigeria drops marginally to 98.1kMWh",
    "summarized_story": "Nigeria’s electricity supply dipped on Monday to 98.19kMWh, representing a 0.2% decline compared to 98.36kMWh supplied on Sunday.\nEnergy generation also recorded a 0.1% decline to 99.62kMWh on Monday from 99.7kMWh generated on Sunday, 1st May 2022.\nMeanwhile, power generation peaked at 4.25kMW, while its off-peak during the day was 3.95kMW.\nThe highest frequency for the day was 50.39Hz, while the lowest frequency was 49.23Hz.\nA further look at the tracker showed that 98.57% of the total energy generated on Monday was sent out to consumers."
  },
  {
    "headline": "BREAKING: UN Sec-Sen, António Guterres, Visits Borno",
    "summarized_story": "The United Nations Secretary General, António Guterres, on Tuesday afternoon, arrived Borno State, North-East Nigeria, to assess humanitarian situation resulting from decade-long Boko Haram crisis in the region.\nGuterres was recieved on arrival at the Maiduguri International Airport by Borno State governor, Babagana Umara Zulum.\nDuring the visit, he will have one on one interaction with stakeholders in the state.\nHe is also expected to visit some internally displaced persons (IDPs) camps, interface with repentant terrorists, and as well have a press conference.\nDetails Later…"
  },
  {
    "headline": "Insecurity: Police Upgrade Criminal Database, Forensic Laboratories",
    "summarized_story": "The inspector-general of police, IGP Usman Baba, has ordered an effective upgrade and relaunch of the Nigeria Police Crime and Incident Database (NPC & IDB) centre.\nThis is even as the IGP has ordered a full-scale upgrade of all Police Forensic laboratories and digital resource centres across the nation.\nHe equally tasked Forensic Unit officers of the Force Criminal Investigations Department (FCID) to effectively apply advanced knowledge acquired at various capacity-building workshops organized in collaboration with foreign agencies and other governmental bodies, ministries, departments and agencies of governments at all levels.\nThe database would provide baseline data using ICT and biometrics, stimulate digital crime-fighting techniques, and accessibility to a one-stop data bank for professional profiling of criminal elements and effective crime data management in the Force.\nHe equally assured Nigerians of the dedication of his administration to bestowing the nation with a people-oriented, endearing and professional police force."
  },
  {
    "headline": "NDLEA Uncovered N22bn Tramadol Imported By Ukatu",
    "summarized_story": "The agency said in the course of investigating the N3billion Tramadol saga between Ukatu and the DCP Abba Kyari’s IRT team, its operatives have unearthed more evidences establishing how Ukatu had been importing large quantities of Tramadol far above the approved threshold allowed into the country.\nIn one instance, Ukatu through his Mallinson group of companies imported into the country two-conatiner loads of five different brands of Tramadol in October 2019 through the Apapa ports in Lagos.\nAll the evidences so far gathered show that the imported Tramadol brands were far above the threshold permitted to be imported into Nigeria.\nThe NDLEA said after months of surveillance, Ukatu was eventually arrested aboard a flight to Abuja at the MM2 terminal of the Lagos airport, Ikeja on Wednesday, April 13.\nUkatu owns pharmaceutical and plastic manufacturing companies, which he used as a cover to import illicit drugs into Nigeria."
  },
  {
    "headline": "NDLEA Uncovered N22bn Tramadol Imported By Ukatu",
    "summarized_story": "The agency said in the course of investigating the N3billion Tramadol saga between Ukatu and the DCP Abba Kyari’s IRT team, its operatives have unearthed more evidences establishing how Ukatu had been importing large quantities of Tramadol far above the approved threshold allowed into the country.\nIn one instance, Ukatu through his Mallinson group of companies imported into the country two-conatiner loads of five different brands of Tramadol in October 2019 through the Apapa ports in Lagos.\nAll the evidences so far gathered show that the imported Tramadol brands were far above the threshold permitted to be imported into Nigeria.\nThe NDLEA said after months of surveillance, Ukatu was eventually arrested aboard a flight to Abuja at the MM2 terminal of the Lagos airport, Ikeja on Wednesday, April 13.\nUkatu owns pharmaceutical and plastic manufacturing companies, which he used as a cover to import illicit drugs into Nigeria."
  },
  {
    "headline": "Obey Court Order, Vacate NDDC Office, MOSIEND Tells Akwa",
    "summarized_story": "The Movement for the Survival of Izon Ethnic Nationality in Niger Delta (MOSIEND), has called on the sole administrator of the Niger Delta Development Commission (NDDC), Barrister Effiong Akwa, to obey a subsisting order of the Court and vacate the NDDC office.\nMOSIEND, in a letter addressed to Akwa, which was made available to LEADERSHIP in Port Harcourt, the Rivers State capital, asked the NDDC sole administrator to vacate the office within 14 days.\n“In complying with the Ruling of the Court, it is expedient you vacate lodges, guests hosues and the NDDC Headquarters without any further delay.\nYou are to vacate the NDDC Headquarters within 14 days.\n“We will also proceed to court in conjunction with other well meaning comrades to pursue Contempt Proceeding as well."
  },
  {
    "headline": "Updated: Buhari, Tinubu meet behind closed doors [Photos]",
    "summarized_story": "Asiwaju Bola Ahmed Tinubu, a leader and presidential aspirant in the All Progressives Congress has visited President Muhammadu Buhari, a day after the Eid-el-Fitri.\nTinubu was away for the Lesser Hajj in Saudi Arabia last week before returning to Lagos to observe the Eid-el-Fitri.\nBoth leaders met behind closed doors at the Presidential Villa, Abuja.\nThe agenda of the meeting between the president and Tinubu could not be ascertained as at the time of filing this report.\nTinubu on Friday picked the ruling APC presidential nomination and expression of interest forms at the its national secretariat in Abuja."
  },
  {
    "headline": "Why Yahaya Bello is the best for 2023 presidency – Hafsat Abiola",
    "summarized_story": "By Angela AtaboThe Director-General of the Hope ’23 Yahaya Bello Campaign Council, Hafsat Abiola-Costello has said no candidate is better positioned for the 2023 presidency than Gov.\nYahaya Bello of Kogi.\nShe rolled out reasons Yahaya Bello remained Nigeria’s best bet in the forth-coming 2023 presidential election.\nAccording to Abiola-Costello, there is no candidate better positioned to harness the potentials of young people in Nigeria than Bello.\nShe added that Bello set up a business council made up of some of the most successful businessmen in Nigeria, not just in Kogi."
  },
  {
    "headline": "IPOB Responsible For Killing, Beheading Of Military Couple In Imo — Nigerian Army",
    "summarized_story": "Members of the Indigenous People of Biafra (IPOB) have been charged by the Nigerian Army of killing two soldiers in Imo State.\nA phone chat with the suspected gunman has also appeared online, said to have been initiated by a friend of the dead female soldier.\nIn the phone conversation, obtained by our reporter, a suspected gunman admitted that he killed the couple.\nThe gunman said they were aggrieved that the military has been consistently killing innocent residents in efforts to attack them (gunmen).\nI killed both of them yesterday,” the suspected gunman was heard saying in the phone conversation."
  },
  {
    "headline": "Abba Kyari: NDLEA Uncovers Tramadol Worth ₦22b Imported By Drug Baron",
    "summarized_story": "The National Drug Law Enforcement Agency claims to have uncovered how Chief Afam Mallinson Ukatu, a reputed billionaire drug baron, imported 1,284 cartons of Tramadol with a market worth of almost N22 billion.\nIn response to assertions that there was insufficient evidence to indict Ukatu, the NDLEA issued a statement signed by its Director, Media & Advocacy, Femi Babafemi, on Tuesday.\nThe NDLEA had detained Ukatu in connection with a N3 billion Tramadol deal allegedly involving the embattled suspended Deputy Commissioner of Police, Abba Kyari, and his Intelligence Response Team, according to the PUNCH.\n“All the evidence so far gathered show that the imported Tramadol brands were far above the threshold permitted to be imported into Nigeria,” the statement read in part.\nThe NDLEA, however, added that with all the evidence against the detained businessman, he would soon have his day in court."
  },
  {
    "headline": "2023: Osinbajo Divides RCCG As Pastor Calls For Sack Of Colleague Who Campaigned For Him",
    "summarized_story": "As a pastor of the RCCG, he believes Osinbajo will keep his election promise.\nHe said in the statement: “I was saddened when my attention was drawn to the statement credited to the Head of Politics and Governance of the Redeemed Christian Church, RCCG, ‘Pastor’ Timothy Olaniyan.\n“Pastor Olaniyan claimed that politicians will promise heaven and earth, and at the end of the day, you see them giving N1000, N2000 to eligible voters.\n“Osinbajo and Buhari promised 20,000 MW of electricity within four years, but today, grid collapse and darkness are what Nigerians are battling.\n“When Osinbajo and Buhari came to power on the 29th of May 2015, the naira was exchanged at N199 to the dollar."
  },
  {
    "headline": "Buhari Finally Reveals Who He’ll Hand Over To In 2023",
    "summarized_story": "Buhari Finally Reveals Who He’ll Hand Over To In 2023 [VIDEO]President Muhammadu Buhari has promised to hand over to whoever Nigerians elect to succeed him in 2023.\n“I will hand over to whoever Nigerians elect to succeed me,” the President said.\nMr Buhari, who briefly responded to questions after the prayer session, admitted to having sleepless nights over the security situation in parts of the country.\nHe, however, promised to spare no efforts in dealing decisively and mercilessly with the criminal gangs.\n“The national security chiefs and the Police IG are very much aware of the situation and their duty is to know where the terrorists are and eliminate them."
  },
  {
    "headline": "[Breaking] UEFA Champions League: Liverpool survive Villarreal scare, zoom into final",
    "summarized_story": "Liverpool survived a scare against Villarreal to move into the Champions League final – and keep their hopes of winning an unprecedented quadruple alive.\nSadio Mane secured Liverpool’s place in their third Champions League final in five seasons with a third goal after taking the ball around Rulli.\nVillarreal ended the game with 10 men with Capoue sent off late on for two bookable offences.\nThe Reds will play either Manchester City or Real Madrid at the Stade de France in Paris on Saturday, 28 May.\nNo English side has ever won the Champions League, Premier League, FA Cup and League Cup all in the same season, with Liverpool aiming to create history."
  },
  {
    "headline": "Breaking: Another disaster averted as Dana air catches fire",
    "summarized_story": "Up to 50 passengers were promply and safely evacuated after another air disaster was averted when the tyres of an aircraft belonging to Dana Airlines caught fire shortly before take off.\nBlueprint gathered that no life was lost and no passenger was injured as first responders including operatives of the fire service at the airport moved in to control the situation.\nA press statement, Tuesday morning, Dana Air spokesman, Kingsley Ezenwa, said the aircraft had been grounded pending the conclusion of their investigations.\n“All 50 passengers onboard the aircraft disembarked safely and our maintenance team have immediately grounded the aircraft pending the conclusion of their investigations.\nShare this: TwitterFacebook"
  },
  {
    "headline": "World Press Freedom Day: Media freedom under attack in Nigeria – NGE",
    "summarized_story": "The Nigerian Guild of Editors (NGE) Monday said the inalienable right to access and disseminate information through an independent press is under attack in Nigeria.\nIt is also a day of reflection among journalists and other media professionals about issues of press freedom and professional ethics.\n“Governments at all levels must take the lead in making sure that their actions do not inspire violations of press freedom.\nPublished ahead of World Press Freedom Day May 3, the data from IPI’s Ukraine War Press Freedom Tracker underscores the devastating toll the conflict has already taken on independent journalism, media freedom and the safety of journalists in both countries.\n“These attacks in both countries cast a dark shadow over this year’s World Press Freedom Day."
  },
  {
    "headline": "Edo State NLC tasks FG on improving job creation",
    "summarized_story": "He made the call yesterday during the 2022 Workers’ Day in Benin City, Edo State.\nMeanwhile, the Edo State Governor, Godwin Obaseki, has approved N40,000 as new minimum wage for workers in the state, in commemoration of this year’s Workers’ Day.\nIt will be immoral and mindless of us to continue to pretend we do not know our workers are suffering.\n“The government of Edo has now decided to review the minimum wage for Edo workers from N30,000 to N40,000.\nUndoubtedly, Edo is the first state since the current outbreak of coronavirus to take this initiative."
  },
  {
    "headline": "2021: FCMB records N1.57trn deposit",
    "summarized_story": "By Onu OkorieFirst City Monument Bank FCMB Group Plc has recorded a Total deposit increase by 1.21 per cent to N1.57 trillion from N1.1.55 trillion in the previous year.\nis on the path of growth overcoming two economic recession as the lender’s profit hit a seven year high and an inch to equaling 2015 highs.\nThe uptick in profit was buoyed by an improvement in interest income as FCMB created risk assets and loans while a benign yield environment strengthened income from treasury yields.\nInterest income on loans and advances increased by 39.87 percent to N46.69 billion in March 2022.\nNet interest income, the difference between the revenue generated from a bank’s interest-bearing assets and the expenses associated with paying its interest-bearing liabilities, was up 52.59 percent to N18.54 billion as at March 2021."
  },
  {
    "headline": "Ogbeifun seeks financial support for seafarers to build capacity for employment",
    "summarized_story": "By Naomi DourglasChairman of Startz Investment Company and former president of Ship Owners Association of Nigeria (SOAN) Engr.\nGreg Ogbeifun has tasked the Federal Government to help Nigerian ship owners with necessary financial support to enable them to build the capacity for seafarers through employment.\n‘He also explained that, the Secretary-General of MOWCA had confirmed to him that the Managing Director of the RMDB has been appointed.\nSo, hopefully, in two or three months, we will have a functional maritime bank with some funds that operators begin to look forward to”.\nOgbeifun stated that the RMDB will serve as a succor to ship owners who find it difficult to access the Cabotage Vessel Financing Fund (CVFF)."
  },
  {
    "headline": "2021: MTN Nigeria Plc rewards shareholders with N13.12bn as dividends",
    "summarized_story": "Also Board representatives re-elected are Mr Rhidwaan Gasant and Mrs lfueko Omoigui-Okauru.\nAs at the end of March 2022, we had approximately 10.7 million active users and 166k active MoMo agents,” MTN Nigeria CEO, Karl Toriola, said.\nMTN Nigeria was recently granted final approval for a Payment Service Bank (PSB) by the Central Bank of Nigeria (CBN).\n“Having established a significant foundation of registered agent network, we are now focusing on scaling the active base.\nWe have expanded our agent services to include card withdrawal services by deploying point of sales (POS) terminals to the agent network."
  },
  {
    "headline": "P+ Measurement wins awards in PR, industry influencer relations",
    "summarized_story": "By Kehinde Ibrahim LagosP+ MEASUREMENT Services, Nigeria’s foremost Independent Public Relations measurement and evaluation agency have attained double laurels at this year’s Industry Awards where it clinched the Leader in PR Measurement & Industry Influencer Awards (Public Relations), for its quality offerings that surpass clients’ expectations and leading position in the sector.\nThe awards come on the heels of the company’s rebranding business strategy with a new logo, website, and office to deepen penetration and maintain its dominant position in the industry it operates, with over 47 brands and 17 Public Relations agencies in Africa’s largest economy.\nAccording to him, the award-winning and innovative organisation, with cutting-edge solutions has dictated the pace of the Public Relations measurement and evaluation services with its distinctive approach to ensuring that clients’ objectives are achieved.\nIts measurement and evaluation report are in-depth, robust, and flexible to accommodate valid metrics that brands desire to see reflected in their customised reports, and also based on the AMEC Standard by the Barcelona Principle 3.0.\nAlso, as part of its efficient services, the measurement and evaluation company introduced “Get-Reports,” a novel product that allows the purchase of PR performance audit reports in key sectors including the 22 Commercial Nigerian Banks PR Performance Audit Report, Top Nigerian Insurance PR Performance Audit Report, Top Nigerian Digital Banks PR Performance Audit Report, and Top Online Streaming Services PR Performance Audit Report."
  },
  {
    "headline": "Gunmen Reportedly Attack Chibok",
    "summarized_story": "Gunmen have reportedly attacked Kautikari, a local ward in Chibok local government of Borno State.\nLocal officials in Chibok, who spoke to the press in anonymity, confirmed that gunshots were heard around Kautikari at about 6:00 pm on Tuesday.\nRead Also: UN Secretary-General, Antonio Guterres Arrives Nigeria On First Official VisitThere are no details of the attack at this moment, but the military is reportedly engaging the criminals.\nThis attack comes months after gunmen attacked three communities: Kawtakare, Korohuma, and Pemi in the Local Government Area.\nChairman of Chibok Local Government Area, Umar Ibrahim while briefing Governor Babagana Zulum who visited days after the attack, said 24 people were also abducted."
  },
  {
    "headline": "UN Secretary-General, Antonio Guterres Arrives Nigeria On First Official Visit",
    "summarized_story": "The United Nations Secretary-General, Antonio Guterres, has arrived Nigeria on a two-day official visit to Africa’s most populous country.\nHe proceeded to Borno, the state ravaged by a decade-long insurgency as Nigeria makes concerted efforts to wipe out terrorism.\nFrom there, he is scheduled to head to Abuja to meet with President Muhammadu Buhari and Vice President Yemi Osibanjo and other top cabinet officials.\nIt is the first visit by the U.N. secretary-general to Nigeria since his appointment.\nThe visit is part of his annual Ramadan solidarity visits to nations."
  },
  {
    "headline": "Zoning: Avoid Self-Inflicted Crises Before General Elections, Akeredolu Tells APC",
    "summarized_story": "Ondo State Governor, Oluwarotimi Akeredolu, has advised his party – the All Progressives Congress (APC) to avoid self-inflicted crises ahead of the 2023 elections.\nWith about 10 months to the general polls, he said it would be dishonest for anyone to argue against rotation at this period.\nAkeredolu, a two-term governor on the platform of the APC, made the remarks in a statement titled ‘Our Party, APC, Must Tread The Path Of Equity’ on Tuesday.\nHe stated that the party ensured the principle of rotational representation guided its decision at the just-concluded convention.\nThe governor added that the national chairmanship position was zoned to the North while all other offices were filled on that understanding."
  },
  {
    "headline": "‘Oxygen Of Democracy,’ NHRC Asks Nigerian Govt To Protect, Support Journalists",
    "summarized_story": "The press is a critical agent for the protection of democracy and development and must be supported to enable them to effectively discharge their constitutional duties as the watchdog of the society, the National Human Rights Commission (NHRC) has said.\nNHRC Executive Secretary, Tony Ojukwu, made the remarks on the eve of the celebration of the 2022 World Press Freedom Day which is commemorated annually on May 3.\n“It must remain the conscience of the nation, telling the truth at times like this, to save our democracy,” said a statement on Tuesday by the NHRC spokesperson, Fatimah Mohammed.\nOjukwu, a Senior Advocate of Nigeria (SAN), said, “It is on this note that I commend UNESCO for championing the proposed World Press Freedom Day Global Conference scheduled to hold between May 2 and 5 in Punta Del Este, Uruguay.\nHe, therefore, urged the law enforcement agencies, including the police to, as a matter of necessity, intensify their investigations to unravel the circumstances surrounding the death of some Nigerian journalists, including that of late Vanguard newspaper, Tordue Salem, whose body was reportedly found in Abuja in 2021."
  },
  {
    "headline": "PHOTOS: President Buhari Receives Tinubu In Abuja",
    "summarized_story": "President Muhammadu Buhari on Tuesday received former Lagos State Governor, Asiwaju Bola Ahmed Tinubu in a private visit at his official residence at the State House.\nIt is not yet clear what the duo discussed.\nMr Tinubu is vying to fly the flag of the ruling All Progressives Congress in next year’s presidential elections.\nSee more pictures of the meeting below:"
  },
  {
    "headline": "PDP Congress Appeal Committee in Edo assures of fair hearing -",
    "summarized_story": "The People’s Democratic Party appeal panel for ward Congresses in Edo state has assured that the Panel will be fair to all parties.\nThe committee stressed that the party is committed to having a united front so as to be strong and viable alternative to the ruling All Progressives Congress, APC at the centre.\nThe committee was set up by the National Working Committee (NWC) of the Peoples Democratic Party (PDP) to look into the just concluded ward Ad-hoc Congresses, screening of national and state Assemblies aspirants and to consider appeals arising from the conduct of the congresses.\nThis was made known by the chairmen of the three committees during a press briefing at the party secretariat in Benin city.\nAccording to them, the Appeal Panel which was set up to look into grievances of party members will commence sitting immediately."
  },
  {
    "headline": "Fayemi joins APC presidential race, unfolds agenda -",
    "summarized_story": "Remarkably, Dr Fayemi kick-started the consultation in Owo, Ondo State, where he met with the Olowo of Owo, His Royal Majesty, Oba Ajibade Gbadegesin Ogunoye.\nThey scored Dr Fayemi high on these points and gave their blessings for his aspiration.\nHe had earlier held a major meeting with members of Ekiti State Traditional Council in Ado-Ekiti, with over 110 Obas in attendance.\nHe resigned as Minister to contest the governorship of Ekiti State for a second term in 2018.\nHe won the election and was inaugurated for a second term as Governor of Ekiti State on October 16, 2018."
  },
  {
    "headline": "Fire razes INEC office in Kauran Namoda LGA, Zamfara",
    "summarized_story": "The office of the Independent National Electoral Commission, INEC in Kauran Namoda local government area of Zamfara state has been gutted by fire.\nThis is contained in a statement released on Tuesday by the State Resident Electoral Commissioner, Professor Sa’idu Babura Ahmed.\nProfessor Babura said the incident occurred around 11.00pm on Monday 2nd May 2022.\nHowever, the building was extensively damaged as a number of fixed and movable office furniture were destroyed in spite of the best effort of the Zamfara State Fire Service and the spirited efforts of good Samaritans to contain the inferno.\nThe Resident Electoral Commissioner said the attention of the Nigeria Police has been drawn to the incident and a joint investigations by the force and fire service have commenced to ascertain the cause of the fire."
  },
  {
    "headline": "Emir of Ilorin asks Gov Abdulrasaq to declare for second term",
    "summarized_story": "The Emir of Ilorin and Chairman, Kwara state council of Chiefs, Dr Ibrahim Sulugambari has asked Governor AbdulRahman AbdulRazaq to go ahead with his second term aspiration.\nThis is coming on the heels of several calls by many political allies asking the governor to declare for a second term bid.\nThe Emir made the declaration when he led other dignitaries to pay Sallah homage on Governor AbdulRahman AbdulRazaq.\nDr Sulugambari declared that it is within the constitutional right of the governor to seek for a second term in office and encouraged him to do so.\nIn his response, Governor AbdulRahman AbdulRazaq commended the Emir for joining hands with the government to maintain peace in the state."
  },
  {
    "headline": "NDLEA Alleges ‘Billionaire Drug Baron’ Ukatu Imported N22bn Worth of Tramadol in a Month – Arise News",
    "summarized_story": "The National Drug Law Enforcement Agency, NDLEA, has said that ongoing investigation of a “billionaire drug baron” Chief Afam Ukatu, has led to the discovery of how the suspect imported into Nigeria in a single month, October 2019, two containers containing 1,284 cartons of tramadol with market value of over N22 billion.\nHe further said Ukatu owns pharmaceutical and plastic manufacturing companies, which he used as a cover to import illicit drugs into Nigeria.\nAccording to him, in the course of investigating the N3 billion tramadol saga between Ukatu and the Abba Kyari’s IRT team, NDLEA operatives have unearthed more evidences establishing how Ukatu has been importing large quantities of tramadol far above the approved threshold allowed into the country.\nHe noted that in one instance, Ukatu through his Mallinson Group of Companies imported into the country two-container loads of five different brands of tramadol in October 2019 through the Apapa ports in Lagos.\nHe said all the evidences so far gathered show that the imported tramadol brands were far above the threshold permitted to be imported into Nigeria, adding that: “No doubt the suspect will soon have his day in court.”"
  },
  {
    "headline": "Russia Unleashes Rockets in Mariupol, EU Readies Oil Sanctions",
    "summarized_story": "On Tuesday, the European Commission is expected to finalise a ban on buying Russian oil in an effort to squeeze Moscow’s war chest.\nReuters images showed volleys of rockets fired from a Russian truck-mounted launcher towards the sprawling Soviet-era steel complex from the outskirts of Russian-occupied Mariupol on Monday.\nRussia calls its actions in Ukraine a “special operation” to disarm Ukraine and protect it from fascists.\nEU SET TO SHUN RUSSIAN OILIn Brussels, the European Commission is expected to finalise a proposed sixth package of EU sanctions against Russia on Tuesday, including a possible embargo on buying Russian oil.\nKyiv says Russia’s energy exports to Europe, so far largely exempt from international sanctions, are funding the Kremlin war effort."
  },
  {
    "headline": "US: Potential Supreme Court Move to Overturn Abortion Rights Sends Protesters onto Streets",
    "summarized_story": "The bombshell draft U.S. Supreme Court decision suggesting the court may overturn the 1973 Roe v. Wade ruling legalizing abortion sent Democrats scrambling on Tuesday, with lawmakers and activists looking for some way to head off the sweeping social change.\nReuters was not immediately able to confirm the authenticity of the draft opinion.\n“Congress must pass legislation that codifies Roe v. Wade as the law of the land in this country NOW,” said Independent Senator Bernie Sanders.\nThe Politico report said a court majority was inclined to uphold Mississippi’s abortion ban and that there could be five votes to overturn Roe.\nThe news of the draft opinion stunned abortion providers."
  },
  {
    "headline": "Edwin Clark: Nigeria Has Not Been Steady Since The Civil War",
    "summarized_story": "Elder Statesman, Edwin Clark, joins ARISE News on #TheMorningShow to discuss and share his views on the call for an Igbo presidency."
  },
  {
    "headline": "‘Ambode Will Announce His Intentions Very Soon’- Olawale Oluwo",
    "summarized_story": "Former Commissioner of Energy & Mineral Resources and Chairman of the Akinwunmi Ambode Campaign Group; Olawale Oluwo speaks to ARISE News about Ambode’s intentions for the upcoming election.\nRelatedStories No Content Available"
  }
]