[
  {
    "headline": "The Senate on Wednesday approved Nigeria Police Trust Fund",
    "summarized_story": "The Senate on Wednesday approved the sum of N74,773,601,916.30 as the 2021 budget of the Nigeria Police Trust Fund.\nThe approval followed the presentation of the harmonised report of the Senate and the House of Representatives Committees on Police Affairs at plenary.\nChairman Senate Committee on Police Affairs, Senator Haliru Dauda Jika, presented the report.\nN988,279,006.05 out of the amount was earmarked for personnel cost; N10,027,610,310.25 for overhead expenditure; and N63,757,712,600.00 as capital expenditure.\nDetails later…"
  },
  {
    "headline": "Euro 2020 Golden Boot standings Cristiano Ronaldo",
    "summarized_story": "Cristiano Ronaldo remains favourite to win the Euro 2020 Golden Boot despite Portugal’s exit, while his biggest rivals are Belgium’s Romelu Lukaku and Czech Republic’s Patrik Schick.\nThe Portugal captain became the leading scorer in European Championship history when a brace in their opening game against Hungary moved him two clear of Michel Platini on 11, and he bagged another goal in a 4-2 defeat to Germany.\nThe 36-year-old has incredibly scored in five successive European Championships since his debut in 2004 and nine consecutive major tournaments having struck in each of his four World Cups, including four in 2018, but has yet to add an international Golden Boot to his astonishing CV.\nHowever, having fired blanks in their 1-0 defeat to Belgium in the last 16, Ronaldo is now left stranded on five goals and must hope his fellow contenders still left in the competition – including Belgium’s Romelu Lukaku (2 goals) – fail to catch him up.\nCzech Republic’s Patrick Schick has been a revelation at Euro 2020 and the Bayer Leverkusen striker is now Ronaldo’s closest challenger on four goals after netting his side’s second in the shock 2-0 victory over the Netherlands."
  },
  {
    "headline": "Petroleum Industry Bill, Mele Kyari, NNPC, Senate",
    "summarized_story": "The Group Managing Director of the Nigerian National Petroleum Corporation, Mele Kyari, will, on Thursday, brief the Senate on the Petroleum Industry Bill, 2021.\nLawan said the briefing was to help senators better informed on the technicalities and financial implications of certain provisions in the piece of legislation.\nThe Senate had, on Tuesday, received the report of the Joint Committee on Petroleum (Downstream); Petroleum (Upstream) and Gas Resources on PIB.\nHe said, “Before plenary tomorrow, the leadership of the Senate has decided to invite NNPC GMD to come and brief us in a closed session.\nIt would also regulate the oil industry and attract more investment to the sector, according to lawmakers."
  },
  {
    "headline": "Digital Creatives for Trendupp Awards",
    "summarized_story": "Since the advent of social media, it has moved from just a medium for chatting, to become a powerful tool for change.\nThrough social media, people now easily call out wrong practices, injustices, and have a voice in different situations.\nIt has also made connectivity instantaneous, birthing a new industry, with the ripple effect of digital professionals like; digital marketers, social media managers, cinematographers, photographers, content creators, brand influencers etc.\nTo celebrate these outstanding work by creatives, Trendupp Africa, a reward-based platform where Creatives receive support, publish exclusive contents and build direct relationships with their fans across Africa, recently announced its awards initiative -Trendupp Awards.\nShe has also won numerous awards for her Blog including: Blog of The Year at The Nigerian Blog Awards, Nigerian Blog of The Year at the 2014 ELOY Awards, Most Unique Voice in a Blog, Best Personal Blog, Most Humorous at the Nigerian Blog Awards, and City People Entertainment awards for Blogger Of The year 2015."
  },
  {
    "headline": "Digital Creatives for Trendupp Awards",
    "summarized_story": "Since the advent of social media, it has moved from just a medium for chatting, to become a powerful tool for change.\nThrough social media, people now easily call out wrong practices, injustices, and have a voice in different situations.\nIt has also made connectivity instantaneous, birthing a new industry, with the ripple effect of digital professionals like; digital marketers, social media managers, cinematographers, photographers, content creators, brand influencers etc.\nTo celebrate these outstanding work by creatives, Trendupp Africa, a reward-based platform where Creatives receive support, publish exclusive contents and build direct relationships with their fans across Africa, recently announced its awards initiative -Trendupp Awards.\nShe has also won numerous awards for her Blog including: Blog of The Year at The Nigerian Blog Awards, Nigerian Blog of The Year at the 2014 ELOY Awards, Most Unique Voice in a Blog, Best Personal Blog, Most Humorous at the Nigerian Blog Awards, and City People Entertainment awards for Blogger Of The year 2015."
  },
  {
    "headline": "How to create warm, cozy Living Room with colours",
    "summarized_story": "Therefore, use a creamy white for your living room to refresh and enhance a classic look.\nThe perfect off-white colour can act as a backdrop for your living room decor while creating a cozy living environment.\nMUSTARD YELLOWPlay with colours in your living room by painting your walls with a warm, mustard yellow.\nRICH REDMake a statement by selecting a rich, deep red for your living room walls.\nWhen sorting through living room colours to warm up your space, a pale shade of blue can appear cool, but still provide a calming atmosphere that is cozy and effortless."
  },
  {
    "headline": "How to create warm, cozy Living Room with colours",
    "summarized_story": "Therefore, use a creamy white for your living room to refresh and enhance a classic look.\nThe perfect off-white colour can act as a backdrop for your living room decor while creating a cozy living environment.\nMUSTARD YELLOWPlay with colours in your living room by painting your walls with a warm, mustard yellow.\nRICH REDMake a statement by selecting a rich, deep red for your living room walls.\nWhen sorting through living room colours to warm up your space, a pale shade of blue can appear cool, but still provide a calming atmosphere that is cozy and effortless."
  },
  {
    "headline": "Doting Celebrity Fathers",
    "summarized_story": "As we join the world to celebrate Father’s Day today, we are putting the focus on celebrity fathers who go the extra mile to be there for their children and show them off to the world.\nSome of the doting celebrity dads also recalled how they felt when they welcomed their first fruit, as well as the most exciting part of being a father.\nThe actor and politician doesn’t hesitate to show off his beautiful kids on social media.\nHe always gets his over four million fans excited with the way he dots and promotes his family on social media.\nAt every family time and fun time, Peter is never missing in action, as seen on his social media posts."
  },
  {
    "headline": "Sunday Igboho gives fresh update on planned Lagos rally, sends message to police",
    "summarized_story": "Sunday Adeyemo, a Yoruba nation activist popularly called Sunday Igboho, has dismissed reports that the mega rally scheduled to hold on Saturday in Lagos was cancelled.\nOduduwa Republic: Sunday Igboho set to shutdown LagosHe urged the Lagos State Commissioner of Police, Odumosu H. Olusegun to ensure that the protesters are protected.\nThe statement reads in part, ”This is to confirm to the general public that the Lagos State Mega Rally scheduled for this Saturday, 3rd of July 2021 will hold as planned.\n“Chief Sunday Igboho cannot stop this rally because it’s all the Yorubas that want the rally to hold and the Yoruba Nation is bigger than him”.\nOduduwa Republic: Yoruba nation rally holds in Abeokuta despite police ban [VIDEO]"
  },
  {
    "headline": "BREAKING: Bandits attack Ganduje’s convoy",
    "summarized_story": "There was a gun duel between security operatives attached to the convoy of Kano State Governor, Dr Abdullahi Umar Ganduje, and some heavily armed bandits along Shema in Katsina State on their way back to Kano from Zamfara State.\nAlthough Ganduje was not in the convoy, it came under attack by bandits who blocked Zamfara, Katsina and Kano Road, around Shema on Tuesday.\nGovernor Ganduje was in Zamfara State to attend the formal defection of Governor Bello Matawale of Zamfara into the All Progressives Congress (APC).\nHowever, after the occasion, he joined Jigawa State Governor, Muhammadu Abubakar Badaru, back to Kano.\nHowever, on their way back to Kano, the convoy came under heavy gun attacks from the bandits, but was repealed by the security in the Kano Government convoy."
  },
  {
    "headline": "Usifo Ataga: UNILAG breaks silence",
    "summarized_story": "The Vice Chancellor of University of Lagos, UNILAG, Prof. Oluwatoyin Ogundipe, has finally spoken on the controversy surrounding student, Miss Chidinma Adaora Ojukwu, who allegedly killed Usifo Ataga, Chief Executive Officer of SuperTV.\nHe disclosed that the university is handling the administrative aspect of the issue since the case has become a national matter.\nOn measures taken by the management of the university in handling her case, Ogundipe answered that due process was being followed.\n“Since the case has become a national matter that is being handled by the police, the university is handling the administrative aspect of the issue, ” UNILAG VC said.\nDAILY POST recalls that Chidnma was paraded by the police last week for the murder Ataga."
  },
  {
    "headline": "Court reinstates Osun High Court’s Justice Oloyede",
    "summarized_story": "A Federal High Court sitting in Abuja has on Tuesday reinstated Justice Olamide Folahanmi Oloyede of the Osun State High Court.\nDAILY POST recalls that Justice Oloyede was unjustly retired by the National Judicial Council (NJC) in 2016.\nHer retirement came when she was petitioned by the Osun Civil Societies Coalition for her failure to conduct herself in a manner preserving the dignity of her office, impartiality and independence of the Judiciary.\nThe NJC, in suspending Justice Oloyede, stated that it found that she had conducted herself in a manner inimical to the dignity of her office as well as impartiality and independence of the judiciary when she sent a petition against then Governor of the state, Rauf Aregbesola, and his deputy to the State House of Assembly.\nShe had also circulated the petition to 36 persons and organizations."
  },
  {
    "headline": "Nnamdi Kanu: Obiozor-led Ohanaeze dismisses statement by faction, threatens ‘impostors’",
    "summarized_story": "The Ohanaeze Ndigbo led by George Obiozor says it has not issued any statement on the re-arrest and re-arraignment of Nnamdi Kanu, leader of Indigenous People of Biafra (IPOB).\nHis reaction was coming after the Secretary-General of Chidi Ibeh-led Ohanaeze, Mazi Okechukwu Isiguzoro, issued a statement on Kanu’s arrest.\nOgbonnia warned mischief makers peddling the name of Ohanaeze Ndigbo to achieve selfish gains to desist from the shameful misadventure.\n“Ohanaeze Ndigbo led by Ambassador Professor George Obiozor has not issued any press statement on the matter.\n“Ohanaeze Ndigbo as the apex Igbo cultural organisation does not issue public statements in a hurry,’’ he stressed."
  },
  {
    "headline": "Supplementary budget scales second reading in House of Reps",
    "summarized_story": "By Tony Akowe, AbujaThe House of Representatives has passed for second reading the supplementary appropriation bill of N894.842 billion presented by President Muhammadu Buhari.\nThe supplementary appropriation bill was read for the first time on Tuesday.\nADVERTISEMENTLeading the debate on the need to pass the supplementary budget, House Leader, Rep. Alhassan Ado Doguwa said the request was based on two main subheads of health and Security and appeal to members to pass the bill into law.\nNo member of the House spoke against the passage of the supplementary budget as the bill eventually scaled second reading and has been referred to the House Committee on Appropriation.\nThe Speaker had on Tuesday assured that the House will pass the supplementary budget before it’s summer break commencing within the next two weeks."
  },
  {
    "headline": "A’Ibom 2023: The search for the people’s Governor",
    "summarized_story": "was the first public servant in Akwa Ibom state to dole out palliatives in cash and in materials to the people.\nOnofiok Luke has everything it takes to be the next Governor of Akwa Abasi Ibom state.\nHe is not an internationally recognized businessman; he only practiced law very briefly and later joined public service at a very young age.\nPolitical leadership at the level of Governor or President requires some experience in public service, as against total inexperience.\nThe people must not be made to feel privileged to be led by a particular governor; rather public service is always a privilege to the public servant."
  },
  {
    "headline": "DPR to clamp down on gas shops located at residential areas in A’Ibom",
    "summarized_story": "By Bassey Anthony, UyoThe Department of Petroleum Resources (DPR) in Akwa Ibom says it would clamp down on cooking gas shops located around residential areas in the state.\nOperations Controller of DPR, Victor Ohwodiasa, who disclosed this on Wednesday, said it was totally unsafe to situate gas shops, most of them illegal, close to people’s homes.\nADVERTISEMENT“It is unacceptable practice, we will definitely clamp on them, As a speak now, our men is on the way to check on the illegal gas stations and any one caught, we face the wrath of the law,” Ohwodiasa said.\nOhwodiasa said that the exercise would be a continuous until the department would be able to regularise those that are regularisable based on the safety considerations.\nHe warned that illegal gas shops that are not regularise would be shut permanently in the state."
  },
  {
    "headline": "Uba, Ozigbo emerge Anambra PDP Gov parallel candidates",
    "summarized_story": "Ozigbo scored 62 votes to beat his closest rival, Dr Obiora Okonkwo, who got 58 votes.\nADVERTISEMENTSenator Uche Ekwunife came third with 44 votes while former Vice President’s daughter Chidi Onyemelukwe got two votes.\nFour out of the aspirants were in attendance at the Paul University venue, including Chief Ubaka Okeke, Mr Godwin Ezeemo, Dr Ugochukwu Uba and Chief Jonny MaduaforkwaAlso, former member, Board of Trustees BoT of PDP, Chief Chris Uba and many other chieftains of the party, were in attendance.\nHowever, the Governor Ortom led Gubernatorial Electoral Committee which held another primary at the Prof Dora Akunyili Women’s Development Center, had stalwarts like former Governor Peter Obi, in attendanceOthers at the venue include Mr Val Ozigbo, Senator Uche Ekwunife Dr Obiora Okonkwo, Hon Chris Azubogu, Dr Godwin Maduka among others.\nEdo Deputy governor and Secretary of Anambra governorship primary Electoral Committee, Comrade Philip Shaibu, had announced three aspirants withdrew from the raceThe aspirants ,according to him, were, Mr Emeka Etiaba SAN, Dr Tony Nwoye and another he failed to mention."
  },
  {
    "headline": "Prophet TB Joshua’s successor yet unknown – SCOAN",
    "summarized_story": "By Job Osazuwa and Vera BasseyThe Synagogue Church of All Nations (SCOAN) has said successor of its late founder, Prophet Temitope Balogun Joshua, popularly known as TB Joshua has not been determined.\nReacting to questions from journalists, Gary Tonge, who spoke on behalf of the church, said an announcement would be made on who steps into the shoes of TB Joshua in due course.\nIn Prophet TB Joshua’s own words, ‘The beauty of our achievement is when we longer live and our achievement is still there, continuing to linger on in the eyes and ears of children yet unborn.\n“We wish to inform you that July 5 to July 11 is dedicated to a series of laying-to-rest activities tagged ‘Celebrating the life and legacy of Prophet TB Joshua (1963-2021) – not mine but God’s own.\nAnd there would be a thanksgiving service at the church on July 11 from 9am to 11am.”Prophet T.B."
  },
  {
    "headline": "How Interpol nabbed IPOB leader in Europe",
    "summarized_story": "But contrary to wild speculation that the IPOB leader was arrested in the United Kingdom, Daily Sun gathered that his interception took place in Czech Republic.\nA privileged source disclosed that the IPOB leader had travelled from England to Singapore for undisclosed reasons before heading to Czech Republic last Friday.\nAccording to Malami: “Self-acclaimed leader of the proscribed secessionist Indigenous People of Biafra (IPOB), Kanu, has been intercepted through the collaborative efforts of Nigerian intelligence and Security Services.\nEmmanuel said he had no doubt his brother’s arrest would be for the good of IPOB and the agitation for Biafra.\nIn his reaction to his arrest and subsequent re-arraignment, IPOB counsel, Aloy Ejimakor said Kanu is innocent until proven otherwise in court."
  },
  {
    "headline": "Restructure Nigeria to prevent civil war, Afeniferfe tells Buhari",
    "summarized_story": "By Chukwudi NwejePan Yoruba group, Afenifere, has, again, asked President Muhammadu Buhari to immediately send a bill on restructuring to the National Assembly to prevent ongoing agitations that could result in civil war and break up of the country.\nThe outcome of such deliberations is to be passed into law and made operational immediately,” the group said.\nIt called on the Federal Government to urgently put a halt to various acts of terrorism, kidnapping, herders/farmers clashes and the likes.\nIn the meantime, every community must be at alert to realise that they must defend themselves from bandits who seem to have declared war on Nigeria,” it said.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Sanwo-Olu re-launches Jigi-Bola",
    "summarized_story": "Lagos Governor, Babajide Sanwo-Olu, yesterday, re-launched the Jigi-Bola Free Sight and Hearing Aid Programme conceived 20 years ago and implemented during the tenure of former governor Bola Tinubu.\nSpeaking during the ceremony at Police College, Ikeja, Sanwo-Olu, said the re-launch of the Jigi-Bola initiative signals the commitment of the administration towards improving the wellbeing and welfare of Lagosians.\n“This initiative, which was named Jigi-Bola, under the Blindness Prevention Programme, offered free eye screening, free eye glasses and free surgical operations.\n“We understand that vision and hearing impairments can make life difficult but could be prevented with early care and intervention.\nThat is why we are re- launching the Jigi-Bola initiative as a free sight and hearing aid programme."
  },
  {
    "headline": "Govs, others who defect lack conscience –Wike",
    "summarized_story": "From Tony John, Port HarcourtRivers State Governor, Nyesom Wike, said governors and others defecting from PDP to APC lack conscience and cannot be trusted.\nWike stated this, yesterday, at the flag off of Woji-Aleto-Alesa-Refinery road and bridge with spur to the East-West Road at Woji town.\nRivers State will not join you.\nWhat Rivers State government got was N52 billion out of N78 billion.\nBut, in principle, N78 billion was approved, but was there any cash?"
  },
  {
    "headline": "Nnamdi Kanu Now Dot in a Circle, Arrested in Addis Ababa, Remanded",
    "summarized_story": "Kanu, according to the security source, was able to travel to many countries around the world because he holds a British passport.\nWith the money Kanu reportedly garnered through fundraising to “establish his phantom Biafran Republic”, according to the source, Kanu lived large, and that eventually proved to be his undoing.\nKanu returned yesterday to the court of Justice Nyako that had in late 2017 granted him bail.\nThough they pleaded not guilty to the charge, different judges, including Justice Nyako, who heard the case denied their bail.\nHowever, Justice Nyako soft-pedaled following Kanu’s deteriorating health and admitted him to bail to enable him to access quality medical care."
  },
  {
    "headline": "APC’s Good Performance made Matawalle Defect, Says Buhari",
    "summarized_story": "However, the deputy governor of the state, Mr. Mahdi Gusau, who refused to defect with Matawalle, has said the PDP could retrieve its mandate from the governor.\nSpeaking at a rally yesterday in Gusau, Matawalle said that he had been nursing the ambition of leaving his party, PDP, for several reasons.\nThe APC National Caretaker Committee Chairman and Yobe State Governor, Mai Mala Buni, congratulated Matawalle for defecting to the party.\nFor me, I will not defect and will continue as the deputy governor and do the job for which I am elected”The deputy governor also stated that nobody will sack him from office as the deputy governor as he has not committed any offence that could warrant his removal.\nSecondus acknowledged that the deputy governor, Gusau and eight members of the Zamfara State House of Assembly did not defect with the governor."
  },
  {
    "headline": "Senate Receives PIB Report, Begins Consideration Tomorrow",
    "summarized_story": "The Senate also passed an N329.963 billion statutory budget for the Federal Capital Territory (FCT) for the 2021 fiscal year.\nThe PIB report was laid during the plenary by the Chairman of the Joint Committee, Senator Sabo Mohammed.\nSpeaking after the report was laid, the President of the Senate, Dr. Ahmad Lawan, told his colleagues that the report would be considered tomorrow.\nThis was a sequel to the consideration of the report of the Committee on Federal Capital Territory on the FCT Appropriation Bill, 2021.\nHe said: “I will be meeting with the ad-hoc committee on PIB, today by 3 pm to tidy up some things."
  },
  {
    "headline": "Again, FG Shifts Deadline for NIN Verification to July 26",
    "summarized_story": "According to the committee’s report, active telephone lines as of May were 192 million, and a cumulative 95.6 million NIN owners submitted their NIN in the same month.\nIt stated that the trend will continue as long as bulk NIN Verification by NIMC is not in place.\nThe committee’s report said: “It is pertinent to mention that Bulk NIN Verification is still at the Proof-of-Concept (POC) stage since January 2021.\nNIMC needs to confirm a timeline when Bulk NIN Verification will commence.\nWithout Bulk NIN Verification, MNOs would have to resort to overnight Batch NIN Verification processing using the Single NIN Verification API or otherwise invite their customers to visit MNO outlets for Individual NIN verification using the same API."
  },
  {
    "headline": "NNPC to Borrow $3.8bn to Acquire Dangote Refinery Shares",
    "summarized_story": "· Says no petrol price increase in next two monthsEmmanuel AddehThe Nigerian National Petroleum Corporation (NNPC) is planning to borrow $3.8 billion to actualise its agenda of acquiring a 20 per cent stake in Dangote Refinery.\nHe said: “I am not sure Mr (Aliko) Dangote wants to sell his equity in the refinery.\n“Even for this Dangote Refinery, we are not going to take government money to buy it.\nWe are taking 20 per cent equity of the Dangote Refinery.\n“The Declaration of Cooperation (DoC) participants clearly continue to play an important and valuable role in accelerating the oil market rebalancing process,” he stated."
  },
  {
    "headline": "EXCLUSIVE: How IPOB Leader, Nnamdi Kanu Was Arrested By Nigerian Government",
    "summarized_story": "Nnamdi Kanu, the leader of the Indigenous Peoples of Biafra (IPOB), was picked up at a location in Africa, a top source in the Nigerian government has revealed to SaharaReporters.\nSaharaReporters had earlier reported that the family of Nnamdi Kanu asked the Federal Government not to manhandle their son, who is currently in the custody of the Department of State Services (DSS).\nSpeaking in Umuahia, the Abia state capital, Nnamdi Kanu's younger brother, Emmanuel Kanu said the IPOB leader stood on the path of truth and committed no crime to deserve any persecution.\nHe said the whole world is watching how the Nigerian Government will handle Kanu.\n\"My brother stood for the truth, and Heaven is on the part of anyone standing for the truth."
  },
  {
    "headline": "EXCLUSIVE: How IPOB Leader, Nnamdi Kanu Was Arrested By Nigerian Government",
    "summarized_story": "Nnamdi Kanu, the leader of the Indigenous Peoples of Biafra (IPOB), was picked up at a location in Africa, a top source in the Nigerian government has revealed to SaharaReporters.\nSaharaReporters had earlier reported that the family of Nnamdi Kanu asked the Federal Government not to manhandle their son, who is currently in the custody of the Department of State Services (DSS).\nSpeaking in Umuahia, the Abia state capital, Nnamdi Kanu's younger brother, Emmanuel Kanu said the IPOB leader stood on the path of truth and committed no crime to deserve any persecution.\nHe said the whole world is watching how the Nigerian Government will handle Kanu.\n\"My brother stood for the truth, and Heaven is on the part of anyone standing for the truth."
  },
  {
    "headline": "UPDATE: How Borno School Suspended 30 Nursing Students For Not Welcoming Buhari During President's Visit",
    "summarized_story": "At least 30 students have been suspended by the management of the Borno State College of Nursing and Midwifery for refusing to welcome President Muhammadu Buhari when he visited the state on June 17.\n\"It cost Zulum N350 million to mobilise the crowd they touted as Buhari's supporters,\" a source in Borno State government had told SaharaReporters.\n\"When President Buhari visited Lagos last week, they had to fly him over the city in a chopper because of a hostile crowd,\" another source had added.\nGovernor Zulum had earlier urged residents to show appreciation to President Buhari during his visit.\nIn February 2020, residents of the state booed the President as his convoy drove in and when it was leaving Maiduguri, Borno State, during a condolence visit."
  },
  {
    "headline": "UPDATE: How Borno School Suspended 30 Nursing Students For Not Welcoming Buhari During President's Visit",
    "summarized_story": "At least 30 students have been suspended by the management of the Borno State College of Nursing and Midwifery for refusing to welcome President Muhammadu Buhari when he visited the state on June 17.\n\"It cost Zulum N350 million to mobilise the crowd they touted as Buhari's supporters,\" a source in Borno State government had told SaharaReporters.\n\"When President Buhari visited Lagos last week, they had to fly him over the city in a chopper because of a hostile crowd,\" another source had added.\nGovernor Zulum had earlier urged residents to show appreciation to President Buhari during his visit.\nIn February 2020, residents of the state booed the President as his convoy drove in and when it was leaving Maiduguri, Borno State, during a condolence visit."
  },
  {
    "headline": "Nigeria’ll Be Destabilised If Kanu Is Killed, Ohanaeze Worldwide Tells Buhari-led Government",
    "summarized_story": "The Ohanaeze Ndigbo worldwide, Igbo sociocultural association, has urged the Muhammadu Buhari-led government to follow the law strictly in dealing with the case of Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB).\nThe Nigerian government had on Tuesday announced Kanu’s arrest and extradition to Nigeria to continue facing trial.\nIn a broadcast via Radio Biafra, Kanu boasted that the Nigerian court lacks the capacity to try him, describing the court as a Kangaroo court.\nCommenting on his rearrest, Ohanaeze Ndigbo worldwide in a statement by Okechukwu Isiguzoro, its Secretary-General, said Kanu’s refusal to listen to Igbo leaders’ advice led him to his present predicament.\nThe group advised the Nigerian government to handle the IPOB leader’s case carefully in order to prevent violent revolts from his followers."
  },
  {
    "headline": "JUST IN: Reps receive report on Petroleum Industry Bill",
    "summarized_story": "The house of representatives has received the report on the Petroleum Industry Bill (PIB).\nAdvertisementMohammed Monguno, chairman ad hoc committee on PIB, laid the report during plenary session on Wednesday.\n“That the house do receive the report of the ad–hoc committee on Petroleum Industry Bill on a bill for an act to provide legal, governance, regulatory and fiscal framework for the Nigerian Petroleum industry, the development of host communities; and for related matters, 2021 (HB.\nAfter the report was laid, Femi Gbajabiamila, speaker of the house, asked his colleagues to get a copy of the report ahead of its consideration.\nAdvertisementThe senate had received its own version of the report on Tuesday to be considered on Thursday."
  },
  {
    "headline": "JUST IN: Reps receive report on Petroleum Industry Bill",
    "summarized_story": "The house of representatives has received the report on the Petroleum Industry Bill (PIB).\nAdvertisementMohammed Monguno, chairman ad hoc committee on PIB, laid the report during plenary session on Wednesday.\n“That the house do receive the report of the ad–hoc committee on Petroleum Industry Bill on a bill for an act to provide legal, governance, regulatory and fiscal framework for the Nigerian Petroleum industry, the development of host communities; and for related matters, 2021 (HB.\nAfter the report was laid, Femi Gbajabiamila, speaker of the house, asked his colleagues to get a copy of the report ahead of its consideration.\nAdvertisementThe senate had received its own version of the report on Tuesday to be considered on Thursday."
  },
  {
    "headline": "Two shot dead as soldiers clash with #FixTheCountry protesters in Ghana",
    "summarized_story": "Two persons were shot dead following a clash between #FixTheCountry protesters and the military in Ghana.\nSubsequently, the youths took to the street to protest his death and demand that the perpetrators must be brought to book.\nThe soldiers had reportedly shot into the air to disperse the youths but the protesters were undeterred and were said to have charged at the soldiers.\nAbdul Yussuf, a farmer, was reportedly shot in the shoulder and chest.\nThe Ghana police said they have begun an investigation into the circumstances that led to the killing of the protesters and called for calm."
  },
  {
    "headline": "Two shot dead as soldiers clash with #FixTheCountry protesters in Ghana",
    "summarized_story": "Two persons were shot dead following a clash between #FixTheCountry protesters and the military in Ghana.\nSubsequently, the youths took to the street to protest his death and demand that the perpetrators must be brought to book.\nThe soldiers had reportedly shot into the air to disperse the youths but the protesters were undeterred and were said to have charged at the soldiers.\nAbdul Yussuf, a farmer, was reportedly shot in the shoulder and chest.\nThe Ghana police said they have begun an investigation into the circumstances that led to the killing of the protesters and called for calm."
  },
  {
    "headline": "Gunmen kill Zamfara lawmaker, kidnap son and driver",
    "summarized_story": "Muhammad Ahmad, lawmaker representing Shinkafi constituency in the Zamfara house of assembly, has been killed by gunmen.\nJafaru-Kaura said the gunmen also kidnapped the lawmaker’s son and driver.\nThe lawmaker’s son and driver were kidnapped by the bandits,’’ Jafaru-Kaura said.\nEarly in the month, more than 90 persons were reportedly killed when gunmen attacked Kadawa village in Zurmi LGA of the state.\nReacting to the incessant attacks in the state, Bello Matawalle, the governor, had lamented that the insecurity situation in Zamfara was getting worse."
  },
  {
    "headline": "From Supa Strikas to Startups, Tomi Davies’ approach to Angel Investing",
    "summarized_story": "With this knowledge, he co-founded the Lagos Angel Network in 2012, and a few years after, the African Business Angel Network (ABAN).\nAt Slush, they said we needed an African Angel network to create networks and to educate people on what angel investing is all about.\nI looked at Dotun Suleiman, he was my senior at King’s college and we formed the Lagos Angel Network together.\nIn Nigeria, I’ve been responsible for the South-South Angel Network, Abuja Angel Network and also in Lagos, the women’s only angel network called Rising Tide Africa.\nWe created the Diaspora Angel Network, to co-invest in the local angel networks."
  },
  {
    "headline": "Nigeria’s Cowrywise secures licence from the SEC",
    "summarized_story": "Cowrywise, a Nigeria-based wealth management startup, has received a licence to operate as a Fund/Portfolio Manager from the country’s capital markets regulator, the Securities and Exchange Commission (SEC).\nBefore now, the startup used a trustee structure to offer investment opportunities, in partnership with regulated investment management companies like Meristem.\nCurrently, the company boasts a wide range of investment products.\nThese assets cut across five investment company partners – including United Capital Asset Management, Meristem Wealth Management, Afrinvest Wealth Management, ARM Investment Managers and Lotus Capital.\n“Digitizing the investment management infrastructure is an important next step in our vision to democratize access to investment products,” the startup said."
  },
  {
    "headline": "Ghana kicks off first fully digital census in West Africa",
    "summarized_story": "Ghana has started its long-awaited fully-digital national census; the first-ever in West Africa.\nThe country has, every 10 years since 1981, conducted the Population and Housing Census (PHC) but was forced to postpone the 2020 census due to the outbreak of the Covid-19 pandemic.\nThe fully digital PHC is said to have cost the government $84 million, around 50% more than the last census.\nIt sees the West African nation join the list of African countries to collect national data electronically, an exclusive club that includes only Swaziland, Malawi, and Kenya.\nMeanwhile, South Africa is in line for its first-ever digital census."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Ghana’s digital census, Sabee by Facebook, Jetstream’s $3m seed",
    "summarized_story": "Good day,Today, I’m discussing:Ghana’s digital censusSabee by FacebookJetstream’s $3 million seed roundGhana’s digital censusGhanaian FlagAfter postponing its census last year because of the coronavirus pandemic, Ghana has commenced a digital census — the first of its kind in West Africa.\nThe digital census would accelerate plans for the rollout of identity cards proposed by President Nana Akufo-Addo in 2017.\nConsequently, Ghana joins the likes of Swaziland, Malawi, and Kenya as countries that have conducted a digital census.\nOn the surface, a digital census is a no-brainer in an increasingly digitised world, but it is not so straightforward.\nSabee by FacebookFacebook’s Nigerian team has revealed plans to launch Sabee, an educational app targeted at learners in the West African country."
  },
  {
    "headline": "Ghana-based Jetstream raises $3m to build tech solutions for Africa’s trade corridors",
    "summarized_story": "Ghana’s Jetstream has closed a $3 million seed round as it aims to build digital infrastructure for Africa’s trade corridors.\nPreviously, the company received pre-seed funding from Hustle Fund in San Francisco and C5 Capital in London through the PeaceTech accelerator.\nAs Addy told attendees at AB2020’s 2019 Tech in Ghana Accra event, Jetstream was initially started as a logistics company for cosmetics manufacturers in South Africa.\nIn November 2020, Jetstream added trade finance for customers who found it difficult to fill large purchase orders.\nAdvertisementIn addition to Port Tema, Jetstream counts an unnamed Asia-based global shipping line as a major customer and early adopter of its technology."
  },
  {
    "headline": "Nigerian fintech, Cowrywise, secures SEC’s licence to digitise investments in Nigeria",
    "summarized_story": "Nigerian Wealth management startup, Cowrywise Financial Technology Limited “Cowrywise”, has secured an asset management licence from the Securities and Exchange Commission (SEC).\nThe licence, dubbed the “Fund/Portfolio Management Licence”, gives companies the right to manage funds and investment portfolios on behalf of retail investors.\nWe’ve been developing this for some time and the SEC licence eliminates the regulatory obstacles to launching such a product,” he says.\nHowever, the requirements for SEC’s fund manager licence are more capital intensive.\nConsidering Cowrywise’s position as a constantly innovative fintech company, it is not clear if this rule would be adjusted specifically for fintech companies."
  },
  {
    "headline": "China grew economy on land reform, Nigeria can",
    "summarized_story": "Nigeria’s rigid traditional land tenure system and onerous land titling that excludes many from formal land ownership and also discourages investment in productive activities lend it easily to lessons from other countries with efficient land administration.\nAs done in other countries, Nigeria needs land and property ownership reforms that can unlock its huge stock of…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "#EndSARS to cost Nigerian insurers N20bn",
    "summarized_story": "The looting and vandalism that followed the #EndSARS protest that engulfed Nigeria in 2020 are estimated to cost the nation’s insurance industry N20 billion in claims and handling expenses.\nAt the moment, N5 billion claims has been paid, while a lot more are being processed and adjusted, the Nigerian Insurers Association (NIA), said.\nGaniyu Musa,…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Emergency! Nigeria needs jobs, jobs, jobs",
    "summarized_story": "As many as 23 million Nigerians, a third of the 69.7 million-strong labour force in Africa’s most populous nation, wake up every morning with no job to do.\nThat is the population of 35 of Africa’s 54 countries, and the number will continue rising as population growth continues to outpace output expansion.\nNigeria is expected…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Obaseki inaugurates 15-man c’ttee to screen political nominees, gives two weeks ultimatum – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, on Tuesday, inaugurated a 15-man committee, charged with the responsibility of screening political nominees that will be appointed into his cabinet.\nObaseki, during the inauguration ceremony at the Government House, Benin City, urged the committee, headed by Prof. Dennis Agbonlahhor, to submit its report on or before 15th of July, 2021.\nOthers are, Osayamwanbor Agbons; Matthew Iduoriyekemwen; Dr. (Mrs.) Bob Osazee; Prof Maureen Isoken Ebomoyi; Prof. Ahmed Uwubamwen; Hillary Otsu and Pastor Osagiede Joseph.\nWe believe that in the next two to three weeks, you will come with what we can work with,” he added.\nIn his response, the Chairman of the Committee, Prof. Agbonlahor said, “We will try as much as possible to deliver on our mandate within the stipulated time.”..."
  },
  {
    "headline": "Obaseki signs audit bill into law, to establish Audit Service Commission, Office of Auditor-General – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, on Tuesday, signed the Edo State Audit Bill 2021 into law to ensure accountability and transparency in governance.\nObaseki, while signing the bill at the Government House in Benin City, thanked the State House of Assembly for expeditiously passing the amendment bill into law.\n“So, the Audit Service Commission, when established, will be made up of reputable and credible persons who will ensure the right thing is done,” he added.\nEarlier, the Speaker of Edo State House of Assembly (EDHA), Hon.\nMarcus Onobun said, “We have passed the bill to repeal the Edo State Audit Law 2019 and enact the Edo State Audit Law 2021, which provides for the establishment of the Audit Service Commission and the Office of the Auditor-General of Edo State and Local Governments and other connected purposes.”..."
  },
  {
    "headline": "Ondo Riverine Communities Come Alive With Electricity Courtesy CNL, PIND, IRDC – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – The hitherto electricity elusive riverine Communities in Ondo State, recently came alive with sustainable electricity as NNPC/ Chevron Nigeria Limited(CNL) Joint Venture in conjunction with Partnership Initiative for Niger Delta ( PIND), Ilaje Rural Electricity Development Committee (IRDC) inaugurated a solar power electricity project.\nThe project, a Solar Power Mini Grid Energy Cabins’’ which would benefit no fewer than 200 residents in the communities was initiated by the IRDC and funded by NNPC/Chevron.\n“The communities should prioritise these projects and guarantee its security in order to charge the government to do more and extend such to other riverine communities to bring succour to them.\nNigerian Observer gathered that IRDC was a community-based organisation solely funded by NNPC/Chevron Nigeria Ltd.\nAt the moment, PIND is also working with other private sector investors interested in providing solar energy in the riverine communities (as a for-profit business) using this model for scale up."
  },
  {
    "headline": "Obaseki to hold solemn birthday on July 1, asks friends, others to donate to charities – Nigerian Observer",
    "summarized_story": "Obaseki to hold solemn birthday on July 1, asks friends, others to donate to charitiesShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, wishes to inform his friends, associates and well-wishers that he would be having a solemn birthday on July 1, 2021.\nThe governor would be spending the day reflecting on the challenges that our people face, pondering on how to make life more fulfilling for the ordinary man.\nFor friends, associates and well-wishers who are hoping to pay to advertise their congratulatory messages, he calls on them to channel the funding to two charities to support their efforts in improving the lives of theindigent and children with disabilities.\nThe charities are:S/NName of CharityAddress1Project ChariloveOpposite Central Hospital, Sapele Road, Benin City, Edo State2Isaac and Osar Aluyi Foundation for Children with Disabilities12b, Aibieyi-Akenzua Street, Off Uwagboe Avenue, Ugbowo, Benin CityThe governor appreciates the support and solidarity and thanks his friends, associates and well-wishers in advance for respecting his wishes, as they channel their energies and resources towards the vulnerable in society.\nOsaigbovo IyohaChief of Staff to the Governor of Edo State29th June, 2021..."
  },
  {
    "headline": "BREAKING: Zamfara lawmaker shot dead after defecting to APC",
    "summarized_story": "ADVERTISEMENTBandits have shot dead a member of the Zamfara State House of Assembly, Mohammed Ahmed, hours after he defected with Governor Bello Matawalle to the All Prigressives Congress (APC).\nMr Ahmed was reportedly killed by bandits along Sheme- Funtua Road in Katsina State.\nZamfara governor’s spokesperson, Yusuf Idris, said the deceased was the chairman, House committee on Appropriation, and represented Shankafi in the state’s assembly.\nMr Idris said the lawmaker was shot dead at Yan Kara in Sheme LGA of Katsina State while conveying his son to Kano to board a flight to Sudan.\nGovernor Matawalle left the Peoples Democratic Party (PDP) with all elected officials in the state except his deputy, Mahdi Aliyu, and a state lawmaker."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Rivers: LG Chairman Locks Out Workers Over Lateness",
    "summarized_story": "Chairman of Emohua local government area of Rivers State, Dr. Chidi Julius Lloyd, on Wednesday, locked out hundreds of civil servants from the council secretariat for reporting to work late.\nThe development came exactly one week after the chairman had set up his office under a mango tree in the council secretariat to monitor the ingress and degress of civil servants in the local government council.\nLEADERSHIP observed that civil servants who reported to work some minutes after 8:00am were not allowed access into the council secretariat by security personnel.\nWe must be responsible citizens of Emohua local government area.”In a related development, the chairman has said huge wage bills of the local government councils should not deter chairmen from embarking on meaningful projects.\n“We shall rebrand the local government area to make it possible for people to have enough space to attend events."
  },
  {
    "headline": "Rivers: LG Chairman Locks Out Workers Over Lateness",
    "summarized_story": "Chairman of Emohua local government area of Rivers State, Dr. Chidi Julius Lloyd, on Wednesday, locked out hundreds of civil servants from the council secretariat for reporting to work late.\nThe development came exactly one week after the chairman had set up his office under a mango tree in the council secretariat to monitor the ingress and degress of civil servants in the local government council.\nLEADERSHIP observed that civil servants who reported to work some minutes after 8:00am were not allowed access into the council secretariat by security personnel.\nWe must be responsible citizens of Emohua local government area.”In a related development, the chairman has said huge wage bills of the local government councils should not deter chairmen from embarking on meaningful projects.\n“We shall rebrand the local government area to make it possible for people to have enough space to attend events."
  },
  {
    "headline": "Anambra Guber: APGA Faction To Hold Another Primaries Thursday",
    "summarized_story": "The Jude Okeke-led leadership of the All Progressives Grand Alliance (APGA), has screened and cleared two aspirants for the July 1 gubernatorial primaries billed to hold on Thursday in Awka, the Anambra State capitalOne of the contestants, a member of the House of Representatives, Hon.\nChuma Umeoji, representing Aguata federal constituency in the National Assembly, was cleared ahead of the primaries.\nThe chairman of the screening panel, Mazi Daniel Iloabanafo Ikeh, who is also the APGA deputy national chairman (South), conducted the exercise.\nHe said being one of the strongest financiers of the party, Hon Umeoji has done well in contributing to the growth of the party.\nADVERTISEMENTNot forgetting that Anambra is one of the safest states in Nigeria, the national publicity secretary, Ikechukwu Chukwunyere, said the governorship primary will go ahead tomorrow in Awka."
  },
  {
    "headline": "Anambra Guber: APGA Faction To Hold Another Primaries Thursday",
    "summarized_story": "The Jude Okeke-led leadership of the All Progressives Grand Alliance (APGA), has screened and cleared two aspirants for the July 1 gubernatorial primaries billed to hold on Thursday in Awka, the Anambra State capitalOne of the contestants, a member of the House of Representatives, Hon.\nChuma Umeoji, representing Aguata federal constituency in the National Assembly, was cleared ahead of the primaries.\nThe chairman of the screening panel, Mazi Daniel Iloabanafo Ikeh, who is also the APGA deputy national chairman (South), conducted the exercise.\nHe said being one of the strongest financiers of the party, Hon Umeoji has done well in contributing to the growth of the party.\nADVERTISEMENTNot forgetting that Anambra is one of the safest states in Nigeria, the national publicity secretary, Ikechukwu Chukwunyere, said the governorship primary will go ahead tomorrow in Awka."
  },
  {
    "headline": "BREAKING: Bandits Kill Zamfara Assembly Member",
    "summarized_story": "A Member of the Zamfara State House of Asembly representing Shinkafi state constituency, Hon.\nMohammed G. Ahmed, has been killed by bandits along Sheme-Funtua road in Katsina State.\nAnnouncing his death, the Clerk of the Zamfara State House of Assembly, Alhaji Shehu Saidu Anka, said Ahmed was traveling on the road when he was shot dead by the bandits on Tuesday evening.\nHis funeral prayer was performed at Sheikh Ahmed Umar Kanoma Mosque by 11am on Wednesday morning.\nUntil his death, he was the chairman of the House Committee on Finance and Appropriation."
  },
  {
    "headline": "Nigeria standstill as Buhari’s only son, Yusuf marries his sweetheart in Kano",
    "summarized_story": "President Buhari’s son, Yusuf is getting married to, Zara Nasir Ado Bayero, the daughter of Emir of Bichi, Kano.\nSeveral governors, ministers, government officials and VIPs have been flying to Kano state for the wedding.\nThey are being hosted by the current Emir of Kano who is the older brother of the prospective bride’s father, Emir of Bichi.\nThe bride-to-be, Zara, is a 19-year-old graduate of Brighton University, UK.\nREAD ALSO: Nigerian Bishop makes a comprehensive list of…Her father is the fourth child of the late Emir of Kano, Alhaji Ado Bayero."
  },
  {
    "headline": "Nigerian Bishop makes a comprehensive list of adulterous pastors and politicians",
    "summarized_story": "A Nigerian Bishop, identified as Don Simon Osieme has compiled a comprehensive list of all adulterous pastors and politicians across Isoko land in Delta State.\nThe cleric took to his social media to share the list immediately after his children arrive safely in Texas, USA.\nAccording to him, the list contains profile cases of adultery perpetuated by pastors and politicians with whom, when, and where.\nHe wrote; ADULTERYMANIA SAGA VS THE HIDDEN EYES”Adultery by a wife in Isoko tradition is attempted murder and in some cases very close to me, first-degree murder.\nNo current Isoko House of Assembly member is on this list."
  },
  {
    "headline": "No graduate should be employed without certificate of national service – DG NYSC",
    "summarized_story": "Ukpono Ukpong, AbujaAll Employers of labour in the public and private sector have been warned against employing graduates without demanding for Certificate of National Service.\nThe Director-General, National Youth Service Corps (NYSC), Brig Gen Shuaibu Ibrahim, gave the warning yesterday at the opening ceremony of Corps Legal Aid Workshop, yesterday in Abuja.\nSpeaking further, he advised all employers to present the NYSC certificates of their existing employers to the scheme for authentication.\n“Would like to use this medium to remind all employers in the public and private sectors that it is mandatory to demand the Certificate of National Service or Exemption Certificate duly issued by the National Youth Service Corps before offering employment to any holder of Degree or Higher National Diploma.\nHe urged Legal Officers and Corps Lawyers to redouble efforts at enlightening the general public on the provisions of the NYSC Act."
  },
  {
    "headline": "Senate places 75% import duties on importation of syringes, needles",
    "summarized_story": "Tunde Opalana, AbujaThe Senate has ordered a hike in importation duties on syringes and needles into the country and therefore recommended 75 percent port duties.\nThe two directives were meant to protect local manufacturers, give them enabling environment to contribute to the revenue base of the nation and to reduce unemployment.\n“Importation of syringes and needles is killing local manufacturers making them to lay off staff and preventing them from contributing effectively to the economy.\nThis has been an impediment to local manufacturers attaining this status and preventing their being patronized by organisations using donor funds”.\n“The local manufacturers are actually the highest supplies of syringes and needles for hospitals."
  },
  {
    "headline": "Delta herbalist nabbed with two human skulls, passengers nabbed carrying human blood",
    "summarized_story": "A 60-year-old native doctor, Godfrey Akpudje, has been arrested with two human skulls by operatives of the Delta State Police Command.\nHe was immediately arrested and two human skulls were recovered from him.\nThe suspect confessed to have got one of the skulls from Osun State through a native doctor, who is now deceased.\nThe acting Police Public Relations Officer in Delta State, DSP Bright Edafe, told journalists that investigation was ongoing into the incident.\nDuring the search, three passengers were found with a container filled with fresh human blood."
  },
  {
    "headline": "Delta herbalist nabbed with two human skulls, passengers nabbed carrying human blood",
    "summarized_story": "A 60-year-old native doctor, Godfrey Akpudje, has been arrested with two human skulls by operatives of the Delta State Police Command.\nHe was immediately arrested and two human skulls were recovered from him.\nThe suspect confessed to have got one of the skulls from Osun State through a native doctor, who is now deceased.\nThe acting Police Public Relations Officer in Delta State, DSP Bright Edafe, told journalists that investigation was ongoing into the incident.\nDuring the search, three passengers were found with a container filled with fresh human blood."
  },
  {
    "headline": "EFCC Arraigns Man for N1.8m Job Scam in Edo – Daylight",
    "summarized_story": "By JUMOKE SANNIThe Economic and Financial Crimes Commission, EFCC, Benin Zonal Office on Tuesday June 29, 2021 arraigned Obawaeki Jude Isibor on a one-count charge bordering on obtaining by false pretence before Justice S.M.\nShuaibu of the Federal High Court sitting in Benin City.\nIsibor is alleged to have, through false representation, obtained the sum of N1,800,000 from one Omosigho Sarah Oduna.\nThe defendant pleaded not guilty to the charge when it was read to them.\nAttempt by the defence counsel, Patrick Wilson, to move an oral application for bail was rejected as the court asked that he files a formal application."
  },
  {
    "headline": "EFCC Arraigns Man for N1.8m Job Scam in Edo – Daylight",
    "summarized_story": "By JUMOKE SANNIThe Economic and Financial Crimes Commission, EFCC, Benin Zonal Office on Tuesday June 29, 2021 arraigned Obawaeki Jude Isibor on a one-count charge bordering on obtaining by false pretence before Justice S.M.\nShuaibu of the Federal High Court sitting in Benin City.\nIsibor is alleged to have, through false representation, obtained the sum of N1,800,000 from one Omosigho Sarah Oduna.\nThe defendant pleaded not guilty to the charge when it was read to them.\nAttempt by the defence counsel, Patrick Wilson, to move an oral application for bail was rejected as the court asked that he files a formal application."
  },
  {
    "headline": "UNIBEN student Izu shot dead after exam by suspected cultist",
    "summarized_story": "By Jethro Ibileke/BeninThe police in Benin, Edo State, have confirmed the killing of one Augustine Izu, a student in the department of Political Science of the University of Benin (UNIBEN), by suspected cultists.\nThe victim was allegedly shot dead on Tuesday, 29 June, at his off-campus hostel, at No.\nIt was gathered that he was shot by the yet-to-be identified gunmen, just few hours after finishing his examination.\nEye witnesses said that four masked gunmen stormed Izu’s apartment and fired at him, leaving him dead on the spot.\nOperatives of Ugbowo Police Division later evacuated the lifeless body of the deceased to an unnamed mortuary."
  },
  {
    "headline": "Buhari congratulates Xi on centenary of CPC",
    "summarized_story": "President Muhammadu Buhari has congratulated his Chinese counterpart, President Xi Jinping on the centenary of the founding of the Communist Party of China (CPC).\n“Guided by Xi Jinping Thought on Socialism with Chinese Characteristics for a New Era, the CPC, with General Secretary Xi Jinping at the core, has led the Chinese people to realize remarkable economic and social progress.\n“China has achieved the first centenary goal of building a moderately prosperous society, and has already embarked on a new journey to fully build a modern socialist country, which is the second centenary goal.\nAccording to him, this year also bears special significance to Nigeria-China relations, as it marks the 50th anniversary of the establishment of diplomatic ties between the two nations.\n“The past 50 years have witnessed an increasingly enhanced political trust, closer mutually beneficial economic and trade relations and cumulatively dynamic people to people exchange between Nigeria and China."
  },
  {
    "headline": "Igboho: I can’t fight the FG, I am just a campaigner",
    "summarized_story": "By Taiwo OkanlawonYoruba Nation agitator, Sunday Adeyemo, popularly known as Sunday Igboho said he does not have the power to fight the Federal Government.\nHe said his role is limited to leading an awareness campaign for a Yoruba nation being carved out of Nigeria.\nAs he put it, only God can fight the battle for the secession of the Yoruba race.\nIgboho said this in a video and said Yoruba in the diaspora are the ones contributing the money to fund his rallies across the SouthWest states.\nWe only want to tell Buhari that all we want is Yoruba Nation."
  },
  {
    "headline": "BREAKING: ‘No going back on Biafra struggle’ — IPOB breaks silence on Kanu’s arrest",
    "summarized_story": "The Indigenous People of Biafra (IPOB) has announced Nnamdi Kanu, the group’s leader, has been arrested, but says it is “not the end of the journey.”The group’s spokesman, Emma Powerful, issued a message to TheCable on Wednesday, urging IPOB members to “mobilize” and attend Kanu’s next court hearing on July 26.\n“IPOB will not relent in the pursuit of Biafra freedom.\nWe have crossed the Rubicon in our struggle for the restoration of Biafran Sovereignty.\nThere is no going back no matter the level of intimidation by our oppressors,” he added."
  },
  {
    "headline": "Igbos’ll React If Anything Happens To Nnamdi Kanu – Amaechi Warns Buhari",
    "summarized_story": "Following his arrest, Mbazulike Amaechi, a First Republic Aviation Minister, has advised the Federal Government not to mistreat Nnamdi Kanu, the leader of the Indigenous People of Biafra, IPOB.\nNdigbo, Amaechi said, would retaliate if anything happened to Kanu while he was in captivity.\nKanu was arrested on Sunday and repatriated to Nigeria to continue the criminal trial against him.\nHe was brought before Justice Binta Nyako-led Federal High Court yesterday for his trial.\nHe was brought before Justice Binta Nyako-led Federal High Court yesterday for his trial."
  },
  {
    "headline": "I Don’t Have Power To Fight Govt —– Sunday Igboho Speaks About Planned Lagos Rally [VIDEO]",
    "summarized_story": "Sunday Igboho, on the other hand, believes that God would fight for the Yoruba race’s separation.\nThe Oyo State indigene said this in a video, wherein he was seen addressing some of his followers.\nIn the video, Sunday Igboho reiterated that the planned Yoruba Nation rally will come up in Lagos on July 3.\nAccording to him, nobody has come out to stop him and his followers from storming Lagos for the rally, saying “whoever will not allow us to come to Lagos should do a video”.\nGod who is the head of the battle will fight for us."
  },
  {
    "headline": "You Are Shameless, Have No Conscience— Wike Blasts Governors Defecting To APC",
    "summarized_story": "Governor Nyesom Wike of Rivers State has lashed out at governors defecting from the Peoples Democratic Party, PDP, to the All Progressives Congress, APC.\nWike said state governors dumping PDP are shameless, hopeless, with no conscience.\nAccording to Wike, PDP helped them to win their elections through what he termed “technicalities.”Wike said: “People who could not win an ordinary election.\nOver the weekend, the Zamfara State Governor, Bello Matawalle dumped PDP for APC.\nAlso, the Ebonyi State Governor, Dave Umahi and Cross River State counterpart, Prof. Ben Ayade had defected to the APC."
  },
  {
    "headline": "ACF, Ohanaeze, others to FG: Treat Kanu’s trial with caution, rule of law",
    "summarized_story": "The AGF was quoted as saying“Fugitive Nnamdi Kanu” is back to Nigeria to face his trial.\nHe premised his position on the grounds that the IPOB leader violated the conditions of the earlier bail granted him by the court.\nACF urges fair trialMeanwhile, the Arewa Consultative Forum (ACF) has hailed the Nigerian government for re-arresting the IPOB leader even as it called for fair trial for the accused.\n“The fundamental rights of Nnamdi Kanu should be respected in compliance with the relevant articles of the constitution of the FRN.\n“We want to sound this as a warning that nothing should happen to our Supreme leader, Mazi Nnamdi Kanu or else there will be war."
  },
  {
    "headline": "Breaking: In Oyo, Makinde sacks Commissioners, others",
    "summarized_story": "Oyo state Governor Seyi Makinde on Tuesday announced the immediate dissolution of his cabinet.\nThose affected include according to the governor’s Chief Press Secretary include Chief of Staff (CoS) and 17 Commissioners.\nGovernor Makinde, then, expressed the gratitude of the government and the people of Oyo State to the Council members, and wished them well in their future endeavours.\nThe statement said: “His Excellency, the Governor of Oyo State, ‘Seyi Makinde, announced the dissolution of the State Executive Council, with effect from Tuesday June 29, 2021.\n“Governor Makinde, after a prolonged meeting of the Council, told members it was time to retool after two years."
  },
  {
    "headline": "Breaking: Call Gernot Rohr to order, he must stop discrimination among Super Eagles, FG tells NFF",
    "summarized_story": "The federal government has directed the Nigeria Football Federation (NFF) to call Super Eagles technical Gernot Rohr to order and ensure the Franco-German handler perform his duties optimally.\nMinister of Youth and Sports Development Sunday Dare who was visibly surprise that coach Rohr was not present with the home-based Super Eagles team when he visited on Tuesday evening wondered why Rohr will discriminate the class of Nigerians to coach in the team.\nThe Minister said, “Gernot Rohr was employed by Nigerians, therefore, he should not discriminate those he wants to coach.\nBoth home-based and foreign-based players exhibit great talents and they all must be respected and treated well.\n“NFF must call him to order and ensure he abides by the contract he signed.”Prior to the commencement of Super team B camp ahead of Mexico friendly clash few days ago, serving national technical director Austin Eguaveon was drafted by NFF to coach the home-based players, a development that has unsettled the country’s football community."
  },
  {
    "headline": "PDP NWC affirms disclaimer on illegal inauguration of local government chairmen in Niger State PDP -NigPilot",
    "summarized_story": "National Working Committee (NWC) of the Peoples Democratic Party (PDP) has affirmed the earlier statement and verdict by the North Central Working Committee disowning the unauthorized inauguration of some unidentified persons as local government area chairmen in the Niger state chapter of the party.\n“All PDP members in Niger State should take note and distance themselves from such persons as their activities are without the consent of our party.\n“Furthermore, the NWC cautions such individuals to henceforth desist from actions that undermine the authority of the North Central Zonal Working Committee, the NWC as well as the constitution of the PDP.\n“The NWC is in the final stages of its liaison with the National Reconciliation and Strategic Committee to resolve all the issues in line with the Constitution of the PDP.\n“The PDP family in Niger State is advised to await further instructions from the NWC."
  },
  {
    "headline": "Defection: Gov Matawalle has lost his memory – PDP Chairman -NigPilot",
    "summarized_story": "…Says PDP will bounce back in 2023National chairman of the Peoples Democratic Party, PDP, Prince Uche Secondus on Tuesday said Governor Bello Matawalle of Zamfara State must have lost his memory on how he came into office despite the fact that he lost the 2019 governorship election in the state.\nAddressing a press conference at the PDP national secretariat in Abuja, Prince Secondus said Governor Matawalle, who is on the verge of defecting to the ruling All Progressives Congress, APC, came into office on a statutory mandate given to the PDP by the Supreme Court.\nThe governors have one vote but we are after the people, the masses, the people who are suffering under this government.\n“It is a shame for all the governors that left the PDP for fear.\nThey were intimidated by the instrument of this government but am happy that the masses in their state especially in Zamfara none of them left.”"
  },
  {
    "headline": "Terrorism: NAF advocates for regional collaboration -NigPilot",
    "summarized_story": "The Hierarchy of the Nigerian Air Force (NAF) on Tuesday said that there is a need for enhanced regional cooperation in the fight against insurgency and terrorism in the West African sub-region.\nIt added that the Armed Forces of Nigeria (AFN) and other armed forces in the region must synergize their efforts in view of the transnational nature of terrorism and its impact on the security of the entire region.\nHe applauded the Senegalese Armed Forces for always being on hand to collaborate with the Nigerian Air Force (NAF) whenever the need arises.\nThe Inspector-General of Senegalese Armed Forces (SAF), General El hadji Daouda Niang said he was in Nigeria to seek collaboration as well as strengthen cooperation between the SAF and the AFN.\nHe commended the NAF and other Services for their commitment to Nigeria’s internal security as well as the regional security of West Africa."
  },
  {
    "headline": "2021 UTME: JAMB denies using wrong syllabus, links performance to ill-preparation -NigPilot",
    "summarized_story": "Joint Admissions and Matriculation Board, JAMB, has said that all the 2021 Unified Tertiary Matriculation Examination, UTME, were based on texts prescribed for the examination in its syllabus.\nJAMB was reacting to the candidates’ allegation that the mass failure in the 2021 UTME was as a result of the Board using the old syllabus in setting its questions.\n“The truth of the matter is that all Unified Tertiary Matriculation Examination (UTME) questions are based on texts prescribed for the UTME in its syllabus.\n“For instance, in the 2021 UTME, 1, 415,501 registered for both UTME/DE.\nOut of this figure, 1,340,003 candidates registered for UTME and 75, 498 registered for DE."
  },
  {
    "headline": "Zamfara Lawmaker Killed After Welcoming Matawalle To APC",
    "summarized_story": "Bandits have killed the member representing Shinkafi constituency in the Zamfara State House of Assembly Muhammad Ahmad.\nAhmad was killed on Tuesday night on his way to Kano after attending a rally to welcome Governor Bello Matawalle of Zamfara State and members of the State House of Assembly to the ruling All Progressives Congress (APC).\nThe Director-General of Media and Publicity in the Zamfara State House of Assembly Mustapha Jafaru confirmed the incident to Channels Television.\nREAD ALSO: Bandits Kill 26 In Deadly Attack On Zamfara StateREAD ALSO: 12 Farmers, 10 Others Killed As Bandits Attack Zamfara CommunitiesBanditry Taking ‘Ugly Dimensions’Banditry and kidnappings have become commonplace in Zamfara State.\nIn June, scores were killed by the marauders despite efforts by security agencies and repeated assurances from the government."
  },
  {
    "headline": "Guarantee Nnamdi Kanu’s Safety, World Igbo Congress Tells FG",
    "summarized_story": "The World Igbo Congress (WIC) is calling on the Nigerian authorities to ensure the safety of the self-acclaimed leader of the proscribed Indigenous Peoples of Biafra (IPOB) Nnamdi Kanu, saying the rights of the secessionist leader must be protected.\nKanu who jumped bail in 2017 was rearrested and brought back to Nigeria on Tuesday.\nBut the World Igbo Congress in a statement signed and issued by its chairman Anthony Ejiofor and spokesperson Basil Onwukwe, urged the federal government to treat the IPOB leader according to universally accepted laws.\n“The UK government needs to investigate the collusion of any other country or party in this saga,” the Igbo group further stated.\nOn the other hand, the Igbo has been subjected to massive shoot-at-sight order, arrests and abduction."
  },
  {
    "headline": "Kanu’s Arrest Not End Of Biafran Affair, Referendum Must Hold – Coalition Of Northern Groups",
    "summarized_story": "The Coalition of Northern Groups has said that the arrest of Nnamdi Kanu, leader of the proscribed Indigenous People of Biafra (IPOB), is not the end of the Biafran agitation.\n“Nobody should make the mistake of assuming that the arrest is anywhere near the end of the Biafran affair.\nREAD ALSO: Court Gives DSS Permission To Remand Nnamdi KanuThe group said it received the news of the arrest and repatriation of Nnamdi Kanu with mixed feelings of apprehension and appreciation.\nThe IPOB leader is expected to be re-arraigned before the Federal High Court for the continuation of his trial.\nMr Kanu has repeatedly called for the breakaway of a significant chunk of southern Nigeria to form the Republic of Biafra."
  },
  {
    "headline": "Terrorism: Threat To One Country Is Threat To Global Peace – Monguno",
    "summarized_story": "The National Security Adviser (NSA), Major General Babagana Monguno (Rtd), has stated that in order to deal decisively with the complex nature of terrorism and other transnational organized crimes, the international community must see the threat of terrorism to a particular country as a threat to global peace and security.\nGeneral Monguno said terrorism has continued to manifest itself as a vicious and relentless global threat, recognizing no border, nationality, and all religions.\nHe noted that terrorism has become a contemporary weapon of violence for non-state actors in this era of globalization.\n“I can say with total conviction that apart from pandemics, natural disasters and the climate itself, today the greatest threat to the existence of human race is the global scourge of terrorism” the NSA stated.\nThe NSA expressed President Buhari’s commitment to working with all nations, not just those in the sub-region and the African continent but the entire international community."
  },
  {
    "headline": "Putin Rejects Mandatory COVID-19 Jabs As Russia Sees Record Deaths",
    "summarized_story": "President Vladimir Putin on Wednesday said he was opposed to mandatory coronavirus vaccinations for Russians but urged the jab-sceptic population to get inoculated, as his country battles a deadly third wave.\n“I do not support mandatory vaccinations,” the Russian president said.\nNo lockdownSurveys show that Russians are particularly sceptical of the country’s homegrown jabs — Sputnik V, EpiVacCorona, CoviVac and the one-dose Sputnik Light.\nAsked Wednesday if he supported a new lockdown, Putin said regional authorities were instead promoting localised mandatory vaccinations and other measures to avoid introducing new quarantines.\nUnder a broader definition for deaths linked to coronavirus, statistics agency Rosstat at the end of April said that Russia has seen at least 270,000 fatalities."
  },
  {
    "headline": "Arraignment of suspected killers of UNILORIN undergraduate postponed",
    "summarized_story": "The proper arraignment of the eight suspects arrested in connection with the rape and murder of a 300 level University of Ilorin undergraduate, Blessing Olajide could not commence on Wednesday due to the inability of three of the defendants to have legal representation.\nEight suspects including accomplices were arrested by operatives of the Department of the State Security (DSS) in connection with the crime.\nThey were arraigned before Justice Ibrahim Yusuf of the Kwara state high court, Ilorin.\nThree of them did not have legal representation and consequently stalled the proper arraignment.\nThe proper arraignment is now to take place on the 6th of July when the three remaining suspects are expected to have legal representation."
  },
  {
    "headline": "3 PDP Senators defect to APC at Senate plenary",
    "summarized_story": "Senators representing Zamfara North and Zamfara West, Sahabi Yau and Lawali Anka have joined their Zamfara Central counterpart, Mohammed Gusau in defecting to the All Progressives Congress at Wednesday’s Senate plenary.\nThe letter of their resignation from the Peoples’ Democratic Party was read at Wednesday’s senate plenary presided over by the President of the Senate, Ahmad Lawan.\nThe Zamfara lawmakers explained in separate letters that their decision was due to the collapse of internal democracy and factionalisation of the party at all levels in the State.\nAdvertisementThe Senate President also read the defection letter of Delta North Senator, Peter Nwaoboshi from the PDP to the APC.\nThis development now puts the APC in overwhelming majority with 70 senators and the PDP with 38 while the Young Progressives Congress has only Ifeanyi Ubah, who represents Anambra South."
  },
  {
    "headline": "Yahaya Bello approves establishment of Kogi State Youth Development Commission",
    "summarized_story": "Governor of Kogi State Yahaya Bello has granted approval for the Constitution of Kogi State Youth Development Commission.\nYahaya Bello approves establishment of Kogi State Youth Development CommissionThis is contained in a statement issued by the Secretary to the State Governor Folashade Ayoade on Tuesday.\nAdvertisementThe Governor said the establishment of the commission is in line with Section 6:1:2 which also includes the implementation of sustainable youth policy and other matters related."
  },
  {
    "headline": "Hong Kong Security Law Has ‘Decimated’ Freedoms, Says Amnesty",
    "summarized_story": "Authorities in Hong Kong are using the national security law that China imposed a year ago to crack down on legitimate dissent, “decimate” the territory’s freedoms and create a climate of fear, Amnesty International said in a report released on Tuesday.\nThe broadly-worded National Security Law (NSL) punishes activities deemed subversion, terrorism, collusion with foreign forces and secession with up to life in prison.\nIn November, four pro-democracy members of the territory’s legislature were disqualified from their seats in the chamber – accused of ‘endangering national security‘.\n“In one year, the National Security Law has put Hong Kong on a rapid path to becoming a police state and created a human rights emergency for the people living there,” Yamini Mishra, Amnesty International’s Asia-Pacific regional director, said in a statement.\nIt found that the government had “repeatedly used ‘national security’ as a pretext to justify censorship, harassment, arrests and prosecutions”."
  },
  {
    "headline": "Dozens Dead as Canada Heatwave Shatters Records",
    "summarized_story": "Dozens of people have died in Canada amid an unprecedented heatwave that has smashed temperature records.\nPolice in the Vancouver area have responded to more than 130 sudden deaths since Friday.\nThe heatwave is due to a dome of high pressure hovering over the north-western US and Canada.\nThe suburb of Burnaby, meanwhile, reported at least 34 sudden deaths and the Surrey area recorded 38.\nThe country’s weather service, Environment Canada, has issued heat warnings for the provinces of British Columbia and Alberta, along with areas of Saskatchewan, the Northwest Territories and Manitoba."
  },
  {
    "headline": "At 100, China’s Communist Party Looks to Cement Its Future",
    "summarized_story": "For China’s Communist Party, celebrating its 100th birthday on Thursday is not just about glorifying its past.\nYet in marking its centenary, the Communist Party is using this past — selectively — to try to ensure its future and that of Xi, who may be eyeing, as Mao did, ruling for life.\nTiananmen Square, where Mao proclaimed the founding of communist China in 1949, is no longer a home for student protesters with democratic dreams.\nOn Thursday, the plaza in the center of Beijing will host the nation’s major celebration of party rule.\nThe anniversary marks a meeting of about a dozen people in Shanghai in 1921 that is considered the first congress of the Chinese Communist Party — though it actually started in late July."
  },
  {
    "headline": "Tigray Fighters in Ethiopia Reject Ceasefire as ‘Sick Joke’",
    "summarized_story": "The arrival of Tigray forces in the regional capital, Mekele, on Monday was met with cheers.\nTigray forces are now in control of much of the region after a major counteroffensive with mass popular support, International Crisis Group analyst William Davison said in a statement.\nBut the Tigray forces’ talk “indicates how distrustful they are of the cease-fire,” Aly Verjee, a senior adviser at the United States Institute of Peace, told AP.\nShe urged Ethiopia to lift a “communications blackout” on Tigray and said forces from the Amhara region must lift checkpoints on key roads for aid delivery.\nEthiopia has said the cease-fire is in part for the delivery of aid but will last only until the end of the crucial planting season in Tigray — which is in September."
  },
  {
    "headline": "NNPC to Borrow $3.8bn to Acquire Dangote Refinery Shares",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) is planning to borrow $3.8 billion to actualise its agenda of acquiring a 20 per cent stake in Dangote Refinery.\nHe said: “I am not sure Mr (Aliko) Dangote wants to sell his equity in the refinery.\n“We started this process long before Dangote started his refinery project.\n“Even for this Dangote Refinery, we are not going to take government money to buy it.\nWe are taking 20 per cent equity of the Dangote Refinery."
  }
]