[
  {
    "headline": "ASUU strike: Presidential primaries can’t hold in Abuja, NANS declares",
    "summarized_story": "The National Association of Nigerian Students on Sunday declared that no political party will hold a convention to select any presidential candidate in Abuja.\nNANS President, Sunday Asefon, made this known in a statement made available to our correspondent.\nThe ruling All Progressives Congress is also reported to have considered Abuja for its presidential primary later this month.\n“Let me say without mincing words, the two major political parties should forget any political gathering in Abuja who elsewhere except there is a solution to the lingering ASUU strike.\nThe union had embarked on a nine-month strike in 2020 before it was called off in December of that year."
  },
  {
    "headline": "2023: Vote out bad governance, Atiku tells Nigerian workers",
    "summarized_story": "While praising the resilience and determination of Nigerian workers, despite the myriad of man-made challenges confronting them, the presidential aspirant promised that if voted to power in 2023, he will ensure better working conditions and create employment opportunities for jobless Nigerians.\nThe statement read, “Dear Nigerian workers, I will like you to know that I feel your unbearable pains and pang of hunger, hyperinflation, mass unemployment and insecurity challenges you encounter in your daily lives.\n‘I wish to let Nigerian workers know that I feel their pains and would do the utmost to better their lots if given an opportunity to lead the country.\nYou need not be forlorn; the time is ripe to vote out bad governance, and Nigerian workers should lead the way with their voter’s cards at the next polls to ensure the return of better days.\n“I urge Nigerian workers to keep hope alive and cultivate a new spirit of patriotism geared towards nation-building and peace."
  },
  {
    "headline": "NNPP decries rising wave of insecurity in Nigeria",
    "summarized_story": "…demands justice for party member Killed in BayelsaJohn Alechenu, AbujaThe New Nigeria People’s Party, (NNPP) has condemned the rising spate of killings across Nigeria, describing it as a threat to the country’s democracy.\nNational Chairman of NNPP, Prof. Rufai Ahmed Alkali while reacting on behalf of the Party to the recent assassination of a member of NNPP in Bayelsa State, Hon.\nFrank Oputu was a former Chairman of the Conference of the Nigeria Political Parties ( CNPP) and Inter-Party Advisory Council (IPAC) in Bayelsa State, who until his murder, was an active member of the NNPP.\nOputu, who prior to joining NNPP, was a factional State Chairman of the All Progressives Congress, (APC) was killed in his residence in Yenegoa, the state capital.\n“We received with shock news of the death of one of our active members in Bayelsa state, the late Sunday Oputu."
  },
  {
    "headline": "Cartoon: Sarge and the suspicious cook",
    "summarized_story": ""
  },
  {
    "headline": "Drug War: NDLEA intercepts N1.1bn travellers’ cheques, 10.89kg Cocaine at Lagos airport",
    "summarized_story": "In the same vein, operatives of NDLEA at the airport have foiled attempts by drug traffickers to smuggle into Nigeria 10.89kilograms of cocaine through a Qatar Airways flight.\n“The illicit drug was hidden in seven children’s duvets packed in an unaccompanied bag from Brazil.\nMeanwhile, raid operations in Kaduna, Ondo and Akwa Ibom states have led to the seizure of about 2,000kg of Tramadol, Codeine, Cannabis and Heroin.\n“While commending the officers and men of the MMIA, Ondo, Akwa Ibom and Kaduna Commands of the Agency for the seizures and arrests in the past week, Chairman/Chief Executive of NDLEA, Brig.\nGen. Mohamed Buba Marwa (Retd) charged them and their compatriots across the country to remain steadfast and vigilant in their areas of responsibility.”Vanguard News Nigeria"
  },
  {
    "headline": "2023: Survival is almost impossible for many families in Nigeria, says APC stalwart, Ikya; joins Benue guber race",
    "summarized_story": "…promises expanded earning opportunities for youths, women, unemployedBy Peter Duru, MakurdiAn All Progressives Congress, APC, stalwart, Mr Terlumun Ikya has joined the Benue state governorship race with a promise to expand the existing earning opportunities for the youths, women, the unemployed and underemployment in the state.\n“Therefore, we must take important, deliberate and decisive actions to raise the basic quality and standards of living for our dear people of Benue by expanding existing earning opportunities for the youth, women, unemployed and underemployed.\n“Despite these hardships, with the help of Almighty God, our people have persevered but, we cannot rely on prayer alone.\nWe must act now to preserve and build on the foundational work of our forefathers as well as our past and present leaders.\n“Beyond our thinking, we must find meaningful ways to engage women, the youth, unemployed and underemployed by creating educational pathways to feed into an industrialized Benue State by emphasizing Technical Education and introducing Information Technology to our classrooms."
  },
  {
    "headline": "Eid-el-Fitr: IGP secures prayer grounds, felicitates with Muslims",
    "summarized_story": "Luminous Jannamike, AbujaAhead of the 2022 Eid-el-Fitr celebrations, the Inspector-General of Police, Usman Alkali Baba, has ordered Assistant Inspectors-General of Police and state Commissioners of Police to ensure security in all prayer grounds and other public places nationwide.\nThe IGP said, on Sunday, Nigerians must, however, cooperate with the police to maintain a more secure public and social space for the celebration.\nIn a statement by the Force Public Relations Officer, CSP Olumuyiwa Adejobi, the police expressed its readiness to intensify security at prayer grounds, recreation centres, highways, financial institutions and other sensitive locations.\nAdejobi said, “The IGP has ordered heavy nationwide deployment of Police officers, especially intelligence operatives, traffic officers and other operational assets of the Force for adequate security ahead of the Eid-el-Fitr celebration and beyond.\n“The IGP equally orders that adequate priority be accorded to Eid prayer grounds, highways, recreational centres, financial institutions especially ATM and POS points, to safeguard religious celebrations and financial transactions during the festive period."
  },
  {
    "headline": "May Day: TUC identifies insecurity as major challenge confronting Nigerian workers",
    "summarized_story": "Chairman of TUC Kaduna State, Comrade Abdullahi A Danfulani, on Sunday, in Kaduna, described insecurity and hunger as major challenges confronting Nigerian workers.\nIn a press conference to herald the Workers’ Day celebration, Alhaji Danfulani, however, urged workers and Nigerians to continue to pray for peace, unity and love as the challenges facing the country would soon be a thing of the past.\nHe added that following the outbreak of COVID-19, the congress had always marked the Workers’ Day on a low key, with the 2022 edition marked same way.\nAccording to him, other activities organised by TUC to mark the day, include Juma’at Mosque prayers on Friday April 29 and church prayers on May 1.\n“We are getting soft loans from workers to start small business around houses that won’t affect their work,” he added."
  },
  {
    "headline": "BREAKING: Soludo’s media manager dies days after govt appointment",
    "summarized_story": "Mr Joe Anatune, image manager of Anambra State Governor, Prof Chukwuma Soludo, and leader of his media team during last year’s election, has been announced dead.\nHe was recently appointed on April 19, 2022, as the MD/CEO of Anambra State Signage and Advertising Agency by Governor Chukwuma Charles Soludo.\nMeanwhile, Prof Soludo has confirmed the death of Anatune, while also expressing shock and disbelief over the news.\nHe said: “Soludo described Joe Anatune as one of the foremost Apostles of the Soludo project with an uncommon strength and courage to deliver on any given assignment.\nThe government and the good people of Anambra State will sorely miss Joe Anatune,” Aburime said."
  },
  {
    "headline": "How IPOB, ESN is promoting insecurity in Nigeria – Nigerian Army",
    "summarized_story": "The Nigerian Army has accused the Indigenous People of Biafra, IPOB, and the Eastern Security Network, ESN, of using fake pictures of soldiers to promote insecurity in the country.\nGen. Onyema Nwachukwu, the spokesman of the Nigerian Army, said IPOB used photographs of fake soldiers arrested in Lagos State to push propaganda and encourage insecurity in Nigeria.\nIn a statement he issued yesterday, Nwachukwu said the photographs were attempts to malign the Nigerian Army.\nHe said: “The Nigerian Army has been notified of malicious disinformation and falsehood peddled by one Solomon Okafor of Radio Biafra London, making the rounds in the social media.\n“Members of the public are, therefore, urged to disregard this mindless and irresponsible propaganda clearly emanating from IPOB, aimed at promoting insecurity in the country.”Severally, IPOB had been linked to insecurity in the South-East."
  },
  {
    "headline": "IPAC rejects drug integrity tests on politicians",
    "summarized_story": "Yabayi Sani, the National Chairman, Inter-Party Advisory Council (IPAC), has disagreed with the proposal by the National Drug Law Enforcement Agency (NDLEA) that aspirants be made to undergo drug integrity tests as part of screening requirements for seeking elective offices in the 2023 general elections.\nIn a statement, the IPAC National chairman described the proposal as outrageous, outlandish, preposterous, despicable and a deliberate attack on the sensibilities of lovers of democracy in the country.\nDAILY POST recalls that the NDLEA, recently proposed that political parties should carry out drug tests on all aspirants seeking to contest political offices on their platforms in the 2023 general elections.\nAccording to the IPAC, “The awkward proposal portrays politicians as drug addicts who must be certified fit to run for various elective offices by the agency.\nIt is reprehensible and unacceptable.”He stressed the need for the NDLEA to tender an apology and advised the anti-narcotic agency to desist from impugning the character and integrity of politicians, including those contesting for presidency, who he described as “patriotic and highly respected”."
  },
  {
    "headline": "May Day 2022: ‘We still have pensioners collecting only N4,000 monthly’ – Yobe NLC",
    "summarized_story": "Yobe State Council of the Nigeria Labour Congress, (NLC), has called for the harmonization and upward review of pension in the State.\nIt said some pensioners were still collecting N4,000 monthly.\nChairman of the Council, Comrade Muktar Musa Tarbutu made the call while briefing newsman on this year’s May Day celebration in Damaturu.\nWhile commending the Yobe State government for its prompt payment of pension and gratuity in the State despite economic challenges, the Chairman described as inadequate the monthly disbursement of N100 million for the payment of pension and gratuity of retirees.\n“The Congress enjoined government to implement the harmonized 33 percent pension increase in the State, as well as upward review of hazard allowances for fire fighters in the State”, Tarbutu appealed."
  },
  {
    "headline": "IPOB using propaganda to malign Nigerian army – Nwachukwu",
    "summarized_story": "The Nigerian Army, says members of the proscribed Indigenous People of Biafra (IPOB) are using pictures of fake soldiers arrested by Nigerian army troops recently to malign the institution.\nThe Director, Army Public Relations, Brig.-Gen. Onyema Nwachukwu, said this in a statement on Sunday in Abuja.\nHe said the said Okafor also alleged that about 87 per cent of Nigerian soldiers were kidnappers and bandits.\nNwachukwu said the said report was a creation of IPOB/ESN social media foot soldiers, with intent to malign the Nigerian army.\n“Members of the public are therefore urged to disregard this mindless and irresponsible propaganda clearly emanating from IPOB, aimed at promoting insecurity in the country,” he said."
  },
  {
    "headline": "Sule, JNI, NSCIA felicitates with Muslims on Eid-el-fitri",
    "summarized_story": "By Linus Oota, Lafia with Agency ReportNasarawa State Governor, Engr Abdullahi Sule has felicitated with all Muslim faithful in the state, Nigeria and across the globe on the occasion of this year’s Eid-el-fitri.\nGovernor Sule in a statement he personally signed enjoined all Muslims to remain steadfast in applying the virtues of Ramadan by adhering to sustained supplication, hospitality and good neighbourliness.\nHe urged the people to sustain the spirit of sharing as cultivated during the holy month.\nA statement issued by the Director-General of JNI, Dr Khalid Aliyu, on Saturday in Kaduna, stated that the Ramadan fasting would end either on May 1 or May 2 and would be followed by Eid-el-Fitri festivities.\nThe NSCIA called on Muslims to look out for the crescent of Shawwal 1443 AH immediately after sunset on April 30, which is equivalent to 29th day of Ramadan."
  },
  {
    "headline": "Jigawa group donates N10m to purchase nomination form for lawmaker",
    "summarized_story": "A political group has donated the sum of N10 million to member representing Birninkudu/Buji Federal Constituency in Jigawa State and Chairman, House Committee on Power, Magaji Da’u Aliyu to help him purchase nomination form ahead of 2023 general election.\nSpeaking while receiving the money donation, the lawmaker said he got the courage to re-contest the position from his constituents who gave him money for nomination form.\nMagaji Da’u Aliyu explained that he is overwhelmed by the donation, describing it as ‘inspiring.’According to him, “These donations from my constituency mean they need more from me.\nIt is a challenge, but I will continue to do my best for the improvement of the life of my people at all cost.”He also promised to continue with good representation through provision of developmental projects that will improve the social and economic lives of his people.\nSpeaking while presenting the money to the lawmaker, the chairman of the political community groups under the ages of Hon Magaji Da”u Supporters, Comrade Shamsudeen Umar, said they deemed it necessary to give extra support to their rep member, so they can continue enjoying his good representation."
  },
  {
    "headline": "Malami restates commitment to contest guber election",
    "summarized_story": "Minister of Justice and Attorney-General of the Federation, Abubakar Malami, has told the people of the Kebbi State that they won’t regret entrusting their mandate to him.\nMalami made the statement at the stakeholders meeting of the All Progressives Congress (APC) in Birnin Kebbi yesterday.\nMalami further extolled the support of the leaders of the APC at all levels, saying the party is united.\nHe cited the distribution of 40,000 tonnes of assorted food items to indigent Nigerians, which he extended to the Kebbi State government during the Ramadan.\nWhile acknowledging the tempo of cooperation, Bagudu pledged to do more to take Kebbi State to greater heights."
  },
  {
    "headline": "Middle Belt Youths urge Adamu to consult Buhari before making comments on zoning",
    "summarized_story": "Stakeholders in the All Progressives Congress (APC) have reached a decision to zone the presidency to the south ahead of the 2023 general election, the Middle Belt Youths Forum (MBYF) has said.\nThe youths urged the National Chairman of APC, Sen. Abdullahi Adamu to consult with President Muhammadu Buhari on the issue of zoning before making public statements on it.\nThe statement by the group read: “It is important at this point that Senator Adamu should consult with the leader of the party, President Buhari, before making statements that will continue to drag the party and the nation backward.\n“It is not in doubt that the consensus is that the next president should come from the South.\n“Our advice for the elder statesman is that he should be consulting widely before making public statements on matters like this.”"
  },
  {
    "headline": "2023: Fear grips APC presidential aspirants",
    "summarized_story": "A chieftain of the party told Sunday Sun that the number of presidential aspirants grew astronomically due to the fact that the incumbent will not be recontesting.\nOther presidential aspirants include the Minister of State, Education, Chukwuemeka Nwajiuba; Minister of State, Petroleum, Timipre Sylva; Minister of Niger Delta Affairs, Godswill Akpabio, and Minister, Science and Technology, Ogbonnia Onu, among others.\nPerhaps, in an attempt to discourage the aspirants, the ruling party leadership had jacked up the expression of interest and nomination forms for the presidential aspirants to a whopping sum of N100 million.\n“Whoever tells you that he knows how the presidential candidate of the party will emerge must be economical with the truth.\n“Truth be told, none of the presidential aspirants is very sure of getting the ticket of the party for now."
  },
  {
    "headline": "Sultan declares Monday Eid-El-Fitr",
    "summarized_story": "From Tunde Omolehin, SokotoThe Sultan of Sokoto and President General, Nigeria Supreme Council for Islamic Affairs, Alhaji Sa’ad Abubakar, has declared Monday, May 2 as day for Eid-el-Fitr.\nHis declaration was contained in a statement issued to journalists in Sokoto yesterday night.\nThe Chairman, Advisory Committee on Religious Affairs, Sultanate Council, Sokoto, Prof Sambo Wali Junaidu, Wazirin Sokoto, who spoke on behalf of the Sultan, said that the Advisory Committee on Religious Affairs in conjunction with the National Moon Sighting Committee did not receive any report from various Moon Sighting across the country.\n“Therefore, Sunday 1st May, 2022, is the 30th day of the month of Ramadan 1443AH,” the statement reads in part.\nWhile urging the Muslim Ummah to continue to pray for peace, progress and development of the country, Sultan also felicitated with the Nigerian Muslim Ummah and wished them Allah’s guidance and blessings."
  },
  {
    "headline": "Gunmen invade Anambra community, kill 5 in drinking joint",
    "summarized_story": "From Obinna Odogwu, AwkaGunmen, on Saturday, invaded Obiofia village, Osumenyi in Nnewi South Local Government Area of Anambra State and killed five people who were catching fun at a beer parlour in the area.\nAs at the time of filing this report, it’s not clear why the gunmen killed the innocent victims.\nNnewi South has assumed notoriety for wanton killing innocent people, as they set up their camps in the forests.\n“Anambra is a key state in the Southeast and Nigeria and has suffered heavily from the unrelenting conflict.\nWhen contacted, the Police Public Relations Officer in the state, DSP Toochukwu Ikenganyia, said that he was not aware of the ugly development."
  },
  {
    "headline": "Suspected herders kill 2 NSCDC personnel, 3 others in Benue",
    "summarized_story": "Our correspondent gathered that two NSCDC personnel and a driver with the Benue Livestock Guards, were killed while they were on an official duty at Adaka community of Makurdi on Friday.\nSpeaking on the attack, Chairman of Makurdi Local Government Area, Anthony Dyegeh, confirmed the killing of two NSCDC personnel and a driver to the Livestock Guards commander.\n“The Civil Defense personnel were members of Agro Rangers who worked hand-in-hand with the Livestock Guards to enforce the state’s anti-open grazing law.\n“So on Friday, they went to Adaka to arrest the herdsmen who were grazing their cattle; they went with their with livestock guards.\n“But for now, I will say that two personnel of the NSCDC as well as the driver of the commander of Livestock Guards were killed."
  },
  {
    "headline": "2023 presidency: Uwazuruike, MASSOB\\BIM leader, Igbo youths drum support for Yahaya Bello",
    "summarized_story": "The youths, who started the procession from the MASSOB leader’s House in New Owerri, marched through the streets, carrying different placards, with inscriptions such as “Power to the youths, Support Yahaya Bello”, “Youths can also lead”, and “Yahaya Bello for the youths”, among others.\nThey, therefore, said that Governor Bello is the right fit for the position of president of the country.\n“All Nigerians should rally round the youthful governor, Yahaya Bello.\nWe are supporting Yahaya Bello for this and no one else.\nWe must give youths a chance, especially one that has demonstrated uncommon capacity, in the person of Yahaya Bello,” he said."
  },
  {
    "headline": "Terrorists Hit Plateau State In Fresh Assault, Kill Five Residents, Abduct 20 Others",
    "summarized_story": "No fewer than five passengers, including a vigilante, were killed along the Sabon Gari-Kampani Road in the Wase Local Government Area of Plateau State.\nThe victims were killed by suspected terrorists, locally dubbed bandits, operating in the area, according to Daily Trust.\nAccording to Abdullahi Usman, a resident of Wase town, the vigilante and one other person were ambushed, while the remaining three were killed during a stop-and-search operation by the bandits.\nUsman added that more than 20 passengers were kidnapped in the incident.\nHe said, “The vigilante and one other person were on a motorcycle from Sabon- Gari to Kampani when the bandits attacked them."
  },
  {
    "headline": "Terrorists Hit Plateau State In Fresh Assault, Kill Five Residents, Abduct 20 Others",
    "summarized_story": "No fewer than five passengers, including a vigilante, were killed along the Sabon Gari-Kampani Road in the Wase Local Government Area of Plateau State.\nThe victims were killed by suspected terrorists, locally dubbed bandits, operating in the area, according to Daily Trust.\nAccording to Abdullahi Usman, a resident of Wase town, the vigilante and one other person were ambushed, while the remaining three were killed during a stop-and-search operation by the bandits.\nUsman added that more than 20 passengers were kidnapped in the incident.\nHe said, “The vigilante and one other person were on a motorcycle from Sabon- Gari to Kampani when the bandits attacked them."
  },
  {
    "headline": "BREAKING: Gunmen Attack Nigerian Army Checkpoint In Anambra, Personnel Feared Dead",
    "summarized_story": "Some gunmen on Saturday attacked soldiers at a checkpoint in Agulu, Anaocha Local Government Area of Anambra State.\nAccording to Daily Post, sources said the gunmen wielded automatic rifles, cutlasses and other dangerous weapons.\nThey reportedly arrived at the checkpoint, which was manned by soldiers and started shooting at them, causing the soldiers to reciprocate in a bid to save themselves.\nMeanwhile, the Anambra State Police Command has confirmed the incident, while also condemning it as an attack on the nation.\nYes, there was a shooting incident at a checkpoint in Agulu but the information is still sketchy.”"
  },
  {
    "headline": "BREAKING: Gunmen Attack Nigerian Army Checkpoint In Anambra, Personnel Feared Dead",
    "summarized_story": "Some gunmen on Saturday attacked soldiers at a checkpoint in Agulu, Anaocha Local Government Area of Anambra State.\nAccording to Daily Post, sources said the gunmen wielded automatic rifles, cutlasses and other dangerous weapons.\nThey reportedly arrived at the checkpoint, which was manned by soldiers and started shooting at them, causing the soldiers to reciprocate in a bid to save themselves.\nMeanwhile, the Anambra State Police Command has confirmed the incident, while also condemning it as an attack on the nation.\nYes, there was a shooting incident at a checkpoint in Agulu but the information is still sketchy.”"
  },
  {
    "headline": "Anti-narcotics Agency, NDLEA Intercepts N1.1billion Travellers’ Cheques, Over 10kg Cocaine At Lagos Airport",
    "summarized_story": "The National Drug Law Enforcement Agency has said it uncovered travellers’ cheques in different foreign currencies with a total value of N1,157,670,469 at the Murtala Muhammed International Airport, MMIA, Ikeja Lagos State.\nThe agency also arrested a suspect, Oguma Richard Uchenna, who was attempting to export the cheques, which were neatly concealed inside four bound hardcover books disguised as academic project literature, to the United Kingdom.\nThe financial instruments suspected to be counterfeits were discovered on Wednesday, April 27 at the NAHCO export shed of the Lagos airport during cargo examination of some consignments meant for exportation to the UK on a cargo flight.\nAccording to a release from the agency obtained by SaharaReporters on Sunday, operatives of NDLEA at the airport foiled “an attempt by drug traffickers to smuggle into Nigeria 10.89 kilogrammes of cocaine through a Qatar Airways flight.\n“While commending the officers and men of the MMIA, Ondo, Akwa Ibom and Kaduna Commands of the Agency for the seizures and arrests in the past week, Chairman/Chief Executive of NDLEA, Brig."
  },
  {
    "headline": "Army: IPOB using doctored images, videos for propaganda war against us",
    "summarized_story": "The Nigerian Army says members of the proscribed Indigenous People of Biafra (IPOB) are using pictures of fake soldiers arrested by troops recently to malign the institution.\nOnyema Nwachukwu, director, army public relations, said this in a statement on Sunday in Abuja.\nHe said Okafor also alleged that about 87 per cent of Nigerian soldiers were kidnappers and bandits.\nAdvertisementNwachukwu said the said report was a creation of IPOB/ESN social media foot soldiers with the intent to malign the Nigerian army.\n“Members of the public are therefore urged to disregard this mindless and irresponsible propaganda clearly emanating from IPOB, aimed at promoting insecurity in the country.”"
  },
  {
    "headline": "Army: IPOB using doctored images, videos for propaganda war against us",
    "summarized_story": "The Nigerian Army says members of the proscribed Indigenous People of Biafra (IPOB) are using pictures of fake soldiers arrested by troops recently to malign the institution.\nOnyema Nwachukwu, director, army public relations, said this in a statement on Sunday in Abuja.\nHe said Okafor also alleged that about 87 per cent of Nigerian soldiers were kidnappers and bandits.\nAdvertisementNwachukwu said the said report was a creation of IPOB/ESN social media foot soldiers with the intent to malign the Nigerian army.\n“Members of the public are therefore urged to disregard this mindless and irresponsible propaganda clearly emanating from IPOB, aimed at promoting insecurity in the country.”"
  },
  {
    "headline": "Falae: I won 1999 presidential election... results were overturned while I was asleep",
    "summarized_story": "Olu Falae, former secretary to the government of the federation (SGF), has claimed he won the 1999 presidential election.\nIn an interview with Daily Trust, the former SGF claimed the results of the election were altered overnight while he was asleep.\nBut when the results came, it was very funny.\nThe results for the first 18 came out and I won with a ratio of 4 to 1, which was not close.\nAdvertisement“The result from the remaining four local governments came out when I was asleep and completely overturned the results I had in the 18 local governments."
  },
  {
    "headline": "Falae: I won 1999 presidential election... results were overturned while I was asleep",
    "summarized_story": "Olu Falae, former secretary to the government of the federation (SGF), has claimed he won the 1999 presidential election.\nIn an interview with Daily Trust, the former SGF claimed the results of the election were altered overnight while he was asleep.\nBut when the results came, it was very funny.\nThe results for the first 18 came out and I won with a ratio of 4 to 1, which was not close.\nAdvertisement“The result from the remaining four local governments came out when I was asleep and completely overturned the results I had in the 18 local governments."
  },
  {
    "headline": "No Nigerian worker should live in poverty, says Tinubu",
    "summarized_story": "Bola Tinubu, the All Progressives Congress (APC) presidential hopeful, says Nigerian workers are the “backbone” of the country and none of them should live in poverty.\nThe APC chieftain made the remark in a statement released on Sunday to commemorate International Workers’ Day.\nAccording to the statement signed by Tunde Rahman, his media aide, Tinubu hailed the sacrifices of Nigerian workers.\n“It is a day for us to fully celebrate the Nigerian worker.\n“Today, l join all Nigerians in celebrating the hard work and productivity of Nigerian workers around the country."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "WhatsApp confirms outage, as thousands around the world are unable to send messages",
    "summarized_story": "On Thursday evening, April 28, nearly 10,000 users reported that WhatsApp is not functioning for them, according to data from Down detector.\nIt’s not immediately clear what caused the outage but WhatsApp has confirmed the outage through its official Twitter account.\n“You may be experiencing some issues using WhatsApp at the moment,” the company said.\nWe’ll keep you updated and in the meantime, thanks for your patience.”You may be experiencing some issues using WhatsApp at the moment.\n— WhatsApp (@WhatsApp) April 28, 2022Share this article"
  },
  {
    "headline": "A Kenyan Eden",
    "summarized_story": "Remember we had a Twitter Space titled Do startups need financial literacy?\nSince then, 95 companies have participated as of the Winter 2022 launch, about half of which are financial services providers, and 51 are from Nigeria.\nEden Life’s expansion and acquisitionEden Life, a Lagos-based startup, has announced plans to expand into Nairobi, Kenya.\nBuilding on its success in Lagos, Nigeria, Eden says it intends to remove obstacles to discovering dependable household services in Nairobi.\nWhat I’m reading and watchingOpportunitiesThe FT x Cardano Blockchain Challenge is sourcing ventures building or interested in leveraging the Cardano blockchain platform and community."
  },
  {
    "headline": "“All startup founders must be financially literate.” – Olumide Adesina",
    "summarized_story": "Share this article:What do you think of when you hear financial literacy for startups?\nIf you’re like most people, you’re probably wondering why startups have to be financially literate, especially when much of the conversation around financial literacy has been about personal finance.\nAs surprising as it is, even businesses need financial literacy.\nHowever, he pointed out that knowing about financial issues does not equate to financial literacy.\nWith many startups opting for venture capital investments, Adesina observed that founders need to be careful while deciding what kind of investment they accept."
  },
  {
    "headline": "Another NFT hack?",
    "summarized_story": "Billed as the next generation of the web, Web3 focuses on decentralisation using decentralised blockchains.\nLet NFT artists and blockchain devs show you the ropes at the Techpoint Africa Blockchain Summit.\nAnother NFT phishing schemeOn Monday, April 25, 2022, the Instagram account of the popular NFT collection, Bored Ape Yacht Club (BAYC), was hacked.\nEssentially, the hacker duped victims into handing over control of their wallets by creating a fake advertisement for an upcoming NFT project.\nThe hacker tricked users into clicking a link to “mint” a bogus NFT by sending Ethereum (eth) and, in some cases, an NFT to wrap into a token."
  },
  {
    "headline": "Bekonta extends blockchain awareness and user education to Serving Corps Members.",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:Blockchain awareness and user education is a background check that must be done to foster blockchain adoption.\nThe Festival of Culture with the Bekonta presence engaged Youth Corps Members in a unique way.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Get 30GB Free Data from Geneix and Free Ear Buds when you buy the Infinix Hot 12",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:The recently launched Hot12 from Infinix is nothing short of Hot, Bold, Trendy.\nYou can bet on a Fast and Fun Vibe with the Hot series, but not just that.\nYou can enjoy the best of your internet experiences with a whopping 30GB worth of free data and free quality ear buds for a blissful smartphone experience.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Edo PDP elects adhoc delegates ahead of party primaries – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State chapter of the Peoples Democratic Party (PDP) has organized ward congresses across the 192 wards in the state to elect adhoc delegates ahead of the party primaries.\nChairman of the Edo PDP Ward Congress Electoral Committee, Dr. Kingsley Emu, who addressed the State Working Committee at the party secretariat in Benin City ahead of the commencement of the exercise, said the ward congresses will produce 576 adhoc delegates from the 192 wards in Edo State.\nThe exercise across the 192 wards of Edo State was monitored by officials of the Independent National Electoral Commission (INEC).\nThe chairman noted that each ward is expected to produce three adhoc delegates in line with the party guidelines.\nWe have 192 wards in Edo State and 18 local government areas and the congress is expected to produce 576 delegates for the election with one national from every local government area."
  },
  {
    "headline": "Edo partners stakeholders, steps up efforts to contain Lassa fever in rural communities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government is rallying stakeholders, including religious, traditional and community leaders to contain the spread of Lassa fever across communities in the state.\nThe Edo State Commissioner for Health, Prof. Obehi Akoria, who disclosed this to journalists in Benin City, said the state government remains committed to the health of citizens and is stepping up efforts to ensure that residents of the state are protected from the epidemic.\nThe commissioner noted that the state recorded no Lassa fever-related death in the last one week, but confirmed nine new cases of the disease.\nIt will continue to help us bridge the human resource gap and specialist care for specific people who are currently underserved.\n“Surgeries are ongoing at the University of Benin Teaching Hospital (UBTH), Edo Specialist Hospital and Stella Obasanjo Hospital while eye healthcare services are taking place at PHCs at Oredo, Ugbor and Edo State Hospital Board Management premises.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "AIG Directs Edo, Delta CPs To Beef Up Security For Eid-el-fitr – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Assistant Inspector-General of Police, Zone 5 Headquarters, Benin City, AIG Lawan Tanko Jimeta has directed Edo and Delta State Commissioners of Police to beef up security before, during and after this year’s Eid-el-fitr in their respective states.\nAIG Jimeta further enjoined the CPs to strengthen security on all entry and exit points, major highways, linking roads, government installations/properties, recreation and worship centres as well as other strategic locations within their state commands.\n“They are also to beef up security in the entire linking roads, entry and exit points, major highways, city centres, worship centres, recreational centres, Government installations/properties and other strategic locations in their areas”.\nAIG Jimeta also urged the state police commands to control the volume of traffic that may be occasioned by the celebration.\nAIG Jimeta called on the public to be security conscious, vigilant and swiftly report to the nearest police station any suspicious incident or persons in their neighbourhood."
  },
  {
    "headline": "Obaseki warns against unhealthy inter-agency rivalry, urges collaboration to improve security – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has warned against unhealthy rivalry among security agencies in the state, urging for increased collaboration between the government, security outfits and local communities to tackle crime and insecurity in the state.\n“That trust that you have come to support them must be quickly built, and any sense of rivalry will not come.\nWe shall make efforts to protect individuals, organizations, businesses, groups and communities against any form of threat,” Obaseki assured.\nEarlier, the new Edo NSCDC Commandant assured the governor that he would cooperate and relate with other security agencies as well as stakeholders to improve security in the state.\nHe said, “Without this collaboration, we may not succeed, and we know that this cooperation begins with meaningful partnership with the government and other stakeholders.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Gunmen unleash terror on Anambra, kill soldier, five others",
    "summarized_story": "Gunmen have killed a soldier and five civilians in a attack in the Anaocha and Nnewi South Local Government Areas of Anambra State.\nFive of the victims were said to have been killed at a restaurant in Obiofia village, Osumenyi, in Nnewi South.\nA source said the gunmen carried out the operation with over three exotic vehicles suspected to have been snatched from unsuspecting members of the public.\nWe saw them; some people even tried to make videos, but everyone was afraid not to be spotted and shot,” the source added.\nVideos from the scene of the incident that trended on social media also showed four male victims and Ndụ lying lifeless in a pool of blood."
  },
  {
    "headline": "FirstBank pays N56bn as commission to Firstmonie agents in 4 years",
    "summarized_story": "FirstBank Nigeria Plc has said it paid N56 billion to FirstMonie agents as commission in four years.\nAdeduntan said FirstBank is deliberately driving impactful programmes that are necessary to achieve shared prosperity for both current and future generations.\nHe also highlighted FirstBank’s Common Good Programmes, which include Financial Inclusion; Responsible Lending/Banking; CRS and Sustainability Actions.\nHe further explained that these programmes cover Agent Banking, FirstMonie, Value Proposition; Women Empowerment; Small & Medium Scale (SME) Business Support and Capability Enhancement Programme; and Employee Volunteer, Start Performing Random Act of Kindness (SPARK), Programme.\n“Over 500, 000 direct and indirect jobs created to tackle unemployment through the FirstBank’s FirstMonie agent network."
  },
  {
    "headline": "IPOB using propaganda to malign us – Nigerian army",
    "summarized_story": "The Nigerian Army has said members of the proscribed Indigenous People of Biafra (IPOB) are using pictures of fake soldiers arrested by Nigerian army troops recently to malign the institution.\nThe Director, Army Public Relations, Brig.-Gen. Onyema Nwachukwu said this in a statement on Sunday in Abuja.\nHe said the said Okafor also alleged that about 87 per cent of Nigerian soldiers were kidnappers and bandits.\nNwachukwu said the said report was a creation of IPOB/ESN social media foot soldiers, with the intent to malign the Nigerian army.\n“Members of the public are therefore urged to disregard this mindless and irresponsible propaganda clearly emanating from IPOB, aimed at promoting insecurity in the country,” he said."
  },
  {
    "headline": "Fasting to continue on Sunday as Sultan declares Monday Eid-El-Fitr",
    "summarized_story": "The Sultan of Sokoto, His Eminence, Alhaji Sa’ad Abubakar, has declared Monday as the first day of Shawwal.\nThe Sultan made the declaration after no positive sighting claims were received from members of the National moonsighting committee and other Emirates.\nMuslims in the country would now celebrate the eid-el-fitri on Monday being the first day of Shawwal.\nZubairu Haruna Usman-Ugwu, had on Friday in a statement urged Muslims across the country to look for the new moon of Shawwal on Saturday.\nThe sighting of the crescent moon on Saturday would have marked the end of Ramadan and the start of the next month of Shawwal on Sunday."
  },
  {
    "headline": "2023: Withdraw Statement On Zoning, Arewa Youths Tell APC Chairman",
    "summarized_story": "The Arewa Consultative Youth Forum (ACYF) has called on the national chairman of the ruling All Progressives Congress (APC), Senator Abdullahi Adamu, to quickly withdraw his statement that the party has not taken a position on zoning elective positions for 2023 elections.\nThe ACYF, in a statement on Saturday, said the statement credited to Adamu was capable of heating the polity and spelling doom for the party if not quickly withdrawn.\nThe statement reads, “The unfortunate statement credited to Senator Adamu is regrettable just as it is demeaning of his status as the chairman of a ruling party.\n“His statement that no agreement had been reached on zoning is not in the best interest of the party.\n“The statement is capable of leading to electoral defeat for our great party if not quickly withdrawn."
  },
  {
    "headline": "Pull-up Naija To Sensitise Nigerian Youths For 2023 General Elections",
    "summarized_story": "As the 2023 General Elections draws closer, advocacy group, Pull-up Naija is set to sensitise Nigerian youths to participate actively and exercise their voting rights.\nPull-up founder and film producer, Hauwa Allahbura said the initiative is the concept of 24 Angels borne out of the passion to foster youth participation in elections and voting.\nThe group in a statement said its main objective is to register youths as active voters to enable them take their destinies in their hands.\nIt would host enlightenment campaigns that will feature INEC measure to ensuring that all votes count.\nADVERTISEMENTWith an aim to unite Nigerian youths from different stratas, Pull-up Naija promises to have youth interact with their role models and captain of industries one-on-one."
  },
  {
    "headline": "Estate Surveyors Task Federal Govt On Development Of Intellectual Property Hub",
    "summarized_story": "The Business Assets and Intellectual Property Valuation Division of the Nigerian Institution of Estate Surveyors and Valuers (NIESV) has called on the Federal Government to give priority attention to the development of Intellectual Property Hub in the country.\nThe Division’s chairman, Olalekan Akinwunmi, made this call in Lagos during the World Intellectual Property Day 2022.\nThis year, all over the globe, the theme of the IP day was on “IP and Youth: Innovating for a Better Future”.\nApril 26 every year is celebrated as Intellectual Property Rights’ Day.\nAll member states of the World Intellectual Property Organization use the opportunity to explore the role of Intellectual Property (IP) in the economy, while also encouraging innovation and creativity, and right policies that ensure that inventors and creators get handsome rewards for their services."
  },
  {
    "headline": "Estate Surveyors Task Federal Govt On Development Of Intellectual Property Hub",
    "summarized_story": "The Business Assets and Intellectual Property Valuation Division of the Nigerian Institution of Estate Surveyors and Valuers (NIESV) has called on the Federal Government to give priority attention to the development of Intellectual Property Hub in the country.\nThe Division’s chairman, Olalekan Akinwunmi, made this call in Lagos during the World Intellectual Property Day 2022.\nThis year, all over the globe, the theme of the IP day was on “IP and Youth: Innovating for a Better Future”.\nApril 26 every year is celebrated as Intellectual Property Rights’ Day.\nAll member states of the World Intellectual Property Organization use the opportunity to explore the role of Intellectual Property (IP) in the economy, while also encouraging innovation and creativity, and right policies that ensure that inventors and creators get handsome rewards for their services."
  },
  {
    "headline": "Excitement As Contactless Technology, BleanQ, Launched In Abuja",
    "summarized_story": "As the physical and digital worlds continue to blend into one, a new contactless technology has been introduced into Nigeria through BleanQ.\nThe new contactless technology developed by Zkyte Technologies was launched on Friday by the Minister of Youth and Sports Development, Mr Sunday Dare, at the Silverbend Cinema, Abuja.\nADVERTISEMENT“Contactless technology, Near Field Technology e-commerce e-transactions have changed how the world operates and this comes with huge economic benefits.\nExplaining the technology, the managing director of Zkyte Technologies, Ayoola Daudu said: “With this technology, you do not necessarily need to be everywhere.\nIt also has a contactless way of making payments unlike the normal ATM cards.”Speaking on the readiness of Nigerians to embrace the new technology, Ayoola stated that Nigerians are the largest mobile users in Africa."
  },
  {
    "headline": "Adeboye honoured with Doctor of Divinity by Oral Robert University",
    "summarized_story": "Oral Robert University based in Tulsa Oklahoma in the United States has honoured Pastor Enoch Adeboye with a doctor of divinity.\n“If anyone had told me then that I would be awarded an honorary degree from one of the most prestigious universities there, Oral Roberts University @oralrobertsu, I would have said the person was joking.\nWatch the video shared by RCCG in the Americas:Oral Roberts University (ORU) is a private evangelical university.\nIt was founded in 1963 by evangelist Oral Roberts.\nThe university offers over 70 undergraduate degree programs along with 20 graduate programs across six colleges."
  },
  {
    "headline": "Alaafin, Iyabo Ojo's daughter, Yul Edochie set internet buzzing",
    "summarized_story": "Weekly Recap by News Agency of NigeriaThe previous week had the internet buzzing following different news reports from the local and international space.\nWhile some argued that his religion should overshadow his tradition, some others blamed social media and civilisation for the exposure of the traditional ruler’s body, which reports say tradition forbids.\nBorn by my second wife, Judy Austin.\nThe actor later expressed shock at how Nigerians were quick to respond to his revelation of a second wife compared to his acting and political career.\nCommenting on her death, a social media user @bmbmall wrote, “Her last duty was in God’s house…."
  },
  {
    "headline": "Ex-Govs Dariye, Nyame remain in prison after Buhari’s pardon",
    "summarized_story": "Former Governor of Plateau State, Joshua Dariye, and his counterpart, Jolly Nyame of Taraba State are yet to be released from Kuje Correctional Centre, The Nation learnt yesterday.\nThis is about two weeks after they were pardoned by the National Council of States alongside 157 others.\nDariye was said to have shed tears of joy on learning about his pardon.\nBut the Federal Government is yet to send documents regarding their pardon to the Correctional authorities to enable them to perfect the process for their release.\nDariye and Nyame were jailed for corruption charges by the Federal Government."
  },
  {
    "headline": "One Dies, Many Injured As Police, Shiites Clash In Kaduna",
    "summarized_story": "One Dies, Many Injured As Police, Shiites Clash In KadunaSecurity agents and members of the proscribed Islamic Movement of Nigeria (IMN), often known as Shi’ites, battled in Kaduna on Saturday, killing one person and injuring several others.\nThe trouble began when Shi’ites were marching in a parade to commemorate the annual Quds Day, and security agents stationed along main roadways in Kaduna and Zaria attempted to disperse the assembly.\nSecurity agents fired tear gas and live gunfire at protestors, according to an eyewitness who requested anonymity, while other Shi’ites set fire to numerous vehicles in Zaria.\nHe denied allegations that a police station was burnt and that the Shi’ites had set ablaze vehicles.\nThe Kaduna State Police Command Public Relations Officer, ASP Mohammed Jalige did not pick up his calls for comments."
  },
  {
    "headline": "More Photos Of Late Nollywood Actress, Chinedu Bernard",
    "summarized_story": "One of the sad events that is currently trending on social media is the death of talented Nollywood actress, Chinedu Bernard.\nHer death triggered mixed reactions among her fans, colleagues, and other well wishes, who were shocked by the news.\nAccording to Punch Newspapers, the actress was confirmed dead at the East Side Hospital in Enugu State after she slumped while cleaning the Chapel of St. Leo the Great Catholic Church in the Federal Housing area of the state yesterday.\nUntil her death, the actress popularly known as Choco featured in several movies including ‘The Mad’, ‘Money Fever’, ‘The Big Mama’s Stick’, ‘The Last Manhood’ and ‘Mad Love’.\nAs we continue to mourn her death, here are more beautiful pictures of the actress;May her soul rest in peace, Amen!"
  },
  {
    "headline": "Buhari to Oba of Benin: Nigeria is expecting return of 1130 looted Benin bronzes from Germany",
    "summarized_story": "President Muhammadu Buhari on Friday gave the assurance that the Federal Government would continue to vigorously pursue the repatriation of looted Nigeria’s artefacts from abroad, including 1,130 Benin Bronzes in Germany’s public museums.\nThe President gave the assurance while receiving the Oba of Benin, Oba Ewuare II, accompanied by members of the Royal Court of Benin and the Board of Trustees of the Benin Royal Museum at the Presidential Villa, Abuja.\nSpeaking on the return of the artefacts, President Buhari expressed delight that it has brought immense goodwill to Nigeria, the ancient Benin Kingdom as well as happiness to the Oba of Benin.\nWhen concluded, it will signify the return to Nigeria by Germany of all the 1,130 Benin Bronzes in Germany’s public museums.\n“Furthermore, on the 7th of this month, the Glasgow City Council agreed to return 17 Benin bronzes to Nigeria."
  },
  {
    "headline": "Breaking: Anambra boils as gunmen attack PDP presidential aspirant’s community, soldiers feared shot (VIDEO)",
    "summarized_story": "Unknown gunmen, Saturday, attacked Agulu, a community in Anaocha local government area, Anambra state, forcing soldiers at a checkpoint to flee.\nAgulu is a country-home of the presidential aspirant of the Peoples Democratic Party (PDP) and former governor of Anambra State, Mr Peter Obi.\nAlthough, voices in the trending video claimed that some of the soldiers were actually killed at the spot, no casaulty was shown but gunshots were heard.\nThe Police Public Relations Officer (PPRO) in Anambra state, DSP Tochukwu Ikenga, did not respond to call to confirm the report as at press time.\nAnother group of gunmen also unleashed attack during Easter in Anambra state."
  },
  {
    "headline": "Ukraine invasion: 2 Russian tanks sink as Putin loses 23, 000 troops",
    "summarized_story": "It was dramatic moment when two Russian tanks were obliterated in a drone strike as Vladimir Putin loses more than 23,000 troops.\nStriking footage showed the devastation caused by the strike from what was believed to be Ukraine’s 503rd Naval Infantry Battalion.\nIn the clip the drone hangs in the air as it appears to eye up its Russian targets – understood to be Kurganets-25 tanks.\nEarlier this week, Britain’s Defence Secretary Ben Wallace estimated some 15,000 Russian troops have been killed.\nHe told MPs more than 2,000 of Putin’s armoured vehicles have also been destroyed or captured."
  },
  {
    "headline": "[Happening now] PDP ward congress: Tension grows, party faithful stranded over ‘diversion of materials in Akwa Ibom’",
    "summarized_story": "Tension have enveloped the political climate of Akwa Ibom state as thousands of aspiring adhoc delegates who trooped out with their supporters for the ongoing Saturday’s election are currently stranded in their various People’s Democratic Party (PDP) offices across the state since morning.\nBlueprint correspondent covering the election observed that rather than the state party office located at Atan offot in Uyo, materials meant for the election were shared at Maintain Peace Movement office at Udo Udoma office uyo for movement to different destination.\nHowever at the time of filing the report, no single party office across the state have received any material for the election while investigations revealed that they have been diverted to private homes of party chieftains.\nSpeaking with some of the aspiring delegates, the party stalwarts expressed deep frustration over “the ongoing massive disenfranchisement” stressing that the party should be ready to organise fresh election or face legal actions.\nWe are waiting here for materials since 8am and now its 2pm no news’."
  },
  {
    "headline": "Seplat Energy’s revenue grows by 58.6% to N100.6bn",
    "summarized_story": "The company also generated cash from its operations to the tune of N74.4bn from N1.7bn year-on-year, rising by 197.8 per cent.\nThe energy Company’s also grew its revenue by 58.6 per cent to N100.6bn from N57.9bn year-on-year; as its gross profit soars to N48.8bn from N20.1bn year-on-year, rising by 122.3 per cent.\nIn its operations, Seplat Energy demonstrated a strong safety record, which extended to 26.1 million hours without LTI from operated assets (2.0 million hours in Q1 2022).\nIt will also bring a significant undeveloped gas resource base which, alongside our ANOH gas project development, will underpin Nigeria’s energy transition and drive domestic and export revenues when developed.\n“We have proven we have the financial strength and credibility to attract international finance into Nigeria’s energy sector and this will help us in our aim to deliver energy transition and provide cleaner, more reliable and more affordable energy for Nigeria’s young and growing population.”"
  },
  {
    "headline": "Women in Oil, Gas to benefit from $40m NCDMB/NEXIM Bank Fund- Wabote",
    "summarized_story": "By Palma IleyeExecutive Secretary of the Nigerian Content Development and Monitoring Board, NCDMB, Engr.\nSimbi Kesiye Wabote has said on Wednesday that women entrepreneurs in the Nigerian oil and gas industry should break barriers by taking advantage of the $40m fund created specifically for them under the Nigerian Content Intervention Fund, NCI Fund.\n“To provide a fair chance for women in the oil and gas industry, the Board partnered with the NEXIM Bank to establish a $20 million fund that was matched with an additional $20 million fund by NEXIM bank, making the total pool of funds available to women in oil and gas to be $40 million,” he said.\nHe explained that the Board and its partners have introduced and implemented several initiatives that promote diversity in the oil and gas industry.\nHe added that “the Board has also organized events that were targeted at women and community activities to promote inclusiveness."
  },
  {
    "headline": "N69.4bn Debt: Court orders stay of contempt proceedings initiated by Jimoh Ibrahim against AMCON",
    "summarized_story": "CA/ABJ/CV/269/2022 in the case between the Asset Management Corporation of Nigeria (AMCON) vs Barrister Jimoh Ibrahim has ruled that all proceedings including the contempt proceedings initiated by Barrister Jimoh Ibrahim and co at the trial court should be stayed pending the hearing, and determination of the substantive appeal.\nWith that ruling, Barrister Jimoh Ibrahim and Co have been again neutralized from executing the said contempt proceedings order, which he obtained under questionable circumstances.\nAMCON over the years had tried all reasonable and peaceful resolution strategies to recover the debt from Jimoh Ibrahim to no avail.\nFHC/ABJ/CS/760/2021 to seek justice, and accordingly received an order of the trial court to take over the businesses of Jimoh Ibrahim.\nAMCON further received the backing of the trial court to appoint a Receiver/Manager to oversee the businesses on behalf of AMCON."
  },
  {
    "headline": "MTNN, Pan-Atlantic University launch media innovation programme",
    "summarized_story": "By Kehinde Ibrahim, LagosMTN Nigeria and Pan-Atlantic University (PAU), yesterday, announced the launch of the MTN Media Innovation Programme (MTN MIP), which will be run by PAU’s School of Media and Communication (SMC).\nThe six-month, fully funded fellowship for Nigerian media practitioners is designed to support the sustainable development of the nation’s changing media scene.\nIt is open to media practitioners across the spectrum, including print, electronic, online platforms and social media content creators.\nThus, it is only fitting that we support developments in the Nigerian media space with our infrastructure and enable capacity building initiatives to enable innovation in media practice.\nThe MTN Media Innovation Programme could not have come at a better time for Nigerian media practitioners to imbibe these pertinent values,” Professor Enase Okonedo, Vice Chancellor, Pan-Atlantic University, added."
  },
  {
    "headline": "NCC moves to strengthen colocation, infrastructure sharing market segment",
    "summarized_story": "By Asuelimen OsasuyiNigerian Communications Commission, NCC, has commenced the process of conducting a study to assess the current level of competition in the colocation and infrastructure sharing, CIS, segment of the Nigerian telecommunications sector.\nAccording to NCC, seventy-eight licensees are currently operating in that market segment.\nThe NCC takes this issue as priority in view of the critical role played by the colocation and infrastructure sharing segment of the telecom ecosystem in ensuring robust services.\nFor instance, at the time the 2013 study was conducted, the CIS market segment was still at embryonic stage and as such, much emphasis was not placed on it.\nThe Director PCEA also informed that activities in the CIS market have also attained the targets set out in the Nigerian National Broadband Plan (2020-2025)”."
  },
  {
    "headline": "Workers’ Day: We’ll Work With Organised Labour To Address Issues, Lawan Assures",
    "summarized_story": "Senate President Ahmad Lawan has assured workers that the National Assembly will continue to partner with the Organised Labour to address issues relating to them.\nRead Also: [Labour Day] Lawan Seeks ‘Speedy’ End To ASUU Strike“Nigerian workers deserve our appreciations and respects for their contributions to the development of our country,” Lawan said.\n“There is no gainsaying the fact that Labour creates wealth for the nation, the more reason that the welfare of the Nigerian workers should always be accorded priority.\n“As Parliament, the National Assembly will continue to partner with the Organised Labour in addressing issues that affect workers and the generality of the Nigerian people.\n“Once again, I say congratulations to all Nigerian workers and wish them a happy May Day.”ASUU’s DemandsASUU embarked on a four-week warning strike on February 14."
  },
  {
    "headline": "Nancy Pelosi Meets Zelensky On Unannounced Visit To Kyiv – Officials",
    "summarized_story": "US Speaker of the House Nancy Pelosi voiced support for Ukraine’s “fight for freedom” at a meeting with President Volodymyr Zelensky on a visit to Kyiv, US and Ukrainian officials said on Sunday.\nZelensky tweeted: “Thank you to the United States for helping protect the sovereignty and territorial integrity of our state”.\n“The US is leading strong support for Ukraine in its fight against Russian aggression,” he said.\nUS President Joe Biden last week proposed a huge $33-billion (31-billion euro) package for arming and supporting Ukraine.\nUS Secretary of State Antony Blinken and US Defense Secretary Lloyd Austin visited Kyiv last month."
  },
  {
    "headline": "NDLEA Intercepts N1.1billion Travellers’ Cheques, 10.89kg Cocaine At Lagos Airport",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has intercepted travellers’ cheques in different foreign currencies with a total value of N1,157,670,469.92 at the Murtala Muhammed International Airport, Ikeja Lagos.\nThis was disclosed in a statement signed by Director, Media & Advocacy, Femi Babafemi, on Sunday.\nIn the same vein, operatives of the NDLEA at the airport foiled an attempt by drug traffickers to smuggle into Nigeria 10.89kilograms of cocaine through a Qatar Airways flight.\nMeanwhile, raid operations in Kaduna, Ondo and Akwa Ibom state have led to the seizure of about 2,000kg of Tramadol, Codeine, Cannabis and Heroin.\nGen. Mohamed Buba Marwa (Retd) charged them and their compatriots across the country to remain steadfast and vigilant in their areas of responsibility."
  },
  {
    "headline": "Eid-el-fitr: Sultan Declares Monday As Sallah Day In Nigeria",
    "summarized_story": "The Sultan of Sokoto and President-General of the Nigeria Supreme Council for Islamic Affairs (NSCIA), Muhammad Sa’ad Abubakar, has declared Monday as the first day of Shawwal 1443AH in Nigeria.\nThe Sultan made the declaration in a statement on Saturday signed by Prof. Sambo Junaidu, the Chairman, Advisory Committee on Religious Affairs Sultanate Council, Sokoto.\nHe said the Sultanate Council Advisory Committee on Religious Affairs in Conjunction with the National Moon Sighting Committee did not receive any report from various Moon Sighting committees across the country.\nThe Sultan said he has accepted the report and accordingly declared Monday as the first day of Shawwal 1443AH, Day of Eid-el-Fitr.\nHe urged Muslims to continue to pray for peace progress and development of the country and wished all Nigerians happy Eid-el-Fitr."
  },
  {
    "headline": "Beijing Tourist Sites Empty In Covid-Stalked Public Holiday",
    "summarized_story": "Major Beijing tourist venues were virtually deserted Sunday and restaurant traffic ground to a standstill, as a typically bustling public holiday was overshadowed by a Covid outbreak that has shunted millions under lockdown nationwide.\nEateries nearby were shuttered, with some only allowing customers to order takeout if they have a negative covid test.\nThis restriction is the latest measure ordered by Beijing authorities, who say all visitors to public spaces must have a negative test result within the past 48 hours.\nThe Labour Day holiday was supposed to be a massive commercial coup for the park — which earlier this week had initially required a negative Covid test within 24 hours of visiting.\n“There still exists a small number of hidden infected (patients) found through community screening,” Beijing health official Pang Xinghuo said at a Sunday briefing."
  },
  {
    "headline": "2023 Presidency: MASSOB leader, Uwazurike leads thousands of youths in solidarity march for Yahaya Bello -",
    "summarized_story": "The youths, who started the procession from the MASSOB leader’s House in Owerri, marched through the streets, carrying different placards, with inscriptions such as “Power to the Youths, Support Yahaya Bello”, “Youths Can Also Lead”, and “Yahaya Bello for the Youths”, among others.\nAccording to them, in this regard, Governor Bello is the right fit for the position of President of the Federal Republic of Nigeria.\n“All Nigerians should rally round the youthful Governor, Yahaya Bello.\nWe are supporting Yahaya Bello for this and no one else.\nWe must give youths a chance, especially one that has demonstrated uncommon capacity, in the person of Yahaya Bello,” he said."
  },
  {
    "headline": "British Member of Parliament to resign for Watching Porn in Parliament",
    "summarized_story": "A Conservative British Member of Parliament, Neil Parish, has announced that he will resign after admitting twice watching pornography in the House of Commons.\nParish told the BBC the first time he viewed the explicit material was an accident after searching online for farm vehicles.\nThe Government of Prime Minister, Boris Johnson, is engulfed in numerous scandals, just days ahead of crucial local elections.\nThe Prime Minister himself has been fined by police for breaching his own Covid rules during the 2020 lockdown, and faces an investigation into whether he misled Parliament about parties in Downing Street.\nWe support his decision to step down as our Member of Parliament.”"
  },
  {
    "headline": "Peterside asks Wike to release detained Farah Dagogo within 48 hours -",
    "summarized_story": "Wike on how he obtained evidence linking the lawmaker to an alleged disruption of proceedings at the Rivers State Secretariat of the Peoples Democratic Party, PDP.\n“Wike had lied at several times such that these days his claims must be subjected to forensic investigation before believed.\nWhile calling on lovers of democracy and free speech to condemn Wike and his fascist style of governance, Peterside reiterated his 48-hour ultimatum to Gov.\n“Wike has 48 hours to ensure that Honourable Farah is set free and allowed to continue to pursue his political aspiration.\nWike cannot be junketing in pursuit of his presidential ambition using Rivers State resources while wickedly gagging another’s on the altar of ego."
  },
  {
    "headline": "Asiwaju Tinubu Receives APC Presidential Nomination Forms -",
    "summarized_story": "The National Leader of the All Progressives Congress and Frontline Presidential Aspirant, Asiwaju Bola Ahmed Tinubu, has received his Expression of Interest and Nomination Forms to enable him participate in the Presidential Primaries of the Party.\nAsiwaju Tinubu who just returned to the Country after performing the lesser Hajj (Umrah) in Mecca received the forms from Lagos State Governor, Babajide Olusola Sanwoolu.\nHis support groups led by former Secretary to the Government of the Federation, Babchir Lawal, and Senator Dayo Adeyeye purchased the forms for him on Friday afternoon.\nThe Party’s Presidential Primaries will hold between the 30th of May and 1st of June.\nThe Party’s Presidential contest has become increassingly crowded in recent days with the declaration of the Vice President Yemi Osinbajo, Governors Yahaya Bello of Kogi State and Kayode Fayemi of Ekiti State, Senators Ibikunle Amosun and Chris Ngige, Minister of Transportation, Rotimi Amaechi, Minister of Education, Chkwuemeka Nwajiuba and Others."
  },
  {
    "headline": "15% Levy on Imported Used Vehicles Illegal, Nigeria’s Clearing Agents Tell Buhari",
    "summarized_story": "Clearing agents under the aegis of the National Council of Managing Director of Licensed Customs Agents (NCMDLCA), have told President Muhammadu Buhari that there is no provision for the National Automotive Council (NAC) levy of 15 per cent in either the 2020 or 2021 Finance Act, stressing that its implementation by the Nigeria Customs Service (NCS) is illegal.\nAmiwero, who was also a member of the presidential committee on the review of customs laws, therefore, called for a review of the auto policy.\nAccording to him, the Finance Act 2020 specifically approves for motor vehicles the amendment of the First Schedule to the Act, which is amended by inserting and replacing duties and levies.\nHe said: “Duty on Tractors (Heading 8701) from 35 per cent to five per cent; duty on motor vehicles for the transportation of more than 10 persons (HS Heading 8702) from 35 per cent to 10 per cent; levy on motor vehicles for transportation of persons (cars) (HS Headings 8703) from 35 per cent to five per cent and duty for motor vehicles for transportation of goods (HS Heading 8704) from 35 per cent to 10 per cent”.\n“Finance Act provides for five per cent levy for Motor vehicles of Chapter 8703, that is cars; there is no provision for NAC levy of 15 per cent in either 2020 and 2021 Finance Act passed by the National Assembly and signed in to law."
  },
  {
    "headline": "Flour Mills of Nigeria Completes Acquisition of 71% Stake in Honeywell Flour Mills",
    "summarized_story": "Flour Mills of Nigeria Plc (FMN) has announced that it has completed the acquisition of a 71.69 per cent stake in Honeywell Flour Mills Plc (HFMP).\nIt also acquired a 5.06 per cent stake in HFMP held by First Bank of Nigeria Limited.\n“At a total enterprise value of N80 billion, Honeywell Group disposed of a 71.69 per cent stake in HFMP to FMN.\n“Our combined brands and businesses will mean an expansive scale of food production for both Nigeria and Africa and together, Flour Mills of Nigeria and Honeywell Flour Mills will be able to achieve rapid growth while maintaining high-quality products serving the evolving needs of our consumers.\n“As we entrust Flour Mills of Nigeria with building on Honeywell Flour Mills’ strong legacy, we will work closely with them to ensure seamless integration, setting the combined company up for a successful future."
  },
  {
    "headline": "Nigeria: Jonathan’s Rumoured Ambition Poses No Threat, Say Osinbajo, Tinubu’s Support Groups",
    "summarized_story": "Jonathan had recently revealed that he was still considering the call on him to contest the 2023 presidential election.\nReacting, the Tinubu Support Group (TSG) said that it remained unperturbed about the speculation that Jonathan would contest on the platform of APC.\nAdeyanju thought that the purported coming of Jonathan to APC would not jeopardise the chances of the former Governor of Lagos state.\nHe noted that it was laughable to abhor the thought that Jonathan’s entrants into the race would scuttle Osinbajo’s chances.\nHe said the ruling party knows Okorocha’s credentials, adding that it doesn’t matter if former President Jonathan joins the race."
  },
  {
    "headline": "OPEC Signs Deal to Fund Feasibility Study of $25bn Nigeria-Morocco Gas Pipeline",
    "summarized_story": "The Organisation of Petroleum Exporting Countries (OPEC) Fund has announced that it will contribute $14.3 million to Phase II of the feasibility study for the Nigeria-Morocco Gas Pipeline estimated at $25 billion.\nThe study will carry out detailed evaluations of the implementation and design process for the eventual construction of the gas pipeline, thus facilitating the final investment decision.\nMorocco and the OPEC Fund signed an agreement at the weekend to jointly fund the feasibility study ahead of the construction of the world’s longest offshore pipeline connecting Nigeria to Morocco.\nCo-financed with the Islamic Development Bank (IDB), the study comprises a body of research on the execution of the Nigeria-Morocco Gas Pipeline, including the technical, financial, and legal aspects, a statement after the event indicated.\nThe five oil majors initially owed by the national oil company were: Shell Petroleum Development Company (SPDC), Mobil Producing, Nigeria, Chevron Nigeria Limited, Total Exploration as well as Nigeria Agip Oil Company (NAOC)."
  },
  {
    "headline": "I will Support Whoever is Buhari and APC’s Choice for President, Says Transportation Minister Amaechi",
    "summarized_story": "Nigeria’s Minister of Transportation, Rotimi Amaechi, on Saturday said he would support President Buhari and APC’s chosen candidate for the 2023 presidential election.\nAmaechi, in a statement, said this at a consultative meeting with executives, delegates and another party faithful at the Rivers APC Secretariat at the weekend.\nThe minister indicated that in his bid to become the President of Nigeria, which he is thoroughly qualified for, he was neither desperate nor disloyal.\n“We will run and I am loyal to the President and I am loyal to the party.\n“If the party and President choose anybody, I will support the person, if the party chooses me, I will be glad and say thank God,” Amaechi explained."
  }
]