[
  {
    "headline": "Pictorial: Fourth batch of Nigerians arrive from Ukraine",
    "summarized_story": "The fourth batch of Nigerians in Ukraine evacuated back to the country arrived at the Nnamdi Azikiwe International Airport, Abuja on Sunday night.\nSee photos below:Credit: Nneka Ikem AnibezeCopyright PUNCH.\nAll rights reserved.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "Osimhen overpriced by Napoli – Italian media",
    "summarized_story": "ACCORDING to Italian publication, Corriere della Sera, Nigeria international Victor Osimhen is being overpriced by Napoli, a strategy by the Italian club to wade off suitors, PUNCH Sports Extra reports.\nOsimhen has been linked with a move away from Napoli, having spent just two seasons with the Parthenopeans following his record €81m move from Lille in the summer of 2020.\nCorriere della Sera stated that Osimhen is been overpriced by Napoli.\nIt is certainly a strategy to lock the centre forward of the future.”Despite being plagued by injury this season, Osimhen has scored 11 goals and registered four assists in 22 appearances across all competitions.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Ukraine-Russia war: Nigeria, others may face commodity supply disruptions, says IMF",
    "summarized_story": "The International Monetary Fund says countries that have very close economic links with Ukraine and Russia are at particular risk of scarcity and supply disruptions.\nIt added that poor households across the world would suffer from the increase in food and fuel prices, as the Ukraine-Russia war persists.\nThe Washington-based Fund said this on Saturday in a press statement, which was titled ‘IMF Staff Statement on the Economic Impact of War in Ukraine’.\nAccording to the statement, the economic consequences are dire for the world, as there is a surge in energy and commodity prices.\nEnergy and commodity prices—including wheat and other grains—have surged, adding to inflationary pressures from supply chain disruptions and the rebound from the Covid‑19 pandemic."
  },
  {
    "headline": "Jonathan congratulates Obasanjo at 85",
    "summarized_story": "Former President Dr Goodluck Ebele Jonathan has felicitated Ex-President Chief Olusegun Obasanjo on the occasion of his birthday describing him as a leader with a good reputation in statesmanship.\nIn a message of goodwill he personally signed, Dr Jonathan noted that Chief Obasanjo’s legacies “have continued to endure many years after you left office as President of the Federal Republic of Nigeria.”Dr. Jonathan stated further:“I join your family and friends to celebrate you as you mark your birthday this year.\nYou are an accomplished leader, with a sterling reputation in statesmanship and a peacemaker in Nigeria and across Africa.\n“Your legacies in Nigeria and Africa have continued to endure many years after you left office as President of the Federal Republic of Nigeria.\n“As you celebrate, on behalf of my family and the Goodluck Jonathan Foundation, I wish you more strength, good health and peace in all spheres of life."
  },
  {
    "headline": "Security Challenges: Buhari alerts citizens, lauds security agencies",
    "summarized_story": "President Muhammadu Buhari commenced the week under review, with a call on Nigerians to get more interested in working with security agencies to tackle myriad challenges facing the country.\nThe president also approved $8.5 million for immediate evacuation of about 5,000 Nigerians caught in Russia/Ukraine war, during the week.\n”We have demonstrated this over time, as we have had cause to evacuate our citizens in harm’s way abroad.\nWhile in Kenya, Buhari participated in the Special Session to commemorate the 50th anniversary of the United Nation’s body.\nDuring the meeting, Buhari directed collaboration between the Ministries of Environment, Water Resources, Agriculture and Rural Development and Power to combat desertification."
  },
  {
    "headline": "Constitution Amendment: Injustice against women cannot stand, APC women leader tells National Assembly",
    "summarized_story": "“Since the return of democracy Nigerian Women have been at the forefront of supporting Nigeria’s democracy structures.\n“Nigerian women have oftentimes been recipients of the violence that had come from elections and political processes that have failed.\nIt is in our view that Nigerian women deserve better and should not continually be treated as second-class citizens but as equal partners in nation-building.\n“Nigerian lawmakers should urgently revisit this faux pas in order to redress this great injustice meted to Nigerian women or risk losing the support of the bulk of Nigerian women.\n“There has been no equity nor Justice in the disenfranchisement of the Nigerian women as done by Nigerian lawmakers."
  },
  {
    "headline": "Agropartnerships payouts to resume in July – Co-founders",
    "summarized_story": "Banking hallBy Chioma ObinnaTo redeem payout commitments to all stakeholders, Agropartnerships have announced that payouts will resume in July 2022.\nThe Co-founder, Agropartnerships, Uyi Osayimwense, who made known during a virtual stakeholder meeting which also featured the presentation of a consolidated payout plan assured partners that the company was committed to clearing all payouts, adding that, the company was working relentlessly to strengthen its pillars for longevity in the sector.\nMore importantly, it ensures partners are paid in the earliest possible time frame.\n“I can assure you that everyone has worked tirelessly with us and our internal teams to fully analyze the situation – past and future maturing cycles, operations, future cash flows, risks, and opportunities.\n“While we plan to begin Interest payments in July 2022, all payments will be made in three batches, July 2022, Oct 2022, and Feb 2023”."
  },
  {
    "headline": "YEDI tasks FG, States on NTDs, takes outreach to Kosofe LGA",
    "summarized_story": "According to the World Health Organisation, WHO, Neglected tropical diseases (NTDs) are a diverse group of 20 conditions that are mainly prevalent in tropical areas, where they mostly affect impoverished communities and disproportionately affect women and children.\nStatistics available have shown that about 1.5 billion people are affected by NTDs globally and Nigeria contributes not less than 40 percent of the global burden of NTDs.\nSpeaking during an NTDs outreach organised for residents of Precious Seed Community, Ferry, Oworoshoki area of Lagos, Adeoye lamented that lack of awareness and non-availability of drugs were affecting NTDs treatments in Nigeria.\nShe disclosed that YEDI has taken the NTDs outreach to Mile 12 where two cases of elephantiasis were discovered.\nShe said YEDI is targeting to reach 1,000 people by June and two million through social media."
  },
  {
    "headline": "Russian terrorism must be stopped, Putin bombed airport with eight missiles – Ukrainian minister",
    "summarized_story": "The Ukrainian government on Sunday said eight Russian missiles have destroyed the airport in Vinnytsia in central Ukraine.\nUkraine’s Minister of Foreign Affairs Dmytro Kuleba, disclosed this while calling the Russian President, Vladimir Putin’s action as cowardly and barbaric.\nThe minister described the bombardment as Russian terrorism.\nHe wrote: “Eight Russian cruise missiles hit Vinnytsia, a large city far from the frontline.\n“Putin continues his cowardly and barbaric missile strikes, air bombardment of civilians."
  },
  {
    "headline": "Agricultural sector is Nigeria’s saving grace – Emefiele",
    "summarized_story": "The Governor, Central Bank of Nigeria (CBN), Mr. Godwin Emefiele, has expressed satisfaction with the high level of interest in the Nigerian agricultural sector and the impact across value chains in the past six years.\nThe CBN governor made the remarks at the weekend during the inspection of a palm plantation at Odighi, Ovia North East Local Government Area of Edo State, over the weekend.\nWhile addressing journalists, Emefiele commended President Buhari’s foresight in revamping the agricultural sector with the CBN playing a major role.\nOn his assessment of the farm in Odighi, Emefiele, expressed optimism that palm produce harvests would commence in the next 12 months.\nThe CBN Governor who was visibly elated by the strides being recorded in the production of maize and cassava at the farm acknowledged the significant role played by the Edo State Government."
  },
  {
    "headline": "Blinken exposes Ukraine’s major ‘plan’ in war with Russia",
    "summarized_story": "United States Secretary of State, Antony Blinken, has revealed Ukraine’s plan amid Russia’s invasion of their country.\nBlinken said Ukrainians have a plan for “continuity of government one way or another” should anything happen to their President Volodymyr Zelensky amid war with Russia.\nBlinken also praised Zelensky for his “leadership” through this crisis.\nHe said, “The leadership that President Zelensky has shown, the entire government has shown is remarkable, they have been the embodiment of these incredibly brave Ukrainian people.”Meanwhile, the war between Russia and Ukraine began last month.\nRussian President Vladimir Putin had ordered the invasion of Ukraine over disagreement on some political issues."
  },
  {
    "headline": "Police arrest suspected motorcycles supplier to bandits in Zamfara",
    "summarized_story": "Police in Kano State have arrested a 44-year-old Ali Muhammad, for allegedly supplying motorcycles to bandits in Zamfara State.\nHe said the suspect was arrested on Friday, in possession of four brand new Honda ACE-125 Motorcycles, popularly known as ‘’Boko Haram’’.\nKiyawa said the suspect confessed to have been conspiring with two others to transport motorcycles to bandits in Zamfara State where they are banned.\nHe said the Commissioner of Police, Kano State Command, CP Sama’ila Shu’aibu Dikko, ordered for discreet investigation, after which case will be charged to court for prosecution.\nCriminals in Northern part of Nigeria are mostly using motorcycles for kidnapping and attacks on communities."
  },
  {
    "headline": "Buhari sympathizes with Keyamo over father’s death",
    "summarized_story": "President Muhammadu Buhari extends heartfelt condolences to the Minister of State, Labour and Employment, Festus Keyamo, SAN, on the passing of his beloved father.\nBuhari’s condolence message was released by Garba Shehu, the Senior Special Assistant to the President on Media and Publicity, on Sunday.\nThe President joins members of the Keyamo family, friends and the people of Effurun in Uvwie Local Government Area of Delta State in mourning Pa Mattias, a respected community leader, who loved his children with great passion and did his best to prepare them for leadership positions and opportunities.\nPresident Buhari urges the family of Keyamo to draw inspiration from the strength of character of their beloved father and grandfather, even as he prays that God will comfort them at this time.\n“May the soul of the departed rest in peace,” the President prayed."
  },
  {
    "headline": "Constitutional amendment: National Assembly to engage governors, Speakers",
    "summarized_story": "The National Assembly is to engage governors of the 36 states of the federation to ensure smooth endorsement of the ongoing process of constitutional amendment by the Houses of Assembly.\nThe lawmakers are also to sustain the current engagement with Speakers of the Houses of Assembly to ensure that they do not truncate the amendment process.\nBut the Bills that sailed through the mandatory two-thirds of the National Assembly will now be sent to the states’ Houses of Assembly for concurrence before they are sent for Presidential assent.\nHe said: “The chairman of the ad hoc committee and the members have been meeting with the Speakers of the 36 Houses of Assembly.\nSo, there is a relationship between the Federal and the states on this constitutional amendment already.”"
  },
  {
    "headline": "NESI loses $743.49m to TCN’s failure to wheel 743,490MW",
    "summarized_story": "This energy production data is contained in the “Power Sector Data 2021: Energy Generated and Sent Out,” of the National Bureau of Statistics (NBS).\nThe document shows that the Electricity Generation Companies (GenCos) produced 36, 639,920MW in the year under review.\nIt stated this in its document, titled: Power Sector data 2021: Energy Generated and Sent Out, by NBS.\nThe document shows that in the period under review, the TCN wheeled 35,654,430MW to the 11 DisCos, indicating that the TCN failed to wheel 743,490MW in 2021.\nAccording to the document, electricity generated in Q4, 2021 rose by 4.53 per cent with 9,077.80 (GWh), compared to Q3, 2021, while 8,894.97 (GWh) was transmitted."
  },
  {
    "headline": "Stop discriminating against girl-child, JAMB Registrar urges Nigerians",
    "summarized_story": "Registrar of the Joint Admissions and Matriculation Board (JAMB), Prof. Is-haq Oloyede, has advised Nigerians against discriminating against the girl-child, particularly in the area of education.\nNAN also reports that the theme of the celebration was: Celebration of the Girl-child Education.\nThe JAMB registrar noted that education of every child, whether male or female, mattered.\nSpeaking on the new professor, the JAMB registrar recalled that her father gave birth to seven daughters, some of whom include doctor, pharmacist and lecturer.\nIn her remarks, Mrs. Balogun said the celebration of the girl-child education was borne out of the need to increase awareness on more effective utilisation of women."
  },
  {
    "headline": "Charges against Kyari not meant to scuttle extradition, says NDLEA",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has said former Commander of the Intelligence Response Team (IRT) of the Nigeria Police Force, Deputy Commissioner of Police (DCP) Abba Kyari, who was arrested for suspected drug trafficking, has not been paraded because it is not the custom of the agency.\nHe also debunked speculations that the charges against Kyari, who will be arraigned today, were meant to scuttle extradition efforts against the suspended police officer, as they had been filed since February 28, 2022.\n“I would love to state that the NDLEA did not file charges against these individuals just yesterday.\nThe charges were filed against them since February 28, 2022.\n“This is to correct the insinuation that probably the NDLEA rushed to court to go and file charges after extradition charges were filed against one of the key suspects."
  },
  {
    "headline": "Report: Businesses got N24.57tr loans from banks in 2021",
    "summarized_story": "Commercial banks gave N4.09 trillion more loans to businesses last year, a Central Bank of Nigeria (CBN) report has shown.\nThe report said the banks granted N24.57 trillion credit to manufacturing, general commerce and oil and gas sectors in 2021.\nThe apex bank report attributed the growth in bank credit to the Loan to Deposit Ratio policy of the CBN.\nAccording to him, the Non-Performing Loans (NPLs) Ratio fell below the five per cent prudential requirement, for the first time, after a lengthy period.\nThe CBN deputy governor said the stress test results showed resilience of banks’ solvency and liquidity ratios in response to potential severe macroeconomic shocks."
  },
  {
    "headline": "I’m not leaving PDP for anyone; accept my leadership or leave – Obaseki to detractors",
    "summarized_story": "From Tony Osauzo, BeninThe Edo State Governor, Mr. Godwin Obaseki, at the weekend, said he has no plan of defecting from the Peoples Democratic Party (PDP), urging anyone who is uncomfortable with his leadership of the party to leave.\n“There is no division in Edo PDP.\n“I heard that Chief Dan Orbih went around, saying there is no harmonization in Edo PDP.\nThe governor while harging detractors sponsoring disunity in the state to stop forthwith, said, “Edo is Edo, leave Edo State alone.\nOn his part, the Chairman PDP Edo State, Anthony Aziegbemi, said “Edo State is the only state in the nation that has surpassed the 500,000 thresholds for e-registration of the party.”Others at the meeting include the Deputy Governor of Edo State, Rt."
  },
  {
    "headline": "Awolowo believed in Nigeria’s unity – Gowon",
    "summarized_story": "By Sunday AniFormer Head of State, Gen Yakubu Gowon has said that late Chief Obafemi Awolowo believed in the unity of Nigeria and did everything within his powers to keep Nigeria one during his lifetime.\n“These are some of the values that Chief Awolowo embodied in his lifetime service to Nigeria.\nBut the reverse is the case with Chief Awolowo.\nIn his remarks, former President Mahama noted that as a journalist, lawyer, politicians and statesman, Chief Awolowo was humble, modest, resilient and has unquestionable love for Nigeria.\nHe lamented that those values that Chief Awolowo embodied were conspicuously lacking not only in Nigeria but in Africa as a whole."
  },
  {
    "headline": "Again uncertainty trails APC March 26 national convention",
    "summarized_story": "From Romanus Ugwu, AbujaThere are clouds of uncertainty hanging over the national convention of the ruling All Progressives Congress (APC) a few weeks to the much-postponed exercise following the failure of the party’s national leadership to write a fresh notification to the Independent National Electoral Commission (INEC) within the 21-day legal window.\nAlready, the APC Caretaker/Extraordinary Convention Planning Committee (CECPC) had equally reneged in its earlier released timetable and schedule of activities, failing to start the sale of nomination forms for zonal congresses fixed to hold between Monday, February 28 to Thursday, March 3, 2022.\nAlthough the ruling party made a U-turn to fix the convention for March 26, it did not open another correspondence with the commission to notify it of the change in the arrangement for the convention, 21 days to the scheduled date.\nSpeaking to Sunday Sun on telephone, a source at the Commission said that he cannot authenticate the receipt of any fresh correspondent from the ruling party, saying that the commission ought to have received the fresh letter by yesterday.\nHowever, I want to also add that they still have a window of writing a reminder instead of a new letter,” he said."
  },
  {
    "headline": "2022 International Women Day: Nigerian women berate NASS",
    "summarized_story": "But at the National Assembly, a wholly different situation was brewing for the Nigerian women.\n“I can assure you that women in Nigeria have not shown enough readiness to break the bias.\nWhen such things happened members of the National Assembly were angry, saying they could not tolerate that kind of treatment.\nBecause of these discriminatory practices women entrepreneurs face, a lot of women are discouraged and cannot even take off from ground zero.\n“I sat back and looked inwards, got myself well equipped to face the battle and realized that gender bias cannot be killed by fire, but by knowledge!"
  },
  {
    "headline": "Yahaya Bello: North-central stakeholders dismiss Nasarawa council’s call",
    "summarized_story": "According to the APC chieftains, Bello holds the overwhelming mandate of the North-central and Nigerians as a whole to succeed President Muhammadu Buhari.\n“Without mincing words, we are the authentic APC Stakeholders in the North-central and there is no other apart from us.\nWhat has come to stay, through popular demand, is that Yahaya Bello will contest presidency notwithstanding where the party’s chairmanship position is zoned to.\nEven if the party’s chairmanship is zoned to Okene Local Government, Yahaya Bello will contest and we will ensure victory for him by God’s grace.\n“Governor Yahaya Bello has demonstrated capacity, excellence and unequalled competence in governance and he holds the overwhelming mandate of the North-central and Nigerians as a whole to succeed President Muhammadu Buhari."
  },
  {
    "headline": "Kyari Stands Down Keynote in US Summit in Order to Fix Fuel Scarcity",
    "summarized_story": "* NNPC intensifies monitoring of product distribution to end queuesEmmanuel Addeh in Abuja and Peter Uzoho in LagosGroup Managing Director of the Nigerian National Petroleum Company (NNPC), Mallam Mele Kyari, will miss his engagement at this year’s energy summit, tagged: ‘CERAWeek’ in the United States, billed to start tomorrow.\nNNPC also yesterday stepped up efforts to end the ongoing petrol scarcity with a product evacuation and distribution monitoring visit to two of the major petroleum products terminals in Lagos.\nKyari was said to have told his associates that given the mood of the nation, it would be inappropriate to leave the country at this time when the supply of adequate petrol had become problematic.\nDespite NNPC’s efforts to bridge the supply gap, long fuel queues have continued to dot several filling stations across the country.\nMeanwhile, the company yesterday stepped up efforts to end the ongoing petrol scarcity with a product evacuation and distribution monitoring visit to two of the major petroleum products terminals in Lagos."
  },
  {
    "headline": "Emefiele: InfraCo to Begin Talks with FG, Lagos, on Expansion of Lekki-Epe Road Infrastructure",
    "summarized_story": "Emefiele spoke yesterday, during a tour of Tolaram Group’s industries, which occupied 850,000 acres of land with industrial investment pegged at $2.1 billion within the Lagos Free Zone.\nAccording to him, InfraCo, in aiding the road construction, would decongest the environs of the Lagos Free Zone with the active collaboration with the federal and Lagos State governments.\nSpecifically, he said the commencement of the Lagos Free Zone will help overcome the Apapa-Tincan Island port congestion.\n“We would like to work with you to see how we would create a clear demarcation that separates companies that operate as free trade zones or operating in free trade zone from those that will not operate as free trade zone.\n“Whereas you will also find that a company may want to operate as a free trade zone and at the same time operate the other way."
  },
  {
    "headline": "NNPC Seeks to ‘Pre-empt Mobil on Asset Sale to Seplat’",
    "summarized_story": "However, THISDAY learnt from officials NNPC, that the state-owned oil giant has opted to exercise its Right of First Refusal (RFR) on the sale of the assets.\nThe RFR is reportedly contained in the Joint Operating Agreement (JOA) of the Joint Venture (JV), which represents NNPC’s position on the planned sale of the shares to Seplat Energy Plc.\nThe source stressed that NNPC did not have the power to halt the acquisition of the multinational oil company’s shares by Seplat.\nSeplat Energy subsequently put forward a winning bid for the assets and reached an agreement with ExxonMobil.\nAkinosho maintained, “NNPC is in JV with companies that produce at least 45 per cent of our crude."
  },
  {
    "headline": "FG Green-lights DCP Kyari’s Extradition to United States",
    "summarized_story": "Few hours after the extradition process commenced, the National Drug Law Enforcement Agency (NDLEA), which currently has Kyari in its custody following his arrest for alleged illicit drug dealing, also initiated a court process against him.\nNDLEA filed an eight-count criminal charge against the defendants at the Federal High Court, Abuja.\nThe implication of the NDLEA court action against Kyari is that he cannot be extradited to the US, even though the federal government has commenced the extradition process.\nHe noted that there was no criminal proceeding pending against Kyari in Nigeria for the same offence.\nThe charge, filed yesterday and marked FHC/ABJ/CR/57/2022, was signed by NDLEA’s Director, Prosecution and Legal Services, Mr. Joseph Sunday."
  },
  {
    "headline": "INEC: We are Not Registering New Parties Because They Won’t Participate in 2023 Elections",
    "summarized_story": "INEC, which claimed that the reason was because the new Electoral Act barred the registration of new political parties to participate in any general election twelve months before, added also that the same new electoral law, allowed for the merger of political parties, only nine months to the general elections.\nThere are currently 18 registered political parties in the country.\nUnder the new law, the Commission shall issue the Notice of Election not later than 360 days before the date fixed for the conduct of elections.\nAccordingly, he said a good knowledge of the law and its provisions would assist in crafting good editorials and holding the Commission and the Political Parties accountable to their implementation.\n“The Commission has introduced an online nomination portal through which Political Parties upload the list and personal particulars of their nominated candidates."
  },
  {
    "headline": "BREAKING: Sowore’s Lawyer Arrested Over N200million Lawsuit Against Businessman, Ned Nwoko And Nigeria Police",
    "summarized_story": "Men of the Nigeria Police Force have arrested a lawyer, Abubakar Marshall of the Falana & Falana Chambers for filing a lawsuit on behalf of human rights activist, Omoyele Sowore against businessman and former lawmaker, Ned Nwoko, and the security agency.\nSaharaReporters gathered that Marshall was traced to his home and forcefully arrested by the security operatives for defending the activist.\nThe officers accused the lawyer of embarrassing the Nigerian government, police authorities and Nwoko over his action.\nSowore had during the week filed a lawsuit against Nwoko and the Nigeria Police Force over his illegal arrest and detention last Thursday.\nSee Also Breaking News BREAKING: Sowore Slams N200million Lawsuit Against Businessman, Ned Nwoko And Nigeria Police For Illegal ArrestThe suit is between Omoyele Sowore and the Nigeria Police Force as the first respondent, the Inspector-General of Police as the second respondent, the Commissioner of Police, Abuja and Ned Munir Nwoko as the third and fourth respondents respectively."
  },
  {
    "headline": "BREAKING: Sowore’s Lawyer Arrested Over N200million Lawsuit Against Businessman, Ned Nwoko And Nigeria Police",
    "summarized_story": "Men of the Nigeria Police Force have arrested a lawyer, Abubakar Marshall of the Falana & Falana Chambers for filing a lawsuit on behalf of human rights activist, Omoyele Sowore against businessman and former lawmaker, Ned Nwoko, and the security agency.\nSaharaReporters gathered that Marshall was traced to his home and forcefully arrested by the security operatives for defending the activist.\nThe officers accused the lawyer of embarrassing the Nigerian government, police authorities and Nwoko over his action.\nSowore had during the week filed a lawsuit against Nwoko and the Nigeria Police Force over his illegal arrest and detention last Thursday.\nSee Also Breaking News BREAKING: Sowore Slams N200million Lawsuit Against Businessman, Ned Nwoko And Nigeria Police For Illegal ArrestThe suit is between Omoyele Sowore and the Nigeria Police Force as the first respondent, the Inspector-General of Police as the second respondent, the Commissioner of Police, Abuja and Ned Munir Nwoko as the third and fourth respondents respectively."
  },
  {
    "headline": "BREAKING: Sowore’s Lawyer Arrested Over N200million Lawsuit Against Businessman, Ned Nwoko And Nigeria Police",
    "summarized_story": "Men of the Nigeria Police Force have arrested a lawyer, Abubakar Marshall of the Falana & Falana Chambers for filing a lawsuit on behalf of human rights activist, Omoyele Sowore against businessman and former lawmaker, Ned Nwoko, and the security agency.\nSaharaReporters gathered that Marshall was traced to his home and forcefully arrested by the security operatives for defending the activist.\nThe officers accused the lawyer of embarrassing the Nigerian government, police authorities and Nwoko over his action.\nSowore had during the week filed a lawsuit against Nwoko and the Nigeria Police Force over his illegal arrest and detention last Thursday.\nSee Also Breaking News BREAKING: Sowore Slams N200million Lawsuit Against Businessman, Ned Nwoko And Nigeria Police For Illegal ArrestThe suit is between Omoyele Sowore and the Nigeria Police Force as the first respondent, the Inspector-General of Police as the second respondent, the Commissioner of Police, Abuja and Ned Munir Nwoko as the third and fourth respondents respectively."
  },
  {
    "headline": "Nigerians Have Suffered Worse Than This Before, They’ll Survive Current Fuel Scarcity, Poor Power Supply —Buhari's Aide, Femi Adesina",
    "summarized_story": "The Special Adviser to the President on Media and Publicity, Femi Adesina says Nigerians will survive the current fuel scarcity.\nAdesina in his latest weekly article on Thursday titled “KNOCK, KNOCK.\nHe’s also working night and day, ensuring the country has fuel, power, infrastructure, and all the good things of life.\nI’m gonna knock and ring and tap until you do.” Are you like King Lear at his gloomy worst?\n“Be patient my soul, thou hath suffered worse than this.”“There were cases of bad fuel before in this country."
  },
  {
    "headline": "Nigerians Have Suffered Worse Than This Before, They’ll Survive Current Fuel Scarcity, Poor Power Supply —Buhari's Aide, Femi Adesina",
    "summarized_story": "The Special Adviser to the President on Media and Publicity, Femi Adesina says Nigerians will survive the current fuel scarcity.\nAdesina in his latest weekly article on Thursday titled “KNOCK, KNOCK.\nHe’s also working night and day, ensuring the country has fuel, power, infrastructure, and all the good things of life.\nI’m gonna knock and ring and tap until you do.” Are you like King Lear at his gloomy worst?\n“Be patient my soul, thou hath suffered worse than this.”“There were cases of bad fuel before in this country."
  },
  {
    "headline": "FG: Evacuation of Nigerian students trapped in Ukraine begins tomorrow",
    "summarized_story": "Geoffrey Onyeama, minister of foreign affairs, says the evacuation of the stranded Nigerian students in Sumy State University (SumDU), Ukraine, will start on Monday, March 7.\nGiving an update on Sunday, the minister said approval has been given for the evacuation of the students.\nAdvertisement1/2 Deep gratitude to @DmytroKuleba, Foreign Minister of Ukraine for approval given, as promised, to establish humanitarian corridor and authorize evacuation of Nigerian students from Sumy starting tomorrow.\nAdvertisement“Deep gratitude to @DmytroKuleba, Foreign Minister of Ukraine for approval given, as promised, to establish humanitarian corridor and authorize evacuation of Nigerian students from Sumy starting tomorrow,” Onyeama said in a Twitter post.\nGreat commitment by Nigerian Ambassador to Ukraine, Shina Alege.”As part of efforts to get Nigerians out of Ukraine, the federal government approved $8.5 million for their evacuation."
  },
  {
    "headline": "FG: Evacuation of Nigerian students trapped in Ukraine begins tomorrow",
    "summarized_story": "Geoffrey Onyeama, minister of foreign affairs, says the evacuation of the stranded Nigerian students in Sumy State University (SumDU), Ukraine, will start on Monday, March 7.\nGiving an update on Sunday, the minister said approval has been given for the evacuation of the students.\nAdvertisement1/2 Deep gratitude to @DmytroKuleba, Foreign Minister of Ukraine for approval given, as promised, to establish humanitarian corridor and authorize evacuation of Nigerian students from Sumy starting tomorrow.\nAdvertisement“Deep gratitude to @DmytroKuleba, Foreign Minister of Ukraine for approval given, as promised, to establish humanitarian corridor and authorize evacuation of Nigerian students from Sumy starting tomorrow,” Onyeama said in a Twitter post.\nGreat commitment by Nigerian Ambassador to Ukraine, Shina Alege.”As part of efforts to get Nigerians out of Ukraine, the federal government approved $8.5 million for their evacuation."
  },
  {
    "headline": "We have credible reports of war crimes in Ukraine, says US",
    "summarized_story": "Anthony Blinken, US secretary of state, says there are “very credible reports of deliberate attacks” on civilians in Ukraine by Russian soldiers.\nBlinken said the US has begun the documentation of all available evidence to determine whether or not war crimes have been committed against Ukrainian civilians.\nThey’re very credible and we’re documenting everything.”Karim Khan, an International Criminal Court (ICC) prosecutor, on Thursday, said he had opened an investigation into possible war crimes and crimes against humanity in Ukraine.\n“In his rhetoric right now he uses the word nuclear threats abundantly,” Yushchenko had told ABC News.\n“His occupation of Chernobyl and Zaporizhzhia nuclear plants is his idea of being a macho man that he is so strong that he can exploit nuclear threats to achieve his goals."
  },
  {
    "headline": "We have credible reports of war crimes in Ukraine, says US",
    "summarized_story": "Anthony Blinken, US secretary of state, says there are “very credible reports of deliberate attacks” on civilians in Ukraine by Russian soldiers.\nBlinken said the US has begun the documentation of all available evidence to determine whether or not war crimes have been committed against Ukrainian civilians.\nThey’re very credible and we’re documenting everything.”Karim Khan, an International Criminal Court (ICC) prosecutor, on Thursday, said he had opened an investigation into possible war crimes and crimes against humanity in Ukraine.\n“In his rhetoric right now he uses the word nuclear threats abundantly,” Yushchenko had told ABC News.\n“His occupation of Chernobyl and Zaporizhzhia nuclear plants is his idea of being a macho man that he is so strong that he can exploit nuclear threats to achieve his goals."
  },
  {
    "headline": "Russian military unlikely to obey Putin on nuclear warfare, says ex-Ukraine president",
    "summarized_story": "Viktor Yushchenko, Ukraine’s former president, says the Russian military will not be willing to launch a nuclear attack if ordered to do so by Vladimir Putin.\nRussian troops have been advancing further into Ukraine in recent days while Putin has put his country’s nuclear forces on high alert.\nIn an interview with ABC News, Yushchenko said Putin’s nuclear plants make him feel like a “macho man”.\nAdvertisement“In his rhetoric right now he uses the word nuclear threats abundantly,” he said.\n“His occupation of Chernobyl and Zaporizhzhia nuclear plants is his idea of being a macho man that he is so strong that he can exploit nuclear threats to achieve his goals."
  },
  {
    "headline": "Vault Hill is building a human-centric metaverse. What about it?",
    "summarized_story": "To differentiate itself from other virtual spaces and metaverse, Vault Hill City (Vault Hill’s Metaverse) has four different islands and each island has 7 human-themed districts: Play, Romance, Curiosity, Community, Idealism, Vitality, and Imagination.\nVault Hill is also partnering with Ready Player Me to build out avatars and incorporate digital wearables and limited-edition accessories.\nThat is, using one avatar across multiple metaverses instead of having to create one for Vault Hill, and another for Decentraland,” Vault Hill said.\nVault Hill Part is also partnering with Lingua54 to use machine learning to translate the speeches of avatars across different languages in real time.\nThe first glance of Vault Hill City will be up by Q2 2022 and by the end of the year, it will be fully running."
  },
  {
    "headline": "Two years and 3 million rides later, can SafeBoda keep its lead in Nigeria?",
    "summarized_story": "On Wednesday, Ibadan-based Ugandan bike hailing startup SafeBoda clocked two years of operating in the Nigerian market.\nAnd by the end of the year, while it was pausing its Kenyan operation, it celebrated half a million rides in Nigeria.\nFast forward to today, SafeBoda claims to have recorded over 3 million rides, more than 10,000 riders, over 100,000 users, and completed 50,000 deliveries.\nThe startup currently offers 3 services in Nigeria: rides, deliveries, and airtime purchase.\nSafeBoda riders are highly regarded and respected, not just because of the colour but because of their conduct,” said Clement Obaro, Growth Manager at SafeBoda."
  },
  {
    "headline": "Facebook content moderators in Kenya to receive 30-50% pay raise, following complaints",
    "summarized_story": "Facebook content moderators in Kenya will receive a 30-50% pay rise.\nAlthough the pay raise is welcomed by many of the content moderators, some still say it’s not enough.\nWhile the lowest starting salary of a Facebook content moderator at Sama is $2.20 per hour, outsourced content moderators for Facebook in the U.S. are paid a typical starting salary of $18 per hour.\nMeta, Facebook’s parent company also declined to comment on the announcement of the pay raise.\nThe announcement of the pay raise is seen as a win for the content moderators and validation of the power in employees speaking up."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, What comes to mind when you hear the term \"financial inclusion\"?\nI asked because it has become a..."
  },
  {
    "headline": "S2PAfrica holds its 2022 Regional Engineering Design Competition(EDC) Awards Ceremony",
    "summarized_story": "Share this article:S2PAfrica, a non-profit organisation aiming to groom professional engineers in Sub-saharan Africa, held its annual regional engineering design competition(EDC) awards ceremony on February 26, 2022.\nDr Nadu Denloye, current Chair, ICT committee, the Nigerian Academy of Engineering (NAE), served as the chair for the Engineering design competition.\nTeam EASS won the Energy efficiency category prize of $500, while Team Capture won the Harnessing Ignored Energy category prize of $500.\nThe S2PAfrica regional engineering design awards were announced, starting with the second runner-up award, which Team Improved Charcoal Stove won.\nTeam Koye was announced the winner of the 2022 S2PAfrica regional engineering design competition."
  },
  {
    "headline": "How to improve customer experience",
    "summarized_story": "Today, I’ll be discussing:How to improve customer experienceMTN in the metaverseSudo Africa’s $3.7 million pre-seedChari’s new acquisitionImproving customer experienceWhat is the most memorable customer service experience you’ve had?\nCustomer experience – the feeling or memory that a customer or prospective customer has whenever they come in contact with a business – is dependent on a company’s customer service.\nSo, how can customer experience be enhanced?\nMyServiceAgent is a technology company offering a variety of tools to businesses to improve the customer experience.\nChimgozirim walks us through what they do and how the company uses AI to help companies to improve their customer experience."
  },
  {
    "headline": "Inside NIPOST’s latest financial inclusion play: Agency banking and fingerprint authentication",
    "summarized_story": "In January 2022, NIPOST unveiled its new agency banking platform at a ceremony in Nigeria’s capital, Abuja.\nAdvertisementAccording to Isa Pantami, Minister of Communications and Digital Economy, the agency banking platform would follow the Universal Postal Union’s (UPU) standards on financial inclusion.\nBy UPU standards, NIPOST’s agency banking platform should provide essential services like savings, payments, money transfers, insurance, and credit.\nVisiting other nationsGlobally, postal services are no strangers to providing financial services.\nBy 2020, the postal agency was to have been unbundled into six subsidiaries: NIPOST Banking and Insurance Company; NIPOST Property and Development Company; NIPOST Transport and Logistics Services Company; NIPOST E-government Services Company; and NIPOST E-commerce Services Company."
  },
  {
    "headline": "5 Uncompleted Nigerian projects that gulped millions of dollars",
    "summarized_story": "The road project, according to the FCT administration, was to ease the perennial gridlock being experienced by motorists on the AYA-Nyanya-Mararaba-Keffi road.\nBello had attributed the delay in completion of the road project to the error of design whereby a huge rock outcrops on the alignment of the road.\nOther factors leading up to the stalled state of the OK LNG project could be linked to the various controversies around it during former President Olusegun Obasanjo’s regime.\nThe former president was accused of sowing the seeds of discomfort with the OK LNG project when he also initiated the project in 2005 barely one year from the conception of the Brass project.\nHowever, none of the two LNG projects has progressed beyond the drawing board despite billions of dollars already expended on them."
  },
  {
    "headline": "2023: Atiku, others set to declare in 3 weeks",
    "summarized_story": "Former Vice President Atiku Abubakar and some other presidential aspirants are set to hit the polity with their formal declaration in the next three weeks, BusinessDay can authoritatively report.\nThus, with the new development it is expected that political activities would intensify in the few weeks, while political gladiators are expected to re-align and re-strategies.\nRead also: Atiku Abubakar: Nigeria’s tenacious presidential candidateThe Wazirin Adamawa, who was the PDP presidential candidate in 2019, has not hidden his intention to rule the country after several unsuccessful attempts.\nRecently, during a visit to former President Olusegun Obasanjo, Atiku expressed confidence in winning the PDP presidential ticket.\nRecently, Media mogul, Raymond Dokpesi had kick-started a pro-Atiku 2023 solidarity awareness aimed at rallying support for his presidential bid."
  },
  {
    "headline": "Concerns as migration widens Lagos housing deficit",
    "summarized_story": "The daily influx of people from various parts of Nigeria and beyond has widen the housing deficit in Lagos, piling up pressure on existing infrastructure and worsening stress in the city, stakeholders have said.\nOver 600 people move to Lagos every day and less than 50 percent of them go back, a government official said.\nThe population and households figures indicate that Lagos needs at least 4.69 million residential units to cater for its population.\nBeing one of the most stressful cities also makes Lagos one of the worst places to live in.\nNotable among them are the 492-housing-unit Lateef Jakande Estate in Igando in Alimosho area of the state, the 744 housing units delivered in Ijeshatedo and about 460 housing units completed in an estate in Ikorodu."
  },
  {
    "headline": "Vice President Yemi Osinbajo Seeks Constitutional Roles For Traditional Rulers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – In the face of rising insecurity across the country, Vice President Professor Yemi Osinbajo has called for constitutional roles for traditional rulers across the country in order to stem the ugly tide.\n“About three or four years ago, I and the Deputy Governor of Delta State, have been working assiduously in bringing down the insecurity we faced in the past.\nOsinbajo emphasized that, the nation’s desire was to see that security challenges in Delta State were brought to an end in most of the oil-producing communities.\n“We recognize, especially with security that very few administrations had been confronted with this plethora of security challenges that we have been confronted with.\nThe Vice President was in Delta State for the Thanksgiving ceremony of late Chief Patrick Ideh, aged 95, a nationalist lawyer since 1961."
  },
  {
    "headline": "Osinbajo now in charge – Buhari – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe President of the Federal Republic of Nigeria, Major General Muhammadu Buhari (retd.\nBuhari stated this when he fielded questions from State House correspondents shortly before departing the Presidential Wing of the Nnamdi Azikiwe International Airport, Abuja, for London on Sunday.\nAccording to the presidential aide, Femi Adesina, Buhari is expected to be in London for two weeks.\nThe Presidency had on Friday in Abuja said the President’s return to Abuja from Nairobi does not abort his earlier scheduled trip to the United Kingdom for a routine medical checkup.\nOn the London trip, Buhari said,”Well, I cannot claim to be doing the work alone."
  },
  {
    "headline": "I’m not leaving PDP for anyone; accept my leadership or leave – Obaseki to detractors – Nigerian Observer",
    "summarized_story": "I’m not leaving PDP for anyone; accept my leadership or leave – Obaseki to detractorsShare FacebookTwitterStumbleuponLinkedInPinterest… Edo sets for council polls, as PDP registers over 539,000 membersThe Edo State Governor, Mr. Godwin Obaseki, at the weekend, said he has no plan of defecting from the Peoples Democratic Party (PDP), urging anyone who is uncomfortable with his leadership of the party to leave.\nHe noted, “There is no division in Edo PDP.\n“I heard that Chief Dan Orbih went around, saying there is no harmonization in Edo PDP.\nThe Chairman PDP Edo State, Anthony Aziegbemi, noted that “Edo State is the only state in the nation that has surpassed the 500,000 thresholds for e-registration of the party.”Others at the meeting include the Deputy Governor of Edo State, Rt.\nComrade Philip Shaibu; Speaker of Edo State House of Assembly (EDHA), Hon."
  },
  {
    "headline": "Obaseki charges Benin Golf Club on partnership, sponsorship deals – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has urged executives of the Benin Golf Club to strengthen collaboration with the organized private sector and other stakeholders to sustain the club.\nHe said, “I want to thank the Captain and the members of the executive of the Benin Golf Club section for the visit and also congratulate them for the election that went smoothly as expected from them.\nEdo is special and we know that the British troop that invaded the Benin Empire stayed back and developed the golf section about 76 years ago.\n“I urge you to encourage a lot of private sector participation in the activities of the club.\nI also urge you to work on getting sponsorship as the club has not done enough to attract sponsors to support the activities of the club."
  },
  {
    "headline": "Tribute to a Business Magnate and Philanthropist, Dr. Deji Adeleke @65, By Akogun Lere Oyewumi",
    "summarized_story": "With all sense of regards and esteemed honor to the billionaire industrialist, an exceptional entrepreneur, academician of high repute, an achiever per excellence and philanthropist, Dr. Deji Adeleke.\nI heartily congratulate and thank Almighty God for your life which has been marked by outstanding accomplishments and enduring fulfillments.\nThe service you render to humanity has made life worth living for many.\nMay GOD continually bless and preserve you, Dr. Deji Adeleke for your pristine and selfless philanthropism.\nAkogun Lere Oyewumi, Ph.D"
  },
  {
    "headline": "President Buhari departs Nigeria for medicals in London",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has left Abuja, the nation’s capital, for London, United Kingdom, for medicals.\n“President Buhari has departed Abuja for the United Kingdom,” the post said.\nPresident Buhari has departed Abuja for the United Kingdom.\n— Presidency Nigeria (@NGRPresident) March 6, 2022President Buhari who was originally scheduled to travel to London for medicals from Kenya had returned to Nigeria from the Eastern African country on Thursday.\n“From Kenya, President Buhari will proceed to London for routine medical checks that will last for a maximum of two weeks,” Adesina had said."
  },
  {
    "headline": "Osun PDP Chieftain, Kazeem Akinleye Salutes Dr. Deji Adeleke @65",
    "summarized_story": "By Sunday Oguntuyi, OsogboA chieftain of People’s Democratic Party, (PDP) in Osun state, Alhaji Kazeem Akinleye, has joined millions of well-wishers in celebrating business morgul and philanthropist, Dr. Deji Adeleke as he clocks 65 years on earth, describing him as an angel in human face.\nAccording to him, Dr. Deji Adeleke has demonstrated passion for human development by series of his contributions towards betterment of the human race.\nDeji Adeleke has been a father to all, I can described him as a God-sent angel to so many including me.\nHe has contributed positively to my life, I am one of his benefactors,” he said.\nI pray God to continue showering his blessings on you and to give you more wisdom to do more than before for people, Congratulations Sir.”"
  },
  {
    "headline": "Police arrest two over missing BRT passenger, Oluwabamise Ayanwole",
    "summarized_story": "Police in Lagos, says it had arrested two suspects in connection with 22-year-old Ayanwole Oluwabamise, who went missing after boarding a Bus Rapid Transport (BRT) service on February 26.\nOluwabamise was said to have boarded the bus from Chevron Bus Stop, Ajah, to Oshodi around 7pm and later sent distress message to her friend when she felt uncomfortable in the vehicle.\n“As soon as the report got to the police, investigation into the circumstances surrounding the disappearance of the lady was immediately initiated,” he said.\n“In the course of ongoing investigation, two suspects have been arrested and are currently helping in our investigation.\nin Ekiti State, is about 5 feet plus tall, dark in complexion and speaks Yoruba and English languages well."
  },
  {
    "headline": "Omo-Agege Commiserates With Keyamo Over Father’s Death",
    "summarized_story": "The Deputy President of the Senate, Senator Ovie Omo-Agege, has commiserated with the Minister of State, Labour and Employment, Olorogun Festus Keyamo, SAN, on the demise of his father, Pa Mattias Keyamo.\nSenator Omo-Agege, in a statement in Abuja on Sunday, also condoled with the entire family, friends and associates of Pa. Keyamo.\nADVERTISEMENTWhile urging Olorogun Keyamo and his family members to take solace in the good life of Pa. Keyamo, Senator Omo-Agege stated that, “I received with shock the sad news of the passing of your dearly beloved father, Pa Mattias Keyamo – a great man who led a worthy life of discipline, excellence and peace.\n“My brother, please accept my heartfelt condolences and extend same to your dear family in Erovie Quarters of Uvwie.\n“I pray that you all will be consoled by the fact that Papa led a decent and disciplined life worthy of emulation by all who love what is good."
  },
  {
    "headline": "Ukraine: 1,112 Nigerians Return As Another 306 Arrive From Hungary",
    "summarized_story": "Nigeria has received a new batch of 306 of its nationals evacuated from the war-torn Ukraine following Russia’s invasion of the country.\nThe government has so far evacuated three other batches from Poland, Romania and Hungary between Friday and Saturday.\nADVERTISEMENTDespite their ordeals while fleeing the crisis in Ukraine, NiDCOM stated also that the returnees were excited to be home.\nReports said many Nigerians and other nationals have fled Ukraine into nearby countries since Russia launched a full-scale war on its neighbour, Ukraine on February 24.\nThe Nigerian government approved the release of $8.5 million on Wednesday for the immediate evacuation of at least 5,000 Nigerians fleeing the Russian-Ukrainian conflict zone to Poland, Romania, Hungary, and Slovakia."
  },
  {
    "headline": "Osinbajo To Act In My Absence, Buhari Says On Way To London",
    "summarized_story": "President Muhammadu Buhari has said his absence from the country would not affect the running of government as the Vice President Yemi Osinbajo would constitutionally take charge when he is not available.\nBuhari said this while fielding questions from State House correspondents at the Nnamdi Azikiwe International Airport Abuja shortly before boarding the presidential jet to London on Sunday.\nThe president had earlier planned to proceed to London from Kenya where he had gone to attend a UNEP programme but surprisingly returned home on Friday.\nSpeakkng on the convention, Buhari dismissed fears that the ruling party will break up.\nHow did we come as a party to take power from the ruling party who had been there before us for so many years?” he said."
  },
  {
    "headline": "Finally, Buhari Departs Abuja For Medical Check-up In UK",
    "summarized_story": "President Muhammadu Buhari, on Sunday, departed Abuja for a routine medical check-up in London.\nLEADERSHIP reports that the president had initially planned to embark on the trip from Nairobi, Kenya after attending the United Nations Environmental Programme (UNEP) at 50 ceremony in that country last week.\nThe president’s spokesman, Mr Femi Adesina, had on March 1, 2022 in a statement said that from Kenya, the president would proceed to London for “routine medical checks that will last for a maximum of two weeks.”However, the president returned to Abuja on Friday at about 1pm.\nADVERTISEMENTThe President is expected to return to Nigeria after about two weeks.\nADVERTISEMENT"
  },
  {
    "headline": "African Leaders Need To Prepare For The Future – Princewill",
    "summarized_story": "A frontline politician in Rivers State, Prince Tonye Princewill, has called on African leaders to prepare for the future in order to keep the continent on the path of development.\nPrincewill made the call on Saturday in a statement made available to LEADERSHIP in Port Harcourt, the Rivers State capital.\nIt’s the duty of all of us to be forward thinking, but it’s the duty of leaders to make sure it happens.\n“The museum of the future is asking you to begin with the end in mind and this is what Africans need to be doing.\nA future without oil can only be addressed by a people who prepare for it."
  },
  {
    "headline": "Putin to Ukrainian fighters: Surrender now",
    "summarized_story": "Russian President Vladimir Putin has demanded the surrender of Ukrainian forces, as he vowed to press ahead with his ceaseless offensive.\nThe evacuation was impossible for the second day as Russian shelling continued.\nPutin made his demand for Kyiv surrender in a phone call with Turkish President Tayyip Erdogan, who appealed for a ceasefire.\nPutin told Erdogan he was ready for dialogue with Ukraine and foreign partners but any attempt to draw out negotiation would fail, a Kremlin statement said.\nMacron told Putin he was concerned about a possible imminent attack on southern Ukraine’s historic port city of Odessa, Macron’s office said."
  },
  {
    "headline": "Netflix suspends Russian service",
    "summarized_story": "Netflix Inc has suspended its service in Russia, joining the train of western companies that have hit the exit door, since a raft of sanctions were slammed on the country by western powers.\nEarlier this week, Netflix temporarily stopped all future projects and acquisitions in Russia as it assessed the impact of Moscow’s invasion of Ukraine.\n“Given the circumstances on the ground, we have decided to suspend our service in Russia,” the Netflix spokesperson said.\nNetflix had earlier said it had no plans to add state-run channels to its Russian service, despite a regulation that would require it to distribute state-backed channels."
  },
  {
    "headline": "BREAKING: Bandits Release 36 Katsina Abductees After A Month",
    "summarized_story": "The 36 abducted people in Guga of Bakori LGA, Katsina State have regained their freedom after a month in bandits’ den.\nAccording to Alhaji Mahdi Danbinta Guga whose wife and daughter were among the victims, their release was after the payment of N21,000,000 ransom sourced by the Guga community.\nTheir release was today around 6:00 pm.\nDetails later…"
  },
  {
    "headline": "BREAKING: Buhari travels to London for medical checkup",
    "summarized_story": "President Muhammadu Buhari has departed Abuja for his medical trip to London, United Kingdom.\nThe president departed Abuja on Sunday.\nLast month, Femi Adesina, presidential spokesman, had said Buhari would visit his doctor in London for “routine medical checks that will last for a maximum of two weeks”.\nMore to follow…"
  },
  {
    "headline": "BREAKING: Lagos Seals Event Center Where Petrol Was Shared As Souvenir",
    "summarized_story": "BREAKING: Lagos Seals Event Center Where Petrol Was Shared As SouvenirThe Havillah Event Centre in Oniru has been closed by the Lagos state government for violating public safety regulations.\nFollowing a public outcry over the distribution of gasoline-filled jerrycans at an event, the event center was closed.\nOn Saturday, agents from the Lagos Safety Commission and the Rapid Response Squad sealed the facility, according to Jubril Gawat, senior special adviser to the Lagos state governor on new media."
  },
  {
    "headline": "‘I Watched As Six Of My Siblings Were killed’, Turji Justifies Cause",
    "summarized_story": "‘I Watched As Six Of My Siblings Were killed’, Turji Justifies CauseA notorious bandit kingpin, Bello Turji, has recounted some attacks on his family, saying that over 1,000 cattle were stolen from their household and in the process six of his younger siblings were killed that day.\nTurji also accused Yan Sakai volunteers of connivance with security agents to harass and extort the Fulanis.\nThey also connived with Yan Sakai and slaughtered my uncle.\nMy father was involved in a court case for seven years over corn stalks.\nJust for corn stalks!”​"
  },
  {
    "headline": "Medical trip: Buhari drops crucial hint, heads to London",
    "summarized_story": "President Muhammadu Buhari Sunday left Abuja for his routine medical check-up in London, United Kingdom.\nSpeaking to State House correspondents at the Nnamdi Azikiwe International Airport, the President said Vice President Yemi Osinbajo would be in charge.\nThe Vice President is there, constitutionally when I’m away he’s in charge.\nThe President also dismissed doubts about the ability of the ruling party All Progressives Congress (APC) to conduct its national convention successfully.\nHow did we come as a party to take power from the ruling party who had been there before us for so many years?"
  },
  {
    "headline": "Breaking: Police hunt socialite, other party organisers day after sharing petrol as souvenirs",
    "summarized_story": "Moments after Lagos state government sealed a party venue where petrol kegs were shared as souvenirs, Commissioner of Polic, CP Abiodun Alabi, has ordered the arrest of the host of the event.\nThe party took place in the Oniru area of the state.\nA statement by the police spokesman in the state, Adekunle Ajisebutu, on Saturday partly reads, “It’s regrettable that in spite of series of warnings and sensitisations carried out by the Police and other relevant government agencies, some individuals could be handling such combustible substance in a public place in total disregard to safety of lives and properties.\n“Still concerned about the safety, and protection of lives and properties of citizens, the Lagos State Police Command once again appeals to citizens to avoid this kind of condemnable act in the name of generosity.\n“Although the event centre where the distribution of the souvenirs took place has been located and subsequently sealed, the Commissioner of Police, CP Abiodun Alabi, fdc, mnim, has in addition, ordered the arrest of all persons involved in this regrettable and reprehensible act.”"
  },
  {
    "headline": "Pictures: Third batch of Nigerians trapped in Ukraine arrive Abuja",
    "summarized_story": "As Russian troops continue to invade the cities of Ukraine, the third batch of Ukraine-based Nigerians from Hungary have touched down at the Nnamdi Azikiwe International airport, Abuja, Nigeria’s capital.\nNo fewer than 165 Nigerians arrived Friday night at about 11:50 pm local time from Budapest, Hungary."
  },
  {
    "headline": "Another Batch Of Nigerians From Ukraine Arrives In Abuja",
    "summarized_story": "Another set of Nigerians fleeing the crisis in Ukraine, have been successfully evacuated by the Nigerian Government.\nThe 306 Nigerians arrived at the Nnamdi Azikiwe International Airport on Sunday morning.\nThey were brought home via an Air Peace flight from Budapest, Hungary where they had crossed over to safety from Ukraine.\nRead Also: Nigerian Students Trapped In Ukraine Appeal For Urgent EvacuationThis is the 4th batch of returnees in the on-going evacuation approved by President Muhammadu Buhari.\nThe National Emergency Management Agency (NEMA) and other agencies are presently attending to the returnees."
  },
  {
    "headline": "Medical Trip: Buhari Hands Over To Osinbajo, Flies Out To London",
    "summarized_story": "Vice President Yemi Osinbajo will preside over the nation’s affairs for two weeks while President Muhammadu Buhari is away on a medical trip to London in the United Kingdom.\nBuhari said he is not running the administration alone as other key officials including the vice president, the chief of staff, the secretary to the government of the federation (SGF), and others are carried along.\nThe government is fully represented; the vice president is there; constitutionally when I’m away, he’s in charge,” President Buhari said.\nHow did we come as a party to take power from the ruling party who had been there before us for so many years?\nBuhari has come under criticism, notably from the main opposition Peoples Democratic Party (PDP), for his trip to London."
  },
  {
    "headline": "NDLEA Recovers 294,440 Tramadol Tablets, Seizes 38,862 Cartridges In Raids",
    "summarized_story": "This was disclosed in a statement by the NDLEA spokesperson, Femi Babafemi, on Sunday.\nAt least 30 suspects were arrested at the Malali area of Kaduna State during raids aimed at destroying drug joints across the state.\nOn the same day, operatives in Anambra State recovered 38,862 red star cartridges along with 13 cartons of illicit drugs when they raided a warehouse in Onitsha.\nKnown as ‘Jihadist drug’, the consignment was the first-ever recorded seizure of Captagon in the West and Central African Sub-Region.\nGen. Mohamed Buba Marwa charged them to remain vigilant and on the offensive until all drug cartels in Nigeria are completely dismantled."
  },
  {
    "headline": "Nigerian Students Trapped In Ukraine Appeal For Urgent Evacuation",
    "summarized_story": "﻿Many Nigerian students trapped in Sumy, Ukraine have called for urgent evacuation back home amid a Russian invasion.\nThe Federal government has evacuated more than 1,000 Nigerians who made it out of Ukraine to neigbouring countries such as Poland and Romania.\nBut the students in Sumy are yet to find a way out of war-torn Ukraine.\n“We are in Sumy and we are stuck in Sumy,” one of the students said during a protest held under snowy conditions.\n“This is Day 10, people don’t have water, people don’t have light in hostels."
  },
  {
    "headline": "2023 Elections: We’ve Not Released Timetable – PDP",
    "summarized_story": "The Peoples Democratic Party (PDP) on Sunday said it was yet to release the timetable for the 2023 general elections, warning that the one in circulation did not emanate from the party.\nPDP National Publicity Secretary, Hon.\nDebo Ologunagba, made the clarification in a statement titled, ‘PDP Has Not Released Timetable for 2023 General Elections’.\nAccording to him, the letter purportedly signed and released by the National Organizing Secretary of the PDP, Hon.\nUmar M. Bature, as the schedule of activities and timetable of the PDP for the 2023 general elections was fake."
  },
  {
    "headline": "Gov Yahaya Bello's presidency non-negotiable",
    "summarized_story": "Stakeholders in the North Central Zone under the platform of the ruling All Progressives Congress have thrown their weight behind the presidential ambition of governor Yahaya Bello.\nThis time they say nothing will make them change their mind from supporting the Kogi governor.\nThey maintained that the presidential ambition of the Mr Bello will not be negotiated even if the zone produces the National Chairman of the party in the forthcoming Convention.\nThe APC stakeholders in the North Central Zone made this known on Saturday while reacting to a statement allegedly issued by a group, “Stakeholders in Nasarawa State Council of the All Progressives Congress, appealing to Governor Bello to sacrifice his presidential ambition for the rumoured national chairmanship position awaiting the zone.\nIn a statement signed and issued by the Director-General, North Central Coalition for Leadership, Williams Oluwatoyin, they saiy the purported appeal for mr Bello to relinquish his ambition “stands logic on its head and also belittles the zone.”They made this position known on a day Governor Bello officially presented Staff of Office to the newly approved, graded and upgraded traditional rulers in Kogi State, at the Muhammadu Buhari Civic Centre, Lokoja."
  },
  {
    "headline": "2023: Tinubu visits Pa Fasoranti, concludes Southwest consultation tour -",
    "summarized_story": "The national leader of the All Progressives Congress and presidential hopeful, Asiwaju Bola Ahmed Tinubu has completed his tour of the Southwest states with a visit to the leader of the socio-cultural group, Afenifere, Pa Reuben Fasoranti.\nFormer Lagos state governor who continued his tour of six states in the Southwest Nigeria on Thursday in Ekiti, arrived in Ondo same night."
  },
  {
    "headline": "APC Stakeholders in Sokoto pass Vote of Confidence on Party's Leadership -",
    "summarized_story": "The leadership crisis rocking the All Progressives Congress APC in Sokoto state has taken another twist as the coalition of the APC Support group in the state has passed a vote of confidence on the national leadership of the party led by Yobe state Governor, Mai Mala Buni.\nThe Coalition in a press conference addressed by its spokesman, Isa Jabbi says the APC in Sokoto is strong, formidable and does not need distraction from unnecessary leadership tussle that will not help the party in it bid to take over power in Sokoto, in 2023.\nMr. Jabbi says the Caretaker Extraordinary Convention Planning Committee led by Mr. Buni is working hard to ensure the APC remain a true national party that will meet the yearnings and aspirations of all Nigerians and therefore, should not be distracted.\nThe Coalition reaffirmed its Support and loyalty to the chairmanship of Mainasara Abubakar Sani to lead the APC to success in Sokoto as the nation prepare for the general election in 2023They described as unfortunate and unnecessary the attack on the person of the nation’s Attorney General and Minister of Justice, Abubakar Malami by the factional APC Chairman in Sokoto, Isa Sadiq Achida."
  },
  {
    "headline": "Tinubu takes presidential consultation to traditional rulers in Ado Ekiti -",
    "summarized_story": "Asiwaju Bola Ahmed Tinubu has landed in Ado Ekiti to continue his consultation visit to traditional rulers in the south west.\nHe was received at the Government House by the Deputy Governor of Ekiti State, Otunba Adebisi EgbeyemiThe former Lagos state governor is currently meeting with the Council of traditional rulers in Ekiti State under the chairmanship of the Onisan of Isan-Ekiti, Oba Gabriel Ayodele Adejuwon."
  },
  {
    "headline": "Stop Fighting, Putin Tells Ukraine, as Anti-War Protests Grow",
    "summarized_story": "Putin made his demand for Kyiv to end the fighting in a phone call with Turkish President Tayyip Erdogan, who appealed for a ceasefire.\nRussian media said Putin also spoke by phone for almost two hours with French President Emmanuel Macron.\nMacron told Putin he was concerned about a possible imminent attack on southern Ukraine’s historic port city of Odessa, Macron’s office said.\nAnti-war protests took place around the world including in Russia itself, where police detained more than 4,300 people, an independent protest monitoring group said.\nPutin says he wants a “demilitarised”, “denazified” and neutral Ukraine, and on Saturday likened Western sanctions “to a declaration of war”."
  },
  {
    "headline": "Queretaro v Atlas: At Least 26 Injured, Match Abandoned as Fans Fight at Mexican Match",
    "summarized_story": "At least 26 people were injured when violence broke out among the crowd at a top-flight match in Mexico.\nThe Liga MX encounter between Queretaro and Atlas was abandoned after 63 minutes when fighting spilled on to the field at La Corregidora stadium.\nRelatedStories No Content AvailableSome players attempted to calm fans down before they were sent to the locker room.\nThree people were seriously injured, with 26 supporters in total taken to hospital.\n“Even though there are no deaths, we cannot say this is not a tragedy,” said Queretaro state governor Mauricio Kuri on Sunday."
  },
  {
    "headline": "Fleeing Sanctions, Russian Oligarchs Seek Safe Ports for Superyachts",
    "summarized_story": "Russian billionaires have had decades to shield their money and assets in the West from governments that might try to tax or seize them.\nIt is now moored in the Russian Baltic port of Kaliningrad, beyond the reach of Western sanctions imposed against him this past week.\nSome Russian oligarchs appear to have not gotten the memo to move their superyachts, despite weeks of public warnings of Putin’s planned invasion.\nAt least 20 superyachts are reported to be under construction in various Northern European shipyards, including a $500 million superyacht being built for the American billionaire Jeff Bezos.\nCauiser said he expects some oligarch superyachts will soon quietly be listed by brokers at fire-sale prices."
  },
  {
    "headline": "Russian Attacks Halt Plans to Evacuate Ukrainian Civilians",
    "summarized_story": "But Russian attacks quickly closed the humanitarian corridor, Ukrainian officials said.\nUkrainian President Voldymyr Zelenskyy rallied his people to remain defiant, especially those in cities that Russian soldiers have entered.\nThere was nothing.”British military officials compared Russia’s tactics to those Moscow used in Chechnya and Syria, where surrounded cities were pulverized by airstrikes and artillery.\nThe Russian military has warned Ukraine’s neighbors against hosting its warplanes, saying that Moscow may consider those counties part of the conflict if Ukrainian aircraft fly combat missions from their territory.\nOnlookers in Chernihiv cheered as they watched a Russian military plane fall from the sky and crash, according to video released by the Ukrainian government."
  },
  {
    "headline": "Russian Gymnast Investigated for Wearing Pro-War Symbol on Podium Next to Ukrainian",
    "summarized_story": "Russian gymnast Ivan Kuliak is being investigated after wearing a national war symbol on his leotard as he stood next to a Ukrainian rival on the podium in Qatar on Saturday.\nAfter earning bronze in the parallel bars final, Kuliak taped a letter ‘Z’ on to his chest and took to the podium next to gold medal winner Illia Kovtun of Ukraine.\nThe letter Z has become symbolic with Russia’s invasion of Ukraine and has been seen painted on the side of tanks and military vehicles, as well as being worn by pro-war politicians in Russia.\nThis weekend was the final opportunity for Russian and Belarusian gymnasts to compete after their countries were sanctioned by the FIG as a result of Russia’s invasion of Ukraine.\nFrom Monday, Russian and Belarusian athletes, officials and judges will not be allowed to take part in FIG competitions or FIG-sanctioned competitions."
  }
]