[
  {
    "headline": "Optometrist warns Nigerians against free cataract surgeries",
    "summarized_story": "Amarachi OkehAn eye care specialist, Dr. Chinedu Njezi, has cautioned Nigerians seeking free cataract surgeries to be wary of where they access such services.\nAccording to the optometrist, people seeking free cataract surgery could end up in the hands of quacks if they are not cautious about who is offering the services.\nMore sophisticated methods available for removing cataracts that people should use, Njezi said, are laser surgeries, phacoemulsification and small incision cataract surgeries.\nSpeaking with PUNCH HealthWise, the optometrist said, “The problem with free medical outreaches and surgical interventions is the inability to know if the surgeon is a licensed ophthalmologist or a quack.\n“So, most times after the free cataract surgery, a worse condition can occur like panopthalmitis or uveitis which may lead to the removal of the eyeball in the worst-case scenarios,” he said."
  },
  {
    "headline": "Optometrist warns Nigerians against free cataract surgeries",
    "summarized_story": "Amarachi OkehAn eye care specialist, Dr. Chinedu Njezi, has cautioned Nigerians seeking free cataract surgeries to be wary of where they access such services.\nAccording to the optometrist, people seeking free cataract surgery could end up in the hands of quacks if they are not cautious about who is offering the services.\nMore sophisticated methods available for removing cataracts that people should use, Njezi said, are laser surgeries, phacoemulsification and small incision cataract surgeries.\nSpeaking with PUNCH HealthWise, the optometrist said, “The problem with free medical outreaches and surgical interventions is the inability to know if the surgeon is a licensed ophthalmologist or a quack.\n“So, most times after the free cataract surgery, a worse condition can occur like panopthalmitis or uveitis which may lead to the removal of the eyeball in the worst-case scenarios,” he said."
  },
  {
    "headline": "Study on medication to prevent deaths from opioid shows promise, says WHO",
    "summarized_story": "Amarachi OkehThe World Health Organisation says a study that trained people on how to use and administer naloxone could save people from an opioid overdose.\nThe study carried out in Kazakhstan, Kyrgyzstan, Tajikistan and Ukraine showed that if administered rapidly, naloxone reduces the effect of opioid overdose and also has the potential to significantly reduce the number of deaths.\nDuring the study, participants were trained on how to recognise and respond to an opioid overdose, including the administration of naloxone.\nThe world’s health authority said “Opioid dependence is a disorder of regulation of opioid use, and individuals who are opioid dependent have a high risk of experiencing an overdose, leading to death.\nMore than 70% of these deaths are related to opioids, with more than 30% of those deaths caused by overdose”."
  },
  {
    "headline": "Study on medication to prevent deaths from opioid shows promise, says WHO",
    "summarized_story": "Amarachi OkehThe World Health Organisation says a study that trained people on how to use and administer naloxone could save people from an opioid overdose.\nThe study carried out in Kazakhstan, Kyrgyzstan, Tajikistan and Ukraine showed that if administered rapidly, naloxone reduces the effect of opioid overdose and also has the potential to significantly reduce the number of deaths.\nDuring the study, participants were trained on how to recognise and respond to an opioid overdose, including the administration of naloxone.\nThe world’s health authority said “Opioid dependence is a disorder of regulation of opioid use, and individuals who are opioid dependent have a high risk of experiencing an overdose, leading to death.\nMore than 70% of these deaths are related to opioids, with more than 30% of those deaths caused by overdose”."
  },
  {
    "headline": "Barca lawyers set to block Messi’s PSG move",
    "summarized_story": "Barcelona lawyers are sensationally trying to block Lionel Messi’s transfer to Paris Saint-Germain in a dramatic twist.\nPSG are reported to have offered a two-year contract to Messi and the six-time Ballon d’Or winner reportedly agreeing terms with the French giants.\nBarca lawyers have filed a complaint to the European Court of Appeal, claiming PSG should be stopped in their tracks to sign the Argentine based on financial data.\n“PSG’s ratios in terms of ‘Financial Fair Play’ are worse than those of FC Barcelona.\n“It is inconceivable that the ‘Financial Fair Play’ serves to aggravate the drifts of football-business, the instrumentalization of football by sovereign powers, and the distortion of competitions.”Vanguard News Nigeria"
  },
  {
    "headline": "COVID-19: Paris plans open Olympics in 2024",
    "summarized_story": "France rolled out the red carpet for the Olympic flag on Monday, with the host of the next 2024 Summer Games promising to make the sporting spectacle open to the masses after a pandemic-hit Tokyo Games held behind closed doors.\nParis Mayor Anne Hidalgo waved the flag which she was handed in Tokyo during the handover ceremony as she stepped out of the aircraft bringing home some of the country’s last athletes.\nThe 2024 games would be “something very positive for our country.\nAt Sunday’s handover ceremony, Paris sought to change the tone.\n“We want to find ways to open the games to the people,” Paris Games chief Tony Estanguet said on Friday."
  },
  {
    "headline": "Five missing in Taraba boat mishap",
    "summarized_story": "By Femi BolajiNo fewer than five-person have reportedly gone missing after a boat conveying fourteen passengers drowned in Taraba state.\nThe incident happened weekend on the stretch of River Benue in Taraba state.\nVanguard gathered that the passengers boarded the boat en-route a village in Karim-Lamido Local Government Area of the state from Mayo-Reniwo village in Ardo-Kola Local Government Area.\nAbdullahi Usman told newsmen in Jalingo that nine of the passengers were successfully rescued.\nHe further said the rescue operation was still ongoing to find the remaining five passengers."
  },
  {
    "headline": "Breaking: Messi to join PSG on a two-year deal",
    "summarized_story": "By Emmanuel OkogbaArgentine forward, Lionel Messi has agreed to join Ligue 1 side, Paris Saint-Germain, PSG on a two-year deal worth £25m a year plus bonuses with option of a third year and a £25m signing on fee.\nFans await Lionel Messi during at Parc des Princes on August 9, 2021 in Paris, France.\n(Photo by Matthieu Mirville/Icon Sport)Plans are also already underway for Messi’s arrival in Paris.\nA teary Messi had in final press conference at Barcelona said his plans were to carry on playing for as long as possible.\nMessi, 34, during his time at Barcelona played 778 matches, scored 672 goals and had 305 assists."
  },
  {
    "headline": "NDDC Board: Niger Delta Youth Groups urge President Buhari to inaugurate screened board",
    "summarized_story": "With the completion of the audit, therefore, we urge Mr. President to put in place the Governing Board to ensure accountability, equitable representation and rapid development of the NDDC states.\nWe call on Mr President to follow through on his promise and inaugurate the Board that he appointed for the Commission.\nThe NDDC Act provides for a Board that has membership from all the nine constituent states, which is what Mr President followed in nominating the Board now awaiting inauguration.\nPresident Muhammadu Buhari in a letter personally signed by him and dated October 18th, 2019 sent the names of nominees for the NDDC Board to the Senate.\nThe Federal Government announced during the inauguration ceremony of the IMC that the Senate-Confirmed NDDC Board will be inaugurated after the forensic audit."
  },
  {
    "headline": "AISSON president, Ona Ekhomu dies of COVID-19 complications",
    "summarized_story": "A renowned security expert, Ona Ekhomu, has passed away after battling COVID-19 complications.\nBorn March 26, 1955, in Irrua, Edo State, Ekhomu died Monday night after weeks of illness.\nThe first chartered security professional in West Africa was the President of Association of Industrial Security and Safety Operators of Nigeria (AISSON).\nEkhomu was a member of Nigerian Institute of Management (NIM), Academy of Security Educators & Trainers (USA), National Fire Protection Association (USA), International Organization of Black Security Executives (USA) etc.\nIn 2004, Ekhomu was named Private Security Chief of the Year by the Crime Reporters Association of Nigeria (CRAN)."
  },
  {
    "headline": "God angry with Nigeria, we may not get right leaders – Primate Ayodele",
    "summarized_story": "The Leader Of INRI Evangelical Spiritual Church, Primate Elijah Ayodele, on Tuesday said God is angry with Nigeria due to the injustice in the judiciary system.\nPrimate Ayodele, who blamed the judiciary system for some of the wrongs currently experienced in Nigeria, said the country may never get the right leaders.\nThe clergyman said the judiciary system has given power to the wrong people because Nigeria has adopted the politics of money.\nIn Nigeria, if we don’t stop the politics of money, we will not get the right leaders who will take us seriously, Nigeria will continue to deteriorate.\n“For example, Imo state is a case study for the corrupt practices in the judiciary system."
  },
  {
    "headline": "Show support for Ilana Omo Oodua – Group urges Yorubas",
    "summarized_story": "A foremost Yoruba self-determination group, Yoruba Koya Liberation Movement (YKLM,) has asked all Yorubas to publicly show their support for Ilana Omo Oodua.\nThe group threw its weight behind Ìlànà Ọmọ Oódua and its leadership under Prof. Bánjí Akíntóyè as the bonafide body to coordinate the activities of other groups towards the actualization of the self-determination struggle of the Yoruba people.\nThis was contained in a press statement by the Director of Media and Communications of the organization, Comrade Oluwajuyitan Femi, on Tuesday.\nThe group further called on all well-meaning Yoruba self-determination groups to publicly show their support for Ilana Omo Oodua in order to show unity of purpose and solidarity in these trying times.\n“This statement is necessitated by the flippancy of some individuals who are trying to fly a new group as the umbrella body for all groups."
  },
  {
    "headline": "FG condemns assault on Nigerian diplomat, Indonesia apologizes",
    "summarized_story": "The Federal Government has summoned the Indonesian Ambassador to Nigeria over the assault on a Nigerian official in Jakarta.\nHe noted that the action was against international law and the Vienna Conventions governing Diplomatic and Consular Relations between States.\nThe minister said he had seen the circulating video of the August 7 incident which happened in front of the diplomat’s residence.\n“The Ambassador explained what he understood happened and apologized unreservedly on behalf of the Government of Indonesia”, the statement read.\nOnyeama added that the country’s ambassador has confirmed that the culpable immigration officials had apologized for their action."
  },
  {
    "headline": "Traditionalists don’t involve themselves in money rituals – Dr Atanda",
    "summarized_story": "On the background of the 2021 World Isese Day to be held in Osun State, Nigerians have been called upon to discard the belief that adherents of the traditional religion are fetish and diabolical.\nAlso, it has been advised that the misconception about traditional worship is a result of a misunderstanding that is existing amongst the people.\nAnother difference, he disclosed, is that herbalists are not adherents of traditional religion while traditional priests being aware of the consequences associated with involving in money rituals know it is a no-go area for them.\nThe physician cum traditional priest also explained that since all religions relate with God through intercessors, the deities that traditionalists commemorate and pray to are intermediaries between man and God.\nDeities like Osun, Obatala, Oya and Egungun he hinted are worshipped by the Yoruba and different traditional festivals are held in their honour."
  },
  {
    "headline": "Man ends marriage over wife’s alleged witchcraft",
    "summarized_story": "Agency ReporterAn Igando Customary Court in Lagos on Tuesday dissolved the 29-year- old marriage of a 60-year-old trader, Mr Femi Olatunde, who accused his wife of witchcraft.\n“The court hereby pronounces the marriage between Mr Femi Olatunde and Mrs Yemi Olatunde dissolved today.\n“Both of you henceforth cease to be husband and wife.\nOlatunde had earlier told the court that his wife was a witch.\nIn her defence, the 54-year-old Yemi, a trader, denied all the allegations and accused her husband of turning her into a punching bag."
  },
  {
    "headline": "BBNaija Shine Ya Eye housemate: I’ve the right to kiss any housemate – Angel",
    "summarized_story": "By Olaitan GaniuBBNaija Shine Ya Eye housemate, Angel has said she has the right to kiss any housemate of her choice as a single lady.\nThe 21-year-old made her point clear to her perceived lover in the house, Sammie, during an argument on Tuesday morning.\nThe dispute started when Sammie accused Angel of being unfaithful for kissing a new housemate, Kayvee, during a Truth and Dare game.\nResponding to Sammie’s tirades, Angel yelled she has the right dress anyhow she feel and kiss whoever she likes.\n“I actually knew this thing was coming but I would dress the way I want to dress like and I’ll kiss whoever I want to kiss."
  },
  {
    "headline": "Man, 28, in Kwara NSCDC net for alleged kidnap, rape",
    "summarized_story": "By Adekunle Jimoh, IlorinA 28- year old man, Bello Muhammed, is in the custody of Kwara Command of the Nigeria Security and Civil Defence Corps (NSCDC) for alleged kidnap and sexual assault.\nMohammed with others on the run allegedly kidnapped and raped 15 years old Hajarat Ibraheem while in their captivity, it was gathered.\nHe said that Muhammed was unlucky as he was picked up by local vigilante at Kara market, Ajase lpo, Irepodun local government area of the state.\nThe vigilance group subsequently handed him over to the operatives of the NSCDC, he said.\nADVERTISEMENTHe said that operatives of the NSCDC are on the trail of the two other suspects."
  },
  {
    "headline": "Messi reaches agreement on move to PSG – L’Equipe",
    "summarized_story": "Agency ReporterLionel Messi has reached an agreement with Paris Saint Germain (PSG) over a transfer to the French soccer club.\nSports paper, L’Equipe, said on its website, adding he was due to arrive in Paris in the coming hours.\nMessi, the 34-year-old record goalscorer for both Argentina and FC Barcelona, is one of the greatest players of all time.\nADVERTISEMENTBut the arrival of Messi, Barca’s all-time record goal scorer with 682 in 27 years, will boost the club’s ambitions to win a first ever Champions League.\nThe arrival of Messi, who has 245 million followers on Instagram and is Barcelona’s most decorated player of all time, is also welcome news for France’s Ligue 1."
  },
  {
    "headline": "Police occupation heightens tension in APC secretariat",
    "summarized_story": "From Romanus Ugwu, AbujaThe national leadership of the All Progressives Congress (APC) has defended its decision to mobilise police to the secretariat, confirming that it was based on security report available to it.\nAPC headquarters wore a semblance of a battlefield in the early hours of yesterday, as policemen, loaded in over five vans took over the party secretariat.\nReacting to the situation, the National Secretary APC Caretaker/Extraordinary Convention Planning Committee, Senator John James Akpanudoedehe, said the party’s leadership acted based on security report.\nHe said there was nothing to be worried about the development meant to strengthen security at the party’s secretariat.\nWe cannot embarrass the president, we cannot embarrass the government of APC and we cannot embarrass ourselves,” the party scribe said."
  },
  {
    "headline": "PDP crisis: Confusion as 9 NWC members hold parallel meeting, advise Secondus to quit",
    "summarized_story": "There are 19 NWC members, comprising 12 national officers, and six national vice chairmen in charge of the six geo-political zones.\nHowever, the PDP National Legal Adviser, Emmanuel Enoidem, described the meeting as a nullity as it is only the national chairman or two-third of NWC members that can convene a meeting of the party organ.\nOthers who attended the meeting were Senator Umar Ibrahim Tsauri, national secretary; Abdulahi Maibasira, national financial secretary and Chief Theophilus Dakas, national vice chairman (North Central).\nThe aggrieved NWC members resolved to forward their resolution to the PDP Governors Forum, the BoT and other organs of the party.\nThis is as members of the PDP caucus in the House of Representatives have disagreed over calls for the resignation the party’s national chairman, Uche Secondus."
  },
  {
    "headline": "6 killed as IPOB sit-at-home grounds South East",
    "summarized_story": "Banks and markets such as Ekeoha Market (Shopping Centre), Ariaria international Market, Ahia Ohuru (Ngwa Road Market), Cemetery/Eziukwu Road Market, and others were shut down.\nHowever, government establishments like University of Nigeria Nsukka, Nsukka council secretariat, some primary and secondary schools were opened.\nThe ever-busy Enugu Road Nsukka by Nsukka known for traffic gridlock witnessed free with scanty flow of vehicular and human movement.\nIn Abakaliki, all the transport companies located along Afikpo road opened for businesses but there were no passengers.\nAlso, some shops opened for businesses in the capital city with free human and vehicular movements though not as it used to be on a normal day."
  },
  {
    "headline": "DSS asks court to nullify bail granted Igboho’s associates",
    "summarized_story": "Justice Obiora Egwuatu had, last Wednesday, granted bail to the 12 detainees who had spent five weeks in the custody of the DSS.\nThey were arrested on July 1, 2021, at Igboho’s Ibadan residence raided by DSS operatives around 1am.\nBut, in a fresh motion marked FHC/ABJ/CS/647/2021 and filed on Monday, the Department of State Security Service (DSS), specifically urged the court to set aside the bail granted to Amudat Babatunde, Abideen Shittu, Jamiu Oyetunji, and Bamidele Sunday.\nIt is laughable and turned logic upside down that after over a month in the DSS custody, the DSS still needs more days to punish them.\nOne of the sureties, the court held, must be an employee of the federal government on grade level 12 and above."
  },
  {
    "headline": "Okorocha forfeits properties to Imo govt",
    "summarized_story": "The judge further ruled that all properties contained in pages 226 to 272 of the Imo State Government White Paper gazette on recovery of lands and properties belonging to Imo State be recovered.\nFormer governor Emeka Ihedioha had established a judicial panel of inquiry on lands allocation and administration by previous administrations in the State.\nThe current Hope Uzodimma administration, which inherited the report of the panel, had embarked on recovery of government properties in Okorocha’s custody, based on the white paper, which emanated from a Judicial Panel of Inquiry on Recovery of Imo State government assets and properties.\nJustice Njemanze maintained that the white paper gazette by the Imo state government remains a legal binding document.\nMeanwhile, counsel to Okorocha, Oba Maduabuchi, has expressed surprise over the judgement, describing it as unfortunate."
  },
  {
    "headline": "Messi Agrees to Join PSG on Two-year Contract",
    "summarized_story": "Lionel Messi has agreed to join Paris Saint-Germain on a two-year contract.\nThe six-time Ballon d’Or winner had two other options after leaving Barcelona last week, but has chosen to move to the French club on a deal worth £25m per year after tax.\nMessi was set to extend his 21-year stay at Barcelona by signing a new five-year deal this summer.\nHowever, the club announced on Thursday that “financial and structural obstacles” meant the deal could not be completed, meaning Messi left as a free agent.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "PDP Govs, Secondus Reach Deal, Convention May be Brought Forward",
    "summarized_story": "Abaribe and Elumelu denied reports that PDP members in the House had passed a resolution that Secondus should resign.\n“I can confirm to you that I will not resign”, Secondus told reporters as he made to leave the venue.\nAlthough a deal to bring the convention backward had been struck, it was not clear if it included the eligibility of Secondus to contest.\n“In attendance were Deputy National Chairman (North), Senator Suleiman Nazif; National Secretary, Senator Umar Ibrahim Tsauri; National Auditor, Mai Adamu Mustapha; National Financial Secretary, Abdulahi Maibasira; National Youth Leader, Hon.\n“Happily, the national chairman, Prince Uche Secondus, has issued a statement a short while ago that he will not resign."
  },
  {
    "headline": "CBN: Digital Currency Would Be Critical National Infrastructure",
    "summarized_story": "By James EmejoThe Central Bank of Nigeria (CBN) has said its proposed digital currency, known as e-Naira, will be treated as a critical national infrastructure to protect it from operational and cyber-security risks.\nThe digital currency regime would also introduce a new range of banking services and integration with new systems, providing new possibilities for the payment architecture.\nEmefiele said if “you have some naira in your account and you choose to convert part of your naira into a digital wallet by way of a digital currency, we will support that.\nOf course, when this starts, the CBN will move some of the balances of banks with CBN to those banks in digital currency.\n“Therefore, e-Naira, which will represent the digital equivalent of cash, will be used as the fiat currency to effect transactions,” he stated."
  },
  {
    "headline": "Rivers Govt, Not FG Should Collect VAT, Related Taxes, Court Rules",
    "summarized_story": "FHC/PH/CS/149/2020, filed by the Attorney General for Rivers State (plaintiff), against the Federal Inland Revenue Service (first defendant) and the Attorney General of the Federation (second defendant).\n“The court noted that the application is like asking the Federal High Court to transfer the entire case to the Court of Appeal.\nDonald Chika Denwigwe, SAN, lead counsel to Government of Rivers State and Ken C.O.\nNjemanze, SAN, briefing journalists after the Federal High Court in Port Harcourt on Monday declared FIRS collection of Value Added Tax in Rivers State unconstitutional.\n“So, in other words, the issue of Value Added Tax (VAT) in the territory of Rivers State and Personal Income Tax should be reserved for the government of Rivers State.”Counsel to FIRS, O.C."
  },
  {
    "headline": "Breaking: NNPC Promotes, Redeploys Top Management Officials",
    "summarized_story": "In a statement last night, the management of the corporation announced the promotion and redeployment of some staff to fill key vacant positions, including Mr. Billy Okoye, who has now been appointed the new Group Executive Director, Ventures & Business Development.\nThe statement signed by the outgoing Group General Manager, Group Public Affairs Division, of the corporation, Dr. Kennie Obateru, stated that Mrs. Aisha Ahmadu-Katagum, has been promoted to the position of Group Executive Director, Corporate Services.\nIt noted that until their new appointments, Okoye and Ahmadu-Katagum were Group General Managers, Crude Oil Marketing Division (COMD) and Supply Chain Management Division in the corporation, respectively.\nIn addition, a former Chief Operating Officer, Business and Ventures Development, Mr. Adeyemi Adetunji, becomes the Group Executive Director, Downstream, while a former Chief Operating Officer, Corporate Services, Mr. Mohammed Ahmed, becomes the Group Executive Director, Gas and Power.\nMuhammad is likely to now exit the office of the Minister of State, Petroleum Resources, Mr Timipre Sylva, where he was Special Adviser on Media before now."
  },
  {
    "headline": "Again, Buhari Calls UK Police On Nigerians, Protesters Lay 14-Day Siege To Embassy",
    "summarized_story": "SaharaReporters obtained a video of the London policemen who chatted with the Nigerian protesters and were reportedly friendly.\nWATCH: Used To Oppressing Protesters, Nigeriaâ\u0080\u0099s Tyrannical President @MBuhari Again Calls UK Police On #BuhariMustGo Demonstrators Laying Siege On Residence https://t.co/OB3yf2v7VD pic.twitter.com/XPU7ah2Z6F — Sahara Reporters (@SaharaReporters) August 10, 2021“Buhari again calls UK Police on #BuhariMustGo protesters laying siege on the Nigerian Embassy in London.\n“They insisted that President Buhari must go as he had failed.\nThey have laid siege on the embassy for 14 days – since Buhari left for the UK without handing over to Vice President Yemi Osinbajo.\nThe police officers were seen speaking with the Nigerian protesters, seemingly persuading them to stop protesting there."
  },
  {
    "headline": "Again, Buhari Calls UK Police On Nigerians, Protesters Lay 14-Day Siege To Embassy",
    "summarized_story": "SaharaReporters obtained a video of the London policemen who chatted with the Nigerian protesters and were reportedly friendly.\nWATCH: Used To Oppressing Protesters, Nigeriaâ\u0080\u0099s Tyrannical President @MBuhari Again Calls UK Police On #BuhariMustGo Demonstrators Laying Siege On Residence https://t.co/OB3yf2v7VD pic.twitter.com/XPU7ah2Z6F — Sahara Reporters (@SaharaReporters) August 10, 2021“Buhari again calls UK Police on #BuhariMustGo protesters laying siege on the Nigerian Embassy in London.\n“They insisted that President Buhari must go as he had failed.\nThey have laid siege on the embassy for 14 days – since Buhari left for the UK without handing over to Vice President Yemi Osinbajo.\nThe police officers were seen speaking with the Nigerian protesters, seemingly persuading them to stop protesting there."
  },
  {
    "headline": "EXCLUSIVE: How Nigeria’s Code Of Conduct Tribunal Uncovered Yobe Governor’s N3billion Property, N2billion Stashed In 11 Bank Accounts",
    "summarized_story": "According to the assets’ form, the governor declared ownership of a five-bedroom duplex at Tafawa Balewa way, Kaduna State, which he bought for N75million on August 15, 2018.\nBuni also said he has another five-bedroom flat he bought for N60million in 2016 at Court Road, Grace Yard, Karu Abuja.\nAlso listed by the governor was a six-bedroom duplex with conference room bought at N150million in 2019.\nBuni declared that, as at 23 May, 2019, he had the sum of N1.3billion in his Keystone bank account (1004339343).\nAn analysis of the document submitted by the governor showed that He declared having N2billion as cash in six Nigerian banks."
  },
  {
    "headline": "EXCLUSIVE: How Nigeria’s Code Of Conduct Tribunal Uncovered Yobe Governor’s N3billion Property, N2billion Stashed In 11 Bank Accounts",
    "summarized_story": "According to the assets’ form, the governor declared ownership of a five-bedroom duplex at Tafawa Balewa way, Kaduna State, which he bought for N75million on August 15, 2018.\nBuni also said he has another five-bedroom flat he bought for N60million in 2016 at Court Road, Grace Yard, Karu Abuja.\nAlso listed by the governor was a six-bedroom duplex with conference room bought at N150million in 2019.\nBuni declared that, as at 23 May, 2019, he had the sum of N1.3billion in his Keystone bank account (1004339343).\nAn analysis of the document submitted by the governor showed that He declared having N2billion as cash in six Nigerian banks."
  },
  {
    "headline": "EXCLUSIVE: How Nigeria’s Code Of Conduct Tribunal Uncovered Yobe Governor’s N3billion Property, N2billion Stashed In 11 Bank Accounts",
    "summarized_story": "According to the assets’ form, the governor declared ownership of a five-bedroom duplex at Tafawa Balewa way, Kaduna State, which he bought for N75million on August 15, 2018.\nBuni also said he has another five-bedroom flat he bought for N60million in 2016 at Court Road, Grace Yard, Karu Abuja.\nAlso listed by the governor was a six-bedroom duplex with conference room bought at N150million in 2019.\nBuni declared that, as at 23 May, 2019, he had the sum of N1.3billion in his Keystone bank account (1004339343).\nAn analysis of the document submitted by the governor showed that He declared having N2billion as cash in six Nigerian banks."
  },
  {
    "headline": "'We're pampering insurgents' -- reactions to photos of army donating food items to surrendered Boko Haram leaders",
    "summarized_story": "The Nigerian Twittersphere is abuzz over photos which show the army donating food items to surrendered Boko Haram commanders.\nAdvertisementThe Boko Haram commanders had surrendered to troops in Operation Hadin Kai.\nIn a statement on Monday, Onyema Nwachukwu, army spokesperson, shared photos of the Boko Haram commanders, saying Musa Adamu, a chief bomb expert of the insurgents, was one of those who surrendered.\nBut young Nigeria youth protesting on the street for a better country is seen as a threat that deserve to rot in jail or shot at.\n#BETTERNIGERIA https://t.co/n5ThNFcw0O — E A S Y🚶🏾 (@AASamuel321) August 10, 2021AdvertisementThis is disheartening 😔 https://t.co/3yO5Girrt2 — Adedayo Adesuyi (@AdesuyiAdedayo) August 10, 2021Surrendered Boko Haram commanders carrying placards pleading forgiveness."
  },
  {
    "headline": "'We're pampering insurgents' -- reactions to photos of army donating food items to surrendered Boko Haram leaders",
    "summarized_story": "The Nigerian Twittersphere is abuzz over photos which show the army donating food items to surrendered Boko Haram commanders.\nAdvertisementThe Boko Haram commanders had surrendered to troops in Operation Hadin Kai.\nIn a statement on Monday, Onyema Nwachukwu, army spokesperson, shared photos of the Boko Haram commanders, saying Musa Adamu, a chief bomb expert of the insurgents, was one of those who surrendered.\nBut young Nigeria youth protesting on the street for a better country is seen as a threat that deserve to rot in jail or shot at.\n#BETTERNIGERIA https://t.co/n5ThNFcw0O — E A S Y🚶🏾 (@AASamuel321) August 10, 2021AdvertisementThis is disheartening 😔 https://t.co/3yO5Girrt2 — Adedayo Adesuyi (@AdesuyiAdedayo) August 10, 2021Surrendered Boko Haram commanders carrying placards pleading forgiveness."
  },
  {
    "headline": "PHOTOS: Boko Haram top commanders surrender, ask Nigerians for forgiveness",
    "summarized_story": "The Nigerian Army says top Boko Haram commanders have surrendered to its troops in Operation Hadin Kai.\nAdvertisementThe army said over hundred Boko Haram fighters with their families surrendered to the troops.\nOnyema Nwachukwu, army spokesperson, in a statement shared alongside photos of the Boko Haram commanders said Musa Adamu, a chief bomb expert for the insurgents, was one of those who surrendered.\nAdvertisement“The acting General Officer Commanding (GOC) 7 Division and Commander Sector 1 OPHK Brigadier General Abdulwahab Adelokun Eyitayo was at Headquarters 21 Special Armoured Brigade Bama on Saturday, 7 August, 2021 to receive the set of the surrendered Boko Haram terrorists and their families.\nGeneral Eyitayo who spoke through an interpreter further disclosed that they will undergo some rehabilitation process at a Government facility before reintegration into the larger society."
  },
  {
    "headline": "PHOTOS: Boko Haram top commanders surrender, ask Nigerians for forgiveness",
    "summarized_story": "The Nigerian Army says top Boko Haram commanders have surrendered to its troops in Operation Hadin Kai.\nAdvertisementThe army said over hundred Boko Haram fighters with their families surrendered to the troops.\nOnyema Nwachukwu, army spokesperson, in a statement shared alongside photos of the Boko Haram commanders said Musa Adamu, a chief bomb expert for the insurgents, was one of those who surrendered.\nAdvertisement“The acting General Officer Commanding (GOC) 7 Division and Commander Sector 1 OPHK Brigadier General Abdulwahab Adelokun Eyitayo was at Headquarters 21 Special Armoured Brigade Bama on Saturday, 7 August, 2021 to receive the set of the surrendered Boko Haram terrorists and their families.\nGeneral Eyitayo who spoke through an interpreter further disclosed that they will undergo some rehabilitation process at a Government facility before reintegration into the larger society."
  },
  {
    "headline": "Newspaper Headlines: IPOB's sit-at-home order grounds activities in south-east",
    "summarized_story": "The division among stakeholders in the Peoples Democratic Party over the fate of Uche Secondus, the party’s national chairman, dominated the headlines of Nigerian newspapers.\nAdvertisement"
  },
  {
    "headline": "Chaka partners with TradingView to help clients better invest in global markets",
    "summarized_story": "Chaka has teamed up with TradingView, a leading online charting platform used by investors, to help its clients better spot and evaluate investment opportunities in global markets.\nUsing TradingView, traders follow investment assets, find trading ideas, chat with other investors, spot trends in global markets, assess opportunities, and place trades directly on charts.\nProfessional traders and investment enthusiasts across Africa that use Chaka can now access the wide trading community on TradingView with their brokerage accounts.\nClients that access TradingView through Chaka will pay fees as low as 0.69%, under the company’s dynamic fee system that helps investors preserve their capital.\nFor now, Chaka users can only access TradingView by invite, which they can request here."
  },
  {
    "headline": "Olumide Soyombo: The journey from startup founder to investment mogul",
    "summarized_story": "The early daysAt first, being a doctor was all Soyombo wanted to be until he was given a personal computer.\nAfter his first degree, Soyombo went on to get a master’s degree in business and information technology from Aston Business school.\nSo they created Leadpath as an investment vehicle to invest in startups, at first the approach was to invest $25,000 – $100,000 in local tech startups, similar to the Y-combinator accelerator model.\nThe bitter taste of how the founder handled the first company didn’t allow Soyombo to invest in the second company.\nWhen he thinks about the future, Soyombo is excited about the fact that the African tech ecosystem is maturing."
  },
  {
    "headline": "MTN finally repatriates 2020 dividend from Nigeria after forex crisis",
    "summarized_story": "South Africa’s MTN Group has repatriated its last year’s dividend of around $280 million (R4.2 billion) from its local unit in Nigeria.\nRespite in U.S. court caseIn addition to the news from Nigeria, MTN also revealed “positive developments” in a United States court case related to the group and its subsidiaries, MTN Afghanistan and MTN Dubai.\nIn Nigeria, MTN, through its local unit, has earmarked ₦600 billion ($1.5 billion) over the next three years to expand broadband access in Africa’s most populous economy.\nMobile subscribers decline in NigeriaFor MTN Nigeria, half-year 2021 results show that service revenue increased by 24.1% year-on-year, despite the number of its mobile subscribers declining by 7.6 million (nearly 10%).\nMTN Nigeria aims to sustain “double-digit service revenue growth ahead of inflation, driving 4G and rural network expansion,” Toriola said."
  },
  {
    "headline": "Can mobile applications help solve Africa's healthcare access problem?",
    "summarized_story": "Without discovering the mobile app, he could easily have been one of the more than 400,000 Africans malaria killed in 2019.\nZuri Health mobile app.\nArthur Ikechukwu Anoke and Daisy Isiaho, co-founders of the mobile app, Zuri Health.\nGovernmental policies will help hold digital healthcare companies accountable and protect the information and data of citizens that use the technologies.\nYet it’s fundamental if we should achieve the Sustainable Development Goals,” said Daisy Isiaho, Zuri Health Co-founder and Chief Product Officer."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "African payments startup, Flutterwave, has announced the appointment of Jimmy Ku as the Head of US Growth."
  },
  {
    "headline": "Chekkit’s $500k pre-seed, tapping global stock markets, Moove’s $23m Series A",
    "summarized_story": "Moove’s $23m Series AChekkit raises $500k pre-seed to combat fake consumer drugs and goodsChekkit TeamChekkit, a Nigeria-based anti-counterfeiting startup, has announced a $500k pre-seed.\nNigerian deep tech startup, RxAll is looking to squash the $30 billion global fake drug industryBefore this funding, Chekkit relied on grants.\nTapping global investment currentsPartnershipWhat does a partnership between a Nigeria-based investment-tech startup and a global investment social network platform spell for investors?\nWith this partnership, Chaka is now a local, licenced broker with the TradingView investment platform.\nRecall that Chaka is also the first digital investment platform to secure Nigeria’s new digital sub-broker licence."
  },
  {
    "headline": "Nigeria-based anti-counterfeiting startup, Chekkit raises $500k pre-seed funding",
    "summarized_story": "Share this article:Nigeria-based anti-counterfeiting startup, Chekkit Technologies, has announced a $500,000 pre-seed round as it looks to expand its team and technological infrastructure.\nFounded in 2018 by Dare Odumade, CEO and Oluwatosin Adelowo, CMO, Chekkit offers product verification and anti-counterfeiting solutions using Blockchain.\nAfter the event, Afghanistan’s Ministry of Health signed an MoU with Fantom and Chekkit for a 3-month pilot project to track and verify 80,000 pharmaceutical products.\nA 2018 WHO factsheet on substandard and falsified medical products reveals that between 64,000 and 158,000 people die from counterfeit anti-malarial drugs in sub-Saharan Africa per year.\nCurrently, in Africa, startups like Chekkit and deep tech startup RxAll are trying to combat this problem."
  },
  {
    "headline": "Nigeria-based mobility fintech, Moove raises $23 million Series A",
    "summarized_story": "Share this article:Nigeria-based auto-financing startup, Moove has announced a $23 million Series A to build a full-service mobility fintech that democratises vehicle ownership across Africa.\nOthers include DCM Ventures, Clocktower Technology Ventures, thelatest.ventures, London-based LocalGlobe, California-based Tekton Ventures, New York-based FJ Labs, and New York-based Palm Drive Capital.\nAfrica focused VC Verod Capital Management, Kepple Africa Ventures, and London-based Emso Asset Management — one of Moove’s existing lenders — joined the round.\nThis brings Moove’s total funding to $68.2 million — $28.2 million in equity and $40 million in debt.\n“With Ladi and Jide at the helm of a world-class team, and their unique approach to vehicle financing, Moove has quickly established itself as one of the most exciting tech companies in Africa."
  },
  {
    "headline": "Insurance offers survival option as MSMEs battle growing risks",
    "summarized_story": "The growing risks facing Micro, Small and Medium-scale Enterprises (MSMEs) is reigniting the need for widespread adoption of insurance as a protection measure against unforeseen losses dealing a blow to the wider economy.\nViolent protests, like the #EndSARS protest in October 2020, insecurity in parts of Nigeria that no longer allow farmers into their farms,…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigerians turn to East Africa, Egypt for summer as COVID-19 disrupts travels",
    "summarized_story": "This year’s summer travel is losing momentum for many Nigerian holiday makers who are now cancelling foreign leisure and travel plans following the surge in the new Delta variant of coronavirus pandemic.\nHowever, the challenges have become gains for some African destinations that are now opening their doors and reaping huge traffic from Nigerian holiday makers.\nAccording to most tour operators, Egypt is the leading destination for Nigerians this summer, followed by East African countries of Mauritius, Kenya, Rwanda, while Ghana and the Gambia draw a few from their West African neighbour.\n“The destination that is trending now for summer is Egypt.\nUsually for summer, people travel with children, but now, nobody wants to expose their children to COVID-19."
  },
  {
    "headline": "Moove secures $23m investment to expand vehicle ownership in Africa",
    "summarized_story": "Most vehicle loans from Nigerian banks have a shelf life of 24 months and come with so many stringent measures that customers end up discouraged from even trying.\nIn 2020, Vice President Yemi Osinbajo said the demand for vehicles in Nigeria currently stood at about 720,000 against actual local production by the available assembly plants…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Gapiona Flood Project: Edo NEWMAP flays fake viral video, says govt committed to tackling erosion problems – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State-Nigerian Erosion and Watershed Management Project has condemned a viral video of a protest by some persons purported to be living around the project catchment area of Gapiona, noting that claims in the said video were falsely represented.\n“The project is by the Edo State Government and not a World Bank project as erroneously conveyed in the said video.\nFurthermore, the Gapiona flood Project was initiated at the instance of the State Government and not the other way.\nResidents in Gapiona area have lived with the erosion problem for over 20 years, this has led to many residents fleeing their homes while majority of the access roads linking the area has been rendered impassable.\n“NEWMAP’s intervention in the area has brought succor to residents in the sections where work has been completed."
  },
  {
    "headline": "‘Repent Or Relocate’ New DPO Warns Criminals In Warri – Nigerian Observer",
    "summarized_story": "CSP Onana Omar Ari , disclosed this while on a courtesy visit to the Nigerian Union of Journalists(NUJ) Warri Correspondents’ Chapel.\nHe warned criminals gaining more grounds to relocate from the division or repent in their own interest.\n“My message to these criminal elements is that, they should repent or relocate, because we are not here to play”.\nAddressing Journalists at NUJ Secretariat in Warri, CP Ari stated that, the police could not single-handedly fight and win the war against criminals without the active support of the public.\n“Collaboration of members of the public with the police in the fight against these monsters causing havoc in the society is highly imperative to burst the rings of the criminals,” he said."
  },
  {
    "headline": "Edo govt begins training for state’s information officers, media practitioners, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has commenced a month-long training for Information Officers, Media Practitioners and Public Relations Officers under the employment of the state government.\nThe training, aimed at upskilling the workers and equipping them with modern communication skills and tools, is part of ongoing efforts by the Governor Godwin Obaseki-led government to renew the state’s communication ethos through the establishment of the Edo Communication Organization (ECO).\nDeclaring the workshop open at the John Odigie-Oyegun Training Centre in Benin City, the Edo State Head of Service, Anthony Okungbowa Esq., said the workshop will further enhance the workers’ skills thereby ensuring improved productivity and optimal service delivery to Edo people.\nAccording to him, “the training programme is timely as it will enable participants to enhance their skills and knowledge, thereby ensuring they function effectively.”He noted that the Obaseki-led government is committed to the training and retraining of every Edo worker, adding, “Effective communication is a veritable tool in the implementation of government policies and programmes, which is a necessity in the realization of Governor Godwin Obaseki’s vision of making Edo great again.”The training is organized by the Edo State Government, in collaboration with the Tonnie Iredia Centre for Media Advocacy (TICMA).\nResource persons like Professor Tonnie Iredia, who is the Chairman Board of Trustees of TICMA and other prominent professionals in academics, communication, advertising and Public Relations will be tutoring the participants during the one month period, to raise the standard of communication practice in Edo State."
  },
  {
    "headline": "Edo Sexual Assault Referral Centre assures justice for victims of rape, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The newly appointed Coordinator of the Edo State Sexual Assault Referral Centre, Dr. Georgina Eromosele, has promised to ensure justice for the victims of rape and other gender-based violence in the state.\nEromosele, who spoke to journalists in Benin City, called for the support of residents to tackle sexual and gender-based violence including rape and domestic violence, in line with the vision of Governor Godwin Obaseki and his wife, Mrs Betsy Obaseki.\nThe new coordinator for the centre, which is named after the late teenage victim of rape, Vivian Ogu, is a graduate of the Obafemi Awolowo University, Ile-Ife (OAU) medical school, with a Masters degree in Public Health from the Ladoke Akintola University, Ogbomosho, and was most recently a Senior Medical Officer at Central Hospital, Benin City.\nEromosele, who earlier served as Head of the District Hospital, Ekiadolor, is a Member of the Medical and Dental Council of Nigeria, and was Secretary-General, Association of Resident Doctors, Edo State HMB chapter, before her appointment.\nAccording to her, “the Vivian Centre is one of a kind in the country and is well positioned to serve as a safe environment where survivors are given all the required care and support they need, including medical examination, screening and preventive treatment for Human Immunodeficiency Virus (HIV) and other sexually transmitted infections.”..."
  },
  {
    "headline": "Lawyers to boycott court over alleged harassment, intimidation by judge",
    "summarized_story": "ADVERTISEMENTThe Nigeria Bar Association (NBA), Benin branch, has ordered a boycott of High Court 6, Benin, over alleged harassment and intimidation of its members by the presiding judge.\nThe statement said the decision to boycott the court was a unanimous one, with regard to the “incessant and unabating harassment, intimidation, outright insults and deliberate embarrassment to counsels” appearing before the judge.\nIt said that the decision was reached at this month’s meeting of the Lion Bar in Benin which was attended by Senior Advocates of Nigeria (SANs), benchers, elders, leaders and members of the bar.\nThe statement alleged that the judge harassed, insulted and intimidated SANS and other very senior members of the bar in the presence of their clients and would-be clients.\n“Consequently, all members of the association are directed to embark on a total boycott of the court and are not permitted to carry out any business in the said court till a subsequent review of this directive by the general meeting,” the statement added."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Sterling Bank rakes in N5.7bn PAT in first half of 2021",
    "summarized_story": "Despite the prevailing difficult macro-economic environment, Sterling Bank Plc, , has reported a profit after tax (PAT) of N5.691 billion for the first half of 2021.\nThis, according to the bank, was achieved on gross earnings of N68.609 billion for the half year ended June 30, 2021 compared to gross earnings of N66.541 billion it declared in the corresponding period of 2020.\nThis represents a 5.097 percent growth in net profit, from N5.415 billion in the first half of 2020, and 3.108 percent in gross earnings.\nsectors, it is engaged in commercial banking services with emphasis on retail, commercial and corporate banking, trade services, investment banking activities and non-interest banking.\nIt also provides wholesale banking services including the granting of loans and advances; letter of credit transactions, money market operations, electronic banking products and other banking activities."
  },
  {
    "headline": "First Bank impacts its FirstMonie agents with N100bn loan",
    "summarized_story": "Barely a year after the launch of its Agent Credit scheme, First Bank of Nigeria Limited, Nigeria’s leading financial inclusion services provider, has announced that it has economically empowered its Firstmonie Agents with the sum of N100 billion.\nThe Bank currently has over 120,000 Firstmonie Agents, spread across 772 Local Government Areas in the country.\nThe Agent Credit scheme was created by the banking giant to promote and expand the business activities of its foremost agent banking platform – Firstmonie Agents – whilst putting them at an advantage to positively impact their immediate environment.\nThe Firstmonie Agent channel is amongst the Bank’s many initiatives to expand financial access in the country.\nWe encourage our Firstmonie Agents to keep being exemplary in setting the pace to promote financial inclusion as we collectively work towards the continuous growth and development of the national economy.”"
  },
  {
    "headline": "Nigeria to increase oil reserves by 35% to 50 billion barrels – DPR",
    "summarized_story": "The Department of Petroleum Resources (DPR) has said the federal government is planning to raise its oil reserves by 35 percent from 36.91 billion barrels to 50 billion barrels in the short to medium term.\nAuwalu announced that DPR plans to establish an annual award, the “Improved oil recovery (IOR)/enhanced oil recovery (EOR) awards”, for companies, projects or individuals who add value to the Nigerian oil sector through enhanced recovery of the country’s oil and gas resources.\nAccording to the report, Nigeria produced 1.31 million barrels per day (bpd) in June against the 1.34 million bpd in May based on direct communication.\nSimilarly, the country produced 1.39 million bpd in June from 1.40 million bpd in the previous month, based on secondary sources.\nNigeria is the largest crude producer in Africa as well as has the 10th largest crude reserves in the world, Cable reported."
  },
  {
    "headline": "Dangote ranked 117th, as Elon Musk tops latest global billionaires index",
    "summarized_story": "The President of Dangote Group, Aliko Dangote, has been ranked 117th in the latest Bloomberg Billionaires Index.\nDetails about the calculations are provided in the net worth analysis on each billionaire’s profile page.\nIn the index, which usually has its figures updated at the close of every trading day in New York, Dangote is said to have a net worth of $17.8bn.\nTop of the index is Tesla CEO, Elon Musk with a net worth of $194bn, closely followed by Amazon founder, Jeff Bezos who is also worth $194bn.\nFacebook CEO Mark Zuckerberg holds the fifth position with a net worth of $135bn."
  },
  {
    "headline": "COVID-19: Nigeria To Receive 176,000 Doses Of J&J Vaccine Wednesday",
    "summarized_story": "The National Primary Health Care Development Agency (NPHCDA) has said that Nigeria is expecting 176,000 doses of Johnson&Johnson (J&J) COVID-19 vaccine on Wednesday.\nHe also said that the country is expected to receive 700,000 doses of AstraZeneca COVID-19 vaccine to enable those who have received their first jab to get the second jab.\nADVERTISEMENT“J&J COVID-19 vaccine is expected in two days time (Wednesday).\n“We expect to get 700,000 doses of the AstraZeneca vaccine to make sure that those who got the first dose will get the second dose,” he explained.\nShuaib also disclosed that the second phase of COVID-19 vaccination roll-out would begin on Monday next week."
  },
  {
    "headline": "COVID-19: Nigeria To Receive 176,000 Doses Of J&J Vaccine Wednesday",
    "summarized_story": "The National Primary Health Care Development Agency (NPHCDA) has said that Nigeria is expecting 176,000 doses of Johnson&Johnson (J&J) COVID-19 vaccine on Wednesday.\nHe also said that the country is expected to receive 700,000 doses of AstraZeneca COVID-19 vaccine to enable those who have received their first jab to get the second jab.\nADVERTISEMENT“J&J COVID-19 vaccine is expected in two days time (Wednesday).\n“We expect to get 700,000 doses of the AstraZeneca vaccine to make sure that those who got the first dose will get the second dose,” he explained.\nShuaib also disclosed that the second phase of COVID-19 vaccination roll-out would begin on Monday next week."
  },
  {
    "headline": "Striking Resident Doctors Defy FG’s Resumption Order",
    "summarized_story": "Nigerian Association of Resident Doctors (NARD) has said the ongoing nationwide strike by its members will continue even if the government decides to implement its “no work, no pay” threat till their demands are met.\nNARD president, Dr Uyilawa Okhuaihesuyi, told LEADERSHIP last night that unless they get a satisfactory response from the government, the strike will continue despite the threat.\nHe said, “We will continue with the strike.\nWe are happy with the threat because it shows that we are doing something good.”ADVERTISEMENTThe doctors embarked on an indefinite strike on August 2, 113 days after it suspended the last strike.\nMeanwhile, the minister of state for labour and employment, Festus Keyamo, has urged the government to live up to its responsibilities, saying agreements with workers should be respected."
  },
  {
    "headline": "Striking Resident Doctors Defy FG’s Resumption Order",
    "summarized_story": "Nigerian Association of Resident Doctors (NARD) has said the ongoing nationwide strike by its members will continue even if the government decides to implement its “no work, no pay” threat till their demands are met.\nNARD president, Dr Uyilawa Okhuaihesuyi, told LEADERSHIP last night that unless they get a satisfactory response from the government, the strike will continue despite the threat.\nHe said, “We will continue with the strike.\nWe are happy with the threat because it shows that we are doing something good.”ADVERTISEMENTThe doctors embarked on an indefinite strike on August 2, 113 days after it suspended the last strike.\nMeanwhile, the minister of state for labour and employment, Festus Keyamo, has urged the government to live up to its responsibilities, saying agreements with workers should be respected."
  },
  {
    "headline": "FG Trains Kano EXCO Members On e-Governance, Digital Transformation",
    "summarized_story": "In its fulfilment to enable the development of National Digital Economy Policy and Strategy (NDEPS), the federal government of Nigeria, through the Ministry of Communications and Digital Economy, under the leadership of honourable minister, Dr Isa Ali Ibrahim Pantami, has kick-started a pioneer programme to train members of Kano executive council on e-governance and digital transformation.\nThe two-day event, which commenced August 2, 2021, was attended by Kano state governor, Dr Abdullahi Umar Ganduje, his deputy, Dr Nasiru Yusuf Gawuna, secretary to the state government, Alhaji Usman Alhaji, Commissioners, and other members of the executive council of the state.\nDr Pantami stated that the National Digital Economy Policy and Strategy (NDEPS) was developed and launched in 2019 to reposition the Nigerian Economy in order to take advantage of the many opportunities that digital technologies provide.\n“Furthermore, the Service Infrastructure Pillar provides support for Government Digital Services and the provision of robust digital platforms to drive the Digital Economy.\nIt supports the deployment of government digital services and a paperless system."
  },
  {
    "headline": "Drama as monarch withdraws Okorocha’s chieftaincy title",
    "summarized_story": "The first class monarch had few weeks ago named Okorocha the Otunba Asoludero of Iselu kingdom through a letter signed by the monarch.\nOkorocha had also accepted the chieftaincy title and a September 19, 2021 date had been set for the installation ceremony.\nBut, Oba Akinyemi on Monday in another letter addresses to the senator explained that the chieftaincy title was withdrawn in the interest of peace and harmony.\nIt was further gathered that the monarch was asked to withdraw the chieftaincy title and cancel the proposed ceremony.\nHe said, “It is left to him, I don’t know because he was the one that chose to give a chieftaincy title and he wrote me."
  },
  {
    "headline": "Drama as monarch withdraws Okorocha’s chieftaincy title",
    "summarized_story": "The first class monarch had few weeks ago named Okorocha the Otunba Asoludero of Iselu kingdom through a letter signed by the monarch.\nOkorocha had also accepted the chieftaincy title and a September 19, 2021 date had been set for the installation ceremony.\nBut, Oba Akinyemi on Monday in another letter addresses to the senator explained that the chieftaincy title was withdrawn in the interest of peace and harmony.\nIt was further gathered that the monarch was asked to withdraw the chieftaincy title and cancel the proposed ceremony.\nHe said, “It is left to him, I don’t know because he was the one that chose to give a chieftaincy title and he wrote me."
  },
  {
    "headline": "Sit-at-home: Eight killed as IPOB’s protest turns bloody",
    "summarized_story": "Gunmen, who went on a shooting spree in Anambra, attacked a police Area Command in Nnewi axis of the state.\nIt was terrible; these guys (hoodlums) came in seven vehicles.\n“There were speculations that the hoodlums came for reprisal following the early morning killing of two persons by unidentified soldiers (joint patrol team) in Nnewi.\nA source said the car was abandoned when the occupant saw that the hoodlums were advancing towards his direction.\nAn elderly man, Pa Johnson, whose house is opposite the scene, told The PUNCH that the incident happened around 4:30am."
  },
  {
    "headline": "Sit-at-home: Eight killed as IPOB’s protest turns bloody",
    "summarized_story": "Gunmen, who went on a shooting spree in Anambra, attacked a police Area Command in Nnewi axis of the state.\nIt was terrible; these guys (hoodlums) came in seven vehicles.\n“There were speculations that the hoodlums came for reprisal following the early morning killing of two persons by unidentified soldiers (joint patrol team) in Nnewi.\nA source said the car was abandoned when the occupant saw that the hoodlums were advancing towards his direction.\nAn elderly man, Pa Johnson, whose house is opposite the scene, told The PUNCH that the incident happened around 4:30am."
  },
  {
    "headline": "ICYMI: Boko Haram top commanders surrender; beg for forgiveness",
    "summarized_story": "The Chief Bomb Expert of Boko Haram, a terrorist group, known as Musa Adamu a.k.a Mala Musa Abuja and his second in command Usman Adamu a.k.a Abu Darda have surrendered themselves to the Nigerian Army.\nOnyema Nwachukwu, the army spokesperson, confirmed it in a statement released on Monday.\nHe said the top commanders surrendered along with their families and followers.\nNwachukwu noted that they surrendered to the troops of operation HADIN KAI in Bama Local Government Area of Borno State.\nGeneral Eyitayo who spoke through an interpreter further disclosed that they will undergo some rehabilitation process at a Government facility before reintegration into the larger society."
  },
  {
    "headline": "JUST IN: Real Madrid drag LaLiga president to court",
    "summarized_story": "The board of directors of Real Madrid have decided to take civil and criminal legal actions against the LaLiga President, Mr Javier Tebas Medrano.\nAlso to be sued are Mr Javier de Jaime Guijarro, head of the CVC Fund and the CVC Capital Partners SICAV-FIS Fund.\nThe Madrid board announced the decision today after its meeting at 11 a.m.“Board of Directors has resolved to take any legal action it considers appropriate to annul and render ineffective any possible resolutions adopted by the LaLiga Assembly, due to be held on 12 August 2021, in relation to the agreement between LaLiga and the CVC Fund”, a statement by the board said.\nMore to follow"
  },
  {
    "headline": "Boko Haram/ISWAP Terrorists Surrender, Ask Nigerians For Forgiveness [Photos]",
    "summarized_story": "Members of the terrorist groups Boko Haram and the Islamic State of West Africa Province, ISWAP, who recently surrendered to the Nigerian Army in the north pleaded for Nigerians to pardon them for their terrorist operations.\nDuring the greeting ceremony, some of the terrorist group’s top commanders held posters begging Nigerians for forgiveness.\nSome of the placards carried inscriptions such as “Nigerians please forgive us”, “surrender and be freed”, “Borno State remains the home of peace”.\nAccording to Brigadier General Onyema Nwachukwu, Director of Army Public Relations, the surrendered terrorists and their families totaled 335 fighters, 746 adult women and children, including one of the abducted Chibok girls.\nBrigadier General Abdulwahab Adelokun Eyitayo, acting General Officer Commanding (GOC) 7 Division and Commander Sector 1 OPHK, greeted the repentant terrorists at Headquarters 21 Special Armoured Brigade Bama in Borno State, according to the release."
  },
  {
    "headline": "Again, Buhari Calls UK Police On #BuhariMustGo Protesters [Video]",
    "summarized_story": "SaharaReporters were able to capture video showing London police officers chatting with Nigerian demonstrators and appearing to be pleasant.\n“Buhari again calls UK Police on #BuhariMustGo protesters laying siege on the Nigerian Embassy in London.\n“They insisted that President Buhari must go as he had failed.\nThey have laid siege on the embassy for 14 days – since Buhari left for the UK without handing over to Vice President Yemi Osinbajo.\nSome peaceful protesters demanding Buhari’s return to Nigeria were confronted by British police on Thursday evening, according to a video obtained by SaharaReporters."
  },
  {
    "headline": "Plateau Massacre: Buhari Orders Military To Kill Illegal Weapon Holders",
    "summarized_story": "President Muhammadu Buhari has instructed Nigerian military to subjugate culprits of the continuing massacre in Plateau.\nDespite the presence of large numbers of troops in the state, scores of indigenous people have been murdered in recent weeks.\nFollowing a comprehensive security report from the National Security Adviser’s office, the President approved a special operation, according to NEWS DIRECT.\n“The Commander-in-Chief, President Muhammadu Buhari has asked us to gun down anybody seen carrying illegal weapon and we must carry out the order.\nThe GOC went to some of the areas in Miango and Biyei that had been attacked by the killers."
  },
  {
    "headline": "How Code Of Conduct Tribunal Discovered Yobe Governor’s N3billion Property, N2billion Secretly Stored In 11 Bank Accounts",
    "summarized_story": "The governor also listed a six-bedroom duplex with conference room that he purchased for N150 million in 2019.\nIn 2015, the governor purchased another four-bedroom duplex at N55 million.\nThe governor also listed other properties in Damaturu, Maiduguri, Kano, and Abuja that cost N2 million, N5 million, N8 million, N10 million, and N20 million each.\nIn addition, the governor claimed to have N912 million in his Fidelity bank account (5600287335).\nA source at the CCB previously told SaharaReporters that the agency’s inquiry into what he called the governor’s anticipatory declaration had progressed far."
  },
  {
    "headline": "Breaking: PSG, Messi agree 2-year deal worth £500, 000 per week",
    "summarized_story": "Paris Saint-Germain have reached agreement with Lionel Messi and his lawyers with the 34-year-old expected in the French capital this afternoon.\nA press conference is set to take place on Wednesday at the Parc des Princes.\nThe final points of negotiation are understood to have concerned the six-time Ballon d’Or winners image rights, as well as the breakdown of his wages and various bonuses.\nThe player’s representatives and Barcelona had earlier moved to dispel reports that the Spanish side made a last ditch bid to keep Messi.\nFor that reason they did not attempt to persuade Messi to drop his salary."
  },
  {
    "headline": "PDP crisis: Will Secondus get Oshiomhole treatment?",
    "summarized_story": "Will National Chairman Peoples Democratic Party (PDP) Prince Uche Secondus go the way of sacked Comrade Adams Aliyu Oshiomhole as the national chairman of the All Progressives Congress (APC)?\nUdeh-Okoye – National Youth Leader, Ambassador Taofiq Arapaja – National Vice Chairman (SW), Chief Dr. Ali Odefa National Vice Chairman (SE), Chief Dan Osi Orbih -National Vice Chairman (SS) and Chief Theophilus Dakas National Vice Chairman (NC).\nS.K.E Udeh- Okoye, Ambassador Taofiq Arapaja – National Vice Chairman (SW), Chief Dan Orbih National Vice Chairman (SS) and Chief Dr. Ali Odefa National Vice Chairman (SE),” the statement further said.\nYouth groupSimilarly, a group – Save PDP Group and Coalition of PDP Youth Groups -protested Monday in Abuja and called for Secondus’ removal.\nNational vice chairs join callIn the same vein, the party’s national vice chairmen are also asking for Secondus’ resignation."
  },
  {
    "headline": "4 killed, vehicles burnt as IPOB sit-at-home grounds South-east",
    "summarized_story": "When confronted by the IPOB members on why they were flouting the order, their response was unsatisfactory and the assailants pounced on them and burnt the vehicles, killing two people in the process.\nMeanwhile, the sit-at-home order has partially succeeded in the state.\nThis followed Monday’s news on social media that Nnamdi Kanu’s brother, Kanunta, had suspended the order which IPOB spokesman, Emma Powerful countered some minutes later.\nBlueprint observed that a few vehicles were plying the route while some people were seen cautiously walking on the streets.\nEnuguSimilarly, major streets in Enugu metropolis were deserted in compliance with the IPOB order."
  },
  {
    "headline": "PDP crisis: Govs to continue dialogue with stakeholders Tuesday",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nIn accordance with THE LAW, the material on this Website is included for informational and educational purposes.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Sack Ngige, Ehanire, Sanusi -NARD -NigPilot",
    "summarized_story": "National Association of Resident Doctors, NARD, has called for the immediate sack of Ministers of Labour and Productivity, Dr. Chris Ngige, his Health counterpart Osagie Ehanire and Registrar, Medical and Dental Council of Nigeria, MDCN, for failure to carry out their duties.\nThe call was made by NARD’s President, Uyilawa Okhuaihesuyi, who said the ministers and Tajudeen should be sacked if they cannot handle their responsibilities.\nOkhuaihesuyi tackled Ngige for issuing threats of replacement against the resident doctors on national television when their demands raised have not been met.\n“If you want to toe the line of no work, no pay, I think you will go and look for 16,000 resident doctors to occupy our place,” he said.\nHowever, in his response, Ngige threatened that the federal government will invoke the no-work and no-pay order against the resident doctors because the federal government has met their demands."
  },
  {
    "headline": "FG Partners with NOA for GEEP 2.0 kickoff –NigPilot",
    "summarized_story": "Federal Government has signed a partnership with the National Orientation Agency as one of its key partners in its quest to raise awareness for its National Social Investment Programmes.\n“I must say the agency has shown outstanding dedication towards effective implementation of the NSIP programmes.\nIt is in this vein that the FMHADMSD entered into a partnership with NOA to appoint the Community Orientation and Mobilization officers as GEEP Desk Officers in all the 774 local government local areas across the country”.\nTo this end, the ministry in conjunction with NOA has appointed Community Orientation and Mobilization officers to be trained as GEEP Local Government Desk Officers in all the 774 local government levels areas across the 36 states and the FCT.\nThese officers will sensitize communities on the GEEP programmes, register interested beneficiaries of TraderMoni, MarketMoni and FarmerMoni."
  },
  {
    "headline": "Xenophobia:How Nigerian Diplomat Manhandled, Tortured in Indonesia -NigPilot",
    "summarized_story": "The development is coming on the heel of manhandling, torturing, and handcuffing of a senior Nigerian Diplomat in Jakarta, Indonesia, Mr Abdul Rahman Ibrahim over the weekend.\nThe release was titled The Continued Harassment, Intimidation and Unlawful Arrest of Nigerians in Asian Countries and The Need For President Muhammadu Buhari ‘s Urgent Intervention”.\nComrade Nwankwo explained with regret that, many Nigerians are currently languishing unjustly in many Prisons across Asia.\nThe development which resulted for him to sustain a lot of injuries in the neck, hands and chest.\nAfter the whole unfortunate and ugly drama, the Officers later realized that Mr. Abdul Rahman Ibrahim is a senior Counsellor/Diplomat with Nigerian Embassy in Indonesia as he had claimed."
  },
  {
    "headline": "NCDC Calls For Action As Cholera Kills 816 In 22 States, FCT",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) has called on state governments and citizens to take more proactive steps to combat the outbreak of cholera across states in Nigeria.\nAccording to the NCDC, the recent outbreak has been exacerbated by poor access to clean water, open defecation, poor sanitation, and hygiene.\nWithout proper water, sanitation, and hygiene (WaSH), Nigeria remains at risk of cholera cases and deaths,” the NCDC added.\nFrom July 24 to 28, a reactive oral cholera vaccine (OCV) campaign led by NPHCDA was conducted in Bauchi LGA.\n“Cholera is preventable and treatable; however, it can be deadly when people who are infected do not access care immediately,” it warned."
  },
  {
    "headline": "COVID-19: Nigeria Records 422 New Cases, Five More Deaths",
    "summarized_story": "Nigeria on Monday recorded 422 new cases of COVID-19 and five more deaths, this is according to the Nigeria Centre for Disease Control (NCDC).\nLagos takes the lead with 190 cases, followed by Rivers (86) and Ogun (85).\nMore than 200 million cases of the pandemic have been confirmed with a spike in the death toll of four million globally.\nRecently, the Executive Director of the National Primary Health Care Development Agency (NPHCDA), Dr Faisal Shuaib announced the commencement of the second phase of the COVID-19 vaccination programme on August 16.\n“The start date for the vaccination has been postponed to next week Monday,” he said."
  },
  {
    "headline": "Four Policemen Feared Killed As Gunmen Attack Area Command In Anambra",
    "summarized_story": "Four policemen have been reported killed during an attack by gunmen on the Police Area Command in Nnewi, Anambra State.\nThe spokesman for the Anambra State Police Command, Tochukwu Ikenga, told Channels Television that his office had yet to receive a detailed report on the incident.\nAccording to sources, the gunmen stormed the Police Area Command on Monday afternoon and engaged the security operatives in a fierce gunfight.\nAn eyewitness who pleaded anonymity told Channels Television that the gunmen overpowered the security operatives and carted away with some of their arms.\nSince the beginning of the year, dozens of police facilities, including a state police command have come under attack in the South East."
  },
  {
    "headline": "Nigerian Govt Condemns Assault On Diplomat By Indonesian Officials",
    "summarized_story": "The Ministry of Foreign Affairs has condemned the assault of a Nigerian diplomat by immigration officials in Indonesia.\nThe victim, whose name was not mentioned, was manhandled and arrested by immigration officials on Saturday in front of his official quarters in the Asian country.\n“The unfortunate incident is against international law and the Vienna Conventions governing Diplomatic and Consular Relations between states,” the Nigerian Foreign Affairs Ministry said in a statement on Monday.\nThe Nigerian Government has sent an official protest to the Government of Indonesia.”In addition to the Indonesian Ambassador’s apology, the immigration officials responsible for the assault have also apologised to the victim.\n“The Ambassador of Nigeria to Indonesia has confirmed that the immigration official involved had since come to the Nigerian Embassy to apologise to the Ambassador and the diplomat concerned,” the Foreign Ministry added."
  },
  {
    "headline": "Premier League Fans To Be Subject To COVID-19 Spot-Checks",
    "summarized_story": "The Premier League has announced fans will be subject to random spot-checks of their Covid-19 status in the opening weeks of the new season.\nThe 2021-22 campaign kicks off on Friday when newly-promoted Brentford host Arsenal with national government restrictions on crowd capacity now eased.\nAny limits on attendances are agreed with local authorities and the Premier League clubs hope their protocols will ensure a return to full stadiums across the country.\nIn a statement, the Premier League said fans going to games should be prepared to show they have been fully vaccinated or have received a negative lateral flow test in the previous 48 hours.\nMeanwhile, nine Premier League players or members of staff were positive for coronavirus in the latest round of testing."
  },
  {
    "headline": "Strike: House Sub-Committee begins sitting on implementation of NARD demands",
    "summarized_story": "The House of Representatives’ Sub committee set up to work out modalities for the implementation of the demands of striking Resident doctors has begun sitting in Abuja.\nThe House of Representatives had on Monday met with the striking members of the National Association of Resident Doctors over to resolve the disagreement between the doctors and federal government.\nThe resident doctors had last week Monday declared indefinite strike over what it called federal government’s failure to honour its agreement.\nThe Resident doctors are demanding the payment of over N5 5 billion arrears of salaries, a reversal of alleged casualisation of doctors and immediate migration of their salaries from the Government Integrated Financial and Management Information System, GIFMIS, to the Integrated Payroll and Personnel Information System, IPPIS."
  },
  {
    "headline": "Lionel Messi agrees 2 year deal, set to sign for PSG",
    "summarized_story": "Lionel Messi is flying to Paris on Tuesday to finalise his move to Paris Saint-Germain, The Argentine is travelling to the French capital following Sunday’s emotional farewell to Barcelona at a news conference.\nSources added that Messi has signed a two-year contract at PSG, with the option to extend by a further year.\nSources disclosed that PSG have offered the six-time Ballon d’Or winner a two-year contract with an optional third year that will see him earn more than PSG and Brazil star Neymar, Messi’s former teammate at Barca.\nMessi’s contract with Barca expired on June 30 and despite attempts to keep the club’s all-time leading scorer, the deal could not be completed due to financial constraints.\nMessi also admitted he had received several calls from clubs since the news broke that he would not continue his 21-year association with Barca."
  },
  {
    "headline": "Oyo Govt to develop economy through sports, youth empowerment",
    "summarized_story": "Oyo State Governor, Seyi Makinde has reiterated his commitment towards strengthening the states economy through sport and youth empowerment.\nThe Governor while speaking at the newly upgraded stadium said the new face of the sport arena had been equipped to meet up with world’s standard.\nGovernor Makinde stressed that youth empowerment through sport will continue to be the administration’s priority.\nAdvertisementGovernor Makinde said he hopes to host international events in the newly revamped stadium.\nOther equipped facilities in the stadium include, hanging room for 25 players and wet areas with capacity for 11 players, doping control room, clinic, degree’s room, match officials and a youth centre/Ball Boys Rooms."
  },
  {
    "headline": "Tokyo 2020: Nigeria Sports Minister Takes Responsibility for Athletes’ Anti-doping Violations – Arise News",
    "summarized_story": "Nigeria’s Minister of Sports, Sunday Dare, has apologised for the embarrassment the West African country suffered at the Tokyo Olympics that saw 10 of its athletes disqualified and one of its finalists washing his own jersey.\n“First is the mishap resulting in 10 Team Nigeria athletes being ruled ineligible to compete for missing their mandatory Out of Competition Test, OTC.\n“When notice of this ruling got to me, I immediately mobilized my team and the AFN leadership to see how the situation could be salvaged.\nWe mounted a vigorous appeal process with Athletics Integrity Unit, AIU and had the team members complete the tests.\nThe AFN has also taken responsibility and apologized to the athletes and to Nigerians.”By Abel Ejikeme"
  },
  {
    "headline": "UNICEF: Over 50% of Nigerian Children under Five Unregistered",
    "summarized_story": "United Nations Children’s Fund (UNICEF) has decried low birth registration in the country, stating that more than 50% of the births of children under 5 remain unregistered in Nigeria.\nUNICEF while lamenting that Africa has the lowest birth registration of all the continent, lamented that the births of 166 million children under 5 have never been recorded worldwide.\nA statement on Tuesday by UNICEF said with only 44 per cent of children registered at birth and millions of deaths also go uncounted each year.\nNigeria alone accounts for 11 per cent of unregistered children in West Africa.\nAll of this is in advance of the implementation deadline of the UN Sustainable Development Goals (SDGs), which targets 16.9 calls for governments, by 2030, to provide legal identity for all, including birth registration."
  },
  {
    "headline": "China Court Upholds Canadian’s Death Sentence as Huawei Exec Fights Extradition",
    "summarized_story": "Meng, who has said she is innocent, has been fighting her extradition from under house arrest in Vancouver.\nChina has rejected the suggestion the cases of the Canadians in China are linked to Meng’s case in Canada though China has warned of unspecified consequences unless Meng was released.\nBusinessman Spavor was detained in China days after Meng’s arrest in Vancouver.\nAnother Canadian, former diplomat Michael Kovrig, was also arrested in China days after Meng’s arrest and charged with espionage.\nSince Meng’s arrest, China has sentenced at least three Chinese-born Canadians to death for drugs offences – Fan Wei here in April 2019, and Ye Jianhui and Xu Weihong here in August last year."
  },
  {
    "headline": "Guinea Confirms West Africa’s First Highly Infectious Marburg Virus Case – Arise News",
    "summarized_story": "Health authorities in Guinea have confirmed West Africa’s first case of the Marburg virus, a highly infectious disease that’s in the same family as the virus that causes Ebola.\nMarburg was detected less than two months after Guinea declared an end to an Ebola outbreak that erupted earlier this year.\nThe World Health Organization (WHO) has however said the virus needs to be “stopped in its tracks”.\n“We applaud the alertness and the quick investigative action by Guinea’s health workers.\nThe potential for the Marburg virus to spread far and wide means we need to stop it in its tracks,” said Dr Matshidiso Moeti, World Health Organization (WHO) Regional Director for Africa."
  },
  {
    "headline": "Lionel Messi Agrees to Join PSG on Two-year Deal – Arise News",
    "summarized_story": "Lionel Messi is set to become a PSG player, after agreeing on a two-year contract offer from the Ligue 1 side and is now set to move to the French capital.\nThe Athletic reports that free-agent Messi will be paid a sign-on fee of €25 million and has been presented with a two-year contract with a net salary of €25 million per year; the deal includes an option of a third-year at the same rate.\nReports in Spain overnight suggested Barcelona had made a last-ditch attempt to keep Messi at the Nou Camp.\nChief executive Ferran Reverter was reported by La Porteria to have been in touch with Messi’s camp.\nOn Sunday morning, Messi broke down in tears when he confirmed he was leaving Barcelona after 21 years at his farewell press conference."
  }
]