[
  {
    "headline": "Media not friendly with bandits, terrorists, says NGE",
    "summarized_story": "The Nigerian Guild of Editors on Wednesday dismissed the statement by the National Broadcasting Commission that journalists were best friends of terrorists and bandits.\nThe NGE in a statement by its President, Mustapha Isah; and General Secretary, Iyobosa Uwugiaren, titled, ‘NGE: Media not disposed to giving terrorists exposure,’ said it would never be disposed to giving the bloodthirsty criminals any exposure.\nThe NBC had in the directive cautioned broadcasters against glamorising and giving too many details on the nefarious activities of terrorists and kidnappers during their daily newspaper reviews.\nThe statement added, “We must also not lose ability to see that security, in a democratic nation, is not an end in itself.\n“Its single purpose is to protect the capability of institutions, including the media, to guarantee citizens the free exercise of their fundamental human rights, without discrimination.”The NGE reiterated that there were no security without free media and free expression, and no free expression and free media without security, saying the two terms should come hand-in-hand and not fight each other in the general interest of the nation."
  },
  {
    "headline": "Abuja community gets robbery notice from hoodlums",
    "summarized_story": "There is palpable fear among residents of Mpape Phase 2, a community near the highbrow Maitama District, Abuja, following the receipt of a letter purportedly written by armed robbers notifying them of an impending attack.\nAlthough the proposed date for the attack was not specified, those behind the letter advised residents to keep at least N100,000 or be prepared to face dire consequences.\nBy this letter you are directed to have at least N100,000 ready to make it easy for us or you face dire consequences.\nYours, The Arch.”A community leader, who spoke on condition of anonymity, said copies of the letter littered the streets.\n“Those who didn’t come out at that time also saw the letter when they eventually did."
  },
  {
    "headline": "Amorighoye disassociates himself from purported publication on Ayiri",
    "summarized_story": "Lagos-based businessman Mr. Toju Alex Amorighoye has debunked a report titled “ Olu of Warri: Time for Chief Ayiri Emami to retrace his steps by Toju Amorighoye” published online by newsrainng.com noting that he never wrote such article nor did he authorize anyone to write any opinion on his behalf.\nAmorighoye made this disclosure via a telephone call interview with Vanguard on Tuesday stating that it is criminal and wicked for the news platform to credit this said article to his person and that he is by this interview giving Them 72 hours to refute the said publication credited to him, or produce which Toju Amorighoye aside his person that wrote this publication or they will face the full wrath of the Law.\n“I wish to state unequivocally that as an ethical and well seasoned itsekiri elite, issues bothering on our coveted crown and the state of the Itsekiri kingdom are not to be trivialized by being bantered on pages of newspapers and blogs and social media” he stated."
  },
  {
    "headline": "Lalong condemns destruction of farmlands by criminals",
    "summarized_story": "Gov Simon Lalong of PlateauGovernor Simon Lalong of Plateau has condemned the destruction of farmlands in some communities in the state by criminals, describing it as callous, criminal, inhuman and wicked.\nThe governor criticised the act in a statement by his Director of Press and Public Affairs, Dr Makut Macham, on Wednesday in Jos.\nLalong assured residents that the government is working with the security agencies to do everything within its power to unravel those behind the barbaric act and deal with them accordingly.\nHe instructed security agencies to immediately conduct a thorough investigation of the act, arrest perpetrators and prosecute them.\nThe governor appealed to communities, traditional rulers, youth groups and vigilante groups across the state to be proactive by providing security agencies with requisite intelligence."
  },
  {
    "headline": "AXA Mansard is best health insurance company for 2021",
    "summarized_story": "Health Management Organisation, HMO, AXA Mansard Health Limited, has emerged as the best Health Insurance Company in Nigeria at the just concluded 2021 International Finance Awards.\nAXA Mansard Health has a 24-hour call centre, a team of highly trained and dedicated professionals, service portals at all AXA Mansard Welcome Centres nationwide and has deployed state-of-the-art technology to attain operational excellence while contributing to prompt service delivery and overcoming of challenges being encountered in the Nigerian health insurance industry.\nThe company is positioned as the number one health management organisation in Nigeria providing health-related services to both individuals and corporate bodies.\nAt AXA Mansard Health, we have never been more convinced about this purpose (which we consider a higher calling) than during a period like this with the pandemic ravaging the world.\nAXA Mansard Health Limited is the Health Maintenance Organization (HMO) arm of the AXA Mansard group of companies."
  },
  {
    "headline": "13 die, 12 injured in Lagos-Ibadan expressway accident",
    "summarized_story": "By James Ogunnaike – AbeokutaNo fewer than 13 persons were on Wednesday confirmed dead while 12 others sustained injuries in an accident involving an unregistered Volvo truck and a commercial Mazda bus opposite Wichtech roofing and pipes on the Lagos-Ibadan expressway.\nMr Babatunde Akinbiyi, the Public Relations Officer, Traffic Compliance and Enforcement Corps (TRACE )confirmed the incident to newsmen in Abeokuta .\nHe said the commercial bus was loaded with 25 passengers instead of 18.\nHe noted that 25 people which comprised of nine men, eight women and eight minors were involved in the accident.\nALSO READ: 9 die, 16 injured on Lagos-Ibadan expressway accidentHe stated that 12 people which comprised five men, three women and four minors were injured while 13 persons comprising four male, five female and four minors died in the accident."
  },
  {
    "headline": "NDDC is victim of prebendalism – Tony Osborg",
    "summarized_story": "A foremost Federalist and a PhD Researcher at the University of Port Harcourt, Mr Tony Osborg, has described the Niger Delta Development Commission (NDDC) as a victim of prebendalism.\nOur political structure is so faulty to the extent that it affects everything else, including the performance of good and visionary leaders.\nThis is the situation we have found ourselves in in Nigeria today.\nNigeria is prebendalism and prebendalism is Nigeria.\n“NDDC, just like every other federal institution of Nigeria is simply a victim of prebendalism."
  },
  {
    "headline": "Sunday Igboho: Pastor Adegboye issues stern warning to Buhari govt",
    "summarized_story": "The Senior Pastor of the Worksword of God Church, Olabisi Gabriel Adegboye, has issued a stern warning to the President Muhammadu Buhari government over the attack on Sunday Igboho, a popular Yoruba activist.\nIn a Facebook post on Wednesday, the cleric said he was speaking as a servant of God sent to Nigeria to speak peace and encourage reconciliation.\nAccording to Adegboye, there is no justification strong enough to defend the Nigerian government and its agency, the Department of State Services, DSS, concerning the midnight attack against Igboho.\n“He [Igboho] held rally in Osogbo, Ibadan, Ogun, Ondo and Ado Ekiti without any breaking down of law and no casualty whatsoever at anytime.\n“I’m sent by God to give this piece of advice to avoid escalated crisis in the Country, especially in the South West."
  },
  {
    "headline": "WHO predicts more COVID-19 deaths by the end of 2020 Olympics",
    "summarized_story": "The World Health Organization (WHO) has predicted 100,000 deaths from COVID-19 by the end of the Tokyo Olympics.\nThe Tokyo 2020 Summer Olympics, started today after a delay a year ago due to the Covid-19 pandemic.\nThe number of COVID-19 cases in Japan linked to the Games now stands at 79, NAN reports.\nWorld Health Organization (WHO) Director-General Tedros Adhanom Ghebreyesus advised the public not to disregard that the Covid-19 pandemic is still plaguing the world and an event like this could be a super spreader.\nThe WHO chief stressed that anyone who thinks the Coronavirus pandemic is over is living in a “fool’s paradise.”There has been a surge in COVID-19 cases continue in Japan."
  },
  {
    "headline": "HURIWA lambasts Garba Shehu for attacking Bishop Kukah over report to US Congress",
    "summarized_story": "Human Rights Writers Association of Nigeria, HURIWA, has lambasted Garba Shehu, a Senior Special Assistant to President Muhammadu Buhari on Media and Publicity, over what it described as unbridled tendencies and unwholesome disrespect shown to Roman Catholic Bishop of Sokoto Diocese, Rev.\nHURIWA accused Shehu of having used his words carelessly in the rejoinder he issued against Kukah’s presentation to the American Congress recently.\nAngered by this, Garba Shehu, in a scathing response on behalf of the Presidency, described the cleric’s allegations as false and lambasted the revered Bishop.\nThe Rights group said the Federal character of Nigeria includes the fact that Nigeria is a country with two dominant religions of Christians and Moslems and others such as African traditional worshippers.\n“We totally endorse the presentation made by His Lordship the Bishop of the Catholic diocese of Sokoto for these are facts that are empirical and we are witnesses to the ongoing nepotistic appointments of President Muhammadu Buhari and the consistent killings of Christian clerics by Islamists are facts which the President can’t hide from.”"
  },
  {
    "headline": "Sunday Igboho: How helicopter to bring activist back to Nigeria was stopped",
    "summarized_story": "Mr. Yomi Aliyu (SAN), the lawyer to Yoruba Nation agitator, Sunday Adeyemo, aka Sunday Igboho, has narrated how he was to be flown to Nigeria on a waiting helicopter, after being arrested in Cotonou, Benin Republic.\nHe said: “As at today (Wednesday) Sunday Igboho is still in police detention in Benin Republic, specifically in Cotonou.\n“While they were fighting with the brother, he was bundled back into the plane heading to Germany; he was the one in Germany now, not Igboho.\n“He was already in the plane in Cotonou on his way to Germany with his wife and his brother was there too.\n“He was brought down with the wife and brother and a fracas ensued because he was to be flown to Nigeria by a standby helicopter."
  },
  {
    "headline": "Esu Chikun, Danjuma Barde is dead, El-Rufai, Zailani mourn",
    "summarized_story": "The Paramount ruler of Esu Chikun, in Chikun Local Government Area of Kaduna State, SA Gbaggi, HH Danjuma Barde is dead.\nConfirming the death of Esu Chikun, HH Danjuma Barde, on Wednesday, Kaduna State Governor, Mallam Nasir El-Rufai, said the late monarch was a traditional leader, peacemaker, who promoted peace and embraced the diversity that development and modernity had brought to his chiefdom.\n“Governor El-Rufai stated this in a condolence message to the Chikun Traditional Council and the family of HH Dr. Barde who passed on this morning.\n“Malam El-Rufai said that Kaduna State is grateful for the positive attitude of the late Dr. Barde.\nSimilarly, the Chairman Northern Speakers-cum-Speaker, Kaduna State House of Assembly, Alhaji Yusuf Ibrahim Zailani, has expressed deep sadness over the demise of Barde."
  },
  {
    "headline": "Ex-militants decry exclusion from committee",
    "summarized_story": "By Elo Edremoda, WarriEx-militants of Urhobo/Isoko extraction in the Niger Delta have decried their exclusion from appointment into the Committee on Strategic Communications of the Presidential Amnesty Programme (PAP).\nIn a statement by the group’s Chairman and Vice Chairman, Gen. Figbele Joseph and Gen. Adu Solo, the ex-agitators described their exclusion from the committee as an “injustice”, one they intend to resist.\nThe statement said: “There is no gainsaying that the Urhobo-Isoko ex-agitators are sidelined in the novel committee, hence we will take every necessary move to make sure that this injustice is resisted.\nTherefore, we are calling on relevant authorities to help us call on Col. Dikio to appoint an Urhobo/Isoko ex-agitator into the novel committee for us to have a sense of belonging.\nThe committee was established at the backdrop of a workshop on Strategic Communications, organised for selected ex-agitators earlier in March."
  },
  {
    "headline": "Igboho: Uncertainty as extradition hearing fails to hold",
    "summarized_story": "By Alao AbiodunA Court hearing over the extradition of embattled Yoruba Nation Agitator Sunday Adeyemo aka Sunday Igboho failed to hold on Wednesday at Benin Republic, throwing the process into uncertainty.\nThe Nation reports Igboho was arrested at Cardinal Bernardin International Airport in Cotonou, Benin Republic on Monday night.\nYoruba nation agitators who gathered at the court premises in Cotonou to catch a glimpse of Igboho left disappointed.\nThe source further stated the Extradition Treaty of 1984 between Togo, Nigeria, Ghana and Republic of Benin excludes political fugitives from extradition.\nIt was learnt efforts were ongoing over the extradition process to avoid a diplomatic row between Nigeria and Benin Republic."
  },
  {
    "headline": "My husband embodies grace, says Obi Cubana's wife",
    "summarized_story": "By Ekaete BasseyEbele Iyiegbu, wife of popular business mogul Obi Cubana, has debunked reports her husband’s wealth was acquired through diabolical means.\nBut the mother of four said people should quit hating and begin celebrating the grace upon her husband as juju or crime could never have done all these beautiful things for them.\nShe wrote;“If GRACE is a person, it is Obinna Iyiegbu.\n“Am still trying to figure out what happened last weekend…but all I can see is GRACE!!!\nStop the hate & celebrate God’s grace upon his chosen one."
  },
  {
    "headline": "Haters make me famous, says Iyabo Ojo",
    "summarized_story": "By Ekaete BasseyNollywood actress, Iyabo Ojo has expressed immense gratitude to critics for making her prominent.\nIn an Instagram post, the movie star was full of thanks for those who continuously defame her at every point.\nAccording to Iyabo Ojo, their constant hate has brought her fame.\nADVERTISEMENTShe wrote:“Thank you To all my Haters for Making me famous.\n“I need to do giveaway for my haters, dey don try fa how much make I share oooooo."
  },
  {
    "headline": "IPOB removes Ekpa as Radio Biafra broadcaster for disobeying rules",
    "summarized_story": "The Indigenous Peoples of Biafra (IPOB) said it may not want Mazi Simon Ekpa to continue broadcasting on Radio Biafra, following his inability to abide by the rules laid down by its leader, Mazi Nnamdi Kanu.\nAccording to IPOB in a statement, members have observed with regrets, that Mazi Simon Ekpa whom the IPOB leader Nnamdi Kanu gave an appointment and duty to start broadcasting on Radio Biafra doesn’t want to follow the laid down rules of operation in Radio Biafra.\nThe statement signed by its spokesman, Emma Powerful said: “Our leader Mazi Nnamdi Kanu gave the directive while in detention but Mazi Simon Ekpa has refused to follow the principles.\n“Mazi Simon Ekpa has refused to sign the rules of engagement and code of conduct guiding those broadcasting on Radio Biafra.\nMazi Simon Ekpa is hardworking Biafran whose immense contributions towards the restoration of Biafra are highly appreciated, but for not signing the code of conduct as a broadcaster on Radio Biafra, he may not continue to have the opportunity of broadcating via the platform."
  },
  {
    "headline": "Mother of Bayelsa SSG abducted in Yenagoa",
    "summarized_story": "From Femi Folaranmi, YenagoaMrs Betinah Okunwa Benson, the mother of Secretary to the Bayelsa State Government, Hon Friday Konbowei Benson, has reportedly been kidnapped.\nAccording to reports, the 86-year woman was reported to have been kidnapped by gunmen from her residence at the old Assembly quarters, Azikoro road in Yenagoa, Bayelsa State capital.\nA family source, who confirmed the development, said the family has been thrown into confusion over the sad incident.\nThe Old Assembly quarters which housed members of the state House of Assembly was sold to them after the construction of the new quarters.\nBenson, who was Speaker of the Bayelsa State House of Assembly between 2012 and 2019, had relocated his mother from his village, Korokorosei in the Southern Ijaw in Bayelsa State on Jan 14, 2013, after she was kidnapped by ten gunmen."
  },
  {
    "headline": "Nigerians leverage N50bn NEPC facility to boost non-oil exports",
    "summarized_story": "From Uche Usim, AbujaNigerians are leveraging the recently launched Economic Community of West African States (ECOWAS) Trade Promotion Organizations (TPOs) to draw from the N50 billion Export Expansion Facility Programme (EEFP) aimed at increasing the volume of non-oil trade within the region.\nThe EEFP is expected to significantly raise the volume of non-oil exports in the country, and it’s a spin-off of the zero oil plan developed by Awolowo and approved by the President.\nThe EEFP, in line with the Federal Government’s Economic Sustainability Plan (ESP), is focused on cushioning the effects of the COVID-19 pandemic on non-oil export businesses, thereby safeguarding jobs and creating new ones.\nEarlier last March, the Minister of Industry, Trade and Investment (MITI), Otunba Niyi Adebayo, officially flagged off the EEFP and also launched the first online Grant Management Portal (GMP) for non-oil exports.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Lawyers set to stop Sunday Igboho, wife’s extradition",
    "summarized_story": "Meanwhile, a lawyer based in Texas, United States of America, Leesi Ebenezer Olarewaju, has ruled out the possibility of his repatriation.\nHe said: “Sunday Adeyemo can only be returned back to Nigeria if only he is found to have broken any law in Benin Republic.\nSunday Igboho, as we know, did not break any law in Benin.\n“The Extradition Treaty of 1984 between Togo, Nigeria, Ghana and Republic of Benin excluded political fugitives.\n•Juju has failed, Joe Igbokwe tauntsHowever, Joe Igbokwe, chieftain of the All Progressives Congress (APC), yesterday mocked Igboho."
  },
  {
    "headline": "Forget about winning 2023 elections, Presidency tells PDP",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Presidency has told the main opposition Peoples Democratic Party (PDP) to forget about winning the 2023 general elections because the masses adore President Muhammadu Buhari and would never abandon the All Progressive Congress (APC) in the next poll.\nSenior Special Assistant to President on Media and Publicity, Garba Shehu, who stated this after observing the Eid-kabir prayers in Daura, Katsina State, described Buhari as an obstacle to PDP and other parties nursing the hope of taking over the presidency in the 2023 poll.\nAgain he constitutes a political obstacle they cannot dismantle come 2023.\nWe believe the PDP and other opposition parties are nursing false hopes of taking power comes 2023.\n“The masses will never abandon President Buhari’s leadership and the APC."
  },
  {
    "headline": "Igboho’s Supporters Protest in Ibadan",
    "summarized_story": "*Afenifere condemns arrest of Igboho in Benin Republic, as Yoruba nation agitators throng Cotonou courtBy Kemi OlaitanSupporters of Yoruba activist, Chief Sunday Adeyemo (aka Sunday Igboho) Wednesday took to the streets of Ibadan, the Oyo State capital, to protest his arrest and detention by the Beninise authorities.\nAlso, on Wednesday, Yoruba nation agitators gathered at a court premises in Cotonou, where Igboho was billed to appear for his extradiction hearing, to demand his release.\nThe protesters gathered in front of his house in the Sooka area of Ibadan from where they took to the streets, singing the Yourba Nation anthem and chanting “Igboho Oosa”, “Free Igboho now now”.\nThe protesters also displayed placards such as: “I stand with Chief Sunday Igboho”; “Sunday Igboho is not a criminal”; “Yoruba wake up” and “Sunday Igboho is fighting for our freedom”.\n“It is hoped that government will direct more attention to addressing issues that gave birth to ethnic agitations."
  },
  {
    "headline": "Gunmen Kill 13 in Benue Communities",
    "summarized_story": "By George OkohGunmen on Tuesday attacked Torkula and Udei villages in Guma Local Government Area of Benue State killing 13 persons.\nThe attacks came days after two aid workers were killed by suspected herdsmen in Guma village.\nConfirming the attacks, the Chairman of Guma Local Government Area, Caleb Aba, said 13 persons were killed in the two separate attacks on Udei and Torkula communities.\n“It is true that there was an attack yesterday.\n“At about 10 pm yesterday, there was another attack at Branch Ude where about eight people were killed, totalling about 13 people."
  },
  {
    "headline": "Gunmen Abduct Bayelsa SSG’s 90-year-old Mother",
    "summarized_story": "By Olusegun SamuelUnknown gunmen in military fatigue, suspected to be kidnappers, have again abducted the 90-year-old mother of the Secretary to the Bayelsa State Government, Kombewie Benson.\nAccording to sources, 90-year-old Madam Betinah Benson was abducted about 10pm on Teusdays at her old Assembly Quarters residence, Yenagoa, the state capital.\nThough the family is yet to issue an official statement, sources close to the SSG said that the kidnappers had established contact with the victim’s family.\n“The kidnappers who were dressed in military camouflage stormed the residence and kidnapped the victim to an unknown destination.\n“The Commissioner of Police Bayelsa State Command CP Mike Okoli fsi, and other detectives have visited scene."
  },
  {
    "headline": "NGE Warns NBC against Anti-media Policies, Says Directive on Newspaper Review, a Threat to Free Press",
    "summarized_story": "‘’We hope it is not a ploy by the NBC to ban newspapers review in broadcasting stations.\nBecause, the content of the directive doesn’t specify what kind of conduct would fall within their realm.\nIt is our view that the role of independent, critical and trustworthy journalism has never been more important than now in our country,” the Guild explained.\n‘’Its single purpose is to protect the capability of institutions, including the media, to guarantee citizens the free exercise of their fundamental human rights, without discrimination.\n‘’History has revealed time and again that efforts to increase security through the clampdown of liberty and freedom have threatened both liberty and security.”NGE reiterated that there is no security without free media and free expression, and no free expression and free media without security, saying these two terms should come hand in hand and not fight each other in the general interest of the nation."
  },
  {
    "headline": "Buhari: News of Downed Fighter Jet Devastating, But Relieved Pilot Survived",
    "summarized_story": "The pilot had finished a raid against kidnappers, when he came under intense fire, the Air Force spokesman, Air Commodore Edward Gabkwet, said in a statement on Monday.\n“I was shocked by the devastating news of the air crash but felt much relieved, following the successful ejection by the pilot and his eventual rescue.\nMay the injured pilot recover at the earliest time,” President Buhari was quoted as saying.\nThe Chief of Defence Staff, Gen. Lucky Irabor, had immediately commended the pilot for his bravery.\nSpokesman of the Nigerian Air Force, Air Commodore Edward Gabkwet confirmed the pilot’s testimony."
  },
  {
    "headline": "Sowore’s #RevolutionNow Trial: Buhari’s Regime Continues Undermining Rule Of Law, Clampdown On Free Speech In Nigeria",
    "summarized_story": "WATCH VIDEO: Sowore’s #RevolutionNow Trial: Buhari’s Regime Continues Undermining Rule Of Law, Clampdown On Free Speech In NigeriaVideo of Sowore’s #RevolutionNow Trial: Buhari’s Regime Continues Undermining Rule Of LawYou may also like"
  },
  {
    "headline": "Police: Two abducted Kaduna Baptist school students rescued",
    "summarized_story": "Two of the abducted students of Bethel Baptist High School in Chikun LGA of Kaduna State have been rescued.\nJalige said the students have been taken to a police medical facility where they are currently undergoing medical examination.\nAdvertisementA total of 121 students of Bethel Baptist secondary school in Chikun LGA of Kaduna state were abducted from their hotels by bandits on July 5.\nLast week, the police rescued one of the students inside a forest, while two were rescued today, thereby bringing the number of those rescued to three.\nIsrael Akanji, president of the Nigerian Baptist Convention (NBC), said no ransom will be paid for the release of the abducted students."
  },
  {
    "headline": "Police: Two abducted Kaduna Baptist school students rescued",
    "summarized_story": "Two of the abducted students of Bethel Baptist High School in Chikun LGA of Kaduna State have been rescued.\nJalige said the students have been taken to a police medical facility where they are currently undergoing medical examination.\nAdvertisementA total of 121 students of Bethel Baptist secondary school in Chikun LGA of Kaduna state were abducted from their hotels by bandits on July 5.\nLast week, the police rescued one of the students inside a forest, while two were rescued today, thereby bringing the number of those rescued to three.\nIsrael Akanji, president of the Nigerian Baptist Convention (NBC), said no ransom will be paid for the release of the abducted students."
  },
  {
    "headline": "Death toll in South Africa unrest rises to 276, says minister",
    "summarized_story": "The number of deaths resulting from the violence that erupted in South Africa, following the imprisonment of ex-President Jacob Zuma has now risen to 276.\nAdvertisementTheCable had earlier reported that 72 people have been killed in the violence as of July 13.\nAdvertisementThe violent demonstrations, which started in KwaZulu-Natal, Zuma’s province, spread to Gauteng province with many shops looted, several injured and vehicles left burning on roads.\n“Since the unrest, total of 234 deaths as related to the unrest were reported in KwaZulu-Natal to date.\nDavid Makhura, Gauteng province premier, had accused criminals of hijacking the protest."
  },
  {
    "headline": "Death toll in South Africa unrest rises to 276, says minister",
    "summarized_story": "The number of deaths resulting from the violence that erupted in South Africa, following the imprisonment of ex-President Jacob Zuma has now risen to 276.\nAdvertisementTheCable had earlier reported that 72 people have been killed in the violence as of July 13.\nAdvertisementThe violent demonstrations, which started in KwaZulu-Natal, Zuma’s province, spread to Gauteng province with many shops looted, several injured and vehicles left burning on roads.\n“Since the unrest, total of 234 deaths as related to the unrest were reported in KwaZulu-Natal to date.\nDavid Makhura, Gauteng province premier, had accused criminals of hijacking the protest."
  },
  {
    "headline": "'Subtle threat to free press' -- editors kick against NBC's directive on reportage of insecurity",
    "summarized_story": "The Nigerian Guild of Editors (NGE) has described a recent directive to broadcast stations by the National Broadcasting Commission (NBC) not to report the details of attacks by bandits and insurgents as a “subtle threat to free press”.\nAdvertisementThis is contained in a statement jointly signed by Mustapha Isah, president of NGE, and Iyobosa Uwugiaren, the general secretary, on Wednesday.\nReacting to the directive, the NGE described it a subtle threat to free press, freedom of expression, access to information, and victims’ right to justice, which are essential to public debate and accountability in a democratic space.\nAdvertisementIt explained that there is no security without free media and free expression, and no free expression and free media without security, saying these two terms should come hand in hand and not fight each other in the general interest of the nation.\n“Its single purpose is to protect the capability of institutions, including the media, to guarantee citizens the free exercise of their fundamental human rights, without discrimination."
  },
  {
    "headline": "This app wants to simplify Twitter giveaways, without bank accounts",
    "summarized_story": "Let’s say I wanted to send a surprise ‘happy birthday’ cash gift to a friend; my first thought would be to ask for their bank account number.\nI would do this for people I know very well but also for someone I only know on social media.\n“Like sending money through email addresses using PayPal, Vendly hopes to replicate that using social media handles,” he said.\nLong-term, Vendly will help social media users monetize their social media presence, the CEO said.\nThe message states the amount sent; recipient inputs the bank account where they want the cash to go."
  },
  {
    "headline": "Hundreds of MTN, Vodacom towers damaged in South Africa unrest",
    "summarized_story": "Telecommunications infrastructure owned by several mobile network operators was severely damaged in the rampant looting and destruction of property that rocked South Africa last week.\nThe Independent Communications Authority of South Africa (ICASA) revealed on Tuesday, July 13, that the vandalism included more than 100 mobile network towers in some parts of the country.\nVirtually all network providers operating in South Africa reported disruption to service delivery.\nChildren are evacuated from a burning building in downtown Durban, South Africa.\nJust one of its network towers was vandalised within the Durban area but it did not affect service delivery to consumers."
  },
  {
    "headline": "Senegal to produce rapid Covid tests in tech deal with major biotech companies",
    "summarized_story": "The Pasteur Institute in Senegal will produce rapid antigen tests for diagnosing the coronavirus disease from early 2022 with the help of a new tech transfer agreement.\nAn antigen test is regarded as a suitable ‘first line of defense’ against the coronavirus disease for individuals who have symptoms.\nIt plans to make 2.5 million tests per month in 2022, according to the statement.\nHowever, the rapid antigen test deal involving the Pasteur Institute comes at a time when Senegal is grappling with soaring coronavirus cases.\nAccording to health ministry spokesman Mamadou Ndiaye, the West African nation was seeing an “unprecedented” surge in Covid infections."
  },
  {
    "headline": "The Next Wave: What’s happening in francophone Africa?",
    "summarized_story": "Unique and untappedFrancophone Africa is home to an island country where many African startups register their headquarters.\nBetween 2015 and 2019, startups and SMEs in francophone Africa received $417.9 million, according to Briter Bridges, a research firm.\nGozem, a ride-hailing company which also offers ecommerce services, launched in Gabon, its third francophone country, this year with eyes on Cameroon and Dr Congo.\nFrancophone Africa is dogged by lack of clarity around regulations, language barriers and limited networking opportunities, per Briter Bridges report.\nThese concerns will take some time to quell, so maybe unicorn bells won’t ring in francophone Africa anytime soon."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "After its seed round of $350,000 and $150,000 cheque from Y Combinator as part of the accelerator’s Summer 2020 batch,..."
  },
  {
    "headline": "Google partners Maliyo Games to train 500 African mobile game developers",
    "summarized_story": "Share this article:As Google’s interest in Africa’s tech talent pool deepens, the tech giant has partnered with Nigerian-founded game development studio, Maliyo Games, to open applications for a mobile game developer training program.\nAccording to the founder, this is one of the qualities that attracted Google to the project, aside from the fact that Maliyo Games has published some Africa-themed games on the Google Play Store.\nIn addition to that, Google will also provide support for app store success, which includes successful publishing of content on Google Play Store.\nMaliyo Games’ fitAs is typical of content from many indigenous companies, Maliyo Games studio ensures that its content reflects the African scene.\nIn his opinion, in the past 9 years of running Maliyo Games, opportunities that exist now are thinning out the effects of these challenges."
  },
  {
    "headline": "Nigeria’s Startup Bill, Kenya’s Zoom tax, Zimbabwe’s securities law",
    "summarized_story": "Share this article:Good day,What’s on the menu:Updates on Nigeria’s Startup BillKenya’s Zoom taxZimbabwe’s securities lawThe latest on Nigeria’s Startup BillIn May, we brought you news about a Startup Bill for Nigeria.\nSince the 90s, when the first tech companies were founded, Nigeria’s tech ecosystem has progressed.\nEvents like this have made it important for founders to interact with the government, hence, the Startup Bill.\nShould plans for the bill go as planned, it could unlock a lot of value for Nigeria’s tech ecosystem.\nKenyans to pay VAT for using Zoom<em>Photo Credit: <a href=”https://www.linkedin.com/in/morgan-mbabazi-001a331a/” target=”_blank” rel=”noopener”>Morgan Mbabazi</a> (National Media Group).</em>Starting August 2021, Kenyans will begin paying Value Added Tax (VAT) for using video conferencing platform, Zoom."
  },
  {
    "headline": "How Agritech startup, Releaf, wants to change the face of food processing in Africa",
    "summarized_story": "Share this article:The dominance of Nigeria’s palm oil industry during the 1960s is often repeated when tales of the country’s glory days are told.\nIn 1965, several countries in Africa, Southeast Asia, and Latin America received nearly $2 billion from the World Bank for the oil palm industry.\nIt is in this market that agritech startup, Releaf, is looking to make its mark.\nWhile doing this, the founders realised that food factories could not get enough high-quality raw materials to operate their factories at maximum capacity.\nWith the help of Kraken, Releaf is gunning for a portion of the global $61 billion palm oil market."
  },
  {
    "headline": "Short-term borrowing costs for banks still rising",
    "summarized_story": "The costs of short-term borrowing among Nigerian banks have risen sharply in the interbank market this year following the liquidity management strategies of the Central Bank of Nigeria (CBN).\nOne of the implications of CRR debit, according to FBNQuest, is pressure on banks liquidity ratios as well as an uptick in funding cost of banks, especially the smaller tier 2 banks.\nThis, they said, signalled that it was putting floor under interest rates.\nAni and Czartoryski said the Special Bills helped boost banks’ liquidity ratios.\nAnd then, the CBN’s actions last December were a prelude to enabling market interest rates to climb quite quickly in the first half of this year."
  },
  {
    "headline": "NAF: One force, too many crashes",
    "summarized_story": "The Nigerian Air Force (NAF) is saddled with the responsibility of ensuring the integrity of the airspace by gaining and maintaining control of the air while retaining a credible capacity to fulfil other airpower tasks demanded by national defence and security imperatives.\nIt therefore becomes worrisome when a key security arm of the country is…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigeria’s high inflation threatens to worsen already low savings rate",
    "summarized_story": "Nigeria’s high inflation problem has a corrosive impact on savings and is complicating the government’s efforts to give fragile economy a much-needed boost.\nInflation rate has declined for three consecutive months, but Nigerians are unable to heave a sigh of relief, not when prices are still rising at a rate of 17 percent, with supply…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Mischief makers pass off 2015 A’Ibom PDP Pry election video as Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe desperation of detractors of Edo State Governor, Mr. Godwin Obaseki, is manifest, yet again, with the circulation of an old video of a primary election in Akwa Ibom State and mischievously captioning and passing it off as an altercation involving the governor.\nIt must be stated that the intent of the purveyors of the video is patently malicious as it is obvious that the man who is wrongly identified as Governor Obaseki in the said video bears no resemblance with the governor.\nFindings have revealed that the video captured two prominent members of the Peoples Democratic Party (PDP) in a hot exchange at the Godswill Akpabio Stadium during the PDP Primary Election in 2015.\nThis development once again points to the grave consequences of fake news and alternative facts, which mischief makers exploit to cause misinformation and public apathy.\nOsaigbovo IyohaChief of Staff to Edo State Governor..."
  },
  {
    "headline": "2023: APC to pick consensus presidential candidate – Scribe – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The All Progressives Congress (APC) has said that at the appropriate time it will come up with a consensus and agreeable presidential candidate that will fly its flag in 2023.\nSen. John Akpanudoehede, National Secretary, APC Caretaker and Extra-ordinary Convention Planning Committee (CECPC), stated this in a statement issued on Tuesday in Abuja.\nThe statement was in reaction to the Peoples Democratic Party (PDP) recent allegation that President Muhammadu Buhari had a self-succession plan.\nThe APC scribe, however, stressed that the party would not allow individual ambitions to derail the Buhari administration, ahead of the 2023 presidential poll.\nHe said unlike the opposition PDP, the APC was a disciplined party, noting that the former was just been haunted by its past."
  },
  {
    "headline": "Unveil blueprint on true federalism implementation, Onochie charges FG – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – An elder statesman, Dr Nnamdi Onochie, has again told the Federal Government to come up with a blueprint on true federalism, to address worrisome fault lines keeping Nigeria divided.\nSpeaking with newsmen in Abuja on Wednesday, Onochie lamented that Nigeria would continue to wallow in problems until political leaders mustered courage to address endemic problems holding the country down.\nFormer colonial masters, Britain amalgamated Nigeria in 1914, to give birth to Africa’s largest nation but 107 years down the line, the country has been engulfed in various problems, making the country not to realize its potential to the fullest.\nAccording to Onochie, the way out is for the government to implement true federalism as an article of faith to ensure equity, fair play, justice and equality of all ethnic nationalities in the country.\nHe reiterated that recurring problems in the country had highlighted the inevitability of genuine federalism to be implemented by government, to make Nigeria truly great to achieve the set goals of its founding fathers."
  },
  {
    "headline": "Staff audit: Oyo Govt. uncovers 41 ghost workers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestIbadan – The Oyo State Government says it has uncovered 41 employees classified as “No Show”, a euphemism for ghost workers.\nAccording to the statement, the Implementation Committee of the Oyo State 2019/2020 Civil/Public Servants Audit and Payroll Re-engineering/Validation Exercise confirmed the ghost workers.\nThe consultants also indicted 602 officers and recommended them for removal from the payrolls but the Implementation Committee affirmed 41 ghost workers.\nThe Implementation Committee, however, recommended that the government should accept the retirement of the 341 officers following the discovery of irregular records of service in their files.\nThe affected officers, the committee recommended, are to be helped to port into the pension payroll not later than two months after their respective notices of retirement."
  },
  {
    "headline": "Netflix turns to games as streaming growth slows",
    "summarized_story": "Netflix is facing a formidable challenge as it expands into video games to keep the attention of customers in the increasingly competitive world of streaming television.\n– Game gauntlet –Netflix said games will be included in members’ Netflix subscription at no additional cost, augmenting shows and films.\n“The business graveyard is littered with the corpses of content companies that have failed at making mobile games, with Disney the most prominent failure.”ADVERTISEMENTEven video game industry veterans have missed the mark with mobile games.\n“Whether Netflix can change the script seems primarily driven by cultural differences between those Hollywood and video gaming studios.”Competition in the mobile game industry is intense.\nNetflix’s push into video games plays to its strengths of storytelling and content creation, and is intended to help the core subscription service grow, according to executives."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "FG to increase trade export with N50bn funding",
    "summarized_story": "The N50 billion funding, according to NEPC executive director, Segun Awolowo, follows the official launch of the Economic Community of West African States (ECOWAS) Trade Promotion Organisation (TPO) network on July 15, 2021.\nAwolowo said the programme is geared towards increasing the volume of trade within the ECOWAS region with Nigeria poised to boost its non-oil exports.\nThe EEFP, inaugurated by Niyi Adebayo, minister of industry, trade and investment, in March 2021, is part of Nigeria’s economic sustainability plan (ESP).\nIt is focused on cushioning the effects of the COVID-19 pandemic on non-oil export businesses, thereby safeguarding jobs and creating new ones.\nAt the launch of the TPO network, Osinbajo said there is a need to drive more inclusive trade initiatives and expand intra-regional trade in the ECOWAS sub-region with the opportunities presented by the African Continental Free Trade Area (AfCFTA) agreement."
  },
  {
    "headline": "World Bank raises $157bn COVID-19 relief in 15 months",
    "summarized_story": "The World Bank Group says it has provided over $157bn in 15 months as financing relief to help developing countries survive the impacts of the COVID-19 pandemic.\nThe global financial institution made the disclosure in a press statement titled ‘World Bank Group’s $157bn pandemic surge is largest crisis response in its history’ which published on its website.\nThe statement said, “In response to COVID-19 severely damaging the lives and livelihoods of millions of people in developing countries, the World Bank Group deployed over $157bn to fight the pandemic’s health, economic, and social impacts over the last 15 months (April 1, 2020 – June 30, 2021).\n“This is the largest crisis response of any such period in the bank group’s history and represents an increase of more than 60 per cent over the 15-month period prior to the pandemic.\n“Bank group commitments and mobilisations in fiscal year 2021 (FY21) alone (July 1, 2020 – June 30, 2021) amounted to almost $110bn (or $84bn excluding mobilisation, short-term financing, and recipient-executed trust funds)."
  },
  {
    "headline": "C & I Leasing lists N10bn bond on NGX",
    "summarized_story": "Adebayo ObajemuC & I Leasing has listed on the Nigerian Exchange (NGX) N10 billion seven years 15.5 per cent Senior Secured Fixed Rate Bonds due in 2028 under its N20 billion bond issuance programme.\nA total of 10 million units of the bond were listed at par value of N1,000.\nThe maturity date for the seven-year bond, which was issued on June 3, 2021 is June 3, 2028"
  },
  {
    "headline": "CBN schedules MPC meeting for July 26",
    "summarized_story": "Adebayo ObajemuThe Central Bank of Nigeria in a circular on its official website has announced that the 280th meeting of the Monetary Policy Committee (MPC) is scheduled to hold on Monday, July 26 and Tuesday, July 27, 2021.\nThe Apex bank in the last meeting retained the MPR at 11.5% and other parameters were also retained.\nLiquidity ratio was retained at 30 percent and cash reserve ratio (CRR) at 27.5 percent.\nThe committee had earlier in September 2020 agreed to reduce the benchmark interest rate to 11.5 percent from 12.5 percent.\nThe outcome of the scheduled MPC meeting next week would greatly determine the direction of our economy."
  },
  {
    "headline": "Nnamdi Kanu sacks Radio Biafra broadcaster, Ekpa",
    "summarized_story": "Leader of Indigenous People of Biafra (IPOB) Mazi Nnamdi Kanu has relieved Mazi Simon Ekpa of his appointment as Biafra radio broadcaster over failure to follow laid down rules of operation.\nThe statement reads in part: “The global family of the Indigenous People of Biafra (IPOB) ably led by our great leader Mazi Nnamdi Kanu has observed with regrets, that Mazi Simon Ekpa whom our leader Mazi Nnamdi Kanu gave an appointment and duty to start broadcasting on Radio Biafra doesn’t want to follow the laid down rules of operation in Radio Biafra.\n“Our leader Mazi Nnamdi Kanu gave the directive while in detention but Mazi Simon Ekpa has refused to follow the principles.\n“Mazi Simon Ekpa has refused to sign the rules of engagement and code of conduct guiding those broadcasting on Radio Biafra.\n“Mazi Simon Ekpa is hardworking Biafran whose immense contributions towards the restoration of Biafra are highly appreciated, but for not signing the code of conduct as a broadcaster on Radio Biafra, he may not continue to have the opportunity of broadcasting via the platform."
  },
  {
    "headline": "Nnamdi Kanu sacks Radio Biafra broadcaster, Ekpa",
    "summarized_story": "Leader of Indigenous People of Biafra (IPOB) Mazi Nnamdi Kanu has relieved Mazi Simon Ekpa of his appointment as Biafra radio broadcaster over failure to follow laid down rules of operation.\nThe statement reads in part: “The global family of the Indigenous People of Biafra (IPOB) ably led by our great leader Mazi Nnamdi Kanu has observed with regrets, that Mazi Simon Ekpa whom our leader Mazi Nnamdi Kanu gave an appointment and duty to start broadcasting on Radio Biafra doesn’t want to follow the laid down rules of operation in Radio Biafra.\n“Our leader Mazi Nnamdi Kanu gave the directive while in detention but Mazi Simon Ekpa has refused to follow the principles.\n“Mazi Simon Ekpa has refused to sign the rules of engagement and code of conduct guiding those broadcasting on Radio Biafra.\n“Mazi Simon Ekpa is hardworking Biafran whose immense contributions towards the restoration of Biafra are highly appreciated, but for not signing the code of conduct as a broadcaster on Radio Biafra, he may not continue to have the opportunity of broadcasting via the platform."
  },
  {
    "headline": "Alleged fraud: Court restores freezing orders on Diezani’s ally, Omokore’s assets, funds in FCMB",
    "summarized_story": "The Court of Appeal in Abuja has restored the orders obtained by the Economic and Financial Crimes Commission (EFCC) for freezing of accounts and interim forfeiture of assets owned by an ally of former Petroleum Minister, Diezani Alison-Madueke, Jide Omokore.\nIn his judgment on September 10, 2020 in the suit marked: FHC/ABJ/CS/946/2020, Justice Mohammed agreed with the lawyer to Omokore and his firm, Ojukwu Chikaosolu the property and funds were wrongly confiscated.\nJustice Ige held that the suit was wrongly constituted, thereby denying the trial court the jurisdiction to entertain it.\nA court cannot adjudicate on an incompetent action or an action commenced in violation of the law or the Constitution.\nThose being tried with Oronsaye in the charge marked: FHC/ABJ/CR/297/2015 are Osarenkhoe Afe, Frederick Hamilton Global Services Limited, Cluster Logistics Limited, Kangolo Dynamic Cleaning Limited and Drew Investment & Construction Company Limited."
  },
  {
    "headline": "Alleged fraud: Court restores freezing orders on Diezani’s ally, Omokore’s assets, funds in FCMB",
    "summarized_story": "The Court of Appeal in Abuja has restored the orders obtained by the Economic and Financial Crimes Commission (EFCC) for freezing of accounts and interim forfeiture of assets owned by an ally of former Petroleum Minister, Diezani Alison-Madueke, Jide Omokore.\nIn his judgment on September 10, 2020 in the suit marked: FHC/ABJ/CS/946/2020, Justice Mohammed agreed with the lawyer to Omokore and his firm, Ojukwu Chikaosolu the property and funds were wrongly confiscated.\nJustice Ige held that the suit was wrongly constituted, thereby denying the trial court the jurisdiction to entertain it.\nA court cannot adjudicate on an incompetent action or an action commenced in violation of the law or the Constitution.\nThose being tried with Oronsaye in the charge marked: FHC/ABJ/CR/297/2015 are Osarenkhoe Afe, Frederick Hamilton Global Services Limited, Cluster Logistics Limited, Kangolo Dynamic Cleaning Limited and Drew Investment & Construction Company Limited."
  },
  {
    "headline": "Faces of Indianapolis shooter Brandon Scott Hole",
    "summarized_story": "By AbankulaPolice authorities in Indianapolis on Friday released the photo of Brandon Scott Hole, the 19-year-old former FedEx worker, who killed eight people Thursday night.\nThe release of his photo corrected false images of the shooter earlier published in the social media.\nHole went on a shooting spree at the FedEx facility before turning the gun on himself.\nAccording to reports, he last worked for FedEx in 2020.\nCops still don’t know his motive and where he got the rifle he used."
  },
  {
    "headline": "Breaking: Gunmen kidnap Ekiti monarch David Oyewumi",
    "summarized_story": "By Ariwodola Idowu/Ado EkitiAn Ekiti monarch, Oba David Oyewumi, the Obadu of Ilemeso in Oye Local Government Area (LGA) of the state, has been kidnapped by gunmen, the police said.\n“Yes, the incident happened yesterday, (Thursday night) at the Oba’s palace.\nThey said the incident happened at about 8.30 p.m. on Thursday night when the chiefs who visited the place had left.\nIlemeso is a neighbouring town to Isan Ekiti, country home of Gov.\nOba Adetutu Ajayi, the Elewu of Ewu Ekiti, narrowly escaped kidnap at Isan Ekiti, last week on the Ewu-Ayetoro road."
  },
  {
    "headline": "Yoruba Nation Agitators Storm Cotonou Supreme Court, Demand Igboho’s Release",
    "summarized_story": "Some Yoruba nation activists in Cotonou, Benin Republic, staged a peaceful protest outside the Supreme Court, where it is expected that Yoruba activist Sunday Adeyemo (Igboho) will be extradited.\nThe demonstrators can be seen chanting sympathy songs and demanding the Igboho’s quick release in the video.\nIgboho was apprehended by security officers in the Benin Republic on Monday evening, according to NEWS DIRECT.\nIgboho was apprehended late Monday night after fleeing Nigeria to avoid being apprehended by the country’s secret police.\nAccording to a person familiar with his departure from Nigeria, he had finalised arrangements to flee Nigeria via Cotonou and was on his way to Germany."
  },
  {
    "headline": "In UNIBEN, Graduate Under Probe For Exam Malpractice",
    "summarized_story": "Benedicta Adeola Ehanire, a spokesman for the University of Benin, said there has been no report from the panel set up to investigate a 400-level student, Peace Ufuoma, who is being investigated for alleged exam cheating.\nOn Wednesday, it was reported that the student had been asked to rewrite all of her papers from level two to level four.\nAccording to the article, the school administration believes Peace Ufuoma should be used as a scapegoat to teach all students at the University of Benin that examination malpractice is not tolerated.\nShe said, “The current report online is fake.\nA video of the young lady, Peace Ufuoma, wearing a blouse that read “aggressive malpractice brought me this far” went popular on social media."
  },
  {
    "headline": "Benue: Traditional Ruler Killed, Over 50 Houses Burnt In A Community",
    "summarized_story": "Chief Okpe Denis Ijoko, the traditional ruler of the Ochoro community, was reportedly killed by gunmen during an attack in Benue State’s Oju Local Government Area.\nDuring the incident, approximately 50 houses were apparently burned down and other important properties were reportedly damaged in a neighboring town, Ukpute.\nIn a talk with Daily Post, an indigene of the local government and senior lecturer at Benue State University, Dr John Ogi, verified the attack.\n“Ochoro community wasn’t at war with any community.\nThe Benue State Police Command, Public Relations Officer, Anene Sewuese Catherine, said she was yet to receive the report."
  },
  {
    "headline": "FG’s Attempt To Criminalise Igboho’s Case Undemocratic, Capable Of Turning Govt To Tyranny Of The Majority – Gani Adams",
    "summarized_story": "Aareonakakanfo of Yorubaland, Iba Gani Abiodun Ige Adams, has condemned in strong terms, the arrest on Monday of Yoruba nation activist, Chief Sunday Adeyemo, popularly known as Sunday Igboho in Cotonou, Republic of Benin.\n“I feel bad when the news of his arrest broke out on Monday evening and I started monitoring unfolding events.\nBut I think the FG should be fair to the young man because any attempt to trivialize issues of agitations might set this nation on fire.\nSo, the FG will be making a big mistake if it decides to treat agitators of Yoruba nation as common criminals or enemies.\nHe deserves his liberty under the law, that is why the Federal Government must handle his case with alot of care."
  },
  {
    "headline": "Revealed! Face of angry Nigerian who lashed FG, threatened Super Falcons in Austria (VIDEO)",
    "summarized_story": "The face of a Nigerian who boarded same train with Super Falcons in Vienna, Austria has been revealed.\nThough his name is yet to be ascertained, this young man who claimed to have played for a privately-owned club Julius Berger in Nigeria rained all manner of abuses on Muhammadu Buhari-led federal government and the country’s senior national women team Super Falcons.\nPlease listen to this video clip."
  },
  {
    "headline": "Igboho’s arrest: Don’t grant extradition order to FG, counsel tells Benin Republic",
    "summarized_story": "There are concerns over the arrest of popular Yoruba activist, Mr. Sunday Igboho at an airport in Cotonou, Benin Republic Monday night while attempting to flee to Germany.\nThe Cotonou arrestBut with his arrest, prominent Yoruba leaders and Afenifere, the Yoruba socio-cultural group, have cautioned the federal government on the handling of the situation.\nIgboho, Blueprint gathered from multiple sources, Tuesday, was in possession of a Benin Republic passport at the time of his arrest.\n“The Extradition Treaty of 1984 between Togo Nigeria, Ghana and Republic of Benin excluded political fugitives.\n“This made Chief Sunday Adeyemo a POLITICAL OFFENDER who cannot be deported and/or extradited by the good people of the Republic of Benin for any reason."
  },
  {
    "headline": "I feel strongly about NYSC, Gowon’s policy – Buhari",
    "summarized_story": "He spoke when he received in audience corps members serving in his Daura country home in Katsina state, who paid him Sallah homage.\nPresident Buhari urged the youth corps members to make the most of the opportunity of travelling around the country, especially in understanding different climates, cultures, languages and views on life.\nPresident Buhari said the NYSC scheme was well thought-out to unite the country through understanding.\n“I feel very strongly about the NYSC and I am wishing you all the very best.\nPresident Buhari gave the corps members two cows from his farm, 20 bags of rice and N1, 000,000 (one million naira)."
  },
  {
    "headline": "Action Alliance urges FG to improve on security, economy, power -NigPilot",
    "summarized_story": "Action Alliance, AA, has urged the federal government to tackle insecurity, improve the economy and power so as to move the country forward.\n“Inflation has done beyond an acceptable level, the current administration should direct efforts towards ensuring a vibrant economy.\nWe urge the current government to find solutions to Nigeria’s power supply challenges,” he said.\nOn the Independent National Electoral Commission INEC, Omo-Aje commended its Chairman, Prof. Mahmood Yakubu for the electoral reforms initiated.\nBy doing so, they give the electorate more reasons to have confidence in the electoral system,” Omo-Aje said."
  },
  {
    "headline": "Action Alliance urges FG to improve on security, economy, power -NigPilot",
    "summarized_story": "Action Alliance, AA, has urged the federal government to tackle insecurity, improve the economy and power so as to move the country forward.\n“Inflation has done beyond an acceptable level, the current administration should direct efforts towards ensuring a vibrant economy.\nWe urge the current government to find solutions to Nigeria’s power supply challenges,” he said.\nOn the Independent National Electoral Commission INEC, Omo-Aje commended its Chairman, Prof. Mahmood Yakubu for the electoral reforms initiated.\nBy doing so, they give the electorate more reasons to have confidence in the electoral system,” Omo-Aje said."
  },
  {
    "headline": "Lawyers lament non-payment of judgment debts by FG -NigPilot",
    "summarized_story": "Attorneys involved in several litigations won against the federal government agencies over the years have cried out for payment of judgment debts incurred by the government.\nIn a statement issued by the Director of Legal Services, Centre for Civic Education , Barrister Agomuo Chimaobi on behalf of the lawyers, said the unpaid judgment debts are affecting them economically having used their personal resources to prosecute some of the cases on behalf of their clients.\nThe debts, according to them, are incurred by the federal government from judicial pronouncements to that effect from the High Courts to Appeal and Supreme Courts.\n“The debts are judgments which emanated from the Federal High court of Nigeria.\nThe Court of Appeal of Nigeria and the Supreme Court of Nigeria“These judgment debts are compiled at the office of the Honourable Attorney General of the Federation and the Minister of Justice."
  },
  {
    "headline": "Lawyers lament non-payment of judgment debts by FG -NigPilot",
    "summarized_story": "Attorneys involved in several litigations won against the federal government agencies over the years have cried out for payment of judgment debts incurred by the government.\nIn a statement issued by the Director of Legal Services, Centre for Civic Education , Barrister Agomuo Chimaobi on behalf of the lawyers, said the unpaid judgment debts are affecting them economically having used their personal resources to prosecute some of the cases on behalf of their clients.\nThe debts, according to them, are incurred by the federal government from judicial pronouncements to that effect from the High Courts to Appeal and Supreme Courts.\n“The debts are judgments which emanated from the Federal High court of Nigeria.\nThe Court of Appeal of Nigeria and the Supreme Court of Nigeria“These judgment debts are compiled at the office of the Honourable Attorney General of the Federation and the Minister of Justice."
  },
  {
    "headline": "2023: Buhari may be plotting self-succession -NigPilot",
    "summarized_story": "… Challenges Presidency to come out cleanOpposition Peoples Democratic Party, PDP , on Tuesday said the assertion by the Buhari Presidency that Nigerians will be waiting for President Muhammadu Buhari “to show the way in 2023” has further heightened public apprehensions of self-succession plot by the cabal in the Presidency.\nReacting to comments by Buhari’s aide, the PDP Spokesman, Kola Ologbondiyan said Nigerians were jolted when President Buhari’s spokesman, Shehu Garba, publicly announced in Daura, Mr. President’s hometown, that President Buhari “constitutes a political obstacle” which those who seek to succeed him, come 2023 “cannot dismantle”.\n“Shehu Garba should be bold enough to announce that President Buhari will be on the ballot for another term in 2023 and watch how Nigerians will respond.\n“The 1999 Constitution (as amended) is clear on the tenure of office of the President and such cannot be extended under any guise or conditions whatsoever.\n“It is imperative for Shehu Garba to note that Nigerians have been subjected to the worst forms of hardship under the Buhari-led All Progressives Congress (APC) administration and will never allow anything that will keep this administration in office a day beyond May 29, 2023.”"
  },
  {
    "headline": "BREAKING: Police Rescue Two Abducted Bethel Baptist School Students",
    "summarized_story": "Two of the abducted students of Bethel Baptist Secondary school in Chikun Local Government Area of Kaduna State have been rescued by police operatives.\nWhen contacted, the spokesman of the Kaduna state police command, Mohammed Jalige, told Channels Television that the two abducted students were have been taken to a police medical facility where they are currently undergoing medical examination.\n121 students of Bethel Baptist secondary school in Chikun local government area of Kaduna state were abducted from their hotels by bandits on July 8.\nLast week, the police rescued one of the students inside a forest, while two were rescued today, thereby bringing the number of those rescued to three.\nMeanwhile, the bandits are demanding the sum of N60m as a ransom for the release of the kidnapped students."
  },
  {
    "headline": "Gunmen Kidnap Bayelsa SSG’s Mother",
    "summarized_story": "Gunmen dressed in military camouflage have stormed the residence of Betinah Benson and kidnapped her to an unknown destination.\nThe victim, aged 80, is the mother of Kombowei Benson, Secretary to the Bayelsa State government.\nThe attack was carried out on Tuesday night in Yenagoa, Bayelsa State capital.\nConfirming the incident, Bayelsa State Police Command in a statement signed by the spokesperson, Asinim Butswat said some of the suspects have been arrested.\nThe statement added that the Commissioner of Police Bayelsa State Command, Mike Okoli, and other detectives have visited the scene and investigation is in progress."
  },
  {
    "headline": "100 Kidnapped Victims Rescued In Zamfara After 42 Days In Captivity",
    "summarized_story": "The police command in Zamfara State says security operatives have rescued 100 abducted persons from bandits at Kabaro forest.\nThe victims, mostly women, and children were kidnapped on June 8 by bandits and taken to Kabaro village in Maru Local Government Area of the state.\n﻿He added that all the victims were from Manawa village of Maru Local Government Area of the state.\n“It could be recalled that on 8th June 2021, some recalcitrant bandits stormed Manawa village, and abducted 100 villagers, including nursing mothers, males, and children.\nThe Commissioner of Police, Hussaini Rabiu, warned the recalcitrant bandits to renounce criminalities and embrace peace or face the full wrath of the law."
  },
  {
    "headline": "My Client Is Being Tortured In Cotonou, Igboho’s Lead Counsel Cries Out",
    "summarized_story": "Igboho was arrested on Monday by the security forces at an airport in Cotonou while trying to flee to Germany.\nThere were speculations that Igboho had been released by security operatives in the neighbouring West African nation, however, the counsel said his client was still in custody.\n“But it is not likely that the extradition order being sought for would sail through.\n“Like I said in a press release earlier today, even his arrest by security operatives was against the political nature of his offense.\nAfunanya said when the security operatives approached the house, they were attacked by nine of Igboho’s boys who engaged them in a gun duel but were subsequently overpowered."
  },
  {
    "headline": "Social Intervention: No Govt Has Done As Much As Much As Buhari – APC’s Aliyu",
    "summarized_story": "﻿A Chieftain of the All Progressives Congress (APC) Farouq Aliyu, has lauded President Muhammadu Buhari’s efforts in nation building.\n“No government in this country has done social intervention programmes as much as President Muhammadu Buhari,” said Aliyu, who was a guest on Channels TV’s Politics Today on Wednesday.\nThe APC chieftain said this while speaking of the APC’s chances at the 2023 presidential race.\n“But in our party, we have the President,” Aliyu said, adding: “the PDP cannot boast of having a leadership as good as that of President Buhari.\nThe President had hinged his election campaign on three main promises of bolstered security, improved economy and the fight against corruption, all of which Aliyu believes he has done a good job with."
  },
  {
    "headline": "Lagos police raid black spots, arrest 103 hoodlums, recover dangerous weapons, drugs",
    "summarized_story": "The Lagos State police Command have raided several black spots, namely Oshodi Oke and Oshodi Under Bridge, where one hundred and three hoodlums with dangerous weapons were arrested.\nThe Commander Taskforce and his team acting on the strength of the Commissioner of Police’s instruction conducted a raid in the Oshodi area of Lagos State, arresting suspects and recovering drugs and weeds suspected to be Indian hemp as well as dangerous weapons.\nThe suspect, who was apprehended with a toy gun, admitted to the crime.\nAdvertisementAs a result, the Commissioner of Police has ordered that the hoodlums be tried in court, as the command anticipates further operations on such hotspots around the state.\nOther tactical Commanders were also charged by CP Hakeem Odumosu to go after hoodlums and miscreants in the state in order to rid the state of crime and criminality."
  },
  {
    "headline": "Police arrest two gang members involved in snatching motorcycles in Delta state",
    "summarized_story": "Police in Delta state have arrested a young man and a middle-aged woman who specialise in stealing motorcycles in Oghara, Ethiope West local government.\nAccording to police, two unregistered motorcycles, a Nissan Primera car, and a generator set were also recovered, a manhunt for other gang members is ongoing.\nIn addition, the police are looking for three suspects: a tricycle rider and two occupants who ran after abandoning their vehicle and fleeing into the bush when they saw security operatives.\nAdvertisementThe police officers later found a locally made cut -to -size single barrel gun, one battle axe, a mobile phone and twenty wraps of weeds suspected to be Indian hemp and other hard drugs on the vehicle."
  },
  {
    "headline": "Gunmen abduct Mother of Bayelsa SSG in Yenagoa, Bayelsa",
    "summarized_story": "Gunmen dressed in military camouflage have abducted the mother of Kombowei Benson, Secretary to the Bayelsa State government.\nReports say the gunmen stormed the residence of 80 year old Betinah Benson and kidnapped her to an unknown destination.\nThe attack was carried out on Tuesday night in Yenagoa, Bayelsa State capital.\nBayelsa State Police Command has confirmed the incident in a statement signed by the spokesperson, Asinim Butswat.\nHe said some of the suspects have been arrested and a manhunt has been launched for the rescue of the victims."
  },
  {
    "headline": "Reactions Have Trailed a Social Media Post By Special Adviser to President Buhari, Femi Adeshina",
    "summarized_story": "According to the youth they want jobs and not bags of rice.\nLet’s take a look.\nLet’s take our final story in Asia, where Young North Koreans have been warned they must follow traditional lifestyles and adhere to the country’s dialect.\nThe secluded state’s official newspaper made the demand in a column as Pyongyang tries to eradicate cultural influences from South Korea.\n[OOV]This influences include language, clothing, hairstyles, music preferences and dancing styles."
  },
  {
    "headline": "MVP Giannis Antetokounmpo’s 50 Points Leads Bucks to First NBA Title in 50 Years",
    "summarized_story": "Giannis Antetokounmpo had the Larry O’Brien Trophy in one arm, the NBA Finals MVP trophy in the other and there was a cigar on the table in front of him.\nAntetokounmpo finished with 35.2 points, 13.2 rebounds and 5.0 assists per game while shooting 61.8%, the first player in finals history to reach those numbers.\nChris Paul scored 26 points to end his first NBA Finals appearance in his 16th season.\nThe Bucks traded for Jrue Holiday before this season and even though they weren’t quite as strong in the regular season, they were finally NBA Finals ready.\n… Milwaukee’s only other NBA Finals appearance was a loss in 1974."
  },
  {
    "headline": "WHO Chief Backs Tokyo Olympics Days Before Opening Ceremony",
    "summarized_story": "Tedros Adhanom Ghebreyesus, the head of the World Health Organization (WHO), has thrown his weight behind the pandemic-delayed Tokyo Olympics, even as a surge in the Delta variant drives a resurgence of COVID-19 around the world and the event faces continued opposition just days before the opening ceremony.\nBut rising cases around the world and in Japan, have undermined public confidence, increasing opposition to the event going ahead.\nTokyo recorded 1,387 new cases on Tuesday, bringing its total since the pandemic started to more than 840,000 cases.\nThe WHO chief said the ” mark of success” was not zero cases but that cases were identified, isolated, traced and cared for.\nSome 79 cases have been reported in connection with the event so far, according to official figures, with the opening ceremony due to take place on Friday."
  },
  {
    "headline": "Covid: Anger as Half of Australians in Lockdown Again",
    "summarized_story": "More than 13 million Australians – about half the population – are in lockdown after a third state imposed restrictions to curb a Delta outbreak.\nSouth Australia, home to 1.7 million people, joined Victoria and parts of New South Wales in lockdown on Tuesday.\nAnger in Australia is growing over the lockdown strategy, with the two biggest cities Sydney and Melbourne facing uncertainty over when they will open.\nDespite entering lockdown late last month, Sydney reported 110 new cases on Wednesday, taking its current outbreak to more than 1,300 cases.\nMany Australians have compared their situation to re-openings happening in the UK and the US, placing pressure on the federal government."
  },
  {
    "headline": "France Rolls out Covid Health Pass as Cases Soar",
    "summarized_story": "A new Covid health pass has come into effect in France amid a surge of new infections.\nFrom Wednesday, people need proof of vaccination, a negative test or recent recovery from Covid to enter most museums and cinemas.\nThis was compared to fewer than 7,000 cases a day last week, a surge of 150%, as the highly contagious Delta variant spreads throughout the country.\nPresident Emmanuel Macron announced the plans for a health pass earlier this month, as well as compulsory vaccination for all health workers by September.\nThis so-called Health Pass is the government’s answer to infection rates that are rising faster than France has ever seen in this pandemic."
  }
]