[
  {
    "headline": "We’ll forward amended Electoral Act bill to Buhari this week – Lawan",
    "summarized_story": "“I remain convinced that the proposal for direct primary elections is valuable for building accountability in our political system.\nBuhari had vetoed the electoral bill over the restriction of political parties to direct primary, insisting on the direct, indirect and consensus options.\nGbajabiamila, in his opening address, restated the benefits of restricting political parties to direct primary while criticising the parties for lacking comprehensive membership registers.\nThe process by which political parties nominate candidates for election is essential, perhaps even just as important as the general election itself.\nYakubu bared his mind in Abuja during the first quarterly meeting of INEC with political parties in 2022."
  },
  {
    "headline": "IPOB’s sit-at-home grounds South-East, Kanu’s trial holds today",
    "summarized_story": "The youths, chanting Biafra songs, were seen making bonfires on major roads and streets of Onitsha and discussing sundry issues.\nSchools in Owerri were shut on Tuesday in compliance with the sit-at-home directive of IPOB.\nSome private schools are scheduled to reopen today (Wednesday), while students of public schools have been asked to resume on Thursday.\nMotor parks, markets, malls and bus stops in Owerri and environs fully complied with the sit-at-home order.\nA resident, Mrs Christiana Ogbu, said security agents and governors of the South-East observed the sit-at-home."
  },
  {
    "headline": "2023: GGL-N Coalition drums support for Emmanuel Udom",
    "summarized_story": "– Decries ‘pathetic national maladies’By Ibrahim Hassan-WuyoA group, the Good Governance League of Nigeria ( GGL-N) has thrown its weight behind Governor Emmanuel Udom of Akwa Ibom State ahead of the 2023 presidential election.\n“The Akwa Ibom Governor is on record to have the most violent-free State in today’s Nigeria.\n“In terms of economic empowerment and revitalization, Akwa Ibom’s Governor Udom Emmanuel has made a lot of spectacular moves.\nNow, the Akwa Ibom airport has 15 aircraft competing for space.\nAnd this partly explains why you hardly read the news of Executive/Legislature rift or uncontrollable internal political party bickering in Akwa Ibom State."
  },
  {
    "headline": "TETFund tasks polytechnics, CoEs on skills, entrepreneurial innovations",
    "summarized_story": "Executive Secretary of TETFund, Prof. Suleiman Bogoro, made the call, Tuesday,in Abuja, at a capacity building workshop for heads of selected institutions and staff of TETFund Centres of Excellence.\n“For the polytechnics, the centres of excellence are to focus on skills development and support entrepreneurship, start ups….\nRecall that TETFund had recently established Centres of Excellence in six polytechnics and six colleges of education.\nThe beneficiary institutions selected equally from each of the six geo-political zones in the country are; Federal Polytechnic Nasarawa, Nasarawa State; Federal College of Education, Pankshin, Plateau State (North Central), Federal Polytechnic, Bauchi, Bauchi State, Federal College Education, Yola, Adamawa State, (North East), Federal Polytechnic, Kaduna, Kaduna State, Federal College of Education, Zaria, Kaduna State (North-West).\nThe South-East has Federal Polytechnic, Nekede, Imo State and the Alvan Federal of Education, Owerri, Imo State."
  },
  {
    "headline": "Expert canvases more support for art and fashion in schools",
    "summarized_story": "The Art and Design Teacher at Greensprings School, Anthony Campus, Mrs Anuoluwapo Adeyemi has called on more schools in the country to promote art and fashion among their students.\nShe made this call while speaking at a recent fashion show organized by the students of the school.\nAccording to her, organizing art exhibitions and fashion shows, or generally providing the necessary support needed to teach the subject would help raise a generation that would take the Nigerian art and fashion industry to the next level.\nREAD ALSO:Parallex Bank comes on stream, promises limitless possibilitiesShe said, “We recently did our 2021 fashion show, themed The New Normal: #MixedMediaExpression, and based on this theme, our students showcased six clothing lines that brilliantly incorporated facemasks into their designs.\nThe school opened to the public in 1985 and is now regarded as one of the best schools in Nigeria."
  },
  {
    "headline": "2023: 600 women groups to stage ‘One Million Women March’ for Yahaya Bello",
    "summarized_story": "By Olasunkanmi AkoniAt least 600 women groups, drawn from different parts of the country have concluded plans to converge on Abuja next week Tuesday, in a solidarity walk for Governor Yahaya Bello of the Kogi State presidential quest.\nThe solidarity walk is tagged, “One Million Women March for GYB”.\nOperating under the auspices of Women United For Yahaya Bello (WUYABEL), the women groups, including Non-Governmental Organisations, civil society organisations, religious, professional bodies, women in media, politics, market women as well as top women entrepreneurs, among others, will storm Abuja to drum support for the Governor, ahead of 2023 presidential election.\nGovernor Yahaya Bello must know that once he has women on his side, he can go to sleep.\nThis is the reason different women groups are coming to Abuja to say it loud and clear that it is Yahaya Bello or nobody,” he stated."
  },
  {
    "headline": "FG inauguates governing councils of new 8 polytechnics,6 CoEs",
    "summarized_story": "Minister of Education, Malam Adamu Adamu*Warns members to refrain from procurement,other issues outside their limitBy Joseph ErunkeABUJA-THE federal government, Tuesday,inaugurated the governing councils of the new eight federal polytechnics and colleges of education in the country.\nTo this end,it has warned members of the councils against going outside their briefs, especially procurement matter.\nPrior to the enactment of this Act, the Governing Councils of Tertiary institutions were responsible for procurement matters, through the Council’s Tenders Board.\nThe Chief Executive is, however, expected to brief the Governing Councils regularly on all procurements, as it is done on all financial and other matters.\n” It is expected that Councils will respect the Principle of Federal Character in the appointment of members of staff."
  },
  {
    "headline": "Biafra: Nigeria should free Africa’s gift, Nnamdi Kanu – Ambazonian leader, Ayaba",
    "summarized_story": "Ambazonian activist, Ayaba Cho Lucas, has asked the Nigerian government to free Biafra agitator, Nnamdi Kanu.\nThe Indigenous People of Biafra (IPOB) leader is facing trial before Justice Binta Nyako of the Federal High Court, Abuja.\nOn Tuesday, Kanu refused to take plea in the 15 counts terrorism charges instituted by the federal government.\nReacting to the legal battle, Ayaba described Kanu as “Biafra and Africa’s gift” and called for his release.\nBiafra and Africa’s gift."
  },
  {
    "headline": "EFCC secures 9 judgments against ex-Gov Nyako, son, 7 others in alleged N29bn fraud",
    "summarized_story": "The Economic and Financial Crimes Commission, EFCC, secured nine judgments against a former Adamawa State Governor, Vice Admiral Muritala Nyako rtd, his son, Senator Abdulaziz Nyako and 7 of his business partners in just one day.\nThe anti-graft agency on Tuesday evening in Abuja, secured the nine judgments against the former governor in the N29bn fraud charges brought against them since 2015.\nNyako and the others had appealed against the July 19, 2021 ruling by Justice Okon Abang of the Federal High Court, Abuja which rejected their no-case submissions.\nThe others are Nyako’s son, Abdulaziz,; Zulfizil Abba, Abubakar Aliyu, Sebore Farms and Extension Limited, Pagado Fortunes Limited, Blue Opal Limited, Tower Assets Management Limited and Crust Energy Limited.\nThe court proceeded to affirm Justice Abang’s ruling and dismissed the appeals by Nyako and 8 others."
  },
  {
    "headline": "Audacity of herders’ killings, attacks on Ondo communities baffling – Akeredolu",
    "summarized_story": "Governor Oluwarotimi Akeredolu of Ondo State has expressed bewilderment over the effrontery of suspected Fulani herders launching attacks on communities in the state despite the security arrangement put in place.\nAccording to the governor, he never imagined that the security threat in the state would get to its current point.\nAkeredolu disclosed this on Tuesday while appointing the Commander of Amotekun Corps in the state, Akogun Adetunji Adeleye as his Special Adviser on Security Matters.\n“That people will have the audacity to come to our villages and communities, kill our people and set their houses ablaze.\nI know that my SSA on Security is never part of our executive council and I am convinced that we have a security council meeting, only few of us here are on it.”"
  },
  {
    "headline": "Akwa Ibom Assembly suspends council boss for alleged financial misappropriation, gross misconduct",
    "summarized_story": "The Akwa Ibom State House of Assembly, on Tuesday, suspended with immediate effect, the Chairman of Mkpat Enin Local Government Council, Hon.\nAniekpon Ekpo, over alleged gross misconduct and misappropriation of funds.\nThe House also directed the Vice Chairman of the Council, Hon.\nThis followed a report of the House Committee on Local Government and Chieftaincy Affairs led by the Chairman, Rt.\n“The Vice Chairman, other exco members and councilors are not carried along in the administrative functions of the council."
  },
  {
    "headline": "Troops dislodge IPOB/ESN stronghold where illegitimate sit-at-home is being declared",
    "summarized_story": "The Nigerian Army says its troops have dislodged a stronghold of the proscribed Indigenous People of Biafra (IPOB) and its armed affiliate, the Eastern Security Network in Lilu, a boundary town between Imo and Anambra States.\nThe army said the operation was a well coordinated dawn attack on the forest, where plans were being perfected to violently enforce the illegitimate sit-at-home declaration by the irredentist groups”, he said.\nAccording to him, Lilu, was hitherto known to be used as an operational base of the proscribed group.\nHe added that the troops recovered 10 pump action shotguns, two locally fabricated guns, one revolver pistol, rounds of 7.62 mm special, live cartridges, machetes and IPOB flags.\n“The operation was jointly conducted by troops of 82 Division, Nigerian Navy, 211 Quick Response Group of the Nigerian Air Force, Department of State Services and the Nigeria Police.”"
  },
  {
    "headline": "Buhari off to Gambia for Barrow’s inauguration",
    "summarized_story": "President Muhammadu Buhari will depart Abuja on Wednesday for Banjul, capital of The Gambia, to attend the inauguration of President Adama Barrow, following his re-election for a second term.\nThis was contained in a statement by his Senior Special Assistant on Media and Publicity, Mallam Garba Shehu on Tuesday evening.\nOn the invitation of his host, President Buhari will be Special Guest of Honour at the ceremonies to be attended by other African leaders at the Independence Stadium, Bakau.\nBuhari, along with other ECOWAS leaders, played a leading role in the restoration of democratic rule in The Gambia in 2017 after former President Yahya Jammeh, refused to surrender power after losing the election.\n- Advertisement -The President is expected back in the country at the end of the inauguration ceremonies."
  },
  {
    "headline": "VIDEO: How I killed doctor in Abuja, by suspect",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "Nnamdi Kanu’s supporters clash with security men",
    "summarized_story": "Supporters of the detained leader of the Indigenous People of Biafra (IPOB) Nnamdi Kanu in large numbers clashed with security operatives at the Federal High Court in Abuja on Tuesday.\nOur correspondent observed that the supporters kept on chanting, “Holy Holy Holy, Nnamdi Kanu is another Saviour”.\nThe IPOB supporters were at the other end of the Ministry of Justice when the security agents sighted and tried to disperse them.\n- Advertisement -This resulted in a face-off between the supporters and security operatives who later called for reinforcement and dispersed them.\nBut FCT Commissioner of Police (CP) Sunday Babaji said there was no clash between IPOB and security operatives."
  },
  {
    "headline": "Buhari to attend Gambian President, Adama Barrow’s inauguration Wednesday",
    "summarized_story": "President Muhammadu Buhari will, on Wednesday, depart Abuja for Banjul, Republic of The Gambia, to attend the inauguration of Gambian President, Adama Barrow, following his re-election for a second term.\nMalam Garba Shehu, the president’s Media Aide, confirmed this in a statement on Tuesday in Abuja.\n- Advertisement -The president will be accompanied by Minister of Foreign Affairs, Mr Geoffrey Onyeama; National Security Adviser, Retired Maj.-Gen. Babagana Monguno; Director-General, National Intelligence Agency, Amb.\nAhmed Rufai, and other top government officials.\nThe president is expected back in the country at the end of the inauguration ceremonies."
  },
  {
    "headline": "Osun 2022: Adeleke family bickers over PDP ticket",
    "summarized_story": "A brewing controversy appears to have emerged in the Adeleke family over the Osun governorship election scheduled for July 16, 2022, The Nation has learnt.\nThe Nation gathered two members of the family – Dele Adeleke and Ademola Adeleke – are jostling for the governorship ticket of the People’s Democratic Party (PDP).\nThe party has cleared all the aspirants, including Sen. Ademola Adeleke; former Secretary to Osun State Government, Alhaji Abdulateef Akinbade; Dr Akin Ogunbiyi, Mr Omirin Emmanuel Olusanya, Dele Adeleke and Mr Dotun Babayemi.\nIn a post on Twitter on Tuesday, Davido told the people of Osun to beware of fakes like Dele Adeleke.\n- Advertisement -Read Also: Ogunbiyi denies alliance with Adeleke in Osun pollHe said: “Wonderful!"
  },
  {
    "headline": "Excitement as The Sun begins 2022 with praises, thanksgiving",
    "summarized_story": "The company’s annual thanksgiving service and staff award is a way of beginning every new year and committing the organisation’s activities into God’s hands for divine guidance.\nLeading the thanksgiving was the pastor in charge of Missions and Network at the Citadel Global Community Church (formerly Latter Rain Assembly), Christian Ike.\nWe were looking at Friday this week to hold the event but the man of God (Pastor Tunde Bakare) we invited gave us January 18.\nBut we got a message at that thanksgiving, where we were told to fear not that the Lord was with us.\nHe assured them that God would continue to make His goodness and mercies available as they sail through 2022."
  },
  {
    "headline": "Breaking: Kalu visits Buhari at Aso Rock",
    "summarized_story": "President Muhammadu Buhari has received Chief Whip of the Senate, Orji Uzor Kalu at the Presidential Villa, Abuja.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nAnnouncing the visit on his verified Facebook page, Kalu wrote: “Tonight, I paid President Muhammadu Buhari a visit to discuss major national issues and I am very satisfied with our discussion.\nI left him at 10pm and in good health .\nWe look forward to a better Nigeria.”"
  },
  {
    "headline": "Nnamdi Kanu challenges fresh terrorism charges, hires Ozekhome SAN",
    "summarized_story": "Detained leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu has engaged a human rights activist and foremost constitutional lawyer, Chief Mike Ozekhome, SAN, to lead his defence team in the fresh terrorism charges slammed against him by the Federal Government.\nIt is guaranteed under both the Constitution of the Federal Republic of Nigeria and the African Charter on Peoples’ Rights.\nKanu, who appeared before the Abuja division of the Federal High Court on Monday, accused the Federal Government of ambushing him with the new charge.\nHe was expected to take a fresh plea to an amended 15-count treasonable felony and terrorism charge the Federal Government preferred against him.\nOzekhome, SAN, told the court that the amended charge was served on them, barely 24 hours to the scheduled hearing."
  },
  {
    "headline": "BREAKING: APC to hold national convention February 26 – Buni",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Chairman of the National Caretaker/Extraordinary Convention Planning Committee (CECPC) and Governor of Yobe State, Malam Mai Mala Buni, has announced February 26th as the date for the All Progressive Congress (APC) convention.\nHe made the announcement at the first-ever National Progressive Women’s Conference in Abuja, declaring that wi FG 41 million registered APC members will the 2023 elections.\nAccording to him, the party was counting on the support of women to hold a successful convention as well as win the 2023 elections.\n“Today, APC parades over 41 million registered members, asserting our position as Africa’s largest political party and of course, Nigeria’s leading political party.\n“We look forward to having more women contesting in the forthcoming national convention of the party from February 26, 2022, and the general election."
  },
  {
    "headline": "Kidnappers release 2 NCRIB workers after N4 million ransom",
    "summarized_story": "By Adewale SanyaoluTwo workers of the Nigerian Council of Registered Insurance Brokers (NCRIB) kidnapped on Sunday morning at Isara,in Ogun State, Shola Olawuyi and AdeolaBude, have been released and reunited with their families after the payment of N4 million ransom.\nConfirming their release to Daily Sun in a telephone interview, the Executive Secretary of NCRIB, Mr.Tope Daramola, said the victims were released around 12am(Tuesday).\nOn weather ransom was paid or not, Daramola said NCRIB as an organization did not pay any ransom before their release.\nBut another reliable source who spoke to Daily Sun in confidence said the sum of N4 million was paid to the kidnappers before their release.\nDaramola commended the efforts of the Ogun State Police Command, led by its Commissioner of Police, for ensuring the timely release of the victims."
  },
  {
    "headline": "The Thrills of Buhari’s Visit to Ogun",
    "summarized_story": "By Bolu AdeosunThere are many reasons President Muhammadu Buhari’s visit to Nigeria’s Gateway State on Thursday is a memory to treasure.\nAnd recently when he postponed his visit, the naysayers jubilated to no end, saying that they had aborted the visit with their influence.\nOf course, there are many projects awaiting completion, including the first phase of the Ogun State International Agro Cargo Airport at Ilishan and the Atan-LUSADA-Agbara expressway which leads to Agbara Industrial Estate, the industrial nerve center of Ogun State, Nigeria and indeed, the entire ECOWAS Sub-region.\nHis words: ‘‘It is significant to note that the two road projects being commissioned today are federal roads.\nIt is no surprise that Ogun State now ranks 4th on the scale of Ease-of-Doing-Business in Nigeria."
  },
  {
    "headline": "It’s Official! APC Convention Holds Feb. 26",
    "summarized_story": "The Chairman of the Caretaker/Extraordinary Convention Planning Committee (CECPC) of the All Progressives Congress (APC) and the Governor of Yobe State, Mai Mala Buni, has confirmed that the national convention of the party will be held on February 26.\nBuni disclosed this Tuesday in Abuja while delivering a speech at the Progressives Women Congress held in Abuja."
  },
  {
    "headline": "APC Caretaker Committee’s Meeting Under way",
    "summarized_story": "Adedayo Akinwale in AbujaMembers of the Caretaker/Extraordinary Convention Planning Committee (CECPC) of the All Progressives Congress (APC) are presently meeting in Abuja over the national convention of the party.\nIt is expected that at the end of the meeting, the committee will announce the date and venue of the national convention of the party after several postponements.\nIt is expected that the meeting will also deliberate on other modalities, especially the mode of the convention, whether direct primary, delegate system or consensus.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Senate Resumes Plenary, Goes into Executive Session",
    "summarized_story": "By Deji Elumoye and Sunday AborisadeThe Senate on Tuesday resumed plenary after its Christmas break and immediately went into a closed-door session.\nThe President of the Senate, Dr Ahmad Lawan, after saying the opening prayer, told the Senate Leader, Senator Yahaya Abdullahi, to move for the Senate to go into executive session.\nThe Senate had shortly before going on break in December, 2021 hinted of plan to liaise with the House of Representatives and their constituents on what should be the next move of the Red Chamber to the Electoral Act Amendment Bill which President Muhammadu Buhari refused to sign into law.\nIt is not unlikely that the senators at the executive session may discuss the issue as well as other issues of interest to the upper legislative chamber.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: House to Reintroduce Electoral Act Amendment Bill Wednesday",
    "summarized_story": "Udora Orizu in AbujaThe Speaker of the House of Representatives, Hon.\nFemi Gbajabiamila, has disclosed that the Electoral Act Amendment Bill, which was rejected by President Muhammadu Buhari, will be reintroduced Wednesday for a rework by the lawmakers.\nPresident Muhammadu Buhari had in December rejected the Bill, citing issues with direct primary provisions.\nHe also assured Nigerians that the lawmakers will prioritize action to pass the constitutional amendment bill.\nThereafter, the lawmakers went into a close door session."
  },
  {
    "headline": "EXCLUSIVE: How Ex-Governor, Bafarawa’s Nephew Sold Military Gun Trucks To Bandits, Terrorised Sokoto, Zamfara, Niger states – Police Sources",
    "summarized_story": "The Nigeria Police Force is currently investigating grave allegations against a nephew of Alhaji Attahiru Bafarawa, former governor of Sokoto State who was arrested for supplying arms, ammunition, and military kits to bandits.\nPolice sources told SaharaReporters that investigations showed that the suspect, identified as Musa Mohammed Kamarawa, bought and sold military gun trucks to bandits as well as AK-47 and AK-49 rifles.\nThe police further claimed his gang engaged in kidnapping and burning of houses in Sokoto, Zamfara, Kebbi and Niger states.\nSources had told SaharaReporters that Bafarawa, who has been uneasy with the arrest of his relation, has been putting pressure for Kamarawa’s release.\nAfterward I got admitted to study for my degree at Usman Danfodiyyo University, Sokoto State.”"
  },
  {
    "headline": "EXCLUSIVE: How Ex-Governor, Bafarawa’s Nephew Sold Military Gun Trucks To Bandits, Terrorised Sokoto, Zamfara, Niger states – Police Sources",
    "summarized_story": "The Nigeria Police Force is currently investigating grave allegations against a nephew of Alhaji Attahiru Bafarawa, former governor of Sokoto State who was arrested for supplying arms, ammunition, and military kits to bandits.\nPolice sources told SaharaReporters that investigations showed that the suspect, identified as Musa Mohammed Kamarawa, bought and sold military gun trucks to bandits as well as AK-47 and AK-49 rifles.\nThe police further claimed his gang engaged in kidnapping and burning of houses in Sokoto, Zamfara, Kebbi and Niger states.\nSources had told SaharaReporters that Bafarawa, who has been uneasy with the arrest of his relation, has been putting pressure for Kamarawa’s release.\nAfterward I got admitted to study for my degree at Usman Danfodiyyo University, Sokoto State.”"
  },
  {
    "headline": "EXCLUSIVE: How Ex-Governor, Bafarawa’s Nephew Sold Military Gun Trucks To Bandits, Terrorised Sokoto, Zamfara, Niger states – Police Sources",
    "summarized_story": "The Nigeria Police Force is currently investigating grave allegations against a nephew of Alhaji Attahiru Bafarawa, former governor of Sokoto State who was arrested for supplying arms, ammunition, and military kits to bandits.\nPolice sources told SaharaReporters that investigations showed that the suspect, identified as Musa Mohammed Kamarawa, bought and sold military gun trucks to bandits as well as AK-47 and AK-49 rifles.\nThe police further claimed his gang engaged in kidnapping and burning of houses in Sokoto, Zamfara, Kebbi and Niger states.\nSources had told SaharaReporters that Bafarawa, who has been uneasy with the arrest of his relation, has been putting pressure for Kamarawa’s release.\nAfterward I got admitted to study for my degree at Usman Danfodiyyo University, Sokoto State.”"
  },
  {
    "headline": "BREAKING: Gunmen Storm Nigerian University Campus, Abduct Four Students",
    "summarized_story": "Gunmen suspected to be bandits have abducted some students of Federal University of Lafia, Nasarawa State.\nDaily Trust reports that the students were abducted close to their University campus at Mararaba, close to Abuja.\nMeanwhile, the Public Relations Officer of the institution, Abubakar Ibrahim, confirmed the incident, explaining that four students were abducted.\nAccording to him, the gunmen stormed the university community at 11:30pm on Thursday and whisked the students to an undisclosed location.\nWhile expressing his deep sympathy to the families of the abducted students, he assured them that serious efforts were being taken to ensure the quick rescue of the victims."
  },
  {
    "headline": "BREAKING: Gunmen Storm Nigerian University Campus, Abduct Four Students",
    "summarized_story": "Gunmen suspected to be bandits have abducted some students of Federal University of Lafia, Nasarawa State.\nDaily Trust reports that the students were abducted close to their University campus at Mararaba, close to Abuja.\nMeanwhile, the Public Relations Officer of the institution, Abubakar Ibrahim, confirmed the incident, explaining that four students were abducted.\nAccording to him, the gunmen stormed the university community at 11:30pm on Thursday and whisked the students to an undisclosed location.\nWhile expressing his deep sympathy to the families of the abducted students, he assured them that serious efforts were being taken to ensure the quick rescue of the victims."
  },
  {
    "headline": "P&ID: EFCC quizzes Shasore, former Lagos attorney-general",
    "summarized_story": "Olasupo Shasore, a former attorney-general and commissioner for justice in Lagos, is being questioned by the Economic and Financial Crimes Commission (EFCC) over his involvement in the Process and Industrial Developments (P&ID) case.\nThe former Lagos commissioner, who had represented Nigeria at the beginning of the P&ID case, is said to have arrived the EFCC headquarters in Abuja on Tuesday afternoon.\nAdvertisementTheCable had reported in July 2020 that the federal government had told a UK court that Shasore colluded with P&ID to avert justice in the controversial gas supply purchasing agreement (GSPA) contract.\nThe former Lagos commissioner has also maintained that he defended Nigeria to the best of his ability on the matter.\nAdvertisementMeanwhile, Shasore’s interrogation by the EFCC comes months before a dispute between Nigeria and P&ID is scheduled for trial in the United Kingdom."
  },
  {
    "headline": "P&ID: EFCC quizzes Shasore, former Lagos attorney-general",
    "summarized_story": "Olasupo Shasore, a former attorney-general and commissioner for justice in Lagos, is being questioned by the Economic and Financial Crimes Commission (EFCC) over his involvement in the Process and Industrial Developments (P&ID) case.\nThe former Lagos commissioner, who had represented Nigeria at the beginning of the P&ID case, is said to have arrived the EFCC headquarters in Abuja on Tuesday afternoon.\nAdvertisementTheCable had reported in July 2020 that the federal government had told a UK court that Shasore colluded with P&ID to avert justice in the controversial gas supply purchasing agreement (GSPA) contract.\nThe former Lagos commissioner has also maintained that he defended Nigeria to the best of his ability on the matter.\nAdvertisementMeanwhile, Shasore’s interrogation by the EFCC comes months before a dispute between Nigeria and P&ID is scheduled for trial in the United Kingdom."
  },
  {
    "headline": "Bandits killed 220 residents in 17 days in Niger, says governor",
    "summarized_story": "Abubakar Bello, governor of Niger, says within 17 days, a total of 220 residents were killed by bandits in the state.\nIn recent weeks, communities across the state have been subjected to attacks by gunmen who have been killing and kidnapping residents.\nThe governor said the bandits move from one state to another and that only a robust deployment of modern technology will curb their activities.\n“We share borders with Kaduna, Zamfara, and Kebbi states, and these bandits have the habit of hibernating between forests, moving from Zamfara to Kebbi, and Kebbi to Niger.\nBut basically, the states of Kaduna, Niger, Kebbi would have to work together to address the situation."
  },
  {
    "headline": "Bandits killed 220 residents in 17 days in Niger, says governor",
    "summarized_story": "Abubakar Bello, governor of Niger, says within 17 days, a total of 220 residents were killed by bandits in the state.\nIn recent weeks, communities across the state have been subjected to attacks by gunmen who have been killing and kidnapping residents.\nThe governor said the bandits move from one state to another and that only a robust deployment of modern technology will curb their activities.\n“We share borders with Kaduna, Zamfara, and Kebbi states, and these bandits have the habit of hibernating between forests, moving from Zamfara to Kebbi, and Kebbi to Niger.\nBut basically, the states of Kaduna, Niger, Kebbi would have to work together to address the situation."
  },
  {
    "headline": "Lawan: Buhari did not direct removal of petrol subsidy",
    "summarized_story": "Senate President Ahmad Lawan says President Muhammadu Buhari did not direct the removal of petrol subsidy.\nSpeaking with reporters after a meeting with Buhari at the Aso Rock villa on Tuesday, Lawan said many citizens are concerned about the plan of the federal government to remove subsidies.\n“Well, it will be of interest to Nigerians to hear what I’ve come to discuss with Mr. President, among several other things,” the senate president said.\nAdvertisementIn October, the finance minister said the federal government would only cater for subsidies on petrol in the first six months of 2022.\nShe had said the federal government would provide a N5,000 transportation grant to poor Nigerians to cushion the effects of subsidy removal."
  },
  {
    "headline": "What exactly is Web3?",
    "summarized_story": "This was historic as it helped filter out shams and highlight the real success stories, which laid the foundation for subsequent successful internet companies.\nWeb2 companies build sleek and revolutionary apps that become popular quickly, and as the app’s popularity increases, so does its user base.\nSince these web apps are controlled by a single internet company, users can only use them as long as the company wants them to.\n“Web3” was coined in 2014 by Gavin Wood, president and founder of Web3 Foundation, and he said then that it was going to be the next version of the internet.\nThat is why Nigerian crypto entrepreneur, Yele Bademosi, started out his Web3 development plan in Africa with Breach, a platform that uses newsletters, blog posts, quizzes, etc to teach Africans complex Web3 topics."
  },
  {
    "headline": "Nigeria’s new deal with Twitter is not a win for the government or citizens",
    "summarized_story": "Nigeria’s new deal with Twitter is its government’s most recent effort to control social media.\nAccording to Twitter’s Transparency Report—a report that gives insights into information and removal requests from around the world, by country—Nigeria has made zero removal requests and just 7 information requests, at the time of reporting.\nHowever, India has made 12,435 legal removal requests, 67 court orders, and 12,368 other legal demands, representing 6% of global removal requests.\nIn February last year, India’s government enacted a fresh social media rule that made social media companies like Facebook, WhatsApp, Twitter, and others more accountable to legal requests.\nBut Sesan says Nigeria’s internet restriction tactics are miles behind India’s because the latter drew up regulations; Twitter will only respond to legal requests backed by legislation."
  },
  {
    "headline": "A year to Nigeria’s 2023 elections, its government lifts Twitter ban",
    "summarized_story": "After 6 months, the Nigerian government has lifted the suspension of Twitter operations in the country following approval by President Muhammadu Buhari.\nRecall that the Nigerian government suspended Twitter’s operation on June 4, 2021, following the platform’s decision to remove a controversial tweet by the Nigerian President, which it said breached the site’s rules.\nThe Nigerian government has insisted the suspension is a matter of national security and not related to the president’s tweet.\nThe government’s decision to ban Twitter triggered widespread criticism as online-based businesses recorded huge losses; lawsuits filed against the Nigerian government; and national assembly hearings held to probe the circumstances leading to the ban.\nIn wake of removal of the suspension, Nigerians have come online to celebrate the end of an era of using VPNs to access Twitter."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there Been a while since I wrote one of these.\nI certainly hope the holidays were as restful for you as it was for..."
  },
  {
    "headline": "Techpoint Build Spotlight: Meet Monnify, one of Africa’s fastest-growing payment providers",
    "summarized_story": "Share this article:If you haven’t found a reason to register for Techpoint Build yet, then I’m here to add to the growing list.\nFor Techpoint Build is a massive journey, and we’ve been deliberate about the companies we brought on board to help reach our destination.\nWhat makes you excited about Techpoint Build 2021I believe Techpoint Build presents a fantastic opportunity to foster and drive connectedness among fellow players in the tech ecosystem, one that the industry consistently needs.\nWhat pain points do you think needs to be addressed in the financial services sector?\nCross-border paymentsThe better synergy between stakeholders (fintech and banks)High Transaction FeesWhat impact do you envisage following Techpoint Build conversations on the next frontier?"
  },
  {
    "headline": "After building for 18 months, cloud-based restaurant management platform, Orda, raises $1.1m pre-seed",
    "summarized_story": "On Wednesday, January 12, 2022, Nigerian cloud-based HR and payroll management platform, SeamlessHR, raised $10 million to take its business across Africa with plans of setting up shop outside the continent.\nWhile they are common with HR and payroll management, Orda offers its services to restaurants and food business owners.\nIt is an electronic point of sale (ePOS) and restaurant management system that helps food business owners manage all their operations from one place.\nIn addition to managing all restaurant operations, Orda also offers restaurants a lightweight website, mobile app, and inventory management system.\nThe startup’s cloud-based system is currently available in Nigeria and Kenya."
  },
  {
    "headline": "Cashflow for African SMEs, Asset financing in Uganda",
    "summarized_story": "Be it bookkeeping, logistics and eCommerce, to a total overhaul of their operations, 2021’s numbers showed these startups meant business.\nFloat, a Ghanaian fintech has raised $17 million seed to help, you guessed it, power small and medium enterprises (SMEs).\nThese SMEs account for the bulk of employment in nearly every continent and contribute a huge chunk to the GDP.\nAccording to Mezzour, it is the national brand to promote the Moroccan digital sector.\nIn 2021, Moroccan startups hit a record-high of $29 million in funding, perhaps an indication of the country’s burgeoning tech ecosystem."
  },
  {
    "headline": "Inflation surge unlikely to raise interest rate",
    "summarized_story": "The first increase in Nigeria’s inflation rate in nine months is unlikely to lead to a hike in interest rates when the Monetary Policy Committee (MPC) meets next week.\n“I do not expect the acceleration in inflation rate to impact on the MPC’s rate decision at their next meeting given that the acceleration is likely to be transitory,” Oyedele said.\nThe inflation outturn was mainly driven by food inflation, as festive induced spending drove the month-on-month (MoM) uptick to 2.20 percent (2x higher than November’s MoM food inflation rate).\nAccording to the NBS, food inflation settled at 17.37% in December as against 17.21% the previous month.\nOn the other hand, Food Inflation was highest in Kogi State with 22.82%, while Edo State was the lowest with 13.24%."
  },
  {
    "headline": "Nigeria’s infrastructure funding to slow as China cuts lending",
    "summarized_story": "“Nigeria has high respect for China and what China is helping Nigeria to achieve, particularly in the area of infrastructure.\nChina is Nigeria’s biggest bilateral creditor, Damilola Adewale, a Lagos-based economic analyst, stated, saying, “A significant number of the country’s big-ticket infrastructure projects are financed by China.\nA lot of African countries are not well planned for that now,” Damilare Asimiyu, a senior analyst at Afrinvest Securities Limited, said.\nIn response, China’s two main policy banks – China Eximbank and China Development Bank – thus adopted increasingly hard-line lending terms.\nThe conditions have, however, proved difficult as pandemic-related economic hardship puts a strain on more indebted African countries."
  },
  {
    "headline": "What tenants do not know about Lagos monthly rent",
    "summarized_story": "January 2022 when the proposed Lagos Monthly Rent scheme is planned to start is here, yet the enthusiasm that should greet such a scheme remains to be seen.\nThis may be partly because many of the tenants do not have the right information on how the scheme will serve their needs.\nThe portal would also be open to landlords who might wish to place their properties there for rent.\nThe Lagos State government, late last year at the Lagos Real Estate Market Place Conference and Exhibition, announced that it would be implementing a monthly rent scheme starting from January this year.\nLagos is an active rental market where it is estimated that 60 percent of its population live in rented accommodation spending about 50 percent of their income on rent."
  },
  {
    "headline": "Group Slams Buhari over failed promises, vows to resist anti people policies – Nigerian Observer",
    "summarized_story": "Dr. Obayuwana regretted that while Nigerians were buying imported petroleum products at cutthroat prices, “Buhari as the president and minister of petroleum has allowed his few local and international friends to profit maximally from what our country is blessed with”.\nAccording to him ” we the Nigerian people protested against this in 2012.\nBuhari asked for our votes in 2014, and made all kinds of promises which he has refused to keep.\nWe cannot and must not allow this to continue at the expense of our lives and those of our children, our today and our tomorrow”.\n“We must fight for our right and reject this proposed increase in the hardship we already face” they charged."
  },
  {
    "headline": "Senate sets agenda for 2022 legislative activities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…promises to expidite action on Passage of Electoral Bill, 2021.\nThe Nigerian Senate resumed plenary 18th January, as it sets agenda for the 2022 legislative agenda which include expediting action on the passage of the Electoral Bill, 2021 after a three weeks Christmas recess.\n“Like we all know, the Senate and indeed the National Assembly worked so hard on the Bill.\nOn the issue of the security challenges facing the country, the Senate President said the Security situation in the country is still dire.\nWe have to construct and provide infrastructure, in all parts of our country because infrastructure is needed for our nation to develop”."
  },
  {
    "headline": "Edo keen on exploiting mining, oil, gas resources – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has said the state government is determined to exploit its mining, oil and gas assets to boost economic growth.\nNoting that there was a need to expand the state’s economic base, Obaseki said the state is focused on exploring the opportunities in mining, oil and gas sectors.\nAccording to him, “We have done a lot in the oil palm sector with the Edo Oil Palm Programme (ESOPP), but we know there is a lot to be done in the mining, oil and gas sectors.\nWe want to participate in that sector as well.”“On mining, Edo State has the third largest number of licences for mining, only behind Kaduna and Nasarawa.\nWe need to know how many of the licences available in the state are not being exploited,” he noted."
  },
  {
    "headline": "Obaseki rallies Edo entertainers, to grow economy, create more jobs with creative hub – Nigerian Observer",
    "summarized_story": "Obaseki gave the charge when he led Edo entertainers, including Osaronkhae Lawrence (MC Casino) and Gbadamasi Jonathan (Edo Pikin), among others on a guided tour of the hub in Benin City.\nOsaigbovo Iyoha, reassured that his government will sustain projects and programmes to enhance the growth of the state’s entertainment industry, ensuring that Edo youths realise their fullest potentials.\nAccording to him, “We have brought our own in the entertainment industry to inspect this hub as they have made an impact in the industry.\nOn his part, Head, Edo Creative Hub, Charles Nzeribe said, “This hub, when in proper use, will generate more jobs for Edo people.\nThe governor has brought the dreams of entertainers to reality with the building of this entertainment hub."
  },
  {
    "headline": "2023: Abia professionals ask Alex Otti to declare for governorship",
    "summarized_story": "“Abia State needs in 2023 is an individual equipped with the necessary economic, political and social leadership skills, training and intellect to drive the engine of growth and development so as to move the state forward, having stagnated, indeed regressed, for the past 23 years under PDP,” the communique read.\nLikewise, the association cautioned Abia youths to be law abiding and refrain from acts that would put them at loggerheads with the security agencies.\n“That AFA frowns at the dilapidated state of infrastructure in all of Abia State, especially Aba, the commercial capital.\n“AFA calls on Governor Okezie Ikpeazu to be mindful of the kind of legacy he wants to leave behind in Abia State, after eight years in office.\n“AFA calls on the political elites in Abia State to get out of their lethargy and begin to mobilise the people with a view to dispensing with the PDP government which has held Abia State down without progress for the past 23 years, as the momentum towards the general elections in 2023 begins to gather.”"
  },
  {
    "headline": "ICAN approves full accreditation for B.SC Accounting in Kings University",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe Institute of Chartered Accountants of Nigeria, ICAN, has approved full accreditation for B.Sc.\nAccounting programme in Kings University, Odeomu, Osun State.\nThis was contained in a letter addressed to the University Chancellor, Pastor Matthew Ashimolowo signed by Funmi Otitoju on behalf of the ICAN Registrar/C.E.O.\nWith this approval, graduates of the Accounting programme of Kings University are exempted from the first two stages (Foundation and Skills Levels), hence, would sit for only the final level of ICAN Professional Examination.\nThe Vice-Chancellor, Professor Adenike Kuku, while speaking on the laudable feat remarked that it buttresses the commitment of the University to provide students with global standard education and career advancements which will empower them to thrive within the complex and competitive contemporary workplace."
  },
  {
    "headline": "Nnamdi Kanu hires senior lawyer, Mike Ozekhome, as trial resumes today",
    "summarized_story": "Mazi Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), has engaged the services of a prominent lawyer, Mike Ozekhome, a Senior Advocate of Nigeria (SAN), to strengthen his defence team in his trial on terrorism charges.\nAs Kanu’s trial resumed today at the Federal High Court premises in Abuja, Ozekhome, was seen interacting with the IPOB leader alongside Ifeanyi Ejiofor, his lead counsel.\nKanu arrived at the courtroom at 9: 47 a.m., the trial judge, Mrs Nyako, resumed sitting at 9: 55 a.m.Security presence at the court premises was heavier than previous sittings, as vehicular and human traffic was completely diverted from the Federal High Court and adjoining streets.\nArmed hooded State Security Service (SSS) and police operatives manned strategic locations around the court as they turned people away from the court.\nLawyers and journalists were barred from accessing the courtroom despite being accredited to cover the day’s proceedings on Tuesday."
  },
  {
    "headline": "AFCFTA drags one year after …as Nigeria, others fail to pull weight",
    "summarized_story": "After several months of delay, African countries officially began trading under a new continent-wide free trade area on January 1, 2020.\nAccording to a research conducted by the African Development Bank (AfDB), only 16% of international trade by African countries takes place between African countries.\nOne of such countries where AfCFTA has recorded a false start is Nigeria.\nLike in Nigeria, the AfCFTA project has failed to live up to expectations in many African countries.\nA consultant at ISS, Peter Fabricius, said: “Complex trade negotiations no doubt take time."
  },
  {
    "headline": "Kanu Faces Fresh Terrorism Charges",
    "summarized_story": "Amidst calls for a political solution, the federal government has filed fresh terrorism charges against the leader of the proscribed Indigenous People of Biafra, Nnamdi Kanu.\nIn the fresh charges filed at a Federal High Court sitting in Abuja, the government increased the counts in the initial charge it preferred against Kanu.\nKanu has been in detention since his he was brought back from Kenya to Nigeria.\nWith the new charge, the trial will have to be put on hold for Kanu to take his plea to the amended charges.\nunder section 1 (2) (f) of the terrorism (Prevention) (Amendment), Act 2013."
  },
  {
    "headline": "Policeman Arrested For Shooting Tanker Driver In Gombe",
    "summarized_story": "A policeman serving in Gombe State, Urbanus Ishaku, has been arrested and disarmed for shooting a trailer driver in Dukku town along Gombe-Darazo highway.\nThe spokesperson of the State Police Command, Mary Obed Malum, disclosed this in a press release issued to journalists on Monday.\nAside the disarming the culprit, Malum said the policeman was under interrogation, promising that justice would be served in the matter.\nADVERTISEMENTMeanwhile, other lorry and tanker drivers have blocked the road where the incident happened in protest against the action of the policeman.\nADVERTISEMENTOur correspondent gathered that there was a misunderstanding between the policeman and the driver at a checkpoint on the highway, which led to the shooting."
  },
  {
    "headline": "Zamfara: ‘Political Bandits’ Inflating Figures Of Killings – Matawalle",
    "summarized_story": "Zamafara State governor, Bello Matawalle, has accused ‘political bandits’ of increasing figures of killings in the state.\nAccording to him, the government was doing everything possible to stem the tide of killings in the state.\n“But as I’ve been saying, some political bandits have been spreading lies, rumours, so that they can achieve some political gain.\nBecause I wonder how people will just be writing figures without having genuine information from those communities.\nADVERTISEMENT“So, you see with the kind of people we have in Zamfara State, I don’t think this issue of banditry will end very soon."
  },
  {
    "headline": "Zamfara: ‘Political Bandits’ Inflating Figures Of Killings – Matawalle",
    "summarized_story": "Zamafara State governor, Bello Matawalle, has accused ‘political bandits’ of increasing figures of killings in the state.\nAccording to him, the government was doing everything possible to stem the tide of killings in the state.\n“But as I’ve been saying, some political bandits have been spreading lies, rumours, so that they can achieve some political gain.\nBecause I wonder how people will just be writing figures without having genuine information from those communities.\nADVERTISEMENT“So, you see with the kind of people we have in Zamfara State, I don’t think this issue of banditry will end very soon."
  },
  {
    "headline": "Wike Reconciles Diri, Alaibe 2 Years After Bayelsa PDP Gov’ship Primaries",
    "summarized_story": "Governor Diri had won the governorship primary with 561 votes while his main rival, Alaibe scored 365 votes.\nAlaibe, however, extended an olive branch to Governo Diri after exhausting his legal options but his peace moves were rejected by Governor Diri, who described such peace offering as belated.\nWike was reported to have prevailed on Governor Diri, during his last week visit to Yenagoa, to end the cold feud with Alaibe.\nA PDP source told LEADERSHIP that Diri accepted Wike’s reconciliatory offer but said all is left for Alaibe to make such peace move.\nADVERTISEMENT“To demonstrate the sincerity of my intentions and reciprocate the same humility, which Governor Diri had displayed previously, I refused to meet him on a neutral ground."
  },
  {
    "headline": "Again, three policemen, two vigilance group members killed in Niger",
    "summarized_story": "Three policemen and two local vigilance group members have been killed by gunmen in Kwanan Dutse, Mariga Local Government Area of the Niger State.\nThe joint security task force members were said to have been on their way back from a routine patrol when they were ambushed by the gunmen on Monday at about 4.00pm.\nOur correspondent gathered that on their way back around Kwanan Dutse, their patrol team ran into a roadblock mounted by the gunmen.\nIt was also revealed that there was an attack on the same road on Sunday but the joint security task force was able to neutralise it.\nThis recent attack is coming about three days after 28 people were killed in the Mashegu Kontagora axis of the state."
  },
  {
    "headline": "Again, three policemen, two vigilance group members killed in Niger",
    "summarized_story": "Three policemen and two local vigilance group members have been killed by gunmen in Kwanan Dutse, Mariga Local Government Area of the Niger State.\nThe joint security task force members were said to have been on their way back from a routine patrol when they were ambushed by the gunmen on Monday at about 4.00pm.\nOur correspondent gathered that on their way back around Kwanan Dutse, their patrol team ran into a roadblock mounted by the gunmen.\nIt was also revealed that there was an attack on the same road on Sunday but the joint security task force was able to neutralise it.\nThis recent attack is coming about three days after 28 people were killed in the Mashegu Kontagora axis of the state."
  },
  {
    "headline": "INEC: Passage of Electoral Bill will determine our preparation for 2023",
    "summarized_story": "The passage of the contentious Electoral Act Amendment Bill would determine the preparation of the Independent National Electoral Commission for the 2023 general elections, its Chairman, Prof. Mahmood Yakubu, emphasised on Tuesday.\nYakubu bared his mind in Abuja during the first quarterly meeting of INEC with political parties in 2022.\n“We look forward to a speedy passage of the Bill, which is crucial to our preparations for future elections.\nFor the Osun State governorship election, primaries will hold from February 16 to March 12, 2022.\nMajor activities have already been carried out, including the conduct of primaries and nomination of candidates by political parties."
  },
  {
    "headline": "INEC: Passage of Electoral Bill will determine our preparation for 2023",
    "summarized_story": "The passage of the contentious Electoral Act Amendment Bill would determine the preparation of the Independent National Electoral Commission for the 2023 general elections, its Chairman, Prof. Mahmood Yakubu, emphasised on Tuesday.\nYakubu bared his mind in Abuja during the first quarterly meeting of INEC with political parties in 2022.\n“We look forward to a speedy passage of the Bill, which is crucial to our preparations for future elections.\nFor the Osun State governorship election, primaries will hold from February 16 to March 12, 2022.\nMajor activities have already been carried out, including the conduct of primaries and nomination of candidates by political parties."
  },
  {
    "headline": "Gun-battle: Gunmen shoot 3 policemen, 2 vigilantes dead in Niger",
    "summarized_story": "By Aminu GarkoThe Niger Police Command has confirmed the killing of three of its men and two local vigilantes in an ambush by gunmen in Kwanan Dutse, Mariga Local Government Area of the state.\nKuryas said that the incident occurred on Monday at about 4 p.m when the Joint Security TaskForce, comprising the police and the local vigilantes were on routine patrol of the area.\nHe said that scores of the gunmen were equally neutralised during the gun battle that lasted for hours.\n“The exchange of gun fire between the gunmen and the Joint Security TaskForce led to the killing of three policemen and two local vigilantes while others sustained various degree of injury,” he said.\nHe noted that the Joint Security TaskForce had earlier on Sunday morning foiled an attack by another group of gunmen after about two hours of gun battle at Bari village, along Tegina-Kontagora road."
  },
  {
    "headline": "Lagos shuts six lounges, night clubs",
    "summarized_story": "The Lagos State Safety Commission has sealed 6 lounges and night clubs in Ikeja as part of its 2022 Zero Accident Campaign (ZAC).\nThe campaign aimed to ensure that all work places and public facilities were safe for all visitors and workers alike.\nThe Director General and Chief Executive Officer, Lagos State Safety Commission, Lanre Mojola decried that the action on some bar, lounges and night clubs became necessary due to their contravention to the state government’s regulations despite several efforts to ensure complaints.\nHe reiterated that similar enforcement exercises would take place across the state as the Lagos State Safety Commission would continue to discharge her duties, especially when implementing the laws of the Commission towards a safer Lagos for all.\nThe Director-General implored all business entities to regularise their safety management documentation towards achieving safer public places across the state."
  },
  {
    "headline": "Singer Davido Blasts His Cousin, Dele Adeleke Over Osun Governorship Election",
    "summarized_story": "Nigerian singer, David Adeleke better known as Davido has thrown a subtle shade at one of his cousins, Dele Adeleke for publicly declaring his interest to run for the gubernatorial elections in Osun state.\nOn his Twitter page Davido said;Wonderful!\n@deleadeleke001NEWS DIRECT also gathered that recently PDP gubernatorial aspirant and Nephew to Senator Ademola Adeleke, Dele Adeleke, posted on his Twitter page and wrote“Intelligence & Understanding can not be falsified, stolen or handed to anyone on a silver platter.\nWe can do better in Osun state!\n#IgbaOtunTiDe”Davido also wrote on his insta story declare his support for his uncle, Ademola Adeleke as “incoming Governor of Osun state."
  },
  {
    "headline": "‘I Don’t Want To See Him In These Clothes Again’ — Judge Hits DSS Over Nnamdi Kanu’s Outfit",
    "summarized_story": "‘I Don’t Want To See Him In These Clothes Again’ — Judge Hits DSS Over Nnamdi Kanu’s OutfitBinta Nyako, judge of an Abuja federal high court, has ordered the Department of State Services (DSS) to allow Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), to change his clothes.\nPreviously, Nyako had directed the DSS to allow the IPOB leader to have a bath whenever he wants to, change his clothes, eat properly and practice his faith.\nHowever, at the court session on Tuesday, Mike Ozekhome, Kanu’s lead counsel, complained that his client is still being subjected to poor treatment in DSS custody.\nHe said Kanu is still being kept in solitary confinement and that any other detainee who greets him is also kept in solitary confinement.\nHowever, she reiterated her previous order that the IPOB leader should be allowed the maximum comfort possible, including changing his Fendi outfit with which he was brought back into the country in June 2021."
  },
  {
    "headline": "BREAKING: Osinbajo In Kano For Ahmadu Bello Memorial Lectures",
    "summarized_story": "Vice President Yemi Osinbajo on Tuesday stormed Kano for this year Ahmadu Bello Memorial Lectures holding at the Coronation Hall, Government House, Kano.\nSir Ahmadu Bello, the first Premier of Northern Nigeria was assassinated at 56 during the military coup in 1966.\nThe Vice President shortly after a brief airport ceremony proceeded to the residence of AlWan Ahmad Hassan located at Dakata General area of the metropolis.\nAlwan Ahmad Hassan is an influential member of the New Tribe, pro-Osinbajo group, campaigning that staged a historic meet in Kano last week.\nThe New Tribe is the apex body angling for Professor Yemi Osinbajo to succeed his principal, President Muhammadu Buhari in 2023."
  },
  {
    "headline": "BREAKING: Court Adjourns Nnamdi Kanu’s Trial Till Wednesday",
    "summarized_story": "On Tuesday, the Federal High Court in Abuja deferred further proceedings in the case against Nnamdi Kanu, the jailed leader of the Indigenous People of Biafra, IPOB.\nKanu had complained that the Federal Government had failed to serve him the new 15-count amended charge it had filed before the court in a timely manner, prompting the adjournment.\nThe modified charge was delivered on them only 24 hours before the planned hearing, according to Ozekhome, SAN.\nMeanwhile, before adjourning the case till Wednesday, trial Justice Binta Nyako, ordered the Department of State Services, DSS, to allow Kanu to have a change of cloth.\nAlso make sure that you allow him to exercise”, Justice Nyako added."
  },
  {
    "headline": "Breaking: Ghana crash out of AFCON 2021",
    "summarized_story": "Four-time Africa Cup of Nations winners Ghana have crashed out of the 2021 edition after losing 2-3 to debutants and Island Comoros on Tuesday.\nDetails loading…"
  },
  {
    "headline": "Breaking: At last, NBBF announces date for elective congress, writes FIBA",
    "summarized_story": "The Nigeria Basketball Federation (NBBF) has written to the International Basketball Federation (FIBA) stating that the date for the NBBF elective Congress has been scheduled for January 31.\nThe schedule for the elective Congress was sequel to FIBA’s earlier directive, and eventual recommendation by the NBBF reconciliation committee.\nAccording to an information obtained by Blueprint on Tuesday, the elective congress will take place in Abuja.\nA close source to the Federation who revealed this said the Secretary-General of NBBF, Mrs Olabisi Afolabi, on January 17 wrote to FIBA to inform them about the date of the congress, and invited FIBA delegation to monitor the election.\nDetails loading…"
  },
  {
    "headline": "Again, Senate President reveals when NASS will pass Electoral Act Amendment bill",
    "summarized_story": "The President of the Senate Mr Ahmad Lawan said Tuesday that the two chambers of the National Assembly would pass the Electoral Act (Amendment) Bill on Wednesday, January 19, 2022.\nAnd I hope that before the end of the week, the bill could be brought back to Mr. President for his assent.\n“But one thing I’m sure by the grace of God is we are passing the bill, the Electoral Act Amendment Bill 2010, tomorrow Wednesday the 19th in both chambers.\nBy tomorrow, we will be able to pass that bill for Mr. president to assent to it.\nThe Senate President said Nigerians have raised concern that the Electoral Act Amendment Bill contains many flaws which the lawmakers need to address."
  },
  {
    "headline": "VIDEO: Bandits Killed Over 200, Invaded 300 Niger Communities In 17 Days – Governor",
    "summarized_story": "No fewer than 200 people, including security operatives, have been killed in various attacks by bandits on communities in Niger State this month alone.\nThe state governor, Abubakar Bello, disclosed this on Tuesday shortly after he met with President Muhammadu Buhari at the Aso Villa in Abuja.\n“Within the same period, not less than 300 communities have been invaded by bandits.\n“We will try to discourage them (residents) from paying such ransoms because even when they pay ransoms, it doesn’t stop bandits from attacking them again.\n“When you pay levies to bandits, they use such money to purchase weapons and they come back to attack you.”"
  },
  {
    "headline": "Nnamdi Kanu’s Trial Adjourned As He Objects To Fresh Charges",
    "summarized_story": "The trial of the leader of the proscribed Indigenous People Of Biafra (IPOB), Nnamdi Kanu stalled on Tuesday after he objected to the fresh charges brought against him by the Federal Government.\nThe Federal Government had filed fresh terrorism charges against the detained IPOB leader before the Federal High Court in Abuja on Monday.\nThe action increased the initial counts bordering on treasonable felony and terrorism against Kanu from seven to 15.\nRead Also: Heavy Security As Nnamdi Kanu’s Trial ResumesBut during his trial, which was held amid heavy security presence, Kanu objected to the fresh charges.\nEarlier in the day, one of the Lead counsels for the IPOB Leader, Ifeanyi Ejiofor, announced that Human Rights Lawyer, Mike Ozekhome (SAN), will now lead the delegation of lawyers representing Kanu."
  },
  {
    "headline": "APC Convention To Hold February 26 – Buni",
    "summarized_story": "﻿The All Progressives Congress (APC) Caretaker Committee Chairman Mai Mala Buni has announced February 26 as the date for the APC convention.\nBuni, who is also the governor of Yobe State, said this on Tuesday at the national progressive women conference 2022 held at the International Conference Centre (ICC) in Abuja.\nHe said the party is counting on the support of women to hold a successful convention.\nBuni’s announcement comes less than 48 hours after APC governors met behind closed doors at the Kebbi Governors Lodge in Abuja.\nThe governors also passed a vote of confidence on the caretaker committee of the party, led by the Yobe State Governor, Mai Mala Buni."
  },
  {
    "headline": "Reps To Amend Mode Of Primaries In Electoral Bill On Wednesday – Gbajabiamila",
    "summarized_story": "The House of Representatives is set to amend the provision of Direct Primaries in the Electoral Act Amendment Bill.\nSpeaker of the House of Representatives, Femi Gbajabiamila disclosed this on Tuesday in his welcome remarks to members of the House.\nThe speaker said the version of the bill circulating is not the same as the version sent to President Muhammadu Buhari.\nBefore the holiday, they had deliberated on and passed some important bills including the controversial Electoral Act Amendment Bill.\nPresident Buhari had earlier withheld his assent to the bill citing the cost of conducting direct primary elections, security challenges, and possible manipulation of electoral processes by political actors as reasons."
  },
  {
    "headline": "Nigeria Receives 3.2 Million Pfizer COVID-19 Vaccines From U.S.",
    "summarized_story": "Nigeria has received 3.2 million Pfizer COVID-19 vaccines donated by the United States as authorities step up efforts to curb the spread of the disease in the country.\n“The latest shipment reflects the United States’ commitment to purchase and donate 1.2 billion COVID-19 vaccine doses worldwide.\nTo date, the United States has delivered more than 370 million vaccine doses to over 110 countries.\nThis includes the over 24.7 million U.S-donated doses of COVID-19 vaccines to the Nigerian people.”According to the statement, all Pfizer and Moderna COVID-19 vaccine doses donated by the U.S. to Nigeria have had an expiration deadline of at least six months or more upon receipt to ensure adequate time for use.\nThe U.S. government urges all Nigerians to go out and get vaccinated to make themselves safe and make use of the donated COVID-19 vaccines,” the statement added."
  },
  {
    "headline": "APC Sets February 26th for its National Convention -",
    "summarized_story": "Nigeria’s governing party, the All Progressives Congress, has set 26th of February as the date to hold it’s National Convention.\nThe National Chairman of the APC Caretaker Extraordinary Convention Planning Committee, Governor Mai Mala Buni stated this in his speech at the Progressives Women’s Conference holding Abuja, Nigeria."
  },
  {
    "headline": "Wrong version of Electoral Act Amendment bill sent to President Buhari",
    "summarized_story": "The House of Representatives will re-introduce the Electoral Act Amendment Bill at Wednesday plenary.\nSpeaker of the House, Femi Gbajabiamila, made this known as he welcomed his colleagues to 2022 legislative business.\nThe Speaker also expressed concerns about the errors purported to be in the Bill sent to Mr. President for assent, insisting a different version might have been transmitted.\nHe assured Nigerians the Constitution Amendment Bill would be ready for the concurrence of the States Houses of Assembly before end of February."
  },
  {
    "headline": "Aggrieved PDP Governorship aspirants protest in Ado Ekiti -",
    "summarized_story": "PDP Governorship Aspirants,Biodun Olujimi and Segun Oni Leads Protest Against Former Governor Ayodele Fayose Accusing him of Hijacking the Ward Congress Held on Saturday 15th January 2022.\nSome Party Faithfuls Joined the Protest this morning calling for the indefinite Suspension of Fayose from the PDP.\nThe Party Leaders accused Fayose of Sabotaging the Efforts of the Party by collating Ward Excos at a Private Event Center Owned by Him while the real Congress was ongoing in the 177 Wards of the State.\nThey Therefore Urged the National Working Committee to disregard any Purported List sent by Ayodele Fayose to the Party Secretariat in Abuja as they declared that there is no Congress Held in the State."
  },
  {
    "headline": "Group commends Taraba for implementing people-oriented projects -",
    "summarized_story": "A Coalition of Hausa-Fulani socio-cultural groups in Taraba state has passed a vote of confidence in Governor Darius Ishaku’s government for implementing people-oriented projects."
  },
  {
    "headline": "Osita Okechukwu: The Contentiousness in the APC is Very healthy – Arise News",
    "summarized_story": "The ruling All Progressives Congress is expected to hold its national convention for the selection of national executives of the party on February 26th and 27th.\nWith the dates now cast in stone, the APC Caretaker/Extraordinary Convention Planning Committee led by Yobe State Governor, Mai Mala Buni, is expected to meet today to work out the modalities for the convention and the mode of primaries for the selection of the party’s national executive.\nARISE is joined by Osita Okechukwu, the Director General of Voice of Nigeria and a founding member of the All Progressives Congress, to discuss the resolve of the ruling party to forge ahead with its convention."
  },
  {
    "headline": "Nigeria: Governing Party APC to Hold National Convention February 26",
    "summarized_story": "The Chairman APC Caretaker Extraordinary Convention Planning Committee and Yobe State Governor, Mai Mala Buni, has declared February 26 as the date for the party’s National Convention.\nThis was revealed in statement signed byDG Press and Media Affairs to the Governor, Mamman Mohammed.\nDetails later…"
  },
  {
    "headline": "Nnamdi Kanu Faces Fresh Terrorism Charge – Trending with Ojy Okpe",
    "summarized_story": "The leader of the Indigenous People of Biafra Nnamdi Kanu is facing fresh charges bordering on alleged terrorism filed before a federal high court in Abuja.\nThe IPOB leader, who Is currently in the custody of the Department of State Services had been rearraigned in October 2021 on a seven-count charge.\nMeanwhile the minister of interior Rauf Aregbesola stirred up controversy on Monday after he ordered officers of a correctional facility to kill any intruder attacking the facility.\nThe minister gave the order while inspecting the Agodi Custodial Centre in Ibadan the Oyo state capital.\nThe speaker, during his speech at the University of Lagos convocation ceremony noted that raising the minimum academic requirement for the office of the president will help to reform the electoral system."
  },
  {
    "headline": "Claim That UK PM Johnson Lied About Lockdown Party is Nonsense, Deputy Says",
    "summarized_story": "A claim by a former senior adviser to Boris Johnson that the British prime minister lied to parliament about not knowing about a lockdown party in Downing Street is nonsense, his deputy said on Tuesday.\nAsked if the prime minister’s premiership was over if it could be proved that he had lied to parliament, Deputy Prime Minister Dominic Raab said: “Look, the suggestion that he’s lied is nonsense.\nAsked if Johnson should resign if he had lied, Raab said he would not speculate about hypotheticals.\nCummings said that after Reynolds was told to cancel the invite by at least two people, Reynolds checked with Johnson if it should go ahead.\nHowever, the scandals have seen Johnson’s personal ratings plummet and support for his Conservative Party has sunk in opinion polls."
  },
  {
    "headline": "China Media Say Foreign Parcels Suspected in New Infections",
    "summarized_story": "Chinese state media report parcels mailed from overseas may have spread the omicron variant of the coronavirus in Beijing and elsewhere.\nGlobally, health experts have stressed the virus mainly spreads through respiratory droplets when infected people breathe, speak, cough and sneeze.\nThe Beijing Games organizers announced Monday that only “selected” spectators will be permitted at the events that officially open Feb. 4.\nBeijing had already announced that no fans from outside the country would be permitted and had not offered tickets to the general public.\nJust one additional case was reported in the city among China’s total of 127 new domestically transmitted cases announced on Tuesday."
  }
]