[
  {
    "headline": "Twitter appeals French court ruling on anti-hate speech",
    "summarized_story": "Twitter has appealed a French court decision that ordered it to give activists full access to all of its relevant documents on efforts to fight hate speech, lawyers and a judicial source said on Saturday.\nIn July, a French court ordered Twitter to grant six French anti-discrimination groups full access to all documents relating to the company’s efforts to combat hate speech since May 2020.\nThe six anti-discrimination groups had taken Twitter to court in France last year, accusing the US social media giant of “long-term and persistent” failures in blocking hateful comments from the site.\nLike other social media giants it allows users to report posts they believe are hateful, and employs moderators to vet the content.\nBut anti-discrimination groups have long complained that holes in the policy allow hateful comments to stay online in many cases."
  },
  {
    "headline": "I’m healthy, just undergoing therapy, Tinubu tells northern lawmakers",
    "summarized_story": "All Progressives Congress chieftain, Bola Tinubu, says he is healthy but only undergoing physiotherapy in London.\nTinubu said this while addressing members of the House of Representatives northern caucus that visited him in London on Friday.\nThe former governor, who has been in the United Kingdom for the last three months since undergoing knee surgery, however, said he was undergoing physiotherapy which he described as “gruesome”.\nAddressing the gathering, Tinubu who was dressed in kaftan and a red cap said, “Because of God and people like you, I am well.\nReno Omokri, a former aide to ex-President Goodluck Jonathan, said should Tinubu become President in 2023, he would continue Buhari’s tradition of seeking treatment abroad at the expense of taxpayers."
  },
  {
    "headline": "Olawale, NECA’s D-G is dead",
    "summarized_story": "Dr. Timothy OlawaleThe Nigeria Employers’ Consultative Association, NECA, has announced the death of its Director-General, Dr Timothy Olawale.\nNECA Secretariat said in a statement issued in Lagos on Saturday that Olawale passed on, on Friday, October 1 in a hospital in Abuja.\n“It is with deepest sadness that we announce the passing of Dr. Timothy Olawale, our Director-General, which occurred on October 1 at a hospital in Abuja.\nThe statement added that the association was in contact with the family and more information would be communicated in due course.\nLate Dr. Olawale was confirmed as the substantive Director-General of NECA in January 2019, after six months in acting capacity."
  },
  {
    "headline": "Borno demolishes illegal shops, ‘igbo’ dealers’ dens",
    "summarized_story": "By Ndahi Marama, MaiduguriBorno State Ministry of Environment, headed by Kaka Shehu Lawal, has embarked on demolition of illegal structures and all makeshift/container shops along major streets in Maiduguri metropolis, Jere and Konduga Local Government areas.\nThey cleared all makeshift shops at the Legacy Garden Housing Estates Gate situated at the heart of Bulumkutu ward of the metropolis, which harbours quite a number of Indian hemp dealers/consumers.\n“Most of these shanties and illegal structures are occupied by miscreants and hoodlums who terrorised innocent citizens around, snatching of cellphones and dispossesing people of their belongings even in a broad daylight and late at night.\n“It was an eyesore with these miscreants and their collaborators freely smoking and selling illegal drugs and other substances including prostitution by underage boys and girls in the state.\nOur correspondent observed that hundreds of illegal structures and makeshift shops were pull down by the Task Force during the four hours clampdown."
  },
  {
    "headline": "2023: Top Kunav Guber aspirants in talks with Akume",
    "summarized_story": "By Tordue SalemBenue Guber Aspirants from Vandeikya under the auspices of JKP Initiative have held talks with the leader of the All Progressives Congress, APC in Benue State, and Minister of Special Duties and Intergovernmental Affairs, Dr George Akume ahead of the primaries in 2022.\nTop governorship aspirants on the platform on Thursday, 30th September 2021 paid a visit to the Minister to pledge their loyalty to him and the party, on the occasion of the 61st Independence Day.\nThe Governorship aspirants include Prof. Terhemba Shija, ESV Godwin Ityoachimin Dr. Jeffrey Kuraun, Arc.\nThe Minister, received with warmth and enthusiasm, the idea of the next governor of Benue State, of Kunav (Vandeikya)extraction.\nThe Governorship aspirants at the meeting also threw their weight behind the ambition of the former Sen. Akume to be the next National Chairman of the APC."
  },
  {
    "headline": "NSCDC confirms alleged killing of herdsman by unknown gunmen in Kwara",
    "summarized_story": "The Nigeria Security and Civil Defence Corps (NSCDC), Kwara Command has confirmed the alleged killing of a herdsman by yet to be identified gunmen in the state.\nThis is contained in a statement signed by the Command Spokesman, Mr Babawale Afolabi, and made available to newsmen in Ilorin on Friday evening.\n“The report of the deceased was brought to our office on Friday, through our Divisional Officer in Oro Ago, Officer Najimu Lawal.\n“This Fulani herdsman, simply known as Ibrahim or lbro, was attacked and hacked to death by the assailants,” he said.\nHe assured that the NSCDC in collaboration with other security agencies would arrest the perpetrators and ensure prosecution after investigations."
  },
  {
    "headline": "APC won’t hijack Nigeria like you attempted with PDP, Nwodo blasts Modu Sheriff",
    "summarized_story": "By Ikechukwu Odu, NSUKKAThe former National Chairman of Peoples Democratic Party, PDP, Dr. Okwesilieze Nwodo, has said Nigerians would not allow the All Progressives Congress, APC, to hijack the nation the way Senator Ali Modu Sheriff attempted to hijack PDP, when he served as the National Working Committee chairman of the party.\nSheriff, a former governor of Borno State who is also jostling for the national chairmanship of APC, had said that the party needed rugged captain to remain in power for the next 50 years.\nYou would be surprised that APC would not stay more than two years in power.\n“Sheriff is my very good friend and I want to tell him that he has failed in this prediction just the way he failed to hijack PDP.\n“Nigerians are sick and tired of APC and cannot wait to vote them out in 2023,” he said."
  },
  {
    "headline": "Kwara govt signs first phase of minimum wage agreement with labour union",
    "summarized_story": "Kwara State government has signed the long-awaited minimum wage agreement with the labour unions in the state.\nHowever, the signed agreement, holds that the consequential adjustment would be implemented “as would be agreed upon by the minimum wage committee” amid ongoing negotiations between the two parties.\n” Today, we were able to sign that leg of the minimum wage agreement which affects only grade levels 01-06.\n” You know there are two legs under it, the new minimum wage and the consequential adjustment is still going on,” he stated.\nMinimum wage: Buhari approves payment of upward adjustment to pensioners"
  },
  {
    "headline": "Osinbajo heads to Sao Tome and Principe",
    "summarized_story": "Vice President Yemi Osinbajo has left Nigeria for São Tomé and Principe.\nThe VP will attend the inauguration of Carlos Manuel Vila Nova, the newly elected President.\nOsinbajo will join other Heads of State and government, especially from Africa, spokesman Laolu Akande said.\nOsinbajo was accompanied by the Foreign Affairs Minister of State, Zubairu Dada.\nSão Tomé and Príncipe, an African island nation close to the Gulf of Guinea, has a population of 220,000."
  },
  {
    "headline": "Recently signed petroleum industry bill, another recipe for anarchy – Gov Diri",
    "summarized_story": "Bayelsa State Governor, Douye Diri, has said the recent passage of the Petroleum Industry Acts (PIA), by President Muhammadu Buhari, is a recipe for anarchy in the country.\nDiri claims the passage is yet another step taken to subordinate oil-producing states, making it more like a subordinate and superordinate relationship.\nThe governor noted that there’s a missing gap in the relationship of the state, the Niger Delta region and the government at the centre.\nDiri made the remark on Friday evening during the Independence Anniversary Dinner celebration at the DSP Alamieaeigha banquet hall, Yenagoa, the state capital.\nI have always reminded people that for those who make peaceful change impossible, violent change becomes inevitable."
  },
  {
    "headline": "Unknown gunmen atrocities in Anambra rubbish Obiano’s ‘safest state’ claims – Christian",
    "summarized_story": "A public affairs commentator, Chima Christian has lambasted Anambra Governor, Willie Obiano over the activities of ‘unknown gunmen’ (UGM).\nIn a reaction to UGM’s atrocities, Christian mocked Obiano for repeatedly describing Anambra as the “safest state”.\nOn Saturday, Christian made a Facebook post titled ‘Unknown gunmen and Obiano’s government of hypes’.\n“Anambra’s “safest state” nomenclature is fast revealing itself to be another one of those Gov.\nObiano’s hypes”, he wrote."
  },
  {
    "headline": "Nigeria@ 61: President Buhari's speech turned blind eye to country's reality - CAN",
    "summarized_story": "The Christian Association of Nigeria, Kaduna State has said that President Buhari’s speechwriters are truly the enemies of Nigeria, saying that they are only after what they want and get.\nJohn Joseph Hayab said the pains and sufferings of Nigerian masses are secondary to them.\n“Every year our leaders will find a word that they will use to hide their failure in the fight against banditry and insecurity generally.\nWe have moved from technical defeat to taking the fight against insecurity to the enemy and winning,” he said.\n“Nigerians also want to know the sponsors of bandits, kidnappers and Boko Haram,” he added."
  },
  {
    "headline": "Dr Olawale, NECA D-G is dead",
    "summarized_story": "Agency Reporter- Advertisement -The Nigeria Employers’ Consultative Association (NECA) has announced the death of its Director-General, Dr Timothy Olawale.\nNECA Secretariat said in a statement issued in Lagos on Saturday that Olawale passed on, on Friday, Oct. 1 in a hospital in Abuja.\n“It is with the deepest sadness that we announce the passing of Dr Timothy Olawale, our Director-General, which occurred on Oct. 1 2021 at a hospital in Abuja.\nThe News Agency of Nigeria (NAN) reports that the late Dr Olawale was confirmed as the substantive Director-General of NECA in January 2019, after six months in an acting capacity.\nHe succeeded Mr Segun Oshinowo, who retired in December 2018 after serving the association for 19 years."
  },
  {
    "headline": "Judges issuing conflicting orders selfish- Katsina CJ",
    "summarized_story": "By Augustine Okezie, Katsina- Advertisement -The Chief Judge of Katsina State Justice Musa Danladi Abubakar has accused judges issuing conflicting orders and judgments of being driven by selfishness and unethical mind-setsAbubakar told The Nation the issue of territorial and court jurisdiction is already settled in law, adding that those who violate such laws should face the music.\n‘’I think its selfishness, it’s unethical but you know if you do something like that, you are ready to face the consequences.\n“We have high ethics in the judiciary and work hand in hand in everything we do, every judge knows the standard and code of conduct’’.\n“It’s embarrassing when a person is a victim of crime and he has to pay the police in order to be investigated.\nOn the lack of personnel in the Judiciary required to handle cases and the needs for the appointment of more judges, he said the enormous workload awaiting the attention of judges, requires additional hands."
  },
  {
    "headline": "Acting VC, 15 Profs battle for UI vice-chancellor seat",
    "summarized_story": "A Town-Hall meeting organised by the UI Community Forum tagged “The Voice of the Next UI VC, Who is Next?” is scheduled to hold on Monday, October 4.\nTo Muslim groups, in the last 73 years, no Muslim professor has been elected as the VC of the institution.\nThe 16 contestants will on Monday present their agenda to the university community, via Zoom (virtual platform).\nREAD ALSO: Mixed reactions trail conditional lifting of Twitter banThe UI Community Forum established in 2000, has maintained a culture of having a town-hall meeting with aspirants to the position of the Vice-Chancellor of the University.\nIt was learnt that the Acting Vice Chancellor of the institution, Professor Babatunde Ekanola, has joined the race."
  },
  {
    "headline": "BREAKING: Abducted two general regains freedom",
    "summarized_story": "), who was abducted on Monday in the Ajah area of Lagos State, has regained freedom, The Sun has learnt.\nIt was learnt that the retired two star general was released in the early hours of Saturday.\nThe gunmen were said to have whisked him away in a waiting speedboat, after which they sped off.\nAccording to an SOS voice note shared by his driver, Corporal Odiji, the retired AVM engaged in a struggle with the gunmen before he was subdued.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "NECA DG, Olawale, slumps and dies in Abuja – The Sun Nigeria",
    "summarized_story": "Get paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars.\nClick here to apply today.\nBimbola OyesolaThe Director General of the Nigerian Employers Consultative Association (NECA) Timothy Olawale slumped and died in Abuja last night.According to a top management staff of NECA, Olawale, who was in Abuja for a meeting with the board of the Industrial Training Fund (ITF) in the course of the meeting.The NECA DG attended a meeting on Thursday in Abuja and later attended another meeting on Friday and was on his seat when he could not get up and before help could get to him, he was gone.Olawale was confirmed as the substantive Director General of the employers body in January 2019, after six months in acting capacity.He took over from Mr. Segun Oshinowo, who retired in December, 2018 after serving the Association for 19 years as Director General."
  },
  {
    "headline": "Kanu, Igboho: Southern, M’Belt groups slam Buhari",
    "summarized_story": "It said as a show of good faith, President Bihari should engage agitators across the country in a genuine dialogue.\nWe are asking him to just tell us the offence that Chief Sunday Igboho has committed up till this time.\nI want to ask again, is there any court of competent jurisdiction in Nigeria where Sunday Igboho is standing trial?\n“President Buhari is just trying to entertain himself and his people.\nPan Yoruba socio cultural organisations, Afenifere also called on President Buhari to eschew nepotism, be more sincere and live up to his words that his administration will listen to the people."
  },
  {
    "headline": "Ayo Adebanjo: Let’s restructure or break Nigeria",
    "summarized_story": "All the times we have been saying, we don’t want this constitution because it is oppressive and one sided.\nI’m say- ing it aloud and clear, they should resist it and say no.\nI repeat, we either restructure the country or break the country.\nThat is why I’m saying what I’m saying.\nI did not beg to be in Nigeria because I was not consulted to be in Nigeria."
  },
  {
    "headline": "General Abdulsalami Abubakar: Only justice, equity, fairness can stop agitations for secession",
    "summarized_story": "Yes, I think we have come a long way as a nation.\nRemember, nation building is not an easy thing, especially where you have more than 250 ethnic groups with each and every one of them yearning for a place in governance.\nWhen you look back 61 years ago, since the colonial masters left the country, you will say that we have something to celebrate as a nation.\nAfter the civil war, and before the current insecurity in the country, Nigerians have been living peacefully with each other with a lot of inter marriages, so I think we have something to celebrate as a country at 61."
  },
  {
    "headline": "REVEALED: Face Of Boko Haram, ISWAP Operational Commander Who Masterminded Killing Of Nigerian Soldiers, Civilians",
    "summarized_story": "A picture of the dreaded commandant of the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād in Borno State, Abubakar Dan-Buduma, has been released.\nHe is said to have killed so many Nigerian soldiers and civilians during different attacks by the terrorist group.\nUnconfirmed report has it that Dan-Buduma was recently arrested by the Nigerian Army in Sambisa forest, Borno State.\nSee Also Boko Haram ISWAP-Boko Haram Reshuffles 'Cabinet', Imposes Levies On Agricultural, Trade Activities In Nigerian CommunitiesISWAP, which split from the mainstream Boko Haram in 2016, has become a dominant group, focusing on military targets and high-profile attacks, including against aid workers.\nThe terror group has caused over 50,000 deaths and displaced millions of individuals mainly in Adamawa, Borno, and Yobe states."
  },
  {
    "headline": "REVEALED: Face Of Boko Haram, ISWAP Operational Commander Who Masterminded Killing Of Nigerian Soldiers, Civilians",
    "summarized_story": "A picture of the dreaded commandant of the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād in Borno State, Abubakar Dan-Buduma, has been released.\nHe is said to have killed so many Nigerian soldiers and civilians during different attacks by the terrorist group.\nUnconfirmed report has it that Dan-Buduma was recently arrested by the Nigerian Army in Sambisa forest, Borno State.\nSee Also Boko Haram ISWAP-Boko Haram Reshuffles 'Cabinet', Imposes Levies On Agricultural, Trade Activities In Nigerian CommunitiesISWAP, which split from the mainstream Boko Haram in 2016, has become a dominant group, focusing on military targets and high-profile attacks, including against aid workers.\nThe terror group has caused over 50,000 deaths and displaced millions of individuals mainly in Adamawa, Borno, and Yobe states."
  },
  {
    "headline": "BREAKING: Bandits Burn 10 Alive, Slaughter 15 Others In Niger State Community",
    "summarized_story": "Gunmen suspected to be bandits have burnt 10 people alive in the Kachiwe community in Sarkin Pawa Ward of the Munya Local Government Area of Niger State.\nThe gunmen also abducted about seven women during the attack.\nThe Secretary of Munya Local Government Area, James Jagaba, narrated the ordeal which he described as ‘an ugly incident’.\nHe said, “The bandits set all the houses ablaze, burnt 10 people alive, abducted seven women and slaughtered the others.\nIn the process, three of the abducted women escaped and the bandits went with the other seven women."
  },
  {
    "headline": "BREAKING: Bandits Burn 10 Alive, Slaughter 15 Others In Niger State Community",
    "summarized_story": "Gunmen suspected to be bandits have burnt 10 people alive in the Kachiwe community in Sarkin Pawa Ward of the Munya Local Government Area of Niger State.\nThe gunmen also abducted about seven women during the attack.\nThe Secretary of Munya Local Government Area, James Jagaba, narrated the ordeal which he described as ‘an ugly incident’.\nHe said, “The bandits set all the houses ablaze, burnt 10 people alive, abducted seven women and slaughtered the others.\nIn the process, three of the abducted women escaped and the bandits went with the other seven women."
  },
  {
    "headline": "Incompetence, Impunity And Inordinate Ambition Brought Us Here By Sesugh Akume",
    "summarized_story": "Bad, inconsistent and contradictory policies; haphazard implementation, politics, incompetence, illegality, impunity brought us here.\nWhen the State Security Services (SSS) physically went after bureau de change operators in an ostensible attempt to defend the naira, Emefiele supported it.\nFollowing the #EndSARS protests, Emefiele had bank accounts of suspected protesters sealed by the courts of bogus, malicious charges.\nIn 2020, Emefiele and the Bank lent N2.8 trillion representing 62% of 2019 revenues, and plan to continue doing so.\nSesugh Akume, a public policy analyst, wrote from Abuja."
  },
  {
    "headline": "Timothy Olawale, NECA DG, is dead",
    "summarized_story": "Timothy Olawale, director-general of the Nigeria Employers’ Consultative Association (NECA), is dead.\nAdvertisementAccording to a statement issued by the NECA secretariat, Olawale died on Friday at an undisclosed hospital in Abuja.\n“It is with the deepest sadness that we announce the passing of Dr Timothy Olawale, our Director-General, which occurred on Oct. 1 2021, at a hospital in Abuja,” the statement reads.\nThe late Olawale was confirmed as the substantive director-general of NECA in January 2019, after six months in an acting capacity.\nHe succeeded Segun Oshinowo, who retired in December 2018 after serving the association for 19 years."
  },
  {
    "headline": "Timothy Olawale, NECA DG, is dead",
    "summarized_story": "Timothy Olawale, director-general of the Nigeria Employers’ Consultative Association (NECA), is dead.\nAdvertisementAccording to a statement issued by the NECA secretariat, Olawale died on Friday at an undisclosed hospital in Abuja.\n“It is with the deepest sadness that we announce the passing of Dr Timothy Olawale, our Director-General, which occurred on Oct. 1 2021, at a hospital in Abuja,” the statement reads.\nThe late Olawale was confirmed as the substantive director-general of NECA in January 2019, after six months in an acting capacity.\nHe succeeded Segun Oshinowo, who retired in December 2018 after serving the association for 19 years."
  },
  {
    "headline": "Gunmen abduct Niger permanent secretary, son",
    "summarized_story": "Ibrahim Garba Musa, the permanent secretary in Niger’s ministry of transportation, has been abducted by gunmen.\nAdvertisementMusa was abducted alongside his son in the early hours of Saturday.\n“The gunmen attacked around 1am, and abducted the permanent secretary with his son,” a source said.\nMary Noel-Berje, chief press secretary to Abubakar Sani Bello, governor of the state, confirmed the incident.\nAbout 27 students were kidnapped in Kagara in February while over 100 Islamiyya school pupils were abducted two months later."
  },
  {
    "headline": "Gunmen abduct Niger permanent secretary, son",
    "summarized_story": "Ibrahim Garba Musa, the permanent secretary in Niger’s ministry of transportation, has been abducted by gunmen.\nAdvertisementMusa was abducted alongside his son in the early hours of Saturday.\n“The gunmen attacked around 1am, and abducted the permanent secretary with his son,” a source said.\nMary Noel-Berje, chief press secretary to Abubakar Sani Bello, governor of the state, confirmed the incident.\nAbout 27 students were kidnapped in Kagara in February while over 100 Islamiyya school pupils were abducted two months later."
  },
  {
    "headline": "Sanusi: Fuel subsidy is a scam, some people in power making billions of dollars from it",
    "summarized_story": "Muhammadu Sanusi II, former Emir of Kano, says payment of fuel subsidy by the federal government is a “scam”, saying some people in power are making billions out of it.\nAdvertisementSpeaking on Arise Television on Friday, Sanusi said successive administrations continue with fuel subsidy payments despite damage to the nation’s revenue and economy.\nFuel subsidy also known as under-recovery is the underpriced sales of premium motor spirit (PMS), better known as petrol.\nI remembered in 2011 when we were talking about the fuel subsidy debate when President Jonathan rightfully wanted to remove the fuel subsidy.\n“The only reason it makes sense is that there are a number of people who control the levers of power, who are making billions and billions of dollars out of this scam that is called fuel subsidy."
  },
  {
    "headline": "Twitter ban in Nigeria to be lifted if certain conditions are met",
    "summarized_story": "Buhari listed these conditions during a broadcast to mark Nigeria’s 61st Independence anniversary on Friday, October 1.\nThe Nigerian government suspended Twitter’s operations in June, following the social media platform’s decision to delete a tweet by Buhari, which it said breached the site’s rules.\nThe state’s decision to ban Twitter triggered widespread criticism as online-based businesses recorded huge losses; lawsuits; and national assembly hearings meant to probe the circumstances leading to the ban.\n“The ban on Twitter will soon be lifted as we are getting close to reaching full agreement,” the minister said.\nHowever, the Buhari administration has always been keen on regulating social media and internet-based broadcasting companies."
  },
  {
    "headline": "Kola Aina appointed chair of new board at Lagos Angel Network",
    "summarized_story": "The Lagos Angel Network (LAN) has appointed a new Board of Governors (BoG) to oversee its affairs, effective from today October 1, 2021.\nLAN has also birthed several Angel groups such as Rising Tide Africa (RTA), South South-East Angels Network (SSEAN), Abuja Angels Network (AAN), and the Diaspora Angels Network (DAN).\n“We’ve seen the Lagos startup ecosystem grow significantly bigger than when we started LAN 10 years ago and need to do more.\nWe’ve seen what’s possible, and now it’s time to take Angel investing in Nigeria to the next level,” Sulaiman adds.\n“I want to thank the founding LAN Board whose achievements cannot be overstated, and their legacy is visible for all to see,” Aina says."
  },
  {
    "headline": "iOS 15 review: new features make iPhone a more powerful device",
    "summarized_story": "Apple released the iOS 15 on September 20, 2021, and it’s a super-smart operating system.\nUnlike the flashy update that happened from iOS 6 to iOS 7, iOS 15 debuts with subtle updates that form a more significant upgrade of iOS 14. iOS 15 is the perfect example of being loud without screaming: the new operating system improves your overall experience without altering your phone visually.\niOS 15 Focus mode lets you filter notifications based on your current engagement.\nBut iOS 15 gives you control by gathering your notifications in one place where you can view them at your own convenience.\nWith iOS 15, there’s a tool that lets you have different font sizes for different apps on your phone."
  },
  {
    "headline": "What can Nigerians do on the new eNaira website?",
    "summarized_story": "The website of Nigeria’s official digital currency, eNaira, went live on Monday, four days before its planned launch on October 1, as disclosed by Central Bank governor, Godwin Emefiele.\nA welcome note on the website describes the eNaira as a “Central Bank of Nigeria-issued digital currency that provides a unique form of money denominated in Naira.”The website is a central repository where users can find comprehensive information about the official digital currency, but it offers much more than just details of the eNaira.\nDownload the eNaira applicationThe eNaira app (termed “Speed”) can be downloaded from either the Google PlayStore, Apple App Store, or by scanning a QR code on the website.\nJoin the eNaira communityThe community is a social hub where, according to a note on the website, eNaira users across the globe can connect with one another, share their experiences using the digital currency, offer as well as request help.\nThe eNaira website is loaded with very important information and instructions as well as answers to potential questions in the FAQ section."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Update [ October 1, 2021 at 8:14 am.\nWAT] The eNaira website is now up The Central Bank of Nigeria (CBN) has postponed..."
  },
  {
    "headline": "#TwitterBan update: Should you worry if Twitter succumbs to Nigerian government’s demands?",
    "summarized_story": "Share this article:Again, Nigerians have been promised the lifting of the four-month-long Twitter ban.\nRecall that in early June 2021, the Nigerian government indefinitely suspended Twitter after the platform removed a Tweet by the president for violating its rules.\nTo that end, it is awaiting a response on three final requests made to the social media platform, which are registration, physical presence in Nigeria, and fair taxation.\nAfter all, it appears to be what the social media company would have agreed to before establishing an office in any country.\nTrue to this, the country is one of the African countries without any case of Internet censorship or government-influenced social media censorship."
  },
  {
    "headline": "Startup Acts: Can the decade’s sexiest law save Nigeria’s thriving but uncertain startup ecosystem?",
    "summarized_story": "Share this article:With Nigeria’s Startup Bill scheduled to be submitted in October 2021, @eruskkii spotlights the impact of startup acts in Africa, why Nigeria may never be ready for it and why the country needs one regardless.\nLoginJoin Now This is premium content, reserved for Pre-seed, Seed, and Series A members only.\nEmmanuel Paul Senior Reporter at Techpoint Africa | Website Writer and Narrator.\nTech, business and policy analysis is my daily bread.\nCatch up with me, @eruskkii, on Twitter or send a mail to emmanuel@techpoint.africaShare this article:"
  },
  {
    "headline": "More on NFTs, MIT’s prosthetic limbs project, Facebook’s Internet connectivity plan",
    "summarized_story": "Today I’m discussing:More on NFTsMIT’s 3D-printed prosthetic limbs in Sierra Leone2Africa Cable and Internet connectivityMore on NFTsNon-fungible tokens (NFTs) are digital assets that represent physical objects such as art, music, in-game items, and videos.\nAdvertisementAlthough they have been around since 2014, NFTs are gaining popularity as a popular way to buy and sell digital artwork.\nAccording to Facebook, when they are completed, the extension will make 2Africa the world’s longest subsea cable system.\nIn May 2020, Facebook announced plans to build a $1 billion undersea Internet cable for faster Internet access in Africa.\nFor context on Subsea Internet Cables in Africa, please, read: Subsea Internet cables and the race to connect Africa to the InternetWhat I’m reading and watchingGoogle Maps is making it easier to see wildfires and tree coverage."
  },
  {
    "headline": "President Buhari’s Independence Day Address – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestINDEPENDENCE DAY ADDRESS BY HIS EXCELLENCY, MUHAMMADU BUHARI, PRESIDENT OF THE FEDERAL REPUBLIC OF NIGERIA ON THE OCCASION OF NIGERIA’S SIXTY FIRST INDEPENDENCE ANNIVERSARY, FRIDAY 1ST OCTOBER, 2021.\nSimilarly, on our approach to food security, I am proud to announce Nigeria has commenced its journey to pharmaceutical independence.\nEarlier this year, I launched the Integrated National Security and Waterways Protection Infrastructure, the Deep Blue Project, which is designed to secure Nigerian waters up to the Gulf of Guinea.\nBut we remain ready to take decisive actions against secessionist agitators and their sponsors who threaten our national security.\nNational Security and Cohesion;b."
  },
  {
    "headline": "PDP will return to power in 2023 – Wike …Receives Nwuke, Deeyah, others APC, AAC decampees – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestHarcourt Port – Rivers State governor, Nyeson Ezenwo Wike says Peoples Democratic Party (PDP) elected governors are working in unison to ensure that the party wins the presidential election in 2023.\nThe governor stated that PDP in the State has never been owned by an individual as is the case with the APC.\nAnd he challenged the remnants of the APC to mention what Federal government has done for Rivers state in the last six years.\nLet nobody bother himself, PDP will take over Rivers State again because it is very obvious.\nFormer Rivers State APC spokesperson, Ogbonna Nwuke, said in the last six years they have been in the wilderness."
  },
  {
    "headline": "BOWFT Update: Naija Ratels, others get consolation prizes, as overall prize money increases* – Nigerian Observer",
    "summarized_story": "The teams that got their consolation prizes were; Heartland Queens of Owerri, Naija Ratels of Abuja, Rolly Angels of Benin City, Fortress Ladies of Benin City, Royal Queens of Warri, Sunshine Queens of Akure, Confluence Queens of Lokoja, and Kaduna Queens.\nShe saw it all by herself in company of the Sports-loving Deputy Governor of Edo State, Rt.\nThe prize money for the fourth place winners is newly created.\nThe semi finals will be played on Saturday, October 2, at the Samuel Ogbemudia Stadium, with Bayelsa Queens slugging it out against FC Robo in the first semi finals at 3pm and Edo Queens battle against Rivers Angels in the second semi finals at 5pm.\nThe grand finale and closing ceremony hold on Sunday, October 3, at the Samuel Ogbemudia Stadium at 5pm."
  },
  {
    "headline": "BOWFT: Edo Queens thrash Heartland, set up semifinals clash with Rivers Angels …Mrs Shaibu Impressed with Tourney – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo Queens put an impressive performance today as they thrashed Heartland Queens 5-0 in the last match of Group A to set up a semi finals clash with NWFL champions Rivers Angels.\nThe coach Matthew Wmimo led Edo Queens could not have settled for anything less than such a 5-star performance as they played as they played in the presence of the Deputy Governor of Edo state and the first lady Betsy Obaseki.\nEdo Queens took the Owerri girls to the cleaners with five unreplied goals,courtesy Emmem Essien’s brace, Elizabeth Zirike’s second half long range stike and two ealy goals from Rebecca Ajumudaand Adaobi Okah respectively.\nEdo Queens won all their three group games with 10 goals scored .\nShe highlighted the huge benefits of the tournament to include continuous fight against girl child trafficking and abuse and promotion of women football in the country."
  },
  {
    "headline": "COVID-19: Get jab or get another job, UK minister tells care home staff",
    "summarized_story": "ADVERTISEMENTBritish care home workers who are not prepared to get the COVID vaccine should “get out and get another job,’’ Health Secretary Sajid Javid said on Saturday.\nBut in an uncompromising message to staff, Mr Javid said they should not be working in the sector if they were not prepared to be vaccinated.\n“If you are not going to get vaccinated then why are you working in care?\nI am very clear on that.’’Mr Ahmed said care homes have already overcome significant resistance among staff to the vaccines.\nIn November 2020, shortly before the vaccine programme launched, she said just 40 per cent of staff had said they would get it."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Help, our homes submerged in water – Eti-Osa community cries out to Sanwo-Olu",
    "summarized_story": "OBINNA EZUGWUConcerned residents of Lagos State domiciled within Eti-Osa Local Government, particularly Coastal area, have written a save our soul letter to the state governor, Mr. Babajide Sanwo-Olu over an ocean surge that has submerged several houses in the area.\nOladotun Hassan, Co-Convener and Secretary, Legal Affairs, said more than 1000 families have been displaced, while businesses have perished and houses submerged under the ocean water.\nThey said Communities around Lafiaji Community, Okun Ajah Community, Okun Mopo Community, and many more are currently endangered, and could be swept off if nothing urgently is done to stop the ongoing Ocean Surge in the community.\n“Your Excellency Sir, we are concerned citizens of Lagos State domiciled within Eti-Osa Local Government, particularly Coastal areas and affected communities around Okun Alfa axis(Alfa Beach) and its environs respectively,” the letter read.\n“As we speak, more than 1000 families are displaced, businesses perished and houses have been submerged under the ocean waters; Communities around Lafiaji Community, Okun Ajah Community, Okun Mopo Community, and many more are currently endangered and could be swept off if nothing urgently is done to avert the ongoing Ocean Surge in the community."
  },
  {
    "headline": "OAU shuts down Obafemi till further notice after students protest",
    "summarized_story": "The management of Obafemi Awolowo University (OAU), Ile Ife, Osun State, has announced that the University would be shut down till further notice from 12 noon on the 2nd of October 2021.\nThe decision follows protests by students over the death of Aishat Adesina, a 24-year old female, Part 4 student of the Department of Foreign Languages.\nAccording to him, all students are required to vacate their halls of residence and the campus, latest by 12:00 noon on Saturday, 2nd October 2021.\nThey added that Adesina had reported to the university’s Health Centre with signs and symptoms of a severe infection.\nThey stated that they are investigating the circumstances surrounding the immediate and remote cause(s) of the students’ protests, which means the swearing-in of the newly elected Students’ Union officials has been put on hold."
  },
  {
    "headline": "Popoola, Yuguda, Agboola Chart Course for Technological Advancements in Nigeria’s Capital Market",
    "summarized_story": "Nigerian Exchange (NGX) Limited brought together a caste of leading industry experts to dimension the digital transformation of the financial services space with a keen focus on the Nigerian capital market at its inaugural NGX TechNovation Conference.\nNGX is a technology powerhouse that leverages smart business models to deliver vertical platforms across capital formation, investment, capacity building, market development and a plethora of other services within the capital markets ecosystem.\nWe are committed to developing innovative solutions that drive, not just internal efficiency at the exchange but that support wider efforts by various stakeholders at ensuring a full digitalization of the Nigerian capital markets.\nAgainst the backdrop of evolving solutions, African startups have raised over $1Billion in funding which is unprecedented for technology companies.\nThis video along with the full recording of the event is available for viewing on YouTube at https://www.youtube.com/c/NGXGroup."
  },
  {
    "headline": "Fintech 5.0: Evaluating How First Bank Strengthens Collaboration",
    "summarized_story": "Tagged Fintech Summit, the annual engagement has continued to help in catalysing the fintech sector to ever-higher levels from year to year.\nLast year’s Summit, Fintech Summit 4.0 with the theme“How Blockchain and Artificial Intelligence will Disrupt Fintech in Nigeria”, however, drew an unprecedented number of participants – over 6,000 from across 52 different countries.\nThe Summit that preceded last year’s, i.e., the third edition of Fintech Summit 3.0 held in 2019, featured another heavyweight in Nigeria’s fintech industry, Victor Asemota, founder of Swifta Systems & Services, as keynote speaker.\nFirstBank through the Firstmonie platform further supports the fintech industry via partnership collaborations with local and international fintechs.\nThis relationship climaxes every year in the annual Fintech Summit and the forthcoming Fintech Summit 5.0 promises to take the relationship to a whole new dimension."
  },
  {
    "headline": "Sokoto Govt Has Raised The Bar On Digital Excellence – AFBA",
    "summarized_story": "Sokoto State governor, Aminu Waziri Tambuwal, has been lauded by the President of the African Bar Association (AFBA), Hannibal Uwaifo Esq., for his great transformational strides in digital health infrastructure provisions in the state.\nAccording to a statement by AFBA director of publicity, Collins Steve Ugwu, Uwaifo made this observation when his entourage en-route to AFBA annual conference in Niamey beginning on October 3, made a courtesy stopover in Sokoto, where he was honoured to inspect key signature projects of the governor.\nThe projects visited included a completed and fully fitted Modern Digital Diagnostic Centre, the massive construction site of Sokoto State University Teaching Hospital, and a legacy Modern High Court complex.\nThe Sokoto State High Court chief registrar, Mr. Bashar Ibrahim, while taking the group round the Court complex also testified that the governor has been extraordinary in his pursuit of access to justice for all.\nAFBA President after the inspection remarked, “I’m proudly impressed not only for the governor as a friend, and the good people of Sokoto state that energizes his commitment, but for African Bar especially, because it exemplified our mutual service mission to humanity and justified our choice of him as a life board member of African Bar.”He further thanked the governor for his usual kind hospitality, while stating that AFBA looked forward to receiving him warmly in Niamey where he is expected to be conferred with the Continental Bar’s Distinguished Service Award."
  },
  {
    "headline": "Sokoto Govt Has Raised The Bar On Digital Excellence – AFBA",
    "summarized_story": "Sokoto State governor, Aminu Waziri Tambuwal, has been lauded by the President of the African Bar Association (AFBA), Hannibal Uwaifo Esq., for his great transformational strides in digital health infrastructure provisions in the state.\nAccording to a statement by AFBA director of publicity, Collins Steve Ugwu, Uwaifo made this observation when his entourage en-route to AFBA annual conference in Niamey beginning on October 3, made a courtesy stopover in Sokoto, where he was honoured to inspect key signature projects of the governor.\nThe projects visited included a completed and fully fitted Modern Digital Diagnostic Centre, the massive construction site of Sokoto State University Teaching Hospital, and a legacy Modern High Court complex.\nThe Sokoto State High Court chief registrar, Mr. Bashar Ibrahim, while taking the group round the Court complex also testified that the governor has been extraordinary in his pursuit of access to justice for all.\nAFBA President after the inspection remarked, “I’m proudly impressed not only for the governor as a friend, and the good people of Sokoto state that energizes his commitment, but for African Bar especially, because it exemplified our mutual service mission to humanity and justified our choice of him as a life board member of African Bar.”He further thanked the governor for his usual kind hospitality, while stating that AFBA looked forward to receiving him warmly in Niamey where he is expected to be conferred with the Continental Bar’s Distinguished Service Award."
  },
  {
    "headline": "How To End Secessionists Agitations – Abdulsalami",
    "summarized_story": "Until bandits and boko haram came, Nigerians lived peacefully with each other and there was a lot of interaction among Nigerians.\nIn the last couple of years, peace in Nigeria has been destabilised.\nI think in answering that question I will also join the question of whether the military contributed to destroying this country.\nMy appeal to all is to keep peace and maintain peace because without peace we don’t have a country.\nWhat do you think brought about the agitations for secession we are experiencing today?"
  },
  {
    "headline": "How To End Secessionists Agitations – Abdulsalami",
    "summarized_story": "Until bandits and boko haram came, Nigerians lived peacefully with each other and there was a lot of interaction among Nigerians.\nIn the last couple of years, peace in Nigeria has been destabilised.\nI think in answering that question I will also join the question of whether the military contributed to destroying this country.\nMy appeal to all is to keep peace and maintain peace because without peace we don’t have a country.\nWhat do you think brought about the agitations for secession we are experiencing today?"
  },
  {
    "headline": "Nigeria Is In Reverse Motion – Shettima",
    "summarized_story": "Nigeria just turned 61, are the country’s leaders living up to youth expectations?\nI don’t think the country’s leaders, especially the current leaders have lived or are living up to expectations because we seem to be in reverse motion for more than a decade now.\nWe have about N33 trillion debt and unemployment is said to be as high as an estimated 33 percent.\nI can say they seem to be the only ones giving the very best of leadership in today’s Nigeria.\nSecondly, there is the need for unconditional love for this country and this is a question of national orientation."
  },
  {
    "headline": "Twitter to Buhari: We look forward to restored service very soon",
    "summarized_story": "Twitter to Buhari: We look forward to restored service very soonTwitter to Buhari: We look forward to restored service very soonThe social media platform Twitter, which is currently banned in Nigeria, says it looks forward to being reinstated following “productive” discussions with the Federal Government.\nThis follows the Independence Day announcement by the President, Major General Muhammadu Buhari that the ban on Twitter will be lifted after certain conditions might have been met.\n“We continue to engage with the Nigerian government and we are committed to charting a path forward to the restoration of Twitter for everyone in Nigeria.\n“Discussions with the Nigerian government have been respectful and productive – we look forward to seeing the service restored very soon.\n“Discussions with the Nigerian government have been respectful and productive – we look forward to seeing the service restored very soon.”Buhari, on Friday, said he had directed a conditional lifting of the ban placed on the operations of the micro blogging sire, Twitter, in Nigeria in June."
  },
  {
    "headline": "Twitter to Buhari: We look forward to restored service very soon",
    "summarized_story": "Twitter to Buhari: We look forward to restored service very soonTwitter to Buhari: We look forward to restored service very soonThe social media platform Twitter, which is currently banned in Nigeria, says it looks forward to being reinstated following “productive” discussions with the Federal Government.\nThis follows the Independence Day announcement by the President, Major General Muhammadu Buhari that the ban on Twitter will be lifted after certain conditions might have been met.\n“We continue to engage with the Nigerian government and we are committed to charting a path forward to the restoration of Twitter for everyone in Nigeria.\n“Discussions with the Nigerian government have been respectful and productive – we look forward to seeing the service restored very soon.\n“Discussions with the Nigerian government have been respectful and productive – we look forward to seeing the service restored very soon.”Buhari, on Friday, said he had directed a conditional lifting of the ban placed on the operations of the micro blogging sire, Twitter, in Nigeria in June."
  },
  {
    "headline": "Independence Day: South East totally complies with IPOB’s Sit–at–home order",
    "summarized_story": "AS expected, yesterday’s sit–at–home ordered by the leadership of the Indigenous People of Biafra, IPOB, was totally observed in all parts of the South East as cities in the zone were deserted.\nThe sympathy sit-at-home was declared by IPOB for people from Southeast not to be part of Nigeria’s Independence Day celebration, saying that there was nothing to celebrate.\nApart from the incident in Oboama Nguru in Aboh Mbaise, Imo State where enforcers of the sit-at-home burnt to death a commercial bus driver, people just stayed in their homes.\nAccording to an eye witness, the passengers were chased away by the enforcers before setting the bus ablaze, with the driver inside.\nStreets in Owerri, Umuahia, Aba, Onitsha, Enugu, Awka and Abakaliki, Okigwe, Orlu and Nnewi were totally deserted."
  },
  {
    "headline": "Independence Day: South East totally complies with IPOB’s Sit–at–home order",
    "summarized_story": "AS expected, yesterday’s sit–at–home ordered by the leadership of the Indigenous People of Biafra, IPOB, was totally observed in all parts of the South East as cities in the zone were deserted.\nThe sympathy sit-at-home was declared by IPOB for people from Southeast not to be part of Nigeria’s Independence Day celebration, saying that there was nothing to celebrate.\nApart from the incident in Oboama Nguru in Aboh Mbaise, Imo State where enforcers of the sit-at-home burnt to death a commercial bus driver, people just stayed in their homes.\nAccording to an eye witness, the passengers were chased away by the enforcers before setting the bus ablaze, with the driver inside.\nStreets in Owerri, Umuahia, Aba, Onitsha, Enugu, Awka and Abakaliki, Okigwe, Orlu and Nnewi were totally deserted."
  },
  {
    "headline": "Osoba undergoes knee surgery in UK",
    "summarized_story": "Former governor of Ogun State, Olusegun Osoba has undergone a successful knee surgery in the United Kingdom.\nThe knee replacement surgery was a major one, Chief Osoba told a Nigerian newspaper.\nGovernor Dapo Abiodun also congratulated the former governor on the success of the surgery in a statement on Friday.\nGovernor Abiodun during his recent trip to the UK visited the former governor ahead of the surgery and also spoke to him before the operation, the statement noted.\n“Our Baba, Chief Olusegun Osoba, underwent knee replacement surgery in the UK and we thank God that it went well, as he is now fine and in perfect condition."
  },
  {
    "headline": "Get Covid-19 vaccine or get out: UK minister tells care workers",
    "summarized_story": "News Agency of NigeriaBritish care home workers who are not prepared to get the COVID vaccine should “get out and get another job,’’ Health Secretary Sajid Javid said on Saturday.\nBut in an uncompromising message to staff, Javid said they should not be working in the sector if they were not prepared to be vaccinated.\n“If you are not going to get vaccinated then why are you working in care?\nI am very clear on that.’’Ahmed said care homes have already overcome significant resistance among staff to the vaccines.\nIn Nov. 2020, shortly before the vaccine program launched, she said just 40 percent of staff had said they would get it."
  },
  {
    "headline": "Nude Video: Dangote Withdraws Suit Against American Mistress",
    "summarized_story": "Aliko Dangote, a Nigerian businessman, has dropped the charges he filed against his former mistress Autumn Spikes in an American court.\nMr Dangote filed the charges in Miami, Florida, in a civil complaint under the alias John Doe, seeking $30,000 in damages.\nThe name also had an alias of ‘DA,’ which likely stood for Aliko Dangote’s initials.\nMr Dangote had already offered to pay her for her quiet, according to the woman, because the two had been in a relationship for nine years without a non-disclosure agreement to prevent her from publicly speaking about the affair.\nOn January 1, Ms Spikes used the Instagram name Allarounda1 to publish a video of herself and Mr Dangote on a couch aboard what looked to be a luxurious yacht, showing Mr Dangote half covered by an orange blanket while using his phone."
  },
  {
    "headline": "REVEALED: Face Of Boko Haram, ISWAP Operational Commander Who Masterminded Killing Of Nigerian Soldiers, Civilians",
    "summarized_story": "Abubakar Dan-Buduma, the feared commandant of Boko Haram’s Islamic State-backed faction, the Islamic State West Africa Province (ISWAP), formerly known as Jam’at Ahl as-Sunnah lid-Da’wah wa’l-Jihd in Borno State, has been released in a photograph.\nDuring many terrorist strikes, he is believed to have murdered a large number of Nigerian military and civilians.\nAccording to unconfirmed reports, Dan-Buduma was recently apprehended by the Nigerian Army in Borno State’s Sambisa forest.\nThe Nigerian Army has consistently claimed that the insurgency has been mostly vanquished, and any losses are frequently downplayed.\nThe terror group has killed approximately 50,000 people and displaced millions of people, mostly in the states of Adamawa, Borno, and Yobe."
  },
  {
    "headline": "Those Who Demolish Arabic Schools In The South West Are Putting Future Generations In Danger — MURIC",
    "summarized_story": "Those responsible for the Southwest’s IRK teacher shortage, according to the organization, are trapping future generations.\nThe statement reads: “The teaching of Arabic language and Islamic Studies (IRK) is gradually disappearing in both primary and secondary schools in the South West.\nMost of these schools have no subject teachers for the two subjects and no effort is being made to recruit teachers for them.\nNeither will teaching BK to Muslim children solve the problem because square pegs will never fit into round holes.\n“Those behind the artificial shortage of teachers of Arabic and IRK are simply setting a booby trap for future generations of people of all faiths in Yorubaland."
  },
  {
    "headline": "Nnamdi Kanu, Igboho Should Be Decisively Dealt With — Arewa Youths Back Buhari",
    "summarized_story": "Those campaigning for Nigeria’s fragmentation, according to the Arewa Youth Consultative Forum, should be dealt with harshly.\nThe President had promised to go after violent agitators such as Kanu and Igboho, who posed a threat to Nigeria’s cooperative existence.\nIn an exclusive interview with DAILY POST, Shettima said individuals whose agitations jeopardize Nigerians’ lives should be dealt with in accordance with Buhari’s directive.\n“Yes, certain things went wrong and we also, in Northern part of the country have suffered the same problem.\n“Anybody found disobeying the law of the land should be dealt with decisively; nobody is above the law."
  },
  {
    "headline": "VIDEO: Ex-Lagos governor, Asiwaju Bola Tinubu, receives Northern House of Reps Caucus in London",
    "summarized_story": ""
  },
  {
    "headline": "Breaking: Ex-Military governor in Delta, Cross River is dead",
    "summarized_story": "A former Military administrator of Delta and Cross River states, Commodore Ibrahim Kefas (Rtd), has died.\nKefas served as administrator of both states at different times under General Sani Abacha who was then Nigeria’s President.\nBlueprint reports that Kefas, passed on on a day Nigeria marked her 61st anniversary of independence.\nDetails loading…"
  },
  {
    "headline": "Pictures: President Muhammadu Buhari, Vice President Yemi Osinbajo, others mark Nigeria’s 61st Independence anniversary",
    "summarized_story": ""
  },
  {
    "headline": "DHQ denies killing 20 fishermen in air bombardment -NigPilot",
    "summarized_story": "The Defence Headquarters (DHQ) , on Thursday, denied the trending report that the air bombardment of the air component of Operations Hadin Kai on terrorist location killed 20 fishermen in Borno State.\nIt noted that necessary steps were taken to ensure that the presence of the terrorists was ascertained and the strike was precise and professionally executed.\nIt is therefore important to make clarifications regarding the air interdiction mission conducted in the general area.\n“This was after careful Intelligence Surveillance Reconnaissance missions revealed the activities of ISWAP elements in the location.\nAlthough casualty figures could not be ascertained, the strike was verified to be successful in disrupting ISWAP logistics movement and foot soldiers”."
  },
  {
    "headline": "Ita Enang tasks state judiciary workers on implementation of judicial autonomy -NigPilot",
    "summarized_story": "Secretary, Presidential Implementation Committee on Autonomy of State Legislature and Judiciary, Senator Ita Enang, has called on State Chief Judges and Head of Courts to observe caution and due diligence in the implementation of full autonomous judiciary.\nSenator Enang who is also the Senior Special Assistant to the President on Niger Delta Affairs, made the call while presenting a paper at the National Judicial Institute Roundtable on Effective Court Administration recently in Abuja.\n“Let me appreciate the National Judicial Institute for the privilege of this platform to address their Lordships on the patent fears and indeed banana peels on the floor of Autonomy of the Judiciary.\nSome of the Chief Judges present at the roundtable, observed that the present budgetary system was inhuman and stressed the need for a more realistic approach to budgeting.\nOther issues raised by the Chief Judges were on the need to make input at budgeting level and the process of transmission approval into cash."
  },
  {
    "headline": "NCAA refutes ban on travelers without proof of vaccination -NigPilot",
    "summarized_story": "Nigerian Civil Aviation Authority , NCAA has refuted trending reports that the Federal Government through the NCAA has given a directive that from December 1 this year, travelers without proof of vaccination would not be permitted to board both local and international flights.\nThe NCAA in a statement issued on Thursday by its General Manager, Public Relations, Sam Adurogboye, Authority stated that it did not give any such directive.\n“On the other hand, we want to enjoin purveyor of such unfounded news to cross-check facts before publishing.\n“Meanwhile, the Authority will continue to support all Federal Government initiatives to curb the spread of the Delta variant.\n“However, we expect strict adherence to safety protocols in and out of the airports by wearing our facemask, washing our hands periodically, using alcohol-based hand sanitizer, maintaining social distance and avoiding crowded space,” the statement read."
  },
  {
    "headline": "Troops kill 479 terrorists, bandits in September -NigPilot",
    "summarized_story": "The Defence Headquarters (DHQ), on Thursday, said that troops in all theatres of operation killed no fewer than four hundred and seventy-nine (479) Boko Haram/Islamic State of West African Province ISWAP terrorists and bandits in the month of September.\nThis is in addition to the one hundred and five (105) terrorist fighters and bandits that were arrested in September.\n“Troops of Operation HADIN KAI sustained the operational tempo in land and air offensives against terrorists and other criminal elements in the North East theatre.\nCumulatively, a total of 85 BHT/ISWAP terrorists were neutralized and 43 terrorists including their collaborators and logistics suppliers were arrested in the course of the various operations.\nAlso, 47 armed bandits, informants and bandits’ collaborators were arrested within the period,” he also revealed."
  },
  {
    "headline": "BREAKING: Abducted Air Vice-Marshal Smith Regains Freedom",
    "summarized_story": "Air Vice-Marshal Sikiru Smith who was abducted on Monday in the Ajah area of Lagos State has regained his freedom.\nThe Lagos State Commissioner of Police, Hakeem Odumosu, confirmed the release to Channels Television.\nThe police commissioner said he personally handed over Smith to his family, adding that persistent operational activities along the border corridors of Lagos and the recent onslaught on kidnappers in the forest led to the release of the retired Air Vice-Marshal.\nAir Vice-Marshal Sikiru Smith was abducted by armed masked men who bundled him into a boat, speeding off from the site where he was supervising work in the area.\nREAD ALSO: Gunmen Kidnap Retired Air Vice Marshal In LagosHe is a cousin to the former Inspector-General of Police, Musiliu Smith who is the Chairman of the Police Service Commission."
  },
  {
    "headline": "Nigeria@61: Young Nigerians Share Thoughts On Youth Participation In Politics, Leadership – Channels Television",
    "summarized_story": "﻿Six young Nigerians on Friday shared their thoughts on the participation of youths in politics and leadership in the country.\nDoes our infrastructure, do our health care and many other things look like N300tn has passed through us?\nKate HenshawA lot of people have run away because of the term ‘dirty politics’ and that is so wrong because we need to get involved.\n‘Money Politics’: Can young people thrive without money?\nThe second thing you must look at is integrity… After that you look at other things; what is your love for the nation?"
  },
  {
    "headline": "OAU Shut Down After Protests Over Student’s Death",
    "summarized_story": "The management of the Obafemi Awolowo University (OAU), Ile-Ife in Osun State, has closed down the school “until further notice” following protests that rocked the varsity in the aftermath of a student’s death.\n“In view of this, all students are hereby directed to vacate their halls of residence and the Campus latest by 12:00 noon on Saturday, 2nd October 2021.”The swearing-in ceremony of newly-elected Students’ Union members has also been suspended, the statement added.\nRELATED: UNIBEN Students Block Highway, Protest Increased Late Registration Fee“In the meantime, the University management has put in place the machinery to unravel the circumstances surrounding the immediate and remote cause(s) of the crisis,” it said.\n“She was promptly treated with some drugs prescribed and asked to report back as an out-patient.\nShe reported back to the Health Centre in the morning of Thursday, 30th September 2021."
  },
  {
    "headline": "Nigeria’s 61st Independence Day Celebration In Photos",
    "summarized_story": "Nigeria, on Friday, marked its 61st Independence Day anniversary with a ceremonial parade in the nation’s capital, Abuja.\nThe parade, which was witnessed by President Muhammadu Buhari and other dignitaries present at Eagle Square, was also broadcast live on national television.\nMany cheered throughout the performance, particularly when some military personnel blindfolded, dismantled firearms, and reassembled them with great showmanship.\nThe event’s acrobatic shows, punctuated with both contemporary and cultural dance displays, delighted the audience too.\nBelow are photos from the parade as taken by Channels TV’s Sodiq Adelakun:"
  },
  {
    "headline": "Boko Haram Has Captured 500 Communities In Shiroro – LG Chairman",
    "summarized_story": "Boko Haram terrorists have captured over 500 communities in eight wards of Shiroro Local Government Area of Niger State.\nAccording to him, the insurgents have attempted to incorporate and recruit residents of the communities to become Boko Haram members.\nHe said that Boko Haram insurgents have proclaimed that they do not want conventional primary and secondary schools, adding that their preference is the Islamic school.\n“Shiroro Local Government has an uncountable number of Boko Haram [fighters],” the council boss explained.\nThe recent development is coming six months after the state governor, Abubakar Sani Bello raised an alarm that Boko Haram terrorists have hoisted their flag in Kaure village, Shiroro Local Government Area."
  },
  {
    "headline": "Wounded troops receive wheelchairs, other materials in Kaduna",
    "summarized_story": "Troops of the Nigerian armed forces who were wounded in battle and currently receiving treatment at the 44 Nigerian Army reference hospital in Kaduna State have received 30 wheelchairs, other medical and relief materials from a delegation of senior Defence and Police Officers Wives Association (DEPOWA).\nWife of the chief of defence staff Victoria Irabor, led the delegation to commiserate with the wounded troops as part of activities to mark Nigeria’s 61st Independence anniversary.\nThe donation of the materials was in collaboration with the National Commission for Refugees Migrants and Internally Displaced Persons.\nMrs Victoria Irabor commended the troops for their sacrifices and assured them of continued support and prayers for speedy recovery."
  },
  {
    "headline": "Photos: Northern Lawmakers visit Tinubu in London",
    "summarized_story": "Members of the northern caucus in the House of Representatives led by the deputy speaker, Ahmed Idris Wase have visited national leader of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu in London.\nRecent PostsNews Feed RSS Error: WP HTTP Error: A valid URL was not provided.\nArchives Archives Select Month October 2021 (21) September 2021 (546) August 2021 (544) July 2021 (519) June 2021 (603) May 2021 (614) April 2021 (693) March 2021 (769) February 2021 (685) January 2021 (770) December 2020 (677) November 2020 (609) October 2020 (507) September 2020 (780) August 2020 (768) July 2020 (735) June 2020 (682) May 2020 (532) April 2020 (530) March 2020 (456) February 2020 (486) January 2020 (656) December 2019 (705) November 2019 (650) October 2019 (607) September 2019 (574) August 2019 (631) July 2019 (719) June 2019 (747) May 2019 (908) April 2019 (620) March 2019 (516) February 2019 (528) January 2019 (561) December 2018 (492) November 2018 (583) October 2018 (616) September 2018 (568) August 2018 (585) July 2018 (500) June 2018 (437) May 2018 (408) April 2018 (430) March 2018 (510) February 2018 (547) January 2018 (550) December 2017 (291) November 2017 (498) October 2017 (715) September 2017 (675) August 2017 (689) July 2017 (671) June 2017 (679) May 2017 (987) April 2017 (1042) March 2017 (1141) February 2017 (676) January 2017 (612) December 2016 (596) November 2016 (571) October 2016 (639) September 2016 (162) March 2016 (39) May 2015 (1)Categories Categories Select Category #AnambraVotes (15) #Ekiti2018 (25) #EkitiVotes (14) #LagosBuildingCollapse (2) #LiberiaRunOff (6) #OsunDebate (5) #OsunVotes (29) America (554) Asia (279) Athletics (113) Basketball (44) Boxing (69) Breaking News (118) Business News (5,378) Central Africa (85) East Africa (179) Election 2019 (26) Entertainment News (703) Europe (405) Events (16) Fashion (5) fashion & style (15) Featured (533) Football (1,584) Formula 1 (19) Golf (15) Health News (2,184) inside lagos (1) International (7,100) Kogi Election (10) labour lens (5) Lassa Fever & Coronavirus (18) Latest News (25,292) Africa (363) West Africa (184) Livestream (3) Metro (25) Middle East (174) Movies (31) Music (74) Nigeria News (20,952) Nollywood (34) Non classifié(e) (1) North Africa (175) Politics News (5,560) #EdoDecides (22) #LagosCouncilElections (4) #NigeriaVotes (240) #OndoDecides (100) Bayelsa Election (7) nnamdi kalu (9) Presidential Election (45) Science & Technology (8) Shows (2) Southern Africa (173) Sports News (3,408) Table Tennis (20) Tech (22) Tennis (111) the platform (1) Top Stories (38) U-Report (5) Uncategorized (280) VIDEO (1,201) Business Nigeria (3) Business Week (2) Community Forum (11) Crime Watch (102) Fireworks (13) Green Angle (4) Journalists Hangout (106) News at 10 PM (23) Special Reports (112) Sports Debate (32) Sports Desk (3) Standpoint (1) The Big Issue (4) The Sunday Interview (108) This Morning (85) TVC Breakfast (831) TVC Investigates (6) Wildlife (5) World News (2,038)"
  },
  {
    "headline": "Enugu Residents call on FG to address challenges",
    "summarized_story": "As Nigeria marks her 61st independence anniversary, from the colonial administration, expectations are high across the country, as the people look forward to a better future.\nSouth East region witnesses a sharp contrast of what independence anniversary ought to be, having it’s social economic activities grounded, with the streets, markets, offices and Banks deserted.\nIn Anambra state, the annual independence rituals were boycotted due to restriction of movement order issued by members of the Proscribed Indigenous People of Biafra (IPOB).\nEnugu state too is not different, sighting only security patrol teams, moving about to ensure safety.\nThe residents are clear in the demands, requesting that government should initiate a dialogue with the IPOB, as measure to douse the tension in the South East region of Nigeria."
  },
  {
    "headline": "Zamfara Govt restores telecommunication services in Gusau after four weeks -",
    "summarized_story": "Zamfara state government has restored Telecommunication Services in Gusau, the state capitalThe state Commissioner for Information Ibrahim Dosara confirmed the development to TVC News on Friday.\nHe said the move is to ease the hardship residents are passing through in terms Communication and financial transactionsHe also added that the move becomes necessary considering the successes recorded so far in addressing the problem of Banditry.\nThe development is coming after four weeks of total shutdown of Telecommunication Services in the state to allow security operatives carryout operation against bandits in their enclaves."
  },
  {
    "headline": "British Museum Accepts Nigerian Artist’s Gift But Keeps Looted Bronzes",
    "summarized_story": "An artist from Benin City in Nigeria said the British Museum had accepted his gift of a bronze plaque in what he felt was a possible first step towards the museum’s return of the priceless Benin Bronzes that were looted by British troops in 1897.\nHowever, the museum told him an exchange of new for looted artworks was impossible, he said.\nOsarobo Zeickner-Okoro, a founding member of Ahiamwen, a new guild of Benin City bronze casters and artists, had offered his creation to encourage the museum to give back the sculptures but also to demand acknowledgment of the city’s modern-day culture.\nAfter meeting with two curators from the museum’s Africa department, he told Reuters on Thursday they had accepted his gift and expressed an interest in acquiring several works by other Ahiamwen artists.\n“It’s disappointing but this is the first step,” he said."
  },
  {
    "headline": "California First US State to Require Covid Vaccines for Schoolchildren",
    "summarized_story": "California will become the first US state to require COVID-19 vaccinations for children to attend public and private schools in person in a mandate that could effect millions of students.\nIt’s why California leads the country in preventing school closures and has the lowest case rates,” Newsom said.\nThe mandate eventually will affect more than 6.7 million public and private school students in the nation’s most populous state.\nIn Los Angeles, a vaccine mandate for eligible students is set to take effect in January.\nCalifornia’s largest teachers unions back the vaccination mandate, as does the California Association of School Boards."
  },
  {
    "headline": "Nigeria Posts OPEC’s Biggest Output Gain in September",
    "summarized_story": "The group’s top producers further eased supply curbs in September under a pact with its allies known as OPEC+, revealed a survey by Reuters.\nAccording to the survey, OPEC pumped 27.31 million barrels per day (bpd) last September, up 420,000 bpd from August’s revised estimate.\nThe biggest rise in September was from Nigeria, where output rose by 170,000 bpd after Forcados force majeure and other problems in August were eased.\nEven so, Nigeria is pumping almost 100,000 bpd less than its OPEC target as under-investment restrains output.\nThe OPEC+ agreement allows for a 400,000 bpd production increase in September from all members, of which 253,000 bpd is shared by the 10 OPEC members covered by the deal."
  },
  {
    "headline": "Muhammadu Sanusi II: Nigeria Wasting Millions of Dollars through Subsidy Scam",
    "summarized_story": "Speaking on Arise News Channel, the former governor of the Central Bank of Nigeria also described as an assumption, the notion that Nigeria is an oil rich country.\nSanusi declared: “This has always been a big joke for me and we also talk about the fuel subsidy.\nWe are throwing away millions of dollars in this scam called subsidy.\nWhen you talk about the oil industry, for example, if you eliminate fuel subsidy, you eliminate fraud worth billions and millions of dollars.\nAnd that is why at the end of the exercise, you end up as Nigeria… presented with two useless candidates."
  },
  {
    "headline": "Nigeria: Rivers Governor Wike Warns Ex-President Jonathan Against Falling for APC’s Enticement",
    "summarized_story": "Governor Nyesom Wike of Rivers State on Friday urged former President Goodluck Jonathan to remain in the Peoples Democratic Party (PDP) and resist the temptation of joining the All Progressives Congress (APC).\nWike warned Jonathan not to be enticed by moves by the APC to lure reputable members of the PDP, adding that the ruling party is offering nothing but destruction.\nI will tell him, ‘Don’t go anywhere because these people want to destroy your reputation.\nIf you want to run for President, run under PDP.\nSome APC chieftains had visited him in recent times, raising the stakes in permutations for the 2023 general elections."
  }
]