[
  {
    "headline": "Divorce: I left Nigeria after my life was threatened, calls monitored -Estranged Atiku’s wife",
    "summarized_story": "Jennifer, one of the wives of former Vice President Atiku Abubakar, has claimed that her life was threatened after requesting to divorce her husband.\nShe noted the threat made her leave Nigeria, adding that she had to exit her law firm and sell assets in Nigeria.\nJeninifer, who made this known in a statement, also confirmed her divorce to the former presidential candidate of the Peoples Democratic Party.\nAccording to the lawyer, her phone calls were also monitored by suspected aides of the former VP.\nFor that reason, I have exited my law firm and sold all my assets, and moved abroad until peace reigns."
  },
  {
    "headline": "Malpractice: WAEC releases withheld results of ‘exonerated’ WASSCE 2020, 2021 candidates",
    "summarized_story": "The West African Examinations Council has announced the immediate release of withheld results of West African Senior School Certificate Examination 2020 and 2021 candidates.\nIn a communique at the end of the 72nd meeting of the Nigeria Examinations Committee, WAEC said only results of candidates exonerated of exam malpractices are released.\nThe examination body also authorised the cancellation of results of candidates proven to have been involved in malpractice cases.\n“It authorised that the entire results of candidates proven to have been involved in malpractice cases which attract the penalty of Cancellation of Entire Results be cancelled, while subject results of candidates proven to have been involved in malpractice cases which attract the penalty of Cancellation of Subject Results (CSR) be similarly cancelled.\nHowever, the results of candidates who were exonerated by the Committee will be released without further delay.”Copyright PUNCH."
  },
  {
    "headline": "APC, PDP caucuses to hold emergency meetings",
    "summarized_story": "SenateSenators belonging to the All Progressive Congress (APC) Caucus would be holding a meeting today immediately after plenary.\nAlso billed to hold an emergency meeting immediately after plenary is the caucus of the People’s Democratic Party (PDP).\nREAD ALSO:Killings, kidnappings: Reps ask IGP to establish station in Gombe communityThe notice of meeting was conveyed in two separate letters signed by the Senate Leader, Yahaya Abdullahi and the Minority Leader, Enyinnaya Abaribe.\nThe letters were read by the Deputy Senate President, Ovie Omo-Agege who presided over plenary on Tuesday.\nAbaribe, in the letter disclosed that the PDP caucus meeting which is scheduled to hold at 2pm is between PDP Senators and members of the PDP Board of Trustees."
  },
  {
    "headline": "APC National Convention: I’ve no running battle with EFCC, says Akume",
    "summarized_story": "“Over the span of more than 23 years, Senator George Akume has never been invited for questioning by any anti corruption agency.\nThis is because it has become very clear that Senator George Akume is the candidate to beat in the race for the National Chairmanship of our great party, APC”.\n“There is the endorsement of Senator George Akume by the Northern APC National Front as signed by its Convener and Spokesperson Mallam Ayuba Hassan.\nWe urge our party members and leaders across Nigeria to embrace the aspiration of Senator George Akume by supporting his aspiration to become the National Chairmanship of our great party, APC.\nIt is a well known fact based on research and investigation by the Senator George”, he stated."
  },
  {
    "headline": "CBN’s ‘Form A’ policy drives positive sentiment in Forex market",
    "summarized_story": "The 30-day average coincides with the period the new Form A policy has run so far.\nThe introduction of the e-Form A is just another of several initiatives of the CBN to ensure the easy accessibility of forex and related services to Nigerian bank customers.\nSo far So Good This YearThe Naira gained average of 1.58 percent or N7.56 against the United States Dollar at the official forex market in the first week of this year.\n‘Form A’ is an application form designed by the Central Bank of Nigeria to pay for service transactions (invisible trade).\nThe form allows customers to purchase forex at the CBN or interbank rate to make payments for eligible services as predetermined by the foreign exchange manual."
  },
  {
    "headline": "30,000 Minimum wage: Labour leaders, workers in Kwara, applaud Gov AbdulRazaq over implementation",
    "summarized_story": "He said,”Everyone is happy today because of this implementation of the 30,000 minimum wage by the governor.\nIssa Ore however expressed consolation that in a few years time, the Labour movement will propose another minimum wage.\n“On this note comrades, it is imperative to appreciate the Kwara State workers for your perseverance, loyalty, support and prayers through these years, we say thank you.\n“I want you to clap for the Kwara State Governor, he has done very well for the civil servants in Kwara State.\nIt has never been good like this in Kwara State when a governor will promise and will fulfil it in a better way,” he said."
  },
  {
    "headline": "We’ve increased power supply to 22 hours — Kola Adesina",
    "summarized_story": "By Joseph OsoIKEJA Electric Plc, yesterday restated its commitment towards increasing power distribution to 24 hours across its business unit.\nREAD ALSO:2023: Timi Frank advises PDP presidential aspirants to focus on issuesSpeaking on the development, Adesina stated that the company has increased its supply to 22 hours.\n“It is possible to have 24 hours power supply and its a journey we are embarking on.\nIE has moved from 10 hours power service to 22 hours service.\nSo, definitely, we will get to 24 hours constant power supply."
  },
  {
    "headline": "EFCC quick to arrest, slow to investigate properly – Okorocha",
    "summarized_story": "Former Governor of Imo State, Rochas Okorocha has described one of the nation’s anti-graft agencies, the Economic and Financial Crimes Commission EFCC, as too quick to effect arrests on suspects without thorough investigation.\nOkorocha expressed his observation yesterday in Abuja, while officially declaring his intentions to contest for the presidency in 2023.\nIn the charges, Okorocha is alleged to have embezzled N2.4 billion in public funds through connivance with some individuals and companies.\nMeanwhile, Okorocha has urged his party APC to uphold justice and fairness in determining where to zone the presidency.\n“It would be an injustice for the Yorubas and Hausa’s to come out to seek to contest for President, “he stated at the official declaration."
  },
  {
    "headline": "Nigeria, UK begin talks on security, defence partnership",
    "summarized_story": "Nigeria and the United Kingdom have commenced their first Security and Defence Partnership Dialogue.\nNdidiamaka Eze, Press and Public Affairs Officer, British High Commission, announced the meeting in a statement.\nUK National Security Adviser, Sir Stephen Lovegrove, and his Nigerian counterpart, Maj. Gen. Babagana Monguno (rtd), are attending.\nThe Security and Defence Partnership between the two countries was agreed upon in 2018.\nThe dialogue, being held at King Charles Street, FCDO, London will end on Wednesday."
  },
  {
    "headline": "Biafra: Nnamdi Kanu took advantage of Igbos’ naivety, anger – Okorocha",
    "summarized_story": "Senator Rochas Okorocha has described Nnamdi Kanu, leader of the Indigenous People of Biafra, as a smart man who took advantage of the Igbo’s unhappiness and naivety.\nOkorocha made the remark during a chat with Arise TV while commenting on IPOB’s secessionist agitation in the Southeast.\nOkorocha insisted that most Southeast youths are not secessionists but angry Nigerians railing against the system, making them easy targets for IPOB’s agenda.\n“They had been told that the rest of the country hates them.\nNnamdi Kanu is a smart man who got these people to think as he wanted,” he said."
  },
  {
    "headline": "African Union suspends Burkina Faso after coup",
    "summarized_story": "The African Union (AU) has suspended Burkina Faso, one week after a military takeover in the country.\nThe body says the sanction will be in effect until constitutional order is restored.\nThe Economic Community of West African States (ECOWAS) took similar action against Burkina Faso last Friday.\n“It is our position that the transition should be short so that Burkina Faso can return quickly to constitutional order”, Botchway noted.\nBurkina Faso is the third West African country to witness the ouster of a civilian administration since August 2020."
  },
  {
    "headline": "Stop molesting Hijab-wearing women – FOMWAN cautions principals, others",
    "summarized_story": "Our correspondent recalls that some educational institutions have been molesting female Muslim students for wearing Hijab.\nProminent among these was a case of molestation of female Muslim students by the authorities of University of Ibadan International School.\nFOMWAN Chairperson (Amirah) in Oyo State, Alhaja Alhaja Bushra Oloso, has, however, warned all educational institutions and other agencies to stop harassing female Muslim students on the basis of wearing Hijab.\nShe said that those female Muslim students chose not to dress immodestly but adorn themselves in Hijab as commanded by Allah in the Glorious Q’uran.\n“Hijab is the crown divinely ordained by Allah for the female muslims hence it is wrong and totally unwarranted for anyone to criminalize the crown."
  },
  {
    "headline": "INEC bars Boot Party from Ekiti Gov poll, rejects primary",
    "summarized_story": "The Independent National Electoral Commission (INEC) has rejected the outcome of the primary election conducted by the Boot Party (BP) to elect its candidate for the Ekiti governorship election.\nThe Commission said the party will not nominate candidate for the June 18 governorship election.\nINEC Chairman Professor Mahmood Yakubu, who disclosed the position of the electoral umpire, during the Inter-Agency Consultative Committee on Election Security (ICCES) at the Commission’s Headquarters, observed that the party’s governorship primary was not monitored by INEC.\nAccording to Yakubu said: “From out field report, the Boot Party (BP), did not hold its primary at any venue known to, and monitored by the Commission.\n- Advertisement -“Consequently, we do not expect the party to nominate a candidate for the Ekiti State governorship election”."
  },
  {
    "headline": "How to apply for US ‘no-interview’ visa renewals in Nigeria",
    "summarized_story": "How to apply for US ‘no-interview’ visa renewals in NigeriaThe US Mission has commenced expansion of its visa services to assist non-immigrant visa applicants in Nigeria who qualify to renew their visas.\n- Advertisement -· Your previous visa was a full validity, multiple entry visa.\n· Your previous visa expired within the last 24 months or will expire in the next 3 months from the date of application.\n· You have all your passports covering the entire period since receiving the previous visa and the passport with the most recent visa.\n· Select Nonimmigrant Visa Application, New Application/Schedule Appointment, and Visa Renewal without Interview."
  },
  {
    "headline": "Niger Gov endorses Musa for APC national chairmanship",
    "summarized_story": "Niger Governor Abubakar Sani-Bello has endorsed the All Progressives Congress(APC) national chairmanship aspiration of Senator Sani Musa.\nHe said Musa is more than fit and capable to lead the party at its national convention billed for February 26.\n“From north-central, preferably, I want someone from Niger state.\nHe explained that the election of a national chairman “is not a decision for Niger state alone, it is National Chairman, not Niger state Chairman.\n“My reason for going for the national Chairmanship is not far-fetched."
  },
  {
    "headline": "Petrol reserves dip to 1.3ml as scarcity persits",
    "summarized_story": "Premium Motor Spirit (PMS) popularly known as petrol sufficiency days and stock figures are receding, The Nation learnt on Tuesday.\nWhereas the Nigerian National Petroleum Corporation (NNPC) used to boast about 30 to 40- day stock sufficiency and about 2 billion metres, the record has dipped to 24.02-day sufficiency and about 1,345,338,930 litres stock of petrol.\nAccording to the document that The Nation obtained, the stock day sufficiency receded from 26.78 days on 26th January to 24.02 days sufficiency on 27th January 2022.\nThe previous day, which was 26th January 2022, the reserve was 1,499,806,953 being 26.78 days stock sufficiency.\nThe report for that day recalled that the previous day, 25th January 2022, the stock sufficiency was 25.47 days"
  },
  {
    "headline": "BREAKING: US Consulate begins ‘no-interview’ visa renewals",
    "summarized_story": "The US Mission has commenced expansion of its visa services to assist non-immigrant visa applicants in Nigeria who qualify to renew their visa.\nIt stated that this new application procedure will begin in February at the US Consulate in Lagos.\nRead Also: US Embassy extends visa fee validity to 2023- Advertisement -The US Mission further disclosed that the application procedure will also be extended to the U.S. Embassy in Abuja at a later time.\nIt said: “Applicants who meet the criteria may apply in Lagos until the service is extended to Abuja.\n“Please note that only one member of the family unit is required to drop-off the application documents; children are not required to come drop-off in person."
  },
  {
    "headline": "100 for 100 Policy: CBN Disburses N23bn to Manufacturers",
    "summarized_story": "Emefiele spoke at the formal launch of the 100 for 100 PPP scheme.\nEmefiele said the funds disbursed to beneficiaries of the 100 for 100 policy, which he stressed were loans, followed due screening of the applications received.\nHe said for this first cycle of the 100 for 100 policy, which ended yesterday, 243 applications valued at N321.06 billion, spread over key sectors, including agriculture, energy, healthcare, manufacturing, and services sectors, were submitted on the portal.\n“The selection of subsequent beneficiaries will be rolled over every 100 days with new sets of 100 companies and details of these companies will be published in the major national dailies.\nHe said, “The 100 for 100 Policy for Production and Productivity (PPP) is one of such interventions designed to fast track productive activities in priority sectors."
  },
  {
    "headline": "Buhari: My Successor will Inherit Home-grown Economy, Stable Democracy, Revamped Security Forces",
    "summarized_story": "•Nigeria facing historic transition, says ObaigbenaDeji ElumoyePresident Muhammadu Buhari yesterday disclosed that by the time he leaves office on May 29, 2023, he would have bequeathed a home-grown economy, stable democracy as well as revamped security forces to Nigeria.\n”I take this initiative to mean that you all intend to collaborate with this administration in that direction.\nBuhari, therefore, lauded the group for rising above all ethnic and religious divides for the common good, describing the feat as ‘‘fantastic’’.\nWe are doubling our efforts against all forms of insecurity, equipping our armed forces and strengthening the police.\n“What the Committee has tried to do is to develop an elite consensus on security and economy, ” he said."
  },
  {
    "headline": "FG Ramps Up Work on Siemens Power Deal, Set to Reach 40m Nigerians with Reliable Electricity",
    "summarized_story": "“This will in turn improve the standard of living while providing homes and businesses with constant, reliable and affordable electricity supply,” the minister said.\n“Our implementing partner, Siemens will assist with world-class experience in power system reforms like they have done recently in Egypt,” he noted.\nAlso speaking, the Managing Director of FGN Power, Kenny Anuwe, said the training was the first Power System Simulation Software (PSS) session under the Power Technology International (PTI) from Germany.\nHe noted that the training would cut across the power sector value chain comprising the generation, transmission and distribution to be handled by the National Power Training Institute of Nigeria (NAPTIN).\n“I want to assure you that FGN Power Company will do its best to deliver on this project to ensure greater success and sustainability,” he stated."
  },
  {
    "headline": "Sokoto PDP Stakeholders Call on Tambuwal to Contest for President, Gov Says He Will Begin Consultation",
    "summarized_story": "*To make his intention known end of FebruaryBy Onuminya InnocentStakeholders of Sokoto Peoples Democratic Party have called on Governor Aminu Waziri Tambuwal to contest for President in 2023.\nTambuwal, in his response, said he would begin consultations across the country.\nRising from a stakeholders meeting at the party Secretariat in the state capital, leaders of PDP expressed confidence in the leadership of Tambuwal and called on him to contest for the topmost position in Nigeria to rescue the country.\nIn his remarks, a former Minister of Power, Engineer Bello Suleiman, said governor Tambuwal was the most qualified candidate for the job.\nHe said in terms of experience in governance, former Vice President, Atiku Abubakar, who is also eyeing the PDP ticket, did not have as much experience as Tambuwal in governance."
  },
  {
    "headline": "Buni: We Have Reconciled Aggrieved APC Members in Kwara, Ogun Gombe, Others",
    "summarized_story": "He said the committee was very important to the collective zeal of recovering, repositioning and rejuvenating the party to have a strong, stable and united APC.\nBuni added: “The submission of this report is coming at a crucial period as we approach the National convention and the 2023 general election.\nTherefore, the findings of the committee would contribute in no small measure to a successful convention and the general election.\nBuni noted that with this numerical strength, APC remained the party that can confidently win elections with landslide victory in all the national elections.\nBuni urged support for the caretaker committee of the party to organize a very successful National Convention that would be a stepping stone to the party’s success in the 2023 general election."
  },
  {
    "headline": "COVID-19 Vaccine: CBN To Fund Nigerian Researchers, Science Institutions",
    "summarized_story": "The Central Bank of Nigeria says it is developing a framework under which grants and long term facilities will be provided to researchers, science institutions and biotechnology firms to develop COVID-19 vaccine.\nThe Governor of CBN, Godwin Emefiele, disclosed this at the unveiling of the THISDAY Dome Testing, Tracing and Treatment Centre, Abuja, on Tuesday.\nEmefiele said if Nigeria was to wait for foreign countries to develop their vaccines, it would be the last in the queue to receive curative remedies for the teeming population.\nHe said, “The CBN today challenges Nigerian scientists at home and in the Diaspora to go back to their laboratories and develop a Nigerian vaccine.\nOnce validated by the Health Authorities, the CBN will step in and do the needful for the sake of over 200 million Nigerians now confronted by COVID-19."
  },
  {
    "headline": "President Donald J. Trump’s Concession Speech, By Rudolf Okonkwo",
    "summarized_story": "The first time I ran for office, I ran for president.\nI have shown you that everything is possible if you have the right man to do the right job.\nThanks to me, they will grow up knowing that ours is a Christian nation where it is allowed to say Merry Christmas.\nTell those terrible lowlifes that they have proved themselves unworthy of Donald Trump’s genius and have opted to reduce America to a Second Class nation in the world.\nYours truly,President Donald J. TrumpThe 45th President of the United States."
  },
  {
    "headline": "Bandits Free Niger State Monarch After 45 Days In Captivity, N10million Ransom",
    "summarized_story": "The Dodo of Wawa community, Niger State, Dr Mahmoud Ahmed Aliyu, has been freed by his abductors after spending 45 days in their captivity.\nHe was said to have been released at about 7:30pm on Tuesday after the payment of N10million ransom to the bandits.\nThe Wazirin Wawa, Alhaji Ja’afar Ibrahim Bio, confirmed the release of the traditional ruler to Daily Trust, on the telephone but declined comment on how much was paid to secure his release.\nIn a video shared by his family, the traditional ruler was seen in a white turban being welcomed by his family and members of the palace.\nAliyu was abducted in his palace by heavily armed men around 9pm on September 4."
  },
  {
    "headline": "The Teflon President With Nine Lives Is On His Way Out By Dr. Wumi Akintide",
    "summarized_story": "The Teflon President with nine lives I have in mind is nobody else but Donald J. Trump.\nIn cahoots with Trump, Republicans have not ended their campaign of calumny to humiliate, blackmail and delegitimize Barack Obama, the first black President.\nThe one-term young Senator from Illinois was elected President in 2008 and re-elected again in 2012 with a wider margin.\nThe voters concluded he had told a lie even though he was one of the most honorable and dependable men of honor ever to serve as American President.\nThe list goes on and on without end but Donald Trump is still there despite an abysmal approval opinion of only 33 percent or less."
  },
  {
    "headline": "Women lead as MTN allots fresh shares to 126,720 Nigerians",
    "summarized_story": "MTN Nigeria 2021 primary offer was oversubscribed by 139 percent with as many as 6.6 million Nigerians now holding the telco share — directly or indirectly.\nFor two weeks in December 2021, MTN Nigeria gave the public a buying opportunity to own 575 million shares in the company, at an entry price of N169 per share.\nAccording to MTN, the “offer was 139.47% oversubscribed, activating the allocation of an additional 86.25 million shares”.\nDespite the oversubscription, MTN said retail shareholders will “receive full allotment” for the shares bought.\nAdvertisement“In all, 661.25 million MTN Nigeria shares were allotted."
  },
  {
    "headline": "Women lead as MTN allots fresh shares to 126,720 Nigerians",
    "summarized_story": "MTN Nigeria 2021 primary offer was oversubscribed by 139 percent with as many as 6.6 million Nigerians now holding the telco share — directly or indirectly.\nFor two weeks in December 2021, MTN Nigeria gave the public a buying opportunity to own 575 million shares in the company, at an entry price of N169 per share.\nAccording to MTN, the “offer was 139.47% oversubscribed, activating the allocation of an additional 86.25 million shares”.\nDespite the oversubscription, MTN said retail shareholders will “receive full allotment” for the shares bought.\nAdvertisement“In all, 661.25 million MTN Nigeria shares were allotted."
  },
  {
    "headline": "We got tips for money rituals on Facebook, say self-confessed killers of Sofiat",
    "summarized_story": "Majekodunmi Balogun, 20-year-old self-confessed killer of Sofiat Kehinde, an 18-year-old girl, says he got tips on money rituals in a Facebook group.\nAsked how they learnt about money rituals, Balogun said he screenshot a Facebook post published in a group highlighting steps on how to do money rituals.\n“Since two weeks ago, we have been planning to kill her for money rituals.\nAdvertisement“I screenshot the steps for doing money rituals on Facebook.\nAdvertisementHe said it was Balogun who kept telling him that Sofiat should be “used for money rituals”, which he said was against his wish."
  },
  {
    "headline": "We got tips for money rituals on Facebook, say self-confessed killers of Sofiat",
    "summarized_story": "Majekodunmi Balogun, 20-year-old self-confessed killer of Sofiat Kehinde, an 18-year-old girl, says he got tips on money rituals in a Facebook group.\nAsked how they learnt about money rituals, Balogun said he screenshot a Facebook post published in a group highlighting steps on how to do money rituals.\n“Since two weeks ago, we have been planning to kill her for money rituals.\nAdvertisement“I screenshot the steps for doing money rituals on Facebook.\nAdvertisementHe said it was Balogun who kept telling him that Sofiat should be “used for money rituals”, which he said was against his wish."
  },
  {
    "headline": "'Give us more time' -- Crowdyvest, Agropartnerships appeal to investors over delayed payments",
    "summarized_story": "Agritech crowdfunding platforms have appealed to their investors to give them adequate time to pay returns.\nIn the past couple of months, there has been a rise in the number of social media complaints of agritech companies owing investors.\nAdvertisementExplaining the reason behind delayed payments to investors, Crowdyvest said it was due to the acquired debt from Farmcrowdy and payment defaults from its impact partners.\nAgropartnerships, another agritech company, also sent an apology mail to investors after a town hall meeting to address the issue of delayed payments.\nIn 2021, Thrive Agric, another agric-tech company, announced a gradual refund of investors’ overdue payments a year after the company experienced financial hardship."
  },
  {
    "headline": "Nestcoin raises $6.5m pre-seed to deepen crypto and Web3 adoption in Africa",
    "summarized_story": "Last year alone, crypto startups raised over $27 billion in venture capital in 2021 —slightly higher than the past 10 years combined.\nAnd just last month, despite a dip in the price of cryptocurrencies, American VC, Andreessen Horowitz’s crypto arm launched a $2.2 billion fund, one of its biggest efforts to fund crypto startups.\nOn a mission to further deepen crypto adoption in Africa is Nigerian crypto startup Nestcoin which is building out Web3 products.\nLast year, it launched Breach, a media arm to simplify complex crypto topics to a global audience.\nOther institutional investors include MSA Capital, 4DX Ventures, Raba Capital, Goat.vc, Old Fashion Research, CMT Digital, Electric Capital, Social Capital, CoinFund, gumi Cryptos Capital, DeFi Alliance, among others."
  },
  {
    "headline": "Why did Binance block over 200 accounts in Nigeria?",
    "summarized_story": "The tweet picked up momentum due to how the supposed Binance representative handled the situation—with cluelessness and threats.\nSince there was no response yet from Binance throughout Wednesday, people began to conjure different reasons as to why accounts are getting blocked.\nAt 11 a.m. on Friday, the session, hosted by Dami Odufuwa, head of public relations at Binance Africa, alongside the Binance Africa community manager Nsikan Benjamin and the company’s Africa Director Emmanuel Babalola, started and lasted for about an hour.\nNot just countries, banks are also restricting access for crypto exchange as well.\nTransactions can also be tracked on the blockchain by collaborating and discussing with other centralised exchanges,” Binance Africa told TechCabal."
  },
  {
    "headline": "Tiger Global and Greycroft lead $15m Series A round in Nigeria’s Bamboo",
    "summarized_story": "We plan to add other products and tools that offer greater access and make global investing simpler from Africa,” Bassey said.\nFor instance, nearly 75% of Bamboo users have never traded stocks before.\nIn 2021, repeat depositors made up 85% of deposits on the platform, an indication that Bamboo users are rapidly gaining confidence in trading US stocks.\nBut with the US equities market experiencing its worst January in well over a decade—since 2009—how are Bamboo users reacting to the downturn?\n“Even though they are new to stock investing, Bamboo users tend to handle their emotions like more seasoned investors,” Bassey said."
  },
  {
    "headline": "What do blockchain, NFT, DAO and crypto mean?",
    "summarized_story": "What do blockchain, NFT, DAO and crypto mean?\nHow it works: Standard databases store data in rows, columns and files, but blockchain stores data in blocks that are chained together.\nHow it works: Cryptos are digital currencies created on blockchain technology.\nHow it works: To put it simply, NFTs are digital works that exist on blockchain.\nHow Web3 works: Web3 will be built on the blockchain working independently from different parts of the world."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, This Saturday was Techpoint Build 2021, and it was the thing!!!!!\nFrom the Speaker line-up, which in our..."
  },
  {
    "headline": "Nestcoin raises $6.45m pre-seed three months after launch to drive crypto adoption in Africa",
    "summarized_story": "Share this article:Venture capital activity in the global Web3, crypto, and blockchain space last year was massive.\nAccording to a Galaxy Digital Report, VCs invested more in crypto startups in 2021 than in the last seven years combined.\nThe largest portion of the funding — 41.83% — went to crypto startups offering trading, investing, and exchange services.\nSource: Galaxy DigitalThis year could be a big year for Web3 startups, especially in Africa, with the announcement of Nestcoin’s $6.45 million pre-seed round.\nIn the time Nestcoin has been operational, it has been fulfilling its mission to improve lives with crypto and Web3."
  },
  {
    "headline": "AltSchool Africa bags $1m to plug Africa’s shortage of entry-level talent",
    "summarized_story": "Share this article:In the past few years, the focus on tech talent development in Africa has shifted from training entry-level talent to training senior talent.\nAlso, the inability of the local education system to provide competent engineering talent has led to a gap in the market for entry-level talent.\nA side effect of this is that less attention is paid to entry-level talent.\nSo, why is AltSchool working on training entry-level talent when more established players are focusing on senior engineers?\nAs more companies are founded in Africa, and the competition for talent increasingly gets global, more engineering talent will be needed."
  },
  {
    "headline": "Of investment platforms, continental expansion, and high growth VC funds",
    "summarized_story": "The stock market sounded so distant and looked like land only the initiated would dare approach.\nImagine what foreign exchanges would feel like if the local stock market was out of reach for the average NigerianNo, this did not get better with time.\nOnly a relatively minute percentage of Nigerians invested in the local stock market in 2020, but a group of technology-enabled platforms began springing up.\nIn April 2021, it declared the activities of investment tech platforms illegal, and by July, Chaka bagged the commission’s first digital stock trading licence.\nAs Nigeria’s digital native population increases, the stock market could become an attractive proposition for thousands of Nigerians, if not Africans."
  },
  {
    "headline": "MTNN public offer oversubscribed by 139.47%",
    "summarized_story": "The Series 1 offer for sale of 575 million shares held by the MTN Group in MTN Nigeria (the Offer) to Nigerian investors has been successfully completed.\nThe Offer was implemented by way of a bookbuild to qualified institutional investors and a fixed price offer to retail investors.\nThe Offer was 139.47percent oversubscribed, activating the allocation of an additional 86.25 million shares.\nThe Offer was oversubscribed with valid applications for a total of 801.97 million units, leading to the activation of the approved 15percent over-subscription clause of an additional 86.25 million MTN Nigeria shares.\nFollowing the successful completion of the Offer, MTN Group’s shareholding in MTN Nigeria reduced by 3.25 percentage points, from 78.83percent to 75.58percent."
  },
  {
    "headline": "MTN rallies on Nigeria mobile money surge",
    "summarized_story": "MTN Nigeria, which makes up a third of the group’s business, said on Monday mobile money service users rose 102% to 9.4-million, adding 4.8-million users for the full year to end-December 2021.\nMTN Nigeria, the mobile operator’s most lucrative unit, says its mobile subscriber base fell more than double digits, or 8-million, in 2021, as it felt the pressure of state restrictions on new SIM activations.\nMobile subscribers fell 10.6% to 68.5-million in the year to end-December, MTN Nigeria said on Friday, though there was some pick-up in activity among existing users, with service revenue growing 23.3% to N1.65-trillion (R61bn).\nMTN Nigeria said it returned to subscriber growth in the last quarter of 2021, adding about 1-million, while in 2021 active data subscribers rose 5.3% to 34.3-million.\nDigital adoption continues to accelerate as customers use more digital products and services, a trend accelerated by Covid-19, MTN Nigeria said."
  },
  {
    "headline": "Five big companies enjoying Nigeria’s low-interest rate",
    "summarized_story": "Sixteen companies issued over N339.68 billion worth of commercial papers in the 12 months to December 2021, as compiled from data by FMDQ.\nThe companies issued a combined N245.62 billion worth of CP.\nCompared to two years ago when the interest rate was at a record high of over 15 percent, the current single-digit interest rate means lower financing costs for corporates that are borrowing to finance their operations.\nYields on the government Treasury Bills (T-Bills), the benchmark for determining the interest rate corporates pay investors for borrowing their money, remained relatively low in 2021.\nBreakdown of the data by FMDQ shows that FSDH Merchant Bank raised N12 billion under its various CP Issuance Programme in 2021."
  },
  {
    "headline": "Obaseki harps on bye-laws to improve traffic mgt, as EDSTMA trains over 1,200 drivers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the state government will introduce bye-laws and other measures to check recklessness among drivers.\nThe governor disclosed this after inspecting facilities of the Edo State Traffic Control and Management Agency (EDSTMA), including the Drivers Training Academy and Manpower Development Centre.\nWe are working very hard with experts on what to do to ease traffic congestion in the state.\nThe leading causes of traffic congestion are unwholesome practices among drivers, particularly commercial drivers and people who refuse to obey traffic signs.\nThe Managing Director, EDSTMA, Mr. Dennis Oloriegbe, said that the agency has trained over 1,200 drivers, comprising drivers apprehended for serious traffic offences and others within the civil service at the academy."
  },
  {
    "headline": "Obaseki, FG in talks over kick-off of academic activities at Ekiadolor Federal College of Education – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… says govt won’t be blackmailed by ex-staff of defunct COEBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has assured the National Commission for Colleges of Education (NCCE) of the state government’s support for the kick-off of academic activities at the Federal College of Education in Ekiadolor.\nObaseki, who noted that workers of the defunct Edo State College of Education, Ekiadolor, are not owed salaries or any entitlements, said the government will not give in to blackmails by the dissident staff of the former state-owned college of education.\n“We are trying to retool the educational system of this country and Edo State.\n“They are claiming what they didn’t work for because we have set up our own state college of education.\nWe’ve gone round the site of the college and discovered a lot of good things and we must appreciate your efforts.”."
  },
  {
    "headline": "Edo advances on smart waste mgt technology to tackle trash problems in communities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Nigeria Erosion and Watershed Management Project (NEWMAP) in Edo State has intensified the deployment of its newly launched smart waste management technology to address the waste crisis across the 18 local government areas in the state.\nThe mobile application, according to the Coordinator of Edo NEWMAP, Dr. Tom Obaseki, is aimed at curbing indiscriminate waste disposal, especially plastic, aluminum, and other non-degradable materials.\nThe project is rallying and sensitizing stakeholders and Community Interest Groups (CIGs) on the usage of the smart plastic waste recycling scheme to tackle trash problems in the state.\nAccording to Obaseki, “The Edo NEWMAP has continued to explore more efficient effective means to solve the problem of flood and erosion across Edo communities.\n“On the back of this, we recently launched a plastic redemption application to assist in dealing with the threat posed by plastic waste clogging stormwater drains and natural moats across communities in Edo State."
  },
  {
    "headline": "Edo to set up investment desks in Lagos, Abuja, Nigerian embassies – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has unveiled plans to set up investment desks in Lagos and Abuja as well as Nigerian embassies overseas to attract investments to the state’s industrial, agriculture, retail, tourism and power sectors.\nAccording to him, “We have to set up investment desks in Lagos and Abuja.\nThis will increase visibility of the opportunities for investment in our state.\n“The state has a 40MW power facility for investors in the industrial park provided by Ossiomo Power.\n“We want to create the investment desk so that we can advertise the opportunities available in the state to investors and get them to come and invest in our state,” he added."
  },
  {
    "headline": "Troops Kill 5 Terrorists, Capture Weapons In Borno, Yobe",
    "summarized_story": "The Nigerian Army has said its troops conducting Operation Hadin Kai in the North-East killed five Islamic State West Africa Province ISWAP (ISWAP) terrorists during encounters in Yobe and Borno States.\nHe said the troops in conjunction with members of the Civilian Joint Task Force (CJTF) carried out a clearance operation code-named “Operation DOMINANCE I” along the insurgents’ route of manouvre at Ngirbua village, neutralised two BH/ISWAP terrorists while others retreated in disarray.\nThe troops recovered one AK 47 rifle, one FN rifle and a motorcycle.\nADVERTISEMENTIn a related development, troops of Sector 3, Operation HADIN KAI deployed at Forward Operating Base Magumeri on January 30, 2022 engaged Boko Haram and Islamic State West Africa Province Terrorists in Borno State while on a fighting patrol around Mallumti general area.\nDuring the firefight, three terrorists fell to troops firepower while three AK47 Rifles, one magazine, 23 quantity of 7.62mm special ammunition, one pick-up truck, two solar panels, seven mobile phones, foodstuff and provisions, among others, were recovered."
  },
  {
    "headline": "ACJHR Lauds CBN’s Decision To Reduce ATM, Withdrawal Charges",
    "summarized_story": "The African Centre for Justice and Human Rights (ACJHR) has lauded the Central Bank of Nigeria (CBN) for reducing ATM withdrawal charges and inter-bank transfer fees in its revised guidelines on charges by banks, other financial institutions, and non-bank financial institutions.\nIn a statement by the group’s coordinator, Nduka Edede Chinomso, the ACJHR also noted the downward review of charges for electronic banking transactions and described the development as people’s interest-driven.\nParticularly, the group commended the CBN Governor, Godwin Emefiele, and members of his management team for always coming up with programmes and policies of government meant at making life meaningful for Nigerians.\nADVERTISEMENT“We make bold to say that this downward review of fees is another step in the right direction.\n“We, therefore, urge the CBN to remain focused on its fundamental objectives of repositioning the economy and making lives meaningful for the citizens.”ADVERTISEMENT"
  },
  {
    "headline": "Singapore Migrant Workers Labour Under Curbs",
    "summarized_story": "A temporary grey wall conceals the compound, which sits in the northwest of Singapore island, making it almost impossible for anyone in the many passing cars to catch a glimpse of what is inside.\nBut once cases began to emerge among migrant workers, the virus tore through their cramped accommodation.\n“When the pandemic hit in the first year, migrant workers had accounted for almost 90 percent of the confirmed cases in Singapore.\nWorkers were instructed to stay in their dorms and warned against mixing with other workers in common areas.\nMigrant workers are almost entirely cut off from the general public."
  },
  {
    "headline": "Singapore Migrant Workers Labour Under Curbs",
    "summarized_story": "A temporary grey wall conceals the compound, which sits in the northwest of Singapore island, making it almost impossible for anyone in the many passing cars to catch a glimpse of what is inside.\nBut once cases began to emerge among migrant workers, the virus tore through their cramped accommodation.\n“When the pandemic hit in the first year, migrant workers had accounted for almost 90 percent of the confirmed cases in Singapore.\nWorkers were instructed to stay in their dorms and warned against mixing with other workers in common areas.\nMigrant workers are almost entirely cut off from the general public."
  },
  {
    "headline": "Don’t Lose Hope In Nigeria, Ositelu Tells Nigerians",
    "summarized_story": "A Presidential candidate in the 2019 general election, Isaac Babatunde Ositelu, has admonished Nigerians not to lose hope in the transformation of the country to a greater Republic.\nSpeaking against the backdrop of the current economic doldrums, pervasive insecurity, religious strife and political upheavals, he assured that Nigeria will surely evolve out of the ashes of the current travails ravaging the nation and its citizens.\nOsitelu, a Project Manager/Businessman, urged Nigerians to put behind them the disappointments of their recent political experiences and get prepared for the transition in 2023.\nHe said that the citizens themselves have pivotal roles to play in getting Nigeria back on track as a nation to earn global respect and honour.\nThe astute political tactician called on the Youths and Women to take their pride of place in the political terrain by making their numbers count."
  },
  {
    "headline": "Again, suspected herdsmen gang rape, kill housewife in Ondo",
    "summarized_story": "Suspected Fulani herdsmen have reportedly gang-raped and killed a housewife, Mrs Roseline Joguntan at Igbokoda in Ilaje council area of Ondo State.\nA source said that “after gathering the first basket of the fruits, she told her child to take it home.\n” The deceased husband, Mr Joguntan reported the case at the police station.\nResidents alleged that the Fulani herdsmen who have dominated the community in the recent past gang-raped and killed her.\nAccording to one of the residents ” no sooner than the incident happened, some herdsmen were seen vacating the town en masse."
  },
  {
    "headline": "Again, suspected herdsmen gang rape, kill housewife in Ondo",
    "summarized_story": "Suspected Fulani herdsmen have reportedly gang-raped and killed a housewife, Mrs Roseline Joguntan at Igbokoda in Ilaje council area of Ondo State.\nA source said that “after gathering the first basket of the fruits, she told her child to take it home.\n” The deceased husband, Mr Joguntan reported the case at the police station.\nResidents alleged that the Fulani herdsmen who have dominated the community in the recent past gang-raped and killed her.\nAccording to one of the residents ” no sooner than the incident happened, some herdsmen were seen vacating the town en masse."
  },
  {
    "headline": "Kanu to IPOB supporters: Be ready to make peace",
    "summarized_story": "The Leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu, has called on the members of IPOB, to avail themselves in the ongoing peacemaking process.\nHe said the peace process, was important because enemies were trying to cause disharmony regarding the struggle for the actualization of Biafra.\nAccording to Ejiofor said: “Onyendu Mazi Nnamdi Kanu deeply appeals to UmuChineke to avail themselves of the peace initiative presently ongoing and not to be distracted anymore.\n“Onyendu reiterates that the ongoing interventions towards peaceful coexistence must be respected, encouraged and abided by.\nHis call for unity among the entire UmuChineke at all levels, who believe in his peaceful message cannot be overemphasised."
  },
  {
    "headline": "Kanu to IPOB supporters: Be ready to make peace",
    "summarized_story": "The Leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu, has called on the members of IPOB, to avail themselves in the ongoing peacemaking process.\nHe said the peace process, was important because enemies were trying to cause disharmony regarding the struggle for the actualization of Biafra.\nAccording to Ejiofor said: “Onyendu Mazi Nnamdi Kanu deeply appeals to UmuChineke to avail themselves of the peace initiative presently ongoing and not to be distracted anymore.\n“Onyendu reiterates that the ongoing interventions towards peaceful coexistence must be respected, encouraged and abided by.\nHis call for unity among the entire UmuChineke at all levels, who believe in his peaceful message cannot be overemphasised."
  },
  {
    "headline": "Atiku goes on secret medical trip to Germany",
    "summarized_story": "Former Vice-President Atiku Abubakar went on a secret medical trip to Germany last September 2021.\nThe trip was blown up in the tell-all statement of his fourth wife Jennifer Douglas, now locked in a dirty divorce with him.\nHe subsequently departed for his medical trip to Germany refusing to address any of the issues I privately wanted to conclude with him outside of third parties”, Jennifer wrote in a long statement on their acrimonious divorce .\nHe is known to have sought several medical help in the city, which he has made a second home.\nHis Germany medical trip was unknown until the release of Jennifer Douglas’s statement today."
  },
  {
    "headline": "We didn't endorse Yahaya Bello",
    "summarized_story": "The Christian Association of Nigeria in the 19 Northern states and Abuja has rubbished the reports that it had endorsed Governor Yahaya Bello of Kogi State for the 2023 presidency.\nCAN made the clarification in a communiqué issued after its Extraordinary Meeting held at Excel Hotel in Abuja.\nThe communiqué read, “We want to clarify the recent report in some online papers that Northern CAN had adopted Governor Yahaya Bello of Kogi State as its presidential candidate for the 2023 general elections.\n“We call on the public to disregard such reportage as it is never the thought or imagination of Northern CAN.\nThere has never been any meeting of the leadership of Northern CAN where such a decision was ever taken."
  },
  {
    "headline": "African Union Suspends Burkina Faso After Coup",
    "summarized_story": "Burkina Faso has been suspended by the African Union (AU) one week after a military coup.\nThe body says the sanction will be in effect until constitutional order is restored.\nThe Economic Community of West African States (ECOWAS) took similar action against Burkina Faso last Friday.\n“It is our position that the transition should be short so that Burkina Faso can return quickly to constitutional order”, Botchway noted.\nBurkina Faso is the third West African country to witness the ouster of a civilian administration since August 2020."
  },
  {
    "headline": "Atiku’s Secret Medical Trip To Germany Revealed",
    "summarized_story": "Former Vice-President Atiku Abubakar went on a secret medical trip to Germany last September 2021.\nThe trip was blown up in the tell-all statement of his fourth wife Jennifer Douglas, now locked in a dirty divorce with him.\nHe subsequently departed for his medical trip to Germany refusing to address any of the issues I privately wanted to conclude with him outside of third parties”, Jennifer wrote in a long statement on their acrimonious divorce .\nHe is known to have sought several medical help in the city, which he has made a second home.\nHis Germany medical trip was unknown until the release of Jennifer Douglas’s statement today."
  },
  {
    "headline": "Be Ready To Make Peace — Kanu Tells IPOB Supporters",
    "summarized_story": "Nnamdi Kanu, the leader of the Indigenous People of Biafra, IPOB, has urged IPOB members to participate in the ongoing peace process.\nHe stated that the peace process was critical because opponents were attempting to sow discord in the struggle for Biafra’s actualization.\nAccording to Ejiofor said: “Onyendu Mazi Nnamdi Kanu deeply appeals to UmuChineke to avail themselves of the peace initiative presently ongoing and not to be distracted anymore.\n“Onyendu reiterates that the ongoing interventions towards peaceful coexistence must be respected, encouraged and abided by.\nHis call for unity among the entire UmuChineke at all levels, who believe in his peaceful message cannot be overemphasised."
  },
  {
    "headline": "I Will Defeat Atiku, Saraki, Others To Get PDP Ticket — Dele Momodu",
    "summarized_story": "Dele Momodu, a presidential candidate for the Peoples Democratic Party, has claimed that he is convinced that he will defeat other contenders for the party’s ticket in the 2023 election, including former Vice President Atiku Abubakar, former Senate President Bukola Saraki, and others.\nBecause “he is new and clean,” the Presidential aspirant believes he is the greatest choice to succeed President Muhammadu Buhari(retd.).\nMomodu said, “It has nothing to do with the South, whether North or from the South, you have a Dele Momodu, who is coming fresh.\nA lot of Nigerian politicians in government enjoy what they could not enjoy in their private capacity.\n“The moment you reduce how much you waste on Politicians, you will see that there will be money for development."
  },
  {
    "headline": "2022: See full breakdown of JAMB registration, examination days, how to make payment, other requirements",
    "summarized_story": "Following announcement by the Joint Admission and Matriculation Board (JAMB) on new 2022 UTME registration and examination, below is the timeline details.\nJAMB 2022 TimelinesUTME (Registration) begins:12th February.\nUTME (Registration) closes: 19th March UTME MOCK: 2nd of April UTME (Examination) begins : 20th April UTME (Examination) ends : 30th April Cost of Registration: ₦4,700 (e.Pin: 3,500.\nJAMB is adopting cashless policy in the registration process for the 2022 UTME.\nDirect entry (Registration): To run concurrently with the UTME registration NIN is still Compulsory for registration except the board (JAMB) says otherwise."
  },
  {
    "headline": "EFCC files fresh N2.9bn fraud charge against Okorocha",
    "summarized_story": "Indications have emerged thay the Economic and Financial Crimes Commission (EFCC) has filed a fresh N2.9 billion fraud charges against former Governor of Imo State, Rochas Okorocha.\nBlueprint reports that Okorocha was charged alongside Anyim Nyerere Chinenye, Naphtali International Limited, Perfect Finish Multi Projects Limited, Consolid Projects Consulting Limited, Pramif International Limited, and Legend World Concepts Limited.\nThe commission alleged in the 17-count charge filed, Monday, at the Federal High Court, Abuja, that they conspired to steal N2.9 billion public funds.African Examiner had reported that Okorocha was in April 2019 grilled by EFCC for two days over alleged financial fraud.\nEFCC had in August 2019, grilled the former governor over some property traced to him and members of his family, including residential estates, schools, and shopping malls.\nThe commission has also arrested former Imo state Accountant-General, Uzoho Casmir, for allegedly assisting Okorocha to withdraw the funds."
  },
  {
    "headline": "Federal revenue generating agencies: Why we can’t meet NASS N3trn annual revenue target",
    "summarized_story": "Strong indications emerged Monday that targeted revenues for funding the N17.126 trillion 2022 Budget may not be realised as some of the revenue generating agencies complained of different forms of encumbrances.\nThis means that the law that mandates us to collect as revenue generating agencies, are voided completely.\nWe are ready to look into it again if other revenue generating agencies believe that it has hindered them from performing their responsibilities and we would amend it accordingly,” Adeola said.\nLawan assured that the upper chamber would provide the needed support through legislation to ensure revenue agencies perform to meet and surpass their targets.\nOthers were the Nigeria Immigration Service, Nigeria Security and Civil Defence Corps, Nigeria Prisons Service, Maritime Academy of Nigeria, National Agency for Food and Drug Administration and Control (NAFDAC), and Abuja Geographic Information Systems (AGIS)."
  },
  {
    "headline": "Buhari Launches N62.1bn HIV Trust Fund",
    "summarized_story": "President Muhammadu Buhari has launched a N62.1 billion fund to improve efforts towards sustaining the country’s HIV response, addressing killer diseases and public health emergencies.\nThe trust fund was launched at an event at the state house on Tuesday.\nRead Also: Buhari Launches N62.1bn HIV Trust FundThe private sector-led funding for the HIV Trust fund of Nigeria is expected to crystalise a sustainable financial mechanism for the mobilisation and deployment of domestic private sector resources, particularly aimed at preventing mother-to-child transmission of HIV in the country.\nByanyima further noted that there is an urgent need to scale up domestic funding as Nigeria leads with the highest number of HIV infections among children.\nShe said although the COVID-19 has pushed back intervention on the pandemic, ending AIDS is not just a moral but an economic imperative."
  },
  {
    "headline": "Dozens Kidnapped In Fresh Bandits’ Attack In Katsina",
    "summarized_story": "Dozens of people are said to have been abducted by terrorists in a fresh attack on Ruwan Godiya village in the Faskari Local Government Area of Katsina State.\nThe Police Public Relations Officer of the State Police Command, SP Gambo Isah, confirmed the incident to Channels Television on Tuesday.\nA community leader in the village, Mohammed Murtala also confirmed the incident to Channels Television.\nBut contrary to claims that at least 50 persons were kidnapped, Murtala said 38 persons were kidnapped during the attack.\nAccording to the residents, the gunmen came on a mission to attack a repentant bandit popularly known as Mani Turwa, who was said to be protecting the community."
  },
  {
    "headline": "VIDEO: Police Parade Four Teenage Suspects For Beheading Girlfriend",
    "summarized_story": "Police authorities in Ogun State have paraded four teenage suspects believed to have killed a young girl for a ‘money-making’ ritual in Abeokuta, the Ogun State capital.\nThe command’s public relations officer, Abimbola Oyeyemi, while parading the suspects on Monday said the suspects confessed to have lured their victim to an abandoned building, killed her, and severed her head for ‘money-making’ rituals.\nREAD ALSO: Fruit Farmer Murdered Inside Farm In OndoHe added that the fourth suspect Majekodunmi Soliu who, previously was on the run, was arrested hours later in his hideout.\nHe added that on interrogation, the arrested suspects confessed that what they were burning in the local pot was the head of the girlfriend of their accomplice, Majekodunmi Soliu.\nSome of the items recovered from the suspects include a short cutlass, a pot and a knife used in cutting off the lady’s head."
  },
  {
    "headline": "Borno Lost 900,000 Houses, 5,000 Classrooms To Insurgency – Zulum",
    "summarized_story": "Borno State Governor, Professor Babagana Zulum on Monday said about 900,000 houses and 5,000 classrooms to insurgency in the state.\nAlso destroyed by the terrorists are about 800 municipal buildings comprising police stations, traditional rulers houses, local government secretariats among others.\nWe lost about 5,000 classrooms in Borno State, 800 municipal buildings comprising police stations, traditional ruler houses, and local government secretariats.\nResponding, Governor Matawalle commended Zulum for the concern and finding the time to visit Zamfara despite his own problems in Borno state.\nZulum also used the opportunity to present a cheque of N20 million to the Zamfara State Governor."
  },
  {
    "headline": "Reps Ask Foreign Affairs Ministry To Obey Appropriation Law On Capital Spending By Embassies",
    "summarized_story": "The House of Representatives has asked the Ministry of Foreign Affairs to comply with a provision of the 2022 Appropriation Act, which gives express permission to Nigeria’s embassies to spend their capital votes in order to speed up foreign operations without seeking the approval of the Ministry.\nAlso in attendance were the Chairman, House Committee on Appropriation, Rep. Mukhtar Betara, and the Chairman, Committee on Foreign Affairs, Rep. Yusuf Buba Yakubu.\nThe House said compliance with the law was not negotiable until a possible amendment was passed by the National Assembly.\nBefore the National Assembly inserted the clause into the Act, the tradition was that embassies would not spend a dime until they got the approval of the ministry.\n“There is no point appropriating money and the money is not reaching the embassies”, Gbajabiamila added."
  },
  {
    "headline": "Tambuwal accepts call to commence consultation on Presidency bid -",
    "summarized_story": "Sokoto state Governor, Aminu Tambuwal has accepted call from leaders and stakeholders of the People’s Democratic Party PDP to commence a nationwide consultation on his for his presidential bid.\nLeaders and supporters of the party in the state in a stakeholders meeting called on the governor to initiate the process of consultation for the presidential bid.\nAdvertisementWhile making his intention known, the Governor said he has never taken any major political steps without consulting with political leaders and stakeholders.\nThe former lawmaker said he has accepted the call to initiate the process of consultation to contest for the president of the country.\nAdvertisement"
  },
  {
    "headline": "APC holds primary election for Ondo by-election today",
    "summarized_story": "All is now set for the conduct of the All Progressives Congress (APC) Primary Election for the Akure South/North Federal Constituency by-election in Ondo state.\nAlready, the Independent National Electoral Commission has fixed February 26.\nAdvertisementNo fewer than eight eligible aspirants in APC have been cleared to contest for the ticket in the primary slated to hold today at Dome International Event Center in Akure, the state capital.\nThe seat became vacant following the death of the lawmaker representing Akure South /North Federal Constituency, Hon.\nAdvertisementMeanwhile, the outgoing deputy governor of Anambra state, Mr. Nkem Okeke, has been appointed by the national leadership of the APC to head the committee to conduct the primary election of the party to pick the candidate in the bye-election."
  },
  {
    "headline": "NASS clerk transmits authenticated copies of Electoral Bill 2022 to Buhari -",
    "summarized_story": "The Clerk to the National Assembly Mr. Olatunde Amos Ojo has transmitted the authenticated copies of the Electoral Bill 2022 to the President of the Federal Republic of Nigeria Muhammadu Buhari GCFR on 31st January 2022.\nThis was done in accordance with the provisions of Section 58 (3) of the 1999 Constitution of the Federal Republic of Nigeria (as amended) and the Acts Authentication Act Cap.\nA2 LFN 2004.\nAdvertisementMr. President had withheld assent to the Electoral Bill 2021 transmitted to him on 19th November 2021.\nThe Electoral Bill was thereafter reworked by the National Assembly and both the Senate and the House of Representatives passed same on 25th January 2022."
  },
  {
    "headline": "Police parade 98 political thugs arrested on eve of primary elections in Ekiti -",
    "summarized_story": "The Ekiti State Police Command has paraded 98 suspected thugs arrested by the military in the build up to the just concluded Governorship Primary of the two major Political parties in the State.\nThe Public Relations Officer of the Ekiti State Police Command, Sunday Abutu while parading the suspects did not reveal the identity of the Sponsor of the Criminals, even though the command is aware of the SponsorAdvertisementThe Police Spokesperson further revealed that investigation is still ongoing into the matter and the Suspects will be charged to Court for Possible ProsecutionIt would be recalled that the suspected armed thugs were arrested on the eve of the PDP primary election, by military at Itawure checkpoint armed with dangerous weapons, and taken to Akure for Questioning before being released to the Police on SaturdayAdvertisement"
  },
  {
    "headline": "RISE.TV HEADLINES 01-02-22 – Arise News",
    "summarized_story": ""
  },
  {
    "headline": "Nigeria: Obaigbena Inaugurates THISDAY Editorial Board",
    "summarized_story": "The Chairman THISDAY/ARISE Media Group, Nduka Obaigbena, on Monday in Abuja inaugurated the reconstituted editorial board of THISDAY newspaper.\nIn attendance were THISDAY Managing Director, Mr Eniola Bello, editorial board chairman, Olusegun Adeniyi, and other members.\nWhile thanking the members for accepting to serve on the editorial board, Obaigbena reminded them that THISDAY is founded on three cardinal principles: Democracy, free enterprise, and social justice.\nOthers were Mr Paul Nwabuikwu, Mr Peter Ishaka, Mr Gimba Kakanda, Mr Bolaji Adebiyi, Mr Francis Ndubuisi, Mr Benneth Oghifo and Mr Sonny Aragba-Akpore.\nHe is an alumnus of the National Defence College, Abuja, and a proud winner of the presidential award for best graduating participant."
  },
  {
    "headline": "Nigeria, UK Move to Deepen Security, Hold Defence Partnership Dialogue in London",
    "summarized_story": "The United Kingdom (UK) and Nigeria on Monday commenced the first meeting of the Nigeria-UK Security and Defence Partnership Dialogue in London.\nIn addition, Defence staff talks, led by UK Chief of Defence Staff, Admiral Sir Tony Radakin and Nigerian Chief of Defence Staff, General Lucky Irabor, would also take place in parallel and would discuss military cooperation during the forum.\nCommenting on the dialogue, UK government Minister for Africa, Vicky Ford MP, said: “Today we welcome our Nigerian friends as we open the first UK-Nigeria Security and Defence Partnership dialogue in London.\nGreat to have this chance to expand our security and defence cooperation to improve how we respond to shared security threats.\n“The Security and Defence Partnership Dialogue this week was the first such dialogue since the partnership was formed."
  },
  {
    "headline": "NNPC Boss Kyari Says Oil Company Positioned to Lead Africa in Energy Transition",
    "summarized_story": "The Nigerian National Petroleum Company (NNPC) Limited on Monday gave an account of how it has positioned itself to lead Africa in energy transition.\nKyari spoke on the topic: “Energy Transition & Energy Accessibility – The New Paradigm.”The NNPC CEO also advised industrialised nations not to put Africa in the same energy transition speed because it could spark energy crisis.\nExplaining the company’s strategy for a smooth and realistic energy transition, the CEO said the NNPC had set the necessary machineries in motion to lead Africa in transition to low-carbon energy and renewables.\nContinuing, he said as a national oil company and a global player, the NNPC was ready to shift to renewable energy.\n“NNPC has established a Renewable Energy Division and has completely transformed the NNPC R&D Division to NNPC Research, Technology and Innovation as Energy Company of Global Excellence,” he added."
  },
  {
    "headline": "Nigeria’s Parliament Transmits Reworked Electoral Act Amendment Bill to Buhari for Assent",
    "summarized_story": "The National Assembly on Monday transmitted the reworked 2022 Electoral Act Amendment Bill to President Muhammadu Buhari for assent.\nPresident had withheld assent to the Electoral Bill 2021 transmitted to him on 19th November 2021.\nThe two chambers of the National Assembly then recommitted the bill for fresh legislation and added other options, as advised by the president.\nSenate President Ahmad Lawan said the bill had given sufficient and clear definitions to the modes of primary elections now adopted by both chambers of the National Assembly.\nThe re-amendment was sequel to a motion on, “Rescission on Clause 84 of the Electoral Act No."
  }
]