[
  {
    "headline": "APC caused unprecedented disunity in Nigeria – Atiku",
    "summarized_story": "A former Vice President and presidential aspirant of the Peoples Democratic Party, Atiku Abubakar, has accused the ruling All Progressives Congress of causing disunity among the diverse elements of the country.\nAtiku, who described the alleged disunity of the country as unprecedented, promised to unite Nigerians if he is elected as the president of the country.\nThe former vice president stated this while speaking with the PDP delegates from Ondo State in Akure, the state capital on Sunday evening.\nHe said, ” The APC government has caused disunity I have never seen in my life in this country.\nAtiku Abubakar is a household name in this country, we deserve the best for this country,” Atiku said."
  },
  {
    "headline": "US Senate vote Wednesday on abortion rights bill",
    "summarized_story": "The US Senate will vote Wednesday on a national abortion rights bill — a process likely doomed to fail — after a leaked draft decision signalled the Supreme Court’s readiness to overturn the 1973 Roe v Wade decision.\n“Now they have to show which side they’re on.”Republican-controlled states have taken steps to restrict abortion rights in recent months, given that overturning Roe v Wade would give states the ability to make their own laws on abortion.\nSenator Kirsten Gillibrand said “we will never give in” to Republican efforts to roll back abortion rights protections.\nBut, as with so many other social issues, the gap between Democrats and Republicans is wide, and growing wider.\nEight in 10 Democrats support abortion rights in all or most cases, more than double the 38 percent of Republicans who do, Pew said."
  },
  {
    "headline": "ASUU extends strike by 12 weeks",
    "summarized_story": "*Public universities on deathbed — NAPTAN, NANSBy Adesina WahabAs members of the Academic Staff Union of Universities, ASUU, on Monday, rolled over their warning strike by another 12 weeks, critical stakeholders in the sector have called for urgent steps to save public universities from imminent collapse.\nThe stakeholders, who spoke to the Vanguard in separate interviews, opined that public universities in the country are now on the deathbed.\nThe National President of NANS, Comrade Sunday Asefon, said the student body would come out with a comprehensive response to the development.\nThe National President of NAPTAN, Alhaji Haruna Danjuma, said university education has suffered a great setback with prolong industrial actions.\nASUUASUU, in a statement issued by the National President, Prof. Emmanuel Osodeke, said after a review of the situation, they decided to roll over the strike by another 12 weeks."
  },
  {
    "headline": "2023 Agenda: I’ll bridge past, present, future — Tunde Bakare",
    "summarized_story": "Pastor Tunde BakareOmeiza Ajayi, AbujaServing Overseer of the Citadel Global Community Church, Nigeria, Pastor Tunde Bakare has expressed commitment to the realization of a new Nigeria in his life time, promising to be the bridge between the past, present and the future.\n“I will be a conciliatory bridge between what was, what is and what should be,” he stated.\nBakare stated this on Monday in Abuja at the declaration of his intent to run for presidency on the platform of the ruling All Progressives Congress APC.\nHe unveiled a four-point agenda which he said are peace, progress, prosperity and possibility.\nBakare recalled that as running mate to Gen. Muhammadu Buhari in the 2011 election, they jointly designed a framework to get Nigeria working and that the framework was adopted as the manifesto of the defunct Congress for Progressive Change, CPC, and also formed the bedrock of the APC manifesto."
  },
  {
    "headline": "Just In: WAEC reverts to former calendar, fixes WASSCE for May 16 to June 23",
    "summarized_story": "By Elizabeth OsayandeThe West African Examinations Council, WAEC, has reverted to its former calendar, with May/June for the conduct of this year’s West African Senior School Certificate Examination, WASSCE.\nThis is just as the body, on Monday, announced the start of 2022 WASSCE for school candidates slated from May 16 to June 23.\nRecall that in the heat of the Covid-19 pandemic, WAEC shifted the date of WASSCE to two months after the normal date, that is from August to September.\n“The significance of this is that the West African Examinations Council (WAEC) and the various member States, save Ghana, have now again found a common ground in respect of their academic calendars.\n“We must give kudos to the Honourable Minister of Education and his Ministry for this wonderful feat,” Mr. Areghan noted."
  },
  {
    "headline": "Alleged Malabu scam: EFCC Official says defendant voluntarily gave statement",
    "summarized_story": "Ibrahim Ahmed, an investigator with the EFCC on Monday said Aliyu Abubakar, the 2nd defendant in the trial of former former Attorney-General of the Federation (AGF), Mohammed Adoke, voluntarily made statements to the anti-graft Agency.\nThe 2nd defendant (Abubakar) was not forced to make any statement and he was not detained.\n“He did it voluntarily and was not threatened,” he told the court.\nAhmed said Abubakar made two statements out of the six the commission sought to tender in evidence, in his own handwriting.\nHe said the defendant also brought lawyers who he said he trusted to write some for him and he (Abubakar) attested to the statements."
  },
  {
    "headline": "Community hands over 74-yr-old man to police over alleged s3xual abuse of 12-yr-old girl",
    "summarized_story": "A 74-year old man, Bassey Inyang, has been handed over to the police for alleged sexual abuse of a 12-year old girl in Calabar.\nA witness had alleged that this was not Inyang’s first time while other parents, who had similar experiences, also opened up to tell their stories.\n“Before the community, the suspect confessed to the heinous crime.\n“We seriously condemn such crime against minors reportedly perpetrated by the suspect; we invited the police to pick him for further interrogation,” he said.\nIbor, who is also the Secretary, Administration of Criminal Justice Monitoring, said he would not relent on the case until justice was duly served."
  },
  {
    "headline": "Saraki in closed-door meeting with Obasanjo in Ogun",
    "summarized_story": "Former Senate President, Bukola Saraki on Monday visited former President Olusegun Obasanjo in Abeokuta, the Ogun State capital.\nSaraki arrived the Penthouse residence of the Olusegun Obasanjo Presidential Library (OOPL) in Oke-Mosan, Abeokuta to have a closed-door meeting with the ex-President.\nSaraki’s meeting with Obasanjo may have to do with his 2023 presidential ambition under the Peoples Democratic Party (PDP).\nThe former Kwara State Governor is one of the consensus candidates of the PDP northern elders.\nHe is expected to meet with PDP delegates in Ogun State after his meeting with Obasanjo."
  },
  {
    "headline": "2023: FG reacts as Emefiele drags Malami, INEC, APC to court over Presidential ambition",
    "summarized_story": "Folasade Yemi-Esan, Head of OHCSF, urged all civil servants to be guided by the Nigerian Public Service Rules, PSR.\nYemi-Esan said they civil servants should be guided by Malami’s legal opinion.\nEmefiele dragged Malami, the Independent National Electoral Commission, INEC; the All Progressives Congress, APC; before a Federal High Court in Abuja, seeking enforcement of his right to contest the 2023 Presidential election without resigning from his current position.\nThe CBN governor is seeking enforcement of his right to contest the 2023 Presidential election without resigning from his current position.\nReacting, Yemi-Esan explained that the need for compliance was in the interest of neutrality, harmony, integrity, and development of the Nigerian Civil Civil Service."
  },
  {
    "headline": "Sex scandal: Stephanie Otobo accuses Apostle Suleman of death plot, vows to release video",
    "summarized_story": "Stephanie Otobo is back in the news, years after she exposed her alleged sexual affair with Apostle Johnson Suleman.\nSuleman is Senior Pastor and General Overseer of Omega Fire Ministries (OFM) International.\nIn a Twitter post on Monday, Stephanie accused the cleric of trying to eliminate her.\nThe music artiste also posted screenshots of video calls and another intimate image.\n“I’ll release a comprehensive video of everything that happened and the answers to questions.”"
  },
  {
    "headline": "Elon Musk shares cryptic Twitter post about death",
    "summarized_story": "Business mogul and entrepreneur, Elon Musk has posted a cryptic message on Twitter.\n“If I die under mysterious circumstances, it’s been nice knowin ya”, he tweeted Monday morning.\nTwitter users are debating the context of the tweet but Musk has remained silent.\nMusk recently bought Twitter for $44 billion and is expected to serve as a temporary CEO for a few months.\n“Twitter will always be free for casual users, but maybe a slight cost for commercial/government users”, he said."
  },
  {
    "headline": "2023 Presidency: It’s for lazy people – Arewa youths state position on zoning",
    "summarized_story": "The Arewa Youths Consultative Forum, AYCF, has stated its position regarding the position of zoning of the 2023 Presidency.\nNational President of AYCF, Yerima Shettima, maintained that he is against the clamour for the zoning of the Presidency.\nSpeaking with DAILY POST, Shettima stressed that only lazy sections of the country would clamour for zoning.\n“Anything short of that is not good for the country; only a lazy section of the country would continue to clamour for zoning.\n“Zoning has been jettisoned since 2011, and that is why we are solidly behind the position of the Northern Elders Forum under the leadership of Prof. Ango Abdullahi."
  },
  {
    "headline": "BREAKING: ASUU extends strike by 12 weeks",
    "summarized_story": "The Academic Staff Union of Universities(ASUU) has rolled over its ongoing strike for another 12 weeks.\nA statement by its President, Prof. Emmanuel Osodeke, said this was to give the government enough time to satisfactorily resolve all the outstanding issues.\nASUU said it took this decision after its National Executive Council meeting which started on Sunday night at the Comrade Festus Iyayi National Secretariat, University of Abuja.\nThe statement titled: ‘Update on ASUU roll-over strike,’ reads: “The National Executive Council (NEC) of the Academic Staff Union of Universities (ASUU) held an emergency meeting on Sunday, 8th May 2022 at the Comrade Festus Iyayi National Secretariat, University of Abuja, Abuja.\n“The meeting was called to review developments since the Union declared an eight-week total and comprehensive roll-over strike action at the end of its emergency NEC meeting at the Comrade Festus Iyayi National Secretariat, University of Abuja, Abuja on 14th March, 2022."
  },
  {
    "headline": "BREAKING: Emefiele seeks court ruling to contest APC presidential primary",
    "summarized_story": "Central Bank Governor Godwin Emefiele has confirmed his presidential ambition, putting an end to uncertainties about his bid to contest.\nIn a suit he filed at the Federal High Court in Abuja through Chief Mike Ozekhome (SAN), he is praying for a declaration that he is not bound to resign to participate in a primary election to select a presidential candidate.\nThe CBN Governor is the sole plaintiff in the suit, with the Independent National Electoral Commission (INEC) and the Attorney-General of the Federation as respondents.\nHe is praying the court to determine whether Section 84(12) of the Electoral Act 2022 is not inconsistent with Section 137 (1)(G) of the 1999 Constitution.\n“That the plaintiff verily believes that he is not affected by these provisions, as he is not a political appointee as envisaged by the above provisions of section 84(12) of the Electoral Act, 2022."
  },
  {
    "headline": "PHOTOS: Students set for protest at UNILAG over ASUU strike",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "APC slams nine conditions on presidential aspirants",
    "summarized_story": "The All Progressives Congress (APC) has released nine guidelines for the conduct of presidential, governorship and parliamentary aspirants ahead of primaries.\nThese conditions are contained on page 17 of the nomination form given to the aspirants.\nIt was learnt that most presidential aspirants have been seeking legal advice on Page 18 of the nomination form, which they considered a booby trap.\n“I am aware that presidential aspirants have been comparing notes on the letter, which is unacceptable to them.\n“None of the presidential aspirants has been able to submit his or her nomination form because of this letter of withdrawal."
  },
  {
    "headline": "2023: Atiku promises to recruit more personnel in security agencies if elected",
    "summarized_story": "Atiku Abubakar, former Vice-President, said he would recruit more men and women into the security agencies as part of efforts at fighting insecurity in the country if elected as president in 2023.\nHe appreciated the people of Ondo State for trusting him and voting for him as the candidate of PDP in the 2019 election.\n“Atiku Abubakar is a household name in Ondo State, that is why you gave me over 35,000 vote margin in the last election.\nSpeaking, Ondo State PDP Chairman, Hon.\nFatai Adams, assured Atiku that the state delegates would “compensate” him with their votes."
  },
  {
    "headline": "ASUU NEC extends rollover strike by 12 weeks",
    "summarized_story": "By Gabriel DikeThe Academic Staff Union of Universities (ASUU) early Monday morning extended the ongoing strike by 12 weeks.\nThe decision was taken at an emergency National Executive Council (NEC) held at ASUU Secretariat in Abuja.\nThe emergency meeting, which had in attendance principal officers and branch chairmen, started on Sunday and ended early Monday morning.\nThe two month rollover strike declared in March 14, 2022 by ASUU ended today (May 9th), thus NEC felt the need to extend it by 12 weeks after initial agitation for indefinite strike because of failure to address the issues in contention.\nThe implication of the extension of the strike is that public universities would remain close."
  },
  {
    "headline": "Tension in PDP over zoning, convention committee",
    "summarized_story": "Barring any last minute change, the Peoples Democratic Party ( PDP) National Executive Committee (NEC) would meet on Wednesday to consider the report of its zoning committee headed by Benue State Governor, Samuel Ortom.\nDaily Sun gathered that there were concerns that discussions at the NEC meeting may be deadlocked because of the split.\nThe PDP presidential screening panel headed by former Senate president, David Mark, had cleared 15 aspirants to participate in the May 28/29 presidential primary.\nThey include former vice president, Atiku Abubakar, Bauchi State Governor, Bala Mohammed, former Anambra State governor, Peter Obi, Aminu Tambuwal, Nyesom Wike, Emmanuel Udom, governors of Sokoto Rivers and Akwa Ibom states respectively, as well as former Secretary to Government of the Federation (SGF), former Senate President, Bukola Saraki, former Ekiti State governor, Ayodele Fayose and publisher of Ovation Magazine, Dele Momodu.\nExcept that we should pray for the BoT and NEC members, that they just be guided by all that is just and fair."
  },
  {
    "headline": "Domestic airlines cancel plans to shut down flight operations",
    "summarized_story": "By Chinelo ObogoAirline Operators of Nigeria (AON) has cancelled plans to shut down flight operations from today, Daily Sun can report.\nIn a statement from the president, Abdulmunaf Sarina, the association said following a promise by the Federal Government to urgently intervene in the crises facpng airlines due to high cost of JetA1, it has decided to suspend its plans to shut down operations from today (Monday).\nMinister of Aviation, Hadi Sirika, had appealed to the airlines not to shut down operations, assuring that the Federal Government will intervene in the matter.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nPremature Ejaculation & \"Small Joystick\" Resolved in 7Days... Click Here For Details ."
  },
  {
    "headline": "The Sun award reinforces our commitment to serve Lagosians – Sanwo-Olu",
    "summarized_story": "The strides being recorded from the strategic implementation of the development blueprint of the Governor Babajide Sanwo-Olu administration in Lagos State, known as THEMES agenda, has, again, been acknowledged with an institutional award.\nThe Governor is intelligent, resilient, smart and impatient in executing life-transforming projects without leaving out any part of the State.\nFor these and many more, Sanwo-Olu is named The Sun Governor of the Year 2021.”President of the Senate, Sen. Ahmad Lawan, presented the prize to Sanwo-Olu, describing the Lagos Governor as an “embodiment of brilliance and competence”.\nSanwo-Olu, in his acceptance speech, dedicated the award to residents of Lagos, whom, he said, his administration remained committed to serve.\nThe recognition, Sanwo-Olu said, came with more tasks for his Government to continue to work for the people."
  },
  {
    "headline": "We’re for you, Enugu West zone delegates assure Ugwuanyi",
    "summarized_story": "The delegates, who gave the assurance when they paid a solidarity visit to Ugwuanyi at the Government House, Enugu, applauded the governor for entrenching peace and good governance in Enugu State.\nFlanked by the other four council chairmen from Enugu West senatorial district, Ozoeluba added: “We equally thank you for the peace you have given Enugu State.\nWe have never seen a peaceful three-man delegate election in Enugu State like this one of April 30.\nAnd that peace you have given Enugu has made our state one of the best states in Nigeria.\n“We are a family and we have a leader in the person of Ugwuanyi."
  },
  {
    "headline": "ASUU Extends Strike by 12 Weeks",
    "summarized_story": "Onyebuchi Ezigbo in AbujaThe Academic Staff Union of Universities (ASUU) has again resolved to continue its nationwide strike for another 12 weeks.\nIn a communiqué issued at the end of its National Executive Council (NEC) meeting in Abuja on Sunday, the union stated that: “After extensive deliberations, noting federal government’s failure to live up to its responsibilities and speedily address the issues raised in the 2020 FG-ASUU Memoradum of Action, within the additional eight week roll-over strike period declared on March 14, 2022, NEC resolved that the strike rolled-over for 12 weeks to give government more time to satisfactorily resolve all the outstanding issues.”The communiqué, signed by ASUU President, Prof. Emmanuel Osodeke, said: “The roll-over strike is with effect from 12.01am on Monday, May 9, 2022.”Details later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "2023: African Leaders Pressure Buhari for AfDB President, Adesina",
    "summarized_story": "A reliable source told THISDAY that leaders in West Africa, including the presidents of Niger and Côte d’Ivoire, might have spoken to Buhari on behalf of the AfDB president.\nThree different groups, Rice Farmers Association of Nigeria, Friends of Emefiele and Emefiele Support Group, had last week, purchased the forms for Emefiele.\n“It is true that the groups that felt that the CBN Governor will do well as the president purchased forms for him but he has not made any declaration.\nHe described Adesina as a man of proven integrity and experience, saying he performed well for Nigeria as Minister for Agriculture.\nWe are calling Adesina because it’s a call to save Nigeria, and I think he is going to accept.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: Maverick Politician, Arthur Nzeribe, Dies at 83",
    "summarized_story": "Maverick Politician and a multi-billion naira investment mogul, Chief Arthur Nzeribe is dead.\nHis father, Oyimba Nzeribe, was a lawyer and former state counsel, and his grandfather, Akpati Nzeribe, held the traditional title of Ogbuagu, Oshiji, Damanze Oyimba of Oguta.\nHis second wife is the sister of Hajia Asabe Yar’Adua, wife of the late General Shehu Musa Yar’Adua, who was brother of late President Umaru Yar’Adua.\nNzeribe lost his mother when he was a primary school pupil, while his father was away in Great Britain studying law.\nHe took courses at Portsmouth College of Technology and later attended Chesterfield College of Technology in England."
  },
  {
    "headline": "2023 Presidency: Emefiele to Decide in Next Few Days",
    "summarized_story": "The Unified Northern Nigeria Youth Forum (UNNYF), one of the groups calling on Emefiele to contest for the 2023 Presidency, has also condemned the call by the Ondo State Governor, Mr. Rotimi Akeredolu, for Emefiele to resign.\nThe CBN governor, in a series of Tweets, disclosed that he hasn’t decided on whether to throw his hat into the ring or not.\nOn its part, UNNYF, one of the groups calling on Emefiele to contest has condemned Akeredolu’s call for him to resign.\nThe coalition is led by the Head, of One Nigeria Group, Mr Mohammed Saleh.\nOne, he is not comfortable with the large number of people that have purchased the presidential forms in APC."
  },
  {
    "headline": "PDP NEC Meets Wednesday on Zoning of Presidency",
    "summarized_story": "The committee had recommended that the party should throw open the presidential ticket of the party to all interested party members.\nThe PDP NEC had in its meeting set up a 37-man committee to discuss and advise the party on where to zone its presidential ticket for the 2023 presidential election.\nAyu promised that the committee’s recommendations would be transmitted to the NEC, which would take a final decision.\nZone Presidential Ticket to South-east for Stability, Equity, Yakassai tells PDPMeanwhile, the 97-year-old Yakassai has urged the PDP to zone its presidential ticket to the South for the sake of stability and justice.\nIn his response on behalf of the party’s NWC, the National Chairman of the PDP, Ayu, promised a transparent and fair presidential primary."
  },
  {
    "headline": "EXCLUSIVE: Emefiele Currently Scouting For Court Order To Retain His Position As Nigeria’s Central Bank Governor While Contesting For Presidency — Source",
    "summarized_story": "The Governor of the Central Bank of Nigeria, Godwin Emefiele, is currently scouting for judges to issue a court order that will allow him to retain his position at the apex bank while campaigning for the Presidency, SaharaReporters has learnt.\nHowever, as of the time of filing this report, checks by SaharaReporters showed that the case had yet to be filed.\nSee Also Politics Nigeria’s House Of Representatives To Reconvene On Monday Over Central Bank Governor, Emefiele’s Presidential AspirationThis sparked the outrage of Nigerians who highlighted the massive corruption cases the CBN governor is currently enmeshed in.\nHowever, a source told SaharaReporters that Emefiele made financial arrangements for the groups to procure the nomination form for Adesina.\nSee Also Politics Governors Pull Out Of Committee Set Up To Push Presidential Ambition Of Central Bank Of Nigeria Governor, Godwin Emefiele“Emefiele’s Presidential project started with Buhari’s cabal member, Ismaila Isa Funtua who is now late."
  },
  {
    "headline": "EXCLUSIVE: Emefiele Currently Scouting For Court Order To Retain His Position As Nigeria’s Central Bank Governor While Contesting For Presidency — Source",
    "summarized_story": "The Governor of the Central Bank of Nigeria, Godwin Emefiele, is currently scouting for judges to issue a court order that will allow him to retain his position at the apex bank while campaigning for the Presidency, SaharaReporters has learnt.\nHowever, as of the time of filing this report, checks by SaharaReporters showed that the case had yet to be filed.\nSee Also Politics Nigeria’s House Of Representatives To Reconvene On Monday Over Central Bank Governor, Emefiele’s Presidential AspirationThis sparked the outrage of Nigerians who highlighted the massive corruption cases the CBN governor is currently enmeshed in.\nHowever, a source told SaharaReporters that Emefiele made financial arrangements for the groups to procure the nomination form for Adesina.\nSee Also Politics Governors Pull Out Of Committee Set Up To Push Presidential Ambition Of Central Bank Of Nigeria Governor, Godwin Emefiele“Emefiele’s Presidential project started with Buhari’s cabal member, Ismaila Isa Funtua who is now late."
  },
  {
    "headline": "EXCLUSIVE: Emefiele Currently Scouting For Court Order To Retain His Position As Nigeria’s Central Bank Governor While Contesting For Presidency — Source",
    "summarized_story": "The Governor of the Central Bank of Nigeria, Godwin Emefiele, is currently scouting for judges to issue a court order that will allow him to retain his position at the apex bank while campaigning for the Presidency, SaharaReporters has learnt.\nHowever, as of the time of filing this report, checks by SaharaReporters showed that the case had yet to be filed.\nSee Also Politics Nigeria’s House Of Representatives To Reconvene On Monday Over Central Bank Governor, Emefiele’s Presidential AspirationThis sparked the outrage of Nigerians who highlighted the massive corruption cases the CBN governor is currently enmeshed in.\nHowever, a source told SaharaReporters that Emefiele made financial arrangements for the groups to procure the nomination form for Adesina.\nSee Also Politics Governors Pull Out Of Committee Set Up To Push Presidential Ambition Of Central Bank Of Nigeria Governor, Godwin Emefiele“Emefiele’s Presidential project started with Buhari’s cabal member, Ismaila Isa Funtua who is now late."
  },
  {
    "headline": "Nigerian University Lecturers, ASUU Confirms Extension Of Strike By 3 Months",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has extended its strike by 12 weeks.\nThis was confirmed by the National President of ASUU, Prof. Emmanuel Osodeke who spoke to SaharaReporters on Monday morning.\nThe academic body took the decision at an emergency National Executive Council (NEC) held at ASUU Secretariat in Abuja.\nMembers of the union had embarked on a one-month strike on February 14 over the failure of the Nigerian Government to honour the various agreements reached with them.\nSome of ASUU’s demands include the release of revitalisation funds for universities, renegotiation of the 2009 FGN/ASUU agreement, release of earned allowances for university lecturers, and deployment of the UTAS payment platform for the payment of salaries and allowances of university lecturers."
  },
  {
    "headline": "Nigerian University Lecturers, ASUU Confirms Extension Of Strike By 3 Months",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has extended its strike by 12 weeks.\nThis was confirmed by the National President of ASUU, Prof. Emmanuel Osodeke who spoke to SaharaReporters on Monday morning.\nThe academic body took the decision at an emergency National Executive Council (NEC) held at ASUU Secretariat in Abuja.\nMembers of the union had embarked on a one-month strike on February 14 over the failure of the Nigerian Government to honour the various agreements reached with them.\nSome of ASUU’s demands include the release of revitalisation funds for universities, renegotiation of the 2009 FGN/ASUU agreement, release of earned allowances for university lecturers, and deployment of the UTAS payment platform for the payment of salaries and allowances of university lecturers."
  },
  {
    "headline": "Telcos ask FG to remove 'nuisance taxes' as 5% duty on recharge cards takes effect June 1",
    "summarized_story": "Gbenga Adebayo, chairman, Association of Licensed Telecommunication Operators (ALTON), has asked the federal government to remove “nuisance taxes” placed on operators in the sector.\nLast week, TheCable reported that President Muhammadu Buhari had approved the collection of five per cent excise duty on telephone recharge cards and vouchers.\nSpeaking on the levies, Adebayo said operators faced about 36 levies and taxes, and an additional 5 per cent duty on recharge cards would take effect on June 1.\nAn additional 5% excise tax has now been considered effective for the first of June.\nWe’re saying any negative impact on the telecommunication sector will affect the entire economy."
  },
  {
    "headline": "Telcos ask FG to remove 'nuisance taxes' as 5% duty on recharge cards takes effect June 1",
    "summarized_story": "Gbenga Adebayo, chairman, Association of Licensed Telecommunication Operators (ALTON), has asked the federal government to remove “nuisance taxes” placed on operators in the sector.\nLast week, TheCable reported that President Muhammadu Buhari had approved the collection of five per cent excise duty on telephone recharge cards and vouchers.\nSpeaking on the levies, Adebayo said operators faced about 36 levies and taxes, and an additional 5 per cent duty on recharge cards would take effect on June 1.\nAn additional 5% excise tax has now been considered effective for the first of June.\nWe’re saying any negative impact on the telecommunication sector will affect the entire economy."
  },
  {
    "headline": "Emefiele asks court to declare him eligible to contest presidential election",
    "summarized_story": "Godwin Emefiele, governor of the Central Bank of Nigeria (CBN), has asked a federal high court in Abuja to declare him eligible to participate in the 2023 presidential election.\nEmefiele’s request is in a suit marked FHC/ABJ/CS/610/2022 and filed on May 5.\nThe suit was filed two days before the CBN governor said he had not made up his mind to run for office of the president.\nThree support groups bought him the All Progressives Congress (APC) presidential nomination form worth N100 million.\nAdvertisementThe aforementioned prayer is part of seven reliefs being sought by the CBN governor in the suit that has the Independent National Electoral Commission (INEC) and Abubakar Malami, attorney-general of the federation (AGF), as respondents."
  },
  {
    "headline": "Emefiele asks court to declare him eligible to contest presidential election",
    "summarized_story": "Godwin Emefiele, governor of the Central Bank of Nigeria (CBN), has asked a federal high court in Abuja to declare him eligible to participate in the 2023 presidential election.\nEmefiele’s request is in a suit marked FHC/ABJ/CS/610/2022 and filed on May 5.\nThe suit was filed two days before the CBN governor said he had not made up his mind to run for office of the president.\nThree support groups bought him the All Progressives Congress (APC) presidential nomination form worth N100 million.\nAdvertisementThe aforementioned prayer is part of seven reliefs being sought by the CBN governor in the suit that has the Independent National Electoral Commission (INEC) and Abubakar Malami, attorney-general of the federation (AGF), as respondents."
  },
  {
    "headline": "ASUU extends strike by 12 weeks",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has extended its ongoing strike by 12 weeks.\nIn a statement issued after the meeting, Emmanuel Osodeke, ASUU president, said the extension takes effect from Monday, May 9, 2022.\nThose in power turned their back on our degraded universities as they shuttle between Europe and America to celebrate the graduation of their children and wards from world class universities.\n“NEC condemned Federal Government’s cavalier attitude towards the strike action in the last twelve weeks.\nThe roll-over strike action is with effect from 12.01a.m."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "CAF is tackling Africa's $4bn cybersecurity threat",
    "summarized_story": "From ransomware attacks and phishing scams, to cryptojacking and malware, cybersecurity threats are on the rise as the world moves to become a “global village”.\nAlthough many African countries might not have the largest cybersecurity threats, they are still at risk of cyberattacks.\nThe top 5 cyber threats are online scams, digital extortion, business email compromise or BECs, ransomware, and botnets, and most were distributed through emails.\nUp until a few years ago, it was forbidden to send money, through Western Union, to Canada from Côte d’Ivoire.\nThe programme will take place in Abidjan, Côte d’Ivoire, on May 9 and 10, 2022."
  },
  {
    "headline": "CAR becomes first African country to legalise crypto",
    "summarized_story": "The Central African Republic (CAR) has just become the first African country to adopt bitcoin as a legal tender.\nAfter El Salvador, CAR is just the second country in the world to legalise it.\nKenya, Nigeria, Togo, South Africa, Ghana, and Tanzania are also featured in its Top 20 Global Crypto Adoption Index.\nIn fact, at 11%, CAR has the fifth-lowest internet penetration rate in Africa, and this brings into question the feasibility of crypto adoption in the country.\nNot sure how BEAC (central bank for 6 central African countries that use XAF currency tied to Euro) will react."
  },
  {
    "headline": "WhatsApp is adding more features",
    "summarized_story": "He’s expected to use his experience to assist the government in realising its plans to build a mega-city.\nFor more information, click here: Can Anambra State spearhead a digital revolution in South-East Nigeria with Fred Agbata’s appointment?\nWhatsApp has some new featuresOn Friday, May 6, 2022, Mark Zuckerberg, Meta’s CEO, announced in a Facebook post the launch of WhatsApp’s Reaction feature.\nPer a WhatsApp blog post, larger groups are being “slowly” rolled out, while emoji reactions and increased file size limits are making their way into the app’s current version.\nYou’ve probably seen the Reaction feature on Slack and Telegram."
  },
  {
    "headline": "Can Anambra State spearhead a digital revolution in South-East Nigeria with Fred Agbata’s appointment?",
    "summarized_story": "Share this article:The Anambra State Governor, Charles Chukwuma Soludo, has announced the appointment of Chukwuemeka Fred Agbata as the MD/CEO of the Anambra State ICT Agency for a four-year tenure.\nMuch of the growth in Nigeria’s tech sector has been seen in Lagos State.\nThe hub provides a place for state residents to convene and potentially build technological products.\nAccording to data from the National Bureau of Statistics, the South Eastern region of Nigeria, where Anambra State is, has the lowest Internet penetration rates, with 13.7 million users.\nIn Agbata’s experience and Soludo’s previous experience as a Governor of the Central Bank of Nigeria (CBN), the state could become a digital powerhouse."
  },
  {
    "headline": "TikTok will start rewarding creators",
    "summarized_story": "AdvertisementToday, I’ll be discussing:Problems YC-backed startups are solvingTikTok’s PulseTigerrise’s plan to improve mental healthWhat problems are YC-backed startups solving?\nIsn’t this fantastic news for TikTok Pulse creators?\nTigerrise to improve mental health accessPhoto by Emily Underworld on UnsplashIn Africa, mental health care is scarce.\nTo back up this claim, Kenya’s health ministry reports that 75% of people in need of mental health services cannot obtain them.\nVictoria Fakiya A writer with ADHD who is interested in mental health and how technology is improving the lives of Africans with ADHD."
  },
  {
    "headline": "Fidia ushers in the long-awaited revolution in the creator economy.",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nThey also shared a stronger bond – the desire to monetize their creative works without their location being a restriction.\nAllowing creators to support one another is another way to foster relationships among creators, Fidia successfully hacked this with the transfer feature, which is solely for cash transfers between Fidia creators.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Top 3 small-cap Metaverse coins for 2022: Mushe (XMU), Mist (MIST) & Highstreet (HIGH)",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nWith small-cap tokens, investors can sell as soon as the price increases beyond their target to garner a profit or hold onto their investments for the long term.\nWhat’s great about Mushe, MIST, and HIGH is that the tokens can be used in the metaverse.\nLearn more about Mushe (XMU)Official Website: https://www.mushe.world/Presale Registration: https://portal.mushe.world/sign-upTelegram: https://t.me/MusheWorldXMUTwitter: https://twitter.com/Mushe_WorldInstagram: https://www.instagram.com/mushe_world/Brand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Border closure fails to curb smuggling as food prices soar",
    "summarized_story": "“What we need to do is to make our agricultural commodities competitive,” Olorundenro added.\nExperts said the shortfall in the food supply resulted in surging prices during the border closure.\nIt was the policy that triggered an upsurge in food prices,” said a CEO who does not want his name mentioned in print.\nA 2021 report by the Institute for Security Studies says the border closure policy only resulted in creating new smuggling routes as illicit dealers were determined to move their goods across borders.\nHowever, the border closure policy spurs investments in the agricultural sector, especially in rice as farmers and millers ramped up production."
  },
  {
    "headline": "Border closure fails to curb smuggling as food prices soar",
    "summarized_story": "“What we need to do is to make our agricultural commodities competitive,” Olorundenro added.\nExperts said the shortfall in the food supply resulted in surging prices during the border closure.\nIt was the policy that triggered an upsurge in food prices,” said a CEO who does not want his name mentioned in print.\nA 2021 report by the Institute for Security Studies says the border closure policy only resulted in creating new smuggling routes as illicit dealers were determined to move their goods across borders.\nHowever, the border closure policy spurs investments in the agricultural sector, especially in rice as farmers and millers ramped up production."
  },
  {
    "headline": "Nigeria’s border closure brings ‘gains’, losses, hardship",
    "summarized_story": "In trade, while Nigeria’s imports from the ECOWAS region declined during the border closure, it was marginal but so did exports, except at a higher margin.\nWhile some local farmers reported making more money during the border closure, it was a nightmare for others.\nYet, they were supposed to be principal beneficiaries of the border closure.\nLast month, the Federal Government approved the re-opening of the Idiroko, Jibiya, Kamba, and Ikom land borders, after 32 months.\n“Nigeria gained absolutely nothing from the border closure,” says Emmanuel Ijewere, vice president of Nigeria Agribusiness Group."
  },
  {
    "headline": "Okomu Did Not Block Community Road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOkomu oil Palm Company Did Not Block the Road leading to the Community but dug a trench round its plantation to forestall theft of over ten tons of Banga daily.\nAccording to him, it was a peaceful protest to alert the management of the company that the trench blocked their road to the primary and secondary school, Catholic Church and other villages.\n“We have made several appeals to the government to assist us with electricity, roads, health centers and a secondary school” he added.\nThe DPO advised the protesting community to remain calm and go about their duties as law abiding citizens until the issues are resolved.\nThe Nigerian Observer gathered that the Enogie of Udo has also setup machineries in motion to resolve the issues at stake which he described as a breakdown in communication between the community and Okomu Oil Palm Company."
  },
  {
    "headline": "Edo NEWMAP urges media support in campaign to curb flooding, other environmental hazards – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Coordinator of Nigeria Erosion and Watershed Management Project (NEWMAP), Dr. Tom Obaseki, has canvassed for media collaboration in driving the conversation on flood control as the rains intensify.\nObaseki made the submission at a flood engagement workshop organised by the agency in Benin City, the Edo State capital.\nAccording to him, “The media has a crucial role in spreading information in bridging the knowledge gap and enhancing public awareness.\nThe media chooses which issues to highlight to its viewers and how to frame them, influencing what people perceive to be a priority.\n“We have built a total length of over 40kms of secondary drains."
  },
  {
    "headline": "Master Plan: Obaseki kicks off ‘Operation Plan Edo’ …exercise kicks off in Ugbor area – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has commenced ‘Operation Plan Edo,’ an exercise aimed at recertifying building plans and collecting data on socio-economic needs of communities within the Benin metropolis.\nAccording to her, “The programme enables the government to know what services and infrastructure the people need.\nThe ‘Operation Plan Edo’ will involve various ministries, such as Education, Roads and Bridges, Health, Power, among others”.\nShe called on citizens to cooperate with officials of the ministries and provide necessary information to help plan the city and State in line with the 30-year master plan.\nCondemning attacks on its staff by residents, she warned: “Edo State Government frowns at the attack on Staff of Ministry of Planning, Urban and Regional Planning on duty."
  },
  {
    "headline": "2023: Edo PDP’ll obey party decisions, Obaseki assures – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said the state’s chapter of the Peoples Democratic Party (PDP) will obey any decision reached by the party at the national level ahead of the presidential primary election as long as the decision is fair and just.\nHe said, “I believe that you know what the issues are in Nigeria today and have practically touched all of them.\nThere is nothing wrong when you throw your hat in the ring, and you’ve been quite clear and not ambiguous.\nThey also have the privilege to hear from you and know the decision to take when the time comes,” Obaseki noted.\nI know the country very well and the people of the country know me."
  },
  {
    "headline": "Banks move to acquire discos over N860bn debt",
    "summarized_story": "Already, two of the eleven discos, Ibadan Electricity Distribution Company (IEDC) and the Abuja Electricity Distribution Company (AEDC) have been acquired by their lenders.\nAfter several failed debt restructuring deals, the United Bank for Africa (UBA), forcefully took over the Abuja Electricity Distribution Company Plc.\nBenin DisCo owes the market N28.75 billion after remitting N25.91 billion (47.4 percent) of the N54.65 billion invoice, while AEDC remitted N48.48 billion (63.89 percent) of the N75.87 billion invoice leaving a debt of N27.4 billion.\nJos DisCo has a shortfall of N21.26 billion in the nine-month period, remitting only N9.62 billion (31.2 percent) of N30.88 billion invoice, while Kano DisCo paid in N24.01 billion (55.3 percent) of its N43.4 billion invoice.\nThe laggard is Yola DisCo which remitted only N2.01 billion (10.1 percent ) of the total N19.95 billion invoice received from NBET."
  },
  {
    "headline": "ASUU extends strike for another three months",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has rolled over its ongoing strike for another 12 weeks.\nProf. Emmanuel Osodeke, ASUU president in a statement said this was to give the government enough time to satisfactorily resolve all the outstanding issues.\nIt also stated that the roll-over strike was effective from 12.01 am, May 8, 2021.\nASUU said it took this decision after its National Executive Council meeting which started on Sunday night at the Comrade Festus Iyayi National Secretariat, University of Abuja."
  },
  {
    "headline": "Hackers wreck havoc on Nigerian businesses – Rake in over N60 billion in 2021",
    "summarized_story": "By ADEBAYO OBAJEMUCompanies in Nigeria are having nightmares over cyber attacks, which is increasing their cost operations.\nDeposit money banks, for instance, are spending huge sums on cyber security programmes to wade off such unwelcomed visitors.\n“I just simply got access to their (Nigeria) data of internal files, users and everything they have.\n57% of Nigerian organisations said their public cloud data was exposed in the last year.\nIts enforcement is the shared responsibility of the Attorney-General of the Federation and the National Security Adviser."
  },
  {
    "headline": "NB plc, Guinness Nigeria win big, post strong performance",
    "summarized_story": "Details show that NB PLC recorded a profit of N13.61 billion, representing a 77.71 per cent increase over the N7.6billion it achieved in 2021.\nAccordingly also, Nigerian Breweries (NB) Plc posted a N137.8 billion first quarter 2022 revenue, representing a 30.4 percent growth from N105.7 billion in 2021.\nNB Plc also recorded 80.7 percent growth in its profit before tax to N20.76 billion from N11.51 billion it achieved in the corresponding period of 2021.\nCommenting on the announcement, Mr. Baker Magunda, Managing Director/CEO, Guinness Nigeria Plc said: “In the first nine months of fiscal 22, Guinness Nigeria continued to grow on the back of the strong recovery in the first half of fiscal 22.\nAll of our efforts delivered an operating profit growth of 200 per cent to N22.9 billion.” Magunda explained."
  },
  {
    "headline": "Rivers: Detained PDP Guber Aspirant To Remain In Detention Till May 23",
    "summarized_story": "The trial of the detained governorship aspirant on the platform of the Peoples Democratic Party (PDP) in Rivers State and member of the House of Representatives, Hon.\nDagogo, has accused Rivers State governor, Nyesom Ezenwo Wike, of plotting to nail him with falsehood.\nDoctor Farah Dagogo.\nDoctor Farah Dagogo is not a criminal, he has never been charged as one, neither has he been convicted of such an offense.\nDoctor Farah Dagogo had stated his role publicly, the sacrifices and the overtures he rejected.”"
  },
  {
    "headline": "Lawan, Ooni, Dangote, Others To Attend Adeola’s Installation As Aremo-Oba",
    "summarized_story": "Adeola is expected to be installed with the title by President of Yewa Traditional Council, the Olu of Ilaro and Paramount Ruler of Yewaland, Oba Kehinde Olugbenle, next weekend at Ilaro, Yewa South Local Council of Ogun State.\nThe installation, which also included a title of Yeye Aremo for the senator’s wife, Temitope, is expected to be witnessed by all Yewa Obas, as well as other monarchs in Ogun State and Lagos State.\nThe 10th-anniversary celebration will also witness the public presentation of the autobiography of Oba Olugbenle.\nHe also explained that the event had the approval of the entire Yewa Traditional Council, alongside other 49 royal fathers in Yewaland under the chairmanship of the Olu of Ilaro and Paramount Ruler of Yewaland, Oba (Dr.) (ESV) Kehinde Olugbenle.\n“The unprecedented installation which also included a title of Yeye Aremo for the Senator’s wife, Temitope, is expected to be witness by all Yewa Obas as well as other Obas in Ogun State and Lagos State."
  },
  {
    "headline": "BREAKING: ASUU Extends Strike By 3 Months",
    "summarized_story": "The Academic Staff Union of Universities (ASUU), has further extended its ongoing strike by another 12 weeks.\nThe decision was taken at an emergency National Executive Council (NEC) meeting held at ASUU national secretariat in Abuja.\nThe extension of the industrial action by three months followed the expiration of its additional two-month warning strike on Monday.\nASUU national president, Emmanuel Osodeke, confirmed the development when he featured on Raypower FM’s programme, ‘Political Platform’, monitored by our correspondent in Abuja.\nHe said, “ASUU is extending its action because government has refused to address the issues."
  },
  {
    "headline": "BREAKING: ASUU Extends Strike By 3 Months",
    "summarized_story": "The Academic Staff Union of Universities (ASUU), has further extended its ongoing strike by another 12 weeks.\nThe decision was taken at an emergency National Executive Council (NEC) meeting held at ASUU national secretariat in Abuja.\nThe extension of the industrial action by three months followed the expiration of its additional two-month warning strike on Monday.\nASUU national president, Emmanuel Osodeke, confirmed the development when he featured on Raypower FM’s programme, ‘Political Platform’, monitored by our correspondent in Abuja.\nHe said, “ASUU is extending its action because government has refused to address the issues."
  },
  {
    "headline": "Anambra Group Writes PDP Over Oduah’s NYSC Certificate",
    "summarized_story": "A group, under the umbrella body of Concerned Anambra North Peoples Democratic Party Stakeholders, has asked the national chairman of the party to order a former minister of aviation, Senator Stella Oduah, to produce her National Youth Service Corps (NYSC) certificate.\nThe group said failure to produce the certificate, she should be disqualified from participating in the party’s primary for Anambra North Senatorial election.\n001 in which Oduah claimed she had lost her NYSC certificate.\nThe PDP stakeholders in Anambra North said this claim is doubtful saying NECA is not in a position to confirm whether Oduah did NYSC or not.\nThe stakeholders are demanding that the PDP screening panel subject Oduah to strict documentary proof of all her claims on primary school attendance, certificate and the NYSC."
  },
  {
    "headline": "Russia causes jitters in Ukraine as it marks anniversary of WWll",
    "summarized_story": "Russia has marked the 77th anniversary of the Soviet Union’s victory over Nazi Germany in World War Two, triggering jitters in neighbours Ukraine.\nThe conflict is largely called the Great Patriotic War in Russia, and May 9 is one of the country’s most revered holidays.\nIn Ukraine, Russia’s celebration triggered further trepidations on what to expect from the aggressor.\nread moreThe G7 said it was committed to phasing out or banning Russian oil and denounced Putin’s invasion of Ukraine.\n“His actions bring shame on Russia and the historic sacrifices of its people,” the group said, referring to Soviet Russia’s role in defeating Nazi Germany 77 years ago."
  },
  {
    "headline": "Voting begins in Australia",
    "summarized_story": "Australia on Monday began voting two weeks ahead of election day, with surveys showing the opposition centre-left Labour Party extending its lead and Prime Minister Scott Morrison suffering a fall in his approval rating.\nThe Australian newspaper showed Labour leading 54 per cent-46 per cent on a two-party preferred basis against the Morrison-led Liberal Party-National Party coalition government.\nEarly voting began a day after a televised debate between Morrison and Albanese who at times yelled at each other, making it hard for either to make a point.\nHe only had smears and that smirk throughout it all,” Albanese told reporters on Monday.\nAdvance voting has gained popularity in Australia."
  },
  {
    "headline": "UPDATE: Police Confirm Attack By Unknown Gunmen On Truck Conveying Cows In Anambra",
    "summarized_story": "UPDATE: Police Confirm Attack By Unknown Gunmen On Truck Conveying Cows In AnambraThe Anambra State Police Command has confirmed that a truck conveying cows was set on fire in the state.\nNews Direct Reporter had reported how gunmen set ablaze a truck loaded with cows along Uga-Ezinifite Road in the Aguata Local Government Area of the state.\nAn eyewitness had said the truck was being driven by northerners before it was attacked by the gunmen who set it on fire.\nThe spokesperson for the state police command, Tochukwu Ikenga in a statement said a suspect had been arrested in connection with the attack.\nFrom videos shared, some of the traders were seen running, as they assumed the gunmen came back to attack them."
  },
  {
    "headline": "JUST IN: Emefiele Seeks Court Clarification Over Presidential Ambition Without Resigning As CBN Governor",
    "summarized_story": "JUST IN: Emefiele Seeks Court Clarification Over Presidential Ambition Without Resigning As CBN GovernorThe Central Bank of Nigeria’s Governor, Godwin Emefiele, has filed a lawsuit seeking clarification on whether he may continue in office while running for president.\nMr Emefiele’s lawyer, Mike Ozekhome, filed the complaint in the Abuja Division of the Federal High Court on Monday.\nOn Monday morning, Mr Ozekhome confirmed the news to NEWS DIRECT, stating, “I just finished filing the suit on behalf of my client, and we are still in court now.”The governor of the Central Bank of Nigeria has come under significant public pressure to resign if he intends to run for president next year.\nDetails later…"
  },
  {
    "headline": "Nigerian University Lecturers, ASUU Confirms Extension Of Strike By 3 Months",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has decided to continue its strike for another 12 weeks.\nProf. Emmanuel Osodeke, the National President of ASUU, verified this to SaharaReporters on Monday morning.\nAt an emergency National Executive Council (NEC) meeting convened at the ASUU Secretariat in Abuja, the academic body made the decision.\nThe emergency meeting began on Sunday and finished early Monday morning, with major officers and branch chairmen in attendance.\nOn February 14, members of the union began a one-month strike in protest of the Nigerian government’s inability to honor different agreements signed with them."
  },
  {
    "headline": "Tinubu Drops Cryptic Post After Rumours Over Jibrin’s Defection",
    "summarized_story": "The APC leader’s post came just hours after Abdulmumin Jibrin, the director-general of the Tinubu support group council, announced his departure from the party.\nAccording to TheCable, Jibrin decided to leave the party after a spat with Kano Governor Abdullahi Ganduje.\nOn Sunday, Kano APC chairman Abdullahi Abbas claimed Ganduje has begun measures to prevent Jibrin from defecting from the party.\nGanduje, he claimed, has requested for the problem among those aspiring to represent the federal constituency of Kiru/Bebeji to be resolved.\n“Abdulmumin Jibrin Kofa has already accepted the proposal and is ready to attend the meeting.”"
  },
  {
    "headline": "[Breaking] Resurfaced fuel queues: NNPC heaps blame on Sallah",
    "summarized_story": "The Nigeria National Petroleum Company Limited (NNPCL) has said the long sallah celebration was responsible for the mild queues in the federal capital territory.\nFuel queues resurfaced at the weekend in the FCT.\nThis is after motorists in the city endured a hallowing three months of fuel scarcity with black marketers having a field day.\n“The NNPC Ltd notes the sudden appearance of fuel queues in parts of Abuja.\n“The NNPC Ltd hereby advises motorist not to engage in panic buying as supplies are adequate as will become increasingly evident in the coming days,” NNPC said."
  },
  {
    "headline": "Breaking: Nigerian students to remain idle as ASUU extends strike",
    "summarized_story": "Nigerian students will still remain with outside school after the Academic Staff Union of Universities (ASUU) on Monday announced extension of its strike for another three months.\nThis is after its earlier 90 days warning strike ended on Sunday May 8, 2022.\nThe ongoing strike was triggered after the government, according to ASUU failed to abide by earlier decisions with University lecturers.\nASUU had embarked on about one year strike between 2020 and 2021.\nDetails loading…Share this: TwitterFacebook"
  },
  {
    "headline": "Flight suspension: Ibom, Green Africa, Arik back out, AON calls off threat, fuel queue returns to Abuja",
    "summarized_story": "The planned suspension of flight operations by scheduled airline operators in the country due to commence Monday has been halted, with some airlines backing out of the arrangement.\nThe Airline Operators of Nigeria (AON), the umbrella body of airline owners, had Friday announced the joint decision to halt all operations.\nThe statement said: “Overtime, aviation fuel price (JetA1) has risen from N190 per litre to N700 currently.\nWhile aviation fuel worldwide is said to cost about 40% of an airline’s operating cost globally, the present hike has shut up Nigeria’s operating cost to about 95%.\nAON surrendersThe operators later caved in to pressure Sunday evening and in another statement announced the suspension of the action."
  },
  {
    "headline": "Adegbite extols gemstone, Jewellery grandaunts",
    "summarized_story": "Adegbite gave this commendation on Friday, during the graduation ceremony of the first batch of the gemstone and jewelry making trainees of the Abuja Chambers of Commerce and Industry.\nWhile addressing the graduands, the minister charged them to impart the knowledge they have acquired to others in their communities.\nAdegbite further assured them as he disclosed that the second phase of the training was in progress.\nHe commended the doggedness of the 21 participants of the first batch of the training for staying through to the end.\nThe Project Coordinator disclosed that there are plans for advanced training for the 21 successful master training graduands, this, he said would be communicated to them in due course."
  },
  {
    "headline": "NHP Taraba named ‘Muhammadu Buhari’ Housing Estate",
    "summarized_story": "…,To promote decent housing access for the people of Taraba State.\n– Taraba State GovernorBy Chioma NnodimMinister of State for Works and Housing Mr.Mu’azu Jaji Sambo, Executive Governor of Taraba State Darius Dickson, Ishaku, top government officials and local residents in Jauro –Yinu Taraba State converged at the commissioning and handover ceremony of National Housing Programme in Jalingo Taraba State, as Sambo named the National Housing Programme in Jalingo, Taraba Stste Muhammadu Buhari Housing Estate weekend.\nIt is on this note and for his contribution to National Development through the National Housing Programme that I, Mu’azu Jaji Sambo Hon.\nMinister of State, Works and Housing name the National Housing Project site in Jalingo , Taraba State as “ Muhammadu Buhari Housing Estate , Jalingo,” Sambo said.\nThe use of available local building materials in the National Housing Programme has stimulated the economy through the production and use of local materials ."
  },
  {
    "headline": "Customs seize poisonous bags of rice imported from India",
    "summarized_story": "According to acting Controller Ejibunu, “Pursuant to the Federal Government’s policy that encourages local production of rice against the importation of foreign parboiled rice, this Unit had seized 7,259 (of 50 kg each) bags of rice, which is an equivalent of over twelve (12) trucks load.\n“Consequent upon this laboratory analysis on the foreign parboiled rice; as a responsible government agency, we are letting Nigerians know that apart from the negative economic impact of importing foreign rice into the country, some of these imported rice are unhealthy for human consumption.\nThus, we advise consumers to desist from patronizing the federal government banned foreign parboiled rice.\n“We as citizens have a collective responsibility to safeguard our economy and health for the benefit of all.\n“A total of twelve suspects were arrested in connection with some of the seizures; for committing various Customs offences."
  },
  {
    "headline": "33% Pension increase: PHCN retirees excluded by wages commission – PTAD",
    "summarized_story": "“This is because PHCN pensioners were already on a special salary structure before the Pension review for Pensioners who while in service were on one of the Harmonized Salary Structures of the Federal Public Service.\n“It should be noted that PHCN pensioners took the Federal Government to the National Industrial Court (NIC) Abuja on this issue.\nAfter several engagements, President Muhammadu Buhari, approved the implementation of 9.7% increase in the pensions of Ex-PHCN Retirees under the Defined Benefit Scheme (DBS).\nIt is therefore preposterous and uncalled for that this group wants to conveniently forget the amicable agreement reached by all parties and arm-twist the Federal Government to make claims on the 33% pension increment,” PTAD said in a statement it issued on Friday.\nThe pensioners reportedly alleged that PTAD colluded with some “powerful individuals” to deprive them of the 33% pension increment as approved by the federal government in 2010."
  },
  {
    "headline": "PBR Cowpea has revolutionalised Nigeria’s food production – NABDA DG",
    "summarized_story": "By Eunice OrikeAs Nigeria prepares for the 2022 planting season, director-general of the National Biotechnology Development Agency NABDA, Prof. Abdullahi Mustapha, has commended the Pod Borer Resistant PBR, Cowpea for revolutionalising Nigeria’s food production.\nMustapha who spoke during a press conference on the commercialisation of the new variety of cowpea, said that the food crop is revolutionalising Nigeria’s food production with its tremendous yield, quick harvest, non-shattering and good cooking characteristics.\nAnd that if the 3 million hectares, PBR Cowpea is planted on 1million hectares, the savings on the cost of insecticide is N16,200 billion annually.\n“The feat attained with the development and commercialisation of the PBR Cowpea has, again, proven that if determined, Africa has what it takes to solve its challenges.\nSpeaking on the safety of the improved PBR Cowpea, the director-general, National Biosafety Management Agency (NBMA), Dr. Rufus Ebegba, assured Nigerians the crop is safe for both human consumption and the environment."
  },
  {
    "headline": "BREAKING: Court Refuses Emefiele’s Request To Restrain INEC, AGF Over Presidential Ambition",
    "summarized_story": "A Federal High Court in Abuja has refused the Governor of the Central Bank of Nigeria (CBN), Godwin Emefiele’s request to restrain the Independent National Electoral Commission (INEC) and the Attorney General of the Federation (AGF) Abubakar Malami preventing him from his Presidential Ambition.\nThe CBN Governor on Monday told the Court in Abuja that he can run for the post of the President of the Federal Republic of Nigeria without vacating his position as the CBN Governor.\nREAD ALSO: Emefiele Seeks Court Ruling To Run For President As CBN GovernorThe CBN Governor through his Counsel, Mike Ozekhome, told the court that Section 84 ((12) of the Electoral Act as amended, 2022 does not affect him, being a public servant and not a political appointee.\nThe court in its ruling, however, summonsed INEC, and AGF to appear before it on May 12, to show cause on why status quo antebellum, should not be granted to the CBN Governor."
  },
  {
    "headline": "ASUU Extends Strike By 12 Weeks",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has extended the ongoing strike by twelve weeks, the president of the union, Prof Emmanuel Osodeke said on Monday.\nThe planned trip by spouses of vice-chancellors, ASUU said, is “despicable and condemnable”.\n“The advertised five-day conference in Istanbul is a waste of scarce resources of our universities; it is insensitive and provocative, particularly at a time like this when lecturers are denied their salaries for daring to struggle to improve the lot of our public universities,” ASUU maintained.\nThe extension came days after the Federal Government said it would resume talks with the striking lecturers this week.\nLabour and Employment Minister, Chris Ngige, had said this on Friday after meeting with the National Association of Academic Technologists (NAAT)."
  },
  {
    "headline": "Fuel Queues: NNPC Assures Of Supplies, Warns Against Panic Buying In Abuja",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) has assured residents of Abuja against panic buying of fuel, assuring that the agency has adequate supply despite the resurgence of queues in the city.\nThis is according to a series of tweets on the NNPC handle late Sunday.\nThe statement added that the “increased fuel purchases which are also usual with returning residents of the FCT from the public holidays”.\nREAD ALSO: Buhari Condemns Zamfara Attacks, Asks Military To End Bandits’ ActivitiesThe recent development is coming a few months after fuel queues resurfaced in the country due to the importation of “bad fuel” into Nigeria.\nThe House of Representatives had then called on the NNPC to suspend the companies involved in the importation."
  },
  {
    "headline": "UPDATED: Airline Operators Suspend Withdrawal Of Services Hours To Deadline",
    "summarized_story": "The Airline Operators of Nigeria (AON) has suspended its decision to withdraw its services across all airports in the country.\nAON President, Abdulmunaf Sarina, announced the suspension on Sunday in a statement jointly signed by six members of the association.\nOthers are Roy Ilegbodu – Chief Executive Officer of Arik Air; Abdullahi Mahmood – Chief Executive Officer of Aero Contractors; and Allen Onyema – Chairman of Air Peace.\nEarlier, the Ministry of Aviation had assured Nigerians that members of AON were reviewing their decision to withdraw services on Monday, May 9.\nIt confirmed that Ibom Air, Green Africa Airlines, Arik Air, Dana Air, and others said they would carry on with their normal flight schedules."
  },
  {
    "headline": "When I Become Next President, I Will End Insecurity In Kaduna – Saraki",
    "summarized_story": "A presidential aspirant of the Peoples Democratic Party (PDP), Dr. Bukola Saraki, has said that he would end insecurity in Kaduna when he becomes the next president of Nigeria.\nDr. Saraki stated this on Sunday when he met with PDP Delegates and Leaders in Kaduna State.\n“This is why, when I met with the PDP Delegates and Leaders in Kaduna State today, I pledged that with their support, when I become the next President of Nigeria, I will end the insecurity in Kaduna, across the North West, and all-around Nigeria,” Saraki declared.\nToday, with the insecurity around Kaduna, traveling to and from the state has become dangerous and quite tedious.\n“Therefore, I will ensure that we deploy the latest tools, equipment, and technology to bring an end to banditry and terrorism across the nation.”For Dr. Saraki, security is a major focus of his presidential campaign."
  },
  {
    "headline": "Tinubu charges delegates on competency in choosing APC candidate -",
    "summarized_story": "The National Leader and Presidential aspirant of All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu has advised the party delegates not to compromise competence and experience in electing APC, flagbearer at the party presidential primaries.\nSpeaking at a townhall meeting with party delegates in Adamawa and Taraba States, Tunubu acknowledged the effort of Buhari’s administration in tackling the inherited security challenges.\nCorrespondent Owolabi Adenusi reports that the presidential bid of the national leader of All Progressives Congress, Asiwaju Ahmed Tinubu has received another boost in Adamawa and Taraba States.\nThe national leader of the party on his part thanked the delegates for identifying with him, noting that the nation needs right leader to achieve desired success.\nAPC chairman in Taraba said the party delegates will work toward party successSome delegates expressed delight in the visit of the national party leader and assured his victory at the party primaries."
  },
  {
    "headline": "Hong Kong:Pro-Beijing committee elect fmr security chief John Lee as new leader",
    "summarized_story": "An election committee of nearly 1,500 mostly pro-Beijing members after a closed voting process on Sunday elected John Lee as Hong Kong’s next leader.\nLee received 1,416 votes in the election for chief executive, far exceeding the 751 votes required to win.\nHong Kong’s pro-democracy camp has long demanded universal suffrage, which they claim is guaranteed in the city’s mini-constitution, the Basic Law.\nThe election of Lee as Hong Kong’s next leader has raised fears that Beijing will tighten its grip on the territory.\nOver 150 people have been detained under the security law, which criminalises secession, subversion, terrorism, and collusion with foreign forces to meddle in city affairs."
  },
  {
    "headline": "Asiwaju Tinubu Intervenes in Kano APC Dispute -",
    "summarized_story": "All Progressives Congress National Leader, Asiwaju Bola Tinubu, has stepped in to resolve the local political squabbles between Abdulmunin Jibrin and key stakeholders in his constituency in Kano State.\nAbdulmumin Jibrin had announced his decision to leave the Kano State Chapter of the APC for an undisclosed party early on Saturday.\nThere had been a crisis of confidence between Jibrin and Kano State Governor, Abdullahi Ganduje, for some time over local political issues.\nAsiwaju Tinubu reportedly reached out to Governor Ganduje to reach a truce and ensure the unity withion the Kano State Chapter of the APC is not ruptured.\nThe source said Asiwaju Tinubu has already intervened on Jibrin’s behalf with Governor Ganduje and everything will be resolved."
  },
  {
    "headline": "Interest Groups obtain APC Nomination Forms for AfDB President, Adesina -",
    "summarized_story": "The President of the African Development Bank and former minister of Agriculture, Dr Akinwumi Adesina has picked up the N100m Expression of Interest and Nomination form for the 2023 presidential election.\nA coalition of 28 groups, led by the Head of One Nigeria Group, Mohammed Saleh, raised the fee to purchase the form for Adesina.\nThey include; Youth Arise Movement, Nigerians in Diaspora One Nigeria Group, Prudent Youth Association of Nigeria, women groups, farmers, people with disabilities and other civil society groups.\nThe former Minister joinsa crowded group of aspirants that have obtained the nomination form.\nSome of those who have obtained the forms are Vice-President Yemi Osinbajo, APC National Leader, Bola Tinubu, the Minister of State for Education, Emeka Nwajuiba; Pastor Tunde Bakare; Jigawa Governor, Mohammed Badaru."
  },
  {
    "headline": "‘Go Home’: Covid-Hit Shanghai, Beijing Tell Residents to Avoid Social Contacts",
    "summarized_story": "China’s two biggest cities tightened COVID-19 curbs on their residents on Monday, raising new frustration and even questions about the legality of its uncompromising battle with the virus.\nAs authorities wrestle with China’s worst COVID outbreaks since the epidemic began, authorities in its most populous city of Shanghai have launched a new push to end infections outside quarantine zones by late May, people familiar with the matter said."
  },
  {
    "headline": "Ukrainians Report Fierce Fighting as Russia Marks Soviet WW2 Victory",
    "summarized_story": "Russian President Vladimir Putin told his armed forces they were fighting for their country at a parade of Russian firepower in Moscow while his troops stepped up their 10-week-old assault on Ukraine.\nUkrainian officials said heavy fighting was underway in eastern Ukraine and warned people to take cover from expected missile strikes as Moscow marked the anniversary of the Soviet Union’s victory over Nazi Germany in World War Two."
  },
  {
    "headline": "Bitcoin Value Drops by 50% Since November Peak",
    "summarized_story": "The value of Bitcoin continued to fall over the weekend as it dropped below $34,000 (£27,630), according to the Coinbase cryptocurrency exchange.\nThe world’s largest cryptocurrency by market value has now fallen by 50% since its peak in November last year.\nThe slide in the value of digital assets comes as stock markets around the world also dropped in recent days.\nBitcoin accounts for about a third of the cryptocurrency market with a total value of $636bn.\nWith more traditional investors trading digital assets, cryptocurrencies have increasingly followed the movements of global stock markets."
  },
  {
    "headline": "Nigeria: Oil Marketers Raise the Alarm, Accuse Airline Operators of Trying to Force Subsidy on Aviation Fuel",
    "summarized_story": "The withdrawal forced the umbrella organisation, Airline Operators of Nigeria (AON), to stop the plan.\nOyebanji stated that the airline operators were trying to force the federal government to start controlling the prices of aviation fuel by fiat.\nOyebanji said, “Airline Operators are trying to pressurise government to control prices by fiat.\nWhat we are seeing is that traders are putting premium attention on the price of aviation fuel because all of us are scrambling for exactly the same barrel.\nAviation fuel is not like petrol for taxi."
  },
  {
    "headline": "Ahead of APC’s Presidential Primary, African Leaders Pressure Buhari to Annoint AfDB President Adesina",
    "summarized_story": "Some African leaders have mounted pressure on President Muhammadu Buhari to anoint President of the African Development Bank (AfDB), Dr. Akinwumi Adesina, as the presidential candidate of the All Progressives Congress (APC) in the 2023 general election, THISDAY learnt at the weekend.\nA reliable source told THISDAY that leaders in West Africa, including the presidents of Niger and Côte d’Ivoire, might have spoken to Buhari on behalf of the AfDB president.\nThe West African leaders are meeting Buhari in Abidjan on Monday and Tuesday, at a two-day conference organised by the United Nations, on the future of land, regarding desertification, drought, degradation, rights, restoration and implications for national and world economies.. Their mission?\nHe described Adesina as a man of proven integrity and experience, saying he performed well for Nigeria as Minister for Agriculture.\nWe are calling Adesina because it’s a call to save Nigeria, and I think he is going to accept.”"
  }
]