[
  {
    "headline": "Tinubu had surgery, I visited him in London to show support –Fayemi",
    "summarized_story": "Ekiti State Governor and Chairman of the Nigeria Governors’ Forum, Kayode Fayemi, has said that he visited All Progressives Congress National Leader, Bola Tinubu, in London recently to show support for the ailing politician.\nAccording to the governor, Tinubu had surgery and he had visited the former Lagos State governor alongside his Ondo State counterpart, Rotimi Akeredolu, to show solidarity.\nFayemi also said his visit to Tinubu was not connected to the 2023 general elections.\nAt least over 30 politicians have visited Tinubu, in London, in the last two months.\n); Lagos State Governor, Babajide Sanwo-Olu; Kano State Governor, Umar Ganduje; Ogun State Governor, Dapo Abiodun; as well as Fayemi and Akeredolu."
  },
  {
    "headline": "2023 Presidency: Only God knows what the future holds for me, says Fayemi",
    "summarized_story": "Ekiti State Governor and Chairman of the Nigeria Governors’ Forum, Kayode Fayemi, says only God knows what his political future holds in the 2023 general elections.\nFayemi’s presidential campaign posters had gone viral in August 2020 and had sparked public debate on various social media platforms regarding the possibility of his candidacy in the 2023 presidential election.\n“What the future holds, God knows, but we will cross that bridge when we get there.\nFor now, my primary responsibility is Ekiti State.”The governor also predicted victory for his party, the All Progressives Congress, in 2023.\nFayemi was first Ekiti State governor from October 2010 to October 2014."
  },
  {
    "headline": "Alleged nude photos: Court fixes Oct 21 for arraignment of Ohakim",
    "summarized_story": "Ikedi OhakimThe Federal High Court, Abuja, has fixed Oct. 21 for arraignment of former Imo Governor, Mr Ikedi Ohakim, for allegedly threatening to release nude photos of an Abuja-based woman, Mrs Chinyere Amuchienwa.\nJustice Taiwo Taiwo ordered the Attorney-General of the Federation (AGF) and Minister of Justice, to take over the prosecution of Ohakim from the Inspector-General of Police, at the resumed trial on Monday.\nThe police had filed criminal charges against Ohakim and Chinedu Okpareke over alleged threat to life and threat to release nude pictures of Amuchienwa.\nCounsel to Ohakim, Mr Emeka Etiaba (SAN), however, opposed the request by the AGF to take over the matter and prayed the court to dismiss the application.\nHe subsequently adjourned the matter until Oct. 21 for arraignment of the former governor and beginning of trial."
  },
  {
    "headline": "Anambra police command seeks Public partnership for effective policing",
    "summarized_story": "Mr Tony Olofu, Anambra Commissioner of Police, has called for quality partnership between the public and the command in order to achieve the enabling environment for economic and political activities of the state.\n“I sue for public order, public safety, peace and tolerance among all residents and political parties in the state for the command to serve the public optimally.\nOlofu reiterated his calls of peaceful political activities in the state to representatives of different political parties in Anambra as they engaged into electioneering activities.\nThe Police boss assured the people of Anambra that the Command is committed to working with other stakeholders towards ensuring public order all through the political campaigns.\nHe urged members of the public to coordinate themselves and cooperate with the security agents in the course of discharging their constitutional duty."
  },
  {
    "headline": "Oil Wells: Gov Uzodimma expresses confidence, says Imo’ll get justice",
    "summarized_story": "The Imo State Governor, Senator Hope Uzodimma, has expressed confidence that “Imo State will eventually get justice at the Supreme Court and get back what belongs to her”.\nHe added that the State will also be receiving an additional N8 billion monthly from Federal Allocation.\nHe stated that though the Committee on Boundary Adjustment through boundary demarcation had given back the oil wells to Imo State, the Rivers State Government had taken the matter to the Supreme Court, all in an effort to continue to deny Imo State what belongs to her.\nIn strong disapproval, Governor Uzodimma disclosed that despite the fact that some of the disputed oil wells are located in Local Government Areas like Ejemekwuru in Oguta LGA, Imo State, some selfish Imo indigenes, benefiting from the scam, are working against this recovery process.\nThe Governor, therefore, expressed confidence that Imo State will get justice."
  },
  {
    "headline": "Nigeria peaceful in spite of pockets of insecurity — Gov Bagudu",
    "summarized_story": "Chairman of the PGF and Governor of Kebbi State, Atiku BaguduThe Kebbi state governor, Alhaji Atiku Bagudu, says Nigeria remains largely peaceful, in spite of the pockets of insecurity in the country.\nBagudu stated this at the closing of the 2021 edition of the Argungu Polo Tournament, in Argungu Local government area, on Sunday, at which NSK Argungu Polo team defeated Ayutan Polo team in the tournament.\nREAD ALSONigeria’s 61st anniversary: Uzodimma urges Nigerians to maximise their unityHe said,” in spite of unimaginable acts by some few individuals who do not wish the country well, Nigeria still remains united.\n“We commend the doggedness, resilience and commitment of the Emir of Argungu, Alhaji Samaila Mera, as well as all the stakeholders in ensuring the success of the event.\nBagudu recalled that recently the company announced a whopping additional investments of over N30 billion in collaboration with the First Bank of Nigeria."
  },
  {
    "headline": "Nigeria/Niger borders security network arrest bandits’ informants — Chairman",
    "summarized_story": "By Musa Na AnnabiThe Communities alongside Nigeria/Niger Border in Illela Local Government Area Sokoto State and Konni town in the Niger Republic are working in synergy to forestall bandits and other criminals activities within their communities.\nTo this end, the communities arrested seven persons suspected to be Bandits informants and handed them over to the security agents.\nHe noted that the economy of the area is on the verge of collapse as a result of increased Bandits attacks and kidnapping for ransom.\nShehu further said for time immemorial Illela and Konni communities share common goals among their people despite living in different republics.\nAccording to him, when recruited, the vigilante’s members would be empowered to work diligently and maintain synergy with all sister security organisations in fighting crimes in the area."
  },
  {
    "headline": "Blame FG for persistent industrial actions – NASU",
    "summarized_story": "The Non-Academic Staff Union of Universities and Associated Institutions (NASU) and the Senior Staff Association of Universities Teaching Hospitals Research Institutes and Associated Institutions (SSAUTHRIAI) have opined that the persistent industrial actions in the country are largely due to the non-implementation of agreements by the government.\nImo NASU tasks FG to approve special salary scheme for staff, embarks on protestHe observed that it is becoming problematic because every day, the government signs a Memorandum of Understanding (MoU) and Memorandum of Agreements (MoA).\nHe said that they are asking that both research and non-research staffers should also enjoy 65 years of retirement age, saying that the academic staff in research institutes are already enjoying this.\nMr Akintola Benjamin noted that they are saying it should be extended to all the staff, in order to stem migration from research institutes to other sub-sectors.\nBuhari govt looking for trouble – NASU warns against workers’ pay cut"
  },
  {
    "headline": "Insecurity, not only COVID-19 responsible for mass failure in 2021 UTME – Agboola",
    "summarized_story": "An Ibadan-based energy expert, Mr. Olusegun Agboola, has said that the COVID-19 pandemic is not the only cause of mass failure recorded during this year’s Unified Tertiary Matriculation Examination (UTME).\nJAMB Registrar, Professor Isiaq Oloyede, noted that the COVID-19 pandemic is the cause of the mass failure.\nBut, Agboola while reacting, noted that the outback of COVID-19 is not the only cause of mass failure among the students.\nAgboola, while speaking at Cathedral of St Peter, Aremo, Ibadan, during the fifth year remembrance of Chief Ezekiel Ayoola Agboola, insisted that insecurity and infrastructural decay also contributed to the mass failure recorded in this year’s Unified Tertiary Matriculation Examination (UTME).\nAgboola, while speaking further, added that it is time for all stakeholders to rise up and tackle the menace of mass failure and out-of-school children."
  },
  {
    "headline": "Tondo fumes, threatens legal action against INEC over disenfranchisement of IDPs in Benue",
    "summarized_story": "A former Commissioner for Lands and Survey in Benue State, Surv.\nTondo, in a statement released on Monday, said it would be very much appreciated if registration centres for the physical registration of voters are located in the IDP camps in Benue State.\nIt is in furtherance of these rights that the extant Electoral Act provides for continuous voters’ registration and constant updating of the Voters’ Register by INEC.\n“Facilities to enable online registration are non-existent in the IDP Camps at the moment.\nEven if such facilities were to be made available in the IDP Camps, it is a known fact that the level of illiteracy, including computer – illiteracy, is very high in Nigeria."
  },
  {
    "headline": "COVID-19: How rich countries prevent poor ones from accessing vaccine – Lai Mohammed",
    "summarized_story": "The Federal Government has said some rich countries are stopping poor countries from procuring the COVID-19 vaccine.\nLai Mohammed, Minister of Information and Culture, said the financial strength of some countries to purchase the COVID-19 vaccine has caused “vaccine rationalism.”He disclosed this during his speech to mark the World Tourism Day held in Birnin Kebbi, Kebbi State, on Monday.\nWhereas some rich countries are already talking of third booster shots, many low and middle-income countries have not even given one shot to their citizens.\n“Added to this is the restriction placed on the citizens from certain countries by the rich nations.\nIt is therefore imperative for the rich countries of the world to retrace their steps and embrace a collective and equitable global strategy for COVID-19 vaccine manufacturing, procurement, and distribution."
  },
  {
    "headline": "Buhari not against Igbos, will release Nnamdi Kanu – Air Peace Chairman, Onyema [VIDEO]",
    "summarized_story": "The Chairman of Air Peace, Allen Onyema, has expressed hope that President Muhammadu Buhari would release Nnamdi Kanu, a pro-Biafra activist.\nOnyema said Buhari would release Kanu if approached properly.\nPDP chieftain, Allen Nwachukwu buried, described as political colossusAccording to Onyema: “This president, President Muhammadu Buhari, quote me, I say it again, he is not against Ndigbo.\n“President Muhammadu Buhari will one day release our brother [Nnamdi Kanu].\nHe honoured my requests.”This is coming at a time when Buhari visited Imo State, after criticisms of ignoring the Southeast."
  },
  {
    "headline": "Alleged nude photos: Court fixes Oct. 21 for arraignment of Ohakim",
    "summarized_story": "Agency Reporter- Advertisement -The Federal High Court, Abuja, has fixed Oct. 21 for the arraignment of former Imo Governor, Mr Ikedi Ohakim, for allegedly threatening to release nude photos of an Abuja-based woman, Mrs Chinyere Amuchienwa.\nThe police had filed criminal charges against Ohakim and Chinedu Okpareke over alleged threat to life and threat to release nude pictures of Amuchienwa.\nHowever, before Ohakim arraignment, the police filed a notice of discountenance of the matter on March 15, same day the AGF informed the court that he was taking over the matter.\nCounsel to Ohakim, Mr Emeka Etiaba (SAN), however, opposed the request by the AGF to take over the matter and prayed the court to dismiss the application.\nHe subsequently adjourned the matter until Oct. 21 for arraignment of the former governor and beginning of trial."
  },
  {
    "headline": "Striking doctors yet to contact Fed Govt on new demands, says Ngige",
    "summarized_story": "The government however, assured that it would make its position known to the doctors once it received such communication from the striking doctors’ umbrella body, the Nigerian Association of Resident Doctors (NARD).\nWhen contacted by The Nation, Minister of Labour and Employment, Chris Ngige said” “We have not gotten that (the 72-hour ultimatum).\nWhen we see it we will respond.”New NARD President Dare Ishaya had earlier yesterday told The Nation that he was eager to see the association’s face-off with the Federal Government brought to end.\n“I have already scheduled a meeting with the Nigerian Medical Association (NMA) President.\nI got to understand that there were a lot of arguments between the NMA President and my predecessor."
  },
  {
    "headline": "Ndume condemns killings of 12 military personnel by insurgents",
    "summarized_story": "By Sanni Onogu, Abuja- Advertisement -The Chairman Senate Committee on Army, Ali Ndume, has condemned the killing of some military personnel in Borno State by insurgents during an ambush.\nNdume, in a statement in Abuja on Sunday night, said what happened, even though unfortunate, was not enough to dampen the morale of the soldiers.\nHe urged them to continue in the fight against insurgency in a bid to end the menace in the country.\nThis should not discourage the troops and the army from taking the war to the insurgents.\nDozens of military troops on pass and on their way to Maiduguri, Borno State capital were on Friday ambushed by suspected members of Boko Haram linked to ISWAP, killing several of them."
  },
  {
    "headline": "PDP leaders in dilemma over choice of chairman",
    "summarized_story": "From Ndubuisi Orji, AbujaThere are indications that the Peoples Democratic Party (PDP) is in a dilemma over the zoning of the national chairmanship ahead of its October 30 convention.\nDaily Sun gathered that the PDP Zoning Committee as well as governors were divided on whether or not the chairmanship seat be zoned to the North or South.\nA highly placed party source told Daily Sun that “Northern governors wants it to go the South.\n“For instance, the South South is holding the chairman.\nThe PDP Governors Forum are expected to meet in Abuja on Wednesday over the zoning imbroglio."
  },
  {
    "headline": "Experts fault FG’s N12trn fuel, electricity subsidy claim",
    "summarized_story": "For instance, the Minister of Finance, Budget and National Planning, Mrs. Zainab Ahmed, recently recalled that the Muhammadu Buhari administration had set aside N305 billion for fuel subsidy payments in the 2019 budget.\nThe administration ever announced it ended the subsidy regime in March of 2020 with the introduction of a price modulation policy.\nHowever, last week’s announcement by the Federal Government it spends about N30billion monthly on electricity subsidy became the last straw that broke the Camel’s back.\nHarris explained that subsidy in the electricity sector was baffling as he does not understand the methodology the government used in arriving at its conclusion that electricity is being subsidised.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "The Sun award, an additional push to serve better –Gov Bello",
    "summarized_story": "Speaking when he received a delegation from The Sun, led by the Managing Director/Editor-in-Chief, Mr. Onuoha Ukeh, Bello described his recognition as heartwarming.\nSaying that the award by The Sun would give him an additional push to render more service to the people of Kogi State, Bello promised to continue doing his best for the development of the state and the people.\nEarlier in his speech,The Sun MD said Bello was chosen for Governor of the Year award owing to his achievements in the areas of peace, unity and security.\nOn what Bello has done in security, Ukeh said at a time when the country is plagued by insecurity, Bello has done much to rid Kogi of security breaches and inter-tribal squabbles.\nKogi State at that time was notorious as the den of crimes and criminalities."
  },
  {
    "headline": "PIA: Nigeria introduces 2% yearly increase on royalty",
    "summarized_story": "By Adewale SanyaoluThe Nigerian Government has introduced a two per cent annual increase on price based royalty for crude oil and condensates in the controversial Petroleum Industry Act (PIA).\nAccording to the PIA, additional price based royalty shall apply to crude oil and condensates, which crystallises only when crude oil prices exceeds $50 ($100 shall attract 5 per cent and above $150 shall attract 10 per cent).\nThe rates apply to the 2020 fiscal year and shall be increased by 2 per cent yearly as provided in the PIA.\nThe price-based royalty shall be credited to the Nigerian Sovereign Wealth Fund.\nThe PIA had retained production-based royalty rates but added price-based royalty rates."
  },
  {
    "headline": "Inflation, FX scarcity trigger N140bn outflow from NGX in 8 months",
    "summarized_story": "The performance of the current month when compared to August 2020 (N94.45 billion) figures revealed that total transactions decreased by 5.33 per cent.\nHowever, total foreign transactions increased by 63.30 per cent from N15.53 billion (about $37.75 million) to N25.36 billion (about $61.69 million) between July 2021 and August 2021.\nSimilarly, the institutional composition of the domestic market decreased by 12.22 per cent from N36.65 billion in July 2021 to N32.17 billion in August 2021.\nDaily Sun investigations revealed that in 2018, N642.65 billion in foreign portfolio investment outflow was recorded, while foreign investors withdrew N523.42 billion and N481.93 billion during the corresponding period in 2019 and 2020.\nAccordingly, we see scope for improved activities from both the domestic and foreign investors over the medium term”."
  },
  {
    "headline": "Ahead of October Launch, eNaira Platform Goes Live",
    "summarized_story": "*Records one million hits in days after unveiling according to analyticsObinna ChimaThe official website of the upcoming Central Bank of Nigeria’s (CBN) digital currency, the eNaira, has gone live, exactly one week to the planned launch of the initiative.\nRemarkably, 24-hours after the website went live, it has recorded over one million hits, according to analytics monitored by THISDAY.\n“The central bank would not want the event to take the shine away from the Independence celebration,” he said.\nEmefiele expressed optimism that the eNaira, would bring about increased cross-border trade, accelerate financial inclusion and lead to cheaper and faster remittance inflow.\nHe said the digital money would lead to easier targeted social interventions, as well as improvement in monetary policy effectiveness, payment systems efficiency, and tax collection."
  },
  {
    "headline": "Bandits Free Another Batch of 10 Bethel Baptist Students, 11 Still in Captivity",
    "summarized_story": "Joseph Hayab, said the 10 students were released on Sunday afternoon and were reunited with their parents.\nHowever, while giving an update on the Bethel students kidnap debacle, Hayab expressed hope that the remaining 11 students would soon be released.\nOn July 5, bandits invaded the school located about six kilometers away from Kaduna metropolis and abducted 121 students.\nParents of the students were said to have paid a total of over N200 million as ransom to the bandits.\nThe bandits were said to have demanded and collected fresh ransom for each batch of students released."
  },
  {
    "headline": "Lawan: Buhari Has Done More to Diversify Economy than Past Leaders",
    "summarized_story": "Lawan spoke at the weekend during the inauguration of a Poultry Farm Centre established by the National Agricultural Land Development Authority (NALDA) at Gasamu, in Jakusko Local Government Area of Yobe State.\nThe senate president said no past government had invested as much resources in agriculture as Buhari’s All Progressives Congress (APC) government.\nHe stated, “We have promised to diversify the economy of this country.\nFor more than 50 years, our economy had been dependent on one single commodity and that is oil.\nBut when you diversify into agriculture, you would have much more people engaged, especially, our youths, who today are largely unemployed or underemployed."
  },
  {
    "headline": "Analysts Seek Revamp of Nigeria’s Trade Policy to Unlock FX Inflows",
    "summarized_story": "Minister of Trade, Industry and Investments, Mr. Niyi Adebayo, had said his ministry was working towards producing an updated trade policy.\nBut one thing is having a trade policy, another thing is implementation.\n“Lack of trade policy could be one of the reasons why we have been seeing the continuous devaluation of the naira.\nSo, trade policy is very important.\nWe conduct monetary policy, fiscal policy, forex policy, without an alignment with trade, so there is broken connection.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Fayemi: All Governors Have Resolved to Dump Open Grazing",
    "summarized_story": "Olawale Ajimotokan in AbujaThe Chairman of Nigeria Governors’ Forum (NGF) and Governor of Ekiti State, Dr. Kayode Fayemi yesterday disclosed that all governors in the country have in principle agreed that open grazing was outdated and there was need to embrace modern livestock management approaches.\n“Any time there is an altercation between any of my colleagues, it is something that I feel wholly uncomfortable about because it takes us away from the substance, in this case on open grazing.\nOn the one hand, we have all agreed at the level of the NGF that open grazing is outdated and we need to look for alternative modern livestock management approaches,” Fayemi said.\nAnd that is why I said both sides are correct in the sense that Nasir El- Rufai of Kaduna State is talking about ranching as alternative way of stopping unrestrained open grazing and catering to the need of those who embark on open grazing approaches.\n“We have suggested that the only body that belongs to both the federal, state and the local governments is the Nigerian Sovereign Investment Authority (NSIA) in which we are shareholders."
  },
  {
    "headline": "BREAKING: Residents Flee As Boko Haram Insurgents Attack Yobe Town",
    "summarized_story": "Boko Haram terrorists have launched an attack on residents of Babbangida, the headquarters of Tarmuwa local government area of Yobe state, Northeastern Nigeria.\n\"Boko Haram terrorists are currently attacking Yobe town.\nThey are currently attacking Babbangida, headquarters of Tarmuwa local government area in Yobe State.\nGen. Onyeama Nwachukwu, revealed that ISWAP terrorist group has commenced a massive recruitment drive after thousands of Boko Haram insurgents 'repented' and surrendered to the military.\nIt noted that leaders and foot soldiers of the Boko Haram terrorist sect have relocated to a forest in Southern Kaduna from Sambisa Forest."
  },
  {
    "headline": "BREAKING: Residents Flee As Boko Haram Insurgents Attack Yobe Town",
    "summarized_story": "Boko Haram terrorists have launched an attack on residents of Babbangida, the headquarters of Tarmuwa local government area of Yobe state, Northeastern Nigeria.\n\"Boko Haram terrorists are currently attacking Yobe town.\nThey are currently attacking Babbangida, headquarters of Tarmuwa local government area in Yobe State.\nGen. Onyeama Nwachukwu, revealed that ISWAP terrorist group has commenced a massive recruitment drive after thousands of Boko Haram insurgents 'repented' and surrendered to the military.\nIt noted that leaders and foot soldiers of the Boko Haram terrorist sect have relocated to a forest in Southern Kaduna from Sambisa Forest."
  },
  {
    "headline": "How Infamous Ex-Minister Fani-Kayode Once Beat Up His Mother-in-Law— Former Nanny",
    "summarized_story": "Anthonia Uchenna, a former domestic worker at the house of former Minister of Aviation, Femi Fani-Kayode, has said the latter once beat up his mother-in-law.\nUchenna, who was a nanny at the former minister's house said he beat up his in-law after she queried him for beating and stripping his wife naked.\nShe said, “My name is Anthonia Uchenna, a former nanny at Femi Fani-Kayode's house.\nI experienced many things at FFK's house, the way he handles his staff.\nHe beat the woman too.”Several allegations including sexual harassment and assault have been levelled against Fani-Kayode over time by some of his former domestic workers."
  },
  {
    "headline": "How Infamous Ex-Minister Fani-Kayode Once Beat Up His Mother-in-Law— Former Nanny",
    "summarized_story": "Anthonia Uchenna, a former domestic worker at the house of former Minister of Aviation, Femi Fani-Kayode, has said the latter once beat up his mother-in-law.\nUchenna, who was a nanny at the former minister's house said he beat up his in-law after she queried him for beating and stripping his wife naked.\nShe said, “My name is Anthonia Uchenna, a former nanny at Femi Fani-Kayode's house.\nI experienced many things at FFK's house, the way he handles his staff.\nHe beat the woman too.”Several allegations including sexual harassment and assault have been levelled against Fani-Kayode over time by some of his former domestic workers."
  },
  {
    "headline": "How Infamous Ex-Minister Fani-Kayode Once Beat Up His Mother-in-Law— Former Nanny",
    "summarized_story": "Anthonia Uchenna, a former domestic worker at the house of former Minister of Aviation, Femi Fani-Kayode, has said the latter once beat up his mother-in-law.\nUchenna, who was a nanny at the former minister's house said he beat up his in-law after she queried him for beating and stripping his wife naked.\nShe said, “My name is Anthonia Uchenna, a former nanny at Femi Fani-Kayode's house.\nI experienced many things at FFK's house, the way he handles his staff.\nHe beat the woman too.”Several allegations including sexual harassment and assault have been levelled against Fani-Kayode over time by some of his former domestic workers."
  },
  {
    "headline": "Sule Lamido on insecurity: We've no leadership in Nigeria",
    "summarized_story": "Sule Lamido, former governor of Jigawa state, says the country lacks the needed leadership to tackle its challenges.\nAdvertisementWhile appearing on Sunday Politics, a Channels Television programme, on Sunday, Lamido said the government must be accountable to the people.\nWhen you want to attain political power the process must be credible,” he said.\nWe have no leadership in Nigeria, that is the problem and the world is looking at us.\nAdvertisement“It is this character of telling lies to the young generation."
  },
  {
    "headline": "Sule Lamido on insecurity: We've no leadership in Nigeria",
    "summarized_story": "Sule Lamido, former governor of Jigawa state, says the country lacks the needed leadership to tackle its challenges.\nAdvertisementWhile appearing on Sunday Politics, a Channels Television programme, on Sunday, Lamido said the government must be accountable to the people.\nWhen you want to attain political power the process must be credible,” he said.\nWe have no leadership in Nigeria, that is the problem and the world is looking at us.\nAdvertisement“It is this character of telling lies to the young generation."
  },
  {
    "headline": "Taliban ban barbers from trimming beards in Afghanistan province",
    "summarized_story": "The Taliban have banned barbers in Helmand province in Afghanistan from shaving or trimming beards.\nAdvertisementThe Taliban said shaving off beards breaches their interpretation of Islamic law.\nAccording to the BBC, in a notice posted on salons in southern Helmand province, the Taliban officers warned that hairdressers must follow Sharia law for haircuts and beards.\nAdvertisement“No one has a right to complain,” the notice reportedly read.\n“The fighters keep coming and ordering us to stop trimming beards,” a barber in Kabul reportedly said."
  },
  {
    "headline": "Taliban ban barbers from trimming beards in Afghanistan province",
    "summarized_story": "The Taliban have banned barbers in Helmand province in Afghanistan from shaving or trimming beards.\nAdvertisementThe Taliban said shaving off beards breaches their interpretation of Islamic law.\nAccording to the BBC, in a notice posted on salons in southern Helmand province, the Taliban officers warned that hairdressers must follow Sharia law for haircuts and beards.\nAdvertisement“No one has a right to complain,” the notice reportedly read.\n“The fighters keep coming and ordering us to stop trimming beards,” a barber in Kabul reportedly said."
  },
  {
    "headline": "REVEALED: Victims of ‘accidental’ airstrike in Yobe community given N10,000 as compensation",
    "summarized_story": "Confirming the number of the victims, Musa said “nine people were killed and 24 people injured”.\nIn the town nine people died and in my family alone two people died.\nPoliticians came to the hospital and gave N10,000 to the victims and families of the people that died.\n“The N10,000 they gave us is not enough to treat those that were injured and can’t return the lives of the dead.\nNAF said it set up a board of inquiry to “thoroughly” investigate the circumstances of the incident in Yobe."
  },
  {
    "headline": "ChatBots Africa, Fashtracker win pitch sessions at TechCabal’s ‘Future of Commerce’",
    "summarized_story": "ChatBots Africa and Fashtracker have been announced as winners of the partnership and investment pitch sessions, respectively, organised by TechCabal as part of the ‘Future of Commerce’ conference.\nHeld on Friday, 24th of September, the partnership pitch session saw a total of three growth-stage startups pitch to corporate organizations for potential partnerships while the investment version involved four early-stage startups pitching to potential investors.\n“For my team and I, winning at the pitching session validates our vision for the future of e-commerce in Africa, that is, conversational and social commerce,” Ronald Tagoe, Founder of ChatBots Africa, told TechCabal.\nNigeria-based Fashtracker connects trusted and sustainable African fashion brands to people within and outside the continent through its online platform.\n“Especially during such tough times in Nigeria – economic prosperity is key.”A screenshot of ChatBots Africa website."
  },
  {
    "headline": "What will commerce look like in Africa over the next decade?",
    "summarized_story": "With Covid-19 restrictions forcing more people to shop online, e-commerce companies and platforms on the continent have enjoyed a surge in activity.\nThis is provided e-commerce platforms continue to solve problems consumers face and offer more suites of offerings.\nAccording to Nkebet Mesele, Senior Director for Solutions Management in sub-Saharan Africa at Visa, that entails making commerce in Africa “mobile-led”.\n“For commerce to grow across Africa, the building blocks that have to be in place are first, it has to be mobile-led.\n“But it starts with building solutions for people on the ground.”If you enjoyed reading this article, please share it in your WhatsApp groups and Telegram channels."
  },
  {
    "headline": "Phishing scams are becoming more prevalent in African countries",
    "summarized_story": "Phishing is one of the oldest internet scams, dating back to the ‘90s, and perhaps remains one of the most prevalent cybercrimes.\nBut one thing phishing emails have in common with other forms of cyberattack is that every phishing email comes with a call to action that prompts recipients to download a link or file.\nPhishing attacks are prevalent in the continents and individuals and businesses across Africa have fallen victims to phishing scams.\nOver a million phishing attacks were recorded in South Africa in the first half of 2021.\nThat’s a combination of over two million attacks in the first half of the year from the three biggest African markets."
  },
  {
    "headline": "ARM collaborates with TechCabal on the Future of Commerce partnership pitch session",
    "summarized_story": "As part of the sessions, TechCabal will organize two strategic workshops – a partnership pitch session where growth-stage startups can pitch to corporate organizations for potential partnerships, and an investment pitch session where early-stage startups can pitch to potential investors.\nAsset & Resource Management Holding Company Limited (ARM), a provider of global asset management services across a wide range of traditional and alternative investment options, has partnered with TechCabal on the partnership pitch session.\nIna Alogwu, Group Director of Digital Transformation at ARM Group will be speaking at the session.\nAt ARM, he oversees the execution of the Group’s digital transformation strategy, helping the seven subsidiary companies in the Group drive their digital initiatives.\nSpeaking about the event, Olanrewaju Odunowo, Head of TechCabal Insights said, “The COVID-19 pandemic has changed the face of commerce."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "Edtech for university students, Twitter and Bitcoin, some 5G news",
    "summarized_story": "Share this article:Good day,Today I’m discussing:Stranerd’s plans for university studentsTwitter’s Bitcoin plansSome news about Nigeria’s 5G sceneStranerd’s plans for university studentsStranerd’s co-founders.\nWhat started as an Instagram page solving problems for students has since evolved into a platform connecting Nigerian students to tutors and their peers.\nCheck out How edtech startup, Stranerd is connecting Nigerian students to tutorsTwitter’s new feature, TipOn Thursday, September 23, 2021, Twitter announced Tip, a feature that will allow users to tip their favourite creators directly from Twitter.\nCatching up on the latest 5G newsPhoto by <a href=”https://unsplash.com/@macauphotoagency”>Macau Photo Agency</a> on <a href=”https://unsplash.com/s/photos/5g?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText”>Unsplash</a>In the last few weeks, Nigeria’s 5G deployment seems to have gained some traction.\nMeanwhile, you can check out 4 things we learnt from MTN Nigeria’s 5G demoCatch up on these storiesWhat I’m reading/watchingGig work is precarious no matter the country."
  },
  {
    "headline": "How edtech startup, Stranerd is connecting Nigerian students to tutors",
    "summarized_story": "On the supply side, there are more students or prospective students than there are schools.\nSource: SuppliedOn the website, which currently serves mainly Nigerian students, the startup employs a coin system to charge students.\nThe goal, Godwin says, is to become a one-stop-shop for the Nigerian student’s educational needs and possibly African students also.\nThey also want to include connecting students to internships as well as providing study-abroad services to students.\nBut first, the startup plans to build trust among the students before leveraging it to add more services."
  },
  {
    "headline": "Hearing impairments and technology, ReelFruit’s $3m raise, Apple Pay on Paystack",
    "summarized_story": "Today I’m discussing:Living with hearing impairments in a tech-enabled worldRealFruit’s $3 million Series APaystack launching Apple Pay to help Nigerian businessesLiving with hearing impairments in a tech-enabled worldWeYesterday, Thursday, September 23, 2021, was the International Day of Sign Languages.\nPaystack launches Apple Pay to help Nigerian businessesPaystack, an African fintech company that powers and processes payments for businesses, announced yesterday that Pay with Apple Pay is now available on its platform.\nNigerian businesses will have access to millions of Apple Pay users across more than 60 countries where the payments service is available.\nWhen a customer with Apple Pay buys from a Paystack merchant, they will see the option to checkout using Pay with Apple Pay.\nFlutterwave, an African payments company, integrated PayPal into its platform in March 2021, allowing PayPal customers worldwide to pay African merchants via its “Pay with PayPal” feature."
  },
  {
    "headline": "Nigeria’s unending ‘war’",
    "summarized_story": "It was in December 2015, some seven months after he became president that Buhari announced that Nigeria had “technically won the war” against the Islamist Boko Haram militants.\nHowever, throughout Yusuf’s tenure as the group’s leader, Boko Haram sought to achieve its aims largely through peaceful means.\nThe UNDP says that nearly 350,000 people have been killed in the North-East since the insurgency against the Nigerian state began.\nThe first task is to defeat Boko Haram and I want to tell you that as of today Boko Haram has been defeated.\nInformation minister, Lai Mohammed, in 2019 said, “I stand by what I said that Boko Haram is technically defeated."
  },
  {
    "headline": "Nigeria’s unending ‘war’",
    "summarized_story": "It was in December 2015, some seven months after he became president that Buhari announced that Nigeria had “technically won the war” against the Islamist Boko Haram militants.\nHowever, throughout Yusuf’s tenure as the group’s leader, Boko Haram sought to achieve its aims largely through peaceful means.\nThe UNDP says that nearly 350,000 people have been killed in the North-East since the insurgency against the Nigerian state began.\nThe first task is to defeat Boko Haram and I want to tell you that as of today Boko Haram has been defeated.\nInformation minister, Lai Mohammed, in 2019 said, “I stand by what I said that Boko Haram is technically defeated."
  },
  {
    "headline": "Insecurity costs Nigeria $40.6bn worth of investments in 1 year",
    "summarized_story": "Over $40.6 billion worth of foreign investments were diverted from the Nigerian economy in 2020 alone as a result of insecurity.\nNigeria is currently grappling with security challenges ranging from farmer/herder clashes, cattle rustling, banditry, kidnapping and Boko Haram insurgency.\nThe terrorist group has caused massive destruction across northern Nigeria in the last decade.\nRecently, the state has been ravaged by a deadly conflict between the military and the Boko Haram jihadists.\nThe persistent issue of insecurity in Nigeria has been fingered as a major reason behind foreign investors pulling out their investments from the country."
  },
  {
    "headline": "Bouncer Stabs Teenage boy to Death At Wedding Reception In Delta – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – Tragedy struck at the weekend in Mofor, Udu council area of Delta State as a teenage boy identified as Oghenemaro Eriana was stabbed to death by a bouncer at a wedding reception.\nThe incident occurred Saturday afternoon at the popular Wetland Hotel in the area.\nBefore his untimely death, the victim lived with his mother along Kolokolo Street in Udu Road as neighbours to the groom.\nIt was learnt that, the mother of the teenage boy has been mourning the loss of her older son which happened two months ago.\n“Yes, it happened at Wetland Hotel."
  },
  {
    "headline": "Group Trains Media Practitioners, CSO,s On Human Trafficking, Forced Migration – Nigerian Observer",
    "summarized_story": "While maintaining that the triggers of human trafficking are largely economic-related and poor livelihoods, the Ag.\nExecutive Director said that human trafficking and forced migration are further sustained by cultural orientation, poor government policies which according to her do not address the socio-economic conditions of the youths.\nOlofin, however, thanked the United Nations Women for supporting the implementation of the project, just as she also appreciated partners of the foundation for their unflinching commitment thus far in the intervention of human trafficking and forced migration.\nIn their separate goodwill messages, representatives of UN Women, NAPTIP, NOA, NUJ Chairman, and CSOs, described the event as apt, adding that the place of the media and CSOs in the fight against human trafficking and forced migration could not be emphasised.\nHigh point of the event was the presentation of lectures entitled “Building Effective Communication Strategies and Investigative Skills in curbing Human Trafficking and Forced Migration”, “Enhancing the capacity of the media to advocate against forced migration and trafficking” and presentation of Draft Road Map/Action Plan by Mrs. Joy Olabisi Akpaida, Dr. Nosa Aladeselu and Fikih Obaro."
  },
  {
    "headline": "FC Robo first team to arrive for Betsy Obaseki Tournament – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestNigeria Women Football League Premiership club, FC Robo Football Club of Lagos were the first to arrive the Samuel Ogbemudia Stadium, Benin City in readiness for the Betsy Obaseki Women Football Tournament, which kicks off tomorrow in three venues across the city.\nFC Robo players were bubbling with life ready for the challenges ahead as they moved around the stadium with so much zest, obviously set for the battle against seven other NWFL Premiership clubs and four NWFL Championship clubs.\nWe know there are very strong Premiership clubs in this competition, we are on ground for the challenge.\nI also want to commend the organising committee of the Betsy Obaseki Women Football Tournament for the great works seen on ground at the Samuel Ogbemudia Stadium, Benin City.\nThe opening ceremony has also been scheduled for the Samuel Ogbemudia Stadium."
  },
  {
    "headline": "Edo, partners brainstorm on bridging digital divide among MSMEs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – To provide a viable ecosystem to get more Micro, Small and Medium Enterprises (MSMEs) to the digital space, the Edo State Government and private partners have agreed to deploy tested platforms to encourage small businesses to bring their businesses online.\nThis was agreed during a webinar organized by the Edo State Investment Promotion Office (ESIPO), which was supported by OZE, an international digital business outfit.\nThe programme featured eleven experts in digital economy, drawn from around the world including the United Kingdom, the United States of America and Ghana.\nAccording to him: “This meeting is to see how we can further leverage on these opportunities using technology to drive our businesses.\nWe have the required digital infrastructure in place to drive growth."
  },
  {
    "headline": "Clubfoot: Nigerian surgeon, American partners bring succour to hundreds of children",
    "summarized_story": "To contribute to improving the situation, in November 2017, Mrs Amaraegbulam founded The Straight Child Foundation (TSCF), a nonprofit, as a platform for providing support to children with the condition.\nThankfully, children in six Nigerian states can now access free and effective treatment.\nMiraclefeet’s representatives arrived in Nigeria and trained staff of TSCF and other volunteers from FMC Umuahia in a clubfoot treatment method called Ponseti.\nThrough this process, 202 children have had their feet corrected at FMC Umuahia free of charge since July 2018.\nBefore Winner turned five months old, Peculiar, his mother, saw a post on Facebook about the free treatment at FMC."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Bandits invade military base in Sokoto, kill many soldiers",
    "summarized_story": "Bandits have invaded a joint military camp code-named ‘Burkusuma camp’ in Sabon Birni local government area of Sokoto, killing many Nigerian soldiers, including three Nigeria Security and Civil Defence Corps (NSCDC) personnel.\nThe bandits were said to have shot four villagers in Katsira, two of whom immediately died and two others receiving treatment at the hospital.\nMultiple sources said the bandits who stormed the base in large numbers shot from different directions in the early hours of last Friday.\nThe attack came days after the state government shut down telecommunication networks in 14 local government areas to check banditry.\nAlso, two patrol vehicles were burnt, another one was commandeered by the bandits who also stole food items from villagers."
  },
  {
    "headline": "Wike accuses APC, Buhari of planning to rig 2023 elections",
    "summarized_story": "Governor Nyesom Wike of Rivers has alleged plots to rig the 2023 elections, again criticising the ruling APC for rejecting the electronic transmission of election results.\nRivers State governor, Nyesom Wike has alleged that the All Progressive Congress (APC) government is plotting to rig the 2023 elections.\nThe governor noted that Nigeria should be more concerned about competing with developed countries practising representative democracy.\nWe are talking about how to rig the election in 2023.\n“At 61, Nigeria is still talking about enmity, hatred, division; we’re still talking about a country that cannot put itself together."
  },
  {
    "headline": "IPOB test for President Buhari: Why the new threat should not be ignored…!",
    "summarized_story": "Uche ChrisThe crisis in the south east region of the country orchestrated by the Indigenous People of Biafra, IPOB, is entering a dangerous phase that will severely destabilize the region, and undermine the legitimacy of President Buhari and his government.\nThis is a litmus test that will define the integrity, sensitivity and legitimacy of his government in relation to the Igbo.\nFor several weeks now the south east has been on partial lockdown every Monday on the directive of the group even after it had been apparent called off.\nGovernment may want to use this as a pretext to destroy south east economy, but it should realize that the wealth of the south east is not within the region.\nThis could have been avoided because government will suffer more bad publicity with him in Nigeria facing trial than outside, especially if IPOB make good the threat."
  },
  {
    "headline": "North retains hold on new oil company",
    "summarized_story": "Buhari, who doubles as the Minister of Petroleum Resources had in consonance with Section 53(1) of the Act directed that the Nigerian National Petroleum Company Limited be incorporated.\nLast month, the corporation announced the promotion and redeployment of some staff to fill vacant positions, as well as the disengagement of a chief operating officer.\nIt added that Adeyemi Adetunji, formerly Chief Operating Officer, Business and Ventures Development, is now the Group Executive Director, Downstream; while Mohammed Ahmed, formerly Chief Operating Officer, Corporate Services, had now assumed the position of Group Executive Director, Gas and Power.\n“The repositioning also saw the disengagement of Yusuf Usman, formerly Chief Operating Officer, Gas and Power,” the oil firm said.\nOthers are MD, NNPC Shipping, Inuwa Waya; MD, Pipelines and Product Marketing, PPMC, Musa Lawan; MD, Nigeria Petroleum Development Company, NPDC, Mansur Sambo; MD, Duke Oil/NNPC Trading Company, Lawal Sade; MD, Port Harcourt Refining Company, Malami Shehu; MD, Warri Refining and Petrochemical Company, Muhammed Abah; MD, Nigeria Gas Marketing Company, Abdulkadir Ahmed; MD, Nigeria Gas and Power Investment Company Limited, Salihu Jamari; MD, NNPC Medical Services, Mohammed Zango; and Director, Department of Petroleum Resources, DPR, Sarki Auwalu."
  },
  {
    "headline": "Road Blockage: Niger Youths Give Truck Drivers 48-hour Ultimatum",
    "summarized_story": "Youths in Niger State under the aegis of the Coalition of Youths and Civil Society Organisations, have threatened to take action if the protesting Articulated Vehicle Drivers failed to show understanding and vacate Lambata-Bida and Bida-Minna Roads within 48 hours.\nIt could be recalled that heavy-duty vehicles and tanker drivers blocked the Suleja-Lambata-Bida and Minna-Abuja roads since Friday, protesting the restriction of articulated vehicles on the Minna-Bida Road by the Niger State government due to ongoing reconstruction of the road.\nAddressing journalists in Minna, the state capital, president of the National Youth Council of Nigeria, Niger State chapter, Bello Barau Sherif, said the protesting drivers have heightened the pains of poor governance already faced by the citizens in the state.\nOther associations represented at the briefing included the state chapter of Youth Lead Nigeria, Coalition of Northern Groups (CNG), Northern Youth Assembly of Nigeria, Niger State Students in Diaspora, Concerned Shiroro Youths, North Central Youth Parliament (NCYP), National Associations of Nigerian Students, Niger East Youth Frontiers (NEYFRO) and Muslim Students Society of Nigeria (MSSN).\nHe said, “Over the past few years, many of us have got the reasons to discuss and analyze the state of affairs in our darling Niger State."
  },
  {
    "headline": "Road Blockage: Niger Youths Give Truck Drivers 48-hour Ultimatum",
    "summarized_story": "Youths in Niger State under the aegis of the Coalition of Youths and Civil Society Organisations, have threatened to take action if the protesting Articulated Vehicle Drivers failed to show understanding and vacate Lambata-Bida and Bida-Minna Roads within 48 hours.\nIt could be recalled that heavy-duty vehicles and tanker drivers blocked the Suleja-Lambata-Bida and Minna-Abuja roads since Friday, protesting the restriction of articulated vehicles on the Minna-Bida Road by the Niger State government due to ongoing reconstruction of the road.\nAddressing journalists in Minna, the state capital, president of the National Youth Council of Nigeria, Niger State chapter, Bello Barau Sherif, said the protesting drivers have heightened the pains of poor governance already faced by the citizens in the state.\nOther associations represented at the briefing included the state chapter of Youth Lead Nigeria, Coalition of Northern Groups (CNG), Northern Youth Assembly of Nigeria, Niger State Students in Diaspora, Concerned Shiroro Youths, North Central Youth Parliament (NCYP), National Associations of Nigerian Students, Niger East Youth Frontiers (NEYFRO) and Muslim Students Society of Nigeria (MSSN).\nHe said, “Over the past few years, many of us have got the reasons to discuss and analyze the state of affairs in our darling Niger State."
  },
  {
    "headline": "Nigeria At 61: Vision Of United Country Undefeated – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo has said that even though there are current security, economic, religious, and ethnic challenges, the collective vision of a united, peaceful and prosperous Nigeria, where righteousness abounds, still abides.\nFrom our ranks, we have the most accomplished men and women in the arts, the sciences, in sport, in technology and commerce.\n“An almost intemperate, vehement and often violent dismissal of the views of people of other persuasions without adequate consideration.\nYakubu Dogara; several State governors and faith leaders, including past presidents and general secretary of CAN.\nThe Imam that saved the lives of over 200 Christians in Barkin Ladi, Plateau State, Abdullahi Abubakar, also received a special CAN recognition."
  },
  {
    "headline": "Nigeria At 61: Vision Of United Country Undefeated – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo has said that even though there are current security, economic, religious, and ethnic challenges, the collective vision of a united, peaceful and prosperous Nigeria, where righteousness abounds, still abides.\nFrom our ranks, we have the most accomplished men and women in the arts, the sciences, in sport, in technology and commerce.\n“An almost intemperate, vehement and often violent dismissal of the views of people of other persuasions without adequate consideration.\nYakubu Dogara; several State governors and faith leaders, including past presidents and general secretary of CAN.\nThe Imam that saved the lives of over 200 Christians in Barkin Ladi, Plateau State, Abdullahi Abubakar, also received a special CAN recognition."
  },
  {
    "headline": "Indorama: A’Court Affirms Ownership Of 2.5% Equity Shares By Ex-Workers",
    "summarized_story": "The Court of Appeal has dismissed an appeal challenging the decision of the National Industrial Court, Port Harcourt, Rivers State, affirming the ownership of 2.5% equity shares of Indorama Eleme Petrochemicals Limited by ex-workers of the company.\nThe National Industrial Court had earlier dismissed an application seeking to set aside an Arbitral judgement awarded and enforced by the Federal High Court in respect of the ownership of the 2.5% equity shares through their Cooperative Society.\nBut the Industrial Court declined entertaining the application over lack of jurisdiction, stating that the Federal High Court that granted the order enforcing the arbitral award was a court of coordinate jurisdiction.\nDissatisfied with the judgment of the Industrial Court, the Appellants approached the Court of Appeal to set aside the judgement of the industrial court and also to uphold their argument.\nBut the Appeal Court on Friday, September 24, 2021, dismissed the appeal and affirmed the judgment of the Federal High Court in favour of the former staff of Indorama Eleme Petrochemicals Company Limited."
  },
  {
    "headline": "Opinion: Taking politics too far… – By ROWLAND OLAWALE",
    "summarized_story": "In 2013 Taiwo Adepoju came out on the platform of the (then existing) Labour Party to contest for the post of councillor in Ward E in Ajeromi Ifelodun Local Government Area of Lagos State.\nTaiwo Adepoju lost the election.\nFast forward to some 8 years later and the repercussions of those years are still hunting Mr. Adepoju.\nThe scars left behind were not physical but were enduring and eventually Taiwo scampered to the United Kingdom.\nTaiwo says that, for now, he has “decided to take their advice”Share this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Opinion: Taking politics too far… – By ROWLAND OLAWALE",
    "summarized_story": "In 2013 Taiwo Adepoju came out on the platform of the (then existing) Labour Party to contest for the post of councillor in Ward E in Ajeromi Ifelodun Local Government Area of Lagos State.\nTaiwo Adepoju lost the election.\nFast forward to some 8 years later and the repercussions of those years are still hunting Mr. Adepoju.\nThe scars left behind were not physical but were enduring and eventually Taiwo scampered to the United Kingdom.\nTaiwo says that, for now, he has “decided to take their advice”Share this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Again, bandits attack ECWA church in Kaduna, kill two, injure others",
    "summarized_story": "Again, bandits attack ECWA church in Kaduna, kill two, injure othersAgain, bandits attack ECWA church in Kaduna, kill two, injure othersSome bandits on Sunday invaded the Evangelical Church of Winning All, Gavaciwa, in the Kachia Local Government Area of Kaduna State, killing a worshipper, while scores were injured.\nAlso in another attack, bandits killed one Nasiru Abdullahi of Gobirawan Kamacha in the Bina general area of the Igabi LGA.\nAruwan said, “Security agencies reported to the government that the attack occurred at ECWA Church, Gabaciwa in Kachia LGA.\n“The security agencies are obtaining further details, on which the government will update the public in due course.\n“The governor added that the attack on the worshippers was a divisive intent of the criminals leveraging religious sensitivity.”He said governor had directed the Kaduna State Emergency Management Agency provide succour to the victims receiving medical attention."
  },
  {
    "headline": "Again, bandits attack ECWA church in Kaduna, kill two, injure others",
    "summarized_story": "Again, bandits attack ECWA church in Kaduna, kill two, injure othersAgain, bandits attack ECWA church in Kaduna, kill two, injure othersSome bandits on Sunday invaded the Evangelical Church of Winning All, Gavaciwa, in the Kachia Local Government Area of Kaduna State, killing a worshipper, while scores were injured.\nAlso in another attack, bandits killed one Nasiru Abdullahi of Gobirawan Kamacha in the Bina general area of the Igabi LGA.\nAruwan said, “Security agencies reported to the government that the attack occurred at ECWA Church, Gabaciwa in Kachia LGA.\n“The security agencies are obtaining further details, on which the government will update the public in due course.\n“The governor added that the attack on the worshippers was a divisive intent of the criminals leveraging religious sensitivity.”He said governor had directed the Kaduna State Emergency Management Agency provide succour to the victims receiving medical attention."
  },
  {
    "headline": "Anti-Open Grazing Law: Resign As IGP — HURIWA To Usman Baba",
    "summarized_story": "The unwillingness of the Nigeria Police Force to enforce the anti-open grazing law, according to the Human Rights Writers Association of Nigeria, HURIWA, just makes the police look like a Fulani security agency.\nAs a result, the rights group has urged on state governments to immediately stop financing the police and instead establish a quasi-policing authority to enforce the anti-open grazing law.\nHURIWA also chastised Attorney-General of the Federation and Minister of Justice, Abubakar Malami, for allegedly turning himself into a gear in the wheel of the legitimately approved laws prohibiting open grazing of cattle.\nThe rights group asked the States to set up a State wide armed vigilantes to carry out the enforcement of the provisions of the law because the law is constitutionally guaranteed under section 4(7).\n“It is disgraceful that Nigeria Police Force is now an institution led by Ethnic warlords who are affiliates of Fulani herders because investigation showed that herders still graze their animals openly in many states that have enacted the anti-open grazing law without being intercepted by law enforcement agents.”"
  },
  {
    "headline": "Independence Day: Gov Wike Spits Fire, Says Nothing Like Nigeria [VIDEO]",
    "summarized_story": "Governor Nyelsom Wike of Rivers State has voiced displeasure with the country’s current state, claiming that there is nothing like Nigeria to be celebrated.\nWike was seen speaking at a sermon in a church as part of activities to mark the 2021 Independence Day, according to a video obtained by NEWS DIRECT.\nIn the next few days, Nigeria will be 61 years old.\n“Now Nigeria is 61 years but the only reason why we can thank God is because there still appears a name called ‘Nigeria’.\nA legislature that cannot say that Nigeria has come to the age of conducting a free and fair election."
  },
  {
    "headline": "Bandits Attack Church In Kaduna During Service, Shoot Worshippers",
    "summarized_story": "Aruwan claimed that dozens of the injured worshippers were promptly brought to hospitals, citing El-statement Rufai’s that the attack on the worshippers was a divisive goal of the criminals who play on religious sensitivities.\nThe commissioner said, “The Governor of Kaduna State, Malam Nasir El-Rufai, has condemned in the strongest terms an attack against worshippers on Sunday morning by gunmen.\n“Security agencies reported to the Government that the attack occurred at ECWA Church, Gabaciwa in Kachia Local Government.\n“The Governor added that the attack on the worshippers was a divisive intent of the criminals leveraging on religious sensitivity.\n“The governor condoled the ECWA Church and the family of the deceased in particular, and prayed for the repose of the soul of the worshipper.”"
  },
  {
    "headline": "Ganduje’s Son Flees To Egypt After Dragging Mother To EFCC Over Fraud",
    "summarized_story": "Abdulazeez Ganduje, the first son of Kano Governor Abdullahi Ganduje, is said to have fled to Egypt with his family after his mother was accused of corruption by the Economic and Financial Crimes Commission (EFCC).\nAccording to people acquainted with the case, the young man had taken his mother, Hafsat Ganduje, to the EFCC, indicating a pattern of corruptly exploiting family influence for personal gain.\nGovernor Ganduje has yet to make a statement on the matter.\nGanduje, the governor, had previously been involved in a corruption-related scandal.\nAsked to comment on the matter, a spokesperson for Kano State Government, Mohammed Garba, said, “I am not aware” and, so, he could not comment."
  },
  {
    "headline": "Banditry, kidnapping, others: FCT communities take to self-defence",
    "summarized_story": "Amidst growing insecurity and widespread cases of kidnapping in the Federal Capital Territory (FCT) Abuja, residents have resorted to self-help by forming vigilante groups across the six area councils to ward off armed bandits and kidnappers.\n“So forming vigilante groups to checkmate the activities of these vagrant criminals required little persuasion of residents who cherished their safety and peace,” he said.\nThe monarch said, in collaboration with the special police taskforce approved by the Zuba Divisional Police command, the vigilante groups in Tunga-Maje have drastically reduced incidences of kidnappings and banditry in recent times.\nAlso, residents make monthly contributions ranging from N500 to N2000 per house to pay for the services of the vigilante groups.\n“Yes, communities are very concerned about the growing activities of bandits and kidnappers that have traumatized the citizens."
  },
  {
    "headline": "At 61: Vision for a united Nigeria undefeated – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo (SAN) has observed that despite the current security, economic, religious, and ethnic challenges, the collective vision of a united, peaceful and prosperous Nigeria, where righteousness abounds still abides.\n“The Lord blessed the vision and prospered the land with richness in oil, in gas, in minerals of every hue.\n“That vision of our forebears inheres in the words of our National Motto: Unity and Faith, Peace and Progress.\nAnd so many ask, “can the vision of the nation united, the nation peaceful, the nation righteous and the nation prosperous yet abide?\n(1 Peter 5:10)“Our current trials cannot draw the curtains on our story, because the vision is for an appointed time."
  },
  {
    "headline": "Breaking: Nigeria’s D’Tigress beat Mali, retain Afrobasket title",
    "summarized_story": "Nigeria’s D’Tigress a while ago on Sunday defeated Mali in the final of 2021 women Afrobasket and retained the title for the third consecutive time.\nDetails loading…"
  },
  {
    "headline": "Ogah commends downstream policy on value addition to Nigeria’s mineral ores -NigPilot",
    "summarized_story": "He said that efforts were being made to stamp out illegal mining and formalizing artisanal and small-scale mining activities across the country.\n“Arising from the above vision of Mr. President, the Ministry of Mines and Steel Development has initiated the following programmes/interventions:NIMEP.\nFederal Government direct Intervention Fund under the National Integrated Mineral Exploration Project, NIMEP, was designed to take advantage of the underexplored metallogenic belts.\n” The Optimization of revenue from the mining sector: The revenue contribution of the mineral sector has been very low due several factors.\n“The downstream policy of the Ministry is an effort to ensure that mineral ores are not exported out of Nigeria without value addition,” the mines Minister informed."
  },
  {
    "headline": "Buhari redeploys five Permanent Secretaries across MDAs -NigPilot",
    "summarized_story": "President Muhammadu Buhari has approved the redeployment of five Permanent Secretaries across Ministries, Departments and Agencies, MDAs.\nAccording to the statement, the Permanent Secretaries and details of the new postings are as follows:“William Nwankwo Alo of the Federal Ministry of Power now redeployed to Police Service Commission.\n“Abel Olumuyiwa Enitan of the Federal Ministry of Environment now redeployed to the Federal Ministry of Aviation.\n“Hassan Musa of the Federal Ministry of Aviation is now redeployed to the Federal Ministry of Environment.\n“Nebeolisa Anako of the Federal Ministry of Youth and Sports Development now redeployed to the Federal Ministry of Power."
  },
  {
    "headline": "Maritime security, NN, NNPC, and national development -NigPilot",
    "summarized_story": "National development involves an integrated process of building capacity in all the sectors in the nation, aimed at enhancing the well-being of the citizens.\nHence, littoral states integrate their maritime resource protection and maritime security efforts for effective policing of the maritime domain towards rapid national development”.\nThis maritime aspiration translates to peacetime and wartime roles with national security and national development implications.\nThe CNS said that the overview of NN’s Geo-strategic maritime environment would be discussed before enumerating the threats to Nigeria’s maritime security and its implications on national development.\nThe paper he averred will consider the roles of the NN towards national development as well as the challenges of the NN towards enhancing national development, stressing that the presentation will proffer some policy options towards enhancing national development."
  },
  {
    "headline": "2021 World Peace Day: Group Advocates Positive Peace Building In Nigeria -NigPilot",
    "summarized_story": "The Rotary Club of Abuja in collaboration with the Melroy Foundation has called for a renewed vigour in our efforts to promote peace in Nigeria.\nThe Peace Ambassador, Institute of Economics and Peace (IEP), Amb.\nRoy-Stanley Nwafor said this in a statement marking the International Day of Peace with the theme “recovering better for a sustainable and equitable world” adding that it’s high time we forge a common front to rescue Nigeria from the shackles of nepotism, ethnicity, religious bigotry and other unhealthy behaviours that’s capable of disrupting the peace of the nation.\nNwafor who is also an Ambassador Rotarian Action Group for Peace said the International Day of Peace 2021 presents a veritable opportunity to thinker with peacebuilding actors like the National Commandant, Peace Corps of Nigeria , Professor Dickson Akoh and Partner, World Taekwondo, and other NGOs in the peacebuilding to promote the 8 pillars of positive peace in order of taxonomy and chat a way forward.\nHe commended government efforts in ensuring peaceful coexistence and called for a more functioning and responsive government, sound business environment, equitable distribution of resources, acceptance of the right of others, freedom of information and general human capital development to better the livelihood of all Nigerians."
  },
  {
    "headline": "Northern Governors, Traditional Rulers Meet In Kaduna Over VAT, Insecurity And Others",
    "summarized_story": "The Northern Governors’ Forum and traditional rulers from the region are holding an emergency meeting in Kaduna State.\nThe meeting, which is taking place at the Executive Council Chamber of the Kaduna State Government House, is chaired by the Governor of Plateau State, Simon Lalong.\nAlso present are the Sultan of Sokoto and the Chairman of Northern Traditional Rulers Council, Abubakar Saad.\nHowever, the Federal Inland Revenue Service (FIRS) challenged the judgement of the lower court at the Appeal Court.\nAfter debates and deliberations, the Appeal Court ordered parties in the suit to maintain status quo pending the determination of the appeal."
  },
  {
    "headline": "Villagers Flee As Boko Haram Attacks Yobe Community",
    "summarized_story": "Suspected Boko Haram insurgents on Sunday attacked Babbangida in Yobe State.\nThe incident, which caused many of the villagers to flee, is coming one month after the terrorists launched an assault on the community.\nSunday’s incident is one of the many attacks on communities in the North East state which has continued to suffer from onslaughts by Boko Haram terrorists.\nRELATED: [Boko Haram] 11 Questions Trailing Amnesty For ‘Repentant’ TerroristsYobe is not the only state suffering from the insurgents’ attack.\nHe put the number of the surrendered insurgents at 335 fighters, 746 women and children including one of the abducted Chibok girls."
  },
  {
    "headline": "Bandits Hit Sokoto Military Base, Kill Many",
    "summarized_story": "Bandits have attacked a joint military camp in Sabon Birni Local Government Area of Sokoto State.\nThe Sokoto State Commissioner for Carriers and Security Matters, Colonel Garba Moyi (rtd) confirmed the attack but was not sure of the number of casualties.\nResidents of the area and security sources told Channels Television that the gunmen attacked the base, codenamed “Burkusuma Camp”, in the early hours of Friday, killing an unknown number of military personnel.\nThe military source could not confirm if the said camp is the same with the Burkusuma camp in Sabo Birni Local Government Area.\nHe said over 10 trucks conveying armed military personnel are in the forest trailing the bandits."
  },
  {
    "headline": "Ten More Kidnapped Bethel Baptist School Students Regain Freedom",
    "summarized_story": "Ten more abducted students of Bethel Baptist Secondary school in Kaduna State have regained their freedom.\nThis is the fourth batch of the students released so far by their abductors.\nRead Also: Four Arrested As NDLEA Uncovers Abuja Hotel Where Drugs Are SoldHe also expressed optimism that the bandits will release the remaining eleven kidnapped students still in captivity in no distant time.\nA total of 121 students of Bethel Baptist Secondary school in Chikun Local Government Area of the state were abducted by bandits from their hostels on July 5, 2021.\nThe students were later released in batches after their parents reportedly paid ransoms to their abductors."
  },
  {
    "headline": "Serie A: Osimhen Shines Again, Scores Fourth League Goal",
    "summarized_story": "They are two points ahead of AC Milan after another confident display that ends a week in which they scored 10 goals without reply in three league matches.\n“The best way to celebrate was to win and score a goal,” said Insigne to DAZN, who is four goals away from Diego Maradona’s Napoli total of 115.\nThe Nigerian had scored a brace as Napoli outclassed Sampdoria 4-0 in a Serie A game on Thursday evening.\n“The referee and VAR weren’t up to the standards of a match of this level.\nFiorentina bounced back from midweek defeat to Inter Milan with a battling 1-0 win at Udinese which moved them into fifth on 12 points, six behind Napoli."
  },
  {
    "headline": "Kaduna abduction: Ten more students of Bethel college regain freedom",
    "summarized_story": "At least ten additional student abducted from Bethel Baptist College in Kaduna State have regained their freedom.\nThe Kaduna State government and Police authorities are yet to comment on this development as at the time of filling this report.\nWe recall that 121 students were abducted at Bethel Baptist College in Chikun local government area of the state, when gunmen invaded the school July 5 2021.\nThe latest development, brings the total number of recovered students to one hundred and ten .\nThe students’ release comes three days after Nigerian police in Abuja displayed three bandits related to the Bethel Baptist College attack."
  },
  {
    "headline": "Anti-open grazing law: Experts advocate need for enforcement, urge herders to embrace ranching",
    "summarized_story": "As governors in the Southern part of Nigeria continue to sign the Anti-Open Grazing Bill into law, experts argue that implementation is crucial to the bill’s success.\nThey also emphasized the importance of herders and the government embracing ranching in order to put a stop to open grazing.\nMonths after the governors agreed to proscribe open grazing in their domains, the law has become operational in some states.\nA former Deputy Director of the Department of State Services, DSS, Adams Abuh, believes that state governors must embrace ranching, as a measure to end open grazing.\nStudents of Ondo State origin and the Yoruba socio-cultural group, Afenifere have also put their weight behind this action."
  },
  {
    "headline": "Bandits attack joint military base in Sabon Birni, number of casualties unknown",
    "summarized_story": "Residents in Sabon Birni local government area of Sokoto state said gunmen suspected to be armed Bandits have allegedly attacked a joint military base codenamed “Burkusuma camp’ located in Sabon Birni local government area of Sokoto state and in the process killed unspecified number of military personnel.\nHowever, a military source who requested anonymity reported a large number of suspected bandits were murdered when a military base in Sokoto’s Eastern Senatorial District was attacked.\nThe insider could not confirm whether the military camp in question is the same as the Burkusuma camp in Sabo Birni local government.\nBut the Commissioner for Carriers and Security Matters, Colonel Garba Moyi (rtd) has confirmed the attack on the military base but that he was not sure of the number of casualties.\nColonel Garba Moyi (rtd), the Commissioner for Carriers and Security Matters, confirmed the attack on the military base, but said he couldn’t say how many people were killed."
  },
  {
    "headline": "SERAP asks Buhari to publish names of suspected looters of N6trn NDDC funds",
    "summarized_story": "It will be recalled that the NDDC’s recent Forensic Audit Report implicated several of the commission’s executives for misappropriating funds between the years 2000 and 2019.\nThe initiatives, according to SERAP, would enhance the victims’ right to restitution and compensation, as well as ensure non-recurrence and boost public confidence in the battle against corruption.\n“The audit report raises prima facie evidence of grand corruption and its staggering effects in the Niger Delta.\n“We would be grateful if the recommended measures are taken within 14 days of the receipt and/or publication of this letter.\nIf we have not heard from you by then, the Incorporated Trustees of SERAP shall take all appropriate legal actions to compel your government to comply with our request in the public interest."
  },
  {
    "headline": "China’s Biggest Airshow to Highlight Military Prowess",
    "summarized_story": "China’s military will display some of its most advanced weaponry and equipment when the country’s largest airshow gets under way this week.\nAirshow China opens in the southern city of Zhuhai on Tuesday after a year-long delay as a result of the coronavirus pandemic.\nThe show, highlighting the country’s efforts to improve homegrown aerospace technology, comes amid growing strategic rivalry in the Asia Pacific.\n“Beijing is intent on not just pushing locally made military aircraft and aerospace technologies, but also its ability to address almost any military requirement out there,” said Kelvin Wong, a Singapore-based defence technology analyst at Janes.\nChina has also built artificial islets and established military outposts far into the South China Sea, which is also claimed by Vietnam, the Philippines, Malaysia, Brunei and Taiwan."
  },
  {
    "headline": "Nigeria: All Governors Have Resolved to Dump Open Grazing, Governors’ Chairman Fayemi Says",
    "summarized_story": "The Chairman of Nigeria Governors’ Forum (NGF) and Governor of Ekiti State, Dr. Kayode Fayemi on Sunday disclosed that all governors in the country have in principle agreed that open grazing was outdated and there was need to embrace modern livestock management approaches.\n“Any time there is an altercation between any of my colleagues, it is something that I feel wholly uncomfortable about because it takes us away from the substance, in this case on open grazing.\nOn the one hand, we have all agreed at the level of the NGF that open grazing is outdated and we need to look for alternative modern livestock management approaches,” Fayemi said.\nAnd that is why I said both sides are correct in the sense that Nasir El- Rufai of Kaduna State is talking about ranching as alternative way of stopping unrestrained open grazing and catering to the need of those who embark on open grazing approaches.\n“We have suggested that the only body that belongs to both the federal, state and the local governments is the Nigerian Sovereign Investment Authority (NSIA) in which we are shareholders."
  },
  {
    "headline": "Hundreds of Tunisians Protest President Saied’s ‘Power Grab’",
    "summarized_story": "Hundreds of protesters have rallied in Tunisia’s capital to protest against President Kais Saied’s move to seize governing powers.\n“I’m really, really angry,” said Soumaya Werhani, a 30-year-old student amid the roar of the crowd and the sweltering heat.\nHe is taking us back into dictatorship,” Bounara told Al Jazeera.\nSunday’s protest was the second since Saied dismissed the government and suspended parliament on July 25.\nTunisia’s largest political party, the moderate Islamist Ennahdha, decried Saied’s moves as “a flagrant coup against democratic legitimacy”, and called for people to unite and defend democracy in “a tireless peaceful struggle”."
  },
  {
    "headline": "Nigeria: Bandits Free Another Batch of 10 Bethel Baptist Students, 11 Still Held",
    "summarized_story": "Another batch of 10 of the remaining 21 abducted students of the Bethel Baptist High School, Damishi, Kaduna, has been released by bandits after 81 days in captivity.\nJoseph Hayab, said the 10 students were released on Sunday afternoon and were reunited with their parents.\nHowever, while giving an update on the Bethel students kidnap debacle, Hayab expressed hope that the remaining 11 students would soon be released.\nThe bandits were said to have demanded and collected fresh ransom for each batch of students released.\nHis words: “The killing of the soldiers between Marte and Dikwa in Borno State is highly condemnable, it is sad and unfortunate."
  },
  {
    "headline": "Ahead of October Launch, eNaira Platform Goes Live, Records One Million Hits in 24 Hours",
    "summarized_story": "The official website of the upcoming Central Bank of Nigeria’s (CBN) digital currency, the eNaira, has gone live, exactly one week to the planned launch of the initiative.\nRemarkably, 24-hours after the website went live, it has recorded over one million hits, according to analytics monitored by THISDAY.\n“The central bank would not want the event to take the shine away from the Independence celebration,” he said.\nHe said the digital money would lead to easier targeted social interventions, as well as improvement in monetary policy effectiveness, payment systems efficiency, and tax collection.\n“So, your bank balance in physical cash drops to N8 million, while your e-wallet carries N2 million."
  }
]