[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "Breaking: Buhari Writes Senate, Seeks the confirmation of Ariwoola as CJN",
    "summarized_story": "Recall that President Buhari had last month sworn in Ariwoola as the acting CJN following the sudden resignation of Justice Ibrahim Tanko on health grounds.\nRead Also:Acting CJN, Ariwoola born in 1954, not 1958 — S’Court clarifiesCourt increases salaries of CJN, others, directs FG to complyAppointment of Ariwoola as acting CJN well deserved — TinubuWhen finally confirmed by the Senate on Wednesday, Ariwoola thus becomes the third individual to occupy the top Judiciary job of the country in the life of this administration.\nRecall that Justice Walter Onnoghen also became the CJN under the President Buhari administration before he resigned from office.\nAlso President Muhammadu Buhari has forwarded to the Senate for screening and subsequent confirmation, nineteen names as Resident Electoral Commissioners for the Independent National Electoral Commission, INEC .\nPresident Buhari has also forwarded to the Senate for confirmation, four None Executive Directors of Board of Central Bank of Nigeria, CBN."
  },
  {
    "headline": "Failed Rep ambition: EFCC arrests Alfa, herbalist for alleged N24m fraud in Ekiti",
    "summarized_story": "They were arrested on July 7, 2022 in Ado-Ekiti, Ekiti State, following a petition against them, alleging that after collecting the said sum, the whole efforts came to a dead end.\n“I also linked up on the matter with Ifawole Ajibola, and we continued with the sacrifices together, until we were arrested by EFCC,” he said.\nIbrahim, who was the one who had prior contact with the victim, , admitted collecting money at different times.\n“Our own is just to pray and do the necessary sacrifices, which we did, and to leave the rest to God, however, along the line, the zoning for the Reps seat was taken away from Oye-Ekiti to Ikole-Ekiti,” he said.\nThey were arrested along with some of their instruments of trade."
  },
  {
    "headline": "Protesters meet empty Lagos Secretariat, Govt House",
    "summarized_story": "By Adesina Wahab and Victor Ahiuma-YoungProtesters, who on Tuesday took to the streets of Lagos over the continued closure of tertiary institutions as a result of workers’ strike, got to Alausa, Ikeja, the seat of the Lagos State Government to meet an empty Secretariat and Government House.\nThe state government had given its workers four-day holiday to mobilise and go and register for next year’s elections.\nEven at the House of Assembly Complex where the protesters ended their protest, the place was devoid of activities.\nThe same at the Lagos State House, the official residence of the state governor.\nDetails later…Vanguard News Nigeria"
  },
  {
    "headline": "We’ve presence in over 100 nations, IPOB boasts, denies factionalisation of group",
    "summarized_story": "In a statement by its spokesperson Emma Powerful, the group boasted that it has presence in over 100 nations.\nThe group equally noted that it has no faction, reiterating that Nnamdi Kanu remains its leader.\n“Mazi Nnamdi KANU is the only leader in the IPOB, therefore any person claiming to be IPOB autopilot group is totally fake and must be ignored.\nIPOB has only one leader Mazi Nnamdi Kanu.\nESN is one and under the Command of DOS in the absence of Mazi Nnamdi Kanu."
  },
  {
    "headline": "Don’t toy with another #EndSARS uprising, NLC advises FG",
    "summarized_story": "As Falana faults FG’s claims on oil subsidyBy Adesina Wahab and Victor Ahiuma-YoungThe Nigeria Labour Congress, NLC, has advised the Federal Government not to toy with another people’s uprising as witnessed during the #EndSARS protest in 2020 by quickly taking steps to resolve the ongoing industrial actions by staff unions in the nation’s tertiary institutions.\nRead Also:NLC/ASUU rally: CP orders Area Commanders, DPOs, others to personally lead patrols in OyoFemi Falana joins NLC protests, as Deji Adeyanju alleges kidnap of 13 soldiers in AbujaBreaking: NLC fulfils promise, protests against fuel hike, ASUU strike, bad governanceThe call was made on Tuesday by the Chairperson of the Lagos Council of the NLC, Mrs Funmi Agnes Sessy, during the solidarity rally organised by the Congress in support of the Academic Staff Union of Universities ASUU and other unions who are on strike.\nThis is just as Mr Femi Falana, SAN ,has faulted the claims by the FG on paucity of funds to address the issues and its claims on fuel subsidy.\nFalana said the government was being economical with the truth.\nDetails later…Vanguard News Nigeria"
  },
  {
    "headline": "ASUU: Labour unions in Osun join NLC protest",
    "summarized_story": "Labour Union in Osun State on Tuesday joined the national body on a solidarity protest to end the Academic Staff Union of Universities (ASUU) strike.\nThe NLC had called on workers across the country to embark on a two-day nationwide protest.\nVarious labour unions in Osun State on Tuesday joined the industrial action to express their grievance.\nThe unions gathered at Ogo Oluwa filing state in Osogbo on Tuesday.\nSome of the unions and associations seen participating in the protest include members of the Academic Staff Union of Universities (ASUU), Trade Union Congress (TUC), NULGE and the Nigeria Union of Journalists (NUJ)."
  },
  {
    "headline": "Buhari writes Senate, seeks confirmation of Justice Ariwoola as CJN",
    "summarized_story": "The Senate has received a formal request from President Muhammadu Buhari, to confirm the nomination of Justice Olukayode Ariwoola as the Chief Justice of Nigeria.\nThe request was contained in a letter dated 25th July 2022, and read by the Senate President, Ahmad Lawan, at the start of plenary on Tuesday.\nJustice Olukayode Ariwoola is the Chief Justice of Nigeria.\n“While I hope that the submission will be considered in the usual expeditious manner, please accept, Distinguished Senate President, the assurances of my highest consideration.”Justice Ariwoola’s appointment as CJN by President Buhari was sequel to the resignation of former Chief Justice Muhammad Tanko on 27th June 2022.\nHowever, the former CJN, in his resignation letter, cited health grounds as the reason for his decision."
  },
  {
    "headline": "Insecurity: Group tasks citizens on neighborhood watch",
    "summarized_story": "Worried by the uncertainty of ceaseless security challenges facing Nigeria, the Igbo Vanguard Group, IVG, Tuesday advised her citizens to form a neighbourhood watch/surveillance system in their various local communities.\nPresident- General of the group, Nnadozie Uchegbuo said this while interacting with newsmen in Umuahia, Abia State capital.\nFurther, Uchegbuo explained that Neighbourhood watch does not advocate members taking any action when observing suspicious activity in their neighbourhood.\nSo, to assist them, the only solution is neighbourhood watch.\nUchegbuo who exposed and expounded the essence of neighbourhood watch warned that failure to adopt this surveillance system might adversely affect the nation as a result of the prevailing high crime rate."
  },
  {
    "headline": "Ondo: Workers protest ASUU strike, tell FG to accede to lecturers’ demand",
    "summarized_story": "Following the prolonged strike by members of the Academic Staff Union of Universities, ASUU, the Nigerian Labour Congress, NLC, Ondo State chapter joined their counterparts across the country in solidarity with ASUU over the five months old strike.\nThe NLC scheduled for two days is aimed at seeking an end to the lingering ASUU strike.\nThe workers who turned out in their numbers include members of ASUU and other trade unions.\nThey displayed placards and banners with the inscriptions, “Enough is Enough” “End ASUU Strike Now” among others.\nAdeleye reaffirmed NLC’s commitment to promoting good government, which he said would safeguard Nigerians’ future, particularly those of workers and students."
  },
  {
    "headline": "Workers in Oyo Civil Service stage solidarity protest over prolonged ASUU strike",
    "summarized_story": "Various labour unions in Oyo State, have joined their counterparts across the country to observe the solidarity protest over the alleged recalcitrance of the federal government to yield to the demand of the Academic Staff Union of Universities (ASUU), including other sister unions.\nRecall that the Nigerian Labour Congress (NLC) had called on workers across the country to embark on a two-day nationwide protest in view of the ongoing strike embarked upon by ASUU, which had generated much controversy within the Nigerian polity.\nThe protest started at the state secretariat of the NLC in Ibadan, the Oyo State capital.\nSome of the unions and associations that are part of the protest include members of the Academic Staff Union of Universities (ASUU), Nigeria Union of Journalists (NUJ), Trade Union Congress (TUC), Nigeria Union of Local Government Employees (NULGE), NUPENG, JUSUN, SSANU and NASU.\nThe protesting workers have commenced the protest at the NLC secretariat and are currently peacefully matching to other streets within Ibadan metropolis."
  },
  {
    "headline": "BREAKING: Buhari seeks Justice Olukayode Ariwoola's nomination as CJN The Nation Newspaper",
    "summarized_story": "President Muhammadu Buhari on Tuesday urged the Senate to confirm Justice Olukayode Ariwoola for appointment as the substantive Chief Justice of Nigeria (CJN).\nBuhari’s letter of request was read by Senate President Ahmad Lawan on resumption of plenary.\nJustice Ariwoola is the Acting CJN ofNigeria.\nJustice Ariwoola took over the position on acting capacity on June 27 following the resignation of Justice Ibrahim Tanko Muhammad on health grounds.\nThe nominees include: Professor Mike Idiahi Obadan (South South Zone), Professor Odinakachukwu Oniabuko (South East), Prof Jalingo Mohammed (North East) and Adeola Adetunji (South West)."
  },
  {
    "headline": "BREAKING: NLC protesters storm Sanwo-Olu's office over ASUU strike The Nation Newspaper",
    "summarized_story": "Protesters have stormed the office of Lagos Governor Babajide Sanwo-Olu in Alausa over the prolonged strike action by the Academic Staff Union of Universities (ASUU).\nThe protest, which kicked off as early as 7:00am from under Bridge Ikeja, attracted hundreds from various unions.\nThe protesters marched through the major Ikeja road leading to the governor’s office.\nVehicular movements around Ikeja metropolis were disrupted leading to heavy gridlock.\nOperatives, including Police Force, Nigeria Security and Civil Defence Corps, others are providing security to prevent a security breach or attack on the protesters."
  },
  {
    "headline": "BREAKING: NLC issues FG ultimatum over ASUU strike The Nation Newspaper",
    "summarized_story": "The Nigeria Labour Congress (NLC) Lagos State chapter has issued a two-week ultimatum to the Federal Government to resolve the ongoing strike embarked by the Academic Staff Union of Universities (ASUU).\nSpeaking at protest in Ikeja, Lagos NLC chairperson, Mrs Agnes Sessy, urged government to act or risk another #ENDSARS protest.\nThe NLC and other university unions took to the streets of Lagos to protest the ongoing ASUU strike on Tuesday.\nShe said: “If the Federal Government does not resolve the strike within two weeks, there would be nationwide mass protest.\nIn fact, the ENDSARS protest would be a child’s play.”Details Shortly…"
  },
  {
    "headline": "BREAKING: illegal task force officials arrested for disrupting NLC protest The Nation Newspaper",
    "summarized_story": "Security operatives have apprehended illegal task force officials during the protest organised by the Nigeria Labour Congress(NLC) in solidarity with the striking Academic Staff Union of Universities(ASUU) in Lagos on Tuesday.\nThe task force officials, including a driver and other team members, created a scene after arresting an offender.\nThe Nation observed the scene caused some union members to intervene in situation but it resulted in heated arguments.\nIt however took the timely intervention of the security operatives deployed to protest ground to arrest the situation.\nThe task force officials were arrested and have been taken to the police station."
  },
  {
    "headline": "Cholera can kill within hours",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) has warned that cholera, an acute diarrhea disease, can kill within hours.\nCholera, which is endemic in Nigeria, has killed no fewer than 3,604 people in 2021.\nAccording to the report, which ended the epidemiological cycle for 2021, Nigeria recorded 111,662 suspected cases of Cholera.\nIn a fresh message on its Twitter page, NCDC said: “With an incubation period of at least 2 hours, #Cholera can kill within hours if untreated.\nReporting suspected cases early increases the chances of survival.”"
  },
  {
    "headline": "JUST IN: Army holds maiden Peace Support Operations Seminar in Abuja",
    "summarized_story": "From Molly Kilete, AbujaThe Army Headquarters in Abuja is holding its maiden peace support operations seminar in Abuja.\nThe seminar which is taking place at the Army War College Nigeria, is being organised by the Army Headquarters Department of Operations.\nThe four day seminar is being attended by top retired and serving military officers, the Chief of Army Staff, Lieutenant General Faruk Yahaya, participants from the Army, Navy, Air Force, Police, paramilitary among other participants.\nLectures to be delivered during the four day conference include Maximizing Economic Benefits from the United Nations Peace Support Operations for Nigeria: Contingent Owned Equipment by Major General J.\nA Ataguba, Nigeria Participation in peace support Operations; Lessons for the Nigerian Army by Major General S. Z. Uba,(rtd), Sexual Exploitation and abuse in peace support Operations: Enhancing understanding amd.compliance by Julie Sanda, Nigeria’s contributions to peace support Operations amidst national security challenges; Options for the Nigerian Army by Major General B A Akinroluyo and Briefs on the 6th International partnership for technology in peace keeping symposium held from 21-24 June 22, at Pretoria South Africa by Major General S Mohammed"
  },
  {
    "headline": "JUST IN: Bandits ransack Kaduna community amidst night downpour, abduct several residents",
    "summarized_story": "From Sola Ojo, KadunaBandits terrorising Kaduna State on Monday night capitalised on downpour and abducted yet to be ascertained several residents of Keke community of Millennium City, Chikun local government area of the state.\nThe Millennium City is an emerging social and commercial community where a 300-bed multi-function hospital low housing scheme is being built by the Kaduna State government.\nSources within the troubled community who spoke in confidence hinted that “the kidnappers came arou9:00 pm0pm during that rain.\nMost of the people kidnapped were just returning home during the attack and they just ran into the bandits”, the source said.\nAs of the time of filing this report, no official statement from both the Kaduna State Police Command and Kaduna State Ministry of Internal Security and Home Affairs regarding the development."
  },
  {
    "headline": "BREAKING: 2 Guards Brigade officers killed in terrorists ambush on soldiers in Abuja",
    "summarized_story": "From Molly Kilete, AbujaTwo officers of the Guards Brigade, Nigerian Army who were ambushed by terrorists on Sunday, in Abuja have been confirmed dead.\nOne of the officers it was gathered was a Regular Combatant Officer, while the other was a Direct Short Service Commission Officer.\nDaily Sun, gathered that already, the Guards Brigade authorities have contacted the families of the deceased officers to break the sad news of their passing.\nThe incident has thrown the entire Guards Brigade family into a mourning mood.\nThe attack and killings of its soldiers not withstanding, the brigade had deployed massively to surrounding hills and forests to track the killers."
  },
  {
    "headline": "HAPPENING NOW: NLC protesters heading to Alausa, Lagos",
    "summarized_story": "By Gabriel DikeThe Nigeria Labour Congress (NLC) protest in Lagos is underway as the various unions head to the seat of power in Alausa.\nOver 30 affiliates of NLC are participating in the protest organized in support of the ongoing strike in the Nigerian University System (NUS).\nVarious speakers including the NLC, Chairperson, Funmi Sessi and ASUU Lagos Zonal Coordinator, Dr. Adelaja Odukoya, explained the reasons for the protest.\nBoth condemned the lackadaisical attitude of the Federal Government to the demands of the staff unions in the NUS."
  },
  {
    "headline": "BREAKING! Heavy security presence around in Ikeja ahead of NLC protest",
    "summarized_story": "BY GABRIEL DIKEVarious staff unions led by the Nigeria Labour Congress (NLC) have gathered at Ikeja preparatory to the protest in support of striking staff unions in the nation’s tertiary institutions.\nThe NLC Chairperson, Funmi Sessi and other Union leaders have occupied a section of the Ikeja under bridge.\nThe Lagos State Command of the Nigeria Police have mobilized its personnel, numbering over 100.\nMen of the Nigeria Police, Lagos State Command have been deployed heavily around the Ikeja under bridge, venue of the Nigerian Labour Congress protest in Lagos, as workers converge on the area for the protest.\nREAD ALSO: NLC Lagos mobilises for 2-days protestThe Lagos NLC on Monday called on members and civil society groups in the state to come out en-masse on Tuesday morning to begin the two-day protest in solidarity with striking lecturers."
  },
  {
    "headline": "Town Planning Community Lauds Olaseni for Pursuing Innovative Practices – THISDAYLIVE",
    "summarized_story": "Olujimi also commended Olaseni for his resilience and invaluable contribution to the Town Planning profession.\nAppreciating the guests, Olaseni expressed his deepest gratitude to his colleagues at Yaba College of Technology, fellow town planners, distinguished guests, and his wife, Pastor (Mrs) Ajibike Risikat Olaseni and children.\nThe annual lecture series attracted eminent Nigerians from the Town Planning industry who gathered to witness the maiden edition of the annual lecture series organized by the Dr. Abubakar Mobolaji Olaseni Annual Lecture Planning Group.\nAn urban and regional planner with a specialization in urban planning, transport systems planning and management, Olaseni has served as the Head of the Urban and Regional Planning Department (2003-2009), Director Internal Quality Unit (2009-2010), and Deputy Rector, Academics (2010-2012).\nPresently, he acts as a Chief Lecturer at Yaba College of Technology and an Associate Lecturer at the URP Department, University of Lagos."
  },
  {
    "headline": "Breaking: Buhari Asks Senate to Confirm Ariwoola as CJN – THISDAYLIVE",
    "summarized_story": "Sunday Aborisade in AbujaPresident Muhammadu Buhari on Tuesday asked the Senate to confirm the appointment of the acting Chief Justice of Nigeria, Justice Olukayode Ariwoola, as the substantive CJN.\nThis is contained in a letter from the president read by the Senate President, Ahmad Lawan, at plenary.\nBuhari said his letter was pursuant to Section One (1) of the Constitution of Nigeria.\nDetails later…"
  },
  {
    "headline": "Buhari Appoints Biu as Acting FRSC Corps Marshal – THISDAYLIVE",
    "summarized_story": "President Muhammadu Buhari has approved the appointment of Mr. Dauda Biu, as the Acting Corps Marshal of the Federal Road Safety Corps (FRSC), following the retirement of Mr. Boboye Oyeyemi.\nThis is contained in a statement by the Corps Public Education Officer (CPEO) Assistant Corps Marshal (ACM) Bisi Kazeem on Monday in Abuja.\nBello said that the former Corps Marshal laid a good foundation for the corps and urged the acting corps marshal to continue where he stopped.\nBiu appreciated the management of the FRSC and the presidency for the appointment and pledged to justify the appointment.\nBefore his appointment, Biu was the Deputy Corps Marshal, Finance and Accounts at the FRSC headquarters."
  },
  {
    "headline": "Military Nabs Five Gun Runners, Kidnappers in Plateau – THISDAYLIVE",
    "summarized_story": "The Defence Headquarters said the troops of Operation Safe Haven have nabbed three suspected gun runners and two kidnappers in different parts of Plateau.\nOnyeuko said the troops had on July 24 apprehended three gun runners during a clearance operation at Shimakar village in Shendam Local Government Area of the state.\nHe named the suspects as Mr. Julius Simon (alias Bagga) (37); Mr. Wolta Zambai (45) and Mr. Iliya Peter (alias Doubok) (27).\nOnyeuko said the troops on same day nab the two kidnappers identified as Alhaji Musa Usman (27) and Adam Mohammed (25) at Barkin Ladi.\n“The Military high command commends troops of Operation Safe Haven and encourages the general public to avail troops with credible and timely information on criminal activities,” he said."
  },
  {
    "headline": "NLC Protest Under way in Rivers over ASUU Strike – THISDAYLIVE",
    "summarized_story": "Blessing Ibunge in Port HarcourtThe Rivers state chapter of the Nigerian Labour Congress (NLC), in solidarity with national body of the union, has embarked on protest to seek reopening of Nigerian universities closed in February when ASUU went on strikeThe union declared “No School for Nigerian children who have been at home for over five months, no elections in the country.”NLC is insisting that the federal government should implement the agreement it had with ASUU years ago so that it can call off its five month-old strike to enable students return to school."
  },
  {
    "headline": "EXCLUSIVE: Allegations Of Cash For Promotion, Nepotism, Other Corrupt Practices Rock Nigerian Anti-Narcotics Agency, NDLEA",
    "summarized_story": "Some men and officers of the National Drug Law Enforcement Agency (NDLEA) have been lamenting how the anti-narcotics agency, through its harmonisation and promotion exercise, has allegedly denied them promotion for about 20 years.\nThis further deepened the bad blood in the agency as officers continued to feel disillusioned,” one of the sources said.\nAlso on the committee were the Chairman of the Harmonisation Committee, Col. Yakubu Bako (rtd) and Head of Statistics and Records, Saidu Daniel, as observers.\nOn the report of the harmonisation review committee which is said to have not been submitted after one year, he said, \"The information is wrong.\n\"In fact, rather than act on the complaints of the aggrieved officers, the agency has started victimising some of them."
  },
  {
    "headline": "EXCLUSIVE: Allegations Of Cash For Promotion, Nepotism, Other Corrupt Practices Rock Nigerian Anti-Narcotics Agency, NDLEA",
    "summarized_story": "Some men and officers of the National Drug Law Enforcement Agency (NDLEA) have been lamenting how the anti-narcotics agency, through its harmonisation and promotion exercise, has allegedly denied them promotion for about 20 years.\nThis further deepened the bad blood in the agency as officers continued to feel disillusioned,” one of the sources said.\nAlso on the committee were the Chairman of the Harmonisation Committee, Col. Yakubu Bako (rtd) and Head of Statistics and Records, Saidu Daniel, as observers.\nOn the report of the harmonisation review committee which is said to have not been submitted after one year, he said, \"The information is wrong.\n\"In fact, rather than act on the complaints of the aggrieved officers, the agency has started victimising some of them."
  },
  {
    "headline": "‘Bishops’ Who Attended Unveiling Of Shettima As APC Vice-Presidential Candidate May Be Fake – Amaechi",
    "summarized_story": "Former Minister of Transportation, Rotimi Amaechi on Sunday said the ‘bishops’ who attended the recent unveiling of Kashim Shettima as the vice-presidential candidate of the All Progressives Congress (APC) may not be real bishops.\n“Those bishops you saw (at Kashim Shettima’s unveiling in Abuja], they may not be bishops, but they are Christians,” Amaechi said.\nRotimi Amaechi also said delegates, who sold their votes at the APC presidential primary election won by Bola Tinubu, were already regretting doing so.\nThose who voted at the APC primary, who are they?\nPray for the leadership of the country, but also pray that ordinary Nigerians choose the right person to govern,\" he said."
  },
  {
    "headline": "‘Bishops’ Who Attended Unveiling Of Shettima As APC Vice-Presidential Candidate May Be Fake – Amaechi",
    "summarized_story": "Former Minister of Transportation, Rotimi Amaechi on Sunday said the ‘bishops’ who attended the recent unveiling of Kashim Shettima as the vice-presidential candidate of the All Progressives Congress (APC) may not be real bishops.\n“Those bishops you saw (at Kashim Shettima’s unveiling in Abuja], they may not be bishops, but they are Christians,” Amaechi said.\nRotimi Amaechi also said delegates, who sold their votes at the APC presidential primary election won by Bola Tinubu, were already regretting doing so.\nThose who voted at the APC primary, who are they?\nPray for the leadership of the country, but also pray that ordinary Nigerians choose the right person to govern,\" he said."
  },
  {
    "headline": "‘Bishops’ Who Attended Unveiling Of Shettima As APC Vice-Presidential Candidate May Be Fake – Amaechi",
    "summarized_story": "Former Minister of Transportation, Rotimi Amaechi on Sunday said the ‘bishops’ who attended the recent unveiling of Kashim Shettima as the vice-presidential candidate of the All Progressives Congress (APC) may not be real bishops.\n“Those bishops you saw (at Kashim Shettima’s unveiling in Abuja], they may not be bishops, but they are Christians,” Amaechi said.\nRotimi Amaechi also said delegates, who sold their votes at the APC presidential primary election won by Bola Tinubu, were already regretting doing so.\nThose who voted at the APC primary, who are they?\nPray for the leadership of the country, but also pray that ordinary Nigerians choose the right person to govern,\" he said."
  },
  {
    "headline": "Lagos, Kano, Delta in the lead as INEC registers 11m voters between June 2021 and July 2022",
    "summarized_story": "The Independent National Electoral Commission (INEC) says over 11 million new applicants have completed their voter registration.\nAdvertisementLagos state is in the lead for the number of completed registrations with 508,936; followed by Kano with 500,207, and Delta with 481,929.\nAccording to INEC, youths aged between 18 and 35 constitute the highest number of completed registrations with a total of 7,828,570.\nThe commission then extended the voter registration by two more weeks — to end July 31.\nFestus Okoye, INEC commissioner for information and voter education, said the exercise will now include weekends as against only weekdays."
  },
  {
    "headline": "Lagos, Kano, Delta in the lead as INEC registers 11m voters between June 2021 and July 2022",
    "summarized_story": "The Independent National Electoral Commission (INEC) says over 11 million new applicants have completed their voter registration.\nAdvertisementLagos state is in the lead for the number of completed registrations with 508,936; followed by Kano with 500,207, and Delta with 481,929.\nAccording to INEC, youths aged between 18 and 35 constitute the highest number of completed registrations with a total of 7,828,570.\nThe commission then extended the voter registration by two more weeks — to end July 31.\nFestus Okoye, INEC commissioner for information and voter education, said the exercise will now include weekends as against only weekdays."
  },
  {
    "headline": "Buhari asks senate to confirm Olukayode Ariwoola as substantive CJN",
    "summarized_story": "President Muhammadu Buhari has asked the senate to confirm Olukayode Ariwoola, the most senior justice of the supreme court, as the substantive chief justice of Nigeria (CJN).\nBuhari’s request was in a letter read by Senate President Ahmad Lawan on the floor of the upper legislative chamber on Tuesday.\nAriwoola has been acting as the CJN since Ibrahim Tanko Muhammad resigned as the head of the country’s judiciary.\nIn the letter read by Lawan, the president based his request on section 231 (1) of the constitution.\n“Pursuant to section 231 (1) of the constitution of the Federal Republic of Nigeria as amended; I forward for confirmation by the Senate of Honourable Justice Olukayode Ariwoola as the chief justice of Nigeria,” Buhari said."
  },
  {
    "headline": "Buhari asks senate to confirm Olukayode Ariwoola as substantive CJN",
    "summarized_story": "President Muhammadu Buhari has asked the senate to confirm Olukayode Ariwoola, the most senior justice of the supreme court, as the substantive chief justice of Nigeria (CJN).\nBuhari’s request was in a letter read by Senate President Ahmad Lawan on the floor of the upper legislative chamber on Tuesday.\nAriwoola has been acting as the CJN since Ibrahim Tanko Muhammad resigned as the head of the country’s judiciary.\nIn the letter read by Lawan, the president based his request on section 231 (1) of the constitution.\n“Pursuant to section 231 (1) of the constitution of the Federal Republic of Nigeria as amended; I forward for confirmation by the Senate of Honourable Justice Olukayode Ariwoola as the chief justice of Nigeria,” Buhari said."
  },
  {
    "headline": "NLC president: We're directly affected by ASUU strike... we may down tools after protest",
    "summarized_story": "Ayuba Wabba, president of the Nigeria Labour Congress (NLC), says the union embarked on a two-day protest against the ongoing ASUU strike because it is directly affected.\nSpeaking on Sunrise Daily, a Channels Television programme, on Tuesday, Wabba said the protest is more than a solidarity action because the labour congress is directly affected.\nAdvertisementHe said if the government does not resolve the issues after the two-day protest, the congress will resort to a three-day warning strike.\n“The two day warning strike is to call for attention and the issues to resolved promptly.\nThe next level is three-day national warning strike, if nothing has happened after the protest to show our grievances,” he said."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "Yamaha and Max announce partnership to scale Max’s services",
    "summarized_story": "Yamaha and MAX announcing the deal Source: MAXFollowing their recent milestone of 100 million kilometres, Max has announced a partnership with Yamaha’s Nigerian subsidiary, Moto Business Service Nigeria (MBSN), to finance and maintain over 50,000 vehicles over the next 2 years.\nThe partnership will expand Max’s operations in Nigeria, Ghana, and Cameroon and fast-track its goal of serving 100,000 independent commercial drivers by the end of 2023.\nBecause of the financing options offered by MBSN, independent commercial drivers using the MAX platform will be able to acquire a variety of vehicles for use in their businesses.\nSpeaking at the announcement event, Adetayo Bamiduro, co-founder and CEO of MAX, said, “We are extremely thrilled to partner with MBSN and the Yamaha Motor Corporation.\nWe will onboard vehicles across multiple cities and generate employment avenues for the youth of the African subcontinent."
  },
  {
    "headline": "Nigerian tech ecosystem groans under rising inflation and fuel price",
    "summarized_story": "Nigerian consumers, who are among the poorest in the world, are miserable because they are increasingly required to pay more money to feed, move around, or be comfortable in their houses due to rising food prices, fuel prices, and bad power supply.\nCaught in the middle of all of this is an Abeokuta-based online food delivery startup, EatUp.\nIt also costs EatUp more to buy bikes for its riders, pay for data, packaging, and branding and get fuel for its riders—all essential elements of its food delivery operations.\nIn a bid to survive the ravaging inflation and increasing fuel prices that month, the food delivery startup had to mark up its delivery fee by 20%, from ₦500 to ₦600.\nThe startup also established partnerships with fuel suppliers to purchase fuel at a discounted rate and distribute it to its fleet of 15 bikes."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Your opinion of public relations (PR) will change after reading this",
    "summarized_story": "Olugbeminiyi is a London-based African tech PR expert and is currently the brain behind Talking Drum Communications, a PR consultancy startup focused on African tech businesses.\nTech PR expert.\nFounder, Talking Drum Communications.\nFounder, Talking Drum Communications.\nGetting into the African tech PR spaceAfter eight years in the European PR space, he got into Wimbart, an Africa-focused tech PR agency."
  },
  {
    "headline": "ASUU strike: Labour begins nationwide solidarity protest",
    "summarized_story": "Members of the Nigeria Labour Congress (NLC) and other national bodies are currently protesting in parts of the country in solidarity with the strike action of the Academic Staff Union of Universities (ASUU).\nSome other unions in the tertiary institutions are also on strike due to the failure of government to meet their agreement.\nRead also: FG declares NLC’s proposed ASUU solidarity protest illegalThe labour Union resolved to hold the action despite appeal by the federal government and alert by security agencies.\nIt is currently holding in Lagos state and Oyo state; and will continue in other parts of the country tomorrow July 27.\nThe police and the Nigeria Security and Civil Defence Corps have deployed personnel in critical infrastructure and facilities in response to the strike."
  },
  {
    "headline": "States owe CBN N1.24trn as FAAC disappoints",
    "summarized_story": "Data obtained from the CBN showed that the states started borrowing from the apex bank in April 2016, with the total loan put at N14.58 billion at the time.\nThe debt owed to the central bank jumped to N300.38 billion in December 2016 and N590.42 billion at the end of 2017.\nStates’ debt to the central bank declined gradually to N600.62 billion in October 2021 from N614.92 trillion in September 2019, but jumped to N700.47 billion in December last year.\nThe disbursement by FAAC to states declined to N590.45 billion in the first quarter of this year from N640.16 billion in the previous quarter.\n“The worsening revenue collection at the federation level is increasing budgetary pressures for the states, and many states are in a precarious fiscal position."
  },
  {
    "headline": "Illicit Drugs: NDLEA nab drug Baron, 9 Others – Nigerian Observer",
    "summarized_story": "It was reliably gathered that the new suspects were arrested in connection with tons of assorted illicit substances seized in Abuja, the Federal Capital Territory (FCT), Kaduna, Sokoto and Anambra States.\nA follow up operation same day led to the arrest of the actual owner of the consignment, Abubakar Isiyaku, in Katsina State.\nAbuja, no fewer than four persons were arrested over 345.4kg cannabis seizures in the FCT.\nGen. Mohamed Buba Marwa (rtd) commended the officers and men of the Commands for the arrests, seizures and their tenacity.\nHe urged them and their colleagues across the country to remain steadfast in pursuit of the Agency’s goal of ridding all parts of Nigeria of illicit substances."
  },
  {
    "headline": "Killing: Ukhiri Elders, Women Group Send Save Our Soul Message To IGP – Nigerian Observer",
    "summarized_story": "The elders comprising some aged women and some youths made the appeal on Monday when they staged a peaceful protest to the State Police Command and the Edo State Government House, Benin.\nSome of the placards bore various instructions including, Inspector General of Police, come to our rescue; Aigbe, the Enogie of Ukhiri is killing us; Enogie is promoting crises in Ukhiri; Enogie says no one can touch him because he is highly connected in the police circle; help us, we are dying, among others.\nThey appealed to the police authorities not to release the Enogie but that he should be charged to court to face prosecution for his misdeeds.\nResponding, the Police Image maker CSP Chidi Nwabuzor informed the protesters of the ability of the Office of the Inspector General of Police to handle the case, stressing that all the case files concerning the Ukhiri crises have been sent to Abuja for further investigation and possible prosecution.\nShare this: TweetWhatsAppEmailPrint..."
  },
  {
    "headline": "Edo confirms eight cases of monkeypox as govt intensifies efforts to contain outbreak – Nigerian Observer",
    "summarized_story": "Edo confirms eight cases of monkeypox as govt intensifies efforts to contain outbreakShare FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Ministry of Health has revealed that eight persons have so far tested positive for monkeypox in the state, urging residents to observe safety measures to reduce the spread of the virus and other infectious diseases in the state.\nThe Edo State Commissioner for Health, Prof. Akoria Obehi, who disclosed this to journalists in Benin City, said that the Ministry has ramped up surveillance and other activities to curb the spread of infectious disease.\nShe, however, noted that all persons who were diagnosed with the disease have recovered.\n“If you suspect any symptoms of monkeypox, kindly visit the nearest health facility for medical attention or call the Acting State Disease Surveillance and Notification Officer (0806 059 3802),” Prof Akoria advised.\nShare this: TweetWhatsAppEmailPrint..."
  },
  {
    "headline": "Family announces burial arrangement for late music maestro, Osayomore – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe family of late music maestro, Ambassador Osayomore Joseph, has announced the burial arrangement for the patriarch, who passed at the age of 76.\nIn a statement signed by Dr. Amadin Osayomore Joseph for the family and the burial committee, the family said activities for the late music legend will begin on Wednesday, 27 July 2022 and end on Sunday, Sunday 31st July, 2022.\n“The match will be followed by PMAN NITE Music Fiesta at No 15, Osayomore Joseph Crescent, Oko Central, Benin City, from 6 pm till dawn.\n“This will be immediately followed by Family Rites and Vigil on Friday 29th July, 2022.”The family disclosed that the Social dance/Entertainment of Guests will take place at Air Force Base Playground at 12noon, on Saturday 30th July 2022.\nThe activities lined up for the burial of late Osayomore will end with a thanksgiving service at Church of God Mission Int’l (Miracle Centre), Airport Road, Benin City at 10 am, on Sunday 31st July 2022."
  },
  {
    "headline": "JUST IN: Buhari asks senate to confirm Ariwoola as substantive CJN",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has written to the Senate, asking for the confirmation of Olukayode Ariwoola as the substantive chief justice of Nigeria (CJN).\nBuhari’s request was in a letter read by Senate President Ahmad Lawan on the floor of the upper legislative chamber on Tuesday.\nAriwoola has been acting as the CJN since Ibrahim Tanko Muhammed resigned as the head of the country’s judiciary.\nIn the letter read by Lawan, the president based his request on section 231 (1) of the constitution.\n“Pursuant to section 231 (1) of the constitution of the Federal Republic of Nigeria as amended; I forward for confirmation by the Senate of Honourable Justice Olukayode Ariwoola as the chief justice of Nigeria,” Buhari said."
  },
  {
    "headline": "Nigerians spend $378m on foreign education in five months – CBN",
    "summarized_story": "Nigerians have spent $378.77 million on foreign education between January and May 2022, according to figures from the Central Bank of Nigeria (CBN).\nIn January 2022, the apex bank noted that a total of $60,202,730.84 was spent on foreign education, while noting that $69.9m was spent in February 2022.\nIn April, the figures dropped a little as a total of $78.62 million was recorded by the apex bank.\nThe figure for May 2022 was stated as $82.70 million, making a total of $378.77 million spent so far in 2022.\nThe data from the apex bank revealed that Nigerians remitted more than $378.77 to foreign academic institutions in five months without significant reciprocity in form of inflows from foreign sources to the local education sector."
  },
  {
    "headline": "I pity those still in captivity – Hassan Usman, freed train attack victim speaks",
    "summarized_story": "He is one of the four victims freed yesterday by the terrorists.\nUsman while speaking in an interview with the Hausa Service of the British Broadcasting Corporation, expressed gratitude to God for regaining his freedom.\nHe noted that on Friday, families of the victims attempted to rescue them but the government did not allow them to proceed on the journey.\nHe, however, said that another attempt made on Monday was successful, leading to the release of the three from captivity.\nEven yesterday they slaughtered a cow and we ate; we thank Allah."
  },
  {
    "headline": "NLC holds protest nationwide, vows to reenact Sri Lankan experience in Nigeria if…",
    "summarized_story": "The Nigeria Labour Congress (NLC), on Tuesday, held protest marches across the country, as workers from its over 52 affiliates gathered in Ikeja, Lagos, and state capitals across the country.\nThe Labour union even threatened to reenact the Sri Lankan experience if the federal government fails to find a solution to the ongoing strike action embarked on by the Academic Staff Union of Universities (ASUU).\nNLC warned that should the federal government fail to reach quick fix agreements with the Academic Staff Union of University, ASUU, the umbrella labour union will organize a massive shutdown that will make the Sri Lankan experience a child’s play.\nSpeaking at protest in Ikeja, Lagos NLC chairperson, Mrs Agnes Sessy, urged government to act or risk another #ENDSARS protest.\nShe said: “If the Federal Government does not resolve the strike within two weeks, there would be nationwide mass protest."
  },
  {
    "headline": "No APC candidate as INEC publishes list Akwa Ibom governorship candidates",
    "summarized_story": "There is no APC governorship candidate for Akwa Ibom state in the list published by the Independent National Electoral Commission (INEC).\nThe space meant for APC’s governorship candidate was blank in the list pasted at the INEC headquarters in Uyo, Akwa Ibom, over the weekend, according to Premium Times.\nWhile this implies that APC may not participate in the 2023 governorship election in Akwa Ibom, the recent development was not completely unexpected.\nAccording to the electoral act, a party primary is null and void if it is not monitored by INEC officials.\n“By the time we woke up in the morning, they said at some location, they have done governorship primary."
  },
  {
    "headline": "ASUU: Varsity Lecturers, Students Join NLC Solidarity Protest In Rivers",
    "summarized_story": "Hundreds of lecturers and students from various tertiary institutions in Rivers State, on Tuesday, joined workers in the state on a protest march to the Government House, Port Harcourt, in solidarity with the striking members of the Academic Staff Union of Universities (ASUU).\nThe protesters, who started gathering along Igboukwu Street in D/Line area of Port Harcourt, close to the sealed NLC secretariat as early as 7:15 am, were also not frightened by the presence of over 100 armed policeman stationed in front of the secretariat.\nAddressing the protesters, NLC chairman in the state, Comrade Beatrice Itubo, said Nigerian workers were concerned over the condition of ASUU members and university students in the country.\nThe lecturers and other principal officers of Nigerian universities are our people.\nThey are all members of the Nigeria Labour Congress and today we have decided to protest peacefully."
  },
  {
    "headline": "ASUU: Varsity Lecturers, Students Join NLC Solidarity Protest In Rivers",
    "summarized_story": "Hundreds of lecturers and students from various tertiary institutions in Rivers State, on Tuesday, joined workers in the state on a protest march to the Government House, Port Harcourt, in solidarity with the striking members of the Academic Staff Union of Universities (ASUU).\nThe protesters, who started gathering along Igboukwu Street in D/Line area of Port Harcourt, close to the sealed NLC secretariat as early as 7:15 am, were also not frightened by the presence of over 100 armed policeman stationed in front of the secretariat.\nAddressing the protesters, NLC chairman in the state, Comrade Beatrice Itubo, said Nigerian workers were concerned over the condition of ASUU members and university students in the country.\nThe lecturers and other principal officers of Nigerian universities are our people.\nThey are all members of the Nigeria Labour Congress and today we have decided to protest peacefully."
  },
  {
    "headline": "You Can’t Shut Down Nigeria Because Of Banditry, SDP Candidate Tells Buhari",
    "summarized_story": "The Social Democratic Party (SDP) has challenged President Muhammadu Buhari over the rising insecurity in the country, stating that he can’t shut down the country because of bandits.\n“We have banditry, revenue is in the shortfall, what we are generating can’t service our debts.\nThe shutdown of the FCT schools shows that the presidency has been shut down.\n“Before the shutdown of the schools, the shutdown started at the presidency.\nYou can’t shut down the country because of banditry,” Adebayo said."
  },
  {
    "headline": "You Can’t Shut Down Nigeria Because Of Banditry, SDP Candidate Tells Buhari",
    "summarized_story": "The Social Democratic Party (SDP) has challenged President Muhammadu Buhari over the rising insecurity in the country, stating that he can’t shut down the country because of bandits.\n“We have banditry, revenue is in the shortfall, what we are generating can’t service our debts.\nThe shutdown of the FCT schools shows that the presidency has been shut down.\n“Before the shutdown of the schools, the shutdown started at the presidency.\nYou can’t shut down the country because of banditry,” Adebayo said."
  },
  {
    "headline": "Ekweremadu To Remain In Custody As Wife Is Granted Bail",
    "summarized_story": "A UK judge has granted the wife of Senator Ike Ekweremadu, Beatrice, bail while remanding her husband in prison, following their arrest over alleged organ harvesting.\nEkweremadu, a lawyer and former deputy president of the Nigerian Senate, and Beatrice, an accountant, appeared at the Old Bailey on Friday for a bail hearing.\nThe Common Sergeant of London, Judge Richard Marks, said: “The position is that I have granted bail to Beatrice subject to some fairly stringent conditions but I have refused bail to Ike.”UK Doctor Charged For Conspiring With EkweremaduProsecutors are not appealing the decision, the court heard.\nProsecutor Tim Probert-Wood said previously that the case involved “exploitation and the harvesting of an organ.”Ekweremadu and his wife, Beatrice were arrested in the UK weeks ago for plotting to traffic a homeless man into the UK to harvest a kidney for their daughter.\nMrs Ekweremadu, 55, together with her husband, Ike Ekweremadu, 60, allegedly trafficked the 21-year-old to London from the streets of Lagos in order to harvest his organ."
  },
  {
    "headline": "Breaking: Buhari writes Senate to confirm Justice Ariwoola as CJN",
    "summarized_story": "The Senate has received a formal request from President Muhammadu Buhari, to confirm the nomination of Hon.\nJustice Olukayode Ariwoola as the Chief Justice of Nigeria.\nThe request was contained in a letter dated 25th July, 2022, and read by the Senate President, Ahmad Lawan, at the start of plenary on Tuesday.\nJustice Olukayode Ariwoola as the Chief Justice of Nigeria.\nHowever, the former CJN, in his resignation letter, cited health grounds as reason for his decision."
  },
  {
    "headline": "British Conservatives favouring Truss before 2nd debate with Sunakv",
    "summarized_story": "British Foreign Secretary Liz Truss and former chancellor of the exchequer Rishi Sunak, would clash on TV for a second time in 24 hours.\nThe two hopefuls to head the Tory party clashed already on Monday, primarily about their economic plans.\nThat showdown saw the two rivals trash each other’s economic plans, while personal attacks continued, with Sunak accused by allies of Truss of “mansplaining’’ during the debate.\nFormer cabinet minister, David Davis, who supported Sunak, said Truss’ policies would risk fuelling inflation.\n“The Tory Party, generally speaking, is a bit older than average."
  },
  {
    "headline": "Nigerian Police Storm Labour House In Adamawa Over ‘Solidarity Protest’ With University Lecturers, ASUU",
    "summarized_story": "The Adamawa State Commissioner of Police, Sikiru Akande, on Tuesday led a heavy detachment of policemen to the Nigeria Labour Congress (NLC) House, venue for takeoff of today’s nationwide protest in solidarity with the striking university lecturers.\nNews Direct sighted fierce looking armed policemen with their long convoy of personnel carrier and gun trucks in front of the gate leading into the Labour House.\nIt was gathered that the Commissioner of Police was inside the building, engaging with the NLC state chairman, Emmanuel Fashe.\nIt was not yet clear whether the police came to stop the protest or to provide security for the protesters."
  },
  {
    "headline": "Lawyer drags Tinubu, APC to court over Muslim-Muslim ticket",
    "summarized_story": "The All Progressives Congress (APC) and Bola Tinubu, the party’s presidential candidate, have been sued by Abuja-based attorney Osigwe Momoh for choosing a Muslim as their vice presidential candidate.\nAs his running mate for the 2023 presidential race, Kashim Shettima, a fellow Muslim and former governor of Borno, had been picked by Tinubu.\nMany people, most notably the Christian Association of Nigeria (CAN), have voiced their strong opposition to the development, which has continued to spark controversy.\nHe said the APC is in violation of the Nigerian constitution by picking its presidential candidate and his running mate from the same religion.\nMomoh is also seeking an order “nullifying the candidacy of APC, Tinubu (1st And 2nd), same being unconstitutional and against the spirit and letters of Sections 14 (1) & (3), 15 and 224 (a) of the amended 1999 Constitution of the federal republic of Nigeria”."
  },
  {
    "headline": "BREAKING: After Threatening To Kidnap Buhari, Gov El-Rufai, Terrorists Attack Millennium City Settlement In Kaduna, Abduct Scores Of Residents",
    "summarized_story": "BREAKING: After Threatening To Kidnap Buhari, Gov El-Rufai, Terrorists Attack Millennium City Settlement In Kaduna, Abduct Scores Of ResidentsTerrorists, locally dubbed bandits, have again struck the New Millennium City Settlement, in the Chikun Local Government Area of Kaduna State, kidnapping scores of residents.\nOnly three weeks ago, the terrorists attacked Sabon Gero community in the New Millennium City Settlement, killing a joint task force commander and a resident.\nIn the fresh attack on Monday, News Direct learnt that scores of residents were also kidnapped from the New Millennium City Settlement.\nNews Direct last weekend reported that terrorists in a viral video threatened to abduct and kill President Muhammadu Buhari and Governor of Kaduna State, Malam Nasir El-Rufai.\nBy God’s grace, El-Rufai, Buhari, we will bring you here,” one of the terrorists had boasted."
  },
  {
    "headline": "2023: I have no plan to support Atiku for president, want to win – Peter Obi",
    "summarized_story": "2023: I have no plan to support Atiku for president, want to win – Peter ObiThe Labour Party presidential candidate, Peter Obi, said on Monday he has no plan to support his Peoples Democratic Party (PDP) counterpart, Atiku Abubakar, in the 2023 election.\nObi, who stated this when he featured in a Channels Television programme, Politics Today, said he planned to win next year’s election.\nThe ex-Anambra governor also confirmed that he did not inform the PDP candidate before leaving the party in May.\nObi said: “It is true that I did not tell Atiku Abubakar before resigning from the PDP.\n“I am not considering supporting Atiku for President."
  },
  {
    "headline": "Breaking: Buhari wants Senate to confirm Justice Olukayode Ariwoola as CJN, 19 RECs too",
    "summarized_story": "President Muhammadu Buhari has requested the Senate to confirm appointment of Justice Olukayode Ariwoola as substantive Chief Justice of Nigeria (CJN).\nThe President in another letter requested the Senate for confirmation of appointments of 19 Resident Electoral Commissioners, five of whom are for re – appointment while the remaining 14 are for fresh appointment.\nConfirmation of appointments of four non – executive directors of the Central Bank of Nigeria (CBN) was also sought by the President in a separate letter for that effect.\nShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Breaking: Security beefed up at Alausa as protesters move to Lagos secretariat",
    "summarized_story": "Members of the Nigeria Labour Congress (NLC) and youth participating in the ongoing protest which began on Tuesday morning have moved from Ikeja to the Lagos State Secretariat in Alausa.\nThe protesters carried placards with several inscriptions such as ‘Stop importation of petrol, refine the refineries’, ‘Nigeria at 60 years of independence, more hunger in the land, etc.\nMrs. Funmi Sessi, Lagos state chairman of NLC gave the directive at a stakeholders’ meeting at the union’s secretariat in Yaba, Lagos state.\nSessi said the exercise was ready to be held on Tuesday and Wednesday as part of the nationwide action.\n“The protest is to support ASUU in the ongoing strike, so we call on all affiliate members to come out en masse.’’Meanwhile, Security has been beefed up at the State Secretariat to forestall any breakdown of law and order."
  },
  {
    "headline": "Why I stopped supporting Peter Obi – Deji Adeyanju",
    "summarized_story": "Kogi-born activist, Deji Adeyanju, has stated the reason he stopped supporting the presidential ambition of Labour party presidential flagbearer and the former governor of Anambra state, Peter Obi.\nHe alleged that Peter Obi is not a saint, and was as corrupt as others.\nAdeyanju stated that Obi’s decision to invest Anambra state money into his family business was the height of corruption and abuse of office.\nAdeyanju tweeted, “The real reason I stopped supporting Peter Obi was after I met him for a 3hrs meeting at his instance of course & he told me he invested billions of Anambra State funds into his family business.\nInvesting Anambra money into his family business is the height of corruption and abuse of office.”Share this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Bakers call off strike in Kogi, threaten bread price hike",
    "summarized_story": "By Friday Idachaba, LokojaMaster Bakers and Caterers in Kogi on Monday called off their five-day warning strike with a threat of imminent hike in the price of bread.\nChief Gabriel Bamidele Adeniyi, Chairman of Kogi chapter of Association of Master Bakers and Caterers of Nigeria disclosed this while speaking with newsmen in Lokoja.\n“By God’s grace, we have resumed production of bread again after ending our strike midnight of Sunday, July 24.\n“We want the public to know that the new increment in prices of staple bread is not our making but that of the increase in the prices of commodities we use in bread production.\n“Unfortunately those three firms are monopolizing the prices of Sugar, Yeast and Flour to the detriment of bakers in Nigeria”, he stated."
  },
  {
    "headline": "BudgeIT asks FG to discontinue ‘indiscriminate’ borrowing",
    "summarized_story": "BudgIT, Nigeria’s foremost civic-tech organization, has expressed concern over what it described as the “indiscriminate borrowing” by the Federal Government.\nBudgIT in a statement on Monday signed by Iyanu Fatoba, assistant head, media and communications, said the fortunes of Nigeria have worsened in the last eight months.\nThe organisation urged the government to discontinue indiscriminate borrowing, saying that the most pressing concern is the debt service-to-revenue ratio, which has reached alarming levels within the first four months of 2022.\nBudgIT said factors such as the 2022 being a pre-election year; the growing fiscal threat posed by subsidy payments and the debt service-to-revenue ratio; will negatively impact Nigeria’s budget credibility, cripple service delivery in critical social sectors of the economy and impede needed investments in productive sectors, thereby stunting economic growth.\nBudgIT expressed worry, particularly at the poor fiscal performance of the federal government’s 2022 budget and the rising subsidy payments, especially the debt service-to-revenue ratio which has reached alarming levels at N1.94 trillion between January and April this year, representing over 100% of the nation’s N1.64 trillion revenue within the same period."
  },
  {
    "headline": "NERC, NOA sign MoU for orientation of electricity consumers on relationship improvement",
    "summarized_story": "By Onu OkorieNigerian Electricity Regulatory Commission (NERC) has formed partnership with the National Orientation Agency (NOA over the weekend as efforts are intensified accross Nigeria to effectively sensitise the public over improved relationship in the sector relationship .\nThe partnership was consumated at the headquarters of NERC, where the both agencies signed a Memorandum of Understanding (MoU).\nSanusi Garba, the Chairman of NERC, said the Nigerian Electricity Supply Industry (NESI) requires more sensitization and Nigerians need knowledge on how they get electricity, noting that the NOA platform is for educating Nigerians on electricity theft, safety and other issues.\nHe said, “There is a huge amount of ignorance among our populace on how things are done especially in technical areas like electricity supply.\nOn this NOA pact whose process began in January, she said: “They have been sending bulk SMS to invite customers to our programmes wherever NERC goes to sensitise consumers,” adding that consumers will be educated on their rights and responsibilities."
  },
  {
    "headline": "UN applauds Sterling One Foundation over Africa social impact summit",
    "summarized_story": "By Kehinde Ibrahim, LagosTHE United Nations Resident and Humanitarian Coordinator, Nigeria Mr. Matthias Schmale, has commended the Sterling One Foundation for creating a convening to accelerate growth towards the 2030 Sustainable Development Goals across Africa.\nThis was shared during the 2-day hybrid event held on July 13-14, 2022, at the prestigious Transcorp Hilton Hotel Abuja which had about 4,000 registered delegates from 55 countries.\nMost of these businesses already have conditional commitments from our investors at the event and we expect to seal these deals in the coming weeks working with the investees.\nWe will continue facilitating financing for purpose and profit driven business solutions that will help promote access to health and education for all while guaranteeing returns for impact investors locally and globally’’, she added.\nShe noted that the Foundation was already working with various partners and will continue in this light as the event was organized in partnership with the United Nations Global Compact Network Nigeria, Sterling Bank, the Coca Cola Company, VFD Group, the Impact Investors Foundation, Giving.ng, the Nigeria Climate Innovation Center (NCIC), the Nigerian Economic Summit Group (NESG), Ventures Africa, Proshare and Tech Cabal."
  },
  {
    "headline": "NASENI MD Prof Haruna bags outstanding performance Award",
    "summarized_story": "By Eunice OrikeThe Executive Vice Chairman/Chief Executive of the National Agency for Science and Engineering Infrastructure(NASENI), Engr.Prof.\nMohammed Sani Haruna has received Business Day outstanding performance Award ahead over 100 Ministries Departments and Agencies (MDAs) of Government assessed by a special panel set up by the newspaper.\nAccording to Business Day Panel’s assessment in year 2021, NASENI under Prof. Haruna’s leadership recorded impeccable achievements in areas of inventions, innovations and products development through multi-sector interventions.\nThe verdict of the judges was that the Executive Vice Chairman of NASENI distinguished himself as an administrator per excellence through the various innovations introduced to NASENI.\nBecause of the leadership by Prof. Haruna, NASENI rose from an obscure agency in the Federal Ministry of Science and Technology to an agency that has contributed immensely to national development."
  },
  {
    "headline": "University Strike: Three Days National Warning Strike Next If FG Fails To Act – NLC",
    "summarized_story": "﻿The Federal Government should brace for a three-day nationwide strike across all sectors if the crisis in the nation’s public universities is left unresolved, the Nigeria Labour Congress (NLC) has warned.\nScores of unions in various critical sectors such as aviation, electricity, and petroleum among others, are affiliated with the labour union.\nNLC President, Ayuba Wabba, gave the warning on Tuesday during his appearance on Channels Television’s breakfast show, Sunrise Daily, amid the protest by members of the union across the country.\n“The protest first is to show our concern and to also call for urgent action to resolve the issues.\nUniversity workers, including members of the Academic Staff Union of Universities (ASUU), Senior Staff Association of Universities (SSANU), Non-Academic Staff Union of Universities (NASU), and National Association of Academic Technologists (NAAT), had gone on strike for various reasons."
  },
  {
    "headline": "NLC Holds Nationwide Protest Over University Unions Strike",
    "summarized_story": "The Nigeria Labour Congress (NLC) is holding a protest across the country amid the prolonged strike by university workers.\nWhile the demonstration is expected to take place in all 36 states of the Federation, the Federal Capital Territory (FCT) will join the protest on Wednesday.\nUniversity workers, including members of the Academic Staff Union of Universities (ASUU), Senior Staff Association of Universities (SSANU), and the Non-Academic Staff Union of Universities (NASU), among others, had gone on strike for various reasons.\nWhile the government is still struggling to resolve the issues raised by the striking lecturers, the crisis in the public universities may not end soon as NASU and SSANU have also voiced their concerns.\nit went on to declare a two-day nationwide protest to stress the importance of resolving the impasse with the unions in order to save the university education system from collapse."
  },
  {
    "headline": "Terrorists Attack Troops Of Presidential Guards Brigade In Abuja",
    "summarized_story": "The Troops of the 7 Guards Brigade which provides security for the Presidential Villa and the Federal Capital Territory (FCT) have been attacked by gunmen suspected to be terrorists.\nA spokesperson for the Guards Brigade, Captain Godfrey Anebi Abakpa, confirmed the incident to Channels Television in a text on Tuesday.\nHe added that the troops were combing the general area to get rid of the criminals who have been threatening the general area.\nWe had a few (men) wounded in action who have been taken to the hospital and receiving treatment,” the Guards Brigade spokesman said.\nAccording to sources, the attackers of the Guards Brigade were headed to the Nigerian Law School in Bwari when they ran into the troops."
  },
  {
    "headline": "Insecurity: My Solution Will Be Decisive And Immediate, Says Peter Obi",
    "summarized_story": "The presidential candidate of the Labour Party, Peter Obi, on Monday said that when he becomes president in 2023, he will face the nation’s security crisis head-on.\nIn an interview on Channels Television’s Politics Today, the former Anambra State governor said his solution to the problem will be “decisive and immediate”.\nWhile stressing that the nation’s security situation has been very worrisome, Mr Obi said he feels the Federal Government should do more.\nSpeaking further, Mr Obi was of the opinion that there needs to be an economic transformation for the security situation in Nigeria to change.\n“To improve the security situation in Nigeria, as President, I will ensure the economy works and more people are pulled out of poverty."
  },
  {
    "headline": "Monkeypox Symptoms, Diagnosis, Treatments And Vaccines",
    "summarized_story": "The World Health Organization declared monkeypox a global health emergency at the weekend, as calls grow for swift action to stop the spread of the virus.\nHere is an overview of the symptoms, diagnosis, treatments and vaccines.\n– Symptoms –The first symptoms can include a fever, headaches, sharp muscle pains, fatigue, a rash, as well as swollen and painful lymph nodes.\nDiagnosing the virus can be difficult due to its inconsistent symptoms, which can resemble sexually transmitted infections, several health authorities have warned.\nAs the vaccines do not provide immediate or total protection, health authorities advise caution after receiving an injection."
  },
  {
    "headline": "I am practicing public health even as APC women leader",
    "summarized_story": "The national women leader of the All Progressives Congress, Dr Betta Edu has declared that she is not leaving or abandoning Public health sector, which is her professional career for politics.\nThe women leader said the APC candidate has given many women the platform to thrive not only in political space, but every other sphere of life.\nAdvertisementThe APC national women leader said the former governor is someone that can be trusted that he will give women more opportunities when he gets to power.\nAnd he promised that beyond the 35% affirmative, he will give women more sensitive positions in government from the cabinet to the heads of parastatals,” the women leader said.\nAdvertisementThe APC National Women Leader frowned at believes in section of Nigeria that women should not be heard, or should be on the same path as men, and that they cannot contribute equally, and that women should stay at home."
  },
  {
    "headline": "Tinubu will give women more opportunities if elected",
    "summarized_story": "The APC women leader gave the commendation on Monday while featuring on TVC News programme, This Morning with Yori Folarin.\nAdvertisementThe women leader said the APC candidate has given many women the platform to thrive not only in political space, but every other sphere of life.\nThe APC national women leader said the former governor is someone that can be trusted that he will give women more opportunities when he gets to power.\nHe has given women more opportunities in government.\nAnd he promised that beyond the 35% affirmative, he will give women more sensitive positions in government from the cabinet to the heads of parastatals,” the women leader said."
  },
  {
    "headline": "Ogun declares Tuesday work-free for PVC registration",
    "summarized_story": "The Ogun State Governor, Dapo Abiodun, has declared Tuesday, 26th July, 2022 as a work-free day in the State as the deadline for registration of voters for 2023 General Elections comes to a close on Sunday, 31st of July.\nIn a Statement issued in Abeokuta on Sunday by his Chief Press Secretary, Kunle Somorin, the Governor said the “one-day public holiday is to provide a window for all workers in the state, who have either lost their cards, not registered or who might need to travel to their wards, local government areas and constituencies to perfect their Permanent Voters Registration or transfer their cards, where necessary, to enable them participate in the next general elections”.\nAdvertisement“As an inclusive, participatory and accountable government, the role of PVCs to the citizens cannot be overemphasised,” the statement added.\nThe Governor, therefore, urged all eligible adults to seize the opportunity of the holiday to go home to their different wards and constituencies to search for their Registered Voter Cards (PVCs), fill the claims and objections forms and transfer the PVCs where necessary, the statement concluded.\nAdvertisement"
  },
  {
    "headline": "I am in APGA to effect positive change in Enugu-Frank Nweke",
    "summarized_story": "Speaking on TVC’s most popular current affairs show, Journalist Hangout, on Sunday, Mr Nweke said his leaving the PDP was not far fetched.\nMr Nweke bemoaned the current state of Enugu, claiming that there has been no positive development in 7 years of PDP rule.\n“Structure or no structure, across the length and breadth of enugu,the people are living in abject poverty.\n“The water crisis is affecting the entire people of Enugu, structure or no structure.\nAdvertisement“The poor road infrastructure is affecting their businesses, structure or no structure,“The insecurity affects the citizens of Enugu irrespective of structure of any party in power”."
  },
  {
    "headline": "Jonathan Meant Well But was Bullied Out of Office – Mahdi Shehu",
    "summarized_story": "Activist, Mahdi Shehu and Former Commander of Multinational Joint Task Force, Gen John Temlong Rtd, speak on the growing concerns of insecurity ravaging the nation."
  },
  {
    "headline": "Pope Francis Says He’s ‘Deeply Sorry’ to Canadian Residential School Survivors",
    "summarized_story": "In his first public remarks in Canada, Pope Francis has asked indigenous residential school survivors for forgiveness.\n“I am deeply sorry,” the Pope said on the grounds of a former residential school in Maskwacis, near Edmonton.\nHis remarks were heard by indigenous chiefs who gathered at Muskwa Park alongside First Nations, Métis and Inuit residential school survivors.\nThe TRC report called the residential school system a central element of “cultural genocide” against indigenous peoples of Canada.\nThe TRC report called the residential school system a central element of “cultural genocide” against indigenous peoples of Canada."
  },
  {
    "headline": "Buhari to Stress Importance of Credible Polls in Monrovia as Liberia Marks 175th Independence",
    "summarized_story": "As Nigeria, Liberia and Sierra Leone head to the polls in 2023, President Muhammadu Buhari will Tuesday stress the importance of free, fair and credible polls in the countries.\nThe President, according to a press release issued Tuesday by his spokesman, Mallam Garba Shehu, would deliver an address in Monrovia, the Liberian capital, in his capacity as the Special Guest of Honour at the 175th independence anniversary of Liberia.\n“Peace and security of Liberia (and Sierra-Leone) is important to Nigeria given the enormous investments in men, material and resources expended by this country to secure the two states.\n“Without the leadership of Nigeria in the context of ECOWAS to secure these two, there would not have been a Liberia on the map in its present configuration today.\n“Bilaterally, Nigeria and Liberia may bring to the table issues of cross-border terrorism, bolstering defence and trade ties.”The warmth of the relationship and personal chemistry between President Buhari and George Weah of Liberia is no less significant and will play a key role at the event."
  },
  {
    "headline": "Access Bank Secures US-DFC $280m Financing for On-Lending to SMEs",
    "summarized_story": "Nathan said the DFC financing for Access Bank would provide needed liquidity given the global economic downturn caused by the COVID-19 pandemic.\n“DFC’s investment in Access Bank demonstrates US support for private sector-led development in Nigeria and throughout West Africa.\nAccess Bank Bags Compliance Management System Standard CertificationMeanwhile, in recognition of its commitment to achieving sustainable business continuity, Access Bank has been conferred the MSECB Management System Certificate in accordance with the management system requirements in ISO 37301:2021.\nPublished in April 2021, the ISO 37301 Compliance Management System seeks to provide a certifiable global benchmark for compliance systems.\n“As a leading financial institution, Access Bank continues to promote responsible environmental stewardship and stimulate socially responsible development."
  },
  {
    "headline": "Hope Rises for Nigeria as TotalEnergies Announces Production at 50,000bpd Oil Field",
    "summarized_story": "Nigeria’s hope of reversing its current dip in oil production which stands at a little above one million barrels per day (bpd) on Mknday received a boost as TotalEnergies announced that production has started at its 50,000bpd Ikike oil field.\nAt peak production, the company said the facility would deliver 50,000bpd of oil equivalent by the end of 2022.\nTotalEnergies said the Ikike project leveraged existing facilities to keep costs low, and was designed to minimise greenhouse emissions, estimated at less than 4kg COze/boe.\nThe international oil company (IOC) added that the facilities would contribute to reducing the average carbon intensity of TotalEnergies’ upstream portfolio.\n“TotalEnergies is pleased to start production at Ikike, which was launched a few months before the Covid pandemic, and whose success owes a lot to the full mobilisation of the teams."
  }
]