[
  {
    "headline": "PANDEF summons N’Delta govs, others to emergency meeting on derivation",
    "summarized_story": "The Pan Niger Delta Forum has convoked an emergency “general assembly” for Monday over a bill in the House of Representatives seeking to amend the Constitution to remove the 13 per cent oil derivation formula being enjoyed by oil-producing states, especially in the South-South geopolitical zone.\nThe bill has generated protests especially from the Niger Delta.\nOur correspondent observed that the bill currently awaiting second reading was sponsored by 59 members of the House from across the states in the North, including the leader of the Northern Caucus, Musa Sarkin-Adar.\nThe proposal seeks to delete Section 162(2) of the 1999 Constitution, which has to do with the management of the Federation Account.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Everything is the opposite yet Nigeria not a complete disaster – Soyinka",
    "summarized_story": "Nobel laureate, Prof Wole Soyinka, has said Nigerians are still managing to eke out a living despite the bleak realities confronting the country.\nSoyinka spoke during an interview with the Cable News Network monitored by our correspondent.\nWhat have they experienced in Nigeria that they make such an attribution?’ That title really has been waiting to answer that claim in many ways.\nWhen you look at the surroundings, everything is the opposite and yet, Nigeria is not a complete disaster.\nHe stated, “I never really totally turned my back on the United States."
  },
  {
    "headline": "Secondus moves to stop PDP convention, writes party leaders",
    "summarized_story": "The national convention of the Peoples Democratic Party slated for October 30 and 31, 2021 may not go as planned as its court-suspended National Chairman, Prince Uche Secondus, has threatened to halt the convention.\nThe letter was addressed to the PDP acting National Chairman, Yemi Akinwonmi; the Chairman, PDP National Convention Committee, Governor Ahmadu Fintiri of Adamawa State; PDP National Organising Secretary, Austin Akobund; PDP National Legal Adviser, Emmanuel Enoidem; and the party’s National Secretary, Senator Ibrahim Tsauri.\nSupport for Oyinlola and Oladipo had divided Osun PDP between the Senator Ademola Adeleke/Sunday Bisi faction and Akin Ogunbiyi/Soji Adagunodo group.\n“If that should happen, and Oyinlola has been elected Deputy National Chairman, he will automatically step in and become the party’s national chairman.\n“Makinde’s camp feels Oyinlola may be too powerful for any governor to control as the PDP National Chairman."
  },
  {
    "headline": "EndSARS memorial: LNSA sanctions officers over assault on protesters",
    "summarized_story": "By Olasunkanmi AkoniThe Management of the Lagos State Neighbourhood Safety Agency, LNSA, has sanctioned all the officers involved in the unlawful treatment of Mr Adedotun Clement (the Uber Driver) during the Wednesday EndSARS first anniversary protest whose video went viral on social.media.\nFollowing the panel seating that lasted over four hours the officers were found guilty of the charges preferred against them.\n“Consequently, the two officers directly involved in the assault were publicly de-kitted and suspended from the agency for the next two Months.\nThey are also to be redeployed to another command of the Agency for behavioural evaluation and further reprimand,” he said.\nOyekan, restated the commitment of the Lagos State Government to the security of lives and properties of the people of Lagos State."
  },
  {
    "headline": "Kogi community begs govt to rehabilitate township roads",
    "summarized_story": "By Boluwaji Obahopo – LokojaThe people of Iyara community, headquarters of Ijumu council area of Kogi State have called on the state government to carry out an urgent rehabilitation of Iyara township roads.\nThe traditional ruler of the community, the Eleta Oluyara of Iyara, Oba Michael Olorundare who made the appeal on behalf of the community at the Iyara day said the township roads are gradually turning to death traps.\nOba Olorundare said it was appallingly disheartening that the ancient town which is the headquarters of a council area can neither boast of any social amenities nor motorable roads.\nHe urged the Kogi state road maintenance agency to immediately fix the dilapidated township roads to ease movement in the town.\nThe national president of Iyara development Association (IDA), Aliyu Badaki said the celebration of Iyara day was meant to showcase the diverse rich cultural heritage, tourist sites and traditional festivals to the outside world."
  },
  {
    "headline": "Quest for peace, unity of Nigeria is Buhari’s driving force – Adesina",
    "summarized_story": "By Johnbosco AgbakwuruSpecial Adviser to the President on Media and Publicity, Chief Femi Adesina, Friday said that the quest to keep Nigeria peaceful and united has been the driving force to most of his actions.\n“What Mr. President wants is peace, unity and whatever it takes for Nigeria to have peace, she will have it.\nI remembered I did a piece recently where I said for Nigeria, it is ‘Peace Dole’ (Peace by Force).\n“The idea of this movement, Ambassadors of Voice for Change, is very good.\nThe spokesperson of the group, Zack Orji expressed their readiness to collaborate with the security agencies and Nigerians to ensure that there is peace and unity in the country."
  },
  {
    "headline": "Soldiers engage gunmen in shootout in Ekiti State, rescue 6 abductees",
    "summarized_story": "Gunmen suspected to be kidnappers engaged solders in a shootout in two different locations in Ayebode and Ilasa communities in Ikole Local Government Area of Ekiti State on Thursday.\nAbutu stated that the combined forces of the military and the police rescued six other captives from the gunmen.\nThe shootout between the soldiers and gunmen was said to have forced motorists to quickly take detours to prevent being hit by bullets.\n“It was sporadic shootings for some minutes as the soldiers engaged the kidnappers.\n“The soldiers acted gallantly, but the kidnappers escaped into the bush through a secondary school in Ilasa."
  },
  {
    "headline": "Mercy Johnson’s Daughter Bully Saga: Lady apologises, alleges death threats",
    "summarized_story": "Mercy JohnsonThe Instagram user,@thenancychidera, who posted a narrative that countered Mercy Johnson-Okojie’s claim that a teacher was bullying her daughter, Purity, has apologised.\nMercy Johnson had given a long narrative of her daughter’s experience in the hands of a teacher.\nThen @thenancychidera came up with a narrative that totally negates what Mercy Johnson claimed.\nReacting, the actress went back to the school and made a live broadcast of the head teacher and other staff members denying what @thenancychudera wrote.\nHowever, the lady, @thenancychidera, has posted another video where she apologised profusely to the star actress and every other person offended by her post."
  },
  {
    "headline": "EFCC arraigns Cecilia Osipitan for N6bn PHCN insurance benefit fraud",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arraigned the Managing Director of PJO Ventures Limited, Cecilia Osipitan.\nShe is being tried along with PJO and Insurance Resourcery and Consultancy Services Limited before Justice U. P. Kekemeke of the Federal Capital Territory High Court in Maitama, Abuja.\nOsipitan faces a nine-count charge bordering criminal breach of trust, conspiracy and conversion of public funds to the tune of N6billion.\nEFCC said the money was meant for the payment of outstanding insurance premiums and claims of deceased and incapacitated staff of the defunct Power Holding Company of Nigeria (PHCN).\nThe sureties must be federal civil servant, a religious leader or a member of the National Assembly residing and own landed properties in Abuja."
  },
  {
    "headline": "Buratai Highlights factors fueling insecurity in Nigeria, suggests ways out",
    "summarized_story": "Former Chief of Army Staff, LT Tukur Buratai, has highlighted factors fueling insecurity and suggested ways out.\nBuratai stressed that low human development presents a rich breeding ground for poor nationals who become prone to acts that cause insecurity.\n“The quest for security must go with development,” Buratai said, adding that terrorism thrives in the Northeast particularly because it is the poorest region of the country.\nHe said even as the country engages the Boko Haram terrorists militarily, it must address the factors, including low human development, that feed insecurity.\nFaulting the tendency for Nigerians to see the Boko Haram war as a fight between the insurgents and the military, Buratai said it is not a Boko Haram versus military war but Boko Haram versus Nigeria."
  },
  {
    "headline": "Abuja-Kaduna train to resume on Saturday – Amaechi",
    "summarized_story": "The Minister of Transportation, Rotimi Amaechi, has announced that the Abuja-Kaduna train service will resume operations on Saturday, October 23.\nAmaechi said this while inspecting the damage on the tracks on Friday.\nRecall that the train service was suspended on October 21 following an attack by gunmen on the train from Abuja to Kaduna on Wednesday, October 20.\n“They moved in today and finished today and by tomorrow, we expect that the first train will run,” Amaechi said.\nAmaechi disclosed that the government is working with security agencies already working to apprehend the bandits."
  },
  {
    "headline": "Benue Govt appeals to IGP, DSS to rescue missing Vanguard reporter, 3 kidnapped students",
    "summarized_story": "The Benue State Government has appealed to the Inspector General of Police, IGP, Usman Alkali Baba and the Department of State Services, DSS to take steps in ensuring the missing journalist, reporting for Vanguard newspaper, Mr. Tordue Henry Salem and three students of the state who were kidnapped in Zamfara state recently.\nDAILY POST reports that the journalist who is an indigene of Benue State was declared missing last after his whereabouts could not be ascertained.\nThe state government made the appeal on Friday in a statement issued by the state’s Supervising Commissioner of Information, Culture and Tourism, Chief Ogbu Dennis Ekpe.\nAccording to the statement, the state government expressed worry over the fate of the journalist and the kidnapped students identified as Kondo Immaculate Sedoo, Terlumun Yiye and Miss Jennifer Iorliam Awashima.\n“The Benue State Government maintains that it is committed to the safety of all her indigenes at home and in the diaspora and will not rest on its oars until Salem and the young students are rescued from the hands of their abductors”."
  },
  {
    "headline": "‘Who is now financing who’ – Sunday Igboho fires back at FG over sponsor allegations",
    "summarized_story": "Reacting to the claim, Ighoho, in a statement by his counsel, Chief Yomi Aliu said he is a businessman and not a terrorist.\nHe also challenged Malami to mention the particular lawmaker he claimed to be his major financer.\nThe statement reads in part, “The picture the AGF wanted to paint is that our client is being financed by Abdullah Umar, allegedly involved in terrorist financing.\n“Again, Chief Adeyemo is a car dealer trading in the name of Adesun International Concept Ltd.\nDoes it mean that anybody buying a car from him or selling a car to him is a terrorist?"
  },
  {
    "headline": "Govt links Igboho to Boko Haram sponsor; Kanu to #EndSARS protests",
    "summarized_story": "He said: “The Federal Government has received the report on financiers of Adeniyi Sunday Adeyemo a.k.a Sunday Igboho.\n“The report revealed that Sunday Igboho is a director and signatory to Adesun International Concept Limited, registered on 23rd April, 2010.\nMalami claimed that Kanu took advantage of the 2020 EndSARS protest to destroy property and killed individuals, particularly security personnel.\n“Despite the proscription of IPOB by the Federal Government, Nnamdi Kanu continued the subversive campaign, instigating and inciting broadcasts to direct members of the IPOB to launch attacks on government.\n“The EndSARS protests of October 2020 played into the sinister plans of Nnamdi Kanu, whereby he seized the protests through subversive and inciting online broadcasts and actively commanded and directed attacks on security personnel and facilities."
  },
  {
    "headline": "Police burst syndicate behind local firearms production in Cross River",
    "summarized_story": "Cross River State Police Command has smashed a syndicate that specializes in the local production of automatic rifles including AK47.\nThe Police on Friday paraded a 32-year old man suspect and member of the syndicate, Fobi Kingsley Mbaku for allegedly helping to convey firearms and bullets in bags within Nigeria and to Cameroon from the Cross River State axis.\nThe state Commissioner of Police in Cross River State, CP Aminu Alhassan said the suspected gun runner was arrested along Ranch Road, Obanliku LGA of the state.\nAminu there is a hideout for locally fabricated automatic rifles, and that the suspect is a member of the gun-running syndicate which operates within Obanliku and its environs.\nBut I must say that I really did not know the contents of the bags I usually carry across the border."
  },
  {
    "headline": "Lokpobiri faction kicks as Sylva accepts outcome of Bayelsa congress",
    "summarized_story": "The internal crisis rocking the Bayelsa State chapter of the All Progressives Congress (APC), is far from being resolved.\nA faction of the party loyal to former Minister of Agriculture and Rural Development, Senator Heineken Lokpobiri, has rejected the outcome of last Saturday’s Congress that produced Dennis Otiotio, a lawyer as Chairman.\nThe faction called on the Appeal Committee of the APC to cancel the outcome of the exercise in the state.\nBut the Minister of State for Petroleum Resources and Leader of the party in Bayelsa state, Chief Timipre Sylva, accepted the outcome of the exercise.\nHe said: “Since the ward and local government congresses in Bayelsa were purportedly conducted on void footing, there is, therefore, no delegate anywhere in APC Bayelsa State to anticipate the conduct of the failed state congress of 16th October 2021."
  },
  {
    "headline": "Two dead, others injured in Rivers auto crash",
    "summarized_story": "Two people have been killed and many others injured in a motor accident in Rivers State.\nA source accused the police at Rumuji Divisional Headquarters of causing the accident saying they blocked one lane of the road, forcing commuters to ply one way.\n“I think this thing has to do with the blockage of the road by the police, permanently blocked for a long time.\n“Rumuji police station is not the only police station that was attacked during the era of crisis that blocked this road.\nTwo buses collided this morning because one wanted to overtake because they are using one way instead of the double lane."
  },
  {
    "headline": "Pipeline explosion claims 27 in Rivers state",
    "summarized_story": "From TONY JOHN, Port HarcourtScores of youths have reportedly lost their lives in a petrol pipeline explosion which occurred in Rumuekpe community in Emohua Local Government Area of Rivers State.\nA community, who gave his name as Chikwem Godwin, told journalists that the area was notorious for oil bunkering activities.\nHe added that the incident occurred when those involved in the criminal activities attempted to cut one of the petroleum pipelines.\nThe particular place where this incident occurred is very notorious for bunkering activities.\n“The place is the centre of oil bunkering activities."
  },
  {
    "headline": "Nnamdi Kanu pleads not guilty, says Nigerian court can’t try him",
    "summarized_story": "Kanu stated this through his counsel, Ifeanyi Ejiofor, shortly after he was re-arraigned on the amended charge before Justice Binta Nyako of the Abuja division of the Federal High Court, yesterday.\nKanu, in the preliminary objections filed by counsel said: “I also know as a fact that jurisdiction is extrinsic to adjudication.\n“That counts 1, 2 and 3 of the amended charge were brought under a non-existent law.\nThat counts 5, 6 and 7 of the amended charge do not disclose an offence known to law.\nThat there is no proof of evidence attached to the amended charge filed against the defendant."
  },
  {
    "headline": "Buhari to security chiefs: Nothing must stop Anambra election",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has given marching orders to the nation’s security chiefs that nothing must be allowed to temper with the November 6th gubernatorial election in Anambra State.\nThis is as the National Security Adviser, General Babagana Monguno (retd) disclosed that the new leader of the Islamic State of West African Province, ISWAP, Mallam Bako was killed two days ago by the military.\nMonguno, who briefed on the outcome of the meeting of security chiefs, said President Buhari gave the armed forces the marching order in response to the heightened security challenges in Anambra state.\n“The President has directed that under no circumstances will anything be allowed to stop the elections from taking place successfully.\n“Two days ago, the man who succeeded him, one Malam Bako, one of the prominent leaders of the Shura Council of the Islamic State of West African Province, was also taken out."
  },
  {
    "headline": "INEC hails NASS over election technology",
    "summarized_story": "From Romanus Ugwu, AbujaThe Independent National Electoral Commission (INEC) has lauded the National Assembly for empowering the agency to determine and deploy appropriate technology in future elections.\nThe commission appreciates the decision of the National Assembly to empower INEC to determine and deploy appropriate technology in future elections.\nFor us in INEC, this is one of the progressive decisions by our National Assembly.\n“The Electoral Act is one of the most important laws in any democracy.\nIn all jurisdictions, the Electoral Act provides more detailed provisions to govern the conduct of elections and the electoral process."
  },
  {
    "headline": "Rivers mulls criminal proceedings against Saipem",
    "summarized_story": "Rivers State Government is to initiate criminal proceeding against Saipem Contracting Nigeria Limited for breach of trust, which led to abandonment of the state’s gas turbine generator unit and accessories in The Netherlands since 2012.\nThe decision to file criminal proceeding was taken at the 15th Executive Council meeting presided over by Governor Nyesom Ezenwo Wike at the Government House, Port Harcourt, yesterday.\n“Consequently, the council unanimously directed the Attorney General of Rivers State to file criminal proceeding against Saipem Contracting Nigeria Limited for her role in this ugly incident.”The Council also approved the reconstruction of two roads, Oyigbo-Okoloma and Chokocho-Igbodo totaling 46.5km.\nCommissioner for Finance, Isaac Kamalu, said the council also approved medium term expenditure framework 2022-2024.\nSpecial Adviser to the Governor on Special Projects, Alabo George-Kelly said the council approved the award of contract for the construction the Rivers State Magistrate Court Complex at the cost of N8.1 billion."
  },
  {
    "headline": "For the Record: Full Text of AGF’s Statement on Outcome of Kanu, Igboho Investigation",
    "summarized_story": "As you are aware Nnamdi Kanu, the self-acclaimed leader of Indigenous People of Biafra (IPOB), has been at the center of a subversive campaign against the Nigerian State.\nConsequently, Nnamdi Kanu was arrested on 14th October, 2015.\nThe destructive activities of IPOB/ESN pose serious threat to Nigeria’s National Security and its corporate existence, which resulted into re-arrest of Nnamdi Kanu and members of his group.\nThe eventual re-arrest of Nnamdi Kanu in June 2021, and some members of his group led to the inauguration of a Presidential Ad-hoc Committee, comprising twenty-four (24) members drawn from:1.\nWe call on these countries to desist from aiding subversive acts by KANU and IPOB against the state of Nigeria and its people."
  },
  {
    "headline": "FG’s Report Unmasks Igboho’s Sponsors, Accuses Kanu of Instigating Killings",
    "summarized_story": "Malami noted that in the process, 396 firearms and 17,738 ammunition were carted away by Nnamdi Kanu led IPOB and ESN.\n“Some of the state actors aided Kanu, even as a fugitive, in his destructive mission, ignoring the terrorist nature of his activities.\n“We call on these countries to desist from aiding subversive acts by Kanu and IPOB against the state of Nigeria and its people.\nHe added that N273,198,200.00 transaction outflows was recorded from Sunday Igboho’s account between March 15, 2013 and March 11, 2021.\n“The report found connections of financial transaction between Adesun International Concept Ltd (belonging to Igboho) and some construction companies and businesses among others."
  },
  {
    "headline": "Halt Planned Convention Pending A’Court’s Judgment, Secondus’ Lawyer Writes PDP",
    "summarized_story": "Oyetiba is lawyer to the suspended National Chairman of the PDP, Chief Uche Secondus.\nSecondus was on September 10, 2021, restrained from performing the functions of the office of the National Chairman of the PDP by a High Court of Rivers State.\nThe restraining order was contained in a ruling in an application in suit number: PHC/2183/CD/2021 brought against Secondus by one Mr lbeawuchi Alex and four others.\nOyetiba argued that since the application being served on the respondents in the appeal, it behoves the PDP to halt the convention in deference to the Court of Appeal.\n“Notwithstanding the service of the application for injunction, it has come to the notice of our client that the PDP and its officers continue to prepare to hold the National Convention on 30 and 3 I October 2021,” he said."
  },
  {
    "headline": "Buhari: Under No Circumstances Will Anambra Election Be Disrupted",
    "summarized_story": "“The president has made it very clear that the armed forces, security agencies, and law enforcement agencies must make sure that the elections take place.\nIf it means overwhelming the entire environment with the presence of security agencies.\n“There are so many implications for elections to be sabotaged by non-state actors.\n“The mere thought that a group of non-state actors want to portray his government as not being able to be firm is totally out of the question,” he said.\nOf course, the armed forces and security agencies have done so much in the last couple of months."
  },
  {
    "headline": "Yakubu Nudges Lawmakers to Speedily Amend Electoral Act, Warns Time Critical",
    "summarized_story": "This is just as the Commission, yesterday, released the notice of the governorship election in Anambra State slated for November 6.\nWhile highlighting the fundamental role of the Electoral Act in the conduct of the election, Yakubu said the Act was one of the most important laws in any democracy.\nHe stated that one of the unique aspects of the current amendment of the Electoral Act was that it started well ahead of the forthcoming general elections, unlike previous exercises which came too close to elections.\nFirst is the constitution, followed by the Electoral Act.\nIn all jurisdictions, the Electoral Act provides more detailed provisions to govern the conduct of elections and the electoral process."
  },
  {
    "headline": "REVEALED: Buhari-led Government Sponsored Thugs Who Attacked Activist, Sowore Caught With Bomb",
    "summarized_story": "Hoodlums suspected to be sponsored by the Nigerian government on Thursday attacked human rights activist, Omoyele Sowore despite the heavy presence of security operatives around the Federal High Court, Abuja.\nSowore was denied access into the court by the security operatives.\nBut as he was still talking to the security men, some boys numbering about 20, it was observed, arrived.\nThe hoodlums then approached the activist and attacked him.\nAnother eyewitness said one of the assailants had a petrol bomb, adding that the policemen present there also saw it."
  },
  {
    "headline": "REVEALED: Buhari-led Government Sponsored Thugs Who Attacked Activist, Sowore Caught With Bomb",
    "summarized_story": "Hoodlums suspected to be sponsored by the Nigerian government on Thursday attacked human rights activist, Omoyele Sowore despite the heavy presence of security operatives around the Federal High Court, Abuja.\nSowore was denied access into the court by the security operatives.\nBut as he was still talking to the security men, some boys numbering about 20, it was observed, arrived.\nThe hoodlums then approached the activist and attacked him.\nAnother eyewitness said one of the assailants had a petrol bomb, adding that the policemen present there also saw it."
  },
  {
    "headline": "Governing Council Chairman Of Bauchi College, Doguwa Dissolves Academic Board For Dismissing Cheating Daughter From School",
    "summarized_story": "A document dated March 24, 2021, showed that the Council resolved to dissolve the academic board of the college.\nThe management of the college also issued punitive queries to five of the directors on the dissolved academic board.\nAll these laws were assaulted and ignored as evident in the case of Amina, the daughter of the Chairman of the Governing Council of the school.\nOne of the petitions dated June 2021 alleged that the Chairman of the Governing Council of the College is not a health professional.\nChairman Governing Council Interrupts Phone Interview, Ignores Text Message SentThe Chairman of the Governing Council also declined to comment on the role of the council in the erosion of academic excellence in the school."
  },
  {
    "headline": "Governing Council Chairman Of Bauchi College, Doguwa Dissolves Academic Board For Dismissing Cheating Daughter From School",
    "summarized_story": "A document dated March 24, 2021, showed that the Council resolved to dissolve the academic board of the college.\nThe management of the college also issued punitive queries to five of the directors on the dissolved academic board.\nAll these laws were assaulted and ignored as evident in the case of Amina, the daughter of the Chairman of the Governing Council of the school.\nOne of the petitions dated June 2021 alleged that the Chairman of the Governing Council of the College is not a health professional.\nChairman Governing Council Interrupts Phone Interview, Ignores Text Message SentThe Chairman of the Governing Council also declined to comment on the role of the council in the erosion of academic excellence in the school."
  },
  {
    "headline": "Nnamdi Kanu: A Trial Militarised By Ozodinukwe Okenwa",
    "summarized_story": "When he was first brought before Justice Nyako some months ago following his audacious abduction in Nairobi, Kenya, and subsequent rendition to Nigeria he looked haggard and emaciated.\nSo, it boggles the mind how and why the security forces should be acting as if a notorious criminal is being docked.\nJustice Binta Nyako must exercise her constitutional powers by ruling against the militarization of the Kanu trial.\nThe crude and rude manner the security forces harassed citizens and prevented interested parties from gaining access into the courtroom is condemnable.\nMilitarizing Kanu's trial sent a strong negative message across the world reinforcing the belief in Biafraland that Kanu is indeed fighting a just cause."
  },
  {
    "headline": "Chinedu Asadu wins environmental reporting prize at West Africa media awards",
    "summarized_story": "Chinedu Asadu has won the environmental reporting prize at the 2021 West Africa Media Excellence Conference Award (WAMECA).\nAdvertisementHis undercover investigation, which exposed how Chinese miners endangered residents of the federal capital territory (FCT), was adjudged the best in environmental reporting.\nAfter the investigation was published, the National Environmental Standards and Regulations Enforcement Agency (NESREA) sealed off the premises of the company.\nSamad Uthman of Dataphyte won the health reporting prize while Chikodi Okereocha of The Nation won the COVID-19 reporting prize, Caleb Ojewale of Business Day won the anti-corruption reporting prize and Alfred Olufemi of Premium Times was named best in business reporting.\nUthman and Kwetey Nartey of Ghana were joint winners of the overall best West African journalist of the year award."
  },
  {
    "headline": "Chinedu Asadu wins environmental reporting prize at West Africa media awards",
    "summarized_story": "Chinedu Asadu has won the environmental reporting prize at the 2021 West Africa Media Excellence Conference Award (WAMECA).\nAdvertisementHis undercover investigation, which exposed how Chinese miners endangered residents of the federal capital territory (FCT), was adjudged the best in environmental reporting.\nAfter the investigation was published, the National Environmental Standards and Regulations Enforcement Agency (NESREA) sealed off the premises of the company.\nSamad Uthman of Dataphyte won the health reporting prize while Chikodi Okereocha of The Nation won the COVID-19 reporting prize, Caleb Ojewale of Business Day won the anti-corruption reporting prize and Alfred Olufemi of Premium Times was named best in business reporting.\nUthman and Kwetey Nartey of Ghana were joint winners of the overall best West African journalist of the year award."
  },
  {
    "headline": "Train attack: Abuja-Kaduna rail operations to resume Saturday",
    "summarized_story": "Rotimi Amaechi, minister of transportation, has directed the Abuja-Kaduna train service (AKTS) to resume operations on Saturday.\nAdvertisementAmaechi gave the directive on Friday, after inspecting repairs on the rail tracks between Rijana and Dutse along the Abuja-Kaduna route.\nThe development comes after two reported attacks on rail tracks along the Abuja-Kaduna route.\n”The essence of the digital security system is to enable us know when there is an impact on the rail.\nAdvertisement”We will get the police to be involved so that they will be here before we install the security system.”"
  },
  {
    "headline": "Train attack: Abuja-Kaduna rail operations to resume Saturday",
    "summarized_story": "Rotimi Amaechi, minister of transportation, has directed the Abuja-Kaduna train service (AKTS) to resume operations on Saturday.\nAdvertisementAmaechi gave the directive on Friday, after inspecting repairs on the rail tracks between Rijana and Dutse along the Abuja-Kaduna route.\nThe development comes after two reported attacks on rail tracks along the Abuja-Kaduna route.\n”The essence of the digital security system is to enable us know when there is an impact on the rail.\nAdvertisement”We will get the police to be involved so that they will be here before we install the security system.”"
  },
  {
    "headline": "'Case still in court' -- Secondus asks PDP to suspend national convention",
    "summarized_story": "Uche Secondus, suspended chairman of the Peoples Democratic Party (PDP), has asked the party to stop the preparation for its national convention, pending the hearing of his case in the court of appeal.\nAdvertisementTheCable had reported how multiple court orders were issued against Secondus resulting in his removal from office, and Yemi Akinwonmi, deputy national chairman (south), was appointed in his stead.\nAdvertisement“On 23 August, 2021 one Mr Ibeawuchi E. Alex and four others jointly instituted Suit No PHC/2183/CS/2021 at the high court of Rivers state, Port Harcourt judicial division against Prince Uche Secondus and the PDP as defendants.\n“On 10 September, 2021, the high court of Rivers state delivered its judgment in the suit whereby Prince Uche Secondus was, inter alia, restrained from performing the functions of the office of national chairman of the PDP.\nAdvertisement“In addition, an application on notice has been filed in which Prince Uche Secondus is seeking, inter alia, the following orders."
  },
  {
    "headline": "Baxi acquisition deal sees MFS Africa expand footprint into Nigeria",
    "summarized_story": "As the largest fintech interoperability hub in Africa, MFS Africa connects banks, telcos, and money transfer operators across over 35 countries via a single integration point.\nCapricorn will be called MFS Africa but its core product, Baxi, retains its name.\nMFS Africa was founded in 2009 by Dare Okoudjou, a Beninese national, while Nigeria-born Abudu started Capricorn in 2014, with Folu Majekodunmi.\nThe acquisition creates a larger, more versatile company that fuses interoperability between money operators and a super-agent network reaching the mass market.\nMFS Africa will also expand Baxi’s proposition for offline SMEs to select markets within its footprint."
  },
  {
    "headline": "Editi Effiong: father, writer, producer and tech bro",
    "summarized_story": "When asked how he would define himself, he responded with, “I’m a father, writer, producer, and tech bro.\nThe big picture: Editi Effiong is not your average guyMany people know Editi Effiong as the brains behind Anakle.\nAnakle Films’ theatrical releases, Up North and The Setup, were acquired by Netflix in 2019 and 2020 respectively.\nIn 2011, digital marketing didn’t have as much clout as it does now.\nEspecially knowing that you were going to put a lot of time and effort into building out Anakle Films’ brand?"
  },
  {
    "headline": "Who’s afraid of crypto-salaries?",
    "summarized_story": "Back in 2015, its current president, Muhammadu Buhari, campaigned on a promise to increase the value of the naira.\nThis plunge in the value of the naira has been majorly fueled by Nigeria importing more goods than it exports.\nWith 96% of the crypto value coming from outside the continent, this suggests that more Africans are receiving remittances via crypto.\nThis is the company battling the challenge that comes with paying employees in crypto, as legal barriers in many countries prevent this.\nSome of the barriers include the non-recognition of cryptocurrency as a legal tender and the challenge of calculating taxes when employees are paid in cryptocurrency."
  },
  {
    "headline": "I promise it’s funnier in Swahili…Kenyan Comedian Eddie Butita is Showing Netflix How Swahili’s Done",
    "summarized_story": "To roll out this project, the $25 billion company enlisted the help of celebrated Kenyan comic, Eddie Butita.\nButita is skilled at wielding digital technology in a market that’s grown so big that Netflix can’t ignore it.\nAccording to the Worldwide Mobile Data Pricing (2021) report from Cable, a British technology research firm, Kenya takes the lead as the most expensive country for mobile data in East Africa.\nViewing one hour of Netflix content on low resolution (480p) uses 300 MB of data per hour; in high resolution (1080p), Netflix uses 3 GB per hour.\nAt an average cost of $1.05 per GB of data, Netflix viewers in Kenya stand to pay anywhere from $0.32 to $3.15 to watch a one-hour show."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Technology is awesome, but it’s yet to conquer stuttering",
    "summarized_story": "Stuttering in a tech-enabled worldOne can be forgiven for thinking that there is a tech solution somewhere that does away with stuttering.\nStuttering has no known cure, and the best technology can currently do is what therapy does — treat or manage the condition like other speech defects.\nPeople can get the most out of treatment if they address stuttering early enough — preferably as children.\nNumbers don’t lieAccording to The Stuttering Foundation, stuttering affects 1% of the world’s population; depending on what global population you accept, that’s 78 or 79 million people.\n“Stuttering has shaped my personality; I’m reserved, and I don’t say anything around strangers unless it’s necessary because I don’t like being asked to repeat myself."
  },
  {
    "headline": "Techpoint Awards, AltSchool by TalentQL, Privacy Roundtable PT2, Brass’ $1.7m funding",
    "summarized_story": "This lack of degree options and the scarcity of developers is what TalentQL is looking to solve with AltSchool.\nThere’s more: TalentQL launches AltSchool Africa to train entry level tech talent for freeSo you care about your privacy?\nOn Thursday, October 21, 2021, Brass, a Nigerian digital bank, announced $1.7 million in funding to aid their growth across Africa.\nCurrently, the platform provides SMEs with various services, including payroll and expense management, credit and payment services, and API support.\nThey claim to have disbursed $2 million in credit via their crediting platform, Brass Capital, which is still in the Beta phase."
  },
  {
    "headline": "What does the African fintech need?",
    "summarized_story": "The virtual event focused on fintech’s allure to investors, the benefits Africans derive from fintech start-ups, partnerships between banks and fintech startups, and the role of regulators in the industry.\nHowever, Agboola disagreed with that view, arguing that he sees a situation where fintech complement the works that banks do and vice versa, advocating for partnerships between banks and fintech.\nDeepening financial inclusion is high on the agenda of Nigeria’s Central Bank and Y’ello Digital Financial Services has been playing its part in helping the apex realize this goal.\nWith its wide network of over 150,000 MoMo agents, the organization offers financial services to customers.\nWith 54 countries in Africa, providing financial services to users comes with lots of regulatory hurdles in each country."
  },
  {
    "headline": "CBN says banks remain stable, resilient despite pandemic",
    "summarized_story": "The Central Bank of Nigeria (CBN) says banks in the country have remained stable, robust, and resilient in spite of the COVID-19 pandemic.\nHaruna Mustafa, the director, Banking Supervision of CBN, said this at the 2021 Financial Correspondents Association of Nigeria (FICAN) workshop in Ibadan on Friday.\nMustapha, represented by Adekunle Adeniji, the assistant director, Banking Supervision, CBN, said the Capital Adequacy Ratio (CAR) rose to 15.21 percent as of August, Liquidity Ratio (LR) rose to 42.23 percent.\nThe director said CBN would continue to develop additional countercyclical policy options that could be utilised in periods of stress.\n“We will continuously update and assess our prudential rule books and policy to strengthen responses to economic and financial shocks."
  },
  {
    "headline": "Guyana strategy: What Nigeria can do with private capital",
    "summarized_story": "Guyana, a tiny South American country, is attracting fresh private capital on oil and gas assets to develop critical infrastructure across its local economy, whereas Africa’s biggest oil producer is struggling to attract private capital to build its energy sector.\nTo avoid the ‘oil curse,’ Guyana is looking beyond the oil export revenues from the Exxon-operated projects off its shores.\nThe country is attracting private capital to large oil and gas discoveries to build up an economy powered by its own energy resources.\nUnlike Guyana, Nigeria remains “Exhibit A” of the so-called resource curse, particularly when you split its oil production across the population.\nNiyi Awodeyi, CEO at Subterra Energy Resources Limited, says Nigeria’s oil production per head has been in a miserable state in the last 10 years."
  },
  {
    "headline": "Nigeria needs change of trade approach to create wealth",
    "summarized_story": "“If we got 10 companies in Nigeria and asked them to produce for the international community, it would translate to higher foreign exchange earnings for Nigeria and create more wealth locally,” Okiti said.\nPresident Muhammadu Buhari is keen to grow the economy and create wealth for the vast majority of Nigerians through agriculture after many years of oil dependence.\nNo country in recent decades has achieved economic success, in terms of substantial increases in living standards for its people, without being open to the rest of the world,” the IMF said.\nNigeria needs to boost economic growth and improve living standards now more than ever.\nThe first contraction was caused by a sharp decline in oil prices, while the second was induced by the COVID-19 pandemic which yet again caused a sharp dip in oil prices."
  },
  {
    "headline": "#EndSARS: Obaseki meets Edo youths, to pay N190m compensation to victims of police brutality – Nigerian Observer",
    "summarized_story": "Obaseki gave the assurance during a meeting with the youths at the Government House in Benin City.\nHe said, “I set up a panel to investigate cases of police brutality against the people.\nThe panel recommended compensation to be paid to victims totaling N190 million, while the amount of judgment sum recommended being enforced was N98 million.\nReassuring that his administration will do all within its power to implement the 15 recommendations of the panel, Obaseki said Edo youths are the greatest resources of the state.\nA representative of the youths, Solomon Idiogbe, commended Obaseki for improved security across the state, urging him to engage more youths as a means of checking cultism in Edo State."
  },
  {
    "headline": "Obaseki charges judiciary on speedy conviction of sexual, gender-based violence offenders – Nigerian Observer",
    "summarized_story": "Obaseki gave the charge at a one-day sensitization and capacity building workshop on Gender-Based Violence (GBV) for High Court Judges and judicial officers in Edo State, held in Benin City.\nIt is our collective responsibility to drive the desired changes that are required to ensure that we have a society that is free of violence, particularly gender-based violence.\n“We have launched a sexual offenders’ register which serves as a tool to shame all those persons who have been convicted in gender-based violence.\n“The governor has assured us of providing requisites; we need to build new courthouses and a special courthouse for gender-based violence, with special judges assigned to these courts.”In her welcome remarks, Ms.\nLamptey further applauded the state government’s commitment to ensuring access to justice for all, especially for women and girls in Edo."
  },
  {
    "headline": "LASG Reconstitutes Interim Caretaker Committe For ASPMDA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Lagos State Government has reconstituted the interim Caretaker Committee for the Auto Spare Parts & Machinery Dealers Association (ASPMDA) in compliance with the judgments of the High Court of Lagos State in Suit No.\nA statement issued by the Lagos State Attorney-General and Commissioner for Justice, Mr. Moyosore Onigbanjo, said that the decision is in compliance with the Court judgements.\nOnigbanjo noted that 15 months after constituting the Interim Caretaker Committee, chaired by Sir.\nSunday Igbanuzue, it has failed to conduct elections for new Executive Officers of ASPMDA.\nGovernor has directed the immediate dissolution of the Interim Caretaker Committee constituted by the State Government in June 2020 and chaired by Sir."
  },
  {
    "headline": "Flying officers cup:Edo Queens pip Confluence Queens ,face Robo in finals – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo Queens Football Club of Benin yesterday defeated the Confluence Queens of Lokoja by a lone goal in the semifinals stage of the Flying Officers Preseason Tournament and will engage FC Robo of Lagos in the last game of the tournament on Sunday.\nThe final match is scheduled for 3 PM on Sunday at the same FCT Sports Complex.\nEmem Essien’s late strike earned the Benin girls the important victory to once again vie for honour in the tournament they won two years ago in Abuja.\nEdo Queens on the road to the finals of the women football preseason tournament did not concede any goal and won all their games.\nThe two premier league clubs are not new to themselves as they met in the Betsy Obaseki Women Football Tournament held in Benin recently."
  },
  {
    "headline": "Alleged N1.4Billion Fraud: Court grants bail to ex-NSITF chair, Olejeme",
    "summarized_story": "The News of Nigeria (NAN) reports that the court adjourned the matter till November 8 for hearing.\nHer lawyer, Paul Erokoro, a Senior Advocate of Nigeria, subsequently notified the trial judge, Maryam Aliyu, of his client’s pending bail application.\nMr Erokoro pleaded with the court to grant her bail based on self-recognition or on liberal terms.\nEFCC’s prosecuting counsel, Steve Odiase, did not oppose the bail application, but urged the court to refuse the grant of bail on self-recognition as suggested by the defence counsel.\nIn addition, the judge, Ms Hassan, directed that the travel documents of the defendant be submitted at the court’s registry."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "ADF commends Igbo lawyers for solidarity with Nnamdi Kanu",
    "summarized_story": "OBINNA EZUGWUThe Alaigbo Development Foundation (ADF), has praised lawyers of Igbo extraction who volunteered to join the defence team of the leader of Indigenous People of Biafra(IPOB), Mazi Nnamdi Kanu at the commencement of his trial at the Abuja Federal High Court yesterday.\nADF which gave the commendation in a statement by its spokesman, Abia Onyike, said it believes that such show of solidarity was essential as the political trial of Kanu gathers momentum.\nHe is a freedom fighter like other genuine Igbo Patriots engaged in the Igbo liberation struggle.\n“The Federal Government should create a conducive atmosphere for dialogue with agitators for Self-determination instead of pursuing them like common criminals,” the group said.\n“The situation in Nigeria today shows clearly that there is an unstoppable longing for freedom by all Ethnic Nationalities which is a rejection of the forced federalism created by Lord Frederick Lugard in 1914."
  },
  {
    "headline": "PDP National Convention: Prof Wale Oladiipo clears air on disqualification",
    "summarized_story": "“When the final decision was made, l abided by it and stayed by the party which consequently made us deliver on our mandate.\nI am also a proud member of both the Convention Committee and the PDP e-registration Committee.\n(3) That l am also pleased to say that l have been delivering my constituencies constantly to the party.\nI have never decamped to any other party or sabotage the interests of the party in any form.\nIt is therefore funny that those who walked out of convention when we had a sitting President are cleared to contest."
  },
  {
    "headline": "Obokun East Chair, Bamidele hails Famoodun on his re-election as Osun APC Chairman",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe caretaker Chairman for Obokun East Local Council Development Area, LCDA, Ilare Ijesha, Osun state, Hon.\nBello Saliu Bamidele has congratulated the state chairman of All Progressives Congress, APC, Prince Gboyega Famoodun on his re-election as party chairman for another four years, saying his victory at the recently held state congress is well deserved.\nHe described the party chairman as a real democrat in whose heart the progress of the party is paramount.\n“I want to state clearly here that the leadership quality displayed by Prince Adegboyega Famodun made it possible for the delegates and the entire members of Osun State APC to re-elect him as the chairman of the party,” he said.\n“It is my greatest joy to join other Progressives family in congratulating our indefatigable Chairman, Prince Adegboyega Famodun for his re-election as Osun State party Chairman of APC All progressives Congress, your victory with large majority has filled me with immense joy."
  },
  {
    "headline": "OAU honours Oyetola with Awolowo free education award",
    "summarized_story": "By Sunday Oguntuyi OsogboOsun state Governor, Adegboyega Oyetola on Thursday, bagged the Awolowo free education award of the Obafemi Awolowo University (OAU), Ile-Ife.\n“We have substantially increased our budgetary allocation for education and we are working tirelessly to radically diversify our economy to achieve our goal of sustaining free education up to secondary school level and affordable at the tertiary level.\nGovernor Oyetola also commended the organisers of the award for instituting the Obafemi Awolowo Free Education Series to interrogate and advance tangential development issues in the nation and to keep the legacy of free education alive.\nReceiving Governor Oyetola and other awardees, Vice Chancellor, Obafemi Awolowo University, Ile-Ife, Prof. Eyitope Ogunbodede, lauded the Administration of Governor Oyetola for investing hugely in the education sector as manifested in the success the State had recorded so far.\nHe said: “This programme is aimed to honour our own, late Obafemi Awolowo whose passion and love for education cannot be quantified."
  },
  {
    "headline": "Repair Works On Abuja-Kaduna Rail Track Completed",
    "summarized_story": "Repair work has been completed on the destroyed rail track on the Abuja to Kaduna railway corridor, which was bombed after suspected terrorists planted explosive on it on Wednesday.\nThis is even as the minister of Transportation, Rotimi Amaechi, said normal work will likely commence on the rail corridor on Saturday.\nAccording to him, “what this has done is that it will fast-track the procument for security installation system for the rail lines.\nFidet Okhiria, who confirmed the attack, said the explosives damaged the rail tracks somewhere between Dutse and Rijana.\nAccording to him, “there was an explosive on our rail track somewhere around Rijana and Dutse last night, and this damaged the tracks."
  },
  {
    "headline": "Repair Works On Abuja-Kaduna Rail Track Completed",
    "summarized_story": "Repair work has been completed on the destroyed rail track on the Abuja to Kaduna railway corridor, which was bombed after suspected terrorists planted explosive on it on Wednesday.\nThis is even as the minister of Transportation, Rotimi Amaechi, said normal work will likely commence on the rail corridor on Saturday.\nAccording to him, “what this has done is that it will fast-track the procument for security installation system for the rail lines.\nFidet Okhiria, who confirmed the attack, said the explosives damaged the rail tracks somewhere between Dutse and Rijana.\nAccording to him, “there was an explosive on our rail track somewhere around Rijana and Dutse last night, and this damaged the tracks."
  },
  {
    "headline": "Akwa Ibom Govt Trains Tech Officers On Sound Engineering, Harmonisation",
    "summarized_story": "As part of efforts to strengthen the capacity of its workforce, the Akwa Ibom State government, through the Ministry of Information and Strategy, has trained Technical Officers in the ministry, on basic sound engineering, sound harmonisation and technical production.\nIn her remark, the Director of Technical Services and Dean, College of Directors in the Mnistry of Information and Strategy, Mrs.\nBlessing Urua, explained that the training was designed to update the knowledge of the officers in basic areas of technical services, in order to enhance their productivity and efficiency.\nADVERTISEMENTSpeaking on behalf of the participants, Mr. Uwemedimo Etim, appreciated the state government for the training, saying that the training has acquainted them with basic sound engineering concepts, public address system management, and other crucial aspects of technical inputs relevant to their duties.\nIniobong Asuquo for the knowledge transfer exercise, and for “a job well-done”, Uwemedimo, pledged to use the new skills acquired during the training to enhance his productivity."
  },
  {
    "headline": "Akwa Ibom Govt Trains Tech Officers On Sound Engineering, Harmonisation",
    "summarized_story": "As part of efforts to strengthen the capacity of its workforce, the Akwa Ibom State government, through the Ministry of Information and Strategy, has trained Technical Officers in the ministry, on basic sound engineering, sound harmonisation and technical production.\nIn her remark, the Director of Technical Services and Dean, College of Directors in the Mnistry of Information and Strategy, Mrs.\nBlessing Urua, explained that the training was designed to update the knowledge of the officers in basic areas of technical services, in order to enhance their productivity and efficiency.\nADVERTISEMENTSpeaking on behalf of the participants, Mr. Uwemedimo Etim, appreciated the state government for the training, saying that the training has acquainted them with basic sound engineering concepts, public address system management, and other crucial aspects of technical inputs relevant to their duties.\nIniobong Asuquo for the knowledge transfer exercise, and for “a job well-done”, Uwemedimo, pledged to use the new skills acquired during the training to enhance his productivity."
  },
  {
    "headline": "NAF Jets Bombard ISWAP Terrorists Converging For Meeting In 11 Boats",
    "summarized_story": "Three attack jets of the Nigerian Air Force (NAF) have bombarded scores of Islamic States of West Africa Province (ISWAP) terrorists, in the North-East region.\nAccording to PRNigeria, the bombardments by the jets were executed at an Island in Tumbun, near Lake Chad.\nA military source said following credible intelligence that the ISWAP fighters in about 11 boats were converging for a meeting at the Tumbun Island, the NAF aircraft, under Operation Hadin Kai, were scrambled to carry out strikes on the targets.\nADVERTISEMENT“The aircraft scored devastating hits on the meeting, leaving some survivors scrambling for their lives,” he said."
  },
  {
    "headline": "Reps panel threaten to arrest Polaris Bank MD Innocent Ike",
    "summarized_story": "Failure of the managing director of Polaris Bank Innocent Ike to appear before the House of Representatives ad-hoc committee investigating the status of all recovered loots, movable and immovable assets from 2002-2020 may result in the issuance of an arrest warrant.\nChairman of the committee Adejoro Adeogun said the accountant general of the federation, NNPC, Polaris, Unity, Sterling, Heritage, Keystone and Fidelity banks were invited to appear before the panel.\nIf your bank continues with this level of unseriousness, I will issue an arrest warrant against the MD,” Adeogun said.\nPolaris’ representative told the committee that the bank has tendered evidence of payment to the Central Bank of Nigeria.\nIt also summoned the accountant general of the federation, managing directors of Sterling, Unity, Sterling, Heritage, Keystone and Fidelity banks to appear in persons before it on October 27."
  },
  {
    "headline": "Reps panel threaten to arrest Polaris Bank MD Innocent Ike",
    "summarized_story": "Failure of the managing director of Polaris Bank Innocent Ike to appear before the House of Representatives ad-hoc committee investigating the status of all recovered loots, movable and immovable assets from 2002-2020 may result in the issuance of an arrest warrant.\nChairman of the committee Adejoro Adeogun said the accountant general of the federation, NNPC, Polaris, Unity, Sterling, Heritage, Keystone and Fidelity banks were invited to appear before the panel.\nIf your bank continues with this level of unseriousness, I will issue an arrest warrant against the MD,” Adeogun said.\nPolaris’ representative told the committee that the bank has tendered evidence of payment to the Central Bank of Nigeria.\nIt also summoned the accountant general of the federation, managing directors of Sterling, Unity, Sterling, Heritage, Keystone and Fidelity banks to appear in persons before it on October 27."
  },
  {
    "headline": "Chinese President Xi Seeks To Boost Relations With Nigeria, Writes To Buhari",
    "summarized_story": "Chinese President Xi Jinping has said his country will use the occasion of the 50th anniversary of the establishment of diplomatic relations with Nigeria to promote a strategic partnership to new heights.\nThis is according to a statement by Femi Adesina, the special media adviser to President Muhammadu Buhari.\nAccording to Adesina, President Xi disclosed his intentions in a letter addressed to the Nigerian leader on Friday.\nChina-Nigeria cooperation has been the pacesetter of China-Africa cooperation,’’ the Chinese President is said to have written in his piece to President Buhari.\nThe Chinese leader said he attached great importance to the development of China-Nigeria relations and assured President Buhari that his country would spare no effort in strengthening existing relations."
  },
  {
    "headline": "Chinese President Xi Seeks To Boost Relations With Nigeria, Writes To Buhari",
    "summarized_story": "Chinese President Xi Jinping has said his country will use the occasion of the 50th anniversary of the establishment of diplomatic relations with Nigeria to promote a strategic partnership to new heights.\nThis is according to a statement by Femi Adesina, the special media adviser to President Muhammadu Buhari.\nAccording to Adesina, President Xi disclosed his intentions in a letter addressed to the Nigerian leader on Friday.\nChina-Nigeria cooperation has been the pacesetter of China-Africa cooperation,’’ the Chinese President is said to have written in his piece to President Buhari.\nThe Chinese leader said he attached great importance to the development of China-Nigeria relations and assured President Buhari that his country would spare no effort in strengthening existing relations."
  },
  {
    "headline": "I'm a car dealer not a terrorist: Igboho blasts Malami",
    "summarized_story": "Yoruba nation activist, Sunday Igboho has punctured the claim by Abubakar Malami, the attorney general of the Federation, that he is being sponsored by an unnamed National Assembly member.\nIgboho challenged Malami to mention the lawmaker sponsoring Igboho and also questioned the attempt to link Igboho with a Bureau de change operator, Abdullahi Umar, linked with Boko Haram financing.\n“Again, Chief Adeyemo is a car dealer trading in the name of Adesun International Concept Ltd.“Does it mean that anybody buying a car from him or selling a car to him is a terrorist?\nMalami said the report, full of many holes, unravelled how Igboho got monies from 43 bank accounts, across nine banks.\n“The Federal Government has received the report on financiers of Adeniyi Sunday Adeyemo a.k.a Sunday Igboho”, Malami said."
  },
  {
    "headline": "Lagos jaw-jaw with stakeholders on plea bargain",
    "summarized_story": "The Lagos State Ministry of Justice through the Directorate of Public Prosecutions (DPP) on Friday held a stakeholder’s meeting to enhance and promote plea bargain and district prosecutor’s scheme of the state government.\n“Based on these recommendations, Mr. Governors approval was sought and with the cooperation of the Lagos State Judiciary, the Ministry of Justice deployed District Prosecutor’s to three (3) Magistrates Courts (Ebute-Metta.\n“Seeing the huge impact of this scheme, Lagos State Government extended the services to all Magistrate Court Houses across the State”.\n“To demonstrate our commitment towards the exercise, we took plea bargain a step further about four (4) months ago, when i led a team of Lawyers to the Kirikiri Maximum Correctional Facility for a Plea Bargain sensitization exercise where more than 15 plea Bargain Agreements were executed onsite and sanctioned immediately by the Judges through Virtual Hearing”.\nShe commended Lagos State for being a pacesetter in the administration of criminal justice system while urging other states in the federation to emulate the giant strides achieved by the State."
  },
  {
    "headline": "End SARS: Lagos Govt Suspends LNSC Officers For Brutalizing Uber Driver.",
    "summarized_story": "The Lagos State Neighbourhood Safety Agency (LNSA) has sanctioned two officers for their actions during the End SARS demonstration, which included the improper treatment of Uber driver Adedotun Clement.\nNEWS DIRECT reported how Lagos Neighborhood Safety Corps (LNSC) personnel and police officers brutalized Clement on Wednesday despite identifying himself.\nThe two officers directly involved in the assault were de-kitted and suspended for 2 months.\nTheir Commanding Superintendents and the Divisional Commander were suspended for one month; the deputies are to take charge until further notice.\nLSNA General Manager, Ifalade Oyekan apologized to Clement and restated the Lagos government’s commitment to secure lives and properties."
  },
  {
    "headline": "EndSARS: Nnamdi Kanu Hijacked Protest, Killed Security Agents, Others — Malami Alleges",
    "summarized_story": "On Friday, the Attorney General of the Federation, Abubakar Malami, revealed that pro-Biafra agitator Nnamdi Kanu hijacked the EndSARS protest.\nLast year, Kanu took advantage of the EndSARS rally to cause mayhem, which resulted in the deaths of security agents, according to Malami.\nAccording to the AGF, the Indigenous People of Biafra (IPOB) leader seized the protests by making subversive and inciting statements.\n“Despite the proscription of IPOB by the Federal Government, Nnamdi Kanu continued the subversive campaign, instigating and inciting broadcasts to direct members of the IPOB to launch attacks on government.\n“The EndSARS protests of October 2020 played into the sinister plans of Nnamdi Kanu, whereby he seized the protests through subversive and inciting online broadcasts and actively commanded and directed attacks on security personnel and facilities."
  },
  {
    "headline": "JUST IN: Unknow Gunmen Set Monarch’s Palace On Fire In Imo",
    "summarized_story": "Palace of the traditional ruler of the Etekwuru community in the Ohaji/Egbema Local Government Area of Imo State, has been razed by yet-to-be-identified hoodlums.\nThe attackers burnt down the monarch’s property including his Highlander Jeep on Thursday night, barely 24 hours after youths and soldiers clashed in the community.\nPunch reported that after a soldier was killed in the community, enraged military men burnt some houses in the agrarian community in a reprisal attack.\nI started making calls to the police for help but the help could not come until the building burnt beyond control.\n“I left my house with only boxers as all properties in my house burnt."
  },
  {
    "headline": "BREAKING: Nnamdi Kanu Is Responsible For Murder Of Akunyili’s Husband, Ahmed Gulak, Killed 175 Security Operatives – Buhari’s Govt",
    "summarized_story": "The claim was made by a committee set up by President Muhammadu Buhari to investigate Kanu, who is standing trial for terrorism related offences.\nThe government also accused Kanu of being responsible for the murder of a former Presidential Aide, Ahmad Gulak, and over 177 other cases in the South-East.\n“That 175 security personnel were killed by IPOB/ESN, comprising 128 policemen, 37 military personnel and 10 other security operatives.\nIt said 396 firearms and 17,738 ammunition were carted away during the IPOB/ESN attacks.\n“That there were three IPOB/ESN attacks on Nigerian Correctional Service, including the Headquarters of NCoS, Owerri, Imo State where 1,841 inmates escaped."
  },
  {
    "headline": "Breaking: NRC reopens Abuja-Kaduna train route 48 hours after ‘bandits attack’",
    "summarized_story": "The Nigerian Railway Corporation (NRC) has announced reopening of Abuja-Kaduna route two days after a moving train was attacked by suspected bandits.\nThe attacks carried out between Wednesday evening and Thursday morning also destroyed some part of the rail tracks.\nA reopening announcement by NRC on Friday evening read, “The Board and Management of the Nigerian railway corporation (NRC) hereby inform the general public, particularly our valued passengers that Abuja – Kaduna Train Services (AKTS) resume tomorrow, Saturday, 23rd October, 2021 as follows, From, IDU, Abuja (AK3) at 0950am.\nFrom RIGASA, Kaduna (KA4) at 1035am.\nNRC, once again sincerely apologises for the inconvenience.”Details loading…"
  },
  {
    "headline": "Compulsory Covid-19 vaccination: Anxiety grips civil servants",
    "summarized_story": "He had, on September 2, 2021, said the Covid-19 vaccination would be compulsory for federal civil servants once vaccines were available for everyone.\nOther countriesFindings by Blueprint Weekend showed that several countries have adopted mandatory Covid-19 vaccination policies for their workforces.\nThe government has made it easy for civil servants to access the vaccine by providing sufficient number of doses and has given the civil servants up to December 1 to get vaccinated.\n“When these civil servants were employed, compulsory vaccinations and its attendant punishment for non-compliance were not part of their terms of contract.\nThe government should also be careful not to create a window for Nigerians to forge fake Covid-19 vaccination certificates."
  },
  {
    "headline": "Breaking: FG reveals Sunday Igboho’s major sponsor, exposes Nnamdi Kanu",
    "summarized_story": "The federal government on Friday said it has uncovered major financier of the Yoruba nation agitator, Sunday Adeyemo also known as Sunday Igboho.\nHe said the company is allegedly being probed for terrorism financing activities.\nAccording to him, “It might be recalled that Abbal Bako & sons and its promoter Abdullahi Umar Usman are suspects in the on-going joint terrorist financing investigation.\n“Abdullahi Umar Usman is, by way of financial transaction, connected to Surajo Abubakar Muhammad (who was sentenced to life imprisonment in UAE on charges of financing terrorism (Boko Haram).” Malami said.\nThe AGF said the committee also made damning discovery about the activities of the leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, and his followers."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "NIA honours Aviation Minister for infrastructural development -NigPilot",
    "summarized_story": "Nigeria’s Minister of Aviation, Sen. Hadi Sirika has received the Honorary Fellowship and Distinguished Service Award of the Nigerian Institute of Architects, NIA, for his infrastructural developments within the aviation sector.\nThe Award was given to the minister at the Institute’s Architecture Annual Award 2021 in Abuja on Thursday.\nPresenting the award, the Institute noted that under his supervision, the Ministry of Aviation embarked upon 157 projects and delivered 134 to 100 percent completion for the first time in the history of Nigerian Aviation.\nThe NIA also cited the rehabilitation of the runways of the Abuja Airport and the Enugu Airport according to ICAO specifications which were not only delivered ahead of schedule, but within budget.\nDisclosing that he has rejected 390 awards in the past, Sirika said he had to make an exception for the NIA award because of the integrity of the institution."
  },
  {
    "headline": "Rubber stamp 9th assembly would approve Buhari’s third term if… – Wabara -NigPilot",
    "summarized_story": "Former president of the Senate, Adolphus Wabara Thursday hinted that the present 9th National Assembly would have approved an unconstitutional third term for President Muhammadu Buhari if he had insisted on going for it.\nWabara spoke Thursday in Abuja as a special guest at the public presentation of the book: “Standing Strong”, authored by former president of the Senate, Ken Nnamani.\nThe former Senate president who stepped down under intense pressure in the 5th assembly thanked President Muhammadu Buhari for standing strong against the pressure from certain quarters for him to seek a third term.\nHe eulogized the author, Sen. Ken Nnamani who he described as uncommon patriot and nationalist who stood strong in the face of pressure from the political lackeys of former president Olusegun Obasanjo who were bent on smuggling the third term agenda into the constitution through a backdoor.\nAlso speaking at the event, former Minister of defence, Theophilus Danjuma while commending the author, described the book as a text book for young Nigerians who are aspiring to lead a “difficult nation like Nigeria.”"
  },
  {
    "headline": "How we use live telecast to scuttle Obj’s 3rd term plot – Nnamani -NigPilot",
    "summarized_story": "” Publicizing the proceedings was faulted by those who wanted to smuggle into the constitution the extension of tenure through undefined and darken proceedings.\n” The knew that if we isolate Nigerians from the proceedings and therefore reduce public pressure on the legislators, it could be possible to ram through with their agenda.\nBut I stood strong.\nThe principal officers of the National Assembly stood strong.\nTo take it beyond doubt, I called for votes a second time."
  },
  {
    "headline": "Access Bank, Xploits Consulting organise workshop on drugs abuse, illicit trafficking to curb menace amongst students -NigPilot",
    "summarized_story": "On the need to fight against the menace of drug abuse in the country and to safeguard the lives of the growing generation, Access Bank Plc in collaboration with Xploits Consulting Ltd has organized a drug abuse and illicit trafficking workshop for students in the Federal Capital Territory, FCT and Nasarawa State.\nAddressing the students during the workshop, Director of Communications, Xploits Consulting Ltd, Mrs. Grace Taiwo said that the issue of drug addiction was eating deep into society especially among young adults.\nMr Nduka advised the students to stay away from drugs as it can lead to jail terms or death.\nAppreciating the efforts of Access bank Plc and Xploits Consulting Ltd, Principal of Babcecil Schools, New Karu Mr. Oliver Onoja said the lecture was timely as drug abuse was the in-thing for young adults.\nAlso, Miss Angela Anajendu of Capville Group of schools, Dawaki thanked the facilitators and sponsors for educating them on the dangers of drug abuse."
  },
  {
    "headline": "Buhari To Ogoni Leaders: Sensitise Indigenes On Value Of Protecting Pipelines, National Assets",
    "summarized_story": "President Muhammadu Buhari has urged Ogoni leaders to sensitise indigenes on the value of protecting national assets like pipelines and other oil installations, saying willful damages usually create more havoc on their environment and hamper development in the area.\n“The unfortunate incidents of the early 1990s leading to the loss of lives of distinguished sons of Ogoni Land and the collateral judicial processes are indelible in our memories.\n“Despite the grievous circumstances, the Federal Government will consider the request for the grant of pardon to finally close the Ogoni saga,’’ President Buhari noted.\nNPDC will lay a broad-based programme for the emergence of a new Ogoni Land for the benefit of the Ogoni people and Nigeria as a whole,’’ he added.\nGiniwa, thanked President Buhari for various interventions in the area, particularly on clean-up of the environment."
  },
  {
    "headline": "FG Accuses Nnamdi Kanu Of Inciting Attacks That Killed 175 Security Personnel, Several Others",
    "summarized_story": "The Federal Government has accused the leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu, of using Radio Biafra to instigate violence that led to the death of at least 175 security personnel and several other citizens.\nAccording to Malami, such assaults include attacks on security personnel, police stations, security formations, and the destruction of properties of the Independent National Electoral Commission (INEC) and private citizens.\nHe said 175 security operatives – 128 policemen, 37 military personnel, and 10 other security operatives – were killed in the attacks.\nHe added that Kanu also played a role in the violence recorded during the EndSARS protests in 2020.\n“The EndSARS protests of October 2020 played into the sinister plans of Nnamdi Kanu, whereby he seized the protests through subversive and inciting online broadcasts and actively commanded and directed attacks on security personnel and facilities,” Malami said."
  },
  {
    "headline": "There Is A Link Between Igboho And Terrorism Financier, Says FG",
    "summarized_story": "The Nigerian Government says it has established a connection between Yoruba nation agitator, Sunday Adeyemo, popularly known as Sunday Igboho, and a firm being investigated for terrorism.\nAttorney-General of the Federation (AGF) and Minister of Justice, Abubakar Malami, stated this at a news briefing in Abuja on Friday.\n“Investigation reveals that Adesun International Concept Ltd (belonging to Igboho) transferred the sum of N12,750,000 to Abbal Bako & Sons,” the AGF said.\n“It might be recalled that Abbal Bako & Sons and its promoter, Abdullahi Umar Usman, are suspects in the ongoing joint terrorist financing investigation.\n“Abdullahi Umar Usman is by way of financial transaction connected to Surajo Abubakar Muhammad (who was sentenced to life imprisonment in UAE on charges of financing terrorism [Boko Haram])."
  },
  {
    "headline": "Obiano Signs Anti-Open Grazing Bill Into Law, Orders Immediate Enforcement",
    "summarized_story": "Anambra State Governor, Willie Obiano, has joined his counterparts in the southern region of the country to sign the anti-open grazing bill into law.\nHe assented to the Cattle and Other Livestock Open Grazing Prohibition and Ranches Establishment Bill of Anambra State on Friday at the Governor’s Lodge in Amawbia, Awka.\nGovernor Obiano explained that the decision of the state government to outlaw the open grazing of cattle and other livestock was to enhance peace between the farmers and the herders in Anambra.\nThe governor stated that the law enforcement agencies have been directed to immediately commence the implementation of the law.\nAnambra is the most recent state to enact such a law after authorities in Rivers, Ondo, and Lagos, among other southern states, had done the same."
  },
  {
    "headline": "Partey Ends Goal Drought As Arsenal Beat Aston Villa",
    "summarized_story": "Thomas Partey scored his first goal for Arsenal as the Gunners beat Aston Villa 3-1 to extend their unbeaten run in the Premier League to six matches on Friday.\nEmile Smith Rowe put the result beyond doubt early in the second half as Arsenal climbed to ninth place in the Premier League.\nMaking his first Premier League start, Arsenal defender Nuno Tavares blasted over from a good position after scything through the Villa defence.\nUnable to muster a single shot in the first half, Villa finally tested Arsenal keeper Aaron Ramsdale through Watkins’ strike soon after the interval.\nVilla considered a move for Arsenal’s Smith Rowe when they chased a replacement for Jack Grealish in the close-season."
  },
  {
    "headline": "Chinese President XI writes President Buhari, seeks to bolster relations -",
    "summarized_story": "Chinese President Xi Jinping says his country will use the occasion of the 50th anniversary of the establishment of diplomatic relations with Nigeria to promote strategic partnership to new heights.\n‘‘Nigeria is an important strategic partner of China in Africa.\nChina-Nigeria cooperation has been the pacesetter of China-Africa cooperation,’’ President Xi wrote in a letter to the Nigerian leader, appreciating his congratulatory letter on the 72nd anniversary of the founding of the People’s Republic of China, which came up October 1.\nThe Chinese leader said he attached great importance to the development of China-Nigeria relations, and assured President Buhari that his country would spare no effort in strengthening existing relations."
  },
  {
    "headline": "Breaking: Nnmadi Kanu responsible for destruction of INEC offices, lives, property in Southeast",
    "summarized_story": "The adhoc Committee inaugurated by the President, Muhammadu Buhari headed by the Minister of Justice Abubakar Malami has indicted Nnamdi Kanu, IPOB/ESN members of carrying out massive attacks on democratic institutions especially INEC Facilities with a view to hampering democratic process in Nigeria.\nBriefing newsmen, the Minister of Justice said through the committee, the Federal Government has received report on financers of Adeniyi Sunday Adeyemo a.k.a Sunday Igboho.\nThe report revealed that Sunday Igboho is a Director and signatory to Adesun International Concept Limited registered on 23rd April, 2010.\nThe major financier of the fugitive and separatists was found to be a Federal Law Maker in the National Assembly.\nA total sum of N127, 145,000.00 was received by Mr Igboho from his financiers between 22nd October, 2013 and 28th September, 2020 through Adesun International Concept Ltd accounts."
  },
  {
    "headline": "Commuters demand improved security on Kaduna-Abuja highway after attack on train -",
    "summarized_story": "Barely 24 hours after the Nigeria Railway Corporation suspended services on the Kaduna – Abuja train route, commuters are calling for deployment of more security personnel on the Kaduna-Abuja highway which is the major option available for many.\nMany people had resorted to using the train following increased security concerns on the highway.\nIt’s still unclear who is behind Wednesday night’s attack on the rail track, but intelligence officials on Wednesday noted that terrorists loyal to the ISWAP and Ansaru faction of Boko Haram have been moving into Kaduna State.\nIn the meantime, commuters want the rail track fixed as soon as possible, so that operations can resume."
  },
  {
    "headline": "Video: Highlights of human rights abuses by officers of the Nigeria Police -",
    "summarized_story": "One of the accusations against men and officers of the Nigeria Police is the flagrant disregard for the rights of citizens.\nThey openly assault, shoot and sometimes kill innocent citizens under the guise of accidental discharge.\nMore worrisome is the lack of commensurate punishment meted against the perpetrators of the acts.\nIn this special report, Sarah Ayeku chronicles the cases of abuses by the men and officers of the Nigeria Police force."
  },
  {
    "headline": "Nnamdi Kanu’s Trial Marred by Controversy – Trending with Ojy Okpe",
    "summarized_story": "The trail of Nnamdi Kanu, leader of the Indigenous People of Biafra, on Thursday, was marred by controversy.\nLawyers and journalists were denied access to the courtroom by operatives of the department of state services.\nOutside the court room, thugs attacked revolution now campaigner and human rights activist, Omoyele Sowore, who was dressed in traditional Ohafia regalia to show support for Kanu.\nThe train was reportedly attacked with explosives by gunmen, alleged to be Boko Haram.\nFinally, a video showing an elementary school in Edo state, where children are subjected to study in the most atrocious of conditions is making the rounds on social media."
  },
  {
    "headline": "Gang Boss in Haiti Threatens to Kill Abducted Missionaries",
    "summarized_story": "Joseph also threatened Prime Minister Ariel Henry and Haiti’s national police chief as he spoke in front of the open coffins that apparently held several members of his gang who were recently killed.\nLater in the day, Henry’s office announced that Léon Charles had resigned as head of Haiti’s National Police and was replaced by Frantz Elbé.\nThe same day that the missionaries were kidnapped, a gang also abducted a Haiti university professor, according to Haiti’s ombudsman-like Office of Citizen Protection.\nIt also noted a Haitian pastor abducted earlier this month had not been released despite a ransom being paid.\nUNICEF said Thursday that 71 women and 30 children have been kidnapped so far this year — surpassing the 59 women and 37 children abducted in all of last year."
  },
  {
    "headline": "#EndSARS: Lagos Governor Sanwo-Olu Says Judicial Panel Report Will Be Made Public",
    "summarized_story": "Twenty four hours after the anniversary marking the #ENDSARS protest, Lagos State Governor, Mr. Babajide Sanwo-Olu has said the final report of the Judicial Panel of Enquiry and Restitution in the state was being awaited, assuring that his government would disclose the report fully to members of the public.\nThe Governor said the panel report would be helpful in strengthening true reconciliation and preventing re-occurrence of violence in the State.\nSanwo-Olu said: “The panel concluded its sittings about three days ago and has asked for time to put the reports together behind closed doors.\nWe do not know the content of the report, but we want to say publicly that, upon the handover of the report, we will be making it public.\nHe said: “It is exactly a year ago today when Lagos was hit by violence in the aftermath of the EndSARS protests."
  },
  {
    "headline": "Buhari Assures Anambra Election Won’t Be Disrupted, Directs Military to Use Overwhelming Force If Necessary – Arise News",
    "summarized_story": "He gave marching orders to the security agencies to apply overwhelming force, if necessary, to protect the November 6 governorship election and ensure it was not interrupted by non-state actors who have been heating up the polity.\n“The president has made it very clear that the armed forces, security agencies, and law enforcement agencies must make sure that the elections take place.\nIf it means overwhelming the entire environment with the presence of security agencies.\n“There are so many implications for elections to be sabotaged by non-state actors.\nOf course, the armed forces and security agencies have done so much in the last couple of months."
  },
  {
    "headline": "FBI: Human Remains Found in Florida Are Those of Gabby Petito’s Missing Boyfriend",
    "summarized_story": "Partial human remains found in a Florida wilderness area have been identified through dental records as belonging to Brian Laundrie, the boyfriend of murdered travel blogger Gabby Petito, the FBI said on Thursday.\nThe remains were discovered on Wednesday in the swampy Carlton Reserve not far from Laundrie’s parents’ home.\nPolice and FBI agents had been searching for him there since his family reported him missing in mid-September.\nLaundrie had been named a “person of interest” in Petito’s disappearance but was never criminally charged in her murder.\nThe family believes the couple was headed to Grand Teton National Park in Wyoming at the time."
  }
]