[
  {
    "headline": "No PVC, No Holy Communion",
    "summarized_story": "Justus Mogekwu, has canvassed the acquisition of Permanent Voter Card as a precondition for church members before they could participate in Holy Communion in the state.\nWhile urging Deltans to ensure they register to vote at elections so as to enthrone good governance, the Bishop expressed the view that every preacher in Delta State should henceforth, make it mandatory for their members to have the PVC before they could participate in Holy Communion.\nAccording to him, Christians must actively get involved in politics to enthrone good governance at all levels.\nHe said, “Pastors should ensure their members get their PVC before they take their Communion and do other worship services in the household of God.\nAs Communion is important to us as Christians, which makes us healthy, spirit-filled, and to be very strong, it is such with the PVC which makes us enthrone good governance at any level”."
  },
  {
    "headline": "Shinkafi knocks ex-gov Yari as supporters boycott congress",
    "summarized_story": "ONE of the leaders of the Zamfara State chapter of the All Progressives Congress, Dr Sani Shinkafi, has berated supporters of former Governor Abdulaziz Yari -led faction of the party for boycotting last Saturday’s state congress.\nAddressing a press conference in Gusau on Sunday, Shinkafi said the failure of Yari’s supporters to participate in the congress was an indication that the former governor has lost political relevance.\nThe former governor was only trying to dodge the congress because he knew what would happen if he and his supporters had attended the congress.\nReacting to news that parallel congresses were held, he said, “As far as we are concerned, there was nothing like parallel congresses.\nThe PUNCH had reported that the publicity committee chairman of the Yari’s faction, Ibrahim Birnin-Magaji, had on Friday urged members of the faction to shun the ward congress."
  },
  {
    "headline": "CD faults Reps for delay in declaring lawmaker’s seat vacant",
    "summarized_story": "A pro-democracy group, the Campaign for Democracy has decried the alleged delay in declaring vacant the Akure South/Akure North Federal Constituency seat, three months after the death of the previous occupant.\nThe seat became vacant following the demise of Mr Adedayo Omolafe, in August 2021.\nThe CD alleged that the delay was mischievous and against provisions of the Electoral Act.\nIn a statement issued by the Secretary of CD, Mr Ifeanyi Odili, in Akure, on Sunday.\nThe statement read in part, “Speaker Femi Gbajabiamila finally declared Maitala’s Jos North/Bassa Constituency seat of Plateau State vacant last week, seven months after the lawmaker died along with his two sons in an auto crash."
  },
  {
    "headline": "Lagos: Flood damages houses, electricity poles as canal overflows",
    "summarized_story": "The National Emergency Management Agency (NEMA) on Sunday said flash floods caused by downpour damaged several houses and vehicles in some parts of the Alimosho Local Government Area of Lagos State.\nNEMA also advised residents and motorists in the area to exercise utmost caution as some electric poles fell due to the downpour.\nMr Ibrahim Farinloye, Acting Zonal Coordinator, South West Zonal Office, NEMA, said this in a statement he issued in Lagos.\nSeveral houses were affected and the enumeration cannot be done today,” Farinloye said.\nFarinloye also disclosed that Ikeja Electric Plc has been contacted to isolate the areas where electricity poles fell down to prevent electrocution."
  },
  {
    "headline": "Stop protesting take over of land for development – Makinde tells Oyo indigenes",
    "summarized_story": "Governor Seyi Makinde of Oyo State has advised indigenes of the state to desist from protesting over take over of land for developmental purposes in any part of the stateMakinde made this disclosure on Sunday.\nHe spoke during the maiden remembrance of late Chief Theophilus Akinyele, one of the prominent indigenes of Ajia town in Ibadan.\nOur correspondent gathered that some indigenes of the state had earlier protested over the take over of some parcel of lands.\nSome of the areas where the indigenes had earlier protested included Ajia in Ona Ara local government area.\nSPeaking further, Makinde explained that he would name the Information Communication Technology Institution to be cited in Ajia after Akinyele."
  },
  {
    "headline": "National Assembly Clerk woos African parliamentarians to patronise Nigeria’s products",
    "summarized_story": "As the 51st conference of Commonwealth Parliamentary Association (CPA), Africa region comes to a close in Abuja, the Clerk to the National Assembly of Nigeria (CNA), Arc.\nOjo Olatunde Amos, has beckoned on parliamentarians and delegates across Africa, to patronise local products of the Nigerian people.\nHe said, despite the diversities in religions and tribes, the cultural heritage of Nigeria was also part of her God-given strength and blessings.\nSpeaking on the role of Nigeria in the Society for Clerks-At-The-Table (SoCATT), Amos appreciated the Africa region of CPA for always entrusting the country with much responsibilities.\nAmos assured the SoCATT, Africa region, that Nigeria’s branch, under his watch, shall fully participate in all activities of the society."
  },
  {
    "headline": "‘We’re not in charge of bridges’ – Amaechi vows to investigate cause of water accidents in Lagos",
    "summarized_story": "Minister of Transportation, Rotimi Amaechi, has promised to investigate the cause of the accidents around Magazine Point in the Marina area of Lagos.\nThe minister, while presenting the club’s Governor’s Cup to the winner, asked the management to formally write to his ministry on the accidents.\n“We are not in charge of bridges, we are in charge of water.\n“The National Inland Waterways Authority (NIWA) argues that this place belongs to them and it truly belongs to them.\n“When it comes to who collects the money for this place, the law says inland waterways, and this is inland water, this is not the sea,” Amaechi said."
  },
  {
    "headline": "2023: PANPIEC insists on Nigeria president of Igbo extraction",
    "summarized_story": "A socio-political group, Pan-Nigerian Presidency of Igbo Extraction Coalition (PANPIEC), as adduced reasons why the Igbo nation must be given the opportunity to occupy the nation’s presidency in 2023.\nThe group said allowing Igbo nation to produce President Muhammadu Buhari’s successor would help to restore peace and stability in the country, pointing out that Nigeria needs to end its own version of political injustice by electing an Igbo as President in 2023.\nPANPIEC, in a statement issued by its Executive Secretary, Chuks Ibegbu and forwarded to DAILY POST on Sunday, said the people of Igbo nation have contributed a lot to national development and deserves to be supported to produce the next Nigeria President.\nThe Igbos have been deeply wounded in all ramification and need to be supported to produce the next Nigeria President in 2023.”The PANPIEC called on President Muhammadu Buhari, the political parties and stakeholders to do the needful and make it possible.\nAccording to the group, “Let Nigeria allow political justice to prevail in 2023."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Houses, vehicles submerged as flood hits Lagos communities",
    "summarized_story": "Hundreds of residents were on Sunday afternoon sacked from their homes with vehicles submerged after flash floods affected Ekoro, Ajisebiara-Mecca, Akowonjo, Oko Oba and Egbeda areas of Lagos State.\nThe Nation gathered that some residents returned to their homes only to find water everywhere.\n- Advertisement -Read Also: PHOTOS: Houses, vehicles submerged as flood hits Lagos communitiesAt least 25 vehicles were said to have been flooded while in traffic as people rallied round to prevent the water from extending further by using concrete pillars as stoppage.\nNEMA’s Southwest Coordinator, Ibrahim Farinloye said that emergency workers were undertaking enumeration of affected houses in the various communities.\nHe said the electricity distribution company in charge of the areas had been contacted to isolate them to prevent electrocution."
  },
  {
    "headline": "Marafa blames Buni for parallel ward congresses in Zamfara",
    "summarized_story": "A chieftain of the ruling All Progressives Congress (APC) in Zamfara, Senator Kabir Marafa, has accused the national leadership of being responsible for the parallel ward congresses that took place in the State on Saturday.\nThe APC in June suspended congresses in Zamfara State following the defection of Governor Bello Matawalle.\nA seven-man ward congress committee, under the chairmanship of Alhaji Ibrahim Masari, was constituted on the 27th of October only for the party leadership to indefinitely suspend the ward congress in the State on November 5.\n- Advertisement -Marafa said party members were shocked by the national caretaker committee chose to inform INEC of the congress date as against all stakeholders.\nHe expressed confidence in INEC to do the right thing on the just concluded Ward congresses in Zamfara State like the electoral body did in 2018 before the 2019 elections."
  },
  {
    "headline": "IPOB demands immediate release of detained members",
    "summarized_story": "The Indigenous People of Biafra (IPOB) has raised the alarm over alleged abductions, killings, arrests and burning down of properties in the Southeast by security agents.\nThe group demanded the release of all Biafrans arrested and kept in detention by security agents in various prisons in the zone.\n- Advertisement -“We strongly condem the arrest a lady in Obowo Imo State whom we understand is to be wedded by December this year.\nWe therefore, demand Govs Hope Uzodinma, and Willie Obiano, ensure the release of all Biafrans arrested and kept in detention by the wicked Nigeria security agents in their respective States.\n“The Department of State Services (DSS) with joint military taskforce raided Odenkwume in Obowo Imo State, in the early hours of November 13, 2021 and abducted people."
  },
  {
    "headline": "Political solution option: Afenifere hits Malami over Igboho, Kanu",
    "summarized_story": "Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\n“To us in Afenifere, and indeed, to many who believe in orderliness and rule of law, Sunday Adeyemo, popularly known as Sunday Igboho, committed no offence.\nSo, the question of he, or anyone on his behalf, making a case for a political solution does not arise.\n“The same government has been making a lot of efforts to get him extradited from the Republic of Benin to Nigeria.\nBut because the man is not a criminal, it has been difficult to build a case to nail him."
  },
  {
    "headline": "Leaders planned meeting with President: Outcome of talks with",
    "summarized_story": "So, one of the driving forces is to rewrite the history of Ebonyi State.\nThe important thing is that we have that infrastructure which nobody will take away from Ebonyi State.\nIt was actually supposed to be a campus of Ebonyi State University for Medicine only.\nWe’ve paid 100 per cent for the dialyzer plant, so we are going to have the plant in Ebonyi State.\nWe have the patent; so, anywhere that the plant would be built again in Africa, Ebonyi State is going to be a beneficiary."
  },
  {
    "headline": "It’s nobody’s business what I do with my boobs –BBNaija star, Angel",
    "summarized_story": "By Funsho ArogundadeFor Big Brother Naija star, Angel Agnes Smith, has said that whatever she does with her boobs is nobody’s business.\n“Honestly, it’s not anybody’s business what I do with my boobs.\nI will rather insure my eyes because I have an intense eyes alongside my most prized possession which is my mind,” she said.\nMy most prized possession is my mind, as it has always put me in many beautiful positions.\nWhile admitting that she has a notorious mood swing, Angel, whom many perceive as flirty, described herself as naturally reclusive."
  },
  {
    "headline": "2023: It’s time for Nigerian youths to produce president – Shettima, AYCF president",
    "summarized_story": "To the President of Arewa Youth Consultative Forum (AYCF), Yerima Shettima, the region was not ready to champion the affairs of the country based on his view as captured in this interview.\nSo, what are those qualities Nigerians should look forward to as they decide their next president after the expiration of the tenure of President Buhari in 2023?\nLet’s talk a bit about the tenure of Buhari which is about six and half years now.\nWhat specific message do you have for your constituents, I mean young people ahead of the 2023 elections?\nWe should be very focused, determined and take our destiny into our hands to ensure one of our own becomes the president."
  },
  {
    "headline": "Electoral Act: APC govs, others under fire for kicking against direct primaries",
    "summarized_story": "“We felt that we should let you know that we are done with the Electoral Act Amendment Bill.\nOn the flipside, the Parliament is pushing for the Electoral Act Amendment Bill to be signed immediately by the President.\nThe PDP National Publicity Secretary, Kola Ologbondiyan, in the party’s reaction to the passage of the Electoral Act Amendment Bill, said making direct primaries compulsory was unacceptable.\n“I support direct primaries because it is more democratic and more inclusive than indirect primaries.\nHowever, a renowned union activist, Chief Frank Kokori, expressing a different view, argued that direct primaries would be more expensive in actual practice than the indirect primaries."
  },
  {
    "headline": "Buhari, Zulum Mourn as ISWAP Fighters Ambush General, Three Soldiers in Borno",
    "summarized_story": "I salute the sacrifices of some officers and men we lost today and share the grieves of the immediate families and the Nigerian military.\nThis has placed added responsibility on the border security agencies.\nMonguno said the move was aimed at strengthening border security.\n“It is necessary to observe that both strategies place a premium on employing technology to complement other existing physical border security arrangements.\nWe are also exploring the feasibility of setting up a border security force in the foreseeable future to secure Nigeria’s border areas”, he said."
  },
  {
    "headline": "INEC: Monitoring Direct Primaries Has Financial, Security Implications",
    "summarized_story": "The commission further explained that monitoring the direct primaries of the 18 political parties registered so far would involve much staff.\nHowever, the state governors, who are opposed to direct primaries, had expressed fear over the logistical problems it would create for the commission.\nSpeaking to THISDAY last night, INEC’s National Commissioner in charge of Voter Education and Information, Mr. Festus Okoye, acknowledged that the monitoring of the direct primaries of the 18 registered political parties has security and financial implications.\n“The monitoring of direct primaries has financial and national security implications.\nOkoye further noted that INEC will aggregate the figures and design a continuity framework and matrix for monitoring of direct primaries."
  },
  {
    "headline": "18 Days after Launch, CBN’s eNaira Registers 488,000 Subscribers in 160 Countries",
    "summarized_story": "•Records 17,000 transactionsJames Emejo in AbujaBarely 18 days after its launch, 488,000 consumer wallets have been on-boarded to Nigeria’s Central Bank Digital Currency (CBDC) platform known as the eNaira from over 160 countries through Google Playstore and Apple Store as of Friday.\nThis is an indication of growing enthusiasm for the central bank’s digital currency, which has been described as a game-changer.\nThe digital platform had recorded about 200,000 wallets downloads in less than one day that the portal came alive.\nNigeria is the first country in Africa and one of the first in the world to introduce digital currency.\nHe added: “Therefore, the eNaira is Nigeria’s CBDC and it is the digital equivalent of the physical Naira."
  },
  {
    "headline": "$40bn Deals: Buhari Leaves Paris for IATF in S’Africa",
    "summarized_story": "Deji Elumoye in Paris, FrancePresident Muhammadu Buhari yesterday left Paris, the French capital, to join other African leaders in South Africa for the opening ceremony of the second Intra-African Trade Fair (IATF) 2021, which is expected to attract $40 billion investments to the continent.\nAccording to a statement issued by his Special Adviser on Media and Publicity, Mr. Femi Adesina, the president, is attending the event on the special invitation of South African President, Mr. Cyril Ramaphosa.\nAdesina stated that global businesses, including non-African international brands are expected to key into opportunities generated by the fair, thereby attracting for the continent trade and investment deals worth $40billion.\nThe theme of the Fair, ‘Building Bridges for a Successful AfCFTA’, aims at boosting trade and investment across the African continent.\n“President Buhari is expected back in Nigeria on Tuesday, November 16,” the statement added."
  },
  {
    "headline": "Osinbajo: Strategic Leadership Helped Nigeria Tackle COVID-19",
    "summarized_story": "Osinbajo who stated this at the public presentation of the book, ‘Winning Leadership’ authored by Major-General Pat Akem-Vingir (retired) noted that the step was a good example of strategic leadership in a crisis.\nHe said Nigeria’s COVID-19 response had been celebrated locally and internationally as a result of such strategic leadership.\nIn other words, effective strategic leadership purposefully provides direction and inspires.\n“Whereas countries with more modest economic profiles, quickly deployed a public health framework that was responsive and effective.\nOsinbajo described the book as an essential contribution to the existing body of knowledge on the subject of strategic leadership."
  },
  {
    "headline": "Nigeria’s Examination Council, NECO Board Chairman Sacks, Redeploys Workers Over SaharaReporters’ Story Exposing Corruption In Exam Body",
    "summarized_story": "Some members of staff of the National Examinations Council (NECO) have cried out over their redeployment and in other cases, termination of appointments by the Chairman of the Board, Dr Abubakar Sadeeq.\nThe aggrieved NECO workers told SaharaReporters on Sunday that the chairman of the board of the examination body accused them of leaking his fraudulent activities to the media, saying he subsequently decided to sack and redeploy them.\nSince then, Sadeeq has been victimising some workers, pointing accusing fingers at them, some workers told SaharaReporters.\nEye Bassey Eyo, Mr. Ibrahim Ali, Mr. Bashir Bulangu, Mr. Arisa Agwu Arisa.\nOne of the workers told SaharaReporters, “We have sent an appeal to the Minister of Education about being wrongfully redeployed."
  },
  {
    "headline": "Nigeria’s Examination Council, NECO Board Chairman Sacks, Redeploys Workers Over SaharaReporters’ Story Exposing Corruption In Exam Body",
    "summarized_story": "Some members of staff of the National Examinations Council (NECO) have cried out over their redeployment and in other cases, termination of appointments by the Chairman of the Board, Dr Abubakar Sadeeq.\nThe aggrieved NECO workers told SaharaReporters on Sunday that the chairman of the board of the examination body accused them of leaking his fraudulent activities to the media, saying he subsequently decided to sack and redeploy them.\nSince then, Sadeeq has been victimising some workers, pointing accusing fingers at them, some workers told SaharaReporters.\nEye Bassey Eyo, Mr. Ibrahim Ali, Mr. Bashir Bulangu, Mr. Arisa Agwu Arisa.\nOne of the workers told SaharaReporters, “We have sent an appeal to the Minister of Education about being wrongfully redeployed."
  },
  {
    "headline": "Nigeria’s Examination Council, NECO Board Chairman Sacks, Redeploys Workers Over SaharaReporters’ Story Exposing Corruption In Exam Body",
    "summarized_story": "Some members of staff of the National Examinations Council (NECO) have cried out over their redeployment and in other cases, termination of appointments by the Chairman of the Board, Dr Abubakar Sadeeq.\nThe aggrieved NECO workers told SaharaReporters on Sunday that the chairman of the board of the examination body accused them of leaking his fraudulent activities to the media, saying he subsequently decided to sack and redeploy them.\nSince then, Sadeeq has been victimising some workers, pointing accusing fingers at them, some workers told SaharaReporters.\nEye Bassey Eyo, Mr. Ibrahim Ali, Mr. Bashir Bulangu, Mr. Arisa Agwu Arisa.\nOne of the workers told SaharaReporters, “We have sent an appeal to the Minister of Education about being wrongfully redeployed."
  },
  {
    "headline": "EXCLUSIVE: How Nigerian Embassy In Ireland Extorts Over N47,000 From Each Passport Applicant For Staff Members To Share",
    "summarized_story": "The Nigerian Embassy in Dublin, Ireland is collecting illegal €100 (approximately N47,000) postal orders from Nigerians applying for passports which are shared and monetised by staff members for personal gains, SaharaReporters has learnt.\nIf you bring a postal order addressed to the Nigerian Embassy, they will reject it.\n\"They are not giving people their passports except they bring blank postal orders which they will go claim.\n\"They gave express warning that it should not be addressed to the Nigerian Embassy but should be left blank,” one of the sources said.\n“The passport fast-track services are only on Thursdays and Fridays from 10.00am to 1.00pm.”"
  },
  {
    "headline": "EXCLUSIVE: How Nigerian Embassy In Ireland Extorts Over N47,000 From Each Passport Applicant For Staff Members To Share",
    "summarized_story": "The Nigerian Embassy in Dublin, Ireland is collecting illegal €100 (approximately N47,000) postal orders from Nigerians applying for passports which are shared and monetised by staff members for personal gains, SaharaReporters has learnt.\nIf you bring a postal order addressed to the Nigerian Embassy, they will reject it.\n\"They are not giving people their passports except they bring blank postal orders which they will go claim.\n\"They gave express warning that it should not be addressed to the Nigerian Embassy but should be left blank,” one of the sources said.\n“The passport fast-track services are only on Thursdays and Fridays from 10.00am to 1.00pm.”"
  },
  {
    "headline": "Fashola: I don’t know what happened to camera I recovered at Lekki tollgate",
    "summarized_story": "Babatunde Fashola, minister for works and housing, says he does not know what happened to the video camera he recovered at the Lekki tollgate after the #EndSARS protests.\nAdvertisementFollowing the Lekki tollgate shooting in October 2020, Fashola, while visiting the scene alongside fellow ministers and south-west governors, discovered a hidden camcorder which he said must have been planted by “some subversive elements”.\nThe clip of the former Lagos state governor picking up his discovery was turned into memes that trended on the internet for months.\nSo don’t ask me what happened to the camera.\nI don’t know.”"
  },
  {
    "headline": "Fashola: I don’t know what happened to camera I recovered at Lekki tollgate",
    "summarized_story": "Babatunde Fashola, minister for works and housing, says he does not know what happened to the video camera he recovered at the Lekki tollgate after the #EndSARS protests.\nAdvertisementFollowing the Lekki tollgate shooting in October 2020, Fashola, while visiting the scene alongside fellow ministers and south-west governors, discovered a hidden camcorder which he said must have been planted by “some subversive elements”.\nThe clip of the former Lagos state governor picking up his discovery was turned into memes that trended on the internet for months.\nSo don’t ask me what happened to the camera.\nI don’t know.”"
  },
  {
    "headline": "SCORECARD: What COP26 set out to do -- and what was accomplished",
    "summarized_story": "The United Nations Climate change conference — COP26 — came to a close on Saturday, November 13.\nAdvertisementFollowing the conclusion of COP26, there have been mixed reactions as to whether the conference actually achieved its goals.\nIn this scorecard, TheCable dives into the goals set out before COP26 to see how the conference fared.\nAdvertisementAt the conference, countries agreed to end deforestation by 2030.\nThe international community also agreed to unite and support people who are most vulnerable to the impacts of climate change."
  },
  {
    "headline": "SCORECARD: What COP26 set out to do -- and what was accomplished",
    "summarized_story": "The United Nations Climate change conference — COP26 — came to a close on Saturday, November 13.\nAdvertisementFollowing the conclusion of COP26, there have been mixed reactions as to whether the conference actually achieved its goals.\nIn this scorecard, TheCable dives into the goals set out before COP26 to see how the conference fared.\nAdvertisementAt the conference, countries agreed to end deforestation by 2030.\nThe international community also agreed to unite and support people who are most vulnerable to the impacts of climate change."
  },
  {
    "headline": "Ohanaeze Worldwide: We're building alliance with north to achieve Igbo presidency",
    "summarized_story": "Ohanaeze Ndigbo Worldwide, Igbo sociocultural association, says an Igbo presidency in 2023 will put a stop to agitations and quest for secession in the south-east.\nSpeaking in an interview with PUNCH, Okechukwu Isiguzuro, Ohanaeze Ndigbo Worldwide secretary-general, said denying the Igbo the presidency will further increase Biafra agitations and threaten Nigeria’s unity.\n“The consequences of denying the Igbo the 2023 presidency will strengthen Biafra agitations and it will sink Nigeria’s corporate existence and threaten its unity.\n“The expectation of Igbo to achieve the desired results of having an Igbo succeed President Buhari in 2023 is ongoing.\nWe believe that the discussions through sincere engagements will change the northern fears over 2023 Igbo presidency."
  },
  {
    "headline": "Where is Africa’s digital media landscape headed?",
    "summarized_story": "Digital media in Africa is growing fast: traditional media organisations are finding their way to the internet while digital-only media organisations are taking firm root.\nMore Africans are online, they are spending more time on the internet and relying more on digital media more than ever.\nHow can digital media in Africa create a profitable business model?\nWhile it is normal to get excited about the different innovative news products in the continent’s digital media landscape, Abiru explains that more media houses need to produce more information that helps people understand what is going on around them.\nShe believes African journalists can do amazing work, but their budget is way smaller than that of global publications."
  },
  {
    "headline": "Is Flutterwave’s acquisition of Disha a win for the creator economy?",
    "summarized_story": "Credit: Disha (Medium)The product was an instant hit and got considerable adoption among creators and gig workers.\nThe move by the payments giant, which earlier this year became a unicorn, is surprising as both companies operate in different spaces—Flutterwave in payments and Disha in the creator industry.\nDespite the acquisition, however, Disha will remain an independent company.\n“Before now, when users created a Disha page and linked to a Flutterwave payment link, they got taken off the Disha site.\nNow, with the acquisition, users can create and accept their payments, all in one place.”Flutterwave has always played in the creator space, having supported arts events like ArtX Lagos."
  },
  {
    "headline": "Exclusive: Meta’s VP MEA and Turkey on Facebook’s transition into the metaverse",
    "summarized_story": "Leading that work in Africa is Derya Matras, Vice President (VP), Middle East, Africa (MEA) and Turkey, Meta.\nPrior to her appointment as VP in August, Matras was the Managing Director for the MEA and Turkey region.\nIt’s the next evolution in a long line of social technologies, and it’s ushering in a new chapter for our company.\nWhy should Facebook build this?\nBut it’s important to reiterate that Meta is neither going to build, own, or run the metaverse on its own."
  },
  {
    "headline": "MFS Africa raises $100m to continue expanding its digital payments network",
    "summarized_story": "MFS Africa, Africa’s largest digital payments network, has raised a $100 million Series C funding, an investment divided into two commitments: $70 million for equity and $30 million for debt financing.\nThe announcement came a few weeks after the company extended its footprint into the Nigeria market by acquiring Baxi, one of Nigeria’s largest digital solutions and distribution companies, from Capricorn Digital.\nFounded by Dare Okoudjou in 2009, MFS connects more than 320 million mobile money wallets across over 35 African countries.\nThe company plans to use the new investment to hire more global talent, power its Governance, Risks and Compliance (GRC) functions, and ramp up its expansion efforts.\nWe are excited to join MFS Africa’s world-class management team on its mission and to support its growth journey.”Share this article"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Technext to host Coinference 2021: Africa’s biggest cryptocurrency gathering!",
    "summarized_story": "Share this article:Tech media organisation, Technext has announced its maiden event, Technext Coinference 2021.\nThe maiden event is billed to hold on Thursday, December 9, 2021, at the Pistis conference centre in Lagos.\nRegistered delegates will anticipate discussions on the impact of regulation on the crypto space.\nIt will also provide an exciting opportunity for crypto enthusiasts to meet other enthusiasts, develop ideas and positions for future gain.\nTechnext Website Technext.ng is the go-to site for Tech News, Reviews and Insightful Analysis in Nigeria."
  },
  {
    "headline": "Helium Health acquires Qatar’s Meddy in expansion play",
    "summarized_story": "Share this article:Nigerian healthtech startup, Helium Health has announced its acquisition of Meddy, a doctor booking platform in Qatar.\nAs part of the deal, Meddy’s CEO Haris Aghadi and COO Abed Alkarim Khattab will join Helium Health’s leadership team.\nHowever, Adegoke Olubusi, Helium Health’s CEO reveals that the cultural similarity of the two teams was key in the deal.\nFounded by Olubusi, Dimeji Sofowora, and Tito Ovia, Helium Health provides a suite of services for its healthcare clients.\nThis year, Helium Health has already expanded to Kenya."
  },
  {
    "headline": "Nigerian drones and smart glasses, Rabbit’s $11m pre-seed, MFS Africa’s $100m Series C, and Flutterwave’s Disha acquisition",
    "summarized_story": "AdvertisementLendable, a UK-based debt financing company, typically gives startups between $5 million and $10 million in debt financing.\nYou can read all about it here: How UK-based debt financing company, Lendable, is providing equity-free financing for African startups.\nMFS Africa raises $100m Series CDare Okoudjou (Founder and CEO, MFS Africa).\nSource: Reloadly blogPan-African cross-border payments gateway, MFS Africa, has closed a $100 million Series C round, comprising $70 million equity and $30 million debt.\nFounded in 2009, MFS Africa connects mobile money systems to banks and other financial institutions."
  },
  {
    "headline": "Pan-Atlantic University names Enase Okonedo new vice-chancellor",
    "summarized_story": "The Board of Trustees of the Pan-Atlantic University Foundation has appointed Professor Enase Okonedo, as the new vice-chancellor of Pan-Atlantic University.\nProfessor Okonedo, who is currently the deputy vice-chancellor of the University, had previously served as the dean of Lagos Business School (LBS), Pan-Atlantic University.\nProfessor Okonedo joined LBS as a research associate in 1995, following a stint in the banking and financial sector.\nProfessor Okonedo is officially set to resume as the Vice-chancellor on January 1st, 2022.\nAccording to Professor Elegido, the outgoing Vice-Chancellor of Pan-Atlantic University, “there has been a succession plan in place, which was approved by the Governing Council and the Trustees, for several years."
  },
  {
    "headline": "COP26 keeps 1.5C hanging by a thread – experts",
    "summarized_story": "Negotiators agreed that urgent action was needed in accelerating climate action but this didn’t fully reflect in their commitments.\n“However, the rules agreed at COP26 are far from perfect with some major loopholes on timeframes for countries’ climate targets and especially for carbon markets.\nEvans said that governments must avoid this temptation, uphold strict standards, and stay faithful to the ambition of the Glasgow Climate Pact which gives us the hope of keeping 1.5C alive.\nBut work done by independent experts Climate Action Tracker shows that with full implementation of the fresh collective commitments could hold temperature rise to 1.8C.\nAfter the collective dedication which has delivered the Glasgow Climate Pact, our work here cannot be wasted,” Sharma said."
  },
  {
    "headline": "What Ikoyi building collapse means for housing stakeholders",
    "summarized_story": "Beyond the pain of loss inflicted on people whose loved ones were killed, the Gerard Road Ikoyi building collapse in Lagos means so much for critical stakeholders in Nigeria’s housing sector, experts say.\n“The Ikoyi building collapse means the government and its agencies are not doing enough.\nThe collapse of Ikoyi building, also known as 360 Towers, has implications for project financiers too.\nAll these define the collapsed Ikoyi building.\nToo many experts in the built environment, the collapsed Ikoyi building was a disaster waiting to happen."
  },
  {
    "headline": "Obaseki launches Victor Uwaifo Creative Hub, assures better opportunities for Edo youths – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, at the weekend, launched the Victor Uwaifo Creative Hub in Benin City, with the pledge to sustain programmes and reforms to ensure Edo youths realize their fullest potentials.\nEdo is about entertainment; Edo is about education; Edo is about helping those interested in entertainment to achieve their aims.\nOthers at the event include Edo State Deputy Governor, Rt.\nComrade Philip Shaibu; his wife, Maryann; Secretary to Edo State Government, Osarodion Ogie Esq.\n; Speaker of Edo State House of Assembly, Rt."
  },
  {
    "headline": "Gov. Obaseki inaugurates Edo creative hub to immortalise late Victor Uwaifo – Nigerian Observer",
    "summarized_story": "Godwin Obaseki of Edo has inaugurated Edo creative hub to immortalise late ‘guitar boy’, Prof. Victor Uwaifo.\nObaseki said during the inauguration at the newly-constructed, creative hub in Benin, that it would help Edo youths to harness their entertainment potentials.\n”Yesterday, we launched 30 years Edo development plan and the key components of the plan are education, technology and entertainment.\n“I want to let you know tonight that your government will not abandoned you again.\n“So, we are launching this creative hub in honour of Victor Uwaifo, and for our youths to harness their entertainment potentials,” he said."
  },
  {
    "headline": "Don’t throw away baby, bathe water on Electoral Act Amendment Bill: DG VON appeals to Buhari – Nigerian Observer",
    "summarized_story": "Speaking on the raging controversy over Direct Primary mode of electing party candidates inserted into the Electoral Act (Amendment) Bill, 2021, Okechukwu, appealed to President Muhammadu Buhari not to throwaway the baby and the bathe water.\n“I appeal to Buhari not to throwaway the baby and the bathe water.\n“My candid appeal is that Mr President should endorse the Electronic Transmission contained therein; which is the mother of Bimodal Voters Accreditation System (BIVAS),” he said.\n“Am sincerely afraid that the controversy, hyperbole and cacophony of voices over direct primary may wittingly or unwittingly scuttle the entire Electoral Bill, thus throwaway the baby – BIVAS and the bathe water – Direct Primary.\nMr President please avoid this boobytrap against electronic transmission,” he said."
  },
  {
    "headline": "Your allegation of terrorism sponsorship a disgusting distraction – FG replies GATE – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestParis – The Federal Government has described the allegation by Global Advocates for Terrorism Eradication (GATE) that its officials are sponsors of terrorism, as a disgusting distraction.\nThis is contained in a statement on Sunday by the Minister of Minister of Information and Culture, Alhaji Lai Mohammed.\n”This organisation called GATE is not even worth the ink with which its name is written.\n“How can a serious organisation accuse a government that is tackling the twin evil of terrorism and banditry with uncommon determination of sponsoring terrorism?\nFittingly, Nigeria’s efforts at tackling terrorism have been hailed globally."
  },
  {
    "headline": "Vice President of Dangote Group is dead",
    "summarized_story": "Sani Dangote, the vice president of the Dangote Group and brother to Aliko Dangote, is dead.\nRelatively less popular than his billionaire brother, Mr Dangote had investments in manufacturing, agriculture, banking and oil services.\nHe sat on the boards of several companies including Dangote Cement, Dangote Sugar, Dangote Agro Sacks, Dangote Refinery, Petrochemical and Fertiliser company.\nHe was better known for his role as the chairman of Dansa Holdings, a subsidiary of the Dangote Group that produces beverages.\nHe also owned Dansa Foods Limited, Dansa Energy, Sagas Energy Limited, Bulk Pack Services Limited, Dansa Agro Allied Limited, and Dangote Farms Limited."
  },
  {
    "headline": "Aliko Dangote loses younger brother, Sani Dangote",
    "summarized_story": "Alhaji Sani Dangote, the vice president of the Dangote Group and owner of Dansa Agro-allied Limited, has died.\nSani, who was a younger brother to Africa’s richest man and founder of the Dangote Group, Alhaji Aliko Dangote, died at a US hospital on Sunday evening after a protracted illness, family sources said.\nHe was a businessman with more than 30 years’ experience in manufacturing, agriculture and oil services, and sat on the board of several other companies and was the deputy chairman of African Gum Arabic Producers Association, a fellow of the Nigeria Institute of Shipping and president of the Fertilizer Producers and Suppliers Association.\nFacebook Notice for EU!\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "Keystone Bank says Malami never forced it to convert recovered loot at N305 per $1",
    "summarized_story": "Keystone Bank Limited has denied media reports that Nigeria’s Attorney General and Minister for Justice, Abubakar Malami forced it to convert money from recovered loot at N305 per $1.\n“We wish to state the following facts for the records:The money in issue was not a ‘recovered loot’.\nThe sum involved belonged to NNPC which came into the position of Keystone Bank in the normal and ordinary course of business.\n“We did not inform the Ad-hoc Committee during our presentation that the Honorable Attorney General of the Federation ‘forced’ us to ‘convert recovered loot at N305 per dollar’.\n“We reiterate that at no time did we insinuate that the Honorable Attorney General of the Federation acted improperly, forced us to transfer or acted outside the powers of his office."
  },
  {
    "headline": "Army denies issuing statement on plan to overthrow Buhari",
    "summarized_story": "The said publication, according a statement by Director Army Public Relations, Brigadier General Onyema Nwachukwu, was riddled with outrageous lies and fabrications and had claimed that the “Defence Headquarters has denounced a call for the military to take over the reins of power”.\nThe online outlet went further to attribute its falsehood to “Army Spokesman, Brig Gen Onyema Nwachukwu.”Nwachukwu said the only reason why this grossly unprofessional and blatantly irresponsible report is receiving any attention is the attribution of the false statement to him.\nThe authors of the story, the statement said, “must be the only news reporters who do not know that Army Spokesman does not speak for the Defence Headquarters.\n“However, for the sake of clarity and to keep the records straight, we wish to state that at no time did the Director, Army Public Relations, Brig Gen Onyema Nwachukwu issue any statement on the subject matter.\nIt is therefore a figment of their imagination, which did not in anyway emanate from Brig Gen Nwachukwu."
  },
  {
    "headline": "Pastor Bakare and verdict of history",
    "summarized_story": "No great thing has ever been accomplished without ambition and the driving force of Pastor Bakare’s actions is ambition.\nWas it right then because it suited his political ambition as the Number 16; and now that it is no longer feasible, it is wrong?\nIf merit were applied in selecting leaders, will Pastor Bakare qualify?\nSo, the competence Bakare is talking about, like the Change, which the APC preached to us, is totally different from what the north means.\nIf that is what the north means, and Bakare agrees, then Nigeria is ripe for greatness."
  },
  {
    "headline": "Stop Protesting Takeover Of Land For Devt, Makinde Tells Oyo People",
    "summarized_story": "Oyo State Governor, ‘Seyi Makinde on Sunday, told people of the state to stop protesting the takeover of land for developmental purposes, adding that government will always pay compensation for any land acquired.\nHe told the congregation that he was ready to do everything within his power to develop Ajia village to a city in line with the dream of Pa Akinyele.\nI want to use this opportunity to appeal to those protesting that government has dispossessed them of their land.\n“If you have acquired land here and we need the land for public good, we will compensate you to conveniently move to another place.\n“I have met with people in this state who used their positions to acquire government land and built houses on."
  },
  {
    "headline": "Stop Protesting Takeover Of Land For Devt, Makinde Tells Oyo People",
    "summarized_story": "Oyo State Governor, ‘Seyi Makinde on Sunday, told people of the state to stop protesting the takeover of land for developmental purposes, adding that government will always pay compensation for any land acquired.\nHe told the congregation that he was ready to do everything within his power to develop Ajia village to a city in line with the dream of Pa Akinyele.\nI want to use this opportunity to appeal to those protesting that government has dispossessed them of their land.\n“If you have acquired land here and we need the land for public good, we will compensate you to conveniently move to another place.\n“I have met with people in this state who used their positions to acquire government land and built houses on."
  },
  {
    "headline": "Most Health Challenges Caused By Work Habit – Expert",
    "summarized_story": "Wellness specialists have revealed that most of the health challenges experienced by the working class people is as a result of bad work habit.\nAccording to the experts, who, said employers should be responsible for the healthcare of their workers, they insisted that most health challenges faced by Nigerians can be traced to their nature of jobs.\nSpeaking at the 2021 Workplace, Health Wellness Fair organised by Tsapphir Unique Divine Haven (TUDH) in Abuja at the weekend, a wellness specialist, Taiwo Adeoye, said employees should be given occasional health training.\n“There should be comfortable environment and rights to make decisions that affect their health,” Adeoye said of the employees.\nSince most health challenges faced by Nigerians could be attributed to the nature of the job they do, the employers should be accountable for the healthcare of their workers to enable them to work efficiently and live longer,” Adeoye added."
  },
  {
    "headline": "Most Health Challenges Caused By Work Habit – Expert",
    "summarized_story": "Wellness specialists have revealed that most of the health challenges experienced by the working class people is as a result of bad work habit.\nAccording to the experts, who, said employers should be responsible for the healthcare of their workers, they insisted that most health challenges faced by Nigerians can be traced to their nature of jobs.\nSpeaking at the 2021 Workplace, Health Wellness Fair organised by Tsapphir Unique Divine Haven (TUDH) in Abuja at the weekend, a wellness specialist, Taiwo Adeoye, said employees should be given occasional health training.\n“There should be comfortable environment and rights to make decisions that affect their health,” Adeoye said of the employees.\nSince most health challenges faced by Nigerians could be attributed to the nature of the job they do, the employers should be accountable for the healthcare of their workers to enable them to work efficiently and live longer,” Adeoye added."
  },
  {
    "headline": "NDLEA Intercepts N4.9bn Cocaine, Heroin Consignments, Arrests Suspects",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency (NDLEA), have incepted fresh consignments of Cocaine and Heroin with a combined weight of 16.85 kilograms worth over N4.9billion in street value.\nThe consignments were separately seized at the Apapa seaport and Murtala Muhammed International Airport, MMIA, both in Lagos.\nA swift follow-up operation same day led to the arrest of one Ude Onyeka Victor, at Mafoluku area of Oshodi, Lagos.\nADVERTISEMENTA second follow-up operation led to the arrest of Abanjo Innocent who came to Lagos from Delta State to pick the bag containing the drug around Cele Bus stop, Okota, on Saturday November 6.\nThe third follow-up operation led to the arrest of Ihator Theophilus Isioma at Agbor Junction, Delta State on Sunday November 7."
  },
  {
    "headline": "Ndume reveals how ISWAP killed Army General in Borno",
    "summarized_story": "Ndume, who represents Borno South in his reaction to the killing of the General, expressed his condolences and described the incident as painful.\nHe lamented that residents are fleeing Askira as ISWAP terrorists are believed to be regrouping in Lake Chad region.\nNdume said: “I want to express my condolences to the Nigerian Army over the death of the General who died along Chibok road.\nISWAP terrorists attacked a town there.\nThe insurgency is coming to an end.”He was positive that the Nigerian Army has the capability to defeat ISWAP and their Libyan mercenaries."
  },
  {
    "headline": "Ndume reveals how ISWAP killed Army General in Borno",
    "summarized_story": "Ndume, who represents Borno South in his reaction to the killing of the General, expressed his condolences and described the incident as painful.\nHe lamented that residents are fleeing Askira as ISWAP terrorists are believed to be regrouping in Lake Chad region.\nNdume said: “I want to express my condolences to the Nigerian Army over the death of the General who died along Chibok road.\nISWAP terrorists attacked a town there.\nThe insurgency is coming to an end.”He was positive that the Nigerian Army has the capability to defeat ISWAP and their Libyan mercenaries."
  },
  {
    "headline": "2023: Igbo Presidency will end agitation in South-East – Ohanaeze",
    "summarized_story": "Igbo Presidency come 2023 is possible and feasible, the apex sociocultural organisation in Igbo land, the Ohanaeze Ndigbo Worldwide, has said.\nThis is as the apex Igbo body said any attempt to scuttle the 2023 Igbo Presidential project on the altar of Biafra agitation in the region was not only devilish, but also wicked.\n“The consequences of denying the Igbo the 2023 Presidency will strengthen Biafra agitations and it will sink Nigeria’s corporate existence and threaten its unity.\n“The expectation of Igbo to achieve the desired results of having an Igbo succeed President Buhari in 2023 is ongoing.\nWe believe that the discussions through sincere engagements will change the Northern fears over 2023 Igbo Presidency."
  },
  {
    "headline": "2023: Igbo Presidency will end agitation in South-East – Ohanaeze",
    "summarized_story": "Igbo Presidency come 2023 is possible and feasible, the apex sociocultural organisation in Igbo land, the Ohanaeze Ndigbo Worldwide, has said.\nThis is as the apex Igbo body said any attempt to scuttle the 2023 Igbo Presidential project on the altar of Biafra agitation in the region was not only devilish, but also wicked.\n“The consequences of denying the Igbo the 2023 Presidency will strengthen Biafra agitations and it will sink Nigeria’s corporate existence and threaten its unity.\n“The expectation of Igbo to achieve the desired results of having an Igbo succeed President Buhari in 2023 is ongoing.\nWe believe that the discussions through sincere engagements will change the Northern fears over 2023 Igbo Presidency."
  },
  {
    "headline": "Sani Dangote is dead",
    "summarized_story": "Sani Dangote, the younger brother of Africa’s richest man, Aliko Dangote has died in the United States after a protracted illness.\nHe was the Vice President of Dangote Group.\nHe also sat on the Board of several other companies, including Nigerian Textile Mills Plc, Nutra Sweet Limited, Gum Arabic Limited, Dangote Textile Mills Limited, Alsan Insurance Brokers, Dan-Hydro Company Limited, Dansa Food Processing Company Limited and Dangote Farms Limited.\nIn recognition of his sterling leadership qualities, he was appointed as the Consul-General of the Romanian Embassy in Nigeria.\nSani was a member of several Chambers of Commerce, a Fellow of the Chartered Institute of Shipping of Nigeria and President of the Fertiliser Producers and Suppliers Association (“FERSAN”)."
  },
  {
    "headline": "44 newcomers make Forbes 400 richest list, Trump still out",
    "summarized_story": "By Alex EnebeliAmerican business magazine, Forbes, said 44 newcomers joined its list of 400 richest people in 2021, a post on its verified Instagram page @Forbes, on Sunday, said.\nAccording to the magazine, the 400 richest people are now 40 per cent richer than they were last year, worth a collective $4.5 trillion.\nThose ranks had been bolstered by the addition of 44 new entrants, the highest number of newcomers since 2007.\n“This included technology stocks, cryptocurrencies and other assets that have thrived in the COVID era.\nThe magazine on Oct 5 reported that the former US President Donald Trump was now worth an estimated $2.5 billion, leaving him $400 million short of the cutoff to make this year’s Forbes 400 list."
  },
  {
    "headline": "Wike says Rivers running Jesus economy, donates N30m to church",
    "summarized_story": "His Excellency will always say, this State is a Christian State, and this State is running a Jesus economy.\nIn the Jesus economy, you give a little to the work of God and God multiples that little you have given in a million fold.\nThe APC government was already here, and then we came in from Abuja as minister to take over administration of Rivers State as governor.\nIt was election between the military and the people of Rivers state.\nOkhifoh said the Church of Christ in Nations intends to build a non-commercial clinic and school in the landed property in Port Harcourt."
  },
  {
    "headline": "How EKOEXCEL accelerated students’ literacy performance – LASUBEB Chairman",
    "summarized_story": "Executive Chairman, Lagos State Universal Basic Education Board (LASUBEB), Wahab Alawiye-King has said the state’s EKOEXCEL project has accelerated students’ literacy and numeracy performance in the last two years.\nAlawiye-King spoke at the quarterly meeting of the Universal Basic Education Commission (UBEC) management with executive chairpersons of SUBEB which held in Benin City, Edo State.\nHe added: “EKOEXCEL has dramatically accelerated student literacy and numeracy performances in two short years, with significant differences between student performances in EKOEXCEL schools and their peers in traditional schools.\nLASUBEB’s Permanent Board member and oversight chair of EKOEXCEL, Bayo Adefuye also expressed hope that the intervention of the programme would become more popular and adopted by all.\n“Lagos wants to be an exemplar and trailblazer, and though Edo State started first, we are making appreciable progress that others can learn from too,” he said."
  },
  {
    "headline": "Ogun NUJ Chairman, Amosu Is Dead",
    "summarized_story": "Soji Amosu, the Chairman of the Nigeria Union of Journalists (NUJ) in Ogun State, has died.\nOn Sunday, Amosu, a National Orientation Agency (NOA) employee, died.\nThe NUJ’s Assistant Secretary in Ogun State, Abiodun Taiwo, confirmed the tragic death to DAILY POST.\nAmosu died after a brief illness, according to Taiwo, who expressed shock over what he called “an irreparable loss.”Amosu was born on June 22, 1968, in Oke-Ore, Yewa South Local Government Area, Ogun State.\nIn 2019, the Mass Communication graduate was chosen Chairman of the Ogun NUJ, while also serving as the council’s Secretary."
  },
  {
    "headline": "IPOB Threatens Southeast Govs To Release Detained ‘Biafran Youths’ Or They’ll Face Wrath",
    "summarized_story": "IPOB, the Indigenous People of Biafra, called on Southeast governors on Sunday to release all “Biafran youths” detained in the area.\nIPOB warned that if the governors of the Southeast do not ensure the release of these youths, they will face the wrath of the people of the region.\nThe separatist group’s spokesman, Emma Powerful, issued the warning while criticizing the detention of innocent teenagers and labeling them as ESN operatives.\nThe Southeast continues to be plagued by murders, kidnappings, and property devastation, according to the powerful.\nWhat wickedness to keep a lady about to wed in detention for committing no crime other than being a Biafran!"
  },
  {
    "headline": "N20.3bn Debt: Yet Again Bank Drags Nestoil Boss, Ernest Azudialu-Obiejesi To EFCC",
    "summarized_story": "According to Thecitypulsenews, Nigerian billionaire Ernest Azudialu-Obiejesi, chairman and chief executive officer of Nestoil Group, is in difficulty again for unpaid debt and non-servicing loan.\nRecall that the EFCC sealed his sprawling home on Modupe Alakija Crescent, formerly known as Ikoyi Crescent, a few weeks ago.\nThe ultra-modern building was marked with the anti-graft agency’s trademark red writing, suggesting that it was being investigated.\nAccording to recent reports, one of Nigeria’s new generation banks has relaunched its legal struggle against Azudialu-Obiejesi and his Nestoil Group over a N20.3 billion unpaid debt.\nNestoil Plc CEO Ernest Azudialu-ObiejesiNestoil is a Nigerian company that provides engineering, procurement, and construction (EPC) services to the oil and gas industry."
  },
  {
    "headline": "Kadhafi’s Son, Seif Al-Islam, Registers To Run For Libya Presidency",
    "summarized_story": "According to the electoral commission, Seif al-Islam Kadhafi, the son of dead Libyan dictator Moamer Kadhafi, registered to compete in the country’s December presidential elections on Sunday.\n“Seif al-Islam Kadhafi submitted… his candidacy for the presidential election to the High National Electoral Commission office in the (southern) city of Sebha,” a statement by the commission said.\nIt said he had completed “all the required legal conditions” and that he was also issued with a voter registration card for the Sebha district.\nSeif al-Islam, 49, came out of the shadows in July, telling The New York Times that he was contemplating a political comeback.\nThe International Criminal Court has issued an arrest warrant for the dictator’s former heir apparent for crimes against humanity (ICC)."
  },
  {
    "headline": "Breaking: Victor Osimhen, Ahmed Musa score as Super Eagles overpower Liberia in World Cup qualifier",
    "summarized_story": "Napoli striker Victor Osimhen and captain Ahmed Musa were on scoresheet as Nigeria’s Super Eagles beat Lone star of Liberia 2-0 in a World Cup qualifying match.\nThe game was decided in Tangier Morocco.\nSuper Eagles next match will be against Cape Verde that also won their encounter versus Central African Republic 2-1.\nDetails loading…"
  },
  {
    "headline": "LIVE: Ighalo dropped, Ekong captains as Rohr rolls out Super Eagles squad vs Liberia in World Cup qualifier",
    "summarized_story": "Odion Ighalo will not taste action when Super Eagles of Nigeria clash versus the Lone star of Liberia in faraway Morocco.\nDetails on the list is captured in the pictorial presentation above."
  },
  {
    "headline": "Pictures: Police dominate medal table as curtains fall on IGP Open Weightlifting Championship",
    "summarized_story": "Kogi state’s Elizabeth Ada Ayimba won gold in the 49kg women category while Uyai Aniefiok from Akwa Ibom Police Command won silver.\nIn the 55kg for women, Marvelous Ibe from FCT won gold; Olajimoke Oribamise from Ekiti State Police Command won silver while Glory Iheacho from Rivers State Police Command won bronze.\nThe gold medal in 76kg for women went to Chinonso Aniebunwa from Lagos State Command while another police lifter, Abibatu Yusuf, from Rivers State Command won the silver.\nLagos Command won gold in 81kg women category with Ifeanyi John who was the only lifter in that category.\n87kg women category gold went to Rivers State Command with Lilian Anaele whereas Ruth Galadima from Kebbi state Command won silver."
  },
  {
    "headline": "Borno Attack: Buhari Mourns Slain General, Three Other Soldiers",
    "summarized_story": "President Muhammadu Buhari has mourned the senior officer and three other soldiers that were killed in a fierce encounter with ISWAP terrorists in Borno.\nBarely 24 hours after the incident, President Buhari hailed the gallantry of the victims, saying they paid the supreme price in the insurgency war.\nGeneral Zirkusu leaves us sad and devastated.\nThe soldier in him will remain immortal.”The President also commiserated with the Chief of Army Staff, Lieutenant-General Faruk Yahaya and the Nigerian Army on the unfortunate incident.\n“I pray to the Almighty to give you and the bereaved families the strength and courage to bear this irreparable loss,” the President added."
  },
  {
    "headline": "Odili Seige: Malami Reiterates Non-Involvement, Denies Knowing Suspect",
    "summarized_story": "The Minister of Justice and Attorney General of the Federation, Abubakar Malami has again, denied any involvement in the controversial siege on the home of a Judge of the Supreme Court, Justice Mary Odili.\nHe also made further clarifications about a suspect – Lawrence Ajodo, who said he had worked previously with the AGF.\n“So, you can see clearly, the man said he was asked by the Attorney General to carry out that task.\n“There are 36 Attorneys General across the nation inclusive of the office of the Attorney General of the Federation.\nSo, if he said he has been sent by the Attorney General, the next point is to ask him, who is the Attorney General”."
  },
  {
    "headline": "Climate Change: COP26 Deal Clinched As Nations Rally To Compromise",
    "summarized_story": "Rich countries stood accused of failing at the COP26 summit in Glasgow to deliver much-needed finance to vulnerable states that are at risk of drought, rising seas, fire and storms.\nAs the final deal was clinched, a tearful Sharma said “I apologise for the way this process has unfolded.\nSurvivalThe final text urged nations to accelerate efforts to “phase down” unfiltered coal and “phase out” inefficient fossil fuel subsidies.\nLarge emitters China and India had opposed the mention of the polluting fuels, and the language in the final text was significantly more nuanced than earlier drafts.\nTeresa Anderson, climate policy coordinator at ActionAid International, said COP26 was “an insult to the millions of people whose lives are being torn apart by the climate crisis.”AFP"
  },
  {
    "headline": "Brigadier-General, Three Soldiers Killed As Military Battles ISWAP Terrorists In Borno",
    "summarized_story": "A senior officer and three soldiers have been killed in a fierce encounter with ISWAP terrorists in Borno, the Nigerian Army said on Saturday.\nAccording to a statement signed by army spokesperson Brigadier-General Nwachukwu, the encounter took place in Askira Uba Local Government Area of Borno State.\n“The Chief of Army Staff Lt Gen Faruk Yahaya deeply commiserates with the families and relations of the fallen heroes.\n“We thank these fallen heroes for their supreme sacrifices to the Nigerian Nation.\nThe people of Borno will remain forever grateful to them and all fallen heroes, and will remain fully supported of gallant troops currently operating in front lines.”"
  },
  {
    "headline": "11 Kidnap Victims Regain Their Freedom In Katsina",
    "summarized_story": "At least 11 persons who had been abducted in the last two days at Sabon Garin Safana village in Safana Local Government Area of Katsina State have finally regained their freedom.\n“DPO Kankara and team swiftly responded to the distress call and chased after the hoodlums.\nThe team intercepted the bandits at Danmarabu village and engaged them in a gun duel.\n“The bandits escaped into the forest, abandoning all the rustled animals, comprising 38 cows and 11 sheep.\n“The team also recovered one Bajaj operational motorcycle belonging to the bandits."
  },
  {
    "headline": "Nigeria ranks among top 10 criminal markets for trafficking, drug market- Report",
    "summarized_story": "Nigeria has been ranked among the top ten criminal markets in the world for human trafficking, firearms, illicit cannabis and heroin trade, fauna crimes, synthetic drugs, and non-renewable resource crimes by the Global Organized Crime Index for 2021.\nThe report states, “In breaking down criminality and looking at the 10 criminal markets covered, the global average was slightly lower at 4.65, with human trafficking determined to be the most pervasive worldwide (with a global average of 5.58).\nIndeed, human trafficking features in the top five criminal markets of every continent in the world.\nThe Index data further shows that, as with criminal markets, East Africa is home to the most influential criminal actors on the continent, driven predominantly by state-embedded actors.\nThe report reads, “Criminal networks are also prevalent across all regions in Africa, but none more so than in East Africa (6.83) and West Africa (6.43)."
  },
  {
    "headline": "APC releases timetable for Ekiti, Osun governorship polls",
    "summarized_story": "The ruling All Progressives Congress (APC) has released its timetable and schedule of activities for the governorship elections in Ekiti and Osun states scheduled for next year, 2022.\nAccording to the Party’s official notice signed by the National Secretary of the Caretaker/Extraordinary Convention Planning Committee (CECPC), Sen. John James Akpanudodehe, sale of nomination forms will begin on the 16th for Ekiti state and 18th for Osun state, November 2021.\nThe Independent National Electoral Commission (INEC) had earlier fixed June 18, 2022 for Ekiti governorship election and July 16, 2022 for the same exercise in Osun state."
  },
  {
    "headline": "Rising cost of cooking gas, electricity tariffs will compound Nigeria's problem- CAN",
    "summarized_story": "The Christian Association of Nigeria has warned the Federal Government that rising electricity and cooking gas prices will worsen the economic hardship of Nigerians.\nAccording to CAN, the General Assembly has approved a new (amended) constitution, which will be signed into law by President Samson Ayokunle on February 25, 2021.\nThese were among the resolutions passed by the Christian Association of Nigeria (CAN) following its 4th quarterly National Executive Council meeting at the National Christian Centre in Abuja.\n“CAN also enjoins the NCDC to be consistent about the information it puts on its website.\nIt particularly noticed that the telephone numbers on its website are not functioning."
  },
  {
    "headline": "SERAP petitions UN over ‘vicious assault on Justice Mary Odili’",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) has petitioned the United Nations in response to what it calls a vicious assault on Justice Mary Odili.\nThe investigation’s findings must be made public, and the suspected perpetrators and their backers must be prosecuted.”SERAP’s petition followed the recent invasion of Justice Odili’s Maitama, Abuja residence by armed personnel.\nThese attacks are putting Nigerians’ freedoms at risk.”According to SERAP, “The current investigation by the Nigerian police fails to meet international standards, as it is neither independent nor effective.\nThere have been several violations of judicial independence and the rule of law in the country.\nThe principles of independence are the hallmarks of the rationale and the legitimacy of the judicial function in every State."
  },
  {
    "headline": "Nigeria Under-Produced Crude Oil by 72.6m Barrels in 10 Months",
    "summarized_story": "Though 2020 was a tumultuous year for the global oil and gas industry, Nigeria produced more crude oil last year than the corresponding period of 2021.\nThe NURPC figures showed that while total crude oil and condensate of 65.9 million barrels were produced in January last year, it declined to 53 million barrels during the same period this year, a difference of a whopping 12.9 million barrels.\nFurthermore, 62.4 million barrels of both crude oil and condensates were produced in February 2020; 65.8 million barrels in March; 62.9 million barrels in April; 55.3 million barrels in May; 51.4 million barrels in June; 52.7 million barrels in July; 52.8 million barrels in August; 50 million barrels in September and 52.3 million barrels of both condensates and crude oil in October.\nIn contrast, in February this year, 49.3 million barrels of both liquid types were pumped; 54.2 million barrels in March; 50.6 million barrels in April, 51.4 million barrels in May; 49.1 million barrels in June; 50.8 million barrels in July; 47.4 million barrels in August; 45.9 million barrels in September and 47.2 million barrels in October.\nThe data showed that Nigeria’s crude oil production declined from 55.1 million barrels in January 2020 to 42.1 million barrels in 2021 and from 52.1 million barrels in February 2020 to 39.8 million barrels in February 2021."
  },
  {
    "headline": "18 Days after Launch, CBN’s eNaira Registers 488,000 Subscribers in 160 Countries",
    "summarized_story": "Barely 18 days after its launch, 488,000 consumer wallets have been on-boarded to Nigeria’s Central Bank Digital Currency (CBDC) platform known as the eNaira from over 160 countries through Google Playstore and Apple Store as of Friday.\nThis is an indication of growing enthusiasm for the central bank’s digital currency, which has been described as a game-changer.\nThe digital platform had recorded about 200,000 wallets downloads in less than one day that the portal came alive.\nNigeria is the first country in Africa and one of the first in the world to introduce digital currency.\nHe added: “Therefore, the eNaira is Nigeria’s CBDC and it is the digital equivalent of the physical Naira."
  },
  {
    "headline": "Nigeria: Monitoring Direct Primaries Has Financial, Security Implications, INEC Says",
    "summarized_story": "The commission further explained that monitoring the direct primaries of the 18 political parties registered so far would involve much staff.\nHowever, the state governors, who are opposed to direct primaries, had expressed fear over the logistical problems it would create for the commission.\nSpeaking to THISDAY on Saturday night, INEC’s National Commissioner in charge of Voter Education and Information, Mr. Festus Okoye, acknowledged that the monitoring of the direct primaries of the 18 registered political parties has security and financial implications.\n“The monitoring of direct primaries has financial and national security implications.\nOkoye further noted that INEC will aggregate the figures and design a continuity framework and matrix for monitoring of direct primaries."
  },
  {
    "headline": "12 Dockworkers in NDLEA Net for Alleged Link to N9.5bn Seized Cocaine at Lagos Port",
    "summarized_story": "The National Drug Law Enforcement Agency, NDLEA on Saturday said it is holding 12 dockworkers at the Apapa seaport in Lagos for an alleged link to the importation of 32.9 kilogrammes of cocaine worth over N9.5 billion in street value.\nA thorough search of the ship led to the recovery of 30 parcels containing cocaine, which weighed 32.9kg.\nIn line with the intelligence available to the Agency, there is a syndicate of dockworkers, crew members with apparent international conspirators who work in synergy to traffic in the illicit substances.\nWhile the substances are concealed in the shipment from the originating Port, the dockworkers assist to pick up the illicit consignment for onward delivery to the Nigerian drug barons.\nAlready, two dockworkers are now on the run, after absconding from their place of work, since the beginning of the investigation."
  },
  {
    "headline": "Super Eagles Shoot Down Liberia’s Lone Star, Set Sights on Cape Verde’s Sharks",
    "summarized_story": "Both teams spent much of the time sizing each other up, with the Super Eagles failing to seize on the momentum offered by the first goal to dominate and out-muscle the ‘hosts’ in front of an empty arena.\nThe Lone Star showed some sparkle and got behind the Eagles rearguard on two occasions only to be denied by an alert Maduka Okoye.\nWorkhorse Moses Simon toiled at the fore and at the rear throughout to keep the right side of the Super Eagles going.\nIn the 28th minute, the Super Eagles thought they had scored a second when defender Jamilu Collins strung the ball past de Souza, only to be ruled off-side by Tunisian referee Youssef Essrayri.\nOsimhen, energetic and vibrant, should have made it two for Nigeria minutes later, but shot into the sky with only de Souza to beat."
  }
]