[
  {
    "headline": "Uba plans appeal of disqualification as APC candidate over illegal primary",
    "summarized_story": "Onyia also accused the All Progressives Grand Alliance in Anambra, of doing everything possible to derail Uba’s attempt to upturn the governorship election result at the election petitions tribunal.\nOnyia said, “We are not surprised that APGA members are celebrating the Justice Ekwo judgment like a child that received Christmas clothes from his father.\nThey believe that the judgment will stop Andy Uba from proving his petition at the tribunal.\nJust ignore them.”The court had nullified the APC governorship primary in Anambra State, insisting that Uba’s emergence as winner was illegal.\nJustice Ekwo therefore stated that Uba’s participation in the November 6 governorship election was void."
  },
  {
    "headline": "ASUU, others issue 24-hour deadline to Fayemi on N3.17bn payment, threaten strike",
    "summarized_story": "Workers of tertiary institutions in Ekiti State have given the state government till Tuesday morning to release their unpaid five months subventions amounting to N3.172bn.\nHe said, “Succinctly put, we demand that the five months subventions due to all subventing institutions in Ekiti State amounting to just N3.172billion be released within the next 24 hours.\nAll rights reserved.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "Nigeria’s crude oil exploration looses steam",
    "summarized_story": "He said the objective of the Act was to attract investments to Nigeria’s oil and gas sector and optimise the nation’s hydrocarbon resources for national development.\nAccording to him, the PIA was aimed at increasing the nation’s oil and gas reserves and reduction in operating costs in the country.\nHe also said the commission has the responsibility of technical, operational and commercial regulation of upstream petroleum operations in Nigeria.\nHe maintained that the goal of the commission was to function as a 21st century regulator by promoting an enabling environment for investment in upstream petroleum operations.\nKomolafe added that the Commission would however; ensure strict implementation of environmental policies, laws and regulations for upstream petroleum operations."
  },
  {
    "headline": "Wizkid was never attacked in Warri — Jollof",
    "summarized_story": "WizkidBy Jimitota OnoyumeA popular comedian in Warri , Freedom Okpetoritse aka Jollof, has dismissed as untrue some opinions on the streets of Warri ,Delta State that Grammy star Wizkid was attacked in the oil rich city of Warri, Delta State.\nJollof in a video online warned bloggers to stop destroying Warri, saying the show the music icon came for weekend was very successful.\nContinuing, he said the music icon would do a return show to Warri next year again.\nJollof further appealed to investors to build five star hotels in the oil rich city, saying there was urgent need to step up the hospitality industry in the city.\nIt would be recalled that the city went was agog on Saturday when news went round that the Grammy star was in Warri for a live show at the Warri stadium."
  },
  {
    "headline": "FOREX: Turnover in I&E window faces decline",
    "summarized_story": "The transaction volume ended 2020 at $33 billion, indicated that 2021 short fall is about $5.4 billion as at end November.\nThe first quarter 2021, Q1’21, was, however, the weakest at $3.7 billion, while second quarter, Q2’21, recorded massive surge to $6.64 billion.\nThe Q3’’21 also recorded massive increase to $9.91 billion.\nMeanwhile, the naira depreciated by N24.82 kobo in the window during the review period.\nData from FMDQ showed that the indicative exchange rate for the window fell to N415.07 per dollar as at November ending from N39025 per dollar on January 1st, 2021."
  },
  {
    "headline": "Sigma Pensions commits to 50% lump sum",
    "summarized_story": "By Rosemary IwunzeSigma Pensions Limited says it is committed to meeting its customer’s expectation and remains wholly guided by the law governing pension administrations in Nigeria.\nThe Pension Fund Administrator (PFA) is reacting to the judgment at the National Industrial Court granting retirees’ access to 50 percent lump sum of their Retirement Savings Account (RSA) balance at retirement.\nPursuant to this mandate, PenCom on a regular basis issues directives and guidelines to govern the activities of Pension Fund Operators (PFOs) and PFOs are to strictly adhere to these guidelines.\n“In line with this mandate, PenCom has provided Pension Fund Administrators (PFAs) with a Programmed Withdrawal Template (PWT), a benefits computation tool.\nThis template is used by PFAs to calculate and arrive at the amount, which a retiree may receive as lump sum and as programmed withdrawal over the course of their life, (except for annuity purchase)."
  },
  {
    "headline": "UBA customers to win big in Super Savers promo draw",
    "summarized_story": "The United Bank for Africa (UBA) Plc has assured its loyal customers of a memorable Christmas as the bank is set to reward thousands of them with prizes in its upcoming super saverspromo draw.\nThe draw will be held virtually today through Facebook and Youtube platforms where 23 Bumper account holders will smile home after a transparent draw in several categories including; N2 million, N1.2 million, N500,000 and N100,000 cash prizes.\nUBA always walks the talk at all times and never relents in helping its customers succeed.\nOur customers are special to us, and this is another opportunity to prove just that, she said”.\nUBA’s Head of Marketing, Diana Ubah, noted that she is excited about the ‘Super Savers draw’ particularly because it is a Christmas edition, and the bank has spared no stone to truly ensure that customers new and existing celebrate this yuletide in a very big way with their loved ones and family."
  },
  {
    "headline": "BREAKING: Nigeria enters COVID-19 fourth wave",
    "summarized_story": "The Nigeria Centre for Disease Control, NCDC has said that the country is currently experiencing a fourth wave of coronavirus disease following the recent surge in cases and deaths.\nHe said the development was sequel to the 500 per cent increase in the number of cases being recorded in the past two weeks.\nThe statement read, “Nigeria has recorded a 500% increase in the number of confirmed COVID-19 cases over the past two weeks across the country caused by the Delta and Omicron variants.\n“The country is now in a fourth COVID-19 wave.\nTherefore, individuals, families and institutions also need to play their part in protecting each other by ensuring adherence to COVID-19 public health and social measures."
  },
  {
    "headline": "Kwara decries kidnap for ransom menace in Nigeria",
    "summarized_story": "He made the call at the commencement of the 2021/2022 new legal year, valedictory court session for retiring judges, presentation of newly appointed Kwara state high court judges and unveiling of the new high court procedure rules in Ilorin on Monday.\nJawondo, who condemned the menace of kidnapping for ransom in the country, described the crime as a veritable source through which state funds are siphoned under the pretext that the demands of the kidnappers must be met to save the lives of the kidnap victims.\n“The wake of insecurity in our country is more than a challenge, as no one can sleep with the two eyes closed.\nIn his speech, the Chief Judge of the state, Justice Durosylorun Suleiman Kawu, called for enactment of the judiciary autonomy law in the state.\nAlso speaking, a legal icon, Malam Yusuf Ola-Olu Ali, SAN, urged law enforcement agencies to do more in the fight against crime to save lives and property."
  },
  {
    "headline": "Buhari withholds assent to Electoral Amendment Bill, gives reasons",
    "summarized_story": "As deadline for the expected presidential assent to the Electoral Act (Amendment) Bill, 2021, elapsed last Friday, report reaching DAILY POST indicates that President Muhammadu Buhari has written to the National Assembly, explaining reasons he didn’t assent to the bill.\nThe President pointed out the high cost of conducting primary elections as reasons he withheld assent to the bill.\nBuhari also cited heightened insecurity as another reason, saying that it would be too risky to monitor direct primary elections, which may result in violation of people’s rights.\nAccording to him, small political parties that lack capacity and structure would be marginally denied which he said, he has taken his time to study the bill and wasn’t in the interest of the country.\nDAILY POST is monitoring the situation and would bring details after the plenary on Tuesday."
  },
  {
    "headline": "Two Islamic clerics kidnapped in Ogun, N15 million ransom demanded",
    "summarized_story": "Some gang of kidnappers have made away with two Islamic clerics in Ayetoro, Yewa North Local Government Area of Ogun State.\nThe kidnappers had stormed the residence of their victims, ate some eba with the pieces of meat in their pot before taking them away.\nHe disclosed that the kidnappers contacted the family and demanded N15 million as ransom for the release of the abductees.\nContacted, the Ogun police spokesman, DSP, Abimbola Oyeyemi confirmed the incident, saying the police and other security agencies including the local hunters have launched a search party for the clerics.\nOur men have been there with others including local hunters combing the bush."
  },
  {
    "headline": "Electoral Act: You lack capacity to veto Buhari – Wike tells NASS, reveals APC’s plans",
    "summarized_story": "The Governor of Rivers State, Nyesom Wike, has lambasted the national assembly, saying that the current lawmakers lack the courage to veto President Muhammadu Buhari into signing the Electoral Act Amendment Bill.\nThe Governor said he had already alerted Nigerians that President Buhari would not sign the Electoral Act amendment bill into law.\n“Three weeks ago I told Nigerians that there is a conspiracy not to have a free, fair, transparent election in 2023 and that conspiracy was very clear.\nAnd I told Nigerians, Mr President will not sign the Electoral Act amendment bill,” he said.\nNobody in the National Assembly, not even the leadership can have what it takes to say “Mr President, for the interest of Nigerians we are going to veto this your refusal,’” he said."
  },
  {
    "headline": "‘Monarch accused me of being too stingy with money’",
    "summarized_story": "‘Monarch accused me of being too stingy with money’As governor of Osun State, Chief Bisi Akande had problems with the immediate past Ooni of Ife, Oba Okuade Sijuwade, and the Owa-Obokun of Ijeshaland, Oba Adekunle Aromolaran.\nHe also said Oba Aromolaran was always saying bad things about him because of his belief that he was stingy.\nI told him that Osun State had no money now to buy cars for traditional rulers.\n- Advertisement -“But his pestering was too much and I secretly sent money to him to buy a car.\nHe explained that the late Ooni wanted him to renew the Ede-Osogbo Waterworks which was to be repaired with $300 million."
  },
  {
    "headline": "‘I told Obasanjo he must be out of his mind when he blamed me for Ige’s murder’",
    "summarized_story": "‘I told Obasanjo he must be out of his mind when he blamed me for Ige’s murder’A former Osun State Governor Chief Bisi Akande has relived his confrontation with ex-President Olusegun Obasanjo when Chief Bola Ige (SAN) was murdered while serving as Attorney-General of the Federation and Minister of Justice.\nAkande, in his autobiography ‘My Participations’ said he had just returned from the United Kingdom when he was told of the murder.\n- Advertisement -“How can you say lapses in my security when Bola Ige was killed in Ibadan?\nI rule in Osun State!\n“It was President Obasanjo on the other end."
  },
  {
    "headline": "Akande: I’ve never seen anything genuine in Obasanjo",
    "summarized_story": "Akande: I’ve never seen anything genuine in ObasanjoA former Osun State Governor and first National Chairman of the All Progressives Congress (APC) Chief Bisi Akande has said he has never seen anything genuine in ex-President Olusegun Obasanjo.\nAkande, in his book, ‘My Participations’, narrated several instances of Obasanjo’s alleged attempts to bring him down.\nAkande said during the centenary celebration of the Baptist Church in Abeokuta, Obasanjo announced that he was “an example of a prudent and honest governor”.\n- Advertisement -“I have never seen anything genuine about him despite his self-glorification,” Akande wrote.\nHe accused Obasanjo of ordering that Osun State should be short-paid by N216 million monthly from the Federal Allocation."
  },
  {
    "headline": "Adebanjo: how l built my Lekki house",
    "summarized_story": "The Afenifere leader urged the anti-graft agency to probe how Akande built his houses at Ila, his home town in Osun State, and Ibadan, the Oyo State capital.\nDescribing Akande’s allegations as “malicious falsehood”, Adebanjo challenged the former Osun State governor to disclose how he got his own property as he had done.\nGiving details of how he built his house, Adebanjo said: “I deny the lie propagated by Akande.\nHe said: “On the Osun State Governor’s Office (Bola Ige House) contract, Chief Akande said I wrongly accused him of corruption in the construction of the Governor’s Office.\n“Chief Akande wrote on the Government House that he wanted to build on a site on Ilesa Road in Osogbo, which I stopped."
  },
  {
    "headline": "‘Tinubu refused to release Aregbesola to be my deputy’",
    "summarized_story": "Akande, in his book, ‘My Participations’, narrated how he came across Aregbesola and wanted him first as his deputy and possible successor.\nThat was how we linked up with Rauf Aregbesola,” Akande recalled.\nWhen Omisore was impeached, he discussed with Tinubu about having Aregbesola as his deputy.\n“I offered him the post of deputy governor which would be confirmed by the House of Assembly.\nHe added that Tinubu said after the election, Aregbesola would come to learn more about Osun and its politics."
  },
  {
    "headline": "Buhari withholds assent from electoral bill",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has withheld his assent to the Electoral Act (Amendment) Bill 2021.\nPresident Buhari also noted that adopting direct primaries also has implications on the rights of citizens to participate in the government, as constitutionally insured.\nThe president further stated that security agencies will also be overstretched, as direct primaries will be open to participation from all and sundry.\nMeanwhile, the Presidency has said the National Assembly is free to make public President Muhammadu Buhari’s reasons for withholding assent to the Electoral Act Amendment Bill 2021.\nAccording to Senior Special Assistant on Media and Publicity, Garba Shehu, ‘The President has sent a letter to the National Assembly stating his position on the bill amending the electoral act."
  },
  {
    "headline": "BREAKING: IPOB vows to frustrate the return of Ebubeagu",
    "summarized_story": "From Stanley Uzoaru, OwerriThe proposed launch of the Ebubeagu security outfit may have hit a brickwall following threats by the Indigenous People of Biafra(IPOB) to resist every attempt by the south east governors to rekindle the security outfit.\nHe further claimed that Ebubeagu is only being used as a spy by the governors of the south east to cause tension in the zone and later blame it on IPOB.\n“South East governors have no plan to protect our land but formed Ebubeagu to attack ESN and IPOB members.\n“ESN/IPOB are ready to resist them anytime they are re-launched, and Biafrans should hold George Obiozor and Ohaneze Ndigbo responsible for anything that happens.\n“Many IPOB and ESN operatives tracked and killed were done by Ebubeagu sponsored by south east governors and this time around, it is not going to be business as usual."
  },
  {
    "headline": "BREAKING: Protesters storm APC headquarters, demand February Nat Convention",
    "summarized_story": "From Romanus Ugwu, AbujaProtesters, numbering over 50, on Monday stormed the headquarters of the All Progressives Congress (APC), demanding that the February National Convention of the party, remains sacrosanct.\nThe protesters who arrived the national secretariat of the ruling party when the Caretaker/Extraordinary Convention Planning Committee are holding a meeting, were stopped by the combined team of security agents and the party’s internal security.\nIn a big banner, chronicling their demands, the protesters equally urged the Governor Mai Mala Buni-led Caretaker/Extraordinary Convention Planning Committee, to leave when the ovation is loudest.\n“We can no longer continue to stay on the sideline and watch things deteriorate to this extent.\nOur mission here is to press it on the leadership of the party to ensure that the National Convention is conducted unfailingly in February,” he said."
  },
  {
    "headline": "Electoral Bill: Lawmakers talk tough as Buhari withholds assent within deadline",
    "summarized_story": "From Fred Itua and Ndubuisi Orji, AbujaPlans by senators and the House of Representatives to override President Muhammadu Buhari’s veto on the Electoral Amendment Bill may have hit a dead end.\nHowever, Daily Sun gathered that some lawmakers across party divide would not let the rejection go without a fight.\nThe signing of the Electoral Amendment Bill by President Buhari, elapsed yesterday, having clocked the mandatory 30 days, within which the president must communicate to the National Assembly on his decision regarding any Bill passed by the parliament.\nHe further revealed that the National Assembly is already divided along regional lines on the issue of direct primaries and electronic transmission of results from polling units.\nThe top government official said many northern lawmakers would side with Buhari if the National Assembly makes any move to override him."
  },
  {
    "headline": "Again, bandits kill 38, burn houses in Kaduna",
    "summarized_story": "From Noah Ebije, KadunaNo fewer than 38 persons were killed and several property destroyed by bandits, yesterday, in Giwa Local Government Area of Kaduna State.\nThe killings came on the heels of nine people killed by bandits in Kaduna communities about three days ago.\n“The governor also commiserated with the affected communities and directed the Kaduna State Emergency Management Agency to conduct an urgent assessment of the area towards providing relief.\n“The identities of the victims will be published once further details are confirmed by the Kaduna state government.\nHe said: “Following the report of attacks by bandits across villages in Idasu, Giwa LGA, contained in an earlier update, security agencies have confirmed to the Kaduna State Government that 38 people were killed across the locations attacked."
  },
  {
    "headline": "Breaking: Buhari Writes National Assembly, Gives Reasons for Withholding Assent to Electoral Amendment Bill",
    "summarized_story": "Tobi SoniyiPresident Muhammadu Buhari has withheld his assent to the Electoral Act (Amendment) Bill 2021.\nIn a letter to the Senate President, Ahmed Lawan, exclusively obtained by THISDAY, the president said that prevailing situation in the country would not allow him to sign the bill.\nAmong other reasons for rejecting the bill, the president cited high cost of conducting direct primaries, the security challenge of monitoring the election, violation of citizens’ rights and marginalization of small political parties.\nThe president said that it would be better to allow each political party to determine its mode of selecting candidates for election.\n*Watch out for details on Arise TVShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Court Voids APC’s Participation in Anambra Guber Poll over Unlawful Primary",
    "summarized_story": "Disqualifies Andy UbaAlex Enumah in AbujaJustice Inyang Ekwo of the Federal High court, Abuja on Monday voided the participation of the All Progressives Congress (APC) in the just concluded Anambra governorship election.\nJustice Ekwo in a judgement held that the primary election of the APC that produced Senator Andy Uba as flag bearer of the party, substantially failed to comply with the electoral guidelines for the conduct of governorship primary election as well as the APC’s guidelines and constitution.\nThe judge subsequently disqualified Andy Uba and the APC from participating in the November 6 governorship poll, won by Professor chukwuma Soludo of the All Progressives Congress Alliance (APGA).\nDetails later.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Supreme Court Sets Aside Conviction of Senior Lawyer, Nwobike",
    "summarized_story": "The Supreme Court has set aside the conviction and 30 days sentencing of a Senior Advocate of Nigeria (SAN), Dr. Joseph Nwobike.\nHe was charged with attempt to pervert the course of justice.\nIn a unanimous decision on Monday, a five-member panel of the Supreme Court, led by Justice Olukayode Ariwoola, faulted the earlier decisions of the Lagos High Court and the Court of Appeal, Lagos, and proceeded to uphold Nwobike’s appeal.\nIt held among others that the High Court of Lagos was wrong in convicting Nwobike for the offence.\nThe apex court also said the Court of Appeal erred in upholding his conviction and sentencing for the offence of attempt to pervert the course of justice."
  },
  {
    "headline": "On Deadline, Buhari Fails to Reject Electoral Act Amendment Bill",
    "summarized_story": "The National Assembly once exercised this overriding power in the case of the Niger Delta Development Commission Bill.\nIn withholding his assent, President Buhari gave such reasons infractions on extant laws, duplication of responsibilities of existing agencies, and financial constraints owing to prevailing economic circumstances.\nThey had since launched an offensive against direct primaries, urging the president not to sign the amended electoral act bill.\nFrom Monday morning, we will turn to the National Assembly to act in the national interest and pass the bill expeditiously before they embark on the Christmas recess.\nThe Ninth National Assembly has the opportunity of not sharing with the executive, the glory that will accompany the new act.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Rampaging Terrorists Kill 38 in Kaduna Communities",
    "summarized_story": "The president, who just got back from a three-day visit to Turkey, returned to the news of some 38 persons, reportedly killed in some communities in Kaduna State by bandits and stressed that killing of innocent citizens were no more acceptable.\nAlso, the Commissioner for Internal Security and Home Affairs in Kaduna State, Samuel Aruwan, who disclosed the latest killings in a statement, confirmed that no fewer than 38 people were killed in Giwa Local Government Area of the state.\nBuhari, while condemning the renewed killings in Kaduna State, said the gruesome nature of recent incidents in Kauran Fawa, Marke and Ruhiya of Idasu Ward of Giwa Local Government Area, has made him particularly sad and the killings unacceptable.\n“The governor also commiserated with the affected communities and directed the Kaduna State Emergency Management Agency to conduct an urgent assessment of the area towards providing relief,” he said.\nThe police, in the course of investigations, identified and raided various criminal hideouts,where kidnap victims were usually kept."
  },
  {
    "headline": "BREAKING: Nigeria Records 500% Increase In Omicron, Delta COVID-19 Cases, Now In Fourth Wave Of Pandemic",
    "summarized_story": "The Nigeria Centre for Disease Control on Monday stated that Nigeria had entered the fourth wave of coronavirus disease following a 500 per cent increase in the number of cases in the past two weeks.\nThis is as the disease control centre also advised Nigerians to take caution during the Yuletide season.\nThe NCDC disclosed this in a statement signed by the Director-General, Dr. Ifedayo Adetifa, and made available on Monday evening.\nThe statement read, “Nigeria has recorded a 500% increase in the number of confirmed COVID-19 cases over the past two weeks across the country caused by the Delta and Omicron variants.\nThe government has made these vaccines available for all eligible citizens and booster doses available for those previously vaccinated."
  },
  {
    "headline": "BREAKING: Nigeria Records 500% Increase In Omicron, Delta COVID-19 Cases, Now In Fourth Wave Of Pandemic",
    "summarized_story": "The Nigeria Centre for Disease Control on Monday stated that Nigeria had entered the fourth wave of coronavirus disease following a 500 per cent increase in the number of cases in the past two weeks.\nThis is as the disease control centre also advised Nigerians to take caution during the Yuletide season.\nThe NCDC disclosed this in a statement signed by the Director-General, Dr. Ifedayo Adetifa, and made available on Monday evening.\nThe statement read, “Nigeria has recorded a 500% increase in the number of confirmed COVID-19 cases over the past two weeks across the country caused by the Delta and Omicron variants.\nThe government has made these vaccines available for all eligible citizens and booster doses available for those previously vaccinated."
  },
  {
    "headline": "#FreeSofiat: Over 300 Sign Activist, Sowore’s Online Petition Seeking Freedom For Female Soldier Detained For Accepting Marriage Proposal In Viral Video",
    "summarized_story": "The petition was initiated to force President Muhammadu Buhari and the Nigerian Army to free the female soldier.\nThe military had detained Sofiat since the video of her accepting the marriage proposal went viral last week.\nThe Nigerian Army had said the female soldier would be punished for violating military rules and regulations.\n#FreeSofiat: Release Female Soldier held in Jail over marriage proposal In Nigeria - Sign the Petition!\n“The young female soldier is being detained under unhealthy conditions in a ‘guardroom’ reportedly meant for male soldiers, according to her family."
  },
  {
    "headline": "#FreeSofiat: Over 300 Sign Activist, Sowore’s Online Petition Seeking Freedom For Female Soldier Detained For Accepting Marriage Proposal In Viral Video",
    "summarized_story": "The petition was initiated to force President Muhammadu Buhari and the Nigerian Army to free the female soldier.\nThe military had detained Sofiat since the video of her accepting the marriage proposal went viral last week.\nThe Nigerian Army had said the female soldier would be punished for violating military rules and regulations.\n#FreeSofiat: Release Female Soldier held in Jail over marriage proposal In Nigeria - Sign the Petition!\n“The young female soldier is being detained under unhealthy conditions in a ‘guardroom’ reportedly meant for male soldiers, according to her family."
  },
  {
    "headline": "#FreeSofiat: Over 300 Sign Activist, Sowore’s Online Petition Seeking Freedom For Female Soldier Detained For Accepting Marriage Proposal In Viral Video",
    "summarized_story": "The petition was initiated to force President Muhammadu Buhari and the Nigerian Army to free the female soldier.\nThe military had detained Sofiat since the video of her accepting the marriage proposal went viral last week.\nThe Nigerian Army had said the female soldier would be punished for violating military rules and regulations.\n#FreeSofiat: Release Female Soldier held in Jail over marriage proposal In Nigeria - Sign the Petition!\n“The young female soldier is being detained under unhealthy conditions in a ‘guardroom’ reportedly meant for male soldiers, according to her family."
  },
  {
    "headline": "Nigeria now in fourth wave of COVID, says NCDC",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) says the country is currently experiencing a fourth wave of the COVID pandemic.\nAdvertisementHe urged Nigerians to adhere to recommended measures stipulated by NCDC and other public health authorities as they celebrate Christmas and the new year.\n“The Nigeria Centre for Disease Control (NCDC) is launching its yuletide season campaign themed #CelebrateResponsibly as part of the #TakeResponsibility campaign which began in February 2020,” he said.\n“#CelebrateResponsibly focuses specifically on measures Nigerians needto take to protect themselves and loved ones from COVID-19 during this period.\nTherefore, individuals, families and institutions also need to play their part in protecting each other by ensuring adherence to COVID-19 public health and social measures."
  },
  {
    "headline": "Nigeria now in fourth wave of COVID, says NCDC",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) says the country is currently experiencing a fourth wave of the COVID pandemic.\nAdvertisementHe urged Nigerians to adhere to recommended measures stipulated by NCDC and other public health authorities as they celebrate Christmas and the new year.\n“The Nigeria Centre for Disease Control (NCDC) is launching its yuletide season campaign themed #CelebrateResponsibly as part of the #TakeResponsibility campaign which began in February 2020,” he said.\n“#CelebrateResponsibly focuses specifically on measures Nigerians needto take to protect themselves and loved ones from COVID-19 during this period.\nTherefore, individuals, families and institutions also need to play their part in protecting each other by ensuring adherence to COVID-19 public health and social measures."
  },
  {
    "headline": "ICPC clears Yewande Sadiku of all fraud allegations",
    "summarized_story": "The Independent Corrupt Practices and Other Related Offences Commission (ICPC) says it was unable to establish allegations of corruption against Yewande Sadiku, former CEO and executive secretary of the Nigerian Investment Promotion Commission (NIPC).\nAdvertisementIn a letter dated December 16 and addressed to the CEO of NIPC, the ICPC said it received a petition against Sadiku and some other officials of the NIPC, accusing them of mismanaging public funds.\nAdvertisementHowever, Akeem Lawal, ICPC director of operations, in the letter, said the allegations couldn’t be substantiated.\n“Upon investigation, none of these allegations was established, and the striking out of suit No FAC/ABJ/CS/249/2019 by his lordship, Hon.\nSadiku, who was appointed executive secretary/CEO of NIPC in 2016, completed her five-year tenure in September."
  },
  {
    "headline": "ICPC clears Yewande Sadiku of all fraud allegations",
    "summarized_story": "The Independent Corrupt Practices and Other Related Offences Commission (ICPC) says it was unable to establish allegations of corruption against Yewande Sadiku, former CEO and executive secretary of the Nigerian Investment Promotion Commission (NIPC).\nAdvertisementIn a letter dated December 16 and addressed to the CEO of NIPC, the ICPC said it received a petition against Sadiku and some other officials of the NIPC, accusing them of mismanaging public funds.\nAdvertisementHowever, Akeem Lawal, ICPC director of operations, in the letter, said the allegations couldn’t be substantiated.\n“Upon investigation, none of these allegations was established, and the striking out of suit No FAC/ABJ/CS/249/2019 by his lordship, Hon.\nSadiku, who was appointed executive secretary/CEO of NIPC in 2016, completed her five-year tenure in September."
  },
  {
    "headline": "'Show more empathy' -- ACF calls on Buhari, governors to visit banditry-hit communities",
    "summarized_story": "The Arewa Consultative Forum (ACF) has called on President Muhammadu Buhari and northern governors to “show more empathy” towards victims of banditry in the region.\nThe group urged Buhari, governors and northern leaders to do better and show the people they care.\nAdvertisement“The latest incidence took place in Giwa LGA of Kaduna state where 38 innocent citizens were hacked to death.\n“The President and the northern governors are unwittingly creating the impression that only their lives, those of their immediate family members and their officers matter.\n“The ACF believes the President and the northern governors have the capacity to do better than this.”"
  },
  {
    "headline": "Inside TeamApt: How an upstart overturned competition to dominate agency banking",
    "summarized_story": "After the $5.5 million raise, TeamApt had cash in the bank to place orders for terminals in China and invaded the Nigerian market.\nTo improve the reliability of its product, TeamApt introduced to the market a 24-hour resolution service for false debit card withdrawals.\nTosin Eniolorunda, founder and CEO of TeamApt, champions the thought process and is instilling it into the company culture.\nWith TeamApt seemingly to be crowned with unicorn status, the company now has its eyes on digital banking but with a slant.\nSo, we will be launching a hybrid credit-led banking solution that also caters to the offline market,” Eniolorunda concludes."
  },
  {
    "headline": "Koniku closes Series A round led by Nigeria-based Platform Capital",
    "summarized_story": "Koniku Inc., a Nigerian-founded biotech company that operates out of California, on Friday said it has closed a Series A financing round led by Nigeria-based private equity firm, Platform Capital Investment Partners.\nIn the wake of the fresh investment, four new members will be joining the company’s board of directors, including Akintoye Akindele, Chairman and CEO of Platform Capital.\nThe company’s technology combines traditional computer cells with living biological neurons to give computers power to detect odours.\nBeyond security and healthcare, Konikore has broad applications in industrial monitoring, energy, food and agriculture sectors, and more.\nThe founder is also African, intelligent, passionate, and committed to the Koniku vision,” Dr. Akintoye told TechCabal in an interview, explaining the rationale behind backing Koniku for a second time."
  },
  {
    "headline": "Want luxury fashion? Play Africa’s first metaverse crypto game",
    "summarized_story": "Digital fashion can be in the form of digital fashion conceived to produce physical garments or fashion that a person can wear only with augmented or virtual reality.\nA product of digital fashion, hyper-real fashion, is used to explain the use of tech to virtually showcase fashion products.\nThis was how Thrill Digital started Astra, a fashion crypto game where players can win real-life fashion luxury items.\nThe game would have its own crypto token, which must be connected to a crypto wallet like the popular crypto game, Axie Infinity.\nThe leading crypto game has raked in $84.9 million in funds, making its protocol profit one of the biggest in the market."
  },
  {
    "headline": "Ventures Platform launches a $40m fund, invites Seni Sulyman as venture partner",
    "summarized_story": "A sizable portion of the fund comes from local partners, Ventures Platform told TechCabal.\nThis new capital injection will enable Ventures Platform to double down on existing investments in its category-leading portfolio via subsequent rounds.\nAs part of a move to further deepen its expertise, Ventures Platform has also onboarded leading figures across African tech as Venture Partners, including Seni Sulyman (ex-VP at Andela, founder at Black Ops.)\nThis transparency helped ventures attract talents like Kayode Oyewole, partner at Ventures Platform and Fola Olatunji-David, who later left the firm to become Head of Startup Success and Service at Google.\nThis happened because people who were impressed with the performance of the firm’s portfolio companies wanted to invest in Ventures Platform."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "Blockchain-powered music and bigger investments: The next frontier for music tech",
    "summarized_story": "But after a closer look and talking to some of the industry’s brightest, the signs are there — the next frontier for music tech may be closer than we imagine.\nUltimately, he believes the music industry is worthy of the same attention investors pay to fintech or healthtech, for example.\nWhile Nigeria cannot boast such levels of investment, the state of the music industry signals that more investments could have a positive impact on the economy.\nIn terms of revenue, the music industry raked in $40 million in 2021.\nAdetunji and Okpala are optimistic about the future of African and Nigerian music, one where tech will definitely determine what the next frontier will be."
  },
  {
    "headline": "Meet the 15 semi-finalists for Pitchstorm 3.0",
    "summarized_story": "Mandila Inc: A startup based in Burkina Faso with an app built to teach and preserve African languages.\nUsing data, they provide farmers with information to plan their pre-planting, planting and post-planting operations.\nFinancial inclusionByte: A Nigerian startup replacing account numbers with a phone number, email, or a byte tag for payments in between banks and other financial institutions.\nAxocheck: A Nigerian startup with a mobile app where users can request and schedule home checkups.\nSpacehunt Inc: A Nigerian mobile app that connects renters and buyers to all of the available properties in their city."
  },
  {
    "headline": "Privacy Roundtable IV, problems in the metaverse, a Bitcoin trust fund, and AfDB’s $170 million loan",
    "summarized_story": "Thankfully 27 out of 55 countries on the continent have enacted data protection laws and regulations.\nRecently, on December 3, 2021, Zimbabwe joined the ranks of African countries with a data protection law.\nJack announces ₿trust boardTwitter ex-CEO, Jack DorseyTwitter’s ex-CEO, Jack Dorsey, has announced the board of a Bitcoin trust fund, ₿trust, he set up with American rapper and business mogul, Shawn Carter aka, Jay-Z.\nAccording to Dorsey, the four were selected among 7,000 applicants “all reviewed with purpose and rigor.” The 500 BTC trust fund was created to fund Bitcoin development in Africa and India.\nReadThe Best Metaverse Investment RIGHT NOW."
  },
  {
    "headline": "Is Flour Mills deal to acquire Honeywell made in heaven?",
    "summarized_story": "The expected combination of Flour Mills Nigeria (FMN) and the flour mills unit of Honeywell Flour Mills plc (HFMP) will form a formidable entity and an unassailable market leader in the agro-allied sector in Nigeria, according to industry players and market analysts.\nLast month, Flour Mills announced it had reached a deal to acquire the flour mills business of Honeywell in an N80 billion deal that will significantly enhance its market leadership.\nIn full year ended March 2021, the turnover for the two was N771.6 billion for Flour Mills and N109.59 billion for Honeywell Flour, and the combination will see FMN emerge as a true continental giant, amassing substantial value for shareholders and huge economic benefit for Nigeria.\nRead Also: Honeywell, Flour Mills N80bn merger to boost Nigeria’s food productionFMN, established in 1960, prides itself of being in the vanguard of feeding the nation for the past 60 years.\nUnder the deal, Honeywell Group will dispose of a 71.69 percent stake in its flour business to FMN based on an enterprise value of N80 billion and subject to approval from the appropriate regulators."
  },
  {
    "headline": "The many legal battles of Ecobank and Honeywell",
    "summarized_story": "On October 16, 2015, Ecobank filed two separate suits before Justice Abang.\nSensing that Ecobank’s lawyers might be attempting to use the administration of justice to blackmail Honeywell into submission, on April 7, 2016, Honeywell petitioned the Legal Practitioners Disciplinary Committee also known as the Body of Benchers.\nHoneywell is also in court pressing damages claim against Ecobank for harm to its interests arising from the ex-parte order granted against it and which has now been made voided by courts including the Supreme Court.\nOn July 13, 2018, justices of the Supreme Court made two rulings, both in favour of Honeywell.\nHoneywell is now asking that the court compel Ecobank to deposit the $28 million proceeds from the share sale into the accounts of the court until the determination of the substantive suit brought by Honeywell."
  },
  {
    "headline": "In Ecobank’s case with Honeywell, bank’s lawyer is biggest victim so far",
    "summarized_story": "On January 11, 2018, the Legal Practitioners Privileges Committee severely sanctioned Ogunba for professional misconduct in relation to his handling of the court cases, withdrawing from him the rank of senior advocate of Nigeria and all other privileges attached to the rank.\nAs set out above, Ogunba on behalf of Ecobank, deliberately instituted a multiplicity of actions on the same dispute, facts, grounds and between the same parties.\nRead Also: Ecobank warns FMN against Honeywell acquisition deal“It is obvious that it is Ecobank’s intention through Ogunba to harass, embarrass and disrupt the business of the Honeywell Group.\nThe damaging effect of Ecobank’s numerous mischievous suits and wrongly obtained orders is enormous and cannot be quantified.\n“Consequently, the legal practitioners’ privileges committee at its 129th plenary meeting have withdrawn the rank of senior advocate of Nigeria from Kunle Ogunba Esq and all other privileges attached to the rank forthwith.”The story has been updated."
  },
  {
    "headline": "Traditional hospital appeals for increased subvention, occupational therapy for patients – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestUgbokhirima – The management of foremost traditional healing home in Orhionmwon local government area, Ogieva Traditional Hospital have appealed to the Edo state government to increase the subvention for the facility to enable it meet up with current economic realities.\nDr. Ogieva further appealed for occupational therapy for patients, to enable them recuperate faster from their mental illness, maintaining that some of them have been long treated and are fit to be integrate back into the society.\nWith occupational therapy, they can learn and have something doing for themselves.\n“From the little we get as subvention we still manage to feed them.\nGovernment can train them on bricklaying, carpentry, block moulding, vulcanizing, infact anything that can make them useful, because they are just here despite treated”."
  },
  {
    "headline": "Obaseki: We’re leveraging technology, data to drive governance in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government is committed to building physical and digital infrastructure to drive sustainable growth and development in the state.\nObaseki, who spoke to journalists in Benin City, said his administration is leveraging technology and data to drive governance and create a workplace that inspires and motivates the state’s civil and public service to work for the Edo people.\nAccording to him, “In Edo State, we are focused on 12 thematic areas, which include reforms of government structure, making government the enabler in the society, creating a citizen-centric leadership structure and utilizing technology and data to drive governance.\nWe are also ensuring that the government focuses on sustainable economic growth and building the physical and digital infrastructure that we require for our growth.”Obaseki added, “The governance reforms pillar in our agenda is the pivot on which other pillars revolve.\n“We are utilizing technology and creating a workplace that inspires and motivates our public servants to work for Edo people.”..."
  },
  {
    "headline": "Obaseki urges love as Edo hosts students to carol of nine lessons – Nigerian Observer",
    "summarized_story": "Obaseki urges love as Edo hosts students to carol of nine lessonsShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Monday, led other top government functionaries to a special Christmas carol of nine lessons organised for students drawn from various schools across the state, with a charge for the students to show love to one another.\nThe carol in its maiden edition featured special performances from various musical, dance and choreography groups.\n; Chief of Staff to the Governor, Osaigbovo Iyoha; Edo State Chief Judge, Joe Acha; Commissioner for Local Government, Monday Osaigbovo, and Chairman of the Edo State Peoples Democratic Party (PDP), Dr. Anthony Aziegbemi, among others.\nThe event, organized by Edo State Ministry of Education, was held at Imaguero College in Benin City.\nIn his opening remark, a student of Edo College, Osayomore Osayuki, thanked the Obaseki-led state government for the love it has continued to show Edo children."
  },
  {
    "headline": "How we tackled illegal migration, trafficking with job creation-Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has revealed how his administration’s job creation initiatives and entrepreneurship programmes helped the government address the scourge of illegal migration and human trafficking among youths in the state.\nThe governor said his administration has made remarkable success in tackling human trafficking and illegal migration, noting that the government traced its root causes to address it.\nThe governor further stated, “Lack of job increased the problem of human trafficking.\nSo, while campaigning, I did what most politicians would not do; I campaigned with job creation, promising to create 200,000 jobs.\nFive years running now, we have done well in terms of job creation for Edo people.”“For any community to be great, the young people must be very hopeful."
  },
  {
    "headline": "INEC wants N305bn to conduct 2023 elections",
    "summarized_story": "Nigeria’s electoral body, the Independent National Electoral Commission (INEC) on Monday in Abuja presented a budget of N305 billion for the 2023 general elections to the National Assembly.\n“We made a submission for N305 billion for the 2023 general elections in a very comprehensive 22-page document with 260 budget lines.\n“What we have done is to look at the activities that we have to conduct before the general elections,” he said.\n“Party primaries must be conducted and concluded before the elections and names of candidates submitted, registration of voters would have to be concluded before the elections.\nMeanwhile, in his remarks, committee chairman, Jibrin Barau (APC-Kano North) said the required appropriation would be made for the electoral body in the 2022 budget."
  },
  {
    "headline": "Buhari Withholds Assent to Electoral Amendment Bill, Writes National Assembly",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has withheld his assent to the Electoral Act (Amendment) Bill 2021, noting that the prevailing situation in the country would not allow him to sign the bill into law.\nThe president who conveyed his reservations over the bill in a letter to the Senate President, Ahmed Lawan, cited high cost of conducting direct primaries, the security challenge of monitoring the election, violation of citizens’ rights and marginalization of small political parties as reasons for withholding his assent.\nThe president said he had received informed advice from relevant Ministries, Departments and Agencies of the Government, and had also carefully reviewed the Bill in light of the current realities prevalent in the Federal Republic of Nigeria in the circumstances.\nHe argued that it was better to allow each political party to determine its mode of selecting candidates for election.\nMore subsequently…"
  },
  {
    "headline": "U.S. Assists Media Literacy Project in Nigeria to Build Capacity of 170 Radio Journalists, 1000 Youths",
    "summarized_story": "The United States Government says it is committed to supporting initiatives that promote and improve media literacy.\nWith support of the U.S. Consulate General in Lagos, the West Africa Broadcast and Media Academy (WABMA) and the Enugu Literacy Society (ELS), launched “Project Fact Check Nigeria,” a media literacy and countering misinformation project.\nThe project seeks to strengthen critical thinking skills, expand digital and media literacy, and build capacity of radio journalists to counter misinformation and disinformation across the 17 states of southern Nigeria.\nThe radio shows and content will highlight the importance of personal accountability in the dissemination of information and also teach basic media literacy skills.\nThe participants will be empowered to educate people within their social networks and communities to promote media literacy which helps individuals identify malign narratives and misinformation."
  },
  {
    "headline": "Access Bank to join HoldCo league",
    "summarized_story": "Access Bank, the largest Deposit Money Bank in Nigeria by total assets has concluded plans to join the league of financial institutions that have transited to Holdco firms.\nShareholders of Access Bank Plc recently approved the restructuring of the Group into a non-operating financial holding company structure, Access Holding Company.\nIn the third quarter ended September 30, 2021, the bank’s Profit before tax grew by 16% to N135bn from N116.623billion in 2020.\nWhile its Interest Income grew by 24% to N395bn from N318bn in the previous quarter, Profit after tax grew by 19% to N122bn.\nAccess Bank has grown its profit before tax by 172 per cent to N135.07billion in nine months of 2021 from N78.169billlion in 2017."
  },
  {
    "headline": "An Kashe Mutum 45 A Jihar Nasarawa",
    "summarized_story": ""
  },
  {
    "headline": "Me Yasa Kasashen Duniya Ke Rububin Shiga Shawarar ‘Ziri Daya Da Hanya Daya’?",
    "summarized_story": "Tun bayan da kasar Sin ta gabatar da shawarar ‘ziri daya da hanya daya’, kasashen duniya ke cigaba da yin marhabun da shawarar, musamman duba da dunbun alfanun dake tattare da ita.\nKawo yanzu, yawan yarjeniyoyin “ziri daya da hanya daya” da Sin ta kulla da kasashen waje sun zarce 200.\nKamar yadda mai magana da yawun hukumar kula da aikin gyare-gyare da raya kasa ta kasar Sin Meng Wei, ta bayyana a karshen wannan mako cewa, Sin ta kulla yarjejeniyoyi karkarshin shawarar “ziri daya da hanya daya” da gwamnatocin Afrika ta tsakiya, da Guinea Bissau, da Eritrea, da Burkina Faso, da Sao Tome da Principe, da sauran kasashen Afrika da dama.\nKuma ya zuwa yanzu, kasar Sin ta kulla irin wadannan yarjejeniyoyi fiye da 200 da kasashe 145, da kungiyoyin kasa da kasa 32.\nBan da wanann kuma, mahalarta taron sun rattaba hannu kan ‘takardar fahimtar juna, tsakanin hukumar yin gyare-gyare da raya kasa ta kasar Sin, da kwamitin AU, game da karfafa hadin gwiwar bangarorin 2 karkashin shawarar ‘ziri daya da hanya daya’."
  },
  {
    "headline": "Tabbatar Da Ci Gaba Shi Ne Tushen Hadin Gwiwar Sin Da Kasashen Afirka",
    "summarized_story": ""
  },
  {
    "headline": "Ci Gaban Demokuradiyyar HK Karkashin Manufar “Kasa Daya Amma Tsarin Mulki Biyu”",
    "summarized_story": "Yau Litinin, ofishin yada labaru na majalisar gudanarwar kasar Sin, ya fidda takardar bayani mai taken “Ci gaban demokuradiyyar Hong Kong karkashin manufar ‘kasa daya amma tsarin mulki biyu’”, inda aka yi karin bayani kan tarihin demokuradiyyar Hong Kong, tare da bayyana matsayin gwamnatin tsakiyar kasar Sin kan goyon bayan Hong Kong, da raya tsarin demokuradiyya bisa hakikanin halin da take ciki.\nAmma bayan da Hong Kong ta koma hannun kasar Sin a shekarar 1997, a karo na farko mazauna yankin sun samu damar tafiyar da harkokinsu da kansu, karkashin manufar “kasa daya amma tsarin mulki biyu”.\nADVERTISEMENTHar kullum gwamnatin tsakiyar kasar Sin, na ba da jagora kan bunkasuwar demorakudiyyar Hong Kong, da nuna goyon baya da kuma kara azama a kai.\nTana kuma kiyaye manyan muradun mazauna Hong Kong baki daya.\nA yanzu haka dai demokuradiyyar Hong Kong tana fuskantar kyakkyawar makoma."
  },
  {
    "headline": "Bankin Duniya Ya Yaba Da Tallafin Kasar Sin Ga Kasashe Matalauta",
    "summarized_story": ""
  },
  {
    "headline": "NCDC warns: Nigeria now in COVID-19 fourth wave",
    "summarized_story": "The Nigeria Centre for Disease Control on Monday stated that Nigeria has entered the fourth wave of coronavirus disease following a 500 per cent increase in the number of cases in the past two weeks.\nThe NCDC disclosed this in a statement signed by the Director-General, Dr. Ifedayo Adetifa, and made available to journalists on Monday evening.\nThe statement read, “Nigeria has recorded a 500% increase in the number of confirmed COVID-19 cases over the past two weeks across the country caused by the Delta and Omicron variants.\n“The country is now in a fourth COVID-19 wave.\nTherefore, individuals, families and institutions also need to play their part in protecting each other by ensuring adherence to COVID-19 public health and social measures."
  },
  {
    "headline": "NCDC warns: Nigeria now in COVID-19 fourth wave",
    "summarized_story": "The Nigeria Centre for Disease Control on Monday stated that Nigeria has entered the fourth wave of coronavirus disease following a 500 per cent increase in the number of cases in the past two weeks.\nThe NCDC disclosed this in a statement signed by the Director-General, Dr. Ifedayo Adetifa, and made available to journalists on Monday evening.\nThe statement read, “Nigeria has recorded a 500% increase in the number of confirmed COVID-19 cases over the past two weeks across the country caused by the Delta and Omicron variants.\n“The country is now in a fourth COVID-19 wave.\nTherefore, individuals, families and institutions also need to play their part in protecting each other by ensuring adherence to COVID-19 public health and social measures."
  },
  {
    "headline": "Stanbic IBTC Offers Pragmatic Loan Solutions To SMEs",
    "summarized_story": "By KEN EMORDIStanbic IBTC Holdings PLC, a member of Standard Bank Group, is now offering pragmatic loan solutions to Small and Medium Enterprises (SMEs) in Nigeria.\nThe introduction of this loan offer essentially complements the bouquet of product offerings by Stanbic IBTC, as it aims to be the leading end-to-end financial solutions provider in Nigeria.\nThese challenges have driven Stanbic IBTC to introduce the SME short term loan facility.\nThe SME loan is aimed at augmenting working capital to finance various business projects and bridge urgent cash flow needs.\nHowever, obtaining this loan requires minimal documentation; making it easy for SMEs to access funds for necessary costs and other business activities."
  },
  {
    "headline": "Stanbic IBTC Offers Pragmatic Loan Solutions To SMEs",
    "summarized_story": "By KEN EMORDIStanbic IBTC Holdings PLC, a member of Standard Bank Group, is now offering pragmatic loan solutions to Small and Medium Enterprises (SMEs) in Nigeria.\nThe introduction of this loan offer essentially complements the bouquet of product offerings by Stanbic IBTC, as it aims to be the leading end-to-end financial solutions provider in Nigeria.\nThese challenges have driven Stanbic IBTC to introduce the SME short term loan facility.\nThe SME loan is aimed at augmenting working capital to finance various business projects and bridge urgent cash flow needs.\nHowever, obtaining this loan requires minimal documentation; making it easy for SMEs to access funds for necessary costs and other business activities."
  },
  {
    "headline": "FG to Nigerians: Payment for passport application now digital",
    "summarized_story": "“Part of the reforms is the migration of passport application and payments to digital platforms.\nPatronising touts and passport office officials doesn’t always end well, but rather serves to defeat our purpose of eliminating corruption and infusing integrity to the passport administration process,” the minister stated.\nSpeaking on the new application process, the minister noted that a new timeline has been set for fresh passport application and reissue.\nThe only wait-and-get passport is passport photograph,” the minister stated.\nOn the new enhanced passport being rolled out in Ibadan, the minister noted that the passport is an improved document with high-security features."
  },
  {
    "headline": "Buhari Influencing Governors Wrongly",
    "summarized_story": "The Arewa Consultative Forum (ACF) has expressed concern over the alleged lack of empathy by Northern Governors to communities being attacked and killed by bandits and other criminals in the region.\n“The President and the northern governors are unwittingly creating the impression that only their lives, those of their immediate family members and their office’s matter,” the ACF added.\nUmara Zulum of Borno, neither the president nor the governors have bothered to visit affected communities to show empathy and sympathy for the victims.\n“Nothing stops the President and a State governor from visiting such places.\nIn fact, following his example, not one governor has done so except Governor Zulum of Borno."
  },
  {
    "headline": "JUST IN: : Gunmen strike again in Anambra, kill two policemen, set vehicle ablaze",
    "summarized_story": "Unknown gunmen have attacked a police checkpoint at the Obosi Interchange along the Onitsha-Owerri road in Anambra state, killing two policemen and burning one patrol vehicle.\nAccording to a report by Vanguard, an eyewitness said about 10 policemen were at the checkpoint at the time of the incident.\nThe eyewitness added that there was pandemonium during the incident, forcing the policemen to vacate the scene, thereby clearing the checkpoint immediately.\nIt was also gathered that before the shooting incident, traffic gridlock in the area was almost stretching to about two kilometers.\nThe state Police Public Relations Officer, PPRO, Ikenga Tochukwu, who confirmed the incident said two policemen were killed."
  },
  {
    "headline": "Nigerian Army Set To Penalise Detained Female Soldier For Accepting Corper’s Proposal",
    "summarized_story": "Video clips showing a male corps member proposing to a female soldier at the Kwara NYSC camp hit the internet days ago eliciting pleasant reactions from many social media users.\nOne of the video clips apparently recorded on the camp’s parade ground showed the yet-to-be-identified corps member holding a ring as he knelt to ask the female soldier to marry him.\nHowever, speaking with The PUNCH on Sunday, the Army spokesman said the female soldier violated the Nigerian Army’s rules and regulations guiding the codes of conduct of military personnel when deployed for duty.\nHe said, “The female soldier in question violated the following rules of the NA: fraternisation while on official duty at the NYSC camp.\nThe Kwara incident occurred some three months after a female soldier, Lt. Chika Anele, dehumanised a female corps member, Ifenyinwa Ezeiruaku, at the 13 Brigade headquarters, Calabar, Cross River State, in September 2021."
  },
  {
    "headline": "EndSARS: Gov Dapo Abiodun Dragged To Court For Not Releasing Report Of Judicial Panel.",
    "summarized_story": "Governor Dapo Abiodun of Ogun State has been taken to court for refusing to make public the findings of the Ogun Judicial Panel of Enquiry into police brutality and extrajudicial murders, which was presented to him.\nAbiodun was sued alongside the State Attorney General and Commissioner for Justice, Oluwasina Ogungbade, by a lawyer, Festus Ogun.\nFestus Ogun had earlier in a letter, invoked the Freedom of Information Act, asking Abiodun to release, within seven days, the report of the panel he set up after the #EndSARS protest in 2020.\n“Yes, you know when there is a report like that, there will be some internal procedures to be followed, and we are still working internally and since I assumed office about three weeks ago, I have stepped up action on it.\n“I can assure you that either before the year runs out or very early in the new year, there will be more positive things to tell you,” Ogungbade said."
  },
  {
    "headline": "Anambra: Court disqualifies APC, Andy Uba, orders refund of N22.5m nomination form fees to Moghalu",
    "summarized_story": "The Federal High Court Abuja has disqualified the All Progressives Congress (APC) from participating in the just concluded Anambra governorship election.\nIn the same vein, the court also ordered the APC to refund the sum of N22.5 million to Chief George Moghalu (APC governorship aspirant) being cost of nomination and expression of interest forms for primary election it failed to conduct.\n85 (2)and 87(1) of the Electoral Act 2010 (as amended) and Articles 17 (vi) and 18(e), (9) and (0 of 1 Defendant’s Guidelines for the Nomination of candidates for the Anambra 2021 Gubernatorial Election”, Justice Ekwo held.\n“When a primary election is illegal, the fact that such illegal election was monitored by the Nigeria Police (or other security agencies) as averred in paragraph 25 (i) of the 3rd Defendant’s Counter-Affidavit is of no moment.\n“The function of the Nigeria Police (or other security agencies) during primary election or even election proper is not to monitor same,” he held."
  },
  {
    "headline": "35-year-old ex-student leader, Gabriel Boric, emerges Chile President",
    "summarized_story": "Leftist candidate Gabriel Boric has won Chile’s presidential election after an early concession from his far-right rival, José Antonio Kast.\nMr Kast conceded defeat barely an hour and a half after polls closed, and with around half of ballots counted.\nWith most of the votes counted, Mr Boric won with 56% and Mr Kast trailed with 44% of the votes.\nAt 35-years-old, Mr Boric will become one of the world’s youngest political leaders, and the youngest president in Chile’s history.\nIn a tweet, Mr Kast said he had called Mr Boric to congratulate him on his “great triumph”."
  },
  {
    "headline": "VIDEO: Patoranking survives ghastly motor accident",
    "summarized_story": "The popular Nigerian singer, Patrick Nnaemeka Okorie, who is better known as Patoranking has escaped death.\nThe Ebonyi state born musician survived a ghastly motor accident on Saturday.\nSharing videos of the damaged car, Patoranking said he was seated in front when the accident happened.\n”The devil tried and failed some days ago,after Our driver lost control of the brakes.\n“Life can be taken in a heartbeat…two seconds and this happened and to think I was in the front seat and my Guys behind."
  },
  {
    "headline": "Nigeria Now In Fourth COVID-19 Wave – NCDC",
    "summarized_story": "The Nigeria Centre for Disease Control on Monday said the country was now experiencing a fourth COVID-19 wave.\n“Nigeria has recorded a 500% increase in the number of confirmed COVID-19 cases over the past two weeks across the country caused by the Delta and Omicron variants,” the statement said.\nREAD ALSO: Full Booster Dose Improves Omicron Protection, Says Moderna“The country is now in a fourth COVID-19 wave.\n“Critically, Nigerians are urged to adhere to recommended measures by NCDC and other public health authorities, as they celebrate Christmas and New Year.\nThe virus that causes COVID-19 is more likely to spread in mass gatherings especially when held indoors with full capacity and poor ventilation."
  },
  {
    "headline": "Kaduna Attack: Two More Bodies Recovered, Death Toll Now 40",
    "summarized_story": "Two more bodies have been recovered following separate attacks on three villages in Giwa Local Government Area of Kaduna State bringing the death toll to 40.\nGunmen had invaded the villages between Saturday and Sunday morning and opened fire on the innocent villagers.\nThe bandits also burnt several houses, vehicles, and farmlands during the attack on the three villages – Kauran Fawa, Marke and Riheya.\nAs of Sunday, the Kaduna State Government said the dead bodies retrieved were 38 but the Commissioner for internal security and Home Affairs, Samuel Aruwan confirmed to Channels Television on Monday that two additional bodies were recovered.\nBuhari in a statement by his Senior Special Assistant on Media and Publicity, Garba Shehu, extended his condolences to the Kaduna State Government and the people in the affected local governments."
  },
  {
    "headline": "Togo, Benin, Niger Paid Nothing For Electricity From Nigeria In Q2 2021 – NERC",
    "summarized_story": "The Nigerian Electricity Regulatory Commission (NERC) has said that three neighbouring countries did not make any payment for the second quarter of 2021.\nAdding that the inadequacies recorded within the period show that DisCos need to improve on their performance as none of them met the minimum remittance threshold.\n“Therefore, DisCos’ remittance level, regardless of the prevailing tariff shortfall, was still below the expected MRT.\nApart from Eko Disco, none of the other DisCos met their expected minimum remittance thresholds (“MRTs”) to NBET in the quarter under review.\nOverall, the total Disco remittance to NBET was 76% of the expected total for the quarter."
  },
  {
    "headline": "INEC Requires N305bn To Conduct 2023 Elections, Says Yakubu",
    "summarized_story": "Chairman of the Independent National Electoral Commission (INEC) Professor Mahmood Yakubu says the commission will require N305 billion to conduct the 2023 general elections.\nHe disclosed this during a meeting with the Senate Committee on Appropriation at the National Assembly on Monday.\nMeanwhile, the Chairman of the Senate Committee on Appropriation Senator Jibrin Barau, has disclosed that the 2022 budget will be laid, debated, and passed on Tuesday, December 21.\nThe 30-day deadline stipulated by the constitution for the President to respond to the bill expired on Sunday, December 19.\nMeanwhile, the National Assembly is scheduled to commence its Christmas and New Year holidays from Tuesday, December 21."
  },
  {
    "headline": "Two Clerics Abducted In Ogun, Kidnappers Demand N15m Ransom",
    "summarized_story": "Two clerics have abducted two clerics in Ogun State, police authorities said on Monday.\nThe victims – Islamic clerics – were whisked away by a four-man gang at Ayetoro along Ayetoro-Abeokuta road in Yewa-North Local Government Area of the state.\nThe kidnappers were said to have stormed the residence of the clerics on Saturday night shortly after they arrived from a public lecture.\nHe said that police and other security agencies including the local hunters have begun combing the bush in the area.\nOur men have been there with others including local hunters combing the bush,” the police spokesman said."
  },
  {
    "headline": "Fact check: What Court really said about Ikoyi Marriage Registry -",
    "summarized_story": "Contrary to misconceptions and misinterpretations, the Federal High Court in Lagos did not bar Federal marriage registries in Ikoyi, Lagos and Abuja from further contracting marriages under the Marriage Act, 2004 in Nigeria.\nThe three others are the local government areas, where the Federal Government established Federal Marriage Registries – Egor local LG Council in Edo State, Owerri Municipal LG Council in Imo State and Port Harcourt City LG Council in Rivers State.\nIn the case instituted in 2018, the applicants sued the Minister of Interior and the Attorney-General of the Federation.\nIt also directed marriage registries in the local governments to obtain approval from federal marriage registries so as to continue to conduct marriages in accordance with the marriage act.\nThe stealthy manner in arrogating marriage territories beyond the statutorily delineated Central Licensing place of worship and undermining the local governments (Marriage Districts) is illegal."
  },
  {
    "headline": "APC sets up convention sub-committee",
    "summarized_story": "The ruling All Progressives Congress (APC) has commenced process leading to the national convention of the party.\nTo this end, the party has set up a sub-committees on budgeting and other relevant structures.\nPresident Muhammadu Buhari had in November approved February 2022 as the tentative month for the national convention."
  },
  {
    "headline": "7,000 defects to PDP in Adamawa, APC confident of victory in 2023 -",
    "summarized_story": "Adamawa State Governor, Ahmadu Umaru Fintiri has received over 7,000 members of the All Progressives Congress and Social Democratic Party to the Peoples Democratic Party in Jada Local Government Area of Adamawa State.\nBut, the All Progressives Congress in the state says it is confident of victory in the forthcoming 2023 general election."
  },
  {
    "headline": "Nnamdi Kanu: A chronology of IPOB leader's trials since his re-arrest -",
    "summarized_story": "The federal high court, Abuja has adjourned to 18th January 2022, the continuation of the trial of the proscribed leader of the indigenous people of Biafra.\nHis counsel Ifeanyi Ejiofor has expressed concern over the constant disobedience of court orders by the DSS.\nTVC News Judiciary Correspondent, Celestina Iria takes a look at all that has transpired since Nnamdi Kanu’s first appearance in court after he was rearrested."
  },
  {
    "headline": "Nigeria: Buhari Withholds Assent to Electoral Amendment Bill, Writes Parliament to Explain Why",
    "summarized_story": "Nigeria President Muhammadu Buhari has withheld his assent to the Electoral Act (Amendment) Bill 2021.\nIn a letter to the Senate President, Ahmed Lawan, exclusively obtained by THISDAY, the president said that prevailing situation in the country would not allow him to sign the bill.\nAmong other reasons for rejecting the bill, the president cited high cost of conducting direct primaries, the security challenge of monitoring the election, violation of citizens’ rights and marginalization of small political parties.\nMore details will be revealed on ARISE TV from Monday evening, and series of analyses to follow into Tuesday.\nTobi Soniyi"
  },
  {
    "headline": "Nigeria: Death Toll in Kaduna Terrorist Attack Rises to 40",
    "summarized_story": "The death toll from the attacks on communities in Giwa Local Government Area of Kaduna State has risen to 40 following the discovery of two corpses in the bushes by security operatives.\nThe Kaduna state commissioner for Internal Security and Home Affairs, Samuel Aruwan, disclosed this in a statement on Monday.\nAruwan had on Sunday disclosed that 38 people were killed in Saturday’s attacks on Kauran Fawa, Marke and Riheya villages in Idasu district of Giwa LGA.\n“It would be recalled that Kauran Fawa, Marke and Riheya villages in Idasu, Giwa LGA were attacked by armed bandits, with 38 people confirmed dead as at Sunday.\n“The latest discovery of two more bodies brings the death toll from the attack to 40."
  },
  {
    "headline": "Robert Clark: The 1999 Constitution is a Rotten Egg",
    "summarized_story": "Ahead of the national and state elections in 2023, Nigeria’s weakening economy, rising poverty, violent conflicts and deepening divisions continue to pose a clear threat to the nation’s peace and progress.\nThe dire situation has naturally heightened the clamour for the restructuring of the Nigerian state.\nChief Robert Clark joins The Morning Show to discuss the state of the nation and why he believes that the only forward is for the constituent nationalities that make up Nigeria to come together and negotiate their co-existence."
  },
  {
    "headline": "Osinbajo’s Tweet + Togolese Security Harass Nigerian Travellers – Trending with Ojy Okpe – Arise News",
    "summarized_story": "A video that has now gone viral shows Togolese security personnel maltreating Nigerian citizens.\nIn another development, a video surfaced online over the weekend, where a woman was heard accusing Ghanaian officials of extortion.\nMeanwhile, Twitter over the weekend, reportedly deleted Nigeria Vice President Yemi Osinbajo’s Tweet, following complaints by the team managing multiple award winning artiste Beyonce Knowles.\nThe tweet sparked backlash from Nigerians who believed that the vice president should have been more concerned about other pressing issues plaguing the country, prompting them to report the tweet.\nIn a related development, a video of an unidentified soldier proposing to his girlfriend that is now making the rounds on social media."
  },
  {
    "headline": "Bode George: Bisi Akande Should Withdraw His Book",
    "summarized_story": "The backlash against the autobiography, ‘My Participations,’ by Bisi Akande, a former pro tem National Chairman of the All Progressives Congress, continues to reverberate.\nThe latest person to enter the fray is Bode George, a chieftain of the Peoples Democratic Party, who has asked Akande to withdraw the book and tender an apology for dishonouring Yoruba elders.\nBode George joins The Morning Show to say why he is so vehemently opposed to the autobiography and whether he thinks President Muhammadu Buhari will meet the deadline today by signing into law the Electoral Act (Amendment) Bill."
  }
]