[
  {
    "headline": "354 days after defeating polio, Nigeria records 12 vaccine-derived cases –UNICEF",
    "summarized_story": "Just 354 days after being declared polio-free, the United Nations Children’s Fund, on Saturday, confirmed that cases of vaccine-derived poliovirus were recorded in 12 Nigerian states, saying it was supporting the country by procuring vaccines.\nThe World Health Organisation Independent Africa Regional Certification Commission for Polio Eradication, on August 25, 2020, officially declared Nigeria and the African region free of wild poliovirus.\nPlease, note (that) every year, we have a number of vaccine-derived cases of polio and this is not the first time.\nA professor of Medical Virology, University of Maiduguri, Marycelin Baba, told one of our correspondents that the vaccine-derived poliovirus case recorded in Adamawa State on Saturday was capable of causing paralysis like the wild poliovirus.\nIn the last nine months, we’ve had it in Abia, Bayelsa, and Jigawa states.”According to him, cases of vaccine-derived polio are the result of unsanitary environments where children are unimmunised."
  },
  {
    "headline": "Again, INEC raises the alarm over employment scammers",
    "summarized_story": "The Independent National Electoral Commission on Saturday again raised the alarm over the activities of scammers and those it had previously referred to as “fake employment merchants and racketeers.”The commission said the merchants, purporting to be acting on its behalf, “open fake employment websites and issue fake employment letters.”INEC National Commissioner and Chairman (Information and Voter Education Committee), Festus Okoye, raised the alarm in a statement titled, ‘Circulation of fake INEC recruitment advert on social media.’He said, “These scammers are once again circulating the commission’s old recruitment advertisement on social media with the obvious intention to lure and dupe unsuspecting members of the public with attractive offers of employment.\nCopyright PUNCH.\nAll rights reserved.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "ND publisher Adegbola honoured in diaspora",
    "summarized_story": "It was another landmark gesture for Cameroon-based Nigeria publisher Ismael Adegbola after he was presented a Merit Award in appreciation towards immense support to the Nigerian community in Cameroon.\nThese honours took place recently during the inauguration of the newly elected officials of the Ebonyi State Union in Douala, Cameroon.\nAdegbola has enjoyed several accolades from different institutions in Cameroon over his positive impact of making one Nigeria possible among the tribes through his media tools.\nHis selfless activities had paved numerous recommendations from many of Nigeria’s top agencies in Cameroon.\nHis medium recently embarked on a win-win partnership deal with The Nigeria High Commission in Cameroon for the interest of Nigerians living in Cameroon, and Nigeria as a whole."
  },
  {
    "headline": "WHO concerned as Cote d’Ivoire declares first Ebola outbreak in 25 years",
    "summarized_story": "By Sola OgundipeThe World Health Organisation, WHO, has expressed concern over the outbreak of Ebola in Cote d’Ivoire more than 25 years after the last outbreak.\nGuinea experienced a four-month long Ebola outbreak, which was declared over on 19 June 2021 even as there is no indication that the current case in Cote d’Ivoire is linked to the earlier outbreak in Guinea.\nAlready, WHO is helping to coordinate cross-border Ebola response activities and 5000 Ebola vaccines doses which the organization helped secure to fight the outbreak in Guinea are now being transferred to Cote d’Ivoire, following an agreement between the ministries of health of Cote d’Ivoire and Guinea.\nWHO staff based in Cote d’Ivoire are supporting the investigation into the case.\nCote d’Ivoire declared the outbreak in line with International Health Regulations and WHO does not advise any travel restrictions to and from the country."
  },
  {
    "headline": "Flood destroys 170 houses, displaces 1,000 in Kirfi, Bauchi",
    "summarized_story": "Bala Mohammed of Bauchi, on Saturday, commiserated with the victims of flood disaster which destroyed over 170 houses at Cheledi community in Kirfi Local Government Area of the State.\nFlood triggered by torrential rain on Friday resulted to the over flow of water from the surrounding mountains to submerged the community, destroyed houses a D displaced about 1,200 persons.\n“The disaster is devastating due to the level of destruction of houses and property,” he said.\nThe governor urged the communities to maintain high standard of hygiene to guard againts outbreak of diseases associated with flood disaster.\nThey said the flood was caused by the lack of drains to ease flow of water and control flooding in the area."
  },
  {
    "headline": "Buhari pledges to increase education budget by 50 per cent",
    "summarized_story": "By Johnbosco Agbakwuru, AbujaPresident Muhammadu Buhari on Friday, returned to Nigeria from London, the United Kingdom after joining world leaders in making firm commitment to increase funding of education sector at the recent Global Education Summit in London, United Kingdom.\nPresident Buhari left Nigeria for the United Kingdom on July 26 to participate in the Global Education Summit on Financing Global Partnership for Education (GPE) 2021-2025.\nAt the summit, President Buhari pledged to increase the budget for the education sector in Nigeria by as much as 50 per cent over the next two years.\nDuring the bilateral meeting with the Commonwealth Secretary-General, Baroness Patricia Scotland, President Buhari said Nigeria would be glad to receive support from the Commonwealth in diverse areas of needs and challenges.\nBefore departing London, President Buhari was reported to have on Thursday visited former Lagos State Governor and National Leader of the All Progressives Congress (APC), Bola Tinubu, who is believed to be on medical trip to London."
  },
  {
    "headline": "State of the Nation: 2023 elections unrealistic, unless… – Presbyterian Church",
    "summarized_story": "The level of banditry, kidnappings and herdsmen attacks, robbery, cult crises and the likes has been driving Nigeria steadily into a failed State.\n2023 Elections“Prophetically, we believe 2023 elections will be a turning point in the history of our nation.\nIt gave us hope for the possibility of freer and fairer elections in Nigeria.\n“With God on our side, we shall continue to move from Glory to Glory and our nation Nigeria will also experience a greater glory.\n“We must also continue to be good and law abiding citizens of our nation."
  },
  {
    "headline": "Senate Spokesman urges youths to look beyond certificates",
    "summarized_story": "Senator Ajibola Basiru representing Osun Central Senatorial district has advised the Nigerian youths not to depend on certificates as civil service could no longer absorb all graduates universities produced yearly.\nSenator Basiru, who is the Senate Spokesperson, stated this at a night out interactive session with the National Council of Nigerian Youths, Osun chapter at his GRA residence.\nHe said what stood Nigerian youths out at a critical time like this was their resourcefulness, excellence and passion for industry, saying Nigerian youths can be self dependent if they chose.\nAccording to him, records showed that some Nigerian youths have been doing well in private sector since the days of nationalist struggle, hence with over bloated Civil Service, they could do better.\nHe said: “We need elders in politics to drink from their fountain of knowledge and experience as we need youths to bank on their energy and resourcefulness."
  },
  {
    "headline": "Fr Mbaka vows to follow Messi to PSG, give reasons",
    "summarized_story": "Father Ejike Mbaka, has vowed to support Paris Saint-Germain, PSG, after the signing of Lionel Messi.\nMbaka explained that goodness will follow Messi to PSG because he is a gift to football and this generation.\nAddressing his members on Saturday, the Adoration Ministry spiritual leader, however, lamented that Barcelona failed to retain the Argentine after he suffered with them.\nAccording to Mbaka: “Just like Messi, now that he had suffered for Barcelona, they have said that sustaining his contract is difficult, that they can’t maintain him.\n“Whichever clubs he joins, we will support.”Messi had signed a two-year deal with PSG during the week, after undergoing his medicals in France."
  },
  {
    "headline": "Boko Haram: Governor Zulum receives another Chibok schoolgirl in Gwoza",
    "summarized_story": "Borno State Governor, Babagana Umara Zulum, on Saturday in Gwoza, received another Chibok Girl who presented herself to the Nigerian Army.\nThe schoolgirl, Hassana Adamu, alongside her two children, was handed over to Governor Zulum by the Commander, 26 Taskforce Brigade, Brigadier General DR Dantani.\nZulum was in Gwoza from there he moved to Bama, undertaking humanitarian activities.\nHe had just returned from northern Borno where he spent five days for humanitarian interventions.\nHassana was one of over 200 schoolgirls abducted at a Government Secondary School in Chibok on April 14, 2014, by Boko Haram insurgents."
  },
  {
    "headline": "Adamawa records polio case",
    "summarized_story": "The Adamawa State Government says polio has resurfaced in the state.\nThe government said Saturday that it has detected circulation of vaccine derived Poliovirus type 2 case.\nThe state Commissioner for Health and Human Services, Prof. Abdullahi Isa, made the disclosure during the official flag-off of the first Round Outbreak Response immunisation on Saturday in Yola.\n“One case of Circulating Vaccine Derived Poliovirus type 2 has been detected in the state,” he saidThe commissioner explained that Vaccine Derived Poliovirus type 2 (VDPV) is a strain of the weakened Poliovirus initially included in Oral Polio Vaccine (OPV) that has changed over time and behaves more like the wild or naturally occurring virus.\n“The resurface of the Poliovirus type 2 necessitated the immediate flag-off of the first Round Outbreak Response for Oral Polio Vaccine,” he said."
  },
  {
    "headline": "Gov. Ugwuanyi empowers Udi/Ezeagu youths, women at UEPA ward executives inauguration",
    "summarized_story": "The inauguration of the UEPA ward executives, which took place at Christ the King Parish, Ngwo Uno, Udi LGA, with Gov.\nUgwuanyi in attendance, witnessed the empowerment of 20 youths, who are members of the group, with the sum of N50,000 each.\nUgwuanyi stressed the need for the group to accommodate women of Udi and Ezeagu LGAs in the empowerment programme, to enable them benefit accordingly.\nHe therefore urged the members of the group to continue to pray for his administration and the progress of the state.\nUgwuanyi as a peaceful leader whose development strides and leadership style of inclusiveness is uncommon in the annals of the state."
  },
  {
    "headline": "Why we want Secondus out, by PDP Arapaja",
    "summarized_story": "By Bisi Oladele and Segun Showunmi, IbadanNational Vice Chairman (Southwest) of Peoples Democratic Party (PDP) Taofeek Arapaja on Saturday explained he joined others to call for the resignation of the National Chairman Uche Secondus because the party is crumbling under his leadership while he is undisturbed.\nThe meeting prevailed on members to stop the move to force out Secondus and fixed national convention of the party for October.\nArapaja, who was recently elected, said he added his voice because the national chairman was not showing signs he wants PDP to win future elections.\nArapaja, who was the deputy governor of Oyo State from 2007 to 2011, explained that Secondus did not give a damn that three governors defected to the APC within three months.\nRather than make genuine moves to resolve crises rocking the party in states and regions, Arapaja said Secondus was completely nonchalant."
  },
  {
    "headline": "Bandits kill 8 farmers in Kaduna",
    "summarized_story": "By AbdulGafar Alabelewe, KadunaKaduna Police Command has confirmed the killings of farmers in Buruku and Udawa villages in Chikun Local Government area by bandits.\nThough the Police could not confirm the number of the victims, a community leader in the area told journalists eight farmers were killed in the two communities.\nRead Also: Five dead as police engage bandits in gun duel in ImoAccording to him: “Yes, there were attacks on farmers in Buruku and Udawa communities.\nAccording to him: “Five farmers were killed in Buruku while three were killed in Udawa.\nWe need help.”Another resident, Malam Lawal Isa said: “Attacks by bandits have become almost a daily occurrence in our communities."
  },
  {
    "headline": "UPDATED: Two injured as security agents rescue Osun APC Appeal Committee members",
    "summarized_story": "Party members stormed the APC secretariat as early as 8am on Saturday to submit more petitions.\nTension rose at the secretariat when loyalists of Governor Oyetola and Aregbesola met for explanations on some of the petitions.\nThe clash went on between both camps with gunshots heard at the secretariat, forcing committee members to hurriedly conclude the sitting for the day.\nSecurity operatives fired several bullets to scare hoodlums fomenting trouble and rescued the committee members.\nGovernor Adegboyega Oyetola called for calm, urging members to give peace a chance and allow the ongoing appeal process to run its full course."
  },
  {
    "headline": "Cross River North: Appeal Court refuses to review judgment given in Jarigbe’s favour",
    "summarized_story": "The court dismissed both applications and awarded N1million each in favour of the first and second respondents in each of the.\nAs the final court of appeal in election petitions on National and Houses of Assembly elections.\n“This court has entered judgment in this matter in its final appellate jurisdiction, and thus, has become incapable or without jurisdiction to reopen the matter vide the applicants’ application.\n“And for the umpteenth time, I hereby state that the applicants’ application is, no doubt, a gross abuse of the court’s process.\n“This court has no jurisdiction to revisit the judgement and it has no jurisdiction to adjudicate on the applicants’ application as it is indeed, a monumental abuse of court process,” she said."
  },
  {
    "headline": "Appeal court upholds Jarigbe as Cross Rivers North senator",
    "summarized_story": "From Godwin Tsa, AbujaThe Abuja division of the Court of Appeal on Saturday dismissed an appeal challenging the election of Senator Agom Jarigbe as the senator representing Cross Rivers North.\nThe cost against Agi was for engaging in abuse of court in their application asking the court to set aside its earlier judgment.\nThe appellants asked the court to set aside the judgment on account of being a nullity.\nThe court, therefore, held that the application is a gross abuse of court process, malicious and brought in bad faith to overreach the court.\nWhile dismissing the application, the court upheld the July 30 2021 judgment that recognised Jarigbe as the Senator for Cross Rivers North Senatorial district."
  },
  {
    "headline": "Niger Insecurity: Joint Security Taskforce kills 15 bandits, arrests 3 in military uniforms",
    "summarized_story": "Three of the bandits wearing Military camouflage uniform were also arrested while a number of them escape with serious bullets injuries.\nThis breakthrough is coming barely two weeks after the Joint Security TaskForce neutralized no fewer than 10 bandits in Gurumana community in Shiroro local government area, and recovered about eight motorcycles.\nHe disclosed that the Joint Security TaskForce had laid ambush in the community for the bandits all through the night, defying the Friday night heavy downpour before they were able to track the bandits down.\nThe security agents are all out for the bandits this time around.\n“Now the Security Agents are taking the fight to the bandits unlike before when they were being sold out to the bandits by informants, the latest offensive is yielding results”, he said."
  },
  {
    "headline": "UPDATED: 22 killed, 14 injured in fresh Plateau attack-Police",
    "summarized_story": "From Gyang Bere, JosThe Plateau State Police Command has confirmed the death of 22 persons after a violent clash on Saturday between hoodlums along Rukuba Road in Jos North Local Government Area of Plateau State.\n“Unfortunately, twenty-two (22) persons were killed and Fourteen injured in the attack.\nMeanwhile, troops of Operation SAFE HAVEN have arrested 12 suspected persons in connection with the fresh violence that erupted at Angwan Rukuba road in Jos North Local Government Area of the state.\n“Troops of the Operation Safe Haven earlier today 14 August 2021 swiftly responded to distress calls that suspected hoodlums blocked Jos North Junction along Rukuba road in Jos North LGA of Plateau State and attacked some commuters.\nHe said the attacks on innocent citizens no matter their backgrounds will never be tolerated in Plateau State and those who are found to be behind such attacks will be dealt with decisively to serve as deterrence and restore public order."
  },
  {
    "headline": "22 ex-ISIS members’ families, 79 others repatriated from Libya – FG",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Federal Government has disclosed that 101 stranded Nigerians from Libya have successfully been repatriated.\nThe individuals, according to a statement by Head, Media, Public Relations and Protocols, National Diaspora Commission (NIDCOM), Abdur-Rahman Balogun, include 22 family members of slain members of terrorist group, Islamic State, arrived in Abuja, on Friday.\nThe statement titled, ‘FG facilitates return of 101 stranded Nigerians’, the returnees were received by officials of Ministry of Foreign Affairs; NIDCOM; Nigeria Centre for Disease Control; National Drug Law Enforcement Agency; National Emergency Management Agency; Department of State Services; Nigeria Immigration Service and Port Health.\nThe statement read, “The stranded Nigerians include the 22 family members of suspected former members of ISIS that were killed in Libya as well as their children.\n“All evacuees came with Negative PCR test for Covid- 19, and landed at exactly 10.15 pm at Nnamdi Azikiwe International Airport GAT wing, aboard Airforce C130.”"
  },
  {
    "headline": "Scores killed as military arrests 12 suspected hoodlums in connection with fresh violence in Jos",
    "summarized_story": "From Gyang Bere, JosTroops of Operation SAFE HAVEN on Saturday arrested 12 suspected persons in connection with the fresh violence that erupted at Angwan Rukuba road in Jos North Local Government Area of Plateau State leading to loss of lives and several persons injured.\nThe Commander Operation Safe Haven (OPSH), Major General Ibrahim Ali in a press statement signed by Ishaku Gaji Takwa said the violence led to the death of some commuters in the area and many sustained injuries.\n“Troops of the Operation Safe Haven earlier today 14 August 2021 swiftly responded to distress calls that suspected hoodlums blocked Jos North Junction along Rukuba road in Jos North LGA of Plateau State and attacked some commuters.\nThose arrested are currently in custody for interrogation.”The Commander Operation SAFE HAVEN, Major General Ibrahim Ali appealed to the people to volunteer credible information that would lead to the arrest of other suspects currently at large.\nMeanwhile, security patrols have been stepped-up in Jos Metropolis to maintain peace and security."
  },
  {
    "headline": "Breaking: Another Chibok Schoolgirl Emerges from Captivity with Two Children",
    "summarized_story": "Michael Olugbode in MaiduguriAnother Chibok schoolgirl, Hassana Adamu, emerged with two children birthed in captivity on Saturday, seven years after Boko Haram abducted her.\nHassana was one of over 200 schoolgirls abducted at a Government Secondary School in Chibok on April 14, 2014, by Boko Haram insurgents.\nLast month, Another Chibok schoolgirl, Ruth Pogu, and a man, said to be her husband, had presented themselves to the Nigerian Army , at a location in Bama.\nRuth returned with two children she gave birth to in captivity.\nZulum was in Gwoza to give humanitarian aid to the people of the town which was once the ‘headquarters’ of Boko Haram ‘caliphate’."
  },
  {
    "headline": "Just In: Many Feared Killed as Violence Erupts in Jos",
    "summarized_story": "By Seriki AdinoyiNo fewer than 18 persons are feared killed in Jos, Plateau State on Satuday morning following an outbreak of fresh violence along Rukuba road axis of the city.\nThough the violence has been quelled by Soldiers drafted from the Special Task Force (STF) on security, the city is still enveloped in palpable fears and tension.\nThey had set out in a convoy for the burial on Saturday morning when violence broke out along the way at Rukuba road.\nThe youths allegedly pounced on the Fulani, injured some and killed others before the security agents could reach the spot.\nThe Governor has repeatedly warned that violent merchants won’t be allowed to have their way in the state."
  },
  {
    "headline": "Accolades as Elder Statesman, Ahmed Joda, Dies at 91 in Yola",
    "summarized_story": "He rose through the administrative cadre of the Northern regional government, and then the federal civil service, to retire as Permanent Secretary, Ministry of Industries.\nDuring the administration of the youthful General Yakubu Gowon, he was considered to be among a group known as Super Permanent Secretaries.\nHe later worked with the then Northern Broadcasting Corporation in Kaduna before joining the Northern Nigeria civil service as Chief Information Officer.\nJoda became a federal permanent secretary in 1967 in the Ministry of Information and subsequently moved to Lagos.\nIf every Nigerian have the attributes of Joda, Nigeria will have been better than what it is now."
  },
  {
    "headline": "President Hails ‘Robust Response’ to Insecurity By Military",
    "summarized_story": "The President said his government was focused on taking the country out of the security challenges.\nHe said: “We are making continuous efforts at consolidating the progress made in improving the enabling security environment for peace and development.\nAccording to him, some of the measures include disarmament, demobilisation and rehabilitation, deradicalisation programmes, political reconciliation measures and instruments of development intervention.\nThe course, which commenced in September 2020, had 22 participants from the Nigerian Army, 25, from Nigerian Navy and 11 from Nigerian Air Force.\nThere were 24 participants from Ministries, Departments and Agencies (MDAs), comprising six from Nigeria Police, three each from Department of State Service (DSS), National intelligence Agency (NIA) and Defence Intelligence Agency (DIA), among others."
  },
  {
    "headline": "FG May Be Liable for N25bn of N45bn Ruling against Shell in Ogoni",
    "summarized_story": "Shell only runs the operations of joint ventures (JVs) in Nigeria where the federal government is the holder of 55 per cent of the assets.\nJudgment first came in favour of the Ogoni community in 2010, courtesy of Justice Ibrahim Buba of the Lagos division of the Federal High Court.\nHowever, Mohammed ruled that the money should be paid through the counsel to the Ogoni community, Chief Lucius Nwosu (SAN).\nThe case was instituted in 2001 by 10 representatives of the Ejama Ebubu community against the oil company for the losses caused by the oil spills.\nShell is planning to sell off all its assets in the shallow waters and onshore, leaving only its offshore operations intact in Nigeria."
  },
  {
    "headline": "REVEALED: Crashed Helicopter Was Declared Non-airworthy Three Years Ago, Owners Tricked NCAA To Obtain Operational License",
    "summarized_story": "The helicopter crashed with three persons onboard.\nDocuments seen by SaharaReporters showed that the crashed helicopter was declared non-airworthy in 2017 by the Nigerian Civil Aviation Authority.\nThe crashed aircraft, the source disclosed, was used at different times by Omni-Blue Aviation Services and Quorum Aviation to obtain AOCs from the NCAA.\n\"Then, Quorum Aviation had approached the NCAA for AOC license and it was discovered that the helicopter was faulty.\nPart of the building the helicopter crashed into was destroyed while some vehicles around the place were also damaged as a result of the incident."
  },
  {
    "headline": "REVEALED: Crashed Helicopter Was Declared Non-airworthy Three Years Ago, Owners Tricked NCAA To Obtain Operational License",
    "summarized_story": "The helicopter crashed with three persons onboard.\nDocuments seen by SaharaReporters showed that the crashed helicopter was declared non-airworthy in 2017 by the Nigerian Civil Aviation Authority.\nThe crashed aircraft, the source disclosed, was used at different times by Omni-Blue Aviation Services and Quorum Aviation to obtain AOCs from the NCAA.\n\"Then, Quorum Aviation had approached the NCAA for AOC license and it was discovered that the helicopter was faulty.\nPart of the building the helicopter crashed into was destroyed while some vehicles around the place were also damaged as a result of the incident."
  },
  {
    "headline": "UPDATE: Pilot, Passenger Dead, One Rescued In Lagos Helicopter Crash",
    "summarized_story": "Two persons including the pilot have been confirmed dead in the helicopter crash that happened in Lagos on Friday.\nOne person was, however, rescued alive from the wreckage of the helicopter owned by Quorum Aviation.\nThe tragedy, according eyewitnesses, happened around the Salvation Bus-stop area of the Lagos surburb.\nNosa Okunbor, Head of Public Affairs of the Lagos State Emergency Management Agency, confirmed the casualty figures to SaharaReporters.\nOne resuscitated and taken to the hospital,\" Okunbor said."
  },
  {
    "headline": "UPDATE: Pilot, Passenger Dead, One Rescued In Lagos Helicopter Crash",
    "summarized_story": "Two persons including the pilot have been confirmed dead in the helicopter crash that happened in Lagos on Friday.\nOne person was, however, rescued alive from the wreckage of the helicopter owned by Quorum Aviation.\nThe tragedy, according eyewitnesses, happened around the Salvation Bus-stop area of the Lagos surburb.\nNosa Okunbor, Head of Public Affairs of the Lagos State Emergency Management Agency, confirmed the casualty figures to SaharaReporters.\nOne resuscitated and taken to the hospital,\" Okunbor said."
  },
  {
    "headline": "Nigerians In UAE Lament Inability To Renew Labour Visa, Demand Government's Intervention",
    "summarized_story": "Nigerians in the United Arab Emirates have complained of their inability to renew their labour visas in the country.\nHe urged the Chairman, Nigerians in Diaspora Commission, Abike Dabiri-Erewa, to come to the rescue of Nigerians in UAE as the Nigerian Embassy was yet to make serious intervention ino the matter.\nMany Nigerians at the company I work for and in other places are experiencing this; we are about 20 Nigerians at this company.\n“Most companies here are under labour and it is not possible to renew the Nigerians labour visas for now.\nIt is only free zone visas that are being renewed and this free zone visa is only issued to a few persons."
  },
  {
    "headline": "Dear God, let oil price fall to $44",
    "summarized_story": "We are locked in a situation where high oil prices get us high and lower oil prices take us low.\nHigher oil prices did not amount to higher inflow of FX into the economy as you would expect.\nHigher oil prices led to higher petrol prices and higher cost of living for Nigerians, with the impact manifesting in growing poverty.\nThat was the price of crude oil as of September 2020 when petrol price was increased to N162 per litre.\nThe third point on my prayer list is that if crude oil falls to $44, NNPC will have to start remitting more forex inflow from crude oil sale to the federation."
  },
  {
    "headline": "Dear God, let oil price fall to $44",
    "summarized_story": "We are locked in a situation where high oil prices get us high and lower oil prices take us low.\nHigher oil prices did not amount to higher inflow of FX into the economy as you would expect.\nHigher oil prices led to higher petrol prices and higher cost of living for Nigerians, with the impact manifesting in growing poverty.\nThat was the price of crude oil as of September 2020 when petrol price was increased to N162 per litre.\nThe third point on my prayer list is that if crude oil falls to $44, NNPC will have to start remitting more forex inflow from crude oil sale to the federation."
  },
  {
    "headline": "Wike: PDP must sue Umahi, Ayade for joining APC without constitutional reason",
    "summarized_story": "Nyesom Wike, governor of Rivers, has asked the Peoples Democratic Party to file a suit against David Umahi and Ben Ayade, governors of Ebonyi and Cross River, respectively, for defecting to the All Progressives Congress (APC).\nShortly after Ayade, Bello Matawalle, governor of Zamfara, also defected from the PDP to the APC.\nWhile the PDP has filed a suit against Matawalle to challenge his decision to remain as governor despite the defection, no decision has been taken against Umahi and Ayade.\nThe court of appeal in Calabar had, in July, declared Agom as the duly elected senator for Cross River north senatorial district.\nAdvertisementIn another judgment on Saturday, the court of appeal in Abuja, reaffirmed Jarigbe as the elected senator for Cross River north."
  },
  {
    "headline": "Wike: PDP must sue Umahi, Ayade for joining APC without constitutional reason",
    "summarized_story": "Nyesom Wike, governor of Rivers, has asked the Peoples Democratic Party to file a suit against David Umahi and Ben Ayade, governors of Ebonyi and Cross River, respectively, for defecting to the All Progressives Congress (APC).\nShortly after Ayade, Bello Matawalle, governor of Zamfara, also defected from the PDP to the APC.\nWhile the PDP has filed a suit against Matawalle to challenge his decision to remain as governor despite the defection, no decision has been taken against Umahi and Ayade.\nThe court of appeal in Calabar had, in July, declared Agom as the duly elected senator for Cross River north senatorial district.\nAdvertisementIn another judgment on Saturday, the court of appeal in Abuja, reaffirmed Jarigbe as the elected senator for Cross River north."
  },
  {
    "headline": "Sanusi: 35 years of progress in Nigeria wiped out -- we need to grow this economy",
    "summarized_story": "Muhammad Sanusi, former governor of the Central Bank of Nigeria (CBN), says there is a need to ensure that the country records growth in its economy.\nHe said if there isn’t much turnaround soon, Nigeria will get to a point where the average citizen’s income will be similar to what was earned in 1980.\nWe are face to face with the reality — that fuel subsidy is unsustainable.\nAt this rate, in the next two years, in terms of purchasing power parity, the average income of a Nigerian would have gone back to what it was in 1980 under Shehu Shagari.\nWe need to understand how our economy works as a people; we need to understand our choices,” the former CBN governor said."
  },
  {
    "headline": "Tech entrepreneur Rebecca Enonchong to appear in Cameroon court",
    "summarized_story": "Rebecca Enonchong, one of Africa’s most prominent tech entrepreneurs, is reportedly set to appear before a court in her home country, Cameroon, on Thursday after she was arrested on Tuesday, August 10.\nThis is according to Edith Kah Walla, the leader of the Cameroon People’s Party (CPP).\n— Kah Walla (@KahWalla) August 11, 2021Enonchong remains in police custody and has been scheduled to appear at the Bonanjo Court of First Instance, Douala, on Thursday morning.\nhttps://t.co/8FxfOLSxlq — Kah Walla (@KahWalla) August 11, 2021Who is Rebecca Enonchong?\nOutside of her work in tech, Enonchong has been an advocate for progressive policies and better governance in Cameroon."
  },
  {
    "headline": "Nigerian government to lift Twitter ban “in a matter of days or weeks”",
    "summarized_story": "The Nigeria Government has hinted on lifting the ban on twitter after a series of meetings and agreements with the company.\nMost importantly, the company has agreed to open an office in the country.\nThough there is still an ongoing deliberation on when that will be, twitter said the earliest it can make that happen will be in 2022.\nIt’s been a little over two months since the Nigerian government banned twitter over the “inappropriate presidential tweet” (according to twitter’s guide book) that was taken down by the social media company.\nGet the best African tech newsletters in your inboxThis is good news for millions of twitter users in the country who now rely on VPN to access the platform; both lifting of the ban and the prospect of having a Twitter office in the country."
  },
  {
    "headline": "Beyond funding, MAGIC Fund’s value-add helps early-stage founders scale",
    "summarized_story": "A fund by founders for foundersMAGIC Fund, launched in 2017, is an early-stage venture capital fund built by founders turned investors.\n“MAGIC is like a fund of micro funds built by founders,” Greenleaf told TechCabal in an interview.\nHelping founders on their journeyTwo, MAGIC believes that smaller funds run by founders perform best in early-stage investing.\nThis way, they help early-stage founders find product-market fit, fine-tune business models, and fundraising strategies for successful seed rounds.\nAccording to Greenleaf, the Fund’s partners offer mentoring, advice, and network connectivity to support investee-founders as they scale their businesses."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, What we’re discussing today: Yemi Keri and more women becoming angel investorsFundraising in Africa so..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Edo Polytechnic sets for Tech, Innovation Day in Sept – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Polytechnic, Usen, is set to organise a Technology and Innovation Day, to exhibit novel innovative tools and equipment developed by students, lecturers, artisans, entrepreneurs and other critical technology stakeholders in Edo State.\nRector of the polytechnic, Prof. Abiodun Falodun, in a chat with journalists, said the event will hold from September 21 to 23, 2021, noting that it is an initiative of the institution to provide a platform to showcase innovative and entrepreneurial output from the school and its host community.\nHe said the exhibition is themed, ‘Repositioning the Nigerian Ecosystem for Excellence and Innovation in Technological and Technopreneurial Advancements’, while the guest speaker at the event is the Director-General (DG) of the National Space Research and Development Agency (NASRDA), Dr. Halilu Shaba.\nAccording to the rector, “The event will feature exhibitions by industries, staff, students, entrepreneurs, Small and Medium Enterprises (SMEs), artisans, government and Non-Governmental Organisations (NGOs), and awards will be presented to different categories of winners.”Some of the equipment that will be on display include fabricated yam pounding machines, waste to wealth plastic recycling equipment and software applications, among others.\nProf. Falodun said the event is aligned with the Governor Godwin Obaseki-led administration’s mandate for institutions of higher learning in the state to deploy technology in solving society’s problems."
  },
  {
    "headline": "Obaseki mourns death of former First Lady, Hadiza Shagari – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has mourned the passing of former First Lady, Hajiya Hadiza Shehu Shagari, widow of late President Shehu Shagari.\nIn a statement, the governor described the death of Hajiya Hadiza Shagari as painful, noting that she was gracious and dutiful in the discharge of her role.\nAccording to him, “I am saddened by the news of the death of former First Lady, Hajiya Hadiza Shehu Shagari, widow of late President Shehu Shagari.\n“On behalf of the Government and people of Edo State, I commiserate with Rt.\nAminu Waziri Tambuwal, the Governor of Sokoto State, the entire Shagari Family as well as friends and associates of the family and pray that God will grant us all the fortitude to bear this irreparable loss.”..."
  },
  {
    "headline": "Passenger Train Crushes Mother, Child To Death In Delta – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – Tragedy struck today as passenger train, plying the Itakpe – Warri railway on Thursday, crushed a mother and her child to death in Orhuwhorun community, Udu Council area of Delta state.\nThe Nigerian Observer gathered that the incident occurred at about 3:40pm in the Aragba area of the community.\nAccording to reports, the woman, a moi-moi seller and her teenage daughter, were walking on the rail tracks when the unfortunate incident happened.\nWhile the mother was ran over by the train, the daughter appeared to have been knocked off the rail tracks, where her body laid.\nIt was gathered that the train was bound for the Ujevwu Train Station in Udu and scheduled to return to Itakpe in Kogi state this evening."
  },
  {
    "headline": "Obaseki expresses satisfaction with ongoing overhaul of state-owned varsity, praises special intervention team – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Friday, said his government remains committed to restructuring the state-owned Ambrose Alli University to meet global standards, expressing satisfaction with the progress of the ongoing overhaul of the institution by the Special Intervention Team.\nObaseki, who received an updated report from the chairman of the team, Mr. Andrew Olotu, at the Government House in Benin City, said the government will continue to support the committee to realize its mission.\nAccording to him, “We are going to provide you with the key infrastructure needed to build a world-class university, so that we achieve our goal of using technology to change the future of the school.\nWhatever support you want us to give you, we will give you; the feedback I get is that sanity is returning back to the university.\nIzekor further said the team had put measures in place to activate a profound re-engineering academic programme, noting that the institution can generate funds to sustain its operations."
  },
  {
    "headline": "Weather report across Nigeria from Sunday to Tuesday – NiMet",
    "summarized_story": "Monday’s weather over parts of Kebbi, Sokoto, Zamfara, Jigawa, Bauchi, Taraba, Adamawa, Katsina, and Yobe States in the morning hours would be thunderstorm.\nCloudy skies with rains are anticipated over parts of Kwara, Plateau and the Federal Capital Territory in the morning hours,” NiMet said.\n“Later in the day, rains are expected over parts of Plateau, Niger, Kogi, Benue and the Federal Capital Territory.\n“Rains are anticipated over parts of Kwara, Niger, Nasarawa, Kogi, Benue and the Federal Capital Territory in the morning hours.\n“Rains are anticipated over parts of Lagos, Cross River and Delta state in the morning hours."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "First Bank deepens financial inclusion with N100b facility",
    "summarized_story": "Barely a year after the launch of the Firstmonie Agents Credit scheme, First Bank, announced last week that it has economically empowered its Firstmonie Agents with the sum of N100 billion.\nFor a bank which prides itself as the nation’s financial inclusion services provider and has pursued the financial inclusion drive of the Central Bank of Nigeria (CBN) and the federal government with vigour, this may be another exciting way of matching words with action.\nAccording to World Bank, financial inclusion means that individuals and businesses have access to useful and affordable financial products and services that meet their needs – transactions, payments, savings, credit and insurance – delivered in a responsible and sustainable way.\nWorld Bank also notes that access to a transaction account is a first step toward broader financial inclusion since it allows people to store, send and receive money.\nA few years ago, the CBN set a target of 80 percent financial inclusion by 2020."
  },
  {
    "headline": "First Bank sponsors 5th edition of Olusegun Obasanjo golf tournament",
    "summarized_story": "First Bank of Nigeria Limited has announced its sponsorship of the 5th edition of the Chief Olusegun Obasanjo golf tournament, organized by the Abeokuta golf club.\nThe competition, which is scheduled to hold on Saturday, 14th August 2021 will have Chief Obasanjo perform the ceremonial Tee-off to the glamour of the 150 golfers participating from across Nigeria.\nSpeaking on the competition, Kola Adeneye, the Captain of the Abeokuta golf club, said; “Abeokuta golf club is putting up this tournament, fully sponsored by First Bank of Nigeria Limited to celebrate Chief Olusegun Obasanjo, whom we all know to be an icon, a patriotic Nigerian and an entrepreneur.\nHe is worthy to be celebrated and it’s not only when somebody dies that you celebrate him.\nThe Bank’s influence in the development of sports in Nigeria is under its [email protected] initiative."
  },
  {
    "headline": "11-year-old Owoeye Dorcas seeks N2m for skeletal dysplasia surgeries",
    "summarized_story": "By Sunday Oguntuyi, OsogboAn 11-year-old girl, Owoeye Dorcas is seeking the help of Nigerians to raise a sum of N2m for her skeletal dysplasia surgery.\nDorcas is been suffering from multiple skeletal dysplasia – a deformity she has had from childhood – and will require multiple surgeries to correct the deformities in her limbs.\nAccording to the statement, “the patient is being managed by our unit for multiple skeletal dysplasia.\nOwoeye appealed to all the well-meaning Nigerian to come to his aid and rescue his daughter, Dorcas from multiple skeletal dysplasia.\n“Dorcas is being managed by our unit”, the doctor saidHere are the account details of for any financial assistance; 3050243386, Bank: First Bank, Account Name: Owoeye Sunday James, the phone number to call is: 08132989992"
  },
  {
    "headline": "Book Clubs Network to host National Conference/AGM in Uyo",
    "summarized_story": "OBINNA EZUGWUThe Network of Book Clubs and Reading Promoters in Nigeria will host first National Conference and Annual General Meeting (AGM) in Uyo, the Akwa Ibom Capital from September 16 through 19, 2021, a statement from the group has disclosed.\nAccording to the reading promotions and books advocacy outfit, the event is scheduled to hold at Watbridge Hotel and would feature a conference, reading sessions, sightseeing and performance events.\nGoodwill messages are also expected to be delivered by book trade organisations and lovers of the book and reading.\nEstablished in February 2020, the Network of Book Clubs and Reading Promoters in Nigeria ‘has continued to position itself as a platform for galvanising disparate book club energies in the country while also engendering even more activity that would be overly beneficial to the book sector and the country.’Member clubs that make up the Network include Oleh Book Club, Uyo Book Club, Asaba Reading Club, Ignite Africa Leadership Foundation, iRead Mobile Library, Arepo Book Club, PEA Foundation, Warri Book Club, Raffia City Book Club, Osogbo Book Club and Eket Book Club.\nOthers are Aba Book Club, Bookworm Cafe, Atiba Book Club, CRIMMD Free Public Library, CSS Book Club, Ibadan Book Club, Laterna Book Club, Ikorodu Library Book Club, Lead Out Education Foundation, Openway Reading Awareness Initiative, Readland Leadership Children’s Centre, Writers in Motion, Pens and Voices Book Club, Read2Me Book Club, The Bibliotheque Nigeria, The African Writers Tribe and The 1402 Book Lounge."
  },
  {
    "headline": "Nigerian drags UK govt to court for detaining, denying him entry after landing at Manchester airport",
    "summarized_story": "Opebiyi, who described himself as the Head of Operations, Sabi Micro Finance Bank Ltd, said on arriving at Manchester Airport on March 14, 2021, he was stopped by the UK Immigration official, who insisted that he must be interviewed before he could be allowed into the UK.\nHe claimed that he was subsequently detained for 10 days before he was finally deported to Nigeria on March 24.\n“Furthermore, you were initially unable to state the correct names of the current Chairperson and Managing Director of Sabi Micro Finance Bank Ltd.\nThe suit was filed upper Tribunal (Immigration and Asylum chamber) UK, with the Secretary of State for Home Department (UK) named as the sole respondent to the suit.\nThe respondent’s decision that he was not employed, or that false information was used in obtaining his visa, is wrong."
  },
  {
    "headline": "Nigerian drags UK govt to court for detaining, denying him entry after landing at Manchester airport",
    "summarized_story": "Opebiyi, who described himself as the Head of Operations, Sabi Micro Finance Bank Ltd, said on arriving at Manchester Airport on March 14, 2021, he was stopped by the UK Immigration official, who insisted that he must be interviewed before he could be allowed into the UK.\nHe claimed that he was subsequently detained for 10 days before he was finally deported to Nigeria on March 24.\n“Furthermore, you were initially unable to state the correct names of the current Chairperson and Managing Director of Sabi Micro Finance Bank Ltd.\nThe suit was filed upper Tribunal (Immigration and Asylum chamber) UK, with the Secretary of State for Home Department (UK) named as the sole respondent to the suit.\nThe respondent’s decision that he was not employed, or that false information was used in obtaining his visa, is wrong."
  },
  {
    "headline": "FG repatriates 22 ex-ISIS members’ families, 79 others from Libya",
    "summarized_story": "The Federal Government has repatriated 101 stranded Nigerians from Libya.\nThe individuals who included 22 family members of slain members of terrorist group, Islamic State, arrived in Abuja, on Friday.\nThis was contained in a statement on Saturday by the Head, Media, Public Relations and Protocols, Nigerians in Diaspora Commission, Abdur-Rahman Balogun, titled, ‘FG facilitates return of 101 stranded Nigerians.’The returnees were received by officials of Ministry of Foreign Affairs; NIDCOM; Nigeria Centre for Disease Control; National Drug Law Enforcement Agency; National Emergency Management Agency; Department of State Services; Nigeria Immigration Service and Port Health.\nThe statement read, “The stranded Nigerians include the 22 family members of suspected former members of ISIS that were killed in Libya as well as their children.\n“All evacuees came with Negative PCR test for Covid- 19, and landed at exactly 10.15 pm at Nnamdi Azikiwe International Airport GAT wing, aboard Airforce C130.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "FG repatriates 22 ex-ISIS members’ families, 79 others from Libya",
    "summarized_story": "The Federal Government has repatriated 101 stranded Nigerians from Libya.\nThe individuals who included 22 family members of slain members of terrorist group, Islamic State, arrived in Abuja, on Friday.\nThis was contained in a statement on Saturday by the Head, Media, Public Relations and Protocols, Nigerians in Diaspora Commission, Abdur-Rahman Balogun, titled, ‘FG facilitates return of 101 stranded Nigerians.’The returnees were received by officials of Ministry of Foreign Affairs; NIDCOM; Nigeria Centre for Disease Control; National Drug Law Enforcement Agency; National Emergency Management Agency; Department of State Services; Nigeria Immigration Service and Port Health.\nThe statement read, “The stranded Nigerians include the 22 family members of suspected former members of ISIS that were killed in Libya as well as their children.\n“All evacuees came with Negative PCR test for Covid- 19, and landed at exactly 10.15 pm at Nnamdi Azikiwe International Airport GAT wing, aboard Airforce C130.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Akeredolu: Victims of Plateau massacre Ondo people heading to Ikare",
    "summarized_story": "Governor Rotimi Akeredolu of Ondo state said most of the victims of Saturday massacre in Plateau state were citizens of his state.\nThe Full statement:Ondo State Governor, Arakunrin Oluwarotimi Akeredolu,SAN, just a few hours ago, received the unfortunate report of the Plateau state tragedy where some people believed to be indigenes of Ondo State were attacked.\nThe Governor says from report he received from his brother Governor in Plateau, the incident was a case of mistaken identity.\nGovernor Akeredolu hereby calls for calm among the people of the state, urging that nobody should take law into their hands.\nGovernor Akeredolu assures all Indigenes of Ondo state living outside the State of his commitment to their safety."
  },
  {
    "headline": "Updated: 304 killed in Haiti earthquake, hundreds missing",
    "summarized_story": "Agency ReportsNo fewer than 304 people died and hundreds were injured or missing after a 7.2 Magnitude earthquake struck southwestern Haiti on Saturday.\nWithin hours the US Geological Survey (USGS) estimated ‘thousands of fatalities’ and ‘tens of thousands of injuries in poor mountainous communities’.\nJerry Chandler, Haiti’s director of civil protection, told the Associated Press that the official death toll by 7pm (ET) stood at 304.\nAccording to the update provided by the authorities, the earthquake reduced churches, hotels and homes to rubble.\nThe nearest big town was Les Cayes, where many buildings collapsed or suffered major damage, according to authorities, who said they were searching for survivors."
  },
  {
    "headline": "Another Chibok Schoolgirl Returns Home, Surrenders To Nigerian Army",
    "summarized_story": "Babagana Umara Zulum, the governor of Borno State, has received another Chibok schoolgirl who has surrendered to the Nigerian Army.\nOn April 14, 2014, Boko Haram fighters invaded the Borno school and whisked away no fewer than 270 students.\nNEWS DIRECT had reported that Ruth, alongside her husband, a Boko Haram-ISWAP terrorist, surrendered themselves to the Nigerian troop at a location in Bama.\nZulum’s spokesman, Malam Isa Gusau, in a statement, had said the governor received the Chibok schoolgirl at the Government House on Saturday in the presence of overwhelmed parents who reunited with her.\nThe Chairman of the Chibok Girls Movement, an association of all affected parents, Yakubu Keki, had expressed joy over the return of Ruth"
  },
  {
    "headline": "IPOB – Why We Suspended Monday’s Sit-at-home Order",
    "summarized_story": "The Indigenous People of Biafra has stated why it has discontinued the weekly sit-at-home order that it had previously imposed in the South-East states.\nReacting, the group’s media and publicity secretary, Emma Powerful, explained that the suspension was a directive from the leader, Kanu.\nHe, however, stated that should there be another directive from the group’s highest command requiring a reactivation of the suspended weekly sit-at-home, there would be no hesitation to lift the suspension.\n“The suspension of the sit-at-home by the IPOB Head of Directorate was as a result of a direct order from the leader of this great movement, Nnamdi Kanu.\n“Any other information regarding Sit-At-Home in Biafraland not emanating from IPOB through our main channels of information dissemination should be disregarded."
  },
  {
    "headline": "Federal Government Drags Striking Doctors To Court",
    "summarized_story": "The Nigerian Association of Resident Doctors (NARD) has been taken to the National Industrial Court of Nigeria by the Federal Government over ongoing industrial action.\nChris Ngige, the Minister of Labour and Employment, revealed this in a letter to NARD and the Federal Ministry of Health on Friday.\n“Whereas trade dispute has arisen and now exists between NARD and the Federal Ministry of Health/Federal Government and whereas efforts to promote settlement through conciliation were ongoing but had now failed.\n“Further considering that the Federal Ministry of Health claims to have and produced evidence to have met most of their demands based on the various Memorandum of Action reached during past conciliations, especially that of July 22.\n“‘I, hereby refer the matter for consideration, and the issues in dispute to the National Industrial Court of Nigeria for adjudication,” he said."
  },
  {
    "headline": "Shehu Sani Condemns Killing Of 22 Muslims In Plateau By Hoodlums",
    "summarized_story": "Senator Shehu Sani, a former congressman from Kaduna Central Senatorial District, denounced the massacre of 22 Muslims in Plateau State on Saturday.\nThe victims were allegedly attacked while on their way to the ‘Annual Zikr prayers’ in Bauchi State.\nThe Plateau Police Public Relations Officer, ASP Ubah Ogaba confirmed the attack earlier.\nReacting to the gruesome murder of the travellers in a Facebook post, Senator Sani condemned the action of the suspected hoodlums, and urged the state and federal governments to take action immediately.\nAccording to him, “the gruesome killings of twenty two Muslim faithfuls in Plateau State by Hoodlums while on their way back from the ‘Annual Zikr prayers’ in Bauchi state stands unreservedly condemned."
  },
  {
    "headline": "Breaking: In Gwoza, Zulum receives another Chibok schoolgirl with kids (Pictures)",
    "summarized_story": "Borno state Governor, Babagana Umara Zulum, on Saturday in Gwoza, received another Chibok girl who was rescued by the 26 Task Force Brigade, Gwoza.\nAccording to the official Facebook handler of the governor: “The schoolgirl, Hassana Adamu, alongside her two children, was handed over to Governor Zulum by the Commander, 26 Taskforce Brigade, Brigadier General DR Dantani.\n“Zulum was in Gwoza from there he moved to Bama, undertaking humanitarian activities.\nHe has just returned from northern Borno where he spent five days for humanitarian interventions.”Hassana was one of over 200 schoolgirls abducted at a government secondary school in Chibok on April 14, 2014, by Boko Haram insurgents.\nRuth Ngladar Pogu and a man said to be her husband had presented themselves to the Nigerian Army on July 28, 2021, at a location in Bama."
  },
  {
    "headline": "Breaking: 25 killed, many injured as unknown gunmen attack travellers in Jos",
    "summarized_story": "At least 25 travellers, out of 90 from Ondo and Ekiti states, were allegedly intercepted by Irigwe youths, along Rukuba road, off Gada-biyu, in Jos North Local Government Arae (LGA) of Plateau State.\nIbrahim said their five 18-seater buses were coming back from Bauchi state after attending an event to celebrate the Islamic new year in Bauchi, at Sheikh Dahiru Usman Bauchi, Mosque.\nThe Plateau state police Spokesman ASP, Ubah Ogaba, has confirmed the incident.\n“They were intercepted along Rukuba road, off Gada-biyu, in Jos, while on their way back to their respective states.\nThe governor however commended security agencies for their immediate response leading to the arrest of some suspects and the restoration of calm to the area."
  },
  {
    "headline": "Breaking: Chelsea thrash Crystal Palace in Premier League season opener",
    "summarized_story": "Reigining UEFA Champions League champions, Chelsea, a while ago on Saturday thrashed visiting Crystal Palace 3-0 in one of the opening matchday games.\nThe victory for Chelsea is coming few days after the London club won Community Shield against Spainish side and Europa winners Villarreal.\nDetails loading"
  },
  {
    "headline": "Crown University Int’l Chartered partners KASU to boost education -NigPilot",
    "summarized_story": "Chartered Inc. Santa Cruz, Argentina with Partners constituent campuses and associates worldwide and Kaduna State University, Kaduna, Kaduna State , is meant to empower both institutions for better education.\nVice-Chancellor, Crown University Intl.\n“There shall be reciprocal/dual certifications and top-up degree arrangements between Kaduna State University on undergraduate and graduate programs on a credit transfer-based criterion established by Kaduna State University, Kaduna, Kaduna State, Nigeria.\n“Crown University Intl Chartered Inc. shall pay any tuition charged by Kaduna State University, Kaduna, Kaduna State, Nigeria per student for all applicable Degrees.\nTransfer students must submit their Transcripts from former Institutions to Kaduna State University, Kaduna, Kaduna State, Nigeria,” added Aremu."
  },
  {
    "headline": "Unlawful Detention: Army GOC Dares Court, Refuses to released Gov. Ugwuanyi’s Aide",
    "summarized_story": "Seven days after a Federal High Court ordered the Nigerian Army to release unconditionally a Nigerian citizen, the Senior Special Assistant (SSA) on Security matters to the Enugu State Governor, Tochukwu Cornelius Okeke, the Nigerian Army has refused to obey the orders.\nOkeke is alleged to be kept in detention under the instructions of the General officer commanding ( GOC) 82 Mechanised Division Enugu, Major General.\nTaoreek Lagbaja, as the Nigerian Army had earlier failed to produce him in court before the court ordered his release.\nThe respondents were equally ordered to appear and show cause why the applicant should not be granted bail or be released unconditionally from custody.\nJustice Mohammed has however directed the applicant to serve all the processes relating to the case on the respondents."
  },
  {
    "headline": "American university confers honors on Nigerian Prof, Aremu -NigPilot",
    "summarized_story": "The Noble International University has conferred an honorary Professor Emeritus on UNESCO Laureate Prof Sir Bashiru Aremu, with an award of “Most Academy Excellent World Acclaimed Distinguished Professor Emeritus” on merit.\nHe was also ranked as a Top-up Certificate with a world-acclaimed certificate of recognition for achievements.\nReacting to the award presentation, Aremu, thanked the institution’s authorities for finding him worthy of being honored.\n“I feel highly honored to be decorated with such an award of that magnitude by an institution of learning in the mode of Noble International University,” Aremu stated.\nNoble International University has agreements for joint education and exchange with international universities, and also trains them to become the best environmental and social citizens."
  },
  {
    "headline": "Allegation of Col Sakaba’s assassination is baseless, unfounded -NigPilot",
    "summarized_story": "The Nigerian Army said that the uncomplimentary comments credited to Mrs. Oluwaseun Sakaba, the widow of late Col Ibrahim Sakaba that whose late husband was assassinated to cover up corruption are unfounded and baseless claims devoid of any fact.\nMrs. Oluwaseun Sakaba, alleged that the late senior officer was assassinated for refusing to loot funds meant for fighting the Boko Haram Insurgency.\nThe late senior officer’s widow was quoted to have made several uncomplimentary comments about the institution of the Nigerian Army (NA), making reference to unfounded and baseless claims devoid of any fact.\nCol Sakaba was a respected senior officer who gave his all in the defense of the freedom we all enjoy today.\n“All entitlements meant to be paid by the NA have been paid to the NOK through Mrs. Oluwaseun Sakaba."
  },
  {
    "headline": "Presidency Condemns ‘Brazen’ Attack On Travellers In Plateau",
    "summarized_story": "The Presidency has condemned an attack on travellers along Rukuba road in Jos North Local Government Area of Plateau state on Saturday morning.\nIn a statement signed by presidential spokesperson Garba Shehu, the Presidency described the attack as “brazen and wickedly”.\nSome 25 persons were confirmed killed and 14 injured in the attack, Channels Television reported earlier.\nREAD ALSO: 25 Killed In Plateau AttackThe victims were attacked while travelling from Bauchi en-route Jos to Ikare in Ondo state.\nMeanwhile, President Muhammadu Buhari has ordered security agencies to fish out the perpetrators."
  },
  {
    "headline": "Nigerian Army Hands Over Another Chibok Schoolgirl To Zulum",
    "summarized_story": "Borno State Governor, Babagana Zulum, on Saturday in Gwoza, received another Chibok schoolgirl who presented herself to the Nigerian Army.\nThe schoolgirl, Hassana Adamu, alongside her two children, was handed over to Governor Zulum by the Commander, 26 Taskforce Brigade, Brigadier General DR Dantani.\nShe is the second Chibok schoolgirl to be received by the Borno State Government within two weeks.\nAnother Chibok schoolgirl, Ruth Ngladar Pogu and a man said to be her husband, had presented themselves to the Nigerian Army on July 28 at a location in Bama.\n“As a father of all sons and daughters of Borno, I haven’t lost hope that our remaining Chibok schoolgirls and other abducted persons will be safely recovered,” the Governor said."
  },
  {
    "headline": "25 Killed In Plateau Attack",
    "summarized_story": "Twenty-Five persons were confirmed killed and 14 injured along Rukuba road in Jos North Local Government Area of Plateau state on Saturday morning.\nThe victims were attacked while travelling from Bauchi en-route Jos to Ikare in Ondo state.\nPlateau State Governor Simon Lalong has reacted to the incident in a statement signed by spokesperson Simon Makut.\nThe statement added that the Governor has also directed security agencies to swiftly identify and arrest perpetrators.\nThe spokesperson of Operation Safe Haven, a military task force set up to maintain peace in Plateau State, Major Ishaku Takwa, said 12 persons have been arrested in connection with the incident, while normalcy has been restored in the area."
  },
  {
    "headline": "Two Operatives, Three Gunmen Killed In Fresh Attack On Imo Police Station",
    "summarized_story": "Two policemen and three gunmen lost their lives on Friday when a group of armed men attacked a police station Oguta Local Government Area of Imo State.\n“They (the assailants) fled into the bush and in the process three of the bandits were neutralised … while others escaped into the bush with bullet wounds,” Abattam said.\nHe also asked hospitals in the area to report anyone who seeks treatment of bullet wounds to the police.\nFriday’s incident followed the attack on a police station in Orsu Local Government Area of the state.\nAlthough the police said the attack was also repelled, they confirmed the death of an inspector and three assailants in the incident which occurred on Thursday last week."
  },
  {
    "headline": "Plateau Attack: Akeredolu Calls For Calm",
    "summarized_story": "Ondo State Governor, Mr Rotimi Akeredolu, has appealed to residents of the state not to take laws into their hands over an attack on indigenes of the state in Rukuba village of Plateau State.\nHe also appealed to the people to refrain from any hasty colouration of the incident, maintaining that Ondo State indigenes living in Plateau State are not targets of any religion or ethnic crisis.\nSome 25 persons had been confirmed killed and 14 injured along Rukuba road in Jos North Local Government Area of Plateau State on Saturday morning.\nThe victims were attacked while travelling from Bauchi en-route Jos to Ikare in Ondo State.\nPlateau State Governor Simon Lalong has reacted to the incident in a statement signed by spokesperson Simon Makut."
  },
  {
    "headline": "Two abducted ward attendants, patient’s relative regain freedom in Zamfara",
    "summarized_story": "Two ward attendants and a relation to a Patient who were abducted in General Hospital Dansadau in Maru local government area of Zamfara state regained freedom.\nThey were abducted early hours of Friday 30th July When gunmen invaded the Hospital with the intent to abduct Medical Doctors and Nurses who will be treating their injured partners in crime and kidnap victims in their enclavesTwo other female staff of the hospital also sustained Injuries during the invasionThe Chairman of the Nigerian Medical Association Zamfara state branch Dr. Mannir Bature confirmed their release to TVC NEWSHe said, no ransom was paid for their releaseAdvertisementRecalled that Medical Doctors in Zamfara had issued ultimatum to the state government to provide security to heath workers and Hospitals across the state or will embark on skeletal services to enable health workers close early and return home in good time."
  },
  {
    "headline": "Jebba-Mokwa-Tegina road not cut off – FG",
    "summarized_story": "The Federal Ministry of Works and Housing has denied an online story over the weekend, stating that a bridge along Jeba -Mokwa road had callapsed resulting in total closure of the road.\nIn a statement issued on Statement, the ministry described the report as a total falsehood.\n” This is totally false as the recently constructed Talabu bridge along the road that was claimed to have collapsed is intact contrary to the online report”Faulting the story, the motorists flying the Jeba-Mokwa road who were interviewed confirmed that the road has not been cut off anywhere, as their movement has not been affected in any way as claimed in the storyConsequently, the Permanent Secretary, Ferderal Ministry of Works and Housing, Babangida Hussaini, assured motorists that the road is safe and passable, urging them to disregard the story and not to panicMr Babangida further reassured the public that the administration of President Muhammadu Buhari is working tirelessly to provide good roads for Nigerians, as such called on the citizens to give the government necessary support and encouragementAdvertisementHe explained that the Ministry has Controllers of Works in every state that will quickly inform the Ministry of any emergency of such nature on our roads for immediate intervention.\nMr Babangida therefore appealed to Nigerians to verify stories received on social media before sharing such ."
  },
  {
    "headline": "22 commuters killed in Jos, 14 others injured",
    "summarized_story": "Police in Plateau state have confirmed the killing of 22 commuters by irate youths in the Rukuba area of Jos, the state capital.\nSpokesperson of the Command Gabriel Abuh said the victims were in a convoy of 5 buses from Bauchi to the Southern part of the country when they were attacked Saturday morning.\nThe youth had blocked the road in protest of recent attacks and killing of locals by suspected herder militiamen in Bassa local government area of the state before the act began.\nBut the authorities say beyond the 22 lives lost, 14 others sustained varying degrees of injury.\nThe Plateau state government has condemned the act and ordered security operatives to investigate the incident and ensure the perpetrators are made to face justice."
  },
  {
    "headline": "Liverpool Ease to 3-0 Victory Over Norwich in Season Opener",
    "summarized_story": "Liverpool kicked off their 2021-22 Premier League campaign with a straightforward win over Norwich City at Carrow Road on Saturday.\nDoigo Jota fired Liverpool in front in the 26th minute, firing a low drive past Norwich keeper Tim Krul to stake Jurgen Klopp’s side to a half-time lead.\nLiverpool doubled their lead in the second half when Roberto Firmino redirected a Mohammed Salah assist past Krul in the 65th minute to make it 2-0.\nWith defensive linchpin Virgil van Dijk back after nine months out with a serious knee injury, Liverpool enjoyed a relatively trouble-free evening.\nNext up for Liverpool is a home match against Burnley on Aug. 15, while Norwich face Manchester City at the Etihad on the same day."
  },
  {
    "headline": "Dream Debut Goal for Chalobah as Chelsea Trounce Crystal Palace 3-0",
    "summarized_story": "Trevoh Chalobah scored the pick of the goals on his Premier League debut as Champions League winners Chelsea made light work of Crystal Palace at Stamford Bridge.\nMarcos Alonso opened the scoring with a dipping free-kick while Christian Pulisic also fired in during a dominant first half showing.\n“It is a dream for a boy like me being here and to play for my home club is unreal,” Chalobah said after the game.\n“As I was getting closer to the goal I though I might as well shoot and just went for it.\nI was surprised by the Super Cup game too and I have taken the opportunity with both hands.”The result means Patrick Vieira starts his tenure at Crystal Palace with a loss."
  },
  {
    "headline": "Another Chibok Schoolgirl Emerges with Two Children, Seven Years After Abduction – Arise News",
    "summarized_story": "Another abducted Chibok schoolgirl emerged with two children birthed in captivity seven years after Boko Haram kidnapped her alongside over 200 others.\nHassana was one of over 200 schoolgirls abducted at a Government Secondary School in Chibok on April 14, 2014, by Boko Haram insurgents.\nZulum was in Gwoza from, when Hassana and her two children were presented to him.\nHe was in Gwoza to give humanitarian aide to the people of the town which was once the headquarters of Boko Haram caliphate.\nThe governor was few days ago in Borno North where he spent five days for humanitarian interventions."
  },
  {
    "headline": "Barcelona Finally Register New Signings Memphis Depay and Eric Garcia Thanks to Gerard Pique Salary Cut",
    "summarized_story": "Barcelona have now registered summer signings Memphis Depay and Eric Garcia — as well as forward Rey Manaj — ahead of the new LaLiga season thanks to Gerard Pique accepting a “substantial” pay cut, the club announced on Saturday.\n“FC Barcelona is able to register Memphis, Eric Garcia and Rey Manaj to play in the Spanish Liga de Futbol Profesional,” the club said in a statement.\nIt also meant that while Barca had announced the signings of Memphis and Garcia in June, the pair had not been officially registered with LaLiga until now.\nIn its statement on Saturday, the club also cited the work done in terms of outgoing player sales and loans to ensure the inclusion of the new arrivals.\n“The latter two operations were at 50% because they included the right to repurchase."
  },
  {
    "headline": "Man United Thrash Leeds 5-1, Bruno Fernandes Scores Hat Trick",
    "summarized_story": "Bruno Fernandes opened his Premier League season with a hat trick as Manchester United thrashed old rivals Leeds United 5-1 at Old Trafford on Saturday.\nLuke Ayling’s second half strike temporarily brought Leeds level but Mason Greenwood and Fred also scored for United and helped secure the win.\nUnited unveiled new signing Raphael Varane before the game with a presentation on the pitch.\nLeeds got back into the game three minutes into the second half with a stunning strike from Ayling.\nThe Portugal international completed his hat trick — his first since joining United — on the hour mark with a powerful strike past Meslier."
  }
]