[
  {
    "headline": "We’re living in squalor, we need help, Okobaba inmates cry out",
    "summarized_story": "Lara AdejoroThe Okobaba Destitute Home, located in Ebute Metta, Lagos, was established in the early ’90s by a former military administrator of Lagos State, Brig.\nThe Okobaba Destitute Home has, however, become not just a filthy overcrowded squalor but also a haven for infections.\nThose are the features that jump at any first-timer at the Okobaba Destitute Home, in Nigeria’s megacity, Lagos.\nEven among the destitute homes, Okobaba Destitute Home is a glaring victim of inequality.\nThe Okobaba Destitute Home is surely not feeling the impact of government."
  },
  {
    "headline": "We’re living in squalor, we need help, Okobaba inmates cry out",
    "summarized_story": "Lara AdejoroThe Okobaba Destitute Home, located in Ebute Metta, Lagos, was established in the early ’90s by a former military administrator of Lagos State, Brig.\nThe Okobaba Destitute Home has, however, become not just a filthy overcrowded squalor but also a haven for infections.\nThose are the features that jump at any first-timer at the Okobaba Destitute Home, in Nigeria’s megacity, Lagos.\nEven among the destitute homes, Okobaba Destitute Home is a glaring victim of inequality.\nThe Okobaba Destitute Home is surely not feeling the impact of government."
  },
  {
    "headline": "NAFDAC impounds 120 tons of imported ‘ponmo’, arrests seven merchants",
    "summarized_story": "Deborah Tolu-KolawoleThe National Agency for Food and Drug Administration and Control said it intercepted in Lagos State, large quantities of dangerous animal hides and skins popularly known as “Ponmo” with seven merchants of the deadly product in the agency’s net.\nThe Director-General of the agency, Prof. Mojisola Adeyeye, however, warned the general public, particularly consumers of Ponmo against the activities of some unscrupulous businessmen and traders who are selling industrial animal hides as food articles.\nThese hides and skins are then sold to the unsuspecting public as consumable animal skin products, otherwise called ‘Ponmo’.\nAdeyeye, however, alerted the general public to the existence of “these merchants of death and their nefarious activities as she warned Nigerians to exercise caution when buying animal hides, popularly known as Ponmo”.\n“NAFDAC wishes to advise consumers and retailers of Ponmo not to patronise importers of hides and skins for consumable animal skins,” she added."
  },
  {
    "headline": "NDLEA intercepts $4.7million counterfeit cash in Abuja",
    "summarized_story": "The operatives had in the early hours of Friday 18th February 2022 intercepted a consignment sent from Lagos to Abuja at Abaji area of the Federal Capital Territory.\nA controlled delivery of the parcelled counterfeit US dollars totaling $4, 760, 000.00 led to the arrest of a principal suspect, 52-year-old Abdulmumini Maikasuwa.\nThe seizure followed intelligence received by the FCT Command of the Agency detailing the movement of the cash and the vehicle conveying it.\nThe NDLEA Chief Executive has commended the officers and men of the FCT Command for their vigilance and preventing counterfeit $4.7 million from going into the streets.\nHe charged them and their counterparts in Adamawa, Kwara, Bauchi and others across the country not to rest on their oars."
  },
  {
    "headline": "Investing in people ‘ll hasten Nigeria’s devt — Bawa Garba",
    "summarized_story": "By Ibrahim Hassan-WuyoFounder of the first Satellite TV in Northern Nigeria, Alhaji Bawa Garba, ABG, has said Nigeria’s future will be bright if the country invests in its population by way of developing human capital.\nHe said that a productive population would ensure a bright and secure future for the upcoming generations.\nA retired Commissioner of Police, Garba Galadima, during the occasion, paid glowing tributes to ABG, describing him as a principled man of commendable virtues.\nOne of the children of Alhaji Bawa Garba, Hon.\nChildren, grandchildren and great-grandchildren of the octogenarian took turns to eulogize the celebrant, wishing him more happy years in service to Allah and mankind."
  },
  {
    "headline": "4,438 Kaduna indigenes aspiring to become police constables",
    "summarized_story": "Police have concluded the screening of 4,438 Kaduna State indigenes aspiring to become police constables.\nPolice spokesman in the state, ASP Mohammed Jalige, said on Sunday in Kaduna that that the screening covered applicants’ physical statuses and credentials.\nREAD ALSO: Police rescue 24 kidnapped victims in ZamfaraSuccessful ones would write a Computer-Based Test at a date to be announced later, Jalige told the News Agency of Nigeria (NAN) in Kaduna on Sunday.\nHe said applicants indicated interests in the job from the 23 local government areas of the state and that the screening held between Feb. 1 and Feb. 20 at the Police College, Kaduna.\nVanguard News Nigeria"
  },
  {
    "headline": "2023: ‘How Jonathan can be Nigeria’s president again’",
    "summarized_story": "Dr. Goodluck JonathanBy Omeiza Ajayi, AbujaAhead of next year’s general election, an Abuja-based pro-democracy and good governance advocacy group has asked former President Goodluck Jonathan to close ranks with President Muhammadu Buhari and join the ruling All Progressives Congress APC with a view to getting the party’s presidential ticket.\n[ALSO READ] 2023: Buhari, Jonathan tip Anyim for higher responsibilities“Over the years, it has been an all-comers affair.\n“Having carefully scanned the political firmament in search of a credible, knowledgeable, selfless, trusted and patriotic candidate to occupy the exalted position of President of Nigeria.\nOur searchlight has fallen on none other than former President Goodluck Ebele Jonathan GCFR.\nFor President Goodluck Jonathan he has shown that the interest of the Nigeria comes first."
  },
  {
    "headline": "IGBOHO: You can’t criminalise Yoruba Nation struggle, Akintoye dares FG",
    "summarized_story": "…as the Second Republic turns 87By Dayo Johnson, AkureLeader of the umbrella body of Yoruba self-determination groups, Ilana Omo Oodua Worldwide, Professor Banji Akintoye, has urged the Yoruba people who believe in the actualisation of Yoruba Nation to keep hope alive.\nHe also said he would not be marking his 87th birthday yesterday when Chief Sunday Adeyemo (Sunday Igboho) is in detention.\nAkintoye, a renowned historian and Second Republic senator spoke in a statement signed by the Communications Secretary of the Self-Determination Movement, Mr Maxwell Adeleye.\n“My message to the Yoruba people worldwide who are passionate for the country of their own is not to lose hope.\nThe Yoruba people worldwide are urged never to be deterred."
  },
  {
    "headline": "Nigeria’s judiciary open to initiatives – CJN tells US delegation",
    "summarized_story": "The Chief Justice of Nigeria (CJN), Hon (Dr) Justice Ibrahim Tanko Muhammad has clarified that the country’s judiciary is open to initiatives aimed at improving and strengthening the capacity of judicial officers in the handling of cases on emerging crime trend in the country.\nThe CJN’s remark at the occasion was made public on Sunday by Mr Ahuraka Yusuf Isah, Senior Special Assistant on Media to the CJN.\nSome of those emerging crimes, the CJN said include cybercrime, cross-jurisdictional infringement of Intellectual property rights, and cases related to cybersecurity and espionage.\nThe CJN requested for workshops that would border on Copyright Law in the new digital environment for judicial officers and Enforcement of Foreign Arbitral Awards relating to intellectual property disputes.\nMs. Leonard hinted that the U.S. was exploring how best to support Nigeria’s judicial processes during the 2023 elections."
  },
  {
    "headline": "Nicholas John: South Africa police make promise after death of Nigerian",
    "summarized_story": "The South African police have vowed to ensure the safety of Nigerians residing in the country, after the latest round of mob attacks that left a Nigerian, Nicholas John, dead.\nThe police made the promise when the leadership of the Nigeria Union South Africa (NUSA), led by Mr Collins Mgbo, its President, met stakeholders at Kimberley district in Northern Cape, South Africa, where a Nigerian died, after a mob attack.\nRikhostso, the host community, representatives of religious organisations and the South African widow of late Mr John.\n“The police have promised the Nigerian community that they’ll make sure their lives and properties are protected.”On Feb. 17, Mgbo had announced the death of Nicholas John after attacks on foreigners by South African gangsters.\nHe identified John as an indigene of Ogun State in the Southwest part of Nigeria, who made his living selling cars, in Kimberley district, South Africa."
  },
  {
    "headline": "Shehu Sani reacts to killing of eight traders in Abia cattle market, tasks govt",
    "summarized_story": "Shehu Sani, a socio-political activist, has reacted to the killing of eight Northerners in Abia cattle market.\nSani urged the Abia State Government to ensure that those behind the killed were dealt with.\n“The cold blooded murder of eight persons in the Abia cattle market stands unreservedly condemned.\nof Abia State must ensure the perpetrators are brought to justice and the families of the deceased compensated.\nRecall that hoodlums recently attacked the new Abia cattle market in Omuma Uzo, Ukwa West Council Area, killed traders, mostly northerners and slaughtered their cows."
  },
  {
    "headline": "FBI vs Hushpuppi: FG told to extradite Abba Kyari to US after NDLEA arrest",
    "summarized_story": "In August 2021, the FBI asked Nigeria to hand Kyari over to them.\n“DCP Abba Kyari, who prior to this allegation was on suspension, shall remain so,” the PSC wrote.\n“DCP Abba Kyari should be allowed to face his crimes in the United States.\n“The overflow of corpses of Igbo youths at the FMC Owerri and other places in the South-East was the alleged handiwork of IRT team, led by Kyari; no wonder that nemesis caught up with Abba Kyari so quickly.\nNigerians want a thorough investigation of the alleged criminal indictment of Abba Kyari and subsequent extradition to the United States.”"
  },
  {
    "headline": "Benue: Troops rescue 8 kidnapped victims",
    "summarized_story": "As the fight against criminality intensifies in Benue State, troops from Operation Whirl Stroke, OPWS, Saturday, made a huge breakthrough when they rescued 8 persons from kidnappers’ den.\nThe rescued locals, who hail from Agasha town, in Guma Local Government Area, were kidnapped on their farms by herdsmen on Wednesday, February 16th, 2022.\nThe Chief Press Secretary to Governor Ortom, Mr. Nat Ikyur, in a press statement, Sunday morning, said the victims had spent over three days with their abductors before their rescue.\nHe maintained that the superior firepower of the soldiers overwhelmed the kidnappers who fled in disarray, leaving behind the kidnapped victims.\nThe victims have since been reunited with their families."
  },
  {
    "headline": "Enugu shuts markets, offices for council polls",
    "summarized_story": "The Enugu State Government has announced that council polls will hold next.\nThe government also announced that markets, parks and offices would be closed while movement of persons and vehicles would be restricted from 8am to 4pm except for those on essential duties.\nA statement by the Special Adviser to the Governor on Information, Steve Oruruo explained: “The Enugu State Government (ENSG) wishes to notify the public that Local Government elections will hold on Wednesday, February 23, 2022, across the state.\n- Advertisement -“During this period, markets and offices shall be closed and movement of persons and vehicles restricted, except for those on essential duties.\n“All residents legally qualified to vote are therefore encouraged to go to the polls and cast their ballots."
  },
  {
    "headline": "Drama as Niger Councillor chases govt officials with dogs, thugs",
    "summarized_story": "The Councillor is having a running battle with members of his ward over the proposed gas plant.\nTo douse raging tension, some officials of the Niger State Environment Protection Agency met the Councillor with a letter of invitation last week.\nHe said thugs beat the NSEPA staff mercilessly before dogs chased them away.\nThe Official disclosed that there is no approval for the setting up of a gas plant in the community.\nSome of the residents however claimed that the Councillor is not the owner of the gas plant but protecting the owner after allegedly collecting N200,000."
  },
  {
    "headline": "Nigeria needs more rebels to move forward – Obasanjo",
    "summarized_story": "Former President Olusegun Obasanjo has said that Nigeria requires honest people as rebels to move her forward.\nObasanjo said people who live life of honesty and integrity have to also be rebels, explaining that life of honesty and integrity embolden one to speak truth to power, not caring a hoot whose ox is gored.\nAccording to Obasanjo, having honest people as rebels remained one of the greatest assets for rebuilding a nation.\nOur country, Nigeria, needs more rebels.\nThose who would look at things straight in the face and say ‘this is not good for Nigeria,” Obasanjo said."
  },
  {
    "headline": "APC convention: Govs split, may revolt against Buni committee",
    "summarized_story": "This development, sources told The Nation, prompted the Caretaker Extraordinary Convention Planning Committee (CECPC) to conclude plans to replace the Chairman of State APC Chairmen Forum, Hon.\nAttempts by some governors to prevail on state APC chairmen to call for the postponement of the convention have also failed.\n“These anti-convention governors cannot constitute themselves into Progressive Governors Forum (PGF).\n“In frustration, the CECPC has concluded plans to replace the Chairman of State APC Chairmen Forum, Hon.\n“Yet all the state APC chairmen came together to elect their leaders through a democratic process."
  },
  {
    "headline": "Official results of Osun APC primary election",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "2023 presidency: Why move to lure Jonathan into APC will fail – Aminu Wali, former Foreign Affairs minister",
    "summarized_story": "From Desmond Mgboh, KanoAmbassador Aminu Wali is Nigeria’s former minister of Foreign Affairs and a founding father of the Peoples Democratic Party (PDP).\nFor us, the national party leader is our sole leader.\nWhatever movement it is, regardless, should not arrogate itself the authority that can compete or disregard the party national leadership- because this is what is happening.\nThere is a new PDP national leadership today.\nThere is demand for Igbo president, Yoruba president or a Northern president or whatever president."
  },
  {
    "headline": "Contaminated fuel: Season of pain, sorrow",
    "summarized_story": "• Affected filling stations confused on how to evacuate adulterated petrol imported from Belgium• Motorists, commuters suffer as product price skyrocketsNigerians can now work and earn dollars DAILY from home.\nAn online video which surfaced recently shows a petrol attendant complaining about how the adulterated petrol dispensed at the station damaged cars and motorcycle engines.\n‘‘Should my vehicle be damaged as a result of this contaminated fuel, who will bail me out?\nThe adulterated petrol according to the regulator-Nigerian Midstream Downstream Petroleum Regulatory Authority(NMDPRA) has proved to be high in methanol concentration.\nBut prior to its recall, the adulterated fuel had already found its way into the Nigerian petroleum retail products market."
  },
  {
    "headline": "I feel better acting bad girl character",
    "summarized_story": "Recently, Uyanna took to her Instagram page to showcase a baby bump, a role she played in her new movie, Jackie’s Baby Bump.\nThe other one, Baby Bump will come out this month.\nCarrying that belle for long was really challenging, and the same thing happened in Jackie`s Baby Bump, which would be out in February.\nWe don’t see you nowadays acting the bad girl character, any reason for this?\nI feel I do better when I’m acting the bad girl character, like a nagging wife, a troublesome sister etc."
  },
  {
    "headline": "Uncertainty over APC planned national convention",
    "summarized_story": "From Romanus Ugwu, AbujaThere is indeed uncertainty over the much-awaited National Convention of the All Progressives Congress (APC) scheduled to hold on February 26.\n“Again, the planned postponement has nothing to do with the lingering controversial issue of zoning or delay in setting up of sub-committees for the convention.\n“The nomination forms that might be on sale however could be for the non-NWC positions.\nLet me add that if the party’s leadership fail nomination forms this week, it will be a confirmation that the convention may not hold this weekend as earlier planned.\nThere has not been any composition of sub-committees, acceptable resolutions on the controversial zoning arrangements, and more importantly the nomination forms that have not been printed."
  },
  {
    "headline": "Osun APC primaries: Oyetola leads, as Aregbesola’s faction kicks",
    "summarized_story": "Barring last minute change, Governor Gboyega Oyetola of Osun State appears set to emerge the candidate of the All Progressives Congress (APC) for the July governorship election in the state.\nAregbesola who led a faction of the APC, ‘The Osun Progressives (TOP), could not deliver his ward to his announced candidate, Moshood Adeoti.\nThe Chairman of the APC faction in the ward, Adegoke Saheed, blamed the loss of the ward for the absence of Aregbesola, alleging that the committee favoured Governor Oyetola.\n“We also need to inform the general public that appointees of Governor Oyetola were used as collation officers, which made the rigging plan of Oyetola an easy task.\nMeanwhile, Governor Oyetola has expressed confidence that he would emerge victorious in the ongoing primary election of the party."
  },
  {
    "headline": "Tinubu Floors Aregbesola as Oyetola Wins Osun APC Primary",
    "summarized_story": "The Osun State governor won in Aregbesola’s ward with 309 votes against 146 recorded for Adeoti, the aspirant anointed by Aregbesola.\nHowever, Aregbesola was absent from the primary election and was said to have left Ilesa for Abuja yesterday morning for unspecified official duty.\nAdeoti said the ugly development in Osun APC has sent a wrong signal as to whether the APC has a future in the state.\nHe also accused Oyetola of using intimidation and violence to ensure that the primary election was not free and fair.\n“We are reliably informed that Governor Oyetola is the one who hand-picked the Chairman and members of the primary election committee."
  },
  {
    "headline": "INEC Allays Fears on 2023 Elections, Says No Plan to Shift Polls",
    "summarized_story": "* Electoral Bill 2022 still inchoate, commission clarifiesChuks Okocha in AbujaThe Independent National Electoral Commission (INEC) has stated that the 2023 general election is not encumbered and will hold as planned, beginning with the presidential poll scheduled for February 18, 2023.\nAccording to Section 28 (1) of the Electoral Bill 2022, INEC is required to issue a notice of election not later than 360 days before the day appointed for an election.\nAccording to him, the existing and extant electoral legal framework for the conduct of elections remains the Constitution and the Electoral Act.\nThe INEC commissioner said that the speculations and anxiety relating to the shifting of the date of the 2023 elections were based on the Electoral Bill 2022 which is still inchoate.\nTherefore, the President has to give assent to the bill on or before 22nd February 2022 if the dates announced for the 2023 elections are to be maintained."
  },
  {
    "headline": "Security Agencies Move against Importers of Off-spec Petrol",
    "summarized_story": "The importation and circulation of adulterated petrol had resulted in damage to vehicle engines across many parts of the country.\nIt also affected the supply chain, causing long queues in Lagos and Abuja as filling stations shut down to clean up their tanks.\n“Security agencies have commenced detailed investigation into circumstances that led to the importation of toxic fuel into the country.\nIn both Lagos Island and the mainland, long queues of vehicles were seen at the few filling stations selling petrol.\nLong queues were also on both sides of the Karshi-Nyanya expressway, causing gridlock that stretched down the roads for kilometres."
  },
  {
    "headline": "CBN Has Enough FX to Meet Market Demand, Report Reveals",
    "summarized_story": "The analysts argued that the current low level of crude oil production has weakened foreign reserves accretion, a development which they said necessitated the implementation of policies that would encourage the inflow of foreign portfolio investments.\nAccording to the report, “the CBN has enough supply to support the FX market over the short term, given inflows from the recently issued Eurobond and the IMF’s SDR.\nLast year, Nigeria was able to raise $4 billion through Eurobonds, which financial analysts described as a reflection of investors’ confidence in the economy.\nSDRs are international reserve assets created by the IMF and allocated to members to supplement existing official reserves.\nHoldings of SDRs by an IMF member are recorded as an asset, while the allocation of SDRs is recorded as the incurrence of liability of the member receiving them."
  },
  {
    "headline": "News in Photographs: Osinbajo in Bayelsa",
    "summarized_story": "Vice President Yemi Osinbajo was in Bayelsa on Saturday, where he flagged off the construction of the Angiama-Oporoma bridge.\nHe was hosted by Bayelsa Governor Douye Diri, and also paid visits to traditional rulers in the state.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EXCLUSIVE: Oba Of Benin In Modern Slavery Scandal, Uses Influence To Detain Palace Aide Who Served Him From Age 15 In Prison For Months, Denies Him Bail Over Allegation Of Stealing",
    "summarized_story": "\"Some time ago, Nelson tried to run away from the palace because of the maltreatment and hardship he had endured.\nSaharaReporters learnt that Oghogho and the other were accused of stealing N200 million cash from the palace.\n\"Initially, he (Oba of Benin) said it was $20,000, then, he said N10 million, when he saw that he wasn’t getting as much solidarity.\n\"I don't understand the case you are talking about, the case is in court, do you want Omo n'Oba (Oba of Benin) to react to that?\nOba of Benin in Modern Slavery Scandal, Uses Influence to Detain Palace Aide Who Served Him From Age 15 in... by Sahara Reporters on Scribd"
  },
  {
    "headline": "EXCLUSIVE: Oba Of Benin In Modern Slavery Scandal, Uses Influence To Detain Palace Aide Who Served Him From Age 15 In Prison For Months, Denies Him Bail Over Allegation Of Stealing",
    "summarized_story": "\"Some time ago, Nelson tried to run away from the palace because of the maltreatment and hardship he had endured.\nSaharaReporters learnt that Oghogho and the other were accused of stealing N200 million cash from the palace.\n\"Initially, he (Oba of Benin) said it was $20,000, then, he said N10 million, when he saw that he wasn’t getting as much solidarity.\n\"I don't understand the case you are talking about, the case is in court, do you want Omo n'Oba (Oba of Benin) to react to that?\nOba of Benin in Modern Slavery Scandal, Uses Influence to Detain Palace Aide Who Served Him From Age 15 in... by Sahara Reporters on Scribd"
  },
  {
    "headline": "How Over 1,800 Nigerian Students, Teachers Were Victims Of Insurgent Attacks In Less Than 7 Years — Report",
    "summarized_story": "Students Writing WAECSo far, 1, 799 students were attacked while 24 teachers fell victim to the attacks.\n“There are incidents of attack involving students in four geopolitical zones of Northwest, Northeast, Northcentral and Southeast.\n“This is followed by the North East with 386 students, North Central (240) and Southeast.\nOn the other hand, attacks involving teachers were only in the North-west and the Northcentral.\nThe Northwest has the highest number of attacks involving teachers followed by the North Central,\" a part of the report reads."
  },
  {
    "headline": "How Over 1,800 Nigerian Students, Teachers Were Victims Of Insurgent Attacks In Less Than 7 Years — Report",
    "summarized_story": "Students Writing WAECSo far, 1, 799 students were attacked while 24 teachers fell victim to the attacks.\n“There are incidents of attack involving students in four geopolitical zones of Northwest, Northeast, Northcentral and Southeast.\n“This is followed by the North East with 386 students, North Central (240) and Southeast.\nOn the other hand, attacks involving teachers were only in the North-west and the Northcentral.\nThe Northwest has the highest number of attacks involving teachers followed by the North Central,\" a part of the report reads."
  },
  {
    "headline": "How Over 1,800 Nigerian Students, Teachers Were Victims Of Insurgent Attacks In Less Than 7 Years — Report",
    "summarized_story": "Students Writing WAECSo far, 1, 799 students were attacked while 24 teachers fell victim to the attacks.\n“There are incidents of attack involving students in four geopolitical zones of Northwest, Northeast, Northcentral and Southeast.\n“This is followed by the North East with 386 students, North Central (240) and Southeast.\nOn the other hand, attacks involving teachers were only in the North-west and the Northcentral.\nThe Northwest has the highest number of attacks involving teachers followed by the North Central,\" a part of the report reads."
  },
  {
    "headline": "JUST IN: Queen Elizabeth tests positive for COVID-19",
    "summarized_story": "Queen Elizabeth II of England has tested positive for COVID-19.\nBuckingham Palace confirmed in a statement on Sunday.\nAccording to the palace, the Queen is experiencing “mild cold-like symptoms” but will continue “light duties” at Windsor over the coming week.\n“She will continue to receive medical attention and will follow all the appropriate guidelines,” the palace said.\nAdvertisementThe Queen had been in contact with her eldest son and heir, the Prince of Wales, who tested positive last week."
  },
  {
    "headline": "JUST IN: Queen Elizabeth tests positive for COVID-19",
    "summarized_story": "Queen Elizabeth II of England has tested positive for COVID-19.\nBuckingham Palace confirmed in a statement on Sunday.\nAccording to the palace, the Queen is experiencing “mild cold-like symptoms” but will continue “light duties” at Windsor over the coming week.\n“She will continue to receive medical attention and will follow all the appropriate guidelines,” the palace said.\nAdvertisementThe Queen had been in contact with her eldest son and heir, the Prince of Wales, who tested positive last week."
  },
  {
    "headline": "Unlawful dismissal: Navy yet to 'fully reinstate' Labinjo, wife -- despite supreme court verdict",
    "summarized_story": "Years after getting court judgments ordering their reinstatement into the naval service, Dada Labinjo and his wife, Sherifat Ibe-Lamberts (also known as Bola Labinjo), say the Nigerian Navy is yet to comply.\nAdvertisementDissatisfied with the conditions for retirement, Ibe-Lamberts filed a suit against the navy and the case went up to the appeal court.\nIn December 2005, the appeal court ruled in her favour and set aside the ruling of the court martial.\nIn 2001, a court martial convicted Labinjo and sentenced him to six years imprisonment with a recommendation of dismissal.\n“However, in complying with this judgment, the Nigerian Navy may take steps to negotiate the amount to be paid to the claimant."
  },
  {
    "headline": "Unlawful dismissal: Navy yet to 'fully reinstate' Labinjo, wife -- despite supreme court verdict",
    "summarized_story": "Years after getting court judgments ordering their reinstatement into the naval service, Dada Labinjo and his wife, Sherifat Ibe-Lamberts (also known as Bola Labinjo), say the Nigerian Navy is yet to comply.\nAdvertisementDissatisfied with the conditions for retirement, Ibe-Lamberts filed a suit against the navy and the case went up to the appeal court.\nIn December 2005, the appeal court ruled in her favour and set aside the ruling of the court martial.\nIn 2001, a court martial convicted Labinjo and sentenced him to six years imprisonment with a recommendation of dismissal.\n“However, in complying with this judgment, the Nigerian Navy may take steps to negotiate the amount to be paid to the claimant."
  },
  {
    "headline": "As cases decline, Nigeria records 22 new COVID infections, zero fatality",
    "summarized_story": "Nigeria’s daily COVID-19 count maintained a relatively low figure on Saturday — with 22 new cases confirmed in five states and the federal capital territory (FCT).\nSaturday’s figure is a 43.5 percent decrease over the past 24 hours — 39 new cases reported on Friday.\nThe Nigeria Centre for Disease Control (NCDC) published the new cases in its update for February 19, 2021.\nAdvertisementOf the new recoveries, 25 were community discharged cases reported from FCT.\nA total of 254,243 coronavirus cases have now been recorded across the country, out of which 230,587 patients have recovered."
  },
  {
    "headline": "Flutterwave launches SME lending, fintech-as-a-service in vision 3.0",
    "summarized_story": "Led by founder and CEO Olugbenga Agboola, the company facilitates cross-border payments transactions of small-to-large businesses in Africa via one API.\nGet the best African tech newsletters in your inboxFlutterwave Capital, the new SME loans product, is offered in partnership with the company’s lending partners—CashConnect Microfinance Bank, MoneyWise Microfinance Bank, Wema Bank, Zenith Bank, Stanbic IBTC Bank, and Sterling Bank.\n“With Flutterwave Capital, we’re making it easier for business owners to access the funds they require to grow their businesses.\nFlutterwave also helps businesses outside Africa expand their operations on the continent with an international clientele that includes Booking.com, Flywire, and Uber.\nThe latest financing thus brings its total investments secured since launched in 2016 to $475 million (plus a $35 million Series B in 2020 and a $20 million Series A in 2018)."
  },
  {
    "headline": "Crypto crime grows to $14 billion as crypto popularity increases",
    "summarized_story": "In 2021, crypto criminals made a killing, as illicit crypto transactions hit $14 billion, a 79% jump from the $7.8 billion recorded in 2020, according to a report by US-based blockchain analytics company, Chainalysis.\nThe growth in illicit crypto transactions is attributed to a 567% jump in overall transaction volume in 2021.\nGiven that overall crypto transactions grew to $15.8 trillion in 2021, it is not surprising that cybercriminals are increasingly using crypto.\nDespite the increase in the total volume of illicit transactions, illicit transactions represented just 0.15% of the total cryptocurrency transaction volume in 2021—its lowest ever.\nWhat this means is that legitimate crypto transactions far outstrip illegal transactions."
  },
  {
    "headline": "Inside Ckrowd’s plan to help African creators monetise their content",
    "summarized_story": "This means African creators are still struggling to earn much from their craft, compared to their global counterparts.\nAt KAM Africa, Adebayo started an initiative that would help creative professionals like musicians and actors understand the business part of their craft.\nThink of a marriage between OnlyFans, Patreon, and YouTube—in fact, a combination of all the streaming platforms out there—but now for African content.\nOn Ckrowd, creators can livestream their content like uduX live and upload on-demand contents like on Netflix.\nThe platform pays 70% of total income on content to creators, which we believe is the highest pay-out on digital content to African creators,” said Adebayo."
  },
  {
    "headline": "From telecoms to tech: MTN changes logo to look the part",
    "summarized_story": "Africa’s biggest telecom company MTN is preparing for a brand refresh that’ll position it as a technology company, rather than a telecommunications company.\nThe brand refresh includes forgoing the white, yellow and red lettering in favour of a black lettered MTN logo surrounded by an oval, similar in shape to a rugby ball.\nThe new look is “aligned to our evolution from a telecommunications company to a technology company underpinned by one simple and consistent yet striking brand”, Morafo said.\nCurrent MTN logoNew MTN LogoMTN’s expansion drive to become a fully-fledged technology services company also means that it’s on a hiring drive to hire 150 digital experts in South Africa.\nThis rebrand will help shift public perception of the MTN brand and also influence its market valuation."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "It’s all about seed rounds ￼",
    "summarized_story": "For example, some freight companies in Africa still manage their shipments using outdated methods like spreadsheets, phone calls, and emails.\nAnd this company has announced $4 million in seed funding to expand across the country and into neighbouring regions.\nIt also saw participation from XYZ Ventures, Village Global, Musha Ventures, Ventures Platform, Voltron Capital, and Paystack CEO Shola Akinlade.\nNonso Onwuzulike officially launched the company in January 2022 to improve employees’ financial well-being.\nWhat’s more, the company will use the seed funding to speed up the development of its platform to serve large enterprise employers."
  },
  {
    "headline": "Learning the VC game, Flutterwave’s $3bn valuation and CrowdForce’s $3.6m raise",
    "summarized_story": "AdvertisementToday, we’re discussing:Why female founders should learn the venture capital gameFlutterwave’s $3bn valuationCrowdForce’s $3.6m pre-Series AWomen should play the VC gameIn 2021, women got less than 1% of startup funding.\nAccording to her, women need to learn the rules of the VC game and know what works and what doesn’t.\nIn her chat with Chimgozirim, she detailed the rules and tactics that could mean better odds for women in winning the venture capital game.\nRead all about it here: Female founders need to learn how to play the venture capital game– Sarah DusekFlutterwave’s $3bn valuationFlutterwave has come a long way since it was founded in 2016.\nAway from fintech: Flutterwave also displayed interest in the creator economy with the acquisition of Disha, a platform that allows creators to curate content and receive payment."
  },
  {
    "headline": "Female founders need to learn how to play the venture capital game — Sarah Dusek",
    "summarized_story": "Share this article:A cursory look at the venture capital landscape in Africa will reveal an impressive number of deals and the triumph of innovation over regulation.\nAccording to Sarah Dusek, Managing General Partner at Enygma Ventures, who spoke to Techpoint Africa on Zoom, a second reason is that most women don’t know how to play the venture capital game.\nWith venture capital a novel concept in Africa, not too many people, regardless of gender, understand how it works.\nThat decision birthed Enygma Ventures, a sector-agnostic firm providing women with the capital required to scale and grow their businesses.\nVenture capital is, in many ways, a numbers game, and the more women there are building companies that investors like, the higher the chances of women receiving investments."
  },
  {
    "headline": "SERMON: THIS DRUNKENNESS – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest1 “ Wine is a mocker strong drink is raging and whosoever is deceived thereby is not wise” Prov.\nNow therefore, beware, I pray thee and drink not wine or strong drink, and eat not any Maclean thing.” Judges 13:3-4 she obeyed God.\nMany have been deceived into alcohol because they see Priests and Pastors who drink alcohol.\nWhat you have to do now if you still drink alcohol, is to come truly to Christ and surrender your life to him and ask for a new life.\nRemember that all that God would use would be filled with the Holy Spiritand not with alcohol or strong drink."
  },
  {
    "headline": "Presidency faults reports by IMF, others on Nigeria debt profile – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Presidency on Tuesday faulted the recent reports by International monetary fund (IMF) and Agusto and CO. on the growth of Nigeria’s debt service and debt levels over the years.\nA press statement emanating from the office of the Debt management office, Abuja and made available to the Nigerian OBSERVER in Benin City yesterday Stated that the author of the alleged evil reports have failed to consider the challenges experienced by Nigeria in recent times as a result of two recessions, sharp drop in Revenues and security challenges.\nThe presidency further noted that the analysis as reported do not acknowledged the improvements in infrastructure which have been achieved through borrowing as well as the strong measures by the Government to grow revenues.\nAccording to the Presidency, “The DMO reiterated the fact that the Government is already implementing policies towards increasing revenues and developing infrastructure through Public Private Partnership arrangements both of which improve debt sustainability”.\nContinuing, the DMO also noted that the Government has active and regular engagements with the IMF on borrowing and debt management, adding that with this case the reports have fail to consider the challenges experienced by Nigeria in recent times."
  },
  {
    "headline": "Industrialisation: 2,500bpd modular refinery, 5MW power plant, others set to go live in Edo next month – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Barring any last-minute changes, a 2,500 barrel per day (bpd) modular refinery, five megawatts power plant, 40-million-scf gas processing facility, and a data centre, among others, will come on stream in Edo State in March, 2022, after necessary regulatory certifications from the Nigerian Midstream and Downstream Regulatory Authority (NMDRA).\nThe company plans to develop the park in phases, with the first phase comprising a 10,000 barrel per day refinery, 60-million-scf gas processing facility, 10-million-scf compressed natural gas (CNG) facility, 50 megawatts power plant and a data centre.\nThe project is financed by the First City Monument Bank (FCMB), Nigerian Content Development & Monitoring Board (NCDMB), among others.\nChief Executive Officer of the DMCL, Dr. Akintoye Akindele, during an inspection of the facility, said the plant will be ready by the end of March.\nIn that way, we will be able to utilize assets optimally, avoid wastage, look after the environment and create jobs,” he said."
  },
  {
    "headline": "Revamped Edo College of Education kicks off academic activities Q3 2022 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said the newly revamped multi-campus Edo College of Education with sites in Igueben, Abudu and Afuze, will begin academic activities before the end of 2022.\nThe government, however, said the academic calendar of the defunct College of Education in Igueben will not be truncated, promising that students of the defunct college will graduate as and when due.\n“Edo College of Education is yet to take off but the College of Education, Igueben no longer exists.\nIgueben is the main campus and it will focus on training secondary school as well as technical and vocational education teachers.\nAbudu is one of the campuses focusing on training early childhood and basic education teachers."
  },
  {
    "headline": "Osun APC Primary: Aregbesola’s camp kicks as Gov. Oyetola, Alabi, Oyebamiji express satisfaction",
    "summarized_story": "By Sunday Oguntuyi, OsogboGovernor of Osun State, Mr. Adegboyega Oyetola, has expressed satisfaction with the conduct of the state All Progressive Congress (APC) governorship primary election in the state, just as the camp of a former governor of the state, Rauf Aregbesola has alleged that there is widespread irregularities in the exercise.\nThe fact is that there is only one candidate that is contesting the primary in Osun and that’s the incumbent governor.\nBola Oyebamiji expressed happiness at how people of his Community showed appreciation to good governance delivered by Governor Oyetola.\nOyebamiji appreciated the security architecture and the comportment of the people, noting that the exercise was being held under peaceful and conducive environment.\nMeanwhile, the chairman of Aregbesola’s splinter group in the party, The Osun Progressives , Mr. Rasaq Salinsile has faulted the primary election , saying it’s effort in futility."
  },
  {
    "headline": "Tension in Osun as APC holds governorship primary today",
    "summarized_story": "By Olusesan LaoyeThe political atmosphere in Osun State, is intense Saturday morning, as the ruling party in the state, the All Progressive Congress (APC), holds its governorship primary election amid escalating rift between the incumbent governor of the state, Gboyega Oyetola and his predecessor, Rauf Aregbesola.\nAcross Osogbo, the state capital, there is presence of the security personnel at every corner, signaling that they are ready to deal with any one who forments trouble, but their mere presence has made residents apprehensive.\nSecurity men, including the Police, the Army, Civil Defence, DSS, among others, are seen patrolling the streets Osogbo and other major cities in the state.\nAregbesola is supporting the former Secretary to the government during his tenure, Moshood Adeoti against Oyetola who wants the ticket of the party for a second term.\nThe feud between the duo also heightened the frosty relationship which has been existing between Tinubu and Aregbesola."
  },
  {
    "headline": "Osun PDP faction rejects appointment of Sunday Bisi as acting chairman",
    "summarized_story": "By Sunday Oguntuyi, OsogboA faction of the Osun State Chapter of the Peoples Democratic Party, has frowned at a letter “purportedly communicating” a decision of the National Working Committee of the party to appoint Mr Sunday Bisi as the acting chairman of the party.\nThe members, including the acting chairman of the faction, Wale Ojo, maintained that they were the authentic Exco of the PDP in the state.\n“Let me say to you in clear terms, this is about constitionality and in the face of the law I remain the valid and legally recognized State Acting Chairman of Osun PDP.\nHe should desist from walking on the same path as the erstwhile occupant of that office, Prince Uche Secondus did.”A former Chairman of the Party in Osun, Barr.\nOjo Williams, said “the Peoples’ Democratic Party which you all know is a democratic and law abiding party."
  },
  {
    "headline": "9PSB CEO Seeks Targeted Content to Accelerate Nigeria’s Financial Inclusion",
    "summarized_story": "Mracajac made this assertion, while presenting a keynote address, themed “Content Creation and Financial Inclusion; The Future of Digital Banking” at the Tech Summit Ogun 2022, which held at the Olusegun Obasanjo Presidential Library Abeokuta, Ogun State on Thursday February 17, 2022.\nAccording to her, while there are ongoing efforts to support the country’s financial inclusion drive, a lot more rest on formulating tailored strategies that address specific needs.\nShe added that, developing content that speaks only to the already banked and mirroring the digital financial habits of those who are fully included and heavily banked, will not help to keep the newly on-boarded in the system long-term.\nThe second one, she stated, is needed for sustainable Financial inclusion: delivery of digital banking services that are a reflection of the lifestyle of the currently unbanked and underserved population.\nShe called on all stakeholders within the financial ecosystem, including content creators to work collectively to develop and implement a digital content strategy for the unbanked to move the financial inclusion needle and ultimately advance the economy, society and improve life of every Nigerian."
  },
  {
    "headline": "Oyo Monarch, Alaafin, May Broker Peace Between Tinubu, Aregbesola",
    "summarized_story": "A source told journalists in Ibadan, the Oyo State capital, that the rift between the duo had created a political tension in the South-West, hence the planned intervention of the foremost Oyo monarch.\nLEADERSHIP, however, gathered that Tinubu’s planned visit to the Alaafin is not connected to the feud between him and Aregbesola even though the traditional ruler will be willing to broker peace between the duo at the appropriate time.\nADVERTISEMENTIn an exclusive chat with LEADERSHIP, a member of the House of Representatives and a son of Alaafin, Prince Akeem Adeyemi, said Tinubu’s visit to the Oyo Palace has nothing to do with any peace meeting.\n“Asiwaju is coming today to visit Alaafin as part of his consultations with monarchs, it has nothing to do with any rift settlement and the Alaafin did not summon anybody to the palace for any peace meeting.\n“However, if the need be, the Alaafin will wade into the rift in the interest of peace and development of Yoruba land."
  },
  {
    "headline": "Niger Delta: Stakeholders Task State Govts, Others On Capacity-building",
    "summarized_story": "The position was canvassed by stakeholders, who gathered at the 2nd Niger Delta MSME Summit held on Saturday, February 19, in Asaba, Delta State, with the theme: ‘Stimulating MSMEs Growth Towards Post Covid-19 Recovery’.\nSimbi Wabote, represented by the Board’s General Manager, Capacity Development, Dr. Ama Ikuru, acknowledged that Nigeria ranks poorly in terms of human capacity development index.\nHigh point of the event was the sharing of heart-touching testimonies by some successful business owners in the Niger Delta.\nIt is noteworthy that the 2022 Niger Delta MSME Summit is the 48th event to be organised by the NYPF.\nThe third edition of the Niger Delta MSME summit will be held at Akwa Ibom in 2023."
  },
  {
    "headline": "2023: I Have Capacity To Turn Nigeria Around, Says Ado-Ibrahim",
    "summarized_story": "The founder of Reset Nigeria Initiative, Prince Malik Ado-Ibrahim, has said he can turn around the country if elected president in 2023.\nHe said, “I just feel that at this point we have the ability to do something completely different.\nAnd I am convinced that if it is not me, it needs to be somebody like me that feels Nigeria is worth sacrificing.\nI’m just offering myself, certainly we all need to present ourselves, we all need to be scrutinised.\nADVERTISEMENT“I don’t think anybody that is coming in 2023 should believe that their past shouldn’t be questioned, their thinking shouldn’t be questioned, their fitness for office shouldn’t be questioned."
  },
  {
    "headline": "2023: I Have Capacity To Turn Nigeria Around, Says Ado-Ibrahim",
    "summarized_story": "The founder of Reset Nigeria Initiative, Prince Malik Ado-Ibrahim, has said he can turn around the country if elected president in 2023.\nHe said, “I just feel that at this point we have the ability to do something completely different.\nAnd I am convinced that if it is not me, it needs to be somebody like me that feels Nigeria is worth sacrificing.\nI’m just offering myself, certainly we all need to present ourselves, we all need to be scrutinised.\nADVERTISEMENT“I don’t think anybody that is coming in 2023 should believe that their past shouldn’t be questioned, their thinking shouldn’t be questioned, their fitness for office shouldn’t be questioned."
  },
  {
    "headline": "Minister Tasks INEC On Improving Malfunctioned BVAS Machines",
    "summarized_story": "The minister of state in the Federal Capital Territory (FCT) Dr. Ramatu Aliyu, has called on INEC to urgently improve the functionality of the Bimodal Voters Accreditation System.\nAliyu stressed that in the course of monitoring the voting process it was observed that it was slow at several polling units owing to malfunctioning or faulty BVAS machines.\nShe, therefore, tasked INEC to urgently look into the machines or allow the electorate accredited to vote manually as the nation approaches the general elections.\n“INEC should as a matter of urgency look into BVAS machine malfunctioning or in the alternative allow electorate accredited to vote manually.\nI did not say cancel the BVAS, because I am not a contestant in any way here,” she said."
  },
  {
    "headline": "FBI Vs Hushpuppi: FG Told To Extradite Abba Kyari To US After NDLEA Arrest",
    "summarized_story": "FBI Vs Hushpuppi: FG Told To Extradite Abba Kyari To US After NDLEA ArrestOhanaeze Ndigbo has requested the Federal Government of Nigeria to enable DCP Abba Kyari, the suspended head of the IRT, to be extradited to the United States to face the Federal Bureau of Investigation’s (FBI) claims in the hushpuppi affair.\nThe National Drug Law Enforcement Agency (NDLEA) arrested Kyari and others on Monday for alleged ties to an international narcotics syndicate.\n“DCP Abba Kyari, who was under suspension previous to this allegation, shall stay on suspension,” the PSC wrote.\n“DCP Abba Kyari should be allowed to face his crimes in the United States.\nNigerians want a thorough investigation of the alleged criminal indictment of Abba Kyari and subsequent extradition to the United States.”"
  },
  {
    "headline": "Pastor Enenche, Wife Visit Ibiyeomie’s World’s Largest Cathedral",
    "summarized_story": "Pastor Enenche of Dunamis International Gospel Centre and his wife Becky Inyangbe Ibu have joined the throng of visitors at the David Ibiyeomie’s multi million Hand of God Cathedral.\nThe Salvation Ministries Cathedral in Port Harcourt, Rivers state will accommodate 120,000 worshippers at a go, making it the world’s largest.\nThe Enenches also boasts of having the biggest church in Abuja, with 85,000 capacity.\nOther recent visitors to the Cathedral were Pastors Matthew Ashimolowo and Biodun Fatoyinbo.\nDuring his visit, Enenche offered prayer at the site, in a video shared by Church Gist."
  },
  {
    "headline": "JUST IN: Aregbesola Laments As Oyetola Wins Osun APC Guber Ticket",
    "summarized_story": "JUST IN: Aregbesola Laments As Oyetola Wins Osun APC Guber TicketOsun State Governor Gboyega Oyetola has been proclaimed the winner of the All Progressives Congress (APC) governorship primary poll.\nThe results were announced around 3am on Sunday by AbdulRahman AbdulRazaq, Kwara state governor and chairman of the Osun APC primary election committee.\nAccording to the primary election committee, the total number of accredited voters stood at 247,207 while 235,550 votes were cast.\nThe primary election was marred by allegations of widespread irregularities while several party members also claimed that their names were expunged from the voters’ register.\nThe APC in Osun has two factions: one is loyal to Aregbesola while the other pledges allegiance to Oyetola, the incumbent governor of the state."
  },
  {
    "headline": "Expose Tinubu Secrets Now, Before He Destroy You – Reno Tells Aregbesola",
    "summarized_story": "Reno Omokri, a former Presidential adviser, has urged Minister of Interior Rauf Aregbesola to reveal the mystery behind the All Progressives Congress’s (APC) National Leader Bola Tinubu’s wealth.\nIn a post on his official Facebook page, Omokri urged Buhari’s Minister to expose the real age and other secrets Tinubu, a 2023 presidential candidate, may have been keeping from Nigerians.\nHe said, “See how you have been disgraced by Tinubu and Oyetola in Osun.\nBecause if you remain silent now, Oyetola and Tinubu will only grow politically stronger.\nImagine how miserable your life will be with Tinubu in Aso Rock and Oyetola in Osogbo."
  },
  {
    "headline": "Amended Electoral bill hangs as Buhari returns from EU-AU summit",
    "summarized_story": "President Muhammadu Buhari on Saturday returned to Abuja after attending the sixth Europe-Africa Summit in Brussels, Belgium.\nBefore his departure, the President did not sign the much-debated Electoral bill amended by the National Assembly.\nNAN reports that Buhari departed the country on February 16, to join other African and European leaders to discuss issues of mutual concerns to both continents.\nDuring the G4 meeting, the leaders resolved to strengthen the platform for the resolution of the various issues confronting the African continent.\nHe equally stressed the need to nip the root causes of extremism, conflicts and tensions in Africa."
  },
  {
    "headline": "Police to the rescue as man nails teenager on tree",
    "summarized_story": "In Kenya, Police are investigating a matter where a teenager was nailed on a tree for suspected theft.\nThe 19-year-old identified as Collins Sambaya is said to have been assaulted by one Elvis Irime by nailing him on a tree on the allegation that he had stolen his radio.\nThe matter was reported by the area chief Evans Endesha by phone.\n“It was reported by North Izava location chief namely Evans Endesha by phone that he received a report that a person had been nailed on a tree by some people,” part of the police report read.\nAfter the reports, the police immediately swung into action and visited the scene where they confirmed that the teenager had been nailed on a tree."
  },
  {
    "headline": "Osun APC governorship primary: Again, Aregbesola cries foul as Oyetola leads",
    "summarized_story": "The result of Saturday’s governorship primary of the All Progressives Congress (APC) in Osun state is about now being collated with incumbent governor Gboyega Oyetola reportedly leading.\nThough, official results from wards are yet to be announced, immediate past governor Rauf Aregbesola is already crying foul.\nIn a statement by his media adviser Sola Fasure, Aregbesola alleged that careful study of various reports he has received so far, the primary was characterised by vote-buying, absence of result sheets, absence of INEC officials, and disenfranchisement.\nBoth Aregbesola and Oyetola who was his Chief of Staff when he was governor have been at political loggerhead, a situation that has led to palpable tension within the state.\nAregbesola, though not contesting, has his anointed candidate, Moshood Adeoti, in the primary."
  },
  {
    "headline": "Oyetola Declared Winner Of Osun APC Governorship Primary",
    "summarized_story": "﻿Osun State Governor, Adegboyega Oyetola, has won the governorship primary of the All Progressive Congress (APC) in the state.\nIn a statement by its spokesman, Abiodun Agboola, the faction alleged widespread irregularities in the exercise conducted by the Osun APC Primary Election Committee led by Governor Abdulrasaq of Kwara State.\n“The Governor Abdulrahman Abdulrasaq led Osun APC Primary Election Committee should know that the primary lacks credibility and fairness,” it said.\n“It is necessary and important to inform the general public and Governor Abdulrahman Abdulrasaq led Osun APC Primary Election Committee of the ongoing irregularities in the conduct of the primary election of the All Progressives Congress (APC) in the State of Osun.\n“We strongly condemn the conduct of the primary election because it is nothing but a sham with a fraudulent process to favour Governor Adegboyega Oyetola."
  },
  {
    "headline": "Nigeria Needs More Rebels To Speak Truth To Power, Says Obasanjo",
    "summarized_story": "Former President Olusegun Obasanjo says Nigeria needs more rebels who will speak truth to power not minding whose ox is gored.\n“Our country, Nigeria, needs more rebels,” he said in his brief remarks while addressing an audience at the event.\n“Those who would look at things straight in the face and say, ‘This is not right!\n“Looking at the title of the book, I ask myself, why would someone call himself a rebel?” Obasanjo queried.\nThe truth is that if you have to live a life of honesty and integrity, you have to become a rebel."
  },
  {
    "headline": "Oba Of Benin Takes Delivery Of Looted ‘Okpa,’ ‘Ilahor’ Returned From UK",
    "summarized_story": "﻿The Bronze cockerel known as ‘Okpa’ and the Oba head bronze known as ‘Ilahor’ have been returned to the palace of the Oba in Benin City, Edo State capital.\nThe artefacts were returned in a ceremony held on Saturday at the Oba Palace.\nThe bronzes were accompanied by the Nigerian High Commissioner to the United Kingdom Sarafa Tunji Ishola and other officials from the UK.\nAlso in October 2021, the University of Aberdeen handed over a Benin Bronze to Nigeria after over 100 years since it was looted by British forces.\nThe sculpture, which depicts the head of an Oba (king), is one of the thousands of religious and cultural artefacts looted by British forces in 1897 during the destruction of Benin City in present-day Nigeria by a British military expedition."
  },
  {
    "headline": "Osun APC Governorship Primary Lacks Credibility, Fairness – Aregbesola Faction",
    "summarized_story": "﻿A faction of the All Progressives Congress (APC) loyal to former Governor Rauf Aregbesola has condemned the party’s governorship primary election in Osun State.\nIn a statement by its spokesman, Abiodun Agboola, the faction alleged widespread irregularities in the exercise conducted by the Osun APC Primary Election Committee led by Governor Abdulrahman Abdulrasaq of Kwara State.\n“The Governor Abdulrahman Abdulrasaq led Osun APC Primary Election Committee should know that the primary lacks credibility and fairness,” it said.\n“It is necessary and important to inform the general public and Governor Abdulrahman Abdulrasaq led Osun APC Primary Election Committee of the ongoing irregularities in the conduct of the primary election of the All Progressives Congress (APC) in the State of Osun.\n“We strongly condemned the conduct of the primary election because it is nothing but a sham with a fraudulent process to favour Governor Adegboyega Oyetola."
  },
  {
    "headline": "Judiciary Open To Initiatives For Capacity Building For Judicial Officers – CJN",
    "summarized_story": "Justice Ibrahim Tanko Muhammad, has said the Judiciary is open to initiatives aimed at improving and strengthening the capacity of judicial officers in the handling of cases on emerging crime trends in the country.\nSome of those emerging crimes, the CJN said include cybercrime, cross-jurisdictional infringement of Intellectual property rights, and cases related to cybersecurity and espionage.\nHe requested for workshops that would border on Copyright Law in the new digital environment for judicial officers and Enforcement of Foreign Arbitral Awards relating to intellectual property disputes.\n‘’Capacity building for our judicial officers is our priority, while the development of the capacity of our Research Assistants and other staff of the National Judicial Institute, who are fully involved in these training programmes, is also very important.\n“The National Judicial Institute will never relent in its efforts to serve as the principal focal point of judicial activities on issues relating to the promotion of efficiency, uniformity and improvement in the quality of judicial services in our courts’’, the CJN stated."
  },
  {
    "headline": "Nigeria needs more rebels to speak truth to power- Obasanjo",
    "summarized_story": "A former President, Olusegun Obasanjo said Nigeria “needs more rebels” who would speak the truth to power not minding whose ox is gored.\nThis, he said, remains one of the greatest steps towards rebuilding Nigeria.\nAdvertisementHe made this known in Abeokuta, while unveiling the autobiography of the Babanla Adinni of Egbaland, Tayo Sowunmi, titled “Footprints Of A Rebel.”He noted that for Nigeria to move forward, it requires “more rebels” who stand and speak for the truth.\nAdvertisementHe added that whoever must leave a life of honesty and integrity has to be a rebel."
  },
  {
    "headline": "Osun APC members vote to elect party's governorship candidate -",
    "summarized_story": "Members of the ruling All Progressives Congress in Osun State are filling out at their various wards to vote to candidate of their choice.\nAt ward one in Osogbo local Government the party faithful had started arriving by 8 in the morning and are being accredited.\nAt Ward three also in Osogbo local Government, the exercise is going on smoothly as accreditation is underway.\nThe accreditation exercise is to be rounded off at noon after which voting will commence immediately and end at 2pm through option A4.\nAdvertisementThe state Commissioner for Special Duties and regional integration commended the peaceful conduct of members."
  },
  {
    "headline": "Zamfara APC Factions in War of Words over invasion of Court by Thugs -",
    "summarized_story": "The All Progressives Congress loyal to Senator Kabiru Marafa in Zamfara State is accusing the Matawalle Faction of sponsoring hoodlums to attack its Members and lawyers at the state high court in GusauThe Marafa faction says they were attacked shortly after a court sitting on the Ward, Local Government and State Congresses which held in the state in November 2021AdvertisementThey want security agencies to Investigate the incident and arrest perpetratorsAdvertisementAdvertisementThe Crisis between the Senator Kabiru Marafa faction of the APC and that of Governor Bello Matawalle started a few days after the formal Defection of Governor Bello Matawalle from the PDP to the Ruling APCThis time around, the Marafa faction is accusing the Zamfara state APC of Sponsoring thugs to attack its Lawyers and party members at the state high courtAdvertisementSpokesperson for the Marafa faction, Bello Bakyaswa says the attack was targeted at eliminating himHe calls on the security agencies to Investigate the incident and arrest perpetrators of the attackAdvertisementResponding to the allegations, Spokesperson of the Matawalle faction Yusuf Idris Gusau denies sponsoring thugs to attack the court, describing the allegations as false, baseless and is a sign of failure on the side of the accusersYusuf Idris insists that the party under Governor Bello Matawalle will not fold it’s hands and watch hoodlums disrupt the peace in the stateAdvertisementHe warns Politicians against using Politics to set the state on fire."
  },
  {
    "headline": "Alao-Akala will be missed for his magnanimity and compassion- Osinbajo -",
    "summarized_story": "Vice President Yemi Osinbajo has described the former governor of Oyo state Adebayo Alao-Akala as an open minded politician who would be missed for his magnanimity and compassion.\nHe said the late governor served the interest of his people when he was in power and gave quality counsel to those who were around him.\nAdvertisementThe Vice President said this while speaking at the final burial ceremony of the former Governor of Oyo state in his Ogbomoso home.\nAccording to him, he was responsible and respectful to the views of individuals and will be missed for his counsel and compassion.\nAdvertisementIn his remarks, Governor of Oyo state, Seyi Makinde Eulogised the former governor, describing him as one who loved everyone regardless of their political differences."
  },
  {
    "headline": "Queen Elizabeth, 95, Tests Positive for Covid",
    "summarized_story": "The Queen has tested positive for Covid, Buckingham Palace has said.\nThe palace said the monarch is experiencing “mild cold-like symptoms” but expects to continue “light duties” at Windsor over the coming week.\n“She will continue to receive medical attention and will follow all the appropriate guidelines,” the palace said in a statement.\nThe Queen had been in contact with her eldest son and heir, the Prince of Wales, who tested positive last week.\nDetails later…"
  },
  {
    "headline": "Putin Oversees Nuclear Drills as US Insists Russia Plans to Invade Ukraine",
    "summarized_story": "U.S. Defense Secretary Lloyd Austin said Russian forces were beginning to “uncoil and move closer” to the border.\nRussia ordered the military build-up while demanding NATO prevent Ukraine from ever joining the alliance but says Western warnings that it is planning to invade Ukraine are hysterical and dangerous.\nThe Kremlin said Russia successfully test-launched hypersonic and cruise missiles at sea during the nuclear forces drills.\n“They reaffirmed that Russia could launch an attack against Ukraine at any time.”G7 foreign ministers called on Russia to choose the path of diplomacy.\nSHELLING ALLEGATIONSRussian-backed rebels seized a swathe of eastern Ukraine and Russia annexed Crimea from Ukraine in 2014."
  },
  {
    "headline": "Russia Planning Biggest War in Europe Since 1945, UK PM Johnson Says",
    "summarized_story": "Evidence suggests Russia is planning “the biggest war in Europe since 1945”, Prime Minister Boris Johnson has said.\nHe told the BBC’s Sophie Raworth in an interview: “All the signs are that the plan has already in some senses begun.”Intelligence suggests Russia intends to launch an invasion that will encircle Ukrainian capital Kyiv, Mr Johnson said.\n“People need to understand the sheer cost in human life that could entail,” he saidThe prime minister was speaking from Munich, where world leaders are meeting for an annual security conference.\nMr Johnson also indicated that the UK would bring in even more far-reaching sanctions against Russia than have been suggested before.\nPrevious sanctions suggested by ministers include broadening the range of Russian people and businesses the UK could target."
  },
  {
    "headline": "Ukraine’s Zelenskyy Calls on Putin to Meet as Tensions Soar",
    "summarized_story": "Zelenskyy said Russia could pick the location for the talks.\nZelenskyy spoke hours after separatist leaders in eastern Ukraine ordered a full military mobilization on Saturday while Western leaders made increasingly dire warnings that a Russian invasion of its neighbor appeared imminent.\nIn new signs of fears that a war could start within days, Germany and Austria told their citizens to leave Ukraine.\nMeanwhile, top Ukrainian military officials came under a shelling attack during a tour of the front of the nearly eight-year separatist conflict in eastern Ukraine.\nMedia reports on Saturday described chaos at some of the camps assigned to accommodate the people from eastern Ukraine."
  },
  {
    "headline": "FG Willing to Partner Investors on Power Supply, Says Minister",
    "summarized_story": "He said President Muhammadu Buhari’s desire towards the power sector was to ensure that the electricity supply industry is owned by both government and the private sectors.\nAliyu told the ambassador that various interventions were being put into the power sector of the country.\nThe workshop, with the theme: ‘Building knowledge and Plugging Skills Gap in Power Sector Reporting’, indicates a worrisome mismatch that government wants to plug.\nAccording to him, the distribution companies are also improving their performances and facilities to ensure improved power supply.\nExplaining NBET’s function in the Transition Electricity Based Market, he said the design is to temporary bridge in the electricity market."
  }
]