[
  {
    "headline": "Loss of peripheral vision could be signs of glaucoma, optometrist warns",
    "summarized_story": "Amarachi OkehAn optometrist, Dr. Oluchi Ubani has warned that the loss of peripheral vision could be a sign of the onset of glaucoma, noting that such a development should be promptly checked.\nPeripheral vision loss occurs when people can’t see objects unless they’re right in front of them.\nAccording to the optometrist, the state of peripheral vision can gives hints on the general condition of the sight.\nThat is our peripheral vision.\n“However, when glaucoma starts taking away your peripheral vision, you will discover that you may not be able to see what is happening by the side except you fully turn your head."
  },
  {
    "headline": "Loss of peripheral vision could be signs of glaucoma, optometrist warns",
    "summarized_story": "Amarachi OkehAn optometrist, Dr. Oluchi Ubani has warned that the loss of peripheral vision could be a sign of the onset of glaucoma, noting that such a development should be promptly checked.\nPeripheral vision loss occurs when people can’t see objects unless they’re right in front of them.\nAccording to the optometrist, the state of peripheral vision can gives hints on the general condition of the sight.\nThat is our peripheral vision.\n“However, when glaucoma starts taking away your peripheral vision, you will discover that you may not be able to see what is happening by the side except you fully turn your head."
  },
  {
    "headline": "17-year-old girl diagnosed with premature menopause shares experience",
    "summarized_story": "Lara AdejoroAnna Timson was just 17-years-old when she was diagnosed with early menopause.\nBut Anna was initially diagnosed with a high level of FSH (follicle-stimulating hormone) and immediately put on the pill.\nShe regularly uses The Daisy Network, which is a UK charity offering information, advice, and support for women diagnosed with premature menopause.\nAnna recalls how her sister’s pregnancy in 2018 ‘opened up a lot of the trauma’ that she’s been through.\n“I told him straight away that I couldn’t have children; I wanted to be honest with him,” she said."
  },
  {
    "headline": "17-year-old girl diagnosed with premature menopause shares experience",
    "summarized_story": "Lara AdejoroAnna Timson was just 17-years-old when she was diagnosed with early menopause.\nBut Anna was initially diagnosed with a high level of FSH (follicle-stimulating hormone) and immediately put on the pill.\nShe regularly uses The Daisy Network, which is a UK charity offering information, advice, and support for women diagnosed with premature menopause.\nAnna recalls how her sister’s pregnancy in 2018 ‘opened up a lot of the trauma’ that she’s been through.\n“I told him straight away that I couldn’t have children; I wanted to be honest with him,” she said."
  },
  {
    "headline": "Police station bomb attack: 3 bandits killed, 1 officer dead in Imo",
    "summarized_story": "By Chinonso AlozieThe Imo State Police Command on Friday said it has killed three bandits that attacked police station in Orsu Local Government Area of Imo State, with explosives.\nThe State Commissioner of Police, Abutu Yaro, who confirmed this to newsmen in Owerri, said a Police Inspector died during the gun battle with the bandits.\nAbutu, who said the attack happened on Thursday night, said the bandits were subdued by the Police and other gang members fled into bush with gunshot injuries.\nThis was after the bandits had threw their explosives on the roof top of the Orsu Police station.\nAlso hospitals are advised to ensure that they report any person who come to them for treatment of bullet wounds,” Police said."
  },
  {
    "headline": "PIB: FG to hold town hall meetings after presidential assent",
    "summarized_story": "Tasks host communities on effective mgt of 3% equityBy Omeiza Ajayi – AbujaChief Sylva with the Ijaw elders after decorating him with a royal attire.\nSylva who tasked host communities on effective management of the funds lamented the situation where communities in the Bonny Island cannot access funds paid to them by the Nigeria Liquefied Natural Gas Company NLNG following court cases instituted by some individuals.\nThe minister said; “We are planning, alongside the Minister of Information to hold town hall meetings in the host communities after the presidential assent to the PIB.\nWe need to have more stakeholders engagement on the three per cent allocated to the communities.\nIf we manage all the money coming to the Niger Delta, NDDC, 13 per cent derivation, three per cent host communities funds and even the one from the amnesty programme, we won’t have some of the issues currently confronting us,” he added."
  },
  {
    "headline": "FG insists on Water Resources Bill",
    "summarized_story": "Says misinformation on bill politicalBy Johnbosco AgbakwuruThe Federal Government said, Thursday, that the misinformation on the controversial Water Resources Bill was deliberate and political.\nIt would be recalled that opposition had trailed the Water Resources Bill, which many stakeholders described as a ploy by the Federal Government to take over control of waterways from state governments to provide water for grazing purposes.\nWater Resources Act 2004; Nigeria Hydrological Services Act; River Basin Development Authorities Act; and the National Water Resources Institute Act.\n“Number two is that Nigeria, like all other countries in the world, has adopted the concept of Integrated Water Resources Management.\n“So, we are democratising the process of Water Resources development in this country."
  },
  {
    "headline": "Twitter’s suspension in Nigeria worrisome, media must remain vigilant — US",
    "summarized_story": "The United States, US, Consulate in Lagos has described as deeply worrisome, the suspension of Twitter by the Federal Government.\nClaire Pierangelo, US Consul-General, made the remarks, Wednesday, at a programme, entitled “Conversation on Press Freedom, Freedom of Expression and Civic Space in Nigeria,” in Lagos.\nShe said the government’s intention to introduce registration requirements for social media platforms, banning or restricting social media with threats of prosecution, undermined the human rights and fundamental freedom of Nigerians.\nShe said: “Nigerian government’s ongoing suspension of Twitter and stated intent to introduce registration requirements for other social media platforms is deeply worrisome.\n“Banning or significantly restricting social media, including under threat of prosecution, undermines Nigerians’ human rights and fundamental freedoms."
  },
  {
    "headline": "Edo PDP state exco apologizes to Obaseki, pledges loyalty",
    "summarized_story": "SincerelyDr. Tony Aziegbemi (State Chairman), Hilary Otsu (State Secretary)The letter was also endorsed by Harrison Omagbon (Deputy Chairman), Chief Caesar Ehilenbodaiye (State Treasurer), Barr.\nArther Esene (State Legal Adviser), ESV Fidel Igenebale (Financial Secretary), Chris Nehikhare (Publicity Secretary), Dr. Wilson Imongan (Auditor), Tony Anenih jnr.\n(State Organising Sec.)\nMrs. Tes Sorae (State Women Leader) Oreye Destiny Ehigiator (State Youth Leader), Barr.\nNosa Ogieva-Okunbor (Vice-Chairman South), Arch."
  },
  {
    "headline": "Allow husbands to suck your breasts – Chief Nurse to pregnant women",
    "summarized_story": "Roseline Oladimeji, a Chief Nursing Sister, has advised pregnant women to allow their husbands to suck their breasts.\n“Allow your husband to suck your breasts during pregnancy.\nApart from bonding, it will help the nipples to be out and make it easier for your baby to latch on,” she said.\nNAN quoted her as advising women to also rub vaseline on nipples at night before going to bed.\nThe Chief Nurse said proper preparation of the breasts during pregnancy forestalls lactation problems after delivery."
  },
  {
    "headline": "Sunday Igboho’s aides still battle stringent bail conditions after 48 hours",
    "summarized_story": "Justice Egwuatu had on Wednesday admitted the 12 applicants to various bail conditions while ruling in their applications filed to that effect.\nThe others admitted to N5 million bail are; Abdulateef Onaolapo, Tajudeen Erinoye, Diekola Jubril, Ayobami Donald, Uthman Adelabu, Oluwafemi Kunle, Raji Kazeem and Bamidele Sunday.\nHowever, since the grant of the bail, the detainees have not been able to meet some of the stringent aspects of the conditions.\nAt the time of this report, DAILY POST was informed that all the 12 detainees are still in the custody of the DSS.\nCounsel to the detainees, Mr Pelumi Olajengbesi confirmed that the detainees have not completely perfected their bail conditions."
  },
  {
    "headline": "Taraba: Ishaku, Manu pay condolence visit to family of drowned victim",
    "summarized_story": "Governor Darius Dickson Ishaku of Taraba State and his deputy , Engineer Haruna Manu, on Friday paid a condolence visit to the family of the 30-year-old man that was on Thursday swept away by flood in Jalingo, the state capital.\nPiqued by the development, the governor, alongside his deputy, and some top government functionaries, were observed to have appeared at the family compound of the deceased to sympathized with them.\nDiversitated by the havoc caused by the disaster, he again vowed to immediately embark on the process of expanding the water ways leading in and outside the community.\nThis, according to the governor , would go a long way in preventing further outbreak of water disaster.\nA member of the family who spoke with this medium, applauded the governor for taking the bull by the horns by appearing in person at the family compound of the victim."
  },
  {
    "headline": "Why I annulled June 12 election involving MKO Abiola – Babangida",
    "summarized_story": "Former Nigerian head of state, Ibrahim Babangida, has given reasons why he annulled the June 12, 1993 election, widely believed to have been won by Moshood Kashimawo Olawale, M.K.A, Abiola of the Social Democratic Party (SDP).\nBabaginda, who was the military ruler then, cited the possibility of a deadly coup and pressure from both the military and civilians.\nHowever, the annulment led to protests and political unrest across Nigeria, including the resignation of Babangida, giving way for an interim civilian government.\nIt later culminated in the continuation of military rule in the country, with General Sani Abacha ascending power through a bloodless coup later in the year.\nThe other is the social agitation.”"
  },
  {
    "headline": "BBNaija promotes immorality, Buhari govt should ban it – Arewa youths",
    "summarized_story": "The Arewa Youth Consultative Forum, AYCF, on Friday called on the Federal Government to ban the airing of Big Brother Naija, BBNaija, reality television show.\nAYCF National President, Yerima Shettima, said BBNaija promotes immorality and sexual content; hence should be banned in Nigeria.\nSpeaking with DAILY POST, Shettima described the reality television show as a calamity that Nigeria should not encourage.\n“I have often said this show promotes immorality and the Nigerian government should please ban it, it should not be allowed to be aired in our country.\nIn the current season, Angel was caught on camera fingering herself."
  },
  {
    "headline": "How I was nicknamed ‘evil genius’, ‘Maradona’, by IBB",
    "summarized_story": "By Alao AbiodunFormer Military President Ibrahim Badamasi Babangida (IBB) has explained how he was nicknamed “evil genius” and “Maradona”.\nHe explained the nicknames were manufactured by the media because of his “deft political moves”.\nADVERTISEMENTBabaginda said: “That’s the very good thing about the Nigerian media and Nigerian people, you have to anticipate them.\nThey call me ‘evil genius’, I marvel at that.\nThe contradiction — you can’t be evil and then a genius”“The definition of Maradona I got from the media is because of deft political moves."
  },
  {
    "headline": "Why June 12 election was annulled, by IBB",
    "summarized_story": "By Alao AbiodunFormer Military President Ibrahim Badamasi Babangida (IBB) has explained why his junta annulled the June 12, 1993 presidential election.\nThe election was adjuged by most Nigerians as the freest and fairest in the nation’s democratic experience.\nIt was contested between Chief Moshood Abiola of the defunct Social Democratic Party (SDP) and Bashir Tofa of the defunct National Republican Convention (NRC).\nADVERTISEMENTBabangida, while speaking with Arise TV during an interview on Friday monitored by The Nation, explained if he had not annulled the election, a violent coup d’etat would have happened.\nHe said: “If it materialised, there would’ve been a coup d’etat — which could have been violent."
  },
  {
    "headline": "JUST IN: Supreme Court gets new Chief Registrar",
    "summarized_story": "By Eric Ikhilae, AbujaThe Chief Justice of Nigeria (CJN), Justice Ibrahim Muhammad has approved the appointment of Hajo Sarki-Bello as the Chief Registrar of the Supreme Court (in acting capacity).\nPart of the statement reads: “She is a 1989 graduate of Law from Uthman Dan Fodio University, Sokoto, Nigeria.\n“She was called to the Nigerian Bar on 7th June, 1990, after successfully completing the mandatory one year intensive academic programme at the Nigerian Law School, Lagos, Nigeria.\n“She has worked in in different capacities in different Law Firms and Commercial Organizations before joining the Supreme Court of Nigeria in 1996 as Senior Registrar.\n“In 2001, she was promoted to the position of Acting Deputy Chief Registrar and later became substantive Deputy Chief Registrar in 2006."
  },
  {
    "headline": "THE DIABETES DRUG THAT SAVED ME FROM CUTTING MY LEG",
    "summarized_story": "The journey of my diabetes started on a terrific Tuesday morning.\nI woke up early to catch up with the early morning flight; that 45 minutes journey was the beginning of my predicament.\nThe situation got worsened when I had a wound on my leg which later became sore.\nSo I ordered for 2 months’ treatment.\nNow I am well and healthy after 18 years of battling diabetes which almost claim my leg."
  },
  {
    "headline": "Who is afraid of Asiwaju Bola Tinubu?",
    "summarized_story": "By Tunde RahmanWhy do many political opponents dread the All Progressives Congress National Leader, Asiwaju Bola Ahmed Tinubu, so much so that in their wishful thinking they hope he gives way or simply quit the stage?\nThese are some of the questions that have agitated my mind following the repeated unfounded rumours about Asiwaju Tinubu’s health status.\nLeading the charge, Asiwaju Tinubu painlessly performed the seven-round tawaf and shortly after, being a Friday, it was time for Jummah.\nFirstly, some speak magisterially on the state of health of Asiwaju Tinubu.\nThe long and short of all of this is those wishing Asiwaju dead, hoping to profit from it should be very careful."
  },
  {
    "headline": "IBB advocates generation shift in Nigerian leadership",
    "summarized_story": "By Chukwudi NwejeFormer military President, General Ibrahim Badamasi Babangida (rtd) on Friday, made a case for a generation shift in Nigeria’s leadership.\nHe said the president Nigeria needs in 2023 and going forward should be someone knowledgeable in economics and one with friends across the geopolitical regions of the country, and should not be over 60 years old.\nHe said the future of Nigeria is in hands of the citizenry, who will either make or mar it.\n“I do believe in the future of Nigeria, but Nigerians don’t believe in the future of their country.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "BoT constitute committee to resolve PDP leadership crisis",
    "summarized_story": "From Ndubuisi Orji, AbujaThe Peoples Democratic Party ( PDP) Board of Trustees (BoT), yesterday, set up a panel to resolve the crisis rocking the party.\nThe committee comprising governors, members of the BoT, National Assembly caucus of PDP, the National Working Committee, former governors and ministers is expected to report back within 72 hours.\nAsked if the current NWC would be allowed to complete its tenure, former Senate president, Dr. Bukola Saraki, said the committee members would meet between 48 to 72 hours for way forward.\nJibrin stressed the need to look at why many past PDP national chairmen, Chief Audu Ogbeh, Chief Okwesilieze Nwodo, Alhaji Bamanga Tukur, Alhaji Ahmed Mua’zu and Alhaji Alimodu Sheriff, did not complete their tenures successfully.\nPDP National Chairman, Prince Uche Secondus, said the meeting was critical not only for members of the NWC but the entire PDP."
  },
  {
    "headline": "Lagos Assembly adopts report to stop houses for ex-governors, others",
    "summarized_story": "The Lagos State House of Assembly has approved the report of its committee on establishment which recommended the reduction of pensions to former governors and other affected officials by 50 percent.\nThe committee also expunged the provision of houses in Abuja and Lagos for former governors as stipulated in an earlier law operated by the state.\nThe report showed a reduction in the number of vehicles to be made available to former governors and their deputies.\nSpeaker of the House, Mudashiru Obasa, suggested that former governors should get two vehicles (a car and a van) instead of three as recommended by the committee.\nHowever, Obasa argued that it should be left at 50 percent, especially as the report had recommended the removal of houses and reduced other benefits."
  },
  {
    "headline": "FG threatens to sack striking doctors",
    "summarized_story": "From Fred Ezeh, AbujaFederal Government has threatened to sack resident doctors who withdrew their services nationwide since August 2 over alleged poor conditions of service.\nThe threat was contained in a letter by the Permanent Secretary, Federal Ministry of Health, Abdullaziz Abdullahi, and addressed to the doctors through their umbrella body, the National Association of Resident Doctors (NARD).\nGovernment said it would, probably, leverage on court judgment delivered by Justice Oluwakayode Olosegbe of Enugu branch of the National Industrial Court (NIC) to take its administrative actions if the doctors failed to return to work.\nIt, thus, reminded the striking doctors that the industrial court judgment indicated that they have no right to embark on strike for certain reasons.\nNARD President, Uyilawa Okhuaihesuyi, confirmed to Daily Sun that the letter from Federal Ministry of Health was received, yesterday, and their lawyers were working on the matter."
  },
  {
    "headline": "10 Katsina LGAs under siege of bandits, kidnappers, Masari tells COAS",
    "summarized_story": "“…With this situation in mind, there is no way we can sleep,” Masari told the Chief of Army Staff (COAS), Lt-Gen. Farouk Yahaya at the Government House, yesterday.\nYahaya assured that the military would continue to work with other security agencies in the state to ensure relative peace.\nThe Federal Government has also promised to ensure the armed forces is well trained and personnel adequately motivated to achieve its statutory mandate.\nMinister of Defence, Major General Bashir Magashi, made this known while commissioning the directing staff quarters of the National Defence College (NDC), at its permanent site Piwowi, Abuja.\nHe said concerted efforts had being made towards the relocation of the college from its current temporary sites in the Central Business District to the permanent site since 2007."
  },
  {
    "headline": "Buhari Calls Police On Nigerian Protesters In London, Demonstrators Refuse To Back Down, Call President Terrorist",
    "summarized_story": "President Muhammadu Buhari has reportedly called police officers in London to prevent Nigerian protesters from gathering in front of the Nigeria House at Trafalgar Square in London, United Kingdom.\nAfter attending the Global Education Summit on Financing Global Partnership for Education (GPE) 2021-2025, the Nigerian President stayed behind to see his doctors, even as resident doctors in his country have gone on strike.\nThe police officers were seen speaking with the Nigerian protesters, seemingly persuading them to stop protesting there.\nThere is no single healthcare in Nigeria, Buhari is still in government for over 6 years, he keeps borrowing, the economy is not good, there is rising inflation.\nBuhari, you are a wicked President, leave the government now, release Sowore, over two years now."
  },
  {
    "headline": "Buhari Calls Police On Nigerian Protesters In London, Demonstrators Refuse To Back Down, Call President Terrorist",
    "summarized_story": "President Muhammadu Buhari has reportedly called police officers in London to prevent Nigerian protesters from gathering in front of the Nigeria House at Trafalgar Square in London, United Kingdom.\nAfter attending the Global Education Summit on Financing Global Partnership for Education (GPE) 2021-2025, the Nigerian President stayed behind to see his doctors, even as resident doctors in his country have gone on strike.\nThe police officers were seen speaking with the Nigerian protesters, seemingly persuading them to stop protesting there.\nThere is no single healthcare in Nigeria, Buhari is still in government for over 6 years, he keeps borrowing, the economy is not good, there is rising inflation.\nBuhari, you are a wicked President, leave the government now, release Sowore, over two years now."
  },
  {
    "headline": "Ex-Nigerian Dictator, Babangida Rules Out Tinubu, Atiku, Says Nigeria’s Next President Should Be In Their 60s",
    "summarized_story": "Former Nigerian military dictator, Ibrahim Badamasi Babangida, also known as IBB has said Nigeria’s next president should be in his 60s, ruling out two major aspirants, a former vice president, Atiku Abubakar and a former governor of Lagos State, Bola Tinubu, from the 2023 presidential run.\nThough he did not make a direct reference to the duo, IBB, during an interview with Arise TV, suggested that individuals in their 60s should be the focus of Nigerians as potential presidential candidates in 2023.\nFrom available records, the next general election will be held in 2023, and by that time, Atiku should be 77, while Tinubu, who marked his 68th birthday in March, would have turned 70 years.\nBabangida further said one of the reasons Nigeria has not developed or achieved the dreams of its founding fathers was because Nigerians no longer believed in the future of their own country.\n“That is a person, who is very versed in economics and is also a good politician, who should be able to talk to Nigerians and so on."
  },
  {
    "headline": "Ex-Nigerian Dictator, Babangida Rules Out Tinubu, Atiku, Says Nigeria’s Next President Should Be In Their 60s",
    "summarized_story": "Former Nigerian military dictator, Ibrahim Badamasi Babangida, also known as IBB has said Nigeria’s next president should be in his 60s, ruling out two major aspirants, a former vice president, Atiku Abubakar and a former governor of Lagos State, Bola Tinubu, from the 2023 presidential run.\nThough he did not make a direct reference to the duo, IBB, during an interview with Arise TV, suggested that individuals in their 60s should be the focus of Nigerians as potential presidential candidates in 2023.\nFrom available records, the next general election will be held in 2023, and by that time, Atiku should be 77, while Tinubu, who marked his 68th birthday in March, would have turned 70 years.\nBabangida further said one of the reasons Nigeria has not developed or achieved the dreams of its founding fathers was because Nigerians no longer believed in the future of their own country.\n“That is a person, who is very versed in economics and is also a good politician, who should be able to talk to Nigerians and so on."
  },
  {
    "headline": "Ex-Nigerian Dictator, Babangida Rules Out Tinubu, Atiku, Says Nigeria’s Next President Should Be In Their 60s",
    "summarized_story": "Former Nigerian military dictator, Ibrahim Badamasi Babangida, also known as IBB has said Nigeria’s next president should be in his 60s, ruling out two major aspirants, a former vice president, Atiku Abubakar and a former governor of Lagos State, Bola Tinubu, from the 2023 presidential run.\nThough he did not make a direct reference to the duo, IBB, during an interview with Arise TV, suggested that individuals in their 60s should be the focus of Nigerians as potential presidential candidates in 2023.\nFrom available records, the next general election will be held in 2023, and by that time, Atiku should be 77, while Tinubu, who marked his 68th birthday in March, would have turned 70 years.\nBabangida further said one of the reasons Nigeria has not developed or achieved the dreams of its founding fathers was because Nigerians no longer believed in the future of their own country.\n“That is a person, who is very versed in economics and is also a good politician, who should be able to talk to Nigerians and so on."
  },
  {
    "headline": "IBB speaks on 'Maradona' nickname, reveals why he annulled MKO Abiola's election victory",
    "summarized_story": "Ibrahim Badamasi Babangida (IBB), former head of state, has shed light on what informed his annulment of the June 12 general election.\nAdvertisementBabangida inexplicably annulled the June 12, 1993 general election which was considered by most Nigerians as the freest and fairest poll in the country’s history.\nIt was widely believed that the candidate of the SDP was leading when Babangida annulled the election.\nHe, however, shed light on what led to the sudden annulment of the general election.\nThey call me ‘evil genius’, I marvel at that."
  },
  {
    "headline": "IBB speaks on 'Maradona' nickname, reveals why he annulled MKO Abiola's election victory",
    "summarized_story": "Ibrahim Badamasi Babangida (IBB), former head of state, has shed light on what informed his annulment of the June 12 general election.\nAdvertisementBabangida inexplicably annulled the June 12, 1993 general election which was considered by most Nigerians as the freest and fairest poll in the country’s history.\nIt was widely believed that the candidate of the SDP was leading when Babangida annulled the election.\nHe, however, shed light on what led to the sudden annulment of the general election.\nThey call me ‘evil genius’, I marvel at that."
  },
  {
    "headline": "Corruption in Nigeria worse under civilian leaders than military rulers, says IBB",
    "summarized_story": "Ibrahim Badamasi Babangida (IBB), former military head of state, says corruption in Nigeria is worse under civilian leaders than under military rulers.\nThe former military head of state said people who steal public money under civilian administrations are on the streets walking free.\nHe said during his time as military head of state, he sacked a governor for misappropriating less than N313,000, adding that military leaders are saints in that regard, compared to what is happening under the democratic dispensation.\nWho else is better in fighting corruption?”AdvertisementThe former military head of state blamed politicians for disunity in the country.\n“Till today, unfortunately, the political class are not really into this seriously and say how do we build a nation,” he said."
  },
  {
    "headline": "Corruption in Nigeria worse under civilian leaders than military rulers, says IBB",
    "summarized_story": "Ibrahim Badamasi Babangida (IBB), former military head of state, says corruption in Nigeria is worse under civilian leaders than under military rulers.\nThe former military head of state said people who steal public money under civilian administrations are on the streets walking free.\nHe said during his time as military head of state, he sacked a governor for misappropriating less than N313,000, adding that military leaders are saints in that regard, compared to what is happening under the democratic dispensation.\nWho else is better in fighting corruption?”AdvertisementThe former military head of state blamed politicians for disunity in the country.\n“Till today, unfortunately, the political class are not really into this seriously and say how do we build a nation,” he said."
  },
  {
    "headline": "IBB: Next president should be able to talk to Nigerians, understand the economy",
    "summarized_story": "Ibrahim Badamasi Babangida (IBB), former head of state, says Nigeria’s next president should be able to talk to Nigerians.\nAdvertisementThe former military ruler said Nigeria’s next president must speak to the citizens, understand economics, and have friends in every region.\nBabangida said he has seen Nigerians who have the qualities he described, and they are in their sixties.\n“That is a person, who is very versed in economics and is also a good politician, who should be able to talk to Nigerians and so on.\nI believe so if we can get him.”AdvertisementBabangida also said importance should be given to qualification over ethnicity when choosing Nigeria’s next president."
  },
  {
    "headline": "Olumide Soyombo: The journey from startup founder to investment mogul",
    "summarized_story": "The early daysAt first, being a doctor was all Soyombo wanted to be until he was given a personal computer.\nAfter his first degree, Soyombo went on to get a master’s degree in business and information technology from Aston Business school.\nSo they created Leadpath as an investment vehicle to invest in startups, at first the approach was to invest $25,000 – $100,000 in local tech startups, similar to the Y-combinator accelerator model.\nThe bitter taste of how the founder handled the first company didn’t allow Soyombo to invest in the second company.\nWhen he thinks about the future, Soyombo is excited about the fact that the African tech ecosystem is maturing."
  },
  {
    "headline": "MTN finally repatriates 2020 dividend from Nigeria after forex crisis",
    "summarized_story": "South Africa’s MTN Group has repatriated its last year’s dividend of around $280 million (R4.2 billion) from its local unit in Nigeria.\nRespite in U.S. court caseIn addition to the news from Nigeria, MTN also revealed “positive developments” in a United States court case related to the group and its subsidiaries, MTN Afghanistan and MTN Dubai.\nIn Nigeria, MTN, through its local unit, has earmarked ₦600 billion ($1.5 billion) over the next three years to expand broadband access in Africa’s most populous economy.\nMobile subscribers decline in NigeriaFor MTN Nigeria, half-year 2021 results show that service revenue increased by 24.1% year-on-year, despite the number of its mobile subscribers declining by 7.6 million (nearly 10%).\nMTN Nigeria aims to sustain “double-digit service revenue growth ahead of inflation, driving 4G and rural network expansion,” Toriola said."
  },
  {
    "headline": "Can mobile applications help solve Africa's healthcare access problem?",
    "summarized_story": "Without discovering the mobile app, he could easily have been one of the more than 400,000 Africans malaria killed in 2019.\nZuri Health mobile app.\nArthur Ikechukwu Anoke and Daisy Isiaho, co-founders of the mobile app, Zuri Health.\nGovernmental policies will help hold digital healthcare companies accountable and protect the information and data of citizens that use the technologies.\nYet it’s fundamental if we should achieve the Sustainable Development Goals,” said Daisy Isiaho, Zuri Health Co-founder and Chief Product Officer."
  },
  {
    "headline": "Inconsistent policies are killing African startups",
    "summarized_story": "On 18 December, 2015 the CBK again issued Banking Circular No 14 of 2015, which cautioned, ‘all financial institutions against dealing in virtual currencies or transacting with entities that are engaged in virtual currencies.\nFinancial institutions are expressly advised not to open accounts for any person dealing in virtual currencies such as Bitcoin.\nDigital Tax policies in South Africa, Nigeria, Uganda and KenyaSouth Africa was the first, in 2014, to tax digital services by imposing a 14% value added tax (VAT) on digital imports.\nThis same proposal for digital tax was only shut down by the Benin Government after a peaceful protest was staged by its people.\nThis has not been the case however – digital tax policies and laws have mainly been used to restrict digital activity of citizens, infringing on their digital rights."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "African payments startup, Flutterwave, has announced the appointment of Jimmy Ku as the Head of US Growth."
  },
  {
    "headline": "MVX’s seed round, Cellulant’s Ghana licence, Revio’s seed round",
    "summarized_story": "Source TechCrunchNigerian digital freight company, MVX, has raised a $1.3 million seed round to scale its operations, hire staff, and improve its technology.\nThe freight company launched MVXtransit, a digital freight booking platform that helped cargo owners find deals on moving containers.\nTingg is a digital payments network that allows businesses and their customers to accept and make payments easily.\nThis announcement is coming after Cellulant was granted a Payment Services Provider (PSP) licence by the Central Bank of Ghana (CBG).\nRevio claims it supports all currencies and integrates with the African payments startup, Flutterwave, to allow its SaaS clients to sell their products to all African customers."
  },
  {
    "headline": "MVX, Nigerian digital freight startup, secures $1.3m to tackle ocean freight challenges in Africa",
    "summarized_story": "Share this article:On Thursday, July 5, 2021, Nigeria-based digital freight startup, MVX, announced a $1.3 million seed round to tackle the challenge of financing and booking freight operations in Africa.\nInvestors in this round include Kepple Africa Ventures, Launch Africa Ventures, Founders Factory and some angel investorsThis comes after the startup secured a $100,000 pre-seed investment from Oui Capital in 2019.\nPer TechCrunch, MVX wants to ease trade finance and freight shipping in Africa by making the process available online.\nThese services are now available on one platform — MVX.\nTrade Africa still has a long way to go."
  },
  {
    "headline": "Flutterwave to drive US expansion as it appoints Silicon Valley veteran as head of US growth",
    "summarized_story": "Share this article:African payments startup, Flutterwave, has announced the appointment of Jimmy Ku as the Head of US Growth.\nWith plans to offer payment services to US-based clients, local businesses, and companies, Ku’s appointment strengthens Flutterwave’s vision for the US market.\nFounded in 2016 by Olugbenga Agboola and Iyinoluwa Aboyeji, Flutterwave provides a payment infrastructure for merchants and payment services providers in Africa.\nThe fintech startup claims to simplify payments for limitless possibilities by making it easier for Africans to launch global businesses that can make and receive payments from anywhere in the world.\nRecall that Flutterwave partnered with PayPal, an American online payments system, to allow African merchants to receive payments from PayPal users across the globe."
  },
  {
    "headline": "Nigeria powers SSA to lead global P2P bitcoin market",
    "summarized_story": "Nigeria is the second-largest P2P market for bitcoin behind the United States – in July 2021, according to a report by Luno and Arcane Research.\nThis is not the first time Nigeria is being put behind the US in the P2P market.\nPaxful earlier in the year noted that Nigeria was the second-largest market for P2P transactions on its platform.\nThroughout the month of July, the global weekly P2P volumes trailed at around $60 million from $93 million recorded on the week of February 15.\nHowever, while the global P2P volumes trend downwards, the SSA P2P volumes have remained stable."
  },
  {
    "headline": "Explainer: Why demand for aircraft spares is rising in Nigeria",
    "summarized_story": "Explainer: Why demand for aircraft spares is rising in NigeriaThe demand for aircraft spare parts has continued to rise in Nigeria and globally as airlines seek ways to cushion the effect of COVID-19 on their operations.\nExperts globally are saying the aircraft spare market is growing following the inability of airlines to buy new planes as a result of COVID-19 impacts, thereby forcing operators…"
  },
  {
    "headline": "Nigeria’s largest FMCGs see profits surge to five-year high",
    "summarized_story": "Nigeria’s largest Fast-Moving Consumer Goods (FMCGs) companies have seen their profits surge to a five-year high and above pre-pandemic levels in the first half of 2021, a sign that an economic recovery is on for Africa’s biggest economy.\nData compiled by BusinessDay show that Nestle Nigeria, Dangote Sugar, Flour Mills, Unilever Nigeria, and Nascon recorded…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Obaseki’s agric reforms: Edo allocate 57,000 hectares to large, smallholder oil palm investors – Nigerian Observer",
    "summarized_story": "Obaseki said this while delivering a keynote address at the National Initiative for Sustainable and Climate-Smart Oil Palm Smallholders (NI-SCOPS) Roundtable, held in Benin City, the Edo State capital.\nHowever, we still import over N90 billion worth of oil palm produce annually into this country.\n“The Nigerian oil palm economy has the capability of earning over $20 billion for our country annually just for cultivation and production.\nObaseki added: “Edo State is a member of Tropical Forest Alliance and also African Palm Oil Initiative.\nIt is significant to note that Edo State Government is the only sub-national government that is a member of these bodies."
  },
  {
    "headline": "Edo govt trains ICT staff to improve efficiency, productivity – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has trained staff of the state’s Information Communication Technology Agency on the latest innovations in the ICT space, so as to enhance their performance and ensure efficient service delivery to Edo people.\nSpeaking at the two-day training programme in Benin City, Permanent Secretary, Office of the Secretary to the State Government, Deborah Enakhimion Esq., charged the workers to be diligent and more committed to discharging their duties.\nShe noted that the training was designed to boost service delivery in the agency, urging the ICTA staff to leverage the opportunity of the training to ensure better service to Edo people, in line with the vision of Governor Godwin Obaseki.\nIn her remarks, the functioning Executive Director of ICTA Corporate Services, Mrs. Emajoba Iyama, noted that the training, at the instance of the Edo State Head of Service, was divided into sections to accommodate all staff of the agency.\nOne of the participants, Mr. Raphael Atogbo, hailed the government for the training, describing it as educating and enlightening."
  },
  {
    "headline": "Break the silence, Edo First Lady charges victims of rape, other gender-based violence …assures of govt’s support – Nigerian Observer",
    "summarized_story": "The First Lady was accompanied by the Edo State Deputy Governor, Rt.\nMrs. Obaseki said she would follow up the case to ensure justice is served, noting, “The case has been adjoined to the 10th of August, 2021.\nWe will make time to come back here again, until we see the end of the case to ensure justice is served.\n“We are here, today, to follow up with the case and ensure justice is served.\n“There is the Vivian Ogu Centre; a gender-based violence centre."
  },
  {
    "headline": "CVR: 120,600 Nigerians completes physical registration within 9 days – INEC – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Independent National Electoral Commission (INEC), has said that about 120,600 Nigerians have completed their physical registration in the ongoing nationwide Continuous Voter Registration (CVR) taking place in the country from July 26th through 3rd August, 2021.\nThis was contained in an update provided by INEC on Wednesday in Abuja indicating that out of 120,600 Nigerians, who had completed their physical registration, 72,075 were male, while 48,525 were female.\nRecall that INEC started the online registration of voters on June 28th while the in-person (or physical) registration commenced on July 26th.\nMr. Okoye also added that young Nigerians between the ages of 18 and 34 were still leading in both online registration (1,074,260 or 65 per cent) and completed registration (84,619 or 70 per cent).\n“In terms of occupation, students are leading in both pre-registration (529,219 or 32 per cent) and completed registration (48,897 or 41 per cent)."
  },
  {
    "headline": "Supreme Court names acting Chief Registrar",
    "summarized_story": "ADVERTISEMENTThe Chief Justice of Nigeria (CJN), Tanko Muhammad, has appointed an acting Chief Registrar of the Supreme Court.\nHajo Sarki-Bello, currently a Deputy Chief Registrar of the apex court, was appointed to replace the retiring Chief Registrar, Hadizatu Uwani-Mustapha.\nDescribed as a “seasoned judicial administrator and technocrat”, the Acting Chief Registrar joined the Supreme Court service in 1996.\nRead full statement below:PRESS RELEASESUPREME COURT GETS NEW CHIEF REGISTRARThe appointment of a new Chief Registrar was yesterday approved by the Honourable, the Chief Justice of Nigeria, Hon.\nIn 2001, she was promoted to the position of Acting Deputy Chief Registrar and later became substantive Deputy Chief Registrar in 2006."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Fuel subsidy will stay because govt is being considerate – Minister",
    "summarized_story": "Nigeria’s Minister of State for Petroleum, Timipre Sylva, has said that the fuel subsidy regime will stay for the time being because the government is being considerate of citizens.\nThe Minister who spoke in an interview with Channels Television yesterday, noted that the government has not set any date yet for subsidy removal.\nBut the Vice President is actually leading the efforts and very soon, we will tell Nigerians what date the removal of subsidy will kick in,” he said.\nSylva explained that the government is making efforts to put structures in place to cushion the effect of the eventual subsidy removal.\n“We must be considerate of our people; you cannot say because you have the muscle, box everybody down in the room."
  },
  {
    "headline": "EIE, PIN, MRA sue telcos over Twitter ban in Nigeria",
    "summarized_story": "OBINNA EZUGWURights groups EIE Nigeria, Paradigm Initiative and Media Rights Agenda have dragged Telecom companies in Nigeria to court for blocking access to Twitter in the country, following a ban placed on the platform by the Nigerian government.\n“Following the suspension of twitter in Nigeria in June 2021.\nIt was evident that the government did not have the sole responsibility of the disregard for human rights.\nA directive not rooted in Law cannot be a basis for the abuse of the human rights of millions of Nigerians,” the statement said.\nThese are all pursuant to rights assured by the Nigerian Constitution and the African Charter of Human and Peoples Rights.”"
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Lagos Assembly cuts Tinubu, Fashola, other ex-governors’ pensions by 50%",
    "summarized_story": "The Lagos State House of Assembly has approved the reduction of former governors of the state by 50 per cent.\nThe committee also removed the provision of houses in Abuja and Lagos for ex-governors as stipulated in an earlier law operated by the state.\nThe report further showed a reduction in the number of vehicles to be made available to former governors and their deputies.\nThe Speaker of the House, Mudashiru Obasa, suggested that former governors should get two vehicles (a car and a van) instead of three as recommended by the committee.\nHe also suggested that the amended bill should provide that the cars be changed every four years instead."
  },
  {
    "headline": "I Annulled June 12 Poll To Preempt A Coup – IBB",
    "summarized_story": "Former Military President, General Ibrahim Badamasi Babangida (rtd), has provided insights into why he annulled June 12, 1993 presidential election.\nADVERTISEMENTBut days into the election result collation by the electoral commission headed Prof. Humprey Nwosu, Gen Babangida inexplicably annulled the election, which was considered by most Nigerians as the freest and fairest poll in the country’s history.\nIt was widely believed that the candidate of the SDP was leading when Babangida annulled the election.\nBabangida, while speaking on AriseNews TV on Friday, revealed that if he had not annulled the election, a coup d’etat would have occurred.\nThat’s the way the media described it,” he said."
  },
  {
    "headline": "I Annulled June 12 Poll To Preempt A Coup – IBB",
    "summarized_story": "Former Military President, General Ibrahim Badamasi Babangida (rtd), has provided insights into why he annulled June 12, 1993 presidential election.\nADVERTISEMENTBut days into the election result collation by the electoral commission headed Prof. Humprey Nwosu, Gen Babangida inexplicably annulled the election, which was considered by most Nigerians as the freest and fairest poll in the country’s history.\nIt was widely believed that the candidate of the SDP was leading when Babangida annulled the election.\nBabangida, while speaking on AriseNews TV on Friday, revealed that if he had not annulled the election, a coup d’etat would have occurred.\nThat’s the way the media described it,” he said."
  },
  {
    "headline": "Electronic Voting Possible In Nigeria, Says Kaduna Dep Gov",
    "summarized_story": "Kaduna State deputy governor, Dr Hadiza Balarabe, has said that elections can be safely conducted in Nigeria, using the electronic voting system.\nShe noted that the development had been proven when the state conducted local government elections across the 23 LGs in the state in 2018.\nDr Balarabe made the remarks during a stakeholders’ sensitisation programme organised by the Kaduna State Independent Electoral Commission (KADSIECOM) in the state capital on Thursday.\nADVERTISEMENTRecall that Kaduna state was first to use electronic voting in the country, using the Electronic Voting Machines.\n“In 2018, the Kaduna State Government introduced electronic voting for the local government elections of May and June 2018."
  },
  {
    "headline": "Electronic Voting Possible In Nigeria, Says Kaduna Dep Gov",
    "summarized_story": "Kaduna State deputy governor, Dr Hadiza Balarabe, has said that elections can be safely conducted in Nigeria, using the electronic voting system.\nShe noted that the development had been proven when the state conducted local government elections across the 23 LGs in the state in 2018.\nDr Balarabe made the remarks during a stakeholders’ sensitisation programme organised by the Kaduna State Independent Electoral Commission (KADSIECOM) in the state capital on Thursday.\nADVERTISEMENTRecall that Kaduna state was first to use electronic voting in the country, using the Electronic Voting Machines.\n“In 2018, the Kaduna State Government introduced electronic voting for the local government elections of May and June 2018."
  },
  {
    "headline": "Corruption In Nigeria Worse Under Civilian Administrations, Says IBB",
    "summarized_story": "Former Military President, General Ibrahim Badamasi Babangida (rtd), has said that corruption in Nigeria is worse under civilian leaders than under military rulers.\nBabangida said this on Friday during a special interview to mark his 80th birthday anniversary on AriseNews television station.\nThe former military ruler said people who steal public money under civilian administrations are on the streets walking free.\nFrom what I read, from analysis, I think we are saints when compared to what is happening under a democratic dispensation.\nGen Babangida popularly referred to as IBB, also blamed politicians for current disunity in the country."
  },
  {
    "headline": "Sanwo-Olu tasks NAICOM to assist state in activating capital based tax",
    "summarized_story": "By GBENGA ADEOLAAuditors-General of Local Governments Hails Lagos Gov for being first Governor to Sign New Audit LawLagos State Governor, Mr. Babajide Sanwo-Olu, has tasked management of the National Insurance Commission (NAICOM) on the need to assist the state in activating the Capital based tax in claims as enshrined in the Nigeria Constitution.\nThe Governor also tasked the sector on continuous advocacy and education of residents on the benefits of the Insurance sector to businesses, promising to be a partner in progress.\nHe said accountability and probity should be a way of life for leaders to gain trust of the citizens.\nSpeaking during the visit, Atiku commended Sanwo-Olu for being the first Governor to sign the new Audit law in the country.\nAlso speaking during NAICOM courtesy visit, Olorundare Thomas, commended Lagos State Governor for all his efforts in the state, adding that NAICOM is set to partner with all the relevant Ministries, Departments and Agencies (MDAs) of government in the State."
  },
  {
    "headline": "Sanwo-Olu tasks NAICOM to assist state in activating capital based tax",
    "summarized_story": "By GBENGA ADEOLAAuditors-General of Local Governments Hails Lagos Gov for being first Governor to Sign New Audit LawLagos State Governor, Mr. Babajide Sanwo-Olu, has tasked management of the National Insurance Commission (NAICOM) on the need to assist the state in activating the Capital based tax in claims as enshrined in the Nigeria Constitution.\nThe Governor also tasked the sector on continuous advocacy and education of residents on the benefits of the Insurance sector to businesses, promising to be a partner in progress.\nHe said accountability and probity should be a way of life for leaders to gain trust of the citizens.\nSpeaking during the visit, Atiku commended Sanwo-Olu for being the first Governor to sign the new Audit law in the country.\nAlso speaking during NAICOM courtesy visit, Olorundare Thomas, commended Lagos State Governor for all his efforts in the state, adding that NAICOM is set to partner with all the relevant Ministries, Departments and Agencies (MDAs) of government in the State."
  },
  {
    "headline": "EbonyLife TV, Universal Pictures get adaptation rights for movie on Hushpuppi",
    "summarized_story": "Mo Abudu’s EbonyLife TV, Universal Pictures, and Will Packer Productions have received the adaptation rights for a movie on Ramon Abass, also known as Ray Hushpuppi.\nThe production houses have decided to do a movie on the International fraudster, based on a Bloomberg story, “The Fall of the Billionaire Gucci Master.”According to The Hollywood Reporters, an untitled action thriller movie project has been set up at Universal Pictures, following the collection of the adaptation rights for the movie.\nWhen the project is ready, Mo Abudu will produce for EbonyLife Studios while Will Packer Productions and Abudu will produce for EbonyLife Studios.\nWill Packer Productions is known for producing popular movies like Girls Trip and Night School.\nDetectives seized more than 150 million dirham (£30 million) when they swooped on his Dubai apartment as he slept."
  },
  {
    "headline": "EbonyLife TV, Universal Pictures get adaptation rights for movie on Hushpuppi",
    "summarized_story": "Mo Abudu’s EbonyLife TV, Universal Pictures, and Will Packer Productions have received the adaptation rights for a movie on Ramon Abass, also known as Ray Hushpuppi.\nThe production houses have decided to do a movie on the International fraudster, based on a Bloomberg story, “The Fall of the Billionaire Gucci Master.”According to The Hollywood Reporters, an untitled action thriller movie project has been set up at Universal Pictures, following the collection of the adaptation rights for the movie.\nWhen the project is ready, Mo Abudu will produce for EbonyLife Studios while Will Packer Productions and Abudu will produce for EbonyLife Studios.\nWill Packer Productions is known for producing popular movies like Girls Trip and Night School.\nDetectives seized more than 150 million dirham (£30 million) when they swooped on his Dubai apartment as he slept."
  },
  {
    "headline": "Aminu Yar'Adua, late President Umaru Yar'Adua's son sent to Yola prison",
    "summarized_story": "By Muhammad Adam/YolaA Magistrate’s Court in Yola on Thursday remanded Aminu Yar’Adua, the son of late former President Umaru Yar’Adua, in prison for allegedly killing four people in an auto crash in Yola.\nYar’Adua, a 36 year-old student of the American University of Nigeria (AUN) Yola, was charged to court for allegedly causing death by dangerous driving on 23 June 2021.\nThe prosecuting officer told the court that the relatives of late Aisha Umar, Suleiman Abubakar and Jummai Abubakar had demanded the sum of N15 million from the defendant as compensation.\nHe then ordered that Aminu Yar’Adua be remanded in prison custody until then.\nThe prompt intervention of policemen at the scene of the accident, saved Yar’adua, said to be an off-campus student of American University of Nigeria (AUN)."
  },
  {
    "headline": "Babangida: The real reason I annulled MKO Abiola's election",
    "summarized_story": "Michael AdeshinaFormer military president Ibrahim Babangida, has given what he called the ‘honest reason’ his government annulled the 1993 June 12 election, won by MKO Abiola.\nIn an interview on Arise TV today, Babangida was confronted with the question on the criminal annulment of a free and fair election.\nBabangida, resorting to revisionism sought to explain the reason for the annulment of an election widely considered to be the best in the history of Nigeria.\nOn 24 June 1993, Babangida government shocked the world by announcing the annulment of the June 12 election.\nWith public outcry, his government attempted to taint the election, by citing unproven allegations of vote-buying and other electoral irregularities."
  },
  {
    "headline": "BREAKING: Supreme Court Gets New Chief Registrar",
    "summarized_story": "Following the impending retirement of the incumbent by this weekend, Hajo Sarki-Bello has been named as the new Chief Registrar of Nigeria’s apex court, the Supreme Court.\nThe Federal Judicial Service Commission just approved the new Chief Registrar’s appointment.\nShe will succeed Hajia Hadiza Uwani Mustapha, whose term as governor will end on July 8, 2021.\nSoon, there will be more information…"
  },
  {
    "headline": "Late President Yar’Adua’s Son Arrested By Police For Killing Four People",
    "summarized_story": "Aminu Yar’Adua, the son of late President Umaru Yar’Adua, has been arrested for the murder of four people in Yola.\nMr Yar’Adua was remanded in jail detention by a magistrates’ court in Yola on Thursday for crushing four individuals to death in an auto accident in Yola.\nOn June 23, this year, the late president’s son, a student at the American University of Nigeria (AUN), was accused in court with causing death through unsafe driving.\nJummai Ibrahim, the magistrate, granted the prosecution’s plea and remanded the case to August 19 for further consideration.\nHis father, a former governor of Katsina (from 1999 to 2007), went on to become President of Nigeria following his term as governor."
  },
  {
    "headline": "18 More Boko Haram Terrorists Surrender In Borno — Nigerian Army",
    "summarized_story": "In Borno state, the Nigerian Army says 18 additional terrorists have surrendered to troops.\nThe suspected terrorists surrendered alongside their family members, according to army spokesman Onyema Nwachukwu, who announced this in a statement on Thursday.\nMore than 100 insurgents have surrendered to the army in the last two weeks, he said.\n“More Boko Haram (BHT)/Islamic State West African Province (ISWAP) terrorists are surrendering as troops of Operations Hadin Kai (OPHK), conducting counter terrorism and counter insurgency operations in north east Nigeria escalate ground and air offensive operations against the terrorists,” the statement reads.\n“Recently, the terrorist groups have suffered enormous setback and recorded several casualties as a result of ferocious offensives by gallant troops of OPHK."
  },
  {
    "headline": "Uche Secondus: Details Of What PDP BoT Discussed Emerges",
    "summarized_story": "The Board of Trustees (BoT) of the Peoples Democratic Party (PDP) has disclosed measures put in place to address the internal crisis rocking the party.\nThe representatives of the BoT spoke to newsmen in Abuja on Thursday after the crucial meeting held behind closed doors by the party leaders.\nThe meeting was summoned in the wake of defections from the party as well as the recent leadership crisis touching on the National Chairman position occupied by Prince Uche Secondus.\nAtiku spoke against the backdrop of the recent crisis rocking the party, particularly, the calls for the removal of Prince Uche Secondus as the national chairman of the party.\nHe said the PDP must not allow the dreams of the ruling All Progressives Congress (APC) to have a one-party state to come to fulfillment."
  },
  {
    "headline": "Breaking: 4 dead, vehicles burnt as Police, gunmen clash midnight in Imo",
    "summarized_story": "A Police inspector and three attackers have been confirmed dead after gunmen invaded Police divisional headquarters in Orlu, Imo state Thursday night.\nConfirming the latest development on Friday morning, Police Public Relations Officer in Imo, Mike Abattam, said Policemen on duty squared up against the attackers which led to the death of three out of others.\nHe said the remaining escaped with gun shots.\nDetails loading…"
  },
  {
    "headline": "VIDEO: Relief, jubilation as FG commissions erosion, flood project in Abia",
    "summarized_story": "Attracted by the member representing Isuikwuato/Umunneochi federal constituency in Abia state, Hon.\nNkeiruka Onyejeocha, the federal government on Thursday August 5, 2021 commissioned a multi-million erosion and flood project.\nThe project is located inside Isuikwuato community."
  },
  {
    "headline": "Masari to COAS Yahaya: 10 Katsina LGAs under severe daily attack",
    "summarized_story": "On a daily basis, 10 out of the 34 local government areas in Katsina state come under severe attack from bandits, Governor Aminu Bello Masari has declared.\nGovernor Masari stated this Thursday while receiving in audience the Chief of Army Staff (COAS), Lt.-Gen Faruk Yahaya at the Government House Katsina.\nYahaya, who commended the governor for his support to the troops, said the visit was also to seek for continued support of the state government.\n“Six people died, including a soldier,” in the attack in Kaiga-Kindjiria district, said the source, speaking on condition of anonymity.\nIn March, 23 troops were killed when their forward position on the north-eastern side of the lake came under attack."
  },
  {
    "headline": "CSO moves to tackle ill practices against humans -NigPilot",
    "summarized_story": "A Civil Society Organisation, Afrodition Consults Limite d ACL, has taken steps to address practices that are against the well-being of people.\nMaking this point during a program tagged, “The effect of ethnic and religious bias on mental health in Nigeria”The founder of the group, Ahmed Bolaji, said the initiative was to bridge the gap of taboos and stigmatization against some persons in the society.\nHe explained that there is no health without mental health, “we understand the role our cultural and religious upbringing could play in ourmental and emotional well-being and our daily living.\nThe group said its solutions include early help and support for substance misuse-induced mental health, perinatal mental health, dedicated dementia support service, and dedicated autism support service.\nAlso, there were other key presentations from the president of Helpline Foundation for the Needy, Abuja, Jumai Ahmadu, with Chairman Senate Committee on Health and Chairman House Committee on Health Care Services"
  },
  {
    "headline": "National Unity: Ganduje urges secession agitators to embrace dialogue -NigPilot",
    "summarized_story": "Kano state governor, Dr. Abdullahi Umar Ganduje, has urged secession agitators in the country to embrace dialogue as an option in the interest of national unity, adding thatThe Kano State governor also warned that the continent of Africa will lose its respect in the committee of nations in the world if Nigeria ceases to exist as a Nation.\nThe Kano governor said the advocates of secession should have a change of heart and recommended dialogue as a crucial option for addressing their problems.\nAnd that demand is even louder and the debate is on and no one is troubling agitators for agitating for restructuring of the federation.\nThere should be no secession distraction at this time.”According to Ganduje, there is a National Assembly where some of the grievances can be addressed.\n“Similarly, what do we do with the likes of Rochas Okorocha, former Imo state governor and now Senator representing Imo West Senatorial District in the South East."
  },
  {
    "headline": "SSCE: Echono bemoans deplorable state of exam facilities -NigPilot",
    "summarized_story": "As students sit for the Senior School Certificate Examination of the National Examination Council, NECO, nationwide, the Permanent Secretary, Federal Ministry of Education, Arc.\nSonny Echono has expressed dissatisfaction over the poor examination facilities in most Nigerian Schools.\nSpeaking on the security situation of schools, Echono said the Nigerian government has put all the necessary security measures to ensure that schools are safe.\nHe said the report of the Sub Committee on the provision of security for schools will soon be submitted.\nEchono also revealed that the government is involving Police and vigilante groups to ensure schools are safe."
  },
  {
    "headline": "Photo Op of FEC meeting, yesterday -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Nigeria Records More Deaths As COVID-19 Cases Increase",
    "summarized_story": "Nigeria’s has reported more deaths from COVID-19 complications as infections continue to rise in the country.\nThe Nigeria Centre for Disease Control (NCDC) confirmed 566 new cases and 11 deaths across the country on Thursday.\nAccording to the latest NCDC data, Lagos had the highest number of infections with 283 cases.\nThe Presidential Steering Committee (PSC) on COVID-19 have asked them to ensure mandatory use of face masks for everyone attending such political events.\nIt stated that persons without face masks should not be allowed access to the venues, while hand hygiene facilities should be made available for people before gaining access to the venues."
  },
  {
    "headline": "FG Not The Best Manager Of Refineries – Petroleum Minister",
    "summarized_story": "By Akinola AjibolaThe Federal Government has admitted that it is not in the best position to manage the nation’s refineries.\nMinister of State for Petroleum Resources, Timipre Sylva, stated this during his appearance on Thursday’s edition of Politics Today.\nDespite the submission, the minister believes it will not be out of place if the government gets the refineries working before taking appropriate decisions.\n“We want to sell live refineries; refineries that are working and I think that is the fairest thing for the government to do and that is why we have decided to get all our refineries working.\n“We want to prove to you that we can get these refineries working,” he said."
  },
  {
    "headline": "End Of An Era: Barcelona Announce Lionel Messi’s Departure",
    "summarized_story": "Argentine superstar Lionel Messi will not sign a new deal with Barcelona, ending his two-decade stay at the Nou Camp, the Spanish giants have said.\n“As a result of this situation, Messi shall not be staying on at FC Barcelona.\nMessi played 778 games for Barcelona and scored 672 goals.\nBut earlier in the day, reports emerged of a breakdown in talks between the club and the player’s representatives.\nThe 2008 Olympic gold medalist was expected to take a huge pay cut to stay at Barcelona under the new salary cap imposed by La Liga."
  },
  {
    "headline": "WHO Gifts Nigeria 26 Ventilators, Other Items To Fight COVID-19",
    "summarized_story": "﻿The fight against COVID-19 in Nigeria has received a boost, as the country received 26 ventilators and other equipment from the World Health Organisation.\nMinister of Health Dr Osagie Ehanire received the donated items on behalf of the Federal Government on Thursday in Abuja.\nNigeria recorded 747 COVID-19 infections in 13 states and the Federal Capital Territory (FCT) on Wednesday.\nThe country has received donations from some global bodies and countries in its fight against the pandemic – from vaccines to ventilators.\nDr Ehanire promised that the Federal Government would keep an inventory of the ventilators and assured Nigerians that the items donated will be properly utilised."
  },
  {
    "headline": "I Couldn’t Put Barcelona At Risk: Laporta Defends Messi’s Exit",
    "summarized_story": "Barcelona’s negotiations with Lionel Messi are over and the striker is considering other offers, the club’s president Joan Laporta said on Friday.\nLaporta said in a press conference he was not prepared “to put the club at risk” by renewing Messi’s contract, with Barca facing huge financial problems ahead of the start of La Liga.\n“We could not accommodate Messi’s contract,” said Laporta, who was re-elected as club president in March.\nLaporta said Barca could have registered Messi by agreeing to the deal but insisted it was a risk he was not prepared to take.\n“We were not prepared to put the club at risk in this way,” said Laporta."
  },
  {
    "headline": "Mo Abudu’s Ebonylife, Will Packer to produce thriller about con artist, Hushpuppi",
    "summarized_story": "Universal Pictures has set up an untitled project based on the Bloomberg story “The Fall of the Billionaire Gucci Master,” about Ramon Abbas, also known as Ray Hushpuppi.\nUniversal Pictures, Will Packer Productions and Mo Abudu’s EbonyLife have picked up the adaptation rights to the Bloomberg article “The Fall of the Billionaire Gucci Master,” about the Instagram influencer Ramon Abbas, also known as Ray Hushpuppi, @hushpuppi, Hush or the Billionaire Gucci master.\nThe Bloomberg story by Evan Ratliff detailed claims by authorities that Nigerian-born Abbas perfected a simple internet scam and laundered millions of dollars.\nAn untitled action thriller project, set up at Universal Pictures, follows a contested auction for the property.\nAdvertisementWill Packer and James Lopez will produce through their Will Packer Productions and Abudu will produce for EbonyLife Studios."
  },
  {
    "headline": "Just In: Governor Fayemi signs six bills into law",
    "summarized_story": "Ekiti State governor, Kayode Fayemi has signed six bills recently passed by the Ekiti State House of Assembly, into Law.\nAt a short ceremony at the governor’s office in Ado Ekiti, Mr Fayemi said the laws will help boost good governance in the state.\nThe bills are:Ekiti State Legislative Funds Management Bill 2021Ekiti State Judiciary Funds Management Bill 2021Ekiti State Creation of Local Government Area Amendment Bill 2021Ekiti State office of the Attorney-General Bill 2021Ekiti State Consumer Protection Bill 2021, andEkiti State Economic Development Council Bill 2021"
  },
  {
    "headline": "Mo Abudu’s Ebonylife, Universal Pictures to co-produce movie on Hushpuppi",
    "summarized_story": "Universal Pictures has set up an untitled project based on the Bloomberg story “The Fall of the Billionaire Gucci Master,” about Ramon Abbas, also known as Ray Hushpuppi.\nUniversal Pictures, Will Packer Productions and Mo Abudu’s EbonyLife have picked up the adaptation rights to the Bloomberg article “The Fall of the Billionaire Gucci Master,” about the Instagram influencer Ramon Abbas, also known as Ray Hushpuppi, @hushpuppi, Hush or the Billionaire Gucci master.\nThe Bloomberg story by Evan Ratliff detailed claims by authorities that Nigerian-born Abbas perfected a simple internet scam and laundered millions of dollars.\nAn untitled action thriller project, set up at Universal Pictures, follows a contested auction for the property.\nAdvertisementWill Packer and James Lopez will produce through their Will Packer Productions and Abudu will produce for EbonyLife Studios."
  },
  {
    "headline": "‘We Were Saints’: IBB Says Corruption in Nigeria Worse Now Than When He Was in Power – Arise News",
    "summarized_story": "Former Nigerian military president, Ibrahim Babaginda, says the depth of corruption under Nigeria’s democratic dispensation is such that his regime will be seen as one of saints.\nIn an exclusive interview on Friday, Babaginda told ARISE News that talk of corruption during his regime cannot be compared with “facts on ground now.”Watch the video for more…"
  },
  {
    "headline": "IBB: We Annulled June 12 Elections to Avoid Violent Coup",
    "summarized_story": "A former Nigerian military leader Ibrahim Babangida says there would have been a violent coup if the 1993 June 12 elections weren’t annulled.\nMr Babaginda stated this on Friday in an exclusive interview with ARISE News.\nHe said, “if it had materialised, there would have been a coup d’etat which could have been violent.”According to the former military dictator, the coup would have given room for more instability in the country, but noted that the overthrow did not happen due to the “Maradonic way we handled you guys in the society.”Watch the exclusive interview for more."
  },
  {
    "headline": "IBB: Tyranny of Nigerian Elites Hindering Implementation of 2014 National Conference",
    "summarized_story": "The tyranny of Nigerian elites has been hindering the implementation of resolutions reached at the 2014 national conference, former head of state, Ibrahim Babaginda has said.\nThe former Nigerian military leader said this during an exclusive interview with ARISE News and faulted the regular calls for national conferences but insisted on the implementation of the conventions already carried out.\nMr Babangida also in a veiled manner called for restructuring and the full autonomy of the local governments.\nWatch the interview for more."
  },
  {
    "headline": "Jailed Former SA President Jacob Zuma Admitted to Hospital Ahead of Corruption Trial",
    "summarized_story": "South Africa’s jailed former president Jacob Zuma has been admitted to a hospital for medical observation on Friday, the government’s Correctional Services department said.\nAs a former head of state Zuma is treated at a military facility, the authorities said.\nA routine observation at the prison prompted authorities to take him to an outside hospital for further examination, a Correctional Services statement said.\nIt added that as a former president, Zuma’s healthcare needs required the involvement of South African Military Health Services.\nZuma, 79, was jailed for defying a constitutional court order to give evidence at an inquiry investigating high-level corruption during his nine years in office until 2018."
  },
  {
    "headline": "Olympics Expels Two Belarus Coaches Over Athlete’s Removal",
    "summarized_story": "Belarus says Ms Timanovskaya was removed from the national team because of her emotional state.\nMs Timanovskaya said two coaches came into her room and told her to pack her bags immediately, ready to return home.\nAt the airport, Ms Timanovskaya showed officers a translated plea for help on her phone in an effort to avoid being put on a plane home.\nBut Ms Timanovskaya insists that she is “not a political girl” and just wants to focus on her sporting career.\nThe sprinter told the BBC she wanted to return to Belarus, but that it was too dangerous at the moment."
  }
]