[
  {
    "headline": "Benin Bronzes: FG to construct museum for repatriated artefacts, says NCMM DG",
    "summarized_story": "The Federal Government is to accelerate action on the construction of a royal palace museum where the Benin bronze artefacts that were repatriated from Germany would be kept.\nArtefacts worth £2.5 million have been handed over to the Oba of Benin, Oba Ewuare II, by President Muhammadu Buhari, 125 years after they were looted by British troops during the invasion of Benin Kingdom.\nThe returned artefacts, comprising of a cockerel (okpa) and an Oba head (Uhunwun Elao), were repatriated from Cambridge University, Jesus College, and University of Aberdeen, Scotland, respectively.\n“It is a great achievement for the country and the Benin Kingdom to regain the stolen artefacts after 125 years.\nPresident Buhari recounted that the artefacts now returned to the Oba of Benin were taken away by British soldiers in 1897 when they attacked the ancient Benin Kingdom and took thousands of artefacts away."
  },
  {
    "headline": "World leaders condemn Russian decision on Ukraine",
    "summarized_story": "Western powers reacted swiftly to Monday’s decision by Russian President Vladimir Putin to recognise the independence of the two self-proclaimed republics in eastern Ukraine, condemning Moscow and calling for sanctions.\nUnited States announces sanctionsUS Secretary of State Antony Blinken tweeted that Putin’s decision required “a swift and firm response, and we will take appropriate steps in coordination with partners”.\nThe United States announced financial sanctions against the rebel territories freshly recognized by Russia in eastern Ukraine and warned that more were ready if necessary.\nUK prepares ‘robust’ sanctionsUK Prime Minister Boris Johnson denounced Putin’s decision as “a flagrant violation of the sovereignty and integrity of Ukraine”.\n“With its decision, Russia is breaking all its promises to the world community,” she said."
  },
  {
    "headline": "Troops neutralise terrorists, recover weapons, bombs in Borno",
    "summarized_story": "The Nigerian Army has said troops have neutralised several members of the Islamic State West Africa Province and Boko Haram in Borno State.\nRecovered during the operation include a large cache of weapons, bombs, one Mowag APC, one TCV amongst others.\n“Similarly, troops 26 Task Force brigade conducted clearance operation and aggressive patrol to Fadagwe village and adjoining settlements in Borno State.\n“The terrorists withdrew in disarray due to troops’ superior firepower.\nSeveral operational vehicles of the terrorists were recovered,” the Nigerian Army said on Facebook."
  },
  {
    "headline": "Bad fuel: Northern groups withdraw call for sack of NNPC mgt",
    "summarized_story": "By Ibrahim Hassan-WuyoA group, the Concerned Northern Forum, has rescinded its earlier call for the sack of the management of the NNPC over the adulterated fuel that was imported into Nigeria.\nMallam Ibrahim Bature, Chairman Concerned Northern Forum and Abdulsalam Kazeem, spokesperson of the forum, in a statement in Kaduna, said “it has become inevitable to put the records straight that our position has no political affiliation or influence nor been sponsored by any individual or groups.\nOur call was borne out of patriotism over the hardship occasioned by the scarcity of premium motor spirit and the huge economic impact of the bad fuel at a time government is battling with dwindling revenue.\n“We commend the management of the NNPC Ltd for taking prompt action by alerting the nation on the bad fuel and for taking measured steps to recall the bad product and injecting over 700 million litres and the promise of additional 2.1billion litres to address the shortfall.”“We demand that regulatory and security agencies ensure that fuel stations sell at the maximum installed capacity and in the event any station is found to be sabotaging government’s effort, the product be dispensed free to motorists and such station sealed.\nWe withdraw our notice for the sack of the NNPC management and nationwide protest but remain committed to the sanctioning of the importing companies and their officials.”Vanguard News Nigeria"
  },
  {
    "headline": "BREAKING: Senate lays Constitution Review report Wednesday",
    "summarized_story": "As Senators Vote on Recommendations Tuesday Next WeekBy Henry Umoru, ABUJATHE Senate will lay the report of the Committee on the review of the 1999 Constitution Wednesday and begin to vote on the recommendations on Tuesday next week.\nAlso Read:Stop playing politics with Electoral Act, Presidency tells interest groupsOmo-Agege made the announcement while presiding over the plenary due to the absence of the President of the Senate, Senator Ahmad Lawan.\nOmo- Agege explained that Lawan would give further details on the matter on Wednesday.\nconstituted a 56 – member Constitution review committee to handle all bills seeking for one alteration or the other in the provisions of the 1999 Constitution.\nNames of the 56 member committee to be chaired by the Deputy President of the Senate, Senator Ovie Omo-Agege, All Progressives Congress, Delta Central, are the Senate Leader, Yahaya Abdullahi, Deputy Senate Leader, Professor Robert Ajayi Boroffice, Minority Leader, Enyinnaya Abaribe, former Deputy Minority Leader, Senator Emmanuel Bwacha, Minority Whip, Senator Philip Tanimu Aduda and the former Deputy Minority Whip, Senator Sahabi Alhaji Yau’."
  },
  {
    "headline": "2023: Group beckons on Emefiele to join presidential race",
    "summarized_story": "A group, The Mass Interest Project, has called on the governor of the Central Bank of Nigeria, CBN, Mr Godwin Emefiele, to throw his heart in the ring and contest the 2023 presidential election.\nIt cited the interventions Emefiele had made to get the economy going through fiscal and monetary policies that had helped to get Nigeria out of two recessions within the past five years.\nThey have been there from the beginning, from the First Republic, Second Republic, Third Republic, Fourth Republic and continued to rule the coast, even up to the present political dispensation.\nBehold we have found a man with a proven track record of loyalty, patriotism and understanding for sustainable development.\n”Godwin Ifeanyichukwu Emefiele, would you lead our people on this march for a better Nigeria?"
  },
  {
    "headline": "Okorocha’s arraignment stalled over non-service of court documents",
    "summarized_story": "The arraignment of a former Governor of Imo, Sen. Rochas Okorocha, was, on Tuesday, stalled at the Federal High Court Abuja.\nThe planned arraignment before Justice Inyang Ekwo could not proceed over the inability of the Economic and Financial Crimes Commission (EFCC) to serve Okorocha, who is the 1st defendant in the the17-count charge.\nWhen the matter was called, all the other defendants were present in court except the former governor.\nAlso Read:Alleged N2.9bn Fraud: Ex-Imo Gov, Okorocha, evading charge — EFCCHowever, counsel for the EFCC, Cosmas Ugwu, informed that the 1st defendant (Okorocha) was not in court because he had not been served with the charge.\n“My Lord, the matter would have been for the arraignment of the defendants but the 1st defendant is not in court."
  },
  {
    "headline": "Attack on Abia cattle market: Ikpeazu, Northern community leaders meet",
    "summarized_story": "Governor Ikpeazu who stated this at the Governor’s Lodge, Aba while receiving leaders of the Hausa Community in Aba together with Hausa Leaders from Gombe and Adamawa states, commiserated with them especially the families of those who died in the said incident.\nThe Governor also assured that every necessary step would be taken to avert future occurrences of such dastardly acts.\nSpeaking earlier, the Chairman Hausa Cattle Market – Alhaji Ibrahim Njidda who briefed the Governor on the incident, recalled the very cordial relationship Governor Ikpeazu shares with them in the state and regretted the ugly incident.\nPresent at the meeting were Commissioners for Trade and Investment, Homeland Security, Chief John Okiyi Kalu; and Hon.\nSopuruchi Bekee; Chief of Staff to the Governor, Professor Agbazuere; and the Deputy Chairman of Ukwa West LGA, Hon."
  },
  {
    "headline": "Senate fixes date to vote on report of 1999 constitution amendment",
    "summarized_story": "The Senate has fixed a date to vote on the report of its Committee on Constitution Review on amendments to the 1999 Constitution.\nIt fixed next week Tuesday to vote on the report of the committee.\nOmo-Agege, who presided over the session, disclosed that the report of the Constitution Review Committee would be laid tomorrow during plenary, and copies distributed to lawmakers on Wednesday, February 23, 2022.\nOmo-Agege said, “The Senate Committee on the Review of the 1999 Constitution will meet today, Tuesday, 22nd day of February 2022, immediately after plenary sitting at room 221 of the Senate building.\n“Tomorrow, the Senate President will announce that the report of the Constitution Review Committee will be laid on Wednesday tomorrow and, thereafter, we will take our vote on March 1st which will be Tuesday."
  },
  {
    "headline": "BREAKING: Court extends detention order on detained DCP, Abba Kyari",
    "summarized_story": "A Federal High Court in Abuja on Tuesday extended the detention of a Deputy Commissioner of Police, Abba Kyari, by 14 days.\nThe court granted permission to the National Drug Law Enforcement Agency (NDLEA) to hold the embattled Kyari for the period to enable the agency to complete its investigation into the hard drug trafficking allegations against him.\nJustice Zainab Abubakar issued the order for Kyari’s further detention while ruling in an ex-parte application argued by the NDLEA counsel, Mr Mike Kassa.\nThe counsel asked the court to grant the detention extension in the interest of justice and to be fair to the suspect too through diligent investigation.\nIn a short ruling, Justice Abubakar ordered that Abba Kyari be detained for another 14 days."
  },
  {
    "headline": "Insecurity: Bishop Oyedepo rains curses on Fulani herdsmen, kidnappers, sponsors",
    "summarized_story": "Bishop David Oyedepo, founder of Living Faith Church Worldwide, has again cursed criminal elements causing havoc across the country.\nDuring a sermon, Oyedepo cursed kidnappers and their sponsors, declaring that his church members (winners) are untouchable by the assailants.\nHe said, “Kidnappers, hear this again, anyone that touches anybody called a winner loses his life to hell.\n“Fulani herdsmen hear me, I know you also hear English.\nA few days ago, three relatives of Governor Samuel Ortom of Benue State were gunned down by armed men suspected to be Fulani herdsmen."
  },
  {
    "headline": "BREAKING: Court sentences former minister, ex-PDP deputy chairman, evangelist to jail",
    "summarized_story": "A Federal High Court sitting in Jos, the Plateau State capital, has sentenced a former Minister of Water Resources, Mrs Sarah Ochekpe, to three months imprisonment.\nThe court also sentenced a former Deputy Chairman of the Peoples Democratic Party (PDP) in the state, Raymond Dabo, and Evangelist Leo Sunday Jitung to three months imprisonment.\nThe judgment was delivered by Justice Musa Kurna on Tuesday.\nDAILYPOST recalls that the three had been standing trial for the past four years on charges bordering on conspiracy and money laundering.\nHowever, the sentence has an option of a fine of N1 million."
  },
  {
    "headline": "IMF warns FG over proposed N2.55trn fuel subsidy spending",
    "summarized_story": "It noted that the fuel subsidy negatively affects the country’s fiscal position, thereby increasing the country’s fiscal deficit.\nIt said it is mainly reflecting the reemergence of implicit fuel subsidies and higher spending in the supplementary budget for security and vaccine costs.\nWith limited IFI funding, the report stated that fiscal financing for large implicit subsidy costs is likely to depend heavily on domestic sources, including overdrafts from the CBN.\nIt stated that the recent re-emergence of implicit fuel subsidies has levied a considerable burden on Nigeria’s fiscal position, that could have been spent more effectively on pro-poor interventions.\nIt observed that central bank financing and fuel subsidy regime tend to adversely affect investments in human and physical capital."
  },
  {
    "headline": "BREAKING: Senate votes on Constitution Review next Tuesday",
    "summarized_story": "The Senate will next Tuesday vote on amendments to the 1999 Constitution, it was learnt on Tuesday.\nThe amendments are contained in the report of the National Assembly Joint Committee on Constitution Review.\nChairman, Senate Ad hoc Committee on Review of the 1999 Constitution, and Deputy Senate President Ovie Omo-Agege, disclosed this in Abuja.\nHe also invited members of the committee to a meeting scheduled to hold by 2 pm on Tuesday.\n- Advertisement -Omo-Agege, who presided over the plenary, disclosed that the report of the Constitution Review Committee would be laid tomorrow (Wednesday) during plenary and copies distributed to lawmakers."
  },
  {
    "headline": "IPOB worried over Nnamdi Kanu’s health status",
    "summarized_story": "The Indigenous People of Biafra (IPOB) has raised the alarm over alleged refusal by the Department of State Services (DSS) to allow family members and lawyers to its leader, Mazi Nnamdi Kanu during routine visitation in its custody.\nIn a statement by its Media and Publicity, Emma Powerful, IPOB expressed fear over Kanu’s state of health, urging DSS to explain the reason behind shielding him from his family and lawyers.\nToday again, Monday 21st of February, 2022, Nigeria DSS denied them access to our leader, Mazi Nnamdi KANU.\nHave they eliminated Mazi Nnamdi KANU?\n“DSS must know that if anything happens to our leader Mazi Nnamdi KANU, the consequences will be catastrophic."
  },
  {
    "headline": "BREAKING: Court sentences former Minister Sarah Ochekpe, 2 others",
    "summarized_story": "The Federal High Court Jos Division has sentenced a former Minister of Water Resources, Sarah Ochekpe as well as Raymond Dabo and Evangelist Leo Sunday Jitung to three-month imprisonment each.\nThe trio had been standing trial for four years on charges bordering on conspiracy and money laundering.\nThe sentence however has an option of a fine of N1m.\nDetails Shortly…"
  },
  {
    "headline": "Buhari will sign Electoral Bill soon- Presidency",
    "summarized_story": "President Muhammadu Buhari could sign the reworked Electoral Bill any moment from now, the Presidency has said.\nIt however said the President wouldn’t be stampeded by interest groups into signing the piece of legislation into law.\nSpecial Adviser to President Buhari on Media and Publicity, Femi Adesina, argued that Buhari’s assent was still within the 30 days as stipulated by the Constitution.\n“He (Buhari) will sign it (the bill) any moment from now.\nHours could be 24 hours, it could be 48 hours; not days, not weeks.”The presidential spokesman in a statement on Monday cautioned against cheap politics over the perceived delay by the President in assenting to the Electoral Bill."
  },
  {
    "headline": "BREAKING: Court grants NDLEA’s request to detain Abba Kyari’s alleged accomplices for 14 days",
    "summarized_story": "A Federal High Court in Abuja has granted the request by the National Drug Law Enforcement Agency (NDLEA) for permission to further detain for 14 days the two alleged drug couriers named in the case involving suspended DCP Abba Kyari.\nJustice Zainab Abubakar gave the order for the detention of Chibunna Patrick Umeibe and Emeka Alphonsus for 14 days in the NDLEA facility in Abuja pending investigation.\nJustice Abubakar gave the order after listening to the Director, Prosecution and Legal Services (NDLEA), Joseph.\nRead Also: Alleged drug trafficking: Court declines Abba Kyari’s bail application- Advertisement -“The suspects were arrested upon their arrival from Addis Ababa aboard an Ethiopian Airlines flight ET917.\nAdejobi said the case and the two suspects were subsequently transferred to the NDLEA on Jan. 25."
  },
  {
    "headline": "BREAKING: Senate Constitution Panel Submits Report Wednesday, Says Omo-Agege",
    "summarized_story": "Sunday Aborisade in AbujaThe Senate Committee on the review of the 1999 constitution will submit its report on Wednesday.\nThe Chairman of the committee, Senator Ovie Omo-Agege, stated this on Tuesday.\nOmo-Agege, who is also the Deputy President of the Senate, made the announcement while presiding over plenary due to the absence of Senate President, Ahmad Lawan.\nHe, however, said Lawan would give further details on the matter on Wednesday.\nHe added that the lawmakers would take the reports home on Wednesday and return on Tuesday, March 1, to vote on the amendments."
  },
  {
    "headline": "Return Nigeria’s Artefacts in Your Possession, Buhari Pleads with Nations, Institutions",
    "summarized_story": "•Says 1,130 Benin bronzes due back from Germany this yearDeji Elumoye in AbujaPresident Muhammadu Buhari has appealed to countries, institutions, and bodies, both private and public, to return Nigeria’s artefacts in their possession.\nBuhari also disclosed that 1,130 Benin bronzes would be returned to Nigeria by the German government before the end of this year.\nThe artefacts were repatriated from the University of Cambridge and University of Aberdeen, respectively, in the United Kingdom, after 125 years of their leaving the territory of present day Nigeria.\nAccording to the president, “These artefacts are part of the records of the history of the Benin people.\nBuhari also appreciated the Federal Republic of Germany, which was planning the process of repatriating 1,130 Benin bronzes to Nigeria this year from many of Germany’s public museums."
  },
  {
    "headline": "Again, APC Moves Convention, Now to Hold March 26",
    "summarized_story": "The latest notice also replaced an earlier letter to INEC informing it of APC’s decision to hold its zonal congresses on March 26.\nAPC had in an earlier letter, with reference number APC/NHDQ/INEC/019/22/14, notified INEC of its decision to hold its national convention on February 26.\nAkpanudoedehe, who spoke at the end of a four-hour meeting of the caretaker committee, said, “We have agreed and approved that activities for the party’s national convention will commence from February 24 and terminate on March 26 at Eagle Square with the national convention.\nThe adoption of the screening report is slated for March 8, while zonal congresses would be held on Saturday, March 12, and the zonal congresses appeal would take place on March 14.\nHe stated, “It is clear that Mai Mala Buni is opposed to organising the APC national convention on February 26, 2022 or any time soon."
  },
  {
    "headline": "UK Injects £10m into Nigeria’s Energy Sector",
    "summarized_story": "•Returns £210,000 illegal paymentMichael OlugbodeThe United Kingdom has injected £10 million into Nigeria’s low carbon energy project.\nIt sets out the terms and understanding between the governments of the United Kingdom and Nigeria to make the compensation payment.\nThe financing would also help Nigerian investors focus on low carbon energy, and support off-grid, low-carbon energy projects.\nUK Minister for Africa, Vicky Ford, speaking on the investment, said, “The UK is committed to increasing both renewable energy and energy access in Nigeria, driving clean, sustainable and resilient growth.\nOnyeama received, in audience, the United Kingdom Minister for Africa, Latin America and the Caribbean."
  },
  {
    "headline": "Breaking: APC Holds National Convention March 26",
    "summarized_story": "By Adedayo AkinwaleThe All Progressives Congress (APC) has resolved to hold its national convention on March 26, 2022.\nInitially, the ruling party scheduled its convention to hold on February 26 before it was postponed.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "How Top Officials In Attorney-General, Malami's Ministry Of Justice Embezzled N104million, Moved Cash In Bag",
    "summarized_story": "Afterwards, the junior officer, Danjuma reportedly withdrew the money from his bank account and handed it over to Kadmi in a bag.\nCriminal Justice”.\nAnother N4,500,000 payment was received the same day as payment of ”DTA Air ticket for 15 Officers for retreat on cause and delay/backlog of criminal justice administration schedule for 13th – 18th December 2021.\nN4.3 million was paid into Danjuma's account as payment for the assessment collation and review across the states justice sector institutions in Nigeria.\nOn November 17, Danjuma received N4,400,000 payment for “national and review across the state justice sector institution in Nigeria."
  },
  {
    "headline": "How Top Officials In Attorney-General, Malami's Ministry Of Justice Embezzled N104million, Moved Cash In Bag",
    "summarized_story": "Afterwards, the junior officer, Danjuma reportedly withdrew the money from his bank account and handed it over to Kadmi in a bag.\nCriminal Justice”.\nAnother N4,500,000 payment was received the same day as payment of ”DTA Air ticket for 15 Officers for retreat on cause and delay/backlog of criminal justice administration schedule for 13th – 18th December 2021.\nN4.3 million was paid into Danjuma's account as payment for the assessment collation and review across the states justice sector institutions in Nigeria.\nOn November 17, Danjuma received N4,400,000 payment for “national and review across the state justice sector institution in Nigeria."
  },
  {
    "headline": "BREAKING: Buhari To Sign Amended Electoral Bill In Matter Of Hours – Presidency",
    "summarized_story": "President Muhammadu Buhari will in a matter of hours sign the re-worked Electoral Act Amendment Bill.\n“He (Buhari) will sign it (the bill) any moment from now,” he said while appearing as a guest on a programme.\n“It could be signed today; it could be signed tomorrow.\nHours could be 24 hours; it could be 48 hours; not days, not weeks.”There has been condemnation from several quarters over the Buhari presidency’s reluctance to sign the bill.\nAccording to the statement, the protests are necessary considering the abuse the electoral space had suffered under President Muhammadu Buhari administration."
  },
  {
    "headline": "BREAKING: Buhari To Sign Amended Electoral Bill In Matter Of Hours – Presidency",
    "summarized_story": "President Muhammadu Buhari will in a matter of hours sign the re-worked Electoral Act Amendment Bill.\n“He (Buhari) will sign it (the bill) any moment from now,” he said while appearing as a guest on a programme.\n“It could be signed today; it could be signed tomorrow.\nHours could be 24 hours; it could be 48 hours; not days, not weeks.”There has been condemnation from several quarters over the Buhari presidency’s reluctance to sign the bill.\nAccording to the statement, the protests are necessary considering the abuse the electoral space had suffered under President Muhammadu Buhari administration."
  },
  {
    "headline": "BREAKING: Buhari To Sign Amended Electoral Bill In Matter Of Hours – Presidency",
    "summarized_story": "President Muhammadu Buhari will in a matter of hours sign the re-worked Electoral Act Amendment Bill.\n“He (Buhari) will sign it (the bill) any moment from now,” he said while appearing as a guest on a programme.\n“It could be signed today; it could be signed tomorrow.\nHours could be 24 hours; it could be 48 hours; not days, not weeks.”There has been condemnation from several quarters over the Buhari presidency’s reluctance to sign the bill.\nAccording to the statement, the protests are necessary considering the abuse the electoral space had suffered under President Muhammadu Buhari administration."
  },
  {
    "headline": "Okorocha's absence stalls arraignment in ‘N5.7bn fraud’ case",
    "summarized_story": "A federal high court in Abuja has fixed March 28 for the arraignment of Rochas Okorocha, senator representing Imo west, over allegations of fraud.\nThe Economic and Financial Crimes Commission (EFCC) on January 31, filed a 17-count charge against the former Imo governor before a federal high court in Abuja.\nAccording to the EFCC, the former Imo governor allegedly conspired with others, including a member of the All Progressives Congress (APC) and five companies, to steal N2.9 billion public funds.\nWhen the case was called on Tuesday, the former governor was not in court and he did not have any legal representation.\nCosmos Ugwu, EFCC counsel, told the court that he has been unable to serve court processes on Okorocha."
  },
  {
    "headline": "Okorocha's absence stalls arraignment in ‘N5.7bn fraud’ case",
    "summarized_story": "A federal high court in Abuja has fixed March 28 for the arraignment of Rochas Okorocha, senator representing Imo west, over allegations of fraud.\nThe Economic and Financial Crimes Commission (EFCC) on January 31, filed a 17-count charge against the former Imo governor before a federal high court in Abuja.\nAccording to the EFCC, the former Imo governor allegedly conspired with others, including a member of the All Progressives Congress (APC) and five companies, to steal N2.9 billion public funds.\nWhen the case was called on Tuesday, the former governor was not in court and he did not have any legal representation.\nCosmos Ugwu, EFCC counsel, told the court that he has been unable to serve court processes on Okorocha."
  },
  {
    "headline": "Oil prices near $100 a barrel amid Russia-Ukraine crisis",
    "summarized_story": "Global oil prices trade near $100 per barrel on supply disruption worries as tensions between Russia and Ukraine escalated.\nThe latest price is above the oil benchmark of $62/barrel in Nigeria’s 2022 budget.\nBrent crude futures rose 3.82%, to $99.03 a barrel at 09:10 GMT+1 on Tuesday, the highest since August 1, 2014.\nAdvertisementThe decrees recognised them as independent states and guaranteed their security with Russian troops.\nThe rise in global crude oil prices should portend an upturn for Nigeria’s revenue — but payments for price shortfall may take up N2.6 trillion this year."
  },
  {
    "headline": "Oil prices near $100 a barrel amid Russia-Ukraine crisis",
    "summarized_story": "Global oil prices trade near $100 per barrel on supply disruption worries as tensions between Russia and Ukraine escalated.\nThe latest price is above the oil benchmark of $62/barrel in Nigeria’s 2022 budget.\nBrent crude futures rose 3.82%, to $99.03 a barrel at 09:10 GMT+1 on Tuesday, the highest since August 1, 2014.\nAdvertisementThe decrees recognised them as independent states and guaranteed their security with Russian troops.\nThe rise in global crude oil prices should portend an upturn for Nigeria’s revenue — but payments for price shortfall may take up N2.6 trillion this year."
  },
  {
    "headline": "Court rules: Unmarried female police officers shouldn't get pregnant",
    "summarized_story": "A federal high court in Abuja has dismissed a suit by the Nigerian Bar Association (NBA) seeking to invalidate some provisions in the Nigeria Police Force Regulations (NPFR) which forbid unmarried female police officers from getting pregnant.\nThe Nigerian Bar Association had approached the court to challenge the legality of regulation 127 of the NPFR, arguing that the said provision contradicts the 1999 constitution and is discriminatory to unmarried female police officers.\nAdvertisement“The male police officers and married female police officers in the Nigeria Police Force are not subjected to similar discrimination, sanction, opprobrium and indignity,” the association said.\nAdvertisementHe said the suit lacked merit, holding that such unmarried female police officers were aware of the regulation before they joined the force.\nAn unmarried woman who intends to get pregnant is not compelled to join the police."
  },
  {
    "headline": "AfricaWorks’ ambition transcends being a coworking space",
    "summarized_story": "After a minute in the lobby, Gregoire Schwebig, founder and CEO of AfricaWorks came out to meet me.\nAs we exchanged pleasantries, one question lingered; why is this French man building a home-grown business in Africa?\nMore than just a coworking spaceFor AfricaWorks, as the African tech and business ecosystem grows, it will continue to grow to support them across the continent.\nBeyond being a pan-African coworking space, it now wants to do more as it slowly transitions into a tech company.\nAfricaWorks in NairobiAmong other places, the company is also planning to open new space at the Kotoka international airport in Accra, Ghana."
  },
  {
    "headline": "A virtual art gallery in DRC connects local artists with global clients",
    "summarized_story": "Welcome to the engine room of Bandombe Galerie, a virtual art gallery that is the brainchild of Sisqo Ndombe.\nBandombe showcases and connects contemporary African artists with potential clients, globally.\n“It has given access to many African artists and their works to a wider audience and market,” he said.\nOne of those who bought up into Ndombe’s virtual gallery initiative is Rwanda-based painter, Izere Antoine.\nNigerian artist Onofua Dennis, who has also signed on with Bandombe talks glowingly of the virtual gallery."
  },
  {
    "headline": "Flutterwave launches SME lending, fintech-as-a-service in vision 3.0",
    "summarized_story": "Led by founder and CEO Olugbenga Agboola, the company facilitates cross-border payments transactions of small-to-large businesses in Africa via one API.\nGet the best African tech newsletters in your inboxFlutterwave Capital, the new SME loans product, is offered in partnership with the company’s lending partners—CashConnect Microfinance Bank, MoneyWise Microfinance Bank, Wema Bank, Zenith Bank, Stanbic IBTC Bank, and Sterling Bank.\n“With Flutterwave Capital, we’re making it easier for business owners to access the funds they require to grow their businesses.\nFlutterwave also helps businesses outside Africa expand their operations on the continent with an international clientele that includes Booking.com, Flywire, and Uber.\nThe latest financing thus brings its total investments secured since launched in 2016 to $475 million (plus a $35 million Series B in 2020 and a $20 million Series A in 2018)."
  },
  {
    "headline": "Crypto crime grows to $14 billion as crypto popularity increases",
    "summarized_story": "In 2021, crypto criminals made a killing, as illicit crypto transactions hit $14 billion, a 79% jump from the $7.8 billion recorded in 2020, according to a report by US-based blockchain analytics company, Chainalysis.\nThe growth in illicit crypto transactions is attributed to a 567% jump in overall transaction volume in 2021.\nGiven that overall crypto transactions grew to $15.8 trillion in 2021, it is not surprising that cybercriminals are increasingly using crypto.\nDespite the increase in the total volume of illicit transactions, illicit transactions represented just 0.15% of the total cryptocurrency transaction volume in 2021—its lowest ever.\nWhat this means is that legitimate crypto transactions far outstrip illegal transactions."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "Techpoint Pitch Friday is back!",
    "summarized_story": "Share this article:After a long hiatus, Techpoint Pitch Friday is back.\nPitch Friday takes place on the second Friday of every month and provides an avenue for aspiring and existing entrepreneurs to share their businesses or ideas with an audience.\nSome of them include Kelvin Umechukwu of Bumpa, Abolarinwa Adegunloye of Arteasy, winner of the Most Outstanding Marketplace award at Techpoint Awards 2021, and Femi Aiki of Foodlocker, a Techpoint Pitchstorm alumnus.\nFor example, say you’re looking to raise from investors, you could get feedback that could help you refine your pitch.\nAll you have to do is register to pitch your startup here or as a part of the audience here, then save the date in your calendar."
  },
  {
    "headline": "Women-focused credit facility and Africa’s developer ecosystem",
    "summarized_story": "AdvertisementBefore then, these are what I’m discussing today:Credit facility for African women entrepreneurs716,000 African developers and countingWhat’s up with the new features on your favourite apps?\nYesterday, it announced backing Nigeria’s first commercial bank, First Bank of Nigeria Ltd, with a $100 million credit facility to support women entrepreneurs and SMEs in the country.\nOf this amount, a minimum of $30 million will go into credit lines for women-owned and led businesses.\nThe credit facility will be disbursed through the bank’s over 700 branches and 150,000 agents across the country.\nThe findings show an all-time increase in demand for African developers globally and over 2.5x growth in VC funding, all of which happened despite the challenge that came with the pandemic."
  },
  {
    "headline": "Flutterwave 3.0, Google’s Android Privacy Sandbox, Africa-produced mRNA vaccines",
    "summarized_story": "Meanwhile, on Friday, February 18, 2022, the World Health Organization (WHO) announced the first six countries to receive the technology needed to produce mRNA vaccines in Africa.\nAfrica-produced mRNA vaccinesWe’ve all probably heard a lot more about vaccines in the last couple of years than we thought we would in our lifetime.\nCurrently, two of the world’s most effective COVID-19 vaccines are messenger RNA (mRNA) vaccines.\nmRNA vaccines use mRNA created in a laboratory to teach our cells how to make a protein — or even just a piece of a protein — that triggers an immune response inside our bodies.\nOn Friday, February 18, 2022, the World Health Organization (WHO) announced the first six countries to receive the technology needed to produce mRNA vaccines in Africa."
  },
  {
    "headline": "Oil surges near $100 but Nigeria is not at the party",
    "summarized_story": "Oil surges near $100 but Nigeria is not at the partyOil and gas prices are climbing on fears that the Ukraine-Russia crisis will disrupt supplies across the world but Nigeria and its economy remain unimpacted, thanks to years of poor spending.\nIn London, the FTSE 100 share index opened more than 1.4% lower before regaining some ground.\nThe UK and several western allies have threatened sanctions on Russia, which is the second-largest oil exporter after Saudi Arabia.\nThe Ukraine-Russia crisis could have “substantial implications” on oil prices, which have jumped more than 10% since the start of the month, said Sue Trinh of Manulife Investment Management.\nSanctions forcing Russia to supply less crude or natural gas would have an “important impact on the global economy”, she added."
  },
  {
    "headline": "Vaccine production seen helping Nigeria beyond COVID",
    "summarized_story": "Nigeria’s bid to establish its own COVID-19 vaccine production plant could serve as a catalyst to research and produce vaccines for other endemic diseases beyond the current needs of the pandemic, analysts have said.\nNigeria finally got a foot in the door in its long journey to local production for the first time since talks about getting Africa to its vaccine needs began.\nBut the demand for COVID-19 vaccine in the country might have thinned out or become inconsequential by the time the vaccine plant comes on stream or gets ripe enough to adopt this technology.\n“It is a step forward in the efforts to produce vaccines locally, based on current mRNA technology.\nThe disappointment in failing to invest in a responsive structure for vaccine production grew worse as the pandemic went on with Nigeria queuing behind the priorities of foreign producers for vaccines."
  },
  {
    "headline": "Overnight rate shoots up on FX, bond auction, CRR debit",
    "summarized_story": "Overnight interbank rate, the interest rate that banks charge each other for overnight lending, increased to 14 percent on Friday from 0.5 percent the previous day, due to effect of foreign exchange (FX), bond auction and Cash Reserve Ratio (CRR) debit, which affected the level of liquidity in the financial market.\nThe financial market saw N305 billion withdrawn from the system, for the settlement of Wednesday’s bond auction.\nThe Nigerian treasury bills (NT-Bills) secondary market closed on a flat note with average yield across the curve remaining unchanged at 4.19 percent.\nAverage yield across the long-term maturities declined by 4bps.\nHowever, the average yield across the short-term maturities remained unchanged at 5.41 percent."
  },
  {
    "headline": "NBM of Africa, Benin Zone Felicitates With Oba of Benin On The Return Of Two Bronze Artifacts. – Nigerian Observer",
    "summarized_story": "NBM of Africa, Benin Zone Felicitates With Oba of Benin On The Return Of Two Bronze Artifacts.\nShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Leadership and members of NBM of Africa Worldwide, Benin Zone, have congratulated the Benin Monarch, His Royal Majesty, Omo N’Oba N’Edo, Uku Akpolokpolo, Ewuare II, on the return of two looted Benin artifacts; bronze Cockerel (Okpa) and Uhunwun-alao (Head of Oba) by the Jesuit College of the University of Cambridge and University of Aberdeen, Scotland to the Oba of Benin.\nThe Benin Zone, NBM of Africa, in a statement issued by its Public Relations Officer (PRO), Comrade Idahosa Moses, on behalf of the President, Benin Zone, said that members of the movement heartily commended President Buhari and Oba Ewuare II for ensuring that the artifacts were returned safely to the Oba palace, where they were looted.\n“May God bless and keep safe His Royal Majesty and grant him good health, happiness, more wisdom and long life, Oba Gha Tokpere, Isee!!!”.\nThe Zonal PRO averred that the Benin artifacts transcend beyond mere artworks, as they are symbols of traditional heritage of the Great Benin Kingdom which must not be allowed to be domiciled outside the palace of the Oba."
  },
  {
    "headline": "Anti open grazing bill scales second reading in Edo assembly – Nigerian Observer",
    "summarized_story": "Hon.Okhuarobo said the bill also seeks to introduce modern methods of ranching.\nHon.Okiye noted that the bill, if passed would eliminate the dangers associated with open grazing.\nOther lawmakers unanimously supported the passage of the bill with a call on the security agencies in the state to step up their game especially in rural communities.\nWith no dissenting voice, the speaker thereafter subjected the bill to a voice vote and was unanimously supported by the lawmakers.\nThe speaker, directed the clerk, Yahaya Omogbai to forward copies of the bill to the house committee on food security."
  },
  {
    "headline": "Edo to upgrade Edo College of Agric into a degree-awarding institution with tripartite campus – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…Ambrose Alli varsity to run multi-campus systemBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has disclosed plans to upgrade the Edo College of Agriculture, Iguoriakhi, into a degree-awarding institution with two additional campuses in Agenebode and Uromi.\nAccording to Obaseki, “We are upgrading the Edo State College of Agriculture, Iguoriakhi, into a degree-awarding institution with two other campuses in Agenebode and Uromi.\n“As a government, our priority is to upgrade our College of Agriculture into three campuses and that the college would be degree-awarding.\nAccording to Obaseki, “We are also converting the Ambrose Alli University, Ekpoma, to a multi-campus institution.\nThe Oredo campus will focus on technology and engineering, while the sister campus in Owan would be for agriculture and natural resources.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Int’l Mother Language Day: Obaseki tasks youths on innovations to preserve indigenous languages – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has urged more young people to join the global effort in preserving endangered indigenous languages by coming up with innovative ideas and developing new technologies to address the global concern.\nAccording to him, “This year’s International Mother Language Day is yet another opportunity to draw attention to the need to strengthen efforts at preserving and protecting our local languages from extinction, considering its huge implications on maintaining cultural diversity.\nIn a message, UNESCO Director-General, Audrey Azoulay said, “Technology can provide new tools for protecting linguistic diversity.\nSuch tools, for example, facilitating their spread and analysis, allow us to record and preserve languages that sometimes exist only in oral form.\nPut simply, they make local dialects a shared heritage."
  },
  {
    "headline": "Osun APC Primary: Igbimo Agba Congratulates Oyetola, Hails Party Members",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe Igbimo Agba Caucus of All Progressives Congress (APC) in Osun State has congratulated the governor of the state, Mr. Adegboyega Oyetola on his emergence as the flagbearer of the party in the primary election held last Saturday.\nThe chairman of the caucus, Engr.\nSola-Akinwumi, in a congratulatory message issued yesterday, described the emergence of Governor Oyetola as victory for sustainability of democracy in Osun.\nThe statement read, “I, Engr.\n“Finally, the efforts of the citizens coupled with the residents of the State of Osun regarding their continued prayers, love and suport for our amiable and God chosen Governor, Alhaji Isiaka Adegbiyega Oyetola is hereby highly commended and appreciated”“Congratulations, Congratulations and Congratulations”"
  },
  {
    "headline": "COVID-19: U.S Govt collaborates with Imo State to scale up vaccination",
    "summarized_story": "The United States has reiterated its commitment to support Nigeria and other countries around the world in addressing the ongoing COVID-19 pandemic.\nThe campaign will increase COVID-19 vaccine access and uptake amongst the people of Imo State.\n“We need your support to champion the vaccination of the people of Imo and protect them from COVID-19.\nThe flag-off mass vaccination campaign event serves to accelerate and expand COVID-19 vaccination access and uptake.\nThrough PEPFAR, US CDC supports over 83% of the estimated people living with HIV in Imo state with comprehensive treatment services."
  },
  {
    "headline": "OneBank rewards Nigerian workers with enhanced financial services",
    "summarized_story": "Over the years, Nigerian professionals have made giant strides across various industries like medicine, engineering and law, to mention but a few.”He said the One Professional initiative by OneBank is Sterling’s way of amplifying the stories of Nigerian workers while thanking them.\nHe explained that the initiative will give ample opportunity to Nigerian workers to share stories of how they found themselves in their chosen fields.\nThe Group Head said Nigerian professionals will be provided with the opportunity to share inspirational stories of how they ventured into their various fields of endeavors every month throughout the year.\nAccording to him, Nigerian workers stand a chance to win cash prizes from OneBank when they go ahead to download the OneBank app on Google and Play store and open an account.\nOneBank is a leading digital bank product which empowers individuals and businesses to get world-class financial services and tools without barriers."
  },
  {
    "headline": "CMSA Leverages NGX Closing Gong Ceremony to Commemorate Its 20th Anniversary",
    "summarized_story": "Nigerian Exchange Limited (NGX), hosted the leadership of Capital Market Solicitors Association to a Closing Gong Ceremony on Friday, 18 February 2022 as part of The Association’s activities to commemorate 20 years of impact in the Nigerian capital market.\nShe said, “We recognize the achievements of The Association in providing services for solicitors and commercial law firms through a number of initiatives including the development of a Continuing Legal Education (“CLE”) Programme for capital market solicitors geared towards developing adequate legal capacity to meet the demands of an evolving capital market.\nThe Exchange is pleased to have joined forces with The Association to achieve greater public benefit by raising professionalism across financial services through a wide range of market leading activities.\nWe are very pleased to be a part of this exciting moment in the story of CMSA and assure The Association’s leadership of NGX’s continued support as a strategic business partner.”On his part, Chairman, Board of Trustees, CMSA, Senator Oladipo Olusoga Odujinrin MFR thanked NGX and the entire capital market stakeholder community for supporting CMSA since The Association was established in 2001.\nCMSA was established with the aim of addressing the marginalization of solicitors in capital market operations vis-à-vis other professionals, such as accountants, dealers and brokers"
  },
  {
    "headline": "N’Delta: Young Professionals Laud Emefiele For Supporting Youth Entrepreneurship",
    "summarized_story": "The Nigerian Young Professionals Forum (NYPF), has lauded the enviable strides of the Governor of the Central Bank of Nigeria (CBN), Godwin Emefiele, towards supporting the development of human capacity, especially among young people in the Niger Delta region.\nSimbi Wabote, as well as the Heritage Bank led Ifie Sekibo, both of whom are from the Niger Delta.\nHigh point of the event was the sharing of heart-touching stories by some successful business owners in the Niger Delta.\nThe 2022 Niger Delta MSME Summit which is the 48th event to be organised by the NYPF, was jointly organised by the Niger Delta Young Professionals (NYDP).\nThe third edition of the Niger Delta MSME Summit is slated for Akwa Ibom State in 2023."
  },
  {
    "headline": "World Cup Play Off: CAF Shifts Nigeria Vs Ghana Fixtures Forward",
    "summarized_story": "The Confederation of African Football (CAF) has announced new dates for next month’s double-legs FIFA 2022 World Cup play-off between the Nigeria’s Super Eagles and Black Stars of Ghana.\nThe continental body on Monday informed the Nigeria Football Federation (NFF) that the Super Eagles will now take on perennial west African arch rival Ghana’s Black Stars on March 25 and 29, 2022 respectively.\nThe first leg of the double-header clash at the Cape Coast Stadium, earlier scheduled to be played on Thursday, March 24, will now take place on Friday, March 25, starting from 7:30 pm Ghana time, which will be 8:30 pm in Nigeria.\nThe return leg clash will hold at the Moshood Abiola National Stadium in Abuja on Tuesday, March 29 as against the earlier date of Sunday, March 27, 2022.\nThe winners over the two legs will advance to the 2022 FIFA World Cup slated for Qatar."
  },
  {
    "headline": "RSDF Boss Urges Investment In Grassroots Sports",
    "summarized_story": "Founder and president of Ratel Sports Development Foundation (RSDF) and women football financier, Barrister Paul Edeh, has urged support for sports grassroots development to give Nigeria a facelift.\nHe called on both the private and public sector to invest in sports facilities at the grassroots saying it remained the catalyst that would propel young athletes to stardom.\nBarrister Edeh who at the British Nigeria Academy (BNA) inter-house sports competition held in Abuja, said attributed Nigeria’s dwindling fortune in sports to jettison of inter-house sports competition.\nEdeh who owns one of the high-rising female clubs, Naija Ratels, in the top flight Nigeria Women Football League said.\nFor me, I’m very delighted that we in Ratel Sport Development Funds (RSDF) are part and parcel of what is happening today."
  },
  {
    "headline": "Ethnic Youth Leaders Condemn Attack On CBN Gov Emefiele",
    "summarized_story": "The Nigerian Ethnic Youth Leaders Council (NEYLC), on Monday, condemned a newspaper report (not LEADERSHIP) for what it described as an unprovoked attack on the Governor of Central Bank of Nigeria (CBN), Dr. Godwin Emefiele.\nThe NEYLC, which is made up of the Arewa Consultative Youth Movement (ACYM), Ohanaeze Ndigbo Youth Movement, Oduduwa Youths and Middle Belt Youth, made its position known in a statement signed by the Ohanaeze Secretary-General and head of Coalition’s secretariat, Nwada Ike Chiamaka.\nThe ethnic youth leaders said it was surprising that the newspaper could descend so low to the point of criticising Emefiele for an ambition that he was yet to declare.\n“We therefore call on the management of the newspaper to apologise to Emefiele and those who have been appealing to him to contest.\nThe newspaper should also retrace its steps and restrict itself to the traditional role of informing the people and not playing to the gallery.”ADVERTISEMENT"
  },
  {
    "headline": "APC’s Inability To Conduct Convention Shows State Of Nigeria Under Its Watch – PDP",
    "summarized_story": "The Peoples Democratic Party (PDP) has said that the inability of the ruling All Progressives Congress (APC) to conduct a routine national convention as planned further explained why all sectors of national life in Nigeria have been in shambolic state under the APC administration.\n“The APC is a perfect example of failure both as a party and government unable to conduct a simple National Convention in two years.\nIt has become a Russian Roulette with unending request for extension of time to undertake a routine statutory political activity.\nADVERTISEMENT“Our Party is not surprised that the APC, a party of backstabbers, again postponed its National Convention already scheduled for February 26, 2022.\n“The only way the APC can legitimately participate in the 2023 general is to re-apply to the Independent National Electoral Commission (INEC) for fresh registration as a political party."
  },
  {
    "headline": "2023: Ex-Lagos Governor, Tinubu Makes U-turn On ‘Fight Dirty Comment’",
    "summarized_story": "Bola Tinubu, the National Leader of the All Progressives Congress, has indicated that his statement that he promised to fight dirty if his presidential ambitions in 2023 were thwarted was taken out of context.\nWhen Tinubu paid a visit to Senator Lekan Balogun, the Olubadan-designate, on Sunday, he accused the media of misrepresenting his comments.\nMr Tunde Rahman, his media aide, confirmed this in a statement released on Monday in Lagos State.\nTinubu stressed that at no time during the visit and in his speech did he indicate that he would fight dirty for his presidential ambition.\n“I am ready to get dirty."
  },
  {
    "headline": "2023: Entire North Behind Tinubu’s Presidential Ambition — Ganduje",
    "summarized_story": "Governor Abdullahi Ganduje of Kano State has endorsed Bola Tinubu, the APC’s National Leader, in his bid for the presidency (APC).\nTinubu’s presidential ambitions in 2023, according to Ganduje, have the support of the whole North.\nHe stated that the North should repay Tinubu for his support of President Muhammadu Buhari.\nOn Monday, the Governor spoke during the inauguration of a Tinubu office for Northern Youth Professionals in Kano.\n“His Excellency, Dr. Abdullahi Ganduje is part and parcel of this struggle, so we’re with Bola Ahmed Tinubu."
  },
  {
    "headline": "UPDATE: APC Backtracks, Slates National Convention For March 26",
    "summarized_story": "The Mai Mala Buni-led Caretaker/Extraordinary Convention Planning Committee Monday evening announced that it would conduct the national Convention on March 26, 2022.\nThe party said it intends to conduct its zonal congress on March 26, 2022.\nIt also informed the commission that the earlier Convention slated for February 26, 2022, will no longer hold.\nIn between the Convention, we have agreed to have zonal congresses.”Meanwhile, the APC has updated its schedule of activities ahead of the new date of March 26 for the National Convention.\nAccording to the new timetable, the Publication of National Convention Sub-Committees now holds on February 28, 2022."
  },
  {
    "headline": "NPA: Mohammed Bello-Koko’s Appointment Questions Buhari’s Anti-corruption Stance",
    "summarized_story": "The second charge leveled against Mr Bello-Koko is that after being hired as the executive director of Finance and Administration, he purchased a fifth London home.\nThe fourth charge leveled against Mr Bello-Koko is that he was involved in offshore deals prior to joining the government.\nMr Bello-Koko, was an unknown maritime person before his appointment as ED F&A.\nMaking Mr Bello-Koko MD/CEO of NPA in such controversial circumstances amounts to an indictment on President Buhari’s anti-corruption crusade.\nMr Bello-Koko clearly lacks the requisite credibility and integrity for that exalted and sensitive office to the Nigerian economy."
  },
  {
    "headline": "Niger: Insurgents’ explosives kill 4 NSCDC operatives, 6 civilians slain, 20 Zuru villages sacked by gunmen",
    "summarized_story": "The NSCDC personnel were reported to be on rescue mission when their vehicle ran into the landmines.\nNiger state Commissioner of Police Monday Bala Kuryas confirmed this in telephone interview with journalists in Minna.\n“We appeal to residents to assist security personnel deployed with reliable information that could aid in apprehending miscreants.\nIt was gathered that about 20 towns and villages were sacked in Zuru emirate of Sakaba and Danko/Wasagu local government areas.\nHe assured the IDPs that efforts were on to resettle them in their various places while additional security personnel would be deployed to reinforce security."
  },
  {
    "headline": "[Breaking] ‘Drug trafficking’: Abba Kyari fights back, drags FG to court",
    "summarized_story": "DCP Abba Kyari, the suspended Police officer on Monday sued the federal government to the court over his alleged involvement in drug trafficking.\nKyari is currently in the custody of the National Drug Law Enforcement Agency (NDLEA).\nPending the hearing and determination of his fundamental right enforcement application, the detained Police officer in his suit marked FHC/ABJ/CS/182/22, is praying the court to compel NDLEA to grant him bail on health grounds.\nDetails loading…"
  },
  {
    "headline": "Breaking: Court throws out suit challenging Atiku’s citizenship",
    "summarized_story": "A Federal High Court in Abuja Monday struck out a suit challenging the Nigerian citizenship of former Vice President, Alhaji Atiku Abubakar.\nJustice Inyang Eden Ekwo struck out the suit instituted by the Incorporated Trustees of Egalitarian Mission for Africa challenging the Nigerian citizenship of former number two man in Nigeria.\nThe court held that the Non Governmental Organisation (NGO) had no legal right in the first instance to query the citizenship of the former Vice President.\nThe suit which was filed on 11th February, 2019, has Atiku, PDP, the Independent National Electoral Commission, the Attorney-General of the Federation and Minister of Justice as well as the Attorney General of Adamawa state as defendants.\nSpecifically, the plaintiff had approached the court for an interpretation of Sections 25(1) & (2) and 131(a) of the 1999 Constitution."
  },
  {
    "headline": "BREAKING: President Buhari Likely To Sign Electoral Bill On Wednesday – Sources",
    "summarized_story": "Hours after the Special Adviser to the President on Media and Publicity told Channels Television that President Muhammadu Buhari will sign the Electoral Act Amendment Bill into law soon, sources in the Presidency have put the likely time as tomorrow.\nThe sources disclosed to Channels Television on Tuesday that President Buhari will likely sign the re-worked electoral act amendment bill into law on Wednesday, February 23.\nREAD ALSO: Buhari Unwilling To Sign Electoral Bill, Says PDP GovernorsThis comes a few hours after Mr Femi Adesina during an interview on Sunrise Daily said President Buhari will sign the bill any moment from now.\nThis hint also comes amid protests by civil society groups in Abuja demanding that President Buhari assent the bill.\nRe-Amended Electoral BillThe National Assembly on January 31, transmitted the re-amended Electoral Act Amendment Bill to President Muhammadu Buhari for assent."
  },
  {
    "headline": "Groups Protest At Unity Fountain, Demand Assent To Electoral Bill",
    "summarized_story": "Groups including civil society organisations under the umbrella of the Situation Room have stormed the Unity Fountain in Abuja for a protest.\nThe protesters on Tuesday morning gathered at the Unity Fountain and displayed various placards asking President Muhammadu Buhari to assent the Electoral Act Amendment Bill into law.\nMeanwhile, the Special Adviser to the President on Media and Publicity, Mr Femi Adesina in an interview on Channels Television, Sunrise Daily said it is just a matter of hours for President Muhammadu Buhari to sign the Bill.\n“It could be signed today; it could be signed tomorrow.\nHours could be 24 hours, it could be 48 hours; not days, not weeks.”See more pictures from the protest below…"
  },
  {
    "headline": "Putin Orders Russian Military To Act As ‘Peacekeepers’ In Ukraine Regions",
    "summarized_story": "President Vladimir Putin on Monday ordered Russia’s military to act as peacekeepers in two breakaway regions of Ukraine, just hours after he recognised them as independent.\nPutin’s recognition of the separatist republics as independent effectively buries a fragile 2015 peace plan for the conflict, and opens the door for direct Russian military involvement.\nIn two official decrees, Putin instructed the defence ministry to assume “the function of peacekeeping” in the Donetsk and Lugansk regions.\nEarlier on Monday, the Russian leader demanded that Kyiv halt all its military operations against Moscow-backed rebels in eastern Ukraine, or face more bloodshed.\nPutin recognised the Donetsk and Lugansk separatist republics on Monday, despite repeated Western warnings that this would result in sanctions."
  },
  {
    "headline": "APC Postpones National Convention To March 26",
    "summarized_story": "﻿The All Progressives Congress has fixed its National Convention for March 26.\nThe party’s National Convention had been a subject of debate for weeks as usual pre-convention activities failed to hold.\nMonths after it assumed the leadership of the party, the tenure of the Caretaker and Extraordinary Convention Planning Committee (CECPC) was extended to better plan a national convention.\nLast year, APC Governors proposed that the national convention be conducted in February to elect a new set of NWC members.\nAmid reports over the uncertainty of conducting the national convention on Saturday, the party affirmed that it had postponed the exercise by one month."
  },
  {
    "headline": "This Is The Only Major Fuel Scarcity Under Buhari’s Administration, Says Adesina",
    "summarized_story": "﻿Nigeria has only witnessed one major fuel scarcity since the inception of the Muhammadu Buhari administration, says Mr Femi Adesina.\n“Each time this issue of the fuel scarcity come up, there is also a word that comes to my mind; that word is called SNAFU, and it’s an acronym for Situation Normal All Filed Ups.\n“What happened is a SNAFU in the petrol supply chain in the country,” he said.\n“In the life of this administration which will be seven years in May, it is only one major fuel scarcity we have had.”Not A RoutineLagos, Abuja, and major cities across the country were hit with fuel scarcity following the recent importation of adulterated Premium Motor Spirit (PMS), popularly known as petrol.\nMore than any other administration, this one (Buhari’s) has restored normalcy in petroleum supply for years."
  },
  {
    "headline": "Civil society groups protest in Abuja, urge Buhari to sign Electoral Amendment bill",
    "summarized_story": "Civil society groups are on a peaceful protest in Abuja to pile pressure on President Muhammadu Buhari to sign the electoral act amendment bill.\nThe groups gathered at the unity fountain in the country’s capital, they carried placards with different messages targeted at Mr. President and intended to force him to sign the bill that will enhance Nigeria’s electoral process.\nAdvertisementThey are worried that a further delay to get the President’s assent on the bill will alter INEC’s election timetable .\nAn earlier statement from the presidency signed by Femi Adeshina the spokesman appeared to dismiss the concerns of groups advocating for electoral reforms and accused them cashing in on the delay in signing the bill to forment civil disorder and muddy the waters.\nAdvertisementThe presidency insists president Buhari will do the right thing within the lawful time."
  },
  {
    "headline": "PGF chairman, Bagudu declines comment APC convention timetable -",
    "summarized_story": "The meeting of the All Progressives Congress Governors’ Forum has ended with the Chairman of the Progressives Governors’ Forum and Governor of Kebbi State, Atiku Bagudu declining to speak on the time table released by the party’s extraordinary national convention planning committee on its national convention.\nHe said the forum will be meeting with President Muhammadu Buhari on Tuesday to further deliberate on the national convention.\nAdvertisementOther issues discussed by the forum according to Governor Bagudu include the just concluded FCT Council elections, the Osun primaries among others."
  },
  {
    "headline": "APC Governors meeting in Abuja at Kebbi Governors Lodge",
    "summarized_story": "The APC governors forum meeting is currently ongoing at the Kebbi State government lodge in Abuja.\nThis meeting is considered to be a reaction to the latest decision of the governing party to hold zonal congresses on the 26th of this month and postpone the earlier scheduled national convention to the 26th of next month.\nAdvertisementResolutions reached at this crucial meeting will help the party walk a tight rope as intense politicking have raised the stakes and the latest decision of the party to hold zonal congresses have changed political calculations and caused a setback to certain interests within the APC.\nAdvertisementThe governors forum which is a major power bloc within the party will deliberate on maters arising and attempt to point the party in a direction they consider to be in the interest of all."
  },
  {
    "headline": "BREAKING: APC shifts National Convention to March 26",
    "summarized_story": "The Caretaker Extraordinary Convention Planning Committee (CECPC) has just announced that it will conduct the national convention on the 26th of March.\nThis is contrary to a letter sent to the Independent National Electoral Commission (INEC) on the conduct of zonal congresses for same date.\nAdvertisementThe Mai Mala Buni Committee has been in a closed-door meeting since 11am today.\nSecretary of the caretaker committee, John AkpanUdoedehe addressing newsmen after the meeting says preparations for the Convention will commence on the 24th of March.\nMonday 28th February, 2022Publication of National Convention Sub-Committees2."
  },
  {
    "headline": "Hong Kong Orders Mandatory Covid Tests for All Residents",
    "summarized_story": "Hong Kong will test its entire population for COVID-19 in March, the city’s leader said Tuesday, as the city grapples with its worst outbreak driven by the omicron variant.\nHong Kong has reported about 5,000 new daily infections since Feb. 15, with the number threatening to overwhelm its healthcare system.\nSince the surge began at the beginning of the year, the city has recorded nearly 54,000 cases and 145 deaths.\nThe order for citywide testing comes after mainland Chinese authorities dispatched health workers and medical resources last week to help contain the outbreak in the semi-autonomous Chinese city."
  },
  {
    "headline": "Oil Hits Highest Since 2014 on Russia-Ukraine Escalation",
    "summarized_story": "“The potential for a rally over $100 a barrel has received an enormous boost,” said Tamas Varga of oil broker PVM.\nU.S. West Texas Intermediate (WTI) crude jumped $4.41, or 4.8%, to $95.48 versus Friday’s settlement, having earlier reached $96, also the highest since 2014.\nThe crisis over Ukraine has added further support to an oil market that has surged due to tight supplies as demand recovers from the coronavirus pandemic.\nThe Organization of the Petroleum Exporting Countries and allies, known as OPEC+, have resisted calls to boost supply more rapidly.\nTalks are ongoing on renewing Iran’s nuclear agreement with world powers, which could eventually boost Iran’s oil exports by over 1 million barrels per day."
  },
  {
    "headline": "Russia Faces New Sanctions after Putin Recognise Breakaway Ukraine Regions",
    "summarized_story": "The United States and its European allies are set to announce fresh sanctions against Russia on Tuesday after President Vladimir Putin recognised two breakaway regions in eastern Ukraine, deepening Western fears of a new war in Europe.\nA senior British government minister said it was clear Putin had chosen confrontation over dialogue and Britain would respond with sanctions.\nHe said the situation was as grave as the 1962 Cuban missile crisis when a confrontation between the United States and the Soviet Union brought the world to the brink of nuclear war.\nEuropean Union member states’ ambassadors will meet to discuss possible sanctions with limited sanctions a possible option, an EU official said.\nRussia annexed Crimea from Ukraine in 2014, and Western countries imposed sanctions on Russia."
  },
  {
    "headline": "Dubai Airport Busiest for Global Travel as Virus Persists",
    "summarized_story": "Dubai’s main airport said Tuesday it has retained its top place as the world’s busiest for international travel with around 29 million passengers shuttling through the global gateway last year.\nThe numbers are sign that international travel has picked up somewhat since the coronavirus pandemic spawned unprecedented global lockdowns and border closures in 2020.\nLast year’s figure represents a 12% increase in traffic at Dubai International Airport compared to 2020, which had recorded nearly 26 million travelers.\nStill, even with 29.1 million passengers crisscrossing last year through Dubai International Airport, or DXB, the figure is nowhere near the pre-pandemic milestone of 86.4 million in annual traffic logged by the airport in 2019.\nThe largest share of traffic to Dubai came from India, with 4.2 million travelers, followed by Pakistan, with 1.8 million travelers last year."
  },
  {
    "headline": "Nigeria: Landmine Kills Security Personnel in Niger State",
    "summarized_story": "Landmine kills 4 personnel of NSCDC in NigerMichael Olugbode in AbujaFour personnel of the Nigeria Security and Civil Defence Corps (NSCDC) have been lost to a buried landmine in Niger State.\nRelatedStories No Content AvailableA statement on Monday by the spokesman of the paramilitary agency, Olusola Odumosu said a bomb explosion has rocked an operational vehicle of the Niger State Command of Nigeria Security and Civil Defence Corps killing four personnel instantly while the driver of the vehicle sustained very serious injuries during the blast and had been rushed to the hospital where he is currently battling for his life.\nHe disclosed that the explosion occured along Galadiman kogo axis in Shiroro Local Government Area of Niger State at the early hours of Monday morning involving some officers and men of NSCDC Niger Command attached to Shiroro Hydro Power Station, Shiroro, Niger State on a routine patrol in the early hours of Monday morning when their patrol vehicle stepped on a buried land mine which exploded immediately killing all occupants except the driver who is currently in a very critical condition.\nOdumosu said the dead personnel areMohammed Ibrahim (Assistant Superintendent of Corps 1), Cheche Ahmed (Assistant Superintendent of Corps 11), Yunusa Mahmam (Inspector of Corps) and Bala Abdullahi (Corps Assistant 1), while the driver currently in critical condition at the hospital as been identified as Inspector Bala Adamu.\nOdumosu said the Commandant General, NSCDC, Dr. Ahmed Audi, PhD, has commiserated with families of the deceased officers and men who paid the supreme price in service to the Nation and reassured residents of Niger of the Corp’s resolve and commitment to the security of lives and property of Nigerians without deterrence."
  }
]