[
  {
    "headline": "Four killed as Anambra APC, APGA campaigns turn bloody",
    "summarized_story": "GUNMEN went on rampage in two locations in Anambra State on Sunday, killing four persons and injuring several people at an All Progressives Congress rally.\nThe hoodlums also set ablaze a car belonging to a leader of Prof. Chukwuma Soludo Campaign team, Dr Nelson Omenugha.\nThe state publicity secretary of APC, Mr Okelo Madukaife confirmed the Nnewi incident.\n“We regret the loss and regard it as one violence too many in Anambra State that ought to be the safest state in Nigeria.\nThe APC governorship candidate, Senator Andy Uba, condemned Sunday’s killing of a member of the party in Nnewi North Local Government Area."
  },
  {
    "headline": "Commissioner feigns ignorance as Uyo residents recount flood ordeals",
    "summarized_story": "Residents of Uyo metropolis in Akwa Ibom State have decried flooding of some parts of Uyo metropolis occasioned by the downpour on Saturday.\nThe affected areas include Idoro Road by Julius Berger junction, Atiku Abubakar Way, Ikot Oku Ikono and Udo Umanah streets.\nOne of the victims of the flood who is also a landlord, Mr Udimisor, told newsmen on Monday that his compound and several others were submerged during the downpour.\n“I have been living in the compound for the past five years and I have not experienced this kind of flood before.\n“I am not aware of this area being ravaged by flood."
  },
  {
    "headline": "If every state imitates Lagos, Rivers on VAT, there will be crisis — Northern governors",
    "summarized_story": "Governor Simon Lalong of Plateau State and Chairman, Northern States Governors ForumThe northern governors have said that if every state of the federation follows the Lagos and Rivers example in the Value Added Tax, VAT, controversy, there would be multiple taxation, rise in prices of goods and services and collapse of inter-state trade.\nThey were also of the opinion that the said states were mistaking sales tax for VAT.\nVanguard had reported that the governors, on the platform of Northern Governors Forum, NGF, met in Kaduna to deliberate on, among others, issues bordering on insecurity and the VAT controversy.\nOn VAT, the governors held that “Rivers and Lagos states enacted their own VAT laws and the Southern Governors Forum have expressed support for this course of action.\n“If every State enacted its own VAT Law, multiple taxation will result in increases of prices of goods and services and collapsed in interstate trade."
  },
  {
    "headline": "BREAKING: ‘Evicted’ Pere, Angel back in Big Brother’s House for finals",
    "summarized_story": "Big Brother has asked housemates Pere and Angel to return to the house to compete in the final after both housemates performed well in the game that was set up to send one of them away.\nRecall that in a twist on Sunday, Big Brother carried out a fake eviction on Pere and Angel, a move believed to spice up the show.\nThis left both housemates to battle for the final spot for the grand finale of this season’s Shine Ya Eyes Big Brother Naija.\nFinally, Big Brother decided they both did well and should return to the House for the grand finale.\nHow the other housemates will react to the re-appearance of “evicted” Pere and Angel would be a huge one with lovers of the game."
  },
  {
    "headline": "Powershift: Northern governors only exercised their right under freedom of expression ― Southern governors",
    "summarized_story": "Dayo Johnson – AkureFile: Governor Godwin Obaseki of Edo; Dapo Abiodun of Ogun, Akwa Ibom Deputy Governor, Moses Ekpo; Governor Willie Obiano of Anambra, Douye Diri of Bayelsa, Ebonyi’s David Omahi, Kayode Fayemi of Ekiti, Chairman, Southern Governors Forum and Govenor of Ondo, Rotimi Akeredolu; Senator Ifeanyi Okowa of Delta, Nyesom Wike of Rivers, Babajide Sanwolu of Lagos, Enugu State’s Ifeanyi Ugwanyi, Imo Deputy Governor, Placid Njoku; Oyo State Governor, Seyi Makinde and Okezie Ikpeazu of Abia in a photograph after Southern Governors meeting at Government House, Asaba.\nChairman of the Southern Governors Forum, Rotimi Akeredolu, has said that northern governors should not be grudged for kicking against power shifting to the south in 2023.\nAkeredolu in a terse response through his information and Orientation commissioner in Ondo state, Donald Ojogo in Akure said that they have only exercised their right under freedom of expression.\nHe said, “on the northern governors’ resolution, They have expressed and indeed exercised their rights under Freedom of Expression.”Akeredolu added that “No one can stop them from expressing themselves.”Vanguard News Nigeria"
  },
  {
    "headline": "SCOAN’ll reopen when we get approval from God ― Evelyn TB Joshua",
    "summarized_story": "…..says SCOAN will come out strongerBy: Olayinka LatonaMRS Evelyn Temitope Balogun Joshua, the new leader of the Synagogue Church of All Nations, SCOAN, has announced that the church will reopen for service when the leadership gets approval from God.\nThe widow of deceased Prophet Temitope Balogun Joshua stated this in a statement made available to Vanguard to address concerns by church members who are yearning for physical church service.\nEvelyn who hinted that she is still mourning her husband, said she believes SCOAN will emerge stronger.\nBe assured that God’s mercy endures and by His grace, SCOAN shall come out stronger,” the new leader said.\nIn his words: “We don’t conduct the affairs of SCOAN to please people but we embark on the project because we have heard from God."
  },
  {
    "headline": "One dead, 2 injured as unknown gunmen attack Kwara community — NSCDC",
    "summarized_story": "The Nigeria Security and Civil Defence Corps (NSCDC) has reported that some unidentified gunmen attacked a farm settlement at Ahun village, Oro-Ago, Ifelodun Local Government Area of Kwara, killing a teenager.\nThis was contained in a press release signed by the command’s spokesman, Mr Babawale Afolabi, and made available to newsmen in Ilorin, on Sunday.\nAfolabi said that the incident happened at night, on Sept. 25, during which two other persons sustained bullet wounds.\n“On Sept. 26, some community leaders from Ahun farm settlement in Oro-Ago, reported at our Divisional office in the area, about an attack on their community by unknown gunmen.\n“The gunmen were in their large numbers and they started shooting sporadically when they entered the community, which resulted in the killing of one Rukayat, a teenager, by a stray bullet,” he said."
  },
  {
    "headline": "Akeredolu carpets northern governors over stance on rotational presidency",
    "summarized_story": "The Chairman of the Southern Governors’ Forum and Governor of Ondo State, Oluwarotimi Akeredolu, on Monday, disclosed that the Northern Governors’ Forum was merely exercising its rights to freedom of expression over its stance on 2023 presidency.\nAkeredolu, emphasised that the resolution reached by the northern governors who unanimously condemned the statement by the Southern Governors Forum that the Presidency must go to the South should be termed as a means of expressing themselves.\nReacting to the resolutions of the Northern Governors’ Forum, Akeredolu said “They have expressed and indeed exercised their rights under Freedom of Expression.\nNo one can stop them from expressing themselves.”The Southern Governors’ Forum a few days ago in Enugu State reiterated their position that the presidency must return to south in 2023.\nDuring the Enugu meeting, they also deliberated on the Value Added Tax, VAT controversy, where they agreed that it was the right of states to collect VAT."
  },
  {
    "headline": "Nigeria unsafe, allow NYSC members serve in home states – Afenifere to Buhari govt",
    "summarized_story": "Afenifere has advised the President Muhammadu Buhari administration to allow National Youth Service Corps (NYSC) members to serve in their home states.\nApex Yoruba organization said the insecurity in Nigeria required that adjustments be made where necessary.\nThe body regretted how corps members were asked to inform their people to prepare ransom in case they were kidnapped while travelling.\nIt is in this respect that Afenifere calls for the NYSC to allow youth corpers to serve the nation in their respective states at least for now.”Afenifere noted that the federal government’s handling of kidnapping has emboldened the perpetrators to continue in their dastardly acts.\n“We call on the government to immediately allow states to transform their respective security networks into state police with all the powers appertaining thereto”, Ajayi added."
  },
  {
    "headline": "Ember months: Police heighten security in Lagos",
    "summarized_story": "The Lagos Police Command has heightened security across the state, including nooks and crannies.\nOn Monday, Commissioner of Police, Hakeem Odumosu directed all field commanders to beef up security in their areas.\nThe order is part of moves to secure Lagos during the ’ember months’ period and beyond.\nOn hoodlums’ nefarious activities in traffic, the CP charged them to provide adequate security on roads to curtail robbery and control gridlock.\n“This proactive step will make our roads secure, safe and more comfortable for motorists and other road users”, Odumosu said."
  },
  {
    "headline": "EKEDC condemns vandalization of installations",
    "summarized_story": "Eko Electricity Distribution Company (EKEDC) has condemned the spate of attacks on electrical installations.\nA statement by the General Manager, Corporate Communications, Godwin Idemudia revealed that sabotage is one of the biggest challenges distribution companies (DisCos) face.\n“The company needs the support of customers to achieve the overarching objective of a stable and reliable power supply”, Idemudia added.\nThe Enugu Electricity Distribution Company (EEDC) recently called for a sustained media campaign against energy theft and damage of power infrastructure.\nThe NSCDC Act mandates the agency to protect critical infrastructure, including petroleum pipelines, telecommunication equipment, power, oil and gas installations."
  },
  {
    "headline": "IBBUL tuition: Niger Governor approves reduction of fees for students",
    "summarized_story": "The Governor of Niger State, Abubakar Sani Bello has approved a further reduction in the tuition fees for Students of Ibrahim Badamasi Babangida University, Lapai, IBBUL.\nThe governor made the disclosure in a statement issued by Secretary to the State Government (SSG), Ahmed Ibrahim Matane in Minna.\nHe said the downward review only affects returning students (indigene) from N50,000 to N46,000 and new students (indigenes) from N95,000 to N86,000.\nThe SSG explained that the decision of the governor came after listening to representations from members of the State House of Assembly, different stakeholders, including the Students’ union.\nHowever, according to the governor,” the tuition fees for non-indigenous students (returning), new students (non-indigene), new foreign students and returning foreign students remain unchanged."
  },
  {
    "headline": "Court orders AGF to assume prosecution of Imo ex-Gov, Ohakim over alleged cybercrime",
    "summarized_story": "By Eric Ikhilae, Abuja- Advertisement -A Federal High Court in Abuja has ordered the Attorney-General of the Federation (AGF) and Minister of Justice to take over the prosecution of a former Imo Governor, Ikedi Ohakim charged with cybercrime related offences.\nIn a ruling on Monday, Justice Taiwo Taiwo held that the AGF possesses an unfettered power to prosecute criminal offences on behalf of the Federal Government.\nJustice Taiwo rejected move by the Nigeria Police Force (NPF) to discontinue the case, noting that the notice of discontinuance filed by the police was without merit.\nJustice Taiwo further held that the court cannot give effect to the notice of discountenance filed by the police.\nOhakim and Okpareke were also accused by the Police of threatening Amuchiewa and harassment her."
  },
  {
    "headline": "We’ve not declared no election in Anambra – IPOB",
    "summarized_story": "By Emma Elekwa, OnitshaThe Indigenous People of Biafra (IPOB) on Monday said it has not officially declared ‘no election’ in Anambra State, stressing that its pre-occupation remained restoration of Biafra Republic.\nThe group also said it had no plans to attack South Easterners and South Southerners.\nThe statement reads in part: “It is important to note that contrary to speculations, IPOB has not officially declared ‘no election in Anambra State’.\n“IPOB has seen numerous false propaganda in the past and we are not in any way moved by this latest vomit.\n“Contrary to the vomit by this inconsequential fellow, IPOB has no plans to attack South Easterners and South Southerners."
  },
  {
    "headline": "Eight killed in Zangon-Kataf reprisal attack",
    "summarized_story": "By AbdulGafar Alabelewe, Kaduna- Advertisement -No fewer than eight persons have been confirmed killed in a reprisal attack by gunmen on Kacecere village in Zangon Kataf Local Government Area of Kaduna State.\nCommissioner for Internal Security and Home Affairs, Samuel Aruwan, who confirmed the incident said, the incident was a reprisal to attacks in Jankasa village, where one Mr. Yakubu Danjuma was killed and Madamai in Kaura LGA where 34 persons were killed.\nAccording to Aruwan: “The Kaduna State Government has received reports from security agencies of an attack by unidentified persons in Kacecere village, Zangon Kataf LGA, which has resulted in the deaths of some citizens.\n“According to the reports, this attack was in reprisal to earlier attacks in Jankasa village, Zangon Kataf LGA where one Mr. Yakubu Danjuma was killed, and also in Madamai in Kaura LGA where 34 persons were killed.\n“The attacks in these two locations, security agencies reported, led to the reprisal by unidentified assailants on Kacecere community which has left eight dead, six persons injured and several houses razed."
  },
  {
    "headline": "Gunmen kill 4, raze 3 vehicles in Anambra",
    "summarized_story": "From Obinna Odogwu, AwkaFour persons have been reported killed in different locations in Anambra State by gunmen.\nThe other three, it was gathered, were killed along Nnobi – Nnewi Road, near Afor Market, Nnobi, in Idemmili South LGA.\nThere, three vehicles were set ablaze by the gunmen after shooting at the victims who were just travelling through the area.\nOne of the burnt vehicles, a Hilux van, belonged to the Convener of Youths Earnestly Seek Soludo (YESS), Dr Nelson Omenugha.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "BREAKING: Boat mishap: One dead, 16 rescued in Lagos",
    "summarized_story": "By Steve Agbota, Christopher Oji, LagosOne passenger has been confirmed dead in a boat mishap that occurred at about 16:35 hrs on Monday in Lagos.\nEngr Sarat Braimah, the Lagos Area Manager of the National Inland Waterways Authority (NIMWA) disclosed this in a statement.\n’15 minutes into the journey near Adekunle Waterfront, the boat hit an underwater obstacle which broke the hull of the boat and this resulted in the capsizing of the boat,’ the statement read in part.\nIt also disclosed that 16 out of the 17 passengers were rescued alive following an immediate rescue effort by NIWA Search and Rescue Team alongside other agencies and some fishermen.\nThe National Emergency Management Agency (NEMA) Zonal Coordinator, South West, Mr Ibrahim Farinloye, also confirmed the incident, saying sixteen passengers were rescued alive while one was found dead."
  },
  {
    "headline": "Northern governors condemn southern governors’ position on presidential zoning",
    "summarized_story": "From Sola Ojo, LagosThe Northern States Governors’ Forum on Monday rose from its one-day emergency meeting with the Northern States Traditional Council Chairmen in Kaduna to unanimously condemned the statement by the Southern Governors Forum that the Presidency must shift to the South come 2023.\n‘The Forum observed that some Northern State Governors had earlier expressed views for a power-shift to three Geo-Political Zone in the South to promote unity and peace in the Nation.\n‘Notwithstanding their comments, the Forum unanimously condemn the statement by the Southern Governors Forum that the Presidency must go to the South.\n‘Rivers and Lagos State Government had enacted their VAT laws and the Southern Governors Forum have expressed support for this course of action.\nOn the security, the Forum observed the need for a sustained synergy and coordinated efforts between the Federal and Northern States Governments while noting the success of recent measures."
  },
  {
    "headline": "Bandits kill 34 in fresh attack, burn houses in Kaduna",
    "summarized_story": "From Noah Ebije, KadunaNo fewer than 34 persons have been killed and several houses set blaze in the early hours of Monday in fresh attack by bandits on Madamai village in Kaura local government area of Kaduna State.\nThe bloody attack happened while the northern governors were meeting in Kaduna over insecurity and other socio-economic issues in the region.\n“According to the reports, unidentified gunmen attacked Madamai village in Kaura local government.\n“Governor El-Rufai has stated that the Kaduna State Government will bear the full cost of injured victims’ treatment.\n“The Governor ordered an urgent assessment of the area by the Kaduna State Emergency Management Agency, towards the provision of succour to the affected households."
  },
  {
    "headline": "VAT, security, economy top North’s emergency meeting in Kaduna",
    "summarized_story": "From Sola Ojo, KadunaValue Added Tax (VAT), security and economy of the North are the top agenda for the ongoing emergency meeting of the northern governors and council of traditional leaders from the 19 Northern states holding at Kaduna State Government House, Kaduna.\nThe emergency meeting was expected to the position of the region on some emerging national issues including the ongoing discussions around VAT.\nVarious presentations were also made by individuals and corporate organizations for the development of the region which we all agreed to carefully examine.\nEarlier in his welcome address, the Kaduna State Governor, Nasir El-Rufai, commended the participants at the meeting for their ability to respond to the call for the emergency meeting hoping that, the outcome would be in the best interest of the people of the region.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Northern Govs: South’s Call for Power Shift Unconstitutional",
    "summarized_story": "*Say Rivers, Lagos confusing VAT with Sales TaxBy John Shiklam in KadunaThe Northern States Governors Forum (NSGF) has condemned statements by their Southern Governors Forum (SGF) that the Presidency must go to the South in 2023.\n“The Forum observed that some Northern States Governors had earlier expressed views for a power-shift to three Geo-Political Zone in the South with a view to promoting unity and peace in the Nation.\n“Notwithstanding their comments, the Forum unanimously condemn the statement by the Southern Governors Forum that the Presidency must go to the South”, the communique said.\n“VAT is not a production tax like excise, but terminal tax which is paid by the ultimate consumer”.\nAlso at the meeting was the Chairman of the Northern Traditional rulers council, Alhaji Sa’ad Abubakar III, the emir’s of Zazzau, Bauchi and Kano, among others."
  },
  {
    "headline": "Bandits Attack Two Kaduna Communities, Kill 32",
    "summarized_story": "By John ShiklamBandits have again attacked two communities in Kaduna State — Madamai and Abun — in Kaura Local Government Area of the state, killing32 people, including a family of 13.\nThe bandits were said to have invaded the two communities late Sunday night, unleashing mayhem on the residents.\nHe said the bandits were shooting sporadically as they arrived the villages, killing 32 people.\nThe senator representing Southern Kaduna senatorial district, Danjuma La’ah, has condemned the attack.\nReacting to the incident in a telephone interview, La’ah lamented the persistent attacks on Southern Kaduna, which had led to the killing of hundreds of people."
  },
  {
    "headline": "Bandits Attack Joint Base, Kill Military Personnel in Sokoto",
    "summarized_story": "By Onuminya InnocentResidents yesterday said gunmen suspected to be armed bandits attacked a joint military base codenamed “Burkusuma camp’ located in Sabon Birni Local Government Area of Sokoto State and killed unspecified number of military personnel.\nIt was gathered that the bandits came in large numbers and started shooting at the camp from every angle.\nBut a military source, who is not authorised to speak on the matter, said a large number of suspected bandits were killed when a military base was attacked in the Eastern Senatorial District of Sokoto.\nThe source did not confirm if the said military camp is the same with the Burkusuma camp in Sabo Birni Local Government.\nHe said over 10 trucks conveying armed military personnel were in the forest trailing the bandits."
  },
  {
    "headline": "Ahead of October Launch, eNaira Platform Goes Live",
    "summarized_story": "*Records one million hits in days after unveiling according to analyticsObinna ChimaThe official website of the upcoming Central Bank of Nigeria’s (CBN) digital currency, the eNaira, has gone live, exactly one week to the planned launch of the initiative.\nRemarkably, 24-hours after the website went live, it has recorded over one million hits, according to analytics monitored by THISDAY.\n“The central bank would not want the event to take the shine away from the Independence celebration,” he said.\nEmefiele expressed optimism that the eNaira, would bring about increased cross-border trade, accelerate financial inclusion and lead to cheaper and faster remittance inflow.\nHe said the digital money would lead to easier targeted social interventions, as well as improvement in monetary policy effectiveness, payment systems efficiency, and tax collection."
  },
  {
    "headline": "Bandits Free Another Batch of 10 Bethel Baptist Students, 11 Still in Captivity",
    "summarized_story": "Joseph Hayab, said the 10 students were released on Sunday afternoon and were reunited with their parents.\nHowever, while giving an update on the Bethel students kidnap debacle, Hayab expressed hope that the remaining 11 students would soon be released.\nOn July 5, bandits invaded the school located about six kilometers away from Kaduna metropolis and abducted 121 students.\nParents of the students were said to have paid a total of over N200 million as ransom to the bandits.\nThe bandits were said to have demanded and collected fresh ransom for each batch of students released."
  },
  {
    "headline": "BUSTED: Sponsor Of Pro-Buhari Protest In New York Identified As Businessman And All Progressives Congress Party Chieftain, Nasiru Danu",
    "summarized_story": "A chieftain of the All Progressives Congress (APC), Nasiru Haladu Danu sponsored the pro-President Muhammadu Buhari protest which was recently held in New York, United States, SaharaReporters gathered.\n\"The 'One Nigeria' protest which is pro-Buhari was funded by Nasiru Danu.\nSee you all tomorrow.”Checks by SaharaReporters showed that the phone number attached to the email belongs to one Ogundare Olukemi who is said to be based in New York, United States.\nAlso, a woman confirmed that she was contacted by the organisers of the “One Nigeria” protest but she declined.\nShe said, “I was invited for the pro-Buhari protest."
  },
  {
    "headline": "BUSTED: Sponsor Of Pro-Buhari Protest In New York Identified As Businessman And All Progressives Congress Party Chieftain, Nasiru Danu",
    "summarized_story": "A chieftain of the All Progressives Congress (APC), Nasiru Haladu Danu sponsored the pro-President Muhammadu Buhari protest which was recently held in New York, United States, SaharaReporters gathered.\n\"The 'One Nigeria' protest which is pro-Buhari was funded by Nasiru Danu.\nSee you all tomorrow.”Checks by SaharaReporters showed that the phone number attached to the email belongs to one Ogundare Olukemi who is said to be based in New York, United States.\nAlso, a woman confirmed that she was contacted by the organisers of the “One Nigeria” protest but she declined.\nShe said, “I was invited for the pro-Buhari protest."
  },
  {
    "headline": "REVEALED: How Nigeria's Ex-Petroleum Minister, Diezani Collected $300,000 Per Oil Contract To Fund Jonathan’s 2015 Election – FBI",
    "summarized_story": "American prosecutors, relying on FBI investigations, alleged in the court filings that Stimler as well as other local and international oil brokers paid bribes to Alison-Madueke in exchange for oil contracts under favourable terms.\nAlison-Madueke was believed to have sunk the bribes into Mr Jonathan’s reelection campaign, the charges said.\nAlison-Madueke has since been identified by multiple sources including Bloomberg as the ‘Foreign Official 1’ referenced in the document.\nNNPC under Alison-Madueke was also accused of receiving $200,000 on oil cargoes $50,000 around April 2015 that were slated to be delivered at the end of the year.\nAlthough Buhari maintained his so-called incorruptibility, his office has yet to deny the U.S. bribery charges."
  },
  {
    "headline": "REVEALED: How Nigeria's Ex-Petroleum Minister, Diezani Collected $300,000 Per Oil Contract To Fund Jonathan’s 2015 Election – FBI",
    "summarized_story": "American prosecutors, relying on FBI investigations, alleged in the court filings that Stimler as well as other local and international oil brokers paid bribes to Alison-Madueke in exchange for oil contracts under favourable terms.\nAlison-Madueke was believed to have sunk the bribes into Mr Jonathan’s reelection campaign, the charges said.\nAlison-Madueke has since been identified by multiple sources including Bloomberg as the ‘Foreign Official 1’ referenced in the document.\nNNPC under Alison-Madueke was also accused of receiving $200,000 on oil cargoes $50,000 around April 2015 that were slated to be delivered at the end of the year.\nAlthough Buhari maintained his so-called incorruptibility, his office has yet to deny the U.S. bribery charges."
  },
  {
    "headline": "Family Laments As Ex-Nigerian Senator, Effiong Spends Three Weeks In Kidnappers’ Den",
    "summarized_story": "The family of a former senator from Akwa Ibom State, Nelson Effiong, has cried out that the ex-lawmaker is still in the captivity of his abductors, having spent 22 days.\nIt was learnt that the assailants drove into his premises in a Toyota Camry car and shot sporadically into the air, scaring away people before carting the former senator away.\nThere were rumours earlier in the state that the victim had regained his freedom after his family paid the ransom demanded by the kidnappers.\nReacting, the Police Public Relations Officer, Odiko Macedon, said the command was not aware of any information about his release.\nI don’t report on unofficial channels like I keep saying, so I cannot talk about it."
  },
  {
    "headline": "FG: Passports of over 2,000 travellers suspended for violating COVID protocol",
    "summarized_story": "The federal government says it has suspended the passports of more than 2,000 in-bound travellers for violating the COVID protocol.\nAccording to Mohammed, surveillance systems have been improved at airports, seaports, and land borders, and travellers found to have violated the protocol have been “penalised”.\nWe have identified certain countries that are very high risk, and provided some level of restriction for passengers arriving from these countries.\nAnd we have gone ahead to ensure that their passports are suspended.\nIn May, the federal government had released the names of some passengers who were accused of violating the COVID protocol."
  },
  {
    "headline": "FG: Passports of over 2,000 travellers suspended for violating COVID protocol",
    "summarized_story": "The federal government says it has suspended the passports of more than 2,000 in-bound travellers for violating the COVID protocol.\nAccording to Mohammed, surveillance systems have been improved at airports, seaports, and land borders, and travellers found to have violated the protocol have been “penalised”.\nWe have identified certain countries that are very high risk, and provided some level of restriction for passengers arriving from these countries.\nAnd we have gone ahead to ensure that their passports are suspended.\nIn May, the federal government had released the names of some passengers who were accused of violating the COVID protocol."
  },
  {
    "headline": "Osinbajo: If Nigeria breaks up, all of us will lose out",
    "summarized_story": "Vice-President Yemi Osinbajo says Nigerians will be at a disadvantage if the country breaks up.\nAdvertisementHe said this on Monday, when he received the national executive of the Nigeria Union of Journalists (NUJ), at the presidential villa in Abuja.\nThe NUJ national executive was led to the presidential villa by Chris Isiguzo, president of the union.\nHe also urged the federal government to support the media industry with “bailout fund”, in order to prevent job losses.\nAlso present at the meeting were Mukhtar Gidado, NUJ deputy president; Shuaibu Leman, NUJ national secretary; Ladi Bala, president of the National Association of Women Journalists (NAWOJ); Emmanuel Ogbeche, NUJ FCT chairman, among others."
  },
  {
    "headline": "Osinbajo: If Nigeria breaks up, all of us will lose out",
    "summarized_story": "Vice-President Yemi Osinbajo says Nigerians will be at a disadvantage if the country breaks up.\nAdvertisementHe said this on Monday, when he received the national executive of the Nigeria Union of Journalists (NUJ), at the presidential villa in Abuja.\nThe NUJ national executive was led to the presidential villa by Chris Isiguzo, president of the union.\nHe also urged the federal government to support the media industry with “bailout fund”, in order to prevent job losses.\nAlso present at the meeting were Mukhtar Gidado, NUJ deputy president; Shuaibu Leman, NUJ national secretary; Ladi Bala, president of the National Association of Women Journalists (NAWOJ); Emmanuel Ogbeche, NUJ FCT chairman, among others."
  },
  {
    "headline": "INEC: Anambra guber poll will hold as scheduled — security measures are being put in place",
    "summarized_story": "The Independent National Electoral Commission (INEC) says security measures are being put in place to ensure that the Anambra governorship election holds as scheduled.\nThe September 19 incident was the third attack involving INEC offices in Enugu since January.\n“The inter-agency consultative committee on election security (ICCES) is the platform where INEC meets with all security agencies to discuss security matters and evaluate threats.\nThe report of such assessment is then compared with the equivalent report provided by the security agencies.\nAdvertisement“To be sure, the Anambra governorship election will hold as scheduled."
  },
  {
    "headline": "The Next Wave: Netflix’s long game in Africa",
    "summarized_story": "My first thought was that Damilare’s sign up was an indication that Netflix’s content strategy is making a difference.\nTo take a step further, there’s an army of people whose mantra is free content or nothing.\nAnswered prayersThis realization is most likely what influenced Netflix’s decision to introduce a free plan in Kenya this week.\nAlthough there are questions around whether the internet plan is being subsidized by multichoice and how long they can continue doing this, it’s a clever customer acquisition strategy.\nFor IROKOtv, a streaming service for Nollywood, it’s betting on international markets since Africa hasn’t provided the financial comfort it’s looking for."
  },
  {
    "headline": "ChatBots Africa, Fashtracker win pitch sessions at TechCabal’s ‘Future of Commerce’",
    "summarized_story": "ChatBots Africa and Fashtracker have been announced as winners of the partnership and investment pitch sessions, respectively, organised by TechCabal as part of the ‘Future of Commerce’ conference.\nHeld on Friday, 24th of September, the partnership pitch session saw a total of three growth-stage startups pitch to corporate organizations for potential partnerships while the investment version involved four early-stage startups pitching to potential investors.\n“For my team and I, winning at the pitching session validates our vision for the future of e-commerce in Africa, that is, conversational and social commerce,” Ronald Tagoe, Founder of ChatBots Africa, told TechCabal.\nNigeria-based Fashtracker connects trusted and sustainable African fashion brands to people within and outside the continent through its online platform.\n“Especially during such tough times in Nigeria – economic prosperity is key.”A screenshot of ChatBots Africa website."
  },
  {
    "headline": "What will commerce look like in Africa over the next decade?",
    "summarized_story": "With Covid-19 restrictions forcing more people to shop online, e-commerce companies and platforms on the continent have enjoyed a surge in activity.\nThis is provided e-commerce platforms continue to solve problems consumers face and offer more suites of offerings.\nAccording to Nkebet Mesele, Senior Director for Solutions Management in sub-Saharan Africa at Visa, that entails making commerce in Africa “mobile-led”.\n“For commerce to grow across Africa, the building blocks that have to be in place are first, it has to be mobile-led.\n“But it starts with building solutions for people on the ground.”If you enjoyed reading this article, please share it in your WhatsApp groups and Telegram channels."
  },
  {
    "headline": "Phishing scams are becoming more prevalent in African countries",
    "summarized_story": "Phishing is one of the oldest internet scams, dating back to the ‘90s, and perhaps remains one of the most prevalent cybercrimes.\nBut one thing phishing emails have in common with other forms of cyberattack is that every phishing email comes with a call to action that prompts recipients to download a link or file.\nPhishing attacks are prevalent in the continents and individuals and businesses across Africa have fallen victims to phishing scams.\nOver a million phishing attacks were recorded in South Africa in the first half of 2021.\nThat’s a combination of over two million attacks in the first half of the year from the three biggest African markets."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "Twitter's New Tipping Feature Could Make Spending Bitcoin Attractive • Techpoint Africa",
    "summarized_story": "According to a Twitter blog post, Twitter users can send and receive Bitcoin through Strike, a wallet built on the Bitcoin Lightning Network.\nTwitter’s move to enable Bitcoin tipping through a wallet that uses the Lightning Network will speed up Bitcoin transfers.\nWhat is the Bitcoin Lightning Network?\nBitcoin’s Lightning Network is a route that eases Bitcoin transactions — off-chain — outside the Bitcoin network.\nSpeaking about this, Mallers says, “You can send and make Bitcoin payments with dollars and receive Bitcoin payments as dollars.”Founder and CEO of MicroStrategy, a business intelligence and software company, Micheal Saylor, dubbed the technology the future of global payments."
  },
  {
    "headline": "Edtech for university students, Twitter and Bitcoin, some 5G news",
    "summarized_story": "Share this article:Good day,Today I’m discussing:Stranerd’s plans for university studentsTwitter’s Bitcoin plansSome news about Nigeria’s 5G sceneStranerd’s plans for university studentsStranerd’s co-founders.\nWhat started as an Instagram page solving problems for students has since evolved into a platform connecting Nigerian students to tutors and their peers.\nCheck out How edtech startup, Stranerd is connecting Nigerian students to tutorsTwitter’s new feature, TipOn Thursday, September 23, 2021, Twitter announced Tip, a feature that will allow users to tip their favourite creators directly from Twitter.\nCatching up on the latest 5G newsPhoto by <a href=”https://unsplash.com/@macauphotoagency”>Macau Photo Agency</a> on <a href=”https://unsplash.com/s/photos/5g?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText”>Unsplash</a>In the last few weeks, Nigeria’s 5G deployment seems to have gained some traction.\nMeanwhile, you can check out 4 things we learnt from MTN Nigeria’s 5G demoCatch up on these storiesWhat I’m reading/watchingGig work is precarious no matter the country."
  },
  {
    "headline": "How edtech startup, Stranerd is connecting Nigerian students to tutors",
    "summarized_story": "On the supply side, there are more students or prospective students than there are schools.\nSource: SuppliedOn the website, which currently serves mainly Nigerian students, the startup employs a coin system to charge students.\nThe goal, Godwin says, is to become a one-stop-shop for the Nigerian student’s educational needs and possibly African students also.\nThey also want to include connecting students to internships as well as providing study-abroad services to students.\nBut first, the startup plans to build trust among the students before leveraging it to add more services."
  },
  {
    "headline": "Nigeria’s unending ‘war’",
    "summarized_story": "It was in December 2015, some seven months after he became president that Buhari announced that Nigeria had “technically won the war” against the Islamist Boko Haram militants.\nHowever, throughout Yusuf’s tenure as the group’s leader, Boko Haram sought to achieve its aims largely through peaceful means.\nThe UNDP says that nearly 350,000 people have been killed in the North-East since the insurgency against the Nigerian state began.\nThe first task is to defeat Boko Haram and I want to tell you that as of today Boko Haram has been defeated.\nInformation minister, Lai Mohammed, in 2019 said, “I stand by what I said that Boko Haram is technically defeated."
  },
  {
    "headline": "Nigeria’s unending ‘war’",
    "summarized_story": "It was in December 2015, some seven months after he became president that Buhari announced that Nigeria had “technically won the war” against the Islamist Boko Haram militants.\nHowever, throughout Yusuf’s tenure as the group’s leader, Boko Haram sought to achieve its aims largely through peaceful means.\nThe UNDP says that nearly 350,000 people have been killed in the North-East since the insurgency against the Nigerian state began.\nThe first task is to defeat Boko Haram and I want to tell you that as of today Boko Haram has been defeated.\nInformation minister, Lai Mohammed, in 2019 said, “I stand by what I said that Boko Haram is technically defeated."
  },
  {
    "headline": "Insecurity costs Nigeria $40.6bn worth of investments in 1 year",
    "summarized_story": "Over $40.6 billion worth of foreign investments were diverted from the Nigerian economy in 2020 alone as a result of insecurity.\nNigeria is currently grappling with security challenges ranging from farmer/herder clashes, cattle rustling, banditry, kidnapping and Boko Haram insurgency.\nThe terrorist group has caused massive destruction across northern Nigeria in the last decade.\nRecently, the state has been ravaged by a deadly conflict between the military and the Boko Haram jihadists.\nThe persistent issue of insecurity in Nigeria has been fingered as a major reason behind foreign investors pulling out their investments from the country."
  },
  {
    "headline": "Edo real estate sector gets boost, as six firms strike deal to develop Emotan Gardens Phase II – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State real estate sector has gotten a major boost, as six firms have inked deals with the Edo Property and Development Agency (EDPA) to develop Emotan Gardens Phase II.\nExecutive Chairman, EDPA, Isoken Omo, in a statement, said the six shortlisted developers have been allocated five hectares each to commence the development of affordable housing targeted at the general public.\nShe said the Development Agreement Signing ceremony and site handover will take place on Tuesday, September 28, 2021.\nThe houses have been repaired and are due for handover to the owners.\nThe intention is that once each of the developers completes the development of their Lot, another Lot will be allocated to them."
  },
  {
    "headline": "Former NAWOJ Chair Bags Honourary Doctorate Award – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Formal chairperson of Nigerian Association of Women Journalist (NAWOJ), Edo State Chapter Mrs. Amina Ebor has been awarded honorary doctorate degree from Bible Impart University (BIU) USA, Nigeria Satellite Campus last weekend in Benin City.\nWhile responding to the honour accorded her, Mrs. Ebor described the award as a divine honour to her.\nShe dedicated the award to ” God Almighty and my fellow journalists in Edo State”.\nAccording to the VC ” The University vision is to create a model theological university that is poised to compete with the best in the world”.\nOther honorary doctorate awardees at the ceremony were HRM."
  },
  {
    "headline": "Edo Culture Comes Alive In UK – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…as Children Of Edo Music Legends Thrill FansBENIN CITY – Edo rich cultural heritage and legendary music prowess was again on display in major cities of the United Kingdom as children of Edo music legends thrill fans with old indigenous songs of yesteryears.\nThe show also X-rayed Edo social cultural deposition and unity, organized by Osarobo Dickson Igbinosun, the CEO of 24Bits family and Esohe Ltd UK, saw fans in Birmingham, Glasgow, Leeds, London and Manchester, thrilled with melodious old Edo songs, while the world watched with pride.\nThe initiators and promoter of the concert who is also the producer of the Edo national anthem said the 24bits showdown will continue to expand Edo social cultural heritage.\nThe Project manager, Kayce Glamour, said the concert, was designed to promote the hard work and creativity of Edo music legends.\n“While we await further events in this direction, EDONIOMSE and EDO MUSIC LEGENDS CELEBRATION will also expand this lofty project in the next few months, by December and January respectively ."
  },
  {
    "headline": "COVID-19 3rd wave: Edo intensifies vaccination exercise, records declining infections – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…urges full dose vaccination to reduce fatalitiesBENIN CITY – Edo is recording a gradual reduction in the number of COVID-19 infections following ongoing massive vaccination of residents across the 18 local government councils of the state, as the government urges more citizens to get vaccinated in order to reduce the mortality rate and prevent a new wave of the pandemic.\nThe State COVID-19 Incident Manager, Dr. Andrew Obi, said this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the State Governor, Mr. Godwin Obaseki.\nObi said the state, in the last 72 hours, recorded 43 new cases, which represents 7.1 percent of the 606 samples collected and tested within the 72-hour timeframe.\nNoting that Edo was recording remarkable success in the management of the third wave of the pandemic in the state, the Incident Manager attributed the success to the nuanced strategy deployed by the Governor Godwin Obaseki-led administration in ensuring the vaccination of majority of Edo citizens against the deadly virus.\nAccording to him, “With the massive vaccination of residents across all communities in the state, we are beginning to record a slight drop in number of infections and COVID-19 complications, as the state, in the last 72 hours, recorded 43 new cases from the 606 samples collected, with 150 recoveries."
  },
  {
    "headline": "West Africa records 9,464 deaths so far from COVID-19 – WAHO",
    "summarized_story": "The Director General, West African Health Organisation (WAHO), Stanley Okolo, says 9,464 persons had died so far in the West African subregion from COVID-19 infection.\nHe also said 644,521 cases of Coronavirus (COVID-19) have been recorded in West Africa cumulatively.\nMr Okolo said this on Monday in Enugu during the 2022 Programmes Committee Meeting of WAHO.\nMr Okolo said that the organisation had been at the forefront of the regional pandemic response since the outbreak of the pandemic in West Africa in February 2020.\nThe News Agency of Nigeria (NAN) reports that WAHO is the health institution of the Economic Community of West African States (ECOWAS)."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "CBN’s e-naira portal records over 1m visits hours after going live ahead of October 1 launch",
    "summarized_story": "The e-naira portal, www e-naira.com, activated by the Central Bank of Nigeria (CBN) on Monday ahead of the official launch of the digital currency on October 1, has already recorded over one million hits hours after activation.\nThe CBN had earlier on Monday activated the e-naira portal ahead of the official launch, though the platform is not yet functional as no transactions have been allowed on it for now.\nHe also confirmed that although the platform has gone live, no transactions are permitted on it until the official launch on October 1, 2021.\nA cursory look at the website by our correspondent shows that only information on the workability of the e-naira platform is on the website.\nHowever, visitors are told to download the app on the app stores on Android and iOS."
  },
  {
    "headline": "Northern governors reject rotational presidency, say it’s unconstitutional",
    "summarized_story": "OBINNA EZUGWUGovernors of the 19 states of Northern Nigeria, have rejected the idea of rotational presidency, insisting that it is unconstitutional.\nArising from an emergency meeting with northern traditional rulers at the Sir Kashim Ibrahim House, Kaduna, on Monday, the Northern Governors Forum said though some Northern States Governors had earlier expressed views for a power-shift to three Geo-Political Zone in the South, with a view to promoting unity and peace in the nation, the statement by the Southern Governors Forum that the Presidency must go to the South is unacceptable.\nThe governors also deliberated on the controversy on the collection of Value Added Tax (VAT) on which Lagos and Rivers States have made laws and also opposed the position of their southern counterparts.\n“Rivers and Lagos State Governments had enacted their own VAT laws and the Southern Governors Forum have expressed support for this course of action;“VAT is being confused by these State Government as a sales tax.\nVAT is not a production tax like excise, but terminal tax which is paid by the ultimate consumer;“Another confusion is ignoring observation above and its ‘overall effect’."
  },
  {
    "headline": "Nigerian Army says troops killed scores of terrorists who attacked its base in Sokoto",
    "summarized_story": "The Nigerian Army has said troops eliminated scores of terrorists who attacked the Sokoto military base.\nAccording to him, the attack, which took place around 5:30 am, September 26, 2021, in the remote border settlement with Niger Republic, was swiftly repelled by troops.\n“The failed attack, which took place at about 5:30 am, 26 September 2021, in the remote border settlement with Niger Republic was swiftly repelled by troops.\n“Unfortunately, there were some level of casualty recorded on the part of own troops during the encounter.\n“Meanwhile, Nigerian and Nigerien forces in a collaborative operation are currently trailing the remaining ISWAP fighters."
  },
  {
    "headline": "Names of 20 participants in Gulder Ultimate Search revealed",
    "summarized_story": "Twenty contestants in this year’s Gulder Ultimate Search have been unveiled by the organisers.\nThe 20 contestants were selected from the 20,000 applicants with regional screenings in Abuja, Enugu, and Lagos.\nOut of the 20 contestants unveiled for the 2021 Gulder Ultimate Search, only 16 have made it to the jungle, while the others will serve as wildcards on the show, according an information by actor, Gideon Okeke, who is the host of the show.\nThe four contestants that are placed on wildcards are Samson Abah, Odudu Otu, Shalom Omoikhudu, and Osasere Ogbanile.\nMeanwhile, Okeke noted that although four contestants have been placed as wildcards, one of them would be returned based on the viewers’ votes."
  },
  {
    "headline": "Secrecy In Govt Undermining Access To Information – NGE",
    "summarized_story": "It said the open contracting portal will require more frequent updates and that the state should fully integrate e-procurement systems to improve the open contracting portal’s functionality.\n3 of 2021, among others, were previously enacted to support fiscal transparency.\nThe budget document as well as the citizens’ budget are publicly available on the State’s official website and that of the budget office.\nIt revealed that there are bureaucrats who are ready to drive the implementation of fiscal transparency but are often hampered by influences from the political class.\nShe said the Open State Ranking is an initiative PPDC utilises to improve state fiscal transparency and hold the government accountable."
  },
  {
    "headline": "Secrecy In Govt Undermining Access To Information – NGE",
    "summarized_story": "It said the open contracting portal will require more frequent updates and that the state should fully integrate e-procurement systems to improve the open contracting portal’s functionality.\n3 of 2021, among others, were previously enacted to support fiscal transparency.\nThe budget document as well as the citizens’ budget are publicly available on the State’s official website and that of the budget office.\nIt revealed that there are bureaucrats who are ready to drive the implementation of fiscal transparency but are often hampered by influences from the political class.\nShe said the Open State Ranking is an initiative PPDC utilises to improve state fiscal transparency and hold the government accountable."
  },
  {
    "headline": "Brent Crude Nears $80 As Supply Tightens Across Regions",
    "summarized_story": "Oil prices rose for a fifth straight day yesterday with Brent heading for $80 amid supply concerns as parts of the world see demand pick up with the easing of pandemic conditions.\nBrent crude was up $1.14 or 1.5 per cent at $79.23 a barrel having risen a third consecutive week through Friday.\nUnited States oil added $1.11 or 1.5 per cent to $75.09, the highest since July after rising for a fifth straight week last week.\n“Supply tightness continues to draw on inventories across all regions,” ANZ Research said in a note.\nRising gas prices are also helping drive oil higher as the liquid becomes relatively cheaper for power generation, ANZ analysts added."
  },
  {
    "headline": "Brent Crude Nears $80 As Supply Tightens Across Regions",
    "summarized_story": "Oil prices rose for a fifth straight day yesterday with Brent heading for $80 amid supply concerns as parts of the world see demand pick up with the easing of pandemic conditions.\nBrent crude was up $1.14 or 1.5 per cent at $79.23 a barrel having risen a third consecutive week through Friday.\nUnited States oil added $1.11 or 1.5 per cent to $75.09, the highest since July after rising for a fifth straight week last week.\n“Supply tightness continues to draw on inventories across all regions,” ANZ Research said in a note.\nRising gas prices are also helping drive oil higher as the liquid becomes relatively cheaper for power generation, ANZ analysts added."
  },
  {
    "headline": "FAAN Shuts Kebbi Airport Over N33m Debt",
    "summarized_story": "Federal Airports Authority of Nigeria (FAAN) has concluded plans to close down the Kebbi State-owned airport over debt owed the organisation.\nLEADERSHIP investigation revealed that arrangement has finalised by the Nigerian Airspace Management Agency (NAMA) including issuing notice to air men (NOTAM) of all airlines from flying into the airport as from midnight Monday, 27th September, 2021, when FAAN is expected to withdraw its services at the airport.\nAccording to a source in FAAN, from 12 midnight Monday, FAAN will withdraw all its fire service and security personnel from the airport.\nThe source further disclosed that the Kebbi State government has been owing FAAN over N33m and has refused to pay since January 2021, despite series of letters to the state government.\nThe source further said that similar scenario occurred in 2019 when the state government rushed to pay after FAAN threatened to close the same Kebbi airport over N53m debt."
  },
  {
    "headline": "Again, gunmen kill APC member, vigilance members in Anambra",
    "summarized_story": "Gunmen have killed a member of the All Progressives Congress (APC) and injured many others in Anambra State.\nTwo other persons said to be vigilance members were killed while three vehicles were set ablaze at Afor -Nnobi, Idemili South local government area same time.\nThe Nation gathered that one of the vehicles burnt by the hoodlums belonged to Dr Nelson Omenugha, the son of Anambra Commissioner for Basic Education, Prof Kate Omenugha.\nThe young man is a major campaigner of All Progressives Grand Alliance (APGA) governorship candidate, Prof Chukwuma SoludoAlso, two other vehicles were set ablaze by the unidentified persons ,who Nation gathered were operating with Sienna vehicles.\nNationShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Again, gunmen kill APC member, vigilance members in Anambra",
    "summarized_story": "Gunmen have killed a member of the All Progressives Congress (APC) and injured many others in Anambra State.\nTwo other persons said to be vigilance members were killed while three vehicles were set ablaze at Afor -Nnobi, Idemili South local government area same time.\nThe Nation gathered that one of the vehicles burnt by the hoodlums belonged to Dr Nelson Omenugha, the son of Anambra Commissioner for Basic Education, Prof Kate Omenugha.\nThe young man is a major campaigner of All Progressives Grand Alliance (APGA) governorship candidate, Prof Chukwuma SoludoAlso, two other vehicles were set ablaze by the unidentified persons ,who Nation gathered were operating with Sienna vehicles.\nNationShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "More drama as Pere, Angel return to Big Brother’s House for finals",
    "summarized_story": "Big Brother has asked housemates Pere and Angel to return to the house to compete for the final slot after both housemates performed well in the game that was set up.\nRecall that in a twist on Sunday, Big Brother carried out a fake eviction on Pere and Angel, a move believed to spice up the show, leaving both housemates to battle for the soul of the final slot for the grand finale of this season’s shine ya eye gameShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Anambra poll: Two killed, many injured as gunmen attack APC, APGA campaigners",
    "summarized_story": "Gunmen have gone on rampage on two locations in Anambra State, killing two persons and wounding many at APC rally, and setting ablaze a car belonging to a leader of Professor Chukwuma Soludo group.\nWhile the attack on APC took place during the party’s rally at Uruagu, Nnewi, the attack on the leader of one of Soludo Support Groups, Dr. Nnelsonn Omenugha took place at Nnobi in Idemili South local government area of the state.\nIt was gathered that one APC member, whose identity could not be immediately ascertained was killed in the attack with scores wounded, while the attack on the APGA chieftain took place in his hometown, Nnobi.\nAlthough the police were yet to react on the two incidents, the state publicity secretary, of APC, Mr. Okelo Madukaife confirmed the attack.\n“We acknowledge security in Anambra State as an area that requires serious intervention”."
  },
  {
    "headline": "Afenifere to NYSC: Allow corps members serve in home states over insecurity",
    "summarized_story": "Pan Yoruba socio-political group, Afenifere, has urged the National Youth Service Corps to allow corps members to serve in their respective home states till security agencies stop the menacing spate of kidnapping and the insecurity in the country.\n), to do all that he said to world leaders at the 76th United Nations General Assembly in New York last week.\nThe NYSC later in a statement denied giving the advice, even when each corps member has the handbook.\nStudents have been the most affected by the menacing activities of the unscrupulous elements; and parents of prospective corps members kicking against the posting of their wards to bandits-ravaged states.\nAside from the kidnapping of students and corpers, hundreds of Nigerians have also fallen victims to kidnappers in recent times."
  },
  {
    "headline": "2,000 Nigerians banned from traveling abroad for evading COVID-19 tests",
    "summarized_story": "By Abujah RachealThe Presidential Steering Committee (PSC) on COVID-19 has banned over 2,000 Nigerians and foreigners from traveling abroad and into the country for one year for evading the Coronavirus Polymerase Chain Reaction (PCR) test at the country’s international airports.\nThe National Incident Manager (NIM) of the Presidential Steering Committee (PSC), Mukhtar Muhammad, disclosed this at its briefing on Monday, in Abuja.\n“Let me assure you that so far we have published the list of over 2,000 people who evaded quarantine in our health facilities.\nAnd we have gone ahead to ensure that their passports are suspended, so, for every action there are consequences,” he said.\nThe PSC had previously also published names and passport numbers of defaulters."
  },
  {
    "headline": "U.S. judge set to release Hinckley the attempted killer of Reagan",
    "summarized_story": "John Hinckley, the man who attempted to assassinate former U.S. President Ronald Reagan and three other people in 1981, will get unconditional release soon.\n“I am going to, after all these years, grant unconditional release to Mr. Hinckley,” U.S. District Judge Paul Friedman said during a court hearing in the District of Columbia.\nIn 2016, Friedman allowed Hinckley to move out of a Washington psychiatric hospital, where he had lived for three decades, but imposed restrictions on his travel and internet usage.\nA federal prosecutor, Kacie Weston, said during the court hearing that the U.S. Justice Department agreed Hinckley should be given unconditional release.\nOthers wounded included White House press secretary James Brady, Secret Service agent Timothy McCarthy and Washington police officer Thomas Delahanty."
  },
  {
    "headline": "Tinubu Campaign Posters Emerge In London [Photos & Video]",
    "summarized_story": "Asiwaju Bola Tinubu, the head of the All Progressives Congress, has initiated a publicity blitz in London for his presidential candidacy in 2023.\nIn a viral video, shared by Arise TV on Monday, images of the APC leader, who is recuperating in London, were on display at some train stations.\nThe advertisements, according to some, are also on display at Heathrow Airport.\nSome of the messages in the advert blitz read: “Asiwaju for 2023′, “Call to Serve, Let’s Go”, “Asiwaju the right man for the job”, “Yes We can”, “Asiwaju Ready to serve”.\nIn recent months, there have emerged many groups campaigning for Tinubu, on the suspicion that he will soon officially declare his interest in succeeding Buhari in 2023."
  },
  {
    "headline": "BREAKING: One Dead, 17 Rescued As Boat Capsizes In Lagos",
    "summarized_story": "A passenger boat from Lagos Island sailing to Ikorodu capsized around Adekunle Jetty with 17 passengers and one casualty has been recorded.\nNewsDirect confirms that 17 were rescued alive while one was found dead.\nThe boat is said to have hit a rock while sailing close to edge of the water way."
  },
  {
    "headline": "Fuel Scarcity Looms As Tanker Drivers Plan Strike Over Poor Roads, Safety",
    "summarized_story": "The union said, after deliberating on these important safety issues, the Council resolved to resume the suspended action on 1st May 2021.\nThe first issue the union raised was about the deplorable and unmanageable state of roads.\n“Our members are losing their lives and sources of livelihood on an hourly basis,” the union lamented.\nIt also blamed the federal government for not enforcing the installation of petroleum trucks safety valves since they harped on it in March this year.\nThe union was also concerned about the abuse of tonnage capacity by marketers and transporters which it said is affecting the safety of drivers and the durability of highways."
  },
  {
    "headline": "BREAKING: Rotational presidency unconstitutional – Northern Governors reply Southern counterparts",
    "summarized_story": "Governors of the 19 northern states have described as unconstitutional, the position of their Southern counterparts that the country’s next President must come from their region.\nAt a meeting in Lagos in July, Southern Governors had demanded that power must shift to their region.\nHowever, arising from an emergency meeting with northern traditional rulers at the Sir Kashim Ibrahim House, Kaduna, on Monday, the Northern Governors Forum said though some Northern States Governors had earlier expressed views for a power-shift to three Geo-Political Zone in the South, with a view to promoting unity and peace in the nation, the statement by the Southern Governors Forum that the Presidency must go to the South is unacceptable.\nReading from the resolutions of the meeting, Plateau State Governor and Chairman of the Forum, Simon Bako Lalong, said: “The statement is quite contradictory with the provision of the Constitution of the Federal Republic of Nigeria (1999) as amended that the elected President shall secure at least 25 percent of the votes cast in 2/3 states of the federation.\nIn the case of run-up simple majority win the election.”"
  },
  {
    "headline": "2023: Real reason Northern govs rejected power shift to the South",
    "summarized_story": "The debate around the zoning of the presidency ahead of the 2023 elections continued Monday with the Northern States Governors’ Forum (NSGF) condemning their southern counterparts over their stance on power shift.\n“Notwithstanding their comments, the Forum unanimously condemns the statement by the Southern Governors Forum that the Presidency must go to the South.\n“Rivers and Lagos State Government had enacted their VAT laws and the Southern Governors Forum has expressed support for this course of action.\n“Until and unless the Supreme Court pronounces judgement on the substantive matter between Rivers State and Federal Government, the matter is subjudice and the Northern States Governors’ Forum would respect this,” they said.\nOn security, the Forum observed the need for a sustained synergy and coordinated efforts between the federal and northern state governments while noting the success of recent measures."
  },
  {
    "headline": "Gunmen on rampage in Anambra, attack APC, APGA campaigners, kill two",
    "summarized_story": "At least, two men were killed at different locations in Anambra state between last Saturday and Sunday as gunmen attacked campaigners of the All Progressives Congress (APC), All Progressive Grand Alliance (APGA) and others respectively.\nThe APC Anambra state Publicity Secretary, Mr Okelo Madukaife, who confirmed the report of an attack on the party faithful, stated that it occured at Uruagu Ward 3, adding that some of their members were equally injured and currently receiving medical attention.\nThe victims were rushed to the hospital and later confirmed dead by a medical doctor on duty.\nThey were later identified as one Johnbosco Ojokwu ‘M’ 33yrs, Rapuluchukwu Ugoeze ‘M’ 30yrs and Chukwuemeka Nwokebagu ‘M’ 31yrs.\nOn attack at Nnewi APC rally, the PPRO said, “The Commissioner of Police, Anambra State Command CP Tony Olofu has ordered investigation into a shooting incident at Uruagu Community, Nnewi on 26/09/2021."
  },
  {
    "headline": "Banditry, kidnapping, others: FCT communities take to self-defence",
    "summarized_story": "Amidst growing insecurity and widespread cases of kidnapping in the Federal Capital Territory (FCT) Abuja, residents have resorted to self-help by forming vigilante groups across the six area councils to ward off armed bandits and kidnappers.\n“So forming vigilante groups to checkmate the activities of these vagrant criminals required little persuasion of residents who cherished their safety and peace,” he said.\nThe monarch said, in collaboration with the special police taskforce approved by the Zuba Divisional Police command, the vigilante groups in Tunga-Maje have drastically reduced incidences of kidnappings and banditry in recent times.\nAlso, residents make monthly contributions ranging from N500 to N2000 per house to pay for the services of the vigilante groups.\n“Yes, communities are very concerned about the growing activities of bandits and kidnappers that have traumatized the citizens."
  },
  {
    "headline": "Usyk delivers Joshua’s belts back after defeat -NigPilot",
    "summarized_story": "Usyk will be delivered a fresh set of WBO, WBA, IBF and IBO belts following his victory.\nHowever, the 34-year-old was seen returning his new collection of belts to Joshua in the aftermath of his superb performance.\nA video uploaded to Twitter showed Usyk entering AJ’s dressing room with the four belts, and Joshua can be heard saying ‘thank you’ and ‘see you soon’.\nDespite losing out to Usyk on Saturday night, Joshua is able to keep his belts as a former champion, while the Ukrainian will be sent a set of fresh ones.\n‘The road to undisputed is a nice title to have and a nice title to chase."
  },
  {
    "headline": "Soldiers kill two Boko Haram terrorists in Yobe -NigPilot",
    "summarized_story": "It also explained that owing to the logistics blockade imposed on the insurgents, the criminals now desperately indulge in pillaging activities in order to replenish their dwindling logistics.\n‘The troops have been commended by the Chief of Army Staff, Lt Gen Faruk Yahaya for their doggedness in expeditiously conducting the counter attack.\nThe COAS also encouraged them to remain resolute in the ongoing operations against the insurgents”.\nThe statement enjoined law-abiding people of Yobe State and the North East in general to remain assured of troops’ determination to rout the Boko Haram/Islamic State West Africa Province terrorists from their hideouts.\nGeneral Nwachukwu concluded by encouraging the public to continue to avail troops with actionable information that would enhance execution of ongoing Counter Terrorism Counter Insurgency operations in the region."
  },
  {
    "headline": "MPB to verify pensioners electronically -NigPilot",
    "summarized_story": "The Military Pension Board has concluded plans to transmute from the hitherto manual verification of all military pensioners to a more secured and user-friendly electronic verification.\nHence, my quest to build additional accommodation blocks for officers and non-commissioned officers of the Board.\nIn his remarks, the Special Guest of Honour and Chief of Naval Staff, Vice Admiral Zubairu Gambo, commended the plan to transmute to electronic verification for pensioners, noting that it will eliminate menace of pensioners.\nAccording to him, “permit me to state that the plan by the MPB to embark on electronic verification of military pensioners to replace the manual system is a laudable initiative.\nIt is envisaged that the Electronic Verification of military pensioners would resolve the challenges experienced in the existing manual system."
  },
  {
    "headline": "Minister urges LGAs to create strategies on revenue generation -NigPilot",
    "summarized_story": "The Honourable Minister of Industry, Trade and Investment, His Excellency, Otunba Adeniyi Adebayo , has urged Local Government Authorities to begin to create and formulate strategies to improve their revenue base so as to reduce its over-dependence on L.G share of Federation Allocation.\nThis, the minister insisted, will act as a means of repositioning the LGAs towards having a better mindset of fostering the economic development of its citizenry and poverty reduction in the respective communities.\nThe minister noted this while delivering his welcoming address at the opening ceremony of Nigeria at 60: Association of Local Governments of Nigeria ALGON , Exhibition/Trade Fair on Monday, in Abuja.\nAlso speaking was Secretary to the Government of the Federation, Boss Mustapha, who was represented by Mr Ariyo Benjamin.\nD.G who explained that ALGON is one family and everyone must set aside their differences and work together."
  },
  {
    "headline": "‘Zoning Is Unconstitutional,’ Northern Governors Oppose Power Shift To South",
    "summarized_story": "﻿Governors of the 19 states in the North have opposed the call by their southern counterparts that the Presidency should be zoned to the South in 2023.\nAccording to the governors, zoning the office of the President as being agitated by southern governors is against the provisions of the 1999 Constitution, as amended.\nGovernor Lalong noted that although some northern governors had endorsed power shift to the South, the regional governors collectively condemned such calls.\nThe northern governors, Lalong said, are aware that the case is before the court, and it will amount to sub-judice to take a decision on the matter.\nOn the security of the region, the northern governors commended the ongoing military onslaught against bandits and insurgents in parts of the North."
  },
  {
    "headline": "Insecurity: 34 Killed, Seven Injured In Fresh Kaduna Attack",
    "summarized_story": "No fewer than 34 people have been killed following a fresh attack by gunmen on Madami village in Kaura Local Government Area of Kaduna State.\nSeven other persons sustained injuries in the attack while some houses were also set ablaze during the operation which occurred on Sunday night.\nThe commissioner disclosed that two suspects are being questioned in connection with the attack, adding that security agencies are already conducting operations in the general area.\nThe governor, however, appealed for calm and charged security agencies to intensify their efforts in the campaign against the gratuitous killing of innocent citizens.\nHe further tasked security agencies to ensure urgent and precise investigations into the horrific incident."
  },
  {
    "headline": "Villagers Flee As Boko Haram Attacks Yobe Community",
    "summarized_story": "Suspected Boko Haram insurgents on Sunday attacked Babbangida in Yobe State.\nThe incident, which caused many of the villagers to flee, is coming one month after the terrorists launched an assault on the community.\nSunday’s incident is one of the many attacks on communities in the North East state which has continued to suffer from onslaughts by Boko Haram terrorists.\nRELATED: [Boko Haram] 11 Questions Trailing Amnesty For ‘Repentant’ TerroristsYobe is not the only state suffering from the insurgents’ attack.\nHe put the number of the surrendered insurgents at 335 fighters, 746 women and children including one of the abducted Chibok girls."
  },
  {
    "headline": "Bandits Hit Sokoto Military Base, Kill Many",
    "summarized_story": "Bandits have attacked a joint military camp in Sabon Birni Local Government Area of Sokoto State.\nThe Sokoto State Commissioner for Carriers and Security Matters, Colonel Garba Moyi (rtd) confirmed the attack but was not sure of the number of casualties.\nResidents of the area and security sources told Channels Television that the gunmen attacked the base, codenamed “Burkusuma Camp”, in the early hours of Sunday, killing an unknown number of military personnel.\nThe military source could not confirm if the said camp is the same with the Burkusuma camp in Sabo Birni Local Government Area.\nHe said over 10 trucks conveying armed military personnel are in the forest trailing the bandits."
  },
  {
    "headline": "Osinbajo Asks Journalists To Remain Steadfast In Rule Of Law",
    "summarized_story": "The Vice President, Professor Yemi Osinbajo, called on journalists to remain steadfast in the rule of law and press freedom in the country.\nHe stated this on Monday when he received the President of the Nigerian Union of Journalists (NUJ), Mr Chris Isiguzo, at the Presidential Villa in Abuja.\nAccording to the vice president, it is the duty of the press, as well as politicians and others, to ensure Nigeria remains safe, secure, and united.\nStressing the importance of such as responsibility, he thanked journalists for their civic vigilance and appealed for more collaboration with the government to protect the information space.\nThe vice president equally called on stakeholders in Nigeria to replicate such efforts in the interest of security and unity."
  },
  {
    "headline": "Vehicle conveying vegetables set ablaze in Enugu",
    "summarized_story": "A vehicle conveying vegetables, tomatoes and other perishable foodstuffs was on Monday morning set ablaze by hoodlums in Enugu.\nThe incident, TVC News gathered, happened at Edem Junction, Ibeagwa, Nike in the Enugu East Local Government Area of Enugu State.\nThe vehicle was said to be coming from the Ugwogo end of the Opi/Enugu bypass when it was blocked and set on fire.\nEyewitnesses account attributed it to an act of arsonists, trying to hijack the already cancelled every Monday Sit-at-Home order, that was earlier issued by members of the Indigenous People of Biafra (IPOB).\nBut residents insisted that the perpetrators were only trying to instil fears in the minds of the people, who had stopped obeying the sit-at-home order.."
  },
  {
    "headline": "Niger troops rescue nine Nigerian soldiers who escaped terrorists attack in Sokoto -",
    "summarized_story": "Nine Nigerian soldiers were rescued by Niger Republic troops after escaping a terrorist attack in the Gatawa Woodland in Sokoto State, Northwest Nigeria.\nAccording to sources, the attack was led by Kachalla Turji, a notorious terror kingpin, on a military base in Gatawa where Nigerian security forces, including soldiers from the Nigerian army, Police Mobile Forces operatives, and the Nigerian Security and Civil Defence Corps, were stationed.\nReports say, the kingpin relocated his camp from Fakai in Zamfara State to East of Isa, Tozai in Sokoto State due to incessant airstrikes by Nigerian Air Force."
  },
  {
    "headline": "Troops Repel ISWAP Attack on Military Base in Sokoto",
    "summarized_story": "He said the aggressive operations of troops of the FOB as witnessed in recent months in the North West region, has been a thorn in the flesh of ISWAP and bandits.\nHe said unfortunately, there were some level of casualty recorded on the part of own troops during the encounter.\nMeanwhile, Nigerian and Nigerien forces in a collaborative operation are currently trailing the remaining ISWAP fighters.\nThe general security within the FOB and its environs has been stabilized.\nTVCNEWS had earlier reported an attack on the Burkusuma military base located in Sabon Birni local government area of Sokoto state where unspecified number security personnel pay the supreme price in the battle to repeal the attack from the suspected terrorists."
  },
  {
    "headline": "Governor Abubakar Sanni Bello harps on the importance of Trade between Nations -",
    "summarized_story": "Governor Abubakar Sani Bello has expressed the desire to collaborate with companies that are ready to add value to the economy of Niger state.\nGovernor Sani Bello stated this while meeting with different interest groups on the sidelines of Turkey-Nigeria bussiness congress holding in Instanbul,Turkey.\nGovernor Sani Bello acknowledged that every nation desires to be better while noting that having forums for trade or investment opportunities between nations as this, will engender the desired growth and development in all ramifications.\nInvestors in various sectors comprising Agriculture, Health, Education Infrastructure, mineral resources among others met with the Governor.\nAlsasa said the Forum is also an opportunity to bring together major stakeholders from Turkey and Nigeria to discuss ways of developing Nigerian in a mutually beneficial partnerships."
  },
  {
    "headline": "R&B Superstar R. Kelly Convicted in Sex Trafficking Trial",
    "summarized_story": "R. Kelly, the R&B superstar known for his anthem “I Believe I Can Fly,” was convicted Monday in a sex trafficking trial after decades of avoiding criminal responsibility for numerous allegations of misconduct with young women and children.\nSeveral accusers testified in lurid detail during the trial, alleging that Kelly subjected them to perverse and sadistic whims when they were underage.\nGloria Allred, a lawyer for some of Kelly’s accusers, said that of all the predators she’s gone after — a list including Harvey Weinstein and Jeffrey Epstein — “Mr.\nAt the trial, several of Kelly’s accusers testified without using their real names to protect their privacy and prevent possible harassment by the singer’s fans.\nJurors were shown homemade videos of Kelly engaging in sex acts that prosecutors said were not consensual."
  },
  {
    "headline": "Nigeria: Northern Governors Condemn Southern Counterparts Over Power Shift, Say VAT Not Sales Tax",
    "summarized_story": "The Northern States Governors Forum (NSGF) has condemned statements by their Southern Governors Forum (SGF) that the Presidency must go to the South in 2023.\n“The Forum observed that some Northern States Governors had earlier expressed views for a power-shift to three Geo-Political Zone in the South with a view to promoting unity and peace in the Nation.\n“Notwithstanding their comments, the Forum unanimously condemn the statement by the Southern Governors Forum that the Presidency must go to the South”, the communique said.\n“VAT is not a production tax like excise, but terminal tax which is paid by the ultimate consumer.”According to the governors, “Another confusion is ignoring observation above and its ‘overall effect’.\nThe meeting was attended by the governors of Plateau, Kaduna, Sokoto, Nasarawa, Borno, Jigawa, Gombe and the deputy governor of Kano state."
  },
  {
    "headline": "Nigeria: Practice What You Preached At UN, Afenifere tells Buhari",
    "summarized_story": "The Pan-Yoruba socio-political organization, Afenifere, Monday, called on President Muhammadu Buhari, to put into practice what he said about justice, fairness and equity on the floor of the United Nations when he addressed the world body last Friday.\nThe group while picking holes in the president’s speech, in a release signed by its National Publicity Secretary, Comrade Jare Ajayi, on Monday, said ethnic nationalities and other concerned stakeholders in Nigeria have been calling for dialogue to resolve ‘Nigeria issues’ for long.\nBut the federal government under President Buhari has not only been ignoring them but hounding those calling for such dialogue.\nAccording to him, “It is interesting, perhaps comforting that the Nigerian authority realizes that dialogue is the way to go in resolving knotty issues.\n“We call on the government to immediately allow states to transform their respective security networks into state police with all the powers appertaining thereto”, Ajayi added."
  },
  {
    "headline": "Biden Gets Covid Booster Shot after Authorisation",
    "summarized_story": "Biden, 78, got his first shot on Dec. 21 and his second dose three weeks later, on Jan. 11, along with his wife, Jill Biden.\nSpeaking on Friday after the Centers for Disease Control and Prevention and the Food and Drug Administration authorized the Pfizer booster, Biden told reporters, “It’s hard to acknowledge I’m over 65, but I’ll be getting my booster shot.” He repeated the joke about being over 65 on Monday.\nAt least 2.66 million Americans have received booster doses of the Pfizer vaccine since mid-August, according to the CDC.\nAbout 100 million Americans have been fully vaccinated against COVID-19 through the Pfizer shot.\nU.S. regulators recommend getting the boosters at least six months after the second shot of the initial two-dose series."
  },
  {
    "headline": "Bolaji Akinyemi: Nigeria Reckless with Foreign Loans",
    "summarized_story": "Former External Affairs Minister Prof Bolaji Akinyemi joined the Morning Show on Monday to discuss Nigeria President Muhammadu Buhari’s recent speech at the UN General Assembly, Nigeria’s frequent borrowing and the menace of terrorism in the country.\nAkinyemi is a political scientist and renowned expert on foreign relations.\nHei was the Director General of the Nigerian Institute of International Affairs from 1975 to 1983 and Nigeria’s Minister of External Affairs from 1985 to 1987.\nWatch the interview…"
  }
]