[
  {
    "headline": "Progress being made in talks with Ukraine, says Russia",
    "summarized_story": "Russia said Wednesday that negotiations with Kyiv to resolve the Ukraine conflict were making headway and underscored that Moscow’s troops were not working to topple the Ukrainian government.\n“Some progress has been made,” foreign ministry spokeswoman Maria Zakharova said during a press briefing, referring to three rounds of talks with Kyiv.\nUkraine and Russia officials have been meeting on the Belarus-Poland border for talks to end fighting.\nZakharova said another round of talks will be focused on humanitarian corridors to evacuate civilians.\nRussia and Ukraine have agreed to a day-long ceasefire Wednesday around a series of evacuation corridors to allow civilians to escape fighting."
  },
  {
    "headline": "BREAKING: Bandits kill 13 soldiers, five policemen, vigilante in Kebbi",
    "summarized_story": "Gunmen have killed 19 security personnel, including 13 soldiers, in Kebbi State, a security source and residents said Wednesday.\nThey include 13 soldiers, five policemen and one vigilante,” a security personnel, who did not want to be identified, told AFP.\nHe said eight other security personnel, including four soldiers, were hospitalised with wounds.\n“The bodies of 13 soldiers, five policemen and one vigilante killed in the fight were taken to Zuru this morning,” he said.\n“We believe they were the same bandits who killed the vigilantes that attacked our village,” he said."
  },
  {
    "headline": "BREAKING: Senate rejects Buhari’s Electoral Act",
    "summarized_story": "By Henry Umoru, ABUJATHE Senate has vehemently jettisoned President Muhammdu Buhari’s Bill seeking to amend the Electoral Act, 2022.\nThe Bill titled: “A Bill for an Act to amend the Electoral Act 2022 and for related matters, 2022,” was overwhelming rejected by Senators, a development that effectively stopped its second reading.\nThe Bill was thrown out on Wednesday during plenaryRecall that the Bill had on Tuesday scaled first reading despite a court order stopping the Senate from acting on it.\nThe President of the Senate, Senator Ahmad Lawan had challenged the Court order saying that the Judiciary cannot in any circumstances stop the Legislature from performing its constitutional duties.\nSenators however voted overwhelmingly against the Bill to stop it from being read a second time."
  },
  {
    "headline": "Slain BRT victim, Bamise was a virgin; Mum inconsolable, Dad hard to pacify — Brother-in-law",
    "summarized_story": "It’s very likely he belongs to a ritualistic syndicate.”In her reaction, Nollywood actress, Toyin Abraham slammed the Lagos State government over the horrific manner Bamise was killed.\nBut I have a few questions for Lagos State Government, why are the BRT buses not fitted with CCTV cameras?\n“What measure have you put in place since this incident that made you assure Lagosians that the BRT buses are now safe?\nBut the current leadership in Lagos State converted the same RRS to the money-making tool, leaving Lagosians in the hands of hoodlums operating as government officials.\nA senior Medical Representative, Mrs Bridget Okobe stated: “This calls for precautionary measures like installing CCTV cameras in all the BRT buses and proper investigation of drivers before employment."
  },
  {
    "headline": "International Women’s Day: El Rufai flags off N200m disbursements to women",
    "summarized_story": "Governor Nasir el-Rufai of Kaduna StateBy Ibrahim Hassan-WuyoGovernor Nasir El-Rufai of Kaduna State has flagged off the disbursement of N200 million as part of Kaduna State Women Empowerment Fund (KADSWEF), to commemorate the 2022 International Women’s Day, making it the third time that his administration will empower the women entrepreneurs.\nEl Rufai argued that “women are the foundation of the society” and the APC government of Kaduna state “really believes in supporting women because when you empower a woman you empower her family and the society.\n‘’According to him, Hajiya Hafsat further argued that “women are afraid of going to the bank to borrow, they are not given the chance.\nThe governor also commended the efforts and input of women holding appointive positions in Kaduna State Government, advising women generally to be confident in themselves.\n“I want our women in Kaduna to be more confident of themselves."
  },
  {
    "headline": "Faulty transformer: Ilasamaja residents debunk claims of repairs",
    "summarized_story": "By Helen OrokResidents of Ilasamaja community in Mushin Local Government of Lagos State, have debunked claims by officials of EKO Electricity Distribution Company, EKDC, that the faulty transformer on Akanro 1 DT, has been fixed.\nThey contended that besides coming to check the transformer on Monday, March 7, nobody has visited there again.\nOn Monday, March 7, at around 1 pm, some officials of EKDC from Mushin District came to carry out a test on the transformer.\n“Throughout Tuesday and Wednesday, nobody visited the transformer to carry out any job on it.\nBut some dubious officials have continued to feed the customer care unit fake information that the fault had been cleared."
  },
  {
    "headline": "IWD22: Reps backpedal, to reconsider 3 women bills",
    "summarized_story": "The decision came as women again stormed the National Assembly, yesterday, in protest against the rejection of the bills in the two chambers of the National Assembly.\nWomen from all walks of life had been protesting against the rejection of the bills, asking the National Assembly to reconsider the bills, which they argued would give women a leverage in the political development of the country.\nAgain, women storm National Assembly over rejected billsMeanwhile, scores of women groups, yesterday, continued their protest at the main gate of the National Assembly, blocking many people from accessing the complex.\nThe women, under the aegis of Nigerian Women Groups, had last week protested against the action of the lawmakers and promised to return if the decision was not reversed.\n“On March 1, 2022, Nigerian women received very disappointing news from the National Assembly."
  },
  {
    "headline": "Ebonyi’s Governor Umahi, deputy, lawmakers ask Appeal Court to reverse their sack",
    "summarized_story": "The governor and his co-appellants are praying the Court of Appeal in Abuja to reverse the judgment of the high court on the ground of miscarriage of justice.\nThe appeal, filed in less than 24 hours the high court booted them out of office, was brought to the appellate court on their behalf by Chukwuma Machukwu Umeh SAN.\nIn the notice of appeal predicated on 11 grounds, Umahi and his deputy particularly begged the Court of Appeal to allow their appeal and set aside the decision of the high court claiming that the lower court judgment was too harsh on them.\nDAILY POST recalls that Justice Inyang Ekwo in a judgment on Tuesday ordered Umahi and his deputy to immediately stop holding themselves out as Governor and Deputy Governor of Ebonyi State.\nHe also ordered the House of Assembly members not to parade themselves or make any attempt to hold themselves out as Legislators of Ebonyi House of Assembly."
  },
  {
    "headline": "Joseph Egunike’s death must be added to Abba Kyari’s crime – Nnamdi Kanu’s disciple, Ekpa",
    "summarized_story": "Simon Ekpa, a self-acclaimed disciple of Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, has insisted that the death of Deputy Inspector General of Police, Joseph Egbunike, must be added to the crime of former Police boss, Abba Kyari.\nHe claimed that Kyari and his co-Fulani Jihadists killed Egbunike for refusing to betray Biafra during the Anambra election.\nReacting, Ekpa, in a tweet via his Twitter handle on Wednesday, wrote: “Abba Kyari and his Co Fulani Jihadists killed DIG Joseph Egbunike for refusing to betray Biafra during Anambra election.\nEgbunike rejected the appointment as officer in charge of Anambra election but accepted to investigate international criminal Abba Kyari.\n“The death of Joseph Egbunike must be added to Abba Kyari’s crime.”Recall that the National Drug Law Enforcement Agency, NDLEA, had charged Kyari alongside six others for alleged drug trafficking."
  },
  {
    "headline": "BREAKING: Bill to amend Electoral Act fails second reading",
    "summarized_story": "The bill to amend the Electoral Act, 2022 has failed to the pass second reading at the Senate on Wednesday.\nThe section in the Electoral Act which barred political office holders from serving as delegates of political parties during conventions of political parties, Buhari said was denial of democratic rights of certain citizens.\nThe bill was read the first time on Tuesday amid controversy banning the amendment exercise by the Justice Inyang Ekwo-led Federal High Court.\nHe urged the Senate leader, Senator Yahaya Abdullahi Abubakar to read the bill on Wednesday.\nThe bill however, failed and by legislative processes, it won’t be read for the third time."
  },
  {
    "headline": "Ukraine reacts to UN email advising staff not to call Russian invasion war",
    "summarized_story": "Ukrainian President Volodymyr Zelensky has reacted to an internal United Nations email advising staff not to refer to the Russian invasion of Ukraine as a “war.”Zelensky said he knows that Ukrainians and others who are not in support of what is going on in Ukraine were angered by the said email.\nStephan Dujarric, the UN spokesperson, said that an unnamed regional office should not have issued a memo warning staff to not use the words “war” or “invasion”.\nAccording to the spokesperson, there are no official instructions on which word to use in describing the situation in Ukraine.\nUkraine President, Zelensky said via a Telegram on Tuesday, “You may have seen in the news today the story that the United Nations allegedly does not consider the Russian invasion a war.\nThe word “war” will be heard on this site."
  },
  {
    "headline": "War: ‘Too risky’ – US rejects Poland’s plan to send MiG-29 fighter jets to Ukraine",
    "summarized_story": "The United States have rejected Poland’s proposal to transfer their MiG-29 fighter jets to the United States.\nPoland wants the jets transfered to the US who would, in turn, deliver them to Ukraine, but the Pentagon described such move as not “tenable.”The US government said that Poland’s proposal shows the “complexities” of transferring the fighters to Ukraine.\nPress Secretary for the United States Department of Defense, John Kirby, said in the statement that “It is simply not clear to us that there is a substantive rationale for it.\nAnd according to them, the US government would then move the fighter jets to Ukraine.\nCNN quoted multiple sources as saying that the Joe Biden government was completely caught off guard by Poland’s offer to send fleet of used MiG-29 fighter jets to America."
  },
  {
    "headline": "Siblings remanded for allegedly killing teenager",
    "summarized_story": "Two brothers Oloruntoyin Abdullahi 31, and Ayodele Kazeem 26, have been remanded in prison custody for alleged involvement in the killing of a teenager Ebunoluwa Osatuyi.\nLate Osatuyi was found dead inside her parent’s apartment on January 24 after returning from evening classes.\nPolice investigations led to the arrest of the two brothers by tracing her missing phone to them.\nThe defendants, who were docked for conspiracy and murder, pleaded not guilty to the charge.\nAccording to him: ” I was in my house resting when the police came with my brother that I was involved in the killing of a lady with a pestle, which sounded strange to me."
  },
  {
    "headline": "BREAKING: Senate throws out Buhari’s Electoral Bill",
    "summarized_story": "The Senate on Wednesday threw out President Muhammdu Buhari’s Bill seeking to amend the Electoral Act, 2022.\nThe Bill titled: “A Bill for an Act to amend the Electoral Act 2022 and for related matters, 2022,” was overwhelming rejected by Senators, a development that effectively stopped its second reading.\nThe Bill scaled first reading on Tuesday despite a court order barring the Senate from acting on it.\nBefore the Senate commenced consideration of the Bill on Wednesday, Senator Adamu Aliero had, while citing order 52(5) of the Senate Standing Rules, urged the Senate President to jettison proposed action on the Bill.\nSenators however voted overwhelmingly against the Bill to stop it from being read a second time."
  },
  {
    "headline": "APC convention: We must not throw our chances away – Akeredolu",
    "summarized_story": "Ondo Governor Oluwarotimi Akeredolu has said the ruling All Progressives Congress (APC) must strive to sustain internal democracy in the conduct of its forthcoming National Convention slated for March 26.\nAkeredolu said the party must not throw away its chances ahead of next year’s general elections.\nThe Ondo Governor noted that the APC must show its values through internal democracy for the sake of credibility.\nMy party, your party, our party.\n“Political parties are supposed to be platforms where government policies are being designed and proffered for implementation to those that will be elected."
  },
  {
    "headline": "UPDATED: DIG investigating Abba Kyari slumps, dies",
    "summarized_story": "A Deputy Inspector-General of Police and head of the Nigeria Police Force Criminal Investigation Department (FCID) Joseph Egbunike is dead.\nThe police confirmed that Egbunike died around 9pm on Tuesday at the National Hospital, Abuja after a brief illness.\nEgbunike’s Federal Criminal Investigation and Intelligence Department (FCIID) is widely seen as the most powerful and preoccupied police department.\nUntil he was appointed DIG in late 2020, Egbunike worked for several years as the head of the Police Finance Department.\nUntil his death, Egbunike headed the Special Investigation Panel constituted by the Inspector General of Police, Usman Baba, to investigate the suspended head Deputy Commissioner of Police Abba Kyari over alleged money laundering."
  },
  {
    "headline": "Judgment sacking Umahi throws Ebonyi into confusion",
    "summarized_story": "The Federal High Court in Abuja sent shockwaves through Ebonyi State politics yesterday with a judgment sacking Governor David Umahi and his deputy Eric Igwe “with immediate effect”.\nJustice Inyang Ekwo said they unlawfully defected from the Peoples Democratic Party (PDP) to the All Progressives Congress (APC).\nHe declared that the votes won or scored by a political party at an election are retained by the political party irrespective of the death or exit of the candidate from the political party.\nJustice Ekwo declared that under the democratic system of governance operated in Nigeria, the votes won at an election by a political party cannot be transferred to or utilised for the benefit of another political party or member of another political party.\nHe urged INEC to put the necessary machinery in motion to conduct fresh election into the 17 Ebonyi State House of Assembly seats."
  },
  {
    "headline": "APC Stakeholders Mull Soft-landing for Buni, Akpanudoedehe’s Fate Uncertain",
    "summarized_story": "At the same time, there was a pall of confusion yesterday at the national secretariat of the APC over the fate of the National Secretary of the CECPC, Senator John Akpanudoedehe.\nA reliable source privy to the meeting told THISDAY that Bello said both Buni and Akpanudoedehe would be given soft-landing.\nHe insisted that he remained the national secretary of the party until President Buhari says otherwise.\nHowever, following the leadership change that occurred on Monday, Bello later met with APC state chairmen same night at Transcorp Hilton, Abuja.\nBello said his major task was to fix the party and ensure a successful National convention of the party at the stipulated date."
  },
  {
    "headline": "Unlike Zamfara, Court Sacks Umahi, Igwe, 16 Lawmakers, Says Votes Belong to Party",
    "summarized_story": "In addition, Ekwo ordered INEC to stop recognising Umahi and Igwe as governor and deputy governor of Ebonyi State respectively.\nOffices of the Governor and Deputy Governor of Ebonyi State belong to the PDP.\nHe also ordered INEC to cease recognising Umahi and Igwe as Governor and Deputy Governor, respectively, of Ebonyi State.\nIn other words that a political party is nothing more than an agent of the candidate in gathering votes for an election.\nIduma Igariwe, a serving member of House of Representatives as the new governor and Mr. Fred Udogwu as the deputy governor."
  },
  {
    "headline": "IWD: Buhari, Others Extol Virtues of Nigerian Women, Call for Better Appreciation",
    "summarized_story": "The team was led by Fayemi, who said they were at the protest ground to stand in solidarity for all Nigerian women.\nOrtom Commends Courageous, Resilient Nigerian WomenBenue State Governor, Mr. Samuel Ortom, commended the courage and resilience of Nigerian women.\nHe said, “I congratulate women all over the world and join other well-meaning Nigerians in celebrating Nigerian women, especially.\nFailure to recognise this is simply planning to fail from the beginning.”ActionAid saluted Nigerian women for their strength and courage.\nAl-Makura, in a statement yesterday, lamented that Nigerian women were yet to get opportunities in governance commensurate with their contributions to the nation’s development."
  },
  {
    "headline": "Report: FG’s Domestic Borrowing to Exceed N2.6trn in 2022",
    "summarized_story": "The CMB added that the country might experience weak portfolio investment inflows due to negative real interest rates as the headline inflation rate remained in double digits.\nOverall, we expect the budget deficit this year to be higher than the current projection and that domestic borrowing could exceed N2.6 trillion.\n“For 2022, we expect the impact of positive base effects on the headline inflation rate to wither away by the second quarter of the year.\nLooking ahead, on the back of specific factors which could result in upward pressure on prices, we have imposed visible fluctuations in the m/m inflation rate using a few assumptions.\nFor 2022, we expect a GDP growth of 2.6 per cent y/y.”Delivering a welcome remarks yesterday during the unveiling of the report, the Managing Director/Chief Executive Officer of CMB, Mr."
  },
  {
    "headline": "Breaking: Court Sacks 16 Ebonyi Lawmakers over Defection to APC",
    "summarized_story": "A Federal High Court, Abuja, on Tuesday, ordered the 16 lawmakers from Ebonyi to vacate their seats after their defection from the Peoples Democratic Party (PDP) to the All Progressives Congress (APC).\nJustice Inyang Ekwo, in a judgment, ordered the lawmakers to stop parading themselves as representatives of the people after dumping the party on which platform they were elected into the house of assembly.Some of the lawmakers include Odefa Obasi Odefa, Victor Chukwu, Kingsley Ikoro, Joseph Ununu, Nkemka Okoro, among others.The News Agency of Nigeria (NAN) reports that Justice Ekwo had, on Jan. 19, fixed today for the judgment in the suit filed by the PDP against the governor and his deputy.\n(NAN)Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Nigeria Police Deputy Inspector-General In Charge Of Force Criminal Investigation, Egbunike Slumps, Dies In His Office",
    "summarized_story": "A deputy inspector general and the head of the Nigeria Police Force Criminal Investigation Department (FCID), Joseph Egbunike is dead, SaharaReporters can authoritatively report.\nEgbunike collapsed inside his office in Abuja in the late hours of Tuesday, 8th of March.\nJOSEPH EGBUNIKEUntil his death, Egbunike was in charge of the highest investigating arm of the Nigeria Police.\nIts functions include investigation and prosecution of serious and complex criminal cases within and outside the country.\nEgbunike had, in late 2021, investigated suspended police chief, Abba Kyari, but did not indict him despite indictments by the United States’ Federal Bureau of Investigation."
  },
  {
    "headline": "BREAKING: Nigeria Police Deputy Inspector-General In Charge Of Force Criminal Investigation, Egbunike Slumps, Dies In His Office",
    "summarized_story": "A deputy inspector general and the head of the Nigeria Police Force Criminal Investigation Department (FCID), Joseph Egbunike is dead, SaharaReporters can authoritatively report.\nEgbunike collapsed inside his office in Abuja in the late hours of Tuesday, 8th of March.\nJOSEPH EGBUNIKEUntil his death, Egbunike was in charge of the highest investigating arm of the Nigeria Police.\nIts functions include investigation and prosecution of serious and complex criminal cases within and outside the country.\nEgbunike had, in late 2021, investigated suspended police chief, Abba Kyari, but did not indict him despite indictments by the United States’ Federal Bureau of Investigation."
  },
  {
    "headline": "BREAKING Court Sacks Ebonyi Governor, Umahi, Deputy Over Defection To APC Party",
    "summarized_story": "The Federal High Court sitting in Abuja, on Tuesday, sacked Governor David Umahi of Ebonyi State and his Deputy, Dr Eric Igwe, following their defection from the Peoples Democratic Party, PDP, to the ruling All Progressive Congress, APC.\nBreaking NewsAccording to the court, having defected to the APC, both Umahi and his deputy, not only jettisoned the PDP, but also the votes that belonged to it.\nThe court, therefore, ordered both Umahi and Igwe to immediately vacate their positions.\nThe court further restrained both Umahi and Igwe from further parading themselves as governor or deputy governor of Ebonyi State.\nThe judgement followed a suit the PDP lodged before the court."
  },
  {
    "headline": "BREAKING Court Sacks Ebonyi Governor, Umahi, Deputy Over Defection To APC Party",
    "summarized_story": "The Federal High Court sitting in Abuja, on Tuesday, sacked Governor David Umahi of Ebonyi State and his Deputy, Dr Eric Igwe, following their defection from the Peoples Democratic Party, PDP, to the ruling All Progressive Congress, APC.\nBreaking NewsAccording to the court, having defected to the APC, both Umahi and his deputy, not only jettisoned the PDP, but also the votes that belonged to it.\nThe court, therefore, ordered both Umahi and Igwe to immediately vacate their positions.\nThe court further restrained both Umahi and Igwe from further parading themselves as governor or deputy governor of Ebonyi State.\nThe judgement followed a suit the PDP lodged before the court."
  },
  {
    "headline": "Court Fixes March 16 For Hearing Of Businessman, Ned Nwoko’s Trumped-Up Charges Against Activist, Sowore",
    "summarized_story": "“Good morning sir, this is to inform you that the case btw Dr Ned Nwoko and Comrade Omoyele Sowore will be coming up on 16/03/2022 at Federal High Court 8 Abuja.\nYou are expected to be at Abattoir, old SARS Office Abuja by 0830 hours.\nAbubakar was hurriedly arraigned before an Area Court in Kabusa before a judge who was hired by Ned Nwoko to do the hatchet job.\nSaharaReporters on Tuesday reported that an Upper Area Court sitting in Kabusa at the Federal High Court, Abuja, granted Marshal bail.\nOn Monday, Sowore visited the police facility to obtain the charges which they claimed were filed against him by Nwoko."
  },
  {
    "headline": "Senate rejects Buhari’s request to delete clause 'disenfranchising' appointees in electoral act",
    "summarized_story": "The senate has rejected a request by President Muhammadu Buhari seeking to delete a clause in the newly-signed electoral act.\nThe upper legislative chamber rejected the bill through a voice vote when it was tabled to be read a second time.\nWhen Buhari signed the electoral act amendment bill into law, he said clause 84 (12) disenfranchises political appointees.\nAdvertisementSpeaking in support of the bill, Ovie Omo-Agege, deputy president of the senate, said the bill should be allowed to scale.\n“I therefore rise to support that the motion as moved by the senate leader be allowed to go for second reading.”"
  },
  {
    "headline": "Senate rejects Buhari’s request to delete clause 'disenfranchising' appointees in electoral act",
    "summarized_story": "The senate has rejected a request by President Muhammadu Buhari seeking to delete a clause in the newly-signed electoral act.\nThe upper legislative chamber rejected the bill through a voice vote when it was tabled to be read a second time.\nWhen Buhari signed the electoral act amendment bill into law, he said clause 84 (12) disenfranchises political appointees.\nAdvertisementSpeaking in support of the bill, Ovie Omo-Agege, deputy president of the senate, said the bill should be allowed to scale.\n“I therefore rise to support that the motion as moved by the senate leader be allowed to go for second reading.”"
  },
  {
    "headline": "Egbunike, police DIG who investigated DCP Kyari, dies after brief illness in Abuja",
    "summarized_story": "Joseph Egbunike, deputy inspector-general of police in charge of the force criminal investigations department, is dead.\nAccording to the police, Egbunike died on Tuesday at the National Hospital, Abuja after a brief illness.\nMuyiwa Adejobi, the force spokesperson, in a statement on Wednesday, announced the death of Egbunike.\n“DIG Egbunike was until his death the Deputy Inspector-General of Police in charge of the force criminal investigation department and the supervisory DIG in charge of the south-east.\n“DIG Egbunike was a dedicated and seasoned police officer who served the nation in various capacities including as the commissioner of police in charge of Police Accounts and Budget."
  },
  {
    "headline": "Egbunike, police DIG who investigated DCP Kyari, dies after brief illness in Abuja",
    "summarized_story": "Joseph Egbunike, deputy inspector-general of police in charge of the force criminal investigations department, is dead.\nAccording to the police, Egbunike died on Tuesday at the National Hospital, Abuja after a brief illness.\nMuyiwa Adejobi, the force spokesperson, in a statement on Wednesday, announced the death of Egbunike.\n“DIG Egbunike was until his death the Deputy Inspector-General of Police in charge of the force criminal investigation department and the supervisory DIG in charge of the south-east.\n“DIG Egbunike was a dedicated and seasoned police officer who served the nation in various capacities including as the commissioner of police in charge of Police Accounts and Budget."
  },
  {
    "headline": "'It's executive rascality' --- NBA hits Umahi over comment on court order sacking him",
    "summarized_story": "The Nigerian Bar Association (NBA) has tackled David Umahi, governor of Ebonyi, for “denigrating” the judiciary after he was sacked from office by a federal high court in Abuja.\nResponding to the verdict, Umahi said nobody could remove him from office and described the judge as a “hatchet man”.\nBut in a statement on Wednesday, Olumide Apata, NBA president, said the governor’s comment “is impunity of the highest order and executive rascality taken too far”.\nUmahi to instead resort to attacking and denigrating the high office of a judge in this unprecedented manner is disgraceful, undemocratic and completely unacceptable.\nDave Umahi and a retraction of the comments he made against the person and Judgment of the Hon."
  },
  {
    "headline": "Why e-commerce is king in Egypt",
    "summarized_story": "Furthermore, a Disrupt Africa report released in January shows that 20% of Egyptian startups are decidedly pursuing opportunities in the e-commerce and retail-tech space.\nLast year, Egyptian e-commerce startups received USD$ 131.27 million; according to Africa: The Big Deal, which is 1.4 times the e-commerce funding Nigeria, Kenya, and South Africa received in the same period.\nToday Egyptian e-commerce is expected to grow at least 30% this year, buoyed by younger shoppers and rising incomes from Egypt’s expanding middle class.\nPhoto: Fady Fouad/UnsplashAs e-commerce accelerated in Egypt, it created a ripple effect on the logistics sector.\nLast year and led by funding into e-commerce and retail tech companies, Egyptian startups raised $403.5 million, according to data from Disrupt Africa."
  },
  {
    "headline": "Fintech innovations on the rise in DR Congo’s nascent startup landscape",
    "summarized_story": "As with most countries in sub-Saharan Africa, access to basic financial services is significantly limited in the Democratic Republic of Congo (DRC).\nA number of startups have sprung up over the past 5 years, which, through fintech innovations, have brought financial services closer to where people live and work.\nSince its launch, Flash has recorded stellar growth and is currently integrated with several banks, mobile money, and telecom operators.\nWe have to work together,” the Okapi Finance founder said.\nWith internet access at around 17%, feature phones – which retail at about $20 – play a huge role in enabling Congolese to access digital finance services."
  },
  {
    "headline": "These women are building Africa’s neobank for the supply chain industry",
    "summarized_story": "Pivo entered the market with Pivo Capital, a credit-focused financial services platform for supply chain small and medium businesses (SMEs), because of the co-founders’ track record in the supply chain industry, especially the logistics aspect.\nWith Amadi-Emina’s experience in the logistics side of the supply chain, having worked and led the port operation effort at Kobo360, Akwiwu’s experience in law, and their collective knowledge of running an exportation business, building a business that serves the logistics arm of the supply chain was a no-brainer.\nLogistics supply chain is Pivo’s first stopIn Africa, access to credit is still one of the biggest challenges small businesses deal with, especially small supply chain businesses.\nImage source: LoriLaunched in September last year, Pivo provides flexible and quick financing options for supply chain businesses like logistics service providers, clearing and forwarding businesses, and FMCG distributors.\nBut to understand what Pivo does, one must first understand how supply chain financing works."
  },
  {
    "headline": "Togolese inventor builds $12,000 mini tractors for the West African market",
    "summarized_story": "It’s a step out of the kitchen and into the field for this award-winning Togolese inventor.\nBetter known in Togo and the region as the “father of Foufoumix” Logou requires little introduction to those who keep an eye on the world of African invention.\nLogou tries to provide local solutions to local problems.\nThe prototype for the tractor, which retails for the local equivalent of $12,000, was built using salvaged parts, with the idea that doing so would help buyers easily access spare parts.\n“I can’t stay in recovery or recycling anymore and I am now manufacturing some of the spare parts of this machinery myself,” he explained."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, What comes to mind when you hear the term \"financial inclusion\"?\nI asked because it has become a..."
  },
  {
    "headline": "How no-code tools helped two UNILAG graduates build omni-channel messaging platform, Ozi",
    "summarized_story": "Soon, they pretty much conducted all their business on the messaging platform and turned into a WhatsApp TV, helping businesses advertise on their statuses for ₦500 or ₦1,000.\nSelf-styled Ozi, the first WhatsApp automation platform in Nigeria, helps users automate their messages on several messaging platforms.\n“So basically, you go to Termii, and you sign up on their website, then if you want to add your WhatsApp messaging channel, you apply for it.\nAccording to Azeez, Ozi frowns on spamming and rarely allows marketers to use the platform.\nAzeez plans to set up a no-code platform to propagate the gospel of no-code and train no-code professionals to meet the rising global need for their services."
  },
  {
    "headline": "South Africa’s spectrum drama",
    "summarized_story": "Share this article:Hello there,So yesterday was International Women’s Day, and most organisations took to social media to show their support.\nAdvertisementHere’s what we’re discussing today:South Africa’s spectrum auctionBitmama’s physical cardsSouth Africa’s spectrum auction beginsA telecom towerAfter more than a decade, South Africa’s spectrum auction is about to commence.\nIn response, one of the foremost cryptocurrency startups in the country, Bitmama, has launched physical cards.\nTypically, crypto debit cards automatically convert cryptocurrencies at the point of transacting to fiat and Bitmama’s card may work similarly.\nChimgozirim Nwokoma Accidental writer, covering Africa’s startup landscape and its heroes."
  },
  {
    "headline": "Univasa launches Verify and Pay Platform to digitise public transport fare payments",
    "summarized_story": "The platform was launched at the Lagos State Taxi Driver & Cab Operators Association (LSTDCOA) headquarters, Oshodi, Lagos.\nMr Otunba, the president of LSTDCOA, gave a breakdown of the journey so far for taxi drivers.\nHe said that he has been working on providing solutions to the issues affecting taxi drivers and their services.\nHe added that technology has to be embraced to prevent the extinction of yellow taxi cabs in Lagos state.\nSpeaking at the event, CEO of Univasa, Dr Ben Adeniyi, said, “The verify and pay platform initiative was born out of the need to be an “Enabler” to service providers and consumers."
  },
  {
    "headline": "Nigeria’s petrol subsidy set to surpass N3.36tn oil revenue",
    "summarized_story": "The petrol subsidy to be incurred by the Nigerian government this year looks set to outpace its budgeted oil revenue of N3.36 trillion as global oil prices are expected to remain at record highs.\nBarclays and Rystad Energy said Brent could rise to $200 if Europe and the United States banned Russian oil imports.\n“With slowing oil production and increasing subsidy, Nigeria’s oil revenue will not be enough to pay oil subsidy if the present scenario continues in the global market,” Sheriffdeen Tella, a professor of economics at Olabisi Onabanjo University, Ogun State, told BusinessDay.\nOn Tuesday, the United States announced a ban on Russian oil and other energy imports, in retaliation for the invasion of Ukraine.\n“At some point, we might use all of our oil revenue to pay for subsidy, which will still not be enough,” Tella warned."
  },
  {
    "headline": "Nigeria’s petrol subsidy set to surpass N3.36tn oil revenue",
    "summarized_story": "The petrol subsidy to be incurred by the Nigerian government this year looks set to outpace its budgeted oil revenue of N3.36 trillion as global oil prices are expected to remain at record highs.\nBarclays and Rystad Energy said Brent could rise to $200 if Europe and the United States banned Russian oil imports.\n“With slowing oil production and increasing subsidy, Nigeria’s oil revenue will not be enough to pay oil subsidy if the present scenario continues in the global market,” Sheriffdeen Tella, a professor of economics at Olabisi Onabanjo University, Ogun State, told BusinessDay.\nOn Tuesday, the United States announced a ban on Russian oil and other energy imports, in retaliation for the invasion of Ukraine.\n“At some point, we might use all of our oil revenue to pay for subsidy, which will still not be enough,” Tella warned."
  },
  {
    "headline": "Businesses suffer as diesel price surges 160%",
    "summarized_story": "“The marketers are selling at a price that covers their cost price, import cost and exchange rate price,” said Mike Osatuyi, national operations controller of Independent Petroleum Marketers Association of Nigeria.\nBusiness experts have expressed fear that the spike in diesel price might force more businesses to sack employees amid rising energy costs.\nDiesel is mostly used by businesses, especially manufacturers, to power their generators amid a lack of reliable power supply from the national grid.\n“High diesel cost would trigger higher transportation costs.\nThe NBS data also showed that diesel price was N131.47 in June 2015 when the President Muhammadu Buhari-led administration came into power."
  },
  {
    "headline": "IWD: Obaseki celebrates women, pledges support for more representation in elective positions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…blames Edo Assembly crisis on lack of women representationBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has linked the crisis that rocked the state’s House of Assembly to the lack of women representation in the House, reassuring support for more representation in elective positions.\nObaseki gave the assurance during an event at the Government House, Benin City, to mark this year’s International Women’s Day.\nI will go out there to campaign and more women will be elected into our State House of Assembly.\nRest assured that our government will create more opportunities to support women and build structures that will allow you to achieve your goals,” he assured.\nSpeaking on efforts to end all forms of gender bias in Edo, Obaseki said, “In Edo, we are clear."
  },
  {
    "headline": "Edo partners NAHCON on digital database for Muslims – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government through the Edo State Muslim Pilgrims Welfare Board (EDSMPWB) is partnering with the National Hajj Commission of Nigeria (NAHCON) to develop a digital database of all Muslims in the state.\nThe Chairman, EDSMPWB, Sheik lbrahim Oyarekhua, who received members of the board of NAHCON to the board’s office in Benin City, said the government will continue to prioritize the welfare and wellbeing of Edo Muslims and other residents.\nNAHCON is on an inspection tour of the board’s facilities to ascertain the state’s preparedness for the forthcoming 2022 Hajj exercise to Saudi Arabia.\nAccording to him, the board through the Edo State Government has ensured that the required facilities are on ground to qualify the state for the renewal of the 2022 Hajj.\nAmong the areas inspected by the team were the computer section, conference hall, and the mosque where the Muslim faithful perform their spiritual exercise, among others."
  },
  {
    "headline": "Obaseki mourns passing of Pa Omoregie Idehen – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has mourned the passing of Pa Omoregie Idehen, describing him as a great community leader who contributed immensely to societal development.\nIn a statement, Obaseki noted, “It is with a heavy heart that I mourn the passing of Pa Omoregie Idehen, a great man and community leader, who led a fulfilled life.\n“A hardworking man, Pa Omoregie was a devout family man and showed compassion and courage in equal measure.\n“He will be remembered for his wise counsel and forbearance as well as his commitment to societal development.\n“I commiserate with the Omoregie family and pray that God grants all the fortitude to bear the irreparable loss.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo revs up efforts to address adulteration, hike in fuel price, meets marketers, regulators, others – Nigerian Observer",
    "summarized_story": "He noted that the meeting followed increasing allegations of adulterated fuel and a hike in the price of PMS in Edo State.\nAccording to him, “Following the allegations of adulterated fuel and hike in the price of petroleum products in Edo State, we decided to visit depots within the environs.\n“The Edo State Government is partnering with Nigeria Security Civil Defense Corp (NSCDC) as they have the technology to checkmate adulterated fuel distributed to fuel stations across Edo.\n“I call on all citizens of Edo State to remain calm and never engage in panic buying of petroleum products as it will soon become available everywhere in the state.\nAnything adulterated is bad for consumption; be it food, petroleum products or any other goods or services."
  },
  {
    "headline": "Bamise: Sanwo-Olu tackles critics over BRT passenger’s murder",
    "summarized_story": "“I think people trivialise life and make it look at everything as if they want to score a cheap point.\nI have seen on social media, people are asking ‘you don’t have CCTV cameras in your cars and vehicles’.\n“In all of our BRT buses that we procured two and a half years ago, all of them have CCTV cameras and trackers.\nHowever the additional ones that we bought locally last year are the ones we have not installed CCTV cameras.\nThat is the unfortunate one this particular incident happened.”Sanwo-Olu advised Lagosians not to board a BRT bus of which lights, including the radar lights which indicate destination, are off."
  },
  {
    "headline": "NGX, Ministry of Women Affairs to explore Partnerships on Gender Equality",
    "summarized_story": "The event, themed “Break the Bias: Gender equality today for a sustainable tomorrow” was headlined by the Honorable Minister of Women Affairs, Dame Pauline Tallen (OFR) and Honorable Minister of State for Industry, Trade and Investment, Amb.\nIt brought stakeholders together to explore the key issues that could facilitate progress towards gender equality through policy and finance.\nIn his opening remarks, the Group Managing Director/Chief Executive Officer, Nigerian Exchange Group Plc (NGX Group), Mr. Oscar N. Onyema, OON said, “The global finance industry has a critical role to play in achieving gender equality.\nIn her remarks, the Honorable Minister said, “Partnerships is at the heart of our intervention philosophy at the Ministry of Women Affairs.\nThe symposium also featured a panel session to highlight the potential of leveraging sustainable finance to break the gender bias in gender equality."
  },
  {
    "headline": "IWD: UK partners UBA Foundation in £20m drive to support girl-education in developing countries",
    "summarized_story": "· Improving girls’ access to education is a key part of the UK’s foreign policy, to ensure the build back from the pandemic and prevent a lost generation.\nThe UK government has contributed an initial £9m to the initiative called the Girls’ Education Skills Partnership programme.\nThe UBA Foundation is the Corporate Social Responsibility arm of the United Bank for Africa group.\nThe Foundation is focused on initiatives that support Education, Empowerment and the Environment on the African country.\nFor over 2 decades, the UBA Foundation has been giving back and changing lives on the continentFacebook Notice for EU!"
  },
  {
    "headline": "FBN Holdings names Adewale Arogundade acting secretary",
    "summarized_story": "FBN Holdings Plc has appointed Adewale Arogundade as the acting company secretary to replace Seye Kosoko, who was transferred to the commercial banking subsidiary of First Bank of Nigeria Limited.\nIn a statement on Monday, Ahmad Abdullahi, chairman of the board of directors, FBN Holdings, said the appointment became effective on March 7.\n“In accordance with Nigerian Exchange Limited’s (NGX) Rule Book, the Board of Directors of FBN Holdings Plc wishes to notify the NGX and the investing public that Mr. Adewale Arogundade, Assistant Company Secretary, FBN Holdings Plc, will assume the role of Acting Company Secretary, effective March 7, 2022,” the statement said.\nLast year, the CBN approved the appointment of Ahmad Abdullahi as a non-executive director and chairman of the Holdco after Remi Babalola’s exitFacebook Notice for EU!\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "Defection: Gov Umahi, Deputy, Others File Appeal",
    "summarized_story": "About 24 hours after the judgment of Justice Inyang Ekwo of a Federal High Court in Abuja, which sacked Governor Dave Umahi, his deputy and 17 state lawmakers, the Court of Appeal has been asked to set aside the judgement of the lower court.\nThe Federal High Court had declared defection of the governor and others illegal, saying their mandate belong to the party on which platform they were elected.\nBut in the notice of appeal filed at the Court of Appeal, Abuja Division, the governor and others said the lower court lacked jurisdiction to entertain the matter abinitio.\nDetails Later..ADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "Women Indispensable In Nation-building, Says Uzodimma",
    "summarized_story": "lmo State Governor Hope Uzodimma has described women’s role in nation-building as unquantifiable and indispensable.\nThe governor made the assertion when he congratulated Nigerian women on the occasion of this year’s International Women’s Day.\nUzodimma admonished them not to despair in their resolve to contribute towards the development of the country and globally.\nThe governor stressed that he appreciated and understood the multi-dimensional role of women in society, hence his appointment of women into elevated offices in the administration.\nChioma Uzodimma, for devoting her time, energy and resources to better the lots of the women in the state, particularly the needy, through diverse empowerment and training programmes."
  },
  {
    "headline": "Life Expectancy In Niger Delta Has Dropped To 41 Years – Environmentalist",
    "summarized_story": "Nnimmo Bassey, has declared that life expectancy in the Niger Delta region has reduced to 41 years.\nThe HOMEF boss attributed the drop in life expectancy in the Niger Delta region, to the destruction of the environment through oil spills, pollution and gas flaring.\nADVERTISEMENTHe said, “You know that Niger Delta is one of the most polluted places on the planet Earth.\nHere we have all the conditions that cut life short; oil spills, oil pollution, gas flare, oil well blow-out, FPSO blow-out.\n“People can’t enjoy life; Niger Delta people cannot live to the full of nature and God has blessed them to live with all these contamination."
  },
  {
    "headline": "Bad Fuel: Coalition Demands Compensation For Owners Of Damaged Vehicles",
    "summarized_story": "A coalition of aggrieved Nigerians yesterday demanded compensation for citizens whose vehicles were destroyed by the adulterated fuel recently imported into the country by some oil companies.\nThe group comprising the Movement for the Survival of Ethnic Nationalities in Niger Delta, Ex-Agitators for Good Governance and the Coalition of Civil Society Groups, decried the current hardship Nigerians are passing through at filling stations to get petrol also known as Premium Motor Spirit (PMS).\nThe national coordinator of Niger Delta Youth Council, Engr.\nADVERTISEMENTAbido threatened to mobilise over 10,000 people from the Niger Delta region whose cars were damaged due to the bad product, to embark on a mass compensation collection at all NNPC outlets and facilities close to them within the Niger Delta as well as the cities of Abuja and Lagos.\nHe said, “As patriots, we have reviewed the situation and have discovered that certain persons occupying positions of trust and authority in the PMS distribution ecosystem have failed in their responsibilities and duties to Nigerians."
  },
  {
    "headline": "Lagos Student Wins 9mobile Future CEO Speech Competition",
    "summarized_story": "A 16-year-old female student, Jane-Frances Okorie from Lagos State Civil Service Senior Model College student, Igbogbo, Ikorodu, has won the maiden edition of the 9mobile FutureCEO speech competition.\nShe defeated nine other finalists in a keenly contested speech battle held at the Immaculate Heart Comprehensive Senior High School, Maryland, Lagos.\nOver 50 students from secondary schools within the Lagos State Education District 2, comprising Ikorodu, Kosofe, and Shomolu local government councils, participated in the competition.\nThe 9mobile FutureCEO is an initiative aimed at inspiring future leaders by stirring up their interest in business and leadership.\nThe initiative also affords promising future leaders an opportunity to walk in the shoes of senior business leaders."
  },
  {
    "headline": "BREAKING: Senate Rejects Buhari’s Electoral Act",
    "summarized_story": "President Muhammadu Buhari’s bill to modify the Electoral Act of 2022 was severely rejected by the Senate.\nThe Bill titled: “A Bill for an Act to modify the Electoral Act 2022 and for connected matters, 2022,” was overwhelming rejected by Senators, a situation that effectively prevented its second reading.\nRecall that despite a court order prohibiting the Senate from moving on the bill, it passed first reading on Tuesday.\nSenator Adamu Aliero, APC, Kebbi, petitioned the President of the Senate to dismiss the proposed action on the Bill prior to the start of discussion on Wednesday, invoking order 52(5) of the Senate Standing Rules.\nSenators, on the other hand, voted decisively to prevent the bill from being read a second time."
  },
  {
    "headline": "BREAKING: Bill To Amend Electoral Act Fails Second Reading",
    "summarized_story": "On Wednesday, the Senate failed to pass the bill amending the Electoral Act of 2022 on its second reading.\nPresident Muhammadu Buhari has written to both the upper and lower legislative chambers, requesting that Section 84(12) of the Electoral Act, 2022 be amended to allow politicians to serve as delegates.\nBuhari said that a portion of the Electoral Act prohibiting political office holders from serving as delegates of political parties during conventions was a violation of citizens’ democratic rights.\nSenator Yahaya Abdullahi Abubakar, the Senate leader, was encouraged to study the bill on Wednesday.\nThe bill, however, failed, and it will not be heard a third time according to legislative procedures."
  },
  {
    "headline": "Anxiety As Joseph Egbunike, DIG Investigating Abba Kyari Slumps, Dies",
    "summarized_story": "Joseph Egbunike, a Deputy Inspector General of Police in command of the Force Criminal Investigations Department, has died.\nEgbunike died on Tuesday, according to sources, after collapsing in his workplace in Abuja, the Federal Capital Territory.\nThe DIG, who was from Onitsha in Anambra State, was in charge of the Special Investigation Panel set up by the Inspector General of Police, Usman Baba, to look into the actions of Abba Kyari, the suspended head of the Police Intelligence Response Team, who was accused of money laundering.\nWhile the incident’s circumstances are still vague, it was learned that Egbunike had gone to his doctor for a medical check-up after feeling ill.\nThe senior officer, who was claimed to have driven to work in the presence of family members, slumped and died a few minutes after being given medicines."
  },
  {
    "headline": "PDP Submits Nominees For Umahi/Igwe Replacement In Ebonyi State",
    "summarized_story": "The Peoples Democratic Party (PDP) has replaced the sacked Governor of Ebonyi state, David Umahi with Hon.\nDAILY POST reports that a Federal High Court sitting in Abuja had sacked Governor Umahi and his Deputy, Dr Eric Kelechi Igwe, following their defection from the Peoples Democratic Party, PDP, to the ruling All Progressives Congress (APC).\n“And in line with the court order, PDP is immediately submitting to INEC the names of our candidates for Governor and Deputy Governor of Ebonyi State respectively.\nPDP National Chairman also called on the Chief Judge of Ebonyi State to immediately swear them in as soon as INEC issues the requisites Certificates of Return.\nThe Chairman of the opposition party also called on INEC to immediately withdraw the Certificates of Return from the 17 lawmakers and commence the process of conducting bye-elections to replace them."
  },
  {
    "headline": "[Breaking] Electoral Act: Senate rejects Buhari’s request for amendment",
    "summarized_story": "The Senate Wednesday threw out request of President Muhammadu Buhari for amendment of section 84(12) of the Electoral Act which prevents appointive political office holders from contesting for election from party primary level without resigning.\nAfter the Senate Leader , Yahaya Abdullahi ( APC Kebbi North ) made the lead debate for second reading of the bill, many of the Senators kicked against it and voted no when put to voice votes by the President of the Senate, Ahmad Lawan.\nDetails loading…"
  },
  {
    "headline": "Police DIG, Joseph Egbunike, slumps, dies",
    "summarized_story": "A Deputy Inspector General of Police and the head of the Force Criminal Investigation Department (FCID), Joseph Egbunike has reportedly slumped and died.\nBlueprint gathered that Egbunike collapsed inside his office in Abuja late Tuesday March 8, 2022 and was rushed to the hospital where he was confirmed dead.\nUntil his death, Egbunike was in charge of the highest investigating arm of the Nigeria Police, and headed probe panel investigating suspended deputy commissioner of Police Abba Kyari.\nHis functions include investigation and prosecution of serious and complex criminal cases within and outside the country.\nDetails loading…"
  },
  {
    "headline": "Electoral Act: Despite court order, Senate proceeds with amendment",
    "summarized_story": "Other defendants in the suit are Speaker of the House of Representatives; Clerk to the National Assembly; Senate Leader, House of Representatives Leader and the Independent National Electoral Commission( INEC).\nOthers are Deputy Senate President, Deputy Speaker, House of Representatives, Deputy Senate Leader and Deputy Leader of the House of Representatives.\nSenate kicksKicking against the Order during plenary Tuesday, the Senate first listed consideration of the Act for amendment on its order paper and made it to pass first reading.\nIn his remarks, Senate President Ahmad Ibrahim Lawan said the court cannot stop the Senate and by extension, the National Assembly, from performing its legislative duties.\nEkweremadu cautionsBut Senator Ike Ekweremadu, while citing Order 52(5) of the Senate Standing Order, called on the Senate to abide by the court ruling."
  },
  {
    "headline": "BREAKING: Senate Rejects Buhari’s Request To Amend Section 84 (12) In Electoral Act",
    "summarized_story": "The Senate has thrown out the request of President Muhammadu Buhari for amendment of section 84 (12) of the Electoral Act which prevents appointive political office holders from contesting for election from party primary level without resigning.\nThe request was rejected after the Senate Leader, Senator Yahaya Abdullahi (APC Kebbi North) made the lead debate for the second reading of the bill on Wednesday.\nThe Senators kicked against it and voted no when put to voice votes by the Senate President Ahmad Lawan.\nMore to follow…"
  },
  {
    "headline": "NBA Slams Umahi, Describes Response To Court Order As Executive Rascality",
    "summarized_story": "The Nigerian Bar Association (NBA) has slammed Ebonyi State Governor Dave Umahi for refusing to obey a court order which has asked him to vacate office as governor of the state.\nNBA President, Olumide Akpata, in a statement on Wednesday, described Umahi’s response as “impunity of the highest order and executive rascality taken too far.”Mr Akpata said the NBA has absolutely no interest in the outcome of the case in question and will continue to stay away from partisan politics.\n﻿The NBA, therefore, demand an immediate apology from the governor and a retraction of the comments he made against the person and Judgment of the Hon.\nJustice Inyang Ekwo of the Federal High Court.\nSEE THE FULL STATEMENT BY THE NBA PRESIDENT BELOW…"
  },
  {
    "headline": "Police DIG, Joseph Egbunike, Dies In Abuja",
    "summarized_story": "The Deputy Inspector-General (DIG) of Police in charge of the Force Criminal Investigations Department (FCID), Mr Joseph Egbunike is dead.\nUntil his death, Egbunike was in charge of the highest investigating arm of the Nigeria Police ForceA source confirmed to Channels Television that the police investigation boss died on Tuesday night after he was rushed to a hospital in Abuja due to a brief illness.\nREAD ALSO: Nigeria Air: FG Opens Bid To Private PartnersDIG Egbunike was due to retire from the service in the next two monthsIn late 2021, he investigated suspended DCP Abba Kyari, but did not indict him.\nHe graduated from the University of Nsukka with BSc in Accounting.\nHe also had a Bachelor of Law, a master’s in International Relations, and a Ph.D. in CriminologyHe had served in various commands in the force."
  },
  {
    "headline": "PDP Nominates Igariwey To Replace Umahi As Ebonyi Governor",
    "summarized_story": "The Peoples Democratic Party (PDP) has nominated Iduma Enwo Igariwey as a replacement for Governor David Umahi, and Mr Fred Udeogu as Deputy Governor.\nThe governor and his deputy had been elected into office in the 2015 and 2019 general elections on the platform of the PDP.\nRead Also: Umahi Reacts To Court Ruling, Says Judge Lacks Powers To Remove HimConsequently, the PDP approached the court, asking for Umahi’s removal.\nJustice Ekwo also ordered the Independent National Electoral Commission (INEC) to cease from recognising Umahi and Igwe as the Governor and Deputy Governor of the Ebonyi State.\nReacting to the judgment, Governor Umahi said Justice Ekwo lacked the power to remove him from office."
  },
  {
    "headline": "More Than 140,000 Flee Ukraine In 24 Hours, Says UN",
    "summarized_story": "The number of refugees fleeing Ukraine increased by more than 140,000 in 24 hours, according to United Nations figures issued Wednesday, with more than 2.15 million now having fled since Russia invaded on February 24.\n– 2,155,271 refugees –UNHCR, the UN’s refugee agency, recorded 2,155,271 refugees on its dedicated website — 143,959 more than the previous count on Tuesday.\nPoland has championed the cause of Ukrainian refugees.\n– Elsewhere in Europe –Some 235,745 people who have fled Ukraine have now moved beyond neighbouring states to other European countries, according to the UNHCR.\n– Hungary –Some 203,222 refugees are now in Hungary — nearly 10 percent of the total who have fled Ukraine."
  },
  {
    "headline": "Federal High Court Abuja sacks 15 Ebonyi Lawmakers over defection -",
    "summarized_story": "A Federal High Court sitting in Abuja has ordered 15 members of the Ebonyi House of Assembly, including the Speaker, who defected from the Peoples Democratic Party (PDP) to the All Progressives Congress (APC) to immediately vacate their seats.\nJustice Inyang Ekwo, in a judgment held that their defection was unlawful and that having abandoned that political party on which platform they stood election, they could no longer occupy the seats.\nJustice Ekwo declared their seats vacant and restrained them from further parading themselves in the capacity of members of the Ebonyi State House of Assembly."
  },
  {
    "headline": "APC Secretary resigns 24hrs after Gov Sani replaces Buni",
    "summarized_story": "Dr John Akpan Udoedehe has resigned as trhe Secretary of the All Progressives Congress Caretaker Committee a day after Governor Sani Bello assumed office as acting Chairman of the party.\nThe Niger state governor had on Monday assumed office as the chairman of the party’s caretaker committee.\nEarlier, there were reports that President Muhammadu Buhari had ordered the sacking of Governor Mai Mala Buni as the chairman of the party."
  },
  {
    "headline": "BREAKING: Repsmake U-turn, to reconsider three Gender bills -",
    "summarized_story": "The House of Representatives has rescinded decisions on three gender bills earlier rejected during the consideration of bills for amendment of the 1999 constitution.\nThe lawmakers have now agreed to reconsider bills Citizenship for foreigners married to Nigerian women, 20 per cent reservation of party positions to women, indigeneship for women married to men from states other than their own statesThe decision is coming at a time civil society groups, have occupied the National assembly, demanding for a revisit of the Gender equality Bill"
  },
  {
    "headline": "Why I pulled out of Osun PDP Governorship Primary",
    "summarized_story": "One of the Governorship aspirants of the People’s Democratic Party in Osun state has withdrawn from the race.\nThe primary election of the party is slated for tomorrow at the Osogbo City stadium.\nThe party now has five Governorship aspirants in the race.\nMr Ogunbiyi added that the leadership of the PDP at the centre has decided to cede the governorship ticket to Senator Adeleke.\nThe Governorship election is slated for the 16th of July, 2022."
  },
  {
    "headline": "Transmission Company of Nigeria Blames GenCos for Nationwide Load Shedding, Worsening Power Supply",
    "summarized_story": "The Transmission Company of Nigeria (TCN) on Tuesday attempted to explain the worsening nationwide power supply, stating that the Generation Companies (Gencos) were not generating enough electricity to be transmitted by the company.\n“The media has been awash with reports that TCN has reduced the load allocation to distribution companies.\nThe correct position is that TCN can only transmit the quantum of power generated by Gencos through the national grid to distribution load centres nationwide.\n“For clarity, TCN does not generate electricity and therefore can only transport cumulative generation from all the generation companies nationwide to distribution load centres.\nThe company noted that presently, the cumulative generation nationwide was low and generation companies have attributed this to several factors including poor gas supply."
  },
  {
    "headline": "Nigeria Urges Turkey to Invest in Its Onshore Oil Assets",
    "summarized_story": "A number of foreign oil companies operating in the country, especially Shell, Nigeria’s biggest partner in the industry as well as ExxonMobil, are planning to sell off many of its assets in Nigeria.\nSylva stated that with the planned divestments, especially from the onshore segment of the oil and gas sector, it would be worth the investment for the country.\nMore investments in that sector would be a great opportunity for Turkey to expand its investments interest in Nigeria,” the minister said.\nSylva assured Bayraktar of good returns on investments in Nigeria, stressing that despite plans by the IOCs to divest from onshore assets, the companies were ramping up investments in offshore assets in the country.\nHe noted that this was a sign that the Nigeria investment environment is still the desired investment destination in Africa."
  },
  {
    "headline": "McDonald’s, Starbucks, Coke, Pepsi Join Exodus out of Russia",
    "summarized_story": "“Our values mean we cannot ignore the needless human suffering unfolding in Ukraine,” McDonald’s President and CEO Chris Kempczinski said in an open letter to employees.\nAlshaya Group will continue to pay Starbucks’ 2,000 Russian employees, Starbucks President and CEO Kevin Johnson said in an open letter to employees.\nUnlike Starbucks and other fast food companies like KFC and Pizza Hut, whose Russian locations are owned by franchisees, McDonald’s owns 84% of its Russian stores.\nIn a recent regulatory filing, McDonald’s said its restaurants in Russia and Ukraine contribute 9% of its annual revenue, or around $2 billion last year.\nLater, McDonald’s was one of the first U.S. fast food companies to open a store in Russia, a sign that the Cold War had thawed."
  },
  {
    "headline": "Nigeria: ‘I’m Still Ebonyi Governor, Judgment Ousting Me Was Bought,’ Umahi Says – Arise News",
    "summarized_story": "Briefing journalists in Abakaliki, Umahi reiterated that he still remained Ebonyi governor, and that he would appeal the judgement.\nAnd let me tell you that this same judge has over ten cases against Ebonyi State government with him.\nThere is a subsisting judgement in Zamfara State and there is also a judgement in Ebonyi State.\nIduma Igariwe, a serving member of House of Representatives as the new governor and Mr. Fred Udogwu as the deputy governor.\nIduma Igariwe as the new Governor and Mr. Fred Udogwu as the new Deputy Governor of Ebonyi State respectively."
  },
  {
    "headline": "Nigeria: APC Stakeholders Mull Soft-Landing for Displaced Chairman Buni",
    "summarized_story": "A reliable source privy to the meeting told THISDAY that Bello said both Buni and Akpanudoedehe would be given soft-landing.\nHe insisted that he remained the national secretary of the party until President Buhari says otherwise.\nI am waiting for my national chairman to come back.\nHowever, following the leadership change that occurred on Monday, Bello later met with APC state chairmen same night at Transcorp Hilton, Abuja.\nBello said his major task was to fix the party and ensure a successful National convention of the party at the stipulated date."
  }
]