[
  {
    "headline": "Why lifespan of Lewy body dementia patients is about five years –Psychiatrist",
    "summarized_story": "Lara AdejoroA Consultant Psychiatrist at the Federal Neuropsychiatrist Hospital, Yaba, Dr. Dapo Adegbaju says the lifespan of patients diagnosed with Lewy Body Dementia is about five years after diagnosis.\nDementia with Lewy Bodies also known as Lewy Body Dementia is a type of progressive dementia that leads to a decline in thinking, reasoning, and independent function because of abnormal microscopic deposits that damage brain cells over time.\nAccording to him, Lewy Body Dementia is the second most common type of progressive dementia after Alzheimer’s disease.\nThe two conditions differ in that Alzheimer’s involves extreme memory problems, and Lewy Body Dementia is more likely to affect how you process information.\nIn addition, Lewy Body Dementia causes physical symptoms such as tremor and muscle stiffness,” it noted."
  },
  {
    "headline": "Why lifespan of Lewy body dementia patients is about five years –Psychiatrist",
    "summarized_story": "Lara AdejoroA Consultant Psychiatrist at the Federal Neuropsychiatrist Hospital, Yaba, Dr. Dapo Adegbaju says the lifespan of patients diagnosed with Lewy Body Dementia is about five years after diagnosis.\nDementia with Lewy Bodies also known as Lewy Body Dementia is a type of progressive dementia that leads to a decline in thinking, reasoning, and independent function because of abnormal microscopic deposits that damage brain cells over time.\nAccording to him, Lewy Body Dementia is the second most common type of progressive dementia after Alzheimer’s disease.\nThe two conditions differ in that Alzheimer’s involves extreme memory problems, and Lewy Body Dementia is more likely to affect how you process information.\nIn addition, Lewy Body Dementia causes physical symptoms such as tremor and muscle stiffness,” it noted."
  },
  {
    "headline": "$200m mosquito net loan for malaria eradication in 13 states –Minister",
    "summarized_story": "Deborah Tolu-KolawoleThe Minister of Health, Dr. Osagie Ehanire, on Monday, said the $200 million fund widely said to be for the procurement of malaria net was in fact for the malaria eradication programme in 13 states.\nThe committee condemned the response of the Ministry of Health’s submission about its intention to borrow the amount for the purchase of mosquito nets for 13 vulnerable states.\nEhanire explained that the United States of America and the global health fund had promised to provide support for the eradication of malaria in some states while adding that the fund was not just for the purchase of mosquito nets but the eradication of malaria in the 13 states.\nHe said, “The United States Presidential Initiative on malaria donated $295 million to cover eleven states and the global health fund for tuberculosis and malaria, also donated about four million dollars for 13 states.\nThe fund is not just to purchase mosquito nets as widely purported but to purchase test kits among others."
  },
  {
    "headline": "$200m mosquito net loan for malaria eradication in 13 states –Minister",
    "summarized_story": "Deborah Tolu-KolawoleThe Minister of Health, Dr. Osagie Ehanire, on Monday, said the $200 million fund widely said to be for the procurement of malaria net was in fact for the malaria eradication programme in 13 states.\nThe committee condemned the response of the Ministry of Health’s submission about its intention to borrow the amount for the purchase of mosquito nets for 13 vulnerable states.\nEhanire explained that the United States of America and the global health fund had promised to provide support for the eradication of malaria in some states while adding that the fund was not just for the purchase of mosquito nets but the eradication of malaria in the 13 states.\nHe said, “The United States Presidential Initiative on malaria donated $295 million to cover eleven states and the global health fund for tuberculosis and malaria, also donated about four million dollars for 13 states.\nThe fund is not just to purchase mosquito nets as widely purported but to purchase test kits among others."
  },
  {
    "headline": "Kaduna-Abuja Road attack: Govt receive briefing from security agents",
    "summarized_story": "By Ibrahim Hassan-WuyoThe Kaduna State Government has received briefings from security forces on Sunday’s attack by armed bandits along the Kaduna-Abuja road.\nThe vehicle used by Alhaji Sagir Hamidu who was killed during the attack ,was recovered by the Police.\nThe Commissioner reiterated the commitment of the Kaduna State Government by way of continued provision of logistics and support to security agencies.\nHe described the attack as a setback, stating however that the Government of Kaduna State would not be deterred by this in its security efforts.\nHe pleaded with citizens experiencing communication difficulties to bear with the temporary measures in view of overall security advantages."
  },
  {
    "headline": "BREAKING: Lagos EndSARS report, recycled fake news ― Lai Mohammed",
    "summarized_story": "Soni Daniel – AbujaThe Minister of Information, Alhai Lai Mohamed, has dismissed the report submitted by the Lagos State EndSARS panel on Police Brutality as a hoax, which did not follow the evidence at hand.\nThe minister made the position of tge government known at a news conference in Abuja on Tuesday.\nMohammed said it was shocking that the same allegations made by Nigerians were merely compiled and submitted as a report by the panel set up to investigate the claims of police brutality.\n“It is an intimidation of the majority by a minority,” Mohammed submitted.\nDetails later…Vanguard News Nigeria"
  },
  {
    "headline": "Police arrest man who defrauded 37 unsuspecting customers goods worth over N1m",
    "summarized_story": "By Bashir Bello – KanoKano State Police Command said it has arrested a 25-year-old man, Aliyu Hussaini, who specializes in use of social media platforms, Facebook and Whatsapp to advertise textile materials and defraud unsuspecting customers of their monies without delivery of the goods.\nThe Command’s spokesperson, DSP Abdullahi Haruna said Hussaini was arrested defrauding 37 unsuspecting customers who mostly are women, of goods worth over N1 million.\n“The suspect was caught in possession of a Laptop Computer and a Mobile Phone while trying to defraud another unsuspecting victim.\n“After his arrest, Thirty Seven (37) persons have lodged complaints and reported that, the suspect defrauded them the sum of One Million and Fourteen Thousand Naira (N1,014,000.00).\n“The suspect have been charged to Senior Chief Magistrate Court for prosecution,” DSP Haruna however stated."
  },
  {
    "headline": "The Secret of Bone Problems and Preventative Ways",
    "summarized_story": "Estrogen, a hormone in women that protects bones, decreases sharply when women reach menopause, which can cause bone loss.\nIf you had low peak bone mass or other risk factors that caused you to lose bone, your chance of getting osteoporosis is greater.\nHow fast you lose bone after you reach menopause: For some women, bone loss happens faster than for others.\nHow to maintain and improve your Bone Health: OSTEOCARE®Supplementation also goes a long way in improving and protecting bone health.\nBone health is important for us all."
  },
  {
    "headline": "FG disburses N56bn to MSMEs — Perm Sec",
    "summarized_story": "The Federal Government has disbursed N56.84 billion to 835,161 beneficiaries under the MSME Survival Fund scheme.\nThe Permanent Secretary, Ministry of Industry, Trade and Investment, Dr Evelyn Ngige, disclosed this at the opening of the 13th Meeting of the National Council on Industry, Trade and Investment on Monday in Ado-Ekiti.\nShe said the scheme was targeted at strengthening ordinary Nigerians and reducing the poverty index to the nearest minimum.\n“In total, the sum of N56.84 billion has been disbursed to 835,161 beneficiaries under the MSME Survival Fund scheme,” the permanent secretary said.\n“We are also ensuring credit access to 10 million MSMEs at a single-digit rate."
  },
  {
    "headline": "Insecurity: Protect public, private schools in Abuja – Shehu Sani warns",
    "summarized_story": "As insecurity, kidnappings continue on the Abuja-Kaduna road, Shehu Sani, who represented Kaduna Central in the 8th Senate, has warned the FCT and National Assembly.\nSani in a post on Tuesday advised the National Assembly and security agencies to take seriously the safety of private and public schools in Abuja as kidnapping heightens.\nHe issued the warning in a post on his Twitter page.\nHis tweet read: “As the wave of Banditry and kidnappings edges into Abuja, the Ministry of the FCT, security agencies and the NASS must ensure the safety of both the public and private schools within the territory.\nThe Kaduna State Government, confirming the attack, said that scores were kidnapped, with eleven rescued."
  },
  {
    "headline": "2023: Why Davido should run for House of Reps – Adeyanju",
    "summarized_story": "Famous Nigerian singer, Davido has been urged to run for House of representatives in 2023.\nDeji Adeyanju, an activist urged the musician to contest while reacting to his N250 million donation to orphanages across Nigeria.\nAccording to him, Davido’s donation to the less privileged in the nation shows he is aware of the issues faced in the nation.\nHis tweet read, “I appeal to you to run for House of Reps in 2023 because you care about the people and know what the issues are.\nIn total, Davido received N200m and added N50m of his personal money to give to orphanages across the country."
  },
  {
    "headline": "EndSARS: FG rejects Lagos panel report, reveals only reason to change stand",
    "summarized_story": "The Federal Government has rejected the report of the Lagos State Judicial Panel of Inquiry and Restitution on Lekki Toll Gate Shooting which had indicted the Nigerian Police and the military.\nLai Mohammed stated that for the Federal Government to change its stand on the report, there must be more investigations.\nHe said, “there is absolutely nothing in the report that is circulating to make us change our stand that there was no massacre at Lekki on Oct. 20th, 2020.\n“We reject the notion that our soldiers and policemen massacred innocent Nigerians at Lekki on Oct. 20th, 2020.\nBREAKING: Lagos EndSARS report not reliable – Lai Mohammed"
  },
  {
    "headline": "EndSARS: ‘Even goats have owners’ – Lai Mohammed queries absence of victims’ family members",
    "summarized_story": "The Federal Government has queried the Lagos State judicial panel over its report claiming that family members of those killed during the EndSARS protest are afraid to speak.\nHe wondered who will be compensated since the families of allegedly killed EndSARS protesters failed to appear due to fear.\nWhere are the family members of those who were reportedly killed at Lekki Toll Gate?\nWho will receive the compensations when no family members have shown up to date?\n“Why did the Judicial Panel feels compelled to concoct a ”massacre in context” as a euphemism for ”massacre”?"
  },
  {
    "headline": "Lai Mohammed slams CNN, other media houses for celebrating EndSARS Panel report",
    "summarized_story": "Lai Mohammed, Nigeria’s Minister of Information and Culture, has berated the Cable News Network (CNN) for celebrating the Lagos State panel report on EndSARS protest and Lekki tollgate killing.\nThe panel had alleged human rights abuses by the police and the Nigerian Army during the EndSARS protest at the Lekki Tollgate.\nThe Minister said that CNN and the other media houses were in a rush to claim vindication and apparently did not even read the report.\nSecondly, CNN rushed to the air to celebrate an unsigned and unverified report that is riddled with inconsistencies, errors, discrepancies, innuendoes,” he said.\nEndSARS: Lekki massacre fake, CNN, Amnesty International lied – Lai Mohammed"
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Passengers stranded at airports as air traffic controllers embark on warning strike",
    "summarized_story": "Passengers stranded at airports as air traffic controllers embark on warning strikeThousands of passengers at airports nationwide are stranded following notice of strike by air traffic controllers.\nAir traffic controllers attached to the Nigeria Airspace Management Agency (NAMA) are enforcing work station rules, which has increased separation time for aircraft from five minutes to twenty minutes.\nMany airlines are severely affected by the development forcing passengers to be stranded at departure halls in airports across the country.\nAt the MMA2, and General Aviation Terminal (GAT) in Lagos, scores of passengers are stranded and frustrated following their inability to board airplanes to their destinations.\nDetails shortly…"
  },
  {
    "headline": "Lawan insists on December 14 for passage of 2022 budget",
    "summarized_story": "Senate President Ahmad Lawan, on Tuesday, gave the Senate Committee on Appropriations till Wednesday this week to conclude budget defence by subcommittees of the upper chamber.\nLawan who gave the directive at the plenary explained that the ultimatum became necessary in keeping with the December 14 timetable for the passage of the 2022 budget by the National Assembly.\nHe added that working to the contrary may mar the timely passage of the budget as planned.\n- Advertisement -Lawan said, “According to our timetable for the budget defense and subsequent processing by out committees or subcommittees of the Appropriations Committee, tomorrow will be the last day for the budget defense.\n“Tomorrow will be the last day for the budget defense by subcommittees for appropriation before the committee on appropriations."
  },
  {
    "headline": "Baba Suwe: Family announces burial arrangements",
    "summarized_story": "Popular actor Babatunde Omidina aka Baba Suwe who died on Monday, November 22, 2021, he is yet to be buried according to Islamic rites.\nThe late actor’s first son Adesola Omidina in a chat with the Best Of Nollywood, insists on being present for his late dad’s burial.\nAdesola in a chat with Best Of Nollywood on Tuesday released the burial arrangements.\nRead Also: Nollywood veteran comedian Baba Suwe dies at 63- Advertisement -He wrote, “Burial arrangements for late Alhaji Babatunde Nurudeen Omidina (a.k.a Baba Suwe).\nBaba Suwe is survived by children, grandchildren, aged mother and family.”However, Best Of Nollywood on Monday night said Islamic clerics who have been contacted have revealed that they would not be officiating at the burial and interment proceedings of an embalmed corpse."
  },
  {
    "headline": "BREAKING: FG rejects Lagos #EndSARS panel report",
    "summarized_story": "Yusuf Alli and Onyedi Ojiabor, AbujaThe Federal Government has rejected the report of the panel on #EndSARS protest in Lagos.\nIt said the report in circulation does not justify any massacre at the toll gate.\n” Another commentator, a journalist, called it a ‘disgraceful report by a disgraceful panel’, saying it reported allegations instead of investigating the allegations.\n” Yet another wondered how a Judicial Panel could use the words ‘massacre in context’ and equate such to a massacre.\n“We do not intend to bore you by rehashing details of the discrepancies, innuendoes, inconsistencies and errors in that report."
  },
  {
    "headline": "BREAKING: FG rejects Lagos’ EndSARS report",
    "summarized_story": "From Adetutu Folasade-Koyi, AbujaFor the umpteenth time, the Federal Government insisted in Abuja, yesterday, that there was no massacre at Lekki tollgate on October 20, 2020.\nTo prove the authenticity of any killing at the tollgate at Lekki tollgate, in Lagos, when some Nigerians protested against police brutality, government has asked any affected family to come forward with details.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nMinister of Information, National Orientation and Culture, Alhaji Lai Mohammed, said these at a press conference in Abuja, yesterday.\nClick Here to Apply ."
  },
  {
    "headline": "APC govs meet Buhari over zoning, national convention",
    "summarized_story": "This is as President Buhari has endorsed February 2022 as new date for the national convention.\nGovernor Abubakar Bagudu of Kebbi and Chairman of the PGF, who briefed newsmen, said he did not know when the party’s national convention would hold.\n“We agreed as a forum to seek an appointment to meet with President Buhari and discuss the on-coming national convention of the party.\nThe PGF chairman said the forum would keep the public informed on its decision on zoning of elective offices after its meeting with President Buhari.\nHe said the forum passed a vote of confidence on the party’s Governor Mai Mala Buni-led Caretaker Committee and Extra-ordinary Convention Planning Committee."
  },
  {
    "headline": "Osinbajo, govs, Ooni, Alaafin, others launch Yoruba World Centre",
    "summarized_story": "From Oluseye Ojo, IbadanVice President Yemi Osinbajo will today lead prominent Yoruba monarchs, including the Alaafin of Oyo, Oba Lamidi Olayiwola Adeyemi III, and Ooni of Ife, Oba Enitan Ogunwusi, to launch Yoruba World Centre in Ibadan, the Oyo State capital.\nAdedayo, who stated that the project is a brainchild of the International Centre for Yoruba Arts and Culture (INCEYAC), explained that the project signposts a new chapter in the advancement of Yoruba culture, history, tradition and values.\nHe added that launch would feature opening of the centre’s temporary abode, the presentation of a full documentary on the Yoruba World Centre, and the laying of the foundation at the permanent site by the vice president.\n“When completed, the Yoruba World Centre will have a standard library, an archive, a museum, a recreation, reconstruction and digital centre, broadcasting and film village, and an artificial forest (zoo).\nIn addition to providing a good ambience for researchers, the Yoruba World Centre, as a knowledge centre, will help Nigeria and Nigerians in the onerous task of nation building.”100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "Ikoyi collapsed building: Panel digs for facts, visits hospital, site",
    "summarized_story": "The chairman of the panel set up on the incident, Toyin Ayinde, made the call yesterday, while giving an update on their activities.\nHe disclosed that the panel had already visited the site of the incident and hospital to get information from some of the victims of the incident.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nIt will be recalled that Governor Babajide Sanwo-Olu, on November 4, inaugurated the Tribunal of Inquiry into the collapse of the 21-storey building on No.\nGiving an update, yesterday, Ayinde urged members of the public with credible information of direct bearing to the collapsed building incident to send such to [email protected] on or before Wednesday, November 24, 2021."
  },
  {
    "headline": "Electoral amendment bill: We’ve done our job, we expect Buhari to sign –Senate president",
    "summarized_story": "So, this is something that is now with Mr. President, if we are talking about the electoral amendment bill, the National Assembly has finished its work.\n“Of course, when we send a bill to Mr. President, we expect the bill to be signed.\nMr. President could decide to of course, after consultation with his advisers, sign, or if he doesn’t want to sign, he may have his reasons.\nBut I believe whatever we do in the National Assembly, especially this Ninth National Assembly, we think deep, we think wide, we will consult very broadly before we take any position.\nSo, I believe whatever we send to the executive arm of government, Mr. President for his assent, these are things that are well thought out."
  },
  {
    "headline": "Honeywell Group Agrees N80bn Deal with Flour Mills of Nigeria",
    "summarized_story": "•Transaction will create strong national food championNseobong Okon-Ekong and Kayode TokedeThe Honeywell Group Limited has announced an agreement for the proposed combination of Honeywell Flour Mills (HFMP) and Flour Mills of Nigeria (FMN) for a total enterprise value of N80 billion.\nSpeaking about the transaction, Honeywell Group Limited Managing Director Obafemi Otudeko said, “This announcement is in line with the evolution of Honeywell Group and our vision of creating value that transcends generations.\nFor over two decades, we have supported Honeywell Flour Mills to build a strong business with a production capacity of 835,000 metric tonnes of food per annum.\n“In theory, this also means the new company will have even more fuel to inject more jobs into the economy.\n“As this deal closes, Honeywell Group intends to continue its journey of refining and growing its investment portfolio."
  },
  {
    "headline": "With Buhari’s Consent, APC to Hold National Convention Feb 2022",
    "summarized_story": "•Stakeholders to determine exact dateDeji ElumoyeThe coast appears clear for the ruling All Progressives Congress (APC) to elect a new set of national officers, as President Muhammadu Buhari, yesterday, gave the party the go-ahead to hold its national convention in February 2022.\nBut Chairman of the APC National Caretaker Committee, and Governor of Yobe State, Mai Mala Buni, assured that all stakeholders would be involved in the choice of the particular date in February for the convention.\nHe expressed the hope the between now and January next year, they would have concluded their congresses ahead of the February convention.\nWe have to communicate it to our various state chapters for them to be ready for the convention.\nI have my primary responsibility as a governor, to go back to my state and carry out my primary responsibility."
  },
  {
    "headline": "Lawan: Govs Should Have Dialogued, Not Combative over Direct Primaries",
    "summarized_story": "If we are talking about the electoral amendment bill, the National Assembly has finished its work.\n“Yes, of course, when we send a bill to Mr. President, we expect the bill to be signed.\n“But I believe that whatever we do in the National Assembly, especially, this Ninth National Assembly, we think deep, we think wide, we will consult very broadly before we take any position.\nBut this is then again, not my own calling, it is for Mr. President to take his decision.”On what the President’s response was, Lawan said: “No, I’m not supposed to tell you what the President said, because Mr. President has his spokespeople.\nSo, I don’t have to come and say Mr. President, sign this."
  },
  {
    "headline": "Breaking: Veteran Nigerian Comic Actor Baba Suwe is Dead",
    "summarized_story": "By Vanessa ObiohaThe dark-skinned Nigerian comic actor Babatunde Omidina, better known as Baba Suwe has passed on.\n“This is to announce the sudden death of my father Mr Babatunde Omidina, the legend and rare gem ‘Baba Suwe’ 11/22/21,” read the post.\nBorn on August 22, 1958, Baba Suwe gained mainstream recognition after he featured in the movie ‘Omolasan’.\nThe Lagos State indigene started acting in 1971 and has featured and produced several Nigerian movies.\nIn 2019, Baba Suwe through the generosity of friends was flown to the United States for the treatment of diabetes."
  },
  {
    "headline": "Breaking: Flour Mills to Acquire 71.69% Stake in Honeywell in N80bn Deal",
    "summarized_story": "Kayode TokedeFlour Mills of Nigeria (FMN) Monday announced it had signed an agreement to acquire 71.69 per cent stake in Honeywell Group’s portfolio company, Honeywell Flour Mills Plc (HFMP), in a deal worth N80 billion.\nThe two flour processing companies in a joint statement noted that the transaction aims to create a strong national champion for Nigeria to further enhance food security.\nThe statement said Honeywell Group Limited had agreed to sell 71.69 per cent stake in Honeywell Flour Mills to Flour Mills of Nigeria Plc.\nThe statement obtained by THISDAY read: “For the proposed combination of FMN through its affiliates and Honeywell Flour Mills Plc.\nAt a total enterprise value of N80 billion, HGL will dispose of a 71.69per cent stake in HFMP to FMN.”The statement noted that the proposed combination was subject to approval from the appropriate regulators."
  },
  {
    "headline": "EXCLUSIVE: Junketing Nigerian President, Buhari To Embark On Another Trip To Turkey",
    "summarized_story": "Barring any last-minute change, President Muhammadu Buhari will in December leave Nigeria for Turkey, SaharaReporters has gathered.\nThen on Sunday, October 3, President Buhari left for Ethiopia to attend the inauguration of the country’s Prime Minister Abiy Ahmed for a second five-year term in office.\nAdesina added that the Presidential’s plane touched down at Le Bourget Airport at 2.45 pm but was mute on the airport and country Buhari departed from.\nHe left Paris, the French capital on Saturday, November 13 for Durban, South Africa and returned to Nigeria on November 16, 2021.\nSee Also Politics PHOTOS: Junketing President, Buhari Departs Paris For Durban, South Africa"
  },
  {
    "headline": "EXCLUSIVE: Junketing Nigerian President, Buhari To Embark On Another Trip To Turkey",
    "summarized_story": "Barring any last-minute change, President Muhammadu Buhari will in December leave Nigeria for Turkey, SaharaReporters has gathered.\nThen on Sunday, October 3, President Buhari left for Ethiopia to attend the inauguration of the country’s Prime Minister Abiy Ahmed for a second five-year term in office.\nAdesina added that the Presidential’s plane touched down at Le Bourget Airport at 2.45 pm but was mute on the airport and country Buhari departed from.\nHe left Paris, the French capital on Saturday, November 13 for Durban, South Africa and returned to Nigeria on November 16, 2021.\nSee Also Politics PHOTOS: Junketing President, Buhari Departs Paris For Durban, South Africa"
  },
  {
    "headline": "EXCLUSIVE: Documents Expose How Kogi Government Stole, Hid N20billion Workers’ Salaries In Bank Account Before Court Ordered Return To Central Bank",
    "summarized_story": "Documents from the Economic and Financial Crimes Commission and the Central Bank of Nigeria has confirmed how the Kogi State Government led by Governor Yahaya Bello stole and hid about N20 billion meant for workers’ salaries in a secret bank account.\nKogi State Governor, Yahaya Bello.\n“That the management of Sterling Bank has since acknowledged the existence of the said account in their book but claimed same was a mirror account.\nNo: CR:3000/EFCC/LS/CMU/REC-STE/VOL.4/047 on the above subject and wish to confirm the details of the receipt of the amount as stated below: Bank: Sterling Bank Plc; Amount: N19, 333, 333,333.36; Date of receipt: 04 November, 2021.'\n0073572696 domiciled in Sterling Bank, Plc with the name Kogi State Salary Bailout Account."
  },
  {
    "headline": "EXCLUSIVE: Documents Expose How Kogi Government Stole, Hid N20billion Workers’ Salaries In Bank Account Before Court Ordered Return To Central Bank",
    "summarized_story": "Documents from the Economic and Financial Crimes Commission and the Central Bank of Nigeria has confirmed how the Kogi State Government led by Governor Yahaya Bello stole and hid about N20 billion meant for workers’ salaries in a secret bank account.\nKogi State Governor, Yahaya Bello.\n“That the management of Sterling Bank has since acknowledged the existence of the said account in their book but claimed same was a mirror account.\nNo: CR:3000/EFCC/LS/CMU/REC-STE/VOL.4/047 on the above subject and wish to confirm the details of the receipt of the amount as stated below: Bank: Sterling Bank Plc; Amount: N19, 333, 333,333.36; Date of receipt: 04 November, 2021.'\n0073572696 domiciled in Sterling Bank, Plc with the name Kogi State Salary Bailout Account."
  },
  {
    "headline": "EXCLUSIVE: Documents Expose How Kogi Government Stole, Hid N20billion Workers’ Salaries In Bank Account Before Court Ordered Return To Central Bank",
    "summarized_story": "Documents from the Economic and Financial Crimes Commission and the Central Bank of Nigeria has confirmed how the Kogi State Government led by Governor Yahaya Bello stole and hid about N20 billion meant for workers’ salaries in a secret bank account.\nKogi State Governor, Yahaya Bello.\n“That the management of Sterling Bank has since acknowledged the existence of the said account in their book but claimed same was a mirror account.\nNo: CR:3000/EFCC/LS/CMU/REC-STE/VOL.4/047 on the above subject and wish to confirm the details of the receipt of the amount as stated below: Bank: Sterling Bank Plc; Amount: N19, 333, 333,333.36; Date of receipt: 04 November, 2021.'\n0073572696 domiciled in Sterling Bank, Plc with the name Kogi State Salary Bailout Account."
  },
  {
    "headline": "Zainab Ahmed: FG will replace fuel subsidy with N5,000 transport grant for 40m Nigerians",
    "summarized_story": "Zainab Ahmed, minister of finance, budget and national planning, says Nigeria will remove fuel subsidies by 2022 and replace them with N5000-a-month transportation grant to the poorest Nigerians.\nAdvertisementSpeaking at the launch of the World Bank Nigeria Development Update (NDU) on Tuesday, the minister said the grant will go to about 30 to 40 million Nigerians who make up the poorest population of the country.\nShe said the final number of beneficiaries will depend on the resources available after the removal of the fuel subsidy.\n“The subsidies regime in the [oil] sector remains unsustainable and economically disingenuous,” she said.\nAdvertisement“Ahead of the target date of mid-2022 for the complete elimination of fuel subsidies, we are working with our partners on measures to cushion potential negative impact of the removal of the subsidies on the most vulnerable at the bottom 40% of the population."
  },
  {
    "headline": "Zainab Ahmed: FG will replace fuel subsidy with N5,000 transport grant for 40m Nigerians",
    "summarized_story": "Zainab Ahmed, minister of finance, budget and national planning, says Nigeria will remove fuel subsidies by 2022 and replace them with N5000-a-month transportation grant to the poorest Nigerians.\nAdvertisementSpeaking at the launch of the World Bank Nigeria Development Update (NDU) on Tuesday, the minister said the grant will go to about 30 to 40 million Nigerians who make up the poorest population of the country.\nShe said the final number of beneficiaries will depend on the resources available after the removal of the fuel subsidy.\n“The subsidies regime in the [oil] sector remains unsustainable and economically disingenuous,” she said.\nAdvertisement“Ahead of the target date of mid-2022 for the complete elimination of fuel subsidies, we are working with our partners on measures to cushion potential negative impact of the removal of the subsidies on the most vulnerable at the bottom 40% of the population."
  },
  {
    "headline": "Lai: #EndSARS panel report riddled with discrepancies -- findings not backed by facts",
    "summarized_story": "Lai Mohammed, minister of information and culture, says the report by the panel set up to probe police brutality and the shooting at the Lekki tollgate is riddled with discrepancies.\nAddressing a press conference in Abuja on Tuesday, Mohammed said the findings of the panel were not backed up with facts.\nThe minister said the discrepancies observed in the panel’s report have never been seen n the history of any judicial panel set up in the country.\n“The report of the panel in circulation cannot be relied upon because its authenticity is in doubt.\nAdvertisement“The report in circulation is calculated to embarrass the Federal Government and its agencies without foolproof evidence,” Mohammed said."
  },
  {
    "headline": "Lai: #EndSARS panel report riddled with discrepancies -- findings not backed by facts",
    "summarized_story": "Lai Mohammed, minister of information and culture, says the report by the panel set up to probe police brutality and the shooting at the Lekki tollgate is riddled with discrepancies.\nAddressing a press conference in Abuja on Tuesday, Mohammed said the findings of the panel were not backed up with facts.\nThe minister said the discrepancies observed in the panel’s report have never been seen n the history of any judicial panel set up in the country.\n“The report of the panel in circulation cannot be relied upon because its authenticity is in doubt.\nAdvertisement“The report in circulation is calculated to embarrass the Federal Government and its agencies without foolproof evidence,” Mohammed said."
  },
  {
    "headline": "EXPLAINER: Nigeria no longer on religious freedom violators’ list -- and so what?",
    "summarized_story": "The United States Commission on International Religious Freedom (USCIRF) has recommended that Nigeria be designated a Country of Particular Concern (CPC) — a designation for countries “guilty” of particularly severe violations of religious freedom under the International Religious Freedom Act (IRFA) of 1998 — every year since 2009.\nIn December 2019, the US placed Nigeria on its Special Watch-List (SWL) for governments that have engaged in or tolerated severe violations of religious freedom.\nDIFFERENCE BETWEEN CPC, SWLCPCs are defined as countries whose governments either engage in or tolerate “particularly severe violations” of religious freedom during the reporting year.\nParticularly severe violations of religious freedom are defined as “systematic, ongoing, egregious violations of the internationally recognized right to freedom of religion”, such as torture or degrading treatment or punishment.\nUnlike how it went from being on the SWL to CPC, Nigeria did not transition back to SWL before being removed from the CPC."
  },
  {
    "headline": "Ex-DealDey managers reunite to launch ThankUCash deals",
    "summarized_story": "And at its peak, the startup could claim to be sub-Saharan Africa’s largest online deals platform.\nInterestingly, some of DealDey’s former managers—including Mohammed Abubakar, Juwon Ajao, and Joy Amadi—now have an opportunity to take another shot at building the continent’s largest online deals platform, but this time under the ThankUCash brand.\nThankUCash intends to leverage its existing analytics capabilities in order to do things better now, according to Simeon Ononobi.\nSimeon Ononobi is bullish on ThankUCash’s chances of becoming a super aggregator of such deals, helping businesses grow and consumers access bargains.\n“It’s huge,” the CEO said of his company’s ambitions in the online deals space."
  },
  {
    "headline": "The NFT artist who captured the global lockdown with 700 portraits",
    "summarized_story": "Optimising this process, coupled with the overwhelmingly positive feedback he received from his 80 selected muses, encouraged him to create more portraits.\nIn the end, Adekola created 700 portraits, but there are only 40 portraits with striking designs and a collage of all 700 portraits on display at the exhibition halls of the gallery.\nNow titled Lockdown Portraits, his project would go on to form a part of his exhibition titled, Dislocation &… alongside Anthology of an African Wedding and Diaspora Axis.\nAdekola has evolved his art using Photoshop for over 20 years, creating over 20,000 texture designs that he used to create Anthology of an African Wedding.\nAnthology of an African Wedding, which also sells as an NFT on OpenSea, consists of 18 art pieces—9 showing traditional wedding scenes and 9 white wedding ones."
  },
  {
    "headline": "Chipper Cash’s Twitter integration may revolutionise Africa’s creative hustle",
    "summarized_story": "For years, Africa’s creative industry has been hampered by poor returns, leaving creators at the mercy of sponsors and algorithm-manipulated trends.\nOn the third most popular social media platform in Africa, the continent’s Twitter users wield power so influential that Twitter began to build out its first Africa-based team in Ghana this year.\nSo when TikTok, a newer entry into Africa’s social media space, came on the scene, it offered a monetisation plan, out of necessity.\nSo far, the Twitter-Chipper Cash integration is only supported for users in Nigeria, South Africa and Uganda.\nChipper Cash’s Twitter integration is reminiscent of similar models used on China-made live-streaming apps."
  },
  {
    "headline": "Jumia records all-time high quarterly orders and unveils its fintech ambition",
    "summarized_story": "Sales and advertising expenses reached $24.0 million, up 228% year-over-year, while technology and content expenses increased by 27% to $9.4 million.\nHistoric number of quarterly ordersA major highlight from the report was that orders made on Jumia reached an all-time quarterly high of 8.5 million, representing a 28% year-over-year growth.\nClosely related to that, Jumia’s annual active consumers reached 7.3 million and its gross merchandise value (GMV) reached $238 million, both up 8% year-over-year.\nJumiaPay and its fintech ambitionIn the second quarter, JumiaPay—Jumia’s financial and digital services—posted its largest-ever quarterly GMV processed.\nSource: JumiaLogistics servicesFor its logistics service to third parties, Jumia reached a major milestone by recording $1 million revenue from this service."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Today, we'll be discussing: What to expect at Techpoint Build 2021All you need to know about meme..."
  },
  {
    "headline": "“Watch out for pastor Eazi!” — Mr Eazi, on creative prospects beyond tech investments • Techpoint Africa",
    "summarized_story": "Seeing Mr Eazi very relaxed was quite the revelation because his demeanour was not too different from his public appearances and videos.\nMr Eazi also has an obsession, and you get no prizes for guessing that it is linked to the creative.\nMr Eazi and his friends also run Zadagat Capital, a syndicate fund that invests in the African tech space.\nIt’s more like an alternative merch for my fans.”There are other investment ventures associated with the Mr Eazi brand.\nBesides creating music and investing, Mr Eazi loves movies; he even thinks he’d do well as an actor."
  },
  {
    "headline": "UK-based tech company with a presence in NigeriaTorilo, launches all-in-one productivity tool, Bizedge",
    "summarized_story": "Share this article:On Friday, November 19, 2021, Torilo, a tech company headquartered in the UK with a presence in Nigeria building cutting edge tech solutions for business growth and development launched its latest product — Bizedge.\nBizedge is a productivity/business management tool that offers services that range from human resources, accounting to payroll, asset management and even generating error-free documents.\nBizedge: the future of workThe Bizedge suite has a wide array of productivity modules, eliminating the need of moving from one app to another.\nProduct Manager, Aderinola Adebanjo, says Bizedge is flipping the coin and changing the productivity tool narrative.\nAlthough Bizedge already has so much packed within one tool, Adebanjo says the team is working tirelessly to add more modules to the suite."
  },
  {
    "headline": "Unity against naughty lenders, Treepz on an expansion spree, Abeg’s dramatic growth",
    "summarized_story": "AdvertisementTo this end, six Nigerian agencies have agreed that this intimidation and harassment will no longer be condoned.\nRead here: 6 Nigerian agencies unite to fight data privacy abuse by money lending fintechsAnother acquisition from the stable of TreepzNigerian mobility tech company, Treepz (formerly Plentywaka) has acquired Ugandan bus company, Ugabus, to further its expansion plans.\nTwo acquisitions and a $2.8 million seed investment caps what has been an eventful year.\nSponsoring BBN helped the startup acquire 2 million users.\nNot a shabby return considering it spent $2 million from its pre-seed raise from local investors, and this was probably one of the largest pre-seed by a Nigerian startup."
  },
  {
    "headline": "Maiduguri, epicentre of Boko Haram siege hit by worsening power outages",
    "summarized_story": "“Every aspect of life – everything – has changed in Maiduguri,” Zango, 66, said.\nRead Also: NNPC, CMEC, GE seal deal for 50MW Maiduguri Power ProjectWorkers immediately fixed the transmission lines, but militants destroyed them within 48 hours.\nZango said grid power cost around 30,000 naira ($73.09) a month, while diesel costs 9,000 naira every day.\nNigerian oil company NNPC pledged in August to build a 50 megawatt, gas-fired power plant in Maiduguri to cut its reliance on transmission lines.\nIce seller Ahmed Yusuf can only run four of his 40 freezers and had to cut his 300 employees to 50 amid a near-doubling in diesel costs."
  },
  {
    "headline": "Shell leverages power business to deal with energy transition",
    "summarized_story": "The latest acquisition is the purchase of Powershop Australia, an online energy retailer with over 185,000 customers.\nIn Nigeria, just weeks ago, Shell officially launched its new outfit, Shell Energy Nigeria which aims to deliver competitive and reliable energy for power generation and industrial users and to develop gas distribution to serve people in new regions.\nUnder the arrangement with ICG, Shell Energy will also acquire wind power purchase agreements (PPAs) and has agreed on offtake arrangements with ICG associated with MEA’s hydro and wind assets.\nIn Nigeria, Shell Energy Shell Energy Nigeria’s gas solutions are designed to partner with other sources of energy – including renewables – to provide competitively priced and flexible energy, while helping the country to transition to a lower-carbon energy system.\nCountry chair of Shell Company in Nigeria, Osagie Okunbor, said Shell Energy Nigeria brings to Nigeria Shell’s decades of marketing and trading experience, a wealth of market knowledge and its ability to integrate energy solutions to support economic development in Nigeria."
  },
  {
    "headline": "Healthlane bets on Nigeria’s preventive healthcare market",
    "summarized_story": "Nigeria’s budding preventive healthcare market has attracted a fresh bet from a growing global firm, Healthlane, aiming to democratise access to optimised precautionary health services to all Nigerians.\nIt also aims to grab a substantial stake from the rising shift from sick care to a preventive healthcare technologies and services market estimated to hit $493.1 billion by 2027 globally, according to a 2021 UnivDatos Market Insights.\nWhile data on the spate of growth in Nigeria’s preventive care market remains scant, data show it is a growth area in some developed countries, especially the US.\nThe country, for instance, operates a patient protection and affordable “care act” that includes preventive healthcare on insurance provision at no added cost.\nIt was found that nearly 80 percent of healthcare data executives are upping their investments in big data analytics and artificial intelligence, which would positively impact the market growth."
  },
  {
    "headline": "Edo Govt Seeks Collaboration with NTA on MEGA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State Government has called for the support of the Nigerian Television Authority (NTA) in driving the administration’s agenda of Making Edo Great Again popularly known as MEGA.\nWhile making his welcome address, the Commissioner reinstated the commitment of Edo government under Mr. Obaseki to economic revolution and institutional reforms of Edo state which are driven by the MEGA agenda.\nHe appealed to NTA to key into the vision by informing and sensitizing the people about the programmes of Edo government.\nEarlier, the zonal director of NTA Benin Network Centre, Mrs. Pauline Igbanor congratulated Hon.\nSolomon Imohiensen and other staff members of the Edo Ministry of Communication and Orientation."
  },
  {
    "headline": "Obaseki: Edo 30-year plan’ll drive state’s socio-economic growth, devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has said the newly launched 30-year development plan is a comprehensive and all-encompassing document to drive sustainable socio-economic growth and development in the state over the next three decades.\nObaseki stated this while delivering his welcome address at a one-day workshop on the overview of Edo State Development and Physical Planning, organised by the Edo State Ministry of Physical Planning and Urban Development and the Ministry of Budget and Economic Planning.\nIt is a process whereby all stakeholders are brought together and tools are deployed to activate and animate the planning exercise.\nOther dignitaries at the event include Secretary to Edo State Government, Osarodion Ogie Esq.\n; Attorney General and Commissioner for Justice, Oluwole Iyamu SAN; Commissioner for Physical Planning and Urban Development, Isoken Omo, and the Commissioner for Water Resources, Moses Agbukor, among others."
  },
  {
    "headline": "Edo College of Nursing Sciences to be affiliated with FD University, USA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBEINN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Monday, received the letter of approval from the Nursing and Midwifery Council of Nigeria to commence training of nurses and midwives at the Edo State College of Nursing Sciences in Benin City, Edo State.\nNoting that the school’s benchmark should be the premium and premier nursing school in the country, the governor noted: “To achieve this, the Edo State Government is giving you a free hand to operate without interference.\n“We will also seek the permission of the Nursing and Midwifery Council of Nigeria to allow the Institution to be a continuing education provider.\nThis will enable the institution to run multiple programmes including programmes that will help nurses and staff to renew their licenses.\n“We would be in line with guidelines from the Nursing and Midwifery Council of Nigeria, which has given a mandate that, come 2023, all Diploma programmes would adhere to collegiate standards."
  },
  {
    "headline": "Retraction: Curbing Domestic Violence In The Society – Nigerian Observer",
    "summarized_story": "Check AlsoBENIN CITY – The Ohen, Odionwere and the entire people of Okhuoromi Village in Oredo …UHUNWONDE – Over what they described as strange happenings in the Village, the indigenes of …"
  },
  {
    "headline": "#EndSARS: Lagos panel report filled with errors, Lai Mohammed claims",
    "summarized_story": "The judicial panel in its report dismissed the government’s claims, and confirmed dozens of peaceful protesters were killed at the toll gate by state agents.\nAnother commentator, a journalist, called it a ‘disgraceful report by a disgraceful panel’, saying it reported allegations instead of investigating the allegations.\nYet another wondered how a Judicial Panel could use the words ‘massacre in context’ and equate such to a massacre.\nWhere are the family membersof those who were reportedly killed at Lekki Toll Gate?\nviii) – Why did the Judicial Panel feel compelled to concoct a ”massacre in context” as a euphemism for ”massacre”?"
  },
  {
    "headline": "SME.NG partners Access Bank, others for Ebi Marketplace",
    "summarized_story": "SME.NG is, in partnership with Access Bank Plc, Bank of Industry (BOI), LAPO Microfinance Bank, Chapel Hill Denham, and the Impact Investment Foundation Nigeria, launching the Ebi Marketplace – a Nigerian innovation for female entrepreneurs.\nThe Ebi Marketplace, the brainchild of Thelma Ekiyor, consists of an access to capital market, an e-commerce mall and a knowledge market for female entrepreneurs in Nigeria seeking to digitize their businesses.\nConceptualised and developed by SME.NG as a tangible solution to the impact of COVID-19 on female entrepreneurs, the Ebi Marketplace aims to close the gender digital divide in Nigeria by supporting women’s digital literacy and financial inclusion, while providing access to capital and markets.\nAccording to Ekiyor, SME.NG is committed to investing in facilitating female entrepreneurs’ profitability, so that they are positioned for infusion of capital.\nAccording to her, this innovation is supported by Nigerian investors for the Nigerian market."
  },
  {
    "headline": "#EndSARS: Again, Lai Mohammed denies Lekki tollgate massacre, says Lagos panel report riddled with discrepancies",
    "summarized_story": "OBINNA EZUGWUNigeria’s Minister of Information and Culture, Lai Mohammed, has again denied that anyone was killed at the Lekki tollgate in Lagos during the EndSARS protest last year.\nMr. Mohammed said the report by the panel set up by Lagos State to probe police brutality and the shooting at the tollgate, which had indicted the military and police in the killing of protesters at the Lekki tollgate, is riddled with discrepancies.\nThe Lagos panel report had said the “killing of unarmed protesters by soldiers on October 20, 2020 could be described in the context of a massacre”.\n“The report of the panel in circulation cannot be relied upon because its authenticity is in doubt.\nThere is absolutely nothing in the report, circulating, to change our mind that there was a massacre at the Lekki tollgate.”"
  },
  {
    "headline": "Nigerian govt to replace fuel subsidy with N5,000 transport grant for poorest citizens",
    "summarized_story": "Nigeria’s federal government says it will remove fuel subsidy by 2022 and replace it with a N5000-a-month transportation grant to the poorest Nigerians.\nZainab Ahmed, minister of finance, budget and national planning, disclosed this while speaking at the launch of the World Bank Nigeria Development Update (NDU) on Tuesday.\nMrs. Ahmed said the grant will go to about 20 to 40 million Nigerians who make up the poorest population of the country.\nAccording to her, the final number of beneficiaries will depend on the resources available after the removal of the fuel subsidy.\nThe World Bank in the development update had said the poorest 40% in Nigeria consume less than 3% of the total PMS in the country, highlighting that the rich were benefiting more from the subsidies, Cable reported."
  },
  {
    "headline": "NCDC says highly infectious Delta Covid-19 variant dominant in Nigeria, urges people to take vaccines",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) has said the Delta variant of Covid-19 continues to be the dominant strain of the virus in the country, and encouraged people to take vaccines to reduce risk of infection.\nNCDC Director-General, Ifedayo Adetifa, made the appeal on Monday at the bi-weekly national briefing on COVID-19, in Abuja.\n“I mention these to inform you that COVID-19 is still causing havoc in other countries and we must not take our situation for granted.\nWe are working to strengthen COVID-19 risk communications using innovative and targeted means by listening to the public and responding effectively,” he said.\n“The team is currently collaborating on the development of a COVID-19 response sustainability plan and an intra action review to strategise on ways to reinvigorate the response.”"
  },
  {
    "headline": "2022 Budget: Lawan Gives Appropriations C’ttee Wednesday Deadline",
    "summarized_story": "President of the Senate, Ahmad Lawan, has given the Senate Committee on Appropriations till Wednesday this week to conclude budget defense by subcommittees of the upper chamber.\nLawan explained that the ultimatum became necessary in keeping with the December 14 timetable for the passage of the 2022 budget by the National Assembly.\nLawan said, “According to our timetable for the budget defense and subsequent processing by out committees or subcommittees of the Appropriations Committee, tomorrow will be the last day for the budget defense.\n“Tomorrow will be the last day for the budget defense by subcommittees for appropriation before the committee on appropriations.\n“It is gladdening that all our committees have finished their budget defense with ministries, departments and agencies as programmed by this Senate."
  },
  {
    "headline": "2022 Budget: Lawan Gives Appropriations C’ttee Wednesday Deadline",
    "summarized_story": "President of the Senate, Ahmad Lawan, has given the Senate Committee on Appropriations till Wednesday this week to conclude budget defense by subcommittees of the upper chamber.\nLawan explained that the ultimatum became necessary in keeping with the December 14 timetable for the passage of the 2022 budget by the National Assembly.\nLawan said, “According to our timetable for the budget defense and subsequent processing by out committees or subcommittees of the Appropriations Committee, tomorrow will be the last day for the budget defense.\n“Tomorrow will be the last day for the budget defense by subcommittees for appropriation before the committee on appropriations.\n“It is gladdening that all our committees have finished their budget defense with ministries, departments and agencies as programmed by this Senate."
  },
  {
    "headline": "Reps Member Launches Education Grant For Constituents",
    "summarized_story": "A Member of the House of Representatives reprepresenting Ekiti/Irepodun/Isin/Oke-ero federal constituency of Kwara State, Hon.\nTunji Ajuloopin, has replaced the 2021 Ajuloopin Digital Empowerment Programme (ADEP) with Ajuloopin Education Grant for students of his constituency in the tertiary institutions.\nThe lawmaker said the institution of the education grant becomes necessary to help students in need of finany assistance and assuage the feelings of those who had earlier applied for ADEP 2021.\nADVERTISEMENTThe students according to the federal lawmaker must be from his constituency but could be studying in any of the public institution in the country.\nHe added that the gesture was to help students from the constituency for payment of tuition fees."
  },
  {
    "headline": "Reps Member Launches Education Grant For Constituents",
    "summarized_story": "A Member of the House of Representatives reprepresenting Ekiti/Irepodun/Isin/Oke-ero federal constituency of Kwara State, Hon.\nTunji Ajuloopin, has replaced the 2021 Ajuloopin Digital Empowerment Programme (ADEP) with Ajuloopin Education Grant for students of his constituency in the tertiary institutions.\nThe lawmaker said the institution of the education grant becomes necessary to help students in need of finany assistance and assuage the feelings of those who had earlier applied for ADEP 2021.\nADVERTISEMENTThe students according to the federal lawmaker must be from his constituency but could be studying in any of the public institution in the country.\nHe added that the gesture was to help students from the constituency for payment of tuition fees."
  },
  {
    "headline": "2023: NGO Trains Women, Youths On Advocacy, Lobbying",
    "summarized_story": "Ahead of the 2023 general elections and the apparent need for women and youths to be actively involved, a Kaduna-based non-governmental organisation (NGO), Legal Awareness for Nigerian Women (LAWN/LEADS) under its six-month “We-You-PRO” project has organised a three-day workshop for women and youths on how to advocate and lobby for political positions.\nAccording to her, “research has shown that we have low participation of women and youths in political space and governance – decision making in general.\n“When that is done, we hope to come up with a document like the charter of demand which the women and youths will use to mobilise for advocacy, lobbying and campaigns to see how the space can be widened.\n“To make this happen, there is the need for a political and legal environment for youths and women participation.\nWe have also noted that finance, cultural norms and religious values are some of the issues hindering women and youths from actively involved in politics."
  },
  {
    "headline": "INTERVIEW: Air Peace will continue to provide jobs, peace to Nigerians, billionaire founder, Allen Onyema",
    "summarized_story": "Some other day, it might be the turn of Medview to come to Air Peace, for the same codes sharing.\nI’m Air Peace, Air Peace is me.\nIf I’m to choose between FEHN and Air Peace, I will send Air Peace to the gallows and stick to FEHN.\nNot only Mrs. Jonathan, they have ascribed the ownership of Air Peace to so many people, including the owner of Peace Mass Transit.\nAir Peace is for peace and national cohesion and that is my conviction, wish and desire."
  },
  {
    "headline": "INTERVIEW: Air Peace will continue to provide jobs, peace to Nigerians, billionaire founder, Allen Onyema",
    "summarized_story": "Some other day, it might be the turn of Medview to come to Air Peace, for the same codes sharing.\nI’m Air Peace, Air Peace is me.\nIf I’m to choose between FEHN and Air Peace, I will send Air Peace to the gallows and stick to FEHN.\nNot only Mrs. Jonathan, they have ascribed the ownership of Air Peace to so many people, including the owner of Peace Mass Transit.\nAir Peace is for peace and national cohesion and that is my conviction, wish and desire."
  },
  {
    "headline": "How soldiers on reprisal invaded Imo community, burnt hotel, houses",
    "summarized_story": "In reprisal, military men regrouped, invaded the town and allegedly burnt a hotel, cars, houses and shops.\nThe incident which reportedly happened at Ishieke junction has caused panic in the area.\nA source said, “Some hoodlums attacked some soldiers at Ishieke junction in Awo Mmamma and killed one of them.\nLater, soldiers invaded the area and caused havoc in the area by setting a hotel, cars, houses and stalls on fire.\nMilitary men are ravaging our community."
  },
  {
    "headline": "How soldiers on reprisal invaded Imo community, burnt hotel, houses",
    "summarized_story": "In reprisal, military men regrouped, invaded the town and allegedly burnt a hotel, cars, houses and shops.\nThe incident which reportedly happened at Ishieke junction has caused panic in the area.\nA source said, “Some hoodlums attacked some soldiers at Ishieke junction in Awo Mmamma and killed one of them.\nLater, soldiers invaded the area and caused havoc in the area by setting a hotel, cars, houses and stalls on fire.\nMilitary men are ravaging our community."
  },
  {
    "headline": "Lai Mohammed lists 10 gaps in EndSARS panel report, insists no massacre",
    "summarized_story": "Minister of Information Lai Mohammed has thrown the report of the Lagos Judicial Panel into the dustbin, insisting there was no massacre at Lekki Toll Gate.\nMohammed said he was out of Nigeria when the report of the EndSARS judicial panel was submitted to the Lagos State Governor, Babajide Sanwo-Olu last week.\nYet another wondered how a Judicial Panel could use the words ‘massacre in context’ and equate such to a massacre.\nWhy did the Judicial Panel feel compelled to concoct a ”massacre in context” as a euphemism for ”massacre”?\nCNN AND OTHERSThe CNN has been celebrating the leaked report of the Lagos State Judicial Panel of Inquiry."
  },
  {
    "headline": "Lawan issues Appropriations C’ttee deadline to conclude budget defense",
    "summarized_story": "President of the Senate, Ahmad Lawan, has given the Committee on Appropriations till Wednesday this week to conclude budget defense by subcommittees of the upper chamber.\nLawan explained that the ultimatum became necessary in keeping with the December 14 timetable for the passage of the 2022 budget by the National Assembly.\nLawan said, “According to our timetable for the budget defense and subsequent processing by out committees or subcommittees of the Appropriations Committee, tomorrow will be the last day for the budget defense.\n“Tomorrow will be the last day for the budget defense by subcommittees for appropriation before the committee on appropriations.\n“It is gladdening that all our committees have finished their budget defense with ministries, departments and agencies as programmed by this Senate."
  },
  {
    "headline": "BREAKING: Gunmen Raze Imo Police Station, Kill Cop",
    "summarized_story": "Gunmen have attacked and burnt a police Divisional headquarters in Arondizuogu in Ideato Local Government Area of Imo state.\nThe attack which happened around 2:00 am on Tuesday left one of the police officers on duty dead.\nSources in the community disclosed that the attack left the Divisional Police Officer of the Division with a broken head after he was attacked by the invaders.\nAlso, a Sienna vehicle attached to the division and DPO’s personal vehicles were vandalized by the gunmen.\nThey gave him matchet cuts and vandalized his Jeep and a police sienna vehicle belonging to the division,” a source who pleaded anonymity told Punch Newspapers."
  },
  {
    "headline": "BREAKING: Lagos EndSARS Report Not Reliable — Lai Mohammed",
    "summarized_story": "The report of the Lagos State judicial panel on the shooting at the Lekki toll gate has been dismissed by the Federal Government.\nIn a news conference in Abuja, Minister of Information and Culture, Lai Mohammed, criticized the study, saying it could not change the government’s position about the massacre.\n‘Tales by moonlight,’ the minister said of the Lagos judicial panel’s report.\n“There’s absolutely nothing in the report that is circulating to make us change our minds that there was a massacre in Lekki on October 20, 2020,” he said.\nYou’re welcome.”"
  },
  {
    "headline": "APC Leader, Bola Tinubu’s 2023 Presidential Manifesto Leaks",
    "summarized_story": "While speculations about Asiwaju Bola Ahmed Tinubu’s interest in the 2023 presidential election have been rife for months, the leak of the former Lagos State governor’s manifesto has put to rest any doubts about whether the All Progressives Congress (APC) chieftain would run for the country’s top job.\nThe manifesto, titled “Seven Point Agenda: The Rebirth Manifesto,” outlined Tinubu’s vision for Nigeria if he were elected president.\nSources disclosed to Naija News that Tinubu, a former Lagos State governor, would declare his presidential ambition officially.\nTinubu’s latest moves, which included a visit to Kano State earlier this year, have given his presidential ambitions even more legitimacy.\nOrji Uzor Kalu, a former governor of Abia State, recently paid Tinubu a visit, sparking rumors about his bid to succeed Buhari."
  },
  {
    "headline": "Imo Residents Flee Homes As Gunmen Kill Soldiers",
    "summarized_story": "Hundreds of residents in Awo-Mmamma community, Oru East Local Government Area, Imo State, who evacuated their houses after gunmen allegedly killed a military man on Monday afternoon expressed disappointment at having to spend the night in the bush.\nHe said, “as I speak to you now, many more houses may be burnt tonight.\nWe’re now at the mercy of angry soldiers.\n“Hundreds of our people may pass this night in the bush.\nThe Army Spokesman, when contacted said he will get back to us, but as at the time of filing the report, he was yet to get back."
  },
  {
    "headline": "Breaking: FG slams Lagos #ENDSARS panel, says report mere rehearse of old allegations",
    "summarized_story": "The federal government Tuesday disowned the report of the Lagos #ENDSARS panel, describing it as mere rehearse of allegations previously made.\nIt also said the report was meant to embarrassment to the federal government and its agencies.\nMinister of Information and Culture Lai Mohammed said this while addressing jourmalists in Abuja.\nDetails loading…"
  },
  {
    "headline": "Breaking: 45 dead as bus catches fire",
    "summarized_story": "At least 45 people have died after a bus caught fire on a motorway in western Bulgaria, local officials say.\nThe incident happened after 02:00 local time near the village of Bosnek, the interior ministry is quoted as saying by the BTA news agency.\nChildren were among the victims, the head of the fire safety department at the interior ministry, Nikolai Nikolov, told private BTV television.\nThe bus was reportedly travelling from Turkey to North Macedonia.\nDetails loading…"
  },
  {
    "headline": "Electoral Act: All eyes now on Buhari for his assent – Lawan",
    "summarized_story": "Senate President Ahmad Lawan has said members of the National Assembly have done their job by transmitting the Electoral Act Amendment Bill 2021 to President Muhammadu Buhari to sign it into law.\n“Yes, of course, when we send a bill to Mr. President, we expect the bill to be signed.\nBut I believe that whatever we do in the National Assembly, especially this ninth National Assembly, we think deep, we think wide, we will consult very broadly before we take any position.\n“So, I believe that whatever we send to the executive arm of government, Mr. President for his assent, these are things that are well thought out.\n“Direct primaries will ensure a credible electoral system where the people will choose candidates that are trusted enough to promote the development of the society."
  },
  {
    "headline": "Lagos #EndSARS Report Riddled With Errors, Inconsistencies – Lai Mohammed",
    "summarized_story": "﻿The Minister of Information and Culture, Alhaji Lai Mohammed, has said that the #EndSARS report by the Lagos State Judicial Panel of Inquiry was riddled with so many errors and inconsistencies.\nYet another wondered how a Judicial Panel could use the words ‘massacre in context’ and equate such to a massacre.\nCNN AND OTHERSThe CNN has been celebrating the leaked report of the Lagos State Judicial Panel of Inquiry.\nSecondly, CNN rushed to the air to celebrate an unsigned and unverified report that is riddled with inconsistencies, errors, discrepancies, innuendoes.\nii) – We reject the notion that our soldiers and policemen massacred innocent Nigerians at Lekki on Oct. 20th 2020."
  },
  {
    "headline": "Two Killed As Troops Disperse IPOB Arsonists In Imo – Army",
    "summarized_story": "The Nigerian Army has explained how a soldier and an IPOB member were killed during a gun battle in Oru East Local Government Area of Imo State where troops dispersed some IPOB members who were setting properties of residents ablaze.\nAccording to a statement signed on Tuesday by Major Abubakar Abdullahi, the Acting Deputy Director Army Public Relations 82 Division Nigerian Army, the IPOB members set ablaze properties of innocent residents to compel them to comply with the sit-at-home order.\n“The troops again returned to the junction to disperse the hoodlums.\nUnfortunately, a gallant soldier paid the supreme prize in defence of the people,” the statement by the Nigerian Army read in part.\nThe Nigerian Army, therefore, appealed to residents of Imo State to ignore all propaganda and threats and go about their legitimate business."
  },
  {
    "headline": "INEC, Civil Society Ask Buhari To Sign Electoral Amendment Act Bill",
    "summarized_story": "The Independent National Electoral Commission (INEC) and civil society organisations on Monday called on President Muhammadu Buhari to sign the Electoral Act Amendment Bill.\nThe National Assembly has passed the bill and transmitted the document to President Buhari on November 19 for assent.\nREAD ALSO: Capital Funding For Army ‘Grossly Inadequate’ – NdumeOn his part, Nwankwo said it is expedient for the electoral act amendment bill to be signed for the overall benefit of Nigerians.\n“I think it is expedient to have this bill signed.\n﻿The bill empowered the electoral umpire to determine the use of electronic voting as well as the transmission of results in an election."
  },
  {
    "headline": "Capital Funding For Army ‘Grossly Inadequate’ – Ndume",
    "summarized_story": "﻿The Chairman, Senate Committee on Army, Senator Ali Ndume, has reiterated calls for increased funding for the army.\nThe Senator made the call on Monday to members of the appropriations committee before submitting the final 2022 budget proposal of the Nigerian Army.\nNdume said the increased funding was critical as the army was engaged in unconventional war across the country.\nBut the capital aspect of it is grossly inadequate.\nNo matter what you do, if they don’t have the arms and ammunition, then the war cannot be effectively prosecuted."
  },
  {
    "headline": "Nigerian Air Traffic Controllers Threaten Strike After Colleague’s Death",
    "summarized_story": "Nigerian Air Traffic Controllers’ Association has lamented poor working conditions and threatened industrial action following the death of their colleague, Aniekan Effiong Inuk, at the Nnamdi Azikiwe International Airport, Abuja.\nAir Traffic Controller Dies At Airforce Base Clinic“Nigerian Air Traffic Controllers’ Association (NATCA) rose from an emergency meeting conveyed over the tragic, painful, and avoidable exit of one of our diligent and dedicated colleague, Mr. Aniekan Effiong Inuk in the early hours of Monday November 22, 2021.\n“The death of Mr. Aniekan Effiong Inuk on active duty at Abuja airport whose sad event is not unconnected with the unavailability of an operational vehicle to move him to a hospital in record time amongst others is one too many.\n“Hence, Air Traffic Controllers are embarking on a three (3) hours flow control for two days, 23rd and 24th November 2021 from 0600UTC to 0900UTC to register our displeasure and call the attention of relevant authorities and the public to quickly address our concerns without further delay,” the statement read in part.\nThe Association demands that NAMA management and relevant authorities should immediately do the following:"
  },
  {
    "headline": "Akeredolu, Security heads celebrate retiring Commissioner of Police, Bolaji Salami",
    "summarized_story": "Ondo State Governor, Rotimi Akeredolu has described the retiring Commissioner of Police in the state, Bolaji Salami, as a gentleman who is dedicated to duty.\nGovernor Akeredolu saluted him for being a reliable officer, describing him as a team player.\nAt a brief valedictory session held in his honor during the State Security Council Meeting on Monday, Governor Akeredolu commended the manner the Commissioner of Police handled the #Endsars crisis in the state, describing it as impressive.\nGovernor Akeredolu also applauded the retiring officer for his collaboration with other security agencies in the state, saying he is a bold man.\nI cherish coming here to work with you and I will say that I enjoyed everything in this state,” the retiring CP added."
  },
  {
    "headline": "President Buhari, APC Governors agree February 2022 for National Convention -",
    "summarized_story": "The ruling All Progressives Congress (APC) has tentatively scheduled its national convention to sometime in February, 2022.\nThis was disclosed to State House Correspondents on Monday by Chairman of the Progressive Governors Forum (PGF) Governor Atiku Bagudu after a closed-door meeting with President Muhammadu Buhari.\nBagudu met the President with the Caretaker Committee Chairman of the APC Governor Mai Mala Buni and his Jigawa counterpart, Mohammed Badaru.\nThe meeting with APC Governors was preceded by another meeting, also behind closed-door, with Senate President Ahmad Lawan at the Presidential Villa, Abuja."
  },
  {
    "headline": "Senator Marafa's Faction holds APC Congress In Zamfara LG's -",
    "summarized_story": "Hamza Mko -Tsafe LGA, Hon.\nTukur Waliyi – Bungudu LGA, Alh.\nSani Gyare kadauri – Maru LGA, Sa’idu Barebari- Gummi LGA, Al Mustapha Yakubu- Anka LGA others are Nasiru Sha’ibu – Bukkuyum LGA, Alh.\nSani Muh’d Kaya- Maradun LGA, Bello Halliru – Bakura LGA and Bello Sulaiman BS – Kaura Namoda LGA, Alh.\nIbrahim Imam – Birnin magaji LGA, Sirajo Ibrahim – Shinkafi LGA and Yakubu Mukhtar- Zurmi LGASenator Kabiru Marafa had on Friday last week Condemned the move by the APC National Headquarters to conduct Ward congresses in zamfara and vow to challenge the process in court."
  },
  {
    "headline": "Senate Transmits Electoral Act Amended Bill 2021 to Presidential Buhari -",
    "summarized_story": "The Senate has transmitted the Electoral Act amendment Bill 2021 to President Muhammadu Buhari for his assent.\nThe two Chambers of the National Assembly recently passed the bill after a conference meeting to iron out the inconsistencies in the separate bills passed by both chambers.\nThe two Chambers of the National Assembly recently passed the bill after a conference meeting to iron out the inconsistencies in the separate bills passed by both chambers.\nThe transmission of the bill to President Muhammadu Buhari was contained in note signed by the Senior Special Assistant to President Muhammadu on National Assembly Matters, Senate, Senator Babajide Omoworare.\nThe transmission of the bill to President Muhammadu Buhari was contained in note signed by the Senior Special Assistant to President Muhammadu on National Assembly Matters, Senate, Senator Babajide Omoworare."
  },
  {
    "headline": "Nigeria Will Replace Fuel Subsidy with N5,000 Transport Grant for Poorest Citizens",
    "summarized_story": "Zainab Ahmed, Nigeria’s minister of finance, budget and national planning, says Nigeria will remove fuel subsidies by 2022 and replace them with a N5000-a-month transportation grant to the poorest Nigerians.\nSpeaking at the launch of the World Bank Nigeria Development Update (NDU) on Tuesday, the minister said the grant will go to about 20 to 40 million Nigerians who make up the poorest population of the country.\nShe said the final number of beneficiaries will depend on the resources available after the removal of the fuel subsidy.\nThe World Bank in the development update had said the poorest 40% in Nigeria consume less than 3% of the total PMS in the country, highlighting that the rich were benefiting more from the subsidies.\nAhmed said this move is set for June 2022, but the federal government hopes to do this before June — in line with the Petroleum Industry Act (PIA)."
  },
  {
    "headline": "#EndSARS: Nigeria Government Discredits Lagos Panel Report, Calls It ‘Recycled Fake News’",
    "summarized_story": "Nigeria’s Minister of Information Lai Mohammed has dismissed the report submitted by the Lagos State EndSARS panel on Police Brutality as a hoax, which did not follow the evidence at hand.\nMohammed said it was shocking that the same allegations made by Nigerians were merely compiled and submitted as a report by the panel set up to investigate the claims of police brutality.\n“It is an intimidation of the majority by a minority,” Mohammed submitted."
  },
  {
    "headline": "Nigerian Politicians Are Messing up God’s Design for Our Country – Dr. Chukwuemeka Ezeife",
    "summarized_story": "As respected leaders from the southeast mount pressure on President Muhammadu Buhari to grant amnesty to Nnamdi Kanu, leader of the outlawed Indigenous People of Biafra, the one thing they appear to have forgotten is that Kanu has a track record of breaking promises.\nNot only did Kanu violate the terms of his bail in 2017 after his release from detention by a Federal High Court, he transformed into a megalomaniac that created an armed wing to attack the Nigerian state in his quest for the restoration of the Republic of Biafra in the southeast.\nDespite this, some leaders from the region are confident that they can keep him in check once he is released to them.\nIn this interview, Dr. Chukwuemeka Ezeife, a former governor of the state, tells ARISE what has changed between 2017 when Kanu jumped bail and fled the country, and why he should be given a third chance.\nDr. Ezeife was a member of the delegation that met with Buhari last week to plead for Kanu’s release."
  },
  {
    "headline": "Kevin Spacey to Pay $31m to Studio after Abuse Claims",
    "summarized_story": "A mediator has ordered Kevin Spacey to pay nearly $31m (£23.2m) to the studio that made the hit Netflix show, House of Cards, for breach of contract following sexual harassment allegations against the US actor.\nMRC and Netflix fired Mr Spacey from House of Cards and wrote him out of the show.\nMr Spacey and his production companies, M Profitt Productions and Trigger Street Productions, were ordered to pay damages, lawyers fees and court costs.\nMr Spacey issued a statement saying he did not remember the encounter, but that he owed Mr Rapp “the sincerest apology for what would have been deeply inappropriate drunken behaviour”.\nIn the statement, Mr Spacey also revealed he would now live as a gay man."
  },
  {
    "headline": "Ethiopia PM Abiy Says He Will Lead Army ‘from the Battlefront’",
    "summarized_story": "Ethiopia’s Nobel Peace Prize-winning prime minister says he will lead his country’s army “from the battlefront” beginning Tuesday, a dramatic new step in a devastating yearlong war.\n“This is a time when leading a country with martyrdom is needed,” Prime Minister Abiy Ahmed said in a statement posted on social media Monday night.\nWith rival Tigray forces moving closer to the capital of Addis Ababa, his government declared a state of emergency earlier this month.\nThe statement by the prime minister, a former soldier, did not say where exactly he will go Tuesday.\n“Let’s meet at the battlefront,” the 45-year-old prime minister said."
  }
]