[
  {
    "headline": "Kwara man who allegedly buries nine-year-old with N1,000 note arrested",
    "summarized_story": "Gunmen raid farm settlement, kill teenager, NSCDC probes attackCrack detectives from the Kwara State Police Command have arrested a man, Alade James, for allegedly killing and burying a nine-year-old girl, Faith Samuel.\nThe police said James buried the victim in Offa in the Offa Local Government Area of Kwara State with the aim of using her for a money ritual.\nThe state Police Public Relations Officer, Ajayi Okasanmi, in a statement on Sunday, said operatives, who exhumed the corpse, discovered that it was buried with a N1,000 note.\nPreliminary investigation revealed that the suspect had killed and buried the nine-year-old girl, Faith Samuel, of Onireke area Offa.\nAccording to the NSCDC spokesman in Kwara State, Babawale Afolabi, the incident occurred around 8pm."
  },
  {
    "headline": "Court summons, threatens Lagos CP with jail over seized truck",
    "summarized_story": "Justice Aluko also ordered the IG to produce the Lagos State Commissioner of Police, Hakeem Odumosu, and the other officers who were co-respondents in court for contempt proceedings over alleged violation of the court’s order.\nAlade, a truck driver, commenced the suit before Justice M. A. Onyetenu on March 10, 2021, through his counsel, Love Okwuokei.\nThe applicant claimed that policemen from the Isolo Police Division arrested him on the allegation that he hit an electric pole with his truck.\nAt the commencement of proceedings last Friday, the judge berated the police for disobeying the court order.\nI don’t want to conclude that the IG and the Commissioner of Police, Lagos State, would wrongly flout the order of this court."
  },
  {
    "headline": "Youths mourn as gunmen kill Imo law undergraduate, dump corpse on highway",
    "summarized_story": "There was panic in Imo State on Saturday after the corpse of a 300-level law student of the Imo State University, Kenneth Ibe, was found by the roadside.\nIbe, a youth leader in the state, was kidnapped on Friday night alongside another man, on the way to a Christian wake in Uguiri in the Isiala Mbano Local Government Area of the state.\nWhile the other victim escaped from the kidnappers’ den, Ibe was killed by the abductors.\nSeveral youths took to their social media pages on Saturday to mourn Ibe, who reportedly played prominent roles in the National Association of Nigerian Students.\nA youth leader, Darlington Onyelike, wrote on Facebook, “Rest in peace, Kenneth Ibe."
  },
  {
    "headline": "Fani-Kayode: The Stomach Infrastructure Ambassador",
    "summarized_story": "An article with the above headline was published in the CICERO column of THISDAY on Sunday, September 19, 2021.\nWe consider it nothing but an opinion which, though unwarranted and unkind, the writer is entitled to have and express.\nEven though this fake news and the patently false and fabricated quote has been all over social media since 2013, we have ignored it.\nWe urge you to kindly publish this letter in order to set the record straight.\nMeanwhile, we continue to hold you and your newspaper in the highest esteem and we wish you well."
  },
  {
    "headline": "Nigeria, 99 countries set to celebrate 2021 World Rivers Day Sept 27",
    "summarized_story": "By Gabriel Ewepu – AbujaNigeria and other 99 countries set to celebrate the 2021 World River on September 27, 2021, following importance of rivers to human existence and development.\nDuring this year’s celebrations, about 100th countries will mark the 2021 World Rivers Day on Sunday, September 26, with both physical and virtual activities.\n“In Nigeria, the 2021 World Rivers Day is celebrated simultaneously at the Federal and State levels with special focus on creating public awareness on the importance of Rivers, river clean-ups, river restoration, protection and conservation”, it added.\nRivers slated for the riverside celebration across the country include, River Wupa, Airport Road, Abuja, FCT; River Kwa, Akamkpa L.G.A, Cross River State; River Benue at Geriyo in Yola, Adamawa State; River Otamiri at Egbu in Owerri, Imo State; River Ikpoba at Ikpoba Hill in Benin City, Edo State; River Ngada in Maiduguri, Borno State; River Benue in Makurdi, Benue State.\nOthers are River Ogun in Abeokuta, Ogun State; River Yashi in Bosso L.G.A, Niger State; River Asa, Aliara in Ilorin, Kwara State; New Calabar River in Port-Harcourt, Rivers State; River Etiope in Etiope L.G.A., Delta State; River Challawa at Gadar Danko in Kano, Kano State; and River Kaduna in Kaduna, Kaduna State."
  },
  {
    "headline": "ALGON EXHIBITION FOR NIGERIA @ 61: Delta contingents arrive Abuja",
    "summarized_story": "By Festus Ahon, ASABADelta State contingents have arrived in Abuja to grace Nigeria at 60 Association of Local Governments of Nigeria, ALGON, Exhibition and Lecture scheduled to be formally opened tomorrow.\nThe Delta State Chairman of ALGON, Barr Victor Ebonka and Special Adviser to Governor Ifeanyi Okowa, Directorate of Local Government, Hon Kelly Penawou,In a statement, said the contingents from all the 25 Local Government Councils in the State are expected to exhibit their respective agricultural, cultural and other endowments.\nThe five days event beginning from 26th to 30th of September with the theme; “Nigeria’s Third Tier of Government As Stimulant For Cohesion, Unity, Economic Growth and Development”, would hold at Old Parade Ground, Area 10, Abuja.\nVanguard News Nigeria"
  },
  {
    "headline": "Ejigbo Plane Crash: AFCSC remembers 165 deceased officers",
    "summarized_story": "The Armed Forces Command and Staff College (AFCSC), on Sunday, held a memorial service for the 165 military officers who died in a plane crash in 1992 at Ejigbo on the outskirts of Lagos.\nRecall that Nigeria Air Force C-130 plane crashed on Sept. 26, 1992, killing all the passengers and crew members.\nReports have it that this is the fourth year the College is observing a memorial ceremony in honour of the 165 deceased officers.\nIn her remarks, Mrs Stella Onabolu, wife of one of the deceased officers, thanked the Armed Forces Command and Staff College for remembering their husbands in a grand style.\n“They died for the nation, and the nation is remembering and recognising them despite having died 29 years ago,” she said."
  },
  {
    "headline": "61st Independence: Fear God, Cleric admonishes leaders",
    "summarized_story": "Mr Adewale Adebiyi, the Provost of the Cathedral of St. Peter, Aremo, Ibadan, has admonished leaders in the country to rule with absolute fear of God.\nAdebiyi, a reverend, gave the advice in his sermon on Sunday during a special thanksgiving service to commemorate Nigeria’s 61st independence anniversary, held at the Cathedral of St Peter, Aremo.\nThe cleric, who admonished the nation’s leaders to uphold justice and fairness on all issues, charged them to continue leading in accordance with God’s injunctions.\nHe also implored citizens of the country to be patriotic and courageous in their day to day activities.\nSeyi Makinde, urged residents of the state to continue to support and pray for the government to succeed in its avowed determination to uplift the state."
  },
  {
    "headline": "We won’t open Minna-Bida road – Niger govt to trailer, tanker drivers",
    "summarized_story": "The Niger State Government says the continued blockade of Bida-Lambata, Lambata-Izom expressways by drivers of tankers, trucks and other articulated vehicles would not compel it into opening the Minna-Bida road to them.\nA statement issued by Secretary to the State Government (SSG), Ahmed Ibrahim Matane, and made available to newsmen in Minna, said the road is state-owned and under reconstruction.\nHe appealed to owners of the vehicles to talk to their drivers to remove their trucks and tankers from the roads.\nThe SSG warned, ” ….the State Government would not take liability for damaged vehicles or goods as a result of any unfortunate incidence that may arise.\nWe will not move our vehicles until you act – Trailer, tanker drivers dare Niger govt"
  },
  {
    "headline": "Stop begging S/East politicians for money in our name – IPOB warns scammers",
    "summarized_story": "The leadership of the Indigenous People of Biafra, IPOB, at the weekend has warned that scammers should desist from using its name to beg for money from Nigerian politicians, especially those who hail from the southeast region.\n“IPOB under the able leadership of our Leader Mazi Nnamdi Kanu did not send anybody on such shameful errand.\nWe don’t solicit financial support from politicians.\nWe have nothing to do with Nigerian politicians; we don’t need their money!\n“We also wish to advise gullible and greedy politicians not to deal with or give money to anyone claiming to have been sent by IPOB."
  },
  {
    "headline": "Kaduna: Police train 312 Civilian Joint Task Force personnel to curtail insecurity",
    "summarized_story": "As part of efforts to boost security presence in the state, 312 personnel of the Kaduna State Joint task Force known as the ‘Civilian JTF’ have graduated from the Police College, Kaduna.\nThe State Chairman of the security outfit, Shehu Dantudu, in a statement in Kaduna on Sunday, explained that the officers were trained in order tohave the technical know-how on handling security matters.\nAccording to him, another set of members would receive similar training at the Police College, Kaduna, in November 2021.\nAlthough he did not mention the number of his officers that would benefit from the November 2021 training, he said the outfit was to augment the government’s efforts in combating insecurity across the 23 local government areas of the state.\nThe statement thanked the Inspector General of Police, the Commandant of the College, the Headmaster, and those that help in one way or the other."
  },
  {
    "headline": "Independence Day: Wike berates NASS for lack of oversight function on executive",
    "summarized_story": "Governor Nyesom Wike of Rivers State has taken a swipe at the National Assembly for not doing enough oversight on the executive arm of government.\nGovernor Wike, who was speaking during an interdenominational church thanksgiving in commemoration of the 61st anniversary of Nigeria in Port Harcourt on Sunday, berated the National Assembly for always accepting whatever the executive brings without proper scrutiny.\nA legislature that cannot see that Nigerian has gotten to the age for conducting a free and fair election.\n“A legislature that will close their eyes, any time they want to borrow they borrow.\n“So indeed what are we celebrating?”The Governor also lamented over the “intimation” of judges in Nigeria, claiming that judges have abandoned their duties because of fear."
  },
  {
    "headline": "10 abducted Bethel Baptist High School students regain freedom in Kaduna",
    "summarized_story": "Ten more out of the 21 students of Baptist High School, Damishi, Kaduna, kidnapped by bandits on Sunday regained their freedom.\nThe students were released this afternoon and have since been returned to their parents.\nJohn Joseph Hayab, told DAILY POST that the remaining 11 students are still in the hands of the bandits.\nDAILY POST recalls that the 121 students of Bethel Baptist High School, Damishi, Kaduna, were abducted in their school on 5th July 2021 and since then they have been released in batches with 11 of the abducted students still in the hands of the kidnappers.\nBethel Baptist School: UN reacts to abduction of Nigerian students, tasks govt"
  },
  {
    "headline": "COVID-19: Over 4.6m Nigerians vaccinated",
    "summarized_story": "He made the disclosure during the Southsouth zonal town hall meeting on COVID-19 vaccination, which was organised by the Presidential Steering Committee on COVID-19, in collaboration with NPHCDA, which took place at the Government House, Benin, Edo State.\nShuaib disclosed that of the 4,680,000 vaccinated Nigerians, 1,865,127 were fully vaccinated with the two doses.\nHe said: “The way out of this is to get vaccinated, because the people who have taken the COVID-19 vaccines have full protection, while the unvaccinated persons are exposed to danger.\n“The Federal Government is working with the private sector for the production of COVID-19 vaccines in Nigeria.”Health minister also revealed that over 90 percent of deaths recorded from COVID-19 were from unvaccinated people.\nEdo Governor, Godwin Obaseki, while also speaking, disclosed that the Southsouth state had so far vaccinated over 130,000 residents against the ravaging COVID-19."
  },
  {
    "headline": "National Assembly mere rubber stamp, Wike alleges",
    "summarized_story": "By Mike Odiegwu, Port Harcourt- Advertisement -Rivers Governor Nyesom Wike has carpeted the National Assembly for approving anything for the Presidency without minding the consequences of their actions.\nOther countries are talking about how their elections will be transparent, we are talking about how we will rig the election in 2023.\n“Simple thing, transmit election results electronically to show transparency, that really that the person you’re declaring won the election but we are afraid.\nA legislature that cannot say that this money we are borrowing where is it, where are you applying it?\nThe Governor said it was regrettable that 61 years after independence Nigeria was still grappling with leadership challenge."
  },
  {
    "headline": "‘Registration of BDCs by IBB behind naira’s current woes’",
    "summarized_story": "Senator Ibrahim, who represented Kwara South in the 8th National Assembly, added that the BDCs were introduced to legalise the then unregistered black market.\n“As a nation, we have neglected the abundant areas of agriculture to the detriment of employment, production, income, as well as foreign exchange earnings.\n“We have neglected production to the extent that all our major production industries have collapsed and we have substituted local production with importation of foreign goods.\n“We have prioritized consumption as a nation over and above production, and our tastes are shaped by foreign products with local products facing too many challenges to compete with their foreign counterparts or even survive.\n“It is to stop paying lip service to instituting a concrete savings culture at all levels of government; federal, state and local."
  },
  {
    "headline": "Kaduna: Gunmen storm church, community, kill 2, injure several worshippers",
    "summarized_story": "From Noah Ebije, KadunaGunmen as well as bandits on Sunday attacked ECWA Church, Gabaciwa in Kachia local government area of Kaduna State, killing one worshipper and injured several others.\nThis was just as reported added that bandits invaded Bina community of Igabi local government area of the State and killed one person.\n“The Governor of Kaduna State, Malam Nasir El-Rufai, has condemned in the strongest terms an attack against worshippers on Sunday morning by gunmen.\n“Security agencies reported to the Government that the attack occurred at ECWA Church, Gabaciwa in Kachia local government.\n“The Governor condoled the ECWA Church and the family of the deceased in particular, and prayed for the repose of the soul of the worshipper."
  },
  {
    "headline": "Kalu facilitates distribution of educational materials in Abia North",
    "summarized_story": "The Senator representing Abia North and Senate Majority Chief Whip, Dr. Orji Uzor Kalu has expressed delight over the commencement of distribution of educational materials he attracted for schools in his constituency.\nKalu’s media aide in the South East, Maduka Okoro who made this known said the distribution of the educational materials which commenced on Friday, would be held across the five Local Governments Areas of Abia North.\n“The educational materials distribution to the students forms part of my empowerment to support the educational dreams of our young ones.\nIt is on this note that I facilitated the procurement and onward distribution of these materials”, Okoro quoted Kalu as saying.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "IPOB, Yoruba nation agitators dare Buhari in New York",
    "summarized_story": "Some journalists were also not spared as some of the protesters accused them of writing “rubbish” in favour of the Buhari administration.\nThe protesters accused them of being aiding and abetting Fulani herdsmen, who they accused of killing members of other tribes in Nigeria.\nOne of the leaders of Yoruba nation, Foluso Aruleba, who apologized to some of the journalists hounded said: “Please forgive our people.\nWe work and pray, pray and work.\nIsaiah 26:3.”Get paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "2023: God‘ll be against Jonathan getting automatic presidential ticket in APC – Nabena, ex-party spokesman",
    "summarized_story": "Even when they labelled APC an Hausa party in Bayelsa, we took the governorship ticket, a senatorial and two House of Representatives seats.\nHow do you feel hearing the speculation that APC is lobbying former President Goodluck Jonathan for 2023 presidential ticket?\nBy the way, having attained the highest office in the land, what is he looking for again joining the APC?\nIn fact, he cannot get APC ticket by God’s grace and I am very sure that God will not even allow him get it.\nIf the state governors cannot secure the people after collecting a security vote they should not put pressure on the Federal Government."
  },
  {
    "headline": "I want to redefine African film with African stories –Sandra Bremaud, filmmaker",
    "summarized_story": "By Rita OkoyeAside being a filmmaker, Sandra Bremaud is also a lover of nature.\nApril Showers was inspired by women who are striving and conquering in their fields of work through hard work and intelligence.\nThere are so many angles one can see it from, and that is what makes April Showers a unique movie for every African.\nI want to help redefine the African film industry by telling our African story the same way an American will tell an American story.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Buhari Back in Abuja after a Week-long Official Visit to UN",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari is back in Abuja, the nation’s capital, after a week-long stay in New York, United States of America (USA), to attend the 76th Session of the United Nations General Assembly (UNGA).\nThe president, whose official plane, Nigeria Air Force 1, touched down at the Nnamdi Azikiwe International Airport, Abuja at about 5:20am on Sunday, left immediately for his abode at the Presidential Villa in Asokoro.\nWhile in New York, President Buhari, apart from addressing the United Nations General Assembly last Friday, also engaged in a number of diplomatic and trade meetings with other leaders from different parts of the world.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "After 10 Years Study, INEC Says Nigeria Ready for Electronic Voting",
    "summarized_story": "The commission sought a clear legal mandate for the implementation of the electronic transmission of election results with the Electoral Act amendment.\n“It is worthy of note that none of the sides in this controversy appears to substantially question the desirability of electronic transmission of election results.\nINEC stated that the answer to the question of the desirability of electronic transmission of election results in Nigeria today may be summed up in three words – trust, efficiency, and safety.\nINEC said the conclusion it drew from the “diverse pilots conducted since 2011 is that the country is ready for electronic transmission of results.\nThis partnership has continued with the discussion on electronic transmission of results,” INEC added."
  },
  {
    "headline": "SANs Tackle Malami, Insist VAT Not on Exclusive List",
    "summarized_story": "One, generally speaking, as you rightly know, the issue of the Value-Added Tax is an issue on the Exclusive Legislative List,” Malami said.\n“And the implication of being in Exclusive Legislative List matter is that only the National Assembly can legislate on it.\nBut another senior lawyer, Mr. Ahmed Raji (SAN) expressed the belief that Malami was misquoted, not heard properly, or misrepresented in his claim that VAT is on the Exclusive Legislative List.\n“In other words, the VAT cannot be located in either the Exclusive or Concurrent Legislative List.\nHe, therefore, contended that the VAT “is not on the Exclusive Legislative List at all."
  },
  {
    "headline": "Emefiele: CBN’s COVID-19 Interventions Account for 3.5% of GDP",
    "summarized_story": "•UBA publishes names, account details of forex defaultersNume Ekeghe and Dike OnwuamaezeAThe Governor of the Central Bank of Nigeria (CBN), Mr. Godwin Emefiele, has disclosed that the apex bank’s interventions to protect the economy from the impacts of COVID-19 represented 3.5 per cent of Nigeria’s Gross Domestic Product (GDP).\nNigeria’s GDP was estimated at $432.29 billion by the National Bureau of Statistics (NBS) in the second quarter of 2021.\nThe design of the interventions, according to him, was hinged on the need to develop enabling infrastructure in critical sectors to drive economic growth and development.\nEmefiele said access to finance remained one of the biggest threats to MSME development with serious implications for productivity, economic development, and job creation.\nThe account numbers and Bank Verification Numbers (BVN) of the defaulters were included in the publication on the bank’s website."
  },
  {
    "headline": "UK Approves COVID-19 Vaccines Administered in Nigeria",
    "summarized_story": "Chinedu Eze in Lagos and Olawale Ajimotokan in AbujaThe British High Commissioner to Nigeria, Catriona Laing, yesterday debunked statements suggesting that the COVID-19 vaccines administered in Nigeria were not approved by the UK.\nThe UK has also moved Nigeria to the “rest of the world” travel list about the travel rule billed to take effect from October 4, 2021.\nIn a statement yesterday, Laing said the UK approves of vaccines currently in use in Nigeria irrespective of the manufacturer.\nShe said the UK has so far donated 1.2 million vaccines to Nigeria through COVAX and will continue to support the country in accessing COVID-19 vaccines.\n“I would like to emphasise that any statements that COVID-19 vaccines administered in Nigeria are not approved by the UK are completely untrue."
  },
  {
    "headline": "BREAKING: Residents Flee As Boko Haram Insurgents Attack Yobe Town",
    "summarized_story": "Boko Haram terrorists have launched an attack on residents of Babbangida, the headquarters of Tarmuwa local government area of Yobe state, Northeastern Nigeria.\n\"Boko Haram terrorists are currently attacking Yobe town.\nThey are currently attacking Babbangida, headquarters of Tarmuwa local government area in Yobe State.\nGen. Onyeama Nwachukwu, revealed that ISWAP terrorist group has commenced a massive recruitment drive after thousands of Boko Haram insurgents 'repented' and surrendered to the military.\nIt noted that leaders and foot soldiers of the Boko Haram terrorist sect have relocated to a forest in Southern Kaduna from Sambisa Forest."
  },
  {
    "headline": "BREAKING: Residents Flee As Boko Haram Insurgents Attack Yobe Town",
    "summarized_story": "Boko Haram terrorists have launched an attack on residents of Babbangida, the headquarters of Tarmuwa local government area of Yobe state, Northeastern Nigeria.\n\"Boko Haram terrorists are currently attacking Yobe town.\nThey are currently attacking Babbangida, headquarters of Tarmuwa local government area in Yobe State.\nGen. Onyeama Nwachukwu, revealed that ISWAP terrorist group has commenced a massive recruitment drive after thousands of Boko Haram insurgents 'repented' and surrendered to the military.\nIt noted that leaders and foot soldiers of the Boko Haram terrorist sect have relocated to a forest in Southern Kaduna from Sambisa Forest."
  },
  {
    "headline": "How Infamous Ex-Minister Fani-Kayode Once Beat Up His Mother-in-Law— Former Nanny",
    "summarized_story": "Anthonia Uchenna, a former domestic worker at the house of former Minister of Aviation, Femi Fani-Kayode, has said the latter once beat up his mother-in-law.\nUchenna, who was a nanny at the former minister's house said he beat up his in-law after she queried him for beating and stripping his wife naked.\nShe said, “My name is Anthonia Uchenna, a former nanny at Femi Fani-Kayode's house.\nI experienced many things at FFK's house, the way he handles his staff.\nHe beat the woman too.”Several allegations including sexual harassment and assault have been levelled against Fani-Kayode over time by some of his former domestic workers."
  },
  {
    "headline": "How Infamous Ex-Minister Fani-Kayode Once Beat Up His Mother-in-Law— Former Nanny",
    "summarized_story": "Anthonia Uchenna, a former domestic worker at the house of former Minister of Aviation, Femi Fani-Kayode, has said the latter once beat up his mother-in-law.\nUchenna, who was a nanny at the former minister's house said he beat up his in-law after she queried him for beating and stripping his wife naked.\nShe said, “My name is Anthonia Uchenna, a former nanny at Femi Fani-Kayode's house.\nI experienced many things at FFK's house, the way he handles his staff.\nHe beat the woman too.”Several allegations including sexual harassment and assault have been levelled against Fani-Kayode over time by some of his former domestic workers."
  },
  {
    "headline": "How Infamous Ex-Minister Fani-Kayode Once Beat Up His Mother-in-Law— Former Nanny",
    "summarized_story": "Anthonia Uchenna, a former domestic worker at the house of former Minister of Aviation, Femi Fani-Kayode, has said the latter once beat up his mother-in-law.\nUchenna, who was a nanny at the former minister's house said he beat up his in-law after she queried him for beating and stripping his wife naked.\nShe said, “My name is Anthonia Uchenna, a former nanny at Femi Fani-Kayode's house.\nI experienced many things at FFK's house, the way he handles his staff.\nHe beat the woman too.”Several allegations including sexual harassment and assault have been levelled against Fani-Kayode over time by some of his former domestic workers."
  },
  {
    "headline": "Lalong to Nigerians: Shun ethnic divisions -- great nations embrace diversity",
    "summarized_story": "Simon Lalong, governor of Plateau, has appealed to Nigerians not to allow religious and ethnic divisions threaten the unity of the country.\nAdvertisementIn a statement issued by Makut Macham, spokesperson to the governor, Lalong spoke on Sunday at an inter-denominational service to mark Nigeria’s 61st independence anniversary.\n“Many prophets of doom had prophesied that we shall not live to witness this year and some people representing both internal and external interests have also worked fruitlessly to fulfill this prophesy.”The governor asked Nigerians not to be “blinded” by ethnic considerations, and urged citizens to embrace diversity.\nAdvertisement“For far too long, we have focused on our differences and weaknesses, and trivialised or even ignored our strengths and prospects,” he said.\n“There is no great nation that has refused to embrace diversity, tolerance, excellence, good work ethics, and a national philosophy that is based on honesty, reward for hardwork and punishment for deviance.”"
  },
  {
    "headline": "Lalong to Nigerians: Shun ethnic divisions -- great nations embrace diversity",
    "summarized_story": "Simon Lalong, governor of Plateau, has appealed to Nigerians not to allow religious and ethnic divisions threaten the unity of the country.\nAdvertisementIn a statement issued by Makut Macham, spokesperson to the governor, Lalong spoke on Sunday at an inter-denominational service to mark Nigeria’s 61st independence anniversary.\n“Many prophets of doom had prophesied that we shall not live to witness this year and some people representing both internal and external interests have also worked fruitlessly to fulfill this prophesy.”The governor asked Nigerians not to be “blinded” by ethnic considerations, and urged citizens to embrace diversity.\nAdvertisement“For far too long, we have focused on our differences and weaknesses, and trivialised or even ignored our strengths and prospects,” he said.\n“There is no great nation that has refused to embrace diversity, tolerance, excellence, good work ethics, and a national philosophy that is based on honesty, reward for hardwork and punishment for deviance.”"
  },
  {
    "headline": "'Casualty figure unknown' as troops repel attack by insurgents in Yobe",
    "summarized_story": "Troops of the Nigerian Army are currently repelling an attack by “Boko Haram insurgents” in Tarmuwa LGA of Yobe state.\nAdvertisementTheCable understands that the insurgents attacked Babban Gida, headquarters of Tarmuwa LGA, on Sunday.\nAdvertisementThe incident comes weeks after troops repelled a similar attack by insurgents in Babban Gida.\nThe attack also comes hours after President Muhammadu Buhari addressed the United Nations general assembly (UNGA) on Nigeria’s efforts to end insurgency.\nIn Nigeria, Boko Haram terrorist group, though fragmented by internal strife and weakened by our defence forces, is still active and preying on soft targets,” he had said."
  },
  {
    "headline": "'Casualty figure unknown' as troops repel attack by insurgents in Yobe",
    "summarized_story": "Troops of the Nigerian Army are currently repelling an attack by “Boko Haram insurgents” in Tarmuwa LGA of Yobe state.\nAdvertisementTheCable understands that the insurgents attacked Babban Gida, headquarters of Tarmuwa LGA, on Sunday.\nAdvertisementThe incident comes weeks after troops repelled a similar attack by insurgents in Babban Gida.\nThe attack also comes hours after President Muhammadu Buhari addressed the United Nations general assembly (UNGA) on Nigeria’s efforts to end insurgency.\nIn Nigeria, Boko Haram terrorist group, though fragmented by internal strife and weakened by our defence forces, is still active and preying on soft targets,” he had said."
  },
  {
    "headline": "UK: We're working to recognise Nigeria's COVID vaccine certificates",
    "summarized_story": "The United Kingdom says it is working with the National Primary Health Care Development Agency (NPHCDA) to ensure that Nigeria’s COVID-19 vaccine certificate is acceptable for travel to the UK.\nIn the UK’s updated travel advisory, Nigeria is on the ‘amber’ list, which has restrictions for travellers to the UK, irrespective of whether they have been vaccinated against COVID.\nAdvertisement“We understand that there has been some frustration that the new UK travel rules will continue to require people travelling to the UK from Nigeria to quarantine, despite having received two doses of recognised COVID-19 vaccines in Nigeria,” the statement reads.\n“Following a pilot with the United States of America and the European Union, the UK is working to recognise vaccine certificates from other countries as part of a phased review of the many COVID-19 vaccine certificates issued across the world.\nTravellers from Nigeria must also book and pay for day two and day eight COVID-19 tests – to be taken after arrival — and also complete a passenger locator form."
  },
  {
    "headline": "ChatBots Africa, Fashtracker win pitch sessions at TechCabal’s ‘Future of Commerce’",
    "summarized_story": "ChatBots Africa and Fashtracker have been announced as winners of the partnership and investment pitch sessions, respectively, organised by TechCabal as part of the ‘Future of Commerce’ conference.\nHeld on Friday, 24th of September, the partnership pitch session saw a total of three growth-stage startups pitch to corporate organizations for potential partnerships while the investment version involved four early-stage startups pitching to potential investors.\n“For my team and I, winning at the pitching session validates our vision for the future of e-commerce in Africa, that is, conversational and social commerce,” Ronald Tagoe, Founder of ChatBots Africa, told TechCabal.\nNigeria-based Fashtracker connects trusted and sustainable African fashion brands to people within and outside the continent through its online platform.\n“Especially during such tough times in Nigeria – economic prosperity is key.”A screenshot of ChatBots Africa website."
  },
  {
    "headline": "What will commerce look like in Africa over the next decade?",
    "summarized_story": "With Covid-19 restrictions forcing more people to shop online, e-commerce companies and platforms on the continent have enjoyed a surge in activity.\nThis is provided e-commerce platforms continue to solve problems consumers face and offer more suites of offerings.\nAccording to Nkebet Mesele, Senior Director for Solutions Management in sub-Saharan Africa at Visa, that entails making commerce in Africa “mobile-led”.\n“For commerce to grow across Africa, the building blocks that have to be in place are first, it has to be mobile-led.\n“But it starts with building solutions for people on the ground.”If you enjoyed reading this article, please share it in your WhatsApp groups and Telegram channels."
  },
  {
    "headline": "Phishing scams are becoming more prevalent in African countries",
    "summarized_story": "Phishing is one of the oldest internet scams, dating back to the ‘90s, and perhaps remains one of the most prevalent cybercrimes.\nBut one thing phishing emails have in common with other forms of cyberattack is that every phishing email comes with a call to action that prompts recipients to download a link or file.\nPhishing attacks are prevalent in the continents and individuals and businesses across Africa have fallen victims to phishing scams.\nOver a million phishing attacks were recorded in South Africa in the first half of 2021.\nThat’s a combination of over two million attacks in the first half of the year from the three biggest African markets."
  },
  {
    "headline": "ARM collaborates with TechCabal on the Future of Commerce partnership pitch session",
    "summarized_story": "As part of the sessions, TechCabal will organize two strategic workshops – a partnership pitch session where growth-stage startups can pitch to corporate organizations for potential partnerships, and an investment pitch session where early-stage startups can pitch to potential investors.\nAsset & Resource Management Holding Company Limited (ARM), a provider of global asset management services across a wide range of traditional and alternative investment options, has partnered with TechCabal on the partnership pitch session.\nIna Alogwu, Group Director of Digital Transformation at ARM Group will be speaking at the session.\nAt ARM, he oversees the execution of the Group’s digital transformation strategy, helping the seven subsidiary companies in the Group drive their digital initiatives.\nSpeaking about the event, Olanrewaju Odunowo, Head of TechCabal Insights said, “The COVID-19 pandemic has changed the face of commerce."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "How edtech startup, Stranerd is connecting Nigerian students to tutors",
    "summarized_story": "On the supply side, there are more students or prospective students than there are schools.\nSource: SuppliedOn the website, which currently serves mainly Nigerian students, the startup employs a coin system to charge students.\nThe goal, Godwin says, is to become a one-stop-shop for the Nigerian student’s educational needs and possibly African students also.\nThey also want to include connecting students to internships as well as providing study-abroad services to students.\nBut first, the startup plans to build trust among the students before leveraging it to add more services."
  },
  {
    "headline": "Hearing impairments and technology, ReelFruit’s $3m raise, Apple Pay on Paystack",
    "summarized_story": "Today I’m discussing:Living with hearing impairments in a tech-enabled worldRealFruit’s $3 million Series APaystack launching Apple Pay to help Nigerian businessesLiving with hearing impairments in a tech-enabled worldWeYesterday, Thursday, September 23, 2021, was the International Day of Sign Languages.\nPaystack launches Apple Pay to help Nigerian businessesPaystack, an African fintech company that powers and processes payments for businesses, announced yesterday that Pay with Apple Pay is now available on its platform.\nNigerian businesses will have access to millions of Apple Pay users across more than 60 countries where the payments service is available.\nWhen a customer with Apple Pay buys from a Paystack merchant, they will see the option to checkout using Pay with Apple Pay.\nFlutterwave, an African payments company, integrated PayPal into its platform in March 2021, allowing PayPal customers worldwide to pay African merchants via its “Pay with PayPal” feature."
  },
  {
    "headline": "What does communication in a techy world mean for Nigeria’s deaf people?",
    "summarized_story": "#WeSignForHumanRightsNigeria’s deaf communityWeAccording to Oluwaseun Sosanya, a sign language interpreter, tutor, and deaf advocate, the deaf community “is a collection of people that share the same idea, belief, and culture, and use sign language to communicate.\n“The community includes the two categories of deaf — pre-lingual and post-lingual deaf — parents of the deaf, sign language interpreters, and all users of sign language.\nSignFor the African deaf community, the prevalent sign language is the American Sign Language (ASL) which Andrew Foster — regarded as the Father of Deaf Education in Africa — brought into the continent.\nMobile apps that provide sign language tutoring for beginners, such as the ASL American Sign Language and the Ghanian Sign Language app.\nThe deaf community believed it to be more accommodating of the hearing community without regard to the deaf people — who it was purporting to help."
  },
  {
    "headline": "Projects worth N12trn abandoned across Nigeria",
    "summarized_story": "Rising security challenges in Nigeria, which have impacted all businesses, are taking a deadlier toll on the hospitality sector, especially in the northern part the country, with dwindling investment in the sector due to perceived unsafe business environment.\nBesides security concerns, most of the projects, according to Abba Tor, president, Nigerian Institute of Quantity Surveyors (NIQS), were abandoned due to poor research on the monetary estimates required for them.\nHospitality sector, as a segment of the real estate market, is a major victim.\nDespite the boom in the hospitality sector, in the last two decades, no foreign branded hotel is located in Northern Nigeria except Abuja, which investors, who shun the other states in the region, perceive to be safe.\nThe region has seen significant destruction of homes by insurgents, more so in the crisis-ridden states like Borno and Kaduna."
  },
  {
    "headline": "The Week Ahead",
    "summarized_story": "In the coming week, oil prices are expected to grow steadily supported by global output disruptions and inventory draws.\nMoney marketDespite the liquidity inflow during the week, money market rates remained elevated supported by the primary market auction by DMO at the middle of the week.\nTreasury bills marketThe Nigerian Treasury Bills market was mostly tepid last week as attention was focused on the Eurobond and bond issued during the week.\nSectoral performance across sectors tracked was mixed last week as the NGX Insurance was the highest gainer for the week with +1.75%.\nMarket breadth for the week closed positive with 28 gainers led by PHARMDEKO and NAHCO as against 23 losers led by SCOA and PRESCO"
  },
  {
    "headline": "Anambra guber: The battle of moneybags and intellectuals",
    "summarized_story": "In 1999, Chinwoke Mbadinuju, a legal practitioner, became the governor of Anambra State at the behest of Emeka Offor, an oil mogul.\nHe later joined the All Progressives Grand Alliance in preparation for the November 2013 governorship race in Anambra State.\nHe also worked in the banking sector, gaining over 17 years of experience with NAL Merchant Bank, Diamond Bank, Continental Trust Bank, FSB International Bank, Standard Trust Bank, United Bank for Africa and Bank PHB.\nPreviously, Ozigbo worked in the banking sector, racking up over 17 years in experience with NAL Merchant Bank, Diamond Bank, Continental Trust Bank, FSB International Bank, Standard Trust Bank, United Bank for Africa and Bank PHB.\nHe had his early education in Onitsha, Anambra State, where he combined trading at the Main Market and managing a horde of apprentices, with schooling."
  },
  {
    "headline": "Group Trains Media Practitioners, CSO,s On Human Trafficking, Forced Migration – Nigerian Observer",
    "summarized_story": "While maintaining that the triggers of human trafficking are largely economic-related and poor livelihoods, the Ag.\nExecutive Director said that human trafficking and forced migration are further sustained by cultural orientation, poor government policies which according to her do not address the socio-economic conditions of the youths.\nOlofin, however, thanked the United Nations Women for supporting the implementation of the project, just as she also appreciated partners of the foundation for their unflinching commitment thus far in the intervention of human trafficking and forced migration.\nIn their separate goodwill messages, representatives of UN Women, NAPTIP, NOA, NUJ Chairman, and CSOs, described the event as apt, adding that the place of the media and CSOs in the fight against human trafficking and forced migration could not be emphasised.\nHigh point of the event was the presentation of lectures entitled “Building Effective Communication Strategies and Investigative Skills in curbing Human Trafficking and Forced Migration”, “Enhancing the capacity of the media to advocate against forced migration and trafficking” and presentation of Draft Road Map/Action Plan by Mrs. Joy Olabisi Akpaida, Dr. Nosa Aladeselu and Fikih Obaro."
  },
  {
    "headline": "FC Robo first team to arrive for Betsy Obaseki Tournament – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestNigeria Women Football League Premiership club, FC Robo Football Club of Lagos were the first to arrive the Samuel Ogbemudia Stadium, Benin City in readiness for the Betsy Obaseki Women Football Tournament, which kicks off tomorrow in three venues across the city.\nFC Robo players were bubbling with life ready for the challenges ahead as they moved around the stadium with so much zest, obviously set for the battle against seven other NWFL Premiership clubs and four NWFL Championship clubs.\nWe know there are very strong Premiership clubs in this competition, we are on ground for the challenge.\nI also want to commend the organising committee of the Betsy Obaseki Women Football Tournament for the great works seen on ground at the Samuel Ogbemudia Stadium, Benin City.\nThe opening ceremony has also been scheduled for the Samuel Ogbemudia Stadium."
  },
  {
    "headline": "Edo, partners brainstorm on bridging digital divide among MSMEs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – To provide a viable ecosystem to get more Micro, Small and Medium Enterprises (MSMEs) to the digital space, the Edo State Government and private partners have agreed to deploy tested platforms to encourage small businesses to bring their businesses online.\nThis was agreed during a webinar organized by the Edo State Investment Promotion Office (ESIPO), which was supported by OZE, an international digital business outfit.\nThe programme featured eleven experts in digital economy, drawn from around the world including the United Kingdom, the United States of America and Ghana.\nAccording to him: “This meeting is to see how we can further leverage on these opportunities using technology to drive our businesses.\nWe have the required digital infrastructure in place to drive growth."
  },
  {
    "headline": "COVID-19: Obaseki, Ehanire, WHO advocate vaccination amid rising deaths of unvaccinated persons – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki and the Minister of Health, Dr. Osagie Ehanire, have reiterated the need for more persons to get vaccinated against the deadly COVID-19 virus.\nThey spoke during the Presidential Steering Committee on COVID-19 Vaccination, South-South Zone Townhall Meeting, at the Government House, in Benin City.\nThe Minister of Health said over 90 percent of deaths recorded from COVID-19 are of unvaccinated persons, noting that the deaths occurred because those affected had no protection against the deadly virus.\nOsaigbovo Iyoha, said, “The main objective of the COVID-19 vaccination exercise is to accelerate the spread of herd immunity, which will ultimately slow down and interrupt transmission of COVID-19 in the state and the entire country.\nWe want to appreciate everyone in the state who has taken the COVID-19 vaccine; the numbers are quite encouraging."
  },
  {
    "headline": "Bandits killed 17 security agents in Sokoto attack – Lawmaker",
    "summarized_story": "ADVERTISEMENTA member of the Sokoto State House of Assembly representing Sabon Birni north, Aminu Gobir, says 17 security agents were killed in Friday evening attack in Dama village in the state.\nPREMIUM TIMES broke the news that many soldiers were killed while others fled following the attack on their camp in a school in the village.\nMr Gobir said the security agents killed include nine soldiers, five mobile police officers and three officers of the Nigerian Security and Civil Defence Corp.READ ALSO:The lawmaker added that several security agents were yet to be accounted for since Friday after the attack.\nA childhood friend to one of the civil defence officers killed during the attack, Rilwanu Nagwaria, said the slain officer he identified simply as Sulaiman died a hero.\nA security source at the Sokoto Police Command said the corpses had been deposited at the Specialist Hospital in Sokoto."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Fairness, equity fundamental to peace, security – Osinbajo",
    "summarized_story": "Also, in his remarks after receiving the award, alongside other honourees, the VP noted that “fairness, equity and respect for the rights of others are fundamental to peace and security,” hence Christian leaders at all levels must strive to promote those virtues despite the challenges.\n“An almost intemperate, vehement and often violent dismissal of the views of people of other persuasions without adequate consideration.\nResponding personally and also on behalf of other award recipients, Prof. Osinbajo said “I accept the award with great humility, being mindful that we are not necessarily the most deserving of Christians to be given any recognition.\nSupo Ayokunle, said the honour was in recognition of Prof. Osinbajo’s outstanding performance in public service over the past years, both at state and national levels.\nThe Imam that saved the lives of over 200 Christians in Barkin Ladi, Plateau State, Abdullahi Abubakar, also received a special CAN recognition."
  },
  {
    "headline": "Emefiele, others seek improved infrastructure for national development at FICAN conference",
    "summarized_story": "“The government can only provide enabling policies that will support private sector interventions.\nWe need the global private sector intervention to help us achieve a vision of infrastructural development,” he noted.\nMr Bola Koko, Managing Director of FMDQ Group, represented by Yomi Osinubi, Head Private Market, urged Nigeria to conceive a way its domestic capital market could fund the international capital market.\n“If we want to pluck our infrastructure rewards, first of all we have to conceive of a way our domestic capital market can actually fund capital market.\n“If you want SMEs to get the best benefits of infrastructure development in the country, the CBN Governor mentioned the largest areas of course for SMEs which is energy."
  },
  {
    "headline": "7,000 Youth Benefit From CBN’ Anchor Borrowers Programme In Ogun",
    "summarized_story": "dowu Olakunle, AbeokutaNo fewer than seven thousand youths drawn from various parts of Ogun State have benefitted from the state government’s Cassava Intervention Project.\nThe project is financed under the Central Bank’s Anchor Borrowers’ Agricultural Programme .\nThe Chief Press Secretary to Governor Dapo Abiodun, Kunle Somorin, made the disclosure at the weekend.\nIt would be recalled that the agricultural project, tagged ‘Mega Ogun State Cassava Intervention Project’ was, flagged off in May 2020, by the state governor, Prince Dapo Abiodun, was commenced with about 3,500 candidates presented to the CBN by the state government.\n“The linkage programme is continuous as there are otbher six sites to follow which include, Pagbonrinoba (Ipokia LGA) Afon Estate (Imeko LGA) Mapoly (Obafemi Owode LGA), Obafe Town (Obafemi Owode LGA), Apojola(Odeda LGA) and Omugbawojo(Ijebu North East LGA)”."
  },
  {
    "headline": "Anthony Joshua beaten by Ukrainian Oleksandr Usyk in London",
    "summarized_story": "“The fight went exactly the way I expected it to go.\n“I have been working so hard since January in preparation for this fight,” Usyk said.\nJoshua looked tired as the fight went on and he looked tired a little bit.\nI thought he had the perfect game plan and tonight he makes history as the unified heavyweight world champion.\nAnthony Joshua (c) (117-112, 116-112, 115-113)CBS"
  },
  {
    "headline": "Trespass: Community Demands N117bn Compensation From Oil Company In A/Ibom",
    "summarized_story": "Ukpana community in Onna local government area of Akwa Ibom State has demanded the sum of N117bn as compensation from the Sterling Oil Production and Exploration Company over alleged trespass on their land without consent.\nAccording to him the destruction of ancestral homes has provoked the anger of their gods, who have continued to visit them with “unwarranted deaths” in the community.\nHe said “The village has suffered an unwarranted trespass and destruction of their property perpetuated by the Sterling Oil Exploration and Production Company through oil exploratory activities.\n“The said destruction affected both economic crops and trees, streams, namely: Idim Mkpighe,Idim Uto,Etuk Enyeng, Adaha Ukim,Idim Akpan Akwa,Idim Judah etc.\nReacting to the allegations, the consultant to the company, Fabian Ebri, said the project is a federal government project owned by the Nigeria Petroleum Development company and the company is just a technical partner."
  },
  {
    "headline": "Trespass: Community Demands N117bn Compensation From Oil Company In A/Ibom",
    "summarized_story": "Ukpana community in Onna local government area of Akwa Ibom State has demanded the sum of N117bn as compensation from the Sterling Oil Production and Exploration Company over alleged trespass on their land without consent.\nAccording to him the destruction of ancestral homes has provoked the anger of their gods, who have continued to visit them with “unwarranted deaths” in the community.\nHe said “The village has suffered an unwarranted trespass and destruction of their property perpetuated by the Sterling Oil Exploration and Production Company through oil exploratory activities.\n“The said destruction affected both economic crops and trees, streams, namely: Idim Mkpighe,Idim Uto,Etuk Enyeng, Adaha Ukim,Idim Akpan Akwa,Idim Judah etc.\nReacting to the allegations, the consultant to the company, Fabian Ebri, said the project is a federal government project owned by the Nigeria Petroleum Development company and the company is just a technical partner."
  },
  {
    "headline": "10 More Abducted Bethel Baptist Students Regain Freedom",
    "summarized_story": "The Christian Association of Nigeria yesterday said 10 more students of Bethel Baptist School in Kaduna State had been released.\nIt was gathered that 11 of the students were still being held by the bandits despite the payment of ransom.\nThe Vice President of CAN (19 Northern States and Abuja) and its chairman in Kaduna State, Rev.\nHe said, “10 more students of Baptist High School were released this afternoon.\nAll have been reunited with their parents.”Ten of the students were released on Saturday, September 18 after spending 74 days captivity of terrorists, with 22 others still being held."
  },
  {
    "headline": "10 More Abducted Bethel Baptist Students Regain Freedom",
    "summarized_story": "The Christian Association of Nigeria yesterday said 10 more students of Bethel Baptist School in Kaduna State had been released.\nIt was gathered that 11 of the students were still being held by the bandits despite the payment of ransom.\nThe Vice President of CAN (19 Northern States and Abuja) and its chairman in Kaduna State, Rev.\nHe said, “10 more students of Baptist High School were released this afternoon.\nAll have been reunited with their parents.”Ten of the students were released on Saturday, September 18 after spending 74 days captivity of terrorists, with 22 others still being held."
  },
  {
    "headline": "‘Nigerians Must Take Pre-departure Test Before Entering UK’",
    "summarized_story": "The British High Commission in Nigeria has said that the new rules for international travel into the United Kingdom announced on Saturday by the High Commissioner, Catriona Laing, will subject Nigerians and national of others countries to pre-departure COVID-19 test.\nIt however, noted that it is working with the United States and the European Union to recognise Nigeria’s vaccine certificate.\nFurther details are available on the gov.uk website.”The statement noted that travellers may be able to end quarantine/self-isolation early if they pay for a private COVID-19 test through the Test to Release scheme.\n“This approach will be kept under regular review and further changes are likely as part of a phased opening up of international travel for vaccinated travellers.\nThe UK is committed to opening up international travel and we are using our COVID-19 vaccine certification process to enable all those wishing to enter the UK to do so safely,” it said."
  },
  {
    "headline": "Minister Vows To Seek UNESCO Recognition For More Nigerian Festivals",
    "summarized_story": "By GBENGA ADEOLAThe Minister of Information and Culture, Alhaji Lai Mohammed, haspromised to push for recognition for more cultural festivals in Kebbiand other states to complement the inscription of Argungu festival asan intangible cultural heritage by UNESCO.\nThe Minister made the promise in Kebbi on Sunday, after he wasturbaned as the ‘Kakakin Kabi’ (Cultural Ambassador and EmirateSpokesman) by the Argungu Emirate Council in Kebbi State.\nHe described Kebbi State as a frontline cultural and tourism state inthe country, thanks to its many unique cultural festivals which, hesaid, are also veritable tourism products.\n“Kebbi State today is one of the frontline cultural and tourism statesin the whole country.\n“As the Cultural Ambassador of Kebbi, I would endeavour to ensure thatwe develop all these festivals in a manner that many more will belisted on the UNESCO list of intangible heritage."
  },
  {
    "headline": "Minister Vows To Seek UNESCO Recognition For More Nigerian Festivals",
    "summarized_story": "By GBENGA ADEOLAThe Minister of Information and Culture, Alhaji Lai Mohammed, haspromised to push for recognition for more cultural festivals in Kebbiand other states to complement the inscription of Argungu festival asan intangible cultural heritage by UNESCO.\nThe Minister made the promise in Kebbi on Sunday, after he wasturbaned as the ‘Kakakin Kabi’ (Cultural Ambassador and EmirateSpokesman) by the Argungu Emirate Council in Kebbi State.\nHe described Kebbi State as a frontline cultural and tourism state inthe country, thanks to its many unique cultural festivals which, hesaid, are also veritable tourism products.\n“Kebbi State today is one of the frontline cultural and tourism statesin the whole country.\n“As the Cultural Ambassador of Kebbi, I would endeavour to ensure thatwe develop all these festivals in a manner that many more will belisted on the UNESCO list of intangible heritage."
  },
  {
    "headline": "Panic as Boko Haram/ISWAP invades community in Yobe",
    "summarized_story": "A huge number of armed Boko Haram, suspected to be ISWAP group on Sunday evening invaded Tarmuwa, the Headquarters of Babangida Local Government Area of Yobe state.\nSources said the insurgents armed with Anti-aircraft trucks and grenades fired sporadically at security formations and communities, leading to pandemonium as residents scamper for safety.\nTarmuwa is a local government area in Yobe state, Its headquarters are in the town of Babangida at 12°06`27N”N11°45’14” E.The town has witnessed series of deadly Boko haram attacks in the past.\nThe Executive Secretary of the Yobe State Emergency Management Agency, Dr Mohammed Goje in a telephone call with Vanguard confirmed the latest attack on Tarmuwa by suspected terrorists this evening, but couldn’t share details on the number of casualties as of press time.\nHis words: ” Yes I received a distress call from one of my staff this evening that some armed members of terrorists invaded Tarmuwa town, please give me time to get details, so I can furnish you”."
  },
  {
    "headline": "Panic as Boko Haram/ISWAP invades community in Yobe",
    "summarized_story": "A huge number of armed Boko Haram, suspected to be ISWAP group on Sunday evening invaded Tarmuwa, the Headquarters of Babangida Local Government Area of Yobe state.\nSources said the insurgents armed with Anti-aircraft trucks and grenades fired sporadically at security formations and communities, leading to pandemonium as residents scamper for safety.\nTarmuwa is a local government area in Yobe state, Its headquarters are in the town of Babangida at 12°06`27N”N11°45’14” E.The town has witnessed series of deadly Boko haram attacks in the past.\nThe Executive Secretary of the Yobe State Emergency Management Agency, Dr Mohammed Goje in a telephone call with Vanguard confirmed the latest attack on Tarmuwa by suspected terrorists this evening, but couldn’t share details on the number of casualties as of press time.\nHis words: ” Yes I received a distress call from one of my staff this evening that some armed members of terrorists invaded Tarmuwa town, please give me time to get details, so I can furnish you”."
  },
  {
    "headline": "Sanwo-Olu: Why Lagos must be allowed to collect VAT",
    "summarized_story": "Lagos State Governor, Babajide Sanwo-Olu on Sunday said Lagos will do more for the people if allowed to collect Value Added Tax (VAT).\nThe governor spoke at the 61st national Independence Day Celebration service held at the Chapel of Christ The Light, Alausa, Ikeja.\nSanwo-Olu, while stressing his administration’s commitment toward delivering on his campaign promises, said Lagos would do more if the State is allowed to collect the Value Added Tax.\n“We should ensure there is equity and fairness and that is why we talk about issues around VAT.\nI will ensure that we create a Lagos that will work for the people of the State so that our tomorrow can be better than today.”"
  },
  {
    "headline": "Merkel's party beaten by Social Democrats in Germany's election",
    "summarized_story": "Germany’s Social Democrats narrowly won Sunday’s national election, projected results showed, ending 16 years of conservative-led rule under Angela Merkel.\nThe centre-left Social Democrats (SPD) were on track for 26.0% of the vote, ahead of 24.5% for Merkel’s CDU/CSU conservative bloc, projections for broadcaster ZDF showed, but both groups believed they could lead the next government.\n“We are ahead in all the surveys now,” the Social Democrats’ chancellor candidate, Olaf Scholz, said in a round table discussion with other candidates after the vote.\nScholz, 63, would become the fourth post-war SPD chancellor after Willy Brandt, Helmut Schmidt and Gerhard Schroeder.\n“It hasn’t always been the first-placed party that provided the chancellor,” Laschet, 60, told the round table."
  },
  {
    "headline": "BREAKING: Bandits Attack Joint Military Base, Kill 15 In Sokoto",
    "summarized_story": "Bandits allegedly stormed a joint military base known as “Burkusuma camp” in Sokoto state’s Sabon Birni local government region, killing 15 people.\nOur reporter learned that the base was in the Sabon Birni local government’s Dama village.\nDanchadi said that, they received a report about the attack from a resident of the area who was using Nigerien network.\nSimilarly, the Police Public Relation Officer, ASP Sanusi Abubakar said he was not aware of the attack.\nHowever, the Commissioner for Carriers and Security Matters, Colonel Garba Moyi (rtd) has confirmed the attack on the military base but that he was not sure of the number of death."
  },
  {
    "headline": "BREAKING: Boko Haram/ISWAP Invades Community In Yobe",
    "summarized_story": "On Sunday evening, a large number of armed Boko Haram members, alleged to be members of the ISWAP faction, assaulted Tarmuwa, the headquarters of the Babangida Local Government Area in Yobe state.\nAccording to sources, rebels armed with anti-aircraft trucks and grenades shot sporadically at security formations and neighborhoods, causing chaos as civilians flee for their lives.\nTarmuwa is a Yobe state local government district with its headquarters in Babangida at 12°0627N”N11°45’14” E.In the past, the town has been the target of a series of fatal Boko haram attacks.\nDr Mohammed Goje, the Executive Secretary of the Yobe State Emergency Management Agency, confirmed the new attack on Tarmuwa by suspected terrorists this evening in a phone contact with Vanguard, but couldn’t give details on the number of casualties as of press time.\nHis words: ” Yes I received a distress call from one of my staff this evening that some armed members of terrorists invaded Tarmuwa town, please give me time to get details, so I can furnish you”."
  },
  {
    "headline": "Nigeria Will Remain One Nation — Osinbajo",
    "summarized_story": "Despite its issues, Vice President Yemi Osinbajo says Nigeria would remain one indivisible nation.\nDespite the security, economic, religious, and ethnic obstacles, the VP stated that the collective objective of a united, peaceful, and successful Nigeria remains unchanged.\nPastor Enoch Adeboye, General Overseer of the Redeemed Christian Church of God (RCCG), was present, as was CAN President Rev.\nNigeria, according to Osinbajo, is currently Africa’s most educated and entrepreneurial nation.\nThe Vice President pointed out that ten of the 36 states had economies larger than at least 15 African countries."
  },
  {
    "headline": "BREAKING: Pere, Queen, Nini, Saga, Angel Evicted From BBNaija Reality Show",
    "summarized_story": "Big Brother Naija housemates, Pere, Queen, Nini, Saga and Angel have been evicted from the ‘Shine Ya Eye’ reality show on Sunday night.\nAngel, Pere, Whitemoney, Saga, and Nini were nominated for eviction this week, as you may recall.\nPere and Angel’s eviction, however, is a twist in the game, as Ebuka Obi-Uchendu, the official presenter of BBNaija, said that they only left the house and not the show.\nThe housemates that are saved tonight will be guaranteed a position in the finale.\nTonight’s eviction is the final one before the final day, when the Shine Ya Eye season champion will be revealed."
  },
  {
    "headline": "Breaking: Nigeria’s D’Tigress beat Mali, retain Afrobasket title",
    "summarized_story": "Nigeria’s D’Tigress a while ago on Sunday defeated Mali in the final of 2021 women Afrobasket and retained the title for the third consecutive time.\nDetails loading…"
  },
  {
    "headline": "Breaking: Queen, Nini evicted from BBNaija season 6 show, Pere, Saga out with a twist",
    "summarized_story": "Housemates, Nini and Queen, have just been evicted from the big brother six Shine Ya Eye show.\nHowever, Pere and Angel were removed with a twist.\nThe twist is that they have an opportunity to return back to the BBNaija house if any of them wins a newly introduced game at the white room corner.\nDetails loading…"
  },
  {
    "headline": "Exposed! How ritualist buried 9-year-old girl with N1000 note",
    "summarized_story": "Operatives of the Kwara state police command in Offa local government area have arrested a suspected ritualist Alalade Alaweye who buried his nine-year-old victim with N1000 note.\nThe state Police Public Relations Officer Ajayi Okansami confirmed the killing of the nine-year-old Faith Samuel in offa and subsequent arrest of the culprit.\n“Preliminary investigation revealed that the suspect had killed and was burying the 9-year-old girl by name Faith Samuel of Onireke area Offa.\n“The corpse was recovered with a N1000 note buried with it and deposited at the mortuary after certifying her dead by a doctor, for autopsy.\nAfolabi disclosed that the suspects lured the victim to a farm where he was gruesomely murdered by his own blood brother, lsmail Saliu."
  },
  {
    "headline": "Those managing Buhari’s economic agenda have failed- NESLAI -NigPilot",
    "summarized_story": "The concerned group under the auspices of New Era For Sustainable Leadership and Accountability Initiative, NESLAI, has affirmed that those driving the economic agenda of President Muhammadu Buhari, have failed woefully in their duties, and ensured a “free-fall” of the economy.\nNESLAI made this known in Abuja on Thursday, during a World Press Conference on ‘The State Of Nigeria Economy And The Failure Of Nigerian Economic Team To Correct Key Indicators Of The Economy And The Need For Their Urgent Replacement’.\nExecutive Director of the group, Comrade Edwin Femi, listed some of the promising economic programmes including: “N-Power; Survival Fund to small and medium enterprises; andAnchor Borrowers’ Programme”, which he said were not properly executed.\n“Those saddled with the responsibility of setting our country’s economy on a solid footing to protect the economy from the elements have failed in their responsibility to the people and in justifying President Buhari’s confidence in them.\n“We are extremely concerned that certain components of his administration have failed to match the President’s vision with the required technical competence and sincerity of purpose that the president himself espouses."
  },
  {
    "headline": "Those managing Buhari’s economic agenda have failed- NESLAI -NigPilot",
    "summarized_story": "The concerned group under the auspices of New Era For Sustainable Leadership and Accountability Initiative, NESLAI, has affirmed that those driving the economic agenda of President Muhammadu Buhari, have failed woefully in their duties, and ensured a “free-fall” of the economy.\nNESLAI made this known in Abuja on Thursday, during a World Press Conference on ‘The State Of Nigeria Economy And The Failure Of Nigerian Economic Team To Correct Key Indicators Of The Economy And The Need For Their Urgent Replacement’.\nExecutive Director of the group, Comrade Edwin Femi, listed some of the promising economic programmes including: “N-Power; Survival Fund to small and medium enterprises; andAnchor Borrowers’ Programme”, which he said were not properly executed.\n“Those saddled with the responsibility of setting our country’s economy on a solid footing to protect the economy from the elements have failed in their responsibility to the people and in justifying President Buhari’s confidence in them.\n“We are extremely concerned that certain components of his administration have failed to match the President’s vision with the required technical competence and sincerity of purpose that the president himself espouses."
  },
  {
    "headline": "Diplomacy: Nigerian sign MoU with Tanzania -NigPilot",
    "summarized_story": "Ambassador Dada said the cooperation between the two African countries and their Broadcasting agencies will lead to African telling stories their own ways by themselves.\nHe made the pledge when he received a delegation from the Tanzanian Broadcasting Cooperation led by the Tanzanian High Commissioner to Nigeria, Ambassador Benson Alfred Bana and the Director-General of the Tanzanian Broadcasting Cooperation , Dr. Ayub Rioba Chacha in his office in Abuja.\nThe Minister therefore stressed the need for all African countries to work together to realize the dreams of the continent founding fathers.\nHe described Nigeria not only as giant of Africa but a role model to Tanzania and the rest of Africa.\nHe cited the establishment of the Dangote Cement company and other Nigerian investments such as UBA and GTbank in Tanzania as a good example of the economic diplomacy."
  },
  {
    "headline": "Diplomacy: Nigerian sign MoU with Tanzania -NigPilot",
    "summarized_story": "Ambassador Dada said the cooperation between the two African countries and their Broadcasting agencies will lead to African telling stories their own ways by themselves.\nHe made the pledge when he received a delegation from the Tanzanian Broadcasting Cooperation led by the Tanzanian High Commissioner to Nigeria, Ambassador Benson Alfred Bana and the Director-General of the Tanzanian Broadcasting Cooperation , Dr. Ayub Rioba Chacha in his office in Abuja.\nThe Minister therefore stressed the need for all African countries to work together to realize the dreams of the continent founding fathers.\nHe described Nigeria not only as giant of Africa but a role model to Tanzania and the rest of Africa.\nHe cited the establishment of the Dangote Cement company and other Nigerian investments such as UBA and GTbank in Tanzania as a good example of the economic diplomacy."
  },
  {
    "headline": "$4bn loan: Buhari looking for money to share, Buba Galadima bombs FG -NigPilot",
    "summarized_story": "Ex-loyalist of President Muhammadu Buhari and a former founding member of All Progressives Congress, APC, Alhaji Buba Galadima, has described the four billion dollars fresh loan request by the president as another avenue to share money with his cronies.\nIn his words, Galadima said, “It’s not a loan request, they are looking for money to share, they have always share the money and they will share this one also because the ones they’ve taken before, can you show me what they’ve done with it in your village?\n” Nigerian doesn’t need to take one kobo loan.\nThe president had last week written to the national assembly for approval to borrow $4 billion and €710 million loans to fund the 2021 budget.\nThe President said the loan request is an addendum to the 2018-2021 Federal Government External Borrowing Rolling Plan."
  },
  {
    "headline": "Ten More Kidnapped Bethel Baptist School Students Regain Freedom",
    "summarized_story": "Ten more abducted students of Bethel Baptist Secondary school in Kaduna State have regained their freedom.\nThis is the fourth batch of the students released so far by their abductors.\nRead Also: Four Arrested As NDLEA Uncovers Abuja Hotel Where Drugs Are SoldHe also expressed optimism that the bandits will release the remaining eleven kidnapped students still in captivity in no distant time.\nA total of 121 students of Bethel Baptist Secondary school in Chikun Local Government Area of the state were abducted by bandits from their hostels on July 5, 2021.\nThe students were later released in batches after their parents reportedly paid ransoms to their abductors."
  },
  {
    "headline": "Reps Minority Faults Buhari’s UNGA Speech, Says Terrorists ‘Emboldened Under His Watch’",
    "summarized_story": "The minority caucus in the House of Representatives has faulted President Muhammadu Buhari’s recent speech at the United Nations General Assembly, claiming Boko Haram terrorists were emboldened under his watch.\nElumelu said the caucus was “alarmed by President Buhari’s report to UNGA that terrorists have been so weakened in Nigeria that they are now preying on soft targets, when in reality, insurgents have become so emboldened under his watch”.\nAs representatives of the people, the Minority caucus expressed regret that President Buhari’s speech did not reflect on the kidnapping and killing of students in Nigeria.\nThe Minority caucus therefore asked President Buhari to always cross check the content given to him by his handlers so as to ensure that his position, especially on the world stage, captures the reality as well as aspiration prevalent in the country.\nThis to them, is because such addresses ought to serve as an unblemished working document for interventions and solutions at various levels of governance."
  },
  {
    "headline": "Wike Raises Alarm Over Alleged Plot To Rig 2023 Elections",
    "summarized_story": "﻿As Nigeria clocks 61 years on Friday, October 1, Governor of Rivers State, Nyesom Wike, has raised an alarm over alleged plans to rig the 2023 general elections.\n“Other countries are talking about how their elections will be transparent, we are talking about how we will plot to rig an election in 2023,” the Governor said.\nHe also raised concerns over why Nigeria is yet to adopt the electronic mode of transmission of election results.\nSpeaking further, he lamented that the legislature is not playing its role of holding the executive to account.\nThe courts have been intimidated; the judges have abandoned their responsibilities out of fear of what will happen,” Wike said."
  },
  {
    "headline": "Usyk Ends Anthony Joshua’s Reign As World Heavyweight Champion",
    "summarized_story": "Oleksandr Usyk ended Anthony Joshua’s reign as world heavyweight champion in front of the Londoner’s home crowd with a stunning unanimous points decision victory on Saturday, scuppering hopes of a ‘Battle of Britain’ unification bout with fellow world title-holder Tyson Fury.\nBut Joshua had to get past Usyk, the 2012 Olympic heavyweight champion at the London Games where Joshua won the super-heavyweight gold medal.\nThere were moments when Anthony pushed me hard but it was nothing special,” said Usyk, who now follows brothers Wladimir and Vitali Klitschko in becoming a Ukrainian world heavyweight champion, via a translator.\nLondon, I love you & thank you each and every time!”And despite defeat, he was backed to bounce back by Lennox Lewis, a former three-time world heavyweight champion.\nUsyk backed Joshua onto the ropes late on and appeared poised for a knockout when the final bell sounded."
  },
  {
    "headline": "One Killed, Others Injured As Gunmen Attack Church In Kaduna Community",
    "summarized_story": "At least one person has been killed and many others have been injured after gunmen attacked the ECWA Church at Gabaciwa village in Kachia Local Government Area of Kaduna State on Sunday morning.\nAccording to a report by security agencies, the gunmen invaded the church during the Sunday morning service, and immediately attacked the worshipers, which led to the death of one person, while some others were seriously injured.\nGovernor Nasir El-Rufai has condemned the attack, described it as an evil act targeting innocent citizens exercising their constitutional and universal rights to religious freedom.\nWhile he condoled with the ECWA Church and the family of the deceased in particular, he prayed for the repose of the soul of the deceased.\nThe governor also directed the Kaduna State Emergency Management Agency to assess the area and provide succor to the victims receiving medical attention."
  },
  {
    "headline": "NDLEA seizes 3,300kgs of drugs during raids, arrests 10 suspects",
    "summarized_story": "The National Drug Law Enforcement Agency, NDLEA, has raided an Abuja hotel where narcotics are peddled and young females congregate for commercial sex.\nA statement issued by the Director, Media and Advocacy, Femi Babafemi on Sunday said Chairman/Chief Executive of NDLEA, Brig.\nA day earlier, Tuesday 21st September, narcotic officers at the airport also arrested one Nwajindo Ndubuisi Emmanuel during inward clearance of Ethiopian Airline passengers at the E-arrival hall.\nEarlier same day, men of the Irrua Area Command of the Agency working on actionable intelligence evacuated 10 bags of cannabis sativa weighing 135kg in Amahor bush in Igueben area.\nShe had earlier been convicted and sentenced to six months imprisonment on 7th July 2020 following her arrest on 3rd March 2020 with 45kg of cannabis sativa."
  },
  {
    "headline": "Nigeria to provide electricity to 5 million households by 2030- Buhari",
    "summarized_story": "President Muhammadu Buhari has revealed Nigeria’s plans to implement an energy plan aimed at decreasing electricity shortages by 2030, including powering five million houses.\nThe president stated this at the High-Level Dialogue on Energy on the fringes of the 76th United Nations General Assembly in New York, in keeping with Nigeria’s role as a Global Theme Champion for the Energy Transition.\nHe said: “Nigeria’s commitment to a just transition is reflected in our ambitious Energy Compact, which includes the Government’s flagship project to electrify Five Million households and Twenty Million people using decentralized solar energy solutions.\nThis is a major first step towards closing our energy access deficit by 2030.\n“Nigeria’s commitment is also reflected in the development of our Energy Transition Plan, which was developed with the support of the UK COP26 Energy Transition Council.”President Buhari appealed to developed countries for assistance in unlocking the funds required to advance a just and equitable energy transition for all."
  },
  {
    "headline": "Immigration CG orders clearance of passport backlogs at Ikoyi office",
    "summarized_story": "The Nigerian Immigration Service acting comptroller-general, Idris Jere, has directed the service’s special taskforce to clear the backlogs of passport applications at the Ikoyi passport office in Lagos.\nThis was made known by the Nigerian Immigration Service spokesman, Amos Okpu on Saturday via a statement.\nMr. Jere asked the taskforce to proceed to Ikoyi and clear all existing backlogs of passport applications within one week.\nHe stated that the taskforce had arrived in Ikoyi and had already begun the clearance process.\nThe acting CG is committed to deepen the passport issue reform efforts upon assumption of office, according to Okpu, in order to ensure smooth passport issuance operations across issuing centers."
  },
  {
    "headline": "7 soldiers, 4 civilian JTF members feared killed in ISWAP ambush",
    "summarized_story": "Terrorists from the Islamic State of West Africa Province (ISWAP) killed seven soldiers and four Civilian JTF in an ambush along the Marte/Dikwa axis in Borno State.\nConfirming the incident on Saturday in Maiduguri, Civilian JTF Sector Leader Modu Ba’ana stated that terrorists detonated improvised Explosive Devices (IEDs) along the Maiduguri/Dikwa road when the military convoy was traveling from Marte to Maiduguri.\nHe said that the convoy was conveying soldiers who had been granted leave pass from Marte to catch a flight to their separate destinations in the country, and that the ISWAP ambush occurred at Ala village, which is located between Dikwa and Marte border towns.\nThe coordinated strikes were claimed to have coincided with the repulse of ISWAP terrorists at military camps in Borno and Yobe states’ Malam Fatori and Babangida towns."
  },
  {
    "headline": "Visiting Asiwaju in London Has Nothing to Do With 2023 Poll- Kayode Fayemi",
    "summarized_story": "Governor of Ekiti State, Dr. Kayode Fayemi speaks to Dr. Reuben Abati about state collection of VAT, Buhari’s debt forgiveness appeal and PIA amendment."
  },
  {
    "headline": "US: At Least Three Dead in Amtrak Train Derailment in Montana",
    "summarized_story": "At least three people were killed Saturday afternoon when an Amtrak train that runs between Seattle and Chicago derailed in north-central Montana, toppling several cars onto their sides, authorities said.\nThe westbound Empire Builder train derailed about 4 p.m. near Joplin, a town of about 200, Amtrak spokesman Jason Abrams said in a statement.\nOther recent Amtrak derailments include:— April 3, 2016: Two maintenance workers were struck and killed by an Amtrak train going more than 100 mph in Chester, Pennsylvania.\nThe lead engine of the train derailed.\n— May 12, 2015: Amtrak Train 188 was traveling at twice the 50 mph speed limit as it entered a sharp curve in Philadelphia and derailed."
  },
  {
    "headline": "Usyk Stuns Joshua By Unanimous Decision to Become Unified Heavyweight Champion",
    "summarized_story": "Oleksandr Usyk is the new unified heavyweight world champion after dethroning Anthony Joshua with an incredible performance in London.\nHaving seen a fight with fellow Briton Tyson Fury collapse last summer, Joshua opted to face his WBO mandatory challenger and former undisputed cruiserweight champion Usyk instead.\nIt would become the pattern of the fight as Usyk made Joshua miss and executed a perfect gameplan of his own.\nA low shot from Joshua brought a complaint from Usyk and Joshua fired off another, perhaps sensing a weakness in his opponent.\nJoshua had a cut and swelling on his eye; Usyk had a gash on his left eye."
  },
  {
    "headline": "Covid Vaccine Boosters Could Mean Billions for Drugmakers",
    "summarized_story": "Boosters will likely be offered even more broadly in the coming weeks or months, including boosters of vaccines made by Moderna and Johnson & Johnson.\nAndersen expects Moderna, which has no other products on the market, to generate a roughly $13 billion profit next year from all COVID-19 vaccine sales if boosters are broadly authorized.\nJ&J and Europe’s AstraZeneca have said they don’t intend to profit from their COVID-19 vaccines during the pandemic.\nDrugmakers are also developing COVID-19 shots that target certain variants of the virus, and say people might need annual shots like the ones they receive for the flu.\nBut the success of the COVID-19 shots could draw more drugmakers and venture capitalists into the field."
  },
  {
    "headline": "Germans Decide Who Will Take Charge after Merkel in Sunday’s Vote",
    "summarized_story": "The fight to succeed popular, long-serving chancellor Angela Merkel could barely be tighter as Germans go to the polls in parliamentary elections.\nAt stake is the leadership of Europe’s most powerful economy, and more than 60 million Germans over 18 are eligible to vote.\nClimate change is currently the biggest issue for German voters and the party has only once polled more than 10% in a federal election.\nThe liberal FDP may disagree with the Greens on plenty, but on climate change they are drawing in young voters too.\nThe victorious party still needs to form a coalition and there seems little chance of a repeat of the two-party grand coalition currently in charge."
  }
]