[
  {
    "headline": "Nigeria, UAE to strengthen bilateral ties —Buhari",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), has expressed his determination to do more to ensure the growth and intensification of the strategic partnership between Nigeria and the United Arab Emirates.\nExpressing his condolences and that of Nigeria on the demise of the late President Sheikh Khalifah, Buhari also congratulated the new President on his election.\nThe statement is titled ‘Nigeria, UAE to further extend bilateral ties,’ and read in part, “President Buhari expressed the hope that under Sheikh Mohamed the two countries will continue to actively champion a vision of sustainable security, strengthen counterterrorism cooperation, facilitate trade and investment, and promote prosperity and development.\n“In the seven years of the Muhammadu Buhari Presidency, the two countries have actively conducted bilateral dialogues leading to several agreements and Memoranda of Understanding that have paved the way for further cooperation, mutual understanding and progress in many aspects of their bilateral relations.”The President is expected back to the country today, Saturday."
  },
  {
    "headline": "Sexual abuse: Elon Musk to establish litigation unit",
    "summarized_story": "Tech Mogul, Elon Musk, has announced that he is setting up a “hardcore litigation department” following claims of sexual harassment levelled against him.\nCalling for applications via his Twitter account on Friday, Musk stated that he was looking for “hardcore street fighters” who would report directly to him.\n“Tesla is building a hardcore litigation department where we directly initiate and execute lawsuits.\nThe team will report directly to me,” he tweeted.\nThe publication read in part, “The attendant worked as a member of the cabin crew on a contract basis for SpaceX’s corporate jet fleet."
  },
  {
    "headline": "Kunle Afolayan’s film school graduates first set of trainees",
    "summarized_story": "By Benjamin NjokuThe newly established Kunle Afolayan Production (KAP) Film and Television Academy is set to graduate its first set of trainees and certified affiliates of the prestigious School of Cinematic Arts (SCA) at the University of Southern California (USC).\nFounded by award-winning filmmaker Kunle Afolayan, the KAP Academy, in partnership with USC and content streaming giant, Netflix, has executed the programme in post-production – the first in a series of training workshops in Africa.\nWith the coming event, KAP is optimistic that the Nigerian film industry is about to witness a turnaround with professionals who will take the film industry to higher grounds.\nThe Academy stated that graduating students are film editors with previous experience who now have a global professional mindset.\nThe course which ran for 10 weeks had world-renowned facilitators like Douglas Blush, Stephen Flick and Richard Burton led by the School of Cinematic Arts at the University of Southern California."
  },
  {
    "headline": "N’Delta stakeholders to Buhari: Abuja cartel still together, runs NDDC despite Akpabio’s exit",
    "summarized_story": "“It is trite to suggest that Akpabio acted on his own in being an obstacle to the NASS cleared NDDC board members.\nAkpabio had no power to stop the swearing in of NDDC board that was duly screened and approved by the Senate.\nThe primary problem is the callous indifference of the Buhari presidency to issues of the Niger Delta region.\nMy opinion is that, it is President Buhari that was not keen on the existence of the board.\nBuhari should also immediately inaugurate the NDDC board if he means well for the development of the Niger Delta region."
  },
  {
    "headline": "Nigerian Idol 7 Finale: Winner to walk away with N100m worth Of prizes on Sunday",
    "summarized_story": "The finale episode of Nigerian Idol Season 7 will air at 7 pm on Sunday, 22 May 2022, live on DStv and GOtv.\nThe show’s host, IK Osakioduwa, will announce a winner who will walk away with N100 million worth of prizes.\nWatch the finale on Africa Magic (DStv channel 151), Africa Magic Urban (DStv channel 153), and Africa Magic Family (DStv channel 154).\nVoting on Nigerian Idol is via the website, mobile site, MyDStv, and MyGOtv apps.\nAfrica magic.tv/Nigerian idol, and the Africa Magic mobile site by selecting your winner, entering the number of votes and clicking VOTE."
  },
  {
    "headline": "Gunmen kill police orderly, abduct LG Chairman in Nasarawa",
    "summarized_story": "Gunmen on Friday night killed police orderly and abducted Muhammad Baba-Shehu, Chairman of Keffi Local Government Area (LGA) of Nasarawa State.\nASP Ramhan Nansel, the Police Public Relations Officer (PPRO) in the state, confirmed this to the News Agency of Nigeria (NAN) on Saturday in Lafia .\nHe said that based on preliminary investigation, the incident happened around 7:30 p.m. on Friday at Gudi area of Akwanga Local Government Area.\nHe added that one person, who was believed to be an aide to the chairman, was also abducted during the attack.\nThe PPRO therefore called on members of the public with useful information to contact any nearby police station."
  },
  {
    "headline": "Rivers: Why we want Obua to succeed Wike — Non-indigenes",
    "summarized_story": "Drum support for Wike’s presidential bidBy Steve OkoThe Coalition of Non-Indigenes, CONI, Rivers State chapter, has given reasons it wants former Chairman of the Peoples Democratic Party, PDP, Felix Obua, to succeed Gov.\nNyesom Wike in 2023, citing “his enterprising track records and verifiable successes in his previous engagements” as their conviction.\nAccording to the coalition, the infrastructural transformation in Rivers State under the watch of Wike despite opposition from the Federal Government is a sure proof that under a strong and courageous character like Wike Nigeria will be fixed.\n“Wike has raised the standard of living of Rivers people and residents in Rivers State through his numerous manpower and infrastructural development and he is the choicest presidential aspirant in Nigeria.\nThe non-indigenes explained that their support for Obua as Wike’s successor is because his antecedents show he is the only one among other aspirants that can sustain Wike’s legacies."
  },
  {
    "headline": "Revision of obsolete laws in Akwa Ibom nearing completion – State Govt",
    "summarized_story": "The Akwa Ibom State Attorney-General and Commissioner for Justice Barr Uko Udom has revealed that the revision of the laws of the State which has not been done over 20-years ago is almost completed.\nThe Commissioner, who disclosed this on Friday while briefing newsmen on the Administration of Criminal Justice Law, 2022 commended the efforts of the present administration to upgrade and update its laws.\nAccording to him the passage of the bill would strengthen the rule of law, advance human rights and improve the administration of justice in the State.\n“It is worth noting that as part of the policy of the present administration in Akwa Ibom State to update and upgrade our laws, the general process of revision of the laws, which was last undertaken more than 20-years ago, is nearing completion.\n“The passage of the Administration of Criminal Justice Bill by the Akwa Ibom State House of Assembly and the subsequent assent of Governor Udom Emmanuel represent efforts by the present government to strengthen the rule of law, advance human rights and generally improve the administration of justice in Akwa Ibom State."
  },
  {
    "headline": "Kogi: Stakeholders intensify push for assent to Violence Against Persons Prohibition Bill",
    "summarized_story": "With only four states left to fully domesticate the Violence Against Persons (Prohibition) VAPP, law, an advocacy pushing for an assent to the VAPP Act earlier passed into law by the Kogi State House of Assembly has commenced with the inauguration of a steering committee to drive the process.\nDuring its maiden meeting held on Friday evening, members of the steering committee led by its interim chairman, Mr Abu Michael, agreed on a number of strategies it would deploy in prevailing on the State government to assent to the Bill.\nParts of the strategies include media day of action where it intends to explore media platforms, as well as engage with key stakeholders towards seeing to the signing and gazetting of the Kogi State Violence Against Persons (Prohibition)- VAPP Bill.\nDAILY POST reports that the VAPP law is designed to tackle all forms of violence against persons, in private and public life, as well as provide maximum protection and effective remedies for victims and punishment for offenders.\nOn his part, Senior Program Manager, Savannah Centre for Diplomacy, Democracy and Development(SCDDD), Sir Bola Abimbola urged the committee to discharge the assignment with utmost commitment and dedication, with a view to achieving the desired success."
  },
  {
    "headline": "Deborah Samuel’s killing sin against God – Archbishop of Canterbury",
    "summarized_story": "The Archbishop of Canterbury, Justin Welby has condemned the killing of Deborah Yakubu, a Christian student of Shehu Shagari College of Education, Sokoto.\nWelby described Deborah’s murder as a sin against God.\nDeborah, a 200-level student, was gruesomely murdered by some students for alleged blasphemy against Prophet Mohammad.\nIn a series of tweets, the Archbishop urged the Nigerian Government to protect religious rights.\nWelby wrote: “I strongly condemn the appalling stoning to death of a Christian woman in Sokoto, Nigeria."
  },
  {
    "headline": "EFCC releases ex-Speaker, Patricia Etteh",
    "summarized_story": "The Economic and Financial Crimes Commission, EFCC, has released former Speaker of the House of Representatives, Mrs Patricia Olubunmi Etteh on bail.\nRecall that she was arrested on 17th May over suspicious and shady financial involvement with Phil Jin Projects Limited.\nReports had it that Phil Jin Projects Limited was granted a contract by the NDDC for the supply of solar-powered street lights in some communities in Akwa Ibom.\nThe company received N287m, even though the contract was worth N240m.\nPhil Jin Project Ltd later paid N130m to Patricia Etteh."
  },
  {
    "headline": "Enugu govt secures foreign mentorship programme for 28 indigenous students",
    "summarized_story": "Ugwuanyi for the rare opportunity, the Executive Secretary of the Enugu State Scholarship Board, Barr.\nLevi Abonyi, disclosed that the scholarship mentorship programme was designed and developed by the Board to expose Enugu students to available funding opportunities around the world, in line with Gov.\nAbonyi revealed that the scholarship programme was approved by the State Executive Council (EXCO), adding that the programme has produced 46 fully-funded Masters and PhD students from the state.\nIt would be recalled that the first batch of the programme launched in October 2020 had 18 Enugu State indigenes as beneficiaries.\nOn his part, one of the 18 beneficiaries of the first batch of the scholarship mentorship programme in 2020, Odinaka Kingsley Eze, who graduated from University of Mississippi, USA, expressed delight that “this mentorship programme has up to 46 ambassadors”, saying: “All thanks to His Excellency, Rt."
  },
  {
    "headline": "Alleged blasphemy: Youths rampage as Christian girl escapes lynching in Bauchi",
    "summarized_story": "Barely two weeks after Deborah Samuel was killed in Sokoto over alleged blasphemy against Prophet Muhammad (SAW), some youths in Katangan Wargi, headquarters of Warji Local Government Area of Bauchi State have launched a manhunt for another Christian lady.\nHowever, the girl was whisked to safety by fellow Christians who got wind of the impending danger.\nBut the irate Muslim youths allegedly started destroying properties belonging to Christians after the planned attempt to lynch the girl failed after Jumma prayers on Friday.\nBut Bauchi Police Command is yet to confirm the incident as of press time.\nPolice Bauchi pokesman, SP Ahmed Wakili, did not pick up calls and SMS by The Nation."
  },
  {
    "headline": "From grace to grass… AGF Idris’ alleged N80bn fraud",
    "summarized_story": "Just like the proverbial hunter becoming the bushmeat, the country’s Accountant-General, Ahmed Idris, was arrested during the week over alleged money laundering and diversion of public funds.\nWith all of these controversial allegations, Idris has since been suspended by the Minister of Finance, Budget and National Planning, Zainab Ahmed.\nThe suspension, Finance Minister said, is in line with Public Service Rules to give room for proper and unhindered investigation.\nPrior to his appointment as Accountant-General, Idris had served as Director of Finance and Accounts at the Nigeria Security and Civil Defence Corps (NSCDC) headquarters, Abuja.\nHe was at the National Poverty Eradication Programme(NAPEP), Ministry of Police Affairs and Ministry of Interior as Assistant Director Finance."
  },
  {
    "headline": "Gunmen abduct politician, shoot only son in Anambra community",
    "summarized_story": "Special Adviser to former chairman of Nnewi South Local Government Area of Anambra State, Hon.\nThe community has been under siege for some time now, with the local government Secretariat burnt down earlier this week.\nChukwujekwu was reportedly abducted from his house while his only son was shot in the stomach.\nA source said the incident occurred around midnight, noting that the rampaging gunmen shot their way into the compound.\nThe source claimed the gunmen were infuriated following the victim’s reluctance in opening the gate for them."
  },
  {
    "headline": "Deborah: Tambuwal lifts curfew on Sokoto, bans all forms of procession",
    "summarized_story": "SOKOTO State governor, Aminu Tambuwal, has lifted the curfew imposed on the state over the recent killing of a student of Shehu Shagari College of Education for alleged blasphemy.\nTambuwal said the curfew was lifted after due consultations with security agencies confirmed the return of peace to the state.\nBajini-Galadanchi said the governor lifted the curfew with immediate effect and banned all forms of processions in the state until further notice.\n“The governor of Sokoto State has, after due consultations, lifted the curfew imposed on Sokoto metropolis with immediate effect.\nHe said Tambuwal thanked the people in the state for their understanding in complying with the curfew."
  },
  {
    "headline": "NESG set six-point agenda for prospective political aspirants",
    "summarized_story": "AHEAD of the 2023 general elections, the Nigerian Economic Summit Group (NESG), has prescribed six sets of templates as a guide to electing proper and fit political leaders in the coming political dispensation by the electorate.\nNESG is arguing that “if Nigerians make the right choices, within this decade, Nigeria can become a leading industrializing and reforming nation in Africa that focuses on building its state capacity and capabilities”.\nNESG Chairman, Mr. Asue Ighodalo, who stated this yesterday in his opening remarks in Abuja at the national economic dialogue on ” critical challenges confronting the Nigerian economy,” noted that the country will be free from decades-long political, policy, legislative, and regulatory constraints if Nigerians seize the opportunity of next election to elect credible, fit and proper officials.\nHe tasked the Nigerian government to address six priority areas which he said were shackles inhibiting the country’s economic growth.\nSix critical challenges causing economic dysfunction of the country according to Asue are, non-inclusive economic growth, macroeconomic instability, infrastructure deficit; human capital deficit and skills gap, national insecurity, and weak economic competitiveness."
  },
  {
    "headline": "Breaking: : Another Christian girl escaped death by whiskers in Bauchi State over alleged blasphemy",
    "summarized_story": "From Paul Orude BauchiBarely one week after Deborah Samuel was killed in Sokoto over alleged blasphemy against Prophet Muhammad (SAW), a Christian lady has escaped being killed in Katanga, Warji Local Government Area of Bauchi State.\nOur correspondent gathered that Muslim youths mounted a search for the lady immediately after the Jummaat prayers but could not find her.\nEnraged by not seeing her, the irate Muslim youths allegedly started destroying properties belonging to Christians in area.\nA source disclosed that few buildings were set blaze and some Christians, including a pastor of ECWA church, were injured.\nHe however called on the Christian community in the state to remain calm and not to allow the situation to degenarate."
  },
  {
    "headline": "Presidential primaries: APC, PDP narrow race to 9",
    "summarized_story": "From Romanus Ugwu and Ndubuisi Orji, AbujaAs the presidential primaries of the All Progressives Congress (APC) and Peoples Democratic party (PDP) draw nearer, there are indications that both parties might have narrowed the race down to about nine aspirants.\nA total of 17 aspirants obtained the PDP nomination forms for the May 28/29 presidential primary of the party.\nThe former vice president, who is contesting for the sixth time, was the PDP 2019 presidential candidate.\nPeter Obi has a lot going for him in the PDP presidential primary.\nThe former Anambra governor, who was the PDP vice presidential candidate in the 2019 general elections, is generally considered as a breath of fresh and a politician without baggage."
  },
  {
    "headline": "2023: Nigeria needs leader that has audacity to take risks –Jack-Rich",
    "summarized_story": "Eminent businessman and All Progressives Congress (APC) Presidential aspirant, Tein Jack-Rich, has said his motivation to govern Nigeria in 2023 is to emancipate the country from its current economic doldrums.\nIt means that in 2023, with all the turbulences that the world is experiencing, it is going to be worse.\nSo, you need a strong, smart, energetic, and fresh leader with the right knowhow and how to turn that knowhow into fiscal value for the country to grow.\nSo, the bubble right now is about a do-not scenario in 2023 is going to be catastrophic.\nPublic and private sector partnership is key and the public sector development is also important – -developing the public sector with the right knowhow, with the right training."
  },
  {
    "headline": "Lagos: Police arrest six suspects over Lekki killing",
    "summarized_story": "Lagos State Commissioner of Police, Mr Abiodun Alabi, who announced the arrest at a press briefing, said a total number of six suspects have been arrested.\nUpon receipt of the case, detectives embarked on a diligent investigation that led to the arrest of one Joseph Ashiwobel who dispatched the sack from Calabar to Lagos.\nInvestigation is still ongoing to apprehend other fleeing suspects in order to recover more of the guns he had sold to people in Lagos,” he stated.\n“A team of detectives of the Lagos State Command swung into action and arrested some armed robbery suspects in their hideout situated around the Ojo area of the state and recovered exhibits in their possession.\nSeven locally made pistols, 68 live cartridges, cutlasses, axe, charms, four mobile phones, tortoise and a female bag were recovered from the suspects."
  },
  {
    "headline": "N80bn Fraud: More heads to roll as EFCC closes in on AGF’s accomplices",
    "summarized_story": "Mr. Idris was arrested after failing to honour invitations by the EFCC to respond to issues connected to the fraudulent acts.\nMeanwhile, fresh facts have emerged that the Senate committee on Public Accounts’ negligence and compromise to properly supervise the AGF’s office, may have led to the financial sleaze.\nBy law, the Senate committee is constitutionally mandated to supervise activities of the AGF’s office.\nThe law requires that the office of the AGF submits an audit report to the Senate committee on Public Accounts.\nThe Senate committee, by law, is expected to carry out a comprehensive verification of claims made in the report by the AGF’s office."
  },
  {
    "headline": "Just In: Tension in Bauchi, as Religious Fanatics Burn Houses over Alleged Blasphemy",
    "summarized_story": "By Segun Awofadeji in BauchiIrate youths believed to be religious fanatics late Friday evening went on rampage destroying structures belonging to Christians in Katangan Warji, headquarters of Warji LGA of Bauchi State.\nTHISDAY checks revealed that trouble started when unconfirmed reports circulated in the social media that one of the Christian youths in the town allegedly blasphemed against Islam.\nThis is coming a week after a Sokoto student Deborah Yakubu was killed by Islamic fanatics over alleged blasphemy.\nI am speaking to you, efforts are on to save his life as blood is rushing from the wounds inflicted on him”.\nOne of the leaders of the Christian Association of Nigeria in the state confirmed the situation and said the Police Commissioner in the state and the SSA to the Governor on Christian Religious Affairs, had been informed."
  },
  {
    "headline": "Primaries: Ekweremadu Warns PDP against a Repeat of Zamfara Scenerio",
    "summarized_story": "Charles Ogbo Asogwa, giving update on the legal tussle surrounding the three-man delegates election in the Enugu State chapter of the PDP.\nThe statement read: “We wish to inform our teeming supporters that the lawsuit concerning the three-man ad-hoc delegates came up today, Friday, May 20, 2022 at the Federal High Court, Abuja.\n“Three-man ad-hoc delegates for the State Convention and 774 national delegates for the National Convention fall far short of the quorum stipulated in the PDP Constitution.\nIn the case of Enugu State, well over 2,500 delegates constitute the State Congress, while the ad-hoc delegates are only 780.\nThis is way below the two-thirds stipulated by the PDP Constitution as amended."
  },
  {
    "headline": "Statutory Delegates Lament Loss of Largesse, Elected Delegates Now to Pick Presidential Candidates",
    "summarized_story": "With the president hesitant to sign the amendment, it means only National delegates elected at the local government congresses will determine Presidential flagbearers of the party.\nLikewise, only the five delegates elected from each ward for the state congresses will vote to elect governors, senators, House of Representatives and states’ House of Assembly members for the APC.\nFor PDP, it will be the three delegates elected from each ward.\nAs things stand, the APC will elect its presidential flagbearer with 2322 democratically elected delegates, based on three National delegates per local government area.\nPower to determine those that will emerge as candidates for various elective positions has now returned to the state governors; already, they determined those on the list of elected delegates sent to INEC."
  },
  {
    "headline": "Leaders: Foisting Northern Presidential Candidates, Grave Tragedy",
    "summarized_story": "There are also important cultural exchanges that are vital to our country; we want to appreciate the European Union for that.\nAyu said: “We worry about post elections as a political party.\n“As a political party, we’re having our convention in the next eight days.\nour 15 presidential aspirants.”Ayu also lamented the rising debt of Nigeria, saying when the PDP was in power, Nigeria was a debt-free country.\n“We have also at the request of the Nigerian authorities always deployed electoral observation, to entrench the process of democracy."
  },
  {
    "headline": "Deborah: Tambuwal Lifts Curfew, Bans all Forms of Processions",
    "summarized_story": "The governor also banned all forms of processions in the state until further notice.\nDeborah was killed and her remains were set on fire by the extremists, two of whom have been arrested and arraigned by the Sokoto State Police Command.\n“South-east and Imo State in particular can’t be excluded.\nWe have restored normalcy now in Sokoto State.\nI will be a president for all Nigerians.”A former Governor of Imo State, Emeka Ihedioha, said that Tambuwal was the right person to lead the country after Buhari."
  },
  {
    "headline": "BREAKING: Nigerian High Court Jails Ex-President Jonathan's Godson, George Turnah, Four Years",
    "summarized_story": "Justice A.T. Mohammed of the Federal High Court in Port Harcourt, Rivers State, on Friday, convicted and sentenced a godson of former President Goodluck Jonathan, George Turnah, to four years imprisonment.\nTurnah is also a former Special Assistant to Mr. Dan Abia, erstwhile Managing Director of Niger Delta Development Commission, NDDC.\nLtd in the Asset Declaration Form you filled at the Economic and Financial Crimes Commission and thereby committed an offence contrary to Section 27 (1) & (3)(a) of the Economic and Financial Crimes Commission Establishment Act 2004 and punishable under Section 27 (3)(c) of the Economic and Financial Crimes Commission Establishment Act 2004.\"\nIn the course of the trial, prosecution counsel, I. Agwu called several witnesses and presented several documents in court.\nAgainst his declaration, the court found out that he was one of the Directors and majority shareholder of Ashford Consult and Events Nig."
  },
  {
    "headline": "BREAKING: Nigerian High Court Jails Ex-President Jonathan's Godson, George Turnah, Four Years",
    "summarized_story": "Justice A.T. Mohammed of the Federal High Court in Port Harcourt, Rivers State, on Friday, convicted and sentenced a godson of former President Goodluck Jonathan, George Turnah, to four years imprisonment.\nTurnah is also a former Special Assistant to Mr. Dan Abia, erstwhile Managing Director of Niger Delta Development Commission, NDDC.\nLtd in the Asset Declaration Form you filled at the Economic and Financial Crimes Commission and thereby committed an offence contrary to Section 27 (1) & (3)(a) of the Economic and Financial Crimes Commission Establishment Act 2004 and punishable under Section 27 (3)(c) of the Economic and Financial Crimes Commission Establishment Act 2004.\"\nIn the course of the trial, prosecution counsel, I. Agwu called several witnesses and presented several documents in court.\nAgainst his declaration, the court found out that he was one of the Directors and majority shareholder of Ashford Consult and Events Nig."
  },
  {
    "headline": "Nigeria’s Attorney-General, Malami Accused Of Interfering With EFCC’s Probe Of Multi-million-naira Pension Fraud In University Owned By Ex-lawmaker",
    "summarized_story": "Ajibade disclosed this in a letter to Malami titled ‘Alleged Interference With EFCC Investigation Into Misappropriation Of Pension Funds/Pension Fraud At Achievers University, Owo, Ondo State’.\nRather, it operated an unlicensed and unregulated pension scheme tagged \"University Savings Scheme\" where the management diverted the pension contributions of its staff members to.\nThe letter read, “I am a former employee of Achievers University, Owo, Ondo State, where I worked as a lecturer between November 2012 and October 2017.\nThe import of Mrs. Bamifere’s shocking revelation is that the Chief Legal Officer of the Federation interfered with and/or meddled in the EFCC’s ongoing pension fraud investigation.\nConsequently, criminal breach of trust and pension fraud at Achievers University lingers on."
  },
  {
    "headline": "Nigeria’s Attorney-General, Malami Accused Of Interfering With EFCC’s Probe Of Multi-million-naira Pension Fraud In University Owned By Ex-lawmaker",
    "summarized_story": "Ajibade disclosed this in a letter to Malami titled ‘Alleged Interference With EFCC Investigation Into Misappropriation Of Pension Funds/Pension Fraud At Achievers University, Owo, Ondo State’.\nRather, it operated an unlicensed and unregulated pension scheme tagged \"University Savings Scheme\" where the management diverted the pension contributions of its staff members to.\nThe letter read, “I am a former employee of Achievers University, Owo, Ondo State, where I worked as a lecturer between November 2012 and October 2017.\nThe import of Mrs. Bamifere’s shocking revelation is that the Chief Legal Officer of the Federation interfered with and/or meddled in the EFCC’s ongoing pension fraud investigation.\nConsequently, criminal breach of trust and pension fraud at Achievers University lingers on."
  },
  {
    "headline": "Nigeria’s Attorney-General, Malami Accused Of Interfering With EFCC’s Probe Of Multi-million-naira Pension Fraud In University Owned By Ex-lawmaker",
    "summarized_story": "Ajibade disclosed this in a letter to Malami titled ‘Alleged Interference With EFCC Investigation Into Misappropriation Of Pension Funds/Pension Fraud At Achievers University, Owo, Ondo State’.\nRather, it operated an unlicensed and unregulated pension scheme tagged \"University Savings Scheme\" where the management diverted the pension contributions of its staff members to.\nThe letter read, “I am a former employee of Achievers University, Owo, Ondo State, where I worked as a lecturer between November 2012 and October 2017.\nThe import of Mrs. Bamifere’s shocking revelation is that the Chief Legal Officer of the Federation interfered with and/or meddled in the EFCC’s ongoing pension fraud investigation.\nConsequently, criminal breach of trust and pension fraud at Achievers University lingers on."
  },
  {
    "headline": "Al-Mustapha: If I become president, I will live in Sambisa forest",
    "summarized_story": "Hamza Al-Mustapha, former aide to the late Sani Abacha, says he will end Boko Haram in six months and will stay in Sambisa forest, if he becomes the president of Nigeria.\nAl-Mustapha who is running for president on the platform of the Action Alliance (AA) pledged that his administrstion will do whatever it takes to tackle insecurity in the country.\nHe said he will rework how the military operates and responds to security threats.\nAdvertisement“There will be a military with renewed vigour and committment under his admunistration,” he said.\n“If I become the President, I will live in Sambisa; I will stay there during weekends, holidays and see if anyone will touch me."
  },
  {
    "headline": "Al-Mustapha: If I become president, I will live in Sambisa forest",
    "summarized_story": "Hamza Al-Mustapha, former aide to the late Sani Abacha, says he will end Boko Haram in six months and will stay in Sambisa forest, if he becomes the president of Nigeria.\nAl-Mustapha who is running for president on the platform of the Action Alliance (AA) pledged that his administrstion will do whatever it takes to tackle insecurity in the country.\nHe said he will rework how the military operates and responds to security threats.\nAdvertisement“There will be a military with renewed vigour and committment under his admunistration,” he said.\n“If I become the President, I will live in Sambisa; I will stay there during weekends, holidays and see if anyone will touch me."
  },
  {
    "headline": "'Blasphemy': Pastor injured, houses burnt as riot breaks out in Bauchi",
    "summarized_story": "A pastor has been reportedly injured in an attack on Katangan area of Warji LG of Bauchi over an alleged case of blasphemy.\nMany houses were said to have been burnt in the riot, including a church situated in the area.\n“The situation there is more than tension since many houses have been burnt down.\n“A shop which belongs to an ECWA Church in the area was also burnt down.\nAnd I learnt that the District Head of the area and the leaders are on top of the situation."
  },
  {
    "headline": "'Blasphemy': Pastor injured, houses burnt as riot breaks out in Bauchi",
    "summarized_story": "A pastor has been reportedly injured in an attack on Katangan area of Warji LG of Bauchi over an alleged case of blasphemy.\nMany houses were said to have been burnt in the riot, including a church situated in the area.\n“The situation there is more than tension since many houses have been burnt down.\n“A shop which belongs to an ECWA Church in the area was also burnt down.\nAnd I learnt that the District Head of the area and the leaders are on top of the situation."
  },
  {
    "headline": "Nigeria’s insecurity started when we were in office, says Yar’Adua’s justice minister",
    "summarized_story": "Michael Aondoakaa, former minister of justice and attorney-general of the federation, says Nigeria’s insecurity began during the administration of former President Umaru Musa Yar’Adua.\nSpeaking in Abuja, Aondoakaa, who was a minister under the administration of Yar’Adua, said small and light weapons were smuggled into Nigeria after Muammar Gaddafi, former Libyan leader, was removed from office.\n“The insecurity started during our time when I was in the office because of the collapse of the government in Libya.\nPeople moved with small weapons down to south Sahara down to our region.\n“You don’t talk security on the pages of newspapers and you also don’t shout security."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Disney+ launches in South Africa. Here’s how much it costs",
    "summarized_story": "Earlier in January, the Walt Disney Company confirmed the expansion of its streaming service, Disney+, to 42 new countries, including 6 African countries—Egypt, Morocco, Algeria, Libya, Tunisia, and South Africa.\nDisney+ South Africa’s arm offers users the Standard Plan, at R119 ($7.47)/month or R1,190 ($74.64)/annum.\nOn the service, South Africans will access original Disney content like the Star Wars series and Encanto; and features from the Marvel Cinematic Universe (MCU) like Moon Knight.\nWhile Netflix does have an affordable R49/month Mobile plan in South Africa, the plan only allows 1 user and 1 device.\nThe only Netflix plan similar to Disney+’s Standard R119 plan is Netflix’s Premium plan which costs R199 plan and allows Ultra HD streaming on up to 4 devices."
  },
  {
    "headline": "How Adora Nwodo is making a name for herself in the cloud",
    "summarized_story": "She currently works as a cloud engineer at Microsoft and is the author of Cloud Engineering for beginners.\nAdora Nwodo on cloud engineering and mixed realityKoromone Koroye: Hi Adora, thanks for agreeing to speak with me.\nAdora Nwodo: I am a software engineer currently building mixed reality on the cloud at Microsoft.\nCloud engineers literally do their engineering on the cloud, whether software engineering or DevOps engineering.\nAN: Before I talk about mixed reality, let me briefly explain the difference between augmented reality (AR) and virtual reality (VR)."
  },
  {
    "headline": "TABS is tomorrow! 💃 💃",
    "summarized_story": "💃😉😊 Tomorrow is the Techpoint Africa Blockchain Africa Summit (TABS)!\n😁AdvertisementIf you’ve registered, you’ll see all the fantastic things we’ve packaged just for you tomorrow.\nTikTok to credit creatorsI’ve never used TikTok, but I’m considering signing up.\nJust this month, the company introduced two new features — Pulse and Branded Mission — for content creators to earn money on the app.\nThis feature, a button, allows creators to credit all types of inspiration for their content, like dances, jokes, and viral sounds."
  },
  {
    "headline": "TikTok on a “Branded Mission”",
    "summarized_story": "For more information on this acquisition, listen to today’s episode of the Techpoint Africa Podcast here.\nTikTok to roll out a new ad productTikTok has announced the launch of “Branded Mission,” a new advertising product.\nIn summary, Branded Mission allows emerging and aspiring creators to respond to ad casting calls directly on TikTok.\nBranded Mission is currently in beta testing and is available to brands in over a dozen markets.\nTechpoint Africa Blockchain SummitThe Techpoint Africa Blockchain Summit (TABS 2022) will take place in two days!"
  },
  {
    "headline": "[PODCAST] Tax evasion in Nigeria to get harder",
    "summarized_story": "Share this article:Taxation is not a subject that Nigerians want to talk about, but the Federal Inland Revenue Service (FIRS) is about to make it unavoidable.\nUsing the National Identification Number (NIN), the organisation wants to track financial transactions in the country to tax Nigerians effectively.\nCompared to Q1 2021, the company witnessed impressive growth with revenue growing to $47.6 million, orders growing to 9.3 million, and gross merchandise value hitting $252.7 million.\nWith the company announcing that it had acquired a payment service solution provider license (PSSP), we explored the possibility of the company growing its fintech footprints.\nEmmanuel shared a Technext report that revealed that most car marketplaces in Nigeria made up to 150% profit from car sales."
  },
  {
    "headline": "Binance To Host “Block and Brunch” Networking Event For Professionals In Lagos",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\nThe event targets professionals who are crypto newbies and enthusiasts for an afternoon of learning and networking.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Traction Appoints Babatope Oni as Chief Technology Officer",
    "summarized_story": "This article is a Brand Press post.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:Leading financial services platform, Traction has appointed Babatope Oni as Chief Technology Officer (CTO).\nI am excited to join the Traction team,” said the new Traction CTO, Babatope Oni.\nTo learn more about Traction, please visit https://tractionapps.co/Brand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "How partnership between school, private industry can boost Nigeria’s tertiary institutions’ IGR",
    "summarized_story": "Tertiary institutions all over the world are regarded as the hub of economic and sustainable national development.\nIn Nigeria, the tertiary institutions are veritable tools for the realisation of socio-economic national development; hence the most powerful and critical success factor for individuals and society.\nAnother engineer advocates for the work job learning education system as a solution to the incessant half-baked graduates coming out of Nigeria’s tertiary institutions.\nRead also: Nigerians rely on unhappy teachers to develop education sector“Internally generated revenue (IGR) can be a very solid means of financing tertiary institutions in Nigeria.\nInternally generated revenue unit in higher institution, therefore, is to serve as a relief to government expenditure,” he stated."
  },
  {
    "headline": "Woman Saved From Gallows in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinteresta white Thorsday made by God– Barr Olayiwola Afolabi based in Benin, Edo State led a team of journalists to Oko Prisons in the city of Benin- He was not on a prison visit to dole out his known provrrbial gifts to the prison inmates-On the contrary, he was at the prison to effect the release of Mrs Enobong Isonguyo who was incarcerated there since 2013 for the suspected murder of her husband Engr Victor Gabriel Isonguyo, a senior director at Nigerian National Petroleum Company in Benin-An Edo High Court judge, Geraldine Imadegbelo, sentenced her to death by hanging alongside their family psstor Udoka Ukachukwu The trial judge accepted that the prosecutor proved the murder case beyond resonable doubt-Counsel to Mrs Enobong lsonguyo , Barr Olayiwola Afolabi, was dissatisfied by the verdict of the judge- Therefore , after legai consultatoon with his client, he got her approval to proceed on appeal- Behold, the court of appeal upheld the ruling of the high court in Benin-Olayiwola Afolabi was not detered by the setback because he was duobly confident he had a good case- Aferall, all the material ingredients of murder alleged against his client had not been fully proven by the prosecutor- Given this fact , it is trite law for the judge to err in freeing her than err in coñdenming her to death that ìs irreversibĺe-Furthrrmore, Olayiwola Afolabi reasoned that total empirical evidence is very critical in determining whether a murder suspect is guilty of the offence- Judges shouid not base their verdicts on absurd fiction , speculation and volatile imagination as it is now the case-According to him, such issues should not arise in law- They are unknown in Nigerian crimminal code-What is more?\nOlayiwola Afolabi discovered that a major pillar of the prosecutor’s case was legally puerile- His evidence linking Mrs Enobong Isonguyo to her husband’s death is the confessional statement of the co-accused Pastor Udoka Ukachukwu – Impliedly, there is no direct evidence associating her with the alleged crime- She was not at the scene of crime neither did the prosecutor provide concrete evidence of her conspiracy in the death of her husband-Based on all these assured lines of legal thought, Olayiwola Afolabi– after due approval of his client– proceeded to the Supreme Court- In a landmark judgment delivered by Justice Mary Odili in April 2022 she overturned the verdicts of both the lower court and court of appeal that sentenced Mrs Enobong Isonguyo to death- She ordered her to be released without any conditions, noting that the two courts miscarried justice in finding her guilty of murder- And, so, Mrs Enobong Isonguyo was saved from the gallows in strict adherence to the dikta of the crimminal còde while ignoring the whims and caprices of the uninformed, laymen in beer parlours-It is to effect the release of Mrs Enobong Isonguyo , in accordance with Justice Mary Odili’s directive, that took Olayiwola Afolabi to Oko Prisons, Benin on May 5, 2022 accompanied by his legal team and a corpus of journalists -After he emerged from the prison with Mrs Enobong Isonguyo, an elated Olayiwola Afolabi eulogized Justice Mary Odili for her fair, upright and monumental judgment which according to him demonstrates that “the judiciary is the last hope of the common man”-On her part, Mrs Enobong Isonguyo fought back tesrs of freedom- Then, she said– “I thank God and my lawyer for everything- I am now an ambassador of Christ-” As she spoke, a big bibie was positioned under her left armpit-Her co- accused Pastor Udoka Ukachukwu — founder of Land Of Evidence Church, Benin–escaped from Oko Prisons, Benin during the ENDSARS protesr in 2020 with his death sentence hanging on his head-The prosecutor in the murder trial in his investigative report tended in court alleged a steaming amorous affairs beteeen Mrs Enobong Isonguyo and Pastor Udoka Ukachukwu resulted in a disputed pregnancy complained about by her husband- Following this, Pastor Udoka Ukachukwu conspired with Mrs Enobong Isonguyo to get her husband out of the way- Thereafter, the pastor killed him while riding one night in the man’s Toyota Corolla car inside which the pastor also burnt him beyond recognition-Mrs Enobong Isonguyo denied any affairs with the pastor- She explained–“He has been very honest to us; so I don’t know what is happening—–God should intervene because I have never committed any crime before in my life- ”Olayiwola Afolabi recommends the landmark judgment of Justice Mary Odili to lawyers and law teachers/ students for use in updating their knowledge in legal jurisprudence on the murder case-Meanwhile, following victory at the Supreme Court in the murder case Olayiwola Afolabi inched his way to achieving the status of SAN- Also, he has shown that diligence , sacrifice, doggedness perseverance and emotive organic solidarity with a client are formidable foundations for building a succesful legal career- Lastly, by saving the life "
  },
  {
    "headline": "Obaseki hails military for support in tackling insecurity, setting up of operative base in Ehor – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has lauded the Nigerian Army for setting up a forward operating base in Ehor, Uhunmwode Local Government Area of the state.\nObaseki gave the commendation while addressing the wife of Chief of Army Staff and President, Nigerian Army Officers’ Wives Association (NAOWA), Mrs. Salamatu Yahaya, who led other members of the association on a courtesy visit, at the Government House, Benin City.\nIt’s our people first because it’s people that create everything first; it’s people that create money, as well as technology, among others.\nIn the case of education, our focus is on the foundation, because once you have a sound foundation, that child can build on that foundation subsequently.\nThe Edo Basic Education Sector Transformation (EdoBEST) is acclaimed as one of the most transparent educational projects on the continent."
  },
  {
    "headline": "Edo urges submission of e-copy of documents to ease application for building plans, permits – Nigerian Observer",
    "summarized_story": "Edo urges submission of e-copy of documents to ease application for building plans, permitsShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has called for electronic submission of processing documents to the Ministry of Physical Planning, Urban and Regional Development to ease and fast track processing of building plans, permits and other approvals.\nCommissioner of Physical Planning, Urban and Regional Development, Isoken Omo, in a statement, said all documents submitted in support of applications for building permits and other approvals from the Ministry must be both hard and electronic copies.\nShe stated that the soft copies should be submitted in a flash drive.\nAccording to her, “This is in line with the state’s implementation of e-governance in service delivery procedures, which mandates electronic processing of documents.\n“The Ministry reiterates that its offices across the state are open for document processing as the Operation Plan Edo (OPE) intensifies and urges adherence to the new guidelines for speedy processing of approvals and permits.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo to screen pensioners in Diaspora via Skype from May 23 – Nigerian Observer",
    "summarized_story": "Edo to screen pensioners in Diaspora via Skype from May 23Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has announced the commencement of revalidation exercise for pensioners resident outside Nigeria.\nIn a statement, Permanent Secretary/Chairman, Edo State Pensions Bureau, Mrs. Aikefe O. Aigbavboa, said the revalidation exercise for pensioners residing outside Nigeria will be conducted virtually, via Skype.\nThe letter should be addressed to the Managing Director, ICT Agency and sent via email to: bvsonline.state@edostate.gov.ng.”“During the Skype screening, pensioners will be required to show their biometric slip and identity cards.\nFor the avoidance of doubt, screening via Skype is strictly for pensioners outside the country,” she added.\n“For further enquiries on the above, pensioners should kindly contact Daniel on 0706 421 4083 (WhatsApp),” she added."
  },
  {
    "headline": "NRC postpones resumption of Abuja-Kaduna train service indefinitely",
    "summarized_story": "The Nigerian Railway Corporation (NRC) has postponed the planned resumption of Abuja-Kaduna train service indefinitely.\nThe postponement comes amid protests against the resumption by families those kidnapped by terrorists who attacked a Kaduna bound train on the route on March 28.\nThe NRC had earlier fixed Monday, May 23 for the resumption of the train service but the relatives of the victims opposed the move, saying it was insensitive to resume operation on the route when their loved ones are still languishing in captivity.\nApparently bowing to their demand, the NRC postponed the resumption indefinitely as no new date was announced.\n“The NRC expresses its profound gratitude to the security agencies for the continued support"
  },
  {
    "headline": "‘We’re dying of hunger, Oyetola has neglected us’ – Osun retirees cry out",
    "summarized_story": "By Sunday Oguntuyi, OsogboPensioners in Osun State have lamented the non-committal of their pension areas by Gboyega Oyetola-led administration, noting that they are presently facing starvation.\nWe are facing a lot of challenges in Osun State as regards our entitlements.\n“We now notice that our efforts to meet Governor Oyetola have been proving futile.\nWe don’t know our sins to Governor Oyetola.\nAfter all he (Oyetola) worked with Governor Aregbesola (Former Governor of the state, now Minister of Interior)“Pensioners are dying."
  },
  {
    "headline": "2023: I’ve poor parents, I still eat ‘garri’ three times a day – Amaechi",
    "summarized_story": "Amaechi, former governor of Rivers State made the remark when he met with delegates of the APC in Niger State on Thursday ahead of the party’s primary elections.\nHe emphasized saying that he could easily connect with the poor as he used to, and still, eat ‘garri’ three times a day.\nI ate garri three times a day, and I still eat garri three times a day till today, so I know poverty”, he said.\n“But in six months, we brought down insecurity in Rivers State,” Amaechi said.\n“When everybody was fighting me, saying ‘he’s supporting a northern candidate, he’s supporting a Hausa/Fulani candidate,’ I remained steadfast that I was supporting a Nigerian candidate."
  },
  {
    "headline": "‘Embrace e-Naira, paper notes will be out of circulation soon’ – CBN official",
    "summarized_story": "An official of the Central Bank of Nigeria (CBN), has urged traders to embrace the e-naira, noting that paper naira notes will soon be out of circulation.\nMr Godwin Okafor, controller, Delta State Branch of CBN, stated this on Friday at the popular Ogbogonogo market during the market sensitisation on e-Naira.\n“We are here at the market today to sensitise the market people on the use of e-Naira.\nIt is fully backed by CBN, unlike Bitcoin which has no legal backing.”The consultant of CBN on e-Naira, Dr. Aminu Bizi, said Delta was chosen as the second state to sensitise market women on e-Naira after Lagos, PUNCH reported.\n“We are here to sensitise market men and women, shop to shop on the use of e-Naira."
  },
  {
    "headline": "JUST IN: Court sentences Peter Nielsen, a Danish to death for killing wife, daughter",
    "summarized_story": "A Lagos State High Court on Friday, sentenced Peter Nielsen, a citizen of Denmark, to death by hanging for killing his Nigerian wife Zainab and three-year-old daughter Petra.\nJustice Bolanle Okikiolu-Ighile, the presiding judge, found the accused guilty on counts one and two of murder preferred against him by Lagos state.\nThe judge said “I hereby pronounce that you Peter Nielsen shall be hanged by the neck until death.\nThe judge had fixed Friday, May 6, to deliver the judgment, but court officials told journalist that the judgment was not ready, and adjourned till today, May 20.\nLagos Attorney-General and Commissioner for Justice, Kazeem Adeniji, had told the court that Nielsen murdered both Zainab, his wife, and Petra, their daughter at about 3:45am at 4, Flat 17, Bella Vista Tower, Banana Island Ikoyi."
  },
  {
    "headline": "Imo PDP Criticised Over ‘Stipends’ For Delegates – Leadership News",
    "summarized_story": "Barely hours after the Imo State chapter of the Peoples Democratic Party (PDP) issued a directive to aspirants to provide what it termed stipends for delegates, opposition members have condemned their action, saying it is legalisation of vote buying.\nThe PDP State Secretary, Nze Ray Emeana had in a notice to all aspirants titled “Stipends to Delegates” dated May 19th, directed them to provide finances for the transportation of delegates to the different points of election.\nAll state Vice Chairmen of the senatorial districts are directed to appoint monitoring committees to ensure compliance and report any breach to the state party”.\nFormer Dean of the Imo State University and Law Professor, Nnamdi Obiaraeri said the directive was a tacit endorsement of vote buying.\nEfforts to get the reaction of the PDP State Publicity Secretary, Mazi Emenike Nmeregini proved abortive as he didn’t take the calls put across to him."
  },
  {
    "headline": "Coalition Holds 1m-man March For Peter Obi",
    "summarized_story": "The exercise is anchored by the Coalition for Peter Obi (CPO), which is made up of more than a dozen support groups for Mr Peter Obi.\nIn a statement in Abuja, Chairman of the coalition, Mr Marcel Ngogbehei said that the support groups including, Peter Obi Support Network (POSN), Like Minds for Peter Obi (LMPO), Nigeria Needs Peter Obi (NNPO), TakeBackNaija (TBN), Women for Peter Obi (WPO), Associates of Peter Obi (APO), Peter Obi FC (POFC), Peter Obi movement for president (POMP), Associates of Peter Obi (APO/POE) Peter Obi candidacy movement (POCM), Peter Obi Ambassadors (POA), TeamOHO, among others have been mobilised to ensure the success of the movement on Saturday.\n“The 1 million-Man-March is anchored by Coalition for Peter Obi (CPO), which is made up of more than a dozen different support groups for Mr Peter Obi.\n“All supporters of Peter Obi will participate fully in the march all over Nigeria.\nThe one-million-match is a show of solidarity and love for the credible candidature of Mr Peter Obi."
  },
  {
    "headline": "24 Years After Oil Pollution, Lagos Community To Taste Potable Water",
    "summarized_story": "For residents of the community before 1996 , their community had existed for over 50 years without any such (leakage) issue.\nBaruwa community is located in the Alimosho local government area of Lagos State.\nBaruwa, a sprawling Lagos community already battling with underground water contamination that has constrained residents efforts in managing COVID-19 spread without potable water is now living in fear.\nLagos State Government InterventionTwenty four years after ruptured petroleum pipeline reportedly contaminated underground water in Baruwa area, present administration of Lagos state has commenced efforts to provide potable water to the community.\nThe governor who highlighted the challenges of achieving sustainable water supplyat the second edition of the annual International Water conference, organised by Lagos state Water Regulatory Commission, LASWARCO, noted that Lagos State Water Corporation produces 210 million gallons per day, MGD, against the daily water demand estimate of 540 MGD."
  },
  {
    "headline": "Monkeypox Cases Investigated In Europe, US, Canada, Australia",
    "summarized_story": "Cases of monkeypox are being investigated in several European countries as well as the US, Canada and Australia, according to health authorities and local media reports.\nThis follows infections confirmed in Italy, Sweden, Spain, Portugal, the US, Canada and the UK – where the first European case was reported.\nThere are now 20 confirmed cases in the UK, Health Secretary Sajid Javid said on Friday.\nSpanish health authorities have also reportedly purchased thousands of smallpox jabs to deal with the outbreak, according to Spanish newspaper El País.\nIn North America, health authorities in the US state of Massachusetts confirmed that a man has been infected after recently travelling to Canada."
  },
  {
    "headline": "BREAKING: Pastor injured, houses burnt as riot erupts in Bauchi over alleged blasphemy",
    "summarized_story": "Riot reportedly broke out in Katangan area of Warji Local Government Area of Bauchi State on Saturday as irate youths reportedly burnt houses and injured a pastor over another case of alleged blasphemy.\nNews Direct gathered that the violence began when a message was allegedly circulated on social media that a Christian girl in the town allegedly engaged in blasphemy of Islam while reacting to the Sokoto incident.\nDetails of the incident are still sketchy as the State’s Police Public Relations Officer, Ahmed Wakili could not take his calls and was unable to reply text messages forwarded to him."
  },
  {
    "headline": "Gunmen Abduct Keffi Local Government Chairman In Nasarawa, Driver, Kill Policeman",
    "summarized_story": "The Chairman of Keffi Local Government Area in Nasarawa State, Hon Muhammad Baba Shehu, has been abducted by gunmen.\nThe incident occurred in the Gudi district of the Akwanga Local Government Area around 6:30pm on Friday.\nThe gunmen also reportedly killed the police orderly of the chairman, Sergeant Alhassan Habibu Nasir.\nThe police sergeant was killed during a shootout with the gunmen.\nThe gunmen reportedly opened fire on his official vehicle as he approached Gudi, killing his police orderly and abducting him and the driver."
  },
  {
    "headline": "2023: State-by-state Breakdown Of APC Delegates In Nigeria",
    "summarized_story": "A state-by-state breakdown of All Progressives Congress (APC) delegates in Nigeria was obtained and released by Joe Igbokwe, a chieftain of the ruling party, on Friday, May 20.\nAs seen in the breakdown, the total number of delegates in all the states is 7810.\nThe top five states with the highest number of delegates are Kano, Katsina, Borno, Osun, and Lagos.\nThe Federal Capital Territory (FCT) has the lowest number of delegates: 53 in all.\nSee the breakdown below:Kano: 465 delegatesKatsina: 384 delegatesBorno: 324 delegatesOsun: 308 delegatesLagos: 304 delegatesOyo: 292 delegatesJigawa: 266 delegatesNiger: 251 delegatesOgun: 248 delegatesNasarawa: 245 delegates."
  },
  {
    "headline": "Bishop Onuoha declares for Abia governorship",
    "summarized_story": "Bishop Sunday Onuoha, Friday, formally joined the 2023 governorship race for Abia State under the platform of the African Democratic Congress, ADC.\nThe former Special Assistant to the President on Privatisation, and Co-chair of Interfaith Peace and Dialogue Forum, made the declaration at a media parley in Umuahia.\nBishop Onuoha who expressed optimism over clinching the party’s ticket said he had full knowledge of the challenges of the state, and would tackle them head long if elected Governor.\n“Having crisscrossed all parts of Abia State, I can humbly tell you that I know the issues, problems and challenges amongst my people.\nI have sat and talked to, and sometimes felt the ache of a people who want nothing more than a change from the bleak status-quo."
  },
  {
    "headline": "Niger 2023: 241 councillors back APC guber aspirant, Idris Malagi",
    "summarized_story": "Up to 241 All Progressives Congress (APC) councillors and ward leaders in Niger state have endorsed Blueprint Newspapers publisher and frontline gubernatorial aspirant, Alhaji Mohammed Idris Malagi, as the next governor of the state.\nThe council legislators from the 25 local government areas of Niger state made the endorsement Thursday during a consultative meeting held at the state House of Assembly complex.\nThe councillors under the umbrella of Forum of Councillors of Niger state said the endorsement of Malagi was based on his overwhelming acceptance by the rural dwellers and his proper understanding of the problems of the state.\nUsman explained that the governorship aspirant has shown Nigerlites beyond reasonable doubt that he has the capacity to govern the state.\nWe have the mandate of majority of our electorates to endorse Malagi as the governor of Niger State in 2023."
  },
  {
    "headline": "For For killing wife, daughter, court sentences Danish man to death",
    "summarized_story": "A Lagos High Court on Friday sentenced a Dane, Peter Nielsen, to death by hanging for killing his Nigerian wife and daughter.\nNielsen, who had pleaded not guilty on two counts of murder brought against him by Lagos State Government, lost his case and is to hang by the neck until pronounced dead by a doctor, Okikiolu-Ighile, said.\nThe Dane, who was charged with the death of his wife and singer, Zainab, and their three-year-old daughter, Petra, was accused of smothering Zainab and Petra to death at 3.45a.m.\n4, Flat 17, Bella Vista Tower, Banana Island, Ikoyi, Lagos State.\nNielsen who was arraigned on June 13, 2018, pleaded not guilty to the two-count charge of murder contrary to Section 223 of the Criminal Law of Lagos State, 2015."
  },
  {
    "headline": "Breaking: Nasarawa council boss kidnapped, orderly shot dead (PICTURES)",
    "summarized_story": "Muhammad Baba Shehu, was on Friday night kidnapped along Keffi- Gudi-Akwanga road in Nasarawa state.\nConfirming the incident, Police Public Relations Office Nasarawa state command ASP Ramhan Nansel said the incident happened around 7:30pm on Friday.\nWe have his pistol in the car but both the chairman and his driver were whisked away by the gunmen,” he said.\nASP Ramhan said investigation has been intensified, and that the body of the deceased police officer has been recovered.\n“No information yet about the whereabout of the kidnapped chairman and his driver."
  },
  {
    "headline": "CIBN appoints Fidelity Bank’s Ken Opara as 22nd President",
    "summarized_story": "Fidelity Bank Plc Executive Director, South West and Lagos, Dr Ken Onyewuchi Opara will tomorrow take over the mantle of leadership of the Chartered Institute of Bankers of Nigeria, CIBN.\nDr Opara, who was elected a month ago, will be sworn in as the 22nd President and Chairman in Council of the highly revered Institute.\nA graduate of Finance from the University Of Nigeria, Dr opara has had a distinguished career in banking spanning over 30years.\nHis Bank, Fidelity Bank Plc is one of the leading financial institutions leveraging in this area .\nDr Ken Opara is married with four Children."
  },
  {
    "headline": "Border Demarcation, A Big Challenge In The Curbing Of Petrol Smuggling – Customs",
    "summarized_story": "Deputy Comptroller of Customs, Timi Bomodi, who made known the challenges of Customs in tackling petrol smuggling in the border communities, said the service has been devising strategies to reduce smuggling along Nigeria’sporous borders.\nHe disclosed that the customs service is applying the rules in ensuring that bad eggs within and outside the service are dealt with appropriately.\nHe added that strategies and technology are already reducing petrol smuggling across Nigeria’s borders.\n“Nigeria Customs Service is gradually tilting towards minimizing physical contact in all its activities.\nReacting to the investigation, the Executive Director, Center for Transparency Advocacy, Faith Nwadishi, noted that impunity is the primary reason petrol smuggling is still thriving across Nigeria’s borders."
  },
  {
    "headline": "Gbemi Saraki Takes Charge As Amaechi Bows Out As Transport Minister",
    "summarized_story": "By Naomi DouglasMinister of State for Transport, Senator Gbemi Saraki, has now taken full charge of the Ministry of Transport, follwoing the formal resignation of Frontline presidential aspirant on the platform of All Progressives Congress APC, Chibuike Rotimi Amaechi, yesterday.\nIn a statement issued by Amaechi Presidential Media Committee, APMC, in Abuja yesterday, Amaechi in his resignation letter, expressed profound gratitude to the President for considering him fit to serve in his administration.\nUnder your administration, the Ministry of Transportation has recorded significant achievements, made possible by your visionary support and commitment to ensuring that we deliver on our mandate.\nUnder your administration, the Ministry of Transportation has recorded significant achievements, made possible by your visionary support and commitment to ensuring that we deliver on our mandate.\n“Your Excellency, whilst humbly seeking your kind consideration of my request please accept the assurances of my highest esteem.”"
  },
  {
    "headline": "Delta-2 Progrmme: Nigeria , Czech Republic Flags off $16.2 million Bilateral Co-funding",
    "summarized_story": "By Eunice OrikeAs part of economic diversification priority of the present administration, the Federal Government and Czech Republic has launched a Call for Public Proposals on Delta-2 Programme worth $16.2 million Co-funding Research and Development R&D,project.\nThe Delta-2 Programme is the cooperation model of the Technology Agency of Czech Republic TA CR, running for the period from 2020-2025, through which TA CR sponsors applied research and innovation of manufacturing companies and innovative institutions.\nProf. Mohammed Sani Haruna said the Call for Public Proposal for the Delta-2 programme is one of the projects to be implemented under the Agreement between the two countries.\n“The PICTT would be sourcing technologies from the Czech Republic’s manufacturing companies; tertiary; research; and development institutions.\nThe Delta-2 Programme is uniquely designed to catalyze technology transfer and mobilize positive interventions and investments among private sectors and relevant stakeholders in Nigeria and Czech Republic for technology advancement."
  },
  {
    "headline": "Naira in free fall, now N600 to $1",
    "summarized_story": "By Our CorrespondentThe free fall of our national currency the Naira against major currencies continued yesterday as it weakened against the United States of America dollar to trade at N600 at the parallel market.\nThis non-stop depreciation of the Naira, which incidentally has been officially devalued thrice under this administration, is a pointer that the fiscal policies are not responding to market trends.\nAbubakar, a BDC operator in Ikorodu, told an online medium that buying and selling prices stood at N595 and N600 per dollar.\nA parallel market (street/black market) is characterised by noncompliant behaviour with an institutional set of rules.\nThe Central Bank of Nigeria (CBN) has often maintained that the parallel market is not the true reflection of the naira."
  },
  {
    "headline": "Irate Youths Set Houses, Shops Ablaze Over Alleged Blasphemy In Bauchi LG",
    "summarized_story": "Irate youths in Warji Local Government Area of Bauchi State have set houses and shops ablaze, injuring people over what they say is a blasphemous message.\nSpokesperson of the Bauchi Police Command, SP Ahmed Mohammed Wakil, said in a statement on Saturday that the youths “set six houses and seven shops ablaze, while some scores of persons were injured as a result of a blasphemous message posted on social media”.\nAccording to him, the message was posted by one Rhoda Jatau a 40-year-old staff of the Medical Department of Warji Local Government.\n“The Command would like to use this medium to reiterate the need for parents and guardians to maintain strict vigilance over the activities of their wards, particularly youths,” Mohammed said.\nA source in Warji said three people were shot and injured with Dane guns during the violence."
  },
  {
    "headline": "Buhari Pays Condolence Visit To New UAE President, Seeks Stronger Ties",
    "summarized_story": "President Muhammadu Buhari has paid a condolence visit to the new President of the United Arab Emirates and Ruler of Abu Dhabi, Sheikh Mohamed bin Zayed Al Nahyan, on the passing of his predecessor, Sheikh Khalifa bin Zayed Al Nahyan.\nDuring the visit, President Buhari expressed his condolences and that of Nigeria to Sheikh Mohamed and congratulated him on his election as President.\nPresident Buhari also hopes that under Sheikh Mohamed the two countries will continue to actively champion a vision of sustainable security, strengthen counterterrorism cooperation, facilitate trade and investment, and promote prosperity and development.\nPresident Buhari had left Nigeria for the UAE on Thursday, six days after the death of Sheikh Khalifa.\nSheikh Khalifa, who was rarely seen in public died on Friday, May 13 aged 73 after battling illness for several years."
  },
  {
    "headline": "Russia Stops Gas Supplies To Finland Amid NATO Membership Bid",
    "summarized_story": "Russia on Saturday stopped providing natural gas to neighbouring Finland, which has angered Moscow by applying for NATO membership after the Nordic country refused to pay supplier Gazprom in rubles.\nGazprom said it had supplied 1.49 billion cubic metres of natural gas to Finland in 2021, equal to about two-thirds of the country’s gas consumption.\nHowever, natural gas accounts for around eight per cent of Finland’s energy.\n“Natural gas supplies to Finland under Gasum’s supply contract have been cut off,” the company said in a statement.\nMoscow has warned Finland that any NATO membership application would be “a grave mistake with far-reaching consequences”."
  },
  {
    "headline": "EFCC Releases Former Speaker Patricia Etteh",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has released the Former Speaker of the House of Representatives, Mrs Patricia Etteh, who it arrested over an allegation of fraud.\nREAD ALSO: EFCC Arrests Ex-NDDC MD Nsima Ekere Over Alleged N47bn Fraud“She is to report periodically to assist further investigations,” the EFCC added.\nThe former Speaker was arrested and detained by the Commission on Tuesday “on suspicious and shady financial involvement with Phil Jin Projects Limited”.\nShe was elected Speaker in 2007 but resigned only after a few months amid allegations of financial misappropriation.\nShe is the only woman in the country’s history to have been elected Speaker."
  },
  {
    "headline": "It Is Unfair To Say Buhari Ignores Victims Of Attacks In Nigeria – Presidency",
    "summarized_story": "Presidential aide Garba Shehu has refuted claims that his principal pays less attention to victims of attacks in the country.\nI have accompanied the president to Sokoto on a condolence visit after a major incident,” the aide said on Channels Television’s Politics Today.\n“However, it is unfair also to make the conclusion wrongly that he had not paid attention or had not visited.\n“So, did the President go to all the places where there have been incidents of violence or killings?\nYou just mentioned the railway incident in Kaduna, and this last week, the incident in Kano of an explosion."
  },
  {
    "headline": "Gunmen abduct Keffi Council Chairman, kill Orderly in Nasarawa -",
    "summarized_story": "Gunmen have abducted the chairman of Keffi Local Government of Nasarawa State, Muhammed Shehu and his aide Tanimu Mohammed.\nThe police orderly attached to the chairman, Alhassan Habeeb was also killed by the gunmen.\nTVC News gathered that the incident happened along the Akwanga-Keffi-Abuja highway on Friday night.\nMeanwhile, the state Commissioner of Police, Adesina Soyemi has confirmed the incident and assured that his men are on top of the situation."
  },
  {
    "headline": "Osinbajo solicits supports of APC delegates in Osun",
    "summarized_story": "Vice president Professor Yemi Osinbajo has solicited support of delegates from Osun to win the forthcoming presidential primary of the All Progressives Congress.\nProfessor Yemi Osinbajo who was addressing Osun delegates ahead of the primary election on the 29th and the 30th of May promised to restructure the security architecture of the country if elected.\nThe Vice President says he possessed enough experience to hit the ground running and turn things around in all sectors of the economy.\nSpeaking on the number of presidential aspirants under APC from the South, Professor Yemi Osinbajo said consensus option can still be explored.\nProfessor Yemi Osinbajo had on arrival paid a courtesy call on the Ataoja of Osogbo, Oba Jimoh Olaonipekun for Royal blessings."
  },
  {
    "headline": "Buhari appoints Semiu Adeniran as Statistician-General of Federation -",
    "summarized_story": "President Muhammadu Buhari, has approved the appointment of Mr Semiu Adeyemi Adeniran as the substantive Statistician-General of the Federation and Chief Executive Officer of the National Bureau of Statistics (NBS), with immediate effect.\nThis appointment follows the demise of the former Statistician-General of the Federation, Dr Simon Harry, on 13th April, 2022.\nMr Semiu Adeniran is a professional statistician of repute with bias for Demography and Social Statistics.\nHe has over three decades of statistical hands-on experience garnered from various local and international institutions.\nUntil his appointment, Mr Semiu was the Director of Demographic and Household Statistics at the National Bureau of Statistics (NBS)."
  },
  {
    "headline": "Tinubu assures Nasarawa delegates of quality leadership",
    "summarized_story": "The National Leader of All Progressives Congress (APC), Bola Ahmed Tinubu has met with delegates of the party in Nasarawa State ahead of the forthcoming presidential primaries.\nThe National Leader assured the delegates of offering quality leadership when elected.\nFor him, is track records speak volume of his capacity to deliver on his promises."
  },
  {
    "headline": "20-Year Lifespan Solar Energy Makes Entry into Nigeria",
    "summarized_story": "Infrastructural challenges facing rural communities in Nigeria should ease, as solar energy system with a 20-year lifespan arrives in the country.\nAccording to the Managing Director, E-Cube, Ilan Lugassy, the solar energy is to provide an alternative solution to an expensive billion naira electricity grid projects which might not be feasible in the next two decades as the case may be.\nRelatedStories No Content AvailableThe solar energy named E-Cube is an Isreali concept which provides young Nigerians opportunities to learn and come up with smart ideas which can be transformed into actual products.\nIt means that if the E-Cube solar energy is sitting within a small clinic in whatever village, the people can enjoy treatment from a doctor sitting in Abuja, Katsina.\nWe want to contribute to the community.”The commissioning of the E-Cube Smart Village in Abuja was done during the week in line with the Sustainable Development Goals, SDGs 2030."
  },
  {
    "headline": "Nigeria Party Primaries: Power Returns to Governors as Only Elected Delegates Will Pick Presidential Candidates",
    "summarized_story": "With the president hesitant to sign the amendment, it means only National delegates elected at the local government congresses will determine Presidential flagbearers of the party.\nLikewise, only the five delegates elected from each ward for the state congresses will vote to elect governors, senators, House of Representatives and states’ House of Assembly members for the APC.\nFor PDP, it will be the three delegates elected from each ward.\nAs things stand, the APC will elect its presidential flagbearer with 2322 democratically elected delegates, based on three National delegates per local government area.\nPower to determine those that will emerge as candidates for various elective positions has now returned to the state governors; already, they determined those on the list of elected delegates sent to INEC."
  },
  {
    "headline": "Atiku Should Abandon His Presidential Ambition Says Donald Duke- Trending With Ojy Okpe",
    "summarized_story": "Former Governor of Cross River State, Donald Duke was trending on Thursday after a video surfaced onlinewhere he appeared to be advising Nigeria’s former Vice President and a presidential aspirant on the platform of the Peoples Democratic Party Atiku Abubakar to abandon his presidential ambition.\nIn another development, Governor of plateau state Simon Lalong, on Thursday, signed the violence against persons prohibition bill into law.\nFinally, a viral video of a female police officer begging for help after a driver who she had apprehended for allegedly committing a traffic offense drove-off with her in his car has caught the attention of the Lagos state police command."
  },
  {
    "headline": "NPA Moves to Tighten Fresh Concession Agreements",
    "summarized_story": "The Nigerian Ports Authority (NPA), has averred that it would tighten its noose against terminal operators operating at the nation’s seaports in order to make them take major responsibilities in port infrastructure development and rehabilitation.\nMohammed Bello-Koko, Managing Director, NPA, made the disclosure in Lagos at the weekend.\nThis was as he announced the expiration of concession agreements between the federal government and five terminal operators operating at the nation’s seaports.\nHe said the Federal Government would secure commitment from terminal operators whose lease agreement have expired and others on the rehabilitation of the dilapidated and decayed port infrastructure.\nHe said that the authority had started working on the rehabilitation of port infrastructure with the right marine equipment in place."
  },
  {
    "headline": "‘It Is Hell There’: Ukraine’s Zelensky Says Russia Has Completely Destroyed Donbas Region",
    "summarized_story": "Russian forces have bombarded areas of Ukraine’s eastern Donbas from land and air, killing at least 13 civilians, Ukraine’s military said on Friday, and President Volodymyr Zelenskiy said the assaults had turned the region into “hell”.\nAs the war neared the three-month mark, the Russians were intensifying their efforts to subdue the Donbas region, the Ukrainian general staff said.\nRussian shelling in the Luhansk area of Donbas killed 13 civilians over the past 24 hours, regional governor Serhiy Gaidai said.\n“The Donbas is completely destroyed,” President Zelenskiy said in an address on Thursday night.\n“It is hell there – and that is not an exaggeration.”There were also constant strikes on the Odesa region in the south, he said."
  }
]