[
  {
    "headline": "Ethiopia condemns US sanctions on Eritrea",
    "summarized_story": "Ethiopia on Saturday denounced new US sanctions on neighbouring Eritrea over Asmara’s role in the deadly conflict pitting Ethiopian forces against Tigrayan rebels, calling on Washington to “rescind its decision”.\nEritrean and Ethiopian forces have been accused of carrying out mass rapes and massacres in Tigray and Washington has repeatedly urged Asmara to withdraw its troops.\nOn Saturday Eritrea said the sanctions reflected a “misguided and hostile policy” by the US, and were based on false allegations.\nUS Secretary of State Antony Blinken has also threatened to impose sanctions against Abiy’s government and the rebels unless they move forward on talks, warning that Ethiopia risks “implosion” if fighting continues.\nBut Cameron Hudson, a former US official now at the Atlantic Council, said the sanctions had missed the mark."
  },
  {
    "headline": "Strategic leadership helped Nigeria tackle COVID-19 pandemic -Osinbajo",
    "summarized_story": "The Vice President, Yemi Osinbajo has said that Nigeria’s ability to effectively tackle the COVID-19 pandemic was as a result of strategic and responsive leadership.\nHe said that while many advanced economies were struggling to deal with the fallouts of the global pandemic, the federal government effectively contained the pandemic by deploying a responsive and effective public health framework.\nThe statement which was issued by the Senior Special Assistant to the President on Media and Publicity, Laolu Akande was titled, ‘Strategic leadership helped Nigeria tackle COVID-19 pandemic – Osinbajo says at retired General’s book presentation.\nButtressing his point on strategic leadership, Osinbajo said such kind of leadership requires imagination, clarity of vision and effective implementation, because of current global challenges, changes and opportunities.\nThe Vice President further noted that “as a nation, the threats to our corporate existence today are unprecedented and hitherto unimagined."
  },
  {
    "headline": "Edo political class under the sword of damocles",
    "summarized_story": "Edo State has just now been entrapped in such a hellish cobweb.\nIn any case, why should stakeholders in Edo State allow Obaseki to destroy those who make Edo count and relevant in national politics?\nEvidence abound that the toxic sword of Damocles is menacingly hanging over the political class in Edo State.\nHe menacingly dangles a double edged sword and the political class in Edo State live under the technocratic sword of Damocles, hanging by the slenderest thread over their heads and capable of being cut at any moment.\nToday, the political class are clearly endangered and embattled in Edo State."
  },
  {
    "headline": "NMA congratulates Soludo, urges him to make Anambra medical tourism haven",
    "summarized_story": "The Nigerian Medical Association (NMA) has congratulated Prof. Chukwuma Soludo and Dr Onyekachukwu Ibezim on their victory and issuance of Certificate of Return as governor- and deputy governor-elect of the state.\nThe NMA, in a congratulatory message signed by Dr Jide Onyekwelu and Dr Dubem Awachie, Chairman and Secretary of the Anambra State Branch of the association, commended the electorate and Anambra people for a peaceful poll.\n“Warm greetings from the Leadership and members of NMA, Anambra State.\nWe heartily wish to felicitate with your distinguished self, your running-mate and our Hippocratic brother, Dr. Ibezim, the deputy governor-elect.\nWillie Obiano and all good people of Anambra on your massive victory at the election."
  },
  {
    "headline": "COVID-19 should not overshadow other health challenges – ECOWAS president",
    "summarized_story": "The President of the Economic Community of West African States (ECOWAS) Commission, Jean-Claude Kassi Brou, has said COVID-19 pandemic should not overshadow all the other public health challenges facing the region.\nBrou said this on Friday in Abuja, during the 22 Ordinary Session of Assembly of Health Ministers of ECOWAS.\n”However, we must redouble our efforts to improving other health indicators in the region, particularly, maternal and child health, fight against communicable, non-communicable, neglected tropical diseases and universal health coverage to mention but a few,” he said.\nBrou said that the Public health challenges in the region are colossal and the expectations of the populations are very high.\nThe ECOWAS President added that the regional integration in health is at the crux of WAHO’s mandate and was part of the essence of the Founding Fathers’ vision."
  },
  {
    "headline": "Buhari leaves Paris for Intra African Trade Fair in S/Africa –media aide",
    "summarized_story": "President Muhammadu Buhari will, on Saturday, leave Paris for Durban, South Africa, at the special invitation of President Cyril Ramaphosa, to the inauguration of the second Intra-African Trade Fair (IATF) 2021.\nThe event, billed for Nov. 15 to Nov. 21, was convened by the African Export-Import Bank (AFREXIM), in collaboration with the African Union Commission (AUC) and the African Continental Free Trade Area (AfCFTA) Secretariat.\n”The event is also expected to generate market information, needed to connect buyers and sellers throughout the continent.\n”Global businesses, including non-African international brands, are expected to key into opportunities generated by the fair, thereby attracting to continental trade investment deals worth $40billion dollars,” he added.\nPresident Buhari is expected back in Nigeria on Nov. 16, Adesina said."
  },
  {
    "headline": "2 die, 15 injured in Lagos-Ibadan Expressway accident",
    "summarized_story": "Two persons died while 15 others sustained injuries on Saturday when a speeding DAF truck overturned at a diversion point on the Lagos-Ibadan Expressway.\nThe vehicle travelling towards Lagos was loaded with bags of onions and passengers when the incident occurred.\nThe accident which occurred around 6.30 a.m. led to a gridlock as the truck emptied the onions and passengers on the road.\n“According to eyewitness account the vehicle was approaching the diversion when the driver lost control, probably as a result of over speeding.\n“Two of the passengers died on the spot while 15 others were injured,’’ he said."
  },
  {
    "headline": "Railway workers give Nigerian government notice of nationwide strike",
    "summarized_story": "Leaders of the National Union of Railway Workers NUR and its Senior Staff Association, SSA, Railway Branch, have directed workers of the Nigeria Railway Corporation, NRC, to embark on a 3-day nationwide strike effective from Thursday, 18th November 2021, over poor welfare.\nThe National leaders of the two unions directed them to summon a meeting of workers in their districts on Monday, November 15, at 10 am and inform the workers of the impending strike.\nThe statement said all the workers must comply and stay out of their offices but gather together behind their district union leaders to participate actively, peacefully, and consistently in the whole days of the strike without any fear or let.\nThe statement warned every district must comply with the notice as any act prejudicial to the notice would be viewed very seriously and strictly by the leadership of the unions.\nOsogbo: Railway begins work on flood-affected rail track"
  },
  {
    "headline": "Ohanaeze Ndigbo hails FG over alleged plans to dialogue with agitators",
    "summarized_story": "Ohanaeze Ndigbo has hailed the federal government for contemplating a political solution for the release of the leader of the Indigenous People of Biafra (IPOB), Mazi Nnamdi Kanu and the Yoruba successionist activist, Sunday Igboho.\nRecall that the Nigerian government had indicated that it is open to all kinds of solutions, including a political solution to resolve the crisis surrounding separatist agitations in the southeast and southwest parts of the country.\n“It is very appropriate that dialogue and other forms of conflict resolution mechanisms are spontaneously activated to address such issues as they arise.\nTherefore, it is hoped that political solution to the current security challenges will be a long way in sustaining the corporate existence of Nigeria”.\nOhanaeze commended Malami for the anticipated courage, insight and deep reflection and maintained that the ability to resolve the current security challenges in the country will place President Buhari on the right side of history."
  },
  {
    "headline": "Osun COVID-19 Isolation Centre shows signs of neglect, deterioration",
    "summarized_story": "The roof of the COVID-19 Isolation Centre built within the premises of the State Hospital, Asubiaro, Osogbo has been blown off.\nA recent visit by DAILY POST found the COVID-19 Isolation Centre deteriorated with some parts of the ceilings and windows of the one-year-old structure detached.\nMeanwhile, in a separate interview, Dr Rafiu Isamotu, the Commissioner for Health said it was the responsibility of the state government to repair anything that gets damaged at the Isolation Centre.\nIsamotu also added that necessary steps have been taken and measures put in place to fix the damaged parts of the centre.\nThe Isolation centre was built in early 2020 to curtail the spread of the ravaging Coronavirus pandemic."
  },
  {
    "headline": "Nigeria will fulfil climate commitments – Osinbajo insists",
    "summarized_story": "Vice President, Yemi Osinbajo says Nigeria will keep its climate commitments.\nThe VP, also on Friday, interacted with officials of the International Monetary Fund on the IMF Article IV bilateral consultations.\nAt both meetings, Osinbajo stated that Nigeria remains committed to helping to reduce global greenhouse emissions.\nThe agreement comprises a $100 billion per year pledge by wealthier economies to help developing economies respond to climate challenges.\nThe Global Climate and Health Alliance, a coalition of health professionals, has urged governments to fulfil obligations to 1.5C limit for global heating."
  },
  {
    "headline": "University don advises journalists to adhere to ethics",
    "summarized_story": "A university Don, Dr Isa Saidu at the Ahmadu Bello University, Zaria, has enjoined journalists to adhere strictly to the ethics of the profession and take precautionary measures to strike a balance between the profession and survival.\nSpeaking on a paper titled, “Insecurity and journalism in Nigeria: addressing the dilemma of roving journalists”, Saidu explained that journalists are much interested in crises as they strive to respond to the calling of their profession.\nThe University don noted that the noble profession of journalism is sometimes a risky adventure, pointing out that the dangers journalists face are not limited to conflict zones.\nThe chairman of the occasion, Abdurrahman Nuhu Bayero, Dan Iyan Zazzau, advocated for a better pay package for journalists across the country.\nHe said journalists must also learn to be accurate, balanced and fair in their reportage to justify the trust reposed on them by their teaming audience."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "FG moves to regulate sodium in packaged foods",
    "summarized_story": "Minister of Health, Dr. Osagie Ehanire, has disclosed the Federal Government’s plans to regulate sodium consumption by Nigerians through packaged foods.\nIt would also reduce modifiable risk factors for the prioritised Non-Communicable Diseases (NCDs) within health in all policies approach.\n- Advertisement -“The Non-Communicable Diseases (NCDs) Multi-sectoral Action Plan which is an alignment with WHO global NCDs action plan as well as the WHO ‘SHAKE’ technical package for salt reduction.\nAlso, especially in schools, we have to teach the young people in their curricula, health education and so on, that too much salt intake is dangerous.\nIn the report titled “Evaluating implementation and scale-up of Nigeria’s national sodium reduction program” released at the meeting, Prof Mark Huffman of the Northwestern University said the survey showed that Nigerian foods exceed WHO benchmarks across “saltiest” categories."
  },
  {
    "headline": "Buhari leaves Paris for Intra African Trade Fair in S/Africa –media aide",
    "summarized_story": "President Muhammadu Buhari will, on Saturday, leave Paris for Durban, South Africa, at the special invitation of President Cyril Ramaphosa, to the inauguration of the second Intra-African Trade Fair (IATF) 2021.\nThe event, billed for Nov. 15 to Nov. 21, was convened by the African Export-Import Bank (AFREXIM), in collaboration with the African Union Commission (AUC) and the African Continental Free Trade Area (AfCFTA) Secretariat.\n- Advertisement -READ ALSO:”The event is also expected to generate market information, needed to connect buyers and sellers throughout the continent.\n”Global businesses, including non-African international brands, are expected to key into opportunities generated by the fair, thereby attracting to continental trade investment deals worth $40billion dollars,” he added.\nPresident Buhari is expected back in Nigeria on Nov. 16, Adesina said."
  },
  {
    "headline": "Plateau: Court affirms Laven as Langtang North chairman",
    "summarized_story": "A Jos High Court in Plateau State has affirmed Joshua Ubandoma Laven of the Peoples Democratic Party (PDP) as the authentic Chairman of Langtang North Local Government Area (LGA).\nJustice Ishaku Kunda dismissed an appeal filed by his challenger, Zulfa Bitrus Rimven of the All Progressives Congress (APC) on the ground that the suit was without merit.\nRimven, a lawyer, had approached the court seeking an interpretation of the November 2, 2021 judgment entered in Laven’s favour.\nBut the judge held that a separate election conducted by the Plateau State Independent Electoral Commission (PLASIEC) for the Langtang North LGA council chair post, which Rimven won, was unnecessary, because, among others, the seat was never vacant.\nHe ordered Rimven to vacate the office with immediate effect for Laven."
  },
  {
    "headline": "Fresh call for restructuring: Northern elders carpet Afenifere leader",
    "summarized_story": "By Vincent Kalu, Lagos, Noah Ebije, Kaduna and Sola Ojo, KadunaSome Northern leaders have criticized Chief Ayo Adebanjo, leader of Afenifere, over his recent press statement calling for the restructuring of the country.\n“Chief Ayo Adebanjo has the right to air his views on issues of national importance and use multiparty democracy to pursue his passion,” he said.\nEven in the South-West, Afenifere cannot be said to be speaking for all and this is the reality of things.\n“Ayo Adebanjo is a confused, bitter, frustrated, rambling and irrelevant old man at 93,” he said.\nHe said: “The electoral bill which has been passed by the National Assembly and waiting for president’s ascent is part of restructuring."
  },
  {
    "headline": "Police parade alleged killer of Vanguard journalist",
    "summarized_story": "From Molly Kilete, AbujaThe Nigeria Police in Abuja on Friday paraded an alleged hit-and-run driver, Itoro Clement, said to have been responsible for the death of the missing Vanguard journalist, Tordue, Salem.\nLate Salem, an indigene of Benue State, who was covering the House of Representatives, went missing on October 13, 2021.\nHowever late Thursday night, Vanguad newspapers where the deceased worked before his untimely death reported that his body had been found.\nConfirming the incident, Frank Mba, at a media briefing in Abuja, paraded the suspected killer driver, Itoro Clement, 29, before journalists.\nAt the briefing, Mba, told journalists that Clement was arrested following an investigation carried out by the Force Intelligence Bureau."
  },
  {
    "headline": "Pupils, students jubilate as Kalu distributes free educational materials in Abia North",
    "summarized_story": "From Okey Sampson, UmuahiaIt was jubilation galore by pupils, students and teachers of some schools in Umunneochi Local Government Area of Abia State, following the distribution of free educational materials by the senator representing Abia North, Dr. Orji Uzor Kalu.\nThe recipients and their parents could not hold back their joy over Kalu’s gesture as the event was flagged off at Lokpanta Secondary School, Umuchieze.\nFrom there, the team went to Eziama Model Secondary School, Lokpaukwu; Obinolu Secondary Technical School, Ngodo, and Isuochi Secondary School at Nkwoagu.\nThe pupils, students and their teachers thanked the senator for remembering them and for his quality representation.\nEducational materials distributed to the pupils and students include textbooks, writing materials, schoolbags and exercise books."
  },
  {
    "headline": "Stardom has deprived me of true love –Eva Chris",
    "summarized_story": "Endowed with impressive curves, single but talented actress, Eva Chris is out looking for true love.\nHear her: “Stardom has deprived me of true love.\n“I can’t put my relationship on social media because most girls are always bent on snatching people’s boyfriends.\nI also don’t like people advising me on how to handle my relationship, so I keep my private life off social media.\nEven if I get married today, people will not know because of the way marriages crash on social media is very worrisome."
  },
  {
    "headline": "Shocking: 17-year-old boy fakes own ‘kidnap’, demands N6m ransom from mum",
    "summarized_story": "Obinna hid inside a hotel for three days even as he allegedly conspired with his gang member, Chinaza Ugorji.\nThe Anti-Kidnapping operatives swung into action and arrested Chinaza Favour Ukaigwe whose bank account Mrs Rose Nwatu paid the ransom of N200, 000 into.\nMy brother, Obinna Nwatu went to buy recharge card that evening when the incident occurred.\nObinna is the black sheep in the family.”The suspect, Obinna Nwatu, also explained how the incident happened to Saturday Sun.\nI left the hotel after spending three days, and immediately, Chinaza Ugorji went and withdrew the N200, 000."
  },
  {
    "headline": "Stripped of Influence, Govs Fight Back over Direct Primaries, Consider Court Action",
    "summarized_story": "But the lawmakers refused to back down; they went ahead to add mandatory direct primaries to the bill.\nMaking direct primaries mandatory is unconstitutional.\nHe further argued that direct primaries were too cumbersome, unwieldy and would overstretch the limited resources of INEC, statutorily mandated to oversee primaries conducted by political parties.\nHe said: “Direct primaries involve supervisory role by INEC.\nSo, if multiple political parties are doing their primaries, INEC resources will be overstretched, and I think the chairman of INEC had even commented on that.”The PDP leadership is also opposed to mandatory direct primaries."
  },
  {
    "headline": "U.S. Secretary of State, Blinken, Expected in Nigeria",
    "summarized_story": "Michael OlugbodeThe United States Secretary of State, Antony Blinken will arrive Nigeria next week on the second leg of his first official visit to Africa.\nAccording to a statement issued yesterday by the US Embassy, Abuja, titled, “Secretary Blinken’s travel to Kenya, Nigeria, and Senegal,” the top Joe Biden administration official will meet with Kenyan President, Uhuru Kenyatta and Cabinet Secretary for Foreign Affairs, Amb Raychelle Omamo.\n“The Secretary will advance US-Kenyan cooperation on ending COVID-19, improving clean energy access, and protecting the environment.\n“They are expected to discuss furthering cooperation on global health, security, expanding energy access and economic growth, and revitalising democracy,” said the US embassy.\n“Given President Sall’s upcoming African Union chairmanship, Secretary Blinken looks forward to discussing regional issues and shared values."
  },
  {
    "headline": "At UNESCO’s 75th Anniversary, Buhari Canvasses for Global Peace, Solidarity",
    "summarized_story": "*Says Nigerians competitive abroad due to good education acquired at homeDeji Elumoye in Paris, FrancePresident Muhammadu Buhari yesterday said despite mounting challenges facing nations, it was high time peace and solidarity “reign supreme” across the globe.\nHe said: “Our world is fast changing and so are the evolving challenges.\nThere is, therefore, no better time to canvass for solidarity for the enthronement of peace and development.\nBuhari said: “Seventy-five years of building together a more advanced, knowledgeable and prosperous world through education, science, culture, communication and information.\nThe President said this when he met with the Minister of State Foreign Affairs of the United Arab Emirates, Shaikh Shakboot Alnahyan, on the sidelines of the Paris Peace Forum."
  },
  {
    "headline": "Dogara: Nigerians Have Accepted Mass Killings as New Normal",
    "summarized_story": "*Declares country risks survival if people merely tolerate each otherCharles AjunwaA former Speaker of the House of Representatives, Yakubu Dogara has said Nigerians seem to have accepted mass killings in the country as the new normal.\nWe seem to have accepted killings and mass murder as our new normal and so many cold-blooded murders of our brothers and sisters no longer make the headlines in the media.\nThe latest MlCS data tells us that 69 per cent (9.1m) of out-of-school children in Nigeria are in northern states.\nWe now have a small percentage of highly educated Nigerian youths who are prepared to question everything including questioning the questions themselves.\n“It is a pity that many are calling for the disintegration of Nigeria; saying that Nigeria cannot work."
  },
  {
    "headline": "FG Set to Commence Sale of 5,000 Housing Units in 34 States",
    "summarized_story": "•Launches online application portal, promises fairnessEmmanuel Addeh in AbujaThe federal government yesterday officially launched an online platform for its National Housing Scheme (NHS), effectively preparing the ground for the sale of over 5,000 housing units in 34 states of the federation.\n“So first, what we did was to carry out a survey to know what kind of houses Nigerians want to live in and that helped us to formulate relevant policies for the project.\nHe added: “The least selling price for each of these houses will be N7.222 million, and the highest will be N16.19 million.\n“We introduced the online portal from which the national housing programme will be offered to members of the public.\nWhen an allocation is booked on the online portal, it will show that it is no longer available."
  },
  {
    "headline": "EXPOSED: How Nigerian Officials Diverted $100,000 Meant For Women Basketball Team, D'Tigress, Owe Each Player $4,900 Allowances",
    "summarized_story": "Speaking with SaharaReporters, a member of the senior women basketball team, D’Tigress, revealed that their allowances, bonuses, training grant worth $4,900 had also not been paid.\nShe added that none of the D’Tigress team members would show up in camp in preparation for the February 2022 FIBA World Cup if the Nigerian government failed to pay them.\nDonations made by banks for players, officials, volunteer stipends etc.\n“They forget we all have a relationship and do communicate; $500 each 2018 FIBA World Cup for players and officials; $1,000 each for finishing final 8 in FIBA World Cup; $1,000 each bonus for winning AfroBasket in Senegal for 2019 players and officials.\nThe $100,000 donated by three Nigerian banks to all the players and officials that made D’Tigress Olympics qualification possible final roster."
  },
  {
    "headline": "EXPOSED: How Nigerian Officials Diverted $100,000 Meant For Women Basketball Team, D'Tigress, Owe Each Player $4,900 Allowances",
    "summarized_story": "Speaking with SaharaReporters, a member of the senior women basketball team, D’Tigress, revealed that their allowances, bonuses, training grant worth $4,900 had also not been paid.\nShe added that none of the D’Tigress team members would show up in camp in preparation for the February 2022 FIBA World Cup if the Nigerian government failed to pay them.\nDonations made by banks for players, officials, volunteer stipends etc.\n“They forget we all have a relationship and do communicate; $500 each 2018 FIBA World Cup for players and officials; $1,000 each for finishing final 8 in FIBA World Cup; $1,000 each bonus for winning AfroBasket in Senegal for 2019 players and officials.\nThe $100,000 donated by three Nigerian banks to all the players and officials that made D’Tigress Olympics qualification possible final roster."
  },
  {
    "headline": "BREAKING: PUMA To Sue Nigeria Over Breach Of Contract After Terminating Over N1Billion Deal With Country",
    "summarized_story": "German sportswear manufacturing giant, PUMA plans to sue the Athletics Federation of Nigeria (AFN) and the Federal Ministry of Youth and Sports.\nThe deal, signed by the Gusau-led AFN, was due to expire in 2022, Punch reports.\nIn the latest development, PUMA officials have got in touch with officials of Gusau-led AFN informing them of an intention to sue.\nIn the letter, the DSS stated, “This Service (DSS) has thoroughly investigated the matter regarding the Puma deal.\nThe under-listed findings were established:“Athletics Federation of Nigeria entered into a valid contract with Dynamic Sports Solution Nigeria Limited."
  },
  {
    "headline": "BREAKING: PUMA To Sue Nigeria Over Breach Of Contract After Terminating Over N1Billion Deal With Country",
    "summarized_story": "German sportswear manufacturing giant, PUMA plans to sue the Athletics Federation of Nigeria (AFN) and the Federal Ministry of Youth and Sports.\nThe deal, signed by the Gusau-led AFN, was due to expire in 2022, Punch reports.\nIn the latest development, PUMA officials have got in touch with officials of Gusau-led AFN informing them of an intention to sue.\nIn the letter, the DSS stated, “This Service (DSS) has thoroughly investigated the matter regarding the Puma deal.\nThe under-listed findings were established:“Athletics Federation of Nigeria entered into a valid contract with Dynamic Sports Solution Nigeria Limited."
  },
  {
    "headline": "Ex-Chairman Of Nigerian Basketball Federation Clashes With Secretary-General Over N6million Used In Clearing Olympics Kits",
    "summarized_story": "Recall that the NBBF general election had been slated to hold on the last Saturday of October, before the Federal Ministry of Youths and Sports Development postponed it indefinitely.\nThe ministry would later go on to dissolve the caretaker board of the NBBF, and as it stands, basketball federation in Nigeria has no leadership.\nIn a letter to the Secretary General of the association, Kida requested for a refund of N6million he used to clear kits used for the last Olympics before he could handover sporting equipment with him.\n“You are also aware that this consignment covered for the Olympics and was used with extra procured to execute the 2021 Men’s Afro-basket.\nI would urge you to process my refund efficiently, and once that is done, I can handover the remnants of the kits from the Tokyo Olympics."
  },
  {
    "headline": "Buhari leaves Paris for intra-African trade fair in South Africa",
    "summarized_story": "President Muhammadu Buhari is expected to visit Durban, South Africa, for the opening ceremony of the second intra-African trade fair (IATF) 2021.\nAdvertisementFemi Adesina, the presidential spokesperson, said Buhari will leave Paris on Saturday to join Cyril Ramaphosa, president of South Africa and other African leaders at the event.\nThe event convened by the African Export-Import Bank (AFREXIM) in collaboration with the African Union Commission (AUC) and the African Continental Free Trade Area (AfCFTA) Secretariat will kick off on Monday.\nAdvertisement“The theme of the Fair, Building Bridges for a Successful AfCFTA — aims at boosting trade and investment across the African continent,” the statement reads.\n“Global businesses including non-African international brands are expected to key into opportunities generated by the fair, thereby attracting for the continent trade and investment deals worth $40billion."
  },
  {
    "headline": "Buhari leaves Paris for intra-African trade fair in South Africa",
    "summarized_story": "President Muhammadu Buhari is expected to visit Durban, South Africa, for the opening ceremony of the second intra-African trade fair (IATF) 2021.\nAdvertisementFemi Adesina, the presidential spokesperson, said Buhari will leave Paris on Saturday to join Cyril Ramaphosa, president of South Africa and other African leaders at the event.\nThe event convened by the African Export-Import Bank (AFREXIM) in collaboration with the African Union Commission (AUC) and the African Continental Free Trade Area (AfCFTA) Secretariat will kick off on Monday.\nAdvertisement“The theme of the Fair, Building Bridges for a Successful AfCFTA — aims at boosting trade and investment across the African continent,” the statement reads.\n“Global businesses including non-African international brands are expected to key into opportunities generated by the fair, thereby attracting for the continent trade and investment deals worth $40billion."
  },
  {
    "headline": "Lamidi Adeosun, general on same rank with army chief, retires",
    "summarized_story": "Lamidi Adeosun, a lieutenant-general, has retired from the Nigerian army.\nIn 2019, President Muhammadu Buhari had promoted Adeosun to a lieutenant-general, the same rank as Tukur Buratai, the then chief of army staff.\nIt was the first time in this democratic dispensation that the Nigerian army will have two lieutenant-generals.\nAbout 11 other generals of the infantry corps were also retired alongside Adeosun.\nAdeosun, who spoke on behalf of the retired generals, said the pulling out parade was part of military tradition."
  },
  {
    "headline": "Lamidi Adeosun, general on same rank with army chief, retires",
    "summarized_story": "Lamidi Adeosun, a lieutenant-general, has retired from the Nigerian army.\nIn 2019, President Muhammadu Buhari had promoted Adeosun to a lieutenant-general, the same rank as Tukur Buratai, the then chief of army staff.\nIt was the first time in this democratic dispensation that the Nigerian army will have two lieutenant-generals.\nAbout 11 other generals of the infantry corps were also retired alongside Adeosun.\nAdeosun, who spoke on behalf of the retired generals, said the pulling out parade was part of military tradition."
  },
  {
    "headline": "Daily COVID Tracker: Deaths surge as Nigeria reports 16 fatalities, 129 infections",
    "summarized_story": "AdvertisementUK prime minister asks people to get COVID boostersUK prime minister Boris Johnson has asked the elderly and vulnerable people in the country to urgently get their booster shots to prevent a further spike in COVID-19 cases.\nAdvertisementSome European countries, including Germany, Austria and Croatia have seen a surge in COVID cases.\nThe restrictions announced by prime minister Mark Rutte will last at for about three weeks and include the closure of bars, restaurants and essential shops from 8 pm.\nWe had hoped with the vaccines we wouldn’t have to do this, but we see the same situation all across Europe.”Nigeria records 129 COVID casesNigeria’s single-day COVID cases increased by 143 percent on Friday.\nAdvertisementThe Nigeria Centre for Disease Control (NCDC) says 129 new cases have been reported in 10 states and the federal capital territory (FCT) — from 53 cases reported on Thursday."
  },
  {
    "headline": "Where is Africa’s digital media landscape headed?",
    "summarized_story": "Digital media in Africa is growing fast: traditional media organisations are finding their way to the internet while digital-only media organisations are taking firm root.\nMore Africans are online, they are spending more time on the internet and relying more on digital media more than ever.\nHow can digital media in Africa create a profitable business model?\nWhile it is normal to get excited about the different innovative news products in the continent’s digital media landscape, Abiru explains that more media houses need to produce more information that helps people understand what is going on around them.\nShe believes African journalists can do amazing work, but their budget is way smaller than that of global publications."
  },
  {
    "headline": "Is Flutterwave’s acquisition of Disha a win for the creator economy?",
    "summarized_story": "Credit: Disha (Medium)The product was an instant hit and got considerable adoption among creators and gig workers.\nThe move by the payments giant, which earlier this year became a unicorn, is surprising as both companies operate in different spaces—Flutterwave in payments and Disha in the creator industry.\nDespite the acquisition, however, Disha will remain an independent company.\n“Before now, when users created a Disha page and linked to a Flutterwave payment link, they got taken off the Disha site.\nNow, with the acquisition, users can create and accept their payments, all in one place.”Flutterwave has always played in the creator space, having supported arts events like ArtX Lagos."
  },
  {
    "headline": "Exclusive: Meta’s VP MEA and Turkey on Facebook’s transition into the metaverse",
    "summarized_story": "Leading that work in Africa is Derya Matras, Vice President (VP), Middle East, Africa (MEA) and Turkey, Meta.\nPrior to her appointment as VP in August, Matras was the Managing Director for the MEA and Turkey region.\nIt’s the next evolution in a long line of social technologies, and it’s ushering in a new chapter for our company.\nWhy should Facebook build this?\nBut it’s important to reiterate that Meta is neither going to build, own, or run the metaverse on its own."
  },
  {
    "headline": "MFS Africa raises $100m to continue expanding its digital payments network",
    "summarized_story": "MFS Africa, Africa’s largest digital payments network, has raised a $100 million Series C funding, an investment divided into two commitments: $70 million for equity and $30 million for debt financing.\nThe announcement came a few weeks after the company extended its footprint into the Nigeria market by acquiring Baxi, one of Nigeria’s largest digital solutions and distribution companies, from Capricorn Digital.\nFounded by Dare Okoudjou in 2009, MFS connects more than 320 million mobile money wallets across over 35 African countries.\nThe company plans to use the new investment to hire more global talent, power its Governance, Risks and Compliance (GRC) functions, and ramp up its expansion efforts.\nWe are excited to join MFS Africa’s world-class management team on its mission and to support its growth journey.”Share this article"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Join Techpoint Africa as we virtually host Patrick Brown, Mayor of Brampton, Canada • Techpoint Africa",
    "summarized_story": "Share this article:Join Techpoint as we virtually host the Mayor of Brampton, Canada, Patrick Brown and his team for the Brampton Means Business Now: An Introduction to Brampton’s Innovation District Forum on Monday, November 15th, 2021.\nYou will also hear from four Nigerian tech companies active in the City of Brampton, talking candidly about their experiences and the role of the City in their expansion.\nThe City’s Economic Development Office is looking to engage with the Nigerian Tech community, businesses, start-ups and technology incubators on this mission.\nThis is an opportunity to showcase the best of Nigerian tech start-ups, exposing them to investment opportunities in Canada and possible collaboration and partnership with the Canadian tech start-up ecosystem.\nDate: Monday, November 15th, 2021Time: 4:00PM – 5:15PM WAT (10:00AM – 11:15AM EST)Techpoint Africa Website Techpoint Africa is a digital media company that amplifies the best innovations out of Africa through its media, data, and events."
  },
  {
    "headline": "Nigeria’s Kifta Technologies produces smart glasses, other cutting edge defence tech, for companies and countries worldwide",
    "summarized_story": "He had to acquire some knowledge and skills about UAVs to communicate with design companies effectively, specifically, industrial design companies.\n“We have a couple of software that we use for pipeline security, power cable security, and border security.\n“As much as it’s beautiful to have all of these, adopting them in Nigeria is quite difficult, which is why most of our business and customers are not in Nigeria,” Monsuru says.\nMonsuru believes that the UAS system could significantly impact logistics in Nigeria.\nKifta is hiring for as many as nine positions, and the company is actively looking for people like you."
  },
  {
    "headline": "How UK-based debt financing company, Lendable, is providing equity-free financing for African startups",
    "summarized_story": "So far, few African startups have raised money this way, with fintech startups Carbon, FairMoney, and mobility startup, MAX.ng some examples.\nDuring the week, we had a chat with Hani Ibrahim, the Chief Investment Officer of Lendable, a UK-based debt financing company, to learn how the company invests.\nSoon after, they added an investment arm and have provided over $100 million to startups across Africa, Asia, and the Middle East.\nSource: SuppliedWhen choosing startups to invest in, Lendable focuses on startups providing credit facilities in frontier or emerging markets across Africa, Asia, and Latin America.\nIbrahim reveals that any tech-driven startup providing a financing option fits their investment criteria."
  },
  {
    "headline": "Naira gains in parallel market on rising dollar availability",
    "summarized_story": "Nigeria’s naira rebounded in the illegal market as the central bank boosted sales of dollars through commercial banks, according to traders.\nThe central bank didn’t reply immediately to phone calls and messages seeking comments.\nThe market is just seeing the impact of larger central bank dollar sales on the naira in the parallel market, said Samir Gadio, London-based head of Africa strategy at Standard Chartered Bank.\nAnd last month there had been calls on the central bank to adopt a market reflective exchange rate to improve foreign currency supply and stabilize the naira.\n“If the central bank continues to put framework and structure that will ensure liquidity, definitively we’ll see appreciation at the parallel market.”"
  },
  {
    "headline": "Wike accuses FG of ‘browbeating’ the judiciary ahead of 2023",
    "summarized_story": "Governor Nyesom Wike of Rivers State sees recent developments as pointers that the Federal Government might be cowing the judiciary ahead of 2023.\nWike alleged that the invasion of the residence of Justice of the Supreme Court, Mary Odili, was a precursor to the Federal Government’s likely tactic of browbeating the judiciary to a state of fear and conformity as the country enters the next political season.\nThe governor said the FG wants to continue to ride roughshod unchecked over the rule of law and the sanctity of the country’s electoral system, hence, the renewed attack on judicial officers.\nThe police in Abuja have paraded those they claimed were behind the invasion, but this may not have impressed Wike who had given a 48-hour ultimatum since last week.\nAccording to him, training sessions have been organized for manpower capacity development in mediation practices, infrastructure improved, and the magistracy practice laws and rules revisited for purposes of review."
  },
  {
    "headline": "Ghana mobile money revenue offers clues to MTN Nigeria’s PSB expectation",
    "summarized_story": "The Central Bank of Nigeria recently granted approval in principle to MTN Nigeria and Airtel Africa to operate payment service banks (PSBs), with final approval to follow in six months, subject to specific requirements.\nTo extrapolate the revenue MTN Nigeria is likely to generate from its mobile money business in Africa’s most populous nation, BusinessDay proceeded to analyze the data by Tellimer, a global technology, information, and data provider, that surveyed mobile money penetration (defined as mobile money users as a percentage of total subscriber base) across various African telcos and markets.\nAs expected, Safaricom had the highest penetration (71percent), given its dominance and the positive trend for mobile money in Kenya.\n“This means that it will be very difficult for MTN Nigeria to replicate M-Pesa’s success in Kenya or that of its fellow MTN Group subsidiary in Ghana,” Omole said.\nThe central bank had in 2019 granted approvals to Hope PSB, Money Master PSB and 9PSB."
  },
  {
    "headline": "COVID-19 should not overshadow other health challenges – ECOWAS president – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The President of the Economic Community of West African States (ECOWAS) Commission, Jean-Claude Kassi Brou, has said COVID-19 pandemic should not overshadow all the other public health challenges facing the region.\nBrou said this on Friday in Abuja, during the 22 Ordinary Session of Assembly of Health Ministers of ECOWAS.\n”However, we must redouble our efforts to improving other health indicators in the region, particularly, maternal and child health, fight against communicable, non-communicable, neglected tropical diseases and universal health coverage to mention but a few,” he said.\nBrou said that the Public health challenges in the region are colossal and the expectations of the populations are very high.\nThe ECOWAC President, however, said that holding of the Assembly of Health Ministers was of vital importance in the life of the Organisation."
  },
  {
    "headline": "Defence Intelligence Agency holds retreat to reappraise operational tactics – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Defence Intelligence Agency (DIA) held its maiden retreat for Defence Advisers and Attachés on Saturday in Abuja.\nThe retreat aims at reappraising operational tactics and methods of intelligence gathering to address the country’s myriad security challenges.\nThe Chief of Defence Intelligence, Maj.-Gen. Samuel Adebayo, said at the opening that the retreat created a platform for institutional reflection on DIA’s activities to measure the attainment of its mandate.\n“The need for a continuous reappraisal of our strategies, operational tactics and methods of intelligence gathering to efficiently deal with our security challenges is therefore paramount.\n“This forum will no doubt provide the opportunity to tap from the vast experiences of former Chiefs of Defence Intelligence and past directors of the agency,’’ he said."
  },
  {
    "headline": "New Consumer Protection Bill ‘ll protect consumers’ rights- Lagos Assembly – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestIKEJA – The Lagos State House of Assembly has assured stakeholders in the state that the new Consumer Protection Bill would strengthen the Lagos State Consumer Protection Agency (LASCOPA) on the right of consumers.\nMr Adebisi Yusuff, the Chairman, House Committee on Commerce, Industry and Cooperative, made this known at a day public hearing in Lagos.\nReacting, Mr Wuraola Abdussalam, member, Provision Stores Association of Nigeria, urged the lawmakers to visit the markets and see things for themselves.\nAbdussalam said that a lot needed to be done toward addressing the rights of consumers.\nHowever, the General Manager, LASCOPA, Mr Afolabi Solebo, denied Abdussalam’s claim, saying, ”he is being economical with the truth."
  },
  {
    "headline": "Buhari leaves Paris for Intra African Trade Fair in S",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – President Muhammadu Buhari will, on Saturday, leave Paris for Durban, South Africa, at the special invitation of President Cyril Ramaphosa, to the inauguration of the second Intra-African Trade Fair (IATF) 2021.\nThe event, billed for Nov. 15 to Nov. 21, was convened by the African Export-Import Bank (AFREXIM), in collaboration with the African Union Commission (AUC) and the African Continental Free Trade Area (AfCFTA) Secretariat.\n”The event is also expected to generate market information, needed to connect buyers and sellers throughout the continent.\n”Global businesses, including non-African international brands, are expected to key into opportunities generated by the fair, thereby attracting to continental trade investment deals worth $40billion dollars,” he added.\nPresident Buhari is expected back in Nigeria on Nov. 16, Adesina said."
  },
  {
    "headline": "Nigeria’s revenue, expenditure to GDP ratios lowest in Africa –Budget Office",
    "summarized_story": "Nigeria’s revenue to GDP ratio is the lowest in Africa, the Director-General of the Budget Office, Ben Akabueze, has said.\n“Our revenue to GDP ratio is also the lowest in Africa,” he said.\n“Firstly, our public expenditure to GDP ratio is about the lowest even on the continent of Africa.\n“As a country, our public expenditure to GDP ratio is under 15 per cent.\n“There is a correlation between low public expenditure to GDP ratio and low revenue to GDP ratio,” Mr Akabueze noted."
  },
  {
    "headline": "Enugu govt promises support Ugwuanyi for woman whose husband killed son for ritual",
    "summarized_story": "Governor of Enugu State, Ifeanyi Ugwuanyi, has assured Mrs. Augustina Ifebuche Eze, whose seven-year-old son was allegedly killed by her husband, Chidi Onyishi, for money ritual that the state government will support her and her children.\nSpecial Adviser to the Governor on Information, Steve Oruruo who led a delegation from Ugwuanyi to commiserate with Mrs. Eze, said the state government will stand behind her family.\nEverything that needs to be done will be done by Enugu State Government to ensure that you find justice and overcome this challenge.\nSo he has sent us to come and commiserate with you and reassure you that you will not stand alone.\nGovernment will be with you and will give you support as we pray that God will give you stronger reason to find comfort."
  },
  {
    "headline": "Ebonyi PDP rejects ‘plan to auction state liaison offices in Abuja, Lagos, Enugu to Umahi family’",
    "summarized_story": "OBINNA EZUGWUThe Ebonyi State chapter of the People’s Democratic Party (PDP), has rejected what it described as a plan by the state government, working in connivance with the state house of assembly, to auction the state’s liaison offices in Abuja, Lagos, Enugu and Aba to the family of Governor David Umahi.\n“The attention of the People’s Democratic Party (PDP) in Ebonyi State has been drawn to the plan by the Ebonyi State Government in connivance with the House of Assembly to cede Ebonyi State liaison office buildings in Aba, Lagos, Abuja and Enugu to the Governor David Umahi’s family.\n“Why are the Ebonyi offices in Aba and Enugu auctioned outright?\nUmahi has concluded plans to acquire the property using cronies and which the leadership of the state assembly is aware of.\nWe wish also to remind the Ebonyi State House of Assembly that it’s not an appendage of the executive arm of the Ebonyi State Government, that they should at all times be doing the bidding of the executive without following due legislative process."
  },
  {
    "headline": "Journalists Float NGO to Sensitise Nigerians on ills of Corruption, Violence",
    "summarized_story": "A group of journalists, working with other concerned Nigerians, have come together with a view to using their skills to lead advocacy against corruption and violence in the country.\nTo achieve these twin objectives, the group has floated a Non- Governmental Organisation (NGO) called Media Anti-Corruption Initiative (MACI), a vehicle through which it intends to drive the advocacy.\n“We have come together to use media as a vehicle to promote the consciousness in Nigerians that will make them shun any acts of corruption and violence.\nHe said the group does not have the power to arrest nor prosecute but only to advocate for a better society.\n“We need to make this clarification so that the aims and objectives of this group will not be misconstrued by Nigerians”, Captain Mshelia stated."
  },
  {
    "headline": "Report says 78% of girls in northern Nigeria marry before age 18",
    "summarized_story": "Save the Children International has said in a report that 78% of girls in northern Nigeria get married before the age of 18The report titled ‘State of the Nigerian Girl: An incisive diagnosis of child marriage in Nigeria’ also revealed that 48 per cent of girls in northern Nigeria were married by age 15.\n“An estimated 44% of girls in Nigeria are married before their 18th birthday and the country also records the 11th highest rate of child marriage globally (UNICEF, 2013),” the report said.\n“Northern Nigeria (North East and North West) had 48 percent of girls married by age 15 while 78 percent were married by age 18.\n“As an outcome of child marriage; births increase, and the population explosion undermines the government’s ability to effectively plan and mobilize resources for sustainable development,” the report stated.\nIt continued, “Besides, child marriage has great negative consequences on the education of the girl-child."
  },
  {
    "headline": "Congress: Fresh Crisis Rocks Zamfara APC",
    "summarized_story": "A fresh crisis has engulfed the Zamfara State chapter of the All Progressives Congress (APC) as the camp of the former state governor, Abdul’aziz Yari has split into two over the state congress.\nThe letter tagged, “Re- Notice for the conduct of state congress” signed by the secretary of the Buni-committee, Senator John James AkpanUdoedehe, said the congress earlier scheduled for November 20, will now hold today, November 13.\nADVERTISEMENTTo this effect, an emergency meeting of the Yari/ Marafa camp was convened yesterday, where the issue of the congress was tabled and discussed.\nYou know we have our litigation on the dissolution of our executives pending.\nNo going back.”But a chieftain of the party in the second camp, said they will organize a parallel congress."
  },
  {
    "headline": "Congress: Fresh Crisis Rocks Zamfara APC",
    "summarized_story": "A fresh crisis has engulfed the Zamfara State chapter of the All Progressives Congress (APC) as the camp of the former state governor, Abdul’aziz Yari has split into two over the state congress.\nThe letter tagged, “Re- Notice for the conduct of state congress” signed by the secretary of the Buni-committee, Senator John James AkpanUdoedehe, said the congress earlier scheduled for November 20, will now hold today, November 13.\nADVERTISEMENTTo this effect, an emergency meeting of the Yari/ Marafa camp was convened yesterday, where the issue of the congress was tabled and discussed.\nYou know we have our litigation on the dissolution of our executives pending.\nNo going back.”But a chieftain of the party in the second camp, said they will organize a parallel congress."
  },
  {
    "headline": "PGF Boss Tackles APC NASS Members Over Direct Primary",
    "summarized_story": "Lukman, has blamed All Progressives Congress (APC) in the national assembly for the questionable clause in the direct primary in the electoral act amendment Bill.\nHe said; “The whole insertion of the provisions requiring political parties to adopt the direct method in the Electoral Act would appear to be an afterthought.\nCertainly, all members of the APC Tripartite Consultative Committee, including the APC leadership in the National Assembly should have been aware of such expectation.\n“The leadership of the National Assembly should take responsibility and not pass the buck”, Lukman added.\nHe said the whole debate about adopting direct method as part of the Electoral Act is mainly an APC agenda, but that there may be a calculated attempt by a section of APC leadership whose interest is to hoodwink APC members and Nigerians with the direct primary dummy."
  },
  {
    "headline": "PGF Boss Tackles APC NASS Members Over Direct Primary",
    "summarized_story": "Lukman, has blamed All Progressives Congress (APC) in the national assembly for the questionable clause in the direct primary in the electoral act amendment Bill.\nHe said; “The whole insertion of the provisions requiring political parties to adopt the direct method in the Electoral Act would appear to be an afterthought.\nCertainly, all members of the APC Tripartite Consultative Committee, including the APC leadership in the National Assembly should have been aware of such expectation.\n“The leadership of the National Assembly should take responsibility and not pass the buck”, Lukman added.\nHe said the whole debate about adopting direct method as part of the Electoral Act is mainly an APC agenda, but that there may be a calculated attempt by a section of APC leadership whose interest is to hoodwink APC members and Nigerians with the direct primary dummy."
  },
  {
    "headline": "Firm Petitions IGP Over Missing Engineers In Ebonyi",
    "summarized_story": "A consultant engineering firm based in Enugu, Nelan Consultants, has petitioned the inspector-general of police, Usman Alkali Baba, over the disappearance of five engineers from the firm in Ebonyi State.\nEzeagwu said the five engineers were on Nov. 3 deployed to a road project at Effium in Ebonyi in continuation of routine supervisory works.\nHe was to hold a meeting with one Ken Okeh at 3pm same date after the site visit to discuss some accommodation issues.\nADVERTISEMENTHe said the firm was appointed by the Ebonyi State government to supervise ABD-assisted construction of the Ebonyi State ring road project.\nMilitary and police operatives have since been fully deployed in the area to enforce the order and peace restored."
  },
  {
    "headline": "Oyo APC: Crisis worsens as chairman accuses Alao-Akala of dividing party",
    "summarized_story": "The crisis rocking the All Progressives Congress in Oyo State appears to be getting messier as the outgoing Caretaker Chairman of the party in the state, Chief Akin Oke, has accused former governor Adebayo Alao-Akala of engaging in undemocratic activities and causing division within the party.\nParty leaders in the state were called to a meeting in Abuja by the national leadership of the party with a view to addressing internal crisis.\nThe question to ask here is: When did the APC become the property of an individual?\nHe said, “Akala wants the crisis to end and that is what he has been doing.\nSo, he won’t react to any allegation from Chief Oke.”PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Oyo APC: Crisis worsens as chairman accuses Alao-Akala of dividing party",
    "summarized_story": "The crisis rocking the All Progressives Congress in Oyo State appears to be getting messier as the outgoing Caretaker Chairman of the party in the state, Chief Akin Oke, has accused former governor Adebayo Alao-Akala of engaging in undemocratic activities and causing division within the party.\nParty leaders in the state were called to a meeting in Abuja by the national leadership of the party with a view to addressing internal crisis.\nThe question to ask here is: When did the APC become the property of an individual?\nHe said, “Akala wants the crisis to end and that is what he has been doing.\nSo, he won’t react to any allegation from Chief Oke.”PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Nnamdi Kanu’s trial: IPOB threatens shutdown over alleged bias",
    "summarized_story": "The proscribed Indigenous People of Biafra on Friday threatened to shut down the country over what it described as the biased handling of the trial of its leader, Nnamdi Kanu, by the Federal Government.\n“Justice Binta Nyako is engaging in judicial rascality and impunity at the behest of the Federal Government of Nigeria aimed at keeping our leader in perpetual detention without trial.\nThis rascality only portrays that Binta Nyako is simply playing the script handed over to her by the Fulani caliphate of which she belongs to.\n“We wish to express our displeasure with Justice Binta Nyako’s handling of this case.\n“Our elders, traditional rulers, religious leaders and political elite who are begging IPOB to soft-pedal must take serious note of the travesty and shenanigans playing out in Justice Binta Nyako’s Courtroom."
  },
  {
    "headline": "Nnamdi Kanu’s trial: IPOB threatens shutdown over alleged bias",
    "summarized_story": "The proscribed Indigenous People of Biafra on Friday threatened to shut down the country over what it described as the biased handling of the trial of its leader, Nnamdi Kanu, by the Federal Government.\n“Justice Binta Nyako is engaging in judicial rascality and impunity at the behest of the Federal Government of Nigeria aimed at keeping our leader in perpetual detention without trial.\nThis rascality only portrays that Binta Nyako is simply playing the script handed over to her by the Fulani caliphate of which she belongs to.\n“We wish to express our displeasure with Justice Binta Nyako’s handling of this case.\n“Our elders, traditional rulers, religious leaders and political elite who are begging IPOB to soft-pedal must take serious note of the travesty and shenanigans playing out in Justice Binta Nyako’s Courtroom."
  },
  {
    "headline": "Libya topples Nigeria as Africa's top oil producer",
    "summarized_story": "Libya has overtaken Nigeria as Africa’s top oil producer, according to a new report by the Organisation of the Petroleum Exporting Countries (OPEC).\nLibya’s oil production rose to 1.24 million bpd in October from 1.16 million bpd in September.\nBut according to OPEC secondary sources, Nigeria still pumps more oil than Libya.\nSaudi Arabia’s crude oil production rose to 9.759 million bpd, and the Kingdom was quite naturally the producer with the largest monthly increase.\nVenezuela boosted its oil production by 57,000 bpd per secondary sources in the OPEC report."
  },
  {
    "headline": "BBNaija's Liquorose bags new ambassadorial deal",
    "summarized_story": "Ex-Big Brother Naija housemate, Roseline Omokhoa Afije a.k.a Liquorose has landed her first ambassadorial deal with a waist trainer and weight loss brand, Deshapeables Nigeria.\nThe BBNija first runner-up took to her Instagram page to share a video showing the moment she unveiled herself as Deshapeables’ brand ambassador.\nThe excited reality star and dancer wrote: “It’s Deshapeables or Nothing!❤️I am super excited to join the @deshapeables family, as a Brand Ambassador.\nDeshapeables offers the best products and it’s about to be an amazing journey.\nJoin me as we bring you premium products only 💃Follow & rush them with your orders#LiquoroseXDeshapeables”See the video below."
  },
  {
    "headline": "BREAKING: Islamic State, ISWAP Fighters Currently Attacking Nigerian Army Base, Borno Community",
    "summarized_story": "At a military post in Borno State’s Askira/Uba Local Government Area, suspected Islamic State of West Africa Province (ISWAP) fighters are now engaged in a gunfight with forces.\nEarly this morning, some locals stated they saw ISWAP fighters in a big convoy of gun trucks traveling along the Ngude axis towards Askira.\n“Yes, ISWAP is currently attacking Askira town.\n“My people told me that the insurgents came with about 16 gun trucks and there is confusion in the whole town now,” Engr.\nWe are outnumbered; we only have five gun trucks with us.” Yakubu said."
  },
  {
    "headline": "AGF Malami Forced Us To Convert $40 Million Recovered Loot At N305 Per Dollar — Keystone Bank",
    "summarized_story": "Mr Malami, who had determined that a total of $136,676,600.51 was to be paid to NNPC, ordered that 96 million be paid in dollars and 40 million in naira be paid.\n“Out of this entire amount, we paid $96 million in United States dollars and we paid the equivalent of $40 million in naira,” according to Lawal Ahmed.\nMr Ahmed, who is the Executive Director, North and Public Sector Directorate, Keystone Bank, also said that Mr Malami recommended the exchange rate at N305 to a dollar.\nThe final payments were made thereafter in tranches,” Mr Ahmed added.\nReacting, a member of the committee, Olanrewaju Edun, criticised Mr Malami for issuing such directives, suggesting that the AGF be subjected to questioning."
  },
  {
    "headline": "Why Armed Security Operatives, Military Men Stormed Lagos Airport – Nigerian Government",
    "summarized_story": "According to the Federal Airport Authority of Nigeria (FAAN), armed security personnel stormed the Murtala Muhammed Airport in Lagos State as part of a routine security operation.\nAccording to SaharaReporters, NAF personnel invaded the terminal building, fully armed, harassing travelers.\nThey came into the terminal building armed to the teeth, harassing passengers.\n“Their commander led them into the terminal building armed with assault rifles.\nHe alleged that the same Air Force personnel are responsible for recruiting touts from Oshodi to extort passengers at will."
  },
  {
    "headline": "Government Style Is Horrible, Taken Nigeria To Stone Age – Dele Momodu",
    "summarized_story": "Dele Momodu, a presidential contender in 2011, has revealed his reasons for criticizing President Muhammadu Buhari (retd).\nMomodu claimed in a post on his verified Facebook page that Buhari’s style of government is terrible and has caused Nigeria to regress.\nThe veteran journalist also stated how he got into politics despite not joining a political party.\nIn 2015, Momodu worked with Buhari under the All Progressives Congress party.\nHowever, Momodu made a case for the opposition Peoples Democratic Party, stating that the party is the solution to the country’s current challenges."
  },
  {
    "headline": "Breaking: Pilot, passenger escape death as another plane crashes",
    "summarized_story": "Two men have made a miraculous escape from a crashed plane after plummeting into the water off City Beach in Perth, just 10 kilometres from the CBD.\nPolice responded to a report of a small aircraft hitting the water shortly after 3.30pm on Saturday, local time.\nOnlookers swam out to help the pilot and his passenger, both of whom managed to exit the plane through its windows and made their way to shore, about 20 metres away.\nInspector Hussey said the two men were, incredibly, “all good”, and quipped that they “should go and buy a lottery ticket”.\nThe response from emergency services included multiple police units, Water Police and a Police Air Wing helicopter."
  },
  {
    "headline": "Citizens thumb up FG on e-Naira",
    "summarized_story": "China, Bahamas, Cambodia, and a few other countries have already issued their own central bank digital currencies (CBDCs).\nHe also said the adoption of Central Bank Digital Currency (CBDC) can increase Nigeria’s Gross Domestic Product (GDP) by $29 billion over the next 10 years.\nThe e-Naira and Naira will have the same value and will always be exchanged at 1 Naira to 1 e-Naira.\nHe said: “All things being equal, the CBN e-Naira launch is a welcome development.\nInterestingly, e-Naira is going to be a ‘game-changer’ that would provide an alternative payment system and would radically transform the payment landscape."
  },
  {
    "headline": "Breaking: Police unseal Plateau House of Assembly complex as Lalong makes immediate request (PICTURES)",
    "summarized_story": "The Nigerian Police and other security agencies on Friday unsealed the Plateau State of Assembly, complex, allowing Speaker Yakubu Sanda and 11 other lawmakers to stage plenary.\nSpeaker Sanda who read the communication said governor Lalong is seeking for the screening of Mr. Fabian Ari Ntum as Chairman of the electoral body.\nThe House resolved to screen the seven nominees on another legislative session, as moved by House Majority leader Naa’anlong Daniel.\nSimilarly, the House has resolved to move legislative sessions to old Government House pending when the hallowed chamber in the Assembly complex will be fixed back.\nThe House Speaker, Sanda, thereafter adjourned plenary till next week."
  },
  {
    "headline": "Bandits Attack Zamfara Community, Kill Nine, Rustle Livestock",
    "summarized_story": "At least nine persons have been killed by bandits in Tungar Ruwa Village located in Anka Local Government Area of Zamfara State.\nThe incident was confirmed on Friday night by the spokesperson of the Zamfara State Police Command, Mohammed Shehu.\nZamfara State is notorious for bandit attacks.\nA resident of the village explained that the bandits stormed the village on motorcycles and shot sporadically into the air.\nThe bandits were said to have ambushed the police operatives, killing seven of them and setting ablaze the operational vehicle."
  },
  {
    "headline": "Reps Minority Caucus Mourns Slain Vanguard Reporter, Demands Further Investigation",
    "summarized_story": "The Minority Caucus in the House of Representatives has mourned the death of the Vanguard Newspaper correspondent attached to the House of Representatives, Tordue Salem.\nThe lawmakers in a statement signed on Saturday by the Minority Leader, Ndudi Elumelu, described the news of Salem’s death as shocking and devastating, demanding a further investigation by the police.\n“The Minority Caucus in the House of Representatives receives with shock and utter devastation, the news of the death of the Vanguard Newspaper correspondent attached to the House of Representatives, Mr. Tordue Salem.\nThe minority caucus said they note the report by the police that the journalist was knocked down by a hit and run driver, around Mabushi area in Abuja.\nThey also commiserated with the Salem family, particularly, Mrs. Salem, the Vanguard newspapers, the House of Representatives Press Corps, and the entire media industry for the loss."
  },
  {
    "headline": "FG To Begin Sale Of Houses From N7.2m – Fashola",
    "summarized_story": "﻿The Federal Government is set to commence sale of houses under the National Mass Housing Programme from N7.2 million naira.\nThe Minister of Works and Housing, Mr Babatunde Fashola, stated this on Friday during the unveiling of an online portal for the housing scheme in Abuja.\nThis provides an opportunity for all Nigerians to apply and ensure a fair process of allocation,” the minister said.\nIt’s taking a little more time than before but as minister, I don’t want to be bogged down with petitions.\nAccording to him, over 5,000 units of houses are at different stages of completion under the programme."
  },
  {
    "headline": "Nigerians Are Competitive Abroad Due To Good Education From Home – Buhari",
    "summarized_story": "President Muhammadu Buhari says Nigerians all over the world are very competitive, noting that they acquired the trait from home where the citizens have been properly educated and immersed in business rudiments.\nThe President stated this on Friday when he met with the Minister of State Foreign Affairs of United Arab Emirates (UAE), His Excellency Shaikh Shakboot Alnahyan, at the sidelines of the Paris Peace Forum.\nAccording to a statement by his special media aide, Femi Adesina, President Buhari described his countrymen and women as “competitive both at home and abroad,” and urged them to always abide by the rules of their host countries.\nSaid the President: “Nigerians are all over the place, very competitive.\nWe want to come and add quality and value.”He equally commended the Nigerian government for its robust tackling of violent extremism."
  },
  {
    "headline": "Elon Musk Sells $6.9bn In Tesla Shares After Twitter Poll",
    "summarized_story": "Tesla CEO Elon Musk sold more than $6.9 billion worth of shares in the electric carmaker this week, according to regulatory filings released on Friday.\nThe 50-year-old South African billionaire sold more than 5.1 million Tesla shares, of which about 4.2 million were held in a trust.\nTesla shares had plummeted at the Wall Street opening on Monday and have fallen further since.\nThe stock Musk disposed of this week was sold at a significantly lower share price than if he had sold before his tweet.\nAccording to the latest filings with the Securities and Exchange Commission, Musk still holds about 167 million Tesla shares."
  },
  {
    "headline": "Tordue Salem: NUJ Demands Independent Inquiry, Autopsy",
    "summarized_story": "The Nigeria Union of Journalists (NUJ) FCT Council has tasked the Federal Government to empanel an independent probe into circumstances surrounding the death of Vanguard Newspapers reporter, Tordue Salem.\nSalem went missing on October 13 in Abuja and was reported dead on November 11 by the newspaper he worked with for several years.\n“The death of Mr. Tordue Salem opens another dark chapter for journalism and journalists in Nigeria and we are grievously saddened by it,” the statement reads.\n“While the NUJ appreciates the effort of the police in finding the corpse of Mr. Salem, as a union we are not persuaded by the account of the police as it poses more questions than answers.\nIt is in this regard that we urge President Muhammadu Buhari to order for an independent inquiry into the tragic end of Mr. Tordue."
  },
  {
    "headline": "Six burnt to death in Ondo road accident",
    "summarized_story": "At least six persons were burnt to death at Ode Aye junction in Okitipupa Local Government Area of Ondo state on Friday.\nThe accident involved a coaster bus and a J5 bus laden with Ethanol .\nThe incident which occurred after one of the vehicles was trying to overtake another vehicle but the two vehicles collided and instantly caught fire.\nHe said the six people were burnt beyond recognition while some other victims were rushed Prima hospital in Ore in Odigbo local government where they have been receiving treatment.\nHe said all attempts to call the operatives of the state road safety agency were not successful but said the remains of the victims had been deposited in a hospital in Ore"
  },
  {
    "headline": "Nyako's former CSO, Sheriff arraigned in court over N80m fraud -",
    "summarized_story": "The Department of State Security has arranged security aide to former Governor Murtala Nyako at Yola High Court over fraud involving N80 million worth of propertyMr Sheriff Rabiu, a retired Assistant Commissioner of Police, and former Chief Security Officer to a former governor of Adamawa state, Murtala Nyako was arraigned before Justice Hafsat Abdulrahaman.\nThe case number HC/ADSY/77CA/2021 holds application for commencement of trial under section 111(b) of the defendant (Sheriff) of Adamawa state administration of criminal justice law 2018.\nThe application stated that Sheriff is in court under section 106 (1) of Adamawa State administration of criminal justice law, 2018 which provides for the commencement trial in the High Court by way of the information filed by the attorney general of the state.\nMeanwhile, Counsels to Sheriff, Otokpa, and Muhammad had applied for bail in the condition of ill health of the defendant.\nIn her ruling Justice Hafsat granted the defendant bail on grounds of a health challenge and asserted that bail is a constitutional right."
  },
  {
    "headline": "Journalists demand independent probe into Tordue Salem's death -",
    "summarized_story": "The Nigerian Union of Journalists has called on President Muhamamdu Buhari to order an independent investigation into the death of journalist, Tordue SalemThe union, along with parliamentary reporters, queried the claim by police authorities that their missing colleague, was killed by a hit and run driver.\nEmotions as the news of the mysterious and suspicious death of missing parliamentary reporter, Tordue Salem, gets back to his colleagues.\nClad in black, the reporters mourn.\nThen, prayers are said for the repose of his soulSoon, news filtered in that the police paraded a suspect who allegedly killed him.\nTheir demand is justice"
  },
  {
    "headline": "Free at Last, Britney Spears Calls End of Conservatorship ‘Best Day Ever’",
    "summarized_story": "The 39-year-old “Piece of Me” singer had begged the court for months to terminate the conservatorship that has governed her personal life and $60 million estate since 2008.\nSome danced and sang to her hit “Stronger.”“It was a monumental day for Britney Spears,” the pop star’s attorney, Mathew Rosengart, said outside the courthouse.\nThe arrangement began to crumble in September when in a sudden reversal Jamie Spears said he supported ending it because it had helped her and was no longer needed.\nRosengart is pushing for Jamie Spears to be investigated for possible financial mismanagement of his daughter’s affairs, but he said on Friday it would be up to Britney Spears to decide how to proceed on that matter.\nJamie Spears has said through attorneys that he helped his daughter rehabilitate her career and always acted in her best interest."
  },
  {
    "headline": "Man Who Went to Space Aboard Blue Origin Last Month Dies in Plane Crash",
    "summarized_story": "Authorities have not said who was piloting the small plane.\nIt was incredible,” de Vries said as he got his Blue Origin “astronaut wings” pinned onto his blue flight suit by Blue Origin founder Jeff Bezos.\n“We are devastated to hear of the sudden passing of Glen de Vries,” Blue Origin tweeted Friday.\n“He brought so much life and energy to the entire Blue Origin team and to his fellow crewmates.\nFischer owned the flight school Fischer Aviation and was its chief instructor, according to the company’s website."
  },
  {
    "headline": "Trump Adviser Bannon Charged after Defying Capitol Riot Subpoena",
    "summarized_story": "Stephen Bannon, a prominent adviser to former U.S. President Donald Trump, has been criminally charged for defying a subpoena issued by a congressional committee investigating the Jan. 6 attack on the Capitol, the Justice Department said on Friday.\nBannon, 67, was charged with one count of contempt of Congress for refusing to appear for a deposition and a second count for refusing to produce documents.\nContempt of Congress is a misdemeanor punishable by up to one year in jail and a maximum fine of $100,000.\nTrump has sought to stonewall the committee, which is scrutinizing his actions relating to the deadly Capitol riot, and directed his former associates not to cooperate.\nThe charges against Bannon may bolster the committee’s efforts to secure testimony and documents from other Trump associates."
  },
  {
    "headline": "Biden, Xi Jinping to Hold Virtual Meeting on Monday",
    "summarized_story": "U.S. President Joe Biden will hold a virtual meeting with Chinese leader Xi Jinping on Monday, the White House said, talks Washington hopes will create some stability amid increased tensions between the world’s two largest economies.\nU.S. officials believe direct engagement with Xi is the best way to prevent ties spiraling toward conflict.\n“If the United States really wants to maintain peace in the Taiwan Strait, it should clearly and resolutely oppose any Taiwan pro-independence behavior,” Wang said.\nDaniel Russel, the top U.S. diplomat for Asia under the Obama administration, said both Biden and Xi were worried by the risk of a military incident escalating.\n“This suggests that the personal relationship Biden built with Xi a decade ago is still strong, and that each conversation can add some stability to the mix.”"
  },
  {
    "headline": "Buhari Canvasses for Global Peace and Solidarity at UNESCO’s 75th Anniversary",
    "summarized_story": "President Muhammadu Buhari on Friday said despite mounting challenges facing nations, it was high time peace and solidarity “reign supreme” across the globe.\nHe said: “Our world is fast changing and so are the evolving challenges.\nThere is, therefore, no better time to canvass for solidarity for the enthronement of peace and development.\nBuhari said: “Seventy-five years of building together a more advanced, knowledgeable and prosperous world through education, science, culture, communication and information.\nThe President said this when he met with the Minister of State Foreign Affairs of the United Arab Emirates, Shaikh Shakboot Alnahyan, on the sidelines of the Paris Peace Forum."
  }
]