[
  {
    "headline": "Israeli PM names president’s brother as new US envoy",
    "summarized_story": "Israel on Friday appointed retired Brigadier General Michael Herzog as its new ambassador to the United States, the prime minister’s office announced, noting his expertise on Iran.\nIsraeli media said that Herzog, 69, is the brother of President Isaac Herzog.\nThe would-be ambassador served 40 years with the Israeli army, including as chief-of-staff to the defence minister.\nHe took part in “diplomatic negotiations under five prime ministers”, the statement added.\nIf approved by the coalition government, Herzog would remain as Israel’s envoy to Washington when Foreign Minister Yair Lapid takes over from Bennett as prime minister in 2023."
  },
  {
    "headline": "Nigeria’s BetKing ends Kenyan league sponsorship deal",
    "summarized_story": "BetKing and the Football Kenya Federation said in a joint statement on Friday that they had reached a mutual agreement to terminate the $11 million (9.4 million euro) deal.\nIt faced a financial crisis after the exit of another title sponsor, online gaming firm SportPesa, in September 2019 following a protracted tax row with the government.\nThe betting firm took over as the league’s title sponsor in July 2020, in a partnership that was to run until 2025.\nAt the time, FKF said the sponsorship was the biggest deal in the history of Kenyan football.\nBut it appears to have recently run into trouble when football clubs complained they were not receiving their share of the deal, a claim denied by FKF."
  },
  {
    "headline": "Lionel Messi, PSG coach Posh talk ahead of transfer -Report",
    "summarized_story": "Lionel Messi has spoken directly with Paris Saint-Germain head coach Mauricio Pochettino as he moves closer to joining the French club after leaving Barcelona.\nMessi left Barcelona after the La Liga club were unable to fulfil a new contract that had been agreed with the player due to “financial and structural obstacles”.\nPSG, managed by Messi’s compatriot Pochettino, quickly emerged as the frontrunners for his signature, in a move that would reunite him with former Barcelona team-mate Neymar.\nMessi is open to joining PSG, but he and his representatives want to take time to assess their options following his shock exit from the Nou Camp, Skysports reports.\nGianluigi Donnarumma, Sergio Ramos and Georginio Wijnaldum have already arrived at the Parc des Princes on free transfers this summer."
  },
  {
    "headline": "APC: A congress of crises",
    "summarized_story": "Mai Mala Buni-led Caretaker Extraordinary Convention Planning Committee CECPC of the ruling All Progressives Congress APC now has its hands full with the controversies that have trailed the exercise in some states of the federation.From Delta, Osun, Kwara, Enugu to Lagos and many other states, events of last weekend can best be described as a congress of crisis rather than a congress of all progressives.\nThis is to say that: any purported; parallel congress, parallel party organ and or parallel party office, is to say the least a nullity”.\n“Of course, it is true that the Chairman of the All Progressives Congress (APC) National Committee for Osun State Ward Congress, Hon.\nWhile the Mohammed group had opened a parallel state party secretariat, the party leadership in Abuja had threatened sanctions against the minister.\nImoIn Imo, it was a walk over for the state governor, Hope Uzodinma as loyalists of Senators Rochas Okorocha and Ifeanyi Ararume, reportedly boycotted the exercise."
  },
  {
    "headline": "Gunmen burn Imo police station, inspector, 3 others killed",
    "summarized_story": "By Emmanuel IheakaGunmen on Thursday night attacked Orsu police station in Imo State, setting it ablaze.\nWhile a source in the area told Saturday Vanguard that about three police men lost their lives to the attack, the Police Public Relations Officer, Michael Abattam in a statement rather said the force killed three of the gunmen and lost an inspector.\nAbattam said the police succeeded in repelling the rest of the gunmen and recovered arms from them.\n“Three of the gunmen were neutralized and their guns, one pump action gun and two locally made double barrel pistols were recovered while others escaped into the bush with bullet wounds.\nAlso hospitals are advised to ensure that they report any person who comes to them for treatment of bullet wounds”, the statement reads."
  },
  {
    "headline": "Owerri FMC used my son as learning tool, says father of wheelchair-bound graduate",
    "summarized_story": "For 25-year old Jonadab Onuchukwu, life has turned sour.\n“After weeks at Federal Medical Centre Owerri without improvement and medical bills pilling up, he was discharged”, the father narrated.\nExperience at FMC OwerriAt the Federal Medical Centre, Owerri where Jonadab was first taken to, his father said the centre abandoned his son and later used him as a learning tool.\n“I don’t want to talk about the experience at FMC Owerri until my son recovers.\nAnd it is not possible for one to stay for more than one week without seeing a consultant”, the FMC spokesperson maintained."
  },
  {
    "headline": "2023 Southern presidency: Current situation makes zoning inevitable — Lawyers",
    "summarized_story": "They have the Constitutional right to gather together and deliberate on issues affecting Nigeria as a whole and southern Nigeria in particular.\nIf the southern governors have woken up from a long nightmare to think aright, nothing is wrong with that”.\nVictor ‘Dotun Fasanya said that “There is nothing wrong with the Southern Governors’ demand for a Southern President in Nigeria come 2023.\nSo whoever complains about the Southern governor’s meeting, and them taking position on certain national issues should think twice.\nIt is politically, constitutionally correct for them (Southern governors) to make any demands."
  },
  {
    "headline": "We’re saints compared to what’s happening now – IBB",
    "summarized_story": "He said they could be likened to saints compared to is happening now.\nFrom what I read, from the analyses, I think we are saints when compared to what is happening under a democratic dispensation.\nThe Babangida administration cannot be accused of sectional and sectarian disposition which is the hallmark of the Buhari Government.\nHe appointed people into positions based on merit even when he had opportunity as a military president to appoint whoever he liked without anybody challenging him.\nFinancial corruption, political corruption, economic corruption, nepotism corruption."
  },
  {
    "headline": "Persons with disability: We will ensure their Inclusion in governance – Osun Speaker, Owoeye",
    "summarized_story": "The Speaker, Osun State House of Assembly, Timothy Owoeye, has stated that the state government will work towards the domestication of the Persons With Disabilities (PWD) Bill in order to meet with the trending global template.\nThis is as he stated that the government will support the inclusion of persons with disability in governance and government policies and ensure their participation in social intervention programmes and the availability of sign language interpreters in government programmes.\nOwoeye, while addressing the NGO stated that the state government is receptive to persons with disability adding that they will be included in all state government activities.\nOwoeye noted that, “Persons with Disability are human beings and attention should be paid to them in Osun and Nigeria as a whole.\nHe added that the call for the inclusion of this category of persons is that their population in Nigeria according to World Health Organisation statistics is about 20 million."
  },
  {
    "headline": "Suspected gunmen kill husband, abduct wife, daughter in Ekiti",
    "summarized_story": "Suspected gunmen on Friday evening killed a man in Ekiti State with his wife and daughter abducted and taken to unknown destination by the gun wielding criminals.\nThough, rumour had it that there were five occupants in the vehicle, the police Public Relations Officer, Ekiti Command, Sunday Abutu countered the claim, saying they were three.\n“They didn’t take the vehicle, they only left the corpse of the man and other people in the vehicle were taken away.\n“The report we got was that, the family was traveling along that root and suddenly some suspected gunmen fired gunshots at them, killing the husband and took away the wife and their daughter.\nA few months ago, the traditional ruler of Ewu-Ekiti, Oba Adetutu Ajayi, in Ilejemeje Local Government Area of Ekiti State, had a close shave with death, as he was shot by bandits on April 10, 2021."
  },
  {
    "headline": "IBB University: Niger Assembly intervenes in school fees hike",
    "summarized_story": "Following the hike in school fees by the management the state owned Ibrahim Badamasi Babangida University, Lapai (IBBUL), the Niger state House of Assembly has intervened in the crisis.\nThe governing council and the Senate, he explained should be invited to appear before the house and state reasons for their action.\nComparing the two fees, Haruna stated that the governing council had approved 100 percent increment of all the fees to be paid by students at the time most families were struggling to feed themselves.\n“As a result of the impact of COVID-19 pandemic, every family in Niger State is affected economically one way or the other.\nConsequently, the legislators resolved that the Senate, Governing Council and Management of IBBU should appear before the committee on Education and report back to the House in two weeks."
  },
  {
    "headline": "Participate actively in coming data collection – Buni charges people with disabilities",
    "summarized_story": "Yobe State Governor, Mai Mala Buni has changed People Living with Disabilities in the state to actively participate in the upcoming data collection exercise to be conducted by the National Commission for Persons with Disability.\nThe Governor assured the support of the state government for a successful data collection on People with Disability in the state, appealing to all members to participate actively for the successful conduct of the exercise.\nIsah had informed Governor Buni that the National Commission for Persons with Disabilities would commence the data collection exercise on Thursday 12th August, 2021 in all the 17 local government areas in the state.\n“And when completed, only those who are captured will be considered in distribution of support from the state and federal governments”.\nHe, therefore, described the exercise as necessary and crucial to all People Living with Disabilities."
  },
  {
    "headline": "Nnamdi Kanu: Police fumes as IPOB vows to commence sit-at-home Monday",
    "summarized_story": "Recall that the secessionist group had vowed to institute a weekly sit-at-home in the region in solidarity with its leader, Mazi Nnamdi Kanu who is currently in the custody of the Department of State Services, DSS.\nFollowing the development, IPOB in a recent statement vowed to mount pressure on the government by enforcing sit-at-home in the region to ensure the release of the Biafra freedom fighter.\nHe urged parents and guardians to ensure the their children/wards are not involved in any activity capable of threatening peace of the state.\n“There are rumours circulating in the state that members of the proscribed Indigenous People of Biafra have resolved to commence a sit-at-home every Monday with effect from Monday, August 9, 2021.\n“The sit-at-home will negatively impact the economy of the state and individual pockets”, she added."
  },
  {
    "headline": "BBNaija Shine Ya Eye: Whitemoney blames Liquorose for fighting Beatrice",
    "summarized_story": "By Gbenga BadaBBNaija Shine Ya Eye housemate WhiteMoney has blamed Liquorose for fighting Beatrice over alleged gossip with Angel.\nWhiteMoney, in a conversation with Jaypaul, revealed he told Liquorose that she was wrong to have informed other housemates about the gossip without confronting them.\nADVERTISEMENTHe said: “I asked Liquorose about the argument and after her explanation, I told her she was wrong.\nI told her she shouldn’t have told other housemates before confronting Angel and Beatrice.”WhiteMoney added after the conversation with Liquorose, she admitted she was wrong.\nLiquorose said she was upset because Angel and Beatrice were talking about her relationship with Emmanuel."
  },
  {
    "headline": "Arewa youths ask FG to ban #Big Brother Naija",
    "summarized_story": "By Gbenga BadaThe Arewa Youths Advisory Forum has urged the Federal Government to ban #Big Brother Naija show.\nThe forum described the reality TV show as a calamity and an act of immorality that ‘should not be encouraged.’ADVERTISEMENTNational President of the forum, Yerima Shettima, called on the Federal Government to ban the show.\nShetima said the show looks like a blue film, adding that a lot of people watch it to see acts of immorality.\n“I have often said that this show encourages immorality and that the Nigerian government should ban it.\n“I urge true lovers of the country to join hands and draw the government’s attention to the implication of this program which should be discouraged.”"
  },
  {
    "headline": "Human trafficking: Police rescue six Christian teenagers in hijab, male agent",
    "summarized_story": "By Bisi Olaniyi, Southsouth Bureau ChiefSix female Christian teenagers, who disguised with hijabs as Muslims, and an alleged male agent of human traffickers, Innocent Godfrey, 20, have been arrested by the police in Edo State.\nEdo Commissioner of Police, Phillip Ogbadu, yesterday at the state’s police headquarters in Benin paraded the victims of human trafficking and their agent.\nHe noted that the victims, who were from Delta, Edo and Enugu states, but all residing in Edo state, were recruited for the journey by Godfrey’s elder sister.\nADVERTISEMENTHe said: “It is a case of human trafficking.\nEdigho said: “She (Godfrey’s elder sister) asked if I would like to travel out of Nigeria and that the available works are cleaning, house help and prostitution."
  },
  {
    "headline": "BBNaija Shine Ya Eye: Sammie, Liquorose become 500 Abeg Naira richer",
    "summarized_story": "By Kehinde OlusanyaBBNaija Shine Ya Eye housemates Sammie and Liquorose have become N500 Abeg Naira richer after winning the first Friday arena games.\nBiggie also stated two winners, both male and female, will emerge from the game.\nADVERTISEMENTAs the Head of House, Boma started the game followed by other housemates.\nThe games began with Big Brother explaining the procedures of how the games will be played by each housemate standing on the start line, jogging through the tires, climbing the hill, going underneath the ropes, jumping over the stands, pulling a tyre to the end line and ending their game by shouting ‘Abeg I don finish’.\nAfter they all played, Sammie and Liquorose were declared the winners by Big Brother and were rewarded with N500 Abeg each."
  },
  {
    "headline": "Finally, IBB reveals June 12 secret",
    "summarized_story": "“If June 12 had materialised, there would have been a coup d’état which could have been violent,” he said.\n“When we were in the military, we talked about certain issues and the unity of Nigeria was one of them.\nAs far as we were concerned, the unity of Nigeria, free market, federalism were all settled issues.\nI believe that the media is an essential part of society, and they should play their role for the country.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "It’s not easy coping with sexual harassment in Nollywood –Chioma Okoye",
    "summarized_story": "Fast-rising actress, Chioma Okoye has reiterated that there are limits to what she can do for the camera.\nI can’t act being naked in any form or being kissed horribly.\nAlso, I can’t act inside a coffin or allow my photo to appear on obituary posters because I am still alive,” she says.\nMs Okoye, however, lamented that her major challenges in Nollywood are sexual advances from randy producers.\n“The major challenges I have in Nollywood are sexual requests from randy producers."
  },
  {
    "headline": "North suffering in silence under Buhari -Tanko Yunusa, Ex-NCP presidential candidate",
    "summarized_story": "People in the North have been suffering in silence, and this is what many Nigerians don’t know.\nHow can you subject INEC to the whims and caprices of the National Communications Commission (NCC) and the National Assembly?\nMembers of the National Assembly should be ashamed of themselves for saying that there is no network in some of their villages.\nThe National Assembly members want to put the country in danger over their position on this issue.\nThe National Assembly members’ action is not only anti-people but also a setback for our democracy."
  },
  {
    "headline": "Seven profitable businesses you can start with N100,000 or less",
    "summarized_story": "Four: SkincareYet another business one is sure to have a very appreciable profit margin from is the skincare business.\nYou can start with as low as N100,000 and still make over a 100 percent profit on each product sold.\nSix: Palm oil retailingPerhaps one of the most lucrative businesses that can be started with N100,000 or less is the palm oil retailing business.\n“Palm oil business is a very lucrative business.\n“Palm oil business does not have any technicality."
  },
  {
    "headline": "Aftermath of Igboho’s arrest: Agitation for Yoruba Nation loses steam",
    "summarized_story": "From Oluseye Ojo, IbadanIn the past one month, the agitation for self-determination for Yoruba nation, from all indications, seemed to have lost its steam, as little or nothing has been heard about the struggle.\nIt is also on record that the last Yoruba nation rally that was held at Ojota in Lagos on July 3, this year, was another case that probably weakened the agitation for self-determination for the Yoruba Nation.\nThere was an insinuation that a number of Yoruba nation agitators might have slowed down on the struggle as a result of an alleged clampdown on them by the Federal Government.\nBefore the clampdown, there was a fierce and consistent social media agitation for the Yoruba Nation.\nWe want to thank the Federal Government of Nigeria for publicising the Yoruba Nation rallies for us."
  },
  {
    "headline": "IBB on Corruption: With the Fact on Ground Now, My Govt a Saint",
    "summarized_story": "Answering directly on the allegation that he popularised corruption, Babangida, who was head of state between 1985 and 1993, said: “Well, you can’t compare it with the fact on the ground now.\nFrom what I read, from analysis, I think we are saints when compared to what is happening under a democratic dispensation.\n“I sacked a governor for misappropriating less than N313, 000; today billions are there in the streets.\nThose who have stolen billions are in courts, and are now parading themselves on the streets.\nHe denied being anti-media, claiming that he libralised it, leading to the birth of many private media, both print and electronic."
  },
  {
    "headline": "Army Chief: We’re Set to Take Battle to Terrorists’ Enclaves",
    "summarized_story": "The Chief of Army Staff (COAS), Lieutenant-Gen Faruk Yahaya, disclosed this shortly after addressing troops at the Fort Muhammadu Buhari Forward Operating Base, Daura, Katsina State.\nWe must carry the battle to the enemies’ enclaves both here in the North-west and even in the North-east where we are conducting them.\nThe Army Chief called for effective inter-agency collaboration between civil-military and paramilitary organisations to checkmate the activities of the hoodlums within their respective areas of responsibilities in order to ward off insecurity.\nThe Chief of Army Staff explained that traditional and religious institutions had vital roles to play in the fight against insecurity in the country.\nThe emir vowed to support the Nigerian Army to achieve the desired goal in its ongoing war against insecurity in the country."
  },
  {
    "headline": "82 Yauri Students Spend Day 52 with Bandits in Forest",
    "summarized_story": "The heavily armed bandits, who came on motorcycles, entered Yauri from the neighbouring Rijau forest in Niger State, and abducted the students and staff of the school unhindered.\nSome students and staff, 12 in all, have since gained freedom, leaving 82 in captivity.\nParents of the students still with the bandits remain in anguish over the fate of their children.\nThe bandits have not made any demands from us, we wouldn’t know if they are making any demands on government.\n“The official adds: “Both the state and federal governments are working together to secure the students."
  },
  {
    "headline": "Wema Bank Mulls Acquisition or Merger, to Raise N40bn Through Rights Issue",
    "summarized_story": "Dike OnwuamaezeThe management of Wema Bank yesterday hinted that “it is considering” the acquisition of a fintech firm or a merger with another commercial bank, as part of its growth plans.\nOseni said the acquisition “is not limited to the financial sector space.”Oseni said: One of our pillars is inorganic growth.\nOseni explained that the bank would reduce its shares in issue before embarking on the rights issue to ensure enhanced growth for shareholders.\nWe just want to manage the number of shares in issue, and that will impact on our ratios.\nIt makes sense to have more efficient shares in issue before doing the rights issuance,” Oseni said."
  },
  {
    "headline": "2023: IBB Speaks on Zoning, Says Nigeria Must Know Candidates’ Qualifications, Beliefs",
    "summarized_story": "General Babangida in an interview on Arise TV, a broadcast arm of THISDAY, monitored in Minna, Niger state on Friday believes that democracy does not align with zoning or power shift.\nBabangida also said Nigerians should know the “person, his qualifications his beliefs” before such a person is voted to lead the country “regardless of where he comes from”.\nThe former military presidents also said no person can make Nigeria a one party state, insisting however that two party system of government is good for the country.\nHe added that ” two parties are still the best for this country.\nOn insecurity, the former military president believes banditry and kidnapping have continued across the country because the military which has the capability to contain the menace “Is overstretched” and faced with “obsolete equipment”."
  },
  {
    "headline": "How Buhari, Jonathan, Sultan, Other Top Nigerians Made Miyetti Allah Untouchable Despite Atrocities",
    "summarized_story": "Miyetti Allah groupFormed in the early 1970s and headquartered in Kaduna State, MACBAN was as an advocacy group for Fulani herders for many decades.\nHowever, some notable Nigerians of Fulani extraction and others who are patrons and board of trustees’ members of the association have made it untouchable.\nAccording to Wikipedia, the MACBAN’s board of trustees is always led by the Sultan of Sokoto.\n“The group's board of trustees is led by the Sultan of Sokoto and it receives funding from the board and other donors.\nThe emirs of these emirates compose a part of the group's board of trustees,” information about the group reads."
  },
  {
    "headline": "How Buhari, Jonathan, Sultan, Other Top Nigerians Made Miyetti Allah Untouchable Despite Atrocities",
    "summarized_story": "Miyetti Allah groupFormed in the early 1970s and headquartered in Kaduna State, MACBAN was as an advocacy group for Fulani herders for many decades.\nHowever, some notable Nigerians of Fulani extraction and others who are patrons and board of trustees’ members of the association have made it untouchable.\nAccording to Wikipedia, the MACBAN’s board of trustees is always led by the Sultan of Sokoto.\n“The group's board of trustees is led by the Sultan of Sokoto and it receives funding from the board and other donors.\nThe emirs of these emirates compose a part of the group's board of trustees,” information about the group reads."
  },
  {
    "headline": "Kano Hisbah Prohibits Sharing Of Bridal Photos Of Buhari’s Daughter-in-law, Says It’s Sin",
    "summarized_story": "The Kano State Hisbah Board has prohibited the sharing of the bridal shower photographs f Zahra Bayero, who is getting married to Yusuf, son of the President Muhammadu Buhari.\nThe Islamic police described sharing of the photos online by Muslims as a sin.\nPart of the preparations for the wedding Fatiha involved a bridal shower for Zahra, who wore a western-style white gown to the event held on Tuesday in Abuja.\nHisbah also banned commercial motorcycles and tricycle riders from carrying two women at a time.\nOf recent, the Kano State Hisbah Board banned the use of mannequins to display clothes by tailors, supermarkets and boutique owners in the state."
  },
  {
    "headline": "Kano Hisbah Prohibits Sharing Of Bridal Photos Of Buhari’s Daughter-in-law, Says It’s Sin",
    "summarized_story": "The Kano State Hisbah Board has prohibited the sharing of the bridal shower photographs f Zahra Bayero, who is getting married to Yusuf, son of the President Muhammadu Buhari.\nThe Islamic police described sharing of the photos online by Muslims as a sin.\nPart of the preparations for the wedding Fatiha involved a bridal shower for Zahra, who wore a western-style white gown to the event held on Tuesday in Abuja.\nHisbah also banned commercial motorcycles and tricycle riders from carrying two women at a time.\nOf recent, the Kano State Hisbah Board banned the use of mannequins to display clothes by tailors, supermarkets and boutique owners in the state."
  },
  {
    "headline": "Kano Hisbah Prohibits Sharing Of Bridal Photos Of Buhari’s Daughter-in-law, Says It’s Sin",
    "summarized_story": "The Kano State Hisbah Board has prohibited the sharing of the bridal shower photographs f Zahra Bayero, who is getting married to Yusuf, son of the President Muhammadu Buhari.\nThe Islamic police described sharing of the photos online by Muslims as a sin.\nPart of the preparations for the wedding Fatiha involved a bridal shower for Zahra, who wore a western-style white gown to the event held on Tuesday in Abuja.\nHisbah also banned commercial motorcycles and tricycle riders from carrying two women at a time.\nOf recent, the Kano State Hisbah Board banned the use of mannequins to display clothes by tailors, supermarkets and boutique owners in the state."
  },
  {
    "headline": "Islamic New Year: Jigawa, Kebbi, Oyo declare Monday public holiday",
    "summarized_story": "Jigawa, Kebbi, Oyo, Osun states have declared Monday as a public holiday to mark the start of Islamic new year First Muharram Hijra 1443AH.\nAdvertisementMuhammad Badaru, governor of Jigawa, in a statement urged residents to pray for the state and the country.\n“The period of the Islamic New Year should remind all people of the countless favours bestowed on them by the Almighty God,” the statement reads.\nSeyi Makinde, governor of Oyo, in a statement signed by Olubamiwo Adeosun, secretary to the state government, asked Muslims and people of other religions to use the holiday to pray for the peace, unity and growth of the state and the country.\nAdvertisementGboyega Oyetola, governor of Osun, in a statement signed by Tajudeen Lawal, commissioner for home affairs, on Friday in Osogbo, enjoined both Muslims and people of other religions to use the holiday to pray for the growth and development of the state and Nigeria as a whole."
  },
  {
    "headline": "Islamic New Year: Jigawa, Kebbi, Oyo declare Monday public holiday",
    "summarized_story": "Jigawa, Kebbi, Oyo, Osun states have declared Monday as a public holiday to mark the start of Islamic new year First Muharram Hijra 1443AH.\nAdvertisementMuhammad Badaru, governor of Jigawa, in a statement urged residents to pray for the state and the country.\n“The period of the Islamic New Year should remind all people of the countless favours bestowed on them by the Almighty God,” the statement reads.\nSeyi Makinde, governor of Oyo, in a statement signed by Olubamiwo Adeosun, secretary to the state government, asked Muslims and people of other religions to use the holiday to pray for the peace, unity and growth of the state and the country.\nAdvertisementGboyega Oyetola, governor of Osun, in a statement signed by Tajudeen Lawal, commissioner for home affairs, on Friday in Osogbo, enjoined both Muslims and people of other religions to use the holiday to pray for the growth and development of the state and Nigeria as a whole."
  },
  {
    "headline": "EXCLUSIVE: Obasanjo travels to Benin Republic, seeks soft landing for Igboho",
    "summarized_story": "Former President Olusegun Obasanjo was in Benin Republic in the first week of August, 2021, TheCable has learnt.\nHe was said to have travelled to Benin Republic on the guise of condoling with Nicephore Soglo who recently lost his wife – Roseline Soglo.\nAdvertisementSoglo was president of Benin Republic from 1991 to 1996.\nAdvertisement“Former President Obasanjo travelled to Zanzibar on August 1.\nAdvertisementAn aide of Obasanjo confirmed the former president was in Benin Republic."
  },
  {
    "headline": "EXCLUSIVE: Obasanjo travels to Benin Republic, seeks soft landing for Igboho",
    "summarized_story": "Former President Olusegun Obasanjo was in Benin Republic in the first week of August, 2021, TheCable has learnt.\nHe was said to have travelled to Benin Republic on the guise of condoling with Nicephore Soglo who recently lost his wife – Roseline Soglo.\nAdvertisementSoglo was president of Benin Republic from 1991 to 1996.\nAdvertisement“Former President Obasanjo travelled to Zanzibar on August 1.\nAdvertisementAn aide of Obasanjo confirmed the former president was in Benin Republic."
  },
  {
    "headline": "Afegbua: Why I openly campaigned against Obaseki's reelection",
    "summarized_story": "Kassim Afegbua, spokesman of Ibrahim Babangida, has given reasons for campaigning against the reelection of Godwin Obaseki, governor of Edo, during the 2020 gubernatorial election in the state.\nWhen he was brought forward as a gubernatorial candidate, I publicly objected that I was not going to support him in 2016.\nBut others would pretend and hide and benefit from the largesse that he’s bringing, I said no,” he said.\nIf there is an aspirant, and you brought someone because he’s a state governor with state funds to spend, I don’t think that’s the right thing to do.\nOftentimes there are still threats because I criticise government for not doing the right thing,” he added."
  },
  {
    "headline": "Olumide Soyombo: The journey from startup founder to investment mogul",
    "summarized_story": "The early daysAt first, being a doctor was all Soyombo wanted to be until he was given a personal computer.\nAfter his first degree, Soyombo went on to get a master’s degree in business and information technology from Aston Business school.\nSo they created Leadpath as an investment vehicle to invest in startups, at first the approach was to invest $25,000 – $100,000 in local tech startups, similar to the Y-combinator accelerator model.\nThe bitter taste of how the founder handled the first company didn’t allow Soyombo to invest in the second company.\nWhen he thinks about the future, Soyombo is excited about the fact that the African tech ecosystem is maturing."
  },
  {
    "headline": "MTN finally repatriates 2020 dividend from Nigeria after forex crisis",
    "summarized_story": "South Africa’s MTN Group has repatriated its last year’s dividend of around $280 million (R4.2 billion) from its local unit in Nigeria.\nRespite in U.S. court caseIn addition to the news from Nigeria, MTN also revealed “positive developments” in a United States court case related to the group and its subsidiaries, MTN Afghanistan and MTN Dubai.\nIn Nigeria, MTN, through its local unit, has earmarked ₦600 billion ($1.5 billion) over the next three years to expand broadband access in Africa’s most populous economy.\nMobile subscribers decline in NigeriaFor MTN Nigeria, half-year 2021 results show that service revenue increased by 24.1% year-on-year, despite the number of its mobile subscribers declining by 7.6 million (nearly 10%).\nMTN Nigeria aims to sustain “double-digit service revenue growth ahead of inflation, driving 4G and rural network expansion,” Toriola said."
  },
  {
    "headline": "Can mobile applications help solve Africa's healthcare access problem?",
    "summarized_story": "Without discovering the mobile app, he could easily have been one of the more than 400,000 Africans malaria killed in 2019.\nZuri Health mobile app.\nArthur Ikechukwu Anoke and Daisy Isiaho, co-founders of the mobile app, Zuri Health.\nGovernmental policies will help hold digital healthcare companies accountable and protect the information and data of citizens that use the technologies.\nYet it’s fundamental if we should achieve the Sustainable Development Goals,” said Daisy Isiaho, Zuri Health Co-founder and Chief Product Officer."
  },
  {
    "headline": "Inconsistent policies are killing African startups",
    "summarized_story": "On 18 December, 2015 the CBK again issued Banking Circular No 14 of 2015, which cautioned, ‘all financial institutions against dealing in virtual currencies or transacting with entities that are engaged in virtual currencies.\nFinancial institutions are expressly advised not to open accounts for any person dealing in virtual currencies such as Bitcoin.\nDigital Tax policies in South Africa, Nigeria, Uganda and KenyaSouth Africa was the first, in 2014, to tax digital services by imposing a 14% value added tax (VAT) on digital imports.\nThis same proposal for digital tax was only shut down by the Benin Government after a peaceful protest was staged by its people.\nThis has not been the case however – digital tax policies and laws have mainly been used to restrict digital activity of citizens, infringing on their digital rights."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "African payments startup, Flutterwave, has announced the appointment of Jimmy Ku as the Head of US Growth."
  },
  {
    "headline": "Nigerian IT company, Decagon, raises $1.5 million seed round to train software engineers",
    "summarized_story": "Share this article:Nigerian IT company, Decagon, has raised $1.5 million in a seed round to support its mission of transforming exceptional software engineers, many of whom come from underrepresented backgrounds.\nKepple Africa and Timon Capital led the round, with investments from Paul Kokoricha — ACA Managing Partner — and Tokyo-based UNITED Inc.Additionally, it has raised a $25 million student loan financing facility.\nAdvertisementFounded in 2018 by Chika Nwobi (CEO), Decagon trains and connects engineers to work remotely with local and international companies.\nHowever, if the trainees cannot afford the programme, student loan financing will cover the cost.\nDecagon claims to be the first in Nigeria to provide students with such merit-based loan financing."
  },
  {
    "headline": "MainOne’s new data centre could usher in exciting connectivity age in Ghana",
    "summarized_story": "MainOne is not resting on its laurels, as MDXi announced its data centre facility expansion to Appolonia City in Greater Accra, Ghana.\nMainOne’s data centre launch in GhanaMainOne’s past initiatives suggest launching its data centre in Ghana as a natural progression that aligns with its connectivity ambitions.\nIt reportedly features private data centre suites, precision cooling, and enterprise-grade 24×7 multi-level security and video surveillance.\nAfricanus Mensah, Chairman, MainOne Ghana, believes that the data centre will impact Ghana’s business growth and human capital development.\nWhile MainOne’s data centre could offer several benefits for businesses and individuals in Ghana, this is only one part of the puzzle."
  },
  {
    "headline": "MVX’s seed round, Cellulant’s Ghana licence, Revio’s seed round",
    "summarized_story": "Source TechCrunchNigerian digital freight company, MVX, has raised a $1.3 million seed round to scale its operations, hire staff, and improve its technology.\nThe freight company launched MVXtransit, a digital freight booking platform that helped cargo owners find deals on moving containers.\nTingg is a digital payments network that allows businesses and their customers to accept and make payments easily.\nThis announcement is coming after Cellulant was granted a Payment Services Provider (PSP) licence by the Central Bank of Ghana (CBG).\nRevio claims it supports all currencies and integrates with the African payments startup, Flutterwave, to allow its SaaS clients to sell their products to all African customers."
  },
  {
    "headline": "Customs recruitment: Edo govt charges 72 shortlisted indigenes to show up for screening – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has urged 72 shortlisted indigenes who failed to show up for the Nigeria Customs Service (NCS) final screening for its recruitment exercise, to do so tomorrow, Saturday, August 6, 2021, in Abuja, the Federal Capital Territory (FCT).\nIn a statement, the Chief of Staff to Edo State Governor, Osaigbovo Iyoha, said of 80 Edo indigenes invited for the NCS screening in Gwagwalada, Abuja, only eight (8) participated in the screening, which took place on August 2, 2021.\nHe urged the 72 other applicants yet to take part in the screening to present themselves for the exercise in Gwagwalada, Abuja on Saturday, August 6, 2021, so that the state does not lose its 72 slots in the recruitment exercise."
  },
  {
    "headline": "Edo govt partners firm to boost trade, entrepreneurship devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has finalized plans for a partnership with OZE, an international digital business firm, to boost trade and entrepreneurship development in the state.\nAccording to Uwaibi, “It was observed that the rate of default in facilities supported by OZE to MSMEs is minimal.\n“We want MSMEs in the state to improve on how to keep records of activities in their businesses, as this will benefit their business.\nWe will need them to work with us to create more opportunities for MSMEs in Edo to access facilities.\nOne of the huge challenges with the entrepreneurs in Nigeria today is having accurate records."
  },
  {
    "headline": "Oba Ewuare Welcomes Quadruplets – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- The Benin monarch, His Royal Majesty, Oba Ewuare II, has welcome Quadruplets from his fifth wife, Queen (Oloi) Esosa Ewuare II into the Benin Royal family.\nThe traditional ruler made the announcement at 4:57p.m at his palace on Friday in Benin City, amidst jubilation from guests.\nQueen (Oloi) Aisosa Ewuare II is the youngest among the wives of the Oba of Benin.\nThe brief Ceremony coincided with the visit of National executives of Immaculate Conception College, ICC, Benin City which is Oba Ewuare II Alma-mater.\nJohn Osa- Omoregie who thanked the Benin monarch for his support towards the development of the school and sued for more support."
  },
  {
    "headline": "Obaseki assures residents of more accessible roads, other developmental projects – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has assured residents that his government will sustain investment in road construction and other developmental projects, to open up the state for increased economic activities.\nAccording to him, “We are going to make sure that our farmers have good access roads to their farms; to enable them convey their farm produce to various markets for sales.\n“We want our farmers to earn from their labour and will put everything in place for them to realise their dreams.\nEarlier, president of the association hailed the governor for the numerous infrastructural projects executed by his administration across the state.\nIgboin further commended Governor Obaseki for his intervention in the communal clash between Sabongida-Ora (Evbiobe) and Uhonmoro-Ora, noting that his physical presence during the crisis aided speedy resolution of the crisis."
  },
  {
    "headline": "Food security: Six Nigerian entrepreneurs win N120 million in WFP’s innovation challenge",
    "summarized_story": "As part of efforts towards achieving zero hunger in Nigeria by 2030, six young Nigerian entrepreneurs have received N120 million to support their ideas.\nThe beneficiaries, whose innovations are targeted at improving food production, packaging and distribution, among others, were winners of a competition organised by the United Nations World Food Programme (WFP).\nAccording to a statement issued on Friday by the UN agency, the competition was tagged zero hunger sprint and shared with PREMIUM TIMES by its national communications officer, Kelechi Onyemaobi.\n“That became the big thinking behind the Zero Hunger Sprint; a competition calling on Nigeria’s innovators to bring forward concrete ideas that help us find solutions to hunger.\nThe pitch showcased the incredible talent, energy and dynamism of young Nigerian entrepreneurs– and the Zero Hunger Roundtable is trying to harness this energy in a way that is socially beneficial and sustainable in addressing hunger challenges.”ADVERTISEMENT"
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Report says Nigeria experiencing religious genocide under Buhari",
    "summarized_story": "A joint report by the International Committee on Nigeria and the International Organisation for Peace Building and Social Justice has said Nigeria is currently experiencing religious genocide.\nThe report said 34,233 other Nigerians were killed extrajudicially by state actors, including the police, military and others.\nThe report regretted what it described as the “breakdown of the rule of law, spiraling violence, atrocities against targeted religious groups and innocent civilians and the apparent impunity of the perpetrators” in Nigeria.\nKwashi, in the foreword, said the report captured the details of atrocities and abuse in Nigeria, describing it as timely.\nKwashi said, “Incidents of violence towards Christians, many of whom are farmers, by Islamic militants have been allowed to continue for too long."
  },
  {
    "headline": "Sterling launches ‘I Go Trade’ to simplify access to loans for micro-traders",
    "summarized_story": "The product will provide artisans and other small business owners across communities with quicker access to low-interest and collateral-free loans up to N300,000.\n“Across many institutions nationwide, getting a loan requires stringent processes and heavy paperwork which several small business owners find discouraging,” said Atilola.\nCustomers, especially small business owners, traders, and artisans can get loans at low-interest rates with no collateral and without having to physically visit the bank.\nCustomers can access ’I Go Trade’ by engaging any Sterling agent nearest to them.\nTo find out more, please visit the nearest Sterling Bank branch or agent near you."
  },
  {
    "headline": "Hijrah 1443 AH: Osun govt declares Monday as public holiday",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun State governor, Mr Adegboyega Oyetola, has declared Monday, August 9 as public holiday in commemoration of Hijrah, 1443 AH.\nThis is contained in a statement issued and signed by the state Commissoner for Home Affairs, Hon.\nTajudeen Olaniyi Lawal.\nOyetol while congratulating the Muslim Ummah on the occasion of this year’s Hijirah, also enjoined the citizens to use the period of the holiday to pray for the growth and development of the State of Osun and Nigeria as a whole."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Tsaro: An Sauya Sansanin ‘Yan Bautar Kasa Na Kaduna Da Ke Hanyar Abuja",
    "summarized_story": ""
  },
  {
    "headline": "Wasu Amurkawa Na Yunkurin Kitsa Labarai Don Bata Sunan Kasar Sin",
    "summarized_story": ""
  },
  {
    "headline": "Amurka Ta Sake Tsoma Baki Cikin Harkokin Yankin Hong kong Na Kasar Sin",
    "summarized_story": ""
  },
  {
    "headline": "Shugaban Zambia Ya Kaddamar Da Sabon Filin Jirgin Saman Da Kasar Sin Ta Samar Da Kudin Gina Shi",
    "summarized_story": ""
  },
  {
    "headline": "Annobar Cutar COVID-19 Ta Kara Yaduwa A Sassan Afirka, Saboda Ba A Yi Wa Al’ummomin Nahiyar Alluran Rigakafi Kamar Yadda Ake Fata Ba",
    "summarized_story": ""
  },
  {
    "headline": "BBNaija6: Boma crushes over Jackie B, plans to date her after show",
    "summarized_story": "BBNaija6: Boma crushes over Jackie B, plans to date her after showBBNaija6: Boma crushes over Jackie B, plans to date her after showBig Brother Naija Shine Ya Eye housemate, Boma, has revealed that he plans to date Jackie B after the show, describing her as an ‘outside project’.\nBoma made this known this known in a conversation with Cross after the Jacuzzi Party on Friday night, where they discussed his (Boma’s) friendship with Jackie B.\nCross told Boma, “You’ll enjoy Jackie B but she wouldn’t want to do it in the show.\nHowever, outside is where you’ll enjoy her.”Boma, however, pointed out that he wants to have Jackie B but she would want to have him ‘codedly’“Jackie B is very funny.\nHe added, “Jackie B is an outside project, I don’t need to even talk to you here."
  },
  {
    "headline": "BBNaija6: Boma crushes over Jackie B, plans to date her after show",
    "summarized_story": "BBNaija6: Boma crushes over Jackie B, plans to date her after showBBNaija6: Boma crushes over Jackie B, plans to date her after showBig Brother Naija Shine Ya Eye housemate, Boma, has revealed that he plans to date Jackie B after the show, describing her as an ‘outside project’.\nBoma made this known this known in a conversation with Cross after the Jacuzzi Party on Friday night, where they discussed his (Boma’s) friendship with Jackie B.\nCross told Boma, “You’ll enjoy Jackie B but she wouldn’t want to do it in the show.\nHowever, outside is where you’ll enjoy her.”Boma, however, pointed out that he wants to have Jackie B but she would want to have him ‘codedly’“Jackie B is very funny.\nHe added, “Jackie B is an outside project, I don’t need to even talk to you here."
  },
  {
    "headline": "Music star, Dr. Money loses mother, announces burial plans",
    "summarized_story": "By AZUH AMATUSNigerian-born international music star, Justin Kingland globally known as Dr. Money has lost his dear mother, Mrs. Pauline Ezeani Kingland to the cold hands of death.\nThe deceased aged 74, according to a burial programme sent to DAYLIGHT and signed by Dr. Money will be buried on Monday, September 20, 2021, at the family’s compound in Agulu, Anambra State.\nBelow are details of the forthcoming burial as signed by Dr. Money.\n1 DR MONEY EZEANI STREET, IFITEANI VILLAGETUESDAY 21ST OF SEPTEMBER 2021RECEIVING OF GUEST’S.\nDr. Justin Okechukwu Kingland (DrM) (H.E) FOR THE FAMILYShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Music star, Dr. Money loses mother, announces burial plans",
    "summarized_story": "By AZUH AMATUSNigerian-born international music star, Justin Kingland globally known as Dr. Money has lost his dear mother, Mrs. Pauline Ezeani Kingland to the cold hands of death.\nThe deceased aged 74, according to a burial programme sent to DAYLIGHT and signed by Dr. Money will be buried on Monday, September 20, 2021, at the family’s compound in Agulu, Anambra State.\nBelow are details of the forthcoming burial as signed by Dr. Money.\n1 DR MONEY EZEANI STREET, IFITEANI VILLAGETUESDAY 21ST OF SEPTEMBER 2021RECEIVING OF GUEST’S.\nDr. Justin Okechukwu Kingland (DrM) (H.E) FOR THE FAMILYShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "You can never be father of new Nigeria: Afenifere knocks Babangida",
    "summarized_story": "Afenifere, the Yoruba socio-cultural group, said former Nigerian president Ibrahim Badamasi Babangida (IBB) has lost the opportunity to be the father of a new Nigeria.\nAfenifere stated this on Saturday while reacting to the excuse given by IBB for annulling the June 12 election won by M.K.O Abiola.\nBabangida, in an interview on Friday, had said he annulled the election to prevent a violent coup d’etat.\nHowever, Afenifere described his comments as an insult on the intelligence of Nigerians.\n“He lost the opportunity of being the hero of democracy and father of a new Nigeria, an eternal regret that no whitewashing on television can redeem."
  },
  {
    "headline": "All Americans ordered to leave Afghanistan",
    "summarized_story": "The U.S. embassy in Kabul on Saturday called on American citizens to leave Afghanistan as soon as possible.\nThe Embassy said all American citizens should leave Afghanistan over security issues in the country.\nAccording to a statement, the American staff of the embassy in Kabul that can work remotely had already departed Afghanistan.\n“The U.S. Embassy urges U.S. citizens to leave Afghanistan immediately using available commercial flight options.\nThe embassy said U.S. citizens in Afghanistan could use repatriation loans if they experienced difficulties in buying tickets for commercial flights."
  },
  {
    "headline": "Parents Of Abducted Bethel Baptist Students Raise Alarm Over Fate Of 80 Victims Still In Captivity",
    "summarized_story": "Parents of the abducted Bethel Baptist High School students in Kaduna are helpless and confused in the face of their children’s continuing imprisonment in the hands of their kidnappers.\nRecall that bandits raided Bethel Baptist High School, Damishi, Kaduna, in the early hours of Monday, July 5, 2021, abducting 121 students.\nSome of the school’s kids have regained their freedom, while others have fled and another group has been released on medical grounds.\nAccording to one of the abducted students’ parents, who requested anonymity, it is the school’s parents who are bearing the brunt of the state’s student abductions.\nAnother parent of the freed students revealed that he and other parents went through hell before they could afford the kidnappers’ demands for their children’s release."
  },
  {
    "headline": "Police Headquarters Invites YouTube User For Exposing Apostle Suleman’s Money Miracle Scam",
    "summarized_story": "The Force Criminal Intelligence and Investigation Department, Abuja, has invited Israel Balogun, a YouTube user who disclosed a money miracle’session’ done by Apostle Johnson Suleman, founder of Omega Fire Ministries.\n”Apostle Suleman during the said ministrations claimed that he commanded Angels to send money mysteriously to worshippers.\nIf he decides to go ahead to institute a civil action against our client for “defamation of character”, we will be happy to meet him and his miracle money Angels in court.\n“Nigeria is currently facing severe financial and economic challenges, Apostle Suleman should help the country out of her predicament by commanding his “Angels” to assist the country with his so-called miracle money.\nThey stated that Balogun’s action was a case of defamation of character against Apostle Suleman whose church, Omega Fire Ministries has members in 52 countries of the world."
  },
  {
    "headline": "Nigerians Don’t Need To Travel Abroad For Medical Treatment — Chris Ngige",
    "summarized_story": "Nigerians do not need to travel abroad for health care, according to Labour Minister Chris Ngige, because medical treatment at Nigerian hospitals is “fairly Okay.” Meanwhile, his boss, President Muhammadu Buhari, is receiving treatment in London.\nMr Buhari has spent nearly 200 days away from Nigeria on medical tourism since taking office six years ago.\n“What are you going abroad to do, the expertise is here (in Nigeria),” Mr Ngige said.\n“On an average note, medical treatment here is fairly okay as far as I am concerned,” he added.\nFurthermore, the State House Clinic has been downgraded, according to President Buhari’s spokesperson, Femi Adesina, who also stated that Mr Buhari travels abroad for medical care because he only trusts his long-time London-based doctors who are familiar with his medical history and records."
  },
  {
    "headline": "Police Exhume Corpse Of Kidnapped And Killed Victim In Rivers Community",
    "summarized_story": "Four accused kidnappers led Rivers State Police Command officers to a shallow cemetery where one of their victims was buried after he was kidnapped.\nThe victim, a pastor from Rivers State, was kidnapped by the suspects in May 2021.\nHe was allegedly executed ten days after being kidnapped and buried in a small grave in the Lourre hamlet of Khana local government area of the state.\nNnamdi Omoni, the state police command’s spokesman, told journalists that the “suspect also collected the sum of N5000,000” from the victim’s family.\nOne of the suspects claims that the preacher they hired after posing as a passenger was slain when he recognized one of them."
  },
  {
    "headline": "2023: Atlast, ex-President, IBB, reveals Nigeria’s next President",
    "summarized_story": "Nigeria’s former Military President between 1985 and 1993, Ibrahim Babangida, has revealed the quality and age limit of the country’s next President he desires.\nThe former President said, “That is a person, who is very versed in economics and is also a good politician, who should be able to talk to Nigerians and so on.\n“Those were the major qualities the new Nigerian President must possess,” former Military President, said on Friday, as the country prepares to elect another leader to succeed President Muhammadu Buhari, who was incidentally shoved aside close to 40 years ago.\n“If you get a good leadership that links with the people and tries to talk with the people; not talking on top of the people, then we would be okay“I have started visualising a good Nigerian leader.\nCompetence above ethnicity should be of utmost importance when choosing the next President."
  },
  {
    "headline": "Indigenes hail Onyejeocha as FG commissions erosion, flood control project in Abia (PICTURES)",
    "summarized_story": "It was a moment of jubilation amidst deep relief day the federal government commisioned and handed over erosion and flood control works built in Isuikwuato community of Abia state.\nOnyejeocha, representing Isuikwuato/Umunneochi Federal Constituency, who attracted the project, paid glowing tribute to the president for approving the project for her constituency.\nHe enjoined the communities to take ownership of the project and ensure its maintenance and sustainability.\n“These will help to ensure that the resources committed to the project by the federal government were not a waste,” he said.\nThey expressed joy that security had improved appreciably in the area since the completion of the project."
  },
  {
    "headline": "Covid-19 resurgence: Danger as citizens jettison protocols",
    "summarized_story": "The deadlier Delta variant is recognised by the World Health Organisation (WHO) as a variant of concern, given its increased transmissibility.\n“When it comes, it is likely to be more severe than the second wave, just as the second was higher than the first wave.\nSo, please get vaccinated.’’The expert stated further that the third wave might double the number of cases recorded during the second wave.\nFor every sick person in the first wave, we had 1.6 times the number in the second wave.\n“3,924,000 doses of Oxford/AstraZeneca by end of July or early August 2021 from the COVAX facility, 3,930,910 doses of Pfizer-Bio-N Tech Covid-19 vaccine in August from the COVAX facility donated by the United States Government, 3,577,860 doses of Pfizer-Bio-N Tech Covid-19 vaccine in Q3 from the COVAX facility, 29,850,000 doses of Johnson & Johnson Covid-19 vaccine by the end of September, that will arrive in batches from the African Union Commission."
  },
  {
    "headline": "Keren’s death: Premiere Academy denies rape allegation -NigPilot",
    "summarized_story": "The Management staff and some members of staff went to commiserate with her.\nOn the 24th June, 4 members of staff went again, but they were denied entry right from the gate of the Estate.\nThe PTA Executives of the school went on the same day and were equally prevented from entering from the gate of the Estate.\nIs the Police PRO of Premiere Academy?\nWhat is the business of the police with what the mother does with the information on the medical report?"
  },
  {
    "headline": "Report of crash exaggerated, Air Peace reacts to Friday’s mishap",
    "summarized_story": "The indigenous carrier, Air Peace, has reacted to Friday’s air mishap involving one of its fleets en route to Ilorin from Abuja, stating that details of the incident were exaggerated.\nWe can confirm that the aircraft in question landed safely, but had a minimal tire burst while taxing.\nThis debunks all the mischievously headlined reports circulating online, which should be disregarded.\nThis kind of sensationalism is bad and was intended to cause panic in the minds of the flying public.\n“Air Peace is committed to providing peaceful connectivity across cities and relentlessly observes the highest standards of safety in its operations,” the statement read."
  },
  {
    "headline": "Army will liberate Nigeria from clutches of terror groups – COAS -NigPilot",
    "summarized_story": "COAS gave this assurance when Members of the 37 Regular Course (RC) of the prestigious Nigerian Defence Academy(NDA) paid him a courtesy call in his office at Army Headquarters, Abuja.\nHe said that they assured the COAS of their unflinching support to the Nigerian Army in the ongoing operations across the theatres.\nThe CIC reassured the COAS that all members of the Course are solidly behind him, as he leads the NA.\nHe extolled the leadership qualities of the COAS, which he disclosed dates back to his days in the NDA.\nGen Ezugwu eulogized members of 33-36RC for their exemplary leadership and mentoring during the formative stage of their military career."
  },
  {
    "headline": "AFRPN to discuss role of diplomacy in the fight against insurgency -NigPilot",
    "summarized_story": "The President, Association of Foreign Relations Professionals of Nigeria (AFRPN) Ambassador Gani Lawal said that the role of diplomacy in the fight against terrorism and insurgency in the West African sub-region will dominate discussion at the association’s third annual lecture/conference slated for Thursday, 29 of July 2021 in Abuja.\nHe said that the annual lecture/conference is designed to interrogate issues of the moment by experienced Foreign Relations Practitioners.\nDr. Lawal who said this at a pre-event press conference in Abuja, also disclosed that the theme of this year’s lecture is “ The Role of Diplomacy in Combating Terrorism and Insurgency in West Africa “.\nHe said that the Association of Foreign Relations Professionals of Nigeria (AFRPN) is made up of retired and serving Nigerian diplomats and all stakeholders in the business of Foreign Relations.\nDalhatu Tafida, former Minister of Foreign Affairs, Prof. Joy Ogwu, Chief of Staff to the President, Prof. Ibrahim Gambari, Foreign Affairs Minister Geoffrey Onyeama amongst other top government functionaries were scheduled to grace the occasion."
  },
  {
    "headline": "Ngige Threatens To Replace Striking Resident Doctors",
    "summarized_story": "﻿ ﻿The Minister of Labour, Dr Chris Ngige, has threatened to replace striking resident doctors if they refuse to return to work by Monday.\nMinister of Health Dr Osagie Ehanire had told journalists in Abuja on Thursday that seven of 12 matters that were raised by the National Association of Resident Doctors (NARD), were the responsibility of state governments.\nThe Labour Minister has, however, vowed to escalate the matter, should they fail to resume work by Monday, the expiration of the 1-week ultimatum he gave them.\n“Avoiding the use of the word ‘sack’, Ngige said; there are other things that are permitted by law.\nRead Also: Why I Won’t Meet With Striking Resident Doctors – Labour Minister"
  },
  {
    "headline": "Enugu, Kaduna, 11 Other Commands Get New Police Commissioners",
    "summarized_story": "The Inspector-General of Police, Usman Baba, has ordered the posting of Commissioners of Police to take over the leadership in 13 state commands, including the Federal Capital Territory (FCT).\nMr Frank Mba, who is the Force Public Relations Officer, announced this in a statement on Friday in Abuja.\nThe affected state commands and Commissioners of Police posted include Niger State Command, CP Monday Kuryas; Kwara State Command, CP Emienbo Assayamo; Nasarawa State Command, CP Soyemi Adesina; Benue State Command, CP Akingbola Olatunji; FCT Police Command, CP Babaji Sunday; and Taraba State Command, CP Abimbola Shokoya.\nOthers are Kogi State Command, CP Arungwa Udo; Kaduna State Command, CP Abdullahi Mudashiru; Jigawa State Command, CP Aliyu Tafida; Enugu State Command, CP Abubakar Lawal; Cross River State Command, CP Alhassan Aminu; Bayelsa State Command, CP Eworo Echeng; and Kebbi State Command, CP Musa Baba.\nHe also asked those in the affected states to cooperate with their new Commissioners of Police for efficient service delivery."
  },
  {
    "headline": "Criticising Buhari’s Handling Of Bandits, Secessionists Is ‘Pure Hatred’ – Adesina",
    "summarized_story": "Those accusing the President of handling bandits and terrorists with a softer hand than the way secessionists are being treated have full of hatred, Mr Femi Adesina has said.\n“It amazes, even confounds, to hear some people say President Muhammadu Buhari should go after Boko Haram terrorists and bandits with the same gusto he has displayed against separatists in the country,” he said.\n“Why then do some people claim that certain troublers of the country are being treated with softer hands, than some others?\nAmid the continued outcry that the Nigerian leader had been softer on bandits than separatists, Adesina insisted that President Buhari’s order was carried out without fear or favour.\nAll over the country, terrorists, bandits, kidnappers, all types of criminals are being spoken to in the language they understand."
  },
  {
    "headline": "Strike: Stand Up To Your Responsibilities, Resident Doctors Tell FG",
    "summarized_story": "President of the Nigerian Association of Resident Doctors (NARD) Dr. Uyilawa Okhuaihesuyi has asked the Federal Government to stand up to its responsibilities and pay the salaries of the striking doctors.\nSpeaking on behalf of resident doctors on Channels Television’s Sunrise Daily on Friday, Dr. Okhuaihesuyi criticised the Federal Government for failing to do its own job but rather blaming the doctors for embarking on industrial action.\n“The first thing you’re telling us is that we signed a document we are not honouring it, we need to resume work.\nDr. Ehanire said that seven of 12 matters that were raised by the striking doctors were the responsibility of state governments.\nConsequently, he expects the resident doctors to resume work on Friday and take up these issues with the state governments rather than embark on the nationwide strike as they had done."
  },
  {
    "headline": "Jepchirchir Gives Kenya Back To Back Women’s Marathon Olympic Titles – Channels Television",
    "summarized_story": "Peres Jepchirchir secured back-to-back women’s Olympic marathon titles for Kenya on Saturday timing 2hr 27min 20sec.\nThe 27-year-old two-time half marathon world champion beat compatriot and world record holder Brigid Kosgei (2hr 27:36) whilst USA’s Molly Seidel was third (2hr 27:46).\nI’m so, so happy because we win as Kenya,” said Jepchichir.\n“I’m happy for my family.\nI’m happy for my country.”Jepchirchir succeeds disgraced fellow Kenyan Jemima Sumgong, who won in 2016 in Rio to become Kenya’s first female marathon champion."
  },
  {
    "headline": "UPDATED: Police arrest second suspected killer of 50-year old woman in Delta",
    "summarized_story": "The Police in Delta state have arrested the 2nd suspect, a 20 year old man, Akpoghene Shoemaker, who killed a 50 year old lady in Umeh community in Isoko south council for ritual purposes.\nActing on a tip off, the police together with local vigilante and some community leaders arrested the suspect in kwale town.\nThe suspect who alongside his friend killed, raped and removed parts of the deceased woman who used to sell pepper in Umeh market has been on the run since perpetrating the crime.\nThe police revealed that effort to arrest the remaining suspect who contracted these two to carry out killing by paying them the sum of N100,000 is underway"
  },
  {
    "headline": "Gambian President, Adama Barrow, commends Nigeria’s drug war campaign",
    "summarized_story": "President of Gambia, Adama Barrow, has commended Nigeria’s commitment to the war against illicit drug trafficking and abuse, even as he called for more collaboration among anti-drug law enforcement agencies in Africa and the world at large.\nHe gave the commendation at the State House in Banjul when he received Chairman/Chief Executive of the National Drug Law Enforcement Agency, NDLEA, Brig.\nAccording to him, “drug cartels work as a network and are linked; as such, institutions fighting them must also partner and work together.\nThe whole of Gambia has an important guest in Gen. Marwa who we have heard so much about his leadership traits.\nThe NDLEA Chairman was accompanied on the visit by Nigeria’s High Commissioner to Gambia, Muhammed Manu and other top officials of the Agency."
  },
  {
    "headline": "One killed, three others Kidnaped in Ekiti",
    "summarized_story": "About three Occupants of a Lexus 330 Jeep between Ewu-Ekiti and Ayetoro-Ekiti in Ido/Osi Local Government Area of Ekiti State were on Friday evening abducted while one was found dead on the spot.\nThe identities of the victims is yet to be ascertained, but TVC NEWS gathered that they were whisked away to an unknown destination as their vehicle, a Lexus Jeep with registration number: LAGOS- KRD 264 GV was parked facing the bush without occupants, while the only person found at the scene of the incident was lifeless.\nIt was obvious though that the passengers were guests at a Ceremony in the area and were returning to their destination when they were accosted by some suspected gunmen.\nIt would be recalled that the traditional ruler of the village, (Ewu-Ekiti), Oba Adetutu Ajayi, in Ilejemeje Local Government Area of Ekiti State, was reportedly shot by bandits on April the 10th 2021, while on June the 10th, 2021, two hotel workers in Ayetoro-Ekiti were kidnapped, and Guards at the Hotel had Machete wounds and still recuperating at an undisclosed Heath facility in the StateWhen Contacted, the PPRO of the State Police Command Says he is yet to be briefed on the situation, but will issue a statement once he gets information from appropriate Quarters"
  },
  {
    "headline": "Tokyo Olympics: US Beat France 87-82 to Claim Fourth Straight Gold Medal in Men’s Basketball",
    "summarized_story": "Tokyo Olympics: US Beat France 87-82 to Claim Fourth Straight Gold Medal in Men’s BasketballTeam USA secured a fourth straight Olympic gold medal as they beat France 87-82 in Tokyo.\nFrance made a late, fourth-quarter run, but came up just short as the US made their shots at crucial moments to claim a seventh gold medal out of the last eight on offer.\nThe 32-year-old led by example throughout the tournament and scored 23 points in their final group game against the Czech Republic to surpass Carmelo Anthony as Team USA’s all-time leading scorer.\nI’m bonded to these guys for life.”Lauren Holiday, a two-time Olympic gold medallist in women’s football, expressed her pride as husband Jrue added to his NBA title success with Milwaukee Bucks.\nThere was also high praise for Durant from Stephen A. Smith who described him as “Team USA’s Captain America”."
  },
  {
    "headline": "In England, Hundreds of Vaccinated People Hospitalised with Delta",
    "summarized_story": "Hundreds of fully vaccinated people in England have been hospitalised with the highly contagious Delta coronavirus variant, scientists said on Friday.\nIn its latest COVID-19 update, Public Health England (PHE) also warned there were early signs that people who have been inoculated may be able to transmit the Delta strain as easily as those who have not received any jabs.\nFrom July 19 to August 2, 55.1 percent of the 1,467 people hospitalised with the Delta variant were unvaccinated, PHE said, while 34.9 percent – or 512 people – had received two doses.\n“As more of the population gets vaccinated, we will see a higher relative percentage of vaccinated people in hospital,” PHE said.\n“Some initial findings … indicate that levels of virus in those who become infected with Delta having already been vaccinated may be similar to levels found in unvaccinated people,” PHE said."
  },
  {
    "headline": "Israel Attacks Hamas Sites in Gaza in Response to Fire Balloons",
    "summarized_story": "Israeli aircraft bombed Hamas sites in the Gaza Strip on Saturday in response to incendiary balloons launched from the Palestinian enclave, Israel’s military said.\nNew Press also reported that three sites were targeted by Israel including Beit Hanoun and Jabalya.\nThe incendiary balloons have been used previously in response to the tightening of Israel’s blockade on the coastal enclave, after new restrictions were issued during Israel’s bombardment of Gaza in May.\nBut on Friday, balloons were again launched from Gaza, causing at least four brush fires in areas near the Israel-Gaza frontier.\nThe Israeli military said its air raids were in “response to continual launches of incendiary balloons from Gaza into Israel throughout the day”."
  },
  {
    "headline": "Knife-wielding Man Injures 10 on Tokyo Train",
    "summarized_story": "A man attacked fellow passengers with a knife on a Tokyo commuter train late on Friday, injuring 10.\nViolent crime is rare in Japan and tight security measures are in place in Tokyo, which is hosting the Olympics.\nThe man attacked passengers on a train near Seijogakuen station at about 20:40 (11:40 BST) on Friday.\nOne witness, who was on the train, told NHK news that people suddenly started running towards him, fleeing from one car to another.\nIn 2019, a man attacked a group of schoolchildren waiting for a bus in Kawasaki."
  },
  {
    "headline": "Aide Who Says New York Governor Cuomo Groped Her Files Criminal Complaint",
    "summarized_story": "Andrew Cuomo of groping her breast at the governor’s state residence has filed a criminal complaint against him, the Albany County Sheriff’s office said Friday.\nThe woman also told investigators with the attorney general’s office that Cuomo once rubbed her rear end while they were posing together for a photo.\nThe sheriff’s office didn’t immediately provide a copy of the complaint.\nAccording to the woman, Cuomo pulled her in for a hug as she prepared to leave the governor’s office at the mansion.\nTold that “you’re going to get us in trouble,” Cuomo replied, “I don’t care,” and slammed the door shut."
  }
]