[
  {
    "headline": "IPOB threatens fresh sit-at-home, banks, others shut despite suspension",
    "summarized_story": "DESPITE the suspension of the sit-at-home order in the South-East by the proscribed Indigenous People of Biafra, activities were grounded in some parts of the region.\nThis was as the IPOB made a U-turn and threatened to recommence the ‘every Monday’ sit-at-home protest starting from August 23.\nIn Abakaliki, the Ebonyi State capital, commercial banks and other businesses remained shut as the sit-at-home order was observed irrespective of the suspension of the directive.\nThey may be telling us that the sit-at-home order has been cancelled so that we will come out and be harmed.\nIPOB makes U-turn, threatens fresh protestIn a related development, the IPOB has threatened to recommence the ‘every Monday’ sit-at-home protest, starting from August 23."
  },
  {
    "headline": "Plateau killings: Northern groups warn FG, 13 more suspects arrested",
    "summarized_story": "The surveillance helicopter is expected to provide support to the ground troops carrying out coordinated operations in the hotspots.\n“The IGP noted that 13 additional suspects have been arrested in connection with the incident, bringing the total number of arrested persons to 33.\nWe will go after others because we don’t want to allow this kind of thing again to come back to the people of Plateau State.\nThe people of Plateau State have been living in peace for a while now.\n“I want to assure the people of Plateau State that they should not be sacred."
  },
  {
    "headline": "Nasarawa Govt to begin demolition of illegal structures — Official",
    "summarized_story": "The Nasarawa State Urban Development Board (NUDB) says it will begin demolition of over 200 illegal structures in Lafia, from August 17.\nThe Managing Director (MD) of the board, Mr Wada Yahaya, made the disclosure while briefing newsmen in Lafia on Monday.\nAccording to him, the board had served the owners of the structures three different notices in line with the state’s urban development laws.\nYahaya said that apart from non registration of some of the structures, others were built in complete violation of the approval given.\nHe explained that apart from Lafia, other structures were also marked for demolition in other parts of the state for same offence."
  },
  {
    "headline": "Police rescue abducted APC Chairman in Niger",
    "summarized_story": "The Police Command in Niger State, on Saturday, confirmed that it had rescued the abducted APC Zone C Chairman, Aminu Bobi, from his abductors.\nThe command’s Public Relations Officer (PPRO), DSP Wasiu Abiodun, disclosed this in a statement issued in Minna on Saturday.\nAbiodun said that the chairman was rescued on Friday at about 3:30 pm.\n“The driver was shot on the leg and abandoned by the assailants, while the chairman was abducted,” Abiodun said.\nHe said that the driver was later rescued and taken to the general hospital, Kontagora, where he received medical treatment."
  },
  {
    "headline": "[Breaking] Inferno: Mushin boils as miscreants go on rampage",
    "summarized_story": "By Olasunkanmi AkoniPandemonium has broken along Akinbode Street, off Olateju Street, Mushin, area of Lagos State late Mondy night as houses and vehicles are being torched by people suspected to be miscreants.\nDirector, Lagos State Fire and Rescue Service, Mrs. Margaret Adeseye, who confirmed the development said the miscreants have prevented men of the fire service from gaining access to the inferno scene.\nREAD ALSO:Strange fire guts Secondary School in Akwa IbomAccording to Adeseye, “The Lagos State Fire and Rescue Service command and control room have received an emergency alert that houses and vehicles are being burnt along Akinbode Street, off Olateju Street, Mushin, Lagos.\n“Response teams have been activated to the scene of the inferno.\nHowever, restive youths are hindering access to the scene."
  },
  {
    "headline": "UI to adopt online teaching due to COVID-19 –Registrar",
    "summarized_story": "The management of the University of Ibadan (UI), on Monday, proposed moving teaching and learning, for the rest of the second semester, online due to rising COVID-19 cases and deaths in the country.\n“Management commends all departments engaging in virtual/blended teaching since the commencement of the 2020/2021 Session.\n“All departments are urged to immediately take advantage of existing arrangements and commence virtual/blending teaching.\n“The Directorate of Information Technology and Media Services (ITeMS) and the ERTC are on the ground, available to provide technical support,” the registrar said.\nThe registrar enjoined everyone to take personal responsibility for his/her safety by obeying all COVID-19 safety protocols."
  },
  {
    "headline": "Jos crisis: ECWA advises religious leaders against inciting sermon",
    "summarized_story": "Following the recent killings of some commuters in Jos, the Evangelical Church Winning All (ECWA) has advised religious leaders to desist from inciting sermons and preach peace at all times.\nStephen Panya-Baba, the President of ECWA gave the advice in a statement on Monday in Jos.\nHe urged religious leaders to give sermons that would foster peaceful co-existence among the people rather than one that will further tear the nation apart.\nThis is simply unacceptable“We call on religious leaders to preach peace, unity and togetherness in their sermon; promote issues that will unite rather than divide us,”Panya-Baba advised.\nHe, however, urged security agencies to intensify efforts towards ending insecurity in the state."
  },
  {
    "headline": "Jos massacre, very sad, unfortunate – Gov Mohammed",
    "summarized_story": "Bauchi State Governor, Senator Bala Abdulkadir Mohammed, on Monday, condemned, in strong terms, last Saturday’s attack by Irigwe militia in Jos, Plateau State, on innocent travellers who were returning home after attending the annual Zikr in Bauchi, marking the commencement of the New Islamic year, Hijrah 1443.\nThe governor’s condemnation was contained in a release signed by his Special Adviser (Media), Mukhtar Gidado and made available to DAILY POST in Bauchi.\nAccording to the release, “The governor described the attack, which claimed the lives of 25 persons, as very sad and unfortunate cognizant of the fact that they were innocent citizens travelling peacefully.”Governor Mohammed, however, called for calm among residents, advising people not to take laws into their hands.\nCommending the proactive measures taken by the authorities in Plateau State to forestall further breach of law and order, Mohammed called on security agencies to fish out the perpetrators of the despicable act and bring them to justice.\nHe the prayed that the almighty Allah will give families of the victims and other Nigerians the fortitude to bear this great loss."
  },
  {
    "headline": "Nigerian Army releases images of Boko Haram, ISWAP terrorists after surrender",
    "summarized_story": "The Nigerian Army has provided details of Boko Haram and Islamic State’s West Africa Province (ISWAP) members who surrendered this month.\nNwachukwu confirmed more fighters surrendered with their families at Mafa Local Government Area on 14 August.\nA total of 186, comprising 67 adult males, 54 adult females and 65 children surrendered to troops of Operation HADIN KAI at Forward Operating Base (FOB) Ajiri.\nOn 15 August, the Theatre Command took custody of another batch of fighters, including 4 adult males, 11 adult females and 18 children.\nThe military observed ISWAP has opted for propaganda via AMAQ Terrorists Media Wing to portray itself as a potent force in the North-East."
  },
  {
    "headline": "Buhari wishes Babangida ‘long, healthy life’ as he clocks 80",
    "summarized_story": "President Muhammadu Buhari has felicitated with former Military Head of State, Ibrahim Badamosi Babangida, IBB, on his 80th birthday.\nBuhari wished IBB a “long and healthy life” as he clocked 80.\nBuhari urged Babangida to recommit his efforts towards ensuring Nigeria attains its glory.\n“President Buhari notes that as former military commanders during the war, both retiring as generals, they have mutual interests, great hopes, and expectations in a strong and united Nigeria.\n“President Buhari expresses hope that privileged Nigerians like President Babangida and others like himself will recommit to ongoing efforts to help the nation to reach more glory, progress, and prosperity,” the statement said."
  },
  {
    "headline": "Gov Ikpeazu calls for new Nigerian constitution",
    "summarized_story": "Abia State Governor, Okezie Ikpeazu has re-echoed the call for a new Nigerian constitution, which will evolve from the will of the people and not foisted on Nigerians like the present 1999 Constitution.\nIt was contained in a release issued to journalists in Umuahia, the state capital by Onyebuchi Ememanka, the Chief Press Secretary to Governor Ikpeazu on Monday.\nIkpeazu stated that the major fundamental flaw of the present constitution is that it lacks the ownership of the people which is a key ingredient that clothes Constitutions with the requisite legitimacy.\nThe Governor also faulted the provisions of the present constitution for failing to provide proper qualification for leadership in Nigeria.\nOur present constitution, Ikpeazu noted, is not autochthonous and as such is incapable of commanding the requisite quantum of social mobilizarion required to move forward, a multi ethnic, multi religious, multi lingual and multi cultural country like Nigeria."
  },
  {
    "headline": "Afghanistan: Boko Haram may seize 12 Tucano jets soon – Omokri warns",
    "summarized_story": "Reno Omokri, a former aide to President Goodluck Jonathan has warned that the twelve Super Tucano Jets purchased by the Buhari administration may belong to Boko Haram terrorists very soon.\nReno Omokri was reacting to the current situation in Afghanistan where the Talban took over the government on Sunday.\nRecall that Afghanistan plunged into turmoil as Taliban took over the country yesterday when they invaded Kabul, the nation’s capital.\n“Nigeria bought 12 Super Tucano jets from the US for $593 million.\n“With the way Buhari romances Boko Haram, I just pray Nigeria’s 12 Super Tucano jets will not become their property one day!”"
  },
  {
    "headline": "BBNaija: Kayvee’s exit from show spiritual – Michael",
    "summarized_story": "Big Brother Naija season six housemate, Michael, has said Kayvee’s issue is spiritual.\nRecall that on Monday, Kayvee voluntarily exited the ‘Shine Ya Eye’ season.\nThe organizers said he withdrew due to health reasons.\nSpeaking to other housemates, shortly after the announcement, Michael said “It’s spiritual because that guy was cool, he was coherent and all of a sudden this?\nIt’s spiritual bro.”Meanwhile, Saskay and JMK broke down in tears after the announcement."
  },
  {
    "headline": "Why Sunday Igboho won’t return to Nigeria, by lawyer",
    "summarized_story": "Falola explained it would be a dangerous decision for Igboho to return when he is free from Benin Republic because his life is under threat in Nigeria.\nGiving an update on Igboho’s case, Falola assured he is safe in the Benin Republic.\n“Igboho cannot be left to return back to Nigeria for now because of the destruction of his properties that was witnessed, they are not looking for Sunday Igboho alone but planning to kill him.\n“They are looking for how to kill him and that’s very dangerous to allow him return back to Nigeria.\n“This case has become a global one with many watching the developments, all Yorubas especially in Diaspora, monarchs, traditionalists, others are keenly following the case,” Falola stated."
  },
  {
    "headline": "Reactions trail Kayvee's exit from BBNaija show",
    "summarized_story": "Recall that Pere Pere, head of house announced Kayvee’s withdrawal on Monday while addressing the housematesKayvee withdrew from the show due to health reasons.\nSee reactions below;@Rima, “ This house if you are not mentally strong it will break you.\nI really liked Kayvee was really rooting for him.\n“@avenuecyprus, “ Sad day in #BBNaija, it’s always sad when a housemate has to withdraw from the show due to ill health.\nA show as big as #BBNajia should have professionals housemates can talk to.”@sanmek, “ We are proud of you KayVee."
  },
  {
    "headline": "VIDEO: Taliban take over Afghan Presidential palace",
    "summarized_story": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator."
  },
  {
    "headline": "VIDEO: Kayvee withdraws from BBNaija show",
    "summarized_story": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator."
  },
  {
    "headline": "ADF lauds Enugu, House on anti-open grazing bill",
    "summarized_story": "From Geoffrey Anyanwu, EnuguAlaigbo Development Foundation (ADF) yesterday lauded Enugu government and House of Assembly for the legislation to ban open grazing in the state.\nIn respond to the governors mandate, Leader of the Enugu House of Assembly, Ikechukwu Ezeugwu introduced the anti-open grazing bill on August 10.\nA statement by ADF spokesman, Abia Onyike, yesterday, commended Enugu state government and lawmakers for taking proper steps to ban open grazing.\n“We call on other states in the region to emulate Enugu state.\nThe communities should wake up and apply their customary laws to secure their lands, economic crops and natural resources."
  },
  {
    "headline": "Plateau killing: Enough of empty threats, Northern elders tell Buhari, Lalong",
    "summarized_story": "Piqued by the recent killings in Plateau State, the Northern Elders Forum (NEF) has challenged President Muhammadu Buhari and Plateau Governor, Simon Lalong, to match words with action by fishing out perpetrators rather than dishing out empty threats.\nAside sympathising with the people of Plateau State, especially families of those killed and wounded, Baba-Ahmed appealed to residents to remain calm and not take the laws into their hands.\nHe said: “Northern Elders Forum is shocked by the cold blooded murder of scores of travelers by locals in Jos, Plateau State.\n“The Forum has taken note of the statement of President Muhammadu Buhari and the steps taken by Governor of Plateau State, Simon Lalong.\nWe urge the security forces to quickly fish out the perpetrators of this dastardly crime and ensure their diligent prosecution in our courts.”"
  },
  {
    "headline": "Indonesia: Nigerian Ambassadors express fears over foreign service officers’ lives",
    "summarized_story": "From Romanus Ugwu, AbujaNon-career Ambassadors of Nigeria, currently serving across the globe, have condemned the recent unwarranted attack on the country’s diplomatic officer by Indonesian immigration officials.\nAdequate compensation for the officer’s treatment and for the aggravated assault suffered by him must also be demanded and obtained as soon as possible.\n“As it were, foreign service officers have become apprehensive for their safety.\nThe Federal Government and other world bodies must therefore show, by their handling of this matter, that foreign service officers anywhere in the world are safe and sound and free from any kind of harassment.\nWe affirm our total support to the Government of Nigeria in all her steps and efforts in this.”"
  },
  {
    "headline": "President Buhari to end isolation Wednesday – Presidency",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Presidency has disclosed that President Muhammadu Buhari is due on Wednesday to end the mandatory isolation he has been in since returning from the United Kingdom last Friday.\nAccording to Senior Special Assistant on Media and Publicity to the President, Garba Shehu, all documents coming to Buhari are screened and sanitised with specialised equipment before and after they reach him.\nShehu confirmed that the president is taking measures to ensure that he protects himself while attending to such official documents.\n‘The President is truly isolating as required following international travel,’ he said.\n‘It is important to note that all documents coming to Mr President are screened and sanitised with a specialised equipment before and after they reach him."
  },
  {
    "headline": "Anambra: 2 die, 14 buses razed in tanker fire accident",
    "summarized_story": "From Obinna Odogwu, AwkaA tanker fire that erupted on the Ogidi axis of Awka-Onitsha Expressway in Anambra State has claimed the lives of two people, injuring a number of others and razing 14 buses along the highway.\nSources say that the fire emanated from a tanker conveying petroleum product which fell into a drainage on Sunday evening.\n‘The buses affected in the incident were those within the area.\nPolice spokesman DSP Tochukwu Ikenga also confirmed the incident, saying that the driver of the vehicle was fatally burnt beyond recognition.\nHe said that policemen have cordoned off the area to prevent hoodlums from taking advantage of the situation."
  },
  {
    "headline": "News in Photographs: Working From Home, Buhari Signs PIB into Law",
    "summarized_story": "By Tim Akano “We must be willing to get rid of the life we’ve planned, so as to have the life that is waiting for..."
  },
  {
    "headline": "Breaking: Buhari Signs Petroleum Industry Bill",
    "summarized_story": "President Muhammadu Buhari has signed the Petroleum Industry Bill 2021 into law.\nThe President assented to the Bill on Monday, a State House statement said.\nWith the Presidential assent, the Petroleum Industry now has a legal, governance, regulatory and fiscal framework.\nThe Senate had passed the Bill on July 15, while the House of Representatives did same on July 16, bringing to an end a long wait since early 2000s.\nClick on the link for the PIB ActPETROLEUM INDUSTRY ACT 2021Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: Bandits Attack Zamfara School, Kill Security Guards, Abduct Students",
    "summarized_story": "By Onuminya InnocentBarely two months after gunmen suspected to be bandits kidnapped Provost of College of Agriculture and Animal Science, Bakura, Zamfara State, the bandits on Sunday night attacked the school and abducted 15 students.\nSources told THISDAY that the bandits during the attack shot sporadically, killing a policeman attached to the school and two security guards.\nIt was gathered that three staffers of the school were also abducted by the bandits during the attack.\nPolice have yet to speak on the attack at the time.of filing this report.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Otedola Recalls IBB’s Message to Jonathan ‘Tell Him to Sit on the President’s Chair’",
    "summarized_story": "I travelled back to Abuja by road in the evening and went straight to have dinner with Dr. Jonathan.\nGo and sit on that chair!’ He looked at me for some time and responded that he would think about it.\n“With Jonathan now legally empowered to act as President, there remained the critical optics: would he stand-in for the President confidently and authoritatively?\nAs Dr Jonathan entered the Council Chamber, he made to sit on the chair of the Vice President—his usual seat.\n“As the protocol officer pulled out the VP’s chair, Dr. Jonathan marched towards the seat reserved for the President."
  },
  {
    "headline": "As Kabul Falls, Buhari Says Africa is New Frontline of Global Militancy",
    "summarized_story": "Africa is the new frontline of global militancy.\n“Despite rising attacks across Africa in the past decade, international assistance has not followed in step.\nFurthermore, Buhari noted that the Sahel remained vulnerable to Boko Haram, 20 years after the sect’s formation and other radical groups.\nWhile calling for global action, he warned that sooner or later, the reverberations would be felt beyond Africa.\nUltimately, he held that Africans needed not swords but ploughshares to defeat terror."
  },
  {
    "headline": "BUSTED: How Office Of Kogi Deputy Governor, Edward Onoja, Others Were Indicted For Stealing, Looting Items Meant for Flood Victims",
    "summarized_story": "Officials of the Kogi State Government and the State Emergency Management Agency have been found to have converted relief materials meant for flood victims for their personal use, SaharaReporters gathered.\nEdward OnojaIn a report by the Head of Internal Audit, SEMA Kogi, Oloruntoba Sunday, it was stated that the relief materials given to the SEMA staff members by NEMA 2018 such as Spaghetti, Macaroni, were being given to the D-cos office (Deputy Chief of Staff, Office of the Deputy Governor), Es (Executive Secretary) office, SEMA staff, Protocol DG office & security.\nOther allegations were redundancy of relief materials, no register for donors and the list of items received, and improper distribution of relief materials.\nConnivance with the store officers of SEMA and Kogi ADP, one Mr Abdulazeez in the diversion of trucks of fertilisers meant for Kogi farmers.\n“Prayers: that the vacant Kogi Peoples consumer shop be renovated and used as an alternative warehouse for Kogi SEMA to prevent subsequent diversion of materials donated to the state."
  },
  {
    "headline": "BUSTED: How Office Of Kogi Deputy Governor, Edward Onoja, Others Were Indicted For Stealing, Looting Items Meant for Flood Victims",
    "summarized_story": "Officials of the Kogi State Government and the State Emergency Management Agency have been found to have converted relief materials meant for flood victims for their personal use, SaharaReporters gathered.\nEdward OnojaIn a report by the Head of Internal Audit, SEMA Kogi, Oloruntoba Sunday, it was stated that the relief materials given to the SEMA staff members by NEMA 2018 such as Spaghetti, Macaroni, were being given to the D-cos office (Deputy Chief of Staff, Office of the Deputy Governor), Es (Executive Secretary) office, SEMA staff, Protocol DG office & security.\nOther allegations were redundancy of relief materials, no register for donors and the list of items received, and improper distribution of relief materials.\nConnivance with the store officers of SEMA and Kogi ADP, one Mr Abdulazeez in the diversion of trucks of fertilisers meant for Kogi farmers.\n“Prayers: that the vacant Kogi Peoples consumer shop be renovated and used as an alternative warehouse for Kogi SEMA to prevent subsequent diversion of materials donated to the state."
  },
  {
    "headline": "EXCLUSIVE: Buhari Under Pressure To Remove Governor Buni As APC Party Chairman Amid Multi-billion Naira Asset Declaration Scandal",
    "summarized_story": "President Muhammadu Buhari is under intense pressure to remove the Governor of Yobe state, Mai Mala Buni as the Chairnan of the All Progressives Congress (APC) Caretaker and Extraordinary Convention Planning Committee (CECPC), SaharaReporters has gathered.\nA Presidential source told SaharaReporters that pressure is being mounted on Buhari to call for the Yobe state governor's removal as the party’s chairman.\nThis comes amid spirited efforts by Buni and his supporters to cover up a multi-billion naira asset declaration scandal he is involved in.\nSee Also Exclusive EXCLUSIVE: National Chairman Of Buhari's APC Party, Governor Buni In Multi-billion Naira Asset Declaration ScandalSaharaReporters gathered that Buni, who was the National Secretary of the APC until his election as Yobe state governor in 2019, was involved in anticipatory declaration, a criminal offence under the Code of Conduct Bureau (CCB) law.\nA source at the CCB told SaharaReporters that investigation of the governor’s anticipatory declaration has gone far at the agency."
  },
  {
    "headline": "EXCLUSIVE: Buhari Under Pressure To Remove Governor Buni As APC Party Chairman Amid Multi-billion Naira Asset Declaration Scandal",
    "summarized_story": "President Muhammadu Buhari is under intense pressure to remove the Governor of Yobe state, Mai Mala Buni as the Chairnan of the All Progressives Congress (APC) Caretaker and Extraordinary Convention Planning Committee (CECPC), SaharaReporters has gathered.\nA Presidential source told SaharaReporters that pressure is being mounted on Buhari to call for the Yobe state governor's removal as the party’s chairman.\nThis comes amid spirited efforts by Buni and his supporters to cover up a multi-billion naira asset declaration scandal he is involved in.\nSee Also Exclusive EXCLUSIVE: National Chairman Of Buhari's APC Party, Governor Buni In Multi-billion Naira Asset Declaration ScandalSaharaReporters gathered that Buni, who was the National Secretary of the APC until his election as Yobe state governor in 2019, was involved in anticipatory declaration, a criminal offence under the Code of Conduct Bureau (CCB) law.\nA source at the CCB told SaharaReporters that investigation of the governor’s anticipatory declaration has gone far at the agency."
  },
  {
    "headline": "Nigerian Army Detains Enugu Governor’s Aide Since July Over IPOB Membership",
    "summarized_story": "The Nigerian Army has arrested and detained for over one month Mr Tochukwu Okeke, the Senior Special Assistant on Security matters to the Enugu State Governor, Ifeanyi Ugwuanyi.\nEnugu State Governor, Ifeanyi UgwuanyiSaharaReporters gathered that the Nigerian Army despite an order from the Federal High Court in Port Harcourt, Rivers State, continued to hold Okeke in its custody.\nThe court had last week ordered the Nigerian Army to release unconditionally, the Senior Special Assistant but the military authorities refuse to obey.\nThe Nigerian Army, the Chief of Army Staff, Lt Gen Faruk Yahaya, and the General Officer Commanding (GOC) 82 Mechanised Division Enugu, Taoreek Lagbaja, are the 1st and the 3rd respondents in the suit.\nThe Nigerian Army, known for serial violation of the court orders, however, refused to release Okeke as ordered by the court."
  },
  {
    "headline": "Cholera: Death toll rises to 1,178 as NCDC records infections in 23 states, FCT",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) says the death toll from cholera infections across the country currently stands at 1,178.\nAs of August 9, the NCDC had confirmed 816 deaths in 22 states and the federal capital territory (FCT).\nHowever, Ihekweazu said as of August 14, the country had recorded 37,819 suspected cases of cholera.\nAdvertisement“Since the beginning of the year, a total of 1,938 samples have been collected with positive cases as follows – 277 rapid diagnosis test (RDT) positive only, 82 culture positive, 359 RDT and culture positive.\n“No new state reported cases in week 31."
  },
  {
    "headline": "Cholera: Death toll rises to 1,178 as NCDC records infections in 23 states, FCT",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) says the death toll from cholera infections across the country currently stands at 1,178.\nAs of August 9, the NCDC had confirmed 816 deaths in 22 states and the federal capital territory (FCT).\nHowever, Ihekweazu said as of August 14, the country had recorded 37,819 suspected cases of cholera.\nAdvertisement“Since the beginning of the year, a total of 1,938 samples have been collected with positive cases as follows – 277 rapid diagnosis test (RDT) positive only, 82 culture positive, 359 RDT and culture positive.\n“No new state reported cases in week 31."
  },
  {
    "headline": "Customs to NNPC: Set up filling stations in neighbouring countries to tackle petrol smuggling",
    "summarized_story": "Hameed Ali, the comptroller-general of customs, has asked the Nigerian National Petroleum Corporation (NNPC) to set up filling stations in neighbouring countries to tackle oil smuggling.\nResponding, Ali said customs had advised NNPC to establish petrol stations in neighbouring countries.\nThis, he said, would tackle oil smuggling and enable the country to make revenue and “completely diminish the anxiety or the penchant for smuggling”.\nWe should extend our petrol stations into these countries.\n“That is why we said, filling stations that are 20km of the border should not be given petroleum products."
  },
  {
    "headline": "Customs to NNPC: Set up filling stations in neighbouring countries to tackle petrol smuggling",
    "summarized_story": "Hameed Ali, the comptroller-general of customs, has asked the Nigerian National Petroleum Corporation (NNPC) to set up filling stations in neighbouring countries to tackle oil smuggling.\nResponding, Ali said customs had advised NNPC to establish petrol stations in neighbouring countries.\nThis, he said, would tackle oil smuggling and enable the country to make revenue and “completely diminish the anxiety or the penchant for smuggling”.\nWe should extend our petrol stations into these countries.\n“That is why we said, filling stations that are 20km of the border should not be given petroleum products."
  },
  {
    "headline": "Biden: US troops shouldn’t be dying in a war Afghan forces aren’t willing to fight for themselves",
    "summarized_story": "US President Joe Biden says he stands by his decision to withdraw his country’s troops from Afghanistan, in spite of the current developments.\nAs of Sunday, President Ashraf Ghani of Afghanistan fled the country, and based his decision on the need to “avoid bloodshed”.\n“The Taliban have made it to remove me, they are here to attack all Kabul and the people of Kabul.\nThe Afghan military collapsed sometime without trying to fight.\nWe trained and equipped an Afghan military force with some 300,000 strong and credibly well-equipped — a force larger in size than many of our military’s NATO allies,” he said."
  },
  {
    "headline": "Iyin Aboyeji, Caleb Zipperstien, on why Future Africa is opening an office in Israel",
    "summarized_story": "Last week, a former general associate with leading Isreali VC OurCrowd Caleb Zipperstien, announced his appointment as a venture partner with Future Africa, and the launch of their Israeli office.\nSo we sat down with Future Africa co-founder Iyin Aboyeji and Caleb to get some insight behind the move.\nAdegoke: What does the current state of ecosystem relationship between Africa and Israel look like and where will Future Africa take that relationship to?\nAdegoke: How would you characterize the Israeli ecosystem in terms of the size of investments, the biggest startups, or entrepreneurs?\nCaleb: Israel is not a B2C market."
  },
  {
    "headline": "Rebecca Enonchong’s case reflects Cameroon’s habit of arbitrary detentions",
    "summarized_story": "On Friday, charges against Cameroonian tech entrepreneur Rebecca Enonchong were dropped, after she had been illegally detained for three days by the government.\nAll charges dropped!” Enonchong said on Twitter.\nSuch claims are hard to prove but the unlawful detention is certainly a reminder of an enduring habit of arbitrary arrests and detentions in the West-Central African country.\nReports show that activists, politicians, and academics, particularly from the Anglophone regions, languish in Cameroon’s prisons.\nEnonchong has been released but thousands of others suspected of opposing President Biya haven’t been so “lucky”."
  },
  {
    "headline": "Tech entrepreneur Rebecca Enonchong to appear in Cameroon court",
    "summarized_story": "Rebecca Enonchong, one of Africa’s most prominent tech entrepreneurs, is reportedly set to appear before a court in her home country, Cameroon, on Thursday after she was arrested on Tuesday, August 10.\nThis is according to Edith Kah Walla, the leader of the Cameroon People’s Party (CPP).\n— Kah Walla (@KahWalla) August 11, 2021Enonchong remains in police custody and has been scheduled to appear at the Bonanjo Court of First Instance, Douala, on Thursday morning.\nhttps://t.co/8FxfOLSxlq — Kah Walla (@KahWalla) August 11, 2021Who is Rebecca Enonchong?\nOutside of her work in tech, Enonchong has been an advocate for progressive policies and better governance in Cameroon."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, What we’re discussing today: Yemi Keri and more women becoming angel investorsFundraising in Africa so..."
  },
  {
    "headline": "Facebook’s undersea Internet cable is coming to South-East Nigeria and 3 other African countries",
    "summarized_story": "The new branches extend the cable’s connectivity to Seychelles, Angola, the Comoro Islands and a new landing in South-East Nigeria.\nAccording to a 2020 GSM Association Factsheet, mobile Internet adoption in sub-Saharan Africa stood at 26% in 2019.\nAs of the end of 2019, 28 African countries had at least one submarine cable landing.\nAccording to data from Many Possibilities, the West and East African coasts each have cables with an Internet capacity of at least 100 Tbps.\nAs we noted in an earlier article, more subsea cables do not translate to faster Internet capacity."
  },
  {
    "headline": "SME Clinic 2021, Facebook and privacy, Twitter halts verification roll-out process",
    "summarized_story": "Share this article:Good day,Today I’m discussing:Countdown to SME Clinic 2021More privacy for your Messenger calls and Instagram messagesTwitter halts verification roll-out processSME Clinic 2021 is 5 days awayAre you excited?\nThis year, SME Clinic will be held on Saturday, August 21, 2021 at Zone Tech Park, Gbagada Expressway, Lagos.\nSo, for SME Clinic 2021, we’ve put together an amazing lineup of speakers to teach small business owners how to leverage tech in their businesses.\nFind out here: What to expect at SME Clinic 2021Also, here are 3 reasons not to miss SME Clinic 2021.\nFor the second time in three months, Twitter is pausing its verification roll-out process."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "Facebook-backed cable to land in Nigeria, 3 others",
    "summarized_story": "2Africa, a Facebook-backed subsea cable project, is finalising plans to become the largest internet service provider in Nigeria and the rest of Africa, with the announcement on Monday that Southeast Nigeria is now a new landing for the cable.\nThe cable will also extend connectivity to Seychelles, the Comoros Islands, and Angola.\nThe branches will…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Pension industry sees more M&As as recapitalisation intensifies",
    "summarized_story": "Nigeria’s pension industry is gearing up for consolidation as the sector is expected to see more mergers and acquisitions (M&As) in the ongoing recapitalisation in the sector.\nAccording to PenCom’s first quarter report, it has approved the acquisition of AXA Mansard Pensions Limited by Eustacia Limited, and the change of name from AXA Mansard Pensions Limited to Tangerine Pensions Limited.\nIn addition, the Commission granted “No Objection” for the merger between Tangerine Pensions Limited and Apt Pension Funds Managers Limited.\nThe bank noted, “FCMB Group plc had notified the Nigerian Exchange Limited (NGX) that its pension management subsidiary, FCMB Pensions Limited (FCMB Pensions) has received relevant regulatory approvals and concluded the acquisition of a 60 percent stake in AIICO Pension Managers Limited (AIICO Pensions).\nFCMB Pensions is a subsidiary of FCMB Group Plc."
  },
  {
    "headline": "States expected to win, lose if VAT sharing formula changes",
    "summarized_story": "States expected to win, lose if VAT sharing formula changesIf the responsibility of collecting Nigeria’s consumption tax, value-added tax (VAT) is transferred from the Federal Government to states, findings by BusinessDay show that some states with low economic activities will lose out while others with revenue-generating capacity will win.\nCurrently, Section 40 of VAT Act requires that the VAT pool be shared 50 percent…"
  },
  {
    "headline": "President Buhari Signs Petroleum Industry Bill Into Law – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – President Muhammadu Buhari has signed the Petroleum Industry Bill 2021 into law.\nThis was made known through a release signed by his Special Adviser(Media and Publicity), Mr. Femi Adesina in Abuja.\nMr. Adesina said that despite the President’s quarantine, the president showed his determination to fulfill his promise to Nigerian by signing the PIB into law.\nThe Petroleum Industry Act provides legal, governance, regulatory and fiscal framework for the Nigerian petroleum industry, the development of host communities, and related matters.\nThe Senate had passed the Bill on July 15, 2021, while the House of Representatives did same on July 16, thus ending a long wait since early 2000s, and notching another high for the Buhari administration."
  },
  {
    "headline": "House of Reps committee chairman dies – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The House of Representatives on Monday lost one of its member, Rep Adedayo Omolafe, member, representing Akure South/North Federal Constituency of Ondo state.\nRep. Tunji Olawuyi, the Chairman House Committee on Emergency and Disaster Preparedness confirmed this on Monday in Abuja.\nHe said that Omolafe died in the early hours of Monday, and asked God to grant him a peaceful repose.\nOlawuyi expressed deep regret over the demised of one of its committee members, describing him as a versatile lawmaker.\nHe said prior to his death Omolafe had on July 20 written on his twitter, “The truth is you don’t know what is going to happen tomorrow."
  },
  {
    "headline": "FG begins 2nd phase of COVID-19 vaccination – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Federal Government on Monday began administration of new vaccines marking the start of the second phase of the COVID-19 vaccination programme.\nNigeria began the COVID-19 vaccination on March 5, having received approximately four million doses of the Oxford-AstraZeneca vaccines from COVAX.\nNAN reports 2,534,205 people have been vaccinated for the first dose and 1,404,205 have received their second dose of the vaccine.\nEhanire said that the J&J vaccines are expected to be deployed in hard-to-reach areas, to eliminate the need for travel for a second dose.\nShuaib disclosed that the vaccines donated by the UK government would be targeted at those due for their second dose of the vaccinated."
  },
  {
    "headline": "‘I Married Two Wives Same Day So That I Can Always Have An Alternative’ – Delta Farmer – Nigerian Observer",
    "summarized_story": "I married two wives because I love to marry two women.\nHe admonished men to marry as many wives as possible rather than running after side chicks and endanger their lives.\nOne of the wives, which he addressed as the first one, Oghenekome Okoro alias Kome, however, said she would not be pleased if her husband goes for more wives.\nInstead of having side chicks like even some pastors do, is it not better to marry two wives?\nOn her part, the second wife, Oghenemaro, said , it will be fine, if her husband decides to marry additional wife."
  },
  {
    "headline": "Saudi Arabia urges Taliban to protect lives under ‘Islamic principles’",
    "summarized_story": "ADVERTISEMENTThe Kingdom of Saudi Arabia has urged the Taliban, who seized Afghanistan’s capital Kabul, to preserve lives, property and security as stipulated by “Islamic principles.”The kingdom said on Monday it stands with the choices that the Afghan people make without interference.\nA takeover of the entire Afghanistan was all but certain on Sunday as the government collapsed and the Taliban swept away territories.\nBased on Islamic principles, Saudi Arabia hopes that the Taliban and all Afghan parties will work to preserve security, stability, lives and property, Saudi’s foreign ministry said in a statement.\nThe Islamic country said it is confident that the situation in the Central Asian State will stabilise as soon as possible.\nSaudi Gazette reported that the Gulf country is carefully following the current events."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Secondus salutes Zambian president-elect, Hakainde … says victory good for Africa’s democracy",
    "summarized_story": "The National Chairman of Nigeria’s main opposition party, Peoples Democratic Party (PDP), Prince Uche Secondus has congratulated the Zambian opposition leader, Hakainde Hichilema on his victory at the nation’s Presidential election.\nThe opposition leader Hichilema was pronounced winner by the country’s Electoral body after landslide victory with over a million votes more than the incumbent President Edgar Lungu.\nHichilema got his victory on the sixth attempt having presented himself in five previous Presidential elections in the country.\n“This is how it should be, PDP did it in Nigeria in 2015 and stabilized our democracy.\nFinally, Prince Secondus called on other Africa countries to take a queue from the good news coming out of Zambian democracy."
  },
  {
    "headline": "Osun Ward Congress: APC caucus expresses confidence in appeal committee, denies disrupting sitting",
    "summarized_story": "The group denied allegation that it led political thugs to invade the party Secretariat during the Ward Congress Appeal Committee sitting on Saturday.\nWhile the Osun Progressives was rising and getting popular, Governor Oyetola and his group’s popularity were nose-diving.\nThat is the path that led to attacks on party members of the Osun Progressives who had thronged the party Secretariat to present their appeal to the committee.\n“Governor Oyetola seems interested in winning second term ticket at all cost and not minding whatever that follows.\nAfter the Osogbo party Secretariat, they made way to Ile Ife home of Hon."
  },
  {
    "headline": "ADF hails Enugu govt for initiating process of open grazing ban, tasks other states to do same",
    "summarized_story": "“ADF equally notes that the recent banning of open grazing by Katsina Emirate Council, which was in accordance with customary laws should be emulated by Communities in Igboland.\nThe Communities should wake up and apply their customary laws to secure their lands, economic crops and natural resources,” the statement added.\n“Under customary law, Igbo Communities which are mainly agricultural Communities have well recognised rules/laws to protect their Communities.\n“The application of these customary laws does not depend on state or federal laws.\nThey are the natural laws of the Communities.”"
  },
  {
    "headline": "BREAKING: Buhari signs PIB into law",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has signed the Petroleum Industry Bill (PIB) 2021 into law.\nA statement issued by Femi Adesina, presidential spokesman, said Buhari assented to the bill on Monday in his determination to fulfill his constitutional duty.\nThe PIB contains 5 chapters, including governance and institutions, administration, host communities development, petroleum industry fiscal framework and miscellaneous provisions in 319 clauses and 8 schedules.\nThe Petroleum Industry Act provides legal, governance, regulatory and fiscal framework for the Nigerian petroleum industry, the development of host communities, and related matters.\nOn July 1, the senate and the house of representatives had recommended 3% and 5% percent respectively to host communities."
  },
  {
    "headline": "Wiseman Daniel Storms Abuja For International Prayer Meeting",
    "summarized_story": "The general overseer of the Everlasting Light of Hope International Ministries (ELOHIM), Prophet Daniel Emelandu, aka Wiseman Daniel, is set to host a two-day international prayer meeting in the nation’s capital city, Abuja.\nThe prayer event is scheduled for September 24 and 25, 2021 at the main bowl of the velodrome, Moshood Abiola National Stadium, Abuja.\nAccording to him, after many days of prayer on the mountain in early 2021, he received a revelation from God to host the ‘Abuja for Christ’ crusade.\nProphet Emelandu has consistently exhibited a firebrand passion to bring salvation in the most practical terms to the children of God.\nSpeaking on the forthcoming international prayer meeting, the Man of God said: “We are here to pray for you."
  },
  {
    "headline": "Wiseman Daniel Storms Abuja For International Prayer Meeting",
    "summarized_story": "The general overseer of the Everlasting Light of Hope International Ministries (ELOHIM), Prophet Daniel Emelandu, aka Wiseman Daniel, is set to host a two-day international prayer meeting in the nation’s capital city, Abuja.\nThe prayer event is scheduled for September 24 and 25, 2021 at the main bowl of the velodrome, Moshood Abiola National Stadium, Abuja.\nAccording to him, after many days of prayer on the mountain in early 2021, he received a revelation from God to host the ‘Abuja for Christ’ crusade.\nProphet Emelandu has consistently exhibited a firebrand passion to bring salvation in the most practical terms to the children of God.\nSpeaking on the forthcoming international prayer meeting, the Man of God said: “We are here to pray for you."
  },
  {
    "headline": "N500,000 Up For Grabs In Knorr ‘Unwrap And Win’ Promo",
    "summarized_story": "Leading seasoning brand, Knorr has announced the launch of its 2021 consumer promo tagged ‘Unwrap and Win Promo’, which will see two winners cart away a cash prize money of N500,000 weekly for the next 12 weeks.\nAccording to Knorr, the promo is aimed at rewarding loyal consumers of Knorr by putting a smile on their faces while also encouraging more households to sample its range of products which are made with natural ingredients and rich in flavour.\nSpeaking on the initiative, the Brand Manager Knorr, Demilade Oresanya, remarked that the promo is the brand’s way of showing customers its appreciation for their loyalty and trust.\nADVERTISEMENTHe said, “Knorr is a brand that is committed to supporting a healthy lifestyle as well as creating unique taste experiences for families across Nigeria.\nThe Knorr Unwrap and Win promo is valid till October 17, 2021."
  },
  {
    "headline": "N500,000 Up For Grabs In Knorr ‘Unwrap And Win’ Promo",
    "summarized_story": "Leading seasoning brand, Knorr has announced the launch of its 2021 consumer promo tagged ‘Unwrap and Win Promo’, which will see two winners cart away a cash prize money of N500,000 weekly for the next 12 weeks.\nAccording to Knorr, the promo is aimed at rewarding loyal consumers of Knorr by putting a smile on their faces while also encouraging more households to sample its range of products which are made with natural ingredients and rich in flavour.\nSpeaking on the initiative, the Brand Manager Knorr, Demilade Oresanya, remarked that the promo is the brand’s way of showing customers its appreciation for their loyalty and trust.\nADVERTISEMENTHe said, “Knorr is a brand that is committed to supporting a healthy lifestyle as well as creating unique taste experiences for families across Nigeria.\nThe Knorr Unwrap and Win promo is valid till October 17, 2021."
  },
  {
    "headline": "315,791 Complete CVR As Anambra Tops With 23,314 Registration – INEC",
    "summarized_story": "The Independent National Electoral Commission (INEC), on Monday, said 315,791 eligible voters have completed their physical registration, with Anambra State leading with 23,314 registrants.\nThe electoral body also said that it has received 1,923,725 fresh online registrants.\nADVERTISEMENTHe noted that the online pre-registration of voters has now entered its seventh week.\n“As at 7am today Monday 16th August 2021, the number of online fresh registrants is now 1,923,725 while 315,791 citizens have completed their physical registration,” he said.\nHe also appealed to all eligible citizens to seize the opportunity of both the online and in-person processes to register as voters."
  },
  {
    "headline": "At last, Nnamdi Kanu, brother meet at DSS headquarters",
    "summarized_story": "Kanu’s younger brother, Prince Emmanuel Kanu who spoke with Vanguard on phone said he met with the IPOB Leader today (Monday )at the Department of State Services DSS headquarters, Abuja where he is currently detained.\nKanu’s younger brother also said that his brother urged all Biafrans to keep the Biafran spirit alive, expressing optimism that the Biafra Republic will soon be restored irrespective of the antics of the enemies.\n“He’s in high spirits and appreciates all the support from all Biafrans home and abroad,” he said.\nPrince Emmanuel appealed to the Nigerian authorities to grant his brother access to his personal physicians.\nHe called on the international community to prevail on Nigeria to free his brother so he could reunite with the family."
  },
  {
    "headline": "At last, Nnamdi Kanu, brother meet at DSS headquarters",
    "summarized_story": "Kanu’s younger brother, Prince Emmanuel Kanu who spoke with Vanguard on phone said he met with the IPOB Leader today (Monday )at the Department of State Services DSS headquarters, Abuja where he is currently detained.\nKanu’s younger brother also said that his brother urged all Biafrans to keep the Biafran spirit alive, expressing optimism that the Biafra Republic will soon be restored irrespective of the antics of the enemies.\n“He’s in high spirits and appreciates all the support from all Biafrans home and abroad,” he said.\nPrince Emmanuel appealed to the Nigerian authorities to grant his brother access to his personal physicians.\nHe called on the international community to prevail on Nigeria to free his brother so he could reunite with the family."
  },
  {
    "headline": "Four killed, several injured as gunmen attack oil workers in Imo",
    "summarized_story": "Four killed, several injured as gunmen attack oil workers in ImoFour killed, several injured as gunmen attack oil workers in ImoAt least four workers of Lee Engineering Company have been confirmed dead after gunmen ambushed them on Monday morning in the Assa community in the Ohaji/Egbema Local Government Area of Imo State.\nOur correspondent gathered that the oil workers were on transit to their oil plant in the Assa community when the hoodlums opened fire on them.\nA village source told our correspondent that the oil plant in the community was under construction by the oil company.\nThe national president of Congress of Ohaji Youths, Emmanuel Ugorji, confirmed the attack to our correspondent.\nCalling on the government to beef up security in the area, the youth leader said that gunmen were terrorising the area in recent times."
  },
  {
    "headline": "Four killed, several injured as gunmen attack oil workers in Imo",
    "summarized_story": "Four killed, several injured as gunmen attack oil workers in ImoFour killed, several injured as gunmen attack oil workers in ImoAt least four workers of Lee Engineering Company have been confirmed dead after gunmen ambushed them on Monday morning in the Assa community in the Ohaji/Egbema Local Government Area of Imo State.\nOur correspondent gathered that the oil workers were on transit to their oil plant in the Assa community when the hoodlums opened fire on them.\nA village source told our correspondent that the oil plant in the community was under construction by the oil company.\nThe national president of Congress of Ohaji Youths, Emmanuel Ugorji, confirmed the attack to our correspondent.\nCalling on the government to beef up security in the area, the youth leader said that gunmen were terrorising the area in recent times."
  },
  {
    "headline": "What Obasanjo told new Zambian President-elect Hichilema",
    "summarized_story": "Nigeria’s former President, Chief Olusegun Obasanjo has told the Zambian President-elect, Hakainde Hichilema to be magnanimous in victory.\nObasanjo, in a congratulatory message to Hichilema commended Zambians for keeping democracy alive in the East African country.\nIn a release by his Special Assistant on Media, Kehinde Akinyemi, on Monday, Obasanjo said reports reaching him was that the election was satisfactory.\n“I also congratulate the people of Zambia for keeping democracy alive.\nThe electoral commission said Hichilema got 2,810,777 votes against Lungu’s 1,814,201, with all but one of the 156 constituencies counted."
  },
  {
    "headline": "COVID-19: University of Ibadan to adopt online teaching",
    "summarized_story": "By Ibukun EmiolaThe management of the University of Ibadan (UI), on Monday, proposed moving teaching and learning, for the rest of the second semester, online due to rising COVID-19 cases and deaths in the country.\n“Management commends all departments engaging in virtual/blended teaching since the commencement of the 2020/2021 Session.\nFaluyi said the university had earlier requested faculties to identify courses to be taught online and those to be taught physically, for the rest of the second semester.\nShe noted that the management had decried the poor compliance with COVID-19 protocols by the entire university community and emphasised the need to ensure strict compliance through the university’s COVID-19 Committee.\nThe registrar enjoined everyone to take personal responsibility for his/her safety by obeying all COVID-19 safety protocols."
  },
  {
    "headline": "BREAKING: IPOB Leader, Nnamdi Kanu Meets Younger Brother, Says Biafra Must Be Reality",
    "summarized_story": "Nnamdi Kanu, the incarcerated leader of the Indigenous People of Biafra, has been granted a meeting with a family member by the Department of State Services.\nPrince Emmanuel Kanu, Kanu’s younger brother, told Vanguard that he visited with the IPOB leader on Monday at the Department of State Services DSS headquarters in Abuja, where he was arrested.\n“He [IPOB Leader] is in excellent spirits and is more eager than ever to get Biafra,” Prince stated.\nKanu’s younger brother reportedly stated that his brother asked all Biafrans to maintain the Biafran spirit alive, expressing hope that the Biafra Republic will be restored soon, despite the ‘enemy’ antics.\nHe also urged the international community to pressure Nigeria to release his brother and reunite him with his family."
  },
  {
    "headline": "Police Rescue 14 Kidnapped Victims In Kano",
    "summarized_story": "Within two months, the Kano State Police Command successfully freed fourteen kidnapped victims abducted in various operations.\nThis was said in a statement signed by the command’s spokesperson, Abdullahi Haruna Kiyawa, and made available to journalists on Monday.\nAccording to him, the victims were retrieved in various missions.\nHe explained that the victims were kidnapped by the Hoodlums in various operations across the state.\nHe said Kano State Police commissioner CP."
  },
  {
    "headline": "Mayor Of Ukrainian City Found Dead",
    "summarized_story": "On Sunday, the mayor of Kryvyi Rih, Ukraine, was found dead in his home with a gunshot wound.\nIt was uncertain whether Konstantin Pavlov committed suicide or was murdered.\nIn December 2020, the 48-year-old was elected mayor of the industrial metropolis with nearly 600,000 people.\nPresident Volodymyr Zelensky grew raised in a regional village around 350 kilometers south of Kyiv, Ukraine’s capital.\nMr Zelensky had proclaimed on social media that he would be in charge of the probe himself."
  },
  {
    "headline": "Youths Protest In Buhari’s Home State, Block Highways Over Insecurity, Attacks By Gunmen",
    "summarized_story": "According to reports, some youngsters in Yantumaki hamlet have blocked various routes in protest of the ongoing deaths and attacks by gunmen in Kastina State.\nThe protest, it was learned, began on Monday morning and was attended by internally displaced people (IDPs).\nThe protesters noted that the influx of IDPs was attracting attacks by bandits to the town, Primium Times reports.\nThe youths who promised not to destroy any property continued with their protest even after attempts by soldiers stop the protest.\n“Irate youths in Yantumaki blocked the Kankara- Dutsinma federal highway to protest against insecurity."
  },
  {
    "headline": "2022: FG to borrow N5.62trn to finance budget deficit",
    "summarized_story": "The federal government has disclosed its plan to borrow about N5.62 trillion to finance an expectedbudget deficit in the 2022 fiscal year.\nThis came following further disclosure that there may be a drastic cut down in its capital expenditure in the coming year to the tune of about N259.315 billion.\n“The budget deficit that is projected for 2022 is N5.62 trillion, up from N5.60 trillion in 2021.\nThe deficit is going to be financed by new foreign borrowing and domestic borrowing, both domestic and foreign in the sum of N4.89 trillion, then privatisation proceeds of N90.73 billion and drawdowns from existing project titles of N635 billion.\n“This amount represents 3.05 percent of the estimated GDP, which is slightly above the 3 percent threshold that is recommended in the Fiscal Responsibility Act”, she told the James Faleke-led panel."
  },
  {
    "headline": "Breaking: BBNaija season 6 housemate pulls out",
    "summarized_story": "Big Brother Naija, Shine Ya Eye’ housemate, Kayvee, has withdrawn from the show barely two weeks after joining alongside JMK, Michael and Queen.\nAccording to reports, Kayvee was advised to withdraw from the game due to his recent struggle with mental health.\nThe announcement of Kayvee’s departure was made known to all the Housemates in a statement released by Big Brother and read aloud by the Head of House, Pere.\nAccording to the statement: “Kayvee, one of the Housemates in the Big Brother Naija Shine Ya Eye Season, has been exited from the House on medical grounds.\n“Prior to this, he had a consultation with Big Brother and the on-site medical team, where it was decided that he had to leave the house for a more thorough medical investigation."
  },
  {
    "headline": "Breaking: Another nollywood star is dead",
    "summarized_story": "The Chairman of the Actors Guild of Nigeria, Lagos State Chapter, Emeka Rising Ibe, on Monday confirmed the death of its members Doris Chima.\nChima was said to have suffered breast cancer in past years.\nIbe who expressed sadness over her death said the deceased was a dedicated member and a good woman.\nAnother popular nollywood actress Rachel Oniga had died few days ago.\nDetails loading…"
  },
  {
    "headline": "How FG lost N17bn to tax evasion by agencies -NigPilot",
    "summarized_story": "The 2015 Audit report from the Office of Auditor General for the Federation, OAuGF, had revealed that the management of FIRS owed up to N17, 690, 341, 565 tax evasion by the companies.\nThese were fallouts of the queries issued against FIRS and 104 other public agencies by the OAuGF in the 2015 Audit report , sustained and adopted by the Senate.\nThe Auditor General in the query on the N17billion unrecovered taxes by FIRS said: “The Federal Inland Revenue Service failed to recover the total sum of N17, 690,341,565.00billion from different companies in the year under review.\n“The unrecovered taxes are made up of Value Added Tax (VAT), Company Income Tax (CIT), Withholding Tax (WHT), Education Tax (EDT), and NITDEF.\nAccording to the Senate’s resolutions on the N17billion, the FIRS unrecovered taxes and N32million Contracts splitting and overlapping; has about 60 days left to make the required recoveries and remittances into the Consolidated Revenue Fund."
  },
  {
    "headline": "PDP berates Buhari for signing PIB despite public outcry -NigPilot",
    "summarized_story": "Opposition Peoples Democratic Party, PDP, has berated President Muhammadu Buhari for ignoring the outcry by Nigerians across the board not to sign the offensive, repugnant and anti-people Petroleum Industry Bill (PIB), as passed by the National Assembly,into law.\nReacting to the signing of the controversial bill, the PDP noted that the signing of the law, despite widespread public rejection, amounts to an endorsement of imposition and further confirms that President Buhari and his All Progressives Congress (APC) have no iota of respect for the people as well as the tenets of democracy as a system of government.\nAccording to the PDP Spokesman, Kola Ologbondiyan, by his action, President Buhari has only authenticated that he is not a listening leader and that the APC and its leaders are only out to trample on the will of Nigerians for their selfish interests.\n“If anything, the Act assigned by President Buhari is a dangerous recipe for avoidable crisis in the sector.”The PDP called on President Buhari to salvage the situation by immediately forwarding an amendment bill to the National Assembly to reflect the true wishes and aspirations of every segment of our nation.\nWhile calling for calm across the country, particularly the South-South geo-political zone, the PDP also charges lawmakers elected on its platform to be at alert even as preparation must be commenced for an urgent amendment to this law."
  },
  {
    "headline": "Senate says PIB signed by Buhari will Boost Economy of the country -NigPilot",
    "summarized_story": "Making the remarks today is the Chairman, Public Affairs Committee of the Senate, Dr. Surajudeen Ajibola Basiru while congratulating the Executive arm of the government led by President Mohammadu Buhari, the leadership and members of the National Assembly, and all other stakeholders in the oil industry.\nEfforts at reaching this stage have been a protracted affair as the Bill, first initiated in 2003 had been subjected to a ping pong affair between the previous Legislatures and the Executive.\nThe 9th National Assembly finally broke the jinx when it recently passed the Bill after working dispassionately by putting the interest of the Nation first over petty squabbles and other self-interests, thereby laying finally to rest previous failed attempts.\nDr. Basiru attributed the success of the accent to the Bill which has now become an Act to the Cooperative efforts of all participating sectors in the process and also the nonconfrontational policy of the present National Assembly.\nPresident Buhari had on September 2, 2020, forwarded a draft of the bill to both chambers of the National Assembly."
  },
  {
    "headline": "APC chieftain canvases FG’s funding of CSOs, frowns at foreign donor funding -NigPilot",
    "summarized_story": "Lukman has called for local funding of Civil Society Organizations, CSOs , by the Federal Government so to reduce their dependence on foreign donors who have links with the government of their countries.\nIt is basically a belief that accepts a relationship with foreign governments as good but the relationship with Nigerian government is bad.\n“Interestingly, however, individual leaders of civil society could have positive relations with functionaries of the Nigerian government.\nIf Nigerian civil society can accept funding from foreign governments , why should it be difficult for them to take steps to negotiate structured local funding, which may include contributions from the Nigerian government?” he said.\nLukman, who is the Director-General of Progressive Governors Forum, PGF, in a statement titled, “Civil Society and Nigeria’s Democratic Development”, released Monday canvassed for greater level of collaboration between Federal government and Civil Society Organizations, CSOs, in the country in order to forster development and depeen Nigeria’s democracy."
  },
  {
    "headline": "President Buhari Signs Petroleum Industry Bill Into Law",
    "summarized_story": "President Muhammadu Buhari has signed the Petroleum Industry Bill 2021 into law.\nAccording to the statement, President Buhari signed the bill into law while in quarantine, after his arrival from the United Kingdom.\nThe Petroleum Industry Act provides legal, governance, regulatory and fiscal framework for the Nigerian petroleum industry, the development of host communities, and related matters.\nA long waitThe act is expected to replace the obsolete Petroleum Act of 1969.\nIn 2015, the Buhari administration proposed passing the PIB in various segments, forming four separate bills (Petroleum Industry Governance Bill, Fiscal Regime Bill, Upstream and Midstream Administration Bill, Petroleum Host Communities Bill)."
  },
  {
    "headline": "How 219 More Boko Haram Fighters, Children Surrendered In Two Days – Army",
    "summarized_story": "The Nigerian Army says 219 more Boko Haram fighters and children have surrendered to troops in the north-east region of the country.\nDirector of Army Public Relations, Brigadier General Onyema Nwachukwu, who disclosed this in a statement on Monday said the feat was recorded over the weekend in Borno State.\n“A total of 186 Boko Haram terrorist members led by their Amir, Manye Aga, comprising 67 adult males, 54 adult females, and 65 children surrendered to troops of Operation Hadin Kai at Forward Operational Base (FOB) Ajiri.\nItems recovered from the surrendered terrorists include several AK 47 rifles and magazines, a locally made pistol, and eight locally fabricated daggers.\nNwachukwu insisted that the terrorists were overwhelmed with palpable fear and were making desperate efforts to halt the surrendering of their fighters from the Tumbus and Sambisa axis."
  },
  {
    "headline": "Nigeria Kicks Off Phase Two Of Covid Vaccination",
    "summarized_story": "The Federal Government on Monday commenced the administration of new vaccines marking the start of the second phase of the COVID-19 vaccination programme.\nThe second phase of the vaccination programme was breathed into life after the US donated over four million doses of the Moderna vaccine.\nThe single-shot J&J vaccine was acquired through the African Vaccine Acquisition Trust (AVAT), with support from Afrexim bank.\nThe J&J vaccines are expected to be deployed in hard-to-reach areas, to eliminate the need for travel for a second dose.\nAccording to Health Minister, Osagie Ehanire, Nigeria has procured nearly 40 million doses of the J&J vaccines through AVAT."
  },
  {
    "headline": "How IBB Asked Jonathan To Sit On Yar’Adua’s Chair – Otedola",
    "summarized_story": "Billionaire businessman Femi Otedola has joined Nigerians in felicitating with former military President, General Ibrahim Babangida, who marks his 80th birthday on Tuesday, August 17.\nGo and sit on that chair!’“He looked at me for some time and responded that he would think about it.\n“A week later, on Tuesday, February 9, the National Assembly adopted the famous ‘Doctrine of Necessity’ to make Dr Jonathan the Acting President pending the return of President Yar’Adua from his medical leave.\nAs Dr Jonathan entered the council chamber, he was made to sit on the chair of the Vice President—his usual seat.\n“As the protocol officer pulled out the VP’s chair, Dr Jonathan marched towards the seat reserved for the President."
  },
  {
    "headline": "PIB: 3% Too Small For Those Who Suffer Burden Of Producing Oil, Says Oyebode",
    "summarized_story": "“Three per cent is a pittance for those who suffer the incumbrances of producing oil.\n“We all agree that the oil-bearing areas are the geese that lay the golden eggs, so they have to survive, and they have to be cushioned and defended from the vagaries of oil production,” he said.\n“Trying to smuggle in people over host territory, oil pipelines pass, I think it is being clever by half.”“We must be able to separate issues.\nIt is taking such a long time to have the PIB, so we should not throw away the baby (as people say) with the bathwater.\nThe Petroleum Industry Act provides a legal, governance, regulatory and fiscal framework for the nation’s petroleum sector, the development of host communities, and related matters."
  },
  {
    "headline": "PGF DG, Salihu Lukman canvases FG’s funding of CSOs, frowns at foreign donor funding",
    "summarized_story": "In a statement titled, “Civil Society and Nigeria’s Democratic Development”, released on Monday, canvassed for greater level of collaboration between Federal government and Civil Society Organizations, CSOs, in the country in order to foster development and deepen Nigeria’s democracy.\nIt is basically a belief that accepts a relationship with foreign governments as good but the relationship with Nigerian government is bad.\nSadly, there is no campaign in the country to create domestic funding sources for the work of civil society.\nAdvertisement“Why should relationship with Nigerian government be considered bad, but relationship with foreign governments good?\n“Why should Nigerian civil society resent financial support from Nigerian government but accept from UK, US and EU governments?"
  },
  {
    "headline": "Gov. Matawalle condemns abduction of students, members of Staff",
    "summarized_story": "Zamfara State governor, Bello Matawalle has expressed sadness over the abduction of Students and members of staff of the College of Agriculture and Animal Science Bakura, by armed bandits.\nFifteen students and four members staff of the college were abducted early hours of Monday at the school premisesThe governor said his administration has strengthened security in all schools across the state since the last abduction of students of Government Girls Secondary School, Jangebe in February this year.\nHe expressed worries over the resurgence of school abduction in the state by some recalcitrant bandits despite all efforts to control the situationGovernor Matawalle has however directed security operatives to intensify efforts and rescue all the victims, adding that he will do everything humanly possible to ensure their safe return.\nAdvertisementHe commended the prompt response of security agencies by deploying more troops which also led to the successful rescue of three abducted staff of the college.\nThe Zamfara State Government extend it condolences to families of those killed in the attack and assured parents of the abducted students that all the victims will return unhurt."
  },
  {
    "headline": "Justice Baba-Yusuf’s appointment as acting FCT Chief Judge a perfect fit – Gov Bello",
    "summarized_story": "Kogi State governor, Yahaya Bello has congratulated the newly appointed acting Chief Judge of the High Court of the Federal Capital Territory, Justice Husseini Baba-Yusuf whose appointment by President Muhammadu Buhari was based on the recommendation of the National Judicial Council.\nThe governor in a congratulatory message, contained in a Press Statement signed on Saturday by his Chief Press Secretary, Muhammed Onogwu described Justice Buba-Yusuf’s appointment as a perfect fitGovernor Bello hailed President Muhammadu Buhari for the appointment of Kogi born Jurist into such a highly prestigious position noting that the revered legal icon has paid his dues and was well deserving of such an elevated role in our nation’s justice systemHe added that the Acting Chief Judge was a renowned legal luminary who has played several roles and had a reputation of fearlessness and uprightness hence he would make a good Judge and be a valuable tool at dispensing justiceWhile the governor assured that the Ankpa born Justice would live up to expectations because of his solid years of experience and requisite knowledge, he however urged him to continue to make Kogi State proudAdvertisementIn a statement that conveyed his appointment, Hon Justice Husseini Baba-Yusuf would be sworn in by the Chief Justice of Nigeria and Chairman of the National Judicial Council, Justice Ibrahim Tanko Muhammad, CFR, on Monday, August 16, 2021, by 10 am at the Supreme Court of Nigeria."
  },
  {
    "headline": "Seven Killed in Kabul Airport Chaos as Taliban Patrols Afghan Capital",
    "summarized_story": "The last American troops had planned to withdraw at the end of the month.\nU.S. troops took positions to guard the active runway, but the crowd stormed past them and their armored vehicles.\nLate Monday night, hundreds of people remained trapped between American forces trying to push them out of the airport and Taliban forces trying to keep them in, witnesses said.\nHowever, the ease with which the Taliban took control goes beyond military prowess, the Texas-based private intelligence firm Stratfor wrote.\nSome militants put on Afghan military uniforms and began doing patrols, arresting suspected robbers."
  },
  {
    "headline": "Bolaji Akinyemi: US Not the World Power We Used to Know",
    "summarized_story": "The collapse of the US-backed government in Afghanistan to the Taliban is a victory for China, a foreign policy expert Professor Bolaji Akinyemi has said.\nMany say the collapse of the West Asian government happened faster than almost anyone in Washington or Kabul could have imagined.\nProf. Akinyemi told ARISE News on Monday that the US and China are having a”terrible rocky relationship” with the pulling out of troops from Afghanistan appearing to be an inexperienced move by the US as well as an inability to handle complex world.\nHe said the Chinese will be having the laughter of their life.\nWatch the interview for more…"
  },
  {
    "headline": "Talban’s Afghanistan Takeover: Unpreparedness of America Worrisome, Bolaji Akinyemi Says",
    "summarized_story": "Afghanistan: Unpreparedness of Biden Administration Worrisome For Foreign Policy, Diplomatic Expert Prof Akinyemi SaysA former Nigerian Minister of External Affairs Professor Bolaji Akinyemi says the unpreparedness of the Joe Biden administration towards the stunning takeover of power in Afghanistan is worrisome.\nAkinyemi, a professor of political science stated this on Monday when he featured on an ARISE News programme, The Morning Show, but noted that Biden and former US President Donald Trump were right in pulling American troops out of the Southasian country.\nHe however queried the way and manner in which the troops were pulled out.\nWatch the interview for more."
  },
  {
    "headline": "Trending: Odumeje Slams Chris Okotie Over TB Joshua",
    "summarized_story": "Asides broadcasting the news and telling stories across the globe, shinning stars of Arise FC representing Arise News slugged it out in a friendly match with their counterparts from the AIM media group, -owners of Cool FM, Wazobia FM and Nigeria Info on Saturday.\nThe management of University of Calabar in Nigeria has revealed that some lecturers have resorted to giving students scripts to write exams at homes, hotels and relaxation places.\nMeanwhile, former Governor of the Central Bank of Nigeria, Alhaji Sanusi Lamido, said during a colloquium to mark his 60th birthday on Saturday that Nigeria had made zero progress since 1981.\nFinally, the General Overseer of Mountain of Holy Ghost Intervention and Deliverance Ministry Chukwuemeka Ohanaemere aka ‘Odumeje Ndaboski’ has carpeted Pastor Chris Okotie over his recent comments on the late TB Joshua."
  },
  {
    "headline": "Nigeria: President Buhari Signs Petroleum Industry Bill Into Law",
    "summarized_story": "Nigeria’s President Muhammadu Buhari on Monday signed the Petroleum Industry Bill 2021 into law.\nPresidential aide Femi Adesina in a statement said President Buhari who is working from home assented to the Bill in his determination to fulfil his constitutional duty.\n“The Petroleum Industry Act provides legal, governance, regulatory and fiscal framework for the Nigerian petroleum industry, the development of host communities, and related matters.\nRepresentatives of the area demanded ten per cent, or in the minimum, five per cent as earlier passed by the House of Representatives.\nThese concerns raised were however brushed aside by the leadership of the National Assembly under the Senate president, Ahmad Lawan."
  }
]