[
  {
    "headline": "Outcry greets Buhari’s UK medical trip as doctors’ strike loom",
    "summarized_story": "Some Nigerians on social media have criticised the President, Major General Muhammadu Buhari (retd.\n), on his medical trip to London as doctors’ strike loom.\nTherefore, Buhari’s scheduled medical follow-up has come with a lot of criticisms from Nigerians on Twitter.\nA tweep, @akinolaanthony4, wrote, “Many Nigerians died because of the failed health care system, as they cannot travel abroad for treatments.\nSo do we even have Ghana standard now?”@monnyx4 also tweeted, “Buhari leaves for check up in the UK while health workers in his country are threatening to strike."
  },
  {
    "headline": "JAMB releases results for 2021 UTME",
    "summarized_story": "The Joint Admissions and Matriculation Board on Friday released results of candidates who sat for the 2021 Unified Tertiary Matriculation Examination between last Saturday and Tuesday.\nThe board made this known in a statement by its Head of Media, Fabian Benjamin, noting that the results for subsequent days would be released daily.\nIt directed candidates to check their results by sending UTMERESULT to 55019 through the GSM number used by each candidate to obtain profile code and UTME registration with the board and their results would be sent to them.\nThe statement read, “The Joint Admissions and Matriculation Board has released the results of candidates who sat in more than 720 CBT centres for the 2021 Unified Tertiary Matriculation Examination conducted between Saturday, June 19 and Tuesday, June 22, 2021.\n“In addition, the Board would not hesitate to withdraw the results of any candidate subsequently found to have committed any form of examination misconduct.”"
  },
  {
    "headline": "Why death gratuities get delayed ― FG",
    "summarized_story": "Dr Yemi-Esan who stated this at an event to mark the 2021 Nigeria Civil Service Week further noted that poor documentations make it almost impossible for insurance companies to pay death benefits, even when valid claims are made.\nIt is the institution that writes to the Office of the Head of the Civil Service.\nIt was not a committee set up by Office of the Head of Service as some people are tempted to believe.\n“I met with the Secretary to the Government of the Federation recently and truth is the Oronsaye Report is now outdated.\nOne of the committee will look at the Oronsaye Report and the other one will look at what happened after the report."
  },
  {
    "headline": "Imo Oil-Producing Areas get 38 projects, hospitals",
    "summarized_story": "By Chinonso Alozie, OwerriThe Imo State Oil Producing Areas Development Commission, ISOPADEC, has started the construction of thirty-eight projects in the oil-producing areas of the state.\nThe Managing Director of ,ISOPADEC, Mr. Charles Orie, confirmed this to newsmen yesterday in Owerri, after the flag-off ceremony of the ISOPADEC projects in Oguta, Ohaji/Egbema and Oru East local government areas in Imo.\nOrie, said that the projects were targeted to quickly end the sufferings of people living in the oil producing areas especially the educational and health challenges they are currently facing.\nThe ISOPADEC MD, said among other things that the 38 projects included the “Rehabilitation and construction of Oguta General hospital, 20-bed General hospital respectively, another 20-bed general hospital in Umuokanne Ohaji-Egbema local government.\n“We have these projects scattered in the 33 wards in the oil producing Local Government Areas, the Ohaji/Egbema and Oguta."
  },
  {
    "headline": "Abduction of ex-Lawmaker, Kogi Prince, Hotel Guests in Abuja: Police launch manhunt for gunmen",
    "summarized_story": "Men of the Federal Capital Teritory Police Command have launched a manhunt for criminals who kidnapped a former lawmaker in Kogi state, Hon Friday Sani Makama and an Igala Prince, Frederick Adejoh along with some hotel guests at Tungan Maje community, near Zuba.\nSources said the duo and some guests were kidnapped at their Hiltop Hotel Lodge when armed men shot sporadically into the air causing security guards to scamper for safety and kidnapped the hotel guests including the owner of the Hotel.\n“The armed men shoot sporadically into the air to scare aware the security men on guard, before kidnapping the hotel owner and guests”, a source confirmed.\nIt would be recalled that the Anti Kidnapping Squad of the FCT Police Command recently arrested members of Tungan-Maje kidnapping gangs and recovered huge ransome payments.\nThe gang members belonged to a notorious syndicate involved in major abductions along Bwari-Byzahin, Kuje-Kwali axis and Niger State."
  },
  {
    "headline": "Like Femi Adesina, Lai Mohammed says FG not behind NPC, NBC bills",
    "summarized_story": "Lai MohammedThe Minister of Information and Culture, Alhaji Lai Mohammed, says the Federal Government is not the sponsor of the bills purportedly meant to stifle the press.\n“This is a classic case of misinformation because the Federal Government did not sponsor any bill to gag the press.\n“I insist that the bills were not sponsored by the Federal Government.\nMohammed said those falsely accusing the Federal Government and misinforming the public on the bills had a chance to make their contributions during the public hearing.\nHe said rather than show up at the National Assembly’s sponsored public hearing on the bills, they chose to play to the gallery."
  },
  {
    "headline": "An applause for mentors — Tunde Akanni",
    "summarized_story": "At our maiden online meeting, he added: “Dr Akanni is also one the few journalism professors who still do regular media writing.\nMy pan-Nigerian mentees on this project, six in all, comprised four males and two females and were all fantastic.\nFor me, virtually all the schools I have attended around the world have availed me with male and female mentors.\n“Na only Ife and Ibadan students go dey tap from these media idols ni?,” I often soliloquized.\nTunde Akanni, PhD, is an Associate Professor of Journalism based at the LASU School of Communication."
  },
  {
    "headline": "JAMB: How to check your 2021 UTME result",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB) on Friday released the results of candidates who sat for the 2021 Unified Tertiary Matriculation Examination (UTME).\nThe 2021 UTME commenced nationwide on Saturday, June 19 2021.\nDAILY POST brings to you some procedures you require to check your result.\nCandidates are advised to check their UTME result by sending UTMERESULT to 55019 through the GSM number used by each candidate to obtain profile code and UTME registration with the board.\nGo to JAMB UTME e-Registration Portal hereWhen the page loads up, Login with your Reg Number/e-Mailand click on the box”Check my results”Your score will be displayed on your computer screen or it will display “You Do Not Have Any Result Yet”2021 UTME: JAMB releases results (How To Check)"
  },
  {
    "headline": "Restructuring: I'm waiting for National Assembly",
    "summarized_story": "President Muhammadu Buhari has said he is waiting for the outcome of the National Assembly’s consultations on the restructuring of Nigeria.\nThe President gave the hint when he received the leadership of the Ijaw National Congress (INC) at the State House, Abuja, on Friday.\nBuhari commended INC’s recent affirmation of belief in one Nigeria and declaration of support for the fight against insecurity.\nOn restructuring, Buhari pointed out that the National Assembly is working on the calls and has concluded regional consultations.\nOn the Hydrocarbon Remediation Project, Buhari confirmed he had directed the Ministry of Environment to ensure that the remediation efforts in Ogoni are implemented."
  },
  {
    "headline": "Buhari prefers stopping criticisms to solving insecurity",
    "summarized_story": "Amnesty International has said President Muhammadu Buhari’s administration prefers stifling criticisms and freedom of expression to addressing Nigeria’s deteriorating insecurity.\nSpeaking during a virtual conversation of ‘Thursday Talks,’ a monthly programme moderated by a senior programme manager at Paradigm Initiative, Adeboye Adegoke, Amnesty Nigeria chief, Osai Ojigho condemned the administration’s posture.\n“At Amnesty International and several groups, we’ve constantly called the Nigerian authorities’ attention to these issues — not just nationally, but on the global arena.\nShe said: “It is not for the regulatory body to tell the press what they should say and how they should say.\n“I know most people will come out and say, ‘oh, but some people say things that are not true or say things that harm people’s reputation, should they go scot-free?’ The law has already provided means through which redress can be made when those violations occur.”Imo prison break: Biafra group hints on reasons for attack on Police facility"
  },
  {
    "headline": "Stanley Uzochukwu gets new appointment",
    "summarized_story": "The Igbinedion University, Okada, has appointed Dr. Stanley Uzochukwu, Chairman of Stanel Group as a member of its Governing Council.\nThe university said Uzochukwu was appointed into its governing council due to his human capacity development and management.\nUzochukwu’s appointment letter titled, “Letter of Appointment as Member of Governing Council, Igbinedion University, Okada”, was personally signed by Dr. Gabriel Igbinedion, Chancellor and Chairman, Board of Regents of the University.\nThe letter reads in part, “In accordance with the Law establishing Igbinedion University, Okada, I have the pleasure to appoint you as Member, Governing Council, Igbinedion University, Okada.\nThe appointment is for a period of three(3) years with effect from 24th June, 2021."
  },
  {
    "headline": "Insecurity: Imams warn against provocative preaching in mosques",
    "summarized_story": "The Committee of the Federal Capital Territory (FCT) Imams Initiative (CFII), has cautioned Imams against preachings that are inimical to peaceful coexistence in the country.\nThe communiqué warned that the mosque podium should not be used to create confusion, division, glorifying evil, promoting partisanship, praise-singing of leaders and raining abuses.\nAccording to the communiqué, the unity of the society relies heavily on unity among the Imams.\n“Accordingly, the participants emphasised the need to have an Imams committee in all the states of the federation.\nIt stressed that the relationship between the Imams as occupiers of the pulpit and government toward solving national maladies should be a pragmatic and symbiotic one."
  },
  {
    "headline": "JAMB: Enugu cancels Saturday’s sanitation exercise",
    "summarized_story": "Agency ReporterEnugu State Government says it has cancelled this month’s sanitation exercise scheduled for Saturday to enhance candidates’ access to the Joint Admission and Matriculation Board (JAMB) examination centres.\nMrs Amaka Anajemba, Managing Director of Enugu State Government Waste Management Authority made this known on Friday in Enugu.\nADVERTISEMENTAnajemba said, in a statement, that the state government had to cancel the exercise because all movement, especially vehicles, would be restricted between 6am and 10am.\nShe, however, regretted any inconvenience the cancellation would have caused other residents of the state."
  },
  {
    "headline": "BREAKING: Buhari receives briefing from APC leaders",
    "summarized_story": "By Bolaji Ogundele, AbujaPresident Muhammadu Buhari on Friday received briefing from the leadership of the ruling All Progressive Congress (APC) at the Presidential Villa.\nThe APC Caretaker Chairman Mai Mala Buni presented the report.\nADVERTISEMENTIn attendance were Vice President Yemi Osinbajo, Deputy Senate President, Senator Omo Agege, governors and members of the caretaker committee.\nAlso, Senator Peter Nwaoboshi, who recently decamped from Peoples Democratic Party (PDP) in Delta State to the APC, was presented to the President at the State House.\nDetails later…"
  },
  {
    "headline": "PHOTOS: Buhari receives briefings from APC caretaker committee",
    "summarized_story": "My name is RTD Major/Gen.A.O.Aladenola.\nThe journey of my diabetes started on a terrific Tuesday morning.\nI received an emergency..."
  },
  {
    "headline": "Why Onochie cannot be INEC commissioner, by CSOs",
    "summarized_story": "By Frank Ikpefan, AbujaA coalition of civil society organisations (CSOs) has asked the National Assembly to reject the nomination of Lauretta Onochie as a national commissioner for the Independent National Electoral Commission (INEC) because she is a British citizen.\nPresident Buhari forwarded the name of Ms Onochie and five others to the Senate in October last year for confirmation as INEC national commissioner.\nEpelle maintained that she is unlikely to be non-partisan, neutral and objective in her duties as an INEC National Commissioner if she is confirmed, adding that CSOs will be left with no option other than to seek legal redress.\n“Uphold the federal character principle in re-nominating a non-partisan, neutral, and competent Nigerian to represent the South-South region as INEC National Commissioner.\n“Observe the principle of diversity and gender inclusivity in nominating candidates who are non-partisan and competent as INEC National Commissioners."
  },
  {
    "headline": "KALU GREETS SANWO-OLU AT 56",
    "summarized_story": "Former Governor of Abia State and Chief Whip of the Senate, Dr. Orji Kalu has felicitated with Governor of Lagos state, Mr. Babajide Sanwo-Olu on the occasion of his 56th birthday anniversary.\nDescribing the Governor as an accomplished public servant and consummate politician, Kalu acknowledged the achievements of the Governor in Lagos state, adding that Sanwo-Olu has sustained and consolidated on the achievements of his predecessors.\nKalu while wishing the Governor many more years in the service of humanity, urged the celebrant to sustain his feat in governance.\nIn a congratulatory message, the former Governor stressed that the celebrant has demonstrated robust capacity in steering the affairs of Lagos state.\nHe said, “I join the people of Lagos state in celebrating Governor Babajide Sanwo-Olu of Lagos state as he clocks 56."
  },
  {
    "headline": "Buhari directs Onu to submit revised 25-year roadmap on National Space Policy to FEC",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari, Thursday directed the Minister of Science and Technology, Dr. Ogbonnaya Onu to prepare and submit to the Federal Executive Council for consideration and approval, “a revised 25-year roadmap for the implementation of the National Space Policy.”A statement by Senior Special Assistant to the President on Media and Publicity, Garba Shehu, said Buhari gave the directive at a meeting with members of the National Space Council of the National Space Research and Development Agency (NASRDA) at the State House in Abuja.\nBuhari expressed a renewed commitment to the space sector, describing it as the foundation of cyber security and a vibrant digital economy.\n“No doubt Space is providing a new frontier for human development.\nAs a stimulus for increased technological advancement and economic innovation, outer space offers a unique challenge and platform for effective exploration and exploitation of our natural resources and the protection of our environment.\n“Moreover, space technology remains the foundation for cyber security and a vibrant digital economy.”“I also acknowledge the huge human resources already acquired by Nigeria in the field of Space Science and Technology over the last twenty-one years and the need for the country to put in place the necessary infrastructure required for the actualization of the goals and objectives of our National Space Policy and Programme."
  },
  {
    "headline": "Anambra guber: Ezenwankwo rejects APGA primary result",
    "summarized_story": "Ezenwankwo, who represents Orumba North/Orumba South Federal Constituency in the National Assembly, said the primary was marred by irregularities and intimidation.\n“I reject the primary result of Wednesday, June 23, 2021, because, it was marred by irregularities and intimidation of the highest order.\n“One, before the primary, APGA chairmen in all the wards in the state held ward congresses to elect party delegates for the election.\n“To my greatest surprise and disappointment, during the primary proper, I found out that none of the names in the delegates’ list was among those that cast votes.\nIn a telephone chat with Daily Sun, Obiokoye insisted it is only a united APGA that can get victory against other political parties in the governorship election."
  },
  {
    "headline": "Anyone accusing military of conniving with bandits hallucinating -CDS",
    "summarized_story": "Irabor made this known at an interaction with retired senior military officers in the South West at the Headquarters of 2 Division of the Nigerian Army, Odogbo, Ibadan.\nOn Gumi’s allegations, he said: “Anyone who is hallucinating with the idea that the military or other security agencies are conniving, I think needs to have himself checked.\nIrabor, however, said the country was under serious threat which necessitated the engagement of retired officers to assist in resolving security challenges, especially in regions where they live.\nWe are only chasing terrorists and bandits behind the killings and kidnapping for ransom in our land.\nGumi should be ashamed that an Islamic cleric as he claims has suddenly become a mouthpiece for bandits and terrorists."
  },
  {
    "headline": "Buhari leaves for London for medical follow-up",
    "summarized_story": "President Muhammadu Buhari will proceed to London, the United Kingdom, for scheduled medical follow-up today.\nA statement by Special Adviser to the President on Media and Publicity, Femi Adesina, said Buhari is expected back in the country during the second week of July, 2021.\nBuhari was away for two weeks between March 30 – April 16 for routine medical checks.\nHe had been routinely criticised by citizens for his constant medical trips to the UK, especially given the rot in the country’s healthcare infrastructure and government failure to commiting funds into the rehabilitation or putting on ground state-of-the-art medical facilities as found abroad to address critical ailments suffered by citizens.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Nigeria will Soon Overcome its Security Challenges, Says Osinbajo",
    "summarized_story": "•UN: 350,000 killed in North-east insurgencyDeji Elumoye and Michael Olugbode in AbujaVice President Yemi Osinbajo has expressed optimism that Nigeria will soon prevail over the current security challenges facing it.\nOsinbajo, while hosting the Oluyin of Iyin Ekiti, Oba Adeola Ajakaiye, yesterday in Abuja rallied Nigerians to support the security agencies to ensure that Nigeria is safe.\n“Any country with this number of security challenges must respond as robustly as possible.\nAccording to him, even as the federal government is concerned about the security challenges, and will continue to ramp up efforts towards improving security nationwide, community efforts are also vital in tackling the issue from the roots.\n“Without continued investment in development as a long-term solution, the protracted conflict in north-east Nigeria will continue to impact other parts of the country and the entire Sahel region."
  },
  {
    "headline": "Barkindo: COVID-19 Pandemic Increased Global Debt by $24tn",
    "summarized_story": "Barkindo highlighted the contributions of the Declaration of Cooperation (DoC) of participating countries, which continue to support the global oil market through voluntary production adjustments in the interest of market stability.\nHe said: “The forecast for world oil demand has decreased from 6.2 mb/d in November 2020 to 6 mb/d in June 2021.\nWorld debt now stands at $281 trillion, comparing to the annual world GDP of around $80 trillion.\n“Looking at the world oil supply, non-OPEC supply growth was revised down from 0.9 mb/d in November 2020 to 0.8 mb/d in June 2021.\nOther speakers at the event were the President of the Nigeria Gas Association (NGA) and Managing Director, Shell Nigeria Gas (SNG), Mr. Ed Ubong, and Gas Portfolio Manager, Shell Petroleum Development Company (SPDC), Mr. Yemi Famori."
  },
  {
    "headline": "Delta Urges FG to Constitute NDDC Board",
    "summarized_story": "Kingsley Nwezeh in AbujaThe Delta State Government yesterday called for the speedy reconstitution of the board of the Niger Delta Development Commission (NDDC) to avert the 2016 experience when the resurgence of militancy plunged Nigeria into recession.\nHe described as untenable, the assurance of the Minister of Niger Delta Affairs, Senator Godswill Akpabio, that the board would be constituted after an ongoing forensic audit.\n“And for us in Delta State Government, we don’t want a repeat of what happened in 2016 that boxed us up into a recessionary period, where there was a resurgence of militancy in the region.\nHe said: “We have a strong opinion that the long delay and the non-constitution or the substantive board of the NDDC is a flagrant abuse of the Act, establishing the NDDC.\n“So I want to say that it is the expectation of the critical stakeholders that the board should be constituted,” he said."
  },
  {
    "headline": "Lawan: N’Assembly will be Diligent in Approving Loan Requests",
    "summarized_story": "Deji Elumoye in AbujaPresident of the Senate, Dr. Ahmad Lawan, has said the National Assembly will always follow due diligence in approving loan requests from the executive arm of government.\nLawan told journalists yesterday in Abuja after a closed-door meeting with President Muhammadu Buhari that the National Assembly will not approve frivolous loan requests from the executive as it will always ask for details before any loan is approved.\nWhenever we have to approve any loan, we have to insist on the details of what projects will be funded by those loans.\nSo, we will not be frivolous and will not take it lightly to just approve any loan”.\nHe, however, supported the idea of government sourcing loan to execute projects, saying the revenues are not available while Nigerians cannot be taxed further."
  },
  {
    "headline": "How I Stabbed Super TV CEO to Death, Says 21-year-old UNILAG Student",
    "summarized_story": "Chiemelie EzeobiA 21-year-old undergraduate of the University of Lagos, Chidinma Adaora Ojukwu, has narrated how she stabbed the Chief Executive Officer of Super TV, Mr. Usifo Ataga, to death in the Lekki area of Lagos State.\nShe spoke at the Lagos State Police Command headquarters in Ikeja yesterday after she was paraded as a suspect by the state Commissioner of Police, Hakeem Odumosu.\nThe 300-level student of Mass Communication was said to have stabbed him severally during the scuffle, tied him up and left him to bleed to death.\nThe suspect said she and Ataga were “having fun” when an argument broke out and she stabbed him twice.\n“He later became violent trying to get to me and I was resisting and defending myself."
  },
  {
    "headline": "EXPOSED: Energy Commission Of Nigeria Inflates Transformers, Streetlights' Contracts By N17million",
    "summarized_story": "The Energy Commission of Nigeria, one of the key agencies under the Ministry of Power, has been embroiled in a contract inflation saga, involving transformers and streetlights.\nThe commission is being asked to account for N17 million which it earmarked as the cost of transformers and streetlights, according to a 2018 government’s audit report.\nThese include; the contract for the establishment of 152 solar streetlights in Dawakin Kudu/Warawa, Kano 1, Kano State at a contract sum of N100,190,891.20.\nTwo, the contract for the establishment of solar powered streetlights at Zaria Prison, Kaduna State, for the sum of N4,614,054.20.\nIn the case of any other officer, he shall be surcharged appropriately and removed from the duty schedule, dismissed, and prosecuted."
  },
  {
    "headline": "EXPOSED: Energy Commission Of Nigeria Inflates Transformers, Streetlights' Contracts By N17million",
    "summarized_story": "The Energy Commission of Nigeria, one of the key agencies under the Ministry of Power, has been embroiled in a contract inflation saga, involving transformers and streetlights.\nThe commission is being asked to account for N17 million which it earmarked as the cost of transformers and streetlights, according to a 2018 government’s audit report.\nThese include; the contract for the establishment of 152 solar streetlights in Dawakin Kudu/Warawa, Kano 1, Kano State at a contract sum of N100,190,891.20.\nTwo, the contract for the establishment of solar powered streetlights at Zaria Prison, Kaduna State, for the sum of N4,614,054.20.\nIn the case of any other officer, he shall be surcharged appropriately and removed from the duty schedule, dismissed, and prosecuted."
  },
  {
    "headline": "BREAKING: Again, Buhari To Visit UK For Medical Check-up Friday",
    "summarized_story": "President Muhammadu Buhari will on Friday travel to London, UK, for a medical check-up.\nBetween June 6 and 19, 2016, Buhari went on a 10-day medical trip to England for an ear infection surgery.\nLater on March 10, 2017, Buhari returned to Nigeria but didn't resume work immediately at Aso Villa.\nOn August 19, 2017, Buhari returned to Nigeria, and it took him a while to resume work because rats had reportedly damaged furniture in his office.\nIn 2020, Buhari had not minimised his foreign medical trips to the impact of the COVID-19 pandemic and the global lockdown and strain on medical facilities."
  },
  {
    "headline": "BREAKING: Again, Buhari To Visit UK For Medical Check-up Friday",
    "summarized_story": "President Muhammadu Buhari will on Friday travel to London, UK, for a medical check-up.\nBetween June 6 and 19, 2016, Buhari went on a 10-day medical trip to England for an ear infection surgery.\nLater on March 10, 2017, Buhari returned to Nigeria but didn't resume work immediately at Aso Villa.\nOn August 19, 2017, Buhari returned to Nigeria, and it took him a while to resume work because rats had reportedly damaged furniture in his office.\nIn 2020, Buhari had not minimised his foreign medical trips to the impact of the COVID-19 pandemic and the global lockdown and strain on medical facilities."
  },
  {
    "headline": "Association Of Frauds: Lagos Chairmanship Candidates For All Progressives Congress Party In Messy Certificate Scandals",
    "summarized_story": "Some All Progressives Congress (APC) chairmanship candidates in Lagos state local government council poll in July are currently enmeshed in different certificate forgery scandals.\nSaharaReporters further learnt that the APC candidate refused to present the original WAEC certificate 30 years after taking the examination.\nSurah also failed to submit a National Youth Service Corps certificate or exemption letter to prove she served or was exempted.\nAccording to a letter obtained by SaharaReporters, the school did not conduct any NECO external examination in November 2008.\n“One wonders why the APC did not do a thorough and proper verification process before fielding these candidates."
  },
  {
    "headline": "Lai: Those attacking NBC, NPC bills didn't show up during public hearing",
    "summarized_story": "AdvertisementHe said some of those attacking the National Broadcasting Commission (NBC) and Nigerian Press Council (NPC) bills did not show up during public hearing on the legislation.\nSpeaking in an interview with NAN on Friday, Mohammed said the bills are private member bills sponsored by a lawmaker in the national assembly.\nThe bills, sponsored by Olusegun Odebunmi, a lawmaker from Oyo state, seek to amend the NBC and NPC Acts.\n“I was invited, as the minister of information and culture, to make my contributions, just like many other stakeholders at the public hearing.\nWhy didn’t these critics show up at the much-publicised public hearing on these bills?"
  },
  {
    "headline": "Lai: Those attacking NBC, NPC bills didn't show up during public hearing",
    "summarized_story": "AdvertisementHe said some of those attacking the National Broadcasting Commission (NBC) and Nigerian Press Council (NPC) bills did not show up during public hearing on the legislation.\nSpeaking in an interview with NAN on Friday, Mohammed said the bills are private member bills sponsored by a lawmaker in the national assembly.\nThe bills, sponsored by Olusegun Odebunmi, a lawmaker from Oyo state, seek to amend the NBC and NPC Acts.\n“I was invited, as the minister of information and culture, to make my contributions, just like many other stakeholders at the public hearing.\nWhy didn’t these critics show up at the much-publicised public hearing on these bills?"
  },
  {
    "headline": "‘Seven abducted’ as gunmen attack Abuja hotel",
    "summarized_story": "Gunmen have abducted seven persons after they attacked Hilltop Hotel in the federal capital territory (FCT).\nThe hotel is located in Tunga Maje, a town on the outskirts of the nation’s capital.\nDaily Trust reported that the gunmen stormed the hotel when Prince Adejo, its owner, was having a meeting with some people.\nMariam Yusuf, spokesperson of the FCT police command, confirmed the incident and said that an operation has been launched to rescue those abducted.\nThere has been a spike in the number of abductions in Tunga Maje and other remote towns in the FCT."
  },
  {
    "headline": "‘Seven abducted’ as gunmen attack Abuja hotel",
    "summarized_story": "Gunmen have abducted seven persons after they attacked Hilltop Hotel in the federal capital territory (FCT).\nThe hotel is located in Tunga Maje, a town on the outskirts of the nation’s capital.\nDaily Trust reported that the gunmen stormed the hotel when Prince Adejo, its owner, was having a meeting with some people.\nMariam Yusuf, spokesperson of the FCT police command, confirmed the incident and said that an operation has been launched to rescue those abducted.\nThere has been a spike in the number of abductions in Tunga Maje and other remote towns in the FCT."
  },
  {
    "headline": "Know Your Rights: When can police place you in handcuffs?",
    "summarized_story": "AdvertisementIn making an arrest, suspects are legally protected from the abuse of their fundamental human rights.\nAdvertisementHowever, there have been several reports of police officers violating the rights of suspects during and after arrest.\nOne of these reported violations is the unnecessary use of handcuffs and leg chains to restrain an individual.\nWhat are the situations that allow a law enforcement officer to place a suspect in handcuffs?\nAdvertisementHowever, when the safety of the suspect or the accused cannot be guaranteed, the police officer can subject the individual to handcuffs."
  },
  {
    "headline": "Jesse Forrester started an e-mobility company in Kenya after deciding against going to university",
    "summarized_story": "After ALA, Jesse took up a fellowship.\nToday, his company Mazi Mobility is backed by global venture builder, Satgana, and is aiming at implementing an electric vehicle ecosystem in Africa.\nHe started his company without a university degree and he is now preparing himself to dominate the African e-mobility space.\nThe journey to Mazi by way of ALA‘Mazi’ was not always ‘Mazi Mobility’.\nAt ALA, Jesse was a part of the team behind “The Living Machine” a water treatment system that won them the $100,000 Zayed Sustainability Prize in 2019."
  },
  {
    "headline": "SEC approves Chaka as first licensed stock trading app in Nigeria",
    "summarized_story": "Chaka becomes the first to acquire the digital sub-broker license introduced by SEC in April of this year.\nAs part of a major amendment to its Consolidated Rules and Regulations, SEC recognised sub-brokers who use digital platforms to serve multiple brokers.\nOn the 19th of December 2020, the SEC published a statement that effectively barred Chaka from offering its services in Nigeria.\nThat December warning enabled Chaka to take the lead and open talks with the SEC.\nHe said the license also means Chaka could now enable other stockbroking firms who want to have a digital presence."
  },
  {
    "headline": "From Konga to mPharma, logistics for health products is growing in Africa",
    "summarized_story": "These health logistics companies include e-commerce players like Jumia, Copia and Konga, and also core health startups like mPharma, Lifestores Pharmacy, Chekkit and Sproxil.\nSnapshot of innovators in the health products distribution space in Africa.\nKonga.com is a marketplace where pharmaceutical companies can list health products like medicines.\nSalient Advisory’s report notes that “clear and harmonised regulations” could boost this entry of e-commerce players into the health products distribution space.\nImudia declines to share what health products logistics currently contributes to Konga’s overall business."
  },
  {
    "headline": "A Nigerian-Taiwanese couple, on their love for online gaming",
    "summarized_story": "The real reason, however, is that she wants him to have a “normal” childhood away from video games.\nWhen they started dating, Olaide introduced Ying-Yi (who is half-Nigerian, half-Taiwanese) to online gaming.\nOlaide: I have been playing video games since I was a kid.\nI’ve had many conversations with companies that want to get into online gaming but they fear the risks.\nAlexander: So how do you pitch online gaming to people in government, as something good for the digital economy?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Malawi’s 3D-printed school, learning disabilities and technology, Chrome’s third-party cookies",
    "summarized_story": "Good day,Today, I’m discussing:The world’s first 3D-printed school opening in MalawiLearning disabilities and assistive technologyGoogle’s delay in blocking third-party cookies in ChromeWorld’s first 3D-printed school opens in MalawiPhoto credit: NairametricsWhat happened?\nLearning disabilities (LDs) and assistive technology (AT)Photo by Wulan Sari on UnsplashJust two questions before you proceed: What are learning disabilities?\nAlthough there is no cure for LDs, technology has made learning easier for people with learning disabilities.\nGoogle delays plan to block third-party cookies in ChromePhoto by Brett Jordan on UnsplashAnother announcement?\nGoogle has said that it will delay its plans to block third-party cookies in the Chrome browser until 2023, a year later than planned."
  },
  {
    "headline": "Trying clothes online, virtual store attendants, Facebook plans to over overhaul eCommerce",
    "summarized_story": "Statista showed a rise in eCommerce sales in 2020, with global online sales increasing from $3.35 trillion in 2019 to $4.89 trillion in 2020.\nTo take advantage of this unprecedented rise, the company rolled out Facebook Shops on May 19, 2020.\nAlso, Facebook Shops is coming to WhatsApp soon.\nMeanwhile, the new feature will not be available for Whatsapp users globally.\nIn December 2020, WhatsApp gave an ultimatum for users to accept updated privacy policy."
  },
  {
    "headline": "What you need to know as Malawi gets the world’s first 3D-printed school",
    "summarized_story": "The first 3D-printed school, a partnership between Holcim and CDC Group, has been unveiled in Malawi’s Salima district.\nUsing conventional materials, it would take 70 years to bridge this gap, but 14Trees claims that it could take as little as 14 years with 3D printing.\nUnlike conventional buildings, with 3D printing, schools can now be built in days instead of months and at less cost.\nBuilding infrastructure is one reason many African children are out of school, and 3D printing could provide a way out.\nWhile 3D printing could be good for education, should we be cautiously optimistic if it becomes a big deal?"
  },
  {
    "headline": "Six countries show Nigeria’s poverty reduction goal is achievable",
    "summarized_story": "Nigeria’s President Muhammadu Buhari on Tuesday inaugurated the Steering Committee of the National Poverty Reduction with Growth Strategy (NPRGS) to achieve his mission of lifting 100 million Nigerians out of poverty within a decade.\nAlready, he has claimed that his administration has successfully lifted 10.5 million Nigerians out of poverty in the last two years…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Fear of losing power in popular revolt keeps Buhari from ending wasteful petrol subsidy",
    "summarized_story": "Fear of losing power in popular revolt keeps Buhari from ending wasteful petrol subsidyThe fear of popular uprising toppling his government again as it did in 1984 may be the underlying reason behind President Muhammadu Buhari’s insistence on petrol subsidies, even when it is coming at a great cost to the economy.\nAccording to the Nigerian National Petroleum Corporation (NNPC) Africa’s biggest oil producer now consumes about 103…"
  },
  {
    "headline": "Foreign manufacturers look to tap Nigeria’s $153m motorcycle industry",
    "summarized_story": "An example of manufacturers looking to tap into this market is Hero MotoCorp, one of the world’s largest manufacturers of motorcycles and scooters, which has made investments to tap from Nigeria’s $153 million two-wheelers industry through its specially made-for-Nigeria motorcycle named Hunter.\nThis also presents an opportunity for more investors to come in as the Nigeria Two-Wheeler Market report by Market Research reveals that the sector has a promising future in the country.\n“Nigeria two-wheeler market is projected to surpass $153 million by 2023.\nThis has also prompted manufacturers of motorcycles like Hero MotoCorp to still see limitless opportunities in the Nigerian market.\nDespite the huge demand for motorcycles, Nigeria relies on the importation of Completely Knocked Down (CKD) parts from Asian countries, which are assembled in the country."
  },
  {
    "headline": "Continuous Voters Registration: INEC Launches Online Portal – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Independent National Electoral Commission (INEC), Thursday launched the online Portal for the continuous voters registration exercise nationwide.\nAccording to the chairman, the register of voters is at the heart of democratic elections, stating that “a good register of voters is a precursor to a good election.\nThe chairman also said that, Monday 28th June 2021 remains sacrosanct, as the registration of voters will commence in full nationwide.\nSome citizens may also have one form of disability or another to make it impossible for them to register online.\n“I wish to assure you that in addition to the online registration portal, there will be some 2,673 centres where citizens can register physically nationwide”, he added."
  },
  {
    "headline": "Edo warns against dangers of drug abuse, to set up more drug-free clubs in schools – Nigerian Observer",
    "summarized_story": "Edo warns against dangers of drug abuse, to set up more drug-free clubs in schoolsShare FacebookTwitterStumbleuponLinkedInPinterest…rolls out activities to mark International Day Against Drug AbuseBENIN CITY – The Edo State Government has warned youths against the dangers of drug abuse, calling for increased collaboration among stakeholders to check the menace among young people.\nChairman, Edo State Drug Control Committee (ESDCC), Dr. Osamwonyi Irowa, gave the warning during a press briefing at the Government House, in Benin City.\nAccording to him, “Today’s event is organized to herald a week-long activity lined up to commemorate the International Day Against Drug Abuse and Illicit Trafficking by Edo State Drug Control Committee (ESDCC).\nWe will inaugurate more drug-free clubs in our schools.\n“There was a walk against drug abuse today Thursday 24th, and there will be a church sensitization and thanksgiving service on Sunday this week."
  },
  {
    "headline": "Obaseki gets nod, kudos for devt of arts, culture as FG backs realisation of EMOWAA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has received the commendation of the Federal Government for his administration’s efforts at sustaining the rich cultural heritage of the Benin people.\nThe DG said: “I want to thank the Governor of Edo State, Mr. Godwin Obaseki, for accepting us to hold the retreat in his state.\n“The Benin bronze that will be repatriated and returned will be displayed here in Benin for the people to see these stolen artifacts.\nSome other people will come from across the world to see these artworks in the museum.”Chairperson, Governing Board of NCMM, Arct.\nPeople should be allowed to buy into our activities in the museum, as it will help in partnership to get better results.”..."
  },
  {
    "headline": "Ease of doing business: FG assures states support on reforms – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The Federal Government on Thursday assured states of its support in the development of their respective reform action plans to drive the nation’s ease of doing business ranking.\nDr Jumoke Oduwole, Special Adviser to President Muhammadu Buhari on Ease of Doing Business, made the pledge at the Lagos Chamber of Commerce and Industry (LCCI) Roundtable on Ease of Doing Business.\nOduwole said that the Presidential Enabling Business Environment Council (PEBEC) undertook an Ease of Doing Business (EoDB) Subnational Baseline Survey.\nShe said it would serve to provide status report on the current attractiveness of states business climates for small and medium sized enterprises (SMEs).\nOduwole said that homegrown indicators for states surveyed were infrastructure and security, transparency and access to information, regulatory environment and skills, and workforce readiness."
  },
  {
    "headline": "SPECIAL REPORT: Inside Delta community which existence is threatened by flooding",
    "summarized_story": "According to a research paper by Adaku Echendu, the erosion is caused by the Niger Delta coastal flood, which has left no fewer than three million persons displaced.\nA study has shown the havoc that the Niger Delta coastal flood causes annually.\nThe treasurer of Abari town, Peremobowei Dakromoh, said erosion is an age-long problem, which he grew up to understand as a norm.\nIn short, I want to believe we are not part of the local government in Delta State.\n300KVA, 33/0.415KV Transformer at Abari community, Delta state Sep. 06, 2010 LAURINCO NIGERIA LIMITED Ongoing."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "15,000 Participants Set For International Housing Show In Abuja",
    "summarized_story": "Over 15,000 participants including more than 400 exhibitors from not less 15 countries will participate in the 2012 Abuja International Housing Show.\nAdvertisementsThe event features an all-important CEOs Forum, which is a convergence of elite chief executives from Nigeria and across the world to devise the most effective solutions to challenges in the housing and construction industry.\n“It is a collaborative and supportive environment for leaders in Nigerian real estate industry support services and mortgage banks.\nParticipating in the forum will increase high-level business contact.’’According to Adebayo, the forum will equally provide avenue for meeting counterparts from every parts of the country and outside the country on networking business relations.\nFrom government officials looking for informed opinion(s) on emerging housing and construction policy dynamics, to private sector developers and investors looking for the best clients, environments and opportunities for establishment, to customers looking for the best housing deals, mortgages, credit and whatever access they need, the Abuja International Housing Show has been the best and most established platform in Africa for such convergence."
  },
  {
    "headline": "15,000 Participants Set For International Housing Show In Abuja",
    "summarized_story": "Over 15,000 participants including more than 400 exhibitors from not less 15 countries will participate in the 2012 Abuja International Housing Show.\nAdvertisementsThe event features an all-important CEOs Forum, which is a convergence of elite chief executives from Nigeria and across the world to devise the most effective solutions to challenges in the housing and construction industry.\n“It is a collaborative and supportive environment for leaders in Nigerian real estate industry support services and mortgage banks.\nParticipating in the forum will increase high-level business contact.’’According to Adebayo, the forum will equally provide avenue for meeting counterparts from every parts of the country and outside the country on networking business relations.\nFrom government officials looking for informed opinion(s) on emerging housing and construction policy dynamics, to private sector developers and investors looking for the best clients, environments and opportunities for establishment, to customers looking for the best housing deals, mortgages, credit and whatever access they need, the Abuja International Housing Show has been the best and most established platform in Africa for such convergence."
  },
  {
    "headline": "Why Payment Of Death Gratuities Are Delayed – Head Of Service",
    "summarized_story": "Head of the Civil Service of the Federation, Dr. Folasade Yemi-Esan, said in Abuja on Thursday that poor documentations and lack of understanding of procedures are some of the reasons for the delayed payment of death gratuities to next of kins of civil servants who died in active service.\nThe federal government according to the Head of Service released over N2billion last year for the payment of backlog of death benefits, noting that as a result, 594 beneficiaries have been paid.\nIt is the institution that writes to the Office of the Head of the Civil Service.\nADVERTISEMENT“I met with the Secretary to the Government of the Federation recently and truth is the Oronsaye Report is now outdated.\nOne of the committee will look at the Oronsaye Report and the other one will look at what happened after the report."
  },
  {
    "headline": "Why Payment Of Death Gratuities Are Delayed – Head Of Service",
    "summarized_story": "Head of the Civil Service of the Federation, Dr. Folasade Yemi-Esan, said in Abuja on Thursday that poor documentations and lack of understanding of procedures are some of the reasons for the delayed payment of death gratuities to next of kins of civil servants who died in active service.\nThe federal government according to the Head of Service released over N2billion last year for the payment of backlog of death benefits, noting that as a result, 594 beneficiaries have been paid.\nIt is the institution that writes to the Office of the Head of the Civil Service.\nADVERTISEMENT“I met with the Secretary to the Government of the Federation recently and truth is the Oronsaye Report is now outdated.\nOne of the committee will look at the Oronsaye Report and the other one will look at what happened after the report."
  },
  {
    "headline": "Kumuyi Urges Nigerians To Connect With God For Divine Intervention",
    "summarized_story": "Amidst daunting challenges facing Nigeria, the General Superintendent, Deeper Life Bible Church, Pastor William Kumuyi, Thursday, urged Nigerians to connect to God for divine intervention.\nHe said: “Suffering came with sinning against God.\n“You can invite sin with one finger but at the end, ten fingers will not be enough to remove them.\nHe knows where your goodness, prosperity, satisfaction and sufficient supplies are, and He will lead you to them as you connect to Him.\n“When God calls you to repentance, you have to come to Him and do away with all those things which cause disconnection, chief of which is sin,” Kumuyi added."
  },
  {
    "headline": "Nigerian Bishop makes a comprehensive list of adulterous pastors and politicians",
    "summarized_story": "A Nigerian Bishop, identified as Don Simon Osieme has compiled a comprehensive list of all adulterous pastors and politicians across Isoko land in Delta State.\nThe cleric took to his social media to share the list immediately after his children arrive safely in Texas, USA.\nAccording to him, the list contains profile cases of adultery perpetuated by pastors and politicians with whom, when, and where.\nHe wrote; ADULTERYMANIA SAGA VS THE HIDDEN EYES”Adultery by a wife in Isoko tradition is attempted murder and in some cases very close to me, first-degree murder.\nNo current Isoko House of Assembly member is on this list."
  },
  {
    "headline": "No graduate should be employed without certificate of national service – DG NYSC",
    "summarized_story": "Ukpono Ukpong, AbujaAll Employers of labour in the public and private sector have been warned against employing graduates without demanding for Certificate of National Service.\nThe Director-General, National Youth Service Corps (NYSC), Brig Gen Shuaibu Ibrahim, gave the warning yesterday at the opening ceremony of Corps Legal Aid Workshop, yesterday in Abuja.\nSpeaking further, he advised all employers to present the NYSC certificates of their existing employers to the scheme for authentication.\n“Would like to use this medium to remind all employers in the public and private sectors that it is mandatory to demand the Certificate of National Service or Exemption Certificate duly issued by the National Youth Service Corps before offering employment to any holder of Degree or Higher National Diploma.\nHe urged Legal Officers and Corps Lawyers to redouble efforts at enlightening the general public on the provisions of the NYSC Act."
  },
  {
    "headline": "Senate places 75% import duties on importation of syringes, needles",
    "summarized_story": "Tunde Opalana, AbujaThe Senate has ordered a hike in importation duties on syringes and needles into the country and therefore recommended 75 percent port duties.\nThe two directives were meant to protect local manufacturers, give them enabling environment to contribute to the revenue base of the nation and to reduce unemployment.\n“Importation of syringes and needles is killing local manufacturers making them to lay off staff and preventing them from contributing effectively to the economy.\nThis has been an impediment to local manufacturers attaining this status and preventing their being patronized by organisations using donor funds”.\n“The local manufacturers are actually the highest supplies of syringes and needles for hospitals."
  },
  {
    "headline": "FG flags off training for Irish Potato farmers in Kano",
    "summarized_story": "By Nneka NwogwugwuThe Federal Ministry of Agriculture and Rural Development (FMARD) has commenced training for Irish potato farmers in Kano.\nFlagging off the training on Monday at Gezawa Local Government Area of the state, Hajia Karima Babangida, the Director, Federal Department of Agriculture, who spoke on the topic, ‘re-educating Irish potato farmers on farming as business rather than been a culture’, said that Nigerian farmers must begin to change the narratives about farming as a culture to farming as a business.\n‘’It’s important to know that FBS is capable of starting a potato revolution here in Bauchi State especially in Toro LGA and other communities in the state that has potentials to grow potato during dry season.\n‘’FMARD is also poised to build the capacity of farmers in other states with potentials to grow Irish potato with new innovations and techniques on GAP and FBS to ensure productivity and income generation.\nThe training which began on Monday, June 21, will end on Friday June 25, 2021."
  },
  {
    "headline": "Anambra: Court voids PDP congress, nullifies delegate list",
    "summarized_story": "THE Peoples Democratic Party is weighing its options following the nullification of its Anambra State delegate congress by a Federal Capital High Court, Abuja, on Thursday.\nIt was gathered that the party leadership has scheduled an emergency meeting to deliberate on what step to take next.\nEarlier, an FCT High Court, nullified the party’s delegate congress.\nThe court had sacked the state PDP Executive Committee after it found merit in a case questioning their legitimacy filed by aggrieved party members.\nHowever, the court turned down the application, stating that they have not provided sufficient grounds for the court to do so."
  },
  {
    "headline": "Anambra: Court voids PDP congress, nullifies delegate list",
    "summarized_story": "THE Peoples Democratic Party is weighing its options following the nullification of its Anambra State delegate congress by a Federal Capital High Court, Abuja, on Thursday.\nIt was gathered that the party leadership has scheduled an emergency meeting to deliberate on what step to take next.\nEarlier, an FCT High Court, nullified the party’s delegate congress.\nThe court had sacked the state PDP Executive Committee after it found merit in a case questioning their legitimacy filed by aggrieved party members.\nHowever, the court turned down the application, stating that they have not provided sufficient grounds for the court to do so."
  },
  {
    "headline": "FAO: 65,800 Borno farmers kicked out of farms by terrorists",
    "summarized_story": "The Food and Agricultural Organisation of the United Nations has raised the alarm of impending food insecurity in the North-East region, saying insurgency has denied 65,800 farmers access to agricultural inputs in the area.\nHe disclosed that the launch was the sixth rainy season farming intervention being conducted by FAO in Borno, Adamawa and Yobe states since 2016.\nKafeero said supporting rainy season farming was key to the entire insurgency affected region, adding that farmers’ harvests contributed significantly to food security and income generation throughout the year.\n“Access to agricultural inputs for high yields also saves lives and livelihoods of farmers,” he added.\nHe said this year, 65,800 household farmers were supported with agricultural inputs and livestock restocking for fattening, while 40,000 farmers were targeted for the distribution of inputs."
  },
  {
    "headline": "FAO: 65,800 Borno farmers kicked out of farms by terrorists",
    "summarized_story": "The Food and Agricultural Organisation of the United Nations has raised the alarm of impending food insecurity in the North-East region, saying insurgency has denied 65,800 farmers access to agricultural inputs in the area.\nHe disclosed that the launch was the sixth rainy season farming intervention being conducted by FAO in Borno, Adamawa and Yobe states since 2016.\nKafeero said supporting rainy season farming was key to the entire insurgency affected region, adding that farmers’ harvests contributed significantly to food security and income generation throughout the year.\n“Access to agricultural inputs for high yields also saves lives and livelihoods of farmers,” he added.\nHe said this year, 65,800 household farmers were supported with agricultural inputs and livestock restocking for fattening, while 40,000 farmers were targeted for the distribution of inputs."
  },
  {
    "headline": "Nigeria must continue to borrow: Lawan",
    "summarized_story": "President of the Senate, Ahmad Lawan has explained that it is necessary for Nigeria to continue to borrow to fund critical projects.\nLawan said that it has become imperative for the Federal Government to continue to borrow responsibly to fund critical projects because Nigeria is poor.\nLawan disclosed this on Thursday while briefing State House correspondents following a closed-door meeting with President Muhammadu Buhari in Abuja.\nBecause of the security challenges we face today, not many investors would like to come to Nigeria.\n“In fact, even those inside Nigeria may not like to invest properly in the sector of infrastructure development,” he said."
  },
  {
    "headline": "JAMB: Enugu cancels Saturday’s sanitation exercise",
    "summarized_story": "Enugu State Government said it has cancelled this month’s sanitation exercise scheduled for Saturday to enhance candidates’ access to the Joint Admission and Matriculation Board (JAMB) examination centres.\nMrs Amaka Anajemba, Managing Director of Enugu State Government Waste Management Authority made this known on Friday in Enugu.\nAnajemba said, in a statement, that the state government had to cancel the exercise because all movement, especially vehicles, would be restricted between 6 am and 10 am.\nShe, however, regretted any inconvenience the cancellation would have caused other residents of the state."
  },
  {
    "headline": "ICYMI: Buhari will be away in London for 3 weeks",
    "summarized_story": "President Muhammadu Buhari will leave Nigeria today for London for a scheduled medical appointment.\nHe will be away for almost three weeks, his second medical leave this year.\nSpecial Adviser on Media and Publicity, Mr. Femi Adesina, said the President is expected back in the country in the second week of July.\n“President Buhari will proceed to London, the United Kingdom on Friday, June 25, 2021, for a scheduled medical follow-up.\n“He is due back in the country during the second week of July, 2021,” the statement said."
  },
  {
    "headline": "Watch CCTV Footage Of Chidinma & Usifo Ataga At A Restaurant Before She Killed Him",
    "summarized_story": "A CCTV image of deceased Michael Usifo Ataga with his murderous side-kick at a restaurant before she murdered him on Thursday has surfaced.\nConcerned friends and relatives reported Ataga, the CEO of Super TV and a director with Super, who lives in Banana Island, Lagos, missing on Sunday after all attempts to contact him proved futile.\nChecks at his Victoria Island office revealed that he was also missing, causing worry among his family, including his wife and children, who live in Abuja.\nUnfortunately, following repeated withdrawals from his account, his deceased body was discovered on Thursday morning in a flat in Lekki Phase 1, Lagos, with multiple stable wounds.\nUsifo, who would have turned 50 this week, was said to have met a girl about two weeks ago and started dating her."
  },
  {
    "headline": "Insecurity: Abia Officers Go Spiritual, Place At Police Station",
    "summarized_story": "A deity-like object (juju) has been placed at a checkpoint in Umuahia, the state capital, by the Nigerian police in Abia in an unusual technique of combating crime.\nThe device was put near the Central Police Station (CPS) in Umuahia, at the St. Finbarr’s/Bende Road Junction.\nWhen the Daily Sun visited the spot, a police officer was seen posing with the juju, while other officers were stationed strategically around the junction, armed to the teeth.\nUnknown gunmen who have recently been burning police formations and killing officers were found to be wearing juju brackets, also known as ‘Odeshi’ in the local slang, on their waists, according to investigations.\nIt was, perhaps, in an effort to neutralise the perceived efficacy of the unknown gunmen’s odeshi that the police acquired theirs."
  },
  {
    "headline": "Amotekun Consult As Robbers Writes Osun community, Request For N20m",
    "summarized_story": "Residents of Olofa Estate, Ofatedo, Osun State, have been terrified after receiving a letter from a group of robbers warning them of an upcoming attack unless they donate N20 million.\n“This is to inform you all that we thieves are coming to this community,” a copy of the note said.\nWe’ll be there in full force.”A resident of the community, who spoke on condition of anonymity, told The Newsmen that he had relocated his family to Osogbo, Osun State capital, following the threat.\nAccording to him, the letters, written in both Yoruba and English, were put at conspicuous points in the community on Wednesday.\nWhen contacted, the Field Commandant, Osun Amotekun Corps, Amitolu Shittu, said the group was aware of the threat letter."
  },
  {
    "headline": "Two Rescued 12 Abducted In Kaduna State",
    "summarized_story": "In Kachia local government area of Kaduna State, the Kaduna Police Command freed two people, while 12 others were abducted by bandits.\nASP Mohammed Jalige, the State Police Public Relations Officer, said in a statement that the operatives were determined to save the remaining victims.\nThe PPRO said that sadly, fourteen (14) persons were unaccounted for while the injured victims were all evacuated to a nearby hospital for immediate medical attention.\nAccording to him, the security team trailed the bandits to the outskirts of the village and rescued two (2) persons whereas the remaining twelve (12) were whisked away by the bandits to a yet to be identified location.\nThe state Police spokesman assured that the Operatives were not relenting in their quest to rescue the remaining victims unhurt."
  },
  {
    "headline": "Pictures: Again, APC caretaker committee meets President Muhammadu Buhari, gets another extension",
    "summarized_story": ""
  },
  {
    "headline": "Breaking: JAMB announces 2021 UTME results *See code to use and check your result",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB) has announced the release of results of candidates after the 2021 Unified Tertiary Matriculation Examination (UTME).\nA press statement by JAMB’s head of media Dr. Fabian Benjamin on Friday morning made it clear that only candidates who sat for the examination on Saturday, 19, and Tuesday, 22 June 2021 are eligible to check their results by sending UTMERESULT to 55019 through the GSM number used by each candidate to obtain profile code and UTME registration with the board and their results would be relayed to them.\nDetails loading…"
  },
  {
    "headline": "Tragedy! Another Military plane crashes, Soldiers dead",
    "summarized_story": "At least 10 Kenyan soldiers were killed on Thursday when a helicopter carrying them crashed while landing near the capital Nairobi, the military and local media said.\nThe Kenya Air Force Mi 171 E helicopter crashed at around 9 a.m. (0600 GMT) in the county of Kajiado, the military said in a statement.\nAt least 10 of the troops were killed and another 13 injured, domestic media reported, citing a government administrator in the area.\nThose who were injured were airlifted to the military hospital in Nairobi for treatment, the military said, adding that air accident investigators were at the scene of the crash.\nThe soldiers aboard were on a training mission, officials said."
  },
  {
    "headline": "Athletes national trials record indicates Tokyo Olympics expectations—Sports Minister",
    "summarized_story": "Dare’s confidence is hinged on the form athletes displayed during the recent Athletics Federation of Nigeria Olympic Trials held at the Sports Complex of Yaba College of Technology, Lagos last week.\nThe minister said, with and they the form and the recorded times by the athletes in the All Nigeria National Olympics trial are flashes of what to expect and are looking good to go.\nShe added that she is happy and certainly the performance is a confidence booster ahead of the Tokyo Olympics.\nThe 32-year-old saw her 10.63 seconds time tie with Jamaican Shelly-Ann FraserPryce’ best time in 2021.\nThe Nigerian has now emerged one of the favourites for the 100m gold at the Tokyo Olympics alongside ShellyAnn Fraser-Pryce who first ran 10.63 seconds this season"
  },
  {
    "headline": "Athletes national trials record indicates Tokyo Olympics expectations—Sports Minister",
    "summarized_story": "Dare’s confidence is hinged on the form athletes displayed during the recent Athletics Federation of Nigeria Olympic Trials held at the Sports Complex of Yaba College of Technology, Lagos last week.\nThe minister said, with and they the form and the recorded times by the athletes in the All Nigeria National Olympics trial are flashes of what to expect and are looking good to go.\nShe added that she is happy and certainly the performance is a confidence booster ahead of the Tokyo Olympics.\nThe 32-year-old saw her 10.63 seconds time tie with Jamaican Shelly-Ann FraserPryce’ best time in 2021.\nThe Nigerian has now emerged one of the favourites for the 100m gold at the Tokyo Olympics alongside ShellyAnn Fraser-Pryce who first ran 10.63 seconds this season"
  },
  {
    "headline": "State-LG crisis and quest for fiscal federalism -NigPilot",
    "summarized_story": "Several people have decried how the third tier of Government has been deprived, denied and dragged down by the other superior tiers in Nigeria.\nLocal governments now suffer from paucity of fund resulting in inability to cater for their basic responsibilities.\nThis is plus the fact that the state governments enjoy other means of funding.\nI hold a strong view that the effort of the state governments and local governments are supposed to be complimentary.\nStrengthen the local government system and many of the challenges we are faced with, including insecurity and unemployment, will be thrashed."
  },
  {
    "headline": "State-LG crisis and quest for fiscal federalism -NigPilot",
    "summarized_story": "Several people have decried how the third tier of Government has been deprived, denied and dragged down by the other superior tiers in Nigeria.\nLocal governments now suffer from paucity of fund resulting in inability to cater for their basic responsibilities.\nThis is plus the fact that the state governments enjoy other means of funding.\nI hold a strong view that the effort of the state governments and local governments are supposed to be complimentary.\nStrengthen the local government system and many of the challenges we are faced with, including insecurity and unemployment, will be thrashed."
  },
  {
    "headline": "Hong Kong pro-democracy paper Apple Daily confirms closure -NigPilot",
    "summarized_story": "Reporters said they planned to print one million copies overnight — a staggering number given Hong Kong’s 7.5 million population.\nApple Daily has long been a thorn in Beijing’s side, with unapologetic support for Hong Kong’s pro-democracy movement and caustic criticism of China’s authoritarian leaders.\nBritish foreign secretary Dominic Raab accused Hong Kong’s authorities of spearheading a “forced closure” of the paper, describing it as “a chilling demonstration of their campaign to silence all opposition voices”.\nChina imposed its security law on Hong Kong last year after the city was convulsed by huge and often violent democracy protests.\n“Every journalist in Hong Kong now has a metaphorical gun pointed at their heads,” Sharron Fast, a lecturer at the University of Hong Kong’s journalism school, told AFP."
  },
  {
    "headline": "Buhari To Embark On Medical Trip To London",
    "summarized_story": "President Muhammadu Buhari will travel to London, the United Kingdom on Friday, the Presidency has said.\nThe Special Adviser to the President on Media and Publicity, Femi Adesina, disclosed this in a statement on Thursday in Abuja.\nHe explained that the President’s trip to London was for a scheduled medical follow-up, adding that he would be back in the country during the second week of July.\nPresident Buhari’s scheduled trip to London comes almost three months since he last visited the United Kingdom for the same purpose.\nHe had travelled to the United Kingdom on March 30 for a routine medical check-up, as indicated in a statement by his media adviser."
  },
  {
    "headline": "VIDEO: UNILAG Student Arrested Over Murder Of Super TV CEO, Claims He Forcefully Had Sex With Her",
    "summarized_story": "The police have arrested a university student accused of killing Usifo Ataga, the Chief Executive Officer of Super TV.\nChidinma Ojukwu, a 300-level Mass Communication student of the University of Lagos (UNILAG), was paraded on Thursday at the Lagos State Police Command headquarters in Ikeja.\nThe Commissioner of Police in the state, Hakeem Odumosu, told reporters at the briefing that the suspect had confessed that she stabbed Ataga.\nHe disclosed that the owner of the rented apartment where the tragic incident occurred has been arrested and held in police detention.\nHe later became violent trying to get to me and I was resisting and defending myself."
  },
  {
    "headline": "Why Nigeria Must Continue To Borrow Responsibly – Senate President",
    "summarized_story": "President of the Senate, Ahmad Lawan, has explained why it is important for the Nigerian government to continue to borrow responsibly to fund critical projects in the country.\nThe Senate President made the remarks on Thursday while briefing State House correspondents after a closed-door meeting with President Muhammadu Buhari in Abuja, the nation’s capital.\nThe Senate President noted that this would be done only after investigating the implementation of such loans through oversight functions to ensure that they were directly deployed for intended projects.\nAccording to him, Nigeria has no other choice than to borrow money and the option of private-public partnerships and Internally Generation Revenue (IGR) was not worthy of consideration.\n“In fact, even those inside Nigeria may not like to invest properly in the sector of infrastructure development,” he said."
  },
  {
    "headline": "Kaduna Security: Bandits Kill Driver, Kidnap 33 People In Kachia",
    "summarized_story": "At least one person has been killed and 33 others abducted following an attack by bandits suspected to be kidnappers in Kachia Local Government Area of Kaduna State.\nDistrict Head of Kachia ward, Idris Suleiman confirmed the incident when security operatives led by the Kaduna State Commissioner for Internal Security and Home Affairs, Samuel Aruwan visited the area.\nBandits have in recent times left Kaduna in a state of unrest, with many being killed and many others being kidnapped, including students of various institutions.\nThe latest attack in Kachia comes a few days after the village head of Dogon Daji community in Sanga Local Government Area of Kaduna State, Mallam Anja, was shot dead by bandits.\nThe marauders raided the residence of the village head and shot him at close range, after which he died on the spot."
  },
  {
    "headline": "Indian Police Probe Fake Vaccine Scams In Two Cities",
    "summarized_story": "Vaccination rates rose sharply this week after the Indian government made shots free following a devastating pandemic surge in April and May.\nKolkata official Atin Ghosh said that the seized vials were falsely labelled as containing the AstraZeneca coronavirus vaccine, branded in India as Covishield.\nPolice seized fake ID cards from the suspect, one of an information ministry official and another as a municipal commissioner.\n“If any emergency arises, civic authorities will organise medical camps in the area to take care of those who have had fake shots,” Barui told AFP.\n“We didn’t think that this could happen when the world is battling the pandemic,” said student Debjit Majumdar, who also received the fake jab."
  },
  {
    "headline": "COVID-19: FG extends deadline for second dose of vaccine to July",
    "summarized_story": "The Federal government has announced an extension of the deadline for second dose of COVID-19 vaccine.\nAccording to Faisal Shuaib, Executive Director of the National Primary Health Care Development, the administration of the second dose of the vaccine was supposed to end on June 25.\nAccording to him, a total of 2,099,568 people have been vaccinated with their first doses, while 1,005,234 have received their second doses of the Oxford/AstraZeneca COVID-19 vaccine as of 24th June 2021.\nHe said, “You would recall that the initial closing date for second dose administration was 25th of June, 2021.\nEven though we have extended the timeline for the second dose administration until 5th of July 2021."
  },
  {
    "headline": "Over 4 million Nigerians will face food shortage in August- FAO",
    "summarized_story": "According to the UN’s Food and Agricultural Organization, over 4 million people will face food shortages starting this month and lasting until August.\nThe Country Representative of FAO in Nigeria, Fred Kafeero, lamenting food insecurity in Nigeria, projected that over four million people will be in need of food assistance between June and August, 2021.\nAdvertisementHe explained that supporting rainy season farming was key to the entire insurgency affected region, adding that farmers’ harvests contributed significantly to food security and income generation throughout the year.\n“The latest CH analysis results projected that over four million people will be in need of food assistance between June and August, 2021,” he said.\n“The launch was the sixth rainy season farming intervention being conducted by FAO in Borno, Adamawa and Yobe states since 2016,” he added."
  },
  {
    "headline": "Residents Of Tashar Abu Block Gusau – Sokoto Road Over Removal Of Army Check Point",
    "summarized_story": "Motorists and commuters along the ever busy Gusau – Sokoto Road were held up in heavy traffic gridlock for several hours following protest by residents of Tashar Abu and surrounding communities over the removal of troops on the highwayThe locals in Bungudu and Maru local government areas says the removal of Army troops on the highway leads to the upsurge of attack on their communities in the last few daysThey want the army authorities to reverse its decision and return the checkpoint to enable them sleep with their two eyes closedThey say the presence of Army troops in the area has reduced the rate of attacks and other criminal activities in the areaAdvertisementA Source who pleaded anonymity says the troops were not removed but army authorities are restrategising its operations in the areaHe adds that the troops will soon be redeployed to the checkpoint with full force to stem the tide of crime in the troubled communitiesThe is still blocked as at the time of filling this report.\nMaru and Bungudu local government areas has suffered attacks by armed Bandits leading to the loss of lives and mass abduction of persons in recent times."
  },
  {
    "headline": "‘No Cross, No Crown’: Soludo Sets Sights on Anambra Government House Despite Challenges",
    "summarized_story": "Despite two unsuccessful attempts to become the executive governor of Anambra State in Southeast Nigeria, renowned economist and former Central Bank Governor, Prof Chukwuma Soludo has again thrown his hat into the political arena again.\nOn Wednesday, he scaled a major hurdle when he secured the ticket of the ruling All Progressives Grand Alliance in the state to emerge the party’s candidate in the rthcoming gubernatorial election slated for November 6, 2021.\nSoludo joined from his country home in Anambra to discuss how he intends to forge party unity among aggrieved members ahead of the election, among other topics."
  },
  {
    "headline": "Russia Mandates Vaccinations for Some as Virus Cases Surge",
    "summarized_story": "But an ambitious plan of vaccinating 30 million Russians by mid-June still has fallen short by a third.\nOfficials have blamed Russians’ lax attitude toward taking necessary precautions and the growing prevalence of more infectious variants.\nKremlin spokesman Dmitry Peskov insisted Thursday the vaccinations in Moscow were “voluntary,” because those refusing to get the shot can still seek a different job.\nPolice quickly cracked down, launching 24 criminal cases last week against sellers of fake vaccination certificates.\nAs of mid-May, just over 33 million doses were produced in Russia, and a significant amount was exported."
  },
  {
    "headline": "Dangote to Expand into Oil and Gas in Cameroon",
    "summarized_story": "Africa’s richest man and President, Dangote Group, Alhaji Aliko Dangote, is diversifying his group’s investments in Cameroon, starting with energy.\n“We have plans to expand our investment to other sectors beginning with oil and gas,” Bloomberg quoted Dangote as telling reporters on Wednesday, after meeting Cameroonian President Paul Biya in the capital, Yaoundé.\nDangote opened a 1.5 million-ton cement grinding facility in the central African nation in March 2015 that ended a 40-year French monopoly in the industry.\nDangote Refinery, situated in Lagos, is expected to become operational by the first quarter of 2022.\nMany in Nigeria also hope the Dangote plant will help alleviate chronically low crop yields in Nigeria, which are partly due to insufficient access to fertiliser."
  },
  {
    "headline": "World Bank Lists Measures for Nigeria to Boost Non-oil Revenue",
    "summarized_story": "The World Bank on Thursday reiterated its call for both state and the federal governments in Nigeria to adopt policies that would increase non-oil revenue.\nHe also advised both the state and the federal governments to embark on property tax reforms by updating or completing property records.\nThe estimate of VAT revenue loss covers both VAT policy choices and compliance gaps, it added.\nThe World Bank stated that the country has much greater revenue potential from VAT than currently being achieved.\n“But, a significant amount of Nigeria’s current VAT revenue likely comes from taxation of capital investment, so this reform will have a significant revenue impact,” it added."
  },
  {
    "headline": "‘We’re Trying to Convince Them’: Some British Athletes ‘Don’t Want Vaccine’ for Tokyo 2020",
    "summarized_story": "The head of the British Olympic Association (BOA) says the organisation is still “trying to convince” some athletes to have the Covid vaccine before Tokyo 2020 starts next month.\nChief executive Andy Anson said “well over 90%” of British athletes will have two vaccine doses by the Olympics.\nAnson said the 18,000-bed athletes’ village in Tokyo will be “probably the toughest environment in sports at this time”.\nWhen asked if he feared similar cases involving British athletes, Anson said: “I’d be a little naive if I said there weren’t going to be.\n“One of the messages that came to us very early on from the athletes was, ‘please don’t make this the Covid Games for us."
  }
]