[
  {
    "headline": "NIMASA mandate not to generate revenue -FG",
    "summarized_story": "The Federal Government says the Nigerian Maritime Administration and Safety Agency’s mandate is not to generate revenue.\nThe Minister of Transportation, Mr Rotimi Amaechi, explained this in a statement by the ministry ‘s Director of Press and Public Relations, Mr Eric Ojiekwe on Saturday.\nHe said, “People put NIMASA under pressure that they must make money; make money for what?\nNIMASA actually is a regulatory authority, not for them to go and look for money.\n”Shippers’ council can charge whatever you want to charge for the dry port but part of the profit that they make in the dry port, will go to the upbringing of those children,” Amaechi noted."
  },
  {
    "headline": "Uzoamaka Ohiri grilled by Police, barred from tackling ex-husband Nedu on social media",
    "summarized_story": "The Lagos State Police Command has grilled Ms. Uzoamaka Ohiri, ex-wife of comedian Chinedu Ani, a.k.a Nedu, for three days and had also asked her to stop posting comments on social media about her ex-husband, The PUNCH has learnt.\nThe investigation of Ohiri, it was learnt, was sequel to a petition against her by her ex-husband, Nedu.\nIn the letter dated September 7, 2021, Uzoamaka was informed that the invitation was merely for fact-finding.\nOn Thursday, on her return, she was warned against making comments about Nedu on social media and was also made to return to the SCID on Friday.\nThe comedian and his ex-wife have been trending on social media for the past one week over allegations of infidelity and domestic violence."
  },
  {
    "headline": "I’m a toy to play with, hotel receptionist tells bewildered guest",
    "summarized_story": "Public speaker, Charles Obinna, took to his Facebook to share how he was offered sex by a hotel receptionist, making his followers to warn him that such a facility is not safe for him.\nObinna stated that when he checked into the unnamed hotel, the front desk officer, a female, told him that she could also be “a toy to play with” if he needed one.\nTaking to his Facebook page, Obinna says, “Just checked into this hotel, took my bath, stepped out to walk round the street before I would start work.\n“‘In case you need a toy to play with, I am equal to the task.’Read Also“It took a few seconds for this to register into my small head.\nFor such to happen, that hospitality outfit has no standard.”Another follower, Blessing Maduka-Sunday, said, “May she understand her worth; that she is not a toy."
  },
  {
    "headline": "UK to support Nasarawa in trade, investment ― High Commissioner",
    "summarized_story": "British High Commissioner to Nigeria, Catriona LaingBy Emmanuel Elebeke, AbujaThe UK Government has promised to support Nasarawa State in the area of trade and investment.\nDuring the visit, the High Commissioner got the chance to see at first hand some of the investment opportunities in the state.\nDuring her stay in Nasarawa State, the High Commissioner visited the Nasarawa Bus Terminal in Karu, to witness the progress the initiative is taking as construction at the site continues.\nThe visit to Nasarawa State was an opportunity for the High Commissioner to stop over at the Kilema Local Rice Mill.\nThis is also another element of Nigeria’s climate change commitments – at least 50% of Nigeria’s rice should be grown this way."
  },
  {
    "headline": "Yiaga hails INEC’s Bimodal Voter Accreditation System",
    "summarized_story": "This includes: serving as the INEC Voter Enrolment Device (IVED) during voter registration, serving as the Bimodal Voter Accreditation System (BVAS) for voter accreditation on Election Day which replaces the Smart Card Reader, and serving as the INEC Results Viewing Device (IReV Device) to be used for election results upload on Election Day.\nThe statement reads in part, “This recent innovation is worthy of commendation especially because it is designed to ensure full voter authentication on Election Day.\n“The BVAS as presented will address this issue because it is designed as a bimodal biometric authentication device integrating both fingerprint and facial technology.\nAccordingly, on Election Day, the device will be used to authenticate voters either through fingerprint or facial recognition during accreditation.\nThus, we are optimistic that the new BVAS will further boost citizens’ confidence in the process and encourage citizens’ participation."
  },
  {
    "headline": "‘Over 1,000 children abducted in Nigeria since January’",
    "summarized_story": "•Group urges govt to protect schools in Nigeria•Says number of out-of-school children to increaseBy Ibrahim Wuyo, KadunaSave the Children International has urged the Federal and state governments in Nigeria to put in place mechanisms that would ensure the protection of schools and other learning environments.\nThe organisation said from January to August, 2021, more than 1000 children were abducted in Nigeria, with so many of them still in the hands of their abductors.\nFrom January to August, 2021, over 1000 children were abducted in Nigeria, with so many of them still in the hands of their abductors, they said.\n”The organisation said “ in Nigeria, the number of out-of-school children, according to UNICEF, was 10.5million before the effects of the conflict, humanitarian crisis and COVID-19 pandemic were felt.\nWith the total or partial closure of schools in Zamfara, Katsina, Adamawa, Kaduna, Niger and other States due to kidnapping and abduction of school children, the number of children that would be prevented from accessing education in Nigeria could be on the increase.”"
  },
  {
    "headline": "Nigeria-Vietnam Trade/Cultural Association debuts",
    "summarized_story": "By Dennis AgboThe Nigeria-Vietnam Economic, Trade and Cultural Association, (NVETCA) has been constituted, with the aim of promoting economic and cultural relations between the two counties.\nThe promoter of the association, Alhaji Sani Bako stated that he was delighted that after rigorous scrutiny by the Ministry of Justice and various organs of government and the Nigerian Association of Chambers of Commerce, Industry, Mines and Agriculture, (NACCIMA) the association was eventually registered.\nAlhaji Sani who was Nigeria’s pioneer Envoy to the Asian country, further reiterated that “the association intends to promote bilateral economic, trade and cultural relations between the two counties “.\nDuring his term as the head of mission in Vietnam, Alhaji Bako took cognisance of the advancement of Vietnam in agriculture, pharmaceutical and technology and did a lot to promote collaborations between the two counties.\nIt is believed that it is the same initiatives that have propelled Alhaji Sank Bako to pursue the formation of this association to the"
  },
  {
    "headline": "Pele recuperating after surgery to remove tumour",
    "summarized_story": "PelePele remains in hospital but is recovering well after having surgery to remove a tumour from his large intestine.\nBrazil’s all-time leading goal scorer released another update on Instagram about his health, following on from his post on Monday that explained he had undertaken surgery.\nALSO READ: Enugu state FA endorses Obidigwe Chukwu Foundation Cup“My friends, with each passing day I feel a little better,” Pele posted on Friday.\n“I’m looking forward to playing again, but I’m still going to recover for a few more days.\n“While I’m here, I take the opportunity to talk a lot with my family and to rest."
  },
  {
    "headline": "Bandits bring home abducted Niger traditional ruler",
    "summarized_story": "The released Dodo of Wawa Community in Borgu Kingdom, Borgu Local Government Area of Niger State, Dr, Mahmud Ahmed Aliyu was purportedly returned to his palace by those that abducted him last Saturday.\nDAILY POST also learnt that his kidnap was due to his strong opposition against criminal activities perpetrated by bandits in his area.\nOur Correspondent learnt the gunmen brought him unnoticed during power outage, and dropped him close to the palace and zoomed off from the area.\nThe Wallin Wawa also explained that the traditional ruler told his subjects that he was not tortured by his abductors, but was accorded reasonable treatment.\nHowever, efforts to get the reaction of the Dodo failed as calls put to his phone were not connecting."
  },
  {
    "headline": "Fuel scarcity bites hard in Owerri, residents lament",
    "summarized_story": "Long queues returned at several filling stations in the heartland city of Owerri, Imo State capital on Saturday.\nThis is as some filling stations were selling petrol between N250 to N300 per litre..DAILY POST correspondent who visited many petrol stations in the town, observed that they were under lock and key.\nA motorist, Emaka Opara, lamented the situation and urged government to find a lasting solution to the problem of fuel scarcity.\nAt the NNPC filling station at Onitsha Road and few others, motorists queued to buy fuel.\nOne of the salesmen at the Mobile filling station Egbu road explained that some of the filling stations had the product but have been instructed not to sell."
  },
  {
    "headline": "Jigawa LG reopens schools after cholera outbreak",
    "summarized_story": "Guri Local Government of Jigawa State has reopened schools closed due to the cholera outbreak in the area.\nHe said the Education Authority had ordered the immediate re-opening of six schools that were closed as a result of cholera out break in the schools.\nAlanjo said the affected primary and junior secondary schools include Madamuwa, Zugo, Lafiya, Dolen Zugo primary schools, junior and senior secondary schools Lafiya.\nHe commended the state, local Governments and development partners for the supply of drugs to curtail the outbreak of the disease.\nDAILY POST reported that the Jigawa State Ministry of health had confirmed the death of over 100 persons as a result of cholera outbreak in nineteen local Government areas of the State."
  },
  {
    "headline": "Southwest group vows to resist banditry, criminality",
    "summarized_story": "The Southwest Security Stakeholders Group, SSSG, has vowed that bandits and criminals will face their wrath if they do not stay away from the zone.\nAccording to the statement, bandits have variously attacked the North East, North West and North Central, leaving in its wake, disturbing scenes of terror, killings and destruction that are capable of destroying the sanctity of Nigeria.\nIt noted that any attempt to invade the Southwest would bring about both economic and political doom.\nThe group dismissed Sheikh Gumi’s visit to Sunday Igboho’s town, noting that it was an attempt to mock and undermine the efforts of Yoruba activists and freedom fighters.\nThe group said, “SSSG is driven by the calls to ensure effective security across the southwest."
  },
  {
    "headline": "Kwara Polytechnic students protest alleged extortion by security agents",
    "summarized_story": "Some off-campus students of the Kwara State Polytechnic, Ilorin at Eleko village on Friday protested alleged extortion by security agents.\nThey blocked the road at Eleko village, along Kwara Polytechnic at about 17.45hours to protest alleged harassment and extortion by security agents in the area.\nThe angry students complained bitterly that security agents constantly raided the area under the guise of searching for ‘yahoo-yahoo’ boys.\nThey claimed that in the process, the security agents harass and extort innocent students and residents of the area.\nIn the violence that broke out, the security agents fired tear-gas leading to some sustaining injuries."
  },
  {
    "headline": "Alleged support for bandits: S/West, Middle Belt groups attack Gumi",
    "summarized_story": "By Vincent KaluThe Middle Belt Forum and a group in the South West, South-West Security Stakeholders Group (SSSG) have carpeted Islamic cleric, Sheikh Abubakar Gumi over what they called his sympathy for bandits.\nThe South-West group also warned bandits and other criminal elements to steer clear of the region, or face the wrath of the group.\n“Sheikh Gumi is a Nigerian, he has a right to visit any part of the country,” it noted.\nSo, what the government is doing now is to tell the bandits that they were not stronger in anywhere.\n“The time for that amnesty that Sheikh Gumi was asking for has passed and elapsed."
  },
  {
    "headline": "Yes, sex-for-roles exists in Nollywood –Temidayo Babatunde",
    "summarized_story": "Beautiful actress, Temidayo Babatunde has vowed never in her life to be a second wife.\nThe single mother of one revealed to Saturday Sun that though, she is currently in a relationship, she’s not committed to it.\nBut if he is married and wants me to be his second wife, it is a no, no!\nSpeaking on sexual harassment that seems to have become a norm in the movie industry, the seasoned movie producer asserted that she’s lucky not to have experienced such.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "VAT Collection: Appeal Court bars Rivers, Lagos, stops execution of judgement",
    "summarized_story": "From Godwin Tsa, AbujaThe Abuja division of the Court of Appeal on Friday temporarily suspended the execution of the judgment of the Federal High Court in Port Harcourt stopping the Federal Inland Revenue Services (FIRS) from collecting Value Added Tax (VAT) and Personal Income Tax (PIT) in Rivers State.\nThe court has ordered the appellant to file and exchange their processes in the motion for joinder filed by Lagos state just as the respondents were equally given two days to respond.\nJustice Stephen Pam of the Federal High court, Port Harcourt had in his judgment, held that it is the Rives State Government that should collect VAT and PIT henceforth in the state.\nFHC/PH/CS/149/2020, filed by the Attorney General for Rivers State (plaintiff), against the Federal Inland Revenue Service (first defendant) and the Attorney General of the Federation (second defendant.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Sit-at-home: South East loses N50bn in 4 weeks",
    "summarized_story": "People said the issues of killings, beheading and burning of commercial buses linked to the enforcers of the sit-at-home order were enough reasons for them to stay at home to avoid being attacked.\nEvery sector has continued to bear the brunt of the frequent sit-at-home in the South East.\nOf this amount, unverified statistics said the transport sector loses at least N3billion any day there is lockdown in the region.\nAn average of one million people move around, in and out of South East each day, at N3, 000 per traveller.\nAccording to them, they decided to close business every Monday because enforcers of the sit-at-home order allegedly targeted their vehicles, vandalised, and burnt them while also killing some of their passengers."
  },
  {
    "headline": "Safety tips for driving in the rain",
    "summarized_story": "Driving your vehicle in the rain can be very challenging, which explains why rainy conditions account for very high accident rates in all parts of the world.\nThe Federal Road Safety Corps (FRSC) also makes it a duty to enlighten motorists and other road users with tips on how to stay safe in the rain.\n•If you are not yet out in the rain, wait until the weather improves, if possible If you feel uncomfortable driving in the rain and can postpone your trip or go by public transport service, wait until the weather improves before driving.\n•Take a good look at the tread of your vehicle’s tyres.\nBefore driving in the rain, double check the vehicle’s vital equipment to ensure they will still function properly when needed."
  },
  {
    "headline": "EXCLUSIVE: Military Colleagues Raise Ransom Secretly For Nigerian Army Major Abducted By Bandits For 17 Days",
    "summarized_story": "Some friends and colleagues of Major Christopher Datong, who has spent 17 days in the captivity of the bandits who attacked the Nigerian Defence Academy in Kaduna State, are making frantic efforts to rescue him, including raising a ransom, SaharaReporters has gathered.\nA top military source, however, confided in SaharaReporters that a ransom was being prepared among his friends in the Nigerian Army to be paid to the bandits through some religious negotiators.\nSaharaReporters had on August 25 reported that the bandits after abducting Datong got across to the military authorities to demand a ransom of N200million to free him.\nSaharaReporters had also reported that troops of the Nigerian Army and military aircraft searching for Major Datong, were having a tough time.\nIt involves a military officer; it involves a military establishment."
  },
  {
    "headline": "EXCLUSIVE: Military Colleagues Raise Ransom Secretly For Nigerian Army Major Abducted By Bandits For 17 Days",
    "summarized_story": "Some friends and colleagues of Major Christopher Datong, who has spent 17 days in the captivity of the bandits who attacked the Nigerian Defence Academy in Kaduna State, are making frantic efforts to rescue him, including raising a ransom, SaharaReporters has gathered.\nA top military source, however, confided in SaharaReporters that a ransom was being prepared among his friends in the Nigerian Army to be paid to the bandits through some religious negotiators.\nSaharaReporters had on August 25 reported that the bandits after abducting Datong got across to the military authorities to demand a ransom of N200million to free him.\nSaharaReporters had also reported that troops of the Nigerian Army and military aircraft searching for Major Datong, were having a tough time.\nIt involves a military officer; it involves a military establishment."
  },
  {
    "headline": "BREAKING: Lagos Governor, Sanwo-Olu Signs Value Added Tax Bill Into Law, Joins Rivers Governor",
    "summarized_story": "Babajide Sanwo-Olu, Governor of Lagos State, has signed the state Value Added Tax (VAT) Bill into law.\n“Lagos State Governor Babajide Sanwo-Olu has signed into law the State VAT Bill as passed by the House of Assembly.\nThe Lagos State House of Assembly had on Thursday unanimous passed the bill.\nGovernor Nyesom Wike of Rivers State on Thursday signed into law the bill on Value-Added Tax (VAT) collection in the state.\nWike signed the bill which was recently passed by the state House of Assembly at the Government House, Port Harcourt."
  },
  {
    "headline": "BREAKING: Lagos Governor, Sanwo-Olu Signs Value Added Tax Bill Into Law, Joins Rivers Governor",
    "summarized_story": "Babajide Sanwo-Olu, Governor of Lagos State, has signed the state Value Added Tax (VAT) Bill into law.\n“Lagos State Governor Babajide Sanwo-Olu has signed into law the State VAT Bill as passed by the House of Assembly.\nThe Lagos State House of Assembly had on Thursday unanimous passed the bill.\nGovernor Nyesom Wike of Rivers State on Thursday signed into law the bill on Value-Added Tax (VAT) collection in the state.\nWike signed the bill which was recently passed by the state House of Assembly at the Government House, Port Harcourt."
  },
  {
    "headline": "Ailing Tinubu Sandwiched Between Nigerian Senators In New Photo As Lawmakers Campaign For Him To Become President",
    "summarized_story": "About five Nigerian senators have joined the political pilgrimage to London, the United Kingdom, to visit the ailing National Leader of the All Progressive Congress (APC) and former Lagos State governor, Bola Tinubu.\nThe senators were; Opeyemi Bamidele from the Ekiti Central Senatorial District, Solomon Adeola representing Lagos West Senatorial District, Tokunbo Abiru, representing Lagos East Senatorial District, Adelere Oriolowo from the Osun West Senatorial District and Senator representing Niger East Senatorial District, Mohammed Musa.\nOne of the senators, Adeola, posted the visit on his Facebook, while subtly campaigning for the ailing APC leader to take over the helms of affairs of Nigeria in 2023.\nA close source to the APC leader told SaharaReporters that Tinubu makes serious frantic efforts to stand as his hands and legs currently fail him.\nSaharaReporters had on August 12 reported that Buhari visited Tinubu in London after his (Tinubu) second surgery at that time."
  },
  {
    "headline": "Bawa: FG spent N6trn on terrorism war, lost N5.4trn to tax evasion",
    "summarized_story": "Abdulrasheed Bawa, chairman of the EFCC, says the federal government has spent N6 trillion on the war against insurgency since 2008, and lost N5.4 trillion to tax evasion by multi-national corporations operating in the country between 2011 and 2021.\nThe spokesman said Bawa was represented by Sambo Mayana, his deputy chief of staff.\nCiting a report by the organisation for economic cooperation and development, Bawa said resources that could support a country’s development are lost through criminal acts like corruption, tax evasion, money laundering, and others.\nBawa said records show that as of August 2021, the EFCC has over 3,408 convictions.\nWe have arrested over 1500 internet fraudsters, many of whom are being prosecuted,” he added."
  },
  {
    "headline": "Bawa: FG spent N6trn on terrorism war, lost N5.4trn to tax evasion",
    "summarized_story": "Abdulrasheed Bawa, chairman of the EFCC, says the federal government has spent N6 trillion on the war against insurgency since 2008, and lost N5.4 trillion to tax evasion by multi-national corporations operating in the country between 2011 and 2021.\nThe spokesman said Bawa was represented by Sambo Mayana, his deputy chief of staff.\nCiting a report by the organisation for economic cooperation and development, Bawa said resources that could support a country’s development are lost through criminal acts like corruption, tax evasion, money laundering, and others.\nBawa said records show that as of August 2021, the EFCC has over 3,408 convictions.\nWe have arrested over 1500 internet fraudsters, many of whom are being prosecuted,” he added."
  },
  {
    "headline": "Bandits 'hungry', demand food as ransom after governors shut markets in north-west",
    "summarized_story": "The decision of some governors in the north-west to close markets in the region is reportedly taking a toll on bandits.\nAdvertisementThree governors in the region ordered the closure of markets in their states to check the activities of bandits that have led to abductions and loss of property.\nAccording to Daily Trust, the bandits in Sokoto are now demanding food for the release of their captives.\nThe newspaper quoted a resident of Sabo Birni who said a neighbour’s ward was released after food items were given to the bandits.\nAnother resident of Sokoto said bandits requested food items and drinks to release a driver they had abducted."
  },
  {
    "headline": "Bandits 'hungry', demand food as ransom after governors shut markets in north-west",
    "summarized_story": "The decision of some governors in the north-west to close markets in the region is reportedly taking a toll on bandits.\nAdvertisementThree governors in the region ordered the closure of markets in their states to check the activities of bandits that have led to abductions and loss of property.\nAccording to Daily Trust, the bandits in Sokoto are now demanding food for the release of their captives.\nThe newspaper quoted a resident of Sabo Birni who said a neighbour’s ward was released after food items were given to the bandits.\nAnother resident of Sokoto said bandits requested food items and drinks to release a driver they had abducted."
  },
  {
    "headline": "Daily COVID Tracker: Nigeria reports 466 infections in 13 states, 186 recoveries",
    "summarized_story": "AdvertisementGermany recommends COVID vaccination for pregnant womenThe Permanent Vaccination Commission (STIKO), Germany’s vaccine advisory body, has recommended that women who are pregnant or breastfeeding should be vaccinated with mRNA-based COVID-19 shots.\nAccording to the guidance released on Friday, STIKO advised women to receive two doses of the vaccine from the second trimester of pregnancy.\nThe agency said the infections were logged in 12 states and the federal capital territory (FCT).\nAdvertisementLagos recorded the highest figure of infections with 134 cases, followed by Rivers with 82 infections.\nNovavax to produce 2bn COVID-19 vaccine doses in 2022Novavax, vaccine developer, says at least two billion doses of its COVID-19 vaccine will be available in 2022."
  },
  {
    "headline": "Meet the startup transforming informal recycling in Nigeria",
    "summarized_story": "Waste collection methods driven by local authorities remain inadequate, particularly in rural areas.\nIt serves two broad sets of users – waste producers and recycling businesses.\nOn the business side are mobile collectors – typically young, low-income Nigerians – that fulfill on-demand recovery requests from waste producers within an area.\nWaste producers get paid directly in mobile wallets and funds can be redeemed in cash or directly transferred to the individual’s account.\nImage Credit: SuppliedTransforming informal recycling in NigeriaIn Nigeria, the bulk of recyclable waste collection and processing is carried out by informal waste pickers and processors, with unregistered SMEs dominating the billion-dollar recycling sector."
  },
  {
    "headline": "Why Nigeria’s vehicle financing culture is struggling to take flight",
    "summarized_story": "But insufficient purchasing power among middle-class Nigerians coupled with limited or no access to vehicle financing puts cars out of reach for over 90% of the population.\nIn developed economies, car loans and vehicle financing schemes help people spread out vehicle payments over several months or even years.\nTwo major factors that influence the access and affordability of vehicle financing in Nigeria are interest rates and the value of the vehicle being financed, according to Gbenro Dara.\nAccording to Dara, the latter factor is the biggest drawback when it comes to vehicle financing in Nigeria.\nSeveral microlenders have developed vehicle financing programs, which take the asset as collateral."
  },
  {
    "headline": "MTN Group, Africa’s largest telecom, reportedly in talks to sell Afghanistan arm",
    "summarized_story": "Africa’s largest telecom company MTN Group is reportedly in talks with potential international buyers for its wireless business in Afghanistan per Bloomberg.\nThe South Africa headquartered company is currently the market leader in Afghanistan with a 40% share and is in discussions with several parties in ongoing negotiations to sell its Afghanistan arm.\nA writedown of MTN’s Afghanistan business without any proceeds from disposal is estimated to cost about R700 million ($49 million) according to undisclosed sources familiar with the negotiations.\nThe sale of its Afghanistan unit is crucial to MTN as it plans to raise about R15 billion ($1 billion) from shareholding sales in markets outside Africa.\nMTN currently serves over six million customers in Afghanistan, its planned exit could serve as an opportunity for other Afghanistan telecom players to expand their market share, while MTN does the same in Africa."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "Street food like no other: The best Suya spots in Lagos",
    "summarized_story": "Street food like no other: The best Suya spots in LagosEvery culture has it.\nSome places offer suya on the menu but nothing beats the taste of suya from a Mai Suya (a suya seller).\nPolo Club SuyaLocated in Ikoyi, the polo club is a members-only club known for polo matches, networking, and socialising.\nAs the name indicates, Glover Court is located on Glover Court in Ikoyi.\nA list of the best Suya spots in Lagos for the next time that craving kicks in!"
  },
  {
    "headline": "More woes for Nigeria over 25% cut in COVAX supplies",
    "summarized_story": "Nigeria might have to develop a stronger strategy to acquire COVID-19 vaccines outside the COVAX as export restrictions in India, scale-up hurdles at manufacturing sites and regulatory bureaucracies have forced the global scheme to cut its 2021 supply forecast by 25 percent.\nBut thanks to supply hiccups, the latest update of COVAX supply forecast indicates that a total of approximately 1.4 billion doses are the most realistic target achievable for 2021.\nA threat to the scheme poses a significant challenge to a source that has provided about 70 percent of the vaccines available in Nigeria.\nOf the 1.4 billion doses expected under the most likely scenario, 1.2 billion will be available for all participating countries to cover 20 percent of their populations.\nHowever, Nigeria has only been able to cover 2.5 percent of its estimated 206 million population fully with 10.4 million doses received from both COVAX and other sources."
  },
  {
    "headline": "Insecurity, cost of building materials threaten Nigeria’s real estate growth",
    "summarized_story": "For two straight quarters after it exited recession in the last quarter of 2020 with 2.81 percent growth, the Nigerian real estate sector has recorded impressive positive growth.\nThe real threat to the real estate sector growth is building material prices.\nHe said serviced and shared apartments were mostly on the Island, as investors were delving into commercial real estate in that area.\nAmid all these, analysts still hope, saying that improved economic activities and low-interest-rate environment would support the real estate sector growth in Q3 ’21.\nThe demand for commercial real estate, especially office space, will continue to rise as more companies resume physical work."
  },
  {
    "headline": "College of education Abudu ready for use – Gov Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbudu — Following completion of the College of Education, Abudu campus in Orhionmwon local government area of Edo state, Governor Godwin Obaseki has confirmed the institution’s readiness to commence academic activities.\nGov Obaseki confirmed the development on Thursday at the State College of Agriculture Iguoriakhi, near Benin city.\nObaseki said his administration promised to “rebuild” all state-owned tertiary institutions, hence the revamping of campuses at Abudu, Afuze, Igueben and others.\n“The College of Education has also progressed in terms of work, the Abudu Campus is ready, we are revamping Igueben and we have started work in Afuze.\nHowever, while January 2022 has been fixed for the reopening of the Agriculture college at Iguoriakhi, date for inauguration of the completed multi-million naira ultra modern Abudu campus is still being expected."
  },
  {
    "headline": "NNPC N287bn Profit: Atedo Peterside Got it wrong – Nigerian Observer",
    "summarized_story": "It is important to emphasise that this is the third consecutive year, the NNPC under the watch of Mele Kyari is publishing its Audited Financial Statement.\nNigerians can readily recall that President Muhammadu Buhari promised to turn around the fortunes of the then ailing national oil corporation and reposition it for profitability.\nThis was the chief reason why he appointed Mallam Mele Kyari as the Group Managing Director of the NNPC in the first place.\nThe NNPC we know before the coming on board of Mele Kyari and his management team operated as an opaque institution.\nTo demonstrate his commitment to taking NNPC to a profit-making corporation, Mele Kyari launched the Transparency, Accountability and Performance Excellence (TAPE) programme."
  },
  {
    "headline": "NUJ Resolves Impasse In Rivers Council, Inaugurates Caretaker Committee – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe National Secretariat of the Nigeria Union of Journalists (NUJ), has resolved the seeming crisis that rocked the Rivers State Council of NUJ after their election was stalemated.\nToday, Thursday 9th September, 2021, a Caretaker Committee of the Council was inaugurated to pilot the affairs of the Council pending when it would be able to bring all parties together for a proper election to usher in a substantive State Working Committee for the Council.\nHe asked the newly constituted Caretaker Committee members to urgently restore peace to the Council and put machinery in place to conduct the Council election soonest.\nHe frowned at the behaviours and actions of certain members and leaders of Rivers Council who tried vehemently to resist the delegated officers from carrying out the assignment for which they were sent Rivers State.\nResponding to questions from newsmen, the new Caretaker Committee Chairman, Comrade Amaechi Okonkwo promised to ensure a peaceful election of the Council in no time."
  },
  {
    "headline": "Obaseki charges newly employed Edo workers on commitment, service delivery …assures of better wages for Edo civil, public servants – Nigerian Observer",
    "summarized_story": "Obaseki gave the charge while delivering closing remarks at the closing ceremony for the on-boarding programme for the new workers employed into the Edo State Civil and Public Service, at the John Odigie-Oyegun Training Centre, in Benin City.\nObaseki noted: “Today, we are completing the on-boarding session for the first set of newly appointed public and civil servants.\nHe said: “The focus and plan of my administration is to recruit 2,000 into the Edo State Civil and Public Service before the end of my term as Governor of Edo State on November 12th, 2024.\nThis will be a major transformation of the civil and public service in the State.\nWe embarked on rebuilding the service to make things work in Edo State and Nigeria."
  },
  {
    "headline": "Nigeria Immigration Service gets acting comptroller-general",
    "summarized_story": "ADVERTISEMENTThe Nigeria Immigration Service (NIS) has appointed its deputy comptroller-general in charge of finance and account, Idris Jere, an the acting comptroller-general of the service.\nA valedictory session held in his honour on Friday in Abuja.\nMr Babandede was appointed by President Muhammadu Buhari on May 15, 2016 to succeed Martin Abeshi.\nHe appealed to anyone who will succeed him not to “throw away the ideas we stand for”.\nHe promised to be an ambassador of the NIS, saying he will always be ready to assist whenever his attention is required."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Oscar Onyema elected to the board of World Federation of Exchanges",
    "summarized_story": "The Group Managing Director/Chief Executive Officer of Nigerian Exchange Group (“NGX Group”) Plc, Mr. Oscar N. Onyema, OON, has been elected to the Board of World Federation of Exchanges (WFE).\nWith the election, Onyema will serve on the WFE board for a 3-year term, representing Europe-Middle East-Africa (EMEA) region.\nCommenting on the development, Onyema stated, “I am honoured to be elected to the board of the WFE which is the global group for exchanges and clearing houses (CCPs) around the world.\nThis is an important achievement for Nigerian Exchange Group and the Nigerian financial market.\nOn her part, the Chief Executive Officer, WFE, Ms. Nandini Sukumar noted that “The WFE welcomes Nigerian Exchange Group and Oscar N. Onyema, OON, a leader and thinker, to the Board of Directors."
  },
  {
    "headline": "Union Bank CEO, increases stake in bank by N20.6 million",
    "summarized_story": "The Chief Executive Officer of Union Bank of Nigeria, Mr. Emeka Okonkwo, has increased his stake in the bank by acquiring an additional 3,951,874 units of the bank’s shares, worth N20.6 million.\nThis was disclosed in a notice signed by the Company’s Secretary/General Counsel, Sonuyiwa Sonubi.\nThe notice said the transaction took place at the floor of the Nigerian Exchange Limited (NGX), in Lagos, Nigeria.\nHe had joined the league of Union Bank’s biggest shareholders in May 2021, after he acquired an additional 2.4 million units of shares worth N11.9 million, thereby raising his total holdings in the bank to 8,094,748 units, translating to about 0.03% of the total shareholdings.\nUnion Bank closed trading for the week ended 10th of September, 2021 with a share price of N5.05 per share"
  },
  {
    "headline": "BREAKING: Like Rivers, Sanwo-Olu signs Lagos VAT Bill into law",
    "summarized_story": "Lagos State Governor Babajide Sanwo-Olu has signed into law the State VAT Bill as passed by the House of Assembly, a statement by the state’s commissioner for information, Gbenga Omotoso has said.\nThe Governor signed the “bill for a law to impose and charge VAT on certain goods and services” at about 11.\nThe development comes amid controversy over collection of VAT between some, namely Lagos and Rivers.\nRecently, a federal High Court in Rivers ruled that VAT collection is the prerogative of the state government, a decision the Federal Inland Revenue appealed at the Appeal Court in Abuja.\nThe appellate court specifically ordered all the parties that have subjected themselves before it to “refrain from taking any action to give effect to the judgement of the Rivers State High Court”, which gave Rivers State Government the right to collect VAT revenue, instead of the FIRS."
  },
  {
    "headline": "VAT Controversy: Appeal Court grants FIRS request, orders Rivers, Lagos to maintain status quo",
    "summarized_story": "The Court of Appeal sitting in Abuja, on Friday, ordered both Rivers and Lagos States to maintain status quo with respect to the the collection of Value Added Tax (VAT), pending the determination of an appeal that was lodged before it by the Federal Inland Revenue Service (FIRS)The appellate court said the order was to preserve the ‘Res’ (subject matter) of the appeal before it.\nThe appellate court specifically ordered all the parties that have subjected themselves before it to “refrain from taking any action to give effect to the judgement of the Rivers State High Court”, which gave Rivers State Government the right to collect VAT revenue, instead of the FIRS.\nA three-man panel of Justices of the appellate court led by Justice Haruna Tsammani made the order after it deferred hearing of an application Lagos State filed to be joined as an interested party in the matter, till September 16.\nLagos which had applied, without success to be joined in the Rivers appeal, had through its Attorney-General, Moyosore Onibanjo (SAN) protested against the issuance of an order for the maintenance of status quo, insisting that such order could not be binding on it, since it was yet to be joined as a party in the appeal by FIRS."
  },
  {
    "headline": "A/Ibom Govt, NEMA Donate Relief Materials To Victims Of Boundary Crisis",
    "summarized_story": "The Akwa Ibom State government and the National Emergency Management Agency (NEMA) have donated relief materials to 761 victims of boundary crisis involving Oku Iboku community in Akwa Ibom and Ikot Offiong community in Cross River State.\nThe deputy governor commended the NEMA for always responding to the plight of the state in critical times of need.\nOnuk described the federal and state governments’ action as being responsible and responsive to the plight of its citizens.\nThe clan head of Oku Iboku, Etebom Essien Edet Okokon, thanked the federal and state governments for coming to the rescue of the victims.\nOkokon called on national boundary commission to expedite action to the demarcation of the area for lasting peace."
  },
  {
    "headline": "A/Ibom Govt, NEMA Donate Relief Materials To Victims Of Boundary Crisis",
    "summarized_story": "The Akwa Ibom State government and the National Emergency Management Agency (NEMA) have donated relief materials to 761 victims of boundary crisis involving Oku Iboku community in Akwa Ibom and Ikot Offiong community in Cross River State.\nThe deputy governor commended the NEMA for always responding to the plight of the state in critical times of need.\nOnuk described the federal and state governments’ action as being responsible and responsive to the plight of its citizens.\nThe clan head of Oku Iboku, Etebom Essien Edet Okokon, thanked the federal and state governments for coming to the rescue of the victims.\nOkokon called on national boundary commission to expedite action to the demarcation of the area for lasting peace."
  },
  {
    "headline": "INEC Set For Assembly By-election In Delta",
    "summarized_story": "The Independent National Electoral Commission says 14 political parties indicated interest for the Isoko South Constituency 1 bye election while 12 parties have candidates for today’s contest.\nThe seat became vacant following the death of the member representing the area, Mr. Kenneth Ogba in July.\nAmong the parties are the APC and PDP which have engaged in a fierce campaign and mobilization of support for their candidates.\nADVERTISEMENTGovernor Ifeanyi Okowa personally led the PDP campaign train which was in Isoko South local government area earlier this week after Senator Ovie Omo-Agege, the deputy senate president, had led the campaign train of the party to the local government area.\nOn the other hand, Governor Okowa, while addressing PDP members and supporters at a rally at Oleh, administrative headquarters of Isoko South on Wednesday stressed the importance of mobilisation of the electorate."
  },
  {
    "headline": "INEC Set For Assembly By-election In Delta",
    "summarized_story": "The Independent National Electoral Commission says 14 political parties indicated interest for the Isoko South Constituency 1 bye election while 12 parties have candidates for today’s contest.\nThe seat became vacant following the death of the member representing the area, Mr. Kenneth Ogba in July.\nAmong the parties are the APC and PDP which have engaged in a fierce campaign and mobilization of support for their candidates.\nADVERTISEMENTGovernor Ifeanyi Okowa personally led the PDP campaign train which was in Isoko South local government area earlier this week after Senator Ovie Omo-Agege, the deputy senate president, had led the campaign train of the party to the local government area.\nOn the other hand, Governor Okowa, while addressing PDP members and supporters at a rally at Oleh, administrative headquarters of Isoko South on Wednesday stressed the importance of mobilisation of the electorate."
  },
  {
    "headline": "Insecurity: Why Traditional Rulers Need Constitutional Sovereignty – Etsu Nupe",
    "summarized_story": "As the chairman of Niger State Council of Traditional Rulers, the debate about whether or not to allow the traditional rulers some constitutionally guaranteed functions has been raging for long.\nTo avert insecurity and ensure peacebuilding, we have been advocating for a constitutional role for traditional rulers.\nGiving a constitutional role to traditional rulers will allow them to contribute their quota to national development.\nIn the past when traditional rulers had such constitutional empowerment, the polity was peaceful, progressive, decent, and full of beautiful tradition and culture.\nWe must think in this direction, constitutional roles for traditional rulers must be inculcated into the system, and this is because the role of traditional rulers in securing the lives and properties of the people cannot be overemphasised."
  },
  {
    "headline": "Soldiers’ widows beg Army: We’re suffering, pay us our husbands’ life insurance claims",
    "summarized_story": "But the life insurance claims had yet to be paid since then.\nIt’s unfair to us.’’She urged the army and the defence military to pay their husbands’ life insurance claims to help them forge ahead financially.\nI am appealing to them to pay our husbands’ life insurance claims.\n“We are still working on the insurance claims; everything is being done to fast-track the payment,’’ Abdulkadri stated.\nHe said the government needed not to be told to fast-track the processing and ensure payment of the life insurance claims in view of the sacrifices made by the fallen soldiers while serving the nation."
  },
  {
    "headline": "Soldiers’ widows beg Army: We’re suffering, pay us our husbands’ life insurance claims",
    "summarized_story": "But the life insurance claims had yet to be paid since then.\nIt’s unfair to us.’’She urged the army and the defence military to pay their husbands’ life insurance claims to help them forge ahead financially.\nI am appealing to them to pay our husbands’ life insurance claims.\n“We are still working on the insurance claims; everything is being done to fast-track the payment,’’ Abdulkadri stated.\nHe said the government needed not to be told to fast-track the processing and ensure payment of the life insurance claims in view of the sacrifices made by the fallen soldiers while serving the nation."
  },
  {
    "headline": "Court Convicts Three For $10,000 Internet Fraud in Uyo",
    "summarized_story": "The convicts were arrested on August 23, 2021 within Osong Ama area of Uyo, Akwa Ibom State, for their involvement in internet fraud.\nWhile Prosper Idongesit Mfon falsely presented himself as Steve Wagner and succeeded in defrauding his victims to the tune of $4000.\nIn view of their pleas, the prosecuting counsel Adebayo Soares prayed the court to convict and sentence the defendants accordingly.\nBut the defence counsel Udeme Tom pleaded for leniency for the defendants by the Court.\nHe is also to restitute the sum of Four Thousand United States Dollars ($4000) to his victim."
  },
  {
    "headline": "Court Convicts Three For $10,000 Internet Fraud in Uyo",
    "summarized_story": "The convicts were arrested on August 23, 2021 within Osong Ama area of Uyo, Akwa Ibom State, for their involvement in internet fraud.\nWhile Prosper Idongesit Mfon falsely presented himself as Steve Wagner and succeeded in defrauding his victims to the tune of $4000.\nIn view of their pleas, the prosecuting counsel Adebayo Soares prayed the court to convict and sentence the defendants accordingly.\nBut the defence counsel Udeme Tom pleaded for leniency for the defendants by the Court.\nHe is also to restitute the sum of Four Thousand United States Dollars ($4000) to his victim."
  },
  {
    "headline": "How Ronaldo collected No.7 shirt from Cavani",
    "summarized_story": "Manchester United manager, Ole Gunnar Solskjaer, has revealed how Cristiano Ronaldo requested no.7 shirt from Edinson Cavani on his return to the club.\nCavani has been wearing the shirt which Ronaldo wore during his first stay at the club.\nHowever, following the 36-year-old’s arrival from Juventus, he spoke with Cavani and asked to take it back.\nSolskjaer said: “It’s one of these things that Edison has been remarkable, played really, really well last season.\n“To pass up his shirt, it just shows the respect he’s got for Cristiano but also Cristiano speaking to Edinson shows the respect the other way."
  },
  {
    "headline": "Queen Elizabeth sends message to Joe Biden",
    "summarized_story": "Queen Elizabeth II, Prime Minister Boris Johnson and other British leaders have marked the 20th anniversary of the Sept. 11 attacks by praising the international resolve that has grown from the al-Qaeda-led tragedy.\nThe queen remembered her visit to the site of the attack.\n“My visit to the site of the World Trade Centre in 2010 is held fast in my memory.\nJohnson added that the recent events in Afghanistan had only strengthened people’s belief in freedom and democracy.\n“We will continue to fight terror and violence, by promoting our values of justice and peace.”"
  },
  {
    "headline": "Social Media Has Compounded Security Challenges In Nigeria — Ex-Senate Leader, Folarin",
    "summarized_story": "Senator Teslim Kolawole Folarin, Chairman of the Senate Committee on Local Content, has urged for the decentralization of the country’s security architecture.\nHe maintained that there was no way security agents can effectively tackle the security challenges in the country if the security architecture was not decentralised.\nHe spoke further by saying that the social media had compounded security challenges in the country, though it has an advantage of quick and wide dissemination of information.\n“Perhaps we should give more thought to the need to decentralise the security architecture of the country.\n“We must emphasize the fact that the social media has compounded the challenges of security and governance in the country."
  },
  {
    "headline": "Outrage As Enugu Police Officer ‘Beats Up’ Young Lady At Checkpoint [Video]",
    "summarized_story": "While on duty at a checkpoint in Obeagu Awkunanaw, along Agbani Road, in the State, a police officer engaged a young lady in an altercation and physical assault, according to a viral video.\nAccording to the DAILY POST, the officer, who has yet to be identified, was seen assaulting a woman over a disagreement in a video that has gone viral on social media.\nThe video has sparked uproar, with many Nigerians calling for the officer to be punished.\nThe command issued a statement warning officers against such behavior.\nHe made it clear that anyone found wanting will be made to face maximum disciplinary sanctions."
  },
  {
    "headline": "Why I Can’t Fight Media Houses Misquoting Me — Bishop Oyedeo [VIDEO]",
    "summarized_story": "Bishop David Oyedepo, president and founder of Living Faith Church Worldwide, has stated why he will not fight media outlets that misquote him.\nAccording to him, confronting the media houses could lead to jobless people pleading with him for help finding a new job.\nI’m privileged to be one of those who sustain the media houses in Nigeria because when they publish what I say, people buy it.\n“I can’t fight them because if I fight them and they close down those houses, then I will be praying for them to get a job again.\n“I’m having a good time having them market my sayings rightly or wrongly."
  },
  {
    "headline": "Yoruba Nation Supporters Storm Igboho For Fresh Agitations After Sheikh Gumi’s Visit",
    "summarized_story": "Agitators for the Yoruba Nation and supporters of Sunday Adeyemo, also known as Sunday Igboho, are set to resume their protest on Saturday (today) in Igboho town, Oyo State.\nThe rally on Saturday by Yoruba Nation supporters is based on solidarity and support for Sunday Igboho who is currently in detention in Cotonou.\nIgboho is from Aladikun compound in Modeke, Igboho, Oyo State.\nThe 48-year-old agitator who was first detained at the Brigade économique et financière (BEF), is currently at Prison Civile de Cotonou — Cotonou Civil Prison.\nKoiki said, “Yoruba Nation Rally will be happening in the town of our Father, Chief Sunday Adeyemo Igboho Oosa – Date: 11th of September 2021 – Time: 10:00am Host: Gbogbo Omo Yoruba Agbaye”"
  },
  {
    "headline": "NPower batch C employment: Why verification was suspended – official",
    "summarized_story": "Friday September 10, 2021 was slated for Npower batch C physical verification exercise nationwide.\nExcited and ready, Npower batch C beneficiaries came out en mass and were all ready for the exercise.\nBayelsa state, especially in Yenagoa Local Government Area, witnessed large numbers of Npower batch C beneficiaries at the verification center.\nIn their words, “As you know, today is meant for Npower batch C physical verification and as you can see we are yet to start at this time, this is not entirely our fault.\nWe have been awoke since midnight trying to access the portal to see if we can start this verification today."
  },
  {
    "headline": "Despite Igboho’s detention, Yoruba Nation agitators set to resume rally",
    "summarized_story": "Barring any last-minute change, agitators have announced plans to resume Yoruba Nation protest on Saturday, September 11.\nBlueprint learnt the rally is based on solidarity and support for embattled Yoruba Nation agitator, Sunday Igboho currently in detention in Cotonou.\nYoruba Nation agitation is a political ideology to realise the independence and sovereign country for the Yoruba race – Oduduwa Republic which many political leaders in the region have rejected.\nThe 48-year-old agitator, who was first detained at the Brigade économique et financière (BEF), is at Prison Civile de Cotonou — Cotonou Civil Prison.\nKoiki said: “Yoruba Nation Rally will be happening in the town of our Father Chief Sunday Adeyemo Igboho Oosa – Date: 11th of September 2021 – Time: 10:00am Host: Gbogbo Omo Yoruba Agbaye.”"
  },
  {
    "headline": "Breaking: Fear grips many as gunmen assasinate Anambra monarch, driver",
    "summarized_story": "There is rising tension in Aguleri, a popular community in Anambra state after its traditional ruler, HRH Abakpulu Anamco, and his driver were killed by gunmen suspected to be hired assassins.\nThe unfortunate incident which reportedly happened on Friday afternoon has already flooded the social media.\nWhile the traditional ruler was seen lying dead outside his silver colour Toyota Prado jeep around the scene of the incident, his driver whose name was not immediately ascertained was shot dead inside the jeep.\nPolice are yet to confirm the latest development as at time filling this report.\nDetails loading…"
  },
  {
    "headline": "Katsina Miyetti Allah cattle Hore disassociate self from national scribe unguided outrances about Masarii – NigPilot",
    "summarized_story": "Miyetti Allah Kautal Hore, Katsina Chapter has distanced itself from the recent unguarded outburst credited to its National Scribe, Saleh Alhassan.\nThe Chairman of the Katsina State, Miyetti Allah, Alh.\n“We request to have your indulgence this morning to make some issues clear as far as the relationship between Miyetti Allah Hore and the Katsina Government is concerned.\nMiyetti Allah cattle Hore is a registered and law-abiding association.\n“Forget that man, that man is the worst Governor Katsina has had; we are just praying for his time to lapse.”However, the Katsina State chapter Chairman of Miyetti Allah, Alh."
  },
  {
    "headline": "Immigration Boss, Babandede, bows out of office, handover to DCG Jere – NigPilot",
    "summarized_story": "Speaking at the occasion, CGI Babandede noted that indeed the Service has witnessed tremendous changes under his leadership, but that he did not do it alone.\n“I am very proud today because I am leaving the Service better than I met it.\nAt the session, some friends of the Service including Dr. Sam Nwosu in his farewell message stated that CGI Babandede has left indelible marks on the walls of the Service.\nIn a statement signed by the NIS Public Relations Officer, ACI Amos Okpu said a major highlight of the day’s event was the handover of the baton of leadership of the Service to the Deputy Comptroller General Immigration, DCG Idris Isah Jere as Acting Comptroller General of Immigration.\n“The acting Comptroller General was before now in-charge of the Directorate of Finance and Accounts.”"
  },
  {
    "headline": "UNIPORT Alumni President For Burial in Bayelsa -NigPilot",
    "summarized_story": "The Family of the late president of the University of Port Harcourt Alumni Association, Chief Chris Adokeme has fixed his burial for Friday, September 17, 2021, at his hometown Isampou, Sagbama local government area of Bayelsa state.\nAdokeme passed away in Yenagoa on Monday 5th July 2021 at the age of 61 years.\nIn a release signed by the acting President of the association, Mr. Uduak Ewitat, he again expressed grief over the death of the late president, urging the family to take heart over his demise.\n“Our late President without any shadow of doubt gave his all for the growth and development of the unique UNIPORT alumni association.\nThat he passed on while serving us is an eloquent testimony to his love for the collective welfare of our association” he added."
  },
  {
    "headline": "Confronting adult illiteracy, out-school children approach towards resolving Nigeria’s challenges-Adamu",
    "summarized_story": "Minister of Education, Malam Adamu Adamu has said the comprehensive approach to resolving current Nigeria’s challenges is through confronting adult illiteracy and paying attention to out of school children.\nDisclosing this at the 2021 International Literacy Day, ILD, held in Abuja on Tuesday, Adamu said the Nigerian government is determined to confront the adult literacy programmes with the same zeal it is handling out of school children.\n“As you are aware, it is estimated that over 6.9 million children are out of school.\nInvesting in Education of the parents will have ripple effect on the reduction of out of school Children.\nHe said “the COVID-19 crisis has confirmed the fragility of many youth and adult literacy programmes, systems and policies as represented by the abrupt suspension of numerous programmes."
  },
  {
    "headline": "Wike Inaugurates Tax Appeal Commission In Rivers",
    "summarized_story": "Rivers State Governor, Nyesom Wike, has inaugurated a four-man Tax Appeal Commission.\nThe governor charged the members of the commission with promoting a new culture in which taxable persons and entities will comply with the relevant tax laws in the state without hesitation.\nHe gave the charge on Friday, after swearing in the Rivers State Body of Tax Appeal Commissioners, at the Government House, in Port Harcourt.\nThe governor emphasised the importance of taxation in the country and called for support.\nHe urged the chairman of the commission to mobilise his team members for success."
  },
  {
    "headline": "US Honours 9/11 Dead On 20th Anniversary Of Attacks",
    "summarized_story": "America marks the 20th anniversary of 9/11 on Saturday with solemn ceremonies given added poignancy by the recent withdrawal of troops from Afghanistan and return to power of the Taliban.\nSix moments of silence will be observed, corresponding with the times the two World Trade Center towers were struck, and fell, and the moments the Pentagon was attacked and Flight 93 crashed.\nMonica Iken-Murphy, who lost her 37-year-old husband Michael Iken in the World Trade Center, says this will be a “heightened” anniversary for many Americans.\nFor the relatives of victims, the anniversary, as always, is about keeping the memory of their loved ones alive.\n“It’s like Pearl Harbor,” said Frank Siller, whose firefighter brother Stephen died at the World Trade Center."
  },
  {
    "headline": "Debts Genuinely Owed Health Workers Will Be Settled, Buhari Assures Doctors",
    "summarized_story": "President Muhammadu Buhari has called on health workers, including members of the National Association of Resident Doctors (NARD) to return to their duty posts.\nHe made the call on Friday during a meeting with members of the Nigerian Medical Association (NMA) at the State House in Abuja.\nThe President urged others contemplating strikes to opt for settlement of issues by negotiation, no matter how long it takes.\n“Debts genuinely owed Health workers will be settled,” he was quoted as saying in a statement by his media aide, Garba Shehu.\nAccording to him, the government is also supporting initiatives to expand health insurance coverage and bring more resources to health financing."
  },
  {
    "headline": "VAT Dispute: Appeal Court Orders All Parties To Maintain Status Quo",
    "summarized_story": "A three-man panel of the appellate court led by Justice Haruna Tsammani gave the order on Friday while ruling on an appeal filed by the Federal Internal Revenue Service (FIRS).\nAlthough the FIRS has taken up the responsibility over the years, the Rivers State government tested the legality recently, and it was worth the move.\nJustice Pam, therefore, stated that the state law on VAT was valid and subsisting.\nOn Thursday, the bill seeking to empower Lagos to collect VAT was read for the third time and passed by lawmakers in the Lagos State House of Assembly.\nMeanwhile, the Lagos State government has applied to be joined as a co-respondent to the suit filed by the FIRS at the appeal court."
  },
  {
    "headline": "2021 Volleyball Nations Cup: Nigeria Reaches Quarter-Finals, Breaks 16-Year-Old Jinx",
    "summarized_story": "Team Nigeria has beaten Ethiopia 3-1 (25-20, 25-12, 32-34, 25-17) in their last match of Pool B to qualify for the quarter-finals at the 2021 African Men’s Senior Volleyball Nations Championship in Rwanda.\nWith the result and reaching the last eight, Nigeria also breaks a 16-Year-Old jinx at the tournament.\nNigeria will battle Cameroon in their quarter-final match at the Kigali Arena on Saturday by 4:00 pm.\nTeam coach, Usman Abdallah, is pleased with his team’s performance and hopes they can advance to the next stage.\n“In 2019, Nigeria was missing at the African Nations Championship due to unseen circumstances; in 2017, we finished 13th position which was very poor."
  },
  {
    "headline": "UPDATED: Amotekun reunites three kidnapped victims with families in Ondo -",
    "summarized_story": "Operatives of the Amotekun Corps have reunited the three remaining kidnapped victims with their families in Akure the Ondo State capital.\nThe victims were part of the 12 persons abducted at Ifira Akoko on Monday.\nNine victims were earlier rescued on Wednesday by Amotekun menA medical team at the Amotekun office stabilised the victims by running some tests for them.\nAddressing reporters, the commander of Amotekun Corps, Adetunji Adeleye said the victims were rescued from the bush with the help of other security agencies.\nHe said the victims have been reunited with their families"
  },
  {
    "headline": "INEC holds Isoko South constituency 1 by-election",
    "summarized_story": "The by-election into the Isoko South constituency 1 of Delta state house of Assembly where the independent National electoral commission is deploying the Bimodal Voter Accreditation system (BVAS) for the first time is ongoing.\nThough some challenges were noticed while using the newly introduced device, INEC commissioner in charge of the zone, May Agbamuche-MBA said it is far better than the card reader.\nHe added that its usefulness will be very visible during the forthcoming Anambra governorship election."
  },
  {
    "headline": "BREAKING: Bandits release abducted District Head of Wawa",
    "summarized_story": "Bandits have released the abducted District Head of Wawa also known as Dodo of Wawa, Alhaji Mahmud Ahmed Aliyu.\nAccording to the chief press secretary to the Niger state governor he was released last night without ransom.\nThe District head was abducted on 6th September at his palace in Wawa, Borgu Emirate in Niger State."
  },
  {
    "headline": "Amotekun rescues three remaining kidnapped victims in Ondo",
    "summarized_story": "Operatives of the Ondo State Security Network Agency, also known as Amotekun have rescued the remaining three kidnaped victims of the 18- seater passenger bus travelling to Lagos from Ifira Akoko in Akoko South-East Local of the State.\nThe Amotekun men had earlier rescued nine victims kidnaped in the bus on Wednesday.\nThe state Commander of the Amotekun Corps, Adetunji Adeleye confirmed this development.\nHe said the victims would be reunited with their family members on Saturday.\n“I can confirm to u that we have rescued the three remaining victims and they will be reunited with their families today”"
  },
  {
    "headline": "Deadly Unrest in Myanmar as Opposition Urges ‘Defensive War’",
    "summarized_story": "At least 20 people have been killed in fighting between militias and Myanmar’s security forces, according to witnesses and Myanmar media, in the worst violence since opponents of the military government called this week for a “people’s defensive war”.\nBut the opposition said the lack of international support has prompted activists and other people to take the matter into their hands.\nClashes erupted on Thursday and continued late on Friday in Thantlang in Chin State, bordering India, news reports also said.\nThe military tightly controls information and state media outlets have been selective in reporting unrest.\nThe same day, a shadow government working to reverse the coup called for a “people’s defensive war against the junta”."
  },
  {
    "headline": "Record-chasing Djokovic Sets Up US Open Final with Medvedev",
    "summarized_story": "World number one Novak Djokovic won a gruelling five-setter against Alexander Zverev to set up a US Open final against Daniil Medvedev and keep his bid for a calendar Grand Slam on track.\nThe 34-year-old must have feared a repeat when he double-faulted to hand Zverev the chance to serve for the opening set.\nNot always at his best from the baseline, Djokovic qualified for a record-equalling 31st Grand Slam final with exceptional serving and trademark mental resilience.\nHe then promised to play Sunday’s final as if it were the final match of his career.\nMedvedev will contest his third Grand Slam final on Sunday, having lost the 2019 final at Flushing Meadows to Rafael Nadal and the Australian Open final to Djokovic in February."
  },
  {
    "headline": "Teenagers Emma Raducanu, Leylah Fernandez Contest US Open Final",
    "summarized_story": "Emma Raducanu will seek to become the first British woman to win a Grand Slam singles title in 44 years when she takes on fellow teenager Leylah Fernandez in an unlikely US Open final between two players who have lit up New York.\nFernandez, 19, has brushed aside a series of leading players – taking out defending champion Naomi Osaka, fifth seed Elina Svitolina, world number two Aryna Sabalenka and three-time Grand Slam champion Angelique Kerber.\nTheir different paths and contrasting styles – but similarly fearless approach – have set up the first Grand Slam final between teenagers since the 1999 US Open when Serena Williams beat Martina Hingis.\n“When you see that kind of talent, that won’t be denied,” 18-time Grand Slam singles champion Martina Navratilova said.\nSuch is the attention that this match-up is attracting, Novak Djokovic’s quest for a record 21st men’s major and a calendar Grand Slam has been slightly overshadowed."
  },
  {
    "headline": "Nigeria: After 40-Day Standoff, Buhari Begs Striking Doctors to Return to Work",
    "summarized_story": "President Muhammadu Buhari on Friday met with leaders of the Nigeria Medical Association (NMA) at the State House, Abuja, over the 40-day-old industrial action embarked upon by resident doctors in the country, and pleaded with them to return to work, saying the timing of the strike was wrong.\nAccording to him, “This is a befitting role for the NMA, as a mature organisation, led by responsible members with long experience.\nEarlier in his speech, the NMA President, Prof. Innocent Ujah, thanked the President for appointment of members into strategic positions in government, assent to the Medical Residency Act and immunisation coverage.\nHe assured the President of the continuous support of members of the association to improve health in the country.\nThe meeting was also attended by the Minister of Labour, Chris Ngige, and Minister of State for Health, Olorunnimbe Mamora."
  },
  {
    "headline": "US Marks 20 Years Since 9/11, In Shadow of Afghan War’s End",
    "summarized_story": "By midnight, it was 9/11, the staggering starting point for a new era of terror, war, politics, patriotism and tragedy.\nPresident Joe Biden is scheduled to travel to all three attack sites: New York’s World Trade Center, the Pentagon and a field near Shanksville, Pennsylvania.\n“Children have grown up without parents, and parents have suffered without children,” said Biden, a childhood friend of the father of a Sept. 11 victim, Davis Grier Sezna Jr.\nTwo decades after helping to triage and treat injured colleagues at the Pentagon on Sept. 11, retired Army Col. Malcolm Bruce Westcott is saddened and frustrated by the continued threat of terrorism.\nSept. 11 propelled a surge of shared grief and common purpose, but it soon gave way."
  }
]