[
  {
    "headline": "Ukraine: Remain neutral, foreign affairs expert urges Nigeria",
    "summarized_story": "The President of the Association of Foreign Relations Professionals in Nigeria, Ambassador Ganiyu Lawal, has urged the Nigerian government to remain neutral as the Russia-Ukraine conflict enters its second day.\nThe News Agency of Nigeria reported that Lawal, on Friday, told reporters that diplomacy remained the best way to resolve conflicts.\nAccording to NAN, Lawal advised that, rather than taking sides, Nigeria should join other nations in suing for peace.\n“At this time, it is important that the Nigerian government should remain neutral, as we have been non-align all along.\n“Nigeria should join other countries suing for peace, because the world needs peace at this time more than ever."
  },
  {
    "headline": "BREAKING: Buhari signs Electoral Act Amendment Bill into law",
    "summarized_story": "), has signed the Electoral Act Amendment Bill 2022 into law.\nPresident Buhari signed the Bill at the Council Chamber of the Presidential Villa in Abuja, on Friday.\nHe said, “It is gratifying to note that the current Bill comes with a great deal of improvement from the previous Electoral Bill 2021.\n“This provision has introduced qualification and disqualification criteria that ultra vires the Constitution by way of importing blanket restriction and disqualification to serving political office holders of which they are constitutionally accorded protection.\n“The practical application of section 84(12) of the Electoral Bill, 2022 will, if assented to, by operation of law, subject serving political office holders to inhibitions and restrictions referred to under section 40 and 42 of the 1999 Constitution (as amended)."
  },
  {
    "headline": "Evans: Tight security, as court delivers judgment",
    "summarized_story": "By Henry OjeluThe premises of Ikeja High Court, Lagos, is under tight security as Justice Hakeem Oshodi is currently delivering judgment in the conspiracy and kidnapping charges brought against Chukwudimeme Onwuamadike (alias Evans) and five others.\nMembers of police and prison’s special squad were sighted at strategic places in the court.\nThe entrance of the court premises and courtroom are also been guarded by the special security squad.\nThey have been on trial since August 2017 before Justice Hakeem Oshodi of the Lagos State High Court at Ikeja.\nEvans and several alleged accomplices are also facing two charges before Justice Oluwatoyin Taiwo of an Ikeja Special Offences Court and another two charges before Justice Adedayo Akintoye of the High Court in Igbosere."
  },
  {
    "headline": "DJ Cuppy's regrets!",
    "summarized_story": "A popular disc jockey, Florence Otedola also known as DJ Cuppy, may have regretted her decision to go back to school last year.\nBut in a tweet in the early hours of Wednesday, the “Gelato” crooner lamented that the programme is seriously affecting her growth in the country’s music industry.\n“Some days I’m at @UniofOxford deeply regretting doing a 3rd university degree because I feel like it’s affecting my progress in the music industry.\nThis would be Cuppy’s second master’s degree.\nShe bagged one in Music Business from the New York University in 2015, including her first degree."
  },
  {
    "headline": "Delta group lauds management of PAP for consulting Stakeholders",
    "summarized_story": "A Niger Delta group, Itsekiri Development Congress, has lauded the management of the Presidential Amnesty Programme under the leadership of the Interim Administrator, Milland Dikio, for consultations with relevant stakeholders of the programme.\nMeni, said the ongoing consultations with relevant Stakeholders of the PAP will go a long way in resolving the crisis in the region.\nThe group advised Dikio not to neglect any group in the Presidential Amnesty programme so as not to cause disaffection and stumbling block in the programme.\n“We want to commend the leadership style of the interim Administrator, Presidential Amnesty Programme, Milland Dikio.\n“Since he assumed office he has been going around the Niger Delta region consulting with relevant Stakeholders."
  },
  {
    "headline": "BREAKING: Buhari signs Electoral Act Amendment Bill",
    "summarized_story": "Idowu BankolePresident Muhammadu Buhari has commenced the process of signing into law the re-worked Electoral Act Amendment Bill at the Council Chamber of the Presidential Villa in Abuja.\nThe ceremony is ongoing at the Council Chamber of the Presidential Villa in Abuja.\nThose present at the ceremony include Vice President, Professor Yemi Osinbajo; President of the Senate, Ahmed Lawan, and Speaker of the House of Representatives, Femi Gbajabiamila.\ndetails later…"
  },
  {
    "headline": "I thought my career had ended after Synagogue encounter — Jim Iyke",
    "summarized_story": "•Jim Iyke relives memories of his Synagogue deliveranceNine years after his alleged deliverance at late TB Joshua’s Synagogue Church Of All Nations, Nollywood actor Jim Iyke has relived memories of the encounter, saying “It almost ruined his acting career.”The actor was at the church in 2013, following his quest to find a permanent healing for his ailing mother then.\nReliving his ugly experience during an interview with Chude Jideonwo, which was shared on Instagram, Jim Iyke said whatever happened at the church on that fateful day was not a stunt contrary to news that made rounds.\nAccording to him, he was in dire straits over his mother’s ailment, hence his visit to the church.\nI said I don’t have to come down to join the service and that you people promised to heal her.\nI thought my career has ended after that day,” Jim Iyke narrated."
  },
  {
    "headline": "NCC boss, Danbatta gives insights on Revenue Assurance Solution approved by FEC",
    "summarized_story": "“In some countries where the systems have been deployed, including some African countries, appropriate revenue assurance systems have resulted in higher revenues and plugging of leakages.\n“Modern revenue assurance systems have also shown to be equipped with additional capacities to generate and analyse information beyond those required for revenue computation.\nWe want to carry the industry along this very important path towards effective revenue assurance in the industry.\n“The Nigerian telecommunications industry, and revenue events engaged by the network operators, demand effective, accurate, and technology-driven revenue assurance solutions which NCC-RAS represents.\n“Therefore, this project relieves the Commission of the initial financial burden that will be required for the deployment of the RAS project."
  },
  {
    "headline": "BREAKING: Russian forces enter Ukrainian capital, Kyiv",
    "summarized_story": "Russian forces have reportedly moved into the Ukraine capital, Kyiv, in the ongoing military operations against the country.\nBBC reports that Ukrainian authorities on Friday revealed that Russian troops were in the northern district of Kyiv.\nAccording to the report, Russian armoured vehicles were seen advancing into the capital city through the northern district.\nUkraine President Zelensky has since addressed the nation and appealed to Putin to stop the assault and consider a ceasefire to save the lives of citizens of both nations.\nThe president had in a statement, banned males between the ages of 18- 60 from leaving the country as the activities of the Russian forces continue to trigger tension across the world."
  },
  {
    "headline": "Ganduje has many corruption cases to answer – Anti-corruption committee",
    "summarized_story": "The Presidential Advisory Committee Against Corruption, PACAC, has said Governor Abdullahi Ganduje of Kano State has some cases of corruption to answer.\nPACAC Executive Secretary, Sadiq Radda, said Ganduje has many cases to answer while in office and at the end of his tenure.\nRadda disclosed this at the 26th Anti-Corruption Situation Room (ACSR) assessment held in Abuja yesterday.\nHowever, Radda said: “The governor has many cases to answer while in office and even more after leaving office.\n“You can see in Kano, Ganduje has many cases to answer while in office, he will answer more out of office and sadly for the first time in Nigeria a son is taking his mother to the EFCC.”"
  },
  {
    "headline": "BREAKING: Buhari signs Electoral Amendment Bill into law",
    "summarized_story": "President Muhammadu Buhari has signed the Electoral Act Amendment Bill 2021 into law.\nThe signing ceremony took place inside the Council Chambers of the Presidential Villa, Abuja at about 12:30 pm on Friday.\nAmong those present, while the President was assenting to the bill includes the Chairman of the Independent National Electoral Commission INEC, Mahmood Yakubu; President of the Senate, Ahmed Lawan among others.\nThe assent is coming a few days after a coalition of civil society organisations staged a protest to compel the president to assent to the amended document.\nDetails later…"
  },
  {
    "headline": "Fish out policeman who killed our member – OPC tells IGP, Oyo Police Commissioner",
    "summarized_story": "Our correspondent gathered that the policeman attached to Federal Special Anti-Robbery Squad (F-SARS), Lagos State, Obasanjo Atoyebi shot Ganiyu on Thursday, 17th February this year.\nOur correspondent gathered that the policeman allegedly shot the OPC member twice in the process.\n“Obasanjo Atoyebi has one wife there and he usually comes at midnight.\nMorufu Ganiyu challenged him on why he arrived at that time and why the unnecessary shootings.\n“We are using this medium to inform the federal and state governments that Obasanjo Atoyebi should not go unpunished."
  },
  {
    "headline": "How to solve Nigeria’s challenges, by Buhari, Gowon, others",
    "summarized_story": "President Buhari urged Nigerians to look for quality leadership who are driven by vision and experience, while Dr. Gowon said the country requires a leader with a mindset that sees beyond the 21 century.\nFayemi said the nation needs purposeful leadership with the capacity to harness its potentials and address its challenges.\nPresident Buhari, who was represented by his Chief of Staff, Professor Ibrahim Gambari, hailed Fayemi for writing the book and for his contributions to governance in the country.\n“The second notion of envisioning a new Nigeria addresses the leadership question.\nThe keynote speaker and Research Director at the Nigerian Institute of International Affairs (NIIA), Prof. Adebayo Olukoshi, urged Nigerian leaders to evolve local solutions to the nation’s challenges."
  },
  {
    "headline": "BREAKING: Buhari signs Electoral act Amendment Bill 2021",
    "summarized_story": "President Muhammadu Buhari has signed the Electoral Act Amendment Bill 2021 into law.\nThe signing ceremony held at the Council Chamber of the Presidential Complex.\nIt was witnessed by Vice President Yemi Osibanjo; Senate President Ahmad Lawan and Speaker Femi Gbajabiamiala among other dignitaries.\nOn January 31, 2022, the National Assembly transmitted the reworked amendment bill to the President for assent.\nBuhari consequently forwarded it to the Minister of Justice and Attorney General of the Federation, Abubakar Malami (SAN), for legal advice."
  },
  {
    "headline": "Full List: UEL Round of 16 draws",
    "summarized_story": "After dramatic actions among eight teams across Europe last night.\nBarcelona, Sevilla, Atlanta and four other teams qualified for the round of 16.\nThe round of 16 matches are scheduled for 10th and 17th of March.\nHere is the full fixtures in the round of 16 knockout stage:Rangers v Red Star BelgradeBraga v MonacoFC Porto v LyonAtalanta v Bayer LeverkusenSevilla v West HamFC Barcelona v GalatasarayRB Leipzig v Spartak MoscowReal Betis v Eintracht Frankfurt"
  },
  {
    "headline": "Davido slams Gov Makinde, says no one can arrest me",
    "summarized_story": "Davido slams Gov Makinde, says no one can arrest meAfropop singer Davido has insisted nobody can arrest him over his comment on the Peoples Democratic Party (PDP) delegates election in Osun State.\nDavido alleged thugs have been imported to disrupt the Osun PDP primary slated for Saturday.\n!”A Twitter user Babawale dared him to mention the name of the alleged politician behind the act.\nAnother concerned Twitter user with the handle @Captain_flexy said Davido will be arrested for making such allegations against Makinde.\nHe wrote: “Arrest who?"
  },
  {
    "headline": "BREAKING: Dumo Lulu-Briggs declares for Rivers governorship",
    "summarized_story": "Oil mogul Chief Dumo Lulu-Briggs has declared for Rivers governorship race.\nHe made the declaraction on arrival at Pot Harcourt International Airport, Omagwa from Abuja on Friday morning.\nHe expressed optimism he will win the contest because of hid enomous good works in the State.\nThe business tycoon is the first person to publicly declare interest in succeeding Governor Nyesom WikeDetails Shortly…"
  },
  {
    "headline": "Breaking: Buhari signs Electoral Act Amendment into law",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari at exactly 12:27 assented to the long-awaited Electoral Act Amendment Bill 2021, into law.\nNigerians can now work and earn dollars DAILY from home.\nThe ceremony was witnessed by the Senate President, Ahmed Lawan, Speaker of the House of Representatives, Femi Gbajabiamila.\nthe Senior Special Assistant to the President on National Assembly matters (Senate), Senator Babajide Omoworare, tabled the document for signing.\nHe urged the National Assembly to give speedy attention to amendments suggested."
  },
  {
    "headline": "2023: Business group pressures Osinbajo to contest for presidency",
    "summarized_story": "From Fred Itua, AbujaA group, Business Men For Osinbajo (BFO), has urged Vice President Yemi Osinbajo to run for the 2023 presidential election promising to buy the All Progressives Congress (APC) nomination form for him.\nHe said though Osinbajo was yet to declare his interest for the presidency, the group was putting structures in place to ensure he emerges the next president.\nCo-convener of BFO, Mr. Olatunji Davies, said business owners were pushing for an Osinbajo presidency because of his acceptability by Nigerians, irrespective of the economic, social, religious and ethnic background.\n“Our group called the Business Men for Osinbajo (BFO) is officially launched as a first major step to change the narrative.\nThe mandate is simple: to deliver the incoming President Come 2023, Professor Oluyemi Osinbajo.”"
  },
  {
    "headline": "Opebi plane crash: Aircraft didn’t have sufficient fuel for destination –AIB",
    "summarized_story": "It also stated that in spite of this challenge, the pilot still wanted to get to destination even after noticing that.\nSpeaking during the realease of four accident reports in Abuja on Thursday, AIB-N Commissioner, Akin Olateru, said there was fuel exhaustion at low altitude and the low speed landing led to loss of control in flight.\nThe report also blamed lack of effective management supervision of the airline’s flight operations as well as inadequate safety oversight.\n“Quorum Aviation must make sure that all its personnel are well acquainted with their respective schedules of responsibilities and are capable of discharging their duties effectively in line with their standard operating procedures,” Olateru said.\nRegular individuals can earn as low as $300 daily Find out how it works."
  },
  {
    "headline": "Abia community lauds Kalu over road reconstruction",
    "summarized_story": "From Okey Sampson, UmuahiaThe people of Amankalu-Alayi community in Bende Local Government Area of Abia State has commended Senate Chief Whip, Dr. Orji Uzor Kalu, for the reconstruction of their road.\nTh lawmaker representing Abia North had, last year, attracted the reconstruction of the two-kilometre Amankalu-Alayi-Akoli-Imenyi Road.\nExpressing the community’s delight, President General of Amankalu-Alayi, Iheanyi Okoronkwo, said it was the first time his people were benefitting from any government largesse.\nThe president general said his people were surprised when the project was flagged off and completed within the stipulated time.\nA community leader, Eme Mba, said his people would remain eternally grateful to Kalu for attracting the reconstruction of the road."
  },
  {
    "headline": "Troops kill 139 terrorists, kidnappers, bandits in 2 weeks – DHQ",
    "summarized_story": "From Molly Kilete, AbujaThe Defence Headquarters (DHQ), yesterday, said troops on counter-insurgency operations and other internal security duties across the country killed 139 terrorists, bandits, kidnappers and other criminals and rescued 42 kidnap victims in the last two weeks.\nIt said 466 Boko Haram and ISWAP terrorists and their families, comprising of 120 males, 137 females and 209 children surrendered to troops in the last two weeks.\nRegular individuals can earn as low as $300 daily Find out how it works.\nDirector, Defence Media Operations, Major General Bernard Onyeuko, made this known at a briefing on the update of military operations conducted between February 10 – 24.\nHe said the soldiers arrested 111 terrorists within the period under review and recovered huge cache of arms and ammunitions."
  },
  {
    "headline": "Global Order in Peril As Russia Invades Ukraine",
    "summarized_story": "Owing to the attack, oil prices jumped yesterday, with Brent rising above $105 a barrel for the first time since 2014, after the attack exacerbated concerns about disruptions to global energy supply.\nThe Russian attack began around 4:30 am in Ukraine yesterday, with a barrage of over 100 ballistic, cruise and surface-to-air missiles, and included 75 medium and heavy bombers.\nThe U.S. already has about 90,000 troops in Europe and has deployed more to the continent as tensions simmered in the weeks before Russia’s invasion of Ukraine.\n“President Putin has re-introduced war to the European continent.\nAhmed Munir lamented that the conflict between Russia and Ukraine was deteriorating by the hour."
  },
  {
    "headline": "Why Buhari Settled for Adamu as Consensus Candidate for APC Chair",
    "summarized_story": "Different sources confided in THISDAY yesterday that the inroads made by Senator Adamu in reconciling aggrieved members of the party that attracted him to Buhari as a likely choice for party’s chairmanship.\nAnother governor from the zone, Yahaya Bello of Kogi State, THISDAY was told, also rejected the purported adoption of Adamu.\n“The President Buhari that I know will not like to do things secretly.\nSenator Al-Makura, in a statement by Segun Tomo, the Director, New Media, Al-Makura Campaign Organisation (ACO), also denied that Adamu has been adopted as the national chairman of APC.\n“On the issue of who becomes chairman, the president asked that consultations continue to produce a credible and widely accepted choice as consensus candidate."
  },
  {
    "headline": "In First Major Post-PIA Deal, Seplat Acquires Mobil Producing Oil Assets in Nigeria",
    "summarized_story": "Seplat Energy said it was fully committed to working with the Nigerian government to bring the strategically important national assets fully into Nigerian ownership alongside the national oil company, NNPC.\nUnder the Sale and Purchase Agreement, Seplat Energy will pay a deposit of $128 million, which will be applied towards the purchase price on closing.\n“If the transaction does not proceed, the deposit will be repaid to Seplat Energy where the agreement is terminated by Seplat Energy in certain circumstances.\nCommenting on the deal, Chairman of Seplat Energy, Dr. Bryant Orjiako, said: “This is a transformational acquisition for Seplat Energy that strengthens our partnership with the national oil company, the NNPC, and consummates the spirit of the newly enacted PIA.\n“MPNU’s employees and contractors have a strong reputation for safety and operational excellence, and I look forward to welcoming them to the Seplat Energy family,” he stated."
  },
  {
    "headline": "Buhari: I Look Forward to Leaving Office Next Year",
    "summarized_story": "*Says Nigeria’s constitution bars him from going beyond two terms as presidentDeji Elumoye in AbujaPresident Muhammadu Buhari has declared that the nation’s constitution statutorily barred him from going beyond two terms as President.\nThis is just as he said he was looking forward to leaving office by May 29, 2023.\n”I have seen former Governors here and I am looking forward to also becoming a former President,” he said.\nBuhari thanked the people of Nasarawa State for the rousing welcome, expressing delight that the north-central state was wearing a new look since his last visit in 2019.\nOn arrival in the capital for a two-day State visit to Nasarawa state, Buhari inaugurated the Lafia Airport, Vocational and Skills Acquisition Centre, Modern Bus Terminal and the Shinge-Barkini Abdullahi-Kilema road, executed by the State Government."
  },
  {
    "headline": "El-Rufai: We Know Location of Terrorists in Kaduna",
    "summarized_story": "Wants military to wipe them outDeji Elumoye in AbujaGovernor Nasir El-Rufai of Kaduna State has disclosed that the state government knows the location of the bandits terrorising the state.\nSpeaking Thursday at a news briefing at the State House, Abuja, El-Rufai stated that where the terrorists operate from in the state and their telephone numbers are well known to government.\nHe, however, stressed that the state government was handicapped to confront the terrorists.\nHis words: “There must be sincerity of purpose for the security challenges facing the North-west to be solved.\nThe military and security agencies should be ready to work together to completely wipe out the terrorists once and for all.”Details later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Police Reinvite Sowore After Illegal Arrest As Buhari's Minister, Malami, Nwoko Secure Judge To Remand Activist In Prison Custody",
    "summarized_story": "The Nigeria Police Force has again invited human rights activist, Omoyele Sowore over a frivolous petition by a former member of the House of Representatives, Ned Nwoko.\nA team of armed policemen who laid siege to the entrance of the Court of Appeal had on Thursday arrested Sowore.\nA police source told SaharaReporters that Nigeria's Attorney-General of the Federation (AGF) and Minister of Justice, Abubakar Malami and Nwoko were unhappy the activist was released.\nThe source added that the duo has secured a judge to remand Sowore in prison as soon as he honours today’s invitation.\nThey have secured a judge to remand in prison custody today,” the source said."
  },
  {
    "headline": "BREAKING: Police Reinvite Sowore After Illegal Arrest As Buhari's Minister, Malami, Nwoko Secure Judge To Remand Activist In Prison Custody",
    "summarized_story": "The Nigeria Police Force has again invited human rights activist, Omoyele Sowore over a frivolous petition by a former member of the House of Representatives, Ned Nwoko.\nA team of armed policemen who laid siege to the entrance of the Court of Appeal had on Thursday arrested Sowore.\nA police source told SaharaReporters that Nigeria's Attorney-General of the Federation (AGF) and Minister of Justice, Abubakar Malami and Nwoko were unhappy the activist was released.\nThe source added that the duo has secured a judge to remand Sowore in prison as soon as he honours today’s invitation.\nThey have secured a judge to remand in prison custody today,” the source said."
  },
  {
    "headline": "BREAKING: Nigerian Police Release Activist, Sowore, After Illegal Arrest",
    "summarized_story": "The Nigeria Police Force has released human rights activist, Omoyele Sowore.\nThe author, Omoyele Sowore“Released from Nigeria Police Force idiotic arrest and detention.\n‪#RevolutionNow‬ ‪#WeCantContinueLikeThis,” the activist posted on Twitter after his release.‬Released from Nigeria Police Force idiotic arrest and detention.\nSee Also Breaking News BREAKING: Nigerian Security Operatives Again Arrest Human Rights Activist, Omoyele SoworeHe was subsequent taken to the office of the disbanded Special Anti-Robbery Squad (SARS) unit, otherwise known as Abattoir, located at Guzape.\nSee Also Breaking News BREAKING: Nigerian Police Deny Sowore’s Lawyers Access To See Him In Custody"
  },
  {
    "headline": "BREAKING: Nigerian Police Release Activist, Sowore, After Illegal Arrest",
    "summarized_story": "The Nigeria Police Force has released human rights activist, Omoyele Sowore.\nThe author, Omoyele Sowore“Released from Nigeria Police Force idiotic arrest and detention.\n‪#RevolutionNow‬ ‪#WeCantContinueLikeThis,” the activist posted on Twitter after his release.‬Released from Nigeria Police Force idiotic arrest and detention.\nSee Also Breaking News BREAKING: Nigerian Security Operatives Again Arrest Human Rights Activist, Omoyele SoworeHe was subsequent taken to the office of the disbanded Special Anti-Robbery Squad (SARS) unit, otherwise known as Abattoir, located at Guzape.\nSee Also Breaking News BREAKING: Nigerian Police Deny Sowore’s Lawyers Access To See Him In Custody"
  },
  {
    "headline": "UEFA Moves Champions League Final From Russia",
    "summarized_story": "UEFA has moved this season’s Champions League final from Saint Petersburg in Russia to Paris in France following the invasion of Ukraine by Vladimir Putin’s government.\nUEFA president Aleksander Ceferin chaired an extraordinary meeting of the Executive Committee on Friday where it was decided that the Champions League final should be moved away from Saint Petersburg.\nThe final will now hold at the Stade de France in Paris, as first reported by the New York Times.\nUEFA said in a statement: \"The UEFA executive committee decided to relocate the final of the 2021-22 UEFA Men's Champions League from St Petersburg to Stade de France in St Denis.\nUEFA also said it would relocate any games in tournaments it controls that were to be played in Russia and Ukraine, whether involving clubs or national teams, until further notice."
  },
  {
    "headline": "Finally, Buhari signs electoral bill into law",
    "summarized_story": "President Muhammadu Buhari has finally signed the electoral act amendment bill into law.\nThe legislation was transmitted to the president on January 31 after both chambers of the national assembly had reworked it.\nAdvertisementBuhari had initially rejected the bill after the national assembly made direct primary compulsory for political parties in the country.\nIt was on that basis the senate and house of representatives reworked the bill to provide for indirect and direct primary, as well as consensus candidates.\nAdvertisementParties are now at liberty to use any of the three aforementioned options to elect their candidates for any election that will be organised by the Independent National Electoral Commission (INEC)."
  },
  {
    "headline": "Finally, Buhari signs electoral bill into law",
    "summarized_story": "President Muhammadu Buhari has finally signed the electoral act amendment bill into law.\nThe legislation was transmitted to the president on January 31 after both chambers of the national assembly had reworked it.\nAdvertisementBuhari had initially rejected the bill after the national assembly made direct primary compulsory for political parties in the country.\nIt was on that basis the senate and house of representatives reworked the bill to provide for indirect and direct primary, as well as consensus candidates.\nAdvertisementParties are now at liberty to use any of the three aforementioned options to elect their candidates for any election that will be organised by the Independent National Electoral Commission (INEC)."
  },
  {
    "headline": "Russia-Ukraine war: 137 killed, 316 wounded, says Zelenskyy",
    "summarized_story": "Ukrainian President Volodymyr Zelenskyy says at least 137 Ukrainian soldiers and civilians have been killed since the Russian invasion began.\n“I remain in Ukraine, my family is in Ukraine, my children are in Ukraine.\nthe enemy marked me as target number 1, my family as target number 2.\n“And most importantly, which countries will give us those guarantees?”As the Russian troops continued their offensive, explosions were reportedly heard in Kyiv, the country’s capital, early on Friday.\nAdvertisementOn Thursday, the Ukrainian military said it destroyed four Russian tanks near the eastern city of Kharkiv, killed 50 enemy troops, and shot down five Russian planes and a helicopter around the Luhansk region."
  },
  {
    "headline": "Russia-Ukraine war: 137 killed, 316 wounded, says Zelenskyy",
    "summarized_story": "Ukrainian President Volodymyr Zelenskyy says at least 137 Ukrainian soldiers and civilians have been killed since the Russian invasion began.\n“I remain in Ukraine, my family is in Ukraine, my children are in Ukraine.\nthe enemy marked me as target number 1, my family as target number 2.\n“And most importantly, which countries will give us those guarantees?”As the Russian troops continued their offensive, explosions were reportedly heard in Kyiv, the country’s capital, early on Friday.\nAdvertisementOn Thursday, the Ukrainian military said it destroyed four Russian tanks near the eastern city of Kharkiv, killed 50 enemy troops, and shot down five Russian planes and a helicopter around the Luhansk region."
  },
  {
    "headline": "Ganduje has many corruption cases to answer, says anti-graft committee",
    "summarized_story": "The Presidential Advisory Committee Against Corruption (PACAC) says Abdullahi Ganduje, governor of Kano, has several corruption cases to answer.\nSadiq Radda, executive secretary of the committee, said this on Thursday at the 26th Anti-Corruption Situation Room (ACSR) assessment held in Abuja.\nAdvertisementRadda said he was surprised by how Ganduje’s son reported his mother to anti-corruption agencies for alleged fraud.\nHe said the governor “has many cases to answer while in office and even more after leaving office”.\n“You can see in Kano, Ganduje has many cases to answer while in office, he will answer more out of office and sadly for the first time in Nigeria a son is taking his mother to the EFCC,” Radda said."
  },
  {
    "headline": "Nigeria’s 5G race: MTN and Mafab pay $547.2m licence fee",
    "summarized_story": "The winners of the bid for 3.5GHz 5G spectrum, MTN and Mafab have each completed payment of the $273.6m licence fee required by the Nigerian Communications Commission (NCC).\nHow MTN and Mafab wonThe top bidders were Airtel Networks Limited, Mafab Communications Limited and MTN Communications Nigeria Limited, with the bidding price starting at $199,374,000.\nSimply put, Airtel offered to pay the least amount among the three companies for the 5G licence, thus falling out of the race.\nMafab Communications Limited was registered on July 8, 2020, according to the company’s website and TechCabal’s search on the Corporate Affairs Commission (CAC) site.\nThe race to deploy 5G in Nigeria is still on, as MTN and Mafab head into the deployment phase."
  },
  {
    "headline": "Meet the 19 year old Nigerian building his own blockchain empire",
    "summarized_story": "Born to an engineer father and a school teacher mother, Njoku was a mathematics whiz.\nThis, his engineer father could live with.\nIn April 2020, a month after he started working at Kwivar, he got another offer as a blockchain developer at Project Hydro, a blockchain company based in the British Virgin Islands.\nAt Xend Finance, he had to step in when the lead blockchain engineer was unavailable, and that accelerated his blockchain knowledge.\nNjoku isn’t Zukerberg and may never be, but he’s building his own empire in the blockchain world."
  },
  {
    "headline": "Polygon’s $450 million raise will enable it build developer ecosystems across the globe",
    "summarized_story": "Last month, Polygon raised $450 million, to expand its portfolio of ethereum scaling solutions and footprints in the developer ecosystem.\nAs of today, it has processed 3.4 billion transactions and last month claims its 3 million transactions per day volume is double that of ethereum.\nSandeep Nailwal, Polygon co-founder has said that its $450 million funding is to help Polygon build larger developer ecosystems in several markets.\nOne of the developer ecosystem expansion strategies is to establish Polygon Guilds, a structure that will help educate “Web2 developers” and onboard them to Web3.\nEarlier this month, Polygon created the Polygon Academy, which intends to be a comprehensive guide for anybody that wants to understand Web3."
  },
  {
    "headline": "FAQ Troubleshooting",
    "summarized_story": "Relevant discussion thread is https://wordpress.org/support/topic/234726Top ↑Why isn’t the admin user listed as an author when editing posts?\n# Why isn’t the admin user listed as an author when editing posts?\nnewadmin) with Administrator Role Login as ‘newadmin’ Degrade the old ‘admin’ user to Role of Subscriber and Save Promote the old ‘admin’ back to Administrator Role and Save Login as the old ‘admin’If that doesn’t work, try:Create a new admin user (e.g.\nnewadmin) with Administrator Role Login as ‘newadmin’ Delete the old ‘admin’ user and assign any posts to ‘newadmin’ Create ‘admin’ user with Administrator Role Login as ‘admin’ Delete ‘newadmin’ user and assign posts to ‘admin’Top ↑Why is the wrong author name displayed for a post on a blog?\nThere are various resources that will help you find more help with WordPress, in addition to these FAQ."
  },
  {
    "headline": "Obaseki pays tribute to late Imasogie, hails contribute to devt of Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has paid glowing tributes to the late philosopher, preacher, Baptist minister and scholar, Prof. Osadolor Imasogie, describing him as a great bridge builder who contributed immensely to the development of mankind.\nOsaigbovo Iyoha and other top government functionaries to commiserate with the family of late Prof. Imasogie, said the late philosopher touched many lives while here on earth and will be sorely missed.\nThe governor noted, “I am here to commiserate with the Imasogie family over the passing of the patriarch of the family, late Rev.\nProf. Osadolor Imasogie, who touched many lives while here on earth.\nProf. Osadolor Imasogie was an institution, a point of reference and represented a bridge for this generation."
  },
  {
    "headline": "Edo residents hail Obaseki, NEWMAP for gully erosion, flood control interventions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki and the Nigeria Erosion and Watershed Management Project (NEWMAP) in Edo State have been commended for bringing succor and restoring the hope of residents in flood-prone communities in the state.\nSome residents, who are beneficiaries of the project’s gully sites and flood alleviation intervention within the Benin metropolis, said the government has continued to alleviate their sufferings, improving the living standards of the people.\nAccording to Pastor Samuel Omo, “We thank Governor Godwin Obaseki for prioritizing the wellbeing of Edo people, embarking on projects to better the lives of residents.\nThe gully erosion, formerly, reduced most landlords in our communities to tenants as flood and silt took over our houses and lands.\nOn his part, Elder Richard Omwenyeke, a resident of Ebo Street, thanked the government for the massive erosion control projects from Gapiona to Amagba River."
  },
  {
    "headline": "Edo govt, automobile dealers partner to host Africa’s biggest car auction, expo in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State Government is collaborating with local and international automobile dealers to host Africa’s biggest car auction and expo in Benin City, the Edo State capital.\nThe Edo Car Auction 2022 (ECA 22) will serve as a platform to link buyers and sellers of automobiles across the globe, ensuring access to affordable and quality automobiles.\n“We are glad to be uniting the biggest automobile dealers across the world and our local car dealers in Benin City with car buyers and promoters to enhance access to quality and cheap cars through our forthcoming Edo Car Auction, which is well-positioned to become the biggest car auction and expo in Africa.\nAccording to him, “This is not just for car dealers, but other citizens who have cars to sell.\nFidelis Okungbowa and ECA Legal Adviser and Assistant Secretary of Motor Dealers Association of Nigeria, Edo State Chapter, Mr. Paul Akhilomen, among others."
  },
  {
    "headline": "LASSA FEVER: ISTH CMD STRESSES IMPORTANCE OF EARLY DIAGNOSIS – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestIRRUA – As a new wave of Lassa Fever Epidemic spread across the country, the Chief Medical Director (CMD) of the Irrua Specialist Teaching Hospital (ISTH), Prof. Sylvanus Okogbenin has stressed the need for members of the public to quickly visit the hospital for Lassa Fever test, if no response after 48 hours of treating fever with anti-malaria drugs.\nHe said the longest any of the dead patients stayed at the hospital before their death, was two hours.\nThen you can quickly have diagnosis, and if it is lassa fever you will be treated.\nHe similarly disclosed that the hospital had received 200 lassa patients since the current outbreak, with 26 patients currently on admission at the Lassa Fever Ward, while four are in critical conditions.\nOn preventive measures, he said: “Lassa fever is real."
  },
  {
    "headline": "Nigeria should be restructured before 2023 election – Elliot Uko",
    "summarized_story": "“Professional politicians, who are also well-known opportunists and grand exploiters, are now jumping into the fray with their own ideas of power shift.\nGreed, hubris and conspiracy reign,” he said.\n“Non of them regrettably, care about the real reason power shift became inevitable.\n“Were precious lives lost in the agitation that gave impetus to the inevitability of this power shift?\n“The understanding that the task ahead is grave and delicate would help remove self-centered excitement that breeds conspiracy of power, greed and hubris."
  },
  {
    "headline": "Osun PDP Ad- Hoc Delegate Congress: Dele Adeleke Condemns Violence, Condoles with Families of Dead Party Members",
    "summarized_story": "“We are well aware of the persons within the party who are trying hard to foist their desires on other members through any means possible.\nWe know their antics and we can only remind them that only God has the capacity to enthrone and to dethrone.\nWe were all alive in 2018 when despite at the precipice of victory, the PDP by a strange twist of fate, ended up losing the election.\nThis reminds us that no matter what we do as individuals, the final verdict on our ambitions will still come from God.”He l condoled with the family of the party members who lost their lives in Iwo during the congress.\nNobody deserves to lose their lives for the actualization of another person’s desires."
  },
  {
    "headline": "Enugu LGA election: PDP wins all chairmanship, councillorship seats",
    "summarized_story": "The People’s Democratic Party (PDP), has won all 17 local government chairmanship seats, as well as the entire 260 councillorship seats in Wednesday’s local government election in Enugu State.\nThis is according to the results declared by the State Independent Electoral Commission on Thursday.\nThe chairmen-elect were issued with their certificates of return on Thursday.\nMore subsequently…Facebook Notice for EU!\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "Tinubu visits Ooni of Ife to seek royal support for presidential ambition",
    "summarized_story": "Former Lagos State governor, and chieftain of the All Progressives Congress, Asiwaju Bola Tinubu, on Thursday, visited the Ooni of Ife, Oba Adeyeye Enitan Ogunwusi, at his palace in Ile Ife, Osun State.\nTinubu visited the monarch along with the Osun State governor, Gboyega Oyetola, the Tinubu Support Group disclosed on Facebook.\nAccording to the caption that accompanied the photo, Tinubu visited the Ooni of Ife to seek his blessings for his presidential ambition.\nTinubu had earlier visited the Alaafin of Oyo, Oba Lamidi Adeyemi, at his palace in Oyo, and the Olubadan designate, Lanre Balogun, at his residence in Ibadan, where he made the controversial “fight dirty” remark.\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "Nigeria’s Vision Has Not Been Realised – Buhari",
    "summarized_story": "President Muhammadu Buhari has said that the vision of the founding fathers of Nigeria has not been realised.\nAccording to Buhari, more intellectuals are needed in governance for a better Nigeria.\nADVERTISEMENT“The vision of our founding fathers has not been realised,” Buhari said adding that it was the reason the book should be read.\n“Politics is not a dirty game,” Ganduje said while encouraging intellectuals to join politics.\nADVERTISEMENT“In Nigeria, intellectuals are afraid of governance because they see politics as a dirty game."
  },
  {
    "headline": "Federal Govt Promises To Enact, Implement Ecosystem Friendly Policies",
    "summarized_story": "The federal government has reiterated its commitment to enact and implement policies that will ensure the success of the ecosystem.\nPantami cited the National Startup Bill, the National Council for Digital Innovation and Entrepreneurship, the National Policy for the Development of Indigenous Content in the Telecommunications sector, among others, as examples of government’s commitment to enact and implement policies that enable the ecosystem.\nHe however challenged startups and innovators in the Nigeria ecosystem to take ownership of existing policies to further consolidate and enhance the success of the ecosystem.\nADVERTISEMENT“The importance of a vibrant, functional innovation ecosystem cannot be underscored and that is why we have taken deliberate steps to organise this interactive session specifically, to address certain pertinent issues.\nThis is key to the success of our ecosystem because government has a major role to play in providing an enabling environment,” he added."
  },
  {
    "headline": "Ayu Urges Buhari To Sign Electoral Bill",
    "summarized_story": "National chairman of the Peoples Democratic Party (PDP) Senator Iyorchia Ayu has challenged President Muhammadu Buhari to immediately sign the Electoral Act Amendment Bill so that the nation can have elections which are impossible to rig.\nHe also said All Progressives Congress (APC) is scared of getting the electoral act amendment bill signed into law because the party is afraid of losing the 2023 general elections.\nThe PDP national chairman at the event received a former state chairman of APC, Chief Letep Dabang, and others who decamped to PDP.\nPresident Buhari must sign the electoral act immediately, that will make elections impossible to rig.”Speaking on behalf of the decampees, Dabang, recalled how he ran errands for the late PDP chairman, Chief Solomon Lar, Professor Dakum Shown, Senators Ayu, and Jang, among others.\nFidelis Tapgun: Senator Jonah Jang; Senator Jeremiah Useni; PDP vice chairman, North Central; Theophilus Dakashan among others."
  },
  {
    "headline": "In Major Shake-up, INEC Redeploys 186 Staff",
    "summarized_story": "The Independent National Electoral Commission (INEC) has redeployed 186 staff across the country as part of efforts to ensure efficient and optimal performance.\nThe affected staff are either serving in their states of origin or have served for between 10 and 32 years in the same state.\nFestus Okoye noted that the commission considers the long stay of staff in the same state as unhealthy for the sensitive responsibilities they discharge.\nOkoye in the statement said “Commission has identified 186 staff for immediate redeployment.\nHe added that the exercise “will be an ongoing exercise that will extend to other categories of staff in the commission’s headquarters, state and local government offices nationwide.”ADVERTISEMENT"
  },
  {
    "headline": "C/River By-elections: PDP Kicks Over Deployment Of Soldiers",
    "summarized_story": "Ahead of February 26, Ogoja/Yala federal constituency and Akpabuyo state constituency by-elections, the Peoples Democratic Party (PDP) has raised the alarm over planned deployment of soldiers for the conduct of the by-elections.\nThe PDP said the state as an entity has no power to deploy soldiers for elections stressing that it is only the military high command at the defence headquarters that has the right to deploy soldiers for any reason.\nPDP state chairman, Venatius Ikem raised the alarm while addressing journalists about rumours making the rounds that the APC government has hatched a plan to deploy soldiers for the election.\nADVERTISEMENTHe said, “There are legitimate ways you can deploy the army as well as illegal ways to intimidate voters.\n“That directive can only come from the Chief of Army Staff and if there are reasons to deploy the army it will be so stated."
  },
  {
    "headline": "Soldier takes cover, robbers with money bags: Video of Uromi bank robberies",
    "summarized_story": "An amateur video has given dramatic glimpses of the bank heists carried out in Uromi, Edo State by robbers.\nIn the video, an armed soldier is seen crouching beside a phone shop, while the robbers carry money bags across the deserted road of the town.\nAccording to the police, gunmen, who raided four banks and attacked a Police Divisional Headquarters on Thursday in Uromi killed seven people.\nWitnesses said the gunmen got to the town in large numbers and in several vehicles before they attacked the four banks with dynamites.\nThe banks raided were Zenith Bank, First Bank, Unity Bank and the United Bank for Africa (UBA)."
  },
  {
    "headline": "YPA drums support for Atiku’s presidential ambition",
    "summarized_story": "The Young Professionals for Atiku Abubakar, YPA, a political pressure group, has urged Nigerians to support former vice-president Atiku Abubakar to actualise his presidential ambition in 2023.\nDr Ja’afaru Sa’ad, a former gubernatorial aspirant in Kaduna State under the Peoples Democratic Party (PDP) and the convener of the movement, made the appeal in an interview with the News Agency of Nigeria (NAN) on Friday in Zaria.\n“If you narrowed Nigeria’s democracy down from 1999 to date, the Peoples Democratic Party (PDP) had about three presidents; Olusegun Obasanjo from the Southwest spent eight years.\n“The president is now from North West but it was from a different party not the PDP.\n“As a group, we believe that Mr Abubakar has the experience and expertise to salvage our country from these multi-dimensional challenges,” he asserted."
  },
  {
    "headline": "BREAKING: Buhari Signs Electoral Act Amendment Bill",
    "summarized_story": "At the Council Chamber of the Presidential Villa in Abuja, President Muhammadu Buhari began the process of signing the reworked Electoral Act Amendment Bill into law.\nThe ceremony is still taking on in the Presidential Villa’s Council Chamber in Abuja.\nProfessor Yemi Osinbajo, Vice President; Ahmed Lawan, President of the Senate; and Femi Gbajabiamila, Speaker of the House of Representatives, were among those present at the ceremony, which began at lunchtime.\nDetails later…"
  },
  {
    "headline": "BREAKING: UEFA Moves Champions League Final From Russia To France",
    "summarized_story": "The 2022 Champions League finals will be moved from Russia, according to the Union of European Football Associations (UEFA).\nThe Champions League final was shifted from Russia to France by UEFA.\nThe Champions League final, which was set for May 28 at the Gazprom Arena in St Petersburg, will instead be held at the Stade de France in Saint-Denis, Paris, according to UEFA.\nThe statement reads: “The UEFA Executive Committee today held an extraordinary meeting following the grave escalation of the security situation in Europe.\n“The UEFA Executive Committee decided to relocate the final of the 2021/22 UEFA Men’s Champions League from Saint Petersburg to Stade de France in Saint-Denis."
  },
  {
    "headline": "BREAKING: Russian Forces Break Into Ukrainian Capital",
    "summarized_story": "On the second day of their military campaign in Ukraine, Russian forces entered Kyiv, the country’s capital.\nUkrainian authorities told the BBC that Russian forces were stationed in Kyiv’s northern sector.\nRussian armoured vehicles are said to have marched through the northern area of the capital city.\nPresident Zelensky of Ukraine has since addressed the nation, urging Putin to halt the assault and consider a truce.\nDetails later…"
  },
  {
    "headline": "BREAKING: Police Reinvite Sowore After Illegal Arrest As Buhari’s Minister, Malami, Nwoko Secure Judge To Remand Activist In Prison Custody",
    "summarized_story": "On Thursday, Sowore was apprehended by a team of armed police officers who had laid siege to the Court of Appeal’s entrance.\nHe was transported to Guzape’s dissolved Special Anti-Robbery Squad (SARS), also known as Abattoir, where he was held for several hours.\nAccording to a police source, Nigeria’s Attorney-General of the Federation (AGF) and Minister of Justice, Abubakar Malami and Nwoko, are dissatisfied with the activist’s release.\nAccording to the source, the duo has gotten a judge who will remand Sowore in prison if he accepts today’s invitation.\nThey have secured a judge to remand in prison custody today,” the source said."
  },
  {
    "headline": "Breaking: Russia incurs more losses as UEFA moves Champions League final to France",
    "summarized_story": "The 2022 Champions League final will be played in Paris after Russia was stripped of the match following the nation’s invasion of Ukraine.\nThe final of Europe’s most prestigious club competition was due to be played in St Petersburg on 28 May.\nUefa expressed “thanks and appreciation” to French President Emmanuel Macron for “his personal support and commitment to have European club football’s most prestigious game moved to France at a time of unparalleled crisis”.\nSpartak Moscow are the only Russian team left in European club competition this season, having reached the Europa League last 16.\nSpartak, along with other Russian and Ukrainian sides, will “be required to play their home matches at neutral venues until further notice”, said Uefa."
  },
  {
    "headline": "Those who swear by Holy Book must not abuse public office – Buhari",
    "summarized_story": "President Muhammadu Buhari has advised leaders who took the oath of office and swore with the Holy Book to be careful not to abuse the trust of leadership placed on them by the people and God.\n”Politics apart, whenever we are made to swear by the Holy Quran, we have to be very careful.\nThe president was accompanied by Kogi state Governor Yahaya Bello, his Plateau and Kebbi counterparts, Simon Lanong and Atiku Bagudu respectively.\nSpeaking to newsmen after the inauguration, Minister of Power Aliyu said the 330/132/33KV sub-station at Akurba community of Lafia was one of the legacy projects of the Buhari administration.\nThe minister added that with the official inauguration by the president, Nasarawa state has now become a centre of electricity distribution."
  },
  {
    "headline": "As Russia-Ukraine crisis worsens: FG prepares special flights to evacuate Nigerians, students – Blueprint Newspapers Limited",
    "summarized_story": "The federal government is planning a special flight operation to evacuate Nigerians from Ukraine amid the escalating crisis in the country;Ministry of Foreign Affairs announced this in Abuja Thursday.\nA statement issued by Nigerian Embassy in Kiev, urged Nigerian students seeking temporary relocation to seek proper clearance and guarantee before relocating.\nThe lawmakers feared many Nigerian students in Ukraine could be caught in the crossfire.\nThe call came Thursday following motion of Urgent Importance to evacuate Nigerian students in Ukraine, presented by Ahmed Munir, who solicited for urgent intervention of the House.\nThe House also mandated the Majority Leader and his team to travel to Ukraine Friday and come back with as many Nigerian students as possible by Monday."
  },
  {
    "headline": "Finally, President Buhari Signs Electoral Act Amendment Bill Into Law",
    "summarized_story": "President Muhammadu Buhari has finally signed the Electoral Act Amendment Bill into law.\nThe President of the Senate, Ahmed Lawan, and Speaker of the House of Representatives, Femi Gbajabiamila, witnessed the signing of the bill.\nAmid an outcry over the delay in signing the bill into law, sources had indicated that President Buhari was billed to give his assent on Wednesday.\nREAD ALSO: Again, Buhari Rejects Electoral Act Amendment BillFailed AttemptsPrevious attempts to amend the nation’s electoral laws were unsuccessful during the 8th National Assembly led by former Senate President Bukola Saraki and former Speaker Yakubu Dogara.\nThe harmonised version was received by President Buhari a week later, as confirmed by his Senior Special Assistant on NASS Matters (Senate), Senator Babajide Omoworare."
  },
  {
    "headline": "At Least 137 ‘Heroes’ Killed As Invading Russian Forces Press Deep Into Ukraine",
    "summarized_story": "Invading Russian forces pressed deep into Ukraine as deadly battles reached the outskirts of Kyiv, with explosions heard in the capital early Friday that the besieged government described as “horrific rocket strikes”.\n“Horrific Russian rocket strikes on Kyiv,” Ukraine Foreign Minister Dmytro Kuleba posted on Twitter after explosions were heard in the capital before dawn.\n‘War on Europe’Among the highest-profile strategic developments on Thursday, Ukraine said Russian forces had seized the Chernobyl nuclear power plant — prompting concern from international nuclear watchdogs.\nUkrainian forces said they had killed “around 50 Russian occupiers” while repulsing an attack on a town on the frontline with Moscow-backed rebels, which could not immediately be confirmed by AFP.\nDemonstrations across EuropeIn a televised address, the Russian president justified the assault as a defence of the self-proclaimed Donetsk and Lugansk republics in eastern Ukraine."
  },
  {
    "headline": "EU Leaders Agree ‘Maximum Impact’ Sanctions On Russia",
    "summarized_story": "European Commission chief Ursula von der Leyen told a media conference afterwards they “will have maximum impact on the Russian economy and the political elite”.\nThe summit started late Thursday, the day Russia started blasting military targets and sending tanks and paratroopers into its pro-Western neighbour Ukraine.\nVon der Leyen said the measures “will increase Russia’s borrowing costs, raise inflation and gradually erode Russia’s industrial base”.\nEnergy sector targets of the sanctions included an export ban on equipment and technology Russia needs to upgrade its oil refineries.\n“Talk is cheap… we have to be united around massive sanctions, severe sanctions,” Polish Prime Minister Mateusz Morawiecki said."
  },
  {
    "headline": "FG Plans Special Flights To Evacuate Nigerians From Ukraine",
    "summarized_story": "﻿The Federal Government is planning a special flight operation to evacuate Nigerians from Ukraine amid the escalating crisis in the country.\nThe Ministry of Foreign Affairs announced this in Abuja on Thursday.\nThe lawmakers were concerned there are many Nigerian students in Ukraine who could be caught in the crossfire.\nThe House Committee on Foreign Affairs was then mandated to liaise with the Foreign Affairs Ministry.\n‘Remain calm’Meanwhile, the Nigerian Embassy in Ukraine on Thursday had asked citizens in the East European country to remain calm and take responsibility for their personal security and safety."
  },
  {
    "headline": "BREAKING: Court Convicts Evans, Two Others Of Kidnapping Businessman, Donatus Duru",
    "summarized_story": "The Lagos High Court in Ikeja has convicted kidnap kingpin, Chukwudumeme Onwuamadike popularly known as Evans on a two-count of conspiracy and kidnapping of a businessman, Donatus Duru.\nThe victim is the Managing Director of Maydon Pharmaceuticals Ltd.Justice Hakeem Oshodi on Friday convicted Evans alongside two of his co-defendants, Uchenna Amadi and Okuchuwkwu Nwachukwu.\nThe judge held that the prosecution had successfully proved the charge against the three convicts beyond a reasonable doubt.\nThe court discharged and acquitted Ogechi Uchechukwu and two former soldiers of the Nigerian Army, Chilaka Ifeanyi and Victor Aduba for lack of sufficient evidence linking them to the crime.\nThe Lagos State government had arraigned Evans alongside Uche Amadi, Okwuchukwu Nwachukwu, Ogechi Uchechukwu, Chilaka Ifeanyi, and Victor Aduba for allegedly kidnapping the Managing Director of Maydon Pharmaceuticals Limited, Donatus Dunu February 14, 2017."
  },
  {
    "headline": "BREAKING: Buhari finally signs Electoral Act Amendment bill into law -",
    "summarized_story": "President Muhammadu Buhari has finally signed the reworked Electoral Act Amendment Bill 2021 into law.\nThe ceremony which took place in the Council chamber was witnessed by the wife of the President, Aisha Buhari, Vice President Yemi Osinbajo, President of the Senate, Ahmad Lawan, Speaker of the House of Representatives, Femi Gbajabiamila among other top government functionaries."
  },
  {
    "headline": "Okorocha: Lawyers ask president Buhari to look into EFCC’s workings -",
    "summarized_story": "A Federal High Court sitting in Abuja has granted an order of interim forfeiture of a property belonging to a former Governor of Imo State State, Rochas Okorocha.\nJustice Emeka Nweti gave the order while ruling on a motion ex-parte brought by the Economic and Financial Crimes Commission,AdvertisementThe EFCC had insisted that the property is reasonably suspected to be acquired with proceeds from illegality and corruption.\nAdvertisementReacting to the court ruling, lawyers representing the companies noted that Mr Okoracha is only a director in the company and not the owner.\nthey noted that the property was acquired in 2007 before Mr Okoracha became a governor of Imo State."
  },
  {
    "headline": "Bauchi gov visits Obasanjo, says Nigeria's leadership should be on merit -",
    "summarized_story": "Bauchi state governor and presidential aspirant of the People’s Democratic party, Senator.\nBala Mohammed on Wednesday met with Nigeria’s former president, Olusegun Obasanjo behind closed doors in Abeokuta, the Ogun state capital.\nAdvertisementThe governor stressed that Nigeria’s leadership should be based on merit towards bringing everybody on board.\nHe added that the People’s Democratic Party is rebuilding the party towards providing Nigerians the opportunity to rescue Nigeria from the present division the country has found itself.\nAdvertisementThe governor however stressed he is optimistic of getting the PDP ticket, saying that Nigeria is too large to be ignored."
  },
  {
    "headline": "PDP wins all chairmanship, councillorship positions in Enugu",
    "summarized_story": "The Enugu State Independent Electoral Commission (ENSIEC), has declared candidates of the People’s Democratic Party (PDP) winners of Chairmanship and Councillorship seats contested in all the 17 Local Government Areas and 260 electoral wards in the state.\nDeclaring the results at the ENSIEC headquarters Enugu, the Chairman of electoral body, Dr. Mike Ajogwu, stated that the elections were peaceful, free and fair.\nAdvertisementHe said the exercise was conducted in accordance with the electoral acts, and falls in compliance with the guidelines and timetable of the commission.\nDr. Ajogwu explained that results of the councillorship election were declared at the ward level by the Ward Returning Officer, disclosing that councillorship candidates of the PDP won in all the 260 electoral wards and were declared winners.\nAdvertisementThe ENSIEC Chairman, who announced the results of the chairmanship election, stated that candidates of the PDP got the highest number of votes cast in the 17 LGAs of the state, while declaring them winners."
  },
  {
    "headline": "US: Three Minneapolis Ex-Police Officers Guilty of Violating George Floyd’s Rights",
    "summarized_story": "RelatedStories No Content AvailableIt is a rare instance of police officers being held criminally responsible for a colleague’s excessive force.\nAll three men were convicted of denying Floyd’s constitutional right to medical care while in police custody.\nIn December, Chauvin pleaded guilty to the federal charge of violating Floyd’s rights.\nUnder Chauvin’s plea agreement, federal prosecutors will seek a 25-year sentence, concurrent with his state prison sentence.\nHis three former colleagues are also due to stand trial in Minneapolis in June on state charges of aiding and abetting Floyd’s murder."
  },
  {
    "headline": "World Leaders Fine-Tune Sanctions Meant to Punish Russia",
    "summarized_story": "A raft of new, stronger sanctions against Russia from Japan, Australia, Taiwan and others.\nAs Russian bombs and troops pounded Ukraine during the invasion’s first full day, world leaders on Friday began to fine-tune a response meant to punish the Russian economy and its leaders, including President Vladimir Putin’s inner circle.\nSouth Korean President Moon Jae-in said his nation will join international sanctions, but won’t consider unilateral sanctions.\nTaiwan announced Friday that it would join in economic sanctions against Russia, although it did not specify what type of measures those would be.\nWhile most nations in Asia rallied to support Ukraine, China has continued to denounce sanctions against Russia and blamed the United States and its allies for provoking Moscow."
  },
  {
    "headline": "President Zelenskyy Pleads for Help as Russian Troops Advance on Ukraine’s Capital Kyiv",
    "summarized_story": "Missiles pounded the Ukrainian capital on Friday as Russian forces pressed their advance and Ukrainian President Volodymyr Zelenskiy pleaded with the international community to do more, saying sanctions announced so far were not enough.\nAir raid sirens wailed over Kyiv amid unconfirmed reports that a Russian plane had been shot down and crashed into a building a day after Russian President Vladimir Putin launched an invasion that has shocked the world.\nRelatedStories No Content AvailableA senior Ukrainian official said Russian forces would enter areas just outside the capital, Kyiv, later on Friday and that Ukrainian troops were defending positions on four fronts despite being outnumbered.\nRussian troops seized the Chernobyl former nuclear power plant north of Kyiv as they advanced on the city from Belarus.\nZelenskiy said he understood Russian troops were coming for him but vowed to stay in Kyiv."
  },
  {
    "headline": "In First Major Post-PIA Deal, Seplat Acquires Mobil Producing Oil Assets in Nigeria",
    "summarized_story": "Seplat Energy on Thursday announced its acquisition of oil and gas assets belonging to Mobil Oil Producing Nigeria Unlimited (MPNU), in a deal seen as the first since the signing of the Petroleum Industry Act (PIA) by President Muhammadu Buhari in August last year.\nSeplat Energy said it was fully committed to working with the Nigerian government to bring the strategically important national assets fully into Nigerian ownership alongside the national oil company, NNPC.\n“If the transaction does not proceed, the deposit will be repaid to Seplat Energy where the agreement is terminated by Seplat Energy in certain circumstances.\nCommenting on the deal, Chairman of Seplat Energy, Dr. Bryant Orjiako, said: “This is a transformational acquisition for Seplat Energy that strengthens our partnership with the national oil company, the NNPC, and consummates the spirit of the newly enacted PIA.\n“MPNU’s employees and contractors have a strong reputation for safety and operational excellence, and I look forward to welcoming them to the Seplat Energy family,” he stated."
  },
  {
    "headline": "Nigeria: Buhari Reportedly Settles for Ex-Nasarawa Governor Adamu as Consensus Candidate for APC Chair",
    "summarized_story": "Reports that President Muhammadu Buhari might have settled for a former governor of Nasarawa State, Senator Abdullahi Adamu, as his consensus candidate for the office of the national chairman, seem to be true.\nAnother governor from the zone, Yahaya Bello of Kogi State, THISDAY was told, also rejected the purported adoption of Adamu.\n“The President Buhari that I know will not like to do things secretly.\nSenator Al-Makura, in a statement by Segun Tomo, the Director, New Media, Al-Makura Campaign Organisation (ACO), also denied that Adamu has been adopted as the national chairman of APC.\n“On the issue of who becomes chairman, the president asked that consultations continue to produce a credible and widely accepted choice as consensus candidate."
  }
]