[
  {
    "headline": "NARD backs MDCN’s mandatory training attachment for foreign-trained doctors",
    "summarized_story": "Lara AdejoroThe President of the National Association of Resident Doctors, Dr. Dare Ishaya has backed the new six-month mandatory attachment programme introduced by the Medical and Dental Council of Nigeria for foreign-trained medical and dental graduates, noting that it is a welcome development.\nPUNCH HealthWise had reported that the MDCN says all medical graduates who schooled abroad and seek to take its council’s assessment examination would undergo a six-month mandatory attachment programme.\nAccording to a statement posted on the council’s website, the first attachment programme will start in January and end in June 2022 while subsequent ones will be fixed accordingly.\n“Concerning the new mandatory attachment programme introduced by the MDCN for foreign-trained medical and dental graduates, we see it as a welcome development considering the high rate of failure of these graduates in their assessment exams.\n“This will also ensure quality assurance of the medical personnel imports into the country so that Nigeria doesn’t become a dumping ground for poorly trained medical and dental graduates."
  },
  {
    "headline": "NARD backs MDCN’s mandatory training attachment for foreign-trained doctors",
    "summarized_story": "Lara AdejoroThe President of the National Association of Resident Doctors, Dr. Dare Ishaya has backed the new six-month mandatory attachment programme introduced by the Medical and Dental Council of Nigeria for foreign-trained medical and dental graduates, noting that it is a welcome development.\nPUNCH HealthWise had reported that the MDCN says all medical graduates who schooled abroad and seek to take its council’s assessment examination would undergo a six-month mandatory attachment programme.\nAccording to a statement posted on the council’s website, the first attachment programme will start in January and end in June 2022 while subsequent ones will be fixed accordingly.\n“Concerning the new mandatory attachment programme introduced by the MDCN for foreign-trained medical and dental graduates, we see it as a welcome development considering the high rate of failure of these graduates in their assessment exams.\n“This will also ensure quality assurance of the medical personnel imports into the country so that Nigeria doesn’t become a dumping ground for poorly trained medical and dental graduates."
  },
  {
    "headline": "Omicron: Lagos residents must present vaccination cards to attend social gatherings —Sanwo-Olu",
    "summarized_story": "Kayode OyeroLagos State Governor, Babajide Sanwo-Olu, has said that Lagosians must present their COVID-19 vaccination cards to attend social gatherings during the December 2021 festive period.\nSanwo-Olu said the state government has received very disturbing information about intending outbound passengers procuring fake Covid test results and/or vaccination cards for travel purposes.\n“Every attendee of a social gathering MUST present their Vaccination Cards or digital bar code page showing at least first dose but preferably double dose full vaccination.\n“Guests and service providers with high temperature (above 37.5) are to be politely turned back and referred to paramedics or the emergency response team on ground.\n“All guests and service providers at the event must wear a nose mask or face shield before entry."
  },
  {
    "headline": "Omicron: Lagos residents must present vaccination cards to attend social gatherings —Sanwo-Olu",
    "summarized_story": "Kayode OyeroLagos State Governor, Babajide Sanwo-Olu, has said that Lagosians must present their COVID-19 vaccination cards to attend social gatherings during the December 2021 festive period.\nSanwo-Olu said the state government has received very disturbing information about intending outbound passengers procuring fake Covid test results and/or vaccination cards for travel purposes.\n“Every attendee of a social gathering MUST present their Vaccination Cards or digital bar code page showing at least first dose but preferably double dose full vaccination.\n“Guests and service providers with high temperature (above 37.5) are to be politely turned back and referred to paramedics or the emergency response team on ground.\n“All guests and service providers at the event must wear a nose mask or face shield before entry."
  },
  {
    "headline": "AIICO shareholders to receive bonus shares",
    "summarized_story": "By Rosemary IwunzeAIICO Insurance Plc has received its shareholders’ nod for the issuance of bonus shares.\nAccordingly, shareholders whose names appear on the register of members by November 23, 2021 will get a bonus of 12 shares for every nine shares held.\nAddressing shareholders at the company’s annual general meeting in Lagos, Chairman of AIICO Insurance, Mr. Kundan Sainani, said that the issuance of the bonus shares cleared the path for the Company to meet up with new capital requirements from NAICOM, adding that it strengthens the company’s market position on its journey to being the dominant insurer in sub-Saharan Africa.\nREAD ALSOMoody’s upgrades outlook on 9 banks to ‘Stable’Sainani stated: “Shareholders will recall that at about this same time last year, we were constrained to hold a virtual meeting by virtue of the then rampaging COVID–19.\nIts focus on its recapitalization efforts also received a commendation for completing its private placement and rights issue."
  },
  {
    "headline": "Leadway Assurance boosts youth entrepreneurship",
    "summarized_story": "By Rosemary IwunzeThe Managing Director of LeadwayAssurance Company Limited, Mr. Tunde Hassan-Odukale, has said that the organisation is committed to promoting entrepreneurship, driving continuous education, and improving the learning environment for students to expose them to realities in the business world.\nHassan-Odukale stated this when his company donated a state-of-the-art Entrepreneurship Development Centre to the Federal University of Technology (FUTA) Akure, Ondo State.\nSpeaking at the official commissioning of the building, Hassan-Odukale said: “This donation was made to the university to advance entrepreneurship particularly for graduating students such that it inducts them into the real business world and supports their ambitions.\nFor the undergraduates also who are still studying, it would expose them to happenings in the business environment as entrepreneurs both in the local environment and the country at large.”The Chancellor of the institution, His Royal Highness, Emir of Katagum, Bauchi.\nState, Alhaji Umar Faruk II, while commissioning the building, said: “This intervention will help strengthen the hope and resolve of the students that they can express their creativity to birth ideas that would transform lives and humanity."
  },
  {
    "headline": "Osinbajo says govt relying on CIOTA for guidance",
    "summarized_story": "Vice President Yemi Osinbajo•Nigeria needs inventory of transport assets for proper planning — JamohBy Providence AdeyinkaVICE President, Yemi Osinbajo, has said the Federal Government is relying on Chartered Institute of Transport Administration of Nigeria, CIOTA, to help chart the right part for transport development in the country.\nHe said the Federal Government holds the Chartered Institute of Transport Administration of Nigeria (CIOTA) in high regard as a professional body the country can rely on for direction in transport policy planning and administration.\n“It is also time to take stock nationally of all the transportation assets of Nigeria.\nWe are officially assuring the government at federal and state levels that the institute’s professional base is ready and at your disposal.\n“We believe that proper inventory of our national transportation assets will address the following important concerns: what is our exact national requirement in terms of transportation assets in order to avoid duplication, underproduction or under-investment?"
  },
  {
    "headline": "FG’s deficit rises 39% to N5.5trn in August — CBN",
    "summarized_story": "By Babajide KomolafeTHE Federal Government’s deficit spending in 2021 rose by 39 per cent, year-on-year, YoY, to N5.5 trillion in August.\nThe report shows that revenue rose 15 per cent, YoY to N2.83 trillion from N2.46 trillion in the corresponding period of 2021 (8mths-2020).\nBut expenditure rose slightly faster by 16 per cent, YoY, to N7.11 trillion from N6.23 trillion in the corresponding period of 2020 (8mths-2020).\nHowever, the CBN August Economic report showed that FG’s monthly deficit spending fell by 25.2 per cent, month-on-month, MoM, to N405.28 billion from N541.85 billion in July.\nThe low allocation to capital expenditure was attributed to the lag in capital releases in the period.”"
  },
  {
    "headline": "Customs Apapa Command intercepts drugs, others worth 7.8bn",
    "summarized_story": "The Nigeria Customs Service (NCS) Apapa Area Command has recorded a seizure of 97 containers with a Duty Paid Value (DPV) of N7.8 billion between January and November.\nThe Customs Area Controller (CAC) of the command, Comptroller Malanta Yusuf, made this known in a statement signed by the Public Relations Officer, Deputy Superintendent of Customs, Abubakar Usman, in Lagos on Tuesday.\nYusuf pointed out that the command recorded a seizure of 13 containers with duty paid value of N285 million in November.\nYusuf also said the Apapa Area Command had collected N89.7 billion as revenue for November, the highest monthly collection by any command of the NCS.\nHe said the command remained resolute in its resolve to contribute to the actualisation of the agenda of Comptroller-General of Customs, Col. Hameed Ali (Rtd.)"
  },
  {
    "headline": "Bayelsa Senator calls for revocation of operational license of AITEO over oil spill in Nembe",
    "summarized_story": "Senator Biobarakuma Degi-Eremienyo representing Bayelsa East Senatorial District has decried the environmental and water shoreline catastrophe in Nembe community caused by crude oil and gas blowout spill at Santa Barbara well 1, OML 29 operated by AITEO Eastern Exploration and Production Company Limited.\nIn a sponsored motion on Tuesday, the Bayelsa lawmaker urged the Senate to revoke the operational license of AITEO to serve as a deterrent to other careless oil companies.\nHe also asked the senate to adopt the motion calling for an urgent need to stop the continuous oil spill in the Bayelsa community.\nHe argued that the revocation would restore sanity in the oil and gas sector as well as instil discipline in the operators.\nSenator Degi-Eremienyo expressed disappointment at what he says is apparent technical incompetence in handling the incident on the part of AITEO Eastern Exploration and Production Company Limited."
  },
  {
    "headline": "FCT Minister congratulates Emmanuel Ogbeche on re-election as NUJ Chairman",
    "summarized_story": "Federal Capital Territory, FCT Minister, Malam Muhammad Musa Bello on Mondays congratulated Emmanuel Ogbeche on his re-election as the Chairman of the FCT Council of the Nigerian Union of Journalists, (NUJ).\nThe Minister noted that Ogbeche was the first Council Chairman to win a re-election bid in almost two decades, his victory signifies a purposeful leadership.\nThe Minister welcomed the pledge by the Council Chairman to work with the Federal Capital Territory Administration to realize the objectives of “a city that works for all”.\nBello also pledged that the FCT Administration would continue to render support to the NUJ to ensure good governance in the nation’s capital.\nHe wished the new Chairman and his team a very successful tenure in office."
  },
  {
    "headline": "Screening of pensioners designed to cleanse state payment system of fraud – Gov Abubakar Bello",
    "summarized_story": "Governor Abubakar Sani Bello of Niger State has said the ongoing screening exercise of pensioners in the state is meant to cleanse the system from pension scams and other financial irregularities.\nSpeaking to Journalists after monitoring the exercise in Minna, the governor said the exercise was not to cause any hardship to the pensioners but to sanitize the system and ensure pensioners are not shortchanged.\nHe said, “the whole essence of the screening is not to inconvenience anyone, but I have received reports of many innocent pensioners that have not been receiving their pension.\n“We have also received reports of a lot of fraud when it comes to pension.\nI have always known that there is some kind of sharp practices when it comes to pension payment”."
  },
  {
    "headline": "Steer clear from issues concerning Niger Delta – MOSIEND warns Arewa youths",
    "summarized_story": "The leadership of the Movement or the Survival of Ijaw Ethnic Nationality in the Niger Delta, (MOSIEND), has issued a warning to the President of the Arewa Youth Consultative Movement, Mallam Kabiru Yusuf, to stay clear from issues concerning the Niger Delta region and not put salt on the already existing injuries of the people.\nMOSIEND was reacting to the recent statements by Malam Kabiru, on the current oil spill in the Santa Barbara wellhead 1, OML 29, in Nembe river of Bayelsa State.\nThe President of the group expressed dismay that some critical stakeholders were toeing the path of politicking rather than lending their support in arresting the unfortunate situation.\n”Why will u prefer to talk about the issues of oil and gas rather than the death of innocent Nigerians being killed daily in the hands of these criminals.\n”Malam Kabiru, have never spoken about how desperate politicians in the Northern part of the country have been playing politics with the issues of insecurity in their region.”MOSIEND warned Kabiru never to intervene on issues concerning the people of the Niger Delta region or else he will face the consequences."
  },
  {
    "headline": "Gov. Ugwuanyi presents N186.64 billion 2022 budget estimates",
    "summarized_story": "Presenting the budget proposal tagged: “Budget of “Sustained Growth and Consolidation”, Gov.\nIt is our sincere wish to bequeath Enugu State Civil Service that is well-equipped and well-motivated for the job in hand.\n“We are transposing our State Health Systems to provide primary healthcare through the Enugu State Agency for Universal Health Coverage.\nUnder the Enugu State Universal Health Coverage Scheme (ESUHCS), we are targeting the enrolment of all Enugu State residents.\nUgwuanyi for presenting a modest and realizable budget estimates, assuring him that the House will give it expeditious consideration and passage."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "COVID-19 to push 11m Nigerians into poverty next year, says Fed Govt",
    "summarized_story": "According to her, before the pandemic, about two million Nigerians were expected to fall into poverty by 2020, as population growth outpaced economic growth.\nHowever, the pandemic jerked up the number, bringing the total newly poor to 8.6 million in the same year.\n- Advertisement -She listed having a vulnerable employment; receiving fewer remittances and being close to the poverty line as being responsible for the increase in poverty.\nExport declined by N6,669.55 billion (43,75%) to N12,522.67 billion while imports galloped by N2,2938.15 billion (17.32%) to N19,898.03 billion in 2020.\n“The COVID-19 pandemic has impacted negatively on global economic activities affecting both developed and developing countries alike."
  },
  {
    "headline": "Adhere to protocols or be deported, Sanwo-Olu tells foreigners",
    "summarized_story": "Foreigners coming into the country through Lagos State must adhere to the COVID-19 travel protocols or face possible deportation, Governor Babajide Sanwo-Olu warned yesterday.\n“We implore everyone to desist from patronising these gangs, as anyone found with a fake COVID-19 test result and/or vaccination card will be liable to prosecution and very stiff penalties.\n“Most of the continents of the world – including Africa – are now experiencing a fourth wave of the pandemic.\nUnfortunately, Lagos State is not left out as we are also experiencing the beginnings of a fourth wave with current positivity rate at six per cent.\n“Based on our analysis, the fourth wave was brought by the non-adherence to the laid down protocols to mitigate this pandemic."
  },
  {
    "headline": "Etsu Nupe mourns former COAS Wushishi",
    "summarized_story": "The Etsu Nupe and Chairman, Council of Traditional Rulers, Niger State, Alhaji Yahaya Abubakar has said that the sacrifices by former Chief of Army Staff, General Muhammad Wushishi to the country would never be forgotten.\nDescribing him as a dutiful and committed soldier who served Nigeria passionately, Abubakar said the death of Wushishi was shocking, especially as the country was in dire need of his services at this critical time of the intense fight against insurgency and banditry.\n“Wushishi had a rich military career and had held several command positions with distinction, an experience the country hoped to gain from as a former Army Chief.\nHis death is a personal loss and very painful,” he said in a statement made available to The Nation.\n- Advertisement -The royal father urged the deceased family to sustain his good legacy."
  },
  {
    "headline": "Five pupils, three housemasters arrested over Dowen College murder",
    "summarized_story": "By Kofoworola Belo-Osagie, Adebisi Onanuga, Lagos, and Tony Akowe, AbujaCoroner meets FalanaMothers hold candlelightReps urge police IG to take over investigationPolice confirmed yesterday that five pupils and three housemasters of Dowen College, Lekki, have been arrested over the death of Sylvester Oromoni Jnr.\nSpokesman, Adekunle Ajisebutu, confirmed the development in a statement, adding that investigation was ongoing.\n“I can confirm to you that five of the students involved are being held in custody and are helping with investigation.\nParents of Dowen College pupils scheduled a candlelight procession by the school for today in honour of the late Sylvester.\n“Dowen College Parents are startled and deeply saddened by the unfortunate incident that led to the death of Sylvester Oromoni."
  },
  {
    "headline": "BREAKING: Truck kills 17 students at Ojodu Berger",
    "summarized_story": "Several persons were crushed to death by a hit-and-run truck driver along Ogunusi Road, Grammar School bus stop, Lagos State.\nIt was learnt that the persons mainly school children were killed as they were going home from school after closing time and wanted to cross the road when the truck ran over them.\nThe driver was reportedly chased to the Ogba area where he was arrested.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nClick Here to Apply ."
  },
  {
    "headline": "COVID-19: UK detect Omicron on 7 Nigerian travelers",
    "summarized_story": "From Fred Ezeh, AbujaUnited Kingdom (UK) Government said its COVID-19 testing system has returned positive for Omicron variant of COVID-19.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nNigeria Centre for Disease Control (NCDC) said UK Government has notified them of the development, and it’s working on the development.\nNCDC Director General, Dr. Ifedayo Adetifa, in a statement confirmed that UK has formally written to them on the matter in line with the global health practice.\n“All viruses naturally mutate over time, including SARS-CoV-2, the virus that causes COVID-19."
  },
  {
    "headline": "sylvester-oromoni-three-dowen-students-in-police-custody-lagos-cp",
    "summarized_story": "The Lagos State Commissioner of Police, Hakeem Odumosu, says that three students of Dowen College in the Lekki area of the state are currently in police custody for allegedly assaulting 12-year-old Sylvester Oromoni.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nClick here .\nLatest Jobs in Nigeria (Graduates/Non-graduates).\nClick Here to Apply ."
  },
  {
    "headline": "Omicron: Travel ban on Nigeria discriminatory, prejudiced -FG",
    "summarized_story": "The United Kingdom’s restrictions on Nigerians came into effect, yesterday after the Omicron variant of COVID-19 was discovered, first in South Africa and later, Nigeria.\nA waiver was, however, made for citizens who travel from Nigeria but would have to pay £2,285 for a 10-day quarantine.\nCountries in Europe where the same variant has been discovered, they have not been included on the travel ban.\nEven if 21 cases were discovered, does that qualify us for a travel ban?\nThis is why this decision to ban travellers from Nigeria, who are neither citizens nor residents, is grossly discriminatory and punitive."
  },
  {
    "headline": "Malami launches virtual court sitting at Kuje correctional centre",
    "summarized_story": "The minister was quick to clarify that “this virtual court hearing will not in any way contravene the provision of section 36(6) of the 1999 Constitution, which provides for the arraignment, taking of evidence, tendering of documents, cross-examination and general conduct of criminal proceedings.\nInasmuch as these are done in accordance with the said provision, the virtual hearing would be valid.”Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nMalami further added that the project was initiated to ensure the hearing and determination of urgent and time-bound cases, using the digital platform.\nThe AGF spoke, yesterday, at the launch of the virtual court sitting facilities deployed here at the Kuje Correctional Centre, for virtual court sitting proceedings.\nEarlier, the Controller General Correctional, Halilu Nababa, expressed confidence that the project will enhance speedy access to justice and reposition the correctional service in line with standard global practice."
  },
  {
    "headline": "Equinix Set to Expand into Africa With Acquisition of MainOne in 2022",
    "summarized_story": "Equinix believes MainOne to be one of the most exciting technology businesses to emerge from Africa.\nUpon closing, these facilities will add more than 64,000 gross square feet of space to Platform Equinix, with 570,000 square feet of land for future expansions.\nWhen completed, this acquisition will extend Platform Equinix into West Africa, giving organizations based inside and outside of Africa access to one of the world’s fastest growing markets.\nSpeaking about the planned acquisition,President and CEO, Equinix, Charles Meyers, said: “The acquisition of MainOne will represent a critical point of entry for Platform Equinix into the expansive and rapidly growing African market.\nMainOne’s leading interconnection position and experienced management team represent critical assets in our aspirations to be the leading neutral provider of digital infrastructure in Africa."
  },
  {
    "headline": "Tambuwal: Restructuring is Nigeria’s Pathway to Devt",
    "summarized_story": "” No state is happy with where it is.\nNot even Lagos or Rivers; so, if Lagos and Rivers are not happy with where they are, how do you want Sokoto and others to feel?\nContinuing his justification for restructuring of the country, Tambuwal said, “It is not about Sokoto but what people have been talking about the need for restructuring and devolution of powers in the country.\nThe Federal Government must shed weight and devolve more powers to sub-nationals where the people are in the states and local governments.\n“When you talk about what my brother governors from the South said, they are entitled to their opinion."
  },
  {
    "headline": "Red List: UK Under Fire for Travel Apartheid against Nigeria",
    "summarized_story": "Latest figures from the UK government on its website revealed that 21 cases of omicron reported in England were linked to travel from Nigeria.\nThe UK, at the weekend, had updated its so called Red List, indicating countries prohibited from entering the UK in view of the new COVID-19 variant called “omicron”.\nIn his contribution, the President of the National Association of Nigeria Travel Agencies (NANTA), Mrs. Susan Akporiaye condemned the decision of the UK to put Nigeria in the red list and said it was totally uncalled for.\n“The decision taken by the UK by putting Nigeria on the red list is affecting our business.\n“Since the news of the outbreak, many countries, Nigeria inclusive, have reacted swiftly by placing a raft of travel restrictions and protocols."
  },
  {
    "headline": "Tax-to-GDP Ratio: FIRS Moves to Reflect Govt Revenues, Waivers, Others in Computation",
    "summarized_story": "Agba, said the ministry would continue to support the FIRS and provide the enabling environment and policy direction to strengthen its operations.\nHe said, “I am glad to note that the FIRS non-oil tax collections for 2020 and the collections so far for 2021 is higher than the tax from oil.\nThis can be attributed to the various reform programmes and digitization projects being undertaken by the Service to improve its operations.\nShe further stressed the need for the country to strengthen its fiscal buffers by building a resilient economy to withstand and overcome external vulnerabilities.\nThe former FIRS boss, also called for integrated tax system and real stakeholder engagement as well as home-grown solutions to enhancing domestic non-oil revenue collections."
  },
  {
    "headline": "Gana: Buhari’s Failure to Implement 2014 Confab Report, Terrible Mistake",
    "summarized_story": "•Says Nigeria better off togetherSylvester Idowu in WarriA former Minister of Information and Culture, Professor Jerry Gana, has described the failure of President Muhammadu Buhari-led administration to implement the 2014 National Conference report “as a terrible mistake”.\n“We, in the middlebelt of Nigeria, are great lovers of peace, justice and fairness.\nThe last administration convened a national conference in 2014 and we agreed on some certain fundamentals to ensure justice and fairness.\nLet me appeal to the federal government to promote peace, equity and justice.\nThe Youth Arise Nigeria Conference with large turnout in attendance from within and Outside Delta was put together by Advocates of Paradigm Shift in Governance."
  },
  {
    "headline": "BREAKING: Many Feared Dead As Truck Crushes Pupils In Lagos",
    "summarized_story": "Several pupils have reportedly been killed by a hit-and-run truck driver along Ogunnusi Road, Grammar School bus stop, Lagos State.\nAccording to reports, the pupils were going home after closing from school and wanted to cross the road when the truck ran over them.\nThe driver was said to have attempted to escape after the incident but was chased to the Ogba area where he was arrested.\nI saw about 15 pupils lying lifeless on the ground.\nThe incident has reportedly resulted in a riot while policemen fired tear gas canisters to disperse the crowd."
  },
  {
    "headline": "BREAKING: Many Feared Dead As Truck Crushes Pupils In Lagos",
    "summarized_story": "Several pupils have reportedly been killed by a hit-and-run truck driver along Ogunnusi Road, Grammar School bus stop, Lagos State.\nAccording to reports, the pupils were going home after closing from school and wanted to cross the road when the truck ran over them.\nThe driver was said to have attempted to escape after the incident but was chased to the Ogba area where he was arrested.\nI saw about 15 pupils lying lifeless on the ground.\nThe incident has reportedly resulted in a riot while policemen fired tear gas canisters to disperse the crowd."
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Fighters Take Over Yobe Police Station, Barracks, Set Operational Vehicles Ablaze",
    "summarized_story": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād, have taken over a police station in Buni Yadi town, Gujba Local Government Area of Yobe State.\nHowever, a military source told SaharaReporters on Tuesday that the terror group stormed the community, took over the police station and barracks newly renovated by the state government for several hours.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau.\nThe terror group has caused over 50,000 deaths and displaced millions of individuals mainly in Adamawa, Borno, and Yobe States."
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Fighters Take Over Yobe Police Station, Barracks, Set Operational Vehicles Ablaze",
    "summarized_story": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād, have taken over a police station in Buni Yadi town, Gujba Local Government Area of Yobe State.\nHowever, a military source told SaharaReporters on Tuesday that the terror group stormed the community, took over the police station and barracks newly renovated by the state government for several hours.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau.\nThe terror group has caused over 50,000 deaths and displaced millions of individuals mainly in Adamawa, Borno, and Yobe States."
  },
  {
    "headline": "Katsina Attorney General, El-Marzuq Orders Arrest, Detention Of Journalist Over Publication",
    "summarized_story": "The police in Katsina State acting on the orders of the Attorney General and Commissioner for Justice, Ahmad El-Marzuq, have detained a journalist, El Zaharadeen Umar over a publication.\nSaharaReporters gathered that Umar was arrested by the police during the weekend and has been detained for more than three days.\nNo one should intimidate a journalist by applying excessive power or any other means,” an activist, Comrade Yahaya M. Abdullahi wrote.\nFor instance, the police on September 19, 2016, Illegally arrested Jamil Mabai — the publisher of Cliqq Magazine and a columnist with Katsina Reporters.\nAlso in July 2017, another journalist in the state, Danjuma Katsina, was Illegally arrested and detained for allegedly making “injurious comments” about a newly elected member of the House of Representatives from the state, Mansur Mashi."
  },
  {
    "headline": "Police: Two students killed, 12 injured in Lagos truck accident",
    "summarized_story": "The Lagos police command says two students were killed in an accident involving a truck that occurred along the Ogunnusi road.\nAdvertisementThe incident happened on Tuesday afternoon after which residents blocked a section of the road with tyres to protest the accident.\nIn a statement issued on Tuesday evening, Adekunle Ajisebutu, police spokesperson in Lagos, said 12 other persons also sustained injuries in the accident.\n“As a result of the accident, two males died on the spot, seven females and five males totalling twelve victims sustained varying degrees of injuries.\n“The injured victims were taken to God’s Apple City Hospital, Ojodu Berger; St. Michael Hospital, Ojodu; and the Lagos State Emergency Hospital, Toll Gate."
  },
  {
    "headline": "Police: Two students killed, 12 injured in Lagos truck accident",
    "summarized_story": "The Lagos police command says two students were killed in an accident involving a truck that occurred along the Ogunnusi road.\nAdvertisementThe incident happened on Tuesday afternoon after which residents blocked a section of the road with tyres to protest the accident.\nIn a statement issued on Tuesday evening, Adekunle Ajisebutu, police spokesperson in Lagos, said 12 other persons also sustained injuries in the accident.\n“As a result of the accident, two males died on the spot, seven females and five males totalling twelve victims sustained varying degrees of injuries.\n“The injured victims were taken to God’s Apple City Hospital, Ojodu Berger; St. Michael Hospital, Ojodu; and the Lagos State Emergency Hospital, Toll Gate."
  },
  {
    "headline": "Compulsory tests, proof of vaccination... Lagos issues new COVID protocol for events",
    "summarized_story": "The Lagos government has announced new guidelines for social events and gatherings in the state during the festive season.\nThe governor said during the festive period, vaccination cards or negative COVID test results must be presented at the entrance of event venues.\nHe also said all attendees must be tested at the event venue or 24 hours before, regardless of their vaccination status.\nGuests and service providers with high temperature (above 37.5) are to be politely turned back and referred to paramedics or the emergency response team on ground.\n“All guests and service providers at the event must wear a nose mask or face shield before entry."
  },
  {
    "headline": "Compulsory tests, proof of vaccination... Lagos issues new COVID protocol for events",
    "summarized_story": "The Lagos government has announced new guidelines for social events and gatherings in the state during the festive season.\nThe governor said during the festive period, vaccination cards or negative COVID test results must be presented at the entrance of event venues.\nHe also said all attendees must be tested at the event venue or 24 hours before, regardless of their vaccination status.\nGuests and service providers with high temperature (above 37.5) are to be politely turned back and referred to paramedics or the emergency response team on ground.\n“All guests and service providers at the event must wear a nose mask or face shield before entry."
  },
  {
    "headline": "Lagos experiencing fourth wave of COVID, says Sanwo-Olu",
    "summarized_story": "Babajide Sanwo-Olu, governor of Lagos, says the state is currently experiencing a fourth wave of the COVID pandemic.\nAdvertisementIn a statement on Tuesday, the governor blamed the fourth wave on refusal of residents to adhere to the safety protocol, adding that as of December 5, Lagos had recorded a total of 78,564 confirmed cases.\n“Most of the continents of the world – including Africa – are now experiencing a fourth wave of the COVID-19 pandemic.\nUnfortunately, Lagos State is not left out as we are also experiencing the beginnings of a fourth wave with current positivity rate at 6%.\n“We are launching 30 private priority sites for those who want to be vaccinated within a private health facility.”"
  },
  {
    "headline": "Equinix in talks to acquire West African digital infrastructure firm MainOne",
    "summarized_story": "The company owns and operates an extensive submarine network extending 7,000 kilometers from Portugal to Lagos, Accra, and along the West African coast, with landing stations in Nigeria, Ghana, and Côte d’Ivoire.\nThese provide connectivity to and from Europe, West African countries, and the major business communities in Nigeria.\nMainOne also owns digital infrastructure assets that include three operational data centers, with an additional facility under construction expected to open in Q1 2022.\nGiven the huge supply gap in digital infrastructure in sub-Saharan Africa, Ayobami Omole, a Lagos-based telecom analyst at Tellimer, expects more of such transactions in the coming years.\nWhen completed, the acquisition will extend Platform Equinix into West Africa."
  },
  {
    "headline": "Earnipay is improving financial well-being for salaried employees",
    "summarized_story": "In Nigeria, wages for formal-sector employees are paid monthly; in the informal sector, however, this is paid daily.\nNow, when salaried employees go broke between paydays, they have three options: borrow, take a loan, or request a salary advance.\nEarnipay, a fintech solution, founded by Nonso Onwuzulike, allows employees flexible access to their accrued salaries on any day of the month.\nCommenting on Earnipay’s plans for 2022, Onwuzulike said, “Our goal is to partner with employers to improve employee financial well-being.\nIn addition to flexible salary access, we provide financial education to advise employees on best practices to manage their finances, and other products to assist them daily.”Share this article"
  },
  {
    "headline": "TradeDepot secures $110m to expand Buy-Now-Pay-Later to more African retailers",
    "summarized_story": "The fund will support the delivery of Buy-Now-Pay-Later (BNPL) services to 5 million SME retailers and drive further expansion of its merchant platform across the continent.\nThe debt funding was led by Arcadia Funds.\nIn Africa, SME retailers generate $1 trillion in sales annually and contribute $2.6 trillion to the continent’s nominal GDP.\nTradeDepot has grown from over 40,000 merchants on its platform last year to more than 100,000 merchants.\nBut, as for TradeDepot, it wants to capture more than 5 million SMEs as it continues to leverage and expand its BNPL offering in the 12 cities it’s currently operating in."
  },
  {
    "headline": "MTN Nigeria issues 575m shares through digital public offer",
    "summarized_story": "Nigeria’s biggest telco, MTN Nigeria, has announced that starting from Wednesday, 1 December 2021, retail investors can purchase up to 575 million shares held in MTN Nigeria at ₦169 per share—lower than its share price on the stock market.\nThis public offer is in line with MTN Group’s commitment to reduce its shareholding in MTN Nigeria from 78.8% to 65% over time.\nNotably, this public offer is primarily digital as the shares can be purchased online.\nBolaji Balogun, CEO of Chapel Hill Denham, an investment banking firm leading the public offering, explained this to TechCabal.\nIn response to this public offering announcement, MTN Nigeria’s share price fell 10% on Wednesday to a five-week low, a logical response as investors rushed to buy the lower-priced MTN public offering shares."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "#Tech4Disabled, January 2022 and 5G in Nigeria, Flex Finance’s pre-seed",
    "summarized_story": "Share this article:Hi there,Today I’m discussing:A tech-inclusive world for Africa’s disabled personsNigeria and its 5G launch progress?\nWith MTN Nigeria’s recent share sales, continuing profits recorded by telcos operating in Nigeria, and a 5G auction coming up, 2022 is shaping up to be an exciting year for the telecommunications space in the country.\nNigeria-based Flex Finance raises pre-seedFlex Finance team.\nSource: SuppliedSpend management startup, Flex Finance has announced a six-figure pre-seed round to build the Ramp of Africa.\nWith an official launch in March 2021, Flex Finance currently operates an all-in-one spend management application equipped with a digital wallet to help African businesses efficiently perform trackable spending."
  },
  {
    "headline": "4 tech innovations that can make life easy for physically challenged Africans",
    "summarized_story": "However, the World Health Organisation (WHO) puts the number of people living with disabilities at 300 million.\nThe UN also affirms that most Africans living with disabilities are excluded from school and work opportunities.\nIn celebration of the International Day of the Disabled, we are looking at four tech innovations that could help people living with disabilities globally.\nRecalling when a group of visually impaired persons was testing the Eone, Kim was asked if the watch was made specifically for the blind.\nMore attention needs to be paid to assistive tech but, more importantly, persons with disabilities."
  },
  {
    "headline": "The Herconomy story: Instagram page to fintech raising $600k in 24 hours",
    "summarized_story": "Herconomy founder, Ifedayo Durosinmi-Etti, found this even more true for women and began building solutions to address them.\nThe book’ launch helped establish a community, and what followed was probably unforeseen by anyone in the founder’s circle.\nIfedayo Durosinmi-Etti, CEO, HerconomyFast forward three years to 2021, and Herconomy has raised $600k pre-seed led by VC firm Oui capital.\nTo date, Herconomy claims to have disbursed about ₦30 million ($73,000) worth of grants to 42 women and men.\nDespite the challenges with the outsourced app, Durosinmi-Etti is grateful that the community could grow to over 15,000 members."
  },
  {
    "headline": "Equinix to buy MainOne in push for Africa’s data centre market",
    "summarized_story": "Founded in 2010 by Funke Opeke, MainOne has a presence in three countries including Nigeria, Ghana, and Côte d’Ivoire.\nThe acquisition marks the first step in Equinix’s long-term strategy to become an African carrier neutral digital infrastructure company.\nEquinix is betting on Nigeria’s growing population pushing demand for data centres and a spike in the number of operators.\nCharles Meyers, President, and CEO, Equinix, says the MainOne deal represents a critical point of entry for Platform Equinix into the expansive and rapidly African market.\nShe was also recently named one of the Top 10 Women to Watch in the Data Center Industry by Data Centre Magazine."
  },
  {
    "headline": "FX speculators selling off hoarded cash say senior Nigerian bankers",
    "summarized_story": "Senior Nigerian bankers say currency speculators are now beginning to bring out the foreign exchange they are hoarding to the market and selling, according to the Economist Intelligence Unit, EIU.\nIt is seen as reversing the speculative pressure on the Naira since the Central Bank stopped the sale of foreign exchange to bureau de change operators in July but the market still has a long way to go to stabilize.\nThe EIU said, “another test to our assumption lies in how a planned end to fuel subsidies in early 2022 plays out.\nNigeria’s national oil company is the sole petrol retailer because of the subsidy, and engages in crude‑for‑fuel swaps that conserve foreign exchange.\n“If the reform goes ahead (not our core forecast so close to an election), petrol will be imported by private marketers exclusively using hard currency."
  },
  {
    "headline": "Haulage cost in yuletide stable first time in 8 years",
    "summarized_story": "The Tin-Can and Apapa Ports are major economic gateway to Nigeria and account for about 80 percent of the country’s total imports.\nSimilarly, transporting a 20-foot container which cost N800, 000 in 2020, has equally dropped by 56.3 percent N350, 000.\nHe said shippers were still hoping for a further reduction in the cost of haulage especially if the government makes the roads to the ports motorable.\nThe reduction in the gridlock on port roads also helped in reducing the cost of freight,” he added.\nEmma Nwabunwanne, a Lagos-based importer, said transportation has remained stable despite the yuletide due to the decline in the volume of business at the nation’s seaport."
  },
  {
    "headline": "Obaseki receives javelin world record holder, assures on sports devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Monday, received world record holder and javelin gold medalist at the just concluded 2020 Paralympics Games in Tokyo, Flora Ugwunwa Ekurede.\nObaseki received the gold medalist at the Government House, Benin City, in company of deputy, Rt.\nThe governor reassured that his administration will continue to revamp sporting facilities in the state and sustain investment in the sector so as to create opportunities for Edo youths.\nHe said, “We are happy to have been able to revamp the sporting facilities in Edo State, giving youths and everyone else the opportunity to be the best that you can.\nWe encourage you to continue to train to be an inspiration to other youths, making them believe that there is ability in disability."
  },
  {
    "headline": "RUGBY HONOURS Edo Deputy Gov. PHILIP SHAIBU @ 52 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Rugby Association have put together a Birthday Rugby Tournament in honour of our sports loving Deputy Governor Rt.\nComrade Philip Shuibu, tomorrow Wednesday 8 December 2021 at Edo Boys High School, Adolor, in Benin City beginning from 10:00 am.\nAccording to the Head Coach and organizer of this event, Ntiense Williams popularly know as “Mr Rugby” in Nigeria, “The Rugby family is indeed very grateful to our Deputy Governor Rt.\nMeanwhile, a grate supporter of Schools Rugby in Edo State, Madam Modupeola Irele of the Ehibam GriefShare Foundation on hearing about the Birthday Rugby celebrations in honour of the sports loving and award winning Edo State Deputy Governor has willingly donated two individual trophies to be presented to the Most Valuable Player (MVP’s) in both the Male & Female events respectively.\nThe promising event which has already received the nod of His Excellency will also be graced by the Edo State Sports Commission led by its Chairman Barr."
  },
  {
    "headline": "Buhari, Obaseki urge Auditor-Generals on strategies to end corruption – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – President Muhammadu Buhari and the Edo State Governor, Mr. Godwin Obaseki have charged Auditor-Generals in the country to develop innovative strategies that can help the government win the war against corruption.\nDeclaring open the 2021 conference of Auditor-Generals in Nigeria (COAGN) with the theme ‘Securing Audit Independence Sustainability: The Urgency of Now,’ President Buhari restated his administration’s commitment to end corruption in the country.\nBuhari, represented by Governor Obaseki, noted that the sustained fight against corruption by his administration is already yielding positive results.\nAccording to him, “As you go into deliberations, I urge you to come with strategies on how to help stamp out corruption in Nigeria.\nWe have no other country than Nigeria; it is by doing so that the future generations of Nigeria can thrive in this great nation.”Buhari further noted, “During my first inauguration, I told Nigerians that if we don’t kill corruption, corruption will kill Nigeria."
  },
  {
    "headline": "Obaseki approves appointment of Agbogun, Gowon, Obadiku as Special Advisers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has approved the appointment of three new Special Advisers.\nIn a statement, Secretary to the State Government, Osarodion Ogie Esq., said the appointees are James Babatunde Agbogun Esq.\nAccording to him, “The Edo State Governor, Mr. Godwin Nogheghase Obaseki, has approved the appointments of the underlisted persons as Special Advisers in the Edo State Government.\n; Yakubu Gowon, and Jimfred Obadiku.”He added that the swearing-in of the appointees will be conducted at a date to be announced later.\nThis follows the recent appointment of 38 Senior Special Assistants and 96 Special Assistants drawn from across the state after the harmonization of the Peoples Democratic Party (PDP) by the leaders of the party."
  },
  {
    "headline": "Our men didn’t cause fatal accident at Lagos Grammar School – FRSC",
    "summarized_story": "Federal Road Safety Corps (FRSC), Lagos Sector Command of the has denied involvement of its officers in a fatal accident that occured at Grammar School bus stop on Tuesday, which killed about 17 students.\nOlabisi Sonusi, the spokesperson of the Lagos sector in a statement, said FRSC officers were called after the incident occurred and were not involved in it.\n“An articulated truck was said to have lost control at Grammar School Bus stop along Ogunnusi road, Lagos today, Tuesday 7th December, 2021 which caused the death of unverified number of students and leaving many injured,” Sonusi said.\n“The men of FRSC were called upon by passersby to help intervene after the crash had happened.\nAdekunle Ajisebutu, the Lagos police spokesperson said adequate policemen have been mobilised to the scene to maintain law and order."
  },
  {
    "headline": "Court declines to vacate order stopping FG from deducting state’s funds over $418m Paris Club debt",
    "summarized_story": "A federal high court in Abuja has declined to vacate an order restraining the federal government from deducting funds from the 36 states in Nigeria to settle $418 million judgement debt relating to the Paris Club.\nThe order was earlier made by the court restraining the federal government through their agencies from deducting the plaintiff’s monies pending the determination of the motion on notice.\n“We have a motion ex-parte to serve the 9th defendant an originating process dated December 6. praying for an order of substitutes service on the 9th defendant,” he said.\nJustice Ekwo granted Okutekpa’s prayer and ordered that the 9th defendant be served within three days by pasting the notice on his address.\nJustice Ekwo who declined to vacate the order noted that the restraining order was made subject to the motion on notice filed by the 36 states (the plaintiffs)."
  },
  {
    "headline": "Ugwuanyi presents N186.64bn 2022 budget estimates to Enugu House of Assembly",
    "summarized_story": "Enugu State governor, Ifeanyi Ugwuanyi of Enugu State has presented to the State House of Assembly, 2022 Budget estimates of One Hundred and Eighty-Six Billion, Six Hundred and Thirty-Five Million, One Hundred and Thirty-Five Thousand, Seven Hundred and Seventy Naira (N186,635,135,770.00) for consideration and approval .\nIt is our sincere wish to bequeath Enugu State Civil Service that is well-equipped and well-motivated for the job in hand.\n“We are transposing our State Health Systems to provide primary healthcare through the Enugu State Agency for Universal Health Coverage.\nUnder the Enugu State Universal Health Coverage Scheme (ESUHCS), we are targeting the enrolment of all Enugu State residents.\nUgwuanyi for presenting a modest and realizable budget estimates, assuring him that the House will give it expeditious consideration and passage."
  },
  {
    "headline": "Delivery truck kills over 17 Grammar School pupils in Lagos",
    "summarized_story": "It was a tale of sorrows tears and blood at Grammar School in Ojodu, Ikeja area of Lagos State earlier today when a delivery truck, said to be chased by officials of Lagos State Traffic Management Agency (LASTMA) rammed into the school killing at least 17 children.\nWitnesses said the incident happened soon after the school gate was opened with students coming out of the school premises in their numbers.\n“The driver was fighting with a traffic official when the accident happened,” a witness told Business Hallmark.\n“The traffic official jumped on the truck and was dragging the steering and in the process the truck rammed into the school.\nAnother witness said the truck driver ran away immediately after the accident, but was caught at Ogba very close to Excellence Hotel, where the truck was set ablaze by angry bystanders."
  },
  {
    "headline": "Comparing Nembe Oil Spill To Hiroshima Mischievous – NDYC",
    "summarized_story": "The Niger Delta Youth Council (NDYC) has described those comparing the Nembe oil spill to Hiroshima incident as mischievous.\nAddressing journalists on Tuesday in Abuja, the NDYC called on the Bayelsa State governor, Douye Diri, to resign over his position and comment on the spill, where he said that the Nembe spill was worse than the Gulf of Mexico spill.\nHe said, “first was an unnecessary and malicious exaggeration of the spill by a mindless comparison with the effects of the Hiroshima Atomic Bomb catastrophe.\n“Comparing the Nembe oil spill to Hiroshima is taking mischief to a dangerous level.\n“It is also based on the foregoing that we demand that Governor Douye Diri resigns immediately from the office of Governor of Bayelsa State."
  },
  {
    "headline": "Comparing Nembe Oil Spill To Hiroshima Mischievous – NDYC",
    "summarized_story": "The Niger Delta Youth Council (NDYC) has described those comparing the Nembe oil spill to Hiroshima incident as mischievous.\nAddressing journalists on Tuesday in Abuja, the NDYC called on the Bayelsa State governor, Douye Diri, to resign over his position and comment on the spill, where he said that the Nembe spill was worse than the Gulf of Mexico spill.\nHe said, “first was an unnecessary and malicious exaggeration of the spill by a mindless comparison with the effects of the Hiroshima Atomic Bomb catastrophe.\n“Comparing the Nembe oil spill to Hiroshima is taking mischief to a dangerous level.\n“It is also based on the foregoing that we demand that Governor Douye Diri resigns immediately from the office of Governor of Bayelsa State."
  },
  {
    "headline": "We’ll Continue To Utilise Oyo’s Resources For Our People’s Benefit – Makinde",
    "summarized_story": "Oyo State Governor, ’Seyi Makinde, on Tuesday, said that his administration will continue to judiciously utilize the resources of the state for the good of its people.\nHe said: “I feel highly delighted to be in your midst this morning on the occasion of the year 2021 Annual Public Service Forum.\n“The Public Service is one of the agents of development in any nation.\nSimilarly, in her lecture, the retired Federal Permanent Secretary, Deaconess, Joan Ayo, who was the guest speaker, explained that no nation develops beyond the capacity of its public service.\nShe maintained that the core values of Public Service include: political neutrality."
  },
  {
    "headline": "We’ll Continue To Utilise Oyo’s Resources For Our People’s Benefit – Makinde",
    "summarized_story": "Oyo State Governor, ’Seyi Makinde, on Tuesday, said that his administration will continue to judiciously utilize the resources of the state for the good of its people.\nHe said: “I feel highly delighted to be in your midst this morning on the occasion of the year 2021 Annual Public Service Forum.\n“The Public Service is one of the agents of development in any nation.\nSimilarly, in her lecture, the retired Federal Permanent Secretary, Deaconess, Joan Ayo, who was the guest speaker, explained that no nation develops beyond the capacity of its public service.\nShe maintained that the core values of Public Service include: political neutrality."
  },
  {
    "headline": "National Association Of Polytechnic Students Elect New Exco",
    "summarized_story": "The National Association of Polytechnic Students (NAPS) has held its national convention where new officials were elected.\nAccording to him, it would be his fundamental agenda to see better inclusion of Polytechnic graduates in the scheme of things.\nI promise to be the President of everybody and not only those that voted for me,” he said.\nAt the Convention, Comrade Asiegbu scored 92 votes while his closest rival, Comrade Samuel Anidi, from Delta State Polytechnic Oghara scored 88 votes.\nADVERTISEMENTAlso elected at the convention include Comrade Innocent Oko from the Benue State Polytechnic, Ugbokolo Benue State who emerged as the Senate President, Comrade Ashiru Sheriff Adefemi from the Federal Polytechnic Bida, Niger State as Vice President National Affairs and Comrade Collins Obioha from Federal Polytechnic Nekede Owerri who won as Vice President Special Duties."
  },
  {
    "headline": "Again, bandits attack Kaduna community, abduct over 36",
    "summarized_story": "Again, bandits have attacked communities in Birnin Gwari Local Government Area, shot sporadically and abducted over 36 locals.\nThis is coming as students and civil servants of Birnin Gwari extraction but now in the state capital, lamented that they could not travel with ease to the area for Christmas without military escorts.\nCommenting on the fresh attack on Birnin Gwari communities, Abu Muhammadu told journalists that the bandits raided the Jangali Bagoma community and went away with over 36 locals.\nAccording to him,” they came early Sunday and on Monday, shot indiscriminately and kidnapped the women, children and others from the community.\nMeanwhile, some students of tertiary institutions of Birnin Gwari origin, have said going home was expensive as they have to arrange for a military escort."
  },
  {
    "headline": "Again, bandits attack Kaduna community, abduct over 36",
    "summarized_story": "Again, bandits have attacked communities in Birnin Gwari Local Government Area, shot sporadically and abducted over 36 locals.\nThis is coming as students and civil servants of Birnin Gwari extraction but now in the state capital, lamented that they could not travel with ease to the area for Christmas without military escorts.\nCommenting on the fresh attack on Birnin Gwari communities, Abu Muhammadu told journalists that the bandits raided the Jangali Bagoma community and went away with over 36 locals.\nAccording to him,” they came early Sunday and on Monday, shot indiscriminately and kidnapped the women, children and others from the community.\nMeanwhile, some students of tertiary institutions of Birnin Gwari origin, have said going home was expensive as they have to arrange for a military escort."
  },
  {
    "headline": "Four killed in Imo as security operatives engage robbers in gun battle",
    "summarized_story": "Sources told our correspondent that the robbers were at the area to rob operatives of Point Of Sale Services when intelligence information was dispatched to the security operatives who were in a nearby axis and they swiftly responded.\nOn sighting the security operatives, the hoodlums were said to have immediately opened fire on them, who quickly responded, leading to the instant death of three of them while the other gave up the ghost in a hospital.\nA source said, “It was a heavy gun battle.\nThe residents of the area run away owing to the intensity of the gun battle.\nThe robbers came to rob POS operatives.”When contacted, the police spokesperson for the command, Micheal Abattam, said that while three robbers died on the spot, the other died in a hospital."
  },
  {
    "headline": "Four killed in Imo as security operatives engage robbers in gun battle",
    "summarized_story": "Sources told our correspondent that the robbers were at the area to rob operatives of Point Of Sale Services when intelligence information was dispatched to the security operatives who were in a nearby axis and they swiftly responded.\nOn sighting the security operatives, the hoodlums were said to have immediately opened fire on them, who quickly responded, leading to the instant death of three of them while the other gave up the ghost in a hospital.\nA source said, “It was a heavy gun battle.\nThe residents of the area run away owing to the intensity of the gun battle.\nThe robbers came to rob POS operatives.”When contacted, the police spokesperson for the command, Micheal Abattam, said that while three robbers died on the spot, the other died in a hospital."
  },
  {
    "headline": "Edo students riot to avoid exams, 45 arrested",
    "summarized_story": "By Usman Aliyu/BeninThe Police Command in Edo has arrested 45 students in connection with an attack on teachers and the police at Idogbo Secondary School in Ikpoba-Okha Local Government Area of the state.\nAccording to him, the students were arrested in the bush, where they were hiding.\nKatongs said that some of the arrested students have been arraigned in court.\n“When the examinations started, we invited some policemen and vigilante members in case of any eventuality.\n“When the situation became uncontrollable, teachers started scampering for their lives and the students went berserk, destroying everything on sight."
  },
  {
    "headline": "Abdulrazaq sets new record, signs 35 percent gender inclusion bill",
    "summarized_story": "We have therefore decided to give a legal cover for gender parity in Kwara State, no matter what party is in power.\nI have therefore assented to the Kwara State Political Offices (Gender Composition) Bill 2021.\n“This is a moment to specially appreciate all of you Kwara women for the great things that you stand for,” Abdulrazaq said.\nWe are all testimonies to the historic story of Kwara women under you,” she said.\nHe said Governor AbdulRazaq has made history in the country in trying to give more voice to women and every member of the society."
  },
  {
    "headline": "Lagos Safety Commission signs agreement with MAN on safety standard",
    "summarized_story": "The Lagos State Safety Commission on Tuesday signed an agreement with the Manufacturers Association of Nigeria, MAN, to ensure safety standards in factories.\nThe Director-General of the commission, Lanre Mojola, disclosed this at the signing and presentation of a book on safety in Alausa, Ikeja.\nAccording to him, the commission had engaged in strategic partnership as part of efforts of the government to achieve a safer and healthier Lagos.\nHe said: “We hope that this agreement is the beginning of another journey to ensure zero accidents across the state.\nWe are running a campaign called, ‘Zero accidents for 2022’ until the end of this administration."
  },
  {
    "headline": "Dowen College: Sanwo-Olu Speaks On Sylvester Oromoni’s Death",
    "summarized_story": "The death of Sylvester Oromoni of Dowen College, Lekki, was termed as “disturbing and tragic” by Lagos State Governor Babajide Sanwo-Olu on Tuesday.\nIn a Facebook post, he wrote, “I commiserate deeply with the family of late Sylvester (Jnr) Oromoni, the 12-year old pupil of Dowen College, Lagos.\nBut while that is going on, I would like to give Sylvester’s parents and entire citizenry of Lagos, the assurance of my full support at this trying time.\nThree pupils are currently in police detention for suspected assault, according to Lagos State Commissioner of Police Hakeem Odumosu, while two others are on the loose.\nWhile expressing their sorrow over the tragic incident that resulted in Oromoni’s death, the parents prayed for strength for the 12-year-bereaved old’s family."
  },
  {
    "headline": "Lai Mohammed Devoted Servant, Made Sacrifices – Buhari.",
    "summarized_story": "On his 70th birthday, President Muhammadu Buhari congratulated Lai Mohammed, the Minister of Information and Culture.\nMohammed, according to Buhari, was a dedicated public servant who made sacrifices for the country.\nIn a statement by his spokesman, Femi Adesina, the president said Mohammed has worked assiduously in enhancing the image of Nigeria by bridging the information gaps.\n“As a party stalwart, President Buhari notes the sacrifices and contributions of the minister in raising a formidable information machinery that went a long way in bringing change in the country.\nBuhari joined friends, members of the Federal Executive Council, FEC, All Progressives Congress, APC, and the media industry in wishing the Minister of Information good health, strength and longer life."
  },
  {
    "headline": "DSS Refused To Obey Court Orders Granting Kanu Change Of Clothing, Others —Lawyer",
    "summarized_story": "According to Ifeanyi Ejiofor, lead attorney for the beleaguered Indigenous People of Biafra leader, the Department of State Services has refused to execute court orders allowing Nnamdi Kanu maximum comfort in jail, including changing his clothes.\nBut Ejiofor said he visited Kanu in DSS custody on Monday, saying that despite the orders made by the court on December 2, 2021, the DSS flouted and ignored the court orders.\nThe statement was titled, ‘Update On Today’s Visit To Our Indefatigable Client – Onyendu Mazi Nnamdi Kanu At The Headquarters Of The Department Of State Services (DSS) Abuja’.\nHis lawyers had said the IPOB leader was re-arrested in Kenya and whisked to Nigeria.\nMeanwhile, the AGF has said that it is premature to pardon Kanu, adding that the IPOB leader is still standing trial for terrorism-related charges."
  },
  {
    "headline": "BREAKING: Ex-Nigerian Governor Is Dead",
    "summarized_story": "Chief Col Charles Edemenaha (rtd), a former Acting Military Administrator of Rivers State, has died at the age of 87.\nHe added that his father’s death has brought sadness to the Okpe kingdom, where he served as secretary to the Udogun Okpe and the Okpe Traditional Council of Chiefs.\nAccording to the announcement, Late Chief Col Edemenaha (rtd) served as Secretary to Udogun Okpe and the Okpe Traditional Council of Chiefs to both the late Okpe king, HRM Orhoro I, and the current monarch, HRM Orhue I, the Orodje of the Okpe Kingdom.\nHis late father, he said, was a pragmatic and imaginative leader who fatefully served the nation and the Okpe Kingdom.\n“His death is a big loss not only to the Okpe kingdom and Delta state, but also to the country as a whole,” he added."
  },
  {
    "headline": "Non-oil export: When FirstBank hosted stakeholders on boosting local production",
    "summarized_story": "AMAKA IFEAKANDU captures stakeholders’ views harvested during the non oil export webinar series 2021 hosted by First Bank of Nigeria Limited.\nOil boomWith the oil boom of 1970s, the country neglected agriculture and depended solely on oil for forex inflows.\nFirst Bank’s interventionAnd in a swift intervention, FirstBank organised non oil export webinar series to facilitate sustainable exports as well as guide participants on ways of navigating the hurdles and challenges of exports in Nigeria.\nStakeholders’ viewsIn various submissions, stakeholders in the nation’s trade and finance industry believe product packaging, documentation, certification as well as building supporting infrastructure will help enhance the non oil export in the country.\nFBN bossAddressing the gathering, Managing Director FBN Adesola Adeduntan explains that one of the strategies of the bank is to promote export in the country."
  },
  {
    "headline": "Pictures: Corp members ready to lead advocacy against drug abuse – Minister Dare",
    "summarized_story": "The Minister of Youth and Sports Development, Sunday Dare, has advocated the drafting of members of the National Youth Service Corps (NYSC) into the fight against drug abuse in the country.\n“One of the greatest problems we have seen in the Ministry of Youth and Sports Development is the menace of drug abuse amongst our Youth.\nIn different urban centres from Lagos to Port-Harcourt to Kano, you just need to visit a few of the hidden rehab centres.\n“Like several other countries, Nigeria’s future is imperiled unless it does something to halt the use of illicit drugs and its devastating effect on our younger population.\n“The issues are diverse, we talk about use of illicit drugs, we talk about sub-standard drugs but our utmost concern is how we can take our Youth out of this hole, they’ve found themselves."
  },
  {
    "headline": "Breaking: Truck driver crushes many school children to death in Lagos",
    "summarized_story": "A delivery truck around Ojodu Berger in Lagos, allegedly being chased by Federal Road Safety officials rammed into school children returning back from school and killd up 16 pupils on the spot.\nBlueprint gathered that the school children who are writing their first term examination closed by 3pm and were going home when the sad incident happened.\nAn eye witness told Blueprint that the driver and his motor boy were apprehended a few meters away from the incident and was beaten to a pulp by angry mob.\nEfforts to speak with the policemen from Grammar school Police station proved abortive as the gates were locked.\nDetails loading…"
  },
  {
    "headline": "VIDEO: Several Feared Dead As Truck Rams Into Schoolchildren In Lagos",
    "summarized_story": "Several schoolchildren are feared dead after a truck rammed into some students in the Ojodu area of Lagos State.\nThe incident occurred at Grammar School Bus-Stop along the Ogunusi Road on Tuesday afternoon when schoolchildren were returning to their respective homes.\nChannels Television gathered that the driver of the vehicle lost control before hitting the unspecified number of students.\nWhile some claimed about 13 students were feared dead, others said 17 schoolchildren died.\nREAD ALSO: Buhari Writes Senate, Seeks Passage Of 2021 Finance BillThe truck driver, the police commissioner explained, attempted to escape after hitting the schoolchildren."
  },
  {
    "headline": "Lagos Announces Fourth COVID-19 Wave, Says Erring Foreigners Risk Deportation",
    "summarized_story": "The Lagos State Government has raised alarm over the fourth wave of the COVID-19 pandemic in the state with its positivity rate at six per cent.\nSecondly, most of the continents of the world – including Africa – are now experiencing a fourth wave of the COVID-19 pandemic.\nUnfortunately, Lagos State is not left out as we are also experiencing the beginnings of a fourth wave with the current positivity rate at 6%.\nEpidemiology UpdateAs of the 5th of December 2021, Lagos State had recorded a total of 78,564 confirmed cases of COVID-19.\nOver the course of managing the COVID-19 pandemic, about 6,066 patients have been admitted into our various COVID-19 care centres in Lagos: with 686 registered fatalities."
  },
  {
    "headline": "Travel Ban: Governors Fault Canada And UK, Ask WHO To Intervene",
    "summarized_story": "Members of the Nigeria Governors’ Forum (NGF) have condemned the travel ban imposed on the country by authorities in Canada and the United Kingdom over the report of confirmed cases of omicron COVID-19 variant.\n“Only three cases of the Omicron variant of the coronavirus were detected in Nigeria less than a week ago, precisely on December 1st, 2021.\nConfirmed omicron cases across some countries as of December 3, the NGF stated, included Nigeria (three), Australia (seven), Brazil (three), Germany (nine), Israel (four), Italy (nine), and Netherlands (16).\n“There is also no evidence that harsh, blanket travel bans will protect the countries that impose them,” said the governors.\n“As a platform for the 36 democratically elected governors of the country, the NGF believes it reserves the right to speak for its people."
  },
  {
    "headline": "COVID-19: Nigeria Confirms Three More Cases Of Omicron Variant",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) has confirmed three more cases of the Omicron variant of the COVID-19.\nThis was disclosed in a statement on Tuesday, bringing the total number of confirmed cases of the Omicron variant detected in Nigeria to six.\nAccording to the statement, all the Omicron cases so far were detected in persons with recent travel history to South Africa in November.\nThe Delta variant remains the dominant variant and so far, we have not seen the replacement of this variant by the new Omicron variant as observed elsewhere.\n“Taken together, and if true, the Omicron variant can significantly change the current global COVID-19 epidemiology."
  },
  {
    "headline": "Kaduna Govt Conducts Fresh Competency Test for 35,000 Teachers",
    "summarized_story": "The Kaduna State Government has commenced another competency test for primary school teachers as part of efforts to ensure quality teaching and learning in basic schools across the state.\nThis comes almost four years after it conducted a similar exercise that led to the dismissal of 22,000 unqualified teachers and the recruitment of 25,000 qualified ones.\nIn 2017, the Kaduna State Ministry of Education sacked over 20,000 unqualified teachers who failed a test conducted to determine their competency.\nDespite the dust it generated, the government stuck to its guns and subsequently went ahead to employ about 25,000 new qualified teachers to fill the gaps.\nFour years down the line, the Kaduna State Government is embarking on the same process of assessing the competency of the newly recruited teachers through a computer-based system."
  },
  {
    "headline": "Resign now if you have political ambition, Gov Abiodun tells appointees -",
    "summarized_story": "Ogun State Governor, Prince Dapo Abiodun, has directed all serving political appointees with 2023 political ambitions in the State to resign on or before Jan 31 2022 to pursue their dreams.\nA statement issued in Abeokuta on Tuesday by his Chief Press Secretary, Mr. Kunle Somorin, said the directive had become expedient to avoid observed distractions and loss of focus in the discharge of their responsibilities.\nWhilst noting that it is legitimate to have such ambitions, the Governor, however, said: “As an Administration unwaveringly committed to delivering on its electoral promises, any activity that is capable of undermining the implementation of the Building Our Future Together Agenda of the Administration will not be tolerated”.\nGovernor Abiodun counselled that those who cannot wait till the appropriate time for 2023 electioneering process should take their leave to pursue their ambitions without constituting a clog in the wheel of the implementation of government programmes and activities, the statement concluded."
  },
  {
    "headline": "Nigeria needs thorough review of 1999 Constitution",
    "summarized_story": "Nigeria Needs Thorough Review of Constitution - Group"
  },
  {
    "headline": "I don't see anything wrong In Sanwo-Olu's Peace Walk initiative",
    "summarized_story": "In this interview, Babajide Kolade-Otitoju shares his views on the peace walk suggested by the Lagos State Governor, Babajide Sanwo-Olu.\nThe veteran journalist added that the move by the state governor is a good one, that is geared towards healing the wounds created by the unfortunate incident of October 20, 2020."
  },
  {
    "headline": "Speaker Gbajabiamila inaugurates road in Ikorodu",
    "summarized_story": "The speaker of the House of representatives, Femi Gbajabiamila has inaugurates road facilitated by Babajimi BensonThe road situated in the Ikorodu area of Lagos is designed to help improve intracity movement and boost economic activities."
  },
  {
    "headline": "Omicron Red List: Archbishop of Canterbury Joins Nigeria to Condemn Travel Apartheid",
    "summarized_story": "Nigeria became the 11th country to go on the UK’s red list for international travelon Monday.\nAll nations currently on that list are African.\nThe only people allowed to enter the UK from these countries are UK or Irish nationals, or UK residents.\nIn a message to his 165,000 Twitter followers, the Archbishop urged the Government to abolish what he described as the “morally wrong” red list.\nHe said: “With #Omicron set to become the dominant variant in the UK, I appeal to the British government to remove Nigeria and South Africa from the red list – together with all other countries currently on it."
  },
  {
    "headline": "US-Based Equinix Acquires Nigerian Digital Infrastructure Firm MainOne for $320m",
    "summarized_story": "Equinix Inc. is acquiring West African digital infrastructure firm MainOne Cable Co Ltd. at a valuation of $320 million, giving the US data-center investor more exposure to booming connectivity in West Africa.\nMainOne, founded by Nigerian entrepreneur Funke Opeke, is the owner of three data centers in the region with a fourth under construction.\n“With this deal, we are also acquiring additional land, probably enough to build another 10 data centers,” Judith Gardiner, Equinix vice president for emerging markets, said in an interview.\nFor MainOne, the transaction provides it with access to capital and networks to bolster its expansion plans, said Opeke, who will still be heading the company.\nThe transaction is expected to close at the end of the first quarter next year, subject to regulatory approvals."
  },
  {
    "headline": "Buhari’s Failure to Implement 2014 Confab Report a Terrible Mistake, Jerry Gana Says",
    "summarized_story": "A former Minister of Information and Culture, Professor Jerry Gana, has described the failure of President Muhammadu Buhari-led administration to implement the 2014 National Conference report “as a terrible mistake”.\n“We, in the middlebelt of Nigeria, are great lovers of peace, justice and fairness.\nThe last administration convened a national conference in 2014 and we agreed on some certain fundamentals to ensure justice and fairness.\nLet me appeal to the federal government to promote peace, equity and justice.\nThe Youth Arise Nigeria Conference with large turnout in attendance from within and Outside Delta was put together by Advocates of Paradigm Shift in Governance."
  },
  {
    "headline": "UK Fails to Red List 17 European Countries Despite Recording Omicron",
    "summarized_story": "Following its discovery at the end of November, the variant has now been detected in at least 48 countries, with 17 of them in Europe, according to the World Health Organisation (WHO).\nAs of Monday, Austria had reported 10 cases of the new disease variant, while Croatia and Denmark had reported two and 18 cases respectively.\nSimilarly, other European countries that had reported omicron on their soil included Netherlands with a total of 18 cases as of yesterday; Norway – 19 cases; Portugal – 34; Belgium – nine and Luxembourg with just one case.\nUK’s failure to red list its European allies reinforces the suspicion that African countries are being targeted by the Western world.\nThe racist undertone becomes even more obvious considering the speed of the action against African countries and the deliberate attempt to tag the virus an African virus."
  },
  {
    "headline": "Nigeria’s Parliament to ‘Ensure Judicious Use’ of Covid Funds, Says Senate President Lawan",
    "summarized_story": "President of the Senate, Dr. Ahmad Lawan has given assurance that the National Assembly would provide resources in 2022 budget for the battle against COVID-19 pandemic while insisting on judicious use of the funds.\nHe commended the PSC for the great work it had done in effectively coordinating and mounting a formidable national response to this emergent global public health threat.\n“The NASS proactively reviewed the Medium-Term Expenditure Framework (MTEF) and the 2020 national budget in order to sufficiently fund the national response to the pandemic and to provide economic stimulus packages for Nigerians.\n“In addition, after meticulous scrutiny, the Assembly gave approvals for various loans requested by the Executive to fund the 2020 national budget.\n“The Executive was engaged on the implementation of the Social Intervention Programme (SIP) in response to the needs of the citizenry."
  }
]