[
  {
    "headline": "Voter registration won’t end June 30, INEC assures Nigerians",
    "summarized_story": "The Chairman, Independent National Electoral Commission, Mahmood Yakubu on Saturday assured Nigerians that the ongoing continuous voter registration would not end on June 30 as earlier announced.\nHe said, “The second thing is you want to know when will this registration end?\nIn this place, we have 50 voter registration machines.\nBy Monday there will be more machines to register Nigerians.\nDon’t sell your votes because if you sell your votes you sell your future."
  },
  {
    "headline": "2023 elections must be peaceful, credible – EU Ambassador to Nigeria",
    "summarized_story": "The campaign was organised by Yiaga Africa, the EU, and other development partners to encourage voter registration and youth participation in the electoral process through music.\n“One of the key points of the recommendations of the European Electoral Observation Mission was the low turnout.\n“The message is to remain engaged, and most importantly they have to vote on the day of the election.\nIsopi also spoke on the effect the 2023 election would have on the West African Sub-region, and added that Nigeria must get it right.\nIt is important that these elections are good, peaceful, credible, and transparent,”"
  },
  {
    "headline": "Don't give up on Ukraine, Boris Johnson urges G7 leaders",
    "summarized_story": "British Prime Minister Boris Johnson on Saturday urged fellow G7 leaders not to “give up” on Ukraine four months into Russia’s grinding war, as he pledged fresh financial support for Kyiv.\n“Ukraine can win and it will win.\nJohnson, under pressure at home over a drubbing in two by-elections and a slew of negative headlines, has been steadfast in his support for Ukraine.\n“Any sign of fatigue or wavering in Western support for Ukraine will play directly into (Russian) President (Vladimir) Putin’s hands,” the statement added.\nJohnson’s spokesperson said as the fighting rages on, Western support for Ukraine needed to enter “a new phase”, and the question was how to best “empower” Ukraine."
  },
  {
    "headline": "Is PDP on auto-pilot mode?",
    "summarized_story": "By Tony IrediaThe Peoples Democratic Party (PDP), has served as Nigeria’s main opposition party since she lost the 2015 presidential election.\nIn his words, ‘PDP has been on auto pilot mode’ in the last six months.\nApart from across-the-nation sentiments about seasonal zoning of political positions, PDP is probably the only party that specifically provides for zoning in her constitution.\nRather they went ahead to throw the presidential election open whereas it was specifically zoned for the 2019 contest.\nThis has been confirmed by the fact that he left the PDP to a less-known Social Democratic Party SDP, yet garnered more votes at the election than the PDP candidate."
  },
  {
    "headline": "Bandits kill Niger Vigilante Cdr, several others, kidnap dozens",
    "summarized_story": "By Wole MosadomiA commander of a vigilante group, Mr. Danladi Dobbo, and four of his men were on Friday, confirmed killed by bandits in Kpada community of Lapai Local Government Area of Niger State.\nScores were also said to have been injured during the attack while many others were abducted.\nThree of those killed were said to be from Abaji town while the other two came from Lapai.\nA similar occurrence was also said to have occurred recently when some vigilante members and Police who were on a rescue mission were killed by bandits.\nWhen contacted, the Commissioner of Internal Security and Humanitarian Affairs, Emmanuel Umar, confirmed the attack adding that five people were killed during the invasion."
  },
  {
    "headline": "2023: Atiku, Tinubu, Peter Obi, Kwankwaso tasked on issue-based campaigns",
    "summarized_story": "By Fortune EromoseleDirector-General, Tinubu Presidential Campaign Forum, Omobola Bolu Omoleme, has urged presidential candidates on the platform of the All Progressives Congress (APC), Peoples Democratic Party (PDP), New Nigeria Peoples Party (NNPP), to run issue-based campaigns during electioneering campaign.\nShe stated this while congratulating Asiwaju Ahmed Bola Tinubu of the APC, Atiku Abubakar of the PDP, Peter Obi of the Labour Party and Rabiu Kwankwaso of the NNPP, for emerging as presidential candidates of their parties.\nOmoleme, in a statement in Abuja, said their emergence as flag bearers of their political parties was never a coincidence, pointing out that their humanitarian leadership precedence did earn them the victory, but insisted that running an issue based campaign will help in ensuring electoral integrity.\n“Let me call on the incumbent government to create a political ambiance that would generate a leveled plain ground for all candidates to compete equally ahead of the general elections,” Omoleme said while cautioning the presidential candidates to shun hate campaigns and strictly align with their party manifestos.\nTo this end, she charged the Independent National Electoral Commission, INEC, to increase PVC registration centres to avail citizens the opportunity to register and participate in the 2023 general elections."
  },
  {
    "headline": "55 medical students under Tambuwal’s foreign scholarship graduated with flying colours",
    "summarized_story": "Aminu Waziri Tambuwal’s revolution in the education sector has continued to yield the desired results following the graduation of another set of 55 students from amongst those being sponsored by his administration, to study Medical and Paramedical courses in India.\nRecall that the Governor had in 2018 approved foreign scholarships for some students to study various medical professional fields such as Physiotherapy, Nursing Sciences, Pharmaceutical Sciences, Biomedical Engineering and Pharmacy among others.\nTambuwal’s commitment to boosting education through various initiatives is on track as evidenced by the success stories shared by these fresh medical graduates.\nOthers include $570,000 equivalent to (N342,000,138) for the payment of tuition and upkeep allowances for both new students studying various medical courses in the Republic of Sudan.\nTheir tuition and upkeep allowances will gulp N42.1m during the period."
  },
  {
    "headline": "Dickson hails Media’s role in Democratic development",
    "summarized_story": "By Henry Umoru, ABUJAFORMER Bayelsa State Governor, Senator Henry Seriake Dickson, Peoples Democratic Party, PDP, Bayelsa West has hailed the Nigerian media for what he described as its critical role in promoting and defending democratic governance in Nigeria.\n“The media fought in the days of the military, played a key role, a leading role in ushering in our nation’s Democracy, and we are as also grateful that did not just acted as midwife of our nation’s Democracy and abandoned the fledgling baby of our nation’s Democracy to its operatives.\n“The media has behaved as dutiful nurses working with all other operator’s to nurture and deepen our Democracy.\nAnd we appreciate the work that the Nigeria media has been doing and will continue to do.\nAnd we encourage you fulfill your constitutional duties responsiblity of informing, of educating the Nigeria People, and also upholding elected leaders to account, that you have been doing.”"
  },
  {
    "headline": "Lady pledges to donate kidney to Ike Ekweremadu’s ailing daughter",
    "summarized_story": "A Nigerian lady, identified as Martha Uche, has volunteered to donate a kidney to the daughter of Senator Ike Ekweremadu.\nRecall that the lawmaker’s daughter, Ms. Sonia Ekweremadu, is reportedly down with kidney failure and needs a transplant.\nThe development had triggered both parents to take a young Nigerian to the United Kingdom for organ donation.\nAsked why she offered to donate her kidney, Uche said: “I need to do that because I need to help the girl.\nI need to help her.”“I don’t have any demands for now."
  },
  {
    "headline": "War: Russia to deliver nuclear-capable missiles to Belarus, upgrade fighter jets",
    "summarized_story": "Russia has pledged to deliver nuclear-capable Iskander-M missiles to its ally Belarus.\nRussian President Vladimir Putin made the promise when he met his Belarusian ally Alexander Lukashenko in St Petersburg on Saturday.\nPutin told President Lukashenko “in the next few months we’ll give Belarus tactical Iskander-M missile complexes, which can fire ballistic and cruise missiles, both conventional and nuclear types”, Russian RBC news reports.\nThe Belarusian President also asked Russia to make his country’s warplanes nuclear-capable, and the Russian leader further promised that Belarusian Su-25 fighter jets would be upgraded.\nRussian cruise missiles were also fired from ships in the Black Sea on Saturday, Ukraine’s military said."
  },
  {
    "headline": "Buhari meets Nigerians residing in Rwanda, seeks their collaboration",
    "summarized_story": "President Muhammadu Buhari on Saturday met with Nigerians residing in Kigali, Rwanda, lauding them for excelling at home and abroad.\nHe said the government is not averse to welcoming inputs and investments from compatriots with international exposure for the economy to thrive.\nThe President spoke at a town hall meeting with Nigerians in the Diaspora on the margins of the 26th Commonwealth Heads of Government Meeting (CHOGM).\n‘‘It gives me great pleasure to be in Kigali, Rwanda, and to meet with you, members of the Nigerian Diaspora as part of my regular meetings with Nigerians wherever I visit other countries.\nPresident Buhari noted that with the establishment of the Nigerians in Diaspora Commission (NIDCOM), Nigerians abroad can now seamlessly contribute their quota to national development, especially in the areas of investments in the economy."
  },
  {
    "headline": "War: Russia completely takes over Ukrainian Luhansk region",
    "summarized_story": "Russian forces have fully taken over the Ukrainian Luhansk region after conquering the city of Severodonetsk.\nSeverodonetsk mayor, Oleksandr Stryuk told Ukrainian TV on Saturday following weeks of heavy Russian shelling that has reduced the city mostly to ruins.\n“The Russians have fully occupied Severodonetsk, our military has retreated to more prepared positions,” Oleksandr Stryuk told Ukrainian TV.\nSeverodonetsk, which had a population of 100,000 people, has seen bitter street fighting and most of its residents have fled.\nRussian troops have also taken more than half of neighbouring Donetsk – the two regions that form the industrial Donbas."
  },
  {
    "headline": "200 arrested for violating sanitation exercise in Ilorin",
    "summarized_story": "About 200 people were arrested on Saturday in Ilorin, the Kwara State capital, for violating the environmental sanitation exercise.\n“They will be arraigned for immediate prosecution accordingly”, the State Commissioner for Environment, Remilekun Oluwatobi Banigbe, disclosed at the weekend, during the monitoring of the monthly sanitation exercise in the Ilorin metropolis to ascertain the level of compliance.\nBanigbe noted that everyone as a citizen of the state has a role to play in making sure that the exercise is always a success.\nShe said there are sanitation laws governing the state and should be strictly adhered to.\nShe lauded the magnanimous efforts of Governor AbdulRahman AbdulRazaq in making the state a safe haven for all and sundry."
  },
  {
    "headline": "Generational responsibility to salvage the Nigerian Civil Service The Nation Newspaper",
    "summarized_story": "One aspect of the elements of public service reform that I want to stress in this contribution has to do with relationship between the public administration professional community and the reform of the civil service system.\nThe virtue of public service has been eroded by the need to make ends meet through corrupt means.\nThis question becomes important given the near-absence of any gatekeeping capacity for public administration and the public service in Nigeria.\nGiven the critical nature of the gatekeeping imperative towards reprofiling the public service brand, it becomes urgent for the convening of a public service reform conference.\nTransiting the public service to the next level in its change agenda demands serious work where all hands—political and bureaucratic—must be on deck."
  },
  {
    "headline": "Reviewing Prof. Bala’s tenure in FUTMINNA The Nation Newspaper",
    "summarized_story": "Prof. Bala never bothers about the trappings of power.\nThis letter eloquently testifies to the quality of leadership Prof. Bala has brought to FUTMINNA.\nWitty and humorous, the Prof. Bala proves that he is familiar and conversant with every issue, having done his home work thoroughly.\nOne of the legacies Prof. Bala is leaving behind as he rounds off his tenure is his dedication to the completion of all projects.\nProf. Bala, is a consummate researcher of international repute with over 30 years of scholarship experience."
  },
  {
    "headline": "Britain’s Rwanda Shame: Growing anti-migrants’ image? The Nation Newspaper",
    "summarized_story": "The drafting of the European Convention on Human Rights was largely supervised by a British man, Sir David Maxwell Fyfe.\nThe truth is that the Rwanda policy is not completely out of character.\nBritain appears less concerned about living up to its reputation as a country that traditionally upholds and promotes human rights.\nIt is unconscionable that Rwanda, a country more densely populated than Britain is being seduced by the promise of slush funds.\nOpenly disparaging its human rights record and reputation will not win it friends or consolidate its global leadership."
  },
  {
    "headline": "Obasanjo: I made mistake picking Atiku as vice president The Nation Newspaper",
    "summarized_story": "A fresh battle appears to be brewing between former President Olusegun Obasanjo and the Peoples Democratic Party (PDP) presidential candidate, Alhaji Atiku Abubakar, ahead of the 2023 presidential election.\nObasanjo, in a scathing remark yesterday, said he made a mistake picking Atiku as his running mate for the 1999 election.\n“Twenty years later, I came back as civilian president, but those there now do not want to allow the youths.\n“He went on to say that Atiku told him that for him to become the President of Nigeria, the 2007 elections were only a formality.\n“But as of today, the political parties nominated their presidential candidates and nominated their vice-presidential candidates, so the issue of withdrawal is at the absolute discretion of the duly nominated candidate and no one else.”"
  },
  {
    "headline": "Southeast killings not about Igbo agitation – Soludo The Nation Newspaper",
    "summarized_story": "Anambra State governor, Prof. Chukwuma Soludo, has said that those that are killing people in Anambra State are only doing business and not agitating for anything.\nThe former Central Bank of Nigeria (CBN) Governor, spoke at the governor’s lodge Amawbia yesterday to mark his 100 days in office.\nAccording to him, “criminals invaded us and they are mostly not from Anambra’ State because money is involved.\n“The last 100 days has been very bumpy and challenging.\n“I am not a fan of marking 100 days in office."
  },
  {
    "headline": "Buhari, Kalu, Lalong hail Sanwo-Olu, Gbajabiamila at birthdays",
    "summarized_story": "From Juliana Taiwo-Obalonye, Abuja and Gyang Bere, JosPresident Muhammadu Buhari has hailed Lagos State Governor, Babajide Sanwo-Olu’s visionary leadership.\nKalu applauded the leadership qualities of Sanwo-Olu, stressing that the governor has sustained the foundation laid by the Bola Tinubu administration in Lagos State.\nHe said: “On behalf of the people of Abia North Senatorial district, I congratulate Governor Babajide Sanwo-Olu of Lagos State as he clocks 57.\n“Under his watch, Lagos State is witnessing robust transformation in all ramifications.\nExtolling the virtues of the Speaker, Kalu stressed that Gbajabiamila’s role in promoting a healthy relationship among the three tiers of government is remarkable and patriotic."
  },
  {
    "headline": "It was mistake making Atiku my running mate in 1999 –Obasanjo",
    "summarized_story": "From Laide Raheem, AbeokutaFormer President Olusegun Obasanjo has reiterated that he made a mistake in picking the presidential candidate of the Peoples Democratic Party (PDP), Atiku Abubakar, as his running mate in 1999.\nObasanjo was Nigeria’s president from 1999 to 2007.\nHe explained that the kind of money involved in the current politics of the country has made it difficult for young Nigerians to participate, urging them to remain hopeful.\nObasanjo further called for religious tolerance and harmony among Nigerians, submitting that no nation can develop amidst religious acrimony.\nHe, however, said that the country is in dire need of a paradigm shift in education in order for it to attain greatness."
  },
  {
    "headline": "Peter Obi: Igbo youths blow hot over alleged assassination plot",
    "summarized_story": "From Stanley Uzoaru, OwerriFollowing speculations that some Fulani Jihadist are plotting to assassinate the presidential candidate of the Labour Party (LP), Peter Obi, Igbo youths under the aegis of the Coalition of South East Youth Leaders (COSEYL) has urged security agencies in the country to thwart the plot and arrest all those behind it.\nThat we are peaceful does not mean that we are weak or senseless.\n“Mr Peter Obi as a bonafide citizen of the Federal Republic of Nigeria and born in Nigeria has the Constitutional right to contest for any political office he deems fit and nobody can stop that.\n“Obi is a successful man is all sense of the word.\n“Anyone who thinks he wants to attack such a peaceful and fulfilled man is sick and his sickness will be treated appropriately at the right time."
  },
  {
    "headline": "Gunmen kill vigilante commander, 2 others in Niger",
    "summarized_story": "From John Adams, MinnaA vigilance group commander, Mallam Danladi Dobbo, and two others were on Friday killed by gunmen in Kpade community in Lapai Local Government Area of Niger State in a renewed onslaught by the gunmen.\nSeveral villagers were also injured in the attack, while the gunmen who stormed a farm in the community abducted an unspecified number of locals.\nSources close to the community said the incident occurred on Friday around 3:30pm when the people were busy in their farms.\nA tractor belonging to the farmers was set ablaze by the rampaging gunmen who came in their large numbers.\nAccording to our source, gunmen ambushed the vigilance commander and his men who had gone into the forest to rescue the abducted victims; they killed him and two others."
  },
  {
    "headline": "Why I can’t kiss deeply in movies –Chizzy Alichi, actress – The Sun Nigeria",
    "summarized_story": "By Rita OkoyeNollywood actress, Chigozie Stephanie Alichi aka Chizzy Alichi-Mbah is not scared of husband snatchers.\nWhat does it take to maintain a happy marriage?\nAnd to me, that’s how to maintain a happy marriage.\nI didn’t, he is not a social media person.\nWhat’s your current relationship with Zubby Michael after the social media clash?"
  },
  {
    "headline": "DEMOCRATIC REVERSALS AND THE CRISIS OF GOVERNANCE – THISDAYLIVE",
    "summarized_story": "At the foundation of the issue of democratic reversals is the crisis of governance.\nDemocratic sustainability is tied to adherence to democratic principles which include the rule of law, separation of powers, credible elections, access to justice, equality and inclusive governance.\nPart of the challenge lies in the lethargy of presidents from member states to uphold democratic principles in their countries.\nSome leaders have also captured democratic institutions in their countries subjecting State institutions to act according to their whims and caprices.\nOne way to achieve this is through the strengthening of democratic institutions in a way that it can withstand pressures from African Strongmen and authoritarians."
  },
  {
    "headline": "Africa as Dumping Ground for European Wastes: From Toxic Wastes to UK Unwanted Refugees – THISDAYLIVE",
    "summarized_story": "From various accounts, there is no disputing the fact that the importation of the toxic waste was in collaboration with Nigerians.\nExpectedly, Trafigura Beheer BV initially denied any importation of toxic wastes from the Netherlands.\nWhen it eventually accepted knowledge of it, it claimed not to know that the toxic waste would not be properly disposed off.\nThe Convention was prompted by public outcries following the discovery of deposits of toxic wastes in Africa and many parts of the world.\nIn this regard, for how long will Africa remain a land for dumping of Europe’s unwanted toxic wastes?"
  },
  {
    "headline": "Time to License the Vote Trade – THISDAYLIVE",
    "summarized_story": "In the business of the vote trade, then, we are dealing with a market situation.\nIt is futile to continue to deny the existence of the vote trade, the unbridled unregulated free market of vote buyers and sellers.\nInstead, perhaps what we urgently need is to recognize and perhaps regulates the vote trade as a seasonal sub sector of our economy.\nPerhaps the best way to re-inject the monetary benefits of this vast seasonal economic activity is to recognize the vote trade as a legitimate activity.\nIt is time to kill the vote trade by granting it terminal license."
  },
  {
    "headline": "Real Estate Investment Opportunities in the US for Foreign Investors – THISDAYLIVE",
    "summarized_story": "Anyone can invest in real estate in the US and at a certain threshold of investment, you can even get permanent residency as an investor.\nThanks to rising interest rates and the impact of Covid, the real estate market in America is in turmoil right now.\nCulturally, Nigerians and other Africans like to hold their money in real estate so there are individuals from Africa who now hold real estate assets in the US within their portfolio.\nBriefly, the biggest opportunities for foreign investors in the US lie in the commercial real estate space because there is a glut of properties available for sale.\nThe pandemic coupled with inflation has created a perfect storm for commercial real estate in the US."
  },
  {
    "headline": "Insecurity: Akeredolu Issues Executive Order on Compulsory Use of CCTV in Public, Private Institutions – THISDAYLIVE",
    "summarized_story": "Oluwarotimi Akeredolu of Ondo State has signed an Executive Order for compulsory installation and use of close circuit television (CCTV) devices in all public and private institutions in the state.\n“The executive order shall be enforced at all religious places of worship, financial institutions (of all kinds), event centres, supermarkets and educational institutions (schools).\n“The public/private institutions shall employ and maintain well-trained security personnel who shall man the entry and exit points to their various facilities/premises.\n“Where necessary, the owners and occupiers of public/private institutions shall erect well-fortified perimeter fences, with security posts at the entry and exit points,” he said.\nThe governor further said that the order would be enforced by security agencies, particularly the Nigeria Police Force, Nigeria Security and Civil Defence Corps (NSCDC), Ondo State Security Network Agency (Amotekun) and Department of State Security Services (DSS)."
  },
  {
    "headline": "EXCLUSIVE: How Anti-graft Agency, ICPC Covered Up For Ex-Army Chief, Buratai, Failed To Submit Funds To Central Bank, To Secretly Move Cash From Facility",
    "summarized_story": "The Independent Corrupt Practices and Other Related Offences Commission (ICPC) appears to be doing the bidding of the former Chief of Army Staff, Lt Gen Tukur Buratai (retd.)\n“They did not submit the money to the CBN (Central Bank of Nigeria) but kept it in the facility, trying to move the money.\nBuratai got military intelligence to arrest the guy but covered up the issue when the man threatened to spill.\nOthers were former Chief of Defence Staff, Gabriel Olonishakin; Chief of Air Staff, Abubakar Sadique and Chief of Naval Staff, Ibok Ibas.\nOn August 17, 2015, the Chief of Army Staff paid the sum of N3,270,000 into the account."
  },
  {
    "headline": "EXCLUSIVE: How Anti-graft Agency, ICPC Covered Up For Ex-Army Chief, Buratai, Failed To Submit Funds To Central Bank, To Secretly Move Cash From Facility",
    "summarized_story": "The Independent Corrupt Practices and Other Related Offences Commission (ICPC) appears to be doing the bidding of the former Chief of Army Staff, Lt Gen Tukur Buratai (retd.)\n“They did not submit the money to the CBN (Central Bank of Nigeria) but kept it in the facility, trying to move the money.\nBuratai got military intelligence to arrest the guy but covered up the issue when the man threatened to spill.\nOthers were former Chief of Defence Staff, Gabriel Olonishakin; Chief of Air Staff, Abubakar Sadique and Chief of Naval Staff, Ibok Ibas.\nOn August 17, 2015, the Chief of Army Staff paid the sum of N3,270,000 into the account."
  },
  {
    "headline": "Nigerian Anti-corruption Agency, ICPC Confirms Arrest Of Military Contractor ‘Fronting For Former Chief Of Army Staff, Buratai’",
    "summarized_story": "His revelation came a few months after President Buhari replaced Buratai and other service chiefs.\nOthers were former Chief of Defence Staff, Gabriel Olonishakin; Chief of Air Staff, Abubakar Sadique and Chief of Naval Staff, Ibok Ibas.\nAccording to Monguno, neither the money nor the arms were on the ground upon the resumption of the new service chiefs.\nSaharareporters investigations showed that it belonged to a Nigerian Army Major, Emmanuel G. Adegbola of the Nigerian Army Finance Corps (N/10808).\nOn August 17, 2015, the Chief of Army Staff paid the sum of N3,270,000 into the account."
  },
  {
    "headline": "Nigerian Anti-corruption Agency, ICPC Confirms Arrest Of Military Contractor ‘Fronting For Former Chief Of Army Staff, Buratai’",
    "summarized_story": "His revelation came a few months after President Buhari replaced Buratai and other service chiefs.\nOthers were former Chief of Defence Staff, Gabriel Olonishakin; Chief of Air Staff, Abubakar Sadique and Chief of Naval Staff, Ibok Ibas.\nAccording to Monguno, neither the money nor the arms were on the ground upon the resumption of the new service chiefs.\nSaharareporters investigations showed that it belonged to a Nigerian Army Major, Emmanuel G. Adegbola of the Nigerian Army Finance Corps (N/10808).\nOn August 17, 2015, the Chief of Army Staff paid the sum of N3,270,000 into the account."
  },
  {
    "headline": "Nigerian Anti-corruption Agency, ICPC Confirms Arrest Of Military Contractor ‘Fronting For Former Chief Of Army Staff, Buratai’",
    "summarized_story": "His revelation came a few months after President Buhari replaced Buratai and other service chiefs.\nOthers were former Chief of Defence Staff, Gabriel Olonishakin; Chief of Air Staff, Abubakar Sadique and Chief of Naval Staff, Ibok Ibas.\nAccording to Monguno, neither the money nor the arms were on the ground upon the resumption of the new service chiefs.\nSaharareporters investigations showed that it belonged to a Nigerian Army Major, Emmanuel G. Adegbola of the Nigerian Army Finance Corps (N/10808).\nOn August 17, 2015, the Chief of Army Staff paid the sum of N3,270,000 into the account."
  },
  {
    "headline": "REVEALED: How Zulum queried Borno officials over N400m 'undocumented expenditures'",
    "summarized_story": "Babagana Umara Zulum, governor of Borno state, queried top government officials after they were indicted by the state’s auditor-general for not providing proper documentation to back expenditure totalling N400 million, TheCable understands.\nThe 153-page report, entitled “Annual Report of the State Auditor-General on the Accounts of Borno State for the year ended 31st December, 2020”, was published on May 31, 2021 and addressed to the Borno house of assembly.\nAdvertisementFollowing the publication of the report, Zulum directed Kashim Bukar, the auditor-general, to “strictly monitor the affairs of ministries, departments, agencies and commissions in Borno State with a view to enforcing transparency”, an insider told TheCable.\nThis led to the establishment of Borno State Bureau of Public Procurement Board with the mandate of “enforcing integrity and transparency in public expenditures”.\nAdvertisement“The report was produced and made public because Governor Zulum encouraged the audit work in order to promote transparency in public procurements."
  },
  {
    "headline": "REVEALED: How Zulum queried Borno officials over N400m 'undocumented expenditures'",
    "summarized_story": "Babagana Umara Zulum, governor of Borno state, queried top government officials after they were indicted by the state’s auditor-general for not providing proper documentation to back expenditure totalling N400 million, TheCable understands.\nThe 153-page report, entitled “Annual Report of the State Auditor-General on the Accounts of Borno State for the year ended 31st December, 2020”, was published on May 31, 2021 and addressed to the Borno house of assembly.\nAdvertisementFollowing the publication of the report, Zulum directed Kashim Bukar, the auditor-general, to “strictly monitor the affairs of ministries, departments, agencies and commissions in Borno State with a view to enforcing transparency”, an insider told TheCable.\nThis led to the establishment of Borno State Bureau of Public Procurement Board with the mandate of “enforcing integrity and transparency in public expenditures”.\nAdvertisement“The report was produced and made public because Governor Zulum encouraged the audit work in order to promote transparency in public procurements."
  },
  {
    "headline": "Rivers United win first-ever NPFL title",
    "summarized_story": "Rivers United have won the 2021/22 Nigeria Professional Football League (NPFL) title — with four games to spare.\nThe Port Harcourt-based NPFL side claimed their first-ever league title after Plateau United lost to Akwa United, last season’s champions, in Uyo.\nAkwa United edged Plateau United 2-1 at the Godswill Akpabio Stadium on Saturday.\nRivers United are set to take on Nasarawa United on Sunday in Lafia, the state capital, and a win could extend their lead by 13 points.\nBy virtue of the league win, Rivers will represent the country at the CAF Champions League next season."
  },
  {
    "headline": "Rivers United win first-ever NPFL title",
    "summarized_story": "Rivers United have won the 2021/22 Nigeria Professional Football League (NPFL) title — with four games to spare.\nThe Port Harcourt-based NPFL side claimed their first-ever league title after Plateau United lost to Akwa United, last season’s champions, in Uyo.\nAkwa United edged Plateau United 2-1 at the Godswill Akpabio Stadium on Saturday.\nRivers United are set to take on Nasarawa United on Sunday in Lafia, the state capital, and a win could extend their lead by 13 points.\nBy virtue of the league win, Rivers will represent the country at the CAF Champions League next season."
  },
  {
    "headline": "Lagos is worst-hit as COVID-19 cases surge in Nigeria",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) reported 247 new cases of coronavirus on Saturday, raising the tally to 256,958 infections since the pandemic started.\nThe latest figure is the highest recorded since March 13, when the new confirmed cases surged to 333.\nLagos recorded the highest number of infections with 203 positive samples; followed by FCT with 17 cases; Rivers with 14; Cross Rivers with 12 and Kano with one case.\nOverall, Lagos accounts for the highest tally of coronavirus fatalities in Nigeria with 769 deaths, followed by Edo (321)and the FCT (248).\nAdvertisementAt 100,125, Lagos also takes the lead in the number of reported cases, followed by the FCT and Rivers with 28,738 and 16,761 respectively."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Kune, the controversial Kenyan foodtech startup, has shut down",
    "summarized_story": "Kune, a Kenyan food tech startup that delivered ready-to-eat meals at affordable prices, is closing down today, the company’s founder and CEO Robin Reecht announced.\nThe announcement comes just 4 months after the startup began its commercial operations at established meal centers around Nairobi.\nAround that time, Kune leadership also declared its intentions to raise $3.5 million in its second round of funding.\nBut while Kune was well-liked by its customers, the startup’s journey wasn’t without its fair share of controversy.\nAddressing Kune’s investors, he said, “Not only did you invest in Kune but you gave us your time, brain-width, connections, and emotional support."
  },
  {
    "headline": "These founders are helping companies make decisions with data",
    "summarized_story": "It wasn’t their first time venturing into business together; only the previous year they’d tried building an aggregator to curate data from various African countries which multinational companies could use.\nRutakangwa understands why these costly business errors occur: the data the multinational companies rely on—often collected by market research firms—is assumed African countries to be monolithic and did not provide companies with enough detail with which to make market expansion decisions.\nSo, Rutakangwa and Sewankambo employed regular local consumers, called “mappers”, to collect the data from shops and households.\nWhen a mapper submits the data, Rwazi verifies the information by checking that the shop or household’s geocoordinates matches the mapper’s current location.\nBut Rutakangwa saw things differently: in principle, mapping data for hospitals and pharmacies was the same as mapping for beverage and liquor companies."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Tinubu certificategate: CSO calls for arrest, prosecution of APC presidential candidate",
    "summarized_story": "According to the group, Tinubu lied in his EC9 form published by INEC when he claimed that he did not attend both primary and secondary school.\nThe Centre said the submission of Tinubu contradicted earlier claim, particularly the information he gave to the electoral umpire in 1999 in his form CF 001.\nKalu disclosed that the group is drawing attention to the issue because the police was yet to respond to its petition since June 16, 2022.\n“We wrote a petition to the IG on June 16, demanding the prosecution of Tinubu for providing false information on oath in his INEC form CF 001 which he submitted in 1999.\n“We are also calling on President Buhari to direct the IG to arrest and prosecute Tinubu for perjury, it is a very serious issue,” Kalu said."
  },
  {
    "headline": "‘I made a mistake choosing my number two’ – Obasanjo",
    "summarized_story": "Former President Olusegun Obasanjo has expressed regret at choosing Atiku Abubakar as running mate and eventual Vice President of the Federal Republic of Nigeria between 1999 and 2007.\n“Young people should learn at a very early get in life that if there are five religions in the world, that is how God wants it to be.\n“If you are a Muslim and you did not live the way the God wants you to live, you cannot enter Aljannah (Paradise).\nOf you are a Christian and you did not live the way God wants you to live, the same thing, you will not enter Paradise.\nPractice your religion the way God wants you to do it and dont condemn another person”, he concluded."
  },
  {
    "headline": "FAAC shares ₦680.783bn May revenue to FG, states, LG",
    "summarized_story": "The Federation Account Allocation Committee (FAAC) has shared a total sum of ₦680.783 billion May 2022 Federation Account Revenue to the Federal Government, States and Local Government Councils.\nThe ₦680.783 billion total revenue comprised distributable statutory revenue of ₦385.004 billion, distributable Value Added Tax (VAT) revenue of ₦198.512 billion and Electronic Money Transfer Levy (EMTL) revenue of ₦97.267 billion.\nRead also: FAAC shares N656 billion to FG, states, LG in April 2022A gross statutory revenue of ₦589.952 billion was received for the month of May 2022.\nThis was lower than the ₦635.037 billion received in the previous month by ₦45.085 billion.\nFrom the ₦385.004 billion distributable statutory revenue, the Federal Government received ₦185.197 billion, the State Governments received ₦93.934 billion and the Local Government Councils received ₦72.419 billion."
  },
  {
    "headline": "Edo govt trains herbal healers on good hygiene – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has assured members of the Association of Lunatic Healers, of the government’s support in the discharge of their services in the state.\nWhile commending the herbal healers for their passion for the treatment and rehabilitation of persons living with mental illness, he noted that the government will continue to support them to improve their skills.\nOkeguale said the state government is committed to enhancing the capacity of herbal practitioners, urging them to adhere to proper personal hygiene and clean working environment.\nChairman, Association of Lunatic Healers, Edo State, Dr. Samuel Kayode Oghaimeh, expressed appreciation to the state government for the training, which he said, has enriched the members with new knowledge on how to improve their practice.\nFacilitators at the training are the Head of Social Welfare Unit, Federal Neuro-Psychiatric Hospital, Uselu, Agho Ifueko Taiwo, and a Social Welfare Officer with the Federal Neuro-Psychiatric Hospital, Mrs. Felicia Igbinovia."
  },
  {
    "headline": "Edo recommits to use of tech to enhance productivity, as 94 MDAs link to e-governance system – Nigerian Observer",
    "summarized_story": "Edo recommits to use of tech to enhance productivity, as 94 MDAs link to e-governance systemShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has pledged to sustain ongoing reforms in the state’s civil and public service to engender responsive and technology-driven service delivery, leveraging the immense potential of technology to increase the productivity of the state’s workforce.\nThe Edo State Head of Service, Anthony Okungbowa Esq, gave the assurance during a monitoring and evaluation exercise for 94 Ministries, Departments and Agencies (MDAs) across the state.\nHe noted that the government is transforming the state’s civil and public service, ensuring that every worker is adequately equipped with the needed skills and tools to guarantee efficient service delivery to Edo people.\nOkungbowa said the state is leveraging technology and operating an e-governance system to enhance transparency in government, eliminate corruption and promote efficiency, adding, “This is a part of the instruments put in place by the Governor Godwin Obaseki-led administration to ensure effective and efficient service delivery to the people.”The HOS explained that the e-governance system will enhance modern work ethics introduced in the service by the government, noting that “since the onboarding of the e-governance system in April, 2022, the government has put measures in place to ensure strict compliance in its implementation.”He further disclosed that the government has onboarded over 123 workers as Edo e-governance champions that serve as change agents in driving the implementation of the technology-driven system across the various MDAs in the state.\nOkungbowa explained that “the modules involved in the Edo-governance system include memo management, mail management, leave application, training, and general request, among others embedded on the platform to make work easy and balanced.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Keke Rider Kills Refrigerator Repairer In Warri – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – Tragedy struck in the heart of Warri, Warri South Local Government Area of Delta State when a commercial tricycle (keke) rider killed a refrigerator repairer .\nThe midday tragic incident started when the keke rider, while reversing his tricycle, hit a corn vendor at Okandeji Street by Ginuwa Junction in Otovwodo, Agbassa Community Warri, on Thursday, June 16, 2022.\nAccording to a witness the matter which started as a hot exchange of insults, soon degenerated into a brawl between the keke rider and the refrigerator repairer who was about to patronize the corn vendor when the accident occurred.\nThe altercation, which later resulted in fisticuffs between both men, saw the keke rider hitting the head of the repairer with a club which left him unconscious.\nIt was learnt that when the refrigerator repairer eventually died, the authorities of the said clinic had to trick the keke rider (in connivance with some community leaders) to come over to provide more funds for the treatment of the victim."
  },
  {
    "headline": "Obaseki proceeds on annual vacation, transfers powers to Deputy, Shaibu – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… writes State AssemblyBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has proceeded on his annual leave and has transferred powers to his Deputy, Rt.\nComrade Philip Shaibu, to act in his stead while he is away.\nIn a statement, Special Adviser to the Governor on Media Projects, Crusoe Osagie, said the governor has written to the Edo State Assembly, to intimate the House of the development.\nHe said: “The governor has proceeded on his annual leave and has transferred power to his deputy, Rt.\nComrade Philip Shaibu."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Hisbah to regulate social media over ‘immorality’ on TikTok",
    "summarized_story": "The Kano Hisbah and the State Censorship Board have said they are working together to regulate social media, particularly Tik Tok, to curb “immoral acts” among Muslims in the state.\n“Our board and Hisbah have set up a Committee that will provide a system that will tackle this menace.\nAnd we cannot allow that because it would spoil the moral upbringing of our children,” he added.\n“We are concerned with influential Tik Tokers too who aren’t filmmakers because they spoil our children’s character and moral upbringing.\nHe stressed that Muslim social media users from the state were “now misusing the privilege and disseminating negative information” on Tik Tok."
  },
  {
    "headline": "2022: Osun monarch sues for peace as political unrests persist in Ijesaland",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe Owarisa Obokun , Ilowa-ijesa, Oba Adebukola Alli has charged politicians in Ijesaland to embrace peace.\nThis is coming following incessant political tussle in the Ijesa axis of Osun State.\n“We don’t want to witness any bloodshed, Infrastructures put in places by the government is more or less our collective inheritance.\nThey should not spoil them because of political enmity.\nThey should see politics as a game, there will be winners and losers.” he said."
  },
  {
    "headline": "NGX, GRI, PRI set to Host Webinar on Responsible Investing",
    "summarized_story": "Nigerian Exchange Limited (NGX), in collaboration with Global Reporting Initiative (GRI) Africa and Principles for Responsible Investment (PRI) is set to host a webinar on the role of ESG metrics and data in enabling responsible investing, on Wednesday, 29 June 2022, at 11:00am (WAT).\nThe webinar themed, “Empowering Responsible Investing through Data Metrics and Environmental, Social and Governance (ESG) Integration”, is aimed at investors, companies, market regulators and practitioners who are interested in understanding ESG metrics/data required by investors to make sound investment decisions.\nInterested participant can register for the free webinar on https://bit.ly/ngx_eridSpeaking about the event, the Divisional Head, Business Support Services, NGX, Irene Robison-Ayanwale, noted that, “The increase in sustainable and responsible investment has put ESG metrics higher up on the list of performance considerations, as many investors now prefer to use their money to create change in the world.\nInvestors are increasingly relying on a wide range of ESG data when making decisions about where to invest their money.\nThe webinar which is in line with the Exchange’s commitment to foster the growth of long-term sustainable finance in the Nigerian capital market will drive conversations on how decision-useful ESG data plays a key role in investment decisions.”Confirmed speakers at the webinar include, Temi Popoola, CEO, Nigerian Exchange Limited; Chinua Azubike, CEO, InfraCredit; Dave Reubzaet, Director, Capital Markets, GRI; Darron Scorgie, Head of Africa, Signatory Relations, PRI; Temilade Aduroja, Head of Investor Relations, Dangote Cement Plc, Jude Chiemeka, Divisional Head, Capital Markets, Nigerian Exchange Limited and Nicole Martens, Senior Stewardship Professional, Old Mutual Investment"
  },
  {
    "headline": "INEC excludes Lawan, Akpabio, Umahi from APC senatorial candidates’ list",
    "summarized_story": "The Independent National Electoral Commission (INEC), has excluded Ahmad Lawan, senate president; David Umahi, Ebonyi State governor and Godswill Akpabio, former governor of Akwa Ibom State from the list of All Progressives Congress (APC) senatorial candidates.\nThe trio had been listed by the APC as candidates for Yobe North, Ebonyi South and Akwa Ibom North-west senatorial districts, respectively.\nHowever, in the list published by the commission on Friday, Lawan, Umahi and Akpabio were said to have been excluded.\nThe development comes on the heels of controversy over the APC Yobe north senatorial ticket, as well as issues over senatorial primaries featuring Akpabio and Umahi.\nAlthough APC had fixed its senatorial primaries for May, Umahi, Lawan and Akpabio were said to have participated in primaries organised by the APC after the trio contested the APC presidential ticket and lost earlier in June."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "JUST-IN: Terrorists Kill Another Kaduna Catholic Priest On His Farm",
    "summarized_story": "Unknown gunmen, on Saturday, killed a Catholic Priest, Rev.\nThe chancellor, Catholic Archdiocese of Kaduna, Rev.\nVitus Borogo, which sad event took place today, at Prison Farm, Kujama, along Kaduna-Kachia road, after a raid on the farm by Terrorists.\n“Until his death, late Fr Vitus aged 50 years was the Chaplain of the Catholic Community of the Kaduna State Polytechnic, and the Chairman of the Nigerian Catholic Diocesan Priests Association (NCDPA), Kaduna Chapter.\nMatthew Man-Oso Ndagoso, the Catholic Archbishop of Kaduna condoles with the immediate family, the NFCS Family of Kaduna Polytechnic, and indeed the entire Kaduna Polytechnic Community and assures them of his fraternal closeness and prayers.”He said, details of Bogoro’s funeral arrangement will be announced as soon as possible."
  },
  {
    "headline": "JUST-IN: Terrorists Kill Another Kaduna Catholic Priest On His Farm",
    "summarized_story": "Unknown gunmen, on Saturday, killed a Catholic Priest, Rev.\nThe chancellor, Catholic Archdiocese of Kaduna, Rev.\nVitus Borogo, which sad event took place today, at Prison Farm, Kujama, along Kaduna-Kachia road, after a raid on the farm by Terrorists.\n“Until his death, late Fr Vitus aged 50 years was the Chaplain of the Catholic Community of the Kaduna State Polytechnic, and the Chairman of the Nigerian Catholic Diocesan Priests Association (NCDPA), Kaduna Chapter.\nMatthew Man-Oso Ndagoso, the Catholic Archbishop of Kaduna condoles with the immediate family, the NFCS Family of Kaduna Polytechnic, and indeed the entire Kaduna Polytechnic Community and assures them of his fraternal closeness and prayers.”He said, details of Bogoro’s funeral arrangement will be announced as soon as possible."
  },
  {
    "headline": "Medical Doctor, 5 Others Die In Ogun Auto Crash",
    "summarized_story": "A medical doctor identified as Joko Oriyomi Shedrack and five other persons were confirmed dead in an auto crash which occurred Saturday afternoon along the Abeokuta-Sagamu expressway in Ogun State.\nThe fatal crash involved a Yellow-coloured Howo truck marked, T-14214LA, suspected to belong to a construction company in the state and a Silver-coloured Mazda passenger bus with registration number KRD 975 HJ.\n“Unfortunately, the driver of the Howo truck who caused the crash ran away.\nHowever, the accident vehicles have been deposited at the Obafemi Owode Divisional Police Station,” he added.\nAkinbiyi further explained that the injured victims were rescued to the State Hospital in Ijaiye, Abeokuta as well as the Federal Medical Center (FMC) Abeokuta, while corpses of the deceased were also deposited at the same hospitals."
  },
  {
    "headline": "Medical Doctor, 5 Others Die In Ogun Auto Crash",
    "summarized_story": "A medical doctor identified as Joko Oriyomi Shedrack and five other persons were confirmed dead in an auto crash which occurred Saturday afternoon along the Abeokuta-Sagamu expressway in Ogun State.\nThe fatal crash involved a Yellow-coloured Howo truck marked, T-14214LA, suspected to belong to a construction company in the state and a Silver-coloured Mazda passenger bus with registration number KRD 975 HJ.\n“Unfortunately, the driver of the Howo truck who caused the crash ran away.\nHowever, the accident vehicles have been deposited at the Obafemi Owode Divisional Police Station,” he added.\nAkinbiyi further explained that the injured victims were rescued to the State Hospital in Ijaiye, Abeokuta as well as the Federal Medical Center (FMC) Abeokuta, while corpses of the deceased were also deposited at the same hospitals."
  },
  {
    "headline": "2023: Tinubu, Obi, Others Can’t Replace Running Mates Under New Electoral Act – Group",
    "summarized_story": "Ahead of the 2023 general elections, the Center for Reforms and Public Advocacy (CRPA), has said that under the new Electoral Act 2022, running mates nominated by presidential and governorship candidates of various political parties are not subject to withdrawal or substitution.\nBoth presidential candidates of the ruling All Progressives Congress (APC), Bola Ahmed Tinubu, and Labour Party (LP), Peter Obi, submitted placeholders with the hope to substitute their running mates later.\n“The current and subsisting electoral law does not capture a scenario that makes possible a substitution of associate candidates or running mates either by account of voluntary withdrawal or death.\nSubsequently, any substitution of running mates nominated by presidential and gubernatorial candidates comes flat in the face of the law.\n“We also wish to impress upon political parties that they must familiarize themselves with the relevant aspects of the new electoral law and avoid actions that are capable of causing infractions.”"
  },
  {
    "headline": "Video Of Bode George Saying Tinubu Doesn’t Have Certificate Resurfaces",
    "summarized_story": "George, a staunch critic of Tinubu, has remained consistent in his claim that Tinubu did not attend Primary and secondary schools.\nImmediately after the information went viral, the video of an ARISE TV interview with George began to trend.\nGeorge alleged that during the 1999 election, Tinubu allegedly said he attended some schools in Ibadan, Oyo state.\nIn the video, George said, “I can bet with any amount of money, let Bola bring out the certificates of his primary school, secondary school and the University he attended.\n“He said he went to Government College, Ibadan and Children’s Home School in Ibadan, we went there we checked, what year?"
  },
  {
    "headline": "Obasanjo: Picking Atiku As My Vice Was A Mistake",
    "summarized_story": "Former President Olusegun Obasanjo on Saturday said one of his mistakes in life was picking former Vice President Atiku Abubakar as his running mate during the 1999 Presidential election.\nObasanjo, who described Atiku’s choice as his Vice President as one of his “genuine mistakes”, said despite making the mistake, God saved him in the end.\nObasanjo and his former number two man, Atiku had a running battle during the build up to the 2003 elections.\nBut because it was a genuine mistake God saved me.\n“I will say there are many things that could have been a mistake but God saved me from them all.”"
  },
  {
    "headline": "JUST IN: UK’s Lincoln University Suspends Ekweremadu As Its Visiting Professor",
    "summarized_story": "Lincoln University, United Kingdom has banned Ike Ekweremadu from his duties as a visiting professor pending the conclusion of the organ harvesting allegation leveled against him.\nEkweremadu and his wife are accused of facilitating David’s entry into the UK to transplant his kidney into their daughter who is suffering from kidney failure.\nThe former Deputy Senate President of Nigeria was recently appointed a visiting professor of Corporate and International Linkages by the British school.\n“Visiting professors are often, as is in this case, non-resident at the university, unpaid and advisory,” a Lincoln University spokesperson said.\nFresh twistDavid’s (the young man who was to donate a kidney to Sonia , daughter of Senator Ekweremadu) passport has emerged, indicating that he is 21 years old."
  },
  {
    "headline": "INEC gives reasons why it excluded Lawan, Akpabio, Umahi’s names from its senatorial list",
    "summarized_story": "The Independent National Electoral Commission (INEC) has explained why some names submitted by the All Progressives Progress (APC) as senatorial candidates are missing from the list published by the commission on Friday.\nHowever, in the list published by the commission on Friday, Lawan, Umahi and Akpabio were said to have been excluded.\nThe development comes amid controversy over the APC Yobe north senatorial ticket, as well as issues over senatorial primaries featuring Akpabio and Umahi.\nAlthough APC had fixed its senatorial primaries for May, Umahi, Lawan and Akpabio were said to have participated in primaries organised by the APC after the trio contested the APC presidential ticket and lost earlier in June.\nHe also said the list published on Friday is not the final document for the 2023 polls, adding that the final list will be published at a later date."
  },
  {
    "headline": "I will remain British Prime Minister till 2030, Boris Johnson boasts",
    "summarized_story": "Boris Johnson brushed off threats to topple him last night with an astonishing prediction he will lead Britain into the 2030s.\nHis boast was met with disbelief by senior Tories — who at first thought he was joking.\nThe PM bullishly stunned MPs plotting his downfall by insisting he is already thinking well beyond the next election — and planning for his third term.\nHe spoke as Tory grandees backed a fresh drive by rebel MPs to force a leadership challenge within weeks.\nLeadership wannabes believe the turning point was the resignation of party chairman Oliver Dowden, who quit in the early hours of Friday morning as the results came through."
  },
  {
    "headline": "Npower: FG gives update on physical verification for batch C2 beneficiaries",
    "summarized_story": "The management of Npower has extended the Batch C stream 2 physical verification closing date by three days.\nIn addition to this extension, applicants should note the following:1) Pre-selected applicants are advised to key into this Verification Extension.\n2) N-TECH program doesn’t require physical verification, kindly be patient as you will be assigned to a training center soon.\n3) Shortlisted does not mean that you are selected for the physical verification, you have to be selected as a beneficiary in order to qualify for Npower physical verification.\nBeneficiaries who their status shows preselected, should take the advantage of the physical verification extension to do their physical verification."
  },
  {
    "headline": "Breaking: Terrorists murder another Catholic priest",
    "summarized_story": "Another Catholic priest, Rev Fr.\nVitus Borogo, has killed by suspected terrorists in Kaduna State.\nVitus Borogo, which sad event took place today, at Prison Farm, Kujama, along Kaduna-Kachia Road, after a raid on the farm by terrorists.\nUntil his death, Fr Vitus (aged 50) was the Chaplain of the Catholic Community of the Kaduna State Polytechnic, and the Chairman of the Nigerian Catholic Diocesan Priests Association (NCDPA), Kaduna Chapter.\nMatthew Man-Oso Ndagoso, the Catholic Archbishop of Kaduna condoles with the immediate family, the NFCS Family of Kaduna Polytechnic, and indeed the entire Kaduna Polytechnic Community; and assures them of his fraternal closeness and prayers."
  },
  {
    "headline": "ACCI Member, Esther Eghobamien-Mshelia Elected into UN Committee on CEDAW",
    "summarized_story": "The Federal Ministry of Women Affairs and Social Development (FWASD) has announced the election of Abuja Chamber of Commerce and Industry (ACCI) member, Mrs Esther Eghobamien-Mshelia as Nigeria’s representative on the Convention On the Elimination of All Forms Discrimination Against Women (CEDAW) Committee.\nMrs Eghobamien-Mshelia, who is the founder, Women Arise Development Initiative (WADHI) was one of the 12 members elected by states parties of the committee on the elimination of discrimination against women to replace those whose terms of office are due to expire on 31 December 2022.\nThe terms of the new elected members would commence 1st January 2023 and run through a period of four years, later on 31 December 2026.\nWhile congratulating her election into the CEDAW committee, Mrs Tallen stated that she has no doubt that Mrs Eghobamien-Mshelia will do us proud in the journey ahead adding that we must therefore rise above our differences to ensure that we succeed in flying the Nigeria colours high.\nThe Minister lauded the role of the Managing Director, Bank of Industry, Mr. Olukayode Pitan and the Director-General ACCI, Dr Victoria Akai for the great role they played in the realization of the mandate."
  },
  {
    "headline": "ACCI President Presents Opportunities for Investors in Untapped Natural Gas",
    "summarized_story": "The President of Abuja Chamber of Commerce and Industry (ACCI), Dr Al-Mujtaba Abubakar has said there are opportunities for investors to harness in Nigeria natural gas as we have large untapped reserves.\nHe gave detailed presentation on the Nigeria gas industry, from proven reserve to our daily gas consumption in Nigeria and also the governments agenda for gas by declaring 2020-2030 the decade of gas where he captured the CBN gas intervention fund.\nThe identified companies are; First Services, Target Energy Solutions, ASF Consulting, Innova soft Integration are interested in partnerships in Nigeria.\nThe President ACCI assured them that the Chamber will facilitate their meeting with NNPC and advised them to write through their embassy in Nigeria.\nQuite a number of companies expressed their willingness to participate in the 2023 Petroafrica Conference to be held in Nigeria."
  },
  {
    "headline": "Access Bank to reward customers in South-South, South-East",
    "summarized_story": "Kehinde Ibrahim, LagosACCESS Bank Plc has said it would be rewarding its customers in the South-South and South-East regions with millions of naira and other attractive consolation prizes in its DiamondXtra regional draw.\nSpeaking to newsmen at the bank’s head office in Lagos recently, Group Head, Consumer Banking, Access Bank Plc, Adaeze Ume, explained that the motivation behind the regional draws in the new season of the reward scheme is the need to transform the lives of more Nigerians across the country.\nIn her words, “To deliver on our promise to continually reward our customers for their loyalty and continued savings with our bank, we have decided to take the DiamondXtra reward scheme draws even closer to them.\nWe intend to reward 38 lucky customers in the South-South, South- East region with juicy cash and consolation prizes in the LIVE draw taking place on the 29th of June 2022 in Owerri, Imo State.\n“We continue to evolve and reflect on the various offers within the DiamondXtra reward programme, and engage our customers on what they would prefer to have as a reward."
  },
  {
    "headline": "CFI, others win prizes at NCRIB maiden tennis competition",
    "summarized_story": "Kehinde Ibrahim, LagosTHE Commissioner for Insurance and Chief Executive Officer of the National Insurance Commission (NAICOM) Mr. Olorundare Sunday Thomas has been declared overall winner of the Nigerian Council of Registered Insurance Brokers (NCRIB) maiden tennis competition in Veteran categoryThe Competition held at the weekend at Lagos Lawn Tennis Club, Lagos.\nThe two days competition which was well attended by members of the Lagos Lawn Tennis Club, students of both Secondary and tertiary institutions and insurance industry became a platform for stakeholders to drum the beats of insurance importance to sport lovers.\nOur intention is to indirectly enforce, not only the government’s highlighted insurance policies, but all insurance products without compulsion.\nYou will recall that few days ago, we embarked on Insurance Awareness Walk from Moleye to Adekunle end of Lagos Third Mainland Bridge, where we shared flyers that narrate what insurance stands for.\nBefore the end of the year, we have plan to take the awareness walk campaign to market places, government circles."
  },
  {
    "headline": "PenCom kicks off online verification for MDAs’ retirees",
    "summarized_story": "Kehinde Ibrahim, LagosTHE National Pension Commission (PenCom) has started its online verification and enrolment for prospective retirees and retirees of Federal Government Treasury Funded Ministries, Departments and Agencies (MDAs), the Director-General, Mrs. Aisha Dahir-Umar has said.\nAnnouncing this, Mrs. Dahir-Umar, called on prospective retirees to ensure that they undergo the compulsory Data Recapture Exercise (DRE).\nShe stated that the exercise was aimed at validating the accrued pension liabilities of government for the retirees.\nShe said: “The accrued right is a component of the Retirement Savings Account (RSA) of the employee to be accessed upon retirement.\nHowever, following the experience of the COVID-19 pandemic in 2020, which restricted the movement of persons, PenCom designed and developed an online Enrolment Application with the capabilities to register, verify and enrol the prospective retirees."
  },
  {
    "headline": "Insecurity: Akeredolu Orders All Public, Private Institutions To Install CCTV",
    "summarized_story": "Ondo State Governor, Rotimi Akeredolu, has ordered all public and private institutions in the state to install Close Circuit Television (CCTV) devices.\nA statement signed by the Governor’s spokesperson, Richard Olatunde, on Saturday said Akeredolu has signed an Executive Order to that effect.\n“This becomes imperative in the light of the increased spate of insecurity in the country and the need to ensure security of lives and properties in all public and private institutions and centres throughout the state,” the statement said.\nREAD ALSO: Amotekun Corps Arrest Persons In Connection With Owo Church Attack“The executive order shall be enforced at all religious places of worship, financial institutions (of all kinds), event centres, supermarkets, educational institutions (Schools), Hotels/Motels, Guest House, inns, Restaurants, Clinics and Health Centres, eateries (of all kinds), recreation or vehicular parks and other places regularly used by the public.”Gunmen recently attacked a catholic church in Owo, Ondo state, killing scores of people and injuring many others."
  },
  {
    "headline": "Picking A Vice President In 1999 Was A Mistake – Obasanjo",
    "summarized_story": "﻿Former president Olusegun Obasanjo on Saturday said picking a running mate in the 1999 presidential election was a mistake.\nObasanjo, who won the 1999 and 2003 presidential elections, ran alongside Atiku Abubakar.\n“For instance, one of the mistakes I made was picking a number two when I was going to become President.\n“But because it is a genuine mistake, God saved me out of it.”Mr Obasanjo, a retired general, also said many people thought joining the army was a mistake.\n“So many things I could have seen as mistakes, but God saved me from them all.”"
  },
  {
    "headline": "Fuel Queues: APC Lacks ‘Political Will’ To Solve Subsidy Issues – PDP",
    "summarized_story": "The Peoples Democratic Party on Saturday said President Muhammadu Buhari and the All Progressives Congress lack the political will to solve the “perennial” issues of fuel subsidy.\nExperts have long called for petrol subsidy removal, saying it diverts much needed resources that could have been invested in infrastructure, education, health and other development sectors.\nMany Nigerians believe fuel subsidy is one of the few benefits that gets directly to citizens but the scheme has also been rocked by fraudulent activities.\nOn Tuesday, in a written note, to Bloomberg, President Buhari defended his administration’s decision to continue to subsidise petrol.\nCapacity is due to step up markedly later this year and next, as private players and modular refineries (Dangote Refinery, BUA Group Refinery, Waltersmith Refinery) come on board."
  },
  {
    "headline": "Alleged Organ Trafficking: University Of Lincoln Bars Ekweremadu",
    "summarized_story": "The University of Lincoln has barred former Deputy Senate President Ike Ekweremadu from undertaking any further duties as visiting professor after he was accused of trafficking a 15-year-old boy to the United Kingdom for organ harvesting.\nMr Ekweremadu and his wife, Beatrice, are currently detained in the UK over the charges ahead of a court date on July 7.\nREAD ALSO: Senators Are ‘Standing With Ekweremadu’ – Smart AdeyemiHe had been a visiting professor of corporate and international linkages at the University of Lincoln.\n“Visiting professors are often, as is in this case, non-resident at the university, unpaid and advisory,” the spokesperson said.\n“Whilst this matter is subject to investigation, this person will not be undertaking any duties as visiting professor at Lincoln.”"
  },
  {
    "headline": "Bandits Kill Catholic Priest In Kaduna",
    "summarized_story": "A Catholic priest of the Archdiocese of Kaduna, Reverend Father Vitus Borough, has been killed by bandits in Chikun Local Government Area of the state.\nThe victim until his murder was the Chaplain of the Catholic Community of the Kaduna State Polytechnic, and the Chairman of the Nigerian Catholic Diocesan Priests Association (NCDPA), Kaduna State Chapter.\nREAD ALSO: Insecurity: Akeredolu Orders All Public, Private Institutions To Install CCTVIn reaction to the incident, the Catholic Archbishop of Kaduna Archdiocese, Most Reverend Matthew Ndagoso, condoled with the immediate family, the NFCS Family of Kaduna Polytechnic, and the entire Kaduna Polytechnic Community.\nReverend Father Borough is the second Catholic priest that has died at the hands of bandits in Chikun LGA of Kaduna in the past two months.\nIn May, another priest, Father Joseph Bako, had died in the custody of bandits who abducted him on March 8, from his pastoral residence of Saint John’s Catholic Church, Kudenda also in Chikun LGA."
  },
  {
    "headline": "I was a son of nobody, my parents never went to school",
    "summarized_story": "Former President of Nigeria, Olusegun Obasanjo has described himself as a son of nobody who struggled to become someone in life.\nHe said, “One of the mistakes I made was picking my number two when I wanted to become the President.\nBut because it was a genuine mistake, God saved me.\n“The second one was when Abacha wanted to arrest me.\nWhen he wanted to arrest me, I was told by the American ambassador that they would arrest me and that America had asked that I should be given an asylum."
  },
  {
    "headline": "I made mistake in picking my running mate in 1999",
    "summarized_story": "He made this known in Abeokuta, during a mentoring session on leadership and entrepreneurship for selected school students.\nThe former president while addressing the students attributed his success story in life to God, his parent, community, education and the determination to excel.\nHe shared his views about political situation in the country and some of his mistakes in life, especially on his choice of Deputy in 1999.\nSpeaking on African continental free trade agreement, the former president called for improved infrastructure, especially a thriving coastal shipping.\nHe also suggested the removal of all encumbrances standing in the way of effective and free movement of goods and services across the continent."
  },
  {
    "headline": "APC Nat'l Women Leader Empowers 500 Zamfara Women, Petty Traders -",
    "summarized_story": "Five Women farmers and petty traders in Zamfara have Benifited from an empowerment program organised by the office of the APC National Women Leader in Collaboration with the Zamfara State GovernmentThe program is aimed at encouraging farming activities and also to eradicate Poverty especially among womenOne hundred of the Benificiaries recieved one hundred thousand naira each while the other four hundred recieved twenty thousand naira eachThe event which held in Maradun Local Government area witnessed a large turn out of women, youth, traditional rulers, Politicians and party faithfulsAddressing the Gathering, the APC National Women leader Dr. Betta Edu say the decision to embark on the empowerment programme is to support the women in their quest to fend for themselves in view of their vulnerability and their positive contributions to democracy and national growth.\nShe adds that the gesture is part of the human nature of the APC at the national level, noting that the party is geared towards transforming the lives of the citizens in different ways.\n“The empowerment programme is aimed at cushioning economic and medical challenges of the beneficiaries mainly due to the prevailing security and economic hardship in the country” Dr. Betta Said“With such kind of support, women would no longer accept unpatriotic elements among politicians who negotiate their votes during elections for money” She addedAccording to the APC National women leader, the Headquarters of the party is fully aware of Governor Bello Matawalle’s twenty thousand naira monthly cash support to women among other smiles driven policies and programmes through the office of the State first ladyDr. Betta noted that what her personal experience in the Zamfara has countered the negative impressions she had earlier about the stateShe Commended Governor Bello Matawalle for executing a number of developmental projects, while calling on him to do more especially in the area of developing women” APC is all out to give women a sense of belonging in the administration of the country and Nigerian women are so thankful to President Muhammad Buhari’s leadership style for initiating programmes capable of impacting on the lives of women” Dr. Betta Maintained.\n“I Personally want to thank Governor Bello Matawalle for giving proportionate number of slots to women in his cabinet and other civil Service appointments” She Commend the Zamfara Gov.\nHighlights of the event includes Disbursement of cash to the five hundred Benificiaries among other important eventsPresent at the Program Includes Zamfara State First Lady A’isha Bello Matawalle, Secretary to Zamfara State Government, Representative of Emir of Maradun, Commissioner for Information among other top Government functionaries."
  },
  {
    "headline": "Wase eulogises Gbajabiamila at 60, says he's a patriot",
    "summarized_story": "Deputy Speaker of the House of Representatives, Ahmed Idris Wase has congratulated Speaker Femi Gbajabiamila as he marks his 60th birthday.In a congratulatory message signed by his Chief Press Secretary, Umar Muhammad Puma, Wase described Gbajabiamila as a patriot and a legislator per excellence.\n“Through the Joint Task mantra, Speaker Femi Gbajabiamila has been able to unite members of the House by giving everyone a sense of belonging.\nThe Deputy Speaker noted that Gbajabiamila has shown great commitment to the independence of the legislature saying “his love for Nigeria and commitment to the growth and sustenance of our democracy through effective legislation is never in doubt”.\n“Working with Speaker Femi Gbajabiamila has been an exciting and insightful experience that has enriched my political career.\n“As you celebrate an additional year today, I pray that the Almighty Allah will bless you with many more decades of good health to continue to serve your fatherland to the best of your ability”."
  },
  {
    "headline": "Despite No Historic Ties to Britain, Gabon and Togo join Commonwealth",
    "summarized_story": "Gabon and Togo joined the Commonwealth on Saturday, becoming the latest nations with no historic ties to Britain to enter the English-speaking club headed by Queen Elizabeth II.\nFrancophone states have also sought Commonwealth membership in recent years to pivot away from France, analysts said.\nOil-rich Gabon, a former French colony on the Atlantic Ocean, has been ruled by the Bongo family for 55 years.\nTogo, a former German then French colony, has also been under dynastic rule for more than half a century.\nMozambique — a former Portuguese colony — became the first Commonwealth member without historic links to Britain when it joined in 1995."
  },
  {
    "headline": "Despite No Historic Ties to Britain, Gabon and Togo join Commonwealth",
    "summarized_story": "Gabon and Togo joined the Commonwealth on Saturday, becoming the latest nations with no historic ties to Britain to enter the English-speaking club headed by Queen Elizabeth II.\nFrancophone states have also sought Commonwealth membership in recent years to pivot away from France, analysts said.\nOil-rich Gabon, a former French colony on the Atlantic Ocean, has been ruled by the Bongo family for 55 years.\nTogo, a former German then French colony, has also been under dynastic rule for more than half a century.\nMozambique — a former Portuguese colony — became the first Commonwealth member without historic links to Britain when it joined in 1995."
  },
  {
    "headline": "Nottingham Forest Sign Nigerian Forward Taiwo Awoniyi for Club Record £17.2m",
    "summarized_story": "Newly-promoted Premier League club Nottingham Forest have confirmed the signing of Nigerian international forward Taiwo Awoniyi for a club record fee of £17.2 million.\nThe 24-year-old joins The Reds from Bundesliga club Union Berlin, signing a five-year-deal at The City Ground.\n“I’m very excited to be here at Nottingham Forest,” said Awoniyi following his move to The City Ground.\nHe subsequently joined Union Berlin on loan during the 2020-21 season and made the move permanent last July.\nHe’s a player who we really believe in and we look forward to him going on to fulfil his potential and become a top Premier League striker with Nottingham Forest.”"
  },
  {
    "headline": "Nigeria: President Can’t Ask Court to Remove a Law He Signed, Supreme Court Says",
    "summarized_story": "The apex court, in a unanimous decision described the suit as an abuse of court process and subsequently struck it out.\nAccording to Justice Musa Mohammed-Dittjo, who led a seven-man panel of the Supreme Court, the plaintiffs having earlier assented to the said section 84(12) of the Electoral Act 2022, cannot turn around to approach the court to strike it down.\nTherefore, this suit cannot be entertained by this court in the exercise of its additional jurisdiction under Section 1(1)(a) of the Supreme Court (Additional Jurisdiction) Act 2002.\n“In conclusion, the Supreme Court has laid their own brick in the efforts towards electoral reform by this judgement.\nThey have added their own bricks to Nation building through the electoral reform and electoral act 2022."
  },
  {
    "headline": "Lawan, Umahi, Akpabio Lose Out as INEC Omits Their Names from List of Candidates for 2023 Elections",
    "summarized_story": "Also Friday, INEC explained why some of the names submitted by the political parties were missing from the list published by the commission.\nLawan, Akpabio and Umahi, had been listed by the All Progressives Congress as candidates for Yobe North, Akwa Ibom North-west, and Ebonyi South senatorial districts, respectively.\nUmahi also had a primary election that produced his brother cancelled for a fresh one, but it was not recognized by INEC.\nMeanwhile, INEC on Friday released the formal report on APC Yobe North Senatorial primary, confirming that Lawan did not participate in the primary held May 28 in Gashua.\nThe report read, “The Senatorial Primary for zone ‘C’ comprising Bade, Yusufari, Jakusko, Nguru, Karasuwa and Machina local government areas respectively."
  }
]