[
  {
    "headline": "Preterm babies may have behavioural, learning problems -Study",
    "summarized_story": "Angela OnwuzooA new study has indicated that preterm babies born before 37 weeks of pregnancy are at risk of developmental challenges that can affect their behaviour and ability to learn.\nThe researchers stated that though survival of preterm babies has increased worldwide, children born early often have developmental issues.\nAccording to the World Health Organisation, preterm is defined as babies born alive before 37 weeks of pregnancy are completed.\nDr. Airhumwunde noted that gestational age and delivery were the two major factors that determine the survival of preterm babies.\nThe gynaecologist pointed out that babies born below 34 weeks have a poor survival rate, while babies delivered above 34 weeks have up to 80 percent survival rate."
  },
  {
    "headline": "Preterm babies may have behavioural, learning problems -Study",
    "summarized_story": "Angela OnwuzooA new study has indicated that preterm babies born before 37 weeks of pregnancy are at risk of developmental challenges that can affect their behaviour and ability to learn.\nThe researchers stated that though survival of preterm babies has increased worldwide, children born early often have developmental issues.\nAccording to the World Health Organisation, preterm is defined as babies born alive before 37 weeks of pregnancy are completed.\nDr. Airhumwunde noted that gestational age and delivery were the two major factors that determine the survival of preterm babies.\nThe gynaecologist pointed out that babies born below 34 weeks have a poor survival rate, while babies delivered above 34 weeks have up to 80 percent survival rate."
  },
  {
    "headline": "Shortage of nurses affecting healthcare delivery in Nigeria –Association",
    "summarized_story": "The Association of Nigeria Nurses and Midwives, Federal Neuro-Psychiatric Hospital Yaba Lagos, has expressed concern over ‘brain drain’ and shortage of nurses in the health system.\nAccording to her, a large number of the nursing professionals in the country are either planning to leave or have already left.\nThe expert attributed the challenge of brain drain to poor remuneration, poor welfare package, and obsolete equipment, among others.\n“We have a shortage of manpower in the nursing profession; which means the country needs to buff up training and recruitment of practitioners in the field.\nEzeh identified activities of the quacks as a major challenge that have derailed the reputation and integrity of the nursing profession in Nigeria."
  },
  {
    "headline": "Shortage of nurses affecting healthcare delivery in Nigeria –Association",
    "summarized_story": "The Association of Nigeria Nurses and Midwives, Federal Neuro-Psychiatric Hospital Yaba Lagos, has expressed concern over ‘brain drain’ and shortage of nurses in the health system.\nAccording to her, a large number of the nursing professionals in the country are either planning to leave or have already left.\nThe expert attributed the challenge of brain drain to poor remuneration, poor welfare package, and obsolete equipment, among others.\n“We have a shortage of manpower in the nursing profession; which means the country needs to buff up training and recruitment of practitioners in the field.\nEzeh identified activities of the quacks as a major challenge that have derailed the reputation and integrity of the nursing profession in Nigeria."
  },
  {
    "headline": "Enough with ethnoreligious, political divides — Gov Bello tells Nigerians",
    "summarized_story": "Yahaya Bello of Kogi has called on Nigerians to halt all forms of ethnic, religious and political divides threatening the peace, unity and development of the country.\nHe said that Nigeria could only be fixed if everybody, irrespective of ethnic origin, religious and political views, came together.\nBello added that the Kogi strategy, if emulated across board, would bring the desired change and solution to the challenges confronting the country.\n“I want to assure you that by our coming together, by our unity we will get Nigeria fixed and when we get Nigeria fixed we would have gotten Africa fixed,” he said.\n“Your track record in Kogi State as a Youth friendly governor, how you brought the down-trodden to government, the man that changed the narratives of governance in Kogi State remains appreciated."
  },
  {
    "headline": "Nigerians in Diaspora endorse Yahaya Bello for 2023 Presidency",
    "summarized_story": "Nigerians in Diaspora, under the aegis of Nigerians in Diaspora Network and Nigerians in Diaspora Organisation, have endorsed Gov.\nYahaya Bello of Kogi as their candidate for the 2023 Presidency.\n“Notwithstanding the total collapse of the security architecture in Nigeria, Kogi state under the leadership of his Excellency Governor Yahaya Bello has recorded a very stable security atmosphere across the state.\nSpeaking earlier, Chairman of the group, Mr Victor Ojeabulu said that there are about 10 million Nigerians in Diaspora calling on all Nigerians to support a youthful candidate.\nMrs Maria Agbondinwin said that from all they have seen, heard and gathered about Bello, Nigerians in Diaspora are sure that he is the right person to make Nigeria great again."
  },
  {
    "headline": "Police confirm killing of 10-year-old girl by suspected hoodlums in Osun",
    "summarized_story": "The Police Command in Osun on Wednesday confirmed the killing of a 10-year-old girl by suspected hoodlums on a motorcycle at Ilerin, along Ilesa-Iperindo Road.\nThe comnand’s Spokesperson, SP Yemisi Opalola, said in a statement that the suspected hoodlums shot at the girl, her mother and another child while on a motorcycle.\nOpalola said that police had intensified efforts to arrest the suspected criminals, who perpetrated the crime.\nThe News Agency of Nigeria (NAN) reports that similarly, there was shooting at Irojo area of Ilesa on Wednesday.\nNAN also reports that in the space of five days (Saturday to Wednesday), suspected cultists/hoodlums related shootings were recorded in Osun, with two deaths each recorded in Osogbo and Ilesa."
  },
  {
    "headline": "Nollywood actress, Uche Ogbodo, welcomes 2nd child",
    "summarized_story": "Nollywood actress, producer and model, Uche Ogbodo has welcome her second child.\nThe thespian took to her Instagram page @Uche Ogbodo on Wednesday to celebrate her new bundle of joy while thankingeveryone for the love showered on her and the new born.\nShe wrote, “My bunny is finally here and I am so excited; mother and child perfectly fine.\nThe star actress is one of the most versatile actress in Nigeria who fits into any role and acts mostly in romantic, action, comedy and tragic movies.\nUche got married to Mr Apo Arthur on October 2013, her long time friend and the union is blessed with a daughter and this second child."
  },
  {
    "headline": "Amaechi wants hotels at stations along Lagos-Ibadan rail line",
    "summarized_story": "The Minister of Transportation, Mr Rotimi Amaechi, has canvassed the need for the construction of hotels for passengers convenience at stations along the new Lagos-Ibadan railway corridors.\nAmaechi made call during an inspection of the new Lagos-Ibadan standard gauge railway project on Wednesday.\nDapo Abiodun of Ogun urged the State and Federal Government to create Special Committee to look into security issues along the standard gauge railway line.\nAccording to the governor, Ogun State has five stations out of 10 stations along Lagos Ibadan standard gauge railway.\nHe urged Ogun residents to patronise the rail and freight services which would soon commence full operation after its inauguration."
  },
  {
    "headline": "Nigerian forces go after bandits in Falgore forest, Kano hotspots",
    "summarized_story": "Nigerian forces have commenced a major operation against bandits and other criminal elements in Kano.\nThe 1 Division in conjunction with the Nigeria Police, Nigeria Security and Civil Defence Corps, local vigilantes and hunters are carrying out the clearance of Falgore forest and other hotspots.\nThe raid is complementing the efforts of the troops at Forward Operating Base Falgore, Army spokesman Mohammed Yerima said in a statement.\nBandits gathering in Kano forest, may attack us soon – GandujeThe joint operation seeks to stop outlaws from infiltrating other parts of Kano.\nThe statement urged them to report suspicious movements of strange individuals or groups in their areas."
  },
  {
    "headline": "It’ll be idiotic to break Nigeria – Obasanjo tackles IPOB, Yoruba nation agitators",
    "summarized_story": "The former Nigerian leader conceded that the situation remains unpalatable in Nigeria; he, however, said disintegration of the country is never the solution.\nObasanjo opined that Nigerians should blame themselves for the worst of the country instead of blaming God.\nThe Balogun Owu said everybody in Nigeria is apprehensive over the state of the nation, saying anyone who is not apprehensive is a human being without being human.\nObasanjo posited that citizens of Biafra and Yoruba nations will be diminished compared being citizens of Nigeria, stressing that “our strength is in our diversity,”“In this age and time that we are talking about the reintegration of Africa for economic development, disintegration of any country will be almost idiotic,” he added.\nIgbo presidency: El-Rufai’s assertion Idiotic, laughable – Ohanaeze"
  },
  {
    "headline": "Insecurity: Take action, stop accepting failure over kidnapping, killings in Oyo",
    "summarized_story": "A former Chief Whip in the Oyo State House of Assembly, Hon.\nAbiodun Adigun-Hammed, has advised Governor Seyi Makinde to take necessary action in order to address security challenges facing the state.\nAdigun-Hammed urged Makinde to stop accepting failure over the current security challenges in the state.\nHe urged Makinde to take action in combating insecurity facing the state.\nThe former lawmaker said the issue of insecurity is not limited to Igangan in Ibarapaland but Oyo State in general."
  },
  {
    "headline": "JUSUN: Judiciary workers end two-month strike",
    "summarized_story": "The Judiciary Staff Union of Nigeria (JUSUN), suspended its two-month-old strike on Wednesday.\nJUSUN is demanding the financial independence of the judiciary at the federal and state levels.\nIn May 2020, President Muhammadu Buhari signed an Executive Order that granted financial autonomy to the judiciary.\nBut many state governments for shunned the order, forcing JUSUN to take the decision to shut courts nationwide.\nJUSUN strike paralyses court activities in Osun"
  },
  {
    "headline": "Gov Uzodinma visits slain Ahmed Gulak’s family",
    "summarized_story": "Imo State Governor, Hope Uzodinma, has elougized the slain ex-Presidential Aide to former President Goodluck Jonathan, Ahmed Gulak for being on the side of truth and unity at all times.\nGovernor Uzodinma spoke on Wednesday, when he paid a condolence visit to the family of the late Ahmed Gulak, which was contained in a statement made available to DAILY POST on Wednesday,.\nAhmed Gulak, according to report, was shot dead on Sunday on his way to Sam Mbakwe International Cargo Airport enroute Abuja after a visit to Imo State.\nBefore now, Governor Hope Uzodinma, has described the killing of Alhaji Ahmed Gulak, the ex-Political Adviser to the former President, Goodluck Jonathan, as politically-masterminded.\nAccording to the Governor, “Ahmed Gulak was in Imo State for a national assignment."
  },
  {
    "headline": "Amotekun, still a beast of illusion",
    "summarized_story": "In the wake of the recent killings, pundits accuse Oyo governor, Seyi Makinde, his SGF peers and the state security agencies for failing to preempt the attack.\nADVERTISEMENTThe southwest needed an Amotekun because the governors had over time, failed to commit state resources to actualise development plans and policy objectives.\nWhile we applaud Amotekun as a worthy response to the southwest’s insecurity problem, the governors must facilitate seamless cooperation between Amotekun and state security outfits.\nThe southwest governors must work against the notion that they haven’t been able to resolve the region’s security and development challenges because they are rich.\nWhile hope may yet flourish in its presence, this minute, Amotekun subsists as a frantic mental caress that induces weeping instead of applause."
  },
  {
    "headline": "HiFL Round of 16 contenders unveiled",
    "summarized_story": "Organisers of the Higher Institutions Football League (HiFL), Pace Sports and Entertainment Marketing Limited, has released the draws for the round of 16 games at an event held in Lagos.\nThe games are scheduled to hold between June and September 2021.\nSpeaking at the draws, Director, PACE Sports and Entertainment Marketing Limited, Sola Fijabi acknowledged the efforts of all participating schools and encouraged them to maintain their sportsmanship.\nThe schools are ready and what we assured lovers of collegiate sports is double excitement.\nWe appreciate the support of NUGA and our sponsors Nivea Men and Minimie for their trust in HiFL and as we deliver value to all our stakeholders” Fijabi said."
  },
  {
    "headline": "FRENCH OPEN: Nadal sinks Schwartzman to reach semi-finals",
    "summarized_story": "Rafael Nadal continued his bid for a record-extending 14th French Open title with a thrilling four-set victory over Diego Schwartzman in the quarter-finals.\nIn a repeat of last year’s semi-final, Schwartzman performed magnificently to end Nadal’s run of 36 consecutive sets at Roland Garros, but the irrepressible Spaniard rose to the challenge to book his place in Friday’s semi-finals.\nHaving advanced to the quarter-finals without dropping a set, Schwartzman was threatening a monumental upset against ‘The King of Clay’, who had lost just two of his previous 106 appearances on the red dirt.\nNadal was handed a time violation ahead of the opening set, but the indomitable Spaniard was undeterred as he defied some terrific tennis from Schwartzman to draw first blood in 45 minutes.\nSchwartzman saved two break points in a high-quality fourth game, but a sequence of three consecutive breaks gave Nadal the upper hand and the defending champion duly closed out the opener with a commanding hold."
  },
  {
    "headline": "INTERNATIONAL FRIENDLY: Rohr under fire over unimpressive Super Eagles",
    "summarized_story": "Former international Tarila Okorowanta has lashed out at the performance of the Nigeria national team against Cameroon following their two international friendlies in Austria.\nThe Super Eagles failed to win either of the matches in the doubleheader against the Indomitable Lions, losing the first outing 1-0 before playing out a 0-0 draw in the second.\nOkorowanta believes the Super Eagles should have won the games and Rohr should have relied on his experienced players against the Indomitable Lions.\n“Result is what Nigerians want, whether the Super Eagles play well or not is not the most important thing but the maximum result which is victory.\nOkorowanta reiterated that the Super Eagles must rely on their established players for the games and avoid bringing in too many new players."
  },
  {
    "headline": "Toyin Abraham praises husband after avoiding a kiss on set",
    "summarized_story": "By Gbenga BadaNollywood actress and film producer, Toyin Abraham, has heaped praises on her husband, Kolawole Ajeyemi, for avoiding a kiss from her on a film set.\nREAD ALSO: Toyin Abraham weighs in on bad friendsShe said though she felt shunned by her husband for refusing her kiss, she appreciates his dedication to work.\nI was only trying to be romantic but ọkọ mi gbé mi ní handicap ni sha!\nBut kò sí problem!\n@kolawoleajeyemi ọkọ mi, thanks for being so professional.”Abraham-Ajeyemi and her husband have a son together while Ajeyemi has a daughter in his previous relationship."
  },
  {
    "headline": "Anglican bishop tasks Uzodimma on leadership",
    "summarized_story": "From George Onyejiuwa, OwerriAnglican Archbishop of the Ecclesiastical Province of Owerri, David Onuoha, has called on Governor Hope Uzodimma to provide a fatherly leadership that will ensure the return of peace in the state.\nHe said a patriot think-tank is required for the best way out of the ugly situation in which the state has found itself.\n“It is necessary for government to note that its strong arm strategy has not been effective.\nIf anything, it is worsening the security situation and creating room for further distrust of its sincerity.\nTherefore, I passionately call on well-meaning citizens of Imo State and indeed Igboland to shun partisanship and unite in an urgent search for a solution to this crisis,” he said."
  },
  {
    "headline": "June 12: Documentary on Abiola premiers on NTA, Channels – Presidency",
    "summarized_story": "From Juliana Taiwo-Obalonye, Abuja‘Nigeria: Consolidating Democracy and National Unity’ a documentary in recognition of Moshood Kasimawo Abiola, winner of the 1993 presidential election, will premiere on June 12 on Nigeria Television Authority (NTA).\nA statement by Presidency media aide, Garba Shehu, said the documentary will also be aired on Channels TV.\nPresident Muhammadu Buhari, in 2018, had declared June 12 as the new date for the celebration of Democracy Day to honour MKO Abiola, winner of the 1993 election.\n“The documentary is to commemorate the third anniversary of the landmark decision by President Muhammadu Buhari to officially recognise the annulled election and award its winner, Bashorun M.K.O.\nAbiola, the Grand Commander of the Federal Republic (GCFR) national honour."
  },
  {
    "headline": "Breaking: Poly lecturers suspends two months old nationwide strike",
    "summarized_story": "From Paul Orude BauchiThe Academic Staff Union of Polytechnics (ASUP) has suspended its over two months days old industrial action with effect from Thursday June 10, 2021.\nThis was disclosed by ASUP’s National Publicity Secretary, Comrade Abdullah Yalwa, in a press statement issued made available to journalists in Bauchi on Wednesday.\n“As part of the efforts communicated by the Federal Ministry of Education, certain items have been fulfilled,” he stated.\nThese, he disclosed included reconstitution and inauguration of governing councils and visitation panels in Nigerian Federal Polytechnics.\nYelwa disclosed that ASUP also acknowledged the recent passage of the Bill for removal of the dichotomy against HND holders in the country."
  },
  {
    "headline": "Buhari receives “first made-in-Nigeria phone”",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari on Wednesday received the first made in Nigeria cell phone, known as ITF Mobile.\nMinister of Industry, trade and Investment, Adeniyi Adebayo presented the phone to the President, before the commencement of the Federal Executive Council meeting.\nAdebayo said the phone was one of the 12 produced, using locally sourced components, by the Electrical/Electronics Technology Department of the Industrial Training Fund’s (ITF) Model Skills Training Centre.\nThose sworn-in were Wakil Bukar as Commissioner of the Federal Civil Service Commission (FCC) and Mohammed Dattijo Usman as Commissioner of the National Population Commission (NPC).\nOthers include the Ministers of Information and Culture, Lai Mohammed; Finance, Zainab Ahmed, Justice, Abubakar Malami and Trade and investment; Niyi Adebayo."
  },
  {
    "headline": "US calls for immediate reversal of Twitter ban",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe United States Government has called for the immediate reversal of the suspension of Twitter’s operations in Nigeria.\nUnited States Agency for International Development (USAID) Administrator Samantha Power said the suspension was nothing more than state-sanctioned denial of free speech.\nIn a Facebook post by the United States Diplomatic Mission to Nigeria, Power said the suspension should be reversed immediately.\n‘There are nearly 40 M Twitter users in #Nigeria, and the country is home to Africa’s largest tech hub.\nIn the joint statement, the five missions expressed disappointment over the Federal Government’s decision to place a ban on Twitter’s operations in Nigeria."
  },
  {
    "headline": "Breaking: Judicial Workers Suspend Strike",
    "summarized_story": "By Onyebuchi EzigboMembers of the Judiciary Staff Union of Nigeria (JUSUN) have resolved to suspend their two months old industrial action.\nThe decision to suspend the strike was reached on Wednesday at the National Executive Commitee meeting of the union held in Abuja.\nDeputy President of JUSUN, Mr Emmanuel Abisoye, who spoke with THISDAY shortly after the meeting said that the union was prevailed upon by the leadership of the National Judicial Council (NJC) to suspend the strike.\nCommuniqué of the meeting is being put together to formally declare the strike ended.\nWith the latest development, courts in the country which had remained shut during the strike will now reopen."
  },
  {
    "headline": "As US Urges Buhari to Rescind Twitter Ban, Trump Praises Action",
    "summarized_story": "By Michael OlugbodeThe United States of America has once again called on President Muhammadu Buhari to have a rethink over the banning of Twitter in the country.\nThe US government’s call came even as the former president of the country, Donald Trump, praised the action of President Buhari in banning the microblogging platform.\nPower, in a tweet on her verified handle on Wednesday, wrote: “There are nearly 40 million Twitter users in #Nigeria, and the country is home to Africa’s largest tech hub.\n#KeepItOn.”In what seems to be at variance with his home government, former President Donald Trump, the 45th president of the United States, congratulated Nigeria’s President Muhammadu Buhari for banning the microblogging site, Twitter.\n2024?”Trump was banned by Twitter while he was still president."
  },
  {
    "headline": "Govs’ Insistence Threatens Resolution of Judicial, Parliamentary Workers’ Strike",
    "summarized_story": "The federal government had three weeks ago brokered an agreement between the governors and the workers to end their 10-week-old strike.\nUnder the agreement, the governors were given 45-day window, with effect from the date of the agreement, to implement its terms.\nThe setting up of SAAC and State Houses of Assembly Services Commission was also part of the agreement reached between the striking workers and the governors.\nHe added that some states have not set up SAAC and the State Assembly Services Commission for the various commissioners of finance and the representatives of the Conference of Speakers of State Assembly.\nAccording to him, it is the state governors who have failed to implement the provisions of the Memorandum of Action that such threat should be directed at."
  },
  {
    "headline": "W’Bank Raises GDP Growth Forecast for Nigeria to 1.8%",
    "summarized_story": "But the World Bank hinged its positive prediction for Nigeria on the expectation that crude oil prices would remain high as well as the government effecting structural reforms and flexible exchange rate management.\n“Despite improvement, COVID-19 has continued to have adverse impacts on health, schooling, investment, and economic growth,” it stated.\nIt stated that while some countries (Ghana, Nigeria, South Africa) are presently upgrading national vaccine distribution systems, procurement and logistical hurdles in many other countries could slow vaccinations.\nA stronger-than-expected rally in metal and oil prices could boost revenues,” it stated.\nThe projected expansion would make 2021 the fastest year of growth since 1973’s 6.6 per cent."
  },
  {
    "headline": "Suspension to Remain Indefinitely Until Twitter Shows Remorse, Says FG",
    "summarized_story": "According to him, since the suspension of Twitter’s operations in Nigeria last Friday, the company has not reached out to the federal government for dialogue.\nHe said when the federal government complained, Twitter said the propagandists had not violated its rules.\nHe stated that even after that, Kanu used Twitter to ask his followers to kill Nigerian soldiers and police personnel and they obeyed.\nSuspension Unprofessional, Ill-advised, Says Catholic ChurchThe Catholic Secretariat of Nigeria (CSN) has described the suspension of Twitter operations in Nigeria as ill-advised.\nThe praise comes after it was announced earlier this month that Trump’s Facebook and Instagram would remain banned until early 2023."
  },
  {
    "headline": "FLASHBACK: How Nigeria’s Attorney-General, Malami Violated COVID-19 Guidelines In 2020 To Hold Lavish Wedding Ceremony For Son",
    "summarized_story": "On Tuesday, Nigeria’s Attorney-General of the Federation (AGF), Abubakar Malami, defied the Nigerian government’s Twitter ban.\nSaharaReporters further gathered that the Minister downloaded Virtual Private Network in order to visit Twitter to deactivate it.\nA critical look at the photo by just clicking on it showed that indeed Malami had accessed his Twitter account with the aid of a VPN.\nHe has also been constantly accused of using his influence in the government to promote impunity and human rights violation.\nNot only did participants at the ceremony, which took place inside the Kano State Government House, more than 20, many of them did not wear face masks to protect themselves and others from contracting Coronavirus."
  },
  {
    "headline": "FLASHBACK: How Nigeria’s Attorney-General, Malami Violated COVID-19 Guidelines In 2020 To Hold Lavish Wedding Ceremony For Son",
    "summarized_story": "On Tuesday, Nigeria’s Attorney-General of the Federation (AGF), Abubakar Malami, defied the Nigerian government’s Twitter ban.\nSaharaReporters further gathered that the Minister downloaded Virtual Private Network in order to visit Twitter to deactivate it.\nA critical look at the photo by just clicking on it showed that indeed Malami had accessed his Twitter account with the aid of a VPN.\nHe has also been constantly accused of using his influence in the government to promote impunity and human rights violation.\nNot only did participants at the ceremony, which took place inside the Kano State Government House, more than 20, many of them did not wear face masks to protect themselves and others from contracting Coronavirus."
  },
  {
    "headline": "FLASHBACK: How Nigeria’s Attorney-General, Malami Violated COVID-19 Guidelines In 2020 To Hold Lavish Wedding Ceremony For Son",
    "summarized_story": "On Tuesday, Nigeria’s Attorney-General of the Federation (AGF), Abubakar Malami, defied the Nigerian government’s Twitter ban.\nSaharaReporters further gathered that the Minister downloaded Virtual Private Network in order to visit Twitter to deactivate it.\nA critical look at the photo by just clicking on it showed that indeed Malami had accessed his Twitter account with the aid of a VPN.\nHe has also been constantly accused of using his influence in the government to promote impunity and human rights violation.\nNot only did participants at the ceremony, which took place inside the Kano State Government House, more than 20, many of them did not wear face masks to protect themselves and others from contracting Coronavirus."
  },
  {
    "headline": "How Nigeria’s Attorney-General, Malami Shielded Indian-Muslim Family Accused Of Over N600 Billion Graft—Report",
    "summarized_story": "The OCCRP investigation says high-ranking Albanian and Nigerian officials helped the family evade repeated attempts to extradite them to India.\nNigeria's Attorney-General rebuffed an Indian request for their extradition, arguing that the case appeared to be politically motivated.\nInvestigators claimed that the family’s companies had obtained the money by fraudulently obtaining loans from various Indian banks.\nThe Nigerian court decision in the case filed by Allenne, handed down on June 8, 2018, ultimately helped the Sandesaras avoid extradition from Albania as well.\nRejecting to order extradition, an Albanian judge argued that Nigeria’s High Court had shown the Sandesara family were being targeted because of their “political and religious beliefs.”"
  },
  {
    "headline": "How Nigeria’s Attorney-General, Malami Shielded Indian-Muslim Family Accused Of Over N600 Billion Graft—Report",
    "summarized_story": "The OCCRP investigation says high-ranking Albanian and Nigerian officials helped the family evade repeated attempts to extradite them to India.\nNigeria's Attorney-General rebuffed an Indian request for their extradition, arguing that the case appeared to be politically motivated.\nInvestigators claimed that the family’s companies had obtained the money by fraudulently obtaining loans from various Indian banks.\nThe Nigerian court decision in the case filed by Allenne, handed down on June 8, 2018, ultimately helped the Sandesaras avoid extradition from Albania as well.\nRejecting to order extradition, an Albanian judge argued that Nigeria’s High Court had shown the Sandesara family were being targeted because of their “political and religious beliefs.”"
  },
  {
    "headline": "Lai Mohammed on Twitter ban: Freedom of speech not stifled",
    "summarized_story": "Lai Mohammed, minister of information, says the ban on Twitter in Nigeria does not stifle the citizens’ freedom of expression.\n“For those that have heard that the ban is not effective, to the best of my knowledge, I think the ban is very effective.\nMany commentators have said suspending the operations of Twitter is like stifling freedom of expression.\nAnd I went further to say yes, that Twitter funded the #EndSARS protests in Nigeria last year.\nAdvertisement“Whether they paid directly, helped to pay, or helped to raise funds, it’s a matter of semantics."
  },
  {
    "headline": "Lai Mohammed on Twitter ban: Freedom of speech not stifled",
    "summarized_story": "Lai Mohammed, minister of information, says the ban on Twitter in Nigeria does not stifle the citizens’ freedom of expression.\n“For those that have heard that the ban is not effective, to the best of my knowledge, I think the ban is very effective.\nMany commentators have said suspending the operations of Twitter is like stifling freedom of expression.\nAnd I went further to say yes, that Twitter funded the #EndSARS protests in Nigeria last year.\nAdvertisement“Whether they paid directly, helped to pay, or helped to raise funds, it’s a matter of semantics."
  },
  {
    "headline": "Obasanjo: I'm a strong believer in one Nigeria -- but not at any cost",
    "summarized_story": "Former President Olusegun Obasanjo says though he strongly believes in the existence of Nigeria as a single nation, it should not be at any cost.\nAdvertisement“It is better that Nigeria stays together and finds solutions to its challenges than for each tribe to go its separate way,” Obasanjo said.\n“I am a strong believer in one Nigeria, but not one Nigeria at any cost — one Nigeria where every Nigerian can feel proud that he or she has a stake in this country.\nAdvertisement“Citizens of Oduduwa Republic or any other republic borne out of Nigeria will be diminished compared to being citizens of Nigeria.\n“If we have Igboland as an independent country, Yorubaland, an independent country, and Fulani/Hausaland an independent country, where will the Jukuns or the Gbasama belong?"
  },
  {
    "headline": "Obasanjo: I'm a strong believer in one Nigeria -- but not at any cost",
    "summarized_story": "Former President Olusegun Obasanjo says though he strongly believes in the existence of Nigeria as a single nation, it should not be at any cost.\nAdvertisement“It is better that Nigeria stays together and finds solutions to its challenges than for each tribe to go its separate way,” Obasanjo said.\n“I am a strong believer in one Nigeria, but not one Nigeria at any cost — one Nigeria where every Nigerian can feel proud that he or she has a stake in this country.\nAdvertisement“Citizens of Oduduwa Republic or any other republic borne out of Nigeria will be diminished compared to being citizens of Nigeria.\n“If we have Igboland as an independent country, Yorubaland, an independent country, and Fulani/Hausaland an independent country, where will the Jukuns or the Gbasama belong?"
  },
  {
    "headline": "FEC approves N895bn supplementary budget for military, COVID-19 vaccines",
    "summarized_story": "The federal executive council (FEC) has approved a draft supplementary budget of N895 billion to boost military operations and facilitate procurement of COVID-19 vaccine.\nBuhari had presented the initial 2021 budget proposal of N13.08 trillion to a joint sitting of the national assembly on October 8.\nAdvertisement“Today, the federal ministry of finance, budget and national planning presented to council a proposal to seek approval for the draft Federal Government of Nigeria 2021 supplementary budget.\n“The total of this expenditure is made up of N83.56 billion for COVID-19 vaccine programme, covering 30 billion vaccines from Johnson and Johnson vaccines and the logistics cost related to the deployment of that vaccine.\nThis is an incremental provision to the N100 billion already provided for in the 2021 budget."
  },
  {
    "headline": "Here’s why Apple’s planned privacy safety feature won’t roll out in three censorship-heavy African countries",
    "summarized_story": "In addition to these, Apple unveiled new updates focused on tightening the protection of its users’ privacy.\nA particular update that stood out from Apple’s several privacy-focused measures is “Private Relay”.\nThe feature is likely to go live later this year but Apple has revealed that it won’t be available in some countries due to “regulatory reasons”.\nCountries where the company will not offer private relay include South Africa, Egypt, Uganda, Saudi Arabia, Belarus, Colombia, Kazakhstan, Turkmenistan, the Philippines and China.\nApple is yet to disclose the outside partners it will use for the private relay system."
  },
  {
    "headline": "Exposure to risk: What tech investors fear and find interesting about Nigeria’s Twitter ban",
    "summarized_story": "One less medium for investor contactAfter the government ban on Twitter last week, a number of startups are anxious about using the platform.\nThe anxiety around the ban has gotten to the international community of startup investors too.\n“I think the ban on Twitter will definitely affect investor sentiments and perception about Nigeria negatively, especially foreign investors who invest in Nigeria remotely,” Shinada says.\nTwo other tech investors who spoke to TechCabal largely agreed with this view of the Twitter ban’s possible effect on foreign investments into tech startups.\nMore discount on regulatory riskOne area of investment concern following the Twitter ban is “a higher sense of political and regulatory risk,” where unilateral decisions can put whole companies in jeopardy."
  },
  {
    "headline": "Femi Iromini is improving the employability of students in Nigeria",
    "summarized_story": "Fortunately, Iromini got into university at a young age so taking an involuntary gap year wasn’t too big a deal.\nCareer outcomes are a selling proposition for universities,” Iromini said.\nSomeone who helps with internships, reviewing CVs and evaluating the interests of students,” Iromini said.\nIt also has other solutions for students like career services, a learning management system, a transcript management system, and an education financing product.\nAs someone who has always sought to solve problems around him, Iromini is taking the Nigerian education system heads on."
  },
  {
    "headline": "OctaFX Copytrading introduces Risk Score",
    "summarized_story": "The company recently introduced Risk Score—a game-changing feature that enables copiers to choose Master Traders based on the risk of their trading strategy.\nOctaFX Copytrading is a top-rated service among the company’s clients.\nFirst, you can access the service with just one tap through the OctaFX Copytrading app or the desktop version.\nOctaFX Copytrading introduced Risk Score—a new feature that shows how risky each Master Trader’s strategy is.\nMaster Traders who score 1 or 2 on a 6-point scale apply more stable, long-term oriented, and less risky strategies."
  },
  {
    "headline": "EASYSHARE.AFRICA LAUNCHES PLATFORM USING SAFE, LOW COST, CRYPTOCURRENCY TECHNOLOGY",
    "summarized_story": "By using innovative low-cost crypto-technology to drastically cut transaction fees, Easyshare will also allow consumers to perform micro-transactions safely, securely and affordably.\nSpeaking on the launch of the beta platform, Ben Onuoha Co-founder and Head of Partnerships & Community at EasyShare.Africa said, “Easyshare was born out of a lot of research.\nUsers can seamlessly send money to a mobile wallet or bank account using crypto in five easy steps.\nThe Easyshare.Africa platform is crowdsourcing to meet its expansion plansIn addition to serving ordinary consumers, Easyshare.Africa is committed to extending its impact, by pioneering the world’s first decentralized network of verified peer to peer crypto-powered remittance agents.\nCurrent crypto remittance systems and peer to peer platforms use centralized escrows to guarantee settlement."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Update on #Twitter ban, Nigerian e-hailing drivers go local, Bolt’s e-bikes in Kenya",
    "summarized_story": "Various bodies, including High Commissions and Embassies of foreign nations spoke out against the Twitter ban.\nUber and Bolt drivers set to partner with local companiesFighting back?\nRecall that in April 2021, riders on Uber and Bolt drivers embarked on a week long warning strike.\nGo deeper with this article: Uber, Bolt drivers move to dump ride hailing companies, partner with indigenous firmsBolt unveils electric tuk-tuks in KenyaBolt Foods electric motorcycles.\nSource: TechishBolt has unveiled electric tuk-tuks — tricycles — and e-bicycles in Kenya."
  },
  {
    "headline": "Global EV adoption: The reality in Africa may be different",
    "summarized_story": "A decade ago, the notion that Electric Vehicles (EVs) could be an alternative to the popular gas vehicles was unthinkable.\nLast year, over 11 million registered electric vehicles including cars, buses, vans and trucks were on the road across the world.\nIt has almost five million EVs, accounting for more than half of the world’s total, according to the Chinese Ministry of Public Security.\nThe country is ranked fifth globally in the ratio of public electric vehicle (EV) chargers to electric vehicles in 2020.\nSimilarly in Africa, SDG scenarios are predicting around 40% of light vehicles in Africa are electric by 2050."
  },
  {
    "headline": "Obaseki urges citizens’ ownership, warns against destruction of government property – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… Group offers to comb highways for criminal hideoutsBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called on citizens to take ownership of government property in their localities, to sustain ongoing development across the state.\nObaseki said this when he received leaders and elders of Ekosodin community in Ovia North-East Local Government Area of the state, who were on a courtesy visit at the Government House, Benin City.\nOsaigbovo Iyoha, said his administration will continue to work for the people of Edo State.\nIt has brought development to the people of Ekosodin Community in Ovia North-East.”In another engagement, Odolevbo O’sioba Initiative, led by the Commandant General, Comr.\n“We will continue to collaborate in the area of security, as we have made great impact in the area of keeping the state safe and peaceful,” he said."
  },
  {
    "headline": "Obaseki explores options to accelerate completion of Benin",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… plans new road, rail line to link Benin River Port to OkpellaBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, is exploring a number of options to speed up the completion of Benin-Auchi Road, which has been in a state of disrepair for years.\nOne of the options being considered is a proposal to take over the management and maintenance of the Benin-Auchi Road under the Federal Government’s Highway Development and Management Initiative (HDMI) being promoted by the Federal Ministry of Works and Housing.\nWe are designing a new road from the Benin River Port to Okpella.\nHopefully, one day in our development plan, we would be able to put a rail link there,” he added.\nObaseki further noted that, “When you try to get a flight to Edo State now, it becomes difficult because a lot of people are trying to utilize the business friendly environment created by this administration.”..."
  },
  {
    "headline": "NFF Gives State FAs 10 Days To Submit Aiteo Cup Champions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Nigeria Football Federation, NFF, organiser of Aiteo Cup Competition has given the 36 State and FCT Football Associations ten days to submit the name of club that will represent them in the 2021 National Aiteo Cup Competition.\nThis is contained in a statement dated 4th June and signed by the Secretary of the Organising Committee, Wilfred Onaji, which reads, “The Organising Committee of Nigeria Football Federation NFF on the directive by CAF all countries should submit by 30th June 2021 names of the teams that will take part in the various CAF Competitions.\n“In view of the above, the Committee concluded that all States Football Association should produce one representative latest 14 of June, 2021.\nA national draw will be held at a date that will be communicated for the 37 teams that qualified “."
  },
  {
    "headline": "Football Enthusiasts condemn Attack On Bendel Insurance Players During League Game – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Football enthusiasts in Yenagoa, the Bayelsa State capital have condemned the unruly behavior exhibited by fans of Remo Stars Football club against players and officials of Bendel Insurance FC in a matchday twenty one group B2 game of the Southern conference of the Nigeria National League, NNL played at Ikenne Ogun state on Sunday.\nRemo Stars who were at home allowed their supporters to beat up two Bendel Insurance players and secretary Charles Ihimekpan with other players seen escaping the stadium through the fence in a video that went viral on Sunday night.\nHe called on the Nigeria Football Federation and organizers of the league to sanction Remo stars FC and perpetrators of such violence in order to curtail the acts of hooliganism and insecurity in match venues across the country.\nAnother football enthusiast, Alaowei Mieseigha called on the league body to banish Remo Stars from Ikenne as well as place a fine on the team to serve as deterrent to others.\nAlso, Raphael Okolai noted that if strong measures were not taken against Remo stars, fans would continue to molest visiting teams whenever the home team fails to win a match on their ground."
  },
  {
    "headline": "UPDATED: JUSUN suspends two-month-old strike",
    "summarized_story": "The Judiciary Staff Union of Nigeria (NJC) on Wednesday suspended its nationwide strike which paralysed the Nigerian courts for over two months.\nJUSUN took the decision suspending the strike at a meeting of its National Executive Committee (NEC) in Abuja on Wednesday.\nThe union announced the suspension of the strike in a communique issued at the end of the NEC meeting on Wednesday.\n“NEC-in-session unanimously reiterated that no member of JUSUN should be victimised on strike action,” it added.\nThe 36 state governors had kicked against the executive order."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Osun VGN harps on synergy between citizens and security operatives to curb incessant crime rate",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun State chapter of Vigilante group of Nigeria (VGN), has said adequate cooperation of the citizens with the security operatives is the only antidote to incessant crime rate bedevilling the state.\nHe advised the citizens to adequately report any strange happenings or faces in their environment to security operatives near to them to help.\nAccording to him, the corp as part of civil Joint Task Force, has met with other conventional security personnel to fashion out modalities to effectively curb crime in the state.\nBello also appreciated Governor Oyetola for the opportunity given to his corp to be part of the civil Joint Task Force in the state.\nHe equally thanked the governor for hamolising all local security outfits in the state to form civil Joint Task Force, saying, the group will work assiduously with other conventional security personnel to bring lasting peace to the state ."
  },
  {
    "headline": "Ohanaeze to Wamakko: North responsible for insecurity in Southeast",
    "summarized_story": "Apex Igbo sociocultural group, Ohanaeze Ndigbo, has lashed out at former governor of Sokoto State, Aliyu Wamakko, berating him for accusing Igbo leaders of culpability in insecurity in the Southeast, insisting that North is the brain behind the insecurity in the zone.\nIn a statement by its Secretary-General Okechukwu Isiguzoro on Monday, Ohanaeze described Wamakko’s comments as laughable, advising the ex-governor to first fix the crisis in the North before making any comment on the Southeast.\nIsiguzoro noted that Wamakko could not proffer solutions to the security challenges in the North, which the region allegedly incubated to oust former President Goodluck Jonathan and instal Muhammadu Buhari.\n“Ohanaeze Ndigbo Worldwide had cautioned Aliyu Wamakko over impulsive comments without any iota of truth, which is capable of inciting ethnic cleansing and turmoil in the country,” Isiguzoro said.\nThe silence of Igbo leaders is golden and will generate confusion in the camps of sponsors of terror in the South East.”"
  },
  {
    "headline": "Nigerian govt says Twitter must register with it before ban is reversed",
    "summarized_story": "Nigeria’s federal government has said social media platform, Twitter, must register in the country before a ban it slammed on its operations last week can be lifted.\nMohammed said other social media platforms like Facebook and Instagram must also be registered in the country.\nAccording to him, freedom of speech was not stifled by the suspension of Twitter since Nigerians can still use other platforms such as Facebook and Instagram.\nHe added that Twitter’s loss of money as a result of the suspension is an indication of its effectiveness.\nMohammed said the suspension was necessary because the micro-blogging site provided a platform for those that are threatening the existence of Nigeria."
  },
  {
    "headline": "Polytechnics academic staff suspend strike for three months",
    "summarized_story": "OBINNA EZUGWUThe Academic Staff Union of Polytechnics (ASUP) says it is suspending an industrial action it embarked upon more than two months ago, with effect from Thursday, June 10.\nThe suspension, the union said, is however, for a period of three months to enable the government complete the execution of the items contained in the Memorandum of Action signed with the Union since 27th April, 2021.\n“Other items include the ongoing efforts at the review of the scheme of service and conditions of service for polytechnics as well as the commencement of work towards resolution of the issues around CONTISS 15 migration arrears for the lower cadre.\nWe also acknowledge the recent passage of the bill for removal of the dichotomy against HND holders in the country.\n“Our union took into cognisance the appeals made by the government, revered traditional rulers in the country, members of the National Assembly, Chairmen of governing councils of federal polytechnics and indeed members of the public who showed varied interests in the matter."
  },
  {
    "headline": "Imo Police Arrest Attackers Of Formations, Uzodimma’s House",
    "summarized_story": "The Imo State Police Command has announced the arrest of 10 persons in connection with the attack on the country home of Governor Hope Uzodimma.\nPolice spokesman, Bala Elkana, made the disclosure on Wednesday evening, saying the arrests were made on Tuesday.\nAccording to him, those arrested include a native doctor, 48-year-old Uzoamaka Ugoanyanwu, who prepared charms for gunmen alleged to be members of the proscribed IPOB and ESN.\nRelated: Assailants Raze Down Gov Uzodinma’s HouseAlso arrested were 40-year-old Chinedu Nwakaire a.k.a.\nOne Door, who both have been identified as being part of those who attacked the country home of Governor Uzodinma and some Police stations in the state, even as they have already confessed to the crimes and also stated their roles during the dastardly acts."
  },
  {
    "headline": "Imo Police Arrest Attackers Of Formations, Uzodimma’s House",
    "summarized_story": "The Imo State Police Command has announced the arrest of 10 persons in connection with the attack on the country home of Governor Hope Uzodimma.\nPolice spokesman, Bala Elkana, made the disclosure on Wednesday evening, saying the arrests were made on Tuesday.\nAccording to him, those arrested include a native doctor, 48-year-old Uzoamaka Ugoanyanwu, who prepared charms for gunmen alleged to be members of the proscribed IPOB and ESN.\nRelated: Assailants Raze Down Gov Uzodinma’s HouseAlso arrested were 40-year-old Chinedu Nwakaire a.k.a.\nOne Door, who both have been identified as being part of those who attacked the country home of Governor Uzodinma and some Police stations in the state, even as they have already confessed to the crimes and also stated their roles during the dastardly acts."
  },
  {
    "headline": "N’Delta Group Advocates Adequate Funding For NITT",
    "summarized_story": "A political group, Niger Delta APC Youth Vanguard, has advocated adequate funding for the Nigerian Institute for Transport Technology (NITT), Zaria in Kaduna State, to enable it deliver on its core mandates.\nLeader of the group, Comrade Collins Obilor, during a press conference, noted that the current budgetary allocation to the institute was not enough to enable it carry out its relevant activities.\nAlso speaking, the secretary-general of the group, Hon.\nJohn Tombara, commended the effort of the Minister for Transportation, Hon.\nTombara prayed God Almighty to guide the minister and the NITT director-general alongside the entire management team and to give them the strength to do more for the country."
  },
  {
    "headline": "N’Delta Group Advocates Adequate Funding For NITT",
    "summarized_story": "A political group, Niger Delta APC Youth Vanguard, has advocated adequate funding for the Nigerian Institute for Transport Technology (NITT), Zaria in Kaduna State, to enable it deliver on its core mandates.\nLeader of the group, Comrade Collins Obilor, during a press conference, noted that the current budgetary allocation to the institute was not enough to enable it carry out its relevant activities.\nAlso speaking, the secretary-general of the group, Hon.\nJohn Tombara, commended the effort of the Minister for Transportation, Hon.\nTombara prayed God Almighty to guide the minister and the NITT director-general alongside the entire management team and to give them the strength to do more for the country."
  },
  {
    "headline": "Ban: Twitter, Others Must Be Licensed, Registered In Nigeria – Federal Govt",
    "summarized_story": "The federal government has listed some conditions to lift the suspension on Twitter operations in Nigeria, saying it must now be registered in Nigeria as a business concern.\nApart from Twitter, the government said other social media platforms like Facebook and Instagram must be registered in the country.\nAnd of course, there has to be a country before people can able to transact their businesses using social media platforms.\nAnd I went further to say yes that Twitter funded the Endsars protests in Nigeria last year.\n“And until when Twitter responds and the cardinal thing is that Twitter must be registered in Nigeria."
  },
  {
    "headline": "There will be no extension for 2021 SSCE, Says NECO —",
    "summarized_story": "Doosuur Iwambe, AbujaThe National Examinations Council (NECO) has said that there will be no extension for the ongoing the registration process for the 2021 Senior School Certificate Examination (SSCE) for school based candidates.\nAccording to the statement, the registration exercise which started on 31st March 31 will close on Friday, June 36, 2021.\nThe statement revealed that there will be no extension adding that the examination will commence on Monday July 5, 2021.\nThis it added will enable efficient and effective planning for the examination logistics required for the smooth conduct of the 2021 SSCE internal.\n“The Council assures all stakeholders of its resolve to have a seamless conduct of the 2021 SSCE."
  },
  {
    "headline": "President Buhari to declare open maiden edition of youth conference",
    "summarized_story": "Tom Okpe, AbujaThe All Progressives Congress (APC) Youth Leader, Imail Ahmed has revealed that President Muhammadu Buhari is set to speak and declare open, maiden edition of youth conference to deepen democratic process through youth inclusion.\nAhmed further stated that to participate in the conference, youths are encouraged to log on to the official website of the conference www.pyc21.ng and register.\n“You will agree with me that Youth, vision, energy and skill is essential to moving the country forward.\nThe last elections had shown that the future of politics and governance lies with citizen and youth engagement.\nOther speakers expected at the conference are Julius Malema, Senator Ahmed Lawan, Senate President, Femi Gbajabiamila, Speaker, House of Representatives, Babatunde Raji Fashola, Akin Oyebode, Tonye Cole, Kabir Aregbesola, Daniel Bwala, and other progressive youths."
  },
  {
    "headline": "Just in: Court set to resume as JUSUN suspends strike",
    "summarized_story": "JUSUN has suspended the strike.\nDaily Times gathered that the Judiciary Staff Union of Nigeria (JUSUN) has resolved to suspend its over the two-month strike, effective from Monday.\nBreaking: ASUP Suspends StrikeJUSUN, News Online gathered took the decision at its National Executive Council (NEC) meeting which just ended in Abuja.\nREAD ALSO: Drama In Makurdi, EFCC Operatives ‘Beat Up’ NBA ChairmanThe National Judicial Council (NJC) had, at a meeting with JUSUN leaders on Tuesday, with the Chief Justice of Nigeria (CJN), Justice Ibrahim Muhammad in attendance, urged the striking court workers to put an end to the industrial action in the interest of the country and the suffering court users."
  },
  {
    "headline": "Reps directs FIRS chairman to resign over revenue leakages",
    "summarized_story": "Tom Okpe, AbujaPublic Account Committee (PAC) of the House of Representatives has urged the Executive Chairman of the Federal Inland Revenue Services, (FIRS) Alhaji Muhammad Mamman Nami to immediately resign his appointment, if he cànnot discharge his constitutional responsibilities effectively.\nThe Committee also gave Nami, 18 hours within which to appear before it or be sanctioned accordingly.\nHowever, the representative of the FIRS boss, Olusegun Olatunji pleaded with the Committee for the absence of his Chairman which he attributed to the lateness of the letter of invitation.\nThe Chairman of the Committee, Oke expressed dismay over the lukewarm attitudes of the Heads of Ministries Departments and Agencies MDAs of the Federal Government to their constitutional responsibilities on accountability.\n“Looking at the seriousness of this issue, the FIRS boss is to course physical appearance before this Honourable Committee by 10.00 am on Thursday, we are determined to stop this nonsense, the nation is bleeding,” he added."
  },
  {
    "headline": "10 babies at a go: South African Joziami Sithole sets world record",
    "summarized_story": "By AbankulaSouth African woman Joziami Thamara Sithole has set a new world record in multiple births, after delivering 10 babies at a time.\nThe 37 year-old woman erased the record set by 25 year-old Malian Halima Cisse, who gave birth to nine babies in Morocco on 4 May.\nSithole expressed surprise at breaking the world record, as she expected to have eight children and not 10, according to ultrasound results.\nThe South African was said to have been undergoing fertility treatment, when she became pregnant.\nFor now, the babies will stay in the incubators for several months due to the high-risk pregnancy the mother went through."
  },
  {
    "headline": "Secession: Obasanjo drops critical message for Igboho, Kanu, others",
    "summarized_story": "By Olawale JokotoyeFormer President, Chief Olusegun Obasanjo on Wednesday dropped a critical message for those agitating for secession of Nigeria.\nObasanjo’s message meant for Sunday Igboho, Nnamdi Kanu (IPOB), Prof. Banji Akintoye and others is that Nigerians would fair better staying together than break up.\nAccording to him, it is better for Nigeria to remain as one indivisible nation than for each tribe to go its separate way.\nThe former president, who acknowledged that Nigeria is passing through challenges, insisted that “disintegration is not the solution”.\n“Sudan was broken into Sudan and South Sudan, I don’t believe South Sudan is better for it and that is the truth,” he said."
  },
  {
    "headline": "Chris Okotie under fire for saying God’s divine indignation consumed T.B. Joshua",
    "summarized_story": "Chris Okotie has come under fire after he attacked late Prophet T.B.\nJoshua, saying it was God’s divine indignation that consumed him.\nJoshua was the wizard at Endor and that God had consumed him at last.\nHe said “the wizard at Endor who assumed the title ‘Emmanuel,’ has been consumed by divine indignation.\nAccording to Emo Mark, “At least TB Joshua never jump from one wife to another."
  },
  {
    "headline": "‘It Will Be Idiotic To Split Nigeria,’ Obasanjo Tackles IPOB, Yoruba Nation Agitators",
    "summarized_story": "Former President Olusegun Obasanjo has spoken out against proponents of the Yoruba and Biafra nations, saying it is “nearly insane” to call for Nigeria’s breakup at a time when Africa is moving toward political, social, and economic integration.\nObasanjo addressed at the Olusegun Obasanjo Presidential Library (OOPL) in Abeokuta on Wednesday at a luncheon and investiture of Kehinde Isijola as the new Ogun State Chairman of the Nigerian Institution of Surveyors (NIS).\nThe former Nigerian leader acknowledged that the situation in the country remained distasteful; nonetheless, he stated that the country’s disintegration is never the solution.\nInstead of blaming God, Obasanjo suggested that Nigerians blame themselves for the country’s woes.\nThe Balogun Owu claimed that everyone in Nigeria is concerned about the country’s state, and that anyone who is not concerned is a human being without being human."
  },
  {
    "headline": "I Am Ready To Die In Hands Of Kidnappers — Asia El-Rufai",
    "summarized_story": "Hajia Asia, the wife of Kaduna State Governor Mallam Nasir El-Rufai, has stated that she is willing to die at the hands of kidnappers in exchange for Nigerian peace.\nI am ready to die in the hands of kidnappers if it will bring peace to this country.\n“For as long as you continue to pay ransom, it is like you are adding kerosene to fire.\nyou are giving bandits, kidnappers money for ammunition to continue to haunt you.\nWe should not pay ransom."
  },
  {
    "headline": "BREAKING: JUSUN Suspends Two Months’ Strike",
    "summarized_story": "The Nigerian Judiciary Staff Union (JUSUN) has decided to call off its two-month strike, which began on Monday.\nJUSUN made the decision at its recently concluded National Executive Council (NEC) meeting in Abuja.\nThe National Judicial Council (NJC) asked striking court employees to cease their strike in the interest of the country and the suffering court users at a meeting with JUSUN leaders on Tuesday, with the Chief Justice of Nigeria (CJN), Justice Ibrahim Muhammad, in attendance.\nMore details later…"
  },
  {
    "headline": "Twitter Must Register In Nigeria Before Ban Is Reversed — Nigerian Government",
    "summarized_story": "Twitter, Facebook, Instagram, and other social media companies must register in Nigeria, according to the Nigerian government.\nTwitter was suspended, according to the Minister, because it gave a platform for persons who threatened Nigeria’s corporate survival.\nHe went on to say that Twitter’s financial loss as a result of the suspension is proof of its success.\nHe went on to say that one of the requirements for the Nigerian government to lift the restriction on Twitter is that the social media company be established as a commercial enterprise in Nigeria.\nOther social media networks, such as Facebook and Instagram, must also be registered in the country, according to Mohammed."
  },
  {
    "headline": "Social media platforms must register in Nigeria, FG in talks with Twitter – Minister",
    "summarized_story": "The minister said management of the microblogging platform reached out to government for discussions Wednesday morning.\nHe said Twitter was suspended because it provided an platform for those that are threatening the corporate existence of Nigeria.\nThe minister listed conditions that must be met even if government opens up discussion with Twitter on its suspension.\nHe said Twitter, Facebook, Instagram and other social media platforms must be registered in the country.\nThe minister also dismissed remarks by some individuals that the suspension was not effective, saying that Twitter is losing money as a result of the action."
  },
  {
    "headline": "I’m ready to die in the hands of kidnappers – El-Rufai’s wife",
    "summarized_story": "Wife of Kaduna state Governor Hajiya Asia el-Rufai has asked Nigerians to be ready to make sacrifices to end banditry and kidnapping.\nThe governor’s wife said in event of her kidnap, she was ready to die if that would be her own sacrifice of ending the menace.\nI am ready to die in the hands of kidnappers if it will bring peace to this country.\n“For as long as you continue to pay ransom, it is like you are adding kerosene to fire, you are giving bandits, kidnappers money for ammunition to continue to haunt you.\nWe should not pay ransom."
  },
  {
    "headline": "INEC: Rowdy session in Senate over Onochie’s appointment as National Commissioner",
    "summarized_story": "But the presidential request resurfaced on the floor of the Senate Wednesday Lauretta Onochie as number two on the list .\nHe said: “In seconding this motion, we have dealt with the matter of the nomination of Lauretta Onochie.\nSo we feel surprised the same name has resurfaced no longer as a national commissioner but as Delta state commissioner.\nWe shall meet in Philippi.”The President of the Senate , Ahmad Lawan , however corrected Abaribe by saying that Onochie is not nominated as Resident Electoral Commissioner (REC),but National Electoral Commissioner .\n” Anybody who has any petition against any of the nominees ,can forward such to the Senate Committee on INEC within the two weeks time frame given for the screening”, he said."
  },
  {
    "headline": "Youth coalition to embark on peace, unity rally to mark Nigeria’s democracy -NigPilot",
    "summarized_story": "Civil Society Youth Coalition has concluded preparations for a National Peace and Unity rally as part of activities to mark the June 12 Democracy Day In Nigeria.\n“The civil society youth coalition also observed with anger a proposed rally heavily mobilised by unpatriotic citizens for President Buhari must go and to sack the Minister of Communications, Mallam Isah Pantami.\nWe are of the decision that such political misadventure is meant to distract planned action of democracy day, and will be resisted by Nigerians.\nNigeria youths and civil societies alike disassociate our self from this act and will report any action to the necessary authorities for action.\n“Finally, we appeal to the media to join us in this four days of national peace and unity rally to celebrate our democracy which we see as a journey not a destination doing that will make Nigeria peaceful and united to face our challenges,” Aminu asserted."
  },
  {
    "headline": "Why most start-up businesses in Nigeria don’t survive first 5 years – experts -NigPilot",
    "summarized_story": "Business development experts have identified lack of adequate knowledge and requisite skills in chosen fields as factors responsible for the untimely death of most startup businesses in Nigeria.\n“We’ve heard about entrepreneurship, we know it’s doing business, but there are things we don’t consider on entrepreneurship.\n“Once you are able to establish this, you will be able to do analysis: am I really ready for this business?\n“We want to use our platform and wealth of knowledge to let people know what they need to know to develop themselves.\nI ended up providing a Solution to the problem I didn’t know was there in the first place."
  },
  {
    "headline": "Troops kill six terrorists in Dikwa -NigPilot",
    "summarized_story": "The statement however regretted that three soldiers sustained gunshot wounds during the gun duel with the enemy force.\nAccording to the statement, “The gallant troops of Operation HADIN KAI decisively dealt with ISWAP terrorists who attempted to infiltrate Dikwa town on Tuesday, 8 June 2021.\n“The marauding terrorists were thoroughly vanquished forcing them to withdraw in high state of confusion abandoning their truck, guns and ammunition.\n“Items recovered during the encounter include 1 Gun Truck, 8 Ak 47 rifles, 40 rounds of 7.62mm Special, 39 special ammo, 3 motorcycles and 6 magazines”.\nHe further tasked them to maintained the tempo to ensure total obliteration of terrorist groups within the North East region."
  },
  {
    "headline": "Bandits: Army launches joint clearance operation in Kano -NigPilot",
    "summarized_story": "The Nigerian Army has launched a joint special clearance operation to rid the notorious Falgore Forest of bandits and prevent other criminal elements from Niger into the country from the forest.\nDirector Army Public Relations, Brigadier General Mohammed Yerima in a statement said that 1 Division Nigerian Army, personnel of Nigeria Police, Nigeria Security and Civil Defence Corps as well as local vigilantes and hunters are involved in the ongoing special clearance operation.\n“The clearance operation which is still ongoing is geared towards complementing the efforts of the standby troops at Forward Operating Base Falgore, with the ultimate aim of making sure that bandits, kidnappers and other criminal elements from neighboring States do not infiltrate into the forest and any other part of Kano State to carry out their nefarious activities.\n“Consequently, we wish to reassure the good people of Kano State of the safety of their lives and property and also urge them to continue to report suspicious movements of strange individuals or groups in their vicinity to the nearest security agency for prompt action”.\nThe statement concluded that the NA in close cooperation with all the stakeholders on security is determined to ensure full return to normalcy in Kano State and other adjoining states in order to enable law abiding citizens go about their normal businesses without harassment by criminal elements."
  },
  {
    "headline": "Buhari To Visit Lagos On Thursday",
    "summarized_story": "President Muhammadu Buhari is expected in Lagos on Thursday for the inauguration of the 157 kilometre Lagos-Ibadan standard rail project at the Mobolaji Johnson railway station in Ebutte Metta.\nPresidential aide, Bashir Ahmad had on Wednesday noted that his principal will be in the nation’s commercial capital for the commissioning.\n“Construction started in March 2017, and test-running commenced in December 2020,” he wrote on his Facebook page.\n“The Ebute Metta Station, known as the Mobolaji Johnson Station, is the largest railway station in West Africa with a holding capacity of 6000 passengers.\nThe 156km Lagos—Ibadan standard gauge railway line in Lagos is the first double-track standard gauge rail in West Africa,It is also the first Nigerian railway line to be started and finished by the same government, since 1960."
  },
  {
    "headline": "All Social Media Platforms, Others Must Be Registered In Nigeria – Lai Mohammed",
    "summarized_story": "The Federal Government has said all social media platforms – Twitter, Facebook, and others must register in the country.\nThis according to the Minister of Information and Culture, Lai Mohammed is part of the move to regulate the social media platforms.\n“What we are saying is that all platforms, you must register in Nigeria.\n“Whether it is Netflix, Iroko, or Facebook…they are all doing business in Nigeria, making money and they are not paying taxes.\nWith its suspension, Nigeria joins countries like China, Turkey, and Myanmar that have all moved to restrict access at some time to Twitter and other Western social media."
  },
  {
    "headline": "Judiciary Workers Suspend Strike, After More Than Two Months",
    "summarized_story": "The Judiciary Staff Union of Nigeria (JUSUN) has suspended its industrial action after over two months.\nThe union had embarked on the strike on April 6, shutting down all courts nationwide, to demand financial autonomy for the judiciary in states.\nJUSUN’s suspension of the strike followed a meeting of its national executive council (NEC) held in Abuja on Wednesday.\nAbiri that the union’s other grievances include; non-payment of peculiar allowance for judiciary staff; the attempt by the Kaduna State Governor to place the State judiciary under its civil service and scheming for a State Judicial Council.\nHe, therefore, requested that the Accountant-General of the Federation be directed to deduct from source the amount meant for the Judiciary before the Union could call off the strike."
  },
  {
    "headline": "Continue Using Twitter – NASS Joint Minority Caucus Urges Nigerians",
    "summarized_story": "The Joint Minority Caucus of the Senate and the House of Representatives has met over the ban on Twitter by the All Progressives Congress (APC)-led Federal Government and has restated its condemnation of the embargo as draconian and unacceptable.\nThis position was contained in a communique signed by Senator Enyinnaya Abaribe the Minority Leader of the Senate) and Hon.\nIn the statement, the Joint Minority Caucus also dismissed threats by the APC-led government to arrest and prosecute Nigerians using Twitter and calls on Nigerians to go ahead and use their Twitter as they would not be contravening any law in Nigeria or any international statute.\nThe joint caucus, therefore, called on Nigerians to use various opportunities offered by technology and continue making use of Twitter since such does not violate any law in our country.\n“It is agonizing that Nigeria and Nigerians have been losing billions of naira on daily basis since the ban on Twitter."
  },
  {
    "headline": "Three Soldiers Injured As Troops Kill ISWAP Terrorists In Borno",
    "summarized_story": "Troops of the Nigerian Army under the Operation Hadin Kai have killed several ISWAP Terrorists in Dikwa town, Borno State.\nThey were, however, met with superior fire power by troops in conjunction with air bombardment by Air Task Force.\n“The marauding terrorists were thoroughly vanquished forcing them to withdraw in high state of confusion abandoning their truck, guns and ammunition,” the statement read.\n“During the encounter, six members of the terrorists groups were neutralized, several others were severely injured while the survivors withdrew in total disarray leaving behind their deceased colleagues”.\nHe urged them to maintain the tempo in order to ensure total obliteration of terrorist groups within the North East region."
  },
  {
    "headline": "Gunmen raid Ekiti community, kidnap 4",
    "summarized_story": "Gunmen on Tuesday night invaded a popular hotel in Ayetoro-Ekiti in Ido\\Osi local government area of Ekiti state and reportedly kidnapped four persons.\nIt was gathered the attackers, numbering 30 on motorcycles, invaded the hotel in a commando-like manner around 9:30pm.\nA community source said the bandits came into the community through Ewu-Ekiti, a neighbouring town.\nHe explained they shot sporadically and shot a staff of the hotel in the arm and kidnapped three others.\nKomolafe explained investigation by his men showed that security guards attached to the hotel was wounded while a lady was raped."
  },
  {
    "headline": "Police arrest IPOB/ESN native doctor in Imo",
    "summarized_story": "The Tactical teams of the Imo state Police Command has arrested a notorious native doctor who prepares charms for members of the proscribed Indigenous people of Biafra and eight others.\nThe suspect confessed to be a member of IPOB/ESN, and made useful statements to the Police as regards to the recent attacks on Police stations as well as the residence of Governor Hope Uzodinma.\nHowever, two (2) out of the nine arrested in the hideout, CHINEDU NWAKAIRE aka ONE DOOR and UZOAMAKA UGOANYANWU (their native Doctor) were identified to be part of the hoodlums that attacked the private residence of Gov.\nHope Uzodinma and also some Police stations as well.\nAdvertisementThey have confessed to the crime, and also stated their roles during the operations."
  },
  {
    "headline": "NECO Will Not Extend Registration For 2021 SSCE Internal Candidates – Sani",
    "summarized_story": "The Head of Information and Public Relations Division,Azeez Sani, has revealed that the National Examinations Council (NECO) will not extend the registration period for internal candidates for the 2021 Senior School Certificate Examination (SSCE).\nMr. Sani stated in a statement on Wednesday that the registration period, which began on March 31st, will end on Friday, June 25th, 2021, and will not be extended.\nAccording to him, this will enable efficient and effective planning for the examination logistics required for the smooth conduct of the 2021 SSCE internal candidates.\n“State Ministries of Education, Commandants, Principals, Proprietors, and other relevant stakeholders are enjoined to take note of the closing date and ensure timely completion of their candidates’ registration.\nAdvertisement“The Council assures all stakeholders of its resolve to have seamless conduct of the 2021 SSCE”, he further stated."
  },
  {
    "headline": "US to Share 500 Million Covid Vaccines Through COVAX for Africa, Others",
    "summarized_story": "The US will buy 500 million more doses of the Pfizer COVID-19 vaccine to share through the global COVAX alliance for donation to 92 lower income countries and the African Union over the next year, a person familiar with the matter said Wednesday.\nTwo hundred million doses — enough to fully protect 100 million people — would be shared this year, with the balance to be donated in the first half of 2022, the person said.\nThe U.S. has faced mounting pressure to outline its global vaccine sharing plan.\nOverall, the White House has announced plans to share 80 million doses globally by the end of June, most through COVAX.\nSullivan said Wednesday that he does not expect the U.S. push to waive the patents on vaccines to cause tension with European counterparts."
  },
  {
    "headline": "Twitter, Other ICT Players Contributed 14.91% to Nigeria’s GDP, Civil Society Group Reminds FG",
    "summarized_story": "A leading civil society organization, Centre for Social Justice (CSJ) has reminded the federal government that Twitter and other social media platforms belong to the Information Communications sector which contributed 14.9 per cent to the 2021 first quarter (Q1) gross domestic product (GDP).\nCSJ, which expressed regret over the recent ban on the micro-blogging site by the federal government called for an immediate reversal of the action.\n“The Information and Communications sector is composed of the four activities of Telecommunications and Information Services; Publishing; Motion Picture, Sound Recording and Music Production; and Broadcasting.\nIt observed that the fact that Nigeria is just struggling to exit recession even compounds the scenario.\nIt noted that the ban on Twitter at a time of great economic and social crisis has so many downsides without any evident upside."
  },
  {
    "headline": "Nigeria: I’d Rather Die Than Pay Ransom to Kidnappers, Says Kaduna Governor El-Rufai’s Wife",
    "summarized_story": "One of the wives of Governor Nasir El-Rufai of Kaduna state, Hajiya Asia El-Rufai, has declared that she would rather die than ransom be paid to kidnappers if she gets abducted.\nShe said she was ready to die in the hands of kidnappers if it will bring peace to the country.\n“For as long as you continue to pay ransom, it is like you are adding kerosene to fire.\n“We should not pay ransom.\nAccording to her, as long as the bandits are paid ransom, they will not change."
  },
  {
    "headline": "US Drops Trump Order Targeting TikTok, Plans Its Own Review",
    "summarized_story": "Officials are particularly concerned about apps that collect users’ personal data or have connections to Chinese military or intelligence activities.\nThe Biden administration last week expanded a Trump-era list of Chinese companies that Americans can’t invest in because of purported links to the Chinese military and surveillance.\nLast year, the Trump administration brokered a deal that would have had U.S. corporations Oracle and Walmart take a large stake in the Chinese-owned app on national security grounds.\nThe U.S. Court of Appeals for the District of Columbia Circuit has put on hold a case challenging Trump’s TikTok divestment order.\n“Our research shows that there is no overt data transmission to the Chinese government by TikTok,” the report said."
  },
  {
    "headline": "Nigeria: Judicial Workers Suspend Two-month Long Strike",
    "summarized_story": "The Judiciary Staff Union of Nigeria (JUSUN) has called off its two-month long strike with effect from 14th June, 2021 after a prolonged National Eexecutive Council (NEC) meeting.\nThe National Judicial Council (NJC) had, at a meeting on Tuesday with JUSUN leaders and the Chief Justice of Nigeria (CJN), Justice Ibrahim Muhammad, urged the striking court workers to put an end to the industrial action in the interest of the country and the suffering court users.\nMembers of the union have been on strike since April 6, 2021 in agitation for the financial independence of the various state judiciaries.\nA subsequent Executive Order was issued by the Nigerian President Muhammadu Buhari for the “Implementation of financial Autonomy of States Legislature and State Judiciary” on 20th May 2020.\nHowever, some state governors have failed to implement this fundamental provision of the Law."
  }
]