[
  {
    "headline": "Buhari receives second dose of COVID-19 vaccine",
    "summarized_story": "), has received the second dose of the AstraZeneca/Oxford COVID-19 Vaccine.\nThis happened on Saturday, May 29, 2021, at the State House In Abuja as stated on the official Twitter account of the Presidency.\n“President @MBuhari receives the second dose of the AstraZeneca/Oxford #COVID19 Vaccine, at the State House, on May 29, 2021.\nBuhari had in March received the first dose of the vaccine which was administered to him by his personal physician, Dr. Suhayb Sanusi.\nSee photos of the President receiving the second dose below."
  },
  {
    "headline": "Second volcano erupts near DR Congo’s Goma city",
    "summarized_story": "A second volcano erupted Saturday near the eastern DR Congo city of Goma, a week after Mount Nyiragongo roared back into life, causing devastation and sparking an exodus.\nMurara is a small volcano considered a crater of Nyamuragira, which along with Nyiragongo is known for strong volcanic activity.\nLocated on the shore of Lake Kivu in the shadow of Nyiragongo, Africa’s most active volcano, the city has lived in fear since it erupted last Saturday.\nTens of thousands had fled Goma last Saturday night but many returned when the eruption ended the following day.\nNearly 10,000 people are taking refuge in Bukavu on the southern bank of Lake Kivu, according to governor Theo Ngwabidje, many of them in host families."
  },
  {
    "headline": "Boat mishap: Kebbi to review maritime laws, says Bagudu",
    "summarized_story": "Governor Atiku Bagudu of Kebbi State says his administration will review the extant maritime laws to prevent further loss of lives and properties.\n“The governor was informed that 76 dead bodies have so far been recovered, following the boat mishap at Warrah on Wednesday.\n“Bagudu also acknowledged and appreciated the flurry of search and rescue efforts by divers, private boat owners, governmental and non-governmental agencies.\n“Bagudu called on people, especially boat users and passengers to learn from previous experiences and desist from acts capable of endangering their lives.\n“In whatever we do, we must stick to rules, boat users should stick to specifications on the exact number of passengers to be carried by each boat."
  },
  {
    "headline": "Why Africa continues to retrogress economically – Obi",
    "summarized_story": "Speaking on “Trade, AfCFTA and African Development”, Obi explained that trade has been a critical driver of economic development since the beginning of time.\n“Sustainable Economic Development can directly be linked to trade especially where there are significant integrations in the forward value chain e.g.\n“That is why the African Continental Free Trade Agreement (AfCFTA) was set up, to open up Africa and encourage African countries to trade among themselves.\nAfCFTA would significantly boost African trade, particularly intraregional trade in manufacturing.\nHe expressed hopes that there will be great economic transformation in Africa if the trade agreement is duely implemented."
  },
  {
    "headline": "Please, save my life for sake of my children, woman with chronic kidney disease cries out",
    "summarized_story": "I used to be a teacher, then an interior designer before I was diagnosed of a chronic kidney disease in 2017.\nI had battled with this kidney disease till 2019 when both of my kidneys failed.\nI started dialysis twice a week to clean the toxins from my system that my kidneys used to do without which I will die.\nALSO READ: Your help can save this mother of twoThings started going downhill for me.\nDo not let me die for the sake of my little children who need me, please save me."
  },
  {
    "headline": "Contributory pensions: Over 91,000 Retirement Savings Accounts registered in Q1 –PenCom -",
    "summarized_story": "Kindly Share This Story:A total of 91,499 Retirement Savings Account (RSA) holders were registered by the Pension Fund Administrators (PFAs), under the Contributory Pension Scheme (CPS), between January and April 2021,according to the National Pension Commission (PenCom).\nData obtained from PenCom’s website on Saturday, revealed that the PFAs registered 9,236,841 RSA holders in January, while the number surged to 9,328,340 in April.\nPenCom noted that of the N12.39 trillion assets, N8.32 trillion had been invested in federal government securities.\nGiving a breakdown, PenCom said Federal Government bonds gulped N7.45 trillion investment; treasury bills, N690.43 billion; agency bond, N13.01 billion; Sukuk bonds, N79.31 billion and green bonds N79.81 billion.\nAccording to the commission, the state governments’ securities also gulped N117.21 billion investment."
  },
  {
    "headline": "Paris agreement: FG submits compliance interim report to UNFCCC –Environment ministry -",
    "summarized_story": "Kindly Share This Story:The Federal Government says it has submitted its National Determined Contribution (NDC) Interim Report to the UN Framework Convention on Climate Change (UNFCCC).\nIn a statement by Mr Saghir el Mohammed, Director Press, Ministry of Environment, on Saturday, in Abuja said the submission was part of government’s commitment to the Paris Agreement on climate change.\nSubmitting the report on behalf of the Federal Government, the Minister of Environment, Dr Muhammad Abubakar, said that Nigeria had made steady progress towards meeting its NDC.\n“The submission made by Nigeria is also to fulfill the requirements for competing in the 2021 Nationally Appropriate Mitigation Action ( NAMA) Call for Proposal,” he said.\nAbubakar explained that NAMA Call for Proposal was an opportunity provided by Germany, the Federal Ministry of Environment, Nature Conservation, Nuclear Safety and others, to mobilise finance for climate action around the globe."
  },
  {
    "headline": "Ayade prefers industrialisation!",
    "summarized_story": "The Ayade government came with what it termed ‘Signature Projects” which focuses on business and revenue generation.\nThese projects include the construction of 675 kilometres Super Highway, Bakassi Deep Sea Port, Garment Factory, Rice Mill Factory and Cocoa Processing Factory.\nThe governor told the crowd during the Industrialisation Rally some weeks back.\n“God forbid that the governor of Cross River State in 2023 should be ‘Food on the Table’ governor.\nRegular salary payment to both civil servants and political office holders is one of those things which Ayade has excelled in the past six years."
  },
  {
    "headline": "Malami opens up on alleged receipt of N2bn from loot Nigeria recovered",
    "summarized_story": "The Attorney General of the Federation and Minister of Justice, Abubakar Malami (SAN) has denied the allegations that N2 billion was paid to his office from the recovered funds.\nGwandu said the government has been working in compliance with all the provisions of multinational agreements reached.\nHe added that the respect of the existing agreements was the reason the countries were committed to returning uncovered stash.\nAccording to Gwandu, the federal government has a designated account at the Central Bank of Nigeria for all recovered assets.\n“Abubakar Malami has neither as a person nor as the Attorney General of the Federation and Minister of Justice, does not in any way receive any funds from the recovered assets,” the statement read."
  },
  {
    "headline": "Emir of Bida raises alarm over alleged kidnap of 5 persons, calls for emergency meeting",
    "summarized_story": "The Etsu Nupe and Chairman of Niger State Council of Traditional Rulers, Alh.\nYahaya Abubakar, has called for an emergency meeting of districts and village heads over the kidnap of five persons in Batatti, Lavun Local Government Area of Niger State by bandits.\nThe Bandits numbering ten yesterday, at 8 pm stormed Batatti and kidnapped their victims while injuring many others.\nThe action of bandits, the account stated made shop owners, petty business hawkers to abandon their wares and shops for safety.\nEfforts to get confirmation from the State Police Public Relations Officer, PRO, SDP Wasiu Abiodun, proved abortive on the incident."
  },
  {
    "headline": "Nigeria submits interim report on carbon emissions to United Nations",
    "summarized_story": "The Nigerian Government has submitted its Nationally Determined Contribution (NDC) interim report to the United Nations Framework Convention on Climate Change (UNFCCC).\nThe move is part of its commitment to the Paris Agreement on global action in checking climate crisis.\nA statement by the Director Press, Federal Ministry of Environment, Saghir el Mohammed said the document is part of the requirements needed to qualify Nigeria to compete in the 2021 Nationally Appropriate Mitigation Action (NAMA).\nSubmitting the report on behalf of the Nigerian Government, the Minister of Environment, Dr Muhammad Mahmood Abubakar who submitted the report on behalf of the federal government, said Nigeria has continued to move towards meeting its NDC.\nThe minister explained that the proposal introduced by NAMA is an opportunity provided by Germany, the Federal Ministry of Environment, Nature Conservation and Nuclear Safety to mobilize funds for Climate Action around the world."
  },
  {
    "headline": "Nigerians react as Tinubu, Atiku meet",
    "summarized_story": "Former Vice President, Atiku Abubakar and former Lagos Governor, Bola Tinubu met at the Nnamdi Azikwe International Airport, Abuja on Friday night.\nTinubu walked towards Atiku as he alighted from his vehicle and they exchanged pleasantries.\nTinubu is the national leader of the All Progressive Congress (APC), while Atiku was Peoples Democratic Party (PDP) presidential candidate in 2019.\n@EmmaMillelJnr: Those who have permanent political enemies, shine eyes woo!\n@TheOladeile: I am not surprised that Tinubu received Atiku at the airport."
  },
  {
    "headline": "Uzodinma gets warning over insecurity in Imo",
    "summarized_story": "A former Vice Presidential candidate of the National Action Alliance (NAA), Justice Ughuegbu, says Imo State Governor, Hope Uzodinma should handle the insecurity in the State with care.\nThe legal practitioner advised Uzodinma to embrace dialogue in tackling the challenge.\nThe politician urged stakeholders to come together to proffer solutions to the lingering crisis.\n“We have come to a point where the state government must embrace dialogue and consult with notable stakeholders who will proffer viable solutions.\n“Our leaders must stop being silent, they must now speak up before this situation engulfs us all.”He regretted that Imo, hitherto, a safe place, had been bedeviled by insecurity."
  },
  {
    "headline": "Yoruba group warns politicians against disrespect of Obas",
    "summarized_story": "President of the group, Comrade Abdulhakeem Adegoke Alawuje who gave the warning said, whoever attacks traditional rulers in Yoruba land will have his group to contend with.\nAccording to him, “Yoruba Welfare Group sees our traditional rulers as our fathers in the land.\nYoruba traditional rulers aren’t available for any individuals or politicians to toy with.\n“We are thereby warning politicians and clerics to mind their statements towards any of the traditional rulers Historically, traditional rulers always have the final say in all affairs.\n“Its not possible to see a full-blooded Yoruba man to join any other group or political party to rubbish his traditional ruler."
  },
  {
    "headline": "Large turnout of voters marks APC primary in Badagry",
    "summarized_story": "Our ReporterAll Progressives Congress (APC) members on Saturday besieged the 10 voting centres in Badagry, waiting to vote in the primary election to select one out of the four aspirants contesting the seat of the council.\nThe primary election centres visited by the NAN correspondent includes: Gbenapon Primary School where Babatunde Hunpe, a member, House of Representatives, will cast his vote, Anserudeen Primary School, where Dr Sunny Ajose, the Lagos State Deputy Chairman of APC, is expected to vote.\nOthers are, LA Primary School, Idale, Badagry, where Mr Emmanuel Kappo, one of the contenders, will vote and Methodist Primary School, Topo Road, where the incumbent chairman, Mr Olusegun Onilude, and Mr Ibrahim Layode, the house of Assemblymember, Badagry 1, will vote.\nCommenting on the lateness, Representative Hunpe said the election officials were attacked by hoodlums on their way to Badagry.\nMeanwhile, accreditation and voting exercise is yet to start in most voting centres in Badagry as at 12noon."
  },
  {
    "headline": "Owerri attack: Police arrest four more suspects, recover arms",
    "summarized_story": "By Chris Njoku, OwerriImo State Police Command has arrested four more hoodlums allegedly involved in an attack on the Command’s headquarters in Owerri and Correctional Centre in the state.\nHe said the suspects were arrested in a coded operation, adding that they would be charged to court as soon as the investigation is completed.\n“The arrest was effected on 27th May 2021 at about 1630hours in a coded operation.\n“One automatic pump action gun, one single barrel gun and seventeen live cartridges were recovered from the suspects.\n“The Commissioner of Police Imo State, CP Abutu Yaro, has directed that the suspects be charged to court as soon as investigation is completed,” he added."
  },
  {
    "headline": "JUSUN strike stalls enactment of law on open grazing in A’Ibom",
    "summarized_story": "By Bassey Anthony, UyoThe Akwa Ibom state government says it is aligning with the decision of the Southern governors on opening grazing and would enact a law to that effect.\nCommissioner for information and Strategy, Comrade Iniobong Emembong said the state is against open grazing.\nAccording to him if not for the nationwide strike by parliamentary workers, the State House of Assembly would have come up with a law banning opening grazing in all parts of the state.\nADVERTISEMENT”The Attorney General of the state has intimated that no law has been enacted to that effect yet, but we are certainly bound by the decision of the southern governors meeting.\n”And you know that legislative business has been stalled for a while due to the strike by Parliamentary staff."
  },
  {
    "headline": "I might act nude if paid in foreign currency –Jessica Fabulous",
    "summarized_story": "Beautiful fast rising actress cum model, Jessica Fabulous, is a Nollywood greenhorn, but she’s ready to carve a place for herself in the make-believe world.\n“That’s why I am looking for that man that will give me the freedom to express myself and pursue my career.\nHe must also be a rich man but not necessarily as old as Regina Daniels’ husband.\nSpeaking further, Fabulous, who features in Elina, a new movie that hit cinemas last Friday, hints at the only condition that will make her act nude.\nHowever, if the money is right, I might give it a second thought, especially if it’s in foreign currency.”"
  },
  {
    "headline": "Kalu salutes, tasks new Chief of Army Staff",
    "summarized_story": "While congratulating the Chief of Army Staff, Kalu extolled the virtues of the Major-General, describing him as a gallant and committed military officer with a passion for professionalism and national development.\nThe former governor urged the new Army Chief to sustain his outstanding attributes in his new role.\nIn a congratulatory message, the Senate Chief Whip, stressed that the Nigeria Army has continually played a noble role in nation building.\nHe said: “I felicitate the new Chief of Army Staff, Major-General Farouk Yahaya, on his new national assignment.\n“Considering his antecedents, I am optimistic that the new Chief of Army Staff will bring to bear his expertise in the discharge of his duties and responsibilities."
  },
  {
    "headline": "MAY 29 SPECIAL: Nothing has changed under Buhari –Gen. Ishola-Williams",
    "summarized_story": "Making the assertion in an interview with TUNDE THOMAS, the retired General regretted that nothing has changed in the polity under the leadership of President Muhammadu Buhari.\nBuhari has refused to take decisions, often crucial decisions that can help to move the nation forward.\nAre you saying President Buhari is not doing what he supposed to do?\nThe APC came to office promising to transform the country, but some Nigerians are saying that nothing has actually changed.\nIt is not the same Buhari that Nigerians used to know in the days of the military that is the Buhari that we have today."
  },
  {
    "headline": "MAY 29 SPECIAL: Buhari hasn’t rewarded many of us who worked for",
    "summarized_story": "Will you advise the APC constitution review committee to make zoning an official policy of the party?\nI also don’t know if that is part of the scope of the assignment of the committee.\nAnd if that is part of it, fine, they can go ahead and incorporate zoning in the APC constitution.\nWe are getting to another election and you can’t face the national convention of the party without a fresh, reviewed party constitution for the people to be approved.\nI believe they will come up with a very solid party constitution."
  },
  {
    "headline": "Lamentation greets 22 years of democracy",
    "summarized_story": "That is the position of a number of prominent Nigerians and groups as the nation’s Fourth Republic clocks 22 years today.\nHe noted that when democracy returned in 1999, Nigerians had high expectations but regretted that not much has been achieved so far.\n“It is unfortunate that 22 years after democracy, we are still not out of the woods simply because things are not being done well.\nPresident of Southern Kaduna People’s’ Union, Hon Jonathan Asake, described the 22 years of unbroken democracy as ‘good’.\nFormer Publicity Secretary, Nigeria Bar Association (NBA), Lagos Branch, Emeka Nwadioke said: “While progress has been made in some sectors, the results have at best been woeful in others."
  },
  {
    "headline": "Six Years After, President Presents Achievements",
    "summarized_story": "Other efforts under this category include the establishment in 2020 of the Presidential Infrastructure Development Fund (PIDF), with more than $1 billion in funding so far.\nOn road projects, the statement listed the PIDF, the investment of over a billion dollars on three flagship projects: Lagos-Ibadan expressway, Second Niger Bridge and Abuja-Kaduna-Zaria-Kano expressway.\nThe Buhari administration, according to the statement, has done well in boosting the capacity of the nation’s ports.\nIn the power sector, Adesina listed President Buhari’s effort to include the implementation of Energising Education Programme, which involves taking clean and reliable energy (Solar and Gas) to Federal Universities and Teaching Hospitals across the country.\nThe achievements also included the Policy, Regulatory and Funding Support for the establishment of Modular Refineries across the Niger Delta."
  },
  {
    "headline": "FG Defends Choice of Farouk Yahaya as Chief of Army Staff",
    "summarized_story": "Critics also argued that the office of Army Chief had been restricted to Northerners in the six years Buhari has spent so far as President and that the President ought to have shifted a bit by picking the new Army Chief from among Southern Generals in the Army, so as to give the rest of the country a sense of belonging.\n“With the appointment of General Yahaya, President Buhari has expediently put national interest above ethnic and religious chauvinism by fulfilling all requirements necessary.\nYahaya is from Sokoto State and he was a member of the 37th Regular Course of the Nigerian Defence Academy.\nYahaya ResumesMeanwhile, General Yahaya formally resumed duty as the nation’s Chief of Army Staff yesterday.\n“General Yahaya later held a brief meeting with principal staff officers after observing a minute silence in honour of former COAS, late General Ibrahim Attahiru and 10 others."
  },
  {
    "headline": "EFCC Estimates Value of Diezani’s Jewelry at N14.4bn",
    "summarized_story": "•Explains delay in disposing assetsAdedayo Akinwale in AbujaThe Economic and Financial Crimes Commission (EFCC) yesterday revealed that the estimated value in Naira of jewelry seized from former petroleum minister, Diezani Alison-Madueke is N14.4 billion.\nThe EFCC boss said though they got the forfeiture order for assets recovered from the former Petroleum Minister in 2019, they were yet to be auctioned.\nHe stated: “The estimated value of Diezani Allison’s jewelry in naira is N14.4 billion.\nThe estimated value of houses for the former Minister of Petroleum, Diezani Allison is worth $80 million”.\n“This is to ensure that assets that are not only recovered by the EFCC but the entirety of the recovery agencies assets are disposed of.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Alleged Certificate Forgery: Obaseki Wins again",
    "summarized_story": "Chuks Okocha, Alex Enumah in Abuja and Adibe Emenyonu in Benin CityThe Supreme Court yesterday dismissed the appeal of the All Progressives Congress (APC) on the alleged certificate forgery against Edo State Governor, Mr. Godwin Obaseki.\nThe court in addition awarded a cost of N1 million in favour of Obaseki.\nThe trial court had on January 9 this year dismissed the alleged certificate forgery suit against Obaseki, on grounds that the party failed to substantiate its claim of forgery.\nBut not satisfied APC approached the Appeal Court to challenge the judgment of the lower court.\nToday’s judgement has reinforced this saying due to the celebration all over Edo State and other parts of the World."
  },
  {
    "headline": "Alleged Certificate Forgery: Obaseki Wins Again, as Supreme Court Dismisses APC’s Appeal",
    "summarized_story": "By Alex EnumahThe Supreme Court on Friday dismissed the appeal of the All Progressive Congress (APC) on the alleged certificate forgery against Edo State Governor, Mr Godwin Obaseki.\nThe apex court in a unanimous judgment held that the appellants failed to prove their case beyond reasonable doubt.\nAccording to the judgment, the appellants failed woefully in their case having not provided any disclaimer from the school that the said result was not issued by it.\nThe apex court in the judgment delivered by Justice Emmanuel Agim agreed with the lower courts that the appellants did not meet sufficient requirement of the law in proving their allegations.\nThe court accordingly upheld two judgments of the Court of Appeal Abuja and the Federal High Court, Abuja, which had earlier dismissed the case of the appellants for lacking merit."
  },
  {
    "headline": "10 Dead As Boko Haram Attacks Troops In Borno",
    "summarized_story": "Boko Haram fighters on Friday attacked the Operation Hadan Kai troops’ location in Rann in the Kala Balge Local Government Area of Borno State, with 10 of them shot dead during a fierce gun battle.\nThis was hours into the resumption of the new Chief of Army Staff, Maj Gen Farouk Yahaya, at the Nigerian Army Headquarters, Abuja.\n“The terrorists came in their numbers mounted on gun trucks and attempted to infiltrate the main entrance to the town.\n“The troops chased the retreating terrorist and ensured there was no further threat to the town and its residents.\nTroops successfully destroyed one of the gun trucks and recovered multiple weapons including one anti-aircraft gun, two machine guns and eight AK-47 rifles neutralising ten terrorists in the process.”"
  },
  {
    "headline": "10 Dead As Boko Haram Attacks Troops In Borno",
    "summarized_story": "Boko Haram fighters on Friday attacked the Operation Hadan Kai troops’ location in Rann in the Kala Balge Local Government Area of Borno State, with 10 of them shot dead during a fierce gun battle.\nThis was hours into the resumption of the new Chief of Army Staff, Maj Gen Farouk Yahaya, at the Nigerian Army Headquarters, Abuja.\n“The terrorists came in their numbers mounted on gun trucks and attempted to infiltrate the main entrance to the town.\n“The troops chased the retreating terrorist and ensured there was no further threat to the town and its residents.\nTroops successfully destroyed one of the gun trucks and recovered multiple weapons including one anti-aircraft gun, two machine guns and eight AK-47 rifles neutralising ten terrorists in the process.”"
  },
  {
    "headline": "Tinubu Takes N9billion From Lagos Internally Generated Revenue Account Monthly, Says Bode George",
    "summarized_story": "Bode George, a chieftain of the Peoples Democratic Party (PDP), says excessive leakages of revenues and monumental corruption are responsible for slow growth in Lagos state.\nSpeaking in an interview with Yoruba Tooto TV, George accused Bola Tinubu, national leader of the All Progressives Congress (APC) of taking N9 billion monthly from the Lagos state internally generated revenue account.\nBola Tinubu“Do you know how much is Lagos state internally generated revenue monthly?\nThings are hard in this country.”George added that the late Funsho Williams should have become the Lagos state governor.\nHe would have been a better governor of Lagos state,” he said."
  },
  {
    "headline": "Tinubu Takes N9billion From Lagos Internally Generated Revenue Account Monthly, Says Bode George",
    "summarized_story": "Bode George, a chieftain of the Peoples Democratic Party (PDP), says excessive leakages of revenues and monumental corruption are responsible for slow growth in Lagos state.\nSpeaking in an interview with Yoruba Tooto TV, George accused Bola Tinubu, national leader of the All Progressives Congress (APC) of taking N9 billion monthly from the Lagos state internally generated revenue account.\nBola Tinubu“Do you know how much is Lagos state internally generated revenue monthly?\nThings are hard in this country.”George added that the late Funsho Williams should have become the Lagos state governor.\nHe would have been a better governor of Lagos state,” he said."
  },
  {
    "headline": "Gunmen Attack Police Headquarters In Kwara",
    "summarized_story": "The police in Kwara State have said they repelled a reprisal on the command when some gunmen, suspected to be cultists, invaded the formation on Friday.\nThe police spokesperson said the attack came after it had put a situation under control earlier around Surulere, Baboko and Oja Tuntun areas of the state capital.\nHe said two tricycles invaded the police headquarters in Ilorin, opening fire but they met resistance from the men and officers of the command.\nHe said, “We had gone to put a situation under control this morning involving two cult groups and we made some arrests.\nThere have been cases of cult groups clashes recently, especially in Ilorin, the state capital."
  },
  {
    "headline": "Buhari receives second dose of COVID vaccine",
    "summarized_story": "President Muhammadu Buhari has received the second dose of AstraZeneca COVID vaccine.\nIn March, Buhari had received the first dose of the vaccine alongside Vice-President Yemi Osinbajo.\nAdvertisementThe first batch of the AstraZeneca COVID-19 vaccine arrived in Nigeria on March 2, 2021.\nLast week, the federal government asked those who had received the first dose of the COVID-19 vaccine to proceed for a second jab.\n“We are advising all Nigerians who have received their first dose to check their vaccination cards for the date of their second dose, and ensure that they receive the second dose to gain full protection against COVID-19,” Shuaib had said."
  },
  {
    "headline": "Buhari receives second dose of COVID vaccine",
    "summarized_story": "President Muhammadu Buhari has received the second dose of AstraZeneca COVID vaccine.\nIn March, Buhari had received the first dose of the vaccine alongside Vice-President Yemi Osinbajo.\nAdvertisementThe first batch of the AstraZeneca COVID-19 vaccine arrived in Nigeria on March 2, 2021.\nLast week, the federal government asked those who had received the first dose of the COVID-19 vaccine to proceed for a second jab.\n“We are advising all Nigerians who have received their first dose to check their vaccination cards for the date of their second dose, and ensure that they receive the second dose to gain full protection against COVID-19,” Shuaib had said."
  },
  {
    "headline": "'10 insurgents' killed as troops thwart Boko Haram attack in Borno",
    "summarized_story": "Troops of operation Hadin Kai have killed 10 suspected Boko Haram insurgents in Rann, Kala Balge LGA of Borno state.\nBefore his appointment, Yahaya was the theatre commander of operation Hadin Kai.\nIn a statement on Saturday, Mohammed Yerima, army’s spokesperson, said the insurgents came with gun trucks and had attempted to enter into the town.\n“The terrorists came in their numbers mounted on gun trucks and attempted to infiltrate the main entrance to the town.\n“Troops successfully destroyed one of the gun trucks and recovered multiple weapons including one anti-aircraft gun, two machine guns and eight AK-47 rifles neutralising ten terrorists in the process.”"
  },
  {
    "headline": "'10 insurgents' killed as troops thwart Boko Haram attack in Borno",
    "summarized_story": "Troops of operation Hadin Kai have killed 10 suspected Boko Haram insurgents in Rann, Kala Balge LGA of Borno state.\nBefore his appointment, Yahaya was the theatre commander of operation Hadin Kai.\nIn a statement on Saturday, Mohammed Yerima, army’s spokesperson, said the insurgents came with gun trucks and had attempted to enter into the town.\n“The terrorists came in their numbers mounted on gun trucks and attempted to infiltrate the main entrance to the town.\n“Troops successfully destroyed one of the gun trucks and recovered multiple weapons including one anti-aircraft gun, two machine guns and eight AK-47 rifles neutralising ten terrorists in the process.”"
  },
  {
    "headline": "Zainab Ahmed: FG exploring PPP option to fund infrastructure aside budgetary allocations",
    "summarized_story": "Zainab Ahmed, the minister of finance, budget and national planning, says the federal government will fund public infrastructures through other viable options aside from budgetary allocations.\nAdvertisementAhmed noted that one of the options is the adoption of public-private partnership (PPP).\nA PPP allows for a large-scale government projects, such as roads, bridges, or hospitals, to be completed with private funding.\n“Are to ensure that PPP takes a center stage in the procurement of infrastructure in Nigeria.\nThe government is ready and willing to dialogue and incorporate valuable suggestions from stakeholders with a view to further strengthening Nigeria’s PPP framework."
  },
  {
    "headline": "Nokia X20 Review – Dualsight Camera, 2-day battery life, and more",
    "summarized_story": "Early in April, HMD Global announced the launch of six new Nokia Android smartphones.\nIts major selling points include 3 years worth of Android updates from Nokia, cinema mode and dualsight camera, 2-day battery life and a large screen that allows you to watch virtually anything in full HD+.\nThe Nokia X20 retails for about $480.\nFinally, inside the box we have the following:The Nokia X20 : I mean, it would be extremely awkward if this was not in there.\nThe Look, The Feel, The HeftI will start by saying the Nokia X20 is a large phone."
  },
  {
    "headline": "How can you make your company hack-proof? These five experts know.",
    "summarized_story": "Adeoluwa, Daniel, Joseph, Sophina and Nick will be discussing how you can protect your organization and customers from online fraud.\nAdeoluwa is a skilled Information Security Professional.\nHe is responsible for building the backend infrastructure, driving product roadmap, leading the technical team and driving company strategy.\nSophina is a cybersecurity professional currently working with a leading financial services firm.\nHe has over 13 years experience in the technology industry and has worked for multinational, leading technology companies."
  },
  {
    "headline": "GovTech In Nigeria: From Regulatory Maze to Models of Good Practice",
    "summarized_story": "Nigerian public procurement and regulation can be labyrinthine, but recent policy reforms and the model of good practice provided by Kaduna State hint at opportunities for public-purpose innovation to flourish in the country.\nIt has also mandated Nigerian companies with large public sector IT contracts to engage Nigerian startups as R&D partners on the projects.\nBut the Federal Government need not look far for inspiration; it can take a page out of the Kaduna State Government (KDSG)’s Govtech playbook.\nAccording to the World Bank’s latest subnational Doing Business ratings, Kaduna is the most accessible state to register property and get contracts enforced in Nigeria.\nKaduna’s example is an exciting preview of what could be should the Federal Government follow through on a promising start."
  },
  {
    "headline": "How GOtv Nigeria Built the Widest Coverage in Nigeria with Investments in Local Infrastructure",
    "summarized_story": "Nationwide digital terrestrial television operator GOtv has greatly contributed to Nigeria’s digital migration through eye-watering infrastructure investment.\nBut GOtv, launched by Details Nigeria in October 2011, has shown confidence in the local broadcast industry.\nThe company has since worked closely with the government and the Nigerian Communications Commission (NCC) in providing affordable digital television for everyone through unmatched investments in modern broadcast infrastructure.\nOver the years, GOtv has continued to invest heavily in the latest technology in digital television, especially on its transmission technology, which it has consistently improved upon.\nThese investments by GOtv in the local broadcast infrastructure and the expansion of its network coverage have come as the government-driven digital switchover programme (DSO) progresses in fits and starts."
  },
  {
    "headline": "Brand Africa Ranks TECNO 6th on the Most Admired brands in Africa List",
    "summarized_story": "– In the recently released Africa’s Best Brands 2021, TECNO ranked for five consecutive years among the TOP 6 brands on the African continent, marking another prestigious recognition of the brand’s leadership in Africa.\nEstablished in 2011, the Brand Africa 100: Africa’s Best Brands rankings is the most authoritative survey and analysis on brands and underlying businesses in Africa, based on a study by Geopoll across 28 countries spanning all the five economic regions and analysis and ranking by Kantar and Brand Leadership.\nThe 2021 survey was conducted between March and April 2021 and yielded over 80,000 brand mentions and over 3,500 unique brands.\nWhen TECNO launched dual SIM cards in Africa, there had been nothing of the kind before then.\nAnd now, with Brand Africa’s new rankings, TECNO has once again come out tops, becoming a leading player in mid to high-end mobile brand segments in Africa."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Why some Nigerians might not miss Internet Explorer but would use Microsoft Edge",
    "summarized_story": "Microsoft announced in a blog post that it would retire the Internet Explorer (IE) on June 15, 2022.\nNonetheless, while Internet Explorer was going through its steady decline in market share, and Google Chrome dominated other browsers with 69% market share, Microsoft was building Microsoft Edge to replace IE.\nWith the Microsoft Edge browser launch in 2015, the software giant revealed plans to kill off Internet Explorer, though it would continue working until the end.\nMicrosoft also claims that Edge is its solution to the security issues faced on Internet Explorer over the years.\nAnd with reportedly the highest-rated protection against malware and phishing attacks, Microsoft Edge seems to be up to the task of protection."
  },
  {
    "headline": "News",
    "summarized_story": "The past few days have seen the value of cryptocurrencies take a massive dip, which is said to have stemmed from Elon Musk’s tweet.\nWhile this is not the worst crash the market has witnessed, how shou…"
  },
  {
    "headline": "Why some Nigerians might not miss Internet Explorer but would use Microsoft Edge",
    "summarized_story": "Microsoft announced in a blog post that it would retire the Internet Explorer (IE) on June 15, 2022.\nNonetheless, while Internet Explorer was going through its steady decline in market share, and Google Chrome dominated other browsers with 69% market share, Microsoft was building Microsoft Edge to replace IE.\nWith the Microsoft Edge browser launch in 2015, the software giant revealed plans to kill off Internet Explorer, though it would continue working until the end.\nMicrosoft also claims that Edge is its solution to the security issues faced on Internet Explorer over the years.\nAnd with reportedly the highest-rated protection against malware and phishing attacks, Microsoft Edge seems to be up to the task of protection."
  },
  {
    "headline": "Celebrating the kids, Crypto withdrawal on PayPal, Facebook hiding Likes, Twitter Spaces arrives Web",
    "summarized_story": "Becoming even more crypto-friendly: Currently, PayPal users cannot withdraw or send cryptocurrencies directly to friends and families.\nMore crypto users?\nPayPal’s purported crypto tolerance could be a ploy to lure more crypto users to its platform.\nInstagram and Facebook users now have more control over their experience on the apps.\nThis way, Facebook satisfies those who feel pressured by Likes and those who depend on Like counts — such as influencers — to use the app."
  },
  {
    "headline": "Nigeria dithers as world’s largest oil region turns hydrogen hub",
    "summarized_story": "The biggest oil-exporting region in the world, the Middle East, has set its sights on becoming a major clean energy exporter of green hydrogen, a message Africa’s biggest oil-producing country is yet to come to terms with.\nWhile Nigeria remained passive despite having a variety of resources to produce hydrogen, the largest oil producers in…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "How insecurity blights gains of Nigeria’s 22-year democracy",
    "summarized_story": "These issues have been sorted before independence, before the military came and that was why we had the 1963 Constitution.\nI think Nigeria is far from getting solutions to our insecurity challenge until presidency gets serious and accepts the reality,” Ujah said.\nWhat worries many observers is the inability of Nigeria to seek help from foreign partners who have successfully addressed their insecurity challenges.\nFor Alabo, the Federal Government is insincere with the fight against insecurity, especially with insurgence and bandits in the north.\nFor now, the only solution to our problem is foreign help because our security is compromised; they are eating from the problem, hence foreign assistance."
  },
  {
    "headline": "Reps minority group says Nigeria becoming a failed state",
    "summarized_story": "The house of representative minority group has asked President Muhammadu Buhari to “buckle up” in addressing the challenges confronting the country.\nIn a statement Friday to mark the sixth anniversary of the present administration, Ndudi Elumelu, minority leader of the lower chamber, tackled the All Progressives Congress (APC) over “economic crisis and avoidable acrimony”.\n“The caucus holds that with its failure to check worsening insecurity and mass killing of citizens; its intrinsic corruption, mismanagement of our national economy, as well as the unrelenting assault on our national diversity, the APC administration at the center has failed on all fronts in the last six years,” the statement reads.\n“Failure of the government to address escalated insecurity challenges has crippled the agricultural sector and disorganised commercial activities, leading to imminent food crisis with cost of food and other necessities of life skyrocketing beyond the reach of Nigerians,” the lawmakers said.\n“As representatives of the people, the minority caucus is worried that our nation is heading towards a failed state."
  },
  {
    "headline": "The Buhari Administration @ 6: Presidency lists achievements – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Presidency says the Muhammadu Buhari administration is recording giant strides, enough to make Nigerians proud.\nIn 2020 President Buhari commissioned the first phase of the Waltersmith Modular Refinery, in Imo State.\n– Nigeria national U-17 football team, the Golden Eaglets, won the FIFA U-17 World Cup for the fifth time, in 2015.\nTheir first ever win was 30 years earlier, in 1985, when President Buhari was military Head of State.\n– The designation of President Buhari as the African Union (AU) Anti-Corruption Champion for 2018– The designation of President Buhari by ECOWAS Heads of State as West Africa’s Covid-19 Champion in 2020."
  },
  {
    "headline": "COVID-19: Edo immunises over 38, 500 persons in first phase, begins second dose vaccination Tuesday – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has vaccinated over 38,500 persons in the first dose of phase one COVID-19 vaccination campaign and is set to begin the second dose vaccination on Tuesday, June 01, 2021.\nHealth Educator with the State Primary Healthcare Development Agency, Mrs. Irene Uabor, who disclosed this to journalists in Benin City, urged all those that have been vaccinated with the first dose of the Oxford-AstraZeneca COVID-19 vaccine to come out and take the second dose for full protection against the virus.\nShe noted that all eligible persons for the second dose vaccination are expected to take the second dose least 6 weeks from the first dose and before the 9th of July 2021.\nUabor further charged them to go to the health facility where the first dose was administered to access their second dose, adding, “For those that were vaccinated by roaming teams, they should check their cards and go to the health facility written on it for their vaccination.\n“You must continue to wear your facemask when in public; wash your hands regularly under running water, use alcohol-based hand sanitizers and observe social distancing.”She further charged residents with any COVID-19 symptoms to contact the Edo Emergency Operation Centre on this toll-free number: 08003625000 for assistance."
  },
  {
    "headline": "Certificate forgery: Supreme Court upholds Appeal’s ruling, affirms Obaseki as Governor – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…APC gets N1 million fine…ruling buries diabolical controversy – ObasekiThe Supreme Court on Friday upheld the ruling of the Appeal Court, dismissing the alleged certificate forgery suit filed by the All Progressives Congress (APC) against the Governor, during the 2020 governorship election.\nThe verdict affirms the victory of Governor Godwin Obaseki at the September 19 polls.\n“From the statement by the Supreme Court Justices, it is clear that they align with what Edo people knew all along, which is that there was no merit in the case.\nRecall that the Federal High Court, Abuja, had on January 9 dismissed the alleged certificate forgery suit against Governor Obaseki.\nApparently not satisfied with the decision of the lower court, the APC approached the appellate court to challenge the judgment."
  },
  {
    "headline": "Edo govt, UN strengthens collaboration to combat COVID-19, illegal migration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, met with a delegation of the United Nations to bolster the government’s efforts at containing the coronavirus (COVID-19) pandemic and further reduce the menace of irregular migration.\nThe delegation, headed by the United Nations Resident and Humanitarian Coordinator, Mr. Edward Kallon, was received at Government House in Benin City.\nPhilip Shaibu, reaffirmed the government’s commitment to containing the pandemic and curbing irregular migration among youths in the state.\nHe noted that the present administration of Governor Obaseki is putting in place reforms and policies to ensure a business-friendly environment to attract investment into the state.\nHe noted that a part of the aim for the visit was to discuss ideas that would put an end to irregular migration among youths in Edo."
  },
  {
    "headline": "Kebbi Boat Mishap: 76 corpses recovered so far- Governor",
    "summarized_story": "Governor Atiku Bagudu of Kebbi State says 76 bodies have so far been recovered after the boat mishap which occurred in the state during the week.\nThe governor also said his administration will review the extant maritime laws to prevent further loss of lives and properties.\n“The governor was informed that 76 dead bodies have so far been recovered, following the boat mishap at Warrah on Wednesday.\nIt said that 59 of the recovered dead victims were from Warrah town, expressing hope that more of the victims “would be rescued alive”.\nADVERTISEMENTHe recalled that in 2003 a similar boat accident was recorded in the area which claimed the lives of 50 passengers."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Just In: Supreme Court dismisses Ize-Iyamu’s forgery suit against Obaseki",
    "summarized_story": "The apex court in a judgement delivered by Justice Emmanuel Agim held that the appellants failed to prove its case beyond a reasonable doubt, NAN reported.\n“This court agrees with the lower courts completely, that the appellants did not meet sufficient requirement to prove their case”.\nThe Supreme Court, therefore, awarded a cost of one million naira in favour of Governor Obaseki.\nThe appeal court in Abuja had dismissed the suit challenging Obaseki’s certificates on March 18.\nThe Appeal Court further held that Mohammed’s verdict was without ambiguity and that the APC did not prove its case."
  },
  {
    "headline": "Total changes name to TotalEnergies as part of transition to renewable energy",
    "summarized_story": "Total on Friday changed its name to TotalEnergies as pushes to become one of the world’s top five in renewables by 2030.\nThe shareholders, the statement said, approved, almost unanimously, the resolution to change the company’s name from Total to TotalEnergies, thereby anchoring its strategic transformation into a broad energy company in its identity.\nMr Patrick Pouyanné, Chairman and Chief Executive Officer of TotalEnergies said in tandem with this name change, TotalEnergies was adopting a new visual identity.\nEnergy is reinventing itself, and this energy journey is ours,” he said.\nHe said TotalEnergies would be a broad energy company committed to producing and providing energies that are ever more affordable, reliable and clean."
  },
  {
    "headline": "ADF backs May 30 Remembrance Day, says Biafra part of Igbo history",
    "summarized_story": "OBINNA EZUGWUThe Alaigbo Development Foundation (ADF), has encouraged all patriotic Igbo people across the globe to observe the May 30 Biafra Remembrance Day, as according to it, the day remained an important part of the history of Igbo nation.\nThe ADF which made call in a statement signed by its president, Professor Uzodinma Nwala and spokesperson, Chief Abia Onyike on Friday, argued that May 30 has become an official Igbo Remembrance Day, which cannot be wished away.\n“Events in Alaigbo on May 30, each year show that May 30 has become an official Igbo Remembrance Day not only within Alaigbo but throughout the entire world where Igbo citizens live.\n“It is in the light of this that the ADF fully supports observance of May 30, this year as Igbo Day Celebration.\n“May 30 marks the day Biafra was declared in 1967 and no patriotic Igbo son or daughter can pretend that Biafra is not part of the history and indeed the major water-shed in the history of the Igbo nation,” the group noted."
  },
  {
    "headline": "Any PDP tour of Osun without resolution chairmanship tussle a waste of time – Adagunodo",
    "summarized_story": "The embattled chairman of Osun State Chapter of People’s Democratic Party (PDP) Hon.\nIt is not an official programme of the Osun State chapter of the Peoples Democratic Party.\nInterest groups within a political party are allowed to consult but this should not be misconstrued as an official programme of Osun PDP.\nThere is a difference between OSUN PDP AND PATHFINDER TEAM.\nWill you consider your removal as the genesis of the Osun PDP crisis?"
  },
  {
    "headline": "Musician Apologises to Kogi Commissioner, Others Over Allegation of Wife Snatching",
    "summarized_story": "A Kogi-based musician, Tanimu Yunusa has apologised to the State Commissioner for Work, Engr Abubakar Ohere, over allegation of attempting to induce and snatch his wife.\nHe also apologised to the Chief of Staff to the governor, Pharmacist Abdulkareem Asuku, State Accountant General, Hon.\nAllegation of Wife SnatchingIn an earlier video which went viral in the state, Tanimu accused the commissioner of luring his wife, Zuleiha to abandon their marriage and become his mistress with a promise to marry her.\nI also told you that I don’t talk carelessly on Facebook, Whatsapp and all those things.\nBut the day I get angry and I choose to talk, it will shock everybody,” Tanimu was seen saying in the video."
  },
  {
    "headline": "Musician Apologises to Kogi Commissioner, Others Over Allegation of Wife Snatching",
    "summarized_story": "A Kogi-based musician, Tanimu Yunusa has apologised to the State Commissioner for Work, Engr Abubakar Ohere, over allegation of attempting to induce and snatch his wife.\nHe also apologised to the Chief of Staff to the governor, Pharmacist Abdulkareem Asuku, State Accountant General, Hon.\nAllegation of Wife SnatchingIn an earlier video which went viral in the state, Tanimu accused the commissioner of luring his wife, Zuleiha to abandon their marriage and become his mistress with a promise to marry her.\nI also told you that I don’t talk carelessly on Facebook, Whatsapp and all those things.\nBut the day I get angry and I choose to talk, it will shock everybody,” Tanimu was seen saying in the video."
  },
  {
    "headline": "24 Hours After New COAS Takes Over, Troops Kill 10 Terrorists In Borno",
    "summarized_story": "Barely hours into the tenure of the new Chief of Army Staff, Maj-Gen Faruk Yahaya, troops of Operation Hadin Kai neutralised 10 Boko Haram Terrorists in failed attack on Rann, the headquarters of Kala Balge LGA of Borno State.\nThe director, Army public relations, Brig Gen Mohammed Yerima, said the terrorists came in their numbers, mounted on gun trucks and attempted to infiltrate the main entrance to the town.\nHowever, the highly spirited troops countered the move and inflicted humiliating defeat on the terrorists who abandoned their evil mission and took to their heels.\nHe stated that the troops chased the retreating terrorists and “successfully destroyed one of the gun trucks and recovered multiple weapons including one anti aircraft gun, two machine guns and eight AK-47 rifles neutralising ten terrorists in the process.”"
  },
  {
    "headline": "24 Hours After New COAS Takes Over, Troops Kill 10 Terrorists In Borno",
    "summarized_story": "Barely hours into the tenure of the new Chief of Army Staff, Maj-Gen Faruk Yahaya, troops of Operation Hadin Kai neutralised 10 Boko Haram Terrorists in failed attack on Rann, the headquarters of Kala Balge LGA of Borno State.\nThe director, Army public relations, Brig Gen Mohammed Yerima, said the terrorists came in their numbers, mounted on gun trucks and attempted to infiltrate the main entrance to the town.\nHowever, the highly spirited troops countered the move and inflicted humiliating defeat on the terrorists who abandoned their evil mission and took to their heels.\nHe stated that the troops chased the retreating terrorists and “successfully destroyed one of the gun trucks and recovered multiple weapons including one anti aircraft gun, two machine guns and eight AK-47 rifles neutralising ten terrorists in the process.”"
  },
  {
    "headline": "Who Is Chasing You Out Of Town, Atiku Cracks Joke With Tinubu",
    "summarized_story": "Tinubu was subsequently ushered to where Atiku’s vehicle was parked and the latter on sighting the former Lagos State governor approaching his direction, alighted from the vehicle to exchange pleasantries with Asiwaju.\nThe following conversation ensued between an excited Atiku and Tinubu:Atiku: Ehn, Asiwaju, where are you going this night.\nAtiku: Late, am I late coming?\nHowever, when this reporter contacted Atiku’s spokesperson, Paul Ibe, late Friday night, he denied the chance meeting of both political heavyweights.\nMeanwhile, a credible source in Atiku’s camp told LEADERSHIP that Atiku returned to Nigeria for a function in Yola, Adamawa State."
  },
  {
    "headline": "Constitution Amendment: I’m after a constitution that will unite Nigerians...",
    "summarized_story": "An All Progressives Congress (APC) stalwart in Adamawa State, Alhaji Abdulrahaman Buba Kwacham in his own opinion said there can’t be better constitution that the one which seeks to unite Nigerians and to have an inclusion of all people irrespective of religion, tribe or place of origin.\nHe worried about the many gaps the 1999 Constitution as amended has plundered and further widening the gap of Unity and peaceful coexistence, neglecting the complex nature of the country.\nKwacham an international businessman from Mubi, Adamawa Northern senatorial zone called on well meaning Nigerians to be part of the Constitutional review with priority being given in the unity and social inclusion of all Nigerians.\n“The country seems to have more agitators than Patriots, we are having wailers lamenting to have been marginalized than people calling for Unity.\nThe best thing to do is to look at how we are far apart to build a bridge of Unity and love.” He added"
  },
  {
    "headline": "Bandits allegedly kill three policemen in Delta deputy speaker’s community",
    "summarized_story": "Ochor Christopher Ochor, was on Friday attacked by men of the underworld.\nThe dastardly act carried out in the early hours of Friday, at about 1:30pm, saw the hoodlums numbering over ten moved into Umutu police station, allegedly shot sporadically, killing two officers on the spot.\nPolice Public Relations Officer (PPRO), DSP Edafe Bright, confirming the attack and subsequent murder, said the hooligans met stiff resistance.\nAccording to the image maker, “the Command lost two police men, while one ASP died of High Blood pressure in the hospital.\nThey had to take a retreat, they quickly carried their dead and ran away."
  },
  {
    "headline": "EFCC arrests Ibadan CEO over N128m investment scam —",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC), Ibadan Zonal Office, has arrested a 43-year-old company executive for allegedly defrauding people of over N128 million, in a fraudulent investment scheme.\nThis was contained in a statement signed by the EFCC’s spokesperson, Wilson Uwujaren, and made available to newsmen on Friday, in Ibadan.\nThe EFCC spokesperson said that some of the victims said the alleged suspect persuaded them to invest after listening to his weekly radio programme.\n“The victims alleged that after investing their monies, they neither received the promised interest nor got a refund of their capital investment,” he said.\nHe said that petitions were still pouring into the commission daily from the suspect’s alleged victims."
  },
  {
    "headline": "Min. Rotimi Amaechi delves into music, releases gospel song to celebrate birthday",
    "summarized_story": "Minister of Transportation and former governor of Rivers State, Rotimi Amaechi, is celebrating his birthday today.\nRotimi Amaechi has released a gospel song to mark his 56th birthday.\nThe former governor of Rivers State titled the song ‘Psalm 33’ with the catchphrase “Blessed the people the Lord has chosen as his heritage.”READ ALSO: Students beg Gov el-Rufai over 500% tuition fees…The minister featured his family members in the song packaged by Obiblo Music.\nMr Amaechi is one of several ministers retained by President Muhammadu Buhari after he won re-election in 2019."
  },
  {
    "headline": "Cardi B begs judge to drop assault charge",
    "summarized_story": "Cardi B has urged a judge to dismiss an autograph seeker’s assault lawsuit against her, insisting he instigated the alleged attack.\nThe incident took place following a Met Gala after-party in 2018 as Cardi and Offset were returning to their hotel in New York City.\nAccording to Cardi, Arnold can be heard shouting: “Please beat me up.\nI’ll take all of your money.”In his lawsuit, Arnold alleged three of Cardi’s security guards assaulted him, but she counters the unnamed assailants did not work for her and she didn’t instruct them to beat up anyone.\nCardi alleges the autograph hunter orchestrated the incident in a bid to get money from her."
  },
  {
    "headline": "Cardi B begs judge to drop assault charge",
    "summarized_story": "Cardi B has urged a judge to dismiss an autograph seeker’s assault lawsuit against her, insisting he instigated the alleged attack.\nThe incident took place following a Met Gala after-party in 2018 as Cardi and Offset were returning to their hotel in New York City.\nAccording to Cardi, Arnold can be heard shouting: “Please beat me up.\nI’ll take all of your money.”In his lawsuit, Arnold alleged three of Cardi’s security guards assaulted him, but she counters the unnamed assailants did not work for her and she didn’t instruct them to beat up anyone.\nCardi alleges the autograph hunter orchestrated the incident in a bid to get money from her."
  },
  {
    "headline": "Unpaid gratuities: Crisis brews as Ogun pensioners declare three-day fast, plan protest",
    "summarized_story": "Retired local government workers and primary school teachers in Ogun State have declared a three-day fast and vowed to stage a protest against the state governor, Dapo Abiodun, for his alleged refusal to pay their gratuities.\nMembers of the Local Government Pensioners Association specifically said they would march to the Governor’s Office after the fast, which started on Friday, with their mats and turn the place to their homes.\nThey vowed not to leave the governor’s office until their gratuities are paid.\nHe said, “We are subjecting ourselves to three days fast and prayer so that we shall call on God to be on our side.\nHowever, he said the government would continue to engage the pensioners, adding that present economic realities were responsible for the payment of N500m monthly to clear the backlog of gratuities."
  },
  {
    "headline": "Unpaid gratuities: Crisis brews as Ogun pensioners declare three-day fast, plan protest",
    "summarized_story": "Retired local government workers and primary school teachers in Ogun State have declared a three-day fast and vowed to stage a protest against the state governor, Dapo Abiodun, for his alleged refusal to pay their gratuities.\nMembers of the Local Government Pensioners Association specifically said they would march to the Governor’s Office after the fast, which started on Friday, with their mats and turn the place to their homes.\nThey vowed not to leave the governor’s office until their gratuities are paid.\nHe said, “We are subjecting ourselves to three days fast and prayer so that we shall call on God to be on our side.\nHowever, he said the government would continue to engage the pensioners, adding that present economic realities were responsible for the payment of N500m monthly to clear the backlog of gratuities."
  },
  {
    "headline": "ICYMI:Aso Rock silences Buhari naysayers with catalogue of achievements",
    "summarized_story": "In 2020 President Buhari commissioned the first phase of the Waltersmith Modular Refinery, in Imo State.\n– Nigeria national U-17 football team, the Golden Eaglets, won the FIFA U-17 World Cup for the fifth time, in 2015.\nTheir first ever win was 30 years earlier, in 1985, when President Buhari was military Head of State.\n– President Buhari approved 5 billion Naira in take-off grant for the Maritime University.\n– The designation of President Buhari as the African Union (AU) Anti-Corruption Champion for 2018– The designation of President Buhari by ECOWAS Heads of State as West Africa’s Covid-19 Champion in 2020."
  },
  {
    "headline": "FRSC prosecutes 2,362 Kaduna traffic offenders",
    "summarized_story": "The Kaduna State Sector Command of the Federal Road Safety Corps (FRSC) said it prosecuted 2,362 traffic offenders between April 2 and May 4, 2021.\n“With resultant crashes, we initiated Special Intervention Patrols which resulted in the prosecution of 2,362 traffic offenders for violating 2,630 traffic-related offences within four weeks (between April 2 and May 4, 2021),’’ he said.\nAccording to him, the special intervention patrol was necessitated by the need to stem the tide of traffic law infractions within the metropolis and highways.\nHe expressed regret at the spiral effect of road crashes on the state’s socio-economic growth, saying that victims of road crashes were often found within the productive age categories of 17 and 45 years.\nMohammed said the special intervention patrols formed part of strategies put in place by the command to reduce road crashes in the state."
  },
  {
    "headline": "Buhari wins 2021 Trophée Babacar Ndiaye",
    "summarized_story": "By Temitope PonlePresident Muhammadu Buhari has been named winner of the 2021 Great Builder Super Prize for Trophée Babacar Ndiaye, taking over from Abdel Fattah al-Sissi of Egypt, who won the 2020 prize.\nAccording to a statement from the African Development Bank (AfDB) on Friday, Buhari was named the winner during the inaugural Africa Road Builders Conference held on March 31 in Cairo, Egypt.\nThe trophy would be awarded on June 24 on the sidelines of the AfDB’s Annual Meetings.\nFattah al-Sissi received the award “for his personal leadership and for the efforts made to ensure road safety and the health of the population in the context of transport”.\nHowever, the selection committee cited Nigeria’s efforts to improve road safety and air quality for road users."
  },
  {
    "headline": "BREAKING: Troops Kill Boko Haram Terrorists In Fresh Borno Attack",
    "summarized_story": "According to the Nigerian Army, scores of Boko Haram insurgents were killed by troops of Operation Hadin Kai while attempting to raid Rann, the headquarters of the Kala Balge Council Area in Borno State.\nThe terrorists were repelled by the army while attempting to infiltrate the city’s entrance, according to Director Army Public Relations Brigadier General Mohammed Yerima.\n“Boko Haram terrorists attempted an audacious attack on troops of Operation Hadin Kai in Rann, the headquarters of Kala Balge LGA of Borno State, just hours into the tenure of Chief of Army Staff Gen Faruk Yahaya,” the statement stated.\nTerrorists arrived in large numbers, mounted on gun trucks and attempted to infiltrate the main entrance to the town.\nTroops successfully destroyed one of the gun trucks and recovered multiple weapons including one anti aircraft gun, two machine guns and eight AK-47 rifles neutralising ten terrorists in the process.”"
  },
  {
    "headline": "Why Buhari Appointed Farouk Yahaya As New Chief Of Army Staff – Minister Of Defence",
    "summarized_story": "The Minister of Defence, Bashir Salihi-Magashi has defended the decision of President Buharu to appoint Major General Farouk Yahaya as the new Chief of Army Staff.\nMagashi explained that Buhari didn’t consider ethnic or religious factors but rather national interest in choosing the new Army Chief.\nRecall that Presisent Buhari on Thursday appointed Major General Farouk Yahaya as the new Chief of Army Staff to replace the late Lt-Gen Ibrahim Attahiru who died last week in a military plan crash in Kaduna.\nThe Minister describe Yahaya as the best first for the job and expressed confidence in the ability of the new Chief of Staff to deliver.\n“The appointment of General Yahaya, President Buhari has expediently put national interest above ethnic and religious chauvinism by fulfilling all requirements necessary."
  },
  {
    "headline": "BREAKING: New COAS, Farouk Yahaya Resumes",
    "summarized_story": "On Friday, Major General Farouk Yahaya took over as the nation’s 22nd Chief of Army Staff.\nYahaya was sworn in at the Army Headquarters in Abuja during a ceremony.\nWhen he arrived, he first went to the sentry to view the guard of honour, after which he went to the conference room.\nHe led others in observing a minute of silence before the start of the program in memory of his late predecessor and ten others who died in a plane tragedy last Friday.\nFirst photo of the new COAS sitting at his official desk."
  },
  {
    "headline": "Ex-President, Jonathan, bags new crucial appointment",
    "summarized_story": "The Economic Community of West African States (ECOWAS) has appointed Nigeria’s former president Goodluck Jonathan as chairman of the ECOWAS Council of the Wise.\nECOWAS disclosed the appointments in a statement published on its website after a two-day meeting which ended on May 25, 2021, in Ghana.\nAs special envoy, Jonathan had helped ECOWAS to facilitate dialogue with all principal stakeholders in Mali’s leadership crisis.\nAccording to ECOWAS, the council which was established in 1999 had been lying dormant for years, but was reconstituted lately due to the recent socio-political crisis across the region.\nAmong the topical challenges bedeviling the West Africa region including Nigeria are terrorism and social unrest."
  },
  {
    "headline": "VIDEO:#MilitaryAppreciationDay: Nigerians honor late COAS Attahiru, military personnel",
    "summarized_story": ""
  },
  {
    "headline": "#MilitaryAppreciationDay: Nigerians honor late COAS Attahiru, military personnel",
    "summarized_story": ""
  },
  {
    "headline": "Stolen Artefacts: ARAN commends FG’s recovery efforts -NigPilot",
    "summarized_story": "Rescuers Association of Nigeria, (ARAN) a body responsible for the rescue of Nigeria artifacts and its patrimonies has commended Minister of Information and Culture, Alhaji Lai Mohammed, over his recent call for all artifacts looted from Nigeria by foreigners to be returned.\nThe President, Obalosa Bamidele made the commendation in Abuja on Monday while speaking with journalists saying that Alhaji Mohammeds’ call is yielding fruitfulness with some foreign institutions with the nations’ patrimonies agreeing to negotiate with the country for possible returns.\nHe said with the renewed calls for the repatriation of all looted Nigeria artifacts , with passion and commitment of the Minister, there is hope that “most stolen riches of the country will find its way back.”Recall that the Federal Government launched campaign for the repatriation of looted artefacts from the country in 2019 which yielded fruitfully with spate of return of stolen Nigerian antiquities from around the world.\nThe German Government and Museums, both of which are currently at the forefront of repatriating the nations’ antiquities set the stage for a global movement to restitute colonial loot with its March announcement that it planned to hand over some Benin bronze to Nigeria.\nAlso, the Jesus College at the University of Cambridge has pledged to return a bronze cockreal along with the University of Aberdeen in Europe, committed in returning a Benin bronze, head of an oba (king) in its possession, acquired in a way that is considered extremely immoral."
  },
  {
    "headline": "FG reiterates commitment to effective waste management system -NigPilot",
    "summarized_story": "Minister for Environment, Dr Muhammad Mahmoud Abubakar has said that the Federal Government is committed to an effective waste management system in Nigeria.\nThe Minister stated this at the 3rd International Waste Summit 2021, organised by the Waste Management Society of Nigeria, WAMASON, held in Port Harcourt, Rivers State.\nAbubakar noted that the Federal Government is seeking greater partnership with professional bodies like WAMASON on useful ideas on effective waste management in the country.\nHe stressed that youths could benefit through all the stages of waste management, from sorting, storage, transporting to treatment.\nIn achieving an effective waste management system, the Minister stated that the federal government will continue to develop policies to ensure that actions towards waste management are profitable."
  },
  {
    "headline": "NAPTIP DG calls for implementation of policies for protection of children",
    "summarized_story": "Director-General of the National Agency for the Prohibition of Trafficking in Persons, NAPTIP, Imaan Sulaiman – Ibrahim has called for the strengthening of policies, programs, and legal instruments that will further enhance the protection of Children in the Country.\nThe NAPTIP boss said “I join millions of Nigerians across the globe in wishing our children a Happy Children’s Day.\nQuite a large number of Nigerian children have fallen victims of illicit commercial activities which include human trafficking, sexual exploitation domestic servitude, and street begging.\n“It is therefore imperative that parents work closely with NAPTIP and other law Enforcement Agencies in ensuring that perpetrators of evil acts towards our children are reported in order to ensure that such perpetrators are brought to book.\n“NAPTIP on its part shall continue to work assiduously towards the protection of our children,” she said."
  },
  {
    "headline": "Children’s Day: UNICEF calls for protection of child rights -NigPilot",
    "summarized_story": "Commemorating the event of the Children’s Day, the United Nations Children’s Fund, UNICEF, has advocated the need to reinforce protection mechanisms for children especially at a challenging moment for child rights in the country and the world, with the COVID-19 pandemic threatening gains made for children’s development.\n“As we rightfully celebrate Nigerian children today, let us also remember that the COVID-19 crisis has been a child rights crisis – in Nigeria and around the world.\n“On this Nigerian Children’s Day, let us all agree that we cannot let one crisis compound another.\n“Violence is perpetrated against one in four Nigerian children – and one in three Nigerian girls is sexually abused.\n“Nigerian children are resilient, talented and aspire to do great things."
  },
  {
    "headline": "Buhari Takes Second Dose Of COVID-19 Vaccine",
    "summarized_story": "President Muhammadu Buhari has received his second dose of the AstraZeneca COVID-19 vaccine.\nThe President took the shot at the Presidential Villa in Abuja.\nThe second dose is being administered exactly 12 weeks after the first shot was taken on March 6.\nThe President’s innoculation was done by the Chief Personal Physician to the President, Dr. Suhayb Rafindadi Sanusi after which he was presented with the e-vaccination card by the executive director of the National Primary Health Care Development Agency, Dr. Faisal Shuaib.\nMore to follow…"
  },
  {
    "headline": "Troops Eliminate 10 Boko Haram Terrorists, Repel Attack On Rann",
    "summarized_story": "Barely hours after the newly appointed Chief Of Army Staff (COAS) Major General Faruk Yahaya assumed office, troops of the Nigerian Army repelled an attack by Boko Haram terrorists in Rann, Borno State, killing 10 of the terrorists in the process.\nAccording to a statement signed on Saturday by Army spokesperson, Brigadier General, Mohammed Yerima, the terrorists came in their numbers mounted on gun trucks and attempted to infiltrate the main entrance to the town.\nThe new COAS, Faruk Yahaya, on Friday assumed duty at the Army headquarters in Abuja.\nHe was appointed by President Muhammad Buhari on Thursday, making him the 22nd Chief of Army Staff in the country.\nUntil his appointment, the new army chief was the Theatre Commander of Operation Hadin Kai, the counter-insurgency operation in the North-East."
  },
  {
    "headline": "Supreme Court Dismisses APC Forgery Suit Against Obaseki",
    "summarized_story": "The Supreme Court has dismissed the All Progressives Congress’ (APC) forgery suit against the Edo State Governor, Godwin Obaseki.\nThe court dismissed the suit for lack of merit.\nIt was filed against Governor Obaseki, the Peoples Democratic Party (PDP) and the Independent National Electoral Commission (INEC).\nThe apex court’s judgement comes two days after the Court of Appeal in Benin upheld the victory of Governor Obaseki of Edo at the 2020 governorship election.\nIn its ruling, the appellate court held that Obaseki did not forge his certificates with which he contested the 2020 governorship election."
  },
  {
    "headline": "Diezani Forfeited Jewellery Worth N14.4bn, Houses Valued At $80m – EFCC",
    "summarized_story": "The Chairman of the Economic and Financial Crimes Commission (EFCC), Abdulrasheed Bawa has disclosed that the jewellery forfeited by the former Minister of Petroleum Resources Diezani Alison-Madueke is worth N14.4 billion.\nThe EFCC chairman stated this on Friday when he appeared before the House of Representatives ad-hoc committee investigating the assessment and status of recovered loot.\nHe said the “jewellery forfeited from the former minister has been valued by relevant government agencies and the estimated value of the jewellery is 14.4 billion naira.”Bawa also noted that the estimated value of the houses seized and forfeited from Diezani is $80 million.\nREAD ALSO: EFCC Hands Over Diezani’s Forfeited Property To Lagos For Isolation CentreEarlier this year, the EFCC handed a property forfeited by the former minister to the Lagos Government for use as an isolation centre for COVID-19 patients.\nThe six flats of three bedrooms and a boys’ quarter had been forfeited to the Federal Government, following an order of a Federal High Court in Lagos in 2017."
  },
  {
    "headline": "China Censors Lady Gaga And Justin Bieber From ‘Friends’ Episode",
    "summarized_story": "Chinese fans of the popular sitcom “Friends” were furious after censors cut guest stars Lady Gaga, Justin Bieber and Korean boyband BTS from the much-awaited reunion episode.\nLady Gaga was banned from touring China in 2016 after she met with the exiled Tibetan spiritual leader Dalai Lama, who has been labelled as a separatist by Beijing.\nChinese streaming services iQiyi, Youku and Tencent Video did not answer AFP queries about what prompted the censorship.\n“I was waiting for weeks to watch the Friends reunion only to find that the version streamed in China was all mangled,” wrote one user.\nEarning the wrath of Chinese authorities has become costly for entertainers after China became the world’s box office last year surpassing the United States."
  },
  {
    "headline": "Zamfara in dire need of additional troops over escalation of banditry – Govt",
    "summarized_story": "Zamfara State Government said there are forces who are bent on frustrating its efforts in addressing the security challenges bedeviling the state.\nThe government said the recent resurgence and escalation of attacks by armed bandits in some parts of the State is worrisome.\nIt is inconceivable that these attacks have been conducted despite the effective deployment of troops across all the blackspots in the State”.\nThey want the federal government to as a matter of urgency deploy more troops for quicker response to all security threats especially in troubled areas.\nHence, all commanders deployed in the state are enjoined to take necessary measures that will ensure rapid response to distress calls”."
  },
  {
    "headline": "APC primaries yet to start in Surulere due to delays",
    "summarized_story": "The APC primaries scheduled for today is yet to start in several wards on Surulere.\nA visit by our correspondent shows that electoral officers are yet to get to the venue.\nMeanwhile party leaders at Ward F2 walked out some intruders who came in as party members with names written in pieces of papers.\nAdvertisementThe party leaders are alleging that these people were brought in to cause mayhem at the ward.\nFor now, peace has been restored in the ward as members await the arrival of the electoral umpire."
  },
  {
    "headline": "Mali Court Appoints 38-year-old Coup Leader Assimi Goita Interim President",
    "summarized_story": "Mali’s constitutional court has named the colonel who led a military coup this week as the country’s new interim leader.\nLast August, the young colonel led a coup that deposed Mali’s elected President Ibrahim Boubacar Keita amid protests against perceived corruption and the government’s failure to quell armed groups.\nThe colonel was then appointed vice president of the interim government and his fellow soldiers were given key cabinet posts.\nAt the time, mediators from the 15-member Economic Community of West African States (ECOWAS) insisted that Mali’s transition, which is due to end with elections in February, remain civilian-led.\nThe bloc stipulated in a joint declaration that the vice president of the transition “cannot under any circumstances replace the president”."
  },
  {
    "headline": "In Victory for Trump, Republicans Block Probe of US Capitol Riot",
    "summarized_story": "Senate Republicans chose to defend the Big Lie because they feared that anything that might upset Donald Trump could hurt them politically,” Senate Democratic Leader Chuck Schumer said after the vote.\nThe proposed commission would have had the power to force witnesses, possibly including Trump, to testify under oath about what happened that day.\nTrump had urged Republican lawmakers to vote against it and warned of “consequences” for those who supported it.\nSenate Democrats have been under pressure from activists on the left to scrap the chamber’s longstanding supermajority rule, but have so far declined to do so.\nThe proposal previously passed the House of Representatives with the support of all Democrats and 1 in 6 Republicans after bipartisan negotiations."
  },
  {
    "headline": "Tyson Fury’s Father Wants Him To Give Up WBC Belt and Fight Anthony Joshua, Not Wilder",
    "summarized_story": "Tyson Fury should give up his WBC belt to avoid fighting Deontay Wilder and face Anthony Joshua instead, his father John says.\nA unification fight with Joshua was set to happen on 14 August in Saudi Arabia.\n“I’ve told him, in a phone conversation, to chuck the belt in the bin,” John Fury told BT Sport.\n“Let them have it, come back and fight AJ on the 14 August like was planned.\nHe was fighting AJ, I want him to fight AJ, I’ve no interest in Deontay Wilder, so why’s he going to fight Wilder?"
  },
  {
    "headline": "Chelsea Face a ‘Completely Different Man City Beast’ in Champions League Final",
    "summarized_story": "Manchester City will be a “completely different beast” to the side beaten twice by Chelsea in the past few weeks when the two meet in the Champions League final, says Jermaine Jenas.\nChelsea have defeated Premier League champions City in the FA Cup and the league in the past six weeks.\n“I don’t think Chelsea can take much from those games,” said Jenas.\n“In the semi-final, City had Gabriel Jesus, Raheem Sterling and Ferran Torres up top,” he added.\n“But if City put out their strongest team I think Chelsea are in big trouble.”"
  },
  {
    "headline": "Nigeria: Anti-graft Agency Estimates Value of Ex-Oil Minister Diezani Madueke’s Jewellery at $35m",
    "summarized_story": "Nigeria’s Economic and Financial Crimes Commission (EFCC) on Friday revealed that the estimated value in Naira of jewellery seized from former petroleum minister, Diezani Alison-Madueke is N14.4 billion (about $35m).\nBawa also said the total assets seized from the former minister was estimated at N46 billion (about $111m).\nThe EFCC boss said though they got the forfeiture order for assets recovered from the former Petroleum Minister in 2019, they were yet to be auctioned.\nHe stated: “The estimated value of Diezani Allison’s jewellery in naira is N14.4 billion.\nThe estimated value of houses for the former Minister of Petroleum, Diezani Allison is worth $80 million”."
  }
]