[
  {
    "headline": "Breast cancer spreads faster in men than women, affects older men more –Physicians",
    "summarized_story": "“If you see a patient with breast cancer, you’d still see the breast so flat so it is not because their breast is more voluminous than the average man’s breast, no,” he said.\nHe noted that breast cancer in men has the same features as breast cancer in women.\nHe also pointed to the fact that due to the less occurrence of breast cancer in men, there are more drugs targeted at the treatment for breast cancer in men than there are for men.\n“Men have less protruding breast so the breast cancer tends to eat through the breast fast and get to the body wall.\nSpeaking on the treatment for breast cancer in men, Ezeome, who is also a Consultant Surgeon and the Director of the Oncology Centre, University of Nigeria Teaching Hospital, Enugu, said the treatment for most men with breast cancer is breast removal."
  },
  {
    "headline": "Breast cancer spreads faster in men than women, affects older men more –Physicians",
    "summarized_story": "“If you see a patient with breast cancer, you’d still see the breast so flat so it is not because their breast is more voluminous than the average man’s breast, no,” he said.\nHe noted that breast cancer in men has the same features as breast cancer in women.\nHe also pointed to the fact that due to the less occurrence of breast cancer in men, there are more drugs targeted at the treatment for breast cancer in men than there are for men.\n“Men have less protruding breast so the breast cancer tends to eat through the breast fast and get to the body wall.\nSpeaking on the treatment for breast cancer in men, Ezeome, who is also a Consultant Surgeon and the Director of the Oncology Centre, University of Nigeria Teaching Hospital, Enugu, said the treatment for most men with breast cancer is breast removal."
  },
  {
    "headline": "I spent over $3m on more than 100 surgeries, dialysis — Broadcaster Ugolee recounts 10-year battle with kidney disease",
    "summarized_story": "Victoria EdemeBroadcaster and voice actor, Emma Ugolee, has recounted how he spent over $3m and endured more than 100 surgeries as he battled kidney disease for 10 years.\nUgolee took to his Instagram page on Monday to detail how he went through thousands of hours of dialysis across four continents, expressing gratitude to God for helping him to “beat” the disease.\nYour money or your life was no more an exclusive request from a robbery scene.\n“Ten years, four continents, literally over 3 million dollars, thousands of hours of dialysis, over 100 surgeries & procedures & several graveside visits.\nShook His head at the sure expectations of those hoping for a sad end & smiled at my audacity to hold on to hope."
  },
  {
    "headline": "I spent over $3m on more than 100 surgeries, dialysis — Broadcaster Ugolee recounts 10-year battle with kidney disease",
    "summarized_story": "Victoria EdemeBroadcaster and voice actor, Emma Ugolee, has recounted how he spent over $3m and endured more than 100 surgeries as he battled kidney disease for 10 years.\nUgolee took to his Instagram page on Monday to detail how he went through thousands of hours of dialysis across four continents, expressing gratitude to God for helping him to “beat” the disease.\nYour money or your life was no more an exclusive request from a robbery scene.\n“Ten years, four continents, literally over 3 million dollars, thousands of hours of dialysis, over 100 surgeries & procedures & several graveside visits.\nShook His head at the sure expectations of those hoping for a sad end & smiled at my audacity to hold on to hope."
  },
  {
    "headline": "Farmers in Nigeria, Uganda, others benefit from AATF’s mechanized 65,300 hectares of land in 5 years",
    "summarized_story": "Impacts 850, 000 smallholder farmersBy Gabriel Ewepu – AbujaAs Nigerians agonize under the heavy burden of high cost of food, the African Agricultural Technology Foundation, AATF, yesterday, disclosed that farmers in Nigeria, Uganda and Zambia have benefited from its mechanized 65, 300 hectares of land in five years.\nHe added that the Foundation is resilient in the vanguard of mechanized farming activities including agro-processing through CAMAP and AgriDrive.\nFANRPAN Policy Dialogue is an annual event that brings Governments and other agricultural policy stakeholders together on agricultural transformation in Africa.\nHe said: “At AATF, we continue to witness the transformative power of technologies when placed in the hands of small-holder farmers,” he said.\nThese varieties are suited to different agro-ecological zones and with the potential to increase maize yields by 40-60 per cent."
  },
  {
    "headline": "BREAKING Facebook back after hours of global outage",
    "summarized_story": "By Arogbonlo IsraelFacebook has been restored hours after being hit by global outage.\nVanguard reports the three apps (Facebook, Instagram and WhatsApp) owned by Facebook, and run on shared infrastructure, all completely stopped working shortly before 5pm (NGT) on Monday.\nOther products that are part of the same family of apps, such as Facebook Workplace, also stopped working amid the global outage.\nThis is not the first time the social networking apps have suffered an outage this year.\nUsers were not able to send messages, receive messages on Whatsapp, as all the messages and chats were left undelivered."
  },
  {
    "headline": "Zuckerberg loses $6bn in hours, drops to 5 on Billionaires Index",
    "summarized_story": "The drastic reduction in his net worth was largely due to a revelation by a whistleblower and also outages that affected Facebook Inc.’s flagship products.\nThe flagship products include Facebook, Facebook Messenger, Instagram, and WhatsApp.\nThe stock slide on Monday sent Zuckerberg’s worth down to $121.6 billion, dropping him below Bill Gates to No.\nHe’s down from almost $140 billion in a matter of weeks, according to the index.\nIn response, Facebook has emphasized that the issues facing its products, including political polarization, are complex and not caused by technology alone."
  },
  {
    "headline": "Sanwo-Olu advocates 42% revenue allocation to states",
    "summarized_story": "Governor Babajide Sanwo-Olu of Lagos State on Monday advocated an upward review to 42 per cent of the revenue accruing to states from the Federation Account.\nSanwo-Olu made the call at a two-day South-West Zonal public hearing on Review of Allocation formula by the Revenue Mobilization Allocation and Fiscal Commission (RMADC).\n“Nigerian fiscal federalism should be adjusted to develop more expenditure responsibilities with appropriate revenue allocation to lower levels of government.\n“The Lagos State Government proposed revenue allocation formula: Federal government: 34 per cent, State government 42 per cent, local government councils: 23 per cent and Lagos State (Special Status, 1 per cent).\n“Therefore, in line with current realities, it is very important that the federal government review the revenue allocation formula."
  },
  {
    "headline": "South-South Govs urge Buhari to comply with law, inaugurate NDDC board",
    "summarized_story": "For the umpteenth time this year, the South-South Governors of the Niger Delta region have spoken again, and have urged President Muhammadu Buhari “to uphold the law establishing Niger Delta Development Commission (NDDC) by appropriately constituting its governing board.”Speaking after their meeting in Government House, Port Harcourt, Rivers state capital on Monday, October 4, 2021, the Chairman of the South-South Governors forum, Governor Ifeanyi Okowa of Delta State also expressed the hope that the federal government would make the forensic audit report public and “deal justly and fairly with the report with a view to strengthen the capacity of NDDC to meet its obligation to the people of the region.”Recall that earlier in the year, the Governors of the South-South States, speaking the minds of the agitated and deprived people of the oil-rich Niger Delta region had stated clearly that the current sole administrator/ interim contraptions in NDDC does not comply with the NDDC Act which requires representation of the constituent states.\nThe President said: ‘‘Based on the mismanagement that had previously bedeviled the NDDC, a forensic audit was set up and the result is expected by the end of July, 2021.\nI want to assure you that as soon as the forensic audit report is submitted and accepted, the NDDC Board will be inaugurated.”The report of the forensic audit of NDDC was submitted by Minister of Niger Delta Affairs, Senator Godswill Akpabio, to President Buhari since September 2, 2021.\nMore than one month after submission of the forensic audit report, there is increasing tension in the Niger Delta region over the delay in inaugurating members of the board of the Commission.\nThe South-South Governors’ meeting of October 4, 2021 was presided over by the Chairman of the Forum, Governor Ifeanyi Okowa, and attended by the Governors of Rivers State, Nyesom Wike, Bayelsa state, Duoye Diri, Akwa Ibom State, Emmanuel Udom, and Edo State, Godwin Obaseki."
  },
  {
    "headline": "Federation Allocation: FG should stop getting lion’s share, States deserve 42 percent – Sanwo-Olu",
    "summarized_story": "Lagos Governor, Babajide Sanwo-Olu has called for a review that will allow states to get 42 per cent of revenue in the Federation Account.\nThe governor spoke on Monday at the South-West Zonal public hearing on Review of Allocation formula by the Revenue Mobilization Allocation and Fiscal Commission (RMAFC).\nIn the current sharing formula, the Federal Government takes 52.68 per cent, states 26.72 per cent, local governments 20.60 per cent and 13 per cent derivation for oil producing states.\nThe governor said the Nigerian fiscal federalism should be adjusted to develop more expenditure responsibilities with appropriate revenue allocation to States and LGs.\nThe Lagos helmsman stressed the need to reverse the age-long fiscal dominance by the federal government in order to re-establish a true federal system."
  },
  {
    "headline": "South South Governors set to launch regional security outfit",
    "summarized_story": "Governors of the south-south region of Nigeria have reiterated the approval of a regional security outfit.\nThe governors under the umbrella of the south-south governors forum, however, did not disclose when the security outfit will be launched.\nThe governors took the decision during a meeting of the forum in Port Harcourt on Monday.\nAmongst other resolutions passed at the meeting, the forum also resolved that the governments of the states in the region would join in the suit challenging the collection of Value Added Tax (VAT) by state governments.\nCross Rivers State Governor, Ben Ayade was, however, absent from the meeting."
  },
  {
    "headline": "Women group demands compensation from govt over demolished properties in Imo",
    "summarized_story": "The women group also gave an insight on the dangers of rising insecurity and extra-judicial killings in the state and advocated for sustained efforts to check the trend.\n”“The NFF believes that leaving women out of peace and security processes has hindered communities from finding long-lasting peace.\n”The group observed that Imo State and southeast have come under heavy attacks and insurgency since the outbreak of covid-19 and invasion of the Owerri Correctional Centre.\n“When women are part of peace process, they know and include real victims of violence, conflict, and insecurity in the compensation process.\nSpeaking earlier Blessing Azubuike, Director of Gender in the Ministry of Women Affairs and Vulnerable Groups, advocated for women involvement in peace and security processes, and the measures that can create spaces for women in peace building."
  },
  {
    "headline": "Alleged N69bn debt: Court fixes Jan 24 for AMCON’s suit against Jimoh Ibrahim",
    "summarized_story": "A Federal High Court in Abuja has fixed January 24, 2022 for a suit filed by the Asset Management Corporation of Nigeria (AMCON) for a stay of execution of orders granted Jimoh Ibrahim over alleged N69billion debt.\nOn Monday, Justice Okon Abang fixed the date after AMCON’s request for reconsideration of the Court of Appeal verdict.\nThe adjourned date would either be to mention the suit or abide by the decision of the Court of Appeal.\nNAN reports that AMCON was not in court while Ibrahim was represented by Oladele Oyelami, who held brief for Adeniyi Akintola (SAN).\nAMCON, through its lawyer, Ade Adedeji (SAN) indicated intention appeal the orders made in favour of Ibrahim and his companies."
  },
  {
    "headline": "Proliferation of arms: Why Nigeria must domesticate ECOWAS treaties urgently – NATFORCE DG",
    "summarized_story": "The acting Director-General of National Taskforce, Baba Mohammed, said Nigeria must domesticate ECOWAS treaties and conventions because of the alarming proliferation of arms, and weapons into the country.\nThe acting DG said Nigeria was the biggest recipient of illegal arms, saying NATFORCE’s responsibility is to synergise with other security agencies in tackling proliferation.\nAlhaji Abdullahi who spoke on behalf of the DG, revealed that he is also a member of the governing body of Natforce which is aimed at combating illegal arms, small and light weapons and ammunition.\nHe expressed optimism that the bill will translate into an act, given that all security agencies and paramilitary organisations lent their support.\n“This bill today is Nigeria’s resident home of ECOWAS and with the outbreak of illegal weapons in Africa, Nigeria needs to act urgently."
  },
  {
    "headline": "Hello world! – thenationonlineng.net",
    "summarized_story": "Welcome to WordPress.\nThis is your first post.\nEdit or delete it, then start writing!"
  },
  {
    "headline": "Hello world! – thenationonlineng.net",
    "summarized_story": "Welcome to WordPress.\nThis is your first post.\nEdit or delete it, then start writing!"
  },
  {
    "headline": "Respite as resident doctors suspend strike after 63 days",
    "summarized_story": "From Fred Ezeh, AbujaResident doctors, under the umbrella of National Association of Resident Doctors (NARD) have suspended their nationwide strike.\nSecretary General of the Association, Dr. Suleiman Abiodun, said the decision to suspend the strike was taken by members of the National Executive Council (NEC) at a meeting held virtually between Friday and Sunday.\nHe said after extensive deliberations on the nationwide strike and other developments concerning the doctors, 56 chapters of the association voted for the suspension of the nationwide strike, 28 voted for its continuation while five chapters were absent.\nNARD also insisted that salary shortfalls of 2014, 2015, and 2016, owed members in state and federal health institutions be paid.\nSince the commencement of the strike by NARD, healthcare delivery in state and federal public health facilities has remained epileptic with only consultants and NYSC doctors available in most facilities to cater to the health needs of the public."
  },
  {
    "headline": "Ndubuisi Kanu’s burial activities begin tomorrow",
    "summarized_story": "The weeklong activities leading to the burial of the late Naval Chief, Rear Admiral Godwin Ndubuisi Kanu (retd) commences tomorrow at the Onikan Stadium Lagos with a day of tributes to be hosted by the government and people of Lagos State.\nIn a burial programme released by the Central Burial Committee, the day of tributes will be followed by an interdenominational church service at Government House Chapel, Alausa on Thursday and commendation service at the Methodist Church Cathedral, Tinubu Lagos on Friday, October 8.\nAccording to the Committee, the body of the late renowned pro-democracy activist and Chieftain of NADECO would depart Murtala Muhammed International Airport, Ikeja on Wednesday October 13, 2021 to Owerri, Imo State for a continuation of rites of passage to be hosted by the Governor and people of Imo State where late Admiral Kanu served as the first Military Administrator.\nThe final leg of the state burial activities would be hosted by the Government and people of Abia and Ebonyi States in Umuahia on Thursday October 14 while his body would be committed to mother earth on Friday October 15 after a commendation service at Civic Centre, Ohoroho Ovim, Abia State100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection.\nClick here ."
  },
  {
    "headline": "Impact of Facebook shutdown to global economy",
    "summarized_story": "Facebook, Instagram and WhatsApp and Facebook Messenger are down for users around the world, with the first report of problems coming in two hours ago.\nNetBlocks, which tracks internet outages and their impact, estimate the two hour plus outage has already cost the global economy $160m (£117 million), and sent the Facebook share price down by more than five per cent.\nIt wasn’t just the main Facebook apps going down, other services, including Facebook Workplace and the Oculus website were also down.\nThere have been a number of social media outages in recent months, with Instagram going down for 16 hours just last month, and all Facebook platforms down in June.\nOn Twitter, Facebook communications executive, Andy Stone said they were aware some people were having trouble accessing Facebook apps and products."
  },
  {
    "headline": "BREAKING: Panic in Imo as gunmen force Imo residents to sit-at-home – The Sun Nigeria",
    "summarized_story": "From Stanley Uzoaru, OwerriPalpable fear gripped residents of Imo State on Monday as gunmen forcefully enforce the sit-at-home directive of the Indigenous People of Biafra(IPOB).\nMost residents who had resumed at various places of their establishments before 8 am were said to have been sent back home by the gunmen wielding sophisticated weapons.\nParents were seen hurrying to pick their children from their various schools as at 9 am while those who could not wait for their parents to come ran away from fear.\nAt Orogwe/Ndegwu road,two vehicles reportedly ran into each other while hurrying to pick their children from school.\nSome of the tertiary institutions in the State also hurriedly shutdown amidst the pandemonium caused by the gunmen."
  },
  {
    "headline": "Anambra boils, Joe Igbokwe’s home burnt, DSS, FRSC offices attacked",
    "summarized_story": "From Obinna Odogwu, AwkaA stalwart of the All Progressives Congress (APC), Joe Igbokwe, yesterday, accused the Indigenous People of Biafra (IPOB) of torching his country home in Nnewi, Anambra state.\nIgbokwe wrote: “IPOB invaded my house in Nnewi about now.\nI am sure they (razed) down my house, (given) the jerrycans of petrol I saw being offloaded from their Sienna car via CCTV.\nHe, however, declined to mention the name of the place attacked and the mastermind.\nThe place has been cordoned off.”Asked the name of the place that was attacked, he said: “I have not gotten any detail in that regard."
  },
  {
    "headline": "Facebook, WhatsApp, Instagram Experience Global Outage",
    "summarized_story": "Emma OkonjiThe links to all three apps of WhatsApp, Instagram and Facebook, Monday evening, went down globally, making it difficult for its global users, Nigerians inclusive, to access the apps.\nAll three apps, which are owned by Facebook and run on shared infrastructure, stopped working completely Monday before 5pm Nigerian time.\nThe situation has made it extremely difficult for global users of Facebook, WhatsApp and Instagram to access their social media platforms.\nWhen contacted, spokesperson for Facebook Nigeria, said Facebook was aware of the challenge and had issued a statement, while trying to identify and fix what must have triggered the outage.\nPart of the statement issued by Facebook Spokesperson, Andy Stone, reads: “We are aware that some people are having trouble accessing our apps and products."
  },
  {
    "headline": "Army Launches Operation Still Waters, Charges Troops to be Ruthless with Criminals",
    "summarized_story": "At the launch in Lagos, troops deployed for the exercise were charged to be ruthless with criminals disturbing the peace and security of both states.\nHowever, they were mandated to respect the rights of law abiding citizens and adhere to the rules of engagement guiding the field exercise.\nHe said during Operation Still Waters, formerly codenamed Exercise Crocodile Smile, troops were expected to practice what they had learnt in the classrooms to better prepare them on how to tackle criminal elements.\n“If we also have the security agencies on the street conducting exercises it would go a long way at deterring criminal activities in our society.\n“Test unit and sub unit commanders aspect of counter terrorism and counter insurgency operation, and test unit and sub unit commanders on inter service core operation and cooperation with other sister agencies in military operations other than war…” he said."
  },
  {
    "headline": "South South Govs Resolve to Join VAT Suit in Supreme Court",
    "summarized_story": "The governors from Rivers, Edo, Bayelsa, Akwa Ibom and Delta States who made the declaration on Monday, after a closed-door meeting at the Rivers State Government House, Port Harcourt, resolved to join the suit before the Supreme Court on VAT.\nThe resolutions of the governors was presented the newsmen by Delta State Governor, Ifeanyi Okowa.\nThey said that the South South states had established their security organs which will soon be launched.\n“The South South Governors Forum met on Monday, October 4, 2021 at the conference room of the Rivers State Government House, Port Harcourt.\n“An equivocally support for state to collect Valued Added Tax (VAT) and Resolve to join the suit before the Supreme Court."
  },
  {
    "headline": "Breaking: South South Govs Arrive Port Harcourt for Crucial Meeting",
    "summarized_story": "By Blessing IbungeFive Governors of the South-South states have just arrived Port Harcourt, Rivers State capital for a crucial meeting.\nThe governors were received by the Rivers State Governor, Nyesom Wike, at the state Government House Port Harcourt.\nThe governors that have arrived are Edo Governor, Godwin Obaseki; Delta state Governor, Ifeanyi Okowa; Bayelsa Governor, Douye Diri and Akwa Ibom Governor, Emmanuel Udom.\nIt is believed that the forum is meeting in Rivers to discuss issues connected to VAT, politics and security.\nWhie the five South South governors that are now in Port Harcourt are members of the opposition Peoples Democratic Party, Ayade recently defected from PDP to the ruling All Progressives Congress."
  },
  {
    "headline": "Unapologetic Frontrunners Emerge for PDP’s Ticket",
    "summarized_story": "Chuks OkochaLast week’s zoning of the Peoples Democratic Party (PDP) national chairman to the north, which brightened chances that the presidential ticket of the party could go to the south, has thrown up five possible presidential frontrunners.\nWith the presidency most likely coming south at least following PDP’s decision last week to zone Chairmanship to the north, these frontrunners have begun to see themselves as potential candidates for the PDP ticket.\nUdom EmmanuelThe Akwa Ibom State Governor, Udom Emmanuel, has shown capacity since he took over from his predecessor and Minister for Niger Delta, Senator Godswill Akpabio.\nBesides, he was a major arrowhead for the Southern presidency and indeed, headed the group that insisted the chairmanship must be zoned to the north.\nCuriously, Makinde is the only first time governor amongst those in this category of PDP frontrunner for the presidency."
  },
  {
    "headline": "Members Of Apostle Suleman's Church Threaten To Kill YouTuber For Exposing Cleric's Miracle Money Scam",
    "summarized_story": "A YouTuber, Israel Balogun who runs the Wholeness Africa Initiatives channel, has alleged death threats to his life by members of the Omega Fire Ministries led by Apostle Johnson Suleman over a 'Miracle Money' scandal.\nBalogun, in the video, that has generated controversies, had said there was nothing like miracle money but a planned scheme to make people believe angels were dropping money into their accounts.\nHe also alleged that the pastor and ministers of the church will use such tactics to take double of such amounts from church members who received the miracle money.\nSuleman said again, \"Miracle alert, as you get it, run here.\nGod does not deposit money in people's accounts, angels do not share money."
  },
  {
    "headline": "Members Of Apostle Suleman's Church Threaten To Kill YouTuber For Exposing Cleric's Miracle Money Scam",
    "summarized_story": "A YouTuber, Israel Balogun who runs the Wholeness Africa Initiatives channel, has alleged death threats to his life by members of the Omega Fire Ministries led by Apostle Johnson Suleman over a 'Miracle Money' scandal.\nBalogun, in the video, that has generated controversies, had said there was nothing like miracle money but a planned scheme to make people believe angels were dropping money into their accounts.\nHe also alleged that the pastor and ministers of the church will use such tactics to take double of such amounts from church members who received the miracle money.\nSuleman said again, \"Miracle alert, as you get it, run here.\nGod does not deposit money in people's accounts, angels do not share money."
  },
  {
    "headline": "How Pastor Enenche Of Dunamis Church Invited Security Operatives To Arrest #BuhariMustGo Activists—DSS Reveals",
    "summarized_story": "SaharaReporters learnt on Tuesday that the DSS had admitted that the Dunamis church called them to take away the \"suspects.\"\nSee Also Christianity Whereabouts Of Six #BuhariMustGo Protesters Arrested In Dunamis Church Unknown As DSS Denies Involvement“About 48 hours after illegal arrest and detention by Dunamis church, we don’t know the whereabouts of these #BuhariMustGo activists,” one of the sources said.\nEarlier, the FCT command of the DSS as well as the headquarters had both denied being in custody of five activists arrested by Dunamis church security.\nSee Also ACTIVISM You Had No Right To Arrest Activists For Wearing #BuhariMustGo T-shirts—Lawyer Slams Pastor Enenche, Dunamis Church\"The five activists arrested at Dunamis are being detained by DSS director of FCT.\nWhile clarifying the matter, Sowore said the pastor denied claims by some persons that the activists were trying to disrupt the church service."
  },
  {
    "headline": "How Pastor Enenche Of Dunamis Church Invited Security Operatives To Arrest #BuhariMustGo Activists—DSS Reveals",
    "summarized_story": "SaharaReporters learnt on Tuesday that the DSS had admitted that the Dunamis church called them to take away the \"suspects.\"\nSee Also Christianity Whereabouts Of Six #BuhariMustGo Protesters Arrested In Dunamis Church Unknown As DSS Denies Involvement“About 48 hours after illegal arrest and detention by Dunamis church, we don’t know the whereabouts of these #BuhariMustGo activists,” one of the sources said.\nEarlier, the FCT command of the DSS as well as the headquarters had both denied being in custody of five activists arrested by Dunamis church security.\nSee Also ACTIVISM You Had No Right To Arrest Activists For Wearing #BuhariMustGo T-shirts—Lawyer Slams Pastor Enenche, Dunamis Church\"The five activists arrested at Dunamis are being detained by DSS director of FCT.\nWhile clarifying the matter, Sowore said the pastor denied claims by some persons that the activists were trying to disrupt the church service."
  },
  {
    "headline": "Nigeria Is Using Evil, Jihadist Constitution That Places Us Under One Tribe— Cleric",
    "summarized_story": "He described the current 1999 constitution as “a fraud, a jihadist constitution, an oligarchy constitution” which places everybody in the country under one tribe.\nThere are only 10, 000 wards in Nigeria where decisions of those who rule this country are made.\n“It's not just deliver Nigeria, deliver Nigeria, it should be God wake up your church.\nWe can't change Nigeria except we change the National Assembly.\nThis evil law is called Constitution, this is the Jihadist constitution, this is an Oligarchy constitution, this is a constitution that puts the whole of the country under one tribe."
  },
  {
    "headline": "Facebook, WhatsApp and Instagram back after nearly 6-hour outage",
    "summarized_story": "Facebook, Instagram, and WhatsApp appeared to have been coming back after an outage that lasted almost six hours.\nWe’re working to get things back to normal as quickly as possible, and we apologize for any inconvenience,” Facebook had earlier written.\nAdvertisementBut in a tweet a few minutes ago, Facebook apologised to those affected by the outage while also stating that the platforms “are coming back online now”.\n— Facebook (@Facebook) October 4, 2021 Advertisement“To the huge community of people and businesses around the world who depend on us: we’re sorry,” it tweeted.\nIt also marked the worst outage for the tech giant since 2008, when a bug knocked Facebook offline for about a day."
  },
  {
    "headline": "Facebook, WhatsApp and Instagram back after nearly 6-hour outage",
    "summarized_story": "Facebook, Instagram, and WhatsApp appeared to have been coming back after an outage that lasted almost six hours.\nWe’re working to get things back to normal as quickly as possible, and we apologize for any inconvenience,” Facebook had earlier written.\nAdvertisementBut in a tweet a few minutes ago, Facebook apologised to those affected by the outage while also stating that the platforms “are coming back online now”.\n— Facebook (@Facebook) October 4, 2021 Advertisement“To the huge community of people and businesses around the world who depend on us: we’re sorry,” it tweeted.\nIt also marked the worst outage for the tech giant since 2008, when a bug knocked Facebook offline for about a day."
  },
  {
    "headline": "South-south governors to join suit against FIRS on VAT collection",
    "summarized_story": "Governors of the south-south region say they have resolved to join the suit challenging the Federal Inland Revenue Service (FIRS) on the collection of value-added tax (VAT).\nAdvertisementIfeanyi Okowa, governor of Delta and the chairman of the south-south governors’ forum, disclosed this on Monday, after the forum’s meeting in Rivers state.\nOver the past weeks, the FIRS and some state governments have been in a legal tussle over VAT collection.\nRivers and Lagos state governments have enacted laws and called for decentralisation of collection, while some states want centralised collection.\nAdvertisementLagos had subsequently joined the suit to challenge the FIRS, but some northern states are considering joining the suit in support of FIRS over the collection of VAT."
  },
  {
    "headline": "South-south governors to join suit against FIRS on VAT collection",
    "summarized_story": "Governors of the south-south region say they have resolved to join the suit challenging the Federal Inland Revenue Service (FIRS) on the collection of value-added tax (VAT).\nAdvertisementIfeanyi Okowa, governor of Delta and the chairman of the south-south governors’ forum, disclosed this on Monday, after the forum’s meeting in Rivers state.\nOver the past weeks, the FIRS and some state governments have been in a legal tussle over VAT collection.\nRivers and Lagos state governments have enacted laws and called for decentralisation of collection, while some states want centralised collection.\nAdvertisementLagos had subsequently joined the suit to challenge the FIRS, but some northern states are considering joining the suit in support of FIRS over the collection of VAT."
  },
  {
    "headline": "Report: Zuckerberg loses $7bn as Facebook, WhatsApp, Instagram collapse",
    "summarized_story": "The net worth of Mark Zuckerberg, founder and chief executive officer (CEO) of Facebook, fell by nearly $7 billion in a few hours after the company’s flagship products collapsed.\nWhatsApp, Instagram, and Facebook all gone down in what appeared to be another global outage.\nAdvertisementAccording to data on Downdetector, the three social media platforms — owned by Mark Zuckerberg — completely stopped working shortly before 5 pm (GMT+1) on Monday, leaving millions of users worried.\nIn a Twitter post, Facebook said it is aware of the issue and working to fix it.\nWe’re working to get things back to normal as quickly as possible, and we apologize for any inconvenience,” the company tweeted."
  },
  {
    "headline": "Facebook, Instagram and WhatsApp down for millions around the world",
    "summarized_story": "Facebook, Instagram and WhatsApp are down for millions of users around the world, according to complaints from users around the world and data from outage tracking website Downdetector.com.\nThe three apps – which are all owned by Facebook, and run on shared infrastructure – all completely stopped working shortly before 5 pm WAT.\nOther products that are part of the same family of apps, such as Facebook Workplace, also stopped working.\nIn response to this outage, Facebook took to Twitter to explain that it’s working to resolve the issue.\n“We’re aware that some people are experiencing issues with WhatsApp at the moment,” the messaging platform’s official Twitter handle said."
  },
  {
    "headline": "Pandora Papers: Kenya’s first family implicated in biggest-ever offshore data leak",
    "summarized_story": "Seven members of the Kenyatta family, including the president, are revealed, through the Pandora Papers, as being variously connected to more than 10 offshore companies and foundations.\nThe Kenyattas’ offshore investments include a company with stocks and bonds worth $30 million.\nLargest-ever leakThe Pandora Papers represent the latest and largest, by data volume, in a series of major leaks of financial data about the offshore world over the last five years.\nIn 2016, the Panama Papers, which consisted of 2.6 terabytes of data, leaked from the law firm, Mossack Fonseca.\nMore than 100 billionaires feature in the leaked data, as well as celebrities, rock stars, and business leaders."
  },
  {
    "headline": "Twitter ban in Nigeria to be lifted if certain conditions are met",
    "summarized_story": "Buhari listed these conditions during a broadcast to mark Nigeria’s 61st Independence anniversary on Friday, October 1.\nThe Nigerian government suspended Twitter’s operations in June, following the social media platform’s decision to delete a tweet by Buhari, which it said breached the site’s rules.\nThe state’s decision to ban Twitter triggered widespread criticism as online-based businesses recorded huge losses; lawsuits; and national assembly hearings meant to probe the circumstances leading to the ban.\n“The ban on Twitter will soon be lifted as we are getting close to reaching full agreement,” the minister said.\nHowever, the Buhari administration has always been keen on regulating social media and internet-based broadcasting companies."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Update [ October 1, 2021 at 8:14 am.\nWAT] The eNaira website is now up The Central Bank of Nigeria (CBN) has postponed..."
  },
  {
    "headline": "Blockchain payments platform, Bitmama raises $350k pre-seed to expand product offerings",
    "summarized_story": "2021 Global Crypto Adoption Index, Source: ChainalysisA fact which Chainalysis attributes to the high transaction volume in peer-to-peer (P2P) trading.\nBitmama websiteBut apart from that is the issue of trust and building a suitable product for users.\nA decision informed by the exorbitant cost to send and receive money despite digital advancement in recent years.\nBut, it’s pretty expensive to send and receive money.\nBut with this new product, businesses can send and receive money using their wallet, pay bills, pay employee salaries, and hold multi-currency accounts."
  },
  {
    "headline": "How Nigerian edtech startup, Tuteria, is connecting learners to tutors in Nigeria",
    "summarized_story": "As a result, Godwin Benson, CEO, and Abiola Oyeniyi, CTO, launched Tuteria, an edtech company, in 2014 to make learning accessible to learners who want to reach their learning potential.\nTuteria also ensures that tutors are assigned based on their proximity to the location of the learners.\nThe company believes that background and security verifications and tutors’ assessments are essential to ensure the learner’s safety.\nGrowth and expansion plans in a challenging economyTuteria has over 3,000 tutors and has served over 50,000 learners since its inception.\n”The co-founders believe that the Nigerian edtech industry is exciting because it is young and has a lot of potential for Tuteria to thrive."
  },
  {
    "headline": "A startup act? Should Twitter say yes? 2000 bandits’ informants",
    "summarized_story": "Image by Daniel Bone from <aWhat do we know about startup acts?\nSome backstory: To a large extent, startup acts evolved from small business acts, which were enacted to support Small and Medium-sized Enterprises (SMEs).\nOnly three countries — Italy, Argentina, and the Philippines — outside Africa have startup acts.\nRead this for a surprise: Startup Acts: Can the decade’s sexiest law save Nigeria’s thriving but uncertain startup ecosystem?\nOn Thursday, September 30, 2021, the Zamfara State government said it had arrested over 2000 bandits’ informants since the blackout."
  },
  {
    "headline": "PUWOV apprehends personnel for extortion, urges residents’ support to flush out corrupt officials – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Public Works Volunteers (PUWOV) in Edo State has apprehended one Fidelis Ugbenna, an officer of the scheme for allegedly extorting money from a motorist.\nThe State Coordinator, PUWOV, Mukhtar Yusuf-Osagie, who disclosed this to journalists in Benin City, said the personnel has been handed over to the police for further investigation and prosecution.\nReassuring the scheme’s commitment to curb criminality and ensure peace and orderliness, in partnership with other security agencies in the state, Yusuf-Osagie solicited for residents’ support to maintain discipline and flush out corrupt officers from the schemeAccording to him, “The Edo PUWOV has apprehended one Mr. Fidelis Ugbenna, a PUWOV personnel, who connived with a dismissed PUWOV personnel (Emmanuel Oviawe) to extort a private motorist at Nepa junction on Akpakpava axis of Ring Road in Benin City.”He said the corrupt PUWOV official extorted the sum of N10, 000 from Mr. Chibuzor Nenchi, a road user on the Ring Road axis, adding, “the PUWOV official, Ugbenna Fidelis has been taken to Oba Market Police Division for further investigation and prosecution.\nAlso, an immediate dismissal awaits him after prosecution.”The PUWOV coordinator further stated: “We are reassuring members of the public that the scheme will not relent in upholding its mandate on discipline as such all bad eggs will be flushed out from the scheme.\n“We want to charge members of the public to always use the PUWOV complaints lines on 09150322999 and 08132030846 to report any PUWOV official culpable of the illegal act of extortion.”“Also, members of the public should be observant and mindful of some miscreant on black outfits posing as PUWOV taskforce to extort money from innocent citizens; members of the public should report anyone involved in such illegality,” Yusuf-Osagie added."
  },
  {
    "headline": "Edo govt hails Liquorose for her comportment, performance in BBNaija – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has congratulated Roseline Afije, better known as Liquorose on her emergence as the first runner-up in the sixth season of the reality television show, Big Brother Nigeria (BBNaija).\nAfije is a native of Edo State.\nAccording to him, “On behalf of the Edo State Government, I congratulate Roseline Afije, also known as Liquorose, on her emergence as the first runner-up in the Big Brother Nigeria (BBNaija) reality show.\nShe put up a good showing with a dignified poise and character that earned her fans across the country.\n“As an indigene of our dear state, we are proud of her and her achievement and wish her success in future endeavors.”..."
  },
  {
    "headline": "Betsy Obaseki assures of better opportunities for girl-child as Bayelsa Queens wins maiden BOWFT – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State First Lady, Mrs. Betsy Obaseki has said the just-concluded Betsy Obaseki Women Football Tournament (BOWFT) will guarantee better opportunities for the girl-child, reassuring the government’s commitment to ensuring that every female child in the state realizes her fullest potentials.\nDignitaries at the closing ceremony include Edo State Deputy Governor, Rt.\nPhilip Shaibu; Minister of Youth and Sports Development, Sunday Dare; former Governor of Edo State, Chief Lucky Igbinedion; wife of Osun State Governor and Chairman Southern Governor’s Wives Forum, Mrs. Kafayat Oyetola and wife of Bayelsa State Governor, Mrs. Gloria Diri, amongst others.\nAccording to Mrs. Obaseki, “What we have seen and experienced in the last one week of this tournament is the highest form of professionalism in Nigerian football.\n“It’s also to create a platform and an opportunity for young girls all over Nigeria and Edo State in particular."
  },
  {
    "headline": "COVID-19: Edo vaccinates over 136,000 persons, records five new deaths, 84 more cases – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has ramped up the vaccination of more residents with the coronavirus (COVID-19) vaccines, noting that at least 136,082 persons across the 18 local councils of the state have been inoculated with one dose of the vaccine since the launch of the vaccination exercise in the state.\nHead of Edo COVID-19 Case Management, Dr. Ebomwonyi Osagie said this on Monday during the daily COVID-19 press briefing at the Government House in Benin City.\nHe noted that the state also recorded 84 more cases and five more COVID-19 related deaths in the last five days, urging residents to get vaccinated in order to be fully protected against the virus.\nAccording to him, “As of yesterday, a total of 136,082 persons have had at least one dose of the COVID-19 vaccine.\nSo, we encourage people who have taken their first dose to take the second and those who are not yet vaccinated should please avail themselves of the opportunity of the ongoing vaccination to get protection against the deadly virus,” he charged."
  },
  {
    "headline": "World Bank approves $400 million credit for Nigeria to scale up COVID-19 vaccination",
    "summarized_story": "ADVERTISEMENTThe World Bank’s Board of Directors has approved a $400 million credit to Nigeria in additional financing, from its International Development Association (IDA), for COVID-19 vaccine acquisition, the bank announced in a statement it issued on Friday, in Washington.\nBuilding on the Federal Government’s plan to break the chain of local transmission of COVID-19 and limit the spread of the virus, the original COVID-19 response program would be expanded to enable equitable access, the statement said.\nThis is in order to purchase affordable COVID-19 vaccines for 18 per cent, or about 40 million of Nigeria’s population and support effective vaccine deployment to 50 per cent, about 110 million Nigerians.\nIt also said that the additional financing would allow Nigeria purchase and deploy COVID-19 vaccines, strengthen relevant health systems that are necessary for a successful deployment and to prepare for future health emergencies.\n“This additional funding would ensure that the Nigerian government has the necessary financial resources to keep its vaccination drive going."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "VAT: South South governors back Rivers, head to Supreme Court",
    "summarized_story": "Governors of the South-South geopolitical zone have declared their intention to join Rivers state at the Supreme Court in the ongoing tussle on the collection of value added tax (VAT) by states.\nThe governors had met under the BRACED Commission to deliberate on a number of pressing issues in the region.\nOyo state had also asked the Abuja division of the court to join as a respondent in the appeal filed by the revenue agency.\nIn August, the Rivers division of the Federal High Court declared that the FIRS had no constitutional backing for collecting VAT in the state and granted the power to collect the consumption tax to the Rivers state government.\nJustice Stephen Pam issued an order of perpetual injunction restraining FIRS and Abubakar Malami from coercing residents of Rivers to pay VAT and personal income tax to FIRS."
  },
  {
    "headline": "Osun PDP Appeal Panel Chairman Compromised By Makinde – Olaoluwa",
    "summarized_story": "Sunday OguntuyiErstwhile chairman of People’s Democratic Party, PDP, in Osun state, Alhaji Ganiyu Olaoluwa has berated the Chairman of the Appeal Panel, in the just concluded Ward Congress of the Peoples Democratic Party (PDP) in the state, Rt.\nSeyi Makinde.\n“We make bold to assume that Hon Omoreige must have been induced financially to take directives from Governor Seyi Makinde of Oyo State to cancel the entire Osun State PDP Ward Congress,” he said.\n“Osun State is not Oyo State, Seyi Makinde is Governor of Oyo State and Not Premier or Governor General of South West Nigeria.\nGovernor Seyi Makinde has No Authority, Whatsoever under the PDP Constitution to order the Cancelation of the Osun State PDP Ward Congress."
  },
  {
    "headline": "Unknown gunmen: Army lunches Operation ‘Exercise Golden Dawn’ in Southeast",
    "summarized_story": "…launches ‘Operation Still Waters’ in SouthwestThe 302 Artillery Regiment General Support of the Nigerian Army has lunched ‘Exercise Golden Dawn’, to provide security in the Anambra and other Southeast states amid attacks by unknown gunmen.\nExercise Golden Dawn, according the Commander 302 Artillery Regiment (General Support) Col. Abdulkarim .B.\n“The military will use the golden opportunity in conjunction with other security agencies to curb the existing security threats in Anambra State.\nSimilarly, the Army launched ‘Operation Still Waters’ to tackle kidnapping and other security challenges Southwest of the country.\n“Other operations currently being launched in other zones are Exercise Enduring Peace in the North Central and Exercise Golden Dawn in the South East and parts of South-South."
  },
  {
    "headline": "Pandora papers: biggest leak of offshore data reveals financial secrets of rich, powerful",
    "summarized_story": "Biggest trove of secret deals and hidden assets of some of the world’s richest and most powerful people, including some Nigerians, have been revealed in a investigative piece known as Pandora papers.\nThe Pandora papers represent the latest – and largest in terms of data volume – in a series of major leaks of financial data that have convulsed the offshore world since 2013.\nJordan appeared to have blocked the ICIJ website on Sunday, hours before the Pandora papers launched.\nThe Pandora papers also threaten to cause political upsets for two European Union leaders.\nThe former prime minister and his wife bought the £6.5m office in Marylebone by acquiring a British Virgin Islands (BVI) offshore company."
  },
  {
    "headline": "Telegram To The Rescue As Facebook, WhatsApp, Others Shut Down",
    "summarized_story": "A cross-platform, cloud-based instant messaging system, Telegram, has quickly replaced Facebook and its messaging platforms like WhatsApp and Messenger, after they shut down across the world on Monday evening.\nLike Facebook and its associated platforms, Telegram also provides end-to-end encrypted video calling, VoIP, file sharing and several other features.\nLEADERSHIP earlier reported that Facebook users are experiencing outages across the world, including all social networks the company owns, which include Messenger, Instagram and WhatsApp.\nAt the same time, Facebook stock has gone down about 5.5%.\nThis follows a recent downward trend for the stock as Facebook faces scrutiny in the U.S. Senate after whistleblower, Frances Haugen, leaked internal documents to the Wall Street Journal."
  },
  {
    "headline": "Telegram To The Rescue As Facebook, WhatsApp, Others Shut Down",
    "summarized_story": "A cross-platform, cloud-based instant messaging system, Telegram, has quickly replaced Facebook and its messaging platforms like WhatsApp and Messenger, after they shut down across the world on Monday evening.\nLike Facebook and its associated platforms, Telegram also provides end-to-end encrypted video calling, VoIP, file sharing and several other features.\nLEADERSHIP earlier reported that Facebook users are experiencing outages across the world, including all social networks the company owns, which include Messenger, Instagram and WhatsApp.\nAt the same time, Facebook stock has gone down about 5.5%.\nThis follows a recent downward trend for the stock as Facebook faces scrutiny in the U.S. Senate after whistleblower, Frances Haugen, leaked internal documents to the Wall Street Journal."
  },
  {
    "headline": "Aero Contractors Takes Delivery Of 2 Airbus 320",
    "summarized_story": "Aero Contractors has taken delivery of two Airbus 320 from Heston Airline based in Lithuania.\nThe two aircraft arrived Abuja last Thursday afternoon, where they were received at the Nnamdi Azikiwe International Airport, by the managing director of the airline, Capt.\nWe have established an excellent relationship with the lessors and the financier and we are looking forward to a stronger relationship between both parties.”Also speaking at the event, former managing director of Aero Contractors, Capt.\nHe also said the aviation industry will thrive more if more investors like House of Five A’s come into the business.\nLEADERSHIP reports that Aero Contractors is currently in Receivership by the Asset Management Corporation of Nigeria (AMCON)."
  },
  {
    "headline": "Aero Contractors Takes Delivery Of 2 Airbus 320",
    "summarized_story": "Aero Contractors has taken delivery of two Airbus 320 from Heston Airline based in Lithuania.\nThe two aircraft arrived Abuja last Thursday afternoon, where they were received at the Nnamdi Azikiwe International Airport, by the managing director of the airline, Capt.\nWe have established an excellent relationship with the lessors and the financier and we are looking forward to a stronger relationship between both parties.”Also speaking at the event, former managing director of Aero Contractors, Capt.\nHe also said the aviation industry will thrive more if more investors like House of Five A’s come into the business.\nLEADERSHIP reports that Aero Contractors is currently in Receivership by the Asset Management Corporation of Nigeria (AMCON)."
  },
  {
    "headline": "JUST-IN: Resident Doctors Suspend 63 Day-old Strike",
    "summarized_story": "The National Association of Resident Doctors (NARD), on Monday, announced the suspension of its 63 day-old strike.\nRecall that the resident doctors embarked on a nationwide indefinite strike since August 2, 2021 to press home their demands.\nIshaya said the decision to suspend the strike was reached after a thorough review of the progress they have made on their demands.\nSo having considered them and see the position of the various congress, we decided to suspend the strike officially, starting from the 6th of October at 8:00 am.\n“The government said they have enrolled them but they are not able to pay-rolled them because we are on strike."
  },
  {
    "headline": "11months unpaid salaries: Protest rocks Calabar as UCTH interns protest, call on EFCC",
    "summarized_story": "Again , interns from the University of Calabar Teaching Hospital, UCTH , have defied the advice of the Nigerian Police Force , DSS by staging a protest in Calabar to demand their unpaid 11 months salaries amounting to 480million naira from management.\nThe interns who protested on major streets of Calabar from the hospital ,to Etta Agbor and Governor office peacefully, chanted solidarity songs and carrying placards with various inscriptions as “pay UCTH interns now” don’t harass us, Pay us now” 11 months without interns salary” amongst others .\nGideon claim that the UCTH has severely used the police to intimidate them, and that their Salaries amount to about 480 million naira.\nHe called on the federal government, EFCC, minister of health to help resolve the none payment of Salaries.\nAnother intern, Miss Nmuoeke Maurine said the reason their protest was because of our 11 months Salaries and over two months suspension that don’t they don’t even know when it would be called off."
  },
  {
    "headline": "11months unpaid salaries: Protest rocks Calabar as UCTH interns protest, call on EFCC",
    "summarized_story": "Again , interns from the University of Calabar Teaching Hospital, UCTH , have defied the advice of the Nigerian Police Force , DSS by staging a protest in Calabar to demand their unpaid 11 months salaries amounting to 480million naira from management.\nThe interns who protested on major streets of Calabar from the hospital ,to Etta Agbor and Governor office peacefully, chanted solidarity songs and carrying placards with various inscriptions as “pay UCTH interns now” don’t harass us, Pay us now” 11 months without interns salary” amongst others .\nGideon claim that the UCTH has severely used the police to intimidate them, and that their Salaries amount to about 480 million naira.\nHe called on the federal government, EFCC, minister of health to help resolve the none payment of Salaries.\nAnother intern, Miss Nmuoeke Maurine said the reason their protest was because of our 11 months Salaries and over two months suspension that don’t they don’t even know when it would be called off."
  },
  {
    "headline": "VAT dispute: South South governors to join Supreme Court suit",
    "summarized_story": "South South Governors Forum following a crucial Port Harcourt, Rivers state meeting Monday under the BRACED Commission have declared to join the Supreme Court suit by the Rivers State Government demanding that states and not the Federal Government, should collect Value Added Tax (TAX).\nAll the BRACED Governor except Cross Rivers state’s Prof Ben Ayade were present at the meeting presided over by the forum’s Chairman, Governor Ifeanyi Okowa with Chief Nyesom Wike as host and the Director-General, BRACED Commission, Joe Keshi, also present.\nOkowa read that, “Bearing in mind that most of the BRACED states have established their states’ security organ, we approve a regional security architecture which will be launched very soon.\n“We Unequivocally support the decision for states to collect value added tax, and resolved to join the suit before the Supreme court.\n“Council calls upon the President and the Federal Government to uphold the law establishing the Niger Delta Development Commission (NDDC) by appropriately constituting its board."
  },
  {
    "headline": "Wizkid showers praises on Tems as ‘Essence’ bags platinum certification in US",
    "summarized_story": "Grammy award-winning singer, Wizkid, has achieved another feat with his 2020 song, “Essence”, which features fast-rising Nigerian artiste, Tems.\nThe song reached platinum status barely a month after it was certified gold in the US.\nAccording to the BRITS Certified Awards website, songs are awarded platinum status when they achieve 600,000 units of sales.\nTems’ manager, Muyiwa Awoniyi, shared a video on his Instagram story, where Tems and Wizkid were receiving the certification plaque.\nIn 2020, Wizkid became the first African artiste to be certified Gold in the United States, after 500,000 units of Come Closer were sold."
  },
  {
    "headline": "Facebook, Instagram, WhatsAPP return with apology",
    "summarized_story": "Facebook and Instagram appeared reconnected to the global internet on Monday afternoon, nearly six hours into an outage that paralyzed the social media platform.\nFacebook and its WhatsApp and Instagram apps went dark at around noon Eastern time, triggering a record 10.6 million problem reports, according to website monitoring group Downdetector.\nAround 5:45 pm ET, some Facebook users began to regain partial access to the social media app.\n“Facebook basically locked its keys in its car,” tweeted Jonathan Zittrain, director of Harvard’s Berkman Klein Center for Internet & Society.\n“Without the correct DNS configurations, browsers were unable to access the Facebook website, and apps could not properly call the servers needed to fill up Instagram with new posts or WhatsApp with new messages."
  },
  {
    "headline": "Our Case: Students of Michael Okpara University",
    "summarized_story": "By Ihechinyere Chigemeri-Uwom/UmuahiaSome Students of Michael Okpara University of Agriculture, Umudike (MOUAU) in Abia on Monday embarked on a peaceful protest against the deplorable state of Umuahia -Ikot Ekpene road in the state.\nMr Chukwuma Ugochukwu, the President of Students’ Union Government (SUG) of MOUAU, said that the state of the road had plunged road users into untold hardship.\nUgochukwu said: ”Yesterday, a student of MOUAU was killed in an autocrash that involved an SUV and a Truck which occurred on the Umuahia-Ikot Ekpene road.\n“We are giving four days ultimatum to the state government to commence the palliative works on the Umuahia-Ikot Ekpene road”.\nAlso, Mr James Daniel, a student of MOUAU, said that the deplorable state of the Umuahia-Ikot Ekpene road had led to loss of many lives, especially students of MOUAU."
  },
  {
    "headline": "BREAKING: Facebook, WhatsApp Restored For Users Globally After Six Hours’ Shut Down",
    "summarized_story": "Facebook, Instagram, WhatsApp, and Facebook Messenger were all down on Monday afternoon, with users all over the world reporting crashes.\nAfter a six-hour outage that knocked off billions of people throughout the world, the sites were restored about 10.45 p.m., according to SaharaReporters.\nFacebook, which is controlled by American billionaire Mark Zuckerberg, owns the infrastructure that all of the online services use.\nAccording to the site, there were only two difficulties reported at 16:26, but that number had grown to almost 27,000 just fifteen minutes later.\n“We’re aware that some people are having trouble accessing Facebook app."
  },
  {
    "headline": "BREAKING: Facebook, Instagram, WhatsApp Crash Second Time In 2021",
    "summarized_story": "WhatsApp and Instagram, both controlled by Facebook, were down on Monday, leaving three billion online users angry and unable to communicate.\nUsers visiting the social platforms owned by Silicon Valley guru Mark Zuckerberg are confronted with error messages.\nOn Twitter, @WhatsApp wrote, “We’re aware that some people are experiencing issues with WhatsApp at the moment.\n“We’re working to get things back to normal and will send an update here as soon as possible.\n“Thanks for your patience!”Also, @Facebook tweeted, “We’re aware that some people are having trouble accessing our apps and products."
  },
  {
    "headline": "Residents Groan As Rainfall Wreaks Havoc In Osun Community.",
    "summarized_story": "Residents of Wole Ola Riverside Community have expressed their displeasure with the damage caused by Sunday’s downpour.\nA visit to the community on Monday revealed that the rain left behind blown roofs to residents and shops.\nIn her words, “Until we came out after the rainfall, we never knew the extent of the damage.\n“There is even a case of roof blown out and deposited on an electricity line.\n“We still need government intervention in the area is locating a health centre, primary school and other in our community."
  },
  {
    "headline": "VIDEO: Tinubu’s Presidential Posters Surfaces In Lagos",
    "summarized_story": "A media blitz for the 2023 Presidential campaign has begun for All Progressives Congress leader Asiwaju Bola Tinubu.\nIn a viral video seen by NewsDirect, images of the APC leader, who is recuperating in London, were on a major express road in Lagos.\nSWAGA, a group within the South-West region of the country is the sponsor of the campaign posters.\nThe political movement was formally unveiled in Ibadan and has been inaugurated with pomp and pageantry in Ogun, Ondo and Osun state with Sen Dayo Adeyeye as the Chairman.\nThe group has visited several monarchs within the southwest region to seek the support of the kings for Mr Tinubu, a two-term governor of Lagos state and former senator."
  },
  {
    "headline": "Breaking: Facebook, Instagram, WhatsApp bounce back",
    "summarized_story": "Three giant social media platforms – Facebook, Instagram and WhatsApp are back after hours of extinction.\nDetails loading…"
  },
  {
    "headline": "Breaking: Again, health workers postpone nationwide strike",
    "summarized_story": "Health workers under the aegis of Joint Health Sector Union (JOHESU) and Assembly of Healthcare Professional Associations (AHPA) have postponed their proposed strike.\nThe health bodies said they have reviewed the ultimatum for a strike scheduled to begin by Monday midnight following the outcome of their meeting with the Federal Government on Wednesday.\n“After our usual very critical appraisal during consultations and meetings, the NEC resolved to put on hold the strike action.\nThis decision was hinged on the forthcoming engagement with the Federal Government on Wednesday, October 6, 2021.\nMinister and other key players in the Federal Government team well as we tackle these seemingly unending challenges.”"
  },
  {
    "headline": "Confusion as Facebook, Instagram, WhatsApp shut down again",
    "summarized_story": "Millions of users are currently stranded following as Facebook, Instagram, and WhatsApp go down across the world.\nThis includes Instagram, Facebook, WhatsApp, and Facebook Messenger.\nWhile some Facebook, Instagram, and WhatsApp outages only affect certain geographic regions, the services are down worldwide on Monday.\nThe outage is also affecting platforms and services that use Facebook login.\nFacebook has not yet publicly commented on the ongoing outages affecting all of its services."
  },
  {
    "headline": "NCR launches “Project Zero Hunger” for refugees, IDPs, others -NigPilot",
    "summarized_story": "National Commission for Refugees, Migrants and Internally Displaced Persons NCFRMI, in collaboration with Defence and Police Officers’ Wives Association DEPOWA, has launched the “Project Zero Hunger” programme aimed at catering for refugees, IDPs and other vulnerable groups in states across the federation.\nThe Project Zero Hunger Initiative will fight food insecurity and stem the threat of famine in our land.\nThe Project will additionally assuage the growing burden of hunger amongst persons of concern.\nI see that much has been done through partnerships with critical stakeholders for appropriate support to mobilize and deploy resources to provide a pedestal of success for the Project Zero Hunger Initiative.\n“On behalf of our persons of concern, I hereby launch Project Zero Hunger and pray that it positively impacts on the lives of the intended beneficiaries.”"
  },
  {
    "headline": "Access Bank, Xploits Consulting donate food, school items to orphanages in FCT -NigPilot",
    "summarized_story": "In continued efforts to bring succor to orphans across the FCT, Access Bank Plc and Xploits Consulting Ltd , have donated food and school items to some orphanages as part of their projects to ensure that they have a better life.\nSome of the orphanages captured in the project and visited include Daughters of Charity Orphanage, Bwari, Destined Children’s Orphanage, Kado Estate, Abuja, Best Life Orphanage, Gwagwalada, Al’ansar Orphanage, Kuje in the FCT.\nSpeaking at the handing over of the items, Director, Communications, Xploits Consulting Ltd, Mrs, Grace Taiwo said that the presentation of the items were part of Access Bank Plc’s Corporate Social Responsibility, CSR adding that the bank’s commitment was largely focused around the United Nations Sustainable Develop Goals.\nTaiwo assured that her organisation with support from Access Bank Plc will continue to invest in the lives of Nigerians especially in areas of education, health, gender equality, arts.\nShe listed some of the items donated to include food items, toiletries and stationeries."
  },
  {
    "headline": "DHQ denies killing 20 fishermen in air bombardment -NigPilot",
    "summarized_story": "The Defence Headquarters (DHQ) , on Thursday, denied the trending report that the air bombardment of the air component of Operations Hadin Kai on terrorist location killed 20 fishermen in Borno State.\nIt noted that necessary steps were taken to ensure that the presence of the terrorists was ascertained and the strike was precise and professionally executed.\nIt is therefore important to make clarifications regarding the air interdiction mission conducted in the general area.\n“This was after careful Intelligence Surveillance Reconnaissance missions revealed the activities of ISWAP elements in the location.\nAlthough casualty figures could not be ascertained, the strike was verified to be successful in disrupting ISWAP logistics movement and foot soldiers”."
  },
  {
    "headline": "Ita Enang tasks state judiciary workers on implementation of judicial autonomy -NigPilot",
    "summarized_story": "Secretary, Presidential Implementation Committee on Autonomy of State Legislature and Judiciary, Senator Ita Enang, has called on State Chief Judges and Head of Courts to observe caution and due diligence in the implementation of full autonomous judiciary.\nSenator Enang who is also the Senior Special Assistant to the President on Niger Delta Affairs, made the call while presenting a paper at the National Judicial Institute Roundtable on Effective Court Administration recently in Abuja.\n“Let me appreciate the National Judicial Institute for the privilege of this platform to address their Lordships on the patent fears and indeed banana peels on the floor of Autonomy of the Judiciary.\nSome of the Chief Judges present at the roundtable, observed that the present budgetary system was inhuman and stressed the need for a more realistic approach to budgeting.\nOther issues raised by the Chief Judges were on the need to make input at budgeting level and the process of transmission approval into cash."
  },
  {
    "headline": "VAT Dispute: South-South States To Join Suit At Appeal Court, Say Governors",
    "summarized_story": "Governors of the South-South have resolved that states in the region should join the suit filed by the Federal Inland Revenue Service (FIRS) challenging the collection of Value Added Tax (VAT) by states.\nThis formed part of the resolutions reached at the meeting of the South-South Governors’ Forum held on Monday at the Government House in Port Harcourt, the Rivers State capital.\nDelta State Governor and Chairman of the forum, Ifeanyi Okowa, disclosed this while briefing reporters at the end of the closed-door meeting.\nThose who attended the meeting include the host, Governor Nyesom Wike, Governor Godwin Obaseki of Edo State, Governor Udom Emmanuel of Akwa Ibom State, and Governor Douye Diri of Bayelsa State.\nHowever, Cross River State Governor, Ben Ayade, was absent at the meeting."
  },
  {
    "headline": "‘It Is Unconstitutional’: Northern Groups Oppose Zoning Of 2023 Presidency",
    "summarized_story": "The Coalition of Northern Groups (CNG) has opposed the zoning arrangement by political parties, describing it as unconstitutional and a plot to intimidate the north from contesting for the presidency in 2023.\nAccording to him, the north will not be obliged to any zoning arrangement for elective positions in the forthcoming general election.\nRELATED: Southern Governors Back VAT Collection By States, Zoning Of 2023 Presidency To SouthOpen Grazing Ban: Southern Governors Did Not Provide Any Solution – PresidencyNigeria’s Next President Should Emerge From The South – Southern GovernorsMalami Slams Southern Governors Over Open Grazing BanThe group’s comment came eight days after the governors of the 19 northern states opposed the call by their southern counterparts that the Presidency should be zoned to the south in 2023.\nAccording to the governors, zoning the office of the president as being agitated by southern governors is against the provisions of the 1999 Constitution as amended.\nGovernor Lalong noted that although some northern governors had endorsed the power shift to the south, the regional governors collectively fault such calls."
  },
  {
    "headline": "Facebook, Instagram, WhatsApp Hit By Massive Outage",
    "summarized_story": "Major social media services including Facebook, Instagram and WhatsApp were hit by a massive outage on Monday, tracking sites showed, impacting potentially tens of millions of users.\nOutage tracker Downdetector was showing outages in heavily populated areas like Washington and Paris, with problems being reported from around 1545 GMT.\nUsers trying to access Facebook in affected areas were greeted with the message: “Something went wrong.\nWe’re working on it and we’ll get it fixed as soon as we can.”“We’re aware that some people are having trouble accessing our apps and products,” Facebook spokesman Andy Stone said on Twitter.\nFacebook did not immediately reply to a request for comment on the outage."
  },
  {
    "headline": "UPDATED: NARD Directs Resident Doctors To Resume Work Fully On Wednesday",
    "summarized_story": "The National Association of Resident Doctors (NARD) has directed its members across the country to resume work fully from Wednesday.\nPresident of the association, Dr Dare Godiya Ishaya, announced this on Monday while briefing reporters in Abuja following the suspension of the strike by resident doctors which lasted two months.\nOn its part, the government had convened several meetings with the association, in a bid to get the doctors back to work.\nJustice Bashar Alkali, who presided over the matter, ordered the resident doctors to suspend their strike and return to work immediately, pending the determination of the substantive suit.\nRather than ask members to return to their duty posts, NARD instructed its lawyers to file necessary processes to appeal the ruling."
  },
  {
    "headline": "Lagos Demands Review Of Revenue Formula, Seeks Special Status",
    "summarized_story": "Lagos State Government has demanded a new revenue sharing formula that is fair, equitable and reflects the contribution of stakeholders to the common purse.\nGovernor Babajide Sanwo-Olu made the demand on Monday while calling for a special status for Lagos over what he describes as its huge financial obligations to the national coffers.\nSpeaking during a two-day South-West zonal public hearing on the review of the revenue allocation formula organised by Revenue Mobilisation Allocation and Fiscal Commission (RMAFC), Sanwo-Olu said the state also wanted a revenue formula that enhances the capacity to deliver high-quality services and dividends of democracy to Nigerians.\nIt is therefore necessary to give due consideration to all the variables that support our advocacy for a Special Status,” he said.\nOn his part, RMAFC Chairman, Elias Mbam, lauded Sanwo-Olu and the Lagos State Government for accepting to host the public hearing."
  },
  {
    "headline": "Electricity consumers to experience blackout as Ikeja Electric upgrades equipment -",
    "summarized_story": "Electricity consumers in some parts of Lagos State will have no choice but to endure power outage over the next eight weeks.\nThe power outage, which will run from 8am to 6 pm daily, will begin on October 11.\nThe Chief Technical Officer, Ikeja Electric (IE), Jide Kumapayi, who made this known in Lagos, explained that the reason is to enable the IE carry out an upgrade to the 132KVA conductors from Ogba to Ikeja.\nHe listed areas to be affected to include Oregun axis; Police Training College axis; Anifowoshe; Ojodu; Oba Akran; Magodo; Omole Phase 1 and Oke-Ira, among others."
  },
  {
    "headline": "COAS Launches Three Military operations in Enugu",
    "summarized_story": "The Chief of Army staff Lt. General Faruk Yahaya has flagged off Exercise Golden Dawn military operation for the South East region of Nigeria.\nThe COAS also launched operation ‘Still Water for states within the coastal areas of the South South and South West regions as well as exerciseEnduring Peace for North Central and FCTThe military exercises aimed at curbing the rising cases of insecurity across the Southern regions, North Central and FCT.\nThe Chief of Army Staff said the operations were specifically designed to, among other things, curb Insurgency, Kidnapping, armed robbery, anti-cult clashes and recent banditry in the south East that has resulted to killings and burning of government facilitates in the zone ."
  },
  {
    "headline": "UPDATED: Resident doctors suspend 63-day-old strike",
    "summarized_story": "The National Association Resident Doctors has announced the suspension of its 63-day old strike with a view to reappraise government’s efforts on demands in six weeks.\nThe association hinted that the strike may resume after six weeks if no meaningful progress is madeNARD President, Godiya Ishaya, announced the suspension at a news conference in Abuja.\nVice President Yemi Osinbajo and other notable Nigerians who have now intervened.\nHe however warned that the Association may resume the suspended strike if nothing meaningful is achieved in six weeks.\nThe Association appealed to the government to appreciate the sacrifice of its members and meet their demands."
  },
  {
    "headline": "Nigerian Army launches Operation Still Waters in Ibadan",
    "summarized_story": "Nigerian Army flags off Exercise Still waters, urges citizens not to panic on the presence of military troops across the states.\nIn a bid to stem the tide of insecurity in the country, the Nigerian Army has flagged off operation still waters across six jurisdictions in the country.\nThe flag off which took at Step up headquarters of 2 Division of Nigerian Army in Ibadan also had in attendance representatives of other security agencies in the country.\nSpeaking at the flag off ceremony, the General Officer commanding 2 Division Nigeria Army, Major General Gold Chibuisi urged citizens not to panic on the presence of military troops across the states.\nThe Exercise still waters covers the jurisdictions of Oyo, Osun, Edo, Ekiti, Ondo and Kwara states of 2 Division Nigerian army."
  },
  {
    "headline": "Nigeria: Dangote Cement Gives Multimillion Naira Bursaries to 115 Students, Trains Several Youths in Ogun State",
    "summarized_story": "Dangote Cement has awarded multi-million naira educational scholarships to over 115 students, while training 30 others on skill acquisition in tailoring and fashion designing in 15 host communities of its Ibese cement plant in Ogun State.\nThe students in various institutions received cheques as bursaries in the company’s annual scholarship award programme, as the skill acquisition programme will be coordinated by Industrial Trust Fund (ITF).\nThe move was in furtherance of the company’s contributions to the socio-economic development of its host communities in health, education and infrastructure.\nCoker therefore commended Dangote cement efforts by keying into the programme towards the developments of its immediate society.\nShe then tasked other corporate organisations to emulate the good work of Dangote Cement in this regard."
  },
  {
    "headline": "Nigeria’s External Reserves Rise By $587.8m in Seven Days",
    "summarized_story": "Nigeria’s total amount of external reserves has increased by about $587.8 million in one week.\nThe current position of the nation’s external buffers is a speculation-come-true made by the apex bank after the last Monetary Policy Committee (MPC) meeting held over two weeks ago.\nThe central bank Governor, Mr Godwin Emefiele, earlier said, “The committee noted the significant increase in the external reserves which rose to $35.97 billion at end of August 2021 from $33.49 billion at end of July 2021, representing an increase of 7.4 per cent.\nAccording to a report from the CBN, the nation’s FX reserves went up by $128.6 million from $35.8 billion recorded on Tuesday, September 21 to about $35.9 billion the following day.\nHitting such a threshold would be the highest point of the amount in the external reserves since the last five years."
  },
  {
    "headline": "TikTok’s Revenue In Europe Grew By $170m in 2020 Due to Advertisers’ Spending – Arise News",
    "summarized_story": "TikTok in Europe has seen an increase of 545 percent to $170.8 million in revenue last year as advertisers upped their spending on the platform, according to a filing with the U.K.’s company registry on Monday.\nLosses at the Chinese-owned firm soared from $118.7 million in 2019 to $644.3 million in 2020.\nThe company’s headcount in Europe rose by over 1,000 people last year, going from 208 in 2019 to 1,294 in 2020.\nBeyond staff, TikTok also spent $344.9 million on selling and marketing expenses in 2020, up from $110.3 million in 2019, according to the filing.\nThat number grew to more than 271 million by Dec. 2018 and 507 million by Dec. 2019."
  },
  {
    "headline": "Instagram, Facebook, WhatsApp Apps Crash Throughout the World",
    "summarized_story": "Facebook Inc’s main social media site, popular photo-sharing platform Instagram and messaging app WhatsApp, were down for tens of thousands of users, according to outage tracking website Downdetector.com.\nThe Facebook and Instagram websites are still working in Iran, according to initial reports by check-host.com.\nMeanwhile, the social-media giant’s instant messaging platform WhatsApp was also down for over 35,000 users, while Messenger was down for nearly 9,800 users.\nFacebook has experienced similar widespread outages with its suite of apps this year in March and July.\nSeveral users using their Facebook credentials to log in to third-party apps such as Pokemon Go and Match Masters were also facing issues."
  },
  {
    "headline": "IPOB Accused Of Arson – Trending W/ Ojy Okpe",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) has asked President Muhammadu Buhari to withdraw the conditions imposed on the operations of Twitter in Nigeria.\nMeanwhile, Joe Igbokwe, a chieftain of the All Progressives Congress, has accused the Indigenous People of Biafra of setting his house on fire in Anambra state.\nIn another development, reports indicating that bandits in Sokoto State have settled for a written form of communication to negotiate ransom payment in the absence of “mobile telecommunication” service in some parts of the State.\nThe bandits wrote to a district head, demanding N20m to free abducted victims…"
  }
]