[
  {
    "headline": "Lagos leads as 76,855 candidates jostle for 3,000 spaces in unity schools",
    "summarized_story": "The Federal Government on Saturday disclosed that a total of 76,855 candidates enrolled for the 2021 Common Entrance Examinations into unity schools across the country.\nStatistics provided by the board, which gave details on candidates that sat for the examination, revealed that Lagos had the highest number of candidates with 21,423 candidates followed by FCT, 8,674 candidates, Anambra 5,738 and Zamfara had 4,865 while Taraba had the least registered number of candidates with 113.\nThe data released also showed that the number of girls that registered for the examination was 39,555 while a total of 37,300 male candidates registered for the examination.\nThe government also disclosed its intention to expand the carrying capacity of the schools to 30,000 students from the current 26,000 students.\n“This year we had a total number of 76,855 candidates enrolled for the examinations and the schools at the moment will only take in 3,000 candidates due to limited spaces,” he said."
  },
  {
    "headline": "Art gallery to celebrate ‘Africaness’ in solo exhibition",
    "summarized_story": "Thought Pyramid Art Centre, an independent non-profit art space in Abuja and Lagos, is set to celebrate new works of art that reflect creativity and a possible Afro-renaissance in its upcoming solo exhibition.\nThe solo-exhibition tagged “Dreams, Disruptions and Actualities” will be held from June 12 – 19, 2021, in the centre’s gallery in Lagos.\nIn a statement signed by the Artistic Director, Olorogun Jeff Ajueshi, the exhibition unveils the artistic prowess of painters’ varying experiences and hopes that the works will become a reference point of artistic expressions in the future.\n“We have interrogated his new works and simply agreed unequivocally that the works offer a good definition of what creativity is, and keep hope alive over a possible Afro-renaissance.\nAs a result of our culture of celebrating leading and emerging Nigerian contemporary artists, we understand that the importance of exhibiting artists whose works are contextually framed within the African narrative cannot be overemphasised.”Copyright PUNCH."
  },
  {
    "headline": "FG announces suspension of Twitter in Nigeria via Twitter",
    "summarized_story": "By Emmanuel OkogbaThe Federal Government has suspended the operations of micro-blogging platform, Twitter in Nigeria.\nThe announcement made by the Federal Ministry of Information and Culture via Twitter reads, “The Federal Government has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria.\nALSO READ:“The Minister of Information and Culture, Alhaji Lai Mohammed, announced the suspension in a statement issued in Abuja on Friday, citing the persistent use of the platform for activities that are capable of undermining Nigeria’s corporate existence.\nThe Minister said the Federal Government has also directed the National Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in Nigeria.”Vanguard News Nigeria"
  },
  {
    "headline": "Asaba Declaration: Southern Govs have no apologies on open grazing, restructuring — Okowa",
    "summarized_story": "Okowa expressed surprise that some elements in the Presidency are still advocating for the retention of open grazing of cattle.\n“Can we truly at this moment be promoting open grazing?\nThank God that the President was misrepresented, because I have seen news headlines that the President is not opposed to the ban on open grazing.\nThe voices for restructuring have been very strong out there.\nEven the APC government constituted a restructuring committee headed by Nasir el-Rufai and they agreed that restructuring was inevitable."
  },
  {
    "headline": "Breaking: Bad leadership has destroyed Nigeria, ‘land flowing with milk and honey’ – Obasanjo",
    "summarized_story": "The former President said, “God has created Nigeria to be a land flowing with milk and honey, but due to leadership failure, the country is wallowing of crises and problems”.\nHe said, that Nigeria has been destined to lead the black race, but “failure of leadership” has impeded it from taking its place in the comity of developed nations.\n“I believe that God has created Nigeria to lead the black race.\nAs at today, we have five Nigerians directly running international organisations and running them very well and one or two at the number two level”.\nHe described Obasanjo as his life guiding mentor who has changed his life and that other Nigerians for good."
  },
  {
    "headline": "FG directs Telcos to deactivate twitter by 12 midnight",
    "summarized_story": "By Prince OsuagwuThere indications that the federal government has directed all telecom operators in the country to deactivate twitter on their networks by 12 midnight.\nThis may not be unconnected with the decision of government to ban activities of twityer in the country following the deletion of President Muhammadu Buhari’s tweet, which the microblogging site deemed offensive.\nVanguard gathered authoritatively that bafter 12 midnight Friday, no twitter account of Nigerians will work within the country.\nDetails later…Vanguard News Nigeria"
  },
  {
    "headline": "We will continue to safeguard Nigerians from negative social media influences — Garba Shehu",
    "summarized_story": "Garba ShehuThe Presidency says the Buhari administration will continue to safeguard all citizens against social media’s disruptive and divisive influences.\nMalam Garba Shehu, the President’s Senior Special Assistant on Media and Publicity, stated this in a statement in Abuja on Saturday.\nAccording to him, the temporary suspension of Twitter is not just a response to the removal of the president’s post.\nHe said: ”There has been a litany of problems with the social media platform in Nigeria, where misinformation and fake news spread through it have had real world violent consequences.\nNevertheless, the removal of President Buhari’s tweet was disappointing."
  },
  {
    "headline": "World Environment Day: Quit addiction to fossil fuel",
    "summarized_story": "An environmental activist, Nnimo Bassey has called for the protection and restoration of Nigeria’s ecological systems by taking concrete steps to quit addiction to fossil fuel.\nHe urged Nigeria to transit to clean and safe community-driven renewable forms of energy that ensures harmony with nature.\nThe call comes as Nigeria joins the global community to mark the 2021 World Environment Day.\nThe Director of HOMEF in a statement said the world is currently in an environmental emergency, which is why the United Nations emphasizes the world environmental day.\nNo wonder many of the United Nations Days celebrations, such as the World Environment Day, are all hinged on restoring the environment.”Meanwhile, with the theme of the 2021 World Environment Day is reading “Ecosystem Restoration”, Bassey maintained that it reinforces the conviction that something is wrong with the environment and that all hands must be on deck to save it."
  },
  {
    "headline": "Buhari’s aides resort to Facebook after Twitter ban",
    "summarized_story": "Following the suspension of “Twitter’s operations in Nigeria by the Federal government, aides to President Mohammadu Buhari have resorted to using Facebook to carry out their duties.\nDAILY POST had reported that the Federal Government on Friday announced the suspension of microblogging and social networking service, Twitter, in Nigeria.\nHowever, DAILY POST on Saturday evening observed that aides to the President have resorted to using Facebook after the ban.\nAccording to him, the temporary suspension of Twitter in Nigeria was not just a response to the removal of President Muhammadu Buhari’s post.\nAlso, Buhari’s Special Assistant on New media, Bashir Ahmed has taken to his Facebook account to continue his duties."
  },
  {
    "headline": "IPOB replies Presidency on arms allegation",
    "summarized_story": "The Indigenous People of Biafra, IPOB, has reacted to the Presidency’s allegation of stockpiling arms.\nIPOB’s National Publicity Secretary, Emma Power said the group produces its arms locally.\nPowerful made the remark while denying the allegation of stockpiling arms and bombs.\nIn a chat, Powerful said: “We are not stockpiling any arms anywhere.\nWhat they did to our fathers, this present generation of Biafra will surprise them heavily.”President Muhammadu Buhari’s spokesman, Garba Shehu had accused IPOB of stockpiling arms and bombs."
  },
  {
    "headline": "IPOB has amassed stockpile of weapons, bombs – Presidency",
    "summarized_story": "The Presidency says the Indigenous People of Biafra, IPOB, has amassed a stockpile of weapons, bombs across the country.\nThe President’s Senior Special Assistant on Media and Publicity, Malam Garba Shehu, stated this in a statement in Abuja on Saturday.\nNigerian military bombing, secretly killing Igbos – Nnamdi Kanu allegesShehu said,” IPOB is proscribed under Nigerian law.\n” They kill policemen and set government property on fire.\nNow, they have amassed a substantial stockpile of weapons and bombs across the country.”” Twitter does not seem to appreciate the national trauma of our country’s civil war."
  },
  {
    "headline": "Biafra: Twitter deletes Nnamdi Kanu’s threat to kill Nigerian soldiers",
    "summarized_story": "Microblogging platform, Twitter, has deleted a tweet by the leader of the Indigenous People of Biafra, IPOB.\nIn the tweet earlier reported by DAILY POST, Nnamdi Kanu had vowed that any soldier sent to the Southeast by the Nigerian Government will die.\n‘Those out to destroy my govt will be dealt with’ – BuhariAnd Kanu warned that no Nigerian Army deployed to the region would return alive.\nTwitter deleted the comment on Saturday, saying it violates its rules.\nTwitter had two days earlier deleted President Muhammadu Buhari’s controversial tweet about the civil war which some Nigerians found offensive."
  },
  {
    "headline": "Yoruba will break-away from Nigeria latest by December - Sunday Igboho",
    "summarized_story": "The Ekiti State capital, Ado-Ekiti, was on Saturday agog as hundreds of Yoruba nation agitators, under the aegis of Ilana Omo Oodua, trooped to the town from neighboring South-West states for a rally.\nThe agitators, who were led by popular Yoruba Nation agitator, Sunday Adeyemo also knowns as Sunday Igboho, stormed the capital city to demand independence of Yorubaland.\nHe said that it is high time Yoruba nation break-away from Nigeria and chart a new course for itself, adding that the Nigerian environment has been consistently harsh to the Yoruba people at the advantage of the Fulanis.\nIgboho noted that everything would be done to ensure the emancipation of the region from the clutches of “evil-genius oppressors”, saying that Yoruba nation would break-away latest by the ending of December, this year.\n“Yoruba is the most educated race in Nigeria, but are these graduates getting jobs, no."
  },
  {
    "headline": "US reacts to suspension of Twitter operations in Nigeria",
    "summarized_story": "The United States mission in Nigeria has reacted to the Federal Government’s suspension of the operations of the micro blogging and social networking service, Twitter.\nThe Nation reports Minister of Information, Lai Mohammed had announced the “indefinite” suspension in a statement on Friday by his spokesman Segun Adeyemi.\nReacting, the US said the recent suspension undermines citizens’ fundamental freedom and also sends a wrong message to investors.\n“Banning social media and curbing every citizen’s ability to seek, receive, and impart information undermines fundamental freedoms.\n“The path to a more secure Nigeria lies in more, not less communication, alongside concerted efforts toward unity, peace, and prosperity.”"
  },
  {
    "headline": "Police confirm killing of DSS operative by soldiers in Ekiti",
    "summarized_story": "The Ekiti State Police Command have confirmed the killing of an operative of the Department of State Services (DSS) by three soldiers.\nThe Spokesman of the Police Command, Public Relations Officer, Ekiti Command, Sunday Abutu, described the killing as unfortunate and mindless.\nAn eye-witness who spoke on condition of anonymity told our reporter that the DSS operatives was stabbed in the neck and bled profusely, leading to his death.\n“When the DSS got to the soldiers, a hot argument ensued between them and one of the soldiers became so angry that he drew out a knife and stabbed DSS operatives in the neck.\n“The DSS man fell immediately and started bleeding."
  },
  {
    "headline": "FG orders prosecution of Nigerians accessing Twitter through VPN",
    "summarized_story": "The Attorney General of the Federation, Abubakar Malami has ordered the immediate prosecution of Nigerians accessing microblogging platform, Twitter, through a virtual private network (VPN).\nThe development follows the Friday indefinite suspension of Twitter operations in Nigeria.\nThe marching order instructing the Director of Public Prosecution of the Federation was contained in a statement by Malami’s spokesman, Umar Gwandu.\nThe statement reads: “Attorney General of the Federation and Minister of Justice, Abubakar Malami, SAN has directed the immediate prosecution of offenders of the Federal Government ban on Twitter operations in Nigeria.\n“Malami directed the DPPF to liaise with the Ministry of Communication and Digital Economy, National Communication Communication and other relevant government agencies to ensure the speedy prosecution of offenders without any further delay.”"
  },
  {
    "headline": "Twitter pushes back on Fed Govt ban",
    "summarized_story": "A digital rights group, Paradigm Initiative, has pushed back on Federal Government’s ban on micro blogging social platform, Twitter.\n“Many Nigerians read the announcement of the ban on Twitter as a reflection of the importance of the platform and other digital (social media) platforms to Nigerians in accessing information and disseminating the same.\n“It must be noted that Nigeria’s President has notably been insulated from every form of public accountability.\nThis move is therefore aimed at making him unaccountable to the people of Nigeria who constantly take to social media platforms to share their views on the actions and policies of the government.\n“It is evident that shutting down Twitter is illegal and illegitimate policies such as this are unacceptable!"
  },
  {
    "headline": "Oduduwa Republic: Igboho storms Ekiti, insists 2023 election won’t hold in S’West",
    "summarized_story": "From Priscilla Ediare, Ado-EkitiAs the agitation for the creation of Oduduwa Republic hots up, Chief Sunday Adeyemo also known as Sunday Igboho, has said that the 2023 election will not hold in states in the Southwest unless the Oduduwa Republic is created.\nHe made the declaration yesterday in Ado-Ekiti, the Ekiti State capital, in continuation of the rally for the creation of Yoruba nation.\nIgboho who arrived Ado-Ekiti metropolis around 5:02p.m was received by thousands of residents and agitators who had gathered for the event since 8:00a.m.\nHe called on all stakeholders across the region to support him and other leaders in achieving it.\nAlso speaking, the media Communication Secretary of Ilana Omo Oodua group, Maxwell Adeleye, said that the rally was aimed at sensitising the people of Ekiti on the need for the creation of Oduduwa nation."
  },
  {
    "headline": "Twitter: Malami orders prosecution of ban violators",
    "summarized_story": "In furtherance of this, the Director of Public Prosecution of the Federation (DPPF) has been directed to commence in earnest the process of prosecuting of violators of the ban in Nigeria.\nResponding to the ban placed on its operations in the country, Twitter said in a statement: “We are deeply concerned by the blocking of Twitter in Nigeria.\n“Well, I am not surprised that the Federal Government has suspended Twitter operations in Nigeria.\n“Twitter is a global platform for public communication that has expanded the frontiers of free speech and press freedom.\nWe get sense pass them.”The United States Government has described the ban on Twitter operations in the country as an infringement of the rights of Nigerians to freedom of expression."
  },
  {
    "headline": "Twitter Suspension: Editors Urge FG To Seek Legitimate Means",
    "summarized_story": "Twitter Suspension: Editors Urge FG To Seek Legitimate MeansThe Nigerian Guild of Editors (NGE) has urged the federal government to tread with caution and immediately reconsider the suspension of the operation of Twitter in Nigeria and seek other legitimate means of resolving its dispute with the company.\n‘’The Guild sees the federal government’s action as an overreaction to Twitter’s decision to delete President Muhammadu Buhari’s tweet early this week.\n‘’If the federal government finds Twitter’s action against the President objectionable, Nigerians should not be made to suffer the collateral damage of denying them their right to freely discourse on Twitter’’, the Guild added.\nNoting the socio-political and economic benefits of social media platforms, the NGE explained that strong democracies rely on both civic and political participation by citizens, saying that Twitter, has over the years, aided citizens’ participation in the nation’s democratic process.\n‘’The Guild is aware of the democratizing influence of social media platforms, including Twitter, in helping to check dictatorship and promote democracy worldwide."
  },
  {
    "headline": "Nigerians groan as telcos effect Twitter ban",
    "summarized_story": "Commenting on the development, a seasoned lawyer and Senior Advocate of Nigeria, Mr Mike Ozhekome, condemned the ban, saying that Twitter was one of the few places where Nigerians could freely express their grievances.\n‘Well, I am not surprised that the Federal Government has suspended Twitter operations in Nigeria.\nMore so, Ministries, Departments and Agencies have lately deepened the use of Twitter to disseminate information, having found it effective and cost-saving.\nTwitter in its latest update has promised to restore access to the microblogging app for Nigerians.\nWe will work to restore access for all those in Nigeria who rely on Twitter to communicate and connect with the world,’ it said."
  },
  {
    "headline": "BREAKING: Twitter Ban: Malami orders prosecution of offenders – The Sun Nigeria",
    "summarized_story": "The Attorney General of the Federation and Minister of Justice, Abubakar Malami (SAN), has ordered the immediate prosecution of offenders of the Federal Government ban on Twitter operations in the country.\nAccordingly, the Director of Public Prosecution of the Federation (DPPF) has been directed to swing into action and commence in earnest the process of prosecution of violators of the Federal Government De-activation of opetations of Twitter in Nigeria.\nThe directive followed the indefinite suspension placed on Twitter’s operations in the country by the Federal government.\n“The Federal Government has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria,” it read.\nWe will work to restore access for all those in Nigeria who rely on Twitter to communicate and connect with the world,” it said in a statement."
  },
  {
    "headline": "Twitter Ban Regressive, Overreaction, Says NPAN",
    "summarized_story": "Olawale Ajimotokan in AbujaThe Newspaper Proprietors’ Association of Nigeria (NPAN) has condemned the suspension of the operation microblogging and social networking service, Twitter, in the country by the Federal Government as “wrong and an overreaction”.\nNPAN made the denunciation Saturday in a statement signed by its President Kabiru A. Yusuf.\nThe statement warned that the action by the federal government after Twitter deleted a tweet by President Muhammadu Buhari to separatist agitators, would not win Nigeria friends.\n“Twitter is a global platform for public communication that has expanded the frontiers of Free Speech and Press Freedom.\nBanning Twitter is regressive and should be rescinded in favour of dialogue.” NPAN warned."
  },
  {
    "headline": "Twitter Ban Violates Nigerians’ Fundamental Rights, Says US",
    "summarized_story": "Michael Olugbode in AbujaUnited States has condemned the ban placed on Twitter in Nigeria, stating that it is a violation of Nigerians’ fundamental rights.\nThe United States, in a statement by its Embassy in Nigeria on Saturday said: “Nigeria’s constitution provides for freedom of expression.\nAs President Biden has stated, our need for individual expression, open public conversation, and accountability has never been greater.\nTwitter ban was announced by the Information Minister, Lai Mohammed, two days after Twitter deleted President Muhammadu Buhari’s tweet posted Tuesday wherein he threatened to deal with secessionists “in the language they understand”.\nHe had also threatened to deal with “those misbehaving today” “in the language they understand.”The ban has attracted widespread condemnations as Nigerians described it as violation of rights of citizens and a prelude to dictatorship."
  },
  {
    "headline": "Twitter Ban: APC Urges Talented Nigerians to Develop Homegrown Social Media Apps",
    "summarized_story": "Says ban in national interestBy Adedayo Akinwale in AbujaThe All Progressives Congress (APC) has called on Nigerians to defend the country’s sovereignty by supporting the federal government’s Twitter suspension, saying it is in national interest.\n“APC urges Nigerians talented in the development of social media/software applications to seize the opportunity of the suspension of Twitter operations in the country to develop homegrown applications that can rival existing social media platforms and meet the need of Nigerians.\n“Russia has VKontakte (VK), China has Weibo, among several homegrown social media platforms.\nIt recalled that it had earlier released a statement asking Twitter and other operators of social media pages to use their platforms to check divisive and inciting rhetoric, particularly in Nigeria.\nThe ruling party said it had earlier tasked social media service providers on their important responsibility to curb fake news, disinformation, hate speech, among others."
  },
  {
    "headline": "Just In: Bandits Kill 88 in Kebbi",
    "summarized_story": "By Ismail AdebayoThe police on Saturday said they had recovered 88 bodies from the eight communities attacked by bandits in Danko Wasagu local government area in Zuru Emirate of Kebbi state.\n“The killing took place in Koro, kimpi, Gaya, Dimi, Zutu, Rafin Gora and Iguenge villages, all in Danko/Wasagu LGA of Kebbi State,” he said.\nBandits had last month killed nine policemen, including a DPO while responding to a distress call by the locals in the emirate.\nThis is the fifth attack by the bandits in the emirate in less than a year.\nA source in the area said many of those who escaped the bandits attack in the eight affected communities had fled to nearby town of Riba in the emirate for safety."
  },
  {
    "headline": "Twitter Ban: Justice Minister Orders Prosecution of Violators",
    "summarized_story": "The Attorney-General of the Federation and Minister of Justice, Abubakar Malami, on Saturday, issued an order for the enforcement of the ban placed on Twitter by the Nigerian government.\nIn a statement by his spokesperson, Umar Gwandu, Malami ordered the prosecution of violators of the suspension of the operations of Twitter in Nigeria.\nTwitter ban was announced by the Information Minister, Lai Mohammed, two days after Twitter deleted President Muhammadu Buhari’s tweet posted Tuesday wherein he threatened to deal with secessionists “in the language they understand”.\nThe social media giant had said the tweet violated the Twitter Rules.\n“Malami directed the DPPF to liase with the Ministry of Communication and Digital Economy, National Communication Communication (NCC) and other relevant government agencies to ensure the speedy prosecution of offenders without any further delay.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "\"We Are Disappointed\"—Canada, Ireland, EU, UK, US Release Joint Statement On Twitter Ban In Nigeria",
    "summarized_story": "FULL STATEMENTThe diplomatic missions of Canada, the European Union (Delegation to Nigeria), the Republic of Ireland, the United Kingdom and the United States of America convey our disappointment over Nigeria's announcement suspending #Twitter and proposing registration requirements for other social media.\nWe strongly support the fundamental human right of free expression and access to information as a pillar of democracy in Nigeria as around the world and these rights apply online as well as offline.\nTwitterThese measures inhibit access to information and commerce at precisely the moment when Nigeria needs to foster inclusive dialogue and expression of opinions, as well as share vital information in this time of the COVID-19 pandemic.\nThe path to a more secure Nigeria lies in more, not less, communication to accompany the concerted efforts of Nigeria's citizens in fulsome dialogue toward unity, peace and prosperity.\nAs Nigeria's partners, we stand ready to assist in achieving these goals."
  },
  {
    "headline": "\"We Are Disappointed\"—Canada, Ireland, EU, UK, US Release Joint Statement On Twitter Ban In Nigeria",
    "summarized_story": "FULL STATEMENTThe diplomatic missions of Canada, the European Union (Delegation to Nigeria), the Republic of Ireland, the United Kingdom and the United States of America convey our disappointment over Nigeria's announcement suspending #Twitter and proposing registration requirements for other social media.\nWe strongly support the fundamental human right of free expression and access to information as a pillar of democracy in Nigeria as around the world and these rights apply online as well as offline.\nTwitterThese measures inhibit access to information and commerce at precisely the moment when Nigeria needs to foster inclusive dialogue and expression of opinions, as well as share vital information in this time of the COVID-19 pandemic.\nThe path to a more secure Nigeria lies in more, not less, communication to accompany the concerted efforts of Nigeria's citizens in fulsome dialogue toward unity, peace and prosperity.\nAs Nigeria's partners, we stand ready to assist in achieving these goals."
  },
  {
    "headline": "\"We Are Disappointed\"—Canada, Ireland, EU, UK, US Release Joint Statement On Twitter Ban In Nigeria",
    "summarized_story": "FULL STATEMENTThe diplomatic missions of Canada, the European Union (Delegation to Nigeria), the Republic of Ireland, the United Kingdom and the United States of America convey our disappointment over Nigeria's announcement suspending #Twitter and proposing registration requirements for other social media.\nWe strongly support the fundamental human right of free expression and access to information as a pillar of democracy in Nigeria as around the world and these rights apply online as well as offline.\nTwitterThese measures inhibit access to information and commerce at precisely the moment when Nigeria needs to foster inclusive dialogue and expression of opinions, as well as share vital information in this time of the COVID-19 pandemic.\nThe path to a more secure Nigeria lies in more, not less, communication to accompany the concerted efforts of Nigeria's citizens in fulsome dialogue toward unity, peace and prosperity.\nAs Nigeria's partners, we stand ready to assist in achieving these goals."
  },
  {
    "headline": "BREAKING: US Knocks Buhari-led Government Over Suspension Of Twitter’s Operation In Nigeria",
    "summarized_story": "The United States has cautioned the Muhammadu Buhari-led government over the recent suspension placed on the operations of Twitter in Nigeria.\nNigeria’s information and culture minister Lai Mohammed had on Friday announced Twitter’s suspension in a statement by his media aide, Segun Adeyemi.\nReacting to the suspension in a statement on Saturday, the US Mission in Nigeria said such suspension undermines citizens fundamental freedoms and also sends a wrong message to investors.\nThe government’s recent #Twitterban undermines Nigerians’ ability to exercise this fundamental freedom and sends a poor message to its citizens, investors and businesses.\nSee Also Internet Twitter Ban Exposed ‘Tyrant’ Buhari’s Plot To Islamize Nigeria, Says IPOB“Banning social media and curbing every citizen’s ability to seek, receive, and impart information undermines fundamental freedoms."
  },
  {
    "headline": "BREAKING: US Knocks Buhari-led Government Over Suspension Of Twitter’s Operation In Nigeria",
    "summarized_story": "The United States has cautioned the Muhammadu Buhari-led government over the recent suspension placed on the operations of Twitter in Nigeria.\nNigeria’s information and culture minister Lai Mohammed had on Friday announced Twitter’s suspension in a statement by his media aide, Segun Adeyemi.\nReacting to the suspension in a statement on Saturday, the US Mission in Nigeria said such suspension undermines citizens fundamental freedoms and also sends a wrong message to investors.\nThe government’s recent #Twitterban undermines Nigerians’ ability to exercise this fundamental freedom and sends a poor message to its citizens, investors and businesses.\nSee Also Internet Twitter Ban Exposed ‘Tyrant’ Buhari’s Plot To Islamize Nigeria, Says IPOB“Banning social media and curbing every citizen’s ability to seek, receive, and impart information undermines fundamental freedoms."
  },
  {
    "headline": "'Banning not the answer' -- UK, Canada, EU tackle FG over Twitter suspension",
    "summarized_story": "More countries, including the United Kingdom and Canada, have expressed disappointment over the suspension of Twitter’s operations in Nigeria.\nAdvertisementOn Friday, Lai Mohammed, minister of information, announced the indefinite suspension of Twitter in Nigeria.\nIn a joint statement issued on Saturday, Canada, Republic of Ireland, Norway, the European Union and the US expressed disappointment over the federal government’s announcement.\nThe foreign missions in Nigeria said the suspension of Twitter will hinder access to information and hamper businesses.\nAdvertisementThey also noted that the country will be more secure through information sharing, adding that banning systems of expression is not the way to go."
  },
  {
    "headline": "'Banning not the answer' -- UK, Canada, EU tackle FG over Twitter suspension",
    "summarized_story": "More countries, including the United Kingdom and Canada, have expressed disappointment over the suspension of Twitter’s operations in Nigeria.\nAdvertisementOn Friday, Lai Mohammed, minister of information, announced the indefinite suspension of Twitter in Nigeria.\nIn a joint statement issued on Saturday, Canada, Republic of Ireland, Norway, the European Union and the US expressed disappointment over the federal government’s announcement.\nThe foreign missions in Nigeria said the suspension of Twitter will hinder access to information and hamper businesses.\nAdvertisementThey also noted that the country will be more secure through information sharing, adding that banning systems of expression is not the way to go."
  },
  {
    "headline": "Report: Nigeria will lose N2.18bn daily to Twitter suspension",
    "summarized_story": "Nigeria will lose N2.18 billion per day for blocking the operations of Twitter, a micro-blogging and social networking platform, in the country, an estimation by NetBlocks has shown.\nAdvertisementNetBlocks, a data-driven online service, estimated the economic cost of internet disruptions on its cost of shutdown tool (COST) platform.\nAdvertisementOn Saturday morning, network access to the Twitter platform and backend servers were blocked by MTN, Globacom, Airtel, 9mobile, and other networks — the development made Nigerians move to alternative means of accessing the micro-blogging site.\nAccording to the data, if Nigeria shuts down WhatsApp, Facebook, Instagram, YouTube and Twitter, it will lose N10.9 billion daily.\nMeanwhile, the United States mission in Nigeria, as well as other local and foreign organisations have cautioned the federal government on the suspension."
  },
  {
    "headline": "Report: Nigeria will lose N2.18bn daily to Twitter suspension",
    "summarized_story": "Nigeria will lose N2.18 billion per day for blocking the operations of Twitter, a micro-blogging and social networking platform, in the country, an estimation by NetBlocks has shown.\nAdvertisementNetBlocks, a data-driven online service, estimated the economic cost of internet disruptions on its cost of shutdown tool (COST) platform.\nAdvertisementOn Saturday morning, network access to the Twitter platform and backend servers were blocked by MTN, Globacom, Airtel, 9mobile, and other networks — the development made Nigerians move to alternative means of accessing the micro-blogging site.\nAccording to the data, if Nigeria shuts down WhatsApp, Facebook, Instagram, YouTube and Twitter, it will lose N10.9 billion daily.\nMeanwhile, the United States mission in Nigeria, as well as other local and foreign organisations have cautioned the federal government on the suspension."
  },
  {
    "headline": "Twitter deletes Nnamdi Kanu's post for 'violating rules'",
    "summarized_story": "A post on Twitter by Nnamdu Kanu, leader of the proscribed Indigenous People of Biafra (IPOB), has been deleted by the social networking service.\nAdvertisementThe post, which was made on Kanu’s Twitter handle on June 2, was no longer available as of Saturday evening.\nIn the post, Kanu had threatened government officials and said “any army they send to #Biafraland will die there.\nAdvertisementThe deletion of the tweet came hours after the federal government suspended the operations of Twitter in Nigeria.\nThe federal government’s suspension also came days after Twitter deleted a post by President Muhammadu Buhari on the Civil War experience."
  },
  {
    "headline": "Twitter ban rewinds Nigeria to pre-internet darkness and reign of fear",
    "summarized_story": "An infamous banAs of the morning of Saturday June 5, most people living in Nigeria could no longer access Twitter.\nSome users say they still have access from some internet service providers, but VPNs have become the primary medium to stay on Twitter for most people.\nALTON confirms telcos have shut down Twitter in NigeriaBut of course the whole responsibility for Nigeria’s Twitter darkness lies at the top.\nBasically, any media and communication service that uses data provided by internet service providers.\nBy suspending Twitter, Nigeria has stepped into the internet control realm currently championed by China, Iran and India, a fellow country under democracy."
  },
  {
    "headline": "Twitter is ‘deeply concerned’ by Nigerian government’s suspension",
    "summarized_story": "Twitter has reacted to the indefinite suspension of the social media site by the Nigerian government, expressing concern.\nA statement by a Twitter spokesperson to TechCabal said:“The announcement made by the Nigerian Government that they have suspended Twitter’s operations in Nigeria is deeply concerning.\nIt started when Twitter deleted a tweet by President Muhammadu Buhari for violating its rules.\nIt remains to be seen when the suspension takes effect and what actions Twitter takes.\nUpdate: Twitter has now been shutdown in Nigeria."
  },
  {
    "headline": "Nigeria suspends Twitter indefinitely",
    "summarized_story": "The Federal Government has indefinitely suspended the operations of Twitter in Nigeria.\nIt was widely criticised as summoning the ghosts of the Nigeria civil war, a deadly three-year combat between the Nigerian government and a government in southeast Nigeria, which had seceded from the republic.\nImplications of the Twitter BanThe indefinite suspension of Twitter would mean that Internet Service Providers (ISP) in Nigeria like MTN and Airtel will be mandated to not give users access to Twitter.\nThe ISPs will block twitter’s IP addresses from all its users, or delete the sites from their DNS servers.\nIt remains to be seen whether the ISPs will implement such an order and how they will communicate it to their users."
  },
  {
    "headline": "5 Reasons Why You Should Consider A Loan from Page Financials",
    "summarized_story": "If you are still thinking about whether or not to consider a personal loan, we have highlighted 5 reasons why customers usually resort to getting a personal loan.\nDebt ConsolidationOne of the popular reasons to get a personal loan from Page is for debt consolidation.\nWhat To Consider When Considering A Personal LoanApplying for a Page Loan is super easy, everything happens online and you don’t need to visit their office.\nConsider avoiding a personal loan if:You can’t afford it.\nIf you can’t afford monthly payments for your new personal loan, consider skipping it."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "4 ways Nigeria’s Twitter ban could affect businesses",
    "summarized_story": "He also disclosed the government’s directive to the National Broadcasting Commission (NBC) to start licensing all over-the-top (OTT) and social media operations.\nThe Twitter ban could also affect the country’s economy.\nThese are all activities that a social media ban would hinder.\n— Mazi Juls (@AAjulibe) June 5, 2021While these businesses would find ways to innovate around the ban, their users may not.\nThere are no assurances that a ban on other social media platforms would not follow."
  },
  {
    "headline": "Nigerian government suspends access to Twitter indefinitely, Facebook, others could be next",
    "summarized_story": "The Nigerian Federal Government has announced that it will be indefinitely blocking access to microblogging and social media platform, Twitter, in Nigeria.\nOn Friday, June 4, 2021, Nigeria’s Federal Ministry of Information and Culture made this move known on its Twitter and Facebook handles.\nOver the years, Twitter has become an important social media platform for Nigerians.\nNigeria’s latest suspension means that it could order telecom companies to block access to Twitter if this move is not fought against.\nAdvertisementHowever, all signs point to the fact that the Social Media Bill could be very much alive."
  },
  {
    "headline": "Using WhatsApp On Multiple Devices, Building Africa's Tesla, Twitter Activates Subscription Service • Techpoint Africa",
    "summarized_story": "Today, I’m discussing:WhatsApp’s multi-device supportBuilding Africa’s TeslaTwitter launching Twitter BlueOne WhatsApp account, multiple devicesInstant messaging app, WhatsApp, will soon allow users to simultaneously open one account across several devices.\nWhen are these features coming?\nThough there is no launch date for these features, Zuckerberg hints at some time within the next two months.\nAdvertisementTwitter launches premium subscription serviceTwitter launched its premium subscription service, Twitter Blue, on June 3, 2021.\nWhile Twitter didn’t mention a cost, my story about the coming of Twitter Blue might give you an idea."
  },
  {
    "headline": "Nigeria loses N90.7m each hour Twitter stays blocked",
    "summarized_story": "Nigerian government’s decision to block Twitter in the country means the country loses N90.7 million ($250,600) each hour the microblogging platform stays shut down.\nRead Also: Nigerian govt hunts for VPN users as Twitter ban kicks off This is according to estimates from the Netblocks’ Cost of Shutdown Tool (COST).\nA total shutdown would cost the…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigerian govt hunts for VPN users as Twitter ban kicks off",
    "summarized_story": "Nigerian govt hunts for VPN users as Twitter ban kicks offA statement from the office of the attorney general of Nigeria has threatened to prosecute any Nigerian found to have downloaded a Virtual Private Network (VPN) with the aim to bypass the ban on Twitter.\nRead Also: As telcos enforce Nigeria’s Twitter ban, experts disagree on the legality Abubakar Malami, the minister of justice and attorney…"
  },
  {
    "headline": "As telcos enforce Nigeria’s Twitter ban, experts disagree on the legality",
    "summarized_story": "As of 12 am on Saturday, 5 June 2021, Twitter users in Nigeria using any of the four telecom operators, MTN, Globacom, Airtel, and 9Mobile started to experience limited services.\nNetblocks, a watchdog organization that monitors cybersecurity and the governance of the internet, also confirmed the restriction of Twitter in Nigeria from the morning of…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "No plan to retrench, sack workers in Edo, Obaseki reassures – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has asserted that there are no plans to either sack or retrench workers in the state, noting that ongoing reforms in the state’s civil and public service are aimed at improving productivity and service delivery to Edo people.\n“We are not going to retrench workers or sack anyone, but you must follow the new trends and conform to the new rules and if you can’t cope, you should move out from the service yourself.\nAnyone who flaunts the rule will get an automatic query and after three queries such a person leaves the system.\nAs the governor of the state, no file stays in my office beyond 48 hours,” Obaseki noted.\nOn his part, Edo State Head of Service and Chairman, Transition Committee Chairman, Barr."
  },
  {
    "headline": "We’ll enact laws to improve economy – Obaseki – Nigerian Observer",
    "summarized_story": "Godwin Obaseki of Edo has expressed his administration’s readiness to enact laws and strengthen existing ones to improve the state’s economy.\nObaseki said this while addressing participants at the Edo State Transition Committee’s engagement with artisans on Friday in Benin.\nObaseki assured the artisans that his administration was open and accountable to the people of the state including tax payers.\nHe said his government had been working to eliminate cash payment for tax across the state to minimise corruption.\n“We are simplifying the tax system in the state to encourage more people to key into the tax system."
  },
  {
    "headline": "FG suspends Twitter’s operations in Nigeria – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Federal Government has suspended indefinitely, the operations of the microblogging and social networking service, Twitter in Nigeria.\nThe Minister of Information and Culture, Alhaji Lai Mohammed, announced the suspension in a statement in Abuja on Friday.\nThe minister cited the persistent use of the platform for activities capable of undermining Nigeria’s corporate existence.\nHe said the Federal Government had also directed the National Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in the country.\nThe statement was released by Mr Segun Adeyemi, Special Assistant to the President (Media), office of the Minister."
  },
  {
    "headline": "World Environment Day: Obaseki reiterates commitment to restoring forest reserves – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has reiterated his administration’s commitment to collaborate with environmentalists, community leaders and other stakeholders to restore forest reserves in the state.\nObaseki made the call in commemoration of the World Environment Day, marked on June 5 each year, by the United Nations and its partners.\nGlobal greenhouse gas emissions have grown for three consecutive years and the planet is one pace for potentially catastrophic climate change.\n“The emergence of COVID-19 has also shown just how disastrous the consequences of ecosystem loss can be.\nBy shrinking the area of natural habitat for animals, we have created ideal conditions for pathogens – including coronaviruses – to spread.”..."
  },
  {
    "headline": "#TwitterBan: Malami’s prosecution threat lacks legal backing – Lawyers",
    "summarized_story": "The threat by the Attorney General of the Federation and Minister of Justice, Abubakar Malami, to prosecute “violators” of the government’s ban on Twitter operations in Nigeria lacks legal basis, some lawyers have argued.\n“Mr Malami’s directive to the DPP of Nigeria has no legal backing,” Mr Omirhobo said.\nADVERTISEMENT‘Disregard prosecution threat’While lampooning the minister on Twitter on Saturday, Inibehe Effiong, urged Nigerians to disregard his threat.\nIn his tweet, Mr Effiong, a human rights lawyer, said inter alia, “…this is supposed to be a Senior Advocate of Nigeria.\nThis declaration of suspension is dictatorial and a direct attack on the democratic rights of Nigerians to freely express themselves."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Twitter ban: US, UK, EU, Canada, Norway, Ireland others knock Buhari",
    "summarized_story": "The United States (US), the United Kingdom (UK), the European Union (EU), the Canada, Republic of Ireland and Norway have expressed disappointment over the decision of Nigerian government to ban Twitter operations in the country.\nRecall that the President Muhammadu Buhari led government, through the Ministry of Information, had on Friday, slammed an indefinite suspension on Twitter after the platform yanked off a tweet by the president making reference to the civil war.\nAmid the outrage, however, the presidency on Saturday said the ban was temporary.\n“Banning systems of expression is not the answer.\n“As Nigeria’s partners, we stand ready to assist in achieving these goals,” they said."
  },
  {
    "headline": "Presidency justifies ‘Temporary suspension’ of Twitter, says it’s to limit violent consequences of fake news",
    "summarized_story": "The presidency has justified what it called a temporary suspension of Twitter’s operations in Nigeria, noting that it is part of efforts to prevent the violent consequences usually linked to the spread of fake news and misinformation.\nLai Mohammed, minister of information, had announced the “indefinite” suspension of Twitter’s operations in Nigeria on Friday, sparking angry reactions.\nHowever, in a statement on Saturday, Garba Shehu, presidential spokesman, said the suspension of Twitter in Nigeria is not only because Buhari’s post was deleted, even as he hinted that the ban was temporary.\n“The temporary suspension of Twitter is not just a response to the removal of the President’s post.\nThere has been a litany of problems with the social media platform in Nigeria, where misinformation and fake news spread through it have had real world violent consequences."
  },
  {
    "headline": "Ikire/Apomu robbery: Oyebamiji, visits damaged police station, donates half a million for it’s renovation",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun Commissioner For Finance, Mr Bola Oyebamiji on Friday, paid a condolence/inspection visit to the Ayedaade Divisional Police Headquarters, Ikire, which was attacked by dare devil armed robbers last Wednesday.\nOyebamiji who was accompanied on the visit by his wife, Chief Dr Mrs Shekinat Oyebamiji and some chieftains of the All Progressives Congress (APC) in Ayedaade/Irewole/Isokan Federal Constituency, donated the sum N500,000 for immediate renovation of the police station.\nOyebamiji who also paid a condolence visit to the families of civilians whose lives were cut short during the attack, described the robbery attack and the gruesome murder of innocent citizens as barbaric.\n“This sight is shocking and very sad to behold, I can’t imagine why people will be so cruel to attack unsuspecting police officers at the police station.\nIt’s a sad day indeed for residents of Ikire and Apomu, the entire federal constituency is in a mourning mood,” he said."
  },
  {
    "headline": "Osun West apex APC caucus, Igbimo Agba backs Oyetola’s second term bid",
    "summarized_story": "Sunday OguntuyiThe All Progressives Congress (APC) apex caucus, Igbimo Agba in Osun West Senatorial District, on Friday unanimously agreed to back the second term bid of the State governor, Alhaji Adegboyega Oyetola and the deputy governor, Mr. Benedict Olugboyega Alabi.\nThe West apex caucus in the communique issued after its meeting held at the residence of Professor O. Oladipo in Iwo, passed a vote of confidence in the leadership and governing style of Governor Oyetola, and supported his 4+4 continuity agenda.\nThe body futher resolved to do all within its means to vigorously pursue the 2nd term agenda of the governor, to ensure total victory for the APC in the gubernatorial election of 2022.\nThey also dissociated themselves from any attempts by anybody from the West Senatorial District to present himself or herself as a gubernatorial aspirant for the 2022 election, and urged all who might have gubernatorial ambitions to reserve their energy and resources until 2026 when the West Agenda would be revived and vigorously pursued in the overall interest of “our people.”West Igbimo Agba also passed a vote of confidence in the leadership of Prince Famodun Adegboyega to lead APC to victory in the incoming gubernatorial elections in Osun State."
  },
  {
    "headline": "Twitter Ban: Read The Constitution And Be Educated, Melaye Tackles Malami",
    "summarized_story": "A former member of the National Assembly, Senator Dino Melaye, has berated the Attorney-General of the Federation and Minister of Justice, Abubakar Malami (SAN) over the latter’s threat to prosecute violators of the Federal Government’s ban on Twitter in Nigeria.\nLEADERSHIP reports that AGF Malami on Saturday threatened to prosecute violators of the Federal Government’s Twitter ban after reports surfaced that some Nigerians were using alternative ways of accessing Twitter service in the country.\nMelaye, who took to his verified social media handles on Saturday evening, admonished the Minister of Justice to go and read the nation’s constitution and be educated.\nThe former Senator wrote: “Malami cannot arrest even a fly because he is not the law.\nAGF Malami go and read the Constitution Section 36(12) and be educated."
  },
  {
    "headline": "Twitter Ban: Read The Constitution And Be Educated, Melaye Tackles Malami",
    "summarized_story": "A former member of the National Assembly, Senator Dino Melaye, has berated the Attorney-General of the Federation and Minister of Justice, Abubakar Malami (SAN) over the latter’s threat to prosecute violators of the Federal Government’s ban on Twitter in Nigeria.\nLEADERSHIP reports that AGF Malami on Saturday threatened to prosecute violators of the Federal Government’s Twitter ban after reports surfaced that some Nigerians were using alternative ways of accessing Twitter service in the country.\nMelaye, who took to his verified social media handles on Saturday evening, admonished the Minister of Justice to go and read the nation’s constitution and be educated.\nThe former Senator wrote: “Malami cannot arrest even a fly because he is not the law.\nAGF Malami go and read the Constitution Section 36(12) and be educated."
  },
  {
    "headline": "Twitter Suspension Is Temporary, Says Presidency",
    "summarized_story": "The presidency has said that the suspension of Twitter in Nigeria is temporary even though it wasn’t just a response to the deletion of President Muhammadu Buhari’s tweets.\n“The temporary suspension of Twitter is not just a response to the removal of the President’s post.\n“There has been a litany of problems with the social media platform in Nigeria, where misinformation and fake news spread through it have had real world violent consequences.\nIt is a basic principle of security services response world over.\n“Twitter does not seem to appreciate the national trauma of our country’s civil war."
  },
  {
    "headline": "Twitter Suspension Is Temporary, Says Presidency",
    "summarized_story": "The presidency has said that the suspension of Twitter in Nigeria is temporary even though it wasn’t just a response to the deletion of President Muhammadu Buhari’s tweets.\n“The temporary suspension of Twitter is not just a response to the removal of the President’s post.\n“There has been a litany of problems with the social media platform in Nigeria, where misinformation and fake news spread through it have had real world violent consequences.\nIt is a basic principle of security services response world over.\n“Twitter does not seem to appreciate the national trauma of our country’s civil war."
  },
  {
    "headline": "Incitement: Twitter Deletes Nnamdi Kanu’s Tweets",
    "summarized_story": "Popular microblogging platform, Twitter, has deleted a tweet from the fugitive leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu, for violating its rules.\nIPOB is an outlawed separatist group agitating for the Republic of Biafra away from Nigeria.\nTwitter’s deletion of Kanu’s tweets is coming barely 24 hours after the Federal Government of Nigeria suspended the social media platform’s operations in the country including accusing it of double standard and undermining Nigeria’s corporate existence.\nLEADERSHIP reports that the suspension of Twitter was announced two days after Twitter had deleted President Muhammadu Buhari’s controversial tweets about the Biafran war, which some Nigerians found offensive.\nHe also used derogatory words to describe Kaduna State governor, Nasir El-Rufai, presidential media aides: Femi Adesina and Garba Shehu."
  },
  {
    "headline": "PDP satires Malami, Buhari govt for ordering arrest of Nigerians still using Twitter",
    "summarized_story": "The Peoples Democratic Party, PDP, has declared Attorney-General of the Federation, AGF, and Minister of Justice, Abubakar Malami’s order to arrest and prosecute Nigerians using Twitter as illegal, null and void.\nBut the PDP said that nothing in the country’s extant laws, “not even the suspension of @Twitter in Nigeria, constitutionally criminalized the use of Twitter by Nigerians or empowers the Federal Governments to arrest and prosecute any Nigerians for using @Twitter.\n“Moreover, they should also realize that the suspension of @Twitter by the @OfficialAPCNg Federal Government, in addition to its unconstitutionality, only suspended @Twitter operations and not the use of @Twitter by Nigerians.\nPDP described the AGF’s directive to arrest and prosecute those using the social media platform as an attempt to suspend the 1999 Constitution.\nTwitter was suspended in Nigeria on Friday after the social media platform deleted President Buhari’s tweet a few days earlier."
  },
  {
    "headline": "Just In: US kicks against ban on Twitter by Buhari govt",
    "summarized_story": "The United State Government has kicked against President Muhammadu Buhari government’s decision to ban Twitter in the country.\nThe US condemned the ban and described it as a poor message to citizens and investors.\nThe US Mission in Nigeria in a statement on Saturday said the Nigerian constitution provides for freedom of information.\nIn a statement, the US Mission said, “Nigeria’s Constitution provides for freedom of Information.\n“Banning social media and curbing every citizen’s ability to seek, receive, and impart information undermines fundamental freedom."
  },
  {
    "headline": "Why we suspended twitter temporary",
    "summarized_story": "Senior Special Assistant to the President, Muhammadu Buhari on media and publicity, Garba Shehu, has said the temporary suspension of Twitter is not just a response to the removal of the President’s post.\n“A terrorist organisation (IPOB) poses a significant threat to the safety and security of Nigerian citizens.\n“When the President said that they will be treated “in a language they understand,” he merely reiterated that their force shall be met with force.\nIt is a basic principle of security services response world over.\n“This is not promotion of hate, but a pledge to uphold citizens’ right to freedom from harm."
  },
  {
    "headline": "Kaduna spends N211m monthly on refuse evacuation — Commissioner —",
    "summarized_story": "The Kaduna State Government says it spends N211 million monthly on refuse evacuation across the three metropolitan cities in the state.\nAccording to him, Kaduna state which hosts the third largest city in the country generates huge refuse due to increase in population and indiscriminate disposal.\nHe said that the heaps of refuse were being evacuated mainly from Zaria, Kafanchan and Kaduna metropolises.\nIbrahim added that the state government engaged the services of refuse contractors to ensure proper evacuation of refuse across the state.\nHe also urged residents to take ownership of the exercise by informing government whenever refuse were not promptly evacuated."
  },
  {
    "headline": "Igbo group condemns IPOB, commits to united Nigeria",
    "summarized_story": "By Muhammad Adam/YolaThe National Igbo Cultural Association of Nigeria, Adamawa chapter, has affirmed its commitment to Nigeria as an indivisible nation.\n“On behalf of the Igbo community, we condole with the government and people of Adamawa, and family of late Gulak.\n“It was shocking, when we heard that Alhaji Ahmed Gulak, the former Speaker of Adamawa State House of Assembly, was killed in Imo state; his death really pained us.\nHe also said that Igbo people residing in the northern region were not happy with the current development in the South East region.\nUmeh, however, said that no one had threatened the lives of Igbo people in the state since the killing of Gulak, adding “we are living and conducting our businesses peacefully’’."
  },
  {
    "headline": "Deeper Life founder Kumuyi hits 80, Buhari sends message",
    "summarized_story": "By Kazeem UgbodagaGeneral Superintendent of the Deeper Christian Life Ministry, Pastor William Folorunso Kumuyi, turns 80 years today, as President Muhammadu Buhari sends message.\nKumuyi was born on June 6, 1941 and founded Deeper Life on September 20, 1973.\nAs Pastor Kumuyi reaches the milestone, the President prayed that his vision for the country would be realized, and the works of his hands would continue to prosper.\nHis father was a member of the Anglican Church.\nAccording to an article in The Sun (Nigeria), Kumuyi is also said to be “a one-time member of the Anglican Church (now Anglican Communion), Celestial Church of Christ, Scripture Union (SU) movement and Apostolic Faith before breaking away to found Deeper Life.”"
  },
  {
    "headline": "Deadliest attack: 100 villagers killed by gunmen",
    "summarized_story": "At least 100 people were killed in a “barbaric attack” by gunmen targeting a village in north-eastern Burkina Faso, President, Roch Kabore said on Saturday.\nThe death toll was higher than was recorded in the massacre of villagers in Nigeria’s Kebbi state on Thursday.\nIt was the deadliest attack in Burkina Faso in years, and according to the AIB state news agency, the number of victims may still rise.\nBorrell said at least 14 people were killed by armed gunmen in Oudalan province, also in the Sahel region, around the same time.\nBurkina Faso, which was long spared from attacks, has seen a significant increase in terrorist violence since 2015."
  },
  {
    "headline": "BREAKING: Twitter Deletes Nnamdi Kanu’s ‘Genocidal’ Tweet",
    "summarized_story": "Twitter, the world’s largest microblogging site, has purportedly removed tweets by Mazi Nnamdi Kanu, the Supreme Leader of the Indigenous People of Biafra, IPOB, for breaking the bird app’s guidelines.\nAccording to NEWS DIRECT, the tweet was placed on Kanu’s Twitter account on June 2, but it was no longer accessible as of Saturday evening.\nAccording to reports, the tweet was issued in response to the federal government’s decision to intervene in attacks on security formations in the southeast, which have resulted in the deaths of a number of security personnel.\nLai Mohammed, who announced the indefinite suspension of Twitter in Nigeria, claimed that the social media networking site was instigating violence and spreading fake news in the country, charges that many Nigerians have long denied and the suspension extensively criticised by the international community.\nThe president, through Garba Shehu, also reacted to the development, alleging that the federal government’s intention to restrict twitter operations in the country is just to protect Nigerians from unwanted social media influences."
  },
  {
    "headline": "Just In: Buhari Finally Makes U-turn, Says Twitter Ban Is Temporary",
    "summarized_story": "Following national criticism, President Muhammadu Buhari reversed his position on the indefinite ban on Twitter in Nigeria on Saturday night, stating that the restriction is just temporary.\nFollowing the removal of Mr Buhari’s warning to repeat civil war carnage in south eastern Nigeria from the microblogging site Twitter, Lai Mohammed declared on Friday that Twitter in Nigeria had been suspended indefinitely.\nMr Buhari’s spokeswoman, Garba Shehu, has now said that the ban is only temporary, not forever, as Mr Mohammed had previously suggested.\nRead the entire statement here:Read full statement:PRESIDENTIAL STATEMENT ON TWITTER SUSPENSION IN NIGERIThe temporary suspension of Twitter is not just a response to the removal of the President’s post.\nNevertheless, the removal of President Buhari’s tweet was disappointing."
  },
  {
    "headline": "Yoruba will break-away from Nigeria latest by December, says Sunday Igboho",
    "summarized_story": "The Ekiti State capital, Ado-Ekiti, was agog on Saturday as hundreds of Yoruba nation agitators, led by Ilana Omo Oodua, marched in from surrounding South-West states for a rally.\nThe agitators attacked the capital city, led by popular Yoruba Nation agitator Sunday Adeyemo, popularly known as Sunday Igboho, to seek Yorubaland’s independence.\nHe said that it is high time Yoruba nation break-away from Nigeria and chart a new course for itself, adding that the Nigerian environment has been consistently harsh to the Yoruba people at the advantage of the Fulanis.\nIgboho noted that everything would be done to ensure the emancipation of the region from the clutches of “evil-genius oppressors”, saying that Yoruba nation would break-away latest by the ending of December, this year.\n“Yoruba is the most educated race in Nigeria, but are these graduates getting jobs, no."
  },
  {
    "headline": "Yoruba Nation AgitatorsYoruba Nation Agitators Are Foolish – Aregbesola",
    "summarized_story": "Rauf Aregbesola, Minister of Interior, remarked on Saturday that people leading and supporting the Yoruba Nation agitation are dumb, stating, “They should contemplate the implications of war.”During his 64th birthday party at Zenabab Hotel in Ilesha, Osun State, Aregbesola emphasized that agitators must regard the women, children, the elderly, and persons with disabilities who are the most affected.\nHe said Nigeria must be more united else African countries will be enslaved once again.\nHe noted that Nigeria is the country that will liberate Africa from all oppressions therefore Nigerians must not give nod to secessionists.\n“Anything that threatens and creates a problem for Nigeria may cause backwardness for our country for 50 years,” he added."
  },
  {
    "headline": "Breaking: FG suspends Twitter indefinitely in Nigeria",
    "summarized_story": "The Federal Government has suspended, indefinitely, the operations ofthe microblogging and social networking service, Twitter, in Nigeria.\nThe Minister of Information and Culture, Alhaji Lai Mohammed,announced the suspension in a statement issued in Abuja on Friday, citing the persistent use of the platform for activities that are capable of undermining Nigeria’s corporate existence.\nThe Minister said the Federal Government has also directed theNational Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in Nigeria.\nDetails loading…"
  },
  {
    "headline": "Arms proliferation: Nigerians alarmed as insecurity heightens",
    "summarized_story": "The Chief of Defence Staff (CDS), Gen. Lucky Irabor, recently decried the proliferation of illegal arms in Nigeria, saying it was a threat to the country’s corporate existence.\nA security expert, Dr. Don Belema, in his view, blamed it on the lack of harmonious relationships among security agencies in arms proliferation and poor border management.\nWe need to look at it and see how to move regulations that could control small arms in the country.\n“There is a committee of federal government bodies that are in charge of small arms proliferation and prevention.\n“They should work and share intelligence not only with relevant national security agencies, but also neighbouring countries and regional organs like ECOWAS."
  },
  {
    "headline": "Breaking: Tuchel strikes fresh Chelsea deal",
    "summarized_story": "Chelsea manager Thomas Tuchel has signed a contract extension until the summer of 2024.\nTuchel, 47, signed an initial 18-month deal when he replaced Frank Lampard as Blues boss in January.\nHe led the club to victory in the Champions League final and a fourth-placed finish in the Premier League.\nChelsea were ninth in the Premier League and without a win in five games when Tuchel was appointed at the start of the year.\nThe London club also reached the FA Cup final, where they were beaten 1-0 by Leicester at Wembley."
  },
  {
    "headline": "Digital Economy: IT, Key To The Future, Says Westgate Boss -NigPilot",
    "summarized_story": "Despite the economic downturn occasioned by the COVID-19 outbreak and against the backdrop of the emerging digital economy, the information technology sector remains the key to the future.\nThis was disclosed by the managing director of Westgate Technologies, Mrs Ijeoma Ezeudu, on Thursday during the opening of a Westgate retail store in Abuja.\n“We’ve have been in this Abuja for the past 10 years but as a company, Westgate has been in existence for the past 16 years, we have that vision to take IT to the highest level.\nSo, despite the pandemic, it is quite challenging but we have to keep pushing,” she said.\nOn the impact of the COVID-19 pandemic on the company, Ezeudu said: “We can’t really quantify but all we know is all the SMEs have been affected."
  },
  {
    "headline": "Nigeria now has capacity to produce SIM cards, smartphones for Africa – Pantami -NigPilot",
    "summarized_story": "Nigeria has developed capacity to produce SIM cards and smartphones not only for the use of Nigerians alone but for the entire continent of Africa, Minister of Communications and Digital Economy, Ali Isa Pantami, has disclosed.\nSpeaking at the event organized by a support group known as APC Professionals Forum, Pantami said Nigeria has capacity to produce a minimum of 200 million SIMS annually.\n“When this administration came on board, even SIM cards were imported to Nigeria but as it is today, the federal government has provided an enabling environment for the private sector and as it is today, we have the capacity to produce SIM cards not only for our consumption but for the entire African continent.\n“We have the capacity to produce a minimum of 200 million SIMS annually.\nToday in Nigeria, we are producing smartphones.”"
  },
  {
    "headline": "Improve on Attahiru’s legacy, CNS tasks COAS -NigPilot",
    "summarized_story": "Chief of the Naval Staff (CNS), Vice Admiral Awwal Gambo has charged the newly appointed Chief of Army Staff (COAS), Major General Farouk Yahaya to improve on the legacy of his predecessor, late Lt. Gen. Ibrahim Attahiru.\nVice Admiral Gambo gave this charge when the new Chief of Army Staff (COAS) , Major General Faruk Yahaya paid him a courtesy visit at the Naval Headquarters.\nYou should equally pick up from where the late COAS, Lieutenant General Ibrahim Attahiru left from and improve upon those ideas”.\nEarlier, the Chief of Army Staff, Major General Faruk Yahaya said he was in the Naval Headquarters to formally inform the CNS that he had reported and taken over duty following his appointment as the 22nd COAS.\nMajor General Yahaya promised to ensure cooperation with other security agencies and stakeholders as the challenges confronting the security agencies are multi-faceted and would require a multi-faceted approach."
  },
  {
    "headline": "Accurate data for Persons with Disabilities ready soon- Lalu",
    "summarized_story": "The Executive Secretary Ncpwd Mr. James Lalu has pledged his support to the National Population Commission to ensure that disability data is not taken for laxity.\nIn his welcoming address the Executive Secretary National Commission for Persons with Disabilities Mr. James Lalu thanked the Coalition for putting together such initiatives.\nHowever, at the Global Disability Summit, disability data was on the front burner and so he will ensure that accurate data of persons with Disabilities in the upcoming 2022 Census are taken seriously.\nDr. Irene also urged the disability community to take ownership of the project and drive it to success.\nThe Executive Director of DINABI, Olajide Funso who spoke on Disability Data/Statistics in Nigeria according to him, unreliable, non-disaggregated, estimation-based and completely under-represented the disability community."
  },
  {
    "headline": "FG Didn’t ‘Temporarily’ Ban Twitter Just For Deleting Buhari’s Tweets – Presidency",
    "summarized_story": "The Presidency on Saturday said its decision to “temporarily” ban Twitter wasn’t a “knee-jerk reaction” to the social media network’s deletion of President Muhammadu Buhari’s tweets.\n“There has been a litany of problems with the social media platform in Nigeria, where misinformation and fake news spread through it have had real world violent consequences.\nThis could tear some countries apart.”The Federal Government announced an “indefinite suspension” of Twitter operations in Nigeria on Friday.\nThe decision to suspend Twitter has been criticised by many, but the Presidency in its Saturday statement insisted it was a justified move“.\n“Twitter does not seem to appreciate the national trauma of our country’s civil war."
  },
  {
    "headline": "Top Diplomatic Missions ‘Disappointed’ With FG’s Twitter Ban",
    "summarized_story": "Prominent diplomatic missions to Nigeria, including Canada, the US, the UK and the EU, on Saturday said they were let down by the decision to suspend Twitter operations in Nigeria.\nThe Federal Government suspended the social network’s operations on Friday after Twitter deleted tweets from the official account of President Muhammadu Buhari.\nThe tweets, which Twitter said ran afoul of its policies, had referenced the country’s infamous civil war.\n“The path to a more secure Nigeria lies in more, not less, communication to accompany the concerted efforts of Nigeria’s citizens in fulsome dialogue toward unity, peace and prosperity.\n“Banning social media and curbing every citizen’s ability to seek, receive, and impart information undermines fundamental freedoms."
  },
  {
    "headline": "#TwitterBan: Malami Orders Prosecution Of Offenders",
    "summarized_story": "Attorney General of the Federation and Minister of Justice, Abubakar Malami has directed the immediate prosecution of offenders of the Federal Government’s ban on Twitter operations in Nigeria.\nThis was announced in a statement issued by the Office of the Attorney General of the Federation and Minister of Justice on Saturday.\nSpokesperson of the Ministry, Umar Jibrilu Gwandu said the AGF has directed DPPF to swing into immediate action and commence prosecution of the violators of the ban.\n“Malami directed the DPPF to liase with the Ministry of Communication and Digital Economy, National Communication Communication (NCC) and other relevant government agencies to ensure the speedy prosecution of offenders without any further delay,” the statement read in part.\nThe Federal Government of Nigeria on Friday announced the indefinite suspension of Twitter in the country."
  },
  {
    "headline": "At Least 66 Killed In Kebbi After Gunmen Attacks",
    "summarized_story": "At least 66 people are said to have been killed in attacks launched by gunmen on several communities in Danko-Wasagu local government area of Kebbi State.\nKebbi is in the northwest where bandits have been active in recent times.\nMeanwhile, bandits have attacked communities in Igabi and Chikun Local Government Areas of Kaduna State killing five persons and leaving two others injured.\nA church building belonging to the Assemblies of God church and one house was burnt by the attackers during the operation.\nGovernor Nasir El-Rufai in reaction condoled families of the deceased and prayed that God grants them eternal rest."
  },
  {
    "headline": "#EndSARS: Autopsy Conducted On 99 bodies, Three From Lekki Toll Gate – Pathologist",
    "summarized_story": "The pathologist, who was involved in coroner services through the office of the Chief Medical Examiner of Lagos State, said the 99 bodies were picked up from different locations by officers of the Lagos State Environmental Health Monitoring Unit, LASEHMU.\nOf these 99 bodies, the pathologist said that only three were identified as victims of the Lekki shootings.\n“X-ray conducted prior to touching the body showed no bullet or pellets in the body,” the witness said.\nCounsel to the Lagos State Government, Olukayode Enitan objected to the granting of the application.\nThe panel then ordered the pathologist, Prof Obafunwa to produce the records and autopsy reports of the remaining 96 bodies."
  },
  {
    "headline": "Develop alternative, competitive social media applications, APC challenges talented Nigerians",
    "summarized_story": "The All Progressives Congress (APC) has urged Nigerians talented in the development of social media/software applications to seize the opportunity of the suspension of Twitter operations in the country to develop homegrown applications that can rival existing social media platforms and meet the need of Nigerians.\nRussia has VKontakte (VK), China has Weibo, among several homegrown social media platforms.\nAccording to the party, Nigeria has the potential and talents that can develop alternative and competitive applications to existing platforms in the world.\nIt further stated that twitter’s suspension will undoubtedly serve as a positive trigger to unleash the creative potentials of Nigerians in the global digital space.\nRecall that the APC had earlier released a statement asking Twitter and other operators of social media pages to use their platforms to check divisive and inciting rhetoric, particularly in Nigeria."
  },
  {
    "headline": "Twitter Ban: Malami orders prosecution of offenders",
    "summarized_story": "The Attorney General of the Federation, Abubakar Malami has ordered the prosecution of offenders of the Federal Government ban on Twitter operations in Nigeria.\nThe AGF directed the Director of Public Prosecution of the Federation (DPPF) at his office to swing into action and commence in earnest the process of prosecution of violators of the Federal Government De-activation of operations of Twitter in Nigeria.\nThe DPPF is to liase with the Ministry of Communication and Digital Economy, National Communication Communication (NCC) and other relevant government agencies to ensure the speedy prosecution of offenders without any further delay."
  },
  {
    "headline": "Bandits Attack: Kebbi Governor Visits Danko/Wassagu, commiserates with",
    "summarized_story": "Kebbi state governor, Atiku Bagudu has visited Danko/Wassagu local government area where suspected bandits killed over eighty persons.\nBagudu was in the local government in company of some of his cabinet members to commiserate and condole the people over the attack.\nThe governor pleaded with the people to remain calm as government is doing all within it’s powers to restore normalcy in the area.\nThe youth are calling on the authority to redouble effort in finding a lasting solution to the deteriorating security challenges.\nAdvertisementA reliable source in the village says the number of casualty figures have risen to ninety two persons while several others have sustained injuries."
  },
  {
    "headline": "We’ll Work to Restore Access, Twitter Reassures Nigerians",
    "summarized_story": "American microblogging and social networking service, Twitter says it’s working to restore access for all Nigerians who rely on social media site to communicate and connect with the world.\nThe Nigerian government on Friday indefinitely suspended Twitter operations in the country, accusing the microblogging platform of undermining Nigeria’s existence.\nThe company said, “We are deeply concerned by the blocking of Twitter in Nigeria.\nAccess to the free and #OpenInternet is an essential human right in modern society.\nWe will work to restore access for all those in Nigeria who rely on Twitter to communicate and connect with the world.”By Abel Ejikeme"
  },
  {
    "headline": "Nigeria to Prosecute Citizens Who Disregard Twitter Ban – Arise News",
    "summarized_story": "The Nigerian government has ordered the prosecution of citizens who bypass the country’s firewall and continue the use of Twitter despite the ban in the country.\nThe West African country’s Minister of Justice and Attorney General of the Federation, Abubakar Malami gave the order on Saturday in a statement where he directed the Director of Public Prosecution of the Federation (DPPF) to prosecute offenders of the Federal Government ban on Twitter operations in Nigeria.\n“The AGF directed the Director of Public Prosecution of the Federation (DPPF) at his office to swing into action and commence in earnest the process of prosecution of violators of the Federal Government de-activation of operations of Twitter in Nigeria,” the statement signed by Umar Gwandu, a special assistant to the minister read.\n“The DPPF is to liase with the Ministry of Communication and Digital Economy, National Communication Communication (NCC) and other relevant government agencies to ensure the speedy prosecution of offenders without any further delay.”"
  },
  {
    "headline": "Twitter Ban Projects Nigeria as a Dictatorship: Editors",
    "summarized_story": "Editors in Nigeria have called on the federal government to immediately reconsider the suspension of operations of Twitter as the move projects the Nigerian government as a dictatorship.\n‘’The Guild sees the federal government’s action as an overreaction to Twitter’s decision to delete President Muhammadu Buhari’s tweet early this week.\n‘’If the federal government finds Twitter’s action against the President objectionable, Nigerians should not be made to suffer the collateral damage of denying them their right to freely discourse on Twitter’’, the Guild added.\n‘’Certainly, the federal government has the responsibility to safeguard the unity, peace and stability of Nigeria and any person or group that threatens this must draw its ire.\n‘’The Guild is aware of the democratizing influence of social media platforms, including Twitter, in helping to check dictatorship and promote democracy worldwide."
  },
  {
    "headline": "G7 Nations Strike Deal to Tax Big Companies and Squeeze Havens",
    "summarized_story": "“G7 finance ministers have reached a historic agreement to reform the global tax system to make it fit for the global digital age,” British finance minister Rishi Sunak said after chairing a two-day meeting in London.\nU.S. President Joe Biden’s administration gave the stalled talks fresh impetus by proposing a minimum global corporation tax rate of 15%, above the level in countries such as Ireland but below the lowest level in the G7.\nGerman finance minister Olaf Scholz said the deal was “bad news for tax havens around the world”.\n“Companies will no longer be in a position to dodge their tax obligations by booking their profits in the lowest-tax countries,” he added.\nIrish finance minister Paschal Donohoe, whose country is potentially a big loser with its 12.5% tax rate, said any global deal also needed to take account of smaller nations."
  },
  {
    "headline": "Nigeria: It Will Affect Investors Confidence, Oyo Governor Makinde Asks FG to Reverse Twitter Ban",
    "summarized_story": "Governor of Nigeria’s southwestern Oyo State, Seyi Makinde says the federal government’s decision to ban Twitter operations in the country will affect investor’s confidence and called on the Nigerian leader to reverse the decision.\n“Twitter has become the platform for young people and indeed all Nigerians to exercise their fundamental right to express and publish an opinion.\n“We should also remember that Twitter has gone beyond a source of communication for many of our hardworking youths in Nigeria.\n“Furthermore, I believe the Federal Government should be actively interested in how certain policies and action will affect investor confidence.\nI, therefore, use this medium to appeal to the Federal Government to reverse this suspension for the greater good of Nigerians.”By Abel Ejikeme"
  }
]