[
  {
    "headline": "FG’ll look into ASUU’s grievances, strike threat – Ngige",
    "summarized_story": "The Minister of Labour and Employment, Chris Ngige, on Wednesday, stated that the Federal Government would look into the threat by the Academic Staff Union of Universities.\nIn 2021, the union issued fresh threats and gave the Federal Government a three-week ultimatum to address its grievances.\nNgige, however, told one of our correspondents, “The truth is that ASUU’s grievances are with the NUC, the Ministry of Education and the Ministry of Communications and Digital Economy.\nThe Chairman, ASUU, Owerri Zone, Prof Uzo Onyebinama, and a former Investment Secretary of the union, Charles Ononuju, were at the conference.\nMembers of the union had earlier attended an enlarged meeting with other bodies such as the None Academic Staff Union and Senior Staff Union of Universities, where they hinted of the plan to embark on another round of indefinite."
  },
  {
    "headline": "We assembled 100 presidential materials, says 2022 Committee",
    "summarized_story": "The 2022 Committee, which is an association of businessmen, political figures and others, has stressed the need for Nigeria to produce quality leaders in next year’s elections.\nA Co-convener of the committee, Kashim Ibrahim-Imam, in an interview on Channels Television’s Politics Today programme on Wednesday, said the group was not partisan, but assembled 100 presidential materials.\nIn a statement jointly signed by Imam and another co-convener, Nduka Obaigbena, who is ThisDay Newspapers Publisher, the committee stated that it was interested in quality leadership that would emerge in 2023.\nHe noted that the 100 people that were part of the committee were all presidential materials.\nHe stated, “Nigeria is in crisis, we are ready to rescue Nigeria."
  },
  {
    "headline": "2022 Census: NPC inaugurates technical working group",
    "summarized_story": "By Chris OchayiABUJA: As the preparations for the conduct of the 2022 population and housing census, gathers momentum, the National Population Commission, NPC, has inaugurated the Census Technical Working Group, CTWG.\nThe CTWG is charged with the responsibility of supervising the entire census project, providing guidance on all technical issues relating to the census project and serve as a clearing house for all census matters subject to the approval of the Commission.\nIn a welcome address, the Chairman of the Census Committee of the Commission, Dr. Ipalibo Macdonald Harry noted that the constitution of the CTWG is a necessary step towards enhancing the technical quality of the entire census process.\nThe CTWG is also to develop Census Logistics plans, periodically report progress and challenges to the Commission and develop terms of reference and make recommendations on the composition of relevant national census committees.\nWhile alluding to the description of census taking as a war, Dr. Opiyo however opined that census “is a voluntary war one that must be fought peacefully”."
  },
  {
    "headline": "Police raid suspected ESN camps, kill 3 commanders, arrest 9 in Imo",
    "summarized_story": ",By Chinonso Alozie, OwerriThe operatives of the Imo State Police Command on Wednesday said it has raided two terror camps, killed three suspected commanders of the Eastern Security Network, ESN, of Indigenous People of Biafra, IPOB, and arrested nine others in Okwudo, Umuorji in Naba and Oru West Local Government Areas in Imo State, respectively.\nThe State Police Public Relations Officer, PPRO, Micheal Abattam, who confirmed this to newsmen in Owerri, said the operation was carried out last Monday.\n“Some Quantities of Ice Hard Drugs suspected to be Mkpurumiri, One Live Tortoise, Assorted Black Charms, Four Biafran Flags, Several BIAFRAN/MASSOB, suspected adds, Three Battle Axes 3, Four Biafran Berets and Assorted Phones,” Police said.\nThe police added: “The three Corpses were later deposited at Federal Medical Center Mortuary Owerri, lmo State.”Photo: Some of the arrested suspects and lifeless bodies of those killed by police in Imo.\nVanguard News Nigeria"
  },
  {
    "headline": "How to address Nigeria’s socio-economic challenges – Uche Nwankwo",
    "summarized_story": "It is noteworthy that one of the chief characteristics of Nigerian professionals is the trend towards fragmentation and the establishment of one-man practices.\nWhat are those peculiarities of the Nigerian professionals that seemingly make them so different from professionals from other lands?\nIndeed, in recent times, many leading Nigerian professional architects and engineers have turned into portfolio consultants.\nThe model is applicable to all private sector players and operators in the Nigerian economy, be they in the commercial, industrial or agricultural sectors.\nThese then are some of the main factors or manifestations that shape the decidedly parlous Nigerian economy."
  },
  {
    "headline": "Maritime Economic Devt: FG focussed on opening up Nation’s Internal Waters through Hydrographic Survey — CNS",
    "summarized_story": "Chief of the Naval Staff, Vice Admiral Awwal Zubairu Gambo has said the Federal Government is desirous of opening up Nigeria’s internal waters, through systematic hydrographic survey and charting, for more robust maritime economic development.\nThe CNS made the disclosure at the signing of a Memorandum of Understanding on the Hydrographic Survey Partnership between the NN and University of Lagos at Naval headquarters in Abuja on Wednesday.\n“Thus, this Memorandum of Understanding between the Nigerian Navy and the University of Lagos is coming at the most appropriate time.\nHence, effective exploitation of the maritime domain for economic development is hinged largely on effective hydrographic survey capabilities.\n“It will also ensure the training and attachment of trainees onboard Nigerian Navy Ships while institutional support will be provided for hydrographic programmes."
  },
  {
    "headline": "70% of youths threatened by drugs, says Marwa",
    "summarized_story": "…Marwa launches WADA Club for Universities at UNIABUJA…Explains why Drug Integrity Test for Universities is necessary.\nChairman/Chief Executive Officer of the National Drug Law Enforcement Agency, NDLEA, Brig General Buba Marwa has warned that the nation faces a grim future over the rate of drugs prevalence among youths wondering, “what will become of Nigeria with about 70% youth population if the future of its youths is ravaged by drugs.\nThe National Drug Use and Health Survey of 2018 showed that Nigeria has a peculiar drug use prevalence.\n“We have launched a renewed campaign and intensive sensitization, targeting youths in schools at all levels as well as youths out of school.\n“The main objective of the WADA Club include among others, “To prevent the use and sale of illicit drugs in schools /institutions and promote alternative activities to involvement in drugs."
  },
  {
    "headline": "OAU mourns as undergraduate dies hours after falling into soakaway",
    "summarized_story": "Heritage Ajibola, a student of the Department of Linguistics and African Languages, Obafemi Awolowo University (OAU), Ile-Ife, Osun State, has died after she accidentally fell into a soakaway her hostel of residence.\nThey stated that before her friends could rush to call for help, she had already fallen deep into the soakaway.\nIn a statement jointly signed by Olayiwola Folahan Festus, President-elect, Odewale Samuel Damilare,Secretary General-elect and Ogunperi Taofeek Olalekan (Tao),Public Relations Officer-elect, the student stated that the deceased would have survived if the soakaway system was properly constructed and covered.\nThey alleged that despite the huge amounts of money paid by students for rent, students life was still not safe within he school environment.\nRecall that the death of Aishat had earlier sparked a protest as the students accused the OAU management of negligence."
  },
  {
    "headline": "Sex tape: Oxlade should apologise to Nigerians – Okowa’s aide",
    "summarized_story": "Ossai Success, an aide to Governor Ifeanyi Okowa of Delta State, has condemned those praising Ikuforiji Olaitan Abdulrahman, also known as Oxlade, over his alleged leaked sex tape.\nNigerians woke up to the sex tape on Wednesday, which has since gone viral on social media.\nHowever, there were some comments criticising the singer who is yet to address the sex tape as of the time of filing this report.\nMaking reference to Tiwa Savage’s sex tape, which was widely condemned by many Nigerians, Ossai asked Oxlade to apologise to Nigerians.\n“Praising Oxlade when you condemned Tiwa Savage’s video is abnormal."
  },
  {
    "headline": "Bauchi gov raises alarm over unidentified helicopter hovering over Lame/Burra reserve",
    "summarized_story": "Bauchi State Governor, Senator Bala Abdulkadir Mohammed, on Wednesday, raised the alarm over the suspicious movement of an unknown helicopter operating around Lame-Burra Forest in Toro Local Government Area of the state.\nAccording to him, the geographic position of the local government area, which made it shared boundaries with the North-Central and North-West, made it a gateway for people to enter the state.\nSpeaking when he granted audience to the recently deployed Air Officer Commanding (AOC), Special Operation Command (SOC) of Nigerian Air Force (NAF) in Bauchi, Air Vice Marshal Tajuddeen Yusuf at the Government House, Bauchi, the governor expressed worried over the hovering over the forest by the helicopter.\nHe said the intelligent reports he received from both security agents and the local community revealed the presence of the suspicious helicopter, which mission was yet unknown.\nThe Air Officer Commanding, however, called on the people of the state to assist the command with useful information to discharge its duties diligently."
  },
  {
    "headline": "General Ibrahim salutes MNJTF troops injured in Boko Haram, ISWAP battles",
    "summarized_story": "Major General Abdul Khalifah Ibrahim, Head of the Multinational Joint Task Force (MNJTF), has saluted recuperating troops.\nHe was accompanied by the Hospital Director-General, Ali Mahamat Djibrine, MNJTF Chief Medical Officer, Colonel Boubakar Siddo, and senior officers.\nIbrahim praised them for “uncommon bravery and patriotism” in the face of attacks by Boko Haram and ISWAP.\nThe FC assured them of the best medical care, noting that troops’ health and wellbeing remain MNJTF top priority.\nIbrahim thanked the medical personnel for their work and promised to ensure continued efficient services to wounded soldiers."
  },
  {
    "headline": "Boko Haram: $1.1 billion needed for humanitarian assistance in north-east – UN",
    "summarized_story": "The United Nations has said $1.1 billion would be needed in 2022 to undertake humanitarian assistance in the troubled north-east Nigeria.\nSchmale said US$1.1 billion is needed to provide critical aid and services to 5.5 million people who are most affected by the crisis.\nThrough the 2022 Humanitarian Response Plan (HRP), the Humanitarian Country Team for Nigeria and its partners will work to improve living conditions and strengthen protection, food security, nutrition and livelihoods opportunities.\nIn 2021, the humanitarian community collectively stepped up to save lives with severely limited capacities and access constraints.\nThrough the 2022 HRP, humanitarian actors are ready to again provide targeted, life-saving assistance to the most vulnerable people."
  },
  {
    "headline": "Fayemi, a true progressive, innovative leader, say APC governors",
    "summarized_story": "The governors, under the auspices of Progressive Governors’ Forum (PGF), extolled the virtues of the NGF chairman in a congratulatory statement they sent to him on yesterday’s celebration of his 57th birthday.\nThey described the Ekiti State governor as “a true progressive and innovative leader”.\nThe statement by PGF Chairman and Kebbi State Governor Abubakar Atiku Bagudu reads: “The Progressive Governors Forum (PGF) joins Kayode Fayemi, Governor of Ekiti State and Chairman, Nigerian Governors Forum (NGF), to celebrate his 57th birthday.\nAlong with the people of Ekiti State, and other well-meaning Nigerians, we celebrate this special occasion with you and your family.\n“Your exploits as the NGF Chairman have yielded fruits of national development and progress across the country."
  },
  {
    "headline": "Conveners clarify meeting of eminent Nigerians",
    "summarized_story": "A group of 100 leading business, political, civil society leaders have spoken of the need to build a consensus for national rebirth ahead of next year’s general elections.\nAt the meeting in Lagos, the group, which is known as ‘The 2022 Committee’, said it is essential for patriots to come together to rescue the country from political, economic and security threats before the election.\nCandidates are only chosen by political parties and we are not a political party,”The meeting of the eminent persons, which was held from February 4 to 6 under the aegis of “The 2022 Committee” is non-partisan and was meant to build consensus towards national rebirth.\n- Advertisement -The conveners said the retreat to map a new consensus for national rebirth, was attended by 14 current governors, 13 former governors and three former senate presidents to chart the way forward for the country.\nBut the coordinators of the meeting said although all the 100 leading lights of the 2022 committee have the capacity for national leadership, it should not be linked to the politics of 2023."
  },
  {
    "headline": "Edo business tycoon, cleric clash over threats to life, alleged abduction of four minors",
    "summarized_story": "A Benin, Edo State business tycoon, Mrs. Christy Oshogwe and Founder/Senior Pastor of Evidence of Christ Redemption Mission in the Edo State capital, Pastor Emmanuel Obeneti Agbujufie, have clashed over threats to life and alleged abduction of four minors, who are children of a deceased Edo woman.\nShe accused Pastor Agbujufie, who hails from Bayelsa State, but in charge of the headquarters church in the capital of Edo State, of being behind the threats to her life, using fierce-looking men, soldiers and fully-armed policemen.\nAgbujufie said: “I was there for my late wife.\nHer overseas-based sister assisting my late wife is not a crime on my part.\nMy late wife did not just die because of her sickness, but because they were jealous of her success in marrying a responsible man, as they troubled her with lies."
  },
  {
    "headline": "Abiru presents Magodo Residents’ petition to Senate",
    "summarized_story": "Chairman of the Senate Committee on Industries, Adetokunbo Abiru, has presented before the Senate a petition written by the Executives of the Magodo Residents Association in Lagos on the attempt to forcefully, illegally execute a court judgment in their estate.\nHe said the property owners are seeking the intervention of the Senate so that the “gun-wielding policemen” could be withdrawn from the estate and allow the Lagos State government to conclude its efforts at resolve the matter amicably.\nAbiru told the Senate that the petitioners did not seek any judicial remedy.\nSenate President Ahmad Lawan requested that the petition be laid before the Senate for the consideration of the Senate Committee on Ethics, Privileges and Public Petitions.\n- Advertisement -The committee was mandated to report back in four weeks."
  },
  {
    "headline": "Sylva: govt will unravel how toxic petrol was imported",
    "summarized_story": "These and other issues around the toxic petrol are to be unravelled after a probe by the Federal Government, Minister of State Petroleum Resources Timipre Sylva said yesterday.\nIt is responsible for the inspection of the imported petroleum products.\nNMDPRA on Tuesday said methanol above Nigeria’s specification was discovered in a limited quantity of petrol in the supply chain.\nIn Ebonyi State, the Nigeria Security and Civil Defence Corps (NSCDC) arrested six persons conveying 90,000 litres of adulterated petroleum products.\nTotal crude oil and gas export receipt for the period of August 2020 to August 2021 stood at $1.84billion."
  },
  {
    "headline": "Withdrawal of petrol with methanol cause of scarcity",
    "summarized_story": "Maigandi did not mention who was to be held responsible for the contaminated petroleum products in circulation.\nAlso IPMAN National Operations Controller, Mr. Mike Osatuyi, disclosed that the contaminated product is being mopped-up, a development that has caused disruption in the distribution chain.\n‘‘I can confirm to you that we have received reports that this contaminated fuel has caused damage to vehicle engines.\nThe marketer further told Daily Sun that the volume of the contaminated fuel which made is way into the country is about 200 million litres.\nMeanwhile, Some petroleum marketers say fuel scarcity will persist in Lagos and other parts of the country until depots are restocked with adequate and quality products."
  },
  {
    "headline": "Southern govs won’t support any northern presidential candidate – Akeredolu",
    "summarized_story": "From Bamigbola Gbolagunte, AkureChairman, Southern Governors’ Forum and Ondo State Governor, Mr Rotimi Akeredolu has warned political parties against picking its presidential candidates from the north, declaring that governors of the southern states would reject any candidate from the north.\nHe also predicted that any political party that fielded a northern candidate in the 2023 presidential poll would lose.\nHe said governors from the south of the country under the auspices of the Southern Governors Forum are determined to ensure that Nigeria’s next president was from the south.\nHe commended the group for its approach in involving youths in galvanising support and votes ahead of the 2023 election.\nSaid Akeredolu: “In about two or three meetings, we have come out and declared that power must move to the south."
  },
  {
    "headline": "Reps okay bill to make first degree minimum qualification for",
    "summarized_story": "From Ndubuisi Orji, AbujaThe House of Representatives, yesterday, passed for second reading a bill seeking to increase the minimum education qualification for the Nigerian President from senior school certificate or its equivalent to a university first degree or its equivalent.\nThe proposed legislation is also seeking to make a first degree or its equivalent the minimum qualification for governors and members of the state and national assembly.\nThe aforementioned sections prescribes senior school certificate or its equivalent as minimum qualification for persons seeking to be elected as president, governors, national and state assembly members.\nIn this present day, studying up to a university degree anywhere in the world would have afforded any individual certain knowledge, skills and preparedness.\nA university degree is good place to benchmark the educational qualification into certain political offices."
  },
  {
    "headline": "Lagos Catholic priest suspended indefinitely for banning Igbo songs",
    "summarized_story": "By Chinelo ObogoThe Catholic Archdiocese of Lagos has asked Rev.\nJames Anelu, the Priest-in-Charge of Holy Trinity Catholic Church, Enu-owa, Ikorodu, to proceed on indefinite leave for reportedly prohibiting parishioners from singing songs in Igbo language during service.\nIn a disclaimer issued on Monday, the Archbishop of Lagos Diocese, Alfred Martins, said Rev.\nAnelu made some unacceptable comments about Igbo songs being sung in the church and that the remarks did not represent the Catholic church’s position on common brotherhood of people of all tribes and religions.\nAnelu allegedly banned songs in Igbo language from being sung in the church, saying the Igbo cannot keep dominating other people, even in his church."
  },
  {
    "headline": "N5bn fraud: Ex-JAMB registrar, Ojerinde, seeks plea bargain",
    "summarized_story": "From Godwin Tsa, AbujaFormer Registrar, Joint Admission and Matriculation Board (JAMB), Prof. Adedibu Ojerinde, has opted for a plea bargain with the Independent Corrupt Practices and other related offences Commission (ICPC) in the alleged N5 billion fraud case against him.\nHis new lead counsel, Ibrahim Ishyaku (SAN), told the court that his client prefers an out of court settlement known as a plea bargain to resolve the matter.\nThe senior lawyer informed the judge that the trial could commence if after 24 hours, the matter could not be resolved.\nICPC lawyer, Mr Ebenezer Sogunle, did not object to the request, but insisted that the trial would proceed in case the plea bargain failed.\nMeanwhile, Justice Egwuatu has fixed today, for a report of the plea bargain to be presented."
  },
  {
    "headline": "JUST IN: Bandits Kill DPO, Soldier in Katsina",
    "summarized_story": "Injure army captainFrancis Sardauna in KatsinaThe Divisional Police Officer (DPO) of Jibia Local Government Area of Katsina State, DSP Abdulkadir Rano and one soldier have been killed in a gun battle between terrorists and security personnel at Magamar Jibia community.\nTHISDAY gathered that the terrorists who invaded the border community on Tuesday night, also shot an army captain on his lap and left many residents with varying degrees of injuries.\nA vigilante commandant in the community who pleaded anonymity, told THISDAY on Wednesday that the marauding terrorists abducted the wife of a businessman in the community.\nThe attack was said to be carried out by the terrorists under the groups of Dangote, Dan Karami and Turji.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "The 2022 Committee: Eminent Leaders Met to Build Consensus for National Rebirth",
    "summarized_story": "The meeting of 100 leading business, political, civil society and thought leaders in Lagos over the last weekend was to build consensus for national rebirth, the 2022 Committee has said.\nA statement issued Wednesday on behalf of the Conveners by the Chairman of THISDAY/Arise Media Group, Mr. Nduka Obaigbena, and former Presidential Liaison Officer to the Senate, Mr. Kashim Ibrahim-Imam, said the meeting which held from February 4 to 6 under the aegis of The 2022 Committee, in a non- partisan retreat to map a new consensus for national rebirth, was attended by 14 current governors, 13 former governors and three former Senate Presidents.\nParticipants, working in 3 Sub-Committees of National Security, The Economy and Nigeria in Transition, the statement said, “recognised that there is an urgent need to seek common ground and irreducible minimum actions to stabilise the polity at this critical time of transition.”The statement, coming on the heels of unfounded narratives on the purpose of the meeting, said ”whilst The 2022 Committee is interested in the quality of leadership that will emerge in Nigeria at all levels, we consider attempts to link the Committee with candidates or political parties for the 2023 elections as an unwarranted and unnecessary distraction – candidates are only chosen by political parties and we are not a political party.”Noting that all the 100 leading lights of the 2022 Committee have the capacity for national leadership, it said amongst the active participants in the work of the Committee were over seven persons, from three or more political parties, who had already publicly declared their aspirations to lead the country but were desirous of working with other patriots for non-partisan greater national goals.\n“We must have a secure, peaceful and united nation before we can have candidates for political offices,” it added.\nThe statement further said that The 2022 Committee believes that “what Nigeria needs today is for all patriots to come together to rescue our nation from all political, economic and security threats, and promote the unity of Nigeria.”It said the meetings will continue, “as we work with Federal and State Governments, current and future political leaders of all political persuasions, as well as other eminent patriotic citizens, for the greater good of the Nigerian people.”It therefore called on all patriotic volunteers, who are willing and able, to join this collective effort to stabilise the system so that a new Nigeria, that all can be proud of, could be builtShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Adulterated Fuel: Buhari Angry, Orders Query of NMDPRA Head",
    "summarized_story": "It is responsible for the regulation of the midstream and downstream petroleum operations in Nigeria which includes technical, operational, and commercial activities.\n“The reason the midstream/downstream authority is being queried first is that for now the bulk stops at its desk.\nThey are the police which should stop bad fuel from coming into the country.\n“Our technical team in conjunction with NNPC Ltd and other industry stakeholders, will continue to monitor and ensure quality petroleum products are adequately supplied and distributed nationwide,” it added.\n“And NNPC is working seriously to see that they get the correct product so that the marketers will continue loading."
  },
  {
    "headline": "Osinbajo: S’Court Seems to Be Exceeding Constitutional Limit in Election Matters",
    "summarized_story": "Osinbajo spoke at the 53rd Conference of the National Association of Law Teachers, held at Bayero University, Kano (BUK).\nHe condoled with the family and prayed God to give them the courage to bear the painful passing of their daughter.\n“In that election in 2019, the trouble at the Supreme Court game was that the APC primaries that produced candidates that were voted for were invalid.\nBecause according to the court, APC did not conduct any valid primary elections and as such, had no candidates for any elections in the state.\nOsinbajo, who used the opportunity of his engagement in Kano to visit Hanifa’s family, condoled with the girl’s parents."
  },
  {
    "headline": "Nigeria Drags UK’s Crime Agency to Court over £150m Abacha Loot",
    "summarized_story": "In the latest legal tussle over the money, generally known in Nigeria as “Abacha loot”, the report stated that Nigeria wanted the crime-fighting agency, NCA, to release funds that it froze at the request of US authorities.\nThe report stated, “It is a complicated story with many twists and turns.\nHowever, the money Abacha and his associates plundered became the subject of an international search after the dictator’s sudden death in 1998, aged 54.\nThe NCA has been working with American authorities in a bid to confiscate the funds and return them to “the people of Nigeria,” the report stated.\nBut Nigeria desperately needs the money that Abacha stole.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Court Adjourns Appeal To Nullify Buhari's 2019 Election Victory, Declare Atiku As President",
    "summarized_story": "An appeal to nullify President Muhammadu Buhari's victory in the 2019 election, was on Wednesday, adjourned by the Court of Appeal in Abuja to May 18, 2022.\nAccording to CSOCLC, the affidavit made by Buhari in the 2019 general elections was false.\nBut the three-member panel presided over by Justice Haruna Tsamani, during the hearing on Wednesday, adjourned the appeal to enable Buhari's administration to reconcile sort out an issue regarding the right legal representation for the President.\nThis was after two lawyers, Oluwole Afolabi and F. O. Amedu, announced appearances for both the All Progressives Congress (APC) and Buhari, each claiming to be the genuine legal representative.\nDue to the confusion, the court, therefore, adjourned the case till May 18, 2022."
  },
  {
    "headline": "BREAKING: Court Adjourns Appeal To Nullify Buhari's 2019 Election Victory, Declare Atiku As President",
    "summarized_story": "An appeal to nullify President Muhammadu Buhari's victory in the 2019 election, was on Wednesday, adjourned by the Court of Appeal in Abuja to May 18, 2022.\nAccording to CSOCLC, the affidavit made by Buhari in the 2019 general elections was false.\nBut the three-member panel presided over by Justice Haruna Tsamani, during the hearing on Wednesday, adjourned the appeal to enable Buhari's administration to reconcile sort out an issue regarding the right legal representation for the President.\nThis was after two lawyers, Oluwole Afolabi and F. O. Amedu, announced appearances for both the All Progressives Congress (APC) and Buhari, each claiming to be the genuine legal representative.\nDue to the confusion, the court, therefore, adjourned the case till May 18, 2022."
  },
  {
    "headline": "EXCLUSIVE: Medical Doctor And Mother Brutalised By Qatar Airways Officials At Lagos Airport, Son Prevented From Boarding Flight For Recording Assault On Mother",
    "summarized_story": "A young Nigerian medical doctor, Adedapo Adeosun, was on February 1, 2022, denied boarding on a Qatar Airways flight heading for Oslo, Norway, for committing no offence.\nQatar Airways aircraft.\nA few minutes into that process, an official of Qatar Airways stopped the screening and tried to dismiss all persons waiting to be attended to without offering any reasonable explanation.\nFollowing the entire incident, Adeosun was denied boarding on his flight to Norway that night, leaving him frustrated.\nAn email sent to Qatar Airways by SaharaReporters over the issue had yet to be responded to as of the time of this report."
  },
  {
    "headline": "EXCLUSIVE: Medical Doctor And Mother Brutalised By Qatar Airways Officials At Lagos Airport, Son Prevented From Boarding Flight For Recording Assault On Mother",
    "summarized_story": "A young Nigerian medical doctor, Adedapo Adeosun, was on February 1, 2022, denied boarding on a Qatar Airways flight heading for Oslo, Norway, for committing no offence.\nQatar Airways aircraft.\nA few minutes into that process, an official of Qatar Airways stopped the screening and tried to dismiss all persons waiting to be attended to without offering any reasonable explanation.\nFollowing the entire incident, Adeosun was denied boarding on his flight to Norway that night, leaving him frustrated.\nAn email sent to Qatar Airways by SaharaReporters over the issue had yet to be responded to as of the time of this report."
  },
  {
    "headline": "Gambian Authorities Detain Nigerian Found With Cannabis Sativa, Others",
    "summarized_story": "The Gambia’s Drug Law Enforcement Agency has arrested 36-year-old Nigerian national, Elem Onyekachi Chidozie in Kunkujang.\nChidozie was arrested with one parcel of suspected cannabis sativa, ten pieces of suspected cannabis resin (hashish), and eight tablets of suspected clonazepam, Nigeria Abroad reports.\nHe has been detained and said to be helping officers of the drug law enforcement agency in their investigation.\nDLEAG had earlier expressed concern over the increased usage of drugs among youths in the Gambia.\nThe agency continues to receive a countless number of complaints and reports from the public regarding drug-related activities and open drug abuse,” it added."
  },
  {
    "headline": "EXTRA: Hisbah destroys 3.8m bottles of beer seized in Kano",
    "summarized_story": "The Kano Hisbah board says it has destroyed over three million bottles of “assorted” beer seized in the state.\nSpeaking on Wednesday while destroying the drinks, Harun Ibn-Sina, commandant of the board, said the exercise was approved by the state government.\nAccording to NAN, the bottles of alcohol, said to be a total of 3.8 million, were seized months ago.\n“This paved way for the board to secure a court order from chief magistrate court, Kano, to damage all the seized beer in its custody,” he said.\n“Hisbah personnel should maintain the tempo as miscreants have devised new tactics of smuggling beer and hard drugs into the state.”"
  },
  {
    "headline": "EXTRA: Hisbah destroys 3.8m bottles of beer seized in Kano",
    "summarized_story": "The Kano Hisbah board says it has destroyed over three million bottles of “assorted” beer seized in the state.\nSpeaking on Wednesday while destroying the drinks, Harun Ibn-Sina, commandant of the board, said the exercise was approved by the state government.\nAccording to NAN, the bottles of alcohol, said to be a total of 3.8 million, were seized months ago.\n“This paved way for the board to secure a court order from chief magistrate court, Kano, to damage all the seized beer in its custody,” he said.\n“Hisbah personnel should maintain the tempo as miscreants have devised new tactics of smuggling beer and hard drugs into the state.”"
  },
  {
    "headline": "OAU student dies after falling inside hostel soakaway",
    "summarized_story": "A 200-level student of Obafemi Awolowo University (OAU), Ile Ife has died after falling into a soakaway close to her hostel.\nAdvertisementThe female student, identified as Ajibola Heritage Ayomikun, was studying Linguistics and African Languages in the varsity.\nThe institution, in a statement signed by Abiodun Olarewaju, its spokesperson, on Wednesday, said Ayomikun fell into the soakaway in BVER, one of the private hostels in its student village.\nAdvertisementThe institution said that Ayomikun was, however, confirmed dead on arrival at the OAU teaching hospital.\n“When the news got to us, we immediately mobilised the firemen from the University, Osun state and the OAU teaching hospital who through concerted efforts got the student out,” the statement read."
  },
  {
    "headline": "OAU student dies after falling inside hostel soakaway",
    "summarized_story": "A 200-level student of Obafemi Awolowo University (OAU), Ile Ife has died after falling into a soakaway close to her hostel.\nAdvertisementThe female student, identified as Ajibola Heritage Ayomikun, was studying Linguistics and African Languages in the varsity.\nThe institution, in a statement signed by Abiodun Olarewaju, its spokesperson, on Wednesday, said Ayomikun fell into the soakaway in BVER, one of the private hostels in its student village.\nAdvertisementThe institution said that Ayomikun was, however, confirmed dead on arrival at the OAU teaching hospital.\n“When the news got to us, we immediately mobilised the firemen from the University, Osun state and the OAU teaching hospital who through concerted efforts got the student out,” the statement read."
  },
  {
    "headline": "‘N5.2bn fraud’: Ojerinde, ex-JAMB registrar, faces trial as plea bargain talks with ICPC fail",
    "summarized_story": "The plea bargain talks between Adedibu Ojerinde, former registrar of the Joint Admissions and Matriculation Board (JAMB), and the Independent Corrupt Practices and other related offences Commission (ICPC) have fallen through.\nAdvertisementOn Tuesday, Ojerinde, through his counsel, Ibrahim Ishyaku, had prayed the court for an adjournment to enable him to finalise a plea bargain arrangement with the ICPC.\nHowever, at the resumed court session on Wednesday, Ebenezer Sogunle, ICPC’s lawyer, told the court that the plea bargain talks failed.\n“My lord, I regret to inform the court that there has been no plea bargain agreement in this matter,” he said.\nSome of the names used to register the companies include Ojerinde Dayo, Ojerinde Olumide, Awodayo Habib, Adeyanju Gbenga, Ojerinde Olutoyin, Ojerinde Akanbi, Ojerinde Adedayo, Olayiwola Ayanwale, Ibrahim Danmusa, Ojerinde Dibu and Sanusi Alade Naj."
  },
  {
    "headline": "The viral photographer that Afcon Cameroon made",
    "summarized_story": "As the African Cup of Nation (Afcon) fiesta rages in Cameroon, a young photographer is positioned to make a name for himself.\nIn a few minutes, he will be triggering his camera, producing incredible shots that will go viral and bring him fame.\nThe accreditation document gives journalists and photographers the right to access stadiums and venues where the Afcon takes place.\nEvery picture I was posting was going viral, it was amazing.”Amid the excitement of his work going viral, Lefa was still worried about his accreditation.\nImage source: Didier Lefa."
  },
  {
    "headline": "Twitter wants its African users to have safer conversations",
    "summarized_story": "Today marks the 19th edition of Safer Internet Day, and this year’s theme—a repeat of last year’s—is “together for a better internet”.\nLike most avid Twitter users, I have had a few of my tweets end up on the wrong side of bird avenue.\nIn recent times, Twitter users have opened up about experiencing one form of internet abuse or the other.\nThe platform has, over the past several years, marked Safer Internet Day by rolling out various initiatives such as dedicated emojis, blog posts, events, and more.\n“We’re excited to join safety partners from all over the world to mark #SaferInternetDay2022 and to play our part in creating a safer internet for all."
  },
  {
    "headline": "Asa joins Spotify EQUAL Music Programme as ambassador of the month",
    "summarized_story": "Paris-born Nigerian singer, Asa, was recently announced the Spotify EQUAL Global Music Programme ambassador for the month of February.\nIn April 2021, months after it expanded to 38 African countries, Spotify launched the Spotify EQUAL Music Programme in commemoration of International Women’s Day.\nThis research helped fuel the drive for its EQUAL Global Music Programme.\nMayana already has over 560,000 streams on Spotify, and the addition to EQUAL playlists will boost it further.\nSpeaking about her selection, the singer said, “I’m honoured to be the Spotify EQUAL ambassador of the month."
  },
  {
    "headline": "Acuity founder, Lexi Novitske, discusses the $200m Norrsken22 Africa fund",
    "summarized_story": "Norrsken is now working with Hans Otterling, partner at Northzone, and an investment team led by Natalie Kolbe, ex global head of private equity at Actis in South Africa; Actis colleague Ngetha Waithaka in Kenya; and Lexi Novitske, founder of Acuity Venture Partners, on the new Norrsken22 Africa Tech Growth Fund.\nGet the best African tech newsletters in your inboxMichael: What inspired the move to back growth-stage startups in Africa?\nNovitske: Through my firm Acuity (and its predecessor Singularity Investments) we were active investors in early-stage companies across Africa.\nWhat we saw was that, as our companies scaled across the continent there was not sufficient local capital to back these growth-stage rounds.\nLocal investors have insights from doing businesses on the continent or networks that no international investor can have, even if they have the deepest pockets."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "Fintech startup, Unboxd, helps crowdfund celebrations, no matter how much you have",
    "summarized_story": "What if you could get exactly what you wanted as a wedding gift without your friends breaking the bank or getting you unnecessary items?\nOn November 1, 2020, about one month after sharing their wishlist, Egbeyemi and his wife get married.\nWishlists for every celebrationAccording to Adesina, Unboxd is a fintech brand, “but we are currently offering a gifting solution with a crowdfunding component.\nWith Unboxd, we’ve been able to simplify that.\n“Everything we’ve been able to build with Unboxd has been with our own money, and we’ve had to hire on contract."
  },
  {
    "headline": "Building tech for the dead",
    "summarized_story": "In today’s episode of Techpoint Digest, we’ll be discussing an African robotics company, handling funeral arrangements with tech, and the rise of NFT theft.\nSolving African problems with roboticsOperating the Kalibotics ChessbotEveryone and their two-year-old niece is building a fintech startup, and I can’t blame them.\nHowever, other startups are building exciting tech solutions.\nAdvertisementKalibotics is a Nigerian robotics startup building products for the edtech, e-waste management, and agritech industries.\nOluwanifemi Kolawole sat down to chat with the co-founders to learn what it takes to build a robotics startup in Africa."
  },
  {
    "headline": "Kalibotics is using robotics to revamp edtech, agritech, e-waste management",
    "summarized_story": "Kalibotics smart classroomThe seemingly discouraging outcomes of these two endeavours opened their eyes to something bigger.\nThe result was the birth of robotics startup, Kalibotics, coined from two words: Kali, a Swahili term for ‘energetic’, and Robotics.\nLeading up to KaliboticsBefore Kalibotics, the duo has come a long way in building tech products and running businesses.\nOlugbenga asserts that Kalibotics’ products are targeted majorly at large businesses and the government for obvious reasons.\nWe have what is called Kalibotics Project Alpha, which is B2C."
  },
  {
    "headline": "FAQ Troubleshooting",
    "summarized_story": "Relevant discussion thread is https://wordpress.org/support/topic/234726Top ↑Why isn’t the admin user listed as an author when editing posts?\n# Why isn’t the admin user listed as an author when editing posts?\nnewadmin) with Administrator Role Login as ‘newadmin’ Degrade the old ‘admin’ user to Role of Subscriber and Save Promote the old ‘admin’ back to Administrator Role and Save Login as the old ‘admin’If that doesn’t work, try:Create a new admin user (e.g.\nnewadmin) with Administrator Role Login as ‘newadmin’ Delete the old ‘admin’ user and assign any posts to ‘newadmin’ Create ‘admin’ user with Administrator Role Login as ‘admin’ Delete ‘newadmin’ user and assign posts to ‘admin’Top ↑Why is the wrong author name displayed for a post on a blog?\nThere are various resources that will help you find more help with WordPress, in addition to these FAQ."
  },
  {
    "headline": "Nigeria among African top 10 for easy visa processes",
    "summarized_story": "Nigeria currently ranks among the top 10 African countries offering easy visa processes to visitors.\nAccording to Africa Visa Openness Report 2021, an annual report that measures the extent to which African countries are open to visitors from other African countries, Benin Republic, The Gambia, and Seychelles are 2021’s top performers, offering visa-free access to all African visitors in 2021.\nNigeria ranks 7th on the list offering visa-free access to the Economic Community of West African States (ECOWAS) countries and visa on arrival to other African countries.\nIn February 2020, the Nigeria Immigration Service (NIS) launched the Nigeria Visa Policy 2020 seeking to improve ease of doing business, attract FDIs, tourists, and individuals with specialised skills without compromising national security.\nTo facilitate access, 24 African countries now offer eVisa."
  },
  {
    "headline": "More pain for small businesses as diesel price rises by 24%",
    "summarized_story": "The price of diesel, which is not regulated by the government, has surged by over 24 percent on the back of the soaring price of Brent crude, dollar price, and the forces of demand and supply, sources said.\nCrude oil price accounts for a large chunk of the final cost of petroleum products such as diesel, kerosene, and such associated products.\nBrent crude, the benchmark for Nigeria’s crude oil has gained more than 28percennt to $91 on February 09, 2022.\nIt said states with the highest average price of diesel were States with the highest price Enugu (N349.29), Borno (N340.00), and Oyo (N326.25).\n“States with the lowest average price of diesel were Kebbi (N232.36), Yobe (N226.61), and Katsina (N225.00),” the NBS noted."
  },
  {
    "headline": "Delta Cult Clash: Police Arrest Eleven Suspects, Recover Arms – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – At least five persons have been reportedly killed, following a fierce cult clash between the Eiye and Black axe confraternity in Agbarho, Ughelli North LGA on the 6/2/2022.\nTo this end, the Delta State Police Command has arrested eleven persons connected to the mayhem.\n“The situation has been brought under control and more patrol teams have been deployed to forestall any further breakdown of law and order in the Community.\nManhunt for the other fleeing suspected cultists is ongoing.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Obaseki swears-in eight new commissioners tomorrow – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, will tomorrow, Wednesday, February 9, 2022, swear-in eight new Commissioners confirmed by the Edo State House of Assembly.\nIn a statement, Secretary to the State Government, Osarodion Ogie Esq., said the ceremony will be held at the New Festival Hall at the Government House, Benin City.\nOgie noted, “It is hereby announced for the information of the general public that the eight (8) commissioner-nominees confirmed by the Edo State House of Assembly on Monday, February 7, 2022, will be sworn into office by His Excellency, the Edo State Governor, Mr. Godwin Nogheghase Obaseki, on Wednesday, February 9, 2022.”The commissioner-nominees cleared by the State House of Assembly are Chris Nehikhare, Omololu Ojehomon, Afishetu Braimoh, and Stephen Idehenre.\nOthers are Osasere Evbuomwan, Donald Ojemeh, Okojie Newton and Jonathan Lawani.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo NEWMAP inspects ongoing flood control projects, assures speedy completion – Nigerian Observer",
    "summarized_story": "Obaseki stated that the need to adhere to quality and guidelines informed the inspection exercise.\nHe reassured that the government will sustain efforts at tackling the problem of flooding and erosion across all Edo communities.\nResidents of Igbei, who spoke to journalists during the inspection, hailed the governor for putting the people at the forefront of his administration’s programmes and policies.\n“But the Governor Obaseki-led government through Edo State NEWMAP intervention has however changed this narrative with the near completion of this flood alleviation work in our community.\nThe stone-based road is the outcome of the underground drainage work done along the road, which now necessitated the asphalting of the road."
  },
  {
    "headline": "Group Urges Akhabue To Run For Edo Central Senatorial Seat – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAn Esan social cultural group — Esankugbe, with membership across the entire Edo Centre, has called on Ehia Olu Akhabue to join the Senate race for Edo Central Senatorial District.\n“ We are aware that someone like Senator Ordia once fought to frustrate Senator Ugbesia’s third term gambit.\nThe most honorable thing for him to do now is to back down and allow a fresh blood.\nWe know he has done his best these past 8 years and we appreciate him” the statement concluded.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Heirs Life promises retirees a guaranteed pension for life",
    "summarized_story": "Heirs Life Assurance (HLA) says has rolled out an awareness campaign for its pension-regulated Annuity Plan, promising retirees a steady income for as long as they live.\nHeirs Annuity Plan pays retirees a steady amount, monthly or quarterly for as long as the annuitant lives.\nBeyond the Heirs Annuity plan, Heirs Life has introduced a variety of interesting life assurance plans for different customers.\nHeirs Life continues to transform life insurance in Nigeria through its digital service delivery and by providing simple, quick, reliable, and accessible financial security plans to individuals and businesses.\nHeirs Life is a subsidiary of Heirs Holdings, a pan-African investment group."
  },
  {
    "headline": "Valentine: Fidelity Bank set to delight customers with Euphoria Event",
    "summarized_story": "Fidelity Bank Plc says its customers Customers are in for a treat this Valentine as it has announced plans to host a delightful evening of music, fun games and delightful experiences for its customers.\nAccording to the bank, non-customers can also stand a chance to be part of the event by downloading the Fidelity Bank mobile app and carrying out five transactions.\n“Over the years, Fidelity Bank has developed a reputation for going the extra-mile in servicing our esteemed customers.\nWhether it is through interactions with our online services or our staff, people have come to associate us with delightful experiences.\nFidelity Bank is a full-fledged commercial bank operating in Nigeria, with about 6million customers who are serviced across its 250 business offices and digital banking channels."
  },
  {
    "headline": "Third Force: Eminent Nigerians plot coalition to ‘rescue Nigeria’",
    "summarized_story": "The leaders, under the aegis of ‘The 2022 Committee’, said Nigeria must be secured, peaceful and united before the nation can have candidates for political offices in 2023.\nThe statement said the leaders met from February 4 to 6, 2022, but did not reveal the names of the 100 leaders who met in Lagos.\n“The meetings will continue, as we work with Federal and State Governments, current and future political leaders of all political persuasions, as well as other eminent patriotic citizens, for the greater good of the Nigerian people,” the statement said.\nWe must have a secure, peaceful and united nation before we can have candidates for political offices.\n“The Committee believes that what Nigeria needs today is for all patriots to come together to rescue our nation from all political, economic and security threats, and promote the unity of Nigeria."
  },
  {
    "headline": "Lawmakers blame Nigerian movies for surge in ritual killings, declare national emergency",
    "summarized_story": "Nigeria’s House of Representatives on Wednesday declared a national emergency amid rise in cases of ritual killings across the country.\nPresenting the motion, Mr Okechukwu said that incidents of ritual killings had assumed an alarming rate in Nigeria while decrying the upsurge of reported ritual killings, and abductions in different parts of the country.\nHe blamed the increase on Nollywood, the country’s movie industry, arguing that younger generations may see ritual killing as a norm.\n“Ritual killing had become a predominant theme in most homemade movies which if not checked, our younger generation may begin to view it as an acceptable norm,” he said.\nThe House thereafter charged the Inspector General of Police to take urgent steps towards tacking ritual killings in the country."
  },
  {
    "headline": "Warri Prophet Gifts Farmer N2m, Tricycle As Children Get Scholarships",
    "summarized_story": "The family was illegally farming on Prophet Jeremiah Fufeyin’s land when they coincidentally encountered him while passing through the location along the expressway.\nFufeyin is the Pastor of Christ Mercyland Church in Warri.\nHe stressed that the church provided three scholarships and empowered the couple to be able to earn and take responsibility for themselves and the other two kids.\nADVERTISEMENTGloria said she was forced to relocate to a one-room apartment in a Warri slump after she couldn’t afford rent payment with her husband, adding that her children had been out of school for lack of finance.\nIn a development that sent jubilations across her neighbourhood, the woman while narrating her story at the prophet’s church where the scholarships, financial support and tricycle were provided, bursted into tears."
  },
  {
    "headline": "N300m BoI Loan: Firm Raises Alarm Over Illegal Freezing Of Bank Account",
    "summarized_story": "An agribusiness firm, Santuscom Agro Investment Company Limited, Wednesday, raised the alarm over what it called illegal blocking of its bank account and hindering it from accessing a N300,035,160.00 facility it obtained from Bank of Industry (BoI) allegedly by SunTrust Bank.\n“Santuscom agro investment company limited (RC: 1439777) is an agribusiness company operating in rice cultivation, processing and packaging, for the past five years.\nOur brand OGOJA RICE has been a market leader enjoying a significant proportion (60%) market share within the rice value chain in cross river state.\nAriku & Co to the Managing Director of SunTrust Bank, to unfreeze the company’s account and money, but now awaiting the bank’s response.\nThe MD also said the bank has no valid court order to block/freeze the company’s account, adding that the company will file a lawsuit against SunTrust Bank for the unlawful action."
  },
  {
    "headline": "Federal Govt Probes Adulterated Fuel Imports",
    "summarized_story": "The federal government has said it will investigate the supply of adulterated petrol which is currently in circulation in the country.\n“So, they become Nigerians, they get granted citizenship by registration.\nWhereas foreign nationals who are desirous of Nigerians, they’re not being wives of Nigerians, we give them citizenship by naturalization.\nRecall that a total of 335 persons were similarly granted citizenship in December 2017.\nOn his part, Minister of Aviation, Hadi Sirika, said the council approved a contract for the replacement of Aviation Operations (AvO) at the cost of N12,097,215,800.09."
  },
  {
    "headline": "Federal Govt Probes Adulterated Fuel Imports",
    "summarized_story": "The federal government has said it will investigate the supply of adulterated petrol which is currently in circulation in the country.\n“So, they become Nigerians, they get granted citizenship by registration.\nWhereas foreign nationals who are desirous of Nigerians, they’re not being wives of Nigerians, we give them citizenship by naturalization.\nRecall that a total of 335 persons were similarly granted citizenship in December 2017.\nOn his part, Minister of Aviation, Hadi Sirika, said the council approved a contract for the replacement of Aviation Operations (AvO) at the cost of N12,097,215,800.09."
  },
  {
    "headline": "FCT Elections: Police Restrict Movement From 12am To 4pm",
    "summarized_story": "Ahead of the Saturday, February 12, 2022 FCT Area Council elections in Abuja, the Nigeria Police Force has restricted both vehicular and human movement from 12am to 4pm.\nFCT Police PRO, DSP Josephine Adeh, also said the commissioner, while expressing his confidence in the already emplaced security measures, urged the good people of the FCT to turn out to exercise their voting rights without the fear of harassment or molestation of any kind.\nADVERTISEMENTThe CP also called on all stakeholders in the election to be reminded of their signed peace accord and ensure that their actions and inactions are ushered by constituted guidelines.\nHe, therefore, called on residents to remain vigilant and report any suspicious or abnormal occurrence to the police through the following emergency lines: 08032003913, 08061581938, 07057337653 and 08028940883.\nADVERTISEMENT"
  },
  {
    "headline": "Danjuma, Indimi in closed door meeting with Buhari in Abuja (Photos)",
    "summarized_story": "Former Chief of Army Staff, Lieutenant General Theophilus Yakubu Danjuma (Rtd) and billionaire businessman have stormed the State House, Abuja on a private visit to President Muhammadu Buhari.\nThe duo came separately to visit the president and were separately locked in closed door meeting with the president after photos had been taken.\nThe president just returned from AU meeting in Addis Ababa, Ethiopia before the visit.\nDanjuma is a retired Nigerian Army Lieutenant General who played a key role in post independence military and political events in Nigeria.\nIndimi, an oil mogul from Borno, is Buhari’s in-law."
  },
  {
    "headline": "UCLA to pay $243m to 200 women over sexual abuse claims",
    "summarized_story": "University of California (UCLA) officials have agreed to pay $243 million to settle the legal claims of some 200 women who have accused a former UCLA gyneacologist of sexual abuse.\nThe settlement by the University of California regents, the system’s governing board, marks the second in lawsuits stemming from the accusations against Dr. James Heaps, 65.\nHeaps, who retired in 2018 after more than 30 years at UCLA, is not a party to the settlement.\nHe is awaiting trial later this year on 21 criminal counts of sexual abuse.\nThe University of California in November 2020 agreed to pay $73 million to settle a class-action lawsuit over the allegations against Heaps, but hundreds of women declined to accept that agreement and are part of separate cases.UCLA"
  },
  {
    "headline": "Trump adviser Navarro subpoenaed by Jan. 6 committee",
    "summarized_story": "The congressional committee investigating the Jan. 6, 2021, attack on the U.S. Capitol announced on Wednesday it had subpoenaed former White House trade adviser Peter Navarro.\nIt asked Navarro to produce documents by Feb. 23 and appear for a deposition on March 2.\nNavarro was a key player in then-President Donald Trump’s effort to overturn his election defeat.\nIn response to a request for comment, Navarro said Trump had claimed his communications while in the White House are protected by executive privilege.\nNavarro served as White House trade policy adviser under Trump."
  },
  {
    "headline": "Trial of \"Access Bank hacker\" gets new date",
    "summarized_story": "Abike-Fadipe of the Special Offences Court sitting in Ikeja, Lagos has adjourned the trial of one Chris Ihebuzo for offences bordering on stealing, among others to February 18.\nHe is also being tried for demanding property by written threat, attempt to commit a felony, unauthorised access to computer material, unauthorised modification of computer material, and unauthorised access with intent to commit and facilitate commission of further offences.\nIhebuzo, known as the “Access Bank hacker”, following his viral video in which he bragged of gaining access into the bank’s database and extracting data of over 2,000 customers, including their Bank Verification Numbers, BVNs, was arrested by operatives of the Economic and Financial Crimes Commission, EFCC sometime in September 2020.\nThe bank had petitioned the EFCC and following the conclusion of investigations, a seven-count charge was drafted against him to which he pleaded “not guilty”.\nThe case has been adjourned till February 18 and March 11, 2022 for continuation of trial."
  },
  {
    "headline": "Govs Wike, Makinde, Ishaku hate Muslims, they’ve been blacklisted – Islamic group",
    "summarized_story": "The Muslim Rights Concern, MURIC, has accused some state governors of being Muslim-haters.\nMURIC, an Islamic human rights organization, identified Darius Ishaku of Taraba State, Nyesom Wike of Rivers State, and Seyi Makinde of Oyo State, as haters of Muslims in Nigeria.\nThe group warned the governors against attempting to occupy any federal office because they have been blacklisted.\nMURIC accused the Taraba State Governor of marginalizing Muslims in the state.\nIt described as legendary, Ishaku’s alleged reckless violation of Allah-given fundamental rights of Muslims in his state."
  },
  {
    "headline": "BREAKING: Court Adjourns Appeal To Nullify Buhari’s 2019 Election Victory, Declare Atiku As President",
    "summarized_story": "The Court of Challenge in Abuja deferred an appeal to annul President Muhammadu Buhari’s victory in the 2019 election to May 18, 2022 on Wednesday.\nRecall that the Incorporated Trustees of the Civil Society Observatory for Constitutional and Legal Compliance (CSOCLC) filed an appeal against President Muhammadu Buhari’s government, demanding that he be fired and that former Vice-President Atiku Abubakar, who finished second in the 2019 presidential election, be installed as President of Nigeria.\nBuhari’s affidavit in the 2019 general elections, according to CSOCLC, was false.\nHowever, during the hearing on Wednesday, a three-member panel presided over by Justice Haruna Tsamani deferred the appeal to allow Buhari’s administration to resolve a dispute over the President’s legal counsel.\nDue to the resulting misunderstanding, the case was delayed until May 18, 2022."
  },
  {
    "headline": "Govs Wike, Makinde, Ishaku Hate Muslims, They’ve Been Blacklisted — Islamic Group",
    "summarized_story": "The Muslim Rights Concern, MURIC, has accused some state governors of being Muslim-haters.\nMURIC, an Islamic human rights organization, identified Darius Ishaku of Taraba State, Nyesom Wike of Rivers State, and Seyi Makinde of Oyo State, as haters of Muslims in Nigeria.\nThe group warned the governors against attempting to occupy any federal office because they have been blacklisted.\nMURIC accused the Taraba State Governor of marginalizing Muslims in the state.\nIt described as legendary, Ishaku’s alleged reckless violation of Allah-given fundamental rights of Muslims in his state."
  },
  {
    "headline": "Nigeria vs Ghana: Eguavoen Reacts To NFF Appointment Of Amuneke As Super Eagles Coach",
    "summarized_story": "Super Eagles’ interim Technical Adviser, Augustine Eguavoen, on Wednesday said the appointment of former Barcelona winger Emmanuel Amuneke to assist him at the senior national team is “a very good development.”Eguavoen, who disclosed this in Ilorin, said the coming of Amuneke would be a great addition to the national team.\nRecall that the Nigerian Football Federation (NFF) had announced the decision to drop former Real Madrid assistant manager, Jose Peseiro, and named Amuneke as the coach of the Super Eagles.\nAmuneke will work together with Eguavoen, as well as Salisu Yusuf, Joseph Yobo, and Alloy Agu, as Nigeria faces Ghana in a 2022 World Cup qualifying playoff in March.\nI think his coming into the team will add a lot of value also.\n“That gives the home-based players a lot of hope and thinking that they’ll get a chance one day to play in the Super Eagles,” Eguavoen told the News Agency of Nigeria (NAN)."
  },
  {
    "headline": "Nigeria grants citizenship to 286 foreigners",
    "summarized_story": "The federal government has granted Nigerian citizenship to 286 foreign nationals, Minister of Interior, Mr Rauf Aregbesola, has said.\nThe minister said this while briefing State House Correspondents at the end of the weekly Federal Executive Council (FEC) meeting in Abuja Wednesday.He said the 286 foreign nationals were granted citizenship out of 600 applications it received, stressing that 208 of those approved were granted citizenship by naturalisation while 78 others were granted citizenship by registration.\n“The Ministry of Interior through me presented the Advisory Committee on Nigeria citizenship approval to the Council today.\nWe received 600 applications from several people, foreign nationals who have been residing in Nigeria, but desirous of being Nigerians.\nOut of the 600 applicants, the Advisory committee approved for the consideration of the council 280."
  },
  {
    "headline": "VIDEO: Watch as Abuja varsity lecturer cuts student’s hair with scissors",
    "summarized_story": "An unidentified lecturer in Veritas University in the Federal Capital Territory (FCT) has been captured in a viral video, cutting off the hair of a male student with scissors.\nThe lecturer according to the video, paused his lecture and invited the unidentified male student to the front of the class where he embarrassed him.\nIn a video posted online, the lecturer could be seen using scissors to give an irregular haircut to the undergraduate who didn’t seem too pleased.\nAfter he was done cutting off the hair, the lecturer then told his student to put the hair particles in his pocket.\nWatch the video below…"
  },
  {
    "headline": "Bandits stopping us from burying our dead – Zamfara residents",
    "summarized_story": "In a special report carried by BBC Hausa Tuesday morning and monitored by Premium Times, residents said they could not bury their dead because the bandits were still around the village.\nThe bandits are still around the village and have stopped us from retrieving the dead bodies for proper burial.\nSources from the village told newsmen that the terrorists attacked the village Monday night during which they also burnt cars, shops and houses.\nWhen residents started running, some of the bandits started shooting, which led to the death of the 10 people I told you.\nShe told us that the bandits were frustrated by vigilante members last Saturday when they attempted to attack the town."
  },
  {
    "headline": "NNPC GMD Reveals How Adulterated Fuel Was Imported And The Importers",
    "summarized_story": "He said, “Cargoes quality certificates issued at load port (Antwerp-Belgium) by AmSpec Belgium indicate that the gasoline complied with Nigerian Specification.\n“The NNPC quality inspectors including GMO, SGS, GeoChem and G&G conducted tests before discharge also showed that the gasoline met Nigerian specification.\nOn 20th January 2022, NNPC received a report from our quality inspector on the presence of emulsion particles in PMS cargoes shipped to Nigeria from Antwerp-Belgium.\nCargoes quality certificates issued at load port (Antwerp-Belgium) by AmSpec Belgium indicate that the gasoline complied with Nigerian Specification.\nThe NNPC quality inspectors including GMO, SGS, GeoChem and G&G conducted tests before discharge also showed that the gasoline met Nigerian specification."
  },
  {
    "headline": "Adulterated Fuel: ‘There Will Be A Major Investigation,’ Says Petroleum Minister",
    "summarized_story": "The Minister of State for Petroleum, Timipre Sylva, says there will be a major investigation to unravel the cause of the unsafe quantity of methanol in petrol imported into the country.\nHe disclosed this on Wednesday during a media briefing after the Federal Executive Council (FEC) meeting held at the State House.\nAlthough the minister refused to disclose the identities of the companies involved, he said they will be made known after the investigations are concluded.\n“There will be a major investigation to unravel everything.\nSpeaking concerning Nigerians whose cars were damaged after buying the fuel, the former governor said their situation will be put into consideration."
  },
  {
    "headline": "UPDATED: Reps Ask FG To Declare National Emergency On Ritual Killings",
    "summarized_story": "The House of Representatives has called for the declaration of a national emergency on ritual killings across the country.\nThis formed part of the resolutions reached by the lawmakers on a motion of urgent public importance entitled ‘Need to Curb the Rising Trend of Ritual Killings in Nigeria’.\nWhile moving the motion, Okechukwu called the attention of the House to the recent incidents of ritual killings which he said have assumed an alarming rate.\nHe condemned the upsurge of reported ritual killings with increasing cases of abductions and missing persons in different parts of the country, saying the culprits in most cases rape, maim, kill and obtain sensitive body parts of unsuspecting victims for rituals.\nAccording to them, the Inspector General of Police should take urgent steps to increase surveillance and intelligence gathering, with a view to apprehend and prosecute all perpetrators of ritual killings in Nigeria."
  },
  {
    "headline": "Adulterated Petrol Has Been Removed From The Market – Petroleum Marketers",
    "summarized_story": "Petroleum marketers have explained that the long fuel queues, which recently surfaced in Lagos, Abuja, and some parts of the country are caused by the distribution of some adulterated products which has now been removed from the market.\nI can tell you that the product has been removed from the market but the ripples caused are still there.\nHe stressed that retailers have removed the contaminated petrol and the new products will soon be in full circulation.\nAhmed said while the quality control agencies of the government have swung into action, NNPC Limited and oil marketers have been directed to ensure a robust supply of petroleum products.\nMeanwhile, some parts of the country have continued to witness heavy traffic as motorists jostle for fuel in long queues."
  },
  {
    "headline": "Tragedy As OAU Student Falls Into Soakaway, Dies",
    "summarized_story": "Tragedy struck at the Obafemi Awolowo University, Ile Ife, when one of its students, Ajibola Heritage Ayomikun, died after falling into a soakaway at one of the private hostels in the Students Village.\nWhile she was rushed to the OAU Teaching Hospital for medical attention, the student was certified dead upon reaching the hospital.\nReacting, the Vice-Chancellor, Professor Eyitope Ogunbodede, sympathised with the student and condoled the parents of the deceased.\nAccording to the university’s spokesman, the VC led his management team to the scene and described the incident as unacceptable.\nThe Vice-Chancellor, therefore, appealed to the students to remain calm and law-abiding as the police, who have been briefed, are also investigating."
  },
  {
    "headline": "Niger State APC adopts consensus to choose National Convention delegates -",
    "summarized_story": "The Niger state chapter of the All Progressives Congress says it will use consensus to choose a candidate to represent the state at the upcoming national chairmanship election.\nState Chairman of the party Haliru Jikantoro disclosed this while receiving reports of the reconciliation committee at the state party secretariat in Minna.\nThis led to the formation of factions running a parallel state Congress.\nBarely a week after the state APC chairmen were in inaugurated at the national office in Abuja, the reconciliation committee led by Bawa Bwari are in the Niger state office of the party to present the report of the committee to the state working committee.\nThere is Yet another problem up ahead with three aspirants contesting for the position of national chairman of the party from the state."
  },
  {
    "headline": "Emir of Ilorin's brother joins 2023 House of Reps race",
    "summarized_story": "Yusuf Zulu-Gambari, one of the brothers of the Emir of Ilorin, Dr Ibrahim Zulu-Gambari, has joined the race for the house of representatives from Kwara state.\nHe’s planning to represent Ilorin East and Ilorin South federal Constituency in the green chamber of the national assembly on the platform of the Peoples Democratic Party.\nAdvertisementAdvertisementZulu-Gambari presented his letter of intent to the PDP leadership at his Balogun Fulani ward one, Ilorin.\nThe house of representatives hopeful also encouraged the electorate to obtain their permanent voter cards in order to be eligible to vote and be voted for.\nAdvertisementYusuf Zulu Gambari is planning to replace Abdulganiyu Cook-Olododo who was elected in 2019 on the platform of the All Progressives Congress."
  },
  {
    "headline": "Any party that field northern candidate will lose- Akeredolu -",
    "summarized_story": "Chairman of the Southern Governors’ Forum and Ondo State Governor, Rotimi Akeredolu has warned that any party that fields a northern candidate in the 2023 Presidential election will lose.\nGovernor Akeredolu disclosed that Governors in the Southern part of the country under the auspices of the Southern Governors Forum are determined to ensure that next President comes from the south.\nGovernor Akeredolu said: “In about two or three meetings, we have come out and declared that power must move to the south.\nAdvertisement“Only a party that is determined to lose will field a northern candidate.\nWhat we stand for is fair and equitable power rotation."
  },
  {
    "headline": "Ondo former deputy governor, Ali Olanusi loses wife",
    "summarized_story": "The wife of a former deputy governor of Ondo State, Alhaja Bejide Olanusi is dead.\nShe died in Akure, having complained of stress and was taken to an hospital.\nAdvertisementIn the meantime time, the Ondo State chapter of the All Progressives Congress (APC) has commiserated with the family of former deputy governor in the State, Alhaji Ali Olanusi, over the death of his wife, Alhaja (Chief) Bejide.\nState Chairman of the party, Ade Adetimehin, described sad development as ill-timed, shocking and unfortunate.\nHe said Alhaja was a strong pillar behind the husband’s political success story."
  },
  {
    "headline": "PDP Bigwigs Visit Ex-Leader Babangida in Minna, Agree to Suspend Zoning Debate",
    "summarized_story": "Ayu, who flew into Minna, was with the state chairman of PDP, Mr Tanko Beji and other top executive members of the party in the state.\nAlso, former Niger State governor, Dr. Muazu Babangida Aliyu; former Minister of Internal Affairs, Alhaji Abubakar Tanko; former Minister of Information, Professor Jerry Gana and Senator Zaynab Kure, were part of the delegation.\nAnother significance of the visit was that, for the first time, it brought together the PDP warring factions in the state.\nA source close to one of the two leaders, informed THISDAY that the meeting centered principally on the zoning of the presidency ahead of the 2023 polls.\nHowever, immediately after the meeting, Ayu drove straight to the Minna International Airport, from where he returned to Abuja."
  },
  {
    "headline": "Nigeria University Lecturers Warn of Imminent Strike",
    "summarized_story": "According to him, “they (government) should let us know if they have any problem on the agreement signed and if there are issues, we will sit down on the round table and resolve the issues.\nAs we speak, the federal government has adamantly done nothing to ensure that the renegotiation agreement is signed and implemented.\nWe are calling on all Nigerians to prevail on the federal government to do the needful, “he said.\nOn the funding of state and federal universities, the zonal coordinator said politicians are interested in creating new universities as constituency project rather than funding existing ones, adding that academics are underpaid.\nGo to several of our universities, particularly our state universities, they are TETfund universities because the state government has nothing doing there."
  },
  {
    "headline": "Nigeria Drags UK’s Crime Agency to Court Over £150m Abacha Loot",
    "summarized_story": "In the latest legal tussle over the money, generally known in Nigeria as “Abacha loot”, the report stated that Nigeria wanted the crime-fighting agency, NCA, to release funds that it froze at the request of US authorities.\nThe report stated, “It is a complicated story with many twists and turns.\nHowever, the money Abacha and his associates plundered became the subject of an international search after the dictator’s sudden death in 1998, aged 54.\nThe NCA has been working with American authorities in a bid to confiscate the funds and return them to “the people of Nigeria,” the report stated.\nBut Nigeria desperately needs the money that Abacha stole.”Emmanuel Addeh in Abuja with agency report"
  },
  {
    "headline": "Nigeria: Buhari Angry Over Dirty Fuel in Circulation, Orders Query of Regulatory Agency",
    "summarized_story": "The Authority was created in August 2021 in line with the Petroleum Industry Act (PIA) and encompasses a merger of three defunct regulatory agencies: Petroleum Products Pricing Regulatory Agency (PPPRA), Petroleum Equalisation Fund (Management) Board (PEFMB), and the Midstream and Downstream Divisions of the Department of Petroleum Resources (DPR).\nIt is responsible for the regulation of the midstream and downstream petroleum operations in Nigeria which includes technical, operational, and commercial activities.\n“The reason the midstream/downstream authority is being queried first is that for now the bulk stops at its desk.\n“Our technical team in conjunction with NNPC Ltd and other industry stakeholders, will continue to monitor and ensure quality petroleum products are adequately supplied and distributed nationwide,” it added.\n“And NNPC is working seriously to see that they get the correct product so that the marketers will continue loading."
  },
  {
    "headline": "Nigeria, Ghana to Clash in Abuja on March 27 in World Cup Play-Off",
    "summarized_story": "Nigeria and Ghana will face off at the MKO Abiola National Stadium, Abuja on Sunday, 27th March in what is the final leg of a potentially explosive FIFA World Cup Qatar 2022 play-off round.\nThe Nigeria Football Federation on Tuesday confirmed the date of the reverse leg to the Confederation of African Football, with the Ghana Football Association now to confirm whether the first leg inside the Cape Coast Stadium will be on Wednesday, 23rd March or Thursday, 24th March.\nThe final leg encounter will be the 59th clash at senior level between both West African giants in a chequered 71 –year rivalry, and will also be the first game involving the Super Eagles at the country’s premium sporting arena since the Eagles defeated Sudan’s Falcons of Jediane 3-1 in an Africa Cup of Nations qualifying match on 15th October 2014.\nNigeria reached the play-off round after topping a qualifying pool that included Cape Verde, Liberia and the Central African Republic while Ghana emerged from the section that had South Africa, Zimbabwe and Ethiopia."
  }
]