[
  {
    "headline": "#EndSARSMemorial: Security operatives take over protest venue in Benin",
    "summarized_story": "A clash between members of the Civil Society Organisation and the members of the local vigilante was averted on Wednesday at Ring Road, Benin venue of the first anniversary of the #EndSARS protest, which rocked the country last year.\nSecurity operatives comprising the Nigeria Police, Department of State Services, Nigeria Security and Civil Defence Corps, Edo State Security Network (local vigilante), as early as 7:30 am occupied the Benin Museum Park venue meant for the one year EndSARS memorial in Benin, Edo State.\nThis angered the CSO member who came down from the vehicle and was almost exchanging blows with the local vigilante man.\nApart from this, the atmosphere was peaceful as the combined security operatives were strategically positioned at major routes that lead to the park.\nAt the main entrance to the Museum Park (Forestry Route), four security Hilux vehicles were parked as of the time of filing this report."
  },
  {
    "headline": "#EndSARSMemorial: Tear gas fired at hoodlums, not protesters, says Lagos CP",
    "summarized_story": "The Lagos State Commissioner of Police, CP Hakeem Odumosu, on Wednesday, said hoodlums were dispersed at the Lekki tollgate, the venue of the #EndSARSMemorial protest in Lagos.\nCP Odumosu, who spoke to newsmen at the tollgate, stated that the #EndSARSMemorial protesters had already left the location, adding that those who hung around were hoodlums with intentions to steal and cause destruction.\nHe said this while explaining why operatives of the Command fired tear gas canisters to disperse those at the tollgate.\nAccording to him, “The activists had informed us that their activity will start by 8am and last till 10am.\n“Those you can see around now are hoodlums who want to steal and cause destruction."
  },
  {
    "headline": "Breaking: Multichoice Vs FIRS: Tax Appeal Tribunal rules in favour of Multichioce",
    "summarized_story": "By Henry OjeluThe Tax Appeal Tribunal sitting in Lagos has ruled that Mulitchoice Nigeria has met the conditions necessary to pursue it appeal against the huge Tax sum levied on it by the Federal Inland Revenue Service, FIRS.\nDetails later…Vanguard News Nigeria"
  },
  {
    "headline": "Court fixes Nov 22 for arraignment of ex-Aviation Minister",
    "summarized_story": "A Federal High Court, Abuja on Wednesday fixed Nov 22 for the arraignment of ex-Aviation Minister, Stella Oduah, over allegations bordering on fraud while she served in the office.\nHowever, a check at the court on Wednesday by the News Agency of Nigeria (NAN) revealed that the matter, though not on the cause list, had been fixed for Nov. 22 and Nov 23 for trial.\nNAN also reports that the court had earlier fixed Feb. 9 for the arraignment of the former minister.\nBut due to the fact that she was not served with the court processes then, the arraignment could not go on.\nThe court also fixed April 19 for the arraignment but due to the strike by the Judiciary Staff Union of Nigeria (JUSUN), the matter could not hold."
  },
  {
    "headline": "EndSARS protesters storm Abuja streets",
    "summarized_story": "By Kingsley OmonobiScores of EndSARS protesters have taken to the streets of Abuja in the nation’s capital to commemorate the first anniversary of the protest.\nThe protesters converged on Unity Fountain, Abuja, before trooping through the streets and heading for the national assembly complex.\nActivist, Deji Adeyanju and Omoyele Sowore were seen leading the protesters who were carrying placards.\nPolicemen were seen around the protesters but did nothing to interfere with their marching and singing as they marched on the to the National Assembly."
  },
  {
    "headline": "BREAKING: Uproar as police disperse protesters at Lekki Tollgate, fire teargas canister",
    "summarized_story": "By Arogbonlo IsraelIt was an eyesore experience as security operatives fired teargas canisters to disperse protesters at Lekki Tollgate who were out to mark their one year anniversaryThis reporter couldn’t help but run for his dear life as some protesters were also injured in the process.\nIt was gathered that an unknown armed man reportedly tried to stab protesters shortly before the police raid.\nDetails shortly…"
  },
  {
    "headline": "Court fixes Nov 22 for arraignment of ex-Aviation Minister, Stella Oduah",
    "summarized_story": "A Federal High Court, Abuja on Wednesday fixed November 22 for the arraignment of ex-Aviation Minister, Stella Oduah, over allegations bordering on fraud while she served in the office.\nHowever, a check at the court on Wednesday by the News Agency of Nigeria (NAN) revealed that the matter, though not on the cause list, had been fixed for Nov. 22 and Nov 23 for trial.\nBut due to the fact that she was not served with the court processes then, the arraignment could not go on.\nThe court also fixed April 19 for the arraignment but due to the strike by the Judiciary Staff Union of Nigeria (JUSUN), the matter could not hold.\nThe anti-corruption agency is alleging that Oduah misappropriated public funds to the tune of N5 billion while serving as Minister of Aviation."
  },
  {
    "headline": "You must produce Nnamdi Kanu in court on Thursday – Lawyer tells FG",
    "summarized_story": "Lead counsel to Nnamdi Kanu, Ifeanyi Ejiofor, on Wednesday said the Federal Government must produce his client in court on Thursday.\nThe counsel also called on the Federal Government to ensure that security operatives deployed to the court are civil.\nKanu is billed to appear before Justice Binta Nyako-led Federal High Court on Thursday to continue his trial for treason.\nJustice Nyako, for him to be brought to Court on that 26th Day of July 2021.\nOur Client – Onyendu Mazi Nnamdi Kanu MUST and SHALL be produced in Court to face his trial."
  },
  {
    "headline": "Climate change: Farmers express fear of high foodstuff prices next year",
    "summarized_story": "Local farmers in Northern Nigeria have expressed fear that they may not have a bumper harvest in this year’s farming season.\nAn investigation has also shown that many local farmers in the region who can afford it were forced to embrace the irrigation system of farming to save their crops against damage.\nAnother farmer, Danladi Yahaya, observed that climate change is gradually affecting the local farmers due to a lack of awareness of weather conditions.\nHe stressed the need for sensitization to farmers in order to save many on the dangers associated with climate change for the overall interest of the region.\nHe said they are really afraid that many food prices might be doubled in the market due to how scarcity of water affected this year farming."
  },
  {
    "headline": "End SARS anniversary: Our demands still not met – Nigerians",
    "summarized_story": "As Nigerians mark the first year anniversary of the End SARS protest on Wednesday, Osogbo, the Osun State capital, wore a peaceful look as residents went about their normal daily activities.\nBusiness and normal activities in places like Stadium roundabout, Oke-Fia roundabout, Lameco roundabout, Ogo-Oluwa and Olaiya roundabout continue undisrupted even as minimal police presence was observed at Lameco junction.\nSome residents who spoke with DAILY POST on the End SARS anniversary were of the opinion that nothing had really changed as the injustice that was the main reason for the protest still existed in the society.\nAyo Ologun, a journalist, noted that Nigerians should remember that End SARS was a metaphor for a myriad of problems that Nigerians, especially the youths, had been experiencing.\nHe also called for a synergy between the people and security agencies especially the police in order to find a common ground to tackle police brutality, extortion in a way that will reflect the agenda of End SARS."
  },
  {
    "headline": "End SARS: Why I ordered policemen to tear gas protesters – Police Commissioner",
    "summarized_story": "The Lagos State Police Commissioner, Hakeem Odumosu, has said he ordered his men to tear gas #EndSARSMemorial protesters at the Lekki Toll Gate on Wednesday.\nSpeaking with newsmen, Odumosu said the police fired tear gas at the protesters to avoid a breakdown of law and order.\nThe police commissioner noted that he ordered his men to tear gas the protesters because they went against the promise earlier made that the procession will start by 8 am and end by 10 am.\nOdumosu added that any demonstration beyond the agreed time is constituting a nuisance and will not be tolerated.\nEndSARS: Police teargas protesters at Lekki tollgateThe Commissioner said: “The protest was between 8 am and 10 am, anything, after 10 am, is a nuisance."
  },
  {
    "headline": "Oyo: End SARS protesters dare police, organise one-year anniversary [PHOTO]",
    "summarized_story": "Scores of youths in Ibadan, the Oyo state capital, on Wednesday, organised a one-year anniversary of the End SARS protests.\nDAILY POST recalls that the End SARS protests which took place last year were organised in order to protest police brutality.\nThe Oyo State Police Command, on Tuesday, warned the protesters not to organise a commemoration of the protests.\nAmong the areas visited by DAILY POST where there was heavy police presence include Mokola Roundabout, Sango, University of Ibadan, Agbowo junction, Dugbe, and Oyo State Secretariat.\nBut, the protest took place despite the warning by the state police command and heavy police presence."
  },
  {
    "headline": "Buhari, Turkish President Erdogan in closed-door meeting",
    "summarized_story": "President Muhammadu Buhari is holding talks with the President of Turkey, Recep Tayyip Erdogan, at the Presidential Villa in Abuja.\nThe Turkish President, who arrived Abuja Tuesday evening, is expected to hold bilateral talks with President Buhari.\nRead Also: Buhari’s oil, gas reforms unparalleled – APC GroupBoth leaders are expected to consider about 24 agreements and Memoranda of Understanding (MOU).\nDisclosing the visitation plans of the Turkish President Tuesday evening, in a statement, Senior Special Assistant to the President on Media and Publicity, Mallam Garba Shehu, also said Erdogan would be commissioning the Turkish Cultural Centre in Abuja."
  },
  {
    "headline": "VIDEO: Cross: I had genuine feelings for Saskay, Angel",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "BREAKING: #EndSARS memorial protest gets rowdy as police fire teargas",
    "summarized_story": "Security operatives have fired tear gas canisters at the protesters gathered at the Lekki Tollgate area, Lagos.\nThe protest, which commenced around 8am, went rowdy around 11am.\nThe police also arrested several persons who were at the protest ground.\nThe Commissioner of Police, Hakeem Odumosu who arrived the protest ground, told reporters that the organisers had stated that the protest would be a two-hour protest but miscreants and thugs have also joined the protesters.\n- Advertisement -The Nation reports the memorial protest is to commemorate the first year anniversary of the #EndSARS protests, which rocked the nation last year."
  },
  {
    "headline": "Only time will tell if I’ll end up with Angel- Cross",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "Kaduna: 343 killed, 830 kidnapped, 210 injured in 3 months",
    "summarized_story": "From Noah Ebije, KadunaNo fewer than 343 persons were killed by bandits in Kaduna State in the third quarter of 2021.\nA total of 830 persons were kidnapped, while 210 were injured by bandits during the period under review.\nState Commissioner of Internal Security and Home Affairs Samuel Aruwan stated this on Wednesday while presenting the security report to State Governor Nasir El-Rufai.\nAruwan also revealed that 69 bandits were killed by security troops in the period under review.\nUSA companies need customer service reps to work from home, hourly pay in $13 per hour, must have a quiet environment to work, internet access.Click here to apply ."
  },
  {
    "headline": "BREAKING: #EndSARS: police clampdown on protesters at Lekki toll gate – The Sun Nigeria",
    "summarized_story": "Operatives of the Nigeria Police Lagos State command have come down heavily on suspected protesters of the #EndSARS at the Lekki Toll gate area, beating them up and throwing them inside a waiting van that conveyed them to the police headquarters.\nThe protester were at the Lekki Toll gate to commemorate the anniversary of #EndSARS protest.\nA young man who claimed to be a Canadian citizens was manhandled and thrown into the police van and taken to an unknown destination.\nAlso journalists were being attacked by the police who have deployed heavily at the Lekki Toll Gate area.\nMany residents of the Lekki area riding in the cars were spotted waving Nigeria flag and shouting #EndSARS Soro Soke, while stern look policemen try frantically to stop them."
  },
  {
    "headline": "#EndSARS: Nigerian youths’ve right to demand better future –Sanwo-Olu",
    "summarized_story": "LAGOS State Governor, Mr. Babajide Sanwo-Olu, yesterday, said Nigerian youths have enough reasons to demand a better life and future, adding that such demands have heightened their inability to live and prosper, due to the existing socioeconomic and political conditions, amongst other factors rocking the country.\nThe governor, who spoke at the Lagos youth"
  },
  {
    "headline": "2023: APC, PDP may soon implode –Jega",
    "summarized_story": "He also said it was not yet time to require political parties to conduct direct primaries.\n“People have captured and controlled political parties for self-serving objectives, so no energy is devoted to organising primaries.\nGovernors deploy state resources to control political parties in their states to decide which candidate will emerge.\nMy personal opinion is that it is not yet time to require political parties to conduct direct primaries,” he said.\n“We are not as prepared with electronic voting as we are with electronic transmission of results."
  },
  {
    "headline": "1 dead, 2 rescued from Ikorodu building collapse",
    "summarized_story": "THE National Emergency Management Authority (NEMA) has said one person died from a collapsed two-storey building in Ikorodu, Lagos State.\nTwo persons were rescued alive and taken to Ikorodu General Hospital for medical attention.\nThe incident occurred on Monday around 10 pm.\nThe collapse building was located at 97, Lagos road, Aruna area of Ikorodu.\n“Immediately the incident occurred, local residents within the area mobilised themselves to carry out initial rescue activities."
  },
  {
    "headline": "#EndSARS: Sanwo-Olu Brokers Truce with Youths, Promises Not to Give Up Belief in Them",
    "summarized_story": "Sanwo-Olu, who attended the peace forum, listened as the youths led conversation on how they could effectively channel their grievances to the authorities.\nSanwo-Olu said, “Today is a day of reconciliation and it is about our teeming youths.\n“This event is about aggregating all the conversations of the millions of youths that have been represented here.\nSecretary to Delta State Government (SSG), Chief Patrick Ukah, revealed this in a statement in Asaba.\nUkah said the decision to mitigate the pains suffered by some of the victims was based on the consideration of the report by the judicial panel of inquiry."
  },
  {
    "headline": "Military Deploys Helicopter Gunships Against Bandits in Kaduna, Decimates 50",
    "summarized_story": "•El-Rufai to troops: Let’s sustain momentum•Says more bandits must be brought to bitter endJohn Shiklam in Kaduna and Kingsley Nwezeh in AbujaThe Nigerian military, yesterday, pounded bandits in Kaduna forests with helicopter gunships, neutralising 50 and destroying many of their hideouts.\nKaduna State Governor Nasir El-Rufai hailed the renewed onslaught against banditry and kidnapping in the state.\nEl-Rufai appealed to the security forces to sustain the momentum and bring more bandits to their “bitter end”.\nFleeing bandits within the surrounding forests were followed up and engaged by ground forces.\n“In maintaining presence for an effective annihilation of the bandits, a second helicopter gunship came overhead the location in dogged support of the ground forces."
  },
  {
    "headline": "Buhari, Obasanjo, Jonathan, Akinyemi Mourn Powell, Commiserate with US Govt",
    "summarized_story": "In a statement by his Special Assistant on Media, Kehinde Akinyemi, Obasanjo said, “General Powell’s tenure in office marked a significant departure from the traditional relations between Africa and the United States.\n“He was Secretary of State under the administration of President George W. Bush, Jnr, part of the time I was President of Nigeria.\nHis articulation of the Powell Doctrine gave the United States, and the world at large, a new paradigm for engaging in military action with honour and decorum.\nAkinyemi said he had argued then that there could be circumstances when only overwhelming force could win a war (a sort of Colin Powell doctrine).\nBoth Arise Magazine and the Africa Rising Festival, ultimately gave rise to the fast rising television station of global standard, Arise News Channel."
  },
  {
    "headline": "Bandits Massacre 40 in Sokoto Market, Buhari Declares Total War",
    "summarized_story": "But in Kaduna State, security forces reportedly killed 10 bandits in Kwanan Bataru, Giwa Local Government Area.\nHe argued that the reality of declining insecurity should replace the inaccurate narrative of rising insecurity in the country.\nOne of the sheds used by the bandits to hold hostages was burnt.”Bandits Attack Sokoto Sunday Market, Kill 40No fewer than 40 people were killed as suspected bandits attacked a market in Goronyo Local Government Area of Sokoto State.\nSuspected bandits also killed 20 persons at Ungwan Lalle market, in Sabon Birni Local government Area of Sokoto State.\nThe Sokoto State government had earlier ordered the closure of markets in the Eastern Senatorial District of the state as a measure to fight the rising insecurity in the state."
  },
  {
    "headline": "Upstream Commission, Midstream/Downstream Authority Formally Begin Operations",
    "summarized_story": "The development signaled the official winding up of three agencies which they succeeded as prescribed by the Petroleum Industry Act (PIA).\nHe explained that after a rigorous screening process and the issuance of letters of appointment to the new chief executives, both regulatory agencies have now taken off with competent leadership.\nIt also repeals the DPR Act, the Petroleum Inspectorate Act and the Petroleum Equalisation Act and the PPPRA Act.\nThe authority has staffing coming from the defunct PEF, PPPRA and the DPR and of course the commission staff will come from the DPR.\nThis will lead to industrialisation, job creation and our main focus is to attract investment in gas."
  },
  {
    "headline": "BREAKING: Tension As Police, Army Clash With #EndSARS Memorial Protesters In Abuja",
    "summarized_story": "Armed security operatives have blocked Nigerians youths protesting in memory of those killed and brutality at Lekki tollgate in Lagos State and around the country during the #EndSARS protest on October 10, 2020.\nThe protest tagged #EndSARSMemorial kicked off from the unity fountain with demand for end in police brutality in the country.\nThe protesters insisted on marching to the National Assembly and the demand for justice for the victims of Lekki massacre but they were prevented by the security operatives led by the FCT Deputy Commissioner of Police in charge of operations, Ben Igweh.\nThe police and security operatives asked the protesters to return to the Unity Fountain and continue with their protest leading to an altercation as the protesters stood their ground.\nAs at time of filing this story the stand-off continued as protesters remained on the road and vowed not to leave until their demands were met."
  },
  {
    "headline": "BREAKING: Tension As Police, Army Clash With #EndSARS Memorial Protesters In Abuja",
    "summarized_story": "Armed security operatives have blocked Nigerians youths protesting in memory of those killed and brutality at Lekki tollgate in Lagos State and around the country during the #EndSARS protest on October 10, 2020.\nThe protest tagged #EndSARSMemorial kicked off from the unity fountain with demand for end in police brutality in the country.\nThe protesters insisted on marching to the National Assembly and the demand for justice for the victims of Lekki massacre but they were prevented by the security operatives led by the FCT Deputy Commissioner of Police in charge of operations, Ben Igweh.\nThe police and security operatives asked the protesters to return to the Unity Fountain and continue with their protest leading to an altercation as the protesters stood their ground.\nAs at time of filing this story the stand-off continued as protesters remained on the road and vowed not to leave until their demands were met."
  },
  {
    "headline": "WATCH LIVE: #EndSARSMemorial Protest At Lekki Tollgate In Lagos",
    "summarized_story": "You may also like"
  },
  {
    "headline": "WATCH LIVE: #EndSARSMemorial Protest At Lekki Tollgate In Lagos",
    "summarized_story": "You may also like"
  },
  {
    "headline": "Nigerian Soldiers Torture Delta Man To Death For Stealing Cables",
    "summarized_story": "Some soldiers of the Nigerian Army have tortured to death a man, Mr Azuka Ossai, who was a resident of Aboh community in the Ndokwa East Local Government Area, Delta State, SaharaReporters gathered.\nSaharaReporters learnt that the military men, who were guarding an oil company, Enikkom Nigeria Limited, allegedly tortured Ossai to death, after accusing him of stealing some cables from the company.\nThe source said, “There was an extrajudicial killing in my place by soldiers.\nThere have been communal issues and the oil company is trying to come and work in the community.\nBut the soldiers just accused him of stealing a cable and started beating him."
  },
  {
    "headline": "Pro-Buhari protesters hit Unity Fountain, say nobody died at Lekki tollgate",
    "summarized_story": "A group of pro-Buhari protesters has converged on the Unity Fountain in Abuja, saying “nobody died at Lekki tollgate” in Lagos.\nAdvertisementThe protesters who were conveyed to the venue on a bus, held up placards stating,”#EndSarsProtest; Lekki shooting was a hoax”, and ”Nobody died at Lekki tollgate”.\nOn October 20, 2020, soldiers reportedly opened fire on protesters campaigning against police brutality at Lekki tollgate.\nWhile some reports, including civil society groups say some protesters were killed in the attack, the federal government has disputed this account.\nNigerians poured into the streets in Lagos, Abuja and other places today to mark the first anniversary of the #EndSARS protest."
  },
  {
    "headline": "Pro-Buhari protesters hit Unity Fountain, say nobody died at Lekki tollgate",
    "summarized_story": "A group of pro-Buhari protesters has converged on the Unity Fountain in Abuja, saying “nobody died at Lekki tollgate” in Lagos.\nAdvertisementThe protesters who were conveyed to the venue on a bus, held up placards stating,”#EndSarsProtest; Lekki shooting was a hoax”, and ”Nobody died at Lekki tollgate”.\nOn October 20, 2020, soldiers reportedly opened fire on protesters campaigning against police brutality at Lekki tollgate.\nWhile some reports, including civil society groups say some protesters were killed in the attack, the federal government has disputed this account.\nNigerians poured into the streets in Lagos, Abuja and other places today to mark the first anniversary of the #EndSARS protest."
  },
  {
    "headline": "#EndSARSMemorial: Police tear-gas protesters at Lekki tollgate",
    "summarized_story": "The protest to commemorate #EndSARS first anniversary has taken a different turn as the police fired teargas at protesters at Lekki tollgate in Lagos.\nAdvertisementNigerians in Lagos, Abuja and some other states poured into the streets on Wednesday to mark the first anniversary of the #EndSARS protest.\nThe #EndSARS protest of October 2020 was a campaign against police brutality, harassment, extortion and extrajudicial killing by the special anti-robbery squad (SARS).\nSpeaking to journalists shortly after, Hakeem Odumosu, Lagos commissioner of police, said the protesters told him they were going to end the demonstration by 10 am.\n“Between 8am and 10am, anything after 10 am is a nuisance,” Odumosu said."
  },
  {
    "headline": "#EndSARSMemorial: Police tear-gas protesters at Lekki tollgate",
    "summarized_story": "The protest to commemorate #EndSARS first anniversary has taken a different turn as the police fired teargas at protesters at Lekki tollgate in Lagos.\nAdvertisementNigerians in Lagos, Abuja and some other states poured into the streets on Wednesday to mark the first anniversary of the #EndSARS protest.\nThe #EndSARS protest of October 2020 was a campaign against police brutality, harassment, extortion and extrajudicial killing by the special anti-robbery squad (SARS).\nSpeaking to journalists shortly after, Hakeem Odumosu, Lagos commissioner of police, said the protesters told him they were going to end the demonstration by 10 am.\n“Between 8am and 10am, anything after 10 am is a nuisance,” Odumosu said."
  },
  {
    "headline": "#EndSARSMemorial: Security operatives block protesters from marching to n'assembly",
    "summarized_story": "Operatives of the Department of State Services (DSS), soldiers and police officers have prevented #EndSARSMemorial protesters from marching to the national assembly.\nAdvertisementHowever, on their way to the national assembly, they came face to face with security operatives who mounted a barricade.\nThe security operatives, who were armed with guns and whips, also blocked the road with their cars.\nAdvertisementAfter a dialogue of over one hour between the security operatives and the protesters, no progress was made.\nThe demonstration reached its climax on October 20, 2020, when security operatives opened fire on protesters at Lekki tollgate in Lagos."
  },
  {
    "headline": "Baxi acquisition deal sees MFS Africa expand footprint into Nigeria",
    "summarized_story": "As the largest fintech interoperability hub in Africa, MFS Africa connects banks, telcos, and money transfer operators across over 35 countries via a single integration point.\nCapricorn will be called MFS Africa but its core product, Baxi, retains its name.\nMFS Africa was founded in 2009 by Dare Okoudjou, a Beninese national, while Nigeria-born Abudu started Capricorn in 2014, with Folu Majekodunmi.\nThe acquisition creates a larger, more versatile company that fuses interoperability between money operators and a super-agent network reaching the mass market.\nMFS Africa will also expand Baxi’s proposition for offline SMEs to select markets within its footprint."
  },
  {
    "headline": "Editi Effiong: father, writer, producer and tech bro",
    "summarized_story": "When asked how he would define himself, he responded with, “I’m a father, writer, producer, and tech bro.\nThe big picture: Editi Effiong is not your average guyMany people know Editi Effiong as the brains behind Anakle.\nAnakle Films’ theatrical releases, Up North and The Setup, were acquired by Netflix in 2019 and 2020 respectively.\nIn 2011, digital marketing didn’t have as much clout as it does now.\nEspecially knowing that you were going to put a lot of time and effort into building out Anakle Films’ brand?"
  },
  {
    "headline": "Who’s afraid of crypto-salaries?",
    "summarized_story": "Back in 2015, its current president, Muhammadu Buhari, campaigned on a promise to increase the value of the naira.\nThis plunge in the value of the naira has been majorly fueled by Nigeria importing more goods than it exports.\nWith 96% of the crypto value coming from outside the continent, this suggests that more Africans are receiving remittances via crypto.\nThis is the company battling the challenge that comes with paying employees in crypto, as legal barriers in many countries prevent this.\nSome of the barriers include the non-recognition of cryptocurrency as a legal tender and the challenge of calculating taxes when employees are paid in cryptocurrency."
  },
  {
    "headline": "I promise it’s funnier in Swahili…Kenyan Comedian Eddie Butita is Showing Netflix How Swahili’s Done",
    "summarized_story": "To roll out this project, the $25 billion company enlisted the help of celebrated Kenyan comic, Eddie Butita.\nButita is skilled at wielding digital technology in a market that’s grown so big that Netflix can’t ignore it.\nAccording to the Worldwide Mobile Data Pricing (2021) report from Cable, a British technology research firm, Kenya takes the lead as the most expensive country for mobile data in East Africa.\nViewing one hour of Netflix content on low resolution (480p) uses 300 MB of data per hour; in high resolution (1080p), Netflix uses 3 GB per hour.\nAt an average cost of $1.05 per GB of data, Netflix viewers in Kenya stand to pay anywhere from $0.32 to $3.15 to watch a one-hour show."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, I'm sure today's header might have warned you what to expect.\nBrace yourself for an exciting lineup of news..."
  },
  {
    "headline": "20.10.2020: We will not forget",
    "summarized_story": "This post is a delayed version of Techpoint Digest , a week-daily newsletter that rounds up major happenings in African tech.\nBut, on October 4, 2020, the online protest gained momentum as videos of police brutality circulated on social media.\nAnd we will not forget how technology, through social media, enabled our voices to be heard.\nThe company helps users track gas quantity used, gas quantity remaining, consumption, and transaction history.\nThe Backup platform was created to solve the rising case of police brutality among Nigerian youths."
  },
  {
    "headline": "Nigerian clean energy startup, Homefort Energy, wants to make sure you never have cooking gas worries again",
    "summarized_story": "“Our smart metre’s tamper-proof feature achieves over 95% customer retention by preventing unauthorised retailers from refilling their cylinders,” Owosho says.\nAs a result, when a customer runs out of gas, Homefort notifies them and schedules a delivery.\nMoreover, barcode tags on Homefort cylinders allow them to track the age and health of the cylinders in real-time.\nTo gain access to Homefort, users must first install the Homefort app, available for both Android and iOS systems.\nNew users who do not have cylinders or whose cylinders are more than eight years old must purchase Homefort cylinders."
  },
  {
    "headline": "African healthtech startup, Healthtracka, gets into Techstars Toronto Accelerator programme",
    "summarized_story": "Share this article:Healthtracka, a Nigeria-based healthtech startup decentralised laboratory testing in Africa by providing at-home tests and digital results, has announced joining the Techstars Toronto Accelerator programme.\nAdvertisementHow does it feel to get into Techstars Toronto?\nSeeing a global accelerator like Techstars also identifying with us and backing us is exciting.\nI will recommend that every founder joins a global accelerator for the sake of themselves and their companies.\nAccording to Sunil Sharma, Managing Director of Techstars Toronto, the nature of the problem that Healthtracka is looking to solve was a major attraction."
  },
  {
    "headline": "Eid-El-Maulud: Obaseki harps on tolerance, peaceful coexistence – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – I join our Muslim brothers and sisters in Edo State in celebrating the birth of Prophet Mohammed (S.A.W.)\nThe Eid-El-Maulud celebration offers us the opportunity to ponder on the importance of peaceful coexistence and tolerance.\nThe spirit of the Eid-El-Maulud celebration should guide us in working together and with a common drive to build strong coalitions that will entrench development and progress in our state.\nI reassure the Muslim faithful that our administration remains committed to ensuring the welfare and peaceful co-existence of all residents.\nGodwin ObasekiGovernor, Edo State..."
  },
  {
    "headline": "Edo, APOI, other stakeholders validate guidelines to drive investment – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – To sustain a friendly business environment and capital inflows, the Edo State Government has engaged Africa Palm Oil Initiative (APOI), Proforest and other stakeholders to develop and validate the Free Prior Informed Consent (FPIC) guidelines so as to improve investors’ confidence.\n“The law would boost the confidence of investors and communities to ensure that they know what it requires to secure investment in the state,” he noted.\n“When the document is passed into law, investors would now have the confidence to come in knowing exactly what to do to stake their investment.\nThe FPIC law will also let them know the role of government and what it will do to back their investment in terms of profitability as no investors will be able to cut corners when it comes to investment in Edo State.\n“We really want to have a situation where the communities, local and state governments will work in harmony, as stipulated in the FPIC documents.”..."
  },
  {
    "headline": "Edo police mobilize 3,000 personnel for Eid-Maulud – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY-Edo Police Command has said that it had deployed over 3,000 personnel to provide adequate security for lives and property before, during and after today’s Eid-El Maulud in the state.\nThe command assured that security had been beefed up around mosques and event centres across Edo State.\nThis was made known in a press release signed by the command Public Relations Officer SP Kontongs Bello and made available to journalists in Benin City.\nThe statement wishes Muslim faithful a happy Eid-El Maulud, it however enjoined them to celebrate within the armpit of the law and relevant COVID-19 protocols.\nIt however urged anyone in distress to call Edo State Police Command Control Room through the following numbers: 08037646272, 08123827225, 08056776365 and 08077773721."
  },
  {
    "headline": "World Food Day: Obaseki urges innovation to tackle food security, assures more support for smallholder farmers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for innovations to tackle all challenges threatening food sufficiency, ensuring farmers and other stakeholders in the agricultural value chain increase agricultural productivity and achieve food security.\nObaseki gave the charge in commemoration of World Food Day, marked yearly by the Food and Agriculture Organisation (FAO), and other organs of the United Nations (UN).\nSpeaking on the theme of this year’s World Food Day, ‘Our actions are our future’, Obaseki called on everyone to be a food hero contributing to the transformation of agri-food systems and ensuring enough food for the global population.\nA similar intervention programme was undertaken in Warrake Community, Owan East Local Government Area on a 500ha farmland.\n“In Usugbenu, Ugboha and Sobe communities in Esan Central, Esan Southeast and Owan West, respectively, we empowered 1,500 farmers on the production of maize."
  },
  {
    "headline": "Why we won’t accept APC executives in Kano – Shekarau",
    "summarized_story": "A former Governor of Kano State, Ibrahim Shekarau, on Wednesday, said his group will not accept the new state executive council of the All Progressives Congress (APC) elected at the state congress of the party on Saturday.\nThe congress was attended by members o the party loyal to Governor Abdullahi Ganduje.\nMr Shekarau, who is the sitting senator for the Kano Central district, and many of his colleagues from Kano in the National Assembly held a parallel congress but it was not recognised by the APC national leadership.\nHe said the aggrieved members have petitioned the National Headquarters of the party to express their dissatisfaction with the conduct of the wards and local governments congresses in Kano State, which preceded the state congress.\nPREMIUM TIMES reported how the group, sent a petition to the national headquarters of the party."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "#EndSARS: Despite video evidence, Nigerian govt insists no killing took place at Lekki tollgate on 10/20/20",
    "summarized_story": "Where are the families of those who were reportedly killed at the toll gate?\nPHANTOM MASSACRE AT LEKKI TOLL GATEToday marks the first anniversary of the phantom massacre at Lekki Toll Gate in Lagos, which was the culmination of an otherwise peaceful protest that was later hijacked by hoodlums.\nAt earlier press conferences, I had called the reported massacre at the toll gate the first massacre in the world without blood or bodies.\nWhere are the families of those who were reportedly killed at the toll gate?\nIMPROVED EFFICIENCY OF NIGERIA POLICE FORCE AND OTHER SECURITY AGENCIES’ ARCHITECTURENEC called on the leadership of the security agencies to ensure that –a."
  },
  {
    "headline": "#EndSARS Memorial: Police arrest protesters at Lekki Tollgate, activists resort to car procession",
    "summarized_story": "Some protesters marking the one year anniversary of the Lekki Tollgate shooting, have been arrested by the Lagos State police command, while some activists have resorted to car procession.\nSome of the arrested include journalists covering the protest, while others were those seen carrying placards.\nMeanwhile, amid police crackdown, some protesters, including comedian, Mr. Macaroni and musician on, Falz, have resorted to car procession.\nThe activists who turned up at the tollgate with their cars were seen waving Nigerian flags from inside the vehicles and honking the horns while singing solidarity songs.\nSome who spoke to journalists said they will continue going to and fro the tollgate as their own way of protesting."
  },
  {
    "headline": "FG earmarks N71.6bn for railway projects across the country",
    "summarized_story": "Nigeria’s federal government has budgeted the sum of N71.6bn for new railway projects across the country.\nThis is contained in the highlight of the 2022 budget of the Ministry of Transportation, Daily Trust reported.\nThe two standard gauge rail lines are currently optional in Nigeria providing passenger and haulage services for the people of the axis.\nThese projects are independent of the railway projects for which concessionary loans are being sourced from various channels especially the China Exim Bank which funded the Abuja-Kaduna and the recently launched Lagos-Ibadan standard gauge railway.\nDaily Trust"
  },
  {
    "headline": "#EndSARS Memorial: Group launches initiative to support youths, as Nigerians demand justice for victims",
    "summarized_story": "According to Saraki, “On the first anniversary of October 20th, 2020, like many Nigerians, I have struggled with coming to terms with the sobering events of that day.\nSimilarly, none of the perpetrators of mindless acts of destruction and looting of property worth billions of Naira have been arrested or brought to justice.\n“It appears that the lessons that ought to be learned from the events last year have been lost.\n“Today represents an opportunity for the government to begin the police and justice sector reforms our country so badly needs.\n“EndSARS protest awakened the consciousness of this nation and recharged the reluctant and the slumbering segment of our society,” @ShehuSani."
  },
  {
    "headline": "We Will Nab Killers Of Traditional Rulers – Imo Police",
    "summarized_story": "Hours after the attack on traditional rulers in Njaba local government area of Imo State on Tuesday, the State Police Commissioner, Rabiu Hussaini, has said the command will nab the fleeing gunmen.\nThis is even as he insisted that only two monarchs were killed during the shooting spree, while one sustained gunshot wounds.\nThe two monarchs killed during the attack are Eze S. C Osunwa of Ihebinowere Autonomous Community and Eze Barr A. E Durueburuo, Obi of Okwudor Autonomous Community while Eze A. N Onyeka (JP) of Nkume Autonomous Community sustained gunshot injury.\nIheanacho had invited 15 traditional rulers to a meeting without informing any of the security agencies.\nMeanwhile, the State Police boss has expressed his condolences to the families of the two slain traditional rulers and enjoined people to go about their lawful businesses, saying they will bring the perpetrators of the attak to book."
  },
  {
    "headline": "We Will Nab Killers Of Traditional Rulers – Imo Police",
    "summarized_story": "Hours after the attack on traditional rulers in Njaba local government area of Imo State on Tuesday, the State Police Commissioner, Rabiu Hussaini, has said the command will nab the fleeing gunmen.\nThis is even as he insisted that only two monarchs were killed during the shooting spree, while one sustained gunshot wounds.\nThe two monarchs killed during the attack are Eze S. C Osunwa of Ihebinowere Autonomous Community and Eze Barr A. E Durueburuo, Obi of Okwudor Autonomous Community while Eze A. N Onyeka (JP) of Nkume Autonomous Community sustained gunshot injury.\nIheanacho had invited 15 traditional rulers to a meeting without informing any of the security agencies.\nMeanwhile, the State Police boss has expressed his condolences to the families of the two slain traditional rulers and enjoined people to go about their lawful businesses, saying they will bring the perpetrators of the attak to book."
  },
  {
    "headline": "Buhari Breaking Jinx In Oil, Gas Sector, Says APC Legacy Group",
    "summarized_story": "President Muhammadu Buhari-led administration is breaking the jinx in the oil and gas sector through rejuvenation of its activities after decades of weak operation.\nIt added that the commencement of construction of the Ajaokuta-Kaduna-Kano AKK Gas Pipeline, Nigeria’s biggest ever domestic gas pipeline project in addition to the total revamp of the Port Harcourt refinery was another jinx being broken.\n”Published Audited Financial Statements for 2018, 2019 and 2020.\nThis is the first published Audited Financial Statements since the NNPC came into existence 43 years ago.\nCompleted the Escravos-Lagos Pipeline System (ELPS) Phase 2, doubling its capacity to 2.2 billion cubic feet of gas”."
  },
  {
    "headline": "Buhari Breaking Jinx In Oil, Gas Sector, Says APC Legacy Group",
    "summarized_story": "President Muhammadu Buhari-led administration is breaking the jinx in the oil and gas sector through rejuvenation of its activities after decades of weak operation.\nIt added that the commencement of construction of the Ajaokuta-Kaduna-Kano AKK Gas Pipeline, Nigeria’s biggest ever domestic gas pipeline project in addition to the total revamp of the Port Harcourt refinery was another jinx being broken.\n”Published Audited Financial Statements for 2018, 2019 and 2020.\nThis is the first published Audited Financial Statements since the NNPC came into existence 43 years ago.\nCompleted the Escravos-Lagos Pipeline System (ELPS) Phase 2, doubling its capacity to 2.2 billion cubic feet of gas”."
  },
  {
    "headline": "NACAMA Urges Nigerians To Eat Balanced Diet",
    "summarized_story": "National Complementary and Alternative Medical Association (NACAMA), has advised Nigerians to eat balanced diet as preventive medicine against known and emerging diseases.\nThe celebration is themed: “Our Actions Are Our Future – Better Production, Better Nutrition, Better Environment and Better Life.”Katchy said with good and nutritious food especially balanced diet, Nigerians have a chance to live healthy and fulfilled lives.\n“When we eat a balanced diet, the cells in the body will be nourished, their activities will be optimal and we will enjoy a feeling of well-being.\nWe have two classes of food – balanced food and junk food.\n“A balanced food contains the necessary nutritional chains of life in their right proportion and quality."
  },
  {
    "headline": "Sex video: Tiwa Savage must apologise to fans – actress, Chioma Ifemeludike",
    "summarized_story": "Nollywood actress, Chioma Ifemeludike, has stated that Tiwa Savage must apologise to her fans concerning the release of her alleged sex tape.\nOn Monday night, a sex tape leaked online.\nWhile the face of the man involved in it did not show, the lady in the video bears a close resemblance with Tiwa Savage.\nIfemeludike, however, condemned the act by Tiwa Savage, stating that the singer should apologise to her fans.\nSex is a sacred gift given to humans to enjoy in matrimony by God.”The actress added that people are hailing ‘evil’ because it involves Tiwa Savage, stating that such people are hypocrites."
  },
  {
    "headline": "Sex video: Tiwa Savage must apologise to fans – actress, Chioma Ifemeludike",
    "summarized_story": "Nollywood actress, Chioma Ifemeludike, has stated that Tiwa Savage must apologise to her fans concerning the release of her alleged sex tape.\nOn Monday night, a sex tape leaked online.\nWhile the face of the man involved in it did not show, the lady in the video bears a close resemblance with Tiwa Savage.\nIfemeludike, however, condemned the act by Tiwa Savage, stating that the singer should apologise to her fans.\nSex is a sacred gift given to humans to enjoy in matrimony by God.”The actress added that people are hailing ‘evil’ because it involves Tiwa Savage, stating that such people are hypocrites."
  },
  {
    "headline": "Why EndSARS protest is unnecessary – Sanwo-Olu",
    "summarized_story": "Lagos State Governor Babajide Sanwo-Olu and Lagos Chamber of Commerce and Industry (LCCI) yesterday said a protest in commemoration of last year’s #EndSARS demonstration is unnecessary.\nThe LCCC Director-General, Dr Chinyere Almona, who lamented the impact of the #EndSARS protest on business across the country, pointed out that the business community lost over N700 billion to the protests.\n– Advertisement –The LCCI chief spoke against the backdrops of the one-year anniversary of the #ENDSARS protest.\nNBA Ikeja branch chairman, Bartholomew Aguegbodo, said the effects of the #EndSARS protest was still being felt by lawyers as key stakeholders in the administration of justice system.\nIche advised against any protest during EndSARS anniversary, saying that the impacts would affect the masses more."
  },
  {
    "headline": "Why EndSARS protest is unnecessary – Sanwo-Olu",
    "summarized_story": "Lagos State Governor Babajide Sanwo-Olu and Lagos Chamber of Commerce and Industry (LCCI) yesterday said a protest in commemoration of last year’s #EndSARS demonstration is unnecessary.\nThe LCCC Director-General, Dr Chinyere Almona, who lamented the impact of the #EndSARS protest on business across the country, pointed out that the business community lost over N700 billion to the protests.\n– Advertisement –The LCCI chief spoke against the backdrops of the one-year anniversary of the #ENDSARS protest.\nNBA Ikeja branch chairman, Bartholomew Aguegbodo, said the effects of the #EndSARS protest was still being felt by lawyers as key stakeholders in the administration of justice system.\nIche advised against any protest during EndSARS anniversary, saying that the impacts would affect the masses more."
  },
  {
    "headline": "End SARS: Why I Ordered Policemen To Tear Gas Protesters – Police Commissioner.",
    "summarized_story": "On Wednesday, Hakeem Odumosu, the Lagos State Police Commissioner, stated he ordered his troops to tear gas #EndSARSMemorial demonstrators at the Lekki Toll Gate.\nSpeaking with newsmen, Odumosu said the police fired tear gas at the protesters to avoid a breakdown of law and order.\nThe police commissioner noted that he ordered his men to tear gas the protesters because they went against the promise earlier made that the procession will start by 8 am and end by 10 am.\nThe Commissioner said: “The protest was between 8 am and 10 am, anything, after 10 am, is a nuisance.\n“I discussed with them and they said they will end the protest by 10 o’clock."
  },
  {
    "headline": "#EndSARS Memorial: Tiimeline Of Notable Dates To Remember In October 2020.",
    "summarized_story": "Oct. 6, 2020: Protesters block major roads in Delta State, heating up the protest on Twitter, which spilled over to Lagos.\nOct. 8, 2020: Protesters led by celebrities slept in front of the Lagos Government House.\nOct. 14, 2020: Protesters were attacked in Abuja.\nProtests were also held in Belgium, the U.K., and the U.S.Oct. 15, 2020: Hoodlums attacked protesters in Lagos as Christian cleric, Enoch Adeboye, backed the #EndSARS movement.\nOct. 19, 2020: Hoodlums attacked Benin Correctional Centre to free some inmates in one of the cells."
  },
  {
    "headline": "BREAKING: Police Teargas EndSARS Protesters In Lagos [ VIDEO, PHOTOS]",
    "summarized_story": "Police on Wednesday fired teargas at the Lekki tollgate to disperse protesters.\nThe youths had converged on the Lekki tollgate to mark the first anniversary of #EndSARS in the country.\nSpeaking to journalists shortly after, Hakeem Odumosu, Lagos commissioner of police, said the protesters told him they were going to end the demonstration by 10 am.\n“Between 8 am and 10 am, anything, after 10 am, is a nuisance,” Odumosu said.\nEarlier, operatives of the Lagos State Police Command arrested two protesters."
  },
  {
    "headline": "BREAKING: #EndSARSMemorial protest begins at Ministry of Justice building, Abuja",
    "summarized_story": "Heavy security as protesters march in front of Ministry of Justice building, Abuja.\nPhoto: Deborah Tolu-KolawoleA protest to mark the first anniversary of the #EndSARS movement has begun in front of the Ministry of Justice building, Maitama, Abuja.\nThe protesters gathered at the front of the building with banners and placards on Wednesday, majorly dressed in black.\nThere is also a heavy presence of security personnel at the venue to control the crowd and moving vehicles, as the protesters occupied a part of the road.\nSee photos below:"
  },
  {
    "headline": "Pictures: How 6th National Youth Games ended glamorously",
    "summarized_story": "Again, Delta state has emerged Champions of the National Youth Games (NYG) held inside spacious and prestigious University of Ilorin (Unilorin).\nThe week long sporting activities for athletes who are under-15 witnessed display of raw talents.\nAt the closing ceremony, Minister of Youth and Sports Development, Mr. Sunday Dare, said, “Everything that has a beginning must have an end.\n“Since its first edition was held in 2013, the National Youth Games has grown in leaps and bounds.\nSome of the outstanding gymnasts like Obiefuna Munachi, the 13 year old from FCT and Mustapha Oriyomi, another 13 year old from Delta."
  },
  {
    "headline": "Breaking: 2 weeks after takeover, Newcastle sack Bruce",
    "summarized_story": "Steve Bruce has finally been sacked as head coach of Newcastle United by their new Saudi-backed owners, nearly two weeks after they bought the club.\nBruce is set to pocket £8million in compensation as he departs his boyhood club.\nGraeme Jones is now in temporary charge while a new boss is recruited.\nHis first game in charge will be a trip to Crystal Palace on Saturday.\nDetails loading…"
  },
  {
    "headline": "Eid-el Maulud: Northern governors preach inter-religious harmony",
    "summarized_story": "Muslim Community across the world marked Eid-el-Maulud Nabyyi (birth of the Holy Prophet Muhammad), with the northern governors calling on Mulslim faithful to emulate the teachings and virtues of the Holy Prophet Mohammed (S.A.W).\nChairman Northern Governors Forum (NGF) and Plateau state Governor Simon Lalong gave the charge in a message in a statement by his director of press, Dr Makut Macham.\nThe NGF said: “The special occasion brings to remembrance the teachings of the Holy Prophet who emphasized love, forgiveness, peaceful coexistence and humility among others.\nMMWGAlso, the Muslim Media Watch Group of Nigeria (MMWG) tasked Nigeria leaders to do things right all times for the nation’s prosperity.\n“The PDP felicitates with Nigerians and wishes them a happy Eid-el Maulud celebration,” the party said."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "Gov.Bello, Emir of Biu, Sanusi, others receive ‘Peace Achievers Awards’ -NigPilot",
    "summarized_story": "Governor of Kogi State, Yahaya Bello , Emir of Biu in Borno State, Mai Mustapha Umar Mustapha II and others, have received the 2021 Peace Achievers International Awards.\nThe award ceremony of the 10th edition of the annual award and peace summit was held at Nigerian Air Force Conference Centre in Abuja.\nof Kogi state bagged the ‘Governor of the Year on Peace and Security Award, while that of Akwa-Ibom clinched the award of ‘The Best Performing Governor: Industrialization and Peace Building.\n“The Peace Achievers International Awards is a private initiative of peace Ambassador Agency to recognize individuals and organisations in Africa who have demonstrated strong commitment in serving their communities.\nThe 10th edition of the Peace Achievers International Awards is supported through partnerships with the University of Benin,Cotonou, Chartered Institute of Management and leadership and the American Heritage University Southern California, USA."
  },
  {
    "headline": "NCPWD, Stakeholders begin development of curriculum, inclusive education -NigPilotNCPWD, Stakeholders begin development of curriculum, inclusive education",
    "summarized_story": "In a bid to eliminate discrimination against Persons with Disabilities, PWDs, The National Commission for Persons with Disabilities, NCPWD, has said it is working closely with the Ministry of Education, and other relevant Agencies to develop curriculum on disability and inclusive development.\nAcknowledging the huge task before the Commission, Lalu stressed,” How can we bring back out of school children with disabilities to school?\nWe have about 3.1million out of school children with disabilities that do not want to go to school.\nWhile speaking on the effort made so far, Lalu said NCPWD is working with the Education Ministry to ensure that every federal school is open for free education for PWDs.\nAlso, the National President, Association of the blind, Ishika Adamu said the curriculum will help close the gap in accessing Tertiary education for PWDs."
  },
  {
    "headline": "NYSC DG bags Sun award for Public Service -NigPilot",
    "summarized_story": "In a short video aired before the Award presentation, Management of the SUN Newspapers said General Ibrahim was considered for the award because of the unprecedented changes he has brought to the National Youth Service Corps as the 18th Chief Executive of the organisation.\nHis collaboration with several agencies and financial institutions that seek to empower members of the corps were also presented as attributes that make B rigadier General Ibrahim an exceptional leader deserving of the award.\nTwenty individuals were given awards for Public Service, Philanthropy, Business and Technology at the well-attended ceremony.\nBrigadier General Shuaibu was accompanied by his wife, Mrs Martina Ibrahim and some Directors to accept the Award at the 18th Sun Awards 2020.\nAnother winner in the same category was the Chairman of the National Drug Law Enforcement Agency (NDLEA), Brigadier General Buba Marwa rtd."
  },
  {
    "headline": "Nigeria to host 4th International Conference on Safe school -NigPilot",
    "summarized_story": "The Federal Government through the Federal Ministry of Education has disclosed its readiness to host the Fourth International Conference on Safe School Declaration.\nThe Minister of Education, Malam Adamu Adamu who made this disclosure in Abuja on Monday said the Conference seeks to galvanize action to protect education from attack.\nNigerian Pilot gathered that the Fourth International Conference on the Safe Schools Declaration will behosted by Nigeria, Argentina, Norway, Spain, the African Union Commission, and GCPEA from 25th to 27th October 2021, in Abuja.\nThe Declaration was drafted through a consultative process led by Norway andArgentina and was opened for endorsement at an international conference held inOslo, Norway, in May 2015.\nThe theme of the conference according to the Minister, is “Ensuring Safe Education for All: From Commitment to Practice”."
  },
  {
    "headline": "VIDEO: Police Fire Tear Gas To Disperse Youths At Lekki Tollgate",
    "summarized_story": "﻿The police on Wednesday fired a tear gas canister at the Lekki tollgate where celebrities and youths held a memorial car procession in Lagos State.\nScores of youths, including celebrities were participating in the parade amid the presence of armed security operatives before they were dispersed.\nOne of them was picked up by armed security operatives while he was having a chat with reporters.\nRather, he stated that the security operatives fired tear gas to disperse those he described as miscreants at the venue.\nRather, he stated that the security operatives fired tear gas to disperse those he described as miscreants at the venue."
  },
  {
    "headline": "#EndSARS Anniversary: Celebrities, Youths Hold Memorial Procession At Lekki Tollgate",
    "summarized_story": "﻿Celebrities and youths on Wednesday held a memorial car procession at the Lekki tollgate in Lagos State.\nWhile the parade was in progress, officials of the Lagos Neighbourhood Safety Corps (LNSC) passed vehicles to ensure a free flow of traffic.\nAs the event continued, the number of youths at the venue grew while others came down from their cars, chanting solidarity songs.\nThis led to the decision of the youths to organise a memorial procession rather than a protest, although they maintained the call for an end to police brutality.\nWe know their way, so a procession of cars is the safest option to minimize police harassment."
  },
  {
    "headline": "#EndSARS Anniversary: Two Persons Arrested As Memorial Procession Holds At Lekki Tollgate",
    "summarized_story": "Two persons have been arrested during a car procession ongoing at the Lekki tollgate in Lagos State.\nThe police arrested the two men on Wednesday morning amid the parade organised to mark the one-year anniversary of the #EndSARS protests.\nWhile the police are stationed at the tollgate for security purposes, officials of the Lagos Neighbourhood Safety Corps (LNSC) are maintaining a free flow of traffic.\nOne of the protesters was arrested while talking to reporters who were at the tollgate to cover the procession.\nWe know their way, so a procession of cars is the safest option to minimize police harassment."
  },
  {
    "headline": "UPDATED: At Least Two Killed As Gunmen Open Fire At Traditional Rulers Meeting In Imo",
    "summarized_story": "No fewer than two traditional rulers have been killed during an attack by gunmen at Nnenasa community Headquarters of Njaba local government area of Imo State.\nAccording to sources, the traditional rulers from the area numbering over 20 were in a meeting at the local government headquarters in the community when gunmen invaded the the place and interrupted the meeting with sporadic gunshots.\nSources earlier informed Channels Television that five of the traditional rulers had been killed but when contacted, the Imo state police public relations officer, Mike Abatam, confirmed that only two traditional rulers had died while three others were in a coma.\nREAD ALSO: Go After Criminal Elements In Imo State, Uzodinma Charges TroopsThe murdered traditional rulers include the Obi II of Okwudor, Eze Anayo Durueburoe and the ruler of Ihebineoweri, Okwudor, Eze Samson Osunwa.\nImo State Governor Hope Uzodinma, speaking to Channels Television, condemned the killings and commiserated with the affected families."
  },
  {
    "headline": "US Supreme Court Rejects Attempt To Block Vaccine Rule",
    "summarized_story": "A US Supreme Court justice on Tuesday rejected a request by health workers in Maine to block a statewide vaccine mandate, while their wider legal challenge against the measure proceeds.\nAll healthcare workers in the state will have to be fully vaccinated under the mandate, which comes into force on October 29.\nSeveral unnamed health workers and one health provider insist the decree violates their constitutional right to freedom of religion, citing conscientious objections to the vaccine.\nOn Tuesday, Justice Stephen Breyer — who responds to emergency applications from Maine — denied their petition for a preliminary injunction, which had already been rejected by a district court.\nLast week, the Federal District Court in Maine ruled that the requirement did not violate the workers’ First Amendment right to freedom of religion."
  },
  {
    "headline": "2020 Flooding: FG distributes farm inputs to 7,146 farmers in Zamfara -",
    "summarized_story": "Seven thousand, one hundred and fifty-six farmers in Zamfara State will benefit from the Federal Government’s Emergency Agricultural Intervention FundThe programme is to assist farmers affected by last year’s flood disaster in Zamfara State.\nHe enjoined the beneficiaries to make judicious use if the items.\nCommissioner for Humanitarian Affairs and Disaster Management, Faika Ahmed, who received the items on behalf pf Zamfara State government, commended President Muhammadu Buhari for the show of love especially to farmers in Zamfara state.\nFa’ika Ahmed- assured that the relief items will get to the selected farmers.\nShe added that the ministry has set up a Committee to assist in sharing the items especially to beneficiaries in troubled areas."
  },
  {
    "headline": "We'll fish out those behind killing of traditional rulers in Imo",
    "summarized_story": "Imo State Governor Hope Uzodinma said efforts are being made to fish out those behind the killing of traditional rulers at Njaba Local government headquarters on Tuesday.\nSpeaking to State house correspondents in government house Owerri, Uzodinma said security operatives have been dispatched to fish out those behind the carnage.\nCommiserating with the families of the traditional rulers who lost their lives, the governor promised his administration’s determination to fight banditry.\nTwo traditional rulers were killed while others sustained different degrees of injury when yet to be identified Gunmen invaded the council headquarters at Nnenasa where the monarchs where having a meeting and opened fire on them."
  },
  {
    "headline": "Endsars protest: Oyo Police promise decisive sanctions against perpetrators of violence",
    "summarized_story": "The Oyo state police command has promised strict sanctions against anyone caught involving in violent acts under the guise of celebrating the one year anniversary of last year’s EndSARS protest.\nThe Commissioner of Police, Ngozi Onadeko who made this known through a statement released by the state Police Public Relations Officer Wale Osifeso appealed to any architect of such plans to have a rethink or face the wrath of the law.\n“The Oyo State Police Command through intelligence availed to it has unraveled clandestine plans by groups of misguided people embark on large scale violent protests in parts of the State in commemoration of one year anniversary of the unfortunate October ENDSARS saga.\nShe added that extensive visibility and aggressive patrols by Area commanders and Divisional Police Officers has also been directed.\nThe CP urged Parents, guardians to warn their wards against been used by merchants of anarchy, calling on residents to go about their lawful businesses ."
  },
  {
    "headline": "PHOTOS: Afenifere leaders visit Tinubu in Lagos",
    "summarized_story": "Leaders of the Pan-Yoruba cultural group, Afenifere, on Tuesday visited the leader of the All Progressives Congress and former governor of Lagos State, Asiwaju Bola Ahmed Tinubu in his Bourdillion, Ikoyi, Lagos home.\nAccording a statement by Senator Tinubu’s media office, the visit was to express good wishes to him after his recent return form the United Kingdom."
  },
  {
    "headline": "#EndSARS Memorial: ‘Uber Driver’ Brutalised at Lekki Toll Gate (Watch)",
    "summarized_story": ""
  },
  {
    "headline": "The Fight Against Tropical Diseases in Gombe State",
    "summarized_story": "More than 3 Million people across the eleven local government areas of Gombe State are benefiting from health services being provided by a non governmental organisation.\nAs ARISE News Correspondent, Awwal Ibrahim reports, majority of the beneficiaries are suffering from some neglected tropical diseases.\nExperts say there are a number of neglected tropical diseases across each of the 774 local government areas in Nigeria.\nBut at this event, health officials in Gombe State are saying the most prevalent tropical diseases are Onchocerciasis, Lymphatic Filariasis, Schistosomiasis and Trachoma TT.\nThe Northeast Coordinator of Neglected Tropical Diseases from the Federal Ministry of Health says efforts are in top gear to address the prevalence of the identified tropical diseases."
  },
  {
    "headline": "Afrobeat Star Falz on Why He’s at the Lekki Tolllgate for #EndSARS Memorial",
    "summarized_story": ""
  },
  {
    "headline": "#EndSARS: Early Morning Arrest at Lekki Tollgate (Watch)",
    "summarized_story": ""
  },
  {
    "headline": "Nigerian Military Decimates Bandits in Kaduna with Helicopter Gunships",
    "summarized_story": "The Nigerian military, on Tuesday, pounded bandits in Kaduna forests with helicopter gunships, neutralising 50 and destroying many of their hideouts.\nKaduna State Governor Nasir El-Rufai hailed the renewed onslaught against banditry and kidnapping in the state.\nEl-Rufai appealed to the security forces to sustain the momentum and bring more bandits to their “bitter end”.\nFleeing bandits within the surrounding forests were followed up and engaged by ground forces.\n“In maintaining presence for an effective annihilation of the bandits, a second helicopter gunship came overhead the location in dogged support of the ground forces."
  }
]