[
  {
    "headline": "BREAKING: WAEC releases 2021 GCE results",
    "summarized_story": "The West African Examination Council has released the results of the 2021 second series West African Senior School Certificate Examination for private candidates.\nSpeaking on Monday at WAEC Lagos office, Head of the National Office, Patrick Areghan, said the examination was conducted at the same time throughout the five-member countries, including Nigeria.\nHe said, “A total of 52, 973 candidates registered ft the examination.\nThe conduct of the examination took place from Friday, November 12, 2021 to Wednesday, December 22, 2021.”Details later…Copyright PUNCH.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Anambra celebrates as Chidume clinches National Order of Merit award",
    "summarized_story": "The Anambra State Government has expressed delight at the award of the Nigerian National Order of Merit, the country’s highest honour for intellectual and artistic achievement, vested on Charles Ejike Chidume.\nChidume was honoured at the State House, Abuja on February 8, 2022.\nAn internationally recognised mathematics professor, Chidume beat over 1,200 contestants to clinch the honour last week.\nOther honourees include medical scientist, Oluyinka Olutoye, and 2021 awardee for science, Prof. Godwin O. Ekhaguere.\nChidume, an indigene of Nimo in Njikoka Local Government Area of Anambra State, waa trained at the University of Nigeria, Nsukka and Queen’s University in Canada as well as the Ohio State University in the United States."
  },
  {
    "headline": "Abia 2023: CSOs vow to mobilise against parties truncating zoning arrangement",
    "summarized_story": "The CSOs argued that since power rotated from Abia North in 1999, and had gone round all three zones, “equity and justice demand that power should return to Abia North in 2023”.\nThe CSOs raised alarm over plots by some power hawks to truncate the zoning arrangement, warning of the consequences of such self-centered move.\nThis, we wish to state as a coalition, does not present Abia government and her people a win-win situation.\n“Those who today want to truncate the already existing peaceful political landscape in Abia are no wiser than the founding fathers.\n“We wish to sound this as a warning to all aspirants outside of Abia North to shelve their plans and allow governorship of the state to come to the deserving Zone which in all fairness is Abia North."
  },
  {
    "headline": "BREAKING: NDLEA declares Abba Kyari wanted, says he leads cartel of drug barons operating Brazil, Singapore",
    "summarized_story": "National Drug Law Enforcement Agency, NDLEA has declared suspended DCP, Abba Kyari wanted for being one of the leaders of a Cartel of Drug Barons operating the Brazil, Singapore network.\nSeveral instances of his intervention to free arrested Cocaine and Heroine suspects with US dollars and compromise seized hard drugs among NDLEA operativesDetails Later.."
  },
  {
    "headline": "Bury your ego for APC interest, Osun Senator urges party warring factions",
    "summarized_story": "Shina Abubakar – OsogboSenator representing Osun West Senatorial District, Engr.\nAdelere Oriolowo, on Monday, enjoined members of the All Progressives Congress in Osun State to bury their ego with a view to ensuring the party’s success in the July 2022 governoshirp election in the state.\nAccording to the Senator, “I wish to call on aggrieved members to keep confidence with the party, while I explore all peaceful means for amicable solution.\nSpeaking on whether he belong to a particular group within the party, Oriolowo said, he is a party man to the core and doesnt believe in group.\nAs for whether am for Ileri Oluwa or TOP, am for both since APC is one in Osun”, he added."
  },
  {
    "headline": "OPS raises N100b to tackle insecurity",
    "summarized_story": "Emma Ujah, Abuja Bureau ChiefThe coalition of top operators of the nation’s organised private sector has raised N100 billion with which to assist security agencies in tackling the persistent insecurity across the country.\nHis words, “It was during COVID that some Nigerians were able to know what the private sector could do under the Governor.\n“I think the most important thing was the move we made to open up the Nigerian economy once more.\nWe have just put N100bn together, private sector again, under this coalition to help fight insecurity or to support our security agencies, to be able to deal with the issues we are having in the country on security.\n“This objective was driven by some of the key challenges facing the Nigerian economy,"
  },
  {
    "headline": "Succession: Akwa Ibom PDP not divided — Gov Emmanuel",
    "summarized_story": "Governor Udom EmmanuelBy Chioma Onuegbu – UyoGovernor Udom Emmanuel of Akwa Ibom State has said there is no division in the state chapter of the Peoples Democratic Party, PDP, over the choice of Mr Umo Eno as his preferred successor.\nEmmanuel spoke while fielding questions from newsmen, weekend, during the 10th Series of ‘ThegovernorSpeaks’ programme aired live on state-owned and private radio stations in the state.\nHe said he would not be distracted by insinuations on the social media, stressing that he would rather remain focused on his completion agenda.\nHe reiterated his warning against using violence to grab power, saying he would vote for peace and not violence during the party primaries and the general elections.\nHe said: “As a leader, I am entitled to only one vote during the party primaries and the general elections."
  },
  {
    "headline": "BREAKING: NDLEA declares Abba Kyari wanted over alleged link to drug cartel",
    "summarized_story": "The National Drug Law Enforcement Agency, NDLEA, has declared suspended Deputy Commissioner of Police, Abba Kyari, wanted.\nNDLEA’s spokesman, Femi Babafemi, declared Kyari wanted for alleged links with an international drug cartel.\nKyari was suspended over his alleged involvement with an international fraudster, Ramon Abass, popularly known as Hushpuppi.\nThe former Intelligence Response Team, IRT, boss was alleged to have benefitted from a heist carried out by Hushpuppi and his gang in Dubai.\nBabafemi disclosed that NDLEA has evidence linking Kyari to a drug cartel that operates the Brazil-Ethiopia-Nigeria illicit drug pipeline."
  },
  {
    "headline": "Embrace unity, peace for Nigeria’s survival – Group urges youths",
    "summarized_story": "The Coalition of Northern Groups (CNG) has appealed to Nigerian youths to ensure unity and love grow among them for the overall interest and future of the country.\nThe group advised the youths to shun money politics for national development.\nHe explained that there was the need to educate the youths on the substance of politics for future leaders to learn how to tackle the challenges bedevilling the country.\n“The money politics system is terrible and that is why we are here.\nHe explained that they are trying to eradicate the leadership of moneybags by avoiding money politics at this level."
  },
  {
    "headline": "Insecurity: Northern elders lament incessant killings",
    "summarized_story": "The Director, Publicity and Advocacy of the Northern Elders Forum (NEF’s), Dr Hakeem Baba-Ahmed, has lamented the insecurity in the northwest region of Nigeria, describing it as becoming uncontrollable.\nIn a press statement signed and issued to newsmen in Gusau, the state capital, Baba-Ahmed said that in spite of the government’s efforts to curtail insecurity, the situation in the region is deteriorating, saying that the northern youths are not impressed with the authorities’ response.\n“Our villages in the northwest zone are being emptied.\nThousands of people, due to constant attacks, have relocated to the urban cities and the relations in big towns now cater for displaced villagers, deepening poverty, he said.\nHe insisted that Nigeria has become a safe haven for different terrorist groups, downplaying the description of criminal elements in the region as bandits."
  },
  {
    "headline": "Akwa Ibom: Why ‘witches, wizards dragged me to court’ – Gov Udom Emmanuel",
    "summarized_story": "The Governor of Akwa Ibom State, Emmanuel Udom, has disclosed how he was dragged to court by ‘witches and wizards’ in the state.\nEmmanuel disclosed that witches and wizards dragged him to court for building a Christian worship centre in the state.\nThe case is in the court, we won them but they have appealed,” the governor said.\nResidents of the state have criticized the building of the structure, stressing that the money should have been used for other development needs of the oil-rich state.\nEmmanuel also commented on allegedly picking a pastor and his cabinet members as his preferred successor ahead of the 2023 governorship election."
  },
  {
    "headline": "ASUU vows to sanction FUTO, declares Pantami’s professorship illegal",
    "summarized_story": "The Academic Staff Union of Universities, ASUU, says it has concluded plans to sanction its members in the Federal University of Technology Owerri, FUTO, and the university’s Vice-Chancellor over the “illegal” promotion of the Minister of Communications and Digital Economy, Dr Isa Ali Pantami.\nAccording to ASUU, it is impossible to be a minister and a lecturer at the same time, describing the promotion as encouragement of illegality.\nThe union gave Pantami the option of quitting his job as a minister, saying he is currently not qualified to be treated as a professor.\n“Pantami has to quit as a minister and be tried for doing double jobs within the same federal system.\n“We have resolved to sanction ASUU members involved in his promotion and the VC of FUTO.”"
  },
  {
    "headline": "BREAKING: NDLEA declares suspended DCP Abba Kyari wanted",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has declared the suspended head of the Intelligence Response Team, IRT, DCP Abba Kyari wanted for alleged drug trafficking.\nThe NDLEA said investigation has revealed that Kyari is a member of drug syndicate which operates across the globe.\nSpokesperson of the agency said this in a news briefing on Monday.\nDetails Shortly…"
  },
  {
    "headline": "BREAKING: ASUU declares one-month ‘total’ strike",
    "summarized_story": "By Alao Abiodun and Damola Kola-DareThe Academic Staff Union of Universities (ASUU) has announced a four-week “comprehensive and total” strike.\nThe strike will take effect from February 14, 2022.\nASUU National President Prof Emmanuel Osodeke announced the development to journalists on Monday in Lagos after the National Executive Council(NEC) meeting of the union tagged ‘NEC for NEC.’- Advertisement -The Nation reports ASUU NEC members, including leaders across campuses held marathon meetings over the weekend.\nThe union’s demands include funding for revitalisation of public universities, earned academic allowances, University Transparency Accountability SolutionOthers are: renegotiation of 2009 ASUU-FGN Agreement, and the inconsistencies in Integrated Payroll and Personnel Information System Payment.\nDetails shortly…"
  },
  {
    "headline": "PHOTOS: ASUU meets to announce decision on proposed strike",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "ASUU keeps students, govt in suspense",
    "summarized_story": "By Kofoworola Belo-Osagie, Lagos and Frank Ikpefan, AbujaThe Federal Government, parents and students were being kept in suspense last night by the Academic Staff Union of Universities (ASUU).\nEducation Minister Adamu Adamu could not be reached last night for comments on efforts being made by the government to avert another strike by ASUU.\nI have had interactions with the education minister (Adamu Adamu).\n“They are doing Education ministry meeting tomorrow.\nThe ministry will invite ASUU leadership either Wednesday or Thursday to the education ministry."
  },
  {
    "headline": "Death toll in Lagos collapsed building now five",
    "summarized_story": "Death toll in Lagos collapsed building now fiveTwo more bodies were yesterday recovered from the three-storey building that collapsed on Saturday in Yaba area of Lagos, bringing the casualty figure to five.\nMr Ibrahim Farinloye, Zonal Coordinator Southwest, National Emergency Management Agency (NEMA), confirmed the development, saying that one of the two bodies was that of a student on industiral training.\nFarinloye said that one of the survivors, a teenager, escaped by sheer luck after he complained of hunger, adding that the building collapsed a few minutes after the teenager left to buy food.\nThe NEMA Zonal Coordinator added that residents of the area mobilised resources to rescue the only survivor from the rubble.\n- Advertisement -He said that rescue and recovery operation was carried out by NEMA, Lagos State Emergency Management Agency, the fire service and the police."
  },
  {
    "headline": "BREAKING: NDLEA declares Abba Kyari wanted over membership of International drug cartel",
    "summarized_story": "From Godwin Tsa, AbujaThe National Drug Law Enforcement Agency (NDLEA) has declared the suspended head of the Intelligence Response Team (IRT), Abba Kyari wanted for belonging to an international drug cartel.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nKyari, a deputy commissioner of police who has refused to honour the invitation by the NDLEA was equally wanted for pushing illicit drugs.\nNigerians can now work and earn dollars DAILY from home.\nRegular individuals can earn as low as $300 daily Find out how it works."
  },
  {
    "headline": "ASUU declares one month nationwide strike",
    "summarized_story": "By Gabriel DikeThe Academic Staff Union of Universities (ASUU) has declared one month strike in public universities in the country.\nThe decision was taken at a two-day National Executive Council (NEC) meeting held at the University of Lagos (UNILAG).\nNigerians can now work and earn dollars DAILY from home.\nRegular individuals can earn as low as $300 daily Find out how it works.\nThe National President of ASUU, Prof. Emmanuel Osodeke, is about addressing the press on the reason for the one month."
  },
  {
    "headline": "Anxiety as ASUU prepares for full-scale strike",
    "summarized_story": "Some students and parents, who spoke to Daily Sun, expressed fears about what might be the outcome of the ASUU NEC meeting.\nI have spent extra years in school due to incessant ASUU strike, in addition to COVID-19 that disrupted our academic calendar in 2020.\nHe appealed to ASUU NEC not to consider the option of strike as it would have more devastating effect on students who would suffer delayed and disrupted academic programmes.\nHis mother, Mrs. Ngozi Ugwu, pleaded with ASUU to adopt other tactics in dealing with the government without dragging students and parents down with a strike.\nUniversity students and parents in Port Harcourt, Rivers State, have, however, begged ASUU not to embark on its planned strike."
  },
  {
    "headline": "Fresh crisis looms in APC over convention",
    "summarized_story": "From Romanus Ugwu, AbujaThere were fears, yesterday, that fresh crisis may rock the All Progressives Congress (APC) over alleged plans by some members of the Progressive Governors Forum (PGF) to impose a Senator as national chairman of the party on members.\nA group, APC Youth Development and Solidarity Forum, who made the allegation, warned that the party may implode if such imposition takes place.\n“Nigerians would be deprived of having an APC presidential candidate that passed the rigours of primary election.\nSenator Sani Musa would, in turn, deliver Bagudu as APC presidential flag-bearer and Kayode Fayemi as his running mate.\nWe shall continue to work with you for the development of our beloved party, APC, and country, Nigeria,” the Forum noted."
  },
  {
    "headline": "Gloom over Nigeria’s inflows as foreign participation drops by 22%",
    "summarized_story": "Despite recent improvements in Nigeria’s macroeconomic fundamentals, uncertainty still pervades the country’s ability to attract foreign direct investments with concerns over rising insecurity ahead of the 2023 general elections.\nThe report further revealed that domestic participation grew to about 78 per cent while foreign participation fell by 22 per cent.\nAlso, foreign inflows dropped significantly by N15.46 billion, however, domestic inflows grew by N64.23 billion.\n“As at 31 December 2021, total transactions at the nation’s bourse decreased by 19.31 per cent from N196.14 billion (about $472.54 million) in November 2021 to N158.26 billion (about $363.81 million) in December 2021.\nThe performance of the current month when compared to the performance in December 2020 (N269.24 billion) revealed that total transactions decreased by 41.22 per cent."
  },
  {
    "headline": "NDLEA Declares Suspended DCP Abba Kyari Wanted over Drug Links",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "ASUU Begins Four Weeks Strike",
    "summarized_story": "The Academic Staff Union of Universities (ASUU), Monday, said it was embarking on a four-week strike following the failure of the federal government to fully implement the Memorandum of Understanding (MoU) and the Memorandum of Action ( MoA).\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Lai Mohammed Berates Canada’s Double Standard over Protest",
    "summarized_story": "Olawale Ajimotokan in AbujaThe federal government has condemned Canada for repressing truckers who were protesting over COVID-19 mandates and other restrictions in the country as insurrectionists.\nMinister of Information and Culture, Alhaji Lai Mohammed, yesterday, said the action of the Canadian government amounted to double standard.\nSimilarly, he recalled that Twitter, which allegedly funded #EndSARS protesters and even helped them to raise fund, had also blocked the truckers’ account.\n“These are the same entities that are now rushing to distance themselves from the protesters in Canada and even denying them the use of their platforms,” Mohammed stated.\nHe said the country’s destruction would not be allowed under the guise of protest or unbridled freedoms."
  },
  {
    "headline": "Emefiele Targets 10% Increase in Agriculture Funding by 2024",
    "summarized_story": "Emefiele said following the intervention programmes embarked upon by the central bank since his assumption of office, the initiatives have helped farmers to significantly improve their yields and contributed significantly towards Nigeria’s journey towards food self-sufficiency.\n“Our dependence on earnings for crude oil fueled an excessive dependence on imports, which came at the expense of constraining growth in critical sectors of our economy such as agriculture and manufacturing.\nAccording to him, in contrast, credit to the manufacturing and agricultural sectors stood at 10 per cent and three per cent respectively.\n“As we all work together in supporting these critical sectors, it would mean more jobs and greater economic growth in our Communities.\n“It also ensures that not only do we continue to grow our economy, but that growth is broad based and inclusive."
  },
  {
    "headline": "FG Commences Work on 21 Roads Earmarked for NNPC’s N621bn Funds",
    "summarized_story": "The NNPC is financing the programme through the Road Infrastructure Tax Credit Scheme in collaboration with the federal ministry of works and housing and the Federal Inland Revenue Service (FIRS).\nIt also noted that with many of the construction companies just resuming from the yuletide break, work had resumed on the sites, with earth works progressing.\nHe disclosed that the inspection team was among others reasons, on site to prevail on the contractors to accelerate work to ensure early completion and delivery of the roads.\nEsan said the ministry would carry out the appropriate tests to determine the quality and the durability of the construction work to ensure compliance with acceptable standard.\nHe pleaded with road users, especially truck drivers to be patient with the government and construction workers as they ply the roads while construction work is going on."
  },
  {
    "headline": "BREAKING: Nigerian Anti-drug Agency, NDLEA Declares Suspended Police Chief, Kyari Wanted For Drug Trafficking",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has declared the suspended head of the Police Intelligence Response Team (IRT), DCP Abba Kyari, wanted over suspected links with an international drug cartel.\nThis was made known by the spokesperson for the NDLEA, Femi Babafemi, during a press briefing held at the agency's headquarters.\nThe NDLEA said an investigation has revealed that Kyari is a member of a drug syndicate which operates across the globe.\nThe shocking revelation comes amid the police chief's controversial involvement with self-confessed Internet fraudster, Ramon Abbas, popularly known as Hushpuppi.\nThe United States Attorney’s Office, Central District of California, had issued an arrest warrant against Kyari."
  },
  {
    "headline": "BREAKING: Nigerian Anti-drug Agency, NDLEA Declares Suspended Police Chief, Kyari Wanted For Drug Trafficking",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has declared the suspended head of the Police Intelligence Response Team (IRT), DCP Abba Kyari, wanted over suspected links with an international drug cartel.\nThis was made known by the spokesperson for the NDLEA, Femi Babafemi, during a press briefing held at the agency's headquarters.\nThe NDLEA said an investigation has revealed that Kyari is a member of a drug syndicate which operates across the globe.\nThe shocking revelation comes amid the police chief's controversial involvement with self-confessed Internet fraudster, Ramon Abbas, popularly known as Hushpuppi.\nThe United States Attorney’s Office, Central District of California, had issued an arrest warrant against Kyari."
  },
  {
    "headline": "Corruption-riddled Governor Of Nigeria's Central Bank, Godwin Emefiele To Use CBN's Funds To Finance Presidential Ambition",
    "summarized_story": "There are plans by Godwin Emefiele, governor of the Central Bank of Nigeria, to use funds from the apex bank to fund his presidential ambition, SaharaReporters gathered.\nAccording to sources, Emefiele's presidential ambition will be funded from the CBN intervention funds; Bank of Agriculture; Nirsal Microfinance Bank among others.\nPresident Buhari had on Tuesday, January 18, 2022, unveiled the rice pyramid in Abuja, in the presence of some governors and other dignitaries.\n“The cabal led by AGF, Malami told Buhari they’ve settled for a Technocrat.\nIsa Funtua was a close ally of President Buhari, who served as a minister in the Second Republic."
  },
  {
    "headline": "Corruption-riddled Governor Of Nigeria's Central Bank, Godwin Emefiele To Use CBN's Funds To Finance Presidential Ambition",
    "summarized_story": "There are plans by Godwin Emefiele, governor of the Central Bank of Nigeria, to use funds from the apex bank to fund his presidential ambition, SaharaReporters gathered.\nAccording to sources, Emefiele's presidential ambition will be funded from the CBN intervention funds; Bank of Agriculture; Nirsal Microfinance Bank among others.\nPresident Buhari had on Tuesday, January 18, 2022, unveiled the rice pyramid in Abuja, in the presence of some governors and other dignitaries.\n“The cabal led by AGF, Malami told Buhari they’ve settled for a Technocrat.\nIsa Funtua was a close ally of President Buhari, who served as a minister in the Second Republic."
  },
  {
    "headline": "Terrorist Sympathiser, Isa Pantami’s Professorship Is Illegal — Lecturers’ Union, ASUU, Vows To Sanction VC Of Awarding University",
    "summarized_story": "The Academic Staff Union of Universities has described as illegal, the promotion of the Minister of Communications and Digital Economy, Dr Isa Ali Pantami, to professor at the Federal University of Technology, Owerri (FUTO).\nThe union, on Monday, declared the promotion as illegal at a press conference addressed by the President of ASUU, Prof. Emmanuel Osodeke.\nIsa PantamiHe said, “You cannot be a minister and a lecturer in a university.\n“Pantami has to quit as a minister and be tried for doing double jobs within the same federal system.\nWhile addressing a conference at the time, the president of the lecturers’ union, Osodeke, said; “ASUU NEC members, like many other concerned Nigerians, did not accept the report of the ASUU FUTO congress."
  },
  {
    "headline": "'Pantami's professorship illegal' -- ASUU vows to sanction FUTO VC",
    "summarized_story": "Pantami’s promotion had elicited intense debate, with many scholars and activists faulting the rationale behind his professorship.\n“From information made available to us, Dr Pantami was not qualified and he violated the established procedure for appointment of professor.\nPantami should not be treated as a professor.”ASUU also said it would sanction its members involved in Pantami’s promotion including FUTO’s vice-chancellor.\n“We have resolved to sanction ASUU members involved in his promotion and the VC of FUTO,” he added.\nAdvertisementIn November last year, a probe panel set up by ASUU had said due process was followed by FUTO in the appointment of Pantami as a professor of cybersecurity."
  },
  {
    "headline": "'Pantami's professorship illegal' -- ASUU vows to sanction FUTO VC",
    "summarized_story": "Pantami’s promotion had elicited intense debate, with many scholars and activists faulting the rationale behind his professorship.\n“From information made available to us, Dr Pantami was not qualified and he violated the established procedure for appointment of professor.\nPantami should not be treated as a professor.”ASUU also said it would sanction its members involved in Pantami’s promotion including FUTO’s vice-chancellor.\n“We have resolved to sanction ASUU members involved in his promotion and the VC of FUTO,” he added.\nAdvertisementIn November last year, a probe panel set up by ASUU had said due process was followed by FUTO in the appointment of Pantami as a professor of cybersecurity."
  },
  {
    "headline": "NDLEA declares DCP Abba Kyari wanted over 'links with international drug cartel'",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has declared Abba Kyari, suspended deputy commissioner of police, wanted over alleged links with an international drug cartel.\nFemi Babafemi, spokesperson of the NDLEA, announced the development, in a press briefing on Monday.\nBabafemi said the anti-drug agency decided to declare Kyari wanted because he did not honour the invitation sent to him.\nMore to follow…"
  },
  {
    "headline": "NDLEA declares DCP Abba Kyari wanted over 'links with international drug cartel'",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has declared Abba Kyari, suspended deputy commissioner of police, wanted over alleged links with an international drug cartel.\nFemi Babafemi, spokesperson of the NDLEA, announced the development, in a press briefing on Monday.\nBabafemi said the anti-drug agency decided to declare Kyari wanted because he did not honour the invitation sent to him.\nMore to follow…"
  },
  {
    "headline": "Finally, ASUU declares nationwide strike",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has officially declared a nationwide strike.\nAdvertisementEmmanuel Victor Osodeke, the national president of ASUU, broke the news during a press conference on Monday following a two-day deliberation of the union’s national executive council (NEC).\nOsodeke added that the nationwide strike is for four weeks and should be “comprehensive and total”.\n“The NEC of our union has resolved to embark on a four-week total and comprehensive strike beginning from February 14,” he said.\nAdvertisement“That’s the resolution of latest NEC meeting held on February 12 and 13."
  },
  {
    "headline": "Stitch raises $21m to build a pan-African payment powerhouse",
    "summarized_story": "Stitch, a South African API fintech company, announced today that it has closed a $21 million Series A funding round, led by The Spruce House Partnership.\nStitch offers data and payments solutions that reduce the effort required for businesses to connect to their users’ financial accounts and enable bank-to-bank payments without leaving the existing app interface.\nSo, it’s very important to build a connecting trail between these products, and that’s where fintech products like Mono, Okra, and Stitch has plugged themselves.\nIt’s already operating in 2 out of Africa’s 4 largest fintech markets—South Africa and Nigeria.\n“Stitch is building critical infrastructure to enable faster, easier, and more secure payments across Africa,” said Ashish Aggarwal, Director at PayPal Ventures."
  },
  {
    "headline": "11 African startups to watch out for in 2022",
    "summarized_story": "So, out of hundreds of excellent startups in Africa, we have curated 11 that we think you, our readers, should watch closely as we expect them to do some incredible stuff this year.\nAbout 20 startups are currently listed on its platform and over $400,000 has been invested on the platform.\nThe startup creates a reliable portal to guide African students in their tertiary education, course selection, and career decisions.\nThe startup handles everything it takes for a business to launch in a new African country.\nWe think this startup is building a game-changing product; something that will have a significant impact on the growth of African startups."
  },
  {
    "headline": "Zach George: From Wall Street to investing in African startups",
    "summarized_story": "DA: What was it like leaving Wall Street to invest in African startups?\nIn investment banking you’re investing in listed companies while in venture capital you’re dealing with unlisted companies.\nIt’s important to note that the advisors don’t work for us, they work for our portfolio companies.\nI’m also constantly talking to my current LPs about helping portfolio companies or new investment opportunities and to new potential LPs.\nOur current portfolio companies also always have requests related to hiring, partnering with other tech companies or expanding to different markets."
  },
  {
    "headline": "Nigerian stock exchange wants to attract tech IPOs with new listing rules",
    "summarized_story": "Nigeria has set in motion what could herald a new dawn for African tech startups as it moots the adoption of new listing rules to encourage tech companies to go public.\nOlumide Bolumole, division head of stock exchange listing activities at NXG revealed that the bourse will make sweeping changes to make listing attractive to tech companies.\nNGX consists of a holding company and three subsidiaries that cover the operations of the Nigerian Stock Exchange (NSE), its regulation, and its real estate.\nThis structure is similar to those of other international market groups such as the London, New York, and Johannesburg stock exchange groups.\nIn recent decades, Nigeria’s stock market capitalisation has fallen well below potential."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "Sendchamp is bringing versatility to customer relations with a multi-channelled message delivery platform",
    "summarized_story": "AdvertisementSendchamp is a software company on a mission to help businesses improve customer relations by reducing the technicalities involved.\nHe had to combine tools like Mailchimp, GetGist and HelpCrunch because they each only provided one mode of communication, which meant more spending on customer communication.\nIt also offers a customer relations management (CRM) platform solution that allows technical and non-technical people to manage customer relations effectively.\nSo far, it has helped businesses using its platform reach 300,000 customers and delivered three million messages.\nSendchamp wants to be a significant part of that market as Kayode believes that every business in Africa will use Sendchamp to boost customer relations."
  },
  {
    "headline": "Romance in the metaverse",
    "summarized_story": "It appears Ghanaians can now travel through 44,000 airports, using their National ID cards — Ghana Card — as an e-passport.\nNow, with the Web3 and metaverse craze gaining momentum, it appears that we most definitely haven’t seen the end of digital romance.\n😉Accessible healthcare for AfricansPhoto by Tyck via IwariaDon’t judge me; I’m not too fond of hospitals.\nIn Africa, however, access to primary healthcare is hampered by low budgeting, little staffing, and sometimes bureaucratic bottlenecks.\nChimgozirim had a chat with Njabulo Skhosana, founder of South African healthtech startup, Healthdart, to understand how it hopes to make primary healthcare accessible to Africans."
  },
  {
    "headline": "What Valentine’s Day could look like in the Metaverse and Web3 era",
    "summarized_story": "What do you do when Valentine’s Day is around the corner, and you want to get your love a gift they will appreciate, but you can’t ask them since that will ruin the surprise?\nAdvertisementHere are some ideas you could consider to have a swell Valentine’s Day while we await those days.\nGifting non-fungible tokens (NFTs)Different forms of Valentine’s Day packages have been in our faces since the year began.\nWith this, every gesture in real life is translated into your action in that virtual world, and you get to feel everything.\nDrone gift deliveryHow do you intend to spend your Valentine’s Day?"
  },
  {
    "headline": "FAQ Troubleshooting",
    "summarized_story": "Relevant discussion thread is https://wordpress.org/support/topic/234726Top ↑Why isn’t the admin user listed as an author when editing posts?\n# Why isn’t the admin user listed as an author when editing posts?\nnewadmin) with Administrator Role Login as ‘newadmin’ Degrade the old ‘admin’ user to Role of Subscriber and Save Promote the old ‘admin’ back to Administrator Role and Save Login as the old ‘admin’If that doesn’t work, try:Create a new admin user (e.g.\nnewadmin) with Administrator Role Login as ‘newadmin’ Delete the old ‘admin’ user and assign any posts to ‘newadmin’ Create ‘admin’ user with Administrator Role Login as ‘admin’ Delete ‘newadmin’ user and assign posts to ‘admin’Top ↑Why is the wrong author name displayed for a post on a blog?\nThere are various resources that will help you find more help with WordPress, in addition to these FAQ."
  },
  {
    "headline": "Businesses smile as electronic call-up breathes life into Apapa",
    "summarized_story": "The cost of transporting containers from Apapa and Tin-Can Island ports, the two main seaports in Nigeria’s commercial capital, has improved in the last year after the introduction of the electronic call-up system, and businesses are the better for it.\nThe E call-up system, targeted at managing truck traffic into the Apapa Port, has not only helped to reduce congestion within the port city but has also improved travel time for port users, motorists and residents.\n“Eto (the E call-up system) has assisted truckers in bringing down the cost of accessing the port.\nRemi Ogungbemi, chairman, Association of Maritime Truck Owners (AMATO), said though the call-up system is helping to address the traffic congestion in Apapa, it has also not performed optimally.\nAccording to Ogungbemi, trucks that normally queue from Apapa to Mushin and Palmgrove before the call-up system no longer queue like that again."
  },
  {
    "headline": "Businesses smile as electronic call-up breathes life into Apapa",
    "summarized_story": "The cost of transporting containers from Apapa and Tin-Can Island ports, the two main seaports in Nigeria’s commercial capital, has improved in the last year after the introduction of the electronic call-up system, and businesses are the better for it.\nThe E call-up system, targeted at managing truck traffic into the Apapa Port, has not only helped to reduce congestion within the port city but has also improved travel time for port users, motorists and residents.\n“Eto (the E call-up system) has assisted truckers in bringing down the cost of accessing the port.\nRemi Ogungbemi, chairman, Association of Maritime Truck Owners (AMATO), said though the call-up system is helping to address the traffic congestion in Apapa, it has also not performed optimally.\nAccording to Ogungbemi, trucks that normally queue from Apapa to Mushin and Palmgrove before the call-up system no longer queue like that again."
  },
  {
    "headline": "Obaseki harps on accountability in healthcare delivery – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has urged stakeholders in the healthcare sector to be accountable and transparent in delivering quality healthcare services to members of the public.\nWe need to talk through how we make sure that we contribute enough to sustaining our healthcare system.”The governor further noted, “As far as I am concerned, my goal is to improve the healthcare system.\nGovernment has a responsibility to provide healthcare.\nIn her remarks, Edo State Commissioner for Health, Prof. Obehi Akoria, reiterated the governor’s determination to provide quality healthcare at all levels through the Edo State Health Insurance Scheme to enable a shift from out-of-pocket spending.\nProf. Akoria noted that plans are on to make Edo a regional reference point for quality healthcare delivery and desired destination for health innovations."
  },
  {
    "headline": "Obaseki parleys Edo teachers, reviews strategies to strengthen security in schools – Nigerian Observer",
    "summarized_story": "What do we do about adult education?\nConsidering the role of adult education, should we just leave them like that?” He queried.\nOn strengthening security in schools, Obaseki stated, “It is only a good parent and teacher that will be concerned about the security of students in schools.\nOur priority as a state is education, because that’s the foundation that everything else rests on,” Obaseki noted.\n“We are working things out to make sure that we start a lot of renovations and improvements of our schools,” he assured."
  },
  {
    "headline": "Regional devt plan: Govt engages Edo South stakeholders on priority projects – Nigerian Observer",
    "summarized_story": "The team is meeting with the Enogies, Odionweres, Okhageles, Senior Special Assistants (SSAs) & (Special Assistants (SAs) from Edo South to sensitise them on the Benin City Masterplan and the Edo State Regional Development Plan.\nThe Godwin Obaseki administration is creating an exhaustive plan for the entire Edo State to meet the yearnings and aspirations of the people.\n“You need schools, you need hospitals and health centres; you need healthy spaces to operate your businesses, good markets to trade, beautiful living areas.\nThat is progress, and to achieve all that, we need to work as a team for the state to be healthy.\n“This stakeholder engagement meeting is only an introduction to the greater things ahead."
  },
  {
    "headline": "Edo Govt, First Lady Partner ANPA on Free Healthcare – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State Government, the First Lady of Edo State Her Excellency Betsy Obaseki and the Association of Nigerian Physicians in America (ANPA), are embarking on a Free Medical Mission to Edo South Senatorial District of the State.\nThe Commissioner for Health Edo State, Prof. Obehi Akoria disclosed this while she accompanied the First Lady of Edo State, Her Excellency Betsy Obaseki on an inspection tour of the Primary Healthcare Centres designated to handle the treatment.\nWhat they are going to establish is that going forward, the patients that they are going to see will be followed up remotely.\nCommenting on the ongoing plans for the Primary Healthcare Centres in the State, the Health Commissioner said “I was here at the Oredo Primary Healthcare Centre at about 8:15 this morning and there were already patients waiting.\nSo what we are trying to do right now is to make our PHCs good enough for me, my children, grand children and all Edo people.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "NDLEA declares ‘super cop’ Abba Kyari wanted over massive cocaine trafficking",
    "summarized_story": "“The saga started on Friday, January 21, 2022, when DCP Kyari initiated a call to one of the NDLEA officers in Abuja at 2:12 pm.\nHe asked the NDLEA officer to persuade men of the FCT Command, to play along as well.\nIn effect, he would be delivering $61, 400 to the NDLEA team.\n“He also brought with him the money from the sale of the 5kg share of the NDLEA team, a total of $61, 400.\n“We are making this strong statement to those contemplating harmful action against NDLEA officers."
  },
  {
    "headline": "Business Hallmark Newsletter and E-edition",
    "summarized_story": "Here are some of the stories in today’s edition of Business Hallmark Newspaper.\nClick here to download the e-edition of the newspaper.\n2022: Party Followers Rebel …as defeated aspirants plot third forceBanks, telcos, others groan over NIMC system collapseEmefiele’s big forex vision raises survival bar for banksRising costs hobble Stanbic IBTC profitBad fuel: Forces behind the scamRevealed: Details of Dangote’s dogged plot to disrupt Automobile industryBooming Housing industry excites new optimismEconomy: Nigeria battles insolvency as borrowing escalatesOn the menace of Ritual killing2023: APC/PDP rebels plot ‘Third forcePresident Buhari to veto Electoral Bill againNigerian football: The rising profile of Uchenna Christian Junior"
  },
  {
    "headline": "Nigerian football: The rising profile of Uchenna Christian Junior",
    "summarized_story": "In other words, Like Brazil and some other footballing nations, it is also one of the spiritual homes of football.\nBut it is one thing to know how to play football and it is another thing to stand out and reach for the stars in a country like Nigeria where football talents abound.\nOne young man who has been able to distinguish himself today is Uchenna Christian Junior.\nChristian, born on December 30, 2000, is a Nigerian football player who is currently playing for Omole Football Academy in Lagos.\nMany football enthusiasts have tipped him for greater heights outside the shores of Nigeria if he is given the chance."
  },
  {
    "headline": "President Buhari to veto Electoral Bill again",
    "summarized_story": "“The administration is deceitful with the issue of amending the electoral act.\nThe draft bill read in 52(1): Voting at an election under this bill shall be by open secret ballot.\n“52(2) Voting at an election under this bill shall be in accordance with the procedure determined by the commission, which may include electronic voting.\n“Because if they were, they have the power to override the president even if he refuses to sign the bill.\nIn order words, it’s not a must that Buhari will sign the bill before it becomes law."
  },
  {
    "headline": "NDLEA Na Neman Abba Kyari Ruwa A Jallo Kan Zargin Badakalar Kwayoyi",
    "summarized_story": ""
  },
  {
    "headline": "Ginin Filin Wasa Na Zamani A Zamfara Zai Lakume Naira Biliyan 1.5",
    "summarized_story": ""
  },
  {
    "headline": "Hon. Monguno Ya Nuna Damuwa Kan Rashin Sanya Ido A Harkar Shigo Da Fetur",
    "summarized_story": ""
  },
  {
    "headline": "Masana’antun Abincin Kasar Sin Sun Bunkasa Da Kashi 25.5 A 2021",
    "summarized_story": ""
  },
  {
    "headline": "Ya Dace Makiran ‘Yan Siyasar Birtaniya Su Mayar Da Tsibiran Malvinas Ga Argentina Idan Suna Son Nacewa Kan Adalci",
    "summarized_story": ""
  },
  {
    "headline": "BREAKING: ASUU opts for one-month warning strike",
    "summarized_story": "A member of the National Executive Council (NEC) meeting of the Academic Staff Union who attended the just-concluded meeting of the Academic Staff Union of Universities (ASUU) told PM News that the union resolved to embark on a one-month “comprehensive and total” strike.\nAccording to the source, the union took the decision despite interventions by many prominent Nigerians.\nHe said the decision was to save Nigeria’s university system considering what he described as the deteriorating state of Nigerian universities.\nWe hope the government would do the needful within the next four weeks,” the source stated on Monday morning.\nHowever, ASUU is yet to issue an official statement concerning the strike."
  },
  {
    "headline": "Why Buhari must not allow bigwigs' presidential ambition destroy APC",
    "summarized_story": "By Emmanuel MogbedeThe Concerned Members Forum of All Progressives Congress (APC) has appealed to President Muhammadu Buhari not to allow the 2023 presidential ambition of some top members of the party to destroy it.\nAccording to Ogenyi, the party’s crises came as a result of poor reward system for its loyal members over the years.\n“Judging by the activities of the various actors, we appeal to President Buhari not to allow the selfish interest of the 2023 presidential ambition of some ranking members to destroy the party,” he appealed.\nHe, therefore, urged the president to recommend a highly committed and disciplined member of the party to lead it beyond 2023.\nHe advised that “immediately after the party’s national convention, there should be a primary election to minimise crisis within the party’s fold."
  },
  {
    "headline": "BREAKING: NDLEA Declares Suspended DCP Abba Kyari Wanted For Belonging To A Drug Cartel",
    "summarized_story": "BREAKING: NDLEA Declares Suspended DCP Abba Kyari Wanted For Belonging To A Drug CartelThe National Drug Law Enforcement Agency designated Abba Kyari, a suspended Deputy Commissioner of Police, wanted on Monday for alleged ties to an international drug syndicate.\nThe decision was made in the wake of the Hushpuppi debacle.\nFemi Babafemi, the NDLEA’s Spokesperson, made the announcement at a press conference held at the organization’s headquarters.\nDetails later…"
  },
  {
    "headline": "Vice-President Osinbajo Planning To Announce Presidential Bid After May 29 — APC Sources",
    "summarized_story": "Prof Yemi Osinbajo, Nigeria’s Vice-President, is expected to formally proclaim his alleged presidential ambitions after May 2022, according to top APC sources.\n“Since Buhari is not picking a side between the two men, the APC presidential primary will be an open contest between them.\nAlso, the late Oyo State governor, Abiola Ajimobi’s perceived mediocre performance also played a role in APC’s defeat in Oyo State.\nA major hurdle ahead of Osinbajo’s presidential ambition would be how to secure victory during the APC presidential primary, other sources revealed.\nBut in a chat off the record, Akande did not rule out that Vice-President Osinbajo would be running for president."
  },
  {
    "headline": "Tinubu’s Camp Releases Statement Over Viral Wet Cloth, Blames Political Enemies",
    "summarized_story": "A pro-Bola Tinubu coalition, the Support Groups Management Council, has released a statement over the circulating video of the All Progressives Congress, APC, national leader’s wet dress.\nThe group in their statement tried to convince Nigerians that the viral video and photographs of Tinubu in a wet dress is the work of mischief-makers.\nThe coalition said the viral video was manipulated, insisting that the APC national leader is healthy and ready to challenge and win the 2023 presidential election.\nAfter the visitations, a video of the former Lagos State Governor in a wet dress around his lower region surfaced on social media.\n“Assuming without conceding that is the case, so is it the back of his knees that would be wet and not the bum area?"
  },
  {
    "headline": "BREAKING: ASUU To Go On One-Month Warning Strike",
    "summarized_story": "The National Executive Council, NEC, of the Academic Staff Union of Universities, ASUU, has voted to go on a one-month warning strike to press its demands on the government, following lengthy debates that lasted into the early hours of Monday.\nThe strike, according to a source at the conference in Lagos, is to give the Federal Government time to accomplish what it has to do, failing which the union will proceed on an indefinite strike.\nWe are parents too and have our children in the system but we cannot watch and allow the total collapse of education in the country.\n“Our agitation is in the interest of all and if the system is made better, we will all enjoy it.\nOur National President would explain more when he briefs the press later today,” he said."
  },
  {
    "headline": "APC chair: Mustapha kicks as ANPP caucus, North-east curry favours",
    "summarized_story": "Major contenders for the APC national chairmanship position from the North-east include; former governor of Borno state, Ali Modu Sheriff; Chief Sunny Moniedafe, former Governor of Bauchi state, Isa Yuguda; and another former Governor of Borno state, Kashim Shettima.\nThe move unfoldsThe source said: “The CPC has the president; the ACN has the Vice President and chairman of party.\nThe ANPP went into the pact with the highest number of states and yet to be properly recognised with political positions.\nBlueprint learnt that the North-east chairmanship aspirants were all on the same page to the effect that one of them should emerge the next APC national chairman to correct the perceived injustice done to the ANPP caucus since the formation of APC 2015.\nMedia aide to the chairmanship aspirant, Dapo Okunbanjo, said: “The Saliu Mustapha Campaign Organisation does not dwell on rumours or innuendos."
  },
  {
    "headline": "Executive Order 10: SANs, CSO’s tango over Supreme Court ruling",
    "summarized_story": "They also sought an order “setting aside the Presidential Executive Order No.\n“Thus, the presidential Executive Order 10 is meant to facilitate the implementation of the constitutional provisions.\nSANs differIn his reaction, a prominent South-west lawyer, Chief Adeniyi Akintola (SAN), said the Supreme Court judgement on the Executive Order was in order.\nIn the interval between the executive order and the judgment of the Supreme Court, a lot has happened.\nOjo told one of or correspondents that “Executive order 10 is just an enabled law, it is highly unnecessary."
  },
  {
    "headline": "Breaking: Nigeria’s D’Tigress overcome Mali, pick 2022 FIBA women’s World Cup ticket",
    "summarized_story": "Later in 2022, Nigeria’s D’Tigress will be among the teams expected to feature during FIBA Women’s World Cup slated for Australia.\nThis is after the Nigerian side won their second match of the qualifier against Mali 73-69 a while ago on Sunday.\nDetails loading…"
  },
  {
    "headline": "NDLEA Declares Abba Kyari Wanted For Drug Trafficking",
    "summarized_story": "The National Drug Law Enforcement Agency has declared suspended Deputy Commissioner of Police, Abba Kyari, wanted over alleged links with drug trafficking.\nHe asked the NDLEA officer to persuade men of the FCT Command, to play along as well.\nIn effect, he would be delivering $61, 400 to the NDLEA team.\n“He also brought with him the money from the sale of the 5kg share of the NDLEA team, a total of $61, 400.\n“We are making this strong statement to those contemplating harmful action against NDLEA officers."
  },
  {
    "headline": "ASUU Declares One-Month Warning Strike",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has declared a one-month warning strike.\nASUU also said the 2009 agreement reached with the Federal Government ought to be reviewed every three years.\nIn 2020, ASUU had embarked on a nine-month strike over the government’s failure to honour its part of the deal.\nThe lecturers, however, called off the strike after a series of meetings with the Federal Government.\nBut in November, ASUU issued a three-week ultimatum to the government over the handling of the deal."
  },
  {
    "headline": "NUPENG Set For Strike, Claims Ministry Diverting N621bn Road Fund",
    "summarized_story": "The Nigeria Union of Petroleum and Natural Gas (NUPENG) workers has declared its support for the imminent industrial action by the Petroleum Tanker Drivers branch of NUPENG and announced that it had started mobilising members of the union for the sudden strike.\nNUPENG also claimed that its investigations revealed that officials of the Federal Ministry of Works and Housing were currently diverting the N621bn provided by the Nigerian National Petroleum Company (NNPC) Limited for the rehabilitation of 21 critical highways.\n“ln attendance at the 12th October were critical Stakeholders such as the FIRS, FRSC, Federal Ministry of Works and Housing, Nigeria Association of Road Transport Owners and NUPENG.\n“These two meetings resulted into the signing of communique indicating the readiness and willingness of NNPC to finance the rehabilitation of identified 21 critical roads at an estimated sum of N621 Billion through Road infrastructure Tax Credit Scheme.\nWe demand an immediate review of transport freight rates to reflect the operational realities of the petroleum distribution value chain."
  },
  {
    "headline": "20 Abducted Victims Regain Freedom In Niger, Police Kill Several Bandits",
    "summarized_story": "Twenty abducted persons in Niger State have regained their freedom after the police in Niger State raided a bandits’ hideout at Anaba hilltop, Magama Local Government Area of the state.\nThe Police Public Relations Officer, Niger State Command, Dsp Wasiu A. Abiodun disclosed this in a statement on Sunday.\n“Consequently, scores of bandits were neutralised and the rustled cattle were recovered while about 20 abducted victims regained their freedom,” the statement read in part.\nThe Commissioner of Police, Niger State Command CP Monday Bala Kuryas, reiterated the commitment of the Command to rid the state of banditry activities and other crime.\nHe also called for the cooperation and support of Niger residents towards ensuring a crime-free society."
  },
  {
    "headline": "Germany To End Most COVID-19 Restrictions In March",
    "summarized_story": "Germany will end most government restrictions to fight the coronavirus pandemic in March, according to a draft official plan seen by AFP on Monday, as new infections rates ease.\nTwo years after the start of the outbreak in Germany, curbs to prevent contagion will begin falling away.\nContact restrictions are also in place keeping private gatherings to 10 people, or two households if an unvaccinated person is present.\nOn Monday, Germany reported 76,465 new Covid-19 infections over the last 24 hours and 42 deaths in the second week in a row to show falling rates.\nGermany’s states, which have significant autonomy in implementing restrictions from mask-wearing in public transport to home-schooling, have already begun to gradually ease curbs."
  },
  {
    "headline": "Tinubu visits Awujale, informs him of his presidential ambition",
    "summarized_story": "National leader of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu has paid a courtesy visit to the Awujale of Ijebuland, Oba Sikiru Adetona in Ijebu Ode, Ogun State.\nAsiwaju Bola Tinubu said the essence of the visit is to officially inform the paramount ruler of Ijebu land his intention to run for the position of President of Nigeria in the 2023 Presidential election.\nAdvertisement"
  },
  {
    "headline": "Senator Philip Aduda raises concern over BVAS Operation",
    "summarized_story": "The Senator representing Federal Capital Territory has raised concerns over the functionality of the Bimodal Voting Accreditation System, BVAS.\nPhillip Aduda enjoins INEC to get its act right ahead the 2023 general election.\nAdvertisementHe spoke after casting his vote at the Polling units 004 in Karu.\nWhile he describes his accreditation and voting process as seamless, the lawmaker said reports reaching him from other parts of the nation’s capital are not palatable regarding the BVAS."
  },
  {
    "headline": "APC CECPC Notifies National Convention of Proposed Amendments to Constitution -",
    "summarized_story": "In accordance with Article 30 (iii) of the All Progressives Congress (APC) Constititution, the Governor Mai Mala Buni-chaired Caretaker/Extraordinary Convention Planning Committee (CECPC) has served a notice of proposed amendments to the Party’s Constitution on members of the National Convention.\nArticle 30 (iii) stipulates that the notice is served at least fourteen (14) days before the date of the National Convention at which the proposed amendments is to be considered.\nAdvertisementAPC Constitution 2014 has been in effect for almost eight years and together with judgments from Courts of competent jurisdiction, administrative experiences have revealed flaws in the Constitution.\nIt became imperative to conduct a review of the Party’s Constitution.\nThe Caretaker/Extraordinary Convention Planning Committee established a Constitution Review Committee under the chairmanship of Prof. Tahir Mamman OON, SAN to thoroughly review the Constitution in accordance with Article 30 which provides for Constitutional amendments."
  },
  {
    "headline": "FCT Council Polls: Ortom vows to resist any form of rigging",
    "summarized_story": "The Benue State Governor Samuel Ortom has vowed to resist any form of rigging or manipulation in Saturday’s Abuja territory elections.\nAdvertisementLast minute preparation for Saturday’s Abuja territory elections necessitated this gathering of critical stakeholders of the country’s main opposition party at the instance of the campaign council Chairman.\nHe quickly goes into the business of the day by setting the tone for the closed door session.\nAdvertisementAccording to him the ruling party has made their job pretty simple by its abysmal performance.\nThe meeting was attended by Governor’s of Benue ,Oyo, Bauchi and Rivers State as well as Senators, former Governor’s, former Senators and other party leaders."
  },
  {
    "headline": "Robert Clark: Nigerian Constitution is a Piece of Rotten Document",
    "summarized_story": ""
  },
  {
    "headline": "Key US-Canada Bridge Reopens as Ottawa Protest Persists",
    "summarized_story": "Demonstrations against COVID-19 restrictions and other issues have blocked several crossings along the U.S.-Canada border and hurt the economies of both nations.\nThe bridge reopened to traffic late Sunday night, a spokeswoman for bridge owner Detroit International Bridge Co. confirmed.\n“Today, our national economic crisis at the Ambassador Bridge came to an end,” said Windsor Mayor Drew Dilkens.\nThe Windsor protest began to dwindle Saturday after police persuaded many protesters to remove vehicles blocking the road to the bridge.\nBut in Ottawa, Saturday’s crowd swelled to what police said were 4,000 demonstrators, and a counter-protest of frustrated Ottawa residents attempting to block the convoy of trucks from entering downtown emerged Sunday."
  },
  {
    "headline": "Tony Elumelu Foundation Partners EU on Africa’s Digital Infrastructure, EU to Invest €820m in Nigeria in 3 Years",
    "summarized_story": "These were announced at the weekend, in Lagos, by representatives of the European Commission during an interactive roundtable with youth, innovators, start-ups and women entrepreneurs that was organised by The Tony Elumelu Foundation (TEF) and the European Commission.\n“The EU will support building the fibre optic cables and data centres needed to improve Nigerian’s access to high speed connectivity.\nThe European Investment Bank (EIB) will invest E100 million to expand secure 4G connectivity in Lagos and Ogun States and triple national data capability.\n“The EU will support the digitalisation of Nigeria’s administration to allow better and more accessible public services to citizens,” the commission said.\nWe started in 2021 through E20 million (Euros) partnership to invest in women African entrepreneurs."
  },
  {
    "headline": "Nigeria Takes Delivery of 15 World Bank-Funded Power Transformers",
    "summarized_story": "Nigeria’s federal government through the Transmission Company of Nigeria, TCN, on Sunday announced that it had taken delivery of 15 brand new power transformers through the Apapa Port, Lagos.\nThe transformers, it stated, comprise 10 60MVA 132/33kV and five 150MVA 330/132kV-capacity facilities and were delivered to TCN Central Store in Ojo, Lagos State, for onward delivery to various TCN project sites nationwide.\nAbdulaziz noted that earlier in August last year, the World Bank also funded transformer supply contracts which brought in 10 60MVA132/33kV transformers and 25 “earthing” transformers.\nAccording to him, the TCN is equally executing several projects funded by the Agence Français de Développement (AFD).\n“Meanwhile, the procurement of consultants for projects funded by the Japan International Cooperation Agency (JICA), will soon commence,” TCN assured."
  },
  {
    "headline": "Nigeria: SERAP Sues Buhari, Lai Mohammed Over Failure to Publish Twitter Agreement",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) has filed a lawsuit against Nigeria President Muhammadu Buhari over the failure to publish the terms and conditions of the agreement, which the federal government recently signed with Twitter Inc. before the lifting the ban on the micro-blogging and social networking service in Nigeria.\nJoined in the suit, as respondent, was Minister of Information and Culture, Alhaji Lai Mohammed.\n“The operation and enforcement of the agreement may be based on broadly worded restrictive laws, which may be used as pretexts to suppress legitimate discourse, interfere with online privacy, and deter the exercise of freedom of opinion and expression.\n“The government has a legal obligation to promote universal Internet access, media diversity and independence, as well as ensure that any agreements with Twitter and other social media companies are not used to impermissibly restrict these fundamental human rights.\nNo date has been fixed for the hearing of the suit.”Udora Orizu in Abuja"
  }
]