[
  {
    "headline": "Anambra inmates to get vocational training after cleric’s visit",
    "summarized_story": "Valerian Maduka Okeke, has vowed to ensure the ultra-modern skills acquisition centre built at the Onitsha Federal Correctional Centre, Anambra State, becomes functional.\nOkeke, during a visit to the centre on Thursday, said the centre must start teaching the inmates the required skills to enable them to become better individuals.\nThe cleric said, “The skills acquisition centre must become functioning so as to enable the inmates get better rehabilitation.\n“For those who believe in Jesus Christ and accept him, he gives the right to become children of God.\nAccept Jesus Christ with gratitude."
  },
  {
    "headline": "Buhari cautions new NNPC board on ethics, accountability",
    "summarized_story": "), Friday in Abuja urged the Board of the newly incorporated Nigerian National Petroleum Company Limited to ensure strict compliance with Corporate Governance principles that place a premium on doing business with the highest ethical standards, integrity, and transparency.\nBuhari spoke at the State House, Abuja, while inaugurating the Board chaired by Margery Okadigbo.\nThis is according to a statement by the Special Adviser to the President on Media and Publicity, Femi Adesina, titled, ‘President Buhari demands transparency, accountability from new NNPC board’.\n”The Nigerian National Petroleum Company Limited is mandated to focus on profitability and continuous value creation beyond the simple fulfilment of legal and regulatory requirements.\n”Mr President, this is history in the making because this is the first time any President of the Federal Republic of Nigeria is inaugurating an independent board of an independent NNPC Limited."
  },
  {
    "headline": "2023: Jonathan’s rumoured flirtation with APC",
    "summarized_story": "Jonathan became governor of Bayelsa state in 2005 following the fall of his former mentor, Diepreye Alamieyeseigha who was impeached for corruption-related offences.\nHowever, President Buhari has been full of praises for his predecessor in recent times, often crediting him for saving the nation’s democracy following his decision to concede defeat in 2015.\nAccording to him, the ECOWAS summit is held on Sunday, in Ghana and a key item for discussion is the development in Mali.\n“So, ECOWAS will be meeting on Sunday and that is why Jonathan visited Buhari,” Eze explained.\nIt would be recalled that Jonathan had on Dec. 31, 2021, visited President Buhari at the Presidential Villa, Abuja, and quickly proceeded on a closed-door meeting with the President."
  },
  {
    "headline": "Group berates Aregbesola, Osun Defender for accusing Oyetola of betraying APC",
    "summarized_story": "…Urges them to cover their faces in shameA socio-political group, Osun Shall Rise Again, OSRA, has berated a former Osun Governor and Interior Minister, Rauf Aregbesola, for accusing Governor Adegboyega Oyetola of betraying the All Progressives Congress, APC, just because he reviewed some of the policies that made the party almost lost the Governorship election in 2018.\nOsun Defender, a local community Newspaper, had published a story “REVEALED: How And When Oyetola Abandoned APC Programmes To Please Omisore,” where it claimed that the policy review carried out by Oyetola amounted to abandoning the party’s Programme to please Osun former deputy governor, Otunba Iyiola Omisore.\n“Were the reports from Mr Governor’s Thank You Tour and UK DFID Needs Assessment exercise were also influenced by Omisore?\n“Everybody knows that Oyetola was not in the know of how APC reached out to Omisore in the build-up to the re-run election.\nI think Oyetola should be commended for managing Omisore up till the time he formally joined the party,” the group said."
  },
  {
    "headline": "2022: Freight Forwarders call for fine tune in e-call up, reduction in cost of doing business",
    "summarized_story": "By Providence AdeyinkaThe Congregation of Registered Freight Forwarding Practitioners of Nigeria, CREFFPON has said that the e- truck call up system requires fine tuning less than one year in operation.\nThey are also calling for reduction in the cost of doing business in the Nigerian ports in 2022.\nThe NPA should be concerned about its port rating globally, especially in relation to port friendliness, costs and efficiency’’, he added.\nTime to think more of our profession other than our individual interests is now.’’He also said, “The Haulage sector of the freight forwarding profession requires an intervention.\n“Above all, the cost of doing business in the Nigeria ports is still very expensive and does not add up towards a healthy economy."
  },
  {
    "headline": "Expert seeks confirmation of Bello-Koko as NPA MD",
    "summarized_story": "By Godfrey BivbereA maritime practitioner,Olusegun Ologbese, has commended the Acting Managing Director on the Nigerian Ports Authority, NPA, Mohammed Bello-Koko, for his achievements within a short time he was appointed.\nOlogbese said his actions are replica of one of the best former chief executive of the NPA, Alhaji Wali Ahmed, who turned around the fortune of the Authority in his time.\nREAD ALSO:Work to commence soon at Abia sea port as investor completes documentationHe noted that it is on record that Wali Ahmed, besides making money for the NPA during his tenure, also assisted the Nigeria Railway Corporation, NRC, when it was going through financial difficulties.\nHe therefore called on the Federal Government to confirm the appointment of Bello-Koko as the substantive MD of NPA.\nOlogbese commended Bello-Koko on the recent promotions in the NPA, stating, “For the past eleven years former Managing Directors of NPA had always gone outside to poach retiring officers to head departments.’’"
  },
  {
    "headline": "GoG PIRACY: Stakeholders blame Anglophone, Francophone dichotomy",
    "summarized_story": "By Godfrey BivbereStakeholders in the maritime industry have blamed the inability of the Economic Community of West African States, ECOWAS, to tackle piracy in the Gulf of Guinuea, GoG, on the age-long Francophone – Anglophone dichotomy.\nThe stakeholders were responding to the recent spike in piracy in the GoG.\nThis explains the reason francophone countries are reticent on issues of cooperation, especially when France’s interest is likely to be in jeopardy,” he noted.\nThey warned that the presence of these navies poses a threat to the countries in the sub-region.\nThey, therefore called on Nigerian government and those of the region to act decisively before it is too late."
  },
  {
    "headline": "Buhari inaugurates new NNPC board members, reads riot act",
    "summarized_story": "President Muhammadu Buhari has reeled out a number of guidelines that the new board members of the Nigerian National Petroleum Company (NNPC) Limited must not flout.\nBeyond this, the President tasked them to focus on profitability and operate at par with their industry peers across the world.\n”The Nigerian National Petroleum Company Limited is mandated to focus on profitability and continuous value creation beyond the simple fulfilment of legal and regulatory requirements.\n”NNPC Limited is expected to operate at par with its industry peers across the world while acting as Enabler Company that will foster the development of other sectors of our Economy.\n”NNPC Limited is expected to operate at par with its industry peers elsewhere in the world while acting as enabler company that will foster the development of other sectors of our economy,” he stated."
  },
  {
    "headline": "Ondo deploys Amotekun to prisons after soldiers’ withdrawal",
    "summarized_story": "Following the withdrawal of military personnel, operatives of the Ondo State Security Network Agency, otherwise known as Amotekun corps, have been drafted to correctional centres across the state.\nThe Amotekun corps were deployed to the correctional centres alongside other security agents from the state commands of the Nigeria Police Force and the Nigeria Security and Civil Defence Corps, NSCDC.\nAmotekun corps Commander in the state, Akogun Adetunji Adeleye disclosed this at the headquarters of the corps in Akure, the state capital.\n“As soon as that incident (soldiers withdrawal) happened, the police and the NSCDC immediately deployed their men to all the correctional centres.\n“At the moment, all the correctional centres within the state are being manned by the officers and men of the police, NSCDC and the Amotekun.”"
  },
  {
    "headline": "Renowned Islamic scholar, Dr Ahmad BUK dies in Kano",
    "summarized_story": "A renowned Islamic scholar, Sheikh Ahmad Muhammad Ibrahim Bamba, popularly known as Kala Haddasana, has passed away on Friday.\nHe was a renowned scholar of Hadith, where he used to teach at the BUK Mosque but later in his own mosque called Darul Hadith.\nThe family announced that the funeral will be held at the Darul Hadis Mosque in the Tudun Yola area of Kano after Friday prayers.\nKala Haddasana, as he is better known, was a native of Ghana and was born there.\nHe came back to Nigeria after studying for a degree in Saudi Arabia to teach at Bayero University in Kano for a doctorate."
  },
  {
    "headline": "55 journalists killed in 2021 – UNESCO",
    "summarized_story": "United Nations Educational, Scientific and Cultural Organisation (UNESCO) says 55 journalists and media professionals were killed in 2021.\nThe world body condemned the impunity against journalists, describing it as “alarmingly widespread”.\nUNESCO Director-General, Audrey Azoulay lamented that “too many” members of the press paid the ultimate price to bring truth to light.\nAzoulay condemned the killing of Myanmar journalist Sai Win Aung a.k.a.\nUNESCO raises awareness through World Press Freedom Day every May 3, and coordinates the UN Plan of Action on the Safety of Journalists and the Issue of Impunity."
  },
  {
    "headline": "We’ll soon hold you accountable – Lawyer reacts to Buhari’s comment on Nnamdi Kanu",
    "summarized_story": "Aloy Ejimakor, special counsel to Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, on Friday reacted to President Muhammadu Buhari’s remark on the call for the secessionist’s release.\nSpeaking with DAILY POST, Ejimakor expressed hope that Buhari will someday be held accountable for his comment to allow the judiciary to decide Kanu’s matter.\nHowever, Ejimakor said Buhari’s latest remark had dimmed the possibility of Kanu’s release.\nAccording to Ejimakor: “Buhari’s remarks on releasing Nnamdi Kanu is two-faceted.\n“Buhari is therefore saying that he will respect and implement any judicial decision on Kanu, including an order for his release."
  },
  {
    "headline": "Capital importation hits $1.7b, says NBS",
    "summarized_story": "The National Bureau of Statistics (NBS) on Friday said the total value of capital importation into Nigeria was $1.7billion in third quarter of 2021 (Q3 2021).\nThis is according to the bureau’s document titled: “Nigerian Capital Importation Q3 2021.”The total value of capital importation into Nigeria in the third quarter of 2021 stood at $1.731 billion from $875.62 million in the preceding quarter of 2021.\nRead Also: Minerals production grew by 17.95% in 2020 – NBSThe bureau noted that the largest amount of capital importation by type was received through portfolio investment.\nIt accounted for 70.30 per cent ($1,217.21 million) of total capital importation.\nForeign Direct Investment (FDI) amounted to 6.23 per cent ($107.81 million) of total capital imported in Q3 2021."
  },
  {
    "headline": "N369b Second Niger Bridge is Buhari’s biggest capital project, says Kalu",
    "summarized_story": "The N369 billion Second Niger Bridge in the Southeast is President Muhammadu Buhari’s biggest capital project, Senate Chief Whip Orji Uzor Kalu has said.\nIt was during a meeting he convened for the executive committee members of his political structures, the OUK Movement, and Reality Organisation from the 17 local government areas and 295 wards.\nThe senator described the N369 billion Second Niger Bridge as the Federal Government’s single biggest capital project to be cited in any geo-political zone in the country.\nIn separate speeches, Messrs Ndukwe Orji and Mr. Peter Ndukwe, Chairmen of OUK Movement and Reality Organisation, respectively, pledged their continued loyalty to Kalu.\nThe President of Reality Organisation Worlwide and Kalu’s mother, Eunice, urged the two groups to remain committed and steadfast to the 2023 project."
  },
  {
    "headline": "Buhari to APC: intra-party rift invitation to PDP victory",
    "summarized_story": "President Muhammadu Buhari yesterday urged All Progressives Congress (APC) leaders to put their house in order so that the ruling party can retain power in next year’s election.\nThe President urged the ruling party to learn from the mistake of the Peoples Democratic Party (PDP), which made power to shift to the ruling party in 2015.\nPresident Buhari said: “We have a timeframe we have to work because the four-year tenure is constitutional.\nWhat other parties are doing is their own business, but we want to make sure that our party members understand that they are respected.\nOn sucession, President Buhari said: “Yes, because, look, as you know I have been a governor."
  },
  {
    "headline": "PMB and the futurologists, by Femi Adesina",
    "summarized_story": "Since he became leader of the country, President Muhammadu Buhari has been an object of the futurologists.\nBut year after year, month after month, President Buhari continues to do his duty to the country, and to his family.\nWe remember 2017, when President Buhari was practically unavailable between January and August, with only intermittent returns to the country in-between.\nWhat we learn from the antics of the prophets against President Buhari is that no man ever has the final say.\n*Adesina is Special Adviser to President Buhari on Media and Publicity"
  },
  {
    "headline": "Fed Govt releases N31.97b to offset accrued rights liabilities",
    "summarized_story": "The National Pension Commission (PenCom) has announced an additional release of N31.97 billion by the Federal Government for the payment of accrued pension rights to 2021 retirees.\nThis is coming after the release of the sum of N16.67 billion on Decemebr 29, 2020, thus bringing the total amount released for payment of the 2021 accrued pension rights to N48.64 billion.\nThe Federal Government had earlier settled all arrears of accrued pension rights payments to the verified and enrolled retirees up to December 2020.\n- Advertisement -Before the payment of N16.67 billion in December last year, the Federal Government total pension liability to retirees was over N100 billion.\nThe Director-General, Mrs Aisha Dahir-Umar is however optimistic that the settlement of the outstanding accrued pension rights is a significant developments, noting that all outstanding payments will be secured from the Federal Government by the Commission."
  },
  {
    "headline": "Stop using military uniforms for your campaign posters, DHQ warns govs, others",
    "summarized_story": "From Molly Kilete, AbujaThe Defence Headquarters(DHQ), has frowned against the use of military uniforms and accoutrements by some state governors, politicians and unauthorized persons to produce their campaign posters.\nThe DHQ, warned that that the military allowed governors and other Very Important Personalities (VIP) to wear military uniforms during military training exercises, does not make them military officers overnight to use the uniforms whenever they want to.\nIt has therefore warned those who have used their pictures in military uniforms to produce their campaign posters to remove them or have themselves to blame.\nActing Director Defence Information, Air Commodore Maigida, who gave the warning in a statement entitled “Wearing of military uniforms by unauthorised persons and politicians for electioneering campaign posters is illegal” said: “The Defence Headquarters (DHQ) has noticed with dismay that some politicians have formed the habit of wearing military uniforms and accoutrements for electioneering campaign posters.\nThis is manifestly illegal and an abuse of the privilege of allowing civilians wear military uniforms during military training exercises."
  },
  {
    "headline": "Kanu: Political solution inevitable, Ohanaeze tells Buhari",
    "summarized_story": "From Magnus Eze and Geoffrey Anyanwu, EnuguOhanaeze Ndigbo, yesterday, said political solution was inevitable in the matter between the Federal Government and leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu.\nOgbonnia reasoned that an ordinary pronouncement by the President Buhari could end the whole agitation in the region.\nThat is what we mean by political solution.\nThat is what we call political solution.\nAs every revolutionary struggle has its own methodology, the current Biafran struggle for actualisation and restoration will continue to unfold confusing methods to President Buhari."
  },
  {
    "headline": "Convention: APC stakeholders seek sack of Lukman, PGF DG, threaten protest",
    "summarized_story": "Stakeholders of the All Progressives Congress (APC) have called on governors elected on the platform of the party to sack the Director General of the Progressive Governors’ Forum (PDF), Salihu Moh Lukman, with immediate effect.\nThe stakeholders, under the aegis of the All Progressives Congress Youth Development and Solidarity Forum (APC-YDSF), said they were ready to stage a nationwide protest if he continued as DG, PGF.\nThe claimed Lukman has proved he is an agent of a few selfish interests in the party and that of the Peoples Democratic Party (PDP).\nThey spoke just as the party said it was set to deal with erring members found to be working against its interest.\nNational Coordinator of the Group, Donatus Okereke, told newsmen in Abuja that the party was not ready for a national convention with the crises engulfing some state chapters, urging the national leaders to ensure “proper and thorough reconciliation” before any national convention is staged."
  },
  {
    "headline": "2023: South East PDP, leaders back Anyim for president",
    "summarized_story": "Former PDP national vice chairman, South East, Ozichukwu Chukwu, praised Anyim for his courage, noting that he is immensely qualified for the job.\n“This is the turn of the South East, we are not visitors, we are equal stakeholders in Nigeria.\nSo, this issue of South East having the presidential slot is not negotiable,” Ogba said.\nOn his part, PDP National Vice Chairman, South East, Ali Odefa, said Anyim has set the pace and urged others from the zone to follow suit.\n“Let me also, at this point, state clearly that I am aware that I am not the only aspirant from the South East seeking to run for the office of president."
  },
  {
    "headline": "Oromoni: Family hires Falana, others for legal war",
    "summarized_story": "From Paul Osuyi, AsabaThe family of the late Sylvester Oromoni Jnr.\nFather of the deceased student of Dowen College, Mr. Sylvester Oromoni, in reaction to the DPP’s advice, said the family would pursue the case legally to a logical conclusion to get justice.\nAs a result, Mr. Oromoni in a statement, said the family has instructed the legal team led by Mr. Femi Falana (SAN),to put machinery in motion.\nBe that as it may, I am not surprised with the content of the said legal advice.\n“The management of Dowen College, Lekki, Lagos, has always claimed that my late son sustained injury while playing football."
  },
  {
    "headline": "Buhari Warns APC of Consequences of Disunity",
    "summarized_story": "Buhari said without unity of purpose among the leaders and other party members, APC might lose to the opposition.\nBuhari also assured that those defecting from the opposition parties to APC, with corruption charges hanging over their heads, would have their day in the court of law.\nHe foreclosed the possibility of anyone in the party foisting leadership on members.\nBuhari stated, “We have timeframe we have to work, because the four-year tenure is constitutional.\nSo, the party, because I’m concerned about my party, the party, in all constituencies they will know their positions."
  },
  {
    "headline": "PDP to President: Just Go, Nigerians Don’t Want a Successor from You",
    "summarized_story": "Chuks Okocha in Abuja and George Okoh in MakurdiThe Peoples Democratic Party (PDP), yesterday, told President Muhammadu Buhari to perish the thought of pushing forward a successor, saying Nigerians would firmly reject anyone from him and his All Progressives Congress (APC) in the 2023 presidential election.\nPDP said the president should have used the interview to show remorse and apologise to Nigerians for his serial misgovernance.\nPDP said, “While we understand that lying is the standard gauge of performance of the APC, it is rather unfortunate that the president is also in that frame.\nThe governor was reacting to the Buhari interview on Channels TV.\nOr is it possible that Mr. President is not aware that Nigerians are dying from his misrule?”The governor dismissed the president’s classification of PDP as a failure, insisting, “As a critical stakeholder of the PDP, this is completely false."
  },
  {
    "headline": "Private Sector Operators Reject Introduction of Excise Duty on Non-alcoholic, Sweetened Beverages",
    "summarized_story": "*Insist sector may lose N1.9trnGilbert EkugbeSome members of the organised private sector yesterday kicked against the federal government’s introduction of an excise duty of N10 per litre on all non-alcoholic, carbonated and sweetened beverages in the country.\nAjayi-Kadir stated, “Let us look at it this way: the government is estimated to generate an excise tax of N81 billion between 2022 and 2025 from the group.\n“The food and beverage sector contributed the highest, 38 per cent, of the total manufacturing sector contribution to the GDP.\nDescribing the impact on manufacturers and the supply chain, he stressed that excise duty resulted in high production costs, which adversely affected production levels, and, ultimately, led to dwindling profits.\nHe said the introduction of excise would grossly affect the small and emerging business owners in the non-alcoholic beverage sector."
  },
  {
    "headline": "Ladoja: Uninformed People Responsible for Tension over Olubadan Stool",
    "summarized_story": "Ladoja conceded to the choice of High Chief Lekan Balogun as the most senior person to succeed the late Oba Saliu Adetunji as the new Olubadan.\nFormer President Olusegun Obasanjo visited the family of the late Olubadan yesterday to commiserate with them, and the people and government of Oyo State over Adetunji’s passing.\nTwo weeks after we started the case, Egbon Balogun said he was no longer interested in the case.\n“We won the case at the State High Court and Ajimobi appealed.\nHe arrived at the palace around 7:10am and was accompanied by former Secretary to the Government of Oyo State, Chief Olayiwola Olakojo."
  },
  {
    "headline": "Customs Generated N2.24 Trillion in 2021",
    "summarized_story": "James Emejo in AbujaThe Nigeria Customs Service (NCS) yesterday disclosed that it generated a total of N2.24 trillion last year.\nIt pointed out that the amount collected surpassed its N1.67 trillion target set for the year.\nCustoms spokesman, Mr. Joseph Attah, revealed these in a statement, adding that its 2021 performance also surpassed the N1.56 trillion it realised in 2020, representing a 43.45 per cent increase.\nThe NCS also listed other landmark achievements in that boosted national security and economy.\n“NCS management recognizes the selfless efforts of Officers and Men who remained undaunted throughout the year resulting in these achievements."
  },
  {
    "headline": "EXCLUSIVE: How Ogun Governor, Abiodun Used ‘Abuja Influence’ To Stop Anti-graft Agency, EFCC From Interrogating Assembly Speaker, Others Over Multi-billion Naira Fraud",
    "summarized_story": "The Ogun State Governor, Dapo Abiodun is frustrating the Economic and Financial Crimes Commission (EFCC) from interrogating the some State House of Assembly members accused of multi-billion-naira fraud, SaharaReporters has gathered.\nThe governor, according to impeccable sources, is using his “influential network in Abuja” to rein in the anti-graft agency from interrogating the state lawmakers, particularly the speaker, Olakunle Oluomo.\nSaharaReporters had reported that Oluomo is being investigated by EFCC with the Assembly clerk and some former members of the House.\n“Speaker falsified some contents {S.7(4)} of Ogun State Legislative Funds Management Bill, after passage, for personal/selfish grounds.\nThe tone of the lawmakers’ letter was riddled with unbridled arrogance and bourgeoning impunity, an EFCC insider said."
  },
  {
    "headline": "EXCLUSIVE: How Ogun Governor, Abiodun Used ‘Abuja Influence’ To Stop Anti-graft Agency, EFCC From Interrogating Assembly Speaker, Others Over Multi-billion Naira Fraud",
    "summarized_story": "The Ogun State Governor, Dapo Abiodun is frustrating the Economic and Financial Crimes Commission (EFCC) from interrogating the some State House of Assembly members accused of multi-billion-naira fraud, SaharaReporters has gathered.\nThe governor, according to impeccable sources, is using his “influential network in Abuja” to rein in the anti-graft agency from interrogating the state lawmakers, particularly the speaker, Olakunle Oluomo.\nSaharaReporters had reported that Oluomo is being investigated by EFCC with the Assembly clerk and some former members of the House.\n“Speaker falsified some contents {S.7(4)} of Ogun State Legislative Funds Management Bill, after passage, for personal/selfish grounds.\nThe tone of the lawmakers’ letter was riddled with unbridled arrogance and bourgeoning impunity, an EFCC insider said."
  },
  {
    "headline": "EXCLUSIVE: How Ogun Governor, Abiodun Used ‘Abuja Influence’ To Stop Anti-graft Agency, EFCC From Interrogating Assembly Speaker, Others Over Multi-billion Naira Fraud",
    "summarized_story": "The Ogun State Governor, Dapo Abiodun is frustrating the Economic and Financial Crimes Commission (EFCC) from interrogating the some State House of Assembly members accused of multi-billion-naira fraud, SaharaReporters has gathered.\nThe governor, according to impeccable sources, is using his “influential network in Abuja” to rein in the anti-graft agency from interrogating the state lawmakers, particularly the speaker, Olakunle Oluomo.\nSaharaReporters had reported that Oluomo is being investigated by EFCC with the Assembly clerk and some former members of the House.\n“Speaker falsified some contents {S.7(4)} of Ogun State Legislative Funds Management Bill, after passage, for personal/selfish grounds.\nThe tone of the lawmakers’ letter was riddled with unbridled arrogance and bourgeoning impunity, an EFCC insider said."
  },
  {
    "headline": "Age Is Telling On My Job, My Colleagues Now Resting – Buhari",
    "summarized_story": "President Muhammadu Buhari has admitted that his old age is affecting his job and his efficiency in administration.\nBuhari, who clocked 79 on December 17, 2021, said this while reacting to a question during an interview on NTA, on Thursday.\nNigeria's President Muhammadu Buhari.\n“About my age, I see my colleagues; they are now resting, and I assure you that I look forward to the next 17 months when I too will be less busy,” he said.\n“I have been a governor, I have been a minister, and I’m in my second term as president."
  },
  {
    "headline": "Age Is Telling On My Job, My Colleagues Now Resting – Buhari",
    "summarized_story": "President Muhammadu Buhari has admitted that his old age is affecting his job and his efficiency in administration.\nBuhari, who clocked 79 on December 17, 2021, said this while reacting to a question during an interview on NTA, on Thursday.\nNigeria's President Muhammadu Buhari.\n“About my age, I see my colleagues; they are now resting, and I assure you that I look forward to the next 17 months when I too will be less busy,” he said.\n“I have been a governor, I have been a minister, and I’m in my second term as president."
  },
  {
    "headline": "TIMELINE: 1980's triumph, Ikpeba's penalty miss... 5 unforgettable Super Eagles AFCON moments",
    "summarized_story": "Without further ado, here are five of those memorable Super Eagles AFCON moments:Maiden AFCON triumph on home soilAdvertisementNigeria made her debut at the tournament in 1963 and didn’t qualify beyond the group stages.\nWith revolutionary players like Segun Odegbami, Christian Chukwu, Muda Lawal, Best Ogedengbe, Nigeria cruised to her first AFCON trophy at a packed national stadium in Surulere.\nIn a white and black checkered jersey, the Eagles defeated Zambia 2-1 at the Stade El Menzah in Tunis to claim their second AFCON trophy.\nThey were all expecting the Super Eagles to win another AFCON trophy on home soil like they did in 1980.\n﻿3-star EaglesAfter almost two decades of near misses and a series of third-place finishes, Super Eagles eventually won their third AFCON trophy in front of teeming fans at the FNB stadium in Johannesburg."
  },
  {
    "headline": "TIMELINE: 1980's triumph, Ikpeba's penalty miss... 5 unforgettable Super Eagles AFCON moments",
    "summarized_story": "Without further ado, here are five of those memorable Super Eagles AFCON moments:Maiden AFCON triumph on home soilAdvertisementNigeria made her debut at the tournament in 1963 and didn’t qualify beyond the group stages.\nWith revolutionary players like Segun Odegbami, Christian Chukwu, Muda Lawal, Best Ogedengbe, Nigeria cruised to her first AFCON trophy at a packed national stadium in Surulere.\nIn a white and black checkered jersey, the Eagles defeated Zambia 2-1 at the Stade El Menzah in Tunis to claim their second AFCON trophy.\nThey were all expecting the Super Eagles to win another AFCON trophy on home soil like they did in 1980.\n﻿3-star EaglesAfter almost two decades of near misses and a series of third-place finishes, Super Eagles eventually won their third AFCON trophy in front of teeming fans at the FNB stadium in Johannesburg."
  },
  {
    "headline": "Newspaper Headlines: FG will merge agencies — NOT sack workers, says Zainab Ahmed",
    "summarized_story": "The warning of President Muhammadu Buhari to the All Progressives Congress (APC) regarding the crisis in the party ahead of the 2023 elections appeared on the cover pages of Nigerian newspapers.\nAdvertisement"
  },
  {
    "headline": "Newspaper Headlines: FG will merge agencies — NOT sack workers, says Zainab Ahmed",
    "summarized_story": "The warning of President Muhammadu Buhari to the All Progressives Congress (APC) regarding the crisis in the party ahead of the 2023 elections appeared on the cover pages of Nigerian newspapers.\nAdvertisement"
  },
  {
    "headline": "Daily COVID Tracker: NCDC logs 791 new infections, eight deaths",
    "summarized_story": "Advertisement“Last week, the highest number of COVID-19 cases were reported so far in the pandemic,” Tedros Ghebreyesus, WHO director-general, said.\nAustria to impose new COVID rulesAdvertisementA fresh set of COVID-19 restrictions will be introduced in Austria from Saturday.\nThe report contains a backlog of 523 confirmed cases reported for Lagos state on January 5 (249) and 6 (274);and 16 confirmed cases reported for Borno state on 5 (4) and 6 (14).\nIt added that 108 discharged cases reported for the FCT includes 102 community discharges.\nItaly makes vaccination compulsory for people over 50Italy on Wednesday made COVID-19 vaccination mandatory for people from the age of 50."
  },
  {
    "headline": "Cameroon risks stunting mobile money growth with new transaction levy",
    "summarized_story": "Among Cameroonians, new year celebrations have so far coincided with pushback against a new tax on mobile money transactions introduced by the Paul Biya administration.\n#WeSayNo.”The new mobile money tax will especially hit the poorest, unbanked segments of Cameroon society.\nA later study also points out that many mobile money users belong to “marginalised societal groups” hence the negative impact on financial inclusion and broader development goals of mobile money taxes is significant.\nSimilarly, a 1% tax on mobile money transactions in Uganda was cut in half after protests.\nUnlike Ghana’s case, however, citizens were barely informed of the details before Cameroon’s government implemented the new mobile money tax in November, according to local media reports."
  },
  {
    "headline": "How mobile phones and digital tools have helped Togo tackle COVID-19",
    "summarized_story": "Globally, the COVID-19 disease has infected more than 290 million people, claimed well over 5 million lives, and plunged millions into extreme poverty.\nMore than 1.6 million Togolese registered for the monetary support through their mobile phones, according to data on the Novissi website.\n“People should not have to choose between death by COVID-19 or by hunger,” President Faure Gnassingbe said on the Novissi programme.\nIn a month, more than 50,000 people registered for COVID-19 vaccination through Togo’s digital platforms.\nAuthorities launched a mobile and web-based service that allows Togolese to register for vaccination using their phones."
  },
  {
    "headline": "Here’s why startup funding in the Maghreb ecosystem is low",
    "summarized_story": "But when you break these numbers down into deals and compare them to Egypt’s over $600 million funding in 2021, the conversation on how disturbingly small the funding is comes up.\nWhat’s the problem of the Maghreb region, and how can the ecosystem rise to its full potential?\nIntra-regional conflictThe Maghreb countries don’t see eye-to-eye; they are archenemies or, as they are popularly called, “enemy brothers”.\nIn Nigeria, for instance, big conventional banks back fintech startups, and FMCGs invest in e-commerce and logistic upstarts.\nLanguage barrierThe Maghreb region speaks French and that makes it a francophone region."
  },
  {
    "headline": "TechCabal Wrapped: Here’s what you enjoyed reading from TechCabal in 2021",
    "summarized_story": "I joined TechCabal in January of this year to help drive TechCabal’s transition from a Nigerian tech publication to a pan-African tech and media publication.\nTechCabal Wrapped is our way of walking you through our most-loved and most-read articles in 2021.\n🥂 Koromone Koroye, Managing EditorHere’s what you enjoyed reading from TechCabal in 2021In 2021, TechCabal published 683 articles, 265 editions of TC Daily—including this one—and 50 editions of Next Wave.\nHow Herconomy raised a $600,000 pre-seed round in 24 hoursIn 2021, Nigerian startups raised about $1.4 billion.\nThe African tech ecosystem mourns the passing of Nnena Nkongho, an African investor who championed diversity and excellence."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "African startups raised $1 million every 2 hours in 2021 — Africa: The Big Deal",
    "summarized_story": "Odunayo Eweniyi, Co-founder, FirstCheck AfricaThe Big Deal reports that only 0.95% of the funding raised by African startups went to startups founded or led by a woman.\nAccording to Briter Bridges, 62% (~$2.9 billion) of total funding in African startups went to fintech startups, double the 31% recorded in 2020.\nMax AB, an Egyptian eCommerce startup raised a $55 million Series A across two rounds in 2021.\nSource: SuppliedSome startups that raised at least $100 million include Andela, $200 million Series E; Flutterwave, $170 million Series C; Chipper Cash, $250 million Series C across two separate rounds; OPay, $400 million Series C; Trade Depot, $110 million Series B; and Jumo, $400 million led by Fidelity Management & Research Company.\nWith the heights reached by African startups in 2021, it is logical to expect them to be matched and hopefully eclipsed in 2022."
  },
  {
    "headline": "Fintech predictions in 2022, LinkedIn’s Clubhouse-like platform, JABU’s $3.2m seed",
    "summarized_story": "Today, I’m discussing:2022 predictions for the fintech industryLinkedIn’s Clubhouse-like platformJABU’s $3.2m fundWhat does 2022 hold for the fintech industry?\nHere’s Emmanuel Paul’s take on that: Nigerian fintech predictions for 2022: Dollar exchanges go the way of Bitcoin.\nThe new events platform will begin with an audio-only product — clubhouse-style audio events — released in beta this January.\nAdvertisementIn March 2021, LinkedIn confirmed that it has been working on a Clubhouse rival to cultivate a larger and more active Creator community.\nAfore Capital, Y Combinator, FJ Labs, Quiet Capital, Kli Capital, Pareto Capital, among other unnamed investors, participated in the round."
  },
  {
    "headline": "Nigerian fintech predictions for 2022: Dollar exchanges go the way of Bitcoin",
    "summarized_story": "That’s how significant the exponential growth in the fintech space has been in recent years, and it creates room for bullishness in the space.\nFor instance, Nigerian fintech funding in 2021, $800 million, was 120% higher than funding in the last three years combined.\nPhoto by Kglavin via Wikipedia CommonsIn 2021, Africa minted five unicorns, two of which were Nigerian fintech companies.\nIt’s unlikely that WhatsApp’s payment play would be good news to existing banks and fintech players.\nWhat do you think about predictions for the fintech space?"
  },
  {
    "headline": "Seplat, Sahara Energy, Niger Delta, Famfa line up to acquire Shell’s $3bn assets",
    "summarized_story": "The Anglo-Dutch company has stakes in 19 oil mining leases in Nigeria’s onshore oil and gas joint venture (SPDC), which the industry and banking sources said were valued at $2 billion to $3 billion.\nThe sale has drawn interest from independent Nigerian oil and gas firms including Seplat Energy, Sahara Group, Famfa Oil, Troilus Investments Limited and Nigeria Delta Exploration and Production (NDEP), the sources said.\nState-controlled NNPC could also choose to exercise its right to pre-empt any sale to a third company, the sources said.\nTroilus has hired Nigeria-focused Africa Bridge Capital Management to raise up to $3 billion for the assets, according to sources and documents seen by Reuters.\nAny buyer of Shell’s assets will also need to show it can deal with future damage to the oil infrastructure which has ravaged Nigeria’s Delta in recent years, the sources said."
  },
  {
    "headline": "EXPLAINER: The Metaverse and the untapped potential of NFTs",
    "summarized_story": "Web 3.0, blockchain NFTs, and virtual reality all intersect to make up the metaverse.\nNFTs are the foundation blocks of value in the metaverse.\nRead also: Windfall Technologies wants to bring Africa’s real estate into the metaverseVirtual reality (VR)Even though it is only a component of the metaverse, virtual reality appears to be the most popular of the three.\nThis environment can only be experienced with the help of a virtual reality headset.\nThis is how individual ownership develops, and everything in the metaverse follows this formula, which is what the metaverse is all about: individual ownership’s rise."
  },
  {
    "headline": "Agric growth under Buhari weakest since 1999 despite investment",
    "summarized_story": "In his Channels TV interview Wednesday, President Buhari failed to engage questions about Nigeria’s woeful economic indicators, but rather insisted that to fix the economy Nigerians must return to the farm.\nDespite the rhetoric about investment in the agriculture and bolder commitment to infrastructure the sector has grown at the weakest rate under the Buhari administration since the return of democracy in 1999, according to data from the National Bureau of Statistics (NBS) and Statisense, a data consulting firm.\nThe sector grew at an average of 10.48 percent between 2016 and 2020, the lowest since 1999.\nIn 2018, the government budgeted N2.8 trillion but actual money released was N1.6 trillion, while in 2019 the government budgeted N2 trillion for capital expenditure but actual money released was N1.17 trillion as of Q3’ 2019.\nIn 2020, the government budgeted N2.4 trillion but actual money released was N1.74 trillion."
  },
  {
    "headline": "Kids Club Charity Donates Educational Materials To Schools In Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – In its resolved to helping humanity particularly the downtrodden and vulnerable in the society, one of the leading Non Governmental Organisations (NGO) in the country, Kids Club Charity, recently distributed “back to school materials” to schools across Edo state.\nSome of the ‘back to school items’ distributed by the NGO include School Uniforms; Sandals; books, biros and other educational materials.\nThe Kids Club Charity which is the brainchild of Dr. Awele Eucharia Ilobah, according to her is an NGO that is committed to catering for the less privileged and vulnerable children in the society.\nIn their separate remarks, the beneficiary schools and children expressed appreciations and commended the humanitarian gesture of Kids Club Charity for reaching out to them.\nAt the end of the NGO 2021 annual humanitarian services, about 20 schools were reached."
  },
  {
    "headline": "DOCUMENTING EDO STATE GOVERNMENTS – Nigerian Observer",
    "summarized_story": "As a journalist, writer and social scientist I have interacted with hundreds of politicians, public office seekers, academics, civil servants, clerics, critics and scores of other individuals in Edo State.\nFollowing this development, I resolved to start documenting all Edo State Governments in power since 2007 for public consumption beginning with Comrade Adams Aliu Oshiomhole whose administration oversaw the affairs of Edo State from 2007-2016.\nMaterials used for government documentation are from on/offline sources, most especially reports carried in the state-owned Nigerian Observer published by Bendel Newspapers Company Limited with headquarters in Benin City, capital of Edo State.\nGovernor Godwin Nogheghase Obaseki assumed office as Edo State Governor on November 12, 2016.\nRather, the works were put together by a team of researchers who believe passionately in providing resources material with which Edo citizens and other interested persons can get relevant facts about Edo State Government."
  },
  {
    "headline": "With 40MW power plant operational, investors scramble for space in Benin Industrial Park – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… as Edo govt earmarks 100ha for first phase, assures incentives for investors… Ossiomo Power generation capacity now 95MWBENIN CITY – With the coming on stream of the 40MW Independent Power Plant (IPP) built by Ossiomo Power and dedicated to provide power to the Benin Industrial and Enterprise Park, investors are trooping in to harness the benefit of the 24-hour electricity and other benefits available at the mixed-purpose park.\nOssiomo Power had announced that its new 40MW plant became operational in December 29 and had already connected and powering Ologbo and Obayantor communities in Ikpoba Okha Local Government Area of the State.\nThe new plant increases the generation capacity of Ossiomo Power to 95MW, as a 55MW plant had been operational since 2020.\nManaging Director, Edo State Investment Promotion Office (ESIPO), Kelvin Uwaibi, in a chat with journalists, said the state government has earmarked 100 hectares for the first phase of the mixed-purpose Benin Industrial and Enterprise Park, which measures about 997-hectares.\nAccording to him, “We are being inundated by enquiries from investors and are ready for those who want to set up shop as quick as possible."
  },
  {
    "headline": "Obaseki advances on digital economy, to provide optic fibre connectivity across 18 LGAs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has assured residents that his government will sustain ongoing reforms and programmes aimed at achieving digital economy in the state, promising to provide fibre optic connectivity to all Edo communities to enhance access to the internet and expand the state’s digital economy.\nObaseki, who spoke to journalists in Benin City, said his administration is committed to building physical and digital infrastructure, leveraging technology to drive sustainable growth and development in the state.\nHe stated, “Our operation Light Up Edo is in full gear with the street-lighting project being rolled out in Benin City, Ekpoma and Auchi.\n“As a government, we are recommitting ourselves to deepen growth across all sectors of the state and provide more opportunities for our people to realise their full potential.\nThese we will do by leveraging the innate abilities of our people and providing them with the tools and enablement to dominate and conquer their world.”..."
  },
  {
    "headline": "Carbonated drinks tax will be harmful to economy – MAN warns",
    "summarized_story": "Director-General, MAN, Segun Ajayi-Kadir, said this in Lagos, while reacting to the introduction of N10 excise duty on carbonated drinks as announced by the Federal Government on Wednesday, NAN reported.\nAs seen from previous impact analysis, excise affects production outputs, revenues and profits.\nAccording to him, introducing excise will easily reduce production capacity causing manufacturers to struggle to meet investor commitments as well as cause investors to take investments to other countries.\nIntroducing excise will easily reduce production capacity causing manufacturers to struggle to meet investor commitments as well as cause investors to take investments to other countries.\n“This will grossly impact the small and emerging business owners in the non-alcoholic beverage sector.”"
  },
  {
    "headline": "Mayhem: Terrorists kill 200 in Zamfara, two in Taraba, scores missing",
    "summarized_story": "Terrorists have killed at least 200 persons in Anka and Bukkuyum local government areas of Zamfara State between Wednesday and Thursday.\nOn Wednesday, the armed men attacked about five communities of Kurfa Danya, Kurfa Magaji Rafin Gero, Tungar Isa and Barayar Zaki in Bukkuyum and Anka LGAs.\nAn eyewitness, who spoke to the BBC Hausa Service, said three villages, Rafin Danya, Kurfa and Rafin Gero, were completely burnt down by the bandits.\nMeanwhile, terrorists on Wednesday evening killed two passengers and abducted 40 people along Gembu-Bali road in Taraba State.\nThe terrorists, it was gathered, were part of the bandits that relocated to the state from Zamfara and Katsina States in recent weeks."
  },
  {
    "headline": "FirstBank’s focus on putting customers first continues to be a driving force – Adeduntan",
    "summarized_story": "FirstBank’s focus on putting the customers first continues to be a driving force as we keep supporting our customers in meeting their business needs.\nThe Central Bank of Nigeria (CBN) as the regulator of the banking industry continues to lead and drive development in the industry.\nDuring the peak of the lockdown, the Firstmonie network provided an alternative channel for the Bank’s customers to conduct transactions and meet their basic financial service needs, serving as quasi-physical touchpoint for the bank’s customers.\nBuilt an industry leading digital banking (electronic banking) business.\nAnd the confidence that our stakeholders including our customers repose in us is reflective in 10.3% y-t-d growth customers’ deposits."
  },
  {
    "headline": "2023: Southeast PDP leaders endorse Anyim’s presidential ambition",
    "summarized_story": "The Southeast zonal and state executives of the Peoples Democratic Party (PDP), including political leaders and elders from the zone, have endorsed the presidential aspiration of former Senate President, Anyim Pius Anyim.\n“I was also schooled to appreciate the value of social justice, equity and fairness as building blocks for social harmony and inclusion.\n“My records show effective and efficient management of the nation’s diversity on the basis of equity, justice, fairness and inclusiveness.\n“If it is not zoned to the South East, it will remain a burden on the conscience of the nation.\nOrji; Senator Enyinnaya Abaribe; Dr. Ali Odefa, PDP National Vice Chairman, Southeast; Iyom Josephine Anenih, Senator Obinna Ogba; Dr. Frank Nweke; Prof. Elochukwu Amucheazi; Nze Ozichukwu Chukwu; Senator Emma Nwaka; Senator Chuka Utazi, among others."
  },
  {
    "headline": "Inter-state Travel App Debuts In Nigeria",
    "summarized_story": "An App-based carpooling platform for inter-states travel, CoolRide Services, has debuted in Nigeria.\nAccording to Omorogbe, CoolRide App is secure as everyone is profiled, and all payments are made with Bank details for security purposes.\n“It is very risky to travel out of town with someone you don’t know today.\n“CoolRide provides a safer and cheaper way to travel out of town.\nYou can also make a significant income by becoming a verified CoolRide driver with your personal car,” Omorogbe stated."
  },
  {
    "headline": "Obasanjo Condoles Makinde Over Soun Of Ogbomoso, Olubadan’s Death",
    "summarized_story": "Former President Olusegun Obasanjo, on Thursday, paid condolence visit to the Governor of Oyo State governor, ‘Seyi Makinde, over the demise of the Soun of Ogbomosoland and the Olubadan of Ibadanland, who died on December 12, 2021 and January 2, 2022 respectively.\nBut getting up on my feet, I thought I should pay condolence visit to Oyo State where, within a short period of time, you have lost two of your highest traditional rulers to death.\nADVERTISEMENT“So, I had to take it upon myself to pay condolence visit to the families of the late Olubadan and late Soun of Ogbomoso land.\nAnd I thought that it would be inappropriate for me to come to Ibadan, go to Ogbomoso and the governor is not visited.\nADVERTISEMENTHe said: “On behalf of the governor of Oyo State, we are receiving you to the state."
  },
  {
    "headline": "IYC Protests Sylvester Oromoni Jr’s Death, Threatens To Disrupt College Activities",
    "summarized_story": "Members of the Ijaw Youth Council (IYC), Lagos State chapter, on Thursday, staged a protest in front of Dowen College, Lekki Phase 1, Lagos, demanding justice for the death of 12-year-old Sylvester Oromoni Jr, who died from injuries he sustained from bullying by fellow students in the school.\nThe group also kicked against the exoneration of the 10 suspected staff and students for the alleged murder and negligence of the school by the Lagos State government.\nIt would be recalled that the State’s directorate of public prosecution at the ministry of justice had cleared the school, students and staff of complicity in the death of Oromoni Jr, stating that there was nothing linking the school and the suspects to the alleged crimes.\nThe group threatened to disrupt activities at the school if it reopens for normal activities next Monday as reported.\nADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "IYC Protests Sylvester Oromoni Jr’s Death, Threatens To Disrupt College Activities",
    "summarized_story": "Members of the Ijaw Youth Council (IYC), Lagos State chapter, on Thursday, staged a protest in front of Dowen College, Lekki Phase 1, Lagos, demanding justice for the death of 12-year-old Sylvester Oromoni Jr, who died from injuries he sustained from bullying by fellow students in the school.\nThe group also kicked against the exoneration of the 10 suspected staff and students for the alleged murder and negligence of the school by the Lagos State government.\nIt would be recalled that the State’s directorate of public prosecution at the ministry of justice had cleared the school, students and staff of complicity in the death of Oromoni Jr, stating that there was nothing linking the school and the suspects to the alleged crimes.\nThe group threatened to disrupt activities at the school if it reopens for normal activities next Monday as reported.\nADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "Activist Condemns Clearance Of Suspects In Dowen College Student’s Death",
    "summarized_story": "Political activist, Comrade Timi Frank, has condemned the clearance of 10 suspects arrested in connection with the death of 12-year-old Sylvester Oromoni Jr.Oromoni Jr. until his sudden illness and death was a student of Dowen College in Lagos.\nHe called on all fathers and mothers in the country to rise up and demand justice for late Oromoni Jr and his grieving parents.\nADVERTISEMENTAccording to him, “it is Sylvester Oromoni Jr today.\n“Today, Oromoni Jr’s death has been added to the growing number of mysterious deaths.\nHe insisted that the death of Oromoni Jr would hunt the perpetrators and their collaborators for life should justice be compromised in this manner."
  },
  {
    "headline": "Condemnation as senate exposes how PPPRA (NMDPRA) paid N200m subscriptions without vouchers",
    "summarized_story": "The upper chamber of the National Assembly has exposed how Petroleum Product Pricing Regulatory Agency (PPPRA) now known as the Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA), paid N200 million subscriptions without vouchers to United Kingdom (UK) firms.\nThe companies rendered online patent rights for data/information gathering such as Crude Oil/Product prices, Vessel Freight rates and tracking.\nIn its written response to the Committee, NMDPRA said, “due to nature of the service rendered, it does not require the advice of Federal Ministry of Justice.\nVouchers shall be made out in favour of the person or persons to whom the money is actually due.\nUnder no circumstances shall a cheque be raised, or cash paid for services for which a voucher has not been raised."
  },
  {
    "headline": "Condemnation as senate exposes how PPPRA (NMDPRA) paid N200m subscriptions without vouchers",
    "summarized_story": "The upper chamber of the National Assembly has exposed how Petroleum Product Pricing Regulatory Agency (PPPRA) now known as the Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA), paid N200 million subscriptions without vouchers to United Kingdom (UK) firms.\nThe companies rendered online patent rights for data/information gathering such as Crude Oil/Product prices, Vessel Freight rates and tracking.\nIn its written response to the Committee, NMDPRA said, “due to nature of the service rendered, it does not require the advice of Federal Ministry of Justice.\nVouchers shall be made out in favour of the person or persons to whom the money is actually due.\nUnder no circumstances shall a cheque be raised, or cash paid for services for which a voucher has not been raised."
  },
  {
    "headline": "Detained Kaduna journalist’s wife cries out: My husband sick in custody",
    "summarized_story": "The wife of a Kaduna-based journalist, Gladys Binniyat, has raised the alarm over the deteriorating health of her husband, Luka.\nThey just bandaged his legs and he gave them money to buy drugs which he used.\nI want them to release my husband for me so that he can be taken care of.\n“I am not sure of the kind of drugs given to him, I don’t trust them.\nI want him to be taken to a good medical facility for proper checkup and treatment.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Detained Kaduna journalist’s wife cries out: My husband sick in custody",
    "summarized_story": "The wife of a Kaduna-based journalist, Gladys Binniyat, has raised the alarm over the deteriorating health of her husband, Luka.\nThey just bandaged his legs and he gave them money to buy drugs which he used.\nI want them to release my husband for me so that he can be taken care of.\n“I am not sure of the kind of drugs given to him, I don’t trust them.\nI want him to be taken to a good medical facility for proper checkup and treatment.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Buhari reveals daily work schedule",
    "summarized_story": "By Ismaila ChafePresident Muhammadu Buhari has divulged his work schedule to Nigerians, saying he labours for them between six to eight hours a day.\nAnd he expects to be commended by Nigerians for doing so much work for them and for offering his best.\nBuhari gave the insight about his work schedule in an interview with NTA, on Thursday night, his second within 24 hours.\nBuhari revealed how COVID-19 has been a relief for him, on his schedule as fewer people are now lining up to see him.\nThis is the most I’m expecting from Nigerians."
  },
  {
    "headline": "Australia detains Czech player Voracova, cancels visa",
    "summarized_story": "Czech tennis player, Renata Voráčová has been arrested by Australia’s Border Force, days after she was allowed to enter the country.\n80 had entered Australia with a vaccine exemption certificate.\nThe Victorian Health Department and a Tennis Australia expert panel granted exemptions to the trio because the panels believed a prior infection warranted an exemption.\nHowever, the federal government informed Tennis Australia in November it would not allow international arrivals to bypass vaccine requirements on this basis.\nTennis Australia believes there was a grey area in regard to whether the exemption reason was valid."
  },
  {
    "headline": "Nigerians Don’t Want Successor From You — PDP To Buhari",
    "summarized_story": "The People’s Democratic Party has stated that in the 2023 presidential election, Nigerians will vehemently oppose any candidate presented by President Muhammadu Buhari (retd.)\nThis is according to a statement released on Thursday by Debo Ologunagba, the party’s National Publicity Secretary, captioned “Just Go!” Nigerians Don’t Want You to Have a Successor,’ the PDP tells Buhari.\nIn his Channels Television interview on Wednesday, January 5, 2022, the President was again chastised by the PDP for relying on incorrect numbers and making fraudulent performance claims.\nAccording to the opposition party, the President’s “fake stats” simply prove that no one in the APC is beyond lying.\nIt added that “President Buhari should have seized the opportunity provided by Channels Television to show remorse, apologise to Nigerians for his monumental failure and national embarrassment that the APC government represents instead of trying to rationalise APC’s failures with falsehood and grandstanding about a successor."
  },
  {
    "headline": "Singer Portable Settles With Manager Kogbagidi After Money-Related Beef",
    "summarized_story": "Habeeb Okikiola, aka Portable, a fast-rising Nigerian sensation, has reached an agreement with his manager, Kogbagidi, over money and contracts.\nThe two had squabbles in a video that went viral on Thursday, as Portable questioned his manager about money, car ownership, and contract.\nYou know you’re a ripper.”As the argument went on, Kogbagidi could be seen pleading with Portable not to get furious.\nPortable and Kogbagidi had a fight two weeks ago when the singer accused Poco Lee of stealing his music and money.\nThey eventually came to an agreement when Portable promised Kogbagidi and Poco Lee that he would never let them down again."
  },
  {
    "headline": "How I Ended Relationship With Prophet After Fearful Prophecy Against Me – Femi Adesina",
    "summarized_story": "Femi Adesina, President Muhammadu Buhari’s Special Adviser on Media and Publicity, has detailed how he cut ties with a Nigerian prophet due to ominous prophecies about him.\nThe presidential spokesman claimed in a statement on Thursday that he was repeatedly obligated to have an appointment with the supposed prophet in the state house prior to the dreadful prophecy.\nAccording to him, an anonymous prophet appeared in January of a few years ago and delivered a series of terrible forecasts that he claimed contradicted the teachings of the Holy Bible.\nHe said, “I used to open my doors to one young Nigerian prophet years back.\nMaybe the prophet felt that it was time for him to finally gran me under his armpit, control my life totally as he wanted."
  },
  {
    "headline": "COZA Pastor, Biodun Fatoyinbo Called Out Again, Accused Of Death By Lady",
    "summarized_story": "A lady by the name, Nnenna Akaluude, has accused COZA pastor Biodun Fatoyinbo of being responsible for the death of her friend Tega.\nThe heartbroken lady accused Biodun of reportedly indulging in occultism, committing bad things, and covering them up with the help of his church accomplices in a series of Instagram posts.\nShe wrote;“Dearest Tega your death was so unnecessary but it will not go unpunished.\nBiodun Fatoyinbo you know I know you.\nShe became the enemy number one because she said No to the advances of the ‘man of God’."
  },
  {
    "headline": "Joining APC won’t save corrupt politicians from trial – Buhari",
    "summarized_story": "﻿President Muhammadu Buhari has said joining the ruling All Progressives Congress (APC) by corrupt politicians would not save them against prosecution by anti-graft agencies.\nThe president said this in an interview with the Nigeria Television Authority (NTA) monitored in Abuja.\nHe said: “I don’t like to accept that joining our party will check our insistence on accountability.\nSo, the party, because I’m concerned about my party, the party, in all constituents, they will know their positions, coming up.\n“The age is telling on me, working now for 6,7,8 hours a day flight in the office is no joke."
  },
  {
    "headline": "FG plans agencies’ merger, says workers won’t be disengage",
    "summarized_story": "The federal government Thursday said it has no plan to disengage civil servants because of the nation’s economic downturn.\nShe, however, said the government would reduce overheads by ensuring merger of its agencies.\nThe minister’s position came against the backdrop of media reports (not in Blueprint) that government was planning to sack workers over cash crunch.\n“And also we will be able to come up with incentive packages to retrain people and redeploy them in some areas where they are useful.\nFor example, we still have a very high need for teachers so we can retrain people and send them to teach but also incentive packages to exit."
  },
  {
    "headline": "Imo: Again, hoodlums bomb another Police station",
    "summarized_story": "Part of Ideato South Area Police station at Dikenafai was Thursday set ablaze by yet to be identified gunmen who came in large numbers.\nBlueprint learnt that the Administrative Office, that of the Divisional Police Officer (DPO), and the reception were touched during the attack which also witnessed the release of some of the detainees.\nUnfortunately for the escaping detainees, about three of them were caught by the local government vigilante who took them back to custody.\nCommenting, the Chairman, Interim Management Committee(IMC) of the LGA, Pastor Bede Ikeaka, said he was shocked at the incident.\nWhen asked to speak on the matter, the Imo Police Command’s spokesman, CSP Mike Abattam, said he had not been briefed."
  },
  {
    "headline": "Omicron Is Not ‘Mild’, Kills People Like Other Variants – WHO",
    "summarized_story": "The Omicron variant of Covid-19 is killing people across the globe and should not be dismissed as mild, the World Health Organization insisted Thursday.\n“While Omicron does appear to be less severe compared to Delta, especially in those vaccinated, it does not mean it should be categorised as mild,” Tedros told a press conference.\n“Just like previous variants, Omicron is hospitalising people and it is killing people,” he explained.\nIn facing the more transmissible Omicron variant, Van Kerkhove urged people to step up the measures they were already taking to protect themselves against the virus.\n[READ ALSO] COVID-19: Election Rallies Cancelled As India Sees Omicron Surge“Do everything that we have been advising better, more comprehensively, more purposefully,” she said."
  },
  {
    "headline": "950 Terrorists, 537 Bandits Killed In Seven Months – DHQ",
    "summarized_story": "The Defence Headquarters on Thursday said 950 terrorists including high-profile commanders and emirs between May 20, 2021, and January 6.\nIt also said in the period under review, a total of 537 bandits and other criminal elements, including two key bandits’ leaders in Zamfara State, namely Alhaji Auta and Kachalla Ruga, were neutralised.\nHe said Nigerian troops also rescued about 1,000 kidnapped civilians and recovered assorted weapons from the criminal elements.\n“Within the period under review, own troops operational activities resulted in the neutralisation of 950 terrorists including their high profile commanders and amirs.\nThe total of 537 armed bandits and other criminal elements were neutralised in action by own troops.”"
  },
  {
    "headline": "‘We Cannot Release Him,’ Buhari Says Nnamdi Kanu Should Defend Himself In Court",
    "summarized_story": "President Muhammadu Buhari has ruled out the option of pardoning the leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu.\nFor those who are saying that we should release him, no we cannot release him.\nApart from the trial of the IPOB leader, the President also spoke about a number of burning issues including security, economy, and politics, among others.\nSo, in that respect, we have done something,” President Buhari asserted.\nHe went on to defend his government’s decision to source loans from China, saying anyone willing to help Nigeria’s infrastructure was welcome."
  },
  {
    "headline": "FG Formally Declares Bandits As Terrorists",
    "summarized_story": "The Federal Government has formally declared bandit groups operating in the country as terrorists.\nThe declaration titled ‘Terrorism (Prevention) Proscription Order Notice, 2021 is contained in Volume 108 of the Federal Republic of Nigeria Official Gazette.\nGovernors, the National Assembly, state legislators, lawyers and several groups were among those who made calls for bandits to be declared as terrorists.\nRuling on the motion in November, Justice Taiwo Taiwo declared bandits as terrorists.\nHe specifically held that activities of Yan Bindiga and Yan Ta’adda bandit groups, constitute acts of terrorism."
  },
  {
    "headline": "Trump ‘Tried To Prevent Peaceful Transfer Of Power’ – Biden",
    "summarized_story": "US President Joe Biden accused his predecessor Donald Trump Thursday of attempting to block the democratic transfer of power on January 6, 2021, after losing the presidential election.\n“For the first time in our history, a president not just lost an election; he tried to prevent the peaceful transfer of power as a violent mob breached the Capitol,” Biden said in a speech marking the first anniversary of the attack on the US Congress.\n“He’s done so because he values power over principle because he sees his own interest as more important than his country’s interest,” Biden said.\nBiden said the United States and much of the world is locked in a battle between democracy and autocracy.\n“I will allow no one to place a dagger at the throat of democracy,” Biden said at the Capitol."
  },
  {
    "headline": "We are not involved in war of words over insecurity",
    "summarized_story": "The All Progressive Congress APC loyal to Senator Kabiru Marafa in Zamfara state has distance self from the recent allegation by the Matawalle’s led Faction of the party that some members of the PDP owns over seventy percent of all mining sites in the state“We seek to be counted out of this madness” The Marafa’s Faction saidA press statement signed by the spokesperson of Senator Marafas-led faction Bello Bakyasuwa Maradun under the Chairmanship of Sirajo Garba Maikatako condemns the allegation and consider it baseless, careless and irresponsible“Our understanding of the formation and character of the three factions of APC in the state vis-a-vis the contents of the briefing from which the reports were developed point to the action as a product of the crafty government faction that depends on blackmail, propaganda and witch-hunt to survive” he added“We are obliged by statements like this to call on the media to do well by indicating clearly the faction of APC from where they sourced the content of their publications”Zamfara State now has three factions of APC namely Former Governor Yari-led faction, Senator Marafa-led faction and that of Governor Bello Matawalle-led factionThis is due to the internal Crisis rocking the party since the build up of the 2919 General Elections“Unless the dispute is settled by competent court of law or acceptable consensus, we want to appeal to the professional standing of the media to properly label reports with their relevant factions to avoid misguided attributions” Bakyasuwa urges the mediaThe Marafa’s Faction also appeal to Governor Bello Matawalle, to minimize his local and international trips and avail self in the state to focus on supervising the various operations of the Nigerian Military against the bandits.\n“We are particularly worried that while these operations were going on, the Governor was outside the country attending the traditional wrestling events in Niger Republic.\nThese and the abysmal absence of developmental projects in the state are not in tendem with the principles and ideals of APC that we know as founding members”"
  },
  {
    "headline": "Buhari receives briefing from ex-President Jonathan over Mali crisis -",
    "summarized_story": "Former President Goodluck Jonathan has disclosed that a special meeting of ECOWAS will hold in Ghana, this Sunday, to deliberate on the political situation in Mali.\nHe made this known at a parley at State House, Abuja, Thursday when he met President Muhammadu as the Head of the ECOWAS Mediation Team.\nPresident Buhari repeated his earlier avowal that whatever Nigeria would do on the Mali situation would be done within the ambit of ECOWAS."
  },
  {
    "headline": "Ladoja breaks silence, says Lekan Balogun is next in line to Olubadan -",
    "summarized_story": "The Osi Olubadan of Ibadanland and former governor of Oyo State, Rashidi Ladoja, has described the controversy trailing succession to the throne of Olubadan is needless.\nEgbon Lekan Balogun is the most senior in our line and so he is the next in line to the throne.\n“For those asking, my ‘body and mouth language’ is that Egbon Lekan is my senior and he is next in line to the Olubadan stool.\nTwo weeks after we started the case, Egbon Balogun said he was no longer interested in the case.\nLadoja is the second most senior chief in the Civil Line that is to produce the next Olubadan of Ibadan, following the death of Oba Saliu Adetunji."
  },
  {
    "headline": "Olubadan: Obasanjo pays condolence visit to Oyo gov",
    "summarized_story": "A former Nigerian president, Olusegun Obasanjo has commiserated with Governor of Oyo state, Seyi Makinde over the death of the Olubadan, Oba Saliu Adetunji.\nHe prayed that the family of the deceased monarchs be consoled and the soul of the late traditional rulers be granted eternal rest.\nIn his remark, the Deputy Governor of Oyo state Rauf Olaniyan who represented the Governor of Oyo state appreciated the former president for his kind gesture, describing him as an elder statesman who has the interest of his people at heart.\nIt’s a tag all over your body, and that tag brought you down here even at your age, he said.\nOlusegun Obasanjo was accompanied by a former secretary to the Oyo state government, Olayiwola Olakojo, and a highly respected socialite, Otunba Oyewole Fasawe."
  },
  {
    "headline": "Buhari Says He Has Done His Best For Nigeria And Not Expecting Appreciation – Trending With Ojy Okpe",
    "summarized_story": "The President also stated that he is not expecting any appreciation from Nigerians; but hopes that when his administration ends in 2023, Nigerians will recognise that he has served to the best of his abilities.\nSamuel Ortom, governor of Benue State, on Thursday; asked President Muhammadu Buhari to declare the Miyetti Allah Cattle Breeders Association; otherwise known as MACBAN, a terrorist organisation.\nThe Governor’s call is coming after the federal government gazetted an order designating bandits as terrorists.\nOrtorm stated, that the security challenges in the nation will only be adequately addressed, if a similar position is taken on the Miyetti Allah Kautal Hore…MACBAN, and the Fulani Nationality Movement otherwise known as FUNAM.\nThe Governor claims, that these groups have vowed; and have continued to cause mayhem in Benue State and other parts of the country because of the anti-grazing laws."
  },
  {
    "headline": "George Obiozor: IPOB Doesn’t Speak for Igbos",
    "summarized_story": "Professor George Obiozor discussed the president’s unyielding opposition to restructuring and how Nigerians can remedy this by choosing a successor in 2023 that is more in tune with the yearnings of the people.\nHe also spoke on the chances of an igbo presidency"
  },
  {
    "headline": "Nigeria: Entrenched APC Interests Desperate to Blackmail Me, Governors’ Chairman Fayemi Says",
    "summarized_story": "Ekiti State Governor and Chairman of the Nigeria Governors’ Forum (NGF), Dr. Kayode Fayemi, has disclosed that there are some entrenched interests desperately seeking to defame and blackmail, because of the 2023 presidential run, a decision he claimed he never told anyone he was interested.\n“For the avoidance of doubt, Dr. Fayemi, has not told anyone that he is in the race for the Presidency of Nigeria.\nHe has always maintained that he is on duty in Ekiti and would like to concentrate on that assignment.\nWhat he does afterwards is in the hands of God and he will cross that bridge at the appropriate time.\n“Some entrenched interests within the ruling All Progressives Congress, however, seem uncomfortable with the rising profile of the NGF Chairman and have resorted to cheap blackmail aimed at de-marketing him."
  },
  {
    "headline": "Shell Places More Onshore Assets in Nigeria for Sale",
    "summarized_story": "Royal Dutch Shell has placed more of its onshore oil assets in Nigeria for sale with at least five Nigerian oil and gas companies preparing to submit their respective bids for the acquisition of the assets this month.\nThe deal was estimated to fetch up to $3 billion, Reuters quoted three sources involved in the process to have said.\nShell operates SPDC (Shell Petroleum Development Company of Nigeria) and holds a 30 per cent stake in the venture.\nNNPC could also choose to exercise its right to pre-empt any sale to a third company, the sources said.\nThey said it was unclear whether potential bidders could raise sufficient funds as many international banks and investors have become wary about oil and gas assets in Nigeria due to concerns about environmental issues and corruption."
  },
  {
    "headline": "Nigeria: Benue Governor Ortom Wants Miyetti Allah, Fulani Movement Declared as Terrorist Groups",
    "summarized_story": "The Benue State Governor, Samuel Ortom, applauded the Buhari administration for heeding his appeal and finally declaring bandits terrorists.\nBut the Governor ofcthe North-Central Nigeria state said the president must be bold enough to move a step further to also label some well known violent Fulani groups as terrorists.\n“For us in Benue State, the law has come to stay.\nIn fact, we have maintained our position that Benue State has no grazing routes, reserves or areas whatsoever.\nIf anyone has failed, it is the Buhari-led APC federal government that has failed by taking Nigeria from top to bottom."
  }
]