[
  {
    "headline": "UNICEF demands release of abducted Niger students",
    "summarized_story": "The United Nations International Children Educational Fund has expressed concerns over the fate of about 150 students abducted from the Salihu Tanko Islamiya School in Tegina, Rafi Local Government Area of Niger State and called for their immediate and unconditional release.\nThe Deputy Country Representative of UNICEF Nigeria, Rushnan Murtaza, made the appeal in a statement titled, ‘UNICEF demands immediate release of 150 abducted students of Salihu Tanko Islamiyah School,’ made available to journalists on Monday.\nThe statement read, “We are appalled that two weeks after 150 students were abducted from their school, they continue to be held by their abductors.\n“Schools must be safe places to study and develop, and learning should not be a risky endeavour.\nThere are very few – if any – things more important for any society than ensuring the safe education of its children.”"
  },
  {
    "headline": "Teenager reports father to police over alleged defilement",
    "summarized_story": "A 14-year-old girl (name withheld) has reported her father to the men of the Lagos State Police Command for allegedly defiling her.\nIt was gathered that the incident happened in the Ikorodu area of the state and police operatives attached to Ipakodo Division, Ikorodu, have since arrested the teenager’s father, one 45-year-old Kayode Adeyanju.\n“The survivor personally reported the case at Ipakodo Police Station, Ikorodu on the 7th June, 2021, after her horrible ordeal in the hands of her father and the police operatives arrested the suspect.\n“The suspects include Hameed Salami, m, 35; Ogunlade Adewale, m, 30; Sunday Ogbemudia, m, 36; Okekunle Segun, m, 26; Imole Kingsley, m, 23; Rasak Lekan, m, 26; and Osuya Innocent, m, 23.\nItems recovers from them include one locally made pistol, two live cartridges, one axe, assorted charms,” the statement added."
  },
  {
    "headline": "Secondus issues Ayade quit notice, says PDP’ll restore freedom of Nigerian youths",
    "summarized_story": "He made the disclosure during the official Inauguration of Caretaker Committee and unveiling of new party state secretariat( annex) on Monday in Calabar .\nSecondus said: “PDP is the party of the future.\nWe are coming to restore the freedom of Nigerians especially the youths.\n” This is a quit notice to gov Ayade ,he should begin to pack his load and we also know that he is regretting joining the APC because more governor’s are joining the 14 PDP governors from the ruling APC,” he said .\nOther governor’s and members who were present at the inauguration include ,former Senate President ,Bukola Saraki , Akwa Ibom state governor ,Udom Emmanuel , Chairman PDP governors forum ,Aminu Tambuwal , Former governor of Anambra state,Peter Obi amongst others ."
  },
  {
    "headline": "Death toll from cholera hits 37 in Bauchi as govt declares free treatment",
    "summarized_story": "By Charly Agwam – BauchiAt least 37 people have died from cholera-related diseases since the outbreak of cholera was declared in Bauchi state last month.\nAccording to the Executive Chairman of the Bauchi State Primary Health Care Development Agency (BASPHCDA), Dr Rilwanu Mohammed, Bauchi state, to date, has recorded a total of 1,799 cholera cases.\nDr. Mohammed said that Alkaleri, Bauchi, Darazo, Dass, Ganjuwa and Giade, Jama’are, Kirfi; Misau, Ningi, Shira, Tafawa Balewa, Toro, Warji and Zaki are the areas affected by the disease in the state.\nThe Chairman appealed to residents of the state to keep their water and surroundings clean and report any suspected cholera case to the nearest health centre.\nRecall that 20 people died from the disease out of 322 people that were affected when the outbreak was first reported."
  },
  {
    "headline": "Anambra guber: APGA clears Soludo, Okolo, Ibe, disqualifies five others",
    "summarized_story": "By Chris Ochayi, ABUJAAhead of the November 6 governorship election, the All Progressives Grand Alliance , APGA, has cleared a former governor of Central Bank of Nigeria, CBN, Prof. Charles Chukwuma Soludo, Damian Okolo, ThankGod Ibe and Ezenwankwo Okwudili Ewepudike as the party aspirants for the Anambra State governorship primary election.\nThe party has also disqualified Hon Chuma Umeoji, Nze Akachukwu Nwankpo, Cater Dike Umeh, Hon Nonso Smart and Ozoka Odera Ifeanyi.\nHe said the decision of the screening committee was liable to veto by the National Working Committee, NWC, of the party, which is the final authority in terms of the eligibility of aspirants.\nNo reason was however given as to why the five aspirants were disqualified from participating in the parry’s primary election.\nVanguard News Nigeria"
  },
  {
    "headline": "2023: How South can get Presidency",
    "summarized_story": "The Northern leaders further stated that politics had to do with negotiations and convincing others why they should vote for a particular person or group.\n“Politicians and tribal leaders who think they can extract concessions or advantages using threats forget that Nigerians are already bleeding from all forms of threats and violence.\nHowever, it is laughable that politicians and tribal leaders should be making such threats in the 21st century.\n“Well, even the presidency has said the unity of Nigeria is not negotiable but we say everything is negotiable.\nBut if our brothers in the South and Middlebelt regions rather than negotiating are threatening secession, then their demands won’t work."
  },
  {
    "headline": "Robbers escape with wounds as Kaduna Police foils robbery attack",
    "summarized_story": "By Ibrahim WuyoOperatives of the Kaduna Police Command have foiled a robbery attack in the Tudun Wada area and recovered ammunition and an operational vehicle.\nHe said in view of the report, the Police patrol team were immediately dispatched to the area.\nAlso Read: Cross River gov, Ben Ayade, defects to APC“The hoodlums on sighting the Police patrol vehicle, started shooting berserkly.\nThe Officers involved were very tactical in response and their operational sagacity succeeded in repelling the attack.\nThe Command therefore, requested for information about any person(s) found with bullet wound(s) ,adding that such should be reported to the Police for immediate action."
  },
  {
    "headline": "UNICEF calls for unconditional release of 150 Tsangaya pupils kidnapped in Niger State",
    "summarized_story": "UNICEF on Monday called for the immediate and unconditional release of 150 Tsangaya pupils abducted at the Salisu Tanko Islamiya school in Tegina, Rafi local government Area of Niger State in north-central Nigeria.\nThe UN agency in a statement said it is worried about the fate of the children, some of whom are as young as three years.\n“We are appalled that two weeks after 150 students were abducted from their school, they continue to be held by their abductors,” said Rushnan Murtaza, Officer in Charge, Representative UNICEF Nigeria.\n“Schools must be safe places to study and develop, and learning should not be a risky endeavour,” said Rushnan Murtaza.\n“There are very few – if any – things more important for any society than ensuring the safe education of its children.”"
  },
  {
    "headline": "Fear grips Imo residents as SARS allegedly resurfaces in Owerri",
    "summarized_story": "There is palpable fear in Owerri, the Imo State capital, as the disbanded Special Anti-Response Squad (SARS), had gradually taken over the streets of Owerri.\nDAILY POST reports that the dreaded SARS officers are seen at various junctions and checkpoints in Owerri, causing terror and fear to Imo residents.\nInsecurity: South-East gradually becoming North-East – Shehu SaniHowever, cab drivers and pedestrians alike in Owerri, have taken alternative routes to their destination for fear of being confronted.\nTruly, Imo State is in trouble.”It would be recalled that youths of Imo State and Nigeria at large, recently took to streets protest the brutalization and intimidation of the SARS officers, calling for their disbandment.\nEnd SARS: 5 years after, police to exhume body of man who died in Ogun SARS custody"
  },
  {
    "headline": "JAMB extends 2021/2022 registration deadline",
    "summarized_story": "The Joint Admissions and Matriculation Board, JAMB has announced another extension of 2021/2022 Unified Tertiary Matriculation Examination, UTME registration deadline.\nDr. Benjamin said the extension was to enable candidates who were yet to complete their registration due to some hitches before the previous deadline elapsed, to do so.\nJAMB puts candidate registration exercise on holdHe urged the affected candidates to visit any specially designated registration centres on Tuesday, June 15, to finish the process.\nDAILY POST reports that JAMB had extended 2021/2022 twice to enable all prospective candidates to participate in the exercise.\n2021 UTME: JAMB begins registration, gives date for exam"
  },
  {
    "headline": "Do everything to halt killings, kidnap of innocent citizens- Ezendigbo in Oyo tells Buhari",
    "summarized_story": "The Ezendigbo of Oyo State, Dr. Alex Anozie, has asked the Federal Government to without delay, stop the killing of innocent citizens across the country.\nOur correspondent recalls that Nigeria had in the last few months witnessed a series of security breaches occasioned by kidnapping, killing of innocent citizens and attacks of innocent citizens by bandits, suspected Fulani herdsmen and armed robbers.\nTension as herdsmen allegedly target more local govts in OyoAnozie urged Buhari to do everything possible to address security challenges facing the country.\nIn a statement made available to DAILY POST in Ibadan, Anozie urged Buhari to ensure that there is justice and equity in the country.\nHe also advised the federal government to engage traditional rulers to solve security challenges facing the country."
  },
  {
    "headline": "Bandits kill 12 in Sokoto, block highway for operations in Zamfara",
    "summarized_story": "No fewer than twelve persons have been killed by armed bandits in Maikujera in Rabah Local Government Area of Sokoto State.\nIn a press statement signed and made available to newsmen in Gusau, Zamfara State, the Police Public Relations Officer, ASP Sanusi Abubakar, said the incident happened around 4:30pm on Thursday.\nJUSUN, NBA block Osun Deputy Gov’s convoy during protestASP Abubakar, however, said nobody was abducted by the bandits.\nMeanwhile, some gunmen suspected to be bandits were said to have blocked Sokoto-Gusau road on Sunday.\nThe Zamfara State Police Command’s Spokesman, SP Mohammed Shehu confirmed the attack."
  },
  {
    "headline": "Denrele Edun gets surprise Lexus SUV gift on 40th birthday",
    "summarized_story": "By Ekaete BasseyPopular entertainer, Denrele Edun, has been surprised with a brand new Lexus SUV for his 40th birthday.\nThe eccentric media personality clocked 40 on Sunday, June 13, 2021, and was treated to a grand surprise by his ride-or-die friends.\nThe media personality took to his Instagram page to share the video showing the moment he was led to the park where the brand new car laced with ribbons had been parked.\nIn his caption, Denrele acknowledged his loyal friends for all the wonderful surprises he received noting that his 40th birthday celebration left him absolutely stupefied.\nADVERTISEMENTHe wrote:SEE BIRTHDAY GIFTS OOOOOO!"
  },
  {
    "headline": "BREAKING: Boko Haram/ ISWAP frees UN staff, nine others",
    "summarized_story": "The insurgents alleged to have dressed in military uniforms mounted a roadblock on the highway with three Hilux vans and motorcycles.\nExecutive Director of Yobe State Network of Civil Society, Abubakar Baba Shehu, who also confirmed the release, prayed for more captives to be freed.\nADVERTISEMENT“I was together with someone who called a family member of Alooma and he has confirmed the release of his brother.\nThis is encouraging news and we pray that more captives should be released soon,” Baba Shehu said.\nMeanwhile, friends of the freed captives have taken to facebook and other social media platforms to celebrate the release of their friends from Boko haram captivity."
  },
  {
    "headline": "Toyin Abraham thrilled over latest movie",
    "summarized_story": "By Ekaete BasseyNollywood actress Toyin Abraham is super excited about her latest achievement with her most criticized movie ‘Fate of Alakade: The Party Planner.’In a post shared on her Instagram page, the actress, while expressing appreciation to the cast and crew of the project, said the movie is now showing on United Airline’s International flights.\nAccording to the mother of one, the creativity and energy of the cast and crew in the movie show that working with the right minds pays.\nREAD ALSO: Toyin Abraham praises husband after avoiding a kiss on setSharing an excerpt from the movie, the film star captioned post;ADVERTISEMENT“Hello, #Toyintitans!\nAgain, let me utilize this opportunity to thank the cast and crew of this great project.\nI also thank my Distributors @filmoneng for the tremendous work they have done in harnessing the potential of this film."
  },
  {
    "headline": "Six suspects allegedly killed as new security outfit storms Anambra",
    "summarized_story": "By Nwanosike Onu, AwkaTension has heightened in Anambra State following the alleged arrival of an orthodox security outfit to help other security agencies to rid the State of cultist and other criminal elementsThe “Bakassi -like” security outfit has allegedly, killed and burnt Six suspects in Awka.\nThe killings and burning of the suspects happened Monday, as fear gripped residents.\nWhen contacted, the State Police Public Relations Officer, Ikenga Tochukwu, said what The Nation gave him was an information.\nRead Also: PDP suspends Ward congresses in AnambraHe said, “I don’t have any of such details before me.\nADVERTISEMENTAccording to the source, “that’s the only thing I can tell you for now, let’s see how things work out in days and weeks to come."
  },
  {
    "headline": "Uproar over plan to reopen grazing route",
    "summarized_story": "As far as the Northern Elders Forum (NEF) is concerned, reactivating open grazing routes may cause legal and security problems.\n“The reactivation of open grazing routes in southern part or any other parts of the country is problematic both in legal terms and security.\nThe Federal Government can actually sue governors that ban open grazing and the court will rule whether they are right or wrong.\nAt what time in our history did our founding fathers gather to designate specific routes from the north to the south as ‘grazing routes’?\nSince most governors in the country have outlawed open grazing in their respective states, on which land does the Federal Government want to ‘open’ or ‘re-open’ its vaunted grazing routes?"
  },
  {
    "headline": "Insecurity: Don’t abdicate your responsibility, Masari tells Buhari",
    "summarized_story": "From Agaju Madugba, KatsinaKatsina Governor, Aminu Bello Masari, has faulted President Muhammadu Buhari on reasons for worsening insecurity in the country.\nBut citing Constitutional provisions, Masari said it was wrong for anybody to blame states and local governments.\nWhen you look at the Constitution of the Federal Republic of Nigeria, the issue of security is under the Exclusive List.\n“From the local governments, we assist the police, the DSS, the NSDC.\nIf you devolve, states and local governments will have more financial independence."
  },
  {
    "headline": "Buhari, APC must address separatist agitations, not use of military –Odigie-Oyegun",
    "summarized_story": "From Romanus Ugwu, AbujaFormer national chairman of the All Progressives Congress (APC), Chief John Odigie-Oyegun, has asked President Muhammadu Buhari and the ruling party to address the separatist agitations in the country through democratic means instead of deployment of military.\nHe said the fact that things are bad and people hungry and angry was not questionable, saying that these were worldwide phenomenon.\nHowever, Odigie-Oyegun decried the current security challenge in the country.\n“It is my hope that we will begin to get control of the security of this nation,” he said.\nThe executive of the party, the NWC, the Caucus, the NEC which is the highest organ of the party."
  },
  {
    "headline": "NRC begins Lagos-Ibadan service tomorrow",
    "summarized_story": "Nigerian Railway Corporation (NRC) says it will begin full operation of the standard gauge railway service from Lagos to Ibadan tomorrow.\nThe company stated this, yesterday, in a statement by its Lagos District Manager, Mr Jerry Oche, assuring that as from Tuesday (tomorrow) morning the Lagos – Ibadan train services will be available to the public.\n“Lagos to Ibadan takes off at 8am from Mobolaji Johnson Station at Alogomegi, Ebute Meta Lagos, while the train will depart Ibadan to Lagos at 8am from Obafemi Awolowo Station at Moniya.\nLagos to Ibadan ia at 4pm from Mobolaji Johnson Station Alagomji, while from Ibadan to Lagos is by 4pm from Obafemi Awolowo Station at Moniya.\nHe said the Alagomeji, Abeokuta, and Moniya remained the stop stations of the Lagos Ibadan train services."
  },
  {
    "headline": "Twitter ban: Govt officials, others switch to Indian app, Koo",
    "summarized_story": "By Lukman OlabiyiFollowing the ban on US microblogging platform, Twitter, the Federal Government, President Muhammadu Buhari, Vice President Yemi Osinbajo, and public office holders have switched to Indian App, Koo.\nApart from Federal Government officials that are already active on the new platform, some state governments officials have also discarded their Twitter accounts and switched to Koo.\nThe verified account of the Federal Government on the app is @Nigeriagov, and it has over 20 posts.\nPresident Buhari who also joined the new app in June already has 7, 374 followers and following none.\nAhmad, the president’s aide on new media, was already getting closer to hitting 10, 000 followers."
  },
  {
    "headline": "Amaechi: Buhari’s Visit Has Shown Apapa Port’s Problem is Inefficiency",
    "summarized_story": "He also said that terminal operators must contribute to the total reconstruction and reorganisation of the Apapa Seaport.\nHe said: “What I’ve done, was to have a meeting with the terminal operators, and I told them that they have to contribute to the reconstruction of the Apapa Seaport.\nHe stressed that, “before we came, various contractors were contracted to provide security for oil companies in the water.\nSo, we are able to provide security in the coastal region, both on land and on the sea.\nThat’s the impact it will have when it comes to the Deep Blue project."
  },
  {
    "headline": "States Unveil Plans to Implement Financial Autonomy for Legislature, Judiciary",
    "summarized_story": "Our ReportersStates have unveiled strategies to implement the Memorandum of Action (MoA) to ensure financial autonomy for the legislature and judiciary, THISDAY has learnt.\nEbonyi State Chairman of PASAN, Mrs. Uche Edene, told THISDAY that the state had gradually started the implementation of the financial autonomy even before the strike started.\nShe stated that the state had enacted Fund Management Law in 2016 which gave birth to the State House of Assembly Commission.\nAminu Masari, said the state government had concluded plans to inaugurate SAAC and State Assembly Service Commission in order to enable the two arms of government to receive their statutory allocations directly from the federal government.\nSpokesman of the Speaker of the Kaduna State House of Assembly, Mr. Ibrahim Danfulani, said the lawmakers would debate the issue this week."
  },
  {
    "headline": "N’Assembly to Conclude Constitution Review by July",
    "summarized_story": "Deji Elumoye in AbujaThe two chambers of the National Assembly are poised to pass the bill for the alteration of 1999 Constitution as altered before proceeding on annual break in July.\nTowards the early passage of the bill, the National Assembly committees working on the bill will conclude their assignments and present the bill for clause-by-clause consideration before the lawmakers proceed on annual recess in July.\nAlready, the constitution review committees of both the Senate and House of Representatives are collating reports from the zonal public hearings held last month across the six geo-political zones.\nThe Senate Ad-hoc Committee on Constitution Review, headed by the Deputy President of the Senate, Senator Ovie Omo-Agege, and that of the House of Representatives, headed by Deputy Speaker, Hon.\nIdris Wase, had in May held public hearings in 12 cities, at the rate of two per each of the six geo-political zones."
  },
  {
    "headline": "Report: $15bn Investments Lost Annually to Non-passage of PIB",
    "summarized_story": "“Its delay has sparked a great deal of uncertainty and led to an estimated loss of over $15 billion annually in lost investments to Nigeria’s oil and gas industry.\nOPEC: Nigeria’s Oil Production Hit Record Low in MayMeanwhile, Nigeria’s crude oil production output hit record low levels in May, the June Monthly Oil Market Report (MOMR) of the Organisation of Petroleum Exporting Countries (OPEC), has shown.\nThe monthly report indicated that in the first quarter of 2021, Nigeria’s average production was 1.410 million barrels per day.\nThe country’s average crude oil production based on secondary sources was 1.78 Mbpd in 2019 and 1.57mbpd in 2020, while total OPEC 13-member crude oil production averaged 25.46 mb/d during May.\nThe OPEC report showed that Africa’s demand for crude oil was 3.43 million bpd in 2019, which fell to a 4.37million bpd in Q1, 2020."
  },
  {
    "headline": "Oyegun: FG Must Prioritise Restructuring for Nigeria’s Survival",
    "summarized_story": "The former Edo State governor said it was vital that these issues should be addressed as the country cannot continue to allow the subject to become a recurring threat.\nAlso, National Leader of APC, Senator Bola Tinubu, said the public perception of President Muhammadu Buhari had changed after his interview with ARISE NEWS Channel.\nHe added that the face-off between Odigie-Oyegun’s successor, Mr. Adams Oshiomhole, and Edo State Governor, Mr. Godwin Obaseki, was a collateral damage for the party.\nAccording to him, the forces of economics have made things, not quite the way the party wanted them to be.\nIt must be mandatory in the interest of the survival of our nation, that these issues be addressed."
  },
  {
    "headline": "All Progressives Congress Party Supporters Publicly Display Guns, Cutlasses Ahead Of Saturday’s Bye–Election In Jigawa",
    "summarized_story": "Some supporters of the All Progressives Congress (APC) in Jigawa state have vowed to attack members of the opposition ahead of Saturday’s bye-election for the Gwaram Federal Constituency of state.\nIn a video seen by SaharaReporters, the members, chanting the name of the APC candidate, Yusuf Galambi were seen with guns, cutlasses and other different weapons.\nThe Independent National Electoral Commission (INEC) had fixed June 19 for the poll.\n“Consequently, the commission has fixed Saturday, 19th June, 2021 for the conduct of bye-election to fill the vacant seat for the said constituency in the House of Representatives,” INEC had said in a statement.\n“The official notification for the election will be published on 17th May 2021."
  },
  {
    "headline": "All Progressives Congress Party Supporters Publicly Display Guns, Cutlasses Ahead Of Saturday’s Bye–Election In Jigawa",
    "summarized_story": "Some supporters of the All Progressives Congress (APC) in Jigawa state have vowed to attack members of the opposition ahead of Saturday’s bye-election for the Gwaram Federal Constituency of state.\nIn a video seen by SaharaReporters, the members, chanting the name of the APC candidate, Yusuf Galambi were seen with guns, cutlasses and other different weapons.\nThe Independent National Electoral Commission (INEC) had fixed June 19 for the poll.\n“Consequently, the commission has fixed Saturday, 19th June, 2021 for the conduct of bye-election to fill the vacant seat for the said constituency in the House of Representatives,” INEC had said in a statement.\n“The official notification for the election will be published on 17th May 2021."
  },
  {
    "headline": "Ex-Presidential Aspirant, Adamu Garba’s Crowwe Has Been Deleted From Play Store",
    "summarized_story": "A former Presidential aspirant, Adamu Garba, who also doubles as the CEO of IPI Solutions, had launched the Crowwe app in October 2020 during the #EndSARS protest.\n“This is the best opportunity to grow Nigeria to Build Nigeria, Crowwe to the World.”Join Crowwe now!\nThis is the best opportunity to grow Nigeria to Build Nigeria, Crowwe to the World.\nBy removing our democratically elected President’s speech to the people of Nigeria, Twitter needs to shut down from Nigerian internet space.\nThe app has since received terrible reviews which could be responsible for its disappearance on the play store app."
  },
  {
    "headline": "Ex-Presidential Aspirant, Adamu Garba’s Crowwe Has Been Deleted From Play Store",
    "summarized_story": "A former Presidential aspirant, Adamu Garba, who also doubles as the CEO of IPI Solutions, had launched the Crowwe app in October 2020 during the #EndSARS protest.\n“This is the best opportunity to grow Nigeria to Build Nigeria, Crowwe to the World.”Join Crowwe now!\nThis is the best opportunity to grow Nigeria to Build Nigeria, Crowwe to the World.\nBy removing our democratically elected President’s speech to the people of Nigeria, Twitter needs to shut down from Nigerian internet space.\nThe app has since received terrible reviews which could be responsible for its disappearance on the play store app."
  },
  {
    "headline": "Ex-Presidential Aspirant, Adamu Garba’s Crowwe Has Been Deleted From Play Store",
    "summarized_story": "A former Presidential aspirant, Adamu Garba, who also doubles as the CEO of IPI Solutions, had launched the Crowwe app in October 2020 during the #EndSARS protest.\n“This is the best opportunity to grow Nigeria to Build Nigeria, Crowwe to the World.”Join Crowwe now!\nThis is the best opportunity to grow Nigeria to Build Nigeria, Crowwe to the World.\nBy removing our democratically elected President’s speech to the people of Nigeria, Twitter needs to shut down from Nigerian internet space.\nThe app has since received terrible reviews which could be responsible for its disappearance on the play store app."
  },
  {
    "headline": "Amaechi: I'm not aware of Hadiza Bala Usman’s suspension",
    "summarized_story": "Rotimi Amaechi, minister of transportation, says he is not aware of the suspension of Hadiza Bala Usman as the managing director of Nigerian Ports Authority (NPA).\nAdvertisementOn May 5, President Muhammadu Buhari approved Usman’s suspension following a recommendation by Amaechi.\nAfter Usman’s suspension, Amaechi inaugurated an 11-member investigative panel to probe NPA over all contracts awarded since 2016 when Usman became its managing director.\nAdvertisementBut TheCable had exclusively reported that the administrative panel set up by Amaechi will now focus on “insubordination”.\nIn an interview with Arise TV on Monday, Amaechi denied knowledge of Usman’s suspension, saying she was only asked to “step aside” pending the conclusion of the probe on NPA."
  },
  {
    "headline": "Amaechi: I'm not aware of Hadiza Bala Usman’s suspension",
    "summarized_story": "Rotimi Amaechi, minister of transportation, says he is not aware of the suspension of Hadiza Bala Usman as the managing director of Nigerian Ports Authority (NPA).\nAdvertisementOn May 5, President Muhammadu Buhari approved Usman’s suspension following a recommendation by Amaechi.\nAfter Usman’s suspension, Amaechi inaugurated an 11-member investigative panel to probe NPA over all contracts awarded since 2016 when Usman became its managing director.\nAdvertisementBut TheCable had exclusively reported that the administrative panel set up by Amaechi will now focus on “insubordination”.\nIn an interview with Arise TV on Monday, Amaechi denied knowledge of Usman’s suspension, saying she was only asked to “step aside” pending the conclusion of the probe on NPA."
  },
  {
    "headline": "Edwin Clark: Buhari's insistence on open grazing unpatriotic… land belongs to states",
    "summarized_story": "Edwin Clark, an Ijaw national leader, says President Muhammadu Buhari’s insistence on open grazing is “unpatriotic and unacceptable”.\nAdvertisementClark argued that the Land Use Act vested land ownership in states on governors.\nRecently, the issue of open grazing has dominated the discourse on Nigeria’s political space, following the incessant clashes between farmers and herders.\nIn May, southern governors resolved to ban open grazing in their region — a decision that sparked divergent views.\n“I repeat, on behalf of southerners, that open grazing has been finally buried in southern Nigeria."
  },
  {
    "headline": "Edwin Clark: Buhari's insistence on open grazing unpatriotic… land belongs to states",
    "summarized_story": "Edwin Clark, an Ijaw national leader, says President Muhammadu Buhari’s insistence on open grazing is “unpatriotic and unacceptable”.\nAdvertisementClark argued that the Land Use Act vested land ownership in states on governors.\nRecently, the issue of open grazing has dominated the discourse on Nigeria’s political space, following the incessant clashes between farmers and herders.\nIn May, southern governors resolved to ban open grazing in their region — a decision that sparked divergent views.\n“I repeat, on behalf of southerners, that open grazing has been finally buried in southern Nigeria."
  },
  {
    "headline": "Soyinka: Buhari should stop exuding false confidence -- we want to see action",
    "summarized_story": "Wole Soyinka, Nobel laureate, says President Muhammadu Buhari should stop exuding false confidence and speak like a leader who is ready to take action concerning the country’s challenges.\nAccording to him, Nigeria is on the “edge”, and Buhari needs to move beyond mere talk, and take urgent action to set the country on the right path.\nAdvertisement“First of all, he should start talking to people like a leader — and a leader who is awake to the realities of the situation.\n“He’s got to stop exuding a false confidence, because that kind of confidence is totally false.\n“I appeal to people to stop putting words in my mouth."
  },
  {
    "headline": "Here are ten VPNs you can use in Nigeria",
    "summarized_story": "Virtual private networks (VPNs) have been around for a long time but have become more popular recently.\nExpress VPNExpressVPN is rated highly because of its very fast speeds across over 3,000 remote servers in 160 locations and 94 countries.\nUnlike NordVPN and ExpressVPN, the first subscription tier of ProtonVPN is its free VPN offering, which includes just three VPN server locations (Japan, Netherlands, and the US).\nWindscribe VPNJust like TunnelBear, Windscribe VPN has a free version and it gives 10GB free every month.\nWhich other VPNs do you use and what do you like or don’t like about them?"
  },
  {
    "headline": "Product policy managers are at the centre of Big Tech companies",
    "summarized_story": "The app is perfect for hyper-creative content creators who know their way around editing tools and special effects.\nHe uses animated videos to address sensitive topics and create content that is easy to digest and understand.\nPearlé: Watching TikTok videos inspires me to keep going and encourages me to do more at work.\nPearlé: For us, as product policy managers, we are at the centre of every company.\nBig tech companies still have a long way to go where product policy is concerned."
  },
  {
    "headline": "vivo V21 – Flagship smartphone with 44MP selfie camera to launch in Kenya",
    "summarized_story": "Days after unveiling its latest series of smartphones in Nigeria, Chinese tech company Vivo – often stylised as vivo – has said it plans to roll out the new V21 selfie flagship device in Kenya this month.\nThe move comes after vivo became the official smartphone brand of the ongoing UEFA™ Euro 2020 football tournament.\nV21 Specs; the world’s firstAccording to vivo, the V21 will be the first device globally to come with a 44MP selfie camera equipped with both Optical Imaging Stabilization (OIS) and Electronic Imaging Stabilization (EIS) technologies.\nThe camera will also be able to shoot 4K selfie videos, dual-view mode, and in slow motion.\nV21 is faster and better-lookingThe V21 will also sport a sleek, minimalist design in a thin body."
  },
  {
    "headline": "Top Three Nigerian Stocks for Sustainable Investors",
    "summarized_story": "They choose stocks of corporations known for fair and sustainable practices.\nSo, which stocks are sustainable?\nSterling BankThe sustainable policies of Sterling Bank allow it to prevent credit fraud and reduce its own carbon footprint.\nThese include The Nigerian Sustainable Banking Principles (NSBP), Equator Principles and theInternational Finance Corporations (IFC) Performance Standards.\nSustainable Investment in NigeriaThese are three examples of sustainable stocks in Nigeria."
  },
  {
    "headline": "Catalyst to Breakthrough: How Wema Bank Boosts Startups with Digital Innovations",
    "summarized_story": "Nigeria’s leading innovative and digital financial institution, Wema Bank, has become a main attraction for these categories of Nigerians due to its provision of accessible, seamless, timely and flexible digital services.\nResolved to become Nigeria’s financial institution of choice, Wema Bank has built several digital products and offerings like ALAT, Sara, Gender Loan Offering, Hackaholics, SME solutions and lots more.\nALAT by Wema, for instance, is Nigeria’s first digital bank that blazed the trail for others in the sector.\nIts Hackaholics, an initiative for tech startups is also a trailblazer by organizing trainings for businesses to solve societal challenges.\nThe Bank recently presented N2,187,500.00 to four startups for emerging as the winners during the Hackaholics Bootcamp 2.0."
  },
  {
    "headline": "Nigerian Exchange mulls insurance cover for dealer-related losses",
    "summarized_story": "The NGX Regulation, a wholly owned subsidiary of the Nigerian Exchange Group (NGX Group), in a commendable move seeks to engage a consortium of insurers to administer insurance to its Trading Licence Holders, the Nigerian Exchange Limited (NGX) and the Investors’ Protection Fund (IPF).\nInterestingly, all Trading Licence Holders of the Exchange will be required to take up the insurance product to be implemented by the consortium of insurance companies selected and/or approved by the Exchange and the Board.\nThe NGX maintains Investors’ Protection Fund in line with part XIV of the Investment and Securities Act 2007.\nIn carrying out its functions as a securities exchange, The Exchange has Trading Licence Holders who can buy and sell securities listed on The Exchange on behalf of the public.\nThe purpose of the Fund is to compensate investors who have suffered pecuniary loss as a result of situations reckless activities of trading licence holders."
  },
  {
    "headline": "New USSD rate may further encourage financial exclusion in Nigeria",
    "summarized_story": "By March 15, 2021, a new official fee set at N6.98 for USSD transactions was announced.\nThe USSD service is praised for being a game-changer in improving financial inclusion in the country.\nIn June 2020 alone, N390 billion in transaction value due to USSD service was recorded.\nThose in favour of the upward review of the service charge maintain a positive outlook for the new price era.\nIncremental charges on the service platform, especially at this time, can signal a moody user-provider atmosphere."
  },
  {
    "headline": "Residential, industrial real estate brighten sector outlook amid Covid-19",
    "summarized_story": "Though the real estate sector limped to the finish line of 2020 with bruises sustained from impact of Covid-19, the sector holds out promise for investors with residential and industrial facilities brightening its outlook for 2021.\nThe report compiled by a leading firm of estate surveyors and valuers, Ubosi Eleh + Co, notes that rising demand for these two segments of the real estate market is a fallout of the Covid-10 pandemic.\nOn the flipside, the fate that befell the office market turned a big boost to residential real estate because the pandemic offered opportunity to developers, more so as companies embraced the new normal, working virtually or remotely away from physical office building.\n“The lockdown and reduced economic activities were some of the reasons that accounted for the rise in demand in the residential market.\nThe 125-page annual report which also comes with prediction for 2021 highlights how Covid-19 pandemic affected economic activities including real estate in 2020, recalling that on March 20, 2020, the federal government’s travel restrictions took effect."
  },
  {
    "headline": "Edo Museum: US to return two Bronze pieces – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Metropolitan Museum of Art in New York City, United States, has said it will return two Benin Bronze from its collection to its place of origin, further boosting the prospects of American museums to repatriate looted art pieces to the Governor Godwin Obaseki-backed Edo Museum of West African Art (EMOWAA).\nThe two works to be returned are “Warrior Chief” and “Junior Court Official,” a pair of 16th-century brass plaques from the Oba Palace in Benin City.\nThe museum project is part of Governor Obaseki’s legacy for the state’s burgeoning arts and tourism space.\nDirector at the Met Museum, Max Hollein, in a statement, said “The retention of these works within Nigeria’s National Collections is critical to the well-being of the museum community and to fostering ongoing cooperation and dialogue between The Met and our Nigerian counterparts.”He added that the Museum was in support of the forthcoming Edo Museum of West African Art.\nErin L. Thompson, a professor of art crime at John Jay College, said “The Metropolitan is repatriating two artifacts stolen from Nigeria in the 20th century, but not the many other artifacts stolen from that territory in the 19th century in its collections.”“These artifacts — key parts of the sacred and political workings of the Kingdom of Benin — were taken during an orgy of violence intended to steal not just the kingdom’s treasures, but the kingdom itself,” She added."
  },
  {
    "headline": "2021 WNT Summer Series : Three takeaways from Nigeria’s thrilling 3-3 draw with Portugal – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Super Falcons drew against Portugal in their second game of the 2021 WNT Summer Series in Houston, Texas, USA in the early hours of Monday morning in Nigeria.\nThe Super Falcons improved in the second halfThe performance of the Super Falcons massively improved in the second half as they noticeably harried the Europeans into making mistakes.\nThe captain of the team Asisat Oshoala only joined the team on the morning of the game but still had a good game.\nUnited Falcons, Good Signs For The New GirlsThe way the Super Falcons celebrated their third goal against Portugal was great to witness.\nThis sends positive vibes to other players of Nigerian descent in diaspora who may have been contemplating whether to represent Nigeria or not."
  },
  {
    "headline": "World Donor Day: Obaseki hails donors, urges increased awareness to ensure stable supply of safe blood – Nigerian Observer",
    "summarized_story": "Obaseki gave the commendation in commemoration of this year’s World Blood Donor Day, with the theme; “Give blood and keep the world beating”, marked by the World Health Organisation (WHO), every June 14, across the globe.\nAccording to the WHO, “World Blood Donor Day aims to raise global awareness of the need for safe blood and blood products for transfusion and of the critical contribution voluntary, unpaid blood donors make to national health systems.\n“Safe blood and blood products and their transfusion are a critical aspect of care and public health.\n“To ensure that everyone who needs safe blood has access to it, all countries need voluntary, unpaid donors who give blood regularly.\nThroughout the COVID-19 pandemic, despite limited mobility and other challenges, blood donors in many countries have continued to donate blood and plasma to patients who need transfusion.”..."
  },
  {
    "headline": "ISIBOR EWUARE Install Pa. Obazee As Odionwere Amid Wide Jubilations – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEGOR – It was pomp and ceremony recently in Isibor Ewuare Village, Egor Local Government Area of Edo State as sons and daughters of the Village, both at home and in diaspora joined the elders of the town to install Pa. Imafodon Okhionkpamwonyi Obazee as Odionwere of Isibor Ewuare.\nThe installation event which was held under the cordiality of friendly atmosphere at the village witnessed wide jubilations amongst the people as they danced and sang praises of Pa. Obazee.\nWe are very ready to join hands with our new Odionwere to push for a better, purposeful and globally cherished Isibor Ewuare Village.\nOther top executive members of the village who reacted include Pa. Felix Igbinosun (Ozukpogieha); Pa. Ogieriakhi Okpugie ( Ozukpogieha); Pa. Anthony Aimufua (Ozukpogiene) and Mr. Stanley .O.\nHigh point of the ceremony was the commissioning of bohole donated to the people by Pa. Obazee."
  },
  {
    "headline": "Balogun advises African govts on root causes of performance shortfalls",
    "summarized_story": "ADVERTISEMENTMurtala Balogun, the Special Adviser to the President of the 74th Session of the UN General Assembly, has urged African governments to take the pulses of public agencies periodically to establish the root causes of performance shortfalls and the measures needed to enhance performance standards.\nIn a paper he presented at an online forum sponsored by the Rabat-based IAC-CAFRAD, he noted that before the onset of COVID-19, access to essential services had been restricted in many African countries.\nThe pandemic soon made a bad situation worse, what with its impact on business continuity, working hours, and supply chain blueprints.\nThis calls for periodic but proactive diagnoses of practices, processes, and attitudes in public as well as private sector agencies.\nHe further called on the Pan African Conference of Public Service Ministers and the African Union to collaborate with African Governments and select regional and international organizations on the establishment a Working Group on Agency Governance Research and Training."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Gov Okowa hails Okonjo-Iweala at 67",
    "summarized_story": "Delta State governor, Dr. Ifeanyi Okowa, has hailed the director-general of World Trade Organisation (WTO), Dr Ngozi Okonjo-Iweala on the occasion of her 67th birthday, describing her as a brilliant, competent, world-class economist and international development expert.\nIn a statement by his chief press secretary, Mr Olisa Ifeajika, in Asaba, the governor congratulated her as she clocks 67 years, stating that her works over the years had distinguished her internationally.\nOkonjo-Iweala, an illustrious Deltan from Ogwashi-Uku, is the first female director-general and first African to lead the global trade body in its 25-year history.\n“Proudly, your rich profile has continued to soar, and I recall that you were named ‘Euro-money Global Finance Minister’ in 2005 after you led Nigeria’s economy to exit foreign debt obligations during your first term under President Obasanjo.\nThese feats remain largely unprecedented till date,” he said"
  },
  {
    "headline": "Nigeria paid $642.43m foreign debt in Q1 2021 – DMO",
    "summarized_story": "Hence, external debt service payments fell to N126.02 billion (or $332.07 million) in the first quarter (Q1) 2021 from N170.60 billion (or $472.57 million) printed in Q1 2020.\nAccording to DMO, bilateral loan accounted for 12.73 per cent ($4.18 billion) of which loan from China (Exim Bank of China) was $3.40 billion and loan from France was $0.49 billion in Q1 2021.\nLocal debt stock increased by 10.71 per cent to N20.64 trillion in Q1 2021 (from N18.64 trillion in Q1 2020).\nFurther breakdown of the domestic debt figure showed that federal government (FG’s) domestic debt stock rose to N16.51 trillion in Q1 2021 (from N14.53 trillion in Q1 2020).\nDespite the significant rise in FG’s domestic loan, local debt service payment increased marginally by 0.59 per cent to N612 billion in Q1 2021 from N609.13 billion recorded in Q1 2020 amid a relatively low rate."
  },
  {
    "headline": "Access Bank plots N200bn digital loan growth with DBA Lite launch",
    "summarized_story": "Access Bank Plc., says it is planning to double the size of its digital loans to N200 billion at the end of the year with the launch of DBA Lite, a business solution targeted at youth entrepreneurs.\nThe Executive Director, Retail Banking of the bank, Mr. Victor Etuokwu, disclosed this at a press conference to announce the launch of the product.\nMore so, they stand a chance of enjoying access to information and training as well as business registration for intending young business owners among other value propositions.\n“Access Bank has always pride itself on being a facilitator of economic growth in the nation.\nAyodele Olojode, Group Head, Emerging Businesses, Access Bank, speaking, said: “What we are trying to do is to help the young entrepreneurs to leverage the digital skills that they have."
  },
  {
    "headline": "Dangote’s $2bn plant distributes 120 trucks of fertilizer daily",
    "summarized_story": "Dangote Urea fertilizer has finally begun nationwide sales, pushing out a minimum of 120 trucks per day across the countryThis is according to the Group Executive Director, Strategy, Capital Projects & Portfolio Development, Dangote Industries Limited, Mr. Devakumar Edwin.\nMeanwhile marketers and farmers in Kano have described the newly introduced Dangote Fertilizer as a game changer and a forecast for the expected agricultural revolution in the country.\nThe Dan-Hydro fertilizer Company in Kano which took delivery of the first batch of trucks in Kano said the timing and strategy for the introduction are rife.\nHead of operations, Dan- Hydro operations Mr. Hamadi Sekou Drammeh said the Dangote fertilizer conforms to all set standard required by the regulatory agencies.\nHe said the phenomenon of perennial shortage of the fertilizer product will be over in the country."
  },
  {
    "headline": "Givers Foundation Will Empower More Nigerians, Says Founder",
    "summarized_story": "Founder of Givers Supportive Foundation, Ologbenla Babatunde Smith, has said that the non-governmental charity-oriented organisation was poised to empower more Nigerians to become self-sufficient in the area of business ownership.\nAdvertisementsThe Ile Ife-born philanthropist, who established Givers Supportive Foundation in 2018, has been in the vanguard of the fight against hunger, poverty, deprivation and sickness amongst the less privileged in the country.\nSpeaking at the presentation of the money support for business establishment, the founder of Givers Supportive Foundation, Ologbenla Babatunde Smith, told the beneficiaries that the only way they can encourage the foundation to continue doing charity works was to deploy the funds into the setting up of the businesses and properly manage the same enterprises.\nDon’t use the money for personal needs because such will kill the business sooner than later.”Smith also used the occasion to share how Givers Supportive Foundation helped to alleviate poverty and starvation during the heat of the COVID-19 pandemic last yearHe said, “We helped more during the COVID-19 lockdown.\nHe also urged Nigerians to cultivate the spirit of giving, noting, “Help comes from anywhere; whatsoever help you render today will come back to you tomorrow."
  },
  {
    "headline": "Givers Foundation Will Empower More Nigerians, Says Founder",
    "summarized_story": "Founder of Givers Supportive Foundation, Ologbenla Babatunde Smith, has said that the non-governmental charity-oriented organisation was poised to empower more Nigerians to become self-sufficient in the area of business ownership.\nAdvertisementsThe Ile Ife-born philanthropist, who established Givers Supportive Foundation in 2018, has been in the vanguard of the fight against hunger, poverty, deprivation and sickness amongst the less privileged in the country.\nSpeaking at the presentation of the money support for business establishment, the founder of Givers Supportive Foundation, Ologbenla Babatunde Smith, told the beneficiaries that the only way they can encourage the foundation to continue doing charity works was to deploy the funds into the setting up of the businesses and properly manage the same enterprises.\nDon’t use the money for personal needs because such will kill the business sooner than later.”Smith also used the occasion to share how Givers Supportive Foundation helped to alleviate poverty and starvation during the heat of the COVID-19 pandemic last yearHe said, “We helped more during the COVID-19 lockdown.\nHe also urged Nigerians to cultivate the spirit of giving, noting, “Help comes from anywhere; whatsoever help you render today will come back to you tomorrow."
  },
  {
    "headline": "Govs Meet Over Modalities For State Legislature, Judiciary Autonomy",
    "summarized_story": "Governors of the 36 States of the Federation, will on Wednesday meet over the return to work by the Judicial Staff Union of Nigeria (JUSUN) and the Parliamentary Staff Association of Nigeria (PASAN).\nHe noted that JUSUN and PASAN had been on a nationwide strike for more than two months, while governors of the 36 states worked day-and-night to establish modalities for their autonomy in conformity with constitutional provisions.\n“The governors’ meeting will be briefed before deliberating on the Memorandum of Action (MoA) of this main item on the agenda.\n“The meeting will also review the agenda of the NEC which takes place a day after,” he said.\nHe also added that other items on the agenda include the regular update on the States’ Fiscal Transparency, Accountability and Sustainability f(SFTAS) to provide states’ status on their DLI’s and upcoming deadlines."
  },
  {
    "headline": "Govs Meet Over Modalities For State Legislature, Judiciary Autonomy",
    "summarized_story": "Governors of the 36 States of the Federation, will on Wednesday meet over the return to work by the Judicial Staff Union of Nigeria (JUSUN) and the Parliamentary Staff Association of Nigeria (PASAN).\nHe noted that JUSUN and PASAN had been on a nationwide strike for more than two months, while governors of the 36 states worked day-and-night to establish modalities for their autonomy in conformity with constitutional provisions.\n“The governors’ meeting will be briefed before deliberating on the Memorandum of Action (MoA) of this main item on the agenda.\n“The meeting will also review the agenda of the NEC which takes place a day after,” he said.\nHe also added that other items on the agenda include the regular update on the States’ Fiscal Transparency, Accountability and Sustainability f(SFTAS) to provide states’ status on their DLI’s and upcoming deadlines."
  },
  {
    "headline": "Insecurity Crippling Economy, Frustrating Nigerians – CAN",
    "summarized_story": "The Christian Association of Nigeria (CAN) in the 19 Northern States and the Federal Capital Territory (Northern CAN) has averred that the current insecurity in the country has not only crippled the economy, it has also plunged Nigerians into hunger, poverty and frustration.\n“Amid increasing insecurity, bad economy and undemocratic tendencies among the leaders, is there anything really worth celebrating?\n“We are particularly concerned about the security situation which appeared to have overwhelmed the government.\n“We join other Nigerians to once again, call on the federal government for the umpteenth, time to urgently address the security situation once and for all to liberate Nigerians from criminal gangs and their reign of terror.\n“President Muhammadu Buhari, has repeatedly promised to address the security situation."
  },
  {
    "headline": "Lalong condemns killings in Plateau, urges residents to increase...",
    "summarized_story": "Simon Lalong of Plateau has condemned the killing of 12 people at Kashe (Sabon Layi) community in Kuru District of Jos South Local Government of the state.\nHe said that the governor, represented by the Secretary to the State Government (SSG)Prof. Danladi Atu, urged communities to increase surveillance and intelligence gathering.\nThe governor also called on the people to collaborate with the security toward ending the circle of violence in the state.\nLalong, who said that he was distressed by the killing of the 12 innocent citizens and five severely injured in the community, appealed to citizens to increase surveillance and intelligence gathering.\nLalong further called on the people of the community to be law abiding at all times and desist from reprisals."
  },
  {
    "headline": "NNPC, Egbin collaborate to boost gas-to-power programme —",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) and the Egbin Power Plc have pledged to deepen collaboration to ensure the success of the Federal Government’s gas-to-power programme.\nThe Chief Operating Officer, Gas, NNPC, Mr Yusuf Usman and Chairman, Board of Directors, Egbin Power Plc, Mr Temitope Sonubi, made the pledge during a facility visit of the NNPC team to the power plant on Monday in Lagos.\nHe said there was need to ensure undisrupted supply of gas to Egbin Power Plant, which was the biggest in Sub Saharan Africa.\nWe are going to support you to make sure that the power supply is steady.\nSonubi appealed to the NNPC to sustain effort towards gas development and supply of the product to keep turbines at Egbin working productively at optimal capacity."
  },
  {
    "headline": "Insecurity: Bandits, Boko Haram abducts about 1000 school students in Nigeria",
    "summarized_story": "A report has revealed that the dreaded Boko Haram group and bandits have kidnapped almost a thousand school students in Nigeria between December last year and June 5, 2021.\nAbductions were recorded in Ohordua, Edo State; Effurun, Delta State; Kankara, Kaduna State; and Mahuta village, Katsina within the speculated period.\nOther places where cases of abduction were recorded are Kagara, Niger State; Jangebe, Zamfara State; and Afaka, Kaduna State, among others.\n“Two of my children were kidnapped; I will not allow them to go back unless something tangible is done,” she reiterated.\nMeanwhile, the presidency has warned Nigerians to stop rejoicing when cases of insecurity such as kidnappings and killings happen in the country."
  },
  {
    "headline": "World Blood Donor Day: NMA canvasses more funding for NBTS centres",
    "summarized_story": "The Nigeria Medical Association (NMA) has called for more funding of the National Blood Transfusion Services (NBTS) centres across the country.\nAccording to him, state NBTS centres were worst hit since the withdrawal of donor funds by implementing partners, as state governments were yet to take full ownership of such centres in their domains.\nUjah stressed that improved budgeting and release of funds to the NBTS centres across Nigeria would give room for effectiveness and efficiency in service delivery.\nHe cited some of the challenges of the sector to include, low level of eligible adult blood donor population, low level voluntary blood donation, high level commercial blood donation, high rate of transmission of transfusion transmissible infection among blood recipients from commercial donors, among others.\n“The NMA stands in full support of the NBTS and joins all voices of good reason to create sustained advocacy for a comprehensive improvement in blood transfusion services in Nigeria”, he said."
  },
  {
    "headline": "Panic as suspected herdsmen kill one in A’Ibom community",
    "summarized_story": "Gunmen suspected to be herdsmen have reportedly attacked and killed one Silvanus Usen in Ikot Atasung community in Ikot Ekpene local government area of Akwa Ibom state.\nThe incident would have led to an attack on the Hausa community by youths of the village but for the timely intervention of some political elites, it was learnt.\n“Suspected herdsmen in the early hours of yesterday (Sunday) attacked Ikot Atasung Village in Ikot Ekpene where one Silvanus Peter Usen was killed and his brother, Andrew was severely injured and is currently at the hospital battling to survive.\n” A possible faceoff between the angry youths and the Hausa Community in Ikot Ekpene was avoided through the intervention of some political actors and the police.\nHowever, there is an air of uncertainty in Ikot Ekpene now,” the source said."
  },
  {
    "headline": "Panic as suspected herdsmen kill one in A’Ibom community",
    "summarized_story": "Gunmen suspected to be herdsmen have reportedly attacked and killed one Silvanus Usen in Ikot Atasung community in Ikot Ekpene local government area of Akwa Ibom state.\nThe incident would have led to an attack on the Hausa community by youths of the village but for the timely intervention of some political elites, it was learnt.\n“Suspected herdsmen in the early hours of yesterday (Sunday) attacked Ikot Atasung Village in Ikot Ekpene where one Silvanus Peter Usen was killed and his brother, Andrew was severely injured and is currently at the hospital battling to survive.\n” A possible faceoff between the angry youths and the Hausa Community in Ikot Ekpene was avoided through the intervention of some political actors and the police.\nHowever, there is an air of uncertainty in Ikot Ekpene now,” the source said."
  },
  {
    "headline": "Northern CAN to FG: Nigerians are hungry, frustrated, unsafe",
    "summarized_story": "The statement reads in parts:“June 12, declared as Democracy Day by the current administration marked with mixed feelings across the country.\nWe are particularly concerned about the security situation which appeared to have overwhelmed the government.\nThe security situation in the country today has worsened with bandits, kidnappers and Boko Haram insurgents unleashing mayhem on Nigerians, killing innocent people and sacking communities.\nThe security situation has crippled the economy as traveling on the highways across the country has become a nightmare to Nigerians.\nPresident Muhammadu Buhari, has repeatedly promised to address the security situation."
  },
  {
    "headline": "Northern CAN to FG: Nigerians are hungry, frustrated, unsafe",
    "summarized_story": "The statement reads in parts:“June 12, declared as Democracy Day by the current administration marked with mixed feelings across the country.\nWe are particularly concerned about the security situation which appeared to have overwhelmed the government.\nThe security situation in the country today has worsened with bandits, kidnappers and Boko Haram insurgents unleashing mayhem on Nigerians, killing innocent people and sacking communities.\nThe security situation has crippled the economy as traveling on the highways across the country has become a nightmare to Nigerians.\nPresident Muhammadu Buhari, has repeatedly promised to address the security situation."
  },
  {
    "headline": "Oshiomhole breaks silence on not completing his tenure as APC National Chairman",
    "summarized_story": "By Jethro Ibileke/BeninThe immediate past governor of Edo State, Comrade Adams Oshiomhole, has said that it did not matter that he did not complete his tenure as national chairman of the All Progressives Congress (APC).\nHe stated this on Monday during the party’s enlarged leaders’ meeting across Edo North Senatorial District of the state, held in Auchi.\nOshiomhole had to step aside as national chairman of the party, following a law suit that affirmed his removal as a member of the party in his ward.\nHe, however, said that what mattered was that he occupied the office of the national chairman of the party, for which he said he remained thankful to God for.\n“I also was privileged to become the national chairman of our party and it does not matter even if I had spent just two days in that office."
  },
  {
    "headline": "Yomi Fabiyi to release movie x-raying Baba Ijesha travails",
    "summarized_story": "By Muhaimin OlowoporokuPopular Yoruba movie actor, Yomi Fabiyi is currently producing a movie titled ‘Oko Iyabo.’According to the Nation, the movie x-rays the travails of Fabiyi’s embattled colleague, Olanrewaju James, popularly known as Baba Ijesha.\nBaba Ijesha has been in the custody of the police since April for allegedly sexually assaulting a 14-year-old foster daughter of comedienne, Princess.\nYomi Fabiyi has been agitating for the release (via bail) of Baba Ijesha and also held a protest against the detention of Baba Ijesha.\n“The Movie “OKO IYABO” location loading.\nUna don watch OKO RAMOTA & u enjoyed it, get ready for OKO IYABO,” he tweeted last month."
  },
  {
    "headline": "Amaechi: Hadiza Bala not suspended, but asked to step aside",
    "summarized_story": "By Muhaimin OlowoporokuNigeria’s Minister of Transportation Rotimi Amaechi has said that he was not aware that Hadiza Bala Usman has been suspended as the managing director of the Nigerian Ports Authority (NPA).\nHe said that the NPA boss was only asked to step aside for investigations to be carried out on the NPA.\n“I’m not aware I suspended Hadiza, I am not the president.\n“I am not aware Hadiza is actually suspended.\nWhat happened I suspect is she was asked to step aside for investigation to be carried out on NPA not her."
  },
  {
    "headline": "Buhari Now More Determined To Tackle Division — Garba Shehu",
    "summarized_story": "Mr Shehu, appearing on state-run broadcaster NTA, believes that the regime’s adversary is the outlawed microblogging site Twitter, which is used to spew hate messages and endanger Nigeria’s business survival.\n“I think in the last few days, we are seeing a firmer determination by the administration of President Muhammadu Buhari to tackle artificial divisions that are standing in the way of national cohesion and progress of the country,” Mr Shehu said.\nMany citizens accused the president of infringing on citizens’ right to free speech and depriving them of their primary source of income.\nBut, in justifying the ban, Mr Shehu claimed that it was the proper method in ensuring that the country’s “rising heat” was put to an end.\nMeanwhile, the Buhari dictatorship has been extensively chastised for gross human rights violations, increasing insecurity and the economy, corruption, and nepotism, among other things."
  },
  {
    "headline": "We Don’t Want Governor Mohammed In Our Party, Bauchi APC Group Warns",
    "summarized_story": "Manazarta Siyasar Jam’iyyar APC, a support organization within the Bauchi State chapter of the All Progressives Congress (APC), stated on Monday that the state governor, Bala Abdulkadir Mohammed, is not welcome in the party.\nGovernor Mohammed is rumored to be considering defecting from the People’s Democratic Party (PDP) to the All Progressives Congress (APC), prompting the group’s threat.\nYahya Idris Suleiman, the group’s chairman, told journalists in Bauchi that members of the party did not want the governor to join the APC, claiming that the governor’s defection would destabilize the party.\n“We appeal to the people of Bauchi State to calm down on the current speculations on social media and radio of the governor’s defection to APC.\nOur findings proved that he is not doing the needful as he is accumulating debts for Bauchi State,” Suleiman said."
  },
  {
    "headline": "Nigerians React As Twitter CEO, Jack Dorsey Uses 3 Nigerian Flags On Page",
    "summarized_story": "Jack Dorsey, the co-founder and CEO of Twitter Inc., has raised the number of Nigerian flags on his Twitter handle to three.\nOn June 12, the Twitter CEO tweeted the Nigerian flag in support of the country’s Democracy Day.\nWaribo Nwachukwu said, “Jack Dorsey stands with Nigerian youths because he knows therein lies the energy for #tech, innovation & creativity.\nNigerian youths are the beckon of hope.\nWhy flash Naija flags in solidarity with the naija (Nigerian) govt?"
  },
  {
    "headline": "BREAKING: Herders Kill 2 In Benue Community, 9 Others Die In Community Clash",
    "summarized_story": "This comes only one week after gunmen attacked and killed 27 persons in the Agatu local government area’s Odugbeho hamlet.\nAccording to the Daily Trust, the new deaths took place in Odugbeho and two other rural communities, Aila and Adagbo.\nOn Sunday night, two individuals were killed in Odugbeho, while the remaining nine people were killed in Aila and Adagbo villages.\nThe attack on the Odugbeho hamlet, which resulted in the deaths of two individuals, was carried out by suspected armed herders, according to Agatu Council Chairman Adoyi Sule.\nAccording to Sule, armed herders stormed the settlement on Sunday night, killing two individuals and torching 21 homes."
  },
  {
    "headline": "2021: JAMB makes fresh pronouncement on UTME registration, tells candidates what to do",
    "summarized_story": "The registration for 2021/2022 Unified Tertiary Matriculations Examination (UTME) has been extended to June 15 by Joint Admissions and Matriculations Board (JAMB) for candidates who have not completed their registration to visit special centres to finish the processJAMB’s head of media, Fabian Benjamin, who revealed this said the extension was for only those who could not complete their registration during the earlier scheduled registration period.\nBenjamin said only candidates whose names were compiled after giving reasons for the incomplete registration process and had been contacted “are expected to visit the centres.”"
  },
  {
    "headline": "Pictures: PDP governors meet in Uyo over National issues",
    "summarized_story": "PreviousNo rift between Wike and I – Secondus"
  },
  {
    "headline": "Gunmen invade church, kidnap woman, Rev Sister",
    "summarized_story": "The spate of insecurity in Imo state worsened at the weekend when two women, including a Reverend Sister, were Sunday morning kidnapped at various points across the state.\nAt one of the scenes, a reverend sister was abducted at Dim na Nume, Isu in Nwangele local government area of the state, just moments after a kidnap incident took place at Ohii.\nThe yet-to-be identified Reverend Sister; Blueprint gathered, was driving when her captors dashed into the middle of the road and halted her car.\nThere was some level of confusion as Orogwe Archdeaconry youth holding their camp/conference at the church premises, ran in different directions for safety.\nIt was gathered that his captors, who wielded guns, had contacted the Olodan family and demanded a N30million ransom."
  },
  {
    "headline": "PDP warns Atagah against attacks on Senator Laah -NigPilot",
    "summarized_story": "The Youth Wing of the Peoples Democratic Party (PDP) , in Kaduna State, have has warned Mr. Philip Atagah to desist from his coordinated and irresponsible attack of Senator Danjuma Laah.\nWhile warning that Senator Danjuma Laah should not be distracted, the youths alleged that Mr Atagah is trying to obtain money he hasn’t worked for.\nNevertheless, such assignment will be an impossible job to do considering the pedigree of Senator Danjuma Laah.\n“May we remind Atagah and Co that distinguished Senator Danjuma Laah is the elected political leader of the Southern Kaduna People in Nigeria and in diaspora.\n“Senator Danjuma Laah has worked and contributed effortlessly to see that Southern Kaduna improves greatly and deserves better."
  },
  {
    "headline": "Buhari youth groups hold solidarity Rally in Abuja to mark democracy day -NigPilot",
    "summarized_story": "Groups, Youth Coalition for Development YCD and the All Progressives Congress Grassroots Forum APCGF have held a solidarity Rally in Abuja in support of President Muhammadu Buhari as the nation marked the June 12th Democracy Day.\nThis was just as anti Buhari protests Rally were also held in some other location in the FCT.\nHe insisted his Placard must be returned to him saying he loves Nigeria but does not want Buhari to continue as President.\nThe groups said President Muhammadu Buharimade A historic decision With the recognition Of June 12 As Democracy DaySpeaking at the rally in Abuja the National President of the group and converner of the solidarity Rally comrade Aminu Aminu applauded President Muhammadu Buhari for naming June 12 as Democracy Day, describing the decision as an historic one.\n“Most importantly, setting aside June 12 as Democracy Day is a testament to President Buhari’s resolve to entrench a vital and significant day in our democratic growth as an inherent aspect of our national history."
  },
  {
    "headline": "NAF says it isn’t aware of civilian casualties -NigPilot",
    "summarized_story": "The Nigerian Air Force (NAF) , yesterday said it is not aware of any civilian casualties in Niger State as a result of an aerial offensive against bandits in Genu Community.\nHe explained that the Air Force got credible information about the location of the bandits and was able to kill them.\nSources said that, this is not the first time military aircraft belonging to the Nigerian Air Force is hitting wrong target with resultant fatalities.\nRecall that the Nigerian Air Force “mistakenly” bombed a village in Damboa LGA of Borno, killing 17 people including women and children.\nA similar incident occurred in January 2017 when the NAF Aircraft dropped bombs in another wrong location killing more than 100 internally displaced persons (IDPs) during the accidental bombing."
  },
  {
    "headline": "Democracy: NABTEB reschedules two subjects due to public holiday -NigPilot",
    "summarized_story": "rescheduling of two papers, Chemistry and Literature in English in the upcoming 2021 NBC/NTC Examinations earlier fixed forMonday, (Today),14th June, 2021.\nThis is due to the declaration of Monday, 14th June as publicholiday by the Federal Government to mark this year’s Democracy Day.\nThe Registrar/Chief Executive, NABTEB, Professor (Mrs.) Ifeoma Isiugo-Abanihe, whomade the announcement at the weekend, said the affected papers will now holdon Saturday, 26th June, 2021.\nShe said all NABTEB State and Zonal Coordinators have been directed to inform allsupervisors, proprietors and stakeholders in their States and Zones, respectively.\nIn a related development, it was"
  },
  {
    "headline": "Unchecked Borrowing May Force Nigeria Into Avoidable Bankruptcy – PDP Governors",
    "summarized_story": "This formed part of the resolutions reached at the end of the meeting of the PDP Governors’ Forum held in Uyo, the Akwa Ibom State capital.\nThe borrowing spree of the APC administration if unchecked will certainly lead Nigeria into avoidable bankruptcy,” a communique issued at the end of the meeting read in part.\nThe governors decried that the debt profile of Nigeria with over 80 per cent of normal appropriation spent on debt servicing was rising and becoming uncontrollable.\nThe governors decried that President Muhammadu Buhari seemed not to be aware that the coercive instruments of state security were firmly within his hands and not the governors, considering his recent media interview on the subject.\nThey stated that despite being on the Exclusive List, the states spend huge sums of money to support the police and other security agencies to carry out their duties."
  },
  {
    "headline": "Gunmen Kill 12, Injure Five Locals In Plateau Attack",
    "summarized_story": "Gunmen suspected to be herdsmen have killed 12 people in an attack on Kuru community in Jos South Local Government Area of Plateau State.\nNo fewer than five other locals were injured during the incident, eyewitnesses told Channels Television on Monday morning during a visit to the scene of the attack.\nThey said following the attack, the injured victims were taken to a primary healthcare facility within the community for medical attention.\nMr Musa Bagos, the lawmaker representing Jos South/ Jos East Federal Constituency in the House of Representatives, was among those who visited the community where residents narrated their ordeal in the unprovoked attack.\nThe Management Committee Chairman of Jos South LGA, Gideon Davou, who was also at the scene, appealed to the residents to allow the security agencies to carry out a proper investigation into the incident."
  },
  {
    "headline": "70 Civil Groups Ask FG To Reverse Twitter Ban, Withdraw Prosecution Threat",
    "summarized_story": "Civil society organisations numbering 70 have called on the Federal Government to reverse the ban placed on Twitter and withdraw the threat to prosecute anyone using the app in the country.\n“We strongly condemn the arbitrary and unlawful suspension of Twitter in Nigeria, by the authorities, and the resulting restrictions on the human rights of people, as well as the threat to prosecute anyone using Twitter in Nigeria.\nThe groups also condemn the “directive” issued by the Nigerian Broadcasting Commission (NBC) for all broadcast stations to deactivate their Twitter accounts.\nAccording to the groups, Social media platforms have helped Nigerians to receive information, impart the same, hold useful conversations, and hold the Nigerian authorities to account.\nA clear example is how social media was used to drive police accountability in the #EndSARs protests last year."
  },
  {
    "headline": "Osinbajo Launches Kemi Adeosun’s ‘Dash Me’ Foundation",
    "summarized_story": "Vice President Yemi Osinbajo has launched the Dash Me Store, an outfit of the Dash Me Foundation founded by the immediate past Minister of Finance, Mrs Kemi Adeosun.\nThe store is established to mobilise resources for onward distribution to vulnerable people in the society via grassroots charities.\nThe Vice President during the opening on Sunday said, “I am excited to be here for several reasons, but most of all because of Mrs Adeosun’s commitment to the notion that all service to man is actually service to God, and she took that very seriously.\n“What Kemi and her team have done is to bring the new notion of social enterprise to this project.\nIt is a unique model which does not just give to the needy in the conventional way of merely handing out donations."
  },
  {
    "headline": "Ukraine Leader Says Biden Should Have Met Him Before Putin Summit",
    "summarized_story": "Ukrainian leader Volodymyr Zelensky said on Monday that Joe Biden should have met him before the US president’s first summit with Russia’s Vladimir Putin as they could resolve nothing on Ukraine without Kiev’s involvement.\nEarlier this month Biden reaffirmed US support for Ukraine’s territorial integrity and invited Zelensky to the White House in July.\nZelensky said he did not expect Putin and Biden to come up with a solution to Ukraine’s conflict at the summit.\nZelensky also accused Russia of delaying his proposed meeting with Putin to discuss the conflict in eastern Ukraine.\nPutin also stressed that Zelensky should discuss the conflict in eastern Ukraine with separatists directly."
  },
  {
    "headline": "Naftali Bennett succeeds Netanyahu as Israel’s Prime Minister",
    "summarized_story": "Israel’s parliament has narrowly voted in favor of a new coalition government, putting an end to Prime Minister Benjamin Netanyahu’s unprecedented 12-year rule.\nNaftali Bennett, a former Netanyahu ally turned bitter rival, took over as Prime Minister, presiding over a diverse and fragile coalition of eight parties with profound ideological differences.\nNetanyahu will continue to lead the Likud party and will serve as opposition leader.\nDuring the vote, Netanyahu remained silent.\nA dejected Netanyahu then sat in the opposition leader’s chair, wearing a black medical mask."
  },
  {
    "headline": "PCN seals 300 medical shops in Kebbi during enforcement campaign",
    "summarized_story": "The Pharmacists council of Nigeria has expressed concern at the activities of unregistered medicines stores and those operating beyond their approved scope."
  },
  {
    "headline": "2021 UTME: JAMB sets June 15 as deadline for completion of registration",
    "summarized_story": "The registration time for the Unified Tertiary Matriculation Examination (UTME) has been extended by the Joint Admissions and Matriculations Board (JAMB) to June 15th.\nCandidates who were unable to conclude the registration process for the UTME in 2021/2022 can now do so at specific centers.\nThe statement was titled ‘Completion of 2021 UTME/DE registration for candidates who did not register within the stipulated time and the extension period’.\nMr. Benjamin explained that the extension only extended to those who were unable to finish their registration during the earlier deadline.\n“At the end of the period originally scheduled for the 2021/2022 Unified Tertiary Matriculation Examination and Direct Entry registration on May 15, the registration period was extended."
  },
  {
    "headline": "Bobi Wine Supporters Released After Six Months in Detention",
    "summarized_story": "Eighteen supporters of Uganda’s opposition politician Robert Kyagulanyi have been released by the military court in Kampala has released on bail.\nThe supporters of Mr Kyagulanyi, also known as Bobi Wine were arrested at an election campaign rally in December 2020.\nThey include Bobi Wine’s personal bodyguard Edward Sebuwufu, Eddie Mutwe, and his musician colleague Bukeni Ali known as Nubian Li.\nThey had been arrested in the Lake Victoria island district of Kalangala, during a rally at which Bobi Wine was also picked up and flown against his will to his home in Kampala in a military helicopter.\nDuring the election campaign season and the months following the January polls, Uganda witnessed a wave of arrests and alleged kidnaps of what are believed to be hundreds of opposition supporters."
  },
  {
    "headline": "Wole Soyinka Speaks on Open Grazing, Democracy Day and 2023 Elections",
    "summarized_story": "Nobel laureate Wole Soyinka was a guest on ARISE News on Monday to speak on burning national issues.\nHe reacted to a recent exclusive interview on ARISE NEWS by President Muhammadu Buhari.\nAccording to Soyinka, the President is not listening.\nSoyinka also said Nigeria may not celebrate another Democracy Day, while he also shared his thoughts on the forthcoming 2023 elections.\nWatch the engaging in interview…"
  },
  {
    "headline": "‘Buhari Isn’t Listening’: Soyinka Criticises President on Grazing Routes Directive – Arise News",
    "summarized_story": "Nigeria’s President Muhammadu Buhari has displayed his inability to listen to citizens and respect the decisions of the southern governors when he directed the Attorney General of the Federation, Abubakar Malami to produce a gazette, which drafted grazing routes in all parts of the country in the First Republic, that’s according to noble laureate Wole Soyinka.\nIn an appearance on ARISE News on Monday, Professor Soyinka faulted President Buhari’s stance on digging up a colonial law he says is meant to recover lands on behalf of certain private businesses.\nHe says the language of the President is disturbing because he may have felt that through his utterances he was on a roll while in actuality the nation is on a nosedive.\nWatch the interview."
  },
  {
    "headline": "Nigeria Already Paying Chinese Loans, Transport Minister Amaechi Says",
    "summarized_story": "Nigeria’s Minister of Transportation Rotimi Amaechi says the country has already commenced repayment of loans gotten from China for the construction of railways.\nMr Amaechi stated this on Monday when he featured on an ARISE News programme The Morning Show and said Nigeria has moved from the N70 million revenue target for the Abuja to Kaduna rail line to N350 million as at May 2020.\nAccording to the minister, once the operational costs are taken away, “we have started paying back the loans”.\nMr Amaechi also spoke on reports that suggests Africa’s largest economy has mortgaged her assets to the Chinese government.\nWatch the video for more…"
  },
  {
    "headline": "Soyinka: Nigeria May Not See Another Democracy Day If It Doesn’t Decentralise",
    "summarized_story": "Nigeria may not see another democracy day and may not remain as one nation if it fails to operate a decentralised system of government, that’s according to Nobel laureate Wole Soyinka.\nHe said this on Monday when he featured on an ARISE News programme and noted that citizens will find alternative survival route if a nation such as Nigeria is on a suicidal slide.\nWatch the video…"
  }
]