[
  {
    "headline": "Gunmen attack Benue villages, kill 17, abduct woman",
    "summarized_story": "NO fewer than 17 people were reportedly killed in different villages of two local government areas in Benue State.\nThe killings occurred within the past three days in Agatu and Kastina-Ala LGAs respectively, local sources told our correspondent on Thursday evening.\n“Not less than seven people in Mbatyula council ward were killed on Tuesday while Emmanuel Apever’s wife from Kenvanger was abducted to an unknown destination.\n“In Tse Ate, three persons were killed and another two persons also killed at Saawua compound while three were reportedly killed in Tse Asaa.\nAll in Mbagbeentya community of Mbatyula council ward,” a resident alleged."
  },
  {
    "headline": "It’s better to have fewer banks complying with law – Bawa",
    "summarized_story": "The Chairman of the Economic and Financial Crimes Commission, Abdulrasheed Bawa, has warned financial institutions against fraudulent election financing, foreign exchange malpractices and money laundering.\nThe EFCC boss said it had become necessary to put bankers on their toes, particularly as the 2023 general elections approached.\nSpeaking during an interactive session with managing directors of banks at the Lagos Zonal Command of the EFCC on Thursday, Bawa said, “At the EFCC, we want to place more emphasis on prevention and less emphasis on enforcement, which is investigation and prosecution.\n“In addition, some of the issues we have identified include foreign exchange malpractices and fraudulent election financing.\n“It is better to have fewer banks complying with the laws of the land than to have multiple banks not complying with the laws.”Copyright PUNCH."
  },
  {
    "headline": "US: 49-year-old man arrested while allegedly attempting to bomb Capitol",
    "summarized_story": "A 49-year-old man identified as Floyd Ray Roseberry from North Carolina was arrested and taken into custody on Thursday for allegedly attempting to bomb US Capitol Hill.\nAccording to the report, FBI agents and members of the sheriff’s office in Cleveland County, North Carolina, went to his home, a representative for the sheriff’s office told News4.\nUS Capitol Police chief Tom Manger told reporters earlier this Thursday afternoon that the suspect’s motives were not certain.\n“Just moments ago, Floyd Roy Roseberry from Grover, North Carolina, was taken into custody without incident,” Manger told reporters.\n“We still have to search the vehicle and render the vehicle safe,” Manger said, adding that the process could take hours."
  },
  {
    "headline": "Nigeria will not survive another 8 years under APC, Buhari aught to have resigned – Bamgbose",
    "summarized_story": "The responses so far from the Presidency have shown that the insecurity in Nigeria has become hopeless and helpless,” Bamgbose, a senior lawyer, told DAILY POST.\nPresident Buhari as usual, will condemn the attacks, assure Nigerians that he will deal with the insecurity, and finally meet with the security chiefs.\n“The one-million-naira question is, how long are we to wait for President Buhari to crush the insurgents?\n“Nigeria may not be able to survive another 8 years of APC government, I seriously doubt that.\n“There must be concerted efforts to ensure that APC is ejected from the Presidential Villa come 2023 or Nigeria may be grounded.”"
  },
  {
    "headline": "Nigeria will get new beginning – Osinbajo",
    "summarized_story": "Vice President, Yemi Osinbajo, has said Nigeria is on course for a new beginning.\nOsinbajo explained that it’s in the nature of God to create new beginnings; hence Nigeria is on course for one, despite all doubts.\nThe RCCG pastor stressed that a new beginning awaits Nigeria, despite those doubting if anything good would come out of the country.\nAccording to Osinbajo: “Today, many men are saying the same about our nation Nigeria, even men of God, but this is the textbook case of how God works, He is set to give Nigeria a new beginning.\nWeeping may endure for a night, but joy comes in the morning.”He also noted that a new beginning can only be achieved through the strength of God amid weakness."
  },
  {
    "headline": "El-Zakzaky: Military task force bans planned protest by Shiites in Jos",
    "summarized_story": "The military task force responsible for the maintenance of peace in Plateau State, code-named Operation Safe Haven (OPSH), has banned a planned protest by members of the proscribed Islamic Movement of Nigeria (IMN) otherwise known as Shiites in Jos, the Plateau State capital.\nThe OPSH said an intelligence report available to them indicates a planned protest by members of the aforementioned group.\nThe military task force equally said the protest which is planned to hold nationwide including Plateau State is scheduled for Friday 20th August, 2021.\nIt was also gathered that the protest, according to report, is due to the health challenges of its leader, Sheikh Ibrahim El-Zakzaky.\nThe military task force maintained that it is committed to the total restoration of peace on the Plateau and is working closely with the State Government, critical stakeholders such as traditional, religious leaders and law abiding citizens to achieve this mandate."
  },
  {
    "headline": "Details emerge on how Senator Orji was allegedly stopped from travelling",
    "summarized_story": "Fresh facts have emerged on the report making the rounds in the media that former Governor of Abia State, Senator T.A.\nOrji was arrested and detained by the Economic and Financial Crimes Commission (EFCC) alongside his son, Engr Chinedum Enyinnaya Orji.\nThis is just as a reliable source has confirmed to DAILY POST that the federal lawmaker and his son were neither arrested nor detained.\nAn Abia State government official who was also familiar with the incident corroborated the security operatives narration and told informed DAILY POST that “Senator T.A.\n“And he returned home with his son, Chief Chinedum Orji who came over to join him on hearing about the incident”."
  },
  {
    "headline": "Imo monarchs hold rally over insecurity",
    "summarized_story": "Monarchs at Owerri zone in Imo State on Thursday held a peace rally against the insecurity that has bedevilled the state in the past eight months.\n“Today the Ezes in Owerri zone came out for a peace rally and we moved round major junctions in Owerri zone to pour libation for peace.\nWe as monarchs will always support the government in power, regardless of how the person emerged.\nThe Ezes moved out for a peace rally and as you could see, the young and the old came out to join in this movement for peace.\nWe must, as citizens of Imo State, support our governor for the progress of the state."
  },
  {
    "headline": "Ayade approves 100 per cent CONMESS for doctors",
    "summarized_story": "Cross River State Governor Ben Ayade has approved the payment of 100 per cent Consolidated Medical Salary Structure (CONMESS) to doctors.\nShe urged doctors and other health personnel to reciprocate the gesture by being dedicated to duty.\nThe NMA Chairman in the state, Dr. Innocent Abang, said the visit was to appreciate Mrs. Ayade for her role in the salary structure approval.\nADVERTISEMENTAbang said approval of CONMESS for doctors would enhance hard work and effective service delivery in the health sector.\n“This gesture will help to reduce the rate at which doctors leave the state in search of greener pastures."
  },
  {
    "headline": "‘Sultan’ in Edo sacrilegious, threat to peace, security, says govt",
    "summarized_story": "Edo State Government has condemned the planned coronation of Idriss Addano as the ‘Sultan of Shuwa Arab of Edo State’.\nIt described the alleged move as sacrilegious and a threat to peace and security.\nSecretary to Edo State Government (SSG) Osarodion Ogie on Thursday in an online statement, assured residents that a firm and a decisive action would be taken to prevent the actualisation of the illegal act.\n“That it is a potential threat to the peace and security of Edo State, with the capacity to cause a breakdown of law and order, as citizens of the state are likely to be provoked by the obnoxious ceremony.\nHe said residents should be calm and law-abiding, as the Governor Godwin Obaseki administration was on top of the situation."
  },
  {
    "headline": "Ganduje gets award on COVID-19",
    "summarized_story": "Kano State Governor Abdullahi Ganduje has been honoured with the Most Outstanding Governor of the Federation in the Management of COVID-19.\nThe award was presented by Nigerian Guild of Medical Directors at its international conference in Abuja.\nADVERTISEMENTCommissioner for Health Dr. Aminu Ibrahim Tsanyawa, who represented the governor at the ceremony, said Kano State invested a lot of resources in fighting COVID-19, noting the governor was committed to improving healthcare delivery services."
  },
  {
    "headline": "Outrage over plan to turban Sultan of Shuwa Arab of Edo",
    "summarized_story": "From Tony Osauzo, BeninOutrage has greeted plans by Shuwa Arabs ethnic group from Borno, to crown Idris Adanno as the Sultan of Shuwa Arab of Edo State.\nHowever, the Edo State Government has describing the purported move as sacrilegious and a threat to peace and security in the state.\nIn a statement, Secretary to the Edo State Government, Osarodion Ogie, assured citizens that firm and decisive action will be taken to prevent the actualization of the illegal and sacrilegious act.\n“The Edo State Government has been inundated with complaints from indigenes and residents of the state over the purported move to embark on the coronation of one Idriss Addano as ‘Sultan of Shuwa Arab of Edo State’.\nWe should now have Oba and Sultan in Edo State?"
  },
  {
    "headline": "Atiku, Fayemi, others urge citizens to defend democracy",
    "summarized_story": "Former Vice President Atiku Abubakar and Governor Kayode Fayemi of Ekiti have called on Nigerians to be vigilant and defend the nation’s democracy .\nThey made the call at the National Dialogue and Public Presentation of a book titled: “Remaking Nigeria: Sixty Years, Sixty Voices “ in Abuja, yesterday.\nAbubakar, who was chairman of the occasion, called on Nigerians to defend democracy saying fixing or restructuring Nigeria would help in nation-building, adding that such would help to foster a sense of nationhood.\n“When that happens, especially with fairness and justice, nation-building accelerates, however imperfectly; development and nation-building do not happen by themselves.\nOnumah said that the book was the product of discussion on what needed to be done to rescue Nigeria."
  },
  {
    "headline": "Mohammed Fawehinmi died of COVID-19-related complications –Family",
    "summarized_story": "By Lukman OlabiyiThe family of the late Mohammed Fawehinmi has said he died of complications from COVID-19 infection.\nFawehinmi said the family could not immediately disclose the cause of the death because they wanted the information to be based on factual medical details.\n“Today, however, we are in a position to inform you that our dear brother died from COVID-19-related complications.\nThe Mohammed, eldest son of the late legal icon and activist, Chief Gani Fawehinmi, died at about 9a.m.\nSaheed Fawehinmi reiterated that interment would take place on Friday, August 27, at the Gani Fawehinmi family compound in Ondo, Ondo State, after a brief funeral service."
  },
  {
    "headline": "PIA: Ijaw youths declare Buhari, Sylva, persona non grata in Niger Delta",
    "summarized_story": "From Femi Folaranmi, YenagoaIjaw youths across six states of the Niger Delta region under the aegis of Ijaw Youths Council have declared President Muhamammdu Buhari who doubles as minister of petroleum and the Minister of State, Timipre Sylva, persona non grata over the Petroleum Industry Act (PIA).\nIt said the duo were no longer welcomed in the region for their role in the passage and signing of the Petroleum Industrial Bill (PIB) into law.\nThe group noted that despite the fact that the constitution guarantees the duo freedom of movement to any part of the country, they would be met with boos and jeers if they ventured into any part of the Niger Delta region for disregarding the plights and cries of the people of the region over the years.\nAccording to him, a substantial percentage to the host communities would have helped to address the age long criminality.\n“In the light of the forgoing, there’s no better time for the people of the Niger Delta region to intensify the struggle for resource control and self-determination."
  },
  {
    "headline": "INEC blanks out PDP candidate, clears Soludo",
    "summarized_story": "Other parties that substituted its deputy governorship candidates are; All Progressives Congress (APC), APM, Peoples Redemption Party (PRP) and Young Progressives Party (YPP).\n“The timetable and schedule of activities approved by the Commission on January 18, 2021 provides for the withdrawal/substitution of candidates in line with Sec.\n“Accordingly, by the deadline of July 30, 2021 fixed by the Commission, seven governorship and 11 deputy governorship candidates were substituted by 11 out of the 18 political parties.\n“The list of substitute candidates is attached to this press release.\n“However, the final list of candidates will be published on October 7, 2021 as provided in the timetable and schedule of activities for the election,” the statement read."
  },
  {
    "headline": "CNA: How Shagari Prevented Second Republic Lawmakers from Hijacking N’Assembly Bureaucracy",
    "summarized_story": "By Deji Elumoye and Udora OrizuClerk to the National Assembly, Ojo Olatunde Amos, Thursday disclosed that late former President Shehu Shagari prevented members of the Second Republic National Assembly from making themselves members of the National Assembly Service Commission (NASC).\nAmos made this known while playing host to a delegation of the Committee on Administration and Human Resources of Ghana Parliamentary Service Board at the National Assembly.\nThe Clerk explained how parliamentary bureaucracy was treated like an appendage of the Executive arm of government until year 2000 when the National Assembly Service Commission was created.\n“When the proposal got to President Shehu Shagari, he asked the Members of the National Assembly to choose between being members of the National Assembly and members of the National Assembly Service Commission.\n“1983 the National Assembly was again suspended until 1993 when General Ibrahim Babangida ousted Buhari."
  },
  {
    "headline": "Breaking: Buhari Okays Review of Grazing Reserves in 25 States",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari Thursday gave a go ahead for the immediate review of Grazing Reserves in 25 out of the 36 states of the federation.\nAmong others, the committee had recommended the collection of field data on 368 Grazing Reserves across 25 states to assess encroachment and encroachers, stakeholder engagements and sensitization.\nThe number of the Grazing Reserves and States were deduced from considerations of existing security concerns and other pre-existing socio-economic conditions.\nThe President directed that the assignment be undertaken with dispatch to bring more understanding on the Grazing Reserves, and implementation.\nThe Committee was also expected to make recommendations for gazetting of ungazetted Grazing Reserves and create a data base of National Cattle Herders and ensure that Grazing Reserves were well communicated to all stakeholders."
  },
  {
    "headline": "Buhari: Nigeria Will Be Well Secured Before I Leave Office",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari has given an assurance that Nigeria will be well secured before he leaves office in May, 2023.\nHe emphasised that all within his power will be done to ensure that he does not leave the country in security crisis by the time his term of office ends.\nThe President gave the assurance Thursday while presiding over the National Security Council meeting at the State House, Abuja.\nThe National Security Adviser (NSA), Major-General Babagana Monguno (rtd), who disclosed the President’s position while speaking with newsmen after the meeting, said President Buhari also expressed his readiness to make more changes in the nation’s security architecture whenever the need arises.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Fayemi: Govs Will Work with PIA Implementation Committee",
    "summarized_story": "Says implementation committee chair assured NGF concerns raised will be addressed through amendmentInsists on adherence to constitutionBy Kingsley NwezehChairman of the Nigerian Governors’ Forum (NGF), Dr. Kayode Fayemi, said Thursday that the forum would work with the committee set up by the federal government to oversee the implementation of the Petroleum Industry Act (PIA) headed by Minister of State for Petroleum Resources, Mr. Timipre Sylva.\nPresident Muhammadu Buhari signed the Petroleum Industry Bill passed by the National Assembly into law on Monday.\nSpeaking in an interview with Arise TV, the broadcast qq of THISDAY, Fayemi, who is also the Governor of Ekiti State, said while the governors were prepared to work with the committee, concerns regarding adherence to the constitution raised by the governors must be looked into.\nHe said Sylva had reached out to the forum to say that concerns raised by the forum would be addressed by way of amendment.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Insecurity: Buhari Receives Briefing from CDS, Service Chiefs",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari is being briefed by the Chief of Defence Staff (CDS), General Lucky Irabor and other security chiefs about recent developments associated with the security challenges facing the nation.\nThe President, who returned to Abuja last Friday after 18 days in London, during which he attended an education summit and did health checks, is receiving the first formal security briefing since he left the country last month.\nPresident Buhari, at the meeting holding at the Conference Hall of the First Lady’s Office at the State House, is to be updated on security developments while plans to bring a decisive end to the challenges will be formulated.\nThe security forces have in the past few weeks taken the battle more robustly to insurgents, bandits, and all other criminals troubling the country, and they are now surrendering in droves.\nOthers attending the security meeting include Vice President Yemi Osinbajo, National Security Adviser (NSA), Major-General Babagana Monguno (rtd), the three Service chiefs and the Inspector General of Police, Usman Alkali Baba, among other top security personnel."
  },
  {
    "headline": "Africa's Richest Man, Dangote May Forfeit Refinery Project To Nigerian Debt Recovery Agency Over Rising Debts, Long Delay",
    "summarized_story": "Dangote Refinery is an oil refinery owned by the Dangote Group that is under construction in Lekki, Nigeria.\nHowever, analysts have pointed out that NNPC’s 20% equity at $3.8 billion makes the Dangote refinery overvalued at $19 billion.\nUsing the $16 billion value, 20 percent should be $3.2 billion and analysts have expressed dissatisfaction at the disparity in the project’s value and NNPC’s funding.\n“I don’t see the banks being unable to meet their liquidity because of the monies tied down in the Dangote refinery.\nI don’t envisage any bank having a liquidity challenge as a result of investing in Dangote refinery."
  },
  {
    "headline": "Africa's Richest Man, Dangote May Forfeit Refinery Project To Nigerian Debt Recovery Agency Over Rising Debts, Long Delay",
    "summarized_story": "Dangote Refinery is an oil refinery owned by the Dangote Group that is under construction in Lekki, Nigeria.\nHowever, analysts have pointed out that NNPC’s 20% equity at $3.8 billion makes the Dangote refinery overvalued at $19 billion.\nUsing the $16 billion value, 20 percent should be $3.2 billion and analysts have expressed dissatisfaction at the disparity in the project’s value and NNPC’s funding.\n“I don’t see the banks being unable to meet their liquidity because of the monies tied down in the Dangote refinery.\nI don’t envisage any bank having a liquidity challenge as a result of investing in Dangote refinery."
  },
  {
    "headline": "BREAKING: Again, Nigerian Government Raises Petrol Pump Price",
    "summarized_story": "The Petroleum Products Pricing Regulatory Agency has announced a new price band of N151.56 per litre for Premium Motor Spirit also known as petrol.\nThis new development was contained in a memo released by the Pipelines and Product Marketing Company and signed by D.O Abalaka.\nThe Nigerian Government had in March said the pump price of petrol would be determined by market forces, stating that how much Nigerians would pay would be largely determined by the international prices of crude oil.\nThe memo reads, “Please be informed that a new product price adjustment has been effected on our payment platform.\n“To this end, the price of Premium Motor Spirit (PMS) is now one hundred and fifty-one naira, fifty-six kobo (N151.56k) per litre."
  },
  {
    "headline": "BREAKING: Again, Nigerian Government Raises Petrol Pump Price",
    "summarized_story": "The Petroleum Products Pricing Regulatory Agency has announced a new price band of N151.56 per litre for Premium Motor Spirit also known as petrol.\nThis new development was contained in a memo released by the Pipelines and Product Marketing Company and signed by D.O Abalaka.\nThe Nigerian Government had in March said the pump price of petrol would be determined by market forces, stating that how much Nigerians would pay would be largely determined by the international prices of crude oil.\nThe memo reads, “Please be informed that a new product price adjustment has been effected on our payment platform.\n“To this end, the price of Premium Motor Spirit (PMS) is now one hundred and fifty-one naira, fifty-six kobo (N151.56k) per litre."
  },
  {
    "headline": "Fire Guts Ebeano Supermarket In Abuja",
    "summarized_story": "The popular Ebeano Supermarket, in Lokogoma area of Federal Capital Territory (FCT) Abuja, has been gutted by fire.\nThe inferno has caused confusion in the area as people were seen scampering for safety.\nThe cause of the fire and extent of damage cannot be ascertained as at the time of filing this report.\nAn eyewitness said the firefighters had arrived at the scene and making effort to put out the fire.\nA group of prayer warriors was sighted praying outside the supermarket."
  },
  {
    "headline": "Osinbajo: God is set to give Nigeria a new beginning",
    "summarized_story": "Vice-President Yemi Osinbajo says despite the current challenges, God is working on putting Nigeria on a new path of growth and development.\nAdvertisementOsinbajo said this while speaking at the 25th annual convention of the Redeemed Christian Church of God (RCCG) in the Americas.\nWith the convention themed “New Beginning”, the vice-president said it is in the nature of God to create new beginnings and Nigeria is on course, regardless of all doubts.\n“Today, many men are saying the same about our nation Nigeria, even men of God, but this is the textbook case of how God works.\nHe is set to give Nigeria a new beginning,” Osinbajo said."
  },
  {
    "headline": "Osinbajo: God is set to give Nigeria a new beginning",
    "summarized_story": "Vice-President Yemi Osinbajo says despite the current challenges, God is working on putting Nigeria on a new path of growth and development.\nAdvertisementOsinbajo said this while speaking at the 25th annual convention of the Redeemed Christian Church of God (RCCG) in the Americas.\nWith the convention themed “New Beginning”, the vice-president said it is in the nature of God to create new beginnings and Nigeria is on course, regardless of all doubts.\n“Today, many men are saying the same about our nation Nigeria, even men of God, but this is the textbook case of how God works.\nHe is set to give Nigeria a new beginning,” Osinbajo said."
  },
  {
    "headline": "Kogi west must produce next governor, Jemibewon-led group demands",
    "summarized_story": "Elders of Kogi West senatorial district have asked political parties and other senatorial districts in the state to consider zoning the governorship seat to Kogi west in 2023.\nAdvertisementThe elders, under the aegis of Kogi West Elders’ Forum (KWEF), also said they will not accept the position of deputy governor.\nIn a statement signed by David Jemibewon, KWEF chairman, the forum said Kogi west, despite actively participating in previous elections, has been unable to produce an executive governor since the creation of the state in 1991.\nAdvertisement“That political parties should consider candidates from Kogi west senatorial district.\nAdvertisement“That Kogi west senatorial district has embellished numbers of qualified candidates that understand the need for good governance that will benefit every part of the state."
  },
  {
    "headline": "Kogi west must produce next governor, Jemibewon-led group demands",
    "summarized_story": "Elders of Kogi West senatorial district have asked political parties and other senatorial districts in the state to consider zoning the governorship seat to Kogi west in 2023.\nAdvertisementThe elders, under the aegis of Kogi West Elders’ Forum (KWEF), also said they will not accept the position of deputy governor.\nIn a statement signed by David Jemibewon, KWEF chairman, the forum said Kogi west, despite actively participating in previous elections, has been unable to produce an executive governor since the creation of the state in 1991.\nAdvertisement“That political parties should consider candidates from Kogi west senatorial district.\nAdvertisement“That Kogi west senatorial district has embellished numbers of qualified candidates that understand the need for good governance that will benefit every part of the state."
  },
  {
    "headline": "Nigeria's situation bad but not irredeemable, Obasanjo says after meeting with Secondus",
    "summarized_story": "Former President Olusegun Obasanjo says he believes Nigeria can experience sustainable development, if citizens unite to tackle the country’s challenges.\nAdvertisementObasanjo said this on Thursday at his residence in Abeokuta, Ogun state, after a closed-door meeting with Uche Secondus, national chairman of the Peoples Democratic Party (PDP).\nThe former president said though the Nigerian situation may be bad, it is not irredeemable.\nAdvertisementThe PDP national chairman has been under increased pressure of late, with demands for his resignation coming from various quarters.\nMeanwhile, the tenure of the national working committee (NWC) of the party, chaired by Secondus, is supposed to end in December."
  },
  {
    "headline": "Meet Regina Honu, a Ghanaian software developer teaching thousands of girls to code",
    "summarized_story": "Failure is not finalIn her first year in senior secondary school, Honu had her first taste of failure during an Inter-school quiz competition.\nConversation between Regina Honu and students of Ashesi University during a visit.\nSame experience at another bank and turning away from a job at MicrosoftShe eventually left Zenith bank for Fidelity bank, a Ghanaian Bank.\nResigning from her JobThe morning of the day Honu resigned from her job, she didn’t know it would happen.\n10 years and countingIt’s been almost 10 years since Honu started Soronko Academy, for her there’s still so much more to do."
  },
  {
    "headline": "Nigeria’s Central Bank freezes bank accounts of fintech platforms Risevest, Bamboo, Trove and Chaka",
    "summarized_story": "The Central Bank of Nigeria has just frozen the bank accounts of Nigerian fintech platforms Risevest, Bamboo, Trove and Chaka for the next six months.\nNotably, all four companies affected by this action have gotten licenses from Nigeria’s Securities and Exchange Commission (SEC) to operate as digital platforms for buying and selling stocks.\n— Bamboo (@investbamboo) August 17, 2021So far none of the affected companies has come out to refute this claim.\nAccording to a source from one of the affected companies, they lost a lot of users and deposits after the April announcement.\nTechCabal has reached out to the affected fintech companies and is awaiting their comments."
  },
  {
    "headline": "Nigerian startup checks out of Afghanistan post Taliban takeover",
    "summarized_story": "The central government was disbanded; Ashraf Ghani, the president of Afghanistan fled the scene unannounced, leaving what remained of his administration in the mercy of the Taliban.\nMore recently, Chekkit, a Nigerian authentication and product tracking startup, expanded to Afghanistan after landing a partnership with the Afghanistan Ministry of Health to help in combating the endemic counterfeit medicine products in the country.\nTheir exit wasn’t much of a decision as all their partners have been forced to exit the country.\nObservers predict that with the Taliban in control, international trade will come to a standstill, leading to a surge in smuggling.\nThough after the capital takeover, the Taliban announced that the war is now over, can the dust settle that easily?"
  },
  {
    "headline": "Businesses on edge as COVID-19 third wave peaks",
    "summarized_story": "Businesses could be back on the brink of scrambling for strategies to escape the weight of an economy at standstill as the surge of COVID-19 third wave brings Nigeria closer to a possible lockdown decision.\nThe peak of Nigeria’s third wave of Covid-19 pandemic has begun, disease experts confirm, predicting that further rise in infections should be expected in the coming days as weak compliance with preventive measures persist.\nOyewale Tomori, a professor of virology in a chat with BusinessDay wondered why many Nigerians still do not believe the COVID-19 virus is circulating in the country despite rising numbers from only one-third of the 36 states.\nCaution has been thrown to the wind since governments lifted lockdown and eased activities in many sectors of the economy.\nTraders reported low sales, lack of cash on hand, and challenges with sourcing as significant problems facing their business."
  },
  {
    "headline": "New oil law paves way for Nigeria to attract private capital",
    "summarized_story": "New oil law paves way for Nigeria to attract private capitalThe new Petroleum Industry Act, which commercialises the operations of the Nigerian National Petroleum Corporation (NNPC), could provide an easier path to unlocking private capital for the state-owned firm that would help finance not only its projects but also bigger national ventures.\nThe transition of the NNPC into a limited liability company in six months…"
  },
  {
    "headline": "Higher Volume, pricing and baseline effect help leading firms record massive growth",
    "summarized_story": "Published second quarter results of Nigeria’s leading companies show strong growth as they put behind them the devastating effect of the COVID pandemic according to a report by FBNQuest.\nIt based its report on emerging evidence from the Q2 ’21 earnings season which is well underway and with over 65% of companies within its coverage…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Olu Of Warri: ‘Missing Crown Won’t Stop Coronation’ – Chief Ariyo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – With just a few days to the coronation of the 21st Olu of Warri, the Egogo of Warri Kingdom, Chief Robinson Ariyo, has said that, The missing crowns reportedly stolen from the Olu’s palace, will not affect the coronation of the Olu designate, Omoba Tsola Emiko come 21st August, 2021.\nSpeaking to the Nigerian Observer yesterday at the Olu’s palace in Warri, Chief Ariyo ,who is also a member of the Olu Advisory Council, said , despite the ‘stolen crowns’ the coronation will go on as smoothly as planned.\nChief Ariyo, a development expert and legal practitioner, said,“The whole idea was to frustrate the crowning process, but that won’t stop the coronation.\n“As at that time, the crowns were not yet stolen ; the crowns were stolen on the 1st of of April at about 3am.\nWhile warning mischief makers and all those involved in the sacrilegious act (crown theft) , Chief Ariyo said,“A lot of people don’t understand the way nature works."
  },
  {
    "headline": "Former Governor Arrested by EFCC – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The former Governor of Abia State, Sen. Theodore Orji has been arrested by operatives of the Economic and Financial Crimes Commission (EFCCC).\nThe former governor, who had for long been on the Commission’s watch list was reportedly driven back to the headquarters of the EFCC in Abuja.\nThe former governor who is currently senator and his sons, Chinedu and Ogbonna, has for months been under EFCC investigation for alleged misappropriation of public funds and money laundering.\nThe former governor is alleged to have received N500 million monthly as security vote for eight years as governor of Abia State between 2007 and 2015.\nOther allegations against him concerned alleged mismanagement of N2 billion Ecological Fund and mismanagement of Sure-P funds."
  },
  {
    "headline": "Coronation of Sultan in Edo: Enogie of Eyaen dissociates self, Rialto hotel from ceremony – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Enogie of Eyaen commmunity and Chief Executive Officer of Rialto Hotel, Benin City, His Royal Highness, Dr Osazuwa Aiwerioghene Iduriase has dissociated himself and the hotel from a purported coronation ceremony of Sultan Idriss Adano as the Sultan of Shuwa Arabof Edo State.\nThe ceremony which has been trending in the social media for days now, was allegedly scheduled for August 21 and 22, 2021 at the Rialto Hotel.\nIn a statement, the Enogie said that the publication linking Rialto Hotel to the coronation ceremony was not only malicious, but also done in bad faith.\nHe said that those behind the said coronation ceremony actually approached him on the use of the hotel for a party which was later found to be coronation ceremony of the alleged Sultan.\nHe therefore warmed those planning to use Rialto Hotel for such ceremony to have a rethink."
  },
  {
    "headline": "COVID-19 3rd wave: Edo records 36 new cases, readies to receive 65,020 doses of Moderna vaccines – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State has recorded 36 new cases of coronavirus (COVID-19), as the government intensifies efforts to contain the third wave of the pandemic and protect citizens.\nThe State COVID-19 Incident Manager, Dr. Andrew Obi, disclosed this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the State governor, Mr. Godwin Obaseki.\nObi said all is set for the commencement of the second phase vaccination rollout, noting that Edo anticipates the arrival of the 65,020 doses of Moderna (mRNA) vaccines approved for the state by the National Primary Healthcare Development Agency.\nAccording to him, “Edo, in the last 24 hours, recorded 36 new cases of coronavirus (COVID-19) and zero recoveries, with a test positivity rate of 13.8 percent and 59 percent rise in active cases.\nThe 36 new cases were confirmed from the 260 samples collected within the 24-hour time frame."
  },
  {
    "headline": "Presidency sends delegation to Kano for Buhari’s son’s wedding",
    "summarized_story": "ADVERTISEMENTThe Presidency has constituted a presidential delegation ahead of President Muhammadu Buhari’s visit to Kano for the marriage of his son, Yusuf Buhari, to Zahra Bayero, on Friday.\nZahra is the daughter of Nasiru Ado Bayero, the Emir of Bichi in Kano State.\nHe said members of the delegation would stay back after the wedding, to represent the president at the coronation of the Emir at Bichi the following day, Saturday.\nAlready, some dignataries have arrived the ancient city of Kano to witness the wedding.\n“President Muhammadu Buhari is expected to grace the wedding Fatiha of his son and the daughter of the Emir of Bichi in Bichi town on Friday,” the official said."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "APC Ward Congress: We received three major petitions in Ogun – Appeal Committee",
    "summarized_story": "Idowu Olakunle,AbeokutaThe Appeal Committee of the All Progressives Congress (APC), for the ward congress in Ogun State, said it is dealing with only three major petitions submitted to the National Secretariat of the party by aggrieved members in the state.\n“We are in the state to meet with members of our party that are aggrieved as a result of the conduct of the party’s ward congress,” he said.\n“We are given the mandate by the national body of APC to resolve all outstanding issues as members of the same family.\nHe told newsmen that petitions were received from Senators Tolu Odebiyi and Lekan Mustapha, both representing Ogun West and East in the National Assembly; elected party chairmen in 2018 and some members of the Congress Committee.\n“It is a plus for Ogun state political class to have former governors of the state in the party."
  },
  {
    "headline": "INEC recognizes Soludo’s APGA candidacy for November 6 Anambra polls",
    "summarized_story": "Independent National Electoral Commission (INEC), has finally recognized former CBN governor, Prof Charles Soludo as the rightful candidate of the All Progressive Grand Alliance (APGA) for 6 November governorship polls in Anambra State.\nINEC spokesperson, Chief Festus Okoye who announced the decision on Thursday, said the Commission relied on an Abuja Court of Appeal judgement to make the switch.\nChukwuma Umeoji, as the APGA candidate for the election.\nStung by the switch, the Chief Victor Oye-led faction robustly challenged the cases that the Jude Okeke-led faction spread in several courts.\nAPGA lawyers simultaneously defended and challenged legal traps set for the Oye faction in Kano, Abuja, Awka and Owerri."
  },
  {
    "headline": "Buhari moves to create grazing reserves in states for herders despite opposition",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has announced plans to move on with the contentious issue of grazing reserves for the benefit of nomadic cattle rearers across the federation.\n“Among others, the committee had recommended the collection of field data collection on 368 Grazing Reserves across 25 states to assess encroachment and encroachers, stakeholder engagements and sensitization.\n“The number of the Grazing Reserves and States were deduced from considerations of existing security concerns and other pre-existing socio-economic conditions.\n“The President directed that the assignment be undertaken with dispatch to bring more understanding on the Grazing Reserves, and implementation.\n“The Committee will also make recommendations for gazetting of ungazetted Grazing Reserves and create a data base of National Cattle Herders and ensure that Grazing Reserves are well communicated to all stakeholders."
  },
  {
    "headline": "Will government listen to our climate? By Enyene Vincent",
    "summarized_story": "Climate change has been a major item of discuss among western nations and especially when they meet either at the United Nations General Assembly, G20 or G8.\nGas flaring introduces toxic pollutants such as sulfur dioxide into the atmosphere, which leads to environmental problems such as acid rain.\nAlso, gas flaring is a major source of greenhouse gases (GHG) contributing to global warming which accelerates the problem of climate change and harsh living conditions in the country.\nTo save the environment and humanity, the Nigerian government needs to stop postposing the doomsday and end gas flaring.\nEarlier this year, Minister of state petroleum, Timipre Sylva said the federal government is now committed to eliminating gas flaring by 2025, after the government in 2016 extended the deadline to end gas flaring in 2020."
  },
  {
    "headline": "Hushpuppi: Court refuses to restrain NPF, AGF from arresting, extraditing Abba Kyari",
    "summarized_story": "Justice Ahmed Mohammed, in a ruling on Thursday, said he was not inclined to granting the relief sought in the ex-parte motion.\nJustice Mohammed ordered that the ex-parte motion should be converted to a motion on notice and served same, along with the originating processes, on the respondents – the NPF and AGF.\nThe motion ex-parte was filed by a group, the Incorporated Trustees of the Northern Peace Foundation through their lawyer, Kayode Ajulo.\nThe Police Service Commission (PSC) has since suspended Abba Kyari from office and as head of the Intelligence Response Team (IRT).\n“The Commission’s decision which was conveyed in a letter with reference, PSC/POL/D/153/vol/V/138 to the Inspector General of Police today, Sunday, August 1st, 2021, was signed by Hon."
  },
  {
    "headline": "Hushpuppi: Court refuses to restrain NPF, AGF from arresting, extraditing Abba Kyari",
    "summarized_story": "Justice Ahmed Mohammed, in a ruling on Thursday, said he was not inclined to granting the relief sought in the ex-parte motion.\nJustice Mohammed ordered that the ex-parte motion should be converted to a motion on notice and served same, along with the originating processes, on the respondents – the NPF and AGF.\nThe motion ex-parte was filed by a group, the Incorporated Trustees of the Northern Peace Foundation through their lawyer, Kayode Ajulo.\nThe Police Service Commission (PSC) has since suspended Abba Kyari from office and as head of the Intelligence Response Team (IRT).\n“The Commission’s decision which was conveyed in a letter with reference, PSC/POL/D/153/vol/V/138 to the Inspector General of Police today, Sunday, August 1st, 2021, was signed by Hon."
  },
  {
    "headline": "Things to know about Buhari’s son, Yusuf wedding in Kano",
    "summarized_story": "Things to know about Buhari’s son, Yusuf wedding in KanoThings to know about Buhari’s son, Yusuf wedding in KanoPresident Muhammadu Buhari’s son, Yusuf, will on Friday wed Zahra, daughter of Emir of Bichi, Nasir Ado-Bayero.\nYusuf is the only male child of Buhari and first son of the President’s second wife, Aisha Buhari.\nZarah is a 19-year daughter of Emir of Bichi, Alhaji Nasir Ado Bayero, who is the fourth child of late Emir of Kano, Alhaji Ado Bayero.\nYusuf, 27, is a graduate of the University of Surrey, Guildford, United Kingdom while Zahra is studying architecture in a university in the UK.\nThe emir would be presented with a staff of office by the Governor of Kano State, Abdullahi Ganduje, on Saturday."
  },
  {
    "headline": "Things to know about Buhari’s son, Yusuf wedding in Kano",
    "summarized_story": "Things to know about Buhari’s son, Yusuf wedding in KanoThings to know about Buhari’s son, Yusuf wedding in KanoPresident Muhammadu Buhari’s son, Yusuf, will on Friday wed Zahra, daughter of Emir of Bichi, Nasir Ado-Bayero.\nYusuf is the only male child of Buhari and first son of the President’s second wife, Aisha Buhari.\nZarah is a 19-year daughter of Emir of Bichi, Alhaji Nasir Ado Bayero, who is the fourth child of late Emir of Kano, Alhaji Ado Bayero.\nYusuf, 27, is a graduate of the University of Surrey, Guildford, United Kingdom while Zahra is studying architecture in a university in the UK.\nThe emir would be presented with a staff of office by the Governor of Kano State, Abdullahi Ganduje, on Saturday."
  },
  {
    "headline": "COVID-19 cases plummet in Nigeria with eight new deaths",
    "summarized_story": "COVID-19 cases plummeted in Nigeria on Thursday with 674 fresh cases reported across 16 states and the Federal Capital Territory (FCT), Abuja.\nEight new deaths were however recorded to take the overall deaths arising from the deadly virus to 2,244 in the third wave of the pandemic.\nNigeria posted 1,149 cases on Wednesday, the highest in a single day in 2021, but there was a sharp fall on Thursday with figures dropping sharply to 674.\nThis takes the total confirmed COVID-19 cases in Nigeria to 185,267 , with 167,923 survivors discharged so far according to the Nigerian Centre for Disease Control, NCDC.\nIn Thursday infections, Lagos logged on 355 new cases, a drop from the 680 cases it posted the previous day, while Rivers which came second reported 87 cases, a fall from the 157 cases it raked in on Wednesday."
  },
  {
    "headline": "BET Africa celebrates the year of the black woman",
    "summarized_story": "…BET breaks and BET presents the encoreViacomCBS Networks Africa’s (VCNA’s) Black Excellence channel, BET Africa has declared 2021 the year of the black woman and will spotlight and celebrate the many achievements by black women on and in front of the camera.\nBET Africa’s original daily drama, ISONO, provides African women with a platform that enables them to tell their stories authentically.\nFemale-led BET international original content this women’s month includes the latest season of Tyler Perry’s original series Sistas.\nNine of the most memorable solo artists and girl groups from the 1990s and 2000s will form the ultimate R&B supergroup in the newest original series, “BET Presents The Encore.” The BET original reality series airs every Wednesday, at 21:00 WAT/ 22:00 CAT.\nBET Africa’s commitment to driving black excellence, culture and storytelling equally celebrates and honours powerful black women who are forging a path of their own."
  },
  {
    "headline": "Buhari Sends Four Ministers, Others To Kano Ahead Of Son’s Wedding, Emir’s Coronation",
    "summarized_story": "President Muhammadu Buhari has deployed a high-level delegation to Kano State ahead of his son Yusuf’s wedding fathia to Zahra Bayero, the daughter of Bichi’s Emir Nasiru Ado Bayero.\nGarba Shehu, the President’s Senior Special Assistant on Media and Publicity, revealed this in a statement released on Thursday.\nThe statement reads, “Ahead of President Muhammadu Buhari’s visit to Kano for the marriage of his son, Yusuf Buhari, to Zahra Bayero, the daughter of Nasiru Ado Bayero, the Emir of Bichi in Kano State on Friday, the President has dispatched a high-level delegation to be led by his Chief of Staff, Professor Ibrahim Gambari.\n”The Presidential delegation, including the Ministers of Defence, Maj Gen Bashir Salihi Magashi (rtd), Agriculture, Alhaji Sabo Nanono, Aviation, Senator Hadi Sirika and Water Resources, Engr.\nSuleiman Hussein Adamu as well as the Senior Special Assistant to the President (Media and Publicity), Garba Shehu will stay back after the wedding, to represent the President at the coronation of the Emir at Bichi the following day, Saturday.”"
  },
  {
    "headline": "BREAKING: Buhari Approves Review Of 368 Grazing Sites In 25 States",
    "summarized_story": "President Muhammadu Buhari has endorsed the committee’s recommendations after it examined 368 grazing sites in Nigeria.\nThe reserves include 25 states, and the evaluation will establish the extent to which they have been encroached upon.\nFollowing his approval of the report of the team led by Chief of Staff Ibrahim Gambari, he issued the command.\nThe committee recommended gathering field data on the 368 reserves in order to assess encroachers, as well as stakeholder participation and sensitization.\nThe number of reserves and states was calculated based on existing security concerns and other pre-existing socioeconomic variables."
  },
  {
    "headline": "Police Attack Shiites’ Procession In Sokoto, Two Feared Killed, Many Injured",
    "summarized_story": "Two persons reportedly lost their lives on Thursday during an Ashura procession by members of Islamic Movement of Nigeria (IMN) popularly known as ‘Shiites’ in Sokoto.\nThe procession which started from Trade Fair on the popular Kano road, passed through NNPC, to Mahmud Gimi road and ended at Madam Karo.\nIt was learnt that policemen attacked the Shiites and fired teargas canisters including live ammunition at the crowd of mourners who were about to disperse.\nIn Abuja, the procession started from Wuse, Zone 3 junction and ended at Wuse Market.\nConfirming the incident, the Secretary, Academic Forum of the Movement, Abdullahi Musa said that two of their members were killed by the police while 15 persons were injured."
  },
  {
    "headline": "BREAKING: INEC Lists APGA’s Soludo For Anambra Election, Drops PDP",
    "summarized_story": "The Independent National Electoral Commission (INEC) released the list of candidates for the governorship election in Anambra State on Thursday.\nThe All Progressives Grand Alliance’s candidate, Chukwuma Soludo, was replaced by Michael Umeoji by INEC (APC).\nThe People’s Democratic Party (PDP) was left from the list of candidates who had been cleared.\nAccording to the spokesman, eleven of the eighteen political parties had substituted seven governorship and eleven deputy governorship candidates before the deadline of July 30, 2021.\n“The final list of candidates will be published on October 7 2021 as provided in the timetable and schedule of activities for the election”, the statement read."
  },
  {
    "headline": "Buhari to security Chiefs: I won’t exit office a failure",
    "summarized_story": "Nigeria’s President Muhammadu Buhari has ordered heads of security agencies in the country to address the alarming insecurity in the country, saying he is not prepared to exit office as a failure.\nSurrendering insurgentsHe said the Boko Haram fighters were leaving the terrorist camp in droves as a result of the relentless activities of the security agencies.\nLarge numbers of people are surrendering in the north east as a consequence of the relentless efforts of the Armed Forces, intelligence and security agencies.\nAnd he’s also made it very, very clear that he’s not ready to exit government as a failure.\nWe have to use everything at our disposal, all the elements of national power, including the population, the wider community needs to work with the security agencies to deal with these problems."
  },
  {
    "headline": "Ogun: Secondus in close door meeting with Obasanjo",
    "summarized_story": "The embattled Chairman of the People’s Democratic Party (PDP), Chief Uche Secondus, is in a close door meeting with former President, Chief Olusegun Obasanjo in his Abeokuta residence, the Ogun State Capital.\nSecondus, who arrived the former president’s residence in company of his entourage around 12.19pm went straight into the meeting.\nThe purpose for the visit of the PDP Chairman is sketchy as at the time of filing this report, but may not be unconnected with the internal wranglings within the ranks of the PDP as the chairman battle to safe his job.\nA crack had emerged in the PDP National Working Committee (NWC) two weeks ago, after the resignation of some officials and calls for Secondus’ resignation by some NWC members became more emboldened.\nAlthough, the leaders of the PDP comprising of governors, Board of Trustees(BoT), National Assembly caucus, intervened last week Tuesday to save the opposition party, with the party resolution setting the national convention for October to elect new leadership of the party."
  },
  {
    "headline": "Pictures: President Muhammadu Buhari, security Chiefs meet",
    "summarized_story": ""
  },
  {
    "headline": "No ethnic or religious bias in FUHSO -VC -NigPilot",
    "summarized_story": "*’Achieving global academic excellence our goal’Management of the Federal University of Health Sciences, Otukpo, FUHSO in Benue State, has dismissed as a false and unfounded allegation of appointment of principal officers of the institution on ethnic or religious considerations.\nSome youths who claimed to be Tiv Youth Council Worldwide of Benue State had at a press conference in Makurdi, alleged ethnic bias in the appointment of principal officers of the university.\nUjah added that the President also appointed the Emir of Zamfara, Alhaji Attahiru Muhammed Ahmed from North West as the Chancellor of the university on July 9, 2021.\nIt is inconceivable and unthinkable to ascribe ethnic or religious considerations in our operations.\nThere is no basis for ethnic or religious sentiments."
  },
  {
    "headline": "EFCC arrests Orji at Abuja Airport -NigPilot",
    "summarized_story": "Operatives of the Economic and Financial Crimes Commission, EFCC on Thursday intercepted former Governor of Abia State, Sen. Theodore Orji at the Nnamdi Azikiwe International Airport, Abuja.\nOrji was quizzed alongside his son, Chinedu, who is the Speaker of the Abia State House of Assembly.\nSenator Orji and his sons, Chinedu and Ogbonna, are under investigation by the EFCC for alleged misappropriation of public funds and money laundering to the tune of N551 billion.\nThe ex-governor was alleged to have embezzled the N500 million monthly security vote he received for eight years as governor of Abia state between 2007 and 2015.\nAs confirmed by EFCC spokesman, Wilson Uwujaren, the arrest of the former governor, also borders on the allegation of mismanagement of N2bn Ecological Fund and conversion of Sure-P funds."
  },
  {
    "headline": "R&D: Researchers advocate policy on industry, academia partnership -NigPilot",
    "summarized_story": "Researchers in Nigeria have advocated the formulation of a national policy on industry and academia partnership to enhance synergy and the transfer of research into products and services.\nAhmed added that the R&D initiative which seeks to anchor research in the country’s economy was overdue, stating that the time to institutionalize research in Nigeria is now.\nAlso speaking, the Chairman of the RDSC, Prof Njida Gadzama, said given the potentials Nigeria has, the country deserves to be better than it is.\nGadzama, who lamented that the country imports virtually everything, called on all Nigerians to lay aside their differences, unite and develop the country.\nAccording to him, adequate infrastructural development such as good road networks and electricity were very critical to the country’s quest for industrialization."
  },
  {
    "headline": "Shagari prevented lawmakers from hijacking NASS bureaucracy -CNA -NigPilot",
    "summarized_story": "Clerk to the National Assembly, CNA, Architect Amos Olatunde Ojo , yesterday disclosed in Abuja that it was late President Shehu Shagari who prevented serving lawmakers from making themselves members of the National Assembly Service Commission, NASC.\n“When the proposal got to President Shehu Shagari, he asked the members of the National Assembly to choose between being members of the National Assembly and members of the National Assembly Service Commission.\n“In 1983, the National Assembly was again suspended until 1993 when General Ibrahim Babangida ousted Buhari.\n“With Abacha as Head of State and the suspension of the political arm of the National Assembly, the National Assembly bureaucracy was seen as one of the departments in the Villa following Decree 48 of 1988.\nThe letterhead of the National Assembly bureaucracy bore the insignia of the Presidency."
  },
  {
    "headline": "UPDATED: I Will Not Exit Government As A Failure, Says Buhari",
    "summarized_story": "President Muhammadu Buhari has vowed not to exit the government as a failure at the end of his second term in office in 2023.\nHe made the declaration during a crucial closed-door meeting with service chiefs held on Thursday at the Presidential Villa in Abuja.\nREAD ALSO: Buhari Meets With Security ChiefsThe National Security Adviser (NSA), Major General Babagana Monguno, conveyed the President’s pledge to State House correspondents at the end of the meeting which lasted more than five hours.\n“And he’s also made it very clear that he’s not ready to exit government as a failure; he is not going to tolerate that.\nMonguno hinted that the meeting briefed President Buhari on the current security situation in the country, especially on happenings from the last meeting till the latest one."
  },
  {
    "headline": "Obasanjo Meets Secondus, Advises Politicians On 2023 Elections",
    "summarized_story": "Former President Olusegun Obasanjo has asked political elites and the Federal Government to prioritise the security and economy of the nation, rather than the current agitation about the 2023 general elections.\nThe elder statesman made the call on Thursday when he met with the National Chairman of the Peoples Democratic Party (PDP), Uche Secondus, at his residence in Abeokuta, Ogun State.\nAmid the recent disagreements within the party, he is confident that the PDP is emerging stronger ahead of the forthcoming elections.\nAfter the closed-door engagement which lasted about two hours, Obasanjo and Secondus were received at the board room of the Olusegun Obasanjo Presidential Library by members of the PDP in Ogun State.\nAddressing the party faithful, they called for all hands to be on deck to rebuild the fortunes of the country."
  },
  {
    "headline": "Taliban ‘Intensifying’ Search For Afghans Who Helped US – UN",
    "summarized_story": "The Taliban is intensifying a search for people who worked with US and NATO forces, a confidential United Nations document says, despite the militants vowing no revenge against opponents.\nThe report — provided by the UN’s threat-assessment consultants and seen by AFP — says the group has “priority lists” of individuals it wants to arrest.\nMost at risk are people who had central roles in the Afghan military, police and intelligence units, according to document.\nThe Taliban have been conducting “targeted door-to-door visits” of individuals they want to apprehend and their family members, the report says.\nThe report says the militants are “rapidly recruiting” new informers to collaborate with the Taliban regime and are expanding their lists of targets by contacting mosques and money brokers."
  },
  {
    "headline": "International Oil Companies Owe NDDC $4bn, Says Akpabio",
    "summarized_story": "Senator Godswill Akpabio says oil firms operating in the Niger Delta have defaulted in their statutory remittances to the Niger Delta Development Commission (NDDC) to the tune of $4 billion.\nAkpabio, who is the Minister of Niger Delta Affairs, made the claim on Thursday at the weekly ministerial briefing held at the State House in Abuja.\nAkpabio stressed that the Ministry of Niger Delta will take a keen interest in the implementation of the three percent Petroleum Industry Act (PIA) compensation to host communities.\nFunds from the Niger Delta Ministry – which was established in 2008 with a hundred ₦200 billion – shrank to ₦19 billion in 2020 and then rose slightly to ₦24 billion in 2021.\nThe minister revealed that ₦10 billion – out of the allocated fund – has been dedicated to fix the East-West Road."
  },
  {
    "headline": "Over 300 Nigerians Illegally Arrested, Languishing In Italian Jails – Edo Ex-Commissioner",
    "summarized_story": "According to the former commissioner, the young Nigerians are held in Italian maximum prisons because they do not have the resources to access an independent lawyer.\nEnters then a forged manual called the Green Bible.\nOnly for him to produce a forge manual that he called the Green Bible, which they have used to convict a lot of Nigerians over 200 Nigerians in Italy,” Osemwingie-Ero narrated.\nHe and his lawyers thoroughly went through the Green Bible and discovered myriads of discrepancies.\n“If that could happen to me, you can imagine the fate of ordinary Nigerians?” Osemwingie-Ero asked."
  },
  {
    "headline": "Updated: 2023 Election is not as important as Nigeria’s unity – Obasanjo",
    "summarized_story": "Former president, Olusegun Obasanjo has advised those giving priority to the 2023 elections to work towards the nation’s unity now and beyond 2023.\nThe former President expressed concern that the nation was not where it was supposed to be.\nHe made this known when he played host to the National Chairman of the People’s Democratic Party, Uche Secondus at his Hilltop residence in Abeokuta, the Ogun state capital.\nHe maintained that though the situation of Nigeria is very bad, it is not irredeemable.\nAdvertisementThe former President stated that Uche Secondus had not visited him because of partisan politics, but because he was concerned about the situation of the nation."
  },
  {
    "headline": "President Buhari approves committee’s report on grazing reserves",
    "summarized_story": "President Buhari has approved the recommendation of a committee on the review of 368 grazing sites across 25 States of Nigeria.\nThe Committee also recommended the production of maps and geo-mapping/tagging of sites, analysis of findings and report preparations as well as design appropriate communication on Grazing Reserves and operations.\nAdvertisementThe number of the Grazing Reserves and States were deduced from considerations of existing security concerns and other pre-existing socio-economic conditions.\nPresident Muhammadu Buhari also directed that the assignment be undertaken with dispatch to bring more understanding on the Grazing Reserves, and implementation.\nAdvertisementThe Committee will also make recommendations for gazetting of ungazetted Grazing Reserves and create a data base of National Cattle Herders and ensure that Grazing Reserves are well communicated to all stakeholders."
  },
  {
    "headline": "Alleged money laundering: EFCC arrests former Abia governor, Theodore Orji",
    "summarized_story": "A former Governor of Abia State and now a Senator, Theodore Orji has been arrested by the Economic and Financial Crimes Commission (EFCC)Orji was arrested on Thursday at Abuja’s Nnamdi International Airport, according to reports.\nThe senator is being investigated for alleged public funds theft and money laundering.\nHe was accused of mismanaging the N2 billion Ecological Fund, as well as mismanagement of Sure-P funds.\nBetween 2007 and 2015, Theodore Orji was reported to have received N500 million per month as a security vote as governor of Abia State."
  },
  {
    "headline": "Nigeria: Govenor Fayemi Justifies Suit Against Federal Government Over $4bn Recovered Loot",
    "summarized_story": "Chairman of the Nigeria Governors Forum Kayode Fayemi says governors in the country felt slighted when decisions were taken on recovered looted funds without their input as critical actors in the federation.\nGovernor Fayemi’s comments come on the heels of a joint suit filed by the 36 state governments against the federal government at the Supreme Court over alleged illegal diversion of over $4.371bn in recovered loot.\nHe argued that the source of the looted funds was from the federation account and as such, the federal government can’t do whatever it pleases with the returned funds.\nAccording to Mr Fayemi, the governors would have preferred a situation where the funds are returned to the federation account and allow the mechanisms of government to include governors in the decision-making process.\nWatch the interview for more…By Abel Ejikeme"
  },
  {
    "headline": "Nigeria Handlers Systematically Destroying Domestic Economy, Energy Expert Dan Kunle Says",
    "summarized_story": "Handlers of Nigeria have virtually and systematically destroyed the country’s domestic economy, that’s according to Dan Kunle, an energy finance expert and a former senior technical adviser to the former minister of state for energy.\nThis is a part of a larger reaction that continues to trail the Petroleum Industry Act with the federal government having no clue as to when to end the payment of subsidies.\nMr Kunle who on Thursday featured on an ARISE News programme, The Morning Show said as long as the subsidy gap keeps widening in the country, Nigeria will be financially insolvent within the next six months.\nAccording to the energy expert, the West African country may find it extremely difficult to pay salaries unless the Central Bank of Nigeria begins printing money.\nWatch the interview for more."
  },
  {
    "headline": "Petroleum Industry Act: Nigerian Governors Kick Against 30% Frontier Basin Funds, Will Go To Court If Options Exhausted",
    "summarized_story": "Chairman of the Nigerian Governors’ Forum, Kayode Fayemi, has said governors in the country are ready to go to court should they exhaust all available options open to resolving the brewing crisis occasioned by President Muhammadu Buhari’s signing of the Petroleum Industry Act.\nFayemi spoke exclusively to ARISE NEWS on Thursday.\nA particular sticking point is the 30% of profits set aside for ‘Frontier Basins’ in the PIA, which Fayemi says will deplete the Federation Account from which the three tiers of government share proceeds.\nHe suggested that officials in the presidency may not have shared the governor’s reservations concerning the Act with the President on his return from his visit to the United Kingdom.\nWatch the interview for more…"
  },
  {
    "headline": "Egypt Seeks Support For $2.5bn Desalination Plan to Tackle Looming Water Scarcity",
    "summarized_story": "The 17 new plants planned would run on solar and other green sources, with each built, owned and operated by Egypt’s sovereign wealth fund in partnership with a group of local and foreign investors.\nEgypt is trying its best to combact a looming water scarcity.\nThe wealth fund targets taking a minority stake in all the plants alongside the winning bidders”.\nThe 17 plants, which are targeted to produce a combined 2.8 million cubic meters of desalinated water per day, are part of a broader plan to add 6.4 million cubic meters of daily capacity by 2050, Soliman said.\nEgypt’s first-ever sovereign fund, which was established in 2018, is modeled after initiatives in Malaysia and India."
  },
  {
    "headline": "AfDB Partners Ghana to launch $7.4m Institutional Support Project",
    "summarized_story": "The Manager at the Resource Mobilization and Economic Relations Division of the Finance Ministry at the project launch, Emmanuel Fordjour, thanked the African Development Bank for supporting the government.\nThe African Development Bank Group and the Ministry of Finance in Ghana have launched a $7.4 million Institutional Support Project to strengthen domestic revenue mobilization and Debt Management Capacity.\nThe African Development Bank Country Manager for Ghana, Eyerusalem Fasika, emphasized the importance of the project to Ghana’s medium-term development objectives and the Finance Ministry’s 2018-2021 strategic plan.\nThe project complements current efforts to strengthen domestic resource mobilization in Ghana, following the challenges in revenue mobilization due to supply disruptions caused by the Covid-19 pandemic.\nThe project will help the country return to prudent debt levels through improved debt management capacity and a sustainable cash flow to smooth public spending."
  }
]