[
  {
    "headline": "15 arrested for inciting public disturbances, riot in Zamfara",
    "summarized_story": "The Zamfara State Police Command has arrested 15 suspects for alleged conspiracy, inciting public disturbance and riot along the Gusau-Kaura Namoda Road in the Kaura-Namoda Local Government Area of the state.\nBriefing journalists in Gusau, the state Commissioner of Police, Husaini Rabiu, said, “The suspects, who were armed with different sophisticated weapons, blocked Gusau-Karan Namoda Road, where they embarked on unwarranted attacks and destruction of property while threatening the lives of innocent commuters.\n“Despite the presence of security operatives coupled with their efforts to persuade the rioters to disperse to their respective homes peacefully without force, the rioters turned down the security operatives and even attempted to attack them.\n“Our security operatives, being professionally trained to handle this kind of situation, eventually dispersed them and restored normalcy without the loss of life from both sides.\n“Consequently, 15 suspects who took part in the riot were arrested at the scene in possession of four locally fabricated guns, one cutlass, one catapult, three plugs used for the locally-fabricated guns, rolls of charms and six operational motorcycles.”"
  },
  {
    "headline": "S’East insecurity: Buhari’s civil war analogy insensitive —Aisha Yesufu",
    "summarized_story": "Human rights activist, Aisha Yesufu, has described as “insensitive”, the civil war analogy by the President, Major General Muhammadu Buhari (retd.\n), that he will treat young people misbehaving in the country in the language they understand.\n“Many of those misbehaving today are too young to be aware of the destruction and loss of lives that occurred during the Nigerian Civil War.\nReacting on Wednesday, Yesufu said, “My name is Aisha Somtochukwu Yesufu.\n“I totally condemn the tweet from the President where the President is threatening the Igbo people."
  },
  {
    "headline": "Freight forwarders, PTML agrees on review of charges by 50 percent",
    "summarized_story": "By Godwin OritseFREIGHT forwarding associations at the Ports and Terminal Multipurpose Limited (PTML) Terminal, Tin Can Island Port Complex, Lagos, have expressed support for the review of handling charges at the terminal by 50%.\nPTML is the biggest roll-on-roll-off (RORO) terminal in Nigeria, handling a sizable chunk of vehicles imported into the country.\nIn a joint communiqué issued on yesterday after a meeting with the Managing Director of PTML, Ascanio Russo and his management team, the major freight forwarding associations said special consideration must be given to PTML because it has not reviewed its charges for almost a decade.\n“After a thorough explanation from the management of Grimaldi Agency (owners of PTML Terminal) on the urgent need for this increase, 50% was considered to be reasonable.\n“The management of Grimaldi thanked all stakeholders for this deliberations and understanding."
  },
  {
    "headline": "CONSTITUTION REVIEW: Scrap Senate, cut no of Reps, slash FG’s size — AKEREDOLU",
    "summarized_story": "On his part, Governor Babajide Sanwo-Olu of Lagos State reiterated the call for Special Economic Status for Lagos as the economic nerve centre of the country.\n“The Senate should be scrapped, while the House of Representatives too should not be unwieldy.\nREAD ALSO: Constitution Review: Akeredolu advocates scrapping of Senate“Our constitution falls short of this standard,” he said.\n“The need for this special status has been sufficiently articulated and justified.\n“The progress and prosperity of Nigeria are inextricably linked to the progress and prosperity of Lagos State.”Vanguard News Nigeria"
  },
  {
    "headline": "New recognition for an unusual President’s Man",
    "summarized_story": "Hon Joe Ghartey, academic, scholar and politician was a star boy in President Nana Akuffo Ado’s first term cabinet.\nWhile the President was pressured to remove his favourite Minister, recent happenings must have tutored the President that Ghartey is a true friend rather than enemy.\nHe was appointed Deputy Attorney General and Deputy Minister of Justice in 2005.\nHe was promoted and appointed substantive Attorney General and Minister of Justice in 2006, a position he held on the January 2009.\nI thank the President for his appointment I thank the people of Ghana for their patience."
  },
  {
    "headline": "Senate urges DPR to enforce ban on illegal cooking gas retailers",
    "summarized_story": "The Senate has urged the Department of Petroleum Resources (DPR) to clamp down on illegal roadside retailers of Liquefied Petroleum Gas (LPG).\nThe motion was “On the need to curb the rising cases of gas-related fire incidences, explosions and deaths in Ogun”.\nThe upper chamber also urged DPR to step up the clamp down on illegal roadside retailers of LPG who operate without a valid licence or who operate within residential areas.\nThe senate equally mandated its Committees on Gas, and Industries to investigate the cause(s) of the recent cases of Gas explosions in Ogun, other states and the FCT.\nThe resolutions were all adopted after a voiced vote by the Senate President, Ahmad Lawan."
  },
  {
    "headline": "Honeywell Flour Mills reports 36% revenue growth in full year 2021 results",
    "summarized_story": "This was due to increased production output and more efficient operational capabilities at its factories in Apapa, Sagamu and Ikeja.\nHowever, the company’s Operating Profit grew faster than revenue at 39%, from N5.4 billion in FY 2020 to N7.6 billion in FY 2021.\nSpeaking on the Full Year 2021 financial results, Lanre Jaiyeola, Managing Director, Honeywell Flour Mills, Plc., said: “In an extremely challenging year caused by unprecedented global disruptions and uncertainties, we achieved 36% revenue growth and record-breaking success through sheer grit and doggedness of our workforce.\nHoneywell Flour Mills Plc is a leading foods company producing, marketing and selling of high-quality food products in the fast-moving consumer goods (FMCG) space.\nThe Company’s range of products which have become staples in Nigerian homes includes: Honeywell Superfine Flour, Honeywell Bakers Delight Flour, Honeywell Pastry Flour, Honeywell Semolina, Honeywell Whole Wheat Meal, Honeywell Macaroni, Honeywell Spaghetti and the popular variety of Honeywell Noodles."
  },
  {
    "headline": "Matawalle tells security agencies",
    "summarized_story": "Governor Bello Matawalle of Zamfara State on Wednesday ordered all residents of the state to handover illegal firearms in their possession to a nearby police station within seven days.\nMatawalle in a statement urged security agencies to shoot bandits, persons or groups of people seen with Ak-47 or any weapons.\nMatawalle added that his administration will support the police and other security agencies with all the necessary logistics to discharge their duties effectively.\nPolice nab four suspects for unlawful possession of firearms in Kogi”Only those approved by law or the security agencies are to carry guns and other sophisticated weapons, anyone found in unlawful possession of guns should be shot on the spot.\n“The whole area of Zamfara State is declared to be a proclaimed district."
  },
  {
    "headline": "Kaduna announces new date for LG elections",
    "summarized_story": "The Kaduna State Independent Electoral Commission (KADSIECOM) has fixed Saturday, August 14, 2021 as the new date for the rescheduled local government elections.\nIbrahim Sambo, acting Chairman of the Commission, made the announcement after a meeting with stakeholders on Wednesday at the commission’s office.\nThe acting chairman noted that results of all political parties’ primary elections stand as submitted.\n2 of the Kaduna State Independent Electoral Commission.\nINEC announces date for 2023 general elections"
  },
  {
    "headline": "Police confirms killing of Gov Ortom’s security aide",
    "summarized_story": "The Plateau State Police Command has confirmed the killing of the Senior Special Assistant to the Benue State Governor, Samuel Ortom on Security, AIG Christopher Dega (Rtd) by gunmen.\nDAILY POST had reported that the governor’s aide was murdered by unknown gunmen in Jos, the Plateau State Capital.\nThe confirmation was contained in a statement issued and made available to DAILY POST on Wednesday by the Plateau State’s Police Public Relations Officer, ASP Ubah Gabriel Obaba.\nAccording to the PPRO, the command has arrested some suspects in connection with the crime.\nMeanwhile, the investigation is ongoing.”Similarly, when contacted, the Chief Press Secretary to Governor Samuel Ortom confirmed the unfortunate incident."
  },
  {
    "headline": "Secession: Moghalu urges Buhari to hold talks with Nnamdi Kanu, Sunday Igboho",
    "summarized_story": "The 2019 presidential candidate of the Young Progressive Party (YPP), Prof. Kingsley Moghalu, has urged the Federal Government to dialogue with secessionists like Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB)and Sunday Adeyemo also known as Sunday Igboho.\nFeaturing on Channels Television’s breakfast show, Sunrise Daily, Moghalu said: “I think that the government should be able to invite, whether it is IPOB or Sunday Igboho, all the secessionists; invite them to the table.\n2023: Moghalu declares intention to run for President“They are essentially political agitators.\n“Can we address the agitations?\nDon’t be afraid to address the core reasons behind the agitation because they are crying out for justice."
  },
  {
    "headline": "IPOB: Nigerians ask Twitter to suspend Buhari’s account",
    "summarized_story": "Nigerians on Twitter, are currently calling for the suspension of President Muhammadu Buhari from the micro blogging platform.\nThe people are pleading with the Chief Executive Officer of Twitter, Jack Dorsey to suspend Buhari’s account.\n‘Those out to destroy my govt will be dealt with’ – BuhariBuhari’s Twitter account is currently being reported by Nigerians who believe the last part of the thread of his tweet is a threat to IPOB and ESN.\nAlso, the Twitter users likened Buhari’s statement to that of the former United States President Donald Trump which earned the latter a permanent suspension.\nTrump’s Twitter account was “permanently suspended… due to the risk of further incitement of violence,” Twitter had said."
  },
  {
    "headline": "Why I chose Annie above other women, by 2 Baba",
    "summarized_story": "By Ekaete BasseyAward-winning 2face Idibia or 2Baba has opened up on why he married his wife, Annie Idibia Innocent despite having kids from several other women.\nThe ever-green “African Queen” singer is a father of seven; five from his previous relationships with other women and two with his wife, Annie Idibia.\nIn an interview with Hypertek’s Digital boss, he disclosed why he opted for Annie above others.\nHe explained all his baby mamas are well-to-do and very much learned but Annie possessed the latter and not the former.\nNo, so to answer your question, I did not choose who had more to offer me, I chose Annie because she offered me her all when we had very little”."
  },
  {
    "headline": "I didn’t call for scrapping of Senate – Akeredolu",
    "summarized_story": "By Osagie Otabor, AkureOndo Governor Oluwarotimi Akeredolu has denied calling for the scrapping of the Senate in the review of the 1999 constitution being undertaken by the National Assembly.\nAkeredolu was represented by his Deputy, Lucky Aiyedatiwa, at the House of Representatives public hearing on the review of the 1999 constitution.\nAkeredolu described the report quoting him as calling for the scrapping of the Senate as an “interpretative error.”The Ondo Governor, who spoke in statement by his Commissioner for Information and Orientation, Donald Ojogo, said he had, like many other well-meaning Nigerians, identified Nigeria’s Bicameral Legislature and its full-time status as plausibly reducible weights to cut cost.\n“Therefore, ascribing or misinterpreting this proposal to isolatedly, depict a call for the scraping of the Nigerian Senate is erroneous.\nThe call for a part-time Unicameral Federal Parliament remains and shall be pursued with all vigour.”"
  },
  {
    "headline": "JAMB blames candidates for hitches in UTME registration",
    "summarized_story": "By Frank Ikpefan, AbujaThe Joint Admissions and Matriculation Board (JAMB) has said that most of the challenges encountered by applicants during registration for the 2021 Unified Tertiary Matriculation Examinations were due to their failure to follow simple instructions.\nRegistrar of JAMB, Prof Is – haq Oloyede stated this during visits to computer-based test centres in Kogo – Bwari, and Garki 2 on Wednesday.\nADVERTISEMENTThe registrar said over 80 percent of registration problems were linked to candidates’ fault.\nOloyede said: “Many of them (candidates) were sending wrong things and commands for NIN, making NIMC unable to verify such numbers.\nThe board said only candidates with genuine reasons will be allowed to register within the timeframe."
  },
  {
    "headline": "JUST IN: Senate receives Bill to extend teachers’ retirement age by five years",
    "summarized_story": "By Sanni Onogu, AbujaThe Senate, on Wednesday, received President Muhammadu Buhari’s executive Bill which seeks to increase the retirement age for teachers in the country from 60 to 65 years.\nBuhari, in a letter read on the floor by Senate President, Ahmad Lawan, noted that the Bill provides for harmonised retirement age for teachers in the country.\nBuhari’s letter titled: “Transmission of the harmonised retirement age for Teachers in Nigeria Bill 2021 to the National Assembly for consideration,” reads:“Pursuant to Section 58 subsection 2 of the 1999 Constitution of the Federal Republic of Nigeria (as amended), I forward herewith the harmonised retirement age for teachers in Nigeria Bill, 2021 for consideration by the Senate.\n“The harmonised retirement age for teachers in Nigeria Bill 2021 seeks to increase the retirement age for teachers from 60 to 65 years, and also increase the possible years of service from 35 to 40 years.\nIt would be recalled that Buhari had in October 2020 approved a special salary scale and new retirement age for teachers in commemoration of the World Teachers Day."
  },
  {
    "headline": "Buhari presides over FEC meeting",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari is currently presiding over the virtual meeting of the Federal Executive Council at the First Lady Conference Room in the state house.\nThe Vice President, Yemi Osinbajo, Secretary to the Government of the Federation, Boss Mustapha and Chief of Staff to the President, Prof. Ibrahim Gambari are physically attending the meeting.\nAlso Physically in attendance are eight Ministers including Information and Culture, Lai Mohammed; Finance, Zainab Ahmed and Justice, Abubakar Malami.\nOthers are the Ministers of state Industry, Trade and investment, Maryam Katagum; Environment, Mohammed Abubakar; Works and Housing, Babatunde Fashola and that of Niger Delta, Godswill Akpabio.\nThe Head of Service of the Federation, Dr. Folasade Yemi-Esan and other Ministers are participating in the weekly cabinet meeting from their various offices in Abuja."
  },
  {
    "headline": "Killings: Senate observes one minute silence 8 times",
    "summarized_story": "From Fred Itua, AbujaIn a historic move, the Senate, yesterday, observed a one minute silence eight times to mourn hundreds of Nigerians killed across various states of the federation in recent times.\nThis is even as President of the Senate, Ahmad Lawan, revealed that legislative interventions must be stepped-up by the National Assembly to protect Nigerians against the spate of insecurity in the country.\nLawan said legislative interventions were required to reduce the number of deaths caused by criminal activities.\nHe added that such interventions needed to be backed by collaborative efforts between the legislature, executive and Nigerians.\nIt is very important that we step up our legislative intervention in ensuring that we protect the lives and properties of Nigerians to reduce the incidence of one-minute silence."
  },
  {
    "headline": "Niger, Abia govs, Kalu lament death of NECO Registrar, Obioma",
    "summarized_story": "In his own reaction, governor Ikpeazu described Obioma’s death as another blow to the people of Abia State.\nAgainst the back drop of rumours making the rounds that Prof Obioma was assassinated, Ikpeazu stated that the death of the NECO Registrar was due to natural cause.\n“He was always prepared to come down to Abia even at the shortest of notices, once it had to do with the good of Abia State.\nKalu, while commiserating with the Obioma family, prayed to God to repose the soul of the deceased.\n“Our prayers and thoughts are with the Obioma family at this period of grief."
  },
  {
    "headline": "Constitution review: Govs, others make fresh demands",
    "summarized_story": "From Bamigbola Gbolagunte, Akure, Joe Effiong, Uyo, Gyang Bere, Jos, Olanrewaju Lawal, Birnin KebbiThe Zonal Public Hearing on the review of the 1999 constitution kicked off across the six geopolitical zones, yesterday, with a flurry of demands and proposals.\nSpeaker of the House of Representatives, Femi Gbajabiamila, faulted the 1999 constitution, describing it as substandard and product of hurried national compromise.\nGbajabiamila said during the zonal public hearing on the review of the 1999 constitution in Lagos, yesterday, that the constitution falls below standards because it was put in place to ensure that the military returned to the barracks.\nAkeredolu, represented by his deputy, Mr Lucky Aiyedatiwa, said the country should consider dropping the current bicameral structure of the National Assembly, and adopt unicameral legislature.\nWhatever views and memos you submit here today and tomorrow will form part of the working documents and views of the Constitution Review exercise by the 9th Assembly,” he said."
  },
  {
    "headline": "Insecurity: NANS demands temporary closure of North West, North Central schools",
    "summarized_story": "From Priscilla Ediare, Ado-EkitiNational Association of Nigerian Students (NANS) has declared June 12 as “national day of protest” for Nigerian students.\nIts National President, Sunday Asefon, said the country has nothing to celebrate marking June 12 as Democracy Day when students were being killed and kidnapped by bandits.\nHe declared June 11 and 12 as national days of prayers for Nigeria to win the war against banditry, killings and kidnappings across the nation.\nHe also demanded immediate and temporary closure of schools in the North West and North East until adequate security is put in place to guarantee the safety of students.\nHe said incessant and incurable kidnapping of students in the North West and North Central calls for immediate and radical action."
  },
  {
    "headline": "Breaking: Gunmen Kill Ortom’s Aide, Retired AiG Chris Dega, in Jos",
    "summarized_story": "By Seriki AdinoyiGunmen have killed a Senior Special Assistant (SSA) on Security to Governor Samuel Ortom of Benue State, Mr Christopher Dega, a retired Assistant Inspector General (AIG) of Police in Jos, Plateau State Capital.\nThe Plateau State Police Command in a statement signed by its Public Relations Officer, Mr Gabriel Ogaba, said: “It is on a sad note that the command received an ugly report of the death of AIG Christopher Dega (Rtd).\nThe police said that some suspects had been arrested, while investigation was ongoing.\nAIG Dega had a brilliant career in the Nigerian Police Force and was Commissioner of Police in Borno and Edo States.\nHe hailed from Katsina Ala local government area in Benue state."
  },
  {
    "headline": "Promoters of Insurrection Are in for a Rude Shock, Says Buhari",
    "summarized_story": "The INEC delegation came to brief the president on the series of attacks on facilities of the electoral body nationwide.\nHe added that the Senate was tired of observing one-minute silence for victims of insecurity.\nWe’ll meet all INEC’s demands.”He, however, warned those bent on destroying the country through promoting insurrection, and burning down critical national assets to back off as a rude shock awaits them soon.\nHe stated yesterday that that the lawmakers were tired of observing one-minute silence for the victims of insecurity.\nAccording to him, it is imperative for the National Assembly to step up legislative interventions to reduce the number of deaths caused by criminal activities."
  },
  {
    "headline": "Federalism, LG Autonomy Top Demands at Constitution Review Hearings",
    "summarized_story": "Such a document, he added, should allow for true federalism where Nigeria states are autonomous entities with power to run their affairs.\nLabour unions demanded autonomy for local government, the legislature and the judiciary for improved service delivery, autonomy.\nPresenting the position of Benue State, representative of the governor, and Speaker of the Benue State House of Assembly, Hon.\nEarlier, while addressing the audience, Plateau State Governor, Hon.\nSimon Lalong, had urged Nigerians to be bold, sincere and patriotic in their submissions to the constitution review panel in their quest for a greater nation."
  },
  {
    "headline": "Oil Price Hits 30-month High on OPEC’s Demand Rally Forecast",
    "summarized_story": "Brent crude, Nigeria’s oil benchmark, crossed the much-awaited $70 mark, hitting $71.33 at a point.\nAt the meeting, OPEC+ stuck to its plan to hike oil output in July, pressing ahead with an increase of 841,000 barrels a day in July, following hikes in May and June.\n“The demand picture has shown clear signs of improvement,” Saudi Energy Minister, Prince Abdulaziz bin Salman, said as the ministerial meeting started.\n“In this regard, the 15th OPEC and non-OPEC ministerial meeting agreed to extend the very generous compensation period for overproduced volumes until the end of September 2021.\n“Our continued contributions to sustainable oil market stability depend upon all participants achieving 100 per cent conformity and, where necessary, working dutifully to compensate for overproduction,” he said."
  },
  {
    "headline": "Insecurity: N’ Assembly Tired of Observing a Minute Silence for Casualties, Says Lawan",
    "summarized_story": "One minute silence observed six times at Senate plenary TuesdayBy Deji Elumoye and Emameh GabrielThe Senate has expressed concern over the spate of one minute silence usually observed at its plenary as a result of deaths associated with security challenges facing the nation.\nThis is just as the upper chamber at Tuesday’s plenary observed one minute silence six times for those who lost their lives through killings and murders in the wake of security issues across the country.\nAccording to him, it is imperative for the National Assembly to step up legislative interventions to reduce the number of deaths caused by criminal activities.\nHe added that such interventions would be backed by collaborative efforts between the legislature, executive and Nigerians to address Nigeria’s security challenges.\nHe said: “It is very important that we step up our legislative intervention in ensuring that we protect the lives and properties of Nigerians to reduce the incidence of one-minute silence."
  },
  {
    "headline": "BREAKING: Gunmen Kill Benue Governor, Ortom’s Aide On Security",
    "summarized_story": "Some unknown gunmen have killed Senior Special Assistant On Security to Benue Governor, Samuel Ortom, AIG Christopher Dega (Rtd) in Jos, Plateau State Capital.\nIt was learnt that Dega was shot in the chest several times by gunmen on Tuesday, The Nation reports.\nAIG Dega was in the Nigeria Police Force and was twice Commissioner of Police in Borno and Edo states.\nHe hailed from Katsina Ala Local Government Area of Benue state .\nIn March, Ortom cried out that he escaped an assassination attempt on his life as he fled gunmen who attacked him on his farm."
  },
  {
    "headline": "BREAKING: Gunmen Kill Benue Governor, Ortom’s Aide On Security",
    "summarized_story": "Some unknown gunmen have killed Senior Special Assistant On Security to Benue Governor, Samuel Ortom, AIG Christopher Dega (Rtd) in Jos, Plateau State Capital.\nIt was learnt that Dega was shot in the chest several times by gunmen on Tuesday, The Nation reports.\nAIG Dega was in the Nigeria Police Force and was twice Commissioner of Police in Borno and Edo states.\nHe hailed from Katsina Ala Local Government Area of Benue state .\nIn March, Ortom cried out that he escaped an assassination attempt on his life as he fled gunmen who attacked him on his farm."
  },
  {
    "headline": "BREAKING: Gunmen Kill Benue Governor, Ortom’s Aide On Security",
    "summarized_story": "Some unknown gunmen have killed Senior Special Assistant On Security to Benue Governor, Samuel Ortom, AIG Christopher Dega (Rtd) in Jos, Plateau State Capital.\nIt was learnt that Dega was shot in the chest several times by gunmen on Tuesday, The Nation reports.\nAIG Dega was in the Nigeria Police Force and was twice Commissioner of Police in Borno and Edo states.\nHe hailed from Katsina Ala Local Government Area of Benue state .\nIn March, Ortom cried out that he escaped an assassination attempt on his life as he fled gunmen who attacked him on his farm."
  },
  {
    "headline": "Eight Abductions That Shook Nigeria",
    "summarized_story": "Though, it happens all over Nigeria, the Northern part of country still remains a hotbed of kidnappings by terrorists and bandits.\nThis brought about a movement of #BringBackOurGirls protest in Nigeria spearheaded by a former Education Minister, Oby Ezekwesili.\nThe Nigerian Air Force and Nigeria Army deployed their men to search for them, but all to no avail.\nIt was on 27th February, that the government of Niger State announced the bandits had released all 42 hostages.\nA video revealed how scores of people were running helter-skelter on the Tegina-Zugero highway in Niger State, during the assault."
  },
  {
    "headline": "Eight Abductions That Shook Nigeria",
    "summarized_story": "Though, it happens all over Nigeria, the Northern part of country still remains a hotbed of kidnappings by terrorists and bandits.\nThis brought about a movement of #BringBackOurGirls protest in Nigeria spearheaded by a former Education Minister, Oby Ezekwesili.\nThe Nigerian Air Force and Nigeria Army deployed their men to search for them, but all to no avail.\nIt was on 27th February, that the government of Niger State announced the bandits had released all 42 hostages.\nA video revealed how scores of people were running helter-skelter on the Tegina-Zugero highway in Niger State, during the assault."
  },
  {
    "headline": "Malami: People taking advantage of FG’s respect for human rights to commit insurgency",
    "summarized_story": "Abubakar Malami, minister of justice, says some people are taking advantage of the federal government’s respect for human rights and rule of law to cause insurgency.\nAdvertisementSpeaking during a Nigerian Television Authority (NTA) programme on Tuesday, Malami warned that the Buhari administration cannot sit back and watch them take up arms to render the government “helpless”.\n“Consider chapter four of the constitution on the enforcement of fundamental human rights; people are now operating much more in breach as far as the fundamental human rights enforcement is concerned as against operating in such a way that the rights are intended to bring about a harmonious co-existence in the system.\nAdvertisement“How can you imagine a Nigerian taking arm; one Nigerian killing over 100 people, only out of the spirit of perhaps the consideration for the enforcement of fundamental human rights.\n“So, perhaps, what is unfolding today is on the account of religious observance of the rule of law as enshrined in the constitution."
  },
  {
    "headline": "Malami: People taking advantage of FG’s respect for human rights to commit insurgency",
    "summarized_story": "Abubakar Malami, minister of justice, says some people are taking advantage of the federal government’s respect for human rights and rule of law to cause insurgency.\nAdvertisementSpeaking during a Nigerian Television Authority (NTA) programme on Tuesday, Malami warned that the Buhari administration cannot sit back and watch them take up arms to render the government “helpless”.\n“Consider chapter four of the constitution on the enforcement of fundamental human rights; people are now operating much more in breach as far as the fundamental human rights enforcement is concerned as against operating in such a way that the rights are intended to bring about a harmonious co-existence in the system.\nAdvertisement“How can you imagine a Nigerian taking arm; one Nigerian killing over 100 people, only out of the spirit of perhaps the consideration for the enforcement of fundamental human rights.\n“So, perhaps, what is unfolding today is on the account of religious observance of the rule of law as enshrined in the constitution."
  },
  {
    "headline": "PHOTOS: Parents throng school where 156 children were kidnapped in Niger",
    "summarized_story": "As Nigerians were heaving a sigh of relief at the news of the release of abducted Greenfield University students, a group of bandits dealt the nation another blow.\nAdvertisementSalihu Tanko Islamiyya School in Tegina town, Raffi LGA of Niger state, was the target this time and the gunmen kidnapped 156 students, many of which were children.\nTheCable had earlier reported that Abubakar Alhassan, the school headteacher, said the abductors are demanding N110 million ransom before the children are freed.\nHere is an update from Tegina in photos.\nAdvertisementAdvertisementAdvertisementPhoto credit: Mustapha Gimba"
  },
  {
    "headline": "PHOTOS: Parents throng school where 156 children were kidnapped in Niger",
    "summarized_story": "As Nigerians were heaving a sigh of relief at the news of the release of abducted Greenfield University students, a group of bandits dealt the nation another blow.\nAdvertisementSalihu Tanko Islamiyya School in Tegina town, Raffi LGA of Niger state, was the target this time and the gunmen kidnapped 156 students, many of which were children.\nTheCable had earlier reported that Abubakar Alhassan, the school headteacher, said the abductors are demanding N110 million ransom before the children are freed.\nHere is an update from Tegina in photos.\nAdvertisementAdvertisementAdvertisementPhoto credit: Mustapha Gimba"
  },
  {
    "headline": "Senate passes bill abolishing HND/BSc dichotomy",
    "summarized_story": "A bill seeking to abolish the dichotomy between higher national diploma (HND) and bachelor’s degree has passed third reading at the senate.\nAdvertisementThe bill passed third reading on Wednesday after Ahmad Kaita, chairman of the committee on tertiary institutions, presented a report and six clauses were voted on by the senators.\nThe house of representatives passed its own version of the bill in May 2019.\nWhile presenting his report, Kaita said the legislation when assented to and passed will give polytechnic graduates confidence and impact on the country’s economy positively.\nAdvertisementAfter the clauses of the bill were approved by the legislators in the “committee of the whole”, Senate President Ahmad Lawan said polytechnic graduates will be encouraged by this action."
  },
  {
    "headline": "Sawari Ventures is leading investments in North Africa",
    "summarized_story": "In today’s edition of Ask an Investor I talk to one of the oldest venture capital firms in the Middle East and North Africa – Sawari Ventures.\nFikry pointed out that Sawari Ventures helped Almentor in three critical areas: Governance, networking with the ecosystem and technical support.\nI talk to Tamer Azer, a principal at Sawari Ventures; he joined the firm in 2019.\nDaniel Adeyemi: Tell me about Sawari VenturesTamer Azer: Sawari ventures has been around since 2010.\nWhen Sawari Ventures raised its North Africa fund, we invested in Flat6Labs Cairo and Flat6Labs Tunis."
  },
  {
    "headline": "For Rising Tide Africa, more African women should build diversified investment portfolios",
    "summarized_story": "Rising Tide Africa wants more women to be bolder at investment tables, to dream bigger and ask for more money to do bigger things.\nIvana Osagie: Founding member, Rising Tide Africa.\nWhat exactly does Rising Tide Africa do?\nThese reasons and more formed the foundation of Rising Tide Africa.\nInvestment opportunity pipeline for startupsApart from investing solely in female-led companies, Rising Tide looks out for all kinds of tech-enabled startups."
  },
  {
    "headline": "How Uche Ogboi became CEO of Lori Systems and her billion-dollar mission for African logistics",
    "summarized_story": "As CEO of Lori Systems, Uche Ogboi will bear some of the weight of African logistics on her shoulders.\nJosh Sandler, Lori’s founding CEO, first met Ogboi in 2017.\nHer due diligence process impressed Sandler who was looking out for someone to bring structure and help scale the logistics startup’s operations.\nLast November, they received an undisclosed investment and signed a partnership agreement with Imperial Logistics, a global logistics company.\nNow she’ll probably sleep even less with the weight of African logistics on her shoulders."
  },
  {
    "headline": "Infinix Launches Award-Winning NOTE 10 Pro Series. Powerful Performance. Iconic Design",
    "summarized_story": "Lagos, Nigeria – June 1, 2021 – Infinix launched the all-new NOTE 10 series, a new portfolio of premium smartphones including the NOTE 10, NOTE 10 Pro, and NOTE 10 Pro near-field communication (NFC).\nThe design is available in four colors: 95° Black, 7° Purple, Emerald Green (exclusive to NOTE 10) and Nordic Secret (exclusive to NOTE 10 Pro).\nThe NOTE 10 series delivers stunning professional-quality images and beautiful nightscape imagery, both in daylight and at night.\nPacked with Power & PerformanceFor super-fast data processing and response times, the NOTE 10 Pro and NOTE 10 Pro NFC are powered by the award-winning MediaTek Helio G95 processor.\nYou can preorder the device for just N2500 or N2000 for Note 10 Pro and Note 10 respectively."
  },
  {
    "headline": "Binance To Offer $30,000+ in Prizes To Hackathon Participants in Africa",
    "summarized_story": "Binance, the world’s leading blockchain ecosystem and cryptocurrency infrastructure provider will hold a DeFi & NFT hackathon for African blockchain enthusiasts from June 7 to June 28, 2021.\nIn line with the company’s commitment to Africa and the growth of the blockchain ecosystem, Binance continues to empower blockchain engineers.\nParticipants will also have the opportunity to win limited edition NFTs and Binance Swags during the Hackathon period.\nRegister for the opening ceremony of the Binance Hackathon HEREWho can participate: All developers, builders, and creators from Africa (hackathon is open to both beginners and non-beginners)How to participate in the hackathon: Join the Telegram group here and sign up through the Hackerlink special landing page where all hackathon projects will be submitted.\nWhat to expect: All DeFi and NFT projects will be built on the Binance Smart Chain and made completely open source."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Nourishing dairy with tech, a path to Nigeria’s economic growth?",
    "summarized_story": "Sadly, two decades later, Nigeria’s milk production pales in comparison to its potential.\nAdvertisementThe Commonwealth Scientific Industrial Research Organisation (CSIRO) reports that pastoral systems, which yield meagre output, produce 90% of Nigeria’s milk.\nDeveloped countries have employed scientific and technological innovations in the dairy sector.\nAccording to him, companies in milk-producing countries would be hesitant to develop Nigeria’s dairy industry.\nWhile these numbers nullify Abubakar claims, they do not reduce the viability of the dairy sector as a major source of revenue."
  },
  {
    "headline": "TalentQL launches ‘Pipeline’, Gokada’s super app ambitions, Farmcrowdy CEO steps down",
    "summarized_story": "Good day,Chimgozirim hereToday I’ll be discussing:TalentQL’s plan to train more senior developersGokada’s super app playFarmcrowdy’s leadership changeTalentQL launches PipelineTalent outsourcing startup, TalentQL, has launched Pipeline, a new programme to upskill mid-level software engineers to senior engineers.\nTalentQL CEO, Adewale Yusuf (pictured above, first from left) reveals that as much as 90% of their clients are seeking senior engineers.\nAdvertisementLaunched in 2018 as a ride-hailing startup, a ban on ride-hailing operations by the Lagos State Government meant it had to change its focus.\nDeparting from the norm, Ugandan ride-hailing startup, Safeboda, launched its services in Ibadan.\nOnyeka Akumah steps down as CEO of FarmcrowdyFrom L -R Onyeka Akumah (Former CEO, Farmcrowdy) and Akindele Phillips (CEO Farmcrowdy)."
  },
  {
    "headline": "Nigeria has lost 15.5 million subscribers following the SIM registration ban",
    "summarized_story": "Nigeria is reeling from the effect of the SIM registration ban, as mobile subscribers have dropped drastically in just four months.\nPooling data from the Nigerian Communications Commission (NCC), Intelligence by Techpoint reveals that Nigeria lost 15.5 million subscribers between December 2020 and March 2021.\npic.twitter.com/TdPYGSNAgM — Intelligence by Techpoint (@TechpointIntel) June 1, 2021In 2020, Nigeria had 190 million mobile subscribers, but that number hit 192 million in March 2021.\nPer the NCC, Nigeria lost 9.2 million Internet subscribers between December 2020 and March 2021.\nMTN was the hardest hit, with 3.8 million Internet subscribers lost."
  },
  {
    "headline": "Bangladesh, Ethiopia show Nigeria how to create jobs through textile",
    "summarized_story": "Bangladesh, Ethiopia show Nigeria how to create jobs through textileFrom Bangladesh to Ethiopia, low-wage manufacturing jobs are bridging income gaps, lifting many out of poverty, and ensuring a certain level of inclusive economic growth.\nThese countries are taking advantage of the cotton, textile, and apparel industry, for instance, to create jobs.\nRead Also: Low-wage manufacturing jobs can dent Nigeria’s unemployment Additionally, low-wage manufacturing jobs have…"
  },
  {
    "headline": "Competition drives local airlines to put market before cost",
    "summarized_story": "As competition intensifies in Nigeria’s domestic aviation industry, some airlines are left with little or no choice to survive by charging below their operating cost, as they focus on retaining or gaining better market share.\nNew entrants are adopting strategies such as low fares, comfort and timeliness to attract the market, as operating cost become secondary, at least at these early stages.\nExperts say these prices are below operating cost, considering the high exchange rate, depleting fleet size, high cost of aviation fuel, labour cost and multiple taxations airlines have to pay.\nFurther checks show that with the current exchange rate and increase in aviation fuel, which currently cost about N220 per litre, airlines operate a B737 aircraft at a cost of about $6,000.\nFor Tolu Odutola, a pilot and aviation expert, factors that influence pricing of airfare include aviation fuel, flight distance, competition, timing of purchase, timing of flight, passenger appetite and empty middle seat."
  },
  {
    "headline": "Outsourcing can cut Nigeria’s drug import by 25%",
    "summarized_story": "Nigeria can productively engage about 60 percent of its under-utilized pharmaceutical manufacturing capacity and cut importation of pharmaceutical products by at least 25 percent with the adoption of contract manufacturing (outsourcing), industry analysts and stakeholders have said, making a case for growth.\nContract manufacturing is one of the strategies emerging market peers have adopted to own a significant share of global pharmaceutical production, by servicing the rising need for outsourcing different aspects of production.\nThis implies as much as 70 percent of marketed drugs by about 130 pharmaceutical firms were imported.\nNIROPHARM sees this as a growth area that the government can pursue strongly to position Nigeria’s manufacturing sector better on the continent.\nBut if you present a product that is in partnership with GSK, the trust will extend to this product and position Nigeria better,” Ehighebolo said."
  },
  {
    "headline": "Obaseki flags off COVID -19 second dose vaccination, urges eligible persons to take second jab – Nigerian Observer",
    "summarized_story": "“It is heartwarming today that we continue with our gradual return to our normal lives with the commencement of the second dose coronavirus vaccination.\nI am here today to flag off the second dose vaccination.\nUnfortunately, I can’t take my second dose today because the time scheduled for me is not due.\nHe added, “We have vaccinated 38,500 people in the first phase of the first dose vaccination exercise.\nWe are expecting that 38,500 people will come forward for their second dose."
  },
  {
    "headline": "Legislate On Child Protection, JDPCI Urges Lawmakers – Nigerian Observer",
    "summarized_story": "Speaking on the the theme of the 2021 Child Protection Day, “The Role of Parents and Caregivers in the Protection of Children, the Coordinator of the Edo State Child Protection Network, Barr.\nHe listed the types of Child Abuse to include Physical, Emotional and Sexual Abuses, asserting that abusing a child constituted the worst thing anybody could do to a child.\nWhen you protect children, you are not doing them a favour.\nIt is the duty of everyone to protect children because we are all stakeholders.\n“Not putting a child in school is another form of child abuse."
  },
  {
    "headline": "INSECURITY: Nigeria Customs Summons Private Aircraft Owners For Verification Principles – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – In its efforts to address the insecurity affecting the nation from different angles, the Nigeria Customs Service (NCS) has called on private aircraft owners for verification from June 7- to July 6, 2021 to identify the true owners and properly monitor.\nAddressing newsmen, the National Public Relations Officer, Deputy Comptroller of Customs, DC Joseph Attah, noted the measure is to ensure strict compliance with the NCS regulations and revenue generation through the payment of 1 percent Comprehensive Import Supervision Scheme.\nAttah insisted failure to comply with the verification exercise will certainly lead to the sanction of the defaulters.\nHe attributed the feat to the strict implementation of all extant rules governing imports, exports, and Excise in Nigeria.\nHe attributed it to robust stakeholder sensitization, increasing the level of compliance from stakeholders, and improved working relationships with the National Assembly."
  },
  {
    "headline": "Another Killing In Imo: NIS Chief Provost Murder By Unknown Gunmen – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The wave of killings in Imo State continued Monday as the Chief Provost of Nigerian Immigration Service (NIS), Imo State Command, Okiemute Mrere, has been killed by unknown gunmen.\nAuthoritative source revealed that Mrere, was assassinated on Saturday night on Owerri- Port Harcourt Road in Owerri.\nMrere, was riding a Hilux van belonging to NIS when he was allegedly ambushed, shot and killed by the unknown assailants.\nHe said “The official Hilux van he was riding in as of the time he was attacked was riddled with bullet holes.”According to the source,” the chief provost of Nigerian Immigration service, Imo state Command, Okiemute Mrere, has been assassinated.\nHe was riding in his official Hilux van when he was attacked, shot and killed."
  },
  {
    "headline": "‘Ku bazama cikin daji ku ceto ɗaliban Islamiyya 200 da aka sace’ -Gargaɗin Buhari ga jami’an tsaro",
    "summarized_story": ""
  },
  {
    "headline": "‘Ku bazama cikin daji ku ceto ɗaliban Islamiyya 200 da aka sace’ -Gargaɗin Buhari ga jami’an tsaro",
    "summarized_story": ""
  },
  {
    "headline": "Zan maida hankali wajen inganta rayuwar sojojin Najeriya",
    "summarized_story": "Sabon Babban Hafsan Sojojin Najeriya, Manjo Janar Faruk Yahaya, ya sha alwashin inganta rayuwar sojojin Najeriya, tare da ƙara himma wajen ganin sun ƙara samun ƙwarewa da kuma yin sakayya ga waɗanda su ka yi rawar gani.\nYahaya ya ce nauyin da ke wuyan sojojin Najeriya gagarimi ne, sai ya ƙara yin kira ga ɗaukacin sojojin Najeriya su ƙara tashi tsaye haiƙan wajen kare ƙasar nan.\nYa kuma yi alƙawarin gudanar da mulki wanda zai zama nagari abin koyi a bisa tsarin da hukumar sojojin Najeriya ta shimfiɗa.\nSannan ya yi alƙawarin maida rundunar sojojin Najeriya mashahuriya kuma ƙaƙƙarfa, yadda za ta zama mai ƙarfin kare ƙasar nan daga dukkan wata barazanar tsaron da ta taso a Najeriya.\nDaga nan ya yi wa Shugaba Muhammadu Buhari alƙawarin biyayya da kuma rantsuwar kare ƙasar nan daga hare-hare ko wata barazana ta ciki da wajen Najeriya."
  },
  {
    "headline": "Zan maida hankali wajen inganta rayuwar sojojin Najeriya",
    "summarized_story": "Sabon Babban Hafsan Sojojin Najeriya, Manjo Janar Faruk Yahaya, ya sha alwashin inganta rayuwar sojojin Najeriya, tare da ƙara himma wajen ganin sun ƙara samun ƙwarewa da kuma yin sakayya ga waɗanda su ka yi rawar gani.\nYahaya ya ce nauyin da ke wuyan sojojin Najeriya gagarimi ne, sai ya ƙara yin kira ga ɗaukacin sojojin Najeriya su ƙara tashi tsaye haiƙan wajen kare ƙasar nan.\nYa kuma yi alƙawarin gudanar da mulki wanda zai zama nagari abin koyi a bisa tsarin da hukumar sojojin Najeriya ta shimfiɗa.\nSannan ya yi alƙawarin maida rundunar sojojin Najeriya mashahuriya kuma ƙaƙƙarfa, yadda za ta zama mai ƙarfin kare ƙasar nan daga dukkan wata barazanar tsaron da ta taso a Najeriya.\nDaga nan ya yi wa Shugaba Muhammadu Buhari alƙawarin biyayya da kuma rantsuwar kare ƙasar nan daga hare-hare ko wata barazana ta ciki da wajen Najeriya."
  },
  {
    "headline": "Samun ilimi da wuri shine zai magance yada bayanan karairayi a Najeriya – In ji Babban Darektar OSIWA",
    "summarized_story": ""
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "FY 2020: Honeywell Flour Mills grows profit by 73.1%",
    "summarized_story": "BY EMEKA EJEREHoneywell Flour Mills has joined the league of companies defying the COVID-19 pandemic to maintain a good profit margin.\nThe food-producing company reported a profit after tax of N1.13 billion in its 2020 audited full-year financial result ended 31st March 2021, growing its bottom line by 73.1% from N650.49 million recorded in 2019.\nIn addition to recording double-figured growth despite the effect of the covid-19 pandemic on the Nigerian economy, it also crossed the N100 billion revenue mark in the review year.\nThe Sagamu plant followed with total revenue of N19.1 billion, accounting for 17.4% of the total revenue, while Ikeja generated N5.49 billion for the company.\nHoneywell Flour Mills Plc is a leading food company producing, marketing, and selling food products in the fast-moving consumer goods (FMCG) space in Nigeria."
  },
  {
    "headline": "JUST IN: Governor Ortom’s security aide shot dead",
    "summarized_story": "BY EMEKA EJEREThe Senior Special Assistant to Benue Governor Samuel Ortom on Security, Christopher Dega, has been shot dead, according to a report by Premium Times.\nMr Dega, a retired police officer, was killed in Jos, the Plateau State capital.\nAlthough the full details of the killing were not available at the time of this report, Mr Dega was confirmed dead by the Chief Press Secretary to the Governor, Terver Akase.\nBefore his retirement from the police, Mr Dega had served as commissioner of police in Borno and Edo states.\nMr Gulak, a member of the ruling All Progressives Congress (APC), was shot dead on Saturday night by some gunmen in Owerri, Imo State."
  },
  {
    "headline": "Closed banks’ assets realisation: NDIC seeks FCT ministry’s support",
    "summarized_story": "The Nigeria Deposit Insurance Corporation (NDIC) has solicited the support of the Ministry of the Federal Capital Territory (FCT) in the realisation of landed properties of banks in-liquidation within the FCT to enable it pay depositors of affected closed banks.\nThe Chairman of the NDIC Board of Directors, Mrs Ronke Sokefun said this during a courtesy visit by the Corporation’s Board and Management to the Honourable Minister of the FCT, Mal.\nSpeaking further, NDIC’s Managing Director/CEO, Mr. Bello Hassan elaborated on the roles and relationship between the NDIC and the Asset Management Corporation of Nigeria (AMCON) in the management of banks assets.\nHe however said the Ministry was amenable to assisting the Corporation in resolving issues around its properties and those of banks in-liquidation in the FCT within the ambit of the law.\nBello noted the continued long standing and cordial relationship that has been sustained over the years between the Corporation and the Ministry."
  },
  {
    "headline": "Japaul Gold declares loss of N1.18bn in FY’20",
    "summarized_story": "Adebayo ObajemuJapaul Gold & Ventures Plc on Tuesday published its Audited Financial Statement for the year ended 31 December 2020.\nThe Group declared a turnover of N689.643 million, down by 4.94% from N725.472 million reported in 2019.\nJapaul Gold in the 12 months period declared a loss after tax of N1.18 billion as against the N40.917 billion reported in 2019.\nA loss per share of 19 kobo is reported for the period under review against the earnings per share of N6.53 reported in 2019 year end.\nAt the share price of N0.62, the P.E ratio of Japaul Gold stands at -3.29x with earnings yield of -30.44%"
  },
  {
    "headline": "JUST-IN: JAMB Blames UTME/DE Candidates Over Registration Hitches",
    "summarized_story": "The Board stated that candidates were responsible for over 80% of the registration hitches.\nThe registrar of the Board, Prof. Ishaq Oloyede, stated this on Wednesday, during a monitoring exercise for some prospective candidates, who were unable to register for the exam during the registration window, which closed on May 29, 2021.\nADVERTISEMENT“I have been trying to get the profile code but it was not coming, when I finally got it on May 27, 2021, I was told that the e-PIN was not available,” she said.\nFor his part, a would-be UTME candidate, Abraham Williams, said he also tried severally to get the profile code, admitting that he was probably not following the required format.\nThe problems are self-created by the candidates, you are sending messages for a profile code and no credit of N50,” he added."
  },
  {
    "headline": "Senate Gets Executive Bill To Extend Teachers’ Retirement Age By 5 Years",
    "summarized_story": "The Senate on Wednesday received an Executive Bill from President Muhammadu Buhari, seeking to increase the retirement age for teachers in the country from 60 to 65 years.\nPresident Buhari, in a letter addressed to the Senate President, Ahmad Lawan, and read on the floor of the Senate, explained that the piece of legislation would provide for harmonised retirement age for teachers in Nigeria.\nAccording to him, the move to increase the retirement age and service years was pursuant to Section 58(2) of the 1999 Constitution as amended.\nThe letter reads: “Transmission of the Harmonised Retirement Age for Teachers in Nigeria Bill 2021 to the National Assembly for consideration“Pursuant to Section 58 subsection 2 of the 1999 Constitution of the Federal Republic of Nigeria (as amended), I forward herewith the harmonised retirement age for teachers in Nigeria Bill, 2021 for consideration by the Senate.\n“The harmonised retirement age for teachers in Nigeria bill 2021 seeks to increase the retirement age for teachers from 60 to 65 years, and also increase the possible years of service from 35 to 40 years."
  },
  {
    "headline": "APC Lauds Mustapha Habib’s Appointment As New NEMA DG",
    "summarized_story": "The All Progressives Congress (APC) has expressed excitement over the appointment of Ahmed Mustapha Habib as the new Director-General of the National Emergency Management Agency (NEMA).\nLEADERSHIP reports that the appointment was announced on Monday by the presidential spokesman, Garba Shehu, on behalf of President Muhammadu Buhari.\n“I write to convey the felicitation of the National Chairman Caretaker/Extraordinary Convention Planning Committee (CECPC), H.E (Hon) Mai Mala Buni and the entire membership of the party on your appointment as the Director-General of NEMA.\n“This particular appointment is a demonstration of reward for party loyalty and recognition of selfless service to the country, attributes which clearly describe your persona.\nThe Kaugama, Jigawa state-born Habib was born in 1970 and studied at Federal Government College, Kaduna and Focus Tutorial College, Lagos."
  },
  {
    "headline": "UPDATED: Senate Passes Bill To Stop Discrimination Against HND Holders",
    "summarized_story": "The Senate has passed a Bill that prohibits employers in the country from discriminating between first degree and Higher National Diploma (HND) holders.\nThe passage of the Bill followed the consideration and adoption of a report by the Joint Committee on Establishment and Public Service Matters; and Tertiary Institutions and TETFUND.\nThe Senate President, Ahmad Lawan, in his remarks after the Bill was passed, emphasised that the passage of the bill would serve as motivation for polytechnic graduates.\nHe, therefore, called on the public and private sectors to ensure the implementation of the law’s provisions as soon as it is signed into law by President Muhammadu Buhari.\nADVERTISEMENT“[And] I pray that the Federal Government and all those government agencies and the private sector would start to implement this by the time the President assents to this bill.”"
  },
  {
    "headline": "Discussing Personal Life, Motivation, And Goals With Famous Instagram Sensation, Natalie Monroe",
    "summarized_story": "In her journey as a leading Instagram star, Natalie Monroe has experienced obstacles and challenges that have taught her many important lessons.\nIn your Professional life:It is not easy to crush it in your professional life, whether you’re a public figure, celebrity, entrepreneur or in employment.\n“A positive mindset will crumble any walls of odds stacked against you.” True to this, Natalie Monroe mentions that your attitude towards anything you face in life determines how well you handle it.\nIt is also important to “remember to diversify your skills.”In your Personal life:In personal life, Natalie says, “you should find something that helps you start your morning on a high.\nADVERTISEMENTIn a perfect world, everyone lives their dream life, and Natalie Monroe says that it’s not impossible."
  },
  {
    "headline": "Fire Service gets 20 ambulances, seven firefighting trucks",
    "summarized_story": "By Ukpono UkpongIn a bid to ensure rapid response to distressed calls, the Minister of Interior, Rauf Aregbesola, has commissioned 20 new Basic Life Support ambulance buses and seven state-of-the-art firefighting trucks for use by the Federal Fire Service (FFS).\n“In March, I approved the training of 21 fire-fighting officers in the University of Civil Defence and Emergency Studies, Minsk, Belarus, among other agreements with the country.\nThese officers will be the master trainers that will be training other officers locally on modern firefighting, disaster and emergency management.\n“The arrival of these new ambulance buses and trucks and their deployment to the various Zonal and state Commands would surely enhance service delivery of the Federal Fire Service during emergencies.\nSpeaking further, he also congratulated the gallant officers pulling out of the Service upon attaining the statutory age of service."
  },
  {
    "headline": "NESG, UN, Finance Ministry hold Private sector exploratory dialogue on Nigeria’s food systems",
    "summarized_story": "The Nigerian Economic Summit Group (NESG), in collaboration with the Ministry of Budget and National Planning, United Nations Nigeria and the Alliance for a Green Revolution in Africa (AGRA), held a Private sector Exploratory dialogue on Nigeria’s Food Systems on Tuesday, the 25th of May, 2021.\nShe stated that at the 26th Nigerian Economic Summit (NES#26), stakeholders acknowledged the absence of a warehouse security system, contributing largely to food insecurity issues affecting Nigeria.\nHe said partnership by all stakeholders would help to sustain and improve the agricultural sector and help the country become more successful.\nShe stated that the dialogue was an important step in improving Nigeria’s food systems through the provision of pragmatic solutions and that a framework will be created that will fit into the larger UN resolutions, which will help in achieving the objective of shaping an improved food system.\n“The best way to deal with food insecurity, malnutrition and hunger is collective and concerted collaboration and effort between government, private sector, civil society organisations and all stakeholders”, She concluded."
  },
  {
    "headline": "Importers association tasks members on Nigeria’s economic development",
    "summarized_story": "By Ukpono UkpongThe National President, Importers Association of Nigeria (IMAN), Hon.\nKingsley Chikezie, has called on members to consolidate on their position as agents of economic development of the country.\nHe noted that the Motto of the association “National Growth Through Commerce, should be seen by members as a call to national duty.\nThe national president then urged “IMAN members to make integrity their watch word”, saying a Board of Trustees (BOT), member of the association,HRM Obong Patrick Udoh, “is a shinning example” in this regard.\nTherefore, he stated that Importers Association of Nigeria, IMAN is working conjunction with “both local and international stakeholders” with a view to achieving the mandate of the taskforce."
  },
  {
    "headline": "Matawalle to police: Shoot on sight at bandits —",
    "summarized_story": "The governor of Zamfara, Bello Matawalle, has directed the state’s police and other security services to carry out President Muhammadu Buhari’s directive to shoot anyone in possession of illicit weapons on sight.\nMatawalle claimed only law enforcement personnel should be armed in a series of tweets on Wednesday.\n“The Zamfara State Police and other government security agencies are to effectively implement the Presidential order to shoot on sight at bandits, persons or group of people seen with Ak-47 or any weapons,” the governor said.\n“Only those approved by law or the security agencies are to carry guns and other sophisticated weapons, anyone found in unlawful possession of guns should be shot on the spot.\n“Our administration will always support the police and other security agencies with all the necessary logistics so as to discharge their duties effectively.”"
  },
  {
    "headline": "Benue killings: Stop blaming Buhari, Umahi warns Ortom",
    "summarized_story": "Ebonyi State Governor, David Umahi, on Tuesday asked the Benue State Government to establish its own security outfit, considering the spates of killings in that state.\nAccording to Umahi, Benue government exhibited the height of irresponsibility when it went on air on Tuesday and announced it didn’t know whether victims of the attacks were from Ebonyi or Benue states.\nI do not know for any reason why people should be raping two-year-old children, inflicting machete cuts on one-year-old little children, killing their mothers, killing their fathers.\n“It is important that the people of Benue State form their own Ebube Agu to protect their own people instead of blaming Mr. President.\nMr. President cannot be everywhere.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Benue killings: Stop blaming Buhari, Umahi warns Ortom",
    "summarized_story": "Ebonyi State Governor, David Umahi, on Tuesday asked the Benue State Government to establish its own security outfit, considering the spates of killings in that state.\nAccording to Umahi, Benue government exhibited the height of irresponsibility when it went on air on Tuesday and announced it didn’t know whether victims of the attacks were from Ebonyi or Benue states.\nI do not know for any reason why people should be raping two-year-old children, inflicting machete cuts on one-year-old little children, killing their mothers, killing their fathers.\n“It is important that the people of Benue State form their own Ebube Agu to protect their own people instead of blaming Mr. President.\nMr. President cannot be everywhere.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "WHO: Nigeria’s COVID-19 vaccine rollout in Africa best so far",
    "summarized_story": "The World Health Organisation (WHO) on Tuesday ranked Nigeria’s COVID-19 vaccine rollout as the best in Africa in terms of storage and utilisation of the covid-19 vaccines for its population.\nIt noted that although Africa has not received its fair share of vaccines owing to global vaccine shortages, many African countries cannot still utilise their vaccines before they expire.\nWHO Country Representative Dr. Kazadi Mulombo spoke during a joint news briefing on COVID-19 vaccination update of the National Primary Health Care Development Agency (NPHCDA), WHO and the United Nations Children’s Emergency Fund (UNICEF) in Abuja.\nAfrica is lagging behind, but even though Africa is lagging behind, Nigeria is among the countries that are distributing the most covid-19 vaccine as we speak.\nAt the same time, we have a number of African countries that are losing the vaccines because they expired before they could be used."
  },
  {
    "headline": "WHO: Nigeria’s COVID-19 vaccine rollout in Africa best so far",
    "summarized_story": "The World Health Organisation (WHO) on Tuesday ranked Nigeria’s COVID-19 vaccine rollout as the best in Africa in terms of storage and utilisation of the covid-19 vaccines for its population.\nIt noted that although Africa has not received its fair share of vaccines owing to global vaccine shortages, many African countries cannot still utilise their vaccines before they expire.\nWHO Country Representative Dr. Kazadi Mulombo spoke during a joint news briefing on COVID-19 vaccination update of the National Primary Health Care Development Agency (NPHCDA), WHO and the United Nations Children’s Emergency Fund (UNICEF) in Abuja.\nAfrica is lagging behind, but even though Africa is lagging behind, Nigeria is among the countries that are distributing the most covid-19 vaccine as we speak.\nAt the same time, we have a number of African countries that are losing the vaccines because they expired before they could be used."
  },
  {
    "headline": "Plateau Police arrest suspects in AIG Dega’s murder",
    "summarized_story": "By Muhaimin OlowoporokuThe Plateau State Police Command said it has arrested some suspects in connection with the murder of AIG Christopher Dega (Rtd).\nHowever, those arrested by the Plateau Police Command were not the “unidentified gunmen” who pulled the trigger.\nDega reportedly was shot dead on Monday night in Jos, Plateau State capital.\nIt reads: “The Plateau State Police Command on a sad note received an ugly report of the death of AIG Christopher Dega (Rtd).\n“On 31/05/2021 at about 2030hrs, AIG Christopher Dega (Rtd) was shot dead by three yet to be identified gunmen in an isolated restaurant at Bukuru, Jos."
  },
  {
    "headline": "Tayo Amusan completes Shoprite takeover",
    "summarized_story": "By Taiwo OkanlawonBusiness mogul Tayo Amusan, using Ketron Investment Limited, as vehicle has completed the acquisition of Shoprite operations in Nigeria.\nKetron is a subsidiary of Persianas Investment Limited, a property firm and developer of the popular The Palms, owned by the businessman.\nIn a statement issued on Tuesday, Amusan, chairman, Ketron Investment Limited, said that the Federal Competition and Consumer Protection Commission had approved the change of ownership.\nShoprite has more than 25 retail stores across Nigeria, including some of the largest in West Africa.\nPersianas, which is chaired by Amusan, with his wife, Ayo as CEO, came into being in 1990, according to information on its website."
  },
  {
    "headline": "Anyone with AK 47, bandits to be shot on sight",
    "summarized_story": "Governor Bello Matawalle of Zamfara has ordered security agents to carry out a presidential order, by shooting bandits and AK-47 toting persons on sight.\nBandits or persons or group of people seen with Ak-47 or any weapons must now be shot on sight.\n“Only those approved by law or the security agencies are to carry guns and other sophisticated weapons, anyone found in unlawful possession of guns should be shot on the spot.\n“Our administration will always support the police and other security agencies with all the necessary logistics so as to discharge their duties effectively”, he said.\nOutside of Borno state, Zamfara has been the most roiled state by banditry and terrorism."
  },
  {
    "headline": "Biafra: Nnamdi Kanu Is Hell-bent On Burning Down Southeast — Adamu Garba",
    "summarized_story": "Nnamdi Kanu, the leader of the Indigenous People of Biafra (IPOB), has been charged by Adamu Garba, a former presidential aspirant of the All Progressives Congress (APC), of attempting to burn down the Southeast.\nWhile comparing the maps of Biafra and Borno State, Adamu made the comment.\nIn a tweet, the former presidential candidate claimed that the so-called Biafra map only covers half of Borno State.\nExamine the so-called Biafra map within Borno State.\n“Terrorist Nnamdi Kanu and his henchmen are hell-bent on destroying that small territory in order to get control of it, for the sake of hating the North."
  },
  {
    "headline": "BREAKING: Police Arrest Suspected Killers Of Gov. Ortom’s Aide",
    "summarized_story": "AIG Christopher Dega (retd.\n), a Senior Special Assistant to Benue State Governor Samuel Ortom on Security, was killed, according to the Plateau State Police Command.\nThe governor’s aide was reportedly slain in Jos, the Plateau State capital.\nThe statement read, “The Plateau State Police Command on a sad note received an ugly report of the death of AIG Christopher Dega (Rtd).\n“On 31/05/2021 at about 2030hrs, AIG Christopher Dega (Rtd) was shot dead by three yet to be identified gunmen in an isolated restaurant at Bukuru, Jos."
  },
  {
    "headline": "Twitter Finally Speaks On President Buhari’s Recent Tweets",
    "summarized_story": "Despite Nigerians’ demand for his account to be suspended on Tuesday, Twitter maintains President Muhammadu Buhari‘s “genocidal” message did not breach its rules.\nMr Buhari’s post reacting to the demolition of 42 Independent National Electoral Commission (INEC) facilities across Nigeria, mainly in the South-East, sparked uproar on the microblogging platform.\nDespite considerable criticism that followed the tweet, accusing the president of declaring a genocidal war on the Igbos, Twitter confirmed in a statement that Mr Buhari did not break its guidelines.\nIt blocked the account of China’s US embassy in January this year because of a post it deemed “dehumanizing.”On January 7, a social media post supported China’s policy toward Muslim Uighurs in Xinjiang.\nAccording to the account, Uighur women are no longer “baby creating robots,” citing a China Daily survey."
  },
  {
    "headline": "Nigerians React As Buhari Threatens To Kill Igbo Youths",
    "summarized_story": "Nigerians have taken to social media to express their anger over President Buhari’s threat to clamp down those terrorizing Nigeria most especially South-East.\nNEWS DIRECT earlier reported that Buhari on Tuesday, stated that he will deal with youths who want to destroy his government in a language they will understand.\nBelow are some reactions on Twitter gathered by NEWS DIRECT reporter.\nHave you treated Boko Haram with the “language they understand”?\nThis President threatened a Genocide against over 30 million IGBOs living in Nigeria."
  },
  {
    "headline": "Breaking: Buhari sends Teachers’ retirement age extension Bill to Senate",
    "summarized_story": "President Muhammadu Buhari’s executive Bill which seeks to increase the retirement age for teachers in the country from 60 to 65 years has been handed over to the Senate.\nBuhari, in a letter read on the floor by Senate President, Ahmad Lawan, Wednesday, noted that the Bill provides for harmonised retirement age for teachers in the country.\nAccording to him, the move to increase the retirement age and service years of teachers was pursuant to Section 58(2) of the 1999 Constitution (as amended).\nThe Bill also proposes increase in the years of service for teachers from 35 to 40 years.\nDetails coming…Share this:TweetPrintTelegramWhatsApp"
  },
  {
    "headline": "Pictures: President Muhammadu Buhari presides over FEC meeting",
    "summarized_story": ""
  },
  {
    "headline": "Pictures: Road blocked, commuters stranded as fire razes commercial bus in Abuja suburb, Nyanya",
    "summarized_story": ""
  },
  {
    "headline": "Constitution review: Senate begins national public hearing Thursday -NigPilot",
    "summarized_story": "Senate President, Dr. Ahmad Lawan, yesterday announced that a national public hearing to alter the provisions of the 1999 constitution would hold on Thursday through Friday this week.\nHe described the zonal public hearings held last week in the six geo-political zones of the country as “quite successful”.\nHe said: “Let me also congratulate the members of the Constitution Review Committee of the Senate, who had conducted the public hearings across the countries.\n“(And) in fact, the report we received has shown that in all the centres, the public hearings were quite successful.\n“I want to also appeal to Nigerians to take the opportunity of the national public hearing that will take place from Thursday."
  },
  {
    "headline": "Buhari seeks Senate’s confirmation of Yahaya as COAS -NigPilot",
    "summarized_story": "President Muhammadu Buhari has formally requested the Senate to confirm the appointment of Major General Farouk Yahaya as the new Chief of Army Staff, COAS.\nThe request was contained in a letter addressed to the Senate President, Dr. Ahmad Lawan, and read yesterday during the resumption of plenary.\nBuhari in the letter said Yahaya’s appointment was in compliance with the provisions of Section 18 subsection 1 of the Armed Forces Act 2004.\nThis disclosure is contained in a statement issued and signed by the military spokesperson, Brigadier-General Onyema Nwachukwu.\nUntil his new appointment, General Yahaya was the General Officer Commanding 1 Division of the Nigerian Army and the incumbent Theatre Commander of the Counter-terrorism Counter Insurgency military outfit in the North East code-named Operation HADIN KAI."
  },
  {
    "headline": "Ebonyi massacre: Indigenes blame Umahi, call for change in security tactics -NigPilot",
    "summarized_story": "Following the report of recent attacks by suspected Fulani herdsmen on Odoke, Ndiobasi, and Obakotara communities in Izhi, Ebonyi Local Government Area, an Association of Ebonyi State Indigenes in Diaspora (AESID) has blamed governor Dave Umahi, for the continued killings in the state.\n“As we speak, medical and health-care workers in various parts of the State are offering treatments to scores of victims who sustained varying degrees of injuries during the attack.\n“Our anxiety over this sadly depressing attacks is made worse by the fact that the State’s Chief Security Officer, Engr.\nDavid Umahi on whose shoulders hugely lie the constitutional burden of protection of lives and properties of our beloved citizens has largely down-played all sensible and reasonable warnings about the activities of killer herdsmen.\n“This group consequently condemn the claim that the attack took place in Benue State and the attempt by the State government to further downplay or trivialize not only the latest attack on Izhi communities but the entire security affairs in our dear State."
  },
  {
    "headline": "Gulak: Senate President cautions against revenge -NigPilot",
    "summarized_story": "Following the gruesome murder of a former Speaker of the Adamawa State House of Assembly and chieftain of the All Progressives Congress, APC, Hon.\nAhmed Gulak by unknown gunmen on Sunday in Oweri, Imo State, the Senate President, Dr. Ahmad Lawan has appealed for restraint on the part of those calling for revenge.\nThe Senate President, while condemning the killing, maintained that there can be no justification for the brutal murder of a human being and fellow citizen.\nThe Imo State Police Command, however, announced on Sunday night that the it has neutralised the killers of the foremost politician and lawyer as well as recovered ammunition and vehicles from them.\nThe group, however, withdrew the threat yesterday following the elimination of the suspected killers of the late politician by the state Police Command."
  },
  {
    "headline": "Police Parade 81 Suspected Bandits, Kidnappers Others",
    "summarized_story": "The Nigeria Police Force on Wednesday paraded 81 suspects arrested between April and May 2021.\nA statement by the Police Public Relations Officer, Frank Mba, noted that the suspects were arrested for various crimes including kidnapping, banditry, armed robbery, illicit possession of firearms, illegal manufacturing and distribution of number plates.\nAccording to the force spokesman, some of the items recovered from the suspects include 45 assorted riffles, including 17 AK-47, 20 locally made AK-47, and one GPLG.\nMr. Mba assured that the country security challenges facing the country will bring out the force.\nMore to follow…"
  },
  {
    "headline": "Gunmen Kill Gov Ortom’s Aide On Special Security, Ex-AIG Christopher Dega",
    "summarized_story": "A Retired Assistant Inspector General of Police and the Principal Senior Special Assistant on Special Security to Governor Samuel Ortom of Benue State has been killed by gunmen in Jos.\nAccording to reports ex-AIG, Dega Chris was shot in the chest several times until he bled to death.\nThe Commissioner of Police in the state, Edward Egbuka told Channels Television that preliminary investigation revealed that the Retired Assistant Commissioner who left Makurdi was trailed to Jos where he was shot.\nDega before his retirement from the police served as Commissioner of police in Borno and Edo states.\nHis killing occurred few days after the murder of a former political adviser to President Goodluck Jonathan, Ahmed Gulak."
  },
  {
    "headline": "Those Plotting Nigeria’s Destruction Will Have Shock Of Their Lives – Buhari",
    "summarized_story": "﻿President Muhammadu Buhari on Tuesday issued a stern warning to those plotting to destroy Nigeria, saying they will soon receive the shock of their lives.\nSpeaking after he received a briefing from Chairman of Independent National Electoral Commission (INEC), Prof Mahmood Yakubu, on series of attacks on facilities of the electoral body around the country, President Buhari said the Federal Government has given the perpetrators enough time.\nWhoever wants the destruction of the system will soon have the shock of their lives.\n“From the pattern and frequency of the most recent attacks, they appear to be targeted at future elections.\nThe intention is to incapacitate the Commission, undermine the nation’s democracy and precipitate a national crisis.”"
  },
  {
    "headline": "Abductors Of Niger Islamic Students Demand ₦110m Ransom, Threaten To Kill Victims",
    "summarized_story": "Abductors of the over 136 students and staff of Salihu Tanko Islamiyya School, Tegina, in the Rafi local government area of Niger State are demanding the sum of ₦110 million as a ransom for the safe release of the victims.\nThey threatened to kill the victims should the school or their parents fail to meet their demands by midnight of Tuesday this week.\nAlhassan said contrary to their expectation, the bandits claimed they have a total of 156 people with them made up of pupils and staff.\nREAD ALSO: At Least 200 Islamiyya Students Kidnapped In NigerThis comes two days after bandits invaded Salihu Tanko Islamiyya school, a conventional Islamic school, and abducted many students including staff, killing one person and injuring one other person.\nAccording to reports, parents and relations of the abductees have begun to raise money to take to the bandits."
  },
  {
    "headline": "Southgate Eyes Euro 2020 Semis As Barometer For Success",
    "summarized_story": "Having reached two semi-finals during his tenure England manager Gareth Southgate says he and the team will have failed if they miss out on the last four of Euro 2020.\nSouthgate’s side defied expectations to reach the 2018 World Cup semi-finals.\nThey have been drawn with Croatia, who beat them in the semi-finals of the World Cup, the Czech Republic, and old rivals Scotland.\n“Yeah, it probably will,” said Southgate when asked whether falling short of the last four would be a failure.\n“We know the excitement around the team and it’s great, we’re now relevant,” said Southgate."
  },
  {
    "headline": "Pulling Down Democratic Structures In Nigeria: Who Stands To Gain? *By Paul Ejime -",
    "summarized_story": "Where and when the security architectures are vulnerable to arson and incessant attacks, national electoral commissions, such as INEC, are in jeopardy without adequate protection.\nThe INEC facilities being destroyed cost money and are repositories of sensitive national records.\nThey serve the local communities for the most fundamental aspect of democratic governance – election.\nExperience has shown that electoral umpires in Africa only receive major attention from the government mainly on the eve or during national elections.\n*Paul Ejime, an Author and former Diplomatic/War Correspondent, is a Consultant on Communications, Media, Elections and International Affairs."
  },
  {
    "headline": "Photos: President Buhari presides over weekly FEC meeting",
    "summarized_story": "President Muhammadu Buhari is presiding over the weekly Federal Executive Council meeting at the State House, AbujaWhile some of the cabinet members are physically present at the council chamber, others joined virtually from their various offices."
  },
  {
    "headline": "Governor Matawalle directs Security agencies to implement Presidential Directive on persons bearing illegal arms",
    "summarized_story": "Governor Bello Matawalle of Zamfara state has approved an immediate declaration of proclamation on the entire state.\nThis according to a press release from the Government House emanates from the Presidential order of ‘shoot on sight” by President Muhammadu Buhari on any person bearing firearms unlawfully.\nThe governor also issued a seven days ultimatum to anyone in possession of illegal firearms to hand over to the nearest Police stationHe reaffirmed his total commitment to bringing sanity and prevent the escalation of lawlessness and any act of crime in the state“In exercise of the powers confered on me on that behalf, I Dr Bello Matawallen make the following proclamationAdvertisement“The whole area of Zamfara State is declared to be a proclaimed district”“All firearms in illegal possession of all persons in Zamfara State are to be handed over to the nearest Police station within seven days of this proclamation”“All Officers and Soldiers of the Armed Forces, Department of State Security Service, Nigerian Security and Civil Defense Corps are hereby conferred with powers of arrest of Police Officers” the Governor directed.\nGovernor Bello Matawalle further called on residents to abide by the law and make Zamfara a more peaceful state that anyone can go about his activities without fear of the unknown."
  },
  {
    "headline": "No National Team Player Survives on Bonuses: Nigeria Football Chief Pinnick",
    "summarized_story": "President of the Nigeria Football Federation (NFF) Amaju Pinnick says the federation is not proud of owing the country’s football senior players bonuses for national games played.\nWhile Nigeria’s Super Eagles prepare to play Cameroon in a friendly encounter in Austria, as many as six senior team players have excused themselves from the squad due to injuries, putting Friday’s game at risk.\nVictor Osimhen, Simy Nwankwo, Frank Onyeka, Ola Aina, Samson Tijani and Tyronne Ebuehi are the six players that have pulled out citing injury concerns.\nThere’s however a feeling of resentment in the squad over unpaid salaries.\nReports suggest that Coach Rohr has not been paid for six months, while Alloy Agu is owed 22 months of allowances."
  },
  {
    "headline": "Nigeria: Benue Governor Ortom’s Security Adviser Killed",
    "summarized_story": "Unknown gunmen have shot and killed Christopher Dega, a senior special assistant to the Governor of Benue State, Samuel Ortom on Security matters.\nMr Dega, a retired assistant inspector-general of police, was killed on Tuesday in Jos, the Plateau state capital.\nDetails of the incident are still sketchy but Terver Akase, a spokesperson to the governor, confirmed the incident.\nBenue state has in recent months witnessed various clashes between farmers and herders leading to the deaths of several citizens.\nGovernor Ortom had in March accused herdsmen of attempting to kill him following an attack on his convoy at Tyo Mu along Makurdi-Gboko road."
  },
  {
    "headline": "African Union Follows ECOWAS’ Lead, Suspends Mali Over Goita-led Military Coup",
    "summarized_story": "The African Union (AU), an organisation consisting of 55 member states located on the continent of Africa has suspended Mali following last week’s military coup – for the second time in nine months.\nThe first was last August following a military coup – but the country was reinstated after the heads of a civilian-led transitional government were announced.\nNow that administration has been overthrown, and so once again, Mali finds itself excluded.\nThe AU in a statement called for a return to civilian government, saying it would not hesitate to impose sanctions and other punitive measures unless troops were urgently ordered to return to barracks.\nColonel Assimi Goïta, who led the coup, was appointed transitional president by the country’s constitutional court four days ago."
  },
  {
    "headline": "Buhari on Insecurity: There Is Intent To Make Sure This Administration Fails",
    "summarized_story": "Nigeria’s President Muhammadu Buhari says it is clear that some elements want his government to fail.\nThis is responsible for the spate of insecurity across different parts of the country, he believes.\nBuhari wondered why, because in his estimation, he has always followed the letter of the constitution in governing Africa’s most populous country and largest economy.\nWatch the video for more…"
  },
  {
    "headline": "Buhari: Those Misbehaving in Southeast Too Young to Understand Civil War",
    "summarized_story": "Nigeria’s President Muhammadu Buhari has issued a stern warning to arsonists destroying government facilities, including police stations and electoral offices, especially in the southeast region of the country.\nThe Nigerian leader warned that will soon have the shock of their lives.\nBuhari stated this on Tuesday shortly after he received a briefing from the chairman of the Independent National Electoral Commission (INEC), Mahmood Yakubu.\nWatch the video for more…"
  }
]