[
  {
    "headline": "Biden, Harris, Bush, others attend 9/11 memorial",
    "summarized_story": "The annual reading of names was concluded and President Biden laid a wreath at the Flight 93 National Memorial and silently reflected in front of the wall where the names of some 40 victims were posted, ABC News reported.\nAfter the memorial walk to greet the family members of the victims who were in attendance, Harris spoke at the memorial service, reflecting on the heroism of the passengers who fought the hijackers.\nThat time reminded us the significance and the strength of our unity as Americans, and that it is possible in America,” she said.\nA former president, George W. Bush, in his part, warns Americans against domestic terrorism.\nTo you and the honored dead, our country is forever grateful,” Bush said."
  },
  {
    "headline": "Contempt: Expand prison to contain us, resident doctors dare FG",
    "summarized_story": "Striking doctors under the aegis of the Nigerian Association of Resident Doctors have dared the Federal Government to go ahead and arrest them all.\n“As for the court notice, no one really cares.\nThis (court notice) won’t make us change our mind.”Members of NARD had commenced nationwide industrial action on August 2.\nBut the resident doctors vowed to continue the strike until their demands are met, notwithstanding the court ruling.\nYou will be guilty of contempt of court and will be liable to be committed to prison,” the court read in part."
  },
  {
    "headline": "One shot dead at Isoko, Delta, by-election",
    "summarized_story": "Gunmen allegedly shot a local vigilante dead at Saturday’s Isoko South Local Government Area Constituency I bye-election for the Delta House of Assembly.\nElectors who included youths and elders flooded their respective polling units to exercise their franchise.\nThere were few vehicles particularly those on essential duties on the roads while security personnel manned strategic locations, polling units and hot spots.\nMr Monday Efe, an elector at Oleh, headquarters of Isoko South said INEC began the movement of materials at about 3p.m.\nMr Constantine Ikpokpo, a former Chairman of Isoko South Local Government Council and Director-General, PDP Campaign Organisation in Isoko South Constituency One, described the performance of INEC as “impressive and exceptional’’."
  },
  {
    "headline": "Buhari meets with NMA members",
    "summarized_story": "Appeals to striking doctors to call off strikeBy Chioma ObinnaPresident Muhammadu Buhari on Friday met with the members of the Nigerian Medical Association, NMA, led by its President, Prof Innocent Ujah at the State House, Abuja even as he appealed to striking resident doctors to call off the strike.\nThe President who said he was delighted to host the NMA President and members of his delegation, assured the NMA delegation of his administration’s commitment towards ensuring all the terms of the agreement entered into between his government and the various affiliates of the association.\nBuhari further highlighted the achievements recorded by his administration in the health sector, including approvals for payment of Basic Health Care Provision Fund, increased budgetary allocation for health, the establishment of molecular laboratories, Isolation Centres, and oxygen plants in various states across the country among others.\nContinuing, he congratulated the Prof Ujah and his team on their election and the leadership role the association is providing in the health sector.\nEarlier, the NMA President, in his opening remarks thanked the President for granting them audience and apologised for the inability of the association to honour the earlier scheduled meeting."
  },
  {
    "headline": "NIPOST, Akokwa community turn 60-yr-old post office into multi-storey business complex",
    "summarized_story": "The ancient post officeNIPOST General Manager, Property and Workshop, Mr. M.B.\nSuleiman(front row, 3rd right,) with other staff of NIPOST; Chief Paul Ngoka, President General AUPPA(back row, 4th right), and traditional rulers of Akokwa community, in front of old Akokwa Post Office.\nHe spoke through the NIPOST General Manager, Property and Workshop, Mr. M. B. Suleiman, an engineer, during the symbolic hand over of Akokwa Post Office bungalow building to the project contractor for reconstruction and upgrading.\nThe Akokwa community in conjunction with NIPOST, and the Project contractor, Total Construction Company Limited, is embarking on reconstruction and upgrading of Akokwa Post Office to a multi-storey building that will accommodate many offices and establishments.\nChief Ngoka disclosed that the post office was opened in 1960 and since then had not been refurbished."
  },
  {
    "headline": "Auchi Poly freshman commits suicide",
    "summarized_story": "By Ozioruva Aliu, BENIN CITYA 23 years old student of Federal Polytechnic, Auchi, (Auchi Poly), Auchi, Etsako West Local Government Area of Edo State, identified as Solomon Oboh, has committed suicide shortly after classes on Friday.\nThe spokesperson of the school, Mustapha Oshiobugie, who confirmed the incident, said he is yet to get the details.\nOboh, who was a National Diploma, ND, I student of Public Administration, was reportedly found dangling in his room on Friday night.\nREAD ALSO: Auchi poly Dean of students found dead in officeA source, who pleaded anonymity, said the late Oboh, in his suicide note, instructed that his mobile phone be given to one Sandra, his girlfriend, whom he begged for forgiveness in the suicide note.\n“We only came home later in the evening to find his body dangling from the ceiling of his room at Bawack area of South Ibie."
  },
  {
    "headline": "Aubameyang strike ends Arsenal drought in 1-0 win over Norwich",
    "summarized_story": "Pierre-Emerick Aubameyang ended Arsenal’s long wait for a goal as the Gunners collected their first Premier League points of the season with a 1-0 win over Norwich City on Saturday.\nNicolas Pepe and debutant Takehiro Tomiyasu had both threatened but the Gabon forward managed to poke home to secure the hosts’ first win at the fourth time of asking.\nKenny McLean then flicked wide from Max Aarons’ delivery before Krul rushed out to deny Aubameyang, who had latched onto Martin Odegaard’s long ball.\nTierney injected energy into a slow-pace first half, driving down the left before standing up a cross to the back post where Tomiyasu smashed acrobatically over.\nHowever, Aubameyang finally ended Arsenal’s long wait for a top-flight goal, tapping in from point-blank range after seeing Pepe strike both posts after an initial save from Krul."
  },
  {
    "headline": "‘National Assembly spends just 2 per cent of annual budget’ – Gbajabiamila",
    "summarized_story": "Speaker of the House of Representatives, Femi Gbajabiamila, on Saturday, said the National Assembly spends less than two per cent of the national budget, wondering why no one is asking questions about the remaining 98 per cent.\nThe National Assembly should have less than 100 members, including Abuja,” the varsity don’t said in his lecture.\nIbrahim Isiaka of Ifo/Ewekoro constituency, mentioned that the money budgeted for the National Assembly was two per cent of the total budget.\nYou are also talking about the National Assembly Commission, you are talking about everything, all encompassing,” he said.\nHe charged Nigerians to change the perception that Nigeria runs the most expensive National Assembly in the world."
  },
  {
    "headline": "Plateau: Army inaugurates 36-man peace committee",
    "summarized_story": "The Commander Operation SAFE HAVEN (OPSH), Maj Gen Ibrahim Ali, inaugurated a 36-member Joint Peace Committee on Saturday, September 11 202, at the Operations Headquarters in Jos, Plateau State.\nHe said, Maj Gen Ali urged members of the committee to demonstrate impartiality, neutrality, honesty, uprightness and avoid sentiment and compromise.\nHe hoped their experience in communal conflict resolution would assist in fast-tracking the restoration of peace on the Plateau.\nMaj Gen Ali stressed that sustainable peace can only be achieved through alternative dispute resolution mechanism by all parties to the conflict.\n“It is hoped that, the outcome of this committee will contribute immensely to the peace building efforts in the targeted communities with a view to returning Plateau state to the path of peace and sustainable development."
  },
  {
    "headline": "Flood: 20 allegedly die of cholera, 190 others infected in Bauchi community",
    "summarized_story": "Twenty people have reportedly died of cholera, while 190 others were infected of the disease following the recent flood in Gololo town in Gamawa Local Government Area of Bauchi State.\nThough the Bauchi State Government denied the figure, saying that there was no death recorded in the community, while only five persons were infected of the disease.\nThe chairman of the Gololo Community Service, Honourable Abba Alhaji Gololo, revealed this to journalists, saying that cholera outbreak in the town was as a result of stagnant flood water in different parts of the community.\nAccording to Gololo, who doubles as Sarkin Hausawan Gololo, “Since the faithful day that water flooded his village, cholera outbreak has struck the town.\n“As I am talking to you from the records in our Primary Healthcare Centre (PHC), a total of 190 people were infected with 20 deaths recorded already."
  },
  {
    "headline": "25-year-old Nigerian journalist, Seun Oluwagbemi is dead",
    "summarized_story": "Seun Oluwagbemi, a young Nigerian journalist is dead.\nSeun worked with Arise News as Entertainment, News and Sports Producer.\nThe deceased wrote and edited news, managed social media platforms, hosted radio shows and managed stage performances.\nDuring his participation at the National Youth Service Corps (NYSC) scheme, Seun coordinated activities in the studio and created content for the broadcasting service.\nIn his final year in OAU, Seun won the Best Director Award."
  },
  {
    "headline": "MBBS examination: Ikpeazu commends ABSUTH",
    "summarized_story": "Governor, Okezie Ikpeazu of Abia State, has commended students, management and staff of Abia State University Teaching Hospital (ABSUTH), Aba, for excelling in the just concluded 4th and 5th MBBS examination.\nIkpeazu who gave the commendation in a statement by the state Commissioner for Information, Chief John Okiyi Kalu, who described the performance as ‘amazingHe assured that his administration is encouraged to do much more for the institution going forward.\nOkiyi also stated that the Governor has directed his Chief of Staff, Prof ACB Agbazuere, to urgently intervene in the public power supply challenges faced by the students of ABSUTH with a view to ensuring that they were resolved immediately.\nA detailed report by the Chief Medical Director of ABSUTH, Dr. Offiah Awah, revealed that 80% of final (5th) year MBBS students of the institution passed the examination with 7 distinctions in surgery."
  },
  {
    "headline": "Abducted day-old baby rescued in Kano",
    "summarized_story": "By Fanen Ihyongo, KanoThe Police in Kano State have rescued a day-old baby allegedly abducted by a couple in search of a male child.\nThe baby’s father, Rabi’u Muhammad of Gayawa Quarters in Ungogo local government council of Kano state, reported to the police command that one of his male twin babies was missing.\nHe said his wife delivered the twins on Friday at Mohammad Abdullahi Wase Teaching Hospital, Kano after which where she was admitted.\nHowever, with sustained efforts, coupled with intelligence sharing the baby was recovered outside the hospital premises, police said.\n“But I acted on the request of my husband who has been longing for a male child,” she claimed."
  },
  {
    "headline": "APC kicks as KADSIECOM declares Jema’a LG poll inconclusive",
    "summarized_story": "They gave the commission a 24-hour ultimatum to revert to the announcement of APC candidate, Hon Yahanna Barde as chairman or face resistance from the people.\n“The results of ward election were then conveyed to the Local Government Secretariat that served as Local Government Collation Centre where the Local Government Returning Officer Rev.\nHe said, the Returning Officer after deligently collating the various results consequently declared Comrade Yunana Markus Barde as the winner and returned him as duly elected Chairman last Sunday.\nThere is no dispute as to who the winner of that election is.\n“We hereby reject her desire to unilaterally impose her whims and caprices on the esteemed Local Government electorates who have exercised their democratic franchise.”"
  },
  {
    "headline": "Insecurity: Makinde backs unveiling of NSCDC female squad in Oyo",
    "summarized_story": "From Joseph Inokotong, AbujaOyo State Governor Seyi Makinde in his efforts to rid the state of all forms of criminality has welcomed the decision of the Nigeria Security and Civil Defence Corps (NSCDC) to unveil the female squad in the state.\nHe promised continuous support to the NSCDC in carrying out its security duties and obligations to the citizens of Oyo State and Nigerians in general.\nCG Audi had informed the governor of plans to unveil the female squad in Oyo State to tackle specialised crimes and protect the vulnerable in the state, most especially women and school children, who are mostly soft targets with high ransom values for bandits and kidnappers.\nMakinde maintained that his government would support and motivate the Corps in order to contribute more to the maintenance of peace and order in the state.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Circular on conversion of domiciliary account to naira fake – CBN",
    "summarized_story": "From Uche Usim, AbujaThe Central Bank of Nigeria (CBN) yesterday urged the public to disregard a fake circular trending on the social media that suggests it has ordered domiciliary account holders to convert their foreign currencies to naira.\nSpokesman of CBN, Mr Osita Nwanisobi, in a statement said that the circular in circulation, with a fake CBN logo and curiously dated “13 September 2021”, purportedly issued by its Trade and Exchange Department was nothing but a tissue of lies.\nAccording to him, there was no truth in the fake CBN circular which purportedly directed Deposit Money Banks, International Money Transfer Operators (IMTOs) and members of the public to convert domiciliary account holdings into naira.\nThe speculation is a completely false narrative aimed at triggering panic in the foreign exchange market.\n“The public should note that any circular issued by the Central Bank of Nigeria (CBN) is posted on its website (www.cbn.gov.ng) for the attention of the general public."
  },
  {
    "headline": "Alleged support for bandits: S/West, Middle Belt groups attack Gumi",
    "summarized_story": "By Vincent KaluThe Middle Belt Forum and a group in the South West, South-West Security Stakeholders Group (SSSG) have carpeted Islamic cleric, Sheikh Abubakar Gumi over what they called his sympathy for bandits.\nThe South-West group also warned bandits and other criminal elements to steer clear of the region, or face the wrath of the group.\n“Sheikh Gumi is a Nigerian, he has a right to visit any part of the country,” it noted.\nSo, what the government is doing now is to tell the bandits that they were not stronger in anywhere.\n“The time for that amnesty that Sheikh Gumi was asking for has passed and elapsed."
  },
  {
    "headline": "Yes, sex-for-roles exists in Nollywood –Temidayo Babatunde",
    "summarized_story": "Beautiful actress, Temidayo Babatunde has vowed never in her life to be a second wife.\nThe single mother of one revealed to Saturday Sun that though, she is currently in a relationship, she’s not committed to it.\nBut if he is married and wants me to be his second wife, it is a no, no!\nSpeaking on sexual harassment that seems to have become a norm in the movie industry, the seasoned movie producer asserted that she’s lucky not to have experienced such.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "VAT Collection: Appeal Court bars Rivers, Lagos, stops execution of judgement",
    "summarized_story": "From Godwin Tsa, AbujaThe Abuja division of the Court of Appeal on Friday temporarily suspended the execution of the judgment of the Federal High Court in Port Harcourt stopping the Federal Inland Revenue Services (FIRS) from collecting Value Added Tax (VAT) and Personal Income Tax (PIT) in Rivers State.\nThe court has ordered the appellant to file and exchange their processes in the motion for joinder filed by Lagos state just as the respondents were equally given two days to respond.\nJustice Stephen Pam of the Federal High court, Port Harcourt had in his judgment, held that it is the Rives State Government that should collect VAT and PIT henceforth in the state.\nFHC/PH/CS/149/2020, filed by the Attorney General for Rivers State (plaintiff), against the Federal Inland Revenue Service (first defendant) and the Attorney General of the Federation (second defendant.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Soldiers Neutralise Fleeing Bandits in Niger",
    "summarized_story": "The exact number of bandits killed could not be immediately ascertained but a source at Maganda village in Shiroro Local Government Area where the incident happened told THISDAY that they are many.\nSome of the bandits, who escaped with serious bullets wounds, are still being trailed by the soldiers as the entire forest is being combed in search of the escaped ones, while the villagers have been engaged to assist in evacuating the remains of the neutralised bandits.\nIt was gathered that six sub-machine guns and a number of AK 47 riffles and bags of ammunitions were recovered from the bandits.\nThe District Head was set free by the bandits on Friday evening without payment of any ransom, according to a source close to his palace.\nThe Police Public Relations Officer, Niger State Police Command, DSP Wasiu Abiodun, confirmed the release of the monarch."
  },
  {
    "headline": "British PM, Queen Mark 9/11 20th Anniversary",
    "summarized_story": "Queen Elizabeth II, Prime Minister Boris Johnson and other British leaders have marked the 20th anniversary of the Sept. 11 attacks by praising the international resolve that has grown from the al-Qaeda-led tragedy.\nThe queen remembered her visit to the site of the attack.\n“My visit to the site of the World Trade Centre in 2010 is held fast in my memory.\nThe former head of the British armed forces, Gen. Lord Richards, said the return of the Taliban in Afghanistan raised the prospect of “another 9/11” as ungoverned spaces opened up which the terrorists were able to exploit.\nWe’ve now been pitched back into a dark period which we somehow have to manage,” he told the LBC radio station."
  },
  {
    "headline": "Nigeria Records 3 Deaths, 466 New COVID-19 Cases",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) says three people died as a result of COVID-19 complications, while 466 news cases was recorded on Friday.\nThe News Agency of Nigeria (NAN) reports that the new 466 COVID-19 infections on Friday indicates a decrease from 727 cases reported on Thursday.\nThe Public health agency reports that COVID-19 cases in the country now stands at 198, 239 on Friday.\n“Today’s report includes: two deaths and eight discharged cases for Lagos are for September 9, 2021 cases from Nasarawa and Sokoto States,”it said.\nMeanwhile, The National Primary Health Care Development Agency(NPHCDA), said that Nigeria had fully inoculated 3,901,235 of total eligible persons targeted for COVID-19 vaccination in the country."
  },
  {
    "headline": "National Unity, US’ Greatest Strength, Says Biden on 9/11 20th Anniversary",
    "summarized_story": "President Joe Biden has described national unity as the United States’ greatest strength in a video commemorating the 20th anniversary of the al-Qaeda attacks on Sept. 11 which left nearly 3,000 people dead.\n“In the days that followed Sept. 11, 2001, we saw heroism everywhere, in places expected and unexpected.\n“We also saw something all too rare: a true sense of national unity,” Biden said in a video message posted on Twitter on Friday evening.\n“In the battle for the soul of America, unity is our greatest strength.\nThe al-Qaeda plane hijackings were the single worst attack on U.S soil in the country’s history."
  },
  {
    "headline": "Confusion, as A’Court Tells Rivers State to Suspend VAT Collection",
    "summarized_story": "The Rivers State Government had last month secured a major court victory over the federal government in the collection of VAT in the state, and had gone ahead to enact necessary laws and agencies for the collection of the tax in the state.\nJustice Pam, in the judgment subsequently restrained the Attorney General of the Federation and FIRS (1st and 2nd defendants) from collecting VAT in Rivers and directed the Rivers State Government to take charge of the duty.\nAs a result of the court’s decision in Port Harcourt, the Lagos State Government also commenced move to stop the collection of VAT by the FIRS in the state.\nHe said the state government and the House of Assembly had duly enacted the Rivers State Value Added Tax No.\nSanwo-Olu signs Lagos VAT lawIn a related development, Lagos State Governor Babajide Sanwo-Olu yesterday signed into law the State VAT Bill as passed by the House of Assembly."
  },
  {
    "headline": "EXCLUSIVE: Military Colleagues Raise Ransom Secretly For Nigerian Army Major Abducted By Bandits For 17 Days",
    "summarized_story": "Some friends and colleagues of Major Christopher Datong, who has spent 17 days in the captivity of the bandits who attacked the Nigerian Defence Academy in Kaduna State, are making frantic efforts to rescue him, including raising a ransom, SaharaReporters has gathered.\nA top military source, however, confided in SaharaReporters that a ransom was being prepared among his friends in the Nigerian Army to be paid to the bandits through some religious negotiators.\nSaharaReporters had on August 25 reported that the bandits after abducting Datong got across to the military authorities to demand a ransom of N200million to free him.\nSaharaReporters had also reported that troops of the Nigerian Army and military aircraft searching for Major Datong, were having a tough time.\nIt involves a military officer; it involves a military establishment."
  },
  {
    "headline": "EXCLUSIVE: Military Colleagues Raise Ransom Secretly For Nigerian Army Major Abducted By Bandits For 17 Days",
    "summarized_story": "Some friends and colleagues of Major Christopher Datong, who has spent 17 days in the captivity of the bandits who attacked the Nigerian Defence Academy in Kaduna State, are making frantic efforts to rescue him, including raising a ransom, SaharaReporters has gathered.\nA top military source, however, confided in SaharaReporters that a ransom was being prepared among his friends in the Nigerian Army to be paid to the bandits through some religious negotiators.\nSaharaReporters had on August 25 reported that the bandits after abducting Datong got across to the military authorities to demand a ransom of N200million to free him.\nSaharaReporters had also reported that troops of the Nigerian Army and military aircraft searching for Major Datong, were having a tough time.\nIt involves a military officer; it involves a military establishment."
  },
  {
    "headline": "BREAKING: Lagos Governor, Sanwo-Olu Signs Value Added Tax Bill Into Law, Joins Rivers Governor",
    "summarized_story": "Babajide Sanwo-Olu, Governor of Lagos State, has signed the state Value Added Tax (VAT) Bill into law.\n“Lagos State Governor Babajide Sanwo-Olu has signed into law the State VAT Bill as passed by the House of Assembly.\nThe Lagos State House of Assembly had on Thursday unanimous passed the bill.\nGovernor Nyesom Wike of Rivers State on Thursday signed into law the bill on Value-Added Tax (VAT) collection in the state.\nWike signed the bill which was recently passed by the state House of Assembly at the Government House, Port Harcourt."
  },
  {
    "headline": "BREAKING: Lagos Governor, Sanwo-Olu Signs Value Added Tax Bill Into Law, Joins Rivers Governor",
    "summarized_story": "Babajide Sanwo-Olu, Governor of Lagos State, has signed the state Value Added Tax (VAT) Bill into law.\n“Lagos State Governor Babajide Sanwo-Olu has signed into law the State VAT Bill as passed by the House of Assembly.\nThe Lagos State House of Assembly had on Thursday unanimous passed the bill.\nGovernor Nyesom Wike of Rivers State on Thursday signed into law the bill on Value-Added Tax (VAT) collection in the state.\nWike signed the bill which was recently passed by the state House of Assembly at the Government House, Port Harcourt."
  },
  {
    "headline": "Edo Polytechnic Student Commits Suicide, Wills Mobile Phone To Girlfriend",
    "summarized_story": "A 23-year-old student of Auchi Polytechnic, Edo State, identified only as Solomon, has committed suicide.\nAccording to a source who pleaded anonymity, the victim ordered that his mobile phone be given to one Sandra whom he begged for forgiveness in the suicide note.\nThe source said that the Sandra was his girlfriend and that they were course mates.\nWe only came home later in the evening to find him dangling from the ceiling of his room.\nThe polytechnic spokesman, Mr. Mustapha Oshiobugie, who confirmed the incident, said he was yet to be briefed on the details."
  },
  {
    "headline": "CBN denies planning to convert forex in dom accounts to naira -- second time in two months",
    "summarized_story": "The Central Bank of Nigeria (CBN) says it is not planning to convert foreign exchange (FX) in the domiciliary accounts of customers into naira.\nAdvertisementOsita Nwanisobi, CBN spokesperson, said this in a circular issued on Saturday, said the speculation is false and aimed at triggering panic in the foreign exchange market.\n“We wish to reiterate that the bank has not contemplated, and will never contemplate, any such line of action.\nThe speculation is a completely false narrative aimed at triggering panic in the foreign exchange market,” the circular reads.\nDespite the decision, panic in the foreign exchange market has caused a wide margin between the naira and the dollar on the official and black markets."
  },
  {
    "headline": "CBN denies planning to convert forex in dom accounts to naira -- second time in two months",
    "summarized_story": "The Central Bank of Nigeria (CBN) says it is not planning to convert foreign exchange (FX) in the domiciliary accounts of customers into naira.\nAdvertisementOsita Nwanisobi, CBN spokesperson, said this in a circular issued on Saturday, said the speculation is false and aimed at triggering panic in the foreign exchange market.\n“We wish to reiterate that the bank has not contemplated, and will never contemplate, any such line of action.\nThe speculation is a completely false narrative aimed at triggering panic in the foreign exchange market,” the circular reads.\nDespite the decision, panic in the foreign exchange market has caused a wide margin between the naira and the dollar on the official and black markets."
  },
  {
    "headline": "Air chief: Outcome of military operations against insurgents encouraging",
    "summarized_story": "Oladayo Amao, chief of air staff, says the results of military flight operations against insurgents have been positive.\nThe troops are among personnel of operation Hadin Kai — formerly known as operation Lafiya Dole — the codename for the military operation against Boko Haram.\nDuring his visit, Amao was briefed by Nnamdi Ananaba, the operation’s air component commander, who gave a summary of the major achievements recorded by the air component towards defeating insurgents in Borno state, especially within the last 30 days.\nAdvertisementIn his remarks, the air chief commended the troops for their commitment to the current onslaught against insurgents in the north-east.\n“The outcome of our air operations have been very encouraging and positive, and we must sustain these efforts to remain on course towards meeting our overall end state of ridding the region of these criminals,” he said."
  },
  {
    "headline": "Air chief: Outcome of military operations against insurgents encouraging",
    "summarized_story": "Oladayo Amao, chief of air staff, says the results of military flight operations against insurgents have been positive.\nThe troops are among personnel of operation Hadin Kai — formerly known as operation Lafiya Dole — the codename for the military operation against Boko Haram.\nDuring his visit, Amao was briefed by Nnamdi Ananaba, the operation’s air component commander, who gave a summary of the major achievements recorded by the air component towards defeating insurgents in Borno state, especially within the last 30 days.\nAdvertisementIn his remarks, the air chief commended the troops for their commitment to the current onslaught against insurgents in the north-east.\n“The outcome of our air operations have been very encouraging and positive, and we must sustain these efforts to remain on course towards meeting our overall end state of ridding the region of these criminals,” he said."
  },
  {
    "headline": "'N20k to transport AK-47, N5k for ammunition' -- insider's account on banditry business in Zamfara",
    "summarized_story": "Murtala Rufa’i, a lecturer at the Usmanu Danfodiyo University, Sokoto, says according to a 10-year research he conducted on banditry in Zamfara, people make money from transporting arms.\n“Thus, the wider assumption is that arms supply in Zamfara is majorly from the Nigeria-Niger borders located around Zamfara, Sokoto and Katsina axis,” the report reads.\n“There is also the use of women and children as couriers of arms along the border.\nOver the years, gunmen have attacked communities in Zamfara, despite the state’s decision to grant amnesty to bandits.\nHowever, Bello Matawalle, governor of Zamfara, on Friday, announced that his administration will no longer offer amnesty to bandits since they have “refused to embrace peace”."
  },
  {
    "headline": "Meet the startup transforming informal recycling in Nigeria",
    "summarized_story": "Waste collection methods driven by local authorities remain inadequate, particularly in rural areas.\nIt serves two broad sets of users – waste producers and recycling businesses.\nOn the business side are mobile collectors – typically young, low-income Nigerians – that fulfill on-demand recovery requests from waste producers within an area.\nWaste producers get paid directly in mobile wallets and funds can be redeemed in cash or directly transferred to the individual’s account.\nImage Credit: SuppliedTransforming informal recycling in NigeriaIn Nigeria, the bulk of recyclable waste collection and processing is carried out by informal waste pickers and processors, with unregistered SMEs dominating the billion-dollar recycling sector."
  },
  {
    "headline": "Why Nigeria’s vehicle financing culture is struggling to take flight",
    "summarized_story": "But insufficient purchasing power among middle-class Nigerians coupled with limited or no access to vehicle financing puts cars out of reach for over 90% of the population.\nIn developed economies, car loans and vehicle financing schemes help people spread out vehicle payments over several months or even years.\nTwo major factors that influence the access and affordability of vehicle financing in Nigeria are interest rates and the value of the vehicle being financed, according to Gbenro Dara.\nAccording to Dara, the latter factor is the biggest drawback when it comes to vehicle financing in Nigeria.\nSeveral microlenders have developed vehicle financing programs, which take the asset as collateral."
  },
  {
    "headline": "MTN Group, Africa’s largest telecom, reportedly in talks to sell Afghanistan arm",
    "summarized_story": "Africa’s largest telecom company MTN Group is reportedly in talks with potential international buyers for its wireless business in Afghanistan per Bloomberg.\nThe South Africa headquartered company is currently the market leader in Afghanistan with a 40% share and is in discussions with several parties in ongoing negotiations to sell its Afghanistan arm.\nA writedown of MTN’s Afghanistan business without any proceeds from disposal is estimated to cost about R700 million ($49 million) according to undisclosed sources familiar with the negotiations.\nThe sale of its Afghanistan unit is crucial to MTN as it plans to raise about R15 billion ($1 billion) from shareholding sales in markets outside Africa.\nMTN currently serves over six million customers in Afghanistan, its planned exit could serve as an opportunity for other Afghanistan telecom players to expand their market share, while MTN does the same in Africa."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "College of education Abudu ready for use – Gov Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbudu — Following completion of the College of Education, Abudu campus in Orhionmwon local government area of Edo state, Governor Godwin Obaseki has confirmed the institution’s readiness to commence academic activities.\nGov Obaseki confirmed the development on Thursday at the State College of Agriculture Iguoriakhi, near Benin city.\nObaseki said his administration promised to “rebuild” all state-owned tertiary institutions, hence the revamping of campuses at Abudu, Afuze, Igueben and others.\n“The College of Education has also progressed in terms of work, the Abudu Campus is ready, we are revamping Igueben and we have started work in Afuze.\nHowever, while January 2022 has been fixed for the reopening of the Agriculture college at Iguoriakhi, date for inauguration of the completed multi-million naira ultra modern Abudu campus is still being expected."
  },
  {
    "headline": "NNPC N287bn Profit: Atedo Peterside Got it wrong – Nigerian Observer",
    "summarized_story": "It is important to emphasise that this is the third consecutive year, the NNPC under the watch of Mele Kyari is publishing its Audited Financial Statement.\nNigerians can readily recall that President Muhammadu Buhari promised to turn around the fortunes of the then ailing national oil corporation and reposition it for profitability.\nThis was the chief reason why he appointed Mallam Mele Kyari as the Group Managing Director of the NNPC in the first place.\nThe NNPC we know before the coming on board of Mele Kyari and his management team operated as an opaque institution.\nTo demonstrate his commitment to taking NNPC to a profit-making corporation, Mele Kyari launched the Transparency, Accountability and Performance Excellence (TAPE) programme."
  },
  {
    "headline": "NUJ Resolves Impasse In Rivers Council, Inaugurates Caretaker Committee – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe National Secretariat of the Nigeria Union of Journalists (NUJ), has resolved the seeming crisis that rocked the Rivers State Council of NUJ after their election was stalemated.\nToday, Thursday 9th September, 2021, a Caretaker Committee of the Council was inaugurated to pilot the affairs of the Council pending when it would be able to bring all parties together for a proper election to usher in a substantive State Working Committee for the Council.\nHe asked the newly constituted Caretaker Committee members to urgently restore peace to the Council and put machinery in place to conduct the Council election soonest.\nHe frowned at the behaviours and actions of certain members and leaders of Rivers Council who tried vehemently to resist the delegated officers from carrying out the assignment for which they were sent Rivers State.\nResponding to questions from newsmen, the new Caretaker Committee Chairman, Comrade Amaechi Okonkwo promised to ensure a peaceful election of the Council in no time."
  },
  {
    "headline": "Obaseki charges newly employed Edo workers on commitment, service delivery …assures of better wages for Edo civil, public servants – Nigerian Observer",
    "summarized_story": "Obaseki gave the charge while delivering closing remarks at the closing ceremony for the on-boarding programme for the new workers employed into the Edo State Civil and Public Service, at the John Odigie-Oyegun Training Centre, in Benin City.\nObaseki noted: “Today, we are completing the on-boarding session for the first set of newly appointed public and civil servants.\nHe said: “The focus and plan of my administration is to recruit 2,000 into the Edo State Civil and Public Service before the end of my term as Governor of Edo State on November 12th, 2024.\nThis will be a major transformation of the civil and public service in the State.\nWe embarked on rebuilding the service to make things work in Edo State and Nigeria."
  },
  {
    "headline": "Lagos #EndSARS Panel: Forensic expert says integrity of Lekki tollgate scene ‘was compromised’",
    "summarized_story": "A forensic expert from Sentinel Forensics Ltd, Joseph Funsho-Ako, on Saturday told the Lagos Judicial Panel of Inquiry that the integrity of the scene of the Lekki tollgate shooting was compromised before they began a forensic analysis of the environment.\nMr Funsho-Ako had on Friday submitted a ballistic report of the forensic investigation conducted on the ammunition presented by the Nigerian Army at the panel.\nHe had explained that the samples of ammunition presented by the Nigerian Army matched bullet shells recovered at Lekki Tollgate.\nAt another appearance before the panel, the army said although they went to Lekki tollgate on October 20 with both blank and live ammunition, they only fired blank cartridges.\nThe witness said “no.”Days after the Lekki incident, Mr Fashola, while visiting the scene of the shooting, said he found a ‘hidden camera’ at the tollgate."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "CBN denies ordering banks to convert customers’ domiciliary accounts to naira",
    "summarized_story": "The Central Bank of Nigeria (CBN) has said it did not direct banks to convert all customers’ domiciliary accounts into naira accounts.\nThe apex bank in a statement on Saturday by its Director, Corporate Communications, Osita Nwanisobi, said a fake circular with a fake CBN logo curiously dated “13 September 2021” (next Monday), and purportedly issued by its Trade and Exchange Department directed that all Deposit Money Banks, International Money Transfer Operators (IMTOs) and members of the public are to convert domiciliary account holdings into naira.\n“We wish to reiterate that the Bank has not contemplated, and will never contemplate, any such line of action.\nThe speculation is a completely false narrative aimed at triggering panic in the foreign exchange market,” CBN said.\nThe apex bank in the statement recalled that it had assured that there was no plan to convert the foreign exchange in the domiciliary accounts of customers into Naira in order to check the alleged shortage of availability of the United States Dollar (USD)."
  },
  {
    "headline": "CBN warns banks against FX malpractice, threaten sanctions",
    "summarized_story": "Nigeria’s apex bank, the Central Bank of Nigeria (CBN), has warned that banks involved in any form of foreign exchange (FX) malpractice risk their FX operational licence being suspended for at least one year.\nThe apex bank issued the warning in a circular signed by O.S.\nIn the circular, the CBN urged banks to know their customers, as well as the kind of businesses their customers are involved in.\n“Given these responsibilities and in view of recent occurrences in the market, the CBN would like to remind banks to desist from all and any form of forex malpractice.\nThe bank had accused BDC operators of turning away from their objectives, saying they have become agents that facilitate graft and corruption in the country."
  },
  {
    "headline": "Osun PDP: Adagunodo cautions ward, LGA chairmen against unauthorised issuance of suspension letters",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe embattled chairman of People’s Democratic Party (PDP) in Osun state, Prince Soji Adagunodo, has warned ward and local government chairmen of the party in the state to desist from unauthorized issuance of suspension letters to members of the party for their personal aspiration sake, saying such act is inimical to the party’s constitution.\nAdagunodo in a warning letter issued and personally signed, copies of which were made available to newsmen in Osogbo at the weekend, noted that party members have been complaining of undue harassment and intimidation by some leaders who perceive them as their antagonists in their pre- assumed political ambition.\nHe said the complaint of undue harassment of the members have been so much since the national headquarters released the timetable and guidelines for ward congress in the state, noting that such actions of some ward and local chairmen are unauthorized.\nThey must also know that such action, if taken, or purportedly taken, is ultravires, null and void and of no effect.\nNobody should take any action that will have negative effects on the chances of our Party in future elections,” Adagunodo concluded."
  },
  {
    "headline": "Forensics experts say Nigerian Army fired at Lekki Tollgate during #EndSARS",
    "summarized_story": "Sentinel Forensic Limited, a forensics company contracted to investigate circumstances surrounding the October 20, 2020 #EndSARS incident at Lekki tollgate, has said bullets were fired from the firearms of the Nigerian Army.\nThe company’s representative, Joseph Kayode Funsho, disclosed this during an appearance before the Judicial Panel of Inquiry and Restitution which sat on Friday, September 10, 20221, ThisDay reported.\nAccording to Funsho, the live ammunition (bullets) were discovered to have been registered to the Nigerian Army.\nHe also insisted that the military only fired into the air and not directly at the #EndSARS protesters.\nThe company’s findings, however, seem contrary to claims of the Nigerian Army"
  },
  {
    "headline": "Okpokwu LG Chairman Urges Active Voter Registration In Edumoga",
    "summarized_story": "Amina Audu, has charged people of Edumoga community to get actively involved in the ongoing Continuous Voter Registration (CVR) exercise by the Independent National Electoral Commission (INEC) ahead of the 2023 general elections.\nAudu spoke when the national president of Saint Mathew Edumoga Catholic Community (SMECC), Mr. Sunday Adokwu, paid her a courtesy visit in her country home, Ojigo at the weekend.\nShe solicited the support of Edumoga sons and daughters through the Edumoga Catholic Community to relay the message to the people as part of efforts to have an enduring electoral culture in the area.\nHe made the call when Mr Sunday Adokwu, paid him a courtesy visit at Efoyo.\nOn the entourage were the president of SMECC (Keffi branch), Mr Ewache John Ajefu; the general secretary, Mr Godwin Idoko; special adviser on strategy to the national president, Mr Emmanuel Onah and the deanary president of Holy Name Parish Ugbokolo, Mr Cletus Idu Idoko, among others."
  },
  {
    "headline": "Okpokwu LG Chairman Urges Active Voter Registration In Edumoga",
    "summarized_story": "Amina Audu, has charged people of Edumoga community to get actively involved in the ongoing Continuous Voter Registration (CVR) exercise by the Independent National Electoral Commission (INEC) ahead of the 2023 general elections.\nAudu spoke when the national president of Saint Mathew Edumoga Catholic Community (SMECC), Mr. Sunday Adokwu, paid her a courtesy visit in her country home, Ojigo at the weekend.\nShe solicited the support of Edumoga sons and daughters through the Edumoga Catholic Community to relay the message to the people as part of efforts to have an enduring electoral culture in the area.\nHe made the call when Mr Sunday Adokwu, paid him a courtesy visit at Efoyo.\nOn the entourage were the president of SMECC (Keffi branch), Mr Ewache John Ajefu; the general secretary, Mr Godwin Idoko; special adviser on strategy to the national president, Mr Emmanuel Onah and the deanary president of Holy Name Parish Ugbokolo, Mr Cletus Idu Idoko, among others."
  },
  {
    "headline": "AbdulRazaq Seeks Rehabilitation Of Federal Roads In Kwara",
    "summarized_story": "Kwara State governor, AbdulRahman AbdulRazaq, has sought the intervention of the minister of Works, Mr Babatunde Fashola, on the deplorable condition of some federal roads in the state.\nThe governor at a meeting with the minister appealed to him for the roads to be fixed to ease the burden on the people of the state.\nA statement by the governor’s chief press secretary, Rafiu Ajakaye, said the roads discussed include the Kishi-Kaiama and dualisation of the Eiyenkorin – Jebba road with emphasis on the bad section before Oko-Olowo and Ilorin -Kabba road.\nThe minister was said to have assured that the request would be looked into, especially as the federal government puts finishing touches on the 2022 budget."
  },
  {
    "headline": "AbdulRazaq Seeks Rehabilitation Of Federal Roads In Kwara",
    "summarized_story": "Kwara State governor, AbdulRahman AbdulRazaq, has sought the intervention of the minister of Works, Mr Babatunde Fashola, on the deplorable condition of some federal roads in the state.\nThe governor at a meeting with the minister appealed to him for the roads to be fixed to ease the burden on the people of the state.\nA statement by the governor’s chief press secretary, Rafiu Ajakaye, said the roads discussed include the Kishi-Kaiama and dualisation of the Eiyenkorin – Jebba road with emphasis on the bad section before Oko-Olowo and Ilorin -Kabba road.\nThe minister was said to have assured that the request would be looked into, especially as the federal government puts finishing touches on the 2022 budget."
  },
  {
    "headline": "Gov Emmanuel Seeks Assembly’s Nod for N136.504bn Supplementary Budget",
    "summarized_story": "Worried by the current socio-economic downturn and financial crisis rocking the country’s economy, Governor Udom Emmanuel of Akwa Ibom State has approached the state House of Assembly, seeking a supplementary budget of N136, 504, 539,000 billion.\nThis was the major decision reached at the weekend’s State Executive Council (SEC) meeting held at Government House, Uyo, the state capital.\nThe commissioner for finance, Pastor Uwem Andrew Essien, who came up with the proposal, hinged the intervention on what he described as “inflation, high exchange rate and other accidentals”.\nBesides, he said natural disasters that occurred in the last couple of months including floods, landslides that submerged homes and cut-off some roads across the state, were not captured in the budget and required quick intervention by government.\nThe proposal was unanimously adopted by the members for onward transmission to the state House of Assembly led by the Speaker, Mr. Aniekan Bassey (Uruan) for legislative deliberations in line with due diligence to enhance early passage and assent, to become law."
  },
  {
    "headline": "More money! Whitemoney, Liquorose win N500,000 each in new contest",
    "summarized_story": "Whitemoney, Liquorose win N500,000 each in new contestMore money!\nWhitemoney, Liquorose win N500,000 each in new contestBig Brother Naija Shine Ya housemates, Whitemoney and Liquorose, have won N500,000 each in an online voting contest organised by BuyPower.\nThe result for the BuyPower social media contest was announced via the BuyPower Instagram page on Saturday.\nAnnouncing the results, the caption read, “With over one million comments recorded on our social accounts, we are thrilled to announce housemates @liquorose and @whitemoney_ as our winners for the #BuyPowerNGxBBNaija social contest!\nThe task involved theatrical performances and the housemates were divided into four teams: Team Electric, Team BP Surge, Team Wifi Plug, and Team Smart Surge."
  },
  {
    "headline": "More money! Whitemoney, Liquorose win N500,000 each in new contest",
    "summarized_story": "Whitemoney, Liquorose win N500,000 each in new contestMore money!\nWhitemoney, Liquorose win N500,000 each in new contestBig Brother Naija Shine Ya housemates, Whitemoney and Liquorose, have won N500,000 each in an online voting contest organised by BuyPower.\nThe result for the BuyPower social media contest was announced via the BuyPower Instagram page on Saturday.\nAnnouncing the results, the caption read, “With over one million comments recorded on our social accounts, we are thrilled to announce housemates @liquorose and @whitemoney_ as our winners for the #BuyPowerNGxBBNaija social contest!\nThe task involved theatrical performances and the housemates were divided into four teams: Team Electric, Team BP Surge, Team Wifi Plug, and Team Smart Surge."
  },
  {
    "headline": "Protest in Kaduna over LG Polls",
    "summarized_story": "As the Kaduna State Independent Electoral Commission (KADSIECOM) announced that the council polls in 4 Local Government Areas of the state were inconclusive, there was a peaceful protest on Saturday by supporters of the All Progressives Congress (APC) from Jema’a Local Government Area, who gave KADSIECOM 24 hours to declare the APC Chairmanship candidate winner.\nHowever, Chairman of KADSIECOM, Dr Saratu Dikko-Audu, declared on Friday that theelection in Jaba, Kauru Jema’a, Kachia and Soba LGAs where the council poll took place on Saturday 4th, September 2021, was inconclusive.\nShe said the results of the affected LGs were inconclusive because elections could not hold in some wards.\nHowever, the party supporters who besieged the KADSIECOM office in Kaduna expressed dismay and demanded the election body to reverse its decision within 24 hours and declare their candidate winner.\nVanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Protest in Kaduna over LG Polls",
    "summarized_story": "As the Kaduna State Independent Electoral Commission (KADSIECOM) announced that the council polls in 4 Local Government Areas of the state were inconclusive, there was a peaceful protest on Saturday by supporters of the All Progressives Congress (APC) from Jema’a Local Government Area, who gave KADSIECOM 24 hours to declare the APC Chairmanship candidate winner.\nHowever, Chairman of KADSIECOM, Dr Saratu Dikko-Audu, declared on Friday that theelection in Jaba, Kauru Jema’a, Kachia and Soba LGAs where the council poll took place on Saturday 4th, September 2021, was inconclusive.\nShe said the results of the affected LGs were inconclusive because elections could not hold in some wards.\nHowever, the party supporters who besieged the KADSIECOM office in Kaduna expressed dismay and demanded the election body to reverse its decision within 24 hours and declare their candidate winner.\nVanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Face of shame: U.S. jails Nigerian Adewara over romance scams",
    "summarized_story": "Nigerian Afeez Olajide Adebara has been jailed for romance scams and money laundering just days after New York court sentenced another Nigerian for a similar offence.\nAdebara was sentenced on Friday to four years in jail by a court in the Northern District of Oklahoma for managing a group of money launderers in an online Nigerian romance scam.\n“Afeez Adebara led a group of money launderers who bilked unsuspecting victims out of their hard-earned retirement and savings accounts as part of a Nigerian romance scam,” said Acting U.S. Attorney Clint Johnson.\nTobiloba Kehinde, 29, a Nigerian citizen residing in Norman, was sentenced to eight months imprisonment, four of which were to be served in home confinement.\nChibuzo Obiefuna, 28, of Long Beach, California, and Jamiu Adedeji, 25, a Nigerian citizen residing in Norman, were each sentenced to time served."
  },
  {
    "headline": "Teenager Emma Raducanu wins U.S. Open championship",
    "summarized_story": "British teenager Emma Raducanu has emerged the new U.S. Open women’s singles champion, beating fellow teenager, Leylah Fernandez in two sets 6-4 6-3.\nShe came in as a qualifier, ranked No.150 in the world, but proved to the tennis world that she has gotten all the qualities to be a champion.\nRaducanu made her WTA tournament debut at the grass court event in Nottingham in June 2021.\nShe qualified for the 2021 U.S. Open main draw after posting straight set wins in all three qualifying rounds.\nShe is projected to move up to 24th in the world rankings on Monday after winning the U.S. Open, ending Johanna Konta’s 310-week reign as the top ranked British woman."
  },
  {
    "headline": "Nigeria Needs Federal Ministry Of Fulani Herdsmen Now: Sheikh Gumi",
    "summarized_story": "Amnesty without rehabilitation, reconciliation, and reparation is no amnesty,” Mr Gumi said.\nMr Gumi said his efforts to get amnesty for bandits and killer herdsmen have been sabotaged by President Muhammadu Buhari’s decision to deploy troops against violent criminals.\n“Some disingenuous people say: peace and negotiations with herdsmen bandits have failed, and your mission has failed!\nI am not one, but my country-lover, my region-lover, my state-lover, and my people-lover, and humanity-lover,” Mr Gumi said to Mr Adesina without naming him.\nSome disingenuous people say: peace and negotiations with herdsmen bandits have failed, and your mission has failed!"
  },
  {
    "headline": "Court Fixes Date For Trial Of Bureau De Change Operators Arrested For Financing Boko Haram Terrorism",
    "summarized_story": "The trial of certain Bureau De Change operators who were detained in March 2021 for allegedly funding Boko Haram terrorism in Nigeria has been set for Friday, September 17, 2021.\nNEWS DIRECT learnt from competent court sources that the hearing will hold at Court Room 4, Federal High Court Abuja at the Federal Capital Territory.\nIt will be on 17th September, Court Room No 4, Federal High Court Abuja, behind the Federal Ministry of Justice.\nHe noted, “The association of bureau de change operators hired a barrister for their members.\nThey went for a court sitting and the barrister wanted the DSS to bring his clients for the next sitting."
  },
  {
    "headline": "‘National Assembly Spends Just 2 Percent Of Annual Budget’ – Gbajabiamila Reveals",
    "summarized_story": "Femi Gbajabiamila, the Speaker of the House of Representatives, claimed on Saturday that the National Assembly spends less than 2% of the national budget, and wondered why no one is questioning the other 98%.\nThe National Assembly should have less than 100 members, including Abuja,” the varsity don’t said in his lecture.\nIbrahim Isiaka of Ifo/Ewekoro constituency, mentioned that the money budgeted for the National Assembly was two per cent of the total budget.\nYou are also talking about the National Assembly Commission, you are talking about everything, all encompassing,” he said.\nHe charged Nigerians to change the perception that Nigeria runs the most expensive National Assembly in the world."
  },
  {
    "headline": "Zamfara: Bandits Have Rejected Peace, We’ll Give Them War – Gov Matawalle",
    "summarized_story": "Zamfara State Governor Bello Matawalle has vowed to crack down on bandits terrorizing some portions of the state, claiming that they have rejected the peace that has previously been offered to them.\nHe stated this while addressing a congregation in Gusau, the state capital on Saturday.\n“My administration will no longer grant amnesty to bandits as they have failed to embrace the peace initiative earlier extended to them,’’ the governor said.\nThe governor called on all residents to be patient and to support new security measures put in place to flush out bandits and other criminal elements across the state.\nHe revealed that the bloodthirsty bandits’ emissaries informed him that they had repented and were ready to dialogue with the government."
  },
  {
    "headline": "It’s too late, Matawalle reveals why he made u-turn on amnesty for bandits",
    "summarized_story": "Days after telecommunication network was cut off, Zamfara state governor, Bello Matawalle, has revealed that window of amnesty he gave bandits has expired.\nMatawalle said the decision became necessary after the bandits failed to embrace the peace initiative earlier extended to them by the state government.\nThe governor who spoke on Friday after attending in Gusau, the state capital said, “They (bandits) sent a powerful committee to plead with us to cease fire and allow supply (of food and other essential commodities) but I refused.\n“What we are doing to bandits is to send them to God, so they can answer their questions.”According to the governor, bandits who are currently facing the heat of the superior fire of security operatives have sent some persons to inform him that they have repented.\nHe said the criminals were ready for a dialogue over the security situation in Zamfara, but it was too late for them to have a rethink."
  },
  {
    "headline": "Breaking: Lukaku fires first goals at Stamford bridge as Chelsea crush Aston Villa in Premier League clash",
    "summarized_story": "Romelu Lukaku scored his first ever goals at Stamford Bridge as Chelsea beat Aston Villa to maintain their unbeaten start.\nLukaku kissed the club badge as he celebrated his opener in front of Blues fans after beating Villa goalkeeper Jed Steer on his 15th appearance at the stadium overall.\nThe Belgian’s clinical finish through Steer’s legs came from a precise pass from Mateo Kovacic inside his own half.\nDean Smith’s side created plenty of chances after conceding and managed four shots on target, but could not find a way past Blues goalkeeper Edouard Mendy.\nLukaku sealed the win for Chelsea in injury time with a powerful finish down from the edge of the box."
  },
  {
    "headline": "Revealed! How couple ‘stole male child, staged naming ceremony’ in Kano",
    "summarized_story": "The Police Command in Kano State has arrested a couple for allegedly stealing a day-old baby from Muhammad Abdullahi Wase Teaching Hospital, Kano.\nThe command’s Public Relations Officer, DSP Abdullahi Haruna-Kiyawa, disclosed this in a statement on Saturday in Kano.\nHaruna-Kiyawa said that one Rabiu Muhammad, residing in Gayawa quarters, Ungogo LGA of Kano, reported to the Police that one of the twins his wife delivered on September 7 at Muhammad Abdullahi Wase Teaching Hospital Kano, was missing.\n“Intelligence report led to the arrest of one Maryam Sadiq, 22, and her husband, one Abubakar Sadiq, 50 years, both of Rijiyar Zaki quarters, Kano.\nThe PPRO said that the CP ordered that the case be transferred to the Criminal Investigation Department of the command for discreet investigations."
  },
  {
    "headline": "Katsina Miyetti Allah cattle Hore disassociate self from national scribe unguided outrances about Masarii – NigPilot",
    "summarized_story": "Miyetti Allah Kautal Hore, Katsina Chapter has distanced itself from the recent unguarded outburst credited to its National Scribe, Saleh Alhassan.\nThe Chairman of the Katsina State, Miyetti Allah, Alh.\n“We request to have your indulgence this morning to make some issues clear as far as the relationship between Miyetti Allah Hore and the Katsina Government is concerned.\nMiyetti Allah cattle Hore is a registered and law-abiding association.\n“Forget that man, that man is the worst Governor Katsina has had; we are just praying for his time to lapse.”However, the Katsina State chapter Chairman of Miyetti Allah, Alh."
  },
  {
    "headline": "Immigration Boss, Babandede, bows out of office, handover to DCG Jere – NigPilot",
    "summarized_story": "Speaking at the occasion, CGI Babandede noted that indeed the Service has witnessed tremendous changes under his leadership, but that he did not do it alone.\n“I am very proud today because I am leaving the Service better than I met it.\nAt the session, some friends of the Service including Dr. Sam Nwosu in his farewell message stated that CGI Babandede has left indelible marks on the walls of the Service.\nIn a statement signed by the NIS Public Relations Officer, ACI Amos Okpu said a major highlight of the day’s event was the handover of the baton of leadership of the Service to the Deputy Comptroller General Immigration, DCG Idris Isah Jere as Acting Comptroller General of Immigration.\n“The acting Comptroller General was before now in-charge of the Directorate of Finance and Accounts.”"
  },
  {
    "headline": "UNIPORT Alumni President For Burial in Bayelsa -NigPilot",
    "summarized_story": "The Family of the late president of the University of Port Harcourt Alumni Association, Chief Chris Adokeme has fixed his burial for Friday, September 17, 2021, at his hometown Isampou, Sagbama local government area of Bayelsa state.\nAdokeme passed away in Yenagoa on Monday 5th July 2021 at the age of 61 years.\nIn a release signed by the acting President of the association, Mr. Uduak Ewitat, he again expressed grief over the death of the late president, urging the family to take heart over his demise.\n“Our late President without any shadow of doubt gave his all for the growth and development of the unique UNIPORT alumni association.\nThat he passed on while serving us is an eloquent testimony to his love for the collective welfare of our association” he added."
  },
  {
    "headline": "Confronting adult illiteracy, out-school children approach towards resolving Nigeria’s challenges-Adamu",
    "summarized_story": "Minister of Education, Malam Adamu Adamu has said the comprehensive approach to resolving current Nigeria’s challenges is through confronting adult illiteracy and paying attention to out of school children.\nDisclosing this at the 2021 International Literacy Day, ILD, held in Abuja on Tuesday, Adamu said the Nigerian government is determined to confront the adult literacy programmes with the same zeal it is handling out of school children.\n“As you are aware, it is estimated that over 6.9 million children are out of school.\nInvesting in Education of the parents will have ripple effect on the reduction of out of school Children.\nHe said “the COVID-19 crisis has confirmed the fragility of many youth and adult literacy programmes, systems and policies as represented by the abrupt suspension of numerous programmes."
  },
  {
    "headline": "Lekki Shooting: Integrity Of Scene Had Been Compromised Before Forensic Analysis, Says Expert",
    "summarized_story": "The forensic team that presented its report to the Lagos State Judicial Panel on Friday said the integrity of the scene of the Lekki Toll Gate shooting had been compromised long before forensic investigations.\nAs at the time of this report, the forensic expert was being cross-examined by different lawyers at the panel.\nThe focus at the latest proceeding was the long-awaited forensic report for the Lekki Tollgate Shooting which sparked widespread condemnation within and outside the country.\nHe added that the blank ammunition tendered was of a different cartridge type 7.62mm x 51mm.\nIn her reaction, the chairperson of the judicial panel, Justice Doris Okuwobi, asked the media to be professional and responsible in its reportage of the public hearing."
  },
  {
    "headline": "We Have No Plan To Convert Domiciliary Account Holdings Into Naira – CBN",
    "summarized_story": "The Central Bank of Nigeria (CBN) has asked Nigerians to ignore reports that domiciliary account operators have been directed to convert their holdings into naira.\nIn a statement on Saturday, CBN’s Director of Corporate Communications, Osita Nwanisobi, said the purported directive was not from the bank.\nThe speculation is a completely false narrative aimed at triggering panic in the foreign exchange market,” he said.\nThe CBN spokesman, therefore, appealed to domiciliary accounts operators and members of the banking public to go about their legitimate foreign exchange transactions.\nNwanisobi warned against the unauthorised use of the CBN logo, saying appropriate authorities were already making efforts to apprehend those behind the misleading circular."
  },
  {
    "headline": "No More Amnesty For Bandits In Zamfara, Says Matawalle",
    "summarized_story": "Zamfara State Governor, Bello Matawalle, says his administration will no longer grant amnesty to bandits in the state.\nGovernor Matawalle stated this on Friday after attending the Jumat prayer at the Dalala Mosque in Gusau, the state capital.\nAccording to the governor, bandits who are currently facing the heat of the superior fire of security operatives have sent some persons to inform him that they have repented.\nNo More DialogueGovernor Matawalle commended the security agencies for the successes recorded in the ongoing onslaught against the criminals in the state.\nThe decision to stop pardoning bandits comes a week after the Nigerian Communications Commission (NCC) directed telecommunications providers to shut down services in Zamfara for a period of two weeks."
  },
  {
    "headline": "Ignore IPOB-Sit-At Home Order, Obiano Tells Banks, Markets In Anambra",
    "summarized_story": "Anambra State Governor Willie Obiano has ordered markets, banks, transport business owners, among others to ignore the sit-at-home order and go about their businesses from Monday, September 13.\nThe governor gave the order on Saturday after a meeting with stakeholders and members of the State Security Council.\nHe urged residents of the state to ignore the Monday (weekly) sit-at-home order by the leadership of the Indigenous People of Biafra (IPOB).\nGovernor Obiano said it is totally unacceptable as it has become inimical to the state’s economy.\nGovernor Obiano also at the meeting welcomed the new Commissioner of Police, Tony Olotu, who will take over from the former CP, Chris Owolabi."
  },
  {
    "headline": "U.S. Court Jails Nigerian For $2.5m Romance Scam",
    "summarized_story": "A United States court in the Northern District of Oklahoma on Friday sentenced a Nigerian, Afeez Adebara, to four years in prison.\nAdebara bagged the jail term for managing a group of money launderers in an online romance scam that defrauded multiple victims, including elderly individuals across the U.S., and caused losses of at least $2.5 million.\n“Adebara coordinated with overseas co-conspirators who had assumed false identities on online dating websites and social media platforms to defraud victims,” said the statement.\n“Adebara opened multiple accounts using fraudulent identities, then provided the account and routing numbers to the overseas co-conspirators.\nThe overseas co-conspirators told victims that they were U.S. residents working or traveling abroad."
  },
  {
    "headline": "Panic as bandits allegedly send threat letter to four Sokoto communities -",
    "summarized_story": "Residents in Shuni a community in Dange/Shuni local government area of Sokoto state are thrown into confusion following the discovery of a letter allegedly written by suspected members of the marauding bandits threatening to attack four villages in the local government.\nThe letter which was written in Hausa language was found under a three in one of the communities and since the discovery residents are now living in fear.\nIn the letter, four communities of Shuni, Kwanar Kimba, Rikina, and Dange,all in Dange/Shuni local government area of Sokoto state are listed as targets of the attack.\nA senior member of the Nigeria Union of Journalists NUJ, Sokoto state chapter living in one of the communities the bandits promised to attack confirmed to our correspondent that since the discovery of the letter panic has gripped members of the four Communities and their surroundings.\nThe four Communities mentioned in the letter are not more six kilometers from the Giginya Army Barracks Sokoto."
  },
  {
    "headline": "Zamfara taskforce arrests ten bandit collaborators",
    "summarized_story": "Ten bandit collaborators have been arrested by the Zamfara state Special Taskforce on Security.\nThe taskforce also intercepted motorcycles and jerrycans filled with premium motor spirit reserved for the bandits.\nThey were arrested at their hideout in Ungwan Sarkin Musulmi Village in Kaura Namoda local government area of the stateChairman of the Taskforce Abubakar Dauran who led the team says some of the bandit informants fled to the bush on sighting the team of security operatives.\nHe said the successes were recorded following intelligence gathered by the Taskforce with the assistance of some localsAbubakar Dauran expressed dismay over the attitude of some motorists who move from one filling to another buying fuel to deliver to bandits in their enclaves despite measures taken to tackle activities of armed banditsThe suspects according to him were handed over to the Zamfara state Police Command for further investigation."
  },
  {
    "headline": "Bandits betrayed us, we will crush them out of Zamfara",
    "summarized_story": "Zamfara State governor, Bello Matawalle said he will no longer continue with the peace dialogue with Bandits saying they have failed in the agreement.\nThe governor stated this while addressing Muslim faithful at the Umar Dalla – Dalla Mosque in Gusau, Zamfara State.\nMr. Matawalle expressed dismay over the attitude of some bandits who deceived the state committee on amnesty.\nHe vow to deal decisively with the bandits using military force.\nThe governor also warn politicians against giving out motorcycles to their supporters as according to him are being sold to bandits which are using it against innocent citizens."
  },
  {
    "headline": "National Convention: Our committee has resolved all PDP crises",
    "summarized_story": "Adamawa state governor, Ahmadu Fintiri said the People’s Democratic Party Convention Committee he headed has amicably revolved most crises he met on ground within two days in office.\nSpeaking to journalists at the Yola international airport shorty after he returned from Abuja, he said that Nigerians are expecting much from the PDP to rescue them out of the wood.\nHe promised that his committee will conduct credible convention that will be accepted by the party faithfuls.\nA chieftain of the PDP, Haladu Muhammed vouched for Gov Fintiri’s credibility to reconcile all aggrieved members across the country before the convention."
  },
  {
    "headline": "Deadly Unrest in Myanmar as Opposition Urges ‘Defensive War’",
    "summarized_story": "At least 20 people have been killed in fighting between militias and Myanmar’s security forces, according to witnesses and Myanmar media, in the worst violence since opponents of the military government called this week for a “people’s defensive war”.\nBut the opposition said the lack of international support has prompted activists and other people to take the matter into their hands.\nClashes erupted on Thursday and continued late on Friday in Thantlang in Chin State, bordering India, news reports also said.\nThe military tightly controls information and state media outlets have been selective in reporting unrest.\nThe same day, a shadow government working to reverse the coup called for a “people’s defensive war against the junta”."
  },
  {
    "headline": "Record-chasing Djokovic Sets Up US Open Final with Medvedev",
    "summarized_story": "World number one Novak Djokovic won a gruelling five-setter against Alexander Zverev to set up a US Open final against Daniil Medvedev and keep his bid for a calendar Grand Slam on track.\nThe 34-year-old must have feared a repeat when he double-faulted to hand Zverev the chance to serve for the opening set.\nNot always at his best from the baseline, Djokovic qualified for a record-equalling 31st Grand Slam final with exceptional serving and trademark mental resilience.\nHe then promised to play Sunday’s final as if it were the final match of his career.\nMedvedev will contest his third Grand Slam final on Sunday, having lost the 2019 final at Flushing Meadows to Rafael Nadal and the Australian Open final to Djokovic in February."
  },
  {
    "headline": "Teenagers Emma Raducanu, Leylah Fernandez Contest US Open Final",
    "summarized_story": "Emma Raducanu will seek to become the first British woman to win a Grand Slam singles title in 44 years when she takes on fellow teenager Leylah Fernandez in an unlikely US Open final between two players who have lit up New York.\nFernandez, 19, has brushed aside a series of leading players – taking out defending champion Naomi Osaka, fifth seed Elina Svitolina, world number two Aryna Sabalenka and three-time Grand Slam champion Angelique Kerber.\nTheir different paths and contrasting styles – but similarly fearless approach – have set up the first Grand Slam final between teenagers since the 1999 US Open when Serena Williams beat Martina Hingis.\n“When you see that kind of talent, that won’t be denied,” 18-time Grand Slam singles champion Martina Navratilova said.\nSuch is the attention that this match-up is attracting, Novak Djokovic’s quest for a record 21st men’s major and a calendar Grand Slam has been slightly overshadowed."
  },
  {
    "headline": "Nigeria: After 40-Day Standoff, Buhari Begs Striking Doctors to Return to Work",
    "summarized_story": "President Muhammadu Buhari on Friday met with leaders of the Nigeria Medical Association (NMA) at the State House, Abuja, over the 40-day-old industrial action embarked upon by resident doctors in the country, and pleaded with them to return to work, saying the timing of the strike was wrong.\nAccording to him, “This is a befitting role for the NMA, as a mature organisation, led by responsible members with long experience.\nEarlier in his speech, the NMA President, Prof. Innocent Ujah, thanked the President for appointment of members into strategic positions in government, assent to the Medical Residency Act and immunisation coverage.\nHe assured the President of the continuous support of members of the association to improve health in the country.\nThe meeting was also attended by the Minister of Labour, Chris Ngige, and Minister of State for Health, Olorunnimbe Mamora."
  },
  {
    "headline": "US Marks 20 Years Since 9/11, In Shadow of Afghan War’s End",
    "summarized_story": "By midnight, it was 9/11, the staggering starting point for a new era of terror, war, politics, patriotism and tragedy.\nPresident Joe Biden is scheduled to travel to all three attack sites: New York’s World Trade Center, the Pentagon and a field near Shanksville, Pennsylvania.\n“Children have grown up without parents, and parents have suffered without children,” said Biden, a childhood friend of the father of a Sept. 11 victim, Davis Grier Sezna Jr.\nTwo decades after helping to triage and treat injured colleagues at the Pentagon on Sept. 11, retired Army Col. Malcolm Bruce Westcott is saddened and frustrated by the continued threat of terrorism.\nSept. 11 propelled a surge of shared grief and common purpose, but it soon gave way."
  }
]