[
  {
    "headline": "Obiano, Soludo rejoice as Achebe’s son bags international award",
    "summarized_story": "Dr Chidi Achebe, the second son of Africa’s legendary novelist, late Chinua Achebe, has won the 2022 prestigious John and Samuel Bard Award in the United States, for excellence in medicine and science.\nOn hearing the news, the outgoing governor of Anambra State, Willie Obiano, and the governor-elect, Chukwuma Soludo, expressed their delight and congratulated Dr Chidi, who is also a chief executive of African Integrated Development Enterprise.\n“This is a parting gift to me and the Anambra people as I am about to depart office after eight years of giving my best to a great state”, Adinuba quoted Obiano as saying.\nProfessor Chinua Achebe held a distinguished professorial chair for several years at Bard College.\nAs AIDE chairman, the younger Achebe heads an organization that works to bring together international companies and expertise to create sustainable integrated delivery of medical care on the African continent."
  },
  {
    "headline": "Ukraine: Latest developments you need to know",
    "summarized_story": "Russia invaded Ukraine in the early hours of February 24, setting off the worst conflict in Europe in decades.\n– Zelensky upbeat on talks –Ukrainian President Volodymyr Zelensky sounds optimistic about the possibility of a negotiated end to the conflict after a fifth rounds of talks with Russia.\n– Payment day for Russia –Russia is due to make an interest payment on its foreign debt for the first since being hit with crippling Western sanctions, amid concerns that it could default.\nMoscow is due to pay $117 million (107 million euros) on two dollar-denominated bonds.\n– Refugees top 3 million –More than three million people have fled Ukraine since the start of the invasion, the UN migration agency IOM says."
  },
  {
    "headline": "Abba Kyari refuses to answer query by Force Hqtrs",
    "summarized_story": "It was gathered that the embattled detective was handed the query while in NDLEA’s custody, close to a month ago.\nRather than answer the query, sources told Vanguard that Kyari said he could not write from where he was.\nHe said when he gets out, he would officially answer the query, as he was not in the right frame of mind to answer officially,” a source said.\n“That the NDLEA officer who refused to compensate the informant was the one who framed DCP Abba Kyari up on a trump-up allegation that he was trying to bribe him.\n“That the agent of the Respondent declared the Applicant wanted because of a mere allegation that he was trying to bribe an NDLEA officer without sufficient proof."
  },
  {
    "headline": "I’m angry my home was snatched from me, Nigerian student describes harrowing escape from Ukraine",
    "summarized_story": "As the war in Ukraine rages on, two Nigerian students who have since returned home after fleeing Russia’s invasion of the country have described their traumatic escape.\nAdeniyi and Steve-Ajufo were among Nigerian students recently evacuated by the government.\nI wondered why it was like that since we were all trying to get out,” Adeniyi told CNN’s Zain Asher.\nSeveral people CNN spoke with in recent days — mainly African and Indian students schooling in Ukraine — complained of difficulty crossing the Ukraine border to bordering nations.\nAround 4,000 Nigerian students study in Ukraine with most of them studying medicine, according to the Nigerian President’s office"
  },
  {
    "headline": "2023: Ibom Patriots warns aspirants, supporters against use of combative utterances",
    "summarized_story": "By Chioma Onuegbu, UyoA socio-cultural group in Akwa Ibom State, Ibom Patriots, has expressed concern over some utterances from those seeking positions of power in the state in the past few weeks, and warned aspirants and their supporters to moderate the language they use during consultations.\nHis words, “Ibom Patriots appeals for peace.\nIn the past couple of weeks, we have listened to some of the utterances from those seeking positions of power, responsibility and trust.\nAny candidate who markets violence as a way of gaining electoral victory will govern with violence.\n“Therefore, Ibom Patriots advises our fathers, and mothers as well as our sons and daughters not to do anything or follow anyone that wants to return our state to those better forgotten years."
  },
  {
    "headline": "Vanguard Correspondent, Ahon, appointed NUJ National Ex-officio",
    "summarized_story": "By Ochuko Akuopha, UGHELLINATIONAL President of the Nigeria Union of Journalists, NUJ, Comrade Chris Isiguzo has appointed Delta Vanguard Correspondent, Comrade Festus Ahon as National Ex-officio of the Union.\nIsiguzo made the appointment at Birnin-Kebbi, Kebbi State on Monday, during the Inaugural National Executive Committee, NEC meeting of the second term of administration.\nThe National President noted that Ahon’s appointment was necessitated by the need to bring in vibrant professionals to complete the Central Working Committee, CWC, for the effective and efficient running of the Union.\nAppointed alongside Ahon who was inaugurated in absentia, was Comrade Abimbola Oyetunde, General Manager of Bronze FM from Edo State Council as National Trustee for Zone F.Chairman of Delta State Council of the union, Comrade Michael Ikeogwu, expressed delight at Ahon’s appointment, expressing appreciation to Isiguzo and members of the CWC for the honour done by the Council by appointing one of the leading Journalists in the State into CWC.\nHe assured that Council and Zone would not disappoint the Union by the reason of the appointments of Ahon and Abimbola who he said had been tested and proven as highly dependable and trusted unionists."
  },
  {
    "headline": "COVID-19: Ex-NANTA VC urges FG to review PCR test rules, says policy ‘making tourism business moribund’",
    "summarized_story": "NCDC policy states that “Upon arrival in Nigeria, Fully vaccinated travellers are required to conduct a COVID-19 PCR test on day 2 of arrival.\nUnvaccinated and partially vaccinated passengers are required to observe a mandatory 7-day self-isolation in addition to a COVID-19 PCR test on days 2 and 7 post-arrival.\n“For travellers arriving Nigeria, Covid-19 PCR test is compulsory within 48 hours irrespective of your vaccination status.\n“It is imperative that this policy is reviewed because businesses are moribund, due to the exorbitant PCR test charge.\n“So, if we can copy the West and America as regards Covid-19 guidelines and policies, why are we not copying them with financial implications as related to Covid-19 PCR test,” he said."
  },
  {
    "headline": "Court dismisses Nnamdi Kanu’s request for DSS DG to provide evidence on state of health",
    "summarized_story": "A Federal High Court, Abuja, has dismissed a motion filed by leader of the proscribed Indigenous People of Biafra, IPOB, Nnamdi Kanu, for the Director-General of the Department of States Services (DSS) to give oral evidence on his state of health.\nJustice Taiwo Taiwo, ruling on Wednesday, held that fundamental right cases are special cases “sui generis” which mode of commencement are affidavit evidence as prescribed under Order 2, Rule 2 of the Fundamental Human Right Enforcement Procedure Rules, 2009.\nTaiwo adjourned the matter until April 13 for the hearing of the substantive application.\nRecall that Justice Taiwo had, on March 7, fixed today for the ruling on Kanu’s motion, filed by his lawyer, Maxwell Opara.\nOpara, in the application, prayed the court to direct the DSS DG and the IPOB leader to appear before it to give oral evidence regarding the health condition of the latter."
  },
  {
    "headline": "Northern women lament persistent ASUU strike",
    "summarized_story": "A northern women group, the Jam’iyyar Matan Arewa, has expressed dissatisfaction over the two months extension of the ongoing industrial action by the Academic and Staff Union of Universities (ASUU).\nIts National President, Hajiya Rabi Musa Saulawa, said the extension would affect the educational sector across the 36 states of the federation.\nAccording to her, any additional months of students staying at home would have serious consequences to the educational sector including the economy, agriculture and other human endeavours.\nShe observed that the strike comes amid an increase in price of foodstuff, high cost of petroleum and general insecurity challenges bedeveling peace stability in the country.\nShe urged the Federal Government to as a matter of urgency go back and resolve their problem with ASUU for the best interest of the students, educational sector and the future of the country."
  },
  {
    "headline": "ISWAP attacks Borno community, abduct health worker, cart away fuel, food items",
    "summarized_story": "The Islamic State of West African Province, ISWAP, insurgents have abducted a health worker with the General Hospital Gubio, Mr Bulama GeidamIt was gathered that the ISWAP insurgents attacked Gubio on Wednesday at about 2 a.m. and looted food items and fuel from a humanitarian truck.\nThe state Commissioner for Health, Juliana Bitruce, who confirmed the development to NAN in Maiduguri, said the incident was “unfortunate and disturbing”.\nShe said that the abducted health worker was among those who remained at their duty posts in spite of the challenges of insecurity in the area.\n“The ministry will write to officially inform all the concerned security agencies, including the Theater Command, Operation Hadin Kai,” she said."
  },
  {
    "headline": "Get ready for ballot revolution – Ohanaeze charges Igbo youths",
    "summarized_story": "The Ohanaeze Youth Council (OYC), the apex Igbo socio-cultural youth group, has urged Igbo and Nigerian youths in general to get ready for ballot revolution in the forthcoming 2023 general election.\nHe reiterated that the only available option for youths is to make use of the ongoing voter’s registration to register enmass to secure their future in the next political dispensation.\nHe insisted that all political profiteers in Igbo nation would be sacked at the forthcoming 2023 general elections, hence there will be a political tsunami in the entire Igboland.\n2023 general election will be a political tsunami in Igbo land, there will be total retirement of all politicians that have stolen our wealth from 1999 till date.\nThe Igbo youth shall organize a send-forth protest to all National assembly bench warmers."
  },
  {
    "headline": "Sowore’s fresh arraignment over alleged cybercrime stalls",
    "summarized_story": "The arraignment of a 2023 presidential aspirant, Mr Omoyele Sowore, on cybercrime charges stalled on Wednesday at the Federal High Court in Abuja.\nCounsel to Sowore, Mr Tope Temokin did not object to the application for adjournment.\nAlthough, Temakin initially announced his appearance for the 2nd defendant, he in a dramatic turn, withdrew his appearance.\nIn a short ruling, Justice Emeka Nwite billed to undertake the trial, granted adjournment request and fixed April 25 for the arraignment.\nJustice Nwite ordered the Federal Government to ensure service of the charges on the 2nd defendant before the adjourned date."
  },
  {
    "headline": "2023: El-Rufai directs aides, public servants with ambition to resign",
    "summarized_story": "Kaduna Governor Malam Nasir El-Rufai has directed political appointees, as well as public servants aspiring for political offices to resign on or before March 31, 2022.\nThe directive was contained in a circular by the Secretary to the State Government, Balarabe Lawal Abbas obtained on Wednesday.\nThe circular noted that the Act categorically provides that such officers should resign 30 days before the primary elections of the specific post they are aspiring for.\n“To this end, in compliance with the provision, all political appointees, and other public servants serving in the state government aspiring for political offices should submit their resignation letters to the SSG on or before 31st, March 2022.\n“This is your information and strict compliance please,” the statement reads."
  },
  {
    "headline": "Google honours Nigerian potter Ladi Kwali with doodle",
    "summarized_story": "Google has honoured Nigerian potter, Ladi Kwali, with a doodle on its home page.\nKwali is the first and only woman to appear on a naira note with her portrait on the N20 note.\nKwali was born in the village of Kwali in the Gwari region of Northern Nigeria, where pottery was an indigenous occupation among women.\nKwali became the first Nigerian woman to train in advanced pottery techniques, fusing her traditional style with innovative methods to craft a hybrid collection of pottery.\nIn honour of her contributions to academia, she received the Nigerian National Order of Merit Award in 1980 and was also awarded the national honour of the Officer of the Order of the Niger in 1981."
  },
  {
    "headline": "2023: Tinubu meets APC Senators Wednesday",
    "summarized_story": "The National Leader of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu, will today meet the Senate caucus of the party by 2.30pm.\nSenate President, Ahmad Lawan, disclosed this in a letter read during plenary on Wednesday.\nThe letter was signed by the Senate Leader, Senator Yahaya Abdullahi (Kebbi North).\n“There will be APC Senate caucus meeting with His Excellency, Senator Bola Ahmed Tinubu today, February 16, 2022,” Lawan said.\nThe meeting is scheduled to hold in the Senate President’s conference room."
  },
  {
    "headline": "Confusion in PDP over plot to stop Atiku, Saraki, Tambuwal",
    "summarized_story": "Those canvassing the exclusion of former defectors argued that their defection to APC was the major reason PDP lost power in 2015.\nThey were said to have argued that the PDP found itself in the opposition today because of their past actions.\nThose at the National Caucus meeting included former Vice-President Namadi Sambo; BoT Chairman Walid Jibrin; Atiku; Senator Ike Ekweremadu; former PDP Chairman Okwesilieze Nwodo; and Saraki.\nAddressing the BoT members, Dokpesi said: “The information reaching me now is not very palatable.\nMy position on zoning, by AtikuFormer Vice-President Atiku Abubakar yesterday intensified his presidential aspiration by meeting with BoT members."
  },
  {
    "headline": "Nigeria fails to meet OPEC’s 1.78mb per day quota",
    "summarized_story": "In its March report released yesterday, OPEC said Nigeria produced 1.399m barrels per day in January and 1.25 million barrels per day in February.\nOPEC said: “According to secondary sources, total OPEC-13 crude oil production averaged 28.47 mb/d in February 2022, higher by 0.44 mb/d month -on-month.\nIt noted that Crude oil output increased mainly in Saudi Arabia and Libya, while production in Nigeria and Equatorial Guinea declined.\nAccording to the report, the sustained contraction in oil sector GDP remains down to persistent reduction in crude oil production.\nIn addition, average crude oil production for full year 2021 printed at 1.6mb/d, 10.0 lower than full year 2020’s average of 1.8mb/d."
  },
  {
    "headline": "Nigeria must be great again – Musa, APC chairmanship aspirant",
    "summarized_story": "Senator representing Niger State in the 9th Senate and All Progressives Congress (APC) chairmanship aspirant, Senator Sani Musa, has proclaimed his vision to restore Nigeria’s glory days and take her back to the prosperous years of the past.\nSen Musa made this declaration after purchasing his registration form as a contestant for the coveted APC chairmanship seat scheduled for the elective Convention next week.\nThe Chairmanship aspirant also stressed the need to commend President Buhari for rescueing the party from the brink of collapse with his intervention on the debacle witnessed on account of the APC Caretaker Committee Chairman’s absence.\nSen Musa who is seen as a frontrunner in the race because of his forthrightness and life devoid of blemish, praised President Buhari for allowing a level playing field for all the aspirants to contest.\nThe zoning of the Chairmanship of the APC Chairnan’s position to the middle belt puts Sen Musa’s chances a notch higher ahead of the Convention holding March 26, 2022."
  },
  {
    "headline": "APC chairmanship aspirants to pay N20m",
    "summarized_story": "The party, in a statement, said it would be selling the chairmanship form for N20 million; Deputy National Chairman, N10 million; Zonal Chairman (National Vice Chairman) and other officers for N5 million.\nWhile the sale of forms would end on Friday, March 18, screening of aspirants would be held on Saturday, March 19.\nBut Governor Mai Mala Buni-led Caretaker/Extraordinary Convention Planning Committee (CECPC), yesterday, reclaimed control of the national secretariat of the party.\nOn the crisis over the party’s national convention, Akpanudoedehe said the APC has engaged a team of senior lawyers to address “a purported court order halting the planned” exercise.\nConvention will still hold March 26, sacrosanct and we are going to be having our NEC meeting on Thursday,” he said."
  },
  {
    "headline": "Truck crushes 2 as task force, drivers clash claims 2 lives in Lagos",
    "summarized_story": "The truck crushed a commercial motorcycle rider (Okada operator) and his passenger to death.\nAs at the time of filing this report, a combined team of policemen from Ajah, Rapid Response Squad and the Lagos State Task Force were on ground maintaining peace and order.\nMeanwhile, an attempt by men of Lagos state task force to enforce free flow of traffic along the Iyana Iba-Igando-Iyana Ipaja Expressway turned fatal as two people were allegedly shot dead by men of Nigeria Police Force attached to the task force team.\nOther drivers told Daily Sun that men of the task force shot at their tires and arrested most of their members for no reasons.\nAgada called on the Lagos State governor to come to their aid by checking the excesses of men of the task force."
  },
  {
    "headline": "Court threatens to strike out Abba Kyari’s N500m fundamental rights suit",
    "summarized_story": "From Godwin Tsa, AbujaJustice Inyang Ekwo of the Federal High Court sitting in Abuja, yesterday, threatened to strike out the N500 million fundamental rights enforcement suit the suspended Deputy Commissioner of Police, Abba Kyari, filed against the Federal Government.\nThe prosecution counsel argued that going by rules of the court, the applicant filed the further affidavit out of time.\nResponding, Kyari’s lawyer prayed the court for a short adjournment to enable her to regularise her processes.\n“Declaring the applicant a syndicate of the suspect without establishing a prima-facie case against him is unlawful and an infringement on his fundamental right.\n“A declaration that refusal to grant administrative bail to the applicant on alleged bailable offence is unlawful and infringement on the applicant’s fundamental human right."
  },
  {
    "headline": "ASUU strike: ABSU makes U-turn, recalls students",
    "summarized_story": "The university, which announced the closure on Tuesday via a statement issued in Benin by its Registrar, Ademola Bobola, directed students to vacate their hostels within 48 hours of the notice.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\n“Consequently, students are to vacate the hostels within 48 hours of this notice.\n“Management wishes the students safe journey to their respective destinations,” the statement read in part.\nThe statement recalling the students was signed by the Registrar, Dr Acho Elendu."
  },
  {
    "headline": "Cash-strapped FG to Utilise Part of Eurobond, Domestic Borrowing to Finance Fuel Subsidy",
    "summarized_story": "The West African country depends almost entirely on imports to meet its domestic gasoline needs, even though it is a crude oil exporter.\nPetrol subsidies cost Nigeria up to $7 billion a year in revenue.\nAhmed said the government was working with lawmakers to boost revenues and that the rise in oil prices means that borrowings will increase more than planned.\nAhmed had lamented that the rise in crude oil price had further widened the country’s budget deficit, pointing out that the federal government was presently in the process of amending the budget to accommodate fuel subsidy.\nWhat is happening to the global oil prices is also going to, perhaps, worsen matters."
  },
  {
    "headline": "Despite Akpanudoedehe’s Optimistic Statement, Buni, Bello Reconsider Positions",
    "summarized_story": "It fixed N20 million as cost of nomination form for the position of national chairman.\nAddressing journalists at the APC national secretariat in Abuja, Akpanudoedehe said the ruling party was now crisis-free, despite the events of the last few days.\nHe assured that delivering a seamless national convention of APC on March 26 was top priority for the caretaker committee.\nThe Kano State governor spoke yesterday in Abuja while fielding questions from journalists at the APC national secretariat.\nThe forms for the position of Deputy National Chairman (North and South) will be sold at the same N10 million."
  },
  {
    "headline": "Atiku: I Didn’t Run against Obasanjo in 2003 to Sustain Zoning Policy",
    "summarized_story": "Atiku also said the south had ruled Nigeria more times than the north since the country returned to democracy.\nThe former Vice President was probably referring to eight years each for former President Olusegun Obasanjo and President Muhammadu Buhari respectively; five years for former President Goodluck Jonathan and three years for late former president Umaru Musa Yar’Adua.\n“So, therefore, you cannot come and try to imply that the PDP has not been following the zoning policy.\nHis words: “When I joined the CAN, which my friend Bola set up, he gave me a set of condition for giving me the ticket; that I should make him vice president.\nI said no, I’m not going to make you Vice President, instead, I took Senator Ben Obi."
  },
  {
    "headline": "Terrorists Kill DPO, 6 Others in Niger Community",
    "summarized_story": "By Laleye Dipo in MinnaThe Divisional Police Officer in Nasko Police Station in Magama local government area of Niger state, Chief Superintendent of Police Umar Dakingari, and two other policemen have been killed by terrorists.Four members of local vigilance group were also killed by the gunmen in the incident which occured Tuesday afternoon.Very reliable source told THISDAY that the gunmen attacked the policemen and local vigilantes when they were planning to counter the attack of the terrorists who infiltrated the local government headquarters after their raid on parts of Kebbi state.It was learnt that the DPO got wind of the planned assault by the gunmen and immediately started mobilising his men for the counter offensive.Unknown to the DPO, the terrorists had already surrounded the station and started shooting sporadically.It was in the process that the DPO was shot.\nHis subordinates and the men of the local vigilance group were also killed.The terrorists, according to a report, later sacked the armoury and reportedly escaped with some arms.\nThe gunmen also went on a shooting spree in the town, as people ran helter skelter.The State Police Commissioner Mr Monday Bala Kuyars, when contacted on phone, confirmed the attack and the death of the DPO.Niger state Commissioner for Local Government and Internal Security Mr Emmanuel Umar also confirmed the incident.Umar said armed security men had been sent on the trail of the terrorists.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Convention: APC National Chairmanship Form Goes for N20m",
    "summarized_story": "Adedayo Akinwale in AbujaThe All Progressives Congress (APC) has fixed the sum of N20 million for the nomination form for national chairmanship position of the party ahead of the March 26 convention.\nThe Director of Organisation, Prof. Al-Mustapha Medaner, disclosed this in a statement issued Tuesday.\nThe sale of nomination forms, which was expected to have started on Monday, March 14, will close on Friday, March 18.\nThe ruling party noted that female aspirants and physically challenged are to pay 50 per cent of the prescribed fees for each position.\nHowever, as of Tuesday, the sale of forms for the various party positions was yet to commence."
  },
  {
    "headline": "2023: Desperate To Install A Stooge As Governor, Enugu Government Cabal Bribes Lawmakers With N5m Each To Endorse Zoning",
    "summarized_story": "“Besides, I don’t want to be a zonal governor, but the governor of the entire people of Enugu State,” he said.\nOne of the sources, a member of the State House of Assembly from Enugu North revealed: \"We were summoned up today (Monday) at the Majority Leader's (Hon.\nIkechukwu Ezeugwu's) house to sign a document prepared for House Members and LGA Council Chairmen of our (Enugu North) zone to the effect that there is zoning.\nAnother lawmaker who confirmed the situation said, \"Unfortunately, we thought by now all aspirants should be encouraged to table their programmes on how to end insecurity in Enugu State.\nIt was learnt that Ekweremadu is a dominant force in Enugu West and some prominent people in government, including the state governor, Ifeanyi Ugwuanyi."
  },
  {
    "headline": "2023: Desperate To Install A Stooge As Governor, Enugu Government Cabal Bribes Lawmakers With N5m Each To Endorse Zoning",
    "summarized_story": "“Besides, I don’t want to be a zonal governor, but the governor of the entire people of Enugu State,” he said.\nOne of the sources, a member of the State House of Assembly from Enugu North revealed: \"We were summoned up today (Monday) at the Majority Leader's (Hon.\nIkechukwu Ezeugwu's) house to sign a document prepared for House Members and LGA Council Chairmen of our (Enugu North) zone to the effect that there is zoning.\nAnother lawmaker who confirmed the situation said, \"Unfortunately, we thought by now all aspirants should be encouraged to table their programmes on how to end insecurity in Enugu State.\nIt was learnt that Ekweremadu is a dominant force in Enugu West and some prominent people in government, including the state governor, Ifeanyi Ugwuanyi."
  },
  {
    "headline": "Nigerian Petroleum Agency, NNPC Fails To Account For Missing 107Million Barrels Of Crude Oil — Audit Report",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC), now NNPC Limited, failed to account for about 107,239,436 barrels of crude oil lifted for domestic consumption in 2019, records from the office of the Auditor-General for the Federation (AuGF) have shown.\nAccording to the report, there were discrepancies between the amounts reported by the NNPC as transfer to the federations account and what was reported by the AuGF.\nThe AuGF said the Group Managing Director of the NNPC should be asked to explain the discrepancy between the two figures and remit the balance of N663,896,567,227.58 to the federation account or face sanctions.\nThe AuGF said the Group Managing Director of NNPC should justify non-adherence to the transfer of all federation revenue to the federation account as provided by the 1999 Constitution (as amended) and ensure that all revenue is paid into the federation account going forward.\nIt further said that a total of 239,800 barrels of crude oil valued at N5.498 billion was received in Warri and Kaduna refineries respectively between January and December 2019 with the source of the crude not validated due to the absence of source documents, while money was allegedly classified as crude oil losses without duly completed form 146 to be processed for further investigation."
  },
  {
    "headline": "Nigerian Petroleum Agency, NNPC Fails To Account For Missing 107Million Barrels Of Crude Oil — Audit Report",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC), now NNPC Limited, failed to account for about 107,239,436 barrels of crude oil lifted for domestic consumption in 2019, records from the office of the Auditor-General for the Federation (AuGF) have shown.\nAccording to the report, there were discrepancies between the amounts reported by the NNPC as transfer to the federations account and what was reported by the AuGF.\nThe AuGF said the Group Managing Director of the NNPC should be asked to explain the discrepancy between the two figures and remit the balance of N663,896,567,227.58 to the federation account or face sanctions.\nThe AuGF said the Group Managing Director of NNPC should justify non-adherence to the transfer of all federation revenue to the federation account as provided by the 1999 Constitution (as amended) and ensure that all revenue is paid into the federation account going forward.\nIt further said that a total of 239,800 barrels of crude oil valued at N5.498 billion was received in Warri and Kaduna refineries respectively between January and December 2019 with the source of the crude not validated due to the absence of source documents, while money was allegedly classified as crude oil losses without duly completed form 146 to be processed for further investigation."
  },
  {
    "headline": "Nigerian Petroleum Agency, NNPC Fails To Account For Missing 107Million Barrels Of Crude Oil — Audit Report",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC), now NNPC Limited, failed to account for about 107,239,436 barrels of crude oil lifted for domestic consumption in 2019, records from the office of the Auditor-General for the Federation (AuGF) have shown.\nAccording to the report, there were discrepancies between the amounts reported by the NNPC as transfer to the federations account and what was reported by the AuGF.\nThe AuGF said the Group Managing Director of the NNPC should be asked to explain the discrepancy between the two figures and remit the balance of N663,896,567,227.58 to the federation account or face sanctions.\nThe AuGF said the Group Managing Director of NNPC should justify non-adherence to the transfer of all federation revenue to the federation account as provided by the 1999 Constitution (as amended) and ensure that all revenue is paid into the federation account going forward.\nIt further said that a total of 239,800 barrels of crude oil valued at N5.498 billion was received in Warri and Kaduna refineries respectively between January and December 2019 with the source of the crude not validated due to the absence of source documents, while money was allegedly classified as crude oil losses without duly completed form 146 to be processed for further investigation."
  },
  {
    "headline": "'I'm next in line' -- Ogbuoji, former APC guber candidate, rejects PDP's pick to replace Umahi",
    "summarized_story": "Sunday Ogbuoji, All Progressives Congress (APC) candidate and runner-up in the Ebonyi state 2019 governorship election, says he is legally entitled to take over as governor of the state following the sack of David Umahi.\nOgbuoji had instituted a suit at an Ebonyi state high court seeking Umahi’s sack for defecting from the Peoples Democratic Party (PDP) to the APC.\nAdvertisementEkwo held that the 393,042 votes polled by Umahi in the March 2019 governorship election belonged to the PDP and cannot be legally transferred to the APC.\nHe said Igariwey cannot be nominated because he did not participate in the 2019 election process.\n“My most earnest desire is the good of Ebonyi state and our people."
  },
  {
    "headline": "'I'm next in line' -- Ogbuoji, former APC guber candidate, rejects PDP's pick to replace Umahi",
    "summarized_story": "Sunday Ogbuoji, All Progressives Congress (APC) candidate and runner-up in the Ebonyi state 2019 governorship election, says he is legally entitled to take over as governor of the state following the sack of David Umahi.\nOgbuoji had instituted a suit at an Ebonyi state high court seeking Umahi’s sack for defecting from the Peoples Democratic Party (PDP) to the APC.\nAdvertisementEkwo held that the 393,042 votes polled by Umahi in the March 2019 governorship election belonged to the PDP and cannot be legally transferred to the APC.\nHe said Igariwey cannot be nominated because he did not participate in the 2019 election process.\n“My most earnest desire is the good of Ebonyi state and our people."
  },
  {
    "headline": "Tinubu, APC senators to meet in Abuja today",
    "summarized_story": "Bola Tinubu, presidential aspirant, and senators elected on the platform of the All Progressives Congress (APC) will meet in Abuja on Wednesday.\nEzrel Tabiowo, media aide of Senate President Ahmad Lawan, disclosed this in a statement today.\n”The Senate caucus of the All Progressives Congress (APC) will hold a meeting with the National Leader of the ruling party, Bola Ahmed Tinubu, today at 2.30pm,” the statement said.\n”This was disclosed by the Senate President, Ahmad Lawan, in a letter read at the start of plenary on Wednesday.\n“There will be APC Senate caucus meeting with His Excellency, Senator Bola Ahmed Tinubu today, March 16, 2022,’ Lawan said.””The meeting between the APC Senate caucus and presidential aspirant is scheduled hold in the Senate President’s conference room.”AdvertisementIn January, Tinubu declared his intention to run for presidential office in 2023."
  },
  {
    "headline": "Tinubu, APC senators to meet in Abuja today",
    "summarized_story": "Bola Tinubu, presidential aspirant, and senators elected on the platform of the All Progressives Congress (APC) will meet in Abuja on Wednesday.\nEzrel Tabiowo, media aide of Senate President Ahmad Lawan, disclosed this in a statement today.\n”The Senate caucus of the All Progressives Congress (APC) will hold a meeting with the National Leader of the ruling party, Bola Ahmed Tinubu, today at 2.30pm,” the statement said.\n”This was disclosed by the Senate President, Ahmad Lawan, in a letter read at the start of plenary on Wednesday.\n“There will be APC Senate caucus meeting with His Excellency, Senator Bola Ahmed Tinubu today, March 16, 2022,’ Lawan said.””The meeting between the APC Senate caucus and presidential aspirant is scheduled hold in the Senate President’s conference room.”AdvertisementIn January, Tinubu declared his intention to run for presidential office in 2023."
  },
  {
    "headline": "Kaduna asks appointees seeking to contest in 2023 elections to resign by March 31",
    "summarized_story": "The Kaduna government has asked political appointees in the state seeking to contest for elective offices in 2023 to submit their letters of resignation before March 31.\nAccording to a statement by Balarabe Lawal, secretary to the state government, aspiring political appointees are expected to resign from their current positions 30 days before the primary elections of the post they are contesting.\n“The Act categorically provides that such officers should resign 30 days before the Party Primary Elections of the specific post they are aspiring for.\nAdvertisement“In compliance with this provision, all Political Appointees and other Public Servants serving in the Government of Kaduna State aspiring for political offices should submit their letters of resignation to the Secretary to the State Government before 31st March, 2022.\n“This is for your information and strict compliance, please.”"
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal is set to launch a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Sokowatch launches in Senegal and Côte d’Ivoire after $125m round",
    "summarized_story": "Sokowatch, an e-commerce company offering tech-enabled supply chain solutions to Africa’s informal retailers, on Wednesday said it has closed a $125 million Series B equity round at a valuation of $625 million, per TechCrunch.\nInitially launched in Kenya by founder and CEO Daniel Yu in 2015, Sokowatch scaled into neighboring East African markets Tanzania, Rwanda, and Uganda in 2018.\nThrough Wasoko’s platform, informal retailers are able to order products at any time via SMS or mobile app for free same-day delivery to their stores.\n“If you look at the past 10 years, both Senegal and Cote d’Ivoire have experienced solid year-on-year GDP growth,” the CEO said.\nThe new capital will enable Wasoko to drive further geographic expansion and product growth across the continent, according to the company."
  },
  {
    "headline": "How the Cameroon Angel Network invests in startups",
    "summarized_story": "Members of the group started attending startup pitches and investing informally, learning the ropes of angel investing along the way.\nAfter much back and forth over the span of 2 years, the government officials finally accepted that Cameroon Angel Network (CAN) was not a church and, in 2020, their registration was finalised.\nSince then the Cameroon Angel Network has continued to invest in startups and attract new members, mostly entrepreneurs.\n“We have a few other people running their businesses or making a living from Cameroon,” Nnmatak said, explaining the composition of the Cameroon Angel Network.\nDA: How does the Cameroon Angel network operate now?"
  },
  {
    "headline": "Meet the Nigerian filmmaker who is taking African art to Hollywood",
    "summarized_story": "But then, ArtDey, an African online art marketplace, offered to help him sell them, for prices ranging from ₦50,000 to ₦150,000.\nArtDey—co-founded in 2020 by Chioma Onyenwe, a 33-year-old filmmaker, and her siblings: Emeka Onyenwe and Adaobi Onyenwe—is an online marketplace that connects contemporary African artists to a global audience.\nOnyenwe, who has been collecting African art since 2015, went to collect art in an art market in Kenya in March 2020 but found she could afford only 1 of the 2 paintings she liked.\nThese markets were tourist attractions, but air travel restrictions, because of COVID, had shrunk their sale of art pieces.\nNigerians, she noticed, are not used to standard-sized measurements which are important to selecting art pieces’ sizes."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Did you miss Apple’s first event of the year?\nI did, but I saw a recap and the best way to describe my reaction is..."
  },
  {
    "headline": "On a real estate pre-seed, Jumia’s falling stocks, and regulatory competition",
    "summarized_story": "But sometimes, we have to ask, how much of Africa’s big picture narratives affect our everyday lives?\nThe big picture: A financing solution only addresses part of the problems mentioned above.\nFacebook’s parent company, Meta, could face prosecution from the South African Competition Commission for placing restrictions on the government-owned platform, GovChat.\nThe big picture: Like I pointed out earlier big tech companies might be expecting antitrust allegations every day of the week.\nRead more: Meta faces prosecution in South Africa for alleged antitrust breachInterested in diving deeper into this issue, especially as it relates to Africans?"
  },
  {
    "headline": "RavenBank Launches its Digital Banking Platform aimed at Making Banking Easy, Fast and Reliable",
    "summarized_story": "Share this article:RavenBank, a digital bank using technology to provide fast, safe, reliable and easy to use financial services to people from the comfort of their homes, officially launched its product on Wednesday, March 9, 2022.\nThe digital bank started with 5,000 users and has been in operations since March 2021.\nApart from providing fast banking services(bills payment, transfers, deposits), RavenBank also offers overdraft services for small businesses.\nRavenBank has sights on working with small businesses bank and making it easy for these businesses to access loans.\nRavenBank is a digital bank that uses technology to provide fast, safe, reliable and easy to use financial services for Africans from the comfort of their homes."
  },
  {
    "headline": "$105 million to Moove across emerging markets",
    "summarized_story": "These days, a typical week has at least one startup announcing over $100 million.\nWe’re discussing financial services for supply chain SMEs, vehicle financing by Moove, and salary-on-demand.\nLooking at Pivo, a startup founded by an all-female team, I would say she was right.\nYesterday, Monday, March 14, 2022, the startup announced that it had raised $105 million in a Series A2 round that brings the total funding raised by the company to $174.5 million.\nAlso, it intends to provide financing for a broader range of vehicles, including trucks, bikes, three-wheelers, and buses."
  },
  {
    "headline": "Nigeria’s economy unravels at worst time ahead elections",
    "summarized_story": "Aliko Dangote, chairman and chief executive of Dangote Group, Nigeria’s largest company, warned last week of an impending food scarcity by June as the adverse consequences of the Russian-Ukraine war shake Nigeria’s fragile economy.\nDiesel prices have nearly tripled since the start of the year, with manufacturers facing higher operational costs.\n“Manufacturers are closing shop on the back of the rising diesel prices which is biting really hard,” Onyebu said.\nThe regulator has struggled to fulfill its dollar obligations to portfolio investors since 2020 after oil prices collapsed.\nThe rally in oil prices, which should trigger increased dollar inflows, is not having the desired impact due to low oil production."
  },
  {
    "headline": "Nigeria’s economy unravels at worst time ahead elections",
    "summarized_story": "Aliko Dangote, chairman and chief executive of Dangote Group, Nigeria’s largest company, warned last week of an impending food scarcity by June as the adverse consequences of the Russian-Ukraine war shake Nigeria’s fragile economy.\nDiesel prices have nearly tripled since the start of the year, with manufacturers facing higher operational costs.\n“Manufacturers are closing shop on the back of the rising diesel prices which is biting really hard,” Onyebu said.\nThe regulator has struggled to fulfill its dollar obligations to portfolio investors since 2020 after oil prices collapsed.\nThe rally in oil prices, which should trigger increased dollar inflows, is not having the desired impact due to low oil production."
  },
  {
    "headline": "Trade deficit jumps 986% as imports hit N20.8trn",
    "summarized_story": "“The wider trade deficit in 2021 is reflective of twin pressures from exports and imports.\nOn the other hand, non-crude oil exports hit N4.49 trillion, 46 percent higher than N3.08 trillion in 2020.\nAs a result, import growth continues to outpace export growth significantly, resulting in further pressure on external conditions reflected in wider trade deficit,” he said.\nThe NBS shows that the country’s total foreign trade grew 58 percent to N39.8 trillion in 2021 from N25.2 trillion the previous year.\nIn the fourth quarter of 2021, the trade deficit narrowed to N1.99 billion from N312 billion in 2020."
  },
  {
    "headline": "Nigeria facing unprecedented budget shortfall, says EIU",
    "summarized_story": "The report said, “Nigeria is encountering a mini-crisis regarding petrol.\nNigeria’s state oil firm, NNPC Limited, raced to fill the gap, but Russia invaded Ukraine shortly after, exacerbating Nigeria’s fuel-supply crisis.\nRegulated petrol prices have become volatile too, reportedly rising unofficially to as high as N220/litre as fuel marketers impose varying premiums under the counter on the regulated price of N165/litre.\nRecent developments indicate renewed upward inflationary pressure in 2022, although increases will be limited by petrol prices staying anchored near the official price.\nIdeally, higher crude oil prices should boost the public purse.”"
  },
  {
    "headline": "Anti open grazing bill suffers setback in Edo assembly – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin city – The bill for a law to prohibit open grazing of cattle and regulate other livestock in the state on Tuesday suffered a major setback as lawmakers disagreed over clause 5(7) of the bill.\nIn the bill clause 5(7) stated that a ranch committee to be constituted by the state governor would be empowered to determine the size of land suitable for ranching.\nHe noted that the enormous powers allocated to the committee by the bill would lead to the acquisition of more arable land for ranching.\nHe explained that his local government had recently lost 80 percent of arable land to a private company.\nHe thereafter, proposed an amendment to the clause to the effect that one-tenth(1/10) of the total arable land mass of a community be acquired for ranching."
  },
  {
    "headline": "Obaseki: Biting economic hardship threatening fight against irregular migration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… Edo sets to launch Migration 2.0BENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Monday, expressed worry that the excruciating hardship resulting from the bad shape of the nation’s economy was threatening the government’s fight against human trafficking and illegal migration.\nThe governor hailed Action Aid and the European Union, among others, for partnering with his administration to checkmate and tackle the challenge of irregular migration.\nHe noted that the state has finalized plans to launch Edo Migration 2.0 to sustain gains recorded in the fight against the global menace.\nI don’t believe that our response should be the same as we did in Migration 1.0 as we may not be able to prevent irregular migration,” Obaseki added.\nThe governor continued: “Our strategy for Migration 2.0 is to work with destination countries and the federal government to look for pathways for regular migration."
  },
  {
    "headline": "ASUU extends strike by eight weeks – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Academic Staff Union of Universities (ASUU) has extended the ongoing industrial strike by eight weeks due to the inability of the Federal Government to satisfactorily address all the issues raised in the 2020 FGN/ASUU Memorandum of Action within the four-week warning strike.\nPresident of the union, Emmanuel Osodeke, made this statement known to the public, yesterday.\nThe statement reads, “NEC acknowledged the intervention efforts, in various ways, by patriots and friends of genuine national development (students, parents, journalists, trade union leaders, civil society activists etc.)\n“However, ASUU, as a union of intellectuals, has historic obligations to make governments honour agreements.\n“The roll-over strike shall commence by 12.O0 am on Monday, 14th March 2022.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Godbless, Nicholas shine in AFN AllComers athletics meet as Sabina reveals plans of Edo Sports Commission – Nigerian Observer",
    "summarized_story": "It was the first major track competition in Nigeria this season aimed at talents discovery which lasted between Saturday and Sunday in Benin.\nAlso speaking at the occasion, the Permanent Secretary, Edo State Sports Commission, Mrs Sabina Amiemenoghena Chikere said she was pleased with the performance of the athletes and the choice of Benin by AFN hosting the event.\nThat is one of our objectives here, to make Edo the sports hub, return sports activities to its prime place in Edo State.\n“There would be more competitions coming to Edo State and to be hosted by Edo State.\nEdo people should expect more sporting activities.” Sabina enthused."
  },
  {
    "headline": "Nigeria’s agric imports up 42% to N1.9trn",
    "summarized_story": "Nigeria’s agricultural imports surged by 42% to N1.97 trillion in 2021, up from N1.19 trillion recorded in 2020.\nThe recent figure also represents the highest amount on record spent on agricultural imports in any year, according to figures from the foreign trade report, released by the National Bureau of Statistics (NBS).\nMeanwhile, Nigeria earned N504.89 billion from agric export in 2021, which is 57% higher than N321.54 billion recorded in the previous year and 87% more than the N269.83 billion recorded in 2019.\nIn the year 2021, the sector recorded a 2.13% year-on-year growth in real terms, which is slower than the 2.17% growth printed in the year before.\nOver the years, several policies have been implemented in a bid to spur growth in the Nigerian agricultural sector."
  },
  {
    "headline": "Nigeria’s govt to use $2.2bn eurobond, borrow more to fund fuel subsidy",
    "summarized_story": "The federal government of Nigeria has said it will use $2.2 billion of the fund raised via eurobond to cater for petrol under-recovery costs.\nIn addition, the government said it would target more local borrowing in 2022 to fund subsidy payments.\nRecall that in September 2021, Nigeria raised $4 billion through eurobond issuance.\n“Rising oil prices have put us in a very precarious position, because we import refined products, and it means that our subsidy cost is increasing,” she said.\nAhmed said that the government was working with lawmakers to boost revenues and that the rise in oil prices means that borrowings will increase more than planned."
  },
  {
    "headline": "Akeredolu insists on restructuring, says states can’t continue to depend on handouts",
    "summarized_story": "Ondo State governor, Rotimi Akeredolu, has maintained that restructuring remained the only solution to the country’s developmental problems.\nThe governor argued that states and local governments could not continue to depend on handouts from the federal government to survive, as according to him, it is not sustainable.\nAkeredolu said the present federal system of government had been skewed had eroded the identities of the states of the federation.\n“The states of the federation cannot continue to depend on hand-outs from the Federal Government for even the payment of workers’ salaries.\nChief Olu Adeyemi, former Secretary-General of the Afenifere, among others, were some of the heroes of the state that were honoured."
  },
  {
    "headline": "APC pegs chairmanship forms at N20m ahead of national convention",
    "summarized_story": "The All Progressives Congress (APC), has pegged its chairmanship forms at N20 million ahead of its national convention billed for March 26.\nSimilarly, forms for deputy national chairman will sell for N10 million while zonal chairmen and other officers will pay N5 million to obtain nomination forms.\nThe APC revealed this in a circular made available on Tuesday after its 25th regular meeting which was held on March 14, 2022.\nFemale aspirants and people with disabilities will pay 50 per cent of all the aforementioned rates"
  },
  {
    "headline": "Firaministan Sin Ya Jaddada Muhimmancin Dorewar Bunkasar Tattalin Arzikin Kasa",
    "summarized_story": ""
  },
  {
    "headline": "Tsakanin Watannin Janairu Da Fabarairu Adadin Jarin Waje Da Sin Ta Yi Amfani Da Shi Ya Karu Da Kaso 37.9 Bisa Dari",
    "summarized_story": ""
  },
  {
    "headline": "Karuwar Jarin Waje A Kasar Sin Alama Ce Ta Imanin Da Kamfanonin Waje Ke Da Shi Kan Kasuwar Kasar Da Ci Gabanta",
    "summarized_story": "Karuwar Jarin Waje A Kasar Sin Alama Ce Ta Imanin Da Kamfanonin Waje Ke Da Shi Kan Kasuwar Kasar Da Ci GabantaBy CMG HausaWasu alkaluma da ma’aikatar kula da harkokin kasuwanci ta kasar Sin ta fitar, sun nuna yadda jarin waje da kasar Sin ta yi amfani da shi tsakanin watannin Janairu da Fabarairun bana ya karu da kaso 37.9 bisa dari, har ya kai kudin kasar yuan biliyan 243.7.\nWannan dai kyakkyawar alama ce dake nuna yadda kamfanonin kasashen waje ke kara imani da kasuwar kasar Sin.\nDuk da irin kalubale dake ci gaba da addabar duniya, kasuwar kasar Sin ta kasance mai kwari dake taimakawa kamfanonin kasashen waje.\nLamarin da zai kyautata huldar bangarori da dama da kasa da kasa har ma da habakar tattalin arzikin duniya, samar da gurben ayyukan yi da ma uwa uba wadata da zaman lafiya tsakanin al’umma.\nBugu da kari, karuwar yawan jarin, shaida ce cewa kamfanonin waje na jin dadin gudanar da harkokinsu a kasar Sin, kuma kasar da al’ummarta na maraba da su."
  },
  {
    "headline": "Dakunan Gwajin Kwayoyin Hallitu Da Amurka Ta Kafa A Kasashen Duniya Sun Haifar Da Babbar Illa Ga Tsaron Bil Adam",
    "summarized_story": ""
  },
  {
    "headline": "Kasar Sin Ta Kuduri Aniyar Sa Kaimi Don Ganin An Hanzarta Daidaita Halin Da Ake Ciki Tsakanin Rasha Da Ukraine",
    "summarized_story": ""
  },
  {
    "headline": "JUST IN: Hallmark Newspaper Publisher, Emeka Obasi, Is Dead",
    "summarized_story": "JUST IN: Hallmark Newspaper Publisher, Emeka Obasi, Is DeadPrince Emeka Obasi, publisher of Hallmark Newspaper, a business, policy and finance daily newspaper, is dead, THE WITNESS is reporting.\nAccording to the publication, Obasi, a veteran journalist and public relations expert, died on Wednesday March 16, 2022, after a protracted illness.\nHe was aged 58.\nThe Abia State-born award winning journalist and former Commissioner for Information, Abia State, had been battling a health challenge for the past eight years.\nHe is the founder and executive secretary of Public Policy Research and Analysis Centre (PPRAC), organisers of the Zik Prize in Leadership Award."
  },
  {
    "headline": "MIRACLE AND BREAKTHROUGHS AS NEXT LEVEL PRAYER CONFERENCE HITS IBADAN",
    "summarized_story": "As anticipated, several healing, marriage, financial testimonies and miracles were recorded at the just concluded Next Level Prayers Conference in Ibadan.\nAt the conference, Pastor Bolaji, the convener, ministered healings and made firm declarations in his usual prophetic fashion and indeed the testimonies came through.\nAmongst several testimonies recorded were the healings of decades of arthritis, partial blindness, deafness, inflamed knee caps and pains.\n“I thank God for my healing and Pastor Bolaji for doing God’s work.\nPastor Bolaji shared that the next train of the Next Level Prayer conference will be moving to Ghana in April."
  },
  {
    "headline": "Fire Guts EFCC’s Exhibit Storage Facility In Rivers",
    "summarized_story": "A fire has broken out inside the Economic and Financial Crimes Commission’s (EFCC) exhibit storage facility in Port Harcourt, Rivers State.\nThe event occurred in the early hours of Monday in the state capital’s Iriebi neighborhood.\nThe fire burned multiple trucks in the facility, according to a statement signed by EFCC’s Head of Media & Publicity, Wilson Uwajaren, on Tuesday.\n“The incident which occurred in the early hours of the day, affected most of the trucks parked in the facility before the fire was put out by men of the Federal Fire Service“Secretary to the Commission, Dr. George Ekpungu, who was at the scene of the incident on Tuesday March 15, assured that investigation had commenced to determine the cause of the inferno, while measures will be put in place to safeguard all exhibit dumps across the country,” it read.\nIn November 2018, there was also a fire incident at the Wuse 2 Zonal office of the EFCC."
  },
  {
    "headline": "2023: Jostle For VP Ticket Tears Northern Governors Apart",
    "summarized_story": "Jostle for the 2023 vice president ticket has sparked fresh crisis among northern governors in the All Progressives Congress (APC) as they are locked in a bitter battle for the slot.\nWith the South expected to produce the APC candidate for the 2023 presidential poll, the battlelines became drawn between North West and North East governors.\nThree North West governors, it was learnt, began to individually plot how to get the ticket.\nA senior APC chieftain, privy to the matter, detailed the genesis of the crisis among the APC governors.\n“Also, another cause of affront among the ranks of the northern governors is that two North East governors are being considered as vice president and the plan leaked to their North West counterparts."
  },
  {
    "headline": "Banditry: DPO, 6 officers, 5 others slain in Niger, Kebbi attacks",
    "summarized_story": "A gang of terrorists reportedly killed three police officers and four local vigilantes, including the Divisional Police Officer (DPO) of Nasko in Magama local government area of Niger state.\nPolice Public Relations Officer (PPRO) of the Niger state police command, DSP Wasiu Abiodun confirmed the incident in a statement in Minna Tuesday.\nHe said: “On 15/03/2022 at about 1300hrs, armed bandits/terrorists invaded Nasko village, Magama LGA of Niger State.\nKebbi tooAlso in Kebbi state, an unspecified number of terrorists in Danko/Wasagu local government area of Kebbi state, crossed over to Ngaski local government area of the state, killing four police officers and one civilian in the early hours of Tuesday.\nIn a remark, the Niger state Commissioner of Police, Mr. Monday Bawa Kuryas explained that, although the state was experiencing a lot of security challenges, security agencies had recently recorded success in the fight against banditry, terrorism and criminality."
  },
  {
    "headline": "Mustapha, Al-Makura, Musa first to pick N20m chairmanship form as Buni’s CECPC bounces back, APC kick starts convention activities",
    "summarized_story": "Further to that, Sani-Bello said he had the blessing of President Muhammadu Buhari to oversee the party’s affairs and conduct its national convention scheduled for March 26.\n“Meanwhile, the party has engaged a team of senior lawyers to address a purported court order halting the planned APC National Convention.\nMustapha, Al-Makura, Musa pick formAnd as a mark of his readiness for the convention, a frontline national chairmanship aspirant, Mallam Saliu Mustapha, Tuesday, picked up his nomination forms.\nSimilarly, it was gathered that the duo of Senator Mohammed Sani Musa and former Nasarawa state governor, Senator Umar Tanko Al-Makura, also picked the forms Tuesday.\nGanduje, who heads the protocol committee, said he had no fear about the March 26 date for the national convention."
  },
  {
    "headline": "Breaking: Atletico Madrid boot Manchester United out of UEFA Champions League",
    "summarized_story": "Champions League campaign ended in the disappointment of defeat by Atletico Madrid at Old Trafford to leave them with only a Premier League top-four place to fight for this season.\nHe saved brilliantly from Raphael Varane’s header in front of the Stretford End as United were left to fight for a place in next season’s Champions League in the final weeks of the domestic season.\nMan Utd lack class to make differenceManchester United went the same way as so many teams before them who have suffered at the hands of this remarkably durable Atletico machine assembled by Diego Simeone.\nLiverpool and Jurgen Klopp felt exactly the same after Atletico won at Anfield at this same stage two years ago and while La Liga’s champions may not be among the Champions League favourites, no-one will particularly relish being paired with them.\nThey have players who can provide class in attack and in Oblak they possess one of the world’s great goalkeepers."
  },
  {
    "headline": "Kogi govt berates ex-PGF DG over comments against Gov Bello, Buni -",
    "summarized_story": "Lukman, over his outbursts against the state governor and the Governor Mai Mala Buni APC Caretaker Extraordinary Convention Planning Committee (CECPC).\nLukman, over his outbursts against the state governor and the Governor Mai Mala Buni APC Caretaker Extraordinary Convention Planning Committee (CECPC).\nTo the amateur politician, the unfounded allegations against the administration of Governor Yahaya Bello should sway the minds of Nigerians or party leaders.\nGovernor Yahaya Bello has only refrained from dignifying detractors with response, venom for venom, because of his sound upbringing.\nCivil servants on Grade Level 1 to 6 received 100% salary with the 30,000 minimum wage."
  },
  {
    "headline": "Ondo govt honours Fasoranti, Arogbofa, other Illustrious citizens -",
    "summarized_story": "Ondo State Governor, Rotimi Akeredolu has honored a foremost Yoruba Leader, Reuben Fasoranti, and three others for their contributions to the creation of the state forty-six years ago.\nGovernor Akeredolu urged the present crop of leaders to continue to demand good governance,"
  },
  {
    "headline": "Ebonyi Assembly declares Seats of 3 Lawmakers Vacant after alleged resignation -",
    "summarized_story": "The Ebonyi House of Assembly has declared the seats of three of its members elected under the People Democratic Party (PDP) vacant.\nThe decision was taken following a letter of resignation purportedly written by the three lawmakers.\nThe three lawmakers are Ali Okechukwu (Ishielu North); Franca Okpo Abakaliki North) and Victor Aleke (Ebonyi West).\nFifteen All Progressive Party (APC) lawmakers however attended the sitting.\nSpeaker Francis Nwifuru read the letters on the floor of the House after which he declared the seats of the three lawmakers vacant."
  },
  {
    "headline": "APC national secretary, Akpanudoedehe resumes at party secretariat -",
    "summarized_story": "The National Secretary of the Caretaker Extra-Ordinary Convention Planning Committee of the All Progressives Congress, Senator John Akpanudoedehe, at the party’s secretariat in Abuja.\nThis puts to rest the attempt to change the leadership of the All Progressives Congress by aggrieved GovernorsAkpanudoedehe was given a rousing welcome by staff of the secretariat and officials of the party who were elated to receive him back in the office after what appears to be a very short holiday.\nMr Akpanudoedehe said contrary to widespread speculations that the Chairman, Secretary or some other officials of the CECPC had been removed from Office or otherwise replaced, all actions taken in his absence were clearly identified at all times as happening in an acting or proxy capacity, and under the auspices of the substantive Chairman, Governor Mai Mala Buni of Yobe State.\nHe also disclosed that the Chairman was on his way back to Nigeria after his medical trip and would resume Office on arrival with the full support of all members and other stakeholders"
  },
  {
    "headline": "UK Easing Covid Testing and Monitoring Despite Case Uptick",
    "summarized_story": "After dropping nearly all coronavirus restrictions last month, Britain is now ending some of its most widespread COVID-19 testing and monitoring programs, a move some scientists fear will complicate efforts to track the virus and detect worrisome new variants.\nOfficials have largely dismissed those concerns, despite a recent uptick in cases across Europe, insisting that high immunization rates will help dampen future waves of disease.\nBased on how quickly new variants have arisen, some experts suggest the next one could arrive as early as May.\nThey warn that U.K. authorities should be using the time to prepare, rather than winding down their pandemic defenses.\nMark Woolhouse, an epidemiologist at the University of Edinburgh, called it “an unfortunate pattern” that has been seen repeatedly throughout the outbreak."
  },
  {
    "headline": "AfDB Woos Investors with $58bn Bankable Projects in Africa",
    "summarized_story": "The African Development Bank (AfDB) is wooing investors that have appetite for high returns and social impacts with 42 bankable deals in Africa that have combined value of $58 billion.\nThere are several investment opportunities.\nIt is the Africa’s premier investment market where AfDB and its partners advance projects to bankable stages, raise capitals and accelerate deals to financial closure,” Adesina said.\nThe investment opportunities in Africa have not changed.\n“Africa remains the place to invest for investors looking to reap high returns and high social impacts."
  },
  {
    "headline": "Former VP Atiku Says He Didn’t Run Against His Principal Obasanjo in 2003 ‘to Sustain Zoning Policy’",
    "summarized_story": "Atiku also said the south had ruled Nigeria more times than the north since the country returned to democracy.\nThe former Vice President was probably referring to eight years each for former President Olusegun Obasanjo and President Muhammadu Buhari respectively; five years for former President Goodluck Jonathan and three years for late former president Umaru Musa Yar’Adua.\n“So, therefore, you cannot come and try to imply that the PDP has not been following the zoning policy.\nHis words: “When I joined the CAN, which my friend Bola set up, he gave me a set of condition for giving me the ticket; that I should make him vice president.\nI said no, I’m not going to make you Vice President, instead, I took Senator Ben Obi."
  },
  {
    "headline": "Russia Sanctions Joe Biden, Hillary Clinton, Other Top US Officials",
    "summarized_story": "Russia’s foreign ministry says Joe Biden, Antony Blinken, Jen Psaki, Hillary Clinton, and other officials are barred from entering the country.\nAs the war in Ukraine continues, Russia says it has sanctioned a number of currents and former American officials.\nThe list includes President Joe Biden, Secretary of State Antony Blinken, White House press secretary Jen Psaki, CIA director William Burns, and – oddly, since she’s out of office – former secretary of state Hillary Clinton.\nRussia’s Ministry of Foreign Affairs announced the sanctions on Twitter.\n“Russia has sanctioned Joe Biden and a range of other top US officials,” Max Seddon, the Moscow bureau chief of the Financial Times, explained mockingly on Twitter."
  },
  {
    "headline": "More Strikes Hit Kyiv as Zelensky Sounds Upbeat on Russia Talks",
    "summarized_story": "Several thick columns of black smoke were observed shortly after in the sky of the city, like the day before, where several Russian strikes hit residential buildings.\nThe Ukrainian city of Zaporozhye, south of Dnipro, was targeted by Russian forces on Wednesday morning, with a railway station damaged in the attack.\nBut Cavusoglu had indicated he would still like to facilitate a meeting between Ukrainian President Zelenskyy and Russian President Putin.\nKyiv believes that Russia illegally justified its invasion by falsely alleging genocide against Russian-speaking populations in the Ukrainian regions of Donetsk and Lugansk.\nIn addition the ministry says Ukrainian forces shot down a Russian helicopter, three tactical UAVs, and two “winged missiles.”The Ministry of Defence says its forces continued to launch strikes at Russian forces including air attacks on Russian convoys."
  }
]