[
  {
    "headline": "Court stops National Assembly members from fixing own salaries",
    "summarized_story": "The Federal High Court in Lagos has declared that the National Assembly Service Commission has no power to fix or determine the pay of members of the National Assembly.\nRather, the court, in a judgment on Friday by Justice Chuka Obiozor, held that the Revenue Mobilization, Allocation and Fiscal Commission should fix the pay of lawmakers to reflect the current economic realities in the country.\nThe statement quoted Justice Obiozor as declaring that, “The National Assembly Service Commission has no power whatsoever to fix and determine or allocate the remuneration, allowances, salaries, emoluments or monetary values to the members of the National Assembly.”The judge ordered the RMAFC to take up its duty of fixing the pay of the 109 senators and 360 members of the House of Representatives in the National Assembly.\nYet, the commission is statutorily required to review the pay of the lawmakers, in conformity with the country’s economic realities and to achieve fiscal efficiency.”Copyright PUNCH.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "2023: Muslims, Christians must unite, vote out bad leaders, says Tofa",
    "summarized_story": "Tofa said, “We have polluted ambitions; you know the ordinary Nigerians want to live their lives quietly and pursue their daily bread.\nIf the Muslims and Christians unite, then they can bring about change together.\n“We have to realise that our religions have taught us unity, peace and progress and as Nigerians, that should be our foremost priority.\nThe event was organised by the Supreme Council for Shariah in Nigeria, in collaboration with Jama’atu Nasril Islam and the Nigerian Supreme Council for Islamic Affairs.\nDuring the event, Associate Professor of Political Science and Public Administration, Dr Hakeem Baba-Ahmed, warned that the ongoing insecurity and bad governance would affect the existence of Nigeria."
  },
  {
    "headline": "NAICOM unveils strategic plans to boost public trust",
    "summarized_story": "The National Insurance Commission (NAICOM) has unveiled its 2021-2023 strategic plans for efficient service delivery, protection of trust, and confidence in the industry.\nThe theme of the 2021 seminar was ’NAICOM Corporate Strategic Plan 2021 to 2023: Goals, Objectives and Key Deliverables.’Jankara explained that the strategic plan was hinged on five goals including entrenching effective and efficient service delivery, ensuring safe, sound and stable insurance sector.\nAccording to him, the goals will consolidate the 2016 -2020 strategic plan with new milestones required to enable the commission accomplish its mission.\n“Our strategic plan has simplified what we will focus on and we are now more convinced that we will do much better this year.\n“We want to have a stable insurance industry to compete globally and contribute to the country’s economy,’’ he said."
  },
  {
    "headline": "Nairabox is driving digital future of Cinemas in Nigeria",
    "summarized_story": "Nairabox, one of Nigeria’s leading lifestyle and entertainment apps has been a driver for change in the cinema going culture in Nigeria since inception in 2016.\nThis unprecedented breakthrough in the cinema-going culture in the country shows the emergence of a new revolution in the cinema culture in Nigeria, thanks to digitization.\nIn a recent interview, the CEO, Tokunbo Adetona highlighted one of the brand’s reasons for launching Nigeria’s first cinema subscription.\nNairabox has helped to advance the cinema culture in Nigeria and solidified its position as the leading lifestyle app in the country.\nThe Nairabox app is currently available to download for free on the Google Playstore and coming soon this June to the IOS store."
  },
  {
    "headline": "FG directs Telcos to deactivate twitter by 12 midnight",
    "summarized_story": "By Prince OsuagwuThere indications that the federal government has directed all telecom operators in the country to deactivate twitter on their networks by 12 midnight.\nThis may not be unconnected with the decision of government to ban activities of twityer in the country following the deletion of President Muhammadu Buhari’s tweet, which the microblogging site deemed offensive.\nVanguard gathered authoritatively that bafter 12 midnight Friday, no twitter account of Nigerians will work within the country.\nDetails later…Vanguard News Nigeria"
  },
  {
    "headline": "Rep condemns murder of 300 level Unilorin student",
    "summarized_story": "Rep. Tunji Ajuloopin (Ekiti, Isin, Irepodun, Oke-Ero Constituency) of Kwara has condemned the rape and murder of a 300 level student of the University of Ilorin (Unilorin), Miss Olajide Blessing.\nAjuloopin in a statement on Friday in Omu-Aran described the death of the innocent student as unfortunate and dastardly.\nHe urged security operatives in the state to go every length to ensure the perpetrators of the evil act were brought to book.\nHe appealed to Nigerian youths, especially those in his constituency, to shun violence and avoid any association that could lead them to bad gangs.\nThe lawmaker condoled with the family, the good people of Oke-Opin community and the state in general over the loss."
  },
  {
    "headline": "Breaking: Telcos forced to deactivate twitter by 12 midnight",
    "summarized_story": "By Prince Osuagwu, Hi-Tech EditorThere are indications that federal government has directed all telecom operators in the country to deactivate twitter on their networks by 12 midnight.\nThis may not be unconnected with the decision of government to ban activities of twitter in the country following the deletion of President Muhammadu Buhari’s tweet, which the microblogging site deemed offensive.\nVanguard gathered authoritatively that after 12 midnight Friday, no twitter account of Nigerians will work within the country.\nDetails later…."
  },
  {
    "headline": "Twitter ban: Buhari govt trying to hide its atrocities",
    "summarized_story": "Human rights lawyer, Mike Ozekhome, has claimed the Federal Government is trying to cover its atrocities from the international community, with its decision to ban Twitter in Nigeria.\nOzekhome said this in a statement on Friday titled, ‘When A Tottering Government Twiddles Twitter’.\nThe Information Minister, Lai Mohammed, announced the ban on Friday.\n“Those in Government do not want the world to hear about their atrocities.\nSo, they just gleefully tell the world that they have suspended Twitter and that they would soon license other OTT and social media operations."
  },
  {
    "headline": "A disguised attempt to regulate social media",
    "summarized_story": "The Nigerian Bar Association (NBA) has slammed the federal government for suspending the operation of Twitter in Nigeria.\nThe legal body also threatened to challenge the decision in court.\nIn a series of tweet on Friday, the President of NBA, Olumide Akpata, noted that Nigeria is operating a democracy, which stipulates that every action of the government must be backed by the law.\n‘Recruitment into all govt offices in Nigeria free’ – FG warns job seekers against fraudstersAkpata said the directive to the Nigeria Communications Commission (NCC) to begin the process of licensing all OTT and social media operations in Nigeria, “is another disguised attempt to regulate social media, restrict freedom of speech and shrink civic space.”He added that the NBA “finds no constitutional or legal authority to support the peremptory action of the Federal Government to suspend the operations of Twitter in Nigeria.”Akpata called on the government to immediately reverse the decision, or the NBA will “have no choice but to challenge same in the interest of the public and for the sake of our democracy.”Danladi Umar displayed naked power – NBA probes CCT chairman"
  },
  {
    "headline": "Ahmed Mahmud is dead, Buhari reacts",
    "summarized_story": "Alhaji Ahmed Mahmud, the Galadiman of Ringim, is dead.\nReacting to the Prince’s demise, President Muhammadu Buhari condoled with Emir of Ringim, Alhaji Sayyadi Mahmud Ringim and the government and people of Jigawa State.\nIn a statement signed by Garba Shehu, Buhari noted that Ahmed until his death, was the most senior prince and a District Head in Ringim Emirate.\nPresident Buhari prayed to Almighty Allah to accept his good deeds and grant family and friends fortitude to bear the loss.\nBuhari mourns close ally, Mahmud Tukur"
  },
  {
    "headline": "Amnesty International calls for immediate reversal of ban on Twitter in Nigeria",
    "summarized_story": "Amnesty International has strongly condemned the federal government’s decision to suspend Twitter operations in Nigeria.\nIn a statement on Friday night, Amnesty International said it condemned the federal government’s suspension on a social media widely used by Nigerians to exercise their human rights and have access to information.\nThe group further directed the Nigerian authorities to immediately reverse the unlawful suspension and suspend other plans to gag the media and undermine Nigerians’ human rights.\n“Amnesty International condemns the Nigerian government’s suspension of Twitter in Nigeria — a social media widely used by Nigerians to exercise their human rights including their rights to freedom of expression and access to information.\n“We call on the Nigerian authorities to immediately reverse the unlawful suspension and other plans to gag the media, repress the civic space, and undermine Nigerians’ human rights."
  },
  {
    "headline": "Osun govt warns Ife Iron and Steel melting factory over illicit practice",
    "summarized_story": "The Osun State Government has directed the management of Ife Iron and Steel Melting Factory to embark on immediate corrective measures of all observed anomalies arising from unfriendly environmental practices that could put the health of the people in jeopardy.\nSola Oladepo and the Director-General, Bureau of Social Services (BOSS) Richard Tinubu, separately gave the warnings when paid an unscheduled visit to the company in Ile Ife.\nTinubu, therefore, emphasized the need for the company to carry out the government’s directive on all observed anomalies, warning that failure to do so would attract necessary disciplinary measures.\nThe Director-General of BOSS, meanwhile, directed the company to submit its corrective plans to the state government with immediate effects for effective monitoring and enforcement.\nBuhari’s war threat: Femi Adesina under fire for saying Nigerians need iron fist"
  },
  {
    "headline": "Movie producers must be in association to practice NFVCB",
    "summarized_story": "By Gbenga BadaThe National Film and Video Censor Board (NFVCB), Abuja, has said that all film producers in Nigeria must register with a government recognised association in the industry to ply their trade.\n“Now it is mandatory for all of us to belong to an association, recognised by NFVCB.\nADVERTISEMENTThe Executive Director, NFVCB, Thomas Adedayo, made this known in Asaba, Delta during a workshop organised by members of the Association of Movie Producers (AMP), Nigeria.\nHe stressed that practitioners had to belong to an association to practice, adding that with that they could get government approval to practice.\n“The going forward will be better, the NFVCB has decided to make the film industry a professional industry and there is the need to identify the professionals in the industry through your associations and guild,” he said."
  },
  {
    "headline": "Anger as Buhari suspends Twitter operations in Nigeria",
    "summarized_story": "Mohammed in a statement through his Special Assistant Segun Adeyemi said the federal government has “suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria”.\nIt described the Twitter suspension as unwarranted, draconian and a slide towards a fascist regime in our country.\nUsing Twitter platform to announce Twitter suspension.\nMe I’m in UAR sha, so Twitter in Nigeria suspension no concern me.”SERAP “BREAKING: We’re suing Nigerian authorities over their ILLEGAL indefinite suspension of Twitter in Nigeria.\n“The NBA finds no constitutional or legal authority to support the peremptory action of the Federal Government to suspend the operations of Twitter in Nigeria."
  },
  {
    "headline": "Twitter ban difficult to enforce in Nigeria, say ICT experts",
    "summarized_story": "By Ibrahim Apekhade YusufDoes Nigeria have what it takes to enforce Federal Government’s ‘indefinite suspension’ of Twitter?\nBut the immediate past President of ATCON, Olusola Teniola, said: “From the look of things, it is very clear that the government is trying to regulate the internet and social media.\n“Even though the government is desirous of banning the activities ofADVERTISEMENTTwitter, it is powerless in this instance because there are several ways to access Twitter.\n“I think the government decision would be weakened by the fact there are several other ways to bypass the ban and easily access their (Twitter) service.\nTwitter didn’t force the government to access its services and cannot expect preferential treatment from the social media platform."
  },
  {
    "headline": "Lil Bow Wow's validation excites Biy Martins",
    "summarized_story": "By Sam AnokamUS-BASED rapper, Martins Ossai aka Biy Martins believes that global recognition can boost the career of a rising African singer.\nThis comes on the heels of Lil Bow Wow reposting the poster of Biy Martins’ new EP, ‘FMW’ on his Instagram page.\nFollowing this gesture, Biy Martins expressed excitement and gratitude to Bow Wow’s action saying it remains a source of inspiration for him.\nThat means you’re doing something great, it’s an inspiration for me and these are the things that keep me going,” the singer said.\nBiy Martins said his dream is to become one of the biggest singers to come out of Africa."
  },
  {
    "headline": "NDDC: Pressure mounts on Tompolo, as Ateke, others back demand for board",
    "summarized_story": "Tompolo broke his silence after a long withdrawal from the public, when he, in a letter addressed to President Buhari demanded the constitution of the NDDC board within seven days.\nHe kicked against the continued use of a sole administrator to run the affairs of the NDDC, noting that the action would likely set the Niger Delta region on fire.\nHe was said to have arrived Warri on Thursday and proceeded to Oporoza where he engaged Tompolo’s representative in discussion over the NDDC matter, pleading for understanding.\nSources said Tompolo insisted on the constitution of the board which can continue with the forensic audit of the Commisison.\nIn a related development, King Michael Ateke Tom, the Amayanabo of Okochiri Kingdom in Rivers State has thrown his weight behind Tompolo."
  },
  {
    "headline": "Outrage as FG suspends Twitter’s operations in Nigeria",
    "summarized_story": "The Minister further said the Federal Government has also directed the National Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in Nigeria.\nUsing Twitter platform to announce Twitter suspension.\n“ o, why should they ban Nigerians from using Twitter simply because twitter deleted the post of the president?\nMy assumption is that such actions are taken when a user’s post is deemed to be against the social media platform’s community guidelines and terms.\nThe global response to posts and tweets is a sign of the power of social media platforms."
  },
  {
    "headline": "After Twitter, Facebook deletes Buhari’s ‘civil war’ post",
    "summarized_story": "By Chinenye AnuforoFacebook on Friday deleted President Muhammadu Buhari’s civil war post on its platform stating it violates its community standards rules.\nIn the post shared Tuesday on Facebook, Buhari spoke about the civil war experience and threatened to deal with those “bent on destroying” Nigeria through “insurrection.”Buhari, who served in the army stated, that many people misbehaving today were too young to remember the deaths and destruction from the civil war.\nBut, a quick check on Friday showed that Facebook removed the post from its platform.\nThe social media giants reiterated its commitment to remove any content, from individuals or organisations that violates Facebook policies.\n“In line with our global policies, we’ve removed a post from President Buhari’s Facebook page for violating our Community Standards against inciting violence."
  },
  {
    "headline": "10 feared killed, cattle roasted, vehicles destroyed in Anambra ghastly accident",
    "summarized_story": "From Obinna Odogwu, AwkaTragedy struck in Awka, the Anambra State capital on Friday when a truck loaded with cattle lost its brakes and crashed at Kwata Flyover, killing many people and roasting many cattle.\nAccording to eyewitnesses, the truck lost its brakes while descending the hilly Aroma Junction on the Enugu – Onitsha Expressway.\n“Two male adults lost their lives in a multiple fatal crash at about 1428hrs this afternoon near Kwata Bridge opposite the Ministry of Agriculture, Anambra State.\n“It involves a red Man Diesel truck with registration number JJN 59 YZ, a green Honda CRV without enlistment number, a Red M/Benz 4matic with registration number ABJ 115 DA, a black Toyota Highlander with registration number AWKA 226 HM and an Ash Lexus SUV with registration number KJA 136 FD.\n“Eyewitness report reaching us indicates that the crash which was as a result of brake failure involved a total of 12 people, 11 Male adults and one female adult ."
  },
  {
    "headline": "Uzodinma dissolves expanded Exco of SA, SSAs",
    "summarized_story": "From Stanley Uzoaru, OwerriGovernor Hope Uzodinma of Imo State has dissolved the expanded State Executive Council comprising Senior Special Assistants (SSAs) and Special Advisers(SAs) .\nRecalled that the governor few weeks ago sacked 20 of his commissioners retaining the State Commissioner for Information and Strategy, Declan Emelumba.\nThe sacked aides were directed to return their official vehicles within one week.\nConfirming the report, Emelumba told our correspondent that the governor embarked on the exercise in other to prune down and reduce expenses in running the government ."
  },
  {
    "headline": "Breaking: FG Suspends Twitter’s Operations in Nigeria",
    "summarized_story": "By Olawale AjimotokanThe Federal Government has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria.\nThe suspension was announced on Friday by the Minister of Information and Culture, Alhaji Lai Mohammed, via a statement issued in Abuja.\nThe minister cited the persistent use of the Twitter platform for activities that were capable of undermining Nigeria’s corporate existence.\nMohammed stated that the Federal Government had also directed the National Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in Nigeria.\nTwitter had Wednesday deleted President Muhammadu Buhari’s tweet posted Tuesday where he threatened to deal with secessionists “in the language they understand”."
  },
  {
    "headline": "Obasanjo: Bad Leadership Has Turned Nigeria to Land of Bitterness, Sadness",
    "summarized_story": "But despite the worsening insecurity, the federal government has said it is preposterous for anyone to declare Nigeria a failed state on the basis of the country’s security challenges.\n“Right now, it is a land flowing with bitterness and sadness; that is not what God wants this country to be.\nInsecurity Does Not Make Nigeria Failed State, Insists FGMeanwhile, the federal government has said it is preposterous for anyone to declare Nigeria a failed state due to the country’s security challenges.\n“Nigeria’s worldwide companions, particularly the USA, should acknowledge that Nigeria is now a failed state.\n“Declaring any nation a failed state is not done at the whims and caprices of one or two persons, no matter their status."
  },
  {
    "headline": "DHQ Allays Fear of Mass Retirement",
    "summarized_story": "By Kingsley NwezehThe Defence Headquarters (DHQ) yesterday allayed concerns about possible mass retirement of top military officers superior to the Chief of Army, Maj. Gen. Farouk Yahaya.\nGen.Bernard Onyeuko, said the military was not contemplating any retirement and had, in fact, not retired any general.\nHe said the operations were the combined efforts of the military and other security agencies involving land, maritime and air operations.\nHe said there were also extensive air operations, which included air patrols, intelligence surveillance and reconnaissance missions, offensive air strikes, air interdictions, search and rescue operations, and close air support for ground troops.\nHe added: “They rescued kidnapped victims, neutralised scores of terrorists, destroyed terrorists’ enclaves, arrested terrorists and intercepted terrorists’ logistics items, including vehicles."
  },
  {
    "headline": "FG Protests Deletion of Tweet, Says Twitter Can’t Gag Buhari",
    "summarized_story": "The accusation followed the decision of Twitter to delete a controversial post by Buhari on the Nigerian civil war.\nThe same Twitter during the ENDSARS protests promoted tweets trying to raise funds for the ENDSARS protesters.\nIf Mr. President, anywhere in the world feels very bad and concerned about a situation, he is free to express such views.\nBy whatever name, you can’t justify giving orders to kill policemen or to kill anybody you do not agree with.\nHe said: “There are so many people who have been spewing hate against Mr. President, against this governments."
  },
  {
    "headline": "Ezeife: South-east Violence, Plot to Undermine Clamour for Igbo Presidency",
    "summarized_story": "Ezeife described the insurrection in the South-east as an attempt to provoke indigenes of the South-east.\n“Now we know that more than 80 per cent of the people caught by the CCTV are not from the South-east.\nHe stated that a South-east governor who had earlier accused IPOB and ESN of executing the attacks had since exonerated the secessionist group.\nDuring the ENDSARS protests, people attributed what was happening in Lagos to some Igbo people and it was later discovered to be untrue.\nThe guild thanked Ganduje and members of the state Executive Council for providing the enabling environment for the national convention to hold."
  },
  {
    "headline": "BREAKING: Buhari Hits Back At Twitter, Suspends Its Operations Indefinitely In Nigeria",
    "summarized_story": "The Nigerian Government has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria.\nThe development comes after Twitter deleted President Muhammadu Buhari’s tweet where he threatened to treat Nigerians “misbehaving” in “the language they understand”.\nBuhari had in a tweet on Tuesday stated that his government will get “harder” on those hell-bent on destroying the country.\nTrump's Twitter account was \"permanently suspended... due to the risk of further incitement of violence,\" Twitter had said.\nThe platform said the message by the Nigerian President violated its rules."
  },
  {
    "headline": "BREAKING: Buhari Hits Back At Twitter, Suspends Its Operations Indefinitely In Nigeria",
    "summarized_story": "The Nigerian Government has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria.\nThe development comes after Twitter deleted President Muhammadu Buhari’s tweet where he threatened to treat Nigerians “misbehaving” in “the language they understand”.\nBuhari had in a tweet on Tuesday stated that his government will get “harder” on those hell-bent on destroying the country.\nTrump's Twitter account was \"permanently suspended... due to the risk of further incitement of violence,\" Twitter had said.\nThe platform said the message by the Nigerian President violated its rules."
  },
  {
    "headline": "Governor Abiodun’s Suspended Aide, Rufai, Caught In $350,000 Fraud May Escape To Nigeria If Granted Bail – US Attorney",
    "summarized_story": "The suspended Senior Special Assistant to the Ogun State Governor Dapo Abiodun, Mr Abidemi Rufai, caught in $350,000 wire fraud, may forfeit his bail as the United State authorities said he would escape to Nigeria if granted bail and his extradition would be difficult.\nThe Acting US Attorney, Tessa Gorma, stated this while asking a district judge to reverse a bail earlier granted to Rufai by a magistrate judge.\nDespite his alleged involvement in $350,000 fraud, Rufai said through his lawyer that he was a man of integrity.\nSaharaReporters had on May 18 reported that Rufai faces up to 30 years in prison if he is convicted of wire fraud.\nOgun State governor, in his reaction, described the arrest as disturbing news and ordered the immediate suspension of Rufai."
  },
  {
    "headline": "Governor Abiodun’s Suspended Aide, Rufai, Caught In $350,000 Fraud May Escape To Nigeria If Granted Bail – US Attorney",
    "summarized_story": "The suspended Senior Special Assistant to the Ogun State Governor Dapo Abiodun, Mr Abidemi Rufai, caught in $350,000 wire fraud, may forfeit his bail as the United State authorities said he would escape to Nigeria if granted bail and his extradition would be difficult.\nThe Acting US Attorney, Tessa Gorma, stated this while asking a district judge to reverse a bail earlier granted to Rufai by a magistrate judge.\nDespite his alleged involvement in $350,000 fraud, Rufai said through his lawyer that he was a man of integrity.\nSaharaReporters had on May 18 reported that Rufai faces up to 30 years in prison if he is convicted of wire fraud.\nOgun State governor, in his reaction, described the arrest as disturbing news and ordered the immediate suspension of Rufai."
  },
  {
    "headline": "Governor Abiodun’s Suspended Aide, Rufai, Caught In $350,000 Fraud May Escape To Nigeria If Granted Bail – US Attorney",
    "summarized_story": "The suspended Senior Special Assistant to the Ogun State Governor Dapo Abiodun, Mr Abidemi Rufai, caught in $350,000 wire fraud, may forfeit his bail as the United State authorities said he would escape to Nigeria if granted bail and his extradition would be difficult.\nThe Acting US Attorney, Tessa Gorma, stated this while asking a district judge to reverse a bail earlier granted to Rufai by a magistrate judge.\nDespite his alleged involvement in $350,000 fraud, Rufai said through his lawyer that he was a man of integrity.\nSaharaReporters had on May 18 reported that Rufai faces up to 30 years in prison if he is convicted of wire fraud.\nOgun State governor, in his reaction, described the arrest as disturbing news and ordered the immediate suspension of Rufai."
  },
  {
    "headline": "TIPS: How to bypass Nigeria’s suspension on Twitter",
    "summarized_story": "AdvertisementHere’s the good news: despite the government’s suspension, you can still use the platform.\nTheCable Lifestyle examines how you can bypass the government’s suspension of Twitter.\nAlso, with the government’s suspension, you can still access Twitter from a Nigerian IP because VPN hides your address.\nThere are paid VPNs and there free ones that can guarantee you seamless usage of Twitter in Nigeria notwithstanding the government’s suspension.\nThe free VPNs that can be used for Twitter include: ProtonVPN, Hotspot Shield Free VPN, Windscribe free, TunnelBear, Speedify and Hide.me."
  },
  {
    "headline": "TIPS: How to bypass Nigeria’s suspension on Twitter",
    "summarized_story": "AdvertisementHere’s the good news: despite the government’s suspension, you can still use the platform.\nTheCable Lifestyle examines how you can bypass the government’s suspension of Twitter.\nAlso, with the government’s suspension, you can still access Twitter from a Nigerian IP because VPN hides your address.\nThere are paid VPNs and there free ones that can guarantee you seamless usage of Twitter in Nigeria notwithstanding the government’s suspension.\nThe free VPNs that can be used for Twitter include: ProtonVPN, Hotspot Shield Free VPN, Windscribe free, TunnelBear, Speedify and Hide.me."
  },
  {
    "headline": "North Korea, Iran... Nigeria joins list of countries where Twitter has been suspended",
    "summarized_story": "On Friday, the federal government announced an indefinite suspension of the operations of Twitter, the microblogging and social networking service, in Nigeria.\nAdvertisementIn the past, countries including China, Iran, North Korea have also banned or temporarily suspended Twitter.\nNorth KoreaNorth Korea permanently blocked Twitter, alongside YouTube and Facebook, in 2016 in a bid to control the spread of information online.\nEgyptAdvertisementTwitter was temporarily suspended in Egypt in 2011 amidst rising protests against ex-President Hosni Mubarak’s 30-year rule.\nTurkeyPrime Minister Tayyip Erdogan banned Twitter temporarily in 2014 after incriminating audio recordings of alleged corruption inside his government popped up on the microblogging site."
  },
  {
    "headline": "North Korea, Iran... Nigeria joins list of countries where Twitter has been suspended",
    "summarized_story": "On Friday, the federal government announced an indefinite suspension of the operations of Twitter, the microblogging and social networking service, in Nigeria.\nAdvertisementIn the past, countries including China, Iran, North Korea have also banned or temporarily suspended Twitter.\nNorth KoreaNorth Korea permanently blocked Twitter, alongside YouTube and Facebook, in 2016 in a bid to control the spread of information online.\nEgyptAdvertisementTwitter was temporarily suspended in Egypt in 2011 amidst rising protests against ex-President Hosni Mubarak’s 30-year rule.\nTurkeyPrime Minister Tayyip Erdogan banned Twitter temporarily in 2014 after incriminating audio recordings of alleged corruption inside his government popped up on the microblogging site."
  },
  {
    "headline": "How Twitter suspension may affect Nigeria's fragile economic growth",
    "summarized_story": "On Friday, the federal government announced the suspension of Twitter, the microblogging and social network service, in Nigeria.\nWith this ban, Nigeria joins the list of countries such as China, Iran, North Korea that have restricted the use of the platform.\nThe suspension will affect online news platforms that leverage Twitter to extend their reach and bring news closer to the people.\nThe suspension of Twitter will halt their sources of income and also affect the reach of these brands.\nThe knock-on effect of the policy was seen in the Q1 growth for the sector."
  },
  {
    "headline": "Twitter is ‘deeply concerned’ by Nigerian government’s suspension",
    "summarized_story": "Twitter has reacted to the indefinite suspension of the social media site by the Nigerian government, expressing concern.\nA statement by a Twitter spokesperson to TechCabal said:“The announcement made by the Nigerian Government that they have suspended Twitter’s operations in Nigeria is deeply concerning.\nIt started when Twitter deleted a tweet by President Muhammadu Buhari for violating its rules.\nIn the end, he justified his suspension of Twitter on the grounds of “persistent use of the platform for activities that are capable of undermining Nigeria’s corporate existence.”The suspension brings Twitter squarely into the heat of the debate about the intersection of democracy and internet freedom in Africa.\nIt remains to be seen when the suspension takes effect and what actions Twitter takes."
  },
  {
    "headline": "Nigeria suspends Twitter indefinitely",
    "summarized_story": "The Federal Government has indefinitely suspended the operations of Twitter in Nigeria.\nIt was widely criticised as summoning the ghosts of the Nigeria civil war, a deadly three-year combat between the Nigerian government and a government in southeast Nigeria, which had seceded from the republic.\nImplications of the Twitter BanThe indefinite suspension of Twitter would mean that Internet Service Providers (ISP) in Nigeria like MTN and Airtel will be mandated to not give users access to Twitter.\nThe ISPs will block twitter’s IP addresses from all its users, or delete the sites from their DNS servers.\nIt remains to be seen whether the ISPs will implement such an order and how they will communicate it to their users."
  },
  {
    "headline": "Unicorn Group launches Lagos Campus with plans to create more African Unicorns",
    "summarized_story": "The wife of the Lagos state governor, Joke Sanwo-Olu at the eventOn the 2nd of June, 2021 Unicorn Group held an event for the official launch of its Lagos campus.\nTimipre Sylva Minister of State for Petroleum Resources; Lagos state governor Babajide Sanwo-Olu represented by his wife Joke Sanwo-Olu; Engr Simbi Wabote Exec.\nA group picture of the invited dignitariesUnicorn Group’s ecosystem approachAt this event, the Unicorn Group shared its multifaceted approach to creating more unicorns in Africa.\nPonmile Osibo, Chief investor relations officer told TechCabal, that for the Unicorn Group, it’s beyond investing just money.\nThe bigger picture for the Unicorn Group is the impact it’ll have on the economy."
  },
  {
    "headline": "5 Reasons Why You Should Consider A Loan from Page Financials",
    "summarized_story": "If you are still thinking about whether or not to consider a personal loan, we have highlighted 5 reasons why customers usually resort to getting a personal loan.\nDebt ConsolidationOne of the popular reasons to get a personal loan from Page is for debt consolidation.\nWhat To Consider When Considering A Personal LoanApplying for a Page Loan is super easy, everything happens online and you don’t need to visit their office.\nConsider avoiding a personal loan if:You can’t afford it.\nIf you can’t afford monthly payments for your new personal loan, consider skipping it."
  },
  {
    "headline": "2021 Kickstart: International Breweries Calls for Application from Young Entrepreneurs",
    "summarized_story": "The application portal for young entrepreneurs between 18 and 35 years old to apply to the highly anticipated 6th Edition of International Breweries Plc’s Kickstart Initiative is now open.\nAbout International Breweries Plc.\nInternational Breweries Plc (IBPLC), is a proud part of the world’s largest brewer, Anheuser-Busch InBev, (AB InBev), the world’s largest brewer with over 400 beer brands.\nInternational Breweries was established in 1971 and was listed on The Nigerian Stock Exchange in 1995.\nAB InBev consolidated its business stakes in Pabod Breweries Limited, Intafact Beverages Limited into its majority ownership of International Breweries Plc in a merger that was concluded in December 2017."
  },
  {
    "headline": "Nigeria’s Twitter ban puts country in uncomfortable company",
    "summarized_story": "The Nigerian government’s ban of Twitter for deleting a tweet by President Muhammadu Buhari, which it deemed to have violated the rules guiding the use of the platform, puts Nigeria on the list of nations that are at odds with social media platforms and their citizens’ use of them.\nThe action also has implications for…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Green Africa attempts ‘Southwest effect’ on air travel in Nigeria",
    "summarized_story": "Its first flight is days away yet Green Africa, the Lagos-based startup budget airline, is edging closer to disrupting the Nigerian airspace forever.\nDespite the similarity in low fares, differences such as fleet and routes make Green Africa different from Southwest.\nGreen Africa will use ATR72-600S jetliners, a turboprop, while Southwest operates Boeing 737 jet planes.\nFor now, Green Africa will fly to seven domestic destinations from Lagos, including Akure, Ilorin, Abuja, Owerri, Port Harcourt and Enugu.\nAlthough Green Africa only covers seven domestic destinations for now its promise to charge airfare as low as 16,500, makes air travel attractive for more Nigerians."
  },
  {
    "headline": "Will Nigeria learn its lessons asks Bloomberg",
    "summarized_story": "For more than four decades, Nigeria ran its state refineries into the ground, putting the country in the unusual position of being one of the world’s biggest oil exporters and a major gasoline importer.\nNow that private investors, most significantly Aliko Dangote — Africa’s richest man — are rushing to open their own plants, the state has stepped in again.\nThe Nigerian National Petroleum Corp. wants stakes in at least six planned refineries, including Dangote’s monster 650,000 barrels-per-day plant.\nNigeria’s partly private fuel-import system had long been riddled with patronage and corruption.\nWhile the NNPC says it wants to turn Nigeria into a fuel-products exporter, it hasn’t demonstrated the capability to do so."
  },
  {
    "headline": "We’ll enact laws to improve economy – Obaseki – Nigerian Observer",
    "summarized_story": "Godwin Obaseki of Edo has expressed his administration’s readiness to enact laws and strengthen existing ones to improve the state’s economy.\nObaseki said this while addressing participants at the Edo State Transition Committee’s engagement with artisans on Friday in Benin.\nObaseki assured the artisans that his administration was open and accountable to the people of the state including tax payers.\nHe said his government had been working to eliminate cash payment for tax across the state to minimise corruption.\n“We are simplifying the tax system in the state to encourage more people to key into the tax system."
  },
  {
    "headline": "FG suspends Twitter’s operations in Nigeria – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Federal Government has suspended indefinitely, the operations of the microblogging and social networking service, Twitter in Nigeria.\nThe Minister of Information and Culture, Alhaji Lai Mohammed, announced the suspension in a statement in Abuja on Friday.\nThe minister cited the persistent use of the platform for activities capable of undermining Nigeria’s corporate existence.\nHe said the Federal Government had also directed the National Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in the country.\nThe statement was released by Mr Segun Adeyemi, Special Assistant to the President (Media), office of the Minister."
  },
  {
    "headline": "World Environment Day: Obaseki reiterates commitment to restoring forest reserves – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has reiterated his administration’s commitment to collaborate with environmentalists, community leaders and other stakeholders to restore forest reserves in the state.\nObaseki made the call in commemoration of the World Environment Day, marked on June 5 each year, by the United Nations and its partners.\nGlobal greenhouse gas emissions have grown for three consecutive years and the planet is one pace for potentially catastrophic climate change.\n“The emergence of COVID-19 has also shown just how disastrous the consequences of ecosystem loss can be.\nBy shrinking the area of natural habitat for animals, we have created ideal conditions for pathogens – including coronaviruses – to spread.”..."
  },
  {
    "headline": "Legislate on child protection, JDPCI urges lawmakers – Nigerian Observer",
    "summarized_story": "Speaking on the the theme of the 2021 Child Protection Day, “The Role of Parents and Caregivers in the Protection of Children, the Coordinator of the Edo State Child Protection Network, Barr.\nHe listed the types of Child Abuse to include Physical, Emotional and Sexual Abuses, asserting that abusing a child constituted the worst thing anybody could do to a child.\nWhen you protect children, you are not doing them a favour.\nIt is the duty of everyone to protect children because we are all stakeholders.\n“Not putting a child in school is another form of child abuse."
  },
  {
    "headline": "Gbajabiamila meets Canadian diplomats on deepening ties",
    "summarized_story": "ADVERTISEMENTThe Speaker of the House of Representatives, Femi Gbajabiamila, has called for stronger ties between Nigeria and Canada.\nHe made this known while hosting the Canadian High Commissioner to Nigeria, Nicolas Simard, in his office on Friday.\nMr Gbajabiamila, in a statement by his media aide, Lanre Lasisi, said the 9th House had prioritised certain issues, not only for the development of the country but also in conformity with global demands.\nOn the diplomatic ties between the two countries, Mr Gbajabiamila said “It is important that we sustain and continue these engagements to the benefit of our countries.\nThe diplomat congratulated Nigeria on the adoption of the Violence Against Persons (Prohibition) Act and its domestication by several states."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "NAFDAC, Global Alliance for Trade partner to enhance ease of doing business in Nigeria",
    "summarized_story": "The project is being powered by the Global Alliance for Trade Facilitation.\nShe said NAFDACs focus now is to ensure smooth trade facilitation and regulation, stressing that operations of regulators should not pose an hinderance to trade transactions but facilitate them.\n‘We are also working clearly on defining export data, documents and processes for the Nigeria Customs service, and other partner agencies.\n‘’In February we realized a memorandum of understanding with the Nigeria Customs as a lead agency for border operations in Nigeria.\nLast month we had an executive master class for the management of the Nigeria Customs Service on trade facilitation agreement issues in Nigeria’’."
  },
  {
    "headline": "Buhari quiet when Benue is attacked but evokes civil war memories when Igbo are involved —Soyinka",
    "summarized_story": "Nobel Laureate, Prof. Wole Soyinka, has said Nigeria’s President, Muhammadu Buhari keeps quiet when herdsmen attack people in Benue State but is quick to evoke memories of the civil war whenever the Igbo people of South East are involved.\n“What a pity, and what a tragic setting, to discover that this language was accessible all the time to President Buhari, where and when it truly mattered, when it would have been not only appropriate, but deserved and mandatory!\nHe said Buhari only later asked security agents to shoot criminals on sight after much pressure, a move which he said was belated.\nSoyinka argued that the world had moved on from the civil war and wondered why Buhari still spoke of it with nostalgia.\n“The evocation of the civil war, where millions of civilians perished, is an unworthy emotive ploy that has run its course."
  },
  {
    "headline": "Dangote fertiliser to flood Nigerian market on Monday",
    "summarized_story": "The Dangote Group has said products from its $2 billion granulated urea fertiliser plant will be available in the market on Monday.\nChairman of Dangote Group and Africa’s richest person, Alhaji Aliko Dangote, told NAN on Friday that the plant has been certified and licensed by all regulatory authorities in Nigeria.\nThe fertiliser plant, located at Ibeju Lekki, Lagos, has a name-plate annual capacity of three million tons of urea and ammonia.\n“By the time we add what we have to the existing capacity from Indorama which is about 1.5 million metric tonnes and Notore, maybe about 300 metric tonnes, we will be having close to about five metric tonnes capacity of urea,” he said.\n“Today we saw urea produced , we saw it bagged and we saw it loaded on buses, and by Monday it would be in our markets."
  },
  {
    "headline": "Outrage trails Nigerian govt’s Twitter ban",
    "summarized_story": "Akpata in the statement asked that the ban be reversed, failure of which the NBA would take legal action against the government.\n“The @NigBarAssoc finds no constitutional or legal authority to support the peremptory action of the Federal Government to suspend the operations of Twitter in Nigeria.\n“@NigeriaGov, we’ll see you in court.”Nigeria’s Federal Government had suspended the operations of Twitter in Nigeria indefinitely.\n“The Federal Government has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria,” the statement read.\n“The Minister said the Federal Government has also directed the National Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in Nigeria.”"
  },
  {
    "headline": "Soyinka Faults Federal Govt’s Suspension Of Twitter In Nigeria",
    "summarized_story": "Nobel Laureate, Prof. Wole Soyinka, has faulted the decision of the Federal Government to suspend Twitter indefinitely in Nigeria.\nThe Federal Government had on Friday announced the indefinite suspension of Twitter in Nigeria.\n“In any case, this is a technical problem Nigerians should be able to work their way around.\n“Those of us in the fields for 30 months, who went through the war, will treat them in the language they understand.’’Twitter found the tweets offensive as it they were interpreted to suggest threat of genocide against the Igbo of Nigeria and they were consequently deleted.\nADVERTISEMENTApparently, the Twitter decision to delete President Buhari’s tweets angered the Federal Government of Nigeria."
  },
  {
    "headline": "Soyinka Faults Federal Govt’s Suspension Of Twitter In Nigeria",
    "summarized_story": "Nobel Laureate, Prof. Wole Soyinka, has faulted the decision of the Federal Government to suspend Twitter indefinitely in Nigeria.\nThe Federal Government had on Friday announced the indefinite suspension of Twitter in Nigeria.\n“In any case, this is a technical problem Nigerians should be able to work their way around.\n“Those of us in the fields for 30 months, who went through the war, will treat them in the language they understand.’’Twitter found the tweets offensive as it they were interpreted to suggest threat of genocide against the Igbo of Nigeria and they were consequently deleted.\nADVERTISEMENTApparently, the Twitter decision to delete President Buhari’s tweets angered the Federal Government of Nigeria."
  },
  {
    "headline": "Truck Crushes 10 Persons In Anambra Accident",
    "summarized_story": "At least 10 persons were crushed to at Kwata Flyover junction along the ever-busy Enugu-Onitsha Expressway in Awka, the Anambra state capital on Friday, in a multiple vehicle accident.\nThe incident, which occurred as a result of break failure suffered by a truck fully loaded with cattle, also led to the destruction of several vehicles caught up at the scene.\nMeawhile, pandemonium broke out when a team of combined security operatives including the Army and Police arrived the scene and opened fire on surging sympathisers.\nADVERTISEMENT“It involves a red Man Diesel truck with registration number JJN 59 YZ, a green Honda CRV without enlistment number, a Red M/Benz 4matic with registration number ABJ 115 DA, a black Toyota Highlander with registration number AWKA 226 HM and an Ash Lexus SUV with registration number KJA 136 FD.\n“Eyewitness report reaching us indicates that the crash which was as a result of brake failure involved a total of 12 people, 11 Male adults and one female adult ."
  },
  {
    "headline": "Truck Crushes 10 Persons In Anambra Accident",
    "summarized_story": "At least 10 persons were crushed to at Kwata Flyover junction along the ever-busy Enugu-Onitsha Expressway in Awka, the Anambra state capital on Friday, in a multiple vehicle accident.\nThe incident, which occurred as a result of break failure suffered by a truck fully loaded with cattle, also led to the destruction of several vehicles caught up at the scene.\nMeawhile, pandemonium broke out when a team of combined security operatives including the Army and Police arrived the scene and opened fire on surging sympathisers.\nADVERTISEMENT“It involves a red Man Diesel truck with registration number JJN 59 YZ, a green Honda CRV without enlistment number, a Red M/Benz 4matic with registration number ABJ 115 DA, a black Toyota Highlander with registration number AWKA 226 HM and an Ash Lexus SUV with registration number KJA 136 FD.\n“Eyewitness report reaching us indicates that the crash which was as a result of brake failure involved a total of 12 people, 11 Male adults and one female adult ."
  },
  {
    "headline": "Perm Sec: 14 Directors Fail ICT Test",
    "summarized_story": "This is even as only 11 of the 21 candidates were successful.\nThe proficiency test was part of the last stage process of appointing them as permanent secretaries.\nThe successful 11 directors were part of the 21 directors among the previous 46 senior officers who took the examination on Monday in Abuja.\nThey will on Monday June 7, 2021 meet for an interactive session with a broad-based panel of experts and practitioners who are expected to pick only five of the 11 directors.\nADVERTISEMENTThe Federal Government had in May announced the shortlisting of 47 directors for the examination among the 51 candidates who earlier faced a panel, with only 46 directors successful to the next stage."
  },
  {
    "headline": "We have been abandoned – headteacher of Niger school where 136 pupils were abducted weeps",
    "summarized_story": "The parents of the abducted 136 pupils of the Salihu Tanko Islamiyya school in Tegina town, Rafi LGA, in Niger state have spoken up.\nArmed bandits stormed the school riding in motorcycles and abducted the pupils, some of them who were under four years, on Sunday, May 27.\nI have witnessed the funeral prayers of one of the parents very close to the school.\nI am too sad”Another parent of one of the abducted students, Tanko Zagi, said they are yet to hear from the state government“Since that day up till now, we have not seen anything from the state government.\nBut the local government chairman has been up and doing so that these children can be rescued."
  },
  {
    "headline": "PHCN Staff electrocuted while disconnecting electricity in Abule Egba, Lagos",
    "summarized_story": "A staff of PHCN lost his life after being electrocuted in Abule Egba area of Lagos StateThe man before his untimely death went with other staff of the power company was in the area to disconnect the electricity due to non-payment of electricity bills.\nAn eyewitness, who confirmed the incident said, the deceased had disconnected power from a pole before being electrocuted while disconnecting another.\nREAD ALSO: Spiritually Nigeria has already broken up – Mailafia“He had already disconnected power from a pole before coming to the one here,”The witness revealed that the deceased was on the pole disconnecting the electricity wires, suddenly power got restored, making the powerline to electrocute him dry"
  },
  {
    "headline": "Spiritually Nigeria has already broken up – Mailafia",
    "summarized_story": "A former presidential candidate, Obadiah Mailafia, on Friday said Nigeria has already broken up spiritually and if steps are not taken the country will break up physically soon.\nThe former Deputy Governor of the Central Bank of Nigeria stated this during an interview with Punch.\nHe further stated that there is no need to argue that the country has been a failed state for over five years.\nObadiah when asked on Friday of his view on the secessionists’ calls in the country, Mailafia said, “Do you want an honest answer or do you want a political answer?\nThe honest answer is that the country is already broken up spiritually."
  },
  {
    "headline": "Breaking: FG Says It Has Indefinitely Suspended Twitter Operations In Nigeria — Daily Times Nigeria",
    "summarized_story": "The Federal Government on Friday said it has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria.\nThe Minister of Information and Culture, Alhaji Lai Mohammed,announced the suspension in a statement issued by his office in Abuja.\nREAD ALSO: Police council confirms Usman Baba Alkali as substantive IGPThe statement, signed by Ministry spokesperson, Segun Adeyemi, cited the persistent use of the platform for activities that are capable of undermining Nigeria’s corporate existence.\nAccording to the statement, the Minister said the Federal Government has also directed the National Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in Nigeria."
  },
  {
    "headline": "Security breakdown: Cross River varsity shut",
    "summarized_story": "University of Cross River State (UNICROSS) in Calabar was on Friday morning shutdown and students asked to vacate the campus following the breakdown of security in the school.\nThey said the late student was of Visual Arts department and was in school for his final clearance after his final year exams.\nThey revealed that the school security is reported to have caught two out of the gang of criminals who snatched the phone and stabbed the late victim.\n“All we want is let the school security release the suspects they have arrested to us.\nThere is no security in the school."
  },
  {
    "headline": "At last, Catholic church bans Mbaka from partisan politics",
    "summarized_story": "The Enugu Catholic Diocese has banned the Spiritual Director Adoration Ministry Enugu, Nigeria, Rev’d Fr.\nEjike Mbaka, from commenting on partisan politics.\nThe ban our correspondent gathered was contained in a letter his Bishop, Most Rev Callistus Onaga, conveyed to him after his penance.\nAlso contained in the said letter was converting the adoration ministry to chaplaincy to allow the diocese direct control of Adoration Ministry.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Arewa youths to Southern Govs: Ban on open grazing divisive, inciting",
    "summarized_story": "Northern Youth Groups under the auspices of Arewa Consultative Youth Movement and Arewa Youth Assembly have described resolution of the Southern Governors Forum to ban open grazing in their region as confrontational, divisive and capable of triggering crisis between herders and farmers in the region.\nThe youths also expressed support for position taken by the Minister of Justice and Attorney General of the Federation, Abubakar Malami (SAN) on the matter.\nThe group’s spokesman Malam Isiaku Abdulhameed, who made their position known in Kaduna on Friday, said the Southern Governors should have discussed the issue at the Nigerian Governors Forum (NGF) to advance the unity and corporate existence of the country which is the position of the AGF, Abubakar Malami.\nAccording to him: “We feel it is not yet late for the Governors to meet as a forum to discuss the issue towards taking a common position that would advance the course of unity and economic development of the country,” he said.\nNationShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "At last, Catholic church bans Mbaka from partisan politics",
    "summarized_story": "The Enugu Catholic Diocese has banned the Spiritual Director Adoration Ministry Enugu, Nigeria, Rev’d Fr.\nEjike Mbaka, from commenting on partisan politics.\nThe ban our correspondent gathered was contained in a letter his Bishop, Most Rev Callistus Onaga, conveyed to him after his penance.\nAlso contained in the said letter was converting the adoration ministry to chaplaincy to allow the diocese direct control of Adoration Ministry.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Faces of Indianapolis shooter Brandon Scott Hole",
    "summarized_story": "By AbankulaPolice authorities in Indianapolis on Friday released the photo of Brandon Scott Hole, the 19-year-old former FedEx worker, who killed eight people Thursday night.\nThe release of his photo corrected false images of the shooter earlier published in the social media.\nHole went on a shooting spree at the FedEx facility before turning the gun on himself.\nAccording to reports, he last worked for FedEx in 2020.\nCops still don’t know his motive and where he got the rifle he used."
  },
  {
    "headline": "52 Nigerians hit with severe reactions after taking AstraZeneca vaccine",
    "summarized_story": "By Kazeem UgbodagaThe National Primary Health Care Development Agency, NPHCDA, on Friday disclosed that 52 Nigerians have experienced moderate to severe reactions after taking the AstraZeneca vaccine.\nExecutive Director and Chief Executive Officer, NPHCDA, Dr. Faisal Shuaib disclosed this at a news conference in Abuja.\nHe also said 8,439 Nigerians experienced mild Adverse events following immunization (AEFI) after taking the vaccine.\n“Similarly, 52 cases of moderate to severe incidents of AEFI have been reported.\nAccording to Shuaib, as of today, April 16th, 1,071,346, representing 53.2% of the eligible persons targeted with the AstraZeneca vaccine had been administered their first dose in this vaccination phase."
  },
  {
    "headline": "Nigerians React As Twitter Officially Stops In Nigeria",
    "summarized_story": "Nigerians reacts as popular microblogging platform, Twitter has officially stopped its operation in Federal Republic of Nigeria.\nU can’t ban insecurity.\nBut u can ban twitter, So Twitter is ur problem??\nmy Twitter no dey work without vpn”@trending_mendic wrote: “My Twitter has stopped loading with the regular network.\nI’m using VPN now.”@PandaOfLagos wrote: “My Twitter is not loading again o. I’m tweeting via VPN nowNigerian government ban crypto, ban Twitter, but cannot ban Ban-dits”"
  },
  {
    "headline": "BREAKING: Twitter Officially Stops In Nigeria",
    "summarized_story": "Popular microblogging platform, Twitter has officially stopped its operation in Federal Republic of Nigeria.\nThis development is coming hours after Federal Government announced the suspension of Twitter in a recent statement signed by Lai Mohammed.\nThe Twitter app in Nigeria currently displays ‘Tweets aren’t loading right now.\nTry again’ but when connected to a VPN, the app begins to work perfectly fine.\nSee screenshot below:More details later…"
  },
  {
    "headline": "BREAKING: Twitter Reacts To FG’s Suspension Of Operation In Nigeria",
    "summarized_story": "The federal government’s decision to ban Twitter’s activities in Nigeria has prompted the company to express “great concern.”Twitter’s Senior Policy Communications Manager for Europe, the Middle East, and Africa, Sarah Hart, said in a statement that the company is looking into the situation.\n“The announcement made by the Nigerian Government that they have suspended Twitter’s operations in Nigeria is deeply concerning.\n“We’re investigating and will provide updates when we know more,” the statement said.\nIn a statement issued on Friday, the federal authorities announced the suspension of Twitter’s operations.\nThe government was forced to act, according to Lai Mohammed, Minister of Information, because of “the persistent use of the platform for activities that are potential of damaging Nigeria’s corporate existence.”"
  },
  {
    "headline": "BREAKING: Father Mbaka Banned From Commenting On Political Matters",
    "summarized_story": "Ejike Mbaka, Spiritual Director of Adoration Ministries Enugu Nigeria (AMEN), has been barred from commenting on party politics by the Catholic Church.\nAccording to the Cable, Callistus Onaga, Catholic Bishop of Enugu Diocese, switched the adoration ministry to chaplaincy in a letter to the priest.\nAs a result of the change, Mbaka will no longer be the sole spiritual director of the ministry, as it has been renamed chaplaincy, which places it under the administration of the Enugu Diocese and provides the bishop the authority to designate a chaplain to oversee its operations.\nThe bishop further noted that he has the authority to designate any ministerial officer “to assist the chaplains in overseeing the ministry’s pastoral activities.”During Mbaka’s return to church activities, which had been suspended following his one-month private retreat, these directions were issued.\nMore details later…"
  },
  {
    "headline": "Breaking: FG suspends Twitter indefinitely in Nigeria",
    "summarized_story": "The Federal Government has suspended, indefinitely, the operations ofthe microblogging and social networking service, Twitter, in Nigeria.\nThe Minister of Information and Culture, Alhaji Lai Mohammed,announced the suspension in a statement issued in Abuja on Friday, citing the persistent use of the platform for activities that are capable of undermining Nigeria’s corporate existence.\nThe Minister said the Federal Government has also directed theNational Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in Nigeria.\nDetails loading…Share this:TweetPrintTelegramWhatsApp"
  },
  {
    "headline": "Arms proliferation: Nigerians alarmed as insecurity heightens",
    "summarized_story": "The Chief of Defence Staff (CDS), Gen. Lucky Irabor, recently decried the proliferation of illegal arms in Nigeria, saying it was a threat to the country’s corporate existence.\nA security expert, Dr. Don Belema, in his view, blamed it on the lack of harmonious relationships among security agencies in arms proliferation and poor border management.\nWe need to look at it and see how to move regulations that could control small arms in the country.\n“There is a committee of federal government bodies that are in charge of small arms proliferation and prevention.\n“They should work and share intelligence not only with relevant national security agencies, but also neighbouring countries and regional organs like ECOWAS."
  },
  {
    "headline": "Breaking: Tuchel strikes fresh Chelsea deal",
    "summarized_story": "Chelsea manager Thomas Tuchel has signed a contract extension until the summer of 2024.\nTuchel, 47, signed an initial 18-month deal when he replaced Frank Lampard as Blues boss in January.\nHe led the club to victory in the Champions League final and a fourth-placed finish in the Premier League.\nChelsea were ninth in the Premier League and without a win in five games when Tuchel was appointed at the start of the year.\nThe London club also reached the FA Cup final, where they were beaten 1-0 by Leicester at Wembley."
  },
  {
    "headline": "Digital Economy: IT, Key To The Future, Says Westgate Boss -NigPilot",
    "summarized_story": "Despite the economic downturn occasioned by the COVID-19 outbreak and against the backdrop of the emerging digital economy, the information technology sector remains the key to the future.\nThis was disclosed by the managing director of Westgate Technologies, Mrs Ijeoma Ezeudu, on Thursday during the opening of a Westgate retail store in Abuja.\n“We’ve have been in this Abuja for the past 10 years but as a company, Westgate has been in existence for the past 16 years, we have that vision to take IT to the highest level.\nSo, despite the pandemic, it is quite challenging but we have to keep pushing,” she said.\nOn the impact of the COVID-19 pandemic on the company, Ezeudu said: “We can’t really quantify but all we know is all the SMEs have been affected."
  },
  {
    "headline": "Nigeria now has capacity to produce SIM cards, smartphones for Africa – Pantami -NigPilot",
    "summarized_story": "Nigeria has developed capacity to produce SIM cards and smartphones not only for the use of Nigerians alone but for the entire continent of Africa, Minister of Communications and Digital Economy, Ali Isa Pantami, has disclosed.\nSpeaking at the event organized by a support group known as APC Professionals Forum, Pantami said Nigeria has capacity to produce a minimum of 200 million SIMS annually.\n“When this administration came on board, even SIM cards were imported to Nigeria but as it is today, the federal government has provided an enabling environment for the private sector and as it is today, we have the capacity to produce SIM cards not only for our consumption but for the entire African continent.\n“We have the capacity to produce a minimum of 200 million SIMS annually.\nToday in Nigeria, we are producing smartphones.”"
  },
  {
    "headline": "Improve on Attahiru’s legacy, CNS tasks COAS -NigPilot",
    "summarized_story": "Chief of the Naval Staff (CNS), Vice Admiral Awwal Gambo has charged the newly appointed Chief of Army Staff (COAS), Major General Farouk Yahaya to improve on the legacy of his predecessor, late Lt. Gen. Ibrahim Attahiru.\nVice Admiral Gambo gave this charge when the new Chief of Army Staff (COAS) , Major General Faruk Yahaya paid him a courtesy visit at the Naval Headquarters.\nYou should equally pick up from where the late COAS, Lieutenant General Ibrahim Attahiru left from and improve upon those ideas”.\nEarlier, the Chief of Army Staff, Major General Faruk Yahaya said he was in the Naval Headquarters to formally inform the CNS that he had reported and taken over duty following his appointment as the 22nd COAS.\nMajor General Yahaya promised to ensure cooperation with other security agencies and stakeholders as the challenges confronting the security agencies are multi-faceted and would require a multi-faceted approach."
  },
  {
    "headline": "Accurate data for Persons with Disabilities ready soon- Lalu",
    "summarized_story": "The Executive Secretary Ncpwd Mr. James Lalu has pledged his support to the National Population Commission to ensure that disability data is not taken for laxity.\nIn his welcoming address the Executive Secretary National Commission for Persons with Disabilities Mr. James Lalu thanked the Coalition for putting together such initiatives.\nHowever, at the Global Disability Summit, disability data was on the front burner and so he will ensure that accurate data of persons with Disabilities in the upcoming 2022 Census are taken seriously.\nDr. Irene also urged the disability community to take ownership of the project and drive it to success.\nThe Executive Director of DINABI, Olajide Funso who spoke on Disability Data/Statistics in Nigeria according to him, unreliable, non-disaggregated, estimation-based and completely under-represented the disability community."
  },
  {
    "headline": "FG Says It Has Indefinitely Suspended Twitter Operations In Nigeria",
    "summarized_story": "The Federal Government on Friday said it has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria.\nIt is not yet clear how the suspension will work but the Twitter website was still accessible from Lagos as of Friday afternoon.\n‘Civil War’ TweetThe suspension comes days after Twitter deleted a tweet from President Muhammadu Buhari’s official account.\n“The mission of Twitter in Nigeria is very suspicious.\n“And you see when people were burning police stations and killing policemen in Nigeria during ENDSARS, for Twitter, it was about the right to protest."
  },
  {
    "headline": "Police Council Confirms Alkali As IGP, Almost Two Months After Appointment",
    "summarized_story": "The Police Council has confirmed Usman Alkali Baba as the Inspector General of Police (IGP), almost two months after President Muhammadu Buhari approved his appointment.\nUsman Alkali was confirmed on Friday during a meeting of the council in Abuja presided over by President Buhari.\nHeightening InsecurityDingyadi had on April 6 announced President Buhari’s confirmation of Alkali as the replacement for Mohammed Adamu.\nBefore his new role, the Yobe-born police chief was the Deputy Inspector General of Police, Force Criminal Investigation Department, Force Headquarters in Abuja.\nHe had before then also met with commanders from the areas to profer solutions to the hike in insecurity in the regions."
  },
  {
    "headline": "Nigerians Start Getting Charged N6.98 For USSD Transactions",
    "summarized_story": "Many users of USSD services in Nigeria on Friday started to see a notice to pay N6.98 for each transaction session.\nUSSD is a critical channel for delivering financial services, especially for those who do not have access to physical banking infrastructure or internet services.\n“Welcome to USSD Banking,” one notice said.\n“Things are really getting harder in this country a whole 6.98 approximately 7.00 to use #USSD,” one Twitter user wrote.\n“Do they realize that people who mostly use #USSD can’t afford internet enabled devices talk more of data."
  },
  {
    "headline": "Uzodinma Accuses Opposition, Aggrieved APC Members Of Fueling Insecurity",
    "summarized_story": "﻿Governor Hope Uzodinma of Imo has accused the opposition and aggrieved members of the All Progressives Congress (APC) of fueling the rising levels of insecurity in the southeast state.\n“The opposition party and some aggrieved members of our party who are hiring boys from neigbouring states to come in here, allow me, I will deal with them.\nA chieftain of the All Progressives Congress (APC), Ahmed Gulak was killed by gunmen on Sunday, becoming the latest high-profile casualty in the insecurity that has enveloped Imo State.\nThe main opposition Peoples Democratic Party (PDP) had in the wake of the worsening security situation, asked Governor Uzodinma to resign, arguing that he (Uzodinma) has failed to secure the lives and property of the Imo people.\nThe PDP leader noted that emerging developments suggest that the governor has no answer to the spate of killings in the state."
  },
  {
    "headline": "Twitter Ban: There Is No Constitutional Authority To Support FG’s Peremptory Action – NBA",
    "summarized_story": "The Nigerian Bar Association (NBA) has said that there is no constitutional nor legal authority that supports the ban of Twitter by the Federal Government.\nNBA President, Olumide Akpata disclosed this in a statement on Friday night.\nTwitter had deleted a post by President Muhammadu Buhari on Tuesday, and this prompted the government to announce a ban.\n— Olumide Akpata (@OlumideAkpata) June 4, 2021The @NigBarAssoc finds no constitutional or legal authority to support the peremptory action of the Federal Government to suspend the operations of Twitter in Nigeria.\nBeyond the dent on our constitutional democracy, at a time when the Nigerian economy is unarguably struggling… — Olumide Akpata (@OlumideAkpata) June 4, 2021"
  },
  {
    "headline": "APC Governorship aspirant decries deplorable state of roads in Anambra",
    "summarized_story": "One of the aspirants in the November 2021 Anambra State governorship election, Paul Orajiaka, has decried the deplorable state of roads in the Southeastern state, vowing to declare a state of emergency on them if elected as governor.\nHe stated this during an interactive session with journalists at the national headquarters of APC, where he also promised to declare free education from primary to secondary school levels.\nHe says a security plan that will be a homegrown structure comprising all the critical stakeholders in the state with direct communication to the state governor is the best approach to address security issues in the region."
  },
  {
    "headline": "Catholic Church bans Rev. Fr. Ejike Mbaka from Commenting on political matters",
    "summarized_story": "The Catholic Diocese of Enugu has banned Rev.\nEjike Mbaka, the Spiritual Director of Adoration Ministries Enugu Nigeria (AMEN), from commenting on partisan politics.\nThe Catholic church.\nAlso resolved that Mbaka will no longer solely oversee the activities of the ministry as its spiritual director.\nAdvertisementThese directives were made public following Mbaka’s resumption to church activities of the ministry, after he announced he was proceeding on One-month private prayer retreat."
  },
  {
    "headline": "Nigeria to produce smartphones for African continent – Pantami",
    "summarized_story": "Nigeria has now registered its name among countries producing Smartphones in the world.\nThis follows announcement by the minister of Communications and Digital Economy, Isa Pantami, that Nigeria now has the capacity to produce SIM cards and smartphones for the continent of Africa.\nHe stressed that Nigeria has capacity to produce a minimum of 200 million SIMS annually.\n“We have the capacity to produce a minimum of 200 million SIMS annually.\nToday in Nigeria, we are producing smartphones,” the minister said."
  },
  {
    "headline": "Nigeria Suspends Twitter Indefinitely",
    "summarized_story": "Nigeria’s federal government has suspended, indefinitely, the operations of social networking service Twitter.\nHe said: “The mission of Twitter in Nigeria is very suspect.\n“And you see, when people were burning police stations and killing policemen in Nigeria during ENDSARS, for Twitter, it was about the right to protest.\n“By whatever name, you can’t justify giving orders to kill policemen or to kill anybody you do not agree with.\n“But I’m saying that you cannot compare anybody with Kanu who boldly say, go and kill policemen."
  },
  {
    "headline": "Thomas Tuchel Signs Chelsea Contract Extension After Champions League Win",
    "summarized_story": "Chelsea has tied Thomas Tuchel to a two-year deal, extending his previously 18-month contract six days after winning the Champions League for the London club.\nThat extension has been granted after the German, who was sacked by Paris-Saint Germain on Christmas Eve, delivered the Champions League trophy courtesy of a 1-0 victory over Premier League champions Manchester City.\nOn the extension of his contract, Tuchel told the club’s official website: “I cannot imagine a better occasion for a contract renewal.\n“Returning us to the top four in the Premier League was crucial, and we could not be happier with our success in the Champions League which crowned a remarkable season at Chelsea.\nLast weekend, he became the first manager to reach back-to-back Champions League finals with two different clubs."
  },
  {
    "headline": "Brazil Players May Walk Out on Copa America as Nation Heads For Third Covid Wave",
    "summarized_story": "The Copa America, awarded to defending champions Brazil after Argentina and Colombia were dropped as co-hosts, has become a contentious issue amid surging Covid cases in the region.\nReports have since followed that Brazilian internationals playing their domestic football in foreign countries will not play in the Copa America due to the crisis.\nBrazil players, executives and coaching staff haven’t spoken to the media since the decision was announced.\n‘Copa America is very important.\nBut Brazil’s stars have yet to speak out publicly about why they are against hosting Copa America, which starts in just nine days time."
  },
  {
    "headline": "Fire in Egyptian Detention Centre Kills 6 Children",
    "summarized_story": "Egyptian authorities say six teenage girls and at least 19 other people have been killed in a fire at a younger offenders’ institute in the country’s capital, Cairo.\nOfficials said the fire followed a fistfight between two children in one ward at the facility, located in the city’s Marj district.\nMore than two dozen other children were injured, they said.\nThe state-run newspaper Akhbar el-Yom reported that the children were not able to flee the fire because the ward was locked.\nIn March, a fire at a garment factory near Cairo killed at least 20 people and injured 24 more."
  },
  {
    "headline": "Uganda National Hospital Reports Increase in Covid Cases",
    "summarized_story": "Uganda’s national hospital, Mulago is reporting an unprecedented number of coronavirus patients as the East African country battles a second wave of the pandemic.\nThe national referral hospital’s deputy executive director, Dr Rosemary Byanyima, says the hospital has received 40 patients in the last 24 hours alone with many of them either severely or critically ill.\nMulago hospital had reserved 200 beds for Covid-19 patients and 190 people are currently admitted with more than three-quarters of them in the high dependency unit.\nMs Byanyima says there are plans to create more bed space by moving non-Covid patients to the old wing of the hospital.\nPresident Yoweri Museveni is expected to address the country this weekend on the government’s response to this second wave of the pandemic."
  }
]