[
  {
    "headline": "Revenue probe: For shunning invitation, Reps ask FIRS boss to resign",
    "summarized_story": "The committee, which condemned Nami for failing to answer its invitation to an investigative hearing on Wednesday, summoned the FIRS boss to appear before it unfailingly on Thursday.\nDeputy Chairman of the Committee, Abdullahi Abdulkadir, decried the absence of the FIRS boss at such an important hearing.\nRepresentative of the FIRS boss, Mr Olusegun Olatunji, pleaded with the lawmakers on Nami’s behalf, attributing his absence to the lateness of the letter of invitation from the committee.\nIf the FIRS boss cannot perform his constitutional responsibilities again, he should turn in his letter of resignation immediately.\n“Based on the seriousness of this, the FIRS boss is to cause a physical appearance before this honourable committee by 10am on Thursday."
  },
  {
    "headline": "Census will not consider religion, ethnicity —NPC",
    "summarized_story": "The National Population Commission says the population census will not take into consideration the number of adherents of any religion or the number of members of ethnic groups.\nIt, therefore, denied including a religious category in the questionnaires being distributed in the first pre-test exercise for the next population and housing census in the country.\nIn a statement titled, ‘NPC Refutes Fake News on Religion in Census Questionnaires’, the organisation said even in previous population census exercises, religion and ethnicity were not considered.\nThe statement read in part, “The attention of the NPC has been drawn to a misleading WhatsApp message circulating to the effect that the population census questionnaire has questions on religion.\n“For the records, the two recent censuses of 1991 and 2006 respectively had no provisions for religion and ethnicity."
  },
  {
    "headline": "Nadal reaches 14th French Open semi-final",
    "summarized_story": "Rafael Nadal reached a record-extending 14th French Open semi-final on Wednesday with a 6-3, 4-6, 6-4, 6-0 win over Diego Schwartzman, setting up a potential last-four showdown with world number one Novak Djokovic.\nThe 35-year-old Nadal improved his incredible French Open record to 105 wins and two losses as he advanced to his 35th Grand Slam semi-final.\nHe beat Argentine 10th seed Schwartzman in the last four of the 2020 edition.\n“It’s always incredible for me to return to the semi-finals for another time,” said Nadal.\n“I needed to play a little bit more aggressive and I think I did later, so I am very happy for that,” added Nadal."
  },
  {
    "headline": "Reps pass Bill to make Nigerian Navy University, Ibusa conventional",
    "summarized_story": "By Levinus Nwabughiogu-AbujaHouse of Representatives has given nod for the second reading of a bill seeking to make the Nigeria Navy-University known as Admiralty University a conventional one.\nThe sponsor of the bill, Yusuf Adamu Gagdi said that the bill if eventually passed into law will grant full legal status to the Institution.\nAccording to him, the University will offer courses in military policy, logistics and strategy, basic and applied sciences and arts, engineering, environmental and social sciences, education, agriculture, medical sciences, and any other field of study approved by the Senate of the University.\nHe said the institution will also provide special training courses and conduct research in any field as may be prescribed or directed.\nThe bill when put to voice vote got the overwhelming support of the majority of the members and was passed for second reading."
  },
  {
    "headline": "There ‘ll be no peace in Nigeria if children of the poor are denied quality education -Wabba",
    "summarized_story": "This was as he warned against givingchildren of the poor quality education, saying denying them good and quality eduction through exorbitant school fees was counter-productive as according to him, the children could take to crimes and other social vices threatening the security of the society.\n“It is surprising that after after sacking these workers,he also increased the school fees of the state university by also 500 percent.\nThe children of the poor affected mostly by this governor’s decision went on protest and today,the school has been shut down.\n“The children of the poor who are being pushed out of schools due to high school fees thus denying the quality education may take to crimes thus threatening the security of the society.\nWabba carpeted the Kaduna State Governor, Mallam Nasir El’Rufai, describing him as one that would go down in history for degrading the dignity of Nigerian workers."
  },
  {
    "headline": "FEC approves N895.5bn supplementary budget for military, COVID-19",
    "summarized_story": "–Okays 722bn FG’s borrowing request to fund security—Seeks restructuring of N39bn World Bank loansBy Johnbosco AgbakwuruTHE Federal Executive Council, FEC, Wednesday approved the draft 2021 supplementary budget of N895,842,462,917.\nThe Minister explained that the budget was principally for the procurement of equipment for the military and COVID-19 vaccines.\nAccording to her, “Today, the Federal Ministry of Finance, Budget and National Planning, presented to Council a proposal to seek Council’s approval for the draft Federal Government of Nigeria 2021 Supplementary Budget.\nThis is an incremental provision over N100 billion that is already provided in the 2021 budget.\n“We will be working with the World Bank to restructure some of the existing facilities to realise this N39.58 billion."
  },
  {
    "headline": "Polytechnic students back FG over Twitter ban",
    "summarized_story": "By Adeola BadruThe National Association of Polytechnic Students, NAPS, has thrown its weight behind the decision of the Federal Government to place a ban on Twitter operations in Nigeria.\nThe national president of the association, Mr. Olalere Benedict, made this known at a press conference in Ibadan, yesterday.\nHe said the Federal Government has the right to put a stop to anything capable of heating up the country’s polity.\nAccording to him, Twitter is not bigger than Nigeria, adding that it is an entity, while Nigeria is a sovereign country.\nHe said this would allow students prepare themselves for the future in their chosen careers."
  },
  {
    "headline": "Nigeria loses $18bn annually to illicit financial outflows — CISLAC",
    "summarized_story": "Calls for establishment of Procurement CouncilBy Gabriel Ewepu – AbujaThe Civil Society Legislative Advocacy Centre, CISLAC, Wednesday, disclosed that Nigeria loses $18 billion to illicit financially outflows.\nHe said: “The current situation of Nigeria regarding Illicit Financial Flows (IFFs) and Money Laundering (ML) is extremely challenging.\nPutting things into perspective, Nigeria loses about $15bn to $18bn annually to Illicit Financial outflows, largely generated by tax evasion but fueled also by grand corruption, organized crime activities and many other licit and illicit practices.\nRecent high UN panel calculated that for every 1 USD gained through foreign direct investment and oversees development aid, Africa loses 2 USD because of illicit financial outflows.\n“We are happy to partner with CISLAC and other CSOs to fight corruption believing that there is no single individual or any arm of government that can successfully fight corruption."
  },
  {
    "headline": "Groups call for end to wanton killings in Igbo land",
    "summarized_story": "Socio-cultural groups in Southeast Nigeria, the World Igbo Youth Council (WIYC), Igbo Youth Consultative Forum (IYCF) and Igbo Student Congress (ISC), have appealed to all the parties causing mayhem and insecurity in Imo State and Igbo land as a whole to stop wasting innocent blood.\nThe groups in a joint statement made available to DAILY POST on Wednesday, at the end of the Igbo Youth Security Summit at Owerri, called on Imo State Governor and state governments and all stakeholders in Igbo land to take decisive step to end the killings in Imo State and Igbo land in general.\nThe Igbo organizations warned killer herdsmen to flee Igbo land in their own interest and noted that foreigners now hide under IPOB, ESN and unknown gunmen to create insecurity in Igbo land, which they rated as the most peaceful part of Nigeria.\nThey further called on Ndigbo to be conscious of their security especially at this point in time, warning against harassment and humiliation of people at checkpoints in Igbo land.\nIPOB: Stop mass arrests of Igbo youths in Owerri – Ohanaeze warns Nigerian ArmyAccording to the statement which partly stated, “Ndigbo respect lives and properties."
  },
  {
    "headline": "Niger govt denies ignoring parents of abducted Islamic school pupils",
    "summarized_story": "Niger State Government has debunked allegations that it deliberately ignored the parents and people of Tegina, Rafi Local Government Area after the kidnap of 136 Salihu Tanko Islamiyya students in the area.\nResponding to questions from newsmen in Minna, the Deputy Governor, Ahmed Kets, said in the last few days the government has been engaging with security agencies to ensure the quick release of the kids.\nThey claimed that the government has left the victims to their fates as they are still in the hands of their abductors.\nNiger: Anger as Gov Bello travels abroad amid kidnap of children, security challengesBut, reacting to the claims, the deputy governor explained that the decision not to visit and sympathize with parents of victims was for strategic reasons.\n“It is strategic for us not to have visited the families and people of Tegina but we are making frantic efforts."
  },
  {
    "headline": "Insecurity: Prophet urges Buhari to take urgent steps to prevent war",
    "summarized_story": "Blind Prophet and founder of Hour of Mercy Prayer Mountain Worldwide, Prophet Moses Muyideen Kasali, on Wednesday, warned President Muhammadu Buhari of impending war and bloodshed in the country if necessary steps were not taken urgently to rein in the criminals in the forests and the ethnic agitators drumming beats of war.\nKasali called for an urgent meeting among Buhari; Vice President Yemi Osinbajo; the Senate President, Ahmed Lawan; and House of Representatives Speaker, Femi Gbajabiamila; to chart a way out of the impending doom.\nThe military chiefs, traditional rulers, religious leaders, the academic and all stakeholders must rise to the occasion and ensure the impending war which would consume the nation was staved off.\nWe need to take the matter of the country to God for divine intervention.\nLet us promote peace and unity – Hausa, Fulani, Yoruba and Igbo and other ethnic regions."
  },
  {
    "headline": "EFCC arrests son, father for alleged internet fraud",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) is grilling a father, Isa Bola Bakare, and his son, Malik Giles Bakare over alleged conspiracy on computer-related fraud.\nMalik was arrested by officers of the Nigeria Police, Force CID, Alagbon in Lagos on May 31, 2021, and handed over to the EFCC.\nIn a statement on Wednesday, EFCC spokesman, Wilson Uwujaren said Malik acted as a “middleman”.\nEFCC grills ex-Kwara Governor, Abdulfatah Ahmed over alleged N9bn diversionDuring preliminary investigation, the father appeared at the EFCC to claim the N46 million Range Rover SUV recovered from Malik.\nThe father and son will be charged to court after the conclusion of the full investigation."
  },
  {
    "headline": "Anambra: INEC publishes notice for November 6 election",
    "summarized_story": "The Independent National Electoral Commission (INEC) has published the official notification for the November 6 Anambra governorship election.\nThe electoral umpire made this known in a statement on Wednesday by Rotimi Oyekanmi, Chief Press Secretary to the Chairman, Mahmood Yakubu.\nThe spokesman said the notice can be found at all INEC offices in Anambra.\nTwo activities will commence from Thursday, June 10 – primaries by parties to nominate their candidates and the collection of nomination forms at the INEC headquarters.\nThe commission appealed to political platforms to conduct credible and rancour-free primaries in compliance with regulations and guidelines."
  },
  {
    "headline": "Social media users blast Chris Okotie for ‘Wizard of Endor called Emmanuel’ post",
    "summarized_story": "Chris Okotie has come under fire over his seemingly farewell epistle to the late TB Joshua.\nHis post comes days after T.B Joshua, who was known for using the name “Emmanuel” in his church, died.\nThank God TB Joshua lived a life of humanity but what example are you showing to your followers than speaking English and changing wives !\nOnly God almighty can judge TB Joshua not Okotie.”Prince Timmy Oye wtote: “If truly he is referring to Pastor TB Joshua, he needs a mental health evaluation.\nNa him say make u get F9 for music, F9 for politics, F9 for marriage, F9 for even God’s work!!!!"
  },
  {
    "headline": "Cult clash: Stray bullet kills man in Osun",
    "summarized_story": "Agency ReporterThe Police Command in Osun has confirmed the killing of a young man, identified as Olorunda, in Ilesha, Osun by suspected cultists.\nThe command spokesperson, SP Yemisi Opalola, who confirmed the incident in Osogbo on Wednesday, said that the victim was hit by a stray bullet.\nOpalola, however, said that calm was restored in the area while police investigation was ongoing on the incident.\nADVERTISEMENTAn eye witness, who spoke on the condition of anonymity told newsmen that the victim, who works at a sawmill in the area, went to buy cowpea for his breakfast when he was hit by a stray bullet.\nThe witness said some assailants, suspected to be cult members, were after a renounced Eye cult member in the area, who they shot at and missed, but their bullet ended up killing an innocent person."
  },
  {
    "headline": "Twitter ban: PDP seeks visa ban on Buhari, Malami, others",
    "summarized_story": "By Gbade Ogunwale, AbujaThe Peoples Democratic Party (PDP) has called on the United States, United Kingdom, Canada, Saudi Arabia and other members of the international community to immediately impose visa ban on President Muhammadu Buhari for stifling free speech in Nigeria.\nThe party said the visa ban should be extended to the Attorney General, Abubakar Malami, Information Minister, Lai Mohammed and certain leaders of the ruling All Progressives Congress (APC).\nReacting to the ban placed on Twitter operations by the Federal Government, the PDP, in a statement on Wednesday by its spokesman, Kola Ologbondiyan, said the ban violated United Nations International Charter on Human Rights.\nThe party insisted that banning Twitter in Nigeria is a clear violation of Article 19 of the UN Charter, as well as Section 39 of the 1999 Constitution (as amended), which guaranteed freedom of expression for all Nigerians.\nADVERTISEMENTAccusing the Buhari administration of harassing and threatening Nigerians with violence, the party said the ban should also be extended to family members of the targeted officials."
  },
  {
    "headline": "Rivers threatens to acquire disputed Ogoni land",
    "summarized_story": "By Mike Odiegwu, Port HarcourtThe Rivers State Government has threatened to acquire a disputed land between Bomu and Lewe communities in Ogoni if they fail to end their protracted communal war.\nGovernor Nyesom Wike gave the warning on Wednesday during the commissioning of the reconstruction of Government Secondary School, Kpor in Gokana Local Government Area.\nHe noted after the crisis that culminated in the killing of prominent Ogoni leaders in 1990s, Ogoni should have considered fatricode an unpardonable taboo.\nIf I were you people, what had happened to Ogoni should have made everybody to be together, to forget about killing one another again.\nHe said the reconstruction of the Government Secondary School, Kpor was in fulfillment of some of the promises he made to the people of Ogoni during his campaign."
  },
  {
    "headline": "Breaking: Poly lecturers suspends two months old nationwide strike",
    "summarized_story": "From Paul Orude BauchiThe Academic Staff Union of Polytechnics (ASUP) has suspended its over two months days old industrial action with effect from Thursday June 10, 2021.\nThis was disclosed by ASUP’s National Publicity Secretary, Comrade Abdullah Yalwa, in a press statement issued made available to journalists in Bauchi on Wednesday.\n“As part of the efforts communicated by the Federal Ministry of Education, certain items have been fulfilled,” he stated.\nThese, he disclosed included reconstitution and inauguration of governing councils and visitation panels in Nigerian Federal Polytechnics.\nYelwa disclosed that ASUP also acknowledged the recent passage of the Bill for removal of the dichotomy against HND holders in the country."
  },
  {
    "headline": "Buhari receives “first made-in-Nigeria phone”",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari on Wednesday received the first made in Nigeria cell phone, known as ITF Mobile.\nMinister of Industry, trade and Investment, Adeniyi Adebayo presented the phone to the President, before the commencement of the Federal Executive Council meeting.\nAdebayo said the phone was one of the 12 produced, using locally sourced components, by the Electrical/Electronics Technology Department of the Industrial Training Fund’s (ITF) Model Skills Training Centre.\nThose sworn-in were Wakil Bukar as Commissioner of the Federal Civil Service Commission (FCC) and Mohammed Dattijo Usman as Commissioner of the National Population Commission (NPC).\nOthers include the Ministers of Information and Culture, Lai Mohammed; Finance, Zainab Ahmed, Justice, Abubakar Malami and Trade and investment; Niyi Adebayo."
  },
  {
    "headline": "US calls for immediate reversal of Twitter ban",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe United States Government has called for the immediate reversal of the suspension of Twitter’s operations in Nigeria.\nUnited States Agency for International Development (USAID) Administrator Samantha Power said the suspension was nothing more than state-sanctioned denial of free speech.\nIn a Facebook post by the United States Diplomatic Mission to Nigeria, Power said the suspension should be reversed immediately.\n‘There are nearly 40 M Twitter users in #Nigeria, and the country is home to Africa’s largest tech hub.\nIn the joint statement, the five missions expressed disappointment over the Federal Government’s decision to place a ban on Twitter’s operations in Nigeria."
  },
  {
    "headline": "Insecurity: Ohanaeze to meet with northern elders",
    "summarized_story": "From Stanley Uzoaru, OwerriWorried by the alarming insecurity in South East and Nigeria in general, Chairman of Ohaneze Ndigbo Council of Elders, Chief Emmanuel Iwuanyanwu, has disclosed that he is spearheading a meeting of the northern elders and Ohanaeze Ndigbo to fashion out a solution to the problems.\nIwuanyanwu while describing the unfolding events in the country as extremely shocking and completely beyond any expectation and human imagination has called on the President General of Ohaneze Ndigbo, Professor George Obiozor to arrange for the meeting immediately .\nIwuanyanwu has also commiserated with the families of the late former political adviser to former president, Goodluck Jonathan, Ahmed Gulak over his gruesome murder in Owerri.\n“On behalf of Ohaneze Ndigbo Council of Elders expressed deep sympathy to the family of our brother and friend Dr. Ahmed Gulak, the Arewa and other northern groups, the Government and People of Adamawa State including his friends and associates.\nIwuanyanwu also commiserated with all those who lost their relations as a result of insecurity across the country."
  },
  {
    "headline": "Buhari, Obasanjo, Abdulsalami, others meet over insecurity",
    "summarized_story": "Burning national issues including unity of the country, security, peace, integration, economic revitalisation and development would be on the table when the Interfaith Initiatives for Peace meet in Abuja tomorrow.\nObasanjo had on Sunday asked Nigerians to cry to God for a solution to the security crisis plaguing the country.\nWe have to cry out to God to help us.”Meanwhile, Onaiyekan has urged Nigerians to put elected leaders on their toes and hold them accountable.\nAbimbola, represented by Mr Felix Pwol, a Director at the centre, said it was imperative for government to focus on achieving national unity, national security, women and youth development as well as civil society and government partnership.\nParticipants were drawn from the six states of the North-Central geo-political zone: Benue, Kogi, Kwara, Nassarawa, Niger and Plateau."
  },
  {
    "headline": "FLASHBACK: How Nigeria’s Attorney-General, Malami Violated COVID-19 Guidelines In 2020 To Hold Lavish Wedding Ceremony For Son",
    "summarized_story": "On Tuesday, Nigeria’s Attorney-General of the Federation (AGF), Abubakar Malami, defied the Nigerian government’s Twitter ban.\nSaharaReporters further gathered that the Minister downloaded Virtual Private Network in order to visit Twitter to deactivate it.\nA critical look at the photo by just clicking on it showed that indeed Malami had accessed his Twitter account with the aid of a VPN.\nHe has also been constantly accused of using his influence in the government to promote impunity and human rights violation.\nNot only did participants at the ceremony, which took place inside the Kano State Government House, more than 20, many of them did not wear face masks to protect themselves and others from contracting Coronavirus."
  },
  {
    "headline": "FLASHBACK: How Nigeria’s Attorney-General, Malami Violated COVID-19 Guidelines In 2020 To Hold Lavish Wedding Ceremony For Son",
    "summarized_story": "On Tuesday, Nigeria’s Attorney-General of the Federation (AGF), Abubakar Malami, defied the Nigerian government’s Twitter ban.\nSaharaReporters further gathered that the Minister downloaded Virtual Private Network in order to visit Twitter to deactivate it.\nA critical look at the photo by just clicking on it showed that indeed Malami had accessed his Twitter account with the aid of a VPN.\nHe has also been constantly accused of using his influence in the government to promote impunity and human rights violation.\nNot only did participants at the ceremony, which took place inside the Kano State Government House, more than 20, many of them did not wear face masks to protect themselves and others from contracting Coronavirus."
  },
  {
    "headline": "FLASHBACK: How Nigeria’s Attorney-General, Malami Violated COVID-19 Guidelines In 2020 To Hold Lavish Wedding Ceremony For Son",
    "summarized_story": "On Tuesday, Nigeria’s Attorney-General of the Federation (AGF), Abubakar Malami, defied the Nigerian government’s Twitter ban.\nSaharaReporters further gathered that the Minister downloaded Virtual Private Network in order to visit Twitter to deactivate it.\nA critical look at the photo by just clicking on it showed that indeed Malami had accessed his Twitter account with the aid of a VPN.\nHe has also been constantly accused of using his influence in the government to promote impunity and human rights violation.\nNot only did participants at the ceremony, which took place inside the Kano State Government House, more than 20, many of them did not wear face masks to protect themselves and others from contracting Coronavirus."
  },
  {
    "headline": "How Nigeria’s Attorney-General, Malami Shielded Indian-Muslim Family Accused Of Over N600 Billion Graft—Report",
    "summarized_story": "The OCCRP investigation says high-ranking Albanian and Nigerian officials helped the family evade repeated attempts to extradite them to India.\nNigeria's Attorney-General rebuffed an Indian request for their extradition, arguing that the case appeared to be politically motivated.\nInvestigators claimed that the family’s companies had obtained the money by fraudulently obtaining loans from various Indian banks.\nThe Nigerian court decision in the case filed by Allenne, handed down on June 8, 2018, ultimately helped the Sandesaras avoid extradition from Albania as well.\nRejecting to order extradition, an Albanian judge argued that Nigeria’s High Court had shown the Sandesara family were being targeted because of their “political and religious beliefs.”"
  },
  {
    "headline": "How Nigeria’s Attorney-General, Malami Shielded Indian-Muslim Family Accused Of Over N600 Billion Graft—Report",
    "summarized_story": "The OCCRP investigation says high-ranking Albanian and Nigerian officials helped the family evade repeated attempts to extradite them to India.\nNigeria's Attorney-General rebuffed an Indian request for their extradition, arguing that the case appeared to be politically motivated.\nInvestigators claimed that the family’s companies had obtained the money by fraudulently obtaining loans from various Indian banks.\nThe Nigerian court decision in the case filed by Allenne, handed down on June 8, 2018, ultimately helped the Sandesaras avoid extradition from Albania as well.\nRejecting to order extradition, an Albanian judge argued that Nigeria’s High Court had shown the Sandesara family were being targeted because of their “political and religious beliefs.”"
  },
  {
    "headline": "I'd rather die than pay ransom to kidnappers, says el-Rufai’s wife",
    "summarized_story": "El-Rufai has maintained that his government will not pay ransom to bandits, as such actions encourage more criminal activities.\nAdvertisementAisha said she is ready to die in the hands of kidnappers, if it will bring peace to the country.\nI am ready to die in the hands of kidnappers if it will bring peace to this country,” she said.\nAdvertisement“For as long as you continue to pay ransom, it is like you are adding kerosene to fire.\n“We should not pay ransom."
  },
  {
    "headline": "I'd rather die than pay ransom to kidnappers, says el-Rufai’s wife",
    "summarized_story": "El-Rufai has maintained that his government will not pay ransom to bandits, as such actions encourage more criminal activities.\nAdvertisementAisha said she is ready to die in the hands of kidnappers, if it will bring peace to the country.\nI am ready to die in the hands of kidnappers if it will bring peace to this country,” she said.\nAdvertisement“For as long as you continue to pay ransom, it is like you are adding kerosene to fire.\n“We should not pay ransom."
  },
  {
    "headline": "ASUP suspends 65-day-old strike",
    "summarized_story": "The Academic Staff Union of Polytechnics (ASUP) has resolved to suspend its 65-day-old strike.\nBut on Wednesday, the union issued a statement announcing the suspension of the strike with effect from Thursday, June 10.\nAdvertisementEarlier addressing NAPS, Chukuemeka Nwajiuba, minister of state for education, had noted that everything that had to do with ASUP had been settled.\nHe had also said that the onus was with the union to be fair on the students by calling off the strike.\nAdvertisement“When ASUP wanted to start this strike, we wrote them and said everything that ASUP requested for has been agreed upon, we do not have one area of disagreement."
  },
  {
    "headline": "ASUP suspends 65-day-old strike",
    "summarized_story": "The Academic Staff Union of Polytechnics (ASUP) has resolved to suspend its 65-day-old strike.\nBut on Wednesday, the union issued a statement announcing the suspension of the strike with effect from Thursday, June 10.\nAdvertisementEarlier addressing NAPS, Chukuemeka Nwajiuba, minister of state for education, had noted that everything that had to do with ASUP had been settled.\nHe had also said that the onus was with the union to be fair on the students by calling off the strike.\nAdvertisement“When ASUP wanted to start this strike, we wrote them and said everything that ASUP requested for has been agreed upon, we do not have one area of disagreement."
  },
  {
    "headline": "Amotekun, Ebube Agu to get legal backing as reps consider state security bill",
    "summarized_story": "A bill seeking to give legal backing to state security outfits has passed second reading at the house of representatives.\nAdvertisementThe constitution amendment bill provides for the establishment of state security service commission to regulate the operations of security outfits sponsored by the states.\nThis means that organisations such as Amotekun in the south-south, and Ebube Agu in the south-east, will be officially recognised by the constitution if the bill is passed into law.\nThey were both established as joint security outfits by the two geopolitical zones to help tackle insecurity.\nThe bill was unanimously voted for second reading after it was put to a voice vote by Idris Wase, deputy speaker of the house."
  },
  {
    "headline": "Here’s why Apple’s planned privacy safety feature won’t roll out in three censorship-heavy African countries",
    "summarized_story": "In addition to these, Apple unveiled new updates focused on tightening the protection of its users’ privacy.\nA particular update that stood out from Apple’s several privacy-focused measures is “Private Relay”.\nThe feature is likely to go live later this year but Apple has revealed that it won’t be available in some countries due to “regulatory reasons”.\nCountries where the company will not offer private relay include South Africa, Egypt, Uganda, Saudi Arabia, Belarus, Colombia, Kazakhstan, Turkmenistan, the Philippines and China.\nApple is yet to disclose the outside partners it will use for the private relay system."
  },
  {
    "headline": "Exposure to risk: What tech investors fear and find interesting about Nigeria’s Twitter ban",
    "summarized_story": "One less medium for investor contactAfter the government ban on Twitter last week, a number of startups are anxious about using the platform.\nThe anxiety around the ban has gotten to the international community of startup investors too.\n“I think the ban on Twitter will definitely affect investor sentiments and perception about Nigeria negatively, especially foreign investors who invest in Nigeria remotely,” Shinada says.\nTwo other tech investors who spoke to TechCabal largely agreed with this view of the Twitter ban’s possible effect on foreign investments into tech startups.\nMore discount on regulatory riskOne area of investment concern following the Twitter ban is “a higher sense of political and regulatory risk,” where unilateral decisions can put whole companies in jeopardy."
  },
  {
    "headline": "Femi Iromini is improving the employability of students in Nigeria",
    "summarized_story": "Fortunately, Iromini got into university at a young age so taking an involuntary gap year wasn’t too big a deal.\nCareer outcomes are a selling proposition for universities,” Iromini said.\nSomeone who helps with internships, reviewing CVs and evaluating the interests of students,” Iromini said.\nIt also has other solutions for students like career services, a learning management system, a transcript management system, and an education financing product.\nAs someone who has always sought to solve problems around him, Iromini is taking the Nigerian education system heads on."
  },
  {
    "headline": "OctaFX Copytrading introduces Risk Score",
    "summarized_story": "The company recently introduced Risk Score—a game-changing feature that enables copiers to choose Master Traders based on the risk of their trading strategy.\nOctaFX Copytrading is a top-rated service among the company’s clients.\nFirst, you can access the service with just one tap through the OctaFX Copytrading app or the desktop version.\nOctaFX Copytrading introduced Risk Score—a new feature that shows how risky each Master Trader’s strategy is.\nMaster Traders who score 1 or 2 on a 6-point scale apply more stable, long-term oriented, and less risky strategies."
  },
  {
    "headline": "EASYSHARE.AFRICA LAUNCHES PLATFORM USING SAFE, LOW COST, CRYPTOCURRENCY TECHNOLOGY",
    "summarized_story": "By using innovative low-cost crypto-technology to drastically cut transaction fees, Easyshare will also allow consumers to perform micro-transactions safely, securely and affordably.\nSpeaking on the launch of the beta platform, Ben Onuoha Co-founder and Head of Partnerships & Community at EasyShare.Africa said, “Easyshare was born out of a lot of research.\nUsers can seamlessly send money to a mobile wallet or bank account using crypto in five easy steps.\nThe Easyshare.Africa platform is crowdsourcing to meet its expansion plansIn addition to serving ordinary consumers, Easyshare.Africa is committed to extending its impact, by pioneering the world’s first decentralized network of verified peer to peer crypto-powered remittance agents.\nCurrent crypto remittance systems and peer to peer platforms use centralized escrows to guarantee settlement."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Update on #Twitter ban, Nigerian e-hailing drivers go local, Bolt’s e-bikes in Kenya",
    "summarized_story": "Various bodies, including High Commissions and Embassies of foreign nations spoke out against the Twitter ban.\nUber and Bolt drivers set to partner with local companiesFighting back?\nRecall that in April 2021, riders on Uber and Bolt drivers embarked on a week long warning strike.\nGo deeper with this article: Uber, Bolt drivers move to dump ride hailing companies, partner with indigenous firmsBolt unveils electric tuk-tuks in KenyaBolt Foods electric motorcycles.\nSource: TechishBolt has unveiled electric tuk-tuks — tricycles — and e-bicycles in Kenya."
  },
  {
    "headline": "Global EV adoption: The reality in Africa may be different",
    "summarized_story": "A decade ago, the notion that Electric Vehicles (EVs) could be an alternative to the popular gas vehicles was unthinkable.\nLast year, over 11 million registered electric vehicles including cars, buses, vans and trucks were on the road across the world.\nIt has almost five million EVs, accounting for more than half of the world’s total, according to the Chinese Ministry of Public Security.\nThe country is ranked fifth globally in the ratio of public electric vehicle (EV) chargers to electric vehicles in 2020.\nSimilarly in Africa, SDG scenarios are predicting around 40% of light vehicles in Africa are electric by 2050."
  },
  {
    "headline": "Bolt adds e-bikes, tuk-tuks to fleet of food delivery vehicles in Kenya",
    "summarized_story": "Door-to-door food delivery platform, Bolt Foods, has added electronic bikes and tuk-tuks to its Kenyan fleet.\nCurrently, It is only available for food delivery, although the company is looking to expand the use of these EVs to its ride-hailing services.\nPreviously known as Taxify, the company launched Bolt Foods in August 2019.\nIn Africa, Bolt Foods is only available in SouthAfrica, Ghana, and Kenya.\nThe latter is the first African market where their EVs for food delivery will be launched."
  },
  {
    "headline": "War against everybody",
    "summarized_story": "There had not been any government in the history of Nigeria that had so blatantly disregarded public opinion as did the Buhari regime.\nIn September 1984, after months of warning, the Nigerian Medical Association (NMA) decided to hold the Buhari regime to its promise.\nAnother aspect of Buhari’s war against everybody was one which wrought disaster in virtually every home in the land.\nWhile the government floundered, it engaged in frivolities, Ondo state found time to erase Obafemi Awolowo’s name from the signboard of the state university.\nInstead of a war against poverty, corruption, and illiteracy, the Buhari administration waged a war against the people of Nigeria, and discredited the armed forces in the process, making President Babangida’s first task that of putting an end to the war on everybody."
  },
  {
    "headline": "Nigeria missing in Africa’s airline traffic ranking",
    "summarized_story": "Despite Nigeria’s large population and natural geographical advantages, its airlines are missing out on processing more of passenger traffic within Africa.\nA recent data released by the African Airlines Association (AFRAA) on African airlines ranking by traffic show that Nigeria is missing as regards domestic, intra-Africa and international traffic.\nChecks by BusinessDay show that Air Peace, Nigeria’s largest carrier, processes about 35 percent of the passenger traffic in Nigeria.\nFor instance, ComAir feeds from British Airways international flights and is part of the One-World Alliance and utilises this advantage when the need arises.\nExperts say these airlines failed to sustain international operations because they did not get the needed government support, and did not have partnerships with reputable international airlines."
  },
  {
    "headline": "Worst insecurity in 10yrs gives investment-starved Nigeria new headache",
    "summarized_story": "The rising insecurity in Nigeria is stifling local and foreign investment and threatening to curb economic output in a country whose economy has not grown in per capita terms since 2015 and where the rate of unemployment is the second highest globally.\nBetween January and May 2021, some 4,280 Nigerians have been killed due to…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Obaseki urges citizens’ ownership, warns against destruction of government property – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… Group offers to comb highways for criminal hideoutsBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called on citizens to take ownership of government property in their localities, to sustain ongoing development across the state.\nObaseki said this when he received leaders and elders of Ekosodin community in Ovia North-East Local Government Area of the state, who were on a courtesy visit at the Government House, Benin City.\nOsaigbovo Iyoha, said his administration will continue to work for the people of Edo State.\nIt has brought development to the people of Ekosodin Community in Ovia North-East.”In another engagement, Odolevbo O’sioba Initiative, led by the Commandant General, Comr.\n“We will continue to collaborate in the area of security, as we have made great impact in the area of keeping the state safe and peaceful,” he said."
  },
  {
    "headline": "Obaseki explores options to accelerate completion of Benin",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… plans new road, rail line to link Benin River Port to OkpellaBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, is exploring a number of options to speed up the completion of Benin-Auchi Road, which has been in a state of disrepair for years.\nOne of the options being considered is a proposal to take over the management and maintenance of the Benin-Auchi Road under the Federal Government’s Highway Development and Management Initiative (HDMI) being promoted by the Federal Ministry of Works and Housing.\nWe are designing a new road from the Benin River Port to Okpella.\nHopefully, one day in our development plan, we would be able to put a rail link there,” he added.\nObaseki further noted that, “When you try to get a flight to Edo State now, it becomes difficult because a lot of people are trying to utilize the business friendly environment created by this administration.”..."
  },
  {
    "headline": "NFF Gives State FAs 10 Days To Submit Aiteo Cup Champions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Nigeria Football Federation, NFF, organiser of Aiteo Cup Competition has given the 36 State and FCT Football Associations ten days to submit the name of club that will represent them in the 2021 National Aiteo Cup Competition.\nThis is contained in a statement dated 4th June and signed by the Secretary of the Organising Committee, Wilfred Onaji, which reads, “The Organising Committee of Nigeria Football Federation NFF on the directive by CAF all countries should submit by 30th June 2021 names of the teams that will take part in the various CAF Competitions.\n“In view of the above, the Committee concluded that all States Football Association should produce one representative latest 14 of June, 2021.\nA national draw will be held at a date that will be communicated for the 37 teams that qualified “."
  },
  {
    "headline": "Football Enthusiasts condemn Attack On Bendel Insurance Players During League Game – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Football enthusiasts in Yenagoa, the Bayelsa State capital have condemned the unruly behavior exhibited by fans of Remo Stars Football club against players and officials of Bendel Insurance FC in a matchday twenty one group B2 game of the Southern conference of the Nigeria National League, NNL played at Ikenne Ogun state on Sunday.\nRemo Stars who were at home allowed their supporters to beat up two Bendel Insurance players and secretary Charles Ihimekpan with other players seen escaping the stadium through the fence in a video that went viral on Sunday night.\nHe called on the Nigeria Football Federation and organizers of the league to sanction Remo stars FC and perpetrators of such violence in order to curtail the acts of hooliganism and insecurity in match venues across the country.\nAnother football enthusiast, Alaowei Mieseigha called on the league body to banish Remo Stars from Ikenne as well as place a fine on the team to serve as deterrent to others.\nAlso, Raphael Okolai noted that if strong measures were not taken against Remo stars, fans would continue to molest visiting teams whenever the home team fails to win a match on their ground."
  },
  {
    "headline": "JUSUN suspends two-month-old strike",
    "summarized_story": "ADVERTISEMENTThe Judiciary Staff Union of Nigeria (JUSUN) has suspended its over-two-month-old strike.\nMembers of the union had embarked on the strike on April 6 to press home their demand for the financial autonomy of the judiciary.\nThe union, however, took the decision suspending the strike at a meeting of its National Executive Committee (NEC) in Abuja on Wednesday.\nJUSUN had convened the NEC meeting following an appeal by the National Judicial Council (NJC) to the union to call off the nationwide strike in the interest of the nation.\nThe NJC led by the Chief Justice of Nigeria (CJN), Tanko Muhammed, had made the appeal to the union at a meeting earlier on Tuesday."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Osun VGN harps on synergy between citizens and security operatives to curb incessant crime rate",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun State chapter of Vigilante group of Nigeria (VGN), has said adequate cooperation of the citizens with the security operatives is the only antidote to incessant crime rate bedevilling the state.\nHe advised the citizens to adequately report any strange happenings or faces in their environment to security operatives near to them to help.\nAccording to him, the corp as part of civil Joint Task Force, has met with other conventional security personnel to fashion out modalities to effectively curb crime in the state.\nBello also appreciated Governor Oyetola for the opportunity given to his corp to be part of the civil Joint Task Force in the state.\nHe equally thanked the governor for hamolising all local security outfits in the state to form civil Joint Task Force, saying, the group will work assiduously with other conventional security personnel to bring lasting peace to the state ."
  },
  {
    "headline": "Ohanaeze to Wamakko: North responsible for insecurity in Southeast",
    "summarized_story": "Apex Igbo sociocultural group, Ohanaeze Ndigbo, has lashed out at former governor of Sokoto State, Aliyu Wamakko, berating him for accusing Igbo leaders of culpability in insecurity in the Southeast, insisting that North is the brain behind the insecurity in the zone.\nIn a statement by its Secretary-General Okechukwu Isiguzoro on Monday, Ohanaeze described Wamakko’s comments as laughable, advising the ex-governor to first fix the crisis in the North before making any comment on the Southeast.\nIsiguzoro noted that Wamakko could not proffer solutions to the security challenges in the North, which the region allegedly incubated to oust former President Goodluck Jonathan and instal Muhammadu Buhari.\n“Ohanaeze Ndigbo Worldwide had cautioned Aliyu Wamakko over impulsive comments without any iota of truth, which is capable of inciting ethnic cleansing and turmoil in the country,” Isiguzoro said.\nThe silence of Igbo leaders is golden and will generate confusion in the camps of sponsors of terror in the South East.”"
  },
  {
    "headline": "Nigerian govt says Twitter must register with it before ban is reversed",
    "summarized_story": "Nigeria’s federal government has said social media platform, Twitter, must register in the country before a ban it slammed on its operations last week can be lifted.\nMohammed said other social media platforms like Facebook and Instagram must also be registered in the country.\nAccording to him, freedom of speech was not stifled by the suspension of Twitter since Nigerians can still use other platforms such as Facebook and Instagram.\nHe added that Twitter’s loss of money as a result of the suspension is an indication of its effectiveness.\nMohammed said the suspension was necessary because the micro-blogging site provided a platform for those that are threatening the existence of Nigeria."
  },
  {
    "headline": "Polytechnics academic staff suspend strike for three months",
    "summarized_story": "OBINNA EZUGWUThe Academic Staff Union of Polytechnics (ASUP) says it is suspending an industrial action it embarked upon more than two months ago, with effect from Thursday, June 10.\nThe suspension, the union said, is however, for a period of three months to enable the government complete the execution of the items contained in the Memorandum of Action signed with the Union since 27th April, 2021.\n“Other items include the ongoing efforts at the review of the scheme of service and conditions of service for polytechnics as well as the commencement of work towards resolution of the issues around CONTISS 15 migration arrears for the lower cadre.\nWe also acknowledge the recent passage of the bill for removal of the dichotomy against HND holders in the country.\n“Our union took into cognisance the appeals made by the government, revered traditional rulers in the country, members of the National Assembly, Chairmen of governing councils of federal polytechnics and indeed members of the public who showed varied interests in the matter."
  },
  {
    "headline": "Ban: Twitter, Others Must Be Licensed, Registered In Nigeria – Federal Govt",
    "summarized_story": "The federal government has listed some conditions to lift the suspension on Twitter operations in Nigeria, saying it must now be registered in Nigeria as a business concern.\nApart from Twitter, the government said other social media platforms like Facebook and Instagram must be registered in the country.\nAnd of course, there has to be a country before people can able to transact their businesses using social media platforms.\nAnd I went further to say yes that Twitter funded the Endsars protests in Nigeria last year.\n“And until when Twitter responds and the cardinal thing is that Twitter must be registered in Nigeria."
  },
  {
    "headline": "Ban: Twitter Already Seeking High-level Talks With Nigeria — Minister",
    "summarized_story": "The minister of Information and Culture, Lai Mohammed, has said that the microblogging site, Twitter, has sought high-level discussion with the Federal Government of Nigeria over last Friday’s ban of its operations in the country.\nResponding to questions about the effectiveness of the ban, the Minister of Information noted that it was effective and that Twitter has lost revenue.\nHe said the platform was suspended because it provided an avenue for people threatening the corporate existence of Nigeria.\nHe accused Twitter of failing to take down Kanu’s tweets despite repeated requests to do so.\nMohammed insisted that Twitter and other social media platforms like Facebook and Instagram must be registered in Nigeria, as one of the conditions for their continued operation in the country."
  },
  {
    "headline": "2nd Anniversary: Senators In Special Session, Score Selves High",
    "summarized_story": "Taking the lead, the Senate President, Ahmad Lawan, in a speech delivered during the special session, said a total of 742 Bills were introduced by the ninth Senate in the last two years.\nThe Senate President assured that the upper chamber would, finally this month (June), pass the Petroleum Industry Bill after about 20 years of failed attempts.\nThe Deputy Whip, Senator Aliyu Sabi Abdullahi (APC, Niger North), said, “as we celebrate two years, we are guided by the legislative agenda.\n“The Production Sharing Contract (PSC) is a testimony on how the National Assembly has been able to work in unity in the interest of the nation.\nThe Senate President, Ahmad Lawan, after the special session announced that the upper chamber has adjourned plenary till the June 22, 2021."
  },
  {
    "headline": "BREAKING: Courts To Reopen Monday As JUSUN Suspends Strike",
    "summarized_story": "Members of the Judiciary Staff Union of Nigeria (JUSUN) have suspended their weeks-long strike over judicial autonomy.\nDetails Later…"
  },
  {
    "headline": "Suspected Herdsmen Kill 4 Hunters In Kwara",
    "summarized_story": "Four local hunters were reportedly ambushed and killed by suspected herdsmen in Faje community in Asa local government area of Kwara State.\nIt was gathered that the hunters, who were five in number, were attacked by their assailants at a bush path near their village at about 7.00pm last Wednesday.\n“About five victims of the attack were coming from Ilorin to Faje village on two motorcycles on Wednesday’s night.\nBefore the people could get to the village, herdsmen attacked them at about 7:00pm.\nThe spokesman of Kwara State Police Command, Ajayi Okasanmi, confirmed the incident."
  },
  {
    "headline": "President Buhari to speak, declare open, maiden edition of youth conference",
    "summarized_story": "Tom Okpe, AbujaThe All Progressives Congress (APC) Youth Leader, Imail Ahmed has revealed that President Muhammadu Buhari is set to speak and declare open, maiden edition of youth conference to deepen democratic process through youth inclusion.\nAhmed further stated that to participate in the conference, youths are encouraged to log on to the official website of the conference www.pyc21.ng and register.\n“You will agree with me that Youth, vision, energy and skill is essential to moving the country forward.\nThe last elections had shown that the future of politics and governance lies with citizen and youth engagement.\nOther speakers expected at the conference are Julius Malema, Senator Ahmed Lawan, Senate President, Femi Gbajabiamila, Speaker, House of Representatives, Babatunde Raji Fashola, Akin Oyebode, Tonye Cole, Kabir Aregbesola, Daniel Bwala, and other progressive youths."
  },
  {
    "headline": "Just in: Court set to resume as JUSUN suspends strike",
    "summarized_story": "JUSUN has suspended the strike.\nDaily Times gathered that the Judiciary Staff Union of Nigeria (JUSUN) has resolved to suspend its over the two-month strike, effective from Monday.\nBreaking: ASUP Suspends StrikeJUSUN, News Online gathered took the decision at its National Executive Council (NEC) meeting which just ended in Abuja.\nREAD ALSO: Drama In Makurdi, EFCC Operatives ‘Beat Up’ NBA ChairmanThe National Judicial Council (NJC) had, at a meeting with JUSUN leaders on Tuesday, with the Chief Justice of Nigeria (CJN), Justice Ibrahim Muhammad in attendance, urged the striking court workers to put an end to the industrial action in the interest of the country and the suffering court users."
  },
  {
    "headline": "Reps directs Chairman FIRS, to resign over Revenue Leakages",
    "summarized_story": "Tom Okpe, AbujaPublic Account Committee (PAC) of the House of Representatives has urged the Executive Chairman of the Federal Inland Revenue Services, (FIRS) Alhaji Muhammad Mamman Nami to immediately resign his appointment, if he cànnot discharge his constitutional responsibilities effectively.\nThe Committee also gave Nami, 18 hours within which to appear before it or be sanctioned accordingly.\nHowever, the representative of the FIRS boss, Olusegun Olatunji pleaded with the Committee for the absence of his Chairman which he attributed to the lateness of the letter of invitation.\nThe Chairman of the Committee, Oke expressed dismay over the lukewarm attitudes of the Heads of Ministries Departments and Agencies MDAs of the Federal Government to their constitutional responsibilities on accountability.\n“Looking at the seriousness of this issue, the FIRS boss is to course physical appearance before this Honourable Committee by 10.00 am on Thursday, we are determined to stop this nonsense, the nation is bleeding,” he added."
  },
  {
    "headline": "Para-Military Academy: Reps pass Bill for its establishment in Ijebu-Igbo, Ogun",
    "summarized_story": "Tom Okpe, AbujaTo provide skills and adequate training for cadets in all categories of para-military services.\nThe House of Representatives on Wednesday passed into second reading, a bill seeking to establish the Nigerian Para-Military Academy Ijebu-Igbo in Ogun State South-West Nigeria.\nThe proposed academy he said, would develop in each officer cadet, the physical attributes and skills necessary to meet the requirements of a commissioned officer.\nHe also said the proposed institution would provide professional para-military education, designed to serve as a foundation for progressive development of cadet officers in the para-military services.\nThe lawmaker added that the institution would prepare officer cadets to earn degrees in those disciplines which are of special interest to the needs and aspirations of the para-military Academy of Nigeria."
  },
  {
    "headline": "All existing duly issued tinted permits remain valid – IGP",
    "summarized_story": "By TONY ADAMSDirects retrieval of SPY Number Plates from unauthorized usersThe Inspector General of Police, IGP Usman Alkali Baba, psc (+), NPM, mni has affirmed that all existing vehicle tinted glass permits, duly issued by the Nigeria Police Force, remain valid.\nThe suspension, which is a temporary measure, will remain in force pending the release of a new protocol that would regulate the issuance of tinted permits for vehicle owners and operators in the country.\nThis is in addition to, among other things, effectively address contemporary security challenges associated with the usage of tinted glasses by criminal elements who hide under the cover of tinted vehicles to carry out their nefarious activities.\nThe IGP specifically directed the AIGs and CPs to ensure that all SPY number plates currently in use by unauthorized users or fitted to unauthorized vehicles, are retrieved forthwith.\nMembers of the public are enjoined to cooperate with the Police in this regard as the moves are aimed at strengthening our internal security order."
  },
  {
    "headline": "All existing duly issued tinted permits remain valid – IGP",
    "summarized_story": "By TONY ADAMSDirects retrieval of SPY Number Plates from unauthorized usersThe Inspector General of Police, IGP Usman Alkali Baba, psc (+), NPM, mni has affirmed that all existing vehicle tinted glass permits, duly issued by the Nigeria Police Force, remain valid.\nThe suspension, which is a temporary measure, will remain in force pending the release of a new protocol that would regulate the issuance of tinted permits for vehicle owners and operators in the country.\nThis is in addition to, among other things, effectively address contemporary security challenges associated with the usage of tinted glasses by criminal elements who hide under the cover of tinted vehicles to carry out their nefarious activities.\nThe IGP specifically directed the AIGs and CPs to ensure that all SPY number plates currently in use by unauthorized users or fitted to unauthorized vehicles, are retrieved forthwith.\nMembers of the public are enjoined to cooperate with the Police in this regard as the moves are aimed at strengthening our internal security order."
  },
  {
    "headline": "At last, judiciary workers suspend strike",
    "summarized_story": "The Judiciary Staff Union of Nigeria has suspended its strike on Wednesday.\nThis was disclosed in a communique issued by the union after its emergency National Executive Council meeting held on Wednesday.\nThe communique was signed by the Deputy President, Emmanuel Abioye; and the General Secretary, Isaiah Adetola.\nJudiciary workers had on April 6 embarked on an indefinite nationwide strike in protest against the denial of the judiciary its constitutionally guaranteed financial autonomy which was also affirmed by a Federal High Court in January 2014.\nThe PUNCH had reported on April 13 that the strike had resorted to overcrowding at police detention facilities across the country as the strike had prevented the police and other law enforcement agencies from arraigning suspects in courts."
  },
  {
    "headline": "Another shot in the arm for Adeduntan as FirstBank wins Global Banking and Finance’s Retail Banking CEO Award",
    "summarized_story": "Even though anyone or organisation committed to doing good will keep doing so with or without recognition, recognitions for virtue tend to act like a shot in the arm for such people or organisations, spurring them to commit even more to doing good.\nThat is what the recent award of “Retail Banking CEO of the Year Nigeria” to Dr Adesola Adeduntan, CEO of First Bank of Nigeria Limited, is to both him and the bank he leads.\nThe strides are in turn underpinned by the bank’s resolute commitment to putting the customer and other stakeholders at the heart of its business.\nThe awards were created to accord recognition to companies of all sizes which are prominent in their areas of expertise and excellence within the financial world.\nFor Dr Adeduntan and FirstBank, the award is further proof of FirstBank’s enduring commitment to providing excellent retail banking services to all its customers as reflected in the bank’s strategic vision, diverse and inclusive workforce and performance-oriented organisational structure."
  },
  {
    "headline": "JUST IN: Judicial workers suspend two-month old strike",
    "summarized_story": "The Judiciary Staff Union of Nigeria (JUSUN) on Wednesday suspended its two-month old strike.\nThe body directed its members to resume work on Monday nationwide.\nThe decision to suspend the strike was taken at its National Executive Council meeting held in Abuja, Nigeria on Wednesday.\nJUSUN took the decision at its National Executive Council (NEC) meeting which just ended in Abuja.\nJUSUN declared an indefinite nationwide strike to press home their demand for the financial autonomy of the judiciary on April 6, 2021."
  },
  {
    "headline": "Lagos challenges workers on innovation, creativity",
    "summarized_story": "Lagos State Government has tasked Administrative and Account Officers in the Pension Administration Agencies of the State to continue to think outside the box as they come up with better, newer and faster ways to serve pensioners in Lagos State.\nPonnle said, “Lagos State is a trailblazing State that has been internationally acclaimed as the most pension compliant in the country.\nThus, it behoves on us who work in the Civil Service Pensions Office not to rest on our oars as we continue to find better, newer and faster ways to serve pensioners.\nYour effort, no matter how small, counts.”In all, there were thirty-one (31) participant from the Civil Service Pensions Office, Lagos State Pensions Commission, Teaching Service Commission and Local Government Pensions Board.\nOver the three days, seasoned facilitators from within the Public Service were involved to give lectures on topics such as: An Overview of Contributing Pensions Scheme in the Lagos State Public Service, Management of Pensions Scheme in Parastatals in the state Public Service, Career and Salary Progressions as it affects Computation of Gratuity and Pensions and others"
  },
  {
    "headline": "Dangote announces completion date for giant refinery",
    "summarized_story": "By Solomon Asowata/AbujaThe Dangote Group said its 650,000BPD refinery project under construction in Ibeju Lekki, Lagos will be completed by end of December.\nMr Edwin Devakumar, the company’s Group Executive Director, Strategy, Capital Projects and Portfolio Development, said this on Wednesday in Abuja.\nDevakumar said the refinery would create thousands of direct and indirect jobs for Nigerians and increase the country’s Gross Domestic Product.\nHe said it would also save the country the foreign exchange expended on importation of petroleum products and guarantee product availability in the market.\nDevakumar said apart from the Nigerian market, the refinery would be exporting refined petroleum products to Europe and South America as part of its business strategy."
  },
  {
    "headline": "I Am Ready To Die In Hands Of Kidnappers — Asia El-Rufai",
    "summarized_story": "Hajia Asia, the wife of Kaduna State Governor Mallam Nasir El-Rufai, has stated that she is willing to die at the hands of kidnappers in exchange for Nigerian peace.\nI am ready to die in the hands of kidnappers if it will bring peace to this country.\n“For as long as you continue to pay ransom, it is like you are adding kerosene to fire.\nyou are giving bandits, kidnappers money for ammunition to continue to haunt you.\nWe should not pay ransom."
  },
  {
    "headline": "BREAKING: JUSUN Suspends Two Months’ Strike",
    "summarized_story": "The Nigerian Judiciary Staff Union (JUSUN) has decided to call off its two-month strike, which began on Monday.\nJUSUN made the decision at its recently concluded National Executive Council (NEC) meeting in Abuja.\nThe National Judicial Council (NJC) asked striking court employees to cease their strike in the interest of the country and the suffering court users at a meeting with JUSUN leaders on Tuesday, with the Chief Justice of Nigeria (CJN), Justice Ibrahim Muhammad, in attendance.\nMore details later…"
  },
  {
    "headline": "Twitter Must Register In Nigeria Before Ban Is Reversed — Nigerian Government",
    "summarized_story": "Twitter, Facebook, Instagram, and other social media companies must register in Nigeria, according to the Nigerian government.\nTwitter was suspended, according to the Minister, because it gave a platform for persons who threatened Nigeria’s corporate survival.\nHe went on to say that Twitter’s financial loss as a result of the suspension is proof of its success.\nHe went on to say that one of the requirements for the Nigerian government to lift the restriction on Twitter is that the social media company be established as a commercial enterprise in Nigeria.\nOther social media networks, such as Facebook and Instagram, must also be registered in the country, according to Mohammed."
  },
  {
    "headline": "FG Launches First Made-in-Nigeria Cell Phone ITF Mobile",
    "summarized_story": "The federal government has launched the first made-in-Nigeria cell phone as President Muhammadu Buhari was presented with the indigenous phone, known as ITF Mobile.\nThe Minister of Industry, Trade and Investment, Adeniyi Adebayo, presented the phone to the president before the commencement of Wednesday’s Federal Executive Council meeting in Abuja.\nAccording to Mr Adebayo, the phone is one of the 12 cell phones produced, using locally sourced components by the electrical/electronics technology department of the Industrial Training Fund’s (ITF) Model Skills Training Centre.\nHe said, “12 indigenous mobile cell phones produced by the Model Skills Training Centre of the Industrial Training Fund, an agency under Ministry of Industry Trade and Investment, were launched.\nMeanwhile, Mr Buhari is presiding over the FEC meeting at the conference room of the First Lady’s office."
  },
  {
    "headline": "Breaking: Courts set to resume as Judiciary workers suspend strike",
    "summarized_story": "The Judiciary Staff Union of Nigeria (JUSUN) has resolved to suspend its over two-month strike.\nThe suspension according to JUSUN will be effective as from June 14, 2021.\nJUSUN took the decision at its National Executive Council (NEC) meeting which just ended in Abuja.\nDetails loading…"
  },
  {
    "headline": "Breaking: 65 days after, ASUP suspends strike",
    "summarized_story": "The Academic Staff Union of Polytechnics (ASUP) on Wednesday suspended her nationwide strike for a period of three months.\nA statement signed by the National Publicity Secretary of ASUP, Comrade Abdullahi Yalwa said, “Following an appraisal of the report indicating the gradual implementation of the items contained in the Memorandum of Action signed between our Union and the federal government, the Union has resolved to suspend its 65 days old industrial action with effect from June 10, 2021.\n“The suspension is for a period of three months to enable the government complete the execution of the items contained in the Memorandum of Action signed with the Union since 27th April, 2021.\n“We also acknowledge the recent passage of the Bill for removal of the dichotomy against HND holders in the country.\n“We equally appreciate the different layers of intervention by critical stakeholder groups in the sector within the period.”"
  },
  {
    "headline": "Pictures: President Muhammadu Buhari showcases first ever made in Nigeria mobile phone",
    "summarized_story": ""
  },
  {
    "headline": "The TWITTER Ban, Prosecution ,More Prisons And The Link With The JUSUN Strike -NigPilot",
    "summarized_story": "THE CURIOUS JUSUN STRIKE ANGLEFrom day one, I had whole-heartedly supported the JUSUN strike by Judicial workers.\nMeanwhile, the same courts being protected, are busy every day, delivering judgements (physical and virtual), on matters already pending before the JUSUN strike commenced.\nThe JUSUN strike has therefore outlived its usefulness and purpose.\nSee the following cases: GEORGE V FRN (2014) ALL FWLR (PT.718) 879; ABIDOYE V FRN (2014) ALL FWLR (PT.722) 1646; ALIYU V FRN (2014) ALL FWLR (PT.720) 1272.” Per YARGATA BYENCHIT NIMPAR, JCA (Pp 7 – 8 Paras A – A).\nSOME RESPITE: A LIGHT AT THE END OF THE TUNNELAll hope is not lost, even with the JUSUN strike."
  },
  {
    "headline": "Abaribe kicks over Buhari’s insistence on aide as INEC commissioner -NigPilot",
    "summarized_story": "Again, the Senate Minority Leader, Senator Enyinnaya Abaribe yesterday kicked against the inclusion of the Special Assistant on Social Media to the President, Lauretta Onochie among the six nominees to be screened by the upper legislative chamber for the position of Independent National Electoral Commission, INEC commissioners.\nThe Senate President, Dr. Ahmad Lawan had asked Abaribe to second a motion for the screening of the nominees, which the Minority Leader did reluctantly, having expressed his opposition to the resurfacing of the president’s aide.\n”I am seconding the motion for the screening of the nominees, reluctantly and we shall meet in Philippines,” the Minority Leader said.\nThe Senate President, later referred the executive communication to the Committee on INEC, chaired by Senator Kabiru Gaya (APC Kano South) with a view to screening the appointees for confirmation or otherwise by the Senate.\nLawan gave the committee four weeks to conclude the screening and report back to the Senate at plenary."
  },
  {
    "headline": "APC names 7-Member screening committee for Anambra gov’shp aspirants -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Assessing Buhari’s place in Nigeria’s “June 12” history -NigPilot",
    "summarized_story": "May 29 ceased to be recognized as “Democracy Day” on June 6, 2019, by the instrumentality of President Buhari’s pronouncement.\nAbiola, as the winner of the presidential election of June 12, 1993 enjoyed global validation.\nThe June 12, 1993 presidential contest was a watershed election, whose outcome was thought to have been permanently consigned into the dust-bin of history.\nIt is in the context of this recognition that President Buhari’s persona as harbouring a sportsmanship spirit became exemplified.\nBuhari’s place in history, especially in the contemplation of the history and politics of June 12, 1993 presidential mandate, is eternally assured for posterity to continue to interrogate and validate."
  },
  {
    "headline": "All Social Media Platforms, Others Must Be Registered In Nigeria – Lai Mohammed",
    "summarized_story": "The Federal Government has said all social media platforms – Twitter, Facebook, and others must register in the country.\nThis according to the Minister of Information and Culture, Lai Mohammed is part of the move to regulate the social media platforms.\n“What we are saying is that all platforms, you must register in Nigeria.\n“Whether it is Netflix, Iroko, or Facebook…they are all doing business in Nigeria, making money and they are not paying taxes.\nWith its suspension, Nigeria joins countries like China, Turkey, and Myanmar that have all moved to restrict access at some time to Twitter and other Western social media."
  },
  {
    "headline": "Twitter Has Reached Out To Us For Negotiation, Says FG",
    "summarized_story": "The Federal Government says the management of tech giant, Twitter, has reached out for dialogue.\nThe Minister of Information and Culture, Lai Mohammed said this on Wednesday while addressing State House correspondents after the Federal Executive Council.\n– Tax Payment and Registration –Minister Lai Mohammed also spoke concerning the payment of tax by tech giants in the country.\nHe explained that most of the OTT and social media platforms operating in Nigeria do not have offices either do they pay taxes for the billions earned.\nHe maintained that other social media platforms are still available for use."
  },
  {
    "headline": "Continue Using Twitter – NASS Joint Minority Caucus Urges Nigerians",
    "summarized_story": "The Joint Minority Caucus of the Senate and the House of Representatives has met over the ban on Twitter by the All Progressives Congress (APC)-led Federal Government and has restated its condemnation of the embargo as draconian and unacceptable.\nThis position was contained in a communique signed by Senator Enyinnaya Abaribe the Minority Leader of the Senate) and Hon.\nIn the statement, the Joint Minority Caucus also dismissed threats by the APC-led government to arrest and prosecute Nigerians using Twitter and calls on Nigerians to go ahead and use their Twitter as they would not be contravening any law in Nigeria or any international statute.\nThe joint caucus, therefore, called on Nigerians to use various opportunities offered by technology and continue making use of Twitter since such does not violate any law in our country.\n“It is agonizing that Nigeria and Nigerians have been losing billions of naira on daily basis since the ban on Twitter."
  },
  {
    "headline": "Senate Directs Committee To Screen Lauretta Onochie, Five Others As INEC Commissioners",
    "summarized_story": "The Senate has directed its Committee on Independent National Electoral Commission (INEC) to screen and confirm the appointment of one of President Muhammadu Buhari’s media aides Lauretta Onochie, and five others as INEC commissioners.\nThe directive comes after President Buhari on October 13, 2020, wrote to the Senate to confirm Ms. Onochie who is currently his Special Assistant on Social Media.\nREAD ALSO: Buhari Appoints Lauretta Onochie, Three Others As INEC CommissionersThe PDP had rejected her nomination alleging that she is a card-carrying member of the All Progressives Congress (APC).\nUpon confirmation, she will be appointed as the National Commissioner of INEC representing Delta State.\nOthers on the list are Professor Mohammed Sani (Katsina); Professor Kunle Ajayi (Ekiti), and Seidu Ahmed (Jigawa)."
  },
  {
    "headline": "Ivory Coast’s Gbagbo Sets Homecoming For June 17",
    "summarized_story": "Former Ivory Coast president Laurent Gbagbo will arrive home on the afternoon June 17 after being cleared of crimes against humanity for violence following the country’s 2010 election, his spokesman said Wednesday.\nGbagbo “will arrive on a Brussels Airlines flight in Abidjan on June 17,” spokesman Justin Katinan Kone told reporters.\n“He is coming for peace and he wants everything to happen peacefully” on his return, he added.\nHe was finally acquitted of crimes against humanity by the International Criminal Court in The Hague in March after a lengthy trial.\nIncumbent President Alassane Ouattara, who defeated Gbagbo in 2010 and has been reelected twice, decided after his predecessor’s acquittal to grant him the status of a former head of state."
  },
  {
    "headline": "NECO Will Not Extend Registration For 2021 SSCE Internal Candidates – Sani",
    "summarized_story": "The Head of Information and Public Relations Division,Azeez Sani, has revealed that the National Examinations Council (NECO) will not extend the registration period for internal candidates for the 2021 Senior School Certificate Examination (SSCE).\nMr. Sani stated in a statement on Wednesday that the registration period, which began on March 31st, will end on Friday, June 25th, 2021, and will not be extended.\nAccording to him, this will enable efficient and effective planning for the examination logistics required for the smooth conduct of the 2021 SSCE internal candidates.\n“State Ministries of Education, Commandants, Principals, Proprietors, and other relevant stakeholders are enjoined to take note of the closing date and ensure timely completion of their candidates’ registration.\nAdvertisement“The Council assures all stakeholders of its resolve to have seamless conduct of the 2021 SSCE”, he further stated."
  },
  {
    "headline": "JUSUN suspends over 2 month old industrial action",
    "summarized_story": "The Judiciary Staff Union of Nigeria (JUSUN) has resolved to suspend its over two-month strike, effective from Monday.\nJUSUN took the decision at its National Executive Council (NEC) meeting which just ended in Abuja.\nThe National Judicial Council (NJC) had, at a meeting with JUSUN leaders on Tuesday, with the Chief Justice of Nigeria (CJN), Justice Ibrahim Muhammad in attendance, urged the striking court workers to put an end to the industrial action in the interest of the country and the suffering court users."
  },
  {
    "headline": "Arrest of Greenfield University Students’ Abductors Not Confirmed – KDSG",
    "summarized_story": "The Kaduna state government says it can’t confirm that abductors of Greenfield University have been arrested.\nThe state commissioner for internal security and home affairs Samuel Aruwan made the disclosure in a statement.\nThe statement which reads, and I quote,“I have been inundated with calls, messages and emails to confirm if the bandits responsible for the kidnapping of the Greenfield University’s students have been arrested.\nAdvertisementAruwan says while it is their desire to see this happen by the grace of God, they cannot confirm the story making the rounds, and that they have not received any information related to this from security agencies."
  },
  {
    "headline": "Nigeria: I’d Rather Die Than Pay Ransom to Kidnappers, Says Kaduna Governor El-Rufai’s Wife",
    "summarized_story": "One of the wives of Governor Nasir El-Rufai of Kaduna state, Hajiya Asia El-Rufai, has declared that she would rather die than ransom be paid to kidnappers if she gets abducted.\nShe said she was ready to die in the hands of kidnappers if it will bring peace to the country.\n“For as long as you continue to pay ransom, it is like you are adding kerosene to fire.\n“We should not pay ransom.\nAccording to her, as long as the bandits are paid ransom, they will not change."
  },
  {
    "headline": "US Drops Trump Order Targeting TikTok, Plans Its Own Review",
    "summarized_story": "Officials are particularly concerned about apps that collect users’ personal data or have connections to Chinese military or intelligence activities.\nThe Biden administration last week expanded a Trump-era list of Chinese companies that Americans can’t invest in because of purported links to the Chinese military and surveillance.\nLast year, the Trump administration brokered a deal that would have had U.S. corporations Oracle and Walmart take a large stake in the Chinese-owned app on national security grounds.\nThe U.S. Court of Appeals for the District of Columbia Circuit has put on hold a case challenging Trump’s TikTok divestment order.\n“Our research shows that there is no overt data transmission to the Chinese government by TikTok,” the report said."
  },
  {
    "headline": "Nigeria: Judicial Workers Suspend Two-month Long Strike",
    "summarized_story": "The Judiciary Staff Union of Nigeria (JUSUN) has called off its two-month long strike with effect from 14th June, 2021 after a prolonged National Eexecutive Council (NEC) meeting.\nThe National Judicial Council (NJC) had, at a meeting on Tuesday with JUSUN leaders and the Chief Justice of Nigeria (CJN), Justice Ibrahim Muhammad, urged the striking court workers to put an end to the industrial action in the interest of the country and the suffering court users.\nMembers of the union have been on strike since April 6, 2021 in agitation for the financial independence of the various state judiciaries.\nA subsequent Executive Order was issued by the Nigerian President Muhammadu Buhari for the “Implementation of financial Autonomy of States Legislature and State Judiciary” on 20th May 2020.\nHowever, some state governors have failed to implement this fundamental provision of the Law."
  },
  {
    "headline": "Nigeria Says Twitter Ready to Negotiate, Accuses Founder Jack Dorsey of Sponsoring #EndSARS",
    "summarized_story": "America’s microblogging app Twitter has reached out to the Nigerian government for dialogue, according to the country’s minister of Information and Culture, Lai Mohammed.\nThe minister stated this on Wednesday at the State House in Abuja, noting that the ban has been very effective following reports of Twitter’s huge financial losses.\nMr Mohammed told journalists at the State House that Twitter has been a platform of choice for separatists to thrive.\nAccording to the minister, investigations had revealed that the Founder of Twitter, Jack Dorsey, was one of the funders of the #ENDSARS protest that rocked Nigeria in 2020.\nHe noted that Twitter will remain banned until it is duly registered, licensed, and operates within the country’s regulations."
  },
  {
    "headline": "French President Emmanuel Macron Slapped – Trending with Ojy Okpe",
    "summarized_story": "French President Emmanuel Macron was slapped in the face on Tuesday by a yet to be identified man during a visit to a small town in southeastern France.\nTiwa Savage and Seyi Shey in a video that has gone Viral were seen engaged in a Public BrawlThe Minister of Women Affairs and Social Development, Pauline Tallen, has accused entertainers of frustrating the government’s efforts at curbing the violation of women by promoting vulgar lyrics and using female dancers in a most disdainful manner."
  }
]