[
  {
    "headline": "BREAKING: Fayemi suspends Ekiti provost as 100 students hospitalised after fumigation",
    "summarized_story": "Ekiti State Governor, Kayode Fayemi, on Thursday, suspended the Provost, College Of Health Sciences and Technology, Ijero-Ekiti, Dr Cecilia Adebayo, over the hospitalisation of over 100 students following the fumigation of the school by men suspected to be from the Federal Fire Service.\nThis was contained in a statement signed by the Chief Press Secretary to the governor, Yinka Oyebode.\nThe statement was titled, ‘KSG Suspends Provost College Of Health Sciences As State Launches Investigations Into Controversial Fumigation Exercise That Landed Over 100 Students In Hospital’.\n“The suspension, is without prejudice to the outcome of a meeting of the College’s Governing Council slated for next week.\nThe officials of the Federal Fire Services that carried out the fumigation exercise have also been directed to report back to their office in Abuja."
  },
  {
    "headline": "Lawan tasks ECOWAS on terrorism, cross-border crimes",
    "summarized_story": "President of the Senate, Ahmad Lawan, on Thursday, asked the Economic Community of West African States parliament to address the prevalence of terrorism and irregular migration affecting member states.\nLawan also lamented the spate of insecurity and cross-border crimes such as banditry and kidnapping.\nHe described the criminal activities as severe threats to the stability and economic progress of most countries within the West African sub-region.\n“An accord of purpose between member nations creates the needed synergy for the actualization of uniform visions.\nJewel Cianeh Taylor; and President of the ECOWAS Community Court of Justice, Honourable Justice Edward Amoako Asante."
  },
  {
    "headline": "New army chief lists cracking jokes as hobby, speaks four languages",
    "summarized_story": "The newly appointed Chief of Army Staff, Major-General Farouk Yahaya, has indicated that his hobbies are cracking jokes, travelling, reading and listening to local music.\nThis is according to his curriculum vitae posted on Facebook by the Senior Special Assistant to the President on Media and Publicity, Garba Shehu.\nAccording to the CV, Yahaya speaks four languages including English, Spanish, Arabic and Hausa.\nThe general, who was commissioned in 1985, has attended nine courses in his career including the National Defence Course in Chile.\nHe served as military secretary and then General Officer Commanding before his latest appointment."
  },
  {
    "headline": "Constitution Review an exercise in Futility, waste of time, public funds — Afenifere",
    "summarized_story": "Also read:“Amending the constitution is an exercise in futility and a waste of time and public fund.\n“We cannot claim to be a federal Republic and be governed by a unitary constitution.\n“We cannot claim to be in a democracy and be governed by a constitution that does not emanate by the people.\n“Every session of the two arms of the National Assembly, since 2007, has embarked on the same jamboree of constitutional amendment spending public funds on public hearings, without any result.\n“The National Assembly is part of the issue to be determined in the process of restructuring and cannot legitimately be the judge in such exercise."
  },
  {
    "headline": "Buni approves recruitment of 54 new Nurses",
    "summarized_story": "Kindly Share This Story:By Ndahi Marama, DamaturuYobe state Governor, Hon Mai Mala Buni, has on Thursday approved the recruitment of 54 nurses additional to boost the staff requirement of medical facilities in the state.\nGovernor Buni while giving the approval, directed that only qualified nurses should be employed to provide services in the health institutions.\nHe said nurses who graduated from the Shehu Sule College of Nursing and Midwifery in 2020 will be accorded priority.\n“This became necessary following the establishment, expansion and upgrading of more health institutions across the state by the present administration”.\nHe urged the potential employees to be dedicated to duty and responsibilities assigned to them when absorbed into the state civil service."
  },
  {
    "headline": "Gov Emmanuel vows to fulfill campaign promises to riverine communities",
    "summarized_story": "Kindly Share This Story:By Chioma Onuegbu, UyoGovernor Udom Emmanuel of Akwa Ibom State has vowed to fulfill his campaign promise of transforming the riverine communities in the state that have been neglected over the years.\nEmmanuel who spoke yesterday during the official flag-off of the Petrochemical plant and Fertilizer Production factory in the Eastern Obolo Local government area said the project was conceived in line with his vision and desire to change the fortunes of the riverine communities.\nThis will be the first major road construction project in the area by any state government.\n“And I urged the youth to channel any issue involving the project to my office.\nYou must give contractors all the needed support to ensure the completion of the road”."
  },
  {
    "headline": "Nigeria ‘ll know no peace unless…, Falana warns",
    "summarized_story": "Also, former President of the Nigeria Bar Association, Wole Olanipekun, SAN, has advocated true federalism, immediate reform in judicial system, among others.\nCondemning the rate of impunity in the country, Falana stressed, “Our country is ruled by rule of the rulers and not rule of law.\n“Therefore, for the constitutional amendment to be fruitful, for us to have genuine outputs from this meeting, peace must reign.\nBut unless we are prepared to make these provisions justiciable and enforceable, this country will know no peace.\n“We are submitting that the Child Rights Act enacted in 2003 be made applicable throughout Nigeria, we have to work it out."
  },
  {
    "headline": "We’re making conscious efforts to embrace emerging technologies ― FG",
    "summarized_story": "Kindly Share This Story:By Emmanuel ElebekeThe Minister of Science and Technology, Dr. Ogbonnaya Onu said that the Federal Government is making conscious and sustained efforts for Nigeria to be at the forefront of new and emerging technologies, saying that Nigeria should not be excluded from any branch of Science and Technology.\nDr. Onu made the remarks at the 2nd interactive forum with the State Commissioners In charge of Science and Technology in Abuja on Thursday.\nAccording to the Minister, “We have virtually concluded consultations with relevant stakeholders within the Ministries, Departments, and Agencies of the Federal Government as it concerns Nanotechnology.\nSince natural gas is the major feedstock for its production, this will increase the demand for natural gas and hence initially reduce and finally help stop gas flaring in the country”.\nOn his part, the Minister of State for Science and Technology, Barr."
  },
  {
    "headline": "NDDC Board: Southern Coalition backs protests, gives FG 48-hour ultimatum",
    "summarized_story": "A coalition of Southern Nigeria Youth groups has thrown its weight behind the ongoing protest in demand for the inauguration of the Niger-Delta Development Commission, NDDC, Board.\nDAILY POST reports that there has been a sustained protest by Niger-Delta youths against the non-inauguration of the NDDC Board.\nTension was added to the development with the abduction of the National President of Ijaw Youth Council, Com.\nIn a statement on Thursday signed by Aare Barr Oladotun Hassan, President, Coalition of Southern Groups/Global President, Yoruba Council of Youths Worldwide and Mazi Okwu Nnabuike,Secretary General, Coalition of Southern Groups/President General, Ohaneze Ndigbo Youth Council Worldwide, they gave the Federal Government a 48-hour ultimatum to inaugurate the board.\n“We commend the Southern Governors’ Forum’s efforts so far, but insist on a dialogue date with Mr President targeted at resolving all aforementioned resolutions with the Federal Government rather than the ongoing media feuds.”"
  },
  {
    "headline": "Constitution review: Group canvases creation of 37 Senate, 72 Reps seats for women",
    "summarized_story": "A group of women from Plateau, Nasarawa and Benue States under the umbrella of Women Political Participation Technical Working Group (WPP-TWG) have advocated for the creation of 37 more senatorial seats and 72 more seats in the House of Representatives in the country that will be exclusively occupied by women.\nThe Women Group added that it supports the proposed amendment of the constitution and called for a special place for women in governance.\nThe group made its position known after submitting a memorandum to the Senate Committee for the review of the 1999 Constitution at the North-Central Public Hearing in Jos, the Plateau State Capital.\nGoyit maintained that women are advocating for additional 37 seats specially for women and bring the total number of senators to 146 instead of 109.\nThe Spokesperson further stated that the temporary, but necessary positive measures will enhance inclusive governance that women earnestly yearn for."
  },
  {
    "headline": "Bororo herders chased out of Ojoku-Ikotun communities in Kwara",
    "summarized_story": "A band of Bororo herders with thousands of cows from Iseyin, in Oyo state, who tried to enter Ojoku-Ikotun axis of Oyun Local Government Area of Kwara state, have been chased out of the communities.\nThe timely intervention of the Nigeria Security and Civil Defence Corps, brought the situation under control, DAILY POST gathered.\nOur correspondent gathered that the Bororo herders family with their cattle, arrived from Oyo state in the early hours of Thursday into the town.\nHowever, armed personnel of the NSCDC squad from Offa, accosted them at Igbowere in Offa Local Government Area and interacted with their leader, Alhaji Muhammadu.\n“All the youths in Ojoku, Igbawere and local hunters with the presence of the civil defence corps armed squad, were there to see them move to their destination,” Afolabi added."
  },
  {
    "headline": "Gov. Ugwuanyi rewards Enugu-born winner of SDGs’ national mathematics competition",
    "summarized_story": "Governor Ifeanyi Ugwuanyi of Enugu State, on Wednesday, rewarded winner of the 2020 edition of the Sustainable Development Goals’ (SDGs’) national mathematics competition for girls, Miss Chinwe Mary Blessing Onodagu.\nUgwuanyi congratulated her for making Enugu State proud, describing her “a special gift and blessing from God”.\nThe Governor equally announced that his administration will pay the girl’s school fees till she graduates from the college.\nPresent at the event were the Executive Secretary, Enugu State Scholarship and Education Loans Board (ESSELB), Barr.\nLevi Uche Abonyi, the Director/Principal of the school, Dr. (Mrs.) C. A. Ogar, and the girl’s parents, Engr."
  },
  {
    "headline": "Mentorship: Seven Enugu youths head to US for scholarship studies",
    "summarized_story": "Ugwuanyi at the Government House, Enugu, Dr. Kelechi Ugwuanyi, on behalf of the Council of Mentors, Enugu State Scholarship and Education Loans Board, disclosed that the seven successful candidates in the pilot work are scheduled to commence their studies in the United States of America in August 2021.\nUgwuanyi for the mentorship programme, stressing that “our intention is to raise a group of youths that will take over the leadership of the state in the next twenty years”.\nOne of the Mentees, Nnamdi Christian Okey, observed that “through this robust mentorship programme of the Enugu State Scholarship Board, I was able to secure admission to go to a top ranking university in the US.\nUgwuanyi thanked God for the feat and expressed his administration’s support and confidence in the mentorship programme and repositioning agenda of the new leadership of the ESSELB, led by Barr.\nHe congratulated the seven successful candidates and urged them to make Enugu State proud and make themselves available to change their lives, families and the society, positively."
  },
  {
    "headline": "Healthcare workers to get enhanced hazard allowance soon — Ngige",
    "summarized_story": "Agency ReporterWorkers in the Nigerian healthcare sector will begin to earn improved hazard allowance soon, according to the Minister of Labour and Employment, Dr Chris Ngige.\nNgige gave the assurance while speaking at the 41st Ordinary General Meeting of the National Association of Resident Doctors (NARD) in Awka on Thursday.\nHe said series of meetings had been held on the upward review of health workers’ hazard allowance and that discussions had reached an advanced stage.\nNgige, who is a medical doctor, commended resident doctors for their contributions to the nation’s health sector while urging them to tow the path of dialogue in resolving any industrial issue.\n“Poor Remuneration, Poor Health Institutions has been the strong reasons for migrations and this has further weakened our resolve to stand firm for our citizens."
  },
  {
    "headline": "APC sets agenda for new COAS",
    "summarized_story": "By Jide Orintunsin – AbujaThe ruling All Progressives Congress (APC) has set agenda for the newly appointed Chief of Army Staff (COAS), Major General Farouk Yahaya.\nAPC Secretary Caretaker Extra-Ordinary Convention Planning Committee (CECPC), Senator John James Akpanduoehehe, in a statement in Abuja on Thursday, urged the new Army Chief to consolidate on the successes recorded by the military in tackling all security threats.\nThe party said: “This could be achieved and deepened sustainably through increased collaboration among the security services and communities.\nADVERTISEMENTIt maintained “the success of the military is our collective success as a party and nation.\n“The APC as an institution congratulates the new Chief of Army Staff and wish him success in his new, important and strategic national assignment.”"
  },
  {
    "headline": "PFN warns against proposed Sharia laws in S/W",
    "summarized_story": "By Our ReporterThe Pentecostal Fellowship of Nigeria (PFN) has warned against alleged subterranean moves by some groups to introduce Sharia Law in the South West through the ongoing constitutional review by the Senate.\nIt warned the Senate not to succumb to such agitations capable of further plunging the country into a major religious crisis.\nSharia Law is alien to our culture of religious existence in the South-West.\nIntroduction of such law to the South West, the PFN warned would pitch Christians against their Muslim counterparts.\nWe shall resist this by every legal means at our disposal“Without the Sharia, we have always lived peacefully with our Muslim brothers."
  },
  {
    "headline": "Polytechnic students threaten to disrupt flights at Abuja Airport",
    "summarized_story": "By Frank Ikpefan, AbujaThe National Association of Polytechnic Students (NAPS) has vowed to disrupt domestic and international flights at the Nnamdi Azikiwe International Airport, Abuja from Monday if the Federal Government fails to reach an agreement with the Academic Staff Union of Polytechnic Staff (ASUP).\nThe students, who demanded the immediate reopening of Polytechnics, also called for immediate negotiation to end the lingering strike by ASUP.\nThe angry students, who barricaded the entrance of the Federal Ministry of Education, carrying placards with various inscriptions, urged the Federal Government to listen to their lecturers.\nThe protesting students were received by officials of the ministry led by the Minister of State for Education, Emeka Nwajiuba.\nThe Minister said the onus lied with the union to be fair on the students by calling off the strike."
  },
  {
    "headline": "Seven things you need to know about new Army Chief",
    "summarized_story": "The new Chief of Army Staff (COAS), Major General Faruk Yahaya was born on January 5,..."
  },
  {
    "headline": "INEC urges security agencies to curb attacks on its facilities",
    "summarized_story": "From Romanus Ugwu, AbujaThe Independent National Electoral Commission (INEC) met on Thursday with security formations in the country, urging them to put an end continued attacks on its facilities nationwide.\nThe Commission warned that the attacks will disrupt the electoral process, undermine Nigerian democracy and destabilise the country.\nINEC Chairman Prof Mahmood Yakubu issued the warning in Abuja during the emergency meeting with the Inter-Agency Consultative Committee on Election Security (ICCES).\nIn the last two years, the Commission has recorded a total of 41 incidents involving deliberate attacks on the Commission’s facilities,’ the INEC Chairman stated.\nIndeed, these attacks on the Commission’s facilities should now be treated as a national security emergency."
  },
  {
    "headline": "BREAKING: Buhari appoints Yahaya new Chief of Army Staff",
    "summarized_story": "From Molly Kilete, AbujaPresident Muhammadu Buhari has appointed Major General Farouk Yahaya as the new Chief of Army Staff (CAOS).\nYahaya, who until his appointment was the Theatre Commander of Operation HADIN KAI, replaces Lieutenant General Ibrahim Attahiru who died in a NAF plane crash in Kaduna State alongside ten senior officers and crew members.\nThe Acting Director, Defence information, Brigadier General Onyema Nwachukwu, made the announcement in a statement on Thursday.\nThe statement reads:"
  },
  {
    "headline": "Constitution review public hearing: Senate gets requests for state police, power devolution, new state in S’East",
    "summarized_story": "“We need to have federal, state and community police, with each granted sufficient powers to make them effective in securing the areas assigned to them and cooperating closely with each other.\n•State police, additional states dominate S’East constitution reviewThe public hearing on the review of the 1999 Constitution which kicked off in Owerri, Imo State, yesterday, was dominated by popular agitations for State policing and creation of another State in South East.\n“The truth is that there is no way the National Assembly can amend the 1999 constitution to cure the inherent defects in the 1999 constitution.\nOr can we, by way of amendment, change the Judicial powers of the President under the 1999 constitution?\nIt is a well-known fact that everything about the 1999 constitution is wound around the Presidential system of government."
  },
  {
    "headline": "NPO proffers way forward for Nigeria",
    "summarized_story": "It said the country’s resources hold innumerable economic and soft power advantages for the well being of the entire population if well managed.\nThese positions are contained in a communique jointly signed today by Kabiru A. Yusuf, President NPAN and President NPO; Mustapha Isa, President of NGE and Chris Isiguzo, President of NUJ after the end of its recent meeting in Abuja.\nSaid the NPO: “A Federal system of government, particularly in a country like Nigeria which is an overbearing centre is counterproductive to the development of the centre itself and the component units.\nHowever, the current borrowing in the face of the slide in the value of the country’s number one revenue earner-oil remains worrisome,” NPO said.\n“Today, criminality – kidnapping for ransom, banditry, arson, killings – defines the everyday reality for a good number of our citizens.”"
  },
  {
    "headline": "Breaking: Buhari Appoints Maj Gen Farouk Yahaya as New Army Chief",
    "summarized_story": "By Kingsley NwezehPresident Muhammadu Buhari has appointed Major General Farouk Yahaya as the new Chief of Army Staff.\nA statement issued by Defence Headquarters (DHQ) said Yahaya was General Officer Commanding 1 Division of the Nigerian Army.\nThe statement signed by Defence Spokesman, Brigadier-General Onyema Nwachukwu, said the new army chief was the current Theatre Commander, Operation Hadin Kai, formerly Lafiya Dole.\n“The Commander-in-Chief of the Armed Forces of the Federal Republic of Nigeria, President Mohammadu Buhari has appointed Major General Farouk Yahaya as the new Chief of Army Staff.\n“Prior to his appointment, Major General Yahaya was the General Officer Commanding 1 Division of the Nigerian Army and the incumbent Theatre Commander of the Counter Terrorism Counter Insurgency military outfit in the North East, code named Operation Hadin Kai”, it said."
  },
  {
    "headline": "NNPC Seeks to Acquire 20% Stake in Dangote Refinery",
    "summarized_story": "Yakubu said discussions were already ongoing with the Dangote Group for the acquisition of the stake.\nHe said: “We have what we call the green field refinery and the Greenfield Refining Projects Division (GRPD) of the NNPC.\n“At the moment, we have Dangote Refinery, which is the 650,000 capacity barrels per day plus a mini 80,000 tonnes per annum petrochemical plant.\nI can tell you today that we are seeking to have a 20 per cent minority stake in Dangote Refinery as part of our collaboration and you know that there’s a huge quantity of crude for that refinery.\nHe added that the agency would rather want more royalties than penalties as a business enabler and a revenue generator."
  },
  {
    "headline": "Buhari Mourns as 158 Feared Dead in Kebbi Boat Mishap",
    "summarized_story": "In Sokoto, Governor Aminu Tambuwal yesterday confirmed 22 persons killed by bandits in Rabah Local Government Area of the state.\nThe boat, conveying about 180 passengers from Niger State to Kebbi State, sank in the Niger River.\nTHISDAY gathered that as at 6.30 pm yesterday, only 22 passengers had been rescued while four corpses had been recovered.\nThe Administrative Head of Ngaski District in Kebbi State, Mr. Abdullahi Wara, said only 22 survivors and one corpse were found.\nIn separate attacks on Sunday and Tuesday, the bandits killed 22 people, including a village head."
  },
  {
    "headline": "Breaking: Over 100 Feared Dead in Boat Mishap",
    "summarized_story": "By Laleye DipoTragedy struck on Wednesday when a boat conveying over 180 passengers capsized with over 100 of the passengers feared dead.\nThe boat was said to have taken off from Loko mina in Niger state at about 7.30am Wednesday and was heading to a market in Kebbi state.\nIt was learnt that the cause of the accident was the overloading of the boat and its old age.\nThe Director General of the Niger State Emergency Management Agency (NSEMA), Alhaji Ibrahim Ahmed Inga, confirmed the incident.\nEyewitnesses had claimed that in that accident too, the boat was overloaded, carrying no less than 100 passengers as against 30 that it was supposed to ferry."
  },
  {
    "headline": "Nnamani Condemns Burning of Police Stations, INEC Offices, Calls for Dialogue",
    "summarized_story": "By Deji Elumoye and Udora OrizuA member of the National Assembly, Senator Chimaroke Nnamani has condemned the invasion and burning of police and Independent National Electoral Commission (INEC) facilities in the South East geo-political zone.\nThe former governor of Enugu state reminded aggrieved Nigerians that there were many channels including the courts or even the National Assembly to address any injustices or misgivings instead of resort to violence.\nHe enjoined government to be receptive and open to dialogue with the citizens in order to address the challenges of insecurity bedeviling the nation.\nNnamani said, ”This trend is capable of alienating us from the rest of Nigeria.\nLet us apply caution in the struggle to achieve what we deserve in this community called Nigeria.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Kaduna Is Most Dangerous State In Nigeria, CML’s Life Count Shows",
    "summarized_story": "While killings by herdsmen are not dominating the headlines, the Life Count data recorded about 29 raids, which led to 148 deaths.\nThe majority of the deaths carried out by herdsmen as collated by Life Count, were from Kaduna – 63 not from Benue – 26.\nThe most fatal of the 185 incidents reported though, was the 250 deaths recorded when the police took on the well-fortified bandit headquarters in Birnin Gwari in Kaduna.\nAlthough this month had the lowest number of recorded deaths according to the CML Life Count data, it would be remembered for three attacks.\nBandits invaded a village in Katsina State, killing 34 and carting away as much foodstuff as their 200 motorcycle cavalcade could carry."
  },
  {
    "headline": "Kaduna Is Most Dangerous State In Nigeria, CML’s Life Count Shows",
    "summarized_story": "While killings by herdsmen are not dominating the headlines, the Life Count data recorded about 29 raids, which led to 148 deaths.\nThe majority of the deaths carried out by herdsmen as collated by Life Count, were from Kaduna – 63 not from Benue – 26.\nThe most fatal of the 185 incidents reported though, was the 250 deaths recorded when the police took on the well-fortified bandit headquarters in Birnin Gwari in Kaduna.\nAlthough this month had the lowest number of recorded deaths according to the CML Life Count data, it would be remembered for three attacks.\nBandits invaded a village in Katsina State, killing 34 and carting away as much foodstuff as their 200 motorcycle cavalcade could carry."
  },
  {
    "headline": "Kaduna Is Most Dangerous State In Nigeria, CML’s Life Count Shows",
    "summarized_story": "While killings by herdsmen are not dominating the headlines, the Life Count data recorded about 29 raids, which led to 148 deaths.\nThe majority of the deaths carried out by herdsmen as collated by Life Count, were from Kaduna – 63 not from Benue – 26.\nThe most fatal of the 185 incidents reported though, was the 250 deaths recorded when the police took on the well-fortified bandit headquarters in Birnin Gwari in Kaduna.\nAlthough this month had the lowest number of recorded deaths according to the CML Life Count data, it would be remembered for three attacks.\nBandits invaded a village in Katsina State, killing 34 and carting away as much foodstuff as their 200 motorcycle cavalcade could carry."
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Attorney General, Malami, Covers Up Fraud, Orders Security Agencies To Stop Investigating Financial Scandal In NIRSAL",
    "summarized_story": "SaharaReporters has done series of exclusive stories on how MD of NIRSAL, Aliyu Abduhalmeed, has been siphoning the agency's money.\nAGF MalamiHowever, it has now been discovered that the AGF is frustrating the probe of the fraud and has ordered security agencies to stop the investigation.\nThe Economic and Financial Crimes Commission, Independent Corrupt Practices and other related offences Commission, the State Security Service and Nigeria Intelligence Financial Unit are all to stop investigating the fraud within NIRSAL, the AGF instructed.\n\"All other agencies investigating the matter are to stay further action to allow your office total control of the investigation.\"\nSee Also Corruption EXPOSED: How Managing Director Of NIRSAL, Aliyu Abdulhameed, Diverted Almost N1bn To Bank Account Of Agency's Head Of FinanceDOCUMENT: Nigeria's Attorney General, Malami, Covers Up Fraud, Orders Security Agencies To Stop Investigati... by Sahara Reporters on ScribdSee Also Corruption Top Controversial Cases Taken Over By Nigeria’s Attorney General, Malami, And How They Ended"
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Attorney General, Malami, Covers Up Fraud, Orders Security Agencies To Stop Investigating Financial Scandal In NIRSAL",
    "summarized_story": "SaharaReporters has done series of exclusive stories on how MD of NIRSAL, Aliyu Abduhalmeed, has been siphoning the agency's money.\nAGF MalamiHowever, it has now been discovered that the AGF is frustrating the probe of the fraud and has ordered security agencies to stop the investigation.\nThe Economic and Financial Crimes Commission, Independent Corrupt Practices and other related offences Commission, the State Security Service and Nigeria Intelligence Financial Unit are all to stop investigating the fraud within NIRSAL, the AGF instructed.\n\"All other agencies investigating the matter are to stay further action to allow your office total control of the investigation.\"\nSee Also Corruption EXPOSED: How Managing Director Of NIRSAL, Aliyu Abdulhameed, Diverted Almost N1bn To Bank Account Of Agency's Head Of FinanceDOCUMENT: Nigeria's Attorney General, Malami, Covers Up Fraud, Orders Security Agencies To Stop Investigati... by Sahara Reporters on ScribdSee Also Corruption Top Controversial Cases Taken Over By Nigeria’s Attorney General, Malami, And How They Ended"
  },
  {
    "headline": "Police: Over 1,000 high-profile suspects arrested in one month",
    "summarized_story": "The Nigeria Police Force (NPF) says it has arrested more than 1,000 high-profile suspects for their alleged involvement in various violent crimes across the country.\nAdvertisementUsman Baba, acting inspector-general of police, disclosed this at a media briefing held at the presidential villa on Thursday.\nOn April 6, Baba was appointed by President Muhammadu Buhari as the acting IGP to replace Mohammed Adamu, the former IGP.\nHighlighting the achievements by the police so far, the acting IGP said the suspects were arrested between April and May 2021.\nThe IGP added that the list of suspects included those allegedly involved in the attack on the convoy of Samuel Ortom, governor of Benue state."
  },
  {
    "headline": "Police: Over 1,000 high-profile suspects arrested in one month",
    "summarized_story": "The Nigeria Police Force (NPF) says it has arrested more than 1,000 high-profile suspects for their alleged involvement in various violent crimes across the country.\nAdvertisementUsman Baba, acting inspector-general of police, disclosed this at a media briefing held at the presidential villa on Thursday.\nOn April 6, Baba was appointed by President Muhammadu Buhari as the acting IGP to replace Mohammed Adamu, the former IGP.\nHighlighting the achievements by the police so far, the acting IGP said the suspects were arrested between April and May 2021.\nThe IGP added that the list of suspects included those allegedly involved in the attack on the convoy of Samuel Ortom, governor of Benue state."
  },
  {
    "headline": "Falana: Parts of Nigeria experiencing civil war... 2023 elections in jeopardy",
    "summarized_story": "Femi Falana, human rights lawyer, says the 2023 general elections could be jeopardised because some parts of the country are experiencing what he described as civil war.\nAdvertisementThe senior advocate of Nigeria (SAN) said this on Thursday while speaking at the south-west constitution review public hearing in Lagos.\nFalana said Nigeria is on the brink of collapse and asked the ruling class to advise President Muhammadu Buhari on what he must do to “quickly reclaim this country”.\nFalana said there must be peace and stability in the country for the ongoing constitutional amendment to be meaningful.\nIn fact, in some parts of the country, the 2023 elections are already in jeopardy,” he said."
  },
  {
    "headline": "Falana: Parts of Nigeria experiencing civil war... 2023 elections in jeopardy",
    "summarized_story": "Femi Falana, human rights lawyer, says the 2023 general elections could be jeopardised because some parts of the country are experiencing what he described as civil war.\nAdvertisementThe senior advocate of Nigeria (SAN) said this on Thursday while speaking at the south-west constitution review public hearing in Lagos.\nFalana said Nigeria is on the brink of collapse and asked the ruling class to advise President Muhammadu Buhari on what he must do to “quickly reclaim this country”.\nFalana said there must be peace and stability in the country for the ongoing constitutional amendment to be meaningful.\nIn fact, in some parts of the country, the 2023 elections are already in jeopardy,” he said."
  },
  {
    "headline": "PROFILE: Yahaya, the new army chief who killed ‘over 2,000 insurgents’ in war against Boko Haram",
    "summarized_story": "When Farouk Yahaya was moved from the Nigerian army 1 division in Kaduna state to oversee the wars against Boko Haram in the north-east, he pledged to ensure “total peace and sanity” in the troubled region.\nAdvertisementData obtained from the Council on Foreign Relations show that from April 1 when the major general took charge of the war against Boko Haram, till Thursday when he was named Nigeria’s chief of army staff, the number of civilians killed by insurgents dropped by 17 percent, while the number of Boko Haram members killed shot up by 46 percent.\nNIGERIAN ARMY’S OLIVER TWISTIn his various roles in the Nigerian army, Yahaya has often demanded more from the personnel under his watch.\nYou must conduct yourselves well and be professional in the discharge of your duties.”On February 5, when more than 50 Boko Haram insurgents were reportedly killed, Yahaya told the troops not to back down as ‘the party’ was just getting started.\nAdvertisementSPEAKS SPANISH, LOVES CRACKING JOKESThe incoming army chief, who is from Sokoto state, is aged 55 and is of the 37 regular course of the Nigerian army."
  },
  {
    "headline": "How can you make your company hack-proof? These five experts know.",
    "summarized_story": "Adeoluwa, Daniel, Joseph, Sophina and Nick will be discussing how you can protect your organization and customers from online fraud.\nAdeoluwa is a skilled Information Security Professional.\nHe is responsible for building the backend infrastructure, driving product roadmap, leading the technical team and driving company strategy.\nSophina is a cybersecurity professional currently working with a leading financial services firm.\nHe has over 13 years experience in the technology industry and has worked for multinational, leading technology companies."
  },
  {
    "headline": "GovTech In Nigeria: From Regulatory Maze to Models of Good Practice",
    "summarized_story": "Nigerian public procurement and regulation can be labyrinthine, but recent policy reforms and the model of good practice provided by Kaduna State hint at opportunities for public-purpose innovation to flourish in the country.\nIt has also mandated Nigerian companies with large public sector IT contracts to engage Nigerian startups as R&D partners on the projects.\nBut the Federal Government need not look far for inspiration; it can take a page out of the Kaduna State Government (KDSG)’s Govtech playbook.\nAccording to the World Bank’s latest subnational Doing Business ratings, Kaduna is the most accessible state to register property and get contracts enforced in Nigeria.\nKaduna’s example is an exciting preview of what could be should the Federal Government follow through on a promising start."
  },
  {
    "headline": "OPay in talks to raise $400 million from investors at $1.5bn valuation to finance expansion plans",
    "summarized_story": "OPay is reportedly in talks to raise $400 million from investors at a valuation of $1.5 billion, according to an exclusive report from The Information.\nOPay is looking to raise funding to finance its expansion plan, having launched in Egypt this year.\nAn Africa-focused company with Chinese backersWhile OPay is based in Nigeria, its backers are mostly Chinese companies like Meituan, a multi-billion-dollar Chinese shopping platform.\nIn July 2019, OPay raised $50 million from Sequoia Capital, IDG Capital, Source Code, GSR Ventures and Meituan-Dianping.\nYet, should they successfully raise $400 million, it will be the kind of war chest that makes anything possible."
  },
  {
    "headline": "Brand Africa Ranks TECNO 6th on the Most Admired brands in Africa List",
    "summarized_story": "– In the recently released Africa’s Best Brands 2021, TECNO ranked for five consecutive years among the TOP 6 brands on the African continent, marking another prestigious recognition of the brand’s leadership in Africa.\nEstablished in 2011, the Brand Africa 100: Africa’s Best Brands rankings is the most authoritative survey and analysis on brands and underlying businesses in Africa, based on a study by Geopoll across 28 countries spanning all the five economic regions and analysis and ranking by Kantar and Brand Leadership.\nThe 2021 survey was conducted between March and April 2021 and yielded over 80,000 brand mentions and over 3,500 unique brands.\nWhen TECNO launched dual SIM cards in Africa, there had been nothing of the kind before then.\nAnd now, with Brand Africa’s new rankings, TECNO has once again come out tops, becoming a leading player in mid to high-end mobile brand segments in Africa."
  },
  {
    "headline": "How OctaFX became the first financial company in Nigeria to organise a cooking session for Ramadan",
    "summarized_story": "OctaFX brought two popular bloggers together in a cooking studio: the comedian Apaokagi Maryam and the music video director Abdulazeez Greene.\nThey prepared a special evening meal for Ramadan called Iftar and compared the subtleties of cooking with those ingrained in trading.\n‘Ramadan Special’ is the first cooking show in Nigeria produced by a financial company.\nApaokagi Maryam is a frequent collaborator of the global Forex broker and took part in the last OctaFX Goal Booster promotion.\nThe company is aspiring to create more shows like ‘Ramadan Special’ in the future."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "What’s the fate of Nigerian fintech following banking regulator’s fresh regulations?",
    "summarized_story": "The new requirements apply to companies registered with the Corporate Affairs Commission (CAC) and wish to apply for new licences or renew old ones.\nThese requirements relate to licences for Switching and Processing, Mobile Money Operators (MMOs), Payment Solution Services (PSSs), Super Agent, Payment Solution Service Providers (PSSPs), and Payment Terminal Service Providers (PTSPs).\nSwitching and Processing, PSSPs, PTSPs, and Super Agent (super licence) — no longer apply: ₦3 billion reduction in minimum SHF, ₦1,900,000 reduction in application fees.\nMMOs, Non-Bank Merchant Acquiring, and Super Agent (standard licence) — no longer apply: ₦1 billion reduction in minimum SHF, ₦900,000 reduction in application fees.\nPSSPs, PTSPs, and Super Agent (basic licence) — no longer apply: no change in minimum SHF, no change in application fees."
  },
  {
    "headline": "What’s the fate of Nigerian fintech following banking regulator’s fresh regulations?",
    "summarized_story": "The new requirements apply to companies registered with the Corporate Affairs Commission (CAC) and wish to apply for new licences or renew old ones.\nThese requirements relate to licences for Switching and Processing, Mobile Money Operators (MMOs), Payment Solution Services (PSSs), Super Agent, Payment Solution Service Providers (PSSPs), and Payment Terminal Service Providers (PTSPs).\nSwitching and Processing, PSSPs, PTSPs, and Super Agent (super licence) — no longer apply: ₦3 billion reduction in minimum SHF, ₦1,900,000 reduction in application fees.\nMMOs, Non-Bank Merchant Acquiring, and Super Agent (standard licence) — no longer apply: ₦1 billion reduction in minimum SHF, ₦900,000 reduction in application fees.\nPSSPs, PTSPs, and Super Agent (basic licence) — no longer apply: no change in minimum SHF, no change in application fees."
  },
  {
    "headline": "These 11 startups are preparing African kids for the future",
    "summarized_story": "According to the UNESCO Institute of Statistics, one in five children between the ages of 6 and 11 are out of school.\nNine million African girls between the ages of 6 and 11 will never go to school compared to 6 million African boys.\nListed in no particular order below are 11 randomly selected edtech startups you should check out.\neLimuThe Kenyan edtech startup’s name means education in Swahili, and it creates educational apps and content for students in primary school.\nTo ensure that the students also have the interaction that occurs in regular schools, the school takes students on monthly educational field trips."
  },
  {
    "headline": "These 11 startups are preparing African kids for the future",
    "summarized_story": "According to the UNESCO Institute of Statistics, one in five children between the ages of 6 and 11 are out of school.\nNine million African girls between the ages of 6 and 11 will never go to school compared to 6 million African boys.\nListed in no particular order below are 11 randomly selected edtech startups you should check out.\neLimuThe Kenyan edtech startup’s name means education in Swahili, and it creates educational apps and content for students in primary school.\nTo ensure that the students also have the interaction that occurs in regular schools, the school takes students on monthly educational field trips."
  },
  {
    "headline": "Optimism over economic recovery despite weak numbers",
    "summarized_story": "The last few days have brought to the fore three weak numbers that have pointed to the recovery of the Nigerian economy, which sluggishly exited recession in the fourth quarter of 2020.\nStarting from the latest, these numbers include the Manufacturing Purchasing Managers’ Index (PMI), which grew to 49.0 index points in April 2021 from…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Energy-poor Africa makes case against exiting oil",
    "summarized_story": "As opposition to fossil fuel mounts in Western countries, African experts are standing up against efforts by Western countries to curb crude oil production as a way to protect the environment.\nThe International Energy Agency (IEA), a Paris-based think tank that advises Western countries on their energy policies, on May 18 released a roadmap outlining…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "High input costs, insecurity, climate change take toll on food prices",
    "summarized_story": "The high cost of farm inputs, insecurity, and climate change are responsible for rising food prices in Africa’s most populous country, making it increasingly hard for Nigerian households to buy tomatoes, rice, beans, and other staple foods.\nInput prices ranging from improved seeds, fertilizers, herbicides, pesticides, and poultry feeds are high as a result of…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "EDSG pledges to pay outstanding emoluments of AAU Staff – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEKPOMA – Edo State Government has pledged to pay the emoluments, including Cheque off dues of the striking workers of the Ambrose Alli University, (AAU), Ekpoma, Edo State, as soon as they return back to work.\nHe declared that the vision of the state governor, Mr. Godwin Obaseki was to reposition the university, and address the issues militating against the progress of the state owned institution.\nHe solicited the support of the monarch and his community, promising the traditional ruler that he would not disappoint him.\n“I have no issue with with the decision of governor, since the decision is to move the university forward.\nThough the university in Ekpoma, it is a state owned university”, the monarch said."
  },
  {
    "headline": "Appeal Court upholds Tribunal’s ruling on Obaseki’s guber poll victory, throws out ADP, APP’s suit …slams appellant with 1.2m fine – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Court of Appeal, sitting in Benin, on Wednesday, upheld the ruling of the Edo State Governorship Election Petition Tribunal against the Action Democratic Party (ADP), reaffirming the victory of Governor Godwin Obaseki at the 2020 governorship election.\nThe Appeal Court, delivering the judgement in the case marked CA/B/EPT/GOV/01 & 1A/2021 Action Democratic Party & Anor v. INEC & 2Ors, held that Obaseki did not forge his certificates with which he contested the 2020 governorship election, dismissing the appeal filed by the ADP and its candidate.\nDelivering the judgement in favour of the governor, the Presiding Justice, Hon.\nJustice M.A.\nOwoade, dismissed the main appeal, the preliminary objection and the cross appeal."
  },
  {
    "headline": "Obaseki hails Judiciary, as Appeal Court upholds Tribunal ruling – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has praised the verdict of the Court of Appeal, Benin City, upholding the ruling of the Edo State Governorship Election Petition Tribunal, describing it as “another victory for Edo people.”In a statement, the governor said the verdict of the Court of Appeal is a testament to the fairness and equity of the Judiciary.\nHe noted, “The verdict of the Court of Appeal, Benin City, upholding the ruling of the Edo State Governorship Election Petition Tribunal is another victory for Edo people and a testament to the fairness and equity of the Judiciary.\n“The Judiciary has again ensured that the will of the people is not suppressed and the mandate they freely gave is not hijacked.\nThey have robustly demonstrated the truism that the Judiciary is indeed the last hope of the common man.”Obaseki added, “We count on the judiciary to, as they have done today, continue to uphold the voice and the will of the people.\nWe appreciate the Peoples Democratic Party (PDP), for the support and shared vision to make Edo great again.”“We also appreciate His Excellency, President Muhammadu Buhari (GCFR) for ensuring a vibrant and fair Judiciary that upholds the will of the masses.”..."
  },
  {
    "headline": "How sacked AAU VC illegally promoted wife, other cronies against varsity rules – Panel – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestFindings by the Ambrose Alli University, Ekpoma, Special Visitation Panel have revealed how the immediate past Vice Chancellor of the institution, Prof. Ignatius Akhakhia Onimawo, wrongfully appointed and promoted his wife, Mrs. Janet Onimawo and other cronies, against the rules of the University.\nProf. Lawrence Atsegbua, who is a member of the panel, is also a Professor of Law at the University of Benin and a Senior Advocate of Nigeria (SAN).\nOthers on the panel are Mrs. M. E. Ohiowele, Roland Ogbebor, Dr. J. O. Okovido and Venerable Osaze Egbenusi, as members, with Mrs. P. E. Aziegbemhin, as Secretary.\n“These rankings should be backdated to the dates of first appointment, while the remuneration shortfalls occasioned by wrong rankings should be paid to the affected candidates in arrears.\n“The same must necessarily apply to all staff that benefitted from wrong placement at any point in time during the period covered by this Report.”..."
  },
  {
    "headline": "NBC suspends Human Rights Radio",
    "summarized_story": "ADVERTISEMENTThe National Broadcasting Commission (NBC) has suspended the Human Rights Radio for a clear violation of the broadcasting code.\nThe suspension will last for 30 days according to the commission.\nMs Susan was accused of burning her little niece’s hair whom she claimed is a witch.\nAfter a public outcry, Mr Isah on Wednesday morning during the show apologised to Nigerians for his violent reaction.\nHe was joined by several listeners some of whom called in to apologise on his behalf."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "LG leveraging on AI, Inverter Compressor to Deliver Next Generation of Premium ACs",
    "summarized_story": "In the residential air conditioners market, some of the products that the company has achieved remarkable innovation success are the ARTCOOL and DUALCOOL Premium Air Conditioners.\n“LG DUALCOOL Premium Air Conditioners are equipped with dual premium design and unique features such as Smart ThinQ, ice & custom cooling and energy saving.\nLG ARTCOOL product is equipped with sympathetic artificial intelligence which notifies the user of the driving mode that changes according to the situation without a customer’s question and tells the necessary information.\nCompared to general cooling of 10.8℃ in average, LG DUALCOOL Premium Air Conditioner blows 6.8℃ wind in average to provide instant cooling when it is turned on.\nLG Inverter ACs available in Nigeria today include ARTCOOL 2.0HP; DUALCOOL 1.5HP; ARTCOOL 1.5HP; DUALCOOL 2.0HP and many others."
  },
  {
    "headline": "Breaking: Buhari names Farouk Yahaya new Chief of Army Staff",
    "summarized_story": "OBINNA EZUGWUNigeria’s president, Muhammadu Buhari has appointed Major General Farouk Yahaya as the new Chief of Army Staff.\nHe replaces Lt General Ibrahim Attahiru, who died in an air crash last Friday.\nAmong other posts, Yahaya was the Theater Commander of Operation Lafiya Dole (OPLD) in Maiduguri.\nHe took over from Maj.-Gen. Olusegun Adeniyi, who was redeployed to the Nigerian Army Resource Centre as Senior Research Fellow.\nHe is from Sokoto State, North West Nigeria."
  },
  {
    "headline": "Seplat announces currency exchange rates for Q1 2021 interim dividend",
    "summarized_story": "Adebayo ObajemuSeplat Petroleum Development Company Plc, a leading Nigerian independent oil and gas company listed on both the Nigerian Exchange Limited and London Stock Exchange, has confirmed that the following currency exchange rates will be applicable in determining the interim dividend for Q1 2021 to any shareholder that qualifies for and has elected to receive the dividend payment in Naira or GBP:Exchange Rate1 USD = 410.29 Naira1 USD = 0.7062 GBPThe exchange rate for the Naira or Pound Sterling amounts payable was determined by reference to the exchange rates applicable to the US dollar available on 25th May 2021.\nThe date for dividend currency election to the Company’s Registrars is 2nd June 2021.\nIn the absence of a qualifying dividend currency election by shareholders to the appropriate Registrar, dividends will be paid in their default currency.\nShareholders should refer to the Company’s announcement on 29th April 2021 for definition of default currencies and dividend currency election forms can be found on the company website at https://seplatpetroleum.com/investors/dividend"
  },
  {
    "headline": "Osun govt presents N500m bond certificate to retirees",
    "summarized_story": "The Permanent Secretary, Local Government Staff Pension Bureau, Mr. Kayode Afolabi made this known while presenting the Bond Certificates to the beneficiaries under the Contributory Pension Scheme Programme of the state government of Osun.\nAddressing the beneficiaries, Mr Afolabi eulogized the state helmsman, Mr Adeboyega Oyetolas commitment to the welfare of pensioners and workers in the state.\nAccording to Mr Afolabi “the Contributory Pension Scheme was aimed at assisting civil servants to save towards their retirement.\nEarlier In her welcome address, the Director of Pension, Local Government Staff Pension Bureau, Mrs Motunrayo Ajayi appreciated God for giving the retirees the grace to be alive to receive their bond certificates.\nIt would be recalled that Governor Oyetola recently presented pension bond certificates to about 143 retirees drawn from both the State and Local government services."
  },
  {
    "headline": "Oil Magnate, Bashar, Bags American Varsity’s Honorary Degree",
    "summarized_story": "The American Heritage University of Southern California has nominated the chairman of Cradinal Airlines and Ultimate Oil and Gas, Alhaji Mas’ud Bashar, for Honorary Doctorate degree in Humanities.\nThis was contained in a letter dated May 25, 2021, addressed to Bashar and signed by the university’s Registrar, Dr. Fathiah Inserto.\nThe letter titled, ‘Approval of Nomination’ reads: “On behalf of the Governing Board of American Heritage University of Southern California (AHUSC), Rancho Cucamonga, California, United States of America, we wish to inform you that our nomination for the Doctor of Humanities (HOD) (Honoris Causa) has been approved to be offered on you.\n“Once you acknowledge receipt of this letter, you will receive more information regarding the conferment of the award as soon as possible.\nIt is expected that you honour the arched Endowment Pledge Note immediately.”"
  },
  {
    "headline": "Oil Magnate, Bashar, Bags American Varsity’s Honorary Degree",
    "summarized_story": "The American Heritage University of Southern California has nominated the chairman of Cradinal Airlines and Ultimate Oil and Gas, Alhaji Mas’ud Bashar, for Honorary Doctorate degree in Humanities.\nThis was contained in a letter dated May 25, 2021, addressed to Bashar and signed by the university’s Registrar, Dr. Fathiah Inserto.\nThe letter titled, ‘Approval of Nomination’ reads: “On behalf of the Governing Board of American Heritage University of Southern California (AHUSC), Rancho Cucamonga, California, United States of America, we wish to inform you that our nomination for the Doctor of Humanities (HOD) (Honoris Causa) has been approved to be offered on you.\n“Once you acknowledge receipt of this letter, you will receive more information regarding the conferment of the award as soon as possible.\nIt is expected that you honour the arched Endowment Pledge Note immediately.”"
  },
  {
    "headline": "CITAD Accuses Politicians Of Promoting Hate Speech",
    "summarized_story": "A non-governmental organisation, Centre for Information Technology and Development (CITAD), has accused some elite and politicians of engaging in the promotion of hate speech in the country.\nAccording to him, hate speech has made it impossible for communities to collectively rise up and confront the common challenges bedeviling the country.\n“Today, we would like to present to the public, two books recently published by Centre for Information Technology and Development (CITAD).\nThe first is titled, ‘The Compromised State: How Corruption Sustains Insecurity in Nigeria’ and the second one is ‘Context and Content In Hate Speech: Discourse In Nigeria,” he said.\nThe two books, he said, have identified how challenges posed by hate speech and corruption have badly affected the people at the same time suggesting solutions."
  },
  {
    "headline": "CITAD Accuses Politicians Of Promoting Hate Speech",
    "summarized_story": "A non-governmental organisation, Centre for Information Technology and Development (CITAD), has accused some elite and politicians of engaging in the promotion of hate speech in the country.\nAccording to him, hate speech has made it impossible for communities to collectively rise up and confront the common challenges bedeviling the country.\n“Today, we would like to present to the public, two books recently published by Centre for Information Technology and Development (CITAD).\nThe first is titled, ‘The Compromised State: How Corruption Sustains Insecurity in Nigeria’ and the second one is ‘Context and Content In Hate Speech: Discourse In Nigeria,” he said.\nThe two books, he said, have identified how challenges posed by hate speech and corruption have badly affected the people at the same time suggesting solutions."
  },
  {
    "headline": "The Challenge Of Policy Implementation For Health",
    "summarized_story": "One question that is repeatedly asked in health policy circles is, ‘What is responsible for the challenge with implementing nationwide health policies in Nigeria?’ The answer is mostly threepronged.\nSo, when policies are designed from the top-down with minimal input from states and launched, state and local government level implementation of such policies becomes severely challenged.\nTwenty years on, only few countries on the continent have reached or surpassed that target – countries like Rwanda, South Africa, Ethiopia, Gambia, Malawi.\nThe third but equally important challenge with policy implementation is limited continuity across political administrations.\nWith each government wanting to make its own mark, there is a consistent limited continuity of certain healthcare programmes across administrations."
  },
  {
    "headline": "A mildle man Defies Three Underaged Daughters — Daily Times Nigeria",
    "summarized_story": "Nkiru Nwagbo, AwkaA forty eight years old man was has been arrested yesterday by the Nigerian Security and Civil Defence Corps NSCDC in Anambra state for defying his three daughters.\nThomas from Ikolani in Igboetiti in Enugu state but resides in Engwu Ukwu in Anambra state claimed that he was drunk when he committed the acts.\nBut unfortunately, his neighbors who reported the incident to the Civil Defence Corps explained that it has been a steady act for the man.\nIgbo who hails from Ikoloani Igboetiti area of Enugu State claimed that he was under the influence of alcohol the day he slept with the daughter.\nOn the case of 28-year old Solomon Isaac, Billie said he was arrested for jumping in the premises of NSCDC state headquarters, Awka on May 24."
  },
  {
    "headline": "FG yet to remit £4.2m Ibori's loot to Delta State , Idris clarifies —",
    "summarized_story": "” For now, no money has been returned to Delta State,” he said.\nThe Delta State Government immediately reacted to the development on Wednesday and said that it has yet to receive the money.\n“For now, no money has been returned to Delta State,” he said.\nThe £4.2 million pounds was stolen by former Delta governor James Ibori associates and lodged in UK accounts.\nHe is back in Nigeria where he is actively involved in the politics of the Delta State as a kingmaker and godfather."
  },
  {
    "headline": "Ignore IPOB’s sit-at-home order, Imo govt. tells residents",
    "summarized_story": "Imo government on Thursday urged residents of the state to ignore a sit-at-home order by the proscribed Indigenous People of Biafra (IPOB) on May 29 and May 30.\nThe Commissioner for Information and Strategy of the state, Mr Declan Emelumba, said this while briefing newsmen in Owerri on Thursday.\n“Imo residents should disregard these messages as they have no consequence whatsoever.\nAccording to him, only criminals have something to worry about the security measures put in place in the state and innocent residents have nothing to fear.\n“Once again, government has not given any order for either the arrest or killing of innocent Imo youths."
  },
  {
    "headline": "Tears as Nollywood actress, Ify Onwuemene loses battle with cancer —",
    "summarized_story": "Ify Onwuemene, a Nollywood actress, died of cancer.\nIfy died on Tuesday after a long battle with endometrial cancer.\n“IFEY ONWUEMENE was diagnosed with endometrial cancer.\n“Ify spent more than N10m, being helped with donations by her fellow actors and other Nigerians.\n“IFEY has finally gone to rest, today 25th May 2021."
  },
  {
    "headline": "Buhari to Nigerian children: Our greatest legacy is to give you a better country",
    "summarized_story": "Buhari to Nigerian children: Our greatest legacy is to give you a better countryBuhari to Nigerian children: Our greatest legacy is to give you a better countryBy TANKO ALIPresident Muhammadu Buhari Thursday celebrated the Children’s Day with a solemn promise to bequeath a better country for the present and future generations.\nAs part of the activities to commemorate Children’s Day, observed on May 27, the President hosted a group of Nigerian children at the State House.\nThe short ceremony witnessed the cutting of a ‘national cake’, a guided tour of the President’s office, meeting rooms, banquet hall and the zoo at the Presidential Villa.\nDescribing children as precious blessings who should be nurtured to carry the burden of the society in the future, President Buhari, after spending a memorable time with his august visitors, bid them farewell, saying:“Bye-bye, see you next year.”Share this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Buhari to Nigerian children: Our greatest legacy is to give you a better country",
    "summarized_story": "Buhari to Nigerian children: Our greatest legacy is to give you a better countryBuhari to Nigerian children: Our greatest legacy is to give you a better countryBy TANKO ALIPresident Muhammadu Buhari Thursday celebrated the Children’s Day with a solemn promise to bequeath a better country for the present and future generations.\nAs part of the activities to commemorate Children’s Day, observed on May 27, the President hosted a group of Nigerian children at the State House.\nThe short ceremony witnessed the cutting of a ‘national cake’, a guided tour of the President’s office, meeting rooms, banquet hall and the zoo at the Presidential Villa.\nDescribing children as precious blessings who should be nurtured to carry the burden of the society in the future, President Buhari, after spending a memorable time with his august visitors, bid them farewell, saying:“Bye-bye, see you next year.”Share this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Opinion: Dave Umahi’s thesis – By FEMI ADESINA",
    "summarized_story": "Yes, the Governor of Ebonyi State pulls no punches whenever he decides to speak.\nIn recent times, police stations, offices of the Independent National Electoral Commission (INEC), and other Federal assets have come under attack in the South East.\nIf you cause problems in any part of the South East, Ebube Agu will deal with you, no matter who you are.”Ask Umahi what the South East really wants.\nIt is not predicated on the party zoning its presidential ticket to the South East.\nIf we are talking of justice, it is the turn of the South East."
  },
  {
    "headline": "Opinion: Dave Umahi’s thesis – By FEMI ADESINA",
    "summarized_story": "Yes, the Governor of Ebonyi State pulls no punches whenever he decides to speak.\nIn recent times, police stations, offices of the Independent National Electoral Commission (INEC), and other Federal assets have come under attack in the South East.\nIf you cause problems in any part of the South East, Ebube Agu will deal with you, no matter who you are.”Ask Umahi what the South East really wants.\nIt is not predicated on the party zoning its presidential ticket to the South East.\nIf we are talking of justice, it is the turn of the South East."
  },
  {
    "headline": "Huge crowd as Obasanjo hits Ibadan Chicks Market",
    "summarized_story": "By Kazeem UgbodagaFormer President, Chief Olusegun Obasanjo on Thursday, visited the Obasanjo Market, at Oluyole Estate, Ibadan, with a promise to assist in having better structure and government backing.\nThe visit at the Day Old chicks market recorded a massive turnouts of traders and buyers, who welcomed the former President amid pomp and ceremony.\nThe tour was conducted by Deacon Sunday Agusa, the General Manager of the Obasanjo Farms, Ibadan, located in the area.\nThe leader of the Day Old Chicks Merchant Association of Nigeria (DOCMAN), Olaiya Ogunmoyewa at the Obasanjo Day Old International Market, appreciated the coming of the former President, saying the visit had lessened their fears on the future of the market.\nHe said the Obasanjo had spoken their agitation “and we’re pleased with what you have told us."
  },
  {
    "headline": "3 years after, Skales links up with Davido for new song",
    "summarized_story": "By Taiwo OkanlawonNigerian singer and songwriter Raoul John Njeng-Njeng, better known as Skales has linked up with the DMW boss Davido to create a new song together.\nThe song titled, ‘This Your Body’ will be released on Friday.\n🔥Summer anthem featuring my brother @davido loaded up for this Friday,” Skales shared the news on his Instagram page.\nIn the past, they have collaborated on songs like ‘Always’ and ‘Currency.’The new song if released will be a new collaboration after three years they dropped “Currency”.\nThe track was produced by Spellz and the video was directed by Adasa for Square-ball Production."
  },
  {
    "headline": "Breaking: Jonathan secures release of detained Mali’s President Ndaw, Ouane",
    "summarized_story": "By Kazeem UgbodagaLeaders of Mali’s military have released interim president Bah Ndaw and Prime Minister Moctar Ouane from detention following intervention from former President Goodluck Jonathan who is the mediator of the Economic Community of West African States (ECOWAS) in Mali.\nThe mediator and his team had on Wednesday obtained the commitment of the military leaders to release Ndaw and Ouane, after visiting them at Kati Barracks, near Bamako where they were being held, to ascertain their health condition.\nThe release of President Ndaw and Prime Minister Ouane early Thursday morning came three days after they were detained and stripped of their powers, nine months after they were appointed to lead the transition government.\n“The interim president and prime minister were released overnight around 1.30am.\nThe development came a day after military officials said the country’s transitional president and prime minister had resigned while in detention."
  },
  {
    "headline": "Lai Mohammed: Nigeria In Safe Hands Despite Security Challenges",
    "summarized_story": "The Minister of Information and Culture, Alhaji Lai Mohammed, has assured Nigerians that in spite of the current security challenges,the country is in safe hands.\nHe appealed to Oba Ajakaiye to work with his fellow traditional rulers, as well as the Government of Ekiti State, to ensure peace and security in the state.\n”Putting the tourist sites on the national and global map will attract tourists, which will in turn boost the economy of not justIyin town but indeed the entire Ekiti State,” he said.\nHe stressed the need for the federal government to leverage on the tourism industry in its drive to diversify the economy away from oil.\nOba Ajakaiye used the occasion of his visit to invite the Minister to his forthcoming coronation as well as to visit the tourist sites atIyin-Ekiti – the two requests that were granted by the Minister.."
  },
  {
    "headline": "BREAKING: President Buhari Appoints New Chief Of Army Staff",
    "summarized_story": "The Commander in Chief of the Armed Forces of the Federal Republic of Nigeria, President Mohammadu Buhari has appointed Major General Farouk Yahaya as the new Chief of Army Staff.\nPrior to his appointment Major General Yahaya was the General Officer Commanding 1 Division of the Nigerian Army and the incumbent Theatre Commander of the Counter terrorism Counter Insurgency military outfit in the North East code named Operation HADIN KAI.\nPlease disseminate this information to the general public through your news medium.\nThank you for your cooperation.\nONYEMA NWACHUKWUBrigadier GeneralActing Director Defence Information27 May 2021"
  },
  {
    "headline": "Nigerians Attack Sen. Remi Tinubu For Calling Fellow Woman Thug (Video)",
    "summarized_story": "Senator Tinubu, who represents Lagos Central and is married to APC National Leader Bola Tinubu, stirred more controversy on Wednesday when she labelled a fellow lady a thug for shouting too loudly at the South West Constitutional Review Public Hearing.\nThe event, which took place at the Marriott Hotel in Lagos, was attended by a number of high-profile figures, including the Lagos State Governor, Senators, and other prominent South West figures.\nHowever, after some consultation with the personnel at the door, Tinubu showed up at the backdoor to allow the lawmakers in.\nSeeing this, the senator beckoned on her and two others, only to call the woman a “thug” for speaking too loud.\n“We don’t want thugs here,” the former Lagos State First Lady said."
  },
  {
    "headline": "Pictures: President Muhammadu Buhari receives Ghanian President, Nana Akufo-Addo",
    "summarized_story": ""
  },
  {
    "headline": "Pictures: See how President Muhammadu Buhari celebrated children’s day in Abuja",
    "summarized_story": "PreviousProfile of the new Chief of Army Staff, Maj.- Gen Faruk Yahaya"
  },
  {
    "headline": "Breaking: New Chief of Army Staff replaces late Attahiru",
    "summarized_story": "President Mohammadu Buhari has appointed Major General Farouk Yahaya as the new Chief of Army Staff.\nMajor General Yahaya replaces late Lt. Gen. Ibrahim Attahiru who died in a plane crash last Friday, a press statement by the acting Director Defence Information Brig.\nGeneral Onyema Nwachukwu has revealed on Thursday.\nThe statement further read, “Prior to his appointment Major General Yahaya was the General Officer Commanding 1 Division of the Nigerian Army and the incumbent Theatre Commander of the Counter terrorism Counter Insurgency military outfit in the North East code named Operation HADIN KAI.\nShare this:TweetPrintTelegramWhatsApp"
  },
  {
    "headline": "Disregard bill seeking to scrap NYSC, youth group tells NASS leadership -NigPilot",
    "summarized_story": "The group’s president, Obande Gideon Obande made this known in a statement titled ‘Move by Green Chambers to Scrap NYSC Scheme; A Major Drift Away from National Unity’ on Wednesday.\nAccording to Obande, the NYSC was established to unite Nigerians after the civil war.\nHe, therefore, warned that an attempt to scrap the NYSC will rather jeopardise the chances of a greater united Nigeria, one envisaged by our leaders past.\n“In view of the aforementioned and many other reasons, as Concerned Nigerian Youth we align our position with other progressives calling for total disregard for this bill,” Obande added.\nHe, however, called on all members of the Nigerian parliament with the interest of the Nigerian youth at heart to rise up against the obnoxious bill."
  },
  {
    "headline": "AREWA PERSONS WITH DISABILITIES FORUM BEGINS COVID-19 VACCINATION -NigPilot",
    "summarized_story": "The Executive Secretary National Commission for Persons with Disabilities (NCPWD) Mr. James Lalu has applauded President Muhammadu Buhari for giving persons with Disabilities a common ground to dwell on.\nThis was made known at the Arewa covid 19 vaccination and consultative meeting held in kaduna.\nIn his opening remarks, The Executive Secretary thanked Mr President for the signing into an Act, the Prohibition Against Persons with Disabilities Act 2018 and in furtherance the creation of the National Commission for Persons with Disabilities.\nHe welcomed all stakeholders to the forum put together by the Arewa PWDs to Deliberate on how to strategically strengthen issues of Disabilities.\nShe further added that the forum was attended by Stakeholders in the Disability Community, leaders of different clusters, SA’s to President Muhammad Buhari, Council Members and Management of the National Commission for Persons with Disabilities."
  },
  {
    "headline": "AREWA PERSONS WITH DISABILITIES FORUM BEGINS COVID-19 VACCINATION -NigPilot",
    "summarized_story": "The Executive Secretary National Commission for Persons with Disabilities (NCPWD) Mr. James Lalu has applauded President Muhammadu Buhari for giving persons with Disabilities a common ground to dwell on.\nThis was made known at the Arewa covid 19 vaccination and consultative meeting held in kaduna.\nIn his opening remarks, The Executive Secretary thanked Mr President for the signing into an Act, the Prohibition Against Persons with Disabilities Act 2018 and in furtherance the creation of the National Commission for Persons with Disabilities.\nHe welcomed all stakeholders to the forum put together by the Arewa PWDs to Deliberate on how to strategically strengthen issues of Disabilities.\nShe further added that the forum was attended by Stakeholders in the Disability Community, leaders of different clusters, SA’s to President Muhammad Buhari, Council Members and Management of the National Commission for Persons with Disabilities."
  },
  {
    "headline": "FG orders for immediate release of detained Malian leaders -NigPilot",
    "summarized_story": "The Federal Government of Nigeria has ordered the military junta in Mali to immediately and unconditionally release the detained transitional President and Prime Minister.\nAccording to the statement, “The Federal Government of Nigeria condemns in strong terms the detention of the duo of interim President Bah Ndaw and Prime Minister Moctar Ouane of Mali.\nThe sacking of the pillars of the coup was an enormous misjudgement,” a senior former Malian government official told the international medium.\nThe United Nations’ mission in Mali called for the group’s “immediate and unconditional” release and said those who hold the leaders would have to answer for their actions.\nThe U.S. State Department called in a statement for the “unconditional release of those currently being held”."
  },
  {
    "headline": "FG orders for immediate release of detained Malian leaders -NigPilot",
    "summarized_story": "The Federal Government of Nigeria has ordered the military junta in Mali to immediately and unconditionally release the detained transitional President and Prime Minister.\nAccording to the statement, “The Federal Government of Nigeria condemns in strong terms the detention of the duo of interim President Bah Ndaw and Prime Minister Moctar Ouane of Mali.\nThe sacking of the pillars of the coup was an enormous misjudgement,” a senior former Malian government official told the international medium.\nThe United Nations’ mission in Mali called for the group’s “immediate and unconditional” release and said those who hold the leaders would have to answer for their actions.\nThe U.S. State Department called in a statement for the “unconditional release of those currently being held”."
  },
  {
    "headline": "Buhari Appoints New Chief Of Army Staff, Major-General Yahaya",
    "summarized_story": "President Muhammadu Buhari has appointed Major-General Farouk Yahaya as the new Chief of Army Staff.\nMajor-General Yahaya started his cadet training on 27 September 1985 and was commissioned into the Nigerian Army Infantry Corps on 22 September 1990.\nRésumé/CV of newly appointed Chief of Army Staff (COAS), Major General Farouk Yahaya.\nNotable among the appointments held by the new COAS are Garrison Commander Headquarters Guards Brigade, Directing Staff at the Armed Forces Command and Staff College (AFCSC), Deputy Director Army Headquarters Department of Military Secretary, Deputy Director Army Research and Development and the Chief of Staff, Headquarters Joint Task Force Operation Pulo Shield.\nHe also served as the Principal General Staff Officer (PGSO) to the Honourable Minister of Defence, the Commander, Headquarters 4 Brigade and 29 Task Force Brigade (Operation Zaman Lafiya), Director Manpower at the Army Headquarters, Military Secretary, Army Headquarters and General Officer Commanding (GOC) Headquarters 1 Division of the Nigerian Army."
  },
  {
    "headline": "PHOTOS: Buhari Celebrates Children’s Day",
    "summarized_story": "President Muhammadu Buhari celebrated Children’s Day with children in the State House on Thursday, May 27th.\nMay 27th is celebrated as Children’s Day in Nigeria.\nPresident Buhari commemorated the day with some kids in the Aso Rock Villa with cake and waving flags.\nAccording to the Presidency’s official Twitter handle, “The President spent the morning with a group of visiting children, at the State House.\nSchools and educational institutes used to celebrate this day by organizing fun days, and arranging for kids to go for match passes in stadia across the country."
  },
  {
    "headline": "Disbandment Of SARS Created A Vacuum In Police To Tackle Insecurity – IGP",
    "summarized_story": "The acting Inspector-General of Police (IGP), Alkali Usman has said that the disbandment of the Special Anti-Robbery Squad (SARS) created a vacuum which is challenging efforts by the Police to tackle insecurity in the country from a position of strength.\nThe acting IGP stated this on Thursday at a presidential briefing organized by the Presidential Communications Team at the statehouse in Abuja.\nREAD ALSO: Let Us Not Deceive Ourselves, Things Are Not Alright – Sultan AbubakarAccording to him, the aftermath of the EndSARS protest equally dampened the morale of the officers of the force.\nThe IGP also indicated that the police have recorded successes against secessionist groups and criminals in the southeast.\nHe noted that prosecution to ensure justice is served has remained a major challenge because of the ongoing strike by judiciary workers."
  },
  {
    "headline": "Let Us Not Deceive Ourselves, Things Are Not Alright – Sultan Abubakar",
    "summarized_story": "﻿The Sultan of Sokoto, Muhammad Sa’ad Abubakar, on Wednesday, said Nigerians should not deceive themselves that things are alright.\nHe made the comment during a National Security Summit in Abuja.\n“Let us not deceive ourselves that things are alright, things are not alright,” the revered traditional ruler said.\nWhile commending the Speaker of the House of Representatives, Femi Gbajabiamila, for initiating the National Security Summit, the Sultan called for the implementation of the resolutions of the summit.\nThe traditional ruler expressed happiness that both the Speaker and the Senate President, Ahmad Lawan, have admitted that things are not well with the country."
  },
  {
    "headline": "Police, DSS Rescue 11 Abducted Bwari Residents, Nab Kidnapper",
    "summarized_story": "Eleven abducted persons have been rescued from captivity following a joint security operation led by the Police Command of the Federal Capital Territory (FCT), Abuja.\nThe victims were recently abducted along Bwari Axis and held hostage at an unknown location by gunmen.\nREAD ALSO: Buhari Appoints New Chief Of Army Staff, Major-General YahayaHowever, the FCT joint security operation involving the police tactical squad, operatives of the Department of State Security Service (DSS) raided the criminals’ hideout, following actionable intelligence.\nAuthorities say members of local vigilantes and hunters also provided useful information and support in the operation.\nOne of the kidnappers was arrested by the police squad and efforts to apprehend others are ongoing."
  },
  {
    "headline": "Governor Bello congratulates Farouk Yahaya on appointment as new COAS",
    "summarized_story": "Governor of Niger State Abubakar Sani Bello has congratulated the new Chief of Army Staff (COAS), Major General Farouk Yahaya on his appointment by President Muhammadu Buhari.\nGovernor Abubakar Sani Bello said the appointment is coming at a challenging time where the country is faced with security challenges.\n“Your appointment is based on merit and track record, based on experience, I am confident you will make and succeed where your predecessors have stopped”, he said.\nUntil his appointment COAS, Maj. Gen Farouk Yahaya was the incumbent Theatre Commander Operation HADIN KAI, responsible for Counter-Terrorism and Counter-Insurgency operations in the North East.\nThe appointment of the new COAS is coming after the death of his predecessor, Lt. Gen Ibrahim Attahiru who died in plane crash along 10 others in Kaduna."
  },
  {
    "headline": "Mali Military frees President, Prime Minister",
    "summarized_story": "Three days after being detained and deprived of their powers in what appeared to be the country’s second coup in nine months, Mali’s interim president and prime minister have been released, according to a military officer.\n“The interim president and prime minister were released overnight around 1:30 am.\nFamily members confirmed that President Bah Ndaw and Prime Minister Moctar Ouane had been released.\nThe two were held at the Kati military camp around 15 km from Bamako.\nOn Wednesday, the interim leaders resigned in the presence of mediators visiting the military base."
  },
  {
    "headline": "Buhari Appoints Major General Farouk Yahaya as Nigeria’s New Army Chief",
    "summarized_story": "Nigeria’s President Muhammadu Buhari has appointed Major General Farouk Yahaya as the new Chief of Army Staff.\nPrior to his appointment Major General Yahaya was the General Officer Commanding 1 Division of the Nigerian Army and the incumbent Theatre Commander of the Counter terrorism Counter Insurgency military outfit in the North East code named Operation HADIN KAI.\nYahaya replaces Lt. Gen Ibrahim Attahiru who sadly perished in a plane crash along with 10 other officers on Friday May 22, 2021."
  },
  {
    "headline": "Pochettino in Talks With Former Side Tottenham Over Possible Return",
    "summarized_story": "Mauricio Pochettino is in talks with Tottenham over a return to the club that would see him leave Paris Saint-Germain after less than six months in charge.\nPochettino led PSG to French Super Cup and Coupe de France wins but failed to deliver the Ligue 1 title, missing out to Lille by a point.\nAs well as coaching PSG, Pochettino also spent two-and-a-half years at the club as a player after joining from Espanyol in 2001.\nWere Pochettino to depart PSG, he would leave them searching for their third head coach in less than a year.\nPochettino joined the club as a replacement for Thomas Tuchel, who was sacked in December 2020 despite leading them to their first Champions League final just months earlier."
  },
  {
    "headline": "Zinedine Zidane Steps Down as Real Madrid Head Coach",
    "summarized_story": "Zinedine Zidane has stepped down as Real Madrid head coach for the second time, the club have confirmed.\nHis departure comes after Real narrowly lost out on the league title to city rivals Atletico Madrid at the weekend.\n“It is now time to respect his decision and show him our appreciation for his professionalism, dedication and passion in all these years, and for what his figure represents for Real Madrid,” a club statement read.\n“Zidane is one of the great myths of Real Madrid and his legend goes beyond what he has been as a coach and player of our club.\nHe knows that he is at the heart of Real Madrid and that Real Madrid is and will always be his home.”“It’s an option that Zidane could replace Maurio Pochettino at PSG."
  },
  {
    "headline": "US to Stop Security Assistance to Mali",
    "summarized_story": "The US says it will halt its security assistance to Mali following the latest political developments which saw the departure of two civilian leaders.\nThe US State Department in a statement said “we are now suspending all security assistance that benefits the Malian security and defence forces that we had continued previously pursuant to available authorities”.\n“The United States will also consider targeted measures against political and military leaders who impede Mali’s civilian-led transition to democratic governance,” it added.\nIt further stated that a democratic, civilian-led government presented the best opportunity to achieve security and prosperity in Mali and the wider Sahel region.\nMali’s military forces seem to be more focused in the country’s politics, instead of tackling the volatile security situation."
  },
  {
    "headline": "Mali Junta Leader Declares Himself President",
    "summarized_story": "Colonel Assimi Goita, Mali’s head of the former junta in the West African country, has declared himself the transitional president after stripping the country’s interim president and former prime minister of their powers.\nPresident Bah Ndaw and the Prime Minister Moctar Ouane have now been released from military detention.\nThey were taken to a military base late on Monday in what was seen as Mali’s second military coup in nine months.\nThe move followed a cabinet reshuffle in which two army officers involved in the previous coup lost their jobs.\nThe situation in Mali today is said to be tense but calm."
  }
]