[
  {
    "headline": "COVID-19 infections rise by 326.67% in one week, Nigerians shun safety rules",
    "summarized_story": "Amid rising COVID-19 cases, our correspondents on Sunday reported that Nigerians had abandoned adherence to coronavirus protocols such as use of face masks and hand washing.\nBut the Sokoto State Government faulted the inclusion of the states among states not carrying out tests for COVID-19.\n“We carry out COVID-19 tests on prospective corps members deployed to the state before, their entry into the NYSC Orientation camp.\n“Our personnel are also, on ground and they administered the Covid-19 tests on the citizens that volunteered to be tested.\n“Another thing is that cold allows for surge in COVID-19 cases."
  },
  {
    "headline": "Talent hunt to showcase gifts of children in orphanages",
    "summarized_story": "Black Tie Christmas, an event centered on showcasing the musical talent of children in orphanages, is set to hold at the Muson Centre, Victoria Island, Lagos, on December 19.\nThis maiden edition of the event tagged “No child left behind,” is aimed at raising funds to support the education of the orphans.\nBlack Tie Christmas is organised by His Majesty’s Music and managed by First Viola, the Authority in Choral Music Management.\nAccording to a statement on Sunday, the chairman of day is a former Governor of Anambra State, Peter Obi.\nThe special guests of honour are the Edo State Governor, Godwin Obaseki, and his wife, Betsy Obaseki."
  },
  {
    "headline": "West African leaders must collaborate to overcome common challenges — Buhari",
    "summarized_story": "*Only 2% of population fully vaccinated against COVID-19, says Akufo-AddoBy Johnbosco AgbakwuruABUJA—PRESIDENT Muhammadu Buhari yesterday advocated renewed collaboration among West African leaders to overcome the myriad of common challenges, including state of insecurity facing the sub-region.\nPresident Buhari made the advocacy in his welcome address at the 60th Session of the Authority of Heads of State and Government of the Economic Community of West African States, ECOWAS, held at the Old Banquet Hall, Presidential Villa, Abuja.\n“Our subregion continues to face socioeconomic, political, security, and environmental realities linked to Coronavirus pandemic.\nDespite our efforts, we have only 6% of our population receiving one dose, with 2% of the population fully vaccinated.\nIn another goodwill message, the African Union represented by its Commissioner for Political Affairs, Peace and Security, Nigeria’s Bankole Adeoye, hailed ECOWAS for sustaining democracy in West Africa."
  },
  {
    "headline": "FCMB, Proparco sign $35m funding deal for SMEs, renewable energy",
    "summarized_story": "By Cynthia AloFirst City Monument Bank (FCMB), has signed a $35 million loan and an Euro portfolio guarantee of N5 billion (EUR 10 million equivalent) deal with Proparco.\nThe credit line will fund renewable energy projects and Small and Medium Scale Enterprises (SMEs) affected by the Covid-19 pandemic.\nREAD ALSO:Why we banned knockout, banger in Imo — PoliceSpeaking at the signing ceremony , the Managing Director of FCMB, Mrs. Yemisi Edun, said: “Proparco’s financing and risk-sharing interventions align with our purpose, commitment and support to SMEs with high growth potential and the renewable energy sector.\nWe will continue to offer support in critical sectors to create opportunities for individuals and businesses to thrive and overcome their challenges.\nWe are proud to support the laudable activities of FCMB to achieve these objectives”."
  },
  {
    "headline": "BASEL III: More banks to adopt additional",
    "summarized_story": "Banking hallTier-1 debt structure — RenCapBy Nkiruka NnoromRenaissance Capital, a global investment house, has said that the adoption of Basel III by the Central Bank of Nigeria (CBN) has created a new capital instrument in the form of additional tier-1debt with more banks expected to adopt the funding option in the coming year.\nRecall that a number of corporates accessed the eurobond market to raise funds this year.\n“The Nigeria sovereign will require funding for its budget deficit and this will be sourced internally and externally from commercial and multi-lateral entities.\nRenaissance Capital successfully partnered with Access Bank on the first Additional Tier-1 issue from Nigeria, and we expect this non-dilutive form of capital to be embraced by banks across both foreign and local currency markets.\n“We believe 2022 will be opportunistic and issuers and investors alike will do well to be nimble and decisive.”"
  },
  {
    "headline": "IPOB describes Imo State as burning hell, condemned killing of traditional rulers",
    "summarized_story": "By Chimaobi NwaiwuNNEWI- The Indigenous People if Biafea, IPOB, yesterday condemned in strong terms the killing of traditional rulers in Imo State, saying that Imo State is becoming another burning hell under the present administration in the state, saying that the madness must stop forth with.\nIPOB accused the Police in Imo State and the Hope Uzodimma led administration in Imo State of doing nothing to checkmate criminals in Njaba particularly Egwuedo community who have who are involved not only killing but burning peoples houses.\n“Things are going wrong in Imo State because of threats the government of the state gave all traditional rulers and stakeholders in the state.\n“A government that gives traditional rulers threat for not doing its bidding is it a responsible government.\nWill the elders keep quiet until Imo State government and their nurtured monsters eliminate everybody?"
  },
  {
    "headline": "Boko Haram Terrorists attacks Debiro village bordering Biu, Hawul Councils of Borno",
    "summarized_story": "By Ndahi Marama, MaiduguriArmed Boko Haram terrorists suspected to be members of ISWAP factional groups on Sunday evening invaded Debiro communities which shares Local border with Biu and Hawul Local Government Areas of Borno state.\nBoth Biu and Hawul are from southern Borno Senatorial district with a distance of about 200 kilometres drive from Maiduguri.\n“Yes, some armed terrorists invaded Debiro this evening, But Yohanna and his team swung into action and repelled the attack.\nSome parts of Debiro a remote village is in Biu Council, while most of it which has a primary school and othe public structures is in Hawul territory.\nAll efforts to get confirmation from the Police Public Relations Officer, ASP Sani Shatambaya proved abortive, but a senior military personnel in Biu confirmed the attack on Debiro Debiro village without giving details of casualties at press time."
  },
  {
    "headline": "Soun: Oyo Deputy Governor, Ladoja, others attend burial of Ogbomoso monarch [PHOTOS]",
    "summarized_story": "Deputy Governor of Oyo State, Rauf Olaniyan, former Governor of the state, Senator Radidi Ladoja and other dignitaries on Sunday attended the burial of Soun of Ogbomoso, Oba Jimoh Oyewumi Ajagungbade 111.\nOur correspondent reports that the monarch has been buried according to Islamic rites inside a vault in the palace.\nThe burial prayer was conducted by the Chief Imam of Ogbomoso, Imam Tholiat Oluwasina Ayilara.\nOther dignitaries who were at the palace to mourn and attend the burial included former Governor, Chief Christopher Adebayo Alao-Akala, Chief of Staff to Governor Seyi Makinde, Segun Ogunwuyi, Senators Fatai Buhari and Ayo Adeseun.\nThe burial prayer was conducted by the Chief Imam of Ogbomoso, Tholiat Oluwasina Ayilara."
  },
  {
    "headline": "Frustration as price of satchet water skyrockets in Taraba",
    "summarized_story": "The sudden hike in the prices of satchet water also known as pure water in Taraba State has become a source of worry to residentsA bag of pure water that used to be sold at N100.00, now goes for N160.00 in the state.\nUnlike a few days ago when sachet water was sold for N10,00 DAILY POst market survey shows a sachet is now sold for N20.00.\nSome sachet water hawkers who spoke to DAILY POST said they increased their prices from N10 to N20 because manufacturers and wholesale sellers increased their prices.\nMost of the manufacturers visited by DAILY POST said it was not their intention to increase the price of satchet water but for the high cost of manufacturing materials.\nThey claimed only the government can reverse the trend by subsidizing materials used in the manufacturing of satchet water."
  },
  {
    "headline": "Zamfara pensioners lament non payment of gratuities, accumulated pension arrears",
    "summarized_story": "The Zamfara State chapter of the Nigeria Union of Pensioners has lamented that its members have not been paid accumulated pension arrears and gratuities by Governor Bello Matawalle’s administration.\nThe union called for an immediate review of the pension amount to a national minimum wage of N30,000 a month, considering the high cost of living in the country.\nThe chairman of the Zamfara council, Hassan Muhammad Gusau, appealed through the press in his marking of 2021 Pensioners Day on Sunday in Gusau, the state capital.\n“Every December 11 is designated by the Nigeria Union of Pensioners as Pensioners Day since 2002 and every year comes with its prospect and challenges”“We have come to understand that some of the challenges facing the union include the deliberate disregard for our pensioners and most especially the constitutional requirements of section 173 (3) and 210(3) of the 1999 Constitution of the Federal Republic as amended”“It stipulates that there should be a pension review every five years or together with an increase of workers salary or whichever comes first”“But Governor Bello Matawalle had earlier given the assurance that his administration would continue to release N100 million gratuities to the state and local government pensioners on a monthly basis which is yet to be fulfilled ”“Another challenge is that the pensioners with a federal share of pension screened by the PTAD are now through information technology or online”“We are yet to know the reason for not approving the N30,000 to pensioners in the state which is very disheartening because many pensioners still receive less than N3,000 a month”“The union, therefore, calls for upward review of the amount that had not been done since 1999″“ The union, therefore, demands the offset of all outstanding gratuities of pensioners once and for all and the approved minimum pension in the state to at least N30,000 a month,”The chairman assured members of the Union that he would continue with the effort towards improving their welfare."
  },
  {
    "headline": "Tension mounts as gunmen invade Imo Communities, kidnap traditional rulers",
    "summarized_story": "Barely 3days after the traditional ruler of Atta ancient kingdom in the Njaba LGA, Edwin Azike was kidnapped and killed, another yet to be identified gunmen on Sunday wreaked havoc on communities in Imo State, kidnapping two traditional rulers.\nDAILY POST gathered that the gunmen burnt the monarchs’ palaces and vehicles while carrying out the operations and also kidnapped the youth leader of Umulolo Okigwe.\nThe gunmen came in Hilux vehicles and kidnapped the two monarchs and burnt their palaces and vehicles.\nThey also kidnapped the youth leader of Umuololo- Okigwe.\nHe said Ndukwe is the chairman of the Council of Traditional rulers in Okigwe LGA and also the owner of the popular Genesis hotel, Okigwe."
  },
  {
    "headline": "Ex-Reps Speaker, Dogara raises alarm over proliferation, high cost of private universities",
    "summarized_story": "Former Speaker of the House of Representatives, Yakubu Dogara, on Saturday raised alarm over the proliferation of universities in Nigeria as well as the high cost of private universities.\n“Worthy of commenting upon is the spate of approvals and licensing of private universities.\nThe National Universities Commission (NUC) must be quick to have a recess, a break for a period of time to allow the very large number of private universities already licensed to mature.\nAccording to him, many of the private universities were still struggling to find their feet, saying that many students could not afford the universities’ exorbitant fees.\nAccording to him, “our public universities are seriously affected by incessant strikes and threats of it."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "BREAKING: Fire guts petrol stations, 15 vehicles in Anambra",
    "summarized_story": "Two petrol stations were gutted by fire on Sunday night following a gas explosion along the Onitsha-Enugu expressway.\nOver 15 vehicles parked in a mechanic workshop near the stations were razed.\nRead Also: BREAKING: Imo monarchs flee as gunmen abduct two, set palaces ablazeBuildings located in the two stations were also affected by the fire.\nThe Director, State Fire Service, Martin Agbili, an engineer, confirmed the incident.\nHe said four fire trucks and fire fighters were at the scene battling the fire."
  },
  {
    "headline": "BREAKING: Imo monarchs flee as gunmen abduct two, set palaces ablaze",
    "summarized_story": "BREAKING: Imo monarchs flee as gunmen abduct two, set palaces ablazeGunmen on Sunday abducted two traditional rulers in Okigwe, Imo State, and set their palaces ablaze.\nOther traditional rulers are said to have gone into hiding.\nGunmen on Friday killed the traditional ruler of Ebeteghete community in Njaba Local Government Area of Imo State, Eze Edwin Azuike.\nAlso on Thursday, gunmen abducted the traditional ruler of the Mbutu Ancient Kingdom in Aboh Mbaise Local Government Area of Imo, Eze Damian Nwaigwe.\nHe said: “The gunmen stormed the traditional rulers’ houses, abducted them and set their houses on fire.”According to him, the command has commenced investigation."
  },
  {
    "headline": "BREAKING: NFF fires Rohr, appoints Eguavoen",
    "summarized_story": "The Nigeria Football Federation (NFF) has parted ways with national team coach Gernot Rohr.\nA statement by the Federation reads: “The Nigeria Football Federation has appointed Mr Augustine Eguavoen, currently its Technical Director, as the Technical Adviser of the Super Eagles on an interim basis.\nRead Also: Sports minister coy on Rohr“This is with immediate effect, and follows the termination of the relationship with Franco-German Gernot Rohr, who has been in charge of the three–time African champions for the past 64 months, and is Nigeria’s longest–serving manager.\n““Following a virtual meeting of the NFF Executive Committee on Sunday, it was decided that Eguavoen will work with Salisu Yusuf (Chief Coach); Paul Aigbogun (Assistant Coach); Joseph Yobo (Assistant Coach); Dr Terry Eguaoje (Assistant Coach) and Aloysius Agu (Goalkeeper Trainer).\n- Advertisement -“Former Nigeria captains Augustine ‘Jay Jay’ Okocha, Nwankwo Kanu and Garba Lawal have been appointed to provide technical and ambassadorial support for the crew.”"
  },
  {
    "headline": "Chikwendu has access to our kids but refuses to visit, says Fani-Kayode",
    "summarized_story": "Chikwendu has access to our kids but refuses to visit, says Fani-KayodeThe former Aviation Minister Chief Femi Fani-Kayode has accused former beauty queen and estranged wife, Precious Chikwendu, of refusing to visit her children.\nChikwendu had recently lamented about how her ex-husband has continue to frustrate all of her attempts to see her kids over the past year.\n- Advertisement -“Yes, since August 2nd, 2020, I haven’t seen my children and I’ve been physically prevented from seeing them,” she said.\nFani-Kayode, on Saturday night, shared a video of their four kids playing in the care of nannies.\nAccording to him in the video’s caption, his ex-wife had been granted access to the kids for over 17 months but has willfully refused to visit them."
  },
  {
    "headline": "Soun of Ogbomoso dies at 95",
    "summarized_story": "From Oluseye Ojo, IbadanThe Soun of Ogbomoso in Oyo State, Oba Jimoh Oladunni Oyewumi, Ajagungbade III, is dead.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nIn 1938, he attended the Ogbomoso People’s Institute, which was later transformed into Ogbomoso Grammar School.\nPrince Oyewumi, as he was popularly known, made his inaugural business trip abroad in 1958.\nThe trip took him to Hamburg and Bremen in then West Germany; Paris and Marseille in France and London, United Kingdom."
  },
  {
    "headline": "Col. Abubakar Dangiwa Umar exclusive: Why Nigeria cannot win banditry, Boko Haram war",
    "summarized_story": "Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nFixed wing aircraft are not ideal weapons of choice in the fight against banditry and kidnappings,” Umar explained.\nPeople give up most of their rights to the state with the hope that their security will be guaranteed.\nKaduna which you once governed has been very hostile security-wise, with bandits packing students from time to time.\nIt was made to pay war reparations which resulted in the crippling of its economy and massive pauperisation of its people."
  },
  {
    "headline": "Imo Governor at 63: Unknown gunmen, Okorocha, Imo governorship election and I – Uzodimma",
    "summarized_story": "Governor of Imo State, Senator Hope Uzodimma, is 63 years old today.\nThese things don’t encourage sane minds.\nI’m the governor of Imo State and I took an oath to protect the people.\nYou’ll see all the things I’ve done.\nOur people don’t think."
  },
  {
    "headline": "2023: Don’t beg Yoruba to support any aspirant, Obasanjo warns Ooni",
    "summarized_story": "From Lateef Dada, OsogboFormer President Olusegun Obasanjo has warned the Ooni of Ife, Oba Adeyeye Ogunwusi, not to direct Yoruba people to support any candidate as politicians may demand.\nSpeaking in Yoruba language with Ooni, Obasanjo said: “The matter now becomes between us as brothers; kingship role in Yoruba land should not be muddled with politics.\n“All sons and daughters of Yoruba land, no matter where they are or their standpoint, they will be coming to meet you.\nYoruba people don’t usually go to the same direction which is part of our strength in Yoruba land.\nPlease don’t let the politician add to your burden."
  },
  {
    "headline": "Most FG budgetary allocations promote corruption – Wike",
    "summarized_story": "Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nHe said such practice encourages variation of the value of the projects, elongates the time specified to complete such projects and most often, leads to abandonment.\nGovernor Wike explained that in such situations, the contract value becomes affected by inflation and there is a likelihood of adjustment of the items, which eventually breeds corruption.\nGovernor Wike stated that days were gone when politicians gave excuses to cover up their lack of leadership capacity.\nPerforming the project inauguration, Ozekhome said Governor Wike had through the execution of numerous infrastructural projects, demonstrated transparency and accountability in the management of the resources of Rivers State."
  },
  {
    "headline": "NFF Sacks Rohr, Names Eguavoen Interim Super Eagles Technical Adviser",
    "summarized_story": "The Nigeria Football Federation (NFF) has appointed Augustine Eguavoen, currently its Technical Director, as the Technical Adviser of the Super Eagles on an interim basis.\nThe statement said the decision to sack Rohr and appoint Eguavoen on an interim basis was taken during a virtual meeting of the NFF Executive Committee on Sunday.\nOlajire quoted General Secretary of the NFF Mohammed Sanusi as saying that the relationship between the NFF and Mr Rohr had come to an end.\n“We thank him for his services to the Super Eagles and Nigeria.\nHe was on-field captain when the Super Eagles lifted the Africa Cup for the first time on away ground, in Tunisia 27 years ago."
  },
  {
    "headline": "Fully Vaccinated South African President Ramaphosa Tests Positive for Covid",
    "summarized_story": "South African President Cyril Ramaphosa tested positive for Covid-19 and is receiving treatment for mild symptoms, according to Bloomberg reports.\n“The president is in good spirits but is being monitored by the South African Military Health Service of the South African National Defence Force.”Ramaphosa, 69, was vaccinated against coronavirus with the single-dose Johnson & Johnson inoculation in February.\nSouth Africa is in the midst of a fourth wave of coronavirus infections fueled by the omicron variant.\nRamaphosa this month traveled to West Africa, where he held talks with Nigerian President Muhammadu Buhari, Ghanaian President Nana Akufo-Addo, Ivory Coast President Alassane Ouattara and Senegalese President Macky Sall.\nRamaphosa was tested for Covid-19 in all of the countries he visited, and returned to South Africa on Dec. 8 after obtaining negative test results, the presidency said."
  },
  {
    "headline": "Breaking: Soun of Ogbomoso Dies at 95",
    "summarized_story": "Kemi Olaitan in IbadanSoun of Ogbomoso, Oba Oladunni Oyewumi Ajagungbade III, is dead.\nTHISDAY learnt that the first class traditional ruler in Oyo State, died Sunday morning in the ancient town at 95.\nPalace sources who confirmed the death of the monarch said his death had not been officially announced.\nOba Oyewumi was born on May 27, 1926 in Ogbomoso to Oba Bello Afolabi Oyewumi Ajagungbade II.\nHe reigned for 48 years, making him one of the longest in Nigeria."
  },
  {
    "headline": "In Retaliatory Move, FG to Impose Travel Restrictions on UK, Canada, Saudi Arabia",
    "summarized_story": "•13 countries add UK to their red list over Omicron casesFestus Akanbi in Lagos and Onyebuchi Ezigbo in Abuja with agency reportsThe federal government is planning to add the United Kingdom, Argentina, Canada, and Saudi Arabia to red list countries, following their decision to impose travel restrictions on Nigeria.\nThe UK had imposed travel restrictions on Nigeria, claiming that 21 cases of Omicron recorded in England were linked to travellers from Nigeria.\n“Also, there is a case of Saudi Arabia, which put Nigeria on the banned list – no visa, no travel, et Cetra.\nOnce they are put on the red list, which means they are banned, of course, their airlines will be banned.\nCanada and Saudi Arabia had also banned travellers from Egypt, Nigeria, and Malawi over fears of the spread of the new Omicron variant."
  },
  {
    "headline": "PDP Govs Hold Meetings in UK, Spain on Consensus Presidential Candidate",
    "summarized_story": "A source privy to the strategic meetings told THISDAY last night that Governor Ortom is the architect of a consensus presidential candidate for the PDP and would host the meeting in Makurdi tonight.\n“At their Real Madrid meeting, the governors reiterated the need for a consensus presidential candidate to avoid the rancour that could emanate as a fall-out to an elective convention.\n“But the PDP governors have not agreed on any choice of a consensus candidate, whether from South or North,” the source added.\nAs part of the efforts to smoothen some rough edges on the consensus presidential candidate, the PDP governors will again meet in Makurdi after the reception for the new national chairman, Ayu.\nEvery presidential aspirant of PDP is a leader and a potential president, only that we can have only one presidential candidate for the 2023 polls,” Onaiwu said."
  },
  {
    "headline": "EXCLUSIVE: Junketing President Buhari’s Team Leaves For Turkey Today, Plans China Trip",
    "summarized_story": "The team of President Muhammadu Buhari, who was reported exclusively by SaharaReporters on Saturday to be visiting Turkey, has left for the European country today (Sunday).\nTop presidential sources told SaharaReporters that another trip to China is being planned for 2021 or early next year.\nSee Also Politics Junketing Nigerian President, Buhari Jets Out To UAE For ExhibitionShortly after hosting and meeting South African President, Cyril Ramaphosa, Buhari left the nation's capital, Abuja for the UAE capital.\nThe Nigerian president has been junketing across the world in the last three months.\nThen on October 3, President Buhari left for Ethiopia to attend the inauguration of the country’s Prime Minister Abiy Ahmed for a second five-year term in office."
  },
  {
    "headline": "EXCLUSIVE: Junketing President Buhari’s Team Leaves For Turkey Today, Plans China Trip",
    "summarized_story": "The team of President Muhammadu Buhari, who was reported exclusively by SaharaReporters on Saturday to be visiting Turkey, has left for the European country today (Sunday).\nTop presidential sources told SaharaReporters that another trip to China is being planned for 2021 or early next year.\nSee Also Politics Junketing Nigerian President, Buhari Jets Out To UAE For ExhibitionShortly after hosting and meeting South African President, Cyril Ramaphosa, Buhari left the nation's capital, Abuja for the UAE capital.\nThe Nigerian president has been junketing across the world in the last three months.\nThen on October 3, President Buhari left for Ethiopia to attend the inauguration of the country’s Prime Minister Abiy Ahmed for a second five-year term in office."
  },
  {
    "headline": "EXCLUSIVE: Junketing President Buhari’s Team Leaves For Turkey Today, Plans China Trip",
    "summarized_story": "The team of President Muhammadu Buhari, who was reported exclusively by SaharaReporters on Saturday to be visiting Turkey, has left for the European country today (Sunday).\nTop presidential sources told SaharaReporters that another trip to China is being planned for 2021 or early next year.\nSee Also Politics Junketing Nigerian President, Buhari Jets Out To UAE For ExhibitionShortly after hosting and meeting South African President, Cyril Ramaphosa, Buhari left the nation's capital, Abuja for the UAE capital.\nThe Nigerian president has been junketing across the world in the last three months.\nThen on October 3, President Buhari left for Ethiopia to attend the inauguration of the country’s Prime Minister Abiy Ahmed for a second five-year term in office."
  },
  {
    "headline": "EXCLUSIVE: Head Of Service Warns Ministries, Agencies Over Rising Lawsuits From Workers Against Buhari Government",
    "summarized_story": "The Office of the Head of Civil Service of the Federation has warned permanent secretaries and chief executive officers in the country over rising litigation cases consuming the limited resources of the Nigerian government.\n“In the light of the above development, all MDAs are strongly advised to follow due process in handling staff matters, especially disciplinary cases.\nSpecifically, public service rules issued by the OHSCF and guidelines on appointments, promotion and disciplines issued by the Federal Civil service Commission.\n“Henceforth, permanent secretaries and chief executive officers whose poor handling of disciplinary matters leading to avoidable court cases, consequential financial implications and embarrassment to government shall be held liable.\nHenceforth, the commission shall direct all pending matters, litigations in court to the MDAs concerned to defend themselves on their merit."
  },
  {
    "headline": "EXCLUSIVE: Head Of Service Warns Ministries, Agencies Over Rising Lawsuits From Workers Against Buhari Government",
    "summarized_story": "The Office of the Head of Civil Service of the Federation has warned permanent secretaries and chief executive officers in the country over rising litigation cases consuming the limited resources of the Nigerian government.\n“In the light of the above development, all MDAs are strongly advised to follow due process in handling staff matters, especially disciplinary cases.\nSpecifically, public service rules issued by the OHSCF and guidelines on appointments, promotion and disciplines issued by the Federal Civil service Commission.\n“Henceforth, permanent secretaries and chief executive officers whose poor handling of disciplinary matters leading to avoidable court cases, consequential financial implications and embarrassment to government shall be held liable.\nHenceforth, the commission shall direct all pending matters, litigations in court to the MDAs concerned to defend themselves on their merit."
  },
  {
    "headline": "S'African president Cyril Ramaphosa tests positive for COVID -- days after Nigerian visit",
    "summarized_story": "South African President Cyril Ramaphosa has tested positive for COVID-19 after exhibiting mild symptoms.\nAdvertisementRamaphosa was said to have felt unwell on Sunday after leaving a memorial service for FW de Klerk, the former South African deputy president, in Cape Town.\nAccording to a statement issued by the South African presidency, Ramaphosa is “in good spirits” and is being monitored by doctors.\nThe South African president, who is fully vaccinated, is expected to remain in self-isolation and has assigned his responsibilities to David Mabuza, the deputy president.\n“The president also tested negative on his return to Johannesburg on 8 December.”President Muhammadu Buhari received the South African president on December 1 at the presidential villa in Abuja."
  },
  {
    "headline": "S'African president Cyril Ramaphosa tests positive for COVID -- days after Nigerian visit",
    "summarized_story": "South African President Cyril Ramaphosa has tested positive for COVID-19 after exhibiting mild symptoms.\nAdvertisementRamaphosa was said to have felt unwell on Sunday after leaving a memorial service for FW de Klerk, the former South African deputy president, in Cape Town.\nAccording to a statement issued by the South African presidency, Ramaphosa is “in good spirits” and is being monitored by doctors.\nThe South African president, who is fully vaccinated, is expected to remain in self-isolation and has assigned his responsibilities to David Mabuza, the deputy president.\n“The president also tested negative on his return to Johannesburg on 8 December.”President Muhammadu Buhari received the South African president on December 1 at the presidential villa in Abuja."
  },
  {
    "headline": "NFF sacks Rohr, appoints Eguavoen as Super Eagles interim coach",
    "summarized_story": "The Nigeria Football Federation (NFF) has sacked Gernot Rohr as technical adviser of the Super Eagles.\nAugustine Eguavoen was named the interim coach of the three-time African champions.\nThe statement reads: “The Nigeria Football Federation has appointed Mr Augustine Eguavoen, currently its Technical Director, as the Technical Adviser of the Super Eagles on an interim basis.\nAdvertisement“Following a virtual meeting of the NFF Executive Committee on Sunday, it was decided that Eguavoen will work with Salisu Yusuf (Chief Coach); Paul Aigbogun (Assistant Coach); Joseph Yobo (Assistant Coach); Dr Terry Eguaoje (Assistant Coach) and Aloysius Agu (Goalkeeper Trainer).\nWe thank him for his services to the Super Eagles and Nigeria."
  },
  {
    "headline": "NFF sacks Rohr, appoints Eguavoen as Super Eagles interim coach",
    "summarized_story": "The Nigeria Football Federation (NFF) has sacked Gernot Rohr as technical adviser of the Super Eagles.\nAugustine Eguavoen was named the interim coach of the three-time African champions.\nThe statement reads: “The Nigeria Football Federation has appointed Mr Augustine Eguavoen, currently its Technical Director, as the Technical Adviser of the Super Eagles on an interim basis.\nAdvertisement“Following a virtual meeting of the NFF Executive Committee on Sunday, it was decided that Eguavoen will work with Salisu Yusuf (Chief Coach); Paul Aigbogun (Assistant Coach); Joseph Yobo (Assistant Coach); Dr Terry Eguaoje (Assistant Coach) and Aloysius Agu (Goalkeeper Trainer).\nWe thank him for his services to the Super Eagles and Nigeria."
  },
  {
    "headline": "'It continues to torment us' -- Buhari seeks ECOWAS collaboration to tackle COVID",
    "summarized_story": "President Muhammadu Buhari has called for collaboration among West African countries in tackling its challenges including the Omicron COVID-19 variant of concern.\nAdvertisementFemi Adesina, presidential spokesman, in a statement, said Buhari made the call on Sunday when he received other West African leaders for the 60th Economic Community for West African States (ECOWAS) ordinary session in Abuja.\nThe president said for the region to be peaceful and prosperous, governments must create opportunities for sustainable development of their citizens.\nHe said: “Today’s realities remind us of the need to continue to forge stronger solidarity in order to address the new challenges, including the current third wave of the pandemic and its Omicron variant.\nAdvertisement“The challenges of coronavirus and the catastrophic consequences posed on our socioeconomic environment continues to torment us."
  },
  {
    "headline": "This may be African languages’ best bet against extinction",
    "summarized_story": "How can this be avoided, especially for African languages?\nGet the best African tech newsletters in your inboxMandla, a Zulu and Xhosa word that means power, is an innovative e-learning language app created for those who seek to strengthen their connection with their African roots.\nA diverse team building a diverse productAs the duo built, they realised they needed more diverse hands.\nThe third Apiou raised is about niche: their product focuses on Africa and African languages and culture.\nUnlike other language learning apps that are including African languages just to check a diversity-and-inclusion box, Mandla’s mission is deeper than educational or entertainment purposes; it’s really about cultural preservation."
  },
  {
    "headline": "Could Africa ditch cash?",
    "summarized_story": "The era of cash could be drawing to an end as central bank-backed digital currencies (CBDC”s) takes root in Africa.\nSo far, it’s only Nigeria that has launched an official, state-backed digital currency – christened the eNaira – on the continent as more countries continue to express interest.\nThe Baobab Network has traced at least 60 cryptocurrency companies in Africa, with the majority (43 percent) of them headquartered in Nigeria, followed by South Africa (18 percent) and Kenya (11 percent).\nThis is affirmed by another comparative study by GSMA published in March 2021 showing more than half of 310 live mobile money services in 2020 across the globe were found in Africa.\nWith over 55 percent of the world’s mobile money services recorded in Africa and a significant population turning to e-wallets and cryptocurrency, the question now becomes whether the continent might ditch paper money altogether."
  },
  {
    "headline": "CinetPay gets $2.4m seed to digitise payments in francophone Africa",
    "summarized_story": "CinetPay, an Ivory Coast-based startup that enables merchants in francophone Africa to accept and make electronic payments online or via mobile Point of Sale (PoS) devices, on Wednesday said it has raised $2.4 million seed funding.\nOn CinetPay’s mobile and web-based platform, businesses can sign up to process payments from over 130 different payment operators—including MTN mobile money, M-Pesa, Orange Money, Visa, Mastercard, etc—via a single interface.\nCinetPay thus simplifies the process of accepting payments, eliminating the need for merchants to integrate with different systems for managing sales and revenues.\nSimilarly, up to 80% of the population in the French-speaking African region have a mobile money account and less than 20% bank accounts.\nWalter Baddoo, co-founder and General Partner at 4DX Ventures reveals that the VC firm has been “tracking the francophone Africa market” for some time now and is impressed by CinetPay’s ambitious goal to digitise payments across the region."
  },
  {
    "headline": "Equinix in talks to acquire West African digital infrastructure firm MainOne",
    "summarized_story": "The company owns and operates an extensive submarine network extending 7,000 kilometers from Portugal to Lagos, Accra, and along the West African coast, with landing stations in Nigeria, Ghana, and Côte d’Ivoire.\nThese provide connectivity to and from Europe, West African countries, and the major business communities in Nigeria.\nMainOne also owns digital infrastructure assets that include three operational data centers, with an additional facility under construction expected to open in Q1 2022.\nGiven the huge supply gap in digital infrastructure in sub-Saharan Africa, Ayobami Omole, a Lagos-based telecom analyst at Tellimer, expects more of such transactions in the coming years.\nWhen completed, the acquisition will extend Platform Equinix into West Africa."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "Enterprise Hotel is democratising real estate investments for regular Africans",
    "summarized_story": "AdvertisementFractional investment startup, Enterprise Hotel, hopes to change this by offering Africans the opportunity to invest in commercial real estate with as little as ₦30,000 ($52).\nHow Enterprise Hotel makes moneyEnterprise Hotel makes money in two ways.\nHis time working in real estate showed him that only a handful of people could afford to buy or own real estate.\nThen we can start talking to investors.”Aside from helping more people gain access to real estate investments, Enterprise Hotel indirectly solves another problem.\nFor Enterprise Hotel, operating in the real estate industry with its high financial requirements poses a significant hurdle."
  },
  {
    "headline": "Open banking and its progenitor, nominees, Techpoint Awards 2021, and some exciting news out of Africa",
    "summarized_story": "However, the open banking system is arguably one of his most significant achievements.\nOluwanifemi Kolawole had a chat with the finance expert, and he dished about his career, life, and the open banking system.\nRead: Adedeji Olowe is building a global reputation as Africa’s open banking leaderAnd the nominees are…By now, I’m sure you’ve heard about the biggest tech event in West Africa — Techpoint Build 2021.\nNominees for Techpoint Awards (Nigerian edition) are out!\nTo check if your favourite Nigerian startup made the list, click here: Techpoint Awards 2021: And the nominees are…Some exciting newsCinetPay Founders."
  },
  {
    "headline": "Road to super app? GIGM adds e-wallet, bill payment features",
    "summarized_story": "Share this article:Nigeria-based mobility giant, GIGM, has launched a payment service for its users.\nSource: SuppliedThe super app model has gained popularity in emerging economies following the successes of WeChat and Alipay in China.\nFor GIGM, this could be building on its tech-enabled transportation platform to offer payment services to its users.\nNigeria’s fragmented transportation services mean that users cannot travel comfortably over short distances.\nWith its position as a leading transportation service provider and the addition of a payment option, the company looks to be on the right path."
  },
  {
    "headline": "Updated: Nigeria reciprocates, bans flights from Saudi Arabia, UK, Canada on Omicron",
    "summarized_story": "With effect from Tuesday, December 14, the Federal Government will restrict airlines coming from Canada, the United Kingdom and Saudi Arabia into Nigeria.\nSirika said President Muhammadu Buhari’s administration would also place the United Kingdom, Canada and Saudi Arabia on a red list over the outbreak and spread of the Omicron variant.\n“There is also the case of Saudi Arabia that put Nigeria on the ban list.\nRead also: Omicron: UK adds Nigeria to its travel red listThe UK had on November 4, added Nigeria to its red list and imposed a travel ban, citing the Omicron variant.\nCanada and Saudi Arabia had also banned flights and Nigerians from coming into their countries."
  },
  {
    "headline": "Why Nigerians must vote in 2023",
    "summarized_story": "For those who encourage the youths to vote in the 2023 elections, there are many reasons not to step out as Nigerian unemployment ranks among the highest in the world at 33.3 percent.\nIt is not enough to register and collect a Permanent Voter’s Card (PVC) as many Nigerians do today, but they really do not vote on Election Day.\n2023 is approaching and presents another opportunity for Nigerians to vote in those they believe have the capacity to turn things around positively,” Tony Uwa, a political scientist, said.\nSo, there are too many reasons for every Nigerian to go vote in 2023.\n“Nigerians must come to vote, because when you don’t vote, don’t complain when someone who is not fit is elected."
  },
  {
    "headline": "More pain for Nigerian states as FAAC shrinks by N68bn in November",
    "summarized_story": "More pain for Nigerian states as FAAC shrinks by N68bn in NovemberThe ability of Nigerian states and other tiers of government to meet their various obligations is under more risk as gross monthly distribution by the Federation Account Allocation Committee (FAAC) to the three tiers of government dropped by N68billion in November.\nThe continuous decline in Nigeria’s FAAC allocation to the three tiers of government is also due to the subsidy payment, according to market analysts.\nThe Nigerian National Petroleum Corporation (NNPC) has been deducting from its remittance to FAAC, a threat to the ability of many Nigerian states and other tiers of government to meet their financial obligations.\n“Since June ’21, the corporation has deducted a total of N939bn from its FAAC remittance.\n“Incessant payment of subsidy on refined petroleum products would narrow FAAC allocations and widen the country’s budget deficit."
  },
  {
    "headline": "Obaseki, EDSTMA assure free-flow of traffic during yuletide – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has charged the Edo State Traffic Management Agency (EDSTMA) and other stakeholders to ensure that there is a free flow of traffic across the state during the yuletide period.\nObaseki gave the charge when he received a team of EDSTMA Traffic Mayor Corps led by the President, Emmanuel Onimhawo, who was on a courtesy visit at the Government House in Benin City.\nWe commend your efforts in traffic management in the city, as we see you sometimes sacrificing your time to control traffic in some designated areas in the state.\nWe will support and encourage you to continue to support EDSTMA in maintaining traffic in the State,” the governor reassured.\nOn his part, Onimhawo said the group is a voluntary body established in 2018 and attached to EDSTMA to control traffic in the State."
  },
  {
    "headline": "Obaseki to expend N24bn to sustain gains recorded in education sector – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has said the government plans to spend N24.6bn in 2022 to sustain gains recorded by his administration in the education sector.\nObaseki, who spoke to journalists in Benin City, said the government is committed to deepening reforms in the education sector to ensure that every Edo child is empowered to be globally competitive.\nHe said the monies will be expended on sustaining the gains recorded in the sector through the Edo Basic Education Sector Transformation (EdoBEST) Programme, building and maintaining physical infrastructure across schools in the state, and upskilling teachers, among others.\n“Edo today is ranked as one of the five nationals and sub-nationals in the world leading the charge in tackling learning poverty.\n“At the tertiary education level, the Edo State College of Agriculture and Natural Resources, Iguoriakhi and its sister campuses are being upgraded to global standard.”..."
  },
  {
    "headline": "Agripalm Commences Rebuilding Of Oba Akenzua Primary School In Ikoha – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOVIA-SOUTH – It was pump and ceremony yesterday in Ikoha community, Ovia-South West Local government area of Edo state as inhabitants of the community gathered to witness the foundation laying ceremony of the Oba Akenzua II Primary School by the AgriPalm Limited.\nIn his speech at the ceremony attended by the Ag.\nHe said upon due investigation, the panel among other resolutions requested the AgriPalm to develop the area North of the Pipeline as staff quarters and rebuild the demolished Oba Akenzua II Primary School.\nJustice Otabor, Iseh therefore assured of the council’s readiness to partner AgriPalm limited towards transforming the fortunes of the people of Ikoha community.\nThe Enogie of Siluko Dukedom, HRH Aguobasinmwin Omoregie Akenzua said in order for the school which bears the monumental name of Oba Akenzua II not to be completely obliterated propelled the rebuilding of the school and promised his cooperation and full protection of the project."
  },
  {
    "headline": "Sanwo-Olu Unveils New Power Policy To Meet Lagos Electricity Needs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – An electricity sustainability framework that will provide reliable power to residential and industrial areas in Lagos State has been unveiled by Governor Babajide Sanwo-Olu.\nThe Governor recently launched the State’s Electricity Policy at an energy stakeholders’ event organised by the Ministry of Energy and Mineral Resources at Eko Hotel and Suites, Victoria Island.\nThe framework forms one of the technical components of the proposed Lagos State Electricity Law currently being developed to drive interventions towards improving access to electricity.\nSanwo-Olu said the electricity policy unveiled articulated constitutional, legal, engineering and commercial foundations for creating a viable sub-national electricity system that would cater for energy needs of the State, while enabling socio-economic growth for Lagos and the nation.\nThe Governor stressed that the set objectives of the electricity policy would only be realisable if the private partners showed equal commitment as the Government to boost capacity in off-grid generation and distribution network."
  },
  {
    "headline": "South Africa president, Ramaphosa receiving treatment after testing positive for Covid-19",
    "summarized_story": "President of South Africa, Cyril Ramaphosa is receiving treatment after testing positive for Coronavirus, a statement from the country’s presidency said on Sunday.\n“The President, who is fully vaccinated, is in self-isolation in Cape Town and has delegated all responsibilities to Deputy President David Mabuza for the next week.\n“On his recent visit to four West African states, President Ramaphosa and the South African delegation were tested for COVID-19 in all countries.\n“Today’s proceedings in Cape Town were undertaken in compliance with health regulations pertaining to hand hygiene, the wearing of face masks and social distancing.\n“President Ramaphosa says his own infection serves as a caution to all people in the country to be vaccinated and remain vigilant against exposure."
  },
  {
    "headline": "Nigeria imports N143bn worth of solid minerals in nine months",
    "summarized_story": "Nigeria imported N143.1 billion worth of solid minerals from January to September this year, according to data collated from the National Bureau of Statistics (NBS).\n“In terms of imports, plasters of calcined gypsum was imported from Turkey and Egypt in values worth N8.35bn and N3.69bn.\n“Others were other salt (including crude salt) worth N6.04bn imported from Brazil.\nZinc ores and concentrates were exported to China in the value worth N3.3bn and lead ores and Concentrate worth N2.7bn were also exported to China.\nOther products imported include; Plasters of calcined gypsum imported from Turkey (N3.2bn) and Tunisia (N2.5bn)."
  },
  {
    "headline": "NFF sacks Gernot Rohr, appoints Eguavoen Super Eagles coach",
    "summarized_story": "The Nigeria Football Federation has announced the appointment of Mr. Augustine Eguavoen, currently its Technical Director, as the Technical Adviser of the Super Eagles on an interim basis.\nFollowing a virtual meeting of the NFF Executive Committee on Sunday, it was decided that Eguavoen will work with Salisu Yusuf (Chief Coach); Paul Aigbogun (Assistant Coach); Joseph Yobo (Assistant Coach); Dr Terry Eguaoje (Assistant Coach) and Aloysius Agu (Goalkeeper Trainer).\nGeneral Secretary of the NFF, Dr Mohammed Sanusi said: “The relationship between the Nigeria Football Federation and Mr Rohr has come to an end.\nWe thank him for his services to the Super Eagles and Nigeria.\n“We also want to thank the Federal Ministry of Youth and Sports for their collaboration and guidance all through."
  },
  {
    "headline": "Abu Dhabi GP: Max Verstappen confirmed as F1 champion after Mercedes protests is rejected",
    "summarized_story": "Red Bull driver, Max Verstappen has emerged 2021 Formula 1 champion, beating rival, Lewis Hamilton of Mercedes to the trophy at the Abu Dhabi GP on Sunday.\nHis victory was confirmed after stewards rejected both of Mercedes’ protests over the dramatic late stages of the race.\nOn Sunday night at least, Red Bull and Verstappen were celebrating his maiden F1 title.\n“It’s disappointing we had to go through that,” Red Bull boss Christian Horner told Sky Sports News.\nSoon after, Mercedes lodged their intention to appeal and they now have 96 hours to launch an official appeal, Sky Sports reported."
  },
  {
    "headline": "Nigerian Philanthropist Gets African Achievers Award In London",
    "summarized_story": "The African Achievers Awards is one of Africa’s most prestigious awarding bodies which honours great African Achievers – including African Leaders, Young Achievers, and Community Builders to Captains of Industries, whose works have had a meaningful impact on building Africa.\nThe theme for the 2021 ceremony is; ‘‘Initiating Diaspora Investment for a diversified African Economy’’.\nThe Awards ceremony over the years has become established as one of the biggest gatherings of influential and global African Achievers on the continent.\n“According to population experts, African diaspora is over 40 million.\nThe mobilization of Diaspora investment across the globe is vital to the economic growth of Africa towards sustainable development."
  },
  {
    "headline": "Nigerian Philanthropist Gets African Achievers Award In London",
    "summarized_story": "The African Achievers Awards is one of Africa’s most prestigious awarding bodies which honours great African Achievers – including African Leaders, Young Achievers, and Community Builders to Captains of Industries, whose works have had a meaningful impact on building Africa.\nThe theme for the 2021 ceremony is; ‘‘Initiating Diaspora Investment for a diversified African Economy’’.\nThe Awards ceremony over the years has become established as one of the biggest gatherings of influential and global African Achievers on the continent.\n“According to population experts, African diaspora is over 40 million.\nThe mobilization of Diaspora investment across the globe is vital to the economic growth of Africa towards sustainable development."
  },
  {
    "headline": "SMEDAN Begins Training Of Youths On Business Skills Devt Initiative",
    "summarized_story": "The Small and Medium Enterprises Development Agency of Nigeria (SMEDAN), has begun training for the first batch of youths under the entrepreneurship and vocational components of the National Business Skills Development Initiative (NBSDI).\nThe beneficiaries will be trained in Personal and Business Vision, Business Plan, Identification of Business Opportunities, Selling and Marketing Strategies, Accessing Business Finance, Customer Care and Legal Regulatory Issues.\nThe statement further added that the vocational training, which stated on Monday, December 6, 2021, will inculcate Fashion Design and Tailoring, Leather Works, Photography, Hair Dressing, Block/Brick making, GSM Repairs, Make Up and Tilling in the trainees.\nHe said the agency was determined and committed to train Nigerian youths for them to be self-reliant, adding that the vocational skills and empowerment was an added advantage as SMEDAN will do all in its power to train and empower Nigerian youths.\nHe commended the Director General of SMEDAN, Dr. Dikko Umaru Radda, for throwing his weight behind the initiative, which has gone a long way in impacting positively on Nigeria youths."
  },
  {
    "headline": "SMEDAN Begins Training Of Youths On Business Skills Devt Initiative",
    "summarized_story": "The Small and Medium Enterprises Development Agency of Nigeria (SMEDAN), has begun training for the first batch of youths under the entrepreneurship and vocational components of the National Business Skills Development Initiative (NBSDI).\nThe beneficiaries will be trained in Personal and Business Vision, Business Plan, Identification of Business Opportunities, Selling and Marketing Strategies, Accessing Business Finance, Customer Care and Legal Regulatory Issues.\nThe statement further added that the vocational training, which stated on Monday, December 6, 2021, will inculcate Fashion Design and Tailoring, Leather Works, Photography, Hair Dressing, Block/Brick making, GSM Repairs, Make Up and Tilling in the trainees.\nHe said the agency was determined and committed to train Nigerian youths for them to be self-reliant, adding that the vocational skills and empowerment was an added advantage as SMEDAN will do all in its power to train and empower Nigerian youths.\nHe commended the Director General of SMEDAN, Dr. Dikko Umaru Radda, for throwing his weight behind the initiative, which has gone a long way in impacting positively on Nigeria youths."
  },
  {
    "headline": "Finance Bill 2022: No TIN Required To Operate Bank Account – Presidency",
    "summarized_story": "There are no provisions in the Finance Bill 2022 now before the National Assembly forcing Nigerians to have a Tax ID number in order to operate a bank account, a top Presidency source has clarified.\nAssets partially used to generate taxable income will be eligible for pro-rata capital allowance except where the proportion of non-taxable income does not exceed 20% of the total income of the company.\nDisputed tax assessment to be in abeyance until determination while undisputed tax assessment is to be paid within 30 days after service of the notice of assessment on the company except otherwise extended by the FIRS.\nThe deployment of technology to automate tax administration including assessment and information gathering by FIRS to now include third party technology (previously only proprietary technology may be deployed).\nDeductible life assurance premium for personal income tax purposes to exclude a contract for deferred annuity."
  },
  {
    "headline": "Man set ablaze in Osun after gun, machete failed to penetrate him",
    "summarized_story": "Man set ablaze in Osun after gun, machete failed to penetrate himMan set ablaze in Osun after gun, machete failed to penetrate himA middle-aged suspected cultist identified as Victor has been set ablaze by rival cultists after bullets and machete failed to harm him.\nThe Nation gathered that the incident occurred around Akede area of Osogbo, the capital of Osun State.\nA resident told our correspondent that Victor was chased to the area and was shot repeatedly but the bullet did not penetrate.\n“The cultists poured petrol on him and set him ablaze.\nHe did not die but severely burnt.”The spokesperson of Osun State Police Command, Yemisi Opalola, confirmed the incident on Sunday."
  },
  {
    "headline": "Man set ablaze in Osun after gun, machete failed to penetrate him",
    "summarized_story": "Man set ablaze in Osun after gun, machete failed to penetrate himMan set ablaze in Osun after gun, machete failed to penetrate himA middle-aged suspected cultist identified as Victor has been set ablaze by rival cultists after bullets and machete failed to harm him.\nThe Nation gathered that the incident occurred around Akede area of Osogbo, the capital of Osun State.\nA resident told our correspondent that Victor was chased to the area and was shot repeatedly but the bullet did not penetrate.\n“The cultists poured petrol on him and set him ablaze.\nHe did not die but severely burnt.”The spokesperson of Osun State Police Command, Yemisi Opalola, confirmed the incident on Sunday."
  },
  {
    "headline": "Villagers flee Imo communities, as gunmen kidnap two monarchs, youth leader, raze palaces",
    "summarized_story": "Gunmen have kidnapped two traditional rulers in the Okigwe local government area of Imo state and burnt their palaces.\nThe incident which happened early hours of Sunday forced so many of the villagers to abandon their homes out of fear.\nThe affected monarchs were the traditional ruler of Amagu Ihube Autonomous Community Eze Acho Ndukwe and the traditional ruler of Ihitte Ihube Autonomous Community, Eze Paul Ogbu both in the Okigwe local government area in the state.\nAt the time of filing this story the state Police Public Relations Officer, PPRO, Mike Abattam, said the command has commenced an investigation.\nA new community strategy is what we have developed.” VanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Villagers flee Imo communities, as gunmen kidnap two monarchs, youth leader, raze palaces",
    "summarized_story": "Gunmen have kidnapped two traditional rulers in the Okigwe local government area of Imo state and burnt their palaces.\nThe incident which happened early hours of Sunday forced so many of the villagers to abandon their homes out of fear.\nThe affected monarchs were the traditional ruler of Amagu Ihube Autonomous Community Eze Acho Ndukwe and the traditional ruler of Ihitte Ihube Autonomous Community, Eze Paul Ogbu both in the Okigwe local government area in the state.\nAt the time of filing this story the state Police Public Relations Officer, PPRO, Mike Abattam, said the command has commenced an investigation.\nA new community strategy is what we have developed.” VanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "BREAKING: NFF Sacks Rohr, Appoints Eguavoen Super Eagles Interim Coach",
    "summarized_story": "Gernot Rohr’s contract as coach of the Super Eagles has been terminated by the Nigeria Football Federation.\nFollowing that, the football federation appointed Augustine Eguavoen, its current Technical Director, as the Super Eagles’ Technical Adviser on an interim basis.\nThe statement added, “Following a virtual meeting of the NFF Executive Committee on Sunday, it was decided that Eguavoen will work with Salisu Yusuf (Chief Coach); Paul Aigbogun (Assistant Coach); Joseph Yobo (Assistant Coach); Dr Terry Eguaoje (Assistant Coach) and Aloysius Agu (Goalkeeper Trainer).\nWe thank him for his services to the Super Eagles and Nigeria,” he added.\nHe was the Super Eagles’ on-field captain when they won the Africa Cup for the first time on foreign soil in Tunisia 27 years ago."
  },
  {
    "headline": "My Brother Wasn’t Kidnapped By Bandits — Sheikh Gumi",
    "summarized_story": "Sheikh Ahmed Gumi has denied that his brother was abducted by bandits.\nGumi called the reports “mischievous, deceptive, and diversionary” in a statement received by Vanguard.\nMalamTukur Mamu, the Dan-Iyan Fika and Media Consultant to Gumi, who signed the statement opined: “Our attention was drawn to yet another fake news that the biological brother of Sheikh Dr. Ahmad Abubakar Gumi has been kidnapped by bandits.\nThe story some sections of the media are deliberately misquoting to give a picture “that the brother of the person supporting the bandits has also been kidnapped” is mischievous, misleading and diversionary.\nA driver of his father was also killed by the same bandits."
  },
  {
    "headline": "I Have No Reason To Dump PDP For APC — Zamfara Lawmaker",
    "summarized_story": "Usman Zurmi, a lawmaker in the Zamfara State House of Assembly, has questioned why Governor Bello Mohammed Matawalle is bothering the state’s number one opposition party, the PDP, claiming that he was elected Governor of the state through the party he is now haunting.\nThe lawmaker told DAILY POST in Gusau, the state capital, that the APC-led government in the state is unwilling to accept any opposition.\n“I don’t have any problem with my colleagues because of my refusal to defect to APC.\nZurmi to abandon the PDP in favor of the APC, he said, because the PDP brought him to the House and he would not betray the trust.\nWhen Governor Bello Mohammed Matawalle, his followers, and members of the State House of Assembly defected to the All Progressive Congress (APC), the lawmaker refused to join them."
  },
  {
    "headline": "BREAKING: Hausa Group Calls For Buhari’s Resignation, Says President Spares Fulani Bandits But After Kanu, Igboho",
    "summarized_story": "The Hausa Association of Nigeria (Kungiyar Hausawan Nijeriya or KUNHAN) has called on President Muhammadu Buhari to resign as a result of his administration’s apparent failings.\nThe association noted that the “Hausas regret supporting and voting” for Buhari massively.\nOn so many occasions, you have bragged to crush the bandits and proclaimed to take necessary action but all in vain.\nThe answer is one, because they are not a threat to this administration while those that seem to be a threat are already in jail; Nnamdi Kanu and Sunday Igboho.\n“That’s why a whole Minister of Information named them just an ordinary criminal but called Nnamdi Kanu a terrorist."
  },
  {
    "headline": "Breaking: Fire outbreak engulfs filling stations in Anambra, buildings, vehicles affected (VIDEO)",
    "summarized_story": "Two filling stations located close to Onitsha-Enugu expressway are said to have been engulfed by fire.\nThe incident which its cause was not ascertained as at the time of filling this report spilled to closeby buildings and vehicles.\nMen of the state fire service are reportedly battling the fire incident in a bid to bring it under control.\nA short video clip obtained via social media revealed a nearby persons clamouring for help to quench the ranging fire.\nDetails loading…"
  },
  {
    "headline": "Breaking: Traditional rulers go into hiding as gunmen invade Imo communities, kidnap 2, set palaces on fire",
    "summarized_story": "Gunmen on Sunday kidnapped two traditional rulers in Okigwe area of Imo state.\nThe hoodlums also set palaces ablaze.\nThis is happening barely two days after the gunmen killed a traditional ruler and dump his body inside a car.\nPolice authorities are yet to confirm the incident as at the time of filling this report.\nDetails loading…"
  },
  {
    "headline": "Breaking: Despite taking double vaccine doses, South Africa’s President, Cyril Ramaphosa, tests positive for COVID-19",
    "summarized_story": "South African President Cyril Ramaphosa is receiving treatment for mild Covid-19 symptoms after testing positive on Sunday, the office of the presidency said in a statement.He has delegated all responsibilities to Deputy President David Mabuza for the next week.\nRamaphosa “started feeling unwell after leaving the State Memorial Service in honor of former Deputy President FW de Klerk in Cape Town earlier today,” the presidency statement said.\nHe is however “in good spirits” and is being monitored by the South African Military Health Service of the South African National Defence Force.\n“President Ramaphosa says his own infection serves as a caution to all people in the country to be vaccinated and remain vigilant against exposure.\nRamaphosa, who is fully vaccinated, recently returned from a trip in West Africa."
  },
  {
    "headline": "Panic Grips Zamfara Communities As Gunmen Impose Over N1m Levy",
    "summarized_story": "Gunmen have demanded over N1 million as levies from different communities in the Zurmi, Kaura Namoda and Birnin-Magaji local government areas of Zamfara State.\nWhile noting that some communities are yet to raise the money before the December 11 deadline given by the gunmen, he said the situation has caused panic in the affected areas.\nREAD ALSO: NDLEA Arrests Ghanaian, Two Others With 9.9kg Cocaine, Meth“Gabaken Mesa has paid N1 million, Gabaken Dan-Maliki N1 million and Birnin Tsaba N1 million, just to mention but few,” Aliyu said.\nHe said the state government is aware of the levy imposed on these communities but assured that the government is working with the security agencies to ensure that the communities are secured.\n“The said government is working with the security agencies to make sure that these communities are secured,” the commissioner said."
  },
  {
    "headline": "Buhari Condoles With US As Tornadoes Kill Many, Destroy Property",
    "summarized_story": "President Muhammadu Buhari has extended the sympathies of the nation to the government and people of the United States following devastating tornadoes that ripped across six states, leaving destruction and death on their trail.\n“The destruction of whole towns, flattening of houses, schools, hospitals, businesses and other social infrastructure on a scale never seen before is deeply saddening,” President Buhari said in a statement signed on Sunday by his Senior Special Assistant on Media & Publicity, Garba Shehu.\nSevere weather wreaked havoc in multiple southeastern and south-central US states on Friday.\nAt least 94 were reported killed on Sunday and towns were left in ruin.\nEmergency crews also raced against time to find dozens who were still trapped in various buildings."
  },
  {
    "headline": "SERAP Asks Lawan, Gbajabiamila To Probe ‘Missing N10bn NASS Funds In 2019’",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) has urged the Senate President, Ahmad Lawan, and Speaker of House of Representatives Mr Femi Gbajabiamila to investigate the N10 billion funds budgeted to the National Assembly said to be missing.\nSERAP added, “As part of its legislative and oversight functions, the National Assembly has a key role to play in the fight against corruption in the country.\nBut the National Assembly can only effectively perform its anti-corruption role if it can demonstrate exemplary leadership to probe the allegations of corruption and mismanagement involving the legislative body.\nThe National Assembly, therefore, has a responsibility to curb it.\n“The National Assembly Service Commission reportedly paid N31,927,760 as cash advances to 59 staff but failed to account for the money."
  },
  {
    "headline": "Young Graduates Can Solve Nigeria’s Biggest Problems, Says Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo on Saturday expressed optimism that young Nigerian graduates can provide solutions to the biggest challenges confronting the nation.\nHe made the remark while speaking at the 60th anniversary of the Obafemi Awolowo University (OAU), Ile-Ife, in Osun State, according to a statement signed by presidential spokesperson, Laolu Akande.\nYou will have to confront the problems of climate change and a world moving away from fossil fuels, and you will usher in the age of renewable energy and green solutions,” the Vice President said.\nHe added that this generation of young Nigerians are equipped and could proffer solutions in the areas of education, agriculture, health care and security.\nAt the end of the Convocation, the Vice Chancellor of the University, Prof. Eyitayo Ogunbodede, conducted the VP and other dignitaries around an arts exhibition to commemorate the event."
  },
  {
    "headline": "Omicron: Nigeria’s Plan To Red List UK, Others Not ‘Tit-For-Tat’",
    "summarized_story": "﻿The Minister of State, for Health, Adeleke Olorunnimbe Mamora, has given further insight into the Federal Government’s plan to place on a red-list, countries that have placed Nigeria on a red-list in the wake of a new Omicron variant of the COVID-19.\nDr Mamora who was a guest on Channels TV’s News @ 10, said contrary to claims that the said plan was on a tit-for-tat basis, the move is only expected to be in the best interest of the country.\n“I don’t want you to look at it from that angle, (the tit-for-tat perception).. No, it’s not that.\n“But most importantly in all this, is the fact that we have every right to determine what is best for us,” the Minister said.\nREAD ALSO: Omicron: UK Red Listing Nigeria Is Unjust, Discriminatory – Lai Mohammed"
  },
  {
    "headline": "ECOWAS council considers two-term limits for presidents in the region",
    "summarized_story": "ECOWAS council considers two-term limits for presidents in the region"
  },
  {
    "headline": "Akeredolu's aide accuses Federal Fire Service of damaging his vehicle -",
    "summarized_story": "A Special Assistant to the Ondo state Governor, Oluwarotimi Akeredolu on Multimedia, Olugbenga Asade, has accused the Federal Fire Service Corps (Ondo State) of damaging his vehicle.\nHe noted that two months after damaging his vehicle, nothing has been done to fix it by the fire fighters.\nThey declined my request to see the driver that crashed my vehicle.\nHe therefore requested, that the Federal Fire Service Corps should provide the truck driver that crashed his vehicle with an apology for absconding and as well, take responsibility of fixing his damaged vehicle.\nAccording to him, the Federal Fire service in the state has continued to turn deaf ears to his plea."
  },
  {
    "headline": "[WATCH] Bisi Akande unveils Autobiography entitled 'My Participations'",
    "summarized_story": ""
  },
  {
    "headline": "Updated: 28-year-old female lawyer nominated commissioner in Nasarawa -",
    "summarized_story": "A 28 year old female lawyer, Hannah Bala, has been nominated as a Commissioner by the Nasarawa State Governor, Abdullahi Sule.\nThe nomination of the female lawyer was announced at the state House of Assembly by the Speaker, Ibrahim Balarabe.\nThis follows the presentation of fifteen commissioner nominees to the assembly for consideration.\nSpeaking on her nomination, the Nasarawa State governor, Abdullahi Sule through his Chief Press Secretary, said the decision is to encourage and ensure active participation of the youths in governance.\nHannah graduated from the Nasarawa State University Keffi in 2016 and proceeded to the Nigerian law school where she graduated in 2018."
  },
  {
    "headline": "Ojodu Truck Accident – Families of Victims Demand Probe",
    "summarized_story": "1 of 9 - +The truck accident that killed at least two schoolchildren in Ojodu area of Lagos on Tuesday throws up questions about the safety of school children in Lagos and by extension Nigeria.\nFourteen year old Adedoyin Adebayo and another fourteen year old, Israel Taiwo Apolebi of the Babs Fafunwa Millenium Secondary School Ojodu, were killed in the accident while not less than 18 others sustained various degrees of injuries.\nARISE News has been visiting the homes of some of the affected victims where family members are still finding it difficult to come to terms with the tragedy and demanding that a proper investigation be carried out into the cause of the accident and justice served on those found responsible.\nTokunbo Oyetunji has the details."
  },
  {
    "headline": "South African Doctors See Signs Omicron is Milder Than Delta",
    "summarized_story": "As the omicron variant sweeps through South Africa, Dr. Unben Pillay is seeing dozens of sick patients a day.\nThat’s one of the reasons why he, along with other doctors and medical experts, suspect that the omicron version really is causing milder COVID-19 than delta, even if it seems to be spreading faster.\nWhile delta is still the dominant coronavirus strain worldwide, omicron cases are popping up in dozens of countries, with South Africa the epicenter.\nPillay says his COVID-19 patients during the last delta wave “had trouble breathing and lower oxygen levels.\nPillay is a director of an association representing some 5,000 general practitioners across South Africa, and his colleagues have documented similar observations about omicron."
  },
  {
    "headline": "Crews Search for the Missing after Devastating Tornadoes Hit Central US",
    "summarized_story": "Andy Beshear said, as crews sifted through the wreckage of the candle factory in Mayfield, where 110 people were working overnight Friday when the storm hit.\nThe storm was all the more remarkable because it came in December, when normally colder weather limits tornadoes, he said.\nKentucky State Trooper Sarah Burgess said rescue crews were using heavy equipment to move rubble at the candle factory.\nRescue efforts were complicated because Mayfield’s main fire station and emergency services hub were also hit by the tornado, Creason said.\nIt’s a total destruction.”Four storm-related deaths were confirmed in northwestern Tennessee, the Tennessee Emergency Management Agency said."
  },
  {
    "headline": "Cameroon Legend Samuel Eto’o Elected President of His Country’s Football Federation",
    "summarized_story": "Four-time African Footballer of the Year Samuel Eto’o was elected president of the Cameroon Football Federation (FECAFOOT) on Saturday, deposing the incumbent after a disputed campaign a month before the country hosts the African Cup of Nations.\nThe former Cameroon striker, who lifted the Champions League with Barcelona and Inter Milan, won the election with 43 votes from members of FECAFOOT’s general assembly.\nOutgoing president Seidou Mbombo Njoya, who is also a Confederation of African Football vice president, got 31 votes.\nEto’o, 40, will take over an organisation long tainted by infighting, mismanagement and allegations of corruption.\nHe received widespread support from many former team mates in a high profile campaign during which he pledged to rid the game in Cameroon of corruption."
  },
  {
    "headline": "Nigeria: Don’t Direct Yoruba to Support Any Aspirant in 2023, Obasanjo Tells Ooni",
    "summarized_story": "Former President Olusegun Obasanjo on Saturday urged the Ooni of Ife, Oba Adeyeye Ogunwusi, not to direct the Yoruba people to support any aspirant in the 2023 general election.\n“Don’t direct Yoruba people to support any aspirant, as we don’t all go in the same direction, which is part of our strength in Yoruba land,” he said.\nHe advised the monarch to strike a balance between his role as a royal father and politics in Yoruba land.\n“All the sons and daughters of Yoruba land, no matter where they are or their standpoint, will come to meet you.\n“Don’t direct Yoruba people to support any aspirant, as we don’t all go in the same direction, which is part of our strength in Yoruba land,” Obasanjo said."
  }
]