[
  {
    "headline": "Being rich different from being wealthy, says actress Eucharia Anunobi",
    "summarized_story": "Veteran actress and preacher, Eucharia Anunobi, on Saturday told her fans that being rich was different from being wealthy.\nShe made this known in a video on her Instagram page, where she admonished her followers about reaping what they have sown.\nThe preacher, who goes by the title ‘Apostle’, also gave differences between two words that are usually closely associated.\nBeing rich is not the same as being wealthy.\nYou get it?”The preacher is famous for sharing daily words of exhortation on her Instagram page."
  },
  {
    "headline": "We were sleeping when gunmen kidnapped my father –Bayelsa commissioner’s daughter",
    "summarized_story": "Gunmen have abducted the Bayelsa State Commissioner for Industry, Trade and Investment, Federal Otokito.\nHe was kidnapped on Thursday night at his residence in Otuokpoti in the Ogbia Local Government Area of the state.\nApparently angered by the commissioner’s decision to abort their plan, the armed oil thieves were said to have stormed Otokito’s house at about 11pm on Thursday and gained entrance through the kitchen.\nNarrating what happened, she said, “My father, mother, brother and sisters were sleeping when our power generating set went off.\nThe chairman of the Otuokpoti Community Development Committee, Anthony Azibaloa, condemned the abduction of the commissioner saying it as unacceptable and provoking."
  },
  {
    "headline": "[VIDEO] Big one for Wizkid Fc and 30BG gang as Davido and Wizkid finally hug it out at a party",
    "summarized_story": "[VIDEO] Big one for Wizkid Fc and 30BG gang as Davido and Wizkid finally hug it out at a party"
  },
  {
    "headline": "APC Chairman: Tinubu visits Sen Musa, says his sacrifices to the party will not go in vain",
    "summarized_story": "Musa shall surely be rewardedBy Henry Umoru, ABUJAAHEAD of the February 26 National Convention of the All Progressives Congress, APC, the National Leader of the party, Asiwaju Bola Tinubu Saturday morning paid a visit to the Chairman, Senate Services Committee, Senator Sani Musa, APC, Niger East.\nThe former Lagos State Governor who visited Senator Musa in his Maitama, Abuja residence, assured the latter who is a frontrunner in the National Chairmanship position of the APC that the contribution he made to the party will not go in vain.\nAlso Read:2023: Only God can direct me on my successor – OkowaAccording to Tinubu, a Presidential aspirant on the platform of the APC, Senator Musa(313) will surely be rewarded by the party following his contributions to the success of the party in 2014/ 2015.\nTinubu said, “The sacrifices of Distinguished Senator Mohammed Sani Musa for the All Progressives Congress in 2014/2015 will not go in vain, the leadership of the ruling All Progressives Congress are fully aware, Inshallah, he will be rewarded.”Sani Musa 313 is a qualified National Chairmanship aspirant with a blueprint for the New Vision of the party in a New Direction for electoral victory.\nVanguard News Nigeria"
  },
  {
    "headline": "Delta 2023: Onwordi urges Delta opposition parties not to contest",
    "summarized_story": "OnwordiDelta-born Businesses man, philanthropist, People’s Democratic Party PDP Chieftain Mr. James Endurance Onwordi has urged opposition parties in Delta State not to contest in 2023 general election.\nAccording to him, There is no need for opposition parties contesting because they won’t succeed and there is no need wasting money on campaigns.\nREAD ALSO:Reps’ bill to NYSC Trust Fund scales through second readingOnwordi who commended the Delta State Governor Sen Ifeanyi Okowa also noted that as a result of Okowa’s landmark strides, Delta has become home to all well-meaning persons, groups and industries.\n“As we approach the 2023 general election, I am urging opposition parties in the state not to contest for any of the elections.\n“It’s a clear fact that they won’t succeed because of how strong PDP is in Delta State."
  },
  {
    "headline": "Attacks on Custodial centres, threat to Nigeria’s sovereignty — CG",
    "summarized_story": "Omeiza Ajayi, AbujaController General, Nigerian Correctional Service NCoS, Haliru Nababa has charged officers and men of the Corps to do more to ward off external attacks on custodial centres, saying the development portends grave danger to the country’s sovereignty.\nNababa gave the charge Friday in Abuja in a message to the management and staff of the service.\n“As you all are aware, our dear country is sadly challenged with a lot of security issues resulting in a series of external jail attacks.\nAlso Read:2023 polls may not hold over resurgence of kidnap attempts in S-West – YCE“Therefore, we intend to revive our Industries and strengthen our Farm Centres to enhance inmates training and value reorientation.\nThe Service now emphasizes the training of inmates in preparation for their reintegration into the society as useful and responsible citizens”, he explained."
  },
  {
    "headline": "Clamour for equity and justice In Nigeria!",
    "summarized_story": "Clark further accused former President Obasanjo for displaying hate attitude against the people of the oil producing areas of Nigeria.\nThe former President denied claims that he hated the people of the Niger Delta origin, adding that he had never shown any anger or distraught with Niger Delta region nor any part of Nigeria.\nAlex Moro, author of “Ownership of Petroleum in Nigeria” was right when he said in his book that: “These laws and constitutions governing petroleum in Nigeria are lifted from colonialism”.\nAnother offensive Law is in the Petroleum Industry Act (PIA) in Section 2 which violates the ownership rights of petroleum resources of Niger Deltans.\nWhat the people of the Niger Delta are asking for is: Equity, fairness and justice in the Nigerian State."
  },
  {
    "headline": "2023: CSO resolves to champion advocacy on Southern presidency",
    "summarized_story": "Civil Society Organizations under the auspices of Coalition of Civil Society Groups, CCGS, have resolved to support the southern presidency in the 2023 general elections.\nIt appealed to the ruling All Progressive Congress (APC), the People’s Democratic Party (PDP) and other political parties to be interested in the unity, equity and equality and to zone their presidential tickets to the Southern part of the country in 2023 general elections.\nAccording to the group, the north having held sway since 2015, would have the moral and political right to zone presidency to the South.\nIt noted that this is lawful and can guarantee peace and unity of the country, saying that there won’t be either APC or PDP if there is no country called Nigeria.\nIt explained that it baffles the coalition that as the debate intensifies, most of those involved don’t know what is generally at stake especially as it relates to the unity of the country."
  },
  {
    "headline": "Benue Youths hail Gov Ortom over recent update on security, anti-grazing law",
    "summarized_story": "The Benue Youth Forum, BYF has lauded Governor Samuel Ortom over his recent comments on amended Open Grazing Prohibition and Ranches Establishment Law, 2017.\nThe statement reads, “The Governor was right when he said the Open Grazing Prohibition and Ranches Establishment Law of Benue State has been successfully enforced with great achievements recorded.\nIt is a clandestine support from him to the altracious killings by the armed Fulani herdsmen”.\n“The President’s poor handling of the economy has made Nigerians poor and hungry, with a high rate of unemployment and a staggering debt profile.\nNothing is working and we citizens of this country cannot wait for the expiration of an insensitive administration of the Buhari led Federal Government before we raise our voices”."
  },
  {
    "headline": "Fire guts newly built LAMATA terminal in Ajah",
    "summarized_story": "The new Lagos Metropolitan Area Transport Authority (LAMATA) terminal in Ajah has been consumed by fire.\nThe cause of Saturday morning inferno is yet to be ascertained.\nThe state government intervened swiftly by mobilizing the Fire Service Unit to the scene after emergency calls.\nThe Lagos State Transport Management Authority (LASTMA) confirmed the inferno had been put out.\n“The earlier reported fire incident at LAMATA newly constructed shelter at Ajah is put off now."
  },
  {
    "headline": "Rumoured bomb blast at Al-Qalam University in Katsina fake",
    "summarized_story": "The management of Al-Qalam University, Katsina has dispelled trending reports on social media that the Institution’s campus was bombed on Friday.\nThe disclaimer was made in a press statement issued by the Head of Public Affairs of the university, Atiku A. Atiku.\nAtiku described the purported bomb blast trending on social media as “unfortunate, unfounded, fake and misleading.”He called on “the general public to disregard the fake information, assuring that the University is completely safe.”On what actually transpired, Atiku said, “the tyre of a moving truck along Dutsinma Road busted around 8.30pm but mischief makers capitalized on the incident to say that there was a bomb blast inside the University.”Atiku, however, noted that efforts are ongoing to fish out the source of the purported rumour which threw the campus and its environment into confusion."
  },
  {
    "headline": "CACOL backs Reps probe of ‘missing’ 178,459 police firearms",
    "summarized_story": "Centre for Anti-Corruption and Open Leadership (CACOL) has endorsed the House of Representatives’ move to investigate “missing” 178,459 police firearms.\nThe House has mandated its Ad hoc Committee on Arms to investigate findings by the Auditor-General of the Federation, Adolphus Aghughu.\nThe CACOL chairman wondered how funds budgeted over the years for firearms, welfare, logistics and capacity building vanished into thin air.\nAdeniran called the missing firearms a tip of the iceberg, considering the “monumental misappropriation” going on in police procurement.\n“It is a known fact that the Police Force has been permanently incapacitated, disabled and rendered helpless majorly by the non-availability of firearms."
  },
  {
    "headline": "What you probably didn’t know about Super Eagles goalkeeper Maduka Okoye",
    "summarized_story": "What you probably didn’t know about Super Eagles goalkeeper Maduka OkoyeSuper Eagles’ first-choice goalkeeper, Maduka Okoye has been the cynosure of all eyes especially ladies in the ongoing Africa Cup of Nations (AFCON) 2021.\nThe German-born goalie made his debut for the Super Eagles against Brazil in October 2019 when he was valued at €150,000 and still struggling at Fortuna Dusseldorf.\nMaduka Emilio Okoye (born 28 August 1999) was born in Düsseldorf to a Nigerian father and a German mother.\nOn 9 May 2019, Maduka was again invited to the Nigerian U23 Team for the 2019 African U-23 Cup of Nations qualifier against Sudan U-23.\nOn 14 August 2019, Rohr invited Maduka for a friendly against Ukraine that was played on 10 September 2019 in Dnipro-Arena."
  },
  {
    "headline": "ROUND OF 16 CRACKER: Nigeria faces old foe Tunisia as Burkina Faso battle Gabon",
    "summarized_story": "Nigeria will square up against Tunisia in the Round of 16 of the 2021 Africa Cup of Nations.\nPrior to their last Group F showdown against the Scorpions, the North Africans needed a win to finish as runners-up.\nThe West Africans squared up against the North Africans for the first time in the third-place game of Ghana 1978.\nTwo years later in the competition, Nigeria avenged their loss by silencing the Tunisians in the quarter-final at the Port Said Stadium.\nIn the other blockbusters of the last 16, Egypt take on Cote d’Ivoire and Nigeria play Tunisia."
  },
  {
    "headline": "Bayelsa vows to weed out illegal academic institutions",
    "summarized_story": "Bayelsa State government has vowed that it is going to weed out illegal academic institutions operating in the state.\nIt noted that it was doing all it could to improve the standard of education by ensuring that illegal academic institutions were not condoned.\nGentle Emelah, revealed this at a press conference in Yenagoa to herald the 2022 Bayelsa State Education Summit.\n- Advertisement -But he frowned at a situation where parents preferred ill-equipped private schools with poorly trained teachers to public schools that have better trained teachers and well equipped with modern teaching tools.\nWithin same year, the ministry embarked on two inspection tours of primary and secondary schools across the state."
  },
  {
    "headline": "Okowa dissolves Delta State Traditional Rulers’ Council",
    "summarized_story": "Delta Governor, Dr. Ifeanyi Okowa, has dissolved the Delta State Traditional Rulers Council following agitation by some prominent monarchs in the State.\nUntil its dissolution, the Delta State Traditional Rulers Council was led by Obi of Owa, Dr. Emmanuel Efeizomor II, who was appointed following the demise of Olu of Warri, Ogiame Atuwatse 11, in 2015.\nThe dissolution was contained in a statement signed, yesterday, by the Secretary to the State Government (SSG), Mr. Patrick Ukah.\nAccording to the SSG, the dissolution was sequel to the expiration of the tenure of the Council.\nA statement trending on social media signed by one Basil Okoh, the Dein of Agbor accused Dr. Efeizomor, of perpetrating himself in office as Chairman, Council of Traditional Rulers of Delta State."
  },
  {
    "headline": "Okorocha to Uzodimma: don’t use Somotochukwu’s death to justify killings",
    "summarized_story": "Former governor of Imo State, Senator Rochas Okorocha on Friday accused Governor Hope Uzodimma of using the death of an 11 year old boy, Somotochukwu killed by stray bullet during relocation of Ekeukwu market in Owerri to justify killings in Imo.\nImo State Government on Thursday alleged that, Okorocha ordered for the killing of the 11-year old boy during the relocation of Ekeukwu market in Owerri.\nBut Okorocha in a statement by his Media Adviser Sam Onwuemeodo on Friday accused Governor Uzodimma of using the death of the boy to justify the carnage going on in Imo.\n“If he didn’t go after the politicians behind the resistance to the relocation of Ekeukwu market.\nThen why should he have gone against an innocent boy 11- year old boy.”"
  },
  {
    "headline": "Fears, jitters over rise in kidnapping, banditry in South-West",
    "summarized_story": "Eight villages in the Imeko-Afon Local Government Area of Ogun State recently fell victims.\nIn Ondo State, some herdsmen attacked farmers in some communities located in two local government areas of the state and Akoko division leading to death of five people.\nIn recent times, there had been reported cases of kidnapping in the Ogun State axis of the Lagos-Ibadan Expressway.\nSome cases of kidnapping resulted in payment of ransom running into millions of naira while some led to the death of the victims.\nOgun State government says it will not allow any part of the state to be taken over by terrorists, killer herdsmen, kidnappers or bandits as a safe haven to unleash mayhem on the people."
  },
  {
    "headline": "I need a rich man with strong manhood –Omalicha Elom",
    "summarized_story": "The light-skinned script interpreter, who always insists on not dating or marrying a younger lover, has gone a step further.\nIn a recent encounter with Saturday Sun, Ms. Elom says for a man to have her for keeps, he must not only be wealthy, such a man must also be blessed with a good and strong manhood!\nI can’t be submissive to a younger lover; I’m too strong-headed.\n“Dating a younger lover would make it seem like a small child caressing my breasts.\nOn the other hand, I can’t also date a much older man."
  },
  {
    "headline": "AMCON takes over Ibadan Disco for loan default",
    "summarized_story": "By Adewale SanyaoluThe Asset Management Company of Nigeria(AMCON) has taken over the majority stake in Integrated Energy Distribution amd Marketing(IEDM) Limited, the core investor in Ibadan Electricity Distribution Company(Ibadan Disco).\nAMCON executed the takeover of IEDM following a default in a loan servicing agreement executed with Polaris Bank.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nPrior to yesterday’s take over of Ibadan Disco by AMCON,NERC had in 2017 fined IBEDC a sum of N50 million for non-compliance with Order No.\nNERC/181/2018 of June 19th 2018, suspended the Board of Directors and other key management staff of IBEDC on account of the company’s default in the recovery of the inappropriate shareholder loan of granted to IEDM by the utility company."
  },
  {
    "headline": "2023: We’re talking with stakeholders to zone presidency to",
    "summarized_story": "By Chinelo ObogoSenate Chief Whip, Orji Kalu, has said he and others are discussing with stakeholders in the All Progressives Congress (APC), from other zones to zone the party’s presidential ticket to South East.\nSpeaking on Silverbird TV on Friday, the former Abia State governor said a president of Igbo extraction will change the fortunes of Nigeria.\n“We are talking to other zones in the country to see that the South East has never produced a president and this conversation is going on very well.\nIf we have a President from the South East, you can be assured that everyone will win.\nIn Abia State, I am the leader of the APC and my relationship with the party is very cordial."
  },
  {
    "headline": "Why National Assembly must pass Gender and Equal Opportunity Bill -Bisi Fayemi",
    "summarized_story": "Wife of Ekiti State governor and chairperson of Nigerians Governor Forum Wives, Bisi Fayemi, recently spoke at the just concluded first-ever National Progressive Women’s Conference.\nSo for example, we have a Gender and Equality Opportunities law in Ekiti State and 35 per cent affirmative action is a part of that legislation in the state.\nI, for example, I have had structures to mobilise Ekiti women in politics since 2006, when my husband first decided to run for office.\nAnd it is not as if Ekiti women were not organising before, they were but their efforts were not being recognised.\nSo I created a broad network of what we call women stakeholders, across all the 16 local governments in Ekiti State."
  },
  {
    "headline": "Confusion Reigns in APC over Chairmanship, Buni Scheming",
    "summarized_story": "One of the chairmanship aspirants from the zone and the Minister of Special Duties, George Akume, yesterday insisted that the party had zoned the chairmanship to North-central and commended the party’s leadership for doing so.\nMustapha who spoke through his media aide, Dapo Okunbanjo said he remained the frontrunner for the number one party position.\nThe source said: “Buni wants to remain National Chairman; forcing him to organise a National Convention was just a temporary setback.\nThe plan is to declare the National chairmanship position open to the entire North, so that he can contest.\nThis guy wants to conduct the 2023 APC primaries and it will be tough stopping this ambition,” added the source."
  },
  {
    "headline": "CBN Introduces Single Window Price Portal for Imports and Exports",
    "summarized_story": "The apex bank pointed out that the new regulation aims to achieve accurate value from import and export items in and out of the country.\nThe new system will operate on a Global Price Verification Mechanism guided by a benchmark price, the bank explained.\nThe benchmark price is the actual spot market price obtainable at the time of consummation of invoicing in that market where the goods are traded.\nSuch would be required to submit their invoices regardless of the individual value of an invoice.\nExemptions were also granted to import and export transactions made by all security agencies in the country."
  },
  {
    "headline": "At World Economic Forum, Osinbajo Warns Multilateral Finance Institutions against Defunding Oil, Gas Projects in Africa",
    "summarized_story": "We are emphatic in our view that natural gas, which Africa has in abundance, must be accepted as a transition fuel.\nThe vice president lamented that less than 10 per cent of African countries had vaccinated 40 per cent of their population.\nWe have to look at issues around patent rights, intellectual property rights, and exclusivity rights; especially if we’re going to improve the chances of African countries to manufacture vaccines locally.\nBut we can’t really talk about African countries producing their own vaccines if we don’t address those important structural problems.\nOsinbajo said it was time for the international community to “walk the talk” by meeting its commitments towards advancing growth in developing economies, especially climate change obligations."
  },
  {
    "headline": "Buhari: El-Rufai is Writing His History in Letters of Gold",
    "summarized_story": "*Vows never to let anyone impose himself on NigeriansDeji Elumoye in Abuja and John Shiklam in KadunaPresident Muhammadu Buhari, yesterday, while inaugurating some projects in different parts of Kaduna State, gave a generous pass mark to the Northwestern state governor, Malam Nasir El-Rufai, saying he was writing history in letters of gold.\nIn yet, another instance, an overly impressed Buhari added: “Thank you very much, Your Excellency, and remarkably, you became my governor.\nHe praised Governor El-Rufai for completing people-oriented projects in the Kaduna metropolis as well as other senatorial districts in the state.\nReminiscing on the unfortunate incident, which claimed the lives of many innocent Nigerians, Buhari thanked God for sparing his life on that fateful day along Ali Akilu road, Kawo-Kaduna.\nBuhari is expected to be in Zaria today to commission more road projects under the Urban Renewal Programme."
  },
  {
    "headline": "IMF Proposes $50bn Trust Fund to Help Low-income Countries",
    "summarized_story": "Ndubuisi FrancisAs the COVID-19 pandemic continues to exert heavy strain on the global economy, the International Monetary Fund (IMF) is proposing a $50 billion trust fund which could help low-income and vulnerable middle-income countries to build resilience and sustainability.\nThe trust fund is part of IMF’s options for channeling some of the $650 billion Special Drawing Rights (SDRs) issued in August 2021 to countries with strong external financial positions as well as vulnerable countries through a Resilience and Sustainability Trust (RST).\nLike the IMF’s highly concessional and currently zero interest rate Trust for low-income countries, the RST’s resources would be mobilised on a voluntary basis from members who wish to channel their SDRs or currencies for the benefit of poorer or vulnerable countries.\nThe IMF stated: “Even as countries continue to battle COVID-19, it is crucial not to overlook the longer-term challenge of transforming economies to become more resilient to shocks and achieve sustainable and inclusive growth.\nIt added that the RST’s central objective was to provide affordable long-term financing to support countries as they tackle structural challenges."
  },
  {
    "headline": "Insurgency is still a present danger in the north-east, says UN",
    "summarized_story": "Martin Griffiths, head of the United Nations Office for the Coordination of Humanitarian Affairs in Nigeria, says insurgents are still ravaging the north-east.\nIn an interview with the Associated Press on Friday, Griffiths said the situation is still a “grave, clear and present danger”.\nEarlier in the week, a video was released by SITE Intelligence Group — a jihadist monitoring organisation, which showed young militants around 12 years old shooting two men dressed in Nigeria military uniforms.\nThe video also showed many young fighters receiving military training.\n“This is a very different kind of operation and very difficult also to deter … a grave, clear and present danger, obviously, to the people and a priority for the government."
  },
  {
    "headline": "Insurgency is still a present danger in the north-east, says UN",
    "summarized_story": "Martin Griffiths, head of the United Nations Office for the Coordination of Humanitarian Affairs in Nigeria, says insurgents are still ravaging the north-east.\nIn an interview with the Associated Press on Friday, Griffiths said the situation is still a “grave, clear and present danger”.\nEarlier in the week, a video was released by SITE Intelligence Group — a jihadist monitoring organisation, which showed young militants around 12 years old shooting two men dressed in Nigeria military uniforms.\nThe video also showed many young fighters receiving military training.\n“This is a very different kind of operation and very difficult also to deter … a grave, clear and present danger, obviously, to the people and a priority for the government."
  },
  {
    "headline": "CBN to commence e-invoice for import and export transactions Feb 1",
    "summarized_story": "The Central Bank of Nigeria (CBN) says it will commence an electronic invoice (e-invoice) for all import and export operations from February 1.\nO. S. Nnaji, CBN director, trade and exchange department, disclosed this in a circular titled ‘Guidelines on the Introduction of E-Evaluator, E-Invoicing for Import and Export in Nigeria’.\nAccording to the circular, e-valuator and e-invoice would replace the hard copy final invoice as part of the documentation required for all import and export transactions.\nThe apex bank noted that the new regulation aims to achieve accurate value from import and export items in and out of the country.\nAdvertisement“This new regulation is primarily aimed at achieving accurate value from import and export items in and out of Nigeria."
  },
  {
    "headline": "CBN to commence e-invoice for import and export transactions Feb 1",
    "summarized_story": "The Central Bank of Nigeria (CBN) says it will commence an electronic invoice (e-invoice) for all import and export operations from February 1.\nO. S. Nnaji, CBN director, trade and exchange department, disclosed this in a circular titled ‘Guidelines on the Introduction of E-Evaluator, E-Invoicing for Import and Export in Nigeria’.\nAccording to the circular, e-valuator and e-invoice would replace the hard copy final invoice as part of the documentation required for all import and export transactions.\nThe apex bank noted that the new regulation aims to achieve accurate value from import and export items in and out of the country.\nAdvertisement“This new regulation is primarily aimed at achieving accurate value from import and export items in and out of Nigeria."
  },
  {
    "headline": "Insecurity: We're determined to crush insurgents, says Buhari",
    "summarized_story": "President Muhammadu Buhari has reassured Kaduna residents that the Nigerian army will crush insurgents and criminal gangs operating in the state and other parts of the country.\nThe president commended the Kaduna state government for supporting security agencies, noting the establishment of a ministry dedicated to internal security.\nAdvertisement“On behalf of the Federal Government, I commend the efforts of the Kaduna State Government to respond to the demands of development.\n“Most of my visits to Kaduna State since 2015 have been in connection with clear strides of progress.\nKaduna State is providing an example of how this can be done.”In his remarks, el-Rufai called for further military action to stop the activities of insurgents in the state."
  },
  {
    "headline": "Ismael Belkhayat on his way to building Morocco's first unicorn",
    "summarized_story": "For Belkhayat, who has since adopted Ironman as his alias, competing at the sport can be likened to building a business.\nThe next idea came during a trip; Belkhayat had chosen to accompany his wife Sophia Alj, ex-strategy consultant at McKinsey, during a business trip.\nAccording to Belkhayat, Chari currently transacts about $2.5 million monthly.\nBelkhayat the strategistBased on lessons from his previous startups, Belkhayat carved a different operational strategy for Chari, a strategy that rounds up its liability to almost zero.\nEven though Belkhayat is bullish on expanding in many African countries in the coming months, there are countries he won’t go to."
  },
  {
    "headline": "Topship goes from being an Instagram business to a YCombinator company",
    "summarized_story": "That’s an ambitious statement from a company that was operating only on Instagram just 18 months ago.\nBut how did an Instagram business pivot into becoming a tech startup and then get into YC, the world’s biggest accelerator programme with a 1.5% acceptance rate?\nSo, in June 2020, Enenwali started Topship as a one-man shop, opened an Instagram account and started helping people to move parcels locally.\nBut to be Africa’s Flexport, Topship had to be a full technology company, so Enenwali decided to build software that handles the end-to-end process.\nIt’s obvious Topship is really going all-in on its adoption of the Flexport model; it’s already a tech-enabled business and in YC, just like Flexport."
  },
  {
    "headline": "How Moni Africa leverages social trust to finance mobile money agents",
    "summarized_story": "Get the best African tech newsletters in your inboxFollowing a conversation in November 2020 with a cluster of mobile money agents in the Shapati community in Lekki-Ajah, Lagos, one thing was clear to Iromini: liquidity is a major challenge plaguing the mobile money ecosystem.\nThe startup instead leverages an algorithm developed around social trust and social underwriting that’s seen the platform achieve a highly impressive repayment rate.\nMoni Africa claims its revenue has grown 50% month-on-month so far and most of its agents, about 70% of which are women, have grown their businesses by 3x.\nIts 0.1% default rate, according to the CEO, can be attributed to the platform’s community-based model and interest rate which supports the unit economics of a mobile money agent.\nIn the long run, the startup plans to expand its community-finance model beyond mobile money agents to different SMEs across Africa."
  },
  {
    "headline": "What exactly is Web3?",
    "summarized_story": "This was historic as it helped filter out shams and highlight the real success stories, which laid the foundation for subsequent successful internet companies.\nWeb2 companies build sleek and revolutionary apps that become popular quickly, and as the app’s popularity increases, so does its user base.\nSince these web apps are controlled by a single internet company, users can only use them as long as the company wants them to.\n“Web3” was coined in 2014 by Gavin Wood, president and founder of Web3 Foundation, and he said then that it was going to be the next version of the internet.\nThat is why Nigerian crypto entrepreneur, Yele Bademosi, started out his Web3 development plan in Africa with Breach, a platform that uses newsletters, blog posts, quizzes, etc to teach Africans complex Web3 topics."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there Been a while since I wrote one of these.\nI certainly hope the holidays were as restful for you as it was for..."
  },
  {
    "headline": "Techpoint Build Spotlight: 54Gene is developing world class health technologies for Africa",
    "summarized_story": "Share this article:In recent years, Africa has lagged behind the rest of the world in medical technologies and research.\nJust 3% of African genomic data is represented in global medical research.\nAdvertisementToday’s personality on Techpoint Build Spotlight, Delali Attipoe, COO of 54Gene, takes a little peek at what’s to come in health research.\n54gene’s role in African healthcare is to ensure that disease treatments and therapies for Africans are more suited to their genetic composition because personalized medicine is the future of healthcare.\nWhat makes you excited about Techpoint Build 2021Participating in Techpoint Build not only gives us an opportunity to tell the amazing 54gene story and our impact in healthcare so far but also reinforces our position as a leading technology-based genomics research startup."
  },
  {
    "headline": "Nigeria’s Oxfordbuildbay wants you to easily own land, no matter how much you earn",
    "summarized_story": "“We found that there’s a constant issue around omo onile (traditional landowners), there’s the issue around finding out who actually owns the land.\nA 2019 survey of 5,000 Nigerians showed that 62 – 63% of owned land comes by family inheritance, and just 18% bought theirs outrightly.\nFounders of Oxfordbuildbay: Stephen Nwachukwu – CFO/ Head of Growth (left), Olamilekan Adeniji – MD (right).\n“On the other hand, you could simply create an account, log in to your dashboard, click on the land locations, which will bring out the different land locations we have as of today, and then click on buy.\nBusiness model and expansionFrom left to right: Akinyinka Akinpelu – Head of Business, Stephen Nwachukwu – CFO/ Head of Growth, Olamilekan Adeniji – Managing Director and CEO, Oxfordbuildbay."
  },
  {
    "headline": "Insurpass and insurance plans, Remix for public videos, Chari’s $100m bridge",
    "summarized_story": "While this indicates a slow improvement in the country’s health system, only over 10 million out of a growing population of 200 million Nigerians are currently covered by health insurance.\nThis is done through various programmes by the National Health Insurance Scheme (NHIS), state health insurance agencies, and private plans run by Health Maintenance Organisations (HMOs).\nOluwanifemi Kolawole spoke with the co-founders, who explained how the company plans to increase insurance adoption in the country.\nAny public video on Instagram is fair game for a remix.\nChari’s bridge round at $100 million valuationSource: SuppliedChari, a Moroccan B2B e-commerce and retail startup, has raised a bridge round at a $100 million valuation."
  },
  {
    "headline": "Who needs a brand culture?",
    "summarized_story": "Brand culture is a type of company culture that is completely aligned with a brand.\nWhen a company uses the brand culture as its central management system, it benefits from long-term advantages.\nBrand culture is a brand-centric company or organisation culture, rooted in the brand identity, which consists of shared values and a vision.\nRead also: Performance brandingBrand Culture is a Management SystemAll these foundations give rise to a brand culture.\nSimply put, a brand culture makes an organisation successful long-term."
  },
  {
    "headline": "Africa cup of nations: What stands out?",
    "summarized_story": "Maybe it’s the Video Assistant Referee (VAR) or the tactics employed, or the quality of the players….\nWith these in mind, it’s difficult to accept that Africa lacks the quality to “burst” the net with many “who dey breathe” goals.\nAliou Cisse (Senegal) and Kaba Diawara (Guinep deployed a three-person anchor in midfield in addition to an entirely “flat” squad.\nVAR disallowed what appeared to be a clean goal scored by Guinea-Bissau in their 1-0 defeat against Egypt on Saturday.\nThe decision to disallow Balde’s goal has me baffled because football is a physical sport and many scenarios are 50/50."
  },
  {
    "headline": "Don Urges FG To Create A Favourable Environment For The Green Manufacturing Technology – Nigerian Observer",
    "summarized_story": "Vincent Aizebeoje Balogun have called on the Federal Government to create a favourable environment for the green manufacturing technology sector to thrive.\nAnd to develop the green manufacturing technology through the use of its local content technology for the production of goods in the manufacturing sector.\n“Rather, we need to employ and develop our green manufacturing sector so that we can create more jobs and take our citizens out of the streets” he said.\nHe urged manufacturers operating in the country to key into the green manufacturing technology for the manufacturing of their products.\n“For green manufacturing to thrive, there has to be an understanding and advocacy on the modus operandi towards green mechanical machining processes."
  },
  {
    "headline": "Tipper drivers protest killing of colleague by security personnel in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Angry tipper drivers protested the killing of their colleague by security personnel alleged to be operative of the Department of State Services (DSS) in Benin City.\n“And before a blink of eye, the DSS operatives opened fire which resulted in the death of a tipper driver.\nThe development caused heavy gridlock in the Benin metropolis as other drivers protested the death of their colleague.\nThe source said the hoodlums, upon sighting the DSS operatives, pounced on them with guns and various dangerous weapons.\nThe DSS source said its operatives sustained varying degrees of injuries during the attack while their vehicles were also damaged."
  },
  {
    "headline": "Diaspora group lite up Edo community – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUDU – As part of efforts to contribute to the development of Abudu, a group under the aegis of Abudu in Diaspora Group has commenced installation of about 250 solar streetlights in the community.\n“We (Abudu in diaspora group) are responsible for the Abudu lighting up project; our motive was to help our people back home at Abudu.\n“When we use to stay in Abudu, people come from outside the state to come and stay in Abudu.\nWe have other projects, and we hope at least we should be able to do one project every year in the community.\nthe solar streetlights project is just a starting point for things to come”."
  },
  {
    "headline": "Nation Blue Economy: Vice President Seeks Stakeholders Participation, Inaugurates Expanded Committee – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The Vice President, Prof Yemi Osinbajo has sought for wider participation of relevant stakeholders in the blue economy project to deepen participation and benefits of Nigerians from the country’s marine resources.\nOsinbajo made the call at the inaugural meeting of an Expanded Committee on Sustainable Blue Economy in Nigeria in the Presidential Villa recently.\nAccording to him, a viable blue economy project will offer vista of opportunities not only for littoral states where there are bodies of waters but for the entire country.\n“Countries have to define the scope of their blue economy based on their priorities.\nIn his opening remark, Transportation Minister, Rotimi Amaechi said the blue economy is capable of improving government revenue, create employments and grow the gross domestic product of Nigeria."
  },
  {
    "headline": "IMF proposes $50bn Trust Fund for Nigeria, other developing countries",
    "summarized_story": "The International Monetary Fund (IMF) is proposing a $50 billion trust fund for Nigeria and other low and vulnerable middle-income countries.\nIn a blog post published on Thursday, it explained that the fund was targeted at helping countries in that category to build resilience and sustainability.\n“A proposed $50-billion trust fund could help low-income and vulnerable middle-income countries build resilience to balance of payments shocks and ensure a sustainable recovery,” said the Washington-based institution.\nRecall that Nigeria was allocated about $3.35 billion of the sum, as part of the historic general allocation of SDRs of the IMF.\nThe amount allocated to Nigeria is as a result of the exchange rate of reference which is 0.702283 SDR to a dollar, and Nigeria has 2.4545 billion SDRs as of July 1, 2021."
  },
  {
    "headline": "Nigeria’s Excess Crude Account now $35m",
    "summarized_story": "Nigeria’s Excess Crude Account now stands at $35,868,086.40 as at 17th January 2022, the National Economic Council has revealed.\nIn his presentation, Mr Agba revealed the current state of Nigeria’s underlisted accounts as at 17th of January 2022.\nAccording to him, “Nigeria’s Excess Crude Account (ECA) Balance As At 17th January 2022 Stands At $35,868,086.40.\n“Stabilization Account Balance As Of 17th January 2022 Stands At N30, 685, 611, 413.79.\nDevelopment Of Natural Resources Account Balance As At 17th January 2022 Stands At N42, 820,382,381.40.”The ECA is a savings account retained by the Federal Government and is funded by the difference between the market price of crude oil and the budgeted price of crude oil as contained in the appropriation bill."
  },
  {
    "headline": "NFF says Peseiro has not signed contract to take over from Eguavoen",
    "summarized_story": "An official of the Nigeria Football Federation (NFF) has said Portuguese coach, Jose Peseiro has not signed any contract to take over as coach of the Super Eagles after the 2021 Africa Cup of Nations.\nThe NFF had before the Nations Cup, indicated that it had hired Peseiro to take over from Augustine Eguavoen, who is currently the NFF technical director.\nEguavoen was put in charge of the team after Gernot Rohr was fired.\n“He is not in Cameroon because we have not signed a contract with him yet, he said.\n“If he had signed a contract, he would have definitely been in Cameroon as planned."
  },
  {
    "headline": "Terrorists kill two officers in Katsina base attack",
    "summarized_story": "Terrorists on Tuesday, killed a soldier and an officer of the Nigeria Security and Civil Defence Corps (NSCDC) during an attack on a military base in Shinfida community, Jibia Local Government Area of Katsina State.\nThe terrorists were said to have stormed the military camp in large numbers and began to shoot at the place sporadically.\n“The terrorists attacked the military base located within Government Day Secondary School Shinfida last Tuesday.\n“They attacked the military base on their motorcycles.\nSimilarly, the Niger State Government has confirmed an attack on Ukuru village in the Bobi District of Mariga Local Government of the state, saying unspecified number of people were killed during the attack."
  },
  {
    "headline": "Ogun Declares War On Kidnappers, Yahoo Boys, To Set Up Financial Crimes Agency",
    "summarized_story": "The Ogun State government has declared war on kidnappers and fraudsters popularly referred to as Yahoo boys.\nAccording to the state governor, Prince Dapo Abiodun, the Ogun State Government will soon set to set up its own financial crimes agency to deal with internet frauds and illegal financial transactions, especially, those having to do with kidnapping, ransom taking and advance fee frauds.\n“We will make Ogun State unhabitable for all criminals.\n“We have decided that we will set up our State Commission that will be targeted towards eliminating these sorts of financial crimes.\nOur state commission will collaborate with the Federal commission so that we do not occupy that false place in this area."
  },
  {
    "headline": "Rivers To Expose Illegal Oil Refiners",
    "summarized_story": "The Rivers State government says it will publish names of people involved in illegal crude oil refining (kpo-fire) activities in the state.\nThe meeting was attended by heads of the security agencies and chairmen of the 23 local government areas of the state.\nWhile urging traditional rulers not to allow illegal refining activities to take place in their domains anymore, Wike told them that those involved in such activities were sabotaging the nation’s economy.\nHe said: “I should think that the way the federal government intends to fight insurgency is the way they should fight illegal oil bunkering, because it is a sabotage on the national economy, very big sabotage.\nADVERTISEMENTHe traditional rulers not to be less concerned, but mobilise members of their Community Development Committees (CDC) and the leadership of their youth groups to work in synergy to dislodge illegal refiners."
  },
  {
    "headline": "Ogun Partners Lagos, Oyo To Flush Out Killer Herdsmen",
    "summarized_story": "Ogun State government on Friday, said it has forged a partnership with the two neighbouring states of Lagos and Oyo to tackle the menace of killer herdsmen, kidnappers as well as other bandits operating in its forests.\nHe explained that with the resurgence in cases of kidnapping on the Lagos-Ibadan expressway, Amotekun personnel in Ogun and Oyo states are now combing the forests to dislodge the terrorists, a move that he said, has been yielding positive results.\nHe said that the state government has concluded arrangements to fortify all the 20 local government areas of the state with Amotekun operatives, adding that this will be complemented by some operatives, who recently concluded their training and are waiting to be mobilized.\nThe Amotekun boss also noted that the Corps has been collaborating with the Army, Police, Department of State Services (DSS), Nigerian Security and Civil Defence Corps (NSCDC) among others to rid the state of criminals.\nADVERTISEMENTHe disclosed that the inter agency cooperation has led to the arrest of over 50 cultists and other hoodlums in Sagamu and other areas in Ogun East."
  },
  {
    "headline": "Ogun Partners Lagos, Oyo To Flush Out Killer Herdsmen",
    "summarized_story": "Ogun State government on Friday, said it has forged a partnership with the two neighbouring states of Lagos and Oyo to tackle the menace of killer herdsmen, kidnappers as well as other bandits operating in its forests.\nHe explained that with the resurgence in cases of kidnapping on the Lagos-Ibadan expressway, Amotekun personnel in Ogun and Oyo states are now combing the forests to dislodge the terrorists, a move that he said, has been yielding positive results.\nHe said that the state government has concluded arrangements to fortify all the 20 local government areas of the state with Amotekun operatives, adding that this will be complemented by some operatives, who recently concluded their training and are waiting to be mobilized.\nThe Amotekun boss also noted that the Corps has been collaborating with the Army, Police, Department of State Services (DSS), Nigerian Security and Civil Defence Corps (NSCDC) among others to rid the state of criminals.\nADVERTISEMENTHe disclosed that the inter agency cooperation has led to the arrest of over 50 cultists and other hoodlums in Sagamu and other areas in Ogun East."
  },
  {
    "headline": "Mediacraft’s John Ehiguese To Head Lagos NIPR Education Committee",
    "summarized_story": "The Lagos Chapter of the Nigerian Institute of Public Relations (NIPR) has appointed Mr John Ehiguese, Chief Executive Officer, Mediacraft Associates Limited, to chair its Training and Education Committee.\n“I am delighted to inform you that the Executive Council of the Lagos State Chapter has approved your appointment as the Chairman, Training and Education Committee of the Chapter,” Nwankwo said in the letter.\nIt is in line with that promise, that Nwankwo reached out to Mr Ehiguese, a thoroughbred PR professional, and others, to tap into their wealth of knowledge.\nI am confident that as a committee, we will put in our best to further strengthen the Institute’s training and education programmes,” Mr Ehiguese said.\nA consummate professional, Mr Ehiguese has contributed immensely to the development of PR in Nigeria."
  },
  {
    "headline": "Gunmen kill Universal Energy oil worker in Akwa Ibom",
    "summarized_story": "Some gunmen have killed an oil worker in Akwa Ibom State, Nigeria’s South-south, the police have said.\nMr Macdon said the gunmen, whom he identified as militants, ambushed a vehicle carrying staff members of the company, Universal Energy Resources Ltd, at Unyenge in Mbo Local Government Area of the state.\n“We received a distress call that militants attacked UERL (Universal Energy Resources Ltd) staff at Unyenge in Mbo Local Government Area.\nThe police spokesperson said the state Commissioner of Police, Andrew Amiengheme, has ordered investigations into the attack.\nUniversal Energy Resources Ltd is an indigenous oil exploration company operating in Akwa Ibom State."
  },
  {
    "headline": "Gunmen kill Universal Energy oil worker in Akwa Ibom",
    "summarized_story": "Some gunmen have killed an oil worker in Akwa Ibom State, Nigeria’s South-south, the police have said.\nMr Macdon said the gunmen, whom he identified as militants, ambushed a vehicle carrying staff members of the company, Universal Energy Resources Ltd, at Unyenge in Mbo Local Government Area of the state.\n“We received a distress call that militants attacked UERL (Universal Energy Resources Ltd) staff at Unyenge in Mbo Local Government Area.\nThe police spokesperson said the state Commissioner of Police, Andrew Amiengheme, has ordered investigations into the attack.\nUniversal Energy Resources Ltd is an indigenous oil exploration company operating in Akwa Ibom State."
  },
  {
    "headline": "NOLLYWOOD STARS: THEN AND NOW: DESMOND ELLIOT",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, DAYLIGHT will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "NOLLYWOOD STARS: THEN AND NOW: DESMOND ELLIOT",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, DAYLIGHT will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "Ogun State Gov Dapo Abiodun Declares ‘War’ On Yahoo boys, Kidnappers",
    "summarized_story": "Ogun State Governor Dapo Abiodun has launched war on internet scammers, sometimes known as Yahoo boys.\nSadly, he said to me that Ogun State tops the list on ‘Yahoo Yahoo Boys’.\nIn my response, I said I am not surprised because Ogun State is the education capital of this country and you will find such educational institutions around and he agreed with me.\n“We have decided that we will set up our State Commission that will be targeted towards eliminating these sorts of financial crimes.\nOur state commission will collaborate with the Federal Commission so that we do not occupy that false place in this area."
  },
  {
    "headline": "President Buhari Reacts To Murder Of 5-Year-Old Girl In Kano",
    "summarized_story": "Recall that little Hanifa had gone missing since December last year, prompting intelligence agencies to launch a search into her whereabouts.\nThe security agencies made a breakthrough recently, as her body was discovered in a shallow grave in Kano, after almost two months of search by security operatives.\nDAILY POST gathered that the arrest of her teacher and his other accomplices in the child’s kidnap and murder have also been effected.\nBuhari said the entire country, which was following the incident with keen interest, were optimistic that Hanifa would be rescued alive.\nWhile praying for the repose of the soul of the little school girl, the President urged her parents to bear the sad loss with courage and fortitude in God."
  },
  {
    "headline": "IGP Replaces Odumosu With New Lagos police commissioner",
    "summarized_story": "IGP Replaces Odumosu With New Lagos police commissionerA new Commissioner of Police has been appointed to the Lagos State Police Command.\nThis follows the deployment of Hakeem Odumosu to the Force Headquarters in Abuja.\nHakeem Odumosu was recently promoted to the rank of Assistant Inspector-General of Police.\nAlabi’s deployment to Lagos was contained in a police wireless message dated January 20, 2022.\n“The posting is with immediate effect,” the police signal read in part."
  },
  {
    "headline": "EFCC Arraigns Funmi Adenmosun For Alleged N26.6bn Investment Fraud In Lagos",
    "summarized_story": "EFCC Arraigns Funmi Adenmosun For Alleged N26.6bn Investment Fraud In LagosFunmi Adenmosun, a businessman, was charged with fraud by the Economic and Financial Crimes Commission (EFCC) on Friday.\nThe defendant was docked before Justice Daniel Osiagor of the Federal High Court, in Ikoyi, Lagos.\nAdenmosun faces a 10-count charge bordering on conspiracy and money laundering to the tune of N26,600,000,000.\nHe was arraigned alongside two companies: Home Trust Savings and Loan Limited, and Rare Properties and Development Limited."
  },
  {
    "headline": "Buhari bai taɓa ba da umarnin cire tallafin fetur ba – Shugaban Majalisar Dattawa",
    "summarized_story": ""
  },
  {
    "headline": "Tufka da warwara kan cire tallafin fetur",
    "summarized_story": ""
  },
  {
    "headline": "Gwamnatin Kano ta sha alwashin tabbatar da adalci ga Hanifa",
    "summarized_story": ""
  },
  {
    "headline": "Da maganin ɓera na N100 na kashe Hanifa, inji Abdulmalik Tanko",
    "summarized_story": ""
  },
  {
    "headline": "What Kano Govt Is Doing To Get Justice For Hanifa Abubakar – Ganduje",
    "summarized_story": "Kano State Governor, Abdullahi Ganduje, has outlined some of the measures taken by the government to ensure justice is served in the murder of Hanifa Abubakar.\nUntil her death, she was a pupil of a private school – Noble Kids Academy in Nassarawa Local Government Area of Kano State.\nIn a statement on Friday by the Commissioner for Information in Kano, Muhammad Garba, Governor Ganduje disclosed that the government had already taken some actions regarding the case.\nGovernor Ganduje vowed that the government would continue to meticulously monitor and ensure the prosecution of anyone found culpable in the kidnap and murder of the girl.\nThey buried Hanifa in a shallow grave within the school premises located at Kwanar ‘Yan Gana in Tudun Murtala Quarters."
  },
  {
    "headline": "Buhari Asks Police, Justice Ministry To Uphold Integrity In Hanifa Abubakar’s Case",
    "summarized_story": "President Muhammadu Buhari has called on the relevant bodies to ensure justice is served in the murder of Hanifa Abubakar, the five-year-old schoolgirl killed in Kano State.\nHe specifically ordered the police and the Ministry of Justice to uphold the integrity of the detective work that busted the case by preparing well and presenting a good case that will earn the respect of the court.\nThe President stated that the thorough and painstaking detective operation by the law enforcement bodies, leading to the discovery of her remains and the arrest of the suspects who have already made confessions, was commendable.\nUntil her death, Hanifa was a pupil of a private school – Noble Kids Academy in Nassarawa Local Government Area of Kano State.\nHanifa was buried in a shallow grave within the school premises located at Kwanar ‘Yan Gana in Tudun Murtala Quarters."
  },
  {
    "headline": "Lassa Fever: Nigeria Records 11 Deaths, 96 Cases In Two Weeks",
    "summarized_story": "No fewer than 11 people have died of Lassa fever since the beginning of the new year, the Nigeria Centre for Disease Control (NCDC) has said.\n“The male to female ratio for confirmed cases is 1 : 0.8.\nThe number of suspected cases has increased compared to that reported for the same period in 2021.\nBetween January 10 to 16, the NCDC said 244 suspected cases of Lassa fever were logged across 16 local government areas of eight states.\nThe confirmed cases were reported from Edo, Ondo, Bauchi, Benue, Kogi, Oyo, Taraba, and Ebonyi States."
  },
  {
    "headline": "17 Killed, 59 Injured In Ghana Explosion",
    "summarized_story": "At least 17 people were killed and 59 injured Thursday in a devastating explosion in a western Ghana town after a truck carrying explosives intended for a mine collided with a motorcycle, the government said.\n“A total of 17 people have unfortunately been confirmed dead, and 59 injured people have been rescued,” Information Minister Kojo Oppong Nkrumah said in a statement released overnight.\nOut of 59 people injured, 42 are receiving treatment in hospitals or health centres and “some are in critical condition”, Nkrumah added.\n‘Ghost town’Officials and eyewitnesses described a scene of desolation against the sea of buildings collapsed or impaired in the carnage.\nDr Isaac Dasmani, chief executive of the Prestea Huni-Valley municipality where the explosion occurred, told local media “the whole community is gone” after the blast."
  },
  {
    "headline": "First Witness Testifies Before Coroner, Narrates Sylvester Oromoni’s Pain",
    "summarized_story": "The coroner’s inquest into the circumstances surrounding the death of Sylvester Oromoni, a 12-year-old student of Dowen College, Lekki resumed on Friday at the Magistrate Court sitting in Epe, Lagos State.\nREAD ALSO: Sylvester Oromoni’s Death Not Caused By Poison, Torture – PoliceFalana also informed the coroner, Magistrate Mikhail Kadiri, that he intended to call about seven witnesses to prove his case.\n“When I asked him (late Sylvester) what was wrong with him, he said that he played football and sustained injuries.\nAccording to the witness, Sylvester’s father came on November 25 and they decided to take the boy to Warri, Delta State.\nAfter giving the testimony, the coroner adjourned the further hearing in the case until Thursday and Friday next week."
  },
  {
    "headline": "Agege LGA holds security summit, assures residents of safer community -",
    "summarized_story": "The Agege local government area council has held a security summit to address the prevailing security challenges in the area.\nResidents of the ancient community are assured of improved security.\nAdvertisement"
  },
  {
    "headline": "APC national chairmanship: I won't join issues with any aspirant",
    "summarized_story": "A former governor of Zamfara state and one of the aspirant for the Chairmanship position in the All Progressives Congress Party, Abdulaziz Yari, said he will not join issues with any other aspirants for the position.\nAdvertisementMr Shinkafi says Abdulaziz Yari was not captured in the revalidation and registration exercise carried out by the party in Zamfara State.\nReacting to the allegations, Abdulaziz Yari says he’s a duly registered member of the All Progressives Congress Party.\nAdvertisementHe also accused Sani shinkafi of formenting trouble with the APC in the state given his antecedent from the All Progressives Grand Alliance (APGA).\nHe called on the Caretaker Committee to disregard Sani Shinkafi describing him as a “noise maker” and means no good for the party."
  },
  {
    "headline": "Tinubu donates N50m to Niger Govt to fight insecurity",
    "summarized_story": "National Leader of the All Progressives Congress, Asiwaju Bola Tinubu has donated N50 Million to the Niger State Government to tackle insecurity, banditry and other security challenges.\nHe made the donation during a condolence visit to the State governor in Minna on Thursday.\nAdvertisementGovernor Bello recently said more than 200 people have been killed in attacks in over 300 communities in the State this year.\nAdvertisement"
  },
  {
    "headline": "Asiwaju Tinubu charges Nigerians to collect PVC's",
    "summarized_story": "National leader of the APC, Asiwaju Bola Tinubu received APC women leaders across the country including the Federal Capital territory where he charged them to unite and go all out to collect their PVCs for them to be able to exercise their civic right during the forthcoming election.\nThe women say the visit was to affirm their support for Bola Tinubu’s 2023 Presidential ambition.\nAdvertisement"
  },
  {
    "headline": "Russia Toughens Posture Amid Ukraine Tensions",
    "summarized_story": "Amid fears of an imminent attack on Ukraine, Russia has further upped the ante by announcing more military drills in the region.\nIn talks with the United States, Russia demands legally binding guarantees that the alliance will not embrace Ukraine and other former Soviet nations, or place weapons there.\nAdding to an estimated 100,000 troops deployed near Ukraine, Russia also has moved more troops from Siberia and the Far East for joint drills with its ally Belarus, which also borders Ukraine.\nIn those exercises, Russian military units have moved to areas near Belarus’ southern border, which is about 75 kilometers (47 miles) from Kyiv.\n“Tensions will be high, including demonstrations of force not necessarily near or in Ukraine,” Lukyanov wrote in a commentary."
  },
  {
    "headline": "US Suspends 44 Flights By Chinese Carriers after China Action",
    "summarized_story": "The U.S. government said on Friday it would suspend 44 China-bound flights from the United States by four Chinese carriers in response to the Chinese government’s decision to suspend some U.S. carrier flights over COVID-19 concerns.\nThe decision will cut some flights by Xiamen, Air China, China Southern Airlines and China Eastern Airlines.\nAs recently as Tuesday, the Transportation Department said the Chinese government had announced new U.S. flight cancellations.\nChina has also suspended numerous U.S. flights by Chinese carriers after passengers later tested positive.\nIn August, the U.S. Transportation Department limited four flights from Chinese carriers to 40% passenger capacity for four weeks after Beijing imposed identical limits on four United Airlines flights."
  },
  {
    "headline": "US Opposes Plans to Strengthen World Health Organisation",
    "summarized_story": "Four European officials involved in the talks, who declined to be named because they were not authorised to speak to the media, confirmed the U.S. opposition.\nLONG-STANDING SCEPTICISMThe WHO itself responded to a query by saying that “only flexible and predictable funds can enable WHO to fully implement the priorities of the Member States”.\nTop European Union donors, including Germany, back the plan, along with most African, South Asian, South American and Arab countries, three of the European officials said.\nOne of the European officials said other big countries, including Japan and Brazil, were also hesitant about the published WHO proposal.\nTwo of the European officials said China had not yet made its position clear, while a third official listed Beijing among the critics of the proposal."
  },
  {
    "headline": "Gabby Petito’s Boyfriend Admitted to Killing Her in Notebook, FBI Says",
    "summarized_story": "The boyfriend of slain cross-country traveler Gabby Petito admitted killing her in a notebook discovered near his body in a Florida swamp, the FBI announced Friday.\n“All logical investigative steps have been concluded in this case,” FBI Denver Division Special Agent in Charge Michael Schneider said in the statement.\nThe FBI did not specify what, exactly, Laundrie had written in the notebook and in the texts he’d sent to mislead.\nLaundrie and Petito grew up on Long Island, New York, but were living in Florida in recent years.\nAttorneys for the Petito and Laundrie families did not immediately respond Friday to emails and text messages seeking comment about the FBI’s conclusions."
  },
  {
    "headline": "Nigeria VP Osinbajo Warns Multilateral Banks against Defunding Gas Projects in Africa",
    "summarized_story": "Nigeria Vice President Yemi Osinbajo on Friday warned multilateral finance institutions against defunding oil and gas projects in Africa, as the Western World continues its drive to phase out polluting fuels, saying such a step would have medium and long term consequences on African economies.\nWe are emphatic in our view that natural gas, which Africa has in abundance, must be accepted as a transition fuel.\nThe vice president lamented that less than 10 per cent of African countries had vaccinated 40 per cent of their population.\nWe have to look at issues around patent rights, intellectual property rights, and exclusivity rights; especially if we’re going to improve the chances of African countries to manufacture vaccines locally.\nBut we can’t really talk about African countries producing their own vaccines if we don’t address those important structural problems."
  }
]