[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "COVID-19: Nigeria records 880 fresh infections as NCDC raises alarm",
    "summarized_story": "The Nigeria Centre for Disease and Prevention Control (NCDC) has raised alarm over 880 additional coronavirus infections reported in Nigeria from July 2 to 8, though with no fatalities.\nLagos state, the epicentre of the virus, accounted for more than 90 per cent of the new infections with 750 cases.\nIt added that the number of weekly COVID-19 cases had increased globally for the third consecutive week.\nThe public health agency said that it was committed to preserving the health of the citizens.\nThe NCDC did not state which subvariants accounted for the majority of the country’s COVID-19 infections."
  },
  {
    "headline": "Ogun 2023: Akinlade, Amosun’s loyalists, team up with PDP’s Adebutu",
    "summarized_story": "Akinlade is said to be joining PDP to fly as the running mate of Adebutu in the Ogun 2023 governorship election.\nIt will recalled that Akinlade, the governorship candidate of the Allied Peoples Movement, APM, in the 2019 general election, had last week dumped the ruling All Progressives Congress, APC.\nAdebutu and PDP stakeholders in the state received Akinlade and some supporters of Amosun at a welcome ceremony held at the Ogun PDP Secretariat, IBB Boulverd, Magbon, Abeokuta, the Ogun State capital.\nAkinlade and Adebutu on Friday, arrived the Party’s Secretariat at about 12.30pm amid wild jubilation by the party stakeholders and supporters.\nDuring the 2019 election, Adebutu had supported Akinlade, following the adoption of Late Senator Buruji Kashamu as the candidate of the Party in Ogun State."
  },
  {
    "headline": "Ogun guber: Why I stand with Adebutu for 2023 — Akinlade",
    "summarized_story": "In a statement by his media office on Friday, Akinlade stressed that his decision to run with Adebutu was informed by his resolve to change the cause of trajectory of Ogun state in 2023.\nHe said, “The way we find ourselves in Ogun State, the next administration in Ogun State means that every sensible indigene of this state must be able to make sacrifice , must be ready to do whatever it takes to change the course of the trajectory in Ogun State come 2023.\nAkinlade assured Adebutu of his unalloyed support and commitment to his victory in Ogun State in 2023.\nMy coming to PDP is for the development of Ogun State and to bring back peace to the state.\nI will stand by you, I will stand behind you and I will stand with you and together, we will win Ogun State,” he said."
  },
  {
    "headline": "APC VP Candidate: APC Youths to organise 1 million man solidarity march for Kashim Shettima",
    "summarized_story": "By Ibrahim Hassan-WuyoThe Concerned Northern APC Youth Forum has declared total support to the candidature of Senator Kashim Shettima for All Progrgessive Congress,APC Vice President and announced that a one million man march would be organised in solidarity for Senator Shettima after the Eid celebration.\nSuleiman Liba who spoke in Damaturu where he celebrated the Eid el Kabir, said that for the party to get it right in the 2023 general election, they must imbibe the spirit of justice, fairness and equity in all its dealings.\nSuleiman Liba particularly mentioned the name of H. E. Senator Kassim Shettima, the immediate past Governor of Borno State, pointing out that Shettima is best suited for the Vice President of Nigeria under the APC.\n“As Senator, Shettima gave his people the best of representation at the upper chamber of the National Assembly.\nLiba therefore, declared the total support of the group to the candidature of Sen. Shettima for vice president and reiterated that he is planning a one million man match in solidarity for Sen. Shettima for Vice President after the Eid celebration."
  },
  {
    "headline": "Joke Silva vibes with husband, Olu Jacobs in new video",
    "summarized_story": "Veteran Nollywood actress, Joke Silva has shared a heartwarming video of her and husband vibing together while celebrating Eid Mubarak with the muslim faithfuls.\nThe actor who will turn 80 on Monday, July 11, recently had a lovely photoshoot session with his beautiful wife for his birthday celebration.\nWatch video below:"
  },
  {
    "headline": "Abuja-Kaduna train: Air Vice Marshal Tuwase’s wife, Pakistani among captives freed by terrorists",
    "summarized_story": "The wife of a top Nigerian military officer is among the freed Abuja-Kaduna train kidnap victims.\nA military insider told DAILY POST that Bosede Tuwase is part of the seven hostages released on Saturday.\nThe woman is the wife of Air Vice Marshal (AVM) Olurotimi Anthony Tuwase.\n“A Pakistani and Bosede Olurotimi are among those released.\nHe assumed the position in January 2022 when the Nigerian Air Force (NAF) announced new postings and redeployments."
  },
  {
    "headline": "2023: Go to court – INEC tells Lawan, Akpabio over exclusion",
    "summarized_story": "The Independent National Electoral Commission (INEC) has told politicians that are aggrieved over the conduct of primaries to seek redress in court.\nSenate President Ahmad Lawan and former Minister of Niger Delta affairs, Godswill Akpabio, had been listed by the ruling All Progressives Congress (APC) as candidates for the Yobe North and Akwa Ibom north-west Senatorial Districts, respectively.\nBut in the list published by INEC, Lawan and Akpabio were found to have been excluded.\n“In relation to the primaries for the Akwa Ibom North West and Yobe North Senatorial Districts, the Commission stands by the monitoring reports received from our state offices.\n“For this reason, the Commission did not publish the particulars of any candidate for the two constituencies at variance with the State reports,” Festus Okoye, INEC spokesperson, said in a statement on Saturday."
  },
  {
    "headline": "Insecurity: Terrorists can attack Aso Rock one day – Ex-Oyo Gov, Ladoja warns Buhari",
    "summarized_story": "A former Governor of Oyo State, Senator Rasidi Adewolu Ladoja has warned that terrorists may attack Aso Rock, the official residence of President Muhammadu Buhari.\nDAILY POST recalls that the advance team of President Muhammadu Buhari was recently attacked by some suspected terrorists in Katsina State.\n“That means that they can even attack Aso Rock, which is the official residence of Mr. President.\nIf high profile kept at Kuje Prisons could be freed by terrorists, that means that one day, we will just hear that they have entered Aso Rock.\nMr President and other relevant security stakeholders should be more active and strive to checkmate the worsening security situation in the country”."
  },
  {
    "headline": "Flood kills 3 persons, sacks 100 households in Yobe",
    "summarized_story": "Three people have been killed by flood in three communities in the Gujba Local Government Area of Yobe State following a heavy downpour on Saturday.\nThe affected communities are Likdir, Buni-Gari, and Kukuwa Tasha where more than 100 households were displaced and are currently taking refuge in public schools and with family relatives.\nDr. Mohammed Goje, the Executive Secretary of Yobe State Emergency Management Agency, (SEMA), disclosed this in Damaturu and also noted that crops and community food reserves were destroyed as a result of the flooding.\nThe Executive Secretary who visited the affected communities and victims commiserated with them on behalf of the Yobe State Government and assured them of government immediate relief to cushion their hardship.\nGoje extended Governor Mai Mala Buni’s deepest condolences to the deceased families and prayed for repose to the departed souls and give their various families the fortitude to bear the irreplaceable loss."
  },
  {
    "headline": "Sallah: Gov Ganduje pardons 90 inmates",
    "summarized_story": "Governor Abdullahi Umar Ganduje of Kano State has pardoned 90 inmates as part of the Sallah celebration, bringing the total number of inmates released on propagative of mercy to 3,898 across the state in his seven years of governance.\nThe exercise was conducted through the State Prerogative of Mercy Committee at the intervals of Sallah festivities.\nThe 90 inmates, who were released today, were among the released 3,898, as he disclosed during today’s visit to Gorondutse Correctional Centre, Saturday, Sallah Day.\nGovernor Ganduje assured that he would continue with the good work up to 2023 when his administration ends.\nIn his brief remarks, the Controller of Kano Correctional Centres, Sulaiman M. Inuwa, hailed Governor Ganduje, revealing further that, “In my 30 years of working experience, I have never come across a governor who did something close to this.”"
  },
  {
    "headline": "Serena @ 40: I'm still in the game The Nation Newspaper",
    "summarized_story": "Serena Williams looked to be in top shape at 40-year-old as she continues to work out hard for her career with no signs of slowing down.\nDailymail.co.uk showed her wearing a white tank top and pink slacks as she stood in front of a massive stone sign that read Serena.\nIn her caption, she said, ‘Building anyone?’The Serena Williams Building in Oregon was at the Nike World Headquarters.\n‘A manifestation of form and function following footprint, this building embodies Serena’s legacy as a force for positive change.\nIt is the art to the LeBron James Innovation Center’s science, allowing us to know and serve athletes like never before.’"
  },
  {
    "headline": "12 injured in Delta tank farm fire The Nation Newspaper",
    "summarized_story": "No life was lost in the fire outbreak that gutted the tank farm of Matrix Energy Limited at Ifiekporo, Warri South council area of Delta State on Friday evening.\nHowever, 12 persons have been confirmed injured in the incident.\n“Preliminary report says 12 persons were injured and hospitalized, but we must understand that a huge investment was affected.\nWe advise proper investigation should be done and avoid repeat occurrence”, the Oil and gas commissioner stated.\nThe Head of the Tank Farm, Oghale Oyibo, while conducting the delegation round the premises, assured that investigation into the incident had begun."
  },
  {
    "headline": "Why we rejected Lawan, Akpabio's nominations- INEC The Nation Newspaper",
    "summarized_story": "The Commission insisted that the Constitution mandates it to monitor congresses and primaries of political parties.\nIn particular, allegations intended to impugn the integrity of the Commission have been made in respect of the Akwa Ibom North West and Yobe North Senatorial Districts.\n“In line with its constitutional and legal obligations, the Commission deployed monitors to the various constituencies and received reports of such exercise.\n“In relation to the primaries for the Akwa Ibom North West and Yobe North Senatorial Districts, the Commission stands by the monitoring reports received from our State offices.\nRight now, the Commission is funtus officio in the two cases.”The Commission urged aggrieved parties seek redress in Court."
  },
  {
    "headline": "Let's put Nigeria first, APC urges at Eid-el-Kabir The Nation Newspaper",
    "summarized_story": "The ruling All Progressives Congress (APC) has urged all Nigerians to place the country first in all their dealings and shun retrogressive elements who seek to divide the people through terror and hate.\nThis charge was contained in a goodwill statement by the party as it felicitates with Muslim faithful on the occasion of the Eid-El-Kabir festival which requires sacrifice, submission and devotion to Allah.\nFelix Morka in a statement in Abuja on Saturday, urged Nigerians especially the Muslim faithful to imbibe the spirit of sacrifice, submission and devotion to Allah as the festival dictates.\nThe statement reads: ‘We enjoin the Muslim Ummah, during this period to recommit themselves to Islamic teachings of understanding, tolerance and peaceful coexistence.\n“On this occasion of Eid-El-Kabir, we urge all Nigerians to place national interest first in all dealings."
  },
  {
    "headline": "Driver detained over pupils' death in school bus The Nation Newspaper",
    "summarized_story": "A driver, Odunsah Mandala, has been arrested by the Lagos Police Command for allegedly causing the death of two primary pupils.\nMandala was said to have been taking several pupils of a school located in Surulere to their various homes on Friday when the children started complaining that they were feeling sick.\nIt was gathered the driver had shut all the windows in the school bus to prevent rain from beating the children but did not put on the air conditioner.\nThe Nation gathered the school subsequently contacted the pupil’s parents to alert them of the situation and allegedly attempted to cover up the incident.\nA school bus driver ignored repeated complaints from the kids he was taking home that they were not feeling well."
  },
  {
    "headline": "Untold story of Kuje prison attack – The Sun Nigeria",
    "summarized_story": "PorositySecurity sources described the location of the Kuje prison as very porous and prone to attacks by anybody.\nReacting to the situation in Kuje Prison, Retired Deputy Controller of Prison, Simon Dung, in a chat with our correspondent, lamented that Kuje prison only recently developed a negative reputation as a detention centre for high profile criminals like Boko Haram terrorists.\n“May I remind you that Kuje Prison was actually a facility financed by the military to keep pro-democracy agitators?\nPro-democracy activists arrested for whatever reason across Nigeria were sent to Kuje prison.\n“So, as you can see the reason for setting up Kuje Prison was political and not crime."
  },
  {
    "headline": "Kuje prison attack: Police recapture Boko Haram escapee in Nasarawa",
    "summarized_story": "From Abel Leonard, LafiaNasarawa State police command says it has recaptured one Hassan Hassan, male, whose name and picture was amongst the Boko Haram inmates that escaped from Kuje correctional facility.\nThis was contained in a press release signed by the Police Public Relations Officer, DSP Ramhan Nansel, who said the escapee was recaptured by the police operatives of the Nasarawa State police command in Keffi at 01:30am.\nThe state Commissioner of Police, Adesina Soyemi, has since ordered the transfer of the suspect to a safer location while intensive search for other escapees and handing over process of the arrested inmates progresses.\nSoyemi further appreciated the efforts of the police, and assured members of the public of the command’s unrelenting efforts at making the society safe for all."
  },
  {
    "headline": "Osun guber poll: Oyetola, Adeleke, others to slug it out Saturday",
    "summarized_story": "Watching from the sideline, many political pundits see the contest as a straight fight between the APC and PDP.\nFor the APC, in spite of the obvious advantage of the power of incumbency, Governor Oyetola has been unrelenting in his vigorous campaign for re-election for his second term.\nAgain, with the newfound relationship between Governor Oyetola and his predecessor, Ogbeni Rauf Aregbesola, the coast now appears to be clearer for the party.\nAlmost all the founding fathers and chieftains of the party have vowed not to have anything to do with Adeleke.\nPolitical observers have described the gale of defections that recently hit the PDP in the state as a big minus for Adeleke."
  },
  {
    "headline": "Kalu rejoices with Mike Awoyinfa as The Sun former MD turns 70",
    "summarized_story": "Former governor of Abia State and Chief Whip of the Senate, Dr. Orji Kalu, has described the pioneer Managing Director and Editor-in-Chief of The Sun newspapers, Mike Awoyinka, as a cerebral media guru.\nAcknowledging the contributions of Awoyinfa to the growth and progress of the media industry beyond the shores of Nigeria, Kalu stressed that the media practitioner’s outstanding leadership qualities are unbeatable and remarkable.\nHe said: “On behalf of the people of Abia North Senatorial District, I congratulate the former Managing Director and Editor-in-Chief of the Sun newspapers, Mr Mike Awoyinka as he clocks 70.\n“The celebrant is a household name in the media industry, having made enormous contributions to the media profession over the years.\nHis passion for the media profession is highly commendable and worthy of emulation.”Kalu wished the celebrant a joyous birthday celebration."
  },
  {
    "headline": "16 passengers missing in another Lagos boat mishap – The Sun Nigeria",
    "summarized_story": "By Steve AgbotaBarely three days after a 20-passenger boat ferrying 17 persons capsized and two persons died on Lagos water channel, another passenger boat carrying 16 persons late Friday night capsized with all passenger onboard declared missing.\nAccording to her, the tide of the water drifted the boat to a stationary barge, which caused the boat to overturn.\n“At about 7.45 today the 8th of July 2022, The National Inland Waterways Authority and Lagos State Waterways Authority received a distress call of an incident on the waterways.\n“A W19 passenger fibre boat carrying 16 persons capsized along the Ojo area of the state.\nShe said that NIWA, Lagos State Waterways Authority (LASWA) and Lagos State Emergency Management Agency (LASEMA), mobilised to the scene of the incident."
  },
  {
    "headline": "I Will Probe, Retrieve Every Penny Stolen By Past Nigerian Rulers – AAC Presidential Candidate, Sowore",
    "summarized_story": "The presidential candidate of the African Action Congress (AAC) and convener of #RevolutionNow, Omoyele Sowore, has stated that if elected the president of Nigeria in 2023, he will probe past Nigerian leaders and recover every public fund stolen during their stay in the office.\nOmoyele SoworeHe argued that if the country could be retrieving money from the dead and long buried former Head of State, Sani Abacha, nothing would stop him from retrieving stolen funds from living legendary thieves.\nHe said, “As President of Nigeria, I will probe and retrieve every penny stolen by past Nigerian rulers, those who’ve murdered innocents and deprived them of a bright future.\n“If we could be retrieving money from dead and buried Sani Abacha, we should retrieve from living legendary thieves.”SaharaReporters had earlier reported that the Labour Party counterpart, Peter Obi, said that he would not probe any Nigerian past leader if elected the president in 2023.\nAccording to the former Governor of Anambra State, “You can’t close your shop and be chasing thieves” because “those who only look at yesterday and today will miss tomorrow.”"
  },
  {
    "headline": "I Will Probe, Retrieve Every Penny Stolen By Past Nigerian Rulers – AAC Presidential Candidate, Sowore",
    "summarized_story": "The presidential candidate of the African Action Congress (AAC) and convener of #RevolutionNow, Omoyele Sowore, has stated that if elected the president of Nigeria in 2023, he will probe past Nigerian leaders and recover every public fund stolen during their stay in the office.\nOmoyele SoworeHe argued that if the country could be retrieving money from the dead and long buried former Head of State, Sani Abacha, nothing would stop him from retrieving stolen funds from living legendary thieves.\nHe said, “As President of Nigeria, I will probe and retrieve every penny stolen by past Nigerian rulers, those who’ve murdered innocents and deprived them of a bright future.\n“If we could be retrieving money from dead and buried Sani Abacha, we should retrieve from living legendary thieves.”SaharaReporters had earlier reported that the Labour Party counterpart, Peter Obi, said that he would not probe any Nigerian past leader if elected the president in 2023.\nAccording to the former Governor of Anambra State, “You can’t close your shop and be chasing thieves” because “those who only look at yesterday and today will miss tomorrow.”"
  },
  {
    "headline": "I Will Probe, Retrieve Every Penny Stolen By Past Nigerian Rulers – AAC Presidential Candidate, Sowore",
    "summarized_story": "The presidential candidate of the African Action Congress (AAC) and convener of #RevolutionNow, Omoyele Sowore, has stated that if elected the president of Nigeria in 2023, he will probe past Nigerian leaders and recover every public fund stolen during their stay in the office.\nOmoyele SoworeHe argued that if the country could be retrieving money from the dead and long buried former Head of State, Sani Abacha, nothing would stop him from retrieving stolen funds from living legendary thieves.\nHe said, “As President of Nigeria, I will probe and retrieve every penny stolen by past Nigerian rulers, those who’ve murdered innocents and deprived them of a bright future.\n“If we could be retrieving money from dead and buried Sani Abacha, we should retrieve from living legendary thieves.”SaharaReporters had earlier reported that the Labour Party counterpart, Peter Obi, said that he would not probe any Nigerian past leader if elected the president in 2023.\nAccording to the former Governor of Anambra State, “You can’t close your shop and be chasing thieves” because “those who only look at yesterday and today will miss tomorrow.”"
  },
  {
    "headline": "EXCLUSIVE: How Lower Niger River Basin Development Authority Spent N100M On Kwara Lawmaker, Alajagusi's Failed Water Projects",
    "summarized_story": "For her water needs, the nursing mother had relied on a neighbour who had a borehole in her community.\nGaa-Lamba is one of the communities that benefited from the Zonal Intervention Borehole Water Project facilitated by an honourable member of the Federal House of Representatives, representing Asa/Ilorin West Federal Constituency, Abdulyekeen Alajagusi.\nOn-site fact-findingTo monitor the projects, SaharaReporters embarked on site verification of these borehole projects supervised by the Lower Niger River Basin Development Authority (LNRBDA) at Alapa/Onire Odegiwa Ward.\n\"All this would have stopped if the borehole installed for us was working well,\" Balikisu added.\nAlso, Micheal Jacobs Consulting Limited, the company that handled the project, did not return several calls, text messages, and Whatsapp messages sent to them, asking for their comment on the dam project."
  },
  {
    "headline": "EXCLUSIVE: How Lower Niger River Basin Development Authority Spent N100M On Kwara Lawmaker, Alajagusi's Failed Water Projects",
    "summarized_story": "For her water needs, the nursing mother had relied on a neighbour who had a borehole in her community.\nGaa-Lamba is one of the communities that benefited from the Zonal Intervention Borehole Water Project facilitated by an honourable member of the Federal House of Representatives, representing Asa/Ilorin West Federal Constituency, Abdulyekeen Alajagusi.\nOn-site fact-findingTo monitor the projects, SaharaReporters embarked on site verification of these borehole projects supervised by the Lower Niger River Basin Development Authority (LNRBDA) at Alapa/Onire Odegiwa Ward.\n\"All this would have stopped if the borehole installed for us was working well,\" Balikisu added.\nAlso, Micheal Jacobs Consulting Limited, the company that handled the project, did not return several calls, text messages, and Whatsapp messages sent to them, asking for their comment on the dam project."
  },
  {
    "headline": "Terrorists free 7 abducted Kaduna train passengers -- including Ango Abdullahi's son",
    "summarized_story": "Seven more abducted passengers of the Abuja- Kaduna train attack have been freed.\nAccording to the Kaduna-based Desert Herald newspaper, the son of Ango Abdullahi, chairman of Northern Elders Forum (NEF), is among the seven freed victims.\nTukur Mamu, publisher of Desert Herald, confirmed the release of the abducted passengers.\nAdvertisementEleven of the abducted passengers had earlier been released in June.\nAdvertisement“Yes, it is true seven people were released today, I just spoke with the family of one of those released,” Jimoh said."
  },
  {
    "headline": "Terrorists free 7 abducted Kaduna train passengers -- including Ango Abdullahi's son",
    "summarized_story": "Seven more abducted passengers of the Abuja- Kaduna train attack have been freed.\nAccording to the Kaduna-based Desert Herald newspaper, the son of Ango Abdullahi, chairman of Northern Elders Forum (NEF), is among the seven freed victims.\nTukur Mamu, publisher of Desert Herald, confirmed the release of the abducted passengers.\nAdvertisementEleven of the abducted passengers had earlier been released in June.\nAdvertisement“Yes, it is true seven people were released today, I just spoke with the family of one of those released,” Jimoh said."
  },
  {
    "headline": "NCDC records 880 fresh COVID cases -- highest in over five months",
    "summarized_story": "The figure is the highest number of weekly cases recorded since between January 17 and 23, when the cases reached 1,258.\nLagos, the epicentre of the disease, recorded the highest number with 750 cases, followed by the FCT with 48 positive samples and Rivers recorded 40 cases.\nSo far, Lagos accounts for the highest number of coronavirus cases with 101,391 positive samples, followed by FCT (28,811) and Rivers (16,866).\nMeanwhile, the NCDC has advised Nigerians to take necessary precautions during the Eid-el-Kabir celebrations following the recent increase in COVID cases globally.\nThe NCDC said the number of weekly cases had increased globally for the third consecutive week."
  },
  {
    "headline": "NCDC records 880 fresh COVID cases -- highest in over five months",
    "summarized_story": "The figure is the highest number of weekly cases recorded since between January 17 and 23, when the cases reached 1,258.\nLagos, the epicentre of the disease, recorded the highest number with 750 cases, followed by the FCT with 48 positive samples and Rivers recorded 40 cases.\nSo far, Lagos accounts for the highest number of coronavirus cases with 101,391 positive samples, followed by FCT (28,811) and Rivers (16,866).\nMeanwhile, the NCDC has advised Nigerians to take necessary precautions during the Eid-el-Kabir celebrations following the recent increase in COVID cases globally.\nThe NCDC said the number of weekly cases had increased globally for the third consecutive week."
  },
  {
    "headline": "APC senatorial tickets: INEC asks Lawan, Akpabio to seek redress in court",
    "summarized_story": "The Independent National Electoral Commission (INEC) has asked persons aggrieved over the conduct of primaries to seek redress in court.\nSenate President Ahmad Lawan and Godswill Akpabio, former minister of Niger Delta affairs, had been listed by the All Progressives Congress (APC) as candidates for Yobe north and Akwa Ibom north-west senatorial districts, respectively.\nTheir exclusion heightened the controversy over the APC Yobe north senatorial ticket and the slot for the Akwa Ibom north-west district.\nIn particular, allegations intended to impugn the integrity of the Commission have been made in respect of the Akwa Ibom North West and Yobe North Senatorial Districts,” the statement reads.\nAdvertisement“In relation to the primaries for the Akwa Ibom North West and Yobe North Senatorial Districts, the Commission stands by the monitoring reports received from our State offices."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "Digital Nomads: Freelance digital marketer Baraka Mafole wants Tanzanians to thrive in the digital economy",
    "summarized_story": "After discovering that his fellow students were making money online, Mafole decided to join them; he spent hours learning digital skills.\nIn the last decade, the Tanzanian digital ecosystem has evolved as more Tanzanian citizens have access to digital services.\nThis led them to co-found an initiative called Tanzania Digital Trailblazers later that month, a series of virtual events to bring awareness of digital skills to young Tanzanians.\nThis time around, they added physical monthly digital skills training events to the mix.\nMafole said that dozens of Tanzanian youths have connected with his story and have been inspired to upgrade their lives by learning digital skills."
  },
  {
    "headline": "These founders are closing delivery gaps in Rwanda’s capital",
    "summarized_story": "During the 2020 lockdown, Anselme Mucunguzi, 30, noticed a gap in the technology needed to service last mile delivery in Kigali, the Rwandan capital.\nSo, in January 2021, he founded Nisawa, a last-mile delivery service.\nBirori had wanted Nisawa to transition to an online marketplace while Mucunguzi insisted on remaining in the last-mile delivery line.\nAll a seller needs to do to initiate a delivery is supply the receiver’s phone number on the Vanoma website.\nNairobi, he explains, already has plenty of delivery products—Uber and Bolt, for example—so Vanoma will not be expanding there just yet."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Rita Anwiri Chindah on her life as a lawyer and digital content creator",
    "summarized_story": "Today on Everyday People, we meet Rita Anwiri Chindah, an intellectual property and information technology lawyer and an arbitrator based in Port-Harcourt, Rivers State.\nSo sometimes when I want to record, I have to tell my family, cause I stay with my parents.\nI went there the first time and they said, “Okay, maybe come back next week.”And I went back the following week.\nGet ready to subscribe on Spotify, Apple podcast, google podcast and other platforms.\nWhen you’re trying to Google, trying to read different documents, make sure that you give a brief summary of everything."
  },
  {
    "headline": "Young filmmakers struggle to get content on major streaming platforms",
    "summarized_story": "But the affordability of digital equipment remains a big challenge for young filmmakers.\nExperts say the major requirement for top streaming platforms is casting.\nHe further noted that due to their zealousness and eagerness to show the world what they are made of, there is no shortage of creativity among young filmmakers.\nOkerekeocha added that consistency is key, young filmmakers should use the opportunity to improve their craft across the board and make sure they are excellent in what they are doing.\n“Secondly, although many young filmmakers are super talented and have what it takes to create meaningful and exciting content, they are often challenged with accessing funding to create content that streaming platforms would want,” he added."
  },
  {
    "headline": "Nigeria’s dollar scarcity turning to gain for cattle rearing and local diary production",
    "summarized_story": "Nigeria’s ban on buying dollars to import milk is prompting dairy companies to invest in cattle farms — some with exotic cows — in Africa’s biggest economy.\nArla is investing $10 million on a cattle farm in Nigerian northern Kaduna State, Jimmy Johnmark, general manager at the company said.\nIt also plans to partner with the Kaduna administration to buy milk from 1,000 pastoralists in a state-built grazing reserve.\nRoaming herders account for more than 90% of Nigeria’s domestic milk production.\nThe maker of Dano Milk plans to produce about 46,000 liters daily from its own farm in five years, which will reduce its milk imports by about 20%, according to Johnmark."
  },
  {
    "headline": "Meet Kuwaiti’s Al-Ghais, the diplomat to replace Barkindo as OPEC’s Sec Gen",
    "summarized_story": "The sudden death of the Organisation of Petroleum Exporting Countries (OPEC’s) Secretary-General Mohammed Barkindo is thrusting his successor Haitham Al-Ghais into the limelight earlier than planned, findings by BusinessDay shows.\nFor Al-Ghais, OPEC’s next meeting on August 3 will be pivotal for some of the biggest oil producers as they are expected to set a new production policy which would start from September.\nRead also: OBITUARY: Barkindo, ex-NNPC boss who died with ‘OPEC in his blood’That agreement is due to expire at the end of the year.\nAnother OPEC delegate said that being from a Gulf state might give al-Ghais the advantage of increased coordination among Gulf states.\nClimate Debate ChallengeBeyond the internal workings of the influential producer’s group, Al-Ghais will be tasked with representing and defending the interests of oil-producing countries."
  },
  {
    "headline": "Eid-el-Kabir: Obaseki felicitates with Muslims, urges love, sacrifice – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has felicitated with Muslims on the celebration of Eid-el-Kabir.\nIn a statement, the governor urged the Muslim faithful to imbibe the lesson of sacrifice which the Eid-el-Kabir symbolizes.\nHe said, “I felicitate with our Muslim brothers and sisters on the celebration of the Eid-el-Kabir festivities.\nAs we join our Muslim faithful to mark this auspicious celebration, I urge everyone to imbibe the lesson of sacrifice that it symbolizes.\nBeyond personal convictions, we all have a deeper and greater responsibility to God and humanity."
  },
  {
    "headline": "Eid-el-Kabir: Shaibu charges Nigerians on religious tolerance – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Acting Governor, Rt.\nComrade Philip Shaibu, has called on Nigerian leaders to demonstrate the virtue of religious tolerance in the spirit of the Eid-el-Kabir celebration.\nShaibu said this while receiving Muslim faithful who were at the Government House, Benin City, to commemorate the Eid-El-Kabir celebration.\nHe noted: “Edo State is one of the states in Nigeria where Muslims and Christians live peacefully and work together for the development of the state.\n“We have been trying our best to make Edo State great."
  },
  {
    "headline": "DTSG Presents Cheques To Next Of Kins Of Victims Of Oleh, Ozoro Crisis – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestASABA – Delta State Government has presented government’s financial support to the next of kins of victims of the boundary dispute between Ozoro and Oleh communities in Isoko South Local Government Area towards the burial of those who died as a result of the dispute.\nThe Secretary to the State Government (SSG), Chief Patrick Ukah, on behalf of the state government presented cheques to the beneficiaries in his office in Asaba.\nVantus Ogboghoro, thanked Oleh community for the matured way they handled the dispute.\nHe appealed to the state government to ensure the implementation of the resolutions of the white paper.\nMr. Egeme thanked the state government for wading into the matter with a view to proffering lasting solution and pledged that the two communities would maintain peace."
  },
  {
    "headline": "300 Pupils Benefit From Free LAPO Community Health Outreach – Nigerian Observer",
    "summarized_story": "The Primary Schools are Obazagbon Primary School and Ogiama Primary School in Obazagbon Community.\nDelivering his address at the 17th edition of the LAPO community health outreach on Friday, July 8, 2022 in Obazagbon community, the Executive Director, LAPO, Dr. Honestus Obadiora said LAPO institutionalized its community health outreach in 2015 as a direct response to health challenges in rural communities.\nDr. Obadiora, represented by Mrs.Vivian Evbotokhai , Senior Program Officer, LAPO, revealed that a total of 15,649 persons have benefitted from the community health outreaches since its inception in 2015 .\nThe 17th LAPO community health outreach provided the pupils of indigent parents in Obazagbon community free health care services, administered by medical consultants and specialists in areas of oral / personal hygiene and eye care services.\nOn her part , Mrs. Irabor Josephine, Health Officer, (SUBEB) stated that government through the board, had provided the enabling environment through its school based management committee and its field officers for the successful organization of the 17th LAPO community health outreach in Obazagbon community in Edo state."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Nigeria’s Joe Aribo joins Southampton on four-year deal",
    "summarized_story": "Joe Aribo, Super Eagles midfielder, has joined Southampton from Scottish giants Rangers on a four-year deal.\nAribo becomes Southampton’s fifth signing of the summer after the arrivals of Gavin Bazunu, Mateusz Lis, Armel Bella-Kotchap and Romeo Lavia.\nThe statement from Southampton read: “Southampton Football Club is delighted to announce the signing of Joe Aribo from Rangers on a four-year deal.\n“Known for his versatility, Aribo stands at 6ft tall and can operate anywhere across midfield, or as a forward.\nSpeaking on his move to Southampton, Aribo said: “It’s an amazing club with a lot of history here, and it’s a good plan with what’s to come next."
  },
  {
    "headline": "NBRP lauds NLNG on release of 2022 longlist, opens platforms for exposure of books, authors",
    "summarized_story": "The Network of Book Clubs and Reading Promoters in Nigeria (NBRP), has welcomed the release of the longlist for the Nigerian Prize for Literature 2022, just as commended the NLNG for keeping faith with the process through the years.\nIn support of the laudable objective of the initiative, NBRP, also known as the Network, said it is also opening up its platforms to support awareness of the project through encouraging its members countrywide to read and discuss the books in the lists, including where scheduled, having the writers themselves in attendance.\n“This is an excellent opportunity to get people reading,” Richard Mammah, President of the Network, said, adding that “the NLNG Nigeria Prize for Literature longlist has opened an exciting season of reading that will linger on long after the winner has been announced.”Established in February 2020, NBRP only recently carried out a pilot nationwide survey of the State of reading infrastructure in Nigeria."
  },
  {
    "headline": "JUST IN: Terrorists free seven more Kaduna train passengers",
    "summarized_story": "Terrorists who abducted passengers of a Kaduna-bound train after the attack on March 28, have released seven more persons.\nMalam Tukur Mamu, one of the negotiators and Media consultant to Islamic Cleric, Sheikh Ahmad Gumi, disclosed this on Saturday.\nHe said through his singular efforts, he successfully negotiated the release of “another seven victims.”The terrorists had earlier threatened to start killing the abducted passengers within 24 hours if the federal government failed to meet their demands.\nMore subsequently …"
  },
  {
    "headline": "Your visit to Wike a miscalculation – Saraki tells APC governors",
    "summarized_story": "Abubakar Bukola Saraki, former Senate President Bukola, has described the visit by governors of the All Progressives Congress (APC) to Nyesom Wike, governor of Rivers state, as a miscalculation.\nThe visit came amid speculations that Wike, who is a member of the PDP, might defect from the party after losing the presidential and vice-presidential tickets.\nBut speaking with reporters during the Eid celebration in Ilorin, Kwara state capital, Saraki said Wike is important to the PDP and the party won’t let him go.\n“The fact that some APC governors went to see their colleague, trying to capitalise on what they think is an issue is a gross miscalculation.\n“The APC governors know that it is this kind of a crack they need to latch on."
  },
  {
    "headline": "Extra: Ram climbs two-storey building to avoid being killed [VIDEO]",
    "summarized_story": "A viral video posted on social media shows a ram on top of a two-storey building probably trying to escape being killed for Sallah celebration.\nAlthough those who posted the video did not indicate whether it is Sallah ram or not.\nWatch video below:"
  },
  {
    "headline": "Ex-Lawmaker Accuses Reps’ Spokesperson For His Broken Marriage",
    "summarized_story": "Benjamin Kalu, of allegedly being the mastermind of his broken marriage.\nUwak, who made the allegation via his verified Twitter handle, accused Kalu of having an illicit affair with his wife, Mrs Kezia Uwak, and bankrolling and egging her to nullify her marriage.\nThe ex-lawmaker while recounting how the alleged infidelity began, said “Kalu was dating Kezia who was his staff in 2017, in a whirlwind office romance.\nUwak further accused Kalu of booking a hotel room for two days where he kept Kezia and the children.\nI am not dating Kalu."
  },
  {
    "headline": "Ex-Lawmaker Accuses Reps’ Spokesperson For His Broken Marriage",
    "summarized_story": "Benjamin Kalu, of allegedly being the mastermind of his broken marriage.\nUwak, who made the allegation via his verified Twitter handle, accused Kalu of having an illicit affair with his wife, Mrs Kezia Uwak, and bankrolling and egging her to nullify her marriage.\nThe ex-lawmaker while recounting how the alleged infidelity began, said “Kalu was dating Kezia who was his staff in 2017, in a whirlwind office romance.\nUwak further accused Kalu of booking a hotel room for two days where he kept Kezia and the children.\nI am not dating Kalu."
  },
  {
    "headline": "BREAKING: Again, 7 More Kidnapped Train Passengers Regain Freedom",
    "summarized_story": "Other lucky passengers were Muhammad Daiyabu Paki, Aliyu Usman and the only foreign national of Pakistani origin, Dr. Muhammad Abuzar Afzal.\n“That is why I keep emphasising that government has the power to end the agony of this innocent victims in one day.\nIt is this power of engagement and sincerity that resulted to the release of this seven victims.\nThe negotiator added that seven released victims have been handed over to the military and were now on their way to Kaduna.\nHe appreciated the Kaduna Division 1 GOC for the support he gave during the negotiation mission."
  },
  {
    "headline": "BREAKING: Again, 7 More Kidnapped Train Passengers Regain Freedom",
    "summarized_story": "Other lucky passengers were Muhammad Daiyabu Paki, Aliyu Usman and the only foreign national of Pakistani origin, Dr. Muhammad Abuzar Afzal.\n“That is why I keep emphasising that government has the power to end the agony of this innocent victims in one day.\nIt is this power of engagement and sincerity that resulted to the release of this seven victims.\nThe negotiator added that seven released victims have been handed over to the military and were now on their way to Kaduna.\nHe appreciated the Kaduna Division 1 GOC for the support he gave during the negotiation mission."
  },
  {
    "headline": "Party Primaries: We’ll Stand By Reports Of Our Monitors, INEC Insists",
    "summarized_story": "The Independent National Electoral Commission (INEC) has finally clarified its stance regarding the All Progressives Congress (APC) primary elections in Yobe North and Akwa Ibom North-West senatorial districts for the 2023 elections, saying the Commission will only stand by the reports of its monitors sent to monitor the exercises.\nThe nation’s electoral body also said the Commission is currently funtus officio in the two cases.\nThe Senate President, Ahmad Lawan, and the immediate-past Minister of Niger Delta Affairs, Godswill Akpabio, are reported to be angling to replace the initial winners of the Yobe North and Akwa Ibom North-West senatorial tickets respectively.\n“In particular, allegations intended to impugn the integrity of the Commission have been made in respect of the Akwa Ibom North West and Yobe North Senatorial Districts.\nIn line with its constitutional and legal obligations, the Commission deployed monitors to the various constituencies and received reports of such exercise."
  },
  {
    "headline": "Kidnapped Jonathan's cousin Ogiasa cries out from grave for his life (Video)",
    "summarized_story": "Kidnapped Mike Ogiasa, cousin of former President Goodluck Jonathan has cried out for his life from a shallow grace filled with dirty water where he was dumped by his abductors.\nA viral video on social media saw Ogiasa, the former Bayelsa State Commissioner pleading for his life from the den of his abductors.\nThe video showed the victim’s head covered with a dirty nylon bag as he pleaded for his life with his legs tied.\nThe abductors had probably filmed him in pain and agony and released the video on social media.\nWatch video below:Video credit: GoldmynetvOgiasa was seen crying: “Is the money that is there more important than my life?"
  },
  {
    "headline": "Wike hits Buhari's new minister Odum",
    "summarized_story": "Okafor Ofiebor/Port HarcourtGovernor Nyesom Wike on Saturday condemns the selection of the Udi Odum who was sworn in as Minister of State for Environment by President Muhammadu Buhari last Wednesday as representative of Rivers State in the Federal Executive Council.\nWike who spoke for first time about the new minister appointed by President Buhari to replace former Rotimi Amaechi who resigned as Minister of transportation to contest for the presidential ticket of the ruling party.\nThe Governor described the appointment of Odum as an aberration, claiming that he did not have the requisite intellectual acumen to represent the State as a Minister in the Federal Executive Council.\nThe image of the State is key.”However, findings by our Correspondent show that Udi Odum first came into public life as Chairman of Abua/Odual local government area in 2003.\nOdum Udi is a champion of community organizing."
  },
  {
    "headline": "Oprah Winfrey's father Vernon dies at 89",
    "summarized_story": "Tv mogul Oprah Winfrey has announced the death of his father Vernon Winfrey at the age of 89.\nOprah took to her Instagram page on Saturday to announce the death of his father.\nShe wrote: “Less than a week ago we honored my father in his own backyard.\nYesterday with family surrounding his bedside, I had the sacred honor of witnessing the man responsible for my life, take his last breath.\nThank you for your prayers and good thoughts.”Five days ago, Oprah had said: “Giving my father his “flowers” while he’s still well enough to smell them."
  },
  {
    "headline": "Wike: I will handover properly to my successor",
    "summarized_story": "Okafor Ofiebor/Port HarcourtRivers State governor, Nyesom Ezenwo Wike has said that he is determined to do a proper handover to the his successor, despite the fact that his predecessor did not do a proper handover to him.\nWike said this after he sworn-in five new commissioners on Saturday at the Executive Chamber of Government House in Port Harcourt.\nWhat we have done from ministry to ministry, you have to start compiling them.\nThe image of the State is key.”Governor Wike also informed that his administration has completed more projects that are scheduled for inauguration.\nThe commissioners sworn in by Wike on Saturday and their portfolios are: Hon."
  },
  {
    "headline": "VIDEO: Goodluck Jonathan’s Cousin, Mike Ogiasa Begs For His Life In Kidnapper’s Den",
    "summarized_story": "In a video that has since gone viral, Mike Ogiasa, a relative of former president Goodluck Jonathan who was kidnapped by gunmen in Bayelsa State, can be seen pleading for his life in the kidnapper’s den.\nOn June 4, 2022, Ogiasa, an engineer, was abducted in his hometown of Otuabadi in the Ogbia Local Government Area.\nOgiasa is seen half-naked in a flooded tomb in the video, which SaharaReporters got and ran for 27 seconds.\nWATCH: Kidnappers Release Disturbing Video Of Abducted Former Nigerian President, @GEJonathan’s Cousin Mike Ogiasa Crying For Help Inside A shallow Grave FULL VIDEO: https://t.co/sXmTAe4zyZ pic.twitter.com/It9o8IKhtk — Sahara Reporters (@SaharaReporters) July 9, 2022He cried, “You’re seeing me in the grave.\nOgiasa, who also served as Special Adviser on Power to the state government, had finished attending a meeting before his assailants swooped on him."
  },
  {
    "headline": "BREAKING: Terrorists Release Seven More Train Passengers — Negotiator",
    "summarized_story": "Following more than 100 days in captivity in the forest, the terrorists who attacked the Abuja-Kaduna bound AK9 train on March 28 have freed a new group of seven hostages.\nOne of the negotiators and media advisor to controversial Islamic cleric Sheikh Ahmad Gumi, Malam Tukur Mamu, revealed this and claimed that via his lone efforts, he had successfully negotiated the release of “another seven victims.”Details later…"
  },
  {
    "headline": "JUST IN: Itsekiri host Communities’ Shutdown Chevron’s Olero, Dibi fields",
    "summarized_story": "The Olero, Dibi, and Abiteye Fields’ Itsekiri host communities, who also demand basic facilities and the hiring of VTP 5 and VTP 6 trainees, have forced Chevron to cease operations in Delta State.\nComrade Raymond Aderojo led the protesters, who started the shutdown this morning.\nThey demanded portable drinking water, electricity, health care, a review of undergraduate scholarships, a review of community workers’ salaries, employment for graduates, the location of the vocational training center in Warri so that the VTP Program could resume, and the conversion of VTP 5 and VTP 6 trainees."
  },
  {
    "headline": "Eid-el-Kabir: Buhari in Daura for six-day Sallah festivities",
    "summarized_story": "In a statement released on Friday in Abuja, Garba Shehu, the president’s Senior Special Assistant on Media and Publicity, verified this.\nHe claimed that at 5:15 p.m., the president’s plane landed at Katsina’s Umaru Musa Yar’Adua Airport, where he was met by the governor, Aminu Masari, and other top state officials.\nOn arrival in Daura, the president was received by the Emir, Dr Faruk Umar Faruk, members of the Emirate Council and other district heads.\nHe is expected to return to Abuja July 14."
  },
  {
    "headline": "Buhari, other Muslim faithful perform Eid prayer on Sallah day",
    "summarized_story": "President Muhammadu Buhari on Saturday joined other Muslims at the Kofar Arewa Eid prayer ground, Katsina State.\nThis is because the President joined hundreds of Muslim faithful to participate in the 2023 Eid-El-Adha also known as Eid-El Kabir.\nThe security operatives drawn from the Police, Army, the Department of State Services (DSS), the Nigeria Security and Civil Defence Corps (NSCDC) and other sister security agencies stormed the Eid Prayer Ground to give maximum security for the President, his entourage and other worshippers attending the Eid Prayer.\nChannels Television observed that the entire parameter fencing of the Eid Prayer Ground was completely surrounded by a team of security personnel deployed by their various agencies with movements of vehicles including bicycles restricted in the area.\nThe two Rak’at prayers led by Imam Safiyanu Yusuf Dansanwai at Kofar Arewa Eid Prayer Ground commenced at about 10:00 am and rounded up at about 10:05 am."
  },
  {
    "headline": "Breaking: Amidst wild protest, Sri Lanka’s President resigns",
    "summarized_story": "Soon after they stormed the presidential palace, Rajapaksa’s nearby seafront office also fell into the hands of protesters.\nA new prime minister, Ranil Wickremesinghe, took over in May to help steer the country out of the crisis.\nThousands of people broke through barricades and entered President Gotabaya Rajapaksa’s residence and nearby office to vent their anger against a leader they hold responsible for the nation’s worst crisis.\nVideos posted on social media showed protesters storming the residence, chanting ‘Gota go home,’ calling the president by his nickname.\nSri Lanka Medical Council said that the president, prime minister and the government would be held responsible if people died or were maimed."
  },
  {
    "headline": "Happening now: Protest worsens in Sri Lanka, Prime Minister’s house set ablaze, President remains in hiding",
    "summarized_story": "The planned rally, one of the largest anti-government marches in the crisis-hit country this year, turned violent as thousands of furious demonstrators surged past police barricades and into the presidential compound and nearby office of Sri Lankan President Gotabaya Rajapaksa.\nThe office of Prime Minister Ranil Wickremesinghe said the protesters forced their way into his Colombo home on Saturday evening.\nSome protesters, holding Sri Lankan flags and helmets, also swam in the presidential swimming pool, video footage from local TV news NewsFirst channel showed.\nTwo defence ministry sources said President Gotabaya Rajapaksa was removed from the official premises on Friday for his safety ahead of the planned rally over the weekend, with government spokesman Mohan Samaranayake unsure of Rajapaksa’s whereabouts.\nMany blame the country’s decline on President Gotabaya Rajapaksa, as it muddles through with aid from India and other countries and its leaders try to negotiate a bailout with the International Monetary Fund."
  },
  {
    "headline": "Afreximbank to finance Floating Liquefied Natural Gas project in Nigeria",
    "summarized_story": "By Onu OkorieAfrican Export-Import Bank Afreximbank is pleased to announce its execution of a project preparation facility financing head of terms with UTM Offshore Limited UTM, under which the Bank will part-finance activities designed to progress a Floating Liquefied Natural Gas FNLG project in Nigeria to bankability.\nThis project is of historical significance as it is the first FNLG project developed by an African-owned company on the continent.\nAs well as representing a “first” as an African-led intervention in the FNLG sector, the project aligns with Afreximbank’s strategic aim of advancing activities which boast strong climate finance credentials.\nTo advance the timely implementation of the project, Afreximbank is leveraging its diverse product suite to provide end-to-end solutions.\nDuring the pre-investment stage, the project preparation facility will be deployed to de-risk the project and rapidly progress it towards bankability."
  },
  {
    "headline": "REA, FADAMA sign MoU for Agriculture, water resources programmes electrification",
    "summarized_story": "By Onu OkorieRural Electrification Agency REA has signed a Memorandum of Understanding MoU with the National Fadama Development Project NFDP to collaborate on several activities during the planning and implementation of electrification programmes targeted at agriculture, land and water resources.\nAccording to him, “The MoU will mutually benefit both the REA and FADAMA.\nThese “Agro-Energy” programmes are intended to provide electricity for productive use and unlock the economic potential/activities in rural and agrarian communities alike.\nREA intends to provide decentralised solar pumps and/or centralised solar mini-grids to viable FADAMA irrigation schemes.\nREA intends to provide Solar Home Systems (SHS) and Solar Street Lights (SSLs) to viable IDP communities."
  },
  {
    "headline": "FG to secure Nigeria ownership of maritime industry",
    "summarized_story": "By Naomi DouglasFederal Government is set to sack jobs in the shipping industry dominated by foreigners that own several shipping lines operating in Nigeria.\nIn its bid to rid the industry of this feat, the FG has reaffirmed Commitment to establish a national shipping line.\nHighlights of the event was hinged on the importance of Nigerian ownership of shipping activities within the country in order to reap the full economic benefits of the maritime sector.\nRepresented by the Director of Procurement, Useni Adamu, Saraki emphasised the need for capacity building in the maritime industry.\n“The present administration is looking into ways of encouraging the establishment of a private sector-driven national shipping line to ensure maximum exploitation of the potentials in our maritime industry."
  },
  {
    "headline": "Nigeria’s Economic Diversification: Value addition in solid minerals sector will spur industrialization- DG NSRMEA",
    "summarized_story": "By Palma IleyeDirector General, National Steel Raw Materials Exploration Agency, NSRMEA, Engr, Dr. Umar Albarka Hassan, has said that value addition in iron and steel production was not only for the purpose of revenue generation but will also spur industrialization and investment rates in the country.\nWhen you talk about steel production it is actually extracting iron ore and converting it into steel which is also value addition.\nAnd our mandate is to source for materials for iron and steel production and ofcourse adding value.\nWhen you talk about other minerals that are exploited example gold and other minerals we have established smelting companies to create value addition to such minerals.\nAlso we have established Manganese resources located in Cross River and Kogi State we have also established and earmarked local sources deposits in Zamfara State,” he added."
  },
  {
    "headline": "NGSA, NMCO, AG Vision others top The Truth’s most impactful mining sector entities of 2022",
    "summarized_story": "By Palma IleyeNigerian Geological Survey Agency, NGSA, the Nigeria Mining Cadastre Office, NMCO, AG Vision and seven others have emerged as Truth-Afrique 2022 impactful companies contributing to the growth of Nigeria mining sector.\nThe organisation however said that no state government met the criteria for inclusion in the list.\nKadiri said state governments were not doing enough in the quest to jointly pursue the realisation of the Roadmap for Growth and Development of the Nigerian mining sector.\nAccording to him, “None of the 36 State governments satisfied the criteria for organisation ten most impactful mining sector entities of 2022.\nHe therefore congratulated the entities that made the list and urged them to continue to contribute to the growth and development of the Mining and Mineral sector of Nigeria."
  },
  {
    "headline": "Kaduna Train Attack: Terrorists Release Seven More Kidnapped Passengers",
    "summarized_story": "Seven more kidnapped passengers of the March 28 train attack in Kaduna state have been released by the terrorists who attacked the train.\nThe victims were released by their abductors on Saturday after spending over 100 days in captivity.\nBut he did not say if any ransom was paid or not before the terrorists released the victims.\nMamu disclosed that the seven released hostages have been handed over to the military and that they were in their way to Kaduna.\nMamu, while reiterating the power of mediation in addressing the security challenges bedeviling the country, claimed that he singlehandedly facilitated and initiated the release of the seven kidnapped victims with support from Sheikh Ahmad Gumi."
  },
  {
    "headline": "Two Missing As Flood Wreaks Havoc In Lagos",
    "summarized_story": "Three persons have been rescued with two others missing as flood wreaked havoc on a community in the Orile Agege area of Lagos State.\nChannels Television gathered that the victims were caught up in a severe flood on Oyatoki Street in the nation’s commercial centre.\nThe Southwest Coordinator NEMA, Ibrahim Farinloye, explained that four of the victims have been rescued, while two are still missing.\nREAD ALSO: Flooding: Lagos Govt To Divert Traffic In Ogba For Installation Of Concrete CulvertRescuers from both the National Emergency Management Agency (NEMA) and those from the Lagos State Emergency Management Agency (LASEMA) as well as those from the fire service were still searching for the two missing persons at the time of this report.\nAs part of measures to contain the situation, the Lagos State Government announced the diversion of traffic along Oba Ogunji Road, Ogba for one week for the installation of a precast concrete culvert across Metal Box Road."
  },
  {
    "headline": "Eid-El-Kabir: Muslims Observe Prayers At Eid Grounds",
    "summarized_story": "The annual festival of Eid al-Adha or the Festival of Sacrifice marks the end of the hajj pilgrimage to Mecca by hundreds of millions of Muslims.\nIn Katsina, President Muhammadu Buhari arrived his country home, the Daura area of the north-western state for the Eid-el- Kabir on Friday evening.\nThe two Rak’at prayers led by Imam Safiyanu Yusuf Dansanwai at Kofar Arewa Eid Prayer Ground commenced at about 10:00 am and rounded up at about 10:05 am.\nEarlier before the commencement of the prayer, security was beefed up at the Kofar Arewa Eid prayer ground in Daura.\nSecurity personnel from the Police, the Army, the DSS, the NSCDC and other sister security agencies stormed the Eid Prayer Ground to give maximum security for the President, his entourage and other worshippers attending the Eid Prayer."
  },
  {
    "headline": "Kuje Attack: Fleeing Inmate Linked To Terrorism Arrested In Nasarawa",
    "summarized_story": "One of the suspected terrorists who escaped from the Kuje Correctional Centre during the Boko Haram invasion, Hassan Hassan, has been recaptured in Nasarawa State.\nOn Friday, the Nigerian Correctional Service (NCoS) revealed the names and photos of 69 inmates who escaped from the correctional facility following an attack by terrorists three days ago.\nChannels Television observes that Hassan is number 12 on the list of terrorism suspects released.\nThe Police Public Relations Officer in Nasarawa State announced his arrest via a statement obtained by Channels Television.\nREAD ALSO: Kuje Prison Attack: FG Declares Fleeing Boko Haram Suspects Wanted, Releases PhotosHe said the Commissioner of Police in the state, Adesina Soyemi, has directed the transfer of the suspect while intensifying the search for other fleeing inmates."
  },
  {
    "headline": "Super Eagles Midfielder Aribo Seals Premier League Move",
    "summarized_story": "Super Eagles midfielder Joe Aribo has joined Premier League side, Southampton on a four-year deal from Scottish Giants, Rangers.\nThe 25-year-old has played the past three seasons at Ibrox, scoring 26 goals in 149 matches since joining from English league one side, Charlton Athletic in 2019.\nAribo helped Rangers win their 55th SPL title in the 2020/2021 season, their firstin 10 years while liftingthe Scottish Cup last season.\nHe was a runner-up in last season’s UEFA Europa League in which he scored in the final against German Bundesliga side Frankfurt.\n“The Premier League is the best league in the world."
  },
  {
    "headline": "Three APC Governors visit Nyesom Wike in Port Harcourt",
    "summarized_story": "Rivers State Governor Nyesom Wike held closed door meetin with three governors of the All Progressives Congress in Port Harcourt.\nNyesom Wike received the Governors of Lagos State, Babajide Sanwo-Olu, Ondo State, Rotimi Akeredolu and Ekiti State, Kayode Fayemi at his country home.\nThe visit of the APC governors comes amidst speculations about the political future of Governor Nyesom Wike following the outcome of the PDP Presidential Primaries and the choice of a running mate to the PDP flagbearer, Atiku Abubakar.\nAdvertisementAdvertisementThe crisis worsened after Atiku rejected the recommendation of an ad hoc committee of the party and picked Delta State Governor, Ifeanyi Okowa, as his running mate.\nThe committee was reported to have recommended Mr Wike for the position, although the party later cllaimed that Mr Wike was only one of three nominees recommended by the committee."
  },
  {
    "headline": "Akinlade joins PDP, emerges Adebutu's running mate",
    "summarized_story": "Ladi Adebutu and Hon.\nAdekunle Akinlade are long time allies, who both served at the green chamber from the state in the eighth legislative assembly.\nAkinlade is a strong loyalist of Senator Ibikunle Amosun and had earlier announced his defection from the ruling party, blaming his decision on injustice within the APC."
  },
  {
    "headline": "2023: Labour Party announces Datti Ahmed as Peter Obi's running mate -",
    "summarized_story": "The Labour Party has officially announced Datti Ahmed as Peter Obi’s running mate for the 2023 Presidential Election.\nThis follows the withdrawal of Doyin Okupe from the race in a letter he personally signed and sent to the Independent National Electoral Commission.\nAdvertisement"
  },
  {
    "headline": "Updated: Segun Oni petitions Tribunal over Ekiti Guber result",
    "summarized_story": "The Candidate of the Social Democratic Party at the June 18 Governorship Poll, Segun Oni Has filed a Petition Challenging the result of the Poll which was announced in favour of the All progressives Congress Candidate (APC), Biodun Abayomi Oyebanji.Submitting his Petition at the State High Court, the Former Governor says he is of the believe that he won the election and his petition will prove sameHead of the Legal Team, Obafemi Adewale says the Candidate is challenging the result based on irregularities before and during the election and Questions specifically the Legality of the announced Candidate.\nAdvertisementIt could be recalled that Segun Oni was the runner up at the Election where he polled a total of 82,211 votes against the Winner, Biodun Oyebanji of the APC as announced by INECAdvertisement"
  },
  {
    "headline": "Kaduna Train Attack: 7 More Abductees Freed By Terrorists, 43 Still Held Captive",
    "summarized_story": "Seven of the 50 remaining abductees of the March 28 Abuja-Kaduna train attack were on Saturday released by the terrorists who kidnapped them.\nHe thanked the Kaduna military GOC for the support he gave during the rescue mission.\n“The location they (terrorists) gave is remote, sensitive and risky.\nOn March 28, 2022, terrorists attacked a Kaduna-bound passenger train, killing eight people and abducting 63 others.\nOne of the abducted victims was released few days after a ransom of N100 million was paid."
  },
  {
    "headline": "Sri Lankan Prime Minister Agrees to Resign after Protesters Storm President’s Residence",
    "summarized_story": "Sri Lanka’s Prime Minister Ranil Wickremesinghe has agreed to resign after party leaders in Parliament demanded both he and the embattled president step down on the day protesters stormed the president’s residence and office.\nLeaders of political parties in Parliament met after the storming of the president’s residence and decided to request Rajapaksa and Prime Minister Ranil Wickremesinghe to step down, opposition lawmaker Rauff Hakeem said on Twitter.\nAt the president’s office, security personnel tried to stop demonstrators who pushed through fences to run across the lawns and inside the colonial-era building.\nHe said that the negotiations with the IMF have been complex because Sri Lanka was now a bankrupt state.\nIn April, Sri Lanka announced it is suspending repaying foreign loans due to a foreign currency shortage."
  },
  {
    "headline": "Sri Lanka Protesters Storm President’s House, Demand Resignation",
    "summarized_story": "Sri Lankan protesters demanding that President Gotabaya Rajapaksa resign forced their way into his official residence on Saturday, a local television report said, as thousands of people took to the streets in the capital decrying the island nation’s worst economic crisis in recent memory.\nIt was not clear if Rajapaksa was inside the residence in Colombo but footage shot on mobile phones showed a large number of people inside the well-fortified house and on the grounds outside.\nPolice had earlier fired tear gas at protesters who surrounded the official residence as they moved toward the main gates.\nThe protesters eventually broke the barricades and entered the house.\nProtesters blame Rajapaksa for the economic woes and have occupied the entrance to his office for three months."
  },
  {
    "headline": "Dr Campbell: Naomi Earns Honorary Doctorate for Work in Fashion",
    "summarized_story": "Naomi Campbell is now Dr. Campbell after receiving an honorary Ph.D. for her contributions to the fashion industry.\nNaomi Campbell just added an honorary Ph.D. from the University for the Creative Arts in England to her list of groundbreaking life achievements.\nThe degree is the perfect fit for Campbell’s ongoing legacy in the fashion world.\nDuring an interview with Reuters that year, she expressed hope that “change” was, at last, coming as brands made promises to better recognize and value Black lives.\nThis included hiring more Black talent “as designers, stylists and make-up artists,” as well as in editorial and executive roles."
  },
  {
    "headline": "Canada Hit By Massive Mobile and Internet Outage",
    "summarized_story": "Canada’s largest mobile and internet provider has suffered a major outage, with bank ATMs and emergency service hotlines affected.\nInternet traffic had dropped to around 75% of its normal level by Friday morning, according to NetBlocks, an internet watchdog organisation.\nRogers is the mobile carrier of nearly 11 million Canadians, with a stake in everything from hockey to cable television.\nToronto’s police department tweeted that some mobile phone users were having trouble calling the emergency services, despite it remaining “fully operational”.\nOn Friday afternoon, the vice-president of Rogers told CBC that the company was still working to identify the “root cause” of the issue."
  }
]