[
  {
    "headline": "Doctors canvass innovative ways to solve Africa’s health challenges",
    "summarized_story": "Two medical entrepreneurs, Dr Yetunde Ayo-Oyalowo and Dr Funmi Adewara, have called for innovative strategies to combat the problem of universal access to health care in Africa.\nBoth doctors, who are female inventors of accessible healthcare services, also emphasised the need for solutions that were affordable, easy-to-reach, sustainable and efficient to solve the challenges in the healthcare sector.\n“I felt ordinary people do not have access to health care.\nI once worked in a health insurance company and I discovered that even with the reduced price only a little percentage of people could afford health insurance and health insurance is a sort of gateway to good health care.\nSo, I thought what happens to the man on the street, how will they be able to access health care?"
  },
  {
    "headline": "Killings: Perpetrators must be swiftly punished, says Lalong",
    "summarized_story": "Governor Simon Lalong of Plateau State, on Saturday, expressed worry over the incessant attacks and killings by gunmen in different parts of the state.\nWithin the past two weeks, findings by Sunday PUNCH showed that about 30 people had been killed in different attacks by gunmen, who also destroyed properties.\nThe latest incident was on Thursday when gunmen killed more than six people in Jos South and Riyom local government areas of the state.\nThe governor, therefore, ordered the security agencies to do everything possible to arrest persons disrupting the peace of the state.\nOur expectation is that these attacks will not only be prevented, but whenever any is recorded, the perpetrators will be swiftly arrested and brought to justice.’’ ,,Copyright PUNCH."
  },
  {
    "headline": "Twitter ban not a good idea",
    "summarized_story": "UK based entrepreneur and CEO of Oil Money Records, Alafaa Kariboye Igbo who graduated from London University has condemned the decision.\nThree days after the twitter ban in Nigeria, the A4AI (Alliance for Affordable Internet) put Nigeria’s economic loss at $1.2b.\nOn why he started Oil Money Records, the Rivers State indigene said:” The name Oil Money was divinely inspired.\nSpeaking further, the philanthropist also urged young Nigerians to always stay focused and not to give up on their dreams.\nAsked if he has passion for politics, Oil Money Boss simply said: “I don’t see myself venturing into that terrain for now”."
  },
  {
    "headline": "Exceptional with Sam: Global leaders share their stories",
    "summarized_story": "Exceptional with Sam is a live show streamed on Instagram and YouTube where viewers get a feel of their industry idols and icons.\nFounder of Olusola Lanre Coaching Academy, Lanre Olusola, shared his stories and experiences as a guest on the show recently.\nWe want to empower as much people as possible with zero to hero stories from industry leaders across the globe.\n“Even though these men and women are exceptional in their achievements and successes, they are also humans and that is what people want to relate with.\nThey want to know that they can also achieve exceptional results no matter where they start from”."
  },
  {
    "headline": "Sadiq Abdullahi presents agenda for Sports development",
    "summarized_story": "By Jacob AjomA former Nigeria tennis star, Sadiq Abdullahi has been ruminating on the problems hindering the development of tennis and sports generally in the country and has put forward suggestions he believes if well implemented could move sports in the country forward.\nIn a ten-point write-up he titled ‘My thoughts on tennis and sports in Nigeria’, Abdullahi who is an adjunct professor of global education and curriculum development and improvement at Florida International University in Miami, Florida, USA, observed that the recently concluded Nigerian Olympian Association AGM in Abuja was an eye-opener as it had exposed to him some of the challenges militating against sports development in the country.\nHe, however, insisted that the challenges were surmountable and “the time to act is now”.\nIf we cannot, we must at least control the effect.”Most importantly, the former Olympian said, “We must shift emphasis from competitions to grassroots sports development.” He also called for a comprehensive 15 to 20 years tennis development plan.\nVanguard News Nigeria"
  },
  {
    "headline": "Anambra Guber: Ifeoma Maduka emerges Action Alliance candidate",
    "summarized_story": "A lawyer, Barr Doreen Ifeoma Maduka-Arisa has emerged as the governorship candidate of the Action Alliance in Anambra State.\nThe party’s primary election held in Akwa under the supervision of the National Chairman of the party, Hon Adekunle Rufai Omoaje was supervised by the Independent National Electoral Commission (INEC).\nMeanwhile, speculations are rife that the PDP governorship aspirant, Dr Madukwa may work for the AA in the next governorship election in Anambra State.\nThis, it was learnt was because of the emergence of his younger sister as the gubernatorial candidate of the AA.\nUnconfirmed sources said the elder Madukwa may also pitch his tent with the AA and openly campaign for the party."
  },
  {
    "headline": "FG to arm Federal Fire Service, set to create ‘Fire Police’",
    "summarized_story": "Minister of Interior, Ogbeni Rauf Aregbesola and Chairman of Council disclosed this in Jos, Plateau state during the opening of the National Council on Fire.\nAlso Read: #YorubaNation Rally: Investigate killing of 14-year-old girl — Igbo group tells Lagos govtAccording to him, fire safety management, an imperative for national security can and should become a tool for not only national security but also national development.\nThe Minister assured that the Ministry under his watch would continue to find innovative ways and means to empower the Service to provide timely and quality service of world-class standard to the generality of the citizens and foreigners alike.\nFederal Fire Service, he noted, has enjoyed and will continue to enjoy the tremendous support of President Muhamadu Buhari.\n“I am confident that as this government progresses in office, the Federal Fire Service would be sufficiently repositioned to deliver timely and quality service to the nation,” he reiterated."
  },
  {
    "headline": "Many injured as explosion rocks Kaduna",
    "summarized_story": "No fewer than three children in Badarawa community, Kaduna North Local Government Area have sustained varying degrees of injurie following an explosion in the area.\nWhen contacted by DAILY POST, the state’s Police Public Relations Officer, PPRO, ASP Mohammed Jalige confirmed the incident.\nThe PPRO told our correspondent that he is currently in the hospital where the victims are receiving treatment, saying the command had deployed personnel to the area to ascertain the “cause of the unfortunate explosion”.\n“I am currently in the hospital to see the victims of the explosion.\nThe command has also deployed personnel and some experts to the area to know the actual cause of the unfortunate incident."
  },
  {
    "headline": "Army chief rejigs Generals, names principal staff officers, field commanders",
    "summarized_story": "The Chief of Army Staff (COAS) Major General Faruk Yahaya has appointed of Principal Staff Officers (PSOs), Field Commanders and other key staff.\nThe Commandant Nigerian Army Armoured School, Maj Gen BO Sawyer is the new Director Defence Information, while the Chief of Operations Army, Maj Gen IM Yusuf becomes the Commandant Nigerian Defence Academy.\nMaj Gen MA Yekini is the new Chief of Defence Training and Operations; Maj Gen MS Yusuf will take over as Chief of Defence Standard and Evaluation.\nMaj Gen SO Olabanji becomes the Commander Training and Doctrine Command, Maj Gen OA Akintade is the new Chief of Army Logistics.\nMaj Gen OT Akinjobi takes over as Chief of Operations (Army), Maj Gen JA Ataguba becomes the Chief of Army Standard and Evaluation."
  },
  {
    "headline": "Nigerians reacts as bandits abduct 13 women along Kaduna-Birnin Gwari highway",
    "summarized_story": "A cross section of Nigerians has reacted to the kidnap of 13 women by bandits suspected to be kidnappers.\nDAILY POST reported earlier that the women were kidnapped along Kaduna Birnin Gwari road.\nAccording to them, security agencies rather than safeguard lives of Nigerians are hunting activists and the likes of Sunday Igboho.\nHere are some comments gathered by DAILY POST from Twitter;@Olamide “Where are the DSS to arrest the bandits?\nThey won’t rescue these set of victims and display for praises, It’s Nnamdi Kanu and Sunday own they sabi.Naija na cruise.”@Collins65 “ It is a welcome development."
  },
  {
    "headline": "Ogun: Oro worshippers impose daytime curfew on Gov Abiodun’s hometown",
    "summarized_story": "Oro worshippers in Iperu, Ikenne Local Government Area of Ogun State on Saturday prevented female residents from coming out for their daily activities.\nOur correspondent learnt that the Oro cultists had earlier announced that the annual Oro festival in Iperu would run from July 2 to July 10.\nIt was also said that there would be 24-hour curfew in Iperu on July 3, resisting women from coming out.\nThe court ruled that Oro festival rituals should only be done at night.\nDuring the period of the curfew, religious activities are usually forbidden; a situation that has led to crisis between Oro worshippers and Muslims/Christians in some communities."
  },
  {
    "headline": "Gov Umahi suspends Ebonyi’s Auditor-General, appoints replacement",
    "summarized_story": "Governor David Umahi of Ebonyi State has directed the state’s Auditor-General, Mr Samuel Uduma, to proceed on indefinite suspension due to poor performance.\nUgbala, in the statement, said that the suspension took effect from July 1, as Mr Emmanuel Arua had been appointed the state’s Acting Auditor-General.\n“A four-man committee has been set up to reposition the state Auditor-General’s office and audit all accounts and manpower of the government.\nIt listed members of the committee to include Mr Emmanuel Arua (Chairman), Mr Joseph Igwe, Mrs Blessing Abia and Mrs Chinyere Chukwu as members.\n“All concerned are thereby directed to strictly comply with this directive,” the statement said."
  },
  {
    "headline": "El-Rufai: I’m not interested in 2023 presidency",
    "summarized_story": "By AbdulGafar Alabelewe, KadunaKaduna State governor, Nasir Ahmad El-Rufai, has said on Saturday that he does not have any presidential ambition, contrary to widespread speculations in that regard.\nEl-Rufai, who claimed to have “suffered presidential ambition suspicion for 15 years”, said at 62, he is too old lead Nigeria.\nHe said that governing Kaduna State alone was telling on his age, not to talk of the entire country.\n“This is a very difficult job, and that is just state governor, one state out of 36.\nThe two children are currently taught at home but go to the public school during the examination period."
  },
  {
    "headline": "Igboho, Kanu: Who is naive now?",
    "summarized_story": "Mr Kanu was brought in from abroad; it needed months of preparation to carry out.\nThe interception of Mr Kanu is certain to have its consequences, domestically and internationally.\nImportantly too, because Mr Kanu holds a British passport, and is therefore a British citizen who is a victim of possibly a questionable extradition, the matter as to how Mr Kanu was intercepted is unlikely to die down any time soon.\nThe overall implication of the interception of Mr Kanu and the assault on Mr Igboho’s residence will be to worsen insecurity.\nNeither Mr Kanu nor Mr Igboho was as popular as when their campaigns began; their messages were already wilting and needed only time."
  },
  {
    "headline": "Now, in remembrance of things that have come",
    "summarized_story": "What follows are excerpts from a piece in 2014 commemorating the centenary of amalgamation of the Southern and Northern protectorates of Nigeria.\n“With the equipoise of contending regional titans and their perfectly weighed prejudices and preferences, it was impossible to unify and homogenize the emergent national elite.\nBut ignoring the political realities and contending cultural milieu, he chose to attack the problem frontally by attempting to bypass the northern feudal lords to reach the people directly.\nYet by virtue of the same cultural logic the mutiny by mid-ranking officers of mainly Igbo origins was so politically clueless, so motivated by bloodthirsty and irrational vengeance, that it became part of the national problem.\nBut unless we find the will and the willpower to create Nigeria anew, the fat lady will soon come on stage."
  },
  {
    "headline": "I don't want to be a poor actor, says Tana Adelana",
    "summarized_story": "By Adeniyi AdewoyinNollywood actress, Tana Adelana has said she doesn’t want to be a hardworking movie star who cannot afford her basic needs.\n“You know me, I’ve done cinema movies and I’ve done some home videos as well.\nFor me, I want to tell stories that will touch lives but I also want to make money.\nI don’t have the energy for that so I keep my fashion to myself.\nMy fashion is not out there, I just like it simple, I like it comfortable and I like to make a statement.”"
  },
  {
    "headline": "Taaooma and I have flourishing relationship despite business – Abula",
    "summarized_story": "By Sampson UnamkaAbula, a popular short filmmaker and Taaooma’s fiancee, has disclosed that being in the same line of business with his lover in some way has helped their relationship to flourish.\nAbula, who is also a music video director, made this known in an exclusive interview with The Nation recently.\nADVERTISEMENTWhen asked how he manages work and his relationship, he said: “Luckily for the both of us, we’re in the same line of business, entertainment.\nThe fact that we both know the sacrifices and constraints so well has helped us flourish in our relationship,” he said.\nHe owns The Greenade Company, a production, and talent management company, and has shot music videos for Nigerian music stars that include Olamide, 2baba, Falz, Adekunle Gold, and Simi among others."
  },
  {
    "headline": "Shake-Up as army appoints new GOCs, DDI, commanders, others",
    "summarized_story": "The appointments, which is with immediate effect according to the Director, Army Public Relations, Brigadier General Onyema Nwachukwu, is aimed at rejigging the service for efficiency in command and administration within the Nigerian army.\n‘The COAS approved the appointment of the Commandant Nigerian Army Armoured School, Maj Gen BO Sawyer as the new Director Defence Information while the Chief of Operations Army, Maj Gen IM Yusuf becomes the Commandant Nigerian Defence Academy.\nMaj Gen TA Gagariga will move from Army Headquarters Department of Policy and Plans to Nigerian Army Artillery Corps as Corps Commander Artillery and Maj Gen VO Ezugwu of Training and Doctrine Command becomes the Commander Infantry Corps.\nMaj Gen AB Ibrahim is appointed as Chief of Training (Army).\n‘The COAS equally approved the appointment of Commanders, Commandants of NA Institutions, Directors and other key appointments at both Defence and Army levels."
  },
  {
    "headline": "Stray bullets kill 14-year-old in Ojota",
    "summarized_story": "A yogurt seller, identified simply as Jumoke, has become the first and only casualty of the Yoruba Nation agitators rally in Lagos.\nShe was killed by stray bullets allegedly fired by a security operative dispersing Yoruba Nation agitators at Ojota, Lagos State.\nWitnesses told sunnewsonline.com at the scene of the rally that the bullets had ripped open the stomach of the 14 years old and she died immediately.\nConcerned persons at the scene covered her remains with a piece of cloth while sympathisers and passersby gathered at the spot.\nThe Sun had earlier reported that security agents chased away agitators for Yoruba nation who had converge on Ojota area of Lagos, for the Lagos mega rally."
  },
  {
    "headline": "HAPPENING NOW! Police swoop on Oduduwa Nation agitators",
    "summarized_story": "Security agents have chased away agitators for Yoruba nation who have converge on Ojota in Lagos, for the Lagos mega rally.\nWitnesses told sunnewsonline.com that the agitators comprised Yoruba women and men in white attires, were chased away by personnel of Nigeria Police.\nThe witness said security agents teargassed the agitator in an apparent move to disperse them.\nDetails soon…Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Yoruba Nation Lagos rally: Yoruba women lead men to Ojota",
    "summarized_story": "From Oluseye Ojo, IbadanThe stage is now set for the commencement of the Yoruba nation mega rally scheduled to hold in Ojota, Lagos, today.\nThe heavy presence of security agencies has not deterred members of the self-determination groups from proceeding with the rally as planned.\nThe latest information from Ilana Omo Oodua (IOO) is that Yoruba women, who are already dressed in white special attires, would be on the front rows, and they would be followed from behind by Yoruba men.\nA source at the venue said: “Our Yoruba women are now leading our men to the Ojota, Lagos venue of the Yoruba Nation Rally.\nNo retreat, no surrender.”Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Cattle grazing routes: The real story",
    "summarized_story": "There were cattle routes and grazing areas.\nIt was not the first time that the grey issue of cattle grazing routes would seize the momentum in the country, or generate a national furore.\nAccording to the Grazing Reserves Law of 1965, Nigeria has 415 grazing reserves but only about one third of it is functional.\nHe adds that grazing reserves recognized as a state law in the 1999 constitution criminalized open grazing.\nCattle routes reopening in top gearFollowing President Buhari’s directive to reopen the grazing routes, a rash of activities has seized the Ministry of Agriculture and Rural Development and the Ministry of Justice."
  },
  {
    "headline": "Shettima Calls for Power Shift to South, Insists on Rotation",
    "summarized_story": "•Maintians there was a gentleman agreement on rotation in APCMichael Olugbode in AbujaFormer Borno State Governor, Senator Kashim Shettima has thrown his weight behind the call for power shift to Southern Nigeria in 2023.\nShettima, who is now a Senator representing Borno Central, made the call for a power shift in Abuja yesterday at the public presentation of a book titled: “Standing for the Truth with Courage”.\nHe stressed: “After power has resided in the North for eight years, the minimum is that there should be a power shift to the South for equity and justice.\n“There’s a gentleman agreement in the APC at its formative stage for power to rotate between the North and the South.\n“The minimum is for a power shift to Southern Nigeria, unless the advocates of power retention have a hidden agenda for the dismemberment of the nation."
  },
  {
    "headline": "Masari: Nigeria Battling with Worst Form of Insecurity",
    "summarized_story": "Francis Sardauna in KatsinaThe Katsina State Governor, Aminu Bello Masari, yesterday lamented the spate of banditry and other nefarious activities afflicting the country, saying the nation is battling with the worst form of insecurity.\nMasari, who spoke in Katsina, during the commissioning and handing over of Kafur Islamic Centre, urged the warring parties to sheathe their swords and work together to avert bloodletting bedeviling the country and for peace and development to thrive.\nHe said: “We are battling with the worse form of insecurity, what brought it?\n; People who were living peacefully before as neighbours and friends, attending the same market, weddings funerals, and naming ceremonies without any conflict.\n“But today, they are killing themselves, stealing their properties, and raping their wives and children."
  },
  {
    "headline": "Again, Southern Govs Meet, Open Grazing, Restructuring to Top Agenda",
    "summarized_story": "At the last meeting, hosted by Governor Ifeanyi Okowa of Delta State and attended by 15 of the 17 southern governors, they arrived at a 12-point resolution, which included the banning of open grazing in all the states.\nThe source said: “The governors are working towards a better Southern Nigeria within the Nigerian nation.\nThe southern governors will be looking at the gains of the last meeting and come up with their next move.\n“You know the southern governors agreed that the progress of the nation requires that urgent and bold steps be taken towards the restructuring of the Nigerian federation leading to the devolution of power.\nDuring the first meeting in Asaba, the southern governors resolved to ban all forms of open grazing in the southern states of the country."
  },
  {
    "headline": "British Govt Evades THISDAY Enquiry on Fresh Passport Issued to Kanu",
    "summarized_story": "THISDAY, in a series of email exchanges with the British High Commission in Abuja, had requested clarifications on how the IPOB leader obtained fresh British passport.\nAre you saying the British government did not assist Mr. Nnamdi Kanu in procuring a new British passport?\nHow could Kanu have acquired another British travel document in Nigeria without processing it at your High Commission?”Jonathan Bacon of the British High Commission replied saying the question refers explicitly to British High Commission and that his response earlier directly addressed this allegation: “We can confirm that the British High Commission in Nigeria did not issue any travel documents for Mr Kanu.\nInstead of facing the Kenyan High Commission in Nigeria to ask some of these questions, you should face your government.\nInstead of facing the Kenyan High Commission in Nigeria to ask some of these questions, you should face your government."
  },
  {
    "headline": "Marafa: Matawalle’s Defection Violates 2019 S’Court Judgement",
    "summarized_story": "Justifying his opposition to Matawalle’s defection, Marafa stated: “The judgment made by the Supreme Court said APC ought not to have participated in the 2019 election.\nNow, I’m asking this question and I want every Nigerian to tell me: Can a man that is non-existent give birth to children?\n“So, any attempt by anybody to say he is the governor of APC, between 2019 and 2023 without reason of death or resignation that could have warranted issues of bye-election, cannot work.\nDoing so is acting against the judgment of the Supreme Court.\nMai Mala Buni, Chairman of its Caretaker Committee doesn’t have the power under the constitution to make such pronouncements,” he said."
  },
  {
    "headline": "Yoruba Nation Rally: 14-year-old Girl Killed By Stray Bullet In Lagos",
    "summarized_story": "A 14-year-old girl, identified simply as Jumoke, has been killed by bullets fired by security operatives trying to disperse Yoruba Nation agitators at Ojota, Lagos State, on Saturday.\nThe young lady, who was said to be a yoghurt seller, was hit by the bullet in her stomach while running to safety.\nAccording to an older lady, Jumoke was displaying drinks at her shop when the gunshots were heard and while running, she was hit by the bullet.\nShe said, \"We were running together, and we got to that spot; that was how the stray bullet hit her.\nThe victim's body has been covered with a piece of cloth as a crowd gathered at the spot."
  },
  {
    "headline": "Yoruba Nation Rally: 14-year-old Girl Killed By Stray Bullet In Lagos",
    "summarized_story": "A 14-year-old girl, identified simply as Jumoke, has been killed by bullets fired by security operatives trying to disperse Yoruba Nation agitators at Ojota, Lagos State, on Saturday.\nThe young lady, who was said to be a yoghurt seller, was hit by the bullet in her stomach while running to safety.\nAccording to an older lady, Jumoke was displaying drinks at her shop when the gunshots were heard and while running, she was hit by the bullet.\nShe said, \"We were running together, and we got to that spot; that was how the stray bullet hit her.\nThe victim's body has been covered with a piece of cloth as a crowd gathered at the spot."
  },
  {
    "headline": "Police Attack Peaceful Yoruba Nation Agitators In Lagos",
    "summarized_story": "Police officers on Saturday dispersed Yoruba nation rally agitators with hot water from a water cannon.\nSome of the agitators, who stormed the Gani Fawehinmi Freedom Park, Ojota, the venue for the Yoruba rally, sang the Yoruba Nation anthem displaying banners, posters and placards containing their demands.\nParticipants at the rally had arrived at the venue unannounced while the Lagos Commissioner of Police, Hakeem Odumosu, addressed journalists.\nThe police suddenly showered hot water on the agitators causing the agitators to leave the venue.\nSome of the agitators were seen getting dragged into an armoured tank by policemen."
  },
  {
    "headline": "Police Attack Peaceful Yoruba Nation Agitators In Lagos",
    "summarized_story": "Police officers on Saturday dispersed Yoruba nation rally agitators with hot water from a water cannon.\nSome of the agitators, who stormed the Gani Fawehinmi Freedom Park, Ojota, the venue for the Yoruba rally, sang the Yoruba Nation anthem displaying banners, posters and placards containing their demands.\nParticipants at the rally had arrived at the venue unannounced while the Lagos Commissioner of Police, Hakeem Odumosu, addressed journalists.\nThe police suddenly showered hot water on the agitators causing the agitators to leave the venue.\nSome of the agitators were seen getting dragged into an armoured tank by policemen."
  },
  {
    "headline": "Again, Police Attack Shiites Protesting Zakzaky's Detention In Kaduna",
    "summarized_story": "Men of the Kaduna State Police Command have reportedly fired gunshots to disperse members of the Islamic Movement in Nigeria who gathered at the Central Market to protest the continued detention of their leader, Sheikh Ibrahim Zakzaky.\nIt was gathered that the police got wind of the protest and deployed officers to the Sheikh Gumi axis of the Kaduna Central Market to stop the protesters, Daily Trust reports.\nAs soon as the Shiites sighted the police, who had cordoned the area with their vehicles, they immediately aborted protesting in the area.\nGiving an eye-witness account, Halima Ibrahim, said she had just arrived at the market when she heard shots being fired.\nI was told that police officers came to the market to pick some IMN group members and fired some shots to scare them."
  },
  {
    "headline": "Rep: Why lawmakers increased frontier basin exploration fund to 30%",
    "summarized_story": "Uju Kingsley Chima, a lawmaker representing Ohaji-Egbema/Oguta/Oru West federal constituency, says the 30 percent allocation for oil exploration will benefit all Nigerians.\nControversies emerged over 30 percent allocation to the frontier basins exploration fund from the proposed 10 percent by the two chambers.\nSpeaking on the frontier basin controversy, Chima said lawmakers consulted experts and the executive before taking the final decision.\nThe frontier basin is not an exclusive reserve of a part of a country.\nHe said the fund would be sent directly to the host communities and not through proxy."
  },
  {
    "headline": "Rep: Why lawmakers increased frontier basin exploration fund to 30%",
    "summarized_story": "Uju Kingsley Chima, a lawmaker representing Ohaji-Egbema/Oguta/Oru West federal constituency, says the 30 percent allocation for oil exploration will benefit all Nigerians.\nControversies emerged over 30 percent allocation to the frontier basins exploration fund from the proposed 10 percent by the two chambers.\nSpeaking on the frontier basin controversy, Chima said lawmakers consulted experts and the executive before taking the final decision.\nThe frontier basin is not an exclusive reserve of a part of a country.\nHe said the fund would be sent directly to the host communities and not through proxy."
  },
  {
    "headline": "Gbaja: Constitution review will address foundational deficiencies that hinder Nigeria's prosperity",
    "summarized_story": "Femi Gbajabiamila, speaker of the house of representatives, says the ongoing constitution review will correct the “deficiencies” that hinder peace and prosperity in the country.\nAdvertisementSpeaking at the Conference of Presiding Officers of Nigerian Legislatures (COPON) in Abuja, Gbajabiamila said the constitution review process won’t succeed “without strategic collaboration” between all the state houses of assemblyAccording to him, the review process will offer the opportunity to “address the foundational deficiencies in our constitution that continue to mitigate against the attainment of an honourable, peace and universal prosperity in our country”.\n“That process of constitutional review cannot succeed without strategic collaboration between all of us who are here today,” he said.\nSome might say I am biased, having spent most of my political career in the legislature.\nWhat I find solace in is the fact that this misconception and misunderstanding of the role of the legislature is a worldwide phenomenon."
  },
  {
    "headline": "Gbaja: Constitution review will address foundational deficiencies that hinder Nigeria's prosperity",
    "summarized_story": "Femi Gbajabiamila, speaker of the house of representatives, says the ongoing constitution review will correct the “deficiencies” that hinder peace and prosperity in the country.\nAdvertisementSpeaking at the Conference of Presiding Officers of Nigerian Legislatures (COPON) in Abuja, Gbajabiamila said the constitution review process won’t succeed “without strategic collaboration” between all the state houses of assemblyAccording to him, the review process will offer the opportunity to “address the foundational deficiencies in our constitution that continue to mitigate against the attainment of an honourable, peace and universal prosperity in our country”.\n“That process of constitutional review cannot succeed without strategic collaboration between all of us who are here today,” he said.\nSome might say I am biased, having spent most of my political career in the legislature.\nWhat I find solace in is the fact that this misconception and misunderstanding of the role of the legislature is a worldwide phenomenon."
  },
  {
    "headline": "'Scores killed' as insurgents in army uniform clash with troops in Borno",
    "summarized_story": "An unconfirmed number of members of the Islamic State in West Africa Province (ISWAP) have been reportedly killed, following a joint military operation along Maiduguri-Damaturu highway in Borno state.\nThe insurgents reportedly seized one vehicle belonging to the officers.\nHowever, a coordinated response by the air task force command, troops of 212, 73 battalion from sector 1, troops from 134 task force and 199 battalion, were said to have gone in pursuit of the insurgents.\nThe operation reportedly led to the “killing of scores of the terrorists on two gun trucks”.\n“The recovered vehicle was taken to the Borno police command.”"
  },
  {
    "headline": "TeamApt closes undisclosed Series B round to extend its banking services across Africa",
    "summarized_story": "Nigeria-based TeamApt, which offers agent banking services with plans to roll out consumer-focused digital banking features, has raised an undisclosed sum in a Series B round.\nTeamApt’s pivotal business at the moment is Moniepoint, a software solution that powers agent banking in Nigeria.\nBut the agent banking space is thought to include Firstmonie, Paga and OPay, the Opera-backed fintech.\nIn March 2021, TeamApt said it processed over ₦1trillion ($2.4 bn) for the first time.\nWhile Moniepoint will continue to power agent banking, TeamApt plans to build a consumer app side of it for individuals as a digital bank."
  },
  {
    "headline": "Fair Money raises $42 million as it evolves into a digital bank",
    "summarized_story": "It was led by Tiger Global Management with existing investors like DST Partners, Flourish Ventures, Newfund, and Speedinvest participating.\nThe investment comes after FairMoney raised $11 million Series A two years ago and $16 million in total within its first four years.\nFor Tiger Global which led the round, this is its fourth investment in an African startup after iRoko (2013), Takealot (2014) and Flutterwave (2021).\nFrom having a little over 100,000 users in its first year of operation, FairMoney has grown to have 1.3 million unique users who have made more than 6.5 million loan applications.\nFairMoney is not alone in its ambitions to dominate the Neobank scene in Nigeria, Kuda in March raised $25 million."
  },
  {
    "headline": "Faith Keza is leading Irembo to fully digitise Rwanda",
    "summarized_story": "And steering the Irembo ship is Faith Keza.\nFaith is also on the board of the Rwanda National Bank and the Rwanda Development Board.\nSo no, I don’t have great memories.”After a semester at MIT, Faith realized her maths major wasn’t for her.\nBut a lot of plans were stalled and so Faith decided to return on her own to Rwanda and while there, she joined Irembo as CTO.\nWith Faith Keza, Irembo could be at the front of that movement."
  },
  {
    "headline": "Inside Branch’s ambitious '20% investment' challenge to Nigerian banks",
    "summarized_story": "Four years, ₦40 billion (~$97 million) and three million loans later, the business is evolving.\nIt was the first question Dayo Ademola, Branch Nigeria’s managing director, faced on CNBC in May.\nBoth numbers would give a clearer picture of the returns on their three million loans.\nGoing by its profitability and investor capital, it would appear both metrics are in good health.\nIt will then be intriguing to see customer reaction to the newly launched investment offer."
  },
  {
    "headline": "Bingeing on forbidden taxes",
    "summarized_story": "In many cases, Sharia states got more revenue than non-Sharia states where alcohol was actually sold and consumed.\nThe Sharia states have for 22 years since they adopted that law, been bingeing heavily on alcohol taxes, even when the intoxicating substance is banned from being sold in their domains.\nBut, is it possible for Sharia states to indicate they do not want alcohol and other forbidden taxes included in what is shared with them monthly?\nYusuf, at the Al-Qalam University, reiterated that to the extent it is national allocation, Sharia states could accept alcohol taxes.\nreject alcohol taxes), and an Islamic state should actually do that."
  },
  {
    "headline": "Microblogging and the Nigerian State: Matters Arising",
    "summarized_story": "While governments have been accused of muzzling free speech, social media entrepreneurs commit the same offence with less or no public outrage.\nHowever, Nigerians generally believed that the government responded to Twitter’s decision to delete a tweet by the Nigerian President where he was alleged to have threatened violence against a section of the country.\nThe presumption that social media is a socially and politically neutral platform for societal conversation is false.\nIt is this inherent capacity of social media enterprises to sway collective opinion and subtly affect people’s decisions that make social media institutions as dangerous as they are liberating.\nHowever, governments cannot use this as an excuse to plug the mouths and stop the keyboards of subscribers to social media."
  },
  {
    "headline": "Oil region experts, leaders welcome PIB with cautious optimism",
    "summarized_story": "A source said: “Crude is almost gone, oil companies at global level are transforming to energy companies, fossil oil is gone, gas has about a decade to flourish.\nOr do the gas installations in associated oil wells sufficient to define host communities in the PIB?\nWhy are host communities given three per cent and not a minimum of 15 percent?\nIf the desire for stakeholders in the oil industry is to develop the oil and gas host communities, then the host communities must be given the preference and nurtured into full participation in the value generation and resource management in the oil and gas industry.\nThis is the time for collaborative relationship between host communities and oil companies."
  },
  {
    "headline": "Edo govt moves to cut waste, digitizes treasury receipts, tax clearance certificates, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestTo deepen the ongoing institutional reforms and digital transformation in Edo State, the Edo State Internal Revenue Service (EIRS) has deployed digitized Treasury Receipts, Motor Vehicle Registration Documentation, Tax Clearance Certificates (TCC), Approval Certificates and Business Permits across all Ministries, Departments and Agencies (MDAs).\nThe Executive Chairman of the Edo State Internal Revenue Service (EIRS), Mr. Igbinidu Inneh, disclosed this when he hosted his counterpart from Niger State who was in Benin City on a knowledge sharing and peer learning visit.\nInneh said with the introduction of the e-Treasury Receipts, all MDAs can now deliver receipts directly to people transacting with government from anywhere in the world via e-mail at the click of the button.\n“It provides assurance to the public and enables government to better organise and regulate construction and operation of businesses in the state.\nThe EIRS has deployed various electronic payment channels including onsite banking and offsite banking channels like web payment, PoS, Revenue Scratch Cards and USSD."
  },
  {
    "headline": "Edo Queens unveils Wemimo Matthew as new Head Coach – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe management of Edo Queens Football Club, on Friday, unveiled Wemimo Matthew as the new Head Coach of the female team, with a charge to return the club to its glory days.\nAccording to him, “what we have done with Edo Queens was to make it a model for the girl-child to look up to.\n“So, we decided to unveil a new head coach because of our performance in the just concluded Super 6.\n“Coach Wemimo Matthew is well-educated, with very high discipline, which we are already seeing in the team since her arrival.\nIn her remarks, the newly unveiled coach, Wemimo Matthew, thanked the Edo State Government for finding her worthy of the appointment, adding that she was going to make the state proud."
  },
  {
    "headline": "Obaseki urges improved collaboration to strengthen Edo healthcare system for quality service delivery – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for increased collaboration between the government and all stakeholders in the health sector to redesign and strengthen the state’s healthcare system for quality service delivery to the people.\nObaseki, during a stakeholders’ workshop, at the Government House, Benin City, reassured that his government will sustain reforms in the healthcare system to reposition the state as Nigeria’s medical hub.\nAccording to him, “the current healthcare system that we are operating was put in place about 50 years ago by the then Governor of Bendel State, late Dr. Samuel Ogbemudia.\n“We must redesign our healthcare system.\n“Let us all agree that at the end of today’s workshop, we are all going to move our healthcare system forward."
  },
  {
    "headline": "64th birthday: Obaseki appreciates, lauds Nigerians, Edo people for gifts sent to children with special needs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has expressed appreciation to the people of Edo State and Nigerians for birthday felicitations and heeding his appeal for donations to the less-privileged and children with special needs.\nThe governor had, in a statement by his Chief of Staff, Hon.\nIyoha Osaigbovo, said he preferred to mark his 64th birthday in a solemn and reflective mood, urging for donations to orphanages for children with special needs in Benin city, the Edo State capital.\nThe governor expressed appreciation to all those who sent him messages of good wishes, noting that he was overwhelmed with the show of love.\n“I thank Nigerians and particularly the people of Edo State for the felicitations and donations which were given to orphanages particularly to children with special needs,” he noted."
  },
  {
    "headline": "Constitution Review: Gbajabiamila seeks collaboration between NASS, state assemblies",
    "summarized_story": "The Speaker of the House of Representatives, Femi Gbajabiamila, has called for collaboration between the National Assembly and the 36 state Houses of Assembly on the ongoing constitution review.\nHe said the collaboration was necessary to make the review of the 1999 Constitution successful.\nMr Gbajabiamila, who spoke at a meeting of the Conference of Presiding Officers of Nigerian Legislatures (COPON) in Abuja on Saturday, harped on the need for collaboration.\nMr Gbajabiamila also stated that the legislature remained the most important arm of government in any democratic setting.\n“That process of constitutional review cannot succeed without strategic collaboration between all of us who are here today."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Major Shake-up In Army As New PSOs, GOCs, Others Emerge",
    "summarized_story": "The Chief of Army Staff (COAS), Major General Faruk Yahaya, has approved the appointment of Principal Staff Officers (PSOs), Field Commanders and other key staff in major shake-up in the Nigerian Army (NA).\nThe director, Army Public Relations, Brig Gen Onyema Nwachukwu, said the development will provide the much-needed vigour in General Yahaya’s command of the Nigerian Army.\nADVERTISEMENTEqually, Maj Gen SO Olabanji becomes the Commander, Training and Doctrine Command; Maj Gen OA Akintade is the new Chief of Army Logistics; Maj Gen OT Akinjobi takes over as Chief of Operations (Army), and Maj Gen JA Ataguba becomes the Chief of Army Standard and Evaluation.\nAlso, Maj Gen KI Mukhtar and Maj Gen C. Ofoche are the new Chief of Administration and Chief of Transformation and Innovation respectively.\nMeanwhile Maj Gen AB Ibrahim is appointed as Chief of Training (Army)."
  },
  {
    "headline": "Major Shake-up In Army As New PSOs, GOCs, Others Emerge",
    "summarized_story": "The Chief of Army Staff (COAS), Major General Faruk Yahaya, has approved the appointment of Principal Staff Officers (PSOs), Field Commanders and other key staff in major shake-up in the Nigerian Army (NA).\nThe director, Army Public Relations, Brig Gen Onyema Nwachukwu, said the development will provide the much-needed vigour in General Yahaya’s command of the Nigerian Army.\nADVERTISEMENTEqually, Maj Gen SO Olabanji becomes the Commander, Training and Doctrine Command; Maj Gen OA Akintade is the new Chief of Army Logistics; Maj Gen OT Akinjobi takes over as Chief of Operations (Army), and Maj Gen JA Ataguba becomes the Chief of Army Standard and Evaluation.\nAlso, Maj Gen KI Mukhtar and Maj Gen C. Ofoche are the new Chief of Administration and Chief of Transformation and Innovation respectively.\nMeanwhile Maj Gen AB Ibrahim is appointed as Chief of Training (Army)."
  },
  {
    "headline": "Policeman Dies As Troops Kill 28 Terrorists On Damaturu-Maiduguri Road",
    "summarized_story": "The Nigerian troops of Operation Hadin Kai have destroyed three gun trucks and eliminated 28 ISWAP-Boko Haram terrorists along Damaturu-Maiduguri highway in the late hours of Friday.\nAccording to the source, the terrorist had killed one policeman and seized a police vehicle when a distress call was sent to the Nigerian military for a swift response.\nThe top intelligence officer said air component and ground troops were promptly mobilised to execute the operation.\nThe source said: “After receiving a distress call on the incident, a NAF MI-35M helicopter was dispatched to the location and engaged the terrorists.\nOther fleeing terrorists were also cornered and eliminated by ground troops of the Nigerian Army."
  },
  {
    "headline": "Policeman Dies As Troops Kill 28 Terrorists On Damaturu-Maiduguri Road",
    "summarized_story": "The Nigerian troops of Operation Hadin Kai have destroyed three gun trucks and eliminated 28 ISWAP-Boko Haram terrorists along Damaturu-Maiduguri highway in the late hours of Friday.\nAccording to the source, the terrorist had killed one policeman and seized a police vehicle when a distress call was sent to the Nigerian military for a swift response.\nThe top intelligence officer said air component and ground troops were promptly mobilised to execute the operation.\nThe source said: “After receiving a distress call on the incident, a NAF MI-35M helicopter was dispatched to the location and engaged the terrorists.\nOther fleeing terrorists were also cornered and eliminated by ground troops of the Nigerian Army."
  },
  {
    "headline": "Minister Denies Diverting Kwara APC Campaign Funds",
    "summarized_story": "Minister of Information and Culture, Alh Lai Mohammed, on Saturday, denied the alleged diversion of the 2019 election campaign funds for Kwara State All ProgressivesCongress (APC).\nMohammed broke his silence on the allegation of campaign funds diversion by a cabal, during the commissioning of a new secretariat of the Bashir Bolarinwa-led faction of the APC in the state.\nThe minister added that the last membership registration andrevalidation in the state was a charade, saying that no APC congress would take place in the state until all members are duly registered.\nAll other speakers at the event, Alh Bashir Bolarinwa, Prof Shuaib AbdulRaheem, a member of the House of Representatives, Hon.\nADVERTISEMENTThe Minister added: “I never diverted APC 2019 general elections campaign funds for my personal use as alleged by Kwara state Governor, AbdulRahman AbdulRazaq."
  },
  {
    "headline": "10 family members die after eating local meal in Zamfara",
    "summarized_story": "Ten members of the same family have died as a result of eating poisonous food in Jangeme village of Gusau Local Government Area in Zamfara State.\nA neighbour of the deceased family members, Malam Sama’ila Sani, informed The PUNCH that they were served with guinea corn food called ‘tuwon dawa’ in Hausa, which was allegedly cooked by one of the members of the family, Aisha Musa.\nAccording to Sani, immediately the family members ate the food, they developed stomach cramps and were rushed to a hospital in Gusau, where they later died.\n“Immediately after eating the food, all of them began to feel serious stomach discomfort and were later rushed to the hospital in Gusau; but, unfortunately, they all died,” Sani explained to our correspondent.\nConfirming the incident, the spokesperson of Yariman Bakura Specialist Hospital, Gusau, Auwal Usman Ruwan-Doruwa, said the victims died as a result of food poisoning."
  },
  {
    "headline": "10 family members die after eating local meal in Zamfara",
    "summarized_story": "Ten members of the same family have died as a result of eating poisonous food in Jangeme village of Gusau Local Government Area in Zamfara State.\nA neighbour of the deceased family members, Malam Sama’ila Sani, informed The PUNCH that they were served with guinea corn food called ‘tuwon dawa’ in Hausa, which was allegedly cooked by one of the members of the family, Aisha Musa.\nAccording to Sani, immediately the family members ate the food, they developed stomach cramps and were rushed to a hospital in Gusau, where they later died.\n“Immediately after eating the food, all of them began to feel serious stomach discomfort and were later rushed to the hospital in Gusau; but, unfortunately, they all died,” Sani explained to our correspondent.\nConfirming the incident, the spokesperson of Yariman Bakura Specialist Hospital, Gusau, Auwal Usman Ruwan-Doruwa, said the victims died as a result of food poisoning."
  },
  {
    "headline": "Normalcy in Lagos after Yoruba Nation rally",
    "summarized_story": "Following the tension that ensued at the Ojota venue of the Yoruba Nation rally, security operatives on Saturday afternoon restored normalcy to the area.\nThe Nation had previously reported there was tension at the surroundings of Gani Fawehinmi Park, Ojota when the Pro-Yoruba Nation agitators stormed the venue.\nThey also displayed placards like “Yoruba Nation Now”, “Oduduwa Nation now, No going back”.\nThe police action came shortly after the Lagos Commissioner of Police Hakeem Odumosu addressed journalists at the park saying the security operatives were there to ensure there was no “security breach” in the state.\nHe said the Yoruba nation letter about the protest received by the command was “open-ended.”“We are not saying you should not protests, we want you to send a detailed letter to the police stating the number and identities of the protesters."
  },
  {
    "headline": "Normalcy in Lagos after Yoruba Nation rally",
    "summarized_story": "Following the tension that ensued at the Ojota venue of the Yoruba Nation rally, security operatives on Saturday afternoon restored normalcy to the area.\nThe Nation had previously reported there was tension at the surroundings of Gani Fawehinmi Park, Ojota when the Pro-Yoruba Nation agitators stormed the venue.\nThey also displayed placards like “Yoruba Nation Now”, “Oduduwa Nation now, No going back”.\nThe police action came shortly after the Lagos Commissioner of Police Hakeem Odumosu addressed journalists at the park saying the security operatives were there to ensure there was no “security breach” in the state.\nHe said the Yoruba nation letter about the protest received by the command was “open-ended.”“We are not saying you should not protests, we want you to send a detailed letter to the police stating the number and identities of the protesters."
  },
  {
    "headline": "Donald Trump ranks bottom among U.S. presidents, Obama in Top 10 [Full List]",
    "summarized_story": "By AbankulaFormer U.S. President Donald Trump has emerged near the bottom of a list of past presidents ranked by effectiveness.\nTrump ranked number 41 in the list, sharing the same score (312) as President Franklin Pierce.\nOnly Andrew Johnson and James Buchanan ranked worst with scores of 230 and 227.\nTop of the top 10 is Abraham Lincoln, ironically the only President Trump respected as better than he was.\nAccording to a report by Fox News, The Historians Survey took input from 142 historians, professors, and observers of the presidency."
  },
  {
    "headline": "South African court sets date for Jacob Zuma’s jail appeal",
    "summarized_story": "Agency ReportsA South African court on Saturday agreed to hear ex-president Jacob Zuma’s challenge to a 15-month jail term for failing to attend a corruption hearing.\nThe constitutional court had on Tuesday given Zuma 15 months in jail for absconding in February from the inquiry led by Deputy Chief Justice Raymond Zondo.\nZuma had until the end of Sunday to hand himself in, but on Saturday the court agreed to hear his application, suspending the order.\nThe South African Broadcasting Corporation (​SABC) reported that the court will hear his application on July 12.\nZuma also faces a separate court case relating to a $2 billion arms deal in 1999 when he was deputy president."
  },
  {
    "headline": "Breaking: COAS Yahaya shakes up army’s top brass",
    "summarized_story": "By Sumaila Ogbaje/AbujaThe Chief of Army Staff (COAS), Maj.-Gen. Farouk Yahaya, has approved the appointment of Principal Staff Officers (PSOs), Field Commanders and other key staff officers.\nThe appointments, according to the Director Army Public Relations, Brig.-Gen. Onyema Nwachukwu, were meant to provide the needed vigour in the Nigerian Army (NA).\nNwachukwu in a statement released Saturday night said that the Chief of Operations (Army), Maj.-Gen. Ibrahim Yusuf, is now the Commandant, Nigerian Defence Academy (NDA).\nChief of Operations (Army) is now Maj.-Gen. OT Akinjobi, while Maj.-Gen. James Ataguba is the new Chief of Army Standard and Evaluation.\nMaj.-Gen. C Ofoche is the new Chief of Transformation and Innovation, with Maj.-Gen. AB Ibrahim appointed as Chief of Training (Army)."
  },
  {
    "headline": "Adamu Garba: Nigeria Cannot Break, It’s A Lie",
    "summarized_story": "Former presidential aspirant who is also a controversial social media personality, Adamu Garba has come out in a recent video of an interview that was uploaded by Roots TV to share his thoughts concerning the ongoing Oduduwa agitation by Sunday Igboho with reference to the Biafra agitation in the Southeast which is being spearheaded by the recently arrested IPOB leader, Nnamdi Kanu.\nAccording to Adamu’s statement, he disclosed that Sunday Igboho started attacking people from other regions who were living in the Southwest part of the country after he gave orders for every fulani herdsman residing in Yoruba land to be exterminated.\nAdamu however noted that it’s not bad to have an Oduduwa nation or the Biafra Republic but all of them must be under the sovereign rulership of Nigeria or else it wouldn’t work.\nHe went further to use South Sudan as an example while narrating how they fought for a separate nation but weren’t able to achieve it until China came to their aid.\nAdamu made it clear that some miscreants in the country wouldn’t have stood up to start attacking and insulting elder statesmen if the government had adopted the policy of cattle ranching, as he noted that there wouldn’t have been people like Sunday Igboho and Nnamdi Kanu inciting people to kill and chase out fulani herdsmen from their regions."
  },
  {
    "headline": "Igboho: South-West Govs In Emergency Meeting",
    "summarized_story": "L-R: Chairman, South West Governor’s Forum, Gov.\nSeyi Makinde, during the South West stakeholders’ security summit in Ibadan recently.\nAccording to Saturday PUNCH, the six governors of the South-West geopolitical zone met an emergency meeting on Friday evening to discuss current national challenges.\n“They are meeting but no one is sure if it is because of Igboho.\nIt was gathered that governors who took part in the meeting were Rotimi Akeredolu (Ondo), Babajide Sanwo-Olu (Lagos), Kayode Fayemi (Ekiti), Dapo Abiodun (Ogun), Gboyega Oyetola (Osun) and Seyi Makinde (Oyo)."
  },
  {
    "headline": "Sunday Igboho Is A Hero – Reno Omokri Says As Yoruba Nation Rally Holds In Lagos",
    "summarized_story": "Former presidential aide, Reno Omokri has expressed satisfaction at the Yoruba national rally currently taking place in Lagos State.\nAmid heavy security at the Gani Fawehinmi Freedom Park, Ojota, Lagos, where the protest was scheduled to commence, the Yoruba nation protesters defiled the operatives, storming the area for the mega rally as earlier planned.\nReacting, Reno in a post on his official Facebook page, said he was impressed with the rally which is holding despite intimidation from the security agencies.\nIndeed, I am impressed that Igboho’s rally still held, despite desperate attempts by the Buhari junta to stop it.\nHe has done no wrong by protecting his people from killer herdsmen because Article 51 of the United Nations charter gives him that right."
  },
  {
    "headline": "El-rufai: I Withdrew My Son From Public School Because Of Kidnappers",
    "summarized_story": "After robbers attempted to kidnap his seven-year-old son, Abubakar Al-Sadiq El-Rufai, twice, Kaduna State Governor Nasir El-Rufai pulled him from Kaduna Capital school.\nThe governor enrolled his son Al-Sadiq at Kaduna Capital School about a year and a half ago to encourage parents to send their children to public schools.\nEl-Rufai said, “My son was registered in the school and so my daughter who clocked six years.\nBut we have to temporarily withdraw them for the security of the school because we foiled plans from at least two groups to attack the school to kidnap my son.\nEven if my son is kidnapped, I will rather pray for him to make heaven instead because I won’t pay any ransom,”"
  },
  {
    "headline": "Kano agog as Osinbajo, govs, Ministers, others attend coronation of 15th Emir of Kano",
    "summarized_story": "Kano residents came out en-masse on Saturday to welcome Vice-President Yemi Osinbajo and other dignitaries to the coronation of Emir of Kano, Aminu Ado-Bayero.\nOthers were Yahaya Bello of Kogi, Aminu Tambuwal of Sokoto, Bello Matawalle of Zamfara and Babajide Sanwo-Olu of Lagos State.\nMinisters, National Assembly members, diplomats, traditional rulers, religious leaders and business tycoons also graced the occasion.\nThere were also representatives of traditional rulers from Niger Republic and Cameroon.\nBorn in 1961, Emir Aminu Ado-Bayero is the 15th Emir of Kano from the Fulani Sullubawa clan."
  },
  {
    "headline": "Another Nigerian club involved in road crash, players, officials escape death",
    "summarized_story": "A Nigerian club, Oyah Sport, participating in the Nigeria National League (NNL) was on Saturday morning involved in a road accident around Keffi.\nThe Abuja-based club were on their way to Taraba to honour their NNL match scheduled for Sunday.\nAn official of the club who disclosed the development via WhatsApp message simply wrote, “Good morning all, we Oyah Sports FC just had accident at Keffi Road whilst on our way to Jalingo, Tabara to honor our match for tomorrow.\n“Thanks to the Almighty God no serious casualties apart from our Technical Adviser and two players that has a broken legs and broken shoulder.. 6 other players sustained injuries whilst I, the Chairman has serious neck and leg pain.”Oyah Sports on Thursday lost their match 0-1 versus NAF FC in Abuja before travelling for another encounter as the football season winds down gradually.\nSeveral clubs including Wikki Tourist of Bauchi have been involved in road crash in recent times."
  },
  {
    "headline": "Pictures: Against government order, Yoruba nation agitators begin rally in Lagos",
    "summarized_story": "PreviousCourt remands twin brothers for raping, posting nude photos of victim on facebook"
  },
  {
    "headline": "GOC 7 Division commends troops’ fighting spirit, resilience, gallantry -NigPilot",
    "summarized_story": "Gen Eyitayo lauded the troops during a maiden operational tour of 24 Task Force Brigades, Dikwa, and Special Intervention Battalion IV, as well as Mobile Strike Team 16 collocated in New Marte.\nHe commended troops’ high level of alertness and undampened fighting spirit in recent encounters with elements of Boko Haram terrorists (BHTs) and Islamic State West Africa Province (ISWAP).\nThe GOC urged the troops to sustain the momentum and ensure that remnant of the terrorists is completely neutralized.\nGeneral Eyitayo told the troops, that his visit was necessitated by the need to evaluate and address security and operational challenges, as well as issues bordering on the welfare of the troops.\nDuring the visit, the GOC inspected a large cache of arms, ammunition, and Gun trucks captured from neutralized terrorists."
  },
  {
    "headline": "MHWUN passes vote of confidence on HRM Biobelemoye -NigPilot",
    "summarized_story": "Josiah challenged staff not to hoard any information from the incoming acting Secretary-General, to enable him quickly understand the workings of his new office.\nThe Royal Father also reminded the administrative staff to render the same support extended to Late Silas Adamu to the new Acting Secretary-General, to perform his duties optimally.\nHe recalled the relentless commitment of the Late MHWU Secretary-General, Silas Adamu, and charged the new Acting Secretary-General to ensure bureaucracy is seemless in memory of his predecessor.\nAuwolu Kiawa’s Appointment, Follows the Sudden Demise of MHWUN Secretary-General, Mr. Silas Adamu, in a ghastly autocrash along Abuja- Kaduna Expressway, on 8th of March 2021.\nLate silas Adamu who died along with his wife and daughter has since been buried."
  },
  {
    "headline": "Lock-up Capital in Land breeds huge economic loss – SGoF -NigPilot",
    "summarized_story": "The Surveyor General of the Federation (SGoF), Surv Samuel Adeniran Taiwo said that Nigeria has suffered huge economic loss because of lock-up capital in land resulting from ineffective land administration, improper land use, and property management.\nHe noted that the theme of the conference, “Unlocking Real Estate Potentials for Economic Development” was timely and inspiring.\nHe added that there was no gainsaying the fact that land remained a major resource of any type of physical development, impacting heavily on national economic architecture.\nHe reiterated that land remained a major factor of production and “it is key for all purposes of socioeconomic development”.\nHead of Press and Public Relations, Office of the Surveyor General of the Federation Abu, Michael in a statement said that Surv."
  },
  {
    "headline": "Nigeria trade relation with Qatar is very low – Nigerian Envoy",
    "summarized_story": "The Ambassador Extraordinary and Plenipotentiary of the Federal Republic of Nigeria to the State of Qatar, Ambassador Yakubu Abdullahi has said that Nigeria’s trade relation with Qatar is very low.\nAmbassador Abdullahi said this while presenting his Letters of Credence to the Emir of the State of Qatar, His Highness Sheikh Tamim bin Hamad Al-Thani.\nAmbassador Ahmed expressed gratitude to President Muhammadu Buhari for finding him worthy of appointment as his Principal Envoy to the State of Qatar.\nThe Emir of Qatar in his response assured the Nigerian Envoy of his support to succeed in the discharge of his mandates.\nThe credential’s presentation ceremony was preceded by the inspection of the Guard of Honour by the Nigerian Ambassador, who until his appointment as Ambassador to the State of Qatar was the Director of Protocol, State House."
  },
  {
    "headline": "Bandits Kill Seven, Kidnap 10 In Fresh Kaduna Attacks",
    "summarized_story": "At least seven people have been killed and ten others kidnapped in separate attacks carried out by bandits in Chikun, Kajuru and Giwa Local Government Areas of Kaduna State.\nMoses Matthew, a resident of Iri Station in Kaujuru Local Government Area, told Channels Television that the bandits stormed the community around 1:00 am with some sophisticated weapons and started shooting indiscriminately.\nHe said residents of the area heard the sound of heavy gunshots forcing the people to scream, adding that the bandits succeeded in abducting 10 persons.\n“In the early hours of today, we got a distress call from Iri Station in Kaujuru Local Government and two citizens were killed.\nAs part of the measures to tackle the menace, Kaduna State Governor, Nasir El-Rufai had vowed that the state government would not negotiate with bandits or pay ransom to secure the release of abducted persons."
  },
  {
    "headline": "Kano Is Home To All Nigerians –  Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo on Saturday said Kano State is home to all Nigerians and a place where they can co-exist peacefully regardless of differences.\nOsinbajo stated this in Kano during the coronation of Alhaji Aminu Ado Bayero as the 15th Emir of Kano, where he represented President Muhammadu Buhari.\nWhile conveying the President’s warm felicitations and personal good wishes to the State government and people of Kano, Osinbajo described the coronation as ‘historic’, while noting that Kano is revered as a major commercial and economic centre in sub-Saharan Africa.\nThis is after all the city of the socialist man of the masses, Mallam Aminu Kano, and many of his disciples.\nBut we are confident that by the grace of God you will exceed the reputation of your illustrious forebears."
  },
  {
    "headline": "Despite Heavy Security Presence, Yoruba Nation Protesters Storm Freedom Park",
    "summarized_story": "Despite the heavy presence of armed policemen around Gani Fawehinmi Park, Ojota, Lagos, agitators of the Yoruba nation on Saturday gathered at the park.\nChanting different songs of freedom and flying their flags, the protesters said the nation is bleeding and they need Oodua Nation.\n﻿“We are not fighting with anyone, we just want Yoruba nation now.\nGive us our own nation, Nigeria is not working anymore,” one of the agitators told Channels Television.\nThe Commissioner told journalists that the heavy security presence is to ensure that the protest is not hijacked by hoodlums."
  },
  {
    "headline": "Inside The World Of Nigeria’s ‘Teenage’ TikTok Stars",
    "summarized_story": "According to Statista, TikTok was the ninth most popular social media platform in Nigeria, just behind LinkedIn and Telegram, as of the third quarter of 2020.\n“I started taking TikTok seriously when it became the next big social media platform for business owners,” she said.\nAnd with more than four million followers, he is one of the most popular TikTok creators in Nigeria.\n‘Tik Tok Won’t Wait’Most TikTok videos do not require any fancy production equipment, even for stars; although some go heavy once they can afford it.\nIn Nigeria, it has largely escaped attention as the country tightens control on social media amid an indefinite suspension of Twitter."
  },
  {
    "headline": "Police Parade Student Posing As Bandit Leader, Others In Zamfara",
    "summarized_story": "The Zamfara State Police Command has paraded suspects in connection with banditry and other related crimes in the state.\nOne of those arrested is said to be a Senior Secondary School student of the Federal Government College, Anka, who allegedly posed as a bandit leader and demanded the sum of ₦3 million from the principal of the school.\n“On June 25, a letter was found close to the suggestion box of Dominican College in Gusau.\n“On the receipt of the complaints, police detectives swung into action and arrested the suspect called Donatus Ede as the Principal suspect.\nOn interrogation, the suspect was discovered to be an SS 3 student of the school.”"
  },
  {
    "headline": "10 family members die after eating ‘tuwon dawa’ in Zamfara community",
    "summarized_story": "Ten persons have reportedly died after eating a poisonous food in Jangeme community in Gusau Local government area of Zamfara state.\nThe deceased who are members of one family are mostly children between the ages of five to twelve yearsThey Died after eating a ginicon food known as Tuwon Dawa in Hausa, which was mistakenly cooked with a chemicalA thirty five old Aunt to the deceased who was at the family House for a visit cooked the food with the chemical thinking it was a potashConfirming the incident to TVC NEWS , the public relations officer of Yeriman Bakura General Hospital Auwal Ruwan-Doruwa says one of the victims died at home before the remaining nine were brought to the Hospital after battling with the poison for several hoursAdvertisementAccording to him, three died Monday night, another three died Tuesday and two died on Thursday while the last person died on Friday“They were served with guinea corn food called ‘tuwon dawa’ in Hausa which was cooked by their aunt Aisha Musa”” Aisha mistakenly put a poisonous chemical in the food thinking it was a potash and immediately they ate the food, they fell sick due to stomach cramps and were rushed to the hospital in Gusau where they later died”Ruwan-Doruwa adds that despite all efforts by medical personnel to save the life of the victims they all died.\nThe Hospital authorities is appealing to the general public to be conscious of what they keep in the kitchen or near food items."
  },
  {
    "headline": "PGF resolves to implement Security Trust fund in APC States",
    "summarized_story": "The All Progressives Congress (APC) controlled states have resolved to strengthen the legal framework for the implementation of Security Trust Fund (STF) in their States as part of efforts to end insecurity.\nThe states under the aegis of the Progressive Governors Forum (PGF) commended the renewed offensive by Nigerian security agencies against criminal elements across the country.\nThey reaffirmed the commitment of APC State governments to continue to work with the federal government under the leadership of President Muhammadu Buhari to ensure that every part of Nigeria is safe.\nIn a communique released Saturday in Abuja after the 12th quarterly meeting of Secretaries to the Government of the All Progressives Congress States held in Nasarawa, the forum resolved to prioritise adequate support for working nursing mothers, including the adoption of six months maternity leave for nursing mothers to enhance Exclusive Breast Feeding (EBF).\nThe communique signed by the Secretary to Government of Nasarawa state, Mr Muhammad Ubandoma Aliyu and the director general of PGF, Salihu Mohammed Lukman, said the issues of Maternal and Child Nutrition should be integrated into the Primary Healthcare Delivery Services."
  },
  {
    "headline": "Group to train over 2000 IDPs in Zamfara on sewing, soap making",
    "summarized_story": "Over two thousand Internally Displaced Persons in Zamfara state will benefit from free skill acquisition Training by a non-governmental organisation.\nThe training is expected to equip women and children in the IDP camps with sewing skills, soap and pomade-making among others.\nShe said the Umaru Shinkafi foundation will provide skill acquisition training that will help the IDPs become self reliant even when they go back to their communities.\n“Our aim is to ensure that all women in the IDPs Camp becomes professionals in different fields to train others while we provide the technical support.\nAdvertisementThe Executive Secretary of the solid Minerals Development fund further commended Governor Bello Matawalle of Zamfara state and President Muhammadu Buhari in their continuous effort to addressing the activities of criminal elements across the country."
  },
  {
    "headline": "Full Throttle: England Boss Southgate Says No Rotation in Euro Quarterfinal with Ukraine",
    "summarized_story": "Gareth Southgate said it would be “an insult to Ukraine” for England to rotate their lineup due to the possibility of four players missing a potential Euro 2020 semifinal.\nHowever, asked by ESPN whether the yellow card situation would affect his team selection against Andriy Shevchenko’s side, Southgate replied:“No.\nI understand that strategically you might like to do that but I can’t think of a country in the world that would do that for a quarterfinal.\nNo, I think we’ve got to focus on tomorrow.\nI think it would be a big error for us to be thinking about anything else and I think it would be an insult to Ukraine as well."
  },
  {
    "headline": "About 200 US Companies Hit By ‘Colossal’ Cyber-attack",
    "summarized_story": "About 200 US businesses have been hit by a “colossal” ransomware attack, according to a cyber-security firm.\nThe cyber-breach emerged on Friday afternoon as companies across the US were clocking off for the long Independence Day weekend.\nKaseya said in its statement that a “small number” of companies had been affected, though Huntress Labs said the number is already about 200 and counting.\n“This is a colossal and devastating supply chain attack,” Huntress Labs’ senior security researcher John Hammond said in an email to Reuters news agency.\nThe group sometimes threatens to post stolen documents on its website – known as the “Happy Blog” – if victims don’t comply with its demands."
  },
  {
    "headline": "Europe in Vaccination Race Against Covid′s Delta Variant",
    "summarized_story": "Countries across Europe are scrambling to accelerate coronavirus vaccinations and outpace the spread of the more infectious delta variant, in a high-stakes race to prevent hospital wards from filling up again with patients fighting for their lives.\nThe risk of infection from the delta variant is “high to very high” for partially or unvaccinated communities, according to the European Centre for Disease Control, which monitors 30 countries on the continent.\nIn the U.K., cases of the delta variant have increased fourfold in less than a month, with confirmed cases Friday up 46% on the previous week.\nFrance lifted the last of its major restrictions Wednesday, allowing unlimited crowds in restaurants, at weddings and most cultural events despite fast-rising cases of the delta variant.\nBut Dr. Hans Kluge, the head of the WHO’s Europe office, cautioned this week that the delta variant is poised to become dominant by August in the 53-country region his office covers."
  },
  {
    "headline": "Southern Nigeria Governors to Meet on Open Grazing and Restructuring Monday in Lagos",
    "summarized_story": "Seventeen governors of Nigeria’s southern states will on Monday converge on Lagos for the second time this year to continue their search for solution to the myriad of problems confronting the country.\nThe source said: “The governors are working towards a better Southern Nigeria within the Nigerian nation.\nThe southern governors will be looking at the gains of the last meeting and come up with their next move.\n“You know the southern governors agreed that the progress of the nation requires that urgent and bold steps be taken towards the restructuring of the Nigerian federation leading to the devolution of power.\nDuring the first meeting in Asaba, the southern governors resolved to ban all forms of open grazing in the southern states of the country."
  },
  {
    "headline": "Indonesia to Get US Vaccine Donations Amid Covid Emergency",
    "summarized_story": "Sullivan said the donation “underscored the United States’ support for the people of Indonesia as they fight a surge in COVID-19 cases”.\nThe two officials also discussed US plans to increase assistance for Indonesia’s broader COVID-19 response efforts, the statement said.\nPenny K Lukito, the chief of Indonesia’s food and drug agency, said earlier on Friday it authorised the Moderna vaccine for emergency use.\nThe company said the vaccine was far more effective in producing antibodies against the Delta variant than it was against the Beta variant first identified in South Africa.\nIndonesia has relied mainly on the vaccine from China’s Sinovac, but has been looking to diversify supply sources."
  }
]