[
  {
    "headline": "Media bills: Buhari, N’Assembly attempting to criminalise journalism, says IPC",
    "summarized_story": "THE International Press Centre has kicked against attempts by the government to criminalise journalism in the country, urging media professionals to fight before it is too late.\nHe identified them as the National Broadcasting Commission Amendment Bill and the Nigerian Press Council Act Amendment Bill.\n“In the case of the NBC Act, there is a provision that the NBC can sanction a station, including fine or revocation of licence, if in the opinion of the NBC, it is in public interest.\nHe said this was giving the Information Ministry undue control of the press.\nSo, they are saying in effect that all newspapers are a department of the Ministry of Information,” he added."
  },
  {
    "headline": "Trigger-happy cop kills five Enugu youths, injures four",
    "summarized_story": "Enugu State Police Command on Sunday said it had arrested a trigger-happy police inspector who allegedly killed five people, while leaving four others critically injured.\nIt was gathered that the police inspector attached to Special Protection Unit Base 9, Umuahia, Abia State, started shooting residents at a lotto office to play Sunday morning.\nMeanwhile, Governor Ifeanyi Ugwuanyi of Enugu State has visited the victims at ESUT Teaching Hospital Parklane, Enugu, where they are receiving treatment.\nA statement by the governor’s special assistant on media, Mr Louis Amoke, said the governor announced that his administration would pay all the medical expenses.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Ogun auto crashes claim two, six injured",
    "summarized_story": "The first accident, which claimed one life with six injured, occurred at Imo Emulu village in the Obafemi-Owode on the Abeokuta-Sagamu Expressway.\nThe second accident occurred at 5.10pm on Sunday and also claimed one life.\n“The six injured persons have been taken to Federal Medical Centre, Idi-Aba and General Hospital Ijaye, while the presumed dead male adult was taken to Idera Hospital.\nOn the second accident, Akinbiyi explained that it happened in the Lombardy area in the Ado-Odo/Ota LGA.\nAkinbiyi added that the accident involved a truck and a motorcycle."
  },
  {
    "headline": "COVID-19: African economies won’t revive until vaccination deficiency addressed — AfDB",
    "summarized_story": "According to him, “The African Development Bank moved very quickly to launch a $10 billion facility to support countries.\n“The African Development Bank projects for Africa GDP growth will rebound to 3.4%.\n“The African Development Bank will ramp up support for Africa to produce vaccines as part of the vaccines plan for the African Union.\nThat’s why the African Development Bank calls for the development of Security Indexed Investment Bonds, taking advantage of lower long-term interest rates.\nThe plans can be credit-enhanced by the African Development Bank or other donors."
  },
  {
    "headline": "Petrol: Why we demand daily stock record from marketers",
    "summarized_story": "By Michael EbohThe Department for Petroleum Resources, DPR, yesterday, clarified that its request for daily stock record from petrol retail outlets and depots across the country is a statutory requirement and is at no cost to the oil marketers.\nHe called on oil marketers to report any infraction, extortion and acts of illegality perpetrated by any of its staff in the discharge of their duties.\nHe said, “Our attention has been drawn to a misunderstanding over the request for daily stock records by the Department of Petroleum Resources, DPR.\nThis development follows an online publication on allegations of extortion against the DPR by the Independent Marketers Association of Nigeria, IPMAN, Suleja/Abuja branch on the stock request.\n” The Department charges all marketers to report any noticeable infraction or perceived illegality by our officers, as we will continue to engage all our stakeholders in ensuring energy security for Nigerians.”"
  },
  {
    "headline": "Shaqiri stars, as Switzerland boost qualification hopes against Turkey",
    "summarized_story": "Switzerland significantly boosted their chances of qualifying for the knockout stages at Euro 2020 by beating Turkey 3-1 in their final Group A game.\nIrfan Can Kahveci pulled one back for Turkey, but Shaqiri wrapped up Switzerland’s first win of the tournament – and ensured their opponents leave the competition having failed to pick up a single point – with another wonderful finish.\nDespite Turkey’s strong start, which saw Kaan Ayhan test Yann Sommer from distance, it was Switzerland who struck first, Seferovic lashing into Ugurcan Cakir’s bottom-left corner after just six minutes.\nShaqiri doubled their advantage in the 26th minute, the Liverpool forward whipping superbly past Cakir from just outside the penalty area.\nGranit Xhaka struck the post late on as Switzerland sought in vain to overturn a goal deficit to second-placed Wales, settling instead for sending an insipid Turkey home with a whimper."
  },
  {
    "headline": "Jamoh launches campaign to end war risk insurance on Nigerian bound cargoes",
    "summarized_story": "This came as it has been disclosed that Nigeria’s maritime trade is to say the least threatened due to the increasing war risk insurance premium now being paid by Nigeria-bound vessels.\nWar risk insurance is a type of insurance, which covers damage due to acts of war, including invasion, insurrection, rebellion and hijacking.\nIt generally has two components: War Risk Liability, which covers people and items inside the craft and is calculated based on the indemnity amount; and War Risk Hull, which covers the craft itself and is calculated based on the value of the craft.\nNigeria has demonstrated enough commitment towards tackling maritime insecurity to avert such premium burden,” Jamoh said.\nIt tracks insured vessels on a 24-hour basis, but because the risks are so high, it limits claims to $25 million."
  },
  {
    "headline": "Ibadan indigenes honour Sports Minister with merit award",
    "summarized_story": "Sunday Dare, Minister of Youths and Sports Development (middle), and other dignitaries at the event.\nYouth and Sports Minister bags award Sunday Dare, the Honorable Minister of Youths and Sports Development (middle)A socio-cultural organisation, Central Council of Ibadan Indigenes (CCII), on Sunday, honoured Minister of Youth and Sports Development, Sunday Dare, with a merit award.\nThe statement quoted the President of CCII, Yemi Soladoye, as commending the minister for displaying uncommon love and kindness towards Ibadan city and its people.\nIn his acceptance speech, the minister expressed appreciation to CCII for the honour, assuring that he would continue to work for the progress of Ibadan, Oyo State and Nigeria in general.\nI promise to fund an endowment for the development of Ibadan for the next 10 years,” he said."
  },
  {
    "headline": "Oyo NUJ calls for arrest of killers of Ibadan-based journalist",
    "summarized_story": "The Nigerian Union of Journalists (NUJ), Oyo State Council, has called on the state government to fish out the killers of an Ibadan-based journalist, Titus Badejo.\nThe council Chairman, Mr Ademola Babalola made the call in condolence message issued on Sunday to newsmen in Ibadan, NAN reports.\nSeyi Makinde and Commissioner of Police, Ngozi Onadeko, to ensure the killers were apprehended and made to face the full wrath of the law.\n“We mourn the untimely passing on and gruesome murder of Titus Badejo, a journalist.\n“Under the cover of darkness, the assailants snuffed life out of a promising young man who had a bright future."
  },
  {
    "headline": "We will rebuild Ekwereazu-Akwa Ibom link road",
    "summarized_story": "Governor Okezie Ikpeazu of Abia State has assured that his administration will rebuild the Umuaro – Ekwereazu – Nto Edino Road in Obingwa LGA constructed by his administration which has provided a strategic linkage between Abia and Akwa Ibom states.\nIkpeazu made this known during the weekend while commissioning the Umuaro-Umuopara-Amano Road in Obingwa LGA.\nThe Governor noted that the reason for the failure of the road has been identified.\nHowever, the road, unfortunately, became the only route for heavy-duty and deadweight vehicles, particularly those conveying several hundreds of tons of cement from Akwa Ibom State through Aba to other parts of the country, adding that the road carved into the massive pressure of these deadweight vehicles that ply the road daily in their hundreds.\nCivil servants must contribute in rebuilding Kastina market because they consume 80 percent of allocation"
  },
  {
    "headline": "Afenifere kicks as Buhari insists on reopening grazing routes",
    "summarized_story": "A leading Yoruba socio-political organisation, Afenifere, has said the Federal Government’s move to reopen the grazing routes is unacceptable.\nAfenifere’s National Publicity Secretary, Jare Ajayi, in a statement on Sunday, said the Federal Government’s insistence shows disdain and contempt that it has for the people.\n“The insistence of the present administration on re-opening the so-called grazing routes shows the duplicity, dishonesty and the draconian tendencies of the government,” Afenifere said.\n“What is more, it has been established that the so-called grazing routes did not exist in all the states in the country.\nReopening the grazing routes is unacceptable on any grounds.”Gov Akeredolu kicks against Buhari’s move for open grazing"
  },
  {
    "headline": "Electoral Bill: Gov Emmanuel seeks UN’s support for passage, assent",
    "summarized_story": "Governor Udom Emmanuel of Akwa Ibom State has sought the support of the United Nations for the passage of a pending electoral bill by the National Assembly and subsequent executive assent.\nThe Governor made the demand at the weekend at the government house, Uyo, the State capital when the United Nations SDGs Resident Humanitarian Coordinator, Mr. Edward Kallon, paid him a courtesy visit.\nThe Ambassador also presented a UN SDGs Champion Laurel to the Governor for aligning with the organisation’s Sustainable Development Goals in his investment drive.\nHe added that such would boost tourism as well as the economy in the state.\nClaims of zero allocation to LG bosses, totally false – Akwa Ibom Assembly insists"
  },
  {
    "headline": "Nigeria'll burn if Northerners retaliate attacks on them",
    "summarized_story": "The Arewa Consultative Forum, ACF, has warned that Nigeria will go up in flames if Northerners decide to retaliate attacks on them in other regions.\nACF’s spokesman, Emmanuel Yawe issued the warning while cautioning Northern youths against retaliation in the face of all forms of provocations.\nYawe urged Northern youths to remain calm and not set Nigeria ablaze by avenging attacks.\nIn a statement, the ACF spokesman recalled how the 1960’s retaliatory killings set the country in flames.\n17 Northern groups under the aegis of the Northern Consensus Movement (NCM) had made the declaration while placing a bounty of N100m on Kanu."
  },
  {
    "headline": "I’m mandated by God to heal the sick or I die, says 77-year-old cleric",
    "summarized_story": "Seventy-seven-year-old Christian cleric by the name Nathan Otozulu from Bayelsa State says he is “a Nobody” because he does not like titles.\nBut for his works faith and healing which God Almighty has passed through him to heal, people started calling him Prophet Nathan Otozulu.\nHe was in Calabar, the Cross River State capital where he had an audience with few newsmen and said he is mandated by God to go from State to State and Country to Country to heal the sick.\nAccording to him, he had the calling as far back as 1968 when he was studying mathematics in Liverpool, Uk.\nHe added that healing comes from God, not him and that the treatment is available even through a telephone call."
  },
  {
    "headline": "I fell out with Dorathy because of Ozo – Nengi reveals",
    "summarized_story": "Former Big Brother Naija housemate, Nengi Hampson, says that Ozo was the reason she fell out with Dorathy.\nSpeaking during the reunion show, Nengi said Ozo played a part in the bad blood that existed between her and Dorathy.\nAccording to her, Ozo cannot keep saying bad things about someone he was with to another person and expect the two parties not to have resentment for each other.\n“For me, If my sister comes to me and each time she keeps saying something bad about a particular person, definitely I will feel somehow towards the person.\n“I have even told him that he was part of the reason I and Dorathy had a fallout."
  },
  {
    "headline": "Timi Dakolo: Why I told my kids about their mum's rape ordeal",
    "summarized_story": "Nigerian musician, Timi Dakolo, has disclosed that he and his wife, Busola, informed their children about their mother’s sexual assault ordeal.\nTimi during an interview with media personality, Toke Makinwa, explained that his concept of raising kids is one that allows them to freely express themselves.\nHe noted that his children knew something was happening but yet didn’t know the gravity of what it was.\nSomeone once asked me this question and I said I would always know how to sing.\nThe word ‘man’ is synonymous with responsibility and one won’t need certain things when one is strong."
  },
  {
    "headline": "We must deal with social media monster - Oyedepo",
    "summarized_story": "President, Living Faith Church (Winners Chapel), Bishop David Oyedepo has urged the government and well-meaning Nigerians to deal with the monster of social media.\nBishop Oyedepo called for an urgent step to device means of checking free and unhindered access to social media.\nOyedepo said putting measures to check free access to social media should particularly target those aspects that are not adding values.\n“This social media saga has eroded the substance of destiny of most youth today.\n“We must devise means to put a check on free access to social media particularly those that are not adding values,” Oyedepo, Founder Living Faith Church worldwide said."
  },
  {
    "headline": "VIDEO: Why I can’t be with one woman - Tekno",
    "summarized_story": "Popular singer, Augustine Miles Kelechi, better known as Tekno, has revealed that it is impossible for him to be with one woman for the rest of his life.\nTekno argued that the concept makes sense in fictional works of art but in reality, it is weird and impossible.\nAlthough he didn’t state a particular reason why he thinks it is generally impossible, Tekno, however, noted he personally finds it impossible because there are many beautiful women across the world.\nBut in reality, it is just weird because I want to love one person and be with them but it is impossible because the women are so beautiful.\nThere are so many beautiful women everywhere around the world,” he said."
  },
  {
    "headline": "Nigeria practically becoming a failed state-Cardinal Okogie",
    "summarized_story": "By Agatha EmeadiAnthony Cardinal Okogie, Emeritus Archbishop of the Catholic Archdiocese of Lagos has again berated the government as he lamented the state of the nation, saying Nigeria is practically becoming a failed state.\nOkogie insisted that state of anarchy is looming and harped on the need avoid it.\n“As they say, matters speak for itself is a proof that Nigeria is practically slipping into a failed state.\nOkogie therefore called on government at all levels to rise up to the situation and save this nation from drowning.\nHe said the church under the leadership of Okogie recorded tremendous successes to show that the church is a stakeholder of governance in Nigeria.”"
  },
  {
    "headline": "Stop profiling Nigerian youths as criminals and cultists, Ita Enang warns leaders",
    "summarized_story": "From Joe Effiong, UyoThe Senior Special Assistant to President Muhammadu Buhari on Niger Delta Affairs, Ita Enang, has warned leaders to stop profiling Nigerian youths ‘as criminals or cultists’ and other such ‘demeaning appellations’.\n‘We should not profile them as criminals or cultists nor such derogatory nor demeaning appellations that give them low self or societal esteem.\n‘Now the security crisis we are experiencing in the South East, we have had a case of that crisis in North West.\nWe have had students kidnapped from Schools, and those students are not Christians, those students are Muslims.\n‘We’ve had this crisis happen in states that are not APC, we have had it happen in states that are PDP."
  },
  {
    "headline": "My pointed nose, boobs, my selling point –Titi Adeoye, actress",
    "summarized_story": "By Damilola FatunmiseFor Titi Adeoye, acting is her second nature.\nShe can play any role spontaneously having been acting in school and church before going professional.\nIn this interview, she narrated her journey into the movie industry, her heartbreak experience and greatest fear.\nWhat’s your greatest fear in life?\nMy greatest fear is failure."
  },
  {
    "headline": "Dot-in-circle: Amechi lambasts Buhari",
    "summarized_story": "I have said it personally that I believe in a bigger country, Nigeria that I fought for.\nBut if Nigeria breaks, Buhari is responsible for the breaking of the country.\nBuhari is the only president who wants to equate Fulani economy and empire with his attempt to Fulanize Nigeria and to Islamize Nigeria.\nThe point we got it wrong is at the point of Muhammadu Buhari as the president of Nigeria.\nIt started with President Buhari because of his other ambition of colonizing Nigeria, that Nigeria is a property bequeathed to them by Uthman Dan Fodio."
  },
  {
    "headline": "There’ll never be peace if Biafra, Oduduwa republics are created –",
    "summarized_story": "I know many people will say Fulani are the bandits, kidnappers, this is how they have been frustrated.\nIf you continue to talk about Fulani this way, they will not have peace and if they don’t have peace, you cannot have peace yourself.\nWhen you keep on blackmailing them as foreigners they will come to Nigeria to help Fulani in Nigeria to fight.\nHow did the urban Hausa caused the fight?\nWhen such republics are created there will never be peace in Nigeria because we will continue to fight with our former brothers."
  },
  {
    "headline": "Just In: Troops Rescue Three Kebbi Students, One Teacher, Kill Bandit",
    "summarized_story": "“Deploy more troops for search and rescueKingsley Nwezeh in AbujaThe Nigerian Army said troops operating under the auspices of Operation Hadarin Daji, supported by Nigerian Air Force rescued one teacher and three students of the Federal Government College, Birnin Yawuri in Kebbi State.\nThe army had said Friday that one student died of exhaustion during a rescue operation as troops of Operation Hadarin Daji engaged kidnappers in a fire-fight, culminating in the rescue of five students and two teachers of the college.\nA statement issued Sunday by Army Spokesman, Brigadier-General Onyema Nwachukwu, said one teacher and three more students were rescued weekend.\n“One teacher and three students were rescued yesterday at Makuku, in the ongoing search and rescue operations”, it said.\nThe army statement said “troops also killed one bandit and recovered nine motorcycles and four handsets from the fleeing bandits”It said “additional troops have also been deployed to dominate the forest and deny the bandits freedom of action”."
  },
  {
    "headline": "Breaking: Rescue Operation Still on for Kidnapped Kebbi Students",
    "summarized_story": "Rescue operation is still on for the kidnapped students and teachers of the Federal Government College, Birnin Yauri, Kebbi State, THISDAY has learnt.\nMore than 80 students, a majority of them girls, and five teachers were kidnapped last week by bandits who stormed the federal government-owned college in Yauri.\nSources told THISDAY Sunday morning that some of the students had been rescued by troops.\nThe remaining abducted students, sources said, had been split into five groups by the bandits, who had now been surrounded by troops.\n“They have been surrounded by troops but they are negotiating so that the girls would not be killed,” the source said."
  },
  {
    "headline": "Breaking: 15 Kidnap Victims Escape from Captivity in Niger",
    "summarized_story": "By Laleye Dipo in MinnaNot less than 15 people recently kidnapped by bandits in Tegina town of Niger state at the weekend escaped from their Abductors.\nThe 15 were among the adults abducted along with the 156 pupils of the Salihu Tanko Islamic school more than two weeks ago.\nTHISDAY gathered that the escapees moved in different directions so that they will not arouse suspicion from other bandits in the forest.\nA top government official told THISDAY that the escapee was treated, given food and new dress and will soon be reunited with his family in Kuta.\nThe escape of the 15 has raised hopes that the 156 children also picked by the bandits will soon regain their freedom."
  },
  {
    "headline": "Kebbi Students May Have Been Rescued as Scores of Bandits Killed",
    "summarized_story": "The troops, THISDAY gathered, were able to rescue the students and their teachers after closing in on the bandits and killings scores of them, before the rest abandoned their hideouts, leaving the victims behind.\nBandits, on Thursday, kidnapped at least 80 students and five teachers from the Federal Government College, Birnin Yauri, Kebbi State, killing a police officer in the process.\nKebbi State police spokesman Nafiu Abubakar, confirmed that the gunmen killed one of their officersduring an exchange and also shot a student, who had since been receiving medical treatment at an undisclosed hospital.\nThe Kebbi State Police Command further claimed that the vehicle used to convey the kidnapped students and teachers belonged to an unnamed High Court judge in the state.\n“When we got there, we saw students crying, teachers crying, everyone is sympathising with people,” he also said to Reuters."
  },
  {
    "headline": "Bawa: EFCC Won’t Hand over Cases of Interest to any State",
    "summarized_story": "•Says commission as a creation of N’Assembly supersedes states’ establishmentsKingsley Nwezeh in AbujaChairman of the Economic and Financial Crimes Commission (EFCC), Mr. Abdulrasheed Bawa, has declared that the commission, under his leadership, would not hand over cases of interest to any state government.\nSome of the states envisage that the EFCC would hand over corruption cases concerning their states to the local anti-corruption commissions.\nThe EFCC chairman also denied asking the management teams of banks to declare theirs assets to the commission.\n“There are a lot of Supreme Court decided cases on this particular issue.\n“We are yet to see how the EFCC is going to hand over cases that they are interested in to any state government or see any correspondence to that effect."
  },
  {
    "headline": "Borrowing Is Good For Nigeria– Buhari’s Minister, Fashola",
    "summarized_story": "The Minister of Works and Housing, Babatunde Fashola, has defended the Nigerian Government’s resort to loans to expand infrastructure in the country.\nFashola, who spoke to the News Agency of Nigeria, said that the country would not make meaningful progress without taking loans to boost infrastructure.\nHe explained that borrowing is not a sin and it is part of the essence of keeping the economy growing.\n“But while we were not borrowing, those who laid the rules started borrowing.\n“But since the aftermath of going to write off that debt we started borrowing again, so this administration did inherit all the debt."
  },
  {
    "headline": "Borrowing Is Good For Nigeria– Buhari’s Minister, Fashola",
    "summarized_story": "The Minister of Works and Housing, Babatunde Fashola, has defended the Nigerian Government’s resort to loans to expand infrastructure in the country.\nFashola, who spoke to the News Agency of Nigeria, said that the country would not make meaningful progress without taking loans to boost infrastructure.\nHe explained that borrowing is not a sin and it is part of the essence of keeping the economy growing.\n“But while we were not borrowing, those who laid the rules started borrowing.\n“But since the aftermath of going to write off that debt we started borrowing again, so this administration did inherit all the debt."
  },
  {
    "headline": "Borrowing Is Good For Nigeria– Buhari’s Minister, Fashola",
    "summarized_story": "The Minister of Works and Housing, Babatunde Fashola, has defended the Nigerian Government’s resort to loans to expand infrastructure in the country.\nFashola, who spoke to the News Agency of Nigeria, said that the country would not make meaningful progress without taking loans to boost infrastructure.\nHe explained that borrowing is not a sin and it is part of the essence of keeping the economy growing.\n“But while we were not borrowing, those who laid the rules started borrowing.\n“But since the aftermath of going to write off that debt we started borrowing again, so this administration did inherit all the debt."
  },
  {
    "headline": "EXPOSED: After Taking N1million Bribe, Inspector General of Police Team In Abuja Releases South-East Youths Framed For Being ESN Members",
    "summarized_story": "Inspector-General of Police (IGP)SaharaReporters gathered that the victims were raided in the South-East and brought to detention at the IGP’S IRT office in Abuja.\nSaharaReporters learnt that the fourth victim, Chinonso John, a barber, was also released after the police in Abuja collected N1.5million.\nA family source said, “Our elder brother, Emma, went to Abuja and met the IPO last week to bargain with the IPO.\nI just got information that the IPO has collected truly collected N1million and released Chinonso John.\nHe had been whisked away to Abuja and later paid N1.5million before his release from custody."
  },
  {
    "headline": "EXPOSED: After Taking N1million Bribe, Inspector General of Police Team In Abuja Releases South-East Youths Framed For Being ESN Members",
    "summarized_story": "Inspector-General of Police (IGP)SaharaReporters gathered that the victims were raided in the South-East and brought to detention at the IGP’S IRT office in Abuja.\nSaharaReporters learnt that the fourth victim, Chinonso John, a barber, was also released after the police in Abuja collected N1.5million.\nA family source said, “Our elder brother, Emma, went to Abuja and met the IPO last week to bargain with the IPO.\nI just got information that the IPO has collected truly collected N1million and released Chinonso John.\nHe had been whisked away to Abuja and later paid N1.5million before his release from custody."
  },
  {
    "headline": "Buhari has accepted dialogue to address agitations in south-east, says Ngige",
    "summarized_story": "Chris Ngige, minister of labour, says President Muhammadu Buhari has accepted the adoption of dialogue to address agitations in the south-east.\nThere have been attacks on government buildings across the south-east, leading to the killing of several security operatives.\nAdvertisementThere have also been agitations from parts of the south-east for secession, while various stakeholders have also lamented the marginalisation of the region.\nHowever, according to Ngige, the federal government is working out some modalities to ensure that the people of the south-east do not “feel unwanted” in Nigeria.\nSo, certain things will be done, at least to assuage the feelings of the people in the area, and make them not feel unwanted.”"
  },
  {
    "headline": "Buhari has accepted dialogue to address agitations in south-east, says Ngige",
    "summarized_story": "Chris Ngige, minister of labour, says President Muhammadu Buhari has accepted the adoption of dialogue to address agitations in the south-east.\nThere have been attacks on government buildings across the south-east, leading to the killing of several security operatives.\nAdvertisementThere have also been agitations from parts of the south-east for secession, while various stakeholders have also lamented the marginalisation of the region.\nHowever, according to Ngige, the federal government is working out some modalities to ensure that the people of the south-east do not “feel unwanted” in Nigeria.\nSo, certain things will be done, at least to assuage the feelings of the people in the area, and make them not feel unwanted.”"
  },
  {
    "headline": "Five dead, four injured as police officer goes on shooting spree in Enugu",
    "summarized_story": "A police inspector has been arrested in Enugu, after a shooting spree on Sunday that resulted in the death of five persons.\nAdvertisementFour others, who also sustained injuries, are currently receiving treatment at the Enugu State University Teaching Hospital.\nConfirming the incident in a statement, the state police command said it was unclear what led the police officer to shoot sporadically.\nAdvertisementMohammed Aliyu, Enugu commissioner of police, in the statement issued by Daniel Ndukwe, spokesman of the command, said the police officer has been taken into custody, pending the conclusion of investigation.\nAdvertisementOn his part, Ifeanyi Ugwuanyi, governor of Enugu, sympathised with the victims when he visited those who were hospitalised."
  },
  {
    "headline": "Five dead, four injured as police officer goes on shooting spree in Enugu",
    "summarized_story": "A police inspector has been arrested in Enugu, after a shooting spree on Sunday that resulted in the death of five persons.\nAdvertisementFour others, who also sustained injuries, are currently receiving treatment at the Enugu State University Teaching Hospital.\nConfirming the incident in a statement, the state police command said it was unclear what led the police officer to shoot sporadically.\nAdvertisementMohammed Aliyu, Enugu commissioner of police, in the statement issued by Daniel Ndukwe, spokesman of the command, said the police officer has been taken into custody, pending the conclusion of investigation.\nAdvertisementOn his part, Ifeanyi Ugwuanyi, governor of Enugu, sympathised with the victims when he visited those who were hospitalised."
  },
  {
    "headline": "Troops rescue three more students abducted from Kebbi school",
    "summarized_story": "The Nigerian army says three more students abducted from the Federal Government College, Birnin-Yauri, in Kebbi state, have been rescued.\nAdvertisementA statement by Onyema Nwachukwu, army spokesperson, noted that a teacher was also rescued alongside the students.\nNwachukwu said the abductees were rescued by troops of operation Hadarin Daji on Saturday.\nAdvertisementOn Friday, some of the abductees were rescued by troops; however, one of the kidnapped students was killed.\nAdvertisement“One teacher and three students were rescued yesterday at Makuku in the ongoing search and rescue operations."
  },
  {
    "headline": "After suspending Twitter, Nigerian government intensifies bid to control online media",
    "summarized_story": "The Buhari administration has stepped up efforts to regulate the online media in Nigeria in what is seen by many as attempts to further stifle the civic space in the country.\nMany have taken to Twitter to express criticism over the proposed regulation of online media.\nBREAKING: NBC Amendment Bill Is Social Media Bill Through The Backdoor — SERAP (@SERAPNigeria) June 17, 2021Amendment of the NBC act;grafting the shoot of autocracy.\n— #OurFavOnlineDoc 🩺🇳🇬🇬🇧💎 (@DrOlufunmilayo) June 17, 2021NBC Amendment Bill = Social Media Bill + Hate Speech Bill in disguise.\nThe government responded by suspending Twitter two days later and directed the NBC to immediately begin the process of licensing all over-the-top (OTT) media service and social media operations in Nigeria."
  },
  {
    "headline": "Facebook pulls down fake accounts targeting opposition figures ahead of Ethiopia’s election",
    "summarized_story": "Facebook, this week, said it has removed fake accounts, pages and groups that posted about news and politics ahead of Ethiopia’s general election scheduled to hold next week.\nThe fake accounts mainly posted in Amharic about topics that include the Prosperity Party and Prime Minister Abiy Ahmed.\nFacebook also linked the fake accounts to individuals associated with the Information Network Security Agency (INSA) in Ethiopia.\nPro-government demonstrators in Ethiopia had criticised the move by Washington and Gleicher added that the fake accounts were critical of the sanctions as well.\nFacebook’s move comes after severe criticism it has faced in the past for not doing enough to tackle fake accounts during national elections, including in the U.S."
  },
  {
    "headline": "Netflix kicks off inaugural skills development initiatives in Africa",
    "summarized_story": "Netflix on Sunday, June 13, commenced its first 3-month Episodic Lab (EPL) and Development Executive Traineeship (DET) programmes in Africa.\nOver 500 applications were received from Nigeria, Kenya, Mozambique, South Africa and Zimbabwe for the inaugural development lab for African writers and DET initiatives.\nOther participants are Andile Ngcizela, Dominique Jossie and Kudakwashe Maradzika from South Africa and Mary Waireri from Kenya.\n“Without the existence of our storytellers, our favourite Netflix stories wouldn’t be possible,” Alison Triegaardt, Netflix manager for Grow Creative in Africa, said.\nPotential boost to subscriber baseIn addition to improving quality storytelling in Africa, Netflix would most likely be looking to grow its relatively small subscriber base in the region by producing more relatable, original local content with the help of the development lab."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "How tech tools create a safe space for sexual violence survivors in Nigeria",
    "summarized_story": "The United Nations (UN) affirms that the COVID-19-induced lockdowns in 2020 exposed vulnerable people to more risk of sexual violence.\nDespite the Nigerian Federal Government launching its first sexual offender register in November 2019, there were so many cases of sexual violence in 2020.\nHighlighting existing response channelsJust like Kiishu, most sexual assault survivors don’t bother to report their experiences.\nHowever, Aganran submits that the same channel is also responsible for the increasing cases of sexual violence and human trafficking.\nWith more tech tools in place, there’s no telling how many cases will be reported, and perpetrators brought to book."
  },
  {
    "headline": "Babajide Duroshola steps down as Nigeria’s Country Director for Safeboda",
    "summarized_story": "Former Andela Community Manager, Babajide Duroshola, has stepped down as Safeboda’s Country Director for Nigeria.\nThis came after months of speculation regarding the Uganda-founded ride-hailing startup’s launch in the country.\nAlthough not the stated reason, the okada ban in Lagos meant that Safeboda had to launch in Ibadan, where ORide and MAX.ng were already present.\nHowever, in an interesting turn of events, as Safeboda launched in Ibadan, ORide exited the ride-hailing market.\nPerhaps to justify their decision to launch in Ibadan, Safeboda has regularly publicised the number of rides made on the platform."
  },
  {
    "headline": "Nigeria is planning a new telecom licensing regime to rival developed countries",
    "summarized_story": "In comparison with Nigeria, South Africa also operates a two-category licence structure, but its fees are more expensive.\nGlobal ICT standardsAccording to the International Telecommunication Union’s (ITU) 2020 Global ICT Regulatory Outlook, Nigeria is a third-generation (G3) country.\nAdvertisementTo put this in context, the ITU ranks countries into five generations using Regulatory Tracker indicators divided into four pillars: Regulatory Authority, Regulatory Mandate, Regulatory Regime and Competition Framework.\nAccording to ITU’s ranking, the East African nation’s ICT Regulatory Framework fosters vibrant markets and is also key to finding market solutions.\nWhile this move by the NCC shows progressiveness — especially in light of recent policy amendments — it appears there are still some ways to go before Nigeria attains global ICT standards."
  },
  {
    "headline": "The Week Ahead",
    "summarized_story": "BUA Cement Further Guarantees ‘No Price Increase’ In Coming Weeks In the light of the current inflationary trend, BUA Cement, Nigeria’s second-largest cement maker, has again assured Nigerians that it won’t further increase the price of cement.\nThis is the second time BUA is reassuring its customers in the past two months.\nThis was confirmed…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "When two years seem like eternity",
    "summarized_story": "Some have described the next two years as an “eternity”, saying that to endure the “suffocating air” for the next two years would be the worst punishment for Nigerians.\nDuring the 2015 general election campaign, the then ruling party and the main opposition party promised Nigerians a lot of goodies.\nYet, they don’t see any difference in the current situation within the remaining two years of this administration.\nIt will definitely get worse in the remaining two years of Buhari,” Angwe Yakubu, a retired senior security personnel, said.\nThis APC- led government is a failure.”According to Daramola, “The President is clueless on providing security for Nigerians not to talk of foreigners."
  },
  {
    "headline": "Is Nigerian Senate playing politics with PIB, Electoral Act and Constitutional Amendment?",
    "summarized_story": "So, the emergence of Senator Ahmad Lawan from Yobe North Senatorial District and Ovie Omo-Agege from Delta Central Senatorial District as president and deputy Senate president, respectively, was largely seen as mission accomplished.\nSimilarly, the $30 billion loan request of the president to the 8th Senate was also rejected to save the country from sinking deeper into indebtedness.\nBesides, on May 18, 2021, Buhari had sought the approval of the Senate to borrow a fresh N2.343 trillion ($6.18bn) external loan.\nNonetheless, the Electoral Act Amendment bill is one bill Nigerians are calling the 9th Senate to also expedite action on in view of the 2023 general election.\nLawan has again promised Nigerians that the Electoral Act Amendment bill and the Constitutional Amendment bill will the passed by mid July 2021 before going on recess."
  },
  {
    "headline": "Edo begins use of revenue scratch cards in move to expand tax net – Nigerian Observer",
    "summarized_story": "Edo begins use of revenue scratch cards in move to expand tax netShare FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Internal Revenue Service, (EIRS) has introduced the use of Revenue Scratch Cards to simplify tax payment for businesses owners, particularly those in the informal sector.\nIn a statement, Head, Corporate Communications, EIRS, Courage Eboigbe, said: “The Revenue Scratch Card is part of the Edo Revenue Administration System (ERAS) mobile payment solution, which caters for individual businesses and ensures financial inclusion of the informal sector by recognizing each taxpayer who cannot obtain a tax clearance documentation.\n“With the use of the revenue scratch cards, taxpayers get instant notifications and receipts on transactions made.\nIt further enables taxpayers make payments from the comfort of their business premises, which eliminates waste of time and unnecessary bank queues.”He added that “Individual taxpayers are expected to purchase the face value of the Revenue Scratch Cards from EIRS licensed and approved dealers and their vendors.”The statement further enjoined taxpayers to always ensure purchased cards are processed and receipted by approved and designated Revenue Collectors (RCs) with a unique Point of Sale (PoS) device."
  },
  {
    "headline": "Omega Ministry church pastor beat wife to death in Akwa Ibom – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestA 49-year old Pastor, Ukachukwu Christopher, the General Overseer of Omega World Global Ministry (Fellowship Church) beat wife, Patience, 40, to death and secretly buried her corpse in a shallow grave in his compound.\nThe incident was learnt to have happened at Ikot Abia village in Eket Local Government area, Akwa Ibom State, where his Church is located.\nThe Police Public Relation Officer, Akwa Ibom command, SP Odiko Macdon who confirmed the incident disclosed that Police operatives from the State have arrested Christopher, detained him and he is undergoing interrogation over the alleged murder.\nIn other to cover his tracks, he dug a shallow grave in his compound and buried her.\nThe Commissioner of Police Akwa Ibom State, Andrew Amiengheme, has ordered the Deputy Commissioner of Police in-charge of the State Investigation and Intelligence Department to take over the matter for discreet investigation and assured that the suspect will be charge."
  },
  {
    "headline": "Obaseki reforms: Air Peace expands operations to Benin-Port Harcourt route – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWith the upgrade of facilities at the Benin Airport, supported by the Governor Godwin Obaseki-led administration, Nigeria’s biggest domestic carrier, Air Peace, has commenced operations on the Benin-Port Harcourt route.\nThe development is sequel to the expansion of airline operations at the airport, with Azman Air and Max Air commencing operations, in addition to the presence of Air Peace, Aero Contractors and Arik Air.\nAn official at the Benin Airport, who requested anonymity because he was not authorized to speak to the press, said the new route is strategic as it would provide a lifeline to people who would have been stuck on the deplorable East-West Road to Benin.\n“The new route is strategic and a welcome development.\nThe Governor Obaseki-led administration was instrumental to the upgrade of the airport, with support to install instrument landing and night landing equipment at the facility."
  },
  {
    "headline": "Edo State Govt assures SACA of collaboration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestENIN CITY – Edo State government has assured of its commitment in view of partnering with the Edo State Action Committee on Aids (SACA) in its drive towards mitigating the spread of HIV/AIDS in the state.\nThe Permanent Secretary, Edo state Ministry of Communication and Orientation, Mr. Joses Sede gave the assurance when he played host to the team of SACA who were on a courtesy visit to the Ministry yesterday in Benin city.\nWhile appraising SACA’s roles towards cushioning the spread of HIV disease in the society, which he said were in line with the state governor, Godwin Obaseki’s vision of making Edo state great again, Joses said the present administration was committed towards restoring the dignity of the state, hence the Make Edo State Great Again ( MEGA).\nAcknowledging that Edo State had always been rated top since Midwest era, the PS charged the good people of Edo State on the need to strengthen their cooperation with the state governor towards moving the state to enviable height.\nShe thanked the PS for granting them audience to acquaint the Ministry with SACA’s activities in the state and appealed for continuous collaboration."
  },
  {
    "headline": "Nigerian soldiers foil Boko Haram attack, kill six terrorists – Official",
    "summarized_story": "ADVERTISEMENTThe Nigerian Army has announced that soldiers, on Sunday, foiled an attack by Boko Haram terrorists on Kumshe town of Borno State.\nThe latest incident occurs a few weeks after the Nigerian army announced the killing of over 50 terrorists in another operation.\nIn the statement on Sunday, the army spokesperson said at least six of the terrorists were killed during the encounter.\nHe added that six AK 47 rifles were recovered alongside one hand held grenade, assorted drugs and other medical items.\nOPERATION HADIN KAI: TROOPS FOIL BOKO HARAM ATTACK IN KUMSHE TOWN…neutralise terroristsTroops of Joint Task Force North East Operation HADIN KAI (OPHK) deployed at the Forward Operational Base (FOB) of 152 Battalion, Kumshe on Sunday, 20 June 2021 gallantly dealt with elements of Boko Haram terrorists (BHTs) on a suicidal infiltration attempt into the camp."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "NAHCON To Adopt Malaysian, Indonesian Hajj Models",
    "summarized_story": "AdvertisementsThe chairman of the Hajj Commission, Alh Zilkrullah Kunle Hassan, disclosed this while speaking to Hajj correspondents in Abuja.\n“Muslims all over the world were given limited opportunities to perform lesser Hajj (Umrah) this year and were hopeful up to the last minute that Hajj would take place this year.\nSo, since it has happened we are committed to face the future with hope, trusting God that it will be the last time such will happen that our people would not be able to perform Hajj.\nIn fact, in Malaysia and Indonesia, some people are registered to perform Hajj from day of birth in order to make Hajj something they can do before their old age.\nA child given birth in Malaysia would be registered in the Hajj Saving Scheme of the country so that he or she can perform Hajj before he or she becomes too old."
  },
  {
    "headline": "NAHCON To Adopt Malaysian, Indonesian Hajj Models",
    "summarized_story": "AdvertisementsThe chairman of the Hajj Commission, Alh Zilkrullah Kunle Hassan, disclosed this while speaking to Hajj correspondents in Abuja.\n“Muslims all over the world were given limited opportunities to perform lesser Hajj (Umrah) this year and were hopeful up to the last minute that Hajj would take place this year.\nSo, since it has happened we are committed to face the future with hope, trusting God that it will be the last time such will happen that our people would not be able to perform Hajj.\nIn fact, in Malaysia and Indonesia, some people are registered to perform Hajj from day of birth in order to make Hajj something they can do before their old age.\nA child given birth in Malaysia would be registered in the Hajj Saving Scheme of the country so that he or she can perform Hajj before he or she becomes too old."
  },
  {
    "headline": "Buhari Agree With Dialogue Option As Solution To South-East Crises – Ngige",
    "summarized_story": "Minister of Labour and Employment, Senator Chris Ngige, at the weekend met with President Muhammadu Buhari over the worrying security situation in the South-East.\nAdvertisementsSpeaking to State House correspondents after the meeting at the presidential villa, Ngige said he made a dialogue proposal to the president and the latter has accepted.\n“And we are following up with dialogue which at the end of the day is what will happen.\nWe achieved a truce, through an agreement and we have to, today, summit his own copies of Agreement to him.\n“We also looked at the Kaduna State government/Nigeria Labour Congress imbroglio."
  },
  {
    "headline": "Buhari Agree With Dialogue Option As Solution To South-East Crises – Ngige",
    "summarized_story": "Minister of Labour and Employment, Senator Chris Ngige, at the weekend met with President Muhammadu Buhari over the worrying security situation in the South-East.\nAdvertisementsSpeaking to State House correspondents after the meeting at the presidential villa, Ngige said he made a dialogue proposal to the president and the latter has accepted.\n“And we are following up with dialogue which at the end of the day is what will happen.\nWe achieved a truce, through an agreement and we have to, today, summit his own copies of Agreement to him.\n“We also looked at the Kaduna State government/Nigeria Labour Congress imbroglio."
  },
  {
    "headline": "JUST-IN: Troops Foil Terrorist Attack On Kumshe Town, Kill 6",
    "summarized_story": "The Nigerian Army has said that troops of Operation HADIN KAI (OPHK) in the North-East deployed at the Forward Operational Base (FOB) of 152 Battalion Kumshe, on Sunday, foiled attack and killed six terrorists.\nAdvertisementsThe director, Army Public Relations, Brig Gen Onyema Nwachukwu, said the terrorists mounted on four Gun Trucks and several motorcycles attempted to infiltrate and attack the camp through the northern part of the troops’ deployment.\nHe said the troops engaged the terrorista with fierce fire resulting in the instant killing of six Boko Haram Terrorists.\nHe said while the terrorists withdrew in total disarray, the troops captured six AK47 Rifles, one hand held grenade, assorted drugs and other First Aid items.\nThe Chief of Army Staff, Major General Faruk Yahaya, who lauded the troops’ high level of alertness and fighting spirit, urged them to sustain the momentum and ensure that the remnants of terrorists hibernating in the area are completely cleared."
  },
  {
    "headline": "Breaking: Army rescues more kidnapped Kebbi students, kill bandit",
    "summarized_story": "The Nigerian Army has confirmed the rescue of more students of the Federal Government College, Yauri, Kebbi State who were kidnapped by bandits on Thursday.\nNaija News reports one teacher and three students have been freshly rescued by the military from the custody of the bandits.\nREAD ALSO: Police arrest bandit, recover AK47 rifle in KadunaThe Army statement reads: “Troops of the Nigerian Army operating under the auspices of Operation HADARIN DAJI supported by Nigerian Air Force component have rescued more abductees of the FGC Birnin Yawuri.\nOne teacher and three students were rescued yesterday at Makuku, in the ongoing search and rescue operations.\nMeanwhile, the Nigerian Air Force (NAF) on Sunday bombed dozens of Islamic State West Africa Province (ISWAP) terrorists in Lamboa in Kaga Lga of Borno State."
  },
  {
    "headline": "Lagos police to trail killers of TV mogul & billionaire, Usifo Ataga found dead in a hotel",
    "summarized_story": "The Lagos State Command has said that its operatives are on the trail of the killers of the Chief Executive Officer of Super TV, and billionaire, Usifo Ataga, who was found dead in his apartment in Banana Island area of the state.\nIt was learnt that the owner of the apartment rented out to the late CEO has been arrested and currently in police detention.\nSources familiar with the incident had confirmed the death of Ataga, who was murdered last week.\nAfter efforts to get across to his office and colleagues proved abortive, security agents tracked him to the Lekki apartment.\nThe Lagos State Commissioner of Police, Hakeem Odumosu, said while his men are still on the trail of the lady who reportedly carried out the act, the apartment’s owner is in detention."
  },
  {
    "headline": "Nigerian man & his 2 kids who died in South Africa laid to rest",
    "summarized_story": "A Nigerian man and his two children who died in South Africa have been buried.\nThe remains of the 42-year-old man, Ifeanyichukwu Mba and his two sons, Uchenna, 6, and Chinedu, 1 year and 4 months, have been laid to rest.\nIfeanyi from Enugu State and his children were killed in a fatal car accident in Port Elizabeth, Eastern Cape, South Africa on Monday night, March 22.\nHis wife, Nomabandla Mbah, 33, was the only survivor in the accident.\nREAD ALSO: 2023: South East should produce the President – Shehu SaniThe family had been travelling along the N2, near Bluewater Bay, when their car veered off the road and hit a barrier."
  },
  {
    "headline": "Joe El opens up on how he has been fighting bandits in his dreams since father’s death",
    "summarized_story": "Popular Nigerian singer Joel Amadi, popularly known as Joe El, has revealed that he still battles with the trauma almost a year after the death of his father.\n“Since my dad’s demise, anytime I sleep, even if it’s a 30 minutes nap, I see myself in a dream battling with bandits or herdsmen.\nI am the only son and have to take care of three grown women (sisters and mum).\nAnytime I look around and see that my dad is not around, it makes me feel very miserable.\n“Although they may not be currently making waves like they used to, it does not mean we should disrespect their previous works."
  },
  {
    "headline": "CSOs petition Senate, reject nomination of Onochie as INEC Commissioner",
    "summarized_story": "A coalition of civil societies has written a petition to Senate President, Ahmad Lawan against the nomination of Mrs. Lauretta Onochie as a National Commissioner for the Independent National Electoral Commission to represent the South – South in the commission.\nPresident Buhari forwarded the name of Ms Onochie and five others to the Senate in October 2020 for confirmation as INEC national commissioners.\nThe Senate President on June 9, directed the Senate committee on INEC to screen Ms Onochie and five other nominees.\nIn the petition, dated June 16 and addressed to the Chairman of the Senate Committee on INEC, Kabiru Gaya, the CSOs referred to Section 156(1)(a) of the 1999 Constitution which mandates that a person nominated as an INEC National Commissioner should be non-partisan.\nThe CSOs, in the petition, noted that Ms Onochie is a card-carrying member of the ruling All Progressives Congress (APC) and a Special Assistant to President Buhari on social media."
  },
  {
    "headline": "CSOs petition Senate, reject nomination of Onochie as INEC Commissioner",
    "summarized_story": "A coalition of civil societies has written a petition to Senate President, Ahmad Lawan against the nomination of Mrs. Lauretta Onochie as a National Commissioner for the Independent National Electoral Commission to represent the South – South in the commission.\nPresident Buhari forwarded the name of Ms Onochie and five others to the Senate in October 2020 for confirmation as INEC national commissioners.\nThe Senate President on June 9, directed the Senate committee on INEC to screen Ms Onochie and five other nominees.\nIn the petition, dated June 16 and addressed to the Chairman of the Senate Committee on INEC, Kabiru Gaya, the CSOs referred to Section 156(1)(a) of the 1999 Constitution which mandates that a person nominated as an INEC National Commissioner should be non-partisan.\nThe CSOs, in the petition, noted that Ms Onochie is a card-carrying member of the ruling All Progressives Congress (APC) and a Special Assistant to President Buhari on social media."
  },
  {
    "headline": "Kidnapping: Kebbi shuts seven schools indefinitely",
    "summarized_story": "Because Principals are teachers, all the Directors at the Board are also teachers.\n“Government has given us an order and option to take any necessary action as far as our schools are concerned.\n“Some of these schools that I am talking about have policemen attached to them, honestly, we are satisfied with government actions”, he said.\nAlready, seven schools on the frontline in that area have been closed and more will be closed, if we realise the situation is not safe for the teachers and students.\n“It was yesterday (Friday) that the security agencies swung on them and since then there was no contact again”."
  },
  {
    "headline": "Kidnapping: Kebbi shuts seven schools indefinitely",
    "summarized_story": "Because Principals are teachers, all the Directors at the Board are also teachers.\n“Government has given us an order and option to take any necessary action as far as our schools are concerned.\n“Some of these schools that I am talking about have policemen attached to them, honestly, we are satisfied with government actions”, he said.\nAlready, seven schools on the frontline in that area have been closed and more will be closed, if we realise the situation is not safe for the teachers and students.\n“It was yesterday (Friday) that the security agencies swung on them and since then there was no contact again”."
  },
  {
    "headline": "Battle of Kumshe: Six Boko Haram terrorists gunned down, six AK-47 recovered",
    "summarized_story": "By Kazeem UgbodagaNigerian troops have gunned down six Boko Haram terrorists as the insurgents attempted to invade Kumshe Town in Borno, Northeast Nigeria.\nTroops of Joint Task Force North East Operation HADIN KAI (OPHK) deployed at the Forward Operational Base (FOB) of 152 Battalion engaged the terrorists in a gun-battle and repelled them from entering the Town.\nArmy spokesman, Brigadier General Onyema Nwachukwu, in a statement late Sunday night said on Sunday, 20 June 2021 the troops gallantly dealt with elements of Boko Haram terrorists (BHTs) on a suicidal infiltration attempt into the camp.\nHe said the terrorists mounted on four Gun Trucks and several motorcycles attempted to infiltrate and attack the camp through the northern part of the troops’ deployment, but were met with the fierce fire of the highly alert troops, resulting in the instant killing of six terrorists.\n“The Chief of Army Staff, Major General Faruk Yahaya has lauded the troops’ high level of alertness and fighting spirit, urging them to sustain the momentum and ensure that the remnants of terrorists hibernating in the area are completely cleared,” he said."
  },
  {
    "headline": "One bandit killed as troops rescue more kidnapped students of Kebbi College",
    "summarized_story": "By Kazeem UgbodagaNigerian troops have gunned down one bandit and rescued more kidnapped students and teacher of Federal Government College, Birnin Yauri, Kebbi state.\nThe army had on Friday rescued five students and three teachers after a gun-duel with the bandits while one student died.\nNwachukwu disclosed that the troops killed one bandit and recovered nine motorcycles and four handsets from the fleeing bandits.\n“One teacher and three students were rescued yesterday at Makuku, in the ongoing search and rescue operations.\nThe troops also killed one bandit and recovered nine motorcycles and four handsets from the fleeing bandits."
  },
  {
    "headline": "JUST IN: Crazy Policeman shoots 5 dead, injures 4 in Enugu",
    "summarized_story": "By Stanley NwanosikeA police inspector attached to a lotto company in Enugu went berserk today as he attacked a compound, shot five persons dead and injured gravely another four.\nThe Police Command in Enugu State confirmed the gun violence in Golf Estate, GRA in the metropolis.\nIt said the attack took place at about 9:30a.m, sending shockwaves down the usually quiet Enugu metropolis.\nIn a statement issued by the command’s Police Public Relations Officer, ASP Daniel Ndukwe, Aliyu said investigation has begun.\nIn a separate statement, Governor Ugwuanyi expressed shock over the dastardly act."
  },
  {
    "headline": "[BREAKING] Kebbi Abduction: Army Rescue More Students, Kill Bandit",
    "summarized_story": "More students from the Federal Government College in Yauri, Kebbi State, were kidnapped by bandits on Thursday, according to the Nigerian Army.\nOne instructor and three students were just freed from the bandits’ custody by the military.\nBrigadier-General Onyema Nwachukwu, Director Army Public Relations, confirmed the news to NEWS DIRECT in a statement on Sunday.\nThe Army statement reads: “Troops of the Nigerian Army operating under the auspices of Operation HADARIN DAJI supported by Nigerian Air Force component have rescued more abductees of the FGC Birnin Yawuri.\n“One teacher and three students were rescued yesterday at Makuku, in the ongoing search and rescue operations."
  },
  {
    "headline": "JUST IN: NAF Bombs ISWAP Chief, Modu Responsible For Killing Shekau",
    "summarized_story": "On Sunday, the Nigerian Air Force (NAF) killed dozens of Islamic State West Africa Province terrorists in Lamboa, Borno State’s Kaga Local Government Area.\nMultiple airstrikes by Alpha-Jets, L-39, and MI-35 helicopters targeted a well-known terrorist, Modu Sulum, and others.\nSulum, the ISWAP Logistics Commander, was present when Abubakar Shekau, the Boko Haram factional commander, was killed in May.\nAfter the NAF reconnaissance platform flew over the location to check the objectives, ground and air troops canceled their mission.\nWith the assumption of office of Major General Chris Musa, the New Theatre Commander Operation Hadi Kai, military offensives have increased."
  },
  {
    "headline": "BREAKING: President Buhari Mourns Death Of Alade",
    "summarized_story": "President Muhammadu Buhari has expressed his condolences to Chief (Arc) Isaac Folayan Alade’s family and friends upon his death.\nPresident Buhari lauded Alade, saying that his stamp on the country’s renowned structures will inspire future architects from within and outside the country, leaving a legacy of genius and diligence.\nThe President joins the Nigerian Institute of Architects, the Royal Institute of British Architects, and the Architects’ Registration Council of the United Kingdom in mourning the first architect to serve as a Permanent Secretary in Nigeria, as well as Pro-Chancellor and Chairman of the Federal University of Port Harcourt’s Governing Council.\nHe expressed his condolences to the government and people of Ekiti State, believing that Chief Alade’s contributions to the country’s development in design, construction, and administration, particularly historic structures such as the National Stadium Lagos, Tafawa Balewa Square (TBS), Federal Secretariat Lagos, and Nigerian Institute of Policy and Strategic Studies, will be remembered by posterity."
  },
  {
    "headline": "The Oil In Nigeria Was Discovered With Northern Nigerian Money – Northern Group Says They Are Not Parasites",
    "summarized_story": "Awwal Abdullahi Aliyu, the president of the NCM, remarked that, contrary to common assumption, Nigeria’s northern region is the country’s economic heart.\nHe said that Northern Nigerians discovered and constructed the oil and refineries that can now be found in other parts of the country.\nHe urged the federal government to establish a Northern Development Ministry, which would be funded in the same way as the Niger Delta Development Commission (NDDC).\nAnd nobody can address us as parasites, we are the economic heart of Nigeria.\nThe oil that is so being busted on today were discovered, harnessed, and the refineries were constructed with Northern Nigerian sweat, with the Northern Nigerian money with the Northern Nigerian economy."
  },
  {
    "headline": "29 bandits killed in Benue, Niger gunfire, NAF shells terrorists, neutralise scores in Borno",
    "summarized_story": "Fourteen bandits were Sunday morning gunned down during an attack on Police Station in Katsina-Ala, Benue state.\nShe said: “It is no longer news that series of operations are going on in Kastina-Ala Local Government Area of Benue State.\nNAF shells terroristsAlso in yet another victory over the criminal elements, the fighter aircraft of the Nigerian Air Force (NAF) Sunday eliminated scores of ISWAP-Boko Haram terrorists, including their commanders in Lamboa in Kaga local government area of Borno state.\nBut the terrorists were swiftly engaged by ground and air troops, who foiled their missions after the NAF reconnaissance platform had earlier hovered over the location before the airstrikes.\n“Currently, the ground troops of the Nigerian Army and our air elements are mopping up the area and assessing the situation."
  },
  {
    "headline": "Kebbi shuts schools after Birnin Yauri kidnapping",
    "summarized_story": "Kebbi state government has indefinitely shut down seven schools in the wake of the armed attack of Federal Government College, Birnin Yauri Thursday, the Nigerian Union of Teachers has confirmed.\nThe schools are located on the frontlines of the areas prone to bandit attacks.\n“Government has given us an order and option to take any necessary action as far as our schools are concerned.\n“Some of these schools that I am talking about have policemen attached to them, honestly, we are satisfied with government actions”, he said.\n“It was yesterday (Friday) that the security agencies swung on them and since then there was no contact again”."
  },
  {
    "headline": "FGC Yauri abduction: Why Kebbi chose not to negotiate with bandits",
    "summarized_story": "Four days after the abduction of some unspecified number of students of Federal Government College (FGC), Birnin Yauri, Kebbi state, the state government has refused to negotiate with the bandits, a decision that appears a departure from the past.\nWhile seven were rescued Friday, 4 regained their freedom Sunday courtesy of the troops, other security agencies and vigilantes.\nOur security agents deserve a lot of commendation in the handling of this.\n“Give it to them, the security agents are humans and not spirits, so they were overpowered.\nBut the good thing is that they (security agents) didn’t stop at that."
  },
  {
    "headline": "CSO petitions EFCC, bank for disobeying court order -NigPilot",
    "summarized_story": "Civil Society Organizations in Defence of Justice has expressed disappointment against the continued disobedience of court order by the Economic and Financial Crimes Commission EFCC and the first generation bank.\n“In 2013, 10 staffs who initially subscribed to the purchase of the 2.5 equity shares had their jobs terminated from the employment of Indorama Eleme Petrochemicals.\n“The judgement affirmed the laid off staffs as the authentic owners of the shares.\n“This act continued until Justice Taiwo .O.Taiwo of the Federal High Court in Suit FHC/ABJ/SC/1222/2020 granted an Order stopping the EFCC from arresting, inviting, detaining and prosecuting or inquiring into the acquisition of shares of Indorama Petrochemicals.\nOther demands includes that First Bank of Nigeria, without further delay should honour the order of the court and grant access to the funds in its custody."
  },
  {
    "headline": "2021 UTME: Education Minister commends officials for best practices -NigPilot",
    "summarized_story": "Minister of State for Education, Dr. Chukwuemeka Nwajiuba, has expressed satisfaction with the conduct of the Joint Admission and Matriculation Board, JAMB , officials for displaying what he described as best standards in the 2021 Unified Tertiary Matriculation Examination, UTME.\nThe minister gave the commendation during his inspection visit to some Computer Based Test, CBT, centers in Lekki, Lagos State, yesterday.\nDr. Nwajiuba noted that his visit was to have an on-the-spot assessment on the conduct of the examination and also to ascertain how the candidates are coping with the CBT examination which he said, conforms with the international best practices on Information Communication Technology.\nHe was accompanied by Senator Frank Ibezim, (Imo North), and other members of the Senate Committee on Basic Education."
  },
  {
    "headline": "NAF working steadily in right direction -NigPilot",
    "summarized_story": "When the Chief of the Air Staff, Air Marshal Isiaka Oladayo Amao hinted of a new and renewed synergy in the Nigerian military setup, most of us doubted its workability.\nA keen observer will note that in the past the different arms of the military seem to be working to restore peace without collaboration.\nJust last week, the Nigerian Army troops in conjunction with elements of the Nigerian Air Force rescued some of the abducted teachers and students of Federal Government College, Birnin Yauri.\nThis is not to mention numerous positive results being recorded across the country, with NAF playing a key role.\nBefore him, the Kano State Governor, Abdullahi Ganduje came calling too and lauded NAF for it’s role in fighting crime in the state."
  },
  {
    "headline": "JAMB begins 2021 UTME nationwide -NigPilot",
    "summarized_story": "Nigerian Pilot gathered that about 1, 338, 687 candidates registered for the 2021 UTME which started today, 19th June, 2021,across the nation, while about 75,328 candidates successfully registered for Direct Entry.\nA visit to some of the JAMB approved Computer Based-Test, CBT , centres around Federal Capital Territory, FCT, revealed that there were more suiting arrangements in this 2021 UTME than what it used to be previously.\nSpeaking to our correspondent, a parent, Mr. Ogbonna Ugochukwu who came along with his son at Digital Bridge Institute said, ” This year’s JAMB exam is more organised than before.\nThere was no case of malpractice or system failure.To me, this is a great feet that JAMB has achieved so far.\nOn the parts of the candidates, especially those who had sat for UTME in the previous years, said there was no stress locating their centres , capturing their biometrics, and operating computer during the 2021 UTME."
  },
  {
    "headline": "Senator Blames Poor Security Arrangement For Kebbi School Abduction",
    "summarized_story": "﻿The Senator Representing Kebbi North, Yahaya Abdullahi, has blamed what he describes as a poor security arrangement in the country for the Kebbi School abduction.\n“If there were enough men on the ground like about 100 well-armed policemen, this kind of thing would not be happening”.\n“These things have their roots in the very serious security architecture that we inherited over a long period of time.We have to look at these issues from a historical perspective,” he added.\nRead Also: Kebbi School Abduction: Troops Rescue Another Teacher, Three StudentsSenator Abdullahi, however, noted that while the issue did not start with the All Progressives Congress (APC), hopefully, it will end with the party.\nThe incident is the latest in a series of increasing school abductions across the country."
  },
  {
    "headline": "President Buhari Initiating Dialogue With South-East Leaders – Ngige",
    "summarized_story": "﻿President Muhammadu Buhari has affirmed that dialogue is the way to go to resolve the security situation in the south-east.\nThis is according to the Minister of Labour and Employment, Senator Chris Ngige, after a meeting with President Muhammadu Buhari on Sunday, alongside the President’s Chief Of Staff, Prof. Ibrahim Gambari.\nAddressing state house correspondents after the meeting, Senator Ngige said the President has also enabled series of dialogues to be held with leaders in the region.\nMeanwhile, members of the South East Governors’ Forum have condemned the activities of secessionist groups in the region and other parts of the country.\nIn a bid to tackle the security challenges and restore peace in the region, the governors went beyond their political differences and met on Saturday in Enugu State."
  },
  {
    "headline": "Kebbi School Abduction: Troops Rescue Another Teacher, Three Students",
    "summarized_story": "A statement signed on Sunday by the Director Army Public Relations, Brigadier General Onyema Nwachukwu, disclosed that one teacher and three students were rescued on Saturday at Makuku in the ongoing search and rescue operations.\nAccording to the statement, the troops also killed one bandit, recovered nine motorcycles and four phones from the fleeing bandits.\nTwo teachers and five students had been rescued on Friday by the gallant troops in a coordinated firefight with the kidnappers.\nBandits had attacked the school in the early hours of Thursday, whisking away a yet to be confirmed number of students and teachers.\n“In the early hours of this morning, we have come across the kidnappers."
  },
  {
    "headline": "14 Killed As Bandits Attack Police Station In Benue",
    "summarized_story": "Police authorities in Benue State say 14 bandits were killed following an attempted attack on a police station on Sunday morning.\nA spokesperson for Benue police, Catherine Anene, said in a statement that the gunmen numbering about 50 launched an attack in early hours of Sunday on a police station at Katsina-Ala town of the state, in a bid to free some suspected bandits who were arrested by police on Saturday and detained in the station.\nREAD ALSO: Law Enforcement Officer, 6 Others Arrested For Dealing In DrugsAnene said, “Operatives at the police division, who were already on alert, engaged the attackers in a fierce gun battle,” adding that 14 of the gunmen were killed at the end of the gun duel while others escaped with bullet wounds.\nAccording to her, operatives of the force are on the trail of the fleeing bandits and urged local residents to assist the police with useful information that would lead to arrests.\nIn recent times, bandits have been terrorizing parts of Nigeria, especially the Northeast and Northcentral region, with Benue being one of the worst-hit states."
  },
  {
    "headline": "Kaduna Security: Bandits Kill Village Head In Sanga LGA",
    "summarized_story": "The village head of Dogon Daji community in Sanga Local Government Area of Kaduna State, Mallam Anja, has been shot dead by bandits.\nThe bandits were said to have raided the residence of the village head and shot him at close range, after which he died on the spot.\nConfirming the incident, the state Commissioner for Internal Security and Home Affairs, Samuel Aruwan, said investigation into the incident is ongoing to unravel the perpetrators of the heinous act.\nRead Also: President Buhari Initiating Dialogue With South-East Leaders – NgigeMeanwhile, Governor Nasir El-Rufai has expressed sadness over the death of the village head and prayed for the repose of his soul.\nThe governor also sent his condolences to the family of the deceased, and the entire community of Dogon Daji over the shocking and brutal killing."
  },
  {
    "headline": "Birnin Yauri School Abduction: Nigeria Army Rescue More Students",
    "summarized_story": "Troops of the Nigerian Army operating under the Operation HADARIN DAJI supported by Nigerian Air Force component have rescued more abductees of the Federal Government College Birnin Yawuri.\nOne teacher and three students were rescued at Makuku, in the ongoing search and rescue operations.\nThe troops also killed one bandit and recovered nine motorcycles and four mobile phone from the fleeing bandits.\nA statement signed by the Director Army Public relations Brigadier General Onyema Nwachukwu says additional troops have also been deployed to dominate the forest and deny the bandits freedom of action.\nRecall that two teachers and five students were earlier on Friday 18 June 2021 rescued by the gallant troops in a coordinated fire fight with the kidnappers."
  },
  {
    "headline": "Wife of late Adeseun Ogundoyin presents gifts to over 500 widows in Ibarapa",
    "summarized_story": "Though , I take solace in the fact that late Chief Adeseun Oguntona Ayisa Ogundoyin lived a fulfilled life and he is resting in the bosom of our Lord.\nMy late husband was an easy going and accessible person who was ever ready to extend hands of love and fellowship to the people.\n” Chief Tina Ogundoyin saidThe wife, who is the Iyaloja of Ibarapaland assured the people that the family of Late Chief Ogundoyin will always make themselves available for the peace and development of the entire zone.\nThe two Clerics described late Chief Adeseun Ogundoyin as a beacon of hope for the people during his sojourn on the mother earth.\nAdvertisementThe 30years remembrance programs also featured a visit to the tomb of Late Chief Adeseun Ogundoyin at Estate by his Children and family members including the Speaker, Oyo State House of Assembly, Hon Adebo Ogundoyin, his other siblings Adesoji, Adetoye and Aderemi Ogundoyin."
  },
  {
    "headline": "Oyo Speaker Adebo presents gifts to widows, physically challenged in memory of Father Adeseun Ogundoyin",
    "summarized_story": "The late Philanthropist, Business Mogul, Community and Political Leader, Chief Adeseun Oguntona Ayisa Ogundoyin, the father of the Oyo State Speaker, who died 30 years ago, was honored by prominent indigenes of Eruwa and Lanlate in the Ibarapa East Local Government.\nIn his Constituency, the Speaker, Hon Adebo Ogundoyin, displayed and emulated his late father’s good nature and gesture by donating food and clothing to over a thousand widows, poor, and individuals with special needs.\nAccording to Hon Ogundoyin, the Late Adeseun Ogundoyin had great love for the people of Eruwa, Lanlate and indeed Ibarapaland, and he lived his entire life to serve the people.\nOver one thousand widows, indigent and people with special needs were presented with foodstuffs and clothes at the 30years remembrance programme.\nOther siblings of the Speaker, Adesoji, Adetoye and Aderemi Ogundoyin attended the remembrance programme."
  },
  {
    "headline": "Nigeria: NADECO Calls For Election Cancellation, Demands Return to Independence Constitution",
    "summarized_story": "Nigeria’s pro-democracy group, National Democratic Coalition (NADECO) has called for the cancellation of further elections in the country under the 1999 Constitution.\nThe group said democratic elections in Nigeria should only be considered after a return to the negotiated 1960 and 1963 Federal Constitutions to which citizens subscribed at independence and when the country became a Republic.\nNADECO in an open letter to Nigeria’s President Muhammadu Buhari accused the country’s leader of dealing with the Fulanis specially which has led to various discomfort experienced by regional groups.\n“Perhaps, better put, NADECO should be wondering whether because the President is the Patron of the Fulani Herdsmen and Cattle Traders, (Miyetti Allah) land owners’ rights must be suspended in awe of such trespassers!\nBy Abel Ejikeme"
  },
  {
    "headline": "Finally, Emirates Concedes as Nigerians Can Now Travel Directly to Dubai",
    "summarized_story": "Emirates Airlines will resume flights to Nigeria from June 23, five months after it banned outbound flights from Abuja and Lagos.\nBesides the new condition for Nigerian travellers, UAE has new regulations for passengers travelling from South Africa and India to Dubai.\n“Passengers must present a negative test result for a PCR test taken within 48 hours before departure; UAE citizens are exempted.\nAll passengers must undergo a PCR test on arrival at Dubai airport.\nWe travel agents also paid a huge price because if Emirates flights were operating, we would have made money; we wouldn’t have been at the state we are now financially."
  },
  {
    "headline": "Buhari Canvasses Stronger Pressure on Mali to Return to Civil Rule",
    "summarized_story": "President Muhammadu Buhari has called on West African leaders to exert more pressure on the military leadership in Mali to ensure that the transition process in the country is not aborted.\nMali was recently suspended from the regional bloc due to a military coup in the country.\nPressures are needed to ensure that the transition process in Mali, which is halfway to its conclusion, is not aborted.\nOn Libya, Buhari faulted the recent United Nations resolution to expel all foreign fighters in Libya without first ensuring that they were disarmed.\nThis positive action will certainly enable our organisation move on and deliver services to the satisfaction of our Community citizens."
  },
  {
    "headline": "Nigeria: Anti-graft Chair Bawa Says EFCC Won’t Hand Over Cases to States",
    "summarized_story": "Chairman of the Economic and Financial Crimes Commission (EFCC), Mr. Abdulrasheed Bawa, has declared that the commission, under his leadership, would not hand over cases of interest to any state government.\nSome of the states envisage that the EFCC would hand over corruption cases concerning their states to the local anti-corruption commissions.\nBut those laws do not contain anything that says that EFCC has nothing to do with investigating their states, they would rather be complementing what the EFCC is doing.\n“There are a lot of Supreme Court decided cases on this particular issue.\nWe have 90 per cent to 95 per cent success rate in court on the cases that we have charged."
  },
  {
    "headline": "Nigeria: Abducted Kebbi Students May Have Been Rescued as Scores of Bandits Killed",
    "summarized_story": "Bandits, on Thursday, kidnapped at least 80 students and five teachers from the Federal Government College, Birnin Yauri, Kebbi State, killing a police officer in the process.\nKebbi State police spokesman Nafiu Abubakar, confirmed that the gunmen killed one of their officers during an exchange and also shot a student, who had since been receiving medical treatment at an undisclosed hospital.\nThe Kebbi State Police Command further claimed that the vehicle used to convey the kidnapped students and teachers belonged to an unnamed High Court judge in the state.\n“When we got there, we saw students crying, teachers crying, everyone is sympathising with people,” he also said to Reuters.\nMore than 800 students were believed to have been taken from their schools in the region since December."
  }
]