[
  {
    "headline": "Maritime security: UK ship sails for Nigeria, Ghana, three others",
    "summarized_story": "Royal Navy patrol ship HMS Trent is sailing to the waters of the Gulf of Guinea for security patrols and a mission to support allies in West Africa.\nThe River-class patrol ship will visit Nigeria, Ghana, Senegal, Gambia and Cape Verde, and will take part in French-led multinational training exercises that will bring together international partners in the region, known as Exercise Grand African Nemo.\nThe statement quoted the UK’s Armed Forces Minister, James Heappey as saying that “This deployment shows the Integrated Review in action.\n“HMS Trent will attend the Friends of the Gulf of Guinea G7++ conference in Dakar, which the UK is co-chairing with hosts Senegal.\nBritain established the group in 2013 as part of the then G8 to coordinate regional maritime security efforts,” the statement said."
  },
  {
    "headline": "Counter-secessionist groups will rise in South-East if IPOB doesn’t stop killings –Umahi",
    "summarized_story": "Ebonyi State Governor and Chairman of the South-East Governors’ Forum, Dave Umahi, says counter-secessionist groups will rise in the South-East geopolitical zone if the proscribed Indigenous People of Biafra does not call its members to order and stop the threats and killings.\nThe governor also vowed that the South-East zone won’t be turned to a killing field and grounded by secessionist agitators.\nUmahi said, “The separatist groups, we know of IPOB, we know of MASSOB.\n“So, this idea of Biafra, Biafra is madness and we have said, ‘No’, we don’t want Biafra,” Umahi stated.\nThe IPOB leader later left the country and operated from overseas until he was re-arrested in June 2021."
  },
  {
    "headline": "Evans Akere: Innovating African Traditional Wear",
    "summarized_story": "Words By – Yemisi SuleimanSince launching his fashion line, Creative Director and CEO of Vanskere, Evans Akere, has become one of the major brands saddled with the responsibility of making African traditional wear acceptable worldwide.\nHow did the VANSKERE brand come to be and how has the brand evolved over the years?\nThe brand has evolved over the years from a basic fashion brand, to a Luxury fashion brand, with emphasis on modern African traditional wear.\nThe Vanskere brand is fun, but there is also a classic appeal to your apparel.\nYou have worked in the fashion industry for quite some years now, what is the best lesson you have learned along the way?"
  },
  {
    "headline": "Evans Akere: Innovating African Traditional Wear",
    "summarized_story": "Words By – Yemisi SuleimanSince launching his fashion line, Creative Director and CEO of Vanskere, Evans Akere, has become one of the major brands saddled with the responsibility of making African traditional wear acceptable worldwide.\nHow did the VANSKERE brand come to be and how has the brand evolved over the years?\nThe brand has evolved over the years from a basic fashion brand, to a Luxury fashion brand, with emphasis on modern African traditional wear.\nThe Vanskere brand is fun, but there is also a classic appeal to your apparel.\nYou have worked in the fashion industry for quite some years now, what is the best lesson you have learned along the way?"
  },
  {
    "headline": "Abike Dabiri-Erewa: On Nigeria @ 61",
    "summarized_story": "So, yes, Nigeria is not where it should be at 61, but gradually, we will get there.\nI don’t know what you mean by the situation in Nigeria, what we encourage is, you can migrate.\nI don’t think women in the parliament are less vocal.\nSo I don’t think women are less vocal, they are less in number.\nI dream of a free, fair, equitable Nigeria, a Nigeria where poverty will be absolutely and totally reduced, a Nigeria where everybody can live comfortably, where the rich will not be getting richer and the poor getting poorer and a Nigeria where corruption will be totally gone."
  },
  {
    "headline": "Abike Dabiri-Erewa: On Nigeria @ 61",
    "summarized_story": "So, yes, Nigeria is not where it should be at 61, but gradually, we will get there.\nI don’t know what you mean by the situation in Nigeria, what we encourage is, you can migrate.\nI don’t think women in the parliament are less vocal.\nSo I don’t think women are less vocal, they are less in number.\nI dream of a free, fair, equitable Nigeria, a Nigeria where poverty will be absolutely and totally reduced, a Nigeria where everybody can live comfortably, where the rich will not be getting richer and the poor getting poorer and a Nigeria where corruption will be totally gone."
  },
  {
    "headline": "Mmekidmfon Umanah…Building a healthcare bridge between Europe and West Africa",
    "summarized_story": "By Yemisi SuleimanWith Africa’s healthcare system on the brink of collapse, Nigerian born UK based Mmekidmfon Umanah, is on a mission to strengthen the West African frontline and primary healthcare system via his project company; Aimcare Health Limited a product sourcing company that is building the healthcare bridge between Europe and West Africa by connecting European health startups to the unique market opportunities in West Africa.\nThe truth is that the African healthcare system is simply broken, and this cost me my mother’s life in 2013.\nAimcare Health Limited’s mission is to strengthen the West African frontline and primary healthcare system by providing pharmacies, primary healthcare centres, patent medicine stores and hospitals with the most innovative, user-friendly, and affordable products in the global market.\nAt what point did the Dot Glasses project come in and what informed it?\nTell us your achievement with DOT glasses project in Nigeria?"
  },
  {
    "headline": "Supreme Court to determine alleged pension scammer, John Yusuf’s fate on Oct 7",
    "summarized_story": "Yusuf dragged the Federal Government before the apex court seeking to overturn the sentence slammed on by the Court of Appeal in 2018.\nHe was jailed upon being found guilty of defrauding the Federal Government to the tune of N22.9 billion through police pensions.\nIn his appeal lodged with the Supreme Court, he is praying the apex court to set aside his conviction and the order that he should refund the money.\nDAILY POST reports that the Supreme Court on Wednesday slated the appeal marked SC.\nIrked by the light sentence issued by the high court, EFCC challenged the decision at the Court of Appeal."
  },
  {
    "headline": "Students’ protest: Onuigbo restates commitment to total reconstruction of Ikuwano-Umuahia-Ikot Ekpene Road",
    "summarized_story": "Sam Onuigbo, member representing Ikwuano/Umuahia Federal Constituency of Abia State at the House of Representatives has said that the Federal Emergency Road Maintenance Agency (FERMA) has moved materials to the bad sections of Umuahia-Ikwuano-Ikot Ekpene road to commence palliative works.\nOnuigbo, who spoke through a statement on Wednesday, against the backdrop of the recent protest over the killing of the student by a trailer driver on the deplorable busy road on Sunday, reiterated his avowed commitment to the repair of the road.\nHe urged residents of the area to cooperate with the road workers so that they can carry out their works effectively.\nDAILY POST reported that Students of the Michael Okpara University of Agriculture, Umudike (MOUAU), Abia State, had staged a peaceful protest against the dilapidated condition of the Umuahia-Ikwuano Ikot Ekpene federal road barely one day, a trailer vehicle crushed and killed instantly a 500 level student of the institution on the said road.\nThe protesting students had barricaded all the routes that lead to the Umuahia-Ikwuano-Ikot Ekpene road, refusing road users access to the road, lamenting that it has become a death trap to them, private and commercial vehicle owners."
  },
  {
    "headline": "BREAKING: Nigeria opposition parties call for impeachment of Buhari, Lawan, Gbajabiamila",
    "summarized_story": "The Coalition of United Political Parties (CUPP) has urged the National Assembly to commence impeachment proceedings against President Muhammadu Buhari.\nHe alleged that the President had abused his office, grossly misconducted himself and failed to protect the lives and property of Nigerian citizens.\nUgochinyere said life was now so cheap in Nigeria that leaders “do not even show empathy anymore”.\nThe CUPP alleged that both leaders of the chambers of the National Assembly have failed to guide their colleagues to act as checks and balances on the Executive.\n“They do not have respect again as several members of the Executive ignore them even when they are officially summoned."
  },
  {
    "headline": "Ogun gets new Commissioner of Police",
    "summarized_story": "The Ogun State Police Command has got a new Commissioner of Police, DAILY POST reports.\nThe new Commissioner of Police is CP Lanre Bankole Sikiru.\nSikiru’s redeployment to Ogun command followed the retirement of Edward Awolowo Ajogun, who clocked 60 years on Thursday.\nAccording to a police wireless message dated DTO:060930/10/2021, from the Force Headquarters, Abuja, Sikiru was directed to report to Ogun State with immediate effect.\nThe police wireless message with reference number: TH.5361/FS/FHQ/ABJ/V.7/725, read: “INGENPOL (Inspector General of Police) has ordered the posting of COMPOL Lanre Bankole Sikiru to CP OGS."
  },
  {
    "headline": "Group asks Buhari to sanction minister, Onu over ex-FIIRO acting DG’s certificate scandal",
    "summarized_story": "The Unified Nigerian Youth Forum (UNYF), has hailed President Muhammadu Buhari on his recent action taken against the former acting Director-General of the Federal Institute of Industrial Research, Oshodi, Lagos, Mr Chima Igwe.\nThe statement noted that the Governing Council of the institute raised series of valid fundamental observations against Mr Chima Igwe’s academic qualifications which even led to his being deposed before his subsequent demotion for claiming he had a PhD from a university in Benin Republic.\nThe forum appealed to President Buhari to take serious measures against the Minister of Science Technology and Innovation, Mr Ogbonaya Onu, for bringing such avoidable embarrassment to Nigeria among the comity of nations.\nIt said that failure to take serious measures against the minister would result in a nationwide protest by its members where their members would picket offices of all agencies and parastatals under his ministry.\nIt stated that the era when people deliberately ignored constituted authority and bring the nation down under the current administration is over."
  },
  {
    "headline": "Gunmen abduct four in Ekiti community",
    "summarized_story": "By Rasaq Ibrahim, Ado Ekiti- Advertisement -Gunmen numbering eight on Wednesday invaded Ilasa-Ekiti in Ekiti -East Local Government Area of Ekiti State and kidnapped four persons.\nWe assure the people of Ekiti State that we will get him rescued and the culprits will be arrested to face justice,” Abutu said.\nMeanwhile, the Ilasa Development Union has condemned the incessant cases of kidnapping within and around Ilasa Ekiti.\nHe said”“We call on Government of Ekiti State to expedite actions towards the release of the kidnapped victims and towards curbing the menace of kidnapping in Ekiti State as a whole.\n“We assure all sons and daughters of Ilasa Ekiti that IDU in concert with the palace authority, will leave no stone unturned in making Ilasa Ekiti a safe haven.”"
  },
  {
    "headline": "PHOTOS: Buhari presides over FEC meeting",
    "summarized_story": ""
  },
  {
    "headline": "Ekiti judiciary announces Justice Fowe demise",
    "summarized_story": "- Advertisement -The Ekiti judiciary has announced the demise of Justice Adewale Fowe, a former Attorney-General and Commissioner for Justice in the state.\nThe announcement is contained in a statement signed by the Chief Registrar of Ekiti State Judiciary, Justice John Adeyeye, and made available to newsmen on Tuesday in Ado Ekiti.\nThe News Agency of Nigeria (NAN) reports that the 65- year-old Fowe until his demise was a High Court Judge.\nHe also worked as a private legal practitioner and later appointed the Attorney General and Commissioner for Justice, Ekiti, between November 1997 and May 1999.\n“The pain of the exit of Justice Adewale Fowe will greatly be missed by the Ekiti State Judiciary and all concerned,’’ the statement said."
  },
  {
    "headline": "Fire service may withdraw services – Comptroller",
    "summarized_story": "(NAN)The Comptroller General of the Federal Fire Service of Nigeria, Dr Ibrahim Liman, has said the service would withdraw from any state where his men or equipment are attacked during the course of discharging their duties.\nThe comptroller general, who said he was in the state with his men for a week-long retreat for management staff of fire service, said the training would boost the service delivery of his men.\nHe, however, noted that the service had been boosted for better service delivery by the current administration of President Muhammadu Buhari.\n“The state is equally delighted to note the extension of the Federal Fire Stations to Ore, down South, and to the Northern Senatorial District, which was recently announced to us by the Federal Comptroller in the State.\n“This effort was made possible through the collaboration and support of the Federal Fire Service maintenance team which volunteered to oversee the repairs accordingly,” he said."
  },
  {
    "headline": "Chairmanship: PDP stakeholders push for Mark",
    "summarized_story": "However, the proposal has generated tension as some PDP leaders, who feel aggrieved with the zoning are kicking.\nDaily Sun gathered that immediately the Zoning Committee’s announcement, some stakeholders reached out to Mark to consider leading the opposition party.\nOne of the aides to the former Senate president confirmed to journalists, in Abuja, that he has accepted to join the chairmanship contest.\n“Oga is interested,” he statedIt was gathered that with the acceptance of the former Senate president to vie for the chairmanship, party leaders promoting his candidacy has stepped up their bid to mobilise support for him.\nThe PDP is the only party in the state that is united and peaceful."
  },
  {
    "headline": "The Sun awards’ll spur us to work more for Nigeria –Ekpo, Shaibu",
    "summarized_story": "Akwa Ibom State Deputy Governor, Mr. Moses Ekpo and his Edo counterpart, Philip Shaibu, have described their recognition by The Sun Publishing Limited as an elixir to continue to work for good governance in the country and render selfless service.\nEkpo said the recognition had reinforced his belief in Nigeria, as he dedicated it to the state governor, Emmanuel Udom, whom he said gave him an opportunity to contribute in the building of a viable Akwa Ibom state.\nFor Shaibu, Edo State Deputy Governor, the honour is well cherished.\n“You have made a name for yourself in terms of reportage; you have also made a name for yourself, in terms of combining news, entertainment, sports, business etc.,” the deputy governor said.\nAs the head of the committee that prepared Edo State to host the sports fiesta, you worked tirelessly to ensure that all sports arena and facilities were ready for the competition."
  },
  {
    "headline": "Passport seizure: Immigration seeks permission to file fresh evidence against ex-Rivers gov, Odili",
    "summarized_story": "From Godwin Tsa, AbujaThe Nigerian Immigration Service (NIS) has sought the permission of the Federal High Court to file fresh evidence against a former Rivers State governor, Dr Peter Odili, on why his travelling passport was seized.\nHowever, when the case came up yesterday, counsel to Immigration, Mr Jimoh Abdulkair Adamu, informed the court that his clients were willing to file fresh evidence against the ex-governor.\nAdamu specifically told Justice Inyang Edem Ekwo that Immigration and the Comptroller General intends to file a better and further counter affidavit to justify the seizure of the passport.\nHe had dragged the Nigeria Immigration Service and it’s Comptroller General before a federal high court in Abuja, challenging the seizure of his passport at the Nnamdi Azikiwe International Airport, in Abuja, for undisclosed reasons.\nHe claimed to be a senior citizen of Nigeria, law abiding and had not done anything to warrant the seizure of his passport."
  },
  {
    "headline": "Gunmen kill DSS officer, 2 vigilantes, burn vehicles in Imo, Enugu",
    "summarized_story": "The officer was said to be among the task force team deployed to Anambra State, a few hours after the burning of the DSS office in Nnewi, according to a family source.\nOpara said the initial report received by the family was that gunmen, who engaged the task force team in a gun duel, at Ukwu-Orji, had killed the DSS officer, said to be the driver of the team.\nMeanwhile, the corpse of the officer, the deceased cousin said, has been deposited at the mortuary.\nGunmen kill 2, injure 3 in EnuguGunmen, yesterday, invaded the security office of the Central Neighbourhood Watch at Ogrute, Enugu Ezike, Igbo-Eze North Local Government Area, Enugu State, killing the Commander and one other, while three others sustained injuries.\nWhen the reporter visited the scene yesterday morning, there were uncontrollable wailing as onlookers and sympathisers besieged the area."
  },
  {
    "headline": "News in Photographs: Buhari Presides over FEC Meeting",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari is presiding over the weekly virtual meeting of the Federal Executive Council (FEC) at the State House, Abuja.\nVice President Yemi Osinbajo, Secretary to Government of the Federation, Boss Mustapha, and Chief of Staff to the President, Professor Ibrahim Gambari are among those physically attending the meeting holding at the Conference Hall of the First Lady’s office.\nAlso present are Ministers of Justice, Abubakar Malami; Information, Lai Mohammed; Finance Budget and National planning, Zainab Ahmed and Minister of State for Budget, Clement Agba.\nOther Ministers as well as the Head of Civil Service of the Federation, Folashade Yemi-Esan, are also attending the meeting virtually from their various offices in Abuja.\nSee ImagesShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Pressure Mounts on US to Designate IPOB Terrorist Org",
    "summarized_story": "Kingsley Nwezeh in AbujaThere is mounting pressure on the United States government to designate secessionist group, the Indigenous People of Biafra (IPOB), a terrorist organisation.\nAn article in Washington Times is calling on US authorities to designate IPOB a terror group following acts of violence and mindless killings linked to it.\n“This is despite repeated pleas to do so by longstanding U.S. ally, Nigeria, where IPOB is based and carries out its murderous activities.\nNow, the people IPOB claims to represent, the Igbo, are even seeking to distance themselves from the group”, it said.\nThe publication raises posers as to the reason the group was yet to be labelled a terror group."
  },
  {
    "headline": "Anambra Poll: Yakubu Sounds the Alarm, Says Security Never Been This Urgent",
    "summarized_story": "The INEC boss, who raised concerns over the deteriorating security situation in the State, also expressed worry over the safety of his staff, voters and security personnel during the November 6 governorship election in the state.\nMeanwhile, the Inspector-General of Police, IGP Usman Alkali Baba, has ordered the removal of the Commissioner of Police (CP) in Anambra State, Tony Olofu and immediately posted Echeng Eworo Echeng as his replacement.\nHowever, speaking on the dire situation in Anambra, Yakubu lamented that never before in Nigeria’s history had the importance of election security in a governorship election been this urgent.\nWe appreciate the enormous challenges that the security agencies are presently facing in Anambra State, which entail not only securing the electoral process, but also enforcing law and order generally.\nHe has also served as a Police Component Commander, Joint Task Force, Operation Delta Safe and Deputy Commissioner of Police in-charge of Zonal CID, Zone-13, Ukpo, Anambra State, amongst other key positions."
  },
  {
    "headline": "Revolutionary New Treatment Signals Hope for Sickle Cell Sufferers",
    "summarized_story": "Continuing, Pritchard said patients with sickle cell suffer from monthly episodes, making it difficult for people to continue in their jobs or other everyday activities.\nPritchard added: “This is a historic moment for people with sickle cell disease who will be given their first new treatment in over two decades.\nPeople aged 16 and over who suffer from multiple sickle cell crises, or vaso-occlusive crises as they are scientifically known, per year would be eligible for the treatment.\nToks Odesanmi, a sickle cell patient at Cambridge University Hospitals Trust, was quoted to have said: “Sickle Cell Disease has defined me, defined my body and made a big dent to my dreams.\nThe Chair of the Sickle Cell Society, Kye Gbangbola MBA, said: “A new treatment brings new hope for people living with Sickle Cell Disorder, the world’s most common genetic blood condition."
  },
  {
    "headline": "Fiscal Federalism: Lagos Demands 1% in Revenue Allocation Formula",
    "summarized_story": "This is against the current revenue allocation formula, which gives the federal government 52.68 per cent, the 36 state governments 26.72 per cent, and the 774 local governments 20.60 per cent.\nThe Lagos State government’s demands were made by Governor Babajide Sanwo-Olu at the opening of a two-day South-west zonal public hearing on review of the revenue allocation formula, organised in Lagos by the Revenue Mobilisation, Allocation and Fiscal Commission (RMAFC).\n“Lagos State is, no doubt, the nation’s commercial capital, and population centre.\nIt is, therefore, necessary to give due consideration to all the variables that support our advocacy for a special status.\nIt will be totally unfair for Lagos State to be left alone to bear these huge expenses without assistance from the centre."
  },
  {
    "headline": "EXCLUSIVE: Nigerian Army Mandates Soldiers Visiting Families To Bring N6,000 Torches Before Travelling",
    "summarized_story": "The Nigerian Army authorities have mandated soldiers travelling to go home to see their families to buy N6000 torches for the service as one of the conditions for leaving, SaharaReporters has learnt.\nSaharaReporters gathered that only those personnel who purchased the item among other conditions were allowed to go and see their families.\n“In 195 Battalion, Maiduguri, they force soldiers to buy torches before they are allowed to go home and see their family.\nMoreover, the torches are supposed to be provided by the army; it is part of their duty,” a source explained.\nThe mandatory purchase of torches for troops is in contrast to the Eldorado earlier promised by the Nigerian Army authorities for troops departing home to see their families."
  },
  {
    "headline": "EXCLUSIVE: Nigerian Army Mandates Soldiers Visiting Families To Bring N6,000 Torches Before Travelling",
    "summarized_story": "The Nigerian Army authorities have mandated soldiers travelling to go home to see their families to buy N6000 torches for the service as one of the conditions for leaving, SaharaReporters has learnt.\nSaharaReporters gathered that only those personnel who purchased the item among other conditions were allowed to go and see their families.\n“In 195 Battalion, Maiduguri, they force soldiers to buy torches before they are allowed to go home and see their family.\nMoreover, the torches are supposed to be provided by the army; it is part of their duty,” a source explained.\nThe mandatory purchase of torches for troops is in contrast to the Eldorado earlier promised by the Nigerian Army authorities for troops departing home to see their families."
  },
  {
    "headline": "BREAKING: Sunday Igboho In Need Of Urgent Medical Care—Yoruba Nation Agitator's Aide Appeals To Benin Republic President",
    "summarized_story": "Detained Yoruba Nation agitator, Sunday Adeyemo, aka Sunday Igboho is in urgent need of medical attention, his spokesman has said.\nOlayomi Koiki, spokesman for Igboho, who is being detained in Benin Republic, on Tuesday said the secessionist leader needs urgent medical treatment.\nSunday IgbohoA statement by the Koiki titled 'On behalf of Chief Sunday Adeyemo, aka Igboho', called on the government of Benin Republic to grant Igboho permission to receive urgent medical attention.\n\"He needs urgent medical treatment and giving him this would help him with his health problems.\nHowever, Igboho's wife has since been released from police custody while Igboho remains in detention in the West African country."
  },
  {
    "headline": "BREAKING: Sunday Igboho In Need Of Urgent Medical Care—Yoruba Nation Agitator's Aide Appeals To Benin Republic President",
    "summarized_story": "Detained Yoruba Nation agitator, Sunday Adeyemo, aka Sunday Igboho is in urgent need of medical attention, his spokesman has said.\nOlayomi Koiki, spokesman for Igboho, who is being detained in Benin Republic, on Tuesday said the secessionist leader needs urgent medical treatment.\nSunday IgbohoA statement by the Koiki titled 'On behalf of Chief Sunday Adeyemo, aka Igboho', called on the government of Benin Republic to grant Igboho permission to receive urgent medical attention.\n\"He needs urgent medical treatment and giving him this would help him with his health problems.\nHowever, Igboho's wife has since been released from police custody while Igboho remains in detention in the West African country."
  },
  {
    "headline": "BREAKING: Sunday Igboho In Need Of Urgent Medical Care—Yoruba Nation Agitator's Aide Appeals To Benin Republic President",
    "summarized_story": "Detained Yoruba Nation agitator, Sunday Adeyemo, aka Sunday Igboho is in urgent need of medical attention, his spokesman has said.\nOlayomi Koiki, spokesman for Igboho, who is being detained in Benin Republic, on Tuesday said the secessionist leader needs urgent medical treatment.\nSunday IgbohoA statement by the Koiki titled 'On behalf of Chief Sunday Adeyemo, aka Igboho', called on the government of Benin Republic to grant Igboho permission to receive urgent medical attention.\n\"He needs urgent medical treatment and giving him this would help him with his health problems.\nHowever, Igboho's wife has since been released from police custody while Igboho remains in detention in the West African country."
  },
  {
    "headline": "Tinubu is the ideal APC presidential candidate for 2023, says Ogunlewe",
    "summarized_story": "Adeseye Ogunlewe, the former minister of works, has called on Bola Tinubu, a chieftain of the All Progressives Congress (APC), to declare his interest in the 2023 presidential election.\nAdvertisementSpeaking on an Arise Television programme on Tuesday, Ogunlewe said Tinubu is the appropriate person to succeed President Muhammadu Buhari.\nHe said a campaign team will be launched in Lagos on Thursday to kick-start the activities of his participation as a candidate in the 2023 election.\nHe has to struggle, participate and convince people that he is available to serve.\n“On Thursday, we will launch the Lagos faction of his campaign team, so that everybody would be aware of his intention to contest."
  },
  {
    "headline": "Tinubu is the ideal APC presidential candidate for 2023, says Ogunlewe",
    "summarized_story": "Adeseye Ogunlewe, the former minister of works, has called on Bola Tinubu, a chieftain of the All Progressives Congress (APC), to declare his interest in the 2023 presidential election.\nAdvertisementSpeaking on an Arise Television programme on Tuesday, Ogunlewe said Tinubu is the appropriate person to succeed President Muhammadu Buhari.\nHe said a campaign team will be launched in Lagos on Thursday to kick-start the activities of his participation as a candidate in the 2023 election.\nHe has to struggle, participate and convince people that he is available to serve.\n“On Thursday, we will launch the Lagos faction of his campaign team, so that everybody would be aware of his intention to contest."
  },
  {
    "headline": "Report: How Bello-Koko, NPA acting MD, acquired secret offshore companies, London properties",
    "summarized_story": "Mohammed Bello-Koko, acting managing director of the Nigerian Ports Authority (NPA), reportedly owns properties in the United Kingdom which he acquired by secretly running offshore businesses in the British Virgin Islands.\nUsing the two companies, Coulwood Limited and Marney Limited, tucked away offshore, Bello-Koko was said to have anonymously acquired five London properties.\nAdvertisementThe newspaper said four of the properties were acquired between 2009 and 2012, and that Bello-Koko potentially exploited UK tax loopholes that allowed the owning of UK properties using so-called envelope structure, that is, anonymously owning properties through offshore companies.\nBut one of the properties was said to have been acquired in May 2017, after Bello-Koko took up an appointment at the NPA.\nFor the third, the 2017 Aurora Garden property, he allegedly paid 475,000 pounds, being his largest single investment in the UK property market."
  },
  {
    "headline": "Report: How Bello-Koko, NPA acting MD, acquired secret offshore companies, London properties",
    "summarized_story": "Mohammed Bello-Koko, acting managing director of the Nigerian Ports Authority (NPA), reportedly owns properties in the United Kingdom which he acquired by secretly running offshore businesses in the British Virgin Islands.\nUsing the two companies, Coulwood Limited and Marney Limited, tucked away offshore, Bello-Koko was said to have anonymously acquired five London properties.\nAdvertisementThe newspaper said four of the properties were acquired between 2009 and 2012, and that Bello-Koko potentially exploited UK tax loopholes that allowed the owning of UK properties using so-called envelope structure, that is, anonymously owning properties through offshore companies.\nBut one of the properties was said to have been acquired in May 2017, after Bello-Koko took up an appointment at the NPA.\nFor the third, the 2017 Aurora Garden property, he allegedly paid 475,000 pounds, being his largest single investment in the UK property market."
  },
  {
    "headline": "EXTRA: EFCC nominee confirmed by senate 'started school before he was born'",
    "summarized_story": "Yahaya Muhammad, one of the nominees to the Economic and Financial Crimes Commission (EFCC) board, is said to have started primary school before he was born.\nThe other nominees confirmed by the senate are George Abang (secretary), Lukman Mohammed, Anumba Adaeze and Bola Adesina.\nHadejia said according to the nominee’s credentials, he started school a year before he was born.\n“One of the nominees, Alhaji Yahaya Muhammad — according to the record before us, started his primary school before he was born,” the senator said.\nAdvertisement“There is also an overlap in the sequence of his educational experience because here, he was born on 29th of September, 1969 and he started his primary school in 1968."
  },
  {
    "headline": "Google launches $50m equity-based investment fund for African startups",
    "summarized_story": "At the first-ever Google for Africa event held virtually on Wednesday, Google announced the launch of a $50 million “Africa Investment Fund” through which it plans to invest in African startups.\nTargeted at early to growth-stage startups, the new fund is equity-based, marking a shift in Google’s approach to investing in African startups.\nOver the last three years, the company’s existing initiative – Google for Startups Accelerator Africa – has provided more than 80 African startups with equity-free finance, cash awards as well as other benefits including working space and access to expert advisors.\nMeanwhile, the Google Black Founders Fund will invest in Black-led startups in Africa by providing cash awards and hands-on support.\nGet the best African tech newsletters in your inbox“In the last year, we have seen more investment rounds into tech startups than ever before,” Nitin Gajria, Managing Director for Google in Africa, says in an official statement."
  },
  {
    "headline": "Pandora Papers: Kenya’s first family implicated in biggest-ever offshore data leak",
    "summarized_story": "Seven members of the Kenyatta family, including the president, are revealed, through the Pandora Papers, as being variously connected to more than 10 offshore companies and foundations.\nThe Kenyattas’ offshore investments include a company with stocks and bonds worth $30 million.\nLargest-ever leakThe Pandora Papers represent the latest and largest, by data volume, in a series of major leaks of financial data about the offshore world over the last five years.\nIn 2016, the Panama Papers, which consisted of 2.6 terabytes of data, leaked from the law firm, Mossack Fonseca.\nMore than 100 billionaires feature in the leaked data, as well as celebrities, rock stars, and business leaders."
  },
  {
    "headline": "Twitter ban in Nigeria to be lifted if certain conditions are met",
    "summarized_story": "Buhari listed these conditions during a broadcast to mark Nigeria’s 61st Independence anniversary on Friday, October 1.\nThe Nigerian government suspended Twitter’s operations in June, following the social media platform’s decision to delete a tweet by Buhari, which it said breached the site’s rules.\nThe state’s decision to ban Twitter triggered widespread criticism as online-based businesses recorded huge losses; lawsuits; and national assembly hearings meant to probe the circumstances leading to the ban.\n“The ban on Twitter will soon be lifted as we are getting close to reaching full agreement,” the minister said.\nHowever, the Buhari administration has always been keen on regulating social media and internet-based broadcasting companies."
  },
  {
    "headline": "Kola Aina appointed chair of new board at Lagos Angel Network",
    "summarized_story": "The Lagos Angel Network (LAN) has appointed a new Board of Governors (BoG) to oversee its affairs, effective from today October 1, 2021.\nLAN has also birthed several Angel groups such as Rising Tide Africa (RTA), South South-East Angels Network (SSEAN), Abuja Angels Network (AAN), and the Diaspora Angels Network (DAN).\n“We’ve seen the Lagos startup ecosystem grow significantly bigger than when we started LAN 10 years ago and need to do more.\nWe’ve seen what’s possible, and now it’s time to take Angel investing in Nigeria to the next level,” Sulaiman adds.\n“I want to thank the founding LAN Board whose achievements cannot be overstated, and their legacy is visible for all to see,” Aina says."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Update [ October 1, 2021 at 8:14 am.\nWAT] The eNaira website is now up The Central Bank of Nigeria (CBN) has postponed..."
  },
  {
    "headline": "eNaira: How much control does a private blockchain give the CBN?",
    "summarized_story": "Goodluck — $AYOBAMI 🇸🇻 (@dondekojo) September 21, 2021While we’ve explored how this currency will work, what it means, and how it differs from other digital currencies, we’re yet to examine the possibilities of a closed or private blockchain aiding “laundering on steroids”What is a private blockchain?\nThe Hyperledger Fabric, chosen to run the eNaira by the CBN, is an example of a private blockchain.\nHow private blockchains work, compared to the public onesImmediately, the difference between a private and public blockchain is clear — control and access.\nHow much power does a private blockchain give the CBNAdedayo Adebajo, Managing Director of Jelurida Africa, the blockchain company behind Ardor, an open-source blockchain network, believes that while blockchain is immutable, in the case of a private blockchain, the owners can doctor information on it.\n“If you’re running a private blockchain, there are a number of things you need to sacrifice, part of which is transparency."
  },
  {
    "headline": "Building Patricia from scratch, iWello’s healthcare service, African teachers and edtech, Airtel Money X Flutterwave",
    "summarized_story": "This post is a delayed version of Techpoint Digest , a week-daily newsletter that rounds up major happenings in African tech.\nTechpoint Africa’s Chief Servant, Múyìwá Mátùlúkò, had a chat with Hanu Fejiro Agbodje, CEO of Patricia — an alternative payment solutions platform — about his failure in 13 other businesses before Patricia.\nAirtel Money partners with FlutterwaveAirtel’s mobile money platform, Airtel Money, has announced a partnership with African payments company, Flutterwave to expand Airtel Money’s services to business across Eastern Africa.\nConsequently, businesses in Uganda, Tanzania, Zambia, Malawi, Kenya, and Rwanda can accept Airtel Money payments and make bulk payments into Airtel Money wallets.\nAirtel Money believes that as consumer behaviour changes and eCommerce grows, businesses will be increasingly required to accept mobile money payments from customers for goods and services."
  },
  {
    "headline": "What do current edtech innovations mean for teachers in Africa?",
    "summarized_story": "Away from the problems and given the right conditions, how important is a teacher’s role in education?\nShe believes that a teacher’s role goes beyond the board and marker.\nIn commemoration of World Teachers Day, we look at how technology aids teachers’ jobs and its role in the educational space.\nEdtech in AfricaAs technology innovations have increased in Africa, the education industry has not been left out.\nResponse of teachers to edtechThe issues raised earlier regarding poverty and infrastructural deficits mean it isn’t easy to gauge how well teachers have responded to edtech innovations."
  },
  {
    "headline": "Nigeria’s biggest firms push stock market to positive territory for first time since February",
    "summarized_story": "Nigeria’s biggest firms push stock market to positive territory for first time since FebruaryNigerian stocks have turned positive on a year-to-date basis for the first time since February led by gains from Dangote Cement and some of the country’s largest companies.\nThe benchmark stock index improved by 1.18 percent to close at 40,716.66 points at the end of Tuesday’s trading, thereby helping stocks to a year-to-date return of 1.11 percent as market capitalisation increased by N247 billion to close at N21.22 trillion.\nDangote Cement, Nestle, Airtel and Zenith are among the companies that have helped Nigerian stocks turn the corner on a rout that started in February.\nNigerian stocks have a stellar month of September to thank for closing the gap on peers.\nDangote Cement’s15 percent return for the month, in particular, contributed considerably to the NGX‘s return."
  },
  {
    "headline": "FG’s infrastructure spend in 6years yields 13,000km of roads – Fashola",
    "summarized_story": "At the present exchange rate, the debt stock could be more.\nThis means that the country’s road infrastructure is in dire situation, needing a large chunk of investment to fix.\nGlobally, the report says, the infrastructure gap by 2040 is estimated at $15 trillion with Nigeria’s share of that put at ₦3 trillion.\nThe importance of roads infrastructure can hardly be over-emphasised.\nApart from opening up communities, linking cities and facilitating trade and commerce, roads encourage and enable real estate investment."
  },
  {
    "headline": "Extra allocation to INEC, others see Buhari raise 2022 budget",
    "summarized_story": "Nigerian President Muhammadu Buhari has written to lawmakers seeking a 17.67 percent increase of the Federal Government’s projected expenditure in 2022 to N16.45 trillion from N13.98 trillion.\nThe projected increase in expenditure equates to N2.47 trillion additional spending, which Buhari said was partly due to the N100 billion extra provision to the Independent National Electoral Commission (INEC) to cater for 2023 General Elections.\nThe increase in expenditure was accompanied by a 21 percent rise in projected revenues to N10.13 trillion.\nBuhari stated that it was necessary to revise the MTEF to reflect the new fiscal terms in the recently signed Petroleum Industry Act (PIA) 2021, as well as other critical expenditures in the 2022 Budget.\n76 billion; MDAs internally Generated Revenue by N697.6 billion."
  },
  {
    "headline": "Olu Of Warri Derobes Chief Ayirimi Emami As Ologbotsere Of Warri Kingdom – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – His Majesty, OGIAME Atuwatse III, Olu of Warri, has officially announced the derobing of the embattled Chief Ayiri Emami as Ologbotsere of Warri.\n“But it suffices I tell you now that, I don’t recognise the Olu as my king because his selection didn’t follow due process.\nI don’t want to say more because the case is still in the court,” Chief Emami noted.\nThe revered monarch also instructed his subjects and people Itsekiri Nation worldwide not to address the prominent chief as Ologbotsere.\nRecall that Chief Ayirimi Emami, was suspended by the Ginuwa 1 Ruling House as the Ologbotsere (Prime Minister) of Warri kingdom on the 30th of March, 2021."
  },
  {
    "headline": "Teacher’s Day: Obaseki on-boards 1000 newly trained EdoSTAR fellows – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Tuesday, unveiled 1000 newly trained Edo Supporting Teachers To Achieve Results (EdoSTAR) teaching fellows, to strengthen the teaching corps in the state.\nObaseki spoke while addressing teachers at the 2021 World Teacher’s Day celebration, on Tuesday, in Benin City.\n“Today, we are not talking about teachers’ promotion again.\nWe will continue to respect our teachers; we will continue to prioritise payment of your salaries.\nIn his address, the Edo State Chairman of the Nigeria Union of Teachers (NUT), Mr. Pius Okhueleigbe, commended Governor Obaseki for implementing the 2016 to 2019 promotion arrears to affected teachers."
  },
  {
    "headline": "Always Stand On The Truth, Report Responsibly, Olu Of Warri Charges Journalists – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – His Majesty, OGIAME ATUWATSE III, Olu of Warri, has charged media practitioners to always stand on the truth and shun irresponsible journalism at all times.\nThe Olu gave the charge today at his palace in Warri, Warri South Council Area of Delta State, when the Executives and members of the Nigerian Union Of Journalists, Warri Correspondents’ Chapel paid him a courtesy call.\nBut as neutral journalists, let’s stand on the truth and say it as it is.\nthe Olu, said.”The royal father there after prayed for the various media houses represented during the visit.\nIncluding,Chief Solomon Areyinka, Chief Johnson Amstseru leghe, Chief Brown Mene, Chief Dr. Roland Oritsejafor, Chief Patrick Iyaladju, Chief Bedi Giwa, Chief Omolubi Newuwumi,Chief Maleghemi Akpeto,Chief Eugene Ikomi,..."
  },
  {
    "headline": "PUWOV apprehends personnel for extortion, urges residents’ support to flush out corrupt officials – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Public Works Volunteers (PUWOV) in Edo State has apprehended one Fidelis Ugbenna, an officer of the scheme for allegedly extorting money from a motorist.\nThe State Coordinator, PUWOV, Mukhtar Yusuf-Osagie, who disclosed this to journalists in Benin City, said the personnel has been handed over to the police for further investigation and prosecution.\nReassuring the scheme’s commitment to curb criminality and ensure peace and orderliness, in partnership with other security agencies in the state, Yusuf-Osagie solicited for residents’ support to maintain discipline and flush out corrupt officers from the schemeAccording to him, “The Edo PUWOV has apprehended one Mr. Fidelis Ugbenna, a PUWOV personnel, who connived with a dismissed PUWOV personnel (Emmanuel Oviawe) to extort a private motorist at Nepa junction on Akpakpava axis of Ring Road in Benin City.”He said the corrupt PUWOV official extorted the sum of N10, 000 from Mr. Chibuzor Nenchi, a road user on the Ring Road axis, adding, “the PUWOV official, Ugbenna Fidelis has been taken to Oba Market Police Division for further investigation and prosecution.\nAlso, an immediate dismissal awaits him after prosecution.”The PUWOV coordinator further stated: “We are reassuring members of the public that the scheme will not relent in upholding its mandate on discipline as such all bad eggs will be flushed out from the scheme.\n“We want to charge members of the public to always use the PUWOV complaints lines on 09150322999 and 08132030846 to report any PUWOV official culpable of the illegal act of extortion.”“Also, members of the public should be observant and mindful of some miscreant on black outfits posing as PUWOV taskforce to extort money from innocent citizens; members of the public should report anyone involved in such illegality,” Yusuf-Osagie added."
  },
  {
    "headline": "Hunters, vigilantes rescue victims, arrest kidnappers in Kogi",
    "summarized_story": "The Hunters’ Group of Nigeria (HGN) and the Kogi State Vigilante Service (KVS) have rescued three Fulanis after raiding a kidnappers’ hideout beside Erotyi mountain in Kogi/Koto Local Government Area of the state.\nThe spokesperson of the hunters’ group, Abdullahi Yahaya, said three of the suspected kidnappers were also arrested during the operations.\nMr Yahaya said the rescued victims were not hurt and were in perfect condition, while the arrested kidnappers had been handed over to the appropriate authorities with their confiscated weapons, for further investigation.\nREAD ALSO: Hunters rescue kidnapped retired lecturerMr Omodara said the efforts of the state government to make Kogi the safest state in the country were yielding results.\nMr Omodara said the government at all levels would continue to work to make the state unsafe for criminal elements and their sponsors."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Industry stakeholders, NEITI, seek diligent implementation of PIA",
    "summarized_story": "The Nigeria Extractive Industries Transparency Initiative (NEITI) and other industry stakeholders in the oil and gas sector have called for diligent implementation of the Petroleum Industry Act (PIA) to ensure that the intended reforms in the sector are achieved.\nNEITI Executive Secretary, Dr Orji Ogbonnaya Orji in his presentation commended the Federal Government for enacting the PIA after twenty years of the process that initiated the petroleum industry reforms, and 13 years after the formal process of legislation started.\nDr. Orji disclosed that NEITI has taken “note of specific provisions that promote the objectives of transparency, accountability, operational efficiency and generally, improved corporate governance of the oil and gas sector.\n“These objectives have been the focus (and concern) of NEITI since the agency began work in 2004.\n“In view of this precedence, and in line with the global standards for good and effective governance of the extractive industry, NEITI further commends government in respect of the following provisions of the PIA”."
  },
  {
    "headline": "Nigeria produces 2,500 films annually -UNESCO",
    "summarized_story": "The United Nations Educational, Scientific and Cultural Organisation (UNESCO) has said Nigeria produces around 2,500 films a year.\nUNESCO disclosed this on Tuesday in a new report which highlighted the untapped potential in the film industry in Africa.\nThe UNESCO report said Africa’s film and audiovisual industries could create over 20 million jobs and contribute 20 billion dollars to the continent’s combined Gross Domestic Product (GDP).\nThe report aims to help the African film industry and decision-makers take stock of the current landscape and plan strategically for future growth.\nThe UNESCO report estimates that 50 per cent to over 75 per cent of revenue is lost to piracy, though precise data does not exist."
  },
  {
    "headline": "The Bureau of Overseas Buildings Operations Announces Design-Build Award for the U.S. Consulate General in Lagos",
    "summarized_story": "The Department of State has awarded Pernix Federal, LLC of Lombard, Illinois the $319 million design-build contract for the new U.S. Consulate General in Lagos, Nigeria.\nThe 12.2-acre site for the new Consulate General is part of Eko Atlantic, a development led by South Energyx Nigeria Limited in collaboration with Lagos State.\nEnnead Architects of New York, New York is the design architect.\nThe new Consulate General will provide a modern, resilient platform for diplomacy in Nigeria and is expected to be completed in 2027.\nSince the start of the Department’s Capital Security Construction Program in 1999, the Bureau of Overseas Buildings Operations (OBO) has completed 168 new diplomatic facilities."
  },
  {
    "headline": "First Bank leads gainers as stock market advances by 1.18%",
    "summarized_story": "Adebayo ObajemuThe stock market on Tuesday closed on a bullish note, occasioned by 6.29% gain in the share price of Airtel Africa.\nThe All Share Index appreciated by 1.18% to close at 40,716.66 points from the previous close of 40,243.05 points.\nInvestors gained N247 billion as Market Capitalisation grew by 1.18% to close at N21.217 trillion from the previous close of N20.970 trillion.\nPercentage GainersFirst Bank of Nigeria Holdings (FBNH) led other gainers with 9.76% growth to close at N9 from the previous close of N8.20.\nAccess Bank traded about 30.696 million units of its shares in 292 deals, valued at N147.87 million"
  },
  {
    "headline": "Benue 2023: Igbawua Promises Infrastructure, Inclusive Govt",
    "summarized_story": "Igbawua told the party faithful that infrastructure development of Ushongo local government would open up the area for business and maximum utilisation of its natural resources.\nHe pointed out that the local government has the natural endowment to lead in the diversification initiative of his government, if elected governor.\nADVERTISEMENTResponding, the Ushongo local government chairman of PDP, Hon.\nAchia Agashi, stated that Igbawua has demonstrated his love and care for this people and have long prepared himself for today’s challenge.\nHe urged all Ushongo sons and daughters to take ownership of the project because they have a formidable candidate in Hon."
  },
  {
    "headline": "Benue 2023: Igbawua Promises Infrastructure, Inclusive Govt",
    "summarized_story": "Igbawua told the party faithful that infrastructure development of Ushongo local government would open up the area for business and maximum utilisation of its natural resources.\nHe pointed out that the local government has the natural endowment to lead in the diversification initiative of his government, if elected governor.\nADVERTISEMENTResponding, the Ushongo local government chairman of PDP, Hon.\nAchia Agashi, stated that Igbawua has demonstrated his love and care for this people and have long prepared himself for today’s challenge.\nHe urged all Ushongo sons and daughters to take ownership of the project because they have a formidable candidate in Hon."
  },
  {
    "headline": "UBEC Projects: APC Media Team Scores Kwara High",
    "summarized_story": "A delegation of the All Progressives Congress (APC) media team from Abuja, led by Dr. Tom Ohikere, has scored Kwara State high in the execution of the Universal Basic Education Commission (UBEC) school projects.\nLeader of the team, Ohikere, who described their assessment of the projects so far as excellent, said they were in Kwara to inspect the UBEC projects, starting with the ones executed in basic schools for the purpose of achieving quality service delivery.\nADVERTISEMENTEarlier, Kwara State governor, AbdulRahman AbdulRazaq, had said his administration will prudently manage the grant it received from UBEC to reposition public basic schools in the state.\nHe said a lot was currently being done across public schools in the state, a development he noted will ease teachings and learning for excellent performance of the students.\nThe governor also applauded the chairman of Kwara SUBEB, Prof Sheu Adaramaja, and his team for making the state proud."
  },
  {
    "headline": "UBEC Projects: APC Media Team Scores Kwara High",
    "summarized_story": "A delegation of the All Progressives Congress (APC) media team from Abuja, led by Dr. Tom Ohikere, has scored Kwara State high in the execution of the Universal Basic Education Commission (UBEC) school projects.\nLeader of the team, Ohikere, who described their assessment of the projects so far as excellent, said they were in Kwara to inspect the UBEC projects, starting with the ones executed in basic schools for the purpose of achieving quality service delivery.\nADVERTISEMENTEarlier, Kwara State governor, AbdulRahman AbdulRazaq, had said his administration will prudently manage the grant it received from UBEC to reposition public basic schools in the state.\nHe said a lot was currently being done across public schools in the state, a development he noted will ease teachings and learning for excellent performance of the students.\nThe governor also applauded the chairman of Kwara SUBEB, Prof Sheu Adaramaja, and his team for making the state proud."
  },
  {
    "headline": "NCC Reviews Regulatory Instruments For Subscriber Services",
    "summarized_story": "The Nigerian Communications Commission (NCC) has set up a framework to review three regulatory instruments for the subscribers’ communications services.\nThe executive vice chairman of the Commission, Prof Umar Garba Dambatta, made this known in his address at a public inquiry on the three regulatory instruments at the NCC headquarters in Abuja on Tuesday.\n“The first instrument, the Registration of Telephone Subscribers Regulations, provides a regulatory framework for the registration of subscribers of communications services utilizing subscription mediums.\nThe second instrument, SIM Replacement Guidelines, provides guidance on the standards and procedure which Network Service Providers (NSPs) are expected to adhere to in the process of conducting a SIM Replacement, swap or upgrade.\n“It is pertinent to add that the Commission has also introduced Business Rules for SIM Registration and SIM Replacement to further ensure that the process for SIM activation and Replacement is seamless,” he said."
  },
  {
    "headline": "FG to Nigerian travellers: Be prepared for seven-day isolation in UK",
    "summarized_story": "Shuaib said the vaccines administered in Nigeria were approved by the UK Government.\nHe noted that the UK officials were also involved with the vaccination programme in Nigeria through the Foreign, Commonwealth Development Office.\nNigeria is not among the listed countries that need mandatory quarantine for 14 days in a supervised UK facility.\nThis is similar to our requirement to have travellers from the UK isolate for seven days upon arrival in Nigeria.\nJust like they stated clearly in their communication, the current listing of countries with approved vaccination certification has just started in the UK."
  },
  {
    "headline": "FG to Nigerian travellers: Be prepared for seven-day isolation in UK",
    "summarized_story": "Shuaib said the vaccines administered in Nigeria were approved by the UK Government.\nHe noted that the UK officials were also involved with the vaccination programme in Nigeria through the Foreign, Commonwealth Development Office.\nNigeria is not among the listed countries that need mandatory quarantine for 14 days in a supervised UK facility.\nThis is similar to our requirement to have travellers from the UK isolate for seven days upon arrival in Nigeria.\nJust like they stated clearly in their communication, the current listing of countries with approved vaccination certification has just started in the UK."
  },
  {
    "headline": "Killings: IGP posts new CP to Anambra",
    "summarized_story": "By CHIKA CHIMEZIEDeploys Police Special Forces to bolster Operation Restore PeaceThe Inspector-General of Police, IGP Usman Alkali Baba, psc (+), NPM, fdc has ordered the immediate posting of a new Commissioner of Police (CP) to Anambra State.\nThe new CP, Echeng Eworo Echeng, takes over from CP Tony Olofu who has been redeployed to the Force Headquarters, Abuja.\nThe IGP has also ordered the deployment of a detachment of NPF Special Forces to Anambra State to bolster and complement the ongoing peace-building efforts of the Nigeria Police Operation Restore Peace in Anambra State.\nHe has also served as a former Police Component Commander, Joint Task Force, Operation Delta Safe, Deputy Commissioner of Police in-charge of Zonal CID, Zone-13, Ukpo, Anambra State, amongst other key positions.\nThe IGP has charged the new Police Chief to work with other Stakeholders and patriotic forces in Anambra State to restore law and order leveraging on his professional experience."
  },
  {
    "headline": "Killings: IGP posts new CP to Anambra",
    "summarized_story": "By CHIKA CHIMEZIEDeploys Police Special Forces to bolster Operation Restore PeaceThe Inspector-General of Police, IGP Usman Alkali Baba, psc (+), NPM, fdc has ordered the immediate posting of a new Commissioner of Police (CP) to Anambra State.\nThe new CP, Echeng Eworo Echeng, takes over from CP Tony Olofu who has been redeployed to the Force Headquarters, Abuja.\nThe IGP has also ordered the deployment of a detachment of NPF Special Forces to Anambra State to bolster and complement the ongoing peace-building efforts of the Nigeria Police Operation Restore Peace in Anambra State.\nHe has also served as a former Police Component Commander, Joint Task Force, Operation Delta Safe, Deputy Commissioner of Police in-charge of Zonal CID, Zone-13, Ukpo, Anambra State, amongst other key positions.\nThe IGP has charged the new Police Chief to work with other Stakeholders and patriotic forces in Anambra State to restore law and order leveraging on his professional experience."
  },
  {
    "headline": "Buhari presides over FEC meeting (Photos)",
    "summarized_story": "President Muhammadu Buhari on Wednesday presided over the Federal Executive Council (FEC) meeting at the State House, Abuja, Nigeria.\nThe meeting was attended by the Vice President, Prof. Yemi Osinbajo, Secretary to the Federal Government, Boss Mustapha; Chief of Staff, Prof. Ibrahim Gambari, among others.\nSee photos below"
  },
  {
    "headline": "Cardi B, Lil Baby, Megan Stallion win big at BET Hip Hop award",
    "summarized_story": "Hip Hop stars Lil Baby, Cardi B and Meghan The Stallion were artists that won big at the BET Hip Hop awards ceremony.\nLil Baby won multiple awards, including Artist of the Year while Cardi B and Megan Thee Stallion took home three awards for their hit song “WAP.”Other winners at the event are Yung Bleu who was named Best New Hip Hop Artist, and J. Cole who emerged Lyricist of the Year.\nHip-Hop Album of the Year“Call Me If You Get Lost” – Tyler, the CreatorSong of the YearCardi B feat.\nMegan Thee Stallion – “WAP”Hip-Hop Artist of the YearLil BabyBest Hip-Hop VideoCardi B feat.\nMegan Thee Stallion – “WAP”Best New Hip-Hop ArtistYung BleuRelated News When Ice Prince Launched His Sophomore AlbumBest CollaborationCardi B feat."
  },
  {
    "headline": "BREAKING: Former Senator, Mama Taraba’s Brother, Is Dead",
    "summarized_story": "The late Abdulazeez was the younger brother of Hajiya Aisha Jummai Alhassan, alias Mama Taraba, ex-Minister of Women Affairs, who also died in May.\nThe deceased was elected twice into the Senate and represented Taraba central senatorial zone between 1999 and 2007.\nAccording to a statement from his family, funeral prayers will be conducted at 1.30 pm at the palace of Emir of Muri.\nThe funeral prayers for his deceased sister were held at the same place.\nHe will be buried at Jika da Fari burial ground, where late Jummai was also buried."
  },
  {
    "headline": "Nnamdi Kanu: You Can’t stop it-At-home order – IPOB Fires Back At Southeast Govs",
    "summarized_story": "IPOB, the Indigenous People of Biafra, reacted to the Southeast governors’ decision on its sit-at-home order on Wednesday.\nIPOB spokesman, Emma Powerful, said Southeast governors cannot stop the sit-at-home order in the region.\nSouth-East governors have no stand to stop it.\n“IPOB can only stop sit-at-home because they initiated it.\n“So South-East governors cannot do anything unless IPOB and the public do."
  },
  {
    "headline": "Declare IPOB As Terrorists For Establishing Militants’ Arm, Cut Their Funding – American Don Tells US Government",
    "summarized_story": "The American don gave reasons it is necessary for Biden’s government to designate IPOB as a terrorist group.\nHe said the establishment of the Eastern Security Network (ESN) by IPOB signalled the end of the group’s “pretences of being a peaceful movement”.\nSheehan accused IPOB leader, Nnamdi Kanu of supporting terrorism and issuing threats via Radio Biafra.\n“Nnamdi Kanu, IPOB’s leader, is clearly unconcerned.\nIPOB leader, Nnamdi Kanu was however, subsequently arrested in Kenya in June, 2021, and presently detained in the custody of the Department of State Services (DSS)."
  },
  {
    "headline": "NCC Disqualifies Nigerians Below 18 From Getting SIM",
    "summarized_story": "Anyone under the age of 18 is ineligible to register and own a Subscriber Identity Module in Nigeria, according to the Nigerian Communications Commission.\nThis is according to the draft copy of the modified Registration of Telephone Subscribers Regulations published on the commission’s website.\nIn the modified regulations, NCC limited telecoms subscribers to only include anyone above the age of 18.\nThe regulations were made in line with the powers conferred upon the commission by section 70 of the Nigerian Communications Act,2003.\nThe NCC, however, insisted on 18 years and above for anyone who wants to own and register a SIM in Nigeria."
  },
  {
    "headline": "Breaking: At last, Super Eagles first choice goalkeeper arrives ahead CAR FIFA World Cup qualifier",
    "summarized_story": "With barely 24 hours to FIFA World cup qualifier, Super Eagles first choice goalkeeper, Maduka Okoye, on Wednesday morning arrived the camp of the team in Lagos ahead of Central AIfrica Republic (CAR) clash slated for Thursday.\nThe Sparta Rotterdam goalkeeper was the last player to jet into the camp after 22 players resumed training on TuesdayNeither Okoye, nor Super Eagles officials have explained why he arrived camp late as at the time of filling this report.\nOthers are: William Ekong, Frank Onyeka, Leon Balogun, Joseph Aribo, Calvin Bassey, Ola Aina, Ahmed Musa, Shehu Abdullahi, Francis Uzoho, Kenneth Omeruo, Victor Osimhen, Kelechi Iheanacho, Simon Moses and Maduka Okoye.\nNigeria will take on CAR in a double-header qualifier at the Teslim Balogun Stadium and the eturn leg will hold in Duoala, Cameroon on Sunday October 10.\nSuper Eagles of Nigeria top Group c of the Qatar World Cup qualifying race with maximum points from two matches."
  },
  {
    "headline": "Breaking: 1 dead as building collapses in Abuja",
    "summarized_story": "A two storey building under construction in Abuja early Wednesday collapsed and killed one occupant.\nAccording to eyewitness, the collapsed building is located behind CITEC Estate along Airport road, Jabi.\nConfirming the incident, the Director-General, Federal Capital Territory (FCT) Emergency Management Authority (FEMA), Alhaji Abbas Idris, said the sad incident occurred by around 1am.\nDetails loading…"
  },
  {
    "headline": "2023 Presidency: PDP under pressure to reverse govs’ zoning arrangement",
    "summarized_story": "Ahead of Thursday’s National Executive Committee of the Peoples Democratic Party (PDP), members and leaders of the main opposition party are mounting pressure on the leadership to reject the zoning arrangement as proposed by the Governor Ifeanyi Ugwuanyi-led committee.\nEven when that observation was raised at the meeting, a certain Governor from the South- South bullied everybody to ignore something as fundamental as that,” Salau said.\n“The report is self-serving, ridiculous and embarrassing because the PDP NEC empowered and mandated the committee to recommend zoning of party offices.\n“It is on this note that we humbly demand that the National Executive Committee of our great party reject in its entirety the submissions of the zoning committee.\nCoordinator of the PDP National Youth Wing, Northwest Zone, Hon."
  },
  {
    "headline": "Agitation In The South-East Has Been Hijacked By Criminals, Says Umahi",
    "summarized_story": "﻿Chairman of the South-East Governors Forum David Umahi has decried the degeneration of what started as a cry against marginalisation into violence in the region.\nUmahi, who is also the Governor of Ebonyi State, said this when he appeared on Channels TV’s breakfast show Sunrise Daily on Wednesday.\nA lot of people keyed into that,” Governor Umahi said of the initial agitations in the region.\nAnd so, followers kept growing.”According to the governor, the situation worsened when the conflicts with herdsmen came up.\nThese politicians, he said, “began to import killers from outside the South-East to advance their political interests”."
  },
  {
    "headline": "‘Ebube Agu’ To Take Off Before End Of 2021 – South-East Governors",
    "summarized_story": "The South-East Governors Forum has said that the ‘Ebube Agu’ security outfit will be established in all southeast states before the end of the year.\nThe governors said this as part of their eight-point agenda during a meeting that took place at the Enugu State Government House on Tuesday.\n“The meeting agreed that the South-East Ebube Agu security outfit be launched in all the southeast states and laws passed in various southeast states before the end of 2021,” the communique read.\nThe security outfit was established in April as part of plans to checkmate the rising unrest in the region, stemming from an increase in criminal activities.\nSpeaking about the November 6 Anambra governorship elections, the governors resolved to show their support and also directed security agencies to ensure a peaceful election in the state."
  },
  {
    "headline": "FG To Pay Undergraduates Studying Education N75,000",
    "summarized_story": "The Federal Government has proposed to pay the sum of N75,000 per semester for undergraduates studying education courses in public institutions and N50,000 for those who enroll for a National Certificate In Education (N.C.E.)\nThe Minister of Education, Adamu Adamu, disclosed this on Tuesday during the celebration of this year’s World Teachers’ Day in Abuja as the Federal Government reintroduces bursary awards.\nAccording to Adamu, the fund would be sourced from UBEC, TETFund, and managed by the Federal Scholarship Board.\nConstruction is expected to take off in phases in Kaltungo, Bauchi State: Daura, Katsina State; Monguno, Borno State; Shendam, Plateau State, Wannune, Benue State; Ugep, Cross River State; Ayede, Oyo State; Ohodo, Enugu State; and Orogun in Delta State.\nMeanwhile, the Nigerian Union of Teachers (NUT) says primary and secondary school teachers in states yet to implement the new National Minimum Wage may soon be forced to withdraw their services."
  },
  {
    "headline": "President Buhari To Present 2022 Budget To NASS On Thursday",
    "summarized_story": "President Muhammadu Buhari will present the 2022 Appropriation Bill to a joint session of the Senate and House of Representatives on Thursday.\nHe made the announcement while presiding over the plenary as the Senate President, Ahmad Lawan, was absent.\nBefore the announcement, Senator Omo-Agege informed the lawmakers that President Buhari has submitted the revised 2022-2024 Medium Term Expenditure Framework MTEF and Fiscal Strategy Paper (FSP).\nThe revision, according to President Buhari, will reflect funds for the Independent National Electoral Commission (INEC) to prepare for the 2023 general elections.\nPresident Buhari had presented a proposed 2021 Budget of N13.08 trillion, to the National Assembly on October 8, 2020."
  },
  {
    "headline": "Duo Wins Nobel Chemistry Prize For Work On Catalysts",
    "summarized_story": "Germany’s Benjamin List and David MacMillan of the United States on Wednesday won the Nobel Chemistry Prize for their development of a precise new tool for molecular construction which has helped make chemistry greener, the jury said.\nThis has had a great impact on pharmaceutical research, and has made chemistry greener,” the Nobel Committee said.\nI was sitting at breakfast with my wife,” List told reporters by telephone during a press conference after the prize was announced.\nThe Nobel season continues with the two most closely watched prizes, literature on Thursday and peace on Friday.\nThe medicine prize kicked off the 2021 Nobel season on Monday, going to David Julius and Ardem Patapoutian for breakthroughs that paved the way for the treatment of chronic pain."
  },
  {
    "headline": "IGP Redeploys Anambra CP, Olofu, replaces him with Echeng",
    "summarized_story": "The Inspector-General of Police, IGP Usman Alkali Baba, has ordered the immediate posting of a new Commissioner of Police (CP) to Anambra State.\nThe new CP, Echeng Eworo Echeng, takes over from CP Tony Olofu who has been redeployed to the Force Headquarters, Abuja.\nThe IGP has also ordered the deployment of a detachment of NPF Special Forces to Anambra State to bolster and complement the ongoing peace-building efforts of the Nigeria Police Operation Restore Peace in Anambra State.\nCP Echeng, who until his recent posting, was the Commissioner of Police in-charge of Bayelsa State, holds a First Degree in History from the University of Maiduguri.\nThe IGP has charged the new Police Chief to work with other Stakeholders and patriotic forces in Anambra State to restore law and order leveraging on his professional experience."
  },
  {
    "headline": "CP Elkanah, Senior Police Officers Visit Troops, Urge Them To Be Proactive -",
    "summarized_story": "As part of its effort to curtail security challenges along the troubled Kaura Namoda – Shinkafi road, the Commissioner of Police Zamfara State Command Ayuba Elkana and other senior officers visited three Tactical pin down points in the stateThe areas are Dan Bita/ Dogon Karfe, Hawan Bakwai and Konar Jalop that’s in Shinkafi local government areaCommunities and commuters along Kaura Namoda – Shinkafi road have suffered attacks by armed bandits in the last few weeksIn a press statement signed by the PPRO Mohammed Shehu says, the purpose of the visit is to assess the existing security emplacement along the route with a view to boost the morale of troops and know their operational strength and capacityThe statement adds that the move is to enhance the performance of troops during the ongoing onslaught against BanditsCP Elkanah commended the resilience of security agencies in making the road safe for commuters and further charge them to be more proactive and vigilant so as to deal with any attempt to attack innocent people plying the road and its environsHe adds that police hirachy is fully aware of the unalloyed commitment in the ongoing fight against criminal elements and urged them to sustain the tempo especially in the affected communitiesOn the existing new security measures implemented by the State Government, the Zamfara police boss warned officers and men against any compromise, as anyone found guilty will be sanctioned accordingly."
  },
  {
    "headline": "Olu Jacobs is hale and hearty",
    "summarized_story": "Reports making the rounds that Veteran actor Olu Jacobs is dead is totally false.\nDispelling the death rumour, His wife Joke Sliva told journalists that; her husband is hale and Hearty and the news about his demise should be disregarded as there is no iota of truth in it.\nThe rumor is coming after Joke Sliva celebrated her 60th birthday a few days ago after Olu Jacobs made a surprise visit to her in a movie location, from the footage, Olu was looking frail and lean.\nThe video generated mixed reactions as some averred that he is looking sick while some are worried about his shrinking look.\nI would be recalled that last year, the same rumor of his demise was making the round but was quickly debunked by members of Nollywood and his family members."
  },
  {
    "headline": "South East Governors, Leaders urge residents to reject IPOB",
    "summarized_story": "The Southeast Stakeholders Meeting between Governors and leaders of the region has condemned the killings in the region, agreeing to join hands with security agencies to end the carnage.\nReading the outcome of the meeting after about 4 hours behind closed doors in Enugu, Chairman and Governor of Ebonyi State,Dave Umahi said they resolved to support security agencies to restore peace in the South East.\nThe group also condemned the Mondays Sit-at-Home order issued by members of the Proscribed Indigenous People of Biafra, urging governments and people of the region to reject It henceforth.\nThe meeting which had four Governors of the zone, with Anambra absent, resolved that the Sub-region security outfit codenamed Ebubeagu be launched in all the states before the end of 2021.\nIt unanimously resolved to support election in Anambra state, while directing security agencies to ensure peaceful election in the state come November 6th 2021."
  },
  {
    "headline": "Miyetti Allah Vows to Sue Southern Governors -Trending With Ojy Okpe",
    "summarized_story": "One of the umbrella bodies of herdsmen in Nigeria, the Miyetti Allah Kautal Hore on Tuesday, announced that herders won’t support any southern candidate who is against open grazing should he or she run for president in 2023.\nMeanwhile, reports reaching us, indicate that family members of a 16-year-old girl identified as Hussain are in dispute with the Accountant-General of the Federation, Ahmed Idris, after he allegedly lured the teenager with millions of naira to persuade her into marrying him as his 4th wife.\nAnd, Nigeria’s Vice President Professor “Yemi Osinbajo this year marked his 40th year as a professor…"
  },
  {
    "headline": "Ogunlewe: Tinubu Should Run for President in 2023",
    "summarized_story": "Former Lagos State governor and leader of the All Progressives Congress, Bola Ahmed Tinubu, has waited patiently in the wings for more than six yearsfor President Muhammadu Buhari’s tenure to come to a close.\nDespite recuperating for several weeks for an undisclosed ailment in London, the former governor has spent considerable resources to create the impression that he is physically capable of contesting for the presidency in 2023.\nSenator Adeseye Ogunlewe, a member of the APC and former Minister of Works joined the Morning Show on Tuesday to discuss Tinubu’s prospects among other issues of national importance…"
  },
  {
    "headline": "Nigeria: South-East Leaders Resolve to End IPOB’s Sit-at-Home Order",
    "summarized_story": "Leaders of the South East rose from an expanded security meeting Tuesday and resolved to do everything within the law to ensure that there was no further sit-at-home order by non-state actors in the zone.\nThe leaders also agreed to work with security agencies to end the rising insecurity in their part of the country, which has led to several killings and destruction of property.\nThe meeting agreed that the South East Ebubeagu security outfit be launched in all the states in the zone and laws supporting same passed before the end of 2021.\nThe meeting resolved to support election in Anambra State and directed security agencies to ensure a peaceful election in the state come November 6, 2021.\nOthers were members of the House of Assembly from the South East, the Catholic bishops of Nsukka and Enugu and the Archbishop of Enugu Ecclesiastical Province of the Church of Nigeria (Anglican Communion), Emmanuel Chukwuma, among other traditional rulers."
  },
  {
    "headline": "Ologbotsere Now a ‘Nickname’ as Olu of Warri Abolishes Title",
    "summarized_story": "The Olu of Warri, Ogiame Atuwatse III, on Tuesday, abolished the traditional title of Ologbotsere in Warri Kingdom.\nThe monarch made the pronouncement before descendants of the Ologbotsere family at a meeting in his palace.\n“There is no Ologbotsere title again.\nThe head of the Ologbotsere title can answer the nickname.\nOn the meeting between the monarch and the Ologbotsere family, the billionaire businessman and politician, said, “He (Olu of Warri) invited the Ologbotsere family for meeting and my people honoured him where he made the pronouncement."
  },
  {
    "headline": "Nigeria Senate Confirms EFCC Board Nominee Whose Resume Indicated He Started School Before Birth",
    "summarized_story": "The Nigerian Senate on Tuesday confirmed Yahaya Muhammad (Yobe) and four other nominees as board members and Secretary of the Economic and Financial Crimes Commission (EFCC).\nThis was despite complaint that Muhammad’s resume indicated that he started school before he was born.\nOthers confirmed by the Red Chamber included George Abang Ekungu (Cross River) as Secretary of the EFCC while Luqman Muhammed (Edo); Anumba Adaeze (Enugu); Alhaji Kola Raheem Adesina (Kwara) and Alhaji Yahaya Muhammad (Yobe) as board members of the EFCC.\n“Where the nominee according to record started his primary school before he was born.\nThe Deputy Senate President, Senator Ovie Omo-Agege who presided ignored the issue raised by Hadejia and confirmed Muhammad along with other four EFCC Board nominees."
  }
]