[
  {
    "headline": "Soot: Wike reads riot act, orders shut down of illegal refineries in Rivers",
    "summarized_story": "*Says FG complicit, to prosecute culpritsWorried by the environmental pollution caused by soot in parts of the Rivers State, Governor Nyesom Wike has ordered the immediate shut down of all illegal oil refining sites.\nThis is as he directed the Chairmen of Councils, particularly Port Harcourt City Local Government, to identify such sites and effect his order.\nHe has also directed all council Chairmen and community leaders to locate, identify and report to his office all those behind all illegal bunkering and crude oil refining sites in their localities for prosecution.\nWike, who gave the order in his 2022 New Year message on Saturday, said the directive stems from the failure of the Federal Government and its security agencies to rein in those behind illegal oil bunkering and artisanal crude oil refiners in the state.\nThe governor’s directive was contained in a statement issued by his Special Assistant on Media, Kelvin Ebiri, and made available to newsmen."
  },
  {
    "headline": "New Year stampede at Indian shrine kills 12",
    "summarized_story": "Twelve people were crushed to death in a stampede at an Indian religious shrine in the early hours of Saturday as tens of thousands of pilgrims massed to offer prayers, officials said.\nOfficials sought to blame an alleged altercation between two groups of youths and a rush of people for New Year’s Day.\nBefore the pandemic, every day about 100,000 devotees would trek up a steep winding track to the narrow cave containing the shrine to Vaishno Devi.\nThe shrine to Vaishno Devi, a manifestation of Hindu goddess Vaishnavi, is in the hills some 60 kilometres from the city of Jammu.\nModi, wearing a saffron scarf, rode a pony up to the shrine shortly before being elected in 2014."
  },
  {
    "headline": "New Year: Shun divisiveness, consolidate on gains, Sanwo-Olu urges Lagosians",
    "summarized_story": "Lagos State Governor Mr Babajide Sanwo-Olu, has advised Lagosians to shun all acts of divisiveness and embrace genuine love by consolidating on the gains made by individuals and the State in the outgoing year.\nSanwo-Olu gave this charge in his New Year message to Lagos residents, released by his Chief Press Secretary, Mr Gboyega Akosile, on the first day of the year 2022.\nThe Governor also congratulated Lagosians and Nigerians as a whole for witnessing the new year, saying the most important gift from God is the gift of life.\nHe said: “On behalf of my family and the government of Lagos State, I rejoice with Nigerians, particularly Lagosians, on the celebration of the new year – 2022.\n“I, therefore, urge all residents to shun acts of divisiveness and embrace true love for our nation and our dear State."
  },
  {
    "headline": "Tambuwal approves N1.6B for projects in Sokoto",
    "summarized_story": "By Musa Na Annabi SokotoSokoto state executive council has approved N1.631 billion for the execution of various developmental projects across the state this year.\nThis was part of the outcome of the state executive council meeting held at Government House, Sokoto on Friday.\nA breakdown of the sum shows that the construction of a tarred road from Maruda-Tsaki- Lambo-Gantamo-Gajara will gulp over N475 million while N221 million will be spent on the purchase of the bulk of rural water scheme maintenance equipment.\nThe state Commissioner for Information further gave the remaining breakdown asthe approval of the sum of over N420 million for the rehabilitation of 120 number broken water schemes in the rural areas of the state.\nThe Commissioner who was flanked by his Rural Development counterpart, Alhaji Usman Dan Madami Isa, added that the council has also approved the purchase of electrical equipment for use in rural areas at the cost of N515 million."
  },
  {
    "headline": "Uzodinma seeks renewed efforts at combating criminality in 2022",
    "summarized_story": "Governor Hope Uzodimma of Imo state has advocated a renewed and collective effort by the people of Imo state to stamp out violence and other forms of criminality in the state this year.\nIn his new year Message to the people of the state, Uzodimma pledged that the government will work in concert with the security agencies to ensure a safer Imo state in 2022 and beyond .\nUzodimma however noted that progress could only be made in an atmosphere of peace.\nHe noted that some opposition elements had sought to destabilize the state and arrest its progress, but expressed gratitude to God that they have been overwhelmed.\nThe governor enjoined citizens of the state to support the Government to work for the peace and progress of the state."
  },
  {
    "headline": "Wike condemns bandits attacks in Sokoto",
    "summarized_story": "By Davies Iheamnachor, PORT HARCOURTThe Governor of Rivers State, Chief Nyesom Wike, has wept over bandits attacks in Sokoto State, commiserating with the government and the Sultan for the unwarranted killing of innocent citizens.\nWike condemned the recent spate of killings in Sokoto, saying that the government and people of Rivers State consider the dastardly activities of rampaging bandits as barbaric.\nThe governor according to a statement in Port Harcourt by his Special Assistant on Media, Kelvin Ebiri, spoke when he and the Sokoto State Governor, Rt.\nWike expressed dismay over the wanton killing of innocent citizens by bandits in Sokoto and other parts of the country.\nHe said: “We have had a long-standing relationship and so the people of Rivers State have told me to commiserate with you and the people of Sokoto State."
  },
  {
    "headline": "Archbishop Sam Zuga sends 2022 New Year message to Nigerian youths, politicians, others",
    "summarized_story": "Through his Social media platforms, Sam Zuga penned his lengthy New Year message.\nI want to start by saying; the best way to solve a problem is to identify that problem.\nEveryone says the problem of Nigeria and Africa is poverty, but I identify the problem of Nigeria as Nigerians and Africans as the problem of Africa.\nThe major problem of Nigerians and Africans is ATTITUDE The way they think, the way they talk and the way they act.\n5 years was our target to see everyone who believe in my vision in Nigeria and Africa to be financially stable."
  },
  {
    "headline": "New Year: NAWOJ tasks Nigerians on peaceful coexistence",
    "summarized_story": "The Nigeria Association of Women Journalists, (NAWOJ), has called on Nigerians to remain steadfast and demonstrate more patriotism by shunning divisive tendencies and bigotry.\nLadi Bala, President of the association, made the call in a New Year message released on Saturday and made available to DAILY POST.\nThe number one woman journalist also urged Nigerians to focus on building a better and greater nation of their dreams where everyone is recognized and appreciated.\n“The New Year is here thus, the need for more commitment towards a better Nigeria by all concerned.\nAs Nigerians, we should as part of nation building take it as a collective responsibility to make things work for the collective good of all."
  },
  {
    "headline": "New Year message: ‘Let’s ensure success in the battle against evil’ – Gov Bello urges Nigerians",
    "summarized_story": "Niger State Governor and Chairman North Central States Governors’ Forum (NCSGF), Abubakar Sani Bello, has reiterated the commitment of his government to work towards successful actualization of programmes captured in the 2022 budget.\nHe further said security of the state will remain the administration’s major focus in the New Year in order to stop banditry and other criminal tendencies towards sustaining the relative peaceful and harmonious coexistence in the state.\n” I salute the gallantry of the military and all security agencies involved in the fight against insecurity and I appeal to the people to play their individual and or collective roles to ensure success in the battle against evil,” stated.\nThe governor thanked Nigerlites for their support to the administration assuring that, with more support and cooperation, the state government will focus on realizing its goal of transforming the state.\n“As we celebrate the New Year, we must put the interest of the state over and above other considerations and work towards attaining our collective aspirations”, the governor further stated."
  },
  {
    "headline": "Ex-LAWSAN President, Agbomhere gets AFBA’s appointment",
    "summarized_story": "The African Bar Association Section on Taxation and Finance Law (AFBA-ST&FL), has appointed a former National President of the Law Students Association of Nigeria (LAWSAN), Dr.\nBlessing Agbomhere, as its Director of Corporate, Intergovernmental and Strategic Commerce.\nThe AFBA-ST&FL made the appointment in a letter signed by its President, Hannibal Uwaifo Esq., dated December 30, 2021 and addressed to Dr. Agbomhere, in Abuja.\n“Your tenure of office is for 2 (two) years renewable by the President upon satisfactory performance and your line of reporting is to the President.\n“Seeking funding, sponsorships and other benefits for the AFBA and any other duties assigned by the President or the Executive Council."
  },
  {
    "headline": "Nigeria not a failed nation – Oyo Assembly Speaker, Ogundoyin",
    "summarized_story": "Speaker, Oyo State House of Assembly, Adebo Ogundoyin, has advised Nigerians to jettison pessimistic thoughts about Nigeria.\nOgundoyin,who spoke on Friday, explained that Nigeria is not a failed nation.\nDAILY POST recalls that some personalities and groups that have been following happenings in the country, had earlier predicted that Nigeria has already failed as a nation.\nBut, Ogundoyin, while addressing journalists Friday night, advised his fellow countrymen and women to desist from making negative predictions about the country.\nHe said, “Nigeria has always been a promising nation with great and unlimited potentials."
  },
  {
    "headline": "New Year message: God will crush political oppressors of Nigerians in 2022 – Pastor Giwa",
    "summarized_story": "A popular Nigerian cleric, Pastor Adewale Giwa, has disclosed that the wrath of God will visit those behind the doldrums and quagmire facing Nigeria.\nPastor Giwa, who is the Senior Pastor of the Awaiting the Second Coming of Jesus Christ Ministry, Akure, Ondo State, stated this in his New Year message to Nigerians and the country.\nIn the message made available to DAILY POST, the pastor who said God will rise for Nigerians in 2022 disclosed that God gave him the revelation to deliver to the people.\nAccording to Pastor Giwa, 2022 will be a year of turnaround for Nigerians, emphasising that those responsible for the nation’s current woes will not escape the anger of God.\n“It is the promise of God that the political oppressors of Nigeria shall remain no more."
  },
  {
    "headline": "Clubbers harrassing our wives, daughters, Ibadan residents cry out",
    "summarized_story": "Residents of Bodija Estate in Ibadan, the Oyo State capital, have said they can no longer sleep due to noise from many night clubs in the area.\nThe residents urged the Oyo State Housing Corporation to address likely security breaches in the estate.\n- Advertisement -He said: “We are miffed by the development in Bodija Estate as residents.\n“We know that the ‘conversion’ of Bodija Estate to commercial plots did not start today.\n“That was why we decided to be quiet when the Oyo State Housing Corporation started giving approval for nightclubs."
  },
  {
    "headline": "FG extends NIN-SIM linkage deadline to March 31,",
    "summarized_story": "The Federal Government has further extended the deadline for the National Identification Number (NIN)-Subscriber Identity Module (SIM) data verification to the 31st of March, 2022.\nMinister of Communications and Digital Economy, Prof. Isa Pantami, in a statement, added that there has been a significant growth in the number of National Identity Number (NIN) enrolments and the increased drive to enlighten Nigerians and legal residents across the country.\nAs of December 30, 2021, the National Identity Management Commission (NIMC) had issued over 71million NINs with over 14,000 enrolment centres set up across the country.\nFurthermore, NIMC has also set up enrolment centres in over 31 countries to cater for Nigerians in the Diaspora.\n- Advertisement -“Following the request by stakeholders, including citizens, legal residents and Nigerians in the diaspora, the Federal Government has extended the deadline of the exercise to the 31st of March, 2022."
  },
  {
    "headline": "Tony Kabaka: No permanent friend, foes in politics",
    "summarized_story": "The Youth Leader of the All Progressives Congress (APC) in Edo State, Mr. Tony Adun, popularly known as Tony Kabaka, who made fame as a die-hard loyalist of former Governor Adams Oshiomhole, is in the news.\nIt will be recalled that Kabaka and the government had been at logger heads over the location of his hotel.\nThe Obaseki administration eventually demolished the facility on the ground that it was located on land acquired by the government.\nKabaka thanked Obaseki for his kind gesture and forgiving spirit, adding that politics is not a do-or-die affair.\n“Politics is a game; the opposition party criticizes the government to enable them work effectively for the people of Edo State and also develop the State."
  },
  {
    "headline": "I’m not at war with Buhari, says Sunday Igboho",
    "summarized_story": "YORUBA Nation campaigner, Sunday Adeyemo, popularly known as Sunday Igboho, says he is not at war with the President Muhammadu Buhari, the six governors in the Southwest zone or any government official.\nHe, however, stressed that it was saddening that the Buhari regime has not addressed the security challenges in the Southwest Zone, which he said was the genesis of his agitation for Yoruba Nation.\nIgboho, in his 2022 New Year message, said everyone living in the country deserves to be protected regardless of their tribe, religion or political leanings.\nThe New Year message was signed by one of the activist’s lawyers in Nigeria, Pelumi Olajengbesi, on behalf of his client.\nIt reads: “Let it be abundantly clear that I am not at war with President Buhari, the governors or anybody in government."
  },
  {
    "headline": "Buhari to Nigerians: Expect more jobs in 2022",
    "summarized_story": "New jobs are on the way for Nigerians in the new year, according to President Muhammadu Buhari.\nHe called on Nigerians to continue to adhere strictly to COVID-19 safety guidelines in order to be insulated from the pandemic.\nOn the Electoral Act Amendment Bill, which President Muhammadu Buhari vetoed, the Deputy President of the Senate assured Nigerians that legislators would consult widely with their constituents before the National Assembly resumes on January 18, 2022.\n“We assure Nigerians that within the first week of resumption, we will come up with a workable solution to resolve the impasse.\n“I am imploring Nigerians to continue to have faith in God and be rest assured that whatever that is currently difficult at present moment will be resolved."
  },
  {
    "headline": "2022: Ohanaeze, YCE, ACF, others make demands from Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has said that notwithstanding the threat of insecurity in the country, his administration remains resolute to continue with its programmes and plans.\nHe said this in his New Year message to Nigerians as the country joins the rest of the world to welcome 2022.\nPresident Buhari noted that to win the war on insecurity, the hearts and minds of the affected citizens must be won.\nThe 5.1% growth at that time was and remains the highest growth recorded by the Nigerian economy since 2014.\nAs we welcome 2022, let us, with hope, envision a year of continued progress against our combined challenges arising from security and socio-economic issues."
  },
  {
    "headline": "New Year: Jonathan, Atiku, Kalu, Oyetola, Tinubu, Anyim, others preach hope, peace",
    "summarized_story": "“Across the world, there is a global demand for justice, peace, hope, security and sustainable development.\nAtiku tasks Nigerians on peace, unityFrom Ndubuisi Orji, AbujaFormer Vice President, Atiku Abubakar has charged Nigerians to commit themselves to the pursuit of peace and unity in the New Year.\nHe urged the people to continue to support his administration’s policies and programmes so as to achieve more desired development.\nIn his new year message, the former Senate President noted that 2022 offers us new hope and fresh opportunities.\n“From the ashes of 2021, I see hope for Nigerians in the New Year 2022."
  },
  {
    "headline": "Excitement in Abia North, as Kalu spreads joy to more constituents",
    "summarized_story": "By Kenneth UdehChief Whip of the Senate, Senator Orji Uzor Kalu on Friday extended distribution of empowerment materials to agricultural practitioners and artisans in his Abia North constituency.\nDuring the previous exercise, Kalu had distributed a set of 350 motorcycles, 200 sewing machines and other empowerment kits to Isuikwuato Local Government Area of Abia North Senatorial District.\nYesterday, the Senate Chief Whip extended the distribution of the self-reliance items to ward constituents in Bende Local Goverment area.\nThe benefiting wards include; Igbere A, Igbere B, Alayi, Item A, Item B, Item C, Ugwueke/Ezeukwu, Umuhu, Ozuitem, Bende, Nkpaumuimenyi, Uzuakoli and Itumbuzo.\nHe pointed out that the two remaining local governments in Abia North (Ohafia and Arochukwu) will adequately receive their own materials in due time."
  },
  {
    "headline": "Bayelsa: Pastor, six others die in New Year Eve boat mishap",
    "summarized_story": "From Femi Folaranmi YenagoaA New Year eve boat mishap has thrown Ogbinbiri community in the Southern Ijaw Local Government Area of Bayelsa state into mourning following the death of a 39-year- old pastor and six others.\nThe deceased pastor identified as Pastor Salvation Degemy, was the General Overseer of the Supernatural Church of God located in the community.\nThe other victims included a husband, his sick wife, two children and other relatives travelling to Yenagoa from the community.\n“Pastor Salvation Degemy was travelling with them to engage in prayer for the dying patient,” the source said.\nCommunity sources said the tragic event has disrupted the New Year celebration in the community as many people are mourning."
  },
  {
    "headline": "They slit her throat, stabbed her to death",
    "summarized_story": "She was allegedly killed by one Sikemi Olajiga, 31, daughter of Pastor Olajiga, a minister with the Redeemed Christian Church of God (RCCG) in Ado-Ekiti.\nPastor Olajiga came out of his house and he said ah, God will make you see her.\nBut I noticed something, in the morning when I was looking for Demilade, Pastor Olajiga was putting on a blue shirt when he came out.\nSo, immediately I dropped in front of Joy Estate, I sighted Pastor Olajiga.\nThey brought Pastor Olajiga and his wife out, I asked that what have I done to them to deserve this?"
  },
  {
    "headline": "As 2022 Rolls in, Buhari Preaches Unity, Hope, Resilience, Forgiveness",
    "summarized_story": "On the economy, he said his administration had shown a high level of resilience to record some significant achievements despite the turbulence that has characterised the nation’s economy and the global economy.\nAs we welcome 2022, let us, with hope, envision a year of continued progress against our combined challenges arising from security and socio-economic issues.\n“As it is said, the past is but a story told, the future will still be written in gold.\nLet us be united in our fight to keep our nation united against all odds and with gratitude, celebrate life in this new epoch.\nI wish you a very happy and prosperous New Year.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Lawan: Senate to Review Electoral Bill, 1999 Constitution January",
    "summarized_story": "*Says lawmakers will find way forward on direct primary clauseOur CorrespondentsThe President of the Senate, Ahmad Lawan yesterday announced that the Senate would review the rejected Electoral Act Amendment Bill and the 1999 Constitution immediately it resumes plenary on January 18.\nThe National Assembly transmitted the Bill to President Muhammadu Buhari on November 19, last year, with recommendations on electronic transmission of results and direct primaries for political parties, among others.\nIn a New Year statement he personally signed, titled “Let’s keep faith in Nigeria,” Lawan said the Electoral Act Amendment Bill was handled with the spirit of patriotism, even though it was rejected by the President.\nWe are determined to deliver an Electoral Act that stands the test of time in safeguarding democracy and the electoral process in Nigeria.\n“We are also looking forward to receiving the report of our Committee on the Review of the 1999 Constitution upon our resumption from recess."
  },
  {
    "headline": "Budget 2022: President Laments Alterations By N’Assembly, Signs Reluctantly",
    "summarized_story": "*Ready to submit amendment bill early 2022, assents to 2021 finance billDeji Elumoye in AbujaAfter expressing deep concern about changes effected on the 2022 budget by the National Assembly, President Muhammadu Buhari yesterday reluctantly signed the N17.127 trillion 2022 Appropriation Bill into law.\nBuhari said the lawmakers reduced the amount allocated to some projects, but added 6,576 projects of their own to the 2022 budget.\n‘‘It is in this regard that I must express my reservations about many of the changes that the National Assembly has made to the 2022 Executive Budget proposal.\nTo achieve the laudable objectives of the 2022 Budget, President Buhari pledged that the federal government would further intensify revenue mobilisation efforts.\n‘‘I count on the cooperation of the National Assembly for a quick consideration and approval of the Plan when submitted."
  },
  {
    "headline": "Brown Ebewele is Dead",
    "summarized_story": "A former Nigerian athlete and administrator, Brown Ebewele is dead.\nEbewele fondly called ‘Juju Man’ died on Friday afternoon at a private hospital in Warri, Delta State after a surgery.\nThe success of Team Nigeria at the 2003 African Games hosted by Nigeria in Abuja was partly due to the efforts of Ebewele.\nAt various times, he led such states as Delta, Kano, Borno and Edo to decent outings at the National Sports Festival.\nHis last outing was helping Team Edo to finish as runners up at the much postponed NSF which held last April in Benin City."
  },
  {
    "headline": "Breaking: FCT Minister Tests Positive for COVID-19",
    "summarized_story": "Olawale Ajimotokan in AbujaFCT Minister Muhammed Musa Bello has tested positive for COVID-19.\nThe minister said he decided to do a COVID-19 test on Thursday morning after feeling unwell from December 28.\nHe disclosed the test came out positive on Friday morning.\n“After feeling unwell from 28th December, I decided to do a COVID-19 test yesterday morning.\nHe also urged all those who have not been vaccinated against COVID-19 to do so."
  },
  {
    "headline": "EXCLUSIVE: Petroleum Trust Development Fund Boss Accused Of Corruption, Nepotism, Fraudulent Contract Award",
    "summarized_story": "The Executive Secretary of the Petroleum Trust Development Fund, Dr Bello Aliyu Gusau, has been accused of awarding fraudulent contracts without recourse to procedure and due process.\n“Dr Gusau has turned the PTDF to an extension of his state where only his kinsmen are seen clutching files and folders from the procurement department.\nHe further added that the Executive Secretary has formed the habit of bragging about his untouchable status in the President Muhammadu Buhari-led administration.\n“From all indications, it seems the ES has political ambition, or he is sponsoring a political party or candidate in his home state.\nThis is largely responsible for how he has turned the PTDF into an extension of his state."
  },
  {
    "headline": "EXCLUSIVE: Petroleum Trust Development Fund Boss Accused Of Corruption, Nepotism, Fraudulent Contract Award",
    "summarized_story": "The Executive Secretary of the Petroleum Trust Development Fund, Dr Bello Aliyu Gusau, has been accused of awarding fraudulent contracts without recourse to procedure and due process.\n“Dr Gusau has turned the PTDF to an extension of his state where only his kinsmen are seen clutching files and folders from the procurement department.\nHe further added that the Executive Secretary has formed the habit of bragging about his untouchable status in the President Muhammadu Buhari-led administration.\n“From all indications, it seems the ES has political ambition, or he is sponsoring a political party or candidate in his home state.\nThis is largely responsible for how he has turned the PTDF into an extension of his state."
  },
  {
    "headline": "Nigerian Economy Was Characterised By Turbulence But We Survived – Buhari Boasts In New Year Message",
    "summarized_story": "President Muhammadu Buhari has assessed his administration’s performances in various sectors of the economy in the outgoing year 2021, declaring that the recovery of the nation’s economy remained on a steady path throughout the year.\nAccording to the President, the country recorded some significant achievements in the year despite the turbulence that characterised the economy.\n“On the economy, we have shown a high level of resilience to record some significant achievements despite the turbulence that has characterised our economy and indeed the global economy.\nThe 5.1% growth at that time was and remains the highest growth recorded by the Nigerian economy since 2014.\nNgige had said the government took borrowed funds from foreign institutions like the World Bank to offset some recurrent expenditures."
  },
  {
    "headline": "Nigerian Economy Was Characterised By Turbulence But We Survived – Buhari Boasts In New Year Message",
    "summarized_story": "President Muhammadu Buhari has assessed his administration’s performances in various sectors of the economy in the outgoing year 2021, declaring that the recovery of the nation’s economy remained on a steady path throughout the year.\nAccording to the President, the country recorded some significant achievements in the year despite the turbulence that characterised the economy.\n“On the economy, we have shown a high level of resilience to record some significant achievements despite the turbulence that has characterised our economy and indeed the global economy.\nThe 5.1% growth at that time was and remains the highest growth recorded by the Nigerian economy since 2014.\nNgige had said the government took borrowed funds from foreign institutions like the World Bank to offset some recurrent expenditures."
  },
  {
    "headline": "Nigerian Economy Was Characterised By Turbulence But We Survived – Buhari Boasts In New Year Message",
    "summarized_story": "President Muhammadu Buhari has assessed his administration’s performances in various sectors of the economy in the outgoing year 2021, declaring that the recovery of the nation’s economy remained on a steady path throughout the year.\nAccording to the President, the country recorded some significant achievements in the year despite the turbulence that characterised the economy.\n“On the economy, we have shown a high level of resilience to record some significant achievements despite the turbulence that has characterised our economy and indeed the global economy.\nThe 5.1% growth at that time was and remains the highest growth recorded by the Nigerian economy since 2014.\nNgige had said the government took borrowed funds from foreign institutions like the World Bank to offset some recurrent expenditures."
  },
  {
    "headline": "QUESTION: With Osimhen, Dennis out... who'll score for Eagles at AFCON?",
    "summarized_story": "AdvertisementVictor Osimhen and Emmanuel Dennis were replaced in the Super Eagles 28-man provisional list by Henry Onyekuru and Peter Olayinka respectively over controversial reasons.\nOsimhen, who plays for Napoli, pulled out of the squad after testing positive for COVID-19 — a few days to AFCON.\nThe 22-year-old was involved in nine of the team’s 13 goals last year; scored seven times and set up another two.\nHe was the Eagles’ highest goal scorer as the team secured an AFCON ticket and qualified for the final round of qualifiers for the Qatar 2022 World Cup.\nOnly Mohammed Salah (15 goals, 9 assists) has more contribution than Dennis (8 goals, 5 assists) this season."
  },
  {
    "headline": "QUESTION: With Osimhen, Dennis out... who'll score for Eagles at AFCON?",
    "summarized_story": "AdvertisementVictor Osimhen and Emmanuel Dennis were replaced in the Super Eagles 28-man provisional list by Henry Onyekuru and Peter Olayinka respectively over controversial reasons.\nOsimhen, who plays for Napoli, pulled out of the squad after testing positive for COVID-19 — a few days to AFCON.\nThe 22-year-old was involved in nine of the team’s 13 goals last year; scored seven times and set up another two.\nHe was the Eagles’ highest goal scorer as the team secured an AFCON ticket and qualified for the final round of qualifiers for the Qatar 2022 World Cup.\nOnly Mohammed Salah (15 goals, 9 assists) has more contribution than Dennis (8 goals, 5 assists) this season."
  },
  {
    "headline": "INSIDE STORY: Bauchi, Kano communities crumble under weight of cholera as WASH projects lie fallow",
    "summarized_story": "In faraway Bauchi state, Asiya Umar can also relate to such pain, only that she risks losing more.\nWith 19,558 cases, Bauchi is the state worst hit by the cholera outbreak.\nShe needs urgent and proper medical attention but the ill-equipped cholera unit of the hospital is giving him little room for optimism.\nAdvertisement“If you look at where we isolate those with cholera cases, it is not convenient.\nAcross Bauchi, Warji, and Ganjuma LGAs in Bauchi state, residents live in unhygienic conditions while some of the WASH projects that could have helped tackle the outbreak are mostly not operational."
  },
  {
    "headline": "INSIDE STORY: Bauchi, Kano communities crumble under weight of cholera as WASH projects lie fallow",
    "summarized_story": "In faraway Bauchi state, Asiya Umar can also relate to such pain, only that she risks losing more.\nWith 19,558 cases, Bauchi is the state worst hit by the cholera outbreak.\nShe needs urgent and proper medical attention but the ill-equipped cholera unit of the hospital is giving him little room for optimism.\nAdvertisement“If you look at where we isolate those with cholera cases, it is not convenient.\nAcross Bauchi, Warji, and Ganjuma LGAs in Bauchi state, residents live in unhygienic conditions while some of the WASH projects that could have helped tackle the outbreak are mostly not operational."
  },
  {
    "headline": "Daily COVID Tracker: Nigeria reports 828 infections in 16 states, one fatality",
    "summarized_story": "Nigeria on Friday recorded 828 cases of COVID-19.\nHong Kong says Omicron spread locally despite strict COVID rulesAdvertisementHong Kong says the Omicron variant of COVID-19 has spread within communities despite strict containment measures.\nNigeria records 828 COVID casesAdvertisementCOVID-19 infection spread across 15 states and the federal capital territory (FCT) on Friday as the Nigeria Centre for Disease Control (NCDC) logged 828 new cases.\n828 new cases of #COVID19Nigeria;Lagos-550Oyo-87FCT-69Kwara-31Akwa Ibom-22Bauchi-19Ekiti-16Delta-11Kaduna-10Ogun-3Anambra-3Plateau-2Bayelsa-2Nasarawa-1Katsina-1Jigawa-1The NCDC said 11 cases reported for Delta are for 30th (5), and 31st (6) of December 2021.\nUganda to reopen schools, bars in January since March 2020Uganda President Yoweri Museveni says this month the country will lift COVID-19 containment measures put in place since March 2020, including reopening of schools, bars and nightclubs."
  },
  {
    "headline": "TechCabal Wrapped: Here’s what you enjoyed reading from TechCabal in 2021",
    "summarized_story": "I joined TechCabal in January of this year to help drive TechCabal’s transition from a Nigerian tech publication to a pan-African tech and media publication.\nTechCabal Wrapped is our way of walking you through our most-loved and most-read articles in 2021.\n🥂 Koromone Koroye, Managing EditorHere’s what you enjoyed reading from TechCabal in 2021In 2021, TechCabal published 683 articles, 265 editions of TC Daily—including this one—and 50 editions of Next Wave.\nHow Herconomy raised a $600,000 pre-seed round in 24 hoursIn 2021, Nigerian startups raised about $1.4 billion.\nThe African tech ecosystem mourns the passing of Nnena Nkongho, an African investor who championed diversity and excellence."
  },
  {
    "headline": "21 things that happened for the first time in 2021 in the African tech scene",
    "summarized_story": "2021 has been a noteworthy year that has seen the African tech sector bounce back from the difficulties it faced in 2020.\nHere’s a list of 21 things that happened for the first time in the African tech scene this year.\nThe African startup ecosystem raised a record $4 billion+ in venture capital funding2021 year was a landmark year for the African tech ecosystem, raising over $4 billion via 754 deals in venture capital funding.\nMFS Africa acquired Baxi.\nTwitter opened its first Africa office in GhanaIn April 2021 social media giant Twitter announced Ghana as its choice for an African headquarters."
  },
  {
    "headline": "Ask an Investor: Twelve insights from Africa’s top investors",
    "summarized_story": "While most people easily associate investors with just money, Founders Factory Africa (FFA) would rather have you think of more.\nMeghan Curran, West African Director of Acumen, explained this: “In our model, nothing goes back to the investors because the investors in the first place are donors.\nBefore the boom, Sawari Ventures, which was founded over a decade ago, has been backing North African startups.\nNow I’ve seen some term sheets where the investors ask that if the founder opts to pay back the investment, the investor gets some amount of free equity in the company.\nToday, LoftyInc operates three funds that have deployed over $12 million into over 75 African startups like Flutterwave, Andela and Trella."
  },
  {
    "headline": "Inside Jack Dorsey’s Btrust members’ plan to facilitate financial freedom",
    "summarized_story": "In 2020, he co-founded Recursive Capital, a venture capital that provides crypto-focused startups with seed and early-stage investments, with the aim of contributing to the development of the Web 3.0 ecosystem.\nDespite being founded before the Web 3.0 buzz, Recursive Capital had decided that it wanted to enhance financial freedom by decentralising the financial monetary system.\nTalking about the barrier to entry for Bitcoin, Khalil believes a misconception lies in the way people approach it.\nKhalil believes in educating and enlightening individuals about Bitcoin’s long-term benefits: economic freedom for the entire continent.\nOchai believes that bitcoin will eventually become a viable medium for Africans to do business without restrictions."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "Techpoint Africa is 7! The next frontier",
    "summarized_story": "Techpoint Africa has been in business for exactly seven years!!\nThemed “The next frontier“, Techpoint Build promises to be, as always, the largest gathering of innovators, startup founders, thinkers, programmers, policymakers, and investors in West Africa.\nAs part of the activities for Techpoint Build, five of 15 shortlisted startups from across Africa will compete for $10,000 in equity-free grant money.\nTo receive an invite to the dinner, you have to purchase a VIP ticket to Techpoint Build.\nTechpoint Africa Membership ProgrammeIn October 2021, we activated our Membership Programme to zero fanfare."
  },
  {
    "headline": "10 memorable moments for African tech in 2021",
    "summarized_story": "As the year ends, we bring you a few memorable moments across the African tech ecosystem, some good and some bad.\nMore African investors throw their hats in the ringKola Aina, pioneer founder Ventures Platform fundFor so long, most of the investment into African startups came from foreign investors.\nHowever, more African investors are springing up and providing much-needed funding for African startups.\nFor so long, it has been argued that Nigerian startup founders need to be proactive in their interactions with the government and regulators.\nAs a result, some of the country’s most prominent founders and investors came together to work on the Nigerian Startup Bill."
  },
  {
    "headline": "Reviewing Nigerian fintech in 2021: Local investors are stepping up",
    "summarized_story": "Share this article:Between January and September 2021, African fintechs raised up to $1.4 billion, signalling an increasing investor appetite for Africa’s growing fintech space, and Nigeria has taken centre stage.\nAccording to data gathered by Intelligence by Techpoint, Nigerian fintech startups raised almost $800 million in 2021.\nBut, so far, there’ve been massive improvements in the fintech space beyond smartphone apps.\nIn January 2021, Olowe made some interesting predictions which, in the real sense, are educated guesses based on the trends from past years, and we created a little analysis.\n“I must admit that MTN would find it really tough to play in the financial space."
  },
  {
    "headline": "In New Year message, Buhari promises to seek support to tackle insecurity",
    "summarized_story": "President Muhammadu Buhari has said his administration would seek collaboration with international partners and neighboring countries by exploring diverse strategies at addressing security at the grassroots to check the spate of insecurity in the country.\nPresident Buhari has received constant criticism over his administration’s failure to address the worsening insecurity in the country, check spate of killings and kidnapping which has become a daily affair.\nKukah noted that Buhari and his government must move quickly before Arewa, and the Northern part of the country descends into Arewanistan.\n“We equally remember and commiserate with Nigerians who have lost loved ones as a result of insecurity in different parts of the country.\nThe 5.1% growth at that time was and remains the highest growth recorded by the Nigerian economy since 2014."
  },
  {
    "headline": "Small business Saturday new year’s edition",
    "summarized_story": "As we ring in a new year, we are back with our Small Business Saturday feature, highlighting Made in Nigeria products curated by Lehle Balde.\nBy Lehle BaldeWax it LagosThe wellness and beauty industry in Nigeria are probably the most sophisticated on the African continent.\nWax It Lagos is a wellness and beauty spa located in the heart of Lekki Phase 1 in Lagos Nigeria.\nThey offer body waxing, sugar wax, massage, scrubs, threading, a nail studio, facials and beauty products.\nI discovered Wax it Lagos earlier in the fourth quarter and I have to say it was a wonderful experience."
  },
  {
    "headline": "Apapa: An app breathes life into a ‘Ghost town’, limits extortions",
    "summarized_story": "Shipping a 40-foot container from China to the Apapa Port could cost N500,000 for the 10,540-kilometre voyage, but taking the same out of Apapa to Sango-Ota in Ogun state, cost N1 million as of 2020 for a distance of 38 kilometres.\nDubbed Nigeria’s premier port, Apapa as a community was an enclave for elites several years ago.\nThe congestion in Apapa meant government was losing, businesses were losing but the ultimate winners were security agents and street urchins in charge of extortions at multiple checkpoints.\nAs BusinessDay learnt, fleet owners can register multiple trucks under a single account for either export or import.\nThe multiple checkpoints affect not only truckers, but also the automation system, which should not have human interference."
  },
  {
    "headline": "‘Edo APC’s call for state of emergency should be directed at FG’ – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – That the Edo State Chapter of the All Progressives Congress (APC) have the temerity to convene a press conference and raise issues about governance and development is not only a slap on the faces of citizens of Edo State, but a sign of selective amnesia.\nCan Edo APC not see that their call for a state of emergency should be more appropriately directed to a federal government, which they lead, that has reduced the value of Nigerian lives to near nothing?\nDoes the party want a state of emergency in a state where every flight, or bus coming into the state is fully booked with air carriers and road transporters jostling to keep up with the pressure of travellers trooping into the state?\nIt is rather shameful for old men – grandfathers, for that matter – to sit comfortably, look into the camera and tell bare-faced lies about the Edo State Judiciary, the state legislature, the newly reconstructed Government Science and Technical College (GSTC), street-lighting project, Edo Tech Park, Edo Innovation Hub, among others.\nThe PDP-led government in Edo State has and will continue to put the interest of the people over and above the interest of all others."
  },
  {
    "headline": "Edo to launch cluster farm initiatives, others to boost oil palm devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government plans to launch the state’s Oil Palm Development initiative and Cluster Farm initiative, as part of ongoing reforms in the agricultural sector to grow the state’s economy and achieve food security.\nThe governor, who spoke to journalists in Benin City, said his administration is committed to stimulating economic prosperity and improving ease of doing business to continuously attract private capital to engender sustainable development.\nAccording to him, “Motivated by the progress recorded with the Edo State Oil Palm Programme (ESOPP), we will be launching the Oil Palm Development initiative and Cluster Farm initiative, in furtherance of our aim of anchoring our economic growth on commercial agriculture while sustaining food security.”Noting that Edo, with the cultivation of 120,000 hectares, has the largest oil palm plantation under cultivation in the country, Obaseki added, “We have put under cultivation up to 250,000 hectares of land for oil palm under our ESOPP programme.\nToday, we are approaching about 120,000 hectares.\n“We are providing our people with an oasis of hope even with the harsh realities that confront us as a sub-national in a country that is confronted by a number of developmental challenges.”..."
  },
  {
    "headline": "Obaseki swears in seven SSAs, 25 SAs in Oredo LGA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Wednesday, swore in seven Senior Special Assistants (SSAs) and 25 Special Assistants (SAs), following harmonisation by leaders and members of the Peoples Democratic Party (PDP) in Oredo Local Government Area (LGA).\nThe governor said, “I had to wait, take my time and ensure harmonization of the party in the LGA before making this appointment.\nPolitics in Oredo LGA is very sensitive and the barometer through which Edo politics is judged.\nIf we fail to get Oredo right, it will be difficult and challenging to get Edo State politics right.\n“I have divided Oredo into 20 zones for development purposes as data are available for every household in Oredo."
  },
  {
    "headline": "Edo boosts security on waterways with eight new gun, speedboats – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… builds modern jetty, marine base, others for security personnelBENIN CITY – The Edo State Government, through the State’s Oil and Gas Producing Areas Development Commission (EDSOGPADEC) has procured additional four armoured gunboats and four speedboats to curb criminal activities along the state’s coastal areas and waterways.\nThe Chairman of EDSOGPADEC, Pastor Kennedy Osifo, who spoke to journalists, on behalf of other board members, immediately after inspecting the gun and speed boats, said the commission has now acquired eight gunboats and eight speed boats to strengthen security on its waterways and stop the activities of sea pirates.\nHe said the new armoured equipment will improve security in three oil and gas producing communities, including Ologbo in Ikpoba-Okha Local Government Area (LGA) and Gelegele, Ovia North East LGA of the state.\nOsifo revealed that the commission has completed the construction of a marine base at Ologbo River, as well as a modern jetty with a waiting lounge and other essential facilities for passengers and police officers in Ologbo Community in Ikpoba-Okha.\nThe EDSOGPADEC chair, who charged residents on protection of public facilities, said the commission will sustain efforts at improving the livelihoods of Edo people, which according to him, is a priority of the present administration of Governor Obaseki."
  },
  {
    "headline": "For the Record: Text of President Muhammadu Buhari’s New Year Speech",
    "summarized_story": "There is no doubt that the issue of Security remains at the front burner of priority areas that this Administration has given utmost attention to.\nWe remain fully committed to upholding the constitutional provisions that protect all Nigerians from any form of internal and external aggression.\nOn the economy, we have shown a high level of resilience to record some significant achievements despite the turbulence that has characterized our economy and indeed the global economy.\nThe 5.1% growth at that time was and remains the highest growth recorded by the Nigerian economy since 2014.\nLet us be united in our fight to keep our Nation united against all odds and with gratitude, celebrate life in this new epoch."
  },
  {
    "headline": "CBN adjusts forex rate, naira slides down to N435/$1 at official market",
    "summarized_story": "In what appears to be another devaluation of the naira, the Central Bank of Nigeria (CBN) on Friday, adjusted the country’s exchange rate on its website to N413.49/$1, causing the naira to tumble to N435 against the dollar at the official market.\nThe CBN had in May, devalued the naira from N379 to N411/$1 by adopting the (I&E) window.\nThe naira was quoted as high as N445.50 per dollar during the intra-day trading.\nThe apex bank has devalued the exchange rate multiple times since March 2020 as it tries to bridge the disparity between the official and parallel market rates.\nAt the parallel market, the local currency stabled at N570 to a dollar."
  },
  {
    "headline": "Oyetola urges Osun people to approach New Year with renewed hope, faith",
    "summarized_story": "He urged the people of the state to approach the new year with renewed hope and faith, just as he appreciated them for their patience, support, cooperation and construtive criticism, shown to his government.\nOyetola further said: “2022 is no doubt an election year for us in Osun.\n“Our goal is to achieve inclusive socio-economic growth that is rooted in our 10-Year Osun Development Plan (2019-2028).\nOur plan rests on four developmental pillars: Economic Development, Infrastructure Development, Human Capital Development and Security, and Environmental Sustainability.\nHowever, I enjoin our people to maintain the undying spirit and enter 2022 with renewed hope and faith."
  },
  {
    "headline": "Osun PDP Ilode Ward 1, Ife East refutes purported suspension of Wale Oladipo",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe executive members of Ilode ward 1, Ife East Local Government of People’s Democratic Party, PDP, in Osun State, has refuted the purported suspension of the erstwhile national secretary of the party, Prof. Wale Oladipo by some “unscrupulous elements” who, according them, are not known to the executive members of the party in the ward.\nThe executive members dismissed the alleged suspension as baseless, unfounded and far from the truth.\nThis was contained in a release issued and signed by the current PDP Chairman of the ward, Prince Omotosho Lawrence and authenticated by all members of the Ward Exco after their weekly meeting on Friday.\nThey are warned in their own interest to desist from such act henceforth, otherwise they will face the wrath of Law”It would be recall that a self styled executive committee of the Peoples Democratic Party (PDP) in ward 002, Ilode 1, Ile-Ife, allegedly suspended former National Secretary of the party, Prof Wale Oladipo over what they described as anti-party activities.\nBut the executive members of the party in Ilode ward 1 promptly met to serve a final warning to all impersonators masquerading as Party exco in order to truncate the chances of the Party in 2022."
  },
  {
    "headline": "Shisha: The Irresistible Lethal Killer Wrapped In Flavour",
    "summarized_story": "ADVERTISEMENTFirstly, the top two most common reasons for smoking shisha LEADERSHIP Weekend gathered were: “no specific reason, shisha is trendy” “I want to have a feel of it” , implying shisha is gaining popularity among nightclub patrons and flavour.\nADVERTISEMENTSpeaking on why she cannot resist smoking shisha, Blessing Johnson noted she cannot resist smoking shisha as it gives her joy and she loves smoking it.\nDr. Abdullahi said there is a need for an immediate response from policy providers towards shisha smoking intervention in Nigeria.\nHowever, findings show that shisha smoking is now rampant and addicted users have graduated from visiting nightclubs and shisha cafes to ownership of shisha paraphernalia in their homes.\nA report published by the Pan African Medical Journal, entitled: Shisha smoking in selected nightclubs in Nigeria’’ shows that shisha smoking is prevalent in nightclubs and has peculiar demographic correlates different from cigarette smoking."
  },
  {
    "headline": "Enter 2022 With Optimism, Positive Disposition, Archbishop Tells Nigerians",
    "summarized_story": "Dr Alfred Adewale Martins has enjoined Nigerians to be optimistic and to embrace a positive mind-set as they enter the New Year 2022, filled with renewed trust in God Almighty.\nIn his New Year message signed by the Director of Social Communications, Rev.\nHe, however, urged Nigerians to look beyond the shortfalls and negatives of the past and approach the New Year with optimism and positive expectations.\nHe advised Nigerians to shun every attempt to create fear and apprehension by the predictions of doom that are being circulated in the social media space.\nOn our part, we must do that which is right and good towards our neighbours, living in peace and harmony with everyone."
  },
  {
    "headline": "Reflect On 2021 Lessons In 2022, Gombe Governor Tasks Nigerians",
    "summarized_story": "Governor Inuwa Yahaya of Gombe State has tasked residents of the state and other Nigerians to reflect and draw on the lessons learned in 2021 in all aspects of human endeavour.\nThis is even as the governor expressed optimism that the year 2022 would be a bright and prosperous one for both the state and Nigeria.\nHe acknowledged the resilience and perseverance of people of the state in the midst of socio-economic difficulties occasioned by the COVID-19 pandemic.\nADVERTISEMENTThe governor enjoined the people to maintain the undying spirit and enter 2022 with hope and renewed faith.\n“The year 2022 holds a great promise for all of us through improved security, youths and women empowerment and greater attention to infrastructural development across sectors."
  },
  {
    "headline": "We See Abundance, Prosperity For Nigeria In 2022 – Southern Senators",
    "summarized_story": "The Southern Senators Forum has optimised that in year 2020, there would be abundance and prosperity for the people of Nigeria.\nThe forum in a statement signed by Senator Bamidele for New year celebration urged all Nigerians to continue to have faith in God and be rest assured that whatever that is currently difficult will definitely be solved.\nIt said Nigeria could only savour the expected economic prosperity and gains when unity is guaranteed and security of lives and property is assured for rapid investment.\nThe forum added that God does not create human beings for hardship because when He created man and woman in the Garden of Eden, they were created in the midst of abundance.\nADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "SEVEN TIPS on: 2022 NEW YEAR CELEBRATIONS AROUND THE WORLD",
    "summarized_story": "Their New Year’s Day is typically celebrated in the fall, around the middle of September.\nADVERTISEMENTNOWRUZ (300 MILLION)The “New Day” (in Syrian) is celebrated through many Middle Eastern countries, including Iran, Iraq, Turkey, Syria and Afghanistan, to name a few.\nThis New Year’s Day shifts yearly, based on the March equinox, marking the day when the hours of night and day are roughly equivalent.\nTherefore, pinning down a specific new year’s celebration for India and/or Hindu celebrations is problematic-at-best.\nThat said, many of the different regions’ and sects’ celebrations revolve around the beginning of spring – usually around the middle of April."
  },
  {
    "headline": "HAPPY NEW YEAR! FROM ALL OF US @ DAYLIGHT MEDIA GROUP (DMG)",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, DAYLIGHT will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "HAPPY NEW YEAR! FROM ALL OF US @ DAYLIGHT MEDIA GROUP (DMG)",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, DAYLIGHT will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "BurnaBoy rubbishes Davido for saying he made $22.3m in 2021",
    "summarized_story": "BurnaBoy rubbishes Davido for saying he made $22.3m in 2021BurnaBoy rubbishes Davido for saying he made $22.3m in 2021Singer Davido has revealed that he made $22.3 million, which is about N13 billion, in 2021.\nThe singer disclosed this on his Instastories when he wrote: “Made 22.3 million dollars this year, talk to shit!\n!”However, he didn’t give further details if the sum of money was made on from his music alone or other businesses.\nReacting to Davido’s revelation, his colleague and Grammy-award winner, BurnaBoy, shared an indirect post on his Instastories, calling a certain person a liar.\nHis post read: “Plenty talk na lie lie full inside.” EagleonlineShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "BurnaBoy rubbishes Davido for saying he made $22.3m in 2021",
    "summarized_story": "BurnaBoy rubbishes Davido for saying he made $22.3m in 2021BurnaBoy rubbishes Davido for saying he made $22.3m in 2021Singer Davido has revealed that he made $22.3 million, which is about N13 billion, in 2021.\nThe singer disclosed this on his Instastories when he wrote: “Made 22.3 million dollars this year, talk to shit!\n!”However, he didn’t give further details if the sum of money was made on from his music alone or other businesses.\nReacting to Davido’s revelation, his colleague and Grammy-award winner, BurnaBoy, shared an indirect post on his Instastories, calling a certain person a liar.\nHis post read: “Plenty talk na lie lie full inside.” EagleonlineShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "2022: FCT Minister reels out achievements, hints on ‘busy political year’, others, sensitise residents in New Year message",
    "summarized_story": "The Minister of the Federal Capital Territory (FCT) Malam Muhammad Musa Bello has commended residents for exhibiting the virtues of unity, tolerance and peaceful co-existence in the outgone 2021.\nHe said so far, the FCT administration has made tremendous achievements in education, health, economy and other sectors of infrastructural development within the capital territory.\nThe FCT Administration remains committed towards the wellbeing and welfare of every resident and our efforts at maintaining very high standards in the administration of the Territory yielded positive results in the preceding year.\nEqually, students of the FCT School of Nursing scored a perfect 100% pass in the final Nursing Council examinations.\nI therefore wish to commend the efforts of our security agencies and military formations in keeping the Federal Capital Territory safe over the last 12 months."
  },
  {
    "headline": "2022: Nigerian leaders must render account to God, Anglican Bishop declares",
    "summarized_story": "The Bishop of Anglican Communion, Kaduna Diocese, Timothy Yahaya, has urged Nigerian leaders to lead and carry out their duties to the people with fear of God, as they must render account to God.\nHe urged Nigerians not to lose hope, while predicting that there will be recovery and transformation in the New Year as God will show the people mercy.\nHe said, “they campaigned to stamp out corruption, but so far everybody on the street knows factually that there is corruption everywhere.\nThe fight against corruption should not be only when people have looted the country.\n“My new year message to Nigerians is that there is still hope, in this year, we should not lose hope."
  },
  {
    "headline": "FCT Minister tests positive for COVID-19",
    "summarized_story": "Minister of the Federal Capital Territory Minister(FCT), Malam Muhammad Musa Bello, has tested positive to COVID-19.\nHe said the medical personnel attending to him informed him that his case is mild because he has taken two shots of the COVID-19 vaccine.\nHis words: “I have tested positive for COVID-19.\n“I salute and wish all the medical personnel in the FCT and beyond who have been in the front line fighting this pandemic a happy and prosperous new year 2022.\nI appeal to all those who have not been vaccinated against COVID-19 to do so."
  },
  {
    "headline": "Happy New Year! Nigeria Joins Rest Of The World To Usher In 2022",
    "summarized_story": "Nigeria has joined the rest of the world in ushering in 2022 after another tumultuous and pandemic-ridden year capped by soaring case numbers, insecurity, economic challenges, and a slight glimmer of hope for better times ahead.\nReligious bodies such as the Christian Association of Nigeria had earlier called on citizens to pray for God’s mercy in 2022.\nElsewhere across the world, 2022 was ushered in with scaled-back celebrations due to new restrictions aimed at slowing soaring Covid cases — although hope remained for a better new year.\nTrying TimesThe World Health Organization has warned of trying times ahead, saying Omicron could lead to “a tsunami of cases”.\nExperts and non-experts alike hope that 2022 may be remembered as a new, less deadly phase of the pandemic."
  },
  {
    "headline": "PHOTOS: Prayers, Jubilation As Nigerians Cross Over Into New Year",
    "summarized_story": "Nigerians on Friday night joined the rest of the world to usher in the new year with prayers and jubilation.\nDuring a visit to some churches where crossover services were held, many worshippers were seen praying into 2022 and after the ‘Happy New Year’ declaration, it was jubilation everywhere.\nAfter another pandemic-ridden year accompanied by rising cases of COVID, insecurity, and economic challenges among others, most Nigerians believe they have a reason to celebrate.\nWhile worshippers vibe to melodious sounds of songs and beats, others took to the streets to shoot fireworks as a way of celebrating the beginning of another year.\nThe photos below, taken by Channels TV’s Sodiq Adelakun, capture how the crossover went in some parts of the Federal Capital Territory (FCT)."
  },
  {
    "headline": "Expect Continued Progress Against Our Challenges In New Year, Buhari Tells Nigerians",
    "summarized_story": "President Muhammadu Buhari has asked Nigerians to envision a year of continued progress against the nation’s combined challenges arising from security and socio-economic issues.\nHe gave the charge on Friday in his New Year message to Nigerians to usher in the year 2022.\nThe President also used the occasion to highlight some of the efforts made so far by his administration, and what Nigerians should expect in the areas of security, economy, and anti-corruption fight, among others.\nThe 5.1% growth at that time was and remains the highest growth recorded by the Nigerian economy since 2014.\nAs we welcome 2022, let us, with hope, envision a year of continued progress against our combined challenges arising from security and socio-economic issues."
  },
  {
    "headline": "Pray For God’s Mercy, CAN Tells Nigerians In New Year Message",
    "summarized_story": "The Christian Association of Nigeria has called on Nigerians to pray for God’s mercy in 2022.\n“I call on all Nigerians, irrespective of their religious affiliations, to rise up and cry for the mercy of God that can preserve us and bring an end to all these pains.\n“Except for the mercy of God to intervene divinely and miraculously, we would be like Sodom and Gomorrah.\n“For the Lord, our God is a merciful God.\nThat same God will surely have mercy on our country in Jesus’ name,” he said."
  },
  {
    "headline": "ATP Cup: Bautista Agut Leads Spain To Crushing Win Over Chile",
    "summarized_story": "Roberto Bautista Agut got Spain’s New Year off to a perfect start Saturday with a crushing ATP Cup win over Chilian world number 17 Cristian Garin as he spearheads the team in Rafael Nadal’s absence.\nThe 33-year-old, ranked two places below Garin, barely broke a sweat in the 6-0, 6-3 win at the Ken Rosewall Arena in Sydney, ensuring Spain won their Group A tie on day one of the season-opening tournament.\nEach tie comprises two singles matches and one doubles with the winning nation from each of the four groups making the semi-finals.\nIn the other morning tie, Argentina cruised past Georgia with world number 13 Diego Schwartzman annihilating 22nd-ranked Nikoloz Basilashvili 6-1, 6-2.\n“It’s always very difficult to start a tie, so I was very happy when Federico beat his opponent very quickly, very easily,” said Schwartzman."
  },
  {
    "headline": "Gov. Ugwuanyi signs N186.64 billion 2022 budget into law",
    "summarized_story": "Enugu state Governor, Ifeanyi Ugwuanyi has assented to the 2022 appropriation bill of 186,64 billion naira recently passed by the State House of Assembly.\nPresenting the appropriation bill to Governor Ugwuanyi for assent, the Speaker of the State House of Assembly, Edward Ubosi disclosed that the budget proposal was a wonderful budget of international standard.\nUbosi explained that all the Ministries, Departments and Agencies (MDAs) appeared before the various committees to ensure they defended their budget estimates.\nAssenting to the appropriation bill, Governor Ugwuanyi expressed gratitude to God and the members of the State House of Assembly for their commitment and dedication to legislative duties as well as the development of Enugu State.\nHe expressed confidence that the budget would be implemented faithfully for the people of the state to enjoy more dividends of democracy."
  },
  {
    "headline": "Tinubu condoles with Gov Ganduje, Sharia Council over Sheikh Datti Ahmed's death -",
    "summarized_story": "The All Progressives Congress National Leader, Asiwaju Bola Tinubu, has commiserated with Kano State Governor Abdullahi Ganduje and the Supreme Council for Sharia in Nigeria over the death of elder-statesman and president of the council, Dr. Datti Ahmed.\nHe said throughout his life, Dr. Ahmed symbolised and fought for justice, equity and fairness adding that his demise was a loss not only to the Muslim community in Nigeria but to all Nigerians.\n“As a first generation medical doctor from Kano State, Dr. Ahmed dedicated his life to the service of humanity.\n“The death of Dr. Ahmed is a great loss to the medical community in Nigeria and the comity of Islamic scholars.\n“My condolences to his family, Kano State Governor Abdullahi Ganduje, the government and people of the state, Muslims across the country, and Nigerians as a whole."
  },
  {
    "headline": "Auditor General indicts NASS over alleged misappropriation of N9.4b -",
    "summarized_story": "The Office of the Auditor General for the Federation has indicted the management of the National Assembly and the National Assembly Service Commission for alleged unexplained expenditure amounting to N9.4 billion in the 2019 financial year.\nThe report said about N5.5 billion of such expenditure was credited to the House of Representatives in five different audit queries, N3.5 billion credited to the Senate in seven audit queries, while N307.6 million was credited to the National Assembly Service Commission in two audit queries.\nThe queries are contained in the Auditor General’s annual report on non-compliance and internal control weaknesses issues in Ministries, departments and agencies of the federal government for the year ended 31st December 2019.\nThe Report addressed to the Clerk to the National Assembly was signed by the Auditor General for the Federation, Adolphus Aghughu.\nThe report said N2.5 billion was granted to members of the House of Representatives as running costs between July and December 2019 without evidence to show what the funds were used for even as it was not retired."
  },
  {
    "headline": "Somali President suspends PM Roble, accuses him of undermining legislative elections",
    "summarized_story": "President of Somalia Mohamed Abdullahi Mohamed stated Monday that he is suspending Prime Minister Mohamed Hussein Roble, widening the political schism between the country’s top officials.\nAccording to a spokeswoman for President Mohamed, also known as Farmajo, the move was taken in response to an investigation into an illegal acquisition of public land involving Prime Minister Roble.\nThe prime minister accused Mohamed of obstructing parliamentary elections, prompting Roble’s suspension.\nEarlier this year, the feuding leaders agreed to enable 101 delegates to choose members of parliament, who would then choose the future head of state.\nObservers fear that the feud between Farmajo and Roble will divert attention away from the ongoing threat posed by the al Shabab insurgent group, which has fought the central government in an attempt to seize power and impose sharia law in Somalia, which has been wracked by chaos and conflict since the overthrow of former dictator Mohamed Siad Barre in 1991."
  },
  {
    "headline": "Anthony Kila: Lai Muhammed’s List is like an Essay of an Average Student",
    "summarized_story": "Thursday, Lai Mohammed, Nigeria’s Minister of Information and Culture, listed 100 achievements of the Muhammadu Buhari administration in 2021, concluding that the government gave a good account of itself.\nMohammed said the many achievements were attained despite the challenges posed by widespread insecurity in the country and the COVID-19 pandemic.\nHowever, the question lingering on the minds of many Nigerians is whether the achievements presented by the minister had any meaningful impact on their lives and livelihoods.\nNow, joining us to assess the administration’s scorecard in 2021 and help us to separate facts from fiction, is Anthony Kila, a professor of strategy and development, and Director of the Centre for International Advanced & Professional Studies.\nGood morning Prof Kila and thank you for joining us…"
  },
  {
    "headline": "Ndubisi Nwokoma: No Hope That 2022 Budget Will Be Different From the Previous One",
    "summarized_story": "Today all eyes will be on President Muhammad Buhari to assent to the National Assembly transmitted 2022 budget.\nThe Clerk to the National Assembly, Amos Ojo, forwarded the letter to the president alongside a letter dated 24 December and titled “Appropriation Bill 2022”.\nHowever, before passing the budget, the lawmakers had increased the total expenditure from N16.3 trillion to N17.1 trillion – showing an increase of over N700 billion.\nIn the budget, statutory transfer was put at N869.6 billion, debt service at N3,88 trillion, recurrent (non-debt) expenditure at N6.9 trillion and capital expenditure at N5,46 trillion.\nJoining us now for an in-depth analysis of the transmitted 2022 Budget, is PROFESSOR NDUBISI NWOKOMA."
  },
  {
    "headline": "Several Dead in Stampede at Religious Shrine in Kashmir",
    "summarized_story": "At least 12 people have died and 13 injured in a stampede at a religious shrine in Indian-administered Kashmir.\nThe disaster happened around 3am (21:30 GMT) while it was still dark on the route to the Vaishno Devi shrine, one of the country’s most revered Hindu sites.\nThe Mata Vaishno Devi is one of the most revered Hindu shrines in northern India, with tens of thousands visiting to offer prayers every day.\nIn October 2013, a stampede in Madhya Pradesh state in central India killed more than 110 people, mostly women and children.\nTwo stampedes in as many months in India in 2008 left more than 370 Hindus dead."
  },
  {
    "headline": "WHO Chief Optimistic Covid Will Be Beaten in 2022",
    "summarized_story": "The World Health Organization (WHO) chief says he is optimistic that the coronavirus pandemic will be defeated in 2022, provided countries work together to contain its spread.\nDr Tedros Adhanom Ghebreyesu warned against “narrow nationalism and vaccine hoarding” in a new year statement.\nHis comments come two years since the WHO was first notified of cases of an unknown pneumonia strain in China.\n“If we end inequity, we end the pandemic,” he added.\nThe WHO has set a new goal for 2022: vaccinate 70% of people in all countries by July to end the pandemic."
  },
  {
    "headline": "South Africa’s Anti-Apartheid Veteran Archbishop Tutu to Be Laid to Rest on Saturday in State Funeral",
    "summarized_story": "Archbishop Desmond Tutu, a hero of the struggle against apartheid in South Africa, will be laid to rest on Saturday in an official state funeral in St George’s Cathedral, Cape Town, where for years he preached against racial injustice.\nPresident Cyril Ramaphosa is expected to deliver the main eulogy for Tutu, whose death on Sunday aged 90 triggered an outpouring of tributes from around the world.\nWidely revered across South Africa’s racial and cultural divides for his moral integrity, Tutu never stopped fighting for his vision of a “Rainbow Nation”, in which all races in post-apartheid South Africa could live in harmony.\nAs Anglican archbishop of Cape Town, Tutu turned St George’s into a refuge for anti-apartheid activists during the turbulent 1980s and 1990s when security forces brutally repressed the mass democratic movement.\nChurch bells have tolled daily this week at St George’s in honour of the man often described as South Africa’s “moral compass”."
  }
]