[
  {
    "headline": "Ogun denies involvement as monarch withdraws Okorocha’s chieftaincy title",
    "summarized_story": "The first class monarch had few weeks ago named Okorocha the Otunba Asoludero of Iselu kingdom through a letter signed by the monarch.\nOkorocha had also accepted the chieftaincy title and a September 19, 2021 date had been set for the installation ceremony.\nIt was further gathered that the monarch was asked to withdraw the chieftaincy title and cancel the proposed ceremony.\n“My advice to Your Excellency is that you should continue to help the needy in Nigera, especially through your Foundation.”The Commissioner for Local Government and Chieftaincy Affairs, Afolabi Afuape, denied the government involvement in the withdrawal of the chieftaincy title.\nHe said, “It is left to him, I don’t know because he was the one that chose to give a chieftaincy title and he wrote me."
  },
  {
    "headline": "Ongoing doctors’ strike is one too many",
    "summarized_story": "Like Nigerian lecturers, doctors have used the strike option too frequently and without considering the plight of patients, who are often the most vulnerable.\nHowever, doctors, as the apex medical professionals, should employ the strike option only as a last resort.\nStudents suffer when universities are grounded by striking lecturers, the economy is harmed when oil sector workers down tools, and commuters are stranded when transport unions strike.\nAs their colleagues do elsewhere, Nigerian doctors should adopt a strategy whereby some members will down tools while others continue working.\nWhen in April 2016, junior doctors in the UK went on strike over new working contracts, it was only for two days."
  },
  {
    "headline": "Insecurity caused by failure to utilise solid mineral sector – Masari",
    "summarized_story": "Governor Aminu Bello Masari of Katsina State has attributed the persistent spate of insecurity bedeviling most parts of the country to the failure to fully exploit the solid mineral resources with which the nation is abundantly blessed.\nGovernor Masari made the remarks on Monday when he paid a courtesy visit to the Minister of Mines and Steel Development, Architect Olamilekan Adegbite in Abuja.\nThe Governor also asserted that the agitations for resource control and restructuring would be out of fashion when the nation’s other resources, such as solid minerals, are fully exploited and harnessed.\nAccording to the Katsina State Governor, every state in the nation was sufficiently endowed with one mineral resource or the other, which if fully utilised, there would be sufficient engagement for the youth to render criminal activities unnecessary.\nSimilarly, he expressed the belief that “agitation for resource development and restructuring will all away go away with the development of the various mineral resources each state is endowed with”."
  },
  {
    "headline": "Secession threats: ‘National Assembly must pave way for needed changes’ – Malumfashi",
    "summarized_story": "A lecturer with the Abubakar Tafawa Balewa University (ATBU), Bauchi, Professor Mansur Usman Malumfashi, has called on the National Assembly to urgently provide the constitutional platform that will accommodate changes in Nigeria, even as he declared that the country’s foundation is shaky.\nHe said that as of today, every geopolitical zone in the country was experiencing one form of challenge or the other, adding members of the National Assembly were required to bring about the changes being demanded by the zones.\nHe said the National Assembly had great roles to play in the current agitations for restructuring, declaring that the legislature were empowered to bring the change the people wanted.\nAccording to him, “the National Assembly or Parliament must work together for the general good of the country.\nWe have had situations where members of the National Assembly would be involved in padding the budget for whatever reasons and at the end of the day whatever is padded is not meant for the people."
  },
  {
    "headline": "216 Nigerians die of malaria daily – FG",
    "summarized_story": "The Nigerian government has said nine persons die of malaria every nine hours.\nMinister of Health, Osagie Ehanire, said this in Abeokuta, the Ogun State capital on Monday, while leading a delegation of Advocacy Against Malaria to the Ogun State Government.\nAccording to him, one out of every four persons having malaria in the world lives in Nigeria.\nWorld Malaria Day: Nigeria still contributes 27% to global burden – Niger govt worriesQuoting the World Report 2010, the Minister said Nigeria contributed 27 per cent to the malaria boarding and 23 per cent to the malaria death globally.\n“At the state level (Ogun) malaria and prevalence has increased from about 15 per cent in 2015 to 22 per cent in 2018."
  },
  {
    "headline": "Ministry of Foreign Affairs reacts to video of Nigerian diplomat being beaten in Indonesia",
    "summarized_story": "Nigeria’s Ministry of Foreign Affairs has reacted to the malhandling and arrest of its diplomatic agent in Jakarta, Indonesia.\nIn a statement on Monday, the Foreign Affairs Ministry said: “The Ministry of Foreign Affairs is in receipt of a report and has seen a video in circulation regarding an unacceptable incident in Jakarta, Indonesia, concerning the manhandling and arrest of a Nigerian Diplomatic Agent in front of his official quarters on 7, August, 2021.\n“The Nigerian Government has complained strongly to the Government of Indonesia and the Ambassador of Indonesia to Nigeria was summoned by the Nigerian Minister of Foreign Affairs.\n“The Ambassador explained what he understood happened and apologized unreservedly on behalf of the Government of Indonesia.\n“The Ambassador of Nigeria has confirmed that the immigration officials involved had since come to the Nigerian Embassy to apologize to the Ambassador and the diplomat concerned.”"
  },
  {
    "headline": "EFCC grills Yewande Sadiku, Export Promotion Council chief over fraud allegations",
    "summarized_story": "Yewande Sadiku, Executive Secretary of the Nigerian Export Promotion Council (NIPC) is in the custody of the Economic and Financial Crimes Commission (EFCC).\nYewande arrived at the EFCC headquarters in Abuja around noon on Monday.\nShe is being grilled for alleged abuse of office, contract fraud and allowances unaccounted for.\nYewande is providing responses and will remain with the EFCC for at least another day.\nHead of Media, Wilson Uwujaren has confirmed the NIPC chief is with operatives."
  },
  {
    "headline": "BREAKING: EFCC grills NIPC CEO for nine hours",
    "summarized_story": "The Economic and Financial Crimes Commission(EFCC) grilled the Executive Secretary and Chief Executive Officer of the Nigerian Investment Promotion Council (NIPC) Mrs. Yewande Sadiku for about nine hours.\nAccording to a source at the commission, the NIPC boss volunteered statement to a team of operatives.\nBut it was unclear if the NIPC boss will be detained or not as at press time.\nThe source said: “NIPC CEO, Mrs. Yewande Sadiku is currently in the custody of the, EFCC.\n“The NIPC boss is being questioned for abuse of office, bordering largely on issues over contract running into several millions of Naira and a posse of unearned frivolous allowances."
  },
  {
    "headline": "VIDEO: Onyeka Onwenu addresses getting a marriage proposal from Fela",
    "summarized_story": "Award-winning singer and actress, Onyeka Onwenu, has opened up about her life, marriage, children, and suffering depression.\nIn an interview with Chude Jidonwo, Onyeka Onwenu spoke about her marriage to her ex-husband that produced two sons.\nOnyeka Onwenu replied: \"Absolutely. \"\nChude then goes on to name some of the people, saying: \"Sony Okosun, Fela --\"\"Sony Ade,\" Ms Onwenu interjects.\nChude continues: \"Obasanjo...\"And Onyeka Onwenu adds: \"Yes."
  },
  {
    "headline": "VIDEO: If feminism is your vision, don't get married - Oyedepo tells women",
    "summarized_story": "The General Overseer of the Living Faith Church International aka Winners’ Chapel, Bishop David Oyedepo, has advised women against joining the feminist movement.\nHe stated that women of today ignore the Bible’s instruction to submit to their husbands because they think such is outdated.\nWe are co-heirs, male and female, no difference.”The clergyman continued, “Right now, there is a feminine revolution.\nWhile the earth remains, the truth of scriptures remains in force, you either choose to follow or go your way.\n“If feminist revolution is your vision, don’t attempt to get married, because it won’t work.”Watch the video below;"
  },
  {
    "headline": "Messi: I’m learning accurate predictions from Mbaka - Shehu Sani",
    "summarized_story": "The former lawmaker also credited his new art of accurate prophecy to his ‘friend’, Rev.\nAccording to Sani, he was able to tread where others fear to go, as far as football prediction is concerned because he has succeeded in learning the rope from his mentor, Mbaka.\nThe Argentine spent 21 years with Barcelona, a club he claims will always be in his heart.\nAfter his exit at the weekend, Barcelona defender, Gérard Pique, said the club has been hurt majorly by the departure of their captain.\nHe said in a tweet, “I prophesied the movement of Messi to @PSG_English, I’m learning accurate predictions from my friend Father Mbaka.”WuzupNigeria"
  },
  {
    "headline": "VIDEO: Moment man discovers drugs in food items to be delivered abroad",
    "summarized_story": "A Dubai-bound Nigerian man has uncovered Tramadol tablets, Marijuana, and other illicit drugs concealed in food items allegedly given to him to deliver to someone in Dubai.\nSpeaking in the video posted online, the man from Oba, Anambra state, said the drugs were discovered after his brother suggested they go through the packages.\nA full search of the contents revealed drugs hidden inside foodstuff including yam flour, a gallon of palm oil, dried pepper, bitterleaf, crayfish, coffee powder, seasonings, sweets, among others.\n\"I don't know if their plan is for me to be sentenced to life imprisonment in Dubai but my hands are clean\" the man said.\nWatch the video below;"
  },
  {
    "headline": "Super TV boss: Chidinma, others docked, remanded in custody",
    "summarized_story": "By Romanus OkoyeChidinma Ojukwu and other defendants yesterday appeared before Yaba Magistrate’s Court in Lagos over alleged conspiracy and killing of Usifo Ataga, the Chief Executive Officer of Super TV.\nThe defendants are Adedapo Quadri, 40; Onoh Ojukwu, 57; Obafemi Disu, 42; Chioma Egbuchi, 28; Olutayo Abayomi, 23; and Ifeoluwa Olowu, 24.\nAdedayo, obliged by ordering that the case file be forwarded to the Lagos State Directorate of Public Prosecution (DPP) for legal advice.\nEarlier, Ajifor told the court that Ojukwu and Quadri, conspired to kill Ataga and stole his laptop, phones and cash valued at N3.8 million.\nOjukwu was consequently arrested on June 23 in her father’s house in Yaba and paraded at the Lagos State Police Command headquarters in Ikeja."
  },
  {
    "headline": "Sit-at-home turns bloody in Imo, 4 killed, 2 buses razed",
    "summarized_story": "But few of the traders who were standing in front of their shops later opened for business.\nIt was the same situation at the Sam Mbakwe International Cargo Airport ,Owerri .\nHowever,at the popular Douglas road where the Eke -Ukwu Owerri is located is partially open for business.\nAs at the time of this report, some of those who did not open for business gathered courage and came out while others still remain closed.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "BREAKING: Abductors of Niger commissioner demand N500 million ransom",
    "summarized_story": "From John Adams, MinnaThe abductors of the Niger State Commissioner for Information, Mallam Idris Sani Mohammed, have established contact with his family, demanding N500 million in ransom for his release.\nThe abductors are said to have crossed the shore of the state with Commissioner Mohammed, who they abducted at about 11:00 pm on Sunday, to an unknown destination.\nSympathisers have in the meantime continued to troop to the residence of the abducted commissioner both in Minna and Baban Tunga in Tafa, where the incident occurred.\nCommissioner Mohammed was taken at his residence at about 11:00 pm on Sunday by heavily armed men, with his second wife witnessing the incident.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Fuel tanker crushes 6 passengers in Ibadan road accident",
    "summarized_story": "From Oluseye Ojo, IbadanA fuel-laden tanker carrying Premium Motor Spirit (PMS) rammed into a commercial cab, popularly called Micra in Ibadan, the Oyo State capital, on Monday, crushing all six occupants of the mini-vehicle.\nThe accident occurred at Celica Junction along Ibadan-Ife Expressway, a frequent site of such accidents.\nAccording to a resident of Alakia who introduced himself as Kayode Sunday, ‘this Celica Junction has become a dreaded place for us because of the accidents that have been occurring in this place.\nMen of Oyo State Fire Service and Federal Road Safety Corps (FRSC) were deployed to the accident scene immediately.\nOfficers of the FRSC controlled traffic and prevented logjam at the Celica Junction."
  },
  {
    "headline": "BREAKING: IPOB sit-at-home cripples activities in Ebonyi",
    "summarized_story": "From Chijioke Agwu, AbakalikiThe sit at home order of the Indigenous People of Biafra(IPOB),to protest the detention of it’s leader, Mazi Nnamdi Kanu,by the DSS has crippled activities in Abakaliki.\nOur Correspondent who visited some parts of the state at about 10:am observed that people were complying to the order.\nSecurity agents in patrol vans have been patroling the town to ensure that people were not harrased for coming out for their normal businesses even as some parts of the city were totally deserted.\nBellow are pictures of Margret Umahi International Market and a section of the Abakaliki-Ogoja highway looking completely deserted.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Breaking: NNPC Promotes, Redeploys Top Management Officials",
    "summarized_story": "In a statement last night, the management of the corporation announced the promotion and redeployment of some staff to fill key vacant positions, including Mr. Billy Okoye, who has now been appointed the new Group Executive Director, Ventures & Business Development.\nThe statement signed by the outgoing Group General Manager, Group Public Affairs Division, of the corporation, Dr. Kennie Obateru, stated that Mrs. Aisha Ahmadu-Katagum, has been promoted to the position of Group Executive Director, Corporate Services.\nIt noted that until their new appointments, Okoye and Ahmadu-Katagum were Group General Managers, Crude Oil Marketing Division (COMD) and Supply Chain Management Division in the corporation, respectively.\nIn addition, a former Chief Operating Officer, Business and Ventures Development, Mr. Adeyemi Adetunji, becomes the Group Executive Director, Downstream, while a former Chief Operating Officer, Corporate Services, Mr. Mohammed Ahmed, becomes the Group Executive Director, Gas and Power.\nMuhammad is likely to now exit the office of the Minister of State, Petroleum Resources, Mr Timipre Sylva, where he was Special Adviser on Media before now."
  },
  {
    "headline": "Two Feared Killed as IPOB Grounds Awka, Anambra, Nnewi",
    "summarized_story": "By David-Chyddy ElekeTwo persons were Monday allegedly killed in Nnewi, Anambra State, over the sit-at-home order issued by the Indigenous People of Biafra (IPOB).\n“Some unidentified soldiers came in to clear the items used to block the roads leading to an altercation between them and the IPOB members.\nThe spokesperson of Anambra State Police command, DSP Toochukwu Ikenga, who spoke to THISDAY said: “Yes, I’m aware of the incident in Nnewi today, but I do not have the details.\nHe said,” we are still investigating.”Meanwhile, major and minor cities in Anambra State, including Awka, Onitsha, Nnewi, Ekwulobia and others were Monday totally shutdown, in compliance with the directive of the Indigenous People of Biafra (IPOB).\nAnambra State government had earlier threatened to withhold August salaries of workers who failed to resume for duties on Monday."
  },
  {
    "headline": "Secondus: I Will Not Resign",
    "summarized_story": "By Chuks OkochaThe National Chairman of the Peoples Democratic Party (PDP), Prince Uche Secondus, has said that he will not resign from his position.\nPrince Secondus said in a short statement from his media office, signed by Ike Abonye, that nothing so far warrants his resignation from the party’s highest position, adding that those tiny minority calling for his resignation should come clean and tell party members across the country his offence and why he should resign.\nThe statement came as the PDP governors were still mèeting in Abuja to determine his fate.\nHe was apparently reacting to a statement by Kingsley Chinda of the House of Representatives asking him to resign.\nChinda is a protege of the Rivers state governor, Nysom Wike, who is championing the call for Secondus to resign."
  },
  {
    "headline": "Security Beefed up at APC Secretariat over Planned Protest",
    "summarized_story": "By Adedayo AkinwaleSecurity has been beefed up at the headquarters of the All Progressives Congress (APC) in Abuja.\nFollowing a security report that certain persons had been mobilised to stage demonstrations at the party secretariat on Monday, the police team numbering over 30 had strategically positioned themselves within the secretariat along Blantyre street, Wuse 2, Abuja.\nThough the security men did not prevent people from accessing the party secretariat, they did not allow any vehicle within the secretariat vicinity, including those of the staff, visitors and journalists that arrived there early.\nOne of these security personnel attached to the secretariat noted that the police were deployed to prevent any form of demonstration at the party secretariat.\nAccording to him, “You don’t expect the party’s national leadership to fold their hands in the face of such a threatening security report."
  },
  {
    "headline": "Breaking: Gunmen Kidnap Niger Information Commissioner",
    "summarized_story": "By Laleye DipoUnknown gunmen have kidnapped the Niger state Commissioner for Information Alhaji Mohammed Sani Idris.\nIdris was kidnapped on Sunday in his countryhome in the Tafa local government Area of Niger state.\nDetails of his abduction are still sketchy but the Secretary to the state government Alhaji Ibrahim Ahmed Matane confirmed the incident saying the commissioner was picked from his house.\n“The gunmen forced themselves into his house at Babantunga in Tafa local government area from where he was abducted.\nBobi was picked by yet unknown gunmen from his farm in Mariga local government area of the state."
  },
  {
    "headline": "EXCLUSIVE: Ex-Lagos Governor, Tinubu Undergoes Second Surgery In US Hospital, Returns To UK On Crutches",
    "summarized_story": "The APC chieftain, it was learnt, left the US for the United Kingdom on crutches, a few days after the surgery.\nBola TinubuSources close to Tinubu told SaharaReporters that he wanted the surgery in Paris, France but changed his plan over rumour of his death.\n“Tinubu had his second surgery at John Hopkins University in Maryland recently.\nReports have it that the meeting was held to put an end to speculations surrounding the APC National Leader’s health status.\nSaharaReporters had on June 15 reported that Tinubu was also in Paris, battling some old age ailment."
  },
  {
    "headline": "EXCLUSIVE: Ex-Lagos Governor, Tinubu Undergoes Second Surgery In US Hospital, Returns To UK On Crutches",
    "summarized_story": "The APC chieftain, it was learnt, left the US for the United Kingdom on crutches, a few days after the surgery.\nBola TinubuSources close to Tinubu told SaharaReporters that he wanted the surgery in Paris, France but changed his plan over rumour of his death.\n“Tinubu had his second surgery at John Hopkins University in Maryland recently.\nReports have it that the meeting was held to put an end to speculations surrounding the APC National Leader’s health status.\nSaharaReporters had on June 15 reported that Tinubu was also in Paris, battling some old age ailment."
  },
  {
    "headline": "EXCLUSIVE: National Chairman Of Buhari's APC Party, Governor Buni In Multi-billion Naira Asset Declaration Scandal",
    "summarized_story": "Governor Mai-Mala Buni of Yobe state is currently enmeshed in a multi-billion naira asset declaration scandal at the Code of Conduct Bureau (CCB), SaharaReporters has gathered.\nMai Mala BuniSaharaReporters gathered that the scandal is being discussed in hush tones in the Yobe State Government House and National Secretariat of the All Progressive Congress (APC) in Abuja.\nBuni, who was the National Secretary of the APC until his election as Yobe state governor in 2019, was involved in anticipatory declaration, a criminal offence under the CCB law.\nSimilarly, the APC National Caretaker Chairman declared that he has three filling stations valued at N425 million.\nA source at the CCB told SaharaReporters that investigation of the governor’s anticipatory declaration has gone far at the agency."
  },
  {
    "headline": "EXCLUSIVE: National Chairman Of Buhari's APC Party, Governor Buni In Multi-billion Naira Asset Declaration Scandal",
    "summarized_story": "Governor Mai-Mala Buni of Yobe state is currently enmeshed in a multi-billion naira asset declaration scandal at the Code of Conduct Bureau (CCB), SaharaReporters has gathered.\nMai Mala BuniSaharaReporters gathered that the scandal is being discussed in hush tones in the Yobe State Government House and National Secretariat of the All Progressive Congress (APC) in Abuja.\nBuni, who was the National Secretary of the APC until his election as Yobe state governor in 2019, was involved in anticipatory declaration, a criminal offence under the CCB law.\nSimilarly, the APC National Caretaker Chairman declared that he has three filling stations valued at N425 million.\nA source at the CCB told SaharaReporters that investigation of the governor’s anticipatory declaration has gone far at the agency."
  },
  {
    "headline": "Nigerian Government Reacts To Torture Of Diplomatic Officer By Indonesian Police",
    "summarized_story": "The Ministry of Foreign Affairs stated that the arrest and manhandling of the diplomatic official was against international law and the Vienna Conventions governing Diplomatic and Consular Relations between states.\nThe Nigerian government said it had written to the government of Indonesia over the ill-treatment meted out to its Diplomatic Agent in the country.\n“This unfortunate incident is against international law and the Vienna Conventions governing Diplomatic and Consular Relations between states.\nThe Nigerian Government has complained strongly to the Government of Indonesia, and the Ambassador of Indonesia to Nigeria was summoned by the Nigerian Minister of Foreign Affairs.\nHe was also heard screaming that he could not breathe but the police officers ignored his plea and continued to torture him."
  },
  {
    "headline": "WHO confirms first-ever case of ‘highly infectious’ Marburg virus disease in West Africa",
    "summarized_story": "The World Health Organisation (WHO) says health authorities in Guinea have recorded a confirmed case of Marburg virus disease in the southern Gueckedou prefecture.\nAdvertisementThis is the first time the Marburg virus disease — described as “highly infectious” and which results in haemorrhagic fever similar to Ebola — has been identified in West Africa.\nAdvertisementHOW MARBURG IS TRANSMITTEDAccording to WHO, Marburg virus is transmitted to people from fruit bats, and it spreads among humans through direct contact with the bodily fluids of infected people, surfaces and materials.\nAdvertisement“The potential for the Marburg virus to spread far and wide means we need to stop it in its tracks,” she said.\nThe Ebola control systems in place in Guinea and in neighbouring countries are proving crucial to the emergency response to the Marburg virus."
  },
  {
    "headline": "WHO confirms first-ever case of ‘highly infectious’ Marburg virus disease in West Africa",
    "summarized_story": "The World Health Organisation (WHO) says health authorities in Guinea have recorded a confirmed case of Marburg virus disease in the southern Gueckedou prefecture.\nAdvertisementThis is the first time the Marburg virus disease — described as “highly infectious” and which results in haemorrhagic fever similar to Ebola — has been identified in West Africa.\nAdvertisementHOW MARBURG IS TRANSMITTEDAccording to WHO, Marburg virus is transmitted to people from fruit bats, and it spreads among humans through direct contact with the bodily fluids of infected people, surfaces and materials.\nAdvertisement“The potential for the Marburg virus to spread far and wide means we need to stop it in its tracks,” she said.\nThe Ebola control systems in place in Guinea and in neighbouring countries are proving crucial to the emergency response to the Marburg virus."
  },
  {
    "headline": "PDP crisis: Governors yet to reach resolution after meeting for hours, to reconvene Tuesday",
    "summarized_story": "Governors elected on the platform of the Peoples Democratic Party (PDP) met behind closed doors, on Monday, to discuss issues affecting the party.\nAdvertisementThe governors met for several hours in Abuja, after which they announced that another meeting with party stakeholders has been scheduled for Tuesday.\nSpeaking to journalists after the meeting, Aminu Tambuwal, governor of Sokoto and chairman of the PDP governors’ forum, said the governors are working on efforts to resolve the crisis.\nSubsequently, some members of the national working committee (NWC) threatened to resign if the leadership crisis is not resolved soon.\nThe lawmakers accused the party chairman of “lax and bedroom managerial attitude”, which they said resulted in the “mass exit of party members”."
  },
  {
    "headline": "PDP crisis: Governors yet to reach resolution after meeting for hours, to reconvene Tuesday",
    "summarized_story": "Governors elected on the platform of the Peoples Democratic Party (PDP) met behind closed doors, on Monday, to discuss issues affecting the party.\nAdvertisementThe governors met for several hours in Abuja, after which they announced that another meeting with party stakeholders has been scheduled for Tuesday.\nSpeaking to journalists after the meeting, Aminu Tambuwal, governor of Sokoto and chairman of the PDP governors’ forum, said the governors are working on efforts to resolve the crisis.\nSubsequently, some members of the national working committee (NWC) threatened to resign if the leadership crisis is not resolved soon.\nThe lawmakers accused the party chairman of “lax and bedroom managerial attitude”, which they said resulted in the “mass exit of party members”."
  },
  {
    "headline": "Cholera: NCDC records 816 deaths, over 30,000 suspected cases in seven months",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) says more than 30,000 suspected cases of cholera have been reported in 22 states and the federal capital territory (FCT) in seven months.\nThis has been exacerbated by poor access to clean water, open defecation, poor sanitation, and hygiene,” the statement reads.\n“Between the 1st of January and 1st of August 2021, 31,425 suspected cases of cholera, 311 confirmed cases and 816 deaths have been reported from 22 states and FCT.\n“Following an increase in the number of cholera cases, the National Cholera Emergency Operations Centre (EOC) was activated on the 22nd of June 2021.\nWithout proper water, sanitation, and hygiene (WaSH), Nigeria remains at risk of cholera cases and deaths."
  },
  {
    "headline": "Olumide Soyombo: The journey from startup founder to investment mogul",
    "summarized_story": "The early daysAt first, being a doctor was all Soyombo wanted to be until he was given a personal computer.\nAfter his first degree, Soyombo went on to get a master’s degree in business and information technology from Aston Business school.\nSo they created Leadpath as an investment vehicle to invest in startups, at first the approach was to invest $25,000 – $100,000 in local tech startups, similar to the Y-combinator accelerator model.\nThe bitter taste of how the founder handled the first company didn’t allow Soyombo to invest in the second company.\nWhen he thinks about the future, Soyombo is excited about the fact that the African tech ecosystem is maturing."
  },
  {
    "headline": "MTN finally repatriates 2020 dividend from Nigeria after forex crisis",
    "summarized_story": "South Africa’s MTN Group has repatriated its last year’s dividend of around $280 million (R4.2 billion) from its local unit in Nigeria.\nRespite in U.S. court caseIn addition to the news from Nigeria, MTN also revealed “positive developments” in a United States court case related to the group and its subsidiaries, MTN Afghanistan and MTN Dubai.\nIn Nigeria, MTN, through its local unit, has earmarked ₦600 billion ($1.5 billion) over the next three years to expand broadband access in Africa’s most populous economy.\nMobile subscribers decline in NigeriaFor MTN Nigeria, half-year 2021 results show that service revenue increased by 24.1% year-on-year, despite the number of its mobile subscribers declining by 7.6 million (nearly 10%).\nMTN Nigeria aims to sustain “double-digit service revenue growth ahead of inflation, driving 4G and rural network expansion,” Toriola said."
  },
  {
    "headline": "Can mobile applications help solve Africa's healthcare access problem?",
    "summarized_story": "Without discovering the mobile app, he could easily have been one of the more than 400,000 Africans malaria killed in 2019.\nZuri Health mobile app.\nArthur Ikechukwu Anoke and Daisy Isiaho, co-founders of the mobile app, Zuri Health.\nGovernmental policies will help hold digital healthcare companies accountable and protect the information and data of citizens that use the technologies.\nYet it’s fundamental if we should achieve the Sustainable Development Goals,” said Daisy Isiaho, Zuri Health Co-founder and Chief Product Officer."
  },
  {
    "headline": "Inconsistent policies are killing African startups",
    "summarized_story": "On 18 December, 2015 the CBK again issued Banking Circular No 14 of 2015, which cautioned, ‘all financial institutions against dealing in virtual currencies or transacting with entities that are engaged in virtual currencies.\nFinancial institutions are expressly advised not to open accounts for any person dealing in virtual currencies such as Bitcoin.\nDigital Tax policies in South Africa, Nigeria, Uganda and KenyaSouth Africa was the first, in 2014, to tax digital services by imposing a 14% value added tax (VAT) on digital imports.\nThis same proposal for digital tax was only shut down by the Benin Government after a peaceful protest was staged by its people.\nThis has not been the case however – digital tax policies and laws have mainly been used to restrict digital activity of citizens, infringing on their digital rights."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "African payments startup, Flutterwave, has announced the appointment of Jimmy Ku as the Head of US Growth."
  },
  {
    "headline": "Nigeria-based anti-counterfeiting startup, Chekkit raises $500k pre-seed funding",
    "summarized_story": "Share this article:Nigeria-based anti-counterfeiting startup, Chekkit Technologies, has announced a $500,000 pre-seed round as it looks to expand its team and technological infrastructure.\nFounded in 2018 by Dare Odumade, CEO and Oluwatosin Adelowo, CMO, Chekkit offers product verification and anti-counterfeiting solutions using Blockchain.\nAfter the event, Afghanistan’s Ministry of Health signed an MoU with Fantom and Chekkit for a 3-month pilot project to track and verify 80,000 pharmaceutical products sold.\nA 2018 WHO factsheet on substandard and falsified medical products reveals that between 64,000 and 158,000 people die from counterfeit anti-malarial drugs in sub-Saharan Africa per year.\nCurrently, in Africa, startups like Chekkit and deep tech startup RxAll are trying to combat this problem."
  },
  {
    "headline": "Nigeria-based mobility fintech, Moove raises $23 million Series A",
    "summarized_story": "Share this article:Nigeria-based auto-financing startup, Moove has announced a $23 million Series A to build a full-service mobility fintech that democratises vehicle ownership across Africa.\nOthers include DCM Ventures, Clocktower Technology Ventures, thelatest.ventures, London-based LocalGlobe, California-based Tekton Ventures, New York-based FJ Labs, and New York-based Palm Drive Capital.\nAfrica focused VC Verod Capital Management, Kepple Africa Ventures, and London-based Emso Asset Management — one of Moove’s existing lenders — joined the round.\nThis brings Moove’s total funding to $68.2 million — $28.2 million in equity and $40 million in debt.\n“With Ladi and Jide at the helm of a world-class team, and their unique approach to vehicle financing, Moove has quickly established itself as one of the most exciting tech companies in Africa."
  },
  {
    "headline": "3 reasons not to miss SME Clinic 2021",
    "summarized_story": "Share this article:If you are a regular here or follow us on social media, you probably already know that SME Clinic 2021 is 12 days away — August 21, 2021.\nAt SME Clinic, 2021, physical and online attendees will learn how to sustain their businesses with technology.\nWhy should you be at SME Clinic 2021?\nThis year, 5 people who attend SME Clinic 2021 physically stand a chance to get a grant worth ₦100,000.\nGet your ticket for SME Clinic 2021 at discounted rates now."
  },
  {
    "headline": "Moove secures $23m investment to expand vehicle ownership in Africa",
    "summarized_story": "Most vehicle loans from Nigerian banks have a shelf life of 24 months and come with so many stringent measures that customers end up discouraged from even trying.\nIn 2020, Vice President Yemi Osinbajo said the demand for vehicles in Nigeria currently stood at about 720,000 against actual local production by the available assembly plants…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "How politics made Nigeria lose out on $50m Olympics kits’ deal",
    "summarized_story": "How politics made Nigeria lose out on $50m Olympics kits’ dealNigeria’s inability to properly kit 60 athletes across 10 sports for the 2020 Tokyo Olympics prevented Africa’s most populated nation from tapping into the over $50 million worth of kits sponsorship deals.\nNigeria found itself in an embarrassing but avoidable situation after Chukwuebuka Enekwechi, who made the Shot-Put athletics, shared a video of himself washing…"
  },
  {
    "headline": "Green Africa starts flight Thursday, gets air operating certificate",
    "summarized_story": "Green Africa, Nigeria’s Lagos-based value airline has announced that it will start its first official flight Thursday, 12th August 2021.\nThis is as the airline received its Air Operator Certificate from the Nigerian Civil Aviation Authority (NCAA) on Monday, 9th August 2021.\nRead also: Green Africa disrupts airline business with cheap airfaresWith this certificate, Green Africa is able to commence operations in accordance with its initial route network unveiled earlier in June.\nSpeaking on the issuance of the AOC to Green Africa, Capt.\nThanks to the NCAA, the gTeam, our investors, and other stakeholders, Green Africa is now set to start serving customers.”Customers can now make bookings on greenafrica.com for flights across Green Africa’s route network."
  },
  {
    "headline": "Gapiona Flood Project: Edo NEWMAP flays fake viral video, says govt committed to tackling erosion problems – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State-Nigerian Erosion and Watershed Management Project has condemned a viral video of a protest by some persons purported to be living around the project catchment area of Gapiona, noting that claims in the said video were falsely represented.\n“The project is by the Edo State Government and not a World Bank project as erroneously conveyed in the said video.\nFurthermore, the Gapiona flood Project was initiated at the instance of the State Government and not the other way.\nResidents in Gapiona area have lived with the erosion problem for over 20 years, this has led to many residents fleeing their homes while majority of the access roads linking the area has been rendered impassable.\n“NEWMAP’s intervention in the area has brought succor to residents in the sections where work has been completed."
  },
  {
    "headline": "‘Repent Or Relocate’ New DPO Warns Criminals In Warri – Nigerian Observer",
    "summarized_story": "CSP Onana Omar Ari , disclosed this while on a courtesy visit to the Nigerian Union of Journalists(NUJ) Warri Correspondents’ Chapel.\nHe warned criminals gaining more grounds to relocate from the division or repent in their own interest.\n“My message to these criminal elements is that, they should repent or relocate, because we are not here to play”.\nAddressing Journalists at NUJ Secretariat in Warri, CP Ari stated that, the police could not single-handedly fight and win the war against criminals without the active support of the public.\n“Collaboration of members of the public with the police in the fight against these monsters causing havoc in the society is highly imperative to burst the rings of the criminals,” he said."
  },
  {
    "headline": "Edo govt begins training for state’s information officers, media practitioners, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has commenced a month-long training for Information Officers, Media Practitioners and Public Relations Officers under the employment of the state government.\nThe training, aimed at upskilling the workers and equipping them with modern communication skills and tools, is part of ongoing efforts by the Governor Godwin Obaseki-led government to renew the state’s communication ethos through the establishment of the Edo Communication Organization (ECO).\nDeclaring the workshop open at the John Odigie-Oyegun Training Centre in Benin City, the Edo State Head of Service, Anthony Okungbowa Esq., said the workshop will further enhance the workers’ skills thereby ensuring improved productivity and optimal service delivery to Edo people.\nAccording to him, “the training programme is timely as it will enable participants to enhance their skills and knowledge, thereby ensuring they function effectively.”He noted that the Obaseki-led government is committed to the training and retraining of every Edo worker, adding, “Effective communication is a veritable tool in the implementation of government policies and programmes, which is a necessity in the realization of Governor Godwin Obaseki’s vision of making Edo great again.”The training is organized by the Edo State Government, in collaboration with the Tonnie Iredia Centre for Media Advocacy (TICMA).\nResource persons like Professor Tonnie Iredia, who is the Chairman Board of Trustees of TICMA and other prominent professionals in academics, communication, advertising and Public Relations will be tutoring the participants during the one month period, to raise the standard of communication practice in Edo State."
  },
  {
    "headline": "Edo Sexual Assault Referral Centre assures justice for victims of rape, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The newly appointed Coordinator of the Edo State Sexual Assault Referral Centre, Dr. Georgina Eromosele, has promised to ensure justice for the victims of rape and other gender-based violence in the state.\nEromosele, who spoke to journalists in Benin City, called for the support of residents to tackle sexual and gender-based violence including rape and domestic violence, in line with the vision of Governor Godwin Obaseki and his wife, Mrs Betsy Obaseki.\nThe new coordinator for the centre, which is named after the late teenage victim of rape, Vivian Ogu, is a graduate of the Obafemi Awolowo University, Ile-Ife (OAU) medical school, with a Masters degree in Public Health from the Ladoke Akintola University, Ogbomosho, and was most recently a Senior Medical Officer at Central Hospital, Benin City.\nEromosele, who earlier served as Head of the District Hospital, Ekiadolor, is a Member of the Medical and Dental Council of Nigeria, and was Secretary-General, Association of Resident Doctors, Edo State HMB chapter, before her appointment.\nAccording to her, “the Vivian Centre is one of a kind in the country and is well positioned to serve as a safe environment where survivors are given all the required care and support they need, including medical examination, screening and preventive treatment for Human Immunodeficiency Virus (HIV) and other sexually transmitted infections.”..."
  },
  {
    "headline": "Climate Change: UN report issues profound warning to mankind",
    "summarized_story": "The Intergovernmental Panel on Climate Change (IPCC) made this known in the latest IPCC report published on Monday.\nIt warned that “strong and sustained” reductions in emissions of carbon dioxide (CO2) and other greenhouse gases would limit climate change.\nThe report which deals with the scientific basis of climate change and how humans are altering the planet was approved by 195 member states on Friday.\nHowever, at 2 degrees Celsius of global warming, the report noted that heat extremes would often reach critical tolerance thresholds for agriculture and health.\nThe UN climate panel stated that a “strong and sustained” reduction of carbon emissions and other greenhouse gases would limit climate change."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Mayhem in Orlu over IPOB sit-at-home",
    "summarized_story": "The sit-at-home order issued by the Indigenous People of Biafra (IPOB), turned violent in Orlu and Mbaise areas of Imo State, as some unknown gunmen burnt house and commercial buses allegedly in bid to force the order.\nThe mayhem reportedly started when the unknown gunmen in their convoy were moving to some places within and outside the Orlu Local Government Area of the State, as a way of enforcing the sit at home order.\nThe gunmen were said to have set ablaze a house in Isiala-Amadim village in Amaifeke, Orlu Local Government Area in the State, Vanguard reported.\nBut some persons were said to have been killed by the unknown gunmen.\nPeople are in their houses now.”“We are living in fears now, these unknown gunmen are given us trouble is this how we will get this thing that we are looking for.”"
  },
  {
    "headline": "Bandits kidnap Niger commissioner, Sanni Idris from his home",
    "summarized_story": "Bandits have kidnapped Niger state Commissioner for information, Alhaji Muhammed Sanni Idris.\nReports say he was taken from his home town Baban Tunga in Tafa local government area of the state, in the early hours of Monday.\nSecretary to the Government of Niger state, Alhaji Ahmed Ibrahim Matane, confirmed the abduction, saying it happened around 1am.\n“He was kidnapped in the early hours of today around 1am at Baban tunga in Tafa local government.\nPolice spokesperson in Ekiti State, Sunday Abutu, confirmed the incident and said one suspect has been arrested."
  },
  {
    "headline": "APC convention fallout How much can Osinbajo do?",
    "summarized_story": "The crisis since the ward congress has heightened and it has further divided the party.\nWhat actually saved the APC in that judgment was that technical ground that Jegede had failed to join Buni in the suit.\nMai Mala Buni as a sitting Governor to run the affairs of the APC as Chairman of the Caretaker Committee.\nIt was said that Professor Osinbajo took an informed position after analysing the Supreme Court judgement on the Ondo governorship election and his stand has remained the same.\nIn his reaction to the legality of Buni’s leadership of the party David Umahi, governor of Ebonyi state, has said the caretaker committee of the All Progressives Congress (APC) is constitutional."
  },
  {
    "headline": "Anambra 2021: Determined Ozigbo pushes to upstage troubled APGA",
    "summarized_story": "“Ozigbo is another Peter Obi,” said Mr. Oliver Nwafor, a political enthusiast based in Awka, the state capital.\nThe PDP candidate, barring other intra-party controversies, will now focus on the ultimate prize; the goal of beating other candidates on November 6.\n“Ozigbo is popular, also based on the popularity of his party, the PDP,” said Chidi Odogwu, a business owner in Onitsha.\nBut it is one which Soludo and Ozigbo stand shoulders higher above the rest, as the two leading candidates.\n“I think the battle is actually going to be between Soludo and the Ozigbo; that is between APGA and PDP,” said Mr. Okeke."
  },
  {
    "headline": "Cholera: 22 States, FCT Record 31,425 Suspected Cases, 816 Deaths – NCDC",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC), has said that a total of 31,425 suspected cases of cholera and 816 deaths have been reported in 22 states and the FCT.\nAccording to the report, “As at 1st August, 2021, a total of 31,425 suspected cases including 816 deaths(CFR 2.6 per cent ).\nOf all suspected cases, 51 per cent are males and 49 per cent are females.\n“In the reporting week, seven states and FCT reported 1,162 suspected cases – Bauchi (773), Niger (183), Katsina (120), FCT (64), Jigawa (13), Kano (4), Borno (4) and Adamawa (1).\n“Without proper water, sanitation, and hygiene (WaSH), Nigeria remains at risk of cholera cases and deaths."
  },
  {
    "headline": "Cholera: 22 States, FCT Record 31,425 Suspected Cases, 816 Deaths – NCDC",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC), has said that a total of 31,425 suspected cases of cholera and 816 deaths have been reported in 22 states and the FCT.\nAccording to the report, “As at 1st August, 2021, a total of 31,425 suspected cases including 816 deaths(CFR 2.6 per cent ).\nOf all suspected cases, 51 per cent are males and 49 per cent are females.\n“In the reporting week, seven states and FCT reported 1,162 suspected cases – Bauchi (773), Niger (183), Katsina (120), FCT (64), Jigawa (13), Kano (4), Borno (4) and Adamawa (1).\n“Without proper water, sanitation, and hygiene (WaSH), Nigeria remains at risk of cholera cases and deaths."
  },
  {
    "headline": "UBEC Begins Development Of E-learning Software",
    "summarized_story": "The Universal Basic Education Commission (UBEC) has commenced the process of developing an e-learning software for use at the basic level of education in Nigeria.\nThe e-learning software is to integrate modern learning approaches into basic education delivery and also ensure that the education system keeps abreast with global best practices.\nHead of public relations/protocol of the Commission, David Apeh, said the foundational activities under e-learning intervention would culminate in the adoption and utilisation of essential ICT platforms for enhancing teaching in public basic education institutions.\n“UBEC believes that these interventions will add value and improve teaching and learning in our schools.\nAccording to him, the programme would also assist UBEC efforts and desire to attain a 100 per cent transition rate from primary to junior secondary school level."
  },
  {
    "headline": "UBEC Begins Development Of E-learning Software",
    "summarized_story": "The Universal Basic Education Commission (UBEC) has commenced the process of developing an e-learning software for use at the basic level of education in Nigeria.\nThe e-learning software is to integrate modern learning approaches into basic education delivery and also ensure that the education system keeps abreast with global best practices.\nHead of public relations/protocol of the Commission, David Apeh, said the foundational activities under e-learning intervention would culminate in the adoption and utilisation of essential ICT platforms for enhancing teaching in public basic education institutions.\n“UBEC believes that these interventions will add value and improve teaching and learning in our schools.\nAccording to him, the programme would also assist UBEC efforts and desire to attain a 100 per cent transition rate from primary to junior secondary school level."
  },
  {
    "headline": "Human Trafficking: INTERPOL Arrests Nigerian, 286 Others",
    "summarized_story": "International police, INTERPOL has arrested a suspected Nigerian trafficker and 286 others for human trafficking.\nThe INTERPOL stated this on its official website, where it also explained that the Nigerian suspect, whose name was not given, was nabbed when its agents conducted a check on a passenger manifest during an operation tagged, ‘Smuggling Training and Operations Programme, (Operation STOP)’.\nOperation STOP included training provided to 20 frontline officers to optimise the use of Interpol’s policing capabilities, including its criminal and stolen and lost travel documents databases, to better track the movement of criminals and identify potential victims.\nADVERTISEMENTThe INTERPOL statement also said: “The hit on the Spanish Red Notice was generated by checking names and passports against Interpol’s databases using I-Batch, an application that processes bulk data from passenger manifests in a very short time.”Ghana’s Commissioner of Police, Isaac Yeboah, was quoted as stating that the training and the operational use of INTERPOL’s databases was crucial to enhance the capacity of all officers, build a great network and exchange information quickly and effectively."
  },
  {
    "headline": "BBNaija6: Tega, Arin, four others nominated for eviction, as Pere emerges third Head of House",
    "summarized_story": "BBNaija6: Tega, Arin, four others nominated for eviction, as Pere emerges third Head of HouseBBNaija6: Tega, Arin, four others nominated for eviction, as Pere emerges third Head of HouseTega, Arin, Saskay, Nini, Princess, and Emmanuel have been nominated for eviction in the week three of the Big Brother Naija Shine Ya Eye season.\nThis was announced during the nomination show where each housemate had to nominate two other housemates for possible eviction.\nThe accumulation of their nominations led to the selection of the six housemates for possible eviction.\nHowever, the Head of House used his veto power to save one housemate, leading to the inclusion of Saskay on the list.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "BBNaija6: Tega, Arin, four others nominated for eviction, as Pere emerges third Head of House",
    "summarized_story": "BBNaija6: Tega, Arin, four others nominated for eviction, as Pere emerges third Head of HouseBBNaija6: Tega, Arin, four others nominated for eviction, as Pere emerges third Head of HouseTega, Arin, Saskay, Nini, Princess, and Emmanuel have been nominated for eviction in the week three of the Big Brother Naija Shine Ya Eye season.\nThis was announced during the nomination show where each housemate had to nominate two other housemates for possible eviction.\nThe accumulation of their nominations led to the selection of the six housemates for possible eviction.\nHowever, the Head of House used his veto power to save one housemate, leading to the inclusion of Saskay on the list.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Alleged abuse of office: EFCC grills, detains NIPC boss, Yewande Sadiku",
    "summarized_story": "The Economic and Financial Crimes Commission(EFCC) grilled the Executive Secretary and Chief Executive Officer of the Nigerian Investment Promotion Council (NIPC) Mrs. Yewande Sadiku for about nine hours.\nAccording to a source at the commission, the NIPC boss volunteered statement to a team of operatives.\nBut it was unclear if the NIPC boss will be detained or not as at press time.\nThe source said: “NIPC CEO, Mrs. Yewande Sadiku is currently in the custody of the, EFCC.\n“The NIPC boss is being questioned for abuse of office, bordering largely on issues over contract running into several millions of Naira and a posse of unearned frivolous allowances."
  },
  {
    "headline": "Plateau IDPs cry out: We’re hungry, homeless",
    "summarized_story": "The sanitary conditions of the people camped in available spaces in the Miango and Kwall districts of the Chiefdom require immediate intervention.\nFew youths were also seen rummaging through their burnt property, picking some valuables like cooking pots, mattresses and other things they could salvage.\nThey attacked and burnt down the whole Jebbu-Miango community killing many of its inhabitants in addition to destroying our farmlands.\nOver the last few days, the Fulani herdsmen have been grazing their cattle freely on crops that were cultivated.\nA lot of displaced persons are taking refuge in Miango and in the Kwall district of the chiefdom."
  },
  {
    "headline": "Court stops FIRS from collecting VAT, Personal Income Tax in Rivers",
    "summarized_story": "By Okafor OfieborThe Federal High Court in Port Harcourt has stopped the Federal Inland Revenue Services (FIRS) from collecting Value Added Tax (VAT) and Personal Income Tax (PIT) in Rivers State.\nThe court held that it is the Rives State Government that should collect VAT and PIT henceforth in the state.\nFHC/PH/CS/149/2020, filed by the Attorney General for Rivers State (plaintiff), against the Federal Inland Revenue Service (first defendant) and the Attorney General of the Federation (second defendant).\n“The court noted that the application is like asking the Federal High Court to transfer the entire case to the Court of Appeal.\n“So, in other words, the issue of Value Added Tax (VAT) in the territory of Rivers State and Personal Income Tax should be reserved for the government of Rivers State.”Counsel to FIRS, O.C."
  },
  {
    "headline": "INTERVIEW: 'The problems with Nigeria's aviation sector",
    "summarized_story": "How would you compare the Aviation sector in the last six years, how would you rate it now?\nThe Aviation sector is a very interesting sector of the economy.\nSo in the aviation sector, cost of funding is extremely high.\nAviation sector is one of the most regulated sectors in the whole world.\nAviation sector was the most affected sector of the economy; other sectors were still surviving at a point."
  },
  {
    "headline": "PDP Governors’ Six-Hour Meeting Over Embattled Chairman, Secondus Ends In Deadlock",
    "summarized_story": "The governors of the Peoples Democratic Party could not agree on the fate of the embattled National Chairman of the party, Prince Uche Secondus, despite a six-hour-long meeting.\nOn Monday, the governors held a meeting at the Akwa Ibom State Governor’s Lodge, Asokoro, Abuja, but were unable to find a way out of the lingering leadership crisis following persistent calls for Secondus’ resignation.\nAddressing newsmen at the end of the meeting, Sokoto state governor and chairman of the PDP Governors’ Forum, Aminu Tambuwal, expressed the readiness of the governors to continue the meeting until the Secondus’ issue was resolved, Vanguard reports.\nSecondus, who arrived at the venue of the meeting hours after it had started, remained defiant that he would not resign from office.\nThe governors in attendance include Aminu Tambuwal, Oluseyi Makinde, Nyesom Wike, Ifeanyi Okowa, and Godwin Obaseki of Sokoto, Oyo, Rivers, Delta and Edo states respectively."
  },
  {
    "headline": "BREAKING: In Rivers, Resident Doctors Call Off One-week Strike",
    "summarized_story": "The one-week strike by the National Association of Resident Doctors at the Rivers State University Teaching Hospital has been called off.\nDr. George Ela, the chairman of NARD at RSUTH, revealed this in a statement released in Port Harcourt on Monday.\nThe statement reads, “It is a week now since the Association of Resident Doctors, Rivers State University Teaching Hospital, proceeded on a total and indefinite strike action following a resolution taken at its Extraordinary General Meeting.\n“However, it has been seven days of intensive, robust and fruitful engagement with the Rivers State Government through the office of the Secretary to the Government.\n“Again, the Rivers State Government has demonstrated commitment to addressing the nagging welfare needs of the Resident doctors such as implementation of the wage-adjusted CONMESS 2019, payment of the COVID-19 inducement hazard allowance and employment of more Resident doctors, among others."
  },
  {
    "headline": "BREAKING: Customs Vehicle Cashing Suspected Rice Smuggler Crushes 7 To Death, Injures 20 Others In Katsina",
    "summarized_story": "On Monday, a Nigeria Customs Service vehicle pursuing rice traffickers allegedly crushed seven people to death in Jibiya LGA, Katsina State.\nBefore security services arrived, an enraged mob in the neighborhood resorted to violent protest and damaged the customs official vehicle.\nSix persons died instantly and another one died on the way to the hospital.\n“In retaliation, an angry mob from the area burnt the custom vehicle before police could arrive at the scene,” an eyewitness said.\nThe spokesman of the Katsina Area Command of the Nigerian Customs Service, Danbaba Isah, while confirming the incident, said investigation is ongoing to ascertain the cause of the accident."
  },
  {
    "headline": "Tinubu Undergoes Second Surgery In US Hospital, Returns To UK On Crutches",
    "summarized_story": "The APC head, it was learned, left the United States on crutches for the United Kingdom a few days after the surgery.\nSources close to Tinubu told report that he wanted the surgery in Paris, France but changed his plan over rumour of his death.\n“Tinubu had his second surgery at John Hopkins University in Maryland recently.\nSaharaReporters had on June 15 reported that Tinubu was also in Paris, battling some old age ailment.\nSaharaReporters had reported the conspicuous absence of Tinubu during the one-day working visit of President Buhari to inaugurate various projects in Lagos State."
  },
  {
    "headline": "Breaking: Tragedy averted as Bayelsa United bus conveying FA Cup champions wheels into bush (PICTURES)",
    "summarized_story": "A fatal accident was on Monday averted after the driver of a bus conveying players and officials of newly crowned FA Cup Champions, Bayelsa United, wheeled into the bush.\nThe sudden drive into the bush, according to pictures circulating on social media was triggered after another vehicle tried to collide with the Bayelsa United coaster bus.\nBlueprint findings revealed that no player or official sustained injury as at the time of the incident.\nBayelsa United team, a Nigeria National League (NNL) had defeated Nigeria Professional Football League (NPFL) side Nasarawa United at the final of 2021 FA Cup decided in Benin City on Sunday.\nThe Bayelsa-based club was returning to Yenogoa from Benin City, Edo state capital."
  },
  {
    "headline": "Breaking: 2 dead, 3 vehicles burnt over IPOB’s sit-at-home order in Imo, Aba grounded",
    "summarized_story": "Blueprint gathered that two of the vehicles were inter state mass transit buses owned by a company, while the other was a Siena vehicle which were identified as the only vehicles plying the Mbaise-Umuahia road early morning.\nAs at the time of filing this report, the Imo state Police Command had not responded to this development but the video has continued to go viral.\nMeanwhile, the stay-at-home order has partially grounded the state.\nAlso on the roads in Southeast cities, a few vehicles were plying the road while many people were seen walking on the roads and streets amidst fear and anxiety.\nFrom, Aba, comes a report that the sit-at-home order has grounded the commercial city located in Abia state, home state of acclaimed IPOB leader, Nnamdi Kanu."
  },
  {
    "headline": "VIDEO: What Beatrice said after exiting BBNaija season 6 show",
    "summarized_story": "NextKyari: Left on the brink for too long"
  },
  {
    "headline": "PDP crisis: Govs to continue dialogue with stakeholders Tuesday",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nIn accordance with THE LAW, the material on this Website is included for informational and educational purposes.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Sack Ngige, Ehanire, Sanusi -NARD -NigPilot",
    "summarized_story": "National Association of Resident Doctors, NARD, has called for the immediate sack of Ministers of Labour and Productivity, Dr. Chris Ngige, his Health counterpart Osagie Ehanire and Registrar, Medical and Dental Council of Nigeria, MDCN, for failure to carry out their duties.\nThe call was made by NARD’s President, Uyilawa Okhuaihesuyi, who said the ministers and Tajudeen should be sacked if they cannot handle their responsibilities.\nOkhuaihesuyi tackled Ngige for issuing threats of replacement against the resident doctors on national television when their demands raised have not been met.\n“If you want to toe the line of no work, no pay, I think you will go and look for 16,000 resident doctors to occupy our place,” he said.\nHowever, in his response, Ngige threatened that the federal government will invoke the no-work and no-pay order against the resident doctors because the federal government has met their demands."
  },
  {
    "headline": "FG Partners with NOA for GEEP 2.0 kickoff –NigPilot",
    "summarized_story": "Federal Government has signed a partnership with the National Orientation Agency as one of its key partners in its quest to raise awareness for its National Social Investment Programmes.\n“I must say the agency has shown outstanding dedication towards effective implementation of the NSIP programmes.\nIt is in this vein that the FMHADMSD entered into a partnership with NOA to appoint the Community Orientation and Mobilization officers as GEEP Desk Officers in all the 774 local government local areas across the country”.\nTo this end, the ministry in conjunction with NOA has appointed Community Orientation and Mobilization officers to be trained as GEEP Local Government Desk Officers in all the 774 local government levels areas across the 36 states and the FCT.\nThese officers will sensitize communities on the GEEP programmes, register interested beneficiaries of TraderMoni, MarketMoni and FarmerMoni."
  },
  {
    "headline": "Xenophobia:How Nigerian Diplomat Manhandled, Tortured in Indonesia -NigPilot",
    "summarized_story": "The development is coming on the heel of manhandling, torturing, and handcuffing of a senior Nigerian Diplomat in Jakarta, Indonesia, Mr Abdul Rahman Ibrahim over the weekend.\nThe release was titled The Continued Harassment, Intimidation and Unlawful Arrest of Nigerians in Asian Countries and The Need For President Muhammadu Buhari ‘s Urgent Intervention”.\nComrade Nwankwo explained with regret that, many Nigerians are currently languishing unjustly in many Prisons across Asia.\nThe development which resulted for him to sustain a lot of injuries in the neck, hands and chest.\nAfter the whole unfortunate and ugly drama, the Officers later realized that Mr. Abdul Rahman Ibrahim is a senior Counsellor/Diplomat with Nigerian Embassy in Indonesia as he had claimed."
  },
  {
    "headline": "Four Policemen Feared Killed As Gunmen Attack Area Command In Anambra",
    "summarized_story": "Four policemen have been reported killed during an attack by gunmen on the Police Area Command in Nnewi, Anambra State.\nThe spokesman for the Anambra State Police Command, Tochukwu Ikenga, told Channels Television that his office had yet to receive a detailed report on the incident.\nAccording to sources, the gunmen stormed the Police Area Command on Monday afternoon and engaged the security operatives in a fierce gunfight.\nAn eyewitness who pleaded anonymity told Channels Television that the gunmen overpowered the security operatives and carted away with some of their arms.\nSince the beginning of the year, dozens of police facilities, including a state police command have come under attack in the South East."
  },
  {
    "headline": "Nigerian Govt Condemns Assault On Diplomat By Indonesian Officials",
    "summarized_story": "The Ministry of Foreign Affairs has condemned the assault of a Nigerian diplomat by immigration officials in Indonesia.\nThe victim, whose name was not mentioned, was manhandled and arrested by immigration officials on Saturday in front of his official quarters in the Asian country.\n“The unfortunate incident is against international law and the Vienna Conventions governing Diplomatic and Consular Relations between states,” the Nigerian Foreign Affairs Ministry said in a statement on Monday.\nThe Nigerian Government has sent an official protest to the Government of Indonesia.”In addition to the Indonesian Ambassador’s apology, the immigration officials responsible for the assault have also apologised to the victim.\n“The Ambassador of Nigeria to Indonesia has confirmed that the immigration official involved had since come to the Nigerian Embassy to apologise to the Ambassador and the diplomat concerned,” the Foreign Ministry added."
  },
  {
    "headline": "Police Arraign Chidinma’s Father, Four Others Over Death Of Super TV Boss",
    "summarized_story": "The police have filed a criminal charge against Mr Onoh Ojukwu, father of Chidinma Ojukwu, who is accused of killing the Chief Executive Officer (CEO) of Super TV, Usifo Ataga.\nThe 57-year-old, and one Babalola Disu, 42, were charged with obstructing the police from performing their duties and failing to report a crime to the police.\nThe other defendants – Jessica Egbochi, 28; Abayomi Olutayo, 23; and Ifeoluwa Olowu, 23, were accused of receiving stolen items.\nHe informed the court that Ojukwu prevented the police from arresting his daughter, Chidinma, while the second defendant, Disu, failed to report Ataga’s death to the police.\nHe stated that the offences contravened Sections 97, 117, 328, and 411 of the Criminal Law of Lagos State, 2015."
  },
  {
    "headline": "Lawmakers Grant Lagos Govt’s Request To Take Over Lekki Concession Company",
    "summarized_story": "The Lagos State House of Assembly has granted the request of the State Governor, Mr Babajide Sanwo-Olu, for the state government to assume full ownership of the privately-owned Lekki Concession Company Limited (LCC).\nSix weeks after the mandate was given, the House Committee on Finance led by Rotimi Olowo submitted its report to the lawmakers.\nHe believes the interest rate will not affect what the state is spending on capital expenditure.\nRather, it will reduce the interest risk and rate by moving the loan from the private to the public sector.\nHe deemed the request a standard financial procedure practised all over the world."
  },
  {
    "headline": "Court Remands Chidinma In Prison Over Super TV CEO’s Murder",
    "summarized_story": "A Lagos State Chief Magistrates’ Court sitting in the Yaba area gave the order on Monday when she and one Adedapo Quadri were brought before the court by the Lagos State Police Command over alleged conspiracy and murder of the victim.\nWhile moving the remand application, police prosecutor, Cyril Ajiofor, stated that the application was based on Section 264 Subsections 1 and 2 of the Criminal Law of Lagos State.\n“We are praying for the remand of the defendants for the first count of murder,” he stated.\nRepresenting the first defendant, Babajide Martins, who is the Director of the Office of Public Defender, said the remand application was “inevitable”.\nChidinma was consequently arrested on June 23 in her father’s house in Yaba and paraded at the Lagos State Police Command headquarters in Ikeja."
  },
  {
    "headline": "Indonesia apologises to Nigeria over manhandling of Nigerian Dilpomat in Jakarta",
    "summarized_story": "The Federal Government of Nigeria through the Ministry of Foreign Affairs has protested strongly to the government of Indonesia over the arrest and maltreatment of a Nigerian diplomat in front of his apartment in the Indonesian capital of Jakarta.\nThe Government in Statement issued from the ministry of Foreign Affairs described the incident where the diplomat was manhandled as unacceptable, against International Law and a contravention of the Vienna convention governing diplomatic and Consular relations between States.\nThe Ministry of Foreign Affairs said it has invited the Indonesian Ambassador to Nigeria who has apologised unreservedly to the Federal Government on behalf of the Indonesian government while also explaining what went wrong.\nThe Immigration officials concerned have also been to the Nigerian embassy to apologise to the Nigerian ambassador to Indonesia and the concerned diplomat according to the Nigerian ambassador to Indonesia."
  },
  {
    "headline": "EFCC grills NIPC Boss, Yewande Sadiku, over alleged abuse of office",
    "summarized_story": "The Economic and Financial Crimes Commission(EFCC) has grilled the Executive Secretary and Chief Executive Officer of the Nigerian Investment Promotion Council (NIPC) Mrs. Yewande Sadiku for about nine hours.\nAccording to a source at the commission, the NIPC boss volunteered statement to a team of operatives.\nBut it was unclear if the NIPC boss will be detained or not as at press time.\nAdvertisementThe source said: “NIPC CEO, Mrs. Yewande Sadiku is currently in the custody of the, EFCC.\n“The NIPC boss is being questioned for abuse of office, bordering largely on issues over contract running into several millions of Naira and a posse of unearned frivolous allowances."
  },
  {
    "headline": "Two Naval men die in gun duel in Anambra",
    "summarized_story": "Two men of the Nigerian Navy have been feared killed during a gun duel with suspected members of the Indigenous People of Biafra (IPOB) in Anambra State.\nAs at the time of filing this report, the gun shots were still booming in the area with residents scampering to safetyIt was the same spot where three Naval men were killed in a gun duel with gunmen last year.\nThe gunmen were reported to have stormed the area in five vehicles where the security operatives were stationed and opened fire.\nAdvertisementAnambra police spokesman, Ikenga Tochukwu, however said he had not received detailed reports on the incident but confirmed there was heavy shooting in the area.\nHe added that security operatives were being deployed to the area to restore normalcy."
  },
  {
    "headline": "Nigeria: APC Secretary Explains Heavy Security Presence at Party Secretariat",
    "summarized_story": "“The police are here to strengthen the security for the leadership of the Governor Mai Mala Buni-led APC CECPC.\n“Whenever you have a security situation or report, you take precautions to protect lives and property.\nAkpanudoedehe said the APC could not underestimate the security report and could not play down on it.\nThe APC secretary said it was the responsibility of the CECPC as managers of the party to put measures in place to protect lives and property.\nHe, however, advised that no one should take anything for granted, saying that every security report must be taken seriously."
  },
  {
    "headline": "Lagos Marriot Appoints Van Rensburg as General Manager",
    "summarized_story": "The Lagos Marriott Hotel Ikeja has announced the appointment of Rudi Janse Van Rensburg as General Manager.\nVan Rensburg arrives with a vast wealth of 19 years’ experience in the hospitality sector, 13 of those years spent as General Manager across hotels and resorts in Africa.\nRudi will lead the management & operations of the Lagos Marriott Hotel, Ikeja.\nVan Rensburg has accomplished great things during his time in Nigeria and was named General Manager of the Year in 2009.\nThe General Manager is passionate and focused on impeccable 5-Star sophistication, very committed to his associates and identifies whole heartedly with the African continent."
  },
  {
    "headline": "Zuma’s Corruption Trial on Tuesday ‘to Be Postponed’ Due to Ill Healfh",
    "summarized_story": "The Jacob Zuma Foundation says Tuesday’s planned hearing relating to the corruption trial of former South African President Jacob Zuma is set to be postponed.\nZuma – who is currently serving a sentence for contempt of court – was expected to appear Tuesday for a court session relating to charges concerning an arms deal in the 1990s.\nHe has already pleaded not guilty to 16 counts of racketeering, corruption, fraud, tax evasion and money laundering.\nNPA spokesperson Mthunzi Mhaga said they would comment once there was a pronouncement from the judge hearing the matter.\nLusanda Ntuli of the office of the Chief Justice Mogoeng Mogoeng said that the judiciary had not received an application."
  },
  {
    "headline": "12 Soldiers Killed in Burkina Faso Attack: SABC",
    "summarized_story": "At least 12 soldiers were killed in an attack in northwestern Burkina Faso on Sunday and seven others are missing, SABC reports quoting security sources.\nSABC says there has been no immediate comment from the army but quoted sources to have said the incident took place in the Toeni commune in the Boucle du Mouhoun region near the border with Mali.\nAccording to the Communications Ministry, a special army unit killed two prominent jihadists in the same region.\nAttacks by militants linked to al Qaeda and Islamic State are on the rise in West Africa’s Sahel region, killing thousands and displacing millions in recent years across Burkina Faso, Mali and Niger.\nOn Wednesday, an armed group killed 30 civilians, army soldiers and pro-government militiamen in a series of attacks near Burkina Faso’s border with Niger."
  },
  {
    "headline": "Trending: Outcry Over Demolition Of Property in Imo State",
    "summarized_story": "Chidi Akpunku, a native of Imo State, South east Nigeria has lamented the demolition of his property worth hundreds of millions of Naira alleged to be illegally carried out by the Imo State Government recently.\nIn another development, grief, anger and sorrow where the expressions on the faces of UTC traders in the Federal Capital Territory, Abuja, who expressed fear over an attempt to take over their business areas.\nA woman perceived to be a mother of a student of University of Nigeria, Nsukka has decried the poor living condition in which students in a yet to be identified hostel in the school are subjected to.\nReactions continue to trail wedding ceremony between Yusuf son of President, Muhammadu Buhari and daughter of the Emir of Bichi, Nasir Ado-Bayero."
  }
]