[
  {
    "headline": "Kaduna bans use of school premises for social gathering",
    "summarized_story": "The Kaduna State Government has banned all social events, weddings, shows and entertainment on public school premises.\nThe Permanent Secretary, Ministry of Education, Dr Yusuf Saleh, stated this in an interview with the News Agency of Nigeria in Kaduna.\nSaleh said that the move was to protect school infrastructure from vandals.\nReacting to the development, Citizens Co-Chair, Kaduna Basic Education Accountability Mechanism, Tijjani Aliyu, commended the state government for responding to citizens’ call to protect school facilities.\nThe move, he said, will reduce the level of destruction of school facilities due to social events hosted on school premises."
  },
  {
    "headline": "South Africa’s Ramaphosa recovers from COVID-19, resumes work",
    "summarized_story": "South African President Cyril Ramaphosa has returned to work after spending a week in isolation following a positive Covid test, his office said Monday.\nRamaphosa, 69, who is fully vaccinated, felt unwell after leaving a state memorial service for former president FW de Klerk in Cape Town on December 12 as his nation battles an exponential increase in cases of the Omicron coronavirus variant.\n“President Cyril Ramaphosa has ended a week of self-isolation which followed his positive test for COVID-19 on 12 December 2021,” his office said in a statement.\n“The President has returned to duty and will chair the final Cabinet meeting for 2021 on Wednesday, 22 December 2021.\n“President Ramaphosa repeats his call for everyone in the country to stay safe by being vaccinated, wearing face masks, washing or sanitising hands frequently, maintaining a social distance and avoiding gatherings.”South Africa, where the highly mutated Omicron variant was first detected last month, is Africa’s worst-hit country according to official tallies of virus cases, with more than 3.3 million infections logged and more than 90,000 deaths."
  },
  {
    "headline": "Kaduna Govt bans social gathering in school premises",
    "summarized_story": "The Kaduna State Government has banned all social events, weddings, shows and entertainment in public school premises.\nSaleh said that the move was to protect school infrastructure from vandals.\nReacting to the development, Mr Tijjani Aliyu, Citizens Co-Chair, Kaduna Basic Education Accountability Mechanism (KADBEAM), commended the state government for responding to citizens’ call to protect school facilities.\nThe move, he said, will reduce the level of destruction of school facilities due to social events being hosted in school premises.\nHe added that stakeholders at the engagement, supported by Partnership to Engage, Reform and Learn, a UK governance programme, noted the need for community members to support the government in maintaining school facilities."
  },
  {
    "headline": "Alleged N3bn loan diversion: Absence of judge stalls ‘whistleblower’s trial",
    "summarized_story": "The absence of Justice Iniekenimi Uzakah of a High Court in Bayelsa on Monday stalled the trial of John Idumange, who raised an alarm over alleged diversion of N3 billion Agriculture loan by government officials in Bayelsa.\nThe News Agency of Nigeria (NAN) report that court registry staff informed litigants and their counsel that Justice Uzakah, will not be sitting.\nAlthough no reason was advanced for the absence of the judge, court officials said that the judge had directed parties and their lawyers in the cases listed to pick a new date for adjournment.\nSome officials of the state government, reported to the police that Idumange, made seditious publications that maligned their persons in his claims.\nNAN reports that the case, earlier assigned to Justice Ebiyerin Omukoro, was reassigned to Justice Uzakah following a written request by the state Attorney-General to the Chief Judge of Bayelsa, Justice Kate Abiri (NAN)"
  },
  {
    "headline": "Court nullifies APC, Uba’s participation in Anambra poll",
    "summarized_story": "A Federal High Court, Abuja, on Monday, nullified the participation of the All Progressives Congress (APC) and its candidate, Andy Uba, in the Nov. 6 Anambra governorship election.\nThe News Agency of Nigeria (NAN) reports that Chief George Moghalu, an aspirant in the APC primary election had challenged the process and the outcome of the primary election that produced Uba as the party’s candidate.\n“The 2nd defendant (INEC) is compelled to delist the name of the 1st defendant and 3rd defendant from the Nov. 6, Anambra governorship election,” he ordered.\nAccording to the judge, any election conducted contrary to the 1st defendant guideline is in nullity.\nINEC had picked Uba, winner of the APC primary election, as the party’s candidate."
  },
  {
    "headline": "Killing of 38: No breathing space for bandits, Uba Sani charges security agents",
    "summarized_story": "…Promises to do his best to support bereaved constituentsBy Ibrahim Hassan-WuyoSenator Uba Sani(APC) Kaduna central has declared that his heart is bleeding for the 38 people murdered in cold blood by bandits in his Giwa Local Government constituency.\nThe lawmaker, who was visibly saddened ,said in a statement that the latest attacks and the loss of 38 innocent lives was an affront that must be “decisively dealt with by security agents” .\nHe declared a commitment to do whatever is possible to take care of all the bereaved families in the constituency.\n“I feel the pain of the bereaved families.\nHe prayed to Almighty Allah to forgive the shortcomings of the victims and grant them Aljanah Firdaus."
  },
  {
    "headline": "‘It is uncultured to wish President Buhari evil’",
    "summarized_story": "Mr Ademola Abidemi, presidential candidate of the Nigeria Community Movement Party at the 2019 general elections says it is uncultured for any Nigerian to wish President Muhammadu Buhari evil on his birthday.\n“If President Buhari had died many years ago as a soldier defending his country, those wishing him evil today would have called him a fallen hero.\n“If you go against traffic rules or disobey the laws of Nigeria in any way, you cannot pray evil for the president.\n“Even after office, President Buhari can never live like an ordinary Nigerian except he so chooses,’’ Abidemi stated.\nThe former presidential flag bearer congratulated President Buhari on his birthday and wished him long life in prosperity and good health."
  },
  {
    "headline": "Yuletide: Police deploy personnel to ensure hitch-free festivities in Bauchi",
    "summarized_story": "The Bauchi State Police Command on Monday assured the people of the state of its readiness to perform its statutory responsibility of protecting their lives and properties with a view to ensuring hitch-free Christmas and New Year celebrations across the state.\nThe assurance was given in a press release signed by the state Police Public Relations Officer (PPRO), Ahmed Mohammed Wakil, made available to DAILY POST in Bauchi.\nTo ensure hitch-free festivities, Wakil, a Superintendent of Police (SP), informed that the state Commissioner of Police, Umar Mamman Sanda, had ordered the deployment of officers and men, comprising conventional police and other tactical teams as well as necessary logistics to all churches and venues of events in the state.\n“The Command will collaborate with sister security agencies and all critical stakeholders to ensure that, the celebration is peaceful and hitch-free.\nHe, however, warned that those planning to foment troubles during the festive period and afterward would be dealt with."
  },
  {
    "headline": "Ex-Kano Gov, Kwankwaso loses brother",
    "summarized_story": "Former Kano State Governor, Rabiu Musa Kwankwaso and his family are bereaved.\nOn Monday, Inuwa Musa Kwankwaso, his immediate younger brother, died at the age of 64.\nKwankwaso worked with the Afforestation Project in Kano, a statement by Sanusi Bature, a Kwankwasiyya spokesman noted.\nThe deceased is survived by his wife, two daughters, Nafisa Inuwa and Zainab Inuwa, and relatives.\nHe will be buried according to Islamic rites in Kwankwaso village, Madobi Local Government at 2 pm today."
  },
  {
    "headline": "2023: Arm yourselves with PVCs – Cleric to Christians",
    "summarized_story": "Christians in Nigeria have been enjoined to arm themselves with their Permanent Voter Cards (PVCs) in preparation for the forthcoming general elections.\nGiving this advice, the presiding pastor of Chapel of Mercy International Church, Okinni, Osun State, Victor Bajulaye, also advised that rather than sitting down and complaining about the nation’s challenges, Christians should get involved in the electoral processes.\nIn his words, “We need to encourage others to get their permanent voter’s cards at any INEC offices, which will be used to cast their votes.”The cleric, while citing Biblical references, called on Nigerians to continue praying for their leader for wisdom to rule and lead the people aright.\n“The Bible states that we should pray for our leaders and that we must support them to succeed and our land shall be blessed,” he added.\nThe convener of the event, Mrs Aderonke Abokede stated that the reason for the programme was to appreciate God for his love and faithfulness in the lives of the participants."
  },
  {
    "headline": "Buratai identifies major causes of insecurity in Nigeria",
    "summarized_story": "Former Chief of Army Staff, Lt. Gen. Tukur Buratai (rtd), has identified a weak justice system, ignorance and poor leadership, among others, as factors responsible for insecurity and other social challenges in Nigeria.\nBuratai, who is Nigeria’s Ambassador to the Republic of Benin, said this at the groundbreaking and fundraiser for Tukur Buratai Research Centre (TBRC) at Gora in Nasarawa State, NAN reports.\nHe said inadequate research and development implementation in Nigeria create a massive void in the country’s progress.\nBuratai said, “When properly focused research and training institutes are established, innovation and development become a natural progressive activity that benefits the nation’s life.\n“Corruption, insecurity due to terrorism and banditry, inadequate infrastructure, issues in governance and an inept educational system are all systemic flaws."
  },
  {
    "headline": "Supreme Court voids conviction of Senior Advocate of Nigeria, Joseph Nwobike",
    "summarized_story": "The Supreme Court has set aside the conviction and one-month imprisonment of a Senior Advocate of Nigeria (SAN), Dr Joseph Nwobike charged with an attempt to pervert the course of justice.\nIn a unanimous decision on Monday, a five-member panel of the Supreme Court, led by Justice Olukayode Ariwoola, faulted the earlier decisions of the Lagos High Court and the Court of Appeal, Lagos, and proceeded to uphold Nwobike’s appeal.\nIt held among others that the High Court of Lagos was wrong in convicting Nwobike on the offence, while the Court of Appeal erred in upholding his conviction and sentencing on the offence of attempt to pervert the course of justice.\nThe EFCC had, among others, accused him of exchanging text messages with court officials on the assignment of his cases and when such cases should be heard.\nDetails shortly…"
  },
  {
    "headline": "BOOK OF THE YEAR: A FRONT ROW PARTICIPANT’S ACCOUNT",
    "summarized_story": "It began as a book presentation, and the bigwigs of the Nigerian political firmament gathered, especially of the APC hue.\nThe president, Muhammadu Buhari, in his full light-blue babaringa and loosed-limbed with humour, was accompanied by a raft of governors.\nThe book reviewer and this newspaper’s Editor-at-Large, Segun Ayobolu, pronounced what was to come.\nAkande’s My Participations will shake and echo in the political world for a long time.\nFor telling a story that has spun a spool stories, My Participations is our book of the year."
  },
  {
    "headline": "TRAGEDY OF THE YEAR: IKOYI FOURSCORE TOWER COLLAPSE",
    "summarized_story": "It was a tragedy not only because the dead included the ambitious builder of the ambitious residential tower and CEO of Fourscore Homes, Femi Osibona.\n“They are flats, but we make it feel like you are living in a seven-star hotel.\nEverything that is in a seven-star hotel, you will have there.\nPractically everything you have in a seven-star hotel.”- Advertisement -It was a tragedy not only because the building collapse raised questions about structural integrity and the builder’s integrity.\nIt was a tragedy not only because the crumbled tower was said to lack insurance cover."
  },
  {
    "headline": "JUDGEMENT OF THE YEAR: A VERDICT LIKE NO OTHER",
    "summarized_story": "Self-determination is a fundamental right…that cannot be subjugated – Justice AkintolaAgitations for self-determination are not new.\nThe struggle is usually long and tortuous wherever this set of people seeks to quit a nation state.\nIn some cases, the state labels them as rebels and go all out to kill their struggle.\nNo, says Justice Ladiran Akintola of the Ibadan High Court, in his verdict on the case of Yoruba Nation agitator Chief Sunday Adeyemo popularly known as Sunday Igboho against the Federal Government.\nSelf-determination is one of the fundamental human rights of the citizens that cannot be subjugated’’."
  },
  {
    "headline": "CONTROVERSY OF THE YEAR: THE WAR OVER VAT",
    "summarized_story": "Yet, it is one controversy that has refused to go away as it is yet before the judiciary for adjudication.\nRivers generated N90 billion, but was allocatedN47 billion, behind Kano that generated N24 billion and got allocated N47 billion.\nOver the years, the VAT that was first introduced under the Babangida administration has grown to become a major funding source for state governments.\nIn the past four years, about N10 trillion was generated as VAT and shared.\nIn 2020, this accounted for 22.7 per cent of the VAT, while foreign non-import VAT amounted to 27.4 per cent."
  },
  {
    "headline": "SCANDALS OF THE YEAR: TIWA SAVAGE AND DCP ABBA KYARI",
    "summarized_story": "Nigerians will not forget in a hurry, the scandals involving music diva, Tiwa Savage, and widely acclaimed ‘super cop’ DCP Abba Kyari.\nFirst was music diva, Tiwa Savage, whose sex tape set cyberspace agog.\nSocial media pulsed with outrage as fans of the music artiste and her critics went to war soon before and after the release of a sex video featuring Savage.\nSavage stated that she could release the video herself because she is ‘that crazy’.\nKyari said he introduced the tailor to Abbas after the latter expressed the desire to buy some native attires he (Kyari) shared on his Facebook page."
  },
  {
    "headline": "Electoral Bill: Lawmakers talk tough as Buhari withholds assent within deadline",
    "summarized_story": "From Fred Itua and Ndubuisi Orji, AbujaPlans by senators and the House of Representatives to override President Muhammadu Buhari’s veto on the Electoral Amendment Bill may have hit a dead end.\nHowever, Daily Sun gathered that some lawmakers across party divide would not let the rejection go without a fight.\nThe signing of the Electoral Amendment Bill by President Buhari, elapsed yesterday, having clocked the mandatory 30 days, within which the president must communicate to the National Assembly on his decision regarding any Bill passed by the parliament.\nHe further revealed that the National Assembly is already divided along regional lines on the issue of direct primaries and electronic transmission of results from polling units.\nThe top government official said many northern lawmakers would side with Buhari if the National Assembly makes any move to override him."
  },
  {
    "headline": "Again, bandits kill 38, burn houses in Kaduna",
    "summarized_story": "From Noah Ebije, KadunaNo fewer than 38 persons were killed and several property destroyed by bandits, yesterday, in Giwa Local Government Area of Kaduna State.\nThe killings came on the heels of nine people killed by bandits in Kaduna communities about three days ago.\n“The governor also commiserated with the affected communities and directed the Kaduna State Emergency Management Agency to conduct an urgent assessment of the area towards providing relief.\n“The identities of the victims will be published once further details are confirmed by the Kaduna state government.\nHe said: “Following the report of attacks by bandits across villages in Idasu, Giwa LGA, contained in an earlier update, security agencies have confirmed to the Kaduna State Government that 38 people were killed across the locations attacked."
  },
  {
    "headline": "Igbo group raises the alarm over multiple security checkpoints in South East",
    "summarized_story": "The traveller form Abuja sees checkpoints every two kilometers until he reaches Delta North fringes.\nThe two sets of travellers then are subjected to the horror of a checkpoints every half a kilometer.\n“The distance between checkpoints is reduced to 200 meters once a traveller crosses the Niger Bridge.\nThis Niger bridge obstruction with checkpoints causes five-kilometer back log of cars in a traffic snarl.\nBut it takes about six hours to travel the distance from the outskirts of Asaba to the Niger Bridge."
  },
  {
    "headline": "Military raids Turji’s hideout, kills scores of bandits in Zamfara, Sokoto forests",
    "summarized_story": "The attack jets of the Air Task Force (ATF), Operation Hadin Kai, also killed several bandits, in the raid carried out at some forests in Zamfara and Sokoto states, early Saturday.\nAccording to the intelligence source, the actual number of bandits who were eliminated by the air strikes could not be ascertained, in the dawn operations.\nPRNigeria, however, gathered that some bandits who sustained serious injuries attempted to flee, but were ambushed by ground troops.\n“Furthermore on the morning of December 18, air strikes were carried out in Gebe Village, Sokoto State where bandits, were hitherto harassing innocent citizens, were also mercilessly dealt with.\nHe said a General Officer Commanding, led troops to strongholds of the bandits in Sokoto and Zamfara states, while at the same time, multiple air strikes of the military attack jets pounded the criminal bandits."
  },
  {
    "headline": "Desperate opposition politicians out to run down Buhari’s achievements – Minister",
    "summarized_story": "From Layi Olanrewaju, IlorinInformation and Culture Minister, Lai Mohammed, yesterday claimed naysayers, sponsored attackers and desperate opposition politicians are out to run down the President Muhammadu Buhari’s unprecedented achievements.\nHe said President Buhari has kept Nigeria afloat amidst myriad of challenges buffeting the country and added that he has also set the country on a trajectory of growth and development.\nThe minister stated this in Ilorin, Kwara State, in commemoration of President Buhari’s 79th birthday anniversary.\n“Despite a myriad of security challenges, and amidst dwindling national earnings and a crippling global pandemic, he has racked up a number of achievements, most of them unprecedented.\nI believe God has a reason for keeping him alive when many had written him off as dead.”"
  },
  {
    "headline": "Court Voids APC’s Participation in Anambra Guber Poll over Unlawful Primary",
    "summarized_story": "Disqualifies Andy UbaAlex Enumah in AbujaJustice Inyang Ekwo of the Federal High court, Abuja on Monday voided the participation of the All Progressives Congress (APC) in the just concluded Anambra governorship election.\nJustice Ekwo in a judgement held that the primary election of the APC that produced Senator Andy Uba as flag bearer of the party, substantially failed to comply with the electoral guidelines for the conduct of governorship primary election as well as the APC’s guidelines and constitution.\nThe judge subsequently disqualified Andy Uba and the APC from participating in the November 6 governorship poll, won by Professor chukwuma Soludo of the All Progressives Congress Alliance (APGA).\nDetails later.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Supreme Court Sets Aside Conviction of Senior Lawyer, Nwobike",
    "summarized_story": "The Supreme Court has set aside the conviction and 30 days sentencing of a Senior Advocate of Nigeria (SAN), Dr. Joseph Nwobike.\nHe was charged with attempt to pervert the course of justice.\nIn a unanimous decision on Monday, a five-member panel of the Supreme Court, led by Justice Olukayode Ariwoola, faulted the earlier decisions of the Lagos High Court and the Court of Appeal, Lagos, and proceeded to uphold Nwobike’s appeal.\nIt held among others that the High Court of Lagos was wrong in convicting Nwobike for the offence.\nThe apex court also said the Court of Appeal erred in upholding his conviction and sentencing for the offence of attempt to pervert the course of justice."
  },
  {
    "headline": "On Deadline, Buhari Fails to Reject Electoral Act Amendment Bill",
    "summarized_story": "The National Assembly once exercised this overriding power in the case of the Niger Delta Development Commission Bill.\nIn withholding his assent, President Buhari gave such reasons infractions on extant laws, duplication of responsibilities of existing agencies, and financial constraints owing to prevailing economic circumstances.\nThey had since launched an offensive against direct primaries, urging the president not to sign the amended electoral act bill.\nFrom Monday morning, we will turn to the National Assembly to act in the national interest and pass the bill expeditiously before they embark on the Christmas recess.\nThe Ninth National Assembly has the opportunity of not sharing with the executive, the glory that will accompany the new act.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Rampaging Terrorists Kill 38 in Kaduna Communities",
    "summarized_story": "The president, who just got back from a three-day visit to Turkey, returned to the news of some 38 persons, reportedly killed in some communities in Kaduna State by bandits and stressed that killing of innocent citizens were no more acceptable.\nAlso, the Commissioner for Internal Security and Home Affairs in Kaduna State, Samuel Aruwan, who disclosed the latest killings in a statement, confirmed that no fewer than 38 people were killed in Giwa Local Government Area of the state.\nBuhari, while condemning the renewed killings in Kaduna State, said the gruesome nature of recent incidents in Kauran Fawa, Marke and Ruhiya of Idasu Ward of Giwa Local Government Area, has made him particularly sad and the killings unacceptable.\n“The governor also commiserated with the affected communities and directed the Kaduna State Emergency Management Agency to conduct an urgent assessment of the area towards providing relief,” he said.\nThe police, in the course of investigations, identified and raided various criminal hideouts,where kidnap victims were usually kept."
  },
  {
    "headline": "Imperial College London: Omicron Largely Evades Immunity from Past Infection or Two Vaccine Doses",
    "summarized_story": "*Fauci harps on booster jabsPeter Uzoho with agency reportThe Omicron variant largely evades immunity from past infection or two vaccine doses, according to the latest Imperial modelling.\n“Our booster vaccine regiments work against omicron,” US-based ABC News quoted him to have said.\nThe Imperial College report implied that the protection against reinfection by Omicron afforded by past infection may be as low as 19 per cent.\nResearchers estimated the growth and immune escape of the Omicron variant in England.\nAccording to the report obtained from the Imperial College website, the study included people identified as having Omicron infection due to an S gene target failure (SGTF), as well as people with genotype data that confirmed Omicron infection."
  },
  {
    "headline": "EXCLUSIVE: Despite Promises To Reduce Wastefulness, Junketing Buhari Takes Three Presidential Jets To Turkey Amid Cash Crunch",
    "summarized_story": "Three Nigerian presidential jets were flown to Turkey by President Muhammadu Buhari and his entourage to the three-day Turkey-Africa Partnership Summit in Istanbul, SaharaReporters has gathered.\nThey include a Boeing Business jet (Boeing 737-700) marked 5N-FGT, a Falcon 7X jet with registration number 5N-FGV and a Gulfstream Aerospace GV-SP (G550) with registration number 5N-FGW and serial number 5310 (Mode-S 0640F2).\nThe presidential jet had developed a fault while the President and his entourage were returning to Abuja from the UN General Assembly in the US on Saturday, September 25.\nDespite promising to cut waste, the Buhari-led government has spent at least N41 billion on the presidential fleet.\nBut in 2021, the budget for the presidential fleet saw its sharpest Buhari-era jump to N12.550 billion (243.6 per cent)."
  },
  {
    "headline": "EXCLUSIVE: Despite Promises To Reduce Wastefulness, Junketing Buhari Takes Three Presidential Jets To Turkey Amid Cash Crunch",
    "summarized_story": "Three Nigerian presidential jets were flown to Turkey by President Muhammadu Buhari and his entourage to the three-day Turkey-Africa Partnership Summit in Istanbul, SaharaReporters has gathered.\nThey include a Boeing Business jet (Boeing 737-700) marked 5N-FGT, a Falcon 7X jet with registration number 5N-FGV and a Gulfstream Aerospace GV-SP (G550) with registration number 5N-FGW and serial number 5310 (Mode-S 0640F2).\nThe presidential jet had developed a fault while the President and his entourage were returning to Abuja from the UN General Assembly in the US on Saturday, September 25.\nDespite promising to cut waste, the Buhari-led government has spent at least N41 billion on the presidential fleet.\nBut in 2021, the budget for the presidential fleet saw its sharpest Buhari-era jump to N12.550 billion (243.6 per cent)."
  },
  {
    "headline": "Bandit Kingpin, Bello Turji, Writes Buhari, Others, Seeks Dialogue, Says Only Sheikh Gumi Understands Bandits",
    "summarized_story": "The leader of a gang of bandits, Bello Turji, has allegedly written a letter to President Muhammadu Buhari; Zamfara State Governor, Bello Matawalle and the Emir of Shinkafi.\n\"This is a letter (originally written in Hausa as seen below) from Mohammed Bello Turji Kachalla, the one we all know about.\nIf this is done, I Mohammed Bello Turji Kachalla, will make sure to disarm all my men and hand over all our arms to the government of Nigeria.\n\"This letter is from Mohammed Bello Turji Kachalla.\"\nThe group's director, Professor Ishaq Akintola, in a recent statement, said sources had identified Turji as the bandit behind the killings."
  },
  {
    "headline": "Bandit Kingpin, Bello Turji, Writes Buhari, Others, Seeks Dialogue, Says Only Sheikh Gumi Understands Bandits",
    "summarized_story": "The leader of a gang of bandits, Bello Turji, has allegedly written a letter to President Muhammadu Buhari; Zamfara State Governor, Bello Matawalle and the Emir of Shinkafi.\n\"This is a letter (originally written in Hausa as seen below) from Mohammed Bello Turji Kachalla, the one we all know about.\nIf this is done, I Mohammed Bello Turji Kachalla, will make sure to disarm all my men and hand over all our arms to the government of Nigeria.\n\"This letter is from Mohammed Bello Turji Kachalla.\"\nThe group's director, Professor Ishaq Akintola, in a recent statement, said sources had identified Turji as the bandit behind the killings."
  },
  {
    "headline": "Dubai Suspends Flights From Kenya For 48 Hours",
    "summarized_story": "The Dubai Civil Aviation Authority (DCAA) has banned all transport services with inbound and transit passenger movements from Kenya for 48 hours.\nFly Emirates stated, \"Customers will not be accepted for travel on Emirates flights at Nairobi during this time.\"\nThe Emirates Nairobi office stated that it was receiving an influx of calls and was handling the issues within 48 hours.\n\"Kindly note that we are receiving too many calls and you may hold up to 48 hours.\"\nThe suspension of flights followed Health CS Mutahi Kagwe's confirmation of cases of Omicron variant of coronavirus in the country."
  },
  {
    "headline": "Supreme court voids conviction of lawyer demoted as SAN for bribery",
    "summarized_story": "The supreme court has upturned the conviction of Joseph Nwobike, former senior advocate of Nigeria (SAN), on technical grounds.\nAdvertisementThe court held that the EFCC lacked the power to prosecute anyone for the offence of perversion of justice.\nFollowing his conviction, the Legal Practitioners’ Privileges Committee (LPPC) stripped Nwobike of his SAN rank.\nAdvertisementDissatisfied, Nwobike asked the appellate court to overrule the state high court.\nHowever, delivering judgment on Monday, a five-member panel of the supreme court led by Olukayode Ariwoola quashed the conviction."
  },
  {
    "headline": "Supreme court voids conviction of lawyer demoted as SAN for bribery",
    "summarized_story": "The supreme court has upturned the conviction of Joseph Nwobike, former senior advocate of Nigeria (SAN), on technical grounds.\nAdvertisementThe court held that the EFCC lacked the power to prosecute anyone for the offence of perversion of justice.\nFollowing his conviction, the Legal Practitioners’ Privileges Committee (LPPC) stripped Nwobike of his SAN rank.\nAdvertisementDissatisfied, Nwobike asked the appellate court to overrule the state high court.\nHowever, delivering judgment on Monday, a five-member panel of the supreme court led by Olukayode Ariwoola quashed the conviction."
  },
  {
    "headline": "NERC: Togo, Benin failed to pay FG N770m electricity bill in Q2 2021",
    "summarized_story": "The Nigerian Electricity Regulatory Commission (NERC) says the Republic of Benin, Niger Republic, Togo made no payment for the electricity supplied to them from Nigeria in the second quarter of 2021.\nAdvertisementThe commission disclosed this in its second-quarter report for 2021.\n“This represents a 1.78 percentage point decrease from the final settlement rate recorded in the first quarter of 2021.\n“Apart from Eko Disco, none of the other DisCos met their expected minimum remittance thresholds (“MRTs”) to NBET in the quarter under review.\nAdvertisement“Discos remittance performance level ranged from 10.51 percent (Yola) to 63.69 percent (Eko) for NBET and 28.76 percent (Yola) to 99.88 percent (Eko) for MO."
  },
  {
    "headline": "NERC: Togo, Benin failed to pay FG N770m electricity bill in Q2 2021",
    "summarized_story": "The Nigerian Electricity Regulatory Commission (NERC) says the Republic of Benin, Niger Republic, Togo made no payment for the electricity supplied to them from Nigeria in the second quarter of 2021.\nAdvertisementThe commission disclosed this in its second-quarter report for 2021.\n“This represents a 1.78 percentage point decrease from the final settlement rate recorded in the first quarter of 2021.\n“Apart from Eko Disco, none of the other DisCos met their expected minimum remittance thresholds (“MRTs”) to NBET in the quarter under review.\nAdvertisement“Discos remittance performance level ranged from 10.51 percent (Yola) to 63.69 percent (Eko) for NBET and 28.76 percent (Yola) to 99.88 percent (Eko) for MO."
  },
  {
    "headline": "Chaotic Olympics outing, Bash Ali vs Sunday Dare... 9 biggest sports controversies of 2021",
    "summarized_story": "The tussle and its ripple effects contributed to the abysmal outing that the country suffered at the Tokyo Olympics.\nSamsung sagaThere was further drama at the Tokyo Olympics when officials of the Nigeria Olympics Committee (NOC) refused to give the disqualified athletes the Samsung phones due to them.\nExplaining the situation, Femi Adetula, NOC spokesman, said the body was only following the terms and conditions for the phones as stipulated by International Olympics Committee (IOC).\n‘PumaGate’On the eve of the final shot put event at the Tokyo Olympics, Chukwuebuka Enekwechi posted a video on Instagram.\nConsequently, the ministry failed to allow Nigerian athletes to wear the Puma-branded apparel at Tokyo Olympics, arguing that it’s “a subject of a criminal investigation”."
  },
  {
    "headline": "Inside TeamApt: How an upstart overturned competition to dominate agency banking",
    "summarized_story": "After the $5.5 million raise, TeamApt had cash in the bank to place orders for terminals in China and invaded the Nigerian market.\nTo improve the reliability of its product, TeamApt introduced to the market a 24-hour resolution service for false debit card withdrawals.\nTosin Eniolorunda, founder and CEO of TeamApt, champions the thought process and is instilling it into the company culture.\nWith TeamApt seemingly to be crowned with unicorn status, the company now has its eyes on digital banking but with a slant.\nSo, we will be launching a hybrid credit-led banking solution that also caters to the offline market,” Eniolorunda concludes."
  },
  {
    "headline": "Koniku closes Series A round led by Nigeria-based Platform Capital",
    "summarized_story": "Koniku Inc., a Nigerian-founded biotech company that operates out of California, on Friday said it has closed a Series A financing round led by Nigeria-based private equity firm, Platform Capital Investment Partners.\nIn the wake of the fresh investment, four new members will be joining the company’s board of directors, including Akintoye Akindele, Chairman and CEO of Platform Capital.\nThe company’s technology combines traditional computer cells with living biological neurons to give computers power to detect odours.\nBeyond security and healthcare, Konikore has broad applications in industrial monitoring, energy, food and agriculture sectors, and more.\nThe founder is also African, intelligent, passionate, and committed to the Koniku vision,” Dr. Akintoye told TechCabal in an interview, explaining the rationale behind backing Koniku for a second time."
  },
  {
    "headline": "Want luxury fashion? Play Africa’s first metaverse crypto game",
    "summarized_story": "Digital fashion can be in the form of digital fashion conceived to produce physical garments or fashion that a person can wear only with augmented or virtual reality.\nA product of digital fashion, hyper-real fashion, is used to explain the use of tech to virtually showcase fashion products.\nThis was how Thrill Digital started Astra, a fashion crypto game where players can win real-life fashion luxury items.\nThe game would have its own crypto token, which must be connected to a crypto wallet like the popular crypto game, Axie Infinity.\nThe leading crypto game has raked in $84.9 million in funds, making its protocol profit one of the biggest in the market."
  },
  {
    "headline": "Ventures Platform launches a $40m fund, invites Seni Sulyman as venture partner",
    "summarized_story": "A sizable portion of the fund comes from local partners, Ventures Platform told TechCabal.\nThis new capital injection will enable Ventures Platform to double down on existing investments in its category-leading portfolio via subsequent rounds.\nAs part of a move to further deepen its expertise, Ventures Platform has also onboarded leading figures across African tech as Venture Partners, including Seni Sulyman (ex-VP at Andela, founder at Black Ops.)\nThis transparency helped ventures attract talents like Kayode Oyewole, partner at Ventures Platform and Fola Olatunji-David, who later left the firm to become Head of Startup Success and Service at Google.\nThis happened because people who were impressed with the performance of the firm’s portfolio companies wanted to invest in Ventures Platform."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "Blockchain-powered music and bigger investments: The next frontier for music tech",
    "summarized_story": "But after a closer look and talking to some of the industry’s brightest, the signs are there — the next frontier for music tech may be closer than we imagine.\nUltimately, he believes the music industry is worthy of the same attention investors pay to fintech or healthtech, for example.\nWhile Nigeria cannot boast such levels of investment, the state of the music industry signals that more investments could have a positive impact on the economy.\nIn terms of revenue, the music industry raked in $40 million in 2021.\nAdetunji and Okpala are optimistic about the future of African and Nigerian music, one where tech will definitely determine what the next frontier will be."
  },
  {
    "headline": "Meet the 15 semi-finalists for Pitchstorm 3.0",
    "summarized_story": "Mandila Inc: A startup based in Burkina Faso with an app built to teach and preserve African languages.\nUsing data, they provide farmers with information to plan their pre-planting, planting and post-planting operations.\nFinancial inclusionByte: A Nigerian startup replacing account numbers with a phone number, email, or a byte tag for payments in between banks and other financial institutions.\nAxocheck: A Nigerian startup with a mobile app where users can request and schedule home checkups.\nSpacehunt Inc: A Nigerian mobile app that connects renters and buyers to all of the available properties in their city."
  },
  {
    "headline": "Privacy Roundtable IV, problems in the metaverse, a Bitcoin trust fund, and AfDB’s $170 million loan",
    "summarized_story": "Thankfully 27 out of 55 countries on the continent have enacted data protection laws and regulations.\nRecently, on December 3, 2021, Zimbabwe joined the ranks of African countries with a data protection law.\nJack announces ₿trust boardTwitter ex-CEO, Jack DorseyTwitter’s ex-CEO, Jack Dorsey, has announced the board of a Bitcoin trust fund, ₿trust, he set up with American rapper and business mogul, Shawn Carter aka, Jay-Z.\nAccording to Dorsey, the four were selected among 7,000 applicants “all reviewed with purpose and rigor.” The 500 BTC trust fund was created to fund Bitcoin development in Africa and India.\nReadThe Best Metaverse Investment RIGHT NOW."
  },
  {
    "headline": "Abuja, Nigeria’s latest ‘city of refuge’ gets overstretched",
    "summarized_story": "The population growth in Abuja – the Federal Capital Territory – is not just simply a trend in urbanisation, which is a global phenomenon.\nMost hotels in the city centre and outskirts are consistently being overbooked by visitors, residents and tourists into the city, most especially, Nigerians seeking long term stay in the federal capital territory.\nThe cost of living in the city capital is also rising as more people migrate into the nation’s capital.\nPeople believe there are job opportunities in Abuja because it is the capital city.\n“Abuja today is experiencing this grind because over the years, the government in power did not envisage a time when Nigerians will begin to seek refuge in the Federal Capital."
  },
  {
    "headline": "Abuja, Nigeria’s latest ‘city of refuge’ gets overstretched",
    "summarized_story": "The population growth in Abuja – the Federal Capital Territory – is not just simply a trend in urbanisation, which is a global phenomenon.\nMost hotels in the city centre and outskirts are consistently being overbooked by visitors, residents and tourists into the city, most especially, Nigerians seeking long term stay in the federal capital territory.\nThe cost of living in the city capital is also rising as more people migrate into the nation’s capital.\nPeople believe there are job opportunities in Abuja because it is the capital city.\n“Abuja today is experiencing this grind because over the years, the government in power did not envisage a time when Nigerians will begin to seek refuge in the Federal Capital."
  },
  {
    "headline": "Is Flour Mills deal to acquire Honeywell made in heaven?",
    "summarized_story": "The expected combination of Flour Mills Nigeria (FMN) and the flour mills unit of Honeywell Flour Mills plc (HFMP) will form a formidable entity and an unassailable market leader in the agro-allied sector in Nigeria, according to industry players and market analysts.\nLast month, Flour Mills announced it had reached a deal to acquire the flour mills business of Honeywell in an N80 billion deal that will significantly enhance its market leadership.\nIn full year ended March 2021, the turnover for the two was N771.6 billion for Flour Mills and N109.59 billion for Honeywell Flour, and the combination will see FMN emerge as a true continental giant, amassing substantial value for shareholders and huge economic benefit for Nigeria.\nRead Also: Honeywell, Flour Mills N80bn merger to boost Nigeria’s food productionFMN, established in 1960, prides itself of being in the vanguard of feeding the nation for the past 60 years.\nUnder the deal, Honeywell Group will dispose of a 71.69 percent stake in its flour business to FMN based on an enterprise value of N80 billion and subject to approval from the appropriate regulators."
  },
  {
    "headline": "Alleged N375.8million: NILDS Challenges AGF over Vehicle Purchase – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The National Institute for Legislative and Democratic Studies ( NILDS) has challenged the claims made by the Office of Auditor General of the Federation on alleged N375.8million vehicle purchase in 2016 .\nRecall that the AGF had in the 2016 Audit Report, alleged that NILDS cornered about N36million from inflation of prices of 11 vehicles it purchased totalling N375.8million .\nThe AGF in the Audit report , also alleged that NILDS under the leadership of Professor Ladi Hamalai, also illegally paid about N67million into another account.\n” This is contrary to the provision of FR 613 which stipulated that “Payments shall be made only to the persons named in the vouchers or their properly authorized representatives.\nThe Institute on the alleged N67million paid to payees not on vouchers , said the infraction has been sorted out with the contractors who supplied the vehicles."
  },
  {
    "headline": "How ongoing reforms in agric sector is boosting oil palm cultivation in Edo – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his administration’s reforms in the agriculture sector is boosting oil palm cultivation in the state, noting that Edo State with the cultivation of 120,000 hectares, has the largest oil palm plantation under cultivation in Nigeria.\nHe commended POFON for collaborating with the state government, adding, “We have the largest oil palm plantation under cultivation.\nWe put under cultivation up to 250,000 hectares of land for oil palm.\n“Working with you, we developed the Edo State Oil Palm Programme where we realise that community engagement is very important for the success of the program.\nOn his part, the Managing Director of PRESCO, Felix O. Nwabuko commended the governor for his foresight, as the oil palm sector has witnessed significant growth under his administration."
  },
  {
    "headline": "Obaseki woos investors, assures security, steady power supply, other incentives – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has assured of durable infrastructure, security and other incentives to ensure the influx of investors into the state.\nObaseki gave the assurance during the EdoJobs Results Show at the Victor Uwaifo Creative Hub in Benin City.\n“Edo State Government will continue to create opportunities for Edo youths to express themselves.\nNo city is well situated like Benin City across the continent.\nSpeaking at the event, a film director, Stanley Ohikhuare, noted that convinced that the future of the entertainment industry is in Benin City."
  },
  {
    "headline": "Another Pregnant Woman Nabs With 1,441kg skunk in Lagos – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – Another pregnant woman, Eze Joy Chioma, has been arrested with 1,442 kilograms of imported skunk during a raid by operatives of the National Drug Law Enforcement Agency in Lagos.\nThe 27-year-old was arrested on Friday, December 17, 2021, when operatives raided her store and home in the Ojo area of Lagos.\nIt would be recalled that a pregnant woman was apprehended recently while trying to trafficate bundles of well package hard drugs through airport to abroad.\nAnother suspect, Michael Oroke, was also nabbed with 29kg of the illicit drug in the same location.\n“A follow-up operation led to Udechukwus arrest and different quantities of Heroin, Cocaine, Methamphetamine, Cannabis Sativa, Tramadol, Exol-5, Swinol, and Diazepam recovered from him."
  },
  {
    "headline": "APC had no candidate in Anambra election – Court rules",
    "summarized_story": "A Federal High Court sitting in Abuja, on Monday, nullified the participation of the All Progressives Congress (APC) and its candidate, Andy Uba, in the November 6 2021 Anambra governorship election.\nChief George Moghalu, an aspirant in the APC primary election had challenged the process and the outcome of the primary election that produced Uba as the party’s candidate, NAN reported.\n“The 2nd defendant (INEC) is compelled to delist the name of the 1st defendant and 3rd defendant from the Nov. 6, Anambra governorship election,” he ordered.\n“The real issue was not whether accredited members of 1st defendant voted on that day but whether the election was conducted in accordance with the election guidelines of 1st defendant,” he held.\nINEC had picked Uba, winner of the APC primary election, as the party’s candidate."
  },
  {
    "headline": "MAX, vehicle subscription platform, raises $31m in series B funding",
    "summarized_story": "Metro Africa Xpress, MAX, has announced the first closing of its Series B investment, raising $31 million.\nAdetayo Bamiduro, CEO of MAX, said, “We are delighted to announce this funding round.\nThis new investment from highly respected global investors such as Lightrock and Global Ventures, plus continued support from our existing investors, further validates our business model and strategy.\nIt is another milestone in our journey to make mobility safe, affordable, accessible, and sustainable by deploying high-performance technologies and operators.\nWe are excited to not only double down in this round but also to welcome new investors Global Ventures, Lightrock, and others to the journey."
  },
  {
    "headline": "Buhari reacts as terrorists kill 38 people in Kaduna",
    "summarized_story": "Senior Special Assistant to the President on Media and Publicity, Garba Shehu, disclosed this in a statement titled ‘President Buhari condemns gruesome terrorist killings in Kaduna State’.\nShehu said bandits within the week have also killed citizens in Zangon Kataf, Chikun, Birnin Gwari, Igabi and Kauru LGAs of Kaduna State.\nBuhari also expressed the nation’s condolences to the Government of Kaduna State, the people of Zonkwa Chiefdom and the family of His Highness Nuhu Bature, the Agwam Kajju on his demise.\nBandits over the weekend, in an attack in Giwa communities of Kaduna State, killed 38 people.\nAlh Bashari Sabiu5 Alh Lawal Dahiru6."
  },
  {
    "headline": "Omicron fallout: Nigeria’s diplomatic bluff pays dividends",
    "summarized_story": "The UK Health Secretary Sajid Javid, who had announced the travel ban, said the Omicron had spread so widely that the rules are now less effective.\nAir Peace initially operated at Sharjah Airport, shifted to Dubai Airport and then returned to Sharjah airport.\nThey were later told that Air Peace would only be accepted if only it brought a small aircraft.\n“Then, at your threat of going to stop them if Air Peace was not allowed a meagre three flights weekly, THEY QUICKLY DID THE UNTHINKABLE.\n“Air Peace stood for its Citizens during Covid-19 and now Federal Government and its Citizens stood by them,” noted Mohammed Jammal, @whitenigerian."
  },
  {
    "headline": "Army Recruits: Be Ready To Serve Anywhere – COAS",
    "summarized_story": "The Chief of Army Staff (COAS), Lieutenant-General Faruk Yahaya charged recruit intakes at the passing out parade of the 81 Regular of Nigerian Army, Chindit Barracks Cantonment, Zaria; charging them to obey all legitimate orders issued by their superior officers, no matter how unpleasant.\nHe reminded them that Nigeria is currently facing numerous security challenges, amongst them Boko Haram terrorists, armed bandits, kidnappers, secessionist agitators and other criminal elements.\n“These challenges can only be surmounted by collective resolves and efforts of every officer and soldiers of the Nigerian Army, including those of you passing out today.\n“I, therefore, urge you all to apply the mental, physical and moral training acquired over the past few months, at your respective units, formations and corps,” he said.\nWhile tasking them to upload the Nigerian Army core values, the COAS also directed them to maintain professionalism and high standard, as well as be good ambassadors of the Nigerian Army."
  },
  {
    "headline": "Fatal Auto Crash Claims 8 Lives In Bauchi",
    "summarized_story": "Yusuf Abdullahi, Sector Commander, Federal Road Safety Corps (FRSC) in Bauchi, says no fewer than eight persons lost their lives in a road accident that occurred in Bauchi on Saturday.\nAccording to him, the accident which involved an Opel Vectra car with plate number AA 954 GYD and one Tipper Mercedes Benz with number plate NIN 279 SA, happened in Goltukurwa village along Dass-Bauchi road at 9:30 pm.\nHe explained that nine people were involved in the crash, comprising two males, six females and a male child.\nAbdullahi, however, revealed that all the eight passengers in the Opel Vectra car which ran into the tipper, lost their lives while only the driver of the tipper, whose name was simply identified as Abubakar Mohammed was unscathed.\n“They should also remember that only the living souls, not the dead, would live to celebrate the Christmas and new year festivities,” he stated."
  },
  {
    "headline": "Nembe Spill: Ijaw Diaspora Council Seeks Ministry’s Intervention",
    "summarized_story": "The Ijàw Diaspora Congress (IDC) is seeking the intervention of the Federal Ministry of Humanitarian Affairs and Disaster Management in the recent oil spill at Oil Mining Lease (OML) 29 at Nembe, Bayelsa.\nThe diaspora group with headquarters in Newark, New Jersy, US, requested the intervention in a letter dated Dec. 17 and made available on Saturday to reporters.\nThe group said while the Bayelsa government and the community attributed the spill to equipment failure, it was awaiting the official position of the National Oil Spill Detection and Response Agency (NOSDRA).\nIDC also urged the Federal Government to declare the spillage a humanitarian disaster in Ijawland and act accordingly.\n“The lethargic response pace forced the victims into an immediate humanitarian crisis of epic proportions."
  },
  {
    "headline": "Nembe Spill: Ijaw Diaspora Council Seeks Ministry’s Intervention",
    "summarized_story": "The Ijàw Diaspora Congress (IDC) is seeking the intervention of the Federal Ministry of Humanitarian Affairs and Disaster Management in the recent oil spill at Oil Mining Lease (OML) 29 at Nembe, Bayelsa.\nThe diaspora group with headquarters in Newark, New Jersy, US, requested the intervention in a letter dated Dec. 17 and made available on Saturday to reporters.\nThe group said while the Bayelsa government and the community attributed the spill to equipment failure, it was awaiting the official position of the National Oil Spill Detection and Response Agency (NOSDRA).\nIDC also urged the Federal Government to declare the spillage a humanitarian disaster in Ijawland and act accordingly.\n“The lethargic response pace forced the victims into an immediate humanitarian crisis of epic proportions."
  },
  {
    "headline": "It Is President Buhari’s Prerogative To Sign Electoral Bill — Malami",
    "summarized_story": "Abubakar Malami, Minister of Justice and Attorney-General of the Federation (AGF), has said it is the prerogative of President Muhammadu Buhari to either accent to the Electoral Act Amendment Bill or not, as the constitutional timeline expires on Sunday, December 19.\nAGF who spoke on the imbroglio that has trailed the bill since it was transmitted to the President by the National Assembly three weeks ago, said his office had officially written its legal opinion to President Buhari on the Bill and the onus was on the President to either sign the Bill into law or not.\nHe made this known on Saturday through his Special Adviser on Media and Public Relations, Dr Umar Jibrilu Gwandu, Malami said though it was premature of him to comment on a process involving official communication between the office of the President and the office of the Attorney General of Federation and Minister of Justice without allowing the conclusion of the adminsitration cycle, the general public would be adequately and timely informed by the Office of the President on the decision.\nPresident Buhari has till Sunday to either assent to the Bill or not, and in the event he refuses, the National Assembly may decide to exercise its veto power to transmute the Bill into law.\nBut the general feeling in the country is that the National Assembly may not want to exercise its veto power over the contentious Bill so as not to jeopardize its relationship with the Executive."
  },
  {
    "headline": "Over 20 killed, scores abducted by suspected terrorists in Borno LG",
    "summarized_story": "At least over 20 people were killed with several others sustaining gunshot injuries when suspected members of Boko Haram terrorists invaded Kilangar village in Askira Uba Local Government Area of Borno state on Sunday, sources have said.\nThe insurgents on Sunday afternoon also completely razed down the residence of the District Head of Kilangar, Alhaji Abdullahi Adamu Kilangar.\n“We are currently under pandemonium as armed insurgents stormed our community, shooting sporadically at targets with setting ablaze residential houses, vehicles, shops and looting.\n“Although I cannot tell you number of casualties, but over dozens were killed with destruction of properties with no confrontation from the security forces.” A community Sources who luckily escaped told Vanguard.\n“Likewise, the insurgents have abducted unspecified number of residents, and carted away with two vehicles, after looting foodstuff and livestock in the community”."
  },
  {
    "headline": "Over 20 killed, scores abducted by suspected terrorists in Borno LG",
    "summarized_story": "At least over 20 people were killed with several others sustaining gunshot injuries when suspected members of Boko Haram terrorists invaded Kilangar village in Askira Uba Local Government Area of Borno state on Sunday, sources have said.\nThe insurgents on Sunday afternoon also completely razed down the residence of the District Head of Kilangar, Alhaji Abdullahi Adamu Kilangar.\n“We are currently under pandemonium as armed insurgents stormed our community, shooting sporadically at targets with setting ablaze residential houses, vehicles, shops and looting.\n“Although I cannot tell you number of casualties, but over dozens were killed with destruction of properties with no confrontation from the security forces.” A community Sources who luckily escaped told Vanguard.\n“Likewise, the insurgents have abducted unspecified number of residents, and carted away with two vehicles, after looting foodstuff and livestock in the community”."
  },
  {
    "headline": "Kukah: I won’t stop speaking against injustice, bad governance",
    "summarized_story": "The Catholic Bishop of Sokoto Diocese, Matthew Hassan Kukah, yesterday said he would not stop speaking against bad governance in the country until Nigeria changes for the better.\nKukah, who stated this in his homily celebrating 45 years of priesthood and 10 years as Bishop in Sokoto, said keeping quiet in the face of injustice and bad governance was nothing but corruption.\nIn keeping to this vow, Bishop Kukah said some might construe constant criticism of governments as causing trouble.\nIt is not by accident that we are here today; we must fix this country together.\n“Religion is not going to fix Nigeria; politics will not fix our country as those in power in Nigeria are not any different from the colonial masters."
  },
  {
    "headline": "Kukah: I won’t stop speaking against injustice, bad governance",
    "summarized_story": "The Catholic Bishop of Sokoto Diocese, Matthew Hassan Kukah, yesterday said he would not stop speaking against bad governance in the country until Nigeria changes for the better.\nKukah, who stated this in his homily celebrating 45 years of priesthood and 10 years as Bishop in Sokoto, said keeping quiet in the face of injustice and bad governance was nothing but corruption.\nIn keeping to this vow, Bishop Kukah said some might construe constant criticism of governments as causing trouble.\nIt is not by accident that we are here today; we must fix this country together.\n“Religion is not going to fix Nigeria; politics will not fix our country as those in power in Nigeria are not any different from the colonial masters."
  },
  {
    "headline": "Breaking: Soludo wins again as challenger Andy Uba disqualified",
    "summarized_story": "Chief George Moghalu, an aspirant in the APC primary election had challenged the process and the outcome of the primary election that produced Uba as the party’s candidate.\nHe held that the plaintiff had successfully demonstrated that the primary election was not conducted in accordance with the law and the party’s guidelines.\n“The 2nd defendant (INEC) is compelled to delist the name of the 1st defendant and 3rd defendant from the Nov. 6, Anambra governorship election,” he ordered.\nAccording to the judge, any election conducted contrary to the 1st defendant guideline is in nullity.\nINEC had picked Uba, winner of the APC primary election, as the party’s candidate."
  },
  {
    "headline": "Fulani herdsmen balloon number of orphans in Benue - Ortom",
    "summarized_story": "Governor Samuel Ortom of Benue has blamed Fulani herdsmen for the explosion in the number of orphans and Internally Displaced Persons (IDPs) in the state.\nOrtom said orphanage homes across Benue State and IDP camps were filled with orphans without hope for the future.\n“Some became orphans because terrorist Fulani herdsmen have killed their parents.\nSome bear their parents’ names and some, who do not know their parents, bear my name.\n“There are many orphans in IDP camps and many of them don’t even know their parents, because Fulani herdsmen came and killed them."
  },
  {
    "headline": "BREAKING: EFCC Loses As Supreme Court Upturns Conviction Of Senior Advocate",
    "summarized_story": "Joseph Nwobike, a Senior Advocate of Nigeria, had his conviction overturned by the Supreme Court.\nNwobike was subsequently stripped of his SAN title.\nDissatisfied with his conviction, he appealed the matter but the Court of Appeal upheld the conviction.\nHowever, a five-member panel of the Supreme Court led by Justice Olukayode Ariwoola on Monday quashed the conviction.\nThe court ruled that the EFCC lacked the power to prosecute anyone for the offence of perversion of justice."
  },
  {
    "headline": "Former Cheif Of Army Staff, Buratai Identifies Major Causes Of Insecurity In Nigeria",
    "summarized_story": "Lt. Gen. Tukur Buratai (rtd), the former Chief of Army Staff, has identified a weak judicial system, ignorance, and poor leadership, among other reasons, as leading to insecurity and other societal ills in Nigeria.\nAccording to NAN, Buratai, who is Nigeria’s Ambassador to the Republic of Benin, said this during the Tukur Buratai Research Centre (TBRC) groundbreaking and fundraiser in Gora, Nasarawa State.\nHe said inadequate research and development implementation in Nigeria create a massive void in the country’s progress.\nBuratai said, “When properly focused research and training institutes are established, innovation and development become a natural progressive activity that benefits the nation’s life.\n“Corruption, insecurity due to terrorism and banditry, inadequate infrastructure, issues in governance and an inept educational system are all systemic flaws."
  },
  {
    "headline": "Schools Closed In Niger State Over Planned Attack By Bandits",
    "summarized_story": "All public and private primary, secondary, and tertiary schools in Niger State’s Wushishi Local Government Area have been closed due to a planned bandit raid.\nHe said, “The decision to close the schools was as a result of banditry activities in the local government.\n“And the communication they intercepted particularly pointed to Zungeru as the area of the planned attack.\nWe know the inconveniences considering the importance of education, especially now that schools were about to write their promotion examinations.\nHe said, “One of the incidents was the abduction of the Permanent Secretary, Niger State Ministry of Transport.”He added that schools would be reopened if the security situation in the area improves."
  },
  {
    "headline": "Detained Female Soldier, Sofiat Will Be Punished For Having Amorous Affair With Corps Member — Nigerian Army",
    "summarized_story": "Private Hannah Sofiat A had been identified by SaharaReporters as the female soldier.\nAfter video clips of her being proposed to by a male corps member at the National Youth Service Corps orientation camp in Yikpata, Kwara State, went viral on social media, she was detained.\nThe corps member then proceeded to place the ring on Sofiat’s very delighted finger, to the delight of others present.\nIn another scene, the corps member was seen standing immediately behind Sofiat, wearing Sofiat’s military cap.\n“The Nigerian military must release Sofiat asap and apologise to her for illegal detention."
  },
  {
    "headline": "VIDEO: Patoranking survives ghastly motor accident",
    "summarized_story": "The popular Nigerian singer, Patrick Nnaemeka Okorie, who is better known as Patoranking has escaped death.\nThe Ebonyi state born musician survived a ghastly motor accident on Saturday.\nSharing videos of the damaged car, Patoranking said he was seated in front when the accident happened.\n”The devil tried and failed some days ago,after Our driver lost control of the brakes.\n“Life can be taken in a heartbeat…two seconds and this happened and to think I was in the front seat and my Guys behind."
  },
  {
    "headline": "Hushpuppi: At last, PSC receives IGP’s recommendation, to decide Kyari’s fate this week",
    "summarized_story": "Indication has emerged that the Police Service Commission (PSC), would decide the fate of former Commandant, Nigeria Police Intelligence Response Team (IRT), DCP Abba Kyari, this week.\nKyari was suspended in August following the recommendation of the Inspector General of Police, IGP Usman Baba, to the Police Service Commission (PSC) to enable an independent.ptobe into allegations against him.\nHe has been under investigation over his alleged role in a $1.1 million internet scam by an Instagram Influencer, Abbas Ramon, a.k.a.\nThe probe followed Kyari’s indictment by the United States Federal Bureau of Investigations (FBI), which recommended that he be extradited to the US for trial.\nA source at the commission, who confirmed the development, also disclosed that the commission would deliberate on the issue this week and decide the fate of the the former IRT boss."
  },
  {
    "headline": "Miss Nigeria 2021: How 18-year-old hijab-wearing model emerged winner",
    "summarized_story": "History was made on Friday night when Shatu Garko became the first-ever hijab-wearing model to win the Miss Nigeria pageant.\nThe 18-year-old horse rider beat 18 other contestants to emerge as the 44th Miss Nigeria.\nMiss Nigeria 2021 represented the North-west zone at the competition.\nShe also promised to uphold the ideals of the Miss Nigeria pageant.\nMiss Nigeria’s Creative Director, former Miss Nigeria (2013), Ezinne Akudo, also revealed that this year’s selection was quite demanding, due to the sheer volume of entries."
  },
  {
    "headline": "JUST IN: Court Voids Andy Uba’s Participation In Anambra Guber Election",
    "summarized_story": "Justice Inyang Ekwo of the Federal High Court in Abuja has nullified Senator Andy Uba’s participation in the Governorship Election held in Anambra State on November 6 this year.\nIn a judgment on Monday, the Judge held that Uba was never a candidate in the election having emerged from an illegally conducted primary election by the All Progressives Congress (APC).\nREAD ALSO: Supreme Court Sets Aside Conviction Of Senior Lawyer, Joseph NwobikeJustice Ekwo added that the plaintiff, George Moghalu succeeded in proving that the APC did not conduct a valid primary election from which Uba claimed to have emerged as the party’s candidate.\nThe judge further ordered the Independent National Electoral Commission (INEC) to delete Uba from its record as a candidate in the election and ordered the APC to refund to Moghalu, the sum of N22.5 million, which is the amount he paid for expression of interest and nomination forms since the party failed to conduct a valid primary.\nMore to follow…"
  },
  {
    "headline": "Buhari Has No Excuse For Not Signing Electoral Act Amendment Bill, Says Wike",
    "summarized_story": "Rivers State Governor, Nyesom Wike, has said that President Muhammadu Buhari does not have any excuse for not signing the Electoral Act Amendment Bill.\nWike said this on Sunday during an interview on Channels Television’s Programme, Sunday Politics.\n﻿“The ruling party in their conspiracy is trying to deceive Nigerians that the mere inclusion of the direct primaries in the electoral act amendment bill is the problem why the President does not want to sign or why he has refused to sign.\n“The major issue is the transmission, the electronic transmission of results,” Wike asserted.\n“The issue is this, Mr President signed the Petroleum Industry Bill and sent it back for an amendment of the bill."
  },
  {
    "headline": "Buhari Condemns Gruesome Killings In Kaduna",
    "summarized_story": "President Muhammadu Buhari has condemned the renewed killings by gunmen in Kaduna State.\nRead Also: Death Toll In Kaduna Gunmen Attack Rises To 38Bandits within the week had also killed residents in Zangon Kataf, Chikun, Birnin Gwari, Igabi and Kauru local governments of the state.\nHe also extended his condolences to the Government of Kaduna State and the people in the affected local governments.\nSpeaking further, President Buhari affirmed that the security forces have turned the heat on the terrorists who are getting frustrated and are soft-targeting innocent citizens, looting their assets, burning their homes and killing them indiscriminately.\nHe also reiterated his directive to the security and intelligence chiefs to do everything they can to destroy the remaining vestiges of the terrorists."
  },
  {
    "headline": "Death Toll In Kaduna Gunmen Attack Rises To 38",
    "summarized_story": "The death toll from three separate attacks in villages in Giwa Local Government Area of Kaduna State has risen to 38.\nThe State Commissioner for Internal Security and Home Affairs, Samuel Aruwan, disclosed this on Sunday evening.\nThe three villages involved in the attack are Kauran Fawa, Marke and Riheya.\nAruwan, however, stated that security operatives have been deployed to sustain patrols in the general area.\nGovernor Nasir El-Rufai on his part has expressed sadness over the attack and has directed the Kaduna State Emergency Management Agency to conduct an urgent assessment of the area towards providing relief to the victims."
  },
  {
    "headline": "Pope Francis Appoints Nigerian Archbishop As Vatican’s Permanent Observer At The UN",
    "summarized_story": "Pope Francis has appointed Nigerian prelate and the Apostolic Nuncio to the Antilles, Archbishop Fortunatus Nwachukwu, as the new Permanent Observer of the Holy See to the United Nations Office and Specialized Institutions in Geneva.\nArchbishop Nwachukwu was also appointed the Permanent Observer to the World Trade Organization (WTO) and the Representative of the Holy See to the International Organization for Migration (IOM).\nThe 61-year-old Nwachukwu replaces Bishop Ivan Jurkovic, previously appointed nuncio in Canada.\nThe appointment was contained in a press release from the Office of the Secretariat of the Episcopal Conference of the Antilles dated Friday, December 17, 2021, where Archbishop Nwachukwu is currently serving as Nuncio.\nThe statement from the Episcopal Conference of the Antilles continued, “He sincerely appreciates your support during his mission in this region and requests that you accompany him with your prayers and friendship as he prepares to assume the new responsibilities.”Archbishop Nwachukwu has previously been assigned as Apostolic Nuncio to Saint Lucia, Grenada, and the Bahamas on 27 February 2018; and Apostolic Nuncio to Suriname on 9 March 2018; and Apostolic Nuncio to Belize on 8 September 2018."
  },
  {
    "headline": "PDP calls out APC on alleged connection with killings, demands Buhari visits troubled areas",
    "summarized_story": "The All Progressives Congress (APC), has been fiercely criticised by the Peoples Democratic Party (PDP) for its unforgivable indifference to terrorist assaults in Sokoto, Niger, Katsina, Kaduna, Plateau, and other parts of the country.\n“Is it also not provocative, vexatious and indeed the height of heartlessness that APC and its leaders party while Nigeria burns?\n“The PDP, standing in solidarity with Nigerians, calls out the APC to come clean on its alleged connection to killings, the benefit it derives from violence and bloodletting and why it attaches no value to human lives.\nThe APC has also not explained the continued presence of a self-confessed terrorism apologist in its government.\n“Unfortunately, the APC as a party of selfish and blood thirsty “political bandits” does not have the commitment, readiness or capacity to do so."
  },
  {
    "headline": "Group vows to go to court to ensure Asiwaju Tinubu contest in 2023 -",
    "summarized_story": "A group, known as the Disciples of Jagaban (DOJ), has vowed to drag the National Leader of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu to court if he declined contesting for Presidency in the next general elections.\nThe leader of the group, Abdulhakeem Alawuje, noted that the main reason is because the suffering in the country has gotten out of control and the National Leader of the APC, has the capacity and strategy to change the situation.\nHe further explained that the giant strides Bola Ahmed Tinubu made as governor of Lagos State is enough proof that he can stabilize the nation if he becomes president in 2023.\nThe group went on to flagg off a continuous voter registration campaign in Kaduna state to sensitize youths and the general public on the need to get registered to vote.\nThey hope the campaign will also help raise the quality of participation in Politics in Nigeria"
  },
  {
    "headline": "PGF Secretariat greets PGF DG, Salihu Lukman at 59",
    "summarized_story": "The Progressive Governors Forum (PGF) Secretariat has congratulated the Director General of the Progressives Governor Forum, Salihu Lukman, on his 59th birthday.\nThe statement reads partly thus: “We appreciate your leadership style and personal commitment to the ideals of progressivism.\nAs the Director General of PGF Secretariat, we celebrate your doggedness and uncommon contributions to the development of policies across the APC controlled States and Nigeria as a whole.\n“Here in the secretariat, you always put your time and energy to make staff members be at their best.\n“Once again, congratulations and Happy Birthday, Comrade Salihu Lukman,” the statement said."
  },
  {
    "headline": "Buhari postpones official visit to Ogun",
    "summarized_story": "Ogun State Government has announced the postponement of the official visit of President Muhammadu Buhari to the State initially scheduled for Tuesday, 21st December 2021.\nIn a statement issued on Friday in Abeokuta by Tokunbo Talabi, Secretary to Ogun State Government, the government said a new date for the visit and commissioning of some of the landmark projects of Prince Dapo Abiodun Administration will be announced in due course.\nThe Government regrets any inconvenience the postponement might cause the invited guests, the statement concluded."
  },
  {
    "headline": "Buhari Returns to Abuja After Three-Day Official Visit to Turkey",
    "summarized_story": "Nigeria President Muhammadu Buhari on Sunday returned to Abuja after a three-day official visit to Turkey.\nThe president who arrived the presidential wing of the Nnamdi Azikwe International airport in the Nigerian Air Force 1 Presidential jet at about 4.35pm was immediately ferried in a chopper to the State House, Abuja.\nOn hand to welcome President Buhari to the State House were his Chief of Staff, Prof Ibrahim Gambari; Secretary to the Government of the Federation, Boss Mustapha; Permanent Secretary, State House, Tijjani Idris Umar; his Administrative Officer, Abubakar Maikano and his son, Yusuf Buhari, who was turbanned Talban Daura on Saturday.\nGambari, thereafter presented a big card to the President to commemorate his 79th birthday anniversary marked in Instanbul, Turkey last Friday.\nPresident Buhari last Thursday left Abuja accompanied by his wife, Aisha, six Ministers as well as two other top government officials to attend the Turkey-Africa Partnership Summit in Istanbul which was hosted by President Recep Tayyip Erdogan of the Republic of Turkey."
  },
  {
    "headline": "Imperial College London: Omicron Largely Evades Immunity from Past Infection, Two Vaccine Doses",
    "summarized_story": "The Omicron coronavirus variant largely evades immunity from past infection or two vaccine doses, according to the latest Imperial modelling.\n“Our booster vaccine regiments work against omicron,” US-based ABC News quoted him to have said.\nThe Imperial College report implied that the protection against reinfection by Omicron afforded by past infection may be as low as 19 per cent.\nThe reinfection risk estimated in the current study suggests this protection has fallen to 19% (95%CI: 0-27%) against an Omicron infection,” it added.\nSince the emergence of the new coronavirus (COVID-19) in December 2019, the Imperial College COVID-19 Response Team adopted a policy of immediately sharing research findings on the developing pandemic."
  },
  {
    "headline": "Rampaging Terrorists Kill 38 in Northwest Nigeria’s Kaduna State",
    "summarized_story": "Also, the Commissioner for Internal Security and Home Affairs in Kaduna State, Samuel Aruwan, who disclosed the latest killings in a statement, confirmed that no fewer than 38 people were killed in Giwa Local Government Area of the state.\nBuhari, while condemning the renewed killings in Kaduna State, said the gruesome nature of recent incidents in Kauran Fawa, Marke and Ruhiya of Idasu Ward of Giwa Local Government Area, has made him particularly sad and the killings unacceptable.\nIn a release by the president’s spokesman, Garba Shehu, Buhari expressed the nation’s condolences to the Government of Kaduna State, the people of Zonkwa Chiefdom and the family of His Highness Nuhu Bature, the Agwam Kajju on his demise.\n“The governor also commiserated with the affected communities and directed the Kaduna State Emergency Management Agency to conduct an urgent assessment of the area towards providing relief,” he said.\nThe police, in the course of investigations, identified and raided various criminal hideouts,where kidnap victims were usually kept."
  },
  {
    "headline": "‘We Did It!’ Chile’s Boric Seals Leftist Revival with Election Win",
    "summarized_story": "Chilean leftist Gabriel Boric won the country’s presidential runoff election on Sunday, capping a major revival for the country’s progressive left that has been on the rise since widespread protests roiled the Andean country two years ago.\n“From today he is the elected President of Chile and he deserves all our respect and constructive collaboration.\nChile is always first.”The protests in 2019 shone a spotlight on economic inequality and triggered an official redraft of the constitution.\n“I am going to be the president of all Chileans,” Boric said in a call with center-right President Sebastian Pinera, who will step down in March.\nInternational investors will be very attentive to this.”Boric supporters say he will overhaul the country’s economic model that dates back to Pinochet."
  },
  {
    "headline": "Philippine Death Toll from Typhoon Rai Climbs Above 200",
    "summarized_story": "The death toll in the Philippines caused by Typhoon Rai has risen to 208, after the storm carved a trail of destruction in central and southern provinceslate last week, the national police spokesperson said on Monday.\nThe police have been mobilised for relief operations and to ensure order in calamity stricken areas, national police spokesperson Roderick Alba said.\nThe number of casualties cited by police was far higher than the 58 deaths recorded by the national disaster agency up to now.\nMore than half of the deaths reported by police were fatalities in the central Visayas region, which includes Bohol province, home to some of the country’s most-popular tourist destinations, including dive spots.\nRelief operations have been accelerating but remain hampered by damage caused to communication and power lines, which have yet to be restored in many devastated areas."
  }
]