[
  {
    "headline": "Low carbohydrate diet can help achieve diabetes remission –Study",
    "summarized_story": "Amarachi OkehA new study has indicated that diets low in carbohydrates could help ensure diabetes remission without side effects.\nThe study published in Bio medical – a peer-reviewed medical journal was carried out on 23 randomised patients who adhered to a low or very low carbohydrate diet.\nThe findings of the study indicated that the low carbohydrate diet might have helped them to achieve diabetes remission without adverse consequences.\nThe researchers, however, noted that what could be termed as low or very low carbohydrate diet is still a debate thus requiring further investigation.\nThe former director added that a controlled quantity of carbohydrate intake also needs to be balanced by a healthy lifestyle."
  },
  {
    "headline": "Low carbohydrate diet can help achieve diabetes remission –Study",
    "summarized_story": "Amarachi OkehA new study has indicated that diets low in carbohydrates could help ensure diabetes remission without side effects.\nThe study published in Bio medical – a peer-reviewed medical journal was carried out on 23 randomised patients who adhered to a low or very low carbohydrate diet.\nThe findings of the study indicated that the low carbohydrate diet might have helped them to achieve diabetes remission without adverse consequences.\nThe researchers, however, noted that what could be termed as low or very low carbohydrate diet is still a debate thus requiring further investigation.\nThe former director added that a controlled quantity of carbohydrate intake also needs to be balanced by a healthy lifestyle."
  },
  {
    "headline": "FG approves N5.6bn for construction of oxygen plants in 36 states, FCT",
    "summarized_story": "Stephen AgwaiborThe Federal Executive Council presided over by the President, Major General Muhammadu Buhari (retd.)\nhas approved the disbursement of N5.6bn for the construction of oxygen production plants in all 36 states of the federation and the Federal Capital Territory.\nThe government also approved the disbursement of N9.2bn as premium for insurance companies that will manage group life insurance coverage for federal civil servants.\nThis, he said, would ramp up the nation’s oxygen reserves to enable it to mitigate a third wave of the coronavirus pandemic.\nThe approval came days after the Presidential Steering Committee made the initial announcements about the initiative on Monday."
  },
  {
    "headline": "FG approves N5.6bn for construction of oxygen plants in 36 states, FCT",
    "summarized_story": "Stephen AgwaiborThe Federal Executive Council presided over by the President, Major General Muhammadu Buhari (retd.)\nhas approved the disbursement of N5.6bn for the construction of oxygen production plants in all 36 states of the federation and the Federal Capital Territory.\nThe government also approved the disbursement of N9.2bn as premium for insurance companies that will manage group life insurance coverage for federal civil servants.\nThis, he said, would ramp up the nation’s oxygen reserves to enable it to mitigate a third wave of the coronavirus pandemic.\nThe approval came days after the Presidential Steering Committee made the initial announcements about the initiative on Monday."
  },
  {
    "headline": "TEACH THAT CHILD WAYS TO PREVENT SEXUAL ABUSE",
    "summarized_story": "No one particular race, culture, religion or socio-economic group is spared when it has to do with child sexual abuse.\nTalk about body parts early, name body parts as it’s never too soon to talk about them while they are still very young.\nLet them know that some body parts are private – Tell him/her that their private parts are called private because they are not for everyone to see.\nTeach your child body boundaries – That under no circumstance should any one touch their private parts, and also no one should ask them to touch somebody else’s private parts.\nThis second part is very important because sexual abuse often begins with the molester asking the child to touch them or someone else."
  },
  {
    "headline": "TEACH THAT CHILD WAYS TO PREVENT SEXUAL ABUSE",
    "summarized_story": "No one particular race, culture, religion or socio-economic group is spared when it has to do with child sexual abuse.\nTalk about body parts early, name body parts as it’s never too soon to talk about them while they are still very young.\nLet them know that some body parts are private – Tell him/her that their private parts are called private because they are not for everyone to see.\nTeach your child body boundaries – That under no circumstance should any one touch their private parts, and also no one should ask them to touch somebody else’s private parts.\nThis second part is very important because sexual abuse often begins with the molester asking the child to touch them or someone else."
  },
  {
    "headline": "Taiwo Akinlami: Catalyst For Good Parenting",
    "summarized_story": "Is there really anything for the Nigerian child to celebrate?\nWe cannot discuss the state of the Nigerian child without first discussing the state of Nigeria, which is the national landlord of the Nigerian child.\nIt is important to note that the state of the Nigerian Child is not worsened by the COVID -19 Pandemic.\nWhen the existence of a people is abused, they have nothing to offer but to abuse their precious children or expose them to abuse.\nIt is nothing but distributing child pornography and expanding the frontiers of child sexual abuse."
  },
  {
    "headline": "Taiwo Akinlami: Catalyst For Good Parenting",
    "summarized_story": "Is there really anything for the Nigerian child to celebrate?\nWe cannot discuss the state of the Nigerian child without first discussing the state of Nigeria, which is the national landlord of the Nigerian child.\nIt is important to note that the state of the Nigerian Child is not worsened by the COVID -19 Pandemic.\nWhen the existence of a people is abused, they have nothing to offer but to abuse their precious children or expose them to abuse.\nIt is nothing but distributing child pornography and expanding the frontiers of child sexual abuse."
  },
  {
    "headline": "Babatunde Rufai: Art Of Selling Luxury",
    "summarized_story": "Babatunde Rufai is the Chief Executive Officer (CEO) of Wear It All Luxury; a men’s luxury boutique.\nWhat is the significance of your education in Italy to your fashion business?\nThis is really important in the fashion business as this has helped me apply what I learnt in building my brand.\nWhat particularly motivated you to decide to go into the fashion business?\nHe’s a great man who has dedicated his whole life to the fashion business and is excelling in it."
  },
  {
    "headline": "IPOB urges Twitter to ban Buhari’s account",
    "summarized_story": "The Indigenous People of Biafra (IPOB) has called on microblogging platform, Twitter, to delete President Muhammadu Buhari’s account completely.\nThis follows the deletion of Buhari’s tweet by Twitter on Wednesday.\nHowever, Twitter took down his tweets, explaining that it violated Twitter rules.\n“The Indigenous People of Biafra (IPOB) has noted the action of Twitter in deleting the inciting statement by President Muhammadu Buhari, threatening another war against Biafrans,” part of the statement read.\nNigerians react as Twitter deletes Buhari’s “threat” tweet against South East"
  },
  {
    "headline": "You can’t declare Nigeria failed state over insecurity – FG replies CFA",
    "summarized_story": "The Federal Government on Thursday said it is wrong for anyone to declare Nigeria a failed state on the basis of its security challenges.\nIn an interview with the News Agency of Nigeria (NAN) on Thursday in Abuja, the minister stressed that “Nigeria is not and cannot be a failed state’’.\nThe declaration by CFA that Nigeria was a failed state and would eventually collapse was contained in a research finding recently released through Campbell and Rotberg.\n“Declaring any nation a failed state is not done at the whims and caprices of one or two persons, no matter their status.\nMohammed reiterated that Nigeria did not meet the criteria for a nation to become a failed state."
  },
  {
    "headline": "Grant Igbos Biafra to stop security crisis – Northern groups tell Buhari",
    "summarized_story": "The Coalition of Northern Groups (CNG) has called on President Muhammadu Buhari to hand the Southeast Biafra as a means of ending the current unrest in the region and other parts of the country.\nThe group made the remark in a statement by its spokesman, Abdul-Azeez Sulaiman, while reacting to the recent ‘civil war’ threat by President Buhari.\nFollowing the outrage by some Nigerians, who took to their social media handles to tackle the president over his ‘disturbing’ comment, Twitter on Wednesday deleted the controversial tweet.\nArewa groups lambast FG over comment on coupWhile most Nigerians were pleased with the deletion, the Minister of Information and Culture, Lai Mohammed slammed Twitter over the move, alleging that the management has double standards.\nReacting, CNG noted that the only option to restore peace in the nation is to ensure that the age-long agitation becomes reality."
  },
  {
    "headline": "Insecurity: You have no blood in your hearts",
    "summarized_story": "Matthew Kukah, Catholic Bishop of Sokoto Diocese, has said Nigerian leaders have no blood in their hearts for allowing the incessant killing of citizens in the country.\nJoseph Keke, on May 21, 2021, lampooned the President Muhammadu Buhari-led administration for failing to address the country’s security challenges.\nHe therefore urged Nigerian leaders to reverse the vow to: “I have sworn that I will not protect you from foreign invaders, kidnappers and being killed.\nForeign bandits or anyone can come at will, kill, loot, rape, kidnap and murder you.\nKillings: Those governing us have no blood in their hearts – Bishop Kukah"
  },
  {
    "headline": "No right-thinking Nigerian will support Igbo presidency in 2023 – Buhari’s ex-aide, Sumaila",
    "summarized_story": "Former Special Assistant to President Muhammadu Buhari on National Assembly Matters, Alhaji Abdurrahman Sulaiman Kawu Sumaila, has insisted that no right-thinking Nigerians will endanger their lives to support the candidature of any South-East politician vying for the presidency in 2023.\nHe also said that those responsible for the rising security challenges in the southeastern part of the country want to turn Nigeria into anarchy.\nSumaila stated this on Thursday in a statement he issued to newsmen in Kano.\nAlso, unknown gunmen have been terrorizing the southeastern states in recent weeks, killing security personnel and attacking government establishments.\nI am sure not a single right-thinking Nigerian will endanger his life to support the candidature of any South-East politician contesting for presidency come 2023 general elections,” Sumaila’s statement read in part."
  },
  {
    "headline": "Suspected cultists kill 33 year-old man in Enugu",
    "summarized_story": "By Damian Duruiheoma, EnuguSuspected cultists have killed a 33-year-old man identified as Emeka in Obosi Street, Ogui New Layout, Enugu metropolis in Enugu State.\nThe Nation gathered that Emeka, who resided in Chief Agbo Street within the layout, was traced from his street to Obosi Street, where he was killed.\nThe victim, who operated a laundry outfit in his house at Chief Agbo, was said to have gone to meet with a friend in Obosi Street when he was shot and killed Wednesday night.\nADVERTISEMENTThe neighbour, who preferred anonymity, said: “Some yet-to-be-identified gunmen attacked and killed a young man by name Emeka along Obosi Street in Ogui New Layout.\nSo, everybody in Chief Agbo Street and even Asata environs is scared, being very careful."
  },
  {
    "headline": "Naira Marley offers to sing new national anthem",
    "summarized_story": "By Ekaete BasseyStreet artist and Marlian Records boss, Naira Marley has volunteered to sing the new national anthem following the proposal to change Nigeria’s name to the United African Republic (UAR).\nAs expected, Nigerians took to social media to air their views about the proposal to change Nigeria to UAR, a name given by Flora Shaw.\nNaira Marley took to his Twitter account to offer his free service to the new nation.\nAccording to “Soapy” crooner, he is willing and available be take up the role of Pa Benedict Odise who composed Nigerian’s second anthem in 1978.\nHis tweet reads: “Omo Na me go sing the new national Anthem for UAR.”"
  },
  {
    "headline": "Osinbajo, Adefuye, Ipaye, others bag merit awards",
    "summarized_story": "This is scheduled to take place at Federal College of Education Hall, Akoka, Lagos.\nConferring the Award on the outstanding personalities, the Project Coordinator, Segun Adesanya explained that the Akoka Merit Awards 2021 was borne out of the need to honour and recognise outstanding personalities in Akoka community and other special dignitaries.\n“The awardees are men and women of excellence we admire greatly in the Akoka community.\nThey are wonderful pillars to be recognized, they belong to the greatness chart of the Akoka community,” he stated.\nSimilarly, the 5th edition of the Akoka Watch magazine will be officially launched by Osinbajo at the event."
  },
  {
    "headline": "Bank will no longer grant credit to borrowers who harm the environment – Bank",
    "summarized_story": "By Nduka Chiejina (Assistant Editor)In order to keep a green and sustainable environment, Nigerian banks will no longer lend money to individuals and corporate bodies whose activities harm the environment.\nCentral Bank of Nigeria (CBN) Governor Godwin Emefiele made this known in Abuja on Thursday during the commemoration of World Environment Day.\nEmefiele revealed that “in the banking industry we have made sure that lending practices must take into consideration, our environment to be sure that sustainable banking principles are taken into account when banks are lending money.”ADVERTISEMENTAlready “some of the international financial institutions and development finance institutions are beginning to say that as a bank, you want to borrow money from them, they will tell you that as long as they find anything that pollutes the environment, that does not make the environment clean and green, they will not condone that credit activity.”Nigerian banks he said “must join not only as bankers, we must join as Nigerians and members of the global community to ensure that our environment remains green.”After addressing the press, Emefiele led the Deputy Governors of the bank to plant trees on the premises.\nHe also praised his Special Adviser, Dr. Aisha Mahmood, for doing an excellent job handling the bank’s sustainable banking initiatives."
  },
  {
    "headline": "Christians have right to defend themselves against attack with equal force –Martins",
    "summarized_story": "By Philip NwosuCatholic Archbishop of Lagos, Alfred Adewale Martins, has said on Tuesday that Nigerians and particularly Christians being attacked and killed in the northern part of the country have right to defend themselves against incessant attacks on their communities by invaders, tagged: herders.\nMartins, who spoke during the celebration of its 62nd birthday anniversary, said one of the moral principles in life is that, “if a person is under attack, he has the right to defend himself with equal force that he is being attack.\nSo, in principle, every human being has the right to defend himself or herself.\n“Regrettably, those salient conventions have taken flight from our polity and thereby paved the way for mistrust, corruption and banditry.\n“From the North to the South, every part of the country is witnessing one form of brigandage or the other,” he said."
  },
  {
    "headline": "Igbo abroad insist on restructuring, fiscal federation",
    "summarized_story": "By Zika BobbyDiaspora Igbo group, the Igbo World Assembly (IWA), has said there was need to restructure Nigeria to ensure true federalism as it was in the 1963 Constitution based on regions.\nIt condemned Federal Government’s shoot-on-sight position, noting that such could be termed an act of ethnic cleaning.\nRestructuring of Nigeria, according to him, should be a means of tackling the worsening security situation and the agitation for secession.\n“We need a Nigerian political structure that is based on equity, fairplay, balance and equal access to political power for the good of all Nigerians.\nIWA states only restructuring can prevent Nigeria from disintegration.”Speaking on the Fulani herdsmen, he said Ndigbo will no longer tolerate the attack by herdsmen."
  },
  {
    "headline": "Tension as gunmen kill Ortom’s aide",
    "summarized_story": "Reacting to the incident, governor Ortom described the Dega’s murder as a huge blow to his administration and the entire state.\n“Retired AIG Dega served with me here and this is someone who has retired, but is not tired, and was very active.\nSo, for him to have been murdered in the manner they did, a retired AIG gunned down, is very sad,” Ortom stated.\nHe decried the increasing spate of insecurity that has bedevilled the North East, North West and North Central, South South, South East, South West, and called on security agencies to find the killers of his aide.\nMeanwhile, the Plateau state police command said it has arrested some suspected killers of Dega."
  },
  {
    "headline": "COVID-19: FEC approves N5.6bn for 37 oxygen plans across Nigeria",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Federal Executive Council (FEC) presided over by President Muhammadu Buhari has approved the establishment of oxygen production plant in each of the 36 states of the country.\nThe minister added that council also approved the sum of N1.\nEnvironment Minister, Mahammad Mahmud, said council approved the revised national policy on climate change.\n“We all know climate change is our topic of today, it has serious implications on economy, livelihoods.\nThis revised one has also put into consideration the national policy on gender and climate change to include women in almost every aspect of climate projects executions.”"
  },
  {
    "headline": "FG fumes as Twitter pulls down Buhari’s civil war tweet",
    "summarized_story": "From Magnus Eze, Enugu, Juliana Taiwo-Obalonye, Okwe Obi, Abuja Abuja and Chukwudi NwejeApplause and condemnations, yesterday, trailed Twitters decision to delete President Muhammadu Buhari’s civil war tweet.\nIf Mr. President, anywhere in the world feels very bad and concern about a situation, he is free to express such views.\nNow that Twitter has dealt with our almighty President Buhari, won’t he “deal” with Twitter too?\n!”Notwithstanding the trenchant criticisms, a group, Vanguard for Peace and National Development, backed President Buhari’s vow to crush separatist groups.\nWhat President Buhari does not understand is that if a referendum is conducted those opposed to IPOB/ESN may be more."
  },
  {
    "headline": "FG Protests Deletion of Tweet, Says Twitter Can’t Gag Buhari",
    "summarized_story": "The accusation followed the decision of Twitter to delete a controversial post by Buhari on the Nigerian civil war.\nThe same Twitter during the ENDSARS protests promoted tweets trying to raise funds for the ENDSARS protesters.\nIf Mr. President, anywhere in the world feels very bad and concerned about a situation, he is free to express such views.\nBy whatever name, you can’t justify giving orders to kill policemen or to kill anybody you do not agree with.\nHe said: “There are so many people who have been spewing hate against Mr. President, against this governments."
  },
  {
    "headline": "Ezeife: South-east Violence, Plot to Undermine Clamour for Igbo Presidency",
    "summarized_story": "Ezeife described the insurrection in the South-east as an attempt to provoke indigenes of the South-east.\n“Now we know that more than 80 per cent of the people caught by the CCTV are not from the South-east.\nHe stated that a South-east governor who had earlier accused IPOB and ESN of executing the attacks had since exonerated the secessionist group.\nDuring the ENDSARS protests, people attributed what was happening in Lagos to some Igbo people and it was later discovered to be untrue.\nThe guild thanked Ganduje and members of the state Executive Council for providing the enabling environment for the national convention to hold."
  },
  {
    "headline": "$40bn Investments Needed for Nigeria’s Gas Plan, Says NNPC",
    "summarized_story": "He added that the figure on the quantum of funds needed is based on the submissions NNPC has received from potential investors.\nIn addition, he stated that about 39 thermal power plants were being targeted as opposed to the current 33.\nHe said: “In terms of benefits, we will generate 45,000 megawatts of power in terms of gas use, creating massive employment and import substitution.\n“There are changes we need to look at to actualise the decade of gas.\nHe stated that if Nigeria will achieve the decade of gas, it must transit to a willing-buyer willing-seller market."
  },
  {
    "headline": "‘Retired AIG Gunned down! This is Very Sad,’ Ortom Reacts to Aide’s Murder",
    "summarized_story": "The governor, while speaking to journalists Wednesday at Benue Peoples House, Makurdi, lamented that the retired AIG was very active even in retirement, saying it was painful that he was gunned down in such a gruesome manner.\n“Retired AIG Dega served with me here and this is someone who has retired but is not tired and was very active.\nSo for him to have been murdered in the manner they did, a retired AIG gunned down.\nThe governor, who stressed that insecurity had bedevilled the entire country, called on security agencies to find killers of his aide.\nGovernor Ortom sympathized with the family, friends and former colleagues of the deceased and prayed God to grant him eternal rest."
  },
  {
    "headline": "Breaking: Twitter Deletes Buhari’s Tweet Threatening to Deal With Secessionists ‘in the Language They Understand’",
    "summarized_story": "Twitter has deleted President Muhammadu Buhari’s tweet posted Tuesday where he threatened to deal with secessionists “in the language they understand”.\nThe social media giant said, “This Tweet violated the Twitter Rules.\nHe also threatened to deal with “those misbehaving today” “in the language they understand.”Though the President tweeted five tweets on his meeting with Prof. Yakubu, it was the last tweet that Twitter said violated its rules and was deleted, while the remaining four tweets were retained.\nThose of us in the fields for 30 months, who went through the war, will treat them in the language they understand.”The state House has yet to react to Twitter’s action.\nSee the thread of the original tweets below."
  },
  {
    "headline": "Seven Times Nigerian Presidents, Governors Made Inflammatory Remarks Capable Of Destroying Nigeria",
    "summarized_story": "There have been countless occasions when Nigerian leaders threw caution to the wind and made heavy, insensitive statements about national issues which generated tension and only heated the polity the more.\nI am Richer Than Osun State – Tinubu BoastsA former Governor of Lagos State and national leader of the All Progressives Congress, APC, Bola Tinubu, stirred controversies in September 2018 when he said Osun State is not as wealthy as he his.\nBuhari had in a tweet on Tuesday stated that his government will get “harder” on those hell-bent on destroying the country.\n“Many of those misbehaving today are too young to be aware of the destruction and loss of lives that occurred during the Nigerian Civil War.\nMany reminded Buhari of the consequences of the Nigerian Civil War which lasted from 1967 to 1970, stating that such must not be repeated."
  },
  {
    "headline": "Seven Times Nigerian Presidents, Governors Made Inflammatory Remarks Capable Of Destroying Nigeria",
    "summarized_story": "There have been countless occasions when Nigerian leaders threw caution to the wind and made heavy, insensitive statements about national issues which generated tension and only heated the polity the more.\nI am Richer Than Osun State – Tinubu BoastsA former Governor of Lagos State and national leader of the All Progressives Congress, APC, Bola Tinubu, stirred controversies in September 2018 when he said Osun State is not as wealthy as he his.\nBuhari had in a tweet on Tuesday stated that his government will get “harder” on those hell-bent on destroying the country.\n“Many of those misbehaving today are too young to be aware of the destruction and loss of lives that occurred during the Nigerian Civil War.\nMany reminded Buhari of the consequences of the Nigerian Civil War which lasted from 1967 to 1970, stating that such must not be repeated."
  },
  {
    "headline": "BREAKING: Unknown Gunmen Hijack School Bus In Ondo, Abduct Staff",
    "summarized_story": "Some gunmen on Thursday morning hijacked a bus belonging to Chimola School in Oba Ile Estate of Akure North Local Government Area of Ondo state.\nSaharaReporters gathered that the gunmen abducted staff who was on duty to convey students to school.\nThe incident occurred around 7am while the driver and the abducted staff were moving round to pick up the pupils.\nHe said the men dragged the driver down from the vehicle and threatened to kill him.\nThe bus was later driven away by one of the hijackers while others moved away from the scene on motorcycles."
  },
  {
    "headline": "BREAKING: Unknown Gunmen Hijack School Bus In Ondo, Abduct Staff",
    "summarized_story": "Some gunmen on Thursday morning hijacked a bus belonging to Chimola School in Oba Ile Estate of Akure North Local Government Area of Ondo state.\nSaharaReporters gathered that the gunmen abducted staff who was on duty to convey students to school.\nThe incident occurred around 7am while the driver and the abducted staff were moving round to pick up the pupils.\nHe said the men dragged the driver down from the vehicle and threatened to kill him.\nThe bus was later driven away by one of the hijackers while others moved away from the scene on motorcycles."
  },
  {
    "headline": "Kidnapped Nigerian University Lecturer Regains Freedom",
    "summarized_story": "A lecturer in the Taraba State University, Umar Buba, has been released after spending four nights in the bandits' den.\nUmar who was kidnapped in the early hours of Sunday from the staff quarters of the university regained his freedom in the early hours of Thursday.\nHis abduction and subsequent release makes it the third time that lecturers from the institution’s staff quarters will be kidnapped.\nBuba is a lecturer and Head of the Department of Forestry and Wildlife Management, Faculty of Agriculture in Taraba State University.\nHe told journalists that the armed men fired gunshots sporadically to frighten security officials attached to the staff quarters before whisking away the lecturer."
  },
  {
    "headline": "Lagos ‘loses’ 1,800 dollar-millionaires as its wealth shrinks by 27% in five years",
    "summarized_story": "The total wealth of individuals living in Lagos state contracted by 27% in the last five, the Africa Wealth Report has shown.\nThe 2021 Africa Wealth Report recently released by the AfrAsia Bank and the New World Wealth (NWW) ranks Lagos as the fourth wealthiest city in Africa.\nAccording to the report reviewed by TheCable, the total wealth held in the city of Lagos amounts to $88 billion.\nIn the 2017 report, Lagos total wealth stood at $120 billion.\nThere was a reduction in the number of billionaires, multi-millionaires and millionaires in Lagos."
  },
  {
    "headline": "Lagos ‘loses’ 1,800 dollar-millionaires as its wealth shrinks by 27% in five years",
    "summarized_story": "The total wealth of individuals living in Lagos state contracted by 27% in the last five, the Africa Wealth Report has shown.\nThe 2021 Africa Wealth Report recently released by the AfrAsia Bank and the New World Wealth (NWW) ranks Lagos as the fourth wealthiest city in Africa.\nAccording to the report reviewed by TheCable, the total wealth held in the city of Lagos amounts to $88 billion.\nIn the 2017 report, Lagos total wealth stood at $120 billion.\nThere was a reduction in the number of billionaires, multi-millionaires and millionaires in Lagos."
  },
  {
    "headline": "Onion producers suspend supply to south-east over insecurity",
    "summarized_story": "The Onion Producers and Marketers Association (OPMAN) has announced its decision to suspend the supply of onions to the south-east owing to insecurity.\nAdvertisementThere has been a spike in criminal attacks in the south-east with security and government agencies increasingly targeted.\nThe gunmen were said to have hijacked the trucks and distributed their contents to the public.\nAdvertisementIn another development, Isah said farmers and marketers lost 200,000 bags of onions worth N2 billion to fire in Sokoto state.\n“We are only praying to God to bring succour to them but it was a terrible and unfortunate incident,” he said."
  },
  {
    "headline": "Onion producers suspend supply to south-east over insecurity",
    "summarized_story": "The Onion Producers and Marketers Association (OPMAN) has announced its decision to suspend the supply of onions to the south-east owing to insecurity.\nAdvertisementThere has been a spike in criminal attacks in the south-east with security and government agencies increasingly targeted.\nThe gunmen were said to have hijacked the trucks and distributed their contents to the public.\nAdvertisementIn another development, Isah said farmers and marketers lost 200,000 bags of onions worth N2 billion to fire in Sokoto state.\n“We are only praying to God to bring succour to them but it was a terrible and unfortunate incident,” he said."
  },
  {
    "headline": "Report: Borno better prepared for health emergencies than 50% of states",
    "summarized_story": "Borno is better prepared for health emergencies than over 50 percent of Nigerian states — according to SBM Intelligence, Nigeria’s geopolitical intelligence platform.\nAdvertisementThe SBM, in the second edition of its Health Preparedness Index (HPI), ranked Borno as the 17th most prepared state.\nIn November 2020, the Borno state government began the construction of Borno State University Teaching Hospital and College of Medical Sciences.\nAdvertisementBabagana Zulum, the state governor, said the development was to enable the Borno State University to start awarding degrees in medical programmes.\nThe report ranked Lagos, Ondo, Cross River as the three top prepared states in Nigeria while Zamfara, Jigawa, Kebbi are the least."
  },
  {
    "headline": "After Buhari’s “civil war” tweet is deleted, Nigerian minister accuses Twitter of suspicious agenda",
    "summarized_story": "Buhari’s deleted tweet was widely criticised as summoning the ghosts of the Nigeria civil war, a deadly three-year combat between the Nigerian government and a government in southeast Nigeria, which had seceded from the republic.\n“Many of those misbehaving today are too young to be aware of the destruction and loss of lives that occurred during the Nigerian Civil War,” the tweet read.\nTwitter had never deleted tweets by the Nigerian president before.\n“Has Twitter deleted the violent tweets that Nnamdi Kanu has been sending?\nWhat is their agenda?”Last October, Twitter became the platform where the world learned much about END SARS protests in Nigeria."
  },
  {
    "headline": "Banks don’t fund African renewable energy startups. So where can founders find money?",
    "summarized_story": "Michael Famoroti, chief economist at Stears gave two reasons during a recent TechCabal Live event on financing renewable energy companies in Africa.\nLike renewable energy for example.\nWiebe Boer, All On’s managing director, empathizes with founders who need funding but have little sources to reach out to.\nFrom there, it might be possible to access funding from All On’s initiatives for projects at the ideation stage.\nBut he hopes they persevere because “ultimately, there is a big market to serve.”Watch the full video of the TechCabal Live event on financing an African renewable energy company here."
  },
  {
    "headline": "Sawari Ventures is leading investments in North Africa",
    "summarized_story": "In today’s edition of Ask an Investor I talk to one of the oldest venture capital firms in the Middle East and North Africa – Sawari Ventures.\nFikry pointed out that Sawari Ventures helped Almentor in three critical areas: Governance, networking with the ecosystem and technical support.\nI talk to Tamer Azer, a principal at Sawari Ventures; he joined the firm in 2019.\nDaniel Adeyemi: Tell me about Sawari VenturesTamer Azer: Sawari ventures has been around since 2010.\nWhen Sawari Ventures raised its North Africa fund, we invested in Flat6Labs Cairo and Flat6Labs Tunis."
  },
  {
    "headline": "2021 Kickstart: International Breweries Calls for Application from Young Entrepreneurs",
    "summarized_story": "The application portal for young entrepreneurs between 18 and 35 years old to apply to the highly anticipated 6th Edition of International Breweries Plc’s Kickstart Initiative is now open.\nEndAbout International Breweries Plc.\nInternational Breweries Plc (IBPLC), is a proud part of the world’s largest brewer, Anheuser-Busch InBev, (AB InBev), the world’s largest brewer with over 400 beer brands.\nInternational Breweries was established in 1971 and was listed on The Nigerian Stock Exchange in 1995.\nAB InBev consolidated its business stakes in Pabod Breweries Limited, Intafact Beverages Limited into its majority ownership of International Breweries Plc in a merger that was concluded in December 2017."
  },
  {
    "headline": "Highlights from the Extraordinary Launch of the Infinix Note 10 – Where Beauty meets Strength",
    "summarized_story": "Did you miss the most exciting smartphone launch in recent times?\nInfinix Mobility has unveiled yet another product — the Infinix Note 10, the device that meets beauty with strength.\nThe launch, which was tagged, ‘Meet Beauty With Strength’ illustrates the beautiful screen and body of the device, while showing the strength of its processor.\nInfinix Nigeria went all out at the launch of the new Infinix Note 10 to showcase the elements of the new Note 10- Speed, Beauty, Power, and Strength.\nThe Infinix Note 10 boasts of being the World’s biggest center-punch screen smartphone with a super amazing Helio G95 processor."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Google accepts crypto ads, Twitter tackles misinformation, Airtel’s Tanzanian towers",
    "summarized_story": "I know cryptocurrency traders and investors are excited.\nTwitter launches Birdwatch to tackle misinformationFour months after announcing its plan to launch Birdwatch — a community-based approach to misinformation — Twitter has begun rolling out the feature in tweets.\nStay tuned to Techpoint Africa as Chimgozirim explores this in context later today.\nAirtel Africa sells its Tanzanian towers for $175 millionAirtel Africa has announced the sale of its Tanzanian tower portfolio for $175 million to settle its debts.\nVictoria Fakiya for Techpoint Africa."
  },
  {
    "headline": "Airtel Africa sells its Tanzanian towers for $175m in a play to reduce its debts",
    "summarized_story": "Airtel Africa has announced the sale of its Tanzanian tower portfolio for $175 million.\nAccording to the company, the sale to SBA Communications Corporation and Paradigm Infrastructure Limited would allow it to prioritise its core subscription services.\nAirtel Africa will receive approximately $157.5 million of the total amount in the first instalment, which is expected to take place in the second half of the group’s financial year.\nIn 2020, Airtel Africa CEO, Raghunath Mandava, outlined plans to sell approximately 4,500 towers in five countries: Chad, Gabon, Madagascar, Malawi, and Tanzania.\nIt appears that Airtel is choosing to go this route as it aims to reduce its debt and increase competitiveness."
  },
  {
    "headline": "How Releaf and OnePipe plan to help farmers in Southern Nigeria have access to digital financial services",
    "summarized_story": "Following a partnership between Releaf — an agritech startup — and fintech startup, OnePipe, farmers in Cross River and Akwa Ibom states can now easily access digital financial services.\nWhile fintech startups have sprung up trying to increase the number of Nigerians connected to financial services, they have mostly solved the problems associated using existing financial services.\nMost of the farmers who work with Releaf are smallholder farmers who live in rural areas.\nBy providing them with an opportunity to access financial services through digital channels, they can create a digital footprint enabling them to access more financial services, thus accelerating their financial inclusion.\nThrough this partnership with OnePipe, it is expected that smallholder farmers in Nigeria, most of whom lack access to financial services, can now access financial services and, in the process, drive Nigeria’s financial inclusion goals."
  },
  {
    "headline": "5 reasons $71 oil price is not enough to boost Nigeria’s economy",
    "summarized_story": "5 reasons $71 oil price is not enough to boost Nigeria’s economyPositive crude oil prices since the Organization of the Petroleum Exporting Countries (OPEC) projected increase in demand have raised hope of a better global fiscal performance after severe disruptions caused by COVID-19 that unsettled oil-dependent economies.\nOn Thursday, Brent, against which Nigeria’s oil is priced, grew by 1.57 percent to open at $71.70 compared to…"
  },
  {
    "headline": "5 reasons the Naira should be appreciating",
    "summarized_story": "Nigeria’s local currency is taking a beating with rates for the dollar at the autonomous market heading close to N500 but it should be the case that given the fundamentals of the economy the Naira should indeed be appreciating.\nUsually in Nigeria, calls for a weakening of the local currency get louder but here are…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigeria’s weak growth trails already low IMF forecast",
    "summarized_story": "For Africa’s biggest oil producer to attain the 2.5 percent gross domestic product (GDP) forecast by the International Monetary Fund (IMF) for 2021, it would need to grow by an average of 3.15 percent over the next three quarters after a tepid 0.51 percent expansion in the first quarter.\nAttaining the IMF forecast in itself…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Acting Edo PDP chairman calls for calm – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin – Mr Harrison Omagbon, Edo acting Peoples Democratic Party (PDP) Chairman, has called for calm among party faithful, following the suspension of the state chairman, Dr Tony Aziegbemi.\nHe said that the suspension of Aziegbemi was to allow for proper investigation into the allegations against him.\n“That is why we have set up a committee to investigate and unearth the facts of these allegations,” he said.\nOmagbon added: “My dear party faithful, we are at a very auspicious time in our democracy.\n“It is on record that our governor is counted among those delivering the dividends of democracy to the people."
  },
  {
    "headline": "Obaseki: Court ‘ll decide fate of 14 run-away Assembly members-elect – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has asserted that the fate of the 14 members-elect of the state’s House of Assembly, whose seats were declared vacant, rests with the Court.\nThe seats of the 14 members-elect were in December 2019 declared vacant by the House led by former speaker, Rt.\nAccording to him, “Some characters said they sent congratulatory letters to me and put it in all kinds of conditions.\n“How can you tell me to forgive those 14 lawmakers-elect who are responsible for sedition and treason in Nigeria?\nOsanyande said that the e-revenue collection system would further increase the state government Internally Generated Revenue (IGR)."
  },
  {
    "headline": "Obaseki meets Edo youths, says Nigeria in dire need of strong institutions not strongmen – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has identified weak institutions as a bane of Nigeria’s underdevelopment, hinting on the need for leaders across the country to build strong institutions to achieve sustainable development.\nObaseki made the call while addressing youths in the state during a stakeholders’ engagement of the Edo State Transition Committee with youths and student groups at the New Festival Hall, Government House, Benin City.\nAccording to Obaseki, “Let us hold our political leaders to account; people will come and go, but institutions will remain.\nThe only way this will happen is when we realize that the government is about you and when you participate in governance.\nYou need to participate – not just sit down and participate on social media – in your community; speak up,” the governor charged."
  },
  {
    "headline": "Obaseki appoints Osaigbovo Iyoha as Chief of Staff – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has appointed Hon.\nIyoha Osaigbovo Toni, as his Chief of Staff.\nIyoha Osaigbovo Toni, born on 6th of July 1973, holds a Bachelors’ degree in Mechanical Engineering from Ambrose Alli University, (formerly Edo State University) and a Masters of Engineering degree in Industrial Engineering from the University of Benin (UNIBEN).\n“He is presently concluding a Ph.D in Industrial Engineering from UNIBEN.\nHis experience spans across Construction, Legislation, Public Service and Industrial Engineering."
  },
  {
    "headline": "Another Nigerian busted in U.S. for stealing $800,000 in payroll hacking",
    "summarized_story": "The Federal Bureau of Investigation (FBI) has arrested a Nigerian, Charles Onus, for his alleged involvement in diverting $800,000 into prepaid debit cards.\nThis comes less than a month after Abidemi Rufai, an aide to Ogun State Governor, Dapo Abiodun, was arrested for fraud in the United States.\nAccording to a statement on the United State Department of Justice website, Mr Onus was arrested and detained on April 14, in San Francisco.\nHe allegedly participated in a scheme that stole nearly $1 million by hacking into a payroll processing company’s system to access user accounts and divert payroll to prepaid debit cards he controlled.\nThanks to the FBI and IRS-CI, Onus is in custody and facing serious federal charges,” the statement read in part."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Our Southeast branches fully open – First Bank",
    "summarized_story": "OBINNA EZUGWUFirst Bank of Nigeria, has denied reports that it closed all of its branches in Nigeria’s Southeast, noting that the branches are fully open.\nReports had recently circulated on social media that the country’s oldest bank, shut its branches in the region over security concerns.\nHowever, debunking the reports in a public announcement yesterday, the bank said, “This is to inform the public that our South East branches are fully open for business.\nPlease disregard any news making the rounds that is contrary to this.”"
  },
  {
    "headline": "Malami denies advising Buhari to suspend Nigeria’s Constitution",
    "summarized_story": "The Attorney-General of the Federation and Minister of Justice, Abubakar Malami, has denied advising President Muhammadu Buhari to suspend the country’s constitution and implement martial law to be able to tackle the escalating insecurity in the country more effectively.\n“Malami remains a true democrat who believes in rules of law and tenant of democracy and Constitutional order.\n“The Office of the Attorney-General of the Federation and Minister of Justice is a constitutionally recognised one with its role and responsibilities embedded in the constitution.\nAccording to the newspaper, Mr Malami specifically urged the president to suspend the fundamental rights of all Nigerians as guaranteed under Chapter IV of the Constitution.\nAccording to the report, Mr Malami, said the president should issue instruments of emergency and publish them in the federal gazette."
  },
  {
    "headline": "Four policemen, three others killed as gunmen attack police headquarters in Osun",
    "summarized_story": "Some yet to be identified gunmen numbering 35 on Wednesday, launched attack on the Divisional Police Headquarters and the Armoured Personnel Carrier (APC) pinned down at Ikoyi-Osun, Ikire, Irewole Local Government Area of Osun State, with several explosive devices, killing four police officers and three civilians in the process.\nConfirming the attack in a statement on Thursday morning, the state police command spokesperson, Mrs Yemisi Opalola, explained that the perpetrators of the act were armed robbers.\nShe said the armed robbers came with several explosive devices and several guns firing in a bid to subdue the capacity of the police.\n“It is unfortunate that ASP Osho Oluranti, Inspector Lekan Olalere, Two (2) Special Constabularies; namely Oladeni Olalekan, and Oyedeji Muyideen were shot dead in the process,” she said.\n“While escaping, they shot sporadically, and regrettably three civilians were shot namely: Toheeb Oyebola, Temilorun Adebiyi and one other, (whose identity is not yet known), all male."
  },
  {
    "headline": "Osun APC Chairmanship Aspirant, Divine drums support for Oyetola’s re-election",
    "summarized_story": "By Sunday Oguntuyi, OsoogboA chairmanship aspirant for Odo Otin North LCDA under the platform of All progressives Congress (APC) in Osun State, Hon.\nOluwatobi Olabode (Divine), has called on the people in the local government and the state at large to rally support for the re-election of Governor Adegboyega Oyetola for the good work he embarked on to continue.\nOlabode said continuity of the present administration in the state will lead to developmental programmes that will enhance living standard of people in the state.\nAccording to him, considering the various developmental projects going on simultaneously in the state without borrowing and owing workers salaries and pension arrears, governor Oyetola deserve second term.\nDivine” said he is jostling for chairmanship position of his local council to further add glamour to the development in the area."
  },
  {
    "headline": "Governor Udom Asks LG Chairmen To Transform Rural Areas",
    "summarized_story": "Governor of Akwa Ibom State, Udom Emmanuel has charged chairmen of local government areas in the state to replicate his economic feats at the grassroots.\nHe made the charge at Ikot Akpa Nkuk, headquarters of Ukanafun local government area yesterday during the maiden Ukanafun Economic Development Summit to mark 45 years of the creation of the council.\nGovernor Udom said economic activities in the urban areas should be replicated in the hinterlands by the council chairmen.\nUdom said the creation of local government was a journey in economic self-advancement and urged local governments to make annual economic assessment so that the purpose of self-government at whatever level would not be defeated.\n“The creation of a state, or in this case, a local government area , is in itself a release for a journey in economic self – advancement”."
  },
  {
    "headline": "Governor Udom Asks LG Chairmen To Transform Rural Areas",
    "summarized_story": "Governor of Akwa Ibom State, Udom Emmanuel has charged chairmen of local government areas in the state to replicate his economic feats at the grassroots.\nHe made the charge at Ikot Akpa Nkuk, headquarters of Ukanafun local government area yesterday during the maiden Ukanafun Economic Development Summit to mark 45 years of the creation of the council.\nGovernor Udom said economic activities in the urban areas should be replicated in the hinterlands by the council chairmen.\nUdom said the creation of local government was a journey in economic self-advancement and urged local governments to make annual economic assessment so that the purpose of self-government at whatever level would not be defeated.\n“The creation of a state, or in this case, a local government area , is in itself a release for a journey in economic self – advancement”."
  },
  {
    "headline": "Return Of School To Owners: Ikpeazu Warns Beneficiaries To Stick To Guidelines",
    "summarized_story": "Governor of Abia State, Dr Okezie Ikpeazu, has warned the management of private schools that were handed back to their owners to operate according to the terms and guidelines for the handover.\nGovernor Okezie Ikpeazu gave the order at an interactive session with newsmen at Governor’s Lodge, Aba, saying the state government will not hesitate to withdraw the certificate of recognition of an offending school.\n“Nothing in the statue books says I shouldn’t withdraw their ownership and revert it to government if any of you is found to be violating guidelines,” said the academician turned politician.\nHe expressed concern that owners of the schools which included individuals and faith- based organisations were allegedly violating the terms and guidelines for the handover.\nHe said some of the proprietors had violated the terms and guidelines by either selling some portion of the property or converted it to other purposes other than for teaching and learning."
  },
  {
    "headline": "Return Of School To Owners: Ikpeazu Warns Beneficiaries To Stick To Guidelines",
    "summarized_story": "Governor of Abia State, Dr Okezie Ikpeazu, has warned the management of private schools that were handed back to their owners to operate according to the terms and guidelines for the handover.\nGovernor Okezie Ikpeazu gave the order at an interactive session with newsmen at Governor’s Lodge, Aba, saying the state government will not hesitate to withdraw the certificate of recognition of an offending school.\n“Nothing in the statue books says I shouldn’t withdraw their ownership and revert it to government if any of you is found to be violating guidelines,” said the academician turned politician.\nHe expressed concern that owners of the schools which included individuals and faith- based organisations were allegedly violating the terms and guidelines for the handover.\nHe said some of the proprietors had violated the terms and guidelines by either selling some portion of the property or converted it to other purposes other than for teaching and learning."
  },
  {
    "headline": "JUST-IN: NECO Gets New Registrar",
    "summarized_story": "The Governing Board of the National Examinations Council (NECO) has approved the appointment of Mr. Ebikibina John Ogborodi as the acting Registrar/Chief Executive of the Council.\nThe appointment followed the death of the former Registrar, Professor Godswill Obioma on Monday, June 1, 2021 after a brief illness.\nRELATED: NECO Registrar, Prof. Obioma, Dies Of Heart AttackUntil his appointment, Mr. Ogborodi was the Director, Special Duties in the Council."
  },
  {
    "headline": "Medical Workers’ President, Biobelemoye Josiah emerges King of Opu-Nembe",
    "summarized_story": "Comrade Biobelemoye Josiah, now to be known as His Royal Majesty, King Biobelemoye Josiah attained the Royal stool after defeating two others at the final contest to the throne.\nKing Biobelemoye Josiah polled 64 votes to defeat Admiral Victor Ombu with 5 votes and Chief (Arc).\n“Afterwards, King Biobelemoye Josiah was dressed in the warrior attire and fashion of the ancient King.\nWith the creation of Bayelsa state in 1996, he has been in the employment of the Bayelsa state Hospital Management Board since then, till date.\nHRM, King Biobelemoye Josiah is an experienced trade unionist who has served in all levels of the MHWUN organisation."
  },
  {
    "headline": "Police vow to apprehend killers of officers, others in Ikire",
    "summarized_story": "The Police Command in Osun says efforts are ongoing to apprehend the fleeing suspected armed robbers that killed four of its officers and three others in an attempted banks robbery in Ikire and Apomu Towns on Wednesday.\nSP Yemisi Opalola, the Command Spokesperson, said in a statement on Thursday in Osogbo, that two police officers and two special constables were killed during the robbery attacks.\nOpalola, also said that three civilians were also killed by strayed bullets during the incident.\nShe gave the names of the police officers that lost their lives as ASP Osho Oluranti, Insp.\n“The assailants fled to the bush with gun shot wounds, abandoning two of the operational vehicles they came with."
  },
  {
    "headline": "Nnamdi Kanu: Buhari Pampering Bandits, Terrorists, Kidnappers",
    "summarized_story": "Nnamdi Kanu, the leader of the Indigenous People of Biafra, has accused President Muhammadu Buhari of praising Fulani terrorists, bandits, and kidnappers.\nThe IPOB leader stated this while reacting to the N110m ransom demanded by bandits responsible for the abduction of students of the Salihu Islamiyya School in Tagina Town of Rafi Local Government Area of Niger.\nKanu in his reaction wondered why the president would proscribe IPOB demanding justice while bandits, terrorists, and kidnappers are being pampered.\nHe wrote, “Look at the handiwork of the same #Fulani people lecturing us all about insecurity and threatening genocide in the East.\nA @NGRPresident that pampers terrorists, bandits, and kidnappers from his #Fulani tribe but proscribes freedom fighters demanding justice and fair treatment.”"
  },
  {
    "headline": "“Edo is not Imo” – Obaseki boasts, stage Victory March",
    "summarized_story": "Godwin Obaseki, the governor of Edo state, staged a march in Benin city to commemorate his Supreme Court triumph.\nObaseki was found not guilty in a certificate forgery case brought against him by his competitor and APC candidate, Osagie Ize-Iyamu.\nIn a statement released on Wednesday, the Governor said that his victory proves that Edo is not ‘Lagos or Imo,’ a clear dig at his previous party, the APC, and his predecessor/political opponent, Adams Oshiomole.\nWe have to pray to God so that what happened in Edo will also happen in Nigeria.”“We have embarked on this victory march to thank Edo people, as the victory belongs to God and Edo people.\nThrough your support and determination, you have shown that Edo is Edo, not Lagos or Imo.”"
  },
  {
    "headline": "Gunmen allegedly kill three, burn houses, vehicles in Imo",
    "summarized_story": "Some gunmen have killed three persons, including a youth leader of the Peoples Democratic Party, PDP, Kenneth Amukaamara on Monday night in Awonmama, Oru East Local Government Area of Imo state, .\nA family source to one of the victims who pleaded for anonymity told Vanguard in Owerri, that he pleaded with the security agencies to help in uncovering the perpetrators of the wicked act.\nThe matter is that they were murdered and we cannot say those who carried out this wicked act.\nHowever, it is the duty of the security agencies to find those responsible.\nThis is what I can say, for now, the security agencies will need to unravel those behind it.”“We are pleading that the security agencies will be fast enough to bring those behind this act to face the law."
  },
  {
    "headline": "Gunmen allegedly kill three, burn houses, vehicles in Imo",
    "summarized_story": "Some gunmen have killed three persons, including a youth leader of the Peoples Democratic Party, PDP, Kenneth Amukaamara on Monday night in Awonmama, Oru East Local Government Area of Imo state, .\nA family source to one of the victims who pleaded for anonymity told Vanguard in Owerri, that he pleaded with the security agencies to help in uncovering the perpetrators of the wicked act.\nThe matter is that they were murdered and we cannot say those who carried out this wicked act.\nHowever, it is the duty of the security agencies to find those responsible.\nThis is what I can say, for now, the security agencies will need to unravel those behind it.”“We are pleading that the security agencies will be fast enough to bring those behind this act to face the law."
  },
  {
    "headline": "More condemnation trails assassination of Ortom’s security aide in Pateau",
    "summarized_story": "The Plateau State Police Command has confirmed the killing of a Senior Special Assistant to Governor Samuel Ortom on Security, AIG Christopher Dega (retd.\nThe governor’s aide was shot in the chest several times by the gunmen on Tuesday.\nAlso, the minority caucus in the House of Representatives condemned the murder.\nThe Minority Leader of the House, Ndudi Elumelu, in a statement issued on Wednesday and titled, ‘Reps Minority Caucus Condemns Killing of Gov.\nOrtom’s Security Adviser’, charged security agencies to go after his killers and ensure that they were prosecuted."
  },
  {
    "headline": "More condemnation trails assassination of Ortom’s security aide in Pateau",
    "summarized_story": "The Plateau State Police Command has confirmed the killing of a Senior Special Assistant to Governor Samuel Ortom on Security, AIG Christopher Dega (retd.\nThe governor’s aide was shot in the chest several times by the gunmen on Tuesday.\nAlso, the minority caucus in the House of Representatives condemned the murder.\nThe Minority Leader of the House, Ndudi Elumelu, in a statement issued on Wednesday and titled, ‘Reps Minority Caucus Condemns Killing of Gov.\nOrtom’s Security Adviser’, charged security agencies to go after his killers and ensure that they were prosecuted."
  },
  {
    "headline": "Foreign Fulani herdsmen planning a big strike against South West",
    "summarized_story": "By AbankulaForeign Fulani herdsmen in the South West of Nigeria are poised to launch a ‘big strike’ against their hosts, any time.\nHis lecture was entitled: “Security Challenges, The significance of regional security dimensions.”He said:“The foreign Fulani herdsmen have invaded South West.\nWhen it came to the issue of Fulani herdsmen, people said different things.\nWhen it came to my turn, I said these Fulani herdsmen, who the Northerners see as part of them, are foreigners.\nThe Fulani herdsmen we grew up to know around here do not graze on anyone’s farm; we lived with them for decades."
  },
  {
    "headline": "2023: No right-thinking Nigerian will support Igbo presidency – Buhari’s ex-aide",
    "summarized_story": "Alhaji Abdurrahman Sulaiman Kawu Sumaila, ex-aide to President Muhammadu Buhari has said no right-thinking Nigerians will support Igbo presidency in 2023.\nKawu Sumaila, the former Special Assistant to President Muhammadu Buhari on Assembly Matters, said right-thinking Nigerians will not endanger their lives by supporting the candidature of any South-East politician vying for the presidency in 2023.\nHe also said that those responsible for the rising security challenges in the country’s southeastern part want to turn Nigeria into anarchy.\nSome groups from the Southeast advocating for Nigeria’s next president to come from the region had stressed that the Igbo presidency was the panacea to the country’s woes.\nI am sure not a single right-thinking Nigerian will endanger his life to support the candidature of any South-East politician contesting for presidency come 2023 general elections,” Sumaila’s statement reads in part."
  },
  {
    "headline": "Declare kidnappers, a terrorist group – Kukah tells Buhari",
    "summarized_story": "By Nimot SulaimonBishop Matthew Kukah has faulted President Muhammadu Buhari for his refusal to declare bandits as a terrorist group.\nAccording to Kukah, the presidency, as well as the citizens, know who the terrorists are, and what needs to be done.\nAlso, that the Federal government’s refusal to name them (bandits/kidnappers) terrorists shows that they ”have no blood in their hearts”.\n“Those who govern us are allowing this killing of citizens in their innocency because they have no blood in their hearts,” Kukah said.\nThe government has never declared the kidnappers to be terrorist group."
  },
  {
    "headline": "Notorious Leaders Known For Inflammatory Remarks Capable Of Destroying Nigeria",
    "summarized_story": "There have been countless occasions when Nigerian leaders threw caution to the wind and made heavy, insensitive statements about national issues which generated tension and only heated the polity the more.\nSaharaReporters, in taking a look at seven of such occasions, reports that notorious among the leaders known for reckless comments are; President Muhammadu Buhari, former President Olusegun Obasanjo and Kaduna State Governor Nasir El-Rufai, among others.\nHe said, “It is left to you to ensure that we elect credible and committed leaders.\nI am Richer Than Osun State – Tinubu BoastsA former Governor of Lagos State and national leader of the All Progressives Congress, APC, Bola Tinubu, stirred controversies in September 2018 when he said Osun State is not as wealthy as he his.\nBuhari had in a tweet on Tuesday stated that his government will get “harder” on those hell-bent on destroying the country."
  },
  {
    "headline": "Why Ahmed Gumi Has Not Been Declared Wanted – FG",
    "summarized_story": "Ahmad Gumi, a popular Islamic preacher, has not been proclaimed wanted, according to the minister of information, Lai Mohammed, since there is no evidence that the cleric is inciting violence against the federal government.\nAccording to The Cable, Mohammed made the comments in response to a question from journalists in Abuja on Wednesday, June 2.\nAccording to Mohammed, the cleric’s perspective differs from Kanu’s, who he accuses of openly pushing for attacks on security personnel.\nAccording to the minister,“Who appointed Gumi middleman between government and Boko Haram?\nListen, for me, unless you come and tell me this is what Gumi said that is inciting that you are comparing to Kanu…anyway what we’re discussing is different."
  },
  {
    "headline": "NECO Registrar, Obioma Was Killed – Gov. Ortom",
    "summarized_story": "The death of Professor Godswill Obioma, the Registrar of the National Examinations Council (NECO), has saddened Benue State Governor Samuel Ortom.\nNigerians have demanded an investigation and urged the federal government to arrange an independent autopsy.\nOrtom grieved the murder of Obioma, an ex-Resident Commissioner for the Independent National Electoral Commission (INEC) in Ebonyi, on Wednesday.\nHe was reacting to the assassination of Christopher Dega, his Senior Special Assistant on Security and a retired Assistant Inspector General of Police.\n“For him to have been murdered in the manner that they did…a retired AIG gunned!”“Then Professor Obioma, can you imagine?"
  },
  {
    "headline": "BREAKING: Gunmen Hijack School Bus In Ondo",
    "summarized_story": "A bus belonging to Chimola School in Oba Ile Estate of Akure North Local Government Area in Ondo state was hijacked by gunmen on Thursday morning.\nThe gunmen grabbed personnel who were on duty to transport pupils to school, according to News Direct.\nThe gunmen numbering about eight who were on motorcycles, rounded the vehicle with registration number —Lagos LSD 853 FJ, forcing the driver to stop, a source said.\nHe said the men dragged the driver down from the vehicle and threatened to kill him.\nThe bus was later driven away by one of the hijackers while others moved away from the scene on motorcycles."
  },
  {
    "headline": "Breaking: Gunmen free kidnapped school attendant in Ondo",
    "summarized_story": "Omolayo Ojo, a school attendant kidnapped by gunmen after a school bus was hijacked on Thursday morning in Akure, Ondo state capital, has regained freedom.\nBlueprint gathered that the gunmen had released her after they missed their target.\nThe dare-devil men had thought that school pupils were inside the bus when they struck.\nThe gunmen, who rode on motorcycles, had crossed the bus belonging to Chimola School around 6:45am when the driver was on a routine of picking pupils.\nShe said they dragged the driver out but took her along as they drove away to the bushDetailscoming…Share this:TweetPrintTelegramWhatsApp"
  },
  {
    "headline": "#BlueprintAt10: Humanitarian Affairs minister, Sadiya Umar Farouk, Senator Ibikunle Amosun in attendance",
    "summarized_story": ""
  },
  {
    "headline": "#BlueprintAt10: Jonathan, Lawan, Ayade in attendance",
    "summarized_story": ""
  },
  {
    "headline": "Tobacco Day: Nollywood celebrities pledge to stop smoking scenes in movies",
    "summarized_story": "High-profile Nollywood celebrities, producers, directors, actresses, and actors have teamed up to stop producing movies that promote tobacco intake in Nigeria due to its effect on children.\nCelebrities involved in the campaign include; Omotola Jalade Ekeinde, Dakore Egbuson-Akande, Osas Ighodaro, Anto Lecky of Big Brother Africa.\nThe statement further showed that according to the World Health Organisation, 370,000 children in Nigeria smoke daily.\nAlso, research shows that a significant percentage of current adult smokers were influenced by movies as the celebrities took responsibility and pledged to make amends.\n“37% of these smokers started smoking as children due to the influence of movies that are created,” the statement reads."
  },
  {
    "headline": "Tobacco Day: Nollywood celebrities pledge to stop smoking scenes in movies",
    "summarized_story": "High-profile Nollywood celebrities, producers, directors, actresses, and actors have teamed up to stop producing movies that promote tobacco intake in Nigeria due to its effect on children.\nCelebrities involved in the campaign include; Omotola Jalade Ekeinde, Dakore Egbuson-Akande, Osas Ighodaro, Anto Lecky of Big Brother Africa.\nThe statement further showed that according to the World Health Organisation, 370,000 children in Nigeria smoke daily.\nAlso, research shows that a significant percentage of current adult smokers were influenced by movies as the celebrities took responsibility and pledged to make amends.\n“37% of these smokers started smoking as children due to the influence of movies that are created,” the statement reads."
  },
  {
    "headline": "Anambra Election: The Master players and their Achilles Heels -NigPilot",
    "summarized_story": "While some of them usually remember the promise made to the religious denominations especially whenever election is around the corner.\nParticularly, all eyes are on APGA to make a wrong choice and that would be their Achilles heels.\nNevertheless, here is an analysis of the peculiar problems in the three major parties in the state.\nThis singular action which was primarily meant for the betterment of the party didn’t go down well with party stakeholders.\nPDPOne wonders that since ever the existence of PDP in Anambra state for any governorship election, the present web of aspirants has became so unprecedented in the history of Nigeria politics."
  },
  {
    "headline": "Anambra Election: The Master players and their Achilles Heels -NigPilot",
    "summarized_story": "While some of them usually remember the promise made to the religious denominations especially whenever election is around the corner.\nParticularly, all eyes are on APGA to make a wrong choice and that would be their Achilles heels.\nNevertheless, here is an analysis of the peculiar problems in the three major parties in the state.\nThis singular action which was primarily meant for the betterment of the party didn’t go down well with party stakeholders.\nPDPOne wonders that since ever the existence of PDP in Anambra state for any governorship election, the present web of aspirants has became so unprecedented in the history of Nigeria politics."
  },
  {
    "headline": "Constitution review: Senate begins national public hearing Thursday -NigPilot",
    "summarized_story": "Senate President, Dr. Ahmad Lawan, yesterday announced that a national public hearing to alter the provisions of the 1999 constitution would hold on Thursday through Friday this week.\nHe described the zonal public hearings held last week in the six geo-political zones of the country as “quite successful”.\nHe said: “Let me also congratulate the members of the Constitution Review Committee of the Senate, who had conducted the public hearings across the countries.\n“(And) in fact, the report we received has shown that in all the centres, the public hearings were quite successful.\n“I want to also appeal to Nigerians to take the opportunity of the national public hearing that will take place from Thursday."
  },
  {
    "headline": "Bandits Attack Fulani Settlement In Zamfara",
    "summarized_story": "Bandits have attacked a Fulani settlement on the outskirts of Anka town along the Bagega-Anka Road in Zamfara State.\nHe stated that no life was lost in the attack, but the bandits rustled an unspecified number of cows belonging to members of the community.\nThe witness said a motorcycle belonging to the leader of Fulani in Anka was also set ablaze by the armed bandits.\nPolice authorities in the state have confirmed the attack, saying the bandits were swiftly repelled by security operatives who recovered the rustled cattle from them.\nIn a statement on Thursday, the spokesperson for the command, Shehu Mohammed, explained that police tactical operatives deployed to Anka were alerted that many bandits had stormed the Fulani settlement to attack and rustle cows."
  },
  {
    "headline": "Gunmen Hijack School Bus, Abduct One In Ondo",
    "summarized_story": "Some gunmen numbering about eight have hijacked a school bus in a housing estate in Oba-Ile, Akure North Local Government Area of Ondo State.\nThe incident according to eyewitness occurred early on Thursday morning when the driver of the bus and the attendant were going round to pick the pupils.\nFortunately, they were yet to pick any pupil when they were accosted by the armed men.\nThe school bus with registration number Lagos LSD 853 FJ has the name of the school written on it.\nThe spokesperson of Ondo State Police Command, DSP Tee-Leo Ikoro, said he had not been briefed about the incident."
  },
  {
    "headline": "How Robbers Killed Four Operatives, Three Locals In Failed Bank Attacks – Police",
    "summarized_story": "It was a sad day for the people of Ikire and Apomu towns in Osun State after armed robbers killed seven persons comprising security operatives and innocent locals.\nThe incident occurred on Wednesday evening when the gunmen stormed the towns in an attempt to attack the banks there.\nThey were said to have stormed the area in about five vehicles and attack the police station in Ikire, as well as an armoured vehicle at Ikoyi-Osun.\nOn their arrival, Opalola said the reinforcement team swiftly engaged the robbers in a fierce gun duel, forcing the assailants to flee.\nShe said the bodies of the slain security personnel and locals have been deposited at a morgue in Apomu and effort was ongoing to apprehend the fleeing suspects."
  },
  {
    "headline": "10 Arrested Over Attacks On Security Operatives, Police Stations In Akwa Ibom",
    "summarized_story": "Ten persons have been arrested in connection with the recent killing of security operatives and attacks on police facilities in Akwa Ibom State, authorities have said.\nIn a statement on Thursday, the Commissioner of Police in Akwa Ibom, Andrew Amiengheme, noted that the security operatives recovered several items, including vehicles, arms, ammunition, as well as some cash from the suspects.\n”This unacceptable trend of events necessitated the formation of a Joint Task Force (JTF), comprising the Nigerian Army, the Nigeria Police Force, the DSS, and NSCDC.\nThe operations of the Joint Task Force (JTF) have yielded a lot of successes with more still being done,” said the police commissioner.\nHe commended the Nigerian Army and other security agencies for the success and assured them that the police would continue to work with them to secure the state."
  },
  {
    "headline": "Inter Milan Name Simone Inzaghi As Conte’s Successor – Channels Television",
    "summarized_story": "Serie A champions Inter Milan have named Simone Inzaghi as their new coach following the departure of Antonio Conte, the club announced on Thursday.\nFormer Lazio boss and Italy international Inzaghi, 45, has signed a two-year deal at the San Siro.\nEight of the clubs that finished in the top 10 of Serie A have changed coach since the end of the season.\nInzaghi will reportedly earn four million euros ($4.9 million) annually, almost three times less than Conte.\nRomelu Lukaku confirmed his future with Inter on Wednesday, revealing he had spoken to Inzaghi before the news of his appointment was made public."
  },
  {
    "headline": "John Ogborodi appointed as NECO acting Registrar",
    "summarized_story": "The Governing Board of the National Examinations Council has approved the appointment of Ebikibina John Ogborodi as the Acting Registrar/Chief Executive of the Council.\nThe appointment followed the death of the Registrar, Professor Godswill Obioma on 1st June, 2021 after a brief illness.\nAdvertisementUntil his appointment, Mr. Ogborodi was the Director Special Duties in the Council.\nThe Acting Registrar joined the service of NECO in 1999 and had served in different capacities.\nHe was a former Acting Director, Examination Development Department; Acting Director, Office of the Registrar; Director, General Services and Director, Human Resource Management among others."
  },
  {
    "headline": "Matawalle receives UK delegation on security, appeals for more support to end banditry",
    "summarized_story": "Zamfara State Governor, Bello Matawalle, said the security challenges he inherited from the previous government has posed a great deficit in achieving the desired goals of his administration and has virtually affected all aspects of life.\nAdvertisementMr. Matawalle commended the UK Government for its support on security and general well being of Zamfara State and Nigeria in general, noting there is no country in a better position to support the state than the UK considering its position in the area of security.\nHe further thanked the UK Government for all it has been doing in terms of support and cooperation to the State and Nigeria as a whole.\nEarlier, the leader of the UK High commission delegation Sam Weldock said aim of the visit is to extend more support to Zamfara State and other North-Western States on Security issues in the region in order to restore lasting peace and tranquility.\nAdvertisementHe noted that, the UK Government is worried about the rising security challenges facing Zamfara state and will give it all the needed support it to ensure it overcome the problem."
  },
  {
    "headline": "Partisan politics, least of my concern now – Mimiko",
    "summarized_story": "Ondo State’s immediate past governor, Olusegun Mimiko, stated on Wednesday that partisanship is the least of his concerns right now.\nAccording to Akinduro, the report on Dr Mimiko’s supposed plan to defect to APC “is a piece of fake news.”The statement continues, “Dr.\n“It is noteworthy that at Hon Akinlaja’s book presentation, Dr Mimiko harped on the theme of security, by advising the President on the centrality of the security challenge to his legacy.\n“No where was any mention made or discussion held on any possible defection to any party.\nDr. Mimiko remains in the Zenith Labour Party and his hope has been a collaboration of left leaning political groups to offer a real ideologically driven alternative in the nation’s political process,” the statement concluded."
  },
  {
    "headline": "Ugandan Transport Minister Discharged From Hospital After Shooting Incident",
    "summarized_story": "Uganda’s Transport Minister General Katumba Wamala has been discharged from hospital after undergoing surgery to remove a bullet in his arm.\nThe minister was injured after gunmen riding on motorcycles shot at his vehicle killing his daughter and driver.\nThe minister has asked those behind the killings to be arrested and brought to book.\nOne suspect has been arrested in connection with the killings, according to state-owned New Vision newspaper.\nNTV Uganda shared a video of the minister viewing her body:The minister and his daughter were heading for a vigil at his mother-in-law’s home on Tuesday when the attack happened."
  },
  {
    "headline": "I Don’t Have Conversations With IPOB Leader Nnamdi Kanu: Senator Abaribe",
    "summarized_story": "Leader of the minority caucus in the Nigerian Senate Enyinnaya Abaribe has said he does not have conversations with Nnamdi Kanu, the leader of the proscribed Indigenous Peoples of Biafra (IPOB).\nMr Abaribe and two others had stood as sureties for Kanu before he was granted bail by a Federal High Court in Abuja on April 25, 2017.\nThe IPOB leader however slipped out of Nigeria after soldiers deployed under the Operation ‘Python Dance II’ in the South-East to quell the agitation for the Biafra Republic, invaded his home in Afara-Ukwu, Umuahia, Abia in September 2017.\nBut speaking to ARISE News on Thursday, Senator Abaribe said he does not have the privilege to speak with Mr Kanu but goes through his lawyers to get messages across to the IPOB leader.\nAccording to the lawmaker Abaribe, the messages sent to Mr Kanu has always been to embrace peace in his pursuit of justice and not violence."
  },
  {
    "headline": "Nigeria Government Ignoring Killings in Other Regions But Applying Force in Southeast: Senate Minority Leader Abaribe",
    "summarized_story": "Senator Enyinnaya Abaribe, the leader of the minority caucus in the Nigerian Senate is accusing the federal government of following a pattern that tends to ignore the killings and abductions in other parts of the country but applies enormous force to douse crisis and violence in the southeast.\nMr Abaribe stated this on Thursday when he featured on an ARISE News programme, The Morning Show and queried the response President Muhammadu Buhari gave to the crisis in the region when he threatened to visit on people depredations of the civil war.\nAccording to the Senate minority leader, President Buhari’s reaction to the violence and agitation in the southeast was an uncalculated response.\nWatch the interview."
  },
  {
    "headline": "Nigerian Designer Threatens Action Against ‘Coming 2 America’ and Mary J. Blige Documentary Debuts",
    "summarized_story": "Nigerian designer Ugo Monye has threatened legal action against ‘Coming 2 America’ producers over infringement.\nThe designer threatened legal action over the alleged use of his company’s registered design in the 2021 Paramount pictures film, ‘Coming 2 America’.\nMonye revealed that the popular ‘Reale Design’ owned by his company was reproduced in the film without authorization.\nIt’s executive produced by Blige and Sean “Diddy” Combs with Quincy Jones serving as executive music producer.\nIt debuts June 25."
  },
  {
    "headline": "Brazil to Open Copa America Against Venezuela in Brasilia; Rio to Host Final",
    "summarized_story": "Hosts Brazil will open the Copa America with a game against Venezuela in the capital Brasilia while the final will be played at Rio de Janeiro’s Maracana stadium, the South American Football Confederation (CONMEBOL) said on Wednesday.\nThe Copa will go ahead, however, with Brazil kicking off Group B against Venezuela at the Mane Garrincha stadium on June 13.\nArgentina open their campaign at Rio’s Nilton Santos stadium against Chile on June 14.\nThe semifinals are scheduled for the Nilton Santos stadium on July 5 and the Mane Garrincha a day later.\nThe Maracana will host the final, the only match to be played there, on July 10."
  }
]