[
  {
    "headline": "Address poverty, insecurity for sustainable unity, Sultan tells leaders",
    "summarized_story": "The Sultan of Sokoto and President-General Nigeria Supreme Council for Islamic Affairs, Alhaji Sa’ad Abubakar III, has urged leaders in the country to fear Allah and support the citizens out of hardship.\n“Nigeria leaders need to strategies more measures to address our level of poverty and insecurity, as such will further sustain the unity and peaceful co-existence that is in existence in the country.\nIn his message, Governor Aminu Masari of Katsina State called on leaders to promote peace and unity among various nationalities irrespective of ethnic, religious, and political affiliations.\n“As leaders, we must emphasise things that would promote peace, unity, and mutual coexistence among the people,” he said.\nFrom Kano State, Governor Abdullahi Ganduje urged Muslims to pray for peace, unity, and stability in the country."
  },
  {
    "headline": "Mali interim leader safe after armed men attack -Presidency",
    "summarized_story": "An official at the presidency later said Goita was “safe and sound.”Goita arrived at the military camp of Kati, outside the capital, “where security has been reinforced,” the official said.\nThe shocking attack follows months of political turmoil in Mali, which is also battling a jihadist insurgency that has claimed thousands of lives and driven hundreds of thousands from their homes.\nRead Also– Jihadist insurgency –France, which has thousands of troops stationed in the war-torn country, also suspended military cooperation with Mali.\nThe military junta handed power to a civilian-led transitional government, which promised to restore civilian rule in February 2022.\nIt has been struggling to contain an jihadist insurgency that first emerged in the north of the country in 2012, and has since spread to Burkina Faso, Mali and Niger."
  },
  {
    "headline": "Delta community cries out over ramshackle NDDC road, collapsed classroom",
    "summarized_story": "*People boycott Umiaghwa because of deplorable road – David, community chair*Only 2 govt.\nteachers in our primary school- Johnson, residentBy Paul OlayemiRESIDENTS of Umiaghwa, Okpe Local Government Area, Delta State, have bitterly complained about the dilapidated road to the agrarian community abandoned in 2018 by the Niger-Delta Development Commission, NDDC, and a six-classroom built by the interventionist agency that collapsed, two years ago.\nThe villagers said they were forced to raise the alarm, as the shrunken school building and ramshackle road were beginning to have negative effect on the children and people of the community.\n“We are now managing the remaining four classroom blocks built by Delta State Oil- Producing Areas Development Commission, DESOPADEC, we now put pupils in the same classroom not minding their class.\nPeople boycott Umiaghwa owing to bad road –David, community chairThe community chairman, Mr. Idamakozi David, said their biggest fear in the community remains the uncompleted NDDC’s Oviri Okpe- Umiaghwa road project that was abandoned in 2018, urging the agency to compel the contracting firm handling the project to return to site, as people were running away from the community because of deplorable road."
  },
  {
    "headline": "60% of people admitted to UK hospitals with COVID-19 are double-jabbed",
    "summarized_story": "According to reports, the development comes as figures show most regions of England now have more coronavirus patients in hospital than at any point since mid-March.\nFor England as a whole, there are now 3,813 patients in hospital with COVID-19 – the highest number since 24 March.\nHe said the UK was quite close to the previous “winter wave” of infections.\n“In the winter wave, we were up to around 60,000 people testing positive per day,” he said.\n“And another doubling time will take you to even higher numbers, of course – that would be really quite, quite worrying."
  },
  {
    "headline": "3rd wave: Declare red alert nationwide, all states at risk, scientists tell FG",
    "summarized_story": "In separate chats, the medical experts who also called for the reactivation of COVID-19 response activities nationwide urged the government to be more proactive in its response to the pandemic.\n“I say declare Nigeria at the reddest alert, and not some states,” Tomori said.\nI consider that red alert as being half smart and proactive.”Insisting that all the states in the country are at risk, Ifeanyi said there is no limit or division between states like Lagos and other states.\n“You can see people from the red alert zone entering into other zones.\nAshiru who urged for strict compliance with the safety protocol said it is very worrisome the way the Delta variant has been spreading."
  },
  {
    "headline": "Dignitaries hail AbdulRasaq’s tolerance as Kwara holds peaceful Eid",
    "summarized_story": "Kwarans have appreciated Governor AbdulRahman AbdulRazaq for creating an atmosphere of peace, order and harmony for the conduct of Eid-el-Kabir and provision of modern water, sanitation and hygiene facilities at the expansive praying ground.\nThey seem to be deliberate in evolving a new state where no one is a victim of political witch-hunt,” an elder statesman said.\nMuslim congregants were heard commending the Governor for the conducive atmosphere and avoiding unnecessary rivalry or showmanship at the praying ground.\nMeanwhile the Ilorin praying ground has taken a new look amid construction of new inner roads leading to the Eid and provision of several pour-flush toilets and ablution points.\nThe facilities were provided by the AbdulRazaq administration to make the Eid ground more conducive for the people."
  },
  {
    "headline": "A’Ibom residents scream over gas outlets in inhabited areas",
    "summarized_story": "By Harris EmanuelRESIDENTS of Uyo, the Akwa Ibom State capital, and environs have called on the state government and relevant agencies to monitor closely the activities of gas vendors, especially in residential areas.\nThey raised their concerns following the proliferation of cooking gas dispense shops across the streets of Uyo metropolis and surrounding towns, given the inflammatory nature of gas.\nSpeaking with NDV, an inhabitant, Unyime Akpan said: “We are gradually moving away from fossil fuel but my worry is the proliferation of these gas vendors in residential areas.\nWe have heard of gas explosion and attendant loss of lives and property in other places.\n“The best option is to stick to the rules, when you want to open a gas dispense shop, follow the rules."
  },
  {
    "headline": "Address killing, kidnapping, banditry, others – Asiwaju Musulumi charges govt",
    "summarized_story": "Government and relevant stakeholders have been charged to address the issue of killings, banditry, kidnapping, ritualism and other wicked activities across the country.\nThis is just as Nigerians were implored to promote peaceful co-existence and unite to eradicate unnecessary killings through banditry, kidnapping and ritual engagements.\nThe Asiwaju Musulumi of Yorubaland, including Edo and Delta, Dr Khamis Olatunde-Badmus stated this in Osogbo in his message on the occasion of 2021 Eid-el-Kabir.\nHe said unnecessary taking of innocent lives invokes the anger of the creator and causes disruption in the land.\nThe Asiwaju Musulumi said Muslims should not only use the occasion of Eid-el-Kabir for celebration but also see it as a time of sober reflection on ways to pray to Allah to make Nigeria a better nation."
  },
  {
    "headline": "Kaduna residents celebrate Sallah, in spite of security threat, hardship",
    "summarized_story": "Kaduna residents on Tuesday came out en masse to pray for the improved condition of Nigeria and Kaduna State.\nAlthough they converged at the praying ground in accordance to COVID-19 protocols, they prayed aggressively against the security threat bedevilling the state before they all departed for their homes.\nThe Sallah celebrations in Kaduna State is one of its kind as both Muslims and adherents of other religions came together to have fun.\nIn a sermon delivered by the leader of Kajuru Muslims community, Alhaji Idris Mohammed, “we are pressed to add more aggressive prayers over the security threat to Kaduna state, security threat to the people and residents of the state.\nOver a week, I have been thinking how to get enough money to buy foodstuff to celebrate this Salah, but to no avail."
  },
  {
    "headline": "FG created Sunday Igboho, Nnamdi Kanu – Ex- Oyo Governor, Ladoja",
    "summarized_story": "A former Governor of Oyo State, Senator Rasidi Adewolu Ladoja, has said that it was the Federal Government of Nigeria that created Sunday Adeyemo, also known as Sunday Igboho, and Nnamdi Kanu.\nHe spoke further by saying that many people resulted into self help and that brought Sunday Igboho to result into self help.\nThat is why Sunday Igboho resulted into self help.\n“If Sunday Igboho is arrested today and the attitude does not change, many Sunday Igboho will surface.\n“If the situation is not well managed, many Kanu, Igboho will surface."
  },
  {
    "headline": "End SARS: Blood of innocent Nigerian youth will haunt you forever – Aisha Yesufu to Buhari",
    "summarized_story": "Aisha Yesufu, a popular rights activist, has declared that the blood of innocent citizens killed by Nigerian security operatives during the End SARS protests will continue to haunt President Muhammadu Buhari.\nThe protests later generated a call for the resignation of President Buhari; end of bad governance; demand for accountability by government officials, among other things.\nThe Federal Government had also listed the nationwide demonstration against the notorious Police unit, SARS, as one its reasons for banning Twitter.\n“The blood of the innocent youth we failed as a Nation shall haunt him till the end of time.\nIn his moment of rest he shall hear their wailing and the anguish of their families."
  },
  {
    "headline": "Eid-el Kabir: Buhari urged to urgently address ethnic agitations, insurgencies",
    "summarized_story": "The coalition’s call was contained in a message signed by its National Coordinator, Chief Emeka Kalu, congratulating Muslims on the commemoration of 2021 Eid-el Kabir, and was made available to DAILY POST on Tuesday morning.\nThe PDPCO said the steps would go a long way to entrench peace and create a sense of belonging for Nigerians.\nAccording to the coalition, “No nation records improvement in the face of crisis and Nigerians are tired of intra ethnic mayhem caused by the activities of the factors cited earlier.\nEid-el Kabir: Police assure adequate security in OsunThe PDPCO further explained that Nigeria is a country of diverse ethnic interests, but with manifold love for one another, rapid growth and unity of purpose will be tremendously achieved.\nEid-el Kabir: El-Rufai congratulates Muslims, urges them to uphold peace, harmony"
  },
  {
    "headline": "English Premier League footballer arrested in child sex inquiry",
    "summarized_story": "Agency ReporterAn English Premier League (EPL) footballer has been arrested on suspicion of child sex offences.\nThe player was arrested on Friday and interviewed by police before he was released on bail.\nIn a statement, Greater Manchester Police (GMP) said: “Officers arrested a man on Friday on suspicion of child sex offences.\nHe is on police bail pending further inquiries.”The footballer has been suspended by his club while the investigation continues.\nIt added that there was no sign of activity at the player’s home after he returned there from the police station on Friday night."
  },
  {
    "headline": "Chike’s ‘Running to You’ ft Simi becomes most viewed music video in 2021",
    "summarized_story": "By Ekaete BasseySinger and songwriter Chike-Ezekpeazu Osebuka, popularly known as Chike, has announced the video for his song “Running to you” with songstress Simi has hit a major milestone on YouTube.\nChike teamed up with Simi to make a remix for “Running”, which is a song off Chike’s album “Boo of the Booless” and originally featured only him.\nThe video was released on February 12, 2021 in anticipation of Valentine’s Day.\nThe video, which was directed by Pinkline Films, has hit a staggering 20 million views on YouTube, making it so far the most viewed Nigerian music video of 2021.\nThe “Roju” singer wrote:“Woke up to 20 million views on #RunningToYou with @symplysimi“Thanks to #ChikeClan & #SimiArmy, for making this the most viewed music video of 2021 yet… Congratulations.”"
  },
  {
    "headline": "Ogelle e-Learning will revolutionise education in Africa – Oparaugo",
    "summarized_story": "Our ReporterOgelle, Africa’s first user-generated video content platform, is set to revolutionise education in Africa with Ogelle e-Learning.\nOgelle e-Learning, which will be launched in the last quarter of 2021, comes against the backdrop of the urgent need to expand access to primary education and open the door to quality, relevant secondary education for Africans.\n“As a result, quality education is a central element in building an ‘Africa beyond aid’ and lies at the backbone of its development and enduring prosperity.\nQuality education also has a multiplier effect on achieving the 2030 Sustainable Development Goals,” he said.\n“We focused on the post-primary education school system because for most young Africans, secondary education is the last schooling they will receive before entering the workforce."
  },
  {
    "headline": "Dignitaries hail AbdulRasaq’s tolerance as Kwara holds peaceful Eid",
    "summarized_story": "ADVERTISEMENT“We are very impressed at the maturity of the Governor and his team.\nThey seem to be deliberate in evolving a new state where no one is a victim of political witch-hunt,” an elder statesman said.\nMuslim congregants were heard commending the Governor for the conducive atmosphere and avoiding unnecessary rivalry or showmanship at the praying ground.\nMeanwhile the Ilorin praying ground has taken a new look amid construction of new inner roads leading to the Eid and provision of several pour-flush toilets and ablution points.\nThe facilities were provided by the AbdulRazaq administration to make the Eid ground more conducive for the people."
  },
  {
    "headline": "JUST IN: Sunday Igboho may be paraded today",
    "summarized_story": "From Molly Kilete, AbujaThe agitator and leader of the Yoruba Nation, Sunday Adeyemo, commonly called Sunday Igboho, who was arrested late Monday night may be paraded by the Department of State Services (DSS), before the media today in Abuja.\nDaily Sun, reliably gathered that Igboho, who was arrested in Cotonou, Benin Republic, on his way to Germany, would be moved to the DSS headquarters upon his arrival to Nigeria.\nIt was gathered that the DSS may likely parade him before the media today or Thursday after the Sallah break.\nThe DSS is yet to issues a statement to confirm the arrest Sunday Igboho at the time of filing this report.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Zamfara: Court stops lawmakers from impeaching deputy gov",
    "summarized_story": "From Godwin Tsa, AbujaA Federal High Court in Abuja, yesterday, stopped the speaker of the Zamfara State House of Assembly and two others from proceedings with its planned impeachment of Deputy Governor, Mahdi Aliyu Gusau.\nAlso restrained by the interim order are the governor and the chief judge.\nJustice Obiora Egwuatu issued the order after listening to James Onoja, who moved an ex parte application filed by the Peoples Democratic Party (PDP).\nAccordingly, the judge ordered parties to maintain status quo ante bellum pending the hearing of a motion filed by the plaintiff.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Eid-el-Kabir: CAN, Govs, Atiku, Saraki, Arthur Eze, Tinubu, Rite Foods, others felicitate with Muslims",
    "summarized_story": "•Emulate Prophet Ibrahim’s resilience, patience –AbiodunGovernor Dapo Abiodun of Ogun State urged Muslims in the state to emulate the resilience, patience and steadfastness as well as absolute faith in Allah, as exemplified by Prophet Ibrahim.\nHe further urged Muslims to remember those who do not have and share the merriment with them.\n•Sanwo-Olu hails muslimsLagos State Governor, Babajide Sanwo-Olu also congratulated Nigerians, especially Muslims across the country.\nHe charged Muslims to use the period to deepen their relationship with Allah and pray for unity, peace and development of the state and Nigeria.\n•Tinubu calls for brotherly concernFormer Lagos governor and APC leader, Asiwaju Bola Tinubu, also urged Muslims to dedicate themselves to greater adherence and obedience to the compassionate and spiritually nourishing commands of Allah."
  },
  {
    "headline": "Eid-el-kabir: Nigerians groan over high cost of ram, rising food inflation",
    "summarized_story": "However, majority of Muslims have bemoaned the high cost of ram and cows and rising inflation of other foodstuff including rice, beans, yam, pepper, tomatoes and oil.\nThe situation was not different at the Mangoro ram market in Agege as average ram prices sold at N150,000.\nBut a ram seller at Kara market, Alhaji Musa Dodo, said another contributory factor was the high cost of transportation.\nIt was observed that while the average cost of cow was between N190,000 and N200,000, the average ram was sold for N40,000, unlike the previous year when the average cost of cow was N150,000 and ram N25,000.\nA financial journalist, Adeola Yusuf, in reaction to high cost of ram, said the embargo placed on Hajj rites this year by Saudi Arabia in a bid to curtail the spread of COVID-19 was responsible for surge in ram prices."
  },
  {
    "headline": "48 arrested Yoruba nation agitators released",
    "summarized_story": "By Lukman OlabiyiA Lagos State Magistrates’ Court in Yaba has granted bail to the 48 people arrested on July 3, 2021, in Ojota, during the awareness rally for the actualisation of Yoruba nation.\nThe Communications Manager for the umbrella body of Yoruba self-determination groups, Ilana Omo Oodua, Mr. Maxwell Adeleye, in a statement, yesterday, said the agitators would provide N300, 000 with two sureties each.\nOn July 17, Saturday Sun, in its exclusive report, predicted that the agitators would be released this week.\nOthers include Abiodun Taiwo, Adagunodo Babatunde, Oluwafemi Adeleye, Oloye Taiwo, Saheed Kareem, Adebayo Waheed, Akinbode Sunday, Lawal Akeem, Samuel Ire, Ogundile Dare, Oba Tajudeen Bakare.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "THISDAY Group Announces New Executive Appointments",
    "summarized_story": "Also, the Deputy Editor of THISDAY, Mr. Davidson Iriekpen, has been appointed Editor of THISDAY, the Sunday Newspaper, while the Editor of the Saturday Newspaper, Mr. Yemi Adebowale was reappointed on same position by the board.\nSimilarly, Mr. Olawale Olaleye, who was the Deputy Editor of the Sunday Newspaper was promoted to the position of Deputy Editor of THISDAY, just as the Group Business Editor, Mr. Obinna Chima was also promoted to the position of the Deputy Editor of THISDAY.\nThe Capital Market Editor, Mr. Goddy Egene was also promoted to the position of Group News Editor, while the Maritime Editor, Mr. Eromosele Abiodun is the new Group Business Editor.\nChima joined THISDAY in 2010 as a Business Correspondent and was appointed Group Business Editor in 2018.\nHe had held the positions of Judicial Editor, Editor, House of Representatives as well as covered the Presidential Villa, Abuja from where he was posted to the Saturday Desk as News Editor, before the current promotion."
  },
  {
    "headline": "Irabor Hails Pilot of Downed Fighter Plane for His Bravery, Gallantry",
    "summarized_story": "Irabor, who met the pilot in company with the Chief of the Air Staff, Air Marshal Oladayo Amao, before proceeding to a meeting with military veterans in the North-west, commended the pilot for the gallantry and bravery he demonstrated in the fight against banditry.\nEarlier, the NAF had announced the crashing of a fighter jet in Zamfara State while returning from an interdiction mission.\nLuckily, the gallant pilot of the aircraft, Flight Lieutenant Abayomi Dairo, successfully ejected from the aircraft.\n“Before proceeding for the security parley, the CDS, Gen Irabor, in company of the Chief of the Air Staff, Air Marshal Oladayo Amao, met with Flight Lieutenant Abayomi Dairo, the NAF Alpha jet pilot, who survived the air crash yesterday.\n“The CDS commended the fighter pilot for his gallantry and bravery, which he demonstrated in the fight against banditry."
  },
  {
    "headline": "NAF Fighter Jet Crashes in Zamfara, Pilot Survives",
    "summarized_story": "Kingsley Nwezeh in AbujaA Nigerian Air Force fighter jet crashed on Sunday in Zamfara State while returning from an interdiction mission.\nA statement issued by the Spokesman of the Nigerian Air Force, Air Commodore Edward Gabkwet, said the aircraft came under enemy fire, forcing the pilot, Flt.\nIt said the crash occured on July 18, 2021 at 12.45pm while the Alpha Jet Aircraft was returning from a successful air interdiction mission between the boundaries of Zamfara and Kaduna State.\nLuckily, the gallant pilot of the aircraft, Flight Lieutenant Abayomi Dairo, successfully ejected from the aircraft.\n“Accordingly, NAF Intelligence Surveillance Reconnaissance 0(ISR) platforms and helicopter gunships provided close air support to NAF."
  },
  {
    "headline": "OPEC+ Resolves Impasse, to Boost Production by 400,000bpd",
    "summarized_story": "OPEC welcomed the positive performance of participating countries in the Declaration of Cooperation (DoC), especially their overall conformity to the production adjustments which was out 113 per cent in June.\nAlso, Saudi Arabia’s baseline was raised from 11 million bpd to 11.\n5 million bpd, UAE had theirs raised from 3.168 million bpd to 3.5 million bpd and Russia’s was put at 11.5 million bpd from 11 million bpd.\nHe added: “Many countries, like Nigeria, would not have been able to develop their oil industry due to stiff competition.\nHowever, the good collaboration between OPEC member countries has made it possible to accommodate both the weak and strong players in the oil production industry."
  },
  {
    "headline": "PDP Asks Supreme Court to Sack Matawalle, Defected Zamfara Lawmakers",
    "summarized_story": "The new suit, filed solely by the PDP as the petitioner/plaintiff, is different from the one filed at the Federal High Court in Abuja by members of the PDP in Zamfara State, seeking to the removal of the governor.\nFemi Gbajabiamila; the Chief Judge of Zamfara State and the Speaker of the Zamfara State House of Assembly, as defendants.\nThe speaker of the state House of Assembly, Matawalle and the state chief judge are the fifth to seventh defendants respectively.\nIn the suit, the PDP asks the Supreme Court to declare vacant the seats of all its members in the National Assembly and Zamfara State House of Assembly that defected to the APC.\nIn court documents obtained by THISDAY at the weekend, the PDP is seeking a declaration that “sequel to the decision of the Supreme Court in SC."
  },
  {
    "headline": "EXCLUSIVE: Yoruba Freedom Fighter, Sunday Igboho Arrested in Cotonou",
    "summarized_story": "Yoruba freedom fighter, Sunday Adeyemo, popularly known as Sunday Igboho, has been arrested in Cotonou, Benin Republic by security operatives in the West African country.\nIgboho was arrested Monday night after fleeing Nigeria to evade arrest by Nigeria's secret police.\nHe was, however, nabbed by security operatives in the neighboring country.\nSpeaking with SaharaReporters, a source privy to the incident, said, \"Sunday Igboho has been arrested in Cotonou.\nHe was arrested by security operatives in Cotonou."
  },
  {
    "headline": "EXCLUSIVE: Yoruba Freedom Fighter, Sunday Igboho Arrested in Cotonou",
    "summarized_story": "Yoruba freedom fighter, Sunday Adeyemo, popularly known as Sunday Igboho, has been arrested in Cotonou, Benin Republic by security operatives in the West African country.\nIgboho was arrested Monday night after fleeing Nigeria to evade arrest by Nigeria's secret police.\nHe was, however, nabbed by security operatives in the neighboring country.\nSpeaking with SaharaReporters, a source privy to the incident, said, \"Sunday Igboho has been arrested in Cotonou.\nHe was arrested by security operatives in Cotonou."
  },
  {
    "headline": "REVEALED: Details Of Autopsy Report Of Lagos Teenager Killed During Yoruba Nation Rally",
    "summarized_story": "An autopsy conducted on a young girl, Jumoke Oyeleke, who was hit by a stray bullet during the Yoruba Nation rally in Lagos has been obtained by SaharaReporters.\nThis was after the Lagos State Commissioner of Police, CP Hakeem Odumosu, had addressed newsmen at the venue, where he announced that no rally is allowed in the state.\nThis displeased the security operatives at the venue who fired teargas canisters and used water cannons to disperse the crowd.\nThe next action from the security operatives had everyone at the rally scampering to safety as gunshots sounded from different directions.\nShe was reported to have been hit by a stray bullet when security operatives were dispersing the crowd at the rally."
  },
  {
    "headline": "REVEALED: Details Of Autopsy Report Of Lagos Teenager Killed During Yoruba Nation Rally",
    "summarized_story": "An autopsy conducted on a young girl, Jumoke Oyeleke, who was hit by a stray bullet during the Yoruba Nation rally in Lagos has been obtained by SaharaReporters.\nThis was after the Lagos State Commissioner of Police, CP Hakeem Odumosu, had addressed newsmen at the venue, where he announced that no rally is allowed in the state.\nThis displeased the security operatives at the venue who fired teargas canisters and used water cannons to disperse the crowd.\nThe next action from the security operatives had everyone at the rally scampering to safety as gunshots sounded from different directions.\nShe was reported to have been hit by a stray bullet when security operatives were dispersing the crowd at the rally."
  },
  {
    "headline": "BREAKING: Armed Men Attack Mali’s Interim President, Goïta In Bamako Mosque",
    "summarized_story": "Two armed men, including one wielding a knife, attacked Mali's interim president Assimi Goïta on Tuesday in the Great Mosque in the capital Bamako.\nThe attack took place during prayers for the Islamic festival of Eid al-Adha, an AFP journalist who witnessed the event said.\nLatus Toure, the director of the Great Mosque, said an attacker had lunged for the president but wounded someone else.\nColonel Goïta led a coup last August, ousting elected president Ibrahim Boubacar Keita after weeks of mass protests over corruption and the long-running jihadist conflict.\nHe was then named transitional president, but has pledged to keep to the goal for returning to civilian government."
  },
  {
    "headline": "Oil prices plunge below $70 on fears COVID-19 Delta variant will dent demand",
    "summarized_story": "Oil prices tumbled below $70 as traders grappled with the demand implications of COVID-19 Delta variant spreading globally, as some countries plan reintroduction of lockdown measures to curb the highly contagious new strain.\nThe decline follows the agreement reached by the Organization of the Petroleum Exporting Countries and allies (OPEC+) to increase oil production by 400,000 barrels per day starting from August 2021.\nAlthough the OPEC+ deal is expected to see prices rise again to its pre-pandemic levels, the new strain would hit demand for oil.\nHowever, it said oil prices are expected to gyrate in the coming weeks due to the risks from the new COVID-19 strain and the slower velocity of supply developments relative to recent mobility gains.\nAdvertisementIn a press conference on Monday, Abdulaziz bin Salman, Saudi energy minister, said Nigeria and Algeria could also see their baseline production revised."
  },
  {
    "headline": "Oil prices plunge below $70 on fears COVID-19 Delta variant will dent demand",
    "summarized_story": "Oil prices tumbled below $70 as traders grappled with the demand implications of COVID-19 Delta variant spreading globally, as some countries plan reintroduction of lockdown measures to curb the highly contagious new strain.\nThe decline follows the agreement reached by the Organization of the Petroleum Exporting Countries and allies (OPEC+) to increase oil production by 400,000 barrels per day starting from August 2021.\nAlthough the OPEC+ deal is expected to see prices rise again to its pre-pandemic levels, the new strain would hit demand for oil.\nHowever, it said oil prices are expected to gyrate in the coming weeks due to the risks from the new COVID-19 strain and the slower velocity of supply developments relative to recent mobility gains.\nAdvertisementIn a press conference on Monday, Abdulaziz bin Salman, Saudi energy minister, said Nigeria and Algeria could also see their baseline production revised."
  },
  {
    "headline": "Banji Akintoye: We've mobilised lawyers to fight Igboho's extradition from Benin Republic",
    "summarized_story": "Banji Akintoye, renowned historian and leader of Yoruba Self-determination Group, says the group has mobilised people from Nigeria to prevent the extradition of Sunday Igboho from Benin Republic to Nigeria.\nAdvertisementIgboho was arrested in Cotonou, Benin Republic, on Monday, and he is believed to held in the country pending completion of extradition processes between Nigeria and the Francophone country.\n“I received last night the troubling information that Chief Sunday Adeyemo fondly called Igboho had been arrested at the Cotonou Airport,” Akintoye said.\n“Fortunately, Benin Republic is reliably a land of law where the authorities responsibly obey the law.\nWe all know he has committed no crime.”Akintoye said some people are trying to eliminate Igboho because he stood up to fight against the oppression of his people."
  },
  {
    "headline": "Banji Akintoye: We've mobilised lawyers to fight Igboho's extradition from Benin Republic",
    "summarized_story": "Banji Akintoye, renowned historian and leader of Yoruba Self-determination Group, says the group has mobilised people from Nigeria to prevent the extradition of Sunday Igboho from Benin Republic to Nigeria.\nAdvertisementIgboho was arrested in Cotonou, Benin Republic, on Monday, and he is believed to held in the country pending completion of extradition processes between Nigeria and the Francophone country.\n“I received last night the troubling information that Chief Sunday Adeyemo fondly called Igboho had been arrested at the Cotonou Airport,” Akintoye said.\n“Fortunately, Benin Republic is reliably a land of law where the authorities responsibly obey the law.\nWe all know he has committed no crime.”Akintoye said some people are trying to eliminate Igboho because he stood up to fight against the oppression of his people."
  },
  {
    "headline": "Cholera kills seven more people in Enugu",
    "summarized_story": "Seven more people have died of cholera in Enugu state.\nAdvertisementIkechukwu Obi, Enugu commissioner of health, had in a statement on Friday said seven people died of cholera around New Artisan market in the state.\n“Seven persons died initially on Saturday, but as of Monday, seven more deaths were confirmed, raising the fatality to 14,” he said.\nAdvertisementHe said many of the patients were taken to Enugu State University Teaching Hospital, while others were taken to a private hospital in the city.\nThe cholera outbreak has been confirmed in several states, including the federal capital territory (FCT), Benue, Delta, Zamfara, Bauchi, Kano, Niger, Kaduna, Plateau, Nasarawa, Gombe, Bayelsa and Kebbi."
  },
  {
    "headline": "Senegal to produce rapid Covid tests in tech deal with major biotech companies",
    "summarized_story": "The Pasteur Institute in Senegal will produce rapid antigen tests for diagnosing the coronavirus disease from early 2022 with the help of a new tech transfer agreement.\nAn antigen test is regarded as a suitable ‘first line of defense’ against the coronavirus disease for individuals who have symptoms.\nIt plans to make 2.5 million tests per month in 2022, according to the statement.\nHowever, the rapid antigen test deal involving the Pasteur Institute comes at a time when Senegal is grappling with soaring coronavirus cases.\nAccording to health ministry spokesman Mamadou Ndiaye, the West African nation was seeing an “unprecedented” surge in Covid infections."
  },
  {
    "headline": "Hundreds of MTN, Vodacom towers damaged in South Africa unrest",
    "summarized_story": "Telecommunications infrastructure owned by several mobile network operators was severely damaged in the rampant looting and destruction of property that rocked South Africa last week.\nThe Independent Communications Authority of South Africa (ICASA) revealed on Tuesday, July 13, that the vandalism included more than 100 mobile network towers in some parts of the country.\nVirtually all network providers operating in South Africa reported disruption to service delivery.\nChildren are evacuated from a burning building in downtown Durban, South Africa.\nJust one of its network towers was vandalised within the Durban area but it did not affect service delivery to consumers."
  },
  {
    "headline": "The Next Wave: What’s happening in francophone Africa?",
    "summarized_story": "Unique and untappedFrancophone Africa is home to an island country where many African startups register their headquarters.\nBetween 2015 and 2019, startups and SMEs in francophone Africa received $417.9 million, according to Briter Bridges, a research firm.\nGozem, a ride-hailing company which also offers ecommerce services, launched in Gabon, its third francophone country, this year with eyes on Cameroon and Dr Congo.\nFrancophone Africa is dogged by lack of clarity around regulations, language barriers and limited networking opportunities, per Briter Bridges report.\nThese concerns will take some time to quell, so maybe unicorn bells won’t ring in francophone Africa anytime soon."
  },
  {
    "headline": "Why food-on-demand can be Gokada’s ticket to super app stardom",
    "summarized_story": "But in its boldest step since it was founded in January 2018 by Fahim Saleh, Gokada now identifies as a super app.\nGokada’s super app is entering the market at a time when Lagos residents are consuming ₦5 trillion ($12 billion) worth of food annually.\nSo why a super app?\nLike Grab in Singapor and Gozem in francophone Africa, Gokada’s super app journey started with transportation | Graphic by Boluwatife Sanso/TC InsightsBut as Yinka Adegoke explained in this insightful piece, apps become super by offering essential services within large markets.\nPerfecting this cycle also means paying attention to renowned global food delivery services like Doordash, Grubhub, UberEats and Deliveroo."
  },
  {
    "headline": "Obi Cubana: Lessons in entrepreneurship, Africapitalism?",
    "summarized_story": "Obi Cubana has created a national sensation but what lessons can we learn from this about entrepreneurship and how Africans live capitalism?\nIn the case of Obi Cubana, a number of key lessons are drawn from Obi’s business activities.\nBorn on April 12, 1975, in Oba, Anambra State, Obi Iyiegbu (Obi Cubana) attended Secondary school Onitsha and the University of Nigeria Nsukka with a degree in Political Science in 1988.\nIn 2006, Obi Cubana started his first business, Ibiza Club in Abuja, seeking to satisfy fun seekers and nightlife lovers.\nCubana group businesses and establishments include; Rolex Hotels – Lagos, Pablo Cubana – Lagos, Crave Cubana – Abuja, Grand Cubana Hotels – Abuja, Opium Cubana – Owerri, Cubana Night Clubs – Lagos, and Gustavo Cubana- EnuguThe businessman is currently working on opening more clubs worldwide with the planned opening of one in Dubai and a Cubana real estate company."
  },
  {
    "headline": "Crude heist, petrol subsidy, anatomy of revenue leakages",
    "summarized_story": "Nigeria’s oil sector is bleeding money on account of the activities of oil thieves and government’s obsession with subsidising petrol, a loss that could top N3.5 trillion by year end.\nData obtained by BusinessDay found that Nigeria’s daily consumption of Premium Motor Spirit (PMS) – petrol – is currently at an unsustainable level of 103…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Delta Covid riskier: Evades immunity, vaccines",
    "summarized_story": "Like a new sheriff in town, the latest coronavirus variant, Delta, is sweeping through the world with a fierce attack on immunity acquired through either infection or vaccination.\nThe third wave in South Africa, along with neighbouring Namibia, seems to be the worst yet, attributable to the Delta variant as they see up to 30,000 average new cases.\nIn Uganda, the variant was detected in 97 percent of samples while 136 students tested positive for this COVID-19 variant in Ghana.\nSerums from convalescent patients collected up to 12 months post symptoms were fourfold less potent against the Delta variant, relative to the Alpha variant (B.1.1.7).\nSerum from individuals having received one dose of Pfizer or AstraZeneca vaccines barely inhibited the Delta Variant."
  },
  {
    "headline": "Edo residents applaud Vigilante network on improved security – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Residents in Edo have commended the Edo State Vigilante and Security Network for working assiduously to provide security across the state in collaboration with other security agencies in the state.\nA cross-section of residents across the state, who spoke to journalists, said the formation and deployment of the vigilante teams across communities in the state have improved surveillance and intelligence gathering in the state.\nAccording to him, “A unique feature of the vigilante network is the fact that members of the community are co-opted into the scheme and made responsible to work with other agencies to secure their neighborhood.\nHe said: “A lot of people are now more interested in what happens around them because they are co-opted into the vigilante network.\nThis generally improves the security in the area.”The Obaseki-led administration set up the security network in the aftermath of the #ENDSARS protest last year to boost security and community policing in the state."
  },
  {
    "headline": "Buhari extols sacrifices of Nigerians, urges patience as govt addresses hardship – Nigerian Observer",
    "summarized_story": "The President’s Senior Special Assistant on Media and Publicity, Malam Garba Shehu, in a statement on Monday in Abuja, said Buhari stated this in his Eid-el-Kabir message to Nigerians.\nThe News Agency of Nigeria (NAN) reports that the occasion of Eid-el-Kabir is being celebrated across the world.\nAccording to him, this has further undermined government’s efforts of supporting local food production at affordable prices.\nBuhari reassured Nigerians that his administration had taken measures to address the nation’s security challenges.\nLet us expose undesirable elements among us who are creating security problems for the country,’’ the president further appealed to Nigerians."
  },
  {
    "headline": "President Buhari directs institutions to revive agric sector – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestDAURA (KATSINA STATE) – President Muhammadu Buhari has directed all agric-related institutions and agencies in the country to revive the nation’s agricultural sector.\nBuhari gave the order while inaugurating the National Land Agricultural Development Agency (NALDA) Integrated Farm Centre at Suduje, near Daura, in Daura Local Government Area of Katsina State, on Monday.\nHe stated that the revitalisation would promote food security and provide employment for the teeming populace.\nAminu Masari of Katsina state for donation of 100 hectares of land for establishment of the NALDA Farm Centre in Sujude.\nThe News Agency of Nigeria (NAN) reports that the NALDA farm centre has modern facilities, including school, clinic, market training centre and administration block."
  },
  {
    "headline": "RCCG Pastor Dies While Separating Fight Between Husband And Wife In Imo State – Nigerian Observer",
    "summarized_story": "According to a witness, the incident started around 4 pm when Obum’s wife, Ogechi, and her one-year-old son were heard screaming for help, thereby prompting the RCCG Pastor Onyekuru and others to wade in to prevent Obum from killing his wife.\n“As the crowd intensified effort to rescue the woman, Obum with a knife, threatened to kill anyone who tried to stop his action,” one of the witnesses said.\nBut as Onyekuru made his way to go, Obum used the knife to stab him at the back.\nWhile the pastor died immediately after reaching the hospital, Obum and his wife died later.\nCharles Anozie who confirmed the incident said Obum and the pastor were taken to the hospital where they later died."
  },
  {
    "headline": "Buhari’s aides, Akwa Ibom govt exchange words over new federal university",
    "summarized_story": "An aide to President Muhammadu Buhari, Ita Enang, has exchanged words with the Akwa Ibom State Government over the location for a newly approved federal university of technology for the state.\n“I have considered his action as improper, imprudent and not acting as governor of Akwa Ibom State.\n‘Enang is seeking attention’The Akwa Ibom State Government has, however, dismissed Mr Enang’s claim that he facilitated the establishment of the university.\nIkot Abasi, a coastal town, is also home to the moribund Aluminium Smelter Company of Nigeria and the Akwa Ibom State government-owned Ibom Power Plant.\nThe new university in Akwa Ibom was one of the four specialised universities approved by President Buhari in June."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "BREAKING: Armed men attack Mali interim president, Goita",
    "summarized_story": "Two armed men, including one who wielded a knife, attacked Mali’s interim president Assimi Goita on Tuesday in the great mosque in the capital Bamako, an AFP journalist saw.\nReligious Affairs Minister Mamadou Kone told AFP that a man had “tried to kill the president with a knife” but was apprehended.\nLatus Toure, the director of the Great Mosque, said an attacker had lunged for the president but wounded someone else.\nColonel Goita led a coup last August, ousting elected president Ibrahim Boubacar Keita after weeks of mass protests over corruption and the long-running jihadist conflict.\nHe was then named transitional president, but has pledged to keep to the goal for returning to civilian government."
  },
  {
    "headline": "Bitcoin plunged below $30,000 amid fears over Delta Covid variant",
    "summarized_story": "Leading cryptocurrency, Bitcoin on Tuesday, fell below $30,000 again as investors worldwide fret about the Delta variant and what it means for the next stage of the coronavirus pandemic.\nBitcoin was last trading at about $29,800 per coin on Tuesday, its lowest level since last month, CNN reported.\nThe fall comes after Wall Street was hit hard Monday by anxiety over the recent spread of Covid-19 and the threat it poses to the economic recovery.\nIn June, bitcoin (XBT) plunged below $30,000 for the first time since late January.\nThe latest drop came as investors worried about the impact of the Delta variant on the reopening of the global economy."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Yoruba Nation agitator Sunday Igboho arrested",
    "summarized_story": "Yoruba Nation agitator, Sunday Adeyemo also known as Sunday Igboho, has been arrested in Cotonou, the Republic of Benin.\nHe was arrested at an airport in Cotonou on Monday night, reports said.\nThe Nigerian secret police had raided Igboho’s Ibadan residence in the Soka area on July 1, 2021, arrested about 12 of his aides and killed two of them in a gun duel.\nThe Federal Government of Nigeria had placed the Nigeria Immigration Service and the Nigeria Customs Service on alert to stop Igboho from leaving the country.\nAfunanya, at a briefing on July 1, 2021, had vowed that “Igboho may run as far as he can."
  },
  {
    "headline": "Nigerian Singer, IB Rockey, Out With ‘One Life’",
    "summarized_story": "All is set for the take-off of fast rising artiste, Ibrahim Oriyomi Jimoh, a.k.a IB Rockey, is optimistic about hitting the Nigerian music airwaves in no time.\nThe Ilorin, Kwara State born artiste, who is Lagos based, and recently featured Barry Jhay in his latest single ‘One Life’, is beginning to make the rounds on all digital platforms.\nMusic became his thing early on even though his name didn’t pop on the charts until 2020, majorly because the young man was braving his way through other business endeavours.\nIB Rockey was born and bred in Lagos into a modest family.\nIB Rockey is a man of talent, focus and determination."
  },
  {
    "headline": "Nigerian Singer, IB Rockey, Out With ‘One Life’",
    "summarized_story": "All is set for the take-off of fast rising artiste, Ibrahim Oriyomi Jimoh, a.k.a IB Rockey, is optimistic about hitting the Nigerian music airwaves in no time.\nThe Ilorin, Kwara State born artiste, who is Lagos based, and recently featured Barry Jhay in his latest single ‘One Life’, is beginning to make the rounds on all digital platforms.\nMusic became his thing early on even though his name didn’t pop on the charts until 2020, majorly because the young man was braving his way through other business endeavours.\nIB Rockey was born and bred in Lagos into a modest family.\nIB Rockey is a man of talent, focus and determination."
  },
  {
    "headline": "EXCLUSIVE: How Sunday Igboho Was Arrested In Cotonou",
    "summarized_story": "Sunday Igboho, was arrested in Cotonou, Benin Republic on Monday night.\nA source confided in our reporter that Igboho initially escaped before he was finally rearrested by the Beninese police.\nHe is at the moment with the Brigade criminelle in Cotonou,” the security source said.\nAnother source earlier told LEADERSHIP that Igboho had presented a Beninese Passport to officials at the l’aéroport international Bernadin Gantin in Cotonou to travel to Germany when he was identified.\n“We have strict laws here in Benin Republic."
  },
  {
    "headline": "EXCLUSIVE: How Sunday Igboho Was Arrested In Cotonou",
    "summarized_story": "Sunday Igboho, was arrested in Cotonou, Benin Republic on Monday night.\nA source confided in our reporter that Igboho initially escaped before he was finally rearrested by the Beninese police.\nHe is at the moment with the Brigade criminelle in Cotonou,” the security source said.\nAnother source earlier told LEADERSHIP that Igboho had presented a Beninese Passport to officials at the l’aéroport international Bernadin Gantin in Cotonou to travel to Germany when he was identified.\n“We have strict laws here in Benin Republic."
  },
  {
    "headline": "Eid-el-Kabir: CAN, NIREC Felicitate With Muslim Ummah",
    "summarized_story": "The Christian Association of Nigeria (CAN) has felicitates with the leadership of the Nigerian Supreme Council for Islamic Affairs (NSCIA) and Muslim faithful as they celebrate this year’s Eid-el-Kabir festival.\nAccording to the statement signed by the National CAN’s General Secretary, Daramola Bade Joseph.\nThey should also use the occasion to pray for Nigeria to come out of these insecurity challenges better and greater.\nADVERTISEMENTIn the same vein, the Nigerian Inter-Religious Council (NIREC) has also felicitates with the Muslim Ummah on the occasion of the Eid-el-Kabir celebration.\nAccording to the statement signed by the NIREC’s executive secretary Fr."
  },
  {
    "headline": "Child sex allegation: Premier League footballer arrested",
    "summarized_story": "An English Premier League footballer has been arrested on suspicion of child sex offences.\nThe player was arrested on Friday and interviewed by police before he was released on bail.\nIn a statement, Greater Manchester Police said, “Officers arrested a man on Friday on suspicion of child sex offences.\nHe is on police bail pending further inquiries.”The footballer has been suspended by his club while the investigation continues.\nIt added that there was no sign of activity at the player’s home after he returned there from the police station on Friday night."
  },
  {
    "headline": "Child sex allegation: Premier League footballer arrested",
    "summarized_story": "An English Premier League footballer has been arrested on suspicion of child sex offences.\nThe player was arrested on Friday and interviewed by police before he was released on bail.\nIn a statement, Greater Manchester Police said, “Officers arrested a man on Friday on suspicion of child sex offences.\nHe is on police bail pending further inquiries.”The footballer has been suspended by his club while the investigation continues.\nIt added that there was no sign of activity at the player’s home after he returned there from the police station on Friday night."
  },
  {
    "headline": "Police arrest movie star’s hubby for producing, broadcasting porn online",
    "summarized_story": "Mumbai police have arrested Bollywood star Shilpa Shetty’s husband Raj Kundra for allegedly producing and broadcasting pornographic films online, six years after the businessman was banned from cricket-related activities over match-fixing charges.\nPolice announced Kundra’s arrest late Monday, calling the 45-year-old “the key conspirator” in a case involving the creation and publication of adult films via internet apps.\n“We have sufficient evidence regarding this,” police said in a press release, adding that investigations were ongoing.\nThe arrest is the latest scandal to hit Kundra, who has two children with Shetty, the 2007 winner of British reality show “Celebrity Big Brother”.\nIndia has stringent laws against publishing and transmitting “obscene material”, but watching pornography in private is legal."
  },
  {
    "headline": "Police arrest movie star’s hubby for producing, broadcasting porn online",
    "summarized_story": "Mumbai police have arrested Bollywood star Shilpa Shetty’s husband Raj Kundra for allegedly producing and broadcasting pornographic films online, six years after the businessman was banned from cricket-related activities over match-fixing charges.\nPolice announced Kundra’s arrest late Monday, calling the 45-year-old “the key conspirator” in a case involving the creation and publication of adult films via internet apps.\n“We have sufficient evidence regarding this,” police said in a press release, adding that investigations were ongoing.\nThe arrest is the latest scandal to hit Kundra, who has two children with Shetty, the 2007 winner of British reality show “Celebrity Big Brother”.\nIndia has stringent laws against publishing and transmitting “obscene material”, but watching pornography in private is legal."
  },
  {
    "headline": "Faces of Indianapolis shooter Brandon Scott Hole",
    "summarized_story": "By AbankulaPolice authorities in Indianapolis on Friday released the photo of Brandon Scott Hole, the 19-year-old former FedEx worker, who killed eight people Thursday night.\nThe release of his photo corrected false images of the shooter earlier published in the social media.\nHole went on a shooting spree at the FedEx facility before turning the gun on himself.\nAccording to reports, he last worked for FedEx in 2020.\nCops still don’t know his motive and where he got the rifle he used."
  },
  {
    "headline": "Breaking: Gunmen kidnap Ekiti monarch David Oyewumi",
    "summarized_story": "By Ariwodola Idowu/Ado EkitiAn Ekiti monarch, Oba David Oyewumi, the Obadu of Ilemeso in Oye Local Government Area (LGA) of the state, has been kidnapped by gunmen, the police said.\n“Yes, the incident happened yesterday, (Thursday night) at the Oba’s palace.\nThey said the incident happened at about 8.30 p.m. on Thursday night when the chiefs who visited the place had left.\nIlemeso is a neighbouring town to Isan Ekiti, country home of Gov.\nOba Adetutu Ajayi, the Elewu of Ewu Ekiti, narrowly escaped kidnap at Isan Ekiti, last week on the Ewu-Ayetoro road."
  },
  {
    "headline": "We’re Working To Stop Sunday Igboho’s Extradition To Nigeria – Akintoye",
    "summarized_story": "Leader of the umbrella body of Yoruba self-determination groups, Ilana Omo Oodua, Professor Banji Akintoye, has confirmed the arrest of freedom fighter Sunday Adeyemo, popularly called Sunday Igboho, in Benin Republic.\nAkintoye said he received the information on Monday night, adding that plans are already underway to provide him with reliable legal services to prevent his extradition to Nigeria.\nAkintoye said the plans are being made alongside other Yoruba patriots who are immediately available,In a statement personally signed by him, Akintoye called on all Yoruba people within and beyond the shores of Nigeria to come out and ensure that their ancestral land is not defeated by invaders.\n“I received last night the troubling information that Chief Sunday Adeyemo, fondly called Igboho, had been arrested at the Cotonou Airport.\n“We Yoruba nation is, by the grace of God, a very strong nation."
  },
  {
    "headline": "Tension In South-West Over Sunday Igboho’s Arrest",
    "summarized_story": "The arrest of Sunday Adeyemo, also known as Sunday Igboho, has heightened tensions in Nigeria’s South-West area.\nResidents should avoid volatile locations, according to a security alert reviewed by NEWS DIRECT Tuesday morning.\nAt various instances, the president and the Department of State Services (DSS) intimated that the secessionist would be arrested.\nEarlier, the DSS promised that the loud separatist will be imprisoned at a press conference when weapons discovered in Igboho’s home were shown.\nPeter Afunanya, the spokesman, said Igboho may run and hide as long as he wants, “the end of his shenanigans” was certain."
  },
  {
    "headline": "“They Can Arrest Sunday Igboho But Can’t Arrest Terrorists,” Deji Adeyanju Slams Buhari",
    "summarized_story": "Deji Adeyanju, an Abuja-based activist, has chastised President Muhammadu Buhari for arresting Yoruba freedom fighter Sunday Adeyemi, also known as Igboho.\nAdeyanju chastised Buhari for apprehending Igboho but failing to apprehend terrorists responsible for the deaths of Nigerians in the north.\nIgboho was detained at a Cotonou airport on Monday night while attempting to fly to Germany, according to reports.\nDeji Adeyanju tweeted, “BREAKING: Jobless Buhari regime arrest Sunday Igboho in Cotonou.\n“But they can’t arrest terrorists who kill people weekly and even shoot down our fighter jets."
  },
  {
    "headline": "Nigerians React To Sunday Igboho’s Arrest In Benin Republic",
    "summarized_story": "Nigerians have taken to social media to react to the reports of Yoruba Nation agitator, Sunday Igboho’s arrest in Cotonou, Benin Republic.\nA source revealed that Igboho’s intention was to travel to Germany and leave Africa through Cotonou so as to evade arrest.\nSeveral reactions have been coming in hours after Igboho’s arrest.\n#BuhariMustGo #RevolutionNow”Reno Omokri wrote: “The reported arrest of Sunday Igboho in Cotonou is unfortunate.\nBut its easy to deploy soldiers to arrest Freedom Fighters and protesters who is fighting for the good interest of the people."
  },
  {
    "headline": "Pictures: Taekwondo athlete, Elizabeth Anyanacho, in first training session at Kisarazu Japan days to Olympics battle",
    "summarized_story": ""
  },
  {
    "headline": "VIDEO: In Tokyo, Elizabeth Anyanacho, officials receive Taekwondo brand new gears, kits for Olympics",
    "summarized_story": "Taekwondo star Elizabeth Anyanacho alongside Olympian Chika Chukwumerije and Secretary General Kabir Yusuf on Friday recieved and unveiled brand new gears and kits from South Korea.\nBranded by Motor company, Olympian to be Anyanacho currently at her training camp in Japan later wore and displayed the wears.\nAn excited Anyanacho while expressing her feeling said, “Yea, it looks good.\nI can’t wait to train and get ready for the contest.”"
  },
  {
    "headline": "Subsidy saga: Govt’s stance, citizens’ dilemma",
    "summarized_story": "Alas, it was not too long before the government reverted to status quo with the NNPC once again funding subsidy.\nThe actual consumption of petroleum products in Nigeria is also not ascertained to determine the amount of subsidy the Nigeria government pays to importers.\n“The NNPC refineries have been running below capacity for over 20 years and the government has not done anything about it.\n“The petroleum products directly impact the daily living of Nigerians and removal of subsidy without commensurate cushion will increase the hardship in the country,” he said.\nRegrettably, the Nigerian State is complicit and remains the number one stumbling block to finding solutions to the subsidy saga."
  },
  {
    "headline": "FG flags off construction of Kaduna Kano segment of Lagos-Kano Railway -NigPilot",
    "summarized_story": "Federal Government has flagged off the construction of the Kaduna-Kano segment of the Lagos-Kano railway modernization project.\nHe said, “This project is crucial to the establishment of a supply chain in railway transport within its corridor, Kano – Kaduna – Abuja, as it links the major commercial cities of Kano and Kaduna to the Federal Capital Territory, Abuja”.\nHe said “The scope of the railway project involves a 203km double track standard gauge railway from Kano to Kaduna.\nThis railway line will present an opportunity for Nigerians to traverse between Abuja and Kano via Kaduna with relative ease”.\nThe Kaduna – Kano railway project is to link the Lagos – Ibadan Railway project via Abuja, Minna, Ilorin, Oshogbo, Ibadan to Lagos on one end, and Maradi, Niger Republic on the other."
  },
  {
    "headline": "SOCIAL PLUS AFRICA BOSS TURN 40 -NigPilot",
    "summarized_story": "A man of good repute, God-fearing, kind, compassionate, peace-loving, hardworking, fearless… All these and many more will be identified with the man JAMES MOMOH JIMOHHe always wears a smile.\nBorn on July 19th, 1981, Mr. JAMES is from Okene, Kogi State and is of ebira descent,Though from a humble background, he never believes in limitations and thinking small.\nHis life is one shining example to young people (especially young boys) who see their backgrounds as a limitation.\nIf there is a force to reckon with, James Momoh is one of such individuals.\n@ 40, MR JAMES MOMOH is the CEO of Social Plus Africa Communications Ltd and Chairman, Jovial Global Services Ltd respectively."
  },
  {
    "headline": "NSIP: FG distributes engagement letters, devices to independent monitors in Beune",
    "summarized_story": "Federal government through the Federal Ministry of Humanitarian Affairs, Disaster Management and Social Development has distributed engagement letters and tablets to trained independent monitors to track the various packages of the National Social Investment Programme, NSIP, in Benue State.\nA statement signed by Grace Osuji said the ministry is repositioning the NSIP in line with the federal government’s commitment to lifting 100 million Nigerians out of poverty.\nShe said the programmes include the job creation programme – N-POWER, National Home Grown School Feeding Programme, NHGSFP, Conditional Cash Transfer Programme, CCT, and the Government Enterprise and Empowerment Programme, GEEP.\n‘’We flagged-off the training of 5,000 independent monitors for the National Social Investment Programme in Abuja on Thursday, February 4.\nThe training was carried out across the country from February to April.”Each independent monitor is expected to monitor a designated number of beneficiaries of the National Social Investment Programme."
  },
  {
    "headline": "Minister of State for Transportation, Gbemisola Saraki",
    "summarized_story": "National Assembly has directed the Federal Ministry of Transportation to check the arbitrary hike on transportation fares, especially during festive periods.\nA statement signed by Eric Ojiekwe, Director of Press to the Minister of State for Transportation, Gbemisola Saraki, who made this known during a meeting with stakeholders in the road transport sub-sector in Abuja, said the meeting was at the instance of the House of Representatives, following deliberations on the arbitrary increase in transport fares during festive periods, particularly for land transport.\nAt the end of the deliberation, stakeholders called on the federal government to prioritize road construction and maintenance to reduce the damage to vehicles.\nThey equally called on the government to reduce park duties while also enacting traffic laws backed up with technology.\nFurthermore, they also advised that the activities of unions be monitored and regulated to reduce the hardship on passengers."
  },
  {
    "headline": "Eid-El-Kabir: Muslims Observe Rakat Prayers At Eid Grounds",
    "summarized_story": "In the nation’s capital, Muslims converged on the Abuja National Eid Ground to observe the three Rak’at.\nBefore going into the Eid ground, worshippers lined up to have their temperatures checked as health workers are also on the ground to administer hand sanitizers on the hands of the worshippers.\nAmong the personalities who observed prayer at the National, Eid ground is the FCT Minister, Mohammed Bello.\nPresident Buhari and other dignitaries observed prayers were at the Kofar Arewa Eid Prayer Ground.\nSanusi Leads Prayers In KadunaIn Kaduna, former Emir of Kano, Muhammadu Sanusi led the Eid prayer at the Murtala Mohammed prayer ground in the Kaduna metropolis."
  },
  {
    "headline": "Sunday Igboho Arrested In Benin Republic",
    "summarized_story": "Yoruba Nation agitator, Sunday Adeyemo, also known as Sunday Igboho, has been arrested in Cotonou, Benin Republic.\n“I received last night the troubling information that Chief Sunday Adeyemo fondly called Igboho had been arrested at the Cotonou Airport,” Akintoye said.\nAccording to The Punch, Igboho was arrested at an airport in Cotonou on Monday night by the security forces in Benin Republic while trying to flee to Germany.\n“He was arrested in Cotonou while he tried to travel out on Monday night.\nThe security forces in Benin Republic should repatriate him to Nigeria on Tuesday,” the source said."
  },
  {
    "headline": "Eid-El-Kabir: Demonstrate Good Virtues Of Islam, Buhari Tells Muslims",
    "summarized_story": "President Muhammadu Buhari in his Eid greetings on the occasion of Eid El-Adha called on Muslims in the country to demonstrate the good virtues of Islam.\nThis was disclosed in a statement signed on Monday by the Senior Special Assistant to the President on Media and Publicity, Garba Shehu.\nSpeaking on the significance of the Eid El-Kabir celebration, the President appealed to Muslims “to demonstrate the good virtues of Islam through personal examples and practices.”He added that “Taking advantage of the celebration to exploit fellow citizens through outrageous prices of food and rams is inconsistent with fine virtues of Islam.\nRemember that Islam is a religion of charity that urges us to love our neighbour as we love ourselves.\n“I urge all Muslims to continue to live in peace and harmony with their fellow Nigerians of other faiths in the spirit of peaceful coexistence."
  },
  {
    "headline": "Courts Order INEC To List Soludo, Uba As APGA, PDP Candidates",
    "summarized_story": "Two courts in Anambra on Monday ordered the Independent National Electoral Commission (INEC), to list the names of Professor Chukwuma Soludo and Senator Ugochukwu Uba as the candidates of the All Progressives Grand Alliance (APGA) and the Peoples Democratic Party (PDP), respectively for the November 6, 2021, governorship election.\nIn Professor Soludo’s case, the High Court presided over by Justice C.C.\nJustice Okaa in passing judgment ordered INEC to remove the name of Hon Umeoji from its list and ordered him to stop parading himself as the candidate of APGA for the November election.\n“An order of the court, whether it is right or wrong, must be obeyed until it is vacated.\nThe peculiarity of this case is that there was an existing court order that is still alive” Vanguard quoted the judge as saying."
  },
  {
    "headline": "Jacob Zuma’s Trial Resumes In August",
    "summarized_story": "Jacob Zuma’s long-running corruption trial will resume on August 10, a South African judge ruled on Tuesday after the ex-president sought to have the case postponed because of the pandemic and recent unrest.\nFollowing his jailing, South Africa plunged into chaos, with looting and rioting erupting in Zuma’s home region of KwaZulu-Natal before spreading to Johannesburg.\nThe violence, which subsided by the weekend, was widely seen as at least partially in response to Zuma’s imprisonment.\n‘Constitution has prevailed’“The trial is adjourned to 10 to 13 August,” Judge Piet Koen said during Tuesday’s hearing.\nThe family won lucrative government contracts and allegedly picked ministers during Zuma’s nine years in office."
  },
  {
    "headline": "Eid-el-Kabir: AIG assures adequate security coverage in Kano",
    "summarized_story": "The AIG Zone One headquarters in Kano, which includes the Kano and Jigawa Police Command, has reassured the people of Kano and Jigawa states, as well as all Nigerians, that the zone one police command is ready to protect citizens’ lives and property during the Eid-el Kabir celebrations.\nHe has instructed plain cloth operatives, conventional policemen, mobile policemen, counter-terrorist policemen, and other tactical teams to be deployed at all Eld-el-kabir praying grounds, leisure centers, and other public areas throughout the two commands.\nThe AIG advised anyone planning to utilize the period to stir up unrest or disrupt public order to refrain, as the command will not hesitate to retaliate against any troublemaker, according to a statement issued on Monday.\nSimilarly, the AIG urged members of the public to be security vigilant and report any suspicious person or movement to the nearest police station for urgent assistance.\nIn order to secure a hitch-free Eld-el-kabir celebration, the two command commissioners of police have been asked to collaborate with sister security and other key partners."
  },
  {
    "headline": "Cholera outbreak in Enugu claims fourteen lives",
    "summarized_story": "The recent cholera outbreak in Enugu has claimed fourteen lives, this is according to a director of the state health ministry.\nOver eighty people have contracted the sickness since the outbreak was disclosed in the state last Friday, according to Boniface Okoro, the ministry’s head of public health and disease control.\nHe said, “Seven persons died initially on Saturday, but as of Monday, seven more deaths were confirmed, raising the fatalities to fourteen.”AdvertisementHe attributed the cholera outbreak to poor hygienic practices around the affected place.\nThe New Artisan market, where the outbreak occurred, is predominantly for cattle sales with a huge concentration of people from the northern parts of the country.\nNew Artisan is also peculiar because of the activities of butchers and poor disposal of waste from animal processing."
  },
  {
    "headline": "NBS, others, seek special trust fund for statistical development",
    "summarized_story": "To address the issue of inadequate funding of statistical activities at the state level, the National Consultative Committee on Statistics has proposed the establishment of a statistics trust fund.\nThe committee stated, among other things, that the lack of a statistics Trust Fund, late release of budget allocations for statistical activities, and a lack of modern technology for statistical analysis at the state level were all factors contributing to the country’s slow statistical development.\n“The establishment of ‘Statistics Trust Fund’ was a recipe to the problem of funding for statistics.\nAdvertisement“There was inadequate funding for Statistical activities and late release of budgetary allocations for Statistical activities at the State Level.\n“The lack of modern technology for data analysis in line with modern trend was prevalent in most MDAs and State Bureaus of Statistics."
  },
  {
    "headline": "Yoruba Nation Agitator Sunday Igboho Arrested in Cotonou: Reports",
    "summarized_story": "Yoruba Nation agitator, Sunday Adeyemo also known as Sunday Igboho, has reportedly been arrested in Cotonou, Benin Republic, according to local sources.\nHe was arrested at an airport in Cotonou on Monday night, a top source familiar with the matter told local media.\nIgboho was arrested by the security forces in Benin Republic about three weeks after the Department of State Services declared him wanted for allegedly stockpiling arms, an allegation he has since denied.\n“He was arrested in Cotonou while he tried to travel out on Monday night.\nThe security forces in Benin Republic should repatriate him to Nigeria on Tuesday,” the source said."
  },
  {
    "headline": "Research: India’s Deaths During Pandemic 10 Times Official Toll",
    "summarized_story": "India’s excess deaths during the pandemic could be a staggering 10 times the official Covid-19 toll, likely making it modern India’s worst human tragedy, according to the most comprehensive research yet on the ravages of the virus in the south Asian country.\nMost experts believe India’s official toll of more than 414,000 dead is a vast undercount, but the government has dismissed those concerns as exaggerated and misleading.\n“True deaths are likely to be in the several millions not hundreds of thousands, making this arguably India’s worst human tragedy since Partition and independence,” the report said.\n“This analysis reiterates the observations of other fearless investigative journalists that have highlighted the massive undercounting of deaths,” Jacob said.\nMurad Banaji, who studies mathematics at Middlesex University and has been looking at India’s COVID-19 mortality figures, said the recent data has confirmed some of the suspicions about undercounting."
  },
  {
    "headline": "Rockets Land Near Afghan Presidential Palace during Eid Prayers",
    "summarized_story": "Rockets have landed near the Afghan presidential palace in Kabul during prayers for the Muslim festival of Eid al-Adha, officials and media reports say.\nThere were no immediate reports of injuries, according to the Reuters news agency, citing local media reports on Tuesday.\nAt least three rockets landed in the Afghan capital as the city marked the start of the Muslim holiday, said Interior Ministry spokesman Mirwais Stanekzai.\nOur team is investigating.”Rockets have been aimed at the presidential palace several times in the past, the last being in December.\nUnlike some previous years, the Taliban did not declare a ceasefire during the Eid holiday this year."
  },
  {
    "headline": "China Denies ‘Groundless and Malicious’ Claims of Microsoft Hack",
    "summarized_story": "China has slammed “groundless” claims that it carried out a major cyber-attack against tech giant Microsoft.\nA group of Western countries had accused China of hacking Microsoft Exchange – a popular email platform used by companies worldwide.\nThe Chinese Embassy in Wellington called the accusations “groundless and irresponsible”.\n“Making accusations without [proof] is malicious.”The Chinese embassy in Australia echoed these remarks, describing Washington as “the world champion of malicious cyber attacks”.\nMicrosoft blamed a Chinese cyber-espionage group for exploiting a vulnerability in Microsoft Exchange – which allowed hackers to remotely access email inboxes."
  },
  {
    "headline": "Calls for Outside Help as Extreme Weather Fuels Oregon Fires",
    "summarized_story": "If the fire were in densely populated parts of California, “it would have destroyed thousands of homes by now,” said James Johnston, a researcher with Oregon State University’s College of Forestry who studies historical wildfires.\nThe largest forest fire in modern history was the Biscuit Fire, which torched nearly 780 square miles (2,000 square kilometers) in 2002 in the Rogue River–Siskiyou National Forest in southern Oregon and northern California.\nThe Bootleg Fire was one of many fires burning in a dozen states, most of them in the U.S. West.\nSixteen large uncontained fires burned in Oregon and Washington state alone on Monday.\nThat fire, which exploded over the weekend and forced the cancellation of an extreme bike ride, was 36 square miles (93 square kilometers) with no containment."
  }
]