[
  {
    "headline": "BREAKING: Al Sadd announce Xavi move to Barcelona",
    "summarized_story": "Qatar side, Al Sadd have announced that Barcelona have paid the release clause which will see Xavi Hernandes return to the Spanish club as manager.\nThe club made the announcement in a statement on their official Twitter handle on Friday.\nThe statement read, “Turki Al-Ali: The #AlSadd administration has agreed on Xavi’s move to Barcelona after the payment of the release clause stipulated in the contract.\nXavi is an important part of Al-Sadd’s history and we wish him success.\n“Xavi and his family will remain welcome in Doha, and our relationship will continue.”The managerial position at Barcelona has been vacant since the sacking of Ronald Koeman."
  },
  {
    "headline": "Police arrest suspected armed robber, recover arms in Kogi",
    "summarized_story": "The Kogi State Police Command has arrested, Umaru Muhammed, a suspected armed robber and kidnapper along Irunda- Isanlu road.\nThe twenty-five-year-old is suspected to be a member of a gang responsible for a series of violent crimes around Isanlu and its environs.\nA statement issued on Friday in Lokoja by the Public Relations Officer of Kogi State, DSP William Aya, stated, “The arrest was made possible following a report received from a patriotic citizen that some suspected criminal elements were sighted around Isanlu axis.\nMeanwhile, the Commissioner of Police, CP Idrisu Dauda Dabban, has reassured residents of Kogi State that the Command is committed to ensuring adequate security of lives and property in synergy with other security agencies in the State.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Insecurity: Amotekun filling security gap —Akeredolu",
    "summarized_story": "The statement said Akeredolu who particularly commended the military for ensuring peace and security in the country, equally disclosed that his administration has enjoined necessary support and cooperation from all heads of security agencies in the state including the Army, Police, NSCDC, DSS, NIA and others.\nAs a government, we owe it a duty to secure the lives and property of our people,” he emphasised.\n“He also added that Amotekun Corps is now engaging in road patrol to further ensure the security of lives and property of all residents across the state.\n“He stressed that the country needed a multi-levelled policing with special attention to state police to effectively secure the lives and property of the citizens.\n“He particularly applauded the Governor for the way he handled the issue of farmers/herders clashes in the state to ensure peaceful coexistence between farmers and herders.”Copyright PUNCH."
  },
  {
    "headline": "First, Second prosecution witnesses testify in late Umoren’s murder case",
    "summarized_story": "Iniobong Ekpenyong has given his testimony in the ongoing trial of Uduak-Abasi Akpan over the murder of 26-year-old Iniubong Umoren.\nHe said he learnt about the murder of late Umoren when his attention was drawn to Social media post that the second accused person, Mr. Frank Akpan had been arrested.\nHe told the Court that he received calls from various quarters asking him to intervene because the second accused person has an ailment which needed attention.\n“I got calls from various quarters that the Father of Uduak-Abasi Frank Akpan (first accused person) has been arrested.\n” At that time we were happy that the first accused person called."
  },
  {
    "headline": "Collapsed Building: I neither own the land nor bought any from Ade-Ojo — Osinbajo",
    "summarized_story": "The statement reads: “The attention of the Vice President has been drawn to an obviously sponsored falsehood regarding the recently collapsed building published by Sahara Reporters on November 4th, 2021, to the effect that:1.\nThe VP owns the land upon which the collapsed building in Ikoyi stood.\nThat the Vice President, at some point, intervened with the regulatory authorities in Lagos State to unseal the said property.\nHe has, indeed, never acted to influence any other regulatory action on the collapsed building, or any other building for that matter, in Lagos State.\nThe Vice President has referred this disgraceful publication to his lawyers for prompt legal action.”"
  },
  {
    "headline": "Just in: Bagudu dissolves 21 local Councils Chairmen, Councilors in Kebbi",
    "summarized_story": "By Haruna Aliyu, Birnin KebbiThe Kebbi state governor Senator Atiku Abubakar Bagudu Thursday dissolved the 21 local government’s chairmen and their councilors in Kebbi state.\nIn a press release made available to journalists in Birnin Kebbi, the governor made the dissolution after hosting the outgoing chairmen at the government house in Birnin Kebbi.\nEarlier in his speech, he thanked them for diligently serving the state for the period they were elected ” I thank you most profoundly for your selfless services to the state he said “though no mentioned was made to whom will they hand over to.\nIt would be recalled that, their tenure in office officially terminated on Thursday 4th February 2021, similarly the state independent electoral commission kebbi state had slated February 5th 2021 for local councils polls across the 21 local governments in Kebbi state."
  },
  {
    "headline": "Debt cancellation: Nigeria yet to appreciate Tukur",
    "summarized_story": "To my mind, much credit has not yet been given to the role played by Alhaji Bamanga Tukur in the process.\nWhat matters is that once you have the capacity to deliver, you can find accommodation anywhere in Nigeria,” Mustapha said.\nMy father met with Alhaji Bamanga Tukur and they discussed how to get me a car to aid my movement.\nMy father brought N4,000, Alhaji Bamanga brought N4,000 while I was asked to bring N1,000 for registration and insurance.\nThat was what happened but Alhaji Bamanga even paid for the insurance for me,” he recalled."
  },
  {
    "headline": "FG set to rejig public service",
    "summarized_story": "By Dirisu YakubuHead of Civil Service of the Federation, Dr. Folasade Yemi-Esan has said the President Muhammadu Buhari-led government is poised to re-engineer the public Service to enable it render high quality service to the country.\nDr. Yemi-Esan stated this in her opening remarks at a Strategic Policy and Engagement Workshop on the Federal Civil Service Strategy and Implementation Plan, FCSSIP 2021 -2025 held for members of the National Assembly in Abuja.\nThe workshop, she explained, was part of the ongoing efforts by the Office of the Head of Service to promote inclusiveness and buy-in of stakeholders to ensure the successful actualization of the goals of developing a new civil service.\nThe workshop, she explained, was being organized to apprise members of the National Assembly of the priority deliverables undertaken by the Office through a number of reforms and structures.\nThe Head of Service commended the National Assembly for its continued support to her Office, especially in the warm reception accorded to her delegation by the two committees on Establishment and Public Service Matters of the hallowed chambers each time she visited."
  },
  {
    "headline": "Respite for Benue workers as court unfreezes state’s salary account",
    "summarized_story": "Respite came the way of civil servants in Benue State on Friday as Justice Inyang Eden Ekwo of the Federal High Court, Abuja, lifted the freezing order placed on the salary account of the Benue State Government.\nThe senior lawyer pleaded with Justice Ekwo to relax the freezing order on the salary account to enable government pay its civil servants.\nHe said the Benue State Government has been completely shut down by the interim order issued by the court.\nIn a ruling on Friday, Justice Ekwo said he was mindful of the plights of the workers and inclined to unfreeze the account to bring respite to the innocent workers.\nThe judge subsequently ordered Access Bank to allow transactions in the salary account and that the order shall last for 14 days only."
  },
  {
    "headline": "OML 11: Why we adopted Wike to lead discussions on exploration – Ogoni leaders",
    "summarized_story": "Stakeholders in Ogoni, Rivers State, have explained that their decision to adopt Governor Nyesom Wike to lead discussions on resumption of oil exploration in OML 11 was to prevent those they described as saboteurs from derailing the process.\nThe stakeholders said they want to take advantage of the leadership that will be provided by Governor Wike in setting up a multi-consultative forum.\nThe former President of the Movement for the Survival of Ogoni People, MOSOP, Ledum Mitee announced the decision to journalists after a meeting of Ogoni leaders with Governor Wike at the Government House Port Harcourt on Thursday.\nThe meeting followed an earlier meeting by Ogoni leaders with President Muhammadu Buhari held two weeks ago at the Presidential Villa, Abuja.\nAccording to Mitee, the Ogoni delegation to Abuja discussed a number of issues and it was important to brief Wike on those issues."
  },
  {
    "headline": "Anambra 2021: We’re in high spirit to vote – Electorate",
    "summarized_story": "Some residents of Awka in Anambra State and environ have said that they are ready to exercise their franchise in the Saturday governorship election in the state.\nThe electorate in the state told the News Agency of Nigeria (NAN) in Awka on Friday that they were in high spirit to vote for their preferred candidate on the Nov. 6 election.\nMrs Margaret Ikejiofor, a woman leader, called on Anambra citizens to come out en masse and vote for the candidate of their choice.\n“I am calling on residents of the state to come out en masse and vote for their preferred candidate.\n“With the high level of security in place nothing will happen to disrupt this election, I am calling on all women, in particular, to come out and vote,” she said."
  },
  {
    "headline": "Taraba to embark on measles, yellow fever, meningitis immunization campaigns",
    "summarized_story": "The Taraba State Director, Disease Control and Immunization, Dr. Kenneth Tijos, has said relevant plans to ensure success in the forthcoming campaigns on yellow fever, measles, meningitis as well as polio, have been put in place by the state government.\nThe exercise, which according to him has been scheduled to commence on the 18th of this month, is to be carried out in the entire axis of the state.\nAligning her weight to that of Tijos, the State Health Educator, Mercy Maigoge, said the stakeholders meeting had become necessary in order to orient participants on approach, key, activities, and reason for the integrated campaigns.\nMaigoge who also said that polio, meningitis, measles, and yellow fever cases are rising across the state, said they “are a serious threat to our children’s health ” hence the need for all hands to be on deck to ensure the success of the exercise.\nShe also beckoned at media practitioners spread across the state not to leave any stone unturned in assisting the agency to disseminate genuine information that would dispel the myths, rumors and misconceptions surrounding the forthcoming exercise."
  },
  {
    "headline": "Anambra election must be credible, peaceful – TMG to INEC, security agencies",
    "summarized_story": "The Transition Monitoring Group (TMG) has called for a credible and peaceful governorship election in Anambra State on Saturday.\nTMG, the foremost independent civil society election observation organization in Nigeria, has over 400 member organizations.\n“Security agencies should live up to the principles of impartiality, neutrality, and statesmanship during the election,” he said.\nThe Civil Society Legislative Advocacy Centre (CISLAC) Director warned the Independent National Electoral Commission (INEC) against partiality.\nRafsanjani enjoined the electorates, the civil society, traditional and community leaders, among others to ensure a peaceful process."
  },
  {
    "headline": "Freed UNIABUJA lecturers to undergo medical checks – VC",
    "summarized_story": "Read Also: Police rescue abducted UniAbuja lecturers- Advertisement -The VC spoke in a terse statement posted on the official Facebook page of the University on Friday morning.\nHe commended the security agencies as well as the Safety Unit and security outfit of the University for the return of the kidnapped workers.\nThe VC said: “Our prayers have been accepted.\nI will provide you more details later, just to let you know that our UofA family is a happier family today with the resolution of this calous and wicked kidnap of our people.\n“As I write, we are on the road to"
  },
  {
    "headline": "BREAKING: I’ve nothing to do with collapsed Lagos building – Osinbajo",
    "summarized_story": "BREAKING: I’ve nothing to do with collapsed Lagos building – OsinbajoVice President Yemi Osinbajo has dissociated himself from the 21- storey building, which collapsed in Lagos on Monday.\nIn a statement by his spokesman, Laolu Akande, Osinbajo, who expressed sympathies with the families of the victims of the building collapse, also denied making any move to influence the Lagos State housing regulatory authorities to favour foul play.\nRead Also: Ikoyi building tragedy: Sanwo-Olu declares 3-day mourning- Advertisement -The Vice President, who alleged attempts by political actors to use the situation to malign his image, also accused online news outlet, Sahara Reporters, of being sponsored to engage in a smear campaign against his person.\nDetails shortly…"
  },
  {
    "headline": "Labourer jailed 3 months for stealing building materials",
    "summarized_story": "An Upper Area Court, sitting in Kasuwan Nama, Jos, on Friday sentenced a 19-year-old labourer, Moses John, to three months imprisonment for stealing building materials.\nThe Presiding Judge, Mr Lawan Suleiman, sentenced John after he pleaded guilty to the theft.\nThe judge gave John an option to pay a fine of N5,000.\nDabit said that the convict broke into a new building site and stole building materials worth N58,000.\nThe prosecutor said that the offence contravened the provisions of Section 336 and 273 of the Plateau State Penal Code Law."
  },
  {
    "headline": "Body of collapsed Lagos building owner retrieved",
    "summarized_story": "The recovery yesterday of the body of Mr. Femi Osibona, the investor in the collapsed 21-storey building in Ikoyi, Lagos has laid to rest questions over his whereabouts.\n- Advertisement -Families have documented 19 names on the register of missing persons open at the site of the crisis by the Lagos State Government.\n- Advertisement -During his visit to the site yesterday, the governor put the figure of bodies recovered as 32.\nThe body was last night identified by officials of Lagos State Ministry of Physical Planning and Urban Development.\nHe said one of them was transferred to the Lagos State University Teaching (LASUTH) in Ikeja, for further treatment, “while the remaining five are in good spirits”."
  },
  {
    "headline": "Police deny terrorists’ abduction of policemen in Borno",
    "summarized_story": "Police in Borno on Friday denied media reports that terrorists abducted two policemen in an attack at Magumeri Local Government Area of the state on Wednesday.\nCommissioner of Police in the state, Mr Abdu Umar, told the News Agency of Nigeria (NAN) in Maiduguri that the police was not affected in the attack.\n“The story going round that the Police Divisional Office in Magumeri was attacked, looted and burnt while two policemen were abducted is not true.\n- Advertisement -“The police station was not attacked and none of the policemen was abducted and detainees were not released as erroneously claimed.\n- Advertisement -The News Agency of Nigeria (NAN) reports that Magumeri came under attack on Wednesday evening when a group of insurgents stormed the community in many trucks."
  },
  {
    "headline": "BREAKING: Kidnapped UNIABUJA victims rescued, suspects arrested",
    "summarized_story": "From Molly Kilete, AbujaThe Federal Capital Territory (FCT) police command has announced the rescue of all the victims kidnapped by gunmen on Tuesday morning from the University of Abuja Senior Staff Quarters.\nPolice public relations officer Josephine Adeh, in charge of the command said the victims were rescued in a joint operations.\nThe PPRO in a statement announcing the rescue of the victims reads; “The FCT Police Command wishes to inform members of the public that all abducted victims of the university of Abuja were rescued and reunited with their families through a joint operation with other security agencies.”More details coming soon…Setup your own platform that allows you to earn a minimum of ₦100,000 daily, payments are in US dollars, 100% legitimate .Click here to start now .\n100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection.\nClick here ."
  },
  {
    "headline": "Lagos collapsed building: Sanwo-Olu declares 3 days mourning, inaugurates 6-man panel",
    "summarized_story": "By Lukman OlabiyiGovernor Babajide Sanwo-Olu has declared three days of mourning over the Ikoyi building collapse.\nThis came as Governor Sanwo-Olu signed the executive order giving legal backing to the panel of inquiry set up to probe the collapsed building.\nThe governor described the event as a “sad one” for Lagos during the panel inauguration.\nMeanwhile, the body of the Managing Director, Fourscore Homes, Femis Osibona, has been recovered in the rubble of the collapsed Ikoyi building.\nFourscore Homes is the firm constructing the 21-storey building under construction which collapsed on Monday, on Gerrard Road in Ikoyi, Lagos."
  },
  {
    "headline": "South East govs to IPOB: We’ll meet FG on Kanu",
    "summarized_story": "From Magnus Eze, Awka and Chijioke Agwu, AbakalikiGovernors of the South East, yesterday, blamed criminals, including armed robbers, cultists and kidnappers for the festering insecurity in the region.\nThey also urged voters in Anambra State to go out tomorrow and vote for the candidates of their choice in the governorship election.\nSouth East governors are studying their reports with the elders and leaders of the various South East states and very soon, we will be meeting with the Federal Government on these issues, including deploying political solutions in the case of Kanu which we have already initiated.\n“We thank our religious leaders, Conference of Bishops and Archbishops of South East, the traditional institutions of South East and Christian Association of Nigeria of South East for their interventions and mediations on this matter.\n“We plead with security agencies deployed for Anambra election to secure the lives of our people in Anambra State while playing within the rules of their engagements,” the governors said."
  },
  {
    "headline": "Anambra guber: Soludo, Okonkwo, Andy Uba,Ozigbo i",
    "summarized_story": "The mathematicsOut of the three Senatorial Districts: Anambra North, Anambra Central and Anambra South; the Central has the highest number of registered voters, dominantly in Idemili North and South LGAs.\nAnambra South is the least in terms of registered voters but Aguata LGA has the highest registered voters in South.\nAnambra North has the second highest registered voters; the ZLP is also expected to harvest in Anambra North because the party sowed there too.\nThe race would also be tough when the APC, APGA, PDP and ZLP shift the battle to Anambra North.\nOutgoing Governor Obiano who hails from Anambra North is also expecting to deliver the zone to his party, APGA."
  },
  {
    "headline": "Obiano has destroyed APGA –Bianca Ojukwu",
    "summarized_story": "Bianca Ojukwu, wife of the late Igbo leader and national leader of All Progressives Grand Alliance (APGA), on the occasion of his posthumous birthday, November 4, speaks on the chances of the party.\nThe former Nigerian Ambassador to Spain said that Governor Willie Obiano should be held responsible should APGA lose the election.\nIn this election year, are there any programmes or events that have been put in place by APGA, his political party to mark the event?\nThis has left a deeply wounded and visibly divided party, with APGA party members decamping from the party almost on a daily basis with the alacrity of rats deserting a sinking ship.\nAPGA is not just a political party, but a state of mind."
  },
  {
    "headline": "Abdulsalami: Parties, Candidates Must Accept Outcome of Anambra Poll Once Credible, Free",
    "summarized_story": "In a similar vein, some key voices in the South-east called for a halt to violence and hostility in Anambra State.\nMost importantly, we want to contribute our own quota to see that the governorship election in Anambra is devoid of violence.\n“We call on all the candidates, political parties and their supporters to accept the outcome of the poll as long as it is adjudged to be free, fair and credible.\nThe body urged the people of Anambra State to come out and vote in the governorship poll without intimidation or fear.\nNo rigging of any kind will be tolerated on the Anambra State governorship election."
  },
  {
    "headline": "MTN Group to Sell 575m Shares in Public Offer",
    "summarized_story": "*Announces completion of N90 billion Series II 10-year fixed rate bondsKayode TokedeThe MTN Group has disclosed plan to proceed with a public offer of up to 575 million shares in its Nigerian subsidiary, MTN Nigeria Communications Plc.\nThe telco disclosed this in a statement signed by Company Secretary, MTN Nigeria, Uto Ukpanah, a copy of which was made available to the Nigerian Exchange Limited (NGX) yesterday.\nAs a result, the Series II Bond was launched at a clearing coupon of 1.275 per cent with N89, 999,000,000 in qualified bids.\nAs at the time of filing this report, MTN Nigeria Communication share price was trading at N175.60 per share.\nMTN Nigeria is one of Africa’s largest providers of communications services, connecting approximately 68 million people in communities across the country, with each other and the world."
  },
  {
    "headline": "NCC, Telcos Differ on N75bn Reserve Price for 3.5GHz Spectrum",
    "summarized_story": "The NCC had fixed December 13, 2021, for the 3.5GHz spectrum auction and had pegged the reserve price at $197.4 million (N75 billion).\nReacting to the N75 billion reserve price, telecoms operators, which included MTN, Airtel, Huawei, Intelsat, including the GSMA, called on NCC, to consider the current exchange rate in pegging the reserve price.\nThey argued that if the reserve price remained high, it would discourage operators from participating in the auction process.\nFor the auction process, Asaju explained that it would be Ascending Clock Auction (ACA), while the auction would be software based.\n“A reserve price of approximately N75 billion, equivalent to $197,400,000.00, will to be used."
  },
  {
    "headline": "Ikoyi Building Collapse: Sanwo-Olu Declares Three Days of Mourning in Lagos",
    "summarized_story": "*Flags to fly at half mast*Inaugurates tribunal*Death toll rises to 38, developer’s body found*Emergency teams ramp up recovery operationSegun JamesGovernor Babajide Sanwo-Olu has declared three days of mourning in Lagos State over the Ikoyi building collapse tragedy which occurred on Monday.\nThe Lagos State Government in a statement signed by Commissioner for Information and Strategy, Mr. Gbenga Omotoso commiserated with all those who lost their loved ones in the unfortunate incident.\nSanwo-Olu, who described the event as a “sad one” for Lagos was visibly in a sombre mood during the inauguration.\nThe governor believed the tribunal members would bring their expertise and professionalism to bear in unravelling the infractions that brought down the building.\nAyinde said Lagos was in its “dark period”, given the record of fatalities from the site of the building collapse."
  },
  {
    "headline": "Breaking: Body of Collapsed High-rise Building Developer, Femi Osibona, Recovered",
    "summarized_story": "Kingsley Nwezeh and Nume EkegheThe body of Mr. Femi Osibona, the developer of the collapsed Ikoyi High-rise building, has been recovered, according to Arise TV.\nReports monitored on Arise TV said two reliable sources confirmed that Osibona’s body had been found and identified.\nThe 21-storey building on Gerrard Road in Ikoyi, Lagos collapsed on Monday, claiming over thirty lives, while several people are still believed to be trapped in the rubble.\nNine survivors had been rescued so far.\nMore details later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "COVID-19 Vaccine: CBN To Fund Nigerian Researchers, Science Institutions",
    "summarized_story": "The Central Bank of Nigeria says it is developing a framework under which grants and long term facilities will be provided to researchers, science institutions and biotechnology firms to develop COVID-19 vaccine.\nThe Governor of CBN, Godwin Emefiele, disclosed this at the unveiling of the THISDAY Dome Testing, Tracing and Treatment Centre, Abuja, on Tuesday.\nEmefiele said if Nigeria was to wait for foreign countries to develop their vaccines, it would be the last in the queue to receive curative remedies for the teeming population.\nHe said, “The CBN today challenges Nigerian scientists at home and in the Diaspora to go back to their laboratories and develop a Nigerian vaccine.\nOnce validated by the Health Authorities, the CBN will step in and do the needful for the sake of over 200 million Nigerians now confronted by COVID-19."
  },
  {
    "headline": "President Donald J. Trump’s Concession Speech, By Rudolf Okonkwo",
    "summarized_story": "The first time I ran for office, I ran for president.\nI have shown you that everything is possible if you have the right man to do the right job.\nThanks to me, they will grow up knowing that ours is a Christian nation where it is allowed to say Merry Christmas.\nTell those terrible lowlifes that they have proved themselves unworthy of Donald Trump’s genius and have opted to reduce America to a Second Class nation in the world.\nYours truly,President Donald J. TrumpThe 45th President of the United States."
  },
  {
    "headline": "Bandits Free Niger State Monarch After 45 Days In Captivity, N10million Ransom",
    "summarized_story": "The Dodo of Wawa community, Niger State, Dr Mahmoud Ahmed Aliyu, has been freed by his abductors after spending 45 days in their captivity.\nHe was said to have been released at about 7:30pm on Tuesday after the payment of N10million ransom to the bandits.\nThe Wazirin Wawa, Alhaji Ja’afar Ibrahim Bio, confirmed the release of the traditional ruler to Daily Trust, on the telephone but declined comment on how much was paid to secure his release.\nIn a video shared by his family, the traditional ruler was seen in a white turban being welcomed by his family and members of the palace.\nAliyu was abducted in his palace by heavily armed men around 9pm on September 4."
  },
  {
    "headline": "The Teflon President With Nine Lives Is On His Way Out By Dr. Wumi Akintide",
    "summarized_story": "The Teflon President with nine lives I have in mind is nobody else but Donald J. Trump.\nIn cahoots with Trump, Republicans have not ended their campaign of calumny to humiliate, blackmail and delegitimize Barack Obama, the first black President.\nThe one-term young Senator from Illinois was elected President in 2008 and re-elected again in 2012 with a wider margin.\nThe voters concluded he had told a lie even though he was one of the most honorable and dependable men of honor ever to serve as American President.\nThe list goes on and on without end but Donald Trump is still there despite an abysmal approval opinion of only 33 percent or less."
  },
  {
    "headline": "Osinbajo: I've no stake in collapsed Ikoyi building -- all my assets have been publicly declared",
    "summarized_story": "Vice-President Yemi Osinbajo has denied the report that he owns the land upon which the collapsed 21-storey building was built.\nAdvertisementThe high-rise building along Gerard Road in Ikoyi axis of Lagos collapsed on Monday afternoon with many people trapped in the rubble.\nAdvertisementReacting to the incident, Gbolahan Oki, the suspended general manager, Lagos State Building Control Agency (LASBCA) said the owner of the collapsed building got approval to construct only 15 floors.\nThe vice-president said he has publicly declared all his assets, adding that he never acted to influence any regulatory body on the collapsed building.\nOn Thursday evening, the body of Femi Osibona, owner of Fourscore Homes and developer of the collapsed building, was recovered from the rubble of the collapsed building."
  },
  {
    "headline": "Osinbajo: I've no stake in collapsed Ikoyi building -- all my assets have been publicly declared",
    "summarized_story": "Vice-President Yemi Osinbajo has denied the report that he owns the land upon which the collapsed 21-storey building was built.\nAdvertisementThe high-rise building along Gerard Road in Ikoyi axis of Lagos collapsed on Monday afternoon with many people trapped in the rubble.\nAdvertisementReacting to the incident, Gbolahan Oki, the suspended general manager, Lagos State Building Control Agency (LASBCA) said the owner of the collapsed building got approval to construct only 15 floors.\nThe vice-president said he has publicly declared all his assets, adding that he never acted to influence any regulatory body on the collapsed building.\nOn Thursday evening, the body of Femi Osibona, owner of Fourscore Homes and developer of the collapsed building, was recovered from the rubble of the collapsed building."
  },
  {
    "headline": "REWIND: 3 weeks before Ikoyi incident, Lagos launched 'rebranded' building fitness certificate",
    "summarized_story": "Less than a month before the collapse of the 21-storey building in Ikoyi on Monday, Babajide Sanwo-Olu, governor of Lagos, had launched a “rebranded” certificate of completion and fitness for buildings in the state.\nAdvertisementSpeaking at the launch which held on October 6, Sanwo-Olu had said the objective is to address causes of building collapse in Lagos.\n“The launch of the certificate of completion and fitness for habitation is one of the moves to further strengthen our resolve to control building collapse incidents.\nMeanwhile, there is a controversy over the approval for construction of the collapsed Ikoyi building.\nAdvertisementGbolahan Oki, the suspended general manager of LASBCA, had said Osibona got approval to construct only 15 floors."
  },
  {
    "headline": "REWIND: 3 weeks before Ikoyi incident, Lagos launched 'rebranded' building fitness certificate",
    "summarized_story": "Less than a month before the collapse of the 21-storey building in Ikoyi on Monday, Babajide Sanwo-Olu, governor of Lagos, had launched a “rebranded” certificate of completion and fitness for buildings in the state.\nAdvertisementSpeaking at the launch which held on October 6, Sanwo-Olu had said the objective is to address causes of building collapse in Lagos.\n“The launch of the certificate of completion and fitness for habitation is one of the moves to further strengthen our resolve to control building collapse incidents.\nMeanwhile, there is a controversy over the approval for construction of the collapsed Ikoyi building.\nAdvertisementGbolahan Oki, the suspended general manager of LASBCA, had said Osibona got approval to construct only 15 floors."
  },
  {
    "headline": "Scientists identify gene that doubles risk of respiratory failure, death from COVID-19",
    "summarized_story": "A team of scientists at Oxford University has identified a specific gene that doubles the risk of respiratory failure and death in COVID-19 patients.\nAdvertisementThe researchers found that a “relatively unstudied gene called LZTFL1” appears to stop cells in the airways and lungs from responding to the virus properly, potentially leading to respiratory failure and death.\nThe scientists said this discovery could help in “partially explaining the ongoing higher death rate in this population in the UK”.\nAdvertisementThey, however, noted that the gene cannot be used as a sole explanation as many other factors, including socioeconomic conditions, play important roles.\nThe scientists found the gene by using artificial intelligence and cutting-edge molecular technology."
  },
  {
    "headline": "A surge in African fintech's intra-continental expansion to target SMEs",
    "summarized_story": "This article was contributed to TechCabal by Conrad Onyango/birdSupport for small businesses keen to trade across the continent’s single market is being eyed as a potentially lucrative market by more and more African fintech startups.\nSurge in intra-continental expansionIn the last month alone, a number of startups have either raised growth funds, acquired another player present in regional markets within the same vertical, or tapped top talent in the telecoms industry.\nTheir intention appears to be the targeting of small industries and traders seeking cross-border opportunities in new African markets.\nThe program comes barely a month after Tala raised 145 million dollars in equity, hinting that part of the growth funds would go toward supporting its geographical expansion.\nUntil recently, a lack of local knowledge and access to trade and market information has been linked to low trade volumes and value."
  },
  {
    "headline": "African founders lead Payhippo’s $3m seed investment",
    "summarized_story": "There’s a new exciting trend in the African tech ecosystem: African founders backing fellow founders especially in pre-seed and seed funding, which is an indication that the African tech ecosystem is maturing.\nCapital is a lifeline of businessThere are over 40 million small and medium businesses (SMEs) in Nigeria.\nBut only a few of these businesses have access to capital, mostly due to heavy collateral requirements and long time of loan processing.\nFounded by Zach Bijesse, CEO, Chioma Okotcha, COO, and Uche Nnadi, CTO, Payhippo provides small businesses with short-term working capital with average loan amounts of $1300.\n“Access to credit is a critical necessity for small businesses to manage their daily challenges."
  },
  {
    "headline": "Chipper Cash valued at $2 billion after investment from world’s most valuable crypto exchange",
    "summarized_story": "The investment was led by FTX, the most valuable crypto derivatives exchange company owned by the youngest billionaire in the world, Sam Bankman-Fried.\nWith a valuation of over $2 billion, Chipper Cash has now attained a unicorn status.\nChipper Cash is FTX’s first investment in Africa.\nChipper Cash boasts of having over 4 million users across the world.\nAs a result of this partnership, FTX will increase its footprint in Africa and Chipper Cash will be integrated into the FTX product so that African users can fund their crypto wallet through Chipper Cash."
  },
  {
    "headline": "Nigeria’s E-Settlement acquires Côte d’Ivoire’s QuickCash to increase financial inclusion across Africa",
    "summarized_story": "E-Settlement (E-SL), a Nigerian fintech group of companies, has acquired QuickCash, an Ivorian electronic payment and money transfer company, to expand and boost last-mile access to financial services in Francophone African countries like Côte d’Ivoire, Burkina Faso, Niger, Togo and more.\n“QuickCash is deepening access for agricultural-dominated areas, rural populations, the underbanked and unbanked: the disproportionately financially excluded.\n“At E-SL, we want to empower all by accelerating access to payments, financial services, and jobs.\nPatricia Zoundi Yao, CEO at QuickCash believes that E-SL has the “right vision and deep expertise” to drive QuickCash’s geographic expansion and next stage of growth.\n“E-SL is a leading payment services provider with a strong position in Nigeria’s fintech ecosystem."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "NFTs and music, Egypt’s money rain, Payhippo’s $3m seed, and Opibus’s $7.5m funding",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:Music and blockchainFunding rounds in EgyptPayhippo’s $3m seedOpibus’s $7.5m fundingNFTs and musicThe NFT market keeps growing.\nSource: SuppliedNigerian fintech startup, Payhippo, has closed a $3 million seed funding round.\nThe company produces heavy-duty electric vehicles (EVs) such as buses and trucks by converting petrol and diesel-based vehicles into electric, reducing cost and, in a way recycling older vehicles.\nOpibus has been manufacturing EVs since 2017, intending to make electric vehicles affordable in Africa.\nHowever, we still have the likes of Jet Motor Company that announced a $9 million funding in 2020, Siltech, and Ampersand playing in the space."
  },
  {
    "headline": "Blockchain meets music: How music label owner promotes artistes and sells their music as NFTs",
    "summarized_story": "But music NFTs are gaining some wind too.\nThe song was minted on Rocki, an NFT music platform on Binance Smart Chain (BSC).\nNFTs are transforming the music businessHector believes NFTs are going to be a big part of the music business in a few years.\nWhy buy music NFTs?\nHe’s currently creating a crypto token and, at the same time, building a blockchain metaverse where crypto and NFTs reign supreme."
  },
  {
    "headline": "MallforAfrica shuts down, Affiong Williams’ ReelFruit, Chipper Cash’s extension round, Violence against journalists",
    "summarized_story": "For Affiong Williams, Founder and CEO of agritech startup, ReelFruit, starting a fruit processing business in Nigeria with no template to draw from was a bold move.\nThe extension round was led by crypto exchange platform, FTX with SVB Capital, Deciens Capital, Ribbit Capital, Bezos Expeditions, One Way Ventures, and Tribe Capital participating.\nCurrently serving seven African countries, Chipper Cash was founded in 2018 by Sam Serunjogi and Maijid Moujaled to facilitate cross border payment in Africa.\nThis is where Chipper Cash has found a sweet spot.\nSerunjogi reveals that Chipper Cash offers remittances at “considerably cheaper” prices than other competitors."
  },
  {
    "headline": "CBN issues ‘Approval-in-Principle’ to MTN, Airtel for PSB services",
    "summarized_story": "Telecommunication operators’ push to offer mobile money services in Nigeria has made yet another progress as the Central Bank of Nigeria (CBN) on Thursday issued MTN Nigeria and Airtel Africa Approval-in-Principle (AIP).\nNigeria’s telecommunications giant, MTN said in a statement that it received the Approval in Principle (AIP) on November 4, 2021 from the CBN for a license application for the proposed MoMo Payment Service Bank Limited.\nWith Kenya’s 83 percent mobile money led financial inclusion rate, eight in ten adults in the East African country have access to formal financial services.\nThis mirrors the potential of Nigeria’s payment service bank (PSB), but for licensing challenges, the most populous nation in Africa has continued to lag African peers.\nBefore now, only banks and licensed financial institutions were allowed to provide financial services (bank-led financial inclusion model)."
  },
  {
    "headline": "A tale of two biggest collapsed buildings in Lagos",
    "summarized_story": "In 2008, a 22-storey building came down in rubbles in Lagos State, but no life was lost, no injury or damage to surrounding buildings was recorded.\nThat was the Bank of Industry (BoI) building constructed in 1972 and brought down through controlled demolition.\nEvidence from the Lagos State government shows that the developer of the building located at 20 Gerard Road, Ikoyi, flouted building permits.\nConsequently, the building collapsed on its weight with rumbles and very thick dust that, for more than 10 minutes, covered the surrounding.\nOkunola Olasunkanmi, a building plan research expert, stated that Nigeria’s commercial hub had witnessed about 155 buildings collapse in a space of 16 years."
  },
  {
    "headline": "Pressure on security agents, INEC for credible Anambra poll",
    "summarized_story": "With less than 24 hours to the gubernatorial election in Anambra State, the Independent National Electoral Commission (INEC) and the Nigerian security agencies have been urged to ensure a free, fair and credible election.\nAmid the precarious security situation in the state, observers say INEC and security agencies perhaps, face a tough task of ensuring the exercise is held as scheduled without ugly incidents.\nRead Also: Why we’re confident Anambra election will hold – INEC chairmanINEC Anambra electionTo ensure peace before, during and after the election, thousands of security officers and personnel of other sister agencies have been deployed to the state.\nOkunade notes that recent events have shown that security agents had been used to compromise elections in Nigeria, which must change.\nA coalition of the 18 registered political parties in Nigeria under the aegis of Inter Party Advisory Council (IPAC) on Wednesday also called on the INEC and security agencies to ensure that the Anambra poll is credible, fair and transparent."
  },
  {
    "headline": "Obaseki offers automatic employment to best graduating students of Edo University – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has offered automatic employment to the best graduating students of the Edo State University, Uzairue.\nObaseki announced this during the third convocation ceremony of the varsity in Uzairue, Etsako West Local Government Area (LGA) of Edo State.\nAccording to him, “Those exceptional students who have obtained one university prize or the other should note that you have automatic employment into Edo civil service.\n“I want to appreciate the management of the institution for keeping to the vision of our government to build a world-class university in Edo.\n“For the graduands, I urge you to continue to be good ambassadors of Edo State University, Uzairue."
  },
  {
    "headline": "Edo taskforce intensifies enforcement of traffic laws, arrests offenders – Nigerian Observer",
    "summarized_story": "The team conducted the enforcement at Sapele Road, Santana Market, Ring Road, Mission Road, New Benin, Upper Mission Extension, and Aduwawa, amongst others.\nOloriegbe said over 10 vehicles were impounded on the first day of the enforcement exercise, warning road users against violating the state’s traffic rules.\nAccording to him, “This is a general sensitization exercise on traffic management across the Benin metropolis and it’s a multi-agency collaboration.\nWe are collaborating with the police, Edo State Security Network, and other security outfits in the state to keep the roads safe, especially as we approach the Christmas period.\nHe continued: “We are not arresting traffic offenders because of money but because of safety and to ensure that people obey the law, especially as we approach Christmas."
  },
  {
    "headline": "Enugu NSCDC deploys 350 personnel, 15 vehicles for Anambra guber poll – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEnugu – The Nigeria Security and Civil Defence Corps (NSCDC), Enugu State Command, says it is deploying no fewer than 350 personnel for the forthcoming Anambra governorship election.\nThe News Agency of Nigeria (NAN) reports that the Anambra gubernatorial poll will hold on Saturday, Nov. 6 under INEC’s supervision.\nManuel said that the command was also deploying 15 operational vehicles to ensure hitch-free movement of its personnel while carrying out their election duty in Anambra.\n“The NSCDC is determined to see a hitch-free and peaceful election just as the Federal and Anambra Governments are determined also”.\n“The commandant had given the command’s contingent all logistics and moral support to ensure a hitch-free election duty and for them to do the command proud in Anambra,” he added."
  },
  {
    "headline": "EFCC opens money laundering trial of ex-governor’s aide’s wife – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestYenagoa – The Economic and Financial Crimes Commission, on Wednesday, opened its case in the money laundering case it instituted against Mrs Beauty Apere at the Federal High Court Yenagoa.\nThe absence of EFCC’s star witness on Oct 20 had stalled the N200-million money laundering suit against Mr Embelakpo Apere, and his wife, Beauty, in separate cases before the court.\nAt the resumed trial, the prosecution witness, Mr Timothy Owoeye, an official of the EFCC, in his evidence, said that the Commission collaborated with several banks and regulatory agencies during its investigation.\nHe told the court that the Commission acted on a Suspicious Transactions Report (STR) from the Nigerian Financial Intelligence Unit (NFIU) to investigate the defendant.\nThe trial judge, Justice Isa Ndahen, adjourned the case until Nov. 4 for ruling on the admissibility of the documents tendered in evidence by the EFCC."
  },
  {
    "headline": "Police must account for arrested, detained persons – #EndSARS panel",
    "summarized_story": "The chairman of the #EndSARS panel in Abuja, Suleiman Galadima, on Thursday, reminded police authorities of their duty to account for all individuals arrested and detained in their custody.\nThe #EndSARS panels, the common name given to the panels being a product of the last year’s #EndSARS protest, have submitted their reports in many states with implementation still hanging.\nA member representing the Nigerian Bar Association (NBA) on the panel, John Aikpokpo-Martins, reminded the lawyer that the panel was running against time.\nThe panel cannot wind up without confirming the whereabouts of victims in police custody, whether they are alive or dead,” he said.\nHilda Ezeala, the mother of the victim and petitioner who lodged the complaint, had said her son was arrested in July 2017 by some policemen."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "MTN Nigeria gets CBN approval-in-principle to launch MoMo Payment Service Bank",
    "summarized_story": "OBINNA EZUGWUIn further push to to go fully into financial services, MTN Nigeria Communications Plc says it has obtained an Approval-in-Principle (AIP) from the Central bank of Nigeria (CBN) to launch its proposed MoMo Payment Service Bank Limited.\nThe approval is an important requirement to obtain final approval from the apex banking authority, subject to the fulfilment of other stipulated conditions.\n“MTN Nigeria Communications Plc (MTN Nigeria) as promoter, received an Approval in Principle (AIP) dated 4 November 2021 from the Central Bank of Nigeria (CBN) for a licence application for the proposed MoMo Payment Service Bank Limited,” the statement said.\n“This is the first step in the process towards a final approval, subject to the fulfilment of certain conditions as stipulated by the CBN.\nThe decision to issue a final approval is firmly within the regulatory purview of the CBN and we respect their right and judgment in that regard."
  },
  {
    "headline": "Death toll in Lagos building collapse hits 40",
    "summarized_story": "The number of people that have died in the rubble of a 21-storey building which collapsed on Gerrard Road, Ikoyi, Lagos on Monday has risen to 40.\nThis as the corpses of the Managing Director, Fourscore Heights Limited, developers of the structure, Mr Femi Osibona, and his friend, a United States of America-based Nigerian businessman, Wale Bob-Oseni, have been recovered from the rubble.\nBob-Oseni, was a real-estate dealer who was on his way back to the US on Monday when he got a call from Osibona to check out the project.\nBoth men, alongside many others, were subsequently trapped when the building collapsed.\nTheir bodies were found on Thursday by responders during the recovery operation at the scene of the incident."
  },
  {
    "headline": "MTN Nigeria completes N89.999bn bond issuance, oversubscribed by 1.48 times",
    "summarized_story": "Adebayo ObajemuMTN Nigeria Communications Plc has successfully completed the issuance of N89.999 billion Series II, 10-year 12.75% Fixed Rate Bonds due in 2031 under the N200 billion bond issuance programme.\nThe Series II bond is the second issuance in 2021 by MTN Nigeria, following the successful debut in May 2021.\nThis completes MTN Nigeria’s N200 billion bond issuance programme, which was fully subscribed.\nThe successful Series II bond reflects MTN Nigeria’s strong credit ratings, which was recently upgraded to AAA, investors’ confidence in its ability to maintain market leadership in the telecoms industry, and the depth of the domestic capital market.\nThe net proceeds will be used to optimize MTN Nigeria’s capital structure and finance network expansion."
  },
  {
    "headline": "Stock market dips by 0.08% amidst profit taking",
    "summarized_story": "Adebayo ObajemuThe Nigerian stock market on Thursday closed on a bearish note as the All Share Index declined by 0.08% to close at 41,943.83 points from the previous close of 41,975.45 points.\nThe Market Capitalisation declined by 0.08% to close at N21.889 trillion from the previous close of N21.906 trillion, thereby shedding N17 billion.\nPercentage GainersSCOA Plc led other gainers with 9.47% growth, closing at N1.04 from the previous close of N0.95.\nPercentage LosersPharmadeko led other price decliners as it sheds 10% of its share price to close at N2.34 from the previous close of N2.60.\nLASACO traded about 10.61 million units of its shares in 64 deals, valued at N10.62 million."
  },
  {
    "headline": "NBA To Lawyers: Speak Against Invasion Of Odili’s Residence",
    "summarized_story": "President of the Nigerian Bar Association (NBA), Mr Olumide Akpata, has called on lawyers in the country to speak with one voice in condemnation of attempts to desecrate the sanctity of the country’s judiciary.\nAkpata, while condemning the recent invasion by yet to be identified person on the residence of a Justice of the Supreme Court, Justice Mary Peter-Odili, insisted that lawyers as ministers in the temple of justice must speak with one voice against any evil doing against the bench.\nHe gave the warning in the Supreme Court, yesterday, at a special court session in honor of the late Justice of the court, Justice Samuel Chukwudumebi Oseji.\nWe have also called an emergency meeting of the National Executive Committee of the Association at which immediate next steps were prescribed and adopted.\nADVERTISEMENTJustice Muhammad said the excellent performance of late Justice Oseji on the Bench had ignited a spark of admiration in many levels of courts in the country."
  },
  {
    "headline": "NBA To Lawyers: Speak Against Invasion Of Odili’s Residence",
    "summarized_story": "President of the Nigerian Bar Association (NBA), Mr Olumide Akpata, has called on lawyers in the country to speak with one voice in condemnation of attempts to desecrate the sanctity of the country’s judiciary.\nAkpata, while condemning the recent invasion by yet to be identified person on the residence of a Justice of the Supreme Court, Justice Mary Peter-Odili, insisted that lawyers as ministers in the temple of justice must speak with one voice against any evil doing against the bench.\nHe gave the warning in the Supreme Court, yesterday, at a special court session in honor of the late Justice of the court, Justice Samuel Chukwudumebi Oseji.\nWe have also called an emergency meeting of the National Executive Committee of the Association at which immediate next steps were prescribed and adopted.\nADVERTISEMENTJustice Muhammad said the excellent performance of late Justice Oseji on the Bench had ignited a spark of admiration in many levels of courts in the country."
  },
  {
    "headline": "BREAKING: Police Rescue Abducted UNIABUJA Lecturers, Others",
    "summarized_story": "A joint team of security operatives have rescued all abducted lecturers and family members of the University of Abuja, who were kidnapped from the institution’s staff quarters in Giri area of Gwagwalada Area Council few days ago.\nSome of the abducted victims included Dr Sambo Mohammed and Dr Tobit, who were taken away along side two professors who were identified as Prof. Bassey Ubom and Prof. Obanza Malam.\nUbom was said to have been taken away with his son and daughter.\nADVERTISEMENTThe institution’s staff quarters is located at Giri, in Gwagwalada, about 30 kilometres away from the nation’s federal capital city.\nThe kidnappers later demanded for N300million ransom before they could release the victims but it was unclear if the ransom was paid or not as security operatives announced the rescue of the victims."
  },
  {
    "headline": "BREAKING: Police Rescue Abducted UNIABUJA Lecturers, Others",
    "summarized_story": "A joint team of security operatives have rescued all abducted lecturers and family members of the University of Abuja, who were kidnapped from the institution’s staff quarters in Giri area of Gwagwalada Area Council few days ago.\nSome of the abducted victims included Dr Sambo Mohammed and Dr Tobit, who were taken away along side two professors who were identified as Prof. Bassey Ubom and Prof. Obanza Malam.\nUbom was said to have been taken away with his son and daughter.\nADVERTISEMENTThe institution’s staff quarters is located at Giri, in Gwagwalada, about 30 kilometres away from the nation’s federal capital city.\nThe kidnappers later demanded for N300million ransom before they could release the victims but it was unclear if the ransom was paid or not as security operatives announced the rescue of the victims."
  },
  {
    "headline": "Buhari, Others Eulogise Late Mailafia As Body Is Laid To Rest Friday",
    "summarized_story": "LEADERSHIP reports that Mailafia died on Sunday, September 19, 2021 at the Gwagwalada Specialist Hospital after a brief illness.\nAll thanks to late Dr Mailafia and his team.\n“Additionally, Dr Mailafia was a complete family man and humanitarian whose selfless service to his family and contributions to humanity are enumerable.\nDr Mailafia was courageous, honest and fearless on issues that matter the most.\nChairman of the Board of Trustees of SOKAPU, who spoke for the Union, Elder Steven Bangoji, said, “Dr Mailafia died for the oppressed and stood for those suffering from an unjust system."
  },
  {
    "headline": "Ikoyi building: Developer, friend’s corpses recovered, death toll reaches 40",
    "summarized_story": "One of our reporters, who was at the scene on Thursday, reported that no fewer than 40 corpses had so far been recovered from the site.\nHowever, the Lagos State Governor, Babajide Sanwo-Olu, around 1pm said 32 bodies were recovered.\nFamilies lament delay in identifying corpsesSome relatives of the victims lamented the postponement of the identification of corpses recovered by emergency workers.\nThey recalled that Sanwo-Olu said autopsies were being conducted on the corpses but families would be able to identify their loved ones from Thursday.\nShe said, “The governor said yesterday (Wednesday) that we would be able to see the corpses recovered today (Thursday) and check if our loved ones were there."
  },
  {
    "headline": "Ikoyi building: Developer, friend’s corpses recovered, death toll reaches 40",
    "summarized_story": "One of our reporters, who was at the scene on Thursday, reported that no fewer than 40 corpses had so far been recovered from the site.\nHowever, the Lagos State Governor, Babajide Sanwo-Olu, around 1pm said 32 bodies were recovered.\nFamilies lament delay in identifying corpsesSome relatives of the victims lamented the postponement of the identification of corpses recovered by emergency workers.\nThey recalled that Sanwo-Olu said autopsies were being conducted on the corpses but families would be able to identify their loved ones from Thursday.\nShe said, “The governor said yesterday (Wednesday) that we would be able to see the corpses recovered today (Thursday) and check if our loved ones were there."
  },
  {
    "headline": "Alleged fraud: EFCC releases Obi Cubana, to face court trial",
    "summarized_story": "Top businessman, Obinna Iyiegbu aka Obi Cabana, on Thursday night left the headquarters of the Economic and Financial Crimes Commission after spending three nights with investigators who grilled him on alleged tax fraud, currency abuse and money laundering.\nSpokesman for the EFCC, Wilson Uwujaren, confirmed late on Thursday that Cubana had been released from its custody.\nIt was not clear what the businessman finally did to meet the conditions of his release.\nBut there are indications that the businessman would be summoned in future to defend himself in court over issues bordering on currency abuse, tax fraud and money laundering based on what a top source called ‘verified business transactions’.\nIt will also be recalled that Obi Cubana came to the spotlight following the flamboyant burial he and his followers staged for his late mother earlier this year."
  },
  {
    "headline": "Alleged fraud: EFCC releases Obi Cubana, to face court trial",
    "summarized_story": "Top businessman, Obinna Iyiegbu aka Obi Cabana, on Thursday night left the headquarters of the Economic and Financial Crimes Commission after spending three nights with investigators who grilled him on alleged tax fraud, currency abuse and money laundering.\nSpokesman for the EFCC, Wilson Uwujaren, confirmed late on Thursday that Cubana had been released from its custody.\nIt was not clear what the businessman finally did to meet the conditions of his release.\nBut there are indications that the businessman would be summoned in future to defend himself in court over issues bordering on currency abuse, tax fraud and money laundering based on what a top source called ‘verified business transactions’.\nIt will also be recalled that Obi Cubana came to the spotlight following the flamboyant burial he and his followers staged for his late mother earlier this year."
  },
  {
    "headline": "[BREAKING] Ikoyi: I’m Not Owner Of 21-Storey Building – Osinbajo",
    "summarized_story": "Vice President, Yemi Osinbajo, SAN, has refuted claims that he owns the land upon which the collapsed building in Ikoyi stood.\nOsinbajo, who condoled with the families and relatives of all those who have died and those who were injured or affected in the collapsed building under construction on Gerrard Road, Ikoyi, described the incident as a horrible tragedy.\n”All property and assets owned by the Vice President have been publicly declared.\n”Also, the Vice President has never spoken to the Governor of Lagos State or any other official of the State Government regarding the unsealing of the said building on Gerrard Road, Ikoyi, which subsequently collapsed.\nHe has, indeed, never acted to influence any other regulatory action on the collapsed building, or any other building for that matter, in Lagos State.”Osinbajo further explained that he has no interest and has never had any interest, in the land, the building or development."
  },
  {
    "headline": "BREAKING: Professors, Other Abducted Staff Of Uni-Abuja Rescued, Suspects Arrested",
    "summarized_story": "Two University of Abuja professors and other staff members who were kidnapped recently have recovered their freedom.\nRecall that on Monday, some criminal elements suspected of being kidnappers broke into the university’s staff quarters and carried some inhabitants away to an unknown place.\nThe kidnappers called the victims’ relatives a day after their kidnapping and wanted N300 million in exchange for their release.\nHowever, DSP Josephine Adeh, the Federal Capital Territory Command’s Police Public Relations Officer, verified their release to DAILY POST on Friday morning.\nThe development, she said, came as a result of the command’s efforts in a combined operation with other security agencies."
  },
  {
    "headline": "Ikoyi Building: Developer, Friend’s Corpses Recovered, Death Toll Hits 40",
    "summarized_story": "PUNCH Responders discovered their remains during the recovery effort at the scene of the incident on Thursday, according to Metro.\nOn Thursday, one of our reporters who was on the scene said that no fewer than 40 bodies had been removed from the area.\nHowever, after 1 p.m., Lagos State Governor Babajide Sanwo-Olu said that 32 bodies had been found.\nThe identification of bodies collected by emergency officials has been delayed, according to some relatives of the dead.\nHowever, the state governor, Sanwo-Olu, while addressing journalists on Thursday around 1pm, said the state Ministry of Health was in charge of taking corpses to the morgue."
  },
  {
    "headline": "Gov Ortom Gets New Chief Of Staff",
    "summarized_story": "Governor Samuel Ortom has named Dr Tivlumun Nyitse, a former Permanent Secretary of the Benue Government House Administration, as his new Chief of Staff.\nThe new Chief of Staff was appointed following the resignation of Terwase Orbunde, who left the job to pursue his governorship ambitions in 2023.\nDr Tivlumun Nyitse, a previous governorship candidate in the state, was a lecturer at Bingham University’s Department of Mass Communication in Karu, Nasarawa State, until his appointment.\nGovernor Ortom told reporters that further appointments would be made in the coming days to replace prior appointees who resigned to pursue their own political ambitions in 2023.\nGovernor Ortom addressed the subject of pensions and gratuities, noting that his administration has domesticated the PENCOM Law to permanently fix the problem, and that workers who retire in the next several years will not face any difficulty in receiving their benefits."
  },
  {
    "headline": "Breaking: Police confirm rescue of kidnapped UNIABUJA lecturers, others",
    "summarized_story": "The abducted University of Abuja (UNIABUJA) lecturers and others staff have been rescued, according to the Police.\nThe spokesperson of the Federal Capital Territory Police Command DSP Josephine Adeh who confirmed the development said all the six abducted persons have been rescued and reunited with their families.\nShe said: “The FCT Police Command wishes to inform members of the public that all abducted victims of the University of Abuja were rescued and reunited with their families through a joint operation with other security agencies.”Details of their release was however not provided.\nThe rescued victims had been kidnapped on Tuesday inside the school staff quarters located around Gwagwalada area council of the FCT."
  },
  {
    "headline": "Sit-at-home: At last, South-east govs break silence, reveals next line of action on Nnamdi Kanu",
    "summarized_story": "They said the meeting would also address the pockets of violence in the region and the sit-at-home orders issued by different groups of agitators.\n“We thank our religious leaders, Conference of Bishops and Archbishops of South East, the traditional institutions of South East and Christian Association of Nigeria of South East for their interventions and mediations on this matter.\nHe said: “President Muhammadu Buhari’s meeting with South East leaders during his visit in Owerri was highly commended and indeed a good and strategic step towards reconciliation and reassuring to Igbo.\n“For avoidance of doubt, the name Nigeria is derived from one of the biggest rivers in Africa- River Nigeria.\nI want to point out the fact that Nigeria flag is flying everywhere in Igbo land,” the statement said.”"
  },
  {
    "headline": "Tension as gunmen abduct 11 persons in Abuja, environ within 5 days",
    "summarized_story": "“While Sambisa forest is several kilometers away from Abuja, Kaure is only two hours drive to Abuja,” the governor further added.\nAnd to further ease their operations, sources told Blueprint the security personnel manning the gate was tied by the hoodlums.\nAlso, another anonymous student said students living within and outside the school premises now lived in fear, as cultists now attack students and others around.\nIn a chat with our reporters, Asake Muftau who resides in Jikowyi, an Abuja suburb, said: “We woke up to gridlock on Wednesday and we were told that some people are plotting to attack Abuja.\n“In my opinion, our security personnel need to change their tactics."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "Amotekun: Arrest, parade of Northerners dangerous to Nigeria’s unity –Group -NigPilot",
    "summarized_story": "A socio-political group, the Northern Conscience for 2023, NCfor2023, has described the arrest and parade of some youths believed to have been Northerners by the South West Security Network code-named Amotekun , as dangerous for the unity of Nigeria.\nThe security outfit had arrested 18 youths accused of hiding under bags of beans in a trailer, who were all paraded yesterday.\n“It is even more disturbing when one considers that he claims to be a Senior Advocate of Nigeria (SAN) who should have sound knowledge of the law and the constitution; and the fact that Ametokun is not recognized by the Constitution as a law enforcement agency with powers to parade suspects,” he added.\nThe group’s leader, who maintained that the North remains committed to the unity of Nigeria and the invisibility of the country, warned of grave consequences if the region retaliates the treatment meted it in recent times, by other parts of the country.\nThe country cannot afford to endure the carnage and lawlessness spreading within its borders like wildfire,” Gololo further cautioned."
  },
  {
    "headline": "Impeachment saga: Civil society condemns attack on Gov Lalong -NigPilot",
    "summarized_story": "*Preaches peace to embattled SpeakerThe coalition of Civil Society for Good Governance, CCSGG, has condemned in strong terms tirades and attacks against the Plateau State governor, Barrister Simon Bako Lalong by the impeached Speaker of the State House of Assembly, Rt.\n“Gentlemen of the press, we are aware that Plateau State House of Assembly was the first out of 36 States of the Federation to enjoy legislative and judicial autonomy, even when Hon.\n“The lawmakers decided to impeach their leader based on reasons best known to them and elected Hon.\nYakubu Sanda as new Speaker, which we consider as democracy in action, hence, peace should be allowed to reign at all cost,” the convener stressed.\nIt, however, commended Governor Lalong for his maturity and leadership that has ensured peace and tranquility as well as socio-economic and infrastructural development of the state, while calling on the citizens, particularly the youths not to allow themselves to be used."
  },
  {
    "headline": "East-West Road has gulped N359bn- Akpabio -NigPilot",
    "summarized_story": "Minister of Niger Delta Affairs, Sen. Godswill Akpabio has disclosed that over N359billion has so far been expended on the 657km dual carriage East-West Road stretching from Calabar in Cross River State, to Effurun in Delta State since it was initiated in 2006.\nAkpabio said bearing in mind the objectives of President Muhammadu Buhari on the completion of ongoing projects, the Niger Delta Ministry was considering raising funds from other sources to ensure the completion of section I-IV of the road before the end 2023.\nThe minister made this statement during the Ministry’s 2021 Budget Performance Review and 2022 Proposed Budget Consideration to the House of Representative Committee on Niger Delta Affairs on Tuesday in Abuja.\nSpeaking earlier, during the budget presentation the Chairman House of Representative Committee on Ministry of Niger Delta Affairs Hon.\nEssien Ekpeyong, assured that the Legislature is committed to the security of lives and investment in the Niger Delta region and for economic and social activities to strive."
  },
  {
    "headline": "I don’t need god-father to be APC national Chairman – Moniedafe",
    "summarized_story": "One of the prominent contenders for the national chairmanship position of the ruling All Progressives Congress, APC, Chief Sunny Sylvester Moniedafe, on Monday canvassed for the abolition of the concept of godfatherism in Nigerian politics saying it can not last any longer.\nHe said, “This thing is all about I need god-father, and this is what I want us to completely forget about.\nSunny Moniedafe, who threw his hat into the ring for the party’s national chairmanship office in March, 2021 belonged to the ACN bloc and was the Abuja chairman of the party.\nHe was Secretary of ACN in the FCT before the formation of the mega APC.\nHowever, unlike some of the aspirants in the APC national chairmanship race who are publicly backed by one or more prominent figures in the party, Mr Moniedafe at the moment has only his campaign promises."
  },
  {
    "headline": "PHOTOS: Major Roads, Streets In Awka Deserted Hours To Anambra Election",
    "summarized_story": "As stakeholders mobilise for the governorship election in Anambra State, major roads and streets in Awka have been deserted.\nThere were no signs of last-minute shopping ahead of the polls, which is scheduled to begin in less than 24-hours.\nMeanwhile, the Independent National Electoral Commission (INEC) says it has made necessary arrangements to conduct a free and fair election.\nAmid concerns over the security of voters, the South East Governors’ Forum has asked residents to go to their respective polling units without fear.\nWe wish Anambra people a peaceful election on 6th November 2021.”The situation in Awka, less than 24 hours to the election, are captured in the photos below:"
  },
  {
    "headline": "Osinbajo Distances Self From Collapsed Ikoyi Building, Says He Never Had Interest",
    "summarized_story": "The Vice President, Professor Yemi Osinbajo, says he has no connection with the land or the high-rise building that collapsed while under construction on Gerrard Road in Ikoyi, Lagos.\nIn a statement on Friday, the Vice President’s spokesman, Laolu Akande, stated that his principal has no interest in the said property.\nBut Akande insisted that the Vice President never spoke with the state governor or any other official of the government regarding the unsealing of the building.\nHe added that his principal never acted to influence any other regulatory action on the collapsed building or any other structure in Lagos.\n“The Vice President restates categorically that he has no interest whatsoever, and has never had any interest, either legally or beneficially, in the land, the building or development,” said the Vice President’s spokesman."
  },
  {
    "headline": "Abducted UNIABUJA Professors, Four Others Rescued",
    "summarized_story": "The six persons abducted from the University of Abuja (UNIABUJA) in the Federal Capital Territory (FCT) have regained freedom.\nThey were rescued about three days after gunmen attacked the staff quarters of the university in Gwagwalada Area Council of the nation’s capital.\nREAD ALSO: Professors, Four Others Abducted As Gunmen Attack UNIABUJA Staff QuartersThose abducted included two professors, a senior lecturer, and three of their family members.\nChairman of the Academic Staff Union of Universities (ASUU), UNIABUJA Chapter, Dr Kasim Umar, who also confirmed that the victims have been rescued, stated that no ransom was paid.\nChannels Television had reported that gunmen attacked the senior staff quarters of the university at about 1am on Tuesday."
  },
  {
    "headline": "Friday Brief: Anambra Candidates Sign Peace Deal & Lawmakers Grill Amaechi",
    "summarized_story": "Anambra governorship candidates sign peace pactCandidates in the imminent Anambra governorship election signed a peace accord in Awka, the state captial, on Thursday.\nThe peace accord ceremony was organised by the National Peace Committee, which is chaired by former military Head of State, General Abdulsalami Abubakar.\nGovernor Babajide Sanwo-Olu, who visited the scene on Thursday, noted that 32 bodies have been recovered from the building collapse.\nForward steps: The Governor visited survivors of the building collapse at the hospital on Thursday before inaugurating a tribunal of inquiry into the incident.\nBabatunde Fashola: The Federal Minister of Works and Housing has described the building collapse as a “horrific tragedy“."
  },
  {
    "headline": "Five Ways Artificial Intelligence Could Shape Our Lives",
    "summarized_story": "Tech evangelists habitually brim with enthusiasm over artificial intelligence’s potential to transform our lives, and the crowds at this year’s Web Summit were no exception.\nHealthcareWhen Iker Casillas learned of a start-up that uses AI to better detect irregular heart rhythms, he swiftly signed up as an investor.\nThe Spanish football legend had suffered a heart attack in 2019, putting a brutal end to his career.\nMadrid-based company Idoven analyses data from home heart monitoring kits to track people’s cardiac health — and crucially, to flag up looming problems.\nIrish startup Provizio is developing technology that uses machine learning to analyse data from sensors attached to a car."
  },
  {
    "headline": "IPOB announces cancellation of one week sit-at-home",
    "summarized_story": "The proscribed Indigenous People of Biafra, IPOB, has announced the cancellation of its one week Sit-At-Home order earlier scheduled to commence across the Southeastern states.\nThis was contained in a statement issued on Thursday by the group’s spokesman, Emma Powerful and made available to newsmen.\nIt’s never our intention to add to the pains of our people, hence our decision to suspend the sit-at-home,” the statement said.\nIPOB however, warned those it described as “detractors, traitors and enemies of Biafra not to cause confusion by imputing motives to our decision.\n“IPOB still believes that our elders, religious leaders, political leaders and various stakeholders will live up to their promises in their engagements and efforts towards securing the unconditional release of our leader."
  },
  {
    "headline": "BREAKING: Emergency responders recover body of owner of collapse 21 storey building -",
    "summarized_story": "A combined team of emergency responders has recovered the body of Femi Osibona, owner of the 21 storey building that collapsed in Ikoyi axis of the state three days after the building caved in.\nAs gathered, the lifeless body of the building owner, Femi Osibona, was recovered Thursday evening after frantic efforts from emergency responders working since Monday when the incident occurred.\nThe 21 floors building was owned and constructed by Osibona’s company Fourscore Heights Limited."
  },
  {
    "headline": "Police in Zamfara inaugurate 10 bed space Clinic for treatment of wounded troops -",
    "summarized_story": "Police in Zamfara have inaugurated a ten bed space clinic that will assist in the treatment of wounded troops working to keep peace in the state.\nThe clinic according to police authorities will also serve as treatment center for other security agencies and the general publicPolice and other security agencies have been working to keep peace in trouble areas across Zamfara State for about fifteen yearsIn the cause of the operation, many troops lost their lives while saveral others sustained various degrees of injuries in the quest for peaceThe Commissioner of police Zamfara State Command Ayuba Elkanah and the Commander 42 Police Mobile Base Gusau, Assistant Commissioner of Police Murtala Minjibir said the project becomes necessary Considering the numbers of troops working to restore peace in the stateAccording to the duo, the clinic will also help in giving medical care to the family of the personnel.\nACP Minjibir said, wounded troops will now get quick medical attention than ever before.\nOn his part, the zamfara state governor Bello Matawalle represented by the speaker of the state House of Assembly Nasiru Mu’azu Magarya commend the police for the initiative and promise to support the projectMagarya said the Matawalle’s led Government will continue to give welfare of troops all the needed support in their search to making zamfara a crime free stateThe zamfara state Commissioner Of Police Ayuba Elkanah further appeal to sister agencies to emulate the initiative to Boost morale of troops.\nThe clinic which is named after the Commander 42PMF Gusau, ACP Murtala Minjibir is located at the Headquarters of the forty two mobile police base Gusau, Zamfara State."
  },
  {
    "headline": "USDA, NABDA, others laud introduction of Biotech Cowpea in Nigeria",
    "summarized_story": "The introduction of biotech cowpea in Nigeria has been commended by the US Department of Agriculture’s Foreign Agricultural Service, Nigeria’s National Biotechnology Development Agency (NABDA), and agriculture and biotech specialists.\nHe noted that the success of the transgenic bean has added a new crop to the global biotech basket from Africa.\n“Thousands of farmers across Nigeria who planted the biotech cowpea this planting season attest to the multiple benefits they derived compared to prior seasons.\n“The workshop was a prime occasion for stakeholders in the biotech space to strengthen innovative partnerships, especially public, private partnerships that will drive the future of biotechnology in Nigeria.\nThe commercialization of biotech cowpea has become the latest milestone in Nigeria’s robust biosafety regulatory process,” Smith noted."
  },
  {
    "headline": "Ikoyi Building Collapse Day 4: Over 30 Dead, Lagos Declares 3 Days of Mourning",
    "summarized_story": "The death toll following the collapse of an incomplete 21-storey building in the Ikoyi area of Lagos has topped 30 people.\nYet another day has passed without any new survivor recorded since Tuesday.\nThe Lagos State Government has declared 3-days of mourning and has inaugurated a 6-member panel to investigate the collapse.\nFor a wrap on the fourth day of search and rescue operation, Arise Correspondent, Adefemi Akinsanya reports."
  },
  {
    "headline": "Tigray and Oromo Forces, Other Groups Form Alliance Against Ethiopia PM Abiy",
    "summarized_story": "Ethiopia’s Tigray forces are joining with other armed and opposition groups in an alliance against Prime Minister Abiy Ahmed to seek a political transition after a year of devastating war, organizers say.\nThe signing in Washington on Friday includes the Tigray forces that have been fighting Ethiopian and allied forces, as well as the Oromo Liberation Army now fighting alongside the Tigray forces and seven other groups from around the country.\nThe U.S. said he met with the deputy prime minister and defense and finance ministers on Thursday.\nA spokesman for the Oromo Liberation Army, Odaa Tarbii, confirmed the new alliance.\nThe spokeswoman said she had no further comment Friday, and had no information on whether the prime minister would be meeting with the U.S. special envoy."
  },
  {
    "headline": "US Special Envoy Arrives Ethiopia as America Scrambles to Avert Bloodshed in Addis Ababa",
    "summarized_story": "The US is an ally of Prime Minister Abiy Ahmed’s government but insisted it would not tolerate unjustified violence on the part of the Ethiopian government.\nThe special envoy is in Addis Ababa to stop military operations and had a ceasefire roundtable between the warring parties.\n“A multi-decade civil war in Ethiopia would be disastrous for its future and for its people,” Feltman warned.\n“Let me be clear: We oppose any TPLF move to Addis or any attempt by the TPLF to besiege Addis.\nThe combative statement could dampen hopes for a negotiated settlement between the government of Prime Minister, winner of the 2019 Nobel Peace Prize, and the TPLF rebel group."
  },
  {
    "headline": "Ikoyi Building Collapse: Sanwo-Olu Declares Three Days of Mourning in Lagos",
    "summarized_story": "Governor Babajide Sanwo-Olu has declared three days of mourning in Lagos State over the Ikoyi building collapse tragedy which occurred on Monday.\nThe Lagos State Government in a statement signed by Commissioner for Information and Strategy, Mr. Gbenga Omotoso commiserated with all those who lost their loved ones in the unfortunate incident.\nSanwo-Olu, who described the event as a “sad one” for Lagos was visibly in a sombre mood during the inauguration.\nThe governor believed the tribunal members would bring their expertise and professionalism to bear in unravelling the infractions that brought down the building.\nAyinde said Lagos was in its “dark period”, given the record of fatalities from the site of the building collapse."
  },
  {
    "headline": "Ford Motor Issues Green Bonds, to Retire $5bn In High-Interest Debt",
    "summarized_story": "Ford Motor plans to retire up to $5 billion in high-interest debt and tap into the fast-growing market for “green” bonds to help it finance new electric vehicles and expand credit to customers with lower scores.\nThe automaker aims to regain an investment grade rating for itself and Ford Credit, its captive financing arm, which in turn would lower the cost of future borrowing.\nFord expects initially to offer a $1 billion green bond at 3.5% to 4% interest, to replace some of the high-coupon bonds and to supplement the zero-interest convertible debt it issued earlier this year.\nPart of the money will help fund the automaker’s ambitious plan to convert a significant portion of its global production from fossil-fueled combustion engine vehicles to battery-powered electric vehicles.\nNew green bonds would enable Ford Credit to extend financing to customers with lower credit scores, but would not require them to buy electric or hybrid vehicles."
  }
]