[
  {
    "headline": "BREAKING: Controversy trails alleged kidnap of Okorocha’s son-in-law, Uche Nwosu",
    "summarized_story": "There was panic in Imo State on Sunday after a son-in-law to a former governor of the state, Uche Nwosu, was whisked away from a church service at his hometown, Eziama Obieri in the Nkwerre Local Government Area of the state.\nThey shot indiscriminately before taking their target away, as his security operatives watched without resisting the gun-wielding persons.\nWhile some of Nwosu’s associates alleged that he was kidnapped, others alleged that his arrest was masterminded by the state governor, Hope Uzodinma.\nBut in a swift reaction, the state commissioner for Information and strategy, Declan Emelumba, said that the governor had no hand in what happened.\nHe promised to update our correspondent once he was briefed by security operatives in whose division the incident happened."
  },
  {
    "headline": "No trips for Afghan women unless escorted by male relative -Taliban",
    "summarized_story": "Afghanistan’s Taliban authorities said Sunday that women seeking to travel anything other than short distances should not be offered transport unless they are accompanied by a close male relative.\nThe ministry had also called on women TV journalists to wear hijabs while presenting.\nMuhajir said Sunday that the hijab would also be required for women seeking transport.\nIn several provinces, local Taliban authorities have been persuaded to reopen schools — but many girls still remain cut off from secondary education.\nThey were then forced to wear the all-covering burqa, only allowed to leave home with a male chaperone and banned from work and education."
  },
  {
    "headline": "Over 500 Muslims meet Christians at Christmas Church service in Kaduna",
    "summarized_story": "By Ibrahim Hassan-WuyoAt Christmas; hundreds of Muslims attended church service in kaduna to promote peace and unity.\n“This is the 10th year the church has been hosting Muslims from various states for Christmas celebration “,he said.\n“Last year, the number of Muslims that attended the church services outnumbered the Christians, and this year also many Muslims attended the church services.”“Over 500 muslims from Kaduna,Kano,Zamfara,Katsina,Abuja and Niger states joined us at today’s Christmas service to promote peace and unity”“We have counted them one by one and got 525 Muslims that attended todays sermon.\n““All the muslims that attended the christmas service were from all islamic sects which included Tijjaniya,Shiiat,kadriyya and sunni.\nHajiya Sumayya Gali ,a Muslim lady, said they attended the church service because PastorYohanna usually bring some of his church members to celebrate Maulud with them."
  },
  {
    "headline": "Presidential aides test positive to Covid-19",
    "summarized_story": "President Muhammadu BuhariBy Johnbosco AgbakwuruA number of presidential aides have reportedly tested positive to Covid-19 and are now on self-isolation.\nThe online newspaper said their results were confirmed positive during the week.\nThe report quoted the presidential spokesman, Shehu as saying: “I have no confirmation of the cases you mentioned, but yes I have been afflicted by the mild variant of the COVID-19.\nShe had given a similar directive in the past as Covid-19 started to gain ground in the country.\nWhen Shehu was reached over the report Saturday, he said: “Have you read the Premium Times report?"
  },
  {
    "headline": "Avoiding another shutdown of varsities",
    "summarized_story": "UNLESS sanity prevails, the nation might be plunged into another round of strikes by university staff unions, the second this year.\nThe series of ASUU strikes over the failure of the Federal Government to fulfill its part of the Memoranda of Understanding (and Action) dates back to more than ten years across three regimes.\nASUU President, Prof. Emmanuel Osodeke, while announcing the latest ultimatum, said government has again failed to honour the agreement it signed.\nThe Minister of Labour and Employment, Dr. Chris Ngige, has, however, assured Nigerians that “the strike will not happen, funds are available”.\nThe ASUU, NASU and SSANU strikes must be nipped in the bud."
  },
  {
    "headline": "BREAKING: South Africa’s Nobel Peace laureate, Archbishop Desmond Tutu dies at 90",
    "summarized_story": "South Africa’s Nobel Peace Prize laureate, Archbishop Desmond Tutu, who helped end apartheid in South Africa, has died aged 90.\nPresident Cyril Ramaphosa said the churchman’s death marked “another chapter of bereavement in our nation’s farewell to a generation of outstanding South Africans”.\nHe said Archbishop Tutu had helped bequeath “a liberated South Africa”.\nTutu was one of the country’s best-known figures at home and abroad.\nHe was awarded the Nobel prize in 1984 for his role in the struggle to abolish the apartheid system."
  },
  {
    "headline": "BREAKING: Okorocha’s son-in-law, Uche Nwosu kidnapped",
    "summarized_story": "Uche NwosuBy Chinonso AlozieSuspected gunmen on Sunday morning abducted the Former Governor of Imo State, Rochas Okorocha’s son-in-law, Uche Nwosu.\nVanguard gathered the incident happened at about 11: 55 am at the front of St Peter’s Anglican Church in Eziama in Nkwerre Local Government Area of Imo state.\nThey are men armed up to 10.”At the time filling this report, tension has taken over the atmosphere of the Eziama Obiere community in Nkwerre local government, the home town of Nwosu.\nWhen Vanguard called the State Commissioner of Police, Rabiu Hissani, his phone number was switched off.\nIt was however gathered from unconfirmed sources that Nwosu might have been whisked away by security agencies."
  },
  {
    "headline": "Saraki reacts to death of South Africa’s Archbishop, Desmond Tutu",
    "summarized_story": "Former Senate President, Bukola Saraki has reacted to the death of South Africa’s Archbishop, Desmond Tutu.\nDAILY POST had earlier reported that Tutu, one of the voices against apartheid in South Africa, died at the age of 90.\nReacting, Saraki, in a tweet via his Twitter handle on Sunday, joined South Africans, millions across the globe, to celebrate the positive impact that Tutu made in the world.\nHe described the late Archbishop as a calm and courageous leader who always spoke the truth to power.\n“Calm, yet courageous, Archbishop Desmond Tutu was a faith-based leader who always spoke truth to power."
  },
  {
    "headline": "Electoral Act: Nigeria’s democracy doomed – Bishop Yahaya tasks NASS",
    "summarized_story": "Bishop Timothy Yahaya of Anglican Communion, Kaduna Diocese, has expressed concern over the increasing security challenges in the country.\nHe explained, “The Prince of peace is born, and I wish the world the peace that passes human understanding.\nWe want peace everywhere.”On the rejection of the amended Electoral Bill by President Muhammadu Buhari, Bishop Yahaya noted that it indicated that Nigeria had not started practicing democracy, saying that the political system was doomed.\nThe Clergy stated that Mr. President’s refusal to sign the electoral Act amendment bill meant that Nigeria had not started democracy.\nHe lamented that the electoral process had been hijacked in Nigeria, stressing that for the National Assembly to please Nigerians, the electoral bill should be signed into law."
  },
  {
    "headline": "FCCPC, CBN, EFCC hunt money lenders harassing Nigerians",
    "summarized_story": "The Federal Competition and Consumer Protection Commission (FCCPC) is going after money lenders violating the rights of Nigerians.\nThe team includes representatives of FCCPC, Central Bank of Nigeria (CBN) and Economic and Financial Crimes Commission (EFCC).\nOthers are from National Information Technology Development Agency (NITDA) and National Human Rights Commission (NHRC).\nThe committee has been tasked to come up with rules money lending companies must obey.\nOn complaints about insurance companies’ services, Irukera says a Memorandum of Understanding (MoU) with the National Insurance Commission (NAICOM) is underway."
  },
  {
    "headline": "South Africa’s Archbishop, Desmond Tutu is dead",
    "summarized_story": "Archbishop Desmond Tutu, one of the voices against apartheid in South Africa, has passed on.\nPresident Cyril Ramaphosa said the death marked “another chapter of bereavement in our nation’s farewell to a generation of outstanding South Africans”.\nTutu, a Nelson Mandela ally, ensured an end to the policy of racial segregation.\nThey rose against the discrimination by the white minority government against the black majority in South Africa.\nTutu was awarded the Nobel prize in 1984 for his role in the struggle."
  },
  {
    "headline": "Christmas: Kano govt shuts down two public conveniences",
    "summarized_story": "Kano State Task Force Committee on Sanitation, on Christmas Day, shut down two public conveniences in the State metropolis for poor sanitary conditions.\nDr Kabiru Getso, the Chairman of the Committee, disclosed this on Saturday after monitoring the monthly environmental sanitation exercise in Kano metropolis.\nGetso, who double as Kano’s Commissioner for Environment, announced that abatement notice was issued to six other public conveniences in the metropolis.\nHe said, “They have been given a week ultimatum to amend their ways else they will be sanctioned by the mobile court attached to the sanitation committee.”Getso also hailed the efforts of residents and Tipper Drivers Association for supporting the exercise.\nHe said, “we tagged the December exercise as special because it is the final one for the year and conducted on Christmas Day, though there was not a restriction of movements.”"
  },
  {
    "headline": "BREAKING: Okorocha’s in-law Nwosu abducted",
    "summarized_story": "Gunmen on Sunday abducted a former governorship candidate in Imo State, Uche Nwosu.\nHe was kidnapped at the St. Peter’s Anglican Church, Eziama-Obaire in Nkwerre Local Government Area of Imo State.\nThe incident occured during the Outing Service of the victim’s mother, late Jemamah Nwosu.\nNwosu was in the village for the burial last weekend.\n- Advertisement -According to eyewitnesses, the gunmen stormed the church while service was still on and shot into the air."
  },
  {
    "headline": "BREAKING: NEXT Cash and Carry mall in Abuja on fire",
    "summarized_story": "BREAKING: NEXT Cash and Carry mall in Abuja on fireA popular shopping mall in Abuja, Next Cash and Carry, located along Ahmadu Bello Way, Kado, is on fire.\nThe cause of the fire is yet to be ascertained.\nThe fire was still raging as efforts by fire fighters to put it under control were ongoing at the time of filing this report.\nThe mall is believed to be owned by former Anambra State Governor Peter Obi.\nDetails shortly…"
  },
  {
    "headline": "VIDEO: NEXT shopping mall on fire in Abuja",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "BREAKING: Ooni breaks silence after Olori Naomi’s divorce post",
    "summarized_story": "The Ooni of Ife, Oba Adeyeye Ogunwusi, has broken silence after his estranged wife, Prophetess Naomi Silekunola, announced her separation from him through an Instagram post on December 23.\nThe 28-year-old prophetess had in a statement posted on her verified Instagram handle – @queen_silekunolanaomi_ogunwusi – announced an end to her three-year-old marriage with the Ooni.\nThe Palace spokesman, Chief Moses Olafare, told The Nation that the monarch still loves Olori Naomi, and that he was packaging a special gift for her.\nThe 47-year-old monarch in his post said: “I join all and sundry in the joyous occasion of this particular season.\nAs we all know it’s one of joy, celebrations and a deep reflection on what Olódùmarè has done through the year."
  },
  {
    "headline": "Nigeria’s politics passing through changes for enduring progressive governance – APC governors",
    "summarized_story": "The Progressives Governors Forum (PGF) says Nigeria’s politics is going through fundamental changes to institute enduring progressive governance.\n- Advertisement -“The politics of Nigeria is passing through fundamental changes, which is a necessary condition for the institution of enduring progressive governance.\nIt also acknowledged Bagudu’s initiatives to ensure sustained unity among the team of Progressive Governors.\nAbdulahi Sule of Nasarawa State on his 62nd birthday on behalf of Progressive Governors Forum.\n“Along with the people of Nasarawa State, and other well-meaning Nigerians, we celebrate this special occasion with you and your family."
  },
  {
    "headline": "BREAKING: AA governorship candidate Uche Nwosu kidnapped",
    "summarized_story": "From Stanley Uzoaru,OwerriFormer governorship candidate of the Action Alliance,Uche Nwosu has been abducted by gunmen today.\nDetails of his abduction is still sketchy as at the time of this report but witnesses at the church said the gunmen where heavily armed and stormed the church premises in great numbers.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nNwosu is also the son -in-law to former governor of the State,Rochas Okorocha.\nDetails later."
  },
  {
    "headline": "BREAKING! Archbishop Desmond Tutu dies at 90",
    "summarized_story": "Archbishop Desmond Tutu of South Africa, the Nobel Peace prize laureate who helped end apartheid in that country, has died at aged 90.\nPresident Cyril Ramaphosa said the Archbishop’s death marked “another chapter of bereavement in our nation’s farewell to a generation of outstanding South Africans”.\nHe said Archbishop Tutu had helped bequeath “a liberated South Africa”.\nHe was awarded the Nobel prize in 1984 for his role in the struggle to abolish the apartheid system.\nPresident Ramaphosa said Tutu was “an iconic spiritual leader, anti-apartheid activist and global human rights campaigner”."
  },
  {
    "headline": "20% pay rise: Police officers unhappy, indifferent",
    "summarized_story": "From Molly Kilete, AbujaWhen President Muhammadu Buhari announced the approval of 20 per cent salary increase for officers and men of the Nigerian Police Force (NPF) on December 15, there was jubilation and mixed reactions not just among the officers, but also the general public.\nSome police officers who spoke to Sunday Sun have mixed feelings about the increase, saying that the problem in the force was more than salary increase.\nMore than the salary increase, many police officers said that they would prefer that government provide them with good healthcare facility, scholarship for their children, good and affordable accommodation, transport system, among other goodies to make their job comfortable.\nAn Inspector of police who spoke to Sunday Sun said: “I heard the president has increased our salary by 20 per cent.\nTo him, the 20 per cent increase is nothing to write home about and should not be something to use to praise the achievements of the Buhari’s government."
  },
  {
    "headline": "Christmas: Osinbajo, govs, senators, others felicitate with",
    "summarized_story": "Governor Abiodun made the call at a church service held at the St. James’ Anglican Church, Iperu-Remo, Ikenne Local Government Area yesterday.\nNoting that the country’s present challenges were surmountable, he said: “God has kept us alive despite the raging COVID-19 pandemic.\nKebbi State Governor, Senator Abubakar Atiku Bagudu has felicitated with Christians as they celebrate this year’s Christmas and urged them the period to continue to live in peace with each other irrespective of their religious, political and ethnic differences.\nWith Christian faithful marking the birth of Jesus Christ, Kebbi State governor, Senator Abubakar Atiku Bagudu has called for peaceful coexistence, unity, and patriotism.\nStephen Adegbite, called on Christians to celebrate Christmas by helping the less fortunate and also go for COVID-19 vaccination."
  },
  {
    "headline": "NANS berates Akeredolu over non-payment of poly workers",
    "summarized_story": "From Bamigbola Gbolagunte, AkureOndo State chapter of the National Association of Nigerian Students (NANS) has berated the administration of Governor Rotimi Akeredolu over the non-payment of 14 months salaries of some staff of the state-owned Rufus Giwa Polytechnic, Owo.\nThe Non Academic Staff of the Polytechnics had embarked on an industrial action as a result of the non-payment of their salaries.\nThe students’ body in a statement by Mr Surprise Omotoso frowned at the action of the state government, saying that the present administration is insensitive to the yearning of the workers.\n“It’s also an apparent show of lack of sympathy and empathy on the part of the Ondo State government led by Governor Akeredolu.\n“The detrimental effect of the industrial action embarked upon by the Non Academic Staff Union would have its effect on the students of the institution."
  },
  {
    "headline": "Archbishop Desmond Tutu is Dead",
    "summarized_story": "Archbishop Desmond Tutu, the Nobel Peace prize laureate who helped end apartheid in South Africa, has died aged 90.\nHe said Archbishop Tutu had helped bequeath “a liberated South Africa”.\nTutu was one of the country’s best known figures at home and abroad.\nHe was awarded the Nobel prize in 1984 for his role in the struggle to abolish the apartheid system.\nPresident Ramaphosa said Tutu was “an iconic spiritual leader, anti-apartheid activist and global human rights campaigner”."
  },
  {
    "headline": "In Christmas Dispatch, Buhari Promises Nigerians End to Killings, Kidnappings",
    "summarized_story": "Hope, Peace, Joy, Love are the recurring themes of this time.\nUrges Citizens to Get VaccinatedAlso in the Christmas message, the President pleaded with all citizens to get vaccinated against COVID-19.\nIgnatius Kaigama yesterday lamented that the hearts of Nigerians are heavy with the suffering they had experienced and seen in 2021 alone.\nThe bishops said Nigerians should always remember the popular Christmas refrain, Emmanuel which is that “God is with us” and try to be hopeful of a better future.\nIn its Christmas message issued by the Catholic Bishops Conference of Nigeria (CBCN) jointly signed by the President, Most Rev."
  },
  {
    "headline": "FG: ISWAP’s Ability to Launch Rockets on Borno Disturbing",
    "summarized_story": "This is just as the federal government allayed the fears of Nigerians over the reported planned attack by terrorists on Abuja, the nation’s capital.\nISWAP had launched multiple rockets on Maiduguri, the state capital, hours before the visit of the President to Borno State.\nHe said: “The marching orders are always the same; you have even told Nigerians the marching orders of the President.\nGanduje Demands Deployment of more SoldiersGovernor Abdullahi Ganduje of Kano State has asked President Muhammadu Buhari to deploy more military personnel to forests in the state.\n“In Kano State, we have taken some measures."
  },
  {
    "headline": "NCDC: 45 Cases of Omicron so far Detected in Nigeria",
    "summarized_story": "*Says country now experiencing community transmission of variantOnyebuchi EzigboThe Nigeria Centre for Disease Control (NCDC) yesterday announced that 45 cases of the Omicron variant of COVID-19 had so far been recorded in the country, with no death logged.\nNCDC Director-General, Dr Ifedayo Adetifa, who disclosed the Nigerian Omicron statistics at a virtual media briefing, said the new cases were in people without travel history, which suggested that the country was already experiencing community transmission.\nAdetifa said the six cases of Omicron earlier detected were in persons with recent travel history to South Africa.\nAccording to him, it is important for Nigerians to maintain physical distance and avoid contact with anyone showing symptoms of respiratory illness.\nThe agency however said all the COVID-19 vaccines in the country offered significant protection against the Omicron variant, and that two doses should still ward off severe disease."
  },
  {
    "headline": "Buhari in Borno, Promises to Cater for Families of Dead, Wounded Soldiers",
    "summarized_story": "* Says with new hardware, military more prepared to flush out terroristsDeji Elumoye in AbujaPresident Muhammadu Buhari, yesterday, said his administration would support families of dead and wounded soldiers, and help them realise their potential.\nBuhari stated this in Maiduguri, the Borno State capital, when he addressed troops at the Nigerian Air Force Base.\nBuhari assured the families of soldiers, who paid the supreme price for the country, and the injured that the federal government would cater for their needs, in recognition of their sacrifices for all Nigerians.\nI am also happy with the increased level of cooperation between the good people of Borno State, other stakeholders and the security agencies.\nThis intervention will benefit not only students from Borno and the North-east but also students from all parts of Nigeria."
  },
  {
    "headline": "BREAKING: South Africa's Archbishop Desmond Tutu Is Dead",
    "summarized_story": "Archbishop Desmond Tutu, the Nobel Peace Prize laureate who helped end apartheid in South Africa, has died aged 90.\nPresident Cyril Ramaphosa said the churchman's death marked \"another chapter of bereavement in our nation's farewell to a generation of outstanding South Africans\".\nHe said Archbishop Tutu had helped bequeath \"a liberated South Africa\".\nTutu was one of the country's best-known figures at home and abroad, BBC News reports.\nHe was awarded the Nobel prize in 1984 for his role in the struggle to abolish the apartheid system."
  },
  {
    "headline": "BREAKING: South Africa's Archbishop Desmond Tutu Is Dead",
    "summarized_story": "Archbishop Desmond Tutu, the Nobel Peace Prize laureate who helped end apartheid in South Africa, has died aged 90.\nPresident Cyril Ramaphosa said the churchman's death marked \"another chapter of bereavement in our nation's farewell to a generation of outstanding South Africans\".\nHe said Archbishop Tutu had helped bequeath \"a liberated South Africa\".\nTutu was one of the country's best-known figures at home and abroad, BBC News reports.\nHe was awarded the Nobel prize in 1984 for his role in the struggle to abolish the apartheid system."
  },
  {
    "headline": "COVID-19 Hits Nigeria’s Presidential Villa As Garba Shehu, Lai Mohammed, Other Buhari’s Appointees, Permanent Secretary Contract Virus",
    "summarized_story": "The fourth wave of the Coronavirus pandemic has hit Nigeria’s Presidential Villa as many aides of President Muhammadu Buhari and top officials of government have reportedly contracted the virus.\nI felt okay from the beginning, maybe because one had received all three jabs, and right now, I feel 100 per cent.\n“But the strange thing about this ailment is that it is the scientists, not you, that will say you are okay.\nOn his part, the Special Assistant to the President on Digital and New Media, Tolu Ogunlesi, said he could not comment on the matter.\nHowever, reliable sources confirmed that Mohammed and other affected officials are currently in isolation and are receiving medical attention."
  },
  {
    "headline": "COVID-19 Hits Nigeria’s Presidential Villa As Garba Shehu, Lai Mohammed, Other Buhari’s Appointees, Permanent Secretary Contract Virus",
    "summarized_story": "The fourth wave of the Coronavirus pandemic has hit Nigeria’s Presidential Villa as many aides of President Muhammadu Buhari and top officials of government have reportedly contracted the virus.\nI felt okay from the beginning, maybe because one had received all three jabs, and right now, I feel 100 per cent.\n“But the strange thing about this ailment is that it is the scientists, not you, that will say you are okay.\nOn his part, the Special Assistant to the President on Digital and New Media, Tolu Ogunlesi, said he could not comment on the matter.\nHowever, reliable sources confirmed that Mohammed and other affected officials are currently in isolation and are receiving medical attention."
  },
  {
    "headline": "COVID-19 Hits Nigeria’s Presidential Villa As Garba Shehu, Lai Mohammed, Other Buhari’s Appointees, Permanent Secretary Contract Virus",
    "summarized_story": "The fourth wave of the Coronavirus pandemic has hit Nigeria’s Presidential Villa as many aides of President Muhammadu Buhari and top officials of government have reportedly contracted the virus.\nI felt okay from the beginning, maybe because one had received all three jabs, and right now, I feel 100 per cent.\n“But the strange thing about this ailment is that it is the scientists, not you, that will say you are okay.\nOn his part, the Special Assistant to the President on Digital and New Media, Tolu Ogunlesi, said he could not comment on the matter.\nHowever, reliable sources confirmed that Mohammed and other affected officials are currently in isolation and are receiving medical attention."
  },
  {
    "headline": "BREAKING: Uche Nwosu, Okorocha's son-in-law, kidnapped in church",
    "summarized_story": "Uche Nwosu, the former governorship candidate of Action Alliance (AA) in Imo in the 2019 governorship election, has been abducted.\nAdvertisementNwosu is the son-in-law of Rochas Okorocha, a senator and former governor of Imo state.\nHe was on Sunday kidnapped inside St. Peter’s Anglican Church, Umunwokwe village Eziama-Obaire Nkwerre LGA of Imo State by unidentified gunmen during the thanksgiving outing Service in honour of his Late later mother, Jemaimah Adaeze Nwosu, who was laid to rest last Wednesday.\nMore to follow…"
  },
  {
    "headline": "BREAKING: Uche Nwosu, Okorocha's son-in-law, kidnapped in church",
    "summarized_story": "Uche Nwosu, the former governorship candidate of Action Alliance (AA) in Imo in the 2019 governorship election, has been abducted.\nAdvertisementNwosu is the son-in-law of Rochas Okorocha, a senator and former governor of Imo state.\nHe was on Sunday kidnapped inside St. Peter’s Anglican Church, Umunwokwe village Eziama-Obaire Nkwerre LGA of Imo State by unidentified gunmen during the thanksgiving outing Service in honour of his Late later mother, Jemaimah Adaeze Nwosu, who was laid to rest last Wednesday.\nMore to follow…"
  },
  {
    "headline": "BREAKING: Next Cash and Carry supermarket gutted by fire in Abuja",
    "summarized_story": "Next Cash and Carry, a popular supermarket in Abuja, is currently on fire.\nAdvertisementFirefighters from the Federal Fire Service are already making efforts to stop the fire.\nAn official who spoke to journalists said the cause of the fire is yet unknown, and no casualties have been confirmed.\nPolice operatives are also at the scene controlling the situation.\nAdvertisementMore details to follow…"
  },
  {
    "headline": "BREAKING: Next Cash and Carry supermarket gutted by fire in Abuja",
    "summarized_story": "Next Cash and Carry, a popular supermarket in Abuja, is currently on fire.\nAdvertisementFirefighters from the Federal Fire Service are already making efforts to stop the fire.\nAn official who spoke to journalists said the cause of the fire is yet unknown, and no casualties have been confirmed.\nPolice operatives are also at the scene controlling the situation.\nAdvertisementMore details to follow…"
  },
  {
    "headline": "Amaechi: Money left behind by Jonathan couldn’t run Nigeria for three weeks",
    "summarized_story": "Rotimi Amaechi, minister of transportation, says the money left in the country’s coffers by former President Goodluck Jonathan was not sufficient enough to last for three weeks.\nAdvertisementSpeaking during a Channels Television programme, the minister said President Muhammadu Buhari cleared some rots in the system when he came into power in 2015 and also diversified the economy.\nAmaechi, former governor of Rivers state, said Buhari may not be a perfect leader, but the president loves Nigeria.\nWhen this government came into power, oil fell to $28 per barrel and since then it has not gone above $80 per barrel.\n“By the time we came, they didn’t leave money behind that could last us for three weeks."
  },
  {
    "headline": "Ghana’s answer to Silicon Valley is inside refurbished government buildings",
    "summarized_story": "This project in the heart of Ghana’s capital city, the Accra Digital Centre, is a symbol of Ghana’s ambition to be the startup capital of Africa.\nAn aerial view of the Accra Digital Centre“Beyond Ghana’s capital city, the government has identified unused government buildings around the country,” said David Ofori, Head of Operations at the Accra Digital Centre.\nFour years later, the Accra Digital Centre is living up to expectation and looks to be a worthy template for other centres across the country.\nAnother early tenant of the Accra Digital Centre is aYo, an affordable insurance product by MTN.\nThe Accra Digital Centre is looking to partner with local or foreign investors and investment companies to expand its reach and impact."
  },
  {
    "headline": "Flutterwave x Wizkid to drive global payments adoption",
    "summarized_story": "While Paystack was more involved with helping startups collect payments, Flutterwave focused on helping anyone send and receive money via its API.\nSince then, the digital payments service has transformed payments in Africa with a number of solutions.\nIt allows African merchants collect payments from their customers anywhere in the world, on web and mobile.\nFlutterwave SendFlutterwave Send dashboardIts latest product, Flutterwave Send, is taking payments to the global level.\nThe Essence of Flutterwave SendAt the helm of Flutterwave Send is Afrobeats artiste, Ayodeji Ibrahim Balogun—popularly known as Wizkid—who was signed on as Flutterwave’s global brand ambassador."
  },
  {
    "headline": "Inside TeamApt: How an upstart overturned competition to dominate agency banking",
    "summarized_story": "After the $5.5 million raise, TeamApt had cash in the bank to place orders for terminals in China and invaded the Nigerian market.\nTo improve the reliability of its product, TeamApt introduced to the market a 24-hour resolution service for false debit card withdrawals.\nTosin Eniolorunda, founder and CEO of TeamApt, champions the thought process and is instilling it into the company culture.\nWith TeamApt seemingly to be crowned with unicorn status, the company now has its eyes on digital banking but with a slant.\nSo, we will be launching a hybrid credit-led banking solution that also caters to the offline market,” Eniolorunda concludes."
  },
  {
    "headline": "Koniku closes Series A round led by Nigeria-based Platform Capital",
    "summarized_story": "Koniku Inc., a Nigerian-founded biotech company that operates out of California, on Friday said it has closed a Series A financing round led by Nigeria-based private equity firm, Platform Capital Investment Partners.\nIn the wake of the fresh investment, four new members will be joining the company’s board of directors, including Akintoye Akindele, Chairman and CEO of Platform Capital.\nThe company’s technology combines traditional computer cells with living biological neurons to give computers power to detect odours.\nBeyond security and healthcare, Konikore has broad applications in industrial monitoring, energy, food and agriculture sectors, and more.\nThe founder is also African, intelligent, passionate, and committed to the Koniku vision,” Dr. Akintoye told TechCabal in an interview, explaining the rationale behind backing Koniku for a second time."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "Worried about your child’s online safety during holidays? Try these tools",
    "summarized_story": "Nearly all social media platforms have age restrictions of at least 13 years to use their platform.\nWith many divided on the move, China’s regulatory authority has implemented regulations requiring social media and gaming companies to disincentivise youth from spending too much time on social media.\nGiven the several reported cases of online abuse on the platform, online safety precautions need to be taken, especially for young people.\nTikTokPhoto by Solen Feyissa on UnsplashWith over 2.6 billion downloads, TikTok is one of the most used social media platforms globally.\nLike every other social media platform, it has its safety issues."
  },
  {
    "headline": "After 5 reluctant years of bootstrapping, CinetPay is closing in on Francophone Africa dominance",
    "summarized_story": "“We saw that we have a good opportunity with mobile money because many people have mobile money accounts.\nCinetPay has been Flutterwave’s Francophone Africa partner since 2019.\nA little bit more detail about CinetPayCinetPay helps merchants in the Francophone Africa region accept and collect online payments from mobile money wallets in nine countries.\nAccording to the Francophone Africa and the Equality Challenge 2019 Report by the University of Chester Area Studies Research Group, female literacy rates in Francophone Africa have not been growing consistently, with outdated datasets being used for policy making and decision making.\nThe plan for now, though, is to focus on consolidating their hold in Francophone Africa."
  },
  {
    "headline": "Here’s to more stormy years with plenty of wins",
    "summarized_story": "MAX raises $31 million for its electric vehicle subscriptionSource: MAX.ng TwitterNigerian mobility startup, Metro Africa Xpress (MAX) has closed a $31 million Series B funding round.\nThe startup also moved into Nigeria’s capital market after completing the issuance of a ₦400 million ($1 million) bond in September 2020.\nMaxAB’s $55m Series A, MNT-Halan’s $120m, Paymob’s $18m Series A, and Trella’s $42 million Series A made the highlights.\nGenerally, it’s a good year for Africa’s startup funding scene.\nTechpoint Africa Techpoint Africa is a digital media company that amplifies the best innovations out of Africa through its media, data, and events."
  },
  {
    "headline": "Is Flour Mills deal to acquire Honeywell made in heaven?",
    "summarized_story": "The expected combination of Flour Mills Nigeria (FMN) and the flour mills unit of Honeywell Flour Mills plc (HFMP) will form a formidable entity and an unassailable market leader in the agro-allied sector in Nigeria, according to industry players and market analysts.\nLast month, Flour Mills announced it had reached a deal to acquire the flour mills business of Honeywell in an N80 billion deal that will significantly enhance its market leadership.\nIn full year ended March 2021, the turnover for the two was N771.6 billion for Flour Mills and N109.59 billion for Honeywell Flour, and the combination will see FMN emerge as a true continental giant, amassing substantial value for shareholders and huge economic benefit for Nigeria.\nRead Also: Honeywell, Flour Mills N80bn merger to boost Nigeria’s food productionFMN, established in 1960, prides itself of being in the vanguard of feeding the nation for the past 60 years.\nUnder the deal, Honeywell Group will dispose of a 71.69 percent stake in its flour business to FMN based on an enterprise value of N80 billion and subject to approval from the appropriate regulators."
  },
  {
    "headline": "The many legal battles of Ecobank and Honeywell",
    "summarized_story": "On October 16, 2015, Ecobank filed two separate suits before Justice Abang.\nSensing that Ecobank’s lawyers might be attempting to use the administration of justice to blackmail Honeywell into submission, on April 7, 2016, Honeywell petitioned the Legal Practitioners Disciplinary Committee also known as the Body of Benchers.\nHoneywell is also in court pressing damages claim against Ecobank for harm to its interests arising from the ex-parte order granted against it and which has now been made voided by courts including the Supreme Court.\nOn July 13, 2018, justices of the Supreme Court made two rulings, both in favour of Honeywell.\nHoneywell is now asking that the court compel Ecobank to deposit the $28 million proceeds from the share sale into the accounts of the court until the determination of the substantive suit brought by Honeywell."
  },
  {
    "headline": "In Ecobank’s case with Honeywell, bank’s lawyer is biggest victim so far",
    "summarized_story": "On January 11, 2018, the Legal Practitioners Privileges Committee severely sanctioned Ogunba for professional misconduct in relation to his handling of the court cases, withdrawing from him the rank of senior advocate of Nigeria and all other privileges attached to the rank.\nAs set out above, Ogunba on behalf of Ecobank, deliberately instituted a multiplicity of actions on the same dispute, facts, grounds and between the same parties.\nRead Also: Ecobank warns FMN against Honeywell acquisition deal“It is obvious that it is Ecobank’s intention through Ogunba to harass, embarrass and disrupt the business of the Honeywell Group.\nThe damaging effect of Ecobank’s numerous mischievous suits and wrongly obtained orders is enormous and cannot be quantified.\n“Consequently, the legal practitioners’ privileges committee at its 129th plenary meeting have withdrawn the rank of senior advocate of Nigeria from Kunle Ogunba Esq and all other privileges attached to the rank forthwith.”The story has been updated."
  },
  {
    "headline": "Christmas: Edo govt urges love, sacrifice, fetes orphans, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has urged residents in the state to show love to orphans and the less privileged, in the spirit of the Christmas celebration.\nAddressing journalists in Benin City, after presenting gift items to children at the Project Charilove Foundation, in Benin City, the Commissioner for Social Development and Gender Issues, Hon.\nMaria Edekor said the government is committed to the welfare of all citizens, including the less privileged.\nGod gave them to us and we are happy because every gift from God is a good gift.”The commissioner further stated, “His Excellency thought it wise that we bring these gift items to these children.\nThe government is ready to serve the people, irrespective of your status or vulnerability.”The founder and service leader, Project Charilove Foundation, Bro."
  },
  {
    "headline": "CHRISTMAS MESSAGE – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestI wish all Edo people in the state and the Diaspora a merry Christmas.\nKindly adhere to the COVID-19 protocols and be safe as you celebrate with your friends and loved ones.\nFor security and other emergencies, please call the Edo helpline on 08000911911 and 08001235111.\nI wish you all a joyful Christmas celebration.\nSignedHis Excellency, Godwin ObasekiGovernor, Edo State..."
  },
  {
    "headline": "AIG Zone 5 Warns Officers Against Bullying, Extortion, others – Nigerian Observer",
    "summarized_story": "AIG Ahmad Abdurrahman stated this in his maiden chat with our crime reporter at his office, Zone 5 Command headquarters, Adesuwa road, Benin City, yesterday.\n“I have held my maiden address with some senior police officers and some personnel of the zone.\nAIG Ahmad stated.\nRecall that AIG Ahmad Abdurrahman assumed duty in zone 5 on December 16, 2021 after taking over from AIG Isaac O. Akinmoyede who has been redeployed to zone 9, Umuahia.\nZone 5 Command with its headquarters on Adesuwa road in Benin City is in charge of Edo and Delta States police command."
  },
  {
    "headline": "Buhari calls for cooperation among elites in tackling Nigeria’s challenges – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – President Muhammadu Buhari says there is need for more cooperation among the elites in the country in resolving the challenges facing the nation.\nThe president’s spokesman, Mr Femi Adesina, in a statement in Abuja, said Buhari made the call when he visited the palace of the Shehu of Borno.\nHe said the elites owe it to the people to inform, guide and shape opinions since they had more access and knowledge on the economy.\n“What our country needs now is the continued cooperation of the elites.\nThe president assured Nigerians that his administration will use the remaining period to consolidate on efforts in restoring peace and improving the economy."
  },
  {
    "headline": "South Africa anti-apartheid hero, Desmond Tutu, dies aged 90",
    "summarized_story": "Nobel Peace prize laureate and South Africa’s anti apartheid hero, Archbishop Desmond Tutu, has died aged 90.\nTutu’s death comes just weeks after that of South Africa’s last apartheid-era president, FW de Clerk, who died at the age of 85.\nA shepherd.”It is impossible to imagine South Africa’s long and tortuous journey to freedom – and beyond – without Archbishop Desmond Tutu.\nLater he turned that same fierce gaze on the failings, in government, of South Africa’s former liberation movement, the ANC.\nHe became Bishop of Johannesburg in 1985, and was appointed the first black Archbishop of Cape Town the following year."
  },
  {
    "headline": "805 Nigerian doctors secure British licence in six months",
    "summarized_story": "Data from the General Medical Council of Britain has shown that 805 Nigeria-trained doctors were licensed between July and December 25, 2021.\nThis as the number of Nigerian-trained doctors in the United Kingdom increased to 9,189.\nThe figure different from the number of Nigerian doctors trained and practising in the UK.\nIn June, 8,384 Nigerian doctors had been licensed while the number of Nigeria-trained specialists and consultants who migrate have continued to increase over the years, PUNCH reported.\nAccording to the data made available by the council, 233 Nigerian doctors passed the examination to practise in the UK in 2015."
  },
  {
    "headline": "Hon. Okezie Obasi thanks Abians for celebrating with him during his wedding ceremony",
    "summarized_story": "In a release, made available to the press from his Ahiaeke lbeku Residence, Hon Obasi, expressed great delight and joy with the massive turn out of men and women of great repute at the weeding ceremony.\nObasi also appreciated a host of other important dignitaries including, Rep Sam Onuigbo, ODOZI OBODO; Chairman of the occasion, Deacon Okezie Onyemuwa; Speaker of the 7th Abia State House Of Assembly, Rt.\nChief Emmanuel Egwu (Tropicana properties); Chief Eze Ucheya (Skykeens limited); Hon Emeka Longman Nwachuku; Hon Frank Ibeh; Eze Okechukwu Onwuariri; Chief Innocent Onwuariri; Hon Henry Egesi; Mr Austin Poke Onyeweaku (Damara Limited), Hon.\nChidiebere Nwachukwu (Mayor), Chief Sir M.C Egwu (Perm.sec Trade and investment); Prince Ben Okezie (Onowu ), kpakpando Ohuhu; Tony Onyeweaku , P G Azueke Autonomous Community; Hon Okezie Ogbudu Eke- connect and Ossah Patriotic Association.\nHon Obasi thanked all who was in attendance but could not be mentioned here for want of space and prayed God Almighty to send men who will celebrate them all the days of their life."
  },
  {
    "headline": "I have a small share in Titan Trust Bank – Tunde Lemo",
    "summarized_story": "Chairman of Titan Trust Bank Limited, Tunde Lemo, has said his shareholding in the bank, which is acquiring a majority stake in Union Bank of Nigeria Plc, is very small.\nLemo, a former deputy governor of the Central Bank, said this in a statement on Friday, a day after the announcement that the bank had reached an agreement to acquire 89.39 per cent stake in Union Bank.\nAccording to him, it had become necessary to make clarification on the structure of the bank following interest it generated after the announcement of Union Bank acquisition.\nI am only providing leadership.”On Thursday, the board of Union Bank announced that its investors, Union Global Partners Limited, Atlas Mara Limited and other shareholders, had reached an agreement with Titan Trust Bank to divest their shareholding in Union Bank to TTB.\nLemo was quoted in the statement that the transaction marked a key step for Titan Trust in its strategic growth journey and propelled the institution to the next level in the Nigerian banking sector."
  },
  {
    "headline": "Winging 26 Pilots, Boost To War Against Insurgency, Banditry – Air Chief",
    "summarized_story": "The Chief of Air Staff (CAS), Air Marshal Isiaka Alao, has noted that the operational manpower of the Nigerian Air Force recently recieved a boost with the winging of 26 new pilots and 31 unmanned aerial vehicle (UAV) operators since his assumption of office.\nThis is even as the Air Chief noted with joy that the Air Force currently has a total of 195 officers, airmen and airwomen undergoing various trainings abroad cutting across several specialties and trades.\nHe said in addition, 12 student pilots are undergoing Basic Fighter Training at 403 Flying Training School, Kano, while 12 others are undergoing Basic Transport Training at 401 Flying Training School, Kaduna.\nHe said the courses were aimed at maintaining combat readiness by increasing the number of pilots to man NAF’s ever-increasing inventory of aircraft.\n“I am glad to say that the Nigerian Air Force, operating in concert with sister Services and other security agencies, has continued to courageously confront the threats, while recording tangible results in the various Theatres."
  },
  {
    "headline": "COAS Orders Release Of Female Soldier Engaged By Corps Member",
    "summarized_story": "ADVERTISEMENTLt Gen Yahaya said the female soldier should be released to enjoy Christmas with her family and friends.\nA video of a male corps member proposing to a female soldier at the Yikpata Orientation Camp of the NYSC in Kwara State recently surfaced online and went viral.\nADVERTISEMENTThe corps member goes on to insert the ring in the finger of the visibly excited soldier amid cheers from others at the scene.\nThe corps member is seen wearing the lady’s military cap as she stands directly behind him.\nThe COAS however appealed for mercy for the female soldier, which may not be unconnected with the fact that the Christmas season presents an opportunity for persons who erred to be given clemency."
  },
  {
    "headline": "73-yr-old Ex-Miss Nigeria ’63 Honoured At 2021 Idoma Int’l Carnival",
    "summarized_story": "Seventy-three-year-old former Miss Nigeria 1963, Alice Adepe, had theopportunity to walk on the red carpet 58 years after winning the covetedMiss Nigeria Pageant the year Nigeria became a Republic as she washonoured at the ongoing Idoma International Cultural Festival.\nThe annual cultural festival held in Otukpo, headquarters of Otukpolocal government area of Benue State saw the ex-beauty queen receivingthe Life Time Achievement Award.\nAdepe, who hails from Otukpo, won the Miss Nigeria Beauty Pageantcompetition in 1963 and considered a living legend in the city.\nADVERTISEMENTHer citation reads, “Alice Alache is a living monument for Idoma, BenueState and Nigeria.\nBack in 1963, the year Nigeria became a Republic,she was in her 20s when she emerged as the winner of the Miss Nigeriabeauty contest."
  },
  {
    "headline": "73-yr-old Ex-Miss Nigeria ’63 Honoured At 2021 Idoma Int’l Carnival",
    "summarized_story": "Seventy-three-year-old former Miss Nigeria 1963, Alice Adepe, had theopportunity to walk on the red carpet 58 years after winning the covetedMiss Nigeria Pageant the year Nigeria became a Republic as she washonoured at the ongoing Idoma International Cultural Festival.\nThe annual cultural festival held in Otukpo, headquarters of Otukpolocal government area of Benue State saw the ex-beauty queen receivingthe Life Time Achievement Award.\nAdepe, who hails from Otukpo, won the Miss Nigeria Beauty Pageantcompetition in 1963 and considered a living legend in the city.\nADVERTISEMENTHer citation reads, “Alice Alache is a living monument for Idoma, BenueState and Nigeria.\nBack in 1963, the year Nigeria became a Republic,she was in her 20s when she emerged as the winner of the Miss Nigeriabeauty contest."
  },
  {
    "headline": "Nembe Oil Spill: Groups Seek Prosecution Of Culprits",
    "summarized_story": "Concerned groups, including environmental rights groups and ethnic youth leaders, have welcomed the findings of the joint investigation visit which attributed the recent oil spill in Nembe to human sabotage.\nThe groups, which include Friends of the Environment, Nigerian Ethnic Youth Leaders Council (NEYLC), Niger Delta Youth Movement (NDYM), and the African Centre for Justice and Human Rights (ACJHR) made their positions known in their separate reactions to the findings.\nThey described the report that human sabotage caused the spill as truth based on science and facts that must be applauded by all stakeholders.\nThey agreed that the findings should be used to get the culprits and avert future occurrences.\nThe Niger Delta Youth Movement (NDYM) regretted that while experts in the industry, with their science-based evidence, believe the spill was sabotage, the Bayelsa State Government’s agents were using emotion to look for scapegoats."
  },
  {
    "headline": "Minister of Information and Culture Does Not Have Covid-19",
    "summarized_story": "By CHIKA CHIMEZIEThe attention of the office of the Honourable Minister of Informationand Culture, Alhaji Lai Mohammed, has been drawn to a report makingthe rounds that he has contracted the Covid-19 virus and that he isnow in isolation, where he is receiving treatment.\nFor the record, the Minister does not have Covid-19, hence he isneither in isolation nor receiving treatment anywhere.\nThe Minister was at the Federal Executive Council meeting onWednesday, an extraordinary FEC meeting on Thursday and also witnessedthe swearing-in of the Minister of State for Works and Housing onFriday.\nAs a member of the Presidential Steering Committee on Covid-19, theMinister has the added responsibility of leading by example, hencewould not have hesitated to publicly announce his Covid-19 status ifindeed he has contracted the virus.\nThe media does itself a great disservice by making ‘exclusive news’out of beer parlor gist."
  },
  {
    "headline": "Minister of Information and Culture Does Not Have Covid-19",
    "summarized_story": "By CHIKA CHIMEZIEThe attention of the office of the Honourable Minister of Informationand Culture, Alhaji Lai Mohammed, has been drawn to a report makingthe rounds that he has contracted the Covid-19 virus and that he isnow in isolation, where he is receiving treatment.\nFor the record, the Minister does not have Covid-19, hence he isneither in isolation nor receiving treatment anywhere.\nThe Minister was at the Federal Executive Council meeting onWednesday, an extraordinary FEC meeting on Thursday and also witnessedthe swearing-in of the Minister of State for Works and Housing onFriday.\nAs a member of the Presidential Steering Committee on Covid-19, theMinister has the added responsibility of leading by example, hencewould not have hesitated to publicly announce his Covid-19 status ifindeed he has contracted the virus.\nThe media does itself a great disservice by making ‘exclusive news’out of beer parlor gist."
  },
  {
    "headline": "Anti-apartheid icon, Desmond Tutu dies at 90",
    "summarized_story": "South African anti-apartheid icon, Desmond Tutu, died on Sunday aged 90.\nRamaphosa said, “The passing of Archbishop Emeritus Desmond Tutu is another chapter of bereavement in our nation’s farewell to a generation of outstanding South Africans who have bequeathed us a liberated South Africa.\n“Desmond Tutu was a patriot without equal; a leader of principle and pragmatism who gave meaning to the biblical insight that faith without works is dead.\n“In his richly inspiring yet challenging life, Desmond Tutu overcame tuberculosis, the brutality of the apartheid security forces and the intransigence of successive apartheid regimes.\nAfter the fall of apartheid, Tutu headed the Truth and Reconciliation Commission."
  },
  {
    "headline": "Anti-apartheid icon, Desmond Tutu dies at 90",
    "summarized_story": "South African anti-apartheid icon, Desmond Tutu, died on Sunday aged 90.\nRamaphosa said, “The passing of Archbishop Emeritus Desmond Tutu is another chapter of bereavement in our nation’s farewell to a generation of outstanding South Africans who have bequeathed us a liberated South Africa.\n“Desmond Tutu was a patriot without equal; a leader of principle and pragmatism who gave meaning to the biblical insight that faith without works is dead.\n“In his richly inspiring yet challenging life, Desmond Tutu overcame tuberculosis, the brutality of the apartheid security forces and the intransigence of successive apartheid regimes.\nAfter the fall of apartheid, Tutu headed the Truth and Reconciliation Commission."
  },
  {
    "headline": "JUST IN: Fire Guts Peter Obi’s Next Cash and Carry Supermarket In Abuja [VIDEO]",
    "summarized_story": "The popular supermarket in Abuja, Next cash and carry in Kado, is currently on fire, a day after Christmas, and people appear to be questioning why supermarkets are being destroyed.\nSome people, however, believe it is unusual that Ebeano caught fire and that Next Cash and Carry only burned down.\nA Twitter user said, “The fire service truck that used to be stationed at Next Cash and carry went where?\nI have plenty of questions before Shoprite kills us with bills.“Another Twitter user said, “Ebeano supermarket burnt down.\nNext cash and carry Abuja is presently on fire."
  },
  {
    "headline": "Crush Boko Haram, ISWAP Terrorists Before 2023 – Buhari Tells Service Chiefs",
    "summarized_story": "President Muhammadu Buhari gave the service chiefs a new marching order yesterday to smash the Islamic State of West Africa Province (ISWAP), which has surpassed Boko Haram in the North East conflict, before he leaves office in 2023.\nBuhari wondered why ISWAP insurgents kept striking from the same corridor unchecked and told the Service Chiefs to be prepared to win the war against insurgency before he leaves office.\nBuhari said he meant what he told the troops in Maiduguri on the need to rout Boko Haram and ISWAP insurgents.\nHe also sought a more proactive campaign to rout the insurgents, whether Boko Haram or ISWAP.\nNational Chairman of the PDP, Dr. Iyorchia Ayu, charged Nigerians to keep hope alive in spite of daunting circumstances."
  },
  {
    "headline": "I’ll Deal With Bandits, Next President Must Secure Nigeria — Buhari",
    "summarized_story": "President Muhammadu Buhari has stated that his government will consider using military force to fight robbers in the northwest.\nBuhari remarked in Maiduguri, Borno State, that Nigeria is now receiving military weapons that will be utilized to combat bandits.\nIn addition, the President stated that his successor would work to ensure the country’s security.\nOnly a secure country, according to Buhari, can be managed.\n“The problem is in the North West as I said, is same people, same culture, we are going to deal with them."
  },
  {
    "headline": "2023: Primate Ayodele Gives Revelation On Nigeria’s Next President",
    "summarized_story": "Primate Elijah Ayodele, the leader of INRI Evangelical Spiritual Church, has described how Nigeria’s next president will appear.\nThe future president of Nigeria, according to Primate Ayodele, will not be an old man or a child.\nThe cleric said in a statement signed by his Media Aide, Oluwatosin Osho, that Nigeria’s next president will be one who is devoid of scandal, as God has revealed him.\nThere will be a lot that will surround who will become the next president of Nigeria.\nThe spirit of God says Buhari is ready to handover and will not interfere or dabble into the affairs of who becomes the next President."
  },
  {
    "headline": "Breaking: Uche Nwosu, Okorocha’s son-in-law kidnapped",
    "summarized_story": "Former governorship candidate in Imo state Uche Nwosu has been kidnapped.\nNwosu who is son-in-law to former governor Rochas Okorocha was whisked away at St. Peter’s Anglican Church, Eziama-Obaire in Nkwerre Local Government Area of Imo state on Sunday.\nBlueprint gathered that the former Chief of Staff to Senator Okorocha was attending an outing service day after he concluded the burial of his mother at the weekend.\nPolice authorities are yet to confirm the latest development.\nDetails loading…"
  },
  {
    "headline": "Happening now: Popular Abuja shopping mall, Next Cash and Carry, on fire (VIDEO)",
    "summarized_story": "A popular shopping mall, Next Cash and Carry, is currently being engulfed in a raging fire.\nDetails loading…RelatedNo tags for this post."
  },
  {
    "headline": "Breaking: At last, Ooni of Ife speaks days after estranged wife quit marriage",
    "summarized_story": "Three days after his estranged wife, Prophetess Naomi Silekunola, announced that she has quit their marriage, the Ooni of Ife, Oba Adeyeye Ogunwusi, has spoken.\nOba Ogunwusi who had remained calm took to his Facebook Page to to subtly advice Nigerians on what to do as 2021 ends.\nHe wrote, “Reach out to neighbours, especially those who haven’t had it as easy through the year”.\nAs we all know it’s one of joy, celebrations and a deep reflection on what Olódùmarè has done through the year.\n“It is my prayer that you’ll continue to find strength to celebrate in joy, peace, and abounding love which is the bedrock of this special occasion."
  },
  {
    "headline": "Anti-Apartheid Icon Archbishop Desmond Tutu Is Dead",
    "summarized_story": "South African anti-apartheid icon Archbishop Desmond Tutu, described as the country’s moral compass, died on Sunday aged 90, sparking an outpouring of tributes for the outspoken Nobel Peace Prize winner.\nSouth Africa’s President Cyril Ramaphosa honoured this fight in a tribute to Tutu, announcing the archbishop’s death on Sunday.\nThe South African cricket team wore black armbands in his honour of the first day of the first Test against India in South Africa.\nFamously outspoken, even after the fall of the racist apartheid regime, Tutu never shied away from confronting South Africa’s shortcomings or injustices.\nHe retired in 1996 to lead a harrowing journey into South Africa’s brutal past, as head of the Truth and Reconciliation Commission."
  },
  {
    "headline": "Fire Guts Next Cash And Carry Supermarket In Abuja",
    "summarized_story": "﻿Next Cash and Carry, one of Abuja’s biggest shopping malls has been gutted by fire.\nThe Head of Search and Rescue National Emergency Management Agency (NEMA) Abuja, Labuan Ahman who spoke with Channels Television called on mutual aid fire services for support.\n“The whole of Next Cash and Carry is on fire.\nWe are calling on all mutual aid fire services to deploy to Next Cash and Carry.\nThe mutual aid fire services are Julius Berger, CBN, and then the Armed Forces."
  },
  {
    "headline": "Christmas: Osinbajo Urges Nigerians To Embrace Gift Of Righteousness",
    "summarized_story": "Vice President Yemi Osinbajo has called on Nigerians to embrace the gift of righteousness and look forward to a season of happiness.\nHe made the call on Saturday in a chat with journalists shortly after the Christmas Service at the Aso Villa Chapel, Abuja as he reminded Nigerians that “God is with us” regardless of their backgrounds.\nThe Bible says that He causes the rain to fall and the sun to shine on the good and the evil alike.\nAnd on this special occasion, I believe that every Nigerian should receive this great blessing that God has for us.\nThe VP, who referenced the scriptures, said the birth of Jesus Christ reignites the hopes of man for salvation especially with the knowledge that “God is with us”."
  },
  {
    "headline": "PHOTOS: Osinbajo, Family Visit Buhari On Christmas Day",
    "summarized_story": "Vice President Yemi Osinbajo on Saturday paid a Christmas homage to President Muhammadu Buhari at the State House in Abuja.\nThe Vice President was accompanied by his nuclear family.\nBelow are photos from the event:"
  },
  {
    "headline": "Gunmen Abduct Okorocha’s Son-In-Law Uche Nwosu",
    "summarized_story": "Gunmen have kidnapped a former gubernatorial aspirant of the All Progressives Congress (APC), Uche Nwosu.\nNwosu, a son-in-law to former Governor Rochas Okorocha, was whisked away by the abductors who dressed in security uniform at St. Peter’s Anglican Church, Eziama in Obaire Nkwerre Local Government Area of Imo State.\nDetails later…"
  },
  {
    "headline": "Christmas: Senator Remi Tinubu felicitates with Constituents, Nigerians -",
    "summarized_story": "The Senator representing Lagos Central Senatorial District, Oluremi Tinubu is felicitating with Christians in her Constituent and all Nigerians at home and in Diaspora on this joyous celebration of Christmas.\nShe said, looking back at the year 2020 and the challenges that 2021 brought, to witness another Christmas celebration is a privilege that one cannot take for granted.\nSenator Tinubu urged that the birth of Jesus be a reminder that what was foretold will definitely come to pass, praying that the commemoration of Christmas cause hope to well-up within each and every Nigerian.\nShe also urged citizens to reflect on the love, kindness and virtues of peace which the birth and life of Jesus teaches.\nThe lawmaker reiterated her call for citizens to be vaccinated, adhere strictly to the COVID-19 guidelines, ensure social and physical distance at all times."
  },
  {
    "headline": "President Buhari greets Gov Ganduje at 72, describes him as effective administrator -",
    "summarized_story": "President Muhammadu Buhari has congratulated the Governor of Kano State, Abdullahi Umar Ganduje as he marked his 72 birthday, describing him as an effective administrator who has written new chapters in development, peace and security in Kano State.\n“Happy birthday and best wishes to Governor Ganduje.\nI wish you good health and long life as you continue to serve the State and the nation with your well-known commitment to peace, security and development.\n“Kano State is making steady progress under the APC administration.\nI pray for your long life and good health,” said the President."
  },
  {
    "headline": "APC Governors celebrate Ganduje at 72, describe him as shining light -",
    "summarized_story": "The Progressives Governors Forum has described Kano state governor, Abdullahi Umar Ganduje as a strong pillar whose leadership, vision and commitment to a united prosperous Nigeria cannot be overemphasized.\nThe Progressive Governors Forum (PGF) says it joins the Kano state governor to celebrate his 72nd birthday.\nalong with the people of Kano State, and other well-meaning Nigerians.\nAs Governor of Kano State, through all the development initiatives being implemented by your APC-led government, you represent the shining light of our politics.\n“Once again, congratulations and Happy Birthday to HE Abdullahi Umar Ganduje!,” the statement said."
  },
  {
    "headline": "Override the President, pass Electoral Act amended bill into law; Anglican Bishop tells lawmakers -",
    "summarized_story": "Bishop of the Anglican Communion, Kaduna Diocese, Timothy Yahaya wants the National Assembly to override the President and pass the electoral amendment bill into Law.\nHe has also asked them to always remember that they owe Nigerians a legacy of a free, fair and credible elections.\nBishop Timothy Yahaya made this known after the Christmas service at the Cathedral of St. Micheal in Kaduna.\nHe said the body language of the President has shown his unwillingness to assent to the bill.\nPassing the bill into law according to him will correct the wrong impression Nigerians have about the National Assembly been a ‘rubber stamp’ parliament."
  },
  {
    "headline": "Sudan Forces Fire Tear Gas as Protesters Head to Presidential Palace",
    "summarized_story": "A Reuters witness said security forces fired tear gas to disperse the crowds on a tenth day of major demonstrations since an Oct. 25 coup.\nIn separate statements, the committee said security forces entered Khartoum Hospital and Port Sudan Hospital.\nBut on Saturday they were met with by security forces and turned back.\nIn Omdurman, security forces fired tear gas at protesters near a bridge connecting the city to central Khartoum, another Reuters witness said.\nLast Sunday, hundreds of thousands of people marched to the presidential palace and security forces fired tear gas and stun grenades to disperse protesters."
  },
  {
    "headline": "Musa, Ighalo, Osimhen, 25 Others in Nigeria’s 28-Man Nations Cup List",
    "summarized_story": "Head Coach Augustine Eguavoen has named his 28-man final list of the Super Eagles of Nigeria for the 33rd Africa Cup of Nations taking place in Cameroon fron January 9 to February 6, 2022, with Captain Ahmed Musa, midfield enforcer Wilfred Ndidi, returnee Odion Ighalo and effervescent forward Victor Osimhen all making the cut for the big houseparty.\nFormer Nigeria captain Eguavoen, who coached the Super Eagles to third-place finish at the finals in Egypt 15 years ago, has selected four goalkeepers, nine defenders, five midfielders and 10 forwards to aim for Nigeria’s fourth diadem in Cameroon.\nGoalkeepers Maduka Okoye and Francis Uzoho, defenders Kenneth Omeruo, Olaoluwa Aina and Abdullahi Shehu, midfielders Joseph Ayodele-Aribo and Chidera Ejuke and forwards Moses Simon, Odion Ighalo and Samuel Chukwueze are also on the roster.\nThere is a return to the group for former U17 World Cup –winning captain Kelechi Nwakali, forward Emmanuel Dennis and 2016 Olympics star Sadiq Umar.\nAll invited players, bar the UK-based crew, are expected to arrive in camp in the Nigeria’s federal capital, Abuja on 29th December, with the UK-based players expected to start arriving on Monday, 3rd January."
  },
  {
    "headline": "Omicron: More Travel Misery as Nearly 6,000 Flights Cancelled on Christmas Eve, Christmas Day, Boxing Day",
    "summarized_story": "Commercial airlines around the world canceled more than 5,900 flights over the Christmas weekend, as a mounting wave of COVID-19 infections driven by the Omicron variant created greater uncertainty and misery for holiday travelers.\nThe website showed that 1,779 Christmas Day flights were called off worldwide, along with 402 more that had been scheduled for Sunday.\nAirline carriers globally scrapped at least 2,401 flights on Friday, which fell on Christmas Eve and is typically a heavy day for air travel, according to a running tally on the flight-tracking website FlightAware.com.\nThe average number of new U.S. coronavirus cases has risen 45% to 179,000 per day over the past week, according to a Reuters tally.\nNew York reported more than 44,000 newly confirmed infections on Friday alone, shattering that state’s daily record."
  },
  {
    "headline": "South African Anti-Apartheid Campaigner, Archbishop Desmond Tutu, Dies Aged 90",
    "summarized_story": "Archbishop Desmond Tutu, Nobel Peace Prize laureate and veteran of South Africa’s struggle against white minority rule, has died aged 90, the presidency said on Sunday.\n“The passing of Archbishop Emeritus Desmond Tutu is another chapter of bereavement in our nation’s farewell to a generation of outstanding South Africans who have bequeathed us a liberated South Africa,” President Cyril Ramaphosa said.\nHe was an outspoken critic of the country’s previous brutal system of oppression against the country’s Black majority.\nHe was awarded the Nobel Peace Prize in 1984 for his campaign of non-violent opposition to South Africa’s white minority rule.\nA statement on behalf of the Tutu family described him as a man who “turned his own misfortune into a teaching opportunity to raise awareness and reduce the suffering of others.”"
  },
  {
    "headline": "Egypt’s Petroleum Corporation Signs $1bn Oil-Exploration Agreement with Eni",
    "summarized_story": "Egyptian General Petroleum Corporation (EGPC) has signed an agreement with Italian energy group Eni (ENI.MI) for oil exploration in the Gulf of Suez and Nile Delta regions worth “not less than $1 billion” of investments, the petroleum ministry said on Friday.\nThe agreement also included a commitment from Eni to additionally spend “not less than $20 million” to drill 4 wells, the ministry added in a statement."
  }
]