[
  {
    "headline": "Diabetologist warns Nigerians against using bleaching creams containing steroids",
    "summarized_story": "Oluwatobiloba JaiyeolaA Diabetologist at the AB Specialist Hospital, Surulere, Lagos, Dr. Akinniyi Akinmokun, has cautioned Nigerians against using bleaching creams containing steroids, noting that are dangerous.\nAkinmokun warned that those using bleaching creams containing steroids are at risk of suffering harmful side effects in the long term.\nAccording to him, steroids in bleaching creams are referred to as topical steroids, adding that using them often leads to the suppression of the internal production of steroids.\nIt is the steroids that maintain blood pressure and also maintain the integrity of cells.\nThe diabetologist implored Nigerians to carefully check the leaflets of their lotion and steer clear of creams containing steroids."
  },
  {
    "headline": "Diabetologist warns Nigerians against using bleaching creams containing steroids",
    "summarized_story": "Oluwatobiloba JaiyeolaA Diabetologist at the AB Specialist Hospital, Surulere, Lagos, Dr. Akinniyi Akinmokun, has cautioned Nigerians against using bleaching creams containing steroids, noting that are dangerous.\nAkinmokun warned that those using bleaching creams containing steroids are at risk of suffering harmful side effects in the long term.\nAccording to him, steroids in bleaching creams are referred to as topical steroids, adding that using them often leads to the suppression of the internal production of steroids.\nIt is the steroids that maintain blood pressure and also maintain the integrity of cells.\nThe diabetologist implored Nigerians to carefully check the leaflets of their lotion and steer clear of creams containing steroids."
  },
  {
    "headline": "Enforce ban on tobacco advertisement, group tells FG, stakeholders",
    "summarized_story": "Lara AdejoroThe Nigeria Tobacco Control Alliance has urged the Federal Government, and all stakeholders to intensify enforcement of the ban on tobacco advertising, promotion, and sponsorship in the country.\nThe group said tobacco advertisement persists in Nigerian movies and digital spaces, despite the ban placed by the National Tobacco Control Act, 2015.\n“One of the most notorious violators of the TAPS ban is Smoke Box NG, a tobacco vendor that advertises tobacco products on social media with impunity.\nThis depiction of smoking as glamorous challenged the provisions of the NTC Act, 2015 on on-screen smoking, it also threatened the gains made on the ban on TAPS in Nigeria.\nWhen it happened, the tobacco control community called on the National Broadcasting Commission to act immediately."
  },
  {
    "headline": "Enforce ban on tobacco advertisement, group tells FG, stakeholders",
    "summarized_story": "Lara AdejoroThe Nigeria Tobacco Control Alliance has urged the Federal Government, and all stakeholders to intensify enforcement of the ban on tobacco advertising, promotion, and sponsorship in the country.\nThe group said tobacco advertisement persists in Nigerian movies and digital spaces, despite the ban placed by the National Tobacco Control Act, 2015.\n“One of the most notorious violators of the TAPS ban is Smoke Box NG, a tobacco vendor that advertises tobacco products on social media with impunity.\nThis depiction of smoking as glamorous challenged the provisions of the NTC Act, 2015 on on-screen smoking, it also threatened the gains made on the ban on TAPS in Nigeria.\nWhen it happened, the tobacco control community called on the National Broadcasting Commission to act immediately."
  },
  {
    "headline": "We’ll replicate my Anambra achievements on a larger scale — Peter Obi",
    "summarized_story": "Asked when his manifesto would be released, Mr Obi said what he planned to do as president had been practiced during his time as governor of Anambra State, adding that he intends to replicate his achievements in Anambra on a large scale in Nigeria, if elected president.\n“How can I hire professors to write or draft policy documents for me that I don’t even believe in?\nWhat I did in Anambra and what I achieved are what we will replicate on a larger scale.\n“I will assemble the type of people I had in Anambra State.\nI want those who can look into my face and say, Mr President, you are wrong,” the former governor added."
  },
  {
    "headline": "Cuban firm to establish vaccines manufacturing plant in Bayelsa",
    "summarized_story": "By Samuel Oyadongha, YENAGOABAYELSA State government has signed a Memorandum of Understanding with BioCubaFarma Consortium of the Republic of Cuba for the establishment of vaccines and pharmaceuticals production plant in the state.\nHis words: “This is a good development for us in Bayelsa State.\nThe vaccines and other pharmaceutical products are in high demand in Nigeria and beyond.\nWith the centre here, Bayelsa can serve other states and nations in the West African sub-region.\n“In the next few months, the technical teams from both sides will work out further details of the agreement with the technical teams from both end."
  },
  {
    "headline": "No basis for take-over of BEDC, says mgt",
    "summarized_story": "The management of Benin Electricity Distribution Company, BEDC Plc, has said there was no legal basis for the takeover of the company, following the purported activation of the call on its collateralised shares by Fidelity Bank.\nThe purported activation seeks to take over the respective boards of Kano Electricity Distribution Company, Kaduna Electricity Distribution Company and BEDC Electricity Plc (the DisCos) over the inability to repay the loans obtained to acquire majority stakes in the DisCos in furtherance of the 2013 privatisation exercise.\nBEDC Plc in statement, in Benin City, Edo State, yesterday, said: “The referenced report also alleges that certain parties have been appointed as board members, Independent Directors and Managing Directorof BEDC Electricity Plc.\nFor the avoidance of doubt, the shares of BEDC have not been given as security to Fidelity Bank or to any other party.\n“As we understand it, Vigeo Holdings Limited, VHL, a non-shareholder of BEDC, obtained credit facilities from Stanbic IBTC Bank Limited, Fidelity Bank Plc and Keystone Bank Plc, the VHL Lenders."
  },
  {
    "headline": "Umana, N-Delta minister, vows to make a difference",
    "summarized_story": "New Minister of Niger Delta Affairs, Mr. Umana Umana, has promised to deliver on the mandate of his new office to justify the trust President Muhammadu Buhari has placed in him and to meet the yearnings of the people of the Niger Delta for development.\nUmana, yesterday, spoke during a brief meeting with staff of the ministry, after his inauguration earlier in the day by President Buhari.\nAddressing workers in the ministry, who had assembled to receive him, Umana said: “We can make a difference, though time is short.\nTogether we can create the necessary impact and make the difference for the people of Nigeria and the Niger Delta.\nJoin me in making that difference.”He told the ministry workers that what counts for him in the workplace was outcome."
  },
  {
    "headline": "White paper on Ozoro-Oleh crisis out — Okowa",
    "summarized_story": "Fielding questions from newsmen shortly after inspecting ongoing projects at the Delta State University of Science and Technology, Ozoro, Okowa said the state government had also given approval for compensation to families of affected victims.\nSaying that the approval of the white paper by the State Executive Council on the crisis was sequel to the recommendations of the judicial panel of enquiry on the crisis, he noted that state government was already implementing the decisions of the panel.\nOkowa said: “The judicial panel of enquiry has finished its work and submitted its report.\nThe white paper has also been released by the state’s executive council and the whole process to ensure peace is being implemented by the office of the Secretary to the State Government.\n“The cheques will be released on Thursday this week (today), I just hope and pray that we do not go into that level of communal crisis anymore.”"
  },
  {
    "headline": "BREAKING: Terrorists celebrate during ISWAP attack on Kuje prison in Abuja [Video]",
    "summarized_story": "Islamic State’s West Africa Province (ISWAP) has released footage of the hit on the Medium Security Custodial Centre, Kuje, Abuja.\nScores of terrorists invaded the prison at about 10 p.m. Tuesday night, operating for more than two hours.\nIn the footage, the insurgents could be heard rejoicing after breaching the facility; some vehicles are seen on fire.\nThe Nigerian Correctional Service (NCoS) confirmed that said out of 879 inmates escaped from the facility, 443 have been recaptured.\nVideo of the Kuje prison attack below:"
  },
  {
    "headline": "It’s signal from enemies – Afenifere reacts to attacks on Buhari’s convoy, Kuje prison",
    "summarized_story": "The Yoruba socio-political organization, Afenifere has reacted to the attack on President Muhammadu Buhari’s presidential advance team to Daura, Katsina State and the explosive attack on Kuje Prison by gunmen.\nAfenifere said the attack on Buhari’s advance team was a signal to the government and security agencies.\nJare Ajayi, the spokesman of Afenifere, said the enemies are informing Nigerians and security agencies that they are not afraid of anyone with the attack on Buhari’s convoy.\nThe one on the Presidential Team seems to be a coded language by enemies of the nation that they are not afraid of anyone notwithstanding the status of such a person.\nFor, it goes without saying that a Presidential Team would normally be fortified."
  },
  {
    "headline": "Gas explosion destroys goods worth millions of naira in Ilorin",
    "summarized_story": "Goods worth millions of naira were destroyed in a fire disaster triggered by a gas explosion on Tuesday in Ilorin, the Kwara State capital.\nAccording to the spokesman of the state fire service, Hassan Hakeem Adekunle, in Ilorin on Wednesday, the fire disaster was caused by an accidental discharge from a damaged hose which suddenly burst during the gas delivery process at a gas retail shop.\nThe incident occurred at about 16.38hours at Mayegun Junction, Alagbado Specialist Hospital area of Ilorin metropolis.\nThe injured person, said to be the wife of the owner of the gas retail shop, reportedly lost N2m cash kept in the shop to the fire incident.\nAnother victim of the fire incident, Mrs Bashirat Bashir, lamented that she lost goods worth N2m to the inferno as she had just stocked her shop with goods for Sallah sales."
  },
  {
    "headline": "Kuje Prison attack: Increased crime expected in Abuja – US alerts citizens",
    "summarized_story": "The United States Embassy has warned its citizens in Nigeria against travelling on the airport road in Abuja and some states in Nigeria.\nThe warning came after suspected Boko Haram terrorists attacked Kuje Prison and freed some inmates on Tuesday night.\nThe US embassy in a statement on Wednesday, titled, ‘Abuja FCT prison break near the airport on July 5, 2022’, stated that crime has become endemic throughout Nigeria.\nThe statement read, “On the night of July 5, 2022, an attack on Kuje Prison freed a large portion of the estimated 1,000 prisoners.\n“Terrorists are increasingly using less sophisticated methods of attack including knives, firearms, and vehicles to target crowds more effectively."
  },
  {
    "headline": "Muhammad Sanusi Barkindo’s death shocking, unfortunate – Gov Uzodinma",
    "summarized_story": "Governor Hope Uzodinma of Imo State has expressed sadness over the death of the Secretary-General of the Organisation of Petroleum Exporting Countries (OPEC), Muhammad Sanusi Barkindo.\nBarkindo died at the age of 63 on Tuesday night in Abuja, the same day he paid a courtesy call on President Muhammadu Buhari to brief him on his tenure that was about to end at OPEC.\nIn a statement by Oguwike Nwachuku, the Chief Press Secretary and Media Adviser to the governor, on Wednesday, Uzodinma described the death as “shocking, unbelievable and unfortunate.”Uzodinma said, “Barkindo was a prominent Nigerian professional, who devoted his time and energy in the service of the country both nationally and internationally.\n“Barkindo died when his services were still required in the country because of his vast knowledge in private and public administration as well as in the oil and gas industry.”Uzodinma commiserated with the immediate and extended family, friends and associates of the deceased and prayed to God to grant them the grace and fortitude to bear the unexpected loss."
  },
  {
    "headline": "Kwankwaso’s comment is reason 100m Nigerians live in poverty, says Obi The Nation Newspaper",
    "summarized_story": "Labour Party (LP) presidential candidate, Mr. Peter Obi, has said the comment by former Kano State Governor Rabiu Musa Kwankwaso is the reason about 100 million Nigerians are living in poverty.\nKwankwaso, the presidential candidate of the New Nigeria Peoples Party (NNPP), at the weekend said he cannot be a running mate to Obi.\nHe also said the Southeast will miss a golden opportunity if Obi refuses to be his running mate.\nReacting in an interview on Arise TV, Obi said: “The comment by the elder brother Kwankwaso is the reason why we have 100 million Nigerians living in poverty, 18 million Nigerian children out of school and about 52 per cent of Nigerians either unemployed or underemployed.\nThis is because rather than vote for competent leaders, we vote for incompetence due to a primitive consideration of religion and ethnicity."
  },
  {
    "headline": "Okorocha gets court’s nod to seek medical attention abroad The Nation Newspaper",
    "summarized_story": "A Federal High Court in Abuja has approved the request of former Imo State Governor Rochas Okorocha to travel to the United States (U.S.A) for medical attention.\nJustice Ekwo ordered Okorocha to return the passport to the Registrar not later than three days after his return to the country.\nThe judge threatened to declare Okorocha, who currently represents Imo West at the Senate, wanted, should he attempts to abuse the opportunity granted him.\nOther defendants in the suit are: Anyim Nyerere Chinenye, Naphtali International Limited, Perfect Finish Multi Projects Limited, Consolid Projects Consulting Limited, Pramif International Limited, and Legend World Concepts Limited.\nIn the motion he filed for leave to travel, Okorocha said before his arraignment on May 31, he had undergone medical surgery at the Ambulatory Surgery Center in Texas, U.S.A, for “distal femur fracture” he sustained in an accident."
  },
  {
    "headline": "Late OPEC chief Barkindo buried in Yola The Nation Newspaper",
    "summarized_story": "The late Secretary General of the Organisation of Petroleum Exporting Countries (OPEC), Muhammad Barkindo, has been laid to rest in Yola, the Adamawa State capital.\nBarkindo was buried in Yola Town, Yola South Local Government Area on Wednesday evening after he was flown in the afternoon.\nAdamawa Emirate paramount ruler, the Lamido Adamawa, Dr Muhammadu Barkindo Mustafa; FCT Minister Muhammad Musa Bello; Secretary to the Adamawa State Government (SSG), Malam Bashiru Ahmad, among other dignitaries, attended Barkindo’s funeral prayers.\nGovernor Ahmadu Fintiri who is outside the country, sent his condolences via his Press Secretary, Humwashi Wonosikou.\nIn the message by Wonosikou, Fintiri said: “I received news of the passing of Muhammad Sanusi Barkindo with sadness; the late Barkindo will be remembered as a respected son of Adamawa and OPEC family."
  },
  {
    "headline": "Two killed, 15 rescued in Lagos boat accident The Nation Newspaper",
    "summarized_story": "Two persons were on Wednesday confirmed dead and 15 others rescued after a passenger boat capsized at Ikorodu.\nThe boat inscribed R&N 2 was said to have submerged in the water around 7:45am, just 200 metres from Ipakodo terminal.\nThough a 20-passrnger boat, it was said to have had 17 persons onboard at the time of the accident, thus ruling out overloading as cause of the capsize.\nThe Lagos State Waterways Authority (LASWA) and the Lagos State Emergency Management Agency (LASEMA) confirmed the incident in statements made available to reporters.\nHe said the boat went under shortly after departing from the jetty, adding that the boat captain was being investigated by relevant agencies."
  },
  {
    "headline": "Orderly dies as Rivers APC deputy gov candidate escapes assassination The Nation Newspaper",
    "summarized_story": "The deputy governorship candidate of the All Progressives Congress (APC) in Rivers State, Dr. Innocent Barikor, has escaped assassination in Port Harcourt, the state capital.\nIt was however gathered gunmen killed his police orderly on the spot.\nA source, who spoke in confidence, said on sighting Barikor, the gunmen opened fire.\n“Barikor escaped by the whiskers but his police orderly was not fortunate because the bullets hit and killed him on the spot,” he said.\nWhen contacted, the Police Public Relations Officer (PPRO), DSCP Grace Iringe-Koko, said it was not a case of assassination."
  },
  {
    "headline": "Fears in Abuja over Boko Haram inmates’ escape",
    "summarized_story": "Though the minister said only one Civil Defence personnel lost his life during the attack, prison officers displayed three corpses as additional casualties.\nArmoured tanks have been positioned around Kuje Prison junction, while various teams of security personnel in siren-blaring vehicles patrol the area.\n•US issues security alert to nationalsRegardless, the United States Government has alerted its nationals has issued security advisory to its citizens.\nAvoid displays of valuables and limit nighttime activity.”The United States added that terrorist groups and those inspired by such organisations are intent on attacking U.S. citizens abroad.\n); hotels, clubs, and restaurants frequented by tourists; places of worship, schools, parks, shopping malls and markets, public transportation systems (including subways, buses, trains, and scheduled commercial flights),” the United States said."
  },
  {
    "headline": "US issues security alert to nationals",
    "summarized_story": "Regardless, the United States Government has alerted its nationals has issued security advisory to its citizens.\nAvoid displays of valuables and limit nighttime activity.”The United States added that terrorist groups and those inspired by such organisations are intent on attacking U.S. citizens abroad.\n“Terrorists are increasingly using less sophisticated methods of attack –including knives, firearms, and vehicles – to target crowds more effectively.\nAmongst other precautions, the United States cautioned its nationals to be aware of their surroundings, keep a low profile, carry proper identification, monitor local media for updates and review personal security plans.\nKuje: UK warns nationals on safety, security in NigeriaFrom Aidoghie Paulinus, AbujaThe United Kingdom (UK), has warned British citizens in Nigeria about their safety and security in the country."
  },
  {
    "headline": "I’m disappointed at our intelligence system, angry Buhari declares",
    "summarized_story": "President Muhammadu Buhari, yesterday, expressed disappointment over the country’s intelligence system.\n“How can terrorists organise, have weapons, attack a security installation and get away with it?” he fumed after visiting the Medium Security Custodial Centre, Kuje attacked by terrorists.\nAccording to a statement by Senior Assistant to the President on Media and Publicity, Garba Shehu, Buhari, who spent about 30 minutes expressed disappointment with the intelligence system and utilisation.\nHe was briefed about the attack by the Permanent Secretary, Ministry of Interior, Dr. Shuaib Belgore and the Controller General of Nigerian Correctional Service, Haliru Nababa.\nPresident Buhari, who, was shocked by both the scale and audacity of the attack queried: “How did the defences at the prison fail to prevent the attack?"
  },
  {
    "headline": "Impeachment: Court fixes July 26 for judgment on deputy gov’s suit",
    "summarized_story": "The counsel are Chief Afolabi Fashanu (SAN) for the deputy governor, who is the claimant in the litigation, and Otunba Kunle Kalejaiye (SAN), for the defendants.\nThe defendants in the matter are the Speaker, Oyo State House of Assembly (first defendant), Oyo State House of Assembly (second defendant), and the Clerk of the House of Assembly (third defendant).\nBut Fashanu also told the court that the Oyo State House of Assembly held a plenary yesterday, and a motion was raised, which was duly supported.\nSpeaking with journalists after the proceedings, Kalejaiye said the status quo that the court ordered was still intact as Olaniyan remains the deputy governor.\nHe stated that Section 188 of the 1999 Constitution empowers the lawmakers to remove governor or deputy governor by following eight steps."
  },
  {
    "headline": "Buhari directs new ministers to conduct sector research, consult with experts, seek wise advice",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari, yesterday, reshuffled four ministers and assigned portfolios to the seven ne appointees, charging them to serve the nation diligently, maintain unalloyed loyalty to the country and office of the president.\nPresident Buhari said as his administration is on the home-stretch of its second term, more work still needed to be done in diverse areas of the economy and national life.\nThe president also re-assigned four ministers to new ministries.\nThe president said the new redeployment is aimed at reinvigorating certain sectors where the government desires to accomplish improved results.\nBuhari urged the newest members of his cabinet to consult and collaborate with older cabinet colleagues and focus on driving key programmes already initiated by this administration."
  },
  {
    "headline": "Sterling’s City Exit Imminent, Agrees Personal Terms with Chelsea – THISDAYLIVE",
    "summarized_story": "Manchester City forward Raheem Sterling has agreed personal terms with Chelsea.\nThe 27-year-old has one year left on his contract at City and had attracted interest from major clubs overseas.\nCity signed Sterling from Liverpoolin a £49m deal in 2015 and he went on to score 131 goals in 339 games.\nOther major clubs, including Barcelona, Real Madrid and Bayern Munich were also interested in Sterling but the player was swayed by Chelsea’s public and privately stated desire to sign him.\nCity wanted Sterling to stay and he has no ill feeling towards the club or manager Pep Guardiola."
  },
  {
    "headline": "Super Falcons in Make or Mar Clash with Botswana as Injured Oshoala Leaves Camp – THISDAYLIVE",
    "summarized_story": "Falcons were beaten 2-1 by Banyana Banyana while the Botswana ladies picked a massive 4-2 victory against Burundi to lead Group C on better goals difference on same three points as the South Africans.\nCaptain of the Super Falcons, 39-year-old Onome Ebi didn’t mince words in admitting that initial loss was painful.\n“We feel bad to have lost the opening match, and against South Africa for that matter, but we have been able to put that behind us now.\nAll we want to do is get the win against Botswana to restore our confidence, and then we can take things from there,” she noted after Wednesday’s training.\nVictory on Thursday will calm Nigerian nerves and allow the Falcons to look forward to Sunday’s encounter against Burundi with much confidence."
  },
  {
    "headline": "Tinubu’s School Record and Matters Arising – THISDAYLIVE",
    "summarized_story": "On 23rd July 1999, following pressure from the House that had set up a committee to investigate the allegations, Buhari resigned.\nDid he attend Chicago State University?\nWe met him at a Lagos State government guest house in GRA, Ikeja.\nOn the political front, the Omoworare panel was established by the Lagos State House of Assembly as part of possible impeachment proceedings.\nTinubu’s record at Chicago State University is indeed impeccable."
  },
  {
    "headline": "ISWAP Claims Responsibility for Attack on Kuje Prison, Releases Video – THISDAYLIVE",
    "summarized_story": "Terrorist group, Islamic State in West Africa Province (ISWAP) has claimed responsibility for the Tuesday night’s attack on Kuje Medium Security Custodial Centre, Abuja, where inmates, including Boko Haram terrorists, were freed.\nThe terrorist group, in a short video released Wednesday, said it succeeded in freeing dozens of prisoners.\nThe 38 seconds video released by the Islamic State’s A’maq Agency had a caption in Arabic, translated as “Fighters of Islamic State attacked Kuje prison in Abuja yesterday and succeeded in freeing dozens of prisoners.”In the footage, sporadic gunshots were heard and vehicles in the custodial centre were set ablaze by attackers.\nIn a statement Wednesday, the Nigerian Correctional Service said: “A total of 879 inmates escaped from the facility during the unfortunate attack.\nHowever, efforts are ongoing to recapture all fleeing inmates.”"
  },
  {
    "headline": "NASME Set to Host Youth Empowerment Conference – THISDAYLIVE",
    "summarized_story": "Esther OlukuThe President, Nigerian Association of Small and Medium Enterprises (NASME), Mr. Abdulrashid Yerima has said that the organisation in collaboration with it’s stakeholders is set to host its first ever Youth Empowerment Conference in Abuja on July 21st 2022.\n“The Youth Empowerment Conference is aimed at providing an interactive forum for dialogue between young entreprenuers representing the youth business community and policy makers as well as development organisations to discuss the need to invest in access to finance and technical assistance for young people.\n“This event would serve as a platform for database collection to get a view of all youth entreprenuers in the country, refer them to their state chapters who would start mentoring them.\nThe business pitch competition would happen during the conference on July 21st.\nDivisional Head, SME- South, Bank of Industry (BOI), Mr. Obaro Osah noted that working with NASME is part of BOI’s activities to support and deepen it’s commitment to youth empowerment programmes."
  },
  {
    "headline": "BREAKING: ISWAP Claims Responsibility For Kuje Prison Attack, Releases Video Of ‘Soldiers Of Caliphate’ In Action",
    "summarized_story": "The Islamic State-backed faction of Boko Haram, known as the Islamic State West Africa Province (ISWAP) has claimed responsibility for Tuesday's attack on Kuje Correctional Centre in Abuja, the nation’s capital.\nAccording to one of the sources, the terrorists invaded the facility around 9:05 pm and operated till 1:30 am on Wednesday morning.\nISWAP in a video released on Wednesday claimed responsibility for the attack.\nIn the video, the terrorist sect showed some of its men shooting their way into the facility.\nVIDEO: ISWAP Claims Responsibility For Kuje Prison Attack, Releases Video pic.twitter.com/99i8KPFtdr — Sahara Reporters (@SaharaReporters) July 6, 2022The claim comes a few days after ISWAP said its fighters killed a policeman in Suleja, Niger State.Suleja is less than 20 kilometres away from the Federal Capital Territory, Abuja.According to the group, the attack was carried out by “soldiers of the caliphate” with automatic weapons."
  },
  {
    "headline": "BREAKING: ISWAP Claims Responsibility For Kuje Prison Attack, Releases Video Of ‘Soldiers Of Caliphate’ In Action",
    "summarized_story": "The Islamic State-backed faction of Boko Haram, known as the Islamic State West Africa Province (ISWAP) has claimed responsibility for Tuesday's attack on Kuje Correctional Centre in Abuja, the nation’s capital.\nAccording to one of the sources, the terrorists invaded the facility around 9:05 pm and operated till 1:30 am on Wednesday morning.\nISWAP in a video released on Wednesday claimed responsibility for the attack.\nIn the video, the terrorist sect showed some of its men shooting their way into the facility.\nVIDEO: ISWAP Claims Responsibility For Kuje Prison Attack, Releases Video pic.twitter.com/99i8KPFtdr — Sahara Reporters (@SaharaReporters) July 6, 2022The claim comes a few days after ISWAP said its fighters killed a policeman in Suleja, Niger State.Suleja is less than 20 kilometres away from the Federal Capital Territory, Abuja.According to the group, the attack was carried out by “soldiers of the caliphate” with automatic weapons."
  },
  {
    "headline": "BREAKING: ISWAP Claims Responsibility For Kuje Prison Attack, Releases Video Of ‘Soldiers Of Caliphate’ In Action",
    "summarized_story": "The Islamic State-backed faction of Boko Haram, known as the Islamic State West Africa Province (ISWAP) has claimed responsibility for Tuesday's attack on Kuje Correctional Centre in Abuja, the nation’s capital.\nAccording to one of the sources, the terrorists invaded the facility around 9:05 pm and operated till 1:30 am on Wednesday morning.\nISWAP in a video released on Wednesday claimed responsibility for the attack.\nIn the video, the terrorist sect showed some of its men shooting their way into the facility.\nVIDEO: ISWAP Claims Responsibility For Kuje Prison Attack, Releases Video pic.twitter.com/99i8KPFtdr — Sahara Reporters (@SaharaReporters) July 6, 2022The claim comes a few days after ISWAP said its fighters killed a policeman in Suleja, Niger State.Suleja is less than 20 kilometres away from the Federal Capital Territory, Abuja.According to the group, the attack was carried out by “soldiers of the caliphate” with automatic weapons."
  },
  {
    "headline": "BREAKING: Many Feared Dead As Nigerian Air Force Jet ‘Accidentally’ Bombs Katsina Village",
    "summarized_story": "Tragedy struck on Wednesday as a fighter jet operated by the Nigerian Air Force bombed Kunkuna village in the Safana Local Government Area of ​​Katsina State, killing a yet-to-be ascertained number of villagers.\nFile Photo“A military jet earlier today dropped airstrikes on Kunkuna Village in Safana Local Government Area of ​​Katsina State.\nSaharaReporters called Edward Gabkwet, Air Force spokesman but the calls were not answered nor returned.\nA few days later, an Air Force jet dropped a bomb on a Nigerian community in the Lake Chad region.\nIn February 2022, an airstrike by the Nigerian Air Force targeting bandits killed seven children and wounded five others by mistake in the Niger Republic."
  },
  {
    "headline": "BREAKING: Many Feared Dead As Nigerian Air Force Jet ‘Accidentally’ Bombs Katsina Village",
    "summarized_story": "Tragedy struck on Wednesday as a fighter jet operated by the Nigerian Air Force bombed Kunkuna village in the Safana Local Government Area of ​​Katsina State, killing a yet-to-be ascertained number of villagers.\nFile Photo“A military jet earlier today dropped airstrikes on Kunkuna Village in Safana Local Government Area of ​​Katsina State.\nSaharaReporters called Edward Gabkwet, Air Force spokesman but the calls were not answered nor returned.\nA few days later, an Air Force jet dropped a bomb on a Nigerian community in the Lake Chad region.\nIn February 2022, an airstrike by the Nigerian Air Force targeting bandits killed seven children and wounded five others by mistake in the Niger Republic."
  },
  {
    "headline": "ISWAP 'claims responsibility' for Kuje prison attack",
    "summarized_story": "The Islamic State in West Africa Province (ISWAP) has reportedly claimed responsibility for the attack on a correctional facility in Kuje council area of the federal capital territory (FCT).\nA video, said to have been published on Wednesday by the Islamic State A’maq agency, shows what appears to be a view of the Kuje prison while gunshots are heard in the background.\nAdvertisementThe video also shows writing in Arabic, which, when translated, has ISWAP saying its members organised the attack.\n“A video clip obtained by Amaq shows the first moments of the liberation of prisoners after Islamic State fighters stormed Kuje prison yesterday in Nigeria,” it reads.\nAdvertisement#BREAKING: ISWAP has just claimed responsibility for the Kuje prison break, saying it had succeeded in “freeing dozens of prisoners”."
  },
  {
    "headline": "ISWAP 'claims responsibility' for Kuje prison attack",
    "summarized_story": "The Islamic State in West Africa Province (ISWAP) has reportedly claimed responsibility for the attack on a correctional facility in Kuje council area of the federal capital territory (FCT).\nA video, said to have been published on Wednesday by the Islamic State A’maq agency, shows what appears to be a view of the Kuje prison while gunshots are heard in the background.\nAdvertisementThe video also shows writing in Arabic, which, when translated, has ISWAP saying its members organised the attack.\n“A video clip obtained by Amaq shows the first moments of the liberation of prisoners after Islamic State fighters stormed Kuje prison yesterday in Nigeria,” it reads.\nAdvertisement#BREAKING: ISWAP has just claimed responsibility for the Kuje prison break, saying it had succeeded in “freeing dozens of prisoners”."
  },
  {
    "headline": "I'm disappointed with our intelligence system, says Buhari on Kuje prison attack",
    "summarized_story": "President Muhammadu Buhari has expressed disappointment over the manner Kuje prison in the federal capital territory (FCT) was attacked by suspected Boko Haram insurgents.\nThe president ascribed the situation to a failure of intelligence when he visited the medium security custodial centre on Wednesday.\nBuhari queried why terrorists are able to successfully “attack a security installation and get away with it”.\nAdvertisementGarba Shehu, presidential spokesman, said Buhari expressed shock at the scale and audacity of the attack.\nAdvertisementSpeaking with journalists after the inspection, Buhari said: “I am disappointed with the intelligence system."
  },
  {
    "headline": "I'm disappointed with our intelligence system, says Buhari on Kuje prison attack",
    "summarized_story": "President Muhammadu Buhari has expressed disappointment over the manner Kuje prison in the federal capital territory (FCT) was attacked by suspected Boko Haram insurgents.\nThe president ascribed the situation to a failure of intelligence when he visited the medium security custodial centre on Wednesday.\nBuhari queried why terrorists are able to successfully “attack a security installation and get away with it”.\nAdvertisementGarba Shehu, presidential spokesman, said Buhari expressed shock at the scale and audacity of the attack.\nAdvertisementSpeaking with journalists after the inspection, Buhari said: “I am disappointed with the intelligence system."
  },
  {
    "headline": "DCP Kyari, other VIPs did not escape during Kuje prison attack, says NCoS",
    "summarized_story": "The Nigerian Correctional Service (NCoS) says Abba Kyari, suspended deputy commissioner of police, is still in prison custody.\nAdvertisementReacting, Abubakar Umar, spokesperson of the NCoS, said Kyari did not escape from the facility.\n“This is also to confirm to the general public that DCP Abba Kyari and other VIPs held in the facility did not escape.\nUpon arraignment, Kyari and four other defendants pleaded not guilty.\nAdvertisementHowever, the sixth and seventh defendants pleaded guilty and have been sentenced accordingly."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "These founders are closing delivery gaps in Rwanda’s capital",
    "summarized_story": "During the 2020 lockdown, Anselme Mucunguzi, 30, noticed a gap in the technology needed to service last mile delivery in Kigali, the Rwandan capital.\nSo, in January 2021, he founded Nisawa, a last-mile delivery service.\nBirori had wanted Nisawa to transition to an online marketplace while Mucunguzi insisted on remaining in the last-mile delivery line.\nBuilding off of the solution he activated at Nisawa, Vanoma is an integrated e-commerce solution centred around a last-mile delivery service to enable local businesses and independent sellers to sell online.\nAll a seller needs to do to initiate a delivery is supply the receiver’s phone number on the Vanoma website."
  },
  {
    "headline": "How Nigerian startups can build healthier cultures",
    "summarized_story": "Earlier in May, TechCabal asked 5 employees at different startups what was important to them when considering a job offer.\nBut they ranked something else even higher: company culture.\nTurnover costs startups up to 20% of an employee’s annual salary, and for managerial roles, the costs will go up.\nBucknor uses the 70–20–10 model to explain why it’s important that startups learn how to give constructive feedback.\nThe way you address those needs impact your relationship with the children.”The right incentives, according to Samson-Grace, can boost a startup’s culture."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Input costs, floods seen shrinking agric output",
    "summarized_story": "Nigeria’s agricultural output in the second half of this year is expected to slow on the back of flooding and the continued surge in input costs, which have compounded the challenges facing farmers.\nRead also: Higher input costs claim 88.7% of livestock feed revenue in Q1“Fertiliser is going for a minimum of N18,500 for 20:10:10, while 15:15:15 is going for 27,000 and Urea is about 30,000 and still counting.\n“I do not see the sector doing better in the second half than it did in the first half.\nApart from surging input costs, the farmers also based their pessimism on the recent prediction of the Nigeria Hydrological Services.\nKabiru said farmers are also worried about the threat flood incidence might bring in the second half."
  },
  {
    "headline": "Input costs, floods seen shrinking agric output",
    "summarized_story": "Nigeria’s agricultural output in the second half of this year is expected to slow on the back of flooding and the continued surge in input costs, which have compounded the challenges facing farmers.\nRead also: Higher input costs claim 88.7% of livestock feed revenue in Q1“Fertiliser is going for a minimum of N18,500 for 20:10:10, while 15:15:15 is going for 27,000 and Urea is about 30,000 and still counting.\n“I do not see the sector doing better in the second half than it did in the first half.\nApart from surging input costs, the farmers also based their pessimism on the recent prediction of the Nigeria Hydrological Services.\nKabiru said farmers are also worried about the threat flood incidence might bring in the second half."
  },
  {
    "headline": "Farmers flee farms on worsening insecurity",
    "summarized_story": "As terrorism, banditry and kidnapping continue to escalate, farmers in Nigeria are forced to abandon their farms in many parts of the country.\n“Lots of farmers have abandoned their farmlands for fear of being kidnapped,” said Ibrahim Kabiru, national president of All Farmers Association of Nigeria.\nShe said insecurity must become a thing of the past before Nigeria could curtail the recent surge in food prices.\n“Our food production has not been growing in the past few years due to insecurity in the country.\nApart from insecurity, climate change has also adversely impacted food production in the country."
  },
  {
    "headline": "Atiku-Okowa Presidency Will Truly Rescue Nigeria – Aniagwu – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAsaba – Nigerians have been assured that the Alhaji Atiku Abubakar-Ifeanyi Okowa presidential ticket of the Peoples Democratic Party (PDP) in the 2023 elections will truly rescue Nigeria with a pragmatic approach to the mission.\nDelta State Commissioner for Information, Mr Charles Aniagwu gave the assurance to journalists in Asaba, the state capital.\n“Beyond members of our party, Nigerians believe that the PDP should get it right as the major option for the people ahead of the 2023 general election.\n‘’This means that Okowa will work with other leaders in the south and across the country to galvanize the voters.\nWhen you have these two individuals who are open and believe in the strength of everybody, it is an advantage."
  },
  {
    "headline": "Delta To Complete 24-km Isoko Ring Road In December,2022 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAsaba – Delta Governor, Sen. (Dr) Ifeanyi Okowa, has said that the 24-kilometre Isoko Ring Road project running from Ellu, Ovrode, Ofagbe, Orie, Okpe-Isoko, Uro to Ada-Irri traversing Isoko North and Isoko South Local Government Areas would be completed in December, 2022.\nOkowa disclosed this to newsmen shortly after inspecting construction works at the bridge linking Ellu and Ofagbe on the road.\n“There was, therefore, the need to construct another bridge that is raised up and that is why you find the alternate bridge being constructed now.\n“The alternate bridge being constructed is going to be 1.2 meters higher than this current bridge.\nI think that will take care of the flooding situation on the existing bridge."
  },
  {
    "headline": "Ossiomo Power: Restructuring of Benin Disco Over Debts Vindicated Governor Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe restructuring of 5 electricity distribution companies (DisCos) has vindicated Governor Obaseki investment in Ossiomo power plant.\nThere is need for President Buhari to adopt Governor Obaseki’s power model of power generation and distribution in Edo State.\nIn June 2017, Governor Godwin Obaseki announced to the world that in six month’s time, his administration would provide uninterrupted power supply to Bénin City and environs.\nChecks in the Benin metropolis have revealed that the two major power distribution companies in the state, Benin Electricity Power Distribution Company (BEDC) and Ossiomo Power Company are in a fierce battle for the customers with the competition assuring better power options to residents.\nToday, Ossiomo power is providing affordable, secure and reliable electricity by attracting investors with low risk, stable returns."
  },
  {
    "headline": "Flooding: Edo urges proper waste disposal, charges residents on clearing of debris – Nigerian Observer",
    "summarized_story": "Jonathan Lawani, who made the submission, said the active involvement of citizens in environmental regeneration is germane to maintaining a hygienic environment.\nHe said, “I want to appeal to the people of Edo State on the issue of waste management, cleanliness and erosion control.\nWe also have sweepers’ waste evacuators that are specifically dedicated to our major roads where our sweepers are cleaning on a daily basis.\nIf we undertake major drain construction on those areas, it’s going to cost billions of naira.\nWhat we did was to quickly provide a means of solving that problem without spending too much resources.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Prison attack: Avoid airport road, Kaduna, Katsina, others, US, UK warn citizens",
    "summarized_story": "The United States Embassy has warned its citizens in Nigeria against travelling on the road leading to the Nnamdi Azikiwe International Airport, Lugbe, Abuja.\nAlso, United Kingdom citizens were warned not to be cautious of travelling to 19 states in Nigeria.\nAmong the states are Borno, Yobe, Adamawa, Gombe, Kaduna, Katsina, Zamfara and riverine areas of Delta, Bayelsa, Rivers, Akwa Ibom and Cross River.\n“On the night of July 5, 2022, an attack on Kuje Prison freed a large portion of the estimated 1,000 prisoners.\nIt is recommended that U.S. citizens should maintain a high state of personal security awareness for the next two weeks and avoid unnecessary travel on the airport road."
  },
  {
    "headline": "Over 70 percent of Kuje prison inmates are dangerous criminals – Dambazau",
    "summarized_story": "Lt. Gen. Abdulraman Dambazau (rtd), former chief of Army staff and ex-minister of interior has noted that more than 70 percent of inmates at the Kuje custodial centre are dangerous criminals who ought not to be in the facility.\nRecall that terrorists in an audacious attack that lasted for about hours, freed 879 inmates from the facility on Tuesday night.\nSpeaking in an interview on Channels TV on Wednesday, Dambazau noted it was wrong to mix up terrorists with politically exposed persons in the facility.\nHe said, “Over 70 percent of inmates are dangerous criminals but the Kuje prison is medium security.\n“It is clear that Boko Haram has become more dangerous because they now have cells everywhere, from where they now launch attacks."
  },
  {
    "headline": "Buhari: How can terrorists organize, attack a security installation and get away with it?",
    "summarized_story": "Muhammadu Buhari, Nigeria’s president, has expressed shock about the attack by the Tuesday night’s attack by terrorists on Kuje custodial centre, Abuja, noting that he’s disappointed with country’s intelligence system.\nThe Nigerian leader who visited the scene of the attack on Wednesday, took to his twitter handle, @MBuhari, to express surprise at the attack, while noting that he expects a comprehensive report on the attack.\n“Saddened by the attack on the Medium Security Custodial Centre, Kuje.\n“How can terrorists organize, have weapons, attack a security installation and get away with it?\nI am expecting a comprehensive report on this shocking incident.”Recall that terrorists in the audacious attack that lasted for about hours, freed 879 inmates from the facility."
  },
  {
    "headline": "Kuje Prison attack: No amount of blackmail can stop my Dakar trip, Buhari replies critics",
    "summarized_story": "The Presidency on Wednesday replied critics of President Muhammadu Buhari’s foreign trips, especially the trip to Dakar Senegal, hours after terrorists invaded Kuje Custodial centre in the capital.\nIn a statement released by presidential aide, Garba Shehu, the presidency said “Governments don’t stop working because nations face terrorist threats.\nHe visited Portugal last week and also participated in the United Nations Ocean Conference in Lisbon June 27 to July 1.\nThe president also visited Brussels, Belgium in February for the 6th European Union-African Union Summit; Nairobi.\nHe was in Kenya in March, for the 50th anniversary of the United Nations Environmental Programme."
  },
  {
    "headline": "National Waves honours Keyamo, Nwoko, Julius Berger, Dangote Group, others at 14th Anniversary Awards",
    "summarized_story": "NATIONAL WAVES Newspaper/ Magazine is celebrating its 14th year on the newsstands.\nTo commemorate the anniversary, the management of NATIONAL WAVES concluded arrangements to honour eminent Nigerians and industries.\nChijioke Edeoga.\nOthers are; the Publisher Pointblank News and founder, Mary and Ude- Jack Foundation, Chief Jackson Ude, President of Institute of Debt Recovery Practitioners of Nigeria, Mr Chris Akintunde Opeodu, MD/CEO of Corporate Choices Nigeria Limited, Mr Chia Waya, Dangote Group and Julius Berger Nigeria Plc.\nMr. Festus Keyamo SAN, is expected to deliver a lecture on, “THE JUDICIARY AND THE 2023 ELECTION”, in the event which will take place on Saturday, July 23, 2022 at Airport Hotel, Ikeja, Lagos."
  },
  {
    "headline": "How ISWAP Attacked Kuje Correctional Center",
    "summarized_story": "They scampered for safety and fled for their lives in the attack that many initially thought was targeted at residents of Elrufai Estate in Kuje.\nAn officer of the NSCDC also paid the supreme price, while at least eight officers of the Nigeria Correctional Service sustained various degrees of injuries.\nHowever, the attackers of the Kuje Correctional Facility in their numbers evaded the watchful eyes of the security apparatchik, operated for an hour and escaped arrest by the state.\nStationed permanently at the Kuje Correctional Centre are Armoured Tank, platoons of soldiers, Mobile Police Operatives, with armed officers of NSCDC, men of the Department of State Security and NCoS providing support on perimeter security.\nIt calls to questions the entire security architecture of the Nigerian State as this is too close to the seat of power in Nigeria,” Bashir noted."
  },
  {
    "headline": "How ISWAP Attacked Kuje Correctional Center",
    "summarized_story": "They scampered for safety and fled for their lives in the attack that many initially thought was targeted at residents of Elrufai Estate in Kuje.\nAn officer of the NSCDC also paid the supreme price, while at least eight officers of the Nigeria Correctional Service sustained various degrees of injuries.\nHowever, the attackers of the Kuje Correctional Facility in their numbers evaded the watchful eyes of the security apparatchik, operated for an hour and escaped arrest by the state.\nStationed permanently at the Kuje Correctional Centre are Armoured Tank, platoons of soldiers, Mobile Police Operatives, with armed officers of NSCDC, men of the Department of State Security and NCoS providing support on perimeter security.\nIt calls to questions the entire security architecture of the Nigerian State as this is too close to the seat of power in Nigeria,” Bashir noted."
  },
  {
    "headline": "BREAKING: ISWAP Terrorists Claim Responsibility For Kuje Prison Attack",
    "summarized_story": "The Islamic State of West Africa Province (ISWAP) terrorist group, has claimed responsibility for the attack on Kuje Medium Security Custodial Centre in Abuja on Tuesday night.\nLEADERSHIP reported how terrorists broke into the prison and released over 800 inmates, including high-profile suspects.\nIn a video clip on Wednesday night, the terrorist group showed some of its men shooting their way into the custodial center.\nThe terrorists were seen marching in groups while vehicles and building were on fire in the 38-second footage.\nThe Islamic State’s A’maq Agency released the video with the caption in Arabic language: “Fighters of Islamic State attacked Kuje prison in Abuja yesterday and succeeded in freeing dozens of prisoners.”"
  },
  {
    "headline": "BREAKING: ISWAP Terrorists Claim Responsibility For Kuje Prison Attack",
    "summarized_story": "The Islamic State of West Africa Province (ISWAP) terrorist group, has claimed responsibility for the attack on Kuje Medium Security Custodial Centre in Abuja on Tuesday night.\nLEADERSHIP reported how terrorists broke into the prison and released over 800 inmates, including high-profile suspects.\nIn a video clip on Wednesday night, the terrorist group showed some of its men shooting their way into the custodial center.\nThe terrorists were seen marching in groups while vehicles and building were on fire in the 38-second footage.\nThe Islamic State’s A’maq Agency released the video with the caption in Arabic language: “Fighters of Islamic State attacked Kuje prison in Abuja yesterday and succeeded in freeing dozens of prisoners.”"
  },
  {
    "headline": "JUST-IN: NAF Air Strikes Kill 42 Terrorists In Katsina",
    "summarized_story": "Airstrikes executed by the Air Component of Operation Hadarin Daji on July 5, 2022 killed 42 terrorists near Zakka and Umadan villages in Safana local government area of Katsina State.\nAccording to military sources, a NAF aircraft while on an air recce mission, received intelligence of the sighting of terrorists between Zakka and Umadan villages.\n“Subsequently, the location was struck by NAF aircraft in successive passes with scores of unsuspecting terrorists eliminated.\n“Fortunately, as had been anticipated, the hostages were later seen escaping after the successful Air Interdiction by the NAF aircraft.\n“The villagers also confirmed that over 24 terrorists were eliminated in the carefully planned and coordinated air strikes,” the source said."
  },
  {
    "headline": "BREAKING: Sheikh Gumi’s aide reveals identity of terrorists who attacked Kuje prison",
    "summarized_story": "Mallam Tukur Mamu, media consultant to controversial Islamic cleric, Sheikh Ahmad Gumi has revealed the identity of the group that attacked the Medium Security Custodial Centre in Kuje area of the FCT.\nMamu who played the lead negotiator for the Abuja-Kaduna train kidnapped passengers said the Ansaru terrorists, same group that attacked and abducted the train passengers on March 28 are responsible for the deadly Tuesday night Kuje Prison attack.\nRecall, this newspaper reported how gunmen broke into the facility and released some of the inmates, including Boko Haram suspects and bandits.\nThe ministry of interior said about 600 inmates escaped from the correctional facility but 300 have been recaptured.\nBut in an update on the situation, Umar Abubakar, spokesman of the Nigerian Correctional Service (NCoS) , said: “A total of 879 inmates escaped from the facility during the unfortunate attack."
  },
  {
    "headline": "2023: Court asked to bar APC from replacing Masari as Tinubu’s VP",
    "summarized_story": "Two chieftains of the All Progressives Congress, APC, Zakari Maigari and Zubainatu Mohammed, on Wednesday, approached the Federal High Court sitting in Abuja, praying it to bar the party from replacing Alhaji Kabiru Masari as the running mate to Ahmed Bola Tinubu in the forthcoming presidential election.\nCited as 1st to 4th Defendants in the suit marked: FHC/ABJ CS/1059/2022, are the APC, INEC, Tinubu and Masari.\nThe plaintiffs argued that Section 187 (1) of the Constitution created the Governorship candidate and Deputy-Governorship candidate joint ticket, just as section 142(1) established the joint-ticket for the Presidential candidate and Vice-Presidential candidate.\nMeanwhile, no date has been fixed for hearing of the matter.\nIt will be recalled the both APC and the Labour Party had in a bid to beat deadline, submitted tentative names to INEC as “place holders” for their Vice Presidential candidates, with the intention of submitting them afterwards."
  },
  {
    "headline": "BREAKING: Funke Akindele Emerges PDP’s Deputy Governorship Candidate For Lagos State",
    "summarized_story": "Nollywood actress, Funke Akindele, popularly known as Jenifa has emerged as the deputy governorship candidate for the People’s Democratic Party (PDP) in Lagos State.\nNaijaloaded reports Funke Akindele emerged as the PDP deputy governorship candidate to Alhaji Abdulaziz Olajide Adediran popularly known as Jandor on Wednesday.\nThe Nollywood actress shrugged off stiff competition from the other four contestants, who were also shortlisted for the deputy governorship candidate position.\nFollowing a tough screening exercise, Funke was chosen as the PDP deputy governorship candidate in Lagos, beating former governorship aspirant, Gbadebo Rhodes-Vivour.\nFormer Senatorial candidate for Lagos East, Yeye Shobajo, another governorship aspirant, David Kolawole Vaughan known as DAKOVA, and Engr."
  },
  {
    "headline": "BREAKING: Photos Of President Buhari While Visiting Kuje Correctional Centre After Terror Attack",
    "summarized_story": "President Muhammadu Buhari on Wednesday visited the Kuje Prison which was attacked by terrorists on Tuesday night.\nBuhari arrived the Kuje Correctional Facility, in the afternoon and inspected the ruins after terrorists bombed the prison, with over 800 inmates escaping.\nFour inmates of the Kuje Custodial Centre died and 879 escaped during the attack by the terrorists on Tuesday night.\nIf you recall, President Buhari had paid an unscheduled visit to the Kuje Correctional Centre shortly before departing for Senegal.\nThere had been public outcry over the decision of the President to go ahead with the Dakar trip after the terrorist attack on the correctional centre and another one involving his advance team to Daura, around Dutsinma, Katsina State, also on Tuesday evening."
  },
  {
    "headline": "Investigation: How intelligence failure, insiders’ conspiracy led to Kuje jailbreak",
    "summarized_story": "The daring terrorists were said to have operated successfully for about three hours and got 879 inmates escaped from the facility.\n“Besides, officials of the Directorate of State Security Service (DSS) had early Wednesday morning sealed up all ends in and out of Kuje, stopped every moving vehicle for careful search for any suspected escapee.\nMagashi told newsmen that there were strong indications that terrorists invaded the facility to free their members being held in detention.\nHe said the correctional centre could accommodate 994 prison inmates.\nAfter inspecting some of the points impacted by the attack, President Buhari spoke to newsmen, expressing disappointment with the intelligence system (and utilization)."
  },
  {
    "headline": "APC delegates ask court to stop Masari’s replacement as Tinubu’s running mate",
    "summarized_story": "A Federal High Court sitting in Abuja has been asked to stop the All Progressives Congress (APC) from replacing Kabiru Masari as the running mate to the party’s presidential candidate, Bola Tinubu.\nShortly after Tinubu emerged as the APC flagbearer, the party submitted Masari’s name to the Independent National Electoral Commission (INEC) as the vice-presidential candidate, for the meantime.\nHowever, two chieftains of the party and delegates in the just concluded APC national convention, Zakari Maigari and Zubainatu Mohammed approached the court to stop INEC from accepting a change of vice-presidential candidate from APC.\nThe plaintiffs joined, APC, INEC, Tinubu, and Masari as defendants in the suit marked FHC/ABJ/CS/1059/2022 and dated July 4, 2022.\n“In the case of the governorship candidate and deputy governorship candidate joint ticket, it was held in PDP v. DEGI EREMIENYO (2020) LPELR-49734(SC), pp."
  },
  {
    "headline": "Breaking: Funke Akindele emerges PDP deputy governorship candidate",
    "summarized_story": "Popular actress, Funke Akindele, also known as Jenifa has emerged as the running mate nominees for the People’s Democratic Party governorship candidate in Lagos State, Olajide Adediran.\nFollowing a tough screening exercise, Funke was chosen as the PDP deputy governorship candidate in Lagos, beating former governorship aspirant, Gbadebo Rhodes-Vivour.\nFormer senatorial candidate for Lagos East, Yeye Shobajo, another governorship aspirant, David Kolawole Vaughan known as DAKOVA, and Engr.\nTeslim Balogun were also shortlistedShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "FG to secure Nigeria ownership of maritime industry",
    "summarized_story": "By Naomi DouglasFederal Government is set to sack jobs in the shipping industry dominated by foreigners that own several shipping lines operating in Nigeria.\nIn its bid to rid the industry of this feat, the FG has reaffirmed Commitment to establish a national shipping line.\nHighlights of the event was hinged on the importance of Nigerian ownership of shipping activities within the country in order to reap the full economic benefits of the maritime sector.\nRepresented by the Director of Procurement, Useni Adamu, Saraki emphasised the need for capacity building in the maritime industry.\n“The present administration is looking into ways of encouraging the establishment of a private sector-driven national shipping line to ensure maximum exploitation of the potentials in our maritime industry."
  },
  {
    "headline": "Nigeria’s Economic Diversification: Value addition in solid minerals sector will spur industrialization- DG NSRMEA",
    "summarized_story": "By Palma IleyeDirector General, National Steel Raw Materials Exploration Agency, NSRMEA, Engr, Dr. Umar Albarka Hassan, has said that value addition in iron and steel production was not only for the purpose of revenue generation but will also spur industrialization and investment rates in the country.\nWhen you talk about steel production it is actually extracting iron ore and converting it into steel which is also value addition.\nAnd our mandate is to source for materials for iron and steel production and ofcourse adding value.\nWhen you talk about other minerals that are exploited example gold and other minerals we have established smelting companies to create value addition to such minerals.\nAlso we have established Manganese resources located in Cross River and Kogi State we have also established and earmarked local sources deposits in Zamfara State,” he added."
  },
  {
    "headline": "NGSA, NMCO, AG Vision others top The Truth’s most impactful mining sector entities of 2022",
    "summarized_story": "By Palma IleyeNigerian Geological Survey Agency, NGSA, the Nigeria Mining Cadastre Office, NMCO, AG Vision and seven others have emerged as Truth-Afrique 2022 impactful companies contributing to the growth of Nigeria mining sector.\nThe organisation however said that no state government met the criteria for inclusion in the list.\nKadiri said state governments were not doing enough in the quest to jointly pursue the realisation of the Roadmap for Growth and Development of the Nigerian mining sector.\nAccording to him, “None of the 36 State governments satisfied the criteria for organisation ten most impactful mining sector entities of 2022.\nHe therefore congratulated the entities that made the list and urged them to continue to contribute to the growth and development of the Mining and Mineral sector of Nigeria."
  },
  {
    "headline": "MMSD task staff on dedication to duty for improved productivity",
    "summarized_story": "has called on Civil Servants to be dedicated to duty for improved productivity.\nAdegbite made the call during the celebration organized by the ministry to commemorate the 2022 African Public Service Day in Abuja.\nShe told the workers that the occasion also affords the opportunity to specially acknowledge members of staff that have distinguished themselves through outstanding performance.\nUmar Adamu Tsoho who was honoured with the “Presidential Public Service Award” by the OHCSF for outstanding service.\nIt is indeed a noble achievement to successfully exit the Federal Civil Service through retirement."
  },
  {
    "headline": "Economy Diversification: Why Nigeria’s mining sector offers robust economic potential- Adegbite",
    "summarized_story": "“Let me emphasis that, investment in the minerals and mining sector by stakeholders is a patriotic duty of every citizen who believe in the Nigerian Project.\nThe Federal government is developing a well governed mining sector with sustainable capacity and has also articulated a roadmap to address some of the identified challenges in the mining sector.\nThe initiatives and strategies outlined in the roadmap are designed largely to make the mining and minerals sector an irresistible destination for global capital.\nIn addition, developmental plans should take into cognizance the overall development aspirations of the State alongside the prospects and challenges of mining activities“The Mining sector to significantly contribute to Nigeria’s economy cannot be over-emphasized.\nKey programs of relevance to the sector must be critically and more robustly assessed by qualified professionals in the mix of our national development."
  },
  {
    "headline": "I Am Disappointed With The Intelligence System, Buhari Says After Inspecting Kuje Prison",
    "summarized_story": "President Muhammadu Buhari says he is disappointed with the intelligence system and utilisation at the Medium Security Custodial Centre, Kuje in Abuja.\nHe said this on Wednesday while speaking to journalists during his visit to the correctional facility which came under attack by terrorists last night.\n“I am disappointed with the intelligence system,” President Buhari was quoted as saying in a statement by his Senior Special Assistant on Media and Publicity, Garba Shehu.\nAccording to Shehu, President Buhari, like most Nigerians, was shocked by both the scale and audacity of the attack.\n“How did the defences at the prison fail to prevent the attack?” the President queried."
  },
  {
    "headline": "ISWAP Claims Responsibility For Kuje Prison Attack",
    "summarized_story": "The Islamic State in West Africa Province (ISWAP) has claimed responsibility for Tuesday’s attack on the Medium Security Custodial Centre in Kuje, Abuja.\nThis was disclosed on Wednesday in a statement written in Arabic shared via A’maq Agency, a news channel run by the Islamic State.\nREAD ALSO: An Intruder Can Access Kuje Prison Easily – Retired Grp.\nA researcher who analyses ISWAP activities in sub-Saharan Africa, Tomasz Rolbecki, also linked the attack on the correctional facility to the terrorist group.\n“There is one question to answer – how did ISWAP manage to do it?"
  },
  {
    "headline": "Kuje Prison Attack: Over 800 Inmates Escape, Four Killed – NCoS",
    "summarized_story": "Authorities of the Nigerian Correctional Service (NCoS) say over 800 inmates escaped the Kuje Prison on Tuesday night following an attack by suspected Boko Haram Terrorists.\nAccording to a statement by on Wednesday by the Chief Superintendent of Corrections, Umar Abubakar, a total of 879 inmates escaped from the facility.\nRegarding the welfare of the embattled police officer, DCP Abba Kyari and other VIPs held in the facility, Mr Abubakar said these individuals did not escape during Tuesday’s attack.\n“This is also to confirms to the general public that DCP Abba Kyari and other VIPs held in the facility did not escape.\nNababa further extended his condolence to the families of those who lost their lives during the attack and wished the injured ones a quick recovery."
  },
  {
    "headline": "All 64 Boko Haram Members In Kuje Prison Have Escaped – Defence Minister",
    "summarized_story": "The Minister of Defence, Bashir Magashi, on Wednesday, reacted to the Kuje prison attack, saying all the 64 members of the Boko Haram terrorists fled the facility.\nAddressing reporters a day after the attack, Magashi said there are strong indications that terrorists invaded the facility to free their members being held in detention.\nREAD ALSO: One Dead, Three Injured In Kuje Prison Attack“Most likely, they are Boko Haram because we have a sizeable number of Boko Harams that are in detention,” the minister said.\nI think there are about 64 Boko Haram (members) in prison, they have all escaped.”Noting that the situation is under control, he said the correctional centre could accommodate 994 prison inmates.\nOf the figure, the Defence Minister said the government has been able to track down 600 inmates who have been recaptured."
  },
  {
    "headline": "An Intruder Can Access Kuje Prison Easily – Retired Grp. Captain",
    "summarized_story": "Following his visit to the Medium Security Custodial Centre in Kuje hours after it came under attack by terrorists, Shehu stated that his findings showed a poor security architecture of the facility.\n“I took time to go to Kuje prison for the first time today and I was noting the terrain and the access to the prison,” he highlighted during his appearance on Channels Television’s Politics Today.\n“As soon as you come to Kuje – the main prison itself, what strikes you is a neglected derelict building.\n“If the President had come the way I came; even the outer walls of the Kuje prison are too low for a prison perimeter wall.\nThe barbed wire is against regulation; there are standards for how a security wall that is housing a prison should be."
  },
  {
    "headline": "Chief Whip dismisses Rumoured Defection of 8 PDP Oyo Lawmakers -",
    "summarized_story": "Hon Adedibu, who is also the Chief Whip of the House debunked the rumor during Wednesday’s plenary under personal explanation.\nAdvertisementHe explained that though he and the other seven members will not be returning to the House in 2023, there is no plan by them to leave the ruling Peoples Democratic Party, PDP in Oyo State.\nHon Adedibu urged members of the public to disregard the unfounded rumour.\n” On behalf of other seven members, i Hon Hakeem Adedibu wish to state categorically that there was never a plan by me or any of the other seven members of the PDP to defect to another party .\n” Hon Hakeem Adedibu."
  },
  {
    "headline": "Oyo assembly directs CJ to set up panel against Deputy Governor -",
    "summarized_story": "AdvertisementRecall that on the 17th of June, 2022 a correspondence/petition titled ” Notice of Allegations of Gross Misconduct Against the Deputy Governor of Oyo State, Engr Rauf Olaniyan” was read at the floor of the plenary.\nIn the petition, the 23members accused the Deputy Governor of Gross Misconduct, abuse of office, financial recklessness, abandonment of office and insubordination.\nAdvertisementAdvertisementThe House thereafter served the Deputy Governor and all other members of the Legislature a copy of the allegations.\nWhile reading the motion, the Majority Leader noted that up till now the Deputy Governor had not responded to the copy of the allegations served him by the House.\n“We have no say whether the State Deputy Governor is guilty or not."
  },
  {
    "headline": "Over 78,000 persons have completed their registration in Oyo- INEC -",
    "summarized_story": "The Independent National Electoral Commission says a total of 78,420 persons have completed the Continuous Voters Registration in Oyo State but only about 45,000 are valid out of them.\nThe Oyo state Resident Electoral Commissioner Mutiu Agboke disclosed this at a media briefing held in Ibadan.\nAdvertisementAdvertisementAccording to him, we have 78,420 registrants that completed registration during these period but there were only 45,187 valid registration out of it all.\nThe Independent National Electoral Commission, INEC, had originally scheduled the deadline for the stoppage of registration for the PVC’s for the 30th of June but has now extended the deadline indefinitely.\nThis is another in the Series of regular update by the Election Mangement Body, INEC."
  },
  {
    "headline": "APC Flag-bearer Uba Sani Retains El-rufai’s Deputy As Running Mate -",
    "summarized_story": "The governorship flag bearer of the ruling All Progressives Congress (APC) in Kaduna State, Senator Uba Sani, has chosen Dr. Hadiza Balarabe, the current deputy to Governor Nasir El-Rufai’s deputy, as his running mate.\nHe made this known via his social media handles on Monday night and explained that the decision was made after consultations with stakeholdersAdvertisementUba Sani further explained that Dr Balarabe has demonstrated hard work, dedication and team spirit in the discharge of her duties as deputy governor which makes her the most qualified for the position.\nAdvertisement"
  },
  {
    "headline": "2 Die, 15 Rescued in Lagos Boat Mishap",
    "summarized_story": "Two adult females lost their lives Wednesday in a boat mishap that occurred at Ikorodu when their boat submerged following its departure from the Ipakodo ferry terminal this morning.\nThe 20 passenger capacity boat named “Rahael & Nike II” was conveying 17 passengers when it capsized due to suspected mechanical fault submerged following its departure from the terminal.\nDuring the intense operation, 15 persons were rescued alive by a combined team of Water Guards, Search and Rescue Team of the Lagos State Waterways Authority (LASWA) and LASEMA Response Teams mobilized to scene of the incident.\nWhile LASWA has instituted an investigation into the cause of this boat mishap, the Boat Captain is also under investigation by the relevant authorities.\n“The Boat Captain is currently being investigated by the relevant authorities while an investigation into the cause of this mishap is being carried out by LASWA."
  },
  {
    "headline": "Peter Obi: I Want Someone Young Like Datti-Ahmed as Running Mate",
    "summarized_story": "The presidential candidate of the Labour Party, Peter Obi, has revealed the type of running mate he wants ahead of the 2023 general elections.\nObi said on the ARISE Morning Show Wednesday morning, that he would like someone like Yusuf Datti-Ahmed as his running mate.\nThe former governor of Anambra State said he prefers to have younger people who have a lot to offer rather than recycling old hands.\n“We need to start lowering.g these barriers and bring younger people with fresh ideas, rather than recycling ourselves.\nObi argued that his vast knowledge of the economy backed by his solutions on how to rescue and reposition it puts him in vantage position to be President."
  },
  {
    "headline": "Buhari Swears In Seven New Ministers, Reshuffles Cabinet",
    "summarized_story": "Following their screening and confirmation by the Nigerian Senate, President Muhammdu Buhari Wednesday swore-in 7 new Ministers and assigned portfolios.\nThe swearing-in took place, just before the commencement of the Federal Executive Council meeting at the council chambers.\nThose sworn in areUmana Okon Umana (Akwa-Ibom) is Minister of Niger Delta Affairs, he takes over from Godswill Akpabio.\nOlorunimbe Mamora is now the Minister of Science and Technology;Sharon Ikeazor, Minister of State Niger Delta Affairs; Mu’azu Jaji Sambo is the Minister of Transportation.\nIn his remark, President Buhari congratulated the new ministers and urged them to give their best in the discharge of their duties."
  },
  {
    "headline": "Nigeria: All Boko Haram Suspects In Kuje Prison Have Escaped, Defence Minister Says",
    "summarized_story": "The Minister of Defence, Bashir Magashi, has said none of the Boko Haram suspects detained at Kuje prison in Abuja was found after the attack on the facilities on Tuesday night.\nAccording to local sources, high-profile Boko Haram suspects and bandits escaped during the invasion of the prison on Tuesday night.\nAddressing journalists after taking an assessment tour of the facility, the minister said, “The attack started around 10:30pm.\nMost likely, they are Boko Haram members because we have sizeable number of Boko Haram suspects in detention, and presently we cannot locate any of them.\n“I think they are about 64 in the prison and none of them now is available they have all escaped.”"
  },
  {
    "headline": "Peter Obi: I Will Remove Fuel Subsidy, Use Savings for Education, Health, Security",
    "summarized_story": "Labour Party presidential candidate, Peter Obi, maintains that Nigeria’s implementation of fuel subsidy is shambolic and a scam while emphasizing his resolve to remove subsidies and improve critical economic sectors like power, healthcare and education.\nAccording to Obi, “…we cannot spend $40bn on subsidy and less than half on education & health.”"
  }
]