[
  {
    "headline": "N’Assembly ignores South govs, others, defends controversial PIB provisions",
    "summarized_story": "While the House proposed five per cent share for host communities, the Senate suggested three per cent.\nThe PUNCH, however, learnt on Wednesday that the conference committee would only focus on the areas of difference and would not tinker with the provisions under criticism.\nNigerians are assured that the Trust Fund will take care of the host communities, to the exclusion of all others.\n“Pipeline routes are not host communities, they are impacted communities under the care of the operators in the course of their operations.\nHe had said, “The conference committee will meet with our counterparts in the House, the House will also announce the composition of the conference committee."
  },
  {
    "headline": "B’Haram storms Adamawa community, 18 bodies recovered, many missing",
    "summarized_story": "Eighteen corpses had so far been recovered from the dawn attack and more bodies were being expected to be discovered because of the way the attack was carried out.\nThe council boss added, “The attackers came on motorbikes and waylaid their victims, who they chased and opened fire on.\nSo far, 18 corpses have been recovered with the help of security agents, who have restored normalcy.\nAt the moment, the military has recovered 18 corpses.\nThe military, however, said the information at its disposal was that only two corpses had been recovered from the community."
  },
  {
    "headline": "TB Joshua’s Burial: Ex-British boxing champion, Peter Oboh tasks Sanwo-Olu on security",
    "summarized_story": "The ex-Commonwealth and WBA Light Heavyweight boxing champion, Peter Oboh, has urged Governor Babajide Sanwo-Olu to ensure adequate security during the burial of late Prophet TB Joshua of the Synagogue Church of All Nations.\nHe said: “I want to use this opportunity to plead with the Lagos State Governor, Babajide Sanwo-Olu to deploy enough security during TB Joshua’s burial, which is scheduled for July 9 in Lagos.\n“Many Nigerians and people from other nations will be attending, because by the grace God gave Prophet TB Joshua, he did not only touch people in Nigeria but all over the world.\nThe late TB Joshua was not just a Nigerian prophet, but an international one.\n“I am not sure there can be a replacement for him; a unique man of God with special grace,” says the ex-Boxing champion, Peter Oboh concluded."
  },
  {
    "headline": "2023: Reps not plotting to dump e-transmission of polls’ results —Gbajabiamila",
    "summarized_story": "*As Protests rock National AssemblyBy Tordue Salem, AbujaThe Speaker of the House of Representatives, Rep. Femi Gbajabiamila, Tuesday dismissed reports that the lawmakers were plotting to remove electronic transfer of election results from the Electoral Act amendment bill.\nThe helmsman of the Green Chamber, also stressed that they are yet to receive the report from the committee.\nGbajabiamila was responding to a point of order raised by a member, Rep. Ozurigbo, who said his constituents have inundated him with calls, demanding why the lawmakers would refuse electronic transfer of election results.\nOzurigbo said, “A number of Nigerian have been calling me to express worry about the alteration to the electoral act.\nI don’t know the information going around where they said that we carefully amended section 50 subsection 2 that the agreed electronically transmitted election result has been changed to manually transmitted."
  },
  {
    "headline": "Omaduvie Felicitates with Okowa at 62",
    "summarized_story": "Ambassador Omaduvie Sunday has felicitated with the Delta State Governor Dr. Ifeanyi Okowa as he clocks 62 years on July 8In a Congratulatory message, Omaduvie said that Okowa at 62 is Worthy of praises looking at his achievements.\nREAD ALSOOkowa felicitates With James Manager at 61He commended Okowa for his role in the development of Delta State.\nAmb Omaduvie noted that despite the limited funds in the State, the Governor didn’t give up on delivering the dividends of Democracy to Deltans.\n” Your Excellency as you Celebrate 62 years, it is important we commend your good services to the People of Delta State.\nDespite limited funds, you were able to reach out to the People of Delta State."
  },
  {
    "headline": "Umahi appoints former Commissioner for LG as new Chief of Staff -",
    "summarized_story": "By Peter Okutu, ABAKALIKIGOVERNOR David Umahi of Ebonyi State has appointed the former Commissioner for Local Government and Chieftaincy Matters, Samuel Okoronkwo, as his new Chief of Staff.\nOkoronkwo served as the Commissioner for Local Government and Chieftaincy Matters before the governor dissolved his cabinet about a month ago.\nIn a statement by the Secretary to the State Government and Coordinating Commissioner, Dr Kenneth Ugbala, on Sunday, stated that the appointment was with immediate effect.\nIt said: “Governor of Ebonyi State, Dr David Umahi, has approved the appointment of Chief Samuel Okoronkwo as Chief of Staff, Government House, Ebonyi State.\nPlease, accept my congratulations,” the statement reads."
  },
  {
    "headline": "Bandits, insurgents don't deserve mercy, CSOs back Army Chief -",
    "summarized_story": "The CSOs, which stated these in a separate interview with Vanguard in Abuja, insisted that murderers should not be treated with kid gloves.\n“Killing them extrajudicially may not be conventional, but it is equally not a matter of applying the rules of engagement.\n“Treating them in the language they understand could mean showing them no mercy as they do not show other Nigerians mercy.\nHe said, “Where criminals, bandits or terrorists engage security agencies in a shoot-out, it will be lawful for the security agencies to return fire in self-defense and to also protect victims of the attack.\n“However, security agencies, including the military, are not legally empowered to carry out extrajudicial executions of suspects."
  },
  {
    "headline": "Nnamdi Kanu, Sunday Igboho: Blame Buhari govt for secession agitations – Col Umar",
    "summarized_story": "Colonel Abubakar Umar (rtd), a former Military Administrator of Kaduna State, has blamed the current government under President Muhammadu Buhari for separatist agitations threatening the country’s unity.\nUmar, who disclosed this in a statement on Wednesday titled: ‘Nigeria; A Nation Challenged, ‘insisted that the current administration under Buhari has failed to unite Nigeria.\n“Activities of those criminals have resulted in the evacuation of over 20 per cent of the villages in North West and North East.\nNnamdi Kanu, the leader of IPOB, was rearrested and repatriated to the country to continue his trial.\nKanu is presently in detention in the custody of the Department of State Services, DSS, while his trial continues."
  },
  {
    "headline": "Buhari appoints Abdulahmid as new Envoy to WTO",
    "summarized_story": "President Muhammadu Buhari on Monday approved the appointment of Dr Adamu Abdulahmid as the new Nigeria’s Ambassador to the World Trade Organisation (WTO) Geneva, Switzerland, for a period of four years.\nAdebayo, in a statement by Dr Nasir Sani-Gwarzo, ministry’s Permanent Secretary on Wednesday charged the new Ambassador to cooperate with Director-General of WTO, Dr Ngozi Okonjo-Iweala and members of international organisations to enhance Nigeria’s trade.\nWTO DG Okonjo-Iweala appoints 4 deputies from US, China, othersUntil his appointment, Abdulahmid was the Acting Head/Charge d’ Affaires of Nigeria Trade Office to the WTO, Geneva, Switzerland.\nEconomics and International Development, Masters in Business Management and Leadership, Doctorate of International Relations and Economic Diplomacy.\nHe also had twenty eight years of working experience on World Trade matters and Trade Negotiations."
  },
  {
    "headline": "How Haiti President Moise was killed days after gangs declared revolution",
    "summarized_story": "The news of the murder of the President of Haiti Jovenel Moise shocked countries across the globe, world powers inclusive.\nUnited States President Joe Biden denounced the “heinous act” and assured that America stand ready to work for a safe and secure Haiti.\nBiden reacts to assassination of Haiti President, MoiseWhat should interest many is that the assassination occured days after one of Haiti’s most powerful gang leaders announced the launch of a revolution.\nBarbecue, a former police officer, declared war against business and political elites in Haiti.\nIn the past 18 months, Moise ruled by decree after the legislative elections were delayed."
  },
  {
    "headline": "Biden reacts to assassination of Haiti President, Moise",
    "summarized_story": "The United State President, Joe Biden, has condemned the “heinous’’ assassination of Haitian President, Jovenel Moise and offered Washington’s support to the crisis-torn Caribbean island.\nDAILY POST had reported that unknown gunmen on Tuesday assassinated President Jovenel Moise of Haiti at his private residence.\nA statement by the Country’s interim prime minister, Claude Joseph, said Moise was fatally wounded by the unidentified men.\n“We condemn this heinous act, and I am sending“We are shocked and saddened to hear of the horrific assassination of President Jovenel Moise and the attack on First Lady Martine Moise of Haiti.\nA short while later, in an exchange with reporters, Biden said: “We need a lot more information but it is very worrisome about the state of Haiti.’’"
  },
  {
    "headline": "Court remands two over social media publication against Gen. Abdulsalami in Niger",
    "summarized_story": "Two persons have been remanded in Correctional Center for purportedly publishing injurious statement on social media against former Head of State, General Abdulsalam Alhaji Abubakar by a Federal High Court sitting in Minna.\nThe police prosecutor, Jude Akaeze, during the hearing had presented a four-count charge against the defendants, Abdulkareem Ajibola and Anas Umar.\nAccording to Akaeze, the defendants had contravened Section 24 Sub – Section (1B) saber cafe crime law.\nHe prayed for adjournment to enable him present witnesses to prove allegations against the defendants.\nHowever, the presiding Judge, Justice Emeka Nwite urged the defending counsel to apply for bail and adjourned the case to 26th July, 2021 to commence trail while they should be remanded in correctional centre."
  },
  {
    "headline": "Back to the era of ‘Abacha stove’?",
    "summarized_story": "For us who can remember vividly, the Abacha Stove was usually powered by sawdust, making it the most economical means of cooking our food.\nFaced by this biting challenge, we found a respite in the invention of the Abacha stove.\nBack to the Buhari stove.\nIt wouldn’t be a surprise, if we were ushered into the regime of Buhari stove.\nIn the days of Abacha, we invented Abacha stove; today, we may well be on our way to Buhari stove."
  },
  {
    "headline": "Our founding fathers and current state of affairs of our country",
    "summarized_story": "He was his master’s voice and that master was Ahmadu Bello.\nAhmadu Bello was born into the Usman Ibn Fudih family in Rabeh near Sokoto.\nIn the case of Ahmadu Bello, and within the context of Nigerian politics, he had greatness thrust upon him.\nHis embrace of western education was to influence his bull dog tenacity in seeing his people in Western Nigeria go to free primary and compulsory education as from 1955.\nAhmadu Bello at every critical time of crisis as in 1953 and in 1959 constitutional conference threatened to withdraw the north from the federation."
  },
  {
    "headline": "Kwara APC to sanction minister over outburst against governor",
    "summarized_story": "By Jide Orintunsin, Sanni Onogu, Abuja and Adekunle Jimoh, IlorinThe Kwara State chapter of the ruling All Progressives Congress (APC) has hinted that it will sanction Information and Culture Minister Lai Mohammed for his recent outburst against Governor AbdulRahman AbdulRazaq.\nThe chairman said APC might apply disciplinary measures according to the party’s constitution.\nHe is a minister of the Federal Republic of Nigeria where the APC as a ruling party is running the administration of government.\nWe want to have sanity in the party.”Also, the three senators from the state yesterday expressed their support for Governor AbdulRazaq.\nThe senators – Ibrahim Oloriegbe (Kwara Central), Lola Ashiru (Kwara South) and Umar Sadiq (Kwara North) – told reporters in Abuja that the governor is the authentic leader of the party in the state."
  },
  {
    "headline": "Which NDDC board is to be reconstituted?",
    "summarized_story": "Yet, if one may ask, which board of the commission is supposed to be “constituted” or indeed, “reconstituted” for that matter?\nThere is already a substantive board of the Niger Delta Development Commission, NDDC, indeed one constituted by the president and confirmed by the senate.\nADVERTISEMENTThe legal mechanisms for constituting or reconstituting a board for the NDDC while a substantive board is pending are not available because they simply do not exist in the first place.\nIn short, there is no board to be constituted or reconstituted; rather there is an already constituted, screened and confirmed board waiting to be inaugurated!\nThere is already a substantive board of the commission in-waiting and it should be inaugurated first thing tomorrow morning."
  },
  {
    "headline": "SEDI MD Prof. Ndubuisi assassinated in Enugu",
    "summarized_story": "From Jude Chinedu, EnuguThe Managing Director and Chief Executive Officer of Scientific Equipment and Development Institute (SEDI), Prof. Samuel Ndubuisi was on Wednesday evening shot dead by unknown gunmen.\nProf. Ndubuisi who was shot several times by the yet to be identified gunmen along Enugu Porthacourt highway was with his police orderly who was also shot dead.\nHe was traveling in a PRADO jeep with registration number 26D02FG when he was attacked and killed by the gunmen.\nThe Scientific Equipment Development Institute (SEDI), located in Akwuke in Enugu South Local Government Area, is an institute under the National Agency for Science and Engineering Infrastructure (NASENI).\nPics: The bullet ridden PRADO jeep which Prof Ndubuisi’ PRADO was traveling in when he was assassinated."
  },
  {
    "headline": "Court clears Ex-Finance Minister Adeosun on NYSC discharge certificate case",
    "summarized_story": "From Godwin Tsa, AbujaThe Abuja division of the Federal High Court on Wednesday said that former Minister of Finance Mrs Kemi Adeosun was ineligible for the mandatory one-year National Youth Service (NYSC).\nJustice Taiwo held the constitution does not require the former Minister of Finance to have presented her first-degree certificate or any other certificate, including the NYSC certificate, to be appointed a minister.\nThe court agreed with Chief Wole Olanipekun, SAN, that the ministerial appointment of Adeosun was not illegal, neither was it unconstitutional, even without presenting the NYSC certificate.\nJustice Taiwo further declared that the plaintiff, being a United Kingdom Citizen as of 1989 when she graduated from the University of East London, London, United Kingdom, at the age of 22 years, was ineligible to participate in the National Youth Service Corps Scheme, established by the National Youth Service Corps Act, CAP N84, LFN 2004.\nClient is pleased that, at last, the cause of justice has been served.’It would be recalled that Adeosun resigned as Finance Minister in 2018 on allegations that her NYSC discharge certificate was forged."
  },
  {
    "headline": "BREAKING: Court asked to set aside nomination of Soludo as Anambra APGA candidate",
    "summarized_story": "In the originating summons, a chieftain of the party, Okoye Nwabuogo, is seeking an order of court setting aside the election and nomination of Soludo as the party’s candidate for the November election.\nListed as defendants in the pre-election suit are All Progressive Grand Alliance, Prof Charles Soludo and the Independent National Electoral Commission (INEC).\nWhether the primary election of the 1st Defendant held on 23rd June 2021 for the purpose of electing the 1st Defendant’s candidate for Anambra State gubernatorial general election scheduled to hold on November 6.\n‘That she knows as a matter of fact that the list submitted by the 1st Defendant to the 3rd Defendant has only 812 names as against the 978 delegates.\n‘That her interest as a member of the 1st Defendant will be highly prejudiced except by the urgent intervention of this Honourable Court."
  },
  {
    "headline": "BREAKING: Buhari decorates new COAS with Lieutenant General rank",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has just decorated the Chief of Army Staff, Major-General Farouk Yahaya, with a new rank of Lieutenant General at the Presidential Villa, Abuja.\nIn a short ceremony before the commencement of the Federal Executive Council (FEC), the president assisted by Vice President Yemi Osinbajo and COAS’s wife, Hajiya Salamatu Yahaya, decorated Gen Yahaya.\nAlso in attendance today at church top military brass including the Chief of Defence Staff, General Lucky Irabor, Chief of the Air Staff Air Marshal Isiaka Amao, Chief of Defence Intelligence (CDI) Major General Sunday Adebayo, DG Department of State Service (DSS) Yusuf Bichi, and the Inspector General of Police (IGP), Usman Alkali Baba.\nPrior to his appointment, the new Army Chief served as the Theatre Commander of Operation Hadin Kai, a counter-insurgency operation in the North East.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Haitian president assassinated at home in ‘barbaric act’ – PM",
    "summarized_story": "(Reuters)Haitian President Jovenel Moïse was shot dead by unidentified attackers in his private residence overnight in an “inhuman and barbaric act” and his wife was injured, Interim Prime Minister Claude Joseph said on Wednesday.\nWith Haiti politically divided, and facing a growing humanitarian crisis and shortages of food, there are fears of widespread disorder.\n‘The President was injured and succumbed to those injuries,’ Joseph said in an interview with Radio Caraibes.\nPort-au-Prince had been suffering an increase in violence as gangs battle one another and police for control of the streets.\n‘All measures are being taken to guarantee the continuity of the state and to protect the nation,’ Joseph said."
  },
  {
    "headline": "Insurgents, Bandits Pose Greater Threats Than Separatist Groups, Col. Umar Tells Buhari",
    "summarized_story": "Umar said bandits had abducted over 1,000 school children in the north in the past eight months, adding that over 300 others are still in captivity, with the bandits demanding humongous ransom payments.\nHe said, “The recent rearrest of the IPOB leader, Mazi Nnamdi Kanu, was greeted with a loud sigh of relief and celebration in some sections of the country.\n“This is clearly an exaggeration of the security threat Nnamdi Kanu and indeed IPOB pose to our nation’s security and unity”.\n“They won the 1979 Presidential election and enjoyed an enviable brotherly relationship as President and Vice President.\n“The apparent failure of our security forces to deal decisively, as the President so often commands them to do, with these security threats is obviously due to the acute shortage of manpower and equipment."
  },
  {
    "headline": "Adeosun: Court Judgment Vindicates Me, It’s Victory for Nigerians in Diaspora",
    "summarized_story": "Adeosun had resigned her appointment as Minister of Finance following controversy surrounding her NYSC status as she was accused of not participating in the mandatory one year national service for tertiary institution graduates.\nShe was also accused of presenting a forged NYSC discharged certificate.\nShe however instituted a suit against the Attorney General of the Federation on her eligibility for the National Youth Service Corps Scheme.\nIn a statement sent to THISDAY, the former minister said she was happy with official clarification by the court, adding that the judgment has vindicated her after a traumatic spell.\nIt is, however, not only a personal victory; it’s also a victory for many Nigerians in the Diaspora under similar conditions who are desirous to serve their country."
  },
  {
    "headline": "House Approves Supplementary Budget, Raises Figure by N87bn",
    "summarized_story": "By Udora OrizuThe House of Representatives, on Wednesday passed the supplementary budget submitted last month to both chambers of the National Assembly by President Muhammadu Buhari, raising the sum by N87 billion.\nBuhari had in a letter dated 15th June and addressed to the parliament proposed N895.842,465,917 billion.\nBut the House Committee on Appropriation, in its report presented by the Chairman Hon.\nHe said N123,332,174,164 was for recurrent (non-debt) expenditure, while the sum of N859, 397,521,179 was for contribution to the development fund for capital expenditure for the year ending on the 31st day of December, 2021.\nAccording to him, all amounts appropriated under this supplementary Act shall be released from the Consolidated Revenue Fund of the Federation only for the purpose specified in the Schedule to this Act."
  },
  {
    "headline": "Senate Approves Buhari’s Request For $6.183bn External Loan",
    "summarized_story": "By Deji Elumoye and Juliet AkojeThe upper chamber of the National Assembly has approved President Muhammadu Buhati’s request for the authorisation of $6.183 billion (N2.343trn) as external borrowing in the 2021 Appropriation Act.\nThe external borrowing is expected to be sourced through the Issuance of Eurobond in the International Capital Market.\nPresenting the report, Chairman of the Committee, Senator Clifford Ordia, said in considering the President’s request, the Committee noted the serious concerns of Nigerians about the level of sustainability and servicing of Nigeria’s External Borrowing.\nPresident Buhari had in the letter sought upper chamber’s approval of N2.3trn ($6.18bn) external borrowing to fund the 2021 budget deficit of N5.6trn.\nThe letter came barely a month after the Senate approved the the sum of $1.5bn and €995 million external borrowings for the federal government."
  },
  {
    "headline": "Protest in Ibadan over Raid on Igboho’s Residence",
    "summarized_story": "By Kemi OlaitanFamily members of the loyalists of Chief Sunday Adeyemo (aka Sunday Igboho) arrested during the raid on his residence last Thursday by operatives of the Department of State Service (DSS), Wednesday thronged major streets in Ibadan, demanding for the release of the arrested persons.\nThe Department of State Service (DSS) which confirmed the raid, disclosed that 13 people were arrested.\nBut the family members and relatives of those who were arrested during the protest staged at the Soka, Ibadan residence of Igboho called for the the release of their kinsmen, describing the arrest as illegal.\nThe protesters who were dressed in black attires called on the DSS to release the arrested persons.\nThey similarly moved to Challenge and Molete areas demanding for the immediate release of the arrested persons."
  },
  {
    "headline": "Nigeria Secret Police Arrest Blind Saxophonist For Wearing #BuhariMustGo T-Shirt",
    "summarized_story": "Samuel Gabriel IwatonaiyeA source revealed that “the blind gentleman was arrested for wearing #BuhariMustGo T-shirts.”“He is a saxophonist and was arrested at Dunamis.\nThe church security handed him over to the DSS after manhandling him,” the source added.\nSaharaReporters also learnt on Tuesday that the DSS admitted that the Dunamis church called them to take away the \"suspects.\"\n“Meanwhile, no one has heard from the activists since Sunday when church security attacked them and detained them on the church premises.\nSee Also Breaking News BREAKING: Nigeria's Secret Police Arrest Six Activists At Abuja Dunamis Church For Wearing #BuhariMustGo T-Shirts"
  },
  {
    "headline": "Nigeria Secret Police Arrest Blind Saxophonist For Wearing #BuhariMustGo T-Shirt",
    "summarized_story": "Samuel Gabriel IwatonaiyeA source revealed that “the blind gentleman was arrested for wearing #BuhariMustGo T-shirts.”“He is a saxophonist and was arrested at Dunamis.\nThe church security handed him over to the DSS after manhandling him,” the source added.\nSaharaReporters also learnt on Tuesday that the DSS admitted that the Dunamis church called them to take away the \"suspects.\"\n“Meanwhile, no one has heard from the activists since Sunday when church security attacked them and detained them on the church premises.\nSee Also Breaking News BREAKING: Nigeria's Secret Police Arrest Six Activists At Abuja Dunamis Church For Wearing #BuhariMustGo T-Shirts"
  },
  {
    "headline": "BREAKING: Senate Approves Buhari’s N2.3Trillion Foreign Loan Request, To Push Public Debt To About N35Trillion",
    "summarized_story": "Nigeria’s debt public debt hit a total of N31.01 trillion at the end of June 2020, according to the Debt Management Office.\nNigeria’s total public debt stock as of September 2020, increased by over N6 trillion in just one year to N32.2 trillion.\nTotal domestic debt rose to N20 trillion as of September 2020 compared to N19.6 trillion as of June 2020.\nNigeria now has an estimated combined total public debt (domestic and foreign) of N32.2 trillion.\nThe breakdown shows that external debts accounted for 37.82% (N12.19 trillion) of the total debt stock, while domestic debts at N20.04 trillion represented 62.18% of the total."
  },
  {
    "headline": "BREAKING: Senate Approves Buhari’s N2.3Trillion Foreign Loan Request, To Push Public Debt To About N35Trillion",
    "summarized_story": "Nigeria’s debt public debt hit a total of N31.01 trillion at the end of June 2020, according to the Debt Management Office.\nNigeria’s total public debt stock as of September 2020, increased by over N6 trillion in just one year to N32.2 trillion.\nTotal domestic debt rose to N20 trillion as of September 2020 compared to N19.6 trillion as of June 2020.\nNigeria now has an estimated combined total public debt (domestic and foreign) of N32.2 trillion.\nThe breakdown shows that external debts accounted for 37.82% (N12.19 trillion) of the total debt stock, while domestic debts at N20.04 trillion represented 62.18% of the total."
  },
  {
    "headline": "BREAKING: Senate Approves Buhari’s N2.3Trillion Foreign Loan Request, To Push Public Debt To About N35Trillion",
    "summarized_story": "Nigeria’s debt public debt hit a total of N31.01 trillion at the end of June 2020, according to the Debt Management Office.\nNigeria’s total public debt stock as of September 2020, increased by over N6 trillion in just one year to N32.2 trillion.\nTotal domestic debt rose to N20 trillion as of September 2020 compared to N19.6 trillion as of June 2020.\nNigeria now has an estimated combined total public debt (domestic and foreign) of N32.2 trillion.\nThe breakdown shows that external debts accounted for 37.82% (N12.19 trillion) of the total debt stock, while domestic debts at N20.04 trillion represented 62.18% of the total."
  },
  {
    "headline": "Senate passes bill to upgrade Maritime Academy to university",
    "summarized_story": "The senate has passed a bill to upgrade the Maritime Academy of Nigeria in Oron, Akwa-Ibom state, into a full-fledge university for maritime studies.\nAdvertisementIt also passed a bill to establish the Institute of Information and Communication Technology in Ogoja, Cross River state.\nAdvertisementSandy said upgrading the Academy into a university would help Nigeria in achieving the prerequisites of the International Maritime Organisation (IMO) convention on standard of training, certification and watch-keeping for seafarers.\nAdvertisementHe decried that the country committed resources in search of university degrees, postgraduate research degrees and professionals from all facets of the maritime industry outside Nigeria.\nHe said the upgrade of the Maritime Academy into a university would benefit host communities in the south-south geopolitical zone and the country as a whole."
  },
  {
    "headline": "WATCH: WhatsApp uses Yoruba for campaign on privacy policy",
    "summarized_story": "WhatsApp has come through with an advertisement on its controversial privacy policy using Yoruba, one of Nigeria’s major languages.\nAdvertisementThe less than 30-second advert started with a young Nigerian man abroad who appears to be having issues learning Yoruba despite intense reading.\nAs the video progresses, he started pulling the strings in his quest to learn the language when he decided to learn via WhatsApp voice notes with a tutor.\nAdvertisement View this post on Instagram A post shared by WhatsApp (@whatsapp)The development comes weeks after the company launched its first global advertising campaign amid the backlash trailing its privacy policy.\nThe privacy policy had sparked controversy among some users, who expressed concerns that it allows WhatsApp to share their private messages with its parent company Facebook."
  },
  {
    "headline": "1,326 fail bar exam as Nigerian Law School releases 2021 results",
    "summarized_story": "The Nigerian Law School has released the results of its 2021 final bar examinations with 1,326 candidates (representing 22.98 percent) failing the exercise.\nAdvertisementThe results of the exams, which are a prerequisite for being called to the Nigerian bar, were released on Tuesday.\nA breakdown of the results showed that a total of 5,770 students sat for the exams.\nWhile 20 students representing (0.07%) came out with a first-class, 432 (7.49%) had second class (upper division).\nFurther breakdown of the results showed that 2,172 (37.64%) students had second class (lower division) while 1,725 (29.90%) narrowly escaped with a pass."
  },
  {
    "headline": "OAU inaugurates students’ electoral body ahead of SUG reinstatement",
    "summarized_story": "The management of the Obafemi Awolowo University (OAU) has inaugurated the students’ electoral commission and the students’ electoral petition commission in the institution.\nAdvertisementIsiaka Aransi, the varsity’s dean of students’ affairs, said the move was in fulfillment of the management’s promise to fully reinstate all organs of students unionism in the institution.\nAdvertisementAccording to him, the electoral commission is expected to conduct free, fair, and credible elections while the electoral petition commission is to handle all complaints arising from the election.\nThe move comes as the vice-chancellor also directed the students’ affairs unit to introduce measures aimed at installing vibrant and more articulate students unionism in the institution.\nAdvertisementThe development comes about four years after the institution suspended students unionism over the incessant protests embarked upon at the time."
  },
  {
    "headline": "Mr Macaroni, Broda Shaggi to star in TV adaptation of Femi Adebayo’s ‘Ile Alayo’",
    "summarized_story": "Femi Adebayo, Nollywood actor, has partnered with StarTimes for the television adaptation of ‘Ile Alayo’.\nAdvertisementIn 2013, ‘Ile Alayo’, a comic movie which was written by the seasoned actor, was released to critical acclaim.\nAdebayo said ‘Ile Alayo’ will bring back more than 70 percent of the original cast, and will introduce new characters like Mr Macaroni, Woli Agba, Broda Shaggi and Lateef Adedimeji.\nAdvertisement“Some years ago we produced ‘Ile Alayo’ as a home video, and when we ended it, there have been a great demand for ‘Ile Alayo’ to come back majorly as a series,” he said.\n‘Ile Alayo’ is a comedy flick that I know people will appreciate."
  },
  {
    "headline": "Nigeria’s Daystar Power secures $20 million from IFC",
    "summarized_story": "Daystar Power, a provider of hybrid solar power solutions to businesses in West Africa, has secured a facility of $20 million from the International Finance Corporation (IFC) to fund its project pipeline in Nigeria.\nFounded in 2017 by Sunrah Ventures, Daystar Power is an off-grid power service provider whose solutions, “Solar-as-a-Service” and “Power-as-a-Service” provide clean and reliable power while significantly reducing overall power costs for clients.\nDaystar Power will receive a $10 million local currency loan from IFC, which will be provided to its Nigerian subsidiary, Daybreak Power Solutions.\nDaystar Power is working with the Canadian-funded IFC program, Energy2Equal, to close gender gaps and increase women’s participation in the renewable energy sector.\nDaystar Power has 29 megawatts (MW) of installed solar power capacity to date."
  },
  {
    "headline": "Netflix and chill just got a whole lot cheaper for Africa",
    "summarized_story": "But what happens when the elephants in question are not two, but three of the biggest Subscription Video-On-Demand (SVOD) platforms in Africa!\nNextflix just announced a mobile-only subscription starting at $3.99— that’s more than half the price of its basic subscription plan.\nNetflix also launched a Play Partial Download feature that allows users to play Netflix videos which haven’t downloaded completely.\nNetflix’s streaming tussle in AfricaWhen Netflix arrived in Africa in 2016, everyone anticipated a struggle with reigning SVOD champion, iRokoTV, even though Netflix offered mostly foreign movies and while iRokoTV focused on Nollywood.\nBut not for long…Obviously, with the release of this cheaper plan, Netflix may come out on top in this SVOD race to corner the African market."
  },
  {
    "headline": "From iPhone shortages to price surges: The global chip scarcity is affecting Africa",
    "summarized_story": "Months into the shortage, effects from the ongoing global chip scarcity have spread far and wide, across industries and the globe.\nThe automobile industry is one of the hardest hit by the semiconductor shortage with carmakers across the world forced to slash production.\nIn fact, Taiwan is one of the four countries in Asia behind nearly three-quarters of global semiconductor manufacturing capacity.\nThe global semiconductor scarcity affects a staggering 169 industries in some way, according to Goldman Sachs.\nSo the global chip shortage has naturally led to price increases and there’s not so much local players can do about it."
  },
  {
    "headline": "What telcos and banks look for in fintech partnerships",
    "summarized_story": "Fintech is growing in Africa thanks to strategic partnerships between startups, banks and diverse categories of global companies.\nIn a distribution model, a digital-only bank (say Kuda) partners with traditional banks to offer in-branch deposits, ATM withdrawals and card issuance.\nBut partnerships don’t automatically work just because two parties have good intentions or similar ambitions.\nAs CEO of Sterling Bank, Suleiman receives partnership offers regularly and believes himself open to having many conversations.\nAnd so he wishes to encourage an approach that frames partnerships in terms of capabilities, not institutions."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Daystar Power receives $20 million in funding to boost operations in West Africa",
    "summarized_story": "Today, Nigeria-based hybrid renewable energy provider, Daystar Power, has received a $20 million investment from the International Finance Corporation(IFC), a subsidiary of the World Bank Group.\nThis follows an announcement made by IFC in April 2021 that they were considering giving a $20 million loan to Daystar Power.\nCurrently, Daystar Power provides solar power solutions to businesses in the commercial, industrial, and agricultural sectors and claims to offer a 30 per cent reduction in energy cost.\nThis combines solar power supply and battery storage, and clients can integrate this model into their existing power channels like an electrical grid or diesel/fuel generators.\nFounded in 2017 to reduce the cost of electricity and tackle the issue of epileptic power supply faced by businesses in Africa, Daystar Power has since expanded its operations."
  },
  {
    "headline": "Nigerian fintech, Lidya, raises $8.3m pre-Series B",
    "summarized_story": "Nigerian fintech, Lidya, has announced $8.3 million pre-Series B funding.\nPer TechCrunch, the funding round was led by Alitheia Capital and supported by others, including Bamboo Capital Partners and Accion Venture Lab.\nA year after Lidya launched, a seed fund of $1.5 million was announced followed by a $6.9 million Series A in 2018.\nThe startup also announced that co-founder, Ercin Eksin has left the startup to begin other projects, leaving Kehinde as sole CEO.\nWhile Lidya said its Series A funding in 2018 will be used to enter new African markets, it is only present in Nigeria and has revealed no intentions of expanding with its pre-Series B raise."
  },
  {
    "headline": "Ticketing platform, Tix Africa closes six-figure pre-seed round to scale its products",
    "summarized_story": "Self-service ticketing platform, Tix Africa has closed a six-figure pre-seed round to scale its event apps.\nAdvertisementLaunched in 2019 by Festival Coins and EatDrinkLagos festival creators, Folayemi Agusto and Nosa Oyegun, Tix was created to plug the gap in user data readily available to event organisers.\nFrom running the festival since 2015, they had encountered challenges like accurately collating guest details, payments, and ticketing.\nCurrently, the platform makes it easy for organisers to create and monetise live or virtual events, create customisable event pages, secure payment collection via Paystack.\nInterestingly, Tix claims that its revenue grew 90% year-on-year in H1 2021, especially as it began offering virtual events integrated with Zoom after lockdown measures were eased."
  },
  {
    "headline": "Debt servicing gulps 98% of Nigeria’s 5-month revenue",
    "summarized_story": "The 2021 budget implementation report stated that the Federal Government spent a total of N1.8 trillion on debt servicing in the first five months of the year, representing about 98 percent of the total revenue generated in the same period.\nA look at the data reveals that the total aggregate revenue generated by the government…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Lending to private sector sees double-digit surge on CBN’s drive",
    "summarized_story": "Nigeria’s economy is finding an increasing capital it needs to grow and thrive as new data suggest that total lending to the country’s private sector increased at a double-digit rate year-on-year since August 2019.\nAccording to a report by analysts at FBNQuest, credit to the private sector expanded by 10.2 percent year-on-year in May, to…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "5 years under Buhari Nigeria reverses to 2010 levels",
    "summarized_story": "With crude oil no longer able to paper over the cracks of an economy with deep structural deficiencies, Nigeria’s next set of leaders are increasingly going to face more scrutiny, perhaps even more than current President Muhammadu Buhari has faced for their economic policies against the backdrop of deepening poverty.\nIn 2010, Nigeria had 158…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Edo govt retrains helpline centre operators to boost emergency response – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said it will continue to improve the capacity of call agents in the Edo Helpline Centre with up-to-date skills to boost response to emergencies in the state.\nExecutive Director, Edo State Skills Development Agency (EdoJobs), Ukinebo Dare, in a chat with journalists, said the focus of the agency is to equip the call centre agents with the requisite skills needed to provide Edo residents with efficient and quality service.\n“Our call agents regularly undergo training and retraining, which are geared towards equipping them with the required skills needed to provide Edo residents with optimum service,” she noted.\nAccording to her, the state government recently held computer appreciation training for staff of Edo Helpline Centre to bring them up to speed with updated Microsoft packages for efficient service delivery in emergency response.\nDare further urged residents in the state to take advantage of the Centre by calling any of the Edo Helplines on 08000911911 and 08001235111, for prompt response..."
  },
  {
    "headline": "EDSOGPADEC to commence work on 105.6km Benin-Abraka Road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Oil and Gas Producing Areas Development Commission (EDSOGPADEC) has concluded plans to ensure contractors return to site to continue work on the reconstruction of the 105.6km Benin-Abraka Road.\nThe reconstruction of the project was initiated by the Governor Godwin Obaseki-led administration through a tripartite deal between the state government, EDSOGPADEC and the Niger Delta Development Commission (NDDC).\nPermanent Secretary of EDSOGPADEC, James Ufumwen, confirmed that the commission had, in a recent meeting, reached a decision to commence work on the reconstruction project.\nAccording to him, “We are going to commence the reconstruction project.\nA resident in Aifuwa Street, Benin City, Mrs. Dorothy Asemota, commended the decision of EDSOGPADEC to commence reconstruction work on the road, noting that it would address the hardship faced by people who ply the road from villages on the axis to the city center."
  },
  {
    "headline": "Senate Passes N982bn Supplementary Budget, Increases it By N87bn – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Nigerian Senate on Wednesday, approved the sum of N982.7 billion as Supplementary Appropriation Bill 2021.\nThis is well over N87 billion of the original N895 billion submitted to the Senate by President Muhammadu Buhari for approval.\nThe approval followed the presentation of the report of the Senate Committee on Appropriation headed by Senator Jibrin Barau.\nIn his presentation, Senator Barau explained that N123 billion is for recurrent non-event expenditure while N859 billion is for contribution to the development fund for capital expenditure.\nThe Senate President however directed the relevant committees of the upper legislative chamber to carry out oversight to ensure that the funds are properly utilised."
  },
  {
    "headline": "Screening of political appointees: Committee reviews petitions from 18 Edo LGAs – Nigerian Observer",
    "summarized_story": "Chairman of the committee, Prof. Dennis Agbonlahor, while speaking to journalists in Benin City, reassured that the committee will be fair to all nominees.\nAccording to him, “We are looking at all the petitions from the various local government areas of Edo state.\nWe want to be sure that the leaders from the various local government areas have done justice to the process; there will be no dictatorial tendency.\n“We will look at Special Assistants from each ward; there are three nominees for this position; a female and two males.\nOthers are Osayamwanbor Agbons; Matthew Iduoriyekemwen; Dr. (Mrs.) Bob Osazee; Prof Maureen Isoken Ebomoyi; Prof. Ahmed Uwubamwen; Hillary Otsu and Pastor Osagiede Joseph."
  },
  {
    "headline": "NYSC Scandal: Adeosun speaks on judgment but silent on certificate forgery she committed",
    "summarized_story": "In a statement, the former minister described the judgment as vindicating her “after a very traumatic spell”, although she was silent on the forgery of the NYSC exemption certificate she was caught to have committed to be appointed minister in 2015.\nBut despite the judgement leaving the forgery allegation hanging around her neck, Mrs Adeosun issued a subtle threat to institute a legal action, perhaps against PREMIUM TIMES, whose report exposed the forgery scandal in 2018.\nRevelationsA PREMIUM TIMES investigative report had exposed how she skipped the scheme and went on to forge a certificate purporting that she was granted an exemption by the NYSC.\nShe was forced to resign following PREMIUM TIMES’ revelation in 2018.\nShe admitted in her resignation letter to the President that she realised that the NYSC certificate she presented was “not genuine” after the PREMIUM TIMES report."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Boko Haram, Bandits Worse than IPOB, Yoruba nation separatists – Col. Umar Tells Buhari",
    "summarized_story": "Umar pointed out that the case of agitation in the Southeast is understandable and boils down to injustice, which he accused the Buhari government of perpetuating.\n“The recent rearrest of the IPOB leader, Mazi Nnamdi Kanu, was greeted with a loud sigh of relief and celebration in some sections of the country,” he said.\n“This is clearly an exaggeration of the security threat Nnamdi Kanu and indeed IPOB pose to our nation’s security and unity.\n“Government’s earlier claim of having technically defeated the Boko Haram insurgency in the North east has turned out to be empty propaganda”, he said.\n“They won the 1979 Presidential election and enjoyed an enviable brotherly relationship as President and Vice President."
  },
  {
    "headline": "‘I’ve been vindicated,’ Adeosun reacts to court judgement on NYSC saga",
    "summarized_story": "Nigeria’s former Minister of Finance, Mrs. Kemi Adeosun, has reacted to a ruling of an Abuja court on Wednesday to the effect that she was not required to do national service, noting that she has been vindicated.\nAdeosun was in 2018 forced to resign her position as minister following controversy over her alleged forging of NYSC certificate.\nBut on Wednesday, a Federal High Court in Abuja ruled that she was not eligible to do national service since she was technically not a Nigerian citizen when she graduated from a University in England.\n“The court, presided over by Honourable Justice Taiwo Taiwo, ruled that the constitution does not require me to present my first-degree certificate or any other certificate, including the NYSC certificate, to be appointed a Minister.\n“More importantly, he also ruled that I was not eligible to perform NYSC by virtue of the constitution."
  },
  {
    "headline": "Prof Sam Ndubuisi, SEDI MD, ex Dean Faculty of Engineering, ESUT Murdered",
    "summarized_story": "Prof Sam Ndubuisi, Managing Director/Chief Executive Officer of the Scientific Equipment Development Initiative (SEDI) has been assassinated by gunmen.\nNdubuisi, former Dean of Faculty of Engineering at Enugu State University of Science and Technology (ESUT), Enugu State, has been reportedly assassinated in Enugu State, shot dead along the Enugu Port-Harcourt Expressway, very close to the centenary city on Wednesday.\nHis killing comes barely three days after the Chief Executive Officer of AutoEase company, Ifeanyi Okeke, was murdered in the presence of his 7-year-old son along brick estate.\nNdubuisi was shot alongside his police orderly by yet to be identified gunmen in his official vehicle marked “SEDI 26D 02FG”.\nFurther development will be duly communicated, please.”Scientific Equipment Development Institute (SEDI), Enugu is an institute under the National Agency for Science and Engineering Infrastructure (NASENI)."
  },
  {
    "headline": "You’re an empty barrel, Malami attacks Canadian Minister Over Kanu’s Abduction",
    "summarized_story": "Madu had criticised Malami over Kanu’s controversial arrest, calling him a disgrace to the rule of law, and not worthy to be an officer of the court.\nHowever, in a rejoinder on Wednesday, Malami called the Canadian state official ignoramus and eccentric, adding that his views are weird to the legal profession.\nIt is a common principle of the law that he who comes to equity must come with clean hands,” Malami said.\n“Where was the so-called Madu when Nnamdi Kanu was inciting violence against the country?\nWhy, as a lawyer, would Madu support a fugitive who jumped bail and accused of terrorism and treasonable felony?"
  },
  {
    "headline": "SEDI DG, Samuel Ndubisi, assassinated in Enugu",
    "summarized_story": "The Director General, Science and Equipment Development Institute, Prof. Samuel Ndubisi, has been assassinated in Enugu by unidentified gunmen.\nThis is coming barely 48 hours after the Managing Director and Chief Executive Officer of AutoEase Service Limited, Ifeanyi Okeke was also assassinated by yet-to-be-identified gunmen in the presence of his eight-year-old son.\nThe PUNCH gathered that the SEDI DG was shot dead along with his police orderly on the Port- Harcourt Express Road Enugu around 4 pm while he was reportedly going home.\nThe driver of the vehicle reportedly sustained injuries and had been taken to an undisclosed hospital for medical attention.\nWhen contacted, the Police Public Relations Officer, Enugu State Command, Mr Daniel Ndukwe confirmed the incident."
  },
  {
    "headline": "SEDI DG, Samuel Ndubisi, assassinated in Enugu",
    "summarized_story": "The Director General, Science and Equipment Development Institute, Prof. Samuel Ndubisi, has been assassinated in Enugu by unidentified gunmen.\nThis is coming barely 48 hours after the Managing Director and Chief Executive Officer of AutoEase Service Limited, Ifeanyi Okeke was also assassinated by yet-to-be-identified gunmen in the presence of his eight-year-old son.\nThe PUNCH gathered that the SEDI DG was shot dead along with his police orderly on the Port- Harcourt Express Road Enugu around 4 pm while he was reportedly going home.\nThe driver of the vehicle reportedly sustained injuries and had been taken to an undisclosed hospital for medical attention.\nWhen contacted, the Police Public Relations Officer, Enugu State Command, Mr Daniel Ndukwe confirmed the incident."
  },
  {
    "headline": "Buhari mourns foremost hydro-geologist, Depo Adenle",
    "summarized_story": "By GBENGA ADEOLAPresident Muhammadu Buhari pays tribute to an illustrious Nigerian that helped formulate a Water Policy for the country, Dr Depo Adenle, who passed on at 79.\nThe President condoles with renowned journalist and widow of the deceased, Mrs Tola Adenle, as well as the entire family, praying for the repose of the soul of the scion of a former Ataoja of Osogbo, Oba Samuel Adenle.\nPresident Buhari equally salutes the fidelity of the departed to the family, which saw him married to Tola for 51 years.\nHe prays God to grant his soul rest, and comfort all those who mourn him.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Buhari mourns foremost hydro-geologist, Depo Adenle",
    "summarized_story": "By GBENGA ADEOLAPresident Muhammadu Buhari pays tribute to an illustrious Nigerian that helped formulate a Water Policy for the country, Dr Depo Adenle, who passed on at 79.\nThe President condoles with renowned journalist and widow of the deceased, Mrs Tola Adenle, as well as the entire family, praying for the repose of the soul of the scion of a former Ataoja of Osogbo, Oba Samuel Adenle.\nPresident Buhari equally salutes the fidelity of the departed to the family, which saw him married to Tola for 51 years.\nHe prays God to grant his soul rest, and comfort all those who mourn him.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Faces of Indianapolis shooter Brandon Scott Hole",
    "summarized_story": "By AbankulaPolice authorities in Indianapolis on Friday released the photo of Brandon Scott Hole, the 19-year-old former FedEx worker, who killed eight people Thursday night.\nThe release of his photo corrected false images of the shooter earlier published in the social media.\nHole went on a shooting spree at the FedEx facility before turning the gun on himself.\nAccording to reports, he last worked for FedEx in 2020.\nCops still don’t know his motive and where he got the rifle he used."
  },
  {
    "headline": "Breaking: Gunmen kidnap Ekiti monarch David Oyewumi",
    "summarized_story": "By Ariwodola Idowu/Ado EkitiAn Ekiti monarch, Oba David Oyewumi, the Obadu of Ilemeso in Oye Local Government Area (LGA) of the state, has been kidnapped by gunmen, the police said.\n“Yes, the incident happened yesterday, (Thursday night) at the Oba’s palace.\nThey said the incident happened at about 8.30 p.m. on Thursday night when the chiefs who visited the place had left.\nIlemeso is a neighbouring town to Isan Ekiti, country home of Gov.\nOba Adetutu Ajayi, the Elewu of Ewu Ekiti, narrowly escaped kidnap at Isan Ekiti, last week on the Ewu-Ayetoro road."
  },
  {
    "headline": "Oyetola Inaugurates Independent Monitors Of Beneficiaries Of National Social Investment Programmes In Osun",
    "summarized_story": "…Says govt irrevocably committed to citizens’ needsGovernor of the State of Osun, Adegboyega Oyetola, on Wednesday, inaugurated independent monitors of National Social Investment Programmes in the State.\n“You may recall that we flagged of the training of 5000 Independent Monitors for the National Social Investment Programme in Abuja on Thursday 4th February 2021.\n“Today we are here to distribute Engagement Letters and Devices to the Trained Independent Monitors.\nThese Devices are equipped with an Application that will be used to report on monitoring activities of the trained Independent Monitors,” she added.\nThese people are selected across the State to monitor the four cardinal social intervention programmes under the National Social Investment Programmes."
  },
  {
    "headline": "BREAKING: Unknown Gunmen Assassinate SEDI MD, Prof. Simon Ndubuisi",
    "summarized_story": "Prof. Simon Ndubuisi, the Managing Director/Chief Executive Officer of the Scientific Equipment Development Initiative, SEDI, Enugu State, has reportedly been killed.\nThe Federal Government Agency Director was assassinated by unknown gunmen on the Enugu Port-Harcourt Expressway on Wednesday, according to NEWS DIRECT.\nHe was being driven in his official vehicle, which was labeled “SEDI 26D 02FG.”The gunmen also killed his police orderly.\nHowever, as of the time of reporting this story, the Enugu State Police Department had yet to confirm the event.\nThe Enugu-based Scientific Equipment Development Institute (SEDI) is part of the National Agency for Science and Engineering Infrastructure (NASEI) (NASENI)."
  },
  {
    "headline": "I Was Mercilessly Beaten, Abused, Tortured In Kenya — Nnamdi Kanu Tells Lawyer, Ejiofor",
    "summarized_story": "Nnamdi Kanu, the incarcerated leader of the Indigenous People of Biafra, spoke with his lawyer, Ifeanyi Ejiofor, about his experience in Kenya, alleging he was “mercilessly abused and tortured” there before being extradited to Nigeria.\nIn an interview with Arise Television, which was watched by SaharaReporters, the IPOB leader’s lawyer, Ejiofor, confirmed this, saying that the Kenyan authorities would be sent to the International Criminal Court to answer for the cruelty.\n“But by the time we finish with them at the International Criminal Court, they will never remain the same.\n“Kanu was tortured, maltreated and mercilessly beaten, as confirmed by him to us.\nWe are going to address an international court at that level.”"
  },
  {
    "headline": "Former US President, Trump Sues Twitter, Facebook, Google And Their CEOs",
    "summarized_story": "Former US President Donald Trump has said that he will file class-action lawsuits against Mark Zuckerberg, Jack Dorsey, and Sundar Pichai, the CEOs of Facebook, Twitter, and Google, respectively.\n“I’m filing as the lead class representative a major class-action lawsuit against the big tech giants, including Facebook, Google, and Twitter as well as their executives,” Trump said.\nThe epidemic, social instability, and the 2020 presidential election have increased public pressure on social media platforms to tighten their content policing.\nThings got even worse when he was suspended by Twitter and Facebook for his role in the January 6 violence.\nOn Sunday, the day the program officially began, many of its users, mostly Trump supporters, were hacked."
  },
  {
    "headline": "Breaking: England conquer Denmark, set up Euro 2020 final clash vs Italy",
    "summarized_story": "Italy versus England in Sunday’s Euro 2020 final after the former beat resilient Denmark during the semifinal clash.\nWith this feat, England arrive the first ever men’s Euro final and their first tournament final since winning the FIFA World Cup in 1966.\nDetails loading…"
  },
  {
    "headline": "Senate okays N2.343trn external loan, warns MDAs on frivolous spending, passes N982bn supplementary budget",
    "summarized_story": "The sum is expected to be sourced through the Issuance of Eurobond in the International Capital Market.\nIt also approved that the amount authorised may be raised from multiple sources such as the International Capital Market and any other Multilateral or Bilateral sources as may be available.\nHe, however, tasked committees of the National Assembly to carry out strict oversight on how the loans were applied to the implementation of the 2021 budget.\nPolice formations and Commands were allocated N22.586billion, Defence Space Administration N43.326billion, Office of the National Security Adviser N17billion and Department of State Services N17billion.\n“This is a very necessary intervention by the National Assembly, particularly this Senate and, indeed, the administration in the country that this is necessary for us to do."
  },
  {
    "headline": "Breaking: Top government official assasinated in Enugu (PICTURES)",
    "summarized_story": "The Managing Director and Chief Executive Officer of the Scientific Equipment Development Institute (SEDI), Enugu, Prof Samuel Ndubisi, was on Wednesday assassinated along Enugu-Portharcourt road.\nA Facebook user shared pictures of the ugly incident which happened on Wednesday afternoon at centenary City junction before Amaechi flyover.\nAs at the time of filling this report, no official statement government has been made public.\nDetails loading…"
  },
  {
    "headline": "GOC 7 Division commends troops’ fighting spirit, resilience, gallantry -NigPilot",
    "summarized_story": "Gen Eyitayo lauded the troops during a maiden operational tour of 24 Task Force Brigades, Dikwa, and Special Intervention Battalion IV, as well as Mobile Strike Team 16 collocated in New Marte.\nHe commended troops’ high level of alertness and undampened fighting spirit in recent encounters with elements of Boko Haram terrorists (BHTs) and Islamic State West Africa Province (ISWAP).\nThe GOC urged the troops to sustain the momentum and ensure that remnant of the terrorists is completely neutralized.\nGeneral Eyitayo told the troops, that his visit was necessitated by the need to evaluate and address security and operational challenges, as well as issues bordering on the welfare of the troops.\nDuring the visit, the GOC inspected a large cache of arms, ammunition, and Gun trucks captured from neutralized terrorists."
  },
  {
    "headline": "MHWUN passes vote of confidence on HRM Biobelemoye -NigPilot",
    "summarized_story": "Josiah challenged staff not to hoard any information from the incoming acting Secretary-General, to enable him quickly understand the workings of his new office.\nThe Royal Father also reminded the administrative staff to render the same support extended to Late Silas Adamu to the new Acting Secretary-General, to perform his duties optimally.\nHe recalled the relentless commitment of the Late MHWU Secretary-General, Silas Adamu, and charged the new Acting Secretary-General to ensure bureaucracy is seemless in memory of his predecessor.\nAuwolu Kiawa’s Appointment, Follows the Sudden Demise of MHWUN Secretary-General, Mr. Silas Adamu, in a ghastly autocrash along Abuja- Kaduna Expressway, on 8th of March 2021.\nLate silas Adamu who died along with his wife and daughter has since been buried."
  },
  {
    "headline": "Lock-up Capital in Land breeds huge economic loss – SGoF -NigPilot",
    "summarized_story": "The Surveyor General of the Federation (SGoF), Surv Samuel Adeniran Taiwo said that Nigeria has suffered huge economic loss because of lock-up capital in land resulting from ineffective land administration, improper land use, and property management.\nHe noted that the theme of the conference, “Unlocking Real Estate Potentials for Economic Development” was timely and inspiring.\nHe added that there was no gainsaying the fact that land remained a major resource of any type of physical development, impacting heavily on national economic architecture.\nHe reiterated that land remained a major factor of production and “it is key for all purposes of socioeconomic development”.\nHead of Press and Public Relations, Office of the Surveyor General of the Federation Abu, Michael in a statement said that Surv."
  },
  {
    "headline": "Nigeria trade relation with Qatar is very low – Nigerian Envoy",
    "summarized_story": "The Ambassador Extraordinary and Plenipotentiary of the Federal Republic of Nigeria to the State of Qatar, Ambassador Yakubu Abdullahi has said that Nigeria’s trade relation with Qatar is very low.\nAmbassador Abdullahi said this while presenting his Letters of Credence to the Emir of the State of Qatar, His Highness Sheikh Tamim bin Hamad Al-Thani.\nAmbassador Ahmed expressed gratitude to President Muhammadu Buhari for finding him worthy of appointment as his Principal Envoy to the State of Qatar.\nThe Emir of Qatar in his response assured the Nigerian Envoy of his support to succeed in the discharge of his mandates.\nThe credential’s presentation ceremony was preceded by the inspection of the Guard of Honour by the Nigerian Ambassador, who until his appointment as Ambassador to the State of Qatar was the Director of Protocol, State House."
  },
  {
    "headline": "Senate Approves Buhari’s $6.1bn Foreign Loan Request",
    "summarized_story": "The Senate has approved the Federal Government’s request for a $6.1 billion (N2.343 trillion) loan request.\nThe Senate gave the approval on Wednesday after it considered a report from its Committee on Local and Foreign Debt which it earlier directed to work on the loan request.\nREAD ALSO: Senate Passes N895.842bn Supplementary BudgetPresident Muhammadu Buhari had earlier in May asked the National Assembly to approve the loan request, saying it would be raised from multilateral and bilateral tenders as well as the international capital market.\nThe Committee recommended that the Senate approves Buhari’s request for the issuance of $3,000,000,000 but not more than $6,183,081,643.40 Eurobond in the International Capital Market.\nThe Committee also recommended that the Senate should approve that the amount authorised may be raised from multiple sources such as the International Capital Market and any other Multilateral or Bilateral sources as may be available."
  },
  {
    "headline": "NYSC Certificate Controversy: Court Ruling Has Vindicated Me – Adeosun",
    "summarized_story": "Former Minister of Finance, Kemi Adeosun, has reacted to the court’s ruling on the case involving her participation in the National Youth Service Corps (NYSC).\nIn a statement issued on Wednesday, Adeosun said the ruling vindicates her after what she described as a very traumatic spell.\n“More importantly, he also ruled that I was not eligible to perform NYSC by virtue of the constitution.\nBarely three years after she assumed office, Adeosun resigned in 2018 after she was accused of forging an NYSC certificate.\nRead Also: Adeosun Did Not Require NYSC Certificate For Political Appointment, Court RulesThe decision, according to her at the time, was the honourable thing to do as investigations into the allegation had commenced."
  },
  {
    "headline": "Haiti President Jovenel Moise Assassinated – Interim PM",
    "summarized_story": "Haiti President Jovenel Moise was assassinated at his home early Wednesday morning by a group of armed individuals, interim Prime Minister Claude Joseph announced.\n“The president was assassinated at his home by foreigners who spoke English and Spanish,” Joseph said.\nMoise had been ruling Haiti, the poorest country in the Americas, by decree, after legislative elections due in 2018 were delayed in the wake of disputes, including on when his own term ends.\nThe president faced steep opposition from swathes of the population that deemed his mandate illegitimate, and he churned through a series of seven prime ministers in four year.\nMoise had been accused of inaction in the face of the multiple crises, and faces steep opposition from swaths of the population."
  },
  {
    "headline": "24 Killed As Boko Haram Fighters Raid Communities In Adamawa",
    "summarized_story": "At least 24 persons have been killed by gunmen suspected to be Boko Haram Terrorists in Dabna a farming community three kilometres away from Graha the hometown of the Secretary to the Federal Government, Boss Mustapha.\nREAD ALSO: Buhari, Osinbajo Decorate Farouk Yahaya As Chief Of Army StaffWitnesses say residents scampered into the nearby bushes for safety even as the gunmen proceeded to invade a neighbouring community.\nAs of noon today, sources say the Boko Haram fighters were still operating within the area.\nSources within the military say a joint security task force comprising of the Army, Airforce, and the Police, have been drafted to the embattled communities.\nFearing that the marauders will get to their community, many residents in Graha have started fleeing their homes for safe havens in villages nearby."
  },
  {
    "headline": "South Africa’s President, Zuma Surrenders To Authorities",
    "summarized_story": "South Africa’s ex-president Jacob Zuma handed himself in to police late Wednesday to begin serving a 15-month sentence for contempt of court, his foundation said.\n“Please be advised that President Zuma has decided to comply with the incarceration order.\nHe is on his way to hand himself into a Correctional Services Facility in KZN” (Kwazulu-Natal province), the foundation tweeted.\nIn a historic ruling, the Constitutional Court last week handed Zuma a 15-month term for snubbing anti-graft investigators.\nZuma had mounted a last-ditch legal defence and refused to turn himself in by Sunday night as the court ordered."
  },
  {
    "headline": "Haiti President, Jovenal Moise, assassinated in Country’s capital",
    "summarized_story": "Haitian President Jovenel Moïse has been assassinated in an attack on his home, according to a statement from the country’s interim prime minister, who called the killing a “hateful, inhumane and barbaric act”.\nA group of unidentified individuals attacked Moïse’s private residence overnight on Wednesday and shot him dead, interim Premier Claude Joseph said.\n“The country’s security situation is under the control of the National Police of Haiti and the Armed Forces of Haiti,” Joseph said in a statement from his office.\nAdvertisementThe Dominican Republic said it was closing the border it shares with Haiti on the island of Hispaniola.\nThese troubles come as Haiti still tries to recover from the devastating 2010 earthquake and Hurricane Matthew that struck in 2016."
  },
  {
    "headline": "Police embark on a show of Force , intensify patrols",
    "summarized_story": "The Lagos State Police Command has embarked on Show of Force to send a signal to cultists, especially Black Axe members, to steer clear of the state, and to assure the good people of Lagos State of adequate security.\nThe Show of force is in furtherance of its proactive measures to forestall any possible breakdown of law and order in Lagos State by members of Aiye Confraternity aka Black Axe as the group intends to mark its annual 7/7 Celebration ( Boogie-Night) in many states of Nigeria and beyond, with no exception to Lagos State,The State Police Command had earlier on Wednesday, 7th July, 2021,warned members of the Black Axe to desist from having the Celebration to commemorate their annual 7/7 in any part of the state as the police and other security agencies have put measures in place to resist such Celebration today 7th July, 2021 or at any time in the state.\nThe Commissioner of Police, Lagos State, CP Hakeem Odumosu, has therefore re-echoed his order to officers and men of the command to intensify efforts in resisting and curtailing any act of lawlessness, oppression and intimidation from any group of individuals who might want to engage in any unlawful gathering or Celebration of whatever kind.\nCP Hakeem Odumosu also charged intelligence and tactical units of the command to beam their search light on the identified areas that are vulnerable to attacks and reprisal attacks by any cult group in the state."
  },
  {
    "headline": "Gunmen kill DG of Science Equipment Development Institute in Enugu",
    "summarized_story": "Unknown Gunmen have killed the Director General of the Science and Equipment Development Institute (SEDI), Enugu, Prof. Samuel Ndubisi.\nThe Professor was said to have been killed along the Port- Harcourt Express Road Enugu with his police orderly.\nHis driver, who sustained gunshot injuries, had been taken to a hospital, where doctors are battling to save his life.\nIt was not clear why the DG was killed as nothing was removed from the vehicle or its occupants.\nEnugu State Police command spokesman, Daniel Ndukwe, who confirmed the incident said information surrounding Ndubuisi’s killing was still sketchy."
  },
  {
    "headline": "Zambia’s Founding Hero Kaunda Buried After Court Rejects Family’s Appeal",
    "summarized_story": "Kenneth Kaunda, Zambia’s founding president has been laid to rest at a memorial site for former presidents after the High Court rejected an application from one of his sons contesting where he should be buried.\nA hero in the struggle for southern Africa’s liberation from colonialism, Kaunda was accorded full military honours in a funeral that brought together rival political parties and dignitaries from the region.\nHis wreath-laden casket was lowered into the grave to a gun salute, a fly-past and then a bugle call.\nWhile Kaunda is recognised for building a peaceful nation, in death his own family was divided over his final resting place.\nAccording to them, he had wanted to be buried not among former presidents but at his farm next to his wife."
  },
  {
    "headline": "Nigeria: Yoruba Nation Protesters Hit Ibadan Over Raid of Activist Sunday Igboho’s House",
    "summarized_story": "Reports suggest that the demonstrators had gathered in front of Igboho’s house from where they took to the streets around midday on Wednesday.\nChants such as “no retreat, no surrender!”, “Oodua Nation!”, “Sunday Igboho is not a criminal!” amongst other phrases were heard from the protesters.\n“The government must pay the N500 million damages as requested by Igboho’s lawyer for the destruction of his house and property during the invasion.\n“We want the Obas to make this happen within seven days.”The DSS had raided Igboho’s residence as reported by ARISE News around 1am on Thursday.\nWhile Igboho had escaped the raid, the DSS operatives riddled his house and cars with bullets while bloodstains splattered over the floors of the house."
  },
  {
    "headline": "Boko Haram Kill Over 18 Persons in Northeast Nigeria’s Adamawa State",
    "summarized_story": "Members of the suspected Boko Haram terrorists have been reported to allegedly resumed attacks on communities, killed over 18 persons while many others injured in Hong Local Government Areas (LGA) of Adamawa state .\nIt further revealed that the terrorists first stormed Dabna village near Gahara the village of the Secretary to the Government of the Federation (SGF) Mr Boss Mustapha to other communities.\nThe source said the terrorists continue their attacks to Kwapre village and other Hamlets , in Hong LGA.\nAbout now, many of our fellow villagers have been trapped and I fear they may have been killed”.\nAnother source said, about 18 human corpses were found in Kwapre, Dabna villages near Garaha SGF Boss Mustapha’s village."
  },
  {
    "headline": "Giant Ever Given Container Ship Sets Sail After Deal Signed",
    "summarized_story": "Ever Given, the giant container ship that blocked the Suez Canal for six days in March is finally resuming its voyage after the ship’s owners and insurers clinched a compensation deal with the canal authority.\nThe ship has been impounded for three months near the canal city of Ismailia.\nThe 193km (120-mile) Suez Canal connects the Mediterranean Sea at the canal’s northern end to the Red Sea in the south and provides the shortest sea link between Asia and Europe.\nBut the vital waterway was blocked when the 400m-long (1,312ft) Ever Given became wedged across it after running aground amid high winds.\nThe container ship was refloated following a six-day salvage operation that involved a flotilla of tug boats and dredging vessels."
  },
  {
    "headline": "Nigerian Lawmakers Ratify $6.183 Billion External Borrowing Plan",
    "summarized_story": "The Nigerian Senate has approved a foreign borrowing plan by the country’s President Muhammadu Buhari of 2.343 trillion Naira, some 6.183 billion U.S. dollars to enable the federal government fund the deficit component of the 2021 national budget.\nAccording to Senator Ordia, “it is not a new borrowing” as the deficit is captured in the 2021 Appropriations Act.\nIn April, the Senate had approved a plan by President Buhari to borrow $2.7 billion from external sources to fund critical projects across Africa’s largest economy.\nThe loans were sourced from the World Bank, Export-Import Bank of Brazil and Deutsche Bank of Germany, according to the lawmakers.\nIn 2020, President Buhari asked lawmakers for permission to obtain $5.5 billion in external funding to help finance budget deficits."
  }
]