[
  {
    "headline": "FG spends N58bn on Household Uplifting Programme in two months — Agency",
    "summarized_story": "The National Coordinator of the Household Uplifting Programme, Halima Shehu, says the Federal Government has paid N58bn to two million households benefitting from N10,000 bi-monthly conditional cash transfer programme across the country.\nShehu said an additional 23,134 poor and vulnerable citizens of Adamawa state were enrolled on Thursday to benefit from the Conditional Cash Transfer programme.\nOur lives are at risk that is why we are soliciting for state governments to give us security.\n“It is a job with people with faith because it is not easy to handle cash and deliver it.\nIn the last two months, across the nation, the Federal Government of Nigeria has disbursed over N58bn for household Uplifting programme.”Copyright PUNCH."
  },
  {
    "headline": "Regional autonomy, best political solution on Kanu, Igboho –Gani Adams",
    "summarized_story": "The Aareonakakanfo of Yorubaland, Gani Adams, says autonomy for federating units in Nigeria is the best political solution to resolve the various secessionist groups and arrowheads in the country.\nGrowing dissatisfaction, disaffection, and perceived injustice have fueled secessionist agitations in Southern Nigeria of late.\n“In the South-East, the people already have the mindset that they are being shortchanged and marginalised in the political system.\n“And for Igboho, I haven’t seen the offence Igboho committed than warranted criminal charges.\nHe said, “The government should not only resolve the issue of Igboho and Kanu but to listen to the cries of the people."
  },
  {
    "headline": "Zamfara NSCDC tasks PGCs on synergy with other security agencies",
    "summarized_story": "The Zamfara State Command of the Nigeria Security and Civil Defence Corps (NSCDC), Commandant A A Sparks, has charged private guard companies to collaborate effectively with other security agencies in the area of intelligence gathering to stamp out crime in the state.\nThe passing out parade ceremony was witnessed by the state Chairman of Private Guard Companies Alh.\nLawal Abdullahi Makama, representatives of the participating Private Guard Companies and officers and men of the corps.\nResponding, the Chairman of PGC in Zamfara State who is also the Managing Director of Delaw Security Guards, Makama thanked the State Commandant and the management of NSCDC for the opportunity given to them to participate in the training.\nHe reiterated the commitment of PGCs in combatting crime in the state also promising to synergize with the corps in the area of intelligence gathering."
  },
  {
    "headline": "Herdsmen give FG condition to end open grazing",
    "summarized_story": "Fulani herdsmen under the umbrella of the Miyetti Allah Kautal Hore have given conditions to be met in order to end open grazing in Nigeria.\nHerdsmen said they are willing to quit open grazing if the Nigerian government would make finance and logistics available for them to create alternatives.\nThe herdsmen noted that they can’t suddenly quit the age-long practice because there is no alternative way yet to feed their cattle.\nAjayi added there was a need to re-orientate and change the mindset and perceptions of the Fulani herders so as to end outdated practices of open grazing.\nThe herdsmen vowed to leave the farmlands as soon as ranches that are being proposed by some government officials, particularly southern state governors, are provided."
  },
  {
    "headline": "IPMAN addresses fears of fuel scarcity",
    "summarized_story": "The Independent Petroleum Marketers Association of Nigeria (IPMAN) has assured Nigerians of the availability of petroleum products, allaying fears of possible scarcity in some parts of the country.\n“Now that the authority has allayed fears that the government will pay marketers for bridging, pending full deregulation, normal operations will resume,” Okoronkwo said.\nHe added that it was also decided at the meeting that those areas that do not require bridging should no longer be included in the payments.\n“That was the outcome of the meeting and we all agreed to the resolutions to ensure smooth distribution of petroleum products ahead of the yuletide,” he said.\nMotorists blame marketers as fuel scarcity hits Taraba"
  },
  {
    "headline": "Buhari’s administrative style horrible, reason I oppose him – Dele Momodu",
    "summarized_story": "Dele Momodu, a 2011 presidential candidate and veteran journalist, on Friday, revealed why he opposes President Muhammadu Buhari.\nMomodu disclosed that Buhari’s administrative style is horrible; hence his opposition.\nIn a post on his Facebook, the veteran journalist accused Buhari of taking Nigeria back to the stone age.\nStressing that the president is likeable in person, Momodu, noted that Nigeria is more divided under his administration.\nHe is likable when you meet him but his administrative style is horrible."
  },
  {
    "headline": "Obono-Obla wants age requirement for president, senators, governors reduced",
    "summarized_story": "A former senior special assistant to President Muhammadu Buhari on prosecution, Chief Okoi Obono-Obla, has called for the constitutional amendment to include a reduction in the age of presidential aspirants to 30 or 35 while governors and senators could be in their 20s and 30s.\nHe said, “There should be an amendment of the constitution reducing the age requirement for president and vice to 35 instead of 40.\nTherefore, he advocated that age impediment to young people becoming presidents, vice presidents, governors, deputy governors, etc be abolished.\nHe said when he becomes a senator in 2023, he will sponsor a bill to reduce the age for key offices.\nRelease Nnamdi Kanu in 21 days or you’re dead – Armed group to Southeast Govs, Senators [VIDEO]"
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "JUST IN: Soludo, running mate get Certificates of Return",
    "summarized_story": "JUST IN: Soludo, running mate get Certificates of ReturnAnambra Governor-elect Prof Chukwuma Soludo has been issued Certificate of Return by the Independent National Electoral Commission (INEC).\nThe event took place at the Commission’s head office in Awka, Anambra StateHis running mate, Dr Onyekachi Ibezim, also received his certificate.\nRead Also: PHOTOS: Anambra Gov-elect Soludo gets Certificate of ReturnThey were presented to them by the National Commissioner- in-charge of voter Education, Festus Okoye.\n- Advertisement -Okoye represented the National Chairman of the Commission, Prof Yakubu Mahood.\nSoludo won the election on the platform of the All Progressives Grand Alliance (APGA) where he scored 112,229 votes."
  },
  {
    "headline": "PHOTOS: Anambra Gov-elect Soludo gets Certificate of Return",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "Police mute over death of Vanguard reporter",
    "summarized_story": "Vanguard reporter, Tordue Henry Salem, who has been missing over a month, was found dead in Abuja on Thursday.\nDetails of the circumstances surrounding the discovery of his remains were still sketchy.\nThe Force Public Relations Officer, CP Frank Mba when contacted refused to speak on the developmentRead Also: Missing Vanguard reporter: IPC seeks probeMba told The Nation: “I can’t say anything on the matter”.\n- Advertisement -Late Salem, who was covering the House of Representatives, was last seen on October 13, 2021.\nAfter the close of work that day, he was said to have alighted from a cab at Total filling station close to the Force headquarters and headed for B.J’s Garden, in the company of a female relative."
  },
  {
    "headline": "Justice Odili: Police arrest ‘CSP’, journalist, Islamic scholar, 11 others over invasion",
    "summarized_story": "He described those arrested as document forgers who were on their own and not hired by any personnel of the Federal Ministry of Justice.\nThe men were said to have been led by Ajodo, who admitted that he was engaged as a consultant by the Attorney-General of the Federation and Minister of Justice, Abubakar Malami.\nMalami noted that investigation has commenced to unravel the circumstances, personalities behind the invasion and the sponsored campaign of calumny against him.\nWhich worked has he executed for the Honourable Attorney General of the Federation and the Ministry of Justice?\nJustice Odili.”100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "Afenifere tackles Buhari, insists Nigeria’s structures must be renegotiated",
    "summarized_story": "It said Islamic cleric, Ahmed Gumi, who has been canvassing amnesty for the bandits is only re-echoing the same views held by Buhari before he became president.\nThe group said this in Lagos at a press conference with the theme: ‘Fixing Nigeria, Before the Fall’, addressed by its leader, Ayo Adebanjo.\nBut what used to be confined to the North East, has today become a pan Nigerian.\n“Buhari regime has treated them with kids gloves, and have blithely labelled them as bandits, businessmen, vandals, and even recently as area boys.\nIt was mortally wounded in January 1966 and was then slaughtered in July of 1966."
  },
  {
    "headline": "Troops kill 46 insurgents, rescue 140 kidnapped persons",
    "summarized_story": "From Molly Kilete, AbujaThe Defence Headquarters (DHQ) said soldiers on counter insurgency operations and other security operations across the country killed 46 terrorists and bandits in the last two weeks and rescued 140 kidnapped persons.\nThe DHQ also said that another 1,186 members of Boko Haram, alongside their families, surrendered to troops in Borno State in the last two weeks.\nHe added that troops also rescued 13 kidnapped civilians within the period and recovered arms and ammunition from the criminals.\n“Also, troops neutralised three armed robbers and rescued two kidnapped civilians, while five criminal elements associated with pipeline vandalism, piracy, illegal oil bunkering and armed robbery were arrested within the period.\n“Troops of Operation Delta Safe conducted land, maritime and air operations in the South-South zone, to forestall activities of economic saboteurs and other criminal elements."
  },
  {
    "headline": "Prison breaks: 3,906 inmates still at large –Aregbesola",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaMinister of Interior, Ogbeni Rauf Aregbesola, has disclosed that 3,906 inmates, who escaped from various custodial centres, were still missing.\nHe made the disclosure during a media briefing organised by the Presidential Media Team in Abuja, yesterday, adding that 4,369 inmates escaped from the centres since 2020.\nHe said the biometrics of all custodial inmates in the country have been taken, adding that this would enable the escapees to be tracked and rearrested.\nHe said 560 inmates have been enrolled for WAEC/NECO examinations while 2,300 are enrolled for Adult Literacy classes in several custodial centres.\nAregbesola also stated that 174,000 jobs have been created through the administration of expatriate quotas and business permits."
  },
  {
    "headline": "Herdsmen gives condition for ending open grazing",
    "summarized_story": "From Fred Ezeh, AbujaPastoralists under the umbrella of the Miyetti Allah Kautal Hore said they are willing and ready to quit open grazing in line with public suggestions if government would make financial and logistics provision for alternatives grazing for them.\nThe herdsmen admitted that open grazing is an outdated practice but said thay cannot suddenly quit the age-long practice because there wa no alternative way yet to feed their cattle.\nThey promised to leave the farmlands as soon as ranches that are being proposed by some government officials, particularly southern state governors, are provided.\nMiyetti Allah Kautal Hore brand Ambassador, Temitope Ajayi, made known the desires of the herdsmen when she led some officials of the Association on a courtesy visit to the Minister of Women Affairs, Pauline Tallen, in Abuja, yesterday.\nSetup your own platform that allows you to earn a minimum of ₦100,000 daily, payments are in US dollars, 100% legitimate .Click here to start now ."
  },
  {
    "headline": "Gov Fayemi: Malami Should Defend Nigeria, Not Claimants",
    "summarized_story": "He upbraided the attorney general for publicly identifying himself as the attorney general of the federal government during his interview, noting that the office which Malami occupies exists to serve the federation and not the federal government.\nRather than defending the consultants, Fayemi insisted that Malami’s job was to defend the federal, state and local governments which make up the federation.\n“The attorney general of the federation is pushing so vehemently on the side of people whose primary intent is to fleece the Nigerian people.\n“These matters were not appealed by the federal ministry of justice, admittedly not under Malami at the time.\n“I am afraid that we do not believe that the attorney general has demonstrated this (transparency) and that’s what has brought this about,” he declared."
  },
  {
    "headline": "Police Parade 14 Suspects over Invasion of Justice Odili’s Residence",
    "summarized_story": "THISDAY disowned one of the suspects, Mr. Stanley Nkwazema, who claimed to be a staff and contributing editor of the newspaper.\nNkwazema claimed he was investigating an exclusive story.\nMba said all the suspects attended all the meetings before the invasion and were all there on the night of the invasion.\n“Contrary to his claim, Mr. Nkwazema is neither a staff of THISDAY nor a Contributing Editor.\nWhich work has he executed for the Honourable Attorney General of the Federation and the Minister of Justice?"
  },
  {
    "headline": "Buhari: We’ve Invested Massively in Roads, Rail, Power, Airports",
    "summarized_story": "Buhari also declared that investment in gas was a top priority of his government, as it had huge benefits in terms of financial returns and generation of power.\nDuring the opening of the three-day forum yesterday, Buhari flayed the disparity in the distribution of COVID-19 vaccines between developed and developing nations since the pandemic broke out last year.\nThis massive gap between vaccine requirements in Africa and vaccine availability is undermining the fight against the coronavirus pandemic on the continent.\nBuhari said pledges should be fulfilled in a timely manner, as he appreciated some countries, like France, that had donated vaccines to developing countries.\n“Licensing agreements should be reached with pharmaceutical companies for the transfer of intellectual property and technology to support the production of vaccines in Africa."
  },
  {
    "headline": "Banditry: Military Deploys Troops, Attack Helicopters on Abuja-Kaduna Rail Line",
    "summarized_story": "Kingsley Nwezeh in AbujaThe military high command, yesterday, said it has ordered the deployment of troops and attack helicopters on the Abuja-Kaduna Expressway in a bid to contain attacks by bandits on the rail line in the area.\nOn the North-east, he said 31 terrorists were decimated while 71 were arrested and that,1,181 insurgents surrendered to troops.\nHe said within the period, several anti-illegal oil production and raid operations were executed at different locations in the zone that yielded significant results.\nHe stated that in the course of the operations, troops discovered and deactivated illegal oil refining and bunkering sites in Bayeslsa, Delta and Rivers.\n“Consequently, a total 1,252,250 litres of illegally refined AGO and 1,140,340l litres of stolen crude were recovered in the course of the operations”, he said."
  },
  {
    "headline": "Breaking: Police Arrest Fake CSP, 14 Suspects Who Invaded Justice Odili’s House",
    "summarized_story": "By Kingsley NwezehThe Nigeria Police Thursday paraded one fake Chief Superintendent of Police (CSP), Lawrence Ajojo, and 14 other criminal suspects including some members of other law enforcement agencies, who invaded Justice Mary Odili’s House in Maitama, Abuja.\nParading the suspects, on Thursday at the Force Criminal Investigation Department(FCID), Area 10, Garki, Force Public Relations Officer, Mr. Frank Mba, a Commissioner of Police, said the suspects involved in the criminal acts were drawn from different professional backgrounds, notably, journalism, banking and law enforcement.\nIn a chat with newsmen, the fake CSP, Ajojo admitted that “he’s not an officer of the Nigeria Police.”He, however, claimed to be a consultant for the Attorney General and Minister of Justice, Abubakar Malami, but insisted that the AGF did not direct him on failed raid on Justice Odili’s House.\nThe journalist involved also claimed to be working on an exclusive story but was blamed for not reporting the story before and after it broke until he was invited by the police.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Biafra: New Armed Group ‘Angry Vipers’ Threatens South-East Governors, Socialite Obi Cubana Over Nnamdi Kanu's Detention",
    "summarized_story": "A heavily armed group which identified itself as ‘Angry Vipers’ has threatened to attack governors, senators and other political leaders from the south-east if the leader of the Indigenous People of Biafra, Nnamdi Kanu is not released within 21 days.\nIn a video made on Wednesday, November 10, the group also issued threats to socialite and Anambra-born businessman, Obinna Iyiegbu, popularly known as Obi Cubana.\nRecall that Abba Kyari attended the lavished burial Cubana organised for his late mother in Oba, Anambra State.\nWe the angry vipers are giving you 21 days to leave our land unless Maazi Nnamdi Kanu is released.\"\n“For Obi Cubana and Co, who are closely working with the killers of our youths, you and your crew made sure that Fulani Abba Kyari returned to Anambra State."
  },
  {
    "headline": "Biafra: New Armed Group ‘Angry Vipers’ Threatens South-East Governors, Socialite Obi Cubana Over Nnamdi Kanu's Detention",
    "summarized_story": "A heavily armed group which identified itself as ‘Angry Vipers’ has threatened to attack governors, senators and other political leaders from the south-east if the leader of the Indigenous People of Biafra, Nnamdi Kanu is not released within 21 days.\nIn a video made on Wednesday, November 10, the group also issued threats to socialite and Anambra-born businessman, Obinna Iyiegbu, popularly known as Obi Cubana.\nRecall that Abba Kyari attended the lavished burial Cubana organised for his late mother in Oba, Anambra State.\nWe the angry vipers are giving you 21 days to leave our land unless Maazi Nnamdi Kanu is released.\"\n“For Obi Cubana and Co, who are closely working with the killers of our youths, you and your crew made sure that Fulani Abba Kyari returned to Anambra State."
  },
  {
    "headline": "Biafra: New Armed Group ‘Angry Vipers’ Threatens South-East Governors, Socialite Obi Cubana Over Nnamdi Kanu's Detention",
    "summarized_story": "A heavily armed group which identified itself as ‘Angry Vipers’ has threatened to attack governors, senators and other political leaders from the south-east if the leader of the Indigenous People of Biafra, Nnamdi Kanu is not released within 21 days.\nIn a video made on Wednesday, November 10, the group also issued threats to socialite and Anambra-born businessman, Obinna Iyiegbu, popularly known as Obi Cubana.\nRecall that Abba Kyari attended the lavished burial Cubana organised for his late mother in Oba, Anambra State.\nWe the angry vipers are giving you 21 days to leave our land unless Maazi Nnamdi Kanu is released.\"\n“For Obi Cubana and Co, who are closely working with the killers of our youths, you and your crew made sure that Fulani Abba Kyari returned to Anambra State."
  },
  {
    "headline": "BREAKING: Anti-graft Agency, EFCC Grills Ex-Edo Governor, Igbinedion Over N1.6billion Fraud",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) is currently interrogating Chief Lucky Nosakhare Igbinedion, former governor of Edo State, over what a source described as alleged criminal diversion of public funds to the tune of N1.6 billion.\nLucky Nosakhare IgbinedionShortly after his exit as governor in 2007, Igbinedion was prosecuted by the EFCC and convicted of corruption.\nWilson Uwujaren, spokesman for the commission, confirmed the invitation of the former governor but declined further comment.\nSaharaReporters as far back as 2008 exposed how the EFCC entered into a \"plea bargain\" agreement with Igbinedion.\nAfter SaharaReporters exposed the deal, Mrs. Waziri, through a former EFCC spokesman, Femi Babafemi cried that there was a ‘plot’ to destroy the then Umaru Yar'Adua regime by bringing down the EFCC leadership."
  },
  {
    "headline": "BREAKING: Anti-graft Agency, EFCC Grills Ex-Edo Governor, Igbinedion Over N1.6billion Fraud",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) is currently interrogating Chief Lucky Nosakhare Igbinedion, former governor of Edo State, over what a source described as alleged criminal diversion of public funds to the tune of N1.6 billion.\nLucky Nosakhare IgbinedionShortly after his exit as governor in 2007, Igbinedion was prosecuted by the EFCC and convicted of corruption.\nWilson Uwujaren, spokesman for the commission, confirmed the invitation of the former governor but declined further comment.\nSaharaReporters as far back as 2008 exposed how the EFCC entered into a \"plea bargain\" agreement with Igbinedion.\nAfter SaharaReporters exposed the deal, Mrs. Waziri, through a former EFCC spokesman, Femi Babafemi cried that there was a ‘plot’ to destroy the then Umaru Yar'Adua regime by bringing down the EFCC leadership."
  },
  {
    "headline": "Uzodimma offers scholarship to Imo indigene who bagged 9As in WASSCE",
    "summarized_story": "Hope Uzodimma, governor of Imo state, has offered a scholarship to Confidence Nwaozuzu, an indigene who made distinctions in nine subjects in the 2020 West African Senior School Certificate Examination (WASSCE).\nAdvertisementAccording to NAN, Oguwike Nwachuku, chief press secretary to the governor, announced the scholarship in a statement on Thursday.\nThe governor, who received Nwaozuzu at the government house, in Owerri, also promised to train her through university education.\nHe said that the state government deemed it fit to identify with Nwaozuzu as a way of encouraging her and spurring other Imo students on in their academic endeavour.\nAdvertisementAlso speaking, Nwaozuzu appreciated the governor for inviting her and giving her “lifelong empowerment” in the form of education."
  },
  {
    "headline": "Maiduguri now among most peaceful places, says UNIMAID VC",
    "summarized_story": "Aliyu Shugaba, the vice-chancellor (VC) at the University of Maiduguri (UNIMAID), says Maiduguri has become one of the most peaceful state capitals it was once known for.\nAccording to NAN, the VC said the busy activities that Maiduguri was once known for had returned, adding that the university recorded tremendous achievement with visitors thronging it.\nShugaba said that, despite the harrowing experience in the last 12 years, the university remained resilient.\nAdvertisementHe added that the institution remained open to academic activities, making it easy to bounce back.\n“I dare say now that if you want the most peaceful place in the whole of this country, then Maiduguri is one."
  },
  {
    "headline": "FAKE NEWS ALERT: Photo of Jigawa varsity SUG president with guards was from ‘security awareness’ event",
    "summarized_story": "AdvertisementIn the images, which surfaced online on Thursday, the SUG president showed up on campus in a white Mercedes Benz accompanied by a bevy of security men clad in black suits.\nThe six security men are believed to be his fellow students.\nAccording to him, the students at the criminology and security studies department of the varsity were staging a security awareness event when the images were taken.\nThey also work as security men at the university gates, then it’s concluded with a symposium.\n“What you see is just the students providing special security to the student’s union president."
  },
  {
    "headline": "SSANU, NASU begin 3-day protest over N22bn allowance sharing formula",
    "summarized_story": "The Non-academic Staff Union of Educational and Associated Institutions (NASU) and the Senior Staff Association of Nigerian Universities (SSANU) have directed its members to proceed on a three-day nationwide protest.\nAdvertisementThe directive was issued in a memo dated November 8 and jointly signed by Peters Adeyemi, the NASU general secretary, and Mohammed Ibrahim, SSANU national president.\nThe joint action committee (JAC) of both unions said the protest became necessary due to the sharing formula of the recently approved N22 billion earned allowances for four universities-based unions.\nThe Academic Staff Union of Universities (ASUU) was allocated 75 per cent while 25 per cent went to the three other unions.\nAdvertisementThe unions had disagreed with the sharing formula while also giving the federal government a two-week ultimatum to reverse it."
  },
  {
    "headline": "Denrele: How influential man demanded sexual act from me at media event",
    "summarized_story": "Denrele Edun, the Nigerian media personality, has opened up on how an “influential man” demanded a sexual act from him during a red carpet event.\nAdvertisementIn a chat with HipTv, Denrele spoke about his personal experiences in media work over the years.\nRecalling his struggles, the crossdresser said he once had to interview a notable figure at a red carpet event he was asked to headline.\nHe narrated how he was assaulted for refusing to perform sexual acts on the man in question.\nAdvertisement“I was the red carpet headliner."
  },
  {
    "headline": "Flutterwave’s acquisition of Disha is a win for the creator economy",
    "summarized_story": "Disha, the product they built, launched in 2019—by which time Blessing Abeng had joined them as co-founder and growth and marketing lead for the product.\nThe move by the payments giant, which earlier this year became a unicorn, is surprising as both companies operate in different spaces—Flutterwave in payments and Disha in the creator industry.\nDespite the acquisition, however, Disha will remain an independent company.\n“Before now, when users created a Disha page and linked to a Flutterwave payment link, they got taken off the Disha site.\nNow, with the acquisition, users can create and accept their payments, all in one place.”Flutterwave has always played in the creator space, having supported arts events like ArtX Lagos."
  },
  {
    "headline": "Exclusive: Meta’s VP MEA and Turkey on Facebook’s transition into the metaverse",
    "summarized_story": "Leading that work in Africa is Derya Matras, Vice President (VP), Middle East, Africa (MEA) and Turkey, Meta.\nPrior to her appointment as VP in August, Matras was the Managing Director for the MEA and Turkey region.\nIt’s the next evolution in a long line of social technologies, and it’s ushering in a new chapter for our company.\nWhy should Facebook build this?\nBut it’s important to reiterate that Meta is neither going to build, own, or run the metaverse on its own."
  },
  {
    "headline": "MFS Africa raises $100m to continue expanding its digital payments network",
    "summarized_story": "MFS Africa, Africa’s largest digital payments network, has raised a $100 million Series C funding, an investment divided into two commitments: $70 million for equity and $30 million for debt financing.\nThe announcement came a few weeks after the company extended its footprint into the Nigeria market by acquiring Baxi, one of Nigeria’s largest digital solutions and distribution companies, from Capricorn Digital.\nFounded by Dare Okoudjou in 2009, MFS connects more than 320 million mobile money wallets across over 35 African countries.\nThe company plans to use the new investment to hire more global talent, power its Governance, Risks and Compliance (GRC) functions, and ramp up its expansion efforts.\nWe are excited to join MFS Africa’s world-class management team on its mission and to support its growth journey.”Share this article"
  },
  {
    "headline": "How to secure funding for your early-stage startup in Africa",
    "summarized_story": "Ayobami and Ayobamigbe work with Ingressive Capital, a venture capital firm that writes up to $400K cheques to early-stage startups.\nDisrupt Africa reported a 68.4% jump in the number of investors in 2020 (370 investors) from 2019’s reported number of 261 investors.\nStartup accelerators like Y Combinator and TechStars have become incredible partners to the growth of the African startup ecosystem.\nwith FirstCheck Africa, Let’s Talk with Microtraction), Invest in the Future with Future Africa), and How I Got Funded (Ingressive Capital).\nYour investment pitch deck should address the pivotal questions of the problem, why the problem matters, your solution, and the market opportunity (total addressable market)."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Technext to host Coinference 2021: Africa’s biggest cryptocurrency gathering!",
    "summarized_story": "Share this article:Tech media organisation, Technext has announced its maiden event, Technext Coinference 2021.\nThe maiden event is billed to hold on Thursday, December 9, 2021, at the Pistis conference centre in Lagos.\nRegistered delegates will anticipate discussions on the impact of regulation on the crypto space.\nIt will also provide an exciting opportunity for crypto enthusiasts to meet other enthusiasts, develop ideas and positions for future gain.\nTechnext Website Technext.ng is the go-to site for Tech News, Reviews and Insightful Analysis in Nigeria."
  },
  {
    "headline": "Helium Health acquires Qatar’s Meddy in expansion play",
    "summarized_story": "Share this article:Nigerian healthtech startup, Helium Health has announced its acquisition of Meddy, a doctor booking platform in Qatar.\nAs part of the deal, Meddy’s CEO Haris Aghadi and COO Abed Alkarim Khattab will join Helium Health’s leadership team.\nHowever, Adegoke Olubusi, Helium Health’s CEO reveals that the cultural similarity of the two teams was key in the deal.\nFounded by Olubusi, Dimeji Sofowora, and Tito Ovia, Helium Health provides a suite of services for its healthcare clients.\nThis year, Helium Health has already expanded to Kenya."
  },
  {
    "headline": "Nigerian drones and smart glasses, Rabbit’s $11m pre-seed, MFS Africa’s $100m Series C, and Flutterwave’s Disha acquisition",
    "summarized_story": "AdvertisementLendable, a UK-based debt financing company, typically gives startups between $5 million and $10 million in debt financing.\nYou can read all about it here: How UK-based debt financing company, Lendable, is providing equity-free financing for African startups.\nMFS Africa raises $100m Series CDare Okoudjou (Founder and CEO, MFS Africa).\nSource: Reloadly blogPan-African cross-border payments gateway, MFS Africa, has closed a $100 million Series C round, comprising $70 million equity and $30 million debt.\nFounded in 2009, MFS Africa connects mobile money systems to banks and other financial institutions."
  },
  {
    "headline": "Ghana mobile money revenue offers clues to MTN Nigeria’s PSB expectation",
    "summarized_story": "The Central Bank of Nigeria recently granted approval in principle to MTN Nigeria and Airtel Africa to operate payment service banks (PSBs), with final approval to follow in six months, subject to specific requirements.\nTo extrapolate the revenue MTN Nigeria is likely to generate from its mobile money business in Africa’s most populous nation, BusinessDay proceeded to analyze the data by Tellimer, a global technology, information, and data provider, that surveyed mobile money penetration (defined as mobile money users as a percentage of total subscriber base) across various African telcos and markets.\nAs expected, Safaricom had the highest penetration (71percent), given its dominance and the positive trend for mobile money in Kenya.\n“This means that it will be very difficult for MTN Nigeria to replicate M-Pesa’s success in Kenya or that of its fellow MTN Group subsidiary in Ghana,” Omole said.\nThe central bank had in 2019 granted approvals to Hope PSB, Money Master PSB and 9PSB."
  },
  {
    "headline": "Foreign investors love Nigerian banks’ Eurobonds but detest their stocks",
    "summarized_story": "Foreign investors can’t get enough of Nigerian banks’ Eurobonds but won’t touch their stocks with a ten-foot pole.\nFirst, it was Access Bank and now United Bank for Africa (UBA) that has issued Eurobonds that ended up oversubscribed by foreign investors, a sign of strong investor confidence in Nigeria’s top banks.\nFor the UBA Eurobond, investors will receive 6.75 percent every year for five years.\nThe lack of interest in banking stocks, once favourites of foreign investors, is due to challenges with accessing foreign exchange which has made many wary of holding naira assets.\nAlthough dollar liquidity has been improving in recent times and is expected to improve even further as banks tap the Eurobond market, foreign investors remain largely on the sidelines."
  },
  {
    "headline": "Lagos streets turn outlets for fast food",
    "summarized_story": "In a bid to reach more customers and boost sales, fast food restaurants have turned Lagos streets into retail channels to sell their products in cheaper and smaller packs.\nAccording to a BusinessDay survey, restaurants in Lagos, Nigeria commercial hubs, such as Mr. Biggs, Chicken Republic, and Sweet Sensation, pioneers of the Quick Service Restaurants (QSRs) industry, have been using the ‘Sell-on-the-Go’ marketing strategy, by setting up express kiosks since 2019.\nApart from the QSRs going into smaller formats, FMCGs now package their products into smaller sachets to target the larger segment of the economy.\n“A lot of consumer food service operators are now trying to explore the format of miniaturization.\nAlthough it is an interesting opportunity, Uzo advises that QSRs should not copy each other or else their business could shut down."
  },
  {
    "headline": "INEC gives Soludo certificate of return",
    "summarized_story": "The Independent National Electoral Commission on Friday presented the Certificate of Return to Chukwuma Soludo for winning the Anambra State governorship election which was held on November 6.\nThe presentation took place in Awka, the Anambra State capital with his deputy also present at the event.\nSoludo was the candidate of the All Progressives Grand Alliance which is currently ruling the state with Governor Willie Obiano.\nHe won 19 of the 21 local governments areas including Ihiala LGA which had its own election done on Monday.\nHe was declared winner of the election by the state Returning Officer for the election, Florence Obi, on Wednesday."
  },
  {
    "headline": "LAPO Partners dRPC on Women Empowerment – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Lift Above Poverty Organization (LAPO), has entered into a partnership with the development Research and Project Centre (dRPC), an intermediary non-profit organization to advocate for an increase in budgetary allocation for women empowerment in Edo State.\nUnder the partnership, LAPO will conduct advocacy to relevant stakeholders and follow up on inclusion of women economic empowerment in budgetary allocation, create a consortium of about nine to ten Civil Society Organisations (CSOs) and train them to do likewise.\nThe team which consists of LAPO and DRPC representatives was led by the Executive Director, LAPO, Dr. Honestus Ayobami Obadiora.\nGiven the project, the Executive Director, LAPO, recognized that Agriculture has an important role to play in sustainable Economic Empowerment of women.\nHe also solicited more government support in the area of budgetary provision for agricultural infrastructure, farm settlement schemes, and increased financing for women farmers to enhance agricultural productivity and women’s economic empowerment."
  },
  {
    "headline": "Commissioner, Media Aide, Others Inspect Facilities In BNCL – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Honorable Commissioner for Communication and Orientation, Edo State, Barr.\nAndrew Emwanta and Special Adviser to Governor Godwin Obaseki on Strategy and Media Projects, Mr Crusoe Osagie, yesterday, led other top government functionaries, including Mr Kolawole, a media consultant, on facility tour to Bender Newspaper Company Limited publishers of the observers titles.\nThey were received and taken round various departments of the organization by the General Manager, Sir Barr.\nSolomon Imohiosen, who explained various functions of each of the departments to the inspectors.\nHe added that for paucity of funds, the organisation would have been producing 1,000 copies per a day, just as he has thanked Governor Obaseki for taking bold steps to revamp the organisation for efficiency and effectiveness to achieve its potentials in terms of media coverage."
  },
  {
    "headline": "IPC Condemns The Gruesome Murder Of OAP David Ekanem; Calls For Thorough Investigation – Nigerian Observer",
    "summarized_story": "IPC Condemns The Gruesome Murder Of OAP David Ekanem; Calls For Thorough InvestigationShare FacebookTwitterStumbleuponLinkedInPinterestWARRI – The International Press Centre (IPC), Lagos – Nigeria has condemned the reported gruesome murder of David Ekanem, popularly known as ‘Itiat Zion’, a member of staff at FAD FM, in Calabar, Cross River State.\nA Newspot Nigeria report revealed that the late Ekanem who was the Efik language programme presenter for FAD FM, was stabbed and left to die by alleged hoodlums close to a popular hotel on the Murtala Mohammed highway on Saturday, November 6, 2021.\nThe cause of the alleged attack is unknown, but the radio station Ekanem worked with confirmed his death.\nIn statement signed by Melody Lawal, Safety Alert Officer, IPC on behalf of the Executive Director, Mr. Lanre Arogundade, IPC said,“It is of serious concern that yet another journalist has been killed highlighting the fact that journalists and other media professionals continue to be endangered species in Nigeria as we stated on November 2 while marking the International Day to End Impunity for Crimes Against Journalists”.\nIPC therefore calls on the Police and other relevant security agencies to do their utmost to ensure that the killers of David Ekanem are apprehended and brought to justice."
  },
  {
    "headline": "Stakeholders task Nigerians on uses of FOI Act to get NDDC budgetary allocation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Stakeholders at the town hall meeting organized by the Social Action in conjunction with the MacArthur Foundation, on Tuesday tasked Nigerians on effective use of the Freedom of Information (FOI) Act to know the budgetary allocation for the Niger Delta Development Commission (NDDC) each year by the federal government.\nThe demand was contained in the communiques issued at the end of the town hall meeting with stakeholders in Benin City.\nIt said for the NDDC to have its impacts, there should be active participation among host communities, traditional rulers and other stakeholders in project planning, monitoring and evaluations.\nIt added that persons with disabilities should be included in planning and budgeting process of the NDDC Projects, in line with the global best practices.\nIt further warned that NDDC projects should not be used as political patronage but that those qualified to undertake projects should be given with the intention of executing it for the well-being of all."
  },
  {
    "headline": "Court awards N50million compensation over death of detainee in SARS custody",
    "summarized_story": "The Kano High Court in Kano has awarded N50 million damages to the family of a detainee who was tortured to death in the cell of the defunct Special Anti-Robbery Squad (SARS).\nMustapha Muhammad, then 28 years old, died in SARS custody in Kano on September 14, 2019, his brother, Abdulkarim Muhammad, said in the affidavit filed along with the suit.\nUbale, granted nine out of the 10 prayers sought by the deceased person’s family.\nAlthough the family sought N100 million damages, the judge awarded N50million compensation in their favour.\nMr Hikima noted that SARS tortured Mr Muhammad to death and refused to inform the family."
  },
  {
    "headline": "Osun Infrastructural Development under Governor Gboyega Oyetola – By Yinka Kolawole",
    "summarized_story": "One of the reasons Osun State Governor, Gboyega Oyetola will remain in the good books of Osun people is the massive infrastructural development that the state has witnessed since the governor assumed mantle of leadership on November 27th, 2018.\nShortly after taking over as governor, Oyetola commissioned four projects as part of the activities marking the event.\nThe road construction projects created over 5,000 direct jobs in the state and 12,000 indirect jobs for welders, plumbers and bricklayers, as well as food vendors.\n52kmConsequently the people of Osun state have been urging Governor Gboyega Oyetola to make moves so that Osun could also benefit from NNPC’s road projects.\nThe rate of accident on that road before this construction work is relatively high."
  },
  {
    "headline": "EFCC detains Lucky Igbinedion, ex-Edo Governor over alleged N1.6bn fraud",
    "summarized_story": "Nigeria’s anti corruption agency, the Economic and Financial Crimes Commission (EFCC), has detained Mr Lucky Igbinedion, a former governor of Edo State over alleged criminal diversion of N1.6 billion of public funds.\nWilson Uwujaren, EFCC’s spokesperson confirmed Mr Igbinedion’s invitation to the News Agency of Nigeria on Thursday.\nIgbinedion, 64, who governed Edo State between 1999 and 2007, is currently being held at the EFCC’s headquarters in Jabi, Abuja.\nThe new investigation was based on fresh evidence against Mr Igbinedion.\nHe said the ex-governor diverted a loan obtained by the Edo State government to finance investment to settle financial indebtedness of a company he was invested in"
  },
  {
    "headline": "We disbursed N58bn to poor Nigerians in 2 months under CCT programme – FG",
    "summarized_story": "Nigeria’s federal government says it has disbursed the sum of N58 billion in two months to the underprivileged under the Conditional Cash Transfer Programme.\nHajia Halima Shehu, National Programme Coordinator, Household Uplifting Programme – Conditional Cash Transfer (HUP–CCT) disclosed this on Thursday, in Yola.\nShehu, according to NAN, stated that the programme is directed mainly at people who live in rural areas where poverty and hunger is on the rise.\n”In furtherance to that, the Federal Government established the Household Uplifting Programme – Conditional Cash Transfer (HUP – CCT), with a slogan ‘ Beta don come’ to help alleviate the poverty of the poor.\nThe beneficiaries would receive N10,000 naira monthly, as total beneficiaries in the state include 41,134 benefiting households involving a total of 149,282"
  },
  {
    "headline": "92 percent of primary school teachers in Anambra are women – Soludo",
    "summarized_story": "Anambra State governor-elect, Prof Charles Soludo, has said as much as 92 percent of primary school teachers in the state are women, while 87 percent of teachers in secondary schools are also women.\nSoludo gave the figures while unveiling his plans for the youths and women in the state during an interview session with journalists, noted that his government would be inclusive.\nHe emphasized there is no gender discrimination in Anambra, and that everyone will be given equal opportunity.\nI am focusing on problem solving, if it is all women that will get it done, that’s fine,” he said.\nFor example, 92 percent of teachers in our primary schools are women and 87 percent in secondary schools."
  },
  {
    "headline": "Celebrities Set For Abuja All-White Pool Party",
    "summarized_story": "Top celebrities are set to be live at Abuja All White Pool Party as the event promises to attract the crème de la creme of entertainment and lifestyle personalities including the throngs of fun lovers, party goers, celebrities, and socialites.\nThe event which is the first of its kind to grace the FCT Abuja and powered by Peace Ambassador Agency, is organised by the agency.\nThe Abuja All White Pool Party has over the years improved upon this showpiece event and has ensured that each edition outclasses and outguns the previous show thereby creating a wave of anticipation like never before experienced among Abuja socialites and fun seekers.\nADVERTISEMENTPeace Ambassador Agency has partnered with a large cache of beverage brands, telecommunication firms, financial institutions, business conglomerates, etc on this one showpiece event with astounding records of success with every passing year.\nThe party has been a landmark event in the social life of FCT residents for the past half-decade and counting."
  },
  {
    "headline": "Lawyer Writes President Buhari Over Non-appointment Of Minister From Taraba",
    "summarized_story": "A human rights lawyer/activist, Mr Bilyaminu Lukman Maihanchi, has petitioned President Muhammadu Buhari through the Office of the Attorney-General of the Federation (AGF) for not appointing a minister from Taraba State.\nIn the petition in which he copied the Senate President and Speaker of the House Of Representatives, the lawyer called on the AGF to advise the president to carry out his constitutional duty to Taraba State.\n“Since he failed and or intentionally refused to appoint an indigene of Taraba State since the removal of Engr Saleh Mamman, he has been running the affairs of the government without a representative from Taraba State in the executive council.\nADVERTISEMENT“Since the removal of the former minister three months ago, the president has been without a minister who is from Taraba State as constitutionally guaranteed, and it is duty bound constitutionally for the president to hold regular meetings.\n“Sir, running the government for three months without appointing minister from Taraba State, and also failure to hold regular meetings for the period of three months with representatives from Taraba State is intentional violation of the constitution of the federal Republic of Nigeria."
  },
  {
    "headline": "Zulum Releases N476m Scholarship For 15,374 Students",
    "summarized_story": "Borno State Governor Babagana Umara Zulum has released the sum of N476.640million for the payment of 2020/2021 scholarship to 15,374 students of Borno State in tertiary institutions of learning.\nThe commissioner for higher education, science, technology and innovation, Engr Babagana Mallumbe Mustapha, announced the release of the money yesterday in Maiduguri, after a meeting with the National Union of Borno State Students (NUBOSS) at the Borno State Scholarship Board.\nThe commissioner said the e-payments will be applied for the disbursement of the fund to all beneficiaries.\nADVERTISEMENTThe executive secretary of the scholarship board, Mallam Bala Isa, called on benefitting students to face their studies seriously.\nOn behalf of the students, the president of the National Union of Borno State Students (NUBOSS), Sugun Abba, commended Governor Zulum for his consistent passion for the welfare of students and commitment to improving the standard of education in the state."
  },
  {
    "headline": "COVID-19: Zipline Completes World’s First Long-range Drone Delivery Of Vaccines In Ghana",
    "summarized_story": "Zipline, the global leader in instant logistics, has successfully completed the first long-range drone delivery of both authorized mRNA COVID-19 vaccines requiring ultra-cold-chain in Ghana.\nThis achievement is attributed to the collaboration of Zipline, Pfizer and BioNTech, which paved the way for automated, on-demand delivery of first mRNA COVID-19 vaccines in Ghana.\nAt this time of extraordinary focus on science and dedication to patients, the Pfizer-BioNTech COVID-19 Vaccine, like all COVID-19 vaccines on the market, requires storage and transportation in controlled temperature conditions.\nADVERTISEMENTZipline, Pfizer and BioNTech tested and validated the end-to-end model for delivery of mRNA vaccines with ultra-cold-chain requirements, and Zipline will now utilize it to distribute Pfizer-BioNTech COVID-19 Vaccines, as well as COVID-19 vaccines from all manufacturers, to regions across Ghana.\nNearly 175,000 COVID-19 vaccines from multiple manufacturers have been distributed across Ghana to-date by Zipline, the first company to do so through an autonomous aircraft at national scale."
  },
  {
    "headline": "Federal Govt, Yobe Kick Off N2.5bn Grazing Reserve Project",
    "summarized_story": "Federal government has partnered with the Yobe State government to execute a N2.5 billion contract in Nasari/Jakusko Grazing Reserve located in the Jakusko local government area.\nShe said the first phase is sited in the northern part of the state while the second and third phases will be executed in Yobe East and Yobe South senatorial districts.\nAmong the facilities to be provided in the grazing reserve include 50 units of two-bedroom to herdsmen settlement, 12 units of boreholes with solar panels, five units of Earth dams both for human and animal consumption.\nThe location for the project covers about 10 square kilometres of land at the grazing reserves, said the commissioner.\nShe urged the contractors to be prudent and give quality projects to earn the opportunity in subsequent contracts."
  },
  {
    "headline": "Panic as bandits abduct five, impose fresh levy on Sokoto communities",
    "summarized_story": "Gatawa, in Sabon Birni Local Government Area of Sokoto State, was until recently one of the communities in the state spared by the bandits.\nHe said Gatawa is among the communities asked by the bandits last month to contribute N20 million as ransom for those kidnapped from the communities.\nHe said Gatawa town contributed N11 million at the time.\nResidents said the bandits also directed another community in the area, Tarah, to pay N7 million as its own levy.\nUsman Tarah, a resident of the town, said the bandits sent a message on Tuesday and people started gathering the cash."
  },
  {
    "headline": "Panic as bandits abduct five, impose fresh levy on Sokoto communities",
    "summarized_story": "Gatawa, in Sabon Birni Local Government Area of Sokoto State, was until recently one of the communities in the state spared by the bandits.\nHe said Gatawa is among the communities asked by the bandits last month to contribute N20 million as ransom for those kidnapped from the communities.\nHe said Gatawa town contributed N11 million at the time.\nResidents said the bandits also directed another community in the area, Tarah, to pay N7 million as its own levy.\nUsman Tarah, a resident of the town, said the bandits sent a message on Tuesday and people started gathering the cash."
  },
  {
    "headline": "Anambra poll: Soludo receives certificate of return",
    "summarized_story": "The Independent National Electoral Commission on Friday presented the Certificate of Return to Professor Chukwuma Soludo for winning the Anambra State governorship election which was held on November 6.\nThe presentation took place in Awka, the Anambra State capital.\nDetails later…PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Anambra poll: Soludo receives certificate of return",
    "summarized_story": "The Independent National Electoral Commission on Friday presented the Certificate of Return to Professor Chukwuma Soludo for winning the Anambra State governorship election which was held on November 6.\nThe presentation took place in Awka, the Anambra State capital.\nDetails later…PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Biafra: You’ll Hear From Us – Gunmen Threaten Obi Cubana Over Abba Kyari [VIDEO]",
    "summarized_story": "Obi Cubana, an Anambra-born businessman, has been threatened by a heavily armed organization known as the ‘Angry Vipers.’They made the warning in a viral video on Thursday, along with a 21-day deadline for the Southeast Governors to ensure Nnamdi Kanu, the leader of the Indigenous People of Biafra, IPOB, be released.\nThey accused Obi Cubana, who was recently arrested by the Economic and Financial Crimes Commission (EFCC) and held for more than 48 hours, of dining with Fulanis like Abba Kyari, a well-known Nigerian police officer.\nCubana and his team, they said, allowed Fulani Abba Kyari to return to Anambra State."
  },
  {
    "headline": "Former Governor Arrested Over N1.6 bilion Fraud",
    "summarized_story": "A former Governor of Edo State, Lucky Igbinedion has been detained by the Economic and Financial Crimes Commission over alleged criminal diversion of public funds to the tune of N1.6 billion.\nThe further report disclosed that a loan which was obtained by the Edo State government was diverted to a company which Igbinedion has an interest in.\nRecall that the former Governor of Edo State was prosecuted in 2008 by the EFCC and convicted of embezzling N2.9 billion belonging to the state.\nHe was sentenced to six months imprisonment after he pleaded guilty to a one-count charge which was pruned from 191 charges.\nThe judge, Abdu Kafarati, now deceased also ordered the forfeiture of the N500 million, and three properties, including one in Abuja, seized from him."
  },
  {
    "headline": "Missing Journalist, Tordue Salem Found Dead",
    "summarized_story": "Mr Tordue Salem, a missing Vanguard reporter, has been discovered dead in Abuja.\nMrs Salem wanted to talk with her husband first to make sure he was still alive before starting the negotiations.\nMrs Salem received another call from an unknown number later that evening, asking if her husband had been released.\nThe perplexed woman was alleged to have inquired as to why the caller’s phone number was hidden.\nThe police responded first, decrypting the phone number that had been phoned and tracing its owner to a woman in Port Harcourt, Rivers State."
  },
  {
    "headline": "Anambra Election: Soludo To Receive Certificate Of Return Friday — INEC",
    "summarized_story": "The winner of the recently concluded Anambra State Governorship Election will be presented with a Certificate of Return on Friday, according to the Independent National Electoral Commission.\nThe certificates will be delivered to Chukwuma Soludo of the All Progressives Grand Alliance and his deputy governor-elect at the Commission’s office in Awka, the state capital, according to INEC.\nAppreciation“The 2021 Anambra State Governorship election was conducted under the most challenging circumstances.\nNever before did the Commission have to grapple with numerous issues ahead of an off-season Governorship election, including attacks on our facilities, withdrawals of critical service providers such as the ad hoc staff and transporters on the eve of the election and the general tension pervading the atmosphere.\n“We remain resolute that only the votes cast by citizens at polling units will determine the outcome of elections.”"
  },
  {
    "headline": "Breaking: Watch as Charles Soludo, deputy receive certificate of return 2 days after winning Anambra governorship election (VIDEO)",
    "summarized_story": "Anambra state governor-elect, Professor Charles Soludo, has received certificate of return from the Independent National Electoral Commission (INEC) two days after winning governorship election in the state.\nThe presentation held in Awka, Anambra state capital.\nSoludo’s deputy also received his certificate of return."
  },
  {
    "headline": "Nigeria Correctional Centres: 15 jailbreaks occur in 8 years, 3,646 inmates still on the run",
    "summarized_story": "Close to 4,000 inmates that escaped from Nigerian correctional centres between 2013 and this year are yet to be rearrested, our investigations have revealed.\nSecurity at the Olokuta Medium Security Centre in Akure, Ondo state was severely breached on the 30th of June 2013.\nNo fewer than 175 inmates escaped while two persons died and one warder was severely injured.\nIt was the turn of the Kirikiri Medium Prison Correctional Centre, Lagos state on 10th of October, 2014.\nSimilarly, on the 2nd of November, 2014, the Koto-Karfe Correctional Centre in Kogi state, came under assault allegedly by Boko Haram elements."
  },
  {
    "headline": "Odili’s residence invasion: THISDAY disowns suspect as police nab 14, 2 soldiers, 5 others at large",
    "summarized_story": "The Nigeria Police Thursday paraded 14 suspects involved in the invasion of the Abuja residence of a Supreme Court Justice, Mary Odili.\nBut the management of THISDAY has disowned Nkwazema, saying he resigned from his job as a sports correspondent some 15 years ago.\nAccording to Nkwazema, who claimed he was a contributing editor with THISDAY Newspapers, he followed the lead for three days before the raid.\n“Contrary to his claim, Mr. Nkwazema is neither a Staff of THISDAY nor a Contributing Editor.\nThat does not in any way make him a staff and contributing Editor of THISDAY."
  },
  {
    "headline": "Finance Minister Blames Rising Cost Of Rice On Smuggling",
    "summarized_story": "﻿The Minister of Finance, Budget, and National Planning, Zainab Ahmed, on Thursday, said smuggling is responsible for the rising cost of rice in the country.\nSpeaking during an interview on Channels Television’s Politics Today on Thursday, the Minister said smuggling is affecting the market and hurting the citizens.\n“Unfortunately there is a lot of distortion and the distortion is arising from smuggling of goods into the country,” the Minister said.\nThe Minister also reacted to the fresh borrowing request by the Federal Government which was recently approved by the National Assembly.\nThe borrowing that was approved by the lawmakers, the Minister noted, has been in the National Assembly since early this year."
  },
  {
    "headline": "US Secretary Of State To Visit Nigeria, Kenya, And Senegal",
    "summarized_story": "US Secretary of State Antony Blinken travels to Kenya, Nigeria, and Senegal next week, where he will discuss ending the Covid-19 pandemic and battling climate change, his spokesman said Thursday.\nBlinken will meet with the president of each country to “advance US-Africa collaboration on shared global priorities,” state department spokesman Ned Price said in a statement.\nOther topics of conversation on the agenda for the Monday to Saturday trip include revitalizing democracies, advancing peace and security, and a more inclusive global economy, Price said.\nNext, he travels to Abuja, to meet with Nigerian President Muhammadu Buhari and deliver a speech on US-Africa policy.\nHe will end his trip in Dakar where he will meet with Senegalese President Macky Sall and other officials."
  },
  {
    "headline": "Police Arrest 14 Linked With Siege On Justice Odili’s House",
    "summarized_story": "﻿Fourteen persons have been arrested in connection with the siege on Justice Mary Odili’s apartment in Abuja, the police said on Thursday.\nREAD ALSO: Wike Gives FG 48-Hour Ultimatum To Probe Raid On Justice Odili’s ResidenceThe arrest is the latest in a series of events since some armed men laid siege on Justice Odili’s apartment in Maitama.\nThe fake CSP also elicited the services of a journalist, one Stanley Nkwazema and two (2) lawyers namely Bar.\nThe fake CSP later deposed to an affidavit and eventually obtained a search warrant meant for the execution of the raid.\nThe Search Warrant which the suspects procured from a Magistrate Court for purposes of searching the premises of Justice Odili, was also obtained under false representation."
  },
  {
    "headline": "Odili Siege: AGF Malami Denies Consulting With Arrested Suspect",
    "summarized_story": "The Attorney-General of the Federation and Minister of Justice, Abubakar Malami, has distanced himself from a suspect arrested over the siege of Justice Mary Odili’s home.\nHe claimed to work as a consultant for the office of the AGF.\nHowever, the police said their investigations revealed that “there is no involvement at all” of the officials of the office of the AGF in the raid.\n“We asked the suspect to present documents of engagements where he worked as a consultant to the Attorney General of the Federation and Minister of Justice, whether in past or now.\nWhich worked has he executed for the Honourable Attorney General of the Federation and the Ministry of Justice?"
  },
  {
    "headline": "Anambra Poll: INEC Presents Certificate Of Return To Soludo, Deputy",
    "summarized_story": "The governorship candidate of the All Progressives Grand Alliance (APGA), Charles Soludo, has received his Certificate of Return from the Independent National Electoral Commission (INEC) following his victory in the just-concluded guber election in Anambra State.\nSoludo, a former governor of the Central Bank of Nigeria (CBN), received the Certificate of Return in a ceremony on Friday in Awka.\nThe Deputy Governor-elect, Onyeka Ibezim, also got his Certificate of Return.\nMore to follow…"
  },
  {
    "headline": "Breaking: Missing Vanguard Reporter, Tordue Salem found dead in Abuja",
    "summarized_story": "Tordue Salem, Vanguard reporter who was declared missing in October, has been found dead in Abuja.Alhough, details of the circumstances surrounding the recovery of his remains were still sketchy as at Thursday night, sources disclosed to TVC News that his was body was found at an undisclosed location in the FCT.\nThe late Reporter who was covering the House of Representatives, was last seen on October 13, 2021.\nThereafter, he reportedly flagged a cab for the lady who left before him, informing her that he was going to Area 8, Garki.\nBut he was never seen until his remains were recovered on Thursday.\nAmong them was that of a man who was picked for attempting to extort Salem’s family."
  },
  {
    "headline": "Businesses crippled as floods sack Ogba in Lagos",
    "summarized_story": "A downpour lasting just about an hour in Lagos on Thursday has left more than a little trouble in its wake along the Ogba-Ijaiye-Agege axis of the stiate.\nThe flood crippled businesses, petrol attendants were left stranded to wait for the waters to subside,Those patronising the filling station, had to wade through the waves.\nEven the Area G police command was not spared, with parked cars soaked up half way.\nFor decades, flooding has been an environmental hazard in Lagos.\nThey are asking the government to dredge the canals and open up more roads to motorists."
  },
  {
    "headline": "EFCC grills former Edo governor, Lucky Igbinedion over N1.6bn fraud",
    "summarized_story": "The operatives of the Economic and Financial Crimes Commission (EFCC) is currently questioning a former governor of Edo State, Lucky Igbinedion over what a source described as alleged criminal diversion of public funds to the tune of N1.6bn.\nThe former governor who arrived the headquarters of the EFCC at Jabi, Abuja around 2pm, November 11, 2021 was still being quizzed as of the time of filing this report.\nShortly after his exit as governor in 2007, Igbinedion was prosecuted by the EFCC and convicted of corruption.\nBut the new investigation is based on fresh evidence that the former governor diverted a loan obtained by the Edo State Government to finance an investment during his tenure, in settling the financial indebtedness of a company in which he has interest.\nWilson Uwujaren, spokesman of the Commission, who confirmed the invitation of the former governor declines further comment"
  },
  {
    "headline": "Abducted Zamfara businessman, Aminu Sarki regains freedom -",
    "summarized_story": "Abducted Zamfara based Businessman Aminu Sarki Jangeme has regained freedom from his captors.\nJangeme regained freedom Thursday’s afternoon after seven days in captivitySarki, as he is popularly called, escaped from bandits den last year when negotiations for his release was ongoingHe and six other persons in his village, Jangeme in Maru local government area were abducted by gunmen exactly one year agoHe was re-abducted by bandits while monitoring the harvest of his farm crops in his farm along Gusau – Dansadau roadA source close to the family says he was released after payment of ransom including a brand new motorcycle which was part of the demand of his captors.\nTVC NEWS gathered that he has since been reunited with his family."
  },
  {
    "headline": "US Journalist Jailed for 11 Years in Army-Ruled Myanmar",
    "summarized_story": "A court in military-ruled Myanmar on Friday jailed American journalist Danny Fenster for 11 years, his lawyer and his employer said, despite U.S. calls for his release from what it said was unjust detention.\n“There is absolutely no basis to convict Danny of these charges,” said Thomas Kean, editor-in-chief of Frontier Myanmar, one of the country’s top independent news outlets.\n“The junta’s rationale for this outrageous, rights abusing sentence is first to shock and intimidate all remaining Burmese journalists inside Myanmar by punishing a foreign journalist this way,” he said.\nIndependent media has been accused by the junta of incitement.\nMyanmar authorities overlooked Fenster in a recent amnesty for hundreds of people detained over anti-junta protests, which included some journalists."
  },
  {
    "headline": "Azikiwe Against Biafran Tyranny – Trending With Ojy Okpe",
    "summarized_story": "The arrest of 14 persons in connection to the raid of the home of Mary Odili, a justice of the Supreme Court has generated mixed reactions.\nDuring a press briefing on Thursday, Frank Mba, the police, public relations officer, said A fake chief superintendent of police, an Islamic scholar and a journalist were among the 14 persons arrested.\nA video of Dr. Nnamdi Azikiwe, the first president of Nigeria, speaking at the Nigerian High Commission in London, with a message to the Igbos during the Civil war in 1969, to turn away from the leaders of #Biafra who misled them into supporting an enterprise that had brought them widespread suffering has resurfaced online and is making the rounds on social media.\nAnambra Governor Rewards Woman With N1MEunice Ngozi Onuegbusi, the woman who was seen in a viral video rejecting money from Agents of the All Progressives Congress, after they tried to pay her and a group of other women the sum of N5,000 each, to vote for their party on November 6th during the Anambra Governorship election; On Thursday was awarded the Sum of N1 million Naria by Willy Obianor, the governor of Anambra State.\nThe Governor thanked her for her courage, saying even though she knew the money could buy her temporary relief, she remained loyal And voted according to her conscience ."
  },
  {
    "headline": "Toshiba Plans to Split into Three Firms, Rejects Calls to Go Private",
    "summarized_story": "Japan’s Toshiba Corp outlined plans on Friday to split into three independent companies, seeking to appease activist shareholders calling for a radical overhaul after years of scandal.\nA break-up would run counter to calls by some shareholders for Toshiba to be taken private.\nRETURNS FOR SHAREHOLDERSAs part of the overhaul, Toshiba aims to return around 100 billion yen ($875 million) to shareholders over the next two financial years.\nOther assets that will continue to be held by Toshiba include its stake in Toshiba Tec Corp (6588.T), a maker of printing and retail information systems.\nTwo years later, it secured a $5.4 billion cash injection from 30-plus overseas investors that helped avoid a delisting but brought in activist shareholders including Elliott Management, Third Point and Farallon."
  },
  {
    "headline": "Nigeria Police Parade 14 Suspects over Invasion of Justice Odili’s Residence",
    "summarized_story": "The Nigeria Police on Thursday paraded 14 suspects allegedly involved in the invasion of the Abuja residence of Supreme Court Justice, Mrs. Mary Odili.\nTHISDAY disowned one of the suspects, Mr. Stanley Nkwazema, who claimed to be a staff and contributing editor of the newspaper.\nNkwazema claimed he was investigating an exclusive story.\nMba said all the suspects attended all the meetings before the invasion and were all there on the night of the invasion.\n“Contrary to his claim, Mr. Nkwazema is neither a staff of THISDAY nor a Contributing Editor."
  },
  {
    "headline": "$418m Consultants’ Fee: AGF Malami Should Defend Nigeria, Not Claimants, Governors Chairman Fayemi Says",
    "summarized_story": "He upbraided the attorney general for publicly identifying himself as the attorney general of the federal government during his interview, noting that the office which Malami occupies exists to serve the federation and not the federal government.\nRather than defending the consultants, Fayemi insisted that Malami’s job was to defend the federal, state and local governments which make up the federation.\n“The attorney general of the federation is pushing so vehemently on the side of people whose primary intent is to fleece the Nigerian people.\n“These matters were not appealed by the federal ministry of justice, admittedly not under Malami at the time.\n“I am afraid that we do not believe that the attorney general has demonstrated this (transparency) and that’s what has brought this about,” he declared."
  }
]