[
  {
    "headline": "Buhari condoles with parents, relations of students crushed by trailer in Lagos",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), has commiserated with parents, relations and friends of Ojodu Grammar School students who lost their lives in an accident on Tuesday, along Isheri Road, Ojodu, in Lagos State.\nThis was disclosed by the Special Adviser to the President on Media and Publicity, Femi Adesina in a statement on Wednesday.\nAccording to Adesina, “President Buhari condoles with Government and people of Lagos State and the authorities of Ojodu Grammar School over the sad and painful loss of the promising lives that were cut short in the tragic incident.\n“President Buhari prays that the Almighty God will comfort the grieving parents and relations at this very difficult time, and grant the injured quick recovery.”Copyright PUNCH."
  },
  {
    "headline": "Students lament as NASU strike grounds Taraba varsity",
    "summarized_story": "Some students of the Taraba State University, Jalingo, on Tuesday, lamented the hardships they were facing as a result of the strike embarked upon by the Non-Academic Staff Union of Nigerian Universities, Taraba State University chapter.\nSome of the students who spoke to our correspondent said the strike was affecting their ongoing examination as water supply had been cut off in their hostels.\nA 400-level student in the Department of chemistry told our correspondent, “We don’t have water in the hostels and light is not also stable as a result of the strike.\nNon-academic staff who vowed not to vacate the building until their salaries were paid prevented the entrance and exit of vehicles and staff working in the Senate Building.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Former Enugu Commissioner, Nnam remanded in Enugu Correctional Centre over alleged forgery",
    "summarized_story": "By Anayo OkoliFORMER Commissioner for Lands and Urban Development in Enugu State, who left the Government few weeks ago, Surveyor Victor Nnam was last Friday remanded at the Enugu Correctional Center over alleged forgery, theft and obtaining land by false pretense.\nIn the charge, FHC/EN/CR/189/2021, Federal Republic of Nigeria (Complainant) versus Dr. Surv.\nThe former commissioner however, pleaded not guilty to the charges.\nJustice I. N. Buba granted him bail in the sum of N200 million and two reliable sureties in the like sum.\nVANGUARD NEWS NIGERIA"
  },
  {
    "headline": "ANAN President Tasks Members on Digital Accountancy",
    "summarized_story": "Rev Canon Prof. Benjamin Osisioma President, Association of National Accountants of Nigeria.\nOsisioma explained that Accountancy Profession is changing rapidly, hence, the need for accountants to acquire relevant skills and improve on the existing ones.\nThe ANAN National president said this on Tuesday, in Ado-Ekiti, during the 6th session of 2021, ANAN “Mandatory Continuing Professional Development” conference, themed “Re-Engineering Accounting Profession In The Post-Covid Era”.\nHe said, “This MCPD programme is to put the members through the new development in the Accountancy Profession on a yearly basis”.\n“Becoming a member of ANAN does not mean training has ended, you need to be updated with trends in the accountancy profession”, he said."
  },
  {
    "headline": "Oromoni: CPN demands justice, compulsory child protection policy in Lagos schools",
    "summarized_story": "By Funmi AjumobiThe Lagos State chapter of Child Protection Network; CPN, has called for a thorough investigation and justice on the death of Sylvester Oromoni, a student allegedly beaten and poisoned which led to his death by schoolmates in Lagos.\nAderonke who condoled with the student’s family also implored the state government to supervise and ensure that child protection policies are executed in all schools within the state.\n“The Lagos State Child Protection Network says all schools have full responsibility in respect of their ‘duty of care to protect children and to support pupils/students in the school.\n“We demand an abuse free environment for children in Lagos State irrespective of the kind of school they attend, private or government.\n“We demand that child protection policy should be mandatory for every school or places where children are and must be pasted in a conspicuous area within the premises."
  },
  {
    "headline": "Illegal roadblocks: Human Rights Commissioner writes GOC, Enugu CP",
    "summarized_story": "In the letter to the Enugu CP dated November 9, 2021, the Human Rights Commissioner wrote: “I have received several complaints from well-meaning citizens on the degrading and inhuman treatment being meted on travelers by the military and the police force, especially on these roads mentioned above.\n“Sir, imagine the mental and physical torture a traveler on that road goes through daily in these hard times.\nMany patients have lost their lives because they cannot not quick access /emergency service to the referral hospital.\nMedical personnel and other employees have the same sad tales to tell arising from the desire by soldiers and policemen to make quick money at the expense of human lives.\nPlease, accept the assurance of our highest regards,” Joe Mmamel, wrote and copies the GOC 82 Division of the Nigerian Army Enugu."
  },
  {
    "headline": "TB Joshua, Tiwa Savage, Obi Cubana, Sound Sultan make Google 2021 top trend",
    "summarized_story": "Google has announced the results of its 2021 Year in Search, showing the most searched terms, topics and questions by Nigerians in the year 2021.\nGoogle’s 2021 Year in Search compiles the moments, people, topics, events, and places that capture the world’s attention each year.\nTop search topics like ‘Paralympics’, ‘Euro 2020’, ‘EPL’, ‘Chelsea F.C.’ and ‘Champions league’ were reflective of the country’s uncompromising love for the sport.\nTiwa Savage, Destiny Etiko, and Romelu Lukaku topped their respective categories, revealing Nigerians’ love for top entertainment personalities and athletes.\nSquid Game, the Korean TV series that enthralled the world, topped the category of trending movies and series."
  },
  {
    "headline": "Biafra: Igbo presidency in 2023 will bury agitations in Southeast – Ngige",
    "summarized_story": "Chris Ngige, the Minister of Labour and Employment, has said the zoning of the 2023 presidency to the southeast would end the secession agitation in the region.\nNgige said all the agitations for Biafra and the wounds of the civil war would be permanently healed if an Igbo person emerges as President in the 2023 general election.\nSpeaking with Channels Television, the minister said the Southeast would forgive the entire Nigeria for the “sins” of the civil war.\nHe, however, pointed out that the zoning of the presidency to the Southeast was a sensitive one considering the issues surrounding it.\nThese are the two effective offices or power in any political party,” he added."
  },
  {
    "headline": "Buhari reacts as trailer kills Ojodu Grammar School students in Lagos",
    "summarized_story": "President Muhammadu Buhari has reacted to the killing of students of Ojodu Grammar School in Lagos State.\nBuhari commiserated with the parents, relatives, and friends of the students killed by a trailer in an accident at Isheri Road in Ojodu, Lagos State, on Tuesday.\nThe statement reads: “President Muhammadu Buhari commiserates with parents, relations and friends of Ojodu Grammar School students who lost their lives in an accident on Tuesday, along Isheri Road, Ojodu, in Lagos State.\n“President Buhari condoles with Government and people of Lagos State and the authorities of Ojodu Grammar School over the sad and painful loss of the promising lives that were cut short in the tragic incident.\n“President Buhari prays that the Almighty God will comfort the grieving parents and relations at this very difficult time, and grant the injured quick recovery.”FRSC denies involvement in death of Ojodu Grammar School students"
  },
  {
    "headline": "Nigerian security agents, not ESN, planting bombs in Igboland – IPOB",
    "summarized_story": "The Indigenous People of Biafra, IPOB, on Wednesday, accused Nigerian security agents of planting Improvised Explosive Devices, IEDs, across the Southeast.\nSpokesman of IPOB, Emma Powerful, claimed that the IEDs were planted to implicate its members and militia arm, the Eastern Security Network, ESN.\nPowerful was reacting to a statement by the Nigerian Army and Police that IPOB and ESN planted IEDs in Awo-Mmamma, Oru East Local Government Area of Imo State.\nThis is another desperate but futile attempt by the Nigerian security agencies to implicate IPOB and ESN operatives.\n“For the records, IPOB and ESN operatives never planted, and have no plans to plant IEDs in any part of Biafra land."
  },
  {
    "headline": "Experts call for integration of traditional, modern medical practices",
    "summarized_story": "Medical experts and traditional medicine practitioners have called on the federal and state governments to integrate traditional discoveries and breakthroughs into modern medical practices.\nAtanda noted that traditional medicine is used for the maintenance of health and for the prevention, diagnosis, improvement of physical or mental illnesses.\nWhile listing traditional healers in Africa to include herbalists, traditional birth attendants, traditional surgeons, medicinal ingredients dealers, traditional psychiatrists and therapeutic spiritualists, the TRWASO President added that within the past three decades, there have been changing views of herbs in particular as traditional medicine has moved from that of witches brew to major medicine.\nAs a low-income country, the medical consultant cum herbalist advised the Federal Government to integrate traditional medicine as an important healthcare component.\nThe theme of the seminar was: “Integration of Traditional Discoveries into Modern Medical Practices”."
  },
  {
    "headline": "Zamfara govt designs action plan for artisanal miners",
    "summarized_story": "Zamfara State government said it has taken some stringent measures to address the multiple health issues associated with lead poisoning in the state.\nThis was disclosed by the Secretary to the State Government (SSG), Alhaji Kabiru Balarebe at the opening of a 3 – Day workshop to develop action plan for the control and prevention of lead poisoning associated with artisanal gold mining in the state.\nAccording to him, lead poisoning was discovered by Medicines Sans Frontiers during routine immunization exercise in some mining villages of the southwest of Zamfara State in 2010.\n“It was reported to be one of the worst of its kinds in human history where over 700 children died of the disaster,” he added.\nBello Mohammed Matawalle is committed to maximizing the state’s potentials in the mining sector through the invitation of investment into the mining sector to promote safer mining among artisanal miners."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Gunmen shoot FRSC official dead in Ondo",
    "summarized_story": "An official of the Federal Road Safety Corps (FRSC) Mr. Omiwoye Sunday, has been shot dead while attempting to stop some boys from being attacked.\nOmiwoye had gone to visit a friend at Agbala area in Ondo town along with his wife when the incident occurred.\nWitnesses said he parked his motorcycle in front of his friend’s house when some hoodlums chased some boys to the area and the boys ran towards him.\nHe was said to have attempted to prevent further attacks on the boys when the hoodlums shot him dead.\nSo, two gunmen came with bike and started beating the boys that ran to us."
  },
  {
    "headline": "JUST IN: Buhari swears-in two new RMAFC members",
    "summarized_story": "JUST IN: Buhari swears-in two new RMAFC membersPresident Muhammadu Buhari on Wednesday swore in two new members of the Revenue Mobilisation Allocation and Fiscal Commission (RMAFC), to replace two deceased members.\nThe President performed the brief ceremony before the commencement of the weekly virtual Federal Executive Council (FEC) meeting, held in the Presidential Villa, Abuja.\nAbdulazeez Idris King, from Kogi State, was sworn-in to replace Suleiman Kokori Abdul, while Mohammed Sani Baba, an engineer from Bauchi State, was sworn-in to replace Prof Isa Mohammed.\nRead Also: Buhari keeps Nigerians in suspense over Electoral ActThe weekly FEC meeting is in progress at the Presidential Villa, being presided over by President Buhari.\nSecretary to Government of the Federation, Boss Mustapha and Chief of Staff to the President, Prof Ibrahim Gambari and some ministers are physically attending the meeting, which started at 09:00 GMT."
  },
  {
    "headline": "Young African CEOs meet in Abuja",
    "summarized_story": "The CEOs Network Africa, a forum for young entrepreneurs, is set for its 3rd annual awards ceremony.\nThe December 12 event with the theme: “The emerging generation”, will honour business owners under 30.\nShina Peller, HRH Prince Malik, Ado-Ibrahim, Dr Linus Okorie, Auwal Raphsanjani, among others, are expected to attend.\n“There are several young people doing amazing things and breaking new grounds.\n“The quality of entries proves that young Nigerians and their peers on the continent are indeed resourceful, resilient and hardworking”, Cinwon added."
  },
  {
    "headline": "Police say corpse of robbery victim had stab wounds, bleeding from nose",
    "summarized_story": "Police say corpse of robbery victim had stab wounds, bleeding from noseThe Police on Wednesday testified in an FCT High Court, Kubwa, that an officer took pictures of Chidinma Nwangwu, a robbery victim, with deep cuts and a bleeding nose in the mortuary.\nThe police charged Jibrin, Hamza and Yusuf, with three-count charges bordering on culpable homicide and armed robbery.\n“My boss directed me to follow the complainant to the scene, and from there we proceeded to the Federal Medical Centre Jabi, where I took pictures of the deceased in the mortuary and returned to the office.\nThe prosecution counsel then asked the witness to confirm the pictures she took at the mortuary.\nIn response, she said the photograph showed the deceased bleeding through the nose and the area she was stabbed."
  },
  {
    "headline": "Breaking: Raid on Justice Mary Odili: CJN spits fire, says enough is enough",
    "summarized_story": "The CJN who made reference to the invasion of the official residence of Justice Mary Odili of the Supreme Court, by some security operatives, warned that the silence of the judiciary should never be mistaken for stupidity or weakness.\nJustice Mary Peter Odili, on Friday October 29, 2021, by men suspected to be security operatives, acting on a search warrant purportedly obtained from an Abuja Magistrate’s Court under questionable circumstances.\n” I must make it known to all and sundry that we have had enough dosage of such embarrasments and harassments of our judicial officers across the country and we can no longer take any of such shenanigans.\nThe time to oppress, suppress and intimidate judicial officers is gone.\nNo law permits anyone to invade, subdue or overawe any Nigerian citizen in his or her residence with a flimsy, fraudulently obtained search warrant."
  },
  {
    "headline": "Gunmen kidnap Catholic priest in Ondo",
    "summarized_story": "Joseph Ajayi, the parish priest of St. Peter Clavar, Ilara Mokin, in Ifedore Local Government Area of Ondo State.\nThe abduction of the clergyman was confirmed on by the Catholic Diocese of Ondo.\nA source revealed that the cleric was traveling to Akure, the Ondo State capital from Ikere, Ekiti State, when the hoodlums struck and whisked him away.\nThe Secretary to the Bishop of Ondo Catholic Diocese, Jude Arogundade, Rev.\nVictor Ibiyemi, who confirmed the incident said the abductors had contacted the church, demanding a sum of N20million ransom."
  },
  {
    "headline": "Truck crushes 17 schoolchildren in Lagos",
    "summarized_story": "By Christopher OjiThere was pandemonium yesterday at Ogba area of Lagos as a truck crushed 17 students to death and injured many others.\nThe truck was being chased by the Federal Road Safety Corps (FRSC) officials for violating traffic law, and the driver of the truck sped off to avoid arrest.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\n“The men of FRSC were called upon by passersby to help intervene after the crash had happened.\n“The general public should disregard the disgruntled information being circulated by some unscrupulous elements that FRSC men caused the crash."
  },
  {
    "headline": "Omicron: NCDC confirms 3 new cases as UK detects virus",
    "summarized_story": "This brings the tally of confirmed Omicron cases in Nigeria to six.\nNCDC, in a statement by its Director General, Dr. Ifedayo Adetifa, noted that all the Omicron cases, so far, were detected in persons with recent travel history to South Africa in November.\nNCDC boss confirmed that the UK has formally written to Nigeria on the matter in line with the global health practice.\n“Confirmed Omicron cases as at December 3rd, across some countries are: Nigeria (3 ); Australia (7); Brazil (3); Germany (9) Israel(4); Italy (9) and Netherlands(16).\nComing under order 42 and 52 of the Senate Rules, he noted with satisfaction the efforts of the Nigerian government in the containment and treatment of COVID-19 cases."
  },
  {
    "headline": "Court refuses to vacate order stopping FG from deducting state govts’ monies over $418m Paris Club",
    "summarized_story": "A Federal High Court, Abuja, yesterday, declined to vacate its order restraining the Federal Government from deducting monies accruing to the 36 states from the federation account to settle $418 million judgment debt in relation to Paris Club Refund.\nThe court had also ruled that the restraining order would subsist pending the determination of the substantive suit.\nAt the resumed hearing, counsel to the plaintiffs, Okutekpa told the court that the matter was slated for hearing.\nOke, who told the court that his clients were affected by the order, urged the court to take their application seeking for the order to be vacated.\nAfter taking all the arguments, Justice Ekwo noted that the restraining order was made subject to the motion on notice filed by the plaintiffs."
  },
  {
    "headline": "Archbishop of Canterbury Condemns Nigeria’s Red Listing, Calls It Travel Apartheid",
    "summarized_story": "The Red chamber at plenary accordingly, called on the British authorities to consider removing Nigeria from the red list.\nThe only people allowed to enter the UK from these countries are UK or Irish nationals, or UK residents.\nHe, therefore, called on the British Parliament to intervene with a view to having Nigeria removed from the country’s COVID-19 red list.\nNCDC had previously announced the detection of three cases of omicron variant on December 2021.\nThe Centre however maintained that the Delta variant has remained the dominant variant than the new omicron variant."
  },
  {
    "headline": "Equinix to Acquire MainOne in $320m Deal",
    "summarized_story": "Emma OkonjiWith the successful acquisition of GPX India and 13 Bell Data Centers in Canada, Equinix, one of the world’s digital infrastructure companies, yesterday announced its expansion into Africa through a deal to acquire MainOne, a West African data centre and connectivity solutions provider.\nEquinix believes MainOne to be one of the most exciting technology businesses to emerge from Africa.\n“Upon closing, these facilities will add more than 64,000 gross square feet of space to Platform Equinix, with 570,000 square feet of land for future expansions,” it added.\nWhen completed, this acquisition will extend Platform Equinix into West Africa, giving organisations based inside and outside of Africa access to one of the world’s fastest growing markets,” it stated.\nSpeaking about the planned acquisition, President and CEO, Equinix, Charles Meyers, said: “The acquisition of MainOne will represent a critical point of entry for Platform Equinix into the expansive and rapidly growing African market."
  },
  {
    "headline": "Buhari Flags Off $300m Afreximbank’s Medical Centre, Laments Brain Drain",
    "summarized_story": "•Facility to save $7bn annual medical tourism spending, says OramahDeji Elumoye andEmmanuel Addeh in AbujaPresident Muhammadu Buhari yesterday conducted the official take-off of the planned $300 million African Medical Centre of Excellence (AMCE) to be implemented in Abuja by the Benedict Oramah-led African Export–Import Bank (Afreximbank).\nAt the event which he attended virtually, the president who decried the rising cases of non-communicable diseases like cancer, noted that unfortunately, West African countries lacked the wherewithal to deal with such aliments.\n“The rising NCD burden coupled with inadequate medical infrastructure on the continent threatens the future of our people.\nRight now, many hospitals in the West African region are underfunded, underequipped, understaffed and relatively inaccessible to most patients especially from rural areas,” he stated.\n“The partnership with King’s College Hospital will increase locally available clinical capabilities, provide education and training, relying on KCH’s two centuries’ of experience in providing specialist healthcare services, medicine, and medical research."
  },
  {
    "headline": "SEC: Identity Management Will Resolve Unclaimed Dividends, Other Issues",
    "summarized_story": "Udora Orizu in AbujaThe Securities and Exchange Commission (SEC) has disclosed that it was engaging relevant stakeholders in a bid to resolve issues of identity management which would assist in solving the rising unclaimed dividends in the capital market as well as other issues.\nHe explained that part of the problems of unclaimed dividends had to do with identity management, saying the Commission was engaging the registrars and increasing investors’ education to stem the trend.\nAccording to Yuguda, the Commission has set up an identity management committee to harmonise various databases of investors and facilitate data accuracy in the market.\nYuguda said the committee’s assignment would address the challenges of identity management and help tackle some of the issues of unclaimed dividends, direct cash settlement and multiple subscriptions.\n“We will continue to engage with the Commission to attain the progress we desire for our capital market”, the lawmaker saidShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "$418m Paris Club Refund: Court to Hear Governors’ Suit against Payment to Consultants December 13",
    "summarized_story": "The adjournment was made after the court granted an exparte application by the governors to regularise their processes that were filled out of time.\nMeanwhile the court held that its earlier order restraining the federal government from going ahead with its planned deduction from the states’ account in respect of the said payment still subsists.\nThe court made the clarification after attempts to make the court vacate the restraining order failed.\nChief Woke Olanipekun who represented the 14th defendant had urged the court to vacate the November 5 order in line with the rules of the court.\nThe governors accused the president of approving the payment without considering their call for a forensic audit into the claims of the creditors."
  },
  {
    "headline": "BREAKING: Court Orders Secret Police, DSS To Pay Human Rights Activist, Sowore N2 Million, Apologise Over Illegal Seizure Of Phones",
    "summarized_story": "A Federal High Court sitting in Abuja has ordered the Department of State Services (DSS) to pay N2,000,000 to human rights activist, Omoyele Sowore for breach of his fundamental rights.\nSowore, the publisher of SaharaReporters, had instituted a suit against the DSS to compel the agency to return his phones seized since August 2019 when he was first arrested.\nIn a judgment delivered on Wednesday, Justice Anwuli Chikere described the action of the secret police as illegal and a violation of the activist’s rights.\nThe activist’s lawyer, Mrs Funmi Falana had prodded the DSS lawyer on the illegality of the seizures when the case came up on December 1.\nThe DSS had told Justice Chikere that the phones were “recovered” during his arrest and not seized."
  },
  {
    "headline": "BREAKING: Court Orders Secret Police, DSS To Pay Human Rights Activist, Sowore N2 Million, Apologise Over Illegal Seizure Of Phones",
    "summarized_story": "A Federal High Court sitting in Abuja has ordered the Department of State Services (DSS) to pay N2,000,000 to human rights activist, Omoyele Sowore for breach of his fundamental rights.\nSowore, the publisher of SaharaReporters, had instituted a suit against the DSS to compel the agency to return his phones seized since August 2019 when he was first arrested.\nIn a judgment delivered on Wednesday, Justice Anwuli Chikere described the action of the secret police as illegal and a violation of the activist’s rights.\nThe activist’s lawyer, Mrs Funmi Falana had prodded the DSS lawyer on the illegality of the seizures when the case came up on December 1.\nThe DSS had told Justice Chikere that the phones were “recovered” during his arrest and not seized."
  },
  {
    "headline": "How NPower, Cash Transfer, Other Programmes By Humanitarian Affairs Minister, Farouq Ended In Massive Frauds – Report",
    "summarized_story": "The report also revealed that the Minister of Humanitarian Affairs, Disaster Management and Social Development, Sadiya Umar Farouq, allegedly used cronies to siphon funds under the various social intervention programmes of the Federal Government.\n“The National Emergency Management Agency, a parastatal under the Humanitarian Affairs ministry, has been adjudged the worst in terms of violating procurement processes.\nThe report stated that the various social intervention programmes under the humanitarian ministry had been highly politicised and turned into a cash cow by officials of the Ministry of Humanitarian Affairs, Disaster Management and Social Development.\n“The NPower scheme was also not left out of the scrutiny of the CME; it stated that the NPower scheme had fallen short of standards.\nThis, according to the Centre for Monitoring and Evaluation, led to it to commission a report into the activities of the Humanitarian Affairs Ministry and the parastatals under it."
  },
  {
    "headline": "How NPower, Cash Transfer, Other Programmes By Humanitarian Affairs Minister, Farouq Ended In Massive Frauds – Report",
    "summarized_story": "The report also revealed that the Minister of Humanitarian Affairs, Disaster Management and Social Development, Sadiya Umar Farouq, allegedly used cronies to siphon funds under the various social intervention programmes of the Federal Government.\n“The National Emergency Management Agency, a parastatal under the Humanitarian Affairs ministry, has been adjudged the worst in terms of violating procurement processes.\nThe report stated that the various social intervention programmes under the humanitarian ministry had been highly politicised and turned into a cash cow by officials of the Ministry of Humanitarian Affairs, Disaster Management and Social Development.\n“The NPower scheme was also not left out of the scrutiny of the CME; it stated that the NPower scheme had fallen short of standards.\nThis, according to the Centre for Monitoring and Evaluation, led to it to commission a report into the activities of the Humanitarian Affairs Ministry and the parastatals under it."
  },
  {
    "headline": "Lagos Students Storm Streets To Protest Death Of Colleagues Crushed By Truck",
    "summarized_story": "Students of Babs Fafunwa Millennium Secondary School, Ogba, Lagos State, accompanied by some of their parents flooded the streets on Wednesday to protest the death of their mates.\nAn articulated truck crushed some pupils on their way home from the school on Tuesday.\nAccording to the Lagos State Police Command, two pupils died and 12 were injured in the truck accident.\nThe pupils were eventually allowed to go home, but they took to the streets in protest.\nPolicemen were seen yesterday shooting in the school compound after the students protested, an action which was profoundly condemned by the general public."
  },
  {
    "headline": "Riders to pay more as Bolt introduces 3% booking fee",
    "summarized_story": "Riders seeking e-hailing services will have to pay more on all rides as Bolt introduced an additional 3 percent booking fee.\nAdvertisementIn a service update sent to customers on Wednesday, the company said the booking fee was necessary due to an “increase in operating costs”.\nWith this, for every ride of N3,000, Bolt users will pay an extra fee of N90, including a previous N20 flat rate.\n“From December 8th, 2021, we’re introducing a 3% booking fee on all trips.\n“As an active bolt user, I’d say that this booking fee of 3 percent or whatever is quite unnecessary and should be discarded.”Desmond, a multimedia producer, said Bolt should have consulted or informed customers about the new development."
  },
  {
    "headline": "Riders to pay more as Bolt introduces 3% booking fee",
    "summarized_story": "Riders seeking e-hailing services will have to pay more on all rides as Bolt introduced an additional 3 percent booking fee.\nAdvertisementIn a service update sent to customers on Wednesday, the company said the booking fee was necessary due to an “increase in operating costs”.\nWith this, for every ride of N3,000, Bolt users will pay an extra fee of N90, including a previous N20 flat rate.\n“From December 8th, 2021, we’re introducing a 3% booking fee on all trips.\n“As an active bolt user, I’d say that this booking fee of 3 percent or whatever is quite unnecessary and should be discarded.”Desmond, a multimedia producer, said Bolt should have consulted or informed customers about the new development."
  },
  {
    "headline": "Two killed, many injured as gunmen attack Imo community",
    "summarized_story": "Two persons have been reportedly killed following an attack on Etekwuru community, Ohaji-Egbema LGA of Imo state.\nKenneth Okereke, the traditional ruler of the community, confirmed the attack to TheCable on Wednesday morning, and called for security operatives to be deployed in the area.\nMichael Abattem, police spokesperson in Imo state, did not respond to calls and text messages to comment on the attack.\nThe attack comes weeks after gunmen reportedly attacked the palace of the traditional ruler and set ablaze his vehicle.\nIn October, three traditional rulers were killed after gunmen invaded Nnenasa community, Njaba LGA of the state."
  },
  {
    "headline": "Two killed, many injured as gunmen attack Imo community",
    "summarized_story": "Two persons have been reportedly killed following an attack on Etekwuru community, Ohaji-Egbema LGA of Imo state.\nKenneth Okereke, the traditional ruler of the community, confirmed the attack to TheCable on Wednesday morning, and called for security operatives to be deployed in the area.\nMichael Abattem, police spokesperson in Imo state, did not respond to calls and text messages to comment on the attack.\nThe attack comes weeks after gunmen reportedly attacked the palace of the traditional ruler and set ablaze his vehicle.\nIn October, three traditional rulers were killed after gunmen invaded Nnenasa community, Njaba LGA of the state."
  },
  {
    "headline": "Report: 1m doses of AstraZeneca COVID vaccine expired in Nigeria in November",
    "summarized_story": "Up to one million COVID-19 vaccines are estimated to have expired in Nigeria in November, a report by Reuter’s says.\nAdvertisementAccording to the report, two sources with direct knowledge of vaccine delivery and use, said the expired doses were made by AstraZeneca and supplied via COVAX from Europe.\nIn a statement responding to Reuter’s questions, WHO said doses had expired, but declined to give a figure.\nOn August 16, Nigeria took delivery of 699,760 doses of AstraZeneca COVID-19 vaccine donated by the UK — the second delivery of the vaccine brand after the first batch was exhausted.\nThe UK donated 592,880 additional doses of the AstraZeneca COVID-19 vaccine to Nigeria on August 27."
  },
  {
    "headline": "Equinix in talks to acquire West African digital infrastructure firm MainOne",
    "summarized_story": "The company owns and operates an extensive submarine network extending 7,000 kilometers from Portugal to Lagos, Accra, and along the West African coast, with landing stations in Nigeria, Ghana, and Côte d’Ivoire.\nThese provide connectivity to and from Europe, West African countries, and the major business communities in Nigeria.\nMainOne also owns digital infrastructure assets that include three operational data centers, with an additional facility under construction expected to open in Q1 2022.\nGiven the huge supply gap in digital infrastructure in sub-Saharan Africa, Ayobami Omole, a Lagos-based telecom analyst at Tellimer, expects more of such transactions in the coming years.\nWhen completed, the acquisition will extend Platform Equinix into West Africa."
  },
  {
    "headline": "Earnipay is improving financial well-being for salaried employees",
    "summarized_story": "In Nigeria, wages for formal-sector employees are paid monthly; in the informal sector, however, this is paid daily.\nNow, when salaried employees go broke between paydays, they have three options: borrow, take a loan, or request a salary advance.\nEarnipay, a fintech solution, founded by Nonso Onwuzulike, allows employees flexible access to their accrued salaries on any day of the month.\nCommenting on Earnipay’s plans for 2022, Onwuzulike said, “Our goal is to partner with employers to improve employee financial well-being.\nIn addition to flexible salary access, we provide financial education to advise employees on best practices to manage their finances, and other products to assist them daily.”Share this article"
  },
  {
    "headline": "TradeDepot secures $110m to expand Buy-Now-Pay-Later to more African retailers",
    "summarized_story": "The fund will support the delivery of Buy-Now-Pay-Later (BNPL) services to 5 million SME retailers and drive further expansion of its merchant platform across the continent.\nThe debt funding was led by Arcadia Funds.\nIn Africa, SME retailers generate $1 trillion in sales annually and contribute $2.6 trillion to the continent’s nominal GDP.\nTradeDepot has grown from over 40,000 merchants on its platform last year to more than 100,000 merchants.\nBut, as for TradeDepot, it wants to capture more than 5 million SMEs as it continues to leverage and expand its BNPL offering in the 12 cities it’s currently operating in."
  },
  {
    "headline": "MTN Nigeria issues 575m shares through digital public offer",
    "summarized_story": "Nigeria’s biggest telco, MTN Nigeria, has announced that starting from Wednesday, 1 December 2021, retail investors can purchase up to 575 million shares held in MTN Nigeria at ₦169 per share—lower than its share price on the stock market.\nThis public offer is in line with MTN Group’s commitment to reduce its shareholding in MTN Nigeria from 78.8% to 65% over time.\nNotably, this public offer is primarily digital as the shares can be purchased online.\nBolaji Balogun, CEO of Chapel Hill Denham, an investment banking firm leading the public offering, explained this to TechCabal.\nIn response to this public offering announcement, MTN Nigeria’s share price fell 10% on Wednesday to a five-week low, a logical response as investors rushed to buy the lower-priced MTN public offering shares."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "Adedeji Olowe is building a global reputation as Africa’s open banking leader",
    "summarized_story": "Adedeji Olowe saw all this and decided to do something about the challenges in the industry.\nChatting with Adedeji Olowe in his Lekki Phase 1 homeThe father of three has helped many people build companies.\nOlowe leads Trium, a venture capital firm, and is seen globally as the leader of open banking in Africa.\nDespite Africa being slow to enact open banking regulations like other developing regions, he believes now is the time to catch up with Europe and Asia.\nHe sent an email with a call to action, “Let there be open banking!” to all his friends."
  },
  {
    "headline": "Techpoint Awards 2021: And the nominees are…",
    "summarized_story": "Share this article:On October 21, 2021, Techpoint Africa called for preliminary nominations for the second edition of Techpoint Awards (Nigerian edition), one of the events lined up for Techpoint Build 2021 scheduled to hold in January 2022.\nAfter carefully looking into entries for the blockchain category, the award committee decided to split it into two sub-categories:As with the inaugural edition, Techpoint Awards 2021 is grouped under three categories: Nomination-only, Users’ Choice, and Techpoint Editorial Choice.\nMost Outstanding Logistics Startup 2021This category is for startups that did an excellent job addressing logistics challenges in Nigeria between January 2021 and now.\nNewbie of the year 2021This category is for startups founded in 2021 with impressive traction and milestones.\nNigerian App of the Year 2021This category is for user-favourite apps built by Nigerians for Nigerians in 2021."
  },
  {
    "headline": "MainOne’s acquisition, Flow’s solution for real estate, and HAVAIC’s plan for African entrepreneurs",
    "summarized_story": "Read more: US-based Equinix to acquire Nigeria’s MainOne for $320mHow Flow is automating real estate advertisingDaniel Levy and Gil Sperling.\nYeah, real estate businesses left the chat.\nFlow uses an API to do this for real estate businesses.\nReal estate agents simply log in to Flow’s web portal, where they pick the properties they wish to list, and an ad is automatically created.\nAdvertisementAlready, the startup is serving 4,000 real estate agents — a number that is reportedly 10% of the real estate agents working in the country."
  },
  {
    "headline": "Nigeria raises most startup capital but isn’t Africa’s prime investment destination",
    "summarized_story": "Despite this feat, Nigeria has dropped from Africa’s top 10 investment destinations to 14 as Egypt remains the number one nation.\nThis is according to a report by RMB, a division of FirstRand Bank Limited, titled ‘Where to Invest in Africa 2021’.\nIn 2014, Nigeria ranked as number two and dropped to number five in 2015.\n“The sheer size of Nigeria’s economy and large population base has undoubtedly aided the country’s economic environment and has led to an increase in investments in the economy over the past 10 years,” the company said.\nThis inclusion aimed to score governments’ fiscal positions and provided a basis from which investors can understand specific jurisdictions,” Kavishe said."
  },
  {
    "headline": "Coronavirus induced school closures cost students $17trn in lifetime earnings – World Bank",
    "summarized_story": "The COVID-19 pandemic-related school closures have been estimated to cost this generation of students $17 trillion in lifetime earnings, or about 14 percent of today’s global GDP, according to a new report by the World Bank, UNESCO, and UNICEF.\n“The COVID-19 crisis brought education systems across the world to a halt,” said Jaime Saavedra, global director for education at the World Bank.\n“Now, 21 months later, schools remain closed for millions of children, and others may never return to school.\nThe report also shows that many school children may never return to school post-crisis.\nStudents aged 15-18, for whom education is no longer compulsory, were 11 percentage points less likely to go back to school,” the report stated."
  },
  {
    "headline": "COVID-19 protocols: FG to ban airlines over non-compliance",
    "summarized_story": "The Federal Government has said that non-compliance to pre-boarding requirements would attract a penalty of $3,500 per passenger while airlines that consistently fail to comply with laid down COVID-19 protocols would be banned from flying into Nigeria.\nThis was contained in a circular issued to all airline operators by the Federal Government through the Nigeria Civil Aviation Authority (NCAA) titled, ‘Revised Provisional Quarantine Protocol for Travellers Arriving or Departing Nigeria,’ stating that airlines are only to board passengers flying into Nigeria who are in possession of a paid travel permit with a QR Code and result of negative COVID-19 PCR test done not later than 48 hours from the time of boarding.\nAccording to the circular, for any inbound passenger who is unable to either make payment for his/her repeat PCR tests or generate a paid permit to travel via the Nigerian International Travel Portal (NITP), airlines are to send an email to designated government emails for necessary assistance.\nRead also: UK travel ban: Airlines risk N965m daily“For outbound passengers, airlines are only to board passengers travelling out of Nigeria with evidence of either full vaccination for COVID-19 or result of negative COVID-19 PCR test done at Nigeria Centre for Disease (NCDC) accredited private laboratories not later than 48 hours from the time of boarding,” the circular added.\nThe NCAA stated that the All-Operator’s letter (AOL) is to convey to all airlines operating international flights into and out of Nigeria the revised provisional quarantine protocol for travellers arriving and departing the country as issued by the Presidential Steering Committee on COVID-19."
  },
  {
    "headline": "JAILBREAKS AND YEMI ADEBOWALE NEGATIVE CRITICISM – Nigerian Observer",
    "summarized_story": "Yemi Adebowale used Thisday Newspaper platform to fight Aregbesola as governor of Osun State.\nYemi Adebowale is unaware that of late, there had been series of attacks on military, police and correctional centres facilities.\nAdebowale is ignorant of the fact that the military and police provide security for our correctional centres across Nigeria.\nThey will provide Armored Personnel Carriers (APC) and some other sophisticated weapons that can help us to fortify correctional facilities.\nAnd the buffer area is not supposed to be less than 200 meters round the correctional facilities."
  },
  {
    "headline": "Armed Men Kidnap Varsity Students ,Five Others In Delta – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – Four students of the Delta State University, (DELSU) Abraka, along with five others whose identities were still sketchy as at press time, have been reportedly kidnapped along the Eku- Abraka Road in Ethiope East Local government area of Delta State.\nThe victims, said to have recently written their final exams, were reportedly abducted along Abraka-Eku road, Ethiope East Local Government Area of the state last Saturday.\nThe names of the students kidnapped were given as Arogbo Harriet Seyifunmi, Azunobi Prosper, Miracle Etavbwobor Robert (all 500 level students of the Department of SLT Chemistry as well as Adegor Aghogho Hapiness, a 500 level student of Electrical Engineering.\nMeanwhile, the DELSU Students Union Government (SUG) led by the president, Comrade Solomon Mukoro, has condemned the abduction.\nComrade Mukoro, however, urged all students of DELSU to “remain calm and not endanger the lives of the kidnapped persons, as we are doing all we can to rescue the abducted students."
  },
  {
    "headline": "Obaseki commiserates with Ivbiaro community over death of clan head, Elabor – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Tuesday, led top government functionaries to commiserate with the people of Ivbiaro Afeshotor in Owan East Local Government Area of Edo State over the death of their clan head, His Royal Highness (HRH) Alhaji Salufu Elabor.\nThe late traditional ruler retired as a colonel in the Nigeria Army in 1995 and ruled Ivbiaro for over two decades.\nPhilip Shaibu; Chief of Staff, Osaigbovo Iyoha and Deputy Chief of Staff, Jimoh Ijegbai, among other top government officials.\nThe governor described the late traditional ruler as a friend of his administration, noting that his support and prayers contributed immensely to his victory in last year’s gubernatorial election.\nThe spokesman for the Ivbiaro Afeshotor people, the Enode of Ivbiaro, Chief Kassim Ozeto, thanked the governor for the visit, noting that the people appreciate him and his entourage."
  },
  {
    "headline": "Obaseki swears in two Special Advisers, 24 Senior Special Assistants, others in Edo North – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Tuesday, swore in two Special Advisers, 24 Senior Special Assistants and 64 Special Assistants in Edo North Senatorial District.\nDuring the inauguration ceremony in Etsako-West Local Government Area of Edo State, Governor Obaseki said the appointments followed harmonization by leaders and members of the Peoples Democratic Party (PDP) in the senatorial District.\nAccording to him, “We have harmonized PDP in Edo North Senatorial District as the party is now one in the area.\n“We have focused on political development in Edo North as it is treated as a special axis with three Political Advisers against one in Edo South and Central senatorial districts.\nWe are working to make PDP dominate in Edo North."
  },
  {
    "headline": "SEC DG says Identity Management Will Resolve Unclaimed Dividends, other Issues",
    "summarized_story": "OBINNA EZUGWUThe Director General of Securities and Exchange Commission (SEC), Lamido Yuguda has has said the Commission is engaging relevant stakeholders in a bid to resolve issues of identity management which will assist in solving the rising unclaimed dividends in the capital market as well as other issues.\nYuguda pointed out that part of the problems of unclaimed dividends has to do with identity management, saying the Commission is currently engaging the registrars’ stakeholders and increasing investors’ education to stem the trend.\nAccording to Yuguda, the Commission has set up an identity management committee to harmonise various databases of investors and facilitate data accuracy in the market.\nHe said the committee comprises the SEC, the registrars, the stockbrokers, the issuing houses, the CSCS, and NSE, in addition to the e-dividend management committee.\nYuguda said the committee’s assignment would address the challenges of identity management and help tackle some of the issues of unclaimed dividends, direct cash settlement and multiple subscriptions."
  },
  {
    "headline": "FMDQ calls for development of products for millennials to deepen capital market retail participation",
    "summarized_story": "As a way to increase the inclusion rate in the Nigerian capital market, stakeholders have canvassed for the introduction of “sachet” sized technology driven products that would drive increased retail investors patronage in the capital market particularly the younger generation.\n“Here we are talking about capital market, a small aspect of financial inclusion.\n“Even big men in Nigeria want to buy things that are very small and we have to replicate the sachet size model in the capital market.\nIt has worked in everything it is applied to in this country so why don’t we in the capital market adopt it,” Onadele said.\nHe said market stakeholders needed to design investment products to align with financial inclusion strategies to get to the hinter land."
  },
  {
    "headline": "NGX Regulation to Host Issuers Engagement Forum",
    "summarized_story": "In fulfilling its commitment to maintain excellent service delivery and provide solutions in line with stakeholders’ needs, NGX Regulation Limited (NGX RegCo) will host its Issuers’ Engagement Forum on Tuesday, 14 December 2021.\nHosted by the Chief Executive Officer, NGX RegCo, Ms. Tinuade Awe, the virtual event with the theme, Corporate Disclosures: Beyond Numbers, will give Issuers an opportunity to interact with NGX RegCo in order to share experiences and gain insights into emerging and global trends even as we move quickly in the New Year.\nGiven that the session will be interactive, participants will also have the opportunity to discuss their concerns over Issuers’ post-listing obligations and intimate NGX RegCo on where they might require support in maintaining compliance with the rules and regulations of Nigerian Exchange Limited.\nIn ensuring an enriching discussion at the event, NGX RegCo has brought together a panel of internationally acclaimed professionals in the fields of Sustainable Finance, Sustainability Reporting and Integrated Reporting to facilitate conversations around reporting in the new disclosure regime.\nThe Keynote Speaker at the session will be Professor Kenneth Amaeshi, Visiting Professor of Leadership & Financial Markets in Africa & London, School of Economics & Political Science."
  },
  {
    "headline": "HealthPlus launches ePharmacy to connect patients with pharmacists online",
    "summarized_story": "HealthPlus Limited has launched a digital prescription platform, ePharmacy, where Nigerians can get access to certified pharmacists online.\nAt the unveiling of the platform on Tuesday in Lagos, HealthPlus said the application would facilitate interaction between patients (customers) and health-service providers nationwide.\n“Pharmacists are the first point of care for many Nigerians and are critical to ensure access to essential drugs,” Okoro said.\n“The HealthPlus ePharmacy platform is following the mission to enhance access to wholesome medicines and good pharmacy care services.\nWith 140 million internet subscribers in Nigeria, HealthPlus said it is now able to connect more Nigerians to qualified pharmacists and fast-track the provision of efficient health care."
  },
  {
    "headline": "Unlawful Appointment: Party Writes NJC, Seeks Suspension Of Imo Ag. CJ",
    "summarized_story": "A political party, Action People Party, (APP), has written a petition to the National Judicial Council (NJC), over the unlawful appointment of Justice T.E.\nChikeka, as the acting Chief Judge of Imo state.\n“We wish to invite your noble attention to the fact that in the Imo State Judiciary.\nHonourable Justice |.\nbut nevertheless connived with the Imo State Governor and illicitly presented herself to be swom-in as the Acting Chief Judge of the State."
  },
  {
    "headline": "Unlawful Appointment: Party Writes NJC, Seeks Suspension Of Imo Ag. CJ",
    "summarized_story": "A political party, Action People Party, (APP), has written a petition to the National Judicial Council (NJC), over the unlawful appointment of Justice T.E.\nChikeka, as the acting Chief Judge of Imo state.\n“We wish to invite your noble attention to the fact that in the Imo State Judiciary.\nHonourable Justice |.\nbut nevertheless connived with the Imo State Governor and illicitly presented herself to be swom-in as the Acting Chief Judge of the State."
  },
  {
    "headline": "Secondus: S/Court Orders Substituted Service On PDP, Others",
    "summarized_story": "Supreme Court has ordered that all processes relating to and emanating from the appeal filed by the former national chairman of the Peoples Democratic Party (PDP), Prince Uche Secondus, challenging his removal from office, be served on all the defendants through substituted means.\nThe apex court ordered that the process should be pasted on the walls of the head office of the party at Wadata House, Abuja.\nThe order of the court followed an ex-parte moved by counsel to Secondus, Chief Oba Maduabuchi (SAN).\nThe Court of Appeal sitting in Port Harcourt, had on October 26 dismissed an application challenging the suspension of Secondus from the (PDP.\nADVERTISEMENTA panel of three justices led by Justice Haruna Tsammani struck out the suit during its sitting in the Rivers State capital."
  },
  {
    "headline": "Secondus: S/Court Orders Substituted Service On PDP, Others",
    "summarized_story": "Supreme Court has ordered that all processes relating to and emanating from the appeal filed by the former national chairman of the Peoples Democratic Party (PDP), Prince Uche Secondus, challenging his removal from office, be served on all the defendants through substituted means.\nThe apex court ordered that the process should be pasted on the walls of the head office of the party at Wadata House, Abuja.\nThe order of the court followed an ex-parte moved by counsel to Secondus, Chief Oba Maduabuchi (SAN).\nThe Court of Appeal sitting in Port Harcourt, had on October 26 dismissed an application challenging the suspension of Secondus from the (PDP.\nADVERTISEMENTA panel of three justices led by Justice Haruna Tsammani struck out the suit during its sitting in the Rivers State capital."
  },
  {
    "headline": "$418m Paris Club Refund: Court Refuses To Vacate Order Against Federal Govt",
    "summarized_story": "A Federal High Court sitting in Abuja headed by Justice Inyang Ekwo has refused to vacate a restraining order against the federal government stopping the deduction of $418 million Paris Club refund from bank accounts of the 36 states of the federation.\nJustice Ekwo held that the order subsists until the motion for interlocutory injunction filed by the states against the federal government is heard and determined.\nThe judge, during proceedings yesterday, permitted the plaintiffs (36 states) to regularise processes that were filled out of time.\nThe court also granted permission for substituted service on some of the defendants who allegedly refused to accept court processes.\nJustice Ekwo had on November 5 stopped the federal government from going ahead to deduct the $418million dollars from the bank account of the 36 states governments."
  },
  {
    "headline": "Alleged $8.4m Fraud: Court Adjourns Fred Ajudua’s Trial Till Feb.15",
    "summarized_story": "By JUMOKE SANNIJustice Josephine Oyefeso of the State High Court sitting in Ajah, Lagos has adjourned till February 15, 2022 further hearing in the trial of Fred Ajudua for an alleged $8.4million fraud.\nThe adjournment followed a claim by the defence that Ajudua had tested positive for the Coronavirus Disease, COVID-19 on December 3, 2021.\nAt the sitting on Monday, December 6, a counsel from the Chambers of Olalekan Ojo, SAN, who appeared for the defendant, claimed that Ajudua had contracted COVID-19.\nAtteh applied to the Court that the documents, which the counsel claimed were the results of the COVID tests, be filed in the Court and served on the prosecution.\nThe case was adjourned till February 15, 2022 for continuation of trial."
  },
  {
    "headline": "Alleged $8.4m Fraud: Court Adjourns Fred Ajudua’s Trial Till Feb.15",
    "summarized_story": "By JUMOKE SANNIJustice Josephine Oyefeso of the State High Court sitting in Ajah, Lagos has adjourned till February 15, 2022 further hearing in the trial of Fred Ajudua for an alleged $8.4million fraud.\nThe adjournment followed a claim by the defence that Ajudua had tested positive for the Coronavirus Disease, COVID-19 on December 3, 2021.\nAt the sitting on Monday, December 6, a counsel from the Chambers of Olalekan Ojo, SAN, who appeared for the defendant, claimed that Ajudua had contracted COVID-19.\nAtteh applied to the Court that the documents, which the counsel claimed were the results of the COVID tests, be filed in the Court and served on the prosecution.\nThe case was adjourned till February 15, 2022 for continuation of trial."
  },
  {
    "headline": "Polaris Bank, Eventful Lift three firms with business expansion grants at The Fashion Souk",
    "summarized_story": "Aside the business pitch winners, special prizes were also given to the Most Original Store and Best Decorated Store at the Fashion Souk.\nThe winners were given equipment grants by Polaris Bank to further expand their businesses.\nThe objective of sponsoring the Fashion Souk according to Polaris Bank, was a reinforcement of its support to SMEs as the catalyst for propelling the growth of the Nigerian economy.\nNigeria’s fashion sub-sector has huge and untapped potentials capable of reducing the rate of unemployment in the country.\nAccording to statistics by the Fashion Association Designers of Nigeria (FADAN), Nigeria’s fashion industry is valued at $10 billion."
  },
  {
    "headline": "Polaris Bank, Eventful Lift three firms with business expansion grants at The Fashion Souk",
    "summarized_story": "Aside the business pitch winners, special prizes were also given to the Most Original Store and Best Decorated Store at the Fashion Souk.\nThe winners were given equipment grants by Polaris Bank to further expand their businesses.\nThe objective of sponsoring the Fashion Souk according to Polaris Bank, was a reinforcement of its support to SMEs as the catalyst for propelling the growth of the Nigerian economy.\nNigeria’s fashion sub-sector has huge and untapped potentials capable of reducing the rate of unemployment in the country.\nAccording to statistics by the Fashion Association Designers of Nigeria (FADAN), Nigeria’s fashion industry is valued at $10 billion."
  },
  {
    "headline": "Army helicopter with chief of defence staff aboard crashes",
    "summarized_story": "An Indian army helicopter carrying Chief of Defence Staff Bipin Rawat and his family has crashed in Tamil Nadu.\nNDTV reported that some defence officials were among the 14 people on the Mi-series helicopter.\nRawat is the country’s first Chief of Defence Staff appointed on January 1, 2019.\n“An IAF Mi-17V5 helicopter, with CDS Gen Bipin Rawat on board, met with an accident today near Coonoor, Tamil Nadu.\nDefence Minister Rajnath Singh has informed Prime Minister Narendra Modi about the developments."
  },
  {
    "headline": "ASUU prepares to shut down universities",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has said it has commenced consultation with its branches across the country to agree on the shutting down of public universities.\nThis follows the expiration of its three week ultimatum to the Federal Government to meets its demands.\nASUU’s National President, Prof. Emmanuel Osodeke who spoke in an interview on Tuesday lamented that the ultimatum ended on Sunday without a single effort from the Federal Government to address their demands.\nThe union president said they are ready to take action immediately the ongoing consultation with branches is concluded within the week.\n“There are many issues we raised which the government has not addressed and until they do that, we are ready to take action.”"
  },
  {
    "headline": "BREAKING: Lagos Shuts Ojodu School After Fatal Truck Accident Until 2022",
    "summarized_story": "The Lagos State Government has shut down Bab Fafunwa Millennium School, Ojodu, formerly Ojodu Grammar School until January 2022.\nEducation commissioner Folashade Adefisayo announced this when she visited the school on Wednesday morning.\nYesterday, a speeding truck rammed into some of the school’s students, killing two and injuring 12, according to the police.\nSome reports, citing eyewitnesses, put the death toll at 17.\nReports claimed that the truck driver, who has since been arrested, was being chased by officers of the Federal Road Safety Commission (FRSC)."
  },
  {
    "headline": "Tears As Parents Storm Ojodu Grammar School This Morning Searching For Their Children (Video)",
    "summarized_story": "Parents and siblings this morning Storm Ojodu Grammar School after a delivery truck kills over 17 students in Lagos .\nIt was seen in the video below that Parents stood in the front of the schools with tension and fear for the search of their children.\nAs it was ealier reported by NEWS DIRECT, A truck on Tuesday afternoon at Grammar School Bus Stop, Along Ogba-ojodu Berger Road Lagos when a white delivery truck, allegedly chased by officials of Lagos State Traffic Management Agency LASTMA rammed into school children returning back from school killing seventeen in the process.\nAlso NEWS DIRECT gathered that the school children who are pupils from Grammar school, were coming back from school when the truck driver who was attempting to escape from the officials rammed into them.\nWatch video below"
  },
  {
    "headline": "42 People Were Roasted Alive In Sokoto Yet No Outcry – Shehu Sani Laments.",
    "summarized_story": "Senator Shehu Sani has bemoaned the current government’s failure to address security issues across the country.\nAccording to him, those who are keeping mum in the incessant killings are not different from the assailants.\n“Those who are silent are same as those who are indifferent; those who are indifferent are same as those who perpetrated that crime.\n“Nowhere in the World are human lives so cheap, dispensable and disposable”.\nDAILY POST reports that armed bandits on Tuesday ambushed some travellers on a road linking Sabon Birni local government area and the village of Gidan Bawa in the State and burnt them alive."
  },
  {
    "headline": "Lai Mohammed Has Enhanced Nigeria’s Image — President Buhari",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), has praised Lai Mohammed, the Minister of Information and Culture, for fostering understanding and improving the country’s image.\nBuhari’s felicitation is contained in a statement by his Special Adviser on Media and Publicity, Femi Adesina, titled ‘President Buhari hails Lai Mohammed at 70’.\n“As a party stalwart, President Buhari notes the sacrifices and contributions of the minister in raising formidable information machinery that went a long way in bringing change in the country.\n“The President believes Mohammed works assiduously to create understanding and enhance the image of the country by bridging the information gaps."
  },
  {
    "headline": "Breaking: Military plane carrying Chief of Defence staff crashes (VIDEO)",
    "summarized_story": "A military helicopter carrying Indian defence chief General Bipin Rawat crashed in southern India on Wednesday, killing at least four people, and officials said they were still checking to see if he was among the dead.\nTwo defence sources said they were trying to ascertain Rawat’s status following the crash near the town of Coonoor.\nRawat was travelling from an Indian Air Force base in Sulur to the Defence Services Staff College in Wellington in the Indian state of Tamil Nadu to deliver a lecture.\nRawat was appointed as India’s first Chief of Defence Staff (CDS) by Prime Minister Narendra Modi’s government in late 2019.\nThe Air Force said that Rawat, who had previously served as India’s Chief of Army Staff, was travelling in an Mi-17V5 helicopter."
  },
  {
    "headline": "RMRDC: Breaking new ground in malaria cure",
    "summarized_story": "However, if used alone, it is observed that malaria parasite cannot be eradicated totally to resistance against arteminsinin.\nThe malaria parasite plasmodium falciparum is said to be one of the world’s most lethal pests, accounting for over a million deaths per year.\nFor over 50 years, study shows that the main tool for controlling the malaria parasite was chloroquine, a synthetic derivative of the plant-based extract quinine.\nAdding that, “In 1955, the WHO launched the Global Malaria Eradication Programme to eradicate malaria globally.\nReport by RMRDC projects overview states that several meetings have been held between both organisations to achieve a cure."
  },
  {
    "headline": "Kano APC crisis: We await Tinubu’s next line of action – Shekarau",
    "summarized_story": "A former Governor of Kano state, Senator Ibrahim Shekarau, has urged National Leader of the All Progressives Congress (APC) Bola Ahmed Tinubu to help resolve the crisis facing the state chapter of the party.\nHe said all aggrieved parties in the dispute are currently waiting on the former Lagos state governor to wade in.\n“He is a party leader; he will eventually render his advice on the next line of action for the success of the party,” Shekarau said.\nBut the APC National Appeal Committee recognised the Ganduje faction led by Abbas, a decision the Shekarau group challenged at a Federal High Court sitting in Abuja.\nThe plaintiff is further seeking an order of court dissolving the Committee known as and called the Caretaker/ extraordinary Convention Planning Committee."
  },
  {
    "headline": "Keren-Happuch: Group Protests At Unity Fountain, Demands Probe Into Schoolgirl’s Death",
    "summarized_story": "A group called the Coalition of Gender-Based Violence Responders has staged a solemn protest at the Unity Fountain in Abuja, the nation’s capital demanding a probe into the death of Keren- Happuch Akpagher.\nThe SS1 one boarding student of Premiere Academy, Lugbe Abuja died in June 2021 of alleged rape complications.\nThe group gathered early on Wednesday morning at the Unity Fountain clad in black outfits, displaying placards with various inscriptions.\nThey mandated the House Committees on Education, Youth Development, and Women Affairs and Social Development to follow up with the investigation.\n“Three (3) days after I took away my daughter, she died in a hospital in Abuja on the 22nd day of June 2021."
  },
  {
    "headline": "[UPDATED] Sokoto Attack: Police Commissioner Confirms 23 Deaths",
    "summarized_story": "The Sokoto State Police Commissioner, Kamaludeen Okunola, has confirmed twenty-three deaths following an attack on travellers in Angwan Bawa, Sabon Birni Local Government Area of Sokoto State.\nHe confirmed the figure shortly after briefing Governor Aminu Tambuwal in an emergency security meeting summoned by the governor on Wednesday.\nHe, however, explained that after verifying from local authorities and police officers on the ground, it was confirmed that the vehicle was conveying thirty passengers.\nREAD ALSO: Bandits Free 65 Kidnapped Baptist Church Members, Others In KadunaVillagers said the vehicle conveying the travellers was ambushed and shot at before the suspected bandits burnt the vehicle and its occupants.\nSokoto State, just like other states in the North-West region has been ravaged by banditry of recent, which has led to the loss of lives and properties."
  },
  {
    "headline": "VIDEO: Several Feared Dead As Truck Rams Into Schoolchildren In Lagos",
    "summarized_story": "Several schoolchildren are feared dead after a truck rammed into some students in the Ojodu area of Lagos State.\nThe incident occurred at Grammar School Bus-Stop along the Ogunusi Road on Tuesday afternoon when schoolchildren were returning to their respective homes.\nChannels Television gathered that the driver of the vehicle lost control before hitting the unspecified number of students.\nWhile some claimed about 13 students were feared dead, others said 17 schoolchildren died.\nREAD ALSO: Buhari Writes Senate, Seeks Passage Of 2021 Finance BillThe truck driver, the police commissioner explained, attempted to escape after hitting the schoolchildren."
  },
  {
    "headline": "Sylvester Oromoni: Five Dowen School Students, Three House Masters In Custody – Police",
    "summarized_story": "The Lagos State Police Command on Tuesday said five students of Dowen College, as well as three housemasters of the school, are now in their custody over alleged involvement in the death of their colleague, Sylvester Oromoni Junior.\n12-year-old Sylvester was said to have died from the injuries sustained during an alleged assault by five of his colleagues who wanted to initiate him into cultism.\nFollowing the incident, the police authorities began an investigation on Monday and earlier quizzed three students.\nREAD ALSO: Sylvester Oromoni: Three Dowen Students Are Currently In Police Custody – OdumosuAccording to the police, four of the students were allegedly mentioned by the parents of the victim to be directly involved in the crime while another student is assisting police investigations.\n“The students whose names were mentioned are in police custody and investigation is on."
  },
  {
    "headline": "UK’s Prime Minister Boris Johnson Under Pressure Over Lockdown Party Video",
    "summarized_story": "British Prime Minister Boris Johnson faced intense pressure Wednesday after a video emerged of his senior aides joking about holding a Christmas party at Downing Street last year when social gatherings were banned under COVID-19 rules.\nREAD ALSO: Trump White House Chief Risks Criminal Charge In Capitol Riot Probe“We now know the government broke the rules, they partied and now they’re laughing about it — they’re treating the public with contempt,” Labour party leader Keir Starmer said.\nAfter the video was leaked to broadcaster ITV News late Tuesday, his office continued to insist no party had taken place.\nHowever, Health Secretary Sajid Javid cancelled a series of broadcast interviews Wednesday morning amid uproar about it, leaving no minister to answer questions.\n“This fictional party was a business meeting and it was not socially distanced,” she laughs over joking exchanges about “cheese and wine” and whether the prime minister would “condone” such an event."
  },
  {
    "headline": "Resign now if you have political ambition, Gov Abiodun tells appointees -",
    "summarized_story": "Ogun State Governor, Prince Dapo Abiodun, has directed all serving political appointees with 2023 political ambitions in the State to resign on or before Jan 31 2022 to pursue their dreams.\nA statement issued in Abeokuta on Tuesday by his Chief Press Secretary, Mr. Kunle Somorin, said the directive had become expedient to avoid observed distractions and loss of focus in the discharge of their responsibilities.\nWhilst noting that it is legitimate to have such ambitions, the Governor, however, said: “As an Administration unwaveringly committed to delivering on its electoral promises, any activity that is capable of undermining the implementation of the Building Our Future Together Agenda of the Administration will not be tolerated”.\nGovernor Abiodun counselled that those who cannot wait till the appropriate time for 2023 electioneering process should take their leave to pursue their ambitions without constituting a clog in the wheel of the implementation of government programmes and activities, the statement concluded."
  },
  {
    "headline": "Nigeria needs thorough review of 1999 Constitution",
    "summarized_story": "Nigeria Needs Thorough Review of Constitution - Group"
  },
  {
    "headline": "I don't see anything wrong In Sanwo-Olu's Peace Walk initiative",
    "summarized_story": "In this interview, Babajide Kolade-Otitoju shares his views on the peace walk suggested by the Lagos State Governor, Babajide Sanwo-Olu.\nThe veteran journalist added that the move by the state governor is a good one, that is geared towards healing the wounds created by the unfortunate incident of October 20, 2020."
  },
  {
    "headline": "Speaker Gbajabiamila inaugurates road in Ikorodu",
    "summarized_story": "The speaker of the House of representatives, Femi Gbajabiamila has inaugurates road facilitated by Babajimi BensonThe road situated in the Ikorodu area of Lagos is designed to help improve intracity movement and boost economic activities."
  },
  {
    "headline": "Wizkid’s ‘Essence’ Featuring Tems Named Best Song of 2021 By Rolling Stone",
    "summarized_story": "After revealing the best albums of 2021, Rolling Stone is sharing the 50 best songs of the past year.\nLanding at the top of the list is Wizkid’s “Essence” featuring Tems, which put Afrobeats on the global stage.\n13 best song of 2021, while Megan Thee Stallion’s “Thot Shit” was hailed as “another winner,” coming in at No.\n28), Meek Mill’s “Sharing Locations” featuring Lil Baby and Lil Durk (No.\n31), BIA’s “Whole Lotta Money” with Nicki Minaj, Isaiah Rashad’s “From the Garden” featuring Lil Uzi Vert (No."
  },
  {
    "headline": "Helicopter Carrying Indian Defence Chief Crashes; Inquiry Ordered",
    "summarized_story": "A military helicopter carrying Indian defence chief General Bipin Rawat crashed near the town of Coonoor in southern India on Wednesday, the Indian Air Force said.\nRawat was appointed as India’s first Chief of Defence Staff (CDS) by Prime Minister Narendra Modi’s government in late 2019.\nThe position was set-up with the aim of integrating India’s three services — the Army, the Navy and the Air Force.\nThe Air Force said that Rawat, who had previously served as India’s Chief of Army Staff, was traveling in an Mi-17V5 helicopter.\n“An inquiry has been ordered to ascertain the cause of the accident,” the Air Force said in a tweet."
  },
  {
    "headline": "Novak Djokovic on Australian Open Entry List Despite Vaccine Uncertainty",
    "summarized_story": "World number one Novak Djokovic has been entered into the Australian Open despite uncertainty over his Covid vaccination status, while seven-time winner Serena Williams is absent.\nThe Australian Open begins on 14 January.\nTournament organiser Tennis Australia has denied reports that it has explored the possibility of applying for an exemption to Victoria’s state rules for 34-year-old Djokovic.\n“All players, patrons and staff at the Australian Open have to be vaccinated,” Tennis Australia said in a statement.\n“Any suggestion that Tennis Australia is seeking ‘loopholes’ within this process is simply untrue.”The message was reinforced by Victoria’s Deputy Premier James Merlino."
  },
  {
    "headline": "Buhari Flags Off $300m Afreximbank Medical Centre, Laments Brain Drain",
    "summarized_story": "President Muhammadu Buhari on Tuesday conducted the official take-off of the planned $300 million African Medical Centre of Excellence (AMCE) to be implemented in Abuja by the Benedict Oramah-led African Export-Import Bank (Afreximbank).\nAt the event which he attended virtually, the president who decried the rising cases of non-communicable diseases like cancer noted that unfortunately, West African countries lacked the wherewithal to deal with such ailments.\n“The rising NCD burden coupled with inadequate medical infrastructure on the continent threatens the future of our people.\nRight now, many hospitals in the West African region are underfunded, underequipped, understaffed and relatively inaccessible to most patients especially from rural areas,” he stated.\n“The partnership with King’s College Hospital will increase locally available clinical capabilities, provide education and training, relying on KCH’s two centuries’ of experience in providing specialist healthcare services, medicine, and medical research."
  },
  {
    "headline": "Governor Sanwo-Olu Urges Lagos to Prepare for Fourth Wave of Covid, Threatens to Prosecute Fake Test Holders",
    "summarized_story": "Governor of Lagos State, Mr Babajide Sanwo-Olu, on Tuesday alerted the people of the state to a fourth wave of the coronavirus pandemic, noting that in the last three weeks, cases had risen from 0.1 per cent to 6 per cent.\n“Unfortunately, Lagos State is not left out as we are also experiencing the beginning of a fourth wave with current positivity rate at 6 per cent.\n“Therefore, I implore all intending inbound passengers to perform their required tests at any of the private laboratories within the Lagos state private laboratory consortium as and at when due,” he added.\nHe also mentioned that the state had received very disturbing information about intending outbound passengers procuring fake Covid test results and/or vaccination cards for travel purposes.\n“We implore everyone to desist from patronising these gangs, as anyone found with a fake Covid test result and/or vaccination card will also be liable to prosecution and very stiff penalties."
  }
]