[
  {
    "headline": "Road crashes kill 62, injure 624 in Adamawa –FRSC",
    "summarized_story": "The Federal Road Safety Corps, Adamawa Sector Command, says no fewer than 62 persons were killed and 624 injured in road accidents between January and September 2021 in the state.\nHe said that during the period under review, 1,025 people and 369 vehicles were involved in 202 road crashes caused mostly by speeding and wrong overtaking by drivers.\nHe urged road users to always abide by road traffic regulations and avoid night travels to reduce the rate of accidents, especially during the ember months.\n“We have entered the ember months and it is the rush period because a lot of people will be travelling.\nBoyi further urged drivers to shun overloading to avoid putting more pressure on their vehicle’s tires, which could lead to tire busts and crashes."
  },
  {
    "headline": "Don’t ignore other killer diseases for COVID-19 — Medical Director warns",
    "summarized_story": "The Chief Medical Director, Ondo State Specialist Hospital, Okitipupa, Dr Akintunde Ogunfeyimi, on Friday advised Nigerians to maintain hygienic living at all times.\nSpeaking with the News Agency of Nigeria at Okitipupa, Ondo State, he said it was the only way to prevent an outbreak of killer diseases other than COVID-19.\nHe noted that Nigerians currently focus solely on the COVID-19, forgetting to guard against other killer diseases which had been around before the pandemic.\nThe chief medical director highlighted such diseases as Lassa fever, malaria, cholera, dysentery, diarrhoea and tuberculosis among others.\nDr Ogunfeyimi also cautioned against self-medication and advised that people should seek medical attention anytime they fell ill,” he said."
  },
  {
    "headline": "Bill Clinton hospitalised",
    "summarized_story": "United States of America former President Bill Clinton is currently receiving treatment for an infection in a California hospital.\nThe 75-year-old was admitted to the University of California Irvine Medical Center on Tuesday evening “for a non-COVID-19 infection,” Clinton spokesperson Angel Urena said on Twitter.\n“He is on the mend, in good spirits, and incredibly thankful to the doctors, nurses and staff providing him with excellent care,” Urena wrote.\n“He’s up and about, joking and charming the hospital staff,” the spokesperson added.\n“After two days of treatment, his white blood cell count is trending down and he is responding to antibiotics well,” they said in a statement."
  },
  {
    "headline": "Alaafin is youth-driven, Shina Peller celebrates monarch at 83",
    "summarized_story": "Shina Peller, has described His Imperial Majesty, Oba (Dr.) Lamidi Olayiwola Atanda Adeyemi III, the Alaafin of Oyo, as a youth-driven royal father whose leadership roles in preserving and promoting the cultural heritage of Yorubaland remain outstanding.\nPeller made this known on Friday in his congratulatory message to the revered Yoruba king, the Alaafin of Oyo, on his 83rd birthday anniversary.\n“Your Imperial Majesty sir, you have continuously proven to all that you are a youth-driven royal father who is desirous of a positive and dynamic change in governance.\nPeller revealed that Alaafin’s quest for a more peaceful and prosperous Yorubaland was what informed his decision to confer him (Hon.\nMay your reign continue to be long, peaceful and prosperous."
  },
  {
    "headline": "2023: SDP wants death penalty for election riggers, kicks against zoning",
    "summarized_story": "By Omeiza Ajayi – AbujaThe Social Democratic Party, SDP, has expressed deep anger at the propensity of political money bags to rig elections in the country, saying ahead of the 2023 general election, it has become imperative to advocate the death penalty for election riggers.\nThis was as the party kicked against zoning of the Delta State Governorship ticket to the Central Senatorial District, saying in a state like Delta with its political maturity and as home to eggheads, competence must trump zoning.\nChairman of the party in the state, Amb Oke Idawene who is also the Chairman, Forum of SDP State Chairmen, stated this in an interview with Vanguard.\nI want to call on the National Assembly to support this BVAS and other technologies used by INEC.”On Zoning the 2023 presidency to the South and the Delta Governorship ticket to Delta Central, the SDP Chairman said; “SDP is not for zoning.\n“In Delta State, the Central is claiming that it is their turn to produce the next governor."
  },
  {
    "headline": "ASUU: Ngige reiterates FG’s commitment to revamp education system",
    "summarized_story": "READ ALSO:ASUU hails Ngige for sending his children to Nigerian public schools“ASUU is not asking for things that are impossible.\n“They are interested in getting good working condition for their members and for the public university system to be conducive for teaching and research,” he said.\n“I am a firm believer in the public university system.\n“If any group of government workers or public officers will be on the side of public university system, I am the number one.\n“If we continue this way, we will make more progress and restore faith in the university system,” he said."
  },
  {
    "headline": "Without regionalism, Nigeria’s progress a mirage – Alaafin",
    "summarized_story": "Alaafin of OyoBy Dapo Akinrefon – LagosTHE Alaafin of Oyo, Oba Lamidi Adeyemi, Tuesday, declared that until Nigeria returns to regionalism, the country’s progress remains a mirage.\nHe said the military incursion in Nigeria’s political space in 1966 had since remained the country’s albatross, adding that the southwest had, before the coup, enjoyed tremendous progress in all sectors.\nThe Alaafin, however, said regionalism can guarantee the future of the country and save it from imminent collapse.\nHe said: “Until Nigeria goes back to regionalism, the nation’s progress is a mirage.\n“The Yoruba history is very rich; our language remains the most potent tool that has kept us far above other races."
  },
  {
    "headline": "It’s time to implement anti-open grazing law – Oyo lawmakers tell Makinde",
    "summarized_story": "Members of the Oyo State House of Assembly have advised Governor Seyi Makinde to immediately ensure the implementation of the anti-open grazing law.\nDAILY POST recalls that the anti-open grazing law was passed by the members of the Assembly in October 2019.\nThe state lawmakers have however called on the executive arm of the government to ensure implementation of the law.\nThe lawmakers then called on the executive arm of government to put measures in place for the implementation of the Anti-Open Grazing Prohibition Law.\nWe will send anti-open grazing bill to state Assembly soon – Gov Wike"
  },
  {
    "headline": "Nigerians swarm around him as bees do honey – Adesina compares Buhari to Azikiwe, Shagari, others",
    "summarized_story": "Femi Adesina, the Special Adviser to the President on Media and Publicity, has compared President Muhammadu Buhari to past Nigerian leaders, Nnamdi Azikiwe, Obafemi Awolowo, Shehu Shagari, and others.\nAdesina said Nigerians are more attracted to Buhari than Azikiwe, Awolowo and Shagari, adding that they swarm around him as bees do to honey.\nAccording to him, he has not seen any Nigerian leader that has a popular appeal like Buhari.\nHe also said that Vice-President Yemi Osinbajo was right to have described Buhari as “the most popular Nigerian politician that we ever had in this generation”.\n“Vice-President Yemi Osinbajo is an honest man."
  },
  {
    "headline": "Northern Youths urge Buhari to sack acting NPA MD, Bello-Koko",
    "summarized_story": "The leadership of the Northern Youths’ Council of Nigeria (NYCN) has commended President Muhammadu Buhari-led government on its unrelenting efforts in ensuring that corruption is totally eliminated in the country.\nThe statement noted that the blockage of all revenue leakages in Ministries, Departments and Agencies (MDAs) is a step taken in the right direction by the present administration to curtail corruption in the country.\nIt stated that the inability of Bello-Koko to eat the humble pie and resign or be sacked by the Federal government will force the NYCN to commence mass mobilisation of its members and other concerned civil society groups to ensure that it happens.\nThe statement said that Nigerians cannot continue to live in poverty while corrupt public servants are buying properties they don’t need in other countries.\nNPA appoints port managers for ​Calabar, Onne, ​Tin Can, redeploys officials"
  },
  {
    "headline": "Presidency replies Nnamdi Kanu on Buhari being ‘Jubril of Sudan’",
    "summarized_story": "The Presidency has rubbished claims by Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), that President Muhammadu Buhari is Jubril of Sudan.\nBuhari’s Special Adviser on Media and Publicity said it is “idiocy” to claim that the president is dead and was replaced with Jubril from Sudan.\nAdesina disclosed this in his latest article titled, ‘The Essential Buhari: VP Osinbajo got it!.’He recalls how Buhari, upon return from his medical trip abroad in 2017, recognised him.\nHe had claimed that Buhari was cloned and replaced with Jubril Al-Sudan after his death.\nJubril of Sudan: Buhari’s Imo visit proved Nnamdi Kanu lied, he’s not cloned – Orji Kalu"
  },
  {
    "headline": "Compulsory COVID-19 vaccination from pit of hell, violation of human rights – Pastor Enenche",
    "summarized_story": "The Senior Pastor of Dunamis International Gospel Centre, DIGC, Dr Paul Enenche, has said that the move to make COVID-19 vaccination compulsory for everyone across the globe is a demonic agenda from the “pit of hell”.\nHe said, “We terminate the demonic covid agenda.\nWe terminate the demonic false vaccination agenda all around the earth.\n“In case you don’t know, compulsory vaccination is from the pit of hell.\nDAILY POST recalls that the Federal Government had on Wednesday announced that it would ban workers who fail to show proof of their COVID-19 vaccination from accessing their offices as from December 1 this year."
  },
  {
    "headline": "Court remands man for allegedly defiling 9-year-old girl",
    "summarized_story": "A Chief Magistrates’ Court in Kano on Friday, ordered that a 33-year-old man, Kabiru Garba be remanded in a correctional centre for allegedly defiling nine-year-old girl.\nThe police charged Garba, who resides in Rijiyar Lemo Quarters Kano with defilement.\n- Advertisement -- Advertisement -He adjourned the matter until Nov.2, for further mention.\nEarlier, the Prosecution Counsel, Miss Asma’u Ado, told the court that Garba committed the offence on Sept.29, at Rijiyar Lemo Quarters Kano.\n- Advertisement -She alleged that at about 11 a.m, Garba lured the nine-year-old girl into his room situated in Rijiyar Lemo Quarters and defiled her."
  },
  {
    "headline": "Gbajabiamila celebrates Alaafin of Oyo, Oba Lamidi Adeyemi at 83",
    "summarized_story": "He noted how the Alaafin had enjoyed good health from the Almighty God over the years.\n- Advertisement -Read Also: Karim salutes Alaafin at 83- Advertisement -The Speaker said Oba Adeyemi had been leading by example, carrying his subjects along since becoming the Alaafin Oyo more than five decades ago.\n- Advertisement -Gbajabiamila noted the invaluable contributions of the Alaafin in the development of the Yoruba race, saying he is much revered for his diligence, commitment and dedication to his people.\nHe recalled how the Oyo Empire instituted the democratic system of government many decades ago since Oba Adeyemi ascended the throne in 1970.\n- Advertisement -While wishing the Alaafin God’s continuous protection and increased wisdom, Gbajabiamila prayed for longevity and good health for him."
  },
  {
    "headline": "Laspotech student killed at campus gate",
    "summarized_story": "A National Diploma One student of Business Administration, Lagos State Polytechnic, Isolo campus, Akeju Tunde was shot dead yesterday in front of the school gate.\nSources said that he ran to the school gate to gain entry for safety and was denied by the security who asked him to provide his Identity card.\n- Advertisement -Other sources accused the security of collecting money from people before letting them in regardless of who they are.\nIt was the students who tried to rush him to hospital where he was confirmed dead”.\n- Advertisement -It was rumoured that the perpetrators were from Offa, Kwara State and that the deceased was to be initiated into a cult."
  },
  {
    "headline": "UPDATED: N19.3b of N20b Kogi bailout loan for return to CBN as EFCC withdraws case",
    "summarized_story": "UPDATED: N19.3b of N20b Kogi bailout loan for return to CBN as EFCC withdraws caseThe Economic and Financial Crimes Commission (EFCC) on Friday withdrew its suit seeking the forfeiture of the N20billion bailout funds granted to the Kogi State Government by a new generation bank.\nThe money was meant for the payment of Kogi State workers but was alleged to have been instead domiciled in an interest-yielding account with the bank.\nWhen the matter came up on September 28, 2021 before Justice Aneke, he adjourned to hear all applications relating to the loan.\nHe prayed the court that the interim forfeiture order earlier granted should be vacated for the purpose of clarity.\nBut Justice Aneke declined."
  },
  {
    "headline": "North settles for Ayu as PDP national chairman",
    "summarized_story": "From Ndubuisi Orji, Abuja and Paul Osuyi, AsabaFormer Senate president, Iyorchia Ayu, yesterday, emerged consensus candidate of the North for the Peoples Democratic Party (PDP) national chairmanship.\nWhile the North Central nominated Ayu as its consensus candidate, North East and North West nominated former Senate leader, Abdul Ningi and former Kastina State governor, Ibrahim Shema, respectively.\nThere was no election and there was no selection.”Ayu’s emergence is the climax of days of intrigues and horse-trading among northern PDP stakeholders.\nThe convener of the group, Mohammed Idah, in a statement, yesterday, stated that the former Senate President’s adoption is part of alleged plan to exclude the North Central from the 2023 presidential contest..“The North Central has produced several PDP national Chairmen.\nWe totally reject the move to stop the North Central from aspiring for the Presidency in 2023 using any guise."
  },
  {
    "headline": "Govs, ministers, legislators, royal fathers billed for The Sun Awards tomorrow",
    "summarized_story": "Twenty-four hours to The Sun Awards 2020, governors from across the country, former governors, ministers, lawmakers, businessmen and many other government functionaries at the federal and state levels, have accepted to attend the event.\nThe Sun Awards 2020 holds tomorrow, October 16, 2021 at the Expo Convention Centre, Eko Hotels & Suites, Victoria Island, Lagos.\nStar singer, songwriter and performer, KCee (Kingsley Chinweike Okonkwo) and Koffi Ayinde Idowu-Nuel, popularly known as Koffi Tha Guru, entertainer, comedian, writer, singer and actor, will thrill audience at The Sun Awards 2020.\nAccording to the organising committee of The Sun Awards 2020, KCee and Idowu-Nuel will wow the audience with high-class entertainment, made up of music, stage performance and comedy.\nThe Sun Awards 2020, which is the 18th edition, will see the honour of 24 distinguished Nigerians who recorded outstanding achievements last year, despite the COVID-19 pandemic."
  },
  {
    "headline": "Fayemi, Sanwo-Olu, Obaseki, El-Rufai make case for state police",
    "summarized_story": "From Priscilla Ediare, Ado-EkitiGovernors Kayode Fayemi, Godwin Obaseki, Babajide Sanwo-Olu and Nasir El-Rufai of Ekiti, Edo, Lagos and Kaduna states respectively, yesterday, made a case for state police saying it would mitigate the problem of insecurity and promote investments.\nThey argued that preventing governors from taking charge of security was adversely affecting investments, development and wellbeing of people.\nGovernor Fayemi insisted that multi-level policing system remains the best way out of the lingering security crisis that is gradually crippling the economy.\nIf you have problem of security in Kaduna, Governor El-Rufai can easily take charge.\nThe seizure of Lagos funds by President Olusegun Obasanjo made us think like a sovereign state."
  },
  {
    "headline": "COVID-19: Vaccination not compulsory for civil servants – FG",
    "summarized_story": "From Fred Ezeh, AbujaFederal Government has explained that taking COVID-19 vaccine is a choice and not a compulsory exercise, even though it is expected that every Nigerian should get vaccinated against the dreaded COVID-19 virus.\nHe also explained that NPHCDA is committed to ramp up COVID-19 vaccine uptake, and it had put in place plans for the establishment of mass vaccination sites across the country.\n“As we expand the vaccination sites, we encourage all eligible Nigerians to avail themselves for vaccination.\nWe have commenced the process of decentralising COVID-19 vaccination in Nigeria, to include private health care providers.\nWe are also enhancing the security features of our vaccination cards in order to limit forgeries,” he said."
  },
  {
    "headline": "EndSARS: Protesters list activities for 1 year anniversary",
    "summarized_story": "By Lukman OlabiyiDespite the Lagos State Police Command’s warning against any form of protest in commemoration of one year anniversary of the #EndSARS protests, social media has been flooded with the proposed activities for the memorial.\nThe flyers trending on Facebook on the proposed activities for the anniversary indicate that the events would begin with a Jumat service on October 15, at the Jumaat Suadr Central Mosque, Ojota, Lagos.\nThis would be followed by traditional rites on October 16, at the New Afrika Shrine in Agidingbi, Lagos.\nOn October 17, a church service would be held at Lagos Christian Centre in Oregun, Lagos.\nMemorial protests will also be held in major cities like Ibadan, Port Harcourt and Abuja."
  },
  {
    "headline": "Ayu Emerges Consensus PDP Chairmanship Candidate",
    "summarized_story": "Ayu had earlier emerged the consensus national chairmanship candidate for the North-central zone after other contenders from the zone withdrew from the race early this week.\nOn Wednesday, the northern PDP stakeholders had met to select a consensus candidate, but the meeting could not hold.\nAyu was also brought in to appeal and plead for support and he assured that he would ensure a level playing field, before eventually emerging consensus candidate.\nHowever, after over three hours meeting at the Bauchi State Government Lodge, the Northern PDP stakeholders settled for Ayu as their consensus national chairman.\nWe all came out united…“Distinguished Senator Iyorcha Ayu has emerged consensus candidate of the north."
  },
  {
    "headline": "CDS: 250 Bandits ‘Neutralised’ After Telecoms Blackout in N’West, 600 Arrested",
    "summarized_story": "He added that over 600 other bandits had been captured in the successful military operations facilitated by the interruption of the telephone and internet services in some states in the zone.\nWe have achieved successes within this period.”With the ongoing operations, the CDS said government’s primary objective was to ensure the peace and wellbeing of every citizen.\nBut more seriously, a larger number of the bandits remain in the northwest.\n“So, if the security agencies are oblivious about certain… of course they get hoodwinked and then, of course, lose focus.\nHe said what was not acceptable to the military was when such persons work at cross-purposes with security agencies’ objectives."
  },
  {
    "headline": "Emefiele: Nigeria Spends 40% of FX on Importation of Petrol, Others",
    "summarized_story": "“On the Dangote Refinery, by the time it begins production latest July next year, it is going to be a major source to save forex for Nigeria.\nRight now, the overall forex we spend on imported items, the importation of petroleum products consumes close to 30 per cent.\n“By the time you add diesel, aviation fuel, petrol and the rest of that which makes up the 30 per cent, the Dangote Refinery has the capacity to produce 650,000 barrels per day.\nWe think that is going to be a major FX saver for our country and we would export those refined products.\n“Indeed, we know that refineries abroad are already scared because they know the market they would lose because Nigeria will prefer to patronise Dangote Refinery instead of foreign refined petroleum products."
  },
  {
    "headline": "Osinbajo: Obasanjo’s Seizure of LG Funds Forced Lagos to Think Like Sovereign State",
    "summarized_story": "Osinbajo spoke in Ado Ekiti, the Ekiti State capital, at an Economic and Investment summit the “Fountain Summit 2021,” organised by the Governor Kayode Fayemi administration.\nThe seizure of Lagos funds by President Olusegun Obasanjo made us to think like a sovereign state.\n“Let me commend the foresightedness of the governor, Fayemi, to know that technology is the best way to go.\nThe Edo State governor commended Fayemi’s transformation agenda in Ekiti State, saying the state is lucky to have a resourceful and innovative chief executive that could turn things around with lean resources.\nThe Lagos State governor suggested that the state should digitalise its revenue collection process and give staff in the state Internal Revenue Service incentives to do their jobs without perpetrating corruption."
  },
  {
    "headline": "FG May Expand Access to Covid-19 Vaccination Ahead of December Deadline",
    "summarized_story": "Shuaib said the agency had already done a comprehensive analysis and forecast of COVID-19 vaccines’ availability.\nI am also glad to inform you that we have commenced the process of decentralising COVID-19 vaccination in Nigeria, to include private health care providers.\nHe, however, noted that private health facilities might need to charge for their hospital registration cards, which would be different from the COVID-19 vaccination cards.\nHe said interested private health facilities would be required to meet certain criteria, including having the requisite qualified health care workers, among others.\nHe said the study sought to estimate the incidence of adverse events following immunisation with different brands of the COVID-19 vaccine in all enrolled immunised subjects."
  },
  {
    "headline": "How Nigerian Famous Cleric, Pastor Bakare Sold $1.4million US Mansion Below Market Value In 2017, Losing $370,000",
    "summarized_story": "The founder of Citadel Global Community Church (formerly Latter Rain Assembly), Pastor Tunde Bakare (Babatunde Gbolahan Bakare) in 2017 sold one of his properties in the United States of America below market value, SaharaReporters has gathered.\nThe property which was bought by the lawyer turned pastor in June 2006 for $1,400,000 was sold to one Peter Lu (Peter & Minsu Lu) 11 years later for $1,030,000, at a loss of $370,000.\nIt was bought in July 2017 by Peter & Minsu Lu, according to documents obtained by SaharaReporters.\nDocuments say the current owner is Peter Lu.\nAccording to Redfin Real Estate, the mansion is currently worth $1,673,830, $273,830 more than Bakare bought it and $643,830 more than the cleric sold it."
  },
  {
    "headline": "How Nigerian Famous Cleric, Pastor Bakare Sold $1.4million US Mansion Below Market Value In 2017, Losing $370,000",
    "summarized_story": "The founder of Citadel Global Community Church (formerly Latter Rain Assembly), Pastor Tunde Bakare (Babatunde Gbolahan Bakare) in 2017 sold one of his properties in the United States of America below market value, SaharaReporters has gathered.\nThe property which was bought by the lawyer turned pastor in June 2006 for $1,400,000 was sold to one Peter Lu (Peter & Minsu Lu) 11 years later for $1,030,000, at a loss of $370,000.\nIt was bought in July 2017 by Peter & Minsu Lu, according to documents obtained by SaharaReporters.\nDocuments say the current owner is Peter Lu.\nAccording to Redfin Real Estate, the mansion is currently worth $1,673,830, $273,830 more than Bakare bought it and $643,830 more than the cleric sold it."
  },
  {
    "headline": "EXCLUSIVE: Buhari Cancels Visit To Daura For ‘Short Rest’ Over Fear Of #EndSARS Memorial Protest",
    "summarized_story": "President Muhammadu has cancelled his visit to Daura, Katsina State over the planned protest across the country in commemoration of the first anniversary of the #EndSARS protest.\nSee Also Exclusive EXCLUSIVE: Buhari Cancels Planned Visit To Scotland For Climate Change Conference To 'Rest', Delegates Vice-President Osinbajo“He's departing for Daura this weekend for home rest.\n#RevolutionNow #EndSARS #buharimustgo.”Buhari had in the past claimed last year’s #EndSARS protest against police brutality was aimed at removing him from office.\nSee Also Politics EXCLUSIVE: Following Recent UN General Assembly Trip, Other Activities, Buhari To Visit Daura For ‘Short Rest’He added that those who participated in the protest have made Nigeria unattractive to investors.\n“This question was answered last year when there was the #EndSARS protest."
  },
  {
    "headline": "EXCLUSIVE: Buhari Cancels Visit To Daura For ‘Short Rest’ Over Fear Of #EndSARS Memorial Protest",
    "summarized_story": "President Muhammadu has cancelled his visit to Daura, Katsina State over the planned protest across the country in commemoration of the first anniversary of the #EndSARS protest.\nSee Also Exclusive EXCLUSIVE: Buhari Cancels Planned Visit To Scotland For Climate Change Conference To 'Rest', Delegates Vice-President Osinbajo“He's departing for Daura this weekend for home rest.\n#RevolutionNow #EndSARS #buharimustgo.”Buhari had in the past claimed last year’s #EndSARS protest against police brutality was aimed at removing him from office.\nSee Also Politics EXCLUSIVE: Following Recent UN General Assembly Trip, Other Activities, Buhari To Visit Daura For ‘Short Rest’He added that those who participated in the protest have made Nigeria unattractive to investors.\n“This question was answered last year when there was the #EndSARS protest."
  },
  {
    "headline": "EXCLUSIVE: Buhari Cancels Visit To Daura For ‘Short Rest’ Over Fear Of #EndSARS Memorial Protest",
    "summarized_story": "President Muhammadu has cancelled his visit to Daura, Katsina State over the planned protest across the country in commemoration of the first anniversary of the #EndSARS protest.\nSee Also Exclusive EXCLUSIVE: Buhari Cancels Planned Visit To Scotland For Climate Change Conference To 'Rest', Delegates Vice-President Osinbajo“He's departing for Daura this weekend for home rest.\n#RevolutionNow #EndSARS #buharimustgo.”Buhari had in the past claimed last year’s #EndSARS protest against police brutality was aimed at removing him from office.\nSee Also Politics EXCLUSIVE: Following Recent UN General Assembly Trip, Other Activities, Buhari To Visit Daura For ‘Short Rest’He added that those who participated in the protest have made Nigeria unattractive to investors.\n“This question was answered last year when there was the #EndSARS protest."
  },
  {
    "headline": "FG: ASUU’s demands not impossible… we won’t always be at war",
    "summarized_story": "Chris Ngige, the minister of labour and employment, says the demands by the Academic Staff Union of Universities (ASUU) are not impossible for the federal government to meet.\n“They are interested in getting good working conditions for their members and for the public university system to be conducive for teaching and research.\nSpeaking further, Ngige described himself as a firm believer in Nigeria’s public university system.\n“My third child will also come out possibly next month from a public university again.\n“If any group of government workers or public officers will be on the side of the public university system, I am the number one."
  },
  {
    "headline": "ASUU seeks law prohibiting children of public officers from schooling abroad",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has charged the national assembly to work out legislation mandating the children of public office holders to be schooled in Nigeria.\nOsodeke said the minister demonstrated an uncommon faith in the university system by sending his children to Nigerian public schools.\nI think you are the only Minister whose children are in the country.\n“The national assembly must formulate a law that if you take an appointment, your children must study here.\nIf you know that your children cannot be here, don’t take a government appointment.”AdvertisementOsodeke also lamented the decay in public universities which he said necessitated the union’s repeated strikes."
  },
  {
    "headline": "UI names Kayode Adebowale as 13th VC — first Ibadan man in 73 years",
    "summarized_story": "The University of Ibadan (UI) has named Kayode Adebowale, a professor of chemistry, as the 13th substantive vice-chancellor (VC) of the institution.\nAdebowale was the incumbent deputy vice-chancellor (DVC) of the institution until his recent feat — which makes him the first man from Ibadan to occupy the office in 73 years.\nAccording to Oyegun, who is the pro-chancellor and chairman of the institution’s governing council, the new VC was selected after a rigorous process.\nA new Governing Council was inaugurated in April this year and it decided in its wisdom to start the process afresh.\n“It is, therefore, my pleasure to present to you the new and the 13th Vice-Chancellor of this great University, University of Ibadan, Professor Kayode Oyebode Adebowale."
  },
  {
    "headline": "National assembly upgrades Adeyemi College of Education to varsity",
    "summarized_story": "The national assembly has approved the upgrade of the Adeyemi College of Education to a university.\nAdvertisementThe senate, on Wednesday, concurred to a bill earlier passed at the house of representatives.\nWith the development, the college of education will now be known as Adeyemi Federal University of Education, Ondo.\nAhmad Lawan, the senate president, said the bill has repealed the act that established Adeyemi College of Education and re-enacted a new one for the establishment of the Adeyemi Federal University of Education.\nAdvertisementThe bill for the upgrade of the foremost college of education was passed in the eighth national assembly but the President Muhammadu Buhari had declined assent to it."
  },
  {
    "headline": "WATCH: Bastketmouth enlists Buju for ‘Your Body’ visuals",
    "summarized_story": "Basketmouth has tapped Buju for the visuals of ‘Your Body,’ the first track from ‘Horoscope,’ his upcoming album.\nAdvertisementThe Nigerian comedian, whose real name is Bright Okpocha, announced the release of the music video on his verified Instagram page on Thursday.\nThe less than three minutes visuals feature Basketmouth as a therapist who tries to proffer solutions to the relationship problems between Buju and his visibly agitated girlfriend.\nThe video kicks off after he’s planted a pair of virtual reality devices onto the couple, and he sends them back into their memories with just one click.\nAdvertisementThe result was a voyage into how the lovers’ once brightly burning flame of passion extinguished into ashes of agitations and laments."
  },
  {
    "headline": "Why Nigerian neobank, Sparkle, preferred local investors in $3.1m funding",
    "summarized_story": "Sparkle, a mobile-based digital bank that provides a combination of financial, lifestyle, and business support services to Nigerians, on Thursday, announced a $3.1 million seed fundraise from entirely Nigerian investors.\nThe latest funding brings Sparkle’s total investment secured to $5.1 million, having previously raised $2 million in pre-seed from friends and family.\n“They all understand the real need for a digital-first platform such as Sparkle.”Get the best African tech newsletters in your inboxIt’s not common in the Nigerian tech ecosystem that a funding round of such value comprises only local investors.\nAccording to Dozie, the Sparkle team was “very deliberate” about having an all-Nigerian round as it always felt that having a selection of strategic local investors would be beneficial to the startup’s growth.\nWe wanted to make sure our investors really understood the market before committing to this round,” he told TechCabal."
  },
  {
    "headline": "Kenya’s high court issues landmark ruling against Uber",
    "summarized_story": "Under this agreement, Uber Kenya Limited retained a 25% cut of overall profits from each ride.\nBecause of this, Uber Kenya Limited said they were not liable for the breach of contractual obligations.\nUber Kenya Limited acts as a subsidiary that contracts Uber drivers in Kenya.\nWhile Uber BV claimed it was a separate entity from Uber Kenya Limited, the High Court of Kenya concluded that there was an intricate link between both companies.\nThis, stated Milimani court justice, Francis Tuiyott, lifted the “corporate veil” off of the conglomerate, making Uber Kenya Limited and Uber BV liable to the plaintiffs."
  },
  {
    "headline": "M-Pesa, Opay, Telebirr, Palmpay: How Chinese tech is powering African fintech",
    "summarized_story": "These Chinese tech companies decided to establish a stronger presence in Africa despite the political and economic instability.\nNotably, Wapi Pay, a Singapore-based Kenyan fintech startup powering the Africa-Asia cross-border payment, uses Huawei’s mobile money services.\nAn indication that contemporary fintech startups are also relying on Chinese tech.\nDespite the immense contribution of Chinese tech to the African fintech space, there’s still room for growth.\nHaving a strong Chinese presence in African tech has clearly been very beneficial; a monopolistic dominance is what’s worrying."
  },
  {
    "headline": "From hawking dry fish to coding at Bloomberg: the story of a Nigerian first class graduate",
    "summarized_story": "She decided, then, to take a break from applying for international jobs and focus on her current job at the time.\nKemi was the first child of her family, born in 1995, in the Akowonjo area of Lagos, Nigeria.\nTwo years after secondary school, Kemi was admitted into the Faculty of Engineering at the Obafemi Awolowo University (OAU), Ife.\nAt OAU, it was easy to get into coding as there were always coding camps going on, on the campus.\n“I like to say I officially became a software engineer during my internship at a leading e-commerce company,” Kemi said."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Update [ October 1, 2021 at 8:14 am.\nWAT] The eNaira website is now up The Central Bank of Nigeria (CBN) has postponed..."
  },
  {
    "headline": "With $350k pre-seed, PaySika is building a neobank for the unbanked in Francophone Africa",
    "summarized_story": "After all, he’d left French-speaking Africa, where barely 20% of the population had access to banking services, so that was the obvious option.\nThe young man in this story is Roger Noel Nengwe, Co-founder and CEO of PaySika, a neobank looking to provide banking services to the unbanked in Francophone Africa.\nAlongside Stezen Bisselou-Nzengue, Co-founder and CEO, Nengwe is building PaySika on Francophone Africa’s existing mobile money infrastructure.\nIt offers banking services not just on an app like most neobanks but on their favourite messaging apps.\nBut everything was based on facts supplied by PaySika Co-founder, Roger Nengwe, and our research."
  },
  {
    "headline": "Tech-enabled sexual health, Sparkle’s $3.1 million seed, Facebook’s Policy Update",
    "summarized_story": "Share this article:Hello,Today I’m discussing:Improving your sexual health with technologySparkle’s $3.1 million seedFacebook’s policy on sexual harassment of public figuresImproving your sexual health with technologySexual health is an important aspect of our physical health and development.\nAdvertisementSexual health is critical to our overall health and well-being, and the social and economic development of communities and countries.\nHowever, in Africa, sexual health education is rarely discussed, leading to sexual dysfunction, endometriosis, Sexually Transmitted Infections (STIs), HIV, and unintended pregnancies.\nSo, I discussed sexual health and how technology can improve our sex lives.\nDavis said, “Public figures, either politicians, journalists, celebrities, or content creators use Facebook and Instagram to engage directly with their followers."
  },
  {
    "headline": "How technology can improve your sex life in Africa",
    "summarized_story": "According to the World Health Organization (WHO), sexual health is more than just the absence of sickness, malfunction, or infirmity.\nAdvertisementSexual assault can lead to sexual dysfunction — a sexual health problem — but there are tech tools to make us feel safe.\nConsequently, technology can help people in Africa access sexual health information since the continent’s Internet population is rapidly increasing.\nOgal believes that technology significantly bridges the sexual health information gap, as many educated youths have smartphones connected to the Internet.\nThe significance of sexual health cannot be overstated, as it allows people to control their reproductive health and emotional well-being in intimate relationships."
  },
  {
    "headline": "Evercare sees patient influx on rising demand for quality health care",
    "summarized_story": "While the impact of forex shortage on the high cost of getting medical care abroad has made Evercare the go-to place, on the one hand, restrictions due to COVID-19 have also been supportive.\nSo we are doing a lot in continuous training and education, changing people’s mindset about patient-centric care,” Shonibare said“What we have also done is our pricing is discounted compared to our competitors.\nWe are also putting processes in place to ensure that people follow guidelines to get the best for the patient”Managed by TPG Capital, the Evercare Hospital is owned by Evercare Health Fund, comprised of some leading development finance institutions and other impact investors.\nThe 165-bed multi-specialty private hospital touts itself as an institution resourced to function in a broad range of specialties from interventional cardiology to neonatal intensive care.\nFemi Olugbile, former health commissioner in Lagos says the government needs to design practical ways to multiply the number of Nigerians under the national health insurance scheme to expand access to care."
  },
  {
    "headline": "Higher oil prices fail to plug trade deficit as in 2019",
    "summarized_story": "Unlike in 2019, higher crude oil prices in 2021 have failed to lift Nigeria’s one and half years’ trade deficit out of the negative due to what analysts blame on stagnating oil production and the country’s increasing dependence on imported goods.\nNigeria’s persistent foreign trade deficit continues to pile more pressure on the exchange rate as negative trade dampens the country’s current account position and foreign reserves.\nNigeria’s crude oil production has been languishing at only two-thirds of its full capacity this year, especially many of its large oil fields in the Niger Delta.\nNigeria’s trade deficit declined by 52.6 percent quarter-on-quarter to N1.9 trillion in Q2-2021 from N3.9 trillion in Q1-2021.\n“You will notice that deficit has been moderating compared to what we had in the previous quarter, that will explain the role of higher oil prices,” Arambada said."
  },
  {
    "headline": "Poverty makes more Nigerians quit school for menial jobs",
    "summarized_story": "The report titled ‘Good Jobs for a New Generation: Delivering Quality Jobs for Young Nigerians After COVID-19’, said about 19.7 million will engage in household agriculture, 13 million in non-farm household enterprises, and 3.9 million holding wage jobs.\nThis could worsen poverty on the continent as informal sector jobs are unlikely to offer secure pathways out of poverty, the report said.\nOver 90.1 million Nigerians are now living in extreme poverty, up from 82.9 million three years ago; according to the World Poverty Clock.\nThe World Bank findings relied on the Nigeria General Household Survey-Panel (GHS) and the COVID-19 National Longitudinal Phone Survey (NLPS) to draw its conclusions.\nThe World Bank recommends more investments in human capital, recouping learning opportunities lost during the Covid-19 crisis."
  },
  {
    "headline": "Woman Found Dead With Multiple Stabs And Slit Throat In Her Delta Apartment – Nigerian Observer",
    "summarized_story": "Woman Found Dead With Multiple Stabs And Slit Throat In Her Delta ApartmentShare FacebookTwitterStumbleuponLinkedInPinterestWARRI – A middle-aged lady, identified as Michelle Bazunu, has been allegedly gruesomely murdered at her residence in Bazunu Street, Warri South council area of Delta State.\nDetails of the incident were still sketchy as at Thursday, but it was gathered that the deceased was found with multiple stab wounds and her throat slit in the early hours of Wednesday, October 13, at No1 Bazunu Street, Warri.\nThe area which is close to the popular Igbudu Market in Warri, is notorious for some heinous crimes.\nSecurity operatives were said to have stormed the area in a raid, a while after the victim was gruesomely, murdered.\nWhen contacted, the Delta State Police Public Relations Officer (PPRO), DSP Bright Edafe, could not confirm the sad incident."
  },
  {
    "headline": "Obaseki, Igbinedion, others pay last respect to late Sir Victor Uwaifo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki; former Governor, Lucky Igbinedion; Edo State Chief Judge, Hon.\nOsaigbovo Iyoha were among dignitaries at the tribute/service of songs held in honour of late music icon, Prof. Sir Victor Uwaifo.\nGovernor Obaseki described Uwaifo as a legend who carved a niche for himself and portrayed Edo State positively to the global community.\nOn his part, Lucky Igbinedion described late Uwaifo as a cultural ambassador and a great musical icon that brought glory to Edo, Nigeria and Africa.\nI thank the Uwaifo family for allowing him to serve the state."
  },
  {
    "headline": "Fire Guts Multi-Million Naira Radio Station In Delta – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – A multi-million Naira privately owned radio station , Rize FM Ogunu, Warri South council area of Delta state, was in the early hours of Thursday, razed, with transmission equipment worth millions of Naira destroyed.\nAs at 9am , fire fighters were still at the scene of the inferno which witnesses said , was caused by an electrical fault at about 1am.\nAlthough no casualty was recorded, the storey building with transmission equipments worth millions of naira, was completely destroyed.\n” What we are concerned about right now is, how to get back on air soonest.\nAsked whether it was really an electrical fault, he said,” How did they know?"
  },
  {
    "headline": "Chevron, PAU Reward Post AWAReS Training Journalists For Excellence – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – Chevron Nigeria Ltd (CNL) , in partnership with the Pan Atlantic University (PAU) , has honoured journalists who have participated in the Advance Writing And Reporting Skills (AWAReS) programme for displaying excellence in their writing skills since graduation.\nThe maiden “Award and Reward Ceremony” was designed to appraise the journalists and see how well they had put to practice the training acquired during the programme.\n“It is my honour to welcome you all to the maiden edition of the post AWAReS event on behalf of Chevron Nigeria Limited.\n“I congratulate the award winners and Pan Atlantic University (PAU), for the successful exercise.\nAmong other faculty staff present were, Dr. Mike Okolo, Dean of the School of Media and Communication, PAU;Opeyemi Gazali, Programme Coordinator, School of Media and Communication, PAU."
  },
  {
    "headline": "N20b Bailout loan: EFCC withdraws case against Kogi govt",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) on Friday withdrew its suit seeking the forfeiture of the N20billion bailout funds granted to the Kogi State Government by Sterling Bank.\nThe money was meant for the payment of Kogi State workers, but was alleged to have been, instead, domiciled in an interest yielding account with the bank.\nJustice Chukwujekwu Aneke granted the order of withdrawal sequel to a motion filed and argued by the counsel to EFCC, Kemi Pinheiro, SAN.\nMr Pinheiro listed six grounds upon which the judge granted the prayer, adding that “the EFCC is a responsible body”.\n“Accordingly, the application is granted as prayed.”Counsel to the Kogi State Government, Sam Erogbo (SAN), commended the EFCC for its “professional approach”."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Deployment of 5G nationwide I97% ready – NCC",
    "summarized_story": "BY EMEKA EJEREThe Nigerian Communications Commission (NCC) is 97% ready for the implementation of 5G deployment in the country, its Executive Vice Chairman, Professor Umar Danbatta, confirmed on Thursday.\nThe NCC boss explained that the NCC is working with operators to implement a number of initiatives to ensure network expansion.\nThese, he said, include an ongoing plan to auction spectrum in 3.5 gigahertz (Ghz) band to operators for the deployment of 5G network in Nigeria.\nThe other day I was at the National assembly, I informed the senate that we were 95 percent ready for 5G.\nPrior to this, a 5G deployment plan was developed and we have since secured Federal Government’s approval.”He stated that the trend has made remote work, virtual meetings, virtual studies, and virtual healthcare delivery, among others, the new normal."
  },
  {
    "headline": "Naira tumbles to record low at official market",
    "summarized_story": "BY EMEKA EJERENaira fell further by 1.68 percent against the U.S dollar at the official market on Thursday, after reaching a record low on Wednesday.\nThis indicates a N6.97 or 2.00 per cent devaluation from N415.30 to a dollar rate it exchanged in the previous session on Wednesday.\nIn July, the Central Bank of Nigeria (CBN) stopped forex sales to the Bureau de Change operators and assured that it would supply forex to legitimate users through the banks.\nHe said naira was artificially strong and that its exchange rate should reflect its actual market value to encourage foreign investment.\n“As for the exchange rate, I think we need to move our rates to [be] as reflective of the market as possible."
  },
  {
    "headline": "Sterling Bank, HFN sign Memorandum of Understanding on digitisation",
    "summarized_story": "Nigeria’s leading lender to healthcare industry, Sterling Bank Plc and the Healthcare Federation of Nigeria (HFN) have signed a Memorandum of Understanding (MoU) that will enable the lender to provide finance for further digitisation of operations of members of HFN as well as offer financial advisory services to them.\nSpeaking at the signing ceremony in Lagos recently, Mr. Obinna Ukachukwu, Divisional Head, Health and Education Sectors of Sterling Bank said, “We are hoping to achieve digitisation, financing and financial advisory services for members of HFN.\nMagnum Trust is one of the legacy banks that formed Sterling Bank during the consolidation in the banking industry.\nShe described the MoU as another step in the right direction and a huge step for all healthcare practitioners because the terms that Sterling Bank is giving them are exceptional.\nThe terms would ensure that HFN members will be able to achieve their objectives through this funding, she said."
  },
  {
    "headline": "Oscar Onyema resigns from Nigerian Exchange Limited board",
    "summarized_story": "Nigerian Exchange Limited (NGX) has announced the resignation of Mr. Oscar N. Onyema, OON, as Non-Executive Director, effective immediately.\nMr. Onyema’s resignation comes on the back of the imminent listing of Nigerian Exchange Group Plc (NGX Group or The Group), where he serves as the Group Managing Director/Chief Executive Officer (GMD/CEO), on the main board of NGX, a statement from the exchange said.\nConsequent upon this resignation by Mr. Onyema, NGX will uphold Rule 184(2)(a) of the Securities and Exchange Commission Consolidated Rules 2013 which states that “A securities exchange shall have a code of conduct for its council members or board which shall be approved by the Commission, and shall contain amongst others the following provisions, to wit, that the council members or board shall: (a) not be a staff of a quoted company and its subsidiaries.”Speaking on the development, the Chairman, NGX, Mr. Abubakar Mahmoud, SAN, OON stated, “On behalf of the Board and Management of The Exchange, I extend our heartfelt gratitude to Mr. Onyema for his selfless service to The Exchange.\nAs he transitions into this new phase as the GMD/CEO of a listed company, we reiterate our commitment to act in the best interest of all Issuers to the benefit of all stakeholders in the capital market.”The Chief Executive Officer, NGX, Mr. Temi Popoola, CFA noted that, “NGX owes its solid foundation to the effort of leaders like Mr. Onyema who worked tirelessly to build a capital market infrastructure we can be proud of.\nDuring his time as a Non-Executive Director on the Board of NGX, he brought to bear his wealth of experience and the unique institutional knowledge he possesses and we are grateful for that.”To commemorate the listing of NGX Group on NGX, Mr. Popoola will host the Group Chairman, NGX Group, Otunba Abimbola Ogunbajo and the GMD/CEO, Oscar N. Onyema, OON and other key stakeholders to a virtual Closing Gong Ceremony on Friday, 15 October 2021."
  },
  {
    "headline": "Kwara Monarch’s Twin Children, 3 Staff Kidnapped",
    "summarized_story": "Suspected kidnappers have abducted six-year-old twin children of a traditional ruler in Kwara State, the Owalobo of Obbo-Aiyegunle, Oba Samuel Adelodun.\nThe suspected kidnappers also abducted the monarch’s driver, Kunle; a security man, Lawrence, and a maid, Bukunmi.\nThe Osi community, according to sources, was in pensive mood, following the unfortunate incident.\nADVERTISEMENTHe said the monarch has reported the abduction of his two children and three staff to the police.\n“The commissioner of police wishes to advise members of the public with useful information that can aid the quick rescue of the victims to make such information available to the command."
  },
  {
    "headline": "Kwara Monarch’s Twin Children, 3 Staff Kidnapped",
    "summarized_story": "Suspected kidnappers have abducted six-year-old twin children of a traditional ruler in Kwara State, the Owalobo of Obbo-Aiyegunle, Oba Samuel Adelodun.\nThe suspected kidnappers also abducted the monarch’s driver, Kunle; a security man, Lawrence, and a maid, Bukunmi.\nThe Osi community, according to sources, was in pensive mood, following the unfortunate incident.\nADVERTISEMENTHe said the monarch has reported the abduction of his two children and three staff to the police.\n“The commissioner of police wishes to advise members of the public with useful information that can aid the quick rescue of the victims to make such information available to the command."
  },
  {
    "headline": "Release #EndSARS Panel Reports, YIAGA Africa Tells Federal Govt",
    "summarized_story": "Leading civil society organisation (CSO), YIAGA Africa, has called on the federal government to immediately ensure the completion of the #EndSARS panel sittings, make the reports public and fully implement the five-point demand by the protesters.\nIn compliance with the directive, 29 state governments and the FCT set up Judicial Panels of Inquiry.\nYIAGA Africa also called on other states where the panels have concluded their sittings to release the panel reports and make it available to the public.\n“As we mark one year of the #EndSARS protest this October, YIAGA Africa call on the State Governments where panels have been suspended to resume sitting and conclude the hearings.\n“The conclusion of the sittings of the Panels and the release of the reports will ensure that victims of police brutality access justice,” it added."
  },
  {
    "headline": "Release #EndSARS Panel Reports, YIAGA Africa Tells Federal Govt",
    "summarized_story": "Leading civil society organisation (CSO), YIAGA Africa, has called on the federal government to immediately ensure the completion of the #EndSARS panel sittings, make the reports public and fully implement the five-point demand by the protesters.\nIn compliance with the directive, 29 state governments and the FCT set up Judicial Panels of Inquiry.\nYIAGA Africa also called on other states where the panels have concluded their sittings to release the panel reports and make it available to the public.\n“As we mark one year of the #EndSARS protest this October, YIAGA Africa call on the State Governments where panels have been suspended to resume sitting and conclude the hearings.\n“The conclusion of the sittings of the Panels and the release of the reports will ensure that victims of police brutality access justice,” it added."
  },
  {
    "headline": "State Congresses: Kano APC Appeals To Aggrieved Senators, Reps",
    "summarized_story": "Our correspondent reports that among the petitioners who expressed concerns over the arrangement for the state congress included senators and members of the House of Representatives.\nThey are all witnesses to this fact because they won election under the party platform with or without these delegates.\nWe see those from Kano Central as the people of Senator Shekarau, those from Kano North are Barau’s loyalists, those from Kano South are for Senator Kabiru Ibrahim Gaya while everybody in the state is for the governor.\nThose who signed the petition include among others, Senator Ibrahim Shekarau, Senator Barau Jibrin, Hon Tijjani Abdulqadir Jobe, Hon Nasiru Abdua Nasarawa and Hon Sha’aban Sharada among others.\nThey resolved in their meeting that they would resist any attempt by the state party leadership to carry out the state congress in a manner that will impose party officers on members."
  },
  {
    "headline": "Inclusive Social Protection, Key Achievement of Buhari Administration – Minister",
    "summarized_story": "By GBENGA ADEOLAThe Minister of Information and Culture, Alhaji Lai Mohammed, saidPresident Muhammadu Buhari has demonstrated uncommon passion forinclusive social protection through the creation of lasting structuresand institutions that will outlast his administration.\nIn addition, he said the Buhari Administration has also created theNational Commission for Persons with Disabilities (NCPWD), headed byan Executive Secretary from the community of persons withdisabilities, in the person of Mr. James David Lalu, to formulate andimplement policies favourable to persons with disabilities.\n“Another significant step came in January 2019 with the ratificationof the Discrimination Against Persons withDisabilities (Prohibition) Act 2018, which has become a major plankfor ensuring inclusive social protection in thecountry.\nAlhaji Mohammed commended the FRCN for sustaining its platforms ofpublic engagement beyond news and programming, describing thecorporation’s annual lecture series as an opportunity for all to keyinto the various programmes of government to foster inclusion andparticipatory governance.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Inclusive Social Protection, Key Achievement of Buhari Administration – Minister",
    "summarized_story": "By GBENGA ADEOLAThe Minister of Information and Culture, Alhaji Lai Mohammed, saidPresident Muhammadu Buhari has demonstrated uncommon passion forinclusive social protection through the creation of lasting structuresand institutions that will outlast his administration.\nIn addition, he said the Buhari Administration has also created theNational Commission for Persons with Disabilities (NCPWD), headed byan Executive Secretary from the community of persons withdisabilities, in the person of Mr. James David Lalu, to formulate andimplement policies favourable to persons with disabilities.\n“Another significant step came in January 2019 with the ratificationof the Discrimination Against Persons withDisabilities (Prohibition) Act 2018, which has become a major plankfor ensuring inclusive social protection in thecountry.\nAlhaji Mohammed commended the FRCN for sustaining its platforms ofpublic engagement beyond news and programming, describing thecorporation’s annual lecture series as an opportunity for all to keyinto the various programmes of government to foster inclusion andparticipatory governance.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Why I started NobodyLikeWoman challenge – Simi",
    "summarized_story": "Award-winning singer, Simisola Kosoko, simply known as Simi, has revealed the reason behind the #NobodyLikeWomen challenge, which she pioneered on Instagram.\nSimi started the challenge last Friday with a cryptic message, ‘How can she ask for that kind of money?\nIs she not pregnant?’Taking a cue from her, dozens of female celebrities and women started sharing pictures and images of themselves with stereotypic statements.\nAccording to Simi on Thursday, she started the challenge to help women confront the things that have been said to demean them.\nThe mother-of-one said, “In less than 12 hours, by the grace of God, my single “Woman” will be with you."
  },
  {
    "headline": "Why I started NobodyLikeWoman challenge – Simi",
    "summarized_story": "Award-winning singer, Simisola Kosoko, simply known as Simi, has revealed the reason behind the #NobodyLikeWomen challenge, which she pioneered on Instagram.\nSimi started the challenge last Friday with a cryptic message, ‘How can she ask for that kind of money?\nIs she not pregnant?’Taking a cue from her, dozens of female celebrities and women started sharing pictures and images of themselves with stereotypic statements.\nAccording to Simi on Thursday, she started the challenge to help women confront the things that have been said to demean them.\nThe mother-of-one said, “In less than 12 hours, by the grace of God, my single “Woman” will be with you."
  },
  {
    "headline": "Presidency 2023: List of Prominent PDP Chieftains Who Reportedly Want Party’s Ticket Open to All Zones",
    "summarized_story": "On Thursday, October 14, Senator Iyorchia Ayu, emerged as the consensus chairmanship candidate of the Peoples Democratic Party (PDP).\nWith the northern region on the verge of producing the PDP’s national chairman, political analysts speculate that the party may zone its presidential ticket to the south.\nHowever, emerging reports by the Nation and The Punch newspapers have indicated that some prominent members of the PDP want the presidential ticket thrown open, a situation that may allow the north to still produce the party’s presidential candidate, despite getting the chairmanship slot.\nThe Igbo apex group called on the PDP to withdraw the report and zone its presidential ticket to the southeast ahead of the 2023 general elections.\nOhanaeze, in a statement released on Thursday, March 18, described the committee’s report as most despicable, un-reflective and unconscionable."
  },
  {
    "headline": "List: Names, Ages of 11 Nigerians Arrested, Charged by US for $9m Fraud, They Face Up to 30 Years in Prison",
    "summarized_story": "The United States Department of Justice has charged 11 Nigerians with conspiracy to commit money laundering, conspiracy to commit bank fraud, and aggravated identity theft.\nA US Marshal stands outside federal court in the Brooklyn borough of New York, U.S., on Wednesday, Sept. 30, 2020.\nPhoto credit: Paul Frangipane/BloombergNine of the suspects were arrested on Wednesday and dragged to court in the Southern District of New York.\nOne suspect was arrested in the Southern District of Texas and was also taken to the federal court in the district while the remaining one remains at large.\nIn some instances, business email compromise fraud schemes were used to trick businesses into transferring funds to bank accounts."
  },
  {
    "headline": "BREAKING: Ayu Emerges PDP’s Consensus National Chairmanship Candidate",
    "summarized_story": "Former Senate President, Dr Iyorchia Ayu has emerged the consensus candidate of the Peoples Democratic Party, PDP, ahead of its October 31 national elective convention.\nAyu’s emergence followed hours of continuous meetings by PDP stakeholders of Northern extraction in Abuja in the past 72 hours.\nMore details soon…"
  },
  {
    "headline": "BREAKING: Police Arrest Herder, 73 Cows, 13 Sheep For Alleged Farm Destruction",
    "summarized_story": "The police in Jigawa have arrested a 25-year-old herder, who allegedly trespassed into a farmland and destroyed crops worth N200,000, at Takatsaba village, Suletankarkar Local Government Area of the state.\nASP Lawan Shiisu, the command Police Public Relations Officer (PPRO), in the state, confirmed the arrest in a statement in Dutse on Thursday.\nShiisu said the police also arrested his 73 cows and 13 sheep that strayed into the farmland on Oct. 10.\n“Information received from a source revealed that on Oct. 10, at about 1920hrs, a herder trespassed into the farmland of Habu Sa’idu of Takatsaba village in Suletankarkar LGA and his animals ate and destroyed his farm crops.\nShiisu said investigation into the matter is ongoing and efforts are on to arrest the fleeing suspects."
  },
  {
    "headline": "Breaking: Ex-US President, Bill Clinton, hospitalised",
    "summarized_story": "Former US President Bill Clinton has been receiving hospital treatment in California for a “non-Covid-related infection”.\nMr Clinton, 75, is “on the mend” and “in good spirits” after being admitted to UC Irvine Medical Center on Tuesday, spokesman Angel Ureña said.\nThough it is unclear what led to the admission, Mr Clinton has a history of heart disease.\nA statement from his doctors said he had received antibiotics and fluids.\nThe physicians added that Mr Clinton remained at the hospital for “continuous monitoring”."
  },
  {
    "headline": "PDP national chair: Ayu emerges north’s consensus candidate",
    "summarized_story": "Ahead of the Peoples Democratic Party (PDP) National Convention slated for 30th and 31st October, the northern stakeholders unanimously adopted former President of the Senate Dr Iyorchia Ayu as their consensus candidate for the position of national chairman.\nAfter a few hours’ meeting at Bauchi state Governor’s Lodge, Abuja Thursday, Chairman Convention Planning Committee who also doubles as Chairman 20-man committees on Northern Consensus candidate, Governor Ahmadu Umaru Fintiri declared Ayu as the north’s candidate for the position of national chairman.\n“Distinguished Senator Dr Iyorchia Ayu has emerged as a consensus candidate of the north.\nBlueprint gathered that the south micro-zoned the party’s deputy national chairman (South), National Publicity Secretary and Deputy National Secretary to the south-west.\nHe said: “We in the Osun state chapter of our party prefer Professor Wale Oladipo as deputy national chairman (South) of our great party."
  },
  {
    "headline": "Anambra guber: INTERPOL, FBI, others lead 34,587 cops for security",
    "summarized_story": "Inspector General of Police Usman Baba has deployed 34,587 police personnel and three helicopters as a major security measure to guarantee safe, secure, and credible electoral process in the November 6 governorship election in Anambra state.\n“Drawing from our previous election security operations, we have also emplaced adequate forward and reverse logistics arrangement to address the welfare needs of all personnel being deployed for operations,” the police boss said.\nJustice Odili equally upheld the judgment of the Court of Appeal, Kano division which had earlier dismissed the suit filed Okeke.\n“This amounts to crass abuse of court process an attempt to get favourable judgment to suit your own purposes.\n“In this regard, the ADP emphatically demanding that the electoral body to test-run the electronic transfer of votes in the forthcoming Anambra Gubernatorial election."
  },
  {
    "headline": "Smile And Snap! Itel S17’S Smile Selfie Feature is out of this world -NigPilot",
    "summarized_story": "Capture Your Smile With itel S17 Smile Selfie CameraWe all know that smiles can be a soothing balm to the soul.\nAnd because itel understands how precious smiles are, capturing them with itel S17’s AI-powered Smile Selfie camera is the next best thing to do.\nThe goal is to capture all your treasured memories and itel S17’s selfie camera does that for you effortlessly.\nOnce you open the itel S17 selfie camera, tap on a photo, and choose the beauty level you like.\nWith its advanced smile selfie feature that is just out of this world, itel S17 is the smartphone for those who love good things and want to enjoy them comfortably."
  },
  {
    "headline": "African Aviation Ministers reject imposition of vaccine passport for air travellers -NigPilot",
    "summarized_story": "African Ministers of Aviation have described the proposal to impose vaccine passports on air travellers as unacceptable and an act of discrimination against the African continent, which still has a considerable number of its citizens who are yet to receive the vaccines.\nThis was even as they described the proposal as going against the intent of the Chicago Convention.\nAviation is also capable of stimulating recovery and growth of the global economy by acting as an enabler and multiplier of economic activity”.\n“Considering that the global aviation industry operates as an interconnected ecosystem, it is therefore imperative that all the States of the world implement the ICAO Council Aviation Recovery Taskforce (CART) recommendations and guidance, which are based on the latest development of the COVID-19.\n“ICAO, in collaboration with relevant stakeholders, is required to bring to maturity in short term a consensual modality for establishment and deployment of a global health passport as well as the specification of infrastructure (soft/hard) and training of professionals,” he added."
  },
  {
    "headline": "Yuletide: FG meets NUPENG promises to fix failed roads -NigPilot",
    "summarized_story": "It said the measure is to cushion the plight of road users during the yuletide.\nThe Minister however blamed the worrisome rate of road mishaps on the violation of traffic rules by road users.\nAccording to him, “disobedience of traffic regulations, not bad roads is largely responsible for road accidents.\nWe appeal to you to go back to your people and tell them to do the right thing.\nIn his response, NUPENG Deputy National Chairman, Lucky Osezuwa, appealed to the government to made a good promise to fix the roads, adding that they shelved the planned industrial action because of the engagement with the federal government."
  },
  {
    "headline": "2023: Osinbajo perfect replacement for Buhari – APC group -NigPilot",
    "summarized_story": "Support group within the ruling All Progressives Congress APC, the Progressives Consolidation Group PCG has written the Gov.\nMai Mala Buni-led Caretaker Extraordinary Convention Planning Committee CECPC of the party on the need to support Vice President Yemi Osinbajo to replace President Muhammadu Buhari in 2023 when the latter finishes his second term in office.\nThe Buni leadership had on October 4 written the PCG, approving it’s application as one of he support groups within the party.\n“Compliance with such continuity ethos will ensure that innumerable good works and outstanding legacies of President Muhammadu Buhari proceeds hitch free to the glory of the Almighty God, and to the immense benefits of our Nigerian citizens, and for the emulation of other African Leaders.\n“Your decision for approval of our recognition as a Support Group of the Party will further reinvigorate our drive towards ensuring the involvement of citizens in all geopolitical zones in this great enterprise."
  },
  {
    "headline": "To Raise IGR, States Need To Think Like Sovereign Entities – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo on Thursday tasked states to think out of the box in raising their respective Internally Generated Revenues.\nHe made the remark at the maiden edition of Ekiti State’s maiden investment forum in Ado-Ekiti.\n“Thinking differently, there is a need for a sub-national to think like a sovereign State,” the Vice President said.\n“It would therefore be very important for Ekiti State to leverage its famed love and passion for education by focusing on Science, Technology, Engineering, and Mathematics.\nEkiti State was strongest in the Skills and Labour and Infrastructure and Security indicators where it had an average score of 5.35 and 5.05, respectively."
  },
  {
    "headline": "Deployment Of 5G Nationwide Is 97% Ready – NCC",
    "summarized_story": "The Nigerian Communications Commission (NCC) has confirmed it is 97% ready for the implementation of 5G deployment in the country.\nHe explained that the NCC is working with operators to implement a number of initiatives to ensure network expansion.\nREAD ALSO: Lagos Govt Extends Period Of Traffic Diversion On Apapa/Oshodi ExpresswayThese, he said, include an ongoing plan to auction spectrum in 3.5 gigahertz (Ghz) band to operators for the deployment of 5G network in Nigeria.\nThe other day I was at the National assembly, I informed the senate that we were 95 percent ready for 5G.\nPrior to this, a 5G deployment plan was developed and we have since secured Federal Government’s approval.”He stated that the trend has made remote work, virtual meetings, virtual studies, and virtual healthcare delivery, among others, the new normal."
  },
  {
    "headline": "Supreme Court Affirms Soludo As APGA’s Governorship Candidate",
    "summarized_story": "The Supreme Court on Thursday affirmed Professor Charles Soludo as the governorship candidate of the All Progressives Grand Alliance (APGA) in the Anambra election slated to hold on November 6, 2021.\nAccording to the Supreme Court, the appellate court was right when it quashed a Jigawa State High Court judgement that recognised a parallel primary election that was conducted by the Jude Okeke-led faction of APGA.\nIt will be recalled that Soludo emerged from the primary election that was organised by the Chief Victor Oye-led faction of the party.\nThe electoral body had explained that its decision was based on court orders, a move Soludo described as surprising.\nFollowing INEC’s move, Soludo received the party’s flag and launched his campaign at an event – held in Awka – and witnessed by hundreds of APGA’s faithful at the Alex Ekwueme Square."
  },
  {
    "headline": "Military Confirms Death Of ISWAP Leader, al-Barnawi",
    "summarized_story": "﻿The leader of the Islamic State West Africa Province (ISWAP) jihadist group, Abu Musab al-Barnawi, is dead, Chief of Defence Staff General Lucky Irabor, said on Thursday.\nISWAP has not given any confirmation of al-Barnawi’s death and the army has claimed before to have killed jihadist commanders only for them to reappear.\nAl-Barnawi is the son of the founder of Nigeria’s Boko Haram militant group which has been fighting a grinding Islamist insurgency in the northeast since 2009.\nSince Shekau’s death, security sources say, al-Barnawi had consolidated ISWAP’s control in the northeast and the Lake Chad region but pockets of Boko Haram loyalists have been fighting back.\nMore than 40,000 people have died in the Boko Haram conflict and around two million more people have been displaced from their homes by the violence."
  },
  {
    "headline": "CBN Issues Guidelines On Disposal Of Non-Permissible Income",
    "summarized_story": "The Central Bank of Nigeria has issued its guidelines on the disposal of Non-Permissible Income (NPI) for Non-Interest Financial Institutions (NIFI).\nAccording to a statement which was signed by the Director, Financial Policy and Regulation Department of the CBN, Chibuzo Efobi, the guidelines were issued as part of efforts to standardise the treatment and disposal of NPI by NIFI in the country.\nEfobi in the statement addressed to all NIFI said the NPI shall be put in a dedicated NPI account and shall not be mingled with the funds of non-interest banks.\nNon-permissible income is any income that accrues to non-interest finance institutions, such as interest income, penalties for delayed payment of debt obligations, or any income declared by the ace of the institution.\nSee the full guidelines below:"
  },
  {
    "headline": "Osinbajo urges Nigerians to partner FG in providing care for homeless children -",
    "summarized_story": "Nigeria’s vice President ,Professor Yemi Osibanjo has called on well meaning Nigerians to join hands with the government to provide adequate care for homeless children saying government alone cannot do it.\nHe said the provision of adequate welfare for vulnerable women and Children in the Society should be collectively shouldered by government and spirited individuals.\nThe Vice president made this known at the inauguration of an Orphanage in Ondo state capital.\nAccording to him, 90 percent of Nigerian children are homeless; a figure that seems to be growing rapidly.\nOther dignitaries including the minister of women affairs and his counterpart in charge of Niger Delta affairs lauded the initiative."
  },
  {
    "headline": "BREAKING: Prof. Adebowale emerges 13th Vice Chancellor of University of Ibadan -",
    "summarized_story": "Professor Kayode Adebowale of the department of Chemistry has emerged as the 13th Vice Chancellor of the University of Ibadan.\nThe Chairman while announcing his emergence said, the professor of Chemistry emerged out of the 15 candidates who applied for the position at the initial stage.\nAll the members of council scored the candidates in order of merit were shortlisted for the final interview.\nIn his remark after his announcement, the new Vice Chancellor, Professor Oyebode Adebowale called for the support of members of the school’s administration in order to take the institution to an enviable height.\nProfessor Kayode is a Professor of Chemistry and the current Deputy Vice Chancellor of administration at the University of Ibadan."
  },
  {
    "headline": "Ondo doctors lament over poor working condition, urges govt to pay full salary -",
    "summarized_story": "The Nigeria Medical Association, Ondo State Chapter has raised the alarm over mass exodus of Medical doctors under the state government payroll over poor condition of Service.\nThe doctors said the crises in the state health sector has been worsened by the irregular percentage of salaries being paid to doctors and hostile work environment.\nThe NMA chairman also urged the state government to embark on massive employment of health personnel in secondary and tertiary healthcare levels in the state.\n“The crises in the state health sector have been worsening by the irregular percentage of salaries being paid and the hostile work environment.\n“This has resulted in the withdrawal of services at different times and a mass exodus of doctors and other health care workers."
  },
  {
    "headline": "Police arrest four bandits in Adamawa over attack on Police divisional HQ -",
    "summarized_story": "Adamawa state Police command has arrested four bandits who attacked a divisional police station in Ngurore where a nursing mother was abducted with her daughter.\nParading the suspects before newsmen, spokesperson for the command, DSP Suleiman Nguroje, said the bandits were through credible intelligence arrested in their various hideouts.\nHe explained that the arrested bandits belong to a seven men gang who have been terrorising Adamawa and neighboring Taraba state.\nDSP Suleiman Nguroje, said the arrest followed the directives of the Commissioner of Police CP Mohammed Ahmed Barde, who ordered that the hoodlums must be brought to book.\nTherefore, since we couldn’t get get him, we kidnapped a nursing mother with her baby."
  },
  {
    "headline": "Escaped Kenyan Child Serial Killer Lynched By Mob",
    "summarized_story": "A mob in western Kenya has killed a self-confessed serial killer who escaped from custody two days ago, police say.\nMasten Wanjala was traced by villagers to a house in Bungoma town and beaten to death, they say.\nHe reportedly returned to the home of his parents – who have disowned him – and was subsequently strangled by neighbours who found out he was there, an eyewitness told Kenya’s Standard newspaper.\nHe tried to stave off suspicious locals by moving to a nearby house, Bungoma’s police commander told the paper.\nThere are also growing calls for the resignation of Kenya’s police chief over the escape, which shocked the nation."
  },
  {
    "headline": "Day of Mourning in Lebanon after Bloodshed at Protest",
    "summarized_story": "Lebanon is holding a day of mourning after six people died and dozens were hurt in some of the worst violence for years in the capital, Beirut.\nGunfire broke out on Thursday during a protest by Shia Muslim groups against the judge investigating last year’s huge blast at the city’s port.\nBut families of those who died in the port blast died back him, saying MPs are trying to evade justice.\n“Keep your hands off the judiciary,” they warned the cabinet on Wednesday after ministers allied to Hezbollah demanded that Judge Bitar be replaced.\nThe port blast happened after a fire detonated 2,750 tonnes of ammonium nitrate, a combustible chemical widely used as agricultural fertiliser, that had been stored unsafely in a port warehouse for almost six years."
  },
  {
    "headline": "Cameroon Authorities Urge Calm after Police Kill Five-year-old Girl",
    "summarized_story": "Authorities in English-speaking western Cameroon have appealed for calm after the killing of a five-year-old girl by a policeman in the troubled region and his subsequent lynching by an angry crowd.\nA gendarme opened fire and a schoolgirl was fatally wounded,” she said.\nAn investigation has been opened into the death of the girl and the lynching of the policeman, the ministry said.\nOthers waved 500 franc CFA currency notes ($0.88), which they said was how much the girl’s parents refused to pay before the gendarme opened fire.\nSeveral said the incident was part of a pattern of heavily militarised security forces harassing residents."
  },
  {
    "headline": "Propetrol’s Ebohon Bags Forbes Outstanding CEO Award",
    "summarized_story": "Founder and CEO of Propetrol Limited, Harry Ebohon, has been slated to receive the Outstanding CEO Award at the Forbes Energy 2021 Best of Africa awards.\nPropetrol is renowned as a leader among oil and gas firms successfully providing ethical solutions to the industry that drives Africa’s biggest economy.\nFrom its days of humble beginnings as a petroleum products hauling services provider, Propetrol now has proven capabilities in bunker trading, oil and gas products trading, trade financing, and value engineering across shipping and general maritime services.\nThe letter continued: “You have repeatedly shown yourself to be a thought leader, leading the charge in redefining the bunker trading industry in West Africa.\n“Under your leadership, Propetrol’s business model continues to evolve, expanding operations to other niche markets in Southern Africa and South Asia."
  },
  {
    "headline": "Tunisia President Saied Withdraws Diplomatic Passport of Predecessor",
    "summarized_story": "Tunisia’s President Kais Saied has said he will withdraw the diplomatic passport of one of his predecessors, Moncef Marzouki, after the latter urged France to end its support for the North African country under the former’s leadership.\nLast week, in a speech widely shared online, France-based Marzouki, who , called on the French authorities “not to help the dictatorial regime in Tunisia”.\nSaied on Thursday asked the justice minister to open an investigation into allegations that Marzouki had conspired against state security.\n“I will withdraw his diplomatic passport because he is among the enemies of Tunisia,” Saied said, referring to Marzouki, but without naming him.\nAlong with other members of the G7 group of advanced economies, which include France, it has urged Saied to return to a constitutional order in which an elected parliament plays a significant role."
  }
]