[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "ElectHER, Platform Capital host Banda, ex-President of Malawi",
    "summarized_story": "The fourth President of Malawi and second female democratically-elected President in Africa, Dr Joyce Banda was hosted by ElectHER and Platform Capital to an intimate evening on Thursday, July 21.\nOn her part, the Chief Host, Dr. Akintoye Akindele, Chairman, Platform Capital Group also noted, “Our women have woken up and become entrepreneurs in the proper world.\nIt is not an infringement or disturbance to the world order but rather it is about correcting what is fundamentally wrong with the current world order,” says the ex-president.\nShe emphasised that it is about creating or having a new world order that is built on the principles of equality, fairness and inclusivity and, accordingly and effectively, putting an end to the world order that is built and based on gender prejudices, predispositions and constructions.\nThe session was moderated by Akindele and Faborode to further highlight the importance of increased women participation in government and business."
  },
  {
    "headline": "INEC deadline: Sanwo-Olu okays 4 work-free days for Lagos workers to get PVCs",
    "summarized_story": "For Wednesday, July 27, the Grade Levels affected are 02, 04, 08 and 13.\nThursday, July 28, Grade Levels 05, 09, 12 and 17 while Friday, July 29, is dedicated for Grade Levels 06, 10, 14 and 16.\nThe INEC Resident Electoral Commissioner, REC, in Lagos State, Mr Olusegun Agbaje had earlier, disclosed that statistics showed that the state currently had about seven million registered voters.\n“In Lagos state as at Monday (July 18), those who registered online are 640, 560 but many of them have not completed registration.\n“The total number of registered voters in Lagos state before the commencement of the ongoing CVR is 6,570,291, and if we add the new registrants, we have about seven million registered voters,” Agbaje said."
  },
  {
    "headline": "ICPC moves to end illicit financial flows in private sector",
    "summarized_story": "Prof. Bolaji Owasanoye, the Chairman, Independent Corrupt Practices and Other Related Offences Commission (ICPC), says the commission is committed to ending Illicit Financial Flows (IFFs) in the private sector.\nOwasanoye stated this on Monday at the ‘Draft Model Financial Transparency Code Developed for the Private Sector’ review held at the commission’s headquarters in Abuja.\nThe chairman, who was represented by the Secretary of ICPC, Prof Musa Abubakar, said that efforts were ongoing to strengthen the private sector to hinder corruption within the country’s sector.\nDr Kolawole Ebire, the lead presenter in his presentation emphasised that the code scheme of IFFs for private sector was aimed at improving transparency.\nHe said the Draft Code upon implementation would reduce loss of pubic revenue in commercial transactions."
  },
  {
    "headline": "Ortom to striking ASUU-BSU: End sympathy strike or I’ll stop your salaries ￼",
    "summarized_story": "By Peter Duru, MakurdiGovernor Samuel Ortom of Benue state, Monday, threatened to stop paying the salaries of members of the Academic Staff Union of Universities, ASUU, Benue State University, BSU, branch if they fail to call off the ongoing sympathy strike with the national body.\nHe noted that the sympathy strike had gone beyond the allowed three days and appealed to the lecturers to return back to the classroom in the interest of Benue children.\nThe Governor said: “I have been paying their salaries; I don’t know why the lecturers are extending their sympathy strike beyond the allowed days.\n“Ordinarily there shouldn’t be any strike at the Benue State University at least they wouldn’t have gone beyond the days allowed for sympathy strike.\n“So it is either they come back or I will stop paying them and I will use the resources for something else."
  },
  {
    "headline": "Unending Banditry: Don’t review national strategy, stakeholders should pull together, make it work – NDC",
    "summarized_story": "**Says Defence College Has Graduated 2, 549 Participants in 30 years including, 254 Foreign Military GeneralsBy: Kingsley Omonobi – Abuja.\nHe said, “I think the national security strategy as it is, is not due for review because it’s just been reviewed in 2019.\nIncidentally I was one of the teams that reviewed the document, it’s all encompassing and it is current.\n“Of course, don’t forget that the document is solely owned by Nigerians.\nIn terms of defence diplomacy, I gave you the statistics of 254 foreign participants that this college have graduated."
  },
  {
    "headline": "Buhari consoles Court of Appeal President, Justice Dongban-Mensem over son’s death",
    "summarized_story": "President Muhammadu Buhari has consoled the Court of Appeal President, Hon.\nJustice Monica Dongban-Mensem, over the loss of her son Prince Paeke Dongban.\nPresident Buhari described the death of the young mathematician as tragic.\nThe President noted that he was saddened to learn about the sudden demise.\n“With his passing away, a promising public career has been tragically cut short."
  },
  {
    "headline": "Terrorists attempting Nigeria Law School invasion ambush Buhari’s guard in Abuja",
    "summarized_story": "The Presidential Guards Brigade was in a gun duel with terrorists on Monday in Abuja.\nThree of the highly-trained officers suffered serious injuries as they were ambushed by the insurgents.\nDAILY POST reports that there are fears the gunmen planned to attack the Nigerian Law School.\nThe Presidential Guards Brigade, an elite arm of the Nigerian Army, is responsible for protecting the President of Nigeria.\nThe attack occured just a day after terrorists threatened to abduct President Muhammadu Buhari and Kaduna Governor, Nasir El-Rufai."
  },
  {
    "headline": "Kwara, tertiary institutions’ unions sign new minimum wage payment agreement",
    "summarized_story": "The Kwara State Government has signed an agreement with the leadership of the Joint Public Service Negotiating Council in the state tertiary institutions to commence payment of the new minimum wage to its members.\nThe State Head of Service, Mrs Susan Modupe Oluwole, led the state government team while the unions were led by the state Chairman of Nigerian Labour Congress (NLC), Comrade Issah Ore, to sign the agreement.\nIn her remark, the Head of Service expressed delight at the maturity, understanding, and patience exhibited by the parties involved in the negotiation.\nThe NYC Chairman in his remark described the signing of the agreement as a landmark achievement in the Government /Labour relationship in the state.\nHe asserted that the Labour union in the state has been cooperating and showed understanding with the government on issues relating to workers’ welfare packages."
  },
  {
    "headline": "Kogi High Court Judges begin annual vacation",
    "summarized_story": "Judges of the High Court of Justice, Kogi State will commence their annual vacation on Monday, 1st August, 2022.\nSaeed said the annual vacation is pursuant to Order 9, Rule (4)(2) of the High Court (Civil Procedure Rules), 2006, under the hand of the Hon.\nActing Chief Judge of Kogi State, Hon.\nActing Chief Judge, all other Judges of the High Court of Justice of the State would proceed on the annual one month vacation on Monday, 1st August, 2022.\nJustice Rukayyat Ayoola of the High Court of Justice as the Vacation Judge for the period of the vacation."
  },
  {
    "headline": "Gov. Bello appoints Seven new Permanent Secretaries in Kogi",
    "summarized_story": "Kogi State Governor, Yahaya Bello has approved the appointment of seven new Permanent Secretaries in the state.\nThe newly appointed Permanent Secretaries will fill some of the vacancies that exists in the Kogi StateCivil Service.\nKogi State Head of Service, Mrs Hannah Odiyo disclosed this in a statement made available to DAILY POST on Monday.\nThe newly appointed Permanent Secretaries are Jibrin Sanda Alhaji, Ali Gloria Eriawata, Ujah Hannah Ilemona and Oloruntoba Iyabo ElizabethOther appointed Permanent Secretaries are Muhammed Kassim Imam, Yakubu Suleiman Aliu andItodo Joseph Daniel.\nWhile appreciating Governor Bello for approving the appointments which she noted are based on merit, fairness and competence, Mrs Odiyo urged the newly appointed Permanent Secretaries to justify the Immense confidence reposed in them by being dedicated to duties and loyal to the present administration."
  },
  {
    "headline": "Freed train hostage The Nation Newspaper",
    "summarized_story": "One of the freed kidnapped victims of the Abuja-Kaduna train attack, Hassan Uthman, has recalled his ordeals in captivity.\nSpeaking in an interview with the BBC Hausa, Uthman thanked Almighty Allah for regaining freedom.\nHe said last Friday their relations attempted to rescue them but the government did not allow them to proceed on the journey.\nHe said the relations made a second attempt on Monday and were successful in rescuing three of them from captivity.\nHe recalled that they were initially sleeping on the bare ground in the thick forest before they were provided with mats."
  },
  {
    "headline": "BBNaija S7: Eloswag is first HoH The Nation Newspaper",
    "summarized_story": "Big Brother Naija Season seven housemate Eloswag has won the first ever Head of House (HoH) of the show.\nEloswag defeated other housemates in the HoH game on Monday evening.\nBella, Christy O, Daniella, Diana, Phyna, Hermes, Groovy and Giddyfia have been disqualified to participate next HoH game.\nThe eight housemates were disqualified as they failed to transport as many ping pong balls as possible from one end to another during the arena game.\nThe rule of the game said any housemate who mistakenly drops his/her ping pong ball will be disqualified from the HoH game."
  },
  {
    "headline": "I’ve everything it takes to win 2023 presidency",
    "summarized_story": "The presidential candidate of the Labour Party (LP) Peter Obi has assured he is in the race to win.\nHe said he has everything it takes to win the 2023 presidential election.\n“We are not just on social media.\nWe have people outside social media that are listening to us and they believe in us.\nI have everything it takes to win this election.”"
  },
  {
    "headline": "Terrorists attack Presidential Guards after threat to abduct Buhari The Nation Newspaper",
    "summarized_story": "Three soldiers were wounded during the attack, which has thrown residents of the Federal Capital Territory (FCT) into a panic.\nThe bandits were headed to the Nigerian Law School in Bwari when they ran into the troops.\nAccording to one of the sources, troops of 7 Guards Battalion on routine patrol along Kubwa – Bwari road were ambushed by the suspected terrorists.\nWhen contacted, Assistant Director Army Public Relations, Guards Brigade, Captain Godfrey Abakpa, confirmed that soldiers were attacked by suspected terrorists but were repelled successfully.\nHe added the wounded soldiers have been evacuated to a medical facility and were receiving treatment."
  },
  {
    "headline": "Terrorists free four train attack passengers The Nation Newspaper",
    "summarized_story": "It was gathered the hostages were released by the terrorists at a location inside the forest along the Kaduna–Abuja highway where their relatives picked them up.\nThe terrorists recently demanded a ransom of N100 million each for the remaining 43 hostages.\nIt was however not clear whether the victims paid ransom before they were released or not.\nWith the release of the four victims, the number of train passengers still in captivity stands at 39.\nThe terrorists on March 28 blew up the rail track on the Abuja-Kaduna train corridor, killing nine passengers and abducting about 63 others."
  },
  {
    "headline": "Terrorists battle army in Abuja",
    "summarized_story": "Bwari Area Council is where the Nigerian Law School and the Joint Admission Matriculation Board (JAMB) are located.\nIt was learnt that soldiers injured in the battle were evacuated to the 7 Guards Medical Centre where they are receiving treatment.\nIn recent week, most residents of the Abuja and suburbs have expressed fears over the safety of lives and property, especially students in boarding schools, as the terrorists appear to be emboldened following the successful attack on Kuje prison.\nA cryptic message on the attack titled ‘Ambush Attack Against Own Troops Of Gds Bde’ obtained by Daily Sun indicated that the terrorists target was the Nigerian Law School.\nHe said the only solution to the current security situation in the country is to hold the APC led administration accountable."
  },
  {
    "headline": "ASUU: National blackout as NLC begins mass protest today",
    "summarized_story": "NLC President, Ayuba Wabba told Daily Sun the two-day action would begin today in all the 36 states while the national would hold tomorrow in Abuja.\nShe directed all sectors including the health, electricity and aviation to shutdown operations and join the solidarity protest in support of the striking workers.\nPresident of the National Union of Local Government Employees (NULGE), Abia chapter, Ikechi Nwaigwe, said his members were fully prepared for the protest.\nImo State secretary of NLC, Ken Onwuemeodo, said the decision of the national body is binding on all the state chapters to abide.\nInstead of solving the problem, the minister is there talking about Legality do NLC proposed protest."
  },
  {
    "headline": "BudgIT asks FG to discontinue ‘indiscriminate’ borrowing",
    "summarized_story": "BudgIT, a civic-tech organisation, has expressed concerns over the poor fiscal performance of the Federal Government’s 2022 budget and its soaring subsidy payments.\nBudgIT said this in a statement on Monday signed by Iyanu Fatoba, assistant head, media and communications.\n“This is in spite of warnings given by the International Monetary Fund (IMF) that Nigeria would be spending over 100 percent of its revenue on debt service in 2026.\nIn particular, the debt service spending is only N93.6 billion less than the combined total personnel and capital expenditure for the period under review.\nThe civic-tech group advised the federal government to discontinue indiscriminate borrowing through ways and means."
  },
  {
    "headline": "Success of Nigeria’s 2023 election can halt coup d’etat in Africa –Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has reiterated his commitment to free, fair and credible elections in 2023, saying it remains the only way to deepen the country’s democracy.\nHe said the success of the 2023 polls would set the right example for the rest of Africa, and hopefully, stop coup d’etats in the continent.\nAfrica has come under severe criticism following military take overs of democratically elected governments in Chad, Mali, Guinea Bissa, Burkina Faso and Sudan.\nBuhari, who spoke, yesterday, at the 16th Edition of the Nigerian National Diaspora Day celebration 2022 said Nigeria was making progress in its democracy and that he would ensure smooth transition of power to the next government in 2023.\n“As you are all aware that the processes to our national elections in 2023 have continued to progress smoothly and consistent with the laws of our land and our Constitution."
  },
  {
    "headline": "Terrorists free 4 Abuja-Kaduna train attack victims",
    "summarized_story": "By Chinelo ObogoTerrorists have released four of the passengers kidnapped from the Abuja-Kaduna train in March, Daily Sun has learned.\nThe victims were released by 11am yesterday, at a location inside the forest along the Kaduna – Abuja highway, and were picked up by their relatives.\nOn March 28, 2022, terrorists attacked a train going to Kaduna from Abuja, killed eight people, injured many, and kidnapped over 60 passengers on board the train.\nEleven of the 61 remaining abducted people were released following a negotiation with the terrorists in June.\nThereafter, the Nigeria Railway Corporation (NRC) temporarily suspended activities while President Muhammadu Buhari directed the security agencies to rescue the victims."
  },
  {
    "headline": "Setting Agenda for Next President – THISDAYLIVE",
    "summarized_story": "Yet despite the turbulent environment, the nation cannot afford to lose sight of the crisis that awaits the next administration.\nPoliticsNigeria’s political situation is, to say the least, difficult and exasperating.\nWhether Nigeria can return to a path of growth depends on its politicians, particularly the next president -and, in the end, the voters.\nInsurgencyTwo critical obstacles stand in the way of the country addressing and combatting the threat of insurgency – Ethnicity and Religion.\nEspecially when the President and other political leaders rather go abroad than patronize the medical facilities they provided for the people."
  },
  {
    "headline": "Verve Partners LASRRA to Create Smart LAG ID – THISDAYLIVE",
    "summarized_story": "Uzoma MbaAfrica’s leading payment cards and digital tokens brand, Verve, has announced its partnership with the Lagos State government on the relaunch of the Lagos State Residents Registration Agency (LASRRA) identity card as a smart multi-purpose card that combines biometric identification with cutting edge technology.\nHolders of the new LASSRRA smart card, also called LAG ID, will be able to access an array of benefits that come with being a Verve cardholder.\nVerve offers extensive and exciting rewards, as well as loyalty programs which are open to all LAG ID cardholders.\nOgbunude said, “It is exciting to be in partnership with the Lagos State Residents Registration Agency (LASRRA).\nMrs. Ibilola Kasumu, who said the card would aid economic growth and provide a reliable database of all residents of the state."
  },
  {
    "headline": "Resisting Moves to Weaponise Pension Issues in Delta – THISDAYLIVE",
    "summarized_story": "Given Governor Ifenayi Okowa’s proclivity towards human capital development, the question of the pension burden is one that understandably question its commitment to a virile working class.\nThe controversy over the outstanding pension liabilities has especially gained ground since the commencement of the political season, even more fiercely since Governor Okowa emerged as the vice-presidential candidate of the Peoples Democratic Party, PDP.\nHe said since the state migrated from old pension scheme to the contributory pension scheme, government had been saddled with the huge burden of settling pension arrears for serving and retired workers.\n“The burden of the payment of primary school teachers salaries and pension is that of local government authority and not the state government.\nPerhaps reflective of the efforts of the state administration in clearing the pension arrears, stakeholders point to the recent claim by the National Pension Commission, PENCOM that Delta State was only one of about five states actively contributing to the welfare scheme."
  },
  {
    "headline": "NGIGE AND THE ASUU STRIKE – THISDAYLIVE",
    "summarized_story": "The section also says that once the matter is apprehended, the union shall call off strike while negotiations go on.\nThe idea of hijacking the ASUU negotiation is therefore not factual, in fact baseless.\nHad the Education Minister also handled the dispute with ASUU successfully, the union would neither have gone on strike nor the matter migrate to the Ministry of Labour.\nJust as Adamu declassified FEC deliberations to make Ngige a fall guy, Osodeke squealed that Ngige asked ASUU in one of their meetings to piquet Education Ministry.\nNgige has been sighted at the Accountant General’s Office following up payment to ASUU because officers would sleep over it."
  },
  {
    "headline": "Gender and Access to Healthcare – THISDAYLIVE",
    "summarized_story": "Despite being closely related, gender and sex are not the same as gender identity.\nA person’s idea of their own gender is known as gender identity.\nA person’s gender identification may agree or disagree with their assigned sex.\nThe majority of the time, a person’s gender expression matches their gender identification, however this is not always the case.\nPeople’s access to and experiences with healthcare are influenced by their gender."
  },
  {
    "headline": "EXCLUSIVE: Allegations Of Cash For Promotion, Nepotism, Other Corrupt Practices Rock Nigerian Anti-Narcotics Agency, NDLEA",
    "summarized_story": "Some men and officers of the National Drug Law Enforcement Agency (NDLEA) have been lamenting how the anti-narcotics agency, through its harmonisation and promotion exercise, has allegedly denied them promotion for about 20 years.\nThis further deepened the bad blood in the agency as officers continued to feel disillusioned,” one of the sources said.\nAlso on the committee were the Chairman of the Harmonisation Committee, Col. Yakubu Bako (rtd) and Head of Statistics and Records, Saidu Daniel, as observers.\nOn the report of the harmonisation review committee which is said to have not been submitted after one year, he said, \"The information is wrong.\n\"In fact, rather than act on the complaints of the aggrieved officers, the agency has started victimising some of them."
  },
  {
    "headline": "EXCLUSIVE: Allegations Of Cash For Promotion, Nepotism, Other Corrupt Practices Rock Nigerian Anti-Narcotics Agency, NDLEA",
    "summarized_story": "Some men and officers of the National Drug Law Enforcement Agency (NDLEA) have been lamenting how the anti-narcotics agency, through its harmonisation and promotion exercise, has allegedly denied them promotion for about 20 years.\nThis further deepened the bad blood in the agency as officers continued to feel disillusioned,” one of the sources said.\nAlso on the committee were the Chairman of the Harmonisation Committee, Col. Yakubu Bako (rtd) and Head of Statistics and Records, Saidu Daniel, as observers.\nOn the report of the harmonisation review committee which is said to have not been submitted after one year, he said, \"The information is wrong.\n\"In fact, rather than act on the complaints of the aggrieved officers, the agency has started victimising some of them."
  },
  {
    "headline": "‘Bishops’ Who Attended Unveiling Of Shettima As APC Vice-Presidential Candidate May Be Fake – Amaechi",
    "summarized_story": "Former Minister of Transportation, Rotimi Amaechi on Sunday said the ‘bishops’ who attended the recent unveiling of Kashim Shettima as the vice-presidential candidate of the All Progressives Congress (APC) may not be real bishops.\n“Those bishops you saw (at Kashim Shettima’s unveiling in Abuja], they may not be bishops, but they are Christians,” Amaechi said.\nRotimi Amaechi also said delegates, who sold their votes at the APC presidential primary election won by Bola Tinubu, were already regretting doing so.\nThose who voted at the APC primary, who are they?\nPray for the leadership of the country, but also pray that ordinary Nigerians choose the right person to govern,\" he said."
  },
  {
    "headline": "‘Bishops’ Who Attended Unveiling Of Shettima As APC Vice-Presidential Candidate May Be Fake – Amaechi",
    "summarized_story": "Former Minister of Transportation, Rotimi Amaechi on Sunday said the ‘bishops’ who attended the recent unveiling of Kashim Shettima as the vice-presidential candidate of the All Progressives Congress (APC) may not be real bishops.\n“Those bishops you saw (at Kashim Shettima’s unveiling in Abuja], they may not be bishops, but they are Christians,” Amaechi said.\nRotimi Amaechi also said delegates, who sold their votes at the APC presidential primary election won by Bola Tinubu, were already regretting doing so.\nThose who voted at the APC primary, who are they?\nPray for the leadership of the country, but also pray that ordinary Nigerians choose the right person to govern,\" he said."
  },
  {
    "headline": "‘Bishops’ Who Attended Unveiling Of Shettima As APC Vice-Presidential Candidate May Be Fake – Amaechi",
    "summarized_story": "Former Minister of Transportation, Rotimi Amaechi on Sunday said the ‘bishops’ who attended the recent unveiling of Kashim Shettima as the vice-presidential candidate of the All Progressives Congress (APC) may not be real bishops.\n“Those bishops you saw (at Kashim Shettima’s unveiling in Abuja], they may not be bishops, but they are Christians,” Amaechi said.\nRotimi Amaechi also said delegates, who sold their votes at the APC presidential primary election won by Bola Tinubu, were already regretting doing so.\nThose who voted at the APC primary, who are they?\nPray for the leadership of the country, but also pray that ordinary Nigerians choose the right person to govern,\" he said."
  },
  {
    "headline": "APC candidate missing as INEC publishes list of governorship contenders in Akwa Ibom",
    "summarized_story": "There is no governorship candidate for the All Progressives Congress (APC) in Akwa Ibom state in the list published by the Independent National Electoral Commission (INEC).\nAccording to PremiumTimes, the space meant for APC’s governorship candidate was blank in the list pasted at the INEC headquarters in Uyo, Akwa Ibom, over the weekend.\nWhile this implies that APC may not participate in the 2023 governorship election in Akwa Ibom, the recent development was not completely unexpected.\nAdvertisement“By the time we woke up in the morning, they said at some location, they have done governorship primary.\nMeanwhile, efforts to reach INEC on the exclusion of the APC candidate were unsuccessful at the time of this report."
  },
  {
    "headline": "APC candidate missing as INEC publishes list of governorship contenders in Akwa Ibom",
    "summarized_story": "There is no governorship candidate for the All Progressives Congress (APC) in Akwa Ibom state in the list published by the Independent National Electoral Commission (INEC).\nAccording to PremiumTimes, the space meant for APC’s governorship candidate was blank in the list pasted at the INEC headquarters in Uyo, Akwa Ibom, over the weekend.\nWhile this implies that APC may not participate in the 2023 governorship election in Akwa Ibom, the recent development was not completely unexpected.\nAdvertisement“By the time we woke up in the morning, they said at some location, they have done governorship primary.\nMeanwhile, efforts to reach INEC on the exclusion of the APC candidate were unsuccessful at the time of this report."
  },
  {
    "headline": "Obi replies Atiku: I look forward to completing my political journey of miracles in 2023",
    "summarized_story": "Peter Obi, presidential candidate of the Labour Party (LP), says he looks forward to witnessing the miracle of his winning the 2023 election.\nOn July 22, Atiku Abubakar, presidential candidate of the Peoples Democratic Party (PDP), said expecting Obi to win the election would be a “miracle”.\n“It is very difficult to expect a miracle to happen, simply because Peter Obi is in the Labour Party.\nFor me, since I started this political journey, my achievements and records have all been miracles,” he said.\n“I am looking forward to the next miracle next year, to complete the miraculous journey of my political journey.”"
  },
  {
    "headline": "Obi replies Atiku: I look forward to completing my political journey of miracles in 2023",
    "summarized_story": "Peter Obi, presidential candidate of the Labour Party (LP), says he looks forward to witnessing the miracle of his winning the 2023 election.\nOn July 22, Atiku Abubakar, presidential candidate of the Peoples Democratic Party (PDP), said expecting Obi to win the election would be a “miracle”.\n“It is very difficult to expect a miracle to happen, simply because Peter Obi is in the Labour Party.\nFor me, since I started this political journey, my achievements and records have all been miracles,” he said.\n“I am looking forward to the next miracle next year, to complete the miraculous journey of my political journey.”"
  },
  {
    "headline": "I am behind Atiku, says Ortom amid row over PDP VP candidate",
    "summarized_story": "Samuel Ortom, governor of Benue state, says he is “behind” Atiku Abubakar, the presidential candidate of the Peoples Democratic Party (PDP).\nOrtom said he will not contradict the statement made by Atiku on the process that led to the selection of his running mate.\n“Whatever happened in the course of the primaries and nomination of the Presidential running mate is now a thing of the past.\nWhatever happened in the course of the primaries and nomination of the Presidential running mate is now a thing of the past.\n“Our presidential candidate has reached out to me to further persuade governor Wike that he’s coming to see him, they’ll sit down and discuss."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "Yamaha and Max announce partnership to scale Max’s services",
    "summarized_story": "Yamaha and MAX announcing the deal Source: MAXFollowing their recent milestone of 100 million kilometres, Max has announced a partnership with Yamaha’s Nigerian subsidiary, Moto Business Service Nigeria (MBSN), to finance and maintain over 50,000 vehicles over the next 2 years.\nThe partnership will expand Max’s operations in Nigeria, Ghana, and Cameroon and fast-track its goal of serving 100,000 independent commercial drivers by the end of 2023.\nBecause of the financing options offered by MBSN, independent commercial drivers using the MAX platform will be able to acquire a variety of vehicles for use in their businesses.\nSpeaking at the announcement event, Adetayo Bamiduro, co-founder and CEO of MAX, said, “We are extremely thrilled to partner with MBSN and the Yamaha Motor Corporation.\nWe will onboard vehicles across multiple cities and generate employment avenues for the youth of the African subcontinent."
  },
  {
    "headline": "Nigerian tech ecosystem groans under rising inflation and fuel price",
    "summarized_story": "Nigerian consumers, who are among the poorest in the world, are miserable because they are increasingly required to pay more money to feed, move around, or be comfortable in their houses due to rising food prices, fuel prices, and bad power supply.\nCaught in the middle of all of this is an Abeokuta-based online food delivery startup, EatUp.\nIt also costs EatUp more to buy bikes for its riders, pay for data, packaging, and branding and get fuel for its riders—all essential elements of its food delivery operations.\nIn a bid to survive the ravaging inflation and increasing fuel prices that month, the food delivery startup had to mark up its delivery fee by 20%, from ₦500 to ₦600.\nThe startup also established partnerships with fuel suppliers to purchase fuel at a discounted rate and distribute it to its fleet of 15 bikes."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "How I Work: Oluwapelumi Oyetimein, Marketing & Growth Lead at Umba",
    "summarized_story": "Today, Oyetimein has made a name for himself in the industry, leading marketing and growth for several top companies.\nToday on How I Work, he talks about his transition from software development to marketing and how he consistently stays on top of his game.\nI think because over the past 10 years I’ve done more of marketing, it slightly eroded into the background.\nSo, I decided that I needed to figure out how proper businesses work and eventually be able to build a business on my own.\nBukayo Ewuoso, Senior Account Manager for West & Central Africa at Eskimi; Ntongha Ekot, Growth and Marketing professional; and Olumide Akinsola, Group VP of Growth and Marketing at QuickBus."
  },
  {
    "headline": "New NNPC draws mixed bag of reactions",
    "summarized_story": "The transition of the Nigerian National Petroleum Corporation, the country’s oil behemoth, into a commercial venture has elicited mixed reactions from stakeholders.\nThe reform efforts that led to the emergence of the Nigerian National Petroleum Company Limited (NNPC) are expected to strengthen the capacity and market relevance of the country’s oil industry.\n“Currently, there is no clarity on the commercial and strategic framework of how NNPC Limited will handle subsidy, loss-making subsidiaries or king’s ransom to creaking refineries,” Aja said.\nMele Kyari, group chief executive officer of NNPC, said in an interview with Arise TV that the company’s upstream assets may be worth $90 billion.\n“Despite all the fanfare about NNPC Limited, all the loss-making subsidiaries of NNPC Limited and its leadership remains intact,” Nwadishi said."
  },
  {
    "headline": "New NNPC draws mixed bag of reactions",
    "summarized_story": "The transition of the Nigerian National Petroleum Corporation, the country’s oil behemoth, into a commercial venture has elicited mixed reactions from stakeholders.\nThe reform efforts that led to the emergence of the Nigerian National Petroleum Company Limited (NNPC) are expected to strengthen the capacity and market relevance of the country’s oil industry.\n“Currently, there is no clarity on the commercial and strategic framework of how NNPC Limited will handle subsidy, loss-making subsidiaries or king’s ransom to creaking refineries,” Aja said.\nMele Kyari, group chief executive officer of NNPC, said in an interview with Arise TV that the company’s upstream assets may be worth $90 billion.\n“Despite all the fanfare about NNPC Limited, all the loss-making subsidiaries of NNPC Limited and its leadership remains intact,” Nwadishi said."
  },
  {
    "headline": "Illicit Drugs: NDLEA nab drug Baron, 9 Others – Nigerian Observer",
    "summarized_story": "It was reliably gathered that the new suspects were arrested in connection with tons of assorted illicit substances seized in Abuja, the Federal Capital Territory (FCT), Kaduna, Sokoto and Anambra States.\nA follow up operation same day led to the arrest of the actual owner of the consignment, Abubakar Isiyaku, in Katsina State.\nAbuja, no fewer than four persons were arrested over 345.4kg cannabis seizures in the FCT.\nGen. Mohamed Buba Marwa (rtd) commended the officers and men of the Commands for the arrests, seizures and their tenacity.\nHe urged them and their colleagues across the country to remain steadfast in pursuit of the Agency’s goal of ridding all parts of Nigeria of illicit substances."
  },
  {
    "headline": "Killing: Ukhiri Elders, Women Group Send Save Our Soul Message To IGP – Nigerian Observer",
    "summarized_story": "The elders comprising some aged women and some youths made the appeal on Monday when they staged a peaceful protest to the State Police Command and the Edo State Government House, Benin.\nSome of the placards bore various instructions including, Inspector General of Police, come to our rescue; Aigbe, the Enogie of Ukhiri is killing us; Enogie is promoting crises in Ukhiri; Enogie says no one can touch him because he is highly connected in the police circle; help us, we are dying, among others.\nThey appealed to the police authorities not to release the Enogie but that he should be charged to court to face prosecution for his misdeeds.\nResponding, the Police Image maker CSP Chidi Nwabuzor informed the protesters of the ability of the Office of the Inspector General of Police to handle the case, stressing that all the case files concerning the Ukhiri crises have been sent to Abuja for further investigation and possible prosecution.\nShare this: TweetWhatsAppEmailPrint..."
  },
  {
    "headline": "Edo confirms eight cases of monkeypox as govt intensifies efforts to contain outbreak",
    "summarized_story": "Benin City – The Edo State Ministry of Health has revealed that eight persons have so far tested positive for monkeypox in the state, urging residents to observe safety measures to reduce the spread of the virus and other infectious diseases in the state.\nThe Edo State Commissioner for Health, Prof. Akoria Obehi, who disclosed this to journalists in Benin City, said that the Ministry has ramped up surveillance and other activities to curb the spread of infectious disease.\nShe, however, noted that all persons who were diagnosed with the disease have recovered.\n“Thoroughly cook all foods containing animal meat before eating; avoid unprotected contact with infected animals, humans, their beddings, and other linen; wash hands regularly, and use sanitizer when water is not available.”Restating the government’s commitment to containing the outbreak and protecting the health of residents, the Edo Health Commissioner said that the State Disease Surveillance Team has been deployed to control the outbreak in the state, alongside the engagement of stakeholders across the state’s 18 Local Government Areas.\n“If you suspect any symptoms of monkeypox, kindly visit the nearest health facility for medical attention or call the Acting State Disease Surveillance and Notification Officer (0806 059 3802),” Prof Akoria advised."
  },
  {
    "headline": "Family announces burial arrangement for late music maestro, Osayomore – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe family of late music maestro, Ambassador Osayomore Joseph, has announced the burial arrangement for the patriarch, who passed at the age of 76.\nIn a statement signed by Dr. Amadin Osayomore Joseph for the family and the burial committee, the family said activities for the late music legend will begin on Wednesday, 27 July 2022 and end on Sunday, Sunday 31st July, 2022.\n“The match will be followed by PMAN NITE Music Fiesta at No 15, Osayomore Joseph Crescent, Oko Central, Benin City, from 6 pm till dawn.\n“This will be immediately followed by Family Rites and Vigil on Friday 29th July, 2022.”The family disclosed that the Social dance/Entertainment of Guests will take place at Air Force Base Playground at 12noon, on Saturday 30th July 2022.\nThe activities lined up for the burial of late Osayomore will end with a thanksgiving service at Church of God Mission Int’l (Miracle Centre), Airport Road, Benin City at 10 am, on Sunday 31st July 2022."
  },
  {
    "headline": "Sterling Bank partners Lagos State Government, LASRRA to relaunch LAG ID",
    "summarized_story": "Sterling Bank Plc has collaborated with the Lagos State Residents Registration Agency (LASRRA) as the pioneer partner for the first three million issuances of the newly upgraded Lagos State Resident Identity Card (LAG ID Card), which was recently launched and unveiled by the Lagos State Governor, Mr. Babajide Sanwo-Olu.\nThe GM, who said the old identity card was for identification purposes only, explained that holders of the old card would need to update their records to obtain the new LAG ID Card, which has a validity period of five years.\nKasunmu listed other advantages of the newly upgraded Lagos ID Card to include easy access to educational services for children and students at all levels of education, as well as quicker access to healthcare services from the state-owned facilities.\nThe General Manager emphasized that the LAG ID Card project is pivotal to the Lagos Smart City initiative for key purposes of planning and distribution of infrastructure, security, social protection, financial inclusion, and disaster and emergency response management, to mention a few.\nSome of the dignitaries that graced the event included members of the Lagos State House of Assembly, members of the State Executive Council, traditional rulers across the state, religious and community leaders, heads of market men and women, associations of artisans, corporate organisations and students, among others."
  },
  {
    "headline": "Pass digital rights, freedom bill to guarantee rights of Nigerians – PIN charges lawmakers",
    "summarized_story": "Paradigm Initiative (PIN), a social enterprise that builds ICT-enabled support systems and advocates for digital rights, has called on lawmakers in Nigeria to pass the digital rights and freedom bill to guarantee the rights of Nigerian citizens in the digital age, and to promote trust.\nThe group which made the call in a statement on Monday, in response to the recently released NITDA Code of Practice, noted that freedom of expression is a universal human right, which must be protected.\nThe statement reads, “Freedom of expression is a universal human right, a right fundamental to a democratic society which is why it is enshrined in section 39 of the Constitution and Article 19 of the Universal Declaration of Human Rights (UDHR).\n“Freedom of expression is important for an inclusive participation in society.\n“Our call to action goes to all stakeholders involved;To the legislature: Pass the digital rights and freedom bill to guarantee the rights of Nigerian citizens in the digital age and to promote trust."
  },
  {
    "headline": "Osinbajo discharged from hospital",
    "summarized_story": "Vice President Yemi Osinbajo (centre); CEO, Dutchess Hospital, Ikeja, Lagos, Dr. Tokunbo Shitta-Bey (3rd left); wife of the vice president, Dolapo (4th left); the Chief Personal Physician to the vice president, Dr. Nicholas Audifferen (4th right) and others after Osinbajo’s discharge from the Duchess International Hospital, Ikeja GRA, LagosVice President Yemi Osinbajo has been discharged from the Duchess International Hospital in Lagos.\nThe Chief Personal Physician to the Vice President, Dr. Nicholas Audifferen, also issued a statement on the development.\n“The Vice President, Professor Yemi Osinbajo (SAN) was admitted to the Duchess International Hospital, Lagos, last Saturday, July 16, 2022, on account of a right femur fracture.\nAkande said Prof. Osinbajo is grateful to all the clinical and ancillary staff of the Hospital led by its Chief Executive Officer, Dr Tokunbo Shitta-Bey and the Medical Director, Dr. Adedoyin Dosunmu-Ogunbi for their professionalism and quality of care.\nThe vice president also acknowledged and appreciated the good wishes of President Muhammadu Buhari, Nigerians from all walks of life and indeed everyone at home and abroad for the goodwill."
  },
  {
    "headline": "Insecurity: Live up to your reputation as a 2-star general – Yoruba Global Alliance tells Buhari",
    "summarized_story": "The Yoruba Global Alliance, a leading Yoruba self-determination organisation, has decried the security situation in Nigeria, challenging President Muhammadu Buhari to live up to his reputation as a general.\n“The Yoruba Global Alliance, a leading Self-Determination Organization along with our allies, the Yoruba Global Congress and the Yoruba Unseen as well as millions of Yoruba people at home and abroad call on Major General Muhammadu Buhari to live up to his reputation as a 2-star General to take immediate action to redeem his image.\nThe entire areas where terrorists are holding sway are located in plains or Savanah grassland where there are no thick bushes or forests.\n“We wish to remind General Buhari that all those flatterers, court jesters, sycophants and political jobbers milling round him and deceiving him will not be there with him on the Day of Judgment.\n“Our President’s name is Buhari, nobody should rename him Nero at age 80.”"
  },
  {
    "headline": "MTEF 2023-2025 consultation confirms Nigeria’s bankruptcy",
    "summarized_story": "Oil production averaged 1.32 million barrels per day (mbpd) in April as against the 1.60mbpd projected in the budget.\nThe lame excuse for low oil production is the high incidence of crude oil theft and pipeline vandalism.\n280,000bpd, being the difference between the projected 1.6mbpd and the actual production of 1.32mbpd, is a daily loss of $29m.\nHowever, considering actual revenue at N1.630trn, an extra unearned amount of N3.09trn, being the deficit for the period, was spent.\nBorrowing for financing debt service was never in the contemplation of the Fiscal Responsibility Act, the enabling debt management framework law."
  },
  {
    "headline": "JUST-IN: Osinbajo Discharged After Successful Surgery",
    "summarized_story": "Vice President Yemi Osinbajo has been discharged from a Lagos hospital following a successful surgical operation and rehabilitation.\nThe Chief Personal Physician to the Vice President, Dr Nicholas Audifferen, in a statement, said: “The Vice President, Professor Yemi Osinbajo, SAN was admitted to the Duchess International Hospital, Lagos, last Saturday, July 16, 2022, on account of a right femur fracture.\n“He was admitted for a total of 7 days during which he had physiotherapy and a smooth rehabilitation following the surgical operation.\nHe has been discharged and is now recuperating.\n“The Vice President also acknowledged and appreciates the good wishes of President Muhammadu Buhari, Nigerians from all walks of life and indeed everyone at home and abroad for the goodwill."
  },
  {
    "headline": "JUST-IN: Osinbajo Discharged After Successful Surgery",
    "summarized_story": "Vice President Yemi Osinbajo has been discharged from a Lagos hospital following a successful surgical operation and rehabilitation.\nThe Chief Personal Physician to the Vice President, Dr Nicholas Audifferen, in a statement, said: “The Vice President, Professor Yemi Osinbajo, SAN was admitted to the Duchess International Hospital, Lagos, last Saturday, July 16, 2022, on account of a right femur fracture.\n“He was admitted for a total of 7 days during which he had physiotherapy and a smooth rehabilitation following the surgical operation.\nHe has been discharged and is now recuperating.\n“The Vice President also acknowledged and appreciates the good wishes of President Muhammadu Buhari, Nigerians from all walks of life and indeed everyone at home and abroad for the goodwill."
  },
  {
    "headline": "BBNaija 7: Eloswag Is First Head Of House",
    "summarized_story": "Big Brother Naija Season 7 housemate, EloSwag, has emerged the first Head of House (HoH) for the season.\nThe dreadlocked housemate became the first Head of House after winning the HoH house game held on Monday night.\nBoth Level 1 and Level 2 housemates came together to play the HoH games in the arena and Eloswag became the best performing housemate.\nFollowing his performance, Big Brother announced him as the first Head of House for the season."
  },
  {
    "headline": "BBNaija 7: Eloswag Is First Head Of House",
    "summarized_story": "Big Brother Naija Season 7 housemate, EloSwag, has emerged the first Head of House (HoH) for the season.\nThe dreadlocked housemate became the first Head of House after winning the HoH house game held on Monday night.\nBoth Level 1 and Level 2 housemates came together to play the HoH games in the arena and Eloswag became the best performing housemate.\nFollowing his performance, Big Brother announced him as the first Head of House for the season."
  },
  {
    "headline": "NEDC Trains Youths On Waste Management In Taraba",
    "summarized_story": "The North-East Development Commission (NEDC) has organised a three-day training workshop for youths on efficient waste management and practices of A to Z recycling in Jalingo, Taraba State capital on Monday.\n“These actions not only help in protecting environment, but also help in employment generation and boosting up the economy.\n“Given to the fact that waste was not considered a big issue few decades ago, many people had not considered waste management with utmost attention.\nPresently, waste management is the big issue to sustainable environment.\nYouths at the workshop who spoke to our correspondent expressed their gratitude to the state government over the opportunity not just to be employed but also to create a clean environment in the state."
  },
  {
    "headline": "I am looking forward for a miracle to win 2023 presidency",
    "summarized_story": "Presidential candidate of the Labour Party, Peter Obi on Monday said he is looking forward for a miracle to win next year’s presidency.\nHe was reacting to a statement by the Peoples Democratic Party’s (PDP) presidential candidate, Atiku Abubakar that it would take a miracle for him to win the presidency.\nHe said people said there was no way for him as it had never happened before but that after three years, the court declared him the winner.\nSo I was the first governor to win through the court, and first to come back from impeachment.\n“I am looking forward to the next miracle next year to complete the miraculous journey of my political life.”"
  },
  {
    "headline": "Trump's son-in-law Kushner reveals cancer diagnosis in memoir",
    "summarized_story": "Jared Kushner, son-in-law to former President Donald Trump revealed in a memoir to be published next month that he had a bout with thyroid cancer in 2019.\nUnbeknownst to Kushner, Trump was aware of the cancer diagnosis: “The day before the surgery, Trump called me into the Oval Office and motioned for his team to close the door.\n‘Are you nervous about the surgery?’ he asked.”“How do you know about it?” Kushner asked him.\nKushner revealed the cancer diagnosis in his memoir, “Breaking History: A White House Memoir,” to be published on Aug. 23.\nKushner was a lead negotiator in a U.S.-brokered normalization deal between Israel and several Arab countries in 2020."
  },
  {
    "headline": "2023: I have no plan to support Atiku for president, want to win – Peter Obi",
    "summarized_story": "2023: I have no plan to support Atiku for president, want to win – Peter ObiThe Labour Party presidential candidate, Peter Obi, said on Monday he has no plan to support his Peoples Democratic Party (PDP) counterpart, Atiku Abubakar, in the 2023 election.\nObi, who stated this when he featured in a Channels Television programme, Politics Today, said he planned to win next year’s election.\nThe ex-Anambra governor also confirmed that he did not inform the PDP candidate before leaving the party in May.\nObi said: “It is true that I did not tell Atiku Abubakar before resigning from the PDP.\n“I am not considering supporting Atiku for President."
  },
  {
    "headline": "Surgery: Osinbajo discharged from Lagos hospital",
    "summarized_story": "Vice President Yemi Osinbajo has been discharged from the hospital following a successful surgical operation and rehabilitation, Dr Nicholas Audifferen, the Chief Personal Physician to the VP, says.\n“The vice president was admitted to the Duchess International Hospital, Lagos, on July 16, on account of a right femur fracture.\n“He was admitted for a total of seven days during which he had physiotherapy and a smooth rehabilitation following the surgical operation.\n“The vice president also acknowledges and appreciates the good wishes of President Muhammadu Buhari, Nigerians from all walks of life and indeed everyone at home and abroad for the goodwill.\nOsinbajo will continue recuperating in the next few days,” Akande said in the statement."
  },
  {
    "headline": "BREAKING: Train Attack: Gunmen free more hostages",
    "summarized_story": "One of the released captivesThe gunmen, who attacked a Kaduna-bound train in March, and abducted several passengers, have released four more hostages.\nThe release of the hostages comes a day after the terrorists released a video of them hitting some of the male hostages with a cudgel.\nIn the video, the distressed hostages were heard calling on the Nigerian government to come to their rescue.\nHe identified the released passengers as Oluwa Toyin-Ojo; Hassan Lawan; and Ayodeji Oyewumi.\nMr Mamu said he does not know if the relatives of the hostages paid a ransom before they were released."
  },
  {
    "headline": "Church leaders at Shettima’s unveiling show proof of ordinations, ministries",
    "summarized_story": "The Bishops and Clerics whose attendance at the formal unveiling of former Borno Governor, Senator Kashim Shetiima, as the running mate to APC’s presidential candidate, Asiwaju Bola Ahmed Tinubu, sparked media controversy and insinuations of sponsored impersonation have offered proof of their status as ordained clerics and founders of Christian ministries.\nThe Christian leaders also clarifying the widespread misunderstanding that they attended the event as representatives of the Christian Association of Nigeria (CAN).\nThey dismissed claims of being sponsored to impersonate leaders of the Christian Association of Nigeria at the event.\nWhile justifying their authenticity as church leaders, the group made public their respective churches and ministries, some of which have existed for several years.\nCondemning the attacks and harassment they endured over their participation at the event, the group said it was their democratic rights to make a political choice."
  },
  {
    "headline": "2023: Atiku is my candidate – Ortom",
    "summarized_story": "The Governor of Benue State, Samuel Ortom, has said that he is not against the position of the presidential candidate of the Peoples Democratic Party, Atiku Abubakar, on the issues that transpired at the party’s presidential primary and the selection of a running mate.\nHe said Atiku is his presidential candidate.\nAccording to him, “I will not contradict @atiku on what he said.\nHe is my candidate and I am behind him.\nWhatever happened in the course of the primary and nomination of the presidential running mate is now a thing of the past."
  },
  {
    "headline": "Plateau NLC mobilises for solidarity protest over ASUU strike",
    "summarized_story": "The Plateau State chapter of the Nigeria Labour Congress (NLC), has begun mobilisation of its members and other affiliate unions ahead of the planned nationwide solidarity protest by the organised labour in support of the lingering strike by the Academic Staff Union of Universities (ASUU).\nThe nationwide protest is expected to come up on the July 26 and 27, 2022.\nA notice circulated to Plateau workers on Sunday by the leadership of the state NLC said there was no going back on the protest.\nThe notice signed by the state Secretary of the NLC, Mr Dalyop Badung, was obtained by The PUNCH in Jos on Sunday.\n“All affiliates are to assemble under the bridge of the Secretariat flyover by 8am prompt for the protest."
  },
  {
    "headline": "Breaking: Abuja-Kaduna train victims’ families storm Abuja, launch protest",
    "summarized_story": "The families of Abuja-Kaduna train kidnapped victims have stormed the Federal Ministry of Transportation on Monday to protest against the continued stay of their loved ones in the terrorists’ den.\nBlueprint reported that the terrorists released a video where the male victims were being mercilessly flogged.\nThe families in their huge number stormed the ministry at about 6 am to express their frustration over the continued stay of those in captivity.\nThey vowed not to leave until they were assured of the return of their loved ones.\nDetails loading…Share this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Bakers call off strike in Kogi, threaten bread price hike",
    "summarized_story": "By Friday Idachaba, LokojaMaster Bakers and Caterers in Kogi on Monday called off their five-day warning strike with a threat of imminent hike in the price of bread.\nChief Gabriel Bamidele Adeniyi, Chairman of Kogi chapter of Association of Master Bakers and Caterers of Nigeria disclosed this while speaking with newsmen in Lokoja.\n“By God’s grace, we have resumed production of bread again after ending our strike midnight of Sunday, July 24.\n“We want the public to know that the new increment in prices of staple bread is not our making but that of the increase in the prices of commodities we use in bread production.\n“Unfortunately those three firms are monopolizing the prices of Sugar, Yeast and Flour to the detriment of bakers in Nigeria”, he stated."
  },
  {
    "headline": "BudgeIT asks FG to discontinue ‘indiscriminate’ borrowing",
    "summarized_story": "BudgIT, Nigeria’s foremost civic-tech organization, has expressed concern over what it described as the “indiscriminate borrowing” by the Federal Government.\nBudgIT in a statement on Monday signed by Iyanu Fatoba, assistant head, media and communications, said the fortunes of Nigeria have worsened in the last eight months.\nThe organisation urged the government to discontinue indiscriminate borrowing, saying that the most pressing concern is the debt service-to-revenue ratio, which has reached alarming levels within the first four months of 2022.\nBudgIT said factors such as the 2022 being a pre-election year; the growing fiscal threat posed by subsidy payments and the debt service-to-revenue ratio; will negatively impact Nigeria’s budget credibility, cripple service delivery in critical social sectors of the economy and impede needed investments in productive sectors, thereby stunting economic growth.\nBudgIT expressed worry, particularly at the poor fiscal performance of the federal government’s 2022 budget and the rising subsidy payments, especially the debt service-to-revenue ratio which has reached alarming levels at N1.94 trillion between January and April this year, representing over 100% of the nation’s N1.64 trillion revenue within the same period."
  },
  {
    "headline": "NERC, NOA sign MoU for orientation of electricity consumers on relationship improvement",
    "summarized_story": "By Onu OkorieNigerian Electricity Regulatory Commission (NERC) has formed partnership with the National Orientation Agency (NOA over the weekend as efforts are intensified accross Nigeria to effectively sensitise the public over improved relationship in the sector relationship .\nThe partnership was consumated at the headquarters of NERC, where the both agencies signed a Memorandum of Understanding (MoU).\nSanusi Garba, the Chairman of NERC, said the Nigerian Electricity Supply Industry (NESI) requires more sensitization and Nigerians need knowledge on how they get electricity, noting that the NOA platform is for educating Nigerians on electricity theft, safety and other issues.\nHe said, “There is a huge amount of ignorance among our populace on how things are done especially in technical areas like electricity supply.\nOn this NOA pact whose process began in January, she said: “They have been sending bulk SMS to invite customers to our programmes wherever NERC goes to sensitise consumers,” adding that consumers will be educated on their rights and responsibilities."
  },
  {
    "headline": "UN applauds Sterling One Foundation over Africa social impact summit",
    "summarized_story": "By Kehinde Ibrahim, LagosTHE United Nations Resident and Humanitarian Coordinator, Nigeria Mr. Matthias Schmale, has commended the Sterling One Foundation for creating a convening to accelerate growth towards the 2030 Sustainable Development Goals across Africa.\nThis was shared during the 2-day hybrid event held on July 13-14, 2022, at the prestigious Transcorp Hilton Hotel Abuja which had about 4,000 registered delegates from 55 countries.\nMost of these businesses already have conditional commitments from our investors at the event and we expect to seal these deals in the coming weeks working with the investees.\nWe will continue facilitating financing for purpose and profit driven business solutions that will help promote access to health and education for all while guaranteeing returns for impact investors locally and globally’’, she added.\nShe noted that the Foundation was already working with various partners and will continue in this light as the event was organized in partnership with the United Nations Global Compact Network Nigeria, Sterling Bank, the Coca Cola Company, VFD Group, the Impact Investors Foundation, Giving.ng, the Nigeria Climate Innovation Center (NCIC), the Nigerian Economic Summit Group (NESG), Ventures Africa, Proshare and Tech Cabal."
  },
  {
    "headline": "NASENI MD Prof Haruna bags outstanding performance Award",
    "summarized_story": "By Eunice OrikeThe Executive Vice Chairman/Chief Executive of the National Agency for Science and Engineering Infrastructure(NASENI), Engr.Prof.\nMohammed Sani Haruna has received Business Day outstanding performance Award ahead over 100 Ministries Departments and Agencies (MDAs) of Government assessed by a special panel set up by the newspaper.\nAccording to Business Day Panel’s assessment in year 2021, NASENI under Prof. Haruna’s leadership recorded impeccable achievements in areas of inventions, innovations and products development through multi-sector interventions.\nThe verdict of the judges was that the Executive Vice Chairman of NASENI distinguished himself as an administrator per excellence through the various innovations introduced to NASENI.\nBecause of the leadership by Prof. Haruna, NASENI rose from an obscure agency in the Federal Ministry of Science and Technology to an agency that has contributed immensely to national development."
  },
  {
    "headline": "Insecurity: My Solution Will Be Decisive And Immediate, Says Peter Obi",
    "summarized_story": "The presidential candidate of the Labour Party, Peter Obi, on Monday said that when he becomes president in 2023, he will face the nation’s security crisis head-on.\nIn an interview on Channels Television’s Politics Today, the former Anambra State governor said his solution to the problem will be “decisive and immediate”.\nWhile stressing that the nation’s security situation has been very worrisome, Mr Obi said he feels the Federal Government should do more.\nSpeaking further, Mr Obi was of the opinion that there needs to be an economic transformation for the security situation in Nigeria to change.\n“To improve the security situation in Nigeria, as President, I will ensure the economy works and more people are pulled out of poverty."
  },
  {
    "headline": "Terrorists Release Three Kaduna Train Attack Victims",
    "summarized_story": "Terrorists have released three victims of 62 hostages of the abducted Abuja-Kaduna train passengers on March 28.\nChannels Television gathered that they were released by the terrorists at a location inside the forest along the Kaduna – Abuja highway.\nREAD ALSO: Kaduna Train Attack: Terrorists Threaten To Kill, Sell Hostages, Kidnap Buhari And El-RufaiSo far, 22 victims have regained their freedom.\nIt is however not clear if any money was paid to the terrorists to release their abducted victims.\nWorried about the situation, the Nigeria Railway Corporation temporarily suspended activities, with President Muhammadu Buhari directing security agencies to rescue the victims."
  },
  {
    "headline": "Relatives Of Kaduna Train Attack Victims Picket Transportation Ministry",
    "summarized_story": "﻿Relatives of the victims of the Abuja-Kaduna train attack have picketed the headquarters of the Ministry of Transportation in Abuja, following the release of a new video by the bandits.\nA spokesperson for the protesters, Ahmed Aruwa, said they would continue to block the entrance of the Ministry of Transportation until they get a definite response from the government.\nAlthough some of the train passengers have been released after ransoms were reportedly paid, dozens of victims are said to be left in the custody of the bandits.\nHe pleaded with members of the international community, including the United Nations, the United Kingdom, the United States, and France, among others to help secure their release.\n“The dilemmas in dealing with the specific case of train terrorists are manifold: punitive action like the popular call for carpet bombing of the known locations may assuage the desire of an angry public for revenge, but what about the hostages?"
  },
  {
    "headline": "All Hail The Queen: Tobi Amusan Wins Historic Gold For Nigeria",
    "summarized_story": "Tobi Amusan has become the first Nigerian athlete to win a World Athletics Championship gold as she blazed to victory in the women’s 100m hurdles in Eugene, Oregon.\nAmusan, who had smashed the world record in the semi-final where she clocked 12.12 seconds, powered over the line at Hayward Field in an incredible 12.06 seconds.\nHowever, her winning time will not be recognised as a world record due to an illegal tailwind of 2.5 metres per second.\n“Honestly, I believe in my abilities, but I was not expecting a world record at these championships,” Amusan said after her final victory.\nSo, the world record is a bonus."
  },
  {
    "headline": "PDP Sues INEC, Seeks Nullification Of APC Primaries In Rivers",
    "summarized_story": "The Peoples Democratic Party (PDP) in Rivers State has dragged the Independent National Electoral Commission before a Federal High Court in Port Harcourt, seeking the delisting of legislative candidates of the All Progressives Congress in the state for the 2023 general elections.\nThe past few days have seen the Rivers PDP appear before judges at the Federal High Court in Port Harcourt to seek the nullification of some primaries conducted by other political parties.\nAt this Federal High Court-4, lawyers and litigants are preparing for legal arguments on whether or not the National Assembly Primaries conducted by the APC in the State be nullified.\nINEC did not monitor the purported primaries and congresses that they held.\nTherefore, they are not valid or eligible candidates,” the PDP lawyer said."
  },
  {
    "headline": "Tinubu will give women more opportunities if elected",
    "summarized_story": "The APC women leader gave the commendation on Monday while featuring on TVC News programme, This Morning with Yori Folarin.\nAdvertisementThe women leader said the APC candidate has given many women the platform to thrive not only in political space, but every other sphere of life.\nThe APC national women leader said the former governor is someone that can be trusted that he will give women more opportunities when he gets to power.\nHe has given women more opportunities in government.\nAnd he promised that beyond the 35% affirmative, he will give women more sensitive positions in government from the cabinet to the heads of parastatals,” the women leader said."
  },
  {
    "headline": "Ogun declares Tuesday work-free for PVC registration",
    "summarized_story": "The Ogun State Governor, Dapo Abiodun, has declared Tuesday, 26th July, 2022 as a work-free day in the State as the deadline for registration of voters for 2023 General Elections comes to a close on Sunday, 31st of July.\nIn a Statement issued in Abeokuta on Sunday by his Chief Press Secretary, Kunle Somorin, the Governor said the “one-day public holiday is to provide a window for all workers in the state, who have either lost their cards, not registered or who might need to travel to their wards, local government areas and constituencies to perfect their Permanent Voters Registration or transfer their cards, where necessary, to enable them participate in the next general elections”.\nAdvertisement“As an inclusive, participatory and accountable government, the role of PVCs to the citizens cannot be overemphasised,” the statement added.\nThe Governor, therefore, urged all eligible adults to seize the opportunity of the holiday to go home to their different wards and constituencies to search for their Registered Voter Cards (PVCs), fill the claims and objections forms and transfer the PVCs where necessary, the statement concluded.\nAdvertisement"
  },
  {
    "headline": "I am in APGA to effect positive change in Enugu-Frank Nweke",
    "summarized_story": "Speaking on TVC’s most popular current affairs show, Journalist Hangout, on Sunday, Mr Nweke said his leaving the PDP was not far fetched.\nMr Nweke bemoaned the current state of Enugu, claiming that there has been no positive development in 7 years of PDP rule.\n“Structure or no structure, across the length and breadth of enugu,the people are living in abject poverty.\n“The water crisis is affecting the entire people of Enugu, structure or no structure.\nAdvertisement“The poor road infrastructure is affecting their businesses, structure or no structure,“The insecurity affects the citizens of Enugu irrespective of structure of any party in power”."
  },
  {
    "headline": "Ekiti election: SERAP sues INEC for failing to prosecute vote-buyers",
    "summarized_story": "The Socio-Economic Rights and Accountability Project, SERAP has filed a suit against the Independent National Electoral Commission, INEC for “failing to prosecute those suspected to have participated in vote-buying and electoral bribery” in the June 18 governorship election in Ekiti State.\nAdvertisementSERAP In a statement on Sunday, cited reports that suggested there was a brazen pattern of vote-buying and electoral bribery at several polling units in the state, including bargaining prices for votes and payments made in uncompleted buildings.\nThe group in the suit seeks “an order to compel INEC to obtain detailed information about reports of vote-buying by the three leading political parties in the Ekiti election.”AdvertisementAdvertisementSERAP is also seeking to compel INEC to promptly and effectively prosecute those arrested, and bring to justice anyone who sponsored, aided and abetted act.”SERAP is arguing that, “Vote buying is a threat to fair and representative elections.\nVote buying amounts to undue influence and improper electoral influence.”AdvertisementAccording to SERAP, “Wealthy candidates and their sponsors ought not to be allowed to profit from their crimes.\nA corruption-free electoral process is essential for building public confidence in the electoral process, and the credibility and legitimacy of the 2023 elections.”“One of the people’s most sacred rights is the right to vote."
  },
  {
    "headline": "Liborous Oshoma: INEC is Acting Like an Interested Party in Delta",
    "summarized_story": "Liborous Oshoma, Lawyer and Public Affairs Analyst speaks on the controversy surrounding the Delta State PDP governorship primaries."
  },
  {
    "headline": "Terrorists Free Four of 43 Remaining Abducted Train Passengers",
    "summarized_story": "Four of the remaining 43 passengers abducted in the attack Abuja- Kaduna passenger train on March 28, 2022, have been released.\nTukur Mamu, who has been negotiating the release of the victims confirmed this on telephone, saying they were released on Monday.\nThe terrorists had on March 28, attacked an Abuja-Kaduna bound passenger train, killing eight people, injuring several others while 62 of the passengers were abducted.\nSo far 23 of the victims have been freed with some of them paying millions of naira as ransom.\nAbdulfatai Jimoh, coordinator of relations of the abducted passengers did not respond to telephone calls when contacted."
  },
  {
    "headline": "Fashola Says Right-Thinking Nigerians Will Vote APC -Trending With Ojy Okpe",
    "summarized_story": "Nigerians have reacted with outrage to the viral video showing terrorists; who attacked the Abuja-Kaduna train on March 28th flogging some of the victims they abducted during the attack.\nIn another development ‘Ado Aleru’, a suspected terrorist who was recently turbaned as Sarkin Fulani in Zamfara State on Sunday during an interview said that he was encouraged by family members to accept the chieftaincy title.\nThe former minister of transportation Rotimi Amaechi in his first public address after losing the presidential ticket of the All Progressives Congress to Asiwaju Bola Ahmed Tinubu said that delegates who sold their votes at the APC presidential primary are now regretting their actions.\nFinally, the minister of works and housing Babatunde Fashola came under fire on social media for saying every right-thinking Nigerian will vote for the All Progressives Congress in the 2023 general election."
  },
  {
    "headline": "Buhari Congratulates Tobi Amusan For Winning Historic World 100m Hurdles Gold",
    "summarized_story": "Nigeria President Muhammadu Buhari has congratulated Tobi Amusan for winning the women’s 100m hurdles gold at the World Athletics Championship 2022, setting a new world record in the semifinals of the athletic event and becoming the first Nigerian to win a World Championship.\nThe President, in a release issued Monday by his Media Adviser, Femi Adesina, joined millions of Nigerians in celebrating the outstanding feat by a compatriot and two-time African Games champion, who in one night stunned the athletics world with her superlative and stellar performance.\nPresident Buhari said the legendary career and achievements of the golden girl will continue to inspire the upcoming generations of Nigerian athletes to achieve spectacular success.\nThe President also commended Ese Brume for representing Nigeria with honour and pride, winning silver medal in the Women’s long jump event.\nHe lauded Team Nigeria for displaying courage, integrity and good sportsmanship at the world stage, proving that with hard work and determination, success is achievable."
  },
  {
    "headline": "Tunisia Referendum: Voters Decide Whether to Increase President’s Powers",
    "summarized_story": "Tunisians are voting in a referendum on a controversial new constitution.\nPresident Kais Saied says the vote is necessary in order to advance political reforms.\nTunisia was the birthplace of the Arab Spring, which saw the overthrow of long-serving ruler Zine al-Abidine Ben Ali in 2011.\nThe date of the referendum was chosen by President Saied to mark a year to the day since his dramatic move to suspend parliament and dismiss the government.\nAlthough President Saied still has a core of support among Tunisians who believe the country needs a strong leader to address its problems, there seems little enthusiasm for the referendum."
  }
]