[
  {
    "headline": "Obiano’s water-drinking video: EFCC on a witch-hunt, alleges APGA",
    "summarized_story": "A video of Obiano in EFCC custody was leaked and the video is currently trending on social media platforms.\nSpeaking to our correspondent in Awka, on Sunday, the National Coordinator, APGA Media Warriors Forum, Chinedu Obigwe, said the video showed that EFCC was being used to witch-hunt the former governor.\nObigwe added that the EFCC does not have any justification to use the trending video to mock Obiano by showing the world that he is being humiliated in custody.\nHe said, “Everybody is asking, what wrong has Obiano done to deserve such ill-treatment from EFCC.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "60 children infected as measles hits Benue IDP camps",
    "summarized_story": "There has been an outbreak of measles in some Internally Displaced Persons’ camps in Benue State.\nOur correspondent learnt that about 60 children were down with measles at the Otese IDP camp, while other children were reportedly down with the sickness at the Bawa and Daudu camps, all in the Guma Local Government Area of the state.\nIt was gathered that most of the affected persons were children between the ages of five and above.\n“We’re currently helping the state Ministry of Health to respond to a measles outbreak.\nWe’ve enjoyed partnership with the Ministry of Health, State Emergency Management Agency and other humanitarian and state organisations during these activities.”Copyright PUNCH."
  },
  {
    "headline": "Understanding Type 2 Diabetes and How to cure it",
    "summarized_story": "Uncontrolled type 2 diabetes can lead to chronically high blood glucose levels, which can cause several symptoms and potentially lead to serious complications.\nSymptoms of type 2 diabetesIn type 2 diabetes, your body isn’t able to effectively use insulin to bring glucose into your cells.\nComplications associated with type 2 diabetesFor many people, type 2 diabetes can be effectively managed.\nType 2 diabetes in childrenType 2 diabetes in children is a growing issue.\nAccording to the American Diabetes Association (ADA), around 193,000 Americans under age 20 have type 1 or type 2 diabetes."
  },
  {
    "headline": "Cleric urges Christians to show mercy to others for peaceful coexistence",
    "summarized_story": "By Adeola BadruA cleric, Rev James Owoyemi, has urged Christians to avoid bearing anger and always show mercy to one another to promote peaceful coexistence.\nHe advised Christians to endeavour to forgive an offender to obtain mercies of God.\nIf our leaders have the mind of mercy, they will be ruling with the fear of God.”“Mercy entails that you do things that will make others happy.\nOfficers of the church who were in attendance include, wife of the president, Rev (Mrs) Mary Owoyemi; the Administrative Secretary, Pastor Joseph Oluwatuwase; General Evangelist, Evang.\nIdowu Gabriel; the General Superintendent, Pastor Oluwaremilekun Ogunlade and the church media director, Paul Erakhifu, among others."
  },
  {
    "headline": "Agbonifo declares for Edo house of assembly",
    "summarized_story": "By Ozioruva AliuBENIN CITY – A businessman and philanthropist, Eghosa Asemota Agbonifo on Sunday declared his intention to contest for the Edo State House of Assembly to represent Oredo West Constituency.\nHe said in the statement: “It is a very emotional moment today as I officially make my decision concerning the forthcoming general elections, public.\n“To be honest, I was tempted to face my business and family considering the turnout of the last elections.\n“The people of Oredo-West are my family and their well-being is my business.\n“I am counting on your support as at the other time and I know you won’t let me down.”"
  },
  {
    "headline": "New Electoral Act’ll make rigging almost impossible – Abaribe",
    "summarized_story": "And the basic thing that we have in the Electoral Act today is the fact that it will make rigging almost impossible.\nThere is an aspect of that legislation, which people talk about, which I do not think is in the law.\nNo law is made to be retroactive, so Section 84(12) doesn’t say that you ought to have resigned by now.\nIt is obvious that the APC has nothing to offer the South-East and we repeat not just the South-East; the APC has nothing to offer the country.\nQuoteIt is obvious that the APC has nothing to offer the South-East and we repeat not just the South-East; the APC has nothing to offer the country."
  },
  {
    "headline": "Edo court jails an ex-victim for human trafficking",
    "summarized_story": "Justice Irele lfeje of Court 3, Criminal Division of the Edo State High Court Benin city.\nThe statement said she was charged for engaging in acts of trafficking in persons contrary to Section 13 (4)c of the Trafficking in Persons (Prohibition) Enforcement and Administration Act 2015.\n“On arrival at Burkina Faso, the victim was subjected to beatings, denial of food, and slavery when she objected initially to engage in prostitution.\nShe was later sold to another lady who forced her into prostitution, thereby losing her virginity.\n“The victim was later rescued after the arrest of the convict who was sentenced to one-year jail term with an option to pay N300, 000 fine.”"
  },
  {
    "headline": "I’m only supporting Tinubu for his generosity – Kanu Nwankwo",
    "summarized_story": "A former Super Eagles player, Kanu Nwankwo, has stated that the generosity of the ex-Governor of Lagos State and National Leader of the All Progressives Congress, APC, Bola Ahmed Tinubu, was the reason behind his support for him.\nThe visit of Kanu and other former players to Tinubu on Saturday had drew attention on social media.\nWhile trying to explain the reason behind the visit in a video posted on his social media handles said Tinubu had once been a pillar of for his foundation.\nI’m not a politician, I’m a footballer and a proud one, I’m a legend.\n“22 years ago, Kanu heart Foundation was looking people to help us."
  },
  {
    "headline": "Russia vs Ukraine: It will lead to World War III – President Zelensky warns Putin",
    "summarized_story": "Ukrainian President, Volodymyr Zelensky, has warned that it would end in a third World War if President Vladimir Putin of Russia fails to come to the negotiation table.\nHowever, Zelensky said that if there is just one percent chance for the conflict to stop, both sides should grab the opportunity, adding more innocent people are being killed on a daily basis.\n“But, unfortunately, our dignity is not going to preserve our lives.\nSo, I think we have to use any format, any chance in order to have a possibility of negotiating and the possibility of talking to Putin.\nBut if these attempts fail, that would mean that this is a third World War,” he told CNN."
  },
  {
    "headline": "Akwa Ibom: NUT Calls off strike, mandates teachers to resume Monday",
    "summarized_story": "The Nigeria Union of Teachers, NUT, Akwa Ibom State chapter, has called off its one week industrial action, which commenced on Tuesday, March 15, 2022.\nIt, therefore, called on public school teachers to resume academic activities from Monday, March 21, 2022.\nAccording to the statement “The leadership of the Nigeria Union of Teachers (NUT) Akwa Ibom State wing hereby suspend its industrial action earlier declared against the Akwa Ibom State government from midnight of Tuesday 15th March, 2022.\nOthers include payment of promotion arrears for 2011, 2012, 2013, 2014, 2015, 2016 to primary schools teachers, immediate commencement of 2019, 2020, 2021 promotion exercise to teachers and payment of 7.5percent contributory pension refunds to teachers as soon as records are reconciled and other issues listed in the strike bulletin.\nThe union, however, appreciated teachers, parents and students for their understanding thus far even as it prayed the government would keep its side of the bargain."
  },
  {
    "headline": "Buhari condemns attack on home of Ohaneze Ndigbo President, Obiozor’s home",
    "summarized_story": "President Muhammadu Buhari, has condemned in strong terms the destruction in Imo State, of buildings and assets of the Police and the home of Professor George Obiozor, the President General of the Ohanaeze Ndigbo.\nBuhari, who spoke through his media aide, Garba Shehu on Sunday, described Obiozor as a leading voice of moderation in the affairs of the country who does not deserve such treatment.\nBeyond the condemnation of violence in the subregion, Buhari urged everyone to maintain peace, insisting that the law and order situation in the entire Southeast is being reviewed.\nHe said while this is being done, the people of Imo State in particular and the subregion in general, should maintain peace as the police and other agencies are working to ensure that normalcy is restored at the earliest.\nRecall that Imo state was at the weekend thrown into another wave of violence when some unknown gunmen unleashed attacks on the property of Chief Obiozor in Imo State."
  },
  {
    "headline": "Police begin implementation of Soludo’s directive to clear ilegal revenue collectors in Anambra",
    "summarized_story": "Anambra State Police Command has said that it has begun immediate implementation of the directive of the state governor, Prof. Chukwuma Soludo, to rid Anambra of revenue louts.\nSoludo while speaking to residents of Okpoko, a slum near Onitsha had abolished all manner of touting, especially as it has to do with revenue collection.\nIn a press release by the state police command’s spokesperson, DSP Toochukwu Ikenga, the command said it is ready to carry out the directive.\nIkenga in the release wrote: “The Commissioner of Police, Anambra Command, CP Echeng Echeng, has given marching orders to the Heads of Tactical Units, Divisional Police Officers (DPOs) and Heads of Departments (HODs) across the Command to strictly enforce the pronouncement by Anambra State Government, on ban on louting and self-acclaimed revenue collectors in the state.\nHe said CP Echeng reaffirmed the commitment of the Command towards crime prevention, restoration of law and order, while enjoining Anambra people and all residents of the State to be vigilant and security conscious at all times and to report all suspicious movements to the police."
  },
  {
    "headline": "CBN slashes interest on intervention loans to 5%",
    "summarized_story": "The Central Bank of Nigeria (CBN) has cut interest rates on all intervention facilities from nine to five per cent per annum.\nCBN Director, Financial Policy and Regulation Department, Chibuzo Efobi, explained that in uncertain times, there was always a way to ensure that businesses survived, including granting forbearance.\nHe said the regulatory forbearance also includes restructuring of credit facilities impacted by Covid-19.\nThe CBN said it will continue to monitor developments and implement appropriate measures to safeguard financial stability and support stakeholders impacted by the Covid-19 pandemic.\nThis means that, despite increased access to credit, Nigerians are still paying as much interest rates to the commercial banks."
  },
  {
    "headline": "Lagos agog as Ex-Super Eagles stars honour Tinubu ahead of 70th birthday",
    "summarized_story": "Prominent personalities, dignitaries, associates, supporters trooped out in numbers to grace the novelty football match played in commemoration of Tinubu’s 70th birthday anniversary.\nThe match was part of a series of activities lined up to mark the birthday anniversary of Tinubu.\nKolade Alabi, LG/LCDAs chairmen, support groups joined Tinubu to kick-off the game.\nTwo goals scored by former Super Eagles striker Agali, gave the Eagles team victory over Ex-Lagos International in the thrilling encounter.\nPolitical supporters at the match chanted several songs in support of Tinubu’s aspiration."
  },
  {
    "headline": "Police to officers: Don’t demand custom papers from drivers",
    "summarized_story": "The Nigeria Police Force (NPF) on Sunday directed officers across the country to stop requesting Customs papers from drivers.\nAdejobi added that the issuance of tinted glass permits remains suspended.\nHe said officers are only expected to stop such vehicles, search it as well as the occupants.\nREAD ALSO: Police arrest two for allegedly killing motorcyclist in Ogun“No policeman should demand your customs papers.\n“We have suspended issuance of tinted glass permits, so we don’t expect our men to disturb Nigerians on this."
  },
  {
    "headline": "Ohanaeze attacks Wike over Obaseki, Umahi",
    "summarized_story": "Ohanaeze Ndigbo Worldwide on Sunday decried what it described as the constant negative comments of River State Governor Nyesom Wike, saying they could wreck his political career.\nThe foremost Igbo socio-cultural group’s comments followed its disagreement with Wike’s recent verbal assault against Governor Obaseki of Edo State.\nIt also insinuated that Wike was somehow involved in the recent judicial travails of Ebonyi State Governor, David Umahi, but provided no proof for the allegation.\nOhanaeze warned that it would not forgive Wike if he does not back down on Umahi’s travails.\nIsiguzoro said: “The verbal diarrhoea of Governor Nyesom Wike of Rivers State in all national issues is worrisome, and that will likely wreck his political career to a disastrous end."
  },
  {
    "headline": "Touts dare Soludo’s revenue order, attack tricycle operator in Awka",
    "summarized_story": "A gang of touts on Sunday descended heavily on an unidentified tricyclist for reportedly refusing to pay daily collection of N200 at the park where he operated in Awka, Anambra State.\nThe victim was said to have refused to part with the money following its ban by the new Governor of the state, Prof. Chukwuma Soludo.\nSoludo had, during his inauguration on Thursday, banned all forms of touting and cash payment of taxes in the state.\nMeanwhile, The Commissioner of Police, Anambra Command, CP Echeng Echeng has ordered strict enforcement of the pronouncement by the State Government on ban on touting and self-acclaimed revenue collectors in the State.\nThe CP through the Command spokesperson, Ikenga Tochukwu enjoined the officers to ensure full compliance with the order, especially at motor parks and other designated places within the State."
  },
  {
    "headline": "Police foil gunmen attack at Uzodimma’s community, kill 4",
    "summarized_story": "Become a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nWhile there was no casualty on the side of the joint security operatives,” Abattam said.\nSame vain, gunmen on Saturday night attacked operatives of the Abba vigilance group and Abba Security Network in the Nwangele Local Government Area of the State.\nA source from the community told our correspondent that the vigilante groups were as usual on duty patrolling the community at about 10 pm when the gunmen attacked them.\nThe gunmen chased them inside the bush, shooting sporadically."
  },
  {
    "headline": "Ali Modu Sheriff quits race for APC national chairman",
    "summarized_story": "From Romanus Ugwu, AbujaFormer Governor of Borno State, Ali Modu Sheriff (SAS), has formally announced his withdrawal from the national chairmanship race of the All Progressives Congress (APC) ahead of the party’s national convention this week.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nClick here to see how you too can get paid .\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nHe said that he will however renew his interest should the leadership of the party change their decision on zoning and announce the extension in the sale of the nomination forms."
  },
  {
    "headline": "Kogi erupts as Natasha defects to PDP with thousands of supporters",
    "summarized_story": "From Emmanuel Adeyemi, LokojaIn what many have described as a terrible blow to the ruling All progressives Congress (APC) in Kogi State, Natasha Akpoti Uduaghan, ‘the Amazon of Kogi politics’, officially defected to the People’s Democratic Party (PDP) with thousands of her supporters on Saturday.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nThe PDP chairman commended the people of the state for their resilience in standing against the misfortune of the ruling APC saying, with the calibre of defectors, the people have resolved to reclaim the state.\nIn her speech, Natasha explained that her joining the PDP was to seek a more formidable platform to wrestle power from the APC.\nShe solicited the support of all well-meaning party members to see the defection as a service to the people of the senatorial district and the entire state."
  },
  {
    "headline": "APC convention: Unity list, micro-zoning, consensus pose fresh challenges",
    "summarized_story": "From Romanus Ugwu, AbujaThe inability of several geo-political zones to agree on an acceptable micro-zoning formula and the plans to raise unity list by certain party cabals, among others, are some of the challenges confronting this week’s proposed national convention of the All Progressives Congress (APC).\nCuriously, most of the aspirants that returned their expression of interest and nomination forms to the party’s national secretariat, admitted collapse in the attempts to agree on acceptable micro-zoning arrangements.\nI saw a video of someone saying that the governor said a consensus has been made.\nAsked which mode of election, direct, indirect or consensus, he would prefer for the APC to adopt, he said: “I am a democrat.\nBeyond the disagreements in arriving at common ground on consensus and micro-zoning of the national offices, the apprehension and anxiety trailing the anticipated release of unity list few days ahead of the convention this week has become very palpable."
  },
  {
    "headline": "2023: Fresh anxiety in PDP over presidential zoning",
    "summarized_story": "From Ndubuisi Orji, AbujaThere is fresh anxiety in the Peoples Democratic Party (PDP) over the zoning of the party’s 2023 presidential ticket as leaders of the party continue to disagree on whether the ticket should be zoned or thrown open.\nThe PDP commenced the sale of nomination forms for all aspirants seeking to contest the 2023 polls on its platform on March 17.\nIn recent times, there have been controversy on whether or not the PDP should zone its presidential ticket for the next general election or throw it open to all qualified aspirants.\nWhile the zoning committee will submit its report in two weeks.\n“So, what happens if the committee decides to zone the presidential ticket to a particular part of the country?"
  },
  {
    "headline": "Tambuwal, Adamu, Saraki Meet, Mull Consensus Northern Candidate",
    "summarized_story": "Bala Muhammad of Bauchi state on Sunday hosted his Sokoto state counterpart, Aminu Waziri Tambuwal, and former Senate President, Bukola Saraki, to a consensus building initiative among aspirants of Northern extraction for the position of President under the aegis of the People’s Democratic Party (PDP).\nThe trio, all seeking the nomination of the PDP to run for the seat of Nigeria’s President, met for about two and half hours in Government House, Bauchi.\n“These are more important than our individual ambitions, thus the need for us to work together,” he emphasized.\nThe PDP is ready because what is important is Nigeria.\nThe Deputy Governor of Bauchi state, Engr Baba Tela, was also present at the press briefing."
  },
  {
    "headline": "Ahead of National Convention, APC Begins Screening of Aspirants Today",
    "summarized_story": "APC 2022 National Convention Screening Committee headed by the Kastina State Governor, Hon.\nThe 69-year-old businessman-turned-politician is also keen on becoming the next APC chairman.\nHe is believed to have been anointed as the consensus national chairman but the other contestants have refused to accept his nomination.\nAdebayo ShittuA former Minister for Communication, Alhaji Adebayo Shittu is the first person to indicate interest in the office of APC National Secretary.\nIfe OyedeleExecutive Director, Niger Delta Power Holding Company (NDPHC), Mr. Ife Oyedele, is another aspirant for the office of APC National Secretary."
  },
  {
    "headline": "CSO Accuses Desperate Politicians of $1 Million Smear Campaign Plot against Buhari, Emefiele",
    "summarized_story": "Others include the Yoruba Council of Youths, Igbo Youth Movement, Middle Belt Youth Movement, South East Youth Assembly and Lawyers in Defence of Democracy.\nSNP Convener, Mr Peter Abang, said they alerted the public to disregard the smear campaigns once they kicked off.\nHe concluded that Emefiele had contained and dealt with a 60 per cent decline in the price of crude oil.\n“The good people of Nasarawa State benefited so much from the good stewardship of the current CBN Governor.\nNasarawa is the home of solid minerals; Mr Emefiele’s policies of diversification invested so much in solid mineral resources and agriculture."
  },
  {
    "headline": "Game on, Court Vacates Order Stopping APC’s Convention, Akpanudoedehe Returns",
    "summarized_story": "Justice Kawu vacated the order stalling APC’s National Convention following an application by the party to that effect.\nThere were allegations that Buni had perfected plans to scuttle the party’s national convention in order to remain as Caretaker Chairman.\nNasir el-Rufai, Governor of Kaduna, on March 9, alleged that Buni’s lawyers colluded with a petitioner to “destroy” the National Convention.\nHe described the said court order as a “hidden nuclear weapon” that would have hampered the party’s chances in the 2023 general election.\n“We are now at the finishing line in the preparations for our National Convention, which is at hand."
  },
  {
    "headline": "Awka Monarch: Ebelechukwu Obiano Has Desecrated Kingdom By Fighting Bianca, Says Serious Consequences Loom",
    "summarized_story": "A fight that broke out last Thursday between the two women during the inauguration of Professor Charles Soludo as Governor resulted in Bianca slapping Ebelechukwu.\nEze Ndigwe also ordered Ebelechukwu to apologise to Bianca within seven days to avoid consequences.\nThe Obi of Awka, in his press release, said he had given Ebelechukwu seven days to publicly apologise to the entire Igbo people or face serious consequences.\nHe added that a study of the scenario showed that Mrs. Obiano’s action was deliberate, as she came very much prepared to disrupt the swearing in ceremony.\nBianca endorsed Obiano and called on all APGA members, including then Governor Obi to support him."
  },
  {
    "headline": "EXCLUSIVE: How Attorney-General Malami, Amaechi, Emefiele Procured Court Order Deleting Section 84(12) Of Electoral Act, To Safeguard Their Political Ambitions",
    "summarized_story": "SaharaReporters earlier today reported that the court sitting in Umuahia, Abia State, ordered the Office of the Attorney-General of the Federation to immediately delete Section 84 (12) of the Amended New Electoral Act.\nHowever, top sources revealed to SaharaReporters on Friday night that Malami was the brains behind the court order obtained from Abia State.\n“The judgment of the Court will be recognized by the Government printers in printing the Electoral Act.\nThe Act will be gazetted factoring the effect of the judgment into consideration and deleting the constitutionally offensive provision accordingly.\n“The provision of Section 84(12) of the Electoral Act 2022 is not part of our law and will be so treated accordingly."
  },
  {
    "headline": "EXCLUSIVE: How Attorney-General Malami, Amaechi, Emefiele Procured Court Order Deleting Section 84(12) Of Electoral Act, To Safeguard Their Political Ambitions",
    "summarized_story": "SaharaReporters earlier today reported that the court sitting in Umuahia, Abia State, ordered the Office of the Attorney-General of the Federation to immediately delete Section 84 (12) of the Amended New Electoral Act.\nHowever, top sources revealed to SaharaReporters on Friday night that Malami was the brains behind the court order obtained from Abia State.\n“The judgment of the Court will be recognized by the Government printers in printing the Electoral Act.\nThe Act will be gazetted factoring the effect of the judgment into consideration and deleting the constitutionally offensive provision accordingly.\n“The provision of Section 84(12) of the Electoral Act 2022 is not part of our law and will be so treated accordingly."
  },
  {
    "headline": "Anti-graft Agency, EFCC Moves Ex-Anambra Governor, Obiano From Lagos To Abuja For Interrogation",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has moved former Anambra Governor, Willie Obiano to its headquarters in Abuja.\nGovernor Willie ObianoUwajaren said Obiano was still in detention and not released as reported by some newspapers.\nSee Also Breaking News BREAKING: Anti-graft Agency, EFCC Arrests Ex-Anambra Governor, Obiano At Lagos AirportObiano is also being probed over some suspicious projects, including the Umueri International Airport project whose cost was believed to be inflated.\nEFCC operatives had picked him up at the Murtala Muhammed International Airport, Lagos, around 08:30 pm on Thursday.\nHe was on his way to Houston, Texas, US, after handing over to his successor, Governor Charles Soludo."
  },
  {
    "headline": "Anti-graft Agency, EFCC Moves Ex-Anambra Governor, Obiano From Lagos To Abuja For Interrogation",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has moved former Anambra Governor, Willie Obiano to its headquarters in Abuja.\nGovernor Willie ObianoUwajaren said Obiano was still in detention and not released as reported by some newspapers.\nSee Also Breaking News BREAKING: Anti-graft Agency, EFCC Arrests Ex-Anambra Governor, Obiano At Lagos AirportObiano is also being probed over some suspicious projects, including the Umueri International Airport project whose cost was believed to be inflated.\nEFCC operatives had picked him up at the Murtala Muhammed International Airport, Lagos, around 08:30 pm on Thursday.\nHe was on his way to Houston, Texas, US, after handing over to his successor, Governor Charles Soludo."
  },
  {
    "headline": "Atiku to formally declare presidential ambition Wednesday",
    "summarized_story": "Former Vice-President Atiku Abubakar will formally declare his intention to run for the office of the president on Wednesday.\nLast week, a group known as Northeast Business Community paid for Atiku to secure the nomination and expression of interest forms of the Peoples Democratic Party (PDP).\nThe group, which was led by Abubakar Funakayi, had presented the forms to the former vice-president at his residence.\nAdvertisementAccording to a statement from Atiku’s media office on Sunday, he will declare his intention to contest the 2023 presidency at the International Conference Centre, Abuja by 11am.\nAdvertisement“His official declaration kickstarts the former Vice President’s participation in the race for the presidential ticket of the PDP ahead of the next year’s general election.”"
  },
  {
    "headline": "Atiku to formally declare presidential ambition Wednesday",
    "summarized_story": "Former Vice-President Atiku Abubakar will formally declare his intention to run for the office of the president on Wednesday.\nLast week, a group known as Northeast Business Community paid for Atiku to secure the nomination and expression of interest forms of the Peoples Democratic Party (PDP).\nThe group, which was led by Abubakar Funakayi, had presented the forms to the former vice-president at his residence.\nAdvertisementAccording to a statement from Atiku’s media office on Sunday, he will declare his intention to contest the 2023 presidency at the International Conference Centre, Abuja by 11am.\nAdvertisement“His official declaration kickstarts the former Vice President’s participation in the race for the presidential ticket of the PDP ahead of the next year’s general election.”"
  },
  {
    "headline": "2023: Saraki, Tambuwal, Mohammed 'agree' on consensus PDP presidential candidate",
    "summarized_story": "Bukola Saraki, former senate president, says some of the Peoples Democratic Party (PDP) presidential hopefuls from the north are ready for a consensus candidate.\nTheCable had reported that the PDP will hold its national convention on May 28 to elect a presidential candidate, while the governorship primaries will take place on May 21.\nAhead of the convention, the contentious issue is the zoning of the party’s presidential candidate amid the clamour for a southern flagbearer.\nOn Sunday, Saraki and Aminu Tambuwal, governor of Sokoto, paid a consultative visit to Bala Mohammed, governor of Bauchi state.\nSpeaking during the visit, Saraki said any of them is qualified to lead the country, adding that they have resolved to agree to a consensus arrangement to elect the party’s presidential flagbearer."
  },
  {
    "headline": "2023: Saraki, Tambuwal, Mohammed 'agree' on consensus PDP presidential candidate",
    "summarized_story": "Bukola Saraki, former senate president, says some of the Peoples Democratic Party (PDP) presidential hopefuls from the north are ready for a consensus candidate.\nTheCable had reported that the PDP will hold its national convention on May 28 to elect a presidential candidate, while the governorship primaries will take place on May 21.\nAhead of the convention, the contentious issue is the zoning of the party’s presidential candidate amid the clamour for a southern flagbearer.\nOn Sunday, Saraki and Aminu Tambuwal, governor of Sokoto, paid a consultative visit to Bala Mohammed, governor of Bauchi state.\nSpeaking during the visit, Saraki said any of them is qualified to lead the country, adding that they have resolved to agree to a consensus arrangement to elect the party’s presidential flagbearer."
  },
  {
    "headline": "PDP: Frustration in the country may trigger agitation worse than #EndSARS",
    "summarized_story": "The Peoples Democratic Party (PDP) says the current socio-economic challenges in the country are likely to lead to agitations worse than the 2020 #EndSARS protest.\nIn a statement issued on Sunday, Debo Ologunagba, PDP spokesperson, said President Muhammadu Buhari’s “failure” to address the issues “is akin to kneeling on the necks of Nigerians”.\n“The PDP warns that there is a limit to what the people can bear under an administration that remains arrogant, inhumane, unconcerned and insensitive to their plights occasioned by its misrule,” Ologunagba said.\n“Is it not an unpardonable dereliction of duty that while the nation is in turmoil and agonizing under a collapsed national grid, protracted fuel crisis, distressed aviation sector, plummeting currency, crippled production and commercial activities, President Muhammadu Buhari remains aloof and “absent” as always?\nAdvertisement“The frustration in the country is already degenerating into a nationwide restiveness that may result in the breakdown of law and order if allowed to fester,” the party said."
  },
  {
    "headline": "Google’s Africa internet cable to first arrive in Togo",
    "summarized_story": "Google has announced that Equiano, a subsea internet cable running through Portugal to South Africa, will first land in Togo.\nThis announcement marks a milestone in Google’s plan to provide affordable internet access in Africa by building global infrastructure to help bring faster internet to more people and lower connectivity costs.\nLast October, Google CEO Sundar Pichai announced a plan to invest $1billion over 5 years to support digital transformation in Africa, of which project Equiano is part of.\nNitin Gajria, Managing Director of Google Sub-Saharan Africa commented, “The landing of Equiano affirms Google’s commitment to the African continent, to support Africa’s digital transformation.\nThe shutdown of Google’s Project Loon brought up questions about the fate of Google’s other internet projects targeted at Africa."
  },
  {
    "headline": "Digital Nomads: The Nigerians escaping Ukraine’s war",
    "summarized_story": "Students, all of whom are given temporary residence permits, can work unofficially or do small businesses by registering as private entrepreneurs.\n“I finished last year, and I was going to leave Ukraine this year.\nYou can’t get out that easily.”A day after Russia’s invasion, Ukraine’s president Volodymyr Zelenskyy instituted martial law and grounded commercial flights.\n“I was already applying for visas to leave Ukraine for the UK where my brother is.”Kemi’s journey is not so certain.\nIf you think your story fits the Digital Nomads bill, reach out to us here."
  },
  {
    "headline": "Big Cabal Media raises $2.3m to expand its compelling line of digital products",
    "summarized_story": "In 2021, venture capital invested $115 million in digital media globally, a tenth of the $1.1billion it funded in 2015, but not much came to Africa.\nToday, one of such exceptions, Big Cabal Media (BCM), a leading African digital media company, has announced a $2.3 million Seed funding round, emphasising its commitment to keep building exciting and authoritative media products and brands.\nBCM’s progress over the years and recent fundraise is a noteworthy example of the possibilities and opportunities in Africa’s digital media sector.\nOf the reported $4.3–$5 billion raised by African startups in 2021 whereby fintech received 53–63% of the volume, digital media companies are one of many sectors that have traditionally been overlooked in the conversation of tangible ventures.\n“Investing in Africa’s booming digital media sector aligns perfectly with MaC’s mission of supporting exceptional entrepreneurs building valuable technology companies that leverage shifts in cultural trends and behaviours."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Did you miss Apple’s first event of the year?\nI did, but I saw a recap and the best way to describe my reaction is..."
  },
  {
    "headline": "Big Cabal Media’s seed funding",
    "summarized_story": "This means that sharing your Netflix password with someone else may soon become expensive, as account sharing will incur an additional fee.\nToday, I’ll be discussing:Dream VC’s pipeline planBig Cabal Media’s seed fundingDream VC’s pipeline planNowadays, it appears that many people want to work in technology companies.\nHowever, only a small percentage are familiar with the Venture Capital (VC) industry.\nInterestingly, venture capital funding only became common in the last decade, leaving a considerable talent gap, which Dream VC was founded to fill.\nBig Cabal Media’s seed fundingIf you are on Twitter, you might likely have read content from Zikoko, TechCabal, or both."
  },
  {
    "headline": "Inside Dream VC’s plan to build a pipeline for African VC talent",
    "summarized_story": "However, very few understand or are even aware of the venture capital space, but Mark Kleyner and Cindy Ai want to demystify the space with Dream VC.\nInterestingly, VC funding only became common in the past decade, and so there is a gaping talent hole, which Dream VC was launched to fill.\nThe goal was to help them break into the VC space,” he added.\nHaving tested their hypothesis, Dream VC would be launching two programmes: the Launch into VC Program and the Investor Accelerator Program.\nLaunch into VC is a fully remote 13-week programme targeted at early-stage professionals looking to break into the VC space."
  },
  {
    "headline": "African B2B eCommerce on growth streak",
    "summarized_story": "The eCommerce startup also got a makeover, changing its name from Sokowatch to Wasoko, meaning people of the market.\nThe B2B model: Like TradeDepot, Alerzo and other eCommerce startups that have raised funds from 2021, B2B is the dominant model.\nAs B2B continues to be the go-to model for eCommerce in Africa, only time will tell how sustainable it is.\n4G Capital’s $18m fundingKenyan fintech startup, 4G Capital, has raised $18 million in a Series C round led by Lightrock.\nA touch of eCommerce: 4G Capital plans to roll out new products, including an app, later this year."
  },
  {
    "headline": "Explainer: Nigeria’s debt status in 10 points",
    "summarized_story": "Patience Oniha, the Director General of the Debt Management Office (DMO), last Thursday made a detailed presentation of Nigeria’s total public debt status as of December 31, 2021.\nHere is a breakdown of the numbers and major takeaways:Total public debt: N39.556 trillionTotal Public Debt as at December 31, 2021 was NGN39.556 trillion as against NGN32.915 trillion, same period in 2020.\nDebt to GDP Ratio 22.47%Debt to GDP Ratio stood at 22.47% compared to 21.61% in 2020.\nNigeria’s low revenue base therefore makes the Debt Service to Revenue Ratio unacceptably high.\nDebt management tools: DSA, MTDSIn managing the risks associated with the Public Debt, the DMO uses World Bank/IMF debt management tools such as the Debt Sustainability Analysis (DSA) and the Medium Term Debt Management Strategy (MTDS)."
  },
  {
    "headline": "Tenants in serviced estates cry out as rising energy cost bites – Survey",
    "summarized_story": "A recent survey by BusinessDay shows that tenants are really not having it easy as 75 percent of those polled who live in serviced estates said services have dropped, especially power supply.\nThey noted that power supply is now supplied according to need or request.\nWe want to pay for what we use for God’s sake,” making veiled reference to epileptic power supply.\nRising energy cost in BeninIn Benin, the Edo State capital, tenants experience is also not as bad as it is for their Lagos counterparts.\nBusinessDay gathered that service charge and delivery had not changed even though energy cost has gone up."
  },
  {
    "headline": "What you need to know about Nigerian actors in Bel-Air",
    "summarized_story": "What you need to know about Nigerian actors in Bel-AirThe 2022 reboot of ‘Fresh Prince of Bel-Air’ one of the most popular TV series of the ’90s titled Bel-Air aired on February 13, 2022 on American streaming platform Peacock.\nBusinessDay takes a look into the life and career of Akingbola and Sholotan the Bel-Air actors with Nigerian roots.\nThe British-Nigerian actor has won a good number of awards for works on British series like Blue/Orange, Rev, and Holby City.\nSome of his awards are TMA Awards Best Supporting Actor 2005, BEFFTA Awards best TV actor, and best Film actor in 2010, Nigerian Entertainment & Lifestyle Awards Best TV actor, and Movie, Video & Screen Awards Best Comedy Performance in TV both in 2012, and many others.\nIn 2022 he landed the role of Charlton in the reboot of the popular 90s series Bel-Air which aired in mid February 2022."
  },
  {
    "headline": "Edo offers property developers 2-week window for issuance of free building plans …begins farming season March 25 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government, as part of efforts at ensuring all property in the state are with building plans, is offering property developers a 2-week window for issuance of free building plan permits.\nShe noted, “The ‘Operation show you building plan’ seeks to encourage all land developers and those building to come for their building plan in the ministry.\nThe objective of the exercise is to capture all into the Edo State Master Plan as it’s necessary for development.\nThis year’s farming season should be taken seriously as there will be an interface between farmers and off-takers.\n“The disease is a pandemic that is still ravaging some communities across local government areas in Edo State."
  },
  {
    "headline": "AAU VC Lauds Outgoing Registrar – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestTHE acting Vice Chancellor of the Ambrose Alli University, (AAU), Ekpoma, Edo State, Prof. Sonnie Adagbonyin has showered encomiums on the outgoing acting Registrar of AAU, Mr. Edward Aihevba for his outstanding achievements in office.\nHe gave the commendation while speaking at the Second Registry Lecture of the institution, titled: Administrative Imperatives for Universities: A case Study of Ambrose Alli University; delivered by the outgoing acting Registrar, Mr. Edward Aihevba.\nThe acting vice chancellor asserted that the outgoing Registrar in his short time in office recorded numerous achievements which were of benefit to the staff, students and the university in general.\nPraised the registry department and outgoing Registrar for the registry lecture initiative, and called on other departments of the university to emulate the registry department by organising similar lectures for staff members.\nHe explained that the registry lecture was introduced in his time as acting Registrar because of his desire to broaden and sharpen the administrative skills of staff of the registry for optimum performance."
  },
  {
    "headline": "Obaseki partners centre on construction of Benin Cultural Village, assures policies to preserve Edo heritage – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has assured support for the construction of the Benin Cultural Village, being built by the Benin Cultural Heritage Centre (BCHC), reassuring that his government will sustain policies and reforms to preserve the state’s rich cultural heritage.\nObaseki, who received the executives and members of the Benin Cultural Heritage Centre on a courtesy visit at the Government House, said his government is paying critical attention to the state’s cultural assets to boost social-economic activities in the culture and tourism sector.\nWe have huge plans for our history and cultural heritage as this administration has a lot to showcase, knowing it can drive our Internally Generated Revenue (IGR) in Edo State.\n“Our governor is very passionate about our cultural heritage.\n“We have trained 300 teachers in Edo language and the government has employed them.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo Community head send SOS to Security Agencies – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe people of Ogheghe Community, Uhuowmonde Local Government Area of Edo State has notified security agencies in the state over the planned attacked by some evil doers been spearheaded by the current chief priest Samuel Emokpae.\nPa Kingsley Iziengbe Amayo in a statement personally singed by him said the community has endured lasting peace since August 2017 judgment by His Royal Majesty, Oba Ewuare II.\nAccording to the statement; Priest Samuel Emokpae from all indications is bent on sabotaging the peace that we have been enjoying for the past four years.\nThe Community still and will continue to abide by the judgment of 15 August 2017 as pronounced by our Royal Majesty.\n” All we want is that various security agencies including the Nigerian Police and Army to take note of this threat by Priest Emokpae before it degenerate to crisis."
  },
  {
    "headline": "Olu of Odeda backs Segun Elemide’s 2023 agenda",
    "summarized_story": "The royal father of Odeda town in Odeda local government area of Ogun State, Oba David Olorunisola, has drummed support for the ambition of member, representing Odeda local government in the Ogun state House of Assembly, Hon Segun Elemide, ahead of 2023 election.\nThe Olu of Odeda made his position known while speaking at the official handing over of a block of 16 market open stalls reconstructed by Hon Elemide, to the executive chairman of Odeda local government, Hon Afolasade Adeyemo, at a well attended ceremony.\nOba Olorunisola’s decision followed the myriad of achievements recorded in the local government by Elemide and observed by the royal father.\nBut the royal father who looked ruffled by the allegation, explained “I am not at war with Hon Elemide.\n“You have done well for us” Oba Olorunisola told Hon Elemide as he moved forward to commission the reconstructed Open market stalls."
  },
  {
    "headline": "Hours after bombing Obiozor’s home, gunmen raze another Imo police station",
    "summarized_story": "Unknown gunmen in the early hours of Sunday, burnt the Divisional Police Headquarters in Omuma community, Oru east Local government Area of Imo State.\nThe attack comes less than 24 hours after an explosive attack on the country home of Professor George Obiozor, president-general of Ohanaeze Ndigbo, as well as Divisional Police Headquarters in Umuguma community.\nThe gunmen were said to have arrived in large numbers at about 3:00 am on Sunday and attacked the station with various calibres of Improvised Explosive Devices (IED) while also shooting sporadically.\nThe Imo State Public Relations Officer, Mike Abattam confirmed the attack on Sunday afternoon.\nFive undetonated Improvised Explosives Devices and charms were also recovered during the operationFacebook Notice for EU!"
  },
  {
    "headline": "NNPC to deduct N242.53bn fuel subsidy from FAAC this month",
    "summarized_story": "The Nigerian National Petroleum Company (NNPC) Limited will deduct N242.53 billion from the Federation Account this month for fuel subsidy.\nThe NNPC disclosed this in its latest presentation to the FAAC meeting, which was obtained by our correspondent in Abuja on Friday, PUNCH reported.\n“The December 2021 value shortfall recovery on the importation of PMS amounted to N210.38bn,” it said.\n“The recovery consists of December 2021 value shortfall of N176.48bn plus the outstanding value shortfall recovery of N33.9bn accrued over the 2021 year.\nOn March 3, 2022, state governors lambasted the NNPC for not remitting any funds at last month’s FAAC meeting."
  },
  {
    "headline": "Tinubu urges Muslim leaders to create political affairs dept to support faithfuls in 2023",
    "summarized_story": "Bola Tinubu, former Lagos State governor and presidential hopeful, has urged the Supreme Council for Shari’ah in the country to create department of political affairs to spread awareness among faithfuls towards producing a muslim president in 2023.\nHe added, “Other religious groups have commenced political sensitisation by creating political departments or directorate among themselves to promote their own.\n“Tinubu disclosed that he would visit the council across the state to solicit support to make his presidential ambtion a reality.\n“Through the president of the Supreme Council for Shari’ah in Nigeria, I will visit all states of this nation.\nHe also called Muslim adherents to use the period of Ramadan to pray for the country to surmount its various challenges."
  },
  {
    "headline": "Court Verdict On Electoral Act, Victory For Rule Of Law – Arewa Youths",
    "summarized_story": "The Arewa Consultative Youth Movement (ACYM) has lauded the judgment of the Federal High Court sitting in Umuahia, Abia State, which on Friday nullified Section 84 (12) of the newly assented Electoral Act, 2022.\nIn a statement made available to journalists in Abuja on Saturday, the ACYM said the sound judgment which affirmed that the controversial section was a violation of the provisions of the nation’s constitution deserved to be celebrated.\nADVERTISEMENTThe group in a statement signed by Kabiru Yusuf, said with the judgment, the coast is now clear for public office-holders who were discriminated against by the section to exercise their right to participate fully in their political parties’ conventions, congresses and primary elections as enshrined in the constitution."
  },
  {
    "headline": "Court Verdict On Electoral Act, Victory For Rule Of Law – Arewa Youths",
    "summarized_story": "The Arewa Consultative Youth Movement (ACYM) has lauded the judgment of the Federal High Court sitting in Umuahia, Abia State, which on Friday nullified Section 84 (12) of the newly assented Electoral Act, 2022.\nIn a statement made available to journalists in Abuja on Saturday, the ACYM said the sound judgment which affirmed that the controversial section was a violation of the provisions of the nation’s constitution deserved to be celebrated.\nADVERTISEMENTThe group in a statement signed by Kabiru Yusuf, said with the judgment, the coast is now clear for public office-holders who were discriminated against by the section to exercise their right to participate fully in their political parties’ conventions, congresses and primary elections as enshrined in the constitution."
  },
  {
    "headline": "DSS Alleges Plot To Cause Ethno-Religious Crisis In North Central",
    "summarized_story": "The Department of State Services (DSS) yesterday said it had uncovered plans by some non-state actors to cause violence in parts of the country, particularly the North Central.\nThe service in a statement signed by its spokesman, Dr Peter Afunanya, said the aim is to cause ethno-religious crisis, ignite reprisals and heat up the polity.\n”Niger Discovers More ExplosivesIn a related development, Niger State Governor Alhaji Abubakar Sani Bello has disclosed that security operatives had detonated explosives planted in Galadima-Kogo, Shiroro local government area of the state.\nThe governor said more security operatives had been deployed to the state, with new strategies adopted to deal with the security situation.\nHe said not all the 4000 internally displaced persons at the Gwada camp were actually displaced as a result of banditry."
  },
  {
    "headline": "DSS Alleges Plot To Cause Ethno-Religious Crisis In North Central",
    "summarized_story": "The Department of State Services (DSS) yesterday said it had uncovered plans by some non-state actors to cause violence in parts of the country, particularly the North Central.\nThe service in a statement signed by its spokesman, Dr Peter Afunanya, said the aim is to cause ethno-religious crisis, ignite reprisals and heat up the polity.\n”Niger Discovers More ExplosivesIn a related development, Niger State Governor Alhaji Abubakar Sani Bello has disclosed that security operatives had detonated explosives planted in Galadima-Kogo, Shiroro local government area of the state.\nThe governor said more security operatives had been deployed to the state, with new strategies adopted to deal with the security situation.\nHe said not all the 4000 internally displaced persons at the Gwada camp were actually displaced as a result of banditry."
  },
  {
    "headline": "2023: Come And Save Nigerian Democracy, Unity, Diaspora Group Writes Atiku",
    "summarized_story": "A pro-democracy group on the aegis of Support Group Atiku U.S.A, has asked former Vice President Atiku Abubakar to formally declare his presidential ambition in order to save Nigerian democracy and unity from further threats.\n“We are supporting Atiku Abubakar because of his formidable track record as a former Vice President of Nigeria with more name recognition and national appeal than his political rivals.\nADVERTISEMENT“We in the Diaspora are watching with consternation how the country is going to the dogs as the economy plummets and unemployment and insecurity get worse.\n“It is befuddling that waiting for good luck seems to be the mindset of the APC administration.\nThis mindset stems from the fact that this administration was not adequately prepared for the task of governance from the beginning."
  },
  {
    "headline": "2023 Presidency: Atiku To Declare Wednesday",
    "summarized_story": "On Wednesday, March 23, 2022, former Vice President Atiku Abubakar will announce his desire to run for President in 2023.\nThis follows months of consultations with stakeholders across the country and in the diaspora, as well as with the PDP’s many institutions.\nAccording to a statement sent by Atiku’s media office on Sunday, the event would be attended by Atiku Abubakar’s friends, associates, political leaders, party loyal, and supporters.\nThe event will begin at 11 a.m. at the International Conference Center in Abuja, according to the statement.\nThe statement partly read “His official declaration kick-starts the former Vice President’s participation in the race for the presidential ticket of the PDP ahead of the next year’s general election.”DAILY POST last week reported that Atiku, the 2019 presidential candidate of the Peoples Democratic Party (PDP), picked the nomination and expression of interest forms of the PDP, which were donated to him by the North East Business Community, urging him to run for president in the 2023 election."
  },
  {
    "headline": "Leaked Obiano’s Video In EFCC Detention Surfaces Online",
    "summarized_story": "An online video of former Anambra Governor Willie Obiano in the custody of the Economic and Financial Crimes Commission has surfaced.\nFormer Anambra State Governor Willie Obiano is being questioned by the Economic and Financial Crimes Commission for the alleged embezzlement of N42 billion from the state.\nObiano was detained by the EFCC on Thursday night, only hours after handing over power to Prof. Chukwuma Soludo, the new governor of Anambra.\nPart of the funds was also allegedly diverted to finance political activities in the state.”Meanwhile, the All Progressives Grand Alliance has condemned Obiano’s arrest by the Economic and Financial Crimes Commission.\nThe party described the arrest of the former governor as a “politically-motivated witch-hunt”, saying that the EFCC had resorted to the use of fifth columnists."
  },
  {
    "headline": "BREAKING: ISWAP Leader, Sani Shuwaram Killed By Nigerian Military Airstrikes, Replacement Nominated",
    "summarized_story": "After airstrikes targeted the Marte axis, the dreaded leader of the Islamic State of West African Province, ISWAP, Sani Shuwaram, and other ISWAP militants may have been killed.\nAccording to PRNigeria, the Nigerian Air Force (NAF) used Super Tucano jets and other aircraft to target the axis where Shuwaram’s camps are located.\n“Shuwaram was among terrorists injured by NAF air interdiction missions conducted at Sabon Tumbuns near Kirta Wulgo in February 2022.\nMeanwhile, it was gathered that one Mallam Bako Gorgore has been nominated as the new Wali of ISWAP to replace Shuwaram.\nMembers of the ISWAP Shura (Judicial) Council, in November 2021, appointed Shuwaram, 45, as a new Leader (Wali) in Lake Chad."
  },
  {
    "headline": "Four Suspected IPOB Members Killed As Police Repel Bomb Attack",
    "summarized_story": "On Sunday, the Imo State Police Command announced that four hoodlums who stormed Omuma Police Station in Oru East Local Government Area of Imo State had been slain.\nThe command stated that on March 20, 2022, at approximately 0300 hours, hoodlums suspected to be members of the outlawed Indigenous People of Biafra/ Eastern Security Network arrived in huge numbers at Omuma Police Station with various calibres of Improvised Explosive Devices (IEDs).\nThe State Commissioner of Police, CP Rabiu Hussaini, confirmed this in a press release issued by the Command’s spokesman, Micheal Abattam, who claimed the hoodlums fired intermittently but were quickly repelled by tactical teams and DSS agents who responded quickly.\nThere was no casualty on the side of the joint security operatives.\n“On the spot, five undetonated different capacities of Improvised Explosives Devices were recovered from the neutralized bandits and charms."
  },
  {
    "headline": "Breaking: Aubameyang nets twice as Barcelona shock Real Madrid in El clasico",
    "summarized_story": "Pierre-Emerick Aubameyang scored twice on his El Clasico debut as Barcelona stunned La Liga leaders Real Madrid 4-0 at the Bernabeu.\nAubameyang headed the visitors in front in the 29th minute and scored their final goal early in the second half.\nRonald Araujo doubled Barca’s advantage before the break, with Ferran Torres adding a third on the counter-attack after 47 minutes.\nReal Madrid were seeking a sixth straight win in this fixture, but looked uninspired and created little as their lead over Sevilla at the top remained at nine points.\nXavi’s Barcelona stretched their unbeaten run to 12 games and rose up to third in the table, 12 points behind Real with a game in hand."
  },
  {
    "headline": "[Breaking] 2022 World Athletics Championship: Ese Brume jumps to Silver *See full results",
    "summarized_story": "Olympic bronze medalist at the 2020 Tokyo Games, Ese Brume, on Sunday night overtook athletes from the United States of America and other countries to win silver medal at 2022 World Athletics Indoor Championships.\nShe won the medal in the long jump at Belgrade, Serbia capital.\nIvana Vuleta won gold at event after hitting 7.06m."
  },
  {
    "headline": "Breaking: Again, Victor Osimhen fires brace as Napoli triumph Udinese in spectacular Seria A comeback display",
    "summarized_story": "Super Eagles star Victor Osimhen became the fourth African to score a double-figure in two consecutive Serie A seasons after his brace helped Napoli to a vital 2-1 victory against Udinese at the Stadio Diego Armando Maradona.\nNapoli started the game on top, seeing more of the ball, and trying to break down the Udinese defence.\nAnd just seven minutes after the restart, Osimhen came in handy for Luciano Spalletti’s team.\nEleven minutes later, Osimhen scored his eleventh Serie A goal of the season after latching on to a pass from Giovanni Di Lorenzo to make it 2-1 for Napoli.\nNapoli held out for the remaining 27 minutes to ensure a 2-1 victory, and were further aided after Pablo Mari was sent off in the 83rd minute."
  },
  {
    "headline": "Bandits Attack Zamfara Community, Kill Village Head And 19 Others",
    "summarized_story": "No fewer than twenty persons have been killed by bandits in Ganar-Kiyawa village of Adabka District, Bukkuyum Local Government Area of Zamfara StateThe latest attack happened on Sunday morning at about 8:30 am when the gunmen stormed the community and started shooting sporadically, killing 20 persons including the village head.\nHe said residents of Ganar Kiyawa have been sleeping in the bush for the fear of being attacked by the bandits in their homes.\nWhen asked about the response of security agencies, he said the military was only stationed at Adabka and Gwashi town, leaving other villages vulnerable to bandits’ attack“The security agencies are not enough to mount all the villages around.\nWe only have a military presence in two major places, Adabka town, and Gwashi.\nAll other villages around are left uncovered by the security agencies so these people (bandits) can just go out anytime they wish to and attack people,” he explained."
  },
  {
    "headline": "Report Officers Who Demand Tinted Glass Permits At Checkpoints, Police Tell Nigerians",
    "summarized_story": "Nigerians are to report police personnel who demand permits for tinted glasses at checkpoints in any part of the country, the Force Headquarters has said.\nApart from tinted glass permits, Adejobi stated that it would be out of bounds for any policeman to demand customs papers or other documents not relevant to their duties.\nHe explained that while there was no need to demand permits for tinted glasses, they could stop such cars only for the purpose of a search.\n“No policeman should demand your customs papers,” the force spokesman said in one of the tweets.\n“We are to stop any vehicle with tints, search the vehicle, and its occupants, but not to delay him for not having tinted glass permits."
  },
  {
    "headline": "Again, Gunmen Attack, Raze Police Station In Imo",
    "summarized_story": "Gunmen have attacked and razed the Divisional Police Headquarters in Omuma community, Oru east Local government Area of Imo State.\nThe attack comes less than 24 hours after an attack on the country home of Professor George Obiozor and the Divisional Police Headquarters in Umuguma community.\nChannels Television gathered that the hoodlums who came in large numbers, attacked the station at about 03:00 am on Sunday with various calibres of Improvised Explosive Devices (IED) while also shooting sporadically.\nRead Also: Gunmen Attack Divisional Police Headquarters In ImoThe Imo State Public Relations Officer, Mike Abattam who confirmed this to Channels Television, however, noted that the Command’s tactical teams and operatives of the DSS on duty swiftly repelled the attack.\nFive undetonated Improvised Explosives Devices and charms were also recovered during the operation."
  },
  {
    "headline": "Senator Ali Modu Sheriff Pulls Out Of APC National Chairmanship Race",
    "summarized_story": "Former Governor of Borno State, Senator Ali Modu Sheriff has pulled out of the All Progress Congress (APC) national chairmanship race, saying he doesn’t want to oppose the zoning formula of the party as they have agreed to zone the position to the north-central.\nBriefing journalists on Sunday in Abuja, Senator Sheriff said he has respect for the leader of the party President Muhammadu Buhari and so he will not continue in the race.\n“I respect the president as my leader, and he must have a reason why the national chairman is zoned to the North-central.\nAccording to the statement, the position of the Deputy National Chairman has been allocated to the South-East zone.\nThe ruling party said the zoning arrangement was adopted at the March 8, 2022, regular meeting of the Caretaker/Extraordinary Convention Planning Committee (CECPC)."
  },
  {
    "headline": "Aubameyang Scores Brace As Barcelona Humiliate Real Madrid",
    "summarized_story": "Barcelona stunned Real Madrid with a 4-0 victory on Sunday as Pierre-Emerick Aubameyang scored twice in a Clasico demolition at the Santiago Bernabeu.\nREAD ALSO: Messi Absent As Monaco Thrash PSGThe match was billed as a test of Barca’s progress under Xavi Hernandez and they passed with flying colours, a humiliation of their fiercest rivals suggesting they are primed to challenge again for La Liga next season."
  },
  {
    "headline": "Fmr Borno Gov Alimodu Sheriff withdraws from APC Chairmanship race",
    "summarized_story": "Former Governor of Borno state Alimodu Sheriff, and one of the APC’s national chairmanship aspirant has declared that he will no longer contest for the position based on the zoning arrangement of the party to the North-central.\nIn an interview with journalists in Abuja, today, Sunday, Alimodu Sheriff stated that if the party decides to hold the election between Sunday and Friday, he will contest.\nHe stated that his decision to withdraw from the contest was based on his respect for the rule of law and the decision of his party.\nThe former Governor, who hails from the Northeast zone, had indicated interest in the party’s apex seat Before the zoning decision issued around two weeks ago by the Mai Mala Buni-led Caretaker/Extraordinary Convention Planning Committee."
  },
  {
    "headline": "Gov.Tambuwal visits PDP stakeholders in Kaduna -",
    "summarized_story": "Sokoto State Governor and Presidential aspirant on the platform of the Peoples Democratic Party (PDP) Aminu Waziri Tambuwal on Saturday visited PDP stakeholders in Kaduna over his desire to become president in 2023.\nHe noted that his ambition is aimed at rescuing Nigeria from imminent collapse.\nHe faulted the All Progressive Congress (APC) for mismanaging the socioeconomic affairs of the nation and likened the relationship between President Muhammad Buhari and the Nations as that of a failed marriage.\nThe Sokoto Governor added that having worked in the Judiciary, legislative and Executive arms of Government, he possesses the necessary qualities to provide good governance if elected.\nGovernor Tambuwal called on his Party the PDP to be strategic and deliberate in coming up with a formula for winning elections in 2023."
  },
  {
    "headline": "2023: Youths storm Bauchi streets, say 'no going back on Yahaya Bello' -",
    "summarized_story": "Vehicular movement was temporarily held up for several hours in Bauchi on Saturday when thousands of youths stormed the major streets, rallying support for the presidential aspiration of Governor Yahaya Bello of Kogi State.\nGovernor Yahaya Bello stands out.\n“All the lies they have peddled against him in the past have turned to strength for him and for us Nigerian youths.\n“You have been consistent in your call for His Excellency, Alhaji Yahaya Bello to contest for President come 2023.\nHe has demonstrated in Kogi that it is Youths O Clock, and it is paying off with all the giant strides."
  },
  {
    "headline": "We will implement Court Ruling on Electoral Act",
    "summarized_story": "The office of the Attorney General of the Federation and Minister of Justice will accordingly give effect to the Court judgment in line with the dictates of the law and the spirit of the judgment.\nThe judgment of the Court will be recognized by the Government printers in printing the Electoral Act.\nThe Act will be gazetted factoring the effect of the judgment into consideration and deleting the constitutionally offensive provision accordingly.\nThe provision of Section 84(12) of the Electoral Act 2022 is not part of our law and will be so treated accordingly.\nThis is in line with the dictates of chapter 7, Part 4, Section 287 of the 1999 Constitution of the Federal Republic of Nigeria (as amended) on enforcement of decisions that makes it a point of duty and obligation on all authorities and persons to have the judgment of the federal High Court, among others, to be enforced."
  },
  {
    "headline": "Wale Fapohunda: Emefiele Is Capable To Rule The Country",
    "summarized_story": "Wale Fapohunda, Convener of The Green Alliance Movement discusses the leadership challenge and the struggle to find the next president by 2023.\nThis comes as more groups mount pressure on the Central Bank governor, Godwin Emefiele to join the presidential race in 2023."
  },
  {
    "headline": "NDLEA Arrests Nigerian Businessman from Brazil with 20.75kg of Black Cocaine – Arise News",
    "summarized_story": "A 52-year old father of four children, Okeke Anayochukwu, has been arrested with black liquid cocaine at the Nnamdi Azikiwe International Airport, Abuja by operatives of the National Drug Law Enforcement Agency, NDLEA.\nAnayochukwu who claimed to be a businessman was arrested with the strange substance last Tuesday upon arrival at the Abuja airport onboard Qatar Airways flight from Sao Paulo, Brazil through Doha, Qatar to Abuja.\n“Okeke was arrested with 20.75 kilograms of the black liquid cocaine on Tuesday 15th March upon his arrival at the Abuja airport onboard Qatar Airways flight from Sao Paulo, Brazil through Doha, Qatar to Abuja.\nThe previous day, last Wednesday, narcotic officers in Ogun state recovered 865.2 kilogrammes of cannabis sativa around Otapele- Obada road in Imeko-Afon local government area.\nSame day, operatives in the state arrested Bello Ibrahim, 38, with 312.4 kilogrammes of cannabis sativa at Ogere tollgate, Ikenne local government area."
  },
  {
    "headline": "North Korea Fires Multiple-Rocket Launcher, South Korea Says",
    "summarized_story": "North Korea appeared to have fired a short-range multiple rocket launcher on Sunday, South Korea’s military said, amid heightened military tensions on the peninsula after a spate of larger missile launches by the nuclear-armed North.\nSouth Korea’s National Security Council held an emergency vice-ministerial meeting over the launches.\nLast year South Korea approved plans to pursue a $2.6-billion artillery interception system, similar to Israel’s “Iron Dome”, designed to protect against North Korea’s arsenal of long-range guns and rockets.\nSouth Korea and the United States warn that the North could resume test-firing its largest ICBMs for the first time since 2017 amid stalled denuclearisation talks.\nNorth Korea also appears to be preparing to launch a spy satellite, and new construction has been spotted at its shuttered nuclear test site."
  },
  {
    "headline": "Ukraine Says Russia Bombs Another Shelter in Besieged Mariupol",
    "summarized_story": "The infants — some just days old — are being cared for by nurses who cannot leave the shelter because of constant shelling by Russian troops who are trying to encircle the city.\nThe Russian military said Saturday that it used a Kinzhal for the first time in combat to destroy an ammunition depot in the Carpathian Mountains in western Ukraine.\nUkraine and Russia have held several rounds of negotiations aimed at ending the conflict, but the neighboring countries remain divided over several issues.\nThe Mariupol city council claimed Saturday that Russian soldiers had forcibly relocated several thousand city residents, mostly women and children, to Russia.\nIn Ukraine, Zelenskyy on Sunday ordered the activities of 11 political parties with links to Russia to be suspended during the period of martial law."
  },
  {
    "headline": "Senior Nigerian Lawyers Falana, Adegboruwa Fault Court on Deletion of Section 84 (12) from Electoral Act",
    "summarized_story": "Two Senior Advocates of Nigeria (SANs), Mr. Femi Falana and Mr. Ebun-Olu Adegboruwa, have faulted the decision of a Federal High Court sitting in Umuahia, the Abia State capital, ordering the deletion of Section 84 (12) of the amended Electoral Act.\nIn separate statements issued Saturday, the senior lawyers raised pertinent questions about the judgment, noting that the decision of the court was a great error.\nAnyadike had, consequently, ordered the Attorney General of the Federation, Mr. Abubakar Malami to immediately delete Section 84 (12) of the amended Electoral Act.\nTo that extent, Section 84 (12) of the Electoral Act was annulled on a very faulty ground.\nSupporting Falana’s position, Adegboruwa argued that the Electoral Act “is an Act of the National Assembly."
  }
]