[
  {
    "headline": "Minister declares war against operators of brothels in FCT",
    "summarized_story": "The FCT Minister of State, Dr Ramatu Aliyu, has declared war against the operators of brothels and commercial sex workers in the territory as part of efforts to safeguard the health of residents.\nHe said that the FCT minister of state had directed the social development secretariat to sanitise the FCT of all human nuisances and social vices such as commercial street workers and brothels.\n“The minister has declared war against operators of brothels in FCT and gave us matching order to ensure to rid the city of such illegal activities and business.\n“This is a clear demonstration of the commitment of the minister of state to ensure that the rule of law propels in the FCT,” Amar said.\nThe director, therefore, appealed to the public, especially those that were into the operation of brothels and commercial sex work to have a change of mind and business."
  },
  {
    "headline": "AfDB to create 25 million new jobs by 2025, says Adesina",
    "summarized_story": "Dr Akinwunmi Adesina, the President of African Development Bank, says the bank is targeting to create 25 million new jobs by 2025.\n“To support Nigeria, the AfDB is preparing investments in the country’s Digital and Creative Enterprises (i-DICE), a 500 million dollars investment programme to be co-financed with several partners.\nIt will help create sustainable jobs and make Nigeria a global powerhouse in these industries.\n“Andela, a global technology start-up based in Yabacon Valley, recently attracted 24 million dollars in funding from Facebook founder Mark Zuckerberg.\nWhile pointing out the need for every Nigerian to have reliable and affordable internet access, Adesina said that access would expand digital financial inclusion."
  },
  {
    "headline": "Attack on Prisons: FG orders killing of invaders, conducts vulnerability assessment",
    "summarized_story": "Minister of Interior, Ogbeni Rauf Aregbesola reiterated the directive on Thursday while inaugurating a vulnerability audit of the Nigerian Correctional Service NCoS custodial centres across the country.\nHe also declared custodial facilities as “red zones” that must remain inviolable.\nThey overrun the place, blow up huge holes on the perimeter fence and overpower our security system.\nWe are determined to eliminate the threat from these attackers and ensure that our facilities are no longer vulnerable”.\nAlready, the Service has sent the first batch of 150 armed personnel for training at a military formation in Kontagora."
  },
  {
    "headline": "Jonathan leaves for Kenya to attend AU high-level retreat on mediation",
    "summarized_story": "Former President Dr Goodluck Ebele Jonathan will depart Abuja on Saturday for Nairobi, the Kenyan capital, to attend the 12th African Union (AU) High-Level Retreat on the promotion of peace, security and stability in Africa.\nAU’s Commissioner for Political Affairs, Peace and Security Ambassador Bankole Adeoye, who signed the invitation letter, stated that the retreat which theme is ‘Improved Coordination and Harmonization for Impactful Mediation’ would bring together Chairperson of the Commission, senior Kenyan government officials, as well as representatives of AU member states, regional organisations, international agencies and AU organs.\nHe said: “It will also provide participants an opportunity to reflect, take stock and review ongoing mediation efforts in the evolving conflict context on the continent, towards better coherence for more sustained Impact.\nOver the years the Retreat has strategically engaged with timely, contextual and challenging issues, with a particular emphasis of strengthening mediation capacity and collaboration on the continent.\nMost recently, in 2020 under the theme, ‘The future of mediation in Africa: Towards silencing the Guns-Lessons and Opportunities from the Covid-19 Pandemic”, the High- Level Retreat focused on the impact of the Covid-19 pandemic on the African continent and the implications for peacemaking and peacebuilding.”"
  },
  {
    "headline": "Onwordi bags philanthropist of the year award",
    "summarized_story": "Mr. James Endurance OnwordiDelta-born Businesses man, philanthropist, Mr. James Endurance Onwordi also known as Ibori Ubulu has bagged award of Excellence in Leadership and Philanthropist of the year.\nOnwordi accompanied by wife bagged the award at the 2021 Governance Ambassador Award which took place at the Sheraton Hotel Abuja.\nREAD ALSOPDP Convention: Fintiri predicts collapse of APCThe organizer of the award Mr Temisan Louis noted that James Onwordi leadership qualities and his achievements in Humanitarian services earned him the award.\nThey both Congratulated Onwordi noting that the award is a meritorious award looking at his achievements in the past years.\nOnwordi was accompanied by wife Mrs Onwordi, Mr Akpedi , Mrs Oluchukwu Ruth Ossai and Mr Christian Onwugbolu."
  },
  {
    "headline": "UK-based professionals hold wealth global summit in Nigeria",
    "summarized_story": "Eryca FreemantleBy Bose AdelajaA United Kingdom – based company, Embracing All Time of Women (E.A.T.O.W), yesterday kicked off a wealth global creation summit in Nigeria in order to create a positive representation of Africans across the diaspora.\nThe Summit, which held at EbonyLife Place on Victoria Island, Lagos State, is an avenue for successful business leaders from the United Kingdom, United States of Africa and Nigeria to share their knowledge and experience with an audience of Nigerian entrepreneurs, with a view to networking.\nREAD ALSO:Reps quiz NHIS over unutilised 2020 budgetary allocationAddressing journalists in Lagos, a global beauty strategist/motivational speaker Eryca Freemantle, who is the Chief Host said the maiden event in Nigeria targets beauty, business, media and wealth creation to change the narratives about women of African descent in business.\nAccording to her, a delegation of 25 prominent business leaders and professionals, within Tourism, Arts & Culture, Beauty, Media, Entertainment & Lifestyle, Finance, and other creative industries, from the UK and USA, will meet with their Nigerian counterparts in Lagos.\nAlso speaking, the Publicity Secretary and a one-time broadcaster with Nigeria Television Authority NTA, Princess Moradeun Adedoyin-Solarin, said though the project is new in Nigeria but participants will benefit largely from it through networking and exchange of ideas that can transform every facet of life."
  },
  {
    "headline": "HAPPENING NOW: Celebration of life service for R. W. Bro Adediji Adedoyin",
    "summarized_story": "Late Omo Oba Adediji Adedoyin was born on 21st December, 1932 to late Oba William Adedoyin the late Akarigbo of Remoland from the Anoko Ruling House and to Late Olori Folorunso Adedoyin nee Sode from the Liyangu Ruling House of Sagamu in Ogun State.\nhttps://fb.watch/8Xx0lnb-sP/"
  },
  {
    "headline": "Protest as three students die in Kogi varsity within 72 hours",
    "summarized_story": "Students of Federal University, Lokoja, Kogi State, on Friday protested the death of three of their schoolmates in 72 hours.\nDAILY POST learnt that one of the students from the Department of Geography was knocked down by a runaway car at the Felele campus while two others fell ill and lost their lives.\nWith the latest ugly incident, students began the protest in the early hours of Friday as they barricaded every entrance into the campus, thereby denying vehicular movement in and out of the institution.\nOur felele campus is a death trap.\nWe are FUL to learn and because something useful tomorrow, and not to come and die,” he said."
  },
  {
    "headline": "Fasuyi advocates press freedom to ensure democracy thrives in Nigeria",
    "summarized_story": "This was said by Chief Yinka Fasuyi during the 2021 Nigerian Union of Journalists (NUJ), Osun State Council Press Week and Award Dinner in Osogbo on Thursday.\nThe Chairman noted that many also have been pressurised to mislead the public while divulging information under death threats.\n“My admonition is that Nigerian Union of Journalists (NUJ) has the prerogative to protect the interests and lives of journalists through the legal framework available in the country”.\nLaws of Osun State.\nHe was however discharged and acquitted after the Osun State Police Commissioner, Olawale Olokode discontinued the case."
  },
  {
    "headline": "Peaceful coexistence will make Nigeria overcome developmental challenges – Bauchi gov",
    "summarized_story": "Bauchi State governor, Senator Bala Abdulkadir Mohammed, has asserted that only harmonious living and peaceful coexistence among Muslim and Christian faithful can help Nigeria to overcome its present problems militating against its development.\nThe governor made the assertion in Bauchi on Thursday at the funeral service of the late chairman of the state chapter of the Pentecostal Fellowship of Nigeria (PFN), Reverend Emmanuel Ogbeba.\n“We in Bauchi State have enjoyed relative peace because the people decided to live together, share things in common because we are brothers and sisters who must tolerate one another.\nHe then called on Nigerians, particularly people of the state not only to imbibe but also promote those things the late Ogbeba stood for.\nDAILY POST reports that the highlight of the service was the formal introduction of the Ogbeba Foundation by the family of the deceased."
  },
  {
    "headline": "New Plateau Speaker promises to work with state govt",
    "summarized_story": "The new Speaker, Plateau State House of Assembly, Yakubu Sanda has assured that the new leadership of the House will work in synergy with the executive and judiciary for the peace, progress, and development of the state.\nHe explained that the new Speaker emerged after 16 of the 23 members of the House signed the petition to impeach the former speaker, Nuhu Ayuba Abok over a series of allegations.\nThe Speaker was accompanied on the visit by Deputy Speaker Rt.\nSanda represents Pengana Constituency of Bassa Local Government Area while the former Speaker Rt.\nNuhu Ayuba Abok represents Jos East Constituency."
  },
  {
    "headline": "Katsina: NDLEA gets court approval to destroy 22 tons of hard drugs",
    "summarized_story": "The Federal High Court in Katsina State has granted approval for the destruction of 22 tons of hard drugs seized in the last two years by officers of the Nigeria Drug Law Enforcement Agency, NDLEA, in Katsina State.\nAccording to the NDLEA acting Commandant in the state, Dr. Nnana Nworisa, the seized drugs comprised of hard drugs and psychotropic substances that can affect peoples behaviour, thoughts, mood and perceptions, among others.\nAbdulmumini Kabir Usman, and his entourage at the NDLEA command in the state.\nNworisa said: “The Federal High Court in the state has given us the go-ahead to destroy 22 tons of hard drugs seized from suspected drug peddlers after they have been tried and sentenced by the law court.\nNDLEA warns Katsina students to shun drug abuse"
  },
  {
    "headline": "Minister declares war against operators of brothels in FCT",
    "summarized_story": "The FCT Minister of State, Dr Ramatu Aliyu, has declared war against the operators of brothels and commercial sex workers in the territory as part of efforts to safeguard the health of residents.\n- Advertisement -He said that the FCT minister of state had directed the social development secretariat to sanitise the FCT of all human nuisances and social vices such as commercial street workers and brothels.\n- Advertisement -“The minister has declared war against operators of brothels in FCT and gave us matching order to ensure to rid the city of such illegal activities and business.\n“This is a clear demonstration of the commitment of the minister of state to ensure that the rule of law propel in the FCT,” Amar said.\nThe director, therefore, appealed to the public, especially those that were into the operation of brothels, commercial sex work to have a change of mind and business."
  },
  {
    "headline": "Southeast CSOs urge INEC to shift Anambra gov poll",
    "summarized_story": "Major civil society organisations in the Southeast region on Friday called on the Independent National Electoral Commission (INEC) to shift the November 6, 2021 governorship election in Anambra State.\n- Advertisement -INEC had assured of its “readiness and preparedness” to go ahead with the Anambra Governorship Election on 6th Nov 2021.\nThat is to say therefore that the commission’s assurances are dead on arrival and repugnant to conditions for free and fair elections, particularly the referenced Anambra governorship election.\nThe statement maintained that INEC had no other credible option than to shift the Anambra governorship election for one month.\nIt said, “In the case of Anambra governorship poll, therefore, the tenure of office of the outgoing governor of the state elapses on 17th March 2022."
  },
  {
    "headline": "I break hearts for a living – Olamide",
    "summarized_story": "Rapper Olamide Baddo has referred to himself as a ‘heartbreaking’ entity.\nThe fan, responding to the “Science Student” singer’s quote said he was most certainly speaking from a place of heartbreak.\n“Na breakfast quote be this, them dem serve baba hot breakfast”, he wrote.\nClarifying the fan’s perception, Olamide declared himself a heart smasher noting he earns a living from smashing hearts.\nI break hearts for a living”."
  },
  {
    "headline": "Ogun seeks N13b to fix Ota roads",
    "summarized_story": "Ogun State Governor Dapo Abiodun has said his administration will shop for N13billion to fix roads at Ota in Ado-Odo/Ota Local Government.\nHe said plans had reached advanced stage to build three housing estates in Ijebu Ode, Ota and Ilaro.\nAbiodun said this in his address at the virtual citizens’ engagement (town hall meeting) on 2022-2024 Medium Term Expenditure Framework (MTEF) and 2022 Budget for Ogun West Senatorial District, held yesterday in Abeokuta.\n- Advertisement -The governor said that the development of Ogun West Senatorial District would continue to be of importance to his administration.\n“We are assiduously working on the Ilaro-Owode–Idiroko road, which is a federal road, like we do on Epe-Ijebu-Ode road in Ogun East Senatorial District and Sagamu-Abeokuta road in the Central Senatorial District."
  },
  {
    "headline": "2023: Christian/Christian, Muslim/Muslim ticket not acceptable to us, CAN warns",
    "summarized_story": "From Fred Ezeh, AbujaAs the political process leading to the 2023 general elections gather momentum, the Christian Association of Nigeria (CAN) has advised political parties against choosing their presidential and governorship candidates from the same religion, either on Christian/Christian or Muslim/Muslim ticket.\nIt cautioned the leading political parties against heating up the polity with such arrangement saying it could trigger unnecessary suspicion, acrimony and denial by voters.\nThey should rather guide their utterances and actions because there is already tension in the land because of insecurity.\nWe neither want Christian/Christian ticket nor Muslim/Muslim ticket.”USA companies need customer service reps to work from home, hourly pay in $13 per hour, must have a quiet environment to work, internet access.Click here to apply .\nHe said the APC would not field candidates from the same religion on its presidential ticket."
  },
  {
    "headline": "FBN Holdings appoints Nnamdi Okonkwo GMD",
    "summarized_story": "The board of FBN Holdings Plc, has approved the appointment of Mr. Nnamdi Okonkwo, as its new Group Managing Director, with effect from Jan. 1, 2022.\nThe appointment is contained in a statement signed by FBNH, Company Secretary, Mr Seye Kosoko, and posted on the Nigerian Exchange Ltd (NGX) website.\nOkonkwo was the immediate past Managing Director of Fidelity Bank Plc.\nThe statement said the appointment followed notice of the retirement of the Group Managing Director, Mr U.K.\n“The board approved the appointment Okonkwo as the new Group Managing Director of FBN Holdings Plc, with effect from January 1, 2022, subject to the approval of the Central Bank of Nigeria (CBN) and the shareholders at the next Annual General Meeting of the company,” it said."
  },
  {
    "headline": "Soldiers kill 109 terrorists, bandits in 2 weeks as1,199 surrender",
    "summarized_story": "From Molly Kilete, AbujaThe Defence headquarters yesterday said soldiers on counter insurgency and other internal security operations across the country killed 109 terrorists, bandits and other criminals in the last two weeks.\nThe DHQ, also said another batch of 1,199, terrorists and their family members comprising 114 males, 312 females and 773 children surrendered to troops at different locations in the North East.\nOnyeuko said over 40 terrorists, bandits and their informants were also arrested and undergoing interrogation.\nGiving a breakdown of the operations, Onyeuko said: “Troops of Operation HADIN KAI have sustained the aggressive posture with zest in the North East.\nAlso, a total of 11 criminal elements including terrorists and their informants and their logistics suppliers were arrested in the course of these operations."
  },
  {
    "headline": "P&ID scam: Court issues arrest warrant against Irishman",
    "summarized_story": "A Federal High Court (FHC), Abuja, yesterday, issued a warrant for the arrest of an Irishman, Neil Murray, over his involvement in the alleged Process and Industrial Development Limited (P&ID) scandal.\nMurray, an employee of P&ID, is also a director of Lurgi Consult Ltd., an associate company of P&ID.\nSanga, therefore, prayed the court for an order of warrant for the arrest of Murray, for him to be brought before the court and face trial on the aforementioned criminal charge.\nThe EFCC lawyer also prayed the court to issue an arrest warrant against Nolan, following his absence in court.\nJustice Mohammed, who granted the prayer for issuance of arrest warrant on Murray, adjourned the matter until January 25, 2022, for trial continuation."
  },
  {
    "headline": "We’ll submit new revenue formula to FG by December 2021 –RMAFC",
    "summarized_story": "From Abdulrazaq Mungadi, GombeRevenue Mobilisation Allocation and Fiscal Commission (RMAFC) has said the revised revenue allocation formula would be ready for submission to the Federal Government by end of 2021.\nRMAFC Chairman, Elias Mbam, made this known during a public hearing on the review of the vertical revenue allocation formula for the North East zone in Gombe.\nThe current review of the revenue allocation formula, which is one of the major responsibilities of the commission, is coming 28 years after the last one was done in 1992.\nMbam said the commission was committed to ensuring the new revenue allocation formula captured the yearnings and developmental aspirations of Nigerians.\nHowever,the six North East states have shared a divergent view over the review of the new revenue allocation and sharing formula in the country."
  },
  {
    "headline": "Buhari: Destabilising Forces Weaponising Frustration of Marginalised Groups",
    "summarized_story": "Buhari stated this yesterday in Abuja at the fifth Conference of the Network of African Parliamentarians for Defence and Security Committees of the House of Representatives.\nHe noted that mobilising the full spectrum of national assets also meant engaging the broad expanse of society.\nAccording to the president, “We recognise that having large segments of our population feeling alienated and marginalised is a critical vulnerability.\nThe challenge then is for us to develop measures through policy and legislation that create an umbrella of human security over our people and thereby prevent the forces of destabilisation from weaponising the frustrations of the marginalised.\n“However, we recognise that the threats we face in this borderless age are often both local and transnational."
  },
  {
    "headline": "Okonkwo Appointed FBN Holdings’ GMD, Eke Bows Out",
    "summarized_story": "yesterday announced the appointment of the immediate past Managing Director of Fidelity Bank Plc., Mr. Nnamdi Okonkwo, as Group Managing Director (GMD) of the holding company.\n“He has spent almost 11 years in the FBN Holdings Group, serving meritoriously in the last six years as Group Managing Director.\nThe statement said, “The FBN Holdings Board has also announced that Eke will be succeeded by Mr. Nnamdi Okonkwo, a focused and result-oriented top banker, who will assume office as Group Managing Director, FBN Holdings Plc effective January 1, 2022.\n“Okonkwo, the immediate past Chief Executive Officer of Fidelity Bank Plc, brings to bear on the Board of FBN Holdings more than 30 years unbroken banking career spanning local and international experience.\nHe had served in various leadership positions across other financial institutions, including Broad Bank of Nigeria Limited; Citizens International Bank, Nigeria; FSB International Bank Plc., Nigeria; Guaranty Trust Bank Plc., Nigeria; and Merchant Bank of Africa, Nigeria."
  },
  {
    "headline": "Google Restores eNaira Wallet to Play Store",
    "summarized_story": "The American multinational technology company, Google, has restored the eNaira app (Speed Wallet) of the Central Bank of Nigeria (CBN) to its play store following a review of the app due to the huge traffic of visitors.\nContrary to claims that the speed wallet app for individuals was removed from the Google play store on Wednesday, findings revealed that the temporary removal of the app was due to the volume of visitor traffic, which insiders said necessitated a review of the app.\nIt would be recalled that within 24 hours of its launch, the eNaira speed wallet app attracted a deluge of enthusiastic ios and android users keen on adopting the eNaira for their transactions.\n“The eNaira – like the physical naira – is a legal tender in Nigeria and a liability of the CBN.\nThe eNaira and naira will have the same value and will always be exchanged at one naira to one eNaira.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Performs Lesser Hajj, Prays for Success in Nation’s Fight against Insurgency",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari yesterday performed the Umrah ritual (lesser hajj) in Makkah, Saudi Arabia and prayed for Nigeria to overcome the myriad of security challenges facing it.\nUpon arrival at the Grand Mosque, they were received by a number of officials and Special Forces of the security of the Grand Mosque.\nThe President arrived in Riyadh on Monday for the Future Investment Initiative Summit on the invitation of King Salman bin Abdulaziz Al Saud.\nHis official delegation included the Ministers of Trade, Industry and Investment, Communications and Digital Economy and Ministers of State, Foreign Affairs and Petroleum.\nThey also agreed to boost trade, investment and economic cooperation."
  },
  {
    "headline": "Facebook Rebrands, Changes Name to Meta",
    "summarized_story": "The Mark Zuckerberg company will now be known as Meta, a nod to its future digital frontier Metaverse, a fusion of different digital worlds.\nLast year, Facebook rolled out two of its metaverse projects in beta: Horizon World, which allows users to invite friends into their digital world, and Horizon Workrooms, which does the same in professional settings.\nDuring a presentation from his home, the Facebook founder shared his vision which includes a digital world in which users will feel they are with one another even though they may be apart.\nWith the rebranding, Meta comes with a new logo designed like an infinity-shaped symbol.\nOther platforms of the company such as Instagram and WhatsApp will retain their names but will now come under the Meta brand."
  },
  {
    "headline": "How Impeached Plateau Speaker, Nuhu Claimed N300Million For Bulletproof Car Less Than N100Million — Petition",
    "summarized_story": "Ayuba was also accused of using fictitious companies as fronts for the supply of 50 trucks of fertiliser and fleecing of N375 million public funds.\nSee Also Breaking News BREAKING: Plateau Speaker, Nuhu Impeached Amid Corruption Allegations“Compromise of operational procedures, creation of an extra-legal hierarchy and privileging cronies at the expense of the system.\nThis is by far the greatest calamity to befall the Lagos House of Assembly to Plateau State House of Assembly under Abok’s watch.\nThe petition said it would amount to a breach of public trust if the allegations against the impeached Speaker were not investigated.\nNuhu was impeached on Thursday during plenary after 16 out of 24 members of the Assembly voted him out."
  },
  {
    "headline": "How Impeached Plateau Speaker, Nuhu Claimed N300Million For Bulletproof Car Less Than N100Million — Petition",
    "summarized_story": "Ayuba was also accused of using fictitious companies as fronts for the supply of 50 trucks of fertiliser and fleecing of N375 million public funds.\nSee Also Breaking News BREAKING: Plateau Speaker, Nuhu Impeached Amid Corruption Allegations“Compromise of operational procedures, creation of an extra-legal hierarchy and privileging cronies at the expense of the system.\nThis is by far the greatest calamity to befall the Lagos House of Assembly to Plateau State House of Assembly under Abok’s watch.\nThe petition said it would amount to a breach of public trust if the allegations against the impeached Speaker were not investigated.\nNuhu was impeached on Thursday during plenary after 16 out of 24 members of the Assembly voted him out."
  },
  {
    "headline": "How Impeached Plateau Speaker, Nuhu Claimed N300Million For Bulletproof Car Less Than N100Million — Petition",
    "summarized_story": "Ayuba was also accused of using fictitious companies as fronts for the supply of 50 trucks of fertiliser and fleecing of N375 million public funds.\nSee Also Breaking News BREAKING: Plateau Speaker, Nuhu Impeached Amid Corruption Allegations“Compromise of operational procedures, creation of an extra-legal hierarchy and privileging cronies at the expense of the system.\nThis is by far the greatest calamity to befall the Lagos House of Assembly to Plateau State House of Assembly under Abok’s watch.\nThe petition said it would amount to a breach of public trust if the allegations against the impeached Speaker were not investigated.\nNuhu was impeached on Thursday during plenary after 16 out of 24 members of the Assembly voted him out."
  },
  {
    "headline": "BREAKING: Plateau Speaker, Nuhu Impeached Amid Corruption Allegations",
    "summarized_story": "The Speaker of the Plateau State House Assembly, Hon Abok Ayuba Nuhu, has been impeached.\nHis impeachment occurred at the plenary on Thursday after 16 out of 24 members of the Assembly voted him out, Daily Trust reports.\nHe was replaced with Sanda Yakubu, who hails from Pingana constituency of Bassa Local Government Area of the state.\nThe cause of Nuhu's removal could not be ascertained at the time of filing this report.\nA group known as the Youths Rights Against Corruption (YRAC) had petitioned the Economic and Financial Crimes Commission (EFCC), accusing Nuhu of financial misappropriation."
  },
  {
    "headline": "BREAKING: Plateau Speaker, Nuhu Impeached Amid Corruption Allegations",
    "summarized_story": "The Speaker of the Plateau State House Assembly, Hon Abok Ayuba Nuhu, has been impeached.\nHis impeachment occurred at the plenary on Thursday after 16 out of 24 members of the Assembly voted him out, Daily Trust reports.\nHe was replaced with Sanda Yakubu, who hails from Pingana constituency of Bassa Local Government Area of the state.\nThe cause of Nuhu's removal could not be ascertained at the time of filing this report.\nA group known as the Youths Rights Against Corruption (YRAC) had petitioned the Economic and Financial Crimes Commission (EFCC), accusing Nuhu of financial misappropriation."
  },
  {
    "headline": "Dele Momodu joins PDP, apologises for helping Buhari become president",
    "summarized_story": "Dele Momodu, former presidential candidate, has joined the Peoples Democratic Party (PDP).\nAdvertisementMomodu, the publisher of Ovation magazine, announced the development in a statement on Friday.\n“I have been very frustrated about the state of our country and the manner the ruling party APC has virtually returned and reduced Nigeria to the rubbles of the stone age.\nAdvertisement“I have decided to stop my perpetual lamentations and join hands with other patriotic Nigerians to rescue our nation from the brink of a calamitous collapse.\nAnd it is clear to me that given the dangerous and disastrous drift that our nation has experienced in the past six years, the only party from which amends can be made to rectify our situation is the Peoples Democratic Party (PDP).”"
  },
  {
    "headline": "Dele Momodu joins PDP, apologises for helping Buhari become president",
    "summarized_story": "Dele Momodu, former presidential candidate, has joined the Peoples Democratic Party (PDP).\nAdvertisementMomodu, the publisher of Ovation magazine, announced the development in a statement on Friday.\n“I have been very frustrated about the state of our country and the manner the ruling party APC has virtually returned and reduced Nigeria to the rubbles of the stone age.\nAdvertisement“I have decided to stop my perpetual lamentations and join hands with other patriotic Nigerians to rescue our nation from the brink of a calamitous collapse.\nAnd it is clear to me that given the dangerous and disastrous drift that our nation has experienced in the past six years, the only party from which amends can be made to rectify our situation is the Peoples Democratic Party (PDP).”"
  },
  {
    "headline": "Kwankwaso: Ganduje's government taking loans for unnecessary projects",
    "summarized_story": "AdvertisementHe said disagreements on governance strained his relationship with Ganduje immediately after he was elected as Kano governor.\nKwankwaso said the current Kano state government usually borrows to execute “unnecessary projects”.\nFor the two times, 2003 and 2015, that I left government there was no one single debt for Kano state — zero.\n“I can tell you earlier this year, our investigation shows that Kano state is indebted to about N185 billion and that is not acceptable in our own arrangement.\nSome of the projects that have been claimed that are being done were projects in our opinion that were not necessary."
  },
  {
    "headline": "Kwankwaso: Ganduje's government taking loans for unnecessary projects",
    "summarized_story": "AdvertisementHe said disagreements on governance strained his relationship with Ganduje immediately after he was elected as Kano governor.\nKwankwaso said the current Kano state government usually borrows to execute “unnecessary projects”.\nFor the two times, 2003 and 2015, that I left government there was no one single debt for Kano state — zero.\n“I can tell you earlier this year, our investigation shows that Kano state is indebted to about N185 billion and that is not acceptable in our own arrangement.\nSome of the projects that have been claimed that are being done were projects in our opinion that were not necessary."
  },
  {
    "headline": "CBN: We expect minor challenges -- but eNaira is secure, dependable",
    "summarized_story": "The Central Bank of Nigeria (CBN) has assured Nigerians that its newly launched digital currency, eNaira, is secure and dependable despite challenges.\nAdvertisementOsita Nwanisobi, spokesperson of the apex bank, gave the assurance on Thursday while speaking at the ongoing CBN-Fair in Abakaliki, Ebonyi state capital.\nYesterday, the eNaira speed wallet app was restored 24hours after it was removed from the Google Play store for technical glitches.\nNwanisobi had told TheCable that the removal was to help the apex bank upgrade the app’s functionalities.\n“The issue of security and dependability of the e-Naira platform is guaranteed."
  },
  {
    "headline": "Facebook changes company name to Meta, reflecting its ambitions beyond social media",
    "summarized_story": "Facebook on Thursday, October 28 announced that it has changed its company name to Meta.\nThis change of name was announced by Facebook CEO Mark Zuckerberg at Facebook’s annual Connect augmented and virtual reality conference.\nThe company said it chose the name “Meta” to serve as a reminder that there is always more to build.\nFacebook said its corporate structure is not changing, however, how the company reports its financials will.\nIn addition, Facebook assured users that the announcement does not affect how the company uses or shares data."
  },
  {
    "headline": "Beyond investing in African startups, Kepple Africa Ventures is creating new industries",
    "summarized_story": "Afterwards, he returned to Africa as a general partner at Kepple Africa Ventures.\nI knew I had to be a part of it.”Daniel Adeyemi: How did Kepple Africa Ventures start?\nThis provided Kepple with access to a network of investors to raise $18 million for Kepple Africa Ventures.\nRyosuke Yamawaki handles investing in East and Southern African startups while I focus on investing in West and North African startups.\nDA: Talking about Japanese investors, are there any other Japanese investors in Africa?"
  },
  {
    "headline": "eNaira: How to use Nigeria’s central bank digital currency",
    "summarized_story": "Nigeria became the first country in Africa to launch a central bank digital currency (CBDC) this week after President Muhammadu Buhari unveiled the eNaira at the State House in Abuja, the nation’s capital.\nIssued by the Central Bank of Nigeria (CBN), the digital currency is built on a private blockchain technology developed by Bitt Inc and has the same value as the fiat or physical currency.\nThe new currency can be accessed and used via the eNaira wallet (named “Speed”), a digital storage held and managed on a distributed ledger.\neNaira use casesFinancial institutions are responsible for onboarding their customers and integrating the eNaira wallet feature into their digital banking channels.\nThe digital currency could also bring a significant majority of Nigerians without bank accounts into the formal financial economy."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Bolt’s EV option, aYo Holdings’ new business model, Facebook’s new name, Namibia’s crime-busting plans",
    "summarized_story": "The company plans to drive greater scale, better customer experience, and faster access to markets across the African continent in the coming years.\n50 countries in Africa have introduced mandatory SIM card registration laws.\nUa-Ndjarakana said that the SIM card registration process would be done to protect consumers’ privacy.\nDo you think SIM card registration combats crime or increases surveillance in Africa?\nVictoria Fakiya for Techpoint Africa."
  },
  {
    "headline": "Early Access: Interview with ReelFruit founder, Affiong Williams",
    "summarized_story": "But then, it took her five years to build her first factory, and nine years in total to the Series A.Affiong Williams, founder and CEO, ReelFruit.\nThese and many more I sought to find out during a recent interview with Affiong Williams at the ReelFruit HQ in Lagos, Nigeria.\nIn this inspiring interview, Affiong Williams shares her motivations, inspirations, ambitions, entrepreneurial lessons, and tips on how to achieve a work-life balance while running a global company.\nWatch full interview or continue below for summarised text versionThe full interview will go live on Tuesday November 2, 2021 at noon.\nWatch it today on Early Access by joining our membership programme Join now Already a member?"
  },
  {
    "headline": "Stitch’s Nigeria expansion, Africa’s military coups, RecoMed’s $1.5m funding, and Union45’s $3m seed",
    "summarized_story": "Source: Supplied,South African API fintech startup, Stitch has today announced its expansion into Nigeria and a $2M seed extension, with investment from Future Africa and Norrsken Foundation, among others.\nStitch announced an initial $4 million seed in February when it came out of stealth.\nThe startup launched officially in February 2021 with an API that provides software companies with identity verification tools and access to users’ financial data.\nWhile fintech startups still get a significant chunk of African funding, healthtech startups seem to be attracting some serious cash.\nApply hereCall for climate-focused startups: Africa ClimAccelerator Applications open."
  },
  {
    "headline": "Scramble for First Bank shares continues",
    "summarized_story": "The shares of First Bank Holdings of Nigeria (FBHN) remained the most keenly contested shares among investors on Thursday with 162 million units traded, the most of any company for the fifth day running.\nAccording to data obtained from the Nigerian Exchange Limited (NGX), 162,608,406 units of the bank’s shares valued at N187.29 million were exchanged Thursday.\nRead also: NDIC pays N100.85bn to uninsured depositors of banksOkonkwo is regarded as a focused and result-oriented banker drawing from his days as Chief Executive Officer (CEO) of Fidelity Bank PLC.\nOkonkwo’s digital retail strategy in Fidelity Bank will be beneficial to FBN Holdings Plc, this is coupled with his import & export strategy that gave Fidelity Bank a big leverage.\nThe continuing journey of Fidelity Bank Plc to a Tier-1 position started with Okonkwo as then CEO."
  },
  {
    "headline": "Upstream Commission will attract massive investments – NURC",
    "summarized_story": "The chief executive officer, Nigerian Upstream Regulatory Commission (NURC), Gbenga Komolafe, has assured of the commitment to attract investments as well as shore up revenues from the oil and gas industry.\nThe new commission is tasked with the responsibility of regulating the technical and commercial activities of the Nigerian upstream petroleum sector.\nHe disclosed that the Commission shall unveil its new outlook containing the regulation and the blueprint of its strategic plan in the coming weeks.\n“In our drive to ensure best practices for a 21st-century regulator, we shall equally focus on digitalization of our activities at all levels.\nHuman capital capacity development will be stringently pursued to ensure high standard of professionalism at all times.”"
  },
  {
    "headline": "No FX for barite as FG to ban import",
    "summarized_story": "The Federal Government will soon place a ban on further importation of barite, a move that would save $300 million every year in foreign exchange (FX).\nThis is as 12 barite processors have been found worthy to produce world-class barite that meets American Petroleum Institute’s (API) standards.\nHe said the FG would slam the ban in 2022, but he did not mention the specific date.\nHe said Nigerian barite hub is being created for easy coordination with what he called Open Market System.\nHe said, “Soon, importation of Barite into Nigeria will stop because the processes that lead to such a policy are in progress.”"
  },
  {
    "headline": "Obaseki charges tertiary institutions on alternative sources of funding – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… As Edo First Lady, three others bag honorary fellowshipBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has urged tertiary institutions in the state to explore alternative sources of funding to ensure the viability of the higher institutions and address the issue of paucity of funds.\nObaseki gave the charge while delivering his speech at the 3rd and 4th Convocation Ceremony of the Edo State Polytechnic, held at the school’s main auditorium in Usen, Ovia North East Local Government Area of Edo State.\nThe convocation ceremony also featured the conferment of honourary fellowship awards on four Nigerians, including the Edo State First Lady, Mrs. Betsy Obaseki, for their contribution to the development of the state and the country.\nOur tertiary institutions must promote and encourage scholarship, entrepreneurship and produce skilled manpower relevant to the needs of the labour market.\nThe country needs Edo State for its development.”In his convocation speech, the rector of the polytechnic, Prof. Abiodun Falodun commended the governor for his commitment, focus and determination in repositioning the institution."
  },
  {
    "headline": "Troops deactivate 27 illegal refining sites in Niger Delta – DHQ – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestTroops of Operation Delta Safe have deactivated a total of 27 illegal refining sites across Niger Delta region, in the last two weeks.\nOnyeuko said the illegal refining sites had 57 ovens, 17 cooking pots/boilers, two cooling systems, 37 reservoirs, nine large dugout pits and 27 storage tanks, drums and sacks laden with illegally refined oil products.\nHe added that nine suspects were arrested while one dane gun, among other items were recovered in the course of the operations.\n“Also, five criminals associated with pipeline vandalism, piracy, illegal oil bunkering and armed robbery were arrested within the period.\n“Troops of Operation Delta Safe have remained steadfast in the execution of land, maritime and air operations in the South-South Zone, to forestall activities of economic saboteurs and other criminal elements,” he said."
  },
  {
    "headline": "FG spends N4.5bn to feed 228,646 Gombe pupils in 5 yrs – NSIP – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestGOMBE – The Federal Government has spent N4.5 billion to feed 228,646 pupils in Gombe State since the school feeding programme started in 2016.\nDr Umar Bandir, National Coordinator of the National Social Investment Programme (NSIP), made the declaration in Gombe on Thursday while donating 225,000 branded plates to Gombe State government for the programme.\nBandir said 1,234 schools in Gombe State had benefitted since the programme began.\nThe NSIP coordinator reiterated that while the Federal Government provided funds for the programme, state governments had the responsibility of ensuring its smooth implementation.\nResponding, Secretary to Gombe State government, Abubakar Njodi, assured that the donation would be used judiciously."
  },
  {
    "headline": "ASUU presents N100,000 to best indigent student – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBAUCHI – The Academic Staff Union of Universities (ASUU) has presented N100,000 to the best indigent student of Abubakar Tafawa Balewa University (ATBU), Bauchi on Thursday.\nThe News Agency of Nigeria (NAN) reports that the student, Miss Iqmat Popoola, is a 300-level student of Agricultural Economics.\n“The Academic Staff Union of Universities about three years ago introduced indigent scholarship where N100,000 is given to such a student and we pick one student from each of the universities that are members of ASUU.\nIn his address, ASUU Bauchi Zonal Coordinator, Prof. Lawan Abubakar, explained that the national secretariat of ASUU is sponsoring an indigent student from each of six universities that make up the Bauchi zone.\nHe further explained that ATBU, Bauchi, is sponsoring three other indigent students with the same amount, University of Jos is sponsoring five students."
  },
  {
    "headline": "MTN Nigeria’s nine-month sales hit record N1.2 trillion on booming data market",
    "summarized_story": "Data is having its moment in Nigeria on account of the country’s large, vibrant and digital-savvy youthful population and an explosion of fintech services targeting that social category.\nThe Nigerian unit of Africa’s biggest telecommunications firm, Johannesburg-based MTN Group, noted in a separate statement seen by PREMIUM TIMES that active data users expanded by 2.5 million to 33.2 million within the period.\nBut a major downside of its performance was a slump in its mobile subscriber’s figure, which fell by 7.5 million to 67.5 million.\nThe telco cited regulatory bottlenecks on new SIM activations and sales as the trigger.\nThe stock gained 0.92 per cent in Lagos on Thursday, rising to N175.60 per share following the news."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "100 Out-of-School Girls, Others Participate in U.S. Sponsored Entrepreneurship Programme",
    "summarized_story": "Girls Creativity Hub, U.S. government exchange alumni-led project, has completed a 12-month long entrepreneurship program for 100 out-of-school girls and young women.\nAged 18-25, the participants received training and mentorship in areas of creative design, entrepreneurship, and leadership skills, with the overall goal of establishing economic independence.\n“The United States believes that the economic empowerment of women is crucial to the development of every country.\nWithout women’s inclusive participation in society, any gains in economic growth, development, science, or technology are unsustainable,” Siddiqi said.\nYou were able to align your priorities for the benefit of your fellow citizens to improve economic growth and development, and we are proud of you for giving back to your communities,” he added."
  },
  {
    "headline": "Nigerian soldiers kill Biafra National Guard gunman, arrest another",
    "summarized_story": "The Nigerian Army has said troops conducting Exercise GOLDEN DAWN have neutralised one of the Biafran National Guard (BNG) gunmen who attacked their location at Amaekpu, Ohafia Local Government Area of Abia State on Thursday 28 October 2021.\nBNG is a new armed separatist group operating in Nigeria’s Southeast, with stated mission to declare an independent state of Biafra on October 30.\nAccording to the statement, the troops neutralized one gunman, while others abandoned their vehicles and retreated in disarray with gunshot wounds.\nWhile the criminals withdrew, having been overwhelmed, they were promptly intercepted at Eda by troops of Forward Operating Base Ohaozara in Ebonyi State.\nThe troops recovered additional three vehicles and apprehended one of the gunmen."
  },
  {
    "headline": "Former Ondo governor, Olusegun Mimiko rejoins PDP",
    "summarized_story": "Dr Olusegun Mimiko, former Ondo State governor, has rejoined the Peoples Democratic Party (PDP).\nHe made the decision following a visit to him by PDP governors, including Sokoto State governor, Aminu Tanbuwal; Oyo state governor, Seyi Makinde; Rivers State governor, Nyesom Wike and Abia State governor, Okezie Ikpeazu on Wednesday.\n“The stakeholders meeting was called to discuss the meeting with the PDP governors and intimate members with the outcomes of series of interactions with PDP leaders on the invitation extended to him.\nEarlier, after about an hour closed door meeting with Mimiko, governor Tambuwal said “we are here in the beautiful of Ondo Town, in Ondo state the home of our leader, and brother, Dr Olusegun Mimiko, former governor of Ondo state to re-invite him back to his family, his political family, PDP and work towards rescuing Nigeria.\nAccording to him “We have listened to them and going to have our stakeholders meeting and ultimately it’s the people, the stakeholders that will decide."
  },
  {
    "headline": "Facebook rebrands, names itself Meta to emphasize ‘metaverse’ vision NEW",
    "summarized_story": "Feeling truly present with another person is the ultimate dream of social technology.\nWhile most tech companies focus on how people interact with technology, we’ve always focused on building technology so people can interact with each other.\nIn our DNA, we build technology to bring people together.\nOver time, I hope we are seen as a metaverse company, and I want to anchor our work and our identity on what we’re building towards.\n“But all of our products, including our apps, now share a new vision: to help bring the metaverse to life."
  },
  {
    "headline": "Bandits Have Characteristics Of Terrorist Groups, Says DG PGF",
    "summarized_story": "Recent activities of bandits in the North West especially the blowing off of Abuja-Kaduna rail panel have confirmed they have characteristics of a terrorist group.\nWhile noting the ruling All Progressives Congress (APC) is doing its best to tackle the raging security challenges, he condemned a situation where some local and foreign media present the government as standing aloof in the face of current security challenges.\nHe added that the new regime of problem-solving information management should seek to strengthen national compliance to existing statutory provisions in the country.\n“Engineering the evolution of the new regime of problem-solving information management is central to the resolution of Nigeria’s security challenges”, he said.\nLukman added that in the context of such a coordinated strategy, there should be some regular consultations to review national challenges and develop common strategies."
  },
  {
    "headline": "Bandits Have Characteristics Of Terrorist Groups, Says DG PGF",
    "summarized_story": "Recent activities of bandits in the North West especially the blowing off of Abuja-Kaduna rail panel have confirmed they have characteristics of a terrorist group.\nWhile noting the ruling All Progressives Congress (APC) is doing its best to tackle the raging security challenges, he condemned a situation where some local and foreign media present the government as standing aloof in the face of current security challenges.\nHe added that the new regime of problem-solving information management should seek to strengthen national compliance to existing statutory provisions in the country.\n“Engineering the evolution of the new regime of problem-solving information management is central to the resolution of Nigeria’s security challenges”, he said.\nLukman added that in the context of such a coordinated strategy, there should be some regular consultations to review national challenges and develop common strategies."
  },
  {
    "headline": "EndSARS Protest Victim Seeks N100m Damages At ECOWAS Court",
    "summarized_story": "A human rights activist, Mr. Patrick Eholor, has dragged the Nigerian Police Force to ECOWAS court over alleged assault while addressing the media at the Lekki Tollgate in Lagos state.\nEholor made this known through his lawyer, Samuel Ihensekhien Jnr, yesterday in Abuja while expressing pain over the manhandling by the Nigerian Police Force.\nThe human rights activist who is founder and president of One Love Foundation (OLF), explained that he had been at the forefront passionately calling and pressing for better welfare for the Nigerian Police Force, even during the EndSARS protest in 2020.\nHe said he decided to approach ECOWAS court to seek justice, because of its speedy justice process and boldness on any matter before it.\nYou may note that just before the 20th October 2020, I did instruct the legal representative to sue the Nigeria Police Force, and minister of the FCT for banning EndSARS protest or any protest at all in the FCT."
  },
  {
    "headline": "EndSARS Protest Victim Seeks N100m Damages At ECOWAS Court",
    "summarized_story": "A human rights activist, Mr. Patrick Eholor, has dragged the Nigerian Police Force to ECOWAS court over alleged assault while addressing the media at the Lekki Tollgate in Lagos state.\nEholor made this known through his lawyer, Samuel Ihensekhien Jnr, yesterday in Abuja while expressing pain over the manhandling by the Nigerian Police Force.\nThe human rights activist who is founder and president of One Love Foundation (OLF), explained that he had been at the forefront passionately calling and pressing for better welfare for the Nigerian Police Force, even during the EndSARS protest in 2020.\nHe said he decided to approach ECOWAS court to seek justice, because of its speedy justice process and boldness on any matter before it.\nYou may note that just before the 20th October 2020, I did instruct the legal representative to sue the Nigeria Police Force, and minister of the FCT for banning EndSARS protest or any protest at all in the FCT."
  },
  {
    "headline": "New School, Computer Centre Abandoned In FCT",
    "summarized_story": "A fully built and furnished primary school in Zuba, a suburb of the Federal Capital Territory, has not been put to use two years after the project was completed, some Civil Society Organisations (CSOs) have said.\nAlso, in Guzunkure, a community in Kuje Area Council, a completed computer centre built six years ago with computers fully loaded is under lock and key with robbers stealing the computers.\nThis came up at a week-long event organised by the Public Private Development Centre (PPDC).\nADVERTISEMENT“A primary school in Zuba built and completed is not in use in Zuba and the Universal Basic Education Board in their budget is demanding for more classes in the same area,” he said.\nAlso, a lecturer with the College of Education Zuba, Dr Jamberlay A Ray, said a computer centre was built in Guzunkure, in Kuje area council six years ago, completed, furnished but is now still under lock and key."
  },
  {
    "headline": "COVID-19: New US travel requirements take effect Nov 8",
    "summarized_story": "Beginning on November 8, foreign air travellers to the United States will be required, with only limited exceptions, to be fully vaccinated and to provide proof of vaccination status before boarding a plane to the US.\nThis new global travel system replaces the existing country-by-country restrictions, putting in place a consistent approach worldwide, the US has said.\nWith the implementation of these new vaccine requirements, the US government explained that foreign national travellers who had been in one of the 33 countries with restrictions do not need to obtain national interest exceptions to travel to the US.\nIt noted, “When it comes to testing, fully vaccinated air travellers will continue to be required to show documentation of a pre-departure negative viral test taken within three calendar days of travel to the United States before boarding.\n“That includes all travellers – US citizens, lawful permanent residents and foreign nationals."
  },
  {
    "headline": "COVID-19: New US travel requirements take effect Nov 8",
    "summarized_story": "Beginning on November 8, foreign air travellers to the United States will be required, with only limited exceptions, to be fully vaccinated and to provide proof of vaccination status before boarding a plane to the US.\nThis new global travel system replaces the existing country-by-country restrictions, putting in place a consistent approach worldwide, the US has said.\nWith the implementation of these new vaccine requirements, the US government explained that foreign national travellers who had been in one of the 33 countries with restrictions do not need to obtain national interest exceptions to travel to the US.\nIt noted, “When it comes to testing, fully vaccinated air travellers will continue to be required to show documentation of a pre-departure negative viral test taken within three calendar days of travel to the United States before boarding.\n“That includes all travellers – US citizens, lawful permanent residents and foreign nationals."
  },
  {
    "headline": "Damboa attack: Boko Haram kills two MOPOL in Borno",
    "summarized_story": "Boko Haram insurgents have killed two mobile policemen in a fresh attack on Damboa town in Borno State.\nAccording to sources in the humanitarian community, the insurgents also burnt down the MOPOL station which served as a barracks, as well as the civilian JTF Outpost in the town.\n“The insurgents drove into Damboa from Biu Road around 5.30pm on Thursday in eight gun trucks and operated for over one hour.\n“When they got into the town, they headed straight to the MOPOL barracks and started shooting indiscriminately.\nThey also burnt one vehicle of the CJTF,” the humanitarian source disclosed."
  },
  {
    "headline": "Damboa attack: Boko Haram kills two MOPOL in Borno",
    "summarized_story": "Boko Haram insurgents have killed two mobile policemen in a fresh attack on Damboa town in Borno State.\nAccording to sources in the humanitarian community, the insurgents also burnt down the MOPOL station which served as a barracks, as well as the civilian JTF Outpost in the town.\n“The insurgents drove into Damboa from Biu Road around 5.30pm on Thursday in eight gun trucks and operated for over one hour.\n“When they got into the town, they headed straight to the MOPOL barracks and started shooting indiscriminately.\nThey also burnt one vehicle of the CJTF,” the humanitarian source disclosed."
  },
  {
    "headline": "Breaking: Dele Momodu Takes Big Step Into Politics Again, Joins PDP",
    "summarized_story": "Ovation Media Group’s Chairman has returned to politics, joining the Peoples Democratic Party (PDP).\n“For these reasons, I am happy to declare that I am now a full-fledged participating member of the great and patriotic Peoples Democratic Party.\nI offer my sincere apologies on the role some of us played in 2015 in bringing President Muhammadu Buhari to power.\nI wish to thank the leadership of my party, PDP, for fully accepting me with love and enthusiasm.\nGod bless the Federal Republic of Nigeria.”Momodu ran for president against the eventual winner, Dr. Goodluck Jonathan, and the current president, Muhammadu Buhari, in 2011."
  },
  {
    "headline": "BREAKING: Protest Rocks TASUED As Soldiers Brutalise, Abduct Students’ Union President, Others",
    "summarized_story": "On Friday, students at Tai Solarin University of Education (TASUED) protested the kidnapping of their Students Union President, Sodiq Rabiu, and others by Nigerian Army soldiers.\n“As responsible and responsive students’ union officers, upon hearing the ugly development, we swung into action and made frantic efforts to mediate and rescue students from this injustice and assault cum fraudulent exploitation.\nThis calm and ideal effort by the students’ union was met with strong resistance by the military men, who, assaulted and abducted the Students’ Union President.\n“The Senate President was also severely injured and many comrades were beaten, whipped and abducted by the military men.\nVery assertively, the Students’ Union has declared lecture and exam free day tomorrow, Friday, October 29, 2021, to press home this unjust exploitation and assault."
  },
  {
    "headline": "JUST IN: Former Kano Governor Speaks on Defection from PDP to APC ahead of 2023",
    "summarized_story": "The former governor of Kano state, Rabiu Kwankwaso, has said he remains a member of the opposition PDP.\nResponding, Kwankwaso said: “I am still a member of the PDP.”Speaking on his relationship with Governor Ganduje, Kwankwaso said; “on personal grounds, there is no issue.\nWe don’t believe in borrowing.”Kwankwaso also spoke on the suit by Uche Secondus, suspended PDP national chairman, asking the court to suspend the party’s national convention.\nHe said he had advised the PDP to allow Secondus and his team to complete their term since they have just had a few months left.\nThe former minister of defence said the current crisis would have been averted if his advice was heeded."
  },
  {
    "headline": "BREAKING: Jailbreak Foiled In Benin Prison",
    "summarized_story": "An attempted jailbreak has been recorded at the Benin Medium Security prison on Sapele Road in Benin City, Edo State,According to the Edo State Command Public Relations Officer of the Service, Aminu Suleman, he described the incident as disturbing.\nThe situation led to one section of the Sapele Road being temporarily blocked and traffic diverted to the other lane.\n“The situation has been completely brought under control and the prison is calm.\n“The Controller of the prisons, Felix Lawrence wishes to assure the general public that they should go about their normal business without any fear.\nA spokesman for the Nigerian Correctional Service (NCS) in the state, Olanrewaju Anjorin had confirmed the attack on Saturday."
  },
  {
    "headline": "Breaking: Dele Momodu back to politics, joins PDP",
    "summarized_story": "Renowned Nigerian Journalist, Dele Momodu, has decided rejoin politics and that he’s teaming up Nigeria’s main opposition party, the Peoples Democratic Party (PDP).\nMomodu, a former presidential candidate announced his move to the PDP in a statement, explaining that his decision was based on the need to contribute meaningfully to the development of the country.\nAccording to him, “I have consulted widely.\nAnd it is clear to me that given the dangerous and disastrous drift that our nation has experienced in the past six years, the only party from which amends can be made to rectify our situation is the Peoples Democratic Party (PDP).\n“This accords with my vehement opposition to the policies and practices of the All Progressive Congress (APC) and its leadership, which has denuded our country of everything we hold dear – national unity, cohesion, security, economic prosperity, educational advancement, social infrastructure, and above all, our cherished moral values."
  },
  {
    "headline": "24 hours to National Convention: Fear grips party as Appeal Court rules on Secondus vs PDP suit",
    "summarized_story": "Dissatisfied with the decision, the PDP chieftain headed to court to challenge his removal, and also prayed the court to stop the party’s national convention slated for Saturday.\n“The appeal is a clear deviation from the fact for which this appeal was instituted, which is the national convention.\nBlueprint correspondent observed that the party headquarters was calm, as party faithful were seen around the Wadata Plaza in Abuja ahead of the National Convention.\nBlueprint reports that the committee had earlier disqualified three aspirants from participating in the national convention.\nAkintan Kareem.”In related development, the PDP National Convention National Convention Organising Committee (NCOC) meets today (Friday)."
  },
  {
    "headline": "Revealed! How troops killed new ISWAP leader Bako, 37 others in 2 weeks",
    "summarized_story": "The Nigerian military Thursday said troops of Operation Hadin Kai in the North-east killed a total of 38 terrorists, including Bako, new leader of the Islamic State in West Africa Province (ISWAP).\nDirector Defence Media Operations (DMO) Brigadier-General Benard Onyeuko stated this in Abuja while briefing journalists on the update of military operations across the country.\n“In simple English, the Nigerian press has a watchdog role assigned to it by the framers of our Constitution.\nAs a matter of fact, the Nigerian press cannot and must not play the role of a LAPDOG.\nWould the British or American press regurgitate a report in the Nigerian press denigrating their militaries?"
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "20 vs Africa: UNICEF laments gap in COVID-19 vaccine doses distribution -NigPilot",
    "summarized_story": "The United Nations Children’s Fund, UNICEF, has said that new analysis shows that G20 countries have received 15 times more COVID-19 vaccine doses per capita than countries in sub-Saharan Africa.\nThe analysis, conducted by science analytics company Airfinity, exposed the severity of vaccine inequity between high-income and low-income countries, especially in Africa.\nIn the press statement obtained from UNICEF, in Abuja yesterday, it disclosed that doses delivered to G20 countries per capita are 15 times higher than doses delivered per capita to sub-Saharan African countries; 15 times higher than doses delivered per capita to low-income countries, and three times higher than doses delivered per capita in all other countries combined.\nThe statement quoted UNICEF Executive Director Henrietta Fore as saying, “Vaccine inequity is not just holding the poorest countries back – it is holding the world back.\nAs leaders prepare to meet for the G20 Summit in Rome this weekend, 48* UNICEF Africa ambassadors and supporters from across the continent have united in an open letter."
  },
  {
    "headline": "Ita Enang tasks CSOs/NGOs on policy engagement -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Defence Minister promises improved welfare for ex- servicemen, dependants of fallen heros, widows -NigPilot",
    "summarized_story": "Minister of Defence, Retired Major General, Bashir Magashi has promised to improve welfare needs of the ex-servicemen, widows, and dependants of the Nigerian Armed Forces Fallen Heroes.\nMagashi made this known during the Nigerian Legion Humanitarian Day Celebration line up with the activities of the Armed Forces Remembrance Day Celebration 2022, at the Legion Headquarters in Abuja.\nWhile appreciating the Nigerian Legion for their efforts towards sustaining the organisational mandate, General Magashi assured ministry of defence commitment to provide succour to the veterans, widows and orphans of fallen heroes.\nMeanwhile, some of the beneficiaries expressed gratitude to the minister of defence, Nigerian legion and other partners organisation for their selfless service to the humanity.\nHighpoint of the event, were the medical treatment to the ex-servicemen and widows, distribution of palliatives items, cash money, scholarship to the children of the fallen heroes amongst others."
  },
  {
    "headline": "Osinbajo advocates sustainable procurement,environmental, social safeguards to achieve ERGP in Nigeria -NigPilot",
    "summarized_story": "Vice President of Nigeria, Prof. Yemi Osinbajo has said that if Nigeria must achieve the objectives of the Economic Recovery Growth Plan ERGP, and the Sustainable Development Goals SDGs, the country must get it right in procurement, environmental and social safeguards.\nOsinbajo made this revelation while officially launching the Sustainable Procurement, Environmental and Social Standards Enhancement Project, SPESSE in Abuja on Thursday.\nProf. Osinbajo noted that to achieve this, there is a need to build the adequate technical capacity required for efficient and effective procurement, environmental and social safeguard systems.\n“The SPESSE Project is Nigeria’s first attempt at institutionalising sustainable capacity building in the fields of Procurement, Environmental, and Social Standards, by offering professionalisation and academic programmes in a custom-made, fit-for-purpose and sustainable manner, through the Centres of Excellence.\nThe Sustainable Procurement, Environmental and Social Standards Enhancement Project centres, SPESSE, are domiciled in six universities across the 6geo-political zones of Nigeria."
  },
  {
    "headline": "Governor Bello receives members of Board of Trustees of NMMA -",
    "summarized_story": "Kogi State Governor, Yahaya Bello on Thursday evening, received the Chairman and members of the Board of Trustees of the Nigerian Media Merit Award at his office, Lugard House, Lokoja.\nThe Board of Trustee members led by veteran media – statesman Haroun Adamu paid a courtesy call on the governor ahead of the 2021 Nigeria Media Merit Award scheduled to hold in Kogi State from 28th- 30th of October 2021.\nThe Governor received the members warmly and assured them of fruitful and peaceful events in the state.\nChairman of the board, Dr Haroun-Rashid, the Trustee Chief Administration, Mr Samuel Yemi Akeju, the Deputy Chief Administration, Mr Adewunmi Adediran and Mr Mac O Emakpore were part of the delegation."
  },
  {
    "headline": "Troops capture 3 gun trucks, kill ISWAP fighters after foiling attack on Damboa Super Camp -",
    "summarized_story": "The Nigerian troops has on Thursday evening repelled an attack on Damboa Super Camp of the Nigerian Army in Borno State.\nAccording to a military intelligence officer the terrorist’s ambush which the Nigerian troops foiled was laid by fighters of the Islamic State of West Africa Province (ISWAP).\nThe insurgents were said to rode in nine gun trucks, three Armoured Personnel Carriers (APCs) and three MRAPs, to attack the Super Camp.\nBut the Nigerian ground troops, with the support of the military Air Task Force engaged them and killed scores of the terrorists.\nThe troops who have since mounted clearance operation in the town after repelling the attack also recovered three gun trucks belonging to the ISWAP criminals."
  },
  {
    "headline": "UPDATED: Mimiko’s ZLP Merges with PDP",
    "summarized_story": "Members of the Zenith Labour Party, ZLP from across the 18 Local Government Areas of Ondo State have resolved to join the People’s Democratic Party PDP.\nThis is coming after a meeting held at the residence of the party’s national leader, Olusegun Mimiko in Ondo on Wednesday.\nThe meeting followed an earlier visit by four PDP governors led by chairman of their forum, Aminu Tambuwal of Sokoto State.\nThe stakeholders meeting was called to discuss the meeting with the PDP governors and intimate members with the outcomes of series of interactions with PDP leaders on the invitation extended to him.\nMr. Mimiko told the stakeholders that the ZLP is being invited to join the PDP to rescue the country from the brink of insecurity."
  },
  {
    "headline": "Police rescue man and his friend abducted by unknown gunmen in Imo",
    "summarized_story": "The police in Imo state have rescued a man and his friend who were abducted by yet-to-be-identified gunmen in Akwakuma road in Owerri West local government area in the state.\nThe gunmen were said have ridden in a sky blue Lexus Jeep.\n“The command’s tactical teams on patrol within the axis were immediately alerted, and they sped to the area, giving the hoodlums a hot chase.\nThe kidnappers, who were joined by other tactical teams, felt threatened when they saw their numbers and the pressure mounted, so they abandoned their vehicle with the victims and fled into hiding.\nThe victims were unharmed when they were rescued and have since been reunited with their families.” Abattam statedHe added that the victim’s G-Wagon jeep was later recovered at the scene with three expended cartridges."
  },
  {
    "headline": "Nigeria Police Chief ‘Not Aware’ of FBI Request for Abba Kyari’s Extradition",
    "summarized_story": "Speaking at a ministerial media briefing in Abuja on Thursday, the IGP said apart from what he read on the social media, he was not in any way aware of any formal extradition request.\nAccording to him: “I’ve not heard about it formally but I have read it on the social media that there was an extradition request.\nOn the deployment of security personnel for Anambra gubernatorial poll, the IG stressed that although the heavy security presence may affect the turnout of voters, the measure was necessary to checkmate criminals disrupting the process.\n“It is, while we are asking people to come out and vote, another group or other subversive elements are saying ‘don’t come.\nThe IG said the police was maintaining its grounds and ensuring that crime and criminality were checked."
  },
  {
    "headline": "Evergrande Makes Coupon Payment Before Friday Deadline",
    "summarized_story": "One bondholder said he maintained a negative outlook for the developer despite it making the coupon payment.\nEvergrande missed coupon payments totalling nearly $280 million on its dollar bonds on Sept. 23, Sept. 29 and Oct. 11, beginning 30-day grace periods for each.\nIt still has nearly $338 million in other offshore coupon payments coming due in November and December.\nThe NDRC also implored developers to meet offshore debt obligations, and maintain their reputations and market order.\nBut that business model has been scuttled by hundreds of new rules designed to curb developers’ debt frenzy and promote affordable housing."
  },
  {
    "headline": "‘Everything is at Stake’ as World Leaders Gather for Climate Talks",
    "summarized_story": "Climate Change Conference, known as COP26.\n“Everything is at stake if the leaders do not take climate action,” young Ugandan climate activist Vanessa Nakate said.\n“Climate change and the threatening ecocide are the biggest threats humanity faces.”Climate change is fueling heat waves, flooding, drought and nastier tropical cyclones.\nWorld leaders have recently softened those targets a bit, and they say the goals may not quite be finished by mid-November, when negotiations end.\nThe hope is that world leaders will cajole each other into doing more, while ensuring that poorer nations struggling to tackle climate change get the financial support they need."
  },
  {
    "headline": "Former New York Governor Cuomo Charged with Misdemeanor Sex Offence",
    "summarized_story": "A criminal complaint charging former New York Governor Andrew Cuomo with a misdemeanor sex offense was filed on Thursday in a court in Albany, the state capital, the first prosecution stemming from a misconduct scandal that led to his resignation.\nThe district attorney for Albany County, David Soares, issued a separate statement suggesting that the sheriff had acted independently of local prosecutors.\nThe New York Post said Cuomo was expected to be arrested next week and charged with a misdemeanor in the alleged groping of a former aide.\nread moreNew York Attorney General Letitia James said a five-month independent investigation concluded that Cuomo had engaged in conduct that violated multiple federal and state laws.\nLike his father Mario Cuomo, Andrew Cuomo was elected to three four-year terms as governor."
  },
  {
    "headline": "TV Series on Maradona out Friday, Promises New details, and Controversy",
    "summarized_story": "A new drama series based on the life of late Argentine footballer Diego Maradona promises to reveal little-known details about the turbulent life and times of the legendary player and has already caused controversy in his homeland.\n“Maradona:Blessed Dream” mixes archive footage with dramatised scenes from his life over 10 one-hour episodes.\nFour different actors play Maradona at various stages of his life, and others appear as former players, coaches, agents and family.\n“Would he have liked it?” Nicolas Goldschmidt, one of the actors who plays Maradona, said in an interview with Reuters.\nIt certainly kicks off in dramatic fashion, with a 40-year-old Maradona on a beach, overweight and out of breath."
  }
]