[
  {
    "headline": "Court ruling against Umahi unjust, says Ebonyi LG boss",
    "summarized_story": "Chairman of Afikpo South Local Government Area of Ebonyi State, Eni Uduma-Chima, has disagreed with the ruling of the Federal High Court Abuja, which sacked David Umahi, and his Deputy ,Kelechi Igwe, from office for defecting from the Peoples Democratic Party to the All Progressives Congress.\nEni, a former member of Ebonyi State House of Assembly, while reacting to the ruling in Abakaliki, on Friday, expressed optimism that the appellate courts would find the faults in the judgement and uphold the judgement of Abakaliki High which had earlier ruled that Umahi and his deputy offended no law for defecting to the APC.\nHe said, “The judgment of the Federal High Court apart from being unjust is equally unpopular and is the only court judgment that has attracted the widest condemnations and public review since Nigerian independence.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "Oil Exploitation: ATBU laboratory to solve analysis for Gombe, Bauchi",
    "summarized_story": "The National Office for Technology Acquisition and Promotion, Director General Dan Ibrahim, has revealed that the establishment of standard laboratory in Abubakar Tafawa Balewa University will support the discovery of crude especially with analysis.\n“The second one is in Tafawa Balewa University, Bauchi, Chemical Engineering Department, it is serving two purposes because both Bauchi and Gombe by God’s grace will be among the oil producing states.\nIt would be used for analysis that they will not have to take it to other areas to confirm.\nOn his part, Gombe State Governor, Muhammadu Yahaya, said his administration was committed to supporting the advancement of science and technology following its importance to the economy.\nRepresented by the Deputy Governor Manassah Jatau, Yahaya said a lot were being done to ensure science took centre stage in the state."
  },
  {
    "headline": "Nigeria customs intercepts N192 million unregistered pharmaceutical products, 181 bags of foreign rice",
    "summarized_story": "By Chinonso Alozie, OwerriThe Nigeria Customs Service, Federal Operations Unit, Zone ‘C’, FOUC, has intercepted unregistered pharmaceutical products, valued at N192 million and 181 50kg bags of foreign parboiled rice worth N171 million among other contraband goods.\nAccording to FOUC, some of the locations where the contraband products were intercepted included; Umuikaa/Aba, Akwa-Ibom/Calabar axis among others.\nHe added that the intercepted contraband goods were with a Duty Paid Value of N529,056,456 million between January 1st and February 28th, 2022.\n“1,650 bales of used clothing valued at N165 million were intercepted along the Umuikaa/Aba road while 181 50kg bags of foreign parboiled rice worth over N7.2 million were intercepted along the Akwa-Ibom/Calabar axis.\n“2,239 pieces of used pneumatic tyres valued at N4.5 million and 36,000 litres of smuggled petroleum products concealed in polyethene bags, worth N3.6 million."
  },
  {
    "headline": "APC youth council backs Bello’s leadership",
    "summarized_story": "The group urged all party stakeholders, leaders, and members to continue to work for peace and the progress of the party for the greater good of the country.\nAccording to the statement, ‘’APC- Young Professionals Council, is the party’s support group founded solely to help in strengthening the party by guiding and providing professional solutions to the challenges facing the nation and to promote progressive agenda of the party and Mr. President, His Excellency Muhammadu Buhari.\nWe will continue to toe the part of peace and reconciliation.\n“All the party faithful should see everyone that contested as a winner.’“We urge the newly-elected executives to ensure a reconciliatory process.\nWe cannot rule out the fact that some members would be aggrieved for one or more reasons, we must remain as one united family, be focused on delivering unprecedented progress and development to our party as we face the opposition in 2023,” they said."
  },
  {
    "headline": "ABU Zaria denies selling landed property",
    "summarized_story": "By Ibrahim Hassan-WuyoThe Ahmadu Bello University (ABU), Zaria has denied selling 80 hectares of landed properties belonging to the Department of Agricultural and Animal Science (DAAS), Mando to private individuals.\nA statement by the Director of Public Affairs Directorate, ABU, Awualu Umaru said: “the attention of Ahmadu Bello University has been drawn to a statement credited to the Director-General of Kaduna State Urban Planning and Development Authority (KASUPDA), Isma’il Umaru-Dikko, in which he accused the institution of selling about 80 hectares of land belonging to its College of Agriculture and Animal Science at Mando in Kaduna metropolis to individuals.”“This is to categorically state that the allegation is totally false and unfounded.\nAnd to simply put the record straight, Ahmadu Bello University has never sold its land to anybody, be it individual or corporate organization; and it will never do so.”“The College has the Ownership Certificate (G.ITEM-No.1060) of the entire land on which it was established, in addition to the Survey Site Plan that shows the entire College boundaries”, adding that “the University authorities fenced the entire College many years ago in order to prevent land grabbers from encroaching on its own land.”“However, recently, KASUPDA, purportedly acting on the directives of the Kaduna State Government, illegally trespassed, and recklessly and irresponsibly demolished the perimeter fence that demarcates its boundaries despite the subsisting court order stopping the government agency from such illegal activities.”“The Director-General of Kaduna State Urban Planning and Development Authority (KASUPDA), Isma’il Umaru-Dikko, indeed shamelessly lied by accusing the institution of selling its own land to individuals.\nHe failed the simple test of carrying out a proper investigation to avoid embarrassing himself and the State Government, perhaps because of his inordinate greed and ambition by making the spurious allegation that he made.\nIt was a desperate face-saving measure by the Isma’il Umaru-Dikko having come to terms with the consequences of his action and the crime he committed against the University.”“For the avoidance of doubt, the Kaduna State Urban Planning and Development Authority should know that no amount of blackmail will make ABU allow its own land to be illegally grabbed for allocation to associates and other unpatriotic individuals.”Vanguard News Nigeria"
  },
  {
    "headline": "I will ensure a remarkable end to insecurity in Imo —New Commander 34 Artillery",
    "summarized_story": "By Chinonso Alozie, OwerriThe newly deployed Commander 34 Artillery Brigade Obinze, Brigadier General Sani Sulaiman, has vowed to bring to an end the issue of insecurity within his area of jurisdiction.\nBrigadier Sulaiman, disclosed this to newsmen in Owerri, on Thursday through the Assistant Director Army Public Relations, Captain Joseph Baba Akubo, when Brigadier Sulaiman received a handover note from the outgone Commander, Brigadier General Raymond Utsaha.\nThere is no vacuum as my mission is to sustain the tempo and ensure a remarkable end to insecurity within the Brigades Area of Responsibility.\n“I urge the troops to extend the same level of co-operation given to the former commander to me.\nI charge troops to extend the same or even higher level of co-operation and dedication to duty to the new Commander.”"
  },
  {
    "headline": "Final winners emerge in Oasis Innovation Challenge",
    "summarized_story": "By Luminous Jannamike, AbujaSix finalists and overall winners have emerged from the Oasis Management Company’s prize for software innovation.\nThe firm had initiated a reward and motivation process to encourage technology start-ups to constantly find lasting solutions to some of the challenges in the country.\nFollowing this, several small and medium-scale technology groups submitted exciting entries, including virtual reality systems, face recognition solutions, online learning and training platforms, and newer methods of facilitating financial inclusion.\nIn his remarks, an innovation expert and investor, Chris Osondu, said: “The OIC has presented investors with a rich set of new investment opportunities in virtual reality, digital transformation and fintech.\nOther participants said it was an opportunity for them to showcase their talents and technology innovation projects, with hope that the other people will identify them and give them access to funding and skilled resources to help them turn their business ideas into successful companies."
  },
  {
    "headline": "Nigerian Navy flags of 2022 Operation Obangame Express",
    "summarized_story": "The Chief of Naval Staff, Rear Admiral Awwal Zubairu-Gambo, has flagged off 2022 Operation Obangame Express.\nThe exercise is aimed at improving security between Gulf of Guinea navies and allied friends.\nRear Admiral, Zubairu-Gambo said the exercise is designed to “improve regional collaboration through joint operations, intelligence sharing and harmonized legal framework to enhance collective capabilities of Gulf of Guinea nations against maritime crime”.\nRear Admiral Zubairu-Gambo in his address during the flag-off at Nigerian Navy Thunder Jetty, Onne in Eleme Local Government Area of Rivers State on Friday disclosed that the Navy will deploy ten ships, two helicopters as well as element of special boat service for this year’s exercise.\n24 friendly forces will participate in this year’s exercise."
  },
  {
    "headline": "Abba Kyari: EndSARS panel orders Marwa to produce suspended DCP",
    "summarized_story": "An Independent Investigation Panel, on Friday, ordered retired Brig.-Gen. Buba Marwa, the Chairman, National Drug Laws Enforcement Agency (NDLEA), to produce suspended DCP, Abba Kyari, on March 22, 2022.\nThe panel also ordered the new Commandant of the IGP-IRT, Tunde Dirsu, to do the needful to make sure that Kyari is produced before the panel on the aforesaid date.\nMr John Martins, representing the Chairman of the panel, retired Justice Suleiman Galadima, explained that the presence of Kyari before the panel was necessary owing to the fact that a petitioner’s witness had earlier mentioned him.\n“The above orders are made in respect of three persons who were allegedly arrested and detained by the IGP-IRT detention facility.\nJames Idachaba, the Police Counsel, told the panel that the Police could no longer produce Kyari because he was no longer in Police custody, having been suspended."
  },
  {
    "headline": "War: Ukrainian forces kill Russian Maj. Gen. Andrei Sukhovetsky",
    "summarized_story": "Russian Maj. Gen. Andrei Sukhovetsky, has been killed, according to CNN.\nSukhovetsky was killed while fighting in Ukraine, according to a statement from the Novorossiysk city government.\nMeanwhile, the Ukrainian military had claimed that it had defeated a regiment of Russian troops and killed its commander, Col. A. Zakharov.\nThey were said to have achieved the feat in Brovary, northeast of Kyiv.\nThe Ukrainian Ministry of Defense said on Thursday that “The commander of the occupier’s regiment, Colonel Zakharov, was liquidated."
  },
  {
    "headline": "Boko Haram: How we destroyed terrorists’ central command in Kano – Ganduje",
    "summarized_story": "Governor Umar Abdullahi Ganduje of Kano State, has said that his administration had in the last seven years in office, destroyed the Central Command of terrorists.\nGanduje said the development has chased terrorists away from the state.\nThe governor then urged his colleagues to fully and effectively collaborate with security agencies in their respective states to fight terrorism.\nHe added, “Through it, we were able to identify and destroy the central command of the dreaded terrorists group and dealt a blow to their operations in Kano, amongst other criminalities.\nGovernor Ganduje argued that the menace of insecurity calls for a new approach that would be founded on credible intelligence gathering."
  },
  {
    "headline": "COVID-19: Nigeria disburses N35bn under World Bank-funded NG-CARES to states, FCT",
    "summarized_story": "The Federal Government of Nigeria (FGN) says about N35.3billion have been disbursed to 36 states and the Federal Capital Territory (FCT) to mitigate COVID-19 impact.\nTeam Leader, Physical Implementation Support Mission for NG-CARES Programme, Prof. Yusuf Suleiman gave the figures on Friday.\nIn February, Vice President Yemi Osinbajo launched the World Bank-financed Nigeria COVID-19 Action Recovery and Economic Stimulus (NG-CARES) with $750million loans.\n“As of last week, we were able to disburse N35.3billion to states out of which Kebbi received N900million”, NAN quoted Suleiman saying.\nHe warned that if a state was unable to achieve results beyond the N900million received, doing so would be difficult going forward."
  },
  {
    "headline": "Osun 2022: Court affirms Babayemi as PDP candidate",
    "summarized_story": "An Osun High Court sitting in Ijebu-Jesa has affirmed Dotun Babayemi as the authentic gubernatorial candidate of the People’s Democratic Party (PDP) in Osun.\nThe Nation reports PDP held parallel primaries on Tuesday leading to the emergence of Dotun Babayemi and Senator Ademola Adeleke.\nBesides, the Court granted an Order of Mandatory Interim Injunction restraining the defendants/respondents from recognizing any other governorship primaries of the PDP in Osun State aside from the one that saw to the emergence of Babayemi.\nThe Court through an Order of Mandatory Interim Injunction has nullified all actions taken in flagrant disobedience to the judgement of,22nd November 2021, which recognized the Ward Executive Officers who produced delegates for the primaries.\nFurther hearing has been fixed for Wednesday,16th March 2022."
  },
  {
    "headline": "APC dares INEC, vows to hold March 26 convention",
    "summarized_story": "The Caretaker/Extraordinary Convention Planning Committee (CECPC) of the ruling All Progressives Congress (APC) has vowed to go ahead with the March 26 National Convention.\nIt insisted it had notified the Independent National Electoral Commission (INEC) of its intention hold the exercise.\nHe dismissed the INEC letter insisting on a fresh 21-day notice for the National Convention to follow due process.\nAhmed argued that having intimated INEC of its intent to conduct its national convention on February 26, which was moved to March 26, what is required is simply a notice of adjustment and not a fresh 21-day notice.\n“The moment, the CECPC agreed on the 26th of March, that letter was written to INEC, INEC has accepted that letter."
  },
  {
    "headline": "Quit notice: 900 doctors, nurses, others may lose jobs in FCT",
    "summarized_story": "No fewer than 900 health workers in the Federal Capital Territory (FCT) may lose their jobs.\nThis is because the FCT Administration (FCTA), has given the managers of the Garki Hospital a month notice to vacate the facility.\nThe concession agreement for the PPP was signed between the NISA Premier and the FCTA in 2007 for a period of 15 years.\nHowever, the FCT Administration, on March 1, this year, gave the hospital management notice to vacate and hand over the facility to it on April 1, 2022.\nAccording to him, there is no crisis between the FCT Administration and the management of NISA Premier."
  },
  {
    "headline": "Court dismisses suit seeking to bar Enugu teachers from strike",
    "summarized_story": "The National Industrial Court sitting in Enugu has dismissed the suit filed by the Enugu State Government seeking to stop primary school teachers from embarking on strike action over non-payment of national minimum wage.\nThe State Government had sought the relief of the Court to bar the teachers from embarking on any strike on the ground that they were essential workers.\nIt said: “The Court found as condemnable the attitude of the Claimant/plaintiff for its failure to implement the national minimum wage as approved by the federal government since 2020.\n“The claimant is hereby ordered to go back to negotiating table with the Defendant and implement the national Minimum wage.\nThe defendants are entitled to be paid the Minimum wage.”The court further held that the Enugu State Government has no right to exclude the primary school teachers in Enugu State in the implementation of the national Minimum wage enjoyed by other workers in the state."
  },
  {
    "headline": "Russia sues Meta, calls for Instagram to be blocked over ‘death calls’",
    "summarized_story": "Russia sues Meta, calls for Instagram to be blocked over ‘death calls’Moscow on Friday said it was opening a criminal case against Meta for “calling for the murder” of Russians, saying the parent company of Facebook and Instagram had relaxed rules on violent messages aimed at Russia’s army and leaders.\nThe announcement came over two weeks after Russian President Vladimir Putin sent troops into Ukraine, with Russia seeking to ban any criticism of the military campaign.\nThe General Prosecutor’s Office said “materials were being distributed on Instagram that contained calls for committing violent acts against the citizens of Russia, including military personnel.”It said it had asked Russia’s media watchdog Roskomnadzor to “restrict access” to Instagram.\nFacebook and Instagram are widely used in Russia, the latter being the most popular social media platform for young Russians.\nSince early March, Twitter and Facebook have been inaccessible in Russia."
  },
  {
    "headline": "FCCPC, others raid loan application platforms over privacy infringement, illegal operations",
    "summarized_story": "By Adewale SanyaoluThe Federal Competition Consumer Protection Commission (FCCPC) in conjunction with the Independent Corruptb Practices Commision(ICPC) and the National Information Technology Development Agency(NITAD) have raided some loan application platforms over consumer rights abuse.\nSome of the raided companies included;GoCash, Okash, EasyCredit, Kashkash, Speedy Choice and Easy Moni.\nLeading the raid on some loan application firms in Lagos today, Executive Vice Chairman and Chief Executive Officer of FCCPC, Mr. Babatunde Irukera said the growing number of consumer complaints on the activities of loan application platforms in relation to privacy infringement and high interest rates informed FCCPC’s decision to carry out the raid.\nHe said a situation whereby loan application platforms send names and pictures of loan defaulters to all their telephone contacts without recourse to due process and in a manner that suggests naming and shaming will no longer be tolerated.\nGiving a background on the rise in the number of loan application platforms, Irukera said during the COVID-19 lockdown, a lot of households sue to the effect of the pandemic needed soft loans, hence the need to secure loans became expedient."
  },
  {
    "headline": "Breaking: Gov Bello’s CECPC makes U-turn, says Buni still in charge",
    "summarized_story": "According to him; “somebody asks, what is the position of Governor Mai Maa Buni in the party, I think it’s pretty simple.\nSince the inception of this CECPC on June 25, 2020, whenever the chairman is not around and Governor Sani Bello is around, he acts on behalf of all as the Chairman.\nThe chairman wrote a letter and transmitted power to Governor Bello to enable him go for medical treatment.\n“So, one has to leave for the other, whichever, he has transmitted a letter and Governor Sani Bello has been acting appropriately.\n“So, Governor Sani Bello I acting the full authority of the Caretaker Committee and with the full authority of the stakeholders and with the full concent of Governor Mai Mala Buni."
  },
  {
    "headline": "2023: I want to see Igbo become president – Obasanjo",
    "summarized_story": "By Sunday AniFormer President Olusegun Obasanjo has again reiterated that it would gladden his heart to see a Southeasterner emerge as president of Nigeria after President Muhammadu Buhari in 2023.\nThe former president said he also believes that there are a lot of things that Southeasterners can bring on the table.\nHe said his ambition is to make Nigeria a first world nation; a globally competitive nation and a nation that works like the other countries, which Nigerians admire.\nHe said that Obasanjo as a president, showed the highest level of not only detribalization but also fairness and equity as he didn’t discriminate.\nHe described the former president as a phenomenon and conscience of the country."
  },
  {
    "headline": "APC freed from ‘Yahoo Yahoo governors’ –Akeredolu",
    "summarized_story": "Salihu Lukman, former director-general of the Progressive Governors Forum (PGF), had alleged that Buni was working with “Yahoo Yahoo” politicians to stop the party’s convention.\n“The installation of the Caretaker and Extraordinary Convention Planning Committee (CECPC) of the APC was beyond a call to service.\n“Nevertheless, the courage and determination as well as shrewd sincerity of purpose demonstrated by most of the APC Governors remain a delight.\nAkeredolu said he and other APC governors were in support of Governor Bello dared governors who reportedly threatened to leave the party if Buni was removed to fulfil their threat.\n“Now that the clear motive aimed at frustrating our national convention has been botched, our party is on the track to greatness."
  },
  {
    "headline": "Insecurity: We can no longer run from community policing –Fayemi",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaChairman of Nigeria Governors Forum (NGF) and Governor of Ekiti State, Kayode Fayemi, has said community policing is the way to go.\nHe said a vigilance group like Amotekun was achieving results with local intelligence in his state, Ekiti.\nHe said rather than condemn community policing, an institutional framework should be put in place to guard against abuse.\nHe stated this while responding to what state governors do with their monthly security votes, saying aside the police, other security agencies also get support from governors.\nState governors fund police more than the federal government."
  },
  {
    "headline": "FG: No More Subsidies in Power Sector, Fuel Subsidy to Go in Phases",
    "summarized_story": "*Says power sector subsidy removal quietly doneNdubuisi Francis in AbujaThe federal government disclosed Friday that it had quietly removed all subsidies in the power sector, even as it plans to gradually stop similar subsidies on petroleum motor spirit (PMS), popularly known as fuel.\nThe Minister of Finance, Budget and National Planning, Mrs. Zainab Ahmed, who made the disclosure during a virtual meeting of African finance ministers and the International Monetary Fund (IMF), said: “We are cleaning up our subsidies.\nWe had a setback, we were to remove fuel subsidy by July this year but there was a lot of push back from the polity.\nIt has thrown up our deficits too much higher than we planned.\n“Hopefully, the parliament will agree with us and we are able to continue with our plan for subsidy (removal) otherwise the way things are going we will not be able to predict where we will be,” she said."
  },
  {
    "headline": "Uncertainty over APC March 26 Convention as INEC Faults Process, Still Recognises Buni’s Leadership",
    "summarized_story": "Chuks Okocha in AbujaThe planned All Progressive Congress (APC) national convention slated for March 26 has run into troubled waters as the Independent National Electoral Commission (INEC) has faulted a notice of the party’s emergency meeting planned by the Governor Sani Bello leadership of the party.\nINEC also insisted that due process must be followed by giving the commission a 21-day mandatory notice for it to monitor the convention.\nBut, in a swift reaction, the Commission replied the letter on Wednesday March 9, 2022, drawing the party’s attention to some obvious lacuna.\nBy implications, Governor Bello’s leadership of APC is not known to INEC and the stipulated 21 days notice to INEC for the commission to monitor party convention has not been complied with.\nFor INEC to monitor the convention, the APC letter notifying it of its convention ought to have been written earlier than March 8."
  },
  {
    "headline": "With Oil Price Surge, Nigeria Importing 100% Fuel Need, Subsidy Threatens to Cripple Economy",
    "summarized_story": "NNPC Limited recently disclosed that it spent N173.488 billion in excess of the budgeted N36.893 billion on petrol subsidy in January.\nRising Crude Oil Price Has Widened Budget Deficit, Ahmed LamentsMinister of Finance, Budget and National Planning, Mrs. Zainab Ahmed, stressed that rising crude oil prices had widened the country’s budget deficit.\nAhmed pointed out that the federal government was presently in the process of amending the budget to accommodate fuel subsidy.\nThe price of crude oil has been rising and the price of dollar has been rising.\nWe need to refine crude oil here so that we end these disruptions and high prices,” Ndulue said."
  },
  {
    "headline": "Fayemi: We Use Security Votes to Fund Police, Military, Civil Defence, Buy Ammunitions, Vehicles",
    "summarized_story": "Fayemi also gave reasons why state governors were against local government autonomy.\nWe fund the police and we fund the police more than the federal government, quote me.\n“State governors fund police more than the federal government.\n“There are also crimes that are within the borders of our states in accordance with the statute that’s been promulgated or enacted by our local state assemblies.\nFayemi said he has no objection to local authority playing a role in local security."
  },
  {
    "headline": "Buni Fights Back, Pleads with Buhari for Him to Stay On",
    "summarized_story": "It is however not certain how disposed the president is to Buni and his supporters’ plea.\n“Now that the clear motive aimed at frustrating our national convention has been botched, our dear party is on the track to greatness.\nBut as you know, this is only for the conduct of the national convention,” Akeredolu concluded.\n“In my absence, I hereby transmit the functions of my office as the National Chairman of the Caretaker/Extraordinary Convention Planning Committee (CECPC) to you.\n“This is to enable the committee conclude all arrangements leading to the National Convention slated for March 26th, 2022 and other duties that may be required of the office."
  },
  {
    "headline": "EXCLUSIVE: Nigeria’s Central Bank Stops Payment Of $418million To Ned Nwoko, Panic Alert Security Systems, Other Paris Club Consultants",
    "summarized_story": "Ned NwokoDocuments seen by SaharaReporters had shown that the Debt Management Office (DMO) on September 27, 2021, issued 10 promissory notes valued at $4,783,192.00 each to the creditors.\nThey were asked to submit the original promissory notes to the CBN for dematerialisation.\n“This Promissory Note qualifies as a Liquid Asset for liquidity ratio calculation for banks.\nThis Promissory Note is negotiable and transferable, subject to the submission of this original Note to the Central Bank of Nigeria.\nHolders are also required to submit this original Promissory Note to the Central Bank of Nigeria for dematerialization."
  },
  {
    "headline": "EXCLUSIVE: Nigeria’s Central Bank Stops Payment Of $418million To Ned Nwoko, Panic Alert Security Systems, Other Paris Club Consultants",
    "summarized_story": "Ned NwokoDocuments seen by SaharaReporters had shown that the Debt Management Office (DMO) on September 27, 2021, issued 10 promissory notes valued at $4,783,192.00 each to the creditors.\nThey were asked to submit the original promissory notes to the CBN for dematerialisation.\n“This Promissory Note qualifies as a Liquid Asset for liquidity ratio calculation for banks.\nThis Promissory Note is negotiable and transferable, subject to the submission of this original Note to the Central Bank of Nigeria.\nHolders are also required to submit this original Promissory Note to the Central Bank of Nigeria for dematerialization."
  },
  {
    "headline": "EXCLUSIVE: Nigeria’s Central Bank Stops Payment Of $418million To Ned Nwoko, Panic Alert Security Systems, Other Paris Club Consultants",
    "summarized_story": "Ned NwokoDocuments seen by SaharaReporters had shown that the Debt Management Office (DMO) on September 27, 2021, issued 10 promissory notes valued at $4,783,192.00 each to the creditors.\nThey were asked to submit the original promissory notes to the CBN for dematerialisation.\n“This Promissory Note qualifies as a Liquid Asset for liquidity ratio calculation for banks.\nThis Promissory Note is negotiable and transferable, subject to the submission of this original Note to the Central Bank of Nigeria.\nHolders are also required to submit this original Promissory Note to the Central Bank of Nigeria for dematerialization."
  },
  {
    "headline": "Terrorists Abduct 14 Worshippers From Mosque In Kaduna, Conduct House-To-House Search",
    "summarized_story": "Terrorists, locally known as bandits, on Thursday, invaded a mosque in the Giwa Local Government Area of Kaduna State.\nAccording to the report, the bandits abducted about 14 persons in the attack and rustled an unspecified number of cattle from Tudun Amada village.\nEyewitness reports reveal that the heavy bandits divided themselves into groups; some were at the mosque while others moved from house to house abducting people.\nThe Sarkin Hausawa gave the names of his abducted daughters as Aisha Ibrahim, Farida Ibrahim, Zainab Ibrahim and Hussaina Ibrahim.\nHe said the bandits proceeded to a neighbour’s house and whisked away four residents alongside a nursing mother identified as Laraba Umar."
  },
  {
    "headline": "Terrorists Abduct 14 Worshippers From Mosque In Kaduna, Conduct House-To-House Search",
    "summarized_story": "Terrorists, locally known as bandits, on Thursday, invaded a mosque in the Giwa Local Government Area of Kaduna State.\nAccording to the report, the bandits abducted about 14 persons in the attack and rustled an unspecified number of cattle from Tudun Amada village.\nEyewitness reports reveal that the heavy bandits divided themselves into groups; some were at the mosque while others moved from house to house abducting people.\nThe Sarkin Hausawa gave the names of his abducted daughters as Aisha Ibrahim, Farida Ibrahim, Zainab Ibrahim and Hussaina Ibrahim.\nHe said the bandits proceeded to a neighbour’s house and whisked away four residents alongside a nursing mother identified as Laraba Umar."
  },
  {
    "headline": "Study: COVID deaths estimated at over 18m -- three times more than official figure",
    "summarized_story": "In a new study, researchers have estimated that between 2020 and 2021, there have been over 18 million deaths from COVID worldwide – three times more than the figure reported by official data.\nThe study, published on Thursday, was carried out by the excess mortality team at the Washington University.\nAdvertisementAccording to the researchers, the overall global rate calculated is 120 deaths per 100,000 people and excess mortality rate exceeded 300 deaths per 100,000 of the population in 21 countries.\nThey also found that the highest numbers of cumulative excess deaths due to COVID were estimated in India, the United States, Russia, Mexico, Brazil, Indonesia and Pakistan.\n“The full impact of the pandemic has been much greater than what is indicated by reported deaths due to COVID-19 alone."
  },
  {
    "headline": "Study: COVID deaths estimated at over 18m -- three times more than official figure",
    "summarized_story": "In a new study, researchers have estimated that between 2020 and 2021, there have been over 18 million deaths from COVID worldwide – three times more than the figure reported by official data.\nThe study, published on Thursday, was carried out by the excess mortality team at the Washington University.\nAdvertisementAccording to the researchers, the overall global rate calculated is 120 deaths per 100,000 people and excess mortality rate exceeded 300 deaths per 100,000 of the population in 21 countries.\nThey also found that the highest numbers of cumulative excess deaths due to COVID were estimated in India, the United States, Russia, Mexico, Brazil, Indonesia and Pakistan.\n“The full impact of the pandemic has been much greater than what is indicated by reported deaths due to COVID-19 alone."
  },
  {
    "headline": "Ganduje: Cases on insecurity most often compromised... agencies need complete overhaul",
    "summarized_story": "Abdullahi Ganduje, governor of Kano, says security institutions in the country need a complete overhaul which will result in conformity with global best practices.\nGanduje said this on Friday in Ibadan, the Oyo capital, at the 2022 alumni lecture of the University of Ibadan.\nIn his lecture titled: ‘Challenges of Insecurity and Nation Building’, the Kano governor said urgent steps need to be taken to address the country’s security challenges.\nAdvertisement“There is also the need to modernise security agencies with training, intelligence sharing, advanced technology, logistics, motivation and change of orientation.\nTo ensure all these, there must be incentives, good conditions of service and social security.”"
  },
  {
    "headline": "Ganduje: Cases on insecurity most often compromised... agencies need complete overhaul",
    "summarized_story": "Abdullahi Ganduje, governor of Kano, says security institutions in the country need a complete overhaul which will result in conformity with global best practices.\nGanduje said this on Friday in Ibadan, the Oyo capital, at the 2022 alumni lecture of the University of Ibadan.\nIn his lecture titled: ‘Challenges of Insecurity and Nation Building’, the Kano governor said urgent steps need to be taken to address the country’s security challenges.\nAdvertisement“There is also the need to modernise security agencies with training, intelligence sharing, advanced technology, logistics, motivation and change of orientation.\nTo ensure all these, there must be incentives, good conditions of service and social security.”"
  },
  {
    "headline": "APC: We notified INEC of our convention since Feb 5",
    "summarized_story": "The All Progressives Congress (APC) says its national convention will hold on March 26 as planned.\nAhmed, who was responding to a letter addressed to the party by the Independent National Electoral Commission (INEC), said the electoral umpire had been duly informed of the convention.\nAdvertisementINEC had said the Electoral Act 2022 requires political parties to provide 21 days’ notice prior to any convention or meeting.\nHe added that the electoral body had been served notice of the convention and that there was no issue on the date.\n“The moment the CECPC agreed on March 26 as the date for the national convention, that letter was written to INEC."
  },
  {
    "headline": "Nigerian banks cut dollar spending limit for naira debit cards",
    "summarized_story": "Over the past month, at least 2 of Nigeria’s largest commercial banks have announced reduced limits on international transactions using naira debit cards to $20 (around ₦10,000) per month.\nThis comes as a longstanding scarcity of foreign exchange continues to bite Africa’s largest economy and biggest oil exporter, despite the recent surge in global energy prices.\nNigerians can use their naira-denominated debit cards to pay for transactions billed in US dollars online.\nFor every purchase, debits are made directly from their naira accounts at current exchange rates.\n“Remember you can use your UBA Dollar, Pounds or Euro Card for international POS, ATM, and web transactions,” UBA’s mail read."
  },
  {
    "headline": "Peace Ojemeh’s Haze Monkey finds a home in the $80 billion NFT industry",
    "summarized_story": "By the time she gathered enough knowledge, she reached out to her friend Alabo Briggs, 22, a blockchain engineer, about building their own NFT collection.\nA thoughtful roadmapOne of the things that determines the success of an NFT project is its community.\nThe next one is the animation series about Haze Monkey’s unique stories where holders and community members will be characters.\nBefore the countdown campaign started, Haze Monkey had gathered over 5,000 organic social followers and over 6,000 Discord community members from across the globe.\nThough built by Africans in Africa, Haze Monkey has already positioned itself as a global brand."
  },
  {
    "headline": "How Helium Health assembled a star founding team",
    "summarized_story": "Nigerian healthtech startup, Helium Health, navigated this challenge in its early days by putting together a team of first employees that got the job done.\nHelium Health was co-founded by Adegoke Olubisi, Dimeji Sofowora, and Tito Ovia in 2016 to use technology to provide better healthcare services for Africans.\nIn 2020, Helium Health raised $10 million in Series A funding to expand its offering across African countries.\nOvia was named a Forbes 30 under 30 recipient and a winner of the Future Africa Award for Disruption for her work on African healthcare through Helium Health.\nOvia said that another challenge Helium Health faced in its early days was identifying the strength of each of its team members and only assigning related tasks to them."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Did you miss Apple’s first event of the year?\nI did, but I saw a recap and the best way to describe my reaction is..."
  },
  {
    "headline": "Protecting your mental health and privacy",
    "summarized_story": "Is mental health only related to mental illnesses?\nThis means that someone may have good mental health, no mental illness or be somewhere in between.\nHaving good mental health and no mental illness is at the top of the spectrum, while having poor mental health and a mental illness is at the bottom.\nWhile the people who are somewhere in the middle may have good mental health but a mental illness, they may also have poor mental health but no mental illness.\nConsequently, we must all strive to be at the top of the mental health spectrum which begins with prioritising your mental health as much as you do your physical and sexual health."
  },
  {
    "headline": "Nigeria has a new data protection enforcing body; here’s why you should care",
    "summarized_story": "Among other things, the statement credits the introduction of the Nigeria Data Protection Regulation (NDPR) and the National Digital Economy Policy and Strategy (NDEPS) with creating more awareness about data protection and resulting in the “datafication” of the Nigerian economy.\nAccording to the European Commission, “DPAs are independent public authorities that supervise, through investigative and corrective powers, the application of the data protection law.\nAccording to Suleiman’s statement, the NDPB would “support the process for the development of a primary legislation for data protection and privacy.”The race to a dedicated data protection and privacy law has taken several turns.\nFilled with false starts, the closest Nigeria has come to a law passed by the National Assembly was in 2018 with the Nigeria Data Protection Bill 2018.\nThe Bill provides a much more robust approach to data protection, providing for more categories of data than the NDPR, which appears to deal more with electronic data."
  },
  {
    "headline": "Building a tech startup with no-code tools",
    "summarized_story": "Building a startup with no-code toolsCross section of Ozi team.\nTwo University of Lagos (UNILAG) graduates — Adejumo Azeez and Israel Akpan — are building a tech startup without writing one line of code.\nAfter spending months looking for a developer to build their product, the duo resorted to no-code tools.\nBut even a startup built with no-code tools still has challenges.\nTheir startup, Ozi, can be described as a Communications as a Service product that Azeez and Akpan started in the university."
  },
  {
    "headline": "Nigeria faces fresh spike in food prices on rising diesel cost",
    "summarized_story": "The recent surge in the prices of diesel in Nigeria, Africa’s largest economy, has led to a fresh spike in food prices, dashing hopes of returning to a more stable market condition.\n“Diesel prices are surging and with this, we are going to see another fresh spike in food prices,” said Victor Iyama, national president of the Federation of Agricultural Commodity Association of Nigeria (FACAN).\n“Since diesel prices started surging, the cost of food transportation has doubled and this has already started affecting commodity prices,” Faseru said.\n“Logistics is already a big challenge in Nigeria and now with the surge in diesel prices, it has further compounded the problem.\n“The recent increase in diesel prices is responsible for the current spike in food prices."
  },
  {
    "headline": "Nigeria should expect food scarcity by June – Dangote",
    "summarized_story": "Nigeria should expect an outbreak of food scarcity in the next three months as adverse consequences of the Russian-Ukraine war begin to come home to roost, Aliko Dangote, chairman, and chief executive of Dangote Group has said.\nThere will be a scarcity of food because people will not be able to access fertilizers going forward.\nBut we may not see the effects now but in the next two to three months, it will reflect,” Dangote said.\nFor instance, Nigeria imported N898.2 billion worth of wheat in nine months that ended September 2021.\nThe top origins of wheat in Nigeria in 2021 included the USA, N194.2 billion; Canada, N136.4 billion, Russia, N124 billion, Lithuania, N122.3 billion and Latvia, N115.9 billion."
  },
  {
    "headline": "What Vietnam’s 20,000 GWh power generation teaches Nigeria",
    "summarized_story": "17 years after a major policy rethink, Vietnam’s power sector has risen to around 48,000MW while Nigeria is still struggling with a long list of excuses and billion-dollar losses to show for it.\nVietnam, a country with a population less than half of Nigeria generates over 20,000 GWh due to a major policy rethink that revolutionised its power sector.\nThese electricity Laws formalise the shift of the electricity sector to a market economy and diversify forms of ownership and management of electricity generation, wholesale and retail.\n“Vietnam’s policies are to liberalise the electricity market and encourage foreign investors to invest in the market,” Omontuemhen explained.\nSpecifically, nuclear power stations were included in the national power development strategy for the period 2012 to 2020, according to which five nuclear power stations will be put into operation from 2020 to 2030."
  },
  {
    "headline": "Obaseki advances on execution of transport masterplan, to construct three more bus terminals in Edo – Nigerian Observer",
    "summarized_story": "Obaseki advances on execution of transport masterplan, to construct three more bus terminals in EdoShare FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said the state is making remarkable progress with the execution of the state’s transport masterplan, noting that three more ultra-modern bus terminals will be developed across different locations in the state.\nThe project was commissioned on Thursday, March 10, 2022, by the Edo State Governor, Mr. Godwin Obaseki and the National Chairman of the Peoples Democratic Party (PDP), Sen. Dr. Iyorchia Ayu.\nSpeaking to journalists at the weekend, Obaseki said the government is systematically executing the newly-developed Edo transport master plan to improve the state’s transportation sector and ensure a modern, effective and efficient transport system.\nAccording to him, “We have undertaken a transportation study and decided to have several bus terminals, starting with the 700-capacity Benin Central Bus Terminal.\nWe are redesigning our roads to have bus stops and traffic lights, and move transport across the country through Edo State."
  },
  {
    "headline": "INTERVIEW WITH PROFESSOR ABHUERE ON 2023 PRESIDENTIAL ELECTION AND THE WAY FORWARD FOR EDO STATE. – Nigerian Observer",
    "summarized_story": "I set up a foundation which is called Centre for Child Care and Youth development where we try to put some of the ideas we believe in into practice.\nIt is for that reason I’m in Benin City, Edo state to see how the one in Uromi is faring.\nWe now came to 1993 election, the best ever conducted election that was annulled by the then military administration.\nIn my book the “Power of Youth” I try to explain why we must invest in the youth.\nSecondly, historically, when you tell the state not to participate, who will do the infrastructure development that bring, about other development."
  },
  {
    "headline": "2023: Akhabue’s Pragmatic Stake In Edo Central Senatorial Bid Gains Weight – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestTHE stage is gradually set for the ultimate senatorial slot for 2023 general election as Ehia Olu Akhabue stages pragmatic stake for Edo Central Senatorial District.\nWithout a doubt, his senatorial aspiration has changed the dynamics of the political superstructure of Edo Central Senatorial District where in recent past, our sons and daughters have been hoisting themselves up for political offices without integrity, required principles and solid agenda for viable and enduring community development.\nMany of the rural communities in Edo Central have no good roads, infact, they are such in a terrible state of disrepair that farmers face serious difficulties in getting their produce out of the communities to market places in urban areas.\nThat is part of what Engr Akhabue is out to restructure to the utmost benefits of everyone in Esanland.\nOnce that is done, in addition to the water project, the people would have achieved a reasonable level of rural – urban fusion."
  },
  {
    "headline": "Nigeria Announces Six-Nation Women’s T20I Cricket Tournament in Lagos – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Nigeria Cricket Federation has announced a six-nation T20 International Cricket Tournament holding from March 26th to April 4th, 2022 at the newly resurfaced Tafawa Balewa Square Cricket oval in Lagos.\nPresident of the Federation, Uyi Akpata said that the event will feature Rwanda, Ghana, Sierra Leone, The Gambia, Cameroon along with the host country Nigeria.\n“Our female national team has been one of the most improved of all our national teams in the last five years and our gender inclusion development agenda has thrown up massive talents that have left us with an ever-improving side.\nNigerian international, Blessing Etim, will be the captain of the female Yellow-Greens (as the national team is called) and hoping to be making her experience count for the national team as the event gets underway in Lagos.\nEvery match at the event will also count for each team’s T20 ranking point on the International Cricket Council’s log."
  },
  {
    "headline": "It’ll model hard work in Nigeria – Obasanjo backs Igbo presidency",
    "summarized_story": "Nigeria’s former president, Chief Olusegun Obasanjo, has thrown his weight behind the agitation for a Nigerian president of Igbo extraction in 2023, noting that the Southeast zone had a lot to bring to the table.\nAccording to him, it was time for reconciliation in Nigeria by supporting a president from the Southeast region to emerge in 2023.\nThe former president stated that southeasterners can bring a lot to the table if elected.\n“Beyond bringing unity to Nigeria or being the cement that holds Nigeria together, I believe that Southeasterners can model hard work and entrepreneurship.\n“This will help in wealth creation and fight against poverty, which is ravaging Nigeria,” Obasanjo said."
  },
  {
    "headline": "Fidelity Bank Celebrates 2022 IWD with Financial Support to Women-Owned Businesses, Girls’ Academy",
    "summarized_story": "Indeed, a recent PwC Nigeria report indicated that 41 percent of micro-businesses in Nigeria are run by women, with over 23 million female entrepreneurs operating in this segment.\nThis exemplifies not only our drive as women but the immense value we bring to the table.\nTherefore we are sponsoring five female-led enterprises today with a total sum of 5 million naira for training female apprentices.\nFidelity Bank is a full-fledged commercial bank operating in Nigeria with about six million customers who are serviced across its 250 business offices and digital banking channels.\nIn 2021, the bank was recognised as the “Fastest Growing Bank” and “MSME & Entrepreneurship Financing Bank of the Year” at the 2021 BusinessDay Banks and Other Financial Institutions (BAFI) AwardsFacebook Notice for EU!"
  },
  {
    "headline": "The Oak Holdings launches in Nigeria’s financial market with 4 firms",
    "summarized_story": "The Oak Holdings, a hybrid financial institution group, has launched into the Nigerian financial industry with Oak Homes, The Oak Capital, The Oak Digital Bank and The Oak Asset Management to provide services to different clients in the financial services industry.\nAccording to the Founder, The Oak Capital seeks to back audacious, young entrepreneurs who are solving critical problems across different sectors in Africa, by providing pre-seed and seed stage funding.\nOlusanya observed that with access to credit being a major deficiency for SMEs, the Oak Digital Bank proposes value to its clients with strong inclination to have zero deficiencies.\nElias Rassi, COO, Oak Homes; Andrew Idechi, COO , The Oak Digital Bank; Oladimeji Kuforiji, Legal Counsel.\nOthers are Lucky Oboh; Head, Treasury, Oyedade Shokunbi, Venture Capital team Lead, among others."
  },
  {
    "headline": "Don’t tar Tinubu with Oluomo’s brush",
    "summarized_story": "There is always a tendency by Tinubu haters, and they are legion to make him bear vicariously the sins of others.\nYesterday, the National Union of Road Transport Workers allegedly suspended its Lagos State chapter’s Chairman, Musiliu Akinsanya, aka MC Oluomo, indefinitely.\nThis is an uncanny remark that Tinubu needs to distance himself from for the sake of his political ambition and reputation.\n“Your orchestrated plan to attack branches that may disobey your orders aforesaid will ultimately endanger public peace and order in Lagos state.\nThe announcement came after the national leadership of the union earlier on Thursday suspended the chairman of the Lagos State chapter, Musiliu Akinsanya."
  },
  {
    "headline": "Rivers: Family Sues Monarch Over Eze-Ogba Chieftaincy Stool",
    "summarized_story": "The Umuebe family in Omoku Town in Ogba/Egbema/Ndoni local government area of Rivers State, has dragged the traditional ruler of Ogba Kingdom, Eze Nwachukwu Nnam-Obi, to Omoku High Court over the Eze-Ogba chieftaincy stool.\nAlso joined in the suit were the governor of Rivers State, the State’s Attorney-General, the Rivers State Ministry of Chieftaincy and Community Affairs and the chairman of Ogba/Egbema/Ndoni local government area of the state.\nNnam-Obi ascended the throne of Eze-Ogba of Ogbaland in October 2021, after the death of his father, late Eze Chukwumela Nnam-Obi II, who was on the throne for over 50 years.\nThe Umu-Okoya kindred of Umuebe family had insisted that the incumbent was not the rightful person to occupy the Eze-Ogba stool, as the ancient stool was not hereditary but rotational.\nThey were also seeking for Court declaration that the throne and chieftaincy stool of Eze Ogba of Ogbaland is not hereditary."
  },
  {
    "headline": "FCCPC Act: Commission Meets Artisans, Allied Service Providers",
    "summarized_story": "The Federal Competition and Consumer Protection Commission (FCCPC), on Thursday, in Abujaorganised a one-day nationwide workshop for artisans and allied service providers to discuss the impact of the FCCPC Act 2018 on the sector’s growth in the country.\nAccording to him, following the expository workshop, the usual knee-jerk approach of resolving issues between artisans,allied service providers and consumers in general spheres would no longer apply as behaviours that had hitherto, ran foul of the FCCPC Act 2018, will no longer be overlooked.\nHe said the Commission will henceforth, apply the tools of regulation and enforcement in the sector.\nADVERTISEMENTIrukera, therefore, called on artisans and allied service providers to register properly with their umbrella associations in order to enable a collective pool of data that will ensure that the bad eggs among them are fished out when issues arise.\nHe further emphasised the need for them to magnify their reach online and, in turn, expand their customer base, increase their sales and profits."
  },
  {
    "headline": "2023: Nothing Bars Emefiele From Contesting Presidency – NPQ",
    "summarized_story": "The Nigerian Patriotic Quest (NPQ) has said the Central Bank of Nigeria (CBN) governor Godwin Emefiele is qualified to contest for the presidency in 2023, adding that attempts to intimidate him out of the race won’t work.\nMost of these contributions are an amalgam of baseless insinuations and innuendos against Godwin Emefiele.\n“These are the qualities that have inspired a large number of people and organisations to selflessly deploy their own resources in advocating for the candidacy of Emefiele as a suitable presidential candidate come 2023 elections.\n“Inspite of these qualities and achievements, some analysts in the media are fixated with justifying why Emefiele should not run.\nThe illogical arguments against the candidacy of Godwin Emefiele has reinvigorated our campaign for him to be part of the answer to the presidential question come 2023."
  },
  {
    "headline": "Sack: Ex-SSG Calls For Calm Over Umahi, Others",
    "summarized_story": "A former Secretary to the Ebonyi State Government, Prof. Benard Odoh, has appealed to the people of the State to remain calm and law-abiding over the judgment of an Abuja Federal High which ordered the Governor David Umahi and his deputy, Eric Kelechi Igwe, to vacate their offices for defecting to the ruling All Progressives Congress (APC).\nThe presiding Judge, Justice Inyang Ekwo, had also declared vacant, the seats of the Speaker of the State House of Assembly, Rt.\nOgbonnaya Nwifuru and 16 other members of the House, who also defected with the governor to the APC.\nNoting that there has not been a judicial precedent of its kind since the advent of the 4th Republic, hence the varied interpretations and reactions greeting the verdict, Odoh remarked that “for reasonable and discerning minds, however, the prevailing situation, including the varied interpretations are yet all within the confines of what democracy permits.”He added, “While I appeal for calm on the part of fellow Ebonyians, urging them to keep their hopes for a better democratic governance alive, it is, however, needful to recall that since the November 17th, 2020 defection of Umahi and his Deputy to the ruling APC, a simmering relationship between him and his erstwhile People’s Democratic Party (PDP) leaders has only headed for the worse.\nADVERTISEMENT“All of which has been to the detriment of the delivery of some meaningful, purposeful and credible democracy dividends for the common Ebonyian.”ADVERTISEMENT"
  },
  {
    "headline": "APC Emergency NEC: INEC Rejects Gov Bello’s Invitation",
    "summarized_story": "The Independent National Electoral Commission (INEC) has rejected an invitation to an emergency meeting of the National Executive Committee (NEC) of the governing All Progressives Congress (APC).\nThe Commission said the party violated 21-day notice required by the new Electoral Law for such meeting.\nINEC also said the letter sent to it was not signed by the known chairman and secretary of the APC Caretaker/ Extra-Ordinary Convention Planning Committee (CECPC) of the party.\nADVERTISEMENTIt said the letter contravenes the provision of Article 1.1.3 of the Commission’s Regulations and Guidelines for Political Party Operations (2018).\n“While hoping these issues are noted for compliance, please accept the assurance of the Commission’s warm regards.”"
  },
  {
    "headline": "Biden announces new crushing sanctions on Putin's Russia",
    "summarized_story": "And Putin must pay a price,” Biden said at the White House, noting he had earlier spoken by phone to Ukraine President Volodymyr Zelenskiy.\nBut Biden criticised voices in the United States clamouring for an active U.S. military presence in Ukraine or U.S. backing of a “no-fly zone” to protect Ukrainians from the Russian onslaught.\nThe United States has expressed fears that Russia could be paving the way for a chemical weapons attack, without citing evidence.\nThe United States is expanding sanctions on Russia to include executives of sanctioned banks and Russian banker Yuri Kovalchuk, as well as Russian lawmakers.\nThe United States imported $1.2 billion in Russian fish and shellfish in 2021, according to the U.S. Census Bureau, including sturgeon black caviar."
  },
  {
    "headline": "Deutsche Bank backpedals out of Russia",
    "summarized_story": "Deutsche Bank, made a volte face within hours Friday by deciding it would wind down its business in Russia, following stinging criticism from some investors and politicians.\nDeutsche had resisted pressure to sever ties, arguing that it needed to support multinational firms doing business in Russia.\n“We are in the process of winding down our remaining business in Russia while we help our non-Russian multinational clients in reducing their operations,” the bank said.\n“There won’t be any new business in Russia,” Deutsche said.\nA day earlier, Deutsche Bank’s Chief Executive Christian Sewing explained to staff why the bank was not withdrawing."
  },
  {
    "headline": "34 Minutes Of Madness: ‘Big Woman’ Stops Bankers From Doing Anything, Demands Refund Of Her N100k In Video",
    "summarized_story": "34 Minutes Of Madness: ‘Big Woman’ Stops Bankers From Doing Anything, Demands Refund Of Her N100k In VideoA ‘big woman’ went nuts in her attempt to address a problem at a banking hall, causing a ruckus.\nThe woman took matters into her own hands by physically interfering with bankers’ ability to serve other customers.\nInstead, the obviously irritated woman claimed, bankers kept forcing her to return to the bank and go through procedures that rarely deliver the desired outcome.\nThe woman was enraged even more by the push from bankers, security staff, and other worried customers to arrest the situation, which lasted for 34 minutes.\nWatch video below:https://m.facebook.com/hammid.bakare/videos/1057559918128687/?locale2=en_USAbu AbdurRahman said:“I used an ATM machine in Zenith Bank Kano Road Sokoto in 2012."
  },
  {
    "headline": "BREAKING: Lagos Reacts To Allegation Of Giving MC Oluomo Appointment After Suspension From Road Transport Union",
    "summarized_story": "BREAKING: Lagos Reacts To Allegation Of Giving MC Oluomo Appointment After Suspension From Road Transport UnionThe Lagos State Government has denied claims that it cleared Musiliu Akinsanya, aka MC Oluomo, for the position of General Manager of the Lagos State Parks and Garages Committee.\nMC Oluomo’s son, King West, announced on Instagram that his father had been appointed General Manager of the Lagos State Parks and Garages Committee, according to a report.\nHe said: “Please disregard post(s) claiming that Governor Babajide Sanwo-Olu has appointed suspended Chairman of NURTW, MC Oluomo as GM, Lagos Transport Parks and garages committee.\nFor several weeks, there has been a crisis in the union, which ended in the national organization suspending MC Oluomo, the Chairman of the Lagos State chapter of the union.\nFollowing his suspension, MC Oluomo announced the state chapter of the union’s departure from the national body and requested that the state government take over the union’s business in its jurisdiction."
  },
  {
    "headline": "BREAKING: Lekan Balogun Installed As 42nd Olubadan Of Ibadan",
    "summarized_story": "In a colorful ceremony in Ibadan, the capital of Oyo State, Chief Lekan Balogun was crowned the 42nd Olubadan of Ibadan.\nVice President Yemi Osinbajo, Chairman of the Governors Forum Governor Kayode Fayemi, Governor Dapo Abiodun, the Ooni of Ife, Oba Adeyeye Ogunwusi, the Alaafin of Oyo, Oba Lamidi Adeyemi, and the Sultan of Sokoto, Sa’ad Abubakar were among those in attendance.\nRauf Olaniyan, the Deputy Governor of Oyo State, and Adebo Ogundoyin, the Speaker of the state House of Assembly, were also present.\nBalogun was given the staff of office as well as the instrument of office, making him the new Olubadan of Ibadan.\nThe new monarch in his address, said, “I will not let Ibadan down, I will not let Nigeria down, I thank Vice-President who came to represent the President, the former Vice President, the Ooni, Alaafin and other dignitaries present here.”"
  },
  {
    "headline": "BREAKING: Bamise’s Murder: Court Remands Suspected Killer-Bus Driver",
    "summarized_story": "Andrew Nice Omininikoron has been remanded in custody till April 11, 2021, by a magistrate court in Yaba, Lagos.\nOmininikoron is the driver of the BRT bus that was stopped in relation with the death of Bamise Ayanwole, a 22-year-old woman.\nAfter the 22-year-old fashion designer’s family reported her missing on February 27, Omininikoron was apprehended.\nOn February 26, Bamise reportedly boarded a BRT bus from Chevron Bus Stop in Ajah to Oshodi approximately 7 p.m.\nThe bus driver, Nice Andrew Omininikoron, was apprehended by the authorities and has since remained in their custody."
  },
  {
    "headline": "Breaking: Chile swears in 36-year-old Gabriel Boric as President",
    "summarized_story": "Chile has sworn in its youngest-ever president, Gabriel Boric, a former student activist who will take the reins as the South American nation is undergoing an important political and social transition.\nAt the Congress building in the port city of Valparaiso, Boric on Friday took the presidential sash from outgoing billionaire President Sebastian Pinera.\nBoric, 36, is taking over a country seeking change following mass 2019 protests, which he supported, against deep-rooted inequality in income, healthcare, education and pensions.\nPinochet removed socialist President Salvador Allende, who died by suicide in 1973 during a military coup and whose legacy Boric has often praised.\nThat was echoed by political analyst Claudia Heiss of the University of Chile."
  },
  {
    "headline": "No going back on Mar 26 convention, APC insists",
    "summarized_story": "…Says Buni remains our CECPC chair…INEC rejects Bello’s invitation to NEC meetingThe Caretaker/Extraordinary Convention Planning Committee (CECPC) of the All Progressives Party (APC) has insisted that nothing would change the party’s March 26 National Convention.\nHe said having already intimated INEC of its intent to conduct its national convention on February 26, which was moved March 26, adding that “what is required is simply a notice of adjustment and not a fresh 21-day notice.”“The Convention will be held on March 26.\nThe moment the CECPC agreed on March 26, that letter was written to INEC and they have accepted the letter.\nAnd now we have a Convention on March 26, the chairman wrote a letter for his leave to go for medical treatment.\nHe has a medical emergency that cannot wait for the Convention and we have a Convention that cannot wait for him to be healthy."
  },
  {
    "headline": "[Breaking] ‘Rape, murder’ of fashion designer: Court remands BRT driver",
    "summarized_story": "A Bus Rapid Transit (BRT) driver, Mr. Andrew Nice, has been remanded by a Yaba Magistrates’ Court in Lagos for 30 days over his alleged involvement in the death of his passenger, Oluwabamise Ayanwole.\nThe court order came following an a four-count charge application by the Police on alleged murder, sexual assault, misconduct and interference with a corpse.\nMr. Nice, a prime suspect reportedly connived and killed a 22-year-old Bamise who boarded a BRT in Lagos state.\nDetails loading…"
  },
  {
    "headline": "Bamise’s Murder: Court Orders Remand Of BRT Driver For 30 Days",
    "summarized_story": "A Magistrate Court at the Yaba area of Lagos has ordered the remand of a Bus Rapid Transit (BRT) driver, Mr. Andrew Nice, over his alleged involvement in the death of his passenger, Oluwabamise Ayanwola.\nMagistrate Omobola Salawu ordered the remand for 30 days following an application by the Police.\n“Lagos State Government is the franchisor of the franchise agreement of the Bus Rapid Transport which the Lagos Bus Services Ltd is executing.\nThe lawyer however said he could not give details of the evidence until it is tendered in court.\n22-year old, Bamise Ayanwola went missing after boarding a BRT bus on Saturday, Feb. 26."
  },
  {
    "headline": "Lekan Balogun Crowned 42nd Olubadan Of Ibadan Land",
    "summarized_story": "Oba Mohood Olalekan Ishola Balogun Alli has been crowned as the 42nd Olubadan of Ibadan land.\nThe official installation of the paramount ruler of Ibadan land held on Friday at the Mapo Hall in the Oyo State capital.\nOba Balogun ascended the throne to succeed the 41st Olubadan of Ibadan, Oba Saliu Adetunji, whose reign lasted almost six years.\nFollowing his death, Oba Balogun emerged as the next Olubadan, but not after a controversy over who would succeed Oba Adetunji.\nBut the controversy was finally put to rest last month after Governor Makinde named Oba Balogun as the next paramount ruler of Ibadan land, following a recommendation by the Olubadan-in-Council."
  },
  {
    "headline": "India Accidentally Fires Missile Into Pakistan",
    "summarized_story": "India’s military accidentally fired a missile into neighbouring Pakistan, New Delhi’s defence ministry said on Friday, calling it “deeply regrettable”.\nHindu-majority India and Muslim Pakistan have fought three wars since independence from British colonial rule in 1947, two of them over the disputed territory of Kashmir.\n“In the course of a routine maintenance, a technical malfunction led to the accidental firing of a missile” on Wednesday, India’s defence ministry said.\nREAD ALSO: Russia, Ukraine In High-Level Talks After Hospital Attack Sparks FuryIt did not specify the type of missile, but said it landed “in an area of Pakistan”.\nThe defence ministry declined to provide further information to AFP."
  },
  {
    "headline": "Nothing Tangible Has Happened Despite Warning Strike – ASUU",
    "summarized_story": "The President of the Academic Staff Union of Universities (ASUU), Professor Emmanuel Osodeke, has stated that nothing progressive has emerged to see an end to the warning strike embarked upon by the body.\nProf. Osodeke, who was a guest on Channels Television’s show, Sunrise Daily, expressed his disappointment at the state of affairs and the government’s inability to fulfill the promises it made two years ago.\n﻿“I can assure you nothing tangible has happened, nothing visible; nothing you can say has been done,” the ASUU president said during the breakfast show.\nIf a program is passed through an end-user test and it scores 88%, would you say it failed?\nHe was also critical of the government’s nudge towards a platform that hasn’t been tested in the country as one that had been developed locally."
  },
  {
    "headline": "Chelsea Accounts Suspended As Sanctions Take Hold",
    "summarized_story": "Chelsea have had several accounts and credit cards suspended temporarily following sanctions imposed on club owner Roman Abramovich by the UK government, British media reported Friday.\nRussian-born billionaire Abramovich had all his British assets frozen on Thursday barring Chelsea, with the Premier League club allowed to continue with “football-related activities”.\nAbramovich, 55, was one of a further seven more oligarchs hit by fresh UK sanctions on Thursday following Russia’s invasion of Ukraine.\nAbramovich had already announced he was willing to sell Chelsea, who won 19 major trophies in his 19-year reign.\nChelsea put their off-field turmoil to one side to beat Premier League strugglers Norwich 3-1 on Thursday."
  },
  {
    "headline": "INEC letter: Bello's CECPC makes u-turn, says Buni still in charge -",
    "summarized_story": "Since the inception of this CECPC on June 25, 2020, whenever the chairman is not around and Governor Sani Bello is around, he acts on behalf of all as the Chairman.\n“So, one has to leave for the other, whichever, he has transmitted a letter and Governor Sani Bello has been acting appropriately.\n“As part of efforts towards the hitch-free conduct of the March 26th National Convention of the All Progressives Congress (APC), the Caretaker/Extraordinary Convention Planning Committee (CECPC) stepped up preparations this week.\nThe purpose is to ensure speedy execution of the various activities leading to the National Convention on March 26, 2022.\nHe assured that the March 26th National Convention was on course and sacrosanct."
  },
  {
    "headline": "Updated: APC denies writing INEC on emergency NEC meeting -",
    "summarized_story": "The All Progressives Congress, APC has described as figment of imagination, the purported letter written to the party by the Independent National Electoral Commission (INEC) on the need to give the Commission a 21-day notice for its national convention slated for March 26.\nEarlier, there were media reports that the commission had rejected a letter allegedly written by the APC Caretaker Committee requesting it to monitor its emergency NEC meeting.\nIn the latest development, the ruling party said neither the new acting chairman nor the secretary wrote the electoral umpire."
  },
  {
    "headline": "Reps call on security chiefs to stem renewed banditry attacks in Benue",
    "summarized_story": "Reps call on security chiefs to stem renewed banditry attacks in Benue"
  },
  {
    "headline": "INEC reportedly rejects APC's letter to monitor emergency NEC meeting -",
    "summarized_story": "The Independent National Electoral Commission has reportedly rejected a letter inviting it to an emergency meeting of the National Executive Committee of the All Progressives Congress.\nINEC’s response, dated 9th March 2022, signed by the Secretary to the Commission, Rose Oriaran Anthony and was titled, “Re: Invitation to the emergency meeting of the National Executive Committee”, and addressed to the National Chairman, APC CECPC.\nThis, it said, was contrary to the provision of the Article 1.1.3 of the Commission’s Regulations and Guidelines for Political Party Operations (2018).\nINEC’s letter read, “Please refer to your letter Ref.APC/NHDQ/INEC/019/022/32, dated 8th March 2022.\n“While hoping these issues are noted for compliance, please accept the assurance of the Commission’s warm regards.”"
  },
  {
    "headline": "“South-west of Nigeria is Ready for 2023 Elections”- Adeseye Ogunlewe",
    "summarized_story": "Governors Nasir el-Rufai of Kaduna State and Rotimi Akeredolu, SAN, of Ondo State, confirm earlier media reports, which expose the antics employed by their Yobe State counterpart, Mai Mala Buni, to scuttle the national convention of the All Progressives Congress.\nAccording to party sources, the governors in the Buni camp are planning to jet out to London where they will try and meet with Buhari and attempt to convince him to reverse the Yobe State governor’s ouster as the caretaker chairman of the APC.\nThe sources informed this network that the Buni-led governors intend to employ all sorts of tactics when they meet Buhari, including threatening to defect from the APC to the Peoples Democratic Party.\nTo discuss unfolding developments and what the APC should be doing to block further attempts to scuttle its convention and other pre-election activities, is Senator Adeseye Ogunlewe, former Minister of Works and a member of the ruling party."
  },
  {
    "headline": "School Abroad: Nigerian Politicians Accused Of Sabotage – Trending With Ojy Okpe",
    "summarized_story": "In the wake of the ongoing Strike by the Academic Staff Union of Universities a bill seeking to prevent public officers from sending their children to schools overseas was rejected by Lawmakers on the 3rd of March.\nA video showing Commuters on a Lagos-Ibadan train stranded in a forest after their train stopped abruptly because it ran out of diesel has gone viralIn a recent interview with the BBC Yoruba,Tiago Isola a Portuguese boy who is fluent in the Yoruba Language shared his love for the language and culture.\nIn another development, a video of a Nigerian Born Delta Air Lines Captain who stunned passengers on a Flight From Atlanta To Lagos when he announced that he was Piloting the Plane To Nigeria For The First Time while speaking in Yoruba has made the rounds on social media"
  },
  {
    "headline": "Only PDP Can Rescue Nigeria, Edo Governor Obaseki Says",
    "summarized_story": "Edo State Governor, Mr. Godwin Obaseki, on Thursday, led leaders and members of the Peoples Democratic Party (PDP) in the state to receive the National Chairman of the party, Dr. Iyorchia Ayu, declaring that only the PDP could rescue Nigeria from its current socio-economic woes.\nPDP is the party of Edo; PDP is in the DNA of Edo, and we do not want that to change.\n“The only issue is the small quarrel in Edo PDP.\nI want to assure you that by next week, all the issues in Edo PDP will be resolved.\n“I heard that Chief Dan Orbih went around, saying there is no harmonisation in Edo PDP."
  },
  {
    "headline": "Nigeria Seeks US Funding for Development of Natural Gas",
    "summarized_story": "Nigeria’s Minister of State, Petroleum Resources, Mr Timipre Sylva, on Thursday called on the United States Government to provide funding support for Nigeria to develop its natural gas resources.\nThe challenge for us to achieve this feat has been lack of infrastructure and we need funding to development infrastructure for our gas and we believe that the US can provide that funding,” Sylva stated.\nSylva therefore called on the US to provide the needed funding for infrastructure for the exploitation of the huge natural gas in Nigeria.\n“Nigeria has over 206 tcf of natural gas reserve and unproven reserve of 600 tcf and we believe that if we target exploitation of natural gas in Nigeria, we will be able to get up to 600 tcf.\nWe need to have the needed funding to develop our gas and the US can provide us this funding,” he added."
  },
  {
    "headline": "Volume of Nigeria, Korea Bilateral Trade Hits $2bn",
    "summarized_story": "The Republic of Korea has disclosed that the volume of trade between the country and Nigeria last year rose to $2 billion.\nHe said the bilateral trade figure was a 50 per cent increase in compared to that of 2020.\n“I hope that this year our bilateral trade rises further and at the end of the day I want to see Nigeria become Korea’s biggest trading partner in Africa.\nNigeria is the biggest economy in Africa, so it should be Korea’s number trading partner among Africa’s countries,” Kim said.\nThe project is expected to enhance Nigeria’s e-Government implementation system through the update of the current Nigeria’s e-Government Master Plan (NeGMP), upgrade of Nigeria’s Enterprise Architecture and development of a 10-year eGovernment Implementation Plan."
  }
]