[
  {
    "headline": "Electoral bill: National Assembly’ll remove direct primary clause, says – Gbajabiamila",
    "summarized_story": "The Speaker of the House of Representatives, Mr Femi Gbajabiamila, has said the National Assembly will revisit the Electoral Act Amendment Bill and remove the direct primary clause in it after it resumes from recess.\nGbajabiamila, while unveiling some projects in Surulere, Lagos State, on Thursday, also ruled out the possibility of the National Assembly vetoing the bill earlier rejected by the President, Major General Muhammadu Buhari (retd.).\nHe said, “If you follow the history of the amendment of the direct and indirect primary bill, I initiated that amendment bill for a good reason and it is for people to participate in elections.\n“For me, it does not make sense that these people do not have a voice in who represents them.\nWe will sit as the National Assembly, look at the reasons and at that point, consider removing that clause and pass the bill so that we do not throw away the baby with the bathwater."
  },
  {
    "headline": "Makinde’s loyalists kick as APC carpets gov over insecurity, infrastructure",
    "summarized_story": "The All Progressives Congress has said the administration of Governor Seyi Makinde has performed abysmally low in terms of provision of adequate security and infrastructural development in Oyo State.\nThe statement read in part, “The government of Seyi Makinde claimed to have procured fire fighting vehicles from Turkey for about one year without functioning.\n“If there is one sector the people of Oyo State are anxiously praying for the fast-tracking of the terminal date of this government, it is security.\nGovernor Makinde chose to celebrate his birthday in Saki, Oke Ogun, what followed was mayhem – maiming and killings.\n“Can the people of Oyo State forget the wanton overnight destruction of Igangan town in the Ibarapa area of Oyo State on the dawn of June 6, 2021?"
  },
  {
    "headline": "Tinubu condoles Ganduje, Sharia council over Datti Ahmed",
    "summarized_story": "Bola TinubuTHE All Progressives Congress National Leader, Asiwaju Bola Tinubu, has commiserated with Kano State Governor Abdullahi Ganduje and the Supreme Council for Sharia in Nigeria over the death of Elder-statesman and President of the council, Dr. Datti Ahmed.\nIn a condolence message by his Media Office, yesterday night, Asiwaju Tinubu said: “I received the news of the death of Dr. Ibrahim Datti Ahmed, elder-statesman and President of the Supreme Council for Sharia in Nigeria (SCSN), with deep sense of sorrow.\n“As a first generation medical doctor from Kano State, Dr. Ahmed dedicated his life to the service of humanity.\n“The death of Dr. Ahmed is a great loss to the medical community in Nigeria and the comity of Islamic scholars.\nMy condolences to his family, Kano State Governor Abdullahi Ganduje, the government and people of the state, Muslims across the country, and Nigerians, as a whole.’’"
  },
  {
    "headline": "Lassa Fever: Case toll jumps to 92, as new deaths recorded in Bauchi, Ebonyi",
    "summarized_story": "Lassa FeverThe death toll for Lassa Fever in Nigeria from January 2021 has jumped to 92, with Bauchi and Ebonyi States recording new deaths.\nThe number of new confirmed cases, the agency stated, is the same as the figure reported in the previous week.\n“In total for 2021, 17 states have recorded at least one confirmed case across 66 Local Government Areas,” it said.\n“Of all confirmed cases, Edo has (43 per cent), Ondo (35 per cent), and Taraba (five per cent).\nThe male to female ratio for confirmed cases is 1:0.9."
  },
  {
    "headline": "IGP Order’s Posting of CP Edward Egbuka as Commissioner of Police, Kogi State",
    "summarized_story": "**Charges Kogi Citizens to support the Police for improved securityBy Kingsley OmonobiThe Inspector-General of Police, IGP Usman Alkali Baba has ordered the immediate posting of CP Edward Chuka Egbuka to Kogi State Command as the new Commissioner of Police (CP) in- charge of the State.\nThe posting follows the redeployment of CP Idrisu Dabban Dauda to the Force Headquarters for other national engagements.\nThe new Commissioner of Police, CP Egbuka, who was until this deployment the Commissioner of Police in charge of Communications at the Force Headquarters, was appointed into the Nigeria Police Force in 1988.\n“He was the immediate past Commissioner of Police in Charge of Plateau State Police Command.\nHe further called on the Government and good people of Kogi State to give the new Police chief maximum support and collaboration in his new role."
  },
  {
    "headline": "Benue NSCDC recovers corpses of missing Christmas Day fun-seekers from River Buruku",
    "summarized_story": "By Peter DuruThe Benue state Command of the Nigeria Security and Civil Defence Corps, NSCDC, has said three corpses of supposed Christmas Day fun-seekers have been recovered from River Buruku after they were declared missing in Buruku Local Government Area of the state.\nThe Command in a statement issued Thursday in Makurdi by its Public Relations Officer, Deputy Superintendent of Corps, Michel Ejelikwu said the corpses were recovered after a search by divers.\nPart of the statement by the Command read, “On Friday December 24, 2021 at about 10:20am the Command got credible Intelligence about the illegal gathering of youths in hundreds of thousands at the River Buruku for what they termed as Picnic and Carnival.\n“The Benue State Government and the Tiv Traditional Council had at different intervals banned this Carnival owing to the negative vices that take place there.\n“However the youths still went ahead with the carnival."
  },
  {
    "headline": "Electoral Act bill: House will determine fate of direct primaries – Gbajabiamila",
    "summarized_story": "He also ruled out the possibility of the National Assembly vetoing the bill earlier rejected by President Muhammadu Buhari.\nHe said the President refused to sign the bill based on advise but insisted that the direct primaries clause was meant to ensure Nigerians participated in the electoral process.\nThe speaker said: “If you followed the history of the amendment of the direct and indirect primary bill, I initiated that amendment bill for a good reason and it is for people to participate in elections.\nHe has people who advised him and I guess they advised him against the amendment bill.\nI cannot read the minds of the whole National Assembly members."
  },
  {
    "headline": "Gov Bello sets up board to help develop Suleja emirate in Niger State",
    "summarized_story": "Niger State Governor, Abubakar Sani Bello has set up a nine-man Board of Suleja Area Planning Development Authority as part of efforts to ensure the physical development of the Suleja Emirate.\nInaugurating the Board in Minna, Bello described the board as very important and critical to the development of Suleja Emirate in particular and the state in general.\nThe Governor revealed that members of the board were carefully selected for the job.\nResponding on behalf of other members of the board, the Chairman, Mrs Esther Bmitosahi expressed the readiness and commitment of members to discharge their responsibilities.\nWhile thanking the Governor for the opportunity to serve, she appealed to him to provide the board with office accommodation and other logistics to enable the board carry out its duties effectively."
  },
  {
    "headline": "Troops from Nigeria, Niger neutralize 22 Boko Haram, ISWAP fighters in Lake Chad",
    "summarized_story": "Multinational Joint Task Force (MNJTF) troops from Sector 3 Monguno (Nigeria) and Sector 4 Diffa (Niger) have neutralized Boko Haram, ISWAP terrorists in Lake Chad.\nThey buried Improvised Explosive Devices (IEDs) along routes and later attacked with Vehicle Borne Improvised Explosive Devices (VBIEDs).\nDuring debriefing at the MNJTF headquarters in Diffa, Niger, Force Commander (FC), Maj Gen Abdul Khalifah Ibrahim, hailed the troops.\nKaduna-born Gen Ibrahim, who took over in August 2021, commended them for their courage and gallantry.\nThe FC was accompanied on the visit by the Deputy Force Commander MNJTF, Gen Abdou Assoumane (Niger) and other top commanders."
  },
  {
    "headline": "Gov Ortom congratulates Och’Idoma-elect, Pastor John Elaigwu",
    "summarized_story": "Benue State Governor, Samuel Ortom, has congratulated the Och’Idoma-elect, Pastor John Elaigwu Odogbo, on his election as the 5th paramount ruler of the Idoma nation.\nGovernor Ortom said soon after the coronation of the new Och’Idoma, the Benue State Council of Traditional Rulers will be inaugurated for effective administration of the traditional institution in the state.\nIn a remark, the Och’Idoma-elect, Pastor John Elaigwu Odogbo pledged not to disappoint the confidence reposed in him through his selection.\nTeam leader of the selection committee, Chief Ekpe Ogbu while presenting the Och’Idoma-elect to the Governor said the election was transparent and peaceful.\nThe new Och’Idoma graduated from Ahmadu Bello University Zaria in 1994 with B.Sc honours in Accounting and aMaster in Business Administration from Benue State University in 2012."
  },
  {
    "headline": "Buhari, Goodluck Jonathan meet behind closed doors in Aso Villa",
    "summarized_story": "President Muhammadu Buhari on Thursday met former President Goodluck Jonathan behind closed doors at the Presidential Villa, Abuja.\nJonathan was appointed last year by the Economic Community of West African States, ECOWAS, as a special envoy to lead the sub-regional body’s mediation mission in Mali.\nHe regularly visits Aso Villa to brief President Buhari on his activities as ECOWAS Special Envoy to Mali.\nThis is coming less than a few months after both politicians met in Aso Villa.\nJonathan had visited Buhari at the State House in May to brief the President over the new political crisis in Mali."
  },
  {
    "headline": "153,000 out-of-school children return to classrooms in Bauchi",
    "summarized_story": "Not less than a total of 153,398 out of school children in Bauchi State have been enrolled in school under the Better Education Service Delivery for All (BESDA) programme in 16 out of the 20 local government areas of the state.\nAccording to Dahiru, BESDA was a World Bank programme in collaboration with both the Federal Government and Bauchi State government aimed at returning out of school children to school.\nHe said the programme catered for the welfare of pupils by providing conducive atmosphere for learning for them.\nThe local government areas, according to him, were Alkaleri; Bauchi; Dambam; Darazo; Itas Gadau; Misau; Katagum; Zaki; Shira; Giade; Jamaare; Toro; Dass; Ganjuwa; Ningi and Gamawa.\nHe informed that out of the number 488,300 were male, while 732,450 were female, adding that the state was expected to return at least a total of 153,398 to school."
  },
  {
    "headline": "MC Oluomo’s alleged bid to become Oba of Oshodi rejected",
    "summarized_story": "The alleged move by the Chairman of the National Union of Road Transport Workers (NURTW), Musiliu Akinsanya, to become the ‘Oba of Oshodi’ has elicited a flurry of reactions.\nA trending image of MC Oluomo in royal regalia seen by The Nation shared last month also stirred the controversy.\nBut The Nation learnt MC Oluomo is an Awori from Oshodi.\n- Advertisement -Also, it was gathered that MC Oluomo has been at the forefront of the struggle to upgrade the chieftaincy in Oshodi from Baaleship to Obaship for over a decade.\nOf recent, MC Oluomo has been trending on the social radar for different activities."
  },
  {
    "headline": "Southeast should produce President in 2023, says Ikpeazu",
    "summarized_story": "Abia State Governor Okezie Ikpeazu has said the Southeast deserves to produce President Muhammdu Buhari’s successor in 2023.\n”However, the question of Nigeria President of Southeast extraction is a national question that requires negotiation, discussion, and conversation with all parts of this country and I am least qualified to determine what happened in 2023.\nSo, these are my views about the Presidency.”On the role of political parties in the emergence of a desired Nigerian President, Ikpeazu said: “Political parties need to be sensitive to the feelings of the various contending forces because politics should not be a winner-takes-all thing.\n” Political parties should be alive to the sentiments and feelings of their members in taking decisions and going forward.\nWe can find people who listen.”The governor also spoke on the qualities that the 2023 presidential candidates must have and how the political parties may choose them."
  },
  {
    "headline": "Tinubu condoles with Ganduje, Sharia Council over Datti Ahmed’s demise",
    "summarized_story": "All Progressives Congress stalwart Asiwaju Bola Tinubu has commiserated with Kano State Governor Abdullahi Ganduje and the Supreme Council for Sharia in Nigeria over the death of elder statesman and President of the council, Dr. Datti Ahmed.\n“As a first generation medical doctor from Kano State, Dr. Ahmed dedicated his life to the service of humanity.\n- Advertisement -Read Also: Sharia council president Datti Ahmad is dead“As his name symbolises, Datti (The noble, in Fulfulde), nobility manifested in his character and conduct.\n“The death of Dr. Ahmed is a great loss to the medical community in Nigeria and the comity of Islamic scholars.\n“My condolences to his family, Kano State Governor Abdullahi Ganduje, the government and people of the state, Muslims across the country, and Nigerians as a whole."
  },
  {
    "headline": "Kano-Kaduna rail project to be ready by December 2022, says Amaechi",
    "summarized_story": "Minister of Transportation Rotimi Amaechi has said commercial activities will begin on the Kano-Kaduna rail line in December 2022.\nThe minister spoke in Kano while inspecting the project.\nThe Federal Government, the minister, said, has pumped over $400million into the three-year project.\nThe minister also revealed that the Federal Executive Council suggested that the contractors construct double tracks instead of the recommended single track.\nHe noted that the decision of the cabinet would affect the initial cost which was pegged at $1.2billion."
  },
  {
    "headline": "Buhari on NDDC audit: we will recover every stolen funds",
    "summarized_story": "Those seeking information on the forensic audit report submitted on the Niger Delta Development Commission (NDDC) got an answer from President Muhammadu Buhari yesterday.\nThe President said the report of the forensic audit was being reviewed for the purpose recovering stolen funds and recommending culprits for punishment.\n“The serial abuse, lack of delivery and what had become an entrenched institutional decay, was the reason I called for the forensic audit.\nHe said: “President Buhari is focused on development of Nigeria and the Niger Delta.\n“The three projects have one thing in common, they were all abandoned before the forensic audit,” he added."
  },
  {
    "headline": "Soldiers arrest 567 criminals in South-South in 2021 ― DHQ",
    "summarized_story": "From Molly Kilete, AbujaThe Defence Headquarters (DHQ), in Abuja Thursday said that soldiers on internal security operations in the Niger Delta region of the country have recorded tremendous successes with the arrest of 567 suspected criminals in the outgoing year 2021.\nSome of these activities include protection of Oil and Gas Facilities, Anti-Crude Oil Theft Operations and Clearance of Militants’/Pirates’ Camps as well as non-kinetic conflicts resolution.\nAs part of efforts to sustain the drive towards protecting oil facilities, the JTF SS OPDS partners with key oil industry players to save the crude oil pipelines from activities of criminals.\nNON-KINETIC CONFLICTS CONTAINMENT AND RESOLUTION EFFORTS OF THE JOINT FORCE8.\nThe OPDS has emplaced measures in conjunction with other relevant stakeholders and agencies to deal with such criminals more decisively than ever."
  },
  {
    "headline": "2022: Stay away from politicians, be ruthless with terrorists, bandits, violent criminals – Army Chief to newly promoted Generals",
    "summarized_story": "From Molly Kilete, AbujaThe Chief Of Army Staff( COAS), Lieutenant General Faruk Yahaya, has charged newly promoted Major Generals and Brigadier Generals in the Nigerian army to be ruthless and brutal with bandits, terrorists, kidnappers and other criminal groups terrorizing the peace of the country.\nWe must remain focused and remain and apolitical.\nIt rests on you and me and us all to remain focused and committed.\nIn a related development, the Chief of the Air Staff, Air Marshall Oladayo Amao, has charged newly Air Vice Marshals and Air Commodores in the Nigerian Air Force not to relent in their service to our fatherland.\nI therefore urge you to continue to put in your best and be selfless in your service for the greater good of the Nigerian Air Force and the Nation as a whole."
  },
  {
    "headline": "Road accident kills 4 in Rivers",
    "summarized_story": "From TONY JOHN, Port HarcourtFour persons have reportedly lost their lives in a fatal car crash on Rukpokwu-Igwuruta road in Ikwerre Local Government Area of Rivers State.\nPublic Relations Officer, Federal Road Safety Corps ( FRSC), Julian Eni, was said to have confirmed the incident.\nShe said the burnt vehicle and carcass of the victims have been evacuated from the scene of the accident.\nOmemma was reportedly stabbed by members of a suspected rival cult group on Wednesday, around Mile One, Diobu area in Port Harcourt City Local Government Area of the State.\nIt was learnt that Omemma’s death was a reprisal an earlier attack by his group against the rival group."
  },
  {
    "headline": "Buhari, Jonathan meet in Aso Rock",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari on Thursday received in audience Former President Goodluck Jonathan in State House, Abuja.\nThe purpose of Jonathan’s visit, who arrived the Presidential Villa at 3pm, was not known as at press time.\nHowever, Jonathan regularly comes to the villa to brief the president on his activities as ECOWAS Chief Mediator in Mali.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nDetails shortly…"
  },
  {
    "headline": "Bandits attack Zamfara community, kill district head, 2 sons",
    "summarized_story": "Bandits have attacked Gada community in Bungudu Local Government Area of Zamfara State, killing the District Head,Umaru Bawan-Allah, and his two sons.\nCommissioner for Information in Zamfara, Ibrahim Dosara, confirmed the attack hours after the incident.\nDosara, stated that apart from the killings, the bandits also razed down the house of the district head of the communityAccording to him, security agencies, including the Nigerian Air Force, were currently on the trail of the bandits.\nAccording to him, the armed men abducted many others from the community, in addition to killing of the district head of Gada and his two sons.\nGada community is about seven kilometres from Bungudu Town, the Headquarters of the local government ."
  },
  {
    "headline": "Buhari, Jonathan Meet in State House",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari on Thursday played host to his predecessor, Dr. Goodluck Jonathan, at the State House, Abuja.\nAlthough the agenda of the duo’s meeting was not made public, it might not be unconnected with mediatory works of erstwhile President Jonathan in the West African subregion.\nThe former President is known to frequent the Villa to brief the President on his activities as ECOWAS Special Envoy to Mali.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Osimhen Contracts COVID-19 Second Time, Pulls out of AFCON",
    "summarized_story": "The 23-year-old has reportedly cancelled his planned journey to his base in Naples, Italy for checkups on his cheekbone injury before flying to Cameroon for the tournament.\nIn a terse statement issued by Napoli Thursday, Osimhen was told to self-isolate in Nigeria while his scheduled checkup has been rescheduled for another time.\nVictor (Osimhen) is a very dedicated player.\nUntil this second COVID-19 positive test, Osimhen was planning a return journey to Naples to play the Juventus match on January 6.\nThere is no official statement yet from the NFF on whether Osimhen would be replaced in the squad."
  },
  {
    "headline": "Kukah: I’m Against Insecurity, Economic Woes, Not Buhari",
    "summarized_story": "The cleric also accused the president of lopsided appointments stressing that such has caused divisions and agitations in the country.\nHe noted that he had a cordial relationship with President Buhari, maintained that it was sycophants that were trying to sow seed of discord between him and the administration.\nHe said Buhari was right, noting that the issue of direct and indirect primaries should be left for political parties to decide.\nWhen asked how he intends to lift 50,000 Nigerians out of poverty, the cleric explained that he had mapped out empowerment program that will soon commence.\nHe said aside the empowerment program, there was also scholarship scheme ongoing by him."
  },
  {
    "headline": "Ibrahim Datti Ahmed (1936 to 2021)",
    "summarized_story": "The message was accompanied by photographs I took with the late Dr Ibrahim Datti Ahmed at his residence almost a decade ago.\n“Ah, you share the same name with the late Boko Haram founder”, said late Ahmed.\nMy relationship with Datti Ahmed dates to early 1991 when I was a fresh reporter with The Guardian newspaper.\nBorn in 1936 in Daigari, Kano, Datti Ahmed attended Barewa College before reading medicine at the University of Ibadan.\nOn that basis, the duo of Datti Ahmed and Baba-Ahmed approached President Goodluck Jonathan regarding their efforts and expressed the need for confidentiality."
  },
  {
    "headline": "With Rising Theft, Nigeria Records 193m Barrels of Crude Oil Deficit in 11 Months",
    "summarized_story": "However, meeting that target would be an uphill task as it has maintained an average of 1.25 million barrels in the last few months.\nEven then, NNPC and its partners pumped almost 1.4 million barrels daily, but that figure has slumped since the August 2021.\nOn a monthly basis, the figures further revealed a decline from January as production was 42.1 million barrels for that month; in February it was 39.8 million barrels while in March, Nigeria pumped 44.2 million barrels, a relatively good month compared to the rest.\nBut April saw the country produce 41.1 million barrels; it was 41.6 million barrels in May; 39.4 million barrels in June; 41 million barrels in July, before it began a downward spiral till now.\nIn addition, 38.4 million barrels were pumped from around 30 Nigeria’s terminals and streams in August, 37.4 million barrels in September, 38 million barrels in October and 38.2 million barrels in November."
  },
  {
    "headline": "BREAKING: Legendary Singer, Victor Uwaifo Dies At 80",
    "summarized_story": "Nigeria’s legendary singer and guitarist, Sir Victor Uwaifo, is dead.\nThe ‘Guitar boy’ as he was fondly called celebrated his 80th birthday in March.\nUwaifo is also the first professional musicians to be awarded with the National Merit Honours of Member of the Order of the Niger (MON).\nHe was the winner of the first gold disc in Africa (Joromi) released in 1965 and seven other gold discs in Guitar boy, Arabade, Ekassa series and Akwete music.\nHe recorded under the name Victor Uwaifo and His TItibitis."
  },
  {
    "headline": "BREAKING: Legendary Singer, Victor Uwaifo Dies At 80",
    "summarized_story": "Nigeria’s legendary singer and guitarist, Sir Victor Uwaifo, is dead.\nThe ‘Guitar boy’ as he was fondly called celebrated his 80th birthday in March.\nUwaifo is also the first professional musicians to be awarded with the National Merit Honours of Member of the Order of the Niger (MON).\nHe was the winner of the first gold disc in Africa (Joromi) released in 1965 and seven other gold discs in Guitar boy, Arabade, Ekassa series and Akwete music.\nHe recorded under the name Victor Uwaifo and His TItibitis."
  },
  {
    "headline": "Banky W Attacks Buhari's Government For Arresting Sowore",
    "summarized_story": "Musician, Bankole Wellington better known as Banky W, has condemned the Nigerian Government for its gross human rights violation against citizens.\nHe also accused Nigerians of being too complacent in moments when they should act.\nBanky W made his position known in a music video posted on his Instagram page with hashtag #BetterChallenge.\nHe said, “You see the story is the same old one, you want change but you won't vote?\nNa double wahala for everybody.”The video went on to show CCTV footage of Sowore's arrest by operatives of the Department of State Services in Lagos on August 3."
  },
  {
    "headline": "Banky W Attacks Buhari's Government For Arresting Sowore",
    "summarized_story": "Musician, Bankole Wellington better known as Banky W, has condemned the Nigerian Government for its gross human rights violation against citizens.\nHe also accused Nigerians of being too complacent in moments when they should act.\nBanky W made his position known in a music video posted on his Instagram page with hashtag #BetterChallenge.\nHe said, “You see the story is the same old one, you want change but you won't vote?\nNa double wahala for everybody.”The video went on to show CCTV footage of Sowore's arrest by operatives of the Department of State Services in Lagos on August 3."
  },
  {
    "headline": "American Rapper, Dr Dre To Pay N57 Billion To Ex-wife, Nicole Young In Divorce Settlement",
    "summarized_story": "An American rapper, Dr Dre has settled with his estranged wife in court to pay her a sum of $100 million (approximately N57 billion).\nThe popular music producer will pay his ex-wife $100 million, and will pay the first $50 million now and the second half a year from now.\nShe is expected to also keep her clothing, jewellery, bags and furs, which are estimated to be worth millions of dollars.\nSince then, Dre has been ordered to pay Young millions in legal fees and spousal support, which she’ll no longer receive.\nThe Aftermath Entertainment CEO and Young were married for 24 years until she filed for divorce in June 2020."
  },
  {
    "headline": "$1 at parallel market amid high FX demand",
    "summarized_story": "Nigerian naira weakened against the dollar at the parallel market to trade at N570 amid demand for the currency during the yuletide season.\nStreet traders across forex markets in Lagos quoted the rate at N570 to a dollar on Thursday.\nA parallel market (street market) is characterised by noncompliant behaviour with an institutional set of rules.\nAdvertisementThe Central Bank of Nigeria (CBN) has consistently maintained that the parallel market represented less than one percent of foreign exchange (FX) transactions and should never be used to determine Nigeria’s naira/dollar exchange rate.\nAdvertisement“I expect a bit of demand next week, which could push naira down,” Reuters quoted a trader as saying."
  },
  {
    "headline": "$1 at parallel market amid high FX demand",
    "summarized_story": "Nigerian naira weakened against the dollar at the parallel market to trade at N570 amid demand for the currency during the yuletide season.\nStreet traders across forex markets in Lagos quoted the rate at N570 to a dollar on Thursday.\nA parallel market (street market) is characterised by noncompliant behaviour with an institutional set of rules.\nAdvertisementThe Central Bank of Nigeria (CBN) has consistently maintained that the parallel market represented less than one percent of foreign exchange (FX) transactions and should never be used to determine Nigeria’s naira/dollar exchange rate.\nAdvertisement“I expect a bit of demand next week, which could push naira down,” Reuters quoted a trader as saying."
  },
  {
    "headline": "Ikpeazu: Igbo deserve shot at presidency -- we understand Nigeria better",
    "summarized_story": "Okezie Ikpeazu, governor of Abia, says people from the south-east understand Nigeria better than those in other regions.\nAdvertisementAddressing reporters after meeting with President Muhammadu Buhari in Abuja on Thursday, the governor said an aspirant of Igbo extraction should be voted as president in 2023.\n“I think that the south-easterners have a right to take a shot at the presidency of Nigeria and I dare say that our qualification starts from the fact that we understand and know Nigeria better than the other states of Nigeria,” he said.\n“He must be somebody who has an understanding of all the contending interests and influences in this country.\n“So, the person must be willing to accommodate the youth without necessarily throwing away very experienced ones."
  },
  {
    "headline": "Ikpeazu: Igbo deserve shot at presidency -- we understand Nigeria better",
    "summarized_story": "Okezie Ikpeazu, governor of Abia, says people from the south-east understand Nigeria better than those in other regions.\nAdvertisementAddressing reporters after meeting with President Muhammadu Buhari in Abuja on Thursday, the governor said an aspirant of Igbo extraction should be voted as president in 2023.\n“I think that the south-easterners have a right to take a shot at the presidency of Nigeria and I dare say that our qualification starts from the fact that we understand and know Nigeria better than the other states of Nigeria,” he said.\n“He must be somebody who has an understanding of all the contending interests and influences in this country.\n“So, the person must be willing to accommodate the youth without necessarily throwing away very experienced ones."
  },
  {
    "headline": "Lagos leads as first-dose COVID vaccination count hits 10m",
    "summarized_story": "The National Primary Health Care Development Agency (NPHCDA), says as of December 29, over 10 million people have received the first jab of the COVID vaccine.\n“10,153,074 of total eligible persons targeted for COVID-19 vaccination reached with first dose while 4,443,297 of total eligible persons targeted for COVID-19 vaccination reached with second dose (fully vaccinated),” the update reads.\nLagos is currently in the lead, accounting for 1,310,344 of the doses administered, followed by Ogun with 673,783, and Jigawa with 630,935.\nIn its bid to get more people vaccinated, the federal government introduced mass COVID vaccination of eligible Nigerians in offices, churches, and universities.\nThe federal government also mandated civil servants to show proof of COVID test or vaccination beginning from December 1 before they can be allowed into offices."
  },
  {
    "headline": "Africa’s tech ecosystem pays tribute to Nnena Nkongho",
    "summarized_story": "The African tech ecosystem mourns the passing of Nnena Nkongho, an African investor who championed diversity and excellence.\nNnena Nkogho by Kunmi OwopetuAn ardent believer in the power of technology, she explained why she eagerly supports the African tech ecosystem, in this interview.\nEghosa Omoigui, founder, EchoVC PartnersAbsolutely devastated to hear of the passing of @NnenaP, an amazing woman, friend, investor, & long-time believer in & contributor to the African tech ecosystem.\nShe was a trailblazer and deeply committed to the African tech ecosystem, especially at a time when most LPs did not believe in the asset clas.\nCraig McLeod – Box CommerceNnena Nkongho was one of the greatest champions of the African tech ecosystem as a VC, leader, pioneer and, hands down, one of its smartest players."
  },
  {
    "headline": "Ask an Investor: Twelve insights from Africa’s top investors",
    "summarized_story": "While most people easily associate investors with just money, Founders Factory Africa (FFA) would rather have you think of more.\nMeghan Curran, West African Director of Acumen, explained this: “In our model, nothing goes back to the investors because the investors in the first place are donors.\nBefore the boom, Sawari Ventures, which was founded over a decade ago, has been backing North African startups.\nNow I’ve seen some term sheets where the investors ask that if the founder opts to pay back the investment, the investor gets some amount of free equity in the company.\nToday, LoftyInc operates three funds that have deployed over $12 million into over 75 African startups like Flutterwave, Andela and Trella."
  },
  {
    "headline": "GetEquity is changing startup investment in Africa. But how?",
    "summarized_story": "GetEquity, a Nigeria-based investment platform, came into the market with the mantra of “challenging the status quo of startup financing and venture capital” in Africa.\nInitially, the co-founders didn’t set out to democratise startup investment in Africa.\nOn GetEquity, startups get instant access to several angel investors, syndicates and institutional investors.\nApparently, GetEquity operates like every other VC: its team of diverse backgrounds—law, marketing, investment, business development—analyse the potential growth of a startup before onboarding them on their platform.\nIf that’s the case, one can chose to question the validity of the disruption the company promises to bring into startup investment."
  },
  {
    "headline": "Inside Jack Dorsey’s Btrust members’ plan to facilitate financial freedom",
    "summarized_story": "In 2020, he co-founded Recursive Capital, a venture capital that provides crypto-focused startups with seed and early-stage investments, with the aim of contributing to the development of the Web 3.0 ecosystem.\nDespite being founded before the Web 3.0 buzz, Recursive Capital had decided that it wanted to enhance financial freedom by decentralising the financial monetary system.\nTalking about the barrier to entry for Bitcoin, Khalil believes a misconception lies in the way people approach it.\nKhalil believes in educating and enlightening individuals about Bitcoin’s long-term benefits: economic freedom for the entire continent.\nOchai believes that bitcoin will eventually become a viable medium for Africans to do business without restrictions."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "Web3: The Internet evolution to come in 2022 and beyond",
    "summarized_story": "Share this article:If you’ve come across the buzzword, non-fungible tokens (NFT) on the Internet, chances are you have also seen the latest buzzword — Web3.\nA decentralised World Wide Web owned by no one but run based on everyone’s decisions.\nHe envisioned the Web in three ways: a Web of documents (Web1), a Web of people (Web2) and a Web of data (Web3).\nThe same way Web3 is causing a stir now on the Internet, the coming of Web2 also did the same thing.\nLike Web2, Web3 wants to make the Internet more inclusive but, in contrast, take control away from big corporations like Facebook, Google, and Amazon."
  },
  {
    "headline": "Worried about your child’s online safety during holidays? Try these tools",
    "summarized_story": "Nearly all social media platforms have age restrictions of at least 13 years to use their platform.\nWith many divided on the move, China’s regulatory authority has implemented regulations requiring social media and gaming companies to disincentivise youth from spending too much time on social media.\nGiven the several reported cases of online abuse on the platform, online safety precautions need to be taken, especially for young people.\nTikTokPhoto by Solen Feyissa on UnsplashWith over 2.6 billion downloads, TikTok is one of the most used social media platforms globally.\nLike every other social media platform, it has its safety issues."
  },
  {
    "headline": "After 5 reluctant years of bootstrapping, CinetPay is closing in on Francophone Africa dominance",
    "summarized_story": "“We saw that we have a good opportunity with mobile money because many people have mobile money accounts.\nCinetPay has been Flutterwave’s Francophone Africa partner since 2019.\nA little bit more detail about CinetPayCinetPay helps merchants in the Francophone Africa region accept and collect online payments from mobile money wallets in nine countries.\nAccording to the Francophone Africa and the Equality Challenge 2019 Report by the University of Chester Area Studies Research Group, female literacy rates in Francophone Africa have not been growing consistently, with outdated datasets being used for policy making and decision making.\nThe plan for now, though, is to focus on consolidating their hold in Francophone Africa."
  },
  {
    "headline": "$1.5bn Lekki Port to put Nigeria at par with African peers",
    "summarized_story": "Expectations are high among shippers and manufacturers that depend on seaports to bring in raw materials and export finished products, as Nigeria welcomes Lekki Port Seaport, its first deepwater port.\nAccording to Lekki Port LFTZ Enterprise Limited, the developer of the $1.5 billion Lekki Deep Seaport with 16.5 metres depth – deepest in Nigeria, the port would be completed in the third quarter of 2022.\nWith the coming of the much-awaited deep seaport, the Nigerian port industry will likely begin to play at par with its West African peers such as Abidjan Port, Lome Port and Tema Port that have developed deeper and more extensive seaports, industry analysts say.\nAs a deepwater port, Lekki Port will have the capacity to accommodate larger and more modern vessels with an economy of scale for the shipper and fast delivery of consignments from the port of origin to Nigeria.\nTogo Port, which has a deepwater port, handles vessels in just 1.4 days while Nigeria’s Apapa Port handles vessels in four days, he says."
  },
  {
    "headline": "Nigerian start-ups to watch",
    "summarized_story": "The Nigeria’s entrepreneurship ecosystem attracted $1.37 billion investment deals in 2021, highest on the continent, according to a compilation by thebigdeal.gumroad.com – an African startups deals database.\nYearly, we are seeing more innovative entrepreneurs providing solutions to societal problems, causing disruption in their sectors while creating jobs.\nBefore its establishment in February 2020, the ed-tech start-up has already secured over $3.1 million for its funding from TLcom Capital.\nBut the situation is gradually changing with the entry of DrugStoc, a multi-channel, cloud-based health pharmaceutical platform founded by Chibuzor Opara and Adham Yehia.\nThe start-up has managed to raise a total of $68.2 million in funding with a total of 18 investors since its launch."
  },
  {
    "headline": "Oil workers face job loss on IOCs’ divestment",
    "summarized_story": "Some Nigerian oil workers at the local units of International Oil Companies (IOCs) are staring at a bleak future as the planned sale of onshore and shallow waters assets could leave thousands jobless with denied benefits, BusinessDay interview with several oil workers shows.\nOil majors Shell, ExxonMobil, Chevron, and Eni are in a hurry to sell off their troubled Nigerian assets after COVID-19 interfered with their divestment plans in 2019.\nOthers say the oil majors are laying off their Nigerian workers and denying them benefits that are entitled to them after many years in the employ of these companies.\nAt Chevron, workers say they are getting some of their benefits though the massive job cuts are ongoing.\nShell and ExxonMobil, sources within the companies say, are taking a page from the same play book."
  },
  {
    "headline": "‘Edo APC’s call for state of emergency should be directed at FG’ – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – That the Edo State Chapter of the All Progressives Congress (APC) have the temerity to convene a press conference and raise issues about governance and development is not only a slap on the faces of citizens of Edo State, but a sign of selective amnesia.\nCan Edo APC not see that their call for a state of emergency should be more appropriately directed to a federal government, which they lead, that has reduced the value of Nigerian lives to near nothing?\nDoes the party want a state of emergency in a state where every flight, or bus coming into the state is fully booked with air carriers and road transporters jostling to keep up with the pressure of travellers trooping into the state?\nIt is rather shameful for old men – grandfathers, for that matter – to sit comfortably, look into the camera and tell bare-faced lies about the Edo State Judiciary, the state legislature, the newly reconstructed Government Science and Technical College (GSTC), street-lighting project, Edo Tech Park, Edo Innovation Hub, among others.\nThe PDP-led government in Edo State has and will continue to put the interest of the people over and above the interest of all others."
  },
  {
    "headline": "Edo to launch cluster farm initiatives, others to boost oil palm devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government plans to launch the state’s Oil Palm Development initiative and Cluster Farm initiative, as part of ongoing reforms in the agricultural sector to grow the state’s economy and achieve food security.\nThe governor, who spoke to journalists in Benin City, said his administration is committed to stimulating economic prosperity and improving ease of doing business to continuously attract private capital to engender sustainable development.\nAccording to him, “Motivated by the progress recorded with the Edo State Oil Palm Programme (ESOPP), we will be launching the Oil Palm Development initiative and Cluster Farm initiative, in furtherance of our aim of anchoring our economic growth on commercial agriculture while sustaining food security.”Noting that Edo, with the cultivation of 120,000 hectares, has the largest oil palm plantation under cultivation in the country, Obaseki added, “We have put under cultivation up to 250,000 hectares of land for oil palm under our ESOPP programme.\nToday, we are approaching about 120,000 hectares.\n“We are providing our people with an oasis of hope even with the harsh realities that confront us as a sub-national in a country that is confronted by a number of developmental challenges.”..."
  },
  {
    "headline": "Obaseki swears in seven SSAs, 25 SAs in Oredo LGA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Wednesday, swore in seven Senior Special Assistants (SSAs) and 25 Special Assistants (SAs), following harmonisation by leaders and members of the Peoples Democratic Party (PDP) in Oredo Local Government Area (LGA).\nThe governor said, “I had to wait, take my time and ensure harmonization of the party in the LGA before making this appointment.\nPolitics in Oredo LGA is very sensitive and the barometer through which Edo politics is judged.\nIf we fail to get Oredo right, it will be difficult and challenging to get Edo State politics right.\n“I have divided Oredo into 20 zones for development purposes as data are available for every household in Oredo."
  },
  {
    "headline": "Edo boosts security on waterways with eight new gun, speedboats – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… builds modern jetty, marine base, others for security personnelBENIN CITY – The Edo State Government, through the State’s Oil and Gas Producing Areas Development Commission (EDSOGPADEC) has procured additional four armoured gunboats and four speedboats to curb criminal activities along the state’s coastal areas and waterways.\nThe Chairman of EDSOGPADEC, Pastor Kennedy Osifo, who spoke to journalists, on behalf of other board members, immediately after inspecting the gun and speed boats, said the commission has now acquired eight gunboats and eight speed boats to strengthen security on its waterways and stop the activities of sea pirates.\nHe said the new armoured equipment will improve security in three oil and gas producing communities, including Ologbo in Ikpoba-Okha Local Government Area (LGA) and Gelegele, Ovia North East LGA of the state.\nOsifo revealed that the commission has completed the construction of a marine base at Ologbo River, as well as a modern jetty with a waiting lounge and other essential facilities for passengers and police officers in Ologbo Community in Ikpoba-Okha.\nThe EDSOGPADEC chair, who charged residents on protection of public facilities, said the commission will sustain efforts at improving the livelihoods of Edo people, which according to him, is a priority of the present administration of Governor Obaseki."
  },
  {
    "headline": "Burna Boy electrifies FirstBank DECEMBERISSAVYBE campaign",
    "summarized_story": "Grammy award winner Burna Boy electrified fans at the FirstBank Decemberissavybe campaign with a sterling performance at the ‘Burna Boy The Live Experience’.\nFirstBank – through its yearly DecemberIssaVybe campaign – unveiled the 2021 calendar of events earlier in December as it reiterates its impact on the arts and entertainment industry.\nPractise what you preachThe African Giant was reborn when Burna Boy decided to practise what he preaches.\nDuring the show, Burna Boy invited his African collaborators ‘Black Sherif’ and the ‘Yaba Buluku’ singers on stage to perform alongside him.\nBurna Boy returned to Nigeria after leaving the United Kingdom to continue his quest for fame and stardom."
  },
  {
    "headline": "U.S. Consulate Awards $1.02m to Nigerian Civic Organizations, Expands U.S.-Nigeria Bilateral Ties in 2021",
    "summarized_story": "The United States is a steadfast partner of Nigeria, working together to improve health, security, economic growth, human rights, democracy, and education throughout the country.\nFrom January 2021, the United States Consulate General in Lagos awarded $1.02m to civic organizations to implement projects across the 17 states in southern Nigeria.\nThe Consulate supported United States exchange alumni efforts to utilize the skills, knowledge, and networks gained through their exchange program experiences to address challenges faced by communities across southern Nigeria.\nU.S. Consulate Public Affairs Officer Stephen Ibelli praised the U.S. alumni commitment in working to improve the lives of community members through sustainable projects.\nIn 2022, the United States will break ground on its New Consulate Compound at Eko Atlantic City, symbolizing the U.S.’s sustained investment in Nigeria and its focus on the Nigerian people."
  },
  {
    "headline": "Osun Public Procurement Process Goes Digital",
    "summarized_story": "By Sunday OguntuyiAs part of effort to further ensure transparency and accountability in the state’s Public Financial Management Systems, the Osun State Public Procurement Agency has been fully digitalized and launched online in line with global best practices.\nHe said the digitisation of the State’s procurement agency which was made possible by the transparent style of governance of the present administration will, among other things, aid the State’s ease of doing business.\nAccording to Oyebamiji, “This is another move to tell the world that here in Osun, we have a Governor that is ready to be as transparent as ever with the State’s finances.\nThe present administration is not only running a transparent government, we are also institutionalizing it for it to be a continuous process even after this government.\nGoing digital and launching our procurement process online will definitely add a lot of things to our state."
  },
  {
    "headline": "Osun 2022: Osun House of Reps Member, Hon. Amobi Mobilizes Support for Oyetola",
    "summarized_story": "During the Inauguration meeting, the lawmaker and his loyalists declared full support for the second term bid of governor Adegboyega Oyetola.\nAmobi while addressing the party leaders urged them to strengthen their efforts and tighten their belt for the movement of Ayiwola for Oyetola.\nLasun Olaniyi stressed that, all chairmen should go back to their various wards to harmonize the party members for the second term of governor Adegboyega Oyetola.\nMusa Bilau from Ileogbo, Ayedire local government as the Coordinator for AYIWOLA FOR OYETOLA SECOND TERM.\nBilau who urged the party leaders and loyalist in the federal constituency to cooperate and work amoniuosly for the second term bid of the working governor, Adegboyega Oyetola."
  },
  {
    "headline": "Asiko Breaks Ground On First Dual Liquefied LNG Storage Terminal",
    "summarized_story": "The ground-breaking ceremony of the dual-liquefied gas storage terminal located in Ijora, Lagos State, took place on December 13, 2021, and on completion, the facility will house 5000 metric tonnes of Propane/LPG storage and a 30 million-litre LNG storage tank.\nAlso when completed, the terminal under construction will be the country’s first dual liquified gas fuel terminal, with the ability to receive, store and distribute both LPG and LNG.\nADVERTISEMENT“As we commence the construction of our propane/LPG terminal, we are also laying the foundation for a co-located LNG terminal consisting of a full containment tank making this the first land-based LNG receiving terminal in Africa,” he added.\nEkundayo thanked the Board of Directors of Asiko Energy, shareholders, colleagues, financiers, and supply partner of 15 years and counting, the Nigeria LNG (NLNG) Limited.\nAsiko recently signed a contract with the NLNG for the domestic distribution of LNG, making it the only company to be involved in both the domestic LPG and domestic LNG distribution in Nigeria."
  },
  {
    "headline": "Federal Govt Reels Out Achievements In 2021",
    "summarized_story": "The federal government has disclosed that the major challenge that bedeviled the nation in 2021 was insecurity.\n‘’In the oil sector, real growth shows poorer performance in 2021, recording 2.21% (year-on-year) in Q1 2021, -12.65% in Q2 2021 and –10.73% in Q3 2021, from stronger growth of 5.06% in Q1 2020, -6.63% in Q2 2020, and -13.89% in Q3 2020,’’ he said.\nHe said many have described it as the most profound event in the Nigerian oil and gas space in the last 20 years.\non National Social Investment Programmes (NSIP), he said the Federal Government has continued to implement the National Social Investment Programmes.\nConclusively, he said the current administration, in spite of daunting challenges, made tremendous progress in 2021 in fighting insecurity, growing the economy, reforming the oil sector to spur more investments."
  },
  {
    "headline": "Federal Govt Reels Out Achievements In 2021",
    "summarized_story": "The federal government has disclosed that the major challenge that bedeviled the nation in 2021 was insecurity.\n‘’In the oil sector, real growth shows poorer performance in 2021, recording 2.21% (year-on-year) in Q1 2021, -12.65% in Q2 2021 and –10.73% in Q3 2021, from stronger growth of 5.06% in Q1 2020, -6.63% in Q2 2020, and -13.89% in Q3 2020,’’ he said.\nHe said many have described it as the most profound event in the Nigerian oil and gas space in the last 20 years.\non National Social Investment Programmes (NSIP), he said the Federal Government has continued to implement the National Social Investment Programmes.\nConclusively, he said the current administration, in spite of daunting challenges, made tremendous progress in 2021 in fighting insecurity, growing the economy, reforming the oil sector to spur more investments."
  },
  {
    "headline": "Firefighters Avert Disaster As Petrol Tanker, Trailer Collide In Kwara",
    "summarized_story": "Prompt intervention of the men of Kwara State Fire Service on Thursday averted what could have been a major fire disaster in the state.\nA trailer truck with registration number PKM 141 ZY and a petrol tanker with registration number FLK 105 FA loaded with 45 litres of petroleum product collided along Bode Saadu- Jebba highway in Moro local government area of the state.\nIt was further gathered that the firefighters quickly responded to the distress call sent to their office and in no time arrived at the Shao junction scene of the accident.\nADVERTISEMENTThe firefighters quickly moved into action and evacuated petrol from the tanker, thereby preventing it from exploding.\nHe quoted the director of the State Fire Service, Prince Falade Olumuyiwa, urging tanker drivers to always drive safely to avoid carnage on the highways."
  },
  {
    "headline": "Firefighters Avert Disaster As Petrol Tanker, Trailer Collide In Kwara",
    "summarized_story": "Prompt intervention of the men of Kwara State Fire Service on Thursday averted what could have been a major fire disaster in the state.\nA trailer truck with registration number PKM 141 ZY and a petrol tanker with registration number FLK 105 FA loaded with 45 litres of petroleum product collided along Bode Saadu- Jebba highway in Moro local government area of the state.\nIt was further gathered that the firefighters quickly responded to the distress call sent to their office and in no time arrived at the Shao junction scene of the accident.\nADVERTISEMENTThe firefighters quickly moved into action and evacuated petrol from the tanker, thereby preventing it from exploding.\nHe quoted the director of the State Fire Service, Prince Falade Olumuyiwa, urging tanker drivers to always drive safely to avoid carnage on the highways."
  },
  {
    "headline": "Deeper Life pastor emerges new Idoma nation monarch",
    "summarized_story": "A pastor of the Deeper Christian Life Ministry, Elaigwu Odogbo Obagaji John, has emerged the new Och’Idoma — a paramount Ruler of the Idoma Nation.\nThe Nation gathered that the 52-year-old cleric defeated Andrew Idakwu and Sunday Echono to emerge as the new king of Idoma land.\nElaigwu, born on March 27, 1969, is a graduate of Ahmadu Bello University Zaria (1994) with B.Sc honours in Accounting, and Masters in Business Administration (2012) from Benue State University.\nHe is currently running a PhD program in Accounting at the Nasarawa State University, Keffi.\nHe hails from the family of Elaigwu Ekoja in Obagaji the headquarters of Agatu Local Government Area of Benue State."
  },
  {
    "headline": "Deeper Life pastor emerges new Idoma nation monarch",
    "summarized_story": "A pastor of the Deeper Christian Life Ministry, Elaigwu Odogbo Obagaji John, has emerged the new Och’Idoma — a paramount Ruler of the Idoma Nation.\nThe Nation gathered that the 52-year-old cleric defeated Andrew Idakwu and Sunday Echono to emerge as the new king of Idoma land.\nElaigwu, born on March 27, 1969, is a graduate of Ahmadu Bello University Zaria (1994) with B.Sc honours in Accounting, and Masters in Business Administration (2012) from Benue State University.\nHe is currently running a PhD program in Accounting at the Nasarawa State University, Keffi.\nHe hails from the family of Elaigwu Ekoja in Obagaji the headquarters of Agatu Local Government Area of Benue State."
  },
  {
    "headline": "Again, senate probes NPA over N7.5b contract irregularities",
    "summarized_story": "But, as of November 2015, the sum of N4.2billion had been paid to the contractor which represents 56.61 per cent of the contract sum.\nThe AuGF’s query reads: “A contract for Shore Erosion Control Works at Akipelai, Ayakoro and Otuoke towns in Bayelsa State was awarded at a contract sum of N7,503,344,599.00, vide award letter Ref.\n“As at 11th November 2015, four payment certificates and an advance payment totalling N4,247,938,353.26 representing 56.61% of the contract sum, had been paid to the contractor.\n4 dated 11th November 2015 showed that the value of works executed as at the period was N3,903,668,868.75 representing 52.07 per cent of the contract sum.\n“However, the total payment made to the contractor was N4,247,938,353.26, representing 56.61 per cent of the contract sum."
  },
  {
    "headline": "Again, senate probes NPA over N7.5b contract irregularities",
    "summarized_story": "But, as of November 2015, the sum of N4.2billion had been paid to the contractor which represents 56.61 per cent of the contract sum.\nThe AuGF’s query reads: “A contract for Shore Erosion Control Works at Akipelai, Ayakoro and Otuoke towns in Bayelsa State was awarded at a contract sum of N7,503,344,599.00, vide award letter Ref.\n“As at 11th November 2015, four payment certificates and an advance payment totalling N4,247,938,353.26 representing 56.61% of the contract sum, had been paid to the contractor.\n4 dated 11th November 2015 showed that the value of works executed as at the period was N3,903,668,868.75 representing 52.07 per cent of the contract sum.\n“However, the total payment made to the contractor was N4,247,938,353.26, representing 56.61 per cent of the contract sum."
  },
  {
    "headline": "Kukah: Despite my criticisms, Buhari picks my calls",
    "summarized_story": "The Catholic Bishop of Sokoto Diocese, Rev Father Matthew Hassan Kukah, has said despite his frequent criticisms of the Buhari government, President Muhammadu Buhari picks his calls.\nKukah spoke to journalists at St Bakhita Catholic Secretariat Sokoto when responding to questions on his frequent criticisms of the President Muhammadu Buhari’s administration.\nBut the cleric said despite his criticisms, he maintains a cordial relationship with the President.\nHe added that the President still picks his calls whenever he called him.\n“If I pick up my phone and call Mr President now he will pick it up."
  },
  {
    "headline": "Colorado governor cuts 100 years out of truck driver's sentence",
    "summarized_story": "Colorado Governor Jared Polis on Thursday commuted the 110-year sentence of a truck driver to 10 years following public outrage.\nThe truck driver, Rogel Aguilera-Mederos was convicted of vehicular homicide and sentenced on Dec. 13 to 110 years in prison for a 2019 fatal crash on Interstate 70, outside Denver.\nThe accident killed four people and injured several others — a sentence the judge said he wouldn’t have chosen if he had the discretion.\nJared Polis announced the commutation of the sentence Thursday.\nAmong those advocating for a lesser sentence were the family members of some of those killed in the accident."
  },
  {
    "headline": "BREAKING: Ex-President, Jonathan Meets Buhari In Aso Rock In Close-door Session",
    "summarized_story": "At the State House in Abuja, President Muhammadu Buhari and former President Goodluck Jonathan are currently meeting.\nOn Thursday about 3 p.m., Jonathan arrived at the Presidential Villa.\nJonathan may have paid a visit to the White House to advise President Obama on his work as ECOWAS Chief Mediator in Mali, according to reports.\nMeanwhile, there were indications that Jonathan was planning to defect from the Peoples Democratic Party (PDP) to the All Progressives Congress (APC) (PDP).\nAccording to the source, the Presidency cabal wants Jonathan to be the next president because they feel he will not probe Buhari’s regime’s misdeeds."
  },
  {
    "headline": "BREAKING: Queen Naomi Reportedly Returns To The Palace Amidst Divorce Saga",
    "summarized_story": "Queen Evangelist Silekunola Moronke Naomi, wife of the Ooni of Ife Oba Adeyeye Ogunwusi, has reportedly returned to the palace.\nThe evangelist disclosed that she tried to make the marriage work but said the monarch’s public identity is clashing with his true self.\nHowever, a new report emerging have alleged that the queen have returned to the palace, stating that the Olori changed her decisions after some elders of the palace and Akure met with her.\nThe post reads: “Queen Silekunola Ogunwusi returns to the palace after plenty pleas from the palace and elders from Akure and Ife met, Side piece in the mud ooooo Olori Farampon won’t like this ooo.\nI come in peace.”Queen Silekunola Ogunwusi returns to the palace after plenty pleas from the palace and elders from Akure and Ife."
  },
  {
    "headline": "Federal Government, Not Benin Republic Govt, Keeping Sunday Igboho In Prison — Lawyer",
    "summarized_story": "Yomi Alliyu, SAN, the lawyer for Yoruba Nation agitator Sunday Adeyemi, also known as Sunday Igboho, dismissed a social media report of an alleged plan to assassinate the activist in Benin Republic prison yesterday, claiming that Igboho is being held in prison by the Federal Government of Nigeria, led by President Muhammadu Buhari, and not the Benin Republic government.\nHe, however, warned those “flying the kite” to desist from spreading such speculations, assuring that Igboho would regain freedom soon.\n“We have persuaded his boys and Yoruba youths not to take laws into their hands.\nThe only way this Government can wash its hands off this evil intention is to release Sunday Igboho now because they (FG) are the ones keeping him in prison and not the Benin Republic Government.\nI don’t see any threat to his life.”Sunday Igboho had reportedly alleged that there was a plot by the Federal government of Nigeria to eliminate him in the Benin Republic."
  },
  {
    "headline": "Rich And Wealthy People Are Behind Insecurity In Nigeria, Buying Weapons, Drugs – Hamza Al-Mustapha.",
    "summarized_story": "To deal with the present situation holistically, Major Al-Mustapha stated that it required the contribution of all patriotic citizens of the country.\nHe said that the authorities have to step on the toes of disgruntled elements in an effort to normalise the security situation.\nMajor Al-Mustapha, who spoke on a viral VOA Hausa interview, explained that, “it is high time every patriotic Nigerian, anyone who has Nigeria, Africa or the entire world at heart, stood up and make personal contribution.\nHe disclosed that there were people spending their money to cause crisis.\nHe said, “There are people spending their money to cause crisis and it appears they are succeeding."
  },
  {
    "headline": "Breaking: Deeper life Pastor emerges Idoma Paramount ruler",
    "summarized_story": "A new Och’Idoma, a paramount Ruler of the Idoma Nation has emerged.\nHe is Elaigwu Odogbo Obagaji John, a Pastor with Deeper Christian Life Ministry.\nPastor John will now succeed the late Agabaidu Elias Ikoyi Obekpa.\nThe 52-year-old cleric defeated Andrew Idakwu and Sunday Echono to emerge as the new king of Idoma land.\nPastor John will recognised as a first class traditional ruler."
  },
  {
    "headline": "Nigeria, one of least safe, clean countries globally – Experts",
    "summarized_story": "Safety and security experts have described Nigeria as one of the least safe and clean countries of the world.\nThe Ogun state chairperson of Occupational Safety and Health Association (OSHA) UK-Nigeria region, Peace Onuiri, stated this during a press conference in Abeokuta, Thursday.\nPeace hinged her assertion on the World Safety Index Report of 2020 indicated by the Environmental Performance Index which put the country in 151 out of the 180 countries of the world, adding that Nigeria also faired 187 out of the 191 countries of the world by the World Health Organisation in the overall health system performance.\n“According to the National Safety and Advocacy Project (2021-2023), the reality about the health and safety of Africans is still a messy state.\nMeanwhile, the Region Administrator of the Association, Engr."
  },
  {
    "headline": "Charley Boy reacts to Ooni of Ife’s marriage crisis",
    "summarized_story": "Charley Boy also known as Area Fada has reacted to the Ooni of Ife marriage saga.\nCharley Boy shared a picture of himself with the monarch on his instagram account, Thursday, saying “all that glitters is not gold”.\nHow e come be say in less dan 2 months, two of ur wives just divorce u and ran away from ur kingdom.\n“To add salt to injury, na for Instagram dem divorce u.\nHow come wives just take off without notice, e good so?”RelatedNo tags for this post."
  },
  {
    "headline": "NDDC Forensic Audit: Every Kobo Will Be Recovered, Says Buhari",
    "summarized_story": "﻿President Muhammadu Buhari on Thursday said his administration is reviewing the concluded forensic audit of the Niger Delta Development Commission (NDDC) with a view to recovering every kobo that is recoverable.\nThe President had ordered a forensic audit of the NDDC in October 2019 to probe alleged financial misappropriation.\nSpeaking in Abuja at the virtual commissioning of the NDDC Prototype Hostel at the University of Uyo, Akwa Ibom, Buhari pledged to prosecute those found culpable in accordance with the law.\nREAD ALSO: Buhari Receives NDDC Forensic Audit Report“The serial abuse, lack of delivery and what had become an entrenched institutional decay was the reason why I called for the forensic audit,” the President was quoted as saying in a statement issued by his Special Adviser on Media and Publicity, Femi Adesina.\n“The Niger Delta Development Commission needs to demonstrate that it can achieve the objectives it was conceived for and make its impact felt all over the Niger Delta Region."
  },
  {
    "headline": "2023: South Easterners Have A Right To The Presidency, They Understand Nigeria Better – Ikpeazu",
    "summarized_story": "“The question of Nigeria president of southeast extraction is a national question that required negotiation, discussion, and conversation with all parts of this country and I am least qualified to determine what happened in 2023.\n“What the political parties need to do.\nWell, the political parties need to be sensitive to the feelings of the various contending ground because politics should not be a winners take all thing.\n“So, all the political parties should be alive to this sentiments and feelings in taking decisions going forward.\n“And I think Nigeria is alive to all of that."
  },
  {
    "headline": "20-Year-Old Notorious Bandit Arrested In Zamfara",
    "summarized_story": "﻿The police in Zamfara State have arrested a 20-year-old notorious bandit, named Sani Mati also known as Mai Yanmata.\nMai Yanmata is known for terrorising three local government areas of Zamfara State – Zurmi, Shinkafi and Birnin Magaji before he met his waterloo.\nParading the suspect on Thursday in Gusau, the Commissioner of Police in the state, Ayuba Elkanah said the suspect is a member of a notorious bandit kingpin, one Turji but now operating under another gang of a notorious bandit known as Kachalla Sani Black.\nREAD ALSO: Katsina Govt Urges Residents To Defend ThemselvesKachalla Black is a known bandit who terrorises communities in Zurmi and Shinkafi axis of Zamfara State.\nHe equally pledged to feed the public with vital information recovered from the suspect in a bid to tackle banditry in the North-Western state."
  },
  {
    "headline": "COVID-19 Vaccination: Nasarawa, Jigawa, Ogun Top NPHCDA Performance Ranking",
    "summarized_story": "The National Primary Health Care Development Agency, (NPHCDA) on Wednesday released its COVID-19 vaccination campaign statistics on the most and least vaccinated states in the country.\nAccording to the health agency’s latest update, Nasarawa made the most of the vaccination efforts with 31.63% of the state’s population receiving the COVID-19 jabs.\nJigawa came in second with an inoculation percentage of 29.03, while Ogun State emerged as the most vaccinated state in the southwest with 17.24 %.\n“The country is now in a fourth COVID-19 wave.\nPresident Muhammadu Buhari last week Tuesday received a COVID-19 booster shot at the State House in Abuja."
  },
  {
    "headline": "Cameroon Record Four COVID-19 Cases Before AFCON",
    "summarized_story": "Four Cameroon players including attacker Pierre Kunde Malong have tested positive for Covid-19 less than two weeks away from the Africa Cup of Nations, the holders’ head of communications said Thursday.\nThe quartet had been in quarantine since Wednesday after “strong suspicions” upon their arrival with the squad, Serge Guiffo told AFP.\n“Pierre Kunde Malong, Jean Efala Konguep, Michael Ngadeu-Ngadjui and Christian Bassogog will continue their isolation away from the squad,” he added.\nREAD ALSO: Osimhen Tests Positive For COVID-19 AgainElsewhere, Bayern Munich forward Eric Maxim Choupo-Moting left training early after suffering a knee issue.\n“The MRI undertaken immediately afterwards will tell us more about its extent and his potential unavailability,” Guiffo said."
  },
  {
    "headline": "Gov. Ugwuanyi signs N186.64 billion 2022 budget into law",
    "summarized_story": "Enugu state Governor, Ifeanyi Ugwuanyi has assented to the 2022 appropriation bill of 186,64 billion naira recently passed by the State House of Assembly.\nPresenting the appropriation bill to Governor Ugwuanyi for assent, the Speaker of the State House of Assembly, Edward Ubosi disclosed that the budget proposal was a wonderful budget of international standard.\nUbosi explained that all the Ministries, Departments and Agencies (MDAs) appeared before the various committees to ensure they defended their budget estimates.\nAssenting to the appropriation bill, Governor Ugwuanyi expressed gratitude to God and the members of the State House of Assembly for their commitment and dedication to legislative duties as well as the development of Enugu State.\nHe expressed confidence that the budget would be implemented faithfully for the people of the state to enjoy more dividends of democracy."
  },
  {
    "headline": "Tinubu condoles with Gov Ganduje, Sharia Council over Sheikh Datti Ahmed's death -",
    "summarized_story": "The All Progressives Congress National Leader, Asiwaju Bola Tinubu, has commiserated with Kano State Governor Abdullahi Ganduje and the Supreme Council for Sharia in Nigeria over the death of elder-statesman and president of the council, Dr. Datti Ahmed.\nHe said throughout his life, Dr. Ahmed symbolised and fought for justice, equity and fairness adding that his demise was a loss not only to the Muslim community in Nigeria but to all Nigerians.\n“As a first generation medical doctor from Kano State, Dr. Ahmed dedicated his life to the service of humanity.\n“The death of Dr. Ahmed is a great loss to the medical community in Nigeria and the comity of Islamic scholars.\n“My condolences to his family, Kano State Governor Abdullahi Ganduje, the government and people of the state, Muslims across the country, and Nigerians as a whole."
  },
  {
    "headline": "Auditor General indicts NASS over alleged misappropriation of N9.4b -",
    "summarized_story": "The Office of the Auditor General for the Federation has indicted the management of the National Assembly and the National Assembly Service Commission for alleged unexplained expenditure amounting to N9.4 billion in the 2019 financial year.\nThe report said about N5.5 billion of such expenditure was credited to the House of Representatives in five different audit queries, N3.5 billion credited to the Senate in seven audit queries, while N307.6 million was credited to the National Assembly Service Commission in two audit queries.\nThe queries are contained in the Auditor General’s annual report on non-compliance and internal control weaknesses issues in Ministries, departments and agencies of the federal government for the year ended 31st December 2019.\nThe Report addressed to the Clerk to the National Assembly was signed by the Auditor General for the Federation, Adolphus Aghughu.\nThe report said N2.5 billion was granted to members of the House of Representatives as running costs between July and December 2019 without evidence to show what the funds were used for even as it was not retired."
  },
  {
    "headline": "Somali President suspends PM Roble, accuses him of undermining legislative elections",
    "summarized_story": "President of Somalia Mohamed Abdullahi Mohamed stated Monday that he is suspending Prime Minister Mohamed Hussein Roble, widening the political schism between the country’s top officials.\nAccording to a spokeswoman for President Mohamed, also known as Farmajo, the move was taken in response to an investigation into an illegal acquisition of public land involving Prime Minister Roble.\nThe prime minister accused Mohamed of obstructing parliamentary elections, prompting Roble’s suspension.\nEarlier this year, the feuding leaders agreed to enable 101 delegates to choose members of parliament, who would then choose the future head of state.\nObservers fear that the feud between Farmajo and Roble will divert attention away from the ongoing threat posed by the al Shabab insurgent group, which has fought the central government in an attempt to seize power and impose sharia law in Somalia, which has been wracked by chaos and conflict since the overthrow of former dictator Mohamed Siad Barre in 1991."
  },
  {
    "headline": "Kastina Governor Urges Citizens To Die As Martyrs In Self Defense – Trending with Ojy Okpe – Arise News",
    "summarized_story": "The alleged abduction, and extortion of a popular relationship coach Solomon Buchi in Abuja generated mixed reactions on social media.\nIn a flurry of tweets on Wednesday, Buchi alleged that men of the Abuja police command abducted him and his younger brother, assaulted them and stole the sum of N500,000 from his account via POS, in addition to taking other valuables.\nBuchi also alleged, that the policemen treated them like criminals and labelled them as members of the Indigenous People of Biafra tweeting that his first crime for being kidnapped by the Nigerian police was being Igbo.\nMeanwhile, the Governor of Kastina State Aminu Masari has come under fire for calling on residents of the state to arm themselves and confront bandits because security officials alone cannot tackle insecurity in the state.\nWhile speaking during a media parley with journalists at the Muhammadu Buhari House in Katsina, the Governor said that it was Islamically allowed for one to defend oneself, family and assets; and If one was to die while trying to defend oneself , the person will be considered a martyr."
  },
  {
    "headline": "Nigeria: Katsina Governor Masari Urges Citizens to Bear Arms and Repel Bandits",
    "summarized_story": "Governor of Katsina State in Nigeria’s Northwest, Aminu Bello Masari, says the state will support residents who are willing to procure weapons to defend themselves against attacks.\nKatsina has recorded a surge in the activities of bandits which has led to kidnappings and killings of residents.\nAddressing the media, Governor Masari says it is unfortunate how criminals get guns but good people do not have the means to protect themselves.\nThe governor says the number of security operatives in the state is insufficient to protect the lives and properties of residents.\nWatch the video for more…"
  },
  {
    "headline": "With Rising Theft, Nigeria Records 193m Barrels of Crude Oil Deficit in 11 Months",
    "summarized_story": "At a projected 1.86 million barrels daily oil production in the country’s 2021 budget, Nigeria recorded a huge deficit of almost 200 million barrels in the first 11 months of this year.\nEven then, NNPC and its partners pumped almost 1.4 million barrels daily, but that figure has slumped since the August 2021.\nOn a monthly basis, the figures further revealed a decline from January as production was 42.1 million barrels for that month; in February it was 39.8 million barrels while in March, Nigeria pumped 44.2 million barrels, a relatively good month compared to the rest.\nBut April saw the country produce 41.1 million barrels; it was 41.6 million barrels in May; 39.4 million barrels in June; 41 million barrels in July, before it began a downward spiral till now.\nIn addition, 38.4 million barrels were pumped from around 30 Nigeria’s terminals and streams in August, 37.4 million barrels in September, 38 million barrels in October and 38.2 million barrels in November."
  },
  {
    "headline": "Buhari Receives Manufacturers, Promises Access to Forex",
    "summarized_story": "He said the government recognised the resilience of their members and other private sector organisations in promoting a virile manufacturing sector in Nigeria.\n“Let me assure you that this administration is fully aware that the survival of Nigeria lies in agriculture and having a viable domestic manufacturing sector.\nThe National Bureau of Statistics (NBS) estimated that Nigeria recorded N3.03 trillion trade deficit in the third quarter of 2021.\nIt is, therefore, not surprising that we are ending up with these figures as trade deficit in the third quarter of year 2021.\n“The objective should be to reduce importation of goods as we concertedly work to reduce and even end our trade deficit."
  },
  {
    "headline": "Elumelu Foundation Opens 2022 Application for Entrepreneurship Programme",
    "summarized_story": "The Tony Elumelu Foundation (TEF), one of the leading philanthropies empowering young African entrepreneurs across all 54 African countries, has opened applications for its 2022 TEF Entrepreneurship Programme on www.TEFConnect.com.\n“In 2021, the Tony Elumelu Foundation disbursed $24.75 million to 5,000 African entrepreneurs across Africa for its 2021 Entrepreneurship Programme.\n“Our hope is that, through the Tony Elumelu Foundation Entrepreneurship Programme, we would help the next business leader or captain of industry be whom they are meant to be.\n“My entrepreneurship experience cannot be complete without the Tony Elumelu Foundation.\nThe Tony Elumelu Foundation Entrepreneurship Programme is open to entrepreneurs across Africa: new start-ups and existing young businesses, operating in any sector."
  }
]