[
  {
    "headline": "UAE sends plane carrying relief materials to Afghanistan",
    "summarized_story": "The United Arab Emirates sent a plane carrying “urgent medical and food aid” to Afghanistan on Friday, the official WAM news agency said, nearly three weeks after the Taliban’s takeover.\nThe UAE foreign ministry confirmed to AFP that “this is the first (Emirati) aid flight since the recent events in Afghanistan”.\nThe United States invaded Afghanistan and toppled its Taliban government in 2001 in the wake of the 9/11 attacks by Al-Qaeda, which had sought sanctuary in the country.\nWestern capitals fear Afghanistan could again become a haven for extremists bent on attacking them.\nThe UAE is one of a number of Gulf states that have been instrumental staging posts for evacuation flights for foreigners and Afghans, along with Qatar, Kuwait and Bahrain."
  },
  {
    "headline": "Court freezes N19.17bn belonging to convicted ex-bank boss, Atuche",
    "summarized_story": "A Lagos State High Court in Ikeja has frozen assets and funds worth N19.17bn allegedly kept in 24 banks by a convicted former Managing Director of the defunct Bank PHB, Francis Atuche.\nJustice Lateefat Okunnu made the order sequel to an August 17 application by the Economic and Financial Crimes Commission in a suit between the Federal Government and Atuche, as well as Ugo Anyanwu, the first and second defendants respectively.\nThe application was filed by the Economic and Financial Crimes Commission prosecution team, led by a Senior Advocate of Nigeria, Mr Kemi Pinheiro.\nThey are Anthony Atuche, Emeka Atuche, Paul Okobi, Felix Oyiana, Moruf Adisa, Olatunji Abiodun, Daniel Enebeli, Aina Olugbenga, Augustine Nwabueze, Omonua Benedict, Oliver Nduaaron, Chris Ogbechie, Murat Bektaslar, Attah Olukemi, and Thomas Etuh.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Hole-in-heart Baby Ademola needs N5m for surgery",
    "summarized_story": "Baby AdemolaBy Chioma ObinnaEight-month-old baby, Ademola Adekoya, currently receiving treatment at the Babcock University Teaching Hospital is urgently seeking N5 million for a life-saving surgery which must be conducted within two months.\nNarrating her ordeal to Vanguard, the mother, Mrs. Hannah Adekoya, said when she took Ademola to the hospital, the doctor said he had an infection.\nAfter that, the doctor recommended an echocardiogram.”She was then referred to the Lagos State University Teaching Hospital, LASUTH, Ayike House.\nLater they gave us the bill for the surgery, and that we have to do it within two months,” she lamented profusely.\nPlease help me.”If you are touched by the plight of Baby Ademola Adekoya, please send your donations to UBA account 2213288367, Daniel Ademola Adekoya or call 08169230042."
  },
  {
    "headline": "Court upholds Akwa Ibom APC ward congress",
    "summarized_story": "By Chioma Onuegbu UyoA High court sitting in Itu judicial division, Akwa Ibom state has upheld the outcome of the ward congress held by the All Progressives Congress, APC in the 329 wards of the state on July, 31, 2021.\nA suit marked: HIT/28/2021was brought before Justice Ntong F. Ntong by 5 applicants/claimants including Uwakmfon Idara Dan, Emmanuel Sunday Nnah on behalf of themselves and all elected Ward Executives of the APC at the ward congress.\nThe applicants challenged the defendants/ respondents, the National Chairman Caretaker Extra Ordinary Convention Planning Committee of APC and five others on the July 31 ward congress.\nIn its ruling on Thursday, the Courtided over by Judge, Justice.\nThe court which promised to treat the pending suit at the vacation court adjourned the case to till Monday September 13, 2021 for report of service to vacation court Uyo."
  },
  {
    "headline": "Ugwuanyi’s benevolence, vision, love for God, peace outstanding, says Methodist Prelate",
    "summarized_story": "You are making Nigeria proud and I don’t expect anything less because you occupy the seat of Michael Okpara who happened to be the leader of all the Igbos.\nUgwuanyi formally welcomed them to Enugu State and expressed delight that the Church chose the state for the religious event.\nAccording to him, “the good people of Enugu State will savor this bountiful harvest of prayers and blessings for a very long time.\n“I thank the Clergy and laity of Methodist Church Nigeria for their continuing prayers and wise counsel in support of our administration.\nIn their brief remarks, the Archbishop of Enugu, Methodist Church Nigeria, Most Rev."
  },
  {
    "headline": "Just in: Court declares Valentine Ozigbo Anambra PDP Governorship candidate",
    "summarized_story": "The Court of Appeal sitting in Abuja has declared Valentine Ozigbo as the validly elected candidate of the Peoples Democratic Party, PDP, for the Anambra Governorship election slated for November 6, 2021.\nFollowing an appeal filed by Ozigbo, a three-man panel of justices led by the President of the Court of Appeal, Honorable Justice Monica Dongban- Mensem, made the declaration on Friday.\nIt thereafter, ordered the Independent National Electoral Commission (INEC) to publish the names of Ozigbo and his running mate as the duly elected candidates of the PDP in the forthcoming election.\nThe appellate court also awarded the sum of N10 million in favor of Ozigbo.\nVanguard News Nigeria"
  },
  {
    "headline": "Allegation of Ritual Dealings: Stop blackmailing me, Sen Tofowomo tells petitioner",
    "summarized_story": "Reacting to the allegation, senator Tofowomo through his SA Media and Publicity, Akinrinlola Olumide described the allegation as “mischievous, untrue, and falsely concocted to dent his image ahead of the 2023 general election.\nAkinrinlola said that “Senator Tofowomo is innocent and open for investigation by the police.\n“The politically orchestrated petition should be ignored by the good people of Ondo South and the unsuspecting public because the Lawyer only wrote to mislead the public for political gains.\n“The public should know that the petition writer is a card-carrying member of the ruling APC, and his ultimate goal is to bring down Senator Tofowomo.\n“Senator Tofowomo is a man that carries God’s grace and a good Christian who cannot suffer disgrace."
  },
  {
    "headline": "Ishaku pledges to pay employees of defunct beverages company their entitlements",
    "summarized_story": "Governor Darius Dickson Ishaku of Taraba State has agreed that former employees of the defunct Nigerian Beverages production company limited will all be paid their entitlements.\nThe gesture, he said, will reach out to those who have been identified by the committee earlier put in place to screen former workers of the defunct company which is located in Kakara community of Sardauna council of the state.\nDemonstrating his resolve to settle the entitlements of the former workers of the beverages company, the sum of N30 million, he said has been approved by his administration for the payments.\nThe Chief Executive Officer, Taraba Investment and Property Limited, Iliya Ezekiel said the Mambilla Beverages Nigeria Limited, said the company came into existence after the collapse of the defunct Nigeria Beverages Production Company Limited in 2015.\nStressing how the company was revived and repositioned by the incumbent state government, several numbers of unemployed youths whom he believed would have been going about making life cumbersome for the innocent people he said have been engaged by the company."
  },
  {
    "headline": "UN release indicates Buhari’s govt pays Boko Haram, gives them houses – Omokri alleges",
    "summarized_story": "A Nigerian socio-political activist, Reno Omokri, has alleged that a report by the United Nations indicated that President Muhammadu Buhari’s administration is aiding and abetting activities of Boko Haram insurgents.\nOmokri, a former aide of Nigeria’s ex-president, Goodluck Jonathan, made the allegations via a post on his verified Facebook page.\nHe expressed scepticism over reports of insurgents surrendering to Nigerian troops in the Northeast, stating that the repentant terrorists should have helped the troops to locate Leah Sharibu and others who are still in Boko Haram captivity.\nThe post reads, “If these Boko Haram militants Buhari is releasing and rewarding are truly repentant, how come they have not told us the location where Leah Sharibu, the Chibok Girls, and other abductees are kept?\n“The United Nations released a report on how the Buhari administration is paying these Boko Haramists money and even giving them houses."
  },
  {
    "headline": "Mustapha didn’t say pastors criticizing Buhari, FG will be arrested – NIREC",
    "summarized_story": "The Nigeria Inter-Religious Council (NIREC) has refuted information that Boss Mustapha, Secretary to the Government of the Federation, said pastors criticizing President Muhammadu Buhari and his government will be arrested.\nNIREC Executive Secretary, Prof. Cornelius Omonokhua advised Nigerians to shun the claim credited to Bishop Dr. Olabode Daniel.\nOmonokhua, in a statement, explained that the SGF never made such a threat at the 3rd quarter NIREC meeting.\nNIREC called on Nigerians to disregard “the propaganda” and work graciously towards the realization of a peaceful nation.\nSamson Ayokunle, President, Christian Association of Nigeria (CAN), and Alhaji Muhammad Sa’ad Abubakar, Sultan of Sokoto and President General, Nigeria Supreme Council for Islamic Affairs (NSCIA)."
  },
  {
    "headline": "Osun: NYSC harps on COVID-19 safety measures as orientation exercise commences",
    "summarized_story": "In line with directives from the National Youth Service Corp (NYSC), National Directorate Headquarters, Abuja, for the commencement of a new orientation exercise, the NYSC in Osun State has opened the Permanent Orientation Camp, Ede, for the 2021 Batch B, Stream 2 Prospective Corps Members (PCMs) for the three weeks exercise.\nThe Osun State NYSC also stated that it was putting various measures in place in order to ensure strict adherence to the COVID-19 safety regulations by the PCMs as stipulated by the Nigerian Centre for Disease Control (NCDC).\nIn an announcement made available to DAILY POST by the Osun State NYSC on Friday, it disclosed that amongst the COVID-19 measures put in place include: temperature check, the disinfectant tunnel and the mandatory COVID-19 Rapid Diagnostic Test that the prospective youth corps members and camp officials would be subjected to.\nRecall that the orientation exercise is one of the four cardinal programmes of the scheme designed to equip, mould and prepare young graduates for effective service to the country.\nOsun: NYSC charges corps members to obey COVID-19 protocols as orientation exercise begins"
  },
  {
    "headline": "Energy theft, vandalism: EEDC seeks media partnership, receives NUJ Enugu Correspondents’ leadership",
    "summarized_story": "The Enugu Electricity Distribution Company PLC (EEDC) has assured customers within its franchise of renewed vigour to engineer steady power supply.\nWhile lamenting continuous energy loss owing to theft, vandalism, among others, he sought the cooperation of the media and the entire customers in order to sustain the improved power supply.\nNjoku, who acknowledged the steady improvement in power supply, urged the company to sustain the tempo.\nMeanwhile, the EEDC has also assured its customers in Awka, Ogidi and Ekwulobia, Anambra State, of improved power supply.\nThis would enable EEDC to accommodate more load and energy to meet the increasing power demands of customers under its Awka, Ogidi and Ekwulobia districts."
  },
  {
    "headline": "BREAKING: Appeal Court declares Valentine Ozigbo as PDP candidate for Anambra governorship election",
    "summarized_story": "The Court of Appeal in Abuja has declared Valentine Ozigbo as the validly nominated candidate of the Peoples Democratic Party (PDP) in the forthcoming governorship election in Anambra State.\nA three-member panel, presided over the President of the Court of Appeal, Justice Monica Dongban-Mensem, unanimously upheld the two appeals filed by Ozigbo and the PDP (CA/AW/223/2021 and CA/AW/234/2021)ADVERTISEMENTRead Also: Six Anambra APGA lawmakers defect to APCThe appellate court, in two judgements delivered on Friday, set aside the July 19, 2021 judgment by Justice Justice A.O.\nNwabunike of the Anambra State High Court sitting at Awka, declaring Senator Ugochukwu Uba as the authentic candidate of the PDP in the governorship election coming up in Anambra in November.\nThe court awarded N10million cost against Senator Uba.\nDetails shortly…"
  },
  {
    "headline": "Will Tuface, Annie Idibia’s 8-year-old marriage survive the storm?",
    "summarized_story": "In March 2021, pop star Innocent Idibia, popularly known as Tubaba or Tuface Idibia, and his wife, Annie, celebrated eight years of marital bliss.\nADVERTISEMENTBut all does not seem to be well, following Annie’s recent outburst on Instagram, over 2face relationship with one of his baby mamas, Pero Adeniyi.\nHe is a father of seven; five from his previous relationships with other women and two with his wife, Annie.\nHis video African Queen, which saw Annie make appearances is the first video to be aired on MTV Base Africa.\n2face Idibia once opened up on why he married his wife, Annie despite having kids from several other women."
  },
  {
    "headline": "How Buhari broke the jinx at NNPC, by Femi Adesina",
    "summarized_story": "For the first time in its 44 years history, the Nigerian National Petroleum Corporation (NNPC) had made a profit.\nBefore we discuss how Muhammadu Buhari broke the jinx, let’s consider how naysayers responded to the good news.\nHe said not once, not even half of a time, did President Buhari ever send anyone to him for patronage of any kind, nor did he show preference for anybody.\nBut President Buhari does no deal with anyone.\n*Adesina is Special Adviser to President Buhari on Media and Publicity"
  },
  {
    "headline": "Any State Caretaker Committee that swears in any person not elected is null, void, says APC",
    "summarized_story": "The All Progressives Congress (APC) has said any State Caretaker Committee that swears in any person or group of persons not elected through a congress conducted by the designated National Congress Committee of the Party is null, void.\nThe National Chairman, APC Caretaker/Extraordinary Convention Planning Committee (CECPC), H.E.\n“Rest assured that your assignment, as well as the earlier Ward Congresses nationwide, is legally protected.\n“Consequently, the CECPC ratifies and adopts the results of the party’s earlier nationwide Ward Congresses held on Saturday July 31st, 2021.\nAny State Caretaker Committee who swears in any person or group of persons who are not elected through a congress conducted by the designated National Congress Committee of the Party is null, void and of no effect."
  },
  {
    "headline": "Breaking: Anambra Guber: Appeal Court Declares Ozigbo PDP’s Candidate",
    "summarized_story": "The court awarded a cost of ten million against the Senator Ugochukwu Ubah for being a meddlesome interloper.\nIn a dramatic twist, Justice Nwabunike made away with the case file preventing the defendants from obtaining copies of the judgement for their appeal.\nIn an unprecedented move, the PDP had slammed Nwabunike labelling his ruling as “a black-market judgement which cannot stand in appeal”.\nAlready regarded as a frontrunner in the November poll, Valentine Ozigbo, who describes himself as a child of grace, is the immediate past President and Group CEO of Transcorp Plc.\nHis emergence as the candidate of the PDP in the keenly contested primary is regarded as one of the most inspiring stories in Nigeria’s recent political history."
  },
  {
    "headline": "You lack capacity to police Katsina, Masari tells IGP",
    "summarized_story": "Masari said the policemen in the were not enough to arrest the the security situation in the state.\n“Katsina State has a population of about eight million people and how many policemen do we have in Katsina State?\n“From my assessment of policemen in the local government areas, I don’t think we have up to 3,000 policemen in the entire state.\nThey are in South-South battling militants, they are in the South-East battling IPOB, they are in North-East battling Boko Haram and ISWAP and insurgents and they are in the North-West battling bandits.\n“I am in Katsina on a working visit and I will also meet with other arms of security services to see how best to tackle the security situation in the states."
  },
  {
    "headline": "FG mulls compulsory COVID-19 vaccination for its workers",
    "summarized_story": "From Fred Ezeh,, Abuja and Oluseye Ojo, IbadanFederal civil servants may soon be subjected to compulsory COVID-19 vaccination as part of plan to weaken the strength of the disease in Nigeria.\nThis is as government assured that sufficient dose of the vaccine would be made available before the policy on compulsory vaccination for civil servants would be implemented.\nMinister of State for Health, Olorunnimbe Mamora, said the Federal Government was working towards increasing domestic resources for the health sector by pooling ‘sin’ taxes on tobacco and other products.\n“One doubts if Nigeria can yet boast of having 10 million vaccines available for a country with over 200million population.\nIf the Federal Government makes available about 250 million vaccines and Nigerians, who are yet to be vaccinated refused the COVID-19 vaccines, then the government can be justified in its action."
  },
  {
    "headline": "NDDC forensic audit report: Buhari talks tough on mismanaged N6trn",
    "summarized_story": "From Godwin Tsa, AbujaPresident Muhammadu Buhari, yesterday, received the forensic audit report of the Niger Delta Development Commission(NDDC) with a vow to prosecute those who mismanaged about N6trillion allocated to the commission for projects.\nPresident Buhari specifically queried the operation of 362 accounts by the commission without proper reconciliation.\nHe also expressed concerns with multitudes of NDDC’s bank accounts amounting to 362 and lack of proper reconciliation of accounts.\nThe Federal Government will in consequence apply the law to remedy the deficiencies outlined in the audit report as appropriate.\nThe appointment of members of the board of the NDDC had been suspended until the release of the audit report."
  },
  {
    "headline": "Alleged graft: Kogi govt threatens legal action against EFCC",
    "summarized_story": "It said the action by the EFCC has embarrassed the government, insisting that the claims made were false and should be disregarded by the Nigerian public.\nAddressing newsmen in Abuja, Commissioner for Information in Kogi State, Kingsley Fanwo, said it may jettison its decision to sue the EFCC if they tender a public apology.\nThe Lagos Division of the Federal High Court on Tuesday, ordered the freezing of the Kogi State salary bailout account domiciled in commercial bank over an alleged N20 billion loan obtained from it.\n“The Kogi State Government will seek appropriate redress and will resist most vehemently the instant attempt and any further attempt to bring her into disrepute.\n“The letter proceeded to confirm that all the balances in all the accounts operated by Kogi State Government was approximately N46 Million Naira."
  },
  {
    "headline": "Anambra Guber: Appeal Court Declares Ozigbo PDP’s Candidate",
    "summarized_story": "Knocks lawyers for forum shoppingSays INEC should stop acting on orders of trial courtBy Alex EnumahThe Court of Appeal Abuja has declared Valentine Oziigbo as the authentic candidate of the People’s Democratic Party (PDP) in the forthcoming November 6 governorship election in Anambra State.\nThe Court in a unanimous decision set aside the decision of Justice A. O. Nwabunike of a High Court of Anambra State which had earlier declared Senator Ugochukwu Uba as PDP candidate.\nIn the unanimous decision delivered by President of the Court of Appeal, Justice Monica Dongban-Mensem, the appellate court, held that the primary election held at the Professor Dora Akunyuli Women Center, Awka, which produced Ozigbo as PDP candidate, was conducted in line with the law and the PDP guidelines.\nWhile declaring as an aberration the parallel primary held at saint Paul University, it berated Justice Nwabunike for sitting as an appellate court over the judgment of Justice Adeniyi of the Federal Capital Territory (FCT) High Court.\nThe Court accordingly awarded a cost of N10 million against Uba in favour of Ozigbo."
  },
  {
    "headline": "Forensic Audit Uncovers Colossal Mismanagement of N6trn NDDC Funds",
    "summarized_story": "To this end, the president has directed that the report of the forensic audit on the NDDC be forwarded to the Federal Ministry of Justice for necessary action.\n“It is evident that considerable resources have been channeled by the federal government to the development of the Niger Delta from 2001 to 2019.\n“The essence of the forensic audit is to ensure probity and accountability in the use of public funds.\nSpecifically, Buhari disclosed that his administration would apply the law to remedy the deficiencies outlined in the audit report as appropriate.\nHe added: “A Personnel Audit and Review of the governance and organisational structure of NDDC was also carried out."
  },
  {
    "headline": "Osinbajo: African Cross-border Trade Worth $93bn",
    "summarized_story": "*Says AfCFTA is indispensable if industrial development is to take off on the continentDeji Elumoye in AbujaThe Vice President, Prof. Yemi Osinbajo yesterday estimated that the African cross-border informal trade is worth $93 billion.\nThis is just as the vice president begins a four-day official visit to Arusha, Tanzania today.\nIn other words, while our manufacturing industries must be nurtured and supported, they cannot remain infants forever”.\nSimilarly, South African car manufacturers already buy leather for car seats from Botswana.\nMeanwhile, the Vice President is going on a brief official visit to Arusha in Tanzania from Thursday (today) to Monday."
  },
  {
    "headline": "Masari: Nigeria’s Security Forces Overstretched, Poorly Armed",
    "summarized_story": "“While the South-South and South East are stabilising, the situation in the North Central and the North West is getting worse.\n“The counter insurgency efforts of the troops through kinetic and non-kinetic operations compelled the terrorists to surrender in large numbers.\n“Troops within the period arrested criminal informants/collaborators, whose activities have been causing setbacks for own troops’ operations in the zone.\n“During the operations, troops discovered and deactivated a total of 33 illegal refining sites with 46 illegal refining units, 94 boiler ovens and nine reservoirs.\nBrigadier-General Onyeuko said the Armed Forces of Nigeria remained steadfast in the fight against all forms of criminality in different parts of the country."
  },
  {
    "headline": "Price Differentials Fuelling Petrol Smuggling, NNPC Insists",
    "summarized_story": "Emmanuel Addeh in Abuja and Peter Uzoho in LagosThe Nigerian National Petroleum Corporation (NNPC) yesterday maintained that the existing price differential between the amount petrol is sold in Nigeria compared to its neighbouring countries remains a major incentive for smuggling of the commodity across the borders.\nThe NNPC boss noted that concerted efforts by the corporation and some federal agencies to combat the menace of smuggling of petroleum products have been largely hampered by the current arbitrage situation.\nThe NNPC GMD said though the corporation, working in concert with other agencies, has made noticeable progress in combating the menace, the battle was yet to be won.\nOn the MTEF assumptions, the GMD reiterated a base oil price scenario of $57 per barrel for 2022, $61 per barrel for 2023 and $62 per barrel for 2024.\nOther members of the committee were drawn from banking, insurance, and other financial institutions, petroleum resources upstream as well as downstream petroleum sector and gas."
  },
  {
    "headline": "Police Illegally Arrest, Beat Young Nigerian Graduate To Death In Custody",
    "summarized_story": "Men of the Akwa Ibom State Police Command have been accused of beating a fresh graduate of the University of Uyo, Kubiet Akpan to death.\nHis friends who heard about his arrest reportedly went to look for him at the station and some others but the police denied he was in their custody.\nAccording to his friends, they eventually realised Akpan had been killed after his aunt called the police commissioner and people in government.\nIt was also discovered that the police took his body to Headquarters Ikot Akpan Abia mortuary without informing the family.\nOn Monday, friends heard that he was arrested went to search for him at different police stations (including B division) but they denied his arrest."
  },
  {
    "headline": "Police Illegally Arrest, Beat Young Nigerian Graduate To Death In Custody",
    "summarized_story": "Men of the Akwa Ibom State Police Command have been accused of beating a fresh graduate of the University of Uyo, Kubiet Akpan to death.\nHis friends who heard about his arrest reportedly went to look for him at the station and some others but the police denied he was in their custody.\nAccording to his friends, they eventually realised Akpan had been killed after his aunt called the police commissioner and people in government.\nIt was also discovered that the police took his body to Headquarters Ikot Akpan Abia mortuary without informing the family.\nOn Monday, friends heard that he was arrested went to search for him at different police stations (including B division) but they denied his arrest."
  },
  {
    "headline": "Fulani People Are The Biggest Victims Of Kidnapping In Nigeria—Kebbi Governor",
    "summarized_story": "Governor of Kebbi State, Atiku Bagudu has said Fulani people are the major victims of kidnapping and cattle rustling in the country.\n“I have met with many Fulani communities in my state, who explained that they are also victims.\nThey are the first victims of kidnapping and castle rustling,” he said.\n“They are the major victims of kidnapping and then the wider kidnapping that is conducted by other Fulanis and non-Fulanis, who have come to form criminal gangs.\n“Equally, cattle rustling is an activity that is against people who move cattle or who own cattle."
  },
  {
    "headline": "Fulani People Are The Biggest Victims Of Kidnapping In Nigeria—Kebbi Governor",
    "summarized_story": "Governor of Kebbi State, Atiku Bagudu has said Fulani people are the major victims of kidnapping and cattle rustling in the country.\n“I have met with many Fulani communities in my state, who explained that they are also victims.\nThey are the first victims of kidnapping and castle rustling,” he said.\n“They are the major victims of kidnapping and then the wider kidnapping that is conducted by other Fulanis and non-Fulanis, who have come to form criminal gangs.\n“Equally, cattle rustling is an activity that is against people who move cattle or who own cattle."
  },
  {
    "headline": "Fulani People Are The Biggest Victims Of Kidnapping In Nigeria—Kebbi Governor",
    "summarized_story": "Governor of Kebbi State, Atiku Bagudu has said Fulani people are the major victims of kidnapping and cattle rustling in the country.\n“I have met with many Fulani communities in my state, who explained that they are also victims.\nThey are the first victims of kidnapping and castle rustling,” he said.\n“They are the major victims of kidnapping and then the wider kidnapping that is conducted by other Fulanis and non-Fulanis, who have come to form criminal gangs.\n“Equally, cattle rustling is an activity that is against people who move cattle or who own cattle."
  },
  {
    "headline": "Appeal court declares Ozigbo as PDP candidate for Anambra governorship election",
    "summarized_story": "The court of appeal in Abuja has declared Valentine Ozigbo as the validly-nominated candidate of the Peoples Democratic Party (PDP) for the forthcoming Anambra state governorship election.\nThe electoral body said its decision not to list the name of any PDP candidate was in recognition of court orders served in relation to the primary election of the party.\nIn his ruling, Obiora Nwabunike said the court order, which restrained the PDP from conducting the primary election, had neither been stayed nor set aside.\nHe said the PDP erred by not clearing every legal huddle before the primary election, hence the process was in defiance of the law.\nAdvertisementHowever, delivering judgment in Ozigbo’s appeal, the appellate court, set aside the July 19, 2021 judgment by Nwabunike and recognised the governorship primary election which produced Ozigbo."
  },
  {
    "headline": "Appeal court declares Ozigbo as PDP candidate for Anambra governorship election",
    "summarized_story": "The court of appeal in Abuja has declared Valentine Ozigbo as the validly-nominated candidate of the Peoples Democratic Party (PDP) for the forthcoming Anambra state governorship election.\nThe electoral body said its decision not to list the name of any PDP candidate was in recognition of court orders served in relation to the primary election of the party.\nIn his ruling, Obiora Nwabunike said the court order, which restrained the PDP from conducting the primary election, had neither been stayed nor set aside.\nHe said the PDP erred by not clearing every legal huddle before the primary election, hence the process was in defiance of the law.\nAdvertisementHowever, delivering judgment in Ozigbo’s appeal, the appellate court, set aside the July 19, 2021 judgment by Nwabunike and recognised the governorship primary election which produced Ozigbo."
  },
  {
    "headline": "Sale Mamman: Why I stayed away from my residence after Buhari fired me",
    "summarized_story": "Sale Mamman, former minister of power, has explained why he stayed away from his residence after his sacking by President Muhammadu Buhari.\nAdvertisementThe minister was fired alongside Sabo Nanono, the minister of agriculture and rural development, by the president on Tuesday.\nThere was a rumour that Mamman collapsed and was admitted to a hospital in Abuja after he received the news of his dismissal.\nAdvertisement“I found a serene and quiet environment to rest and take medication as recommended by the doctor.\nI didn’t stay at home because sympathisers are trooping to console me; this would prevent me from resting and convalescing on time."
  },
  {
    "headline": "Sale Mamman: Why I stayed away from my residence after Buhari fired me",
    "summarized_story": "Sale Mamman, former minister of power, has explained why he stayed away from his residence after his sacking by President Muhammadu Buhari.\nAdvertisementThe minister was fired alongside Sabo Nanono, the minister of agriculture and rural development, by the president on Tuesday.\nThere was a rumour that Mamman collapsed and was admitted to a hospital in Abuja after he received the news of his dismissal.\nAdvertisement“I found a serene and quiet environment to rest and take medication as recommended by the doctor.\nI didn’t stay at home because sympathisers are trooping to console me; this would prevent me from resting and convalescing on time."
  },
  {
    "headline": "Lawyer: DSS stopped us from visiting Nnamdi Kanu despite court order",
    "summarized_story": "Ifeanyi Ejiofor, counsel to Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), says the Department of State Services (DSS) prevented himself and Bruce Fein, IPOB’s lawyer in the US, from visiting the detained leader.\nBinta Nyako, the judge, ruled that access to Kanu at the DSS should be regimented.\nEjiofor said the DSS gave the excuse despite a formal notification of the visit, and described the development as a violation of the court order.\n“This is not only ridiculous but a clear violation of the Court Order on guideline for visiting our Client- Onyendu Mazi Nnamdi Kanu.\nAdvertisement“Needless to mention, that no one individual has been specifically assigned to receive us on any of the visits."
  },
  {
    "headline": "Fintech Focus: The link between Open Banking and financial inclusion",
    "summarized_story": "In their place, fintech firms are extending access to financial services in these areas through agent networks and mobile money wallets.\n“Open Banking is a major step forward in solving restricted access to financial services in Nigeria,” said Orioke.\nNigeria’s central bank also recently launched draft regulations for Open Banking, which establishes principles for data sharing across the banking and payments ecosystem.\nOpen Banking could be the ultimate solution to all current difficulties with access to financial services in Nigeria,” Orioke said.\nConsidering its numerous benefits and rapid adoption, Open Banking could potentially revolutionise the financial services ecosystem in Nigeria and go down as one of the most important innovations in the financial inclusion drive."
  },
  {
    "headline": "Ridelink raises $150k pre-seed to build e-logistics technology for East Africa",
    "summarized_story": "Ridelink, an Ugandan e-logistics platform, has just closed a $150k pre-seed investment round to improve its technology and double down on its marketing efforts.\nThe investment was birthed from the startup’s partnership with Ortus Africa Capital, Omidyar Network and African Leadership Academy’s Young Entrepreneurs Fund(Anzisha).\nFounded in 2017 by Daniel Mukisa, Ridelink operates an e-logistics platform developed to seamlessly connect SMEs to a network of transport operators.\nThough Ridelink launched its operation in Uganda, it has since expanded and serves business hubs across East Africa – in the urban, peri-urban and rural Uganda, Kenya and Tanzania.\n“The Young Entrepreneurs Fund is designed to incentivise co-investments into graduates of our programs like Daniel who have chosen to become career entrepreneurs.” said Thokoza Mjo of the Anzisha Prize, who manages the fund."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "How customer loyalty is helping Nigerian fintech apps through regulatory crackdown",
    "summarized_story": "The crackdown by the apex bank could result in severe unintended casualties for the companies; but above all, it puts at risk what is arguably their most valuable asset — customers’ trust.\nAnd the fintech platforms affected by CBN’s move — Trove, Risevest, Bamboo, and Chaka — know this.\nGet the best African tech newsletters in your inboxBeyond offering financial products with attractive investment returns, the startups have invested in building a customer trust and loyalty bank.\nSo I was already calm knowing that my money was safe,” Motunrayo Koyejo, a software engineer and Rise Vest user, told TechCabal.\nI mean Nigerian startups almost always have a way of figuring things out.”Another Cowrywise user, Mosopefoluwa Okeowo, told TechCabal she thinks fintech startups will always find a solution."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "On the heels of $40 million Series A in July — one of the largest fundings in the Middle East and North Africa (MENA)..."
  },
  {
    "headline": "Rwanda’s new SIM registration, Somalia’s Trade Information Portal, Cellulant’s partnership with GAINDE 2000",
    "summarized_story": "Share this article:Good day,Today, I’m discussing:Rwanda’s new SIM registration directivesSomalia’s Trade Information PortalCellulant’s partnership with GAINDE 2000 to improve Africa’s tradeRwanda’s new SIM registration directivesWhat’s the news?\nSomalia has developed a Trade Information Portal with the assistance of the International Finance Corporation (IFC) to reduce costs and simplify trade procedures for Somali importers and exporters.\nWhat’s more, the Trade Information Portal will help the Somali business community find needed information to facilitate their import-export activities.\nCross-border trade between Somalia and its neighbour is expected to increase following the launch of the Trade Information Portal.\nWhy GAINDE 2000?"
  },
  {
    "headline": "Building Shopify for Africa: Nigeria’s Bumpa plans to digitise thousands of African businesses",
    "summarized_story": "Share this article:Nigerian eCommerce startup, Bumpa, has raised a $200,000 pre-seed to digitise thousands of African businesses on its platform.\nAdvertisementAfter school, Opayele founded HostCabal, a company that helps small businesses host their businesses online.\nSo the idea was to figure out how to get businesses online because they were completely offline and lacked the resources to digitise their operations.\nBumpa helps merchants grow their businesses onlineThe startup, which Umechukwu calls “Shopify for Africa,” assists merchants and businesses in moving their operations online.\nThe co-founders, therefore, believe that small businesses will grow if offered Bumpa as a solution product."
  },
  {
    "headline": "Experts explain how founders can strategically avoid the pitfalls of business partnerships",
    "summarized_story": "Prudence’s story — a true one, I should add — is only a simple example of what can go wrong in a business partnership.\nA study shows that 70% of business partnerships fail and 90% of startups ultimately fail in the first 10 years mainly because of bad partnerships.\nA good example is a business owner whose elaborate long-term plans are far removed from a prospective partner’s short-term financial goals.\nSome contracts have an exclusivity clause restricting startups from entering other partnerships for the duration of the contract.\nWellaHealth on the other hand, as a healthtech startup, can find partnerships with a mobility company or a payments company, or vice versa."
  },
  {
    "headline": "Real estate fund beats peers to post highest asset growth year-to-date",
    "summarized_story": "Nigeria’s real estate fund, one of the seven mutual fund collective investment vehicles regulated by the Securities and Exchange Commission (SEC), has beat its industry peers to post the highest jump in asset growth year-to-date.\nThe asset managed by the property funds soared 20.18 percent to N50.86 billion as of August 20 from N42.32 billion…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "VAT ‘war’ between FIRS, States leaves businesses confused",
    "summarized_story": "Taxpayers and business owners are scratching their heads over the authority to remit Value Added Tax (VAT), as the Federal Inland Service (FIRS) and state governments lay claim to the right to collect taxes.\nIn Rivers State for example, the state government has signed into law its VAT Law No.\n4 of 2021, making it…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigeria’s Northern governors run out of ideas to tackle insecurity",
    "summarized_story": "Aminu Masari, governor, Katsina State (North Western), has ordered the closure of Jibia-Gurbin Baure and Kankara-Sheme roads gateways to the states commercial cities to all motorists until further notice.\nIn Zamfara, Governor Bello Matawalle has opened a backchannel to start peace talks with the terrorists, a capitulation, dressed as negotiation.\n“Rural banditry in the northwestern states of Zamfara, Kaduna and Katsina has reached alarming heights in recent years.\nNigeria’s Northern region is fast morphing into killing fields as marauding gangs armed with military-grade weapons pillage communities, raid farms, rape women and abduct children.\nAnalysts say these are missing links in Nigeria’s engagement with terrorists."
  },
  {
    "headline": "COVID-19: Edo receives additional 40,012 doses of Moderna vaccines – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State has received additional 40, 012 doses of Moderna vaccines from the Federal Government, as the state intensifies the second phase COVID-19 vaccination exercise to protect more Edo citizens from the deadly virus.\nExecutive Secretary of Edo State Primary Healthcare Development Agency (EDSPHCDA), Dr. Julie Erhabor, received the vaccines at the Benin Airport on Thursday.\nShe urged residents who have not been inoculated to come out and get the vaccination, noting that the vaccines are safe, free and effective.\nAccording to her, “We have received another 40,012 doses of Moderna vaccines, accompanied with syringes for the administration of the vaccines, as well as safety boxes.\n“The new batch of vaccines is an addition to the 65,016 doses of Moderna, which we received on August 20, 2021."
  },
  {
    "headline": "Delta Communities Get A Boost In Health Care Delivery, Courtesy Of NNPC",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – Two Delta Communities of Egbema-Gbaramatu kingdom and Ogidigben in Warri South-West and Warri North local government areas of Delta State,yesterday got a boost in their health care delivery as Nigerian National Petroleum Corporation (NNPC) and Chevron Nigeria Ltd Joint Venture (CNL) donated assorted healthcare equipment and pharmaceutical products to two cottage hospitals.\nThe hospital equipment, including pharmaceutical products, worth millions of naira, were donations to the two CNL-sponsored cottage hospitals at Tsekeluwu and Oporoza, headquarters of Gbaramatu kingdom and the Government Cottage hospital at Ogidigben in Warri Kingdom.\nThe equipment were received in Warri on behalf of the cottage hospitals by the Egbema- Gbaramatu Communities Development Foundation (EGCDF) as well as the Itsekiri Regional Development Committee (IRDC).\n“We thank the Delta State Government for always supporting the GMoU.\nMr. Brikinn appreciated the Delta State Government, traditional rulers of Egbema-Gbaramatu kingdoms and the Warri kingdom as well as the entire people for their commitment and support in actualizing the objectives of the GMoU."
  },
  {
    "headline": "Edo PDP trains officials, set for launch of e-registration exercise – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State chapter of the Peoples Democratic Party (PDP) has commenced the training of its officials to ensure seamless electronic registration exercise of new and old party members ahead of the launch of the exercise across the state.\nChief of Staff to Edo State Governor, Hon.\nOsaigbovo Iyoha, who addressed the officials during the training at Imaguero College, Benin City, said officials being trained include party delegates and prospective appointees.\nHe said the exercise is aimed at creating an electronic register of all party members to digitize and secure the party’s membership data, adding, “The exercise is aimed at generating a unique membership identification number for each member.\n“The governor has deemed it necessary that people that are going to work with him should be given the chance to be part of the process."
  },
  {
    "headline": "COVID-19 vaccination: Edo insists party, wedding, other social, religious event attendees must be vaccinated to access venues – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the government will, by mid-September 2020, enforce the directive on denial of access to large gatherings in public and private places in the state for persons who choose not to be inoculated with the COVID-19 vaccines.\nObaseki, who spoke to journalists in Benin City, said his administration remains committed to ensuring the health and safety of citizens and will explore every option available for the protection of the best interests of Edo people.\nHe noted that the government will proceed with the enforcement of the ‘no vaccination card, no access to large gatherings’ in the state, despite the order by a High Court sitting in Port Harcourt, Rivers State, directing the government to maintain the status quo on the purported ‘compulsory vaccination’ of its citizens with the COVID-19 vaccine.\n“We also want to stress that the government is commencing intensive enforcement of use of Non-Pharmaceutical Interventions (NPIs) to curb the current spike in COVID-19 infections and deaths.\nThese measures include compulsory wearing of facemasks, regular washing of hands under running water and/or use of hand sanitisers, and maintenance of recommended social and physical distancing in public places, among others.”..."
  },
  {
    "headline": "2023: Only Tinubu can consolidate Buhari’s achievements – Group",
    "summarized_story": "The Nigeria Diaspora for Asiwaju (NDA), a support group, has said the support for the former governor of Lagos State, Bola Tinubu, to run for presidency in 2023 is a collective task.\nIt said everyone should support Mr Tinubu to become president, irrespective of tribal or religious sentiments.\nMr Badeji, a UK-based chieftain of the All Progressives Congress (APC), said this after inaugurating the group.\n“NDA is a partisan group aimed at garnering support in the Diaspora and across the length and breadth of Nigeria for Tinubu presidency, come 2023,’’ Mr Badeji said.\nHe described Mr Tinubu as a leader of leaders, a political colossus, and an embodiment of progressive politics."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Nigerian Customs seize donkey hides, charcoal worth N644m",
    "summarized_story": "The Comptroller General of Strike Force, Zone A, Nigerian Customs Service (NCS) Ahmadu Shuaibu, says the unit has intercepted N643.73 million worth of poisonous Donkey hides and skin, charcoal, and wood already kept in a warehouse in Apapa set to be moved to the Apapa port for export.\nShuaibu who made the disclosure while briefing the press at Ikodoru over the seizures, said the seized items were discovered stacked in a warehouse not too far from Apapa port and that those behind the illegal storage took to their heels on sighting the Customs team.\nAccording to him, the export prohibition guideline is in tandem with the Federal Government’s policies for the protection of endangered species, protection of the local economy and to promote the National Forest Policy that was approved by the Federal Executive Council, which according to him, is aimed at greatly assisting the nation’s sustainable management of its vast forest resources against deforestation."
  },
  {
    "headline": "Appeal Court declares Valentine Ozigbo rightful PDP candidate for Anambra guber",
    "summarized_story": "The Court of Appeal, Abuja Division, has declared Mr Valentine Ozigbo as the validly elected governorship candidate of the People’s Democratic Party, (PDP) for the November 6 Anambra State governorship election.\nDelivering judgment, President of the Court of Appeal, Justice Monica Dongban- Mensem, who led a three- man panel of justices, held that the appeal filed by Valentine Ozigbo, challenging the judgement of the Akwa High Court had merit.\nThe court set aside the decision of the Akwa High Court and declared it null and void and awarded the sum of N10 million exemplary cost in favour of Ozigbo.\nRecall that the judgment of the Awka High Court had barred Ozigbo from parading himself as the PDP candidate in the Anambra gubernatorial election."
  },
  {
    "headline": "Nigerian govt to spend N900bn on fuel subsidy in 2022 despite PIA",
    "summarized_story": "Nigeria’s federal government says it is making provision for the controversial fuel subsidy as part of its expenditure in the 2022 budget.\nThe federal government is projecting N900 billion for fuel subsidy for 2022.\nThe government had in March 2020, announced an end to the fuel subsidy regime and the immediate deregulation of the downstream sector of the petroleum industry amid a global oil price crash.\nSome groups, including the Nigeria Labour Congress and Trade Union Congress, have advised the government to fix the refineries before removing fuel subsidy.\n“The government is not sure that it can conclude the process of exiting the subsidy regime before the end of 2021 or early 2022, hence the provision of fuel subsidy in the 2022 Appropriation bill,” he said."
  },
  {
    "headline": "Paris Refund: Governors protest as finance minister approves disputed payment to consultants",
    "summarized_story": "Nigerian governors under the aegis of Nigeria Governors’ Forum (NGF), have queried the Minister of Finance, Zainab Ahmed, for issuing promissory notes in favour of judgment creditors relating to Paris and London Club refunds despite pending court cases.\n“Specifically, your office has been served with a hearing notice fixing one of the motions for hearing before the federal high court on 29th of September, 2021.\nIn a report by Premium Times, Ibrahim Gambari, chief of staff, Abubakar Malami, attorney-general of the federation, and the finance minister are pushing the payment to six creditors through the issuance of promissory notes to be funded from state governments’ allocations for 10 years.\nThe controversial consultancy fees were also part of allegations that nailed Ibrahim Magu, the former chairman of the Economic and Financial Crimes Commission (EFCC).\nMalami had accused Magu over alleged failure to provide a timely response on the investigation of cases/ individuals related to legal/ consultancy fees in the Paris Club refunds to states and local governments"
  },
  {
    "headline": "COVID-19: African Countries To Miss Crucial Sept Vaccination Goal – WHO official",
    "summarized_story": "ADVERTISEMENTAt the current pace, three more African countries are set to meet the target, while two more could meet it if they speed up vaccinations.\nWhile many African countries have sped up COVID-19 vaccinations as vaccine shipments ramped up in August, 26 countries have used less than half of their COVID-19 vaccines.\nAccording to WHO, COVID-19 cases are declining slightly in Africa but remain stubbornly high.\nThe highly transmissible Delta variant has been found in 31 African countries.\nSingle cases have been found in four other African countries, and very low case numbers have been reported internationally."
  },
  {
    "headline": "COVID-19: African Countries To Miss Crucial Sept Vaccination Goal – WHO official",
    "summarized_story": "ADVERTISEMENTAt the current pace, three more African countries are set to meet the target, while two more could meet it if they speed up vaccinations.\nWhile many African countries have sped up COVID-19 vaccinations as vaccine shipments ramped up in August, 26 countries have used less than half of their COVID-19 vaccines.\nAccording to WHO, COVID-19 cases are declining slightly in Africa but remain stubbornly high.\nThe highly transmissible Delta variant has been found in 31 African countries.\nSingle cases have been found in four other African countries, and very low case numbers have been reported internationally."
  },
  {
    "headline": "Severe Flood Hits U.S. East Coast, 36 Reported Dead",
    "summarized_story": "The devastating storm in the north-eastern United States (U.S.) in the aftermath of Hurricane Ida killed at least 36 people, local authorities said on Thursday.\nIn neighbouring New Jersey, the storm had uncovered roofs and damaged houses, as shown on videos broadcast on TV.\nLate on Wednesday, de Blasio had declared a state of emergency in New York City after record rainfall.\nIda pulverised the previous record that tropical storm Henri had only set a week ago with 49 millimetres of rain in 60 minutes.\nOverall, the summer of 2021 has not only been very hot and sunny in New York City, but also the rainiest in its history."
  },
  {
    "headline": "Severe Flood Hits U.S. East Coast, 36 Reported Dead",
    "summarized_story": "The devastating storm in the north-eastern United States (U.S.) in the aftermath of Hurricane Ida killed at least 36 people, local authorities said on Thursday.\nIn neighbouring New Jersey, the storm had uncovered roofs and damaged houses, as shown on videos broadcast on TV.\nLate on Wednesday, de Blasio had declared a state of emergency in New York City after record rainfall.\nIda pulverised the previous record that tropical storm Henri had only set a week ago with 49 millimetres of rain in 60 minutes.\nOverall, the summer of 2021 has not only been very hot and sunny in New York City, but also the rainiest in its history."
  },
  {
    "headline": "APC Group Commends Buhari Over Recovered N1trn Stolen Funds",
    "summarized_story": "President Muhammadu Buhari has recovered over N1trillion stolen funds from corrupt Nigerians since assumption of office in 2015.\nAn All Progressives Congress (APC) voluntary think-tank group, the APC Legacy Awareness and Campaign, which made this claimhas equally expressed confidence that the president was laying solid and sustainable foundation for Nigeria’s greatness.\n“Billions of Naira in pension funds have been recovered from local and foreign Insurance Companies who have been holding on to assets of the Pension Transitional Arrangement Directorate (PTAD).\n“In 2019 alone, ICPC also recovered 32 billion Naira worth of Land, Buildings and Vehicles.\nIn 2021, the EFCC and ICPC have continued their recovery efforts, with billions of Naira in cash assets already recovered, either through Interim or Final Forfeiture Orders,” the statement read."
  },
  {
    "headline": "COVID-19: NCDC records eight deaths, 631 new cases",
    "summarized_story": "The NCDC, on its verified website on Friday morning, also said that 631 new cases of the virus were recorded in 19 states and the Federal Capital Territory, Abuja.\nThe News Agency of Nigeria reports that the 631 fresh cases reported on Thursday indicated an increase from the 582 cases posted on Wednesday.\nThe agency said that Lagos recorded 172 cases, followed by Oyo with 93 cases and Rivers had 72 infections.\nThe NCDC said that so far, the country had recorded 193,644 cases of the virus since its outbreak in 2020.\nThe NCDC added that a multi-sectoral national Emergency Operations Centre, activated at Level Two, had continued to coordinate the national response activities."
  },
  {
    "headline": "COVID-19: NCDC records eight deaths, 631 new cases",
    "summarized_story": "The NCDC, on its verified website on Friday morning, also said that 631 new cases of the virus were recorded in 19 states and the Federal Capital Territory, Abuja.\nThe News Agency of Nigeria reports that the 631 fresh cases reported on Thursday indicated an increase from the 582 cases posted on Wednesday.\nThe agency said that Lagos recorded 172 cases, followed by Oyo with 93 cases and Rivers had 72 infections.\nThe NCDC said that so far, the country had recorded 193,644 cases of the virus since its outbreak in 2020.\nThe NCDC added that a multi-sectoral national Emergency Operations Centre, activated at Level Two, had continued to coordinate the national response activities."
  },
  {
    "headline": "Twitter: NCC insists ban remains as Nigerians lose N220.36bn",
    "summarized_story": "The Twitter ban in Nigeria is still in effect according to the Director, Public Affairs, Nigerian Communications Commission, Dr Ikechukwu Adinde.\nThe NCC had sent a memo to Mobile Network Operators and Internet Service Providers to block access to Twitter for the ban imposed by the Federal Government to take effect.\nThe Federal Government had since told a Federal High Court in Lagos that it had not stopped Nigerians from using Twitter.\nIn the fourth quarter of 2020, the company generated $556.15m from revenues outside the United States.\nAccording to the tool, it costs Nigeria’s economy N103.17m ($250,600) every hour to ban Twitter."
  },
  {
    "headline": "Twitter: NCC insists ban remains as Nigerians lose N220.36bn",
    "summarized_story": "The Twitter ban in Nigeria is still in effect according to the Director, Public Affairs, Nigerian Communications Commission, Dr Ikechukwu Adinde.\nThe NCC had sent a memo to Mobile Network Operators and Internet Service Providers to block access to Twitter for the ban imposed by the Federal Government to take effect.\nThe Federal Government had since told a Federal High Court in Lagos that it had not stopped Nigerians from using Twitter.\nIn the fourth quarter of 2020, the company generated $556.15m from revenues outside the United States.\nAccording to the tool, it costs Nigeria’s economy N103.17m ($250,600) every hour to ban Twitter."
  },
  {
    "headline": "'The truth will come out': Annie, Charles Idibia blow hot",
    "summarized_story": "Annie Macauley has hit back at the younger brother of her husband Charles Idibia.\nAnnie staged a comeback after Charles accused her of causing disunity in the Idibia family.\nEveryone trying to suck him dry!\nIf trying to protect my husband n the lives of kids makes me evil!\nI am evil them !”However, Charles also responded."
  },
  {
    "headline": "Ronaldo receives Guinness World Record certificate",
    "summarized_story": "Cristiano Ronaldo has been presented with the Guinness World Record certificate of the most goals scored in international football.\nHe noted that it was always good to be recognized as a world record-breaker.\nCristiano Ronaldo finally beat Ali Daei’s longstanding international goalscoring record on Wednesday when he scored two late goals against Ireland, after missing a penalty.\nDaei had held the record since overtaking Ferenc Puskas in 2003, and Ronaldo is now the all-time international scorer in men’s football with 111 goals.\n“Thank you to the Guinness World Records."
  },
  {
    "headline": "Fulani People Are The Biggest Victims Of Kidnapping In Nigeria — Kebbi Governor, Bagudu",
    "summarized_story": "Atiku Bagudu, the governor of Kebbi State, has stated that Fulani people are the main victims of kidnapping and cattle rustling in Nigeria.\nBagudu said in an interview with Channels Television on Thursday that people don’t normally hear about Fulani people who are kidnapped or have their cattle stolen.\nMost Nigerians, according to the governor of Kebbi, do not hear the Fulani people’s side before assigning violent acts to them, noting that kidnappers can be Fulani or non-Fulani.\n“They are the major victims of kidnapping and then the wider kidnapping that is conducted by other Fulanis and non-Fulanis, who have come to form criminal gangs.\n“Equally, cattle rustling is an activity that is against people who move cattle or who own cattle."
  },
  {
    "headline": "Police Illegally Arrest, Beat Young Nigerian Graduate To Death In Custody",
    "summarized_story": "Men from the Akwa Ibom State Police Command have been accused of killing Kubiet Akpan, a recent graduate of the University of Uyo.\nHis friends apparently went looking for him at the station and other locations after learning of his arrest, but the police denied he was in prison.\nAfter his aunt called the police commissioner and government officials, his friends realized Akpan had been killed, according to his acquaintances.\nOn Monday, friends heard that he was arrested went to search for him at different police stations (including B division) but they denied his arrest.\nAfter the struggles, challenges you went through at Uniuyo and they couldn’t allow you to enjoy a bit of it."
  },
  {
    "headline": "JUST IN: Appeal Court Declares Ozigbo PDP Guber Candidate For Anambra",
    "summarized_story": "Valentine Ozigbo, the Peoples Democratic Party’s (PDP) governorship candidate for the November 6 governorship election in Anambra, has been pronounced lawfully elected by the Abuja Division of the Court of Appeal.\nThe President of the Court of Appeal, Justice Monica Dongban- Mensem, who presided over a three-member panel of justices, ruled that Mr Ozigbo’s appeal against the Akwa High Court’s decision had merit.\nThe judgement of the State High Court’s Akwa Division was set aside and declared null and void by the appeal court.\nIt also awarded Ozigbo a sum of N10 million in exceptional costs.\nMr Ozigbo was prevented from running as a PDP candidate in the Anambra governorship election on November 6 following an Awka high court ruling."
  },
  {
    "headline": "Fulani People Are The Biggest Victims Of Kidnapping In Nigeria —Kebbi Governor",
    "summarized_story": "Governor of Kebbi State, Atiku Bagudu has said Fulani people are the major victims of kidnapping and cattle rustling in the country.\nThe Kebbi governor said most Nigerians do not hear the side of the Fulani people, before attributing violent crimes to them, adding that kidnappers can be Fulani and non-Fulani.\n“I have met with many Fulani communities in my state, who explained that they are also victims.\n“They are the major victims of kidnapping and then the wider kidnapping that is conducted by other Fulanis and non-Fulanis, who have come to form criminal gangs.\n“Equally, cattle rustling is an activity that is against people who move cattle or who own cattle."
  },
  {
    "headline": "5,890 terrorists surrender in weeks, Borno receive 565 – DHQ",
    "summarized_story": "The Defence Headquarters (DHQ) Thursday said a total of 5,890 Boko Haram terrorists comprising foot soldiers, their commanders and family members have surrendered to troops of Operation HADIN KAI in the North-east.\nHe said: “Within the period under review, troops of Operation HADIN KAI sustained their operations to terrorists in the North-east theatre.\nThe counter insurgency efforts of the troops through kinetic and non-kinetic operations compelled the terrorists to surrender in large numbers.\n“Suffice to note that, within the last few weeks, more than 5,890 terrorists comprising foot soldiers and their commanders have surrendered with their families to own troops in the North-east Zone.\nFurthermore, the Kawo weekly market which usually holds every Tuesday in Kaduna North LGA has been suspended with immediate effect."
  },
  {
    "headline": "It is God’s wish I am governor today, so second term lies with him, Osun people – Adegboyega",
    "summarized_story": "I’ve heard people talk about possibility of second term, that’s not the issue.\nThey have not been committal if they will support you for a second term in office.\nSo, the issue of second term is left to God and the people of Osun to decide.\nWell, your excellency, you have series of endorsements of late, many groups coming out to say, we endorse you for second term.\nWe want the governor to run for a second term."
  },
  {
    "headline": "NDDC got N6trn in 8 years – FG",
    "summarized_story": "The federal government Thursday expressed concerns over 13,777 projects being handled by the Niger Delta Development Commission (NDDC), saying their execution was “substantially compromised.”The government also said the agency got N6trillion in eight years and maintained 362 bank accounts lacking proper reconciliation.\n“The federal government is particularly concerned with the colossal loss occasioned by uncompleted and unverified development projects in the Niger Delta region, in spite of the huge resources made available to uplift the living standard of the citizens.\n“We have on record over 13,777 projects, the execution of which is substantially compromised.\nIt is against this background that the federal government will without hesitation strategically implement all aspects of the audit exercise that will promote probity and greater prosperity for the Niger Delta Region and Nigeria as whole,” the AGF explained.\nHe said the recent Petroleum Industry Act was to “to bring about the prudence and accountability in the Petroleum Sector and to give a sense of participation and ownership to the host communities.”"
  },
  {
    "headline": "Terrorism: Nigeria, Turkey to strengthen Defence Relation -NigPilot",
    "summarized_story": "The Nigerian Army and its Turkish counterpart have pledged to strengthen Defence relations to tackle terrorism.\nAmbassador Bayraktar said the purpose of the visit was to improve upon the existing relationship between the two countries and assist Nigeria in its fight against terrorism.\nThe Ambassador further averred that like Nigeria, Turkey had equally been confronted with challenges of insecurity, pointing out that the Defence Corporations of both countries have to come into mutual agreement in order to curtail the activities of terrorists in both countries.\nThe Chief of Army Staff (COAS), described the visit as an opportunity to further enhance the existing cordial relationship between both countries, particularly the Land Forces of Turkey.\nHe disclosed that during his recent tour of Turkey, he paid a visit to the Turkish Defence Corporation, describing it as a very insightful tour."
  },
  {
    "headline": "Army denies alleged recruitment in 44 NA Reference Hospital -NigPilot",
    "summarized_story": "The Nigerian Army (NA) on Wednesday denied the alleged ongoing sales of Graduate Internship forms for recruitment into 44 Nigerian Army Reference Hospital Kaduna (NARHK).\nAccording to the statement, “The Nigerian Army (NA) has been notified of an advert making the rounds in the social media on sales of Graduate Internship forms for recruitment into 44 Nigerian Army Reference Hospital Kaduna (NARHK).\nThese online fraudsters are warned to desist from such criminal activities, which adversely affect the image and reputation of the Nigerian Army.\nIt is also important to state that at present, the Nigerian Army has not put out any advert for sales of forms.\nThe Nigerian Army however, reiterated that all activities relating to Graduate Internship recruitment into the 44 NARHK are usually publicized in the print and traditional electronic broadcast media when the need arises."
  },
  {
    "headline": "COAS vows to demystify invaders of NDA -NigPilot",
    "summarized_story": "Academy Public Relations Officer, Major Bashir Muhammad Jajira in a statement explained that the COAS made this pledge on Tuesday when he paid a visit to the Academy over the recent security breach in the Academy.\nGeneral Yahaya visited the Academy to get a firsthand brief on the incident and to commiserate with the commandant NDA, Maj Gen IM Yusuf, and the NDA community.\nThe COAS also undertook an on-the-spot assessment of the scene of the incident before departing the Academy.\nIn his welcome address, the Commandant NDA briefed the COAS on the security breach into the Academy which occurred on 24 August 2021.\nThe Commandant informed the COAS that these support measures have really boosted the morale of the staff and the security of the Academy."
  },
  {
    "headline": "Lukman to Ortom: Present your evidence of “fulanization”, “islamization” agenda -NigPilot",
    "summarized_story": "A chieftain of the All Progressives Congress, APC, and Director-General of Progressive Governors Forum, PGF, Dr. Salihu Moh.\nLukman has challenged Benue State governor, Samuel Ortom, to provide evidence of his claim that there is a sinister plot by the government of President Muhammadu Buhari to turn Nigeria into a Fulani and Islamic caliphate.\n“On the part of Governor Ortom, he claimed that he has forwarded his evidence to President Buhari and security agencies in the country.\nBut for a public servant as highly placed as that of a Governor, retire public servant, retire security personnel, etc.\nit portends a big danger, which if overlooked can produce a cult mentality in the country with all the ethnic and religious hatred associated with it."
  },
  {
    "headline": "UPDATED: Appeal Court Declares Valentine Ozigbo Anambra PDP Gov Candidate",
    "summarized_story": "The Court of Appeal sitting in Abuja has declared Valentine Ozigbo as the validly elected candidate of the Peoples Democratic Party (PDP) for the Anambra Governorship election slated for November 6, 2021.\nThe court held that the appeal challenging the judgement of the Awka High Court, which barred him from parading himself as the PDP candidate in the coming election, had merit and was, therefore, allowed.\nIn July, INEC dropped Ozigbo’s name from the list of candidates for the election in obedience to a court order.\nBut an unperturbed Ozigbo stated INEC’s reliance on a court order in not publishing his name as the PDP candidate was “a matter of procedure and temporary”.\nThe PDP candidate insisted that the party had forwarded only his name to INEC as its candidate for the forthcoming governorship election in Anambra."
  },
  {
    "headline": "Over 13,000 Projects Abandoned In Niger Delta – NDDC Audit Report",
    "summarized_story": "The Minister of Niger Delta Affairs, Senator Godswill Akpabio has said the Forensic Audit Report of the Niger Delta Development Commission (NDDC) indicated that there are over 13,000 abandoned projects within the coastal region.\n“The report of the audit committee showed that there are over 13,000 abandoned projects in the Niger Delta and even before the submission of the report some contractors have returned to site on their own and completed about 77 road projects.\nAccording to Akpabio, the Niger Delta region has remained backward since 1958 in spite of efforts by successive governments through the creation of various interventionist programmes and projects, a situation he says is changing.\nREAD ALSO: FEC Approves N722.3m For Audit Of NDDCBuhari Receives NDDC Forensic Audit ReportBuhari Orders Forensic Audit Of NDDC Operations From 2001Meanwhile, President Muhammadu Buhari has vowed that the Federal Government will ensure it recovers over N6 trillion allegedly misappropriated in the running of the NDDC between 2001 and 2019.\nConsequently, the President directed that the report of the forensic audit on the NDDC be forwarded to the Federal Ministry of Justice for necessary action."
  },
  {
    "headline": "Identifying Grazing Routes Key To Ending Herder-Farmer Crisis – Gov Bagudu",
    "summarized_story": "Kebbi State Governor Atiku Bagudu on Thursday argued that mapping out grazing routes will help to identify the scale of the herder-farmer crisis.\nCritics have faulted the President’s directive, noting that ranching is a more viable alternative to open grazing.\nREAD ALSO: Kaduna Govt Bans Transportation Of LivestockBut, speaking on Channels Television’s Politics Today, Mr Bagudu said the President’s directive does not preclude the idea of ranching.\n“The committee is to identify grazing routes and work with states and map them.\nIt is not to recover grazing routes, it is to identify the scale of the problem,” Mr Bagudu said."
  },
  {
    "headline": "UNICEF ‘Horrified’ By Zamfara School Abduction",
    "summarized_story": "UNICEF on Thursday said it was horrified by yet another attack on a school in Nigeria, following the abduction of scores of students from Government Day Secondary School Kaya in Maradun Local Government Area of Zamfara State.\n“We strongly condemn this attack, which has happened just a few days after kidnapped students of a school in Niger State, north-central Nigeria, were freed,” UNICEF Representative in Nigeria, Peter Hawkins, said in a statement.\n“We call on the authorities to take expedited action to rescue these students and reunite them with their families.\nConfirming the news, the Zamfara State Police Command described the return of the five students as “unconditional and safe rescue.”The Command also assured residents that the remaining abducted students will safely return to their families.\nMeanwhile, the Zamfara State Government has ordered the immediate closure of primary and secondary schools due to the worsening state of insecurity."
  },
  {
    "headline": "Senegalese Farmers In Tears Over Onion Glut",
    "summarized_story": "But the government also argues that farmers have overproduced this year, flooding the market with onions and depressing prices.\nAmadou Abdoul Sy, the director of Senegal’s market regulation agency, said some 200,000 farmers are employed in the onion sector.\nThe UN’s Food and Agriculture Organisation noted in a 2018 report that the use of low-quality seeds by Senegalese farmers contributes to the problem.\nThe president of Senegal’s onion producers association, Boubacar Sall, said the government suspended onion imports in January in a bid to help struggling locals.\nHe said government authorities had asked farmers to sell their goods at different times in order to stop a supply glut."
  },
  {
    "headline": "Court of Appeal recognises Valentine Ozigbo as Anambra PDP candidate -",
    "summarized_story": "The Court of Appeal sitting in Abuja, has declared Valentine Ozigbo, as the validly elected Governorship Candidate of the People’s Democratic party, for the Anambra Governorship election slated for November 6th, 2021.\nThe Three man panel, led by the President of the Court of Appeal, Honorable Justice Monica Dongban- Mensem, held that the appeal filed by Valentine Ozigbo, challenging the judgement of the Akwa High Court, which barred him from parading himself as the PDP candidate in the coming election, had merit and was therefore allowed.\nThe court also set aside the decision of the Akwa High Court, declaring it as null and void.\nIt also awarded the sum of 10million naira in favor of valentine Ozigbo."
  },
  {
    "headline": "27.4m Nigerians earn less than N100,000 per annum",
    "summarized_story": "Bandits Attack Another Zamfara Communi ...\nThe Nigerian Bulk Electricity Trading has named the EKO Electricity D [...]Kaduna Govt.\nThe Kaduna State Government has banned the transportation of livestock [...]Oyo Govt denies stopping Alaafin, Olub ...\nThe Oyo State Government has denied a recent report that it denied two [...]NLC threatens industrial action over p ...\nThe Nigerian Labour Congress has stated that if the Federal Government [...]"
  },
  {
    "headline": "Bandits Attack Another Zamfara Community, Kill 4, Abduct several Others -",
    "summarized_story": "Unknown gunmen have again attacked another Zamfara Community, kill five, abducted Unspecified number locals and carted away food itemsThe Community is Ruwandoruwa in Maru local government area of the stateThe persons abducted are mostly women and childrenThe heavily armed bandits invaded the community at about one o’clock Friday morning in large number on motorcycles withA Source told TVC NEWS that the bandits attacked the community two weeks ago and abducted three personsAccording to him, fifteen million naira ransom was paid to the abductors to get the victims released after days in captivityThose killed by the bandits were buried amidst tears in Ruwandoruwa CemeteryCommunities in Maru local government area have been experiencing attacks and mass abduction of persons especially in Dansadau areaZamfara state government and police authorities in the state are yet to comment on the attack."
  },
  {
    "headline": "Gunmen Attack Police Station, Two Other Communities In Zamfara -",
    "summarized_story": "Bandits have attacked police station in Zamfara and killed a mobile police officer after hours of fire exchange with the policeThey also killed a local vigilante leader and two others in Nahuce and Gidan Janbula Communities of Bungudu local government area of the stateFour persons were also whisked away by the bandits during the InvasionThe Incident happened early hours of Friday when the bandits in their large number with deadly weapons invaded a police station in Nahuce and surrounding villages and spent over an hour exchanging fire with the police and local vigilante groupTVC NEWS Gathered that the local vigilante leader was brutally murdered after resisting many gunshots from the banditsAmong the four kidnap victims are two women and two male including wife of the murdered vigilante leaderSpokesperson of the Zamfara Police command Shehu Muhammad could not be reached for comment as he is not responding to phone calls."
  },
  {
    "headline": "Benue Governor Ortom Complains About His Sex Drive – Trending with Ojy Okpe",
    "summarized_story": "In a now viral video, the Governor of Benue State Samuel Ortom claimed that he has been affected psychologically by insecurity and is unable to engage sexually with his wife especially when he thinks of the people at internally displaced camps.\nIn another development, reactions have trailed the approval of a new Naval Base to be established in Kano State NigeriaSome Nigerians have thrown the governor of Katsina state, Aminu Masari under the bus after he signed an error field executive order."
  },
  {
    "headline": "New Zealand Police Kill ‘Terrorist’ after He Stabs 6 People",
    "summarized_story": "New Zealand authorities said Friday they shot and killed a violent extremist after he entered a supermarket and stabbed and injured six shoppers.\nShe said the man was a Sri Lankan national who was inspired by the Islamic State group.\n“This was a violent attack.\nHe obtained a knife from within the store,” Coster said.\n“Surveillance teams were as close as they possibly could be to monitor his activity.”Coster said that when the commotion started, two police from the special tactics group rushed over."
  },
  {
    "headline": "US Grounds Virgin Galactic Flights Pending Mishap Probe",
    "summarized_story": "The US Federal Aviation Administration (FAA) on Thursday barred Virgin Galactic from flying its SpaceShipTwo until the agency approves its final mishap investigation report from its July flight or determines the issues do not affect public safety.\nThe FAA confirmed on Wednesday it was investigating a deviation in the descent of the flight of the Virgin Galactic rocket plane that carried British billionaire Richard Branson to the edge of space here on July 11.\n“Virgin Galactic may not return the SpaceShipTwo vehicle to flight until the FAA approves the final mishap investigation report or determines the issues related to the mishap do not affect public safety,” the agency said.\nThat flight is to carry three crew from the Italian Air Force and National Research Council, it added.\nBranson was among six Virgin Galactic employees who took part in the July flight, soaring here more than 50 miles (80 km) above the New Mexico desert."
  },
  {
    "headline": "Japan’s Struggling Prime Minister Suga Steps Down, Sets Stage for New Leader",
    "summarized_story": "Japanese Prime Minister Yoshihide Suga said on Friday he would step down, setting the stage for a new premier after a one-year tenure here marred by an unpopular COVID-19 response and rapidly dwindling public support.\nSuga did not capitalise on his last major achievement – hosting the Olympics, which were postponed in 2020 due to the pandemic months before Suga took office as coronavirus cases surged.\nSuga’s decision to not run in a ruling Liberal Democratic Party (LDP) election in September means the party will choose a new leader, who will become prime minister.\nBefore Abe – Japan’s longest-serving prime minister, with an eight-year tenure – the country had gone through six prime ministers in as many years, including Abe’s own troubled first one-year tenure.\nNakano said popular Administrative Reform Minister Taro Kono could run if he gets backing of his faction leader, Finance Minister Taro Aso, while former defence minister Shigeru Ishiba could also run but looks at a disadvantage."
  },
  {
    "headline": "Taliban Co-founder Baradar to Lead New Afghanistan Government",
    "summarized_story": "Taliban co-founder Mullah Baradar will lead a new Afghan government that could be announced soon, sources in the Islamist group said on Friday, as it battled rebel fighters while striving to ward off economic collapse.\nBaradar, who heads the Taliban’s political office, will be joined by Mullah Mohammad Yaqoob, the son of late Taliban founder Mullah Omar, and Sher Mohammad Abbas Stanekzai, in senior positions in the government, three sources said.\n“All the top leaders have arrived in Kabul, where preparations are in final stages to announce the new government,” one Taliban official told Reuters, on condition of anonymity.\nMany Afghans were struggling to feed their families amid severe drought well before the Taliban took power and millions may now face starvation, aid agencies say.\nRECOGNITIONThe Taliban enforced a radical form of sharia, or Islamic law, when it ruled from 1996 to 2001."
  }
]