[
  {
    "headline": "Gynecologist warns against water birth in Nigeria, says ‘it could be risky’",
    "summarized_story": "Amarachi OkehA Consultant Gynaecologist, Dr. Ekiniyi Destiny Ochete, has cautioned Nigerians against engaging in water birth, noting that the delivery method could be risky.\nRecall that a Nigerian celebrity, Korra Obidi, recently shared some clips of her giving birth using the water birth method on her social media platform while in the United States.\nAccording to Ochete, water birth is a birthing method in which the mother chooses to deliver inside a pool of warm water.\nWhy water birth is risky in NigeriaSpeaking further with PUNCH HealthWise, Dr. Ochete noted that there are risks involved with the water birth delivery option.\nIn her words, “The reason why water birth is not advisable in Nigeria for me is that we have little or no equipment to handle emergencies in Nigeria."
  },
  {
    "headline": "Gynecologist warns against water birth in Nigeria, says ‘it could be risky’",
    "summarized_story": "Amarachi OkehA Consultant Gynaecologist, Dr. Ekiniyi Destiny Ochete, has cautioned Nigerians against engaging in water birth, noting that the delivery method could be risky.\nRecall that a Nigerian celebrity, Korra Obidi, recently shared some clips of her giving birth using the water birth method on her social media platform while in the United States.\nAccording to Ochete, water birth is a birthing method in which the mother chooses to deliver inside a pool of warm water.\nWhy water birth is risky in NigeriaSpeaking further with PUNCH HealthWise, Dr. Ochete noted that there are risks involved with the water birth delivery option.\nIn her words, “The reason why water birth is not advisable in Nigeria for me is that we have little or no equipment to handle emergencies in Nigeria."
  },
  {
    "headline": "Technology needed to close sexual, reproductive health system gap –Experts",
    "summarized_story": "Some health practitioners have called on the government and the private sector to leverage technology to provide sexual and reproductive health services to Nigerians, especially youths.\nCo-Founder, HACEY Health Initiative, Dr. Isaiah Owolabi, said advanced technology like artificial intelligence, data management and robotics are critical in formulating good government policies on sexual and reproductive health.\n“Government should do more in closing the gender digital gap and ensure availability of needed health technology in rural communities for youths,“ he said.\nTechnology and Innovation Consultant, Mr. Abiola Oshunniyi, said youths should explore useful health technology to make fortunes.\nHe said they could do this by learning skills that solve sexual and reproductive health issues and engaging in health tech startups and healthcare apps development."
  },
  {
    "headline": "Technology needed to close sexual, reproductive health system gap –Experts",
    "summarized_story": "Some health practitioners have called on the government and the private sector to leverage technology to provide sexual and reproductive health services to Nigerians, especially youths.\nCo-Founder, HACEY Health Initiative, Dr. Isaiah Owolabi, said advanced technology like artificial intelligence, data management and robotics are critical in formulating good government policies on sexual and reproductive health.\n“Government should do more in closing the gender digital gap and ensure availability of needed health technology in rural communities for youths,“ he said.\nTechnology and Innovation Consultant, Mr. Abiola Oshunniyi, said youths should explore useful health technology to make fortunes.\nHe said they could do this by learning skills that solve sexual and reproductive health issues and engaging in health tech startups and healthcare apps development."
  },
  {
    "headline": "VIDEO: NDLEA appoints NURTW boss, MC Oluomo, ‘ambassador of war against drug abuse’",
    "summarized_story": ""
  },
  {
    "headline": "We are overcoming Security Challenges – Gen Irabor",
    "summarized_story": "Chief of Defence Staff, Lucky IraborSays Peace is gradually returning to Nigeria’s troubled areasBy: Kingsley Omonobi – Abuja.\nThe Chief of Defence Staff, CDS, General Leo Irabor, on Saturday expressed delight that peace is gradually returning to several parts of the country, that were hitherto troubled by various security challenges.\nREAD ALSOWe are not recruiting now ― ArmyTowards this end, Irabor said, “This year should be a turn around, a turning point in overcoming all the security challenges facing our nation.\nWe can all observe the tension that is brewing around the world coupled with the various security challenges we are facing here in our country.\nThe ‘Day Run’ was organized for officers and men of the Nigerian Armed Forces and their counterparts from sister security Agencies."
  },
  {
    "headline": "Okowa salutes Obasanjo at 85",
    "summarized_story": "Governor Ifeanyi Okowa of Delta StateGovernor Ifeanyi Okowa of Delta has congratulated former President of Nigeria, Chief Olusegun Obasanjo, as he clocked 85 years.\nHe described the octogenerian as an epitome of nationalism and statesmanship and lauded him for his sustained contributions to peace and unity in Nigeria.\nOkowa remarked that the former president had, through acknowledged efforts and effect, etched his name and Nigeria’s in global reckoning, adding that he was a well-respected personality in global affairs.\n“At 85, you have continued to give yourself to the service of our nation in various ways, including your frequent fatherly admonitions to the nation at various levels.\n“I wish you, our dear father, a well-deserved 85th birth anniversary celebration,” he said."
  },
  {
    "headline": "Don’t be willing tools for do-or-die politicians – Buratai advises youths",
    "summarized_story": "The Nigerian Ambassador to the Republic of Benin retired Lt.-Gen. Tukur Buratai has advised Nigerian youths not to let themselves be used as willing tools by do-or-die politicians who want to stir up trouble in their communities.\nBuratai gave the advice in his Message to Nigerian Youths, titled, “Dynamism in Politics and Nigeria’s Founding Fathers”, posted on his verified Facebook page on Friday.\nWe are evolving, and as you can see, the system is improving daily as a result of our leaders’ periodic enhancements to the democratic system.\nIt is the reason I decided to send this message to all Nigerian youths,” he said.\nBuratai also urged Nigerian youths to take the critical issues of participation and a vibrant democratic system in Nigeria as sacrosanct, and embrace what he termed political dynamism."
  },
  {
    "headline": "2023: Bukola will fit into Yaradua’s shoe, wipe away APC failure – Prof Iyorwuese",
    "summarized_story": "READ ALSOEx Kebbi fed law maker rejects Apc factionThe mission of the Bukola Saraki Advocacy and Campaign Council in Katsina State was to present the former Senate President to the PDP state executives, delegates and other stakeholders as Yar’adua’s successor, Prof Iyorwuese stated.\nAccording to Iyorwuese, come 2023, Nigeria need someone who can fit into late president Yar’adua’s shoe and provide the kind of leadership Nigerians enjoyed under his watch for the 2½ years he held sway at the helms of affairs for the nation.\nHe expressed confidence, that a Bukola Saraki’s presidency will be an extension of the legacy of the late Yar’adua’s sterling leadership qualities enjoyed across the length and breadth of the country.\nIyorwuese, further stated that Nigerians are pained with the death of Yar’adua and the country is yet to find its bearing since his sudden demise but assured that Bukola Saraki will fit into his shoes perfectly and wipe away the tears of Nigerians caused by the abysmal failure of the APC led government.\nIn his words: “I want you to know that Yaradua’s death pained Nigerians."
  },
  {
    "headline": "Northern governors’ forum hails former President Obasanjo at 85",
    "summarized_story": "The Northern Governors Forum has felicitated with former President Olusegun Obasanjo on his 85th Birthday.\nDr. Makut Simon Macham, Director of Press & Public Affairs to the Governor of Plateau State and Chairman Northern Governor’s Forum in a statement on Saturday, said at 85, President Obasanjo continues to offer his wise counsel to leaders at various levels as well as participate in national dialogue aimed at tackling insecurity, poverty, disease and intoleranceThe statement while describing President Obasanjo as a nationalist and passionate leader whose patriotism is paramount, added that the Northern Governors Forum appreciates his fatherly counsel and personal interventions towards finding lasting solutions to insecurity in Nigeria, particularly in the Northern RegionHe said the former President has never hidden his belief in the unity, oneness and indivisibility of Nigeria and has thus continued to encourage the younger generation to be positive and shun all actions that will erode national unity, peace and development.\nThe statement wished him many more years in good health and God’s protection, urging him never to relent in lending his voice towards a greater Nigeria."
  },
  {
    "headline": "US-Africa Trade Council appoints Olusiji Aina as advisory board member",
    "summarized_story": "The United States-Africa Trade Council has appointed Nigeria’s Olusiji Aina as a member of its Advisory Board.\nAina, a Development Economist and Impact Investing Specialist, is competent in building high impact market-relevant skills, creating employment and promoting economic growth in Africa.\nHe is a Chartered Development Finance Analyst (CDFA), Chartered Global Investment Analysts (CGIA), Associate, Chartered Institute of Economist of Nigeria (ICEN), Fellow Institute of Information Management (FIIM).\nAina serves on national and international boards among which are Impact Amplifier Foundation, Cognity Advisory Services and African Intellectual Resource Salus Trust.\n“Aina is the Co-Chairman, Kogi State Economic Council, Board member, Kogi State Investment Promotion Council, and member of Kogi State Youth Development Commission”, it added."
  },
  {
    "headline": "Boko Haram: Peace returning to troubled parts of Nigeria – Defense Chief, Irabor",
    "summarized_story": "The Chief of Defence Staff, Gen. Lucky Irabor, has assured Nigerians that the year 2022 will see peace returning to all troubled parts of the country.\nIrabor gave the assurance on Saturday in Abuja at the 2022 International Military Sports Council’s Day Run for the armed forces and security agencies with the theme: “Running for World Peace’’.NAN reports.\nAccording to him, peace is returning to various troubled parts of Nigeria and the security forces have been playing their roles at redressing the challenges.\n“I am hopeful that for us in Nigeria, the peace that we have yearned for all these years will be a turning point this year.\nWe appeal for more support and I believe that Nigerians and of course, every other friend of Nigeria will support the armed forces to install an environment that is peaceful,’’ he stressed."
  },
  {
    "headline": "Kano NLC rejects state government’s reversal to old salary scale",
    "summarized_story": "The Nigeria nLabour Congress (NLC), Kano State has on Saturday, said it would not accept the planned pay cut by the government.\nThe group in a statement by Kabiru Ado Minjibir, Kano state NLC chairman, said it would not accept any attempt by the state government to return to the old salary scale, as shown in the February salary.\nDescribing the salary pay cut as, “government’s sabotage plan,” the NLC noted, the union met with the government and made three recommendations on how to go about the issue, as it was resolved, the government accepted two of the recommendations but turned down the one that has to do with the commitment of paying workers the shortfall in their salaries once the FAAC allocation of the state improvesAccording to him, although the government said it could not pay N30,000 minimum wage to workers due to a shortfall in the FAAC allocation accrued to the state, the NLC suggested three ways to resolve the issue and the government turned down their recommendations.\nAccording to the state Charman, the NLC has outrightly rejected the old system of payment, with its salary scale adding that ” NLC has disassociated itself from such pay cuts."
  },
  {
    "headline": "Obasanjo has paid his dues – Gbajabiamila",
    "summarized_story": "The Speaker of the Nigerian House of Representatives Rep. Femi Gbajabiamila has congratulated former president, Chief Olusegun Obasanjo, on his 85th birthday.\nAccording to the post, Gbajabiamila, who described Obasanjo as an elder statesman and a nationalist, said the former president has paid his dues to the Nigerian project.\nThe lawmaker said at 85, Obasanjo exhibits a high sense of patriotism, working to see that Nigeria and Nigerians remain united.\nThe speaker eulogised Obasanjo as one Nigerian whose services to his fatherland are laudable and worthy of emulation.\nGbajabiamila wished the former president continuous good health and God’s protection."
  },
  {
    "headline": "It’s dangerous to disrupt Enugu zoning arrangements’",
    "summarized_story": "Elder statesman and chieftain of the All Progressives Congress (APC), Chief Anike Nwoga, has warned it would be dangerous to distort the existing zoning arrangements for Enugu governorship position in 2023.\nNwoga also cautioned parties against fielding candidates who are not from Enugu East Senatorial District.\nHe explained that any party or candidate going against zoning arrangement for the governorship seat would be swimming against the tide.\nWe believe in the zoning arrangement that first produced former Governor Chimaroke Nnamani from Enugu East, then Sulivan Chime from Enugu West and the current Governor Ifeanyi Ugwuanyi from Enugu North so we must go back to Enugu East and we are not joking about it because it must happen,” he stated.\nHe insisted: “Nobody will take away this mandate from the people of Enugu East, no matter how rich or influential the person is because it’s our turn to become the next governor in Enugu state."
  },
  {
    "headline": "APC Convention: Nwosu, Okorocha’s men make sub-committee list",
    "summarized_story": "Former governorship candidate Uche Nwosu and other members of the Imo chapter of the All Progressives Congress (APC) loyal to former Governor Rochas Okorocha have been appointed into the APC National Convention Sub-Committees.\nIn the list obtained by The Nation and signed by James Akpanudoedehe,Secretary Caretaker/Extraordinary Convention PLANNING Committee, Nwosu, made the list as a member of the Screening Committee.\nThe Imo chapter of the APC has been polarised between factions loyal to Governor Hope Uzodinma and Okorocha, who is also the Senator representing Imo West.\nGovernor Uzodinma and his Ebonyi counterpart Dave Umahi also made it as Chairmen of Screening Appeal and Venue/Decoration Committees, respectively.\nAlso in the APC Sub-Committee are Senator Andy Uba, former Chief of Army Staff, General Azubuike Ihejirika, former Deputy Inspector General of Police, Shuaibu Gambo, Audie Mohammed, among others."
  },
  {
    "headline": "Northern Govs greet Obasanjo at 85",
    "summarized_story": "The Northern Governors Forum has felicitated with former President Olusegun Obasanjo on his 85th Birthday.\nChairman of the Forum and Plateau Governor Simon Bako Lalong, in a statement, described Obasanjo as a nationalist and passionate leader whose patriotism is paramount in all his engagements.\nLalong said at 85, Obasanjo continues to offer his wise counsel to leaders at various levels as well as participate in national dialogue aimed at tackling insecurity, poverty, disease and intolerance.\nHe said the former President has never hidden his belief in the unity, oneness and indivisibility of Nigeria and continued to encourage the younger generation to be positive and shun all actions that will erode national unity, peace and development.\nLalong said the Northern Governors Forum appreciates his fatherly counsel and personal interventions towards finding lasting solutions to insecurity in Nigeria, particularly in the Northern Region."
  },
  {
    "headline": "FG to stem quackery in MDAs with digital stamps",
    "summarized_story": "The Federal Government has replaced the use of seals by professionals and contractors in the mining and geo-science sector with digital stamps.\nThe stamps, which bear the name of the professional or company name and number, the FG says, will help check quackery in the profession.\nThe Minister said this in Abuja at the official launch of the digital stamp by the Council of Nigerian Mining Engineers and Geoscientists (COMEG).\nHe said the use of digital stamps by professional bodies is not new in the country, since lawyers, architects and engineers already use it.\nHis words, “And I think that every profession in the country will come to the realisation at one point or the other that to check quackery, you must have this digital stamps."
  },
  {
    "headline": "APC chairmanship: Aspirants adamant, governors push for open race",
    "summarized_story": "The aspirants have the backing of some APC governors for an open race for all as against imposition of the next chairman.\nPresident Buhari is expected to meet with the aspirants on his return from a two-week medical break.\nThe horse-trading on APC national chairman was in full swing last night.\nContinuing, he said: “The process for the election of a new national chairman has not commenced because the sale of form is yet to begin.\nMeanwhile, a youth group in the party, APC Youth Stakeholders Forum, yesterday kicked against consensus candidacy during the national convention of the party."
  },
  {
    "headline": "The hell we saw in Ukraine – Trapped Nigerians",
    "summarized_story": "By Chika Abanobi, Kate Halim, Chioma Okezie-Okeh, Juliana Taiwo-Obalonye, And Vera Wisdom BasseyNigerians living in Ukraine have described life under the Russian invasion as hellish.\nTheir accounts were corroborated by a Ukrainian as well as Poland-based Nigerian who is helping to take care of his trapped fellow countrymen and women.\nThat’s what we honestly need right now.”Johanna, a 17-year-old Nigerian who also found herself trapped in Ukraine is seriously praying to return to the country alive.\n“I am a Nigerian studying at V.N Karazin National University, Kharkiv, Ukraine,” she told an international electronic medium.\nShe called on the international community, especially the United Nations to tell the truth about what is going on in Ukraine."
  },
  {
    "headline": "Constitution review splits Afenifere, Ohanaeze, MBF",
    "summarized_story": "Afenifere, Ohanaeze Ndigbo, MBF and AYCF hailed some of the amendment bills, including granting autonomy to the 774 local governments councils Nigeria as well as their rejection of life pension for Senate presidents and Speakers of the House of Representatives.\nIt also condemned the attempt to remove the power to conduct local government elections from the State Independent Electoral Commissions (SIEC).\nHe further said: The Kaduna State local government elections conducted by Governor El Rufai can serve as an example of the possibility of having a fair local government election.\nHe noted that the cancellation of state/local government joint account will help the local governments work better as a tier of government.\nHe noted that autonomy for local government councils would allow the ‘commonest’ people be part and parcel of government."
  },
  {
    "headline": "Policeman goes berserk, kills colleagues, others in Borno",
    "summarized_story": "From Timothy Olanrewaju, MaiduguriA policeman in Maiduguri has killed four persons over reported suspicion of alleged infidelity of his wife.\nThe incident was not immediately known in the city until Friday when some residents posted it on their social media platforms.\nWitnesses said the wife of the policeman narrowly escaped being killed as she fled the house on time.\nThe cop reportedly targeted one of his colleagues he allegedly suspected of having an amorous relationship with his wife.\nNeither the police nor family members of the policeman could confirm the claim at press time."
  },
  {
    "headline": "Alleged defilement: We were acting movie script –Baba Ijesha",
    "summarized_story": "Nollywood actor, Olarewaju James, alias Baba Ijesha, on Friday testified before an Ikeja Special Offences Court that he was acting a script in the viral video with a minor.\nBaba Ijesha told the court that the foster mother of the minor, Ms Damilola Adekoya, a comedian also known as Princess, had called and requested him to be part of the movie production.\nThe embattled actor said he asked Princess for the movie location but she told him to come over to her house.\nBaba Ijesha told the court that himself and Princess were directors of the movie, adding that she told him he could act out the scene in the kitchen as well.\nI romanced her based on the movie role Princess gave me."
  },
  {
    "headline": "Presidency: Plot against South East thickens",
    "summarized_story": "Several commentators insist that it is the turn of the South East, urging that anything to the contrary was enough to threaten the unity of Nigeria.\nIgbo Elders Consultative Forum (IECF), was the first to raise the alarm that major political parties were about zoning their presidential position elsewhere other than the South East.\nEzeife warned that the zone would not support any party that failed to field candidate from the South East.\nAlso, President of Alaigbo Development Foundation (ADF), Prof Uzodinma Nwala, has described those against the next president of Nigeria coming from the South East as enemies of democracy.\nUdenta in an interview, argued that the South East in 1999 was clearly denied the Presidency just to favour the South West because of the sentiment of the annulment of the June 12, 1993 election."
  },
  {
    "headline": "NNPC Seeks to ‘Pre-empt Mobil on Asset Sale to Seplat’",
    "summarized_story": "However, THISDAY learnt from officials NNPC, that the state-owned oil giant has opted to exercise its Right of First Refusal (RFR) on the sale of the assets.\nThe RFR is reportedly contained in the Joint Operating Agreement (JOA) of the Joint Venture (JV), which represents NNPC’s position on the planned sale of the shares to Seplat Energy Plc.\nThe source stressed that NNPC did not have the power to halt the acquisition of the multinational oil company’s shares by Seplat.\nSeplat Energy subsequently put forward a winning bid for the assets and reached an agreement with ExxonMobil.\nAkinosho maintained, “NNPC is in JV with companies that produce at least 45 per cent of our crude."
  },
  {
    "headline": "FG Green-lights DCP Kyari’s Extradition to United States",
    "summarized_story": "Few hours after the extradition process commenced, the National Drug Law Enforcement Agency (NDLEA), which currently has Kyari in its custody following his arrest for alleged illicit drug dealing, also initiated a court process against him.\nNDLEA filed an eight-count criminal charge against the defendants at the Federal High Court, Abuja.\nThe implication of the NDLEA court action against Kyari is that he cannot be extradited to the US, even though the federal government has commenced the extradition process.\nHe noted that there was no criminal proceeding pending against Kyari in Nigeria for the same offence.\nThe charge, filed yesterday and marked FHC/ABJ/CR/57/2022, was signed by NDLEA’s Director, Prosecution and Legal Services, Mr. Joseph Sunday."
  },
  {
    "headline": "INEC: We are Not Registering New Parties Because They Won’t Participate in 2023 Elections",
    "summarized_story": "INEC, which claimed that the reason was because the new Electoral Act barred the registration of new political parties to participate in any general election twelve months before, added also that the same new electoral law, allowed for the merger of political parties, only nine months to the general elections.\nThere are currently 18 registered political parties in the country.\nUnder the new law, the Commission shall issue the Notice of Election not later than 360 days before the date fixed for the conduct of elections.\nAccordingly, he said a good knowledge of the law and its provisions would assist in crafting good editorials and holding the Commission and the Political Parties accountable to their implementation.\n“The Commission has introduced an online nomination portal through which Political Parties upload the list and personal particulars of their nominated candidates."
  },
  {
    "headline": "Evacuation of Nigerians Delayed After Flight Exceeded Allotted Duty Hours",
    "summarized_story": "The flight meant to evacuate stranded Nigerians was cancelled because the aircraft overstayed its allotted duty hours.\nThe crew that operated the Air Peace flight from Nigeria to Poland had spent their allotted hours of duty and, according to international standards, they could not exceed the allotted hours.\nThe Nigerian evacuation flight was shifted to early today morning and it was expected to arrive the Federal Capital Territory, Abuja, later today.\nIt means they have already waited five hours and they are going to have nine hours flight.\n“Our institutions are working together to support Ukraine on the financing and policy fronts and are urgently increasing that support."
  },
  {
    "headline": "NDLEA to Arraign Kyari, 4 IRT Members, Files Drug Charges",
    "summarized_story": "This is following the filing of an eighth count criminal charge against the defendants by the National Drug Law Enforcement Agency (NDLEA) at the Federal High Court Abuja.\nKyari and his co-accussed were arrested by the Police on February 12, 2022 and handed over to the Police for investigation over allegations bordering on drug offences.\nThe charge, filed on Thursday and marked FHC/ABJ/CR/57/2022 was signed by NDLEA’s Director, Prosecution and Legal Services, Mr Joseph Sunday.\nIn count one, Kyari, ACP Ubua, ASP James, Inspector Agirigba, and Inspector Nuhu, all of Intelligence Response Team were said to have between January 19 and 25 dealt in 17.\n55 kilograms of cocaine and committed and offence contrary to and punishable under section 14 (b) of the Natural Drug Law Enforcement Agency Act, CAP 30 Laws of the Federation of Nigeria 2004."
  },
  {
    "headline": "BREAKING: Sowore’s Lawyer Arrested Over N200million Lawsuit Against Businessman, Ned Nwoko And Nigeria Police",
    "summarized_story": "Men of the Nigeria Police Force have arrested a lawyer, Abubakar Marshall of the Falana & Falana Chambers for filing a lawsuit on behalf of human rights activist, Omoyele Sowore against businessman and former lawmaker, Ned Nwoko, and the security agency.\nSaharaReporters gathered that Marshall was traced to his home and forcefully arrested by the security operatives for defending the activist.\nThe officers accused the lawyer of embarrassing the Nigerian government, police authorities and Nwoko over his action.\nSowore had during the week filed a lawsuit against Nwoko and the Nigeria Police Force over his illegal arrest and detention last Thursday.\nSee Also Breaking News BREAKING: Sowore Slams N200million Lawsuit Against Businessman, Ned Nwoko And Nigeria Police For Illegal ArrestThe suit is between Omoyele Sowore and the Nigeria Police Force as the first respondent, the Inspector-General of Police as the second respondent, the Commissioner of Police, Abuja and Ned Munir Nwoko as the third and fourth respondents respectively."
  },
  {
    "headline": "BREAKING: Sowore’s Lawyer Arrested Over N200million Lawsuit Against Businessman, Ned Nwoko And Nigeria Police",
    "summarized_story": "Men of the Nigeria Police Force have arrested a lawyer, Abubakar Marshall of the Falana & Falana Chambers for filing a lawsuit on behalf of human rights activist, Omoyele Sowore against businessman and former lawmaker, Ned Nwoko, and the security agency.\nSaharaReporters gathered that Marshall was traced to his home and forcefully arrested by the security operatives for defending the activist.\nThe officers accused the lawyer of embarrassing the Nigerian government, police authorities and Nwoko over his action.\nSowore had during the week filed a lawsuit against Nwoko and the Nigeria Police Force over his illegal arrest and detention last Thursday.\nSee Also Breaking News BREAKING: Sowore Slams N200million Lawsuit Against Businessman, Ned Nwoko And Nigeria Police For Illegal ArrestThe suit is between Omoyele Sowore and the Nigeria Police Force as the first respondent, the Inspector-General of Police as the second respondent, the Commissioner of Police, Abuja and Ned Munir Nwoko as the third and fourth respondents respectively."
  },
  {
    "headline": "BREAKING: Sowore’s Lawyer Arrested Over N200million Lawsuit Against Businessman, Ned Nwoko And Nigeria Police",
    "summarized_story": "Men of the Nigeria Police Force have arrested a lawyer, Abubakar Marshall of the Falana & Falana Chambers for filing a lawsuit on behalf of human rights activist, Omoyele Sowore against businessman and former lawmaker, Ned Nwoko, and the security agency.\nSaharaReporters gathered that Marshall was traced to his home and forcefully arrested by the security operatives for defending the activist.\nThe officers accused the lawyer of embarrassing the Nigerian government, police authorities and Nwoko over his action.\nSowore had during the week filed a lawsuit against Nwoko and the Nigeria Police Force over his illegal arrest and detention last Thursday.\nSee Also Breaking News BREAKING: Sowore Slams N200million Lawsuit Against Businessman, Ned Nwoko And Nigeria Police For Illegal ArrestThe suit is between Omoyele Sowore and the Nigeria Police Force as the first respondent, the Inspector-General of Police as the second respondent, the Commissioner of Police, Abuja and Ned Munir Nwoko as the third and fourth respondents respectively."
  },
  {
    "headline": "Nigerians Have Suffered Worse Than This Before, They’ll Survive Current Fuel Scarcity, Poor Power Supply —Buhari's Aide, Femi Adesina",
    "summarized_story": "The Special Adviser to the President on Media and Publicity, Femi Adesina says Nigerians will survive the current fuel scarcity.\nAdesina in his latest weekly article on Thursday titled “KNOCK, KNOCK.\nHe’s also working night and day, ensuring the country has fuel, power, infrastructure, and all the good things of life.\nI’m gonna knock and ring and tap until you do.” Are you like King Lear at his gloomy worst?\n“Be patient my soul, thou hath suffered worse than this.”“There were cases of bad fuel before in this country."
  },
  {
    "headline": "Nigerians Have Suffered Worse Than This Before, They’ll Survive Current Fuel Scarcity, Poor Power Supply —Buhari's Aide, Femi Adesina",
    "summarized_story": "The Special Adviser to the President on Media and Publicity, Femi Adesina says Nigerians will survive the current fuel scarcity.\nAdesina in his latest weekly article on Thursday titled “KNOCK, KNOCK.\nHe’s also working night and day, ensuring the country has fuel, power, infrastructure, and all the good things of life.\nI’m gonna knock and ring and tap until you do.” Are you like King Lear at his gloomy worst?\n“Be patient my soul, thou hath suffered worse than this.”“There were cases of bad fuel before in this country."
  },
  {
    "headline": "'This is our president' -- Olugbo of Ugboland endorses Tinubu's presidential bid",
    "summarized_story": "Fredrick Akinruntan, Olugbo of Ugbo Kingdom in Ondo, has endorsed the presidential bid of Bola Tinubu, chieftain of the All Progressives Congress (APC).\nThe monarch spoke while hosting the APC chieftain in Ondo state on Friday.\nAkinruntan said regardless of other aspirants contesting for the presidency, Tinubu “is our president”.\nAnd he has been a sort of controller of this country,” the Olugbo said.\nWhen they met us, we sought your support, and Buhari became the president."
  },
  {
    "headline": "'This is our president' -- Olugbo of Ugboland endorses Tinubu's presidential bid",
    "summarized_story": "Fredrick Akinruntan, Olugbo of Ugbo Kingdom in Ondo, has endorsed the presidential bid of Bola Tinubu, chieftain of the All Progressives Congress (APC).\nThe monarch spoke while hosting the APC chieftain in Ondo state on Friday.\nAkinruntan said regardless of other aspirants contesting for the presidency, Tinubu “is our president”.\nAnd he has been a sort of controller of this country,” the Olugbo said.\nWhen they met us, we sought your support, and Buhari became the president."
  },
  {
    "headline": "Russia declares partial ceasefire to allow civilians leave two Ukrainian cities",
    "summarized_story": "Russia has declared a partial ceasefire to allow civilians leave the cities of Mariupol and Volnovakha in Ukraine.\n“From 1000 am Moscow time, the Russian side declares a ceasefire and the opening of humanitarian corridors to allow civilians to leave Mariupol and Volnovakha,” the defence ministry stated.\nAdvertisementPavlo Kirilenko, governor of the Donetsk Oblast region where the two cities are sited, confirmed the ceasefire on Facebook.\n“We are negotiating with the Russian side to confirm the ceasefire along the entire route of evacuation for civilians from Mariupol,” the governor said.\nVolodymyr Zelenskyy, Ukrainian president, said the temporary ceasefire will allow women and children to leave the area."
  },
  {
    "headline": "Russia declares partial ceasefire to allow civilians leave two Ukrainian cities",
    "summarized_story": "Russia has declared a partial ceasefire to allow civilians leave the cities of Mariupol and Volnovakha in Ukraine.\n“From 1000 am Moscow time, the Russian side declares a ceasefire and the opening of humanitarian corridors to allow civilians to leave Mariupol and Volnovakha,” the defence ministry stated.\nAdvertisementPavlo Kirilenko, governor of the Donetsk Oblast region where the two cities are sited, confirmed the ceasefire on Facebook.\n“We are negotiating with the Russian side to confirm the ceasefire along the entire route of evacuation for civilians from Mariupol,” the governor said.\nVolodymyr Zelenskyy, Ukrainian president, said the temporary ceasefire will allow women and children to leave the area."
  },
  {
    "headline": "FAO: Global food prices reached all-time high in February",
    "summarized_story": "The Food and Agriculture Organisation (FAO) says global food prices reached an all-time high in February — driven by vegetable oils and dairy products.\nIn a statement on Friday, FAO said the food price index (FPI), which tracks changes in the international prices of items of commonly traded food commodities, averaged 140.7 points in February, up 3.9 percent from January.\n“Concerns over crop conditions and adequate export availabilities explain only a part of the current global food price increases.\nA much bigger push for food price inflation comes from outside food production, particularly the energy, fertiliser and feed sectors,” said FAO economist Upali Galketi Aratchilage.\nThe overall rise in FPI was led by an 8.5 percent increase in the FAO vegetable oils price index, a new record high."
  },
  {
    "headline": "Vault Hill is building a human-centric metaverse. What about it?",
    "summarized_story": "To differentiate itself from other virtual spaces and metaverse, Vault Hill City (Vault Hill’s Metaverse) has four different islands and each island has 7 human-themed districts: Play, Romance, Curiosity, Community, Idealism, Vitality, and Imagination.\nVault Hill is also partnering with Ready Player Me to build out avatars and incorporate digital wearables and limited-edition accessories.\nThat is, using one avatar across multiple metaverses instead of having to create one for Vault Hill, and another for Decentraland,” Vault Hill said.\nVault Hill Part is also partnering with Lingua54 to use machine learning to translate the speeches of avatars across different languages in real time.\nThe first glance of Vault Hill City will be up by Q2 2022 and by the end of the year, it will be fully running."
  },
  {
    "headline": "Two years and 3 million rides later, can SafeBoda keep its lead in Nigeria?",
    "summarized_story": "On Wednesday, Ibadan-based Ugandan bike hailing startup SafeBoda clocked two years of operating in the Nigerian market.\nAnd by the end of the year, while it was pausing its Kenyan operation, it celebrated half a million rides in Nigeria.\nFast forward to today, SafeBoda claims to have recorded over 3 million rides, more than 10,000 riders, over 100,000 users, and completed 50,000 deliveries.\nThe startup currently offers 3 services in Nigeria: rides, deliveries, and airtime purchase.\nSafeBoda riders are highly regarded and respected, not just because of the colour but because of their conduct,” said Clement Obaro, Growth Manager at SafeBoda."
  },
  {
    "headline": "Facebook content moderators in Kenya to receive 30-50% pay raise, following complaints",
    "summarized_story": "Facebook content moderators in Kenya will receive a 30-50% pay rise.\nAlthough the pay raise is welcomed by many of the content moderators, some still say it’s not enough.\nWhile the lowest starting salary of a Facebook content moderator at Sama is $2.20 per hour, outsourced content moderators for Facebook in the U.S. are paid a typical starting salary of $18 per hour.\nMeta, Facebook’s parent company also declined to comment on the announcement of the pay raise.\nThe announcement of the pay raise is seen as a win for the content moderators and validation of the power in employees speaking up."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, What comes to mind when you hear the term \"financial inclusion\"?\nI asked because it has become a..."
  },
  {
    "headline": "S2PAfrica holds its 2022 Regional Engineering Design Competition(EDC) Awards Ceremony",
    "summarized_story": "Share this article:S2PAfrica, a non-profit organisation aiming to groom professional engineers in Sub-saharan Africa, held its annual regional engineering design competition(EDC) awards ceremony on February 26, 2022.\nDr Nadu Denloye, current Chair, ICT committee, the Nigerian Academy of Engineering (NAE), served as the chair for the Engineering design competition.\nTeam EASS won the Energy efficiency category prize of $500, while Team Capture won the Harnessing Ignored Energy category prize of $500.\nThe S2PAfrica regional engineering design awards were announced, starting with the second runner-up award, which Team Improved Charcoal Stove won.\nTeam Koye was announced the winner of the 2022 S2PAfrica regional engineering design competition."
  },
  {
    "headline": "How to improve customer experience",
    "summarized_story": "Today, I’ll be discussing:How to improve customer experienceMTN in the metaverseSudo Africa’s $3.7 million pre-seedChari’s new acquisitionImproving customer experienceWhat is the most memorable customer service experience you’ve had?\nCustomer experience – the feeling or memory that a customer or prospective customer has whenever they come in contact with a business – is dependent on a company’s customer service.\nSo, how can customer experience be enhanced?\nMyServiceAgent is a technology company offering a variety of tools to businesses to improve the customer experience.\nChimgozirim walks us through what they do and how the company uses AI to help companies to improve their customer experience."
  },
  {
    "headline": "Inside NIPOST’s latest financial inclusion play: Agency banking and fingerprint authentication",
    "summarized_story": "In January 2022, NIPOST unveiled its new agency banking platform at a ceremony in Nigeria’s capital, Abuja.\nAdvertisementAccording to Isa Pantami, Minister of Communications and Digital Economy, the agency banking platform would follow the Universal Postal Union’s (UPU) standards on financial inclusion.\nBy UPU standards, NIPOST’s agency banking platform should provide essential services like savings, payments, money transfers, insurance, and credit.\nVisiting other nationsGlobally, postal services are no strangers to providing financial services.\nBy 2020, the postal agency was to have been unbundled into six subsidiaries: NIPOST Banking and Insurance Company; NIPOST Property and Development Company; NIPOST Transport and Logistics Services Company; NIPOST E-government Services Company; and NIPOST E-commerce Services Company."
  },
  {
    "headline": "How Nigeria’s five big banks navigated regulatory fees in 2021",
    "summarized_story": "Ayo Ebo, Economist/Head, Research & Strategy, Greenwich Merchant Bank believes bank’s regulatory fees have outlived its usefulness and should be reviewed.\nThe largest Banks’ in the first nine months of 2021 incurred N645.99 billion as operating expenses, 14.28 percent higher than N753.62 billion incurred in the full year 2020.\nThe banks recorded a net profit margin of 161.11 percent in the first nine months of 2021 despite the increased regulatory fee incurred in that period.\nIn the period under review, First Bank of Nigeria, one of Nigeria’s biggest banks, incurred the highest regulatory cost of N45.89 billion, 2.89 percent higher than N44.56 billion incurred in 2020.\nOut of the N123.22 billion incurred as operating expenses, 22.58 billion was spent on regulatory costs."
  },
  {
    "headline": "Nigeria’s daily petrol subsidy hits N10.1bn, as oil surges",
    "summarized_story": "Nigeria’s quest to keep its citizens addicted to cheap petrol is causing more pain than gain as the country’s daily subsidy hits N10.1 billion, findings by BusinessDay shows.\n“With rising oil prices, Nigeria’s current petrol subsidy is very enormous and is hitting Nigeria’s crude income very deeply,” the National Operations Controller of the Independent Petroleum Marketers Association Nigeria (IPMAN), Mike Osatuyi told BusinessDay.\n“The current market reality shows Nigeria pays about N17 billion daily on petrol subsidy,” Osatuyi lamented.\nAn analysis of data collated by BusinessDay showed that without subsidy, petrol would be selling for about N333.099 per litre as of February 25.\n“Before the end of 2022, Nigeria’s petrol subsidy will hit N6 trillion,” Kelvin Atafiri who runs Cavazzani Human Capital Limited, an investment firm exposed to the oil and gas sector, said."
  },
  {
    "headline": "Women leaders positively affect the balance sheet – Bukola Ewediaro",
    "summarized_story": "She started her career at Marina International Bank (Now Access Bank Plc) as the lead Customer Service Team.\nIt was also drafted into a strategic committee that defined the Brand’s quality vision.\nOvercoming imposter syndrome whenever I take on a new phase in my career journey or even embark on personal business.\nFacts have revealed that having women in leadership positions positively affects the balance sheet.\nAlso, the pandemic showed that countries led by women had fewer fatalities because the women in leadership reacted faster to the pandemic than their male counterparts."
  },
  {
    "headline": "Obaseki to partner FG to revitalize Okomu National Park, sends forestry bill to Edo Assembly – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said his administration will partner the federal government on the management of the Okomu National Park, to revitalize the park and strengthen security in the area.\nObaseki disclosed this on Thursday while addressing the Conservator of the Okomu National Park, Mr. Augustine Obekpa, when he visited the park in Udo Community, Ovia South-West Local Government Area of the state.\nHe noted, “We are going to be sending a forestry bill to the Edo State House of Assembly for consideration next week.\n“We want to collaborate with the National Park Service.\nIn his remarks, the Conservator of the Okomu National Park said the park is home to white-throated monkeys, Buffalo and Elephants, noting that farming, hunting and illegal logging was affecting the natural habitats of the animals."
  },
  {
    "headline": "Edo begins ‘operation show your building plan’ in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has concluded plans to commence a recertification campaign for buildings in the Ugbor, Ogheghe, Amagba communities and environs in the Benin metropolis to guard against building collapse and other hazards.\nCommissioner for Physical Planning, Urban and Regional Development, Isoken Omo, in a statement, urged members of the public to cooperate with officials of the ministry during the clearance and recertification exercise.\n“Staff of the Ministry will be going from property to property demanding evidence of Building Approval.\nThe general public is advised to allow the officers of the Ministry to do their work and cooperate with them to avoid a breach of the peace,” she added.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Obaseki urges increased global action to combat illegal wildlife trade, trafficking – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has called for stronger collaboration among global stakeholders as well as a more stringent legal framework to combat illegal wildlife trade and trafficking so as to conserve the ecosystem and preserve wildlife.\n“Better policies, including a more stringent legal framework to end the global menace of illegal wildlife trade and trafficking, among others must be developed to preserve the world’s diverse flora and fauna.\n“We are in partnership with stakeholders, including the Nigerian Air Force and other security agencies to preserve our forest reserve, particularly the Okomu Forest Area against criminals.\nWe will continue to explore even better channels to protect our endangered wildlife assets,” he added.\nAccording to the UN, “World Wildlife Day is an opportunity to celebrate the many beautiful and varied forms of wild fauna and flora and to raise awareness of the multitude of benefits that their conservation provides to people."
  },
  {
    "headline": "Obaseki flays unconscionable denial of women representation in Nigeria’s democracy – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has slammed the National Assembly for rejecting 5 bills seeking affirmative action and inclusion for women in politics and other spheres of the society.\nThe governor, in a statement, said: “The recent developments at the National Assembly, in which 5 bills seeking affirmative action and inclusion for women were vehemently shut down by members, is most regrettable and unsettling.\n“This is because the legislature is the bastion of democracy and a critical platform for fair representation and inclusion in government.\nThey provide invaluable service to ensure the proper functioning of the engine of government.\nAt the senior cadre of the civil and public service, women make up more than 50 percent of the Permanent Secretaries, which provides them with ample opportunity to serve the people."
  },
  {
    "headline": "Reps Member, Ayeni empowers youths to cushion effect of Covid 19 in Osun",
    "summarized_story": "Among those empowered are traders and artisans, drawn from Atakunmosa East Local Government Area, to benefit from the 12th Edition of LB Ayeni Foundation Empowerment Scheme.\nCityMirrorNews reported that tools and equipment given to the beneficiaries include: grinding machines, sewing machines, barbing kits, hairdressing equipment, motorcycles among others.\n“The train of LB Ayeni Foundation would have a stop over at Iwara in three weeks’ time for people of the area to benefits from the empowerment scheme.\n“I want to make sure people from the nooks and crannies of my constituency all benefits from the empowerment scheme.\nThe beneficiaries said that the founder of Ayeni Foundation has helped to reduce the level of poverty in the constituency."
  },
  {
    "headline": "Guaranty Trust HoldCo reports N175bn profit in 2021, down 13.2%",
    "summarized_story": "Guaranty Trust Holding Co (GTCO) Plc has declared a profit of N175 billion for the 2021 financial ended December 31.\nThis represents a 13.21% decrease year on year.\nGTCO also reported earnings per share of N6.14, a 13.64% decline from the N7.11 reported a year earlier.\nThe group equally reported a steady decline in the performance of topline income since 2017, depreciating by 30% in 4 years.\nA statement the bank announcing the results also said that interest income fell by 12.77% within the year under review, from N288.28 billion to N251.47 billion in the current period."
  },
  {
    "headline": "Dobi AgriCo expands operations with launch of 12 additional Greenhouses",
    "summarized_story": "Dobi AgriCo recently launched 12 newly constructed greenhouses to further expand its business operations and meet the growing demands of customers.\nSpeaking at the launch event of the new greenhouses, Ayodeji Ibosiola, General Manager, Dobi AgriCo, stated that the expansion is an offshoot of the overall strategy.\n“We are excited about this expansion programme because it enables us to meet the market demands while also satisfying out large customer base.\nWith the growing expectations for the future in terms of export, this strategic expansion places us in the right path towards achieving this feat; without a doubt.\n“At Dobi AgriCo, we model our process with cutting-edge technology to cultivate high-quality crop produce."
  },
  {
    "headline": "NNPC records 353% rise in trade surplus to ₦37.50bn in Sept 2021",
    "summarized_story": "The Nigerian National Petroleum Company Limited (NNPC Ltd), has recorded a trading surplus of ₦37.50billion for the month of September 2021, representing a 352% increase from the ₦8.29billion surplus in August 2021.\nTrading surplus or trading deficit is derived after deduction of the expenditure profile from the revenue in the period under review.\nThus in September 2021, NNPC Group’s operating revenue as compared to August 2021, reduced by 29.87% or N191.90billion to stand at N450.45billion.\nThe report also shows a total Crude Oil and Gas export receipt of $348.63million in September 2021 as against $224.29million in August 2021.\nPeriod-to-date Production from Joint Ventures (JVs), Production Sharing Contracts (PSCs) and NPDC contributed about 57.51%, 21.20% and 21.29% respectively to the total national gas production."
  },
  {
    "headline": "Remember Your Helpers When You Had Nothing, Prophet Fufeyin Tells Nigerians",
    "summarized_story": "Billionaire Prophet Jeremiah Fufeyin has gifted a lady, Ebi Patrick, and Omimi Brume a total sum of N7million for the roles they played in his life when he was struggling.\nAccording to the prophet, Ebi Patrick was mainly aiding him and a few other friends with food even when he had no way to pay back.\nThe Lord spoke to me to bless you and I present to you this N5million to start your own business,” Fufeyin said.\nLeft in tears, Ebi said that she never expected that her story would be turned around by the prophet.\nBecause of the N25,000, I started looking for ways to buy from other wholesalers."
  },
  {
    "headline": "JUST-IN: Bandits Kill 5, Set Fuel Tanker Ablaze In Kaduna",
    "summarized_story": "In a renewed attack on innocent citizens, bandits have killed five persons, injured many and set a fuel tanker carrying 33,000 litres of fuel ablaze in Birnin Gwari local government area of Kaduna State.\nThis was disclosed in a statement issued by a local non-government organisation, Birnin Gwari Vanguards for Security and Good Governance, signed by its chairman, Ibrahim Abubakar Nagwari and made available to journalists in Kaduna on Friday.\n“Similarly, the bandits burnt to ashes a Tanker conveying thirty-three thousand litres of fuel to Birnin-Gwari at the same Manini village,” he added.\nHe lamented that the attacks and killings on daily basis in the Birnin Gwari axis has further deteriorated the already traumatised vehicular movement along the Birnin-Gwari Kaduna highway.\nThe Kaduna Command Police Public Relations Officer (PPRO) ASP Muhammad Jalige, did not pick his calls to speak on the matter."
  },
  {
    "headline": "Encroachment: Senate Directs Army To Vacate Land For Shipping Coy",
    "summarized_story": "The Senate has asked the Nigerian Army to vacate a large expanse of land currently being occupied by its Signals Barracks in the Apapa area of Lagos for the rightful owner, Kazuma Shipping Company Limited.\nHe alleged that the Nigerian Army encroached on the land despite the fact that it was outside their barracks.\nADVERTISEMENTBanire said, “After the judgment, officers of the Nigerian Army began to trespass on the land by depriving the original owners, access to the large expanse of land on the pretext that the said land belong to the Nigerian Army.\nNA/412/A, dated April 3, 2002, directed the Commandant of the Nigerian Army Signal, Arakan Barracks, Apapa, Major General S.E.\nThe chairman of the panel, Senator Akinyelure, therefore, ruled that the Nigerian Army should vacate the land immediately."
  },
  {
    "headline": "Electricity: AEDC Apologises, Says Blackout Due To Low Power Generation",
    "summarized_story": "As the power blackout across the country persists, Abuja Electricity Distribution Company (AEDC), has apologised to its customers for the poor power supply to its franchise states, explaining that it is due to low power generation and supply to the national grid.\n“The Abuja Electricity Distribution Company Plc.\nADVERTISEMENTRecall that on Thursday,the Minister of Power, Abubakar Aliyu, had blamed the epileptic power supply in Abuja and other parts of the country on low water levels in hydro dams in the country.\nHe, however, assured that the government was doing everything to ensure uick restoration of power supply to consumers.\nADVERTISEMENTEtim noted that as a company fully committed to enriching our customers’ experience, the company was deeply sorry for the low power supply."
  },
  {
    "headline": "Buhari Cancels Planned Medical Trip To UK, Returns To Abuja From Kenya",
    "summarized_story": "President Muhammadu Buhari, on Friday, returned to Abuja after attending the United Nations Environmental Programme (UNEP) at 50 event in Nairobi, Kenya.\nThe News Agency of Nigeria (NAN) reports that the president, who initially planned to proceed to London for medical check-up, returned to Abuja on Friday at about 1pm.\nWhile in Kenya, the president participated in the Special Session to commemorate the 50th anniversary of the United Nation’s body, UNEP.\nDuring the meeting, Buhari directed collaboration among the Ministries of Environment, Water Resources, Agriculture and Rural Development and Power to combat desertification.\nADVERTISEMENT"
  },
  {
    "headline": "Davido sells out O2 Arena tickets: How to stream the concert",
    "summarized_story": "Not even a single ticket is available for Davido’s concert at the O2 Arena on March 5 – The show is now sold out.\nThe O2 Arena is a multi-purpose indoor arena in the center of The O2 entertainment complex on the Greenwich Peninsula in southeast London.\nThe event center, which has a 20,000-sitting capacity, is the second-highest seating capacity of any indoor venue in the United Kingdom, behind the Manchester Arena.\nThis is not the first time Davido will be having a sold-out concert at the arena.\nDavido sold out the event center in January 2019."
  },
  {
    "headline": "Paypal shuts down services in Russia",
    "summarized_story": "Payments company, PayPal Holdings Inc shut down its services early on Saturday in Russia, citing “the current circumstances”.\nPayPal is joining other financial and tech companies in suspending operations there after the invasion of Ukraine.\n“Under the current circumstances, we are suspending PayPal services in Russia,” President and Chief Executive Dan Schulman said in a statement.\nUkrainian government officials had been calling on PayPal to quit Russia and help them with fundraising.\nRivals Wise and Remitly earlier suspended some services in Russia."
  },
  {
    "headline": "How I Helped Aregbesola, Fayemi, Mimiko Become Governor – Tinubu",
    "summarized_story": "Asiwaju Bola Tinubu, one of the presidential aspirants and the head of the All Progressives Congress, paid a visit to the traditional rulers in the three senatorial districts of Ondo State on Friday, seeking their support for his presidential bid.\nTinubu highlighted former governors of Osun and Ondo states, Ogbeni Rauf Aregbesola and Dr. Olusegun Mimiko, as beneficiaries of his political generosity.\nHe also mentioned the Governor of Ekiti State, Dr. Kayode Fayemi, and President Muhammadu Buhari.\nTinubu said, “I helped Mimiko get his mandate through court after two years that he was elected.\nI helped Fayemi get his mandate after three years."
  },
  {
    "headline": "How We Escaped Intense Bombings, Death In Ukraine-Russia War – Nigerians",
    "summarized_story": "Nigerians who escaped Russia’s ongoing military offensive in Ukraine arrived in Abuja, the nation’s capital, on Friday, narrating how they escaped the intense bombings and missiles fired by Russia’s military forces.\nSome of the returnees who fled Ukraine to Romania told Saturday PUNCH how they were able to escape the invasion.\n“On Thursday morning, there was a bombing in Kyiv but thankfully I was in Ternopil so I escaped.\nShe added that she would love to return to Ukraine to complete her studies once the war ends.\nAnother returnee, Peter Ajuwon, said the Ukraine war should serve as a lesson to Nigerians on the importance of peace."
  },
  {
    "headline": "BREAKING: Second Batch Of Nigerians From Ukraine Arrive Abuja",
    "summarized_story": "BREAKING: Second Batch Of Nigerians From Ukraine Arrive AbujaAbdur-Rahman Balogun, the Head of the Nigerians in Diaspora Commission’s (NiDCOM) Media and Public Relations Unit, has announced the arrival of the second batch of Nigerians from Ukraine in Abuja, the Federal Capital Territory (FCT).\nThe second group arrives in Abuja on Friday evening.\nMore details later…"
  },
  {
    "headline": "Terrorism charge: Hang out, enjoy bottles of drinks, Kanu tells legal team",
    "summarized_story": "Kanu, currently being detained in the custody of the Department of State Services has therefore requested his legal team to always make out time to hang out and enjoy some bottles of drinks.\nHe said, “The court-ordered routine visit to our indefatigable client – Onyendu Mazi Nnamdi Kanu was observed on (Thursday) March 3, 2022.\nAfter days, which turned into weeks of grandstanding, we were able to meet with our client- Onyendu Mazi Nnamdi Kanu.\n“Onyendu particularly encouraged me to be strong and even stronger in the coming days.\nOn a lighter note, Onyendu requested his visiting team to make out time to hang out and enjoy some bottles of drinks."
  },
  {
    "headline": "Pictures: Third batch of Nigerians trapped in Ukraine arrive Abuja",
    "summarized_story": "As Russian troops continue to invade the cities of Ukraine, the third batch of Ukraine-based Nigerians from Hungary have touched down at the Nnamdi Azikiwe International airport, Abuja, Nigeria’s capital.\nNo fewer than 165 Nigerians arrived Friday night at about 11:50 pm local time from Budapest, Hungary."
  },
  {
    "headline": "Breaking: Russia declares partial ceasefire as evacuation begins, Ukraine fires warning shot",
    "summarized_story": "Russia declared a partial ceasefire on Saturday to allow humanitarian corridors out of the Ukrainian cities of Mariupol and Volnovakha, Russia’s defence ministry said.\n“From 1000 am Moscow time (0700 GMT), the Russian side declares a ceasefire and the opening of humanitarian corridors to allow civilians to leave Mariupol and Volnovakha,” Russian news agencies quoted the Russian defence ministry as saying.\nUkraine said it planned to evacuate 200,000 people from Mariupol and 15,000 from Volnovakha, with the Red Cross acting as the guarantor of the ceasefire.\nMeanwhile, Ukraine’s Deputy Prime Minister Iryna Vereshchuk has warned that Russia must not take advantage of an agreed humanitarian corridor to advance its troops.\nShe said her government was “verifying” information that Russian troops were using the ceasefire to move closer to Ukrainian positions in areas along the evacuation routes."
  },
  {
    "headline": "How Electoral Act‘ll be game-changer in 2023",
    "summarized_story": "Major highlights of the ActMany sections and clauses of the new Electoral Act inspire hope and excite political parties, politicians and ordinary Nigerians.\nAlso, the Electoral Act has addressed the issue of over-voting as contained in Section 51.\nIn the amended Electoral Act, more sections back the use of technology for accreditation, computing of results and other processes.\nOkechukwu said Buhari has bequeathed to Nigerians an Electoral Act that empowers the deployment of the Smart Card Reader, Biometric Voter Accreditation System (BVAS) and other technological devices for electoral fidelity.\nSpeaking in an interview with this reporter, Ononuju said: “The amended Electoral Act doesn’t have anything to do with anybody’s aspiration for 2023 presidency."
  },
  {
    "headline": "Ukraine-Russia War: Third Batch Of Nigerian Evacuees Arrive From Hungary",
    "summarized_story": "The third batch of Nigerian evacuees following the Ukraine-Russia war arrived in Abuja late last night.\nThey were evacuated from Hungary and landed at the Nnamdi Azikiwe International Airport, Abuja at 11:25 pm on Friday.\nAccording to the official figure from the Ministry of Foreign Affairs, the number of evacuees from Hungary was 174 in number and they were brought aboard Air Peace.\nEarlier yesterday, the second batch of Nigerian evacuees from Ukraine arrived via an Air Peace flight carrying the 183 evacuees.\nAlso on Friday, the first batch of Nigerian evacuees, numbering 416 arrived in the country from Romania, aboard Max Air."
  },
  {
    "headline": "Diezani’s Associate, Kola Aluko Loses Bid To Reclaim $18m Abuja House, Other Forfeited Assets",
    "summarized_story": "An associate of a former Minister of Petroleum Resources, Diezani Alison-Madueke, Kolawole Aluko, has lost his bid to reclaim some of his assets forfeited to the Federal Government.\nOne of the assets is a mansion in Abuja, which the Economic and Financial Crimes Commission (EFCC) says is valued at about $18 million.\nJustice Williams-Dawodu, in affirming the Federal High Court judgement, held that the Court of Appeal found no reason to disturb the finding of the trial court.\nIn his appeal, Aluko challenged the January 14, 2020, judgement by Justice Abang.\nIn the said judgement, Justice Abang granted the EFCC’s application for final forfeiture of the assets traced to Aluko."
  },
  {
    "headline": "Obasanjo At 85: Former President Participates In Novelty Match",
    "summarized_story": "﻿Former President Olusegun Obasanjo has participated in a novelty match played at the 5 Aside football pitch of the Olusegun Obasanjo Presidential Library in Abeokuta, the Ogun State capital.\nThe event which is part of activities marking his 85th birthday celebration, drew the presence of the 91-year-old President of Benin Republic Nicephore Soglo, a former Minister of Justice and Attorney General of the Federation, Chief Bayo Ojo, among others sports enthusiasts.\nRead Also: Second Batch Of Nigerians From Ukraine Arrives In AbujaFormer President Obasanjo, who was the captain of his team displayed his dexterity in the art of football as his team defeated the Ogun State Government led by the Deputy Governor, Noimot Salako Oyedele, by four goals to two, with the former president doing the goals.\nHe attributed his agility to the grace of God as he recommended physical exercise, medical examination, good dieting, and social interaction for the elderly to keep them healthy."
  },
  {
    "headline": "Global Terrorism Index: Nigeria’s Ranking Improves As Boko Haram Killings Dip By 72% – Report",
    "summarized_story": "Nigeria has moved to sixth in the latest Global Terrorism Index (GTI), following successes in the fight against Boko Haram insurgents.\nIt attributed this to the death of Boko Haram leader, Abubakar Shekau, and the Federal Government’s efforts at defeating the group.\n36 percent of attacks were claimed by ISWA, Boko Haram being responsible for eight per cent and 44 percent not attributed to any group.\nThe decline of Boko Haram continued into 2021, with Boko Haram responsible for only 69 deaths, a decrease of 77 percent from the previous year.\nIt has been reported that as many as former Boko Haram commanders have joined ISWA after Shekau’s death."
  },
  {
    "headline": "Lagos To Probe Incident Of Petrol Souvenir At Party",
    "summarized_story": "The Lagos State Government has announced that it is investigating a viral video showing kegs of petrol handed out as souvenirs at an event centre in Lagos.\nLagos State Commissioner of Information and Strategy, Gbenga Omotoso, made this known in a statement on Saturday.\n“There is no doubt that this action is dangerous and can lead to loss of lives and property.\nWe, therefore, advise that actions that can lead to loss of lives and properties be avoided,” the commissioner added.\nLong queues have persisted at filling stations in major parts of the country including the commercial capital, Lagos State."
  },
  {
    "headline": "War in Ukraine: Zelensky Slams Nato Over Rejection of No-Fly Zone",
    "summarized_story": "Ukraine’s president has attacked Nato leaders in a fiery speech over their refusal to implement a no-fly zone around the country.\nNato has argued that a no-fly zone will result in confrontation with Moscow.\nBut Mr Zelensky said he disagrees that direct action could “provoke Russia’s direct aggression against Nato”.\nOn Friday, Nato’s secretary-general, Jens Stoltenberg, warned that the introduction of a no-fly zone could lead to a “full-fledged war in Europe involving many more countries and causing much more human suffering”.\nUS Secretary of State Antony Blinken also ruled out the introduction of a no-fly zone, but told the BBC he is convinced Ukraine can win its war with Russia."
  },
  {
    "headline": "Russia Announces Ceasefire in Two Besieged Ukrainian Cities",
    "summarized_story": "The Russian military will observe a ceasefire in two areas of Ukraine starting Saturday to allow civilians to evacuate, Russian state media reported, but there was no immediate confirmation from Ukraine.\nIn a bitter and emotional speech late Friday, Zelenskyy criticized NATO over the lack of a no-fly zone, saying it will fully untie Russia’s hands as it escalates its air attack.\nIn a separate video message to antiwar protesters in several European cities, Zelenskyy continued to appeal for help.\nThe U.N. Security Council will hold an open meeting Monday on the worsening humanitarian situation.\nThe U.N. estimates that 12 million people in Ukraine and four million fleeing to neighboring countries in the coming months will need humanitarian aid."
  },
  {
    "headline": "Loads of Goodwill Messages Pour in for Obasanjo at 85",
    "summarized_story": "Saraki said: “Baba, you have continued to bring honour to our country, Nigeria, and her over 200 million citizens.\nFormer Senate President, Senator Anyim Pius Anyim described Obasanjo as a foremost statesman and citizen of the world.\nYou have demonstrated unwavering commitment to the unity, peace and progress of our dear country, Africa and the world at large.\n“Baba, I want to assure you that Nigerians appreciate you and your noble contributions to the peace, unity, progress and development of our dear country.\nMay He continue to uphold you as you continue your worthy service to our dear country, Africa and the world at large.”"
  },
  {
    "headline": "US Senator Urges Russians to Assassinate Putin",
    "summarized_story": "US Senator, Lindsey Graham has called for “somebody in Russia” to assassinate Putin.\nThe Republican Senator called for Julius Caesar-style assassination of the Kremlin strongman, currently leading an invasion of Ukraine, during an appearance on Fox News’ Hannity show and in a series of tweets on Thursday.\nIs there a more successful Colonel Stauffenberg in the Russian military?” he tweeted, referencing the army officer who attempted to kill Adolf Hitler.\n“The only way this ends is for somebody in Russia to take this guy out.\nGraham’s call for Putin to be assassinated comes as the Russian leader continues to indiscriminately bomb cities in Ukraine."
  },
  {
    "headline": "804 Nigerians Fleeing Ukraine Evacuated, Land in Abuja",
    "summarized_story": "Nigeria’s federal government on Friday evacuated 804 Nigerians fleeing the devastation caused by Russia’s invasion of Ukraine.\nPresident Muhammadu Buhari, who condemned the ugly development, said there were about 4,000 Nigerians in Ukraine, mostly students.\nThe scholars also noted that the invasion “will stain” the international reputation of the Russian state for decades to come.\n“The Russian invasion will stain the international reputation of the Russian state for decades to come.\nThe fire was extinguished by the Ukrainian State Emergency Service units,” the State Nuclear Regulatory Inspectorate of Ukraine said in a statement."
  }
]