[
  {
    "headline": "Russia bombs second military factory in Ukraine’s capital",
    "summarized_story": "Russia stepped up air strikes on Kyiv on Saturday, hitting another military factory a day after Moscow warned it would renew attacks following two weeks of relative calm in the Ukrainian capital.\nKyiv mayor Vitali Klitschko said authorities were still determining whether anyone had been killed or injured in the attack.\nThe ministry accused London of “unprecedented hostile actions”, in particular referring to sanctions on Russia’s senior officials.\nUS media reported that Russia had sent a formal complaint to Washington about its support of Kyiv this week.\n“For them, life of the people is nothing.”For now, Russia’s military focus seems set on seizing the eastern Donbas region, where Russian-backed separatists control the Donetsk and Lugansk areas."
  },
  {
    "headline": "Russia bans entry to Boris Johnson, other top UK officials",
    "summarized_story": "Moscow on Saturday announced it was banning entry to Prime Minister Boris Johnson and several other top UK officials, after London imposed sanctions on Russia over its military operation in Ukraine.\n“This step was taken as a response to London’s unbridled information and political campaign aimed at isolating Russia internationally, creating conditions for restricting our country and strangling the domestic economy,” the foreign ministry said in a statement.\nThe ministry accused London of “unprecedented hostile actions”, in particular referring to sanctions on Russia’s senior officials.\nRussia’s entry blacklist includes UK Deputy Prime Minister Dominic Raab, Foreign Secretary Liz Truss, Defence Secretary Ben Wallace, former Prime Minister Theresa May and the First Minister of Scotland Nicola Sturgeon.\nBritain has been part of an international effort to punish Russia with asset freezes, travel bans and economic sanctions, since President Vladimir Putin moved troops into Ukraine on February 24."
  },
  {
    "headline": "Uncertainties as 18 aspirants jostle for Enugu governorship in PDP",
    "summarized_story": "By Dennis AgboAt the close of sales and submission of expression of interest and nomination forms of the Peoples Democratic Party, PDP, for the 2023 general election, on Friday, no less than 18 aspirants had purchased the governorship forms for Enugu state.\nThose who are said to have purchased the PDP nomination forms include Dr Josef-Ken Onoh, Mr Godwin Ogenyi, Hon.\nEverest Nnaji, Mr. Peter Mba, Dr. G.O.C Aja, Dr. Kingsley Udeh, Rev.\nWith the many feats he achieved in the Enugu Capital Territory, residents believe that it’s a test case of what he can achieve if given governorship.\nThey contend that Enugu has down and needs the energy in the like of Onoh to bring back resilience to the state."
  },
  {
    "headline": "2023: Delta South leaders meet, restate support for Oborevwori",
    "summarized_story": "…say he’s the most popular, acceptable aspirant…pay Okowa Easter visitBy Festus Ahon, ASABADelta South Peoples Democratic Party, PDP Leaders and Stakeholders Forum in Delta South have reiterated their support for the governorship aspiration of Rt.\nHon Sheriff Oborevwori in the 2023 gubernatorial election.\nAnd you know, Delta South has remained the strongest hold of the PDP over the years.\nAnd to further strengthen PDP in Delta South, we will be holding a rally very soon.\nHon Sheriff Oborevwori as he is the most popular and acceptable aspirant among others”."
  },
  {
    "headline": "Killings: Defend yourselves; Buhari has lost capacity to secure lives —Middle Belt Forum tells Nigerians",
    "summarized_story": "No fewer than 34, according to the Kaduna State Government, were murdered and 35 homes razed down.\n“The Middle Belt Forum completely condemns this gradual return to the bloody days of horrifying assaults that are presently assuming a genocidal level.\nNo nation can survive this level of crippling insecurity that has rendered life short and brutish for many communities in the Middle Belt Region.\n“The refusal of the government to deal with perpetrators of these recurring killings reveals its complicity in the gale of bloodshed shredding the Middle Belt Region.\n“The Middle Belt Region has lost faith in the capacity of President Buhari to secure the lives and property of Nigerians."
  },
  {
    "headline": "Pray for new Nigeria, Okowa urges Christians at Easter",
    "summarized_story": "Governor Ifeanyi Okowa of Delta has called on Christians to pray for socio-economic and political rejuvenation of Nigeria to stem insecurity, political and economic challenges plaguing the country.\nOkowa made the call in a message to Christians in the country on the celebration of Easter, and said that the resurrection of Jesus Christ, symbolised in Easter, remained a turning point in the lives of Christians.\n“On behalf of my family, the government and people of Delta, I congratulate Christians all over the world as they celebrate 2022 Easter.\n“As Christians, we must reflect on the importance of Easter in our daily living, not only with other Christians, but with people of other religious beliefs.\n“May the lessons and blessings of Easter help us to overcome the challenges bedeviling our beloved country,’’ the governor stated."
  },
  {
    "headline": "300 cultural groups to perform at Anioma’s festival of unity",
    "summarized_story": "The organization for the Advancement of Anioma culture, OFAAC, is staging a comeback with its annual flagship cultural festival, two years after a lull occasioned by the Covid-19 pandemic.\nThis year’s event, the 17th edition of the festival, reputed as the biggest cultural milestone in Delta state, is scheduled for Asaba on Monday, April 18, 2022.\nEstablished in 2003, under the cultural umbrella of the Anioma people, OFAAC, the festival was envisioned to promote and preserve the culture of the Anioma people, in Delta North senatorial district.\nA statement by the National President of OFAAC, Architect Kester Ifeadi, said over 300 cultural groups from the nine local government areas of Delta North would showcase Anioma culture at the event expected to be witnessed by Governor Ifeanyi Okowa, Anioma personalities and cultural stakeholders across the country.\nThe Anioma Cultural Festival which had over the years attracted hundreds of performing groups and a multitude of spectators had become a central feature of the socio-cultural life of Anioma inhabitants and her diasporic communities."
  },
  {
    "headline": "2023: Five Commissioners resign in Kwara to contest elective offices",
    "summarized_story": "At least five cabinet members of the Kwara State government have resigned their appointments to contest for elective positions in the 2023 general elections, DAILY POST reports.\nThe State government had given all political appointees seeking elective offices in the next general elections an ultimatum to resign by April 15, 2022.\nOn his part, the Special Adviser on Special Duties, Yinka Aluko, announced his intention to contest the next elections through a letter to the state governor dated April 12, 2022.\nOther appointees who have resigned so far could not be reached by DAILY POST at the time of this report.\nAlthough close to ten of the cabinet members of the governor are reported to be eyeing elective positions in the next dispensation, others are being expected to publicly declare their political ambitions before the primaries in May."
  },
  {
    "headline": "War: Ukraine shoots down Russian cruise missiles",
    "summarized_story": "Ukraine said it has downed Russian cruise missiles that were fired on Saturday morning toward the Lviv Region.\nRegional military governor Maksym Kozytsky said Ukraine’s anti-aircraft systems downed the missiles“In the morning of April 16, missiles were fired at the Lviv region from Su-35 aircraft of the Russian occupiers,” Kozytsky said.\n“Units of anti-aircraft missile forces Air Command West of the Air Force of the Armed Forces of Ukraine destroyed four cruise missiles.”Furthermore, Kozytsky claimed that the Russian aircraft that fired the missiles had taken off from Baranovichi airfield in neighbouring Belarus.\nThe Ukrainian military previously said it has shot down several missiles fired towards its territory from Belarus."
  },
  {
    "headline": "Insecurity: Zamfara indigenes urged to pray for Nigeria during Ramadan",
    "summarized_story": "Sanusi Mai-Tuta, a Zamfara businessman has called on wealthy individuals in the state to consider the plights of the orphans, the Internally Displaced Persons (IDPs ) and the needy to alleviate their economic hardship.\nTuta said alleviating the plight of the needy would serve as a tool for divine favour, mercy, protection and general development of the state in all ramifications, urging the Muslim faithful to use the period of Ramadan to reform themselves, pray for the unity and peace of the country.\nHe made the appeal in a Ramadan message through a press statement which he personally signed and made available to DAILY POST on Friday in Gusau, the State capital.\n“Fasting during the holy month of Ramadan is one of the five pillars of Islam and a great opportunity for all Muslims to purify their mind, body, heart, and soul by fasting and praying to Almighty Allah.\nRepentance would also play a vital role in healing our State of wounds and woes caused by insecurity ”“As a patriot, I heartily wish to extend appreciation to our Ulamas, who are heavily committed to educating and enlightening us on the norms and values of Islam as revealed to us through our noble prophet Muhammad S.A.W who we all need to emulate and follow his teachings."
  },
  {
    "headline": "2023: Primate Ayodele speaks on next govs of Delta, Enugu, Akwa Ibom, Rivers",
    "summarized_story": "The Leader Of INRI Evangelical Spiritual Church, Primate Elijah Ayodele, on Saturday, issued warning ahead of the next governorship elections in Delta, Enugu, Akwa Ibom, and Rivers States.\nPrimate Ayodele noted that Governor Ifeanyi Okowa of Delta State will face challenges if he doesn’t pick James Augoye as his successor.\nHe advised James Ibori and Governor Okowa to work together to pick a reliable candidate.\n“If Okowa doesn’t do the right thing, there won’t be peace in the State, the best candidate is James Augoye.\nSpeaking on Rivers State, Primate Ayodele revealed that the best candidate for Governor Wike is around him and not outside his cabinet."
  },
  {
    "headline": "Osinbajo drafted APC manifesto that put Nigeria in trouble – Pastor Giwa",
    "summarized_story": "The Senior Pastor of Awaiting the Second Coming of Jesus Christ Ministry, Pastor Adewale Giwa has disclosed that the Vice President, Yemi Osinbajo was the brain behind the failed 2015 manifesto of the All Progressives Congress, APC.\n“Let me remind Nigeria that Mr. Osinbajo played a prominent role in drafting the manifesto of the All Progressives Congress that put Nigeria in serious trouble.\nNeither Osinbajo nor Tinubu or anybody can be a good president unless we change the way Nigeria was formed.\nWe have to go back to what led to the amalgamation of Nigeria; change the name of this country given by a foreigner and change our constitution.\nWe have to rebuild the foundation of Nigeria, change the constitution and come together to discuss the way out.”"
  },
  {
    "headline": "My fiancee’s beatings led to two miscarriages – Ada Ụbụrụ",
    "summarized_story": "Helen Ozioma, the lady who called off her wedding to David Okike, has denied aborting three pregnancies belonging to him.\n“He practically caused all the miscarriages I went through by his beating and not even having a common self control.\nShe added: “Why did she accompany me and not my supposed husband?\n“My good people in my own case my supposed husband kept delaying everything.\n“I wouldn’t expect them to be truthful about if their brother always beat me or not after all my supposed husband is their only son and brother."
  },
  {
    "headline": "Seven celebrities who remarried ex-spouses",
    "summarized_story": "Their marriage ended badly with Kim being the subject of many of his songs.\nElon MuskTesla and SpaceX CEO, Elon Musk started dating British actress Talulah Riley in 2008, with the couple going on to marry in 2010.\nUnfortunately, their second marriage also failed, and the couple’s second divorce was finalised in 2016.\nThe couple split in 1992 but remarried seven years later in 1999.\nAlthough she was married to Brian until 2007, Marie found love once again with Steve, and the couple remarried in 2011."
  },
  {
    "headline": "UNFINISHED BUSINESS: Pep, Klopp in unending fight for gongs, glory",
    "summarized_story": "Having both booked their spots in the Champions League semi-finals, Manchester City and Liverpool renew hostilities in the final four of the FA Cup on Saturday afternoon at Wembley Stadium.\nThe two sides played out a pulsating 2-2 draw in last weekend’s Premier League encounter at the Etihad and are bidding to meet either Chelsea or Crystal Palace in the showpiece event this weekend.\nMeanwhile, Klopp said he wanted to see improvements from his team, even though they came away from the Etihad with a point after a breathless match.\n“That would be interesting, so let’s give it a try.”The draw kept Liverpool in the hunt for an unprecedented quadruple of trophies after they won the League Cup earlier in the season.\n“That’s how it is pretty much and that’s how we approached it already since January since we started this little mission."
  },
  {
    "headline": "Electoral Act: Buhari’s ministers must resign before primaries -APC",
    "summarized_story": "Amaechi is the only member of the federal cabinet who has publicly declared his interest in the APC presidential primaries so far.\n“The position of the party is consistent with the Electoral Act.\nWe are allowing our affected members who may have the intention of contesting the primaries to comply with the Electoral Act as provided,” Morka said yesterday.\nHe added: “The party will simply follow the Electoral Act.\nAny member of the party who is in an appointive position, we will expect such individual to resign before our primaries."
  },
  {
    "headline": "Plateau massacre: It was horrible seeing my four children lowered into mass grave, says survivor",
    "summarized_story": "Plateau massacre: It was horrible seeing my four children lowered into mass grave, says survivorANYA Ali has almost cried his eyes out.\nWith four of his children hacked down by gunmen who invaded Kukawa village, Kanam Local Government area of Plateau State on Sunday morning, he remains inconsolable.\nIt is painful to see my loved ones being lowered into a mass grave,” he said, shaking his head and biting his lips.\nGovernor Simon Lalong of Plateau State said his heart was heavy.\nThe governor spoke during an interactive session with key stakeholders and community members of Kanam Local Government Area in Dengi."
  },
  {
    "headline": "Tanko Yakasai: How Buhari’s govt can stop insecurity",
    "summarized_story": "To solve the problem of insecurity in Nigeria, you have to tackle the problem of unemployment in the country and then, poverty.\nBut honestly speaking do you think President Buhari and his security apparatus in Nigeria can tackle the problem of insecurity in the country?\nAnd seven years is gone, the problem of insecurity in Nigeria has not been tackled or addressed.\nIt has gone worse from where we areHow do you say that a retired General cannot tackle insecurity?\nThere are many Bardes who are making their own money under the guise of fighting insecurity and insurgency in the country."
  },
  {
    "headline": "Insecurity: Defend your territories against invaders, MBF tells residents",
    "summarized_story": "“ It is instructive that as the 2023 campaigns gather momentum, the intensity of these attacks is set to increase, with the sole purpose of annihilating communities of the Middle Belt by the invaders.\n“The Middle Belt Forum completely condemns this gradual return to the bloody days of horrifying assaults that are presently assuming a genocidal level.\nNo nation can survive this level of crippling insecurity that has rendered life short and brutish for many communities in the Middle Belt Region.\n“We call on the international community to beam its searchlight on the horrendous massacres of the Middle Belt peoples being carried out under the watch of President Buhari.\n“The Middle Belt Region has lost faith in the capacity of President Buhari to secure the lives and property of Nigerians."
  },
  {
    "headline": "Anambra: Gunmen invade Soludo’s hometown, injure policemen",
    "summarized_story": "From Obinna Odogwu, AwkaThree policemen sustained gunshot injuries when gunmen attacked their security post in Isuofia community, Aguata Local Government Area of Anambra State.\nIsuofia is the hometown of the state governor, Prof. Chukwuma Soludo.\nHe said that the gunmen did not attack the community but that they were passing along the road connecting Isuofia and Ekwulobia.\nWe created observation points where we monitor the activities of criminals.\nSo, what happened was that one of our observation points along Ekwulobia Road came under attack by hoodlums."
  },
  {
    "headline": "Kalu, an asset to Nigeria –Senate President",
    "summarized_story": "From Okey Sampson, Umuahia and Kenneth UdehSenate President, Dr Ahmad Lawan has described the Chief Whip of the Senate, Dr Orji Uzor Kalu as an asset not only to Abia North Senatorial District and the South-East, but to the entire Nigeria.\nThe Senate President praised the people of Abia North for voting in a worthy representative in Kalu who he said has been able to utilise his three years in the Senate to achieve what others before him could not do in the past 20 years.\nThe Senate President stressed that he is willing to work with Kalu more for the betterment of Abia North and the entire country.\nHe said that the commissioning of the projects which attracted the presence of the Senate President was in fulfilment of those promises made three years ago.\nKalu said that the completion of the projects was made possible through the rural transformation programmes of President Muhammadu Buhari and the Senate President."
  },
  {
    "headline": "Easter: Kalu, Wike, Sanwo-Olu, Tinubu, others urge Christians to emulate Christ",
    "summarized_story": "Chief Whip of the Senate, Dr. Orji Uzor Kalu, urged Nigerians to use the Easter season for sober reflection as individuals and as a nation.\nAccording to him, Christians must emulate the exemplary life of Jesus Christ in order to build a decent society.\nDescribing Easter as a special celebration in commemoration of the resurrection of Jesus Christ, Kalu called on Christians to pray for the nation and leaders at all levels.\nRivers State governor, Nyesom Ezenwo Wike, also felicitated Christians on the celebration of Easter, urging them to emulate Jesus Christ by making sacrifices that will advance the course of development.\nLagos State governor, Mr. Babajide Sanwo-Olu congratulated Lagosians, especially Christians in the state on the commemoration of the death and resurrection of Jesus Christ."
  },
  {
    "headline": "APC Holds Presidential Primary May 30/31, Gov May 23, Sale of Forms Opens April 22",
    "summarized_story": "Ahead of the NEC meeting, the NWC will also meet in Abuja next Tuesday.\nThe source also revealed that for the states’ houses of assembly, the Expression of Interest form will cost N500, 000, while the Nomination form will cost N1, 500,000.\nAspirants for House of Representatives will pay N1 million for Expression of Interest and N4 million for the Nomination form, while those vying for Senate will pay N2 million for Expression of Interest and N8 million Nomination form.\nThe party also proposed N5 million for Expression of Interest and N25 million as Nomination form for the governorship seat.\nFor the Presidential position, the Expression of Interest form is fixed at N5 million while nomination form is fixed for N40 million."
  },
  {
    "headline": "World Bank in Latest ‘Africa’s Pulse’ Projects 2.7% Growth for Nigeria in 2022",
    "summarized_story": "Ndubuisi Francis in AbujaThe World Bank in its latest Africa’s Pulse, a biannual analysis of the near-term regional macroeconomic outlook, has projected a 2.7% growth for Nigeria in 2022.\nOf the region’s three largest economies – Angola, Nigeria, and South Africa – only Nigeria is projected to enjoy a fairly good growth in 2022.\nThe report said growth in South Africa is expected to decline by 2.8 percentage points in 2022, dragged by persistent structural constraints.\nResource-rich countries, especially their extractive sectors, will see improved economic performance due to the war in Ukraine, while non-resource rich countries will experience a deceleration in economic activity,” said the World Bank.\nIt said: Excluding Angola, Nigeria and South Africa, regional growth is projected at 4.1 per cent in 2022, and 4.9 per cent in 2023."
  },
  {
    "headline": "20 Days After, 68 Abducted Train Passengers Languish in Dungeon of Terrorists, Families Restless, Confused",
    "summarized_story": "“They should try as much as possible to reach out to the perpetrators and rescue our loved ones.\nBut it’s now an opportunity and a window for the government to rescue our loved ones by opening a channel of communication with them (terrorists).\nWe are appealing to them to come out to open a channel of discussion with the bandits and get our loved ones out as quickly as possible.\nWe are like living corpses.”No fewer than 362 passengers were onboard the train at the time terrorists struck on March 28.\nAccording to Atta, the terrorists said the train attack was just the beginning and that they would go further than this."
  },
  {
    "headline": "Higher Food Prices Drive Inflation to 15.92%, Highest in 5 Months",
    "summarized_story": "Month on month, the headline index increased by 0.11 per cent to 1.74 per cent in March compared to 1.63 per cent in February.\nAccording to the statistical agency, month on month, food inflation was highest in Anambra with 3.78 per cent, followed by Niger with 3.60 per cent and Zamfara 3.31 per cent in the month under review.\nHowever, countrywide, the rise in the food index was caused by increases in prices of bread and cereals, food product, potatoes, yam and other tuber, fish, meat, oils and fats.\nMonth on month, the core sub-index stood at 0.98 per cent in March, down by 0.35 per cent compared to 1.33 per cent in February.\nYear on year, urban inflation increased to 16.44 per cent in March, showing a decline of 2.32 per cent compared to 18.76 per cent in 2021."
  },
  {
    "headline": "Gunmen Invade Soludo’s Community, Kill One Policeman",
    "summarized_story": "David-Chyddy Eleke in AwkaGunmen on Friday invaded Isuofia Community, Aguata Local Government Area, where Anambra State governor, Prof Charles Soludo, hails from.\nTHISDAY gathered one police man was killed in the process, and that the incident happened at a junction leading to the governor’s house.\nA source said the gunmen stormed the junction, where security operatives were stationed, attacking the operatives.\nThe source said the gunmen were angered by the idea of stationing a security post in the area.\n“One police man was however killed in the process,” the source said."
  },
  {
    "headline": "Bank Documents Expose How Akwa Ibom Governor, Emmanuel Wired N110 Million From State Account To PDP Chieftain Before 2019 Election",
    "summarized_story": "Bank documents have shown how Governor Udom Emmanuel of Akwa Ibom State authorised the transfer of N110 million from the state treasury to the personal account of one Obong Akpabong Moffat UdoEkpo, a chieftain of the Peoples Democratic Party (PDP) in the Oruk Anam Local Government Area of the state.\nThe bank documents showing the transactions from Zenith Bank, which were obtained by SaharaReporters revealed that the money was paid in tranches between 05/02/2019 and 22/03/2019 to the personal account of UdoEkpo.\nAkwa Ibom Governor Udom EmmanuelAbout N80 million of the fund was transferred to the PDP chieftain a few days before the March 9, 2019 governorship election in the state, following which Emmanuel secured a second term in office.\nUdoEkpo was a grassroots mobiliser and a strong supporter of the governor’s second term bid.\nUdoEkpo is also contesting to represent the Oruk Anam constituency in the Akwa Ibom State House of Assembly."
  },
  {
    "headline": "Bank Documents Expose How Akwa Ibom Governor, Emmanuel Wired N110 Million From State Account To PDP Chieftain Before 2019 Election",
    "summarized_story": "Bank documents have shown how Governor Udom Emmanuel of Akwa Ibom State authorised the transfer of N110 million from the state treasury to the personal account of one Obong Akpabong Moffat UdoEkpo, a chieftain of the Peoples Democratic Party (PDP) in the Oruk Anam Local Government Area of the state.\nThe bank documents showing the transactions from Zenith Bank, which were obtained by SaharaReporters revealed that the money was paid in tranches between 05/02/2019 and 22/03/2019 to the personal account of UdoEkpo.\nAkwa Ibom Governor Udom EmmanuelAbout N80 million of the fund was transferred to the PDP chieftain a few days before the March 9, 2019 governorship election in the state, following which Emmanuel secured a second term in office.\nUdoEkpo was a grassroots mobiliser and a strong supporter of the governor’s second term bid.\nUdoEkpo is also contesting to represent the Oruk Anam constituency in the Akwa Ibom State House of Assembly."
  },
  {
    "headline": "EXCLUSIVE: APC Senator, Stella Oduah Secretly Obtains PDP Senatorial Nomination Form After Tricking Attorney General, Malami To Frustrate N7.9billion Fraud Trial",
    "summarized_story": "Stella Oduah, a Nigerian Senator and former Minister of Aviation has finalised her defection from the ruling All Progressives Congress (APC) to the Peoples Democratic Party (PDP), SaharaReporters has gathered.\nStella OduahA source told SaharaReporters that the Senator returned to the PDP and secretly obtained the party’s nomination form to return to the Senate.\n“Senator Stella Oduah has finally dumped the APC and moved to the PDP after days of playing hide and seek game.\nSaharaReporters on Tuesday, March 29, 2022 reported that the former aviation minister had concluded plans to dump the ruling APC for the PDP.\nSee Also Politics After Tricking Nigeria’s Attorney General, Malami To Frustrate N7.9bn Fraud Trial, Stella Oduah Moves To Dump APC For PDPSaharaReporters reported that the Senator had held a closed-door meeting with Anyim Pius Anyim, a PDP presidential aspirant and some party leaders."
  },
  {
    "headline": "EXCLUSIVE: APC Senator, Stella Oduah Secretly Obtains PDP Senatorial Nomination Form After Tricking Attorney General, Malami To Frustrate N7.9billion Fraud Trial",
    "summarized_story": "Stella Oduah, a Nigerian Senator and former Minister of Aviation has finalised her defection from the ruling All Progressives Congress (APC) to the Peoples Democratic Party (PDP), SaharaReporters has gathered.\nStella OduahA source told SaharaReporters that the Senator returned to the PDP and secretly obtained the party’s nomination form to return to the Senate.\n“Senator Stella Oduah has finally dumped the APC and moved to the PDP after days of playing hide and seek game.\nSaharaReporters on Tuesday, March 29, 2022 reported that the former aviation minister had concluded plans to dump the ruling APC for the PDP.\nSee Also Politics After Tricking Nigeria’s Attorney General, Malami To Frustrate N7.9bn Fraud Trial, Stella Oduah Moves To Dump APC For PDPSaharaReporters reported that the Senator had held a closed-door meeting with Anyim Pius Anyim, a PDP presidential aspirant and some party leaders."
  },
  {
    "headline": "Prison Is Only For Poor In Nigeria, EFCC Prosecutors Say After Buhari's Government Pardoned Dariye, Nyame",
    "summarized_story": "The Council of State on Thursday granted a state pardon to Dariye and Nyame, who were jailed for corruption.\nThe former governors along with 157 others will be released from prison after the Council of State approved a proposal by President Muhammadu Buhari’s government to grant them a state pardon.\nDariye and Nyame were imprisoned for stealing public funds to the tune of N1.16billion and N1.6billion respectively.\nNyame and Dariye were governors of their respective states from 1999 to 2007.\nHe added that the pardon meant that both Dariye and Nyame could later run for elective offices."
  },
  {
    "headline": "UNILAG assures students of security as body is found floating along waterfront",
    "summarized_story": "The University of Lagos (UNILAG) says a yet-to-be-identified corpse was found on the shore of the Lagoon Front, a resort in the institution.\nAdvertisementAccording to a post on the institution’s Twitter page, the body was found “floating” on Saturday.\nThe university said the police have been notified of the incident, adding that anyone that has relevant information should inform the security agency.\nThe institution also assured its staff and students of the safety of their lives and properties.\nAdvertisement“The body of an unidentified individual was spotted floating on the shore of the University of Lagos Lagoon Front after the heavy rains of the morning of Saturday, April 9, 2022,” the statement reads."
  },
  {
    "headline": "Meet corps member whose photography turned aged Oyo drummer into viral sensation",
    "summarized_story": "When Adisa Olashile, a corps member in Ibadan, Oyo state, noticed the frequent visits of an aged drummer to the venue of his community development service (CDS), many thoughts ran through his mind.\nAdvertisementHere was an old man always beaming with smiles and passionate about entertaining the corps members with his drumming skills each time they gather.\nAdvertisement“I always meet this man at the secretariat where we have our CDS, so I decided to make him smile more with my camera.\nAfter taking his pictures, Olashile realised he could do more for the man than just bring smiles to his face.\nHe decided to mint the man’s photographs as a non-fungible token (NFT) on OpenSea and sold them for 0.3 Ethereum (Eth) each."
  },
  {
    "headline": "Lagos police arrest, query officer for extorting corps member",
    "summarized_story": "An assistant superintendent of police (ASP) named Eyitere Joseph has been arrested for allegedly extorting the sum of N50,000 from a National Youth Service Corps (NYSC) member in Lagos state.\nHow would a father extort a corps member?\n“How would a father extort a corps member?\nThe money has been retrieved and returned to the Corps member.\nhttps://t.co/doLFGHzmIJ pic.twitter.com/p0GjDiFigX — SP Benjamin Hundeyin (@benhundeyin) April 7, 2022Advertisement“The money has been retrieved and returned to the Corps member."
  },
  {
    "headline": "Cannabis sweet tragedy: Mother’s final moments with Nigerian-born student who died in UK",
    "summarized_story": "There is a popular saying: A mother’s love is like an everlasting bed of roses that continues to blossom.\nWhether at the point of death or a stomach-aching laugh during Christmas, the affection between a daughter and her mother is unquantified, seamless and pure.\nAdvertisementWumi Olakanmi, mother of Damilola, the Nigerian-born student who died after she consumed cannabis sweets in the UK, couldn’t leave the bedside of her daughter in her final moments.\nThe 51-year-old was said to have kept vigil by her side until she took her last breath.\nSpeaking on Damilola’s death, Richard Taylor, a justice campaigner and relative of the family, said she was an only child, adding that she was a “promising young woman”."
  },
  {
    "headline": "Fenty designer denies affair with Rihanna’s partner ASAP Rocky",
    "summarized_story": "Amina Muaddi, a shoe designer, has denied having an affair with ASAP Rocky, Rihanna’s partner.\nAdvertisementRumours of a relationship between Muaddi, who designs footwear at Fenty, and Rocky surfaced on Thursday.\nMany claimed that Rihanna, the Barbadian singer, had broken up with Rocky over the purported affair.\n“I initially assumed that this fake gossip, fabricated with such malicious intent, would not be taken seriously.\nAdvertisementIn January 2022, she showed off her protruded belly during an outing in Harlem, A$AP’s hometown in New York."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Digital Nomads: Julian Owusu’s journey from football to fintech",
    "summarized_story": "Even though football held a promising future for Julian, it was only one of his dreams.\n“I grew up playing football,” he says, “But I’ve always been interested in tech, even long before I started playing professionally.”At the beginning of his football career, Julian knew he wanted to tell a different story with his journey.\nI wanted to be different.”He started his professional journey at 16 when he joined Eleven Wise—a Division One football league club based in Ghana—as a striker.\nWhen football players on defining paths, such as Julian, retire, it’s often because of injury.\n“It was difficult at the beginning, but all the skills I’d learnt playing football were transferrable."
  },
  {
    "headline": "MTN Nigeria secures approval to operate Mobile Money Bank",
    "summarized_story": "MTN Nigeria, the Nigerian arm of Africa’s largest telecom, today received final approval from the Central Bank of Nigeria to run a payment service bank.\nWith this approval, MTN Nigeria can provide virtually all the services offered by conventional commercial banks with the exception of granting credit and processing foreign exchange transactions.\nThis announcement follows a previous approval in principle granted in November 2021, to Airtel Africa Plc and MTN Nigeria Communications Plc to operate a payment service bank in the country.\nIn January, MTN revealed that MTN Nigeria’s mobile money service had attracted 9.4 million active users since launching in August 2019.\nThis approval is expected to spur the adoption of mobile money in Nigeria as the use cases increase."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there!\nInteresting times.\nThey say, “if you want something done right, do it yourself.” This is the closest..."
  },
  {
    "headline": "Uber doesn’t want to Friyay",
    "summarized_story": "Uber Tanzania suspends operationsYesterday, Thursday, April 14, 2022, ride-hailing company, Uber, suspended operations in Tanzania until further notice after six years in the country.\nIn Nigeria, Uber increased rates on its UberX platform by 13% in Lagos and 20% in Nigeria’s capital, Abuja.\nSince then, 95 companies have participated as of the Winter 2022 launch, about half of which are financial services providers, and 51 are from Nigeria.\nIt means that OPay cards will be linked to OPay’s mobile app, allowing users to request the issuance or cancellation of prepaid cards.\nThe prepaid cards will be distributed in collaboration with Egyptian Cards Company, the largest card distributor in the local and regional markets."
  },
  {
    "headline": "Can embedded finance drive financial inclusion in Nigeria?",
    "summarized_story": "An embedded finance play involves a company, usually not a financial institution, offering a financial service in addition to its existing offers.\nWhichever way you look at it, embedded finance seems like a good deal for everyone involved, so how does that affect financial inclusion in Nigeria?\nAccording to the World Bank, financial inclusion means that businesses and individuals have access to financial products and services that meet their needs responsibly and sustainably.\nHowever, considering financial inclusion can be achieved in other ways besides using a bank account, this may not be an accurate representation of financial inclusion in Nigeria.\nAdvertisementBy integrating financial services into non-financial solutions, more Nigerians can be integrated into the financial system without requiring a bank account."
  },
  {
    "headline": "Is Flutterwave’s CEO guilty of insider trading or not?",
    "summarized_story": "Anyway, today, I’ll be discussing:Flutterwave CEO’s insider trading allegationHow VC firm, Katapult, investsUmba’s $15 million Series AIs Flutterwave’s CEO guilty of insider trading or not?\nSince then, the phrase “insider trading” has topped my Twitter trend tables.\nIf Chimgozirim’s informant uses this insider information to profit in the stock market, all three involved are guilty and can be prosecuted.\nWhat does the law say about insider trading?\nInsider trading laws apply to private and public companies and transactions involving employees, employee stock plans, and third-party shareholders."
  },
  {
    "headline": "Explainer: Why is Insider Trading a crime?",
    "summarized_story": "What is insider trading?\nThe scenario above illustrates the concept of insider trading, a phenomenon that is not new to capital markets.\nBlack’s Law dictionary defines insider trading as the use of material, non-public information in trading the shares of a company by a corporate insider or other person who owes a fiduciary duty to the company.\nIn Nigeria, there seems to be no clear framework on insider trading for private companies.\nThe United States Securities and Exchange Commission recognizes that the law against insider trading applied to private companies."
  },
  {
    "headline": "How to price your art",
    "summarized_story": "Patrons is a full-suite art advisory firm that helps private and corporate art collectors with diversifying their wealth through art collection, appraisal, packaging & transportation, storage, insurance, maintenance and restoration.\nThe total cost price of your artwork will then be $405.\nSet a price and stick to itWhen you set your price, you are basically setting your standard.\nThey are in the business of art and have mastered the art of pricing.\nSimply put, gallerists are able to convince collectors that the art they sell is worth the asking price."
  },
  {
    "headline": "Nigerian banks hit by ‘Great Resignation’ of top tech talent",
    "summarized_story": "Nigerian banks have been hit by an exodus of tech talent, chief executives of the nation’s lenders say.\nHe referred to it as a “great resignation.”The meeting came as traditional lenders in Africa’s largest economy face stiff competition for talent from technology startups attracting increased funding from international investors and offering better working conditions, in and outside the country.\nRead also: More Nigerian tech developers set sights on jobs abroadAfrica-focused startups raised a record $5 billion last year, with those specializing in digital and mobile payments and lending soaking up most of the funding.\nTwo economic contractions in the last five years have also forced some Nigerians with globally marketable skills to leave the country, with the U.S., Canada and U.K. being preferred destinations.\nThe digital currency app has more than 756,000 downloads since its launch in October, she said, adding that the consumer wallet has 165,000 downloads and the merchant wallet 2,800."
  },
  {
    "headline": "Edo rallies stakeholders, assures programmes to preserve, promote cultural heritage – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has urged for the collaboration of all stakeholders to preserve and promote the state’s rich cultural heritage, reassuring that the government will sustain efforts at preserving the state’s cultural assets and drive growth in the arts, culture and tourism sector.\nThe Edo State Commissioner for Arts, Culture and Diaspora Affairs, Hon.\nBamidele Obaitan, made the call during a meeting with stakeholders in the arts and culture sector, in Benin City, the Edo State capital.\nHe, however, advised heads of social and cultural departments in the local councils to collate the data of all cultural and tourism sites as well as a compendium of all festivals at the grassroots for effective documentation.\nHe further revealed the government’s plan to assist self-employed youths with grants through the African Development Bank (AfDB)."
  },
  {
    "headline": "Good Friday: Obaseki tasks Christians on love, tolerance – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Governor, Mr. Godwin Obaseki, has enjoined Christians across the country to emulate the virtues of tolerance, love and selflessness as espoused by Jesus Christ in commemoration of Good Friday.\nObaseki gave the charge in a message to mark Good Friday, a Christian holiday in preparation for the Easter celebration.\nThe governor noted, “As the Christian faithful celebrate the sacrifice of Jesus Christ on Calvary, I urge everyone to take this opportunity to reflect on the significance of this day which embodies Christ’s love for mankind by imbibing the virtues of love, tolerance and selflessness.\n“It is only when we are able to tolerate and accommodate others; love one another irrespective of religious, political, ethnic, or ideological differences, and live selflessly as Jesus Christ did by sacrificing his life on the cross, that we will be able to tackle the many challenges facing us as a country and people.”Obaseki noted, “As we celebrate Good Friday, I urge all to be our brother’s keeper, uphold the spirit of togetherness and remain resolute on our love for God and our nation.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Buhari, Obaseki unveil 68 housing units in Edo, seek stakeholders’ support to tackle deficit – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestPresident Muhammadu Buhari and the Edo State Governor, Mr. Godwin Obaseki, on Thursday, commissioned 68 housing units, under the National Housing Programme (NHP) Phase 1, in Uhunmwonde Local Government Area of Edo State.\nObaseki, at the unveiling of the units, called for increased collaboration between the state and federal governments, as well as other stakeholders to address the housing deficit in the country.\nThe governor said, “As the National Bureau of Statistics has shown, we have over twenty million housing deficit in Nigeria, which means that very many Nigerians are living without proper shelter.\n“For us in Edo, we are very committed to housing projects.\nThis is one of the first phases of the several phases of the Federal Government Housing projects since 2016.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Senate approves revised 2022 fiscal framework …Approves N4tn for Petrol Subsidy – Nigerian Observer",
    "summarized_story": "Others are Basic Health Care Fund, by N11.58 billion from N56.14 billion to N44.56 billion; and NASENI, by N11.58 billion from N56.14 billion to N44.56 billion.\nLawmakers, who made contributions on the report for the review of the 2022 fiscal framework, attributed the Nigeria’s economic downturn to crude oil theft.\nHe expressed concern over rising cases of oil theft despite huge resources allocated to the military, police and other security agencies.\n“This (crude theft) is not something to play politics with, and I don’t think the answers are going to be easy to come by.\n“So, we need to continue to support the security agencies in whatever way possible so that they are able to deal with this."
  },
  {
    "headline": "2023: APC to hold presidential primary May 31, governors May 23",
    "summarized_story": "Nigeria’s ruling party, the All Progressives Congress (APC), has fixed May 30/31 as the proposed date for its presidential primary election and May 23 for the governorship primary.\nThe APC also proposed that the expression of interest form for the states’ houses of assembly will cost N500,000, while the nomination form will cost N1,500,000.\nFor governorship seats, the expression of interest form will cost N5 million and N25 million for the nomination form.\nFor the presidential position, the expression of interest form will cost N5 million, while the nomination form is fixed for N40 million.\nOn Friday, the party fixed April 20 for a post-convention national executive committee (NEC) meeting."
  },
  {
    "headline": "2023: Anyim calls on PDP members to avoid a repeat of 2015 mistake",
    "summarized_story": "Anyim Pius Anyim, a former senate president has appealed to members of the People’s Democratic Party (PDP) not to repeat the mistake they in 2015 that cost the party power.\nAnyim, a presidential aspirant on the opposition party’s platform, encouraged members of the party to take advantage of the situation in the country today to return it to power in 2023.\nIn 2015, some of us in the PDP, simply decided to pull out of the PDP and breakdown our members and we were plunged into darkness.\nThis just as he promised, like Goodluck Jonathan did, to draft the best heads to manage the economy.\nAnd we were planning that in the second term of President Goodluck Jonathan, we would stretch out these plans and policies."
  },
  {
    "headline": "Nigeria’s inflation rate rises to 15.92 percent in March",
    "summarized_story": "Nigeria’s Consumer Price Index (CPI) which measures inflation increased 1.74 percent, month-on-month to 15.92 percent in March 2022.\nThe bureau explained, however, that the percentage reported was 2.25 per cent points lower compared to the 18.17 per cent rate recorded in March last year.\n“The Urban Inflation rate increased to 16.44 per cent year-on-year in March 2022, showing a decline of 2.32 per cent points from the rate recorded in March 2021 (18.76 per cent).\nIn the same vein, the Rural Inflation increased to 15.42 per cent in March 2022 with a decrease of 2.18 per cent points from 17.60 per cent recorded in March 2021.\nIt said the figure was lower than the 17.29 per cent reported in February 2022, while the corresponding rural inflation rate in March 2022 stood at 16.00 per cent compared to 16.18 per cent recorded in February 2022."
  },
  {
    "headline": "NGX launches West Africa’s first exchange traded derivatives market",
    "summarized_story": "Nigerian Exchange Limited (NGX) has announced the launch of West Africa’s first Exchange Traded Derivatives (ETD) Market with Equity Index Futures Contracts on 14 April, 2022.\nTo promote clearing efficiency, stability, and confidence, the Exchange has collaborated with a premier Central Counterparty (CCP) in Nigeria, NG Clearing Limited, to provide the clearing infrastructure for NGX Derivatives Market and its clearing members – Access Bank and Zenith Bank.\nThe ETDs Market will commence with trading activities by the first three Trading License Holders – Cardinal Stone Securities Limited, Meristem Securities Limited and APT Securities and Funds Limited – who have been cleared by NGX Regulation Limited to facilitate transactions on behalf of investors on NGX Derivatives Market.\nETDs are standardised, highly regulated, and transparent financial contracts listed and traded on a securities exchange, and guaranteed against default through the clearing house of the derivatives exchange.\nNGX ETDs market will complement existing asset classes, provide investors and other market players with the necessary tools for tactical asset allocation, as well as improve risk and cost management for effective portfolio management."
  },
  {
    "headline": "Abuja Ministry Holds 2022 Praise, Drama Festival On Easter Monday",
    "summarized_story": "Vision Drama Missions Outreach International, a drama and film ministry-based organisation in Abuja, Nigeria, will on Easter Monday, April 18, 2022 hold this year’s edition of Praise and Drama festival with the theme, “Fight To Finish Strong This Season”.\nPresident of the organisation, Felix Bankole, said the Praise Drama festival started in 2011 as a mandate from God to raise an altar of praise, worship and pray to God.\nDuring the one-day programme, a new movie titled ‘Mugun Zamani’ (The Wicked Generation) will be premiered at the occasion.\nArtistes that featured in the movie are Shola Mike Agboola, Joseph Opadele, Gloria Amuche, David Emmanuel, and Gabriel Akpanke, among others.\nADVERTISEMENTGuests expected to grace the festival include Chris Morgan, Sam Bulus, Taiwo Emmanuel, Jide, Pastor E.A."
  },
  {
    "headline": "SGF, Govs Felicitate With Christians On Easter",
    "summarized_story": "He urged Christians to emulate the sacrifice of Jesus Christ as well as his teaching on love, compassion, selflessness and tolerance in all dealings.\nObaseki gave the charge in a message to mark Good Friday, a Christian holiday in preparation for the Easter celebration.\nThe governor stated that Easter exemplifies the ultimate sacrifice made by Jesus Christ to save mankind, noting that as individuals, Christians must take into consideration the welfare of others.\nHe said: “Easter symbolises love, sacrifice, service to God and country as well as triumph of good over evil.\nHe said: “Easter symbolises love, sacrifice, service to God and country as well as triumph of good over evil."
  },
  {
    "headline": "Easter: Police, FRSC Urge Crime-free, Accident-free Celebration",
    "summarized_story": "Ahead of the Easter celebration, the inspector-general of Police, IGP Usman Baba, in his resolve to ensure crime-free Easter celebrations, has ordered intensive security patrols of all public spaces and critical national assets.\nThis is even as the corps marshal, Federal Road Safety Corps, Dr Boboye Oyeyemi called on all motorists to ensure full compliance to all road traffic laws.\nAccording to Bisi Kazeem, the corps public education officer, all personnel have been adequately briefed on the imperatives of ensuring that motorists are made to drive in accordance with the stipulation of the Nigerian Highway Code and other regulations on best road practices.\nMeanwhile, the commissioners of police and their supervising AIGs have been directed to ensure proper supervision of the men assigned for these assignments.\nADVERTISEMENTThey must be professional and courteous to law-abiding citizens but firm and ruthless to criminal elements who might want to take the advantage of the festive period to perpetrate their unholy acts."
  },
  {
    "headline": "Easter: Police, FRSC Urge Crime-free, Accident-free Celebration",
    "summarized_story": "Ahead of the Easter celebration, the inspector-general of Police, IGP Usman Baba, in his resolve to ensure crime-free Easter celebrations, has ordered intensive security patrols of all public spaces and critical national assets.\nThis is even as the corps marshal, Federal Road Safety Corps, Dr Boboye Oyeyemi called on all motorists to ensure full compliance to all road traffic laws.\nAccording to Bisi Kazeem, the corps public education officer, all personnel have been adequately briefed on the imperatives of ensuring that motorists are made to drive in accordance with the stipulation of the Nigerian Highway Code and other regulations on best road practices.\nMeanwhile, the commissioners of police and their supervising AIGs have been directed to ensure proper supervision of the men assigned for these assignments.\nADVERTISEMENTThey must be professional and courteous to law-abiding citizens but firm and ruthless to criminal elements who might want to take the advantage of the festive period to perpetrate their unholy acts."
  },
  {
    "headline": "Federal Govt Eulogises Late Orlando Julius, Consoles Family",
    "summarized_story": "The minister of Information and Culture, Alhaji Lai Mohammed, has condoled with the family, friends and fans of the late highlife musician, Julius Aremu Olusanya Ekemode, popularly known as Orlando Julius, saying his death robs the music industry of another trailblazing legend and the nation of another giant star.\nIn a statement issued in Lagos yesterday, the minister described the late Orlando Julius as an all-rounder in his field, noting that he made his mark as a singer, songwriter, saxophonist and performer.\n‘’Despite a larger-than-life image, he remained a decent gentleman and a good family man.\nHis passion for music was unparalleled, hence he excelled in his chosen field.\n‘’By dint of hard work, he and others like him laid the foundation and helped to nurture Afrobeat to global prominence,’’ he said, adding:’’It was, therefore, most fitting that he lived long enough to witness the moment in which Nigerian music has taken the world by storm.’’Alhaji Mohammed urged the family of the late music legend to take solace in the good and remarkable life of their patriarch and prayed for repose to the soul of the departed."
  },
  {
    "headline": "Access Bank becomes Access Corporation from May",
    "summarized_story": "Access Bank Plc said it will be transforming from core banking into a full financial services holding company from 1 May.\nManaging director of the bank, Herbert Wigwe in a notice to shareholders on Saturday said the new company will be known as Access Holdings, PIc, but trading as Access Corporation.\n“This change will see us evolve from a bank into a large-scale ecosystem player offering a new globally connected set of services”, Wigwe said.\n“Payment Company: a Payment Services Company that will drivepayments domestically, across the African continent and beyond.\nPrimarily a business services company, the Payco will make payments simpler, faster and more efficiently."
  },
  {
    "headline": "Nigeria's inflation rate hits 15.92%",
    "summarized_story": "The National Bureau of Statistics (NBS) said on Saturday that the nation’s inflation rate increased to 15.\nAccording to a report released by NBS on March 2022, the Consumer Price Index (CPI) which measures inflation increased to 15.92 percent year on year.\n“This means that headline inflation rate slowed down in March 2022 when compared to the same month the previous year,” NBS said.\n“This shows 0.19 percent points decrease compare to 16.73 percent recorded in February 2022,” NBS further said.\nThe agency also said that the urban inflation rate increased to 16.44 percent year-on-year in March 2022 showing a decline of 2.32 percent points from 18.76 percent recorded in March 2021."
  },
  {
    "headline": "How Osinbajo Declined Obasanjo’s Offer To Dump Lagos, Tinubu in 2005",
    "summarized_story": "Detailing how he turned down Obasanjo’s offer, Ogunsakin in an article titled “Attacking Osinbajo” said “in 2005, President Obasanjo invited Osinbajo to take appointment as the Attorney General of the Federation after Chief Akin Olujimi, SAN left office.\nHe said Obasanjo was impressed by Osinbajo’s impeccable record and wanted him to replicate the wholesome changes he had implemented in Lagos but Osinbajo was loyal to Asiwaju Bola Tinubu and Lagos state.\n“Obasanjo saw the sterling qualities and performance that Osinbajo had as Attorney General of Lagos.\nThe President without informing Tinubu offered the post to the Lagos AG.\nSpeaking further, Ogunsakin said, “the Vice President not only stood with Tinubu, but stayed loyal to Lagos State."
  },
  {
    "headline": "2023: PDP adjusts dates on sale, submission of nomination forms",
    "summarized_story": "The Peoples Democratic Party (PDP) has extended the closing dates for the purchase and submission of Expression of Interest and Nomination Forms ahead of the 2023 general elections.\nAccording to a statement signed by PDP’s National Publicity Secretary, Debo Ologunagba, this is to enable the Party to make up for the two days public holidays during Easter.\nThe last day for the purchase of all forms was Thursday, April 14, 2022, while the last day for the submission of all forms was April 17, 2022.\nThe initial dates for screening of aspirants for State House of Assembly: April 19, 2022, National Assembly: April 20, 2022, Governorship: April 21, 2022, and for Presidential: April 25, 2022.\nHowever, the following dates have now been fixed for the screening of aspirants:State House of Assembly: Friday, April 22, 2022,National Assembly: Monday, April 25, 2022Governorship: Tuesday, April 26, 2022Presidential: Wednesday, April 27, 2022"
  },
  {
    "headline": "Dariye/Nyame: Extend presidential pardon to petty thieves – Falana tells Buhari",
    "summarized_story": "Rights activist, Mr Femi Falana (SAN) has urged the Federal Government under the administration of President Muhammadu Buhari to extend presidential pardon to people serving terms for petty offences.\nFalana said this at the 1st anniversary of Afenifere’s late spokesman, Yinka Odumakin’s Lecture and Book Presentation on Friday in Ikeja.\nRecall that the Council of State granted a presidential pardon to 159 convicts on Thursday.\nFalana said, “All petty thieves in our prisons should be released.\n“When we’re talking of justice and fair play, if you want to pardon some set of people, then you must also extend presidential pardon to petty thieves in the prisons.”According to Falana, this is because if the big thieves are being told to go, then they must also extend the same to other Nigerians."
  },
  {
    "headline": "Buhari under fire for pardoning jailed corrupt ex-Govs, Dariye, Nyame",
    "summarized_story": "President Muhammadu Buhari has come under fire over what has been described as his unnecessary, politically motivated, ill-advised and hasty decision to grant pardon to two former Governors jailed for corrupt practices.\nSenator Joshua Dariye of Plateau State and Mr Jolly Nyame of Taraba State, who were convicted for corruption, were recently pardoned on health and age grounds when they still have several years to complete their jail terms.\nHURIWA recalled that the National Council of State had granted state pardon to Dariye and Nyame of Plateau and Taraba States respectively.\nHURIWA recalled that Mr Nyame, who is 66, governor of Taraba State from 1999 to 2007, was serving a 12-year jail term at the Kuje prison for misappropriation of funds while he was in office.\nRelatedly, Mr Dariye who later got elected as Senator, who is 64, and governed Plateau between 1999 and 2007, was jailed for stealing N2 billion of public funds during his time as Plateau State governor between 1999 and 2007."
  },
  {
    "headline": "Ukraine invasion: Russian state TV declares beginning of World war 3",
    "summarized_story": "Russian state TV says World War Three has already started after the sinking of the Moskva.\nThe Kremlin’s main propaganda mouthpiece went into meltdown last night after the flagship of the Black Sea Fleet was taken out.\nRussia 1, a Kremlin mouthpiece which has championed the war, came close to acknowledging Ukraine sunk the Moskva by demanding a crushing response.\nOlga Skabeyeva, one of Vladimir Putin’s leading propagandists, told viewers Western support for Ukraine amounted to direct conflict with Russia, saying: ‘What it’s escalated into can safely be called World War Three.\nIt is the largest vessel to be sunk in combat since the Royal Navy took out the Belgrano during the Falkland’s War and the most significant naval casualty since the Second World War."
  },
  {
    "headline": "Easter: Christians brace up for another ‘gloomy’ celebration",
    "summarized_story": "In years past, the Easter season was usually evoked a time of celebration for both Christian and non-Christians as they scheduled events for the holiday.\nSo, you can see why I said the Easter will come and go like any other day.”For Mrs Blessing Benjamin, she was is yet to feel that a major celebration like Easter was coming up.\nAccording to Blessing, who manages a poultry farm, it seemed as if people would not celebrate Easter this year.\nThe activities for the celebration usually commence from the Palm Sunday, which we marked a few days ago as Catholics.\nEaster and all forms of religious celebration are no longer enjoyed because of rising cost of living."
  },
  {
    "headline": "Batch C employment: Npower begins payment of 3-month stipends",
    "summarized_story": "The Federal Ministry of Humanitarian Affairs, Disaster Management and Social Development (FMHDSD) has approved the payment of three months’ backlogs of stipends for Npower non-graduate beneficiaries.\nThis was made public via the official Facebook handle of the National Social Investment Management System (NASIMS).\nBlueprint confirms that the payment will not be for “all non-graduate beneficiaries, but only for those who had undergone and successfully completed their training since the last year 2021”.\nThe announcement added that all Npower non-graduate trainees currently receiving training at different camps are apparently excluded from the batch that will be getting their backlogs payment any time soon."
  },
  {
    "headline": "Bashir Nura Alkali resumes Office as New Permanent Secretary for Works Ministry – NigPilot",
    "summarized_story": "Newly appointed Permanent Secretary of the Federal Ministry of Works and Housing, Mr. Bashir Nura Alkali has resumed duty following the recent approval and redeployment of Permanent Secretaries in the Federal Civil Service by His Excellency, President Muhammadu Buhari.\nEarlier in his remarks, Director Overseeing the Office of the Permanent Secretary, Engr.\nThat tells you the kind of person the new Permanent Secretary is.\nBut it is a gain to us in the Federal Ministry of Works and Housing,’’ Uzo said.\nUzo handed over two sets of handover notes, that of the former Permanent Secretary and that of when he acted as the Director Overseeing the Permanent Secretary’s Office."
  },
  {
    "headline": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE – NigPilot",
    "summarized_story": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE, CALLS BOOT PARTY AN APPENDAGE OF THE ALL PROGRESSIVE CONGRESS (APC)The Alliance of Collaborating Political Parties (ACPP) has condemned the felonious court case instituted against the People’s Democratic Party Governorship Candidate in Osun State by the Governorship Candidate of the Boot Party, Adesoji Adeleke.\nIn a statement issued by a Chieftain of the Alliance, Wole Adedoyin who was also the 2018 Governorship Candidate of the Hope Democratic Party (HDP) said the case is baseless, mischievous and full of contradictions to ridicule Senator Demola Adeleke and the People’s Democratic Party (PDP).\nACPP said the suit against Senator Demola Adeleke was in bad faith and targeted by undemocratic elements to undermine democracy and good governance in Osun State.\nAdedoyin said: The Boot Party has become an appendage of the All Progressive Congress (APC) in Osun State.\nThe party is not serious about winning the forthcoming Osun Governorship Election."
  },
  {
    "headline": "Soludo sets up 15 man peace Committee on insecurity in South East",
    "summarized_story": "Anambra state government has set up a truth, justice and peace Committee which is comprised of 15 members drawn from different fringes of the South Eastern region.\nThe members of the committee are Prof.Chidi Odinkalu as the Chairman, Amb.\nMrs. Bianca Ojukwu, Secretary, Dr. Joe Nworgu,Dr. Udenta Udenta, Mr. Charles Oputa(Charly Boy), Ms. Onyeka Onyenu.\n” To identify the remote and immediate causes of the agitations, restiveness, violence, and armed struggle in the South East since 1999.\nIt was gathered the committee would be inaugurated on a date to be communicated to its members."
  },
  {
    "headline": "Lalong salutes elder statesman Amb Yahaya Kwande @ 93",
    "summarized_story": "Plateau State Governor Simon Bako Lalong has sent warm felicitations to elder statesman Ambassador Yahaya Kwande on the occasion of his 93rd birthday.\nGovernor Lalong in a message signed by Macham Makut the director of press and public affairs to Governor Lalong congratulated the seasoned Administrator, Politician, Diplomat and philanthropist for his selfless service to Nigeria, Plateau State and humanity at large.\nHe described him as an accomplished personality who has made huge impact in the lives of the people at various times when he occupied various offices in the country.\nThe Governor said Ambassador Kwande has mentored many in public service, politics and humanitarian activities by his record of performance over the years where he has freely offered counsel, support and goodwill to those in power and others.\nAccording to Governor Lalong, Ambassador Yahaya is one of the few elders that have demonstrated sufficient interest in the peace, progress and prosperity of Plateau State and Nigeria over the years, hence his willingness to advise and share his wealth of experience with the Government on key issues."
  },
  {
    "headline": "Edo LG Poll: EDSIEC extends date for conduct of primaries, insists on April 19 for election",
    "summarized_story": "The Edo State Independent Electoral Commission (EDSIEC) has extended the date for the conduct of party primaries for the local government elections by two days.\nThe Commission, however, said the extension will not affect the April 19 date earlier scheduled for the council polls.\nThe statement reads: “It is hereby announced for the information of the general public, particularly Registered Political Parties in the state that the Edo State Independent Electoral Commission has extended the date for the conduct of primaries by two (2) days.\n“This is in view of the number of Registered Political Parties that have scheduled their primaries on the 6th of April, 2022 which is the last day for the conduct of the primaries.\nThe last date for the primaries is Friday, April 8, 2022.”“The shift of date for the primaries has nothing to do with the date of the election, as other dates remain fixed and firm,” Ojo added."
  },
  {
    "headline": "Imo Should Not Be A Killing Field, Uzodimma Seeks End To Violence",
    "summarized_story": "Governor Hope Uzodimma of Imo has called on the people of the state, especially aggrieved residents to shun violence and embrace peace.\nHe pleaded that it was about time they turned a new leaf to prevent the state from slipping into a killing field where the blood of innocent residents flow freely.\nThe governor made the plea in his Easter message to the people in which he re-echoed his call on sponsors and perpetrators of violence to sheath their swords and give a chance for reconciliation.\nREAD ALSO: Airline Operators Decry Attacks On Officials, Call For Improved Security At AirportsIn the spirit of the Easter season, Governor Uzodimma urged such persons to go through the proper legal channels to lodge their grievances.\nHe wished the people a happy Easter celebration and urged them not to relent in their prayers for peace in Imo and other states across the country."
  },
  {
    "headline": "Airline Operators Decry Attacks On Officials, Call For Improved Security At Airports",
    "summarized_story": "The Airline Operators of Nigeria (AON) has called on the Federal Government to beef up security at the nation’s airports and ensure that the lives of airline staff and their properties are lawfully protected.\nHe lamented that some unruly passengers, who assaulted the aviation workers due to a flight delay, also destroyed some of the airline’s properties.\nSarina said this has further heightened the union’s concern and worry over the increasingly deplorable state of security and the rising threat to the lives of airline staff and their properties at the airports.\nSarina believes the unruly passengers that went after Max Air and destroyed its computer reservation systems further exacerbates the problem for other passengers going to other destinations.\nHe warned that should there be a reoccurrence like that of Max Air, the union might be forced to have a rethink on how to respond in such circumstances."
  },
  {
    "headline": "Procedures Govt Should Follow To Remove Petrol Subsidy – Moghalu",
    "summarized_story": "﻿There are a number of procedures to be followed by the Federal Government before removing the subsidy on Premium Motor Spirit (PMS), also known as petrol.\nOne of such critical steps to be taken is the provision of an effective public transportation system in the country, Professor Kingsley Moghalu suggested on Friday.\nMoghalu, a deputy governor of the Central Bank of Nigeria (CBN) between 2009 and 2014, made the recommendation during an interview on Channels Television’s Politics Today.\n“If you spent N1 trillion; you don’t even have to do that,” he said.\n“There should be a proper plan of investments in public transportation before you can remove petroleum subsidy."
  },
  {
    "headline": "Kaduna Train Attack: Families Warn NRC Against Resumption Of Services",
    "summarized_story": "﻿Relatives of the abducted persons in the Kaduna train attack have warned the Nigerian Railway Corporation not to resume services on the Abuja-Kaduna route until their loved ones abducted by bandits are released.\nChairman of the Concerned Relatives of Abducted Persons, Dr Abdulfatai Jimoh, said it is inhumane for the NRC to resume operations while the kidnapped victims are still languishing in the forest.\nREAD ALSO: [Kaduna Train Attack] Kidnapped BOA MD Regains FreedomThe angry relatives vowed to disrupt train services on the Abuja-Kaduna route if the victims are not rescued before the resumption of train services.\nThe train attack occurred on March 28, leaving at least seven people dead and over 100 unaccounted for.\nThe bandits have released footages of the abducted persons who called for the government to help rescue them."
  },
  {
    "headline": "Russia Bans Entry To British PM Boris Johnson",
    "summarized_story": "Moscow on Saturday announced it was banning entry to Prime Minister Boris Johnson and several other top UK officials, after London imposed sanctions on Russia over its military operation in Ukraine.\n“This step was taken as a response to London’s unbridled information and political campaign aimed at isolating Russia internationally, creating conditions for restricting our country and strangling the domestic economy,” the foreign ministry said in a statement.\nThe ministry accused London of “unprecedented hostile actions”, in particular referring to sanctions on Russia’s senior officials.\nRussia’s entry blacklist includes UK Deputy Prime Minister Dominic Raab, Foreign Secretary Liz Truss, Defence Secretary Ben Wallace, former Prime Minister Theresa May and the First Minister of Scotland Nicola Sturgeon.\nBritain has been part of an international effort to punish Russia with asset freezes, travel bans and economic sanctions, since President Vladimir Putin moved troops into Ukraine on February 24."
  },
  {
    "headline": "2023 Presidency: Gov Yahaya Bello is APC’s best bet",
    "summarized_story": "The Yahaya Bello Presidential Campaign Organisation says the governor Yahaya Bello possesses all the attributes that can retain the presidency for the ruling All Progressives Congress in 2023.\nOf the pool of aspirants, as the country stands today, even across party lines, Governor Yahaya Bello is the best bet for the younger generation if this dream must be actualized.\nBeing the strongest contender from the region places Governor Bello in a vantage position to clinch the presidential ticket.\nTherefore, in terms of the main issues confronting the nation, Governor Yahaya Bello has excelled remarkably in Kogi State.\nThey will rally round Governor Yahaya Bello and retain the presidency with a wide margin come 2023.”"
  },
  {
    "headline": "Asiwaju Tinubu urges Christians to imbibe the example of Christ on Good Friday -",
    "summarized_story": "Former Governor of Lagos State and the National Leader of the APC, Asiwaju Bola Ahmed Tinubu, has urged Christians across Nigeria and the world at large to imbibe Christ’s life of service, sacrifice and compassion as they mark Good Friday.\nTinubu, an All Progressives Congress (APC) Presidential Aspirant, made the call in a statement to mark Good Friday in Lagos.\n“In this, we are reminded that we Nigerians may be of different religions, yet we are of one family.\nHe said Nigerians must stand against those who sought to do injustice to another because of their religious creed, ethnicity, or place of origin.\nHe, advised Nigerians to live a life of compassion, love, and selflessness , which Jesus preached and lived, and for which He gave his innocent, blameless life."
  },
  {
    "headline": "Reps Minority Caucus Rejoices with Nigerians at Easter -",
    "summarized_story": "The Minority Caucus in the House of Representatives has felicitated with Nigerians at Easter.\nThe caucus describes Easter as a pointer to the victory of life over death.\nThe lawmakers say Easter offers inexorable lessons in faith and hope of the imminent triumph of light over darkness, justice over injustice, peace over chaos and unity over division under a new leadership that truly cares for the people.\nIt notes that the sacrificial death and triumphant resurrection of Jesus Christ demonstrate the mercies of God in redeeming the sinful world, His love for mankind and readiness to bring solution to individual and collective challenges with trust in Him.\nIt tasks citizens to put aside all parochial differences and rekindle the virtues of love, forgiveness, piety, honesty, mutual respect, regard to rules as well as industry and resilience for which Nigerians are known all over the world."
  },
  {
    "headline": "Gov. Ortom thanks Preisdent Buhari, Council of State on Dariye, Nyame pardons -",
    "summarized_story": "Governor Samuel Ortom of Benue State has expressed appreciation to President Muhammadu Buhari and the National Council of States for granting state pardon to former Governors of Plateau and Taraba States, Senator Joshua Dariye and Rev.\nGovernor Ortom had earlier appealed to the federal government to review their cases with a view to granting them state pardon.\nOn Thursday, the National Council of States under the chairmanship of President Buhari met in Abuja, considered and approved the state pardon for Senator Dariye, and others.\nThe Governor thanked President Buhari and the National Council of States and the federal government over the gesture even as he admitted that some useful lessons must have been learnt from the incident.\nHe said Senator Dariye and Jolly Nyame will now reunite with their families and live a happy life once again."
  },
  {
    "headline": "Higher Food Prices Drive Nigeria’s Inflation to 15.92%, Highest in 5 Months",
    "summarized_story": "Month on month, the headline index increased by 0.11 per cent to 1.74 per cent in March compared to 1.63 per cent in February.\nAccording to the statistical agency, month on month, food inflation was highest in Anambra with 3.78 per cent, followed by Niger with 3.60 per cent and Zamfara 3.31 per cent in the month under review.\nHowever, countrywide, the rise in the food index was caused by increases in prices of bread and cereals, food product, potatoes, yam and other tuber, fish, meat, oils and fats.\nMonth on month, the core sub-index stood at 0.98 per cent in March, down by 0.35 per cent compared to 1.33 per cent in February.\nYear on year, urban inflation increased to 16.44 per cent in March, showing a decline of 2.32 per cent compared to 18.76 per cent in 2021."
  },
  {
    "headline": "Kaduna Train Attack: Families of Abductees Plan to Resist Resumption of Train Services If Loved Ones Are Not Rescued",
    "summarized_story": "Families of some abductees on the Abuja-Kaduna train on Friday warned that they would resist any attempt to resume services on the route without rescuing their loved ones.\nThey also lashed out at the Minister of Transport, Rotimi Amaechi, for declaring for president days after the train attack, saying he was insensitive to the plight of the people and should resign.\nRelatedStories No Content AvailableJimoh warned the NRC against the proposed resumption of train services without first rescuing the kidnapped victims.\nHe said further that in the course of his discussions with them during the phone call, the terrorists told him that the state governor, (Nasir El-Rufai) had been running his mouth and that was why they came to his doorstep.\nAccording to Atta, the terrorists said the train attack was just the beginning and that they would go further than this."
  },
  {
    "headline": "Nigeria: 20 Days After, 68 Abducted Train Passengers Languish in Dungeon of Terrorists, Families Restless, Confused",
    "summarized_story": "One of the abducted family members, Aliyu Mohammed, who spoke in Abuja last Thursday, begged the terrorists to give room for families to negotiate the release of their loved ones.\n“They should try as much as possible to reach out to the perpetrators and rescue our loved ones.\nBut it’s now an opportunity and a window for the government to rescue our loved ones by opening a channel of communication with them (terrorists).\nWe are appealing to them to come out to open a channel of discussion with the bandits and get our loved ones out as quickly as possible.\nWe are like living corpses.”No fewer than 362 passengers were onboard the train at the time terrorists struck on March 28."
  },
  {
    "headline": "World Bank in Latest ‘Africa’s Pulse’ Projects 2.7% Growth for Nigeria in 2022",
    "summarized_story": "The World Bank in its latest Africa’s Pulse, a biannual analysis of the near-term regional macroeconomic outlook, has projected a 2.7% growth for Nigeria in 2022.\nOf the region’s three largest economies – Angola, Nigeria, and South Africa – onlyNigeria is projected to enjoy a fairly good growth in 2022.\nThe report said growth in South Africa is expected to decline by 2.8 percentage points in 2022, dragged by persistent structural constraints.\nResource-rich countries, especially their extractive sectors, will see improved economic performance due to the war in Ukraine, while non-resource rich countries will experience a deceleration in economic activity,” said the World Bank.\nIt said: Excluding Angola, Nigeria and South Africa, regional growth is projected at 4.1 per cent in 2022, and 4.9 per cent in 2023."
  },
  {
    "headline": "UK Rwanda Asylum Plan Against International Law, Says UN Refugee Agency",
    "summarized_story": "Plans to send some asylum seekers from the UK to Rwanda are a breach of international law, the UN’s refugee agency has said.\nAustralia has used offshore detention centres since 2001, with thousands of asylum seekers being transferred out of the country since then.\nThe announcement came as part of a broader strategy to reduce the number of people entering the UK by crossing the Channel in small boats.\nThe Royal Navy has taken operational command of the Channel from UK Border Force in an effort to detect every boat headed to the UK.\nNo-one making the crossing was believed to have arrived on UK soil “on their own terms”, it added."
  }
]