[
  {
    "headline": "Why many Nigerians stopped going to zoos —Experts",
    "summarized_story": "Answering questions during a News Agency of Nigeria survey, the experts said that the poor state of the economy had compelled most Nigerians to consider visiting zoological gardens as secondary.\nAccording to Gbolagade, hardly do Nigerians consider going to zoological gardens as relevant or important any more, except students who are compelled by their various institutions and few others.\n“Zoological gardens and other places of tourism are at the receiving end of such rejection.\n“We have the University of Ibadan Zoological Garden, University of Ilorin Zoological Garden, FUNAAB Zoo and Obasanjo Library Zoo, among others.\n“However, many zoological gardens, such as Agodi Gardens and some others, have folded up due to reasons bordering on financial incapability as well as manpower and institutional-based problems."
  },
  {
    "headline": "Rainy season: Ensure functional wipers, clear windscreen, FRSC urges motorists",
    "summarized_story": "The Federal Road Safety Corps has urged motorists to ensure that their vehicles are in good condition before putting them on the highway during this rainy season.\nIt said that motorists must ensure functional wipers, brake system, headlamps, rear lights, traffic indicators, side glasses, and clear windscreen while driving on the expressway during the rains.\nHe said that driving under the rain was like driving under emergency, hence motorists must ensure that all the necessary functional vehicle parts were good order.\n“We are in the rainy season; motorists must ensure they have functional wipers, brakes, rear lights, trafficators, headlamps and a very clear windscreen for clearer vision,” Alonge said.\nThe FRSC boss urged motorists to ensure strict compliance to all traffic rules and regulations saying that erring motorists and other road users would face the law if arrested."
  },
  {
    "headline": "BREAKING: DSS files terrorism charges against Igboho aides",
    "summarized_story": "The Department of State Services has filed terrorism charges against two detained aides of Yoruba Nation agitator Sunday Adeyemo also known as Sunday Igboho.\nIn the suit no FHC/ABJ/CR/305/2021, which was dated August 31, 2021, the DSS through its lawyer S.M.\nBello, filed five terrorism charges against Noah Oyetunji and Amudat Babatunde (female).\nThe DSS alleged that Oyetunji was in possession of fire arms for terrorism-related activities while Babatunde promoted terroristic acts through her Facebook account.\nThe PUNCH had earlier reported that the DSS, last week, freed 10 of the 12 aides of Igboho after over 60 days in detention following their arrested since July 1."
  },
  {
    "headline": "Buhari’s visit: Demand release of Nnamdi Kanu – MASSOB tells Igbo leaders",
    "summarized_story": "By Anayo OkoliAHEAD of the planned visit of President Muhammadu Buhari to Imo State today, the Actualization of the Sovereign State of Biafra, MASSOB, has urged Igbo leaders of all shapes to demand from the President, the release of detained leader of IPOB, Mazi Nnamdi Kanu.\nMASSOB reminded Igbo leaders that Kanu is allegedly being subjected to human tortured for the sake of Ndigbo.\nAccording to MASSOB, Nnamdi Kanu represents the aspirations of Ndigbo.\n“It is imperative that Mazi Nnamdi Kanu is being subjected to inhuman torture at the DSS detention cage because of Ndigbo.\n“They must demand for the release of Mazi Nnamdi Kanu from detention."
  },
  {
    "headline": "Niger Govt confiscate 500 bags of charcoal in fight to save forests",
    "summarized_story": "The Niger state Task Force on forest exploitation on Wednesday auctioned 500 bags of charcoal confiscated from dealers of the commodity in the state, according to Alhaji Ahmed Matane, Secretary to the State Government.\nThe secretary to the government added that government would not rest on its oars in ensuring the full protection of forests in the state.\nMatane solicited the support of traditional rulers, community leaders and other stakeholders in combating the menace and commended the efforts of the Task Force for a great job.\nHe urged the Ministry of Environment and the task force to intensify their effort towards putting an end to the unfortunate practice, while assuring them of government’s continued support and cooperation to succeed.\nThe Coordinator, Niger State Task Force on Forest Exploitation, Saidu Alfa, said that the act of felling trees to produce charcoal remained a threat to the society, but expressed optimism that under the present administration the culture would be fought accordingly."
  },
  {
    "headline": "Breaking: DSS files 5-count terrorism charge against Igboho’s 2 aides",
    "summarized_story": "By Ikechukwu NnochiriThe Department of State Services, DSS, has preferred a five-count terrorism charge against two detained associates of Yoruba Nation agitator, Sunday Adeyemo popularly known as Sunday Igboho.\nListed as Defendants in the charge marked FHC/ABJ/CR/305/2021, which was entered before the Federal High Court in Abuja, Noah Oyetunji and the only lady that was arrested during the July 1 raid of Igboho’s residence by DSS operatives, Amudat Babatunde.\nWhereas the DSS alleged that the 1st Defendant, Oyetunji, was in possession of fire arms for terrorism-related activities, it alleged that Amudat helped to promote acts of terrorism, using her Facebook page.\nIt will be recalled that though the DSS has so far released 10 out of the 12 persons it arrested at Igboho’s house, it retained the two Defendants it charged to court in its custody.\nVanguard News Nigeria"
  },
  {
    "headline": "SSANU lauds Abdullahi for raising standard of education",
    "summarized_story": "…Education takes highest budget in Nasarawa – GovBy Johnbosco AgbakwuruTHE Senior Staff Association of Nigerian Universities, SSANU, has commended Governor Sule Abdullahi of Nasarawa state for raising the standard of education in the state.\nNational President of SSANU, Comradu Mohammed Haruna Ibrahim made the commendation when he led the executive members of the union on a courtesy visit to the governor.\nHe praised the governor for what he described as his glaring impact in raising the standard of all Schools in Nasarawa State.\n“Next to the Education sector is infrastructural development across Nasarawa State,” he said.\nThe governor said reasonable sums of money have been expended in the development of the State University especially in the upgrading of faculties of medicine and engineering."
  },
  {
    "headline": "Paris Club refunds: Ned Nwoko’s lawyers fault alleged wrong narratives by NGF",
    "summarized_story": "The lawyers said: “The facts and circumstances of the case at hand with respect to suit No.\n“It is dishonest, deceitful and malicious to pretend that it is wrong to obey court orders.\n“The court cannot grant a stay of execution of a judgment that has been executed.\nFurthermore, the NGF was part of the processes that culminated in the enforcement of the court judgment in suit No.\nFHC/ ABJ/CS/130/2013 leading to the refunds to local governments and part payment of the consultancy fees of Linas International Limited by the Federal Government in 2018.”Vanguard News Nigeria"
  },
  {
    "headline": "NCC launches Strategic Vision Plan 2021-2025, podcast, unveils ‘Compendium of EVC’s Speeches’",
    "summarized_story": "Nigerian Communications Commission, NCC, on Tuesday launched a new Strategic Vision (Implementation) Plan (SVP) 2021-2025 which will define its strategic thrusts for the next five years.\nThe Commission also officially unveiled a book, ‘Compendium of EVC’s Speeches’, which is an official compendium that represents a collection of the EVC’s various speeches and presentations over the period of his first tenure in office.\nDanbatta spoke at the event held on Tuesday at the Communications and Digital Economy Complex, Mbora, Abuja which also saw the launch of the NCC Podcast, the NCC Global Connect.\nThe NCC recorded a broadband penetration of 31.48% in December 2018.\nThe NCC Podcast is portable, timeless, boundless, global and can be tuned in to it anywhere, any time."
  },
  {
    "headline": "Police demanding huge money for my late brother’s autopsy – Sowore",
    "summarized_story": "Omoyele Sowore, Publisher of Sahara Reporters, has accused the Nigeria Police Force of trying to frustrate his family after his younger brother was shot dead in Edo state.\nSowore raised the alarm in a post via his Facebook account on Wednesday.\nHe alleged that the Nigeria Police Force is charging them exorbitantly to ”discourage” them from getting an autopsy for his murdered brother, Olajide Sowore.\n”Nigeria Police Force is trying to shake my family down by charging us exorbitantly to discourage us from getting an autopsy for my murdered brother, Olajide Sowore!\nRecall that Olajide was shot dead on Saturday in Edo State."
  },
  {
    "headline": "How president begged me for attention – Pastor Adeboye",
    "summarized_story": "Pastor Enoch Adeboye of Redeemed Christian Church of God, RCCG, has disclosed how an African president once begged for his attention.\nAdeboye said he spent almost three hours conversing with the African leader, who had initially granted him an audience of about 15 minutes.\nThe RCCG General Overseer spoke while delivering a sermon at the dedication of Love of Christ Generation Church C & S Cathedral in Lagos.\nAccording to Adeboye: “Some years ago, my wife and I went to one African country to hold a crusade, Holy Ghost Service, we said we would love to say hello to the President, they said okay he says you can come, maximum fifteen minutes.\n“Finally, almost three hours later, we managed to come to prayers.”Adeboye confirms release of 8 RCCG members"
  },
  {
    "headline": "COVID-19: Some pastors secretly take vaccine, mislead members – Prophet Iginla",
    "summarized_story": "Prophet Joshua Iginla of the Champions Royal Assembly has accused some pastors of misleading their members over the COVID-19 vaccine.\nIginla said some pastors who have taken the COVID-19 vaccine secretly are asking their members not to get vaccinated.\nBut to be more real, most of the negative things said about the COVID-19 vaccine are totally erroneous and false.\n“Do not be deceived and misled; some of the people advising you against the COVID-19 vaccine have secretly taken it.\nBe accountable for your deeds dear Brethren.”My heart heavy, eyes full of tears – Prophet Iginla speaks as TB Joshua’s body set for burial"
  },
  {
    "headline": "BREAKING: Igboho aides: Armed robbers hijack DSS case file in Abuja",
    "summarized_story": "Barrister I. Awo, the counsel for the Department of State Service, DSS, has told the Federal High Court, Abuja, that the case file containing the fundamental human rights enforcement application filed by aides to the embattled Yoruba activist, Sunday Adeyemo, alias Sunday Igboho, was stolen by armed robbers in the nation’s capital.\nThe counsel told Justice Obiora Egwuatu on Wednesday that his colleague, who was conveying the document to the court, boarded a vehicle belonging to some criminals who carted away the file and other personal items.\nRecall that the DSS had, during a midnight invasion of Igboho’s Soka house in Ibadan, the Oyo State capital, arrested 12 of the activist’s allies and detained them in Abuja.\nThe detained aides had approached the court to seek their fundamental rights to freedom from the custody of the DSS.\nEgwuatu, during a sitting on August 4, 2021, granted bail to the 12 detainees."
  },
  {
    "headline": "BREAKING: Killers of Plateau ex-governor’s father confess",
    "summarized_story": "From Molly Kilete, AbujaThe Nigeria Police Force headquarters has paraded the killers of Pa Defwan Dariye, the father of former governor of Plateau State Joshua Dariye.\nThe 93-year-old man was killed after his abductors collected N10 million ransom from his family.\nThe leader of the kidnap gang Jethro Nguyen, 53, an indigene of Bokos, said he had to hire ten others including some Fulani herders to successfully abduct the old man from his palace and kept him in custody for about ten days before killing him.\nNguyen, who is also the mastermind of the crime, said he gave one of the abductors the order to shoot and kill the old man.\nHe said he decided to abduct the old man because he was a good target to make money as his son was a one time governor of Plateau State and senator of the Federal Republic."
  },
  {
    "headline": "Doctors seek Osinbajo’s intervention to end strike",
    "summarized_story": "By Henry UcheThe National Association of Resident Doctors (NARD) has vowed not to call off its over one-month industrial action without intervention of Vice President Yemi Osibanjo.\nIts National President, Osakhuesuyi Uyilawa, said the union would only call return to duty if it got a strong commitment from Prof. Osibanjo.\n“If we get strong commitment from the vice president, I can put myself on the line, I can take it to the national executive of the association, if we get that (commit ment) from the vice president, we can do anything to call-off the strike, the vice president can be trusted.\nJOESU President, Biobelemoye Josiah, has blamed the Federal Government for the industrial action, claiming it had always reneged on agreements.\nThis came barely a week after the NMA and its affiliates also handed down a 21-day ultimatum to declare an industrial action if government failed to resolve all issues contained in the various agreements signed with the doctors."
  },
  {
    "headline": "Cholera: Anxiety mounts in Ogun community as 10 feared dead",
    "summarized_story": "Anxiety is mounting in Magboro Community of Ogun State over the death of 10 people arising a from suspected Cholera outbreak.\nSuspected Cholera outbreak was first reported on Friday, when a resident of the community living in an uncompleted building died.\nMeanwhile, Magboro community leaders have begun a house-to-house search for victims to help them get care.\nThe Secretary of Magboro Community Development Council, Mr David Ajayi, said that the deaths could have been averted if those affected reported in time.\n“We received the report of suspected cholera outbreak when the deed had already been done."
  },
  {
    "headline": "Buhari orders sustained action to end insecurity",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhmmadu Buhari has ordered sustained action to end the menace of abduction and killings in the North Central and North Eastern parts of the country.\nHe gave the order at a meeting with the nation’s security chiefs at the Presidential Villa, Abuja, yesterday.\nWe should reinvigorate our efforts, which are yielding results in the North East, South East.\nBut there is more to be done in the North Central, North West, where people are worried and he has intelligence and information that schoolchildren and students are abducted, selective abductions and killings are done.\n“We believe that the spate at which these things are happening in Zamfara State and North central is a source of concern to the government and to all agencies that are responsible for the execution of the operations in the North Central."
  },
  {
    "headline": "Senate begins public hearing on Kalu’s motion on illegal mining, gold smuggling",
    "summarized_story": "From Kenneth Udeh, AbujaThe Senate will on Monday commence a three-day public hearing on illegal mining and gold smuggling and the attendant losses of about $9 billion yearly to Nigeria.\nFormer Nasarawa Governor and Chairman, Senate Committee on Solid Minerals, Mines, Steel Development and Metallurgy, Tanko Al-Makura, is expected to preside over the legislative activity.\nThe senate at its plenary last year had passed a resolution to investigate the losses from illegal mining activities.\nHe also said the country was losing about $9 billion yearly to illegal mining and gold exportation.\nHe lamented the activities of unlicensed miners and incessant smuggling of the solid minerals out of the country by middlemen given the huge revenue losses."
  },
  {
    "headline": "Masari: With Hindsight, We Should Never Have Negotiated With Bandits",
    "summarized_story": "Although Masari said he never regretted his decision at the time, he admitted that information available to him confirmed that engaging the bandits was not the right thing to do.\nThe governor of the North-west state also identified informants as the greatest challenge to the fight against insecurity in that part of the country.\nBaba said the president had directed all security agencies in the country to ensure immediate end to the situation.\nMasari, who had offered marauding gunmen amnesty, after negotiations with them, said looking back in hindsight, he should not have done that.\nBut the only thing I can say is that with the benefit of hindsight, I wouldn’t have done it."
  },
  {
    "headline": "PDP Govs Meet Today, to Zone NWC Offices, Silent on Presidential Ticket",
    "summarized_story": "In the micro-zoning of the NWC offices, the governors were said to be against the re-election of some NWC members as their continued stay negated their 2023 political ambitions.\nAs at press time, former PDP members of the National Assembly had met with the NWC members at the party’s secretariat on the arrangement.\nChairman of the PDP Governors’ Forum, Hon.\nThe PDP governors assured all PDP members, stakeholders, and the country of their commitment, determination and loyalty to the patriotic task of dislodging the All Progressives Congress (APC) government in 2023.\nMeanwhile, the PDP national secretary, Senator Umaru Tsauri, has confirmed that the 93rd NEC meeting of the party would hold on Thursday."
  },
  {
    "headline": "Auwalu Hosts Kyari, Says DPR Plans Additional 14bn Barrels, 68TCF of Gas in Reserves",
    "summarized_story": "Emmanuel AddehThe Department of Petroleum Resources (DPR) is close to ramping up Nigeria’s 36.9 billion barrels crude oil reserves by 14 billion barrels and the country’s gas reserves by an additional 68 Trillion Cubic Feet (TCF), Director of the organisation, Mr Sarki Auwalu, stated yesterday.\nSpeaking when he received the Group Managing Director of the Nigerian National Petroleum Corporation (NNPC), Mallam Mele Kyari and top management team of the corporation in his office, Auwalu disclosed that the possibility of getting 14 billion barrels out of the 18 billion barrels in the works remains very high.\nThis year, we have looked at the reserves of gas and those reserves are in P3 and migrating to P2.\n“For oil, we have discovered P3 reserves in P2 area of about 18 billion barrels and 75 per cent of this 18 billion barrels exist in the P2 production area.\nSo the potential for us to increase about 14 billion barrels is there, and we’re ready to declare this full increase to our own reserves,” Auwalu stressed."
  },
  {
    "headline": "Angry CJN Meets 7 CJs, 3 to Face NJC Investigation over Conflicting Orders",
    "summarized_story": "•Warns against granting ex parte orders on political mattersAlex Enumah in AbujaThree State Chief Judges (CJs) will any time from now appear before the National Judicial Council (NJC) to explain why disciplinary action should not be taken against them for alleged issuance of conflicting court orders.\nMuhammad had last week Monday invited some CJs to explain the rationale behind the issuance of contradictory court orders and indiscriminate injunctions by judges in their jurisdictions.\nThe CJN warned the CJs against making newly appointed judicial officers vacation judges and assigning complex cases to inexperienced judges.\nThe CJN advised all Heads of Court to be current on developments in the polity and the judgments delivered by courts of various jurisdictions.\nHe also told them to urgently issue practice direction to guide judges in their various courts to avoid giving conflicting decisions."
  },
  {
    "headline": "VAT Judgment: Court Refuses FG’s Plea for Stay of Execution",
    "summarized_story": "Accordingly, Rivers State Governor Nyesom Wike warned the FIRS against sabotaging the authority of the state to freely administer the VAT in line with the court ruling.\nThe FIRS had following the judgement against it requested the high court to stop the Rivers State government from executing the ruling.\nHe said the state government and the House of Assembly had duly enacted the Rivers State Value Added Tax No.\nHe said Rivers State would not allow further collection of VAT from corporate bodies and businesses operating in the state by the federal government agency.\n“As expected, the federal government, through the FIRS, disagreed and filed an appeal coupled with a request for stay-of-execution of the judgement before the Federal High Court."
  },
  {
    "headline": "BREAKING: Lawless Department Of State Services Files Terrorism Charges Against Two Remaining Sunday Igboho’s Aides",
    "summarized_story": "The Department of State Services (DSS) has filed fresh charges against two remaining aides of Sunday Adeyemo, popularly known as Sunday Igboho, detained in the agency’s custody.\nSaharaReporters gathered that the move by the secret police is to further detain the duo, Amudat Habibat Babatunde and Jamiu Noah Oyetunji despite a court order that granted them bail.\nFile Photo: DSS parade Sunday Igboho’s aides after “raiding” Igboho’s Ibadan residence in a Gestapo style, killing two other associates.\nJustice Obiora Egwuatu of the Federal High Court sitting in Abuja had on August 4, 2021, granted bail to Babatude, Oyetunji and 10 others.\nWhile the the secret police released others, the duo are still being held despite fulfilling their bail conditions."
  },
  {
    "headline": "BREAKING: Lawless Department Of State Services Files Terrorism Charges Against Two Remaining Sunday Igboho’s Aides",
    "summarized_story": "The Department of State Services (DSS) has filed fresh charges against two remaining aides of Sunday Adeyemo, popularly known as Sunday Igboho, detained in the agency’s custody.\nSaharaReporters gathered that the move by the secret police is to further detain the duo, Amudat Habibat Babatunde and Jamiu Noah Oyetunji despite a court order that granted them bail.\nFile Photo: DSS parade Sunday Igboho’s aides after “raiding” Igboho’s Ibadan residence in a Gestapo style, killing two other associates.\nJustice Obiora Egwuatu of the Federal High Court sitting in Abuja had on August 4, 2021, granted bail to Babatude, Oyetunji and 10 others.\nWhile the the secret police released others, the duo are still being held despite fulfilling their bail conditions."
  },
  {
    "headline": "Nigerian Customs Operatives Kill Youths Leader In Ogun While Extorting Motorcyclists",
    "summarized_story": "Operatives of the Nigerian Customs Service (NCS) have killed a youth leader identified as Tajudeen Adelanwa in Ibara Onile in the Abeokuta North Local Government Area of Ogun State.\nSaharaReporters gathered that Adelanwa was killed on Tuesday night by the operatives who were extorting motorcyclists around Ibara junction in the community.\nNarrating the incident, a witness said they were shocked when the customs officials started shooting sporadically.\nThe officials were shooting at a bike man who they were trying to extort.\nShe said the situation has become unbearable for people in the community as they can no longer continue to be losing innocent souls in the hands of Customs operatives."
  },
  {
    "headline": "Nigerian Customs Operatives Kill Youths Leader In Ogun While Extorting Motorcyclists",
    "summarized_story": "Operatives of the Nigerian Customs Service (NCS) have killed a youth leader identified as Tajudeen Adelanwa in Ibara Onile in the Abeokuta North Local Government Area of Ogun State.\nSaharaReporters gathered that Adelanwa was killed on Tuesday night by the operatives who were extorting motorcyclists around Ibara junction in the community.\nNarrating the incident, a witness said they were shocked when the customs officials started shooting sporadically.\nThe officials were shooting at a bike man who they were trying to extort.\nShe said the situation has become unbearable for people in the community as they can no longer continue to be losing innocent souls in the hands of Customs operatives."
  },
  {
    "headline": "BREAKING: Igboho's Aides: Armed Robbers Hijack Department Of State Services’ Case File, Says Lawyer",
    "summarized_story": "The Counsel for the Department of State Services has informed the Federal High Court, Abuja, that the case file relating to the Fundamental Human Rights Enforcement application filed by the aides to Sunday Adeyemo (Igboho) was stolen by armed robbers.\nAppearing before the court on Wednesday, the lawyer, I. Awo, told Justice Obiora Egwuatu that his colleague who was to bring the case file to court had boarded a vehicle belonging to armed robbers commonly known as ‘one chance.’According to him, his belongings including the case file were hijacked by the armed robbers.\nConsequently, he applied for an adjournment.\nSaharaReporters had reported that the 12 agitator's aides who were arrested and detained illegally by the secret police approached the court through their lawyer, Pelumi Olajengbesi, to seek for the enforcement of their fundamental rights."
  },
  {
    "headline": "Teenager 'stabs' husband to death in Adamawa — 'three weeks after forced marriage'",
    "summarized_story": "The police command in Adamawa state says its operatives arrested one Rumasau Muhammed, a 19-year-old woman, for allegedly stabbing one Muhammed Adamu, her husband, to death.\nAdvertisementAccording to the police, the suspect, who lives in Wuro Yanka village, Shelleng LGA, Adamawa, was married to the deceased on August 6, 2021 against her will.\nAfter some time, the 19-year-old asked for a divorce from the 35-year-old deceased which was rejected by him.\nThe police, on Wednesday, said the decision of the husband angered the suspect, who used a knife to stab the deceased on his stomach.\nAdvertisement“The Adamawa State Police Command, On 7/9/2021 apprehended a 19-year-old wife for stabbing her 35-year-old husband to death,” the statement, released by Suleiman Nguroje, police spokesman, reads."
  },
  {
    "headline": "Teenager 'stabs' husband to death in Adamawa — 'three weeks after forced marriage'",
    "summarized_story": "The police command in Adamawa state says its operatives arrested one Rumasau Muhammed, a 19-year-old woman, for allegedly stabbing one Muhammed Adamu, her husband, to death.\nAdvertisementAccording to the police, the suspect, who lives in Wuro Yanka village, Shelleng LGA, Adamawa, was married to the deceased on August 6, 2021 against her will.\nAfter some time, the 19-year-old asked for a divorce from the 35-year-old deceased which was rejected by him.\nThe police, on Wednesday, said the decision of the husband angered the suspect, who used a knife to stab the deceased on his stomach.\nAdvertisement“The Adamawa State Police Command, On 7/9/2021 apprehended a 19-year-old wife for stabbing her 35-year-old husband to death,” the statement, released by Suleiman Nguroje, police spokesman, reads."
  },
  {
    "headline": "DSS files terrorism charges against two Igboho supporters",
    "summarized_story": "The Department of State Services (DSS) has filed terrorism charges against two supporters of Sunday Adeyemo, better known as Sunday Igboho.\nThe suit was filed through the DSS lawyer, SM Bello.\nDSS operatives had, on July 1, raided Igboho’s residence in Oyo and arrested 12 of his supporters.\nBut the DSS filed an appeal challenging the bail granted to four out of the 12 persons.\nOn August 30, the DSS released eight of Igboho supporters."
  },
  {
    "headline": "DSS files terrorism charges against two Igboho supporters",
    "summarized_story": "The Department of State Services (DSS) has filed terrorism charges against two supporters of Sunday Adeyemo, better known as Sunday Igboho.\nThe suit was filed through the DSS lawyer, SM Bello.\nDSS operatives had, on July 1, raided Igboho’s residence in Oyo and arrested 12 of his supporters.\nBut the DSS filed an appeal challenging the bail granted to four out of the 12 persons.\nOn August 30, the DSS released eight of Igboho supporters."
  },
  {
    "headline": "EXTRA: Armed robbers stole DSS case file on Igboho supporters, says lawyer",
    "summarized_story": "Idowu Awo, counsel representing the Department of State Services (DSS), in a suit involving supporters of Sunday Igboho, has told a federal high court in Abuja that the case file was stolen by armed men.\nAdvertisementAddressing the court on Wednesday, Awo said his colleague who was to bring the case file to court had boarded a vehicle belonging to armed robbers commonly known as ”one chance”.\nAccording to him, his belongings including the case file were taken by the armed robbers.\nAdvertisementThe court session had been scheduled to hear a fundamental human right suit filed against the DSS by the 12 supporters.\nOn August 30, the DSS released eight of Igboho supporters."
  },
  {
    "headline": "How Wave became Francophone Africa’s first unicorn startup with \"radically affordable\" money transfers",
    "summarized_story": "Taking on incumbentsSenegal is one of Africa’s fastest-growing mobile money markets, according to a 2020 GSMA report.\nExpresso Telecom, a unit of the UAE’s Expresso Telecom Group Limited, holds 22% of the market share, with over 3 million subscribers.\nAll three telecom firms provide mobile money services under the Orange Money, Free Money, and E-Money brands respectively, and along with banks, dominate the digital financial services space.\nAccording to co-founder Drew Durbin, Wave is building a mobile money service that is “radically affordable”.\nThe startup’s low-cost transaction service has helped it take on incumbents, eat into their market share, and turn the entire mobile money industry on its head."
  },
  {
    "headline": "Access Bank records $73 million in e-business income",
    "summarized_story": "Nigeria’s Access Bank Group made ₦29.9 billion ($73 million) in income from its channels and E-business in the first half of 2021, a 37% increase compared to ₦21.8 billion ($53 million) in the same period in 2020.\nThe bank’s Channels and other E-business income include earnings from electronic channels, card products, and related services.\nThe E-business income contributed about 40.5% of earnings from fees and commission, which reached ₦73.7 billion in H1 2021, and about 7% of gross earnings.\nThe report, however, did not indicate any reason for the rise in earnings from electronic channels.\nThe H1 2021 financial report also shows a 31.21% rise in profit before tax to ₦97.50 billion ($238 million), from ₦74.31 billion ($181 million) in 2020."
  },
  {
    "headline": "With Awabah, Tunji Andrews wants to make pensions as popular as banking",
    "summarized_story": "Awabah Nigeria Co-founder, Tunji Andrews.\nThe micro pension scheme was formally introduced in 2019 but is yet to gain traction.\n“When I heard about the new micro pension scheme two years ago, I was excited as I had been thinking about pensions.\n“The bigger goal is to create a larger awareness of micro pensions in Africa,” Andrews said.\n“The lack of micro pension licenses can be a drawback as we believe we are best positioned to drive the product."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Nigeria’s private sector credit expansion struggles to catch up with peer South Africa",
    "summarized_story": "There is something to cheer in the news that the total lending to the private sector in Africa’s largest economy increased by just under 10 per cent in the year ending July to N33 trillion or about $8 billion.\nThis impressive increase follows an aggressive push by the Central Bank of Nigeria (CBN) to compel…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Reasons Nigeria’s tech hub is good real estate investment destination",
    "summarized_story": "For its central location and good investment yield, especially in rental income, Yaba, Nigeria’s technology hub, has become a good and an attractive real estate investment destination with opportunities.\nTo a cursory observer, Yaba, also fondly called Lagos Silicon Valley, is like many other parts of Nigeria’s sprawling commercial capital with a disharmony of car…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigeria’s 70% broadband target in 2025 is SA, Egypt’s reality today",
    "summarized_story": "Nigeria’s National Broadband Plan set a supposedly ambitious target for the country to attain 70 percent broadband penetration by 2025.\nHowever, African peers South Africa and Egypt currently record 113 percent and 74 percent penetration rates respectively, according to data from the International Telecommunication Union (ITU).\nBroadband penetration in Nigeria has been on a freefall…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Obaseki, Onu seek synergy among varsities, research institutions, others to drive nation’s growth, devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki and the Minister of Science, Technology and Innovation, Dr. Ogbonnaya Onu have tasked universities and research institutions to work in synergy in pursuit of the country’s economic prosperity and technological advancement.\nThe duo made the call when the minister paid the governor a courtesy visit at the Government House in Benin City, the Edo State capital.\n“What you have started is the right way to go and we have no choice, but execution is the issue.\nThere is nothing new in this country, but everything said has been written and researched over again.\n“We will no longer allow all these centres of knowledge to work independently, but rather start working together to enable them to carry out good research that will solve the nation’s problems."
  },
  {
    "headline": "COVID-19 3rd wave: Death toll climbs to 26, as four more unvaccinated persons die in Edo – Nigerian Observer",
    "summarized_story": "Head of the state’s COVID-19 Case Management, Dr. Ebomwonyi Osagie, disclosed this on Tuesday during a press briefing at the Government House in Benin City.\n“Over the weekend, we collected a total of 1,273 samples and confirmed 148 cases, four recoveries, and four deaths.\nYou must complete the vaccination; you can’t take one dose and say it is enough but need to complete the dose which protects you from the virus.\nI urge Edo citizens to please show up for their second dose as there is enough for them.\n“Many persons carrying the virus are not down with sickness and don’t have symptoms but yet transmit the virus to people."
  },
  {
    "headline": "Assailants invade police barracks, killed businessman in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- Assailants have murdered a businessman in Ogida Police Barracks in Benin City.\nThe spokesman for the command SP Kontongs Bello stated this while confirming the unfortunate incident to our reporter yesterday.\nHe added that the body of the deceased has been deposited in a mortuary in Benin City.\nSP Kontongs assured residents and occupants of the barracks and its neighbourhood of adequate protection of lives and property.\nBlood stains littered the floor when our reporter visited the shop located about 50 metres away from the Superintendent of Police Officers (SPOs) blocks in the barracks."
  },
  {
    "headline": "Schneider Electric Is World’s Most Sustainable Company – Corporate Knights – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – Foremost digital transformation of energy management and automation company, Schneider Electric, has been ranked the world’s most sustainable corporation by Toronto based company, Corporate Knights , a media and research company with focus on corporates sustainability performance.\n“We are honoured and grateful to be ranked number one by Corporate Knights.\nThis recognition goes also to all of them.”According to Corporate Knights, Schneider Electric has helped customers manage their energy needs more efficiently and safely.\nCorporate Knights’ 2021 ranking was based on an assessment of 8,080 companies with more than US$1 billion in revenues.\n“If you look back at the last 30 years, particularly between 1989, to 2007, there was no major investment in the power sector."
  },
  {
    "headline": "UPDATED: Again INEC, NASS bicker over electronic transmission of election results",
    "summarized_story": "ADVERTISEMENTThe Independent National Electoral Commission (INEC) and the National Assembly on Tuesday countered each other over the electronic transmission of election results.\nYou cannot ask INEC to seek the approval of another agency of government to transmit results electronically when actually INEC has power to impose duties on NCC to achieve electronic transmission of results.\nBefore proceeding on recess in July, the National Assembly, while voting on the amendment to the Electoral Act, rejected the section on electronic transmission of election results by INEC, saying the country was not ready for such.\nPREMIUM TIMES also reported how the NCC misled the lawmakers into believing that the country was not technologically prepared for electronic transmission of election results.\nOn its part, the APC, which controls both chambers of the National Assembly, has been evasive on taking a formal stance on INEC’s position on electronic transmission of results."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Osun 2022: PDP welcomes Ademola Adeleke, describes him as a man on divine purpose",
    "summarized_story": "The rally which took place at the state secretariat of the party, Biket junction, Osogbo/Ikinrun Road, witnessed mamoth crowd of the party faithful.\nBisi appluaded the former Senator for towing a line of self development and concentrating on having better political future rather than been pessimistic.\nWe are covinced that you are a man on divine purpose.\nHe appraised their resilience and relentless effort in building the party, adding that he’s coming back home would be used to unify the party.\nHe, however, condemned in totality, attack on the party secretariat by some hoodlums, calling for crisis free political atmosphere."
  },
  {
    "headline": "Nigerian govt plans four million jobs for youth, women",
    "summarized_story": "Nigeria’s federal government through the Federal Ministry of Special Duties and lnter-Governmental Affairs on Tuesday said it had concluded plans to organise a Partnership Economy Summit aimed at diversifying the economy, promote rural growth as well as generate jobs for the youth.\nThe minister who was represented by the permanent secretary, Ambassador Anthonia Ekpa, said the summit would help generate four million jobs for youths and women across the country.\n“As we are all aware, the COVID-19 pandemic has impacted negatively on the world economy, including Nigeria, which has worsened the already precarious un-employment situation,” he said.\n“It is therefore in recognition of this position and the ministry’s mandate to coordinate multi-agency and inter-ministry functions as designated by Mr President as well as actively collaborate with the private sector to create employment for a large number of Nigerian youths that the up-coming Partnership Economy Summit is being planned.\n“It is pertinent to state that the primary purpose of the summit is to diversify the economy, promote rural growth as well as generate sustainable jobs for youths.”He added that it sought not only to eradicate extreme poverty but also to integrate and balance the three dimensions of sustainable development, economic, social as well as environmental"
  },
  {
    "headline": "Nigeria signs MoU with Arab Chamber of Commerce to boost trade relations",
    "summarized_story": "Nigeria’s federal government has signed a memorandum of understanding (MoU) with the Arab Chamber of Commerce to facilitate collaboration for the upcoming Expo 2020 Dubai.\nDirector of the press and public relations department at the ministry of industry, trade and investment, Ibrahim Haruna, stated this in a statement on Tuesday.\nHe quoted Niyi Adebayo, minister of industry, trade and investment to have explained that the MoU was not limited to the area of trade forum alone.\nAdebayo, represented by Danjuma Alhassan, legal director of his ministry, said the agreement would strengthen business relationships and promote enhanced trade relations between Nigeria and Gulf countries.\n“To boost business opportunities and funding of the upcoming Expo 2020 Dubai, the agreement would formalise a collaborative business relationship between the ministry and Nigerian Arabian Gulf Chamber of Commerce,” Adebayo said."
  },
  {
    "headline": "Nigerians spend N601.51bn on importation of vehicles in H1 2021",
    "summarized_story": "Figures in the foreign trade report published by Nigeria’s National Bureau of Statistics (NBS) show that Nigerians spent a total of N601.51 billion on the importation of motor vehicles in the first half of the year.\nThe figure represents a 15% increase compared to N523.57 billion recorded in the same period of 2020.\nVehicle imports accounted for 4.4% of total imports of N13.8 trillion recorded in the period under review.\nGoing further, in the second quarter of 2021, imports of passenger cars grew by 14.03% to N311.63 billion compared to the corresponding quarter of 2020 where imports for the same item stood at N273.28 billion.\nOver the past three years, Nigeria has steadily increased its import of vehicles by 195% from N371.98 billion in 2018 to N1.09 trillion in 2020."
  },
  {
    "headline": "Court Admits Video Clips As Exhibit On Alleged Invasion Of Igboho’s House",
    "summarized_story": "According to reports gathered from NAN, a High Court in Ibadan on Tuesday admitted as exhibit video clips of alleged invasion by the Department of State Services (DSS) on the residence of Sunday Adeyemo, a.k.a Sunday Igboho, on July 1.\nADVERTISEMENTAlliyu had earlier informed the court that his client’s house and cars were damaged and that two people were allegedly killed by security agents during the invasion.\nAt Tuesday’s hearing, Justice Ladiran Akintola, admitted the exhibit after listening to Alliyu’s submission on the originating summons filed before the court.\nThe court ordered the two video clips to be played in the open court as requested by Igboho’s counsel and DSS counsel.\nAddressing the court after playing the two video clips in the court, AGF counsel, Abdullah Abubakar, said that there was no evidence before the court that the blood seen in the video tendered by Alliyu belongs to a human being."
  },
  {
    "headline": "Court Admits Video Clips As Exhibit On Alleged Invasion Of Igboho’s House",
    "summarized_story": "According to reports gathered from NAN, a High Court in Ibadan on Tuesday admitted as exhibit video clips of alleged invasion by the Department of State Services (DSS) on the residence of Sunday Adeyemo, a.k.a Sunday Igboho, on July 1.\nADVERTISEMENTAlliyu had earlier informed the court that his client’s house and cars were damaged and that two people were allegedly killed by security agents during the invasion.\nAt Tuesday’s hearing, Justice Ladiran Akintola, admitted the exhibit after listening to Alliyu’s submission on the originating summons filed before the court.\nThe court ordered the two video clips to be played in the open court as requested by Igboho’s counsel and DSS counsel.\nAddressing the court after playing the two video clips in the court, AGF counsel, Abdullah Abubakar, said that there was no evidence before the court that the blood seen in the video tendered by Alliyu belongs to a human being."
  },
  {
    "headline": "Wayya To Deepen Financial Inclusion In Nigeria",
    "summarized_story": "The company intends toleverage its deep experience in providing various services to those outside the banking systemto drive its financial inclusion initiative.\nADVERTISEMENTAccording to Faiz Imam, “Ibelieve in Wayya’s capacity to provide the financial technology service solutions required to address the challenges of financial exclusion in Nigeria, particularly in rural areas where access to financial services is almost non-existent.\nWayya is committed to meeting the financial service needs of these critical demographics and by extension helping to achieve the objectives set out in the National Financial Inclusion Strategy (NFIS) formulated by the Central Bank of Nigeria (CBN).\nThe Wayya platform is designed to help customers with ease of cash deposit, withdrawals, bill paymentsand airtime purchase, etc.\nWith a strong agent network across Northern Nigeria, Wayya has leveraged its vast local knowledge and deep understanding of the informal sector in coming up with unique solutions that are tailored towards addressing the challenges of financial exclusion"
  },
  {
    "headline": "Wayya To Deepen Financial Inclusion In Nigeria",
    "summarized_story": "The company intends toleverage its deep experience in providing various services to those outside the banking systemto drive its financial inclusion initiative.\nADVERTISEMENTAccording to Faiz Imam, “Ibelieve in Wayya’s capacity to provide the financial technology service solutions required to address the challenges of financial exclusion in Nigeria, particularly in rural areas where access to financial services is almost non-existent.\nWayya is committed to meeting the financial service needs of these critical demographics and by extension helping to achieve the objectives set out in the National Financial Inclusion Strategy (NFIS) formulated by the Central Bank of Nigeria (CBN).\nThe Wayya platform is designed to help customers with ease of cash deposit, withdrawals, bill paymentsand airtime purchase, etc.\nWith a strong agent network across Northern Nigeria, Wayya has leveraged its vast local knowledge and deep understanding of the informal sector in coming up with unique solutions that are tailored towards addressing the challenges of financial exclusion"
  },
  {
    "headline": "Strike: Federal Govt, JOHESU Reach Truce – Ngige",
    "summarized_story": "The Federal Government says it has reached a truce with aggrieved health workers of the Joint Health Sector Unions (JOHESU) and assembly of healthcare professions.\nAccording to him, this includes the enhancement of hazard allowance, review of retirement age from 60 to 65 years, the arrears of the consequential adjustment of the national minimum wage.\n”On the other hand, government is meeting with NMA next week for their separate discussion on hazard allowance.\nThe government is not delaying the hazard allowance as some people want the public to believe.\nHe added that JOHESU will meet with the Federal Ministry of Health on Thursday to draw up a framework for all the discussions to start."
  },
  {
    "headline": "Akeredolu begs FG: Act fast, Nigerians living in fear",
    "summarized_story": "Disturbed by the rising wave of insecurity, Governor Akeredolu lamented yesterday that Nigerians were living in fear, following the unending insecurity across the country, and called on President Muhammadu Buhari to immediately rise to the occasion.\nHe spoke as Katsina State governor Aminu Bekko Masari, on Monday night, expressed regret over the amnesty he granted bandits in his state a few years ago.\n“To achieve Nigeria’s goals for science and technological advancement, the country must be made conducive for living, particularly for the young ones.\nThe governor described FUTA as one of the leading universities in the country, particularly in terms of research.\nService chiefs and the intelligence chiefs have been able to brief the President on the security situation of the country."
  },
  {
    "headline": "Akeredolu begs FG: Act fast, Nigerians living in fear",
    "summarized_story": "Disturbed by the rising wave of insecurity, Governor Akeredolu lamented yesterday that Nigerians were living in fear, following the unending insecurity across the country, and called on President Muhammadu Buhari to immediately rise to the occasion.\nHe spoke as Katsina State governor Aminu Bekko Masari, on Monday night, expressed regret over the amnesty he granted bandits in his state a few years ago.\n“To achieve Nigeria’s goals for science and technological advancement, the country must be made conducive for living, particularly for the young ones.\nThe governor described FUTA as one of the leading universities in the country, particularly in terms of research.\nService chiefs and the intelligence chiefs have been able to brief the President on the security situation of the country."
  },
  {
    "headline": "National Assembly battles INEC as commission insists on electronic results",
    "summarized_story": "THE Independent National Electoral Commission on Tuesday said it did not need the approval of the Nigerian Communications Commission to transmit election results electronically.\nThis was as the National Assembly told the Chairman of the Independent National Electoral Commission, Mahmood Yakubu, to seek proper legal advice instead of misinforming Nigerians on the independence of INEC to conduct elections.\nINEC also said that the decision of the National Assembly to subject its constitutional power to conduct elections to the NCC was absolutely unconstitutional.\nHe (INEC chairman) should not muddle the independence of INEC with that of its agency’s operations, as to the legislative competence of the National Assembly to stipulate framework for elections.\n“The INEC chairman does not seem to know the position of the law as to the constitutional power of INEC vis a vis the National Assembly from what he said."
  },
  {
    "headline": "National Assembly battles INEC as commission insists on electronic results",
    "summarized_story": "THE Independent National Electoral Commission on Tuesday said it did not need the approval of the Nigerian Communications Commission to transmit election results electronically.\nThis was as the National Assembly told the Chairman of the Independent National Electoral Commission, Mahmood Yakubu, to seek proper legal advice instead of misinforming Nigerians on the independence of INEC to conduct elections.\nINEC also said that the decision of the National Assembly to subject its constitutional power to conduct elections to the NCC was absolutely unconstitutional.\nHe (INEC chairman) should not muddle the independence of INEC with that of its agency’s operations, as to the legislative competence of the National Assembly to stipulate framework for elections.\n“The INEC chairman does not seem to know the position of the law as to the constitutional power of INEC vis a vis the National Assembly from what he said."
  },
  {
    "headline": "Updated: Many Zamfara bandits, ringleader arrested in intense military raids [Photos]",
    "summarized_story": "By Kazeem UgbodagaNigerian troops are overrunning bandits in Zamfara State with massive bombardment.\nLarge number of weapons were also recovered from the bandits.\nZamfara, Katsina and Niger State have been the playground of bandits in the country, as the criminals captured residents at will and demand ransom to set them free.\nOver 1000 school children have been captured by the bandits in the quest to demand ransom.\nHowever, many of the students have been released by the bandits after collecting the ransom."
  },
  {
    "headline": "Borno moves to restock Maiduguri Zoo",
    "summarized_story": "By Razak OwolabiThe Borno State Government said it has initiated a process to restock the Sanda Kyarimi Zoo in Maiduguri, to encourage zoological development and attract visitors.\nAccording to Jidiayi, the management of the zoo also has an animal exchange agreement with Audu Bako Zoo in Kano, which is permissible under zoo keeping laws.\nHe alleged that most of the personnel managing the zoo and wildlife parks in the country were neither zoologists nor professionals.\nBala said that poor orientation, lack of private zoo practitioners and obsolete facilities were some of the bane of zoological parks in the country.\n“The only zoo that exists near us is the Sanda Kyarimi Zoo in Maiduguri."
  },
  {
    "headline": "BREAKING: Igboho Aides: Armed Robbers Hijack DSS Case File In Abuja",
    "summarized_story": "The case file containing the fundamental human rights enforcement application filed by aides to the besieged Yoruba activist, Sunday Adeyemo, alias Sunday Igboho, was taken by armed thieves in the nation’s capital, according to Barrister I. Awo, counsel for the Department of State Service, DSS.\nRecall that the DSS had, during a midnight invasion of Igboho’s Soka house in Ibadan, the Oyo State capital, arrested 12 of the activist’s allies and detained them in Abuja.\nThe detained aides had approached the court to seek their fundamental rights to freedom from the custody of the DSS.\nEgwuatu, during a sitting on August 4, 2021, granted bail to the 12 detainees.\nHowever, they are still in the custody of the secret police."
  },
  {
    "headline": "BREAKING: Two Ex-Governors, Tinubu Meet In London [PHOTO]",
    "summarized_story": "Alhaji Abdulaziz Yari, a former Zamfara State governor and former Sokoto State governor, Senator Aliyu Magatakarda Wamakko, have paid a visit to Bola Tinubu in London.\nThe meeting is believed to wish Mr. Tinubu a quick recovery.\nMr. Tinubu, a former governor of Lagos State, has been in London since July amidst rumors that he is ill.Several other politicians including the ex-Ogun state governor, Ibikunle Amosun, Members of the Lagos state house of Assembly, Lagos state governors, Babajide Sawnwo-Olu have all paid visits to Mr. Tinubu in London.\nFemi Gbajabiamila, also made his way to Central London to visit his political godfather, Tinubu.\nThe delegation of the highest decision-making body in Lagos State, the Governor Advisory Council (GAC) also visited TinubuIn a surprise move, President Muhammadu Buhari also visited the former governor, just before he departed London for Lagos"
  },
  {
    "headline": "Leaked audio: Why Sunday Igboho was angry with me -Lawyer",
    "summarized_story": "Ibrahim Salami, one of the Cotonou, Benin Republic-based lawyers of Yoruba Nation agitator, Sunday Adeyemo, aka Sunday Igboho, has faulted leaked audio where the activist faulted his legal team.\nIn leaked audio obtained by The PUNCH and confirmed by multiple sources, Igboho alleged that he was abandoned by lawyers who collected a huge amount of money from him in Benin.\nSalami explained that the leaked audio is dangerous for the justice being pursued on behalf of Igboho.\nAccording to him, Igboho was angry with him and other members of the legal team because he felt he had no reason to remain in police detention.\n“He has a right to be angry,” the lawyer added."
  },
  {
    "headline": "Sheikh Gumi asks Fulanis to get voters card ahead of 2023",
    "summarized_story": "Islamic cleric Sheikh Abubakar Gumi, has called on Fulani ethnic group to ensure they register and obtain voter cards ahead of the 2023 general elections in the country, so they can elect leaders who would provide good governance and protect their interests.\nThe Islamic cleric said this while presenting animals and foodstuffs to the families of Fulani that were affected by insecurity and the COVID-19 pandemic, organized by a pastoral group under the aegis of Bilital Marroobe Pastoralists Association of Nigeria (BILMPAN) in Kaduna.\nGumi who cautioned herdsmen, particularly those living in the forests against banditry and kidnapping, stated that their bloc votes is very important in the emergence of any credible leader in Kaduna as well as in the country.\nHe said;“If we want our votes to matter and make a difference, we must work towards bloc voting in the next election.\nWe should be ready to work as a team to succeed.”"
  },
  {
    "headline": "VIDEO: How Super Eagles skipper, Ahmed Musa, celebrated 100th international cap",
    "summarized_story": ""
  },
  {
    "headline": "BBNaija: Tega reunites, kisses husband (Video)",
    "summarized_story": "BBNaija’s evicted housemate, Tega has finally reunited with her husband, Adejoh, after her eviction from the reality TV show.\nTega and her hubby met for the first time since her eviction, Tuesday, September 7, 2021.\nThe couple were all loved up as they reunited after weeks apart.\nThe married housemate incurred the wrath of fans of the show after getting intimate with actor housemate, Boma.\nFollowing her eviction, the actress revealed that their moments caught on camera were simply a strategy to keep viewers entertained."
  },
  {
    "headline": "Breaking: Lalong further relaxes curfew in Jos, lifts ban on tricycles",
    "summarized_story": "Governor Simon Lalong of Plateau state has further relaxed the curfew imposed on Jos North in the aftermath of crisis that erupted in area.\nAccording to the governor, from now residents are free to move from 6am to 10pm.\nThe governor also lifted the ban on tricycles, to now operate from 6am to 6pm daily.\nFresh crisis erupted around Jos days after some travellers heading to Ondo state from Bauchi state were attacked.\nHowever, peace and calm have gradually returned to the troubled areas in the past few days."
  },
  {
    "headline": "PFN urges Christians to leverage on electronic process",
    "summarized_story": "The Pentecostal Fellowship of Nigeria (PFN) has called on Christians to take advantage of the electronic voting system introduced by Independent National Electoral Commission to elect credible members to power.\nThe PFN Chairman South-South, Apostle Zilly Aggrey of Royal House of Grace made the call at the Social Security Outreach program, at Greater Evangelism worldwide Crusade, Opolo Yenagoa.\nHe said, “the christians should take advantage of having a voters card, most especially now, they have started electronic registration of voters card, and INEC came to explain point by point how our people can access the site and the form is registration.\nI want to appreciate the INEC for this initiative."
  },
  {
    "headline": "Fulani group dares southern governors, says anti opening grazing law satanic – NigPilot",
    "summarized_story": "Fulani socio-cultural group, Miyetti Allah Kautal Hore has described the anti-opening grazing law as satanic and a unanimous decision of southern governors to destroy pastoralists means of livelihood.\nMiyetti Allah group disclosed this in Masaka community, Abuja suburb on Monday at a press briefing, jointly delivered by its national president, Alh.\nHe further called for proper funding of the National Commission for Nomadic Education and the expansion of its mandate.\n“This oppressive laws and hostile policies being enacted by state governors are fundamentally going against the Fulani Pastoralist culture, economic interest and constitutional rights.\n“To this effect any action taken by any state Assembly that is in conflict with an above section of the 1999 Constitution as amended is null and void."
  },
  {
    "headline": "NITDA graduates 200 kids in emerging technologies – NigPilot",
    "summarized_story": "National Information Technology Development Agency, NITDA has graduated 200 kids from its Science, Technology, Engineering and Mathematics (STEM) Boot Camp for Kids (SB4KIDS) 2021 edition to further ensure that Nigeria becomes a digitally proficient economy.\nKashifu said NITDA had through its National Centre for Artificial Intelligence and Robotics (NCAIR) embarked on a two weeks training for kids on STEM Education, which is a yearly initiative, normally conducted during the summer school holidays.\n‘‘We at NITDA believe that the early involvement of youngsters in technology and innovation will accelerate the development of the technology sector and create future technology leaders who will transform the Nigerian technology space and boost the Nigerian Digital Economy.\nThe first three (3) from each batch will receive a laptop, while all the twenty (20) selected winners will receive a STEM kit that will help them with their STEM education journeys.\nNigPilot, Daily Nigerian Newspaper, Nigerian News Update, Nigerian News Headlines, Nigerian Pilot Newspaper Online,"
  },
  {
    "headline": "Katsina Banditry: 19 LGA flashpoints identified as phone charging business outlets suspended – NigPilot",
    "summarized_story": "AS part of continuous measures in tackling insecurity, Governor Aminu Bello Masari of Katsina State has an Executive order No 4, announced the suspension of business outlets engaging in phone charging business in the banditry prone areas of the state.\nHe also identified Nineteen, 19, local government areas as bandit’s flashpoints.\nThe Governor made this known while inaugurating the committee on Monitoring and Enforcement of the Security Challenges (Containment) Order today, Monday.\nThe Nineteen local government areas that were identified by Governor Masari as the flashpoint areas are where the committee is expected to beam their searchlight.\nThe Katsina State Commissioner of Police, CP Sanusi Buba is the Chairman while the Secretary to the State Government, Mustapha Inuwa will serve as secretary of the committee respectively."
  },
  {
    "headline": "Plateau Govt Further Relaxes Curfew In Jos North, Lifts Ban On Tricycles",
    "summarized_story": "The Plateau State government has announced a further relaxation of curfew in Jos North Local Government Area.\n“Beginning from Wednesday, 8th September 2021, the curfew in Jos North will be enforced from 10pm to 6am,” the statement said.\n“This will tally with the current status of the curfew in Jos South and Bassa Local Government Areas which still remains from 10pm to 6am.\n“Similarly, Governor Lalong also approved that beginning from Wednesday, 8th September 2021, the ban placed on operations of tricycles will be lifted from 6am to 6pm daily.\nGovernor Lalong explained that the modules would be unveiled in due course."
  },
  {
    "headline": "17 More People Die As Nigeria Records 597 New COVID-19 Cases",
    "summarized_story": "More people have lost the fight to COVID-19 in Nigeria with authorities reporting 17 new deaths on Tuesday.\nThe Nigeria Centre for Disease Control (NCDC) confirmed this in a late-night update on the outbreak of the disease in the country.\nLagos recorded the highest number of fresh infections on Tuesday – 204 and was followed by Rivers, Edo, and FCT where 89, 65, and 50 fresh cases were confirmed respectively.\n“Today’s (Tuesday) report includes zero cases from Abia, Nasarawa, Ondo, and Sokoto States,” the agency said in a post on Facebook.\nAs a result of the new cases, Nigeria has now confirmed 196,487 infections, and 185,159 people have been successfully treated."
  },
  {
    "headline": "Find Tactics To Solve Security Challenge, Buhari Tells Service Chiefs",
    "summarized_story": "﻿President Muhammadu Buhari has directed security chiefs to find tactics to solve the security challenges in the country, particularly in the North-West and North Central.\nThe President issued the directive on Tuesday, during a three-hour security meeting with Service Chiefs at the Presidential Villa in Abuja.\nHe reiterated the urgent need to deal with the bandits, who according to the security chiefs, are becoming a nuisance, killing and making reckless pronouncements to solicit attention.\nThe security meeting was chaired by the President with the service chiefs physically in attendance.\nThe Service Chiefs were led by the Chief of Defence Staff, General Lucky Irabor; Minister of Defence, General Bashir Magashi (rtd)."
  },
  {
    "headline": "Dealing With Bandits Easier Since Telecom Services Shutdown, Says Zamfara Commissioner",
    "summarized_story": "﻿The Zamfara State Commissioner for Information in Zamfara State, Ibrahim Dosara, says the military onslaught against the bandits is yielding tremendous success especially since the shutdown of telecoms services in the state.\n“Zamfara State Government in efforts to ensure the crashing of the bandits has requested for the closing down of all networks in the state and this has been effective,” he said.\nSpeaking further, the Commissioner said other measures have also been taken based on credible information and intelligence available to the government.\n“These include the immediate closure of the following places suspected to be habouring bandits and their collaborators,” Dosara said.\nThe abduction occurred 11 days after students abducted from the College of Agriculture in Bakura, Zamfara, regained freedom."
  },
  {
    "headline": "India Restricts Religious Festivals Over New COVID-19 Surge Fears",
    "summarized_story": "Indian authorities are restricting major religious festivals that start this week and attract huge crowds, warning that a new Covid-19 wave had already begun in the financial capital Mumbai.\nIt struck after one of the world’s biggest religious gatherings, the Kumbh Mela, which attracted some 25 million Hindu pilgrims.\nThat gathering, large state election rallies and the infectious Delta virus variant — first detected in India — were blamed by experts for fuelling the surge.\nAuthorities said a recent spike in cases in the southern state of Kerala after the Onam festival in August should be cause for alarm.\nThe southern state of Tamil Nadu has banned public festival celebrations, while the eastern state of West Bengal was expected to impose curbs on the nine-day Durga Puja in October."
  },
  {
    "headline": "Ogun commences four months free business registration",
    "summarized_story": "Ogun State Government has launched Business Premises Registration Portal just as it has also commenced free registration of businesses on the Portal till December 31, 2021.\nOgun State Governor, Dapo Abiodun while speaking during the virtual launch at Ogun TechHub, Kobape Road, Abeokuta, said it became imperative due to formulation of different reforms and digitisation of business registration process.\nRepresented by the Chairman, State Business Environment Council, who doubles as the Commissioner for Finance, Dapo Okubadejo, Governor Abiodun disclosed that the Business Premises Registration Portal would serve as an avenue to plan for infrastructure, security, power, management of the environment and other facilities for businesses to thrive in the State.\nOn her part, Commissioner for Industry, Trade and Investment, Kikelomo Longe said with the launch of the Portal, the State business registration process would be fully automated, easier and reduce cost,"
  },
  {
    "headline": "Saudi Arabia has been kind to us, says President Buhari",
    "summarized_story": "President Muhammadu Buhari on Tuesday played host to the Saudi Arabian Minister of Foreign Affairs at State House, Abuja, declaring that the oil rich kingdom has been quite kind to Nigeria.\nReceiving Prince Faisal Bin Farhan Al-Saud, the President said with Nigeria’s large population and infrastructural deficit, the country needed all the revenue she could get from oil, a mainstay of the economy, “and Saudi Arabia has been very kind to us, making sacrifice by reducing production to accommodate us a number of times.”President Buhari noted that the relationship between the two countries is very strong, “and dates back in time, both at the personal and national levels.”“It is long and steadfast,” the President added.\nPrince Al-Saud brought greetings from King Salman bin Abdulaziz Al-Saud, saying the Kingdom appreciates the relationship with Nigeria, “which dates back 61 years, and we want to strengthen it even further.”The two countries, he said, have good prospects both economically and politically, not just among the leaders, but also the people.\n“There’s still a lot we can do together,” the Prince submitted."
  },
  {
    "headline": "NPFL Super 8 Tournament kicks off in Enugu",
    "summarized_story": "The Curtain raiser in the Nigerian Professional Football League Super 8 Club tournament in Enugu between Gombe United and Elkanemi Warriors has ended in a 1-1 draw.\nThe Second match between Bendel Insurance and Shooting stars of Ibadan is currently underway.\nThe super 8 match is a division 2 mini league tournament to determine who progresses to the Premier League comprising of 8 teams, Grouped into two groups of 4 teams each.\nGroup A is for the Northern teams while the Other group comprises of 4 teams from the Southern part of the Country.\nThe top two teams from each group will be promoted to the top division of the premier league."
  },
  {
    "headline": "Just In: PDP Chieftain, Ademola Adeleke arrives Osogbo",
    "summarized_story": "The Governorship candidate of the People’s Democratic Party in the 2018 Governorship election in Osun State, Ademola Adeleke has arrived Osun State.\nAdemola Adeleke had left the State for the United States of America more than two years ago after he had lost the election to Governor Adegboyega Oyetola.\nHe was welcomed by thousands of party faithful at the Airport in Ibadan, Oyo State on Tuesday.\nHe is expected to begin consultation on his gubernatorial ambition ahead of 2022."
  },
  {
    "headline": "Mexico’s Top Court Decriminalises Abortion in ‘Watershed Moment’",
    "summarized_story": "Mexico’s Supreme Court unanimously ruled on Tuesday that penalizing abortion is unconstitutional, a major victory for advocates of women’s health and human rights, just as parts of the United States enact tougher laws against the practice.\nArturo Zaldivar, president of the Mexican Supreme Court, hailed the decision as “a watershed moment” for all women, especially the most vulnerable.\nHundreds of mostly poor Mexican women have been prosecuted for abortion, while at least several dozen remain jailed.\nIn July, the state of Veracruz became just the fourth of Mexico’s 32 regions to decriminalize abortion.\nWhen asked at a news conference for his opinion on abortion, he sidestepped the question, saying it was up to the court."
  },
  {
    "headline": "Mali’s Progress Towards February Polls Insufficient, ECOWAS Warns",
    "summarized_story": "West Africa’s main regional bloc says it is concerned Mali’s transitional government has not made sufficient progress towards organising elections early next year, as agreed after a military coup last year.\nThe announcement came at the end of a three-day mission to Mali led by former Nigerian President Goodluck Jonathan.\nAfter the coup, Mali’s military leaders agreed, under pressure from ECOWAS, to an 18-month transition, culminating in presidential and legislative elections in February 2022.\n“The mission recalled the importance of respecting the date of the announced elections in order to demonstrate the credibility of the transition process,” said the ECOWAS statement, which was read out to journalists in Mali’s capital, Bamako.\nMali’s government has said it is conscious of its commitment to the electoral deadline, but some officials have also suggested it might not be respected."
  },
  {
    "headline": "‘Only God Will Take Me Out of Brasilia’: Defiant Bolsonaro Talks Tough",
    "summarized_story": "In recent months, the Supreme Court has authorised investigations into Bolsonaro and his allies for alleged attacks on Brazil’s democratic institutions.\n“They release bandits [from prison] and arrest conservatives,” hospital worker Carlos Alberto Juliao, 45, who attended a pro-Bolsonaro demonstration in Sao Paulo, said of the court.\n“Only God will take me out of Brasilia,” he told a crowd of 114,000 supporters on Sao Paulo’s Paulista Avenue on Tuesday afternoon, according to local military police estimates.\nIn the end, however, unrest was mostly restricted to some Bolsonaro supporters trying to breach police barricades in the capital Brasilia before being driven back with pepper spray.\nTurnout, while not small, also was lower than had been expected in Sao Paulo and Brasilia."
  },
  {
    "headline": "Teenager Leylah Fernandez Beats Elina Svitolina to Reach US Open Semi-finals",
    "summarized_story": "Teenager Leylah Fernandez produced another fearless performance to beat Elina Svitolina and set up a US Open semi-final with Aryna Sabalenka.\nFernandez has beaten defending champion Naomi Osaka, 2016 winner Angelique Kerber and now Olympic bronze medallist Svitolina in her run to her first major semi-final.\nShe has done it by trusting in her game and her big-hitting weapons, finishing with 42 winners against Svitolina.\nAn Olympic bronze medallist in Tokyo, Svitolina was slow to adjust her game, but she mixed defence with offence better in the third to finally break the Fernandez serve.\nAgain, Fernandez hit her way out of trouble, choosing her shots carefully and outmanoeuvring Svitolina at the net."
  },
  {
    "headline": "Nigeria: Katsina Governor Masari Admits Error Negotiating with Bandits, to Ban Open Grazing",
    "summarized_story": "Governor of Katsina State in Nigeria’s northwest, Aminu Masari, has said with the benefit of hindsight, his government should never have negotiated with bandits, let alone grant them amnesty.\nConsequently, based on current understanding of the situation, the governor said he has set in motion plans to proscribe open grazing of cattle in the state.\nThe governor of the North-west state also identified informants as the greatest challenge to the fight against insecurity in that part of the country.\nBaba said the president had directed all security agencies in the country to ensure immediate end to the situation.\n“I think it is our responsibility in Katsina and northern Nigeria to be determined to end this,” he said."
  }
]