[
  {
    "headline": "Twitter ban, provocative, shows intolerance –Reps minority caucus",
    "summarized_story": "The minority caucus in the House of Representatives has condemned “in its entirety,” the suspension of Twitter in Nigeria by the Federal Government, describing it as a clear violation of freedom of speech and other democratic rights and tenets as provided by the 1999 constitution.\nIt further shows the All Progressives Congress-led administration as one that is unwilling to listen to Nigerians but ready to use any means to suppress and subjugate its citizens.\n“The minority caucus is disturbed that the suspension of Twitter in the country came after the social media platform deleted President Muhammadu Buhari’s tweets.\nSuch response by the Federal Government has raised further concerns over the APC-led administration’s disturbing rating on issues of political intolerance, abuse of rights and violation of rules in our country.\n“The minority caucus cautions that the development is capable of leading to further restiveness among Nigerians and worsen the situation in the country."
  },
  {
    "headline": "BREAKING: Protest in Abuja as northern group demands referendum",
    "summarized_story": "A group of women under the aegis of the Amalgamation of Northern Women Associations, on Saturday, demanded a referendum to allow Biafran agitators to chose whether or not to remain in Nigeria.\nThe coordinator of the group, Hadiza Adamu, spoke on behalf of other members, during a protest in Abuja, on Saturday.\nShe said, “Nigerian History has shown that women carry the heavy burden of war and acts of insurrections and terrorism.\n“The aftermath of the war and the sufferings left lifetime scars in our hearts and on our bodies.\nIt is for this reason that we (have) come together today and say we don’t want another war, another insurrection."
  },
  {
    "headline": "Kaduna spends N211m monthly on refuse evacuation — Commissioner",
    "summarized_story": "Executive Governor of Kaduna State, Nasir El-rufaiThe Kaduna State Government says it spends N211 million monthly on refuse evacuation across the three metropolitan cities in the state.\nAccording to him, Kaduna state which hosts the third-largest city in the country generates huge refuse due to an increase in population and indiscriminate disposal.\nIbrahim added that the state government engaged the services of refuse contractors to ensure proper evacuation of refuse across the state.\nHe urged residents to assist the state government in its quest to keep the environment clean and safe.\nHe also urged residents to take ownership of the exercise by informing government whenever refuse were not promptly evacuated."
  },
  {
    "headline": "Nigerian Twitter users shift to VPN",
    "summarized_story": "By Emmanuel ElebekeFollowing the prompt suspension of Twitter operations in Nigeria yesterday, Nigerian Twitter enthusiasts have refused to be gagged by the government decision as they have shifted to VPN option.\nVanguard investigation revealed that in less than 12 hours the ban was announced, Nigerian Twitter users started exploring possible options to keep their communication flow on thd social media platform afloat.\nThe term VPN means virtual private network which extends a private networka across a public network and enables users to send and receive data across shared or public networks as if their computing devices were directly connected to the private network.\nIt provides access to resources that may be inaccessible on the public network, and is typically used for telecommunications workers.\nOne of the Twitter users who spoke to Vanguard said, “I have shifted to VPN to access Twitter."
  },
  {
    "headline": "BREAKING: Tompolo reluctantly withdraws ultimatum",
    "summarized_story": "By Emma AmaizeEX-MILTANT leader, Government Ekpemupolo, alias Tompolo, has called off his seven-day ultimatum to disrupt oil and gas facilities in Nigern Delta region if the board of Niger Delta Development Commission, NDDC, was not constituted by Monday.\nDetails coming"
  },
  {
    "headline": "BREAKING: Tompolo reluctantly withdraws ultimatum",
    "summarized_story": "Ex-Militant leader, Government Ekpemupolo, alias Tompolo, has called off his seven-day ultimatum to disrupt oil and gas facilities in Nigern Delta region if the board of Niger Delta Development Commission, NDDC, was not constituted by Monday.\nDetails coming…Vanguard News Nigeria"
  },
  {
    "headline": "Twitter suspension an overkill — Editors caution",
    "summarized_story": "The Nigerian Guild of Editors (NGE) has urged the federal government to tread with caution and immediately reconsider the suspension of the operation of Twitter in Nigeria and seek other legitimate means of resolving its dispute with the company.\nThe Guild sees the indefinite suspension as an overreaction to Twitter’s decision to delete President Muhammadu Buhari’s tweet early this week.\n‘’If the Federal Government finds Twitter’s action against the President objectionable, Nigerians should not be made to suffer the collateral damage of denying them their right to free discourse on Twitter’’, the Guild added.\nNoting the socio-political and economic benefits of social media platforms, the NGE notes that strong democracies rely on both civic and political participation by citizens, saying that Twitter, has over the years, aided citizens’ participation in the nation’s democratic process.\nThe Guild is aware of the democratizing influence of social media platforms, including Twitter, in helping to check to promote democracy worldwide."
  },
  {
    "headline": "Deactivate Buhari’s account, others when he lifts ban – Adeyanju tells Twitter",
    "summarized_story": "Abuja-based rights activist, Deji Adeyanju, has called on Twitter to deactivate the accounts of President Muhammadu Buhari and all his associates.\nAdeyanju, convener of Concerned Nigerians, a rights advocacy group, said such a measure would send a clear message that tyranny would not be tolerated.\nIn a tweet, Adeyanju wrote: “Twitter should wait till when the Buhari regime lifts the ban then deactivate all accounts associated with the tyrant, Govt and APC.\nThis is how to show that dictatorship won’t be tolerated.”Facebook, Twitter, Instagram should deactivate Buhari’s social media accounts – FayoseThe Nigerian Government had on Friday announced the suspension of Twitter in the country.\nThe decision has drawn widespread backlash from Nigerians, with some accusing the government of inability to withstand criticism."
  },
  {
    "headline": "ISIS ordered us to kill Boko Haram’s leader – ISWAP confirms Shekau’s death",
    "summarized_story": "The Islamic State West African Province (ISWAP) has confirmed the death of former Boko Haram leader, Abubakar Shekau.\nISWAP confirmed that Shekau blew himself up after refusing to surrender following the invasion of his hideout on May 19, 2021.\nThis was contained in a message from Abu Mus’ab Habeeb Bin Muhammad Bin Yusuf al-Barnawi, born Habib Yusuf, leader of the terrorists.\nWhen it was time, Allah set out brave soldiers after receiving orders from Amirul Muminin [leader of the believers].”ISWAP, which broke away from Shekau’s Boko Haram faction in 2016, disagreed with the late extremist leader over his excessive use of force, especially on Muslims in areas under his influence.\nBoko Haram vs ISWAP: Expect few threats with Shekau’s death – Arewa youths"
  },
  {
    "headline": "Twitter ban: Dangers of using VPNs",
    "summarized_story": "Nigerians have been downloading Virtual Private Networks (VPN) in a bid to access Twitter, following the decision of the federal government to ban the micro-blogging site on Friday.\nTelecom operators in the country have already confirmed they received instructions to bar their subscribers from the social media app.\nFirst, users must avoid carrying out bank transactions via VPN, as it is just like a router.\nAlso, viruses and malware remain a threat, as most VPNs do not protect your device from viruses or malware.\nProbably the worst is that VPNs can supply your data to government authorities."
  },
  {
    "headline": "Fani-Kayode reveals FG’s plan to criminalise use of social media",
    "summarized_story": "Former Minister of Aviation, Femi Fani Kayode, has raised an alarm over plans by the Federal Government to criminalise the use of social media without NBC approval or registration.\nThe former minister made this known via his Twitter account on Saturday morning.\nAccording to him, “I have been reliably informed that it is the intention of the FG to eventually close down social media completely in Nigeria.”He further lamented that Nigeria has gradually become a police state.\n“Until that time comes they intend to make it a criminal offence to use social media without NBC approval or registration.\n“Nigeria is now a police state,” he wrote."
  },
  {
    "headline": "Twitter ban: Be mature, accept criticisms",
    "summarized_story": "Gumi made the call while reacting to the ban on Twitter by the Federal Government.\nSpeaking with DAILY POST, Gumi said the Buhari-led government should “have a wide chest” in accepting criticisms from Nigerians.\nHe stressed that social media platforms have allowed both the government and the citizens to always state their sides on issues.\nGovernment should have a wide chest not to allow delinquent youths to anger it into massacring people.\nThe government should express such maturity to allow criticism and act accordingly.”Pay ransom, take action later – Sheik Gumi tells El-Rufai"
  },
  {
    "headline": "Twitter ban difficult to enforce in Nigeria, say ICT experts",
    "summarized_story": "By Ibrahim Apekhade YusufDoes Nigeria have what it takes to enforce Federal Government’s ‘indefinite suspension’ of Twitter?\nBut the immediate past President of ATCON, Olusola Teniola, said: “From the look of things, it is very clear that the government is trying to regulate the internet and social media.\n“Even though the government is desirous of banning the activities ofTwitter, it is powerless in this instance because there are several ways to access Twitter.\n“I think the government decision would be weakened by the fact there are several other ways to bypass the ban and easily access their (Twitter) service.\nTwitter didn’t force the government to access its services and cannot expect preferential treatment from the social media platform."
  },
  {
    "headline": "Scrapping of NYSC may threaten unity of Nigeria – A’Ibom Coordinator",
    "summarized_story": "By Bassey Anthony, UyoThe Akwa Ibom State Coordinator of National Youth Service Corps (NYSC) Mrs Chinyere Ekwe has said that the scrapping of the scheme may affect negatively the unity which the country is yearning for.\nShe made the disclosure during the 48-anniversary celebration of NYSC in the country at NYSC permanent camp, Ikot Itie Udung in Nsit Atai Local Government Area on Saturday.\nSo, the unity of Nigeria must continue, in NYSC we promote unity and say no to division.\nIt is a rally point of young people in Nigeria.”Ekwe said the unity of Nigeria was still intact through the scheme, stressing that the unity would continue to exist no matter some differences.\nShe said that the significance of this year’s celebration was unity of Nigeria, adding that NYSC was uniting the whole country, making young people come together to bring unity, prosperity and oneness in the country."
  },
  {
    "headline": "FIRS introduces TaxPro-Max for Naira denominated tax returns",
    "summarized_story": "By Nduka ChiejinaThe Federal Inland Revenue Service (FIRS), has introduced a new Tax Administration Solution (TaxPro-Max) for ease of tax compliance.\nThe “TaxPro-Max solution enables seamless registration, filling, payment of taxes and automatic credit of withholding tax as well as other credits to the Taxpayer’s accounts.\nREAD ALSO: Lottery Commission seeks collaboration with FIRSTaxPro-Max also provides a single-view to Taxpayers for all transactions with the Service”.\nIt added; “Taxpayers yet to get their user credentials are urged to visit the nearest FIRS Tax Office to be on board immediately.\n“As from 7th June 2021, the TaxPro-Max becomes the channel for filing Naira-denominated tax returns in the country.”"
  },
  {
    "headline": "Foot injury forces Wawrinka to withdraw from Wimbledon",
    "summarized_story": "Our ReporterThree-time Grand Slam champion Stan Wawrinka has pulled out of Wimbledon with a foot injury that has also forced him to miss the ongoing French Open.\nFormer world number three Wawrinka, 36, had an operation on his left foot earlier this year.\nADVERTISEMENTHe has not played on the ATP Tour since his opening-round defeat by Lloyd Harris at March’s Qatar Open.\nREAD ALSO: Federer tipped for another Wimbledon titleWimbledon, which begins on 28 June, is the only Grand Slam the Swiss, twice a quarter-finalist there, has not won.\nWawrinka, now ranked 24th in the world, won the Australian Open in 2014 before adding the French Open in 2015 and US Open in 2016."
  },
  {
    "headline": "Stubborn male fans won’t let me rest –Princess Salt",
    "summarized_story": "Nollywood diva, Chidimma Agunobi aka Princess Salt has maintained that her curvaceous sexy figure is natural and not enhanced with surgery.\nShe told Saturday Sun: “I’ve always had this sexy shape from birth.\nI’m not against those that do liposuction; you are free to do with your body whatsoever makes you happy.\nHowever, some stubborn male fans won’t let me be.\nIt’s crazy out there with these crazy fans."
  },
  {
    "headline": "NDDC board: Tension in Niger Delta as Tompolo’s ultimatum ends",
    "summarized_story": "From Paul Osuyi and Ben Dunno, WarriTension is building again in the oil rich Niger Delta region as the seven-day ultimatum issued by ex-militant warlord, Government Ekpemupolo alias Tompolo for the Federal Government to reconstitute the board of the Niger Delta Development Commission (NDDC) expires today.\nAs a result of the tension generated by Tompolo’s ultimatum, Minister of Niger Delta Affairs, Mr. Godswill Akpabio visited Delta State where he met with some key stakeholders with a view to dousing the rising tension.\nAfter the ultimatum and nothing is done, don’t blame anybody.”Speaking earlier Akpabio made reference to how war would break out in the Niger Delta if tension continues to grow.\nHe said that it was necessary for the youths to give peace a chance going by the fragile nature of the Niger Delta region, saying that “we must not allow our region to boil.\nIt was, however, learnt that the minister left the peace parley at Oporoza with the promise to commence the process of constituting the substantive NDDC board on returning to Abuja."
  },
  {
    "headline": "Invasion plot by foreign herders: Yoruba groups to comb South-West forests",
    "summarized_story": "He called for proactive efforts of all Yoruba people to fight the menace of insecurity to a standstill in the region.\nHe said the forests in the South West would be combed to identify illegal herders, especially those from neighbouring countries.\nWe have had enough political crisis and no crisis should brew in the South West again,” he added.\nThe group warned, however, that it would not allow the invasion of any part of Yoruba land by foreign herders.\nAlready, our members are stationed across the forests in South West."
  },
  {
    "headline": "Kebbi Boat mishap: Senate donates N10m to victims’ families",
    "summarized_story": "From Olanrewaju Lawal, Birnin KebbiThe Leadership of the Senate has donated N10 million to the victims’ families of Warrah boat mishap in Ngaski Local Government Area of Kebbi State.\nSenator Adamu Aliero who led the Senate delegation, announced the donation in Birnin Kebbi on Friday, during their condolence visit to the Kebbi State Governor, Senator Abubakar Atiku Bagudu over the boat mishap.\nHe noted that the donation would be given to Emir of Yauri Emirate, who will then give it out to the victims’ families.\nHe explained that the Senate Leader, Dr. Abdullahi Yahyah moved a motion over the incident and was seconded by Senator Adamu Aliero.\n“So, on behalf of our Senate President, on whose endorsement we are here today and the three Senators from Kebbi State, we want to genuinely ask you to accept our condolences."
  },
  {
    "headline": "Alleged random arrest of youths in South-East: FG plotting war on Igboland",
    "summarized_story": "“May I repeat that history shows that military and violent means to solve national problem leads to national fractionalization, anarchy and eventual or inevitable disintegration.\nThe Federal Government should realise and be confident enough, that no secessionist forces can defeat Nigeria,” Obiozor said.\n“Ohanaeze Ndigbo wants to make it categorically clear that Ndigbo will not support the break-up of Nigeria but Ndigbo will not be victims of Nigerian unity.\n“I have been saying that the Buhari-led Federal Government is pushing the Southeast out of Nigeria.\nPresident General of Igbo Speaking Community in Lagos, Chief Sunday Ude, said what is happening in the South-East is very bad and unfair."
  },
  {
    "headline": "In a Shocking Overreaction, FG Suspends Twitter’s Operations",
    "summarized_story": "This must be reviewed.”The Peoples Democratic Party (PDP) vehemently rejected the Twitter suspension, describing it as a draconian action and a slide towards a fascist regime in our country.\nNigeria, we’ll see in court.”The British embassy in Nigeria also condemned the Twitter suspension.\nNobel Laureate, Prof Wole Soyinka described Twitter suspension as unbecoming of a democratically elected President.\nUnrepentant tyrant.”In another post, he said, “No shaking I have VPN.”Twitters’ ReactionMicro-blogging site, Twitter, says the suspension of its operations in Nigeria is “deeply concerning”.\n“The announcement made by the Nigerian Government that they have suspended Twitter’s operations in Nigeria is deeply concerning."
  },
  {
    "headline": "Reduce Insecurity to Barest Minimum, Buhari Orders IG",
    "summarized_story": "President Buhari had on April 6, appointed Baba as acting Inspector General of Police.\nHe tasked him to rise to the challenge and ensure that the insecurity that the country is facing is brought to the barest minimum.\n“I briefed Council on adding to our strengths in terms of recruitment for 2020 and 2021 as this will assist us.\n“I briefed Council on the number of arrests we have made and recoveries in terms of firearms and weaponry that are being used lawlessly.\n“The issue is IPOB is a proscribed organisation and we expect nobody to belong to the IPOB."
  },
  {
    "headline": "In a New Low, Bandits Target Poor, Vulnerable for Abductions",
    "summarized_story": "This trend of kidnapping from among the poor and vulnerable is evident in the series of abductions that have taken place in the last few months in Kaduna, Niger, Zamfara, Katsina and Sokoto states.\nIn the case of Tegina School, these pupils from poor homes, study in ramshackle buildings (with help of a charitable indigene), with no iota of security in the premises.\nA lot of abductions of the poor and vulnerable in Niger State are taking place in Shiroro, Munya, Rafi and Mariga local government areas.\nIn Kaduna State, the poor and vulnerable are being abducted in communities in Chikum, Birnin Gwari, Igabi, Kajuru and Giwa local government areas.\n‘‘Abducted Pupils are Toddlers Who Need Help’Parents and teachers of the abducted Tegina pupils yesterday painted a gory picture of the toddlers in the bush for the sixth day running."
  },
  {
    "headline": "Breaking: FG Suspends Twitter’s Operations in Nigeria",
    "summarized_story": "By Olawale AjimotokanThe Federal Government has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria.\nThe suspension was announced on Friday by the Minister of Information and Culture, Alhaji Lai Mohammed, via a statement issued in Abuja.\nThe minister cited the persistent use of the Twitter platform for activities that were capable of undermining Nigeria’s corporate existence.\nMohammed stated that the Federal Government had also directed the National Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in Nigeria.\nTwitter had Wednesday deleted President Muhammadu Buhari’s tweet posted Tuesday where he threatened to deal with secessionists “in the language they understand”."
  },
  {
    "headline": "Obasanjo: Bad Leadership Has Turned Nigeria to Land of Bitterness, Sadness",
    "summarized_story": "But despite the worsening insecurity, the federal government has said it is preposterous for anyone to declare Nigeria a failed state on the basis of the country’s security challenges.\n“Right now, it is a land flowing with bitterness and sadness; that is not what God wants this country to be.\nInsecurity Does Not Make Nigeria Failed State, Insists FGMeanwhile, the federal government has said it is preposterous for anyone to declare Nigeria a failed state due to the country’s security challenges.\n“Nigeria’s worldwide companions, particularly the USA, should acknowledge that Nigeria is now a failed state.\n“Declaring any nation a failed state is not done at the whims and caprices of one or two persons, no matter their status."
  },
  {
    "headline": "BREAKING: Buhari Hits Back At Twitter, Suspends Its Operations Indefinitely In Nigeria",
    "summarized_story": "The Nigerian Government has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria.\nThe development comes after Twitter deleted President Muhammadu Buhari’s tweet where he threatened to treat Nigerians “misbehaving” in “the language they understand”.\nBuhari had in a tweet on Tuesday stated that his government will get “harder” on those hell-bent on destroying the country.\nTrump's Twitter account was \"permanently suspended... due to the risk of further incitement of violence,\" Twitter had said.\nThe platform said the message by the Nigerian President violated its rules."
  },
  {
    "headline": "BREAKING: Buhari Hits Back At Twitter, Suspends Its Operations Indefinitely In Nigeria",
    "summarized_story": "The Nigerian Government has suspended, indefinitely, the operations of the microblogging and social networking service, Twitter, in Nigeria.\nThe development comes after Twitter deleted President Muhammadu Buhari’s tweet where he threatened to treat Nigerians “misbehaving” in “the language they understand”.\nBuhari had in a tweet on Tuesday stated that his government will get “harder” on those hell-bent on destroying the country.\nTrump's Twitter account was \"permanently suspended... due to the risk of further incitement of violence,\" Twitter had said.\nThe platform said the message by the Nigerian President violated its rules."
  },
  {
    "headline": "Governor Abiodun’s Suspended Aide, Rufai, Caught In $350,000 Fraud May Escape To Nigeria If Granted Bail – US Attorney",
    "summarized_story": "The suspended Senior Special Assistant to the Ogun State Governor Dapo Abiodun, Mr Abidemi Rufai, caught in $350,000 wire fraud, may forfeit his bail as the United State authorities said he would escape to Nigeria if granted bail and his extradition would be difficult.\nThe Acting US Attorney, Tessa Gorma, stated this while asking a district judge to reverse a bail earlier granted to Rufai by a magistrate judge.\nDespite his alleged involvement in $350,000 fraud, Rufai said through his lawyer that he was a man of integrity.\nSaharaReporters had on May 18 reported that Rufai faces up to 30 years in prison if he is convicted of wire fraud.\nOgun State governor, in his reaction, described the arrest as disturbing news and ordered the immediate suspension of Rufai."
  },
  {
    "headline": "Governor Abiodun’s Suspended Aide, Rufai, Caught In $350,000 Fraud May Escape To Nigeria If Granted Bail – US Attorney",
    "summarized_story": "The suspended Senior Special Assistant to the Ogun State Governor Dapo Abiodun, Mr Abidemi Rufai, caught in $350,000 wire fraud, may forfeit his bail as the United State authorities said he would escape to Nigeria if granted bail and his extradition would be difficult.\nThe Acting US Attorney, Tessa Gorma, stated this while asking a district judge to reverse a bail earlier granted to Rufai by a magistrate judge.\nDespite his alleged involvement in $350,000 fraud, Rufai said through his lawyer that he was a man of integrity.\nSaharaReporters had on May 18 reported that Rufai faces up to 30 years in prison if he is convicted of wire fraud.\nOgun State governor, in his reaction, described the arrest as disturbing news and ordered the immediate suspension of Rufai."
  },
  {
    "headline": "Governor Abiodun’s Suspended Aide, Rufai, Caught In $350,000 Fraud May Escape To Nigeria If Granted Bail – US Attorney",
    "summarized_story": "The suspended Senior Special Assistant to the Ogun State Governor Dapo Abiodun, Mr Abidemi Rufai, caught in $350,000 wire fraud, may forfeit his bail as the United State authorities said he would escape to Nigeria if granted bail and his extradition would be difficult.\nThe Acting US Attorney, Tessa Gorma, stated this while asking a district judge to reverse a bail earlier granted to Rufai by a magistrate judge.\nDespite his alleged involvement in $350,000 fraud, Rufai said through his lawyer that he was a man of integrity.\nSaharaReporters had on May 18 reported that Rufai faces up to 30 years in prison if he is convicted of wire fraud.\nOgun State governor, in his reaction, described the arrest as disturbing news and ordered the immediate suspension of Rufai."
  },
  {
    "headline": "NCDC records 48 infections in eight states — but zero deaths",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) on Friday recorded 48 cases of COVID-19 in the country.\nLagos, the epicentre of the pandemic in Nigeria, recorded 16 infections, followed by Yobe with 16 and Kano with 8.\nAdvertisementOther states that recorded cases on Friday are Gombe (3) Akwa Ibom (1) Delta (1) FCT (1) Kaduna (1) and Rivers (1).\nAdvertisementSince the country recorded its index case in February 2020, 166,730 cases have been confirmed in the 36 states and the FCT.\n48 new cases of COVID19Nigeria; Advertisement Lagos-16Yobe-16Kano-8Gombe-3Akwa Ibom-1Delta-1FCT-1Kaduna-1Rivers-1 166,730 confirmed162,584 discharged2,117 deaths pic.twitter.com/tg8TVfzdXD — NCDC (@NCDCgov) June 4, 2021"
  },
  {
    "headline": "NCDC records 48 infections in eight states — but zero deaths",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) on Friday recorded 48 cases of COVID-19 in the country.\nLagos, the epicentre of the pandemic in Nigeria, recorded 16 infections, followed by Yobe with 16 and Kano with 8.\nAdvertisementOther states that recorded cases on Friday are Gombe (3) Akwa Ibom (1) Delta (1) FCT (1) Kaduna (1) and Rivers (1).\nAdvertisementSince the country recorded its index case in February 2020, 166,730 cases have been confirmed in the 36 states and the FCT.\n48 new cases of COVID19Nigeria; Advertisement Lagos-16Yobe-16Kano-8Gombe-3Akwa Ibom-1Delta-1FCT-1Kaduna-1Rivers-1 166,730 confirmed162,584 discharged2,117 deaths pic.twitter.com/tg8TVfzdXD — NCDC (@NCDCgov) June 4, 2021"
  },
  {
    "headline": "Not only Twitter -- how FG's directive will affect Facebook, Netflix, WhatsApp",
    "summarized_story": "Over-the-Top (OTT) services are essential media services offered directly to viewers via the internet.\nAdvertisementIn Nigeria, Twitter, WhatsApp, Facebook, FB Messenger, Skype, iROKOtv, and Netflix are currently running on OTT.\nHOW WILL THE DIRECTIVE AFFECT SOCIAL MEDIA OPERATIONS?\nOne of the avenues through which Nigerian citizens air their views on the actions and policies of government have been through social media platforms.\nThese rules are also obtainable in China, where social media platforms have to censor content before appearing online."
  },
  {
    "headline": "Not only Twitter -- how FG's directive will affect Facebook, Netflix, WhatsApp",
    "summarized_story": "Over-the-Top (OTT) services are essential media services offered directly to viewers via the internet.\nAdvertisementIn Nigeria, Twitter, WhatsApp, Facebook, FB Messenger, Skype, iROKOtv, and Netflix are currently running on OTT.\nHOW WILL THE DIRECTIVE AFFECT SOCIAL MEDIA OPERATIONS?\nOne of the avenues through which Nigerian citizens air their views on the actions and policies of government have been through social media platforms.\nThese rules are also obtainable in China, where social media platforms have to censor content before appearing online."
  },
  {
    "headline": "Ozekhome on Twitter ban: FG should dissolve Nigeria and select new citizens",
    "summarized_story": "Mike Ozekhome, a senior advocate of Nigeria (SAN), says the federal government should not stop at just banning Twitter operations in Nigeria but “dissolve” citizens and get new people in their place.\nAdvertisementOn Friday, Lai Mohammed, minister of information, announced the indefinite suspension of Twitter, the social media service.\nAdvertisement“Well, I am not surprised that the Federal Government has suspended Twitter operations in Nigeria.\nSo, they just gleefully tell the world that they have suspended Twitter and that they would soon license other OTT and social media operations.\n“This is the same government that undeservedly rode to power using the same Twitter and other social media platforms it now detests."
  },
  {
    "headline": "A Giant Shame returns Nigeria to pre-internet darkness and fear",
    "summarized_story": "An infamous banAs of the morning of Saturday June 5, most people living in Nigeria could no longer access Twitter.\nSome users say they still have access from some internet service providers, but VPNs have become the primary medium to stay on Twitter for most people.\nALTON confirms telcos have shut down Twitter in NigeriaBut of course the whole responsibility for Nigeria’s Twitter darkness lies at the top.\nBasically, any media and communication service that uses data provided by internet service providers.\nBy suspending Twitter, Nigeria has stepped into the internet control realm currently championed by China, Iran and India, a fellow democracy."
  },
  {
    "headline": "Twitter is ‘deeply concerned’ by Nigerian government’s suspension",
    "summarized_story": "Twitter has reacted to the indefinite suspension of the social media site by the Nigerian government, expressing concern.\nA statement by a Twitter spokesperson to TechCabal said:“The announcement made by the Nigerian Government that they have suspended Twitter’s operations in Nigeria is deeply concerning.\nIt started when Twitter deleted a tweet by President Muhammadu Buhari for violating its rules.\nIt remains to be seen when the suspension takes effect and what actions Twitter takes.\nUpdate: Twitter has now been shutdown in Nigeria."
  },
  {
    "headline": "Nigeria suspends Twitter indefinitely",
    "summarized_story": "The Federal Government has indefinitely suspended the operations of Twitter in Nigeria.\nIt was widely criticised as summoning the ghosts of the Nigeria civil war, a deadly three-year combat between the Nigerian government and a government in southeast Nigeria, which had seceded from the republic.\nImplications of the Twitter BanThe indefinite suspension of Twitter would mean that Internet Service Providers (ISP) in Nigeria like MTN and Airtel will be mandated to not give users access to Twitter.\nThe ISPs will block twitter’s IP addresses from all its users, or delete the sites from their DNS servers.\nIt remains to be seen whether the ISPs will implement such an order and how they will communicate it to their users."
  },
  {
    "headline": "5 Reasons Why You Should Consider A Loan from Page Financials",
    "summarized_story": "If you are still thinking about whether or not to consider a personal loan, we have highlighted 5 reasons why customers usually resort to getting a personal loan.\nDebt ConsolidationOne of the popular reasons to get a personal loan from Page is for debt consolidation.\nWhat To Consider When Considering A Personal LoanApplying for a Page Loan is super easy, everything happens online and you don’t need to visit their office.\nConsider avoiding a personal loan if:You can’t afford it.\nIf you can’t afford monthly payments for your new personal loan, consider skipping it."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Nigerian government suspends access to Twitter indefinitely, Facebook, others could be next",
    "summarized_story": "The Nigerian Federal Government has announced that it will be indefinitely blocking access to microblogging and social media platform, Twitter, in Nigeria.\nOn Friday, June 4, 2021, Nigeria’s Federal Ministry of Information and Culture made this move known on its Twitter and Facebook handles.\nOver the years, Twitter has become an important social media platform for Nigerians.\nNigeria’s latest suspension means that it could order telecom companies to block access to Twitter if this move is not fought against.\nAdvertisementHowever, all signs point to the fact that the Social Media Bill could be very much alive."
  },
  {
    "headline": "Using WhatsApp On Multiple Devices, Building Africa's Tesla, Twitter Activates Subscription Service • Techpoint Africa",
    "summarized_story": "Today, I’m discussing:WhatsApp’s multi-device supportBuilding Africa’s TeslaTwitter launching Twitter BlueOne WhatsApp account, multiple devicesInstant messaging app, WhatsApp, will soon allow users to simultaneously open one account across several devices.\nWhen are these features coming?\nThough there is no launch date for these features, Zuckerberg hints at some time within the next two months.\nAdvertisementTwitter launches premium subscription serviceTwitter launched its premium subscription service, Twitter Blue, on June 3, 2021.\nWhile Twitter didn’t mention a cost, my story about the coming of Twitter Blue might give you an idea."
  },
  {
    "headline": "Kenya-based startup, Kibanda TopUp, raises $460k pre-seed",
    "summarized_story": "Kibanda TopUp, a Kenyan startup which aims at digitising the food supply chain for micro, small, and medium restaurants in Africa has closed a $460k pre-seed round to increase its customer base.\nThe involvement of local investors like Rockson and Agboola continues a growing trend of African investment in early-stage startups.\n“We are increasing restaurants’ contributions to Africa’s GDP by helping reduce cost with the supply chain.\nBased on Blauwhoff’s skills in entrepreneurial digital strategy and project management, and Mutambo’s experience in logistics, Rockson expresses confidence in the founders’ vision.\nKibanda TopUp has a great opportunity to drive a transformation of these businesses into a formal restaurant cooperative to maximise the economic potential."
  },
  {
    "headline": "As telcos enforce Nigeria’s Twitter ban, experts disagree on the legality",
    "summarized_story": "As of 12 am on Saturday, 5 June 2021, Twitter users in Nigeria using any of the four telecom operators, MTN, Globacom, Airtel, and 9Mobile started to experience limited services.\nNetblocks, a watchdog organization that monitors cybersecurity and the governance of the internet, also confirmed the restriction of Twitter in Nigeria from the morning of…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Why no African made 106 global millennial billionaires’ list",
    "summarized_story": "No citizen of an African country made the list of 106 richest millennial billionaires in the world, analysis of the latest data on millennial billionaires published by Visual Capitalist shows.\nBy producing 33 millennial billionaires, the US accounts for $266.7 billion of the youngest billionaires’ wealth, representing 46.5 percent of the total 106 millennial billionaires’ wealth.\nGermany produces eight millennial billionaires with a combined wealth of $11.7 billion, which represents 2 percent of the total wealth.\nThe five youngest billionaires from Russia control 6.4 percent of the total wealth which amounts to $36.8 billion, while Sweden’s five millennial billionaires control 2.4 percent of the total wealth of the 106 millennial billionaires, amounting to $13.9 billion.\nIndia’s millennial billionaires are worth $4.8 billion, which represents 0.8 percent of the total wealth of the 106 millennial billionaires worldwide."
  },
  {
    "headline": "Investors scramble for returns in non-conventional properties",
    "summarized_story": "At a time when high-yield investment assets are scarce, the non-conventional property sector is taking centre stage in the market, offering uncommon opportunities, while investors look for returns in more competitive environments.\nSome savvy investors are, however, taking position in the sector which includes student or young professional housing, healthcare and industrial facilities.\nRecently, Eris and International Finance Corporation (IFC) sealed a partnership deal for a new student accommodation platform.\nInvestors are confident that despite COVID-19, which has led some schools to adopt a hybrid of online and in-person learning, demand for affordable student accommodation remains high.\nIt gives about 22 percent which is more than double what commercial real estate gives, not to talk of residential real estate which gives just 4-5 percent return per annum,” he said."
  },
  {
    "headline": "We’ll enact laws to improve economy – Obaseki – Nigerian Observer",
    "summarized_story": "Godwin Obaseki of Edo has expressed his administration’s readiness to enact laws and strengthen existing ones to improve the state’s economy.\nObaseki said this while addressing participants at the Edo State Transition Committee’s engagement with artisans on Friday in Benin.\nObaseki assured the artisans that his administration was open and accountable to the people of the state including tax payers.\nHe said his government had been working to eliminate cash payment for tax across the state to minimise corruption.\n“We are simplifying the tax system in the state to encourage more people to key into the tax system."
  },
  {
    "headline": "FG suspends Twitter’s operations in Nigeria – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Federal Government has suspended indefinitely, the operations of the microblogging and social networking service, Twitter in Nigeria.\nThe Minister of Information and Culture, Alhaji Lai Mohammed, announced the suspension in a statement in Abuja on Friday.\nThe minister cited the persistent use of the platform for activities capable of undermining Nigeria’s corporate existence.\nHe said the Federal Government had also directed the National Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in the country.\nThe statement was released by Mr Segun Adeyemi, Special Assistant to the President (Media), office of the Minister."
  },
  {
    "headline": "World Environment Day: Obaseki reiterates commitment to restoring forest reserves – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has reiterated his administration’s commitment to collaborate with environmentalists, community leaders and other stakeholders to restore forest reserves in the state.\nObaseki made the call in commemoration of the World Environment Day, marked on June 5 each year, by the United Nations and its partners.\nGlobal greenhouse gas emissions have grown for three consecutive years and the planet is one pace for potentially catastrophic climate change.\n“The emergence of COVID-19 has also shown just how disastrous the consequences of ecosystem loss can be.\nBy shrinking the area of natural habitat for animals, we have created ideal conditions for pathogens – including coronaviruses – to spread.”..."
  },
  {
    "headline": "Legislate on child protection, JDPCI urges lawmakers – Nigerian Observer",
    "summarized_story": "Speaking on the the theme of the 2021 Child Protection Day, “The Role of Parents and Caregivers in the Protection of Children, the Coordinator of the Edo State Child Protection Network, Barr.\nHe listed the types of Child Abuse to include Physical, Emotional and Sexual Abuses, asserting that abusing a child constituted the worst thing anybody could do to a child.\nWhen you protect children, you are not doing them a favour.\nIt is the duty of everyone to protect children because we are all stakeholders.\n“Not putting a child in school is another form of child abuse."
  },
  {
    "headline": "#Twitterban: Governor Makinde opposes Twitter suspension, urges reversal",
    "summarized_story": "ADVERTISEMENTSeyi Makinde, the governor of Oyo State, has asked the federal government to reverse the suspension of Twitter’s operations in the country.\nMr Makinde, in a statement Saturday, said that the federal government’s action was an ’emotional reaction’ and not well thought out.\nI, therefore, use this medium to appeal to the Federal Government to reverse this suspension for the greater good of Nigerians,” Mr Makinde said.\nAfter condemning the deletion of the post by Twitter, the government on Friday then announced the suspension of the social media platform in Nigeria.\nTwitter said in a statement on Friday that it was investigating the “deeply concerning” suspension of operations, and would “provide updates when we know more.”"
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Nigerians resort to VPN to access Twitter as NCC, telcos block access on govt orders",
    "summarized_story": "OBINNA EZUGWUNigerian tweeps have resorted to using Virtual Private Network (VPN) as the country’s telecommunications operators have blocked access to Twitter on the order of President Muhammadu led Federal Government.\nBy 12 am on Saturday, many noticed that they could not longer access the platform using their mobile networks.\nThe telcos, under the aegis of the Association of Licensed Telecoms Operators of Nigeria (ALTON) said there had been a directive from the Nigerian Communications Commission (NCC) to block Nigerians from accessing the platform.\nALTON statement reads: “We, the Association of Licensed Telecommunication Operators of Nigeria (ALTON) wish to confirm that our members have received formal instructions from the Nigerian Communications Commission (NCC), the industry regulator to suspend access to Twitter.\n“Based on national interest provisions in the Nigerian Communications Act, 2003, and within the licence terms under which the industry operates; our members have acted in compliance with the directives of the Nigerian Communications Commission (NCC) the industry regulator."
  },
  {
    "headline": "NAFDAC, Global Alliance for Trade partner to enhance ease of doing business in Nigeria",
    "summarized_story": "The project is being powered by the Global Alliance for Trade Facilitation.\nShe said NAFDACs focus now is to ensure smooth trade facilitation and regulation, stressing that operations of regulators should not pose an hinderance to trade transactions but facilitate them.\n‘We are also working clearly on defining export data, documents and processes for the Nigeria Customs service, and other partner agencies.\n‘’In February we realized a memorandum of understanding with the Nigeria Customs as a lead agency for border operations in Nigeria.\nLast month we had an executive master class for the management of the Nigeria Customs Service on trade facilitation agreement issues in Nigeria’’."
  },
  {
    "headline": "Buhari quiet when Benue is attacked but evokes civil war memories when Igbo are involved —Soyinka",
    "summarized_story": "Nobel Laureate, Prof. Wole Soyinka, has said Nigeria’s President, Muhammadu Buhari keeps quiet when herdsmen attack people in Benue State but is quick to evoke memories of the civil war whenever the Igbo people of South East are involved.\n“What a pity, and what a tragic setting, to discover that this language was accessible all the time to President Buhari, where and when it truly mattered, when it would have been not only appropriate, but deserved and mandatory!\nHe said Buhari only later asked security agents to shoot criminals on sight after much pressure, a move which he said was belated.\nSoyinka argued that the world had moved on from the civil war and wondered why Buhari still spoke of it with nostalgia.\n“The evocation of the civil war, where millions of civilians perished, is an unworthy emotive ploy that has run its course."
  },
  {
    "headline": "Dangote fertiliser to flood Nigerian market on Monday",
    "summarized_story": "The Dangote Group has said products from its $2 billion granulated urea fertiliser plant will be available in the market on Monday.\nChairman of Dangote Group and Africa’s richest person, Alhaji Aliko Dangote, told NAN on Friday that the plant has been certified and licensed by all regulatory authorities in Nigeria.\nThe fertiliser plant, located at Ibeju Lekki, Lagos, has a name-plate annual capacity of three million tons of urea and ammonia.\n“By the time we add what we have to the existing capacity from Indorama which is about 1.5 million metric tonnes and Notore, maybe about 300 metric tonnes, we will be having close to about five metric tonnes capacity of urea,” he said.\n“Today we saw urea produced , we saw it bagged and we saw it loaded on buses, and by Monday it would be in our markets."
  },
  {
    "headline": "Fare To Reduce As Air Peace Receives Another B737 Aircraft From Isreal",
    "summarized_story": "Cost of air travel across Nigeria will begin to drop as Air Peace, announced the arrival of one of its aircraft, a Boeing 737, which has been undergoing C-check maintenance in Israel.\nThe aircraft, with registration number 5N-BQU, arrived Lagos on Friday after going through maintenance in Israel.\nLEADERSHIP recall that air passengers have been paying huge fare since easing COVID-19 lockdown when some aircraft were trapped in foreign countries for routine maintenance checks.\nAir Peace New Aircraft Begin Test Flights To Owerri, AbujaStakeholders have argued that as soon as the aircraft return to Nigeria, they will service more routes, increase capacity as well as reduce high air fare experienced in the sector due to limited aircraft servicing local passengers.\nADVERTISEMENTThe statement also revealed that Air Peace will be deploying its two brand new E195-E2 aircraft for scheduled operations very soon as the jets are currently operating demo flights."
  },
  {
    "headline": "The Voice Nigeria 3: Team Darey Takes Center Stage, Loses Dapo, Ayomikun",
    "summarized_story": "The music reality show, The Voice Nigeria, got more interesting as the knockout stage ended on.\ndramatic note as Team Darey made their performances.\nThe six contestants namely Dapo, Ayomikun, Esther, Jeremiah Blessing and Rachel took turns to share the spotlight.\nWaje got Ayomikun who was left in the Danger Zone by Darey even after his rendition of Bruno Mars’ ‘Just the way you are’.\nIn an interesting twist, five of the members of Darey’s team made it to the battle – either through stealing or save."
  },
  {
    "headline": "Cancer Society, Foundation Collaborate On Reducing Impact",
    "summarized_story": "The Nigerian Cancer Society is to collaborate with the OCI Foundation to advance the cause of cancer care in Nigeria.\nThe collaboration is in the area of Arm Our Youths (ArOY) health campaign which primary aim is to introduce anti-breast and anti-cervical cancer teachings into the curriculum of all senior secondary schools in Nigeria.\nThe Arm Our Youths Health campaign commenced in 2019 with the aim to cover all the states of Nigeria by 2025.\nThe decision was reached after a virtual meeting and award ceremony, organised by the Nigerian Medical Students Association (NIMSA) and sponsored by the President of the OCI Foundation, Prof. Chris Ifediora.\nHe said, already, the OCI Foundation has the ideas, technology, and plans to get this partnership to a glittering start, and we will be bringing all of these into this partnership."
  },
  {
    "headline": "Ex-NDDC MD Dismisses N70bn Contract Allegation Against Amaechi’s Wife",
    "summarized_story": "A former managing director of the Niger Delta Development Commission (NDDC), Prof. Nelson Brambraifa, has dismissed the allegation of ₦70billion contract awarded to the Empowerment Support Initiative (ESI), a non-governmental organisation founded by the wife of the minister of Transportation, Dame Judith Amaechi.\nHe also dismissed allegation of corrupt practice and financial impropriety in the commission under his watch, describing his tenure as transparent and accountable.\n“I therefore state unequivocally that NDDC under my watch never awarded 70 billion naira contract to the ESI.\nIt is obvious that the author of that malicious publication is uninformed, inert and ignorant of the workings in the NDDC.\nAll documents for award of contracts pass through due process and due diligence and are open for public scrutiny,” he stated."
  },
  {
    "headline": "BREAKING: Telecom Operators Suspend Access To Twitter",
    "summarized_story": "The Association of Licensed Telecommunication Operators of Nigeria (ALTON) has suspended access to Twitter.\nGbenga Adebayo and executive secretary, Gbolahan Awonuga, the association said its action was based on a directive by the telecommunications industry regulator, Nigerian Communications Commission (NCC).\nThe statement titled ‘Order to Suspend Access to Twitter’, said: “We, The Association of Licensed Telecommunication Operators of Nigeria (ALTON) wish to confirm that our members have received formal instructions from the Nigerian Communications Commission (NCC), the industry regulator to suspend access to Twitter.\n“We remain committed to supporting the government of the Federal Republic of Nigeria and upholding the rights of citizens.\nADVERTISEMENT“As an industry, we endorse the position of the United Nations that the rights held by people offline must also be protected online."
  },
  {
    "headline": "Three dismissed soldiers confess to training over 4,000 ESN members —",
    "summarized_story": "*Say Nnamdi Kanu promised them a lot but failed to fulfill his promisesThree dismissed soldiers who aided the training of over 4000 members of the Eastern Security Network (ESN) have narrated how the leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, lured them to join the group, but failed to fulfill his promises.\nThree dismissed soldiers who aided the training of over 4000 members of the Eastern Security Network (ESN) have narrated how the leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, lured them to join the group, but failed to fulfill his promises.\n“He said Nnamdi Kanu was ready to pay them twice the money they are earning as soldiers.\nWe then traveled to Abia State where we took oaths to be loyal to Nnamdi Kanu.\nAfter spending one month in their Abia State Camp, we were transferred to another Camp, where I spent three weeks training the militia I met there."
  },
  {
    "headline": "NCPC assures zero abscondment while on Holy Pilgrimage to Jordan",
    "summarized_story": "By Tom OkpeExecutive Secretary of the Nigeria Christian Pilgrim Commission,(NCPC) Rev Yakubu Pam has assured that the Commission’s planned pilgrimage to Jordan would experience zero abscondment while on the Holy trip.\nIn a press conference in Abuja on Friday, Rev Pam discribed the pilgrimage to Jordan as a spiritual journey that would be well coordinated, assuring that pilgrims would return back to the country safely.\n“Pilgrimage to the Holy sites in Jordan would be a supernatural divine journey for Nigerians.\n“One cannot separate pilgrimage and peace, without peace, pilgrimage will not strive.\nRev Pam indicated that retirement should be celebrated saying that the essence of retirement shows there are changes of situations in life."
  },
  {
    "headline": "South-east: ‘Stop arresting innocent youths’ – Abaribe to FG",
    "summarized_story": "Senate Minority leader, Enyinnaya Abaribe, has condemned the approach the federal government is taking to resolve South-East attacks.\nAbaribe in an interview on Arise TV on Thursday, condemned the arrest of innocent youths, especially young boys by security operatives in the South-East each time there is an attack on a security formation.\nThe senator stated that there is a need for security agencies to conduct an in-depth investigation, bring and try criminals involved in the acts in court.\nREAD ALSO: Abductors of Niger school children raise ransom from N110m to N200mHe also insinuated that there are speculations that the attacks which are being done in quick succession in Igbo land were aimed at scuttling the proposal for an Igbo presidency.\n“Civil engagement dictates that you investigate, apprehend and prosecute."
  },
  {
    "headline": "Ozekhome begs FG: Go beyond Twitter ban, suspend, dissolve Nigeria",
    "summarized_story": "The senior advocate also said the government is trying to cover its atrocities from global exposure with its decision to suspend the operations of Twitter in the country.\nThe PUNCH had earlier reported that Twitter deleted a post by the Nigerian President, Major General Muhammadu Buhari (retd.\nReacting in a statement, Ozekhome said, “Well, I am not surprised that the Federal Government has suspended Twitter operations in Nigeria.\nSo, they just gleefully tell the world that they have suspended Twitter and that they would soon license other OTT and social media operations.\nIt should actually suspend or dissolve the Nigerian people which it has become so allergic to and no longer wants to see or hear about."
  },
  {
    "headline": "NBA threatens lawsuit, says Twitter suspension illegal",
    "summarized_story": "The Nigerian Bar Association has threatened to challenge in court, the decision of the Federal Government to suspend the operations of microblogging site Twitter in the country.\nNBA President, Olumide Akpata, who made this known in a statement on Friday night, described the government’s decision as illegal.\nThe PUNCH had earlier reported that Twitter deleted a post by the Nigerian President, Major General Muhammadu Buhari (retd.\nConsequently, Minister of Information and Culture, Lai Mohammed, announced the suspension of Twitter today, citing the “persistent use of the platform for activities that are capable of undermining Nigeria’s corporate existence”.\n“Consequently, if this decision is not immediately reversed, the Nigerian Bar Association will have no choice but to challenge same in the interest of the public and our democracy.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "NBA threatens lawsuit, says Twitter suspension illegal",
    "summarized_story": "The Nigerian Bar Association has threatened to challenge in court, the decision of the Federal Government to suspend the operations of microblogging site Twitter in the country.\nNBA President, Olumide Akpata, who made this known in a statement on Friday night, described the government’s decision as illegal.\nThe PUNCH had earlier reported that Twitter deleted a post by the Nigerian President, Major General Muhammadu Buhari (retd.\nConsequently, Minister of Information and Culture, Lai Mohammed, announced the suspension of Twitter today, citing the “persistent use of the platform for activities that are capable of undermining Nigeria’s corporate existence”.\n“Consequently, if this decision is not immediately reversed, the Nigerian Bar Association will have no choice but to challenge same in the interest of the public and our democracy.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Alleged anti-party activities: Ondo APC expels Ajasin’s daughter",
    "summarized_story": "The Ondo State chapter of the All Progressives Congress has expelled former governorship aspirants of the party, Mrs Jumoke Anifowose and Mr Nathaniel Adojutelegan, for allegedly involving in anti-party activities.\nAnifowose is the daughter of a former governor of the state, Pa Adekunle Ajasin.\nWhen contacted, Anifowose denied any involvement in anti-party activities and rejected the action of the party, declaring that she could not be expelled from the party.\nShe said, “They cannot expel me; I’m the one that will expel them when the time comes.\nI didn’t engage in any anti-party activity.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Alleged anti-party activities: Ondo APC expels Ajasin’s daughter",
    "summarized_story": "The Ondo State chapter of the All Progressives Congress has expelled former governorship aspirants of the party, Mrs Jumoke Anifowose and Mr Nathaniel Adojutelegan, for allegedly involving in anti-party activities.\nAnifowose is the daughter of a former governor of the state, Pa Adekunle Ajasin.\nWhen contacted, Anifowose denied any involvement in anti-party activities and rejected the action of the party, declaring that she could not be expelled from the party.\nShe said, “They cannot expel me; I’m the one that will expel them when the time comes.\nI didn’t engage in any anti-party activity.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Mobile networks block use of Twitter in Nigeria",
    "summarized_story": "By Kazeem UgbodagaMobile telecommunications networks have blocked use of Twitter in Nigeria following the ban by the Federal Government on Friday.\nThe Federal Government had placed indefinite suspension on Twitter in Nigeria after it removed an offensive tweet by President Muhammadu Buhari.\nAs at Saturday, Nigerians using Glo, Airtel, MTN, 9mobile could not access their twitter accounts, as it showed: “this site can’t be reached.”But using Smiles network, twitter accounts could still be accessed as at Saturday morning.\nThe Buhari government announced an indefinite suspension of Twitter in Nigeria on Friday, fueling an uproar in the country.\nTwitter said the tweets violated its rules."
  },
  {
    "headline": "Lutheran Church, Delta to tackle irregular migration, human trafficking",
    "summarized_story": "The Lutheran Church of Christ in Nigeria is partnering with Delta Government in the fight against irregular migration and human trafficking.\nPanti noted that Lutheran Church, founded in 1913, established the Symbols of Hope Nigeria project to contribute toward addressing illegal migration and human trafficking.\nHe added that activities of the organisation included awareness creation and advocacy against irregular migration and human trafficking.\n“We are aware of the work that your government is doing to curtail irregular migration and human trafficking, and we are aware of your giant strides in ensuring security in Delta.\nResponding, the governor praised the church and described it as a worthy partner, adding that the government would partner it and other faith-based organisations to curb irregular migration and human trafficking."
  },
  {
    "headline": "Twitter’s suspension: Fayose begs God to save Nigeria from Buhari",
    "summarized_story": "By Kazeem UgbodagaFormer Governor of Ekiti State, Ayodele Fayose has prayed God to save Nigeria from President Muhammadu Buhari following suspension of Twitter in Nigeria.\nThe Federal Government on Friday suspended Twitter indefinitely in Nigeria, eliciting wild criticism and condemnation from Nigerians.\nReacting to the suspension, Fayose reiterated that it is only a ‘jonah’ in a ship that could make such pronouncement, suspending Twitter from the country.\n”I said it before and let me reiterate it again that it is only a ‘jonah’ in a ship that can make such pronouncement, suspending Twitter from the country.\n“God, please save us from President Buhari, ‘the jonah in our ship,” he tweeted."
  },
  {
    "headline": "BREAKING: Yoruba Nation Protest Hits Ekiti [Photos]",
    "summarized_story": "Yoruba nation activists have begun to converge at Ado Ekiti’s famed Fajuyi Park for a gathering organized by Ilana Omo Oodua, a socio-political group.\nThe arena is heavily guarded by security personnel, including police, the Department of State Services, and the Amotekun Corps.\nAn anonymous security worker stated they are at the venue “to avoid the collapse of law and order and guarantee that miscreants do not hijack the march.”The agitators further stated that they are prepared to form a Yoruba nation outside of Nigeria.\n“We are here in support of our agitation for Oodua nation,” Olusola Oyemakinde, one of the agitators and a member of the Oodua Action Movement, stated.\nFor us, the Yoruba nation is the answer.”More details later…"
  },
  {
    "headline": "Irate Youths Set Ablaze Truck Loaded With Cows In Anambra",
    "summarized_story": "Some irate youths in Awka, on Friday, set ablaze a truck loaded with cows, over the death of some children hawking wares at Kwata flyover junction in Awka, Anambra State capital.\nOur source was, however, unable to say if the driver of the truck and the truck attendant were spared at the time of filing this report.\nIt’s also learnt that there was massive shooting in the area by military personnel to disperse irate youths who stopped attempts to tow the truck off the road to make way for free flow of traffic.\nThe shooting in the area caused residents and even motorists to abandon their vehicles and flee for their lives.\nAttempts to speak to the Anambra State Police command’s spokesperson, DSP Toochukwu Ikenga for confirmation on the actual number of casualties was not possible as his phone was switched off."
  },
  {
    "headline": "This Is How To Use Twitter In Nigeria Despite Ban By Buhari’s Govt",
    "summarized_story": "A virtual private network (VPN) is a network that extends a private network across a public network.\nIt allows users to send and receive data through shared or public networks as though they were linked directly to the private network.\nBelow are a list of VPNs to download:NordVPN: it is fast, reliable, top-security, has a thirty-day money-back guarantee, and is used to access worldwide locations.\nExpressVPN: excelling in unblocking different content, fast, reliable, great streaming features, efficient applications, and excellent customer support.\nPrivateVPN: fast, reliable, and secure when streaming different Netflix content"
  },
  {
    "headline": "JUST IN: Aisha Buhari Deactivates Twitter Account",
    "summarized_story": "Aisha Buhari, Nigeria’s First Lady, has followed through on her threat by deactivating her Twitter account.\nMrs. Buhari said on Friday night that she would be deactivating her Twitter account in support of the Nigerian government’s decision to prohibit all Twitter activities in the country.\nShe wrote on Twitter: “I will be deactivating my twitter account for now.\nLong live Federal Republic of Nigeria”.\nAccording to a review by NEWS DIRECT, the first lady did actually deactivate her account, as it no longer exists on the platform."
  },
  {
    "headline": "Breaking: FG suspends Twitter indefinitely in Nigeria",
    "summarized_story": "The Federal Government has suspended, indefinitely, the operations ofthe microblogging and social networking service, Twitter, in Nigeria.\nThe Minister of Information and Culture, Alhaji Lai Mohammed,announced the suspension in a statement issued in Abuja on Friday, citing the persistent use of the platform for activities that are capable of undermining Nigeria’s corporate existence.\nThe Minister said the Federal Government has also directed theNational Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in Nigeria.\nDetails loading…Share this:TweetPrintTelegramWhatsApp"
  },
  {
    "headline": "Arms proliferation: Nigerians alarmed as insecurity heightens",
    "summarized_story": "The Chief of Defence Staff (CDS), Gen. Lucky Irabor, recently decried the proliferation of illegal arms in Nigeria, saying it was a threat to the country’s corporate existence.\nA security expert, Dr. Don Belema, in his view, blamed it on the lack of harmonious relationships among security agencies in arms proliferation and poor border management.\nWe need to look at it and see how to move regulations that could control small arms in the country.\n“There is a committee of federal government bodies that are in charge of small arms proliferation and prevention.\n“They should work and share intelligence not only with relevant national security agencies, but also neighbouring countries and regional organs like ECOWAS."
  },
  {
    "headline": "Breaking: Tuchel strikes fresh Chelsea deal",
    "summarized_story": "Chelsea manager Thomas Tuchel has signed a contract extension until the summer of 2024.\nTuchel, 47, signed an initial 18-month deal when he replaced Frank Lampard as Blues boss in January.\nHe led the club to victory in the Champions League final and a fourth-placed finish in the Premier League.\nChelsea were ninth in the Premier League and without a win in five games when Tuchel was appointed at the start of the year.\nThe London club also reached the FA Cup final, where they were beaten 1-0 by Leicester at Wembley."
  },
  {
    "headline": "Digital Economy: IT, Key To The Future, Says Westgate Boss -NigPilot",
    "summarized_story": "Despite the economic downturn occasioned by the COVID-19 outbreak and against the backdrop of the emerging digital economy, the information technology sector remains the key to the future.\nThis was disclosed by the managing director of Westgate Technologies, Mrs Ijeoma Ezeudu, on Thursday during the opening of a Westgate retail store in Abuja.\n“We’ve have been in this Abuja for the past 10 years but as a company, Westgate has been in existence for the past 16 years, we have that vision to take IT to the highest level.\nSo, despite the pandemic, it is quite challenging but we have to keep pushing,” she said.\nOn the impact of the COVID-19 pandemic on the company, Ezeudu said: “We can’t really quantify but all we know is all the SMEs have been affected."
  },
  {
    "headline": "Nigeria now has capacity to produce SIM cards, smartphones for Africa – Pantami -NigPilot",
    "summarized_story": "Nigeria has developed capacity to produce SIM cards and smartphones not only for the use of Nigerians alone but for the entire continent of Africa, Minister of Communications and Digital Economy, Ali Isa Pantami, has disclosed.\nSpeaking at the event organized by a support group known as APC Professionals Forum, Pantami said Nigeria has capacity to produce a minimum of 200 million SIMS annually.\n“When this administration came on board, even SIM cards were imported to Nigeria but as it is today, the federal government has provided an enabling environment for the private sector and as it is today, we have the capacity to produce SIM cards not only for our consumption but for the entire African continent.\n“We have the capacity to produce a minimum of 200 million SIMS annually.\nToday in Nigeria, we are producing smartphones.”"
  },
  {
    "headline": "Improve on Attahiru’s legacy, CNS tasks COAS -NigPilot",
    "summarized_story": "Chief of the Naval Staff (CNS), Vice Admiral Awwal Gambo has charged the newly appointed Chief of Army Staff (COAS), Major General Farouk Yahaya to improve on the legacy of his predecessor, late Lt. Gen. Ibrahim Attahiru.\nVice Admiral Gambo gave this charge when the new Chief of Army Staff (COAS) , Major General Faruk Yahaya paid him a courtesy visit at the Naval Headquarters.\nYou should equally pick up from where the late COAS, Lieutenant General Ibrahim Attahiru left from and improve upon those ideas”.\nEarlier, the Chief of Army Staff, Major General Faruk Yahaya said he was in the Naval Headquarters to formally inform the CNS that he had reported and taken over duty following his appointment as the 22nd COAS.\nMajor General Yahaya promised to ensure cooperation with other security agencies and stakeholders as the challenges confronting the security agencies are multi-faceted and would require a multi-faceted approach."
  },
  {
    "headline": "Accurate data for Persons with Disabilities ready soon- Lalu",
    "summarized_story": "The Executive Secretary Ncpwd Mr. James Lalu has pledged his support to the National Population Commission to ensure that disability data is not taken for laxity.\nIn his welcoming address the Executive Secretary National Commission for Persons with Disabilities Mr. James Lalu thanked the Coalition for putting together such initiatives.\nHowever, at the Global Disability Summit, disability data was on the front burner and so he will ensure that accurate data of persons with Disabilities in the upcoming 2022 Census are taken seriously.\nDr. Irene also urged the disability community to take ownership of the project and drive it to success.\nThe Executive Director of DINABI, Olajide Funso who spoke on Disability Data/Statistics in Nigeria according to him, unreliable, non-disaggregated, estimation-based and completely under-represented the disability community."
  },
  {
    "headline": "Twitter Restricted After FG’s Order To Telecos",
    "summarized_story": "Telecoms operators in Nigeria have restricted Twitter in Nigeria, a day after the Federal government announced its indefinite suspension.\nMr Adebayo noted that the association wished to confirm that its members had received formal instructions from NCC, the industry regulator, to suspend access to Twitter.\nCivil War TweetThe Federal Government of Nigeria on Friday announced the indefinite suspension of Twitter in the country.\nSeveral countries including China and Turkey have come under fire for putting restrictions on social media platforms such as Twitter.\nIn February Twitter condemned Myanmar for blocking access to its platform as part of a crackdown on social media, days after a coup that saw Aung San Suu Kyi and other civilian leaders jailed."
  },
  {
    "headline": "Police Council Confirms Alkali As IGP, Almost Two Months After Appointment",
    "summarized_story": "The Police Council has confirmed Usman Alkali Baba as the Inspector General of Police (IGP), almost two months after President Muhammadu Buhari approved his appointment.\nUsman Alkali was confirmed on Friday during a meeting of the council in Abuja presided over by President Buhari.\nHeightening InsecurityDingyadi had on April 6 announced President Buhari’s confirmation of Alkali as the replacement for Mohammed Adamu.\nBefore his new role, the Yobe-born police chief was the Deputy Inspector General of Police, Force Criminal Investigation Department, Force Headquarters in Abuja.\nHe had before then also met with commanders from the areas to profer solutions to the hike in insecurity in the regions."
  },
  {
    "headline": "Nigerians Start Getting Charged N6.98 For USSD Transactions",
    "summarized_story": "Many users of USSD services in Nigeria on Friday started to see a notice to pay N6.98 for each transaction session.\nUSSD is a critical channel for delivering financial services, especially for those who do not have access to physical banking infrastructure or internet services.\n“Welcome to USSD Banking,” one notice said.\n“Things are really getting harder in this country a whole 6.98 approximately 7.00 to use #USSD,” one Twitter user wrote.\n“Do they realize that people who mostly use #USSD can’t afford internet enabled devices talk more of data."
  },
  {
    "headline": "Uzodinma Accuses Opposition, Aggrieved APC Members Of Fueling Insecurity",
    "summarized_story": "﻿Governor Hope Uzodinma of Imo has accused the opposition and aggrieved members of the All Progressives Congress (APC) of fueling the rising levels of insecurity in the southeast state.\n“The opposition party and some aggrieved members of our party who are hiring boys from neigbouring states to come in here, allow me, I will deal with them.\nA chieftain of the All Progressives Congress (APC), Ahmed Gulak was killed by gunmen on Sunday, becoming the latest high-profile casualty in the insecurity that has enveloped Imo State.\nThe main opposition Peoples Democratic Party (PDP) had in the wake of the worsening security situation, asked Governor Uzodinma to resign, arguing that he (Uzodinma) has failed to secure the lives and property of the Imo people.\nThe PDP leader noted that emerging developments suggest that the governor has no answer to the spate of killings in the state."
  },
  {
    "headline": "Twitter Is A Source Of Livelihood For Youths, Makinde Appeals To FG To Reverse #TwitterBan",
    "summarized_story": "Oyo State Governor, Seyi Makinde, has urged the Federal Government to reverse its suspension of the microblogging site, Twitter, noting that the platform is a source of livelihood for many Nigerian youths.\n“We should also remember that Twitter has gone beyond a source of communication for many of our hardworking youths in Nigeria.\nIt has become a source of livelihood for many, irrespective of their political affiliations or religious leanings.\nThe governor urged leaders to shun emotional reactions noting that Twitter is a platform Nigerians use to exercise their fundamental right.\nTwitter SuspensionSeyi Makide’s statement is in reaction to the announcement by the Federal Government of Nigeria suspension of Twitter in the country."
  },
  {
    "headline": "Updated: Heavy security in Ekiti over planned protest by Yoruba nation agitators",
    "summarized_story": "Vehicle Movement were restricted this Morning around the Popular Fajuyi Round-about in Ado Ekiti as Yoruba Nation Agitators held the State Capital to a Standstill.\nEarlier, Military Personnel were deployed to Strategic Points to Forestall a Breakdown of Law and Order, as Thousands of Ekiti indigenes are seen on foot making their way to the Fajuyi Park.\n#HappeningNow Heavy Security in Ado Ekiti, Ekiti State capital, as Yoruba Nation agitators stage peaceful rally.\npic.twitter.com/OaqKgH3Bmd — TVC News (@tvcnewsng) June 5, 2021"
  },
  {
    "headline": "Trailer laden with cows kills two, several injured at Kwata traffic junction",
    "summarized_story": "A trailer on Friday rammed into hawkers at Kwata junction, Awka, Anambra State and reportedly killed about two persons, several injured.\nEyewitness account revealed that two children hawking at the traffic point at Kwata junction flyover were killed by a lorry carrying cows.\nThe incident that injured four occupants of two Sport Utility Vehicles, saw the youths in the area quickly mobilised and set the lorry, including the cows ablaze.\n#InCaseYouMissedIt Two persons killed and several others injured on Friday, as trailer rammed into hawkers at Kwata junction, Awka, Anambra State.\nAdvertisement Eyewitness account revealed that the victims were two children hawking at the traffic point, Kwata junction flyover."
  },
  {
    "headline": "NDLEA seizes 34,950 Tramadol, Diazepam capsules going to Borno in Lagos",
    "summarized_story": "A total of 34,950 capsules of Tramadol and Diazepam suspected to be heading to insurgents’ camps in Borno state have been intercepted and seized by operatives of the National Drug Law Enforcement Agency, NDLEA, in Lagos.\nA 25-year-old Mohammed Isah, recruited to move the drugs from Lagos to Borno was arrested on Tuesday 1st June, 2021 at SD Motors park, Agege, Lagos with 12, 390 capsules of Tramadol weighing 4.8kg and 22,560 tablets of Diazepam with a total weight of 14kg, bringing the total weight of the exhibits to 18.8kg.\nHe said Kakali advised him to either board a Tanker or Trailer from Lagos to Maiduguri to avoid being caught.\nHe agreed but rather travelled in a bus operated by SD Motors from Lagos to Kano and then take another vehicle to Maiduguri.\nInvestigations revealed that before Mohammed’s arrest, Kakali had travelled out of Lagos to Maiduguri to await the arrival of the consignment."
  },
  {
    "headline": "‘It Won’t Work, Nigerians Will Bypass Weak Firewalls’: Activist Sowore on Twitter Ban",
    "summarized_story": "Social activist and Convener of #Revolutionnow campaign Omoyele Sowore has called on Nigerians to rise up against President Muhammadu Buhari whose “stone age mentality” has resulted to a ban of operations of microblogging site Twitter in Nigeria.\nHe said this on Saturday when he featured on an ARISE News programme, The Morning Show noting that the only solution to removing such leaders is revolution.\nHe wondered why the Nigerian leader will ban Twitter which he says is a means of peaceful engagement by citizens.\nWatch the video…"
  },
  {
    "headline": "Omoyele Sowore Talks Activism, Twitter Ban and Getting ‘Shot By Police’",
    "summarized_story": "Social activist and Convener of #Revolutionnow campaign Omoyele Sowore featured on ARISE News’ Morning Show on Saturday.\nHe spoke on a range of issues centred around activism, including being “targeted for elimination by the Nigerian government and how he was shot at by policeHe also called on Nigerians to rise up against President Muhammadu Buhari whose “stone age mentality” has resulted to a ban of operations of microblogging site Twitter in Nigeria.\nHe wondered why the Nigerian leader will ban Twitter which he says is a means of peaceful engagement by citizens.\nWatch the engaging interview."
  },
  {
    "headline": "‘There is Stuff’: Enduring Mysteries Trail US Report on UFOs",
    "summarized_story": "A report summarizing what the U.S. knows about “unidentified aerial phenomena” — better known as UFOs — is expected to be made public this month.\nTwo officials briefed on the report say it found no extraterrestrial link to the sightings reported and captured on video.\nWhile the broad conclusions have now been reported, the full report may still present a broader picture of what the government knows.\n“It’s rotating.”In 2019, the Navy announced it would create a formal process for its pilots to report unidentified aerial phenomena or UAPs.\nYet the formation of the task force stood as a rare acknowledgement from the government that UFOs posed a potential national security concern."
  },
  {
    "headline": "UN Warns Famine Imminent in Ethiopia’s Embattled Tigray Region",
    "summarized_story": "The United Nations humanitarian chief has warned that famine is imminent in Ethiopia’s embattled Tigray region as well as the country’s north and there is a risk that hundreds of thousands of people or more will die.\nMark Lowcock said the economy has been destroyed along with businesses, crops and farms and there are no banking or telecommunications services.\n“We are hearing of starvation-related deaths already,” he said in a statement released on Friday.\n“There are now hundreds of thousands of people in northern Ethiopia in famine conditions.\n“Prime Minister Abiy Ahmed needs to do what he said he was going to do and force the Eritreans to leave Ethiopia,” he said."
  },
  {
    "headline": "Canada’s Trudeau Blasts Catholic Church for Ignoring Role in Indigenous Schools",
    "summarized_story": "“As a Catholic, I am deeply disappointed by the position the Catholic Church has taken now and over the past many years,” Trudeau told reporters.\nRun by the government and church groups – the majority of them Catholic – the schools’ stated aim was to assimilate indigenous children.\nFrom 1893 to 1969, a Catholic congregation called the Missionary Oblates of Mary Immaculate ran the Kamloops school, which was once Canada’s largest.\n“We do want an apology” from the Catholic Church, Casimir said.\n“The Catholic Church as a whole in Canada was not associated with the residential schools, nor was the Canadian Conference of Catholic Bishops,” it said."
  }
]