[
  {
    "headline": "Awosika seeks more women in leadership positions",
    "summarized_story": "Renowned entrepreneur and banking guru, Mrs. Ibukun Awosika, has said there is a need to strategically take women to leadership positions.\nAccording to a statement, Awosika spoke during the inaugural International Woman Leadership Conference of The Ibukun Awosika Leadership Academy.\n“Women have so much power, but they have silos power; once you have silos power, it is disconnected.\nIf we take women to the top, we need to be deliberate, and we need to be strategic”.\nThey spoke on the importance of building tribes as women, the benefits of support systems, and overcoming ingrained biases in society."
  },
  {
    "headline": "Gombe: Mother, daughter, one other die as transformer explodes",
    "summarized_story": "at Yaunde, Tumfure Akko Local Government Area of Gombe State resulted in the death of no fewer than three persons, including a mother and her daughter.\nAccording to sources, the tragedy occurred when a transformer exploded due to the heavy wind that blew the high tension cable to touch the service line that brought power to the transformer.\nOur correspondent gathered that the mother of four, identified simply as Mrs. Patrick, died with her daughter.\nShe was said to have woken up following the sudden power surge to switch off her refrigerator but was electrocuted.\nWe are still investigating the cause of the incident, but the interim report said it was due to a power surge,” he said."
  },
  {
    "headline": "Nigeria Startup Bill: Senators assure quick passage as youths protest at NASS",
    "summarized_story": "No NSB no votes—groupA coalition of youth groups, yesterday, held a rally at the National Assembly, NASS, to demand the speedy passage of the Nigeria Startup Bill,NSB.\nGovernment now has a huge opportunity with the Nigeria startup bill to give Nigerian youths something they can use to create a pathway for themselves.”Okoro noted that the bill before NASS can create thousands of high-paying jobs if passed into law.\nHe also urged the legislators to leave a legacy by passing what he described as the most consequential bill for young people in Nigeria.\nAccording to him, “I believe this bill will make Nigeria a destination for foreign investments and would strengthen our digital economy.\nSince the bill arrived at the National Assembly, several members have lent their support towards its passage."
  },
  {
    "headline": "NPA partners Police, LASG to curb extortion along port corridor",
    "summarized_story": "By Godwin OritseThe Nigerian Ports Authority, NPA, has enlisted the support of the Nigerian Police in curbing the activities of extortionists and other forms of illegalities along the roads leading to Apapa and TinCan Island Port Complex.\nThis is said to be in line with the implementation of action points in the Memorandum of Understanding (MOU) between the NPA and the Lagos State Government (LASG) on truck traffic control and enforcement in Apapa and environs signed on 8th March, 2022.\nHe got the consent of the two Police chiefs to join the NPA management for an on-the-spot check of the port access road to ascertain the reality on the ground.\nThe check which was conducted last Sunday had in attendance the NPA management, the two AIGs, Lagos State Commissioner of Police and representative of the Lagos State Government.\nWith this partnership between the NPA and the two Police Commands whose jurisdiction covers the Lagos maritime logistics ring, it is expected that those conducting business in the ports will heave a sigh of relief."
  },
  {
    "headline": "Stakeholders fault SON over quest for presence in-ports",
    "summarized_story": "We have seen it with National Drug Law Enforcement Agency, NDLEA and it is now SON.\n“Moreover, SON has access to all shipping manifests and usually blocks all SON-related imports through the Nigerian Customs Service.\nWithout SON release authorisation, signed and endorsed by the Customs Area Command, CAC, your release and clearance of such SON-related imports is dead on arrival.\nOkorefe explained that “SON has never left the ports at any time; they are ubiquitous for cargo examination at the ports.\n“Across all the terminals, the SON designated staff are available and monitors the cargo physical examination."
  },
  {
    "headline": "Invest in your country, Gambari urges Nigerians",
    "summarized_story": "Prof. Ibrahim Gambari, Chief of Staff (CoS) to President Muhammadu Buhari, has urged Nigerians to cultivate the habit of investing in the country to address employment challenges.\nGambari made this call on Wednesday at 30th Anniversary and 14th Convocation Lecture of the Delta University (DELSU), Abraka.\nOn the insecurity situation in the country, Gambari called for all inclusiveness in nipping the situation in the bud.\nSpeaking on the importance of education, Gambari said that education was a driving force for a developing country, noting, however, that it was not a guarantee to success.\n“Over the years, DELSU has recorded tremendous successes in scope and infrastructural development,” Gambari said."
  },
  {
    "headline": "NLC seeks FG intervention in ASUU strike",
    "summarized_story": "Ayuba WabbaThe Nigeria Labour Congress (NLC) has called on the Federal Government to address issues that necessitated the ongoing strike by the Academic Staff Union of Universities(ASUU) and other unions in tertiary institutions.\nPresident of NLC, Ayuba Wabba, made the call when he addressed newsmen shortly before going into a closed door meeting of the Congress’s Central Working Committee (CWC) on Wednesday in Abuja.\nRecall that ASUU embarked on a nationwide warning strike to press home its members’ demands from Feb. 14.\nThe lecturers’ demands include; funding of the Revitalisation of Public Universities, Earned Academic Allowances, University Transparency Accountability Solution (UTAS) and promotion arrears.\nOn the upcoming political dispensation in the country, Wabba called on union leaders to defend democracy and rights of the working class."
  },
  {
    "headline": "China confirms first human case of H3N8 bird flu",
    "summarized_story": "China has confirmed the first human infection of the H3N8 strain of bird flu in Zhumadian within Henan province.\nThe National Health Commission (NHC) announced the case in a statement, adding that the risk of spread was low.\nThe H3N8 variant was previously detected in some countries in horses, dogs, birds and seals.\nBird flu causes aching muscles, fever, headache, cough and diarrhoea.\nOthers are chest pain, stomach pain, conjunctivitis, and bleeding from the nose and gums."
  },
  {
    "headline": "Jigawa: Police direct investigation into alleged extra-judicial killing by NDLEA officials",
    "summarized_story": "The Jigawa State Commissioner of Police CP Aliyu Sale Tafida has directed a thorough and clinical investigation into alleged extra-judicial killing by National Drug Law Enforcement Agency, NDLEA, officials.\nThis was contained in a statement signed by the command spokesman ASP Lawan Shiisu Adam issued to DAILY POST.\nDAILY POST reported that the National Drugs Law Enforcement Agency (NDLEA) personnel have allegedly killed a 25-year-old man Murtala Gambo at Sundimina Village in Birnin Kudu local Government while on patrol.\nHe urged the law enforcement agencies to act in accordance with the Standard Operational Procedures (SOP) of the force and other extant laws guiding their overall conduct.\nShiisu also called on sister security agencies to always report to the Divisional Police Officers before they embark on any operations."
  },
  {
    "headline": "Eid-el Fitr: FRSC deploys 978 personnel, special marshals in Bauchi",
    "summarized_story": "This was contained in a statement made available to journalists in Bauchi on Wednesday by the Sector Commander, Yusuf Abdullahi.\nAccording to Abdullahi, the personnel would be deployed in five major routes in and out of the state, adding that the special Eid-el Fitr patrol operation would hold between 28th April and 4th May, 2022.\nHe added that all security agencies’ networks are all connected for prompt response and synergy for hitch-free Sallah celebration.\n“Operation activities remain 24/7 throughout the seven days of the operation,” the sector commander stated.\nHe added that station offices in the 20 local government areas of the state are fully activated for prompt response to road traffic issues, clear obstructions, road traffic crashes, public enlightenment and traffic control."
  },
  {
    "headline": "Umar seeks international help for release of kidnapped Kaduna-Abuja train passengers",
    "summarized_story": "Col. Abubakar Dangiwa Umar (rtd), former Kaduna State military administrator, has asked the Federal Government to do more to secure immediate release of the victims following the release of photographs of Abuja-Kaduna train passengers kidnapped by terrorists on the 28th March, 2022.\nCol. Abubakar Dangiwa Umar also appealed to the international community to assist the federal government of Nigeria in the negotiations which will be needed with the terrorists to effect the release of the victims.\nDAILY POST recall that the terrorists had on Monday night released four photographs showing 62 victims in their captivity, including 18 women, five children and 39 men, including a foreigner.\nCol. Umar in a statement he issued on Wednesday described the sight of the victims in the photographs in a state of exhaustion and fear, as disturbing.\nHe appealed to the Federal government to do more to secure the immediate release of these innocent victims so that they would return back to their homes."
  },
  {
    "headline": "Banditry: Zamfara govt officially dethrones 3 traditional leaders",
    "summarized_story": "The Zamfara State Government has officially dethroned the three suspended traditional leaders accused of involvement in banditry activities in the state.\nThey further explained that the state government has also approved the immediate dethronement of the three traditional leaders accused of involvement in banditry activities.\n“We took the decision after careful examination of the reports submitted by the two committees to the State government,” they said.\nRecall that in June 2021, the three traditional leaders were accused of involvement in banditry activities by the state government, which led to their suspension and detention.\nDAILY POST reports that the three traditional leaders have been in the custody of the state government."
  },
  {
    "headline": "Why I want to be governor, by Omo-Agege",
    "summarized_story": "Why I want to be governor, by Omo-AgegeDeputy President of the Senate Ovie Omo-Agege has said he is in the governorship race to liberate the people from decades of misrule by the Peoples Democratic Party (PDP).\nHe spoke in Patani Local Government Area, when he received some chieftains of the PDP – John Agori; Perez Nduku and Godbless Abiamaowei – and their supporters, to the All Progressives Congress (APC).\nOmo-Agege also inaugurated the Delta Ijaw Support Group for Ovie Omo-Agege (DISGO 2023) at Tuomo, Burutu Local Government Area.\nThe governorship hopeful thanked the defectors for deciding to leave their comfort zone and join forces with the APC to liberate Delta state.\nIn their separate remarks, the defectors described the PDP as a party that encourages mediocrity, but lauded the development strides of the Deputy Senate President in his senatorial district."
  },
  {
    "headline": "Zenith Bank is Nigeria’s ‘Best Bank’",
    "summarized_story": "Zenith Bank Plc has emerged the Best Bank in Nigeria in the Global Finance Magazine’s Best Banks Awards.\nThe bank was recognised for its resilience and profitability in the face of Nigeria’s challenging macroeconomic environment.\nThe bank joined others from 36 countries in Africa at the prestigious Global Finance as winners in the 29th Annual Best Bank Awards.\nThe editors of Global Finance made the selections after consultations with corporate financial executives, bankers and banking consultants, and analysts worldwide.\nOur awards support decision-makers in selecting the best financial partners.”Zenith Bank’s track record of excellent performance has earned the brand numerous awards, including being voted as Best Commercial Bank in Nigeria in the World Finance Banking Awards 2021, Best Bank in Nigeria in the Global Finance World’s Best Banks Awards 2020 and 2021, Bank of the Year (Nigeria) in The Banker’s Bank of the Year Awards 2020, and Best in Corporate Governance ‘Financial Services’ Africa 2020 and 2021 by the Ethical Boardroom."
  },
  {
    "headline": "‘Why we bought N50m form for Abiodun’",
    "summarized_story": "A chieftain of All Progressives Congress (APC) in Ogun State, Armstrong Akintunde, has explained why a political support group, DA Mandate, raised N50 million to buy the second term nomination form for Governor Dapo Abiodun.\nAkintunde said the group wanted to appreciate Abiodun for his road and infrastructural development, education, agric, housing, health, employment creation, among others.\nHe said this development reinforced the group’s conviction to allow Abiodun continue governance beyond 2023.\nThe APC chieftain, who addressed reporters at the Iperu-Remo residence of Abiodun, added: “With the level of development, it is clear the second term ambition of Governor Dapo Abiodun would be a walk over.\n“Governor Dapo Abiodun has been exceptional with governance."
  },
  {
    "headline": "At 70, who is afraid of Tinubu?",
    "summarized_story": "Asiwaju Bola Tinubu was destined through selfless and fearless political exploits in the defunct Action Congress to alter political scenario and mocking narratives in the country.\nHe was elected as Federal Republic Senator under the platform of a progressive party, the Social Democratic Party (SDP) 1991-1993.\nIn all, Tinubu deployed resources and personal liberty for the growth of justice, equity and liberal democracy in the country.\nBola Ahmed Tinubu as former Lagos governor has paid his dues as a tested and pragmatic political leader-servant in Yoruba nation par excellence.\nWith every sense of responsibility Asiwaju Bola Ahmed Tinubu can become the next president if his party, APC fields his well-deserved candidature."
  },
  {
    "headline": "MURIC’s statement on Sanwo-Olu’s second term lacks merit",
    "summarized_story": "A Lagos based interest group, Advocate for Good Governance, Lagos State Chapter has cautioned the Muslim Right Concern (MURIC) group over what it described as the attempt of the religious group to destabilise the age long peaceful coexistence in Lagos State.\n“Gov Sanwoolu, once elected, automatically assumes the right to contest for another term of 4yrs, by the provision of the Nigerian constitution, even in spite of the fact that his predecessor was a Christian.\nHe said the unassailable position of the Lagos APC leadership is in tandem with the conclusive results of various independent opinion polls carried out in Lagos.\nHe said: “We advise MURIC to spend the next few years to diligently search for a competent and perhaps tested hand like the present incumbent to replace him in 2027.\nIn the meantime we seriously plead with religious organization to allow the wishes of the Lagos APC members as manifestly declared by the party leadership to prevail in the interest of good governance and developmental progress of Lagos which have been the hallmark of governor Sanwoolu’s positive impact In Lagos since his assumption of office.”"
  },
  {
    "headline": "APC set to disqualify aspirants over resignation",
    "summarized_story": "Governorship, Senate, Federal and State Assembly primary elections to select APC candidates for the general elections, according to the party’s timetable, would hold between May 18 and 23.\nExpectedly, appointees for such positions who did not resign would have lost whatever was left of their chances to contest in the primaries.\nThe APC primary for presidency, according to the ruling party’s timetable, has been scheduled to hold between May 30 and June 1.\nA Federal High Court in Umuahia had nullified Section 84(12) of the Electoral Act, recently passed the National Assembly.\nNgige, while daring the NWC of APC, said his decision was in line with the 1999 constitution."
  },
  {
    "headline": "Abia First Lady, Saraki’s wife eulogise The Sun Awards",
    "summarized_story": "Wife of Abia State Governor, Dr. Nkechi Ikpeazu, as well as wife of former President of the Senate and ex-First Lady of Kwara State, Toyin Saraki, have eulogised The Sun Awards, saying the recognition is well-thoughtout.\nWhile Mrs. Ikpeazu will receive Most Supportive First La-dy award for 2021, Mrs Saraki will be honoured with Humanitarian Service Icon award also for 2021.\n“I know this is a unique award and not every First Lady in the country has received one.\nThe Sun MD said Mrs. Saraki, through Wellbeing Foundation Africa, is tackling many challenges faced by women, children and the less-privileged in Nigeria and beyond.\n“In 2004, when you were the First Lady of Kwara State, you founded the Wellbeing Foundation Africa to drive your mission."
  },
  {
    "headline": "Senate criminalises ransom payment to kidnappers",
    "summarized_story": "From Fred Itua, AbujaThe Senate, yesterday, passed a bill seeking to amend the Terrorism (Prevention) Act 2013, and to prohibit the payment of ransom to kidnappers in the country.\nThe passage of the bill followed the consideration of a report by its Committee on Judiciary, Human Rights and Legal Matters.\nIn the memoranda presented to the committee, several issues relating to terrorism and terrorism financing in line with global best practices were raised.\nBamidele, in his presentation, said the bill sought to outlaw the payment of ransom to abductors, kidnappers and terrorists for release of any person who has been wrongfully confined, imprisoned or kidnapped.\nHe emphasised that the proposed repeal and enactment bill was geared towards improving the effectiveness of countermeasures against terrorism, terrorism financing and proliferation financing."
  },
  {
    "headline": "$418m Paris Club Refund: Court grants substituted service of contempt charge against four SANs",
    "summarized_story": "A Federal High Court in Abuja has ordered that contempt charge be served on four senior lawyers involved in the $418 million Paris Club refund suit through Courier services.\nThe four Senior Advocates of Nigeria (SANs) are Sunday Ibrahim Ameh, Jubrin Okutepa, Garba Tetengi and Olumuyiwa Akinboro.\nThe contempt charge was initiated against them by a private company, Panic Alerts and its sponsor, George Uboh, who accused the lawyers of engaging in wrongdoings in their service to their client.\nThe aggrieved applicants asked the court for an order to serve the contempt charge on the lawyers through a nominated courier company and by pasting same in their respective offices.\nHowever Justice Ekwo proceeded with the ex-parte application and granted the requests of the two applicants."
  },
  {
    "headline": "You’ve shown incapacity, unwillingness to tackle Nigeria’s problems, Afenifere tells Buhari",
    "summarized_story": "From Fred Ezeh, AbujaPan-Yoruba socio-political organisation, Afenifere, yesterday, accused President Muhamamdu Buhari of incapacity and unwillingness of tackling Nigeria’s problems.\nThe organisation said Nigeria needs a government of national unity to tackle its insecurity problems and midwife a new democratic government.\nThe communiqué signed by its National Publicity Secretary, Jare Ajayi, read: “The situation in the country is in a more decisive manner.\n“Afenifere is reiterating its position that restructuring of the Nigerian state must take place before the much-vaunted elections.\nWe also recommend that states that are ready must be allowed to establish their own Police Forces."
  },
  {
    "headline": "CIBN Donates 160-seater Lecture Theatre to ATBU",
    "summarized_story": "Segun AwofadejiAs part of its contribution to the development of banking and finance education in the country, the Chartered Institute of Bankers of Nigeria (CIBN) has officially commissioned a newly constructed multi- million Naira 160-seater lecture theatre it bequeathed to Abubakar Tafawa Balewa University (ATBU), Bauchi.\nThe theatre which is fully furnished and equipped with ultra – modern facilities is named ” THE CIBN BANKERS HALL” will serve as the melting pot for the training and development of future ready bankers.\nIn his address during the official commissioning ceremony of the Hall at the Gubi campus of the University, President and Chairman of Council of CIBN,Dr.\nVice Chancellor sir, I want to specifically request that you kindly help to drive the Linkage Programme in this Institution.\nAll students of Banking and Finance department and other related social science disciplines are expected to register as members of the institute, write the professional banking examinations and pay the annual subscription”, he pleaded."
  },
  {
    "headline": "Zenith Sustains Position as Nigeria’s Best Bank for Three Consecutive Years in Global Finance Award",
    "summarized_story": "Nume EkegheZenith Bank Plc has emerged as the Best Bank in Nigeria in the Global Finance Magazine’s Best Banks Awards 2022, retaining the award for a third consecutive year.\nThe bank was among other banks from 36 countries in Africa recognised as the prestigious Global Finance announced its 29th Annual Best Bank Awards Winners.\nThe editors of Global Finance made the selections after extensive consultations with corporate financial executives, bankers and banking consultants, and analysts worldwide.\nGlobal Finance considered factors that ranged from the quantitative objective to the informed subjective in selecting the top banks.\nFounded in 1987, Global Finance regularly selects the top performers among banks and other financial services providers, and the awards have become a trusted standard of excellence for the global financial community."
  },
  {
    "headline": "Osinbajo: I’ve Decided to Run, I Owe No One Else Any Allegiance",
    "summarized_story": "The Alake of Egbaland, Oba Adedotun Gbadebo, while praying for the vice president at his palace, also attested to the fact that Osinbajo was competent to run.\nOsinbao stated, “The vice president position is an opportunity to serve and I have served with utmost loyalty.\nHe said the vice president also stood by him during his governorship battle in 2019.\nYou are serving this country and the president meritoriously for the last seven years as the vice president.\nThe paramount ruler of Remoland, Oba Babatunde Ajayi, in his remarks, said the vice president was competent with requisite qualifications to lead the country."
  },
  {
    "headline": "Pregnant Woman Abducted in Kaduna-bound Train Delivers in Captivity",
    "summarized_story": "Also, the terrorists who attacked and abducted the passengers have released four different pictures of their victims, numbering 62.\nNine persons, including a young medical doctor were killed during the attack, scores were injured and over 62 other passengers kidnapped.\n“We humbly request for your facilitation to ensure that the federal government is in touch with the victims families.\nHowever, the pregnant women among the kidnapped train passengers was quoted by a family source, according to Arise, as having given birth at the weekend.\nWe can also report that the terrorists are demanding the release of their top commanders in exchange for the abducted train passengers."
  },
  {
    "headline": "Elon Musk Reaches Agreement to Acquire Twitter for $44bn",
    "summarized_story": "•Over 40 million Nigerians on microblogging platformWorld’s richest man, billionaire Elon Musk has reached an agreement to acquire Twitter for approximately $44 billion, the company said.\n“Twitter has a purpose and relevance that impacts the entire world,” its CEO Parag Agrawal said in a tweet.\nMusk, a prolific Twitter user, has said it needs to be taken private to grow and become a genuine platform for free speech.\nMusk unveiled his intention to buy Twitter on April 14, and take it private via a financing package comprised of equity and debt.\nMusk did not provide any financing details when he first disclosed his offer for Twitter, making the market skeptical about its prospects."
  },
  {
    "headline": "Ogun Governor, Abiodun Confirms He Was Arrested For Fraud In USA, Warns APC Party Not To Disqualify Him For 2023",
    "summarized_story": "Ogun State Governor, Dapo Abiodun, has said his arrest in the United States over credit card fraud and forgery in 1986 is not sufficient grounds for his disqualification by the All Progressives Congress (APC).\nGovernor Dapo AbiodunSofela had warned that the party might lose the governorship seat in Ogun due to Abiodun’s criminal history and its concealment from the Independent National Electoral Commission (INEC) despite swearing an oath.\nThe governor was said to have used a pseudo name (Shawn Michael Davids) with the aim of concealing his criminal identity.\nThe record revealed that Abiodun was jailed for committing criminal offences which bordered on credit card fraud, petty theft and check forgery.\nHe was arrested on November 7, 1986, for fighting and injuring a police officer in an attempt to resist arrest."
  },
  {
    "headline": "Ogun Governor, Abiodun Confirms He Was Arrested For Fraud In USA, Warns APC Party Not To Disqualify Him For 2023",
    "summarized_story": "Ogun State Governor, Dapo Abiodun, has said his arrest in the United States over credit card fraud and forgery in 1986 is not sufficient grounds for his disqualification by the All Progressives Congress (APC).\nGovernor Dapo AbiodunSofela had warned that the party might lose the governorship seat in Ogun due to Abiodun’s criminal history and its concealment from the Independent National Electoral Commission (INEC) despite swearing an oath.\nThe governor was said to have used a pseudo name (Shawn Michael Davids) with the aim of concealing his criminal identity.\nThe record revealed that Abiodun was jailed for committing criminal offences which bordered on credit card fraud, petty theft and check forgery.\nHe was arrested on November 7, 1986, for fighting and injuring a police officer in an attempt to resist arrest."
  },
  {
    "headline": "EXCLUSIVE: Terrorists Ambush Nigerian Army In Buhari’s Home State, Kill Two Soldiers, Injure Many Others",
    "summarized_story": "Two Nigerian Army personnel have been killed by Improvised Explosive Device planted by terrorists in an ambush in Katsina State.\nSaharaReporters learnt that other soldiers also sustained various degrees of injuries while a patrol vehicle conveying the troops was burnt.\nThe deceased were identified as Salami Dare (12NA/68/5958) and Hayatudeen Armayau (18NA/77/0055).\nThe soldiers were said to be on a special operation at Kaiga community when one of their vehicles stepped over the planted IED.\nOwn cas KIA 2, 12NA/68/5958 LCp Salami Dare and 18NA/77/0055 pte Hayatudeen Armayau."
  },
  {
    "headline": "EXCLUSIVE: Terrorists Ambush Nigerian Army In Buhari’s Home State, Kill Two Soldiers, Injure Many Others",
    "summarized_story": "Two Nigerian Army personnel have been killed by Improvised Explosive Device planted by terrorists in an ambush in Katsina State.\nSaharaReporters learnt that other soldiers also sustained various degrees of injuries while a patrol vehicle conveying the troops was burnt.\nThe deceased were identified as Salami Dare (12NA/68/5958) and Hayatudeen Armayau (18NA/77/0055).\nThe soldiers were said to be on a special operation at Kaiga community when one of their vehicles stepped over the planted IED.\nOwn cas KIA 2, 12NA/68/5958 LCp Salami Dare and 18NA/77/0055 pte Hayatudeen Armayau."
  },
  {
    "headline": "EXCLUSIVE: Terrorists Ambush Nigerian Army In Buhari’s Home State, Kill Two Soldiers, Injure Many Others",
    "summarized_story": "Two Nigerian Army personnel have been killed by Improvised Explosive Device planted by terrorists in an ambush in Katsina State.\nSaharaReporters learnt that other soldiers also sustained various degrees of injuries while a patrol vehicle conveying the troops was burnt.\nThe deceased were identified as Salami Dare (12NA/68/5958) and Hayatudeen Armayau (18NA/77/0055).\nThe soldiers were said to be on a special operation at Kaiga community when one of their vehicles stepped over the planted IED.\nOwn cas KIA 2, 12NA/68/5958 LCp Salami Dare and 18NA/77/0055 pte Hayatudeen Armayau."
  },
  {
    "headline": "Re-election bid: Dapo Abiodun writes APC, says petition on 1986 fraud conviction claim 'baseless'",
    "summarized_story": "Dapo Abiodun, governor of Ogun, has written to the All Progressives Congress (APC), asking the party to disregard a petition seeking to disqualify him from seeking a second term in office.\nResponding in a letter to APC by his counsel, Afe Babalola & Co., Abiodun described the allegations as “baseless” and urged the national leadership of the party to ignore the claims.\nTherefore, the party has no vires to prevent our client from contesting any election under its banner.\nWe also urge the party not to give credence to any rumour which may scuttle the party’s chances in the said election.\n“Finally, we pray that the petition should be disregarded as it is fraught with falsehood, speculation, inaccuracies.”"
  },
  {
    "headline": "Re-election bid: Dapo Abiodun writes APC, says petition on 1986 fraud conviction claim 'baseless'",
    "summarized_story": "Dapo Abiodun, governor of Ogun, has written to the All Progressives Congress (APC), asking the party to disregard a petition seeking to disqualify him from seeking a second term in office.\nResponding in a letter to APC by his counsel, Afe Babalola & Co., Abiodun described the allegations as “baseless” and urged the national leadership of the party to ignore the claims.\nTherefore, the party has no vires to prevent our client from contesting any election under its banner.\nWe also urge the party not to give credence to any rumour which may scuttle the party’s chances in the said election.\n“Finally, we pray that the petition should be disregarded as it is fraught with falsehood, speculation, inaccuracies.”"
  },
  {
    "headline": "I solemnly accept to run for president, says Nwajiuba as support group presents APC forms",
    "summarized_story": "Chukwuemeka Nwajiuba, minister of state for education, has accepted the expression of interest and nomination forms of the All Progressives Congress (APC) presented to him to contest the presidency.\nTheCable had reported that a support group known as Project Nigeria, on Wednesday, procured both forms for Nwajiuba to contest the presidential election.\nOn Wednesday, the group, during an event, presented both forms to the minister of state for education, in Abuja.\nAdvertisement“I now solemnly accept to run for us all and bear our party’s flag into the elections and become our next president.\n“This is the path I propose to tread, having been properly schooled, experienced and tested in the last 30 years of active politics.”"
  },
  {
    "headline": "I solemnly accept to run for president, says Nwajiuba as support group presents APC forms",
    "summarized_story": "Chukwuemeka Nwajiuba, minister of state for education, has accepted the expression of interest and nomination forms of the All Progressives Congress (APC) presented to him to contest the presidency.\nTheCable had reported that a support group known as Project Nigeria, on Wednesday, procured both forms for Nwajiuba to contest the presidential election.\nOn Wednesday, the group, during an event, presented both forms to the minister of state for education, in Abuja.\nAdvertisement“I now solemnly accept to run for us all and bear our party’s flag into the elections and become our next president.\n“This is the path I propose to tread, having been properly schooled, experienced and tested in the last 30 years of active politics.”"
  },
  {
    "headline": "UK orders probe as MPs accuse lawmaker of watching pornography during plenary",
    "summarized_story": "The United Kingdom whips’ office says it has opened an investigation into claims that a member of parliament (MP) watched pornography on his phone in the House of Commons chamber.\nThe MP, whose name wasn’t given, was reportedly caught watching the explicit content by two other lawmakers.\nHarriet Harman, a Labour MP and the vice-chairman of the women in parliament all-party parliamentary group, was said to have described the action of the lawmaker as inappropriate.\nAdvertisement“I don’t think anyone would think it’s appropriate in any place of work for people to be watching porn,” she was quoted as saying.\n“The standards committee is reviewing the MPs’ code of conduct."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "CAR becomes first African country to legalise crypto",
    "summarized_story": "The Central African Republic (CAR) has just become the first African country to adopt bitcoin as a legal tender.\nAfter El Salvador, CAR is just the second country in the world to legalise it.\nKenya, Nigeria, Togo, South Africa, Ghana, and Tanzania are also featured in its Top 20 Global Crypto Adoption Index.\nIn fact, at 11%, CAR has the fifth-lowest internet penetration rate in Africa, and this brings into question the feasibility of crypto adoption in the country.\nNot sure how BEAC (central bank for 6 central African countries that use XAF currency tied to Euro) will react."
  },
  {
    "headline": "Techstars accelerator solidifies Lagos as Africa’s most attractive tech hub",
    "summarized_story": "Techstars, one of the most influential accelerators in Africa, announced on Tuesday the ARM Labs Lagos Techstars Accelerator for early-stage fintech and proptech startups across the continent.\nWhile the accelerator will be open to startups across the continent, the opportunity highlights the continued focus on Lagos as Africa’s fast-growing tech hub.\nThe ARM Labs Lagos Techstars Accelerator will be the second Techstars-hosted programme on the continent; the first was in South Africa.\nSince then, the accelerator programme has hosted more than 400 Techstars Startup Weekend events across 40 African countries.\nThe ARM Labs Lagos Techstars Accelerator Programme will also allow the partnering companies to tap into Africa’s ever-lucrative fintech sector."
  },
  {
    "headline": "Making sense of the Web3 buzz through the eyes of an African investor, founder, and designer",
    "summarized_story": "The Web3 buzz is more than just another Twitter trend.\nIn the Web1 era, the Internet was in its most basic form in the Web1 era, with primarily text-based websites that visitors on which visitors could not give feedback.\nIn the Web3 era, African creators can release their works on Facebook, for instance, as an NFT and get even more value.\nFor Chika Uwazie, Founder of decentralised autonomous organisation, Afropolitan DAO, the Web3 era means full access to the financial ecosystem.\nTechpoint Africa Blockchain SummitHowever, Hugbo pointed out that while the Web3 buzz opens up many opportunities through decentralisation, we still need to be cautious."
  },
  {
    "headline": "It’s raining licences; which company is next?",
    "summarized_story": "This is aimed at strengthening financial inclusion by expanding financial services to the unbanked and underbanked across the country.\nEthiopia’s plan to allow foreign mobile money servicesIt’s raining licences today, albeit a different type.\nThe Central Bank of Ethiopia (CBE) proposed a bill to allow foreign investors to provide mobile money services in Ethiopia.\nDon’t forget: A consortium led by Safaricom obtained the first private mobile telecommunications licence but lacks a permit for mobile financial services like M-Pesa.\nSince then, 95 companies have participated as of the Winter 2022 launch, about half of which are financial services providers, and 51 are from Nigeria."
  },
  {
    "headline": "How a search for infinite learning led Justin Irabor to the world of computer science",
    "summarized_story": "Full-stack engineer, TradeCoreHowever, despite the challenges and doubts about new ventures, he finds that he is fulfilled at the end of the day.\nFull-stack engineer, TradeCoreSoftware engineering called out to him when he was editor-in-chief at a startup, and every downtime had to be escalated to the technical team.\nI’m a full-stack engineer there.\nFull-stack engineer, TradeCoreAlthough Justin was sure about transitioning into software engineering, he didn’t escape the frustration that came with the move.\nBut Justin says his choice of Mogwai is to remind him to always take responsibility if he wants the best results."
  },
  {
    "headline": "Stanbic IBTC DiSEP: Empowering Nigerian Youths with Digital Skills",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:As part of its continued efforts to equip Nigerian youths with core digital skills, Stanbic IBTC has launched the second edition of the Digital Skills Empowerment Programme (DiSEP).\nTo bridge the gap and provide Nigerians, especially youths the opportunity to acquire digital skills, which will have a positive impact on the economy, Stanbic IBTC introduced the Digital Skills Empowerment Programme (DiSEP).\nDiSEP is an intensive program designed to train Nigerian youths in the most sought after professional certifications in emerging technology e.g.\nStanbic IBTC remains committed to equipping Nigerian youths with the requisite skills and knowledge for personal development and national growth.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team."
  },
  {
    "headline": "EMURGO Africa and Adaverse to Host Blockchain Founders Hangout in Lagos, Nigeria",
    "summarized_story": "This article is a Brand Press post.\nBrand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nRead on to learn more about EMURGO Africa and Adaverse.\nRead more about EMURGO Africa.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Obaseki approves price augmentation, as construction work picks up in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…hands over College of Education Ekiadolor to FG tomorrowThe Edo State Governor, Mr. Godwin Obaseki, has approved price augmentation of contracts for ongoing construction projects in the state to enable contractors cope with the recent increase in the price of construction materials.\nThe Commissioner, Edo State Ministry of Roads and Bridges, Hon Newton Okojie, disclosed this while briefing journalists after the weekly Executive Council (EXCO) meeting chaired by Governor Godwin Obaseki, at the Government House, Benin City.\nWith the approval, road construction projects are expected to pick up in Edo as the contracting firms are expected to return to site.\n“The Council approved the memo to create an augmentation of the prices of contracts that will enable our contractors to cope with the increase in the price of construction materials.\nHe said, “The Executive Council has approved the Edo State Policy on Aging which will provide social care and protection for senior citizens."
  },
  {
    "headline": "2023: PDP makes u-turn on zoning, begins screening Friday – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestPeoples Democratic Party (PDP) National Publicity Secretary, Mr. Debo Ologunagba, Tuesday, said that all those who had obtained the presidential forms were free to contest its presidential ticket regardless of zones.\nHowever, the PDP spokesman explained that the constitution gives all qualified Nigerians the right to contest and not be discriminated against.\nHe said even if the party decided to zone its presidential ticket, it would not stop anybody from contesting.\n“In 1999, the PDP zoned its presidential ticket to the South.\nThe Spokesman for Obi said it was regrettable that the party had decided to jettison the zoning arrangement of the party."
  },
  {
    "headline": "2023: Cross River State Governor joins presidential race – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…Consults with Buhari, leaders of the party.\nFollowing a consultative visit to President Muhammadu Buhari, Tuesday, Cross River State Governor, Professor Ben Ayade has declared his intentions to run for president in 2023.\nAyade who met with President Buhari behind closed doors said the President has given him the assurance to go ahead and run if he has the qualities.\nHowever, he said he will continue to consult widely with leaders of the party from the south-south region.\nRecall that the Cross River Governor recently defected from the opposition Peoples Democratic Party to the All Progressive Congress."
  },
  {
    "headline": "Iftar: lnsecurity is a common enemy bedeviling the country –Buhari – Nigerian Observer",
    "summarized_story": "President Muhammadu Buhari, Tuesday, appealed to all political parties in the country to keep elections and election-related differences aside and team-up with his administration’s drive to conquer insecurity in the country.\nThe President, while hosting the members of the business community and the leadership of political parties at Presidential Villa, Abuja, during an Iftar dinner, described insecurity as a ‘‘common enemy’’ bedeviling the country.\nOur country must be kept safe for progress and prosperity to be entrenched.\n‘‘We’ll equally continue to count on the support of the private sector to improve economic growth and create new job opportunities for our teeming population.\nHe said, ‘‘The fact that political leaders of various political parties are sitting with you today speaks volumes that you are truly a democrat and believe in the project of growing democracy in this country.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Nigerian fraud suspect extradited to U.S. over alleged $148,000 scam",
    "summarized_story": "Adedunmola Gbadegesin, a wire fraud suspect, was on Monday April 26, 2022, extradited to the United States where he is wanted in a case of conspiracy to commit wire fraud and money laundering.\nThe offences, according to a statement from the Economic and Financial Crimes Commission (EFCC), contravene Title 18, US Code, Section 1349 and 1956 (h) and carries a maximum jail term of 20 years.\nHis extradition was coordinated by the EFCC, following a request from the office of the Attorney General of the Federation, pursuant to a February 11, 2022 Order by Justice D.E Osiagor of the Federal High Court, Lagos, in Suit No.\nFHC/L/CS/765/21, which granted a request to extradite the suspect to the United States to answer to criminal charges bordering on romance scam, wire fraud and money laundering."
  },
  {
    "headline": "Nollywood actor, Yul Edochie welcomes son with second wife",
    "summarized_story": "Nollywood actor and producer, Yul Edochie has welcomed a son with his second wife, Judith Austin.\nThe actor who is married to May Edochie with whom he has four children, announced the birth of the son on Wednesday.\nMaking the announcement on Instagram with pictures of himself and the son, Yul wrote: “It’s time for the world to meet my son.\nBorn by my second wife @JudyAustin and I love him so much, just as much as I love my other children.”Meanwhile, May, his first wife, has reacted the development, calling on God to judge him.\nMay who commented on the post minutes after wrote: “May God judge you both.”Going through May’s Instagram page, she had shared a cryptic post hours before Yul made public the birth of his son."
  },
  {
    "headline": "Police reveal identity of drunk officer who killed two at Lagos party, launch investigation",
    "summarized_story": "Police in Lagos State says it has commenced investigation into the killing of two persons at a birthday party in Egbeda, just as it disclosed the identity of the errant officer as Inspector Mohammed Hussini.\n“Lagos State Commissioner of Police, CP Abiodun Alabi, fdc ordered an immediate full-scale investigation into circumstances surrounding the unfortunate incident.\n“While investigation is ongoing, findings so far reveal that the shooting was accidental and involved an off-duty police officer, Inspr Mohammed Hussini, serving at the State Headquarters, Ikeja.\n“Findings equally reveal that the off-duty officer is a friend of the celebrant, Ifeanyi aka Obama and was not at the party in any official capacity.\n‘Efforts are currently being intensified to apprehend the fleeing birthday celebrant while the officer involved is expected to turn himself in anytime soon."
  },
  {
    "headline": "Group buys N100m APC presidential nomination forms for Emeka Nwajiuba",
    "summarized_story": "A support, Project Nigeria, has purchased N100 million All Progressives Congress (APC) nomination forms for Emeka Nwajuiba, minister of state for education to contest for president in 2023.\nThe group took the forms for Nwajuiba on Wednesday at the party’s headquarters in Abuja.\nAbubakar Usman, special assistant on new media to senate president, who Ahmad Lawan, disclosed this in a tweet on Wednesday, said the presidential hopeful is the first to get the ruling party’s presidential forms.\n“The Minister of State for Education, Hon.\nChukwuemeka Nwajuiba becomes the first person to pick the APC Expression of Interest and Nomination Forms for the APC Presidential Primary as a group of Nigerians raised over N100m from where they purchased the forms for him,” he tweeted"
  },
  {
    "headline": "BREAKING: Wike Declares Lawmaker Wanted Over Attack On Rivers PDP Secretariat",
    "summarized_story": "Rivers State governor, Nyesom Ezenwo Wike, has declared a member of the House of Representatives, Hon.\nFarah Dagogo, wanted for allegedly hiring suspected cultists to attack the state secretariat of the Peoples Democratic Party (PDP) in Port Harcourt.\nFarah Dagogo wanted for hiring cultists to attack the Peoples Democratic Party (PDP) secretariat in Port Harcourt.\n“The Police must as a matter of urgency arrest Farah Dagogo, wherever he is, and must be made to face prosecution.\nADVERTISEMENT“Already, some the hoodlums hired by Farah Dagogo have been arrested and will be made to face the full wrath of the law.”"
  },
  {
    "headline": "9 Family Members Rescued As 2-storey Building Collapses In Imo",
    "summarized_story": "No fewer than nine persons have been rescued from a collapsed two-storey building situated at Area 5 Extension in Owerri West LGA, Imo State.\nThe Imo State government through Owerri Capital Development Authority (OCDA) has also sealed up the property, which was under construction.\nSpeaking at the site of the collapsed building, the OCDA General Manager, Engr.\nFrancis Chukwu, confirmed that the nine persons, who were trapped in the building, were rescued successfully.\nADVERTISEMENTThe OCDA helmsman cautioned developers against the use of substandard materials in building activities as the state government will deal decisively with defaulters."
  },
  {
    "headline": "SDGs: Nigeria Partners WHO On Tracking Progress On Water, Sanitation Goals",
    "summarized_story": "The Federal Government through the Ministry of Water Resources has partnered with the World Health Organisation (WHO) and other stakeholders to track progress made to improve access to water and sanitation services in line with the Sustainable Development Goals (SDGs).\n“GLAAS is in the Water, Sanitation and Hygiene (WASH) sector on governance, monitoring, finance, and human resources, it will help us to know where we are as a country.\n“An example is in the human resources; do we have enough human resources?\nADVERTISEMENTIn Nigeria, WHO has facilitated the review of Nigeria Water Quality Standards, WASH Guidelines for Health Facilities, water quality related Operating Guidelines of the National Environmental Sanitation Policy, and trainings on IPC/WASH protocols against Covid-19.\nThe latest GLAAS report, published in 2019, builds on the GLAAS 2017 report, where finance continues to be a major theme of the report."
  },
  {
    "headline": "SDGs: Nigeria Partners WHO On Tracking Progress On Water, Sanitation Goals",
    "summarized_story": "The Federal Government through the Ministry of Water Resources has partnered with the World Health Organisation (WHO) and other stakeholders to track progress made to improve access to water and sanitation services in line with the Sustainable Development Goals (SDGs).\n“GLAAS is in the Water, Sanitation and Hygiene (WASH) sector on governance, monitoring, finance, and human resources, it will help us to know where we are as a country.\n“An example is in the human resources; do we have enough human resources?\nADVERTISEMENTIn Nigeria, WHO has facilitated the review of Nigeria Water Quality Standards, WASH Guidelines for Health Facilities, water quality related Operating Guidelines of the National Environmental Sanitation Policy, and trainings on IPC/WASH protocols against Covid-19.\nThe latest GLAAS report, published in 2019, builds on the GLAAS 2017 report, where finance continues to be a major theme of the report."
  },
  {
    "headline": "JUST-IN: Explosion Kills 3 Soldiers In Katsina",
    "summarized_story": "No fewer than three Nigerian Army personnel have been killed by an Improvised Explosive Device (IED) planted by terrorists in Danmusa local government area of Katsina State.\nA military source told LEADERSHIP that the troops were on a special operation at Kaiga community when one of their vehicles stepped on the IED planted by the terrorists.\nThe source also said others, who were injured were rushed to an hospital in Katsina for medical care.\nThe source said, “They were on their way from Mara to Kaiga before they were ambushed by bandits who had planted IED at Kaiga.\nLikewise the Director of Defence Media Operations, Major General Benard Onyeuko, could not be reached too but video evidence from sources showed gory site of the attack."
  },
  {
    "headline": "BREAKING: Wike Declares PDP Governorship Aspirant Wanted",
    "summarized_story": "The Governor of Rivers State, Nyesom Wike, has declared Hon.\nFarah Dagogo wanted for allegedly hiring cultists to attack the Peoples Democratic Party (PDP) secretariat in Port Harcourt, the state capital.\nIn the light of this development, Governor Wike directed the Rivers State Police Command, CP Friday Eboka to arrest Hon.\nFarah Dagogo for hiring cultists who stormed the PDP secretariat in Port Harcourt, and disrupted the screening of aspirants for various elective positions.\nHon Dagogo was one of the first PDP aspirants to form to contest for the Governorship of Rivers state on 2023."
  },
  {
    "headline": "BREAKING: Sokoto Deputy Governor, SSG, CoS, 11 commissioners resign",
    "summarized_story": "Governor Aminu Tambuwal of Sokoto State, on Wednesday, accepted the resignation of his Deputy, Alhaji Manir Dan’iya, Secretary to the State Government (SSG), Malam Saidu Umar, and 11 other key political office holders in the state.\nA statement issued by Special Adviser to the Governor on Media and Publicity, Muhammad Bello, in Sokoto made this known on Wednesday.\nThe statement listed others, whose resignations were accepted by the governor, to include the Chief of Staff, Mukhtar Magori as well as Commissioners for Finance, Environment, Youths and Sports and Lands and Housing, Abdussamad Dasuki, Sagir Bafarawa, Bashir Gorau and Aminu Bala respectively.\nOthers are: Commissioners for Commerce, Works, Water Resources, Solid Minerals, Religious Affairs and Careers and Security, Bashir Gidado, Salihu Maidaji, Shuaibu Gwanda-Gobir, Abubakar Maikudi and Abdullahi Maigwandu and Retired Col. Garba Moyi respectively."
  },
  {
    "headline": "‘I’m Not Ashamed’ – Yul Edochie’s Mistress Turned Second Wife, Judy Austin Break Silence",
    "summarized_story": "Mistress turned second wife of Nollywood actor, Yul Edochie, Muoghalu Uchechukwu Judith, better known as Judy Austin, has responded to negative comments directed at her after the actor announced he welcomed a bouncing baby boy with her.\nNews Direct earlier reported that the father of four had taken to his Instagram to announce that he had welcomed a baby boy with his second wife, Judy Austin.\nBorn by my second wife @judyaustin1 And I love him so much, just as much as I love my other children,”This however led to a backlash on Justin’s Instagram page.\nResponding to the backlash, she wrote, “I am not ashamed to say I am nothing without you Jesus.\nI had to learn how to ride a bicycle on set and still shot the same film with it."
  },
  {
    "headline": "Terrorism Act: Senate prohibits ransom payment to kidnappers",
    "summarized_story": "The Senate has passed a bill seeking to amend the Terrorism (Prevention) Act, 2013, which will prohibit the payment of ransom to kidnappers in Nigeria.\nThe passage of the Terrorism (Prevention) Act 2013 (Amendment) Bill, 2022, followed the consideration of a report by the Committee on Judiciary, Human Rights, and Legal Matters.\nHe assured that the amendment to the Terrorism Act would set standards and regulatory system intended to prevent terrorist groups from laundering money through the banking system and other financial networks.\nHe emphasised that the proposed repeal and enactment Bill was geared toward improving the effectiveness of countermeasures against terrorism, terrorism financing, and proliferation financing.\nThe Senate, thereafter, adjourned the plenary session till May 10, 2022, for the Sallah break."
  },
  {
    "headline": "X-raying benefits of FirstMonie Wallet in service delivery",
    "summarized_story": "AMAKA IFEAKANDU looks at the milestones recorded with the use of Firstmonie Wallet in service delivery across the country.\nMobile WalletA mobile wallet is a virtual wallet that stores payment card information on a mobile device.\nMobile wallets are a convenient way for a user to make in-store payments and can be used at merchants listed with the mobile wallet service provider.\nFirstmonie Wallet track recordFirstBank’s Firstmonie Wallet has recorded milestone in terms of increase in number of users, volume and value of transactions on it’s platform.\nApart from upgrading the wallet and Wallet profile, FirstMonie Wallet has been recognised as Best Innovation Financial Year in 2020DescriptionFirstmonie Wallet is an electronic wallet that allows individuals the convenience of making and accepting payments electronically with their mobile numbers."
  },
  {
    "headline": "Pictures: Traders protest colleague’s death in Lagos",
    "summarized_story": "Traders in Computer Village, Ikeja the Lagos state capital on Wednesday protested over the killing of fellow trader, Chikere Obieshi by security operative belonging to the Mobile police Unit.\nThe protesters carried placards with different inscriptions demanding justice for their colleague.\nShare this: TwitterFacebook"
  },
  {
    "headline": "[Breaking] 2023: APC presidential aspirants swell as Ibikunle Amosun joins race as Danbaba dumps PDP",
    "summarized_story": "Ranks of Presidential aspirants within the fold of the ruling All Progressives Congress (APC), swell up with declaration of Senator Ibikunle Amosun on the floor of the Senate Wednesday.\nHe said a formal declaration to that effect , will take place at the Shehu Musa Yar’Adua Centre in Abuja on the 5th of May 2022.\nDeclaration of Amosun for Presidential position in 2023 , makes the total number of aspirants in APC to be 17 now.\nEarlier before Amosun’s declaration , the deputy minority whip of the Senate , Senator Ibrahim Abdullahi Danbaba (Sokoto South ), defected from PDP to APC on alleged crisis rocking the party in North West Senatorial Zone .\nDetails loading…Share this: TwitterFacebook"
  },
  {
    "headline": "Nigeria’s Petroleum Ministry announce dates for NIES 2023",
    "summarized_story": "By Onu OkorieNigeria’s Federal Ministry of Petroleum Resources has unveiled plans for the 6th edition of the Nigeria International Energy Summit (NIES 2023).\nThe official Oil and Gas meeting of the Federal Republic will take place in Abuja from April 16th to 20th, 2023.\nIn an online media broadcast, Chief Timipre Sylva, Honourable Minister of State for Petroleum Resources, said “NIES 2023 is primed to be a show stopper as it will be the valedictory edition of this administration”.\n“N.I.E.S has grown from year to year and remains the definitive platform, not just for Nigeria, but also for Africa to engage the global energy community”, Shindi said.\nN.I.E.S is a federal government of Nigeria official energy industry event with the Federal Ministry of Petroleum Resources and all its parastatals including the Nigerian National Petroleum Corporation (NNPC), Nigerian Content Development and Monitoring Board (NCDMB), Nigerian Upstream Petroleum Regulatory Commission (NURPC), Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA), Petroleum Technology Development Fund (PTDF) and Petroleum Training Institute (PTI) are joint hosts."
  },
  {
    "headline": "9mobile announces self-service unbarring portal for barred lines",
    "summarized_story": "By Kehinde Ibrahim, Lagos9mobile has announced an easy self-service unbarring portal for customers to connect their NIN and unbar their lines online.\nThe NIN-Web Linking service is a simple, self-service portal that saves customers the hassles of queuing endlessly to link their NIN.\nOmoike explained that the initiative, the first by any Nigerian operator, would enable customers to unbar their lines without stress from the comfort of their homes or offices.\n“We are a caring network and are always on the lookout to make the lives of our customers easier and better.\nWe realized the frustrations of people trying to unbar their lines and came up with the unique initiative that will enable them to regain the use of their lines as quickly as possible,” he further said."
  },
  {
    "headline": "Cable Equiano: Pantami, Danbatta pledge enabling policy environment for wider connectivity",
    "summarized_story": "The duo stated this on the sideline of the reception marking the landing of the Equiano undersea Cable System in Nigeria at the Open Access Data Centre at Lekki in Lagos.\nPantami and Danbatta commended Google LLC, the West Indian Ocean Cable Company, WIOCC, and other investors for bringing additional bandwidth capacity into the country to drive connectivity and growth.\nPantami also promised an enabling environment that encourages foreign and local investment in infrastructure project such as the way Google and its co-investors have done.\nDanbatta expressed delight that Equiano has joined the list of other submarine cables at the shores of Nigeria, including SAT3 cable, MainOne cable, Glo1 cable as well as the African Coast to Europe (ACE) submarine cable by Dolphin and West African Cable System (WACS) by MTN.\nThe Chief Executive Officer (CEO) of WIOCC, Chris Wood, also described the landing of the submarine cables as a major investment in the Nigerian digital economy."
  },
  {
    "headline": "Over $10bn food production at risk in Nigeria, others –AfDB",
    "summarized_story": "By Mathew Dadiya, AbujaThe African Development Bank Group President, Dr Akinwumi Adesina, says a fertiliser crisis triggered by the Russian war in Ukraine could put more than $10bn worth of food production at risk in Africa.\nAfrica will lose $11 billion worth of food, and coming shortly after COVID-19, that would be rather serious,” the AfDB President disclosed.\n“We were not ready for COVID-19, but we are now planning to avert food crisis on the continent.\nDr Adesina submitted: “Mr.\nWe are behind you strongly, and we want to ensure Nigeria won’t feel the impact of the food crisis.”"
  },
  {
    "headline": "Reps summon officials of Ministry of Trade over alleged N2.6trn tax evasion",
    "summarized_story": "By Aaron OssaiHouse of Representatives Committee on Public Accounts, PAC yesterday summoned officials of the Ministry of Trade and Industry over alleged tax evasion by one of the telecommunication companies in Nigeria, MTN to the tune of N2.6 trillion.\nSpeaking at the resumed investigative hearing into the Audit queries on tax evasion issued by the office of the Auditor General for the Federation (oAuGF), Hon.\nOke disclosed that the oAuGF report indicated that the documents relating to the N2.6 trillion capital allowances were allegedly forged.\nWhile stressing that the Committee invited MTN over tax evasion, Hon.\nHe maintained that Nigerians have rights to know the implications of MTN taking a certificate of N2.6 trillion to FIRS for tax waivers on the economy."
  },
  {
    "headline": "Senate Passes Amended Terrorism Act, Criminalises Payment Of Kidnap Ransom",
    "summarized_story": "Payment of kidnap ransom was criminalised by the lawmakers during Wednesday’s plenary in Abuja as they passed the Terrorism (Prevention) Act 2013 (Amendment) Bill, 2022.\nThe prohibition by the lawmakers followed the receipt and consideration of a report by the Senate Committee on Judiciary, Human Rights, and Legal Matters on the bill.\nIn his remarks, the Senate President, Ahmad Lawan, congratulated his colleagues on the passage of the bill which he said was very important.\nThe Senate President stated that the security agencies were trying their best but needed to do more and achieve better results.\n“With this, once again, I want to congratulate the Senate for this very important piece of legislation,” he concluded."
  },
  {
    "headline": "Zamfara Govt Dethrones Two Emirs, District Head Accused Of Aiding Banditry",
    "summarized_story": "The Zamfara State government has dethroned two emirs and a district head over allegations of aiding the activities of bandits terrorising communities in the state.\nThose affected by the government’s decision include the Emir of Zurmi, Abubakar Atiku, Emir of Dansadau, Hussaini Umar, as well as Sulaiman Ibrahim who used to be the District Head of Birnin Tsaba.\nMr Ibrahim Dosara, who is the Commissioner for Information in Zamfara, made the announcement on Wednesday while briefing reporters at the end of the State Executive Council meeting in Gusau, the state capital.\n“The State Executive Council has also directed the state Ministry of Justice to issue an executive order to back up the council resolution,” he added.\n“The three impeached royal fathers were earlier suspended by the state government following wide allegations of serious involvement in the act of banditry in the state."
  },
  {
    "headline": "One Killed, Many Houses Razed In Bauchi Communal Clash",
    "summarized_story": "One person has been killed with over 20 houses burnt in a clash between Gudum Hausawa and Gudum Fulani communities in Bauchi State.\nThe crisis escalated on Wednesday after the burial of two people who were killed on Saturday by hoodlums who launched an attack on a wedding send-forth.\nWorried about the situation, the state governor, Bala Mohammed, imposed a 24-hour curfew, to prevent the crisis from getting out of control.\n“Last three days, two peace-loving and unsuspecting Christian youths were killed by suspected hoodlums who don’t want us to live in peace.\nThe community is a diverse community, a community of Muslims and Christians, and a community of the Fulani, Sayawa, Hausa, Jarawa, and other tribes."
  },
  {
    "headline": "NDLEA Proposes Mandatory Drug Test For Presidential Aspirants, Others",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has urged political parties to make drug integrity tests part of the screening requirements for aspirants seeking to contest various political offices in the 2023 elections on their platforms.\nNDLEA Chairman/Chief Executive, Brigadier-General Buba Marwa, made the proposal in response to questions from reporters on Wednesday at the agency’s national headquarters in Abuja.\nHe also highlighted some of the feats the agency has recorded in the last three months, including the arrest of over 3,500 suspects.\n“Statistics from the first quarter (Q1) report indicated that our performance level has not dropped off,” said the NDLEA chief.\n“Indeed, achieving 3,539 arrests, 677 convictions, and seizures of 65,916 kg of drugs in three months is no mean feat."
  },
  {
    "headline": "Liverpool Beat Villarreal In Champions League Semi-Final First Leg",
    "summarized_story": "Liverpool are on the brink of a third Champions League final in five seasons after breaking Villarreal’s resistance to win the first leg of their semi-final 2-0 at Anfield on Wednesday.\nThe Reds remain on course for an unprecedented quadruple of Champions League, Premier League, FA Cup, and League Cup.\nThe six-time European champions started the second half at a higher tempo and quickly began to punch holes in Villarreal’s rearguard.\nThe last thing the visitors could afford was the floodgates opening, but they were powerless to stop the waves of Liverpool attacks.\nLuis Diaz smashed across the face of goal as Liverpool threatened to kill the tie off with a third."
  },
  {
    "headline": "Thousands storm APC Secretariat as Yahaya Bello picks nomination forms -",
    "summarized_story": "Governor of Kogi state and a presidential aspirant on the platform of the All Progressives Congress (APC), Yahaya Bello, has picked up his Expression of Interest and Nomination Form to contest for the 2023 presidential election.\n“Yahaya Bello is coming on the table to restore hope for Nigerians, for the entire black Africans and for the entire black nation across the world.\n“At this moment, the candidate, Gov Yahaya Bello has come to pick his form.\nHe was the first to pay for his APC Presidential form and he has come today to pick up his form.\n“God willing, 2023 we will be welcoming President Yahaya Bello to Aso Rock."
  },
  {
    "headline": "Senate Deputy Chief Whip Defects to the APC from PDP",
    "summarized_story": "The Ranks of the All progressive congress at the National Assembly further swelled following the decision the Deputy Chief whip of the Senate , Senator Ibrahim Abdullahi Danbaba to formally defect from the PDP to the APC.\nThe Lawmaker notified the Upper legislative Chamber through a letter addressed to the President of the Senate , Ahmad Lawan.\nThe Senator representing Ogun Central , Senator Ibikunle Amosun has also notified the Senate of his intention to Join the 2023 Presidential Race.\nSenator Abdullahi Dambaba, elected on the platform of the People’s Democratic Party has informed the Senate of his decision to pitch his tent with the ruling all progressives Congress.\nHe says his decision to dump the PDP is as a result of the lingering crisis rocking the partyBut his former team players in the PDP, are not pleased with this latest development and are demandung that he vacates his seat among the principal officers of the senate as the Deputy Chief Whip."
  },
  {
    "headline": "Russia bans over 200 British lawmakers from country over Ukraine",
    "summarized_story": "Russia has banned 287 British parliamentarians from entering the country in retaliation for sanctions imposed by the United Kingdom on 386 Russian lawmakers in March, according to a statement released by the Russian Foreign Ministry on Wednesday.\nThe Ministry announced that the 287 members of the House of Commons from both parties will face “personal limitations,” claiming that the chosen MPs “played the most active part” in punishing 386 members of Russia’s lower house of parliament, the Duma.\nThe Ministry added that the lawmakers contributed “to the groundless whipping up of Russophobic hysteria in the UK.”Those sanctioned include Downing Street Chief of Staff Steve Barclay, Speaker of the House of Commons Lindsay Hoyle, Brexit minister Jacob Rees-Mogg and other lawmakers from both the Conservative and Labour parties.\n“The hostile rhetoric and far-fetched accusations coming from the mouths of British parliamentarians not only condone the hostile course of London, aimed at demonizing our country and its international isolation, but are also used by opponents of mutually respectful dialogue with Russia to undermine the foundation of bilateral cooperation,” the statement read.\nBoris Johnson, who was sanctioned alongside other British legislators earlier last month, said parliament on Wednesday that sanctioned politicians should “regard it as a badge of honor.”"
  },
  {
    "headline": "Adamawa assembly declares seat of lawmaker vacant for defecting to APC -",
    "summarized_story": "Adamawa State House of assembly has declared the seat of the member representing Michika state constituency, Joseph Ayuba vacant for defecting form the ruling People’s Democratic Party (PDP) to All Progressives Congress (APC).\nHon Aminu Iya Abbas, the house citing section 109 1(G) of the constitution declared the seat of the lawmaker vacant by virtue of leaving his party under whose crest he was elected.\nPresenting the issue before the plenary attended by 13 out of the 25 members, the deputy speaker, Pwamwakeno Mackondo citing section 109 of the constitution urged the House to declare the seat of the lawmaker vacant.\nIya Abbas then requested Mackondo to present the section of the constitution after which he put a motion for the declaration of the member’s seat vacant.\nAfter the motion was moved and seconded, the speaker declared the seat of the lawmaker vacant and asked the clerk to inform relevant authorities including INEC of the house decision."
  },
  {
    "headline": "Buhari Won’t Back Any Aspirant Says Kalu + Ayade Declares – Trending With Ojy Okpe",
    "summarized_story": "The Governor of Cross River State Ben Ayade on Tuesday said that he has informed President Muhammadu Buhari of his intention to contest the presidency on the platform of the All Progressives Congress and that the president advised him to make further consultations on his ambition.\nIn the meantime, Chief whip of the senate, Orji Uzor Kalu on Tuesday said he is still in the race for the highest political office in the land only if the presidential ticket is zoned to the south East.\nHe however said that he has not informed the President of his ambition because Buhari’s antecedent is not to back a presidential aspirant.\nA video showing members of a security outfit in Benue state called the Nigeria Hunters and Forest Security Service assaulting a lady by forcefully shaving her hair in public is making the rounds on social media.\nFinally, A Nigerian Pastor identified as Ade Abraham of Christ High Commission Ministry in Kaduna State, is making headlines after he allegedly charged members of his church N310 thousand Naira each to fly them to heaven."
  },
  {
    "headline": "Victor Umeh: The Presidency Must Come to The South to keep Nigeria Together",
    "summarized_story": "Former National Chairman of the All Progressives Grand Alliance, Senator Victor Umeh, speaks to ARISE about the call for an Igbo presidency.\nIn light of the zoning controversies several parties have experienced so far in the shadow of 2023 elections, Senator Umeh shares his thoughts on why the presidency should be zoned to the South East, in order to maintain and equal and fair electoral process."
  },
  {
    "headline": "‘My Candidacy Arouses Many People’s Interests in The Political Space’- Khadijah Okunnu-Lamidi",
    "summarized_story": "Now a member of the Social Democratic Party, presidential apsirant Khadijah Okunnu-Lamidi joins ARISE News to speak about her presidential bid.\nRelatedStories No Content AvailableShe shares details of her presidential campaign and its operations, including why she has chosen to join forces with the SDP party in recent times."
  },
  {
    "headline": "Major Japan Railway Now Powered Only by Renewable Energy",
    "summarized_story": "Nicholas Little, director of railway education at Michigan State University’s Center for Railway Research and Education, commends Tokyu for promoting renewable energy but stressed the importance of boosting the bottom-line amount of that renewable energy.\n“I would stress the bigger impacts come from increasing electricity generation from renewable sources,” he said.\nOnly about 20% of Japan’s electricity comes from renewable sources, according to the Institute for Sustainable Energy Policies, a Tokyo-based independent non-profit research organization.\nThat lags way behind New Zealand, for instance, where 84% of power used comes from renewable energy sources.\nThe country aims to have 36%-38% of its energy come from renewable sources by 2030, while slashing overall energy use."
  },
  {
    "headline": "Russia Halts Gas Supplies to Poland, Bulgaria for Failing to Pay in Roubles",
    "summarized_story": "Russian energy firm Gazprom said on Wednesday it had halted gas supplies to Bulgaria and Poland for failing to pay for gas in roubles, the Kremlin’s toughest retaliation yet to international sanctions over the war in Ukraine.\nGazprom said in a statement it had “completely suspended gas supplies to Bulgargaz and PGNiG due to absence of payments in roubles,” referring to the Polish and Bulgarian gas companies.\nPoland receives its Russian gas through the Yamal-Europe pipeline from Russia’s huge gas fields in the Arctic far north, which continues west to supply Germany and other European countries.\n“Cutting gas supplies is a breach of contract and PGNiG reserves the right to seek compensation and will use all available contractual and legal means to do so,” the company said.\nGermany, the biggest buyer of Russian energy, said this week it is hoping to stop importing Russian oil within days."
  }
]