[
  {
    "headline": "Proposed 400% health insurance tariff hike to reflect economic reality, says AGPMPN",
    "summarized_story": "Amarachi OkehThe Lagos State Chairman of the Association of General and Private Medical Practitioners of Nigeria, Dr. Makinde Akinlemibola says the proposed increase in the tariff of private health insurance scheme is necessary to reflect the current economic changes and reality.\nAccording to Akinlemibola, the present tariff of health insurance can no longer provide adequate health services for the people.\nRecall that PUNCH HealthWise had reported early on Tuesday that a Health HMO had flayed the proposed tariff hike.\nThe Managing Director, Ultimate Health HMO, Lekan Ewenla, had described as ill-timed the proposed tariff increase in the private health insurance scheme.\nAkinlemibola, however, stated that the association has the best interest of the people at heart while insisting that the health insurance scheme is still the cheapest means of accessing good health care in the country."
  },
  {
    "headline": "Proposed 400% health insurance tariff hike to reflect economic reality, says AGPMPN",
    "summarized_story": "Amarachi OkehThe Lagos State Chairman of the Association of General and Private Medical Practitioners of Nigeria, Dr. Makinde Akinlemibola says the proposed increase in the tariff of private health insurance scheme is necessary to reflect the current economic changes and reality.\nAccording to Akinlemibola, the present tariff of health insurance can no longer provide adequate health services for the people.\nRecall that PUNCH HealthWise had reported early on Tuesday that a Health HMO had flayed the proposed tariff hike.\nThe Managing Director, Ultimate Health HMO, Lekan Ewenla, had described as ill-timed the proposed tariff increase in the private health insurance scheme.\nAkinlemibola, however, stated that the association has the best interest of the people at heart while insisting that the health insurance scheme is still the cheapest means of accessing good health care in the country."
  },
  {
    "headline": "Nurses’ association seeks justice for murdered member",
    "summarized_story": "The National Association of Nigeria Nurses and Midwives, Abuja Council, has called on the authorities to unmask the killers of one of its members, Grace Dauda.\nNAN also reports that the late Dauda was, until her death, was the Chief Nursing Officer of Federal Medical Centre, Jabi, Abuja.\nShe called on security forces to fish out the killers of Dauda, adding that the association would not rest until this was done.\nYusuf, however, enjoined nurses and midwives to be more security conscious, law-abiding and report any suspicious moves around their environs to relevant authorities.\nNAN reports that few days after she was murdered, the late Duada was buried in her hometown, Garkida in Adamawa."
  },
  {
    "headline": "Nurses’ association seeks justice for murdered member",
    "summarized_story": "The National Association of Nigeria Nurses and Midwives, Abuja Council, has called on the authorities to unmask the killers of one of its members, Grace Dauda.\nNAN also reports that the late Dauda was, until her death, was the Chief Nursing Officer of Federal Medical Centre, Jabi, Abuja.\nShe called on security forces to fish out the killers of Dauda, adding that the association would not rest until this was done.\nYusuf, however, enjoined nurses and midwives to be more security conscious, law-abiding and report any suspicious moves around their environs to relevant authorities.\nNAN reports that few days after she was murdered, the late Duada was buried in her hometown, Garkida in Adamawa."
  },
  {
    "headline": "Dufil kicks off Indomie campaign",
    "summarized_story": "By Nkiruka NnoromInstant noodles brand, Indomie Noodles, from the staple of Dufil Prima, has kicked off the year with a consumer-centric campaign aimed at rewarding its teeming consumers who are resident in South-West Nigeria.\nThe campaign is available for Indomie Chicken Flavour consumers on the SKUs-70grams, 100grams, and 120grams packs.\nGroup Corporate Communications and Event Manager, Tope Ashiwaju, said: “We know how much our consumers love their Indomie Noodles.\nThe campaign is available for Indomie Chicken Flavour consumers on the SKUs-70grams, 100grams, and 120grams packs.\nGroup Corporate Communications and Event Manager, Tope Ashiwaju, said: “We know how much our consumers love their Indomie Noodles."
  },
  {
    "headline": "Army Recruitment: We will recruit only the best – COAS",
    "summarized_story": "The Chief of Army Staff (COAS) Lt Gen Faruk Yahaya, has said that only the best candidates who are medically and physically fit will be recruited into the Nigerian Army (NA).\nLt Gen Yahaya charged the recruitment officers to leverage on the experience garnered from the previous recruitment exercises to improve upon the conduct of the ongoing recruitment and ensure that the goals of the exercise are not compromised.\nThe COAS also took a tour of the centre during which he inspected completed as well as ongoing projects at the centre.\nGen Yahaya also interacted with the candidates and left them with some words of encouragement.\nAccompanying the COAS during the visit ate the General Officer Commanding 1 Division Maj Gen Kabiru Muhktar, Chief of Administration (Army) Maj Gen Usman Mohammed, Chief of Operations Maj Gen Olumide Akinjobi, Provost Marshal (Army) Maj Gen Robert Aiyenigba and the Chief of Military Intelligence (Army) Maj Gen Ibrahim Salihu"
  },
  {
    "headline": "Senate tasks Heads of Security Agencies to stem smuggling of Petroleum Products",
    "summarized_story": "“So this meeting( yesterday) is to look into the ways and means of controlling the smuggling of the petroleum products with a view to minimising the cost of fuel subsidy to our country.\n“At the end of the day what we hope to achieve is to minimise or where possible eliminate the incidents of smuggling of petroleum products that we import into the country for our people.\n“Our Committees in the Senate that supervise the Customs, the security agencies, will be up to date with their oversight.\nThat when they see trucks conveying petroleum products to our neibouring countries, they should not only say something, they should say it to those who need to know.\nAnd that is to our security agencies."
  },
  {
    "headline": "Presidency attacks Ortom over comments against Buhari on Arise TV",
    "summarized_story": "By Johnbosco AgbakwuruABUJA—THE Presidency last night attacked the Benue State Governor, Samuel Ortom over his comment when he appeared on Arise television programme where he said that Nigerians are regretting voting for President Muhammadu Buhari in 2015.\nThe Presidency accused Ortom of blaming the President where he has allegedly done nothing to improve the welfare of the Benue state people.\nThe statement read: “There are two types of politicians in Nigeria today.\nThe first are politicians who are leaders that offer solutions to the challenges facing the voters and the country.\n“President Muhammadu Buhari is a leader."
  },
  {
    "headline": "EKOEXCEL: Quality education, crucial to state’s progress, growth- LASUBEB boss harps",
    "summarized_story": "LASUBEBBy Olasunkanmi AkoniLagos State Government has stressed that quality education is also crucial to the state’s progress and growth in the 21st century.\nAlawiye-King, therefore, promised not to relent in its efforts towards improving primary education in the state.\nAccording to him; “Just like the theme of this year’s International Day of Education ‘Changing Course, Transforming Education’, we at EKOEXCEL won’t relent until we completely change the course of public education in Lagos for the better.\nA total transformation of public primary education is our goal and we are happy we are on course”, Adefuye said.\n“The recent report on EKOEXCEL 2020-2021 Endline Fluency and Numeracy Evaluation showed how the intervention is improving pupils of public schools and transforming the education sector."
  },
  {
    "headline": "OIC states position on coup in Burkina Faso",
    "summarized_story": "The Organization of Islamic Cooperation (OIC) has called for calm in Burkina Faso.\nThey swooped in after talks with Defence Minister, General Barthelemy Simpore failed to yield a positive result.\nIn a statement on Tuesday, the OIC expresses its concern about developments in the West African nation.\n“The OIC supports the Government and people of Burkina Faso in their efforts towards security and stability in Burkina Faso”, it said.\nAfrica has now recorded mutiny in four countries – Mali, Guinea, Sudan, Burkina Faso – since August 2020."
  },
  {
    "headline": "2023: Don’t elect people above 70 as president – Makinde warns Nigerians",
    "summarized_story": "Governor Seyi Makinde of Oyo State has warned Nigerians against electing people who are above 70 years of age as president in 2023.\nHe said that instead of electing people who are old enough to be grandpa, Nigerians should elect a young person as president in 2023.\nMakinde made this disclosure on Tuesday in Ibadan, the Oyo State capital.\nBut, Makinde, who is a chieftain of the PDP has charged Nigerians to choose wisely in 2023.\nI want them to think twice and I am saying to the people of Oyo State and Nigeria that this world is not easy."
  },
  {
    "headline": "Crisis looms at PRODA as agency DG, board, ministry clash",
    "summarized_story": "The board had raised about seven strong allegations against the then DG, but forces in the ministry and other interested parties frustrated its effort to sanitize the agency.\n“After the DG was sacked, another board was set up because the Ministry of Science and Technology said the tenure of the board had elapsed.\n“When the Acting DG was sacked, the most senior person in the agency, Dr. Fabian Okonkwo stepped in as the new Acting DG.\n‘’Any DG that comes with the interest of running the place down, the board will not be happy with him.\nThe board reports to the ministry, and it’s the ministry that oversees these things that will take decisions."
  },
  {
    "headline": "Dogara speaks on suspension as Jakada Bauchi by Emirate Council",
    "summarized_story": "The attack led to the suspension of the former speaker as Jakada Bauchi by the Bauchi Emirate Council until the final determination of the case filed against him and others before the state High Court by the state government.\n“Yesterday (Monday), January 24, 2022, the Bauchi Emirate Council purportedly announced my suspension as Jakadan Bauchi.\nI was never informed that there was an allegation of wrongdoing against me pending before the Emirate Council.\n“I wouldn’t join issues with the emirate council because of the respect I have for both His Royal Highness and the Emirate Council.\nThe Emirate council cannot convict me over hearsay, without investigation and without inviting me to face any allegations against me."
  },
  {
    "headline": "I paid N40m ransom for my mother’s release – Kano lawmaker, Ali Danja",
    "summarized_story": "Ali Danja, the Kano State House of Assembly member whose mother, Hajia Zainab Danja, was abducted two weeks ago, has revealed that he paid a N40 million ransom to secure her release.\nZainab was abducted from her bedroom in the Gezawa Local Government Area of Kano on January 12, 2021.\nAli Danja is the minority leader of the state House of Assembly and a one-time speaker of the house and of the Kwankwasiyya movement, loyal to former Governor Rabiu Musa Kwankwaso.\nDanja said they were on their way to pick her from a local government in Jigawa State where the abductors dropped her.\nHowever, neither the Kano nor Jigawa state police command has spoken on the issue as at the time of filing this story."
  },
  {
    "headline": "Concern over Southerners' refusal to join police",
    "summarized_story": "The Police have expressed concern over the lack of interest of young Nigerians from the southern part of the country in joining the rank and file cadre (recruits).\nThe disinterested posture, the service said, was evident in the ongoing recruitment exercise as mostly northerners applied to join the service as recruits.\n- Advertisement -“We wonder why that is happening, and we believe we should encourage the youth to join the Nigeria Police and other forces.\n“We found out that Lagos State indigenes are under-represented and we urge the appropriate persons to work towards this.\n“No one knows better the character of its citizens than members of the community therefore, citizens are encouraged to kindly urge people of good character to join the force."
  },
  {
    "headline": "Labour writes governors, wants fuel import stopped",
    "summarized_story": "Importation of petroleum products should be stopped forthwith by the Federal Government because it is “akin to handing over our national sovereignty to other climes,” the Nigeria Labour Congress (NLC) has said.\nThe NLC stated these in a letter it addressed to the governors as key members of the Vice-President Yemi Osinbajo-led National Economic Council.\nThe council had recommended that the pump price of fuel be increased from N162.50 to N302 per litre.\nIt warned that workers would have no other choice than to down tools any time the government decided to impose another round of petrol price hike.\nThe congress added: “Over the years, the government has invested billions of taxpayers money into overhauling our national refineries with no commensurate results."
  },
  {
    "headline": "‘How I became first serving police SAN’",
    "summarized_story": "I only became interested when I learnt it was impossible to read Law without first passing English Literature in secondary school.\nI concluded that for me to play those roles like Moses, Joshua and Elijah, I had to read Law.\nAt that time, Gani Fawehinmi (SAN), now late, was just coming up.\nThis was what informed my decision to read law.\nHow did you record the feat of getting the SAN rank at your first try?"
  },
  {
    "headline": "Simon tips Eagles for Qatar 2022 World Cup",
    "summarized_story": "Nantes winger Moses Simon has vowed that the Super Eagles will do everything to pick one of Africa’s ticket to the 2022 Qatar World Cup as a gift to Nigerians.\nMoses, who was one of the Super Eagles outstanding players during tournament, said the defeat was difficult to accept for the team.\nNigeria will face Ghana in a double header in March for a place at the World Cup and Moses believed that the only way to make Nigerians happy for their AFCON ouster is to grab the World Cup ticket.\n“We know everyone want to go to the World Cup and the hope is just to go to the World Cup.\n- Advertisement -Moses who was inconsolable after the loss to Tunisia on Sunday, admitted the AFCON was a good experience."
  },
  {
    "headline": "Full list of 2022 Africa’s richest persons",
    "summarized_story": "Forbes, a global media company, focusing on business, investing, technology, entrepreneurship, leadership, and lifestyle has listed the richest African people in 2022.\nAliko Dangote, Nigeria’s business mogul tops the list.\nForbes used stock prices and currency exchange rates from January 19, 2022 to measure the net worths.\n- Advertisement -Billionaires from seven African countries made the list.\nSouth Africa and Egypt have the most with five each followed by Nigeria with three billionaires."
  },
  {
    "headline": "BREAKING: Buhari approves suspension of subsidy removal",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has approved the suspension of the removal of fuel subsidy that was earlier scheduled for June 2022, until further notice.\nThe Minister of State, Petroleum Resources, Timipre Sylva, made the disclosure after meeting with President Muhammadu Buhari in the State House, Abuja.\nPresident Buhari had on 16th August 2021 signed the Petroleum Industry Bill into law.\nSylva said ‘President Muhammadu Buhari has agreed to an extension of the statutory period for the implementation of the removal of subsidy on petrol (Premium Motor Spirit, PMS) in accordance with extant laws.\nThat is why we are making this announcement.’On the possible legal implications after the assent to the PIA by President Buhari, the minister said: ‘We also see the legal implications."
  },
  {
    "headline": "Buhari launches National Policy on 5G, directs security institutions to leverage immediately",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has directed all the security institutions to immediately leverage Fifth Generation (5G) technology to enhance security in the country.\nThe president gave the directive Tuesday at the launching of the National Policy on 5G for Nigeria’s Digital Economy at the State House, Abuja.\n‘It will also support security institutions with real-time communication.\nPresident Buhari explained that the National 5G Policy includes a deployment plan to ensure that major cities across the country benefit from the technologies.\n‘The National 5G Policy will position Nigeria to harness the potentials of 5G technologies to further develop the economy and improve the indices of well-being in the nation,’ he said."
  },
  {
    "headline": "MKO: Abdulsalami’s narrative on Abiola’s death hard to believe –YCE scribe",
    "summarized_story": "From Oluseye Ojo, IbadanSecretary General of Yoruba Council of Elders (YCE), Kunle Olajide, yesterday, said the narrative of former military head of state, Abdulsalami Abubakar, on the death of the winner of the June 12, 1993 presidential election in Nigeria, Moshood Abiola, is hard to believe.\n“One was, I received a delegation from America, headed by Pickering, who was then, I think, the secretary of state or so.\nIn his team, I remember very well, was Susan Rice.\n“But I don’t believe his entire story about Abiola’s death.\n“So, for me, I don’t believe him and I am sure most Nigerians will not believe the story."
  },
  {
    "headline": "JAMB fixes UTME exams for April 20, sale of forms begins February 12",
    "summarized_story": "From Fred Ezeh, AbujaJoint Admissions and Matriculation Board (JAMB), yesterday, announced that it would begin sales of application forms for the 2022 Unified Tertiary Matriculation Examination (UTME) on February 12.\nJAMB also said it would not accept the National Business and Technical Examinations Board (NABTEB) Advanced Level (A’L) as entry requirement for Direct Entry candidates into tertiary institutions.\n“It has come to our notice that some institutions are accepting NABTEB A/L GCE as a qualification for Direct Entry (DE) Admissions.\nJAMB is aware that NABTEB is not authorised to offer GCE and is, therefore, compelled to take appropriate action.\nAny A/L GCE Certificate issued by NABTEB is, therefore, not registrable with JAMB and the Board would not process the admission of any candidate with such a result."
  },
  {
    "headline": "COVID-19: CBN, DBN expend over N5.4trn in one year",
    "summarized_story": "Put together, if BoI finally disburses the loans to its beneficiaries, the three development financial institutions will have spent N6.030,410 trillion within one year just to contain the global pandemic.\n“The bank was also selected to manage the N50billion export expansion fund, which is expected to develop and promote export initiatives.\nThis includes providing financial support to organisations in the non-oil export value chain negatively affected by COVID-19, as well as developing export opportunities and programmes that the Nigerian Export Promotion Council (NEPC) may identify.\nIt is expected that this support will help revitalise Nigeria’s industrial sector.\nIn addition, we improved our capacity to support Nigerian enterprises by raising about $2.1billion from the international debt capital market in 2020.”"
  },
  {
    "headline": "CBN Retains MPR at 11.5%",
    "summarized_story": "James EmejoTje Central Bank of Nigeria (CBN) Tuesday resolved to leave all monetary policy parameters unchanged in a bid to support the recovery and growth of the economy.\nThe apex bank, after its two-day meeting of the Monetary Policy Committee (MPC), the first in 2022, resolved to retaining the Monetary Policy Rate (MPR), otherwise known as the interest rate, at 11.5 per cent with the asymmetric corridor of +100/-700 basis points around the MPR.\nThe MPR is the rate at which the CBN lends to commercial banks and often determines the cost of borrowing in the economy.\nThe MPC also voted to maintain the Cash Reserve Ratio (CRR) at 27.5 per cent as well as the Liquidity Ratio at 30 per cent.\nCBN Governor, Mr. Godwin Emefiele, while addressing journalists at the close of the meeting, further announced that the banking industry Non-Performing Loans (NPLs) had further reduced to about 4.85 per cent in December, the lowest in about 10 years."
  },
  {
    "headline": "Breaking: Buhari Okays Indefinite Suspension of Planned Fuel Subsidy Removal",
    "summarized_story": "*To propose 18 months extension of PIA implementation to N’AssemblyDeji ElumoyeNigerians for now can heave a sigh of relief as President Muhammedu Buhari has okayed the suspension of the planned removal of fuel subsidy until further notice.\nMinister of State, Petroleum Resources, Timipre Sylva, made this known on Tuesday after a closed-door meeting with President Muhammadu Buhari at the State House, Abuja.\nHe said in line with this, the executive will forward an amended PIA Bill to the legislative arm proposing18 months extension for the implementation of the Petroleum Industry Act (PIA) that was meant to commence this February.\nPresident Buhari had on 16th August 2021 signed the Petroleum Industry Bill into law.\nThe PIA is expected to grow investors’ confidence in Nigeria’s Petroleum Industry and create more employment opportunities for the populace in the host communities."
  },
  {
    "headline": "Breaking: Senate, House Harmonise Positions on Electoral Bill",
    "summarized_story": "Sunday Aborisade in AbujaThe Senate on Tuesday passed the harmonised version of the Clause 84 of the 2010 Electoral Act (amendment) Bill 2022 which gave room to political parties to adopt three modes of conducting primaries.\nThe harmonised version now accommodated the direct, indirect and the consensus mode of primaries.\nThe Senate had earlier passed the three mode of primaries but the House of Representatives version did not include the consensus arrangement.\nThe red chamber consideried the harmonised version of the bill at plenary and passed the proposed legislation.\nSenate President, Ahmad Lawan, said the bill had given sufficient and clear definition to the the mode of primaries now adopted by both chambers of the National Assembly."
  },
  {
    "headline": "Marginal Fields: NUPRC Invites Reserve Bidders after Winners Failed to Pay Within Stipulated Time",
    "summarized_story": "Emmanuel Addeh in AbujaThe Nigerian Upstream Petroleum Regulatory Commission (NUPRC) yesterday invited reserve bidders for the 2020 marginal fields programme completed in 2021, after some initial bid winners failed to pay up their signature bonuses within the stipulated time.\nThe process which culminated in the presentation of letters to the bid winners in Abuja by the industry regulator, started in June 2020, with 57 marginal fields spanning land, swamp and offshore put up for lease by the federal government.\nMarginal fields are smaller oil blocks typically developed by indigenous companies and have remained unproduced for a period of over 10 years.\n“And as such, interests have reverted to the bid basket due to effluxion of time for payment of the applicable signature bonus,” he stated.\nFurthermore, the commission noted that the equity of the initial bid winners would be pro-rated, indicating that they would only participate to the extent of their payments."
  },
  {
    "headline": "Military Takes over Govt in Burkina Faso, Whereabouts of President Unknown",
    "summarized_story": "*Nigeria condemns coupMichael Olugbode in Abuja with agency reportThe military on Monday announced a take-over of government in Burkina Faso, suspending the Constitution and ousting the country’s democratically elected president hours after mutinous soldiers surrounded his home.\nThe military said the nation’s land and air borders would be closed, and a nightly curfew imposed until further notice.\nMeanwhile, Nigerian government has condemned the coup d’etat in Burkina Faso, calling for the immediate release of President Marc Christian Kabore and other members of his government being detained by the military.\n“Nigeria strongly condemns the overthrow of the democratically elected government of President Roch Marc Kabore and his detention.\nSanctions are expected to be announced by the regional body to force the military to quickly hand back power to civilian authorities."
  },
  {
    "headline": "BREAKING: Retired Navy Rear-Admiral Wanted For N2billion Fraud, Connives With Policemen, Orders Thugs To Shoot At Kaduna Residents",
    "summarized_story": "A former Director of Nigerian Navy Accounts, Rear Admiral Tahir Yusuf (retd.\nSources told SaharaReporters that Yusuf on Tuesday told the thugs guarding him to assault and shoot at some women for allegedly giving information about him to the news medium.\nSeveral sources told SaharaReporters that the corrupt retired military officer connived with the senior police officers and magistrate in Zaria to illegally detain and remand the innocent residents shot by thugs loyal to him.\nSaharaReporters had reported that the EFCC accused Yusuf of stealing N2billion belonging to the Nigerian government while serving as Director of Nigerian Navy Accounts.\nFollowing the forfeiture, SaharaReporters gathered that Yusuf fled Nigeria to Dubai, United Arab Emirate."
  },
  {
    "headline": "BREAKING: Retired Navy Rear-Admiral Wanted For N2billion Fraud, Connives With Policemen, Orders Thugs To Shoot At Kaduna Residents",
    "summarized_story": "A former Director of Nigerian Navy Accounts, Rear Admiral Tahir Yusuf (retd.\nSources told SaharaReporters that Yusuf on Tuesday told the thugs guarding him to assault and shoot at some women for allegedly giving information about him to the news medium.\nSeveral sources told SaharaReporters that the corrupt retired military officer connived with the senior police officers and magistrate in Zaria to illegally detain and remand the innocent residents shot by thugs loyal to him.\nSaharaReporters had reported that the EFCC accused Yusuf of stealing N2billion belonging to the Nigerian government while serving as Director of Nigerian Navy Accounts.\nFollowing the forfeiture, SaharaReporters gathered that Yusuf fled Nigeria to Dubai, United Arab Emirate."
  },
  {
    "headline": "EXCLUSIVE: Leaked Phone Calls Expose How Serial Fraudster, Fred Ajudua, Connives With Police Authorities, Judges To Break Law, Keeps 30 AK-47 Rifles In Armoury",
    "summarized_story": "SaharaReporters obtained call recordings confirming how Ajudua confessed that he had an armoury of over 30 AK-47 rifles and other weapons.\n“Fred Ajudua confessed in the audio that he had over 30 AK-47 rifles and other weapons.\n“The order quashed the proceeding of Ibusa Magistrate Court in charge number MIB/29/2020 and charge number MIB/29c/2020 with CN Ugeh as the presiding magistrate.\nEvery attempt to ask CN Ugeh to recuse himself from matters involving Fred Ajudua is always met with resistance and hostility.\n“Example of such cases are; MIB/11C/2021 and MIB/65C/2021 all pending trial at Chief Magistrate Court 1, Ibusa where C.N Ugeh presides."
  },
  {
    "headline": "EXCLUSIVE: Leaked Phone Calls Expose How Serial Fraudster, Fred Ajudua, Connives With Police Authorities, Judges To Break Law, Keeps 30 AK-47 Rifles In Armoury",
    "summarized_story": "SaharaReporters obtained call recordings confirming how Ajudua confessed that he had an armoury of over 30 AK-47 rifles and other weapons.\n“Fred Ajudua confessed in the audio that he had over 30 AK-47 rifles and other weapons.\n“The order quashed the proceeding of Ibusa Magistrate Court in charge number MIB/29/2020 and charge number MIB/29c/2020 with CN Ugeh as the presiding magistrate.\nEvery attempt to ask CN Ugeh to recuse himself from matters involving Fred Ajudua is always met with resistance and hostility.\n“Example of such cases are; MIB/11C/2021 and MIB/65C/2021 all pending trial at Chief Magistrate Court 1, Ibusa where C.N Ugeh presides."
  },
  {
    "headline": "Police Arraign Five Suspected Cannibals In Zamfara",
    "summarized_story": "The Zamfara State Police Command has arraigned one Aminu Baba, a car dealer, for allegedly engaging in cannibalism.\nBaba was on Tuesday arraigned alongside four other suspects before a chief magistrates court in Gusau, the state capital, for prosecution.\nFile PhotoThe police had arrested the 57-year-old man alongside other suspects over the killing and dismemberment of a nine-year-old boy, Ahmad Yakubu, in Gusau.\nSpokesperson for the Zamfara State Police Command, Mohammed Shehu, led the suspects to court.\nMother of the deceased, Jamila Abdulrahaman, said the boy, who facilitated the abduction of her son, was their house boy."
  },
  {
    "headline": "'Don't blame Buhari for the mess you put Benue' -- presidency hits Ortom",
    "summarized_story": "The presidency has asked Samuel Ortom, governor of Benue, not to blame President Muhammadu Buhari for the challenges experienced in the state.\nOn the allegations of non-payment of Benue workers’ salaries, Ortom had said he inherited over N70 billion arrears of pensions, salaries and gratuities from his predecessor and that despite that, he is trying his best.\nAdvertisementShehu went on to say Ortom is an example of the second class of politicians who blame others for challenges.\nHe said Ortom “inherited unpaid salaries and pension arrears” and rather than find a way to raise funds to pay them, “he has blamed the President”.\n“It seems unlikely, however, that any voter would seriously consider it possible to be ‘rescued’ by a party that would today, allow a politician such as Governor Ortom in its ranks."
  },
  {
    "headline": "'Don't blame Buhari for the mess you put Benue' -- presidency hits Ortom",
    "summarized_story": "The presidency has asked Samuel Ortom, governor of Benue, not to blame President Muhammadu Buhari for the challenges experienced in the state.\nOn the allegations of non-payment of Benue workers’ salaries, Ortom had said he inherited over N70 billion arrears of pensions, salaries and gratuities from his predecessor and that despite that, he is trying his best.\nAdvertisementShehu went on to say Ortom is an example of the second class of politicians who blame others for challenges.\nHe said Ortom “inherited unpaid salaries and pension arrears” and rather than find a way to raise funds to pay them, “he has blamed the President”.\n“It seems unlikely, however, that any voter would seriously consider it possible to be ‘rescued’ by a party that would today, allow a politician such as Governor Ortom in its ranks."
  },
  {
    "headline": "EXTRA: Reps majority leader welcomes 28th child — expects to have 30 by 2023",
    "summarized_story": "Ado Doguwa, the majority leader of the house of representatives, has welcomed his 28th child.\nDoguwa disclosed this while speaking on the floor of the house during plenary session on Tuesday.\nNdudi Elumelu, minority leader of the house, had congratulated Doguwa on the birth of his child.\nResponding, Doguwa said: “This is no longer news.\nIt is no longer news because this thing happened in the last 24 hours."
  },
  {
    "headline": "EXTRA: Reps majority leader welcomes 28th child — expects to have 30 by 2023",
    "summarized_story": "Ado Doguwa, the majority leader of the house of representatives, has welcomed his 28th child.\nDoguwa disclosed this while speaking on the floor of the house during plenary session on Tuesday.\nNdudi Elumelu, minority leader of the house, had congratulated Doguwa on the birth of his child.\nResponding, Doguwa said: “This is no longer news.\nIt is no longer news because this thing happened in the last 24 hours."
  },
  {
    "headline": "Avoid loan sharks, leverage on microfinance banks, Emefiele tells Nigerians",
    "summarized_story": "Godwin Emefiele, governor of the Central Bank of Nigeria (CBN), says Nigerians should beware of illegal money lenders, known as loan sharks.\nLoan sharks offer loans at extremely high rate returns, strict terms of collection upon failure, and generally operates outside the law.\nAdvertisement“There is no need for you to go to loan sharks for a loan.\nPeople normally go to loan sharks because they are desperate and can’t access the bank,” Emefiele said.\n“The bank is putting effort to stop loan sharks, and when these people are found, they will be dealt with mercilessly.”"
  },
  {
    "headline": "Norebase wants to be the node that fuses Africa into a country",
    "summarized_story": "He handled a couple of these as ad-hoc services and then began to see his idea of “Country Africa” unfolding like a morning flower—slow but significant.\nImage credit: Terna IwarThe startup handles everything it takes for a business to launch in a new African country.\nIt’s a 360 degree business launchpad: business registrations, opening of business bank accounts, compliances, license acquisition, and further legal requirements—all from one dashboard.\nEssentially, Norebase wants to be the partner a business would need to operate in a new African market.\nIf AfCFTA wants to create a single African market, think of Norebase as a tool that will power its efficiency."
  },
  {
    "headline": "Tesla’s African expansion is imminent but is it reasonable to drive one in Lagos?",
    "summarized_story": "Granted these remarks hold some merit as many African countries do not have the supporting infrastructure, and very few electric cars are sold in Africa.\nIn November 2020, Hyundai unveiled its first Nigerian electric car named Hyundai Kona.\nThe agreement currently only covers the company selling Tesla charging infrastructure.\nThe use of charging stations gives a sense of the general demand for Tesla cars.\nAnswering the big questionWhile all these moves hint that the expansion of electric car companies to Africa is inevitable, it doesn’t answer the question on many people’s minds: Can electric cars thrive on the African continent?"
  },
  {
    "headline": "Ismael Belkhayat on his way to building Morocco's first unicorn",
    "summarized_story": "For Belkhayat, who has since adopted Ironman as his alias, competing at the sport can be likened to building a business.\nThe next idea came during a trip; Belkhayat had chosen to accompany his wife Sophia Alj, ex-strategy consultant at McKinsey, during a business trip.\nAccording to Belkhayat, Chari currently transacts about $2.5 million monthly.\nBelkhayat the strategistBased on lessons from his previous startups, Belkhayat carved a different operational strategy for Chari, a strategy that rounds up its liability to almost zero.\nEven though Belkhayat is bullish on expanding in many African countries in the coming months, there are countries he won’t go to."
  },
  {
    "headline": "Topship goes from being an Instagram business to a YCombinator company",
    "summarized_story": "That’s an ambitious statement from a company that was operating only on Instagram just 18 months ago.\nBut how did an Instagram business pivot into becoming a tech startup and then get into YC, the world’s biggest accelerator programme with a 1.5% acceptance rate?\nSo, in June 2020, Enenwali started Topship as a one-man shop, opened an Instagram account and started helping people to move parcels locally.\nBut to be Africa’s Flexport, Topship had to be a full technology company, so Enenwali decided to build software that handles the end-to-end process.\nIt’s obvious Topship is really going all-in on its adoption of the Flexport model; it’s already a tech-enabled business and in YC, just like Flexport."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there Been a while since I wrote one of these.\nI certainly hope the holidays were as restful for you as it was for..."
  },
  {
    "headline": "What borderless expansion looks like for African startups with Norebase",
    "summarized_story": "This position led him to serve as Nigeria’s lead negotiator for the African Continental Free Trade Area (AfCFTA) Agreement.\nAnd I worked on that.”On a clear, sunny day on July 7, 2019, Nigeria signed the AfCFTA in Niamey, Niger.\nWith most African businesses, you would have to cherry-pick from 54 markets because the disposable income in individual African countries can be low.”According to him, expansion is a survival issue for most African businesses.\nAs of 2020, nine of the ten countries on the world’s poorest countries list were African.\nThere’s also the fact that building for the African market is quite different in the sense of having to sometimes do everything yourself."
  },
  {
    "headline": "Uber’s bet on ‘Okada’",
    "summarized_story": "Uber’s gamble on Nigerian motorbikesThe gist: On Monday, Uber launched UberMoto, its motorbike on-demand service in Ibadan, Nigeria, to join competitors like SafeBoda, MAX.ng, and Gokada.\nHowever, despite its slow but calculated expansion rate, it took Uber this long to bring any other vertical asides car-hailing into the country.\nBut that would also mean partaking in the loss suffered following the Okada ban in February 2021.\nFrom Uber’s country manager, Tope Akinwumi’s comment about the launch, the plan is to provide a cost-effective and quicker transportation option.\nWhile UberMoto would rest on Uber’s image, which by the way, is pretty new to Ibadan, we can’t say it will be Uber’s top priority to make it work."
  },
  {
    "headline": "Techpoint Build 2021 was 🔥🔥🔥",
    "summarized_story": "Share this article:Hi there,This Saturday was Techpoint Build 2021, and it was the thing!!!!!\nSome Techpoint Build 2021 nuggets for youLet’s begin with the keynote speaker: This year’s keynote speaker for Techpoint Build was Adia Sowho, MTN Nigeria’s CMO.\nWith seven semi-finalists pitching at Techpoint Build 2021, Ghanaian company, WorldTech Consult emerged the winner, carting home $10,000.\nTo crown Techpoint Build 2021 activities, Techpoint Awards 2021 was held on Sunday, January 23, 2022, recognising some of the startups pushing boundaries in the ecosystem.\nIt’s a wrap: I thoroughly enjoyed Techpoint Build 2021 — first time at a Build event — and if you attended the event, I’m sure you did too."
  },
  {
    "headline": "Nigeria’s corruption index ranking lowest in 10 years",
    "summarized_story": "A new report released Tuesday by Transparency International (TI) has revealed that Nigeria corruption perception Index (CPI) is at its lowest in the last decade.\nThe report revealed that corruption levels are at a worldwide standstill, in a ranking that was focused on 180 countries and territories around the world by their perceived levels of public sector corruption.\nThe report showed that 86 percent of countries ranked made little or no progress in the last 10 years.\nRead also: CBN eyes economic recovery, holds interest rate at 11.5%According to the report, Transparency International found countries that violate civil liberties consistently score lower on the CPI, while such countries also had complacency in fighting corruption exacerbates human rights abuses and undermines democracy.\nMeanwhile, in the report, Nigeria was one of the lowest score since the earliest comparable year of available data (2012), alongside 26 other countries such as Australia, Belgium, Botswana, Canada, Comoros, Cyprus, Dominica, Eswatini, Honduras, Hungary, Israel, Lebanon, Lesotho, Mongolia, Netherlands, Nicaragua, Niger, Nigeria, Philippines, Poland, Serbia, Slovenia, South Sudan, Switzerland, Thailand, Turkey and Venezuela."
  },
  {
    "headline": "CBN eyes economic recovery, holds interest rate at 11.5%",
    "summarized_story": "The Central Bank of Nigeria (CBN) on Tuesday retained its benchmark interest rate at 11.5 percent after the first Monetary Policy Committee (MPC) meeting of the year.\nThe move is to sustain growth recovery, despite the sudden rise in inflation rate, which accelerated by 23bps last month to close the year at 15.63 percent after eight consecutive months of decline.\nRead also: External reserves decline to 3-month low on CBN’s FX market interventionThe CBN has kept the MPR at 11.5 percent since September 2020 from 12.5 percent previously.\nNigeria’s inflation rose for the first time in nine months to 15.63 percent in December 2021, according to data from the NBS.\nThe MPC members believe that the existing monetary policy stance has supported the growth recovery and should be allowed to continue for a little longer for consolidation to achieve the MPC mandate of price stability that is conducive for sustainable growth."
  },
  {
    "headline": "Why foreigners invested lowest amount in Nigeria stocks in 11yrs",
    "summarized_story": "Foreign investors invested the lowest amount of money in Nigerian stocks in 2021, as economic reforms dragged and opportunities in other markets proved more compelling.\nForeigners invested N434.50 billion in stocks in the whole of 2021, according to data by the Nigerian Exchange Group (NGX), the lowest since 2011 when N422 billion was invested.\nThe trend highlights the slow pace of economic reforms in Africa’s largest economy last year particularly regarding foreign exchange, according to three foreign investors interviewed by BusinessDay.\nWith their fingers burnt from the foreign exchange shortage, foreign investors stayed on the sidelines last year and are not likely to return this year.\nThe Ghana Stock Exchange posted the second-highest return with 38.59 percent while South African stocks posted a 24 percent gain."
  },
  {
    "headline": "Obaseki swears in 14 new permanent secretaries, as Edo readies for e-governance switchover February 1 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Tuesday, swore in 14 new permanent secretaries, urging them on the delivery of efficient and quality services to Edo people.\nObaseki, at the swearing-in of the new permanent secretaries, comprising nine males and five females at the Government House, Benin City, said the government will switch over from analogue to e-governance, effective from February 01, 2022.\n“We are working extremely hard to bring back the civil and public service to those days when it was respected.\nThe newly sworn-in permanent secretaries include Mr. Anelu Osemen, Mrs. Felicia Edwards, Mrs. Grace Aihie, Mr. Egwakhide Gilbert, Mr. Iserhienrhien Efe and Mr. Aikhuomobhogbe Uidia.\nOsemen, on behalf of the new permanent secretaries, pledged to reciprocate the confidence reposed on them, contributing effectively to the progress and development of the state."
  },
  {
    "headline": "Obaseki assures speedy completion of police project in Orhionmwon, others to boost security in Edo communities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has reassured the government’s commitment to ensure the speedy completion of the Police Area Command Office in Urhomehe, Orhionmwon Local Government Area, and other projects across communities in the state to improve security and guarantee the safety of lives and property of residents.\nThe governor noted that his administration’s sustained investment in the state’s security architecture is part of efforts to make Edo a safe haven for investors, ensuring the influx of investors into the state.\nNoting that the project is the first Area Command Office in Orhionmwon LGA, the governor said security remains a topmost priority for the state government.\nDisclosing the government’s plan to build accommodation for officers that would be posted to the Area Command, the governor reassured that the project will enhance formidable security architecture in the locality that meets international best practices.\nAlso, the jubilant residents of Urhomehe hailed Obaseki and EDSOGPADEC board for the project, noting that the building will speed up the development of the area."
  },
  {
    "headline": "Int’l Education Day: Obaseki urges more resilient, equitable systems to tackle learning poverty – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for increased collaboration among global stakeholders to build a more effective, equitable and resilient education system so as to tackle learning poverty and improve access to inclusive and quality education.\nObaseki gave the charge in commemoration of the fourth International Day of Education, marked by the United Nations and its sister agencies, with the theme ‘Changing Course, Transforming Education’.\nThe governor assured that his government will continue to deepen ongoing reforms in the state’s education sector, ensuring to provide the right infrastructure, technology and manpower for improved access to quality education across the state.\nAccording to him, “Today, as we mark the fourth International Day of Education, it is imperative to reiterate the need for a more resilient and equitable education system to tackle learning poverty, improve access to quality education and reduce the global out-of-school population.\n“Like other sectors, education suffered a huge gap during the COVID-19 pandemic due to the closure of schools, universities, and other educational institutions, excluding about 268 million children from school."
  },
  {
    "headline": "Edo retail sector booms, as new entrants disrupt market – Nigerian Observer",
    "summarized_story": "The Edo State Government has in the last few years advanced policies to attract investors, promising favourable policies and infrastructure to make the state an investors’ haven.\nThis resulted in the setting up of the Edo State Investment Promotion Office (ESIPO) and support for the provision of investment-friendly infrastructure.\nAccording to him, “A lot is happening with the retail sector in Edo State.\nThe new entrants are poised to provide jobs, thereby increasing economic activities.\nThey will help in the collection of indirect taxes and also provide jobs for youths."
  },
  {
    "headline": "I’m confident you’ll not disappoint – Obasi appeals to African youths to take action against climate change",
    "summarized_story": "“Of course, climate change is the most consequential issue of the 21st century.\n“Addressing climate change in Africa will create significant market opportunities, especially for the private sector and institutional investors,” he said.\n“It is heart warming, however, that the state government is taking action, and I commend the Governor Babajide Sanwo-Olu administration for unveiling a five-year Climate Action Plan (CAP) 2020-2025.\nOur Tomorrow will become an active player in the climate change ecosystem.\n“For me, I believe that saving Africa from the ravages of climate change is the great challenge of our generation."
  },
  {
    "headline": "Dangote keeps spot as Africa’s richest man",
    "summarized_story": "Chairman of the Dangote Group, Alhaji Aliko Dangote, has retained his position as the richest man in Africa, with a net worth of over $13 billion, according to the 2022 edition of the Forbes’ Top 10 Africa’s Billionaires List.\nDangote will be maintaining the top spot in the content’s billionaires list for the 11th year in a row, and is currently estimated to be worth $13.9 billion, up from $12.1 billion in 2021.\nThis according to the magazine, followed a 30 per cent increase in the stock price of Dangote Cement, his most valuable asset.\nThe report added that Africa’s billionaires were richer than they had been in years, despite the global pandemic.\nFounder and CEO of Globacom, Mike Adenuga, is sixth on the list with an estimated net worth of $6.7 billion."
  },
  {
    "headline": "Nigeria lists $4bn Eurobond on FMDQ",
    "summarized_story": "Nigeria’s Debt Management Office (DMO) has announcedthe listing of $4 billion Federal Government of Nigeria (FGN) Eurobonds on the FMDQ Securities Exchange.\nThe listing is in three tranches:•7 years – USD1.25 billion due September 2028 at 6.125%•12 years – USD1.50 billion due September 2033 at 7.375%•30 years – USD1.25 billion due September 2051 at 8.250%The Eurobond, which was issued in September 2021, was oversubscribed to the tune of USD12.2 Billion, and was described as “one of Africa’s most successful financial trades of 2021”.\nCurrently, the three-tranche listing of the Eurobonds on the FMDQ Securities Exchange Limited has provided a diversified pool of financial offerings for investors.\nFacebook Notice for EU!\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "MPC retains interest rate at 11.5%",
    "summarized_story": "The Monetary Policy Committee (MPC) of the Central Bank of Nigeria (CBN) has voted to retain the benchmark interest rate at 11.5%, whilst keeping all other monetary parameters constant.\nGovernor of the CBN, Mr. Godwin Emefiele disclosed this in a communique issued at the end of the first monetary policy committee meeting of the year, on Tuesday 25th January 2022.\nThe committee noted that the increase in the country’s inflation rate in December 2021 is attributable to increased demand during the yuletide and hence suggests that the uptick in the numbers could be a temporary development.\nThe members also believe that inflation will moderate further going into the new year driven by the significant interventions in the agricultural sector.\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "Unilever Sacks 1,500 In Global Overhaul",
    "summarized_story": "Unilever is cutting 1,500 management jobs around the world as the consumer goods giant comes under intense pressure from shareholders to boost growth.\nThe cuts amount to a 15% reduction in the number of senior managers and 5% of junior managers, Unilever said in a statement on Tuesday.\nShareholders have ratcheted up the pressure on Unilever after its stock sank 10% last year.\nThe firm’s shares got hammered last week after the company revealed it had made three failed bids to acquire GlaxoSmithKline’s consumer health care business.\nUnilever said Thursday that it would not raise its rejected £50 billion ($68 billion) offer, and the stock subsequently bounced back."
  },
  {
    "headline": "Mexican Journalist, Lourdes Maldonado López, Killed In Tijuana",
    "summarized_story": "Journalist Lourdes Maldonado López was killed on Sunday in northern Mexico’s border city of Tijuana, marking the third killing of a journalist in the country in two weeks.\nLópez was shot to death inside a car in Tijuana’s Santa Fe neighborhood, according to a Sunday statement from the Baja California Attorney General Office.\nLocal law enforcement first received a report on Sunday at 7 p.m. local time and found López dead upon arrival, it said.\nBonilla was sworn in as governor of Baja California in November 2019 after running a successful campaign as a candidate of López Obrador’s ruling Morena party.\nADVERTISEMENTCNN has reached out to Bonilla and PSN for comment."
  },
  {
    "headline": "Ex-Lagos SSG, Adeniran-Ogunsanya, Is Dead",
    "summarized_story": "A former Secretary to the Lagos State Government, Princess Adenrele Adeniran-Ogunsanya, is dead.\nIt was learnt that the she died early Tuesday, January 25, 2022 after a brief illness.\nAdenrele Adeniran-Ogunsanya, who was in her 60s, was the Lagos SSG during the first term in office of Governor Babatunde Raji Fashola, SAN between 2007 and 2011.\nShe was the daughter of prominent Ikorodu born politician and associate of the late Nnamdi Azikiwe, the late Prince Adeniran Ogunsanya.\nADVERTISEMENTThe deceased was the apex Leader of the Lagos4Lagos Movement which members recently defected to the Peoples Democratic Party (PDP) alongside with their lead visioner, Dr Abdul Azeez Olajide Adediran a.k.a Jandor."
  },
  {
    "headline": "Ex-Lagos SSG, Adeniran-Ogunsanya, Is Dead",
    "summarized_story": "A former Secretary to the Lagos State Government, Princess Adenrele Adeniran-Ogunsanya, is dead.\nIt was learnt that the she died early Tuesday, January 25, 2022 after a brief illness.\nAdenrele Adeniran-Ogunsanya, who was in her 60s, was the Lagos SSG during the first term in office of Governor Babatunde Raji Fashola, SAN between 2007 and 2011.\nShe was the daughter of prominent Ikorodu born politician and associate of the late Nnamdi Azikiwe, the late Prince Adeniran Ogunsanya.\nADVERTISEMENTThe deceased was the apex Leader of the Lagos4Lagos Movement which members recently defected to the Peoples Democratic Party (PDP) alongside with their lead visioner, Dr Abdul Azeez Olajide Adediran a.k.a Jandor."
  },
  {
    "headline": "Subsidy Suspension: Again, Federal Gov’t To Amend PIA",
    "summarized_story": "President Muhammadu Buhari has approved the suspension of the removal of fuel subsidy until further notice.\nSylva, who spoke to State House correspondents after the meeting, said the executive arm of government will propose 18-month extension to National Assembly to be incorporated in the Petroleum Industry Act (PIA) 2021.\n“We are proposing an 18-month extension but what the National Assembly is going to approve is up to them.\nWe would approve an 18-month extension and then it is up to the National Assembly to look at it and pass the amendment as the see it.\nA few months ago, the President already proposed an amendment to the law,” Sylva stated."
  },
  {
    "headline": "Social media post: Aphrodisiac seller, Jaruma, sent to prison for attacking Ned Nwoko",
    "summarized_story": "Social media post: Aphrodisiac seller, Jaruma, sent to prison for attacking Ned NwokoSocial media post: Aphrodisiac seller, Jaruma, sent to prison for attacking Ned NwokoPopular Kayanmata (aphrodisiac) seller, Hauwa Muhammed aka Jaruma, has been remanded in prison custody after attacking business tycoon, Ned Nwoko, on social media.\nJaruma was remanded by an Abuja Upper Area Court pending a bail hearing set for Friday.\nNwoko had accused Jaruma of publishing falsehoods on her Instagram page against him and his wife, Regina Daniels, who is an actress.\nHe said Jaruma claimed in an Instagram post that she paid N10m to Regina to advertise Kayanmata but the actress reneged.\nIn an Instagram post on December 9, 2021, the sex therapist made a video expressing her disappointment over the accusations Nwoko made against his ex-wife, Charani."
  },
  {
    "headline": "Social media post: Aphrodisiac seller, Jaruma, sent to prison for attacking Ned Nwoko",
    "summarized_story": "Social media post: Aphrodisiac seller, Jaruma, sent to prison for attacking Ned NwokoSocial media post: Aphrodisiac seller, Jaruma, sent to prison for attacking Ned NwokoPopular Kayanmata (aphrodisiac) seller, Hauwa Muhammed aka Jaruma, has been remanded in prison custody after attacking business tycoon, Ned Nwoko, on social media.\nJaruma was remanded by an Abuja Upper Area Court pending a bail hearing set for Friday.\nNwoko had accused Jaruma of publishing falsehoods on her Instagram page against him and his wife, Regina Daniels, who is an actress.\nHe said Jaruma claimed in an Instagram post that she paid N10m to Regina to advertise Kayanmata but the actress reneged.\nIn an Instagram post on December 9, 2021, the sex therapist made a video expressing her disappointment over the accusations Nwoko made against his ex-wife, Charani."
  },
  {
    "headline": "Wike: How we discovered Rivers’ aircraft secretly abandoned in Germany by Amaechi",
    "summarized_story": "GOVERNOR Nyesom Wike on Tuesday said Rivers State Government has uncovered the state owned Legacy 600 aircraft, allegedly abandoned in Germany since 2012 by his predecessor, Rotimi Amaechi led administration.\nWike who was on Monday sighted in a viral photo at the General Atomics Aerotec Headquarters in Munich, Germany among a delegation he led from Rivers state, said the aircraft was discovered through intelligence gathering.\nIkuinyi-Owaji Ibani; Deputy Speaker, Rivers State House of Assembly, Rt.\nEhie Ogerenye Edison; Rivers State Attorney-General and Commissioner for Justice, Prof. Zacchaeus Adangor; member of House of Representatives, Hon.\nKen Chikere; Rivers State chairman, Peoples Democratic Party, Ambassador Desmond Akawor; Chairman, Ikwerre LGA, Hon."
  },
  {
    "headline": "Wike: How we discovered Rivers’ aircraft secretly abandoned in Germany by Amaechi",
    "summarized_story": "GOVERNOR Nyesom Wike on Tuesday said Rivers State Government has uncovered the state owned Legacy 600 aircraft, allegedly abandoned in Germany since 2012 by his predecessor, Rotimi Amaechi led administration.\nWike who was on Monday sighted in a viral photo at the General Atomics Aerotec Headquarters in Munich, Germany among a delegation he led from Rivers state, said the aircraft was discovered through intelligence gathering.\nIkuinyi-Owaji Ibani; Deputy Speaker, Rivers State House of Assembly, Rt.\nEhie Ogerenye Edison; Rivers State Attorney-General and Commissioner for Justice, Prof. Zacchaeus Adangor; member of House of Representatives, Hon.\nKen Chikere; Rivers State chairman, Peoples Democratic Party, Ambassador Desmond Akawor; Chairman, Ikwerre LGA, Hon."
  },
  {
    "headline": "Labour Suspends National Protest Over Planned Subsidy Removal",
    "summarized_story": "The Nigeria Labour Congress’s leadership has postponed a planned nationwide protest slated for January 27, 2022.\nPresident of the Nigeria Labour Congress, Ayuba Wabba made the announcement on Tuesday, a few hours after the Federal Government indicated that petroleum subsidy would continue for another 18months timeframe.\nWabba said the decision to suspend the protest followed a virtual National Executive Council meeting held at noon on Tuesday.\nFollowing the reversal and reapproach by the government, the National Executive Council of the Nigeria Labour Congress met this morning virtually to consider the new position of the government.\nThe NEC after vigorous debates took a decision to suspend the planned nationwide protest scheduled for 27″ January 2022 and the national protest scheduled for 2″ February 2022."
  },
  {
    "headline": "JUST IN: Lagos State Govt. Suspends NURTW Operations Indefinitely Over Idumota Clashes",
    "summarized_story": "Following a threat by the President of the National Union of Road Transport Workers (NURTW) that the union’s chapter in Lagos could be suspended, the Lagos State Government has indefinitely suspended transport union operations around Lagos Island, particularly on Church Street, Eyin Eyo, and the Idumota Bridge, due to recent clashes that have paralyzed activities in the state’s Idumota axis.\nMore details soon…"
  },
  {
    "headline": "2023 Election: Islamic Group Attacks Afenifere Over Refusal To Support Tinubu",
    "summarized_story": "Muslim Rights Concern, an Islamic human rights organization, has taken on Afenifere, a Yoruba socio-cultural group, over the party’s reported refusal to endorse All Progressives Congress National Leader Bola Tinubu’s presidential ambitions in the upcoming 2023 general elections.\nThis was contained in a statement on Tuesday signed by MURIC Director, Ishaq Akintola, titled, ‘Tinubu: MURIC Tasks Afenifere’.\nWhen asked whether Afenifere would be backing Tinubu, Adebanjo had said, “I am not commenting on any candidature now.\nThe Islamic group’s statement read in part, “Afenifere is making a great mistake by distancing itself from Tinubu simply because the latter supported President Muhammadu Buhari.\nThe Yoruba socio-cultural group should neither reject its best candidate nor remain neutral at a time others are embracing their own.”"
  },
  {
    "headline": "BREAKING: Fuel Subsidy Will Last Another 18 Months – Federal Government",
    "summarized_story": "BREAKING: Fuel Subsidy Will Last Another 18 Months – Federal GovernmentThe federal administration has announced that the fuel subsidy will be extended for another 18 months, pending the National Assembly’s approval of a change to the Petroleum Industry Act.\nMinister of State for Petroleum Resources, Timipre Sylva gave this indication on Tuesday while briefing State House Correspondents in Abuja.\nAccording to Sylva, President Muhammadu Buhari being aware of the negative implications of total subsidy removal has graciously approved that the time frame be extended, to allow the government put necessary palliatives in place.\nDAILY POST recalls that in the last few weeks there has been apprehension over the government’s proposed plans to remove subsidy.\nNigerians had raised an alarm that the proposed subsidy removal could hike the petrol pump price to N302 per litre."
  },
  {
    "headline": "Revealed! Full list of richest people in Africa *Dangote on top again, two other Nigerians soar",
    "summarized_story": "Forbes Magazine, Monday, reported that Nigerian billionaire Aliko Dangote has topped the 2022 list of Africa’s richest persons for the 11th year in a row.\nAccording to the report, Dangote’s wealth jumped from $12.1 billion last year to an estimated $13.9 billion.\nForbes attributed the growth to a 30% increase in the stock price of Dangote Cement, his most valuable asset.\nTwo other Nigerian billionaires – Abdulsamad Rabiu and Mike Adenuga – ranked 6th and 7th richest persons on the continent with estimated values of $7 billion and $6.7 billion respectively.\nThe report added that Africa’s billionaires were richer than they had been in years, despite the global pandemic."
  },
  {
    "headline": "Breaking: Labour suspends nationwide protest over proposed fuel subsidy removal",
    "summarized_story": "The Organised Labour in Nigeria on Tuesday announced suspension of its protest over planned removal of subsidy on fuel by the federal government.\nThe latest decision is coming shortly after President Muhammadu Buhari announced suspension on the removal of fuel subsidy.\nThe new pump price was expected to take effect as from July, 2022.\nThe organised labour made up of the Nigeria Labour Congress (NLC) and the Trade Union Congress (TUC) had planned two-legged nationwide protest on January 27 and February 2, 2022.\nNLC President Ayuba announced the suspension of their planned protest in Abuja."
  },
  {
    "headline": "Breaking: Buhari okays suspension of fuel subsidy removal, tells NASS what to do in 18 months",
    "summarized_story": "President Muhammedu Buhari has approved the suspension of the removal of fuel subsidy until further notice.\nMinister of State for Petroleum Resources, Mr Timipre Sylva, said this while briefing State House correspondents in Abuja Tuesday.\nThe minister said the federal government is considering an 18-months extension to National Assembly for the implementation of the Petroleum Industry Act (PIA) taking effect February this year.\nPresident Buhari had on August 16, 2021 signed the Petroleum Industry Bill into law, which was passed by the Senate and the House of Representatives in July 2021.\nThe PIA is expected to grow investors’ confidence in Nigeria’s Petroleum Industry and create more employment opportunities for the populace in the host communities."
  },
  {
    "headline": "Fuel Subsidy: NLC Suspends Planned Nationwide Protest",
    "summarized_story": "The Nigeria Labour Congress (NLC) has suspended its planned nationwide protest.\nThe decision comes hours after the union had vowed to continue with its planned nationwide rally on Thursday and after the Federal Government announced the suspension of the planned removal of the fuel subsidy.\nRead Also: FG Proposes Extension Of Fuel Subsidy Removal By 18 Months, Seeks To Amend PIA“NLC is still standing on its position,” he had said.\nThe Federal Government had earlier announced the suspension of the planned removal of fuel subsidy.\nShe explained that the government would make provisions for fuel subsidy beyond its initial June deadline in the 2022 budget."
  },
  {
    "headline": "FG Proposes Delay Of Fuel Subsidy Removal By 18 Months, Seeks To Amend PIA",
    "summarized_story": "The Federal Government is proposing to extend the period for the implementation of the removal of subsidy on Premium Motor Spirit (PMS), popularly known as petrol, by 18 months.\nThe Minister of State for Petroleum Resources, Mr Timipre Sylva, announced this on Tuesday while briefing State House correspondents in Abuja.\nHe disclosed that the government has concluded plans to approach the National Assembly to amend the Petroleum Industry Act (PIA).\n“With assent by the President on August 16, 2021, the PMS subsidy removal was therefore expected to take place effective February 16, 2022.\nPresident Muhammadu Buhari, he stated, has assured Nigerians that his administration would continue to put in place all necessary measures to protect the livelihoods of the citizens, especially the most vulnerable."
  },
  {
    "headline": "NASS Passes Harmonised Electoral Bill With Direct, Indirect, Consensus Modes Of Primaries",
    "summarized_story": "It includes the direct, indirect, and consensus primary modes of nominating candidates by political parties for elections.\n“While the House passed the mode of primaries to be direct and indirect only, the Senate passed the mode of primaries to be direct, indirect and consensus.\n“The direct primaries is well defined on how it will be conducted; ditto the indirect primaries.\nAnd for the consensus, the two chambers have produced in this bill, very clear definition of how a consensus candidate would emerge.\n“(b) The procedure in paragraph (a) above of this subsection shall be adopted for direct primaries in respect of gubernatorial, senatorial, federal and state constituencies."
  },
  {
    "headline": "CBN Committee Retains Benchmark Interest Rate At 11.5%",
    "summarized_story": "﻿The Central Bank of Nigeria’s Monetary Policy Committee on Tuesday retained the Monetary Policy Rate (MPR) at 11.5% and kept all other parameters unchanged.\nCBN Governor Godwin Emefiele made the announcement while addressing journalists at the bank’s headquarters in Abuja.\nThe MPR, which has remained unchanged for months, is a powerful tool for regulating interest rates in the economy.\nLowering the rate could have stimulated more borrowing while raising the rate could have signaled the CBN’s intention to reduce the economy’s money supply."
  },
  {
    "headline": "2023 Elections: We Are Tired Of Seeing ‘Old Faces’ – Afegbua",
    "summarized_story": "﻿A member of the Peoples Democratic Party (PDP), Kassim Afegbua, has said that Nigerians are tired of seeing the same set of people contesting for president and that his party ought to change its strategy ahead of the coming 2023 elections.\n“I was specific about the aspiration of a man who represented the party in 2019 elections.\nI said we are tired of seeing old faces.\nAccording to Afegbua, the party should, this time, consider a zoning the presidency to the south.\nHe said the change is necessary for the sake of political stability."
  },
  {
    "headline": "Okowa recalls EAC Oghenesivbe three weeks after he was sacked -",
    "summarized_story": "Governor of Delta State, Ifeanyi Okowa, has recalled to duty his Executive Assistant on Communications, Fred Latimore barely three weeks after he was sacked.\nThe governor had on 29th December, 2021, relieved his appointment on grounds of gross insubordination and recklessness, traced to a post the Mr Latimore made on social media which was condemned in government circles.\nAdvertisementGovernor Okowa in a recall letter signed by the Secretary to the State Government, Patrick Ukah, cautioned Mr Latimore to strictly abide to the rules of engagement for political appointees and aides to the governor.\nReacting to development, Coalition for Media Politics and Governance in a statement by its Publicity Secretary, Tagbarha Malcolm, thanked Governor Okowa for being a listening, pragmatic, foresighted and responsive leader."
  },
  {
    "headline": "Reps, Senate harmonise Electoral Act Amendment Bill -",
    "summarized_story": "The National Assembly has Harmonized the Electoral Act Amendment Bill to allow for direct Primaries, indirect primaries and Consensus in Political party Elections.\nPresident of the Senate , Ahmad Lawan made the announcement at Plenary on Tuesday.\nAdvertisementConsensus is one the three options introduced in the re-amended Electoral Act Amendment Bill which the Senate passed on January 19.\nRecall that both chambers of the National Assembly Recommitted the Bill after it was Rejected by President Muhammadu Buhari and rescinded it’s decision on the contentious clause 84 that imposes Direct Primaries on Political PartiesAdvertisementWhile the Senate left all options open for the selection of Political Candidates, the House of reps did not approve for Consensus.\nHowever both Chambers have now harmonized contending clauses of the bill to now permit direct and indirect primaries and consensus."
  },
  {
    "headline": "Corruption Index: Nigeria ranks 154 out of 180 countries on CPI for 2021 -",
    "summarized_story": "Nigeria has once again dropped places to rank at 154 out of 180 countries in the transparency international corruption perception index report for 2021This was revealed at the launch of the 2021 index report released exclusively in Nigeria by the civil society legislative advocacy centreAdvertisementThis ranking puts Nigeria on 24 points dropping one point in scores and down 5 places compared to the previous year on the list."
  },
  {
    "headline": "Court fixes February 23 for arraignment of Ondo Speaker, lawmakers -",
    "summarized_story": "An Akure High Court has fixed February 23 for the arraignment of the Speaker of the Ondo State House of Assembly, Mr Bamidele Oleyeloogun and two members of the Assembly.\nThe EFCC had dragged the Speaker, former Clerk of the Assembly, Mr.\nAccording to him, the EFCC has not made the charges against the suspects available in order to prepare the defence.\nBut the counsel to the EFCC, Mr K U. Kudus said he has served the suspects through the House of Assembly.\nAdvertisementKudus asked the court to adjourn the matter for him to properly serve the suspects."
  },
  {
    "headline": "Abdulazeez Olajide Adediran: PDP Won the 2015/2019 Elections For APC in Nigeria",
    "summarized_story": "The Chairman of the Peoples Democratic Party, Dr Iyorchia Ayu, excitedly led six governors and other stalwarts of the party to receive the Convener of Lagos4Lagos Movement and member of the All Progressives Congress, Abdulazeez Olajide Adediran, into its fold.\nPopularly known as Jandor, Adediran who defected with thousands of his supporters, is preparing to contest the governorship election in Nigeria’s commercial capital next year"
  },
  {
    "headline": "Sam Ohuabunwa: I Understand Nigeria’s Problems",
    "summarized_story": "Sam Ohuabunwa, former President of the Pharmaceutical Society of Nigeria and Founder of Neimeth International Pharmaceuticals PLC, formally informs the Peoples Democratic Party of his intention to contest in the presidential election next year.\nHe highlights his chances of clinching the ticket of the PDP in what is expected to be a keen contest ahead of the elections."
  },
  {
    "headline": "AFCON: At Least Eight Killed in Crush at Yaounde Stadium",
    "summarized_story": "At least eight people have been killed and dozens more injured in a crush outside an Africa Cup of Nations football match in Cameroon.\nVideos showed crowds of screaming football fans being crushed at the entry gates to the Paul Biya stadium in the capital Yaounde.\nWitnesses described chaotic scenes outside the ground as thousands of fans struggled to get access.\nJournalist Leocadia Bongben told the BBC’s Newsday programme that she saw commotion coming from one of the fan zone areas outside the stadium.\nDiscarded shoes and other debris was strewn around the entrance of the stadium, he said."
  },
  {
    "headline": "Birthday Celebration for UK PM Johnson During Lockdown Sparks New Row",
    "summarized_story": "Boris Johnson is under renewed pressure after Downing Street admitted staff gathered inside No 10 during the first Covid lockdown to mark his birthday.\nITV News reported that up to 30 people attended the June 2020 event, sang Happy Birthday and were served cake.\nNo 10 said staff had “gathered briefly” to “wish the prime minister a happy birthday”, adding that he had been there “for less than 10 minutes”.\nLabour’s shadow foreign secretary David Lammy said Mr Johnson should reflect on his ability to live by the rules he made himself.\nFormer Conservative Party chair Baroness Warsi told the BBC News Channel it was time for Mr Johnson to “think long and hard about what is in the best interest of this country”."
  },
  {
    "headline": "Ukraine: US Troops on Alert as West Voices Unity",
    "summarized_story": "US President Joe Biden has said there is “total unanimity” with European leaders over Russia’s troop build-up on the border with Ukraine.\nA Downing Street spokesperson said the leaders “agreed on the importance of international unity in the face of growing Russian hostility”.\nShould a further Russian incursion into Ukraine happen, they agreed that “allies must enact swift retributive responses including an unprecedented package of sanctions”.\n“Going to western Ukraine I suppose, going somewhere where it’s going to be safe.”Russia has seized Ukrainian territory before, when it annexed Crimea in 2014.\nAfter Russian forces seized control, Crimea voted to join Russia in a referendum the West and Ukraine deemed illegal."
  }
]