[
  {
    "headline": "Terrorism cases’ secret trial illegal, Kanu tells court",
    "summarized_story": "The detained leader of the Indigenous People of Biafra, Nnamdi Kanu, has gone to court to challenge the practice direction of the Federal High Court which ordered that trial of terrorism cases like his matter be done in secret.\nThe Chief Judge of the Federal High Court, Justice John Tsoho, and its Chief Registrar were listed as defendants in the suit which processes were obtained by journalists on Monday.\nJustice Tsoho had released a new practice direction for the trial of terrorism cases before the court.\nThe IPOB leader also wants an order of perpetual injunction restraining the defendants from applying and enforcing the provisions of the Federal High Court Practice Directions (On Trial of Terrorism Cases) 2022.\n“An order of this Honourable court declaring the Federal High Court Practice Directions (On Trial of Terrorism Cases) 2022, unconstitutional, ultra vires, invalid, null, void, and of no effect.”Copyright PUNCH."
  },
  {
    "headline": "Sit-at-home: Gunmen attack Owerri, normalcy returns to Anambra",
    "summarized_story": "There was panic in Owerri, Imo State on Monday evening as suspected hoodlums took over the streets and were shooting.\nThe situation in Owerri was calm until some gunmen started shooting, sending residents scampering for safety.\nOfficers guarding the Owerri Custodial Centre responded by barricading the centre to avoid incursion by the gunmen.\nA bus loaded with passengers tumbled as it hit the road kerb while trying to make a hurried u-turn at Orji on the Owerri- Okigwe Road.\nMeanwhile, Anambra State on Monday witnessed improved commercial activities and movements since the Monday sit-at-home order began in the state."
  },
  {
    "headline": "Rising insecurity, naira’s fall worsening business environment – NGF",
    "summarized_story": "The Director-General, Nigeria Governors’ Forum, Mr Asishana Okauru, says worsening insecurity and currency depreciation have been adversely affecting the business environment and taxable income in Nigeria.\nThe NGF DG, who was represented by the Senior Programme Manager, NGF/SFTAS, Mr Lanre Ajogbasile, said this during a presentation at a workshop in Abuja organised by the States’ Fiscal Transparency Accountability and Sustainability Programme Coordination Unit of the Ministry of Finance, Budget and National Planning.\nHe added that the perceived weak social contract between citizens and the government continues to threaten the legitimacy of taxation.\nAccording to him, the COVID-19 pandemic has also impacted government spending, economic activities and government’s internally generated revenue, with states and FCT IGR shrinking by 2.1 per cent (N28.15bn) between 2019 and 2020.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "World Class bartending competition returns, unveils ‘Big 30’",
    "summarized_story": "By Juliet EbirimRecently, Guinness Nigeria announced the commencement of its foremost bartender competition, World Class.\nThis official flag off for the World Class journey which began in Lagos will stop in key cities across Nigeria before ending with a bang in Sydney, Australia.\nWorld Class is the world’s largest and most exclusive bartending competition, mixology education programme; curated to celebrate bartending creativity and innovative cocktail-making trends, while inspiring people to drink better and create unforgettable experiences in the process.\nWorld Class has supported, trained, and inspired over 400,000 bartenders, across 60 countries, for over twelve years, while partnering them with the world’s finest spirits – the Diageo Reserve collection.\nThe bartender competition is also our way of giving back some of the value we derive from a sector of the value chain that is often overlooked; our on-trade partners."
  },
  {
    "headline": "Achohra,Odjede felicitates with Dan Dolor at 50",
    "summarized_story": "Dan DolorOlorogun Ochuko Achohra and Engr Felix Odjede have felicitated with the Chief Executive Officer of Dan Dolor Limited, Chief Dafe Dan Dolor, on the occasion of his 50th birthday celebration.\nIn a congratulatory message jointly signed by the duo during the official ceremony of Chief Dan Dolor’s gubernatorial consultation dinner held at the London Park Lane Hilton which was attended by members of Delta State political family, they described Dan Dolor as a thoroughbred Businessman who has the potentials to transform Delta State.\n“Dan Dolor is a patriotic Deltan, who continuously initiates small scale businesses that cater for locals in his immediate community back home.\n“Distance has not affected the commitment he has for Deltans, despite residing in the UK, Dan Dolor is abreast of the challenges of his people.\n“It’s our prayer that God will continue protecting and grant him the needed strength to help in the building of a better Delta State”."
  },
  {
    "headline": "2023: Consider competence above zoning, Enugu Diaspora group urges",
    "summarized_story": "By Dennis AgboThe leadership of Enugu State Indigenes in Diaspora has urged politicians in the state to consider competence above zoning in arriving at the next set of leaders to be elected in the 2023 elections.\nThe group asked the state to discard any system that would not produce the best governor for the state in 2023.\n“Enugu State, more than ever, needs credible leadership as we prepare for the 2023 general elections.\nCredible leadership is key and essential to any sustainable growth and meaningful development.\n“The city of Dubai that has become the envy of nations, world tourist attraction and world commercial nerve centre, emanated from credible leadership."
  },
  {
    "headline": "African Development Fund: Adesina meets African Union’s Group of 15 Finance Ministers",
    "summarized_story": "By Jimoh BabatundeThe African Union’s Group of 15 Finance Ministers has agreed to a joint communique on financing Africa’s economic resilience in turbulent times, just as they called for a substantial replenishment of the African Development Fund.\nThis was made known in a meeting with the African Development Bank Group President, Dr Akinwumi Adesina, at the just-concluded Spring Meetings of the International Monetary Fund and World Bank in Washington DC, USA.\nDuring the meeting with the African Union’s Group of 15 Finance Ministers, Adesina outlined the continent’s immediate challenges and the solutions that were being applied to tackle them successfully.\nHe said the Bank will mitigate the effects of the food crisis through an African Food Crisis Response and Emergency Facility – a dedicated facility that will provide African countries with the resources needed to raise local food production and procure fertilizer.\nAccording to Adesina, a fertilizer crisis borne out of the Russian war in Ukraine could put more than $10 billion of food production at risk."
  },
  {
    "headline": "AfDB President excited with Melinda French Gates support",
    "summarized_story": "By Jimoh BabatundeAfrican Development Bank Group President, Dr Akinwumi Adesina, concluded a three-day official visit to Washington DC weekend.\nOne of such engagements was the meeting with the co-chair of the Bill & Melinda Gates Foundation, Melinda French Gates.\nDr Akinwumi Adesina on his verified tweeter handle @ akin_adesina wrote “ I had a great meeting with Melinda French Gates in Washington DC.\nThank you for strong support for the African Emergency Food Production Plan.”Vanguard gathered that French Gates said it is important for Africa to feed itself and focus on nutrition.\nFrench Gates also expressed strong support for the bold African emergency food production plan developed by the African Development Bank and she called for a strong replenishment of the African Development Fund."
  },
  {
    "headline": "Imo: UN sympathises with Nigeria over explosion at illegal refinery",
    "summarized_story": "Special Representative of the Secretary-General and Head of the UN Office for West Africa and the Sahel, Mr Mahamat Annadif, on Monday offered condolences to Nigeria over the Imo illegal refinery explosion.\nAnnadif stated in New York that he learned with deep emotion about the tragic explosion that occurred on Friday at a gasoline refinery in Imo.\nThe explosion, which occurred at the Abaeze forest in Ohaji/Egbema Local Government Area of Imo State, killed at least 100 persons.\nMeanwhile, the National Emergency Management Agency (NEMA) has stated that the death toll at the refinery had risen to 110.\nThe acting Head of Imo/Abia Operations Office of the agency, Mr Ifeanyi Nnaji, told NAN on Monday that more dead bodies were recovered in Orashi River, near the scene."
  },
  {
    "headline": "Minor cabinet reshuffle in Kwara",
    "summarized_story": "Governor AbdulRahman AbdulRazaq of Kwara State has effected a minor cabinet reshuffle involving two ministries.\nThe governor directed the Honourable Commissioner for Environment Abosede Olaitan Buraimoh to proceed to the Ministry of Solid Minerals.\nAlso, the Commissioner for Planning and Economic Development Mrs. Remilekun Banigbe reverts to the Ministry of Environment.\nThe reshuffle is with immediate effect according to a statement by the Chief Press Secretary to the governor, Rafiu Ajakaye in Ilorin on Monday."
  },
  {
    "headline": "War: Russia make advances in battle against Ukraine – UK Defence Ministry",
    "summarized_story": "The UK Defence Ministry has revealed that Russia has made minor advances in some areas since shifting its focus to fully occupying the Donbas city of Ukraine.\nIt also said that without sufficient logistical and combat support in place, Russia is yet to achieve a significant breakthrough against Ukraine.\nThe UK Defence Ministry disclosed this in a series of tweets via its Twitter handle on Monday while providing the latest update on the situation in Ukraine.\nIt tweeted: “Russia has made minor advances in some areas since shifting its focus to fully occupying the Donbas.\nWithout sufficient logistical and combat support enablers in place, Russia has yet to achieve a significant breakthrough."
  },
  {
    "headline": "Nigeria’s presidency: What Buhari told me – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo has revealed what President Muhammadu Buhari told him about the Presidency of Nigeria.\nThe Senior Advocate of Nigeria (SAN) made the disclosure on Monday when he visited Ondo Governor Rotimi Akeredolu in Akure, the capital.\nOsinbajo hailed Buhari for key assigning responsibilities to him since the All Progressives Congress (APC) assumed power in 2015.\nOsinbajo recalled that as Acting President, he got to know many things that most people will never come across.\n“As Acting President, you are president."
  },
  {
    "headline": "2021: 100,000 cases of Cholera record in Nigeria",
    "summarized_story": "About 100,000 cases of cholera were recorded in Nigeria in 2021, the highest in recent times, the World Health Organisation said.\nNigeria had earlier in 2021 recorded 111,062 cases of cholera, with 3,604 deaths, figures exceeding the number of cases and deaths recorded in 2020 as released by the Nigeria Centre for Disease Control.\nDr. Walter Mulombo, WHO Country Representative in Nigeria, gave the figure at a training session on oral cholera vaccine requests and campaign planning organised by the Global Task Force on Cholera Control (GTFCC).\nThe Global Task Force on Cholera Control (GTFCC) is an agency of the WHO.\nHe believed that the recently approved GTFCC application for Nigeria would significantly mitigate the risk of and upsurge of cholera cases during this rainy season."
  },
  {
    "headline": "‘Kano has done a lot in security of citizens’",
    "summarized_story": "Acting Governor of Kano State Nasiru Yusuf Gawuna, yesterday re-affirmed the commitment of the state government toward ensuring the security of lives and properties of its citizens.\nHe spoke yesterday when a delegation of participants of the Executive Intelligence Management Course (EIMC 15) from the National Institute for Security Studies (NISS) visited him in Government House, Kano.\nHe explained that in its efforts, the state government has expanded its security council to accommodate various security agencies by holding meetings regularly to access security situations in the state.\n“Kano is enjoying stability due to the concern and commitment shown by our governor Abdullahi Umar Ganduje,” the acting governor said.\nWhile thanking the acting governor for the reception accorded them, Adeleke added that the participants would also focus on intelligence, security, and strategic and contemporary issues."
  },
  {
    "headline": "Borno Poverty Alleviation commissioner Clark resigns",
    "summarized_story": "The Borno State Commissioner for Poverty Alleviation Mr Nuhu Clark has resigned from office to contest the Chibok State Constituency election on the platform of the All Progressives Congress (APC).\nClark told reporters in Maiduguri yesterday that his decision was to ensure quality representation for the people of Chibok.\nClark, who served as the Chairman of Chibok Local Government in 1999, said he was still connected to his people and that his project remained the people’s project.\nTalba is aspiring to contest Nganzai/Monguno/Marte Federal Constituency on the platform of the APC.\nThere are also unconfirmed reports that more than 10 Special Advisers to the governor have tendered their resignations."
  },
  {
    "headline": "Police bust kidnap syndicate in Ogun",
    "summarized_story": "The police in Ogun State have arrested nine suspected members of a notorious kidnap syndicate terrorising commuters on Abeokuta-Ayetoro Road.\nPolice spokesperson said credible intelligence gathered by policemen attached to Sabo/Ilupeju divisional police headquarters revealed that two of the suspects, Hammed Taiwo and Kehinde Jimoh, served as errand okada riders for the kidnap syndicate.\nThe suspects confessed being part of the syndicate, but said they were just errand boys watching out for law enforcement agents, according to the police.\n“Having discovered the hideout, the Divisional Police Officer mobilised his men, So-Safe Corps, OPC men, local hunters and men of Amotekun corps and subsequently stormed the place where all the nine members of the syndicate were arrested.\n“Investigation revealed that the suspects are the group terrorising Abeokuta/Ayetoro Road in recent times."
  },
  {
    "headline": "One dead, seven injured in Yobe blast",
    "summarized_story": "One person has been confirmed dead and seven injured in an explosion at Gashua in Bade council of Yobe State.\nSources said the blast occurred in a bar in Abacha area of the town at about 8.00pm on Sunday night.\n“Our men on the ground have told us that the preliminary investigation showed that a cooking gas caused the explosion.\nDue to the current heat in the state, the possibility of a gas explosion is high especially if it is not well attended to.\nIt’s not a Boko Haram attack,” Lt. Anyanwu said."
  },
  {
    "headline": "2023: It’d be disservice, injustice not to contest – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo has said he would be betraying Nigerians if he doesn’t contest the 2023 presidency.\nOsinbajo, who spoke in Akure while addressing delegates of the All Progressives Congress (APC) in the State, said he believed the hand of God was upon him.\n“With all that has been given to me, I now retire quietly, it will be a great disservice to our country.\nGod will make it happen and we will give the nation the best.”Governor Oluwarotimi Akeredolu said only God could make Osinbajo presidential bid became a reality.\n“Ondo State is a State for you and a state for all."
  },
  {
    "headline": "The Sun award, incentive for greater service –Gov Uzodimma",
    "summarized_story": "Imo State Governor, Sen. Hope Uzodimma, has expressed happiness over his nomination as Governor of the Year, saying the honour would spur him to offer greater service to the state and people.\nUzodimma and 25 others will receive The Sun awards on May 7, 2022 in Lagos.\nThe governor said: “I’m so excited to receive this award from a medium like yours.\nThe award is for the people of the state; without them I couldn’t have achieved anything.\nEarlier, The Sun MD said the choice of Uzodimma as Governor of the Year was based on what he has done in office in two years."
  },
  {
    "headline": "2023: It’ll be great injustice if I didn’t contest – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo, yesterday, said it would be injustice if he did not contest the 2023 election given the vast experience gained in his office in the last seven years.\nThe vice president hailed President Muhammadu Buhari’s open-mindedness in delegating him to serious tasks that had aided his experience.\nI am sure that everybody knows that I have formally declared my intention to run as president of the Federal Republic of Nigeria.\nI did so on Monday April 11, 2022 and I did so because, first of all there is nobody that can bear anything God does not decide that he would be, only God can make a person president, vice president, governor, anything whatsoever.\nPresident Muhammadu Buhari, just out of his open mindedness and his own generosity ensured that I was given very serious responsibilities as vice president and I also acted as president."
  },
  {
    "headline": "Tucano jets delay: Blame military not Kukah, NEF tells Presidency",
    "summarized_story": "But NEF’s Director of Publicity and Advocacy, Hakeem Baba-Ahmed, speaking on an AIT programme, yesterday, faulted the Presidency over the way it responds to criticisms.\nBut they need to improve the conduct of the Nigerian military, in the fight against the insurgency, against terrorists.\n“You know, the presidency spokespersons have a way of deflecting criticism by making it personal.\nPeople like Bishop Kukah and I are used to this.\n“So, whether it comes from Bishop Kukah or it comes from me, we made this point."
  },
  {
    "headline": "2023: Dollar scarcity hits banks",
    "summarized_story": "By Adewale SanyaoluThe race towards the 2023 election may have taken a negative toll on the foreign currency reserve base of banks as they currently battle Dollar scarcity.\nThe exchange rate between the naira and the US dollar closed at N419.5/$1 at the official Investors and Exporters (I&E) window last week.\nThe downturn in the market is following the drop in the amount of dollar supply in the market.\nHe however, said other customers were not as lucky as he was as they were turned down due to Dollar shortage.\nA visit by Daily Sun to some banks yesterday confirmed the claims of Olawoyin and most customers could not have access to Dollar."
  },
  {
    "headline": "Nigeria needs visionary leader to get out of current mess –Saraki",
    "summarized_story": "From Bamigbola Gbolagunte, Akure and Gyang Bere, JosFormer Senate President, Dr. Bukola Saraki and Peoples Democratic Party (PDP) presidential aspirant, has declared that Nigeria needs a visionary leader like him to overcome its current socio-economic crisis.\nHe said he would bring to an end the ravaging security challenges in Nigeria if elected president in 2023.\n“We can only get out of this mess if we have leadership that is visionary and one that understands the country.\n“The security situation in the country is very bad and you in Plateau have had the share of it.\n“Who is going to help us address the security situation, who better than one of us from the North Central?"
  },
  {
    "headline": "Oil Theft: Navy Seizes 6 Million Litres of Stolen Crude from Illegal Refiners",
    "summarized_story": "The site also had five large pits holding approximately 700,000 litres of stolen crude oil.\nDuring the operation, 19 ovens, 26 metal storage tanks and two dugout pits laden with about 250,000 litres of suspected stolen crude oil and 50,000 litres of illegally refined AGO were destroyed.\nDuring the operation, 16 ovens, 31 metal storage tanks and seven large pits all filled with about 850,000 litres of stolen crude oil were equally deactivated.\n“The wooden boat was laden with 60,000Litres of illegally refined AGO together with over 100 sacks of same product.\nThe authorities have been struggling to curb the proliferation of illegal plants where stolen crude oil is refined."
  },
  {
    "headline": "NEF: We’re Not Involved in PDP Consensus Arrangement",
    "summarized_story": "“So, based on this, I didn’t go to Minna, and the decision that the two people are the Northern consensus candidate doesn’t in anyway reflect my wish, and should therefore not worry my supporters.\nWe met on Wednesday and we agreed to bury the issue of consensus candidate.\nYes, one consensus candidate has not emerged but they have initiated a process, which can help the party later on.\nRather, it was the group of presidential aspirants made up of Senator Bala Mohammed, RT Hon Aminu Tambuwal.\nSenator Bukola Saraki and Alhaji Mohammed Hayatu-Deen that collectively, freely and willingly approached Gen Babangida to help select from amongst themselves a Consensus Presidential Aspirant."
  },
  {
    "headline": "Sanwo-Olu: Lagos Rail System to Commence Operation First Quarter 2023",
    "summarized_story": "* Blue line at 90% completion*Laments vandalism of rail equipmentSegun JamesLagos State Governor, Mr. Babajide Sanwo-Olu, yesterday, inspected the on-going construction of the Lagos Rail Line project and said the first quarter 2023 target for commencement of operational service was sacrosanct.\nThe governor, however, warned those that had started vandalising the barricades around rail line to desist from the act, saying the tracks are hazardous.\nSanwo-Olu inspected the Blue line rail project alongside some of his cabinet members, top officials of Lagos Metropolitan Area Transport Authority (LAMATA), and contractors handling the project.\nThe first phase of the Blue line rail project starts from Mile 2 and terminates at Marina.\nMarina Station is an elevated station and it stretches out to outer Marina and terminates where the Governor’s residence is."
  },
  {
    "headline": "Atiku, Tambuwal, Lamido Reject Saraki, Mohammed as Northern PDP’s Consensus Presidential Candidates",
    "summarized_story": "Atiku, Tambuwal, Lamido, and Hayatu-Deen, who are all PDP presidential aspirants, have also denounced the report of Prof. Ango Abdullahi, which endorsed Saraki and Mohammed as the North’s consensus presidential candidates with the backing of a former military President, Gen. Ibrahim Babangida (rtd).\nThe First Lady invited all presidential aspirants of all political parties, to the Ramadan Iftar, where he also hosted elected officials of the political parties.\nThe report, which shortlisted Saraki and Governor Mohammed as the two northern presidential consensus candidates, urged Tambuwal and the investment banker and economist, Hayatu-Deen to drop their presidential ambition.\nAlso denouncing the controversial consensus report, former Jigawa State Governor, Lamido called on all members of the party in the northern states to ignore it.\nThe position of the northern elders is not only injurious to the North but equally injurious to the northern aspirants,” Lamido explained."
  },
  {
    "headline": "Alaafin Lamidi Adeyemi Dies, Buried in Glory",
    "summarized_story": "He said the late Alaafin was a patriotic and highly respected traditional ruler who had immeasurable love for his people and great faith in a united Nigeria.\nIn a condolence letter to Makinde, Jonathan noted that the late Alaafin was a skilled custodian of the tradition and culture of his people who had an eventful and epoch-making reign.\nOsun State governor, Oyetola, also described the passing of the Alaafin of Oyo, as shocking, saying it signified the end of an era.\nOyetola also commiserated with his Oyo State counterpart, Makinde, and the entire Yoruba race over the demise of the late monarch.\nGovernor of Benue State, Ortom also yesterday commiserated with the government and people of Oyo State over the transition to the great beyond of the Alaafin of Oyo."
  },
  {
    "headline": "BREAKING: Traditional Worshippers Protest Open Display Of Alaafin Of Oyo's Corpse on Internet During Burial",
    "summarized_story": "The Traditional Worshippers Association of Nigeria, Oyo State branch has condemned the open display of the corpse of the late Alaafin of Oyo, Oba Lamidi Adeyemi III, during the Muslim prayer session, saying it was against the tenets of traditional respect for a dead king.\nThe association disclosed this on Sunday in a statement jointly signed by its Chairman, Adefabi Dasola and Secretary, Dr. Fakayode Fayemi Fatunde respectively.\nThe statement noted that the late monarch never minced words in condemning the open display of any Yoruba Oba remains for any purpose while he was alive.\nThe traditional worshippers said it was disappointing to see the corpse of a revered monarch being displayed all over the internet.\nIn fact, Oba Adeyemi was a true devotee of Ṣango and that was why he joined the ancestors on Sango Worship day."
  },
  {
    "headline": "BREAKING: Traditional Worshippers Protest Open Display Of Alaafin Of Oyo's Corpse on Internet During Burial",
    "summarized_story": "The Traditional Worshippers Association of Nigeria, Oyo State branch has condemned the open display of the corpse of the late Alaafin of Oyo, Oba Lamidi Adeyemi III, during the Muslim prayer session, saying it was against the tenets of traditional respect for a dead king.\nThe association disclosed this on Sunday in a statement jointly signed by its Chairman, Adefabi Dasola and Secretary, Dr. Fakayode Fayemi Fatunde respectively.\nThe statement noted that the late monarch never minced words in condemning the open display of any Yoruba Oba remains for any purpose while he was alive.\nThe traditional worshippers said it was disappointing to see the corpse of a revered monarch being displayed all over the internet.\nIn fact, Oba Adeyemi was a true devotee of Ṣango and that was why he joined the ancestors on Sango Worship day."
  },
  {
    "headline": "EXCLUSIVE: Document Exposes How Wema Bank Officials Offered Policeman Bribe To Stop Investigation On N1.7billion Money Laundering, Fraud",
    "summarized_story": "“The culpability of WEMA Bank officers was further confirmed when the officers tried to bribe investigating officers with large envelopes that contained money.\nThe Executive Director of the Bank, Mr Wole Akinleye, was also invited and he tried hard to derail and stop the investigation.\nMeanwhile, the police has charged one Ojo Oladipupo, Chief Security Officer of Wema Bank Plc, to court for attempted bribery.\nSee Also Exclusive EXCLUSIVE: How Wema Bank Top Officials Used Redeemed Church Pastor’s Account For N1.7billion Money Laundering, Fraud“Guess what they do after, they now moved that N1.7billion from Adewole’s account into different bank accounts in tranches.\nIn January 2022, a group, Transparency Nigeria Group, asked the Central Bank of Nigeria to dismiss the Chief Executive Officer of Wema Bank, Ademola Ademise, over alleged fraud."
  },
  {
    "headline": "EXCLUSIVE: Document Exposes How Wema Bank Officials Offered Policeman Bribe To Stop Investigation On N1.7billion Money Laundering, Fraud",
    "summarized_story": "“The culpability of WEMA Bank officers was further confirmed when the officers tried to bribe investigating officers with large envelopes that contained money.\nThe Executive Director of the Bank, Mr Wole Akinleye, was also invited and he tried hard to derail and stop the investigation.\nMeanwhile, the police has charged one Ojo Oladipupo, Chief Security Officer of Wema Bank Plc, to court for attempted bribery.\nSee Also Exclusive EXCLUSIVE: How Wema Bank Top Officials Used Redeemed Church Pastor’s Account For N1.7billion Money Laundering, Fraud“Guess what they do after, they now moved that N1.7billion from Adewole’s account into different bank accounts in tranches.\nIn January 2022, a group, Transparency Nigeria Group, asked the Central Bank of Nigeria to dismiss the Chief Executive Officer of Wema Bank, Ademola Ademise, over alleged fraud."
  },
  {
    "headline": "'Light Has Prevailed Over Darkness' -- Ondo AAC Party Welcomes Sowore After Court Dismissed Restriction To Abuja",
    "summarized_story": "The Ondo State chapter of the African Action Congress (AAC) has welcomed human rights activist, Omoyele Sowore, to the state.\nIn a statement, Alex Adeniyi, the state chairman of the party, hailed the court order which dismissed the restriction of Sowore to the Federal Capital Territory since he was arrested in 2019.\nAdeniyi also expressed the excitement of AAC members in Ondo to receive him in the state.\nIn the history of mankind and Nigeria in particular, light has prevailed over darkness.\n\"The African Action Congress, Ondo State chapter is most gracious to God for vindicating our leader and we are glad to welcome him back home."
  },
  {
    "headline": "Ayo Adebanjo: If based on merit, only south-east will produce presidents",
    "summarized_story": "Ayo Adebanjo, Afenifere leader, says if the office of the presidency was based on “merit”, only candidates from the south-east will hold the office “till kingdom come”.\nAccording to Adebanjo, it’s the turn of the south-east to produce the next president in the interest of fairness and equity.\n“When it is now the turn of the south and the south-east, they’re now propounding a new theory — the question of merit.\nIf it was based on merit, till today, till kingdom come, the east alone will produce president.\nAdvertisement“For the fact that they’re saying you have no people, I’m happy you have demonstrated that you do."
  },
  {
    "headline": "Ayo Adebanjo: If based on merit, only south-east will produce presidents",
    "summarized_story": "Ayo Adebanjo, Afenifere leader, says if the office of the presidency was based on “merit”, only candidates from the south-east will hold the office “till kingdom come”.\nAccording to Adebanjo, it’s the turn of the south-east to produce the next president in the interest of fairness and equity.\n“When it is now the turn of the south and the south-east, they’re now propounding a new theory — the question of merit.\nIf it was based on merit, till today, till kingdom come, the east alone will produce president.\nAdvertisement“For the fact that they’re saying you have no people, I’m happy you have demonstrated that you do."
  },
  {
    "headline": "It’ll be betrayal to Nigeria if I don’t run for president, says Osinbajo",
    "summarized_story": "Vice-President Yemi Osinbajo says it will be a “betrayal” to Nigeria if he doesn’t contest the presidency in the general election.\nThe vice-president said aside from his current position, having served as acting president for over seven months has also given him the needed experience to lead Nigeria.\nI declared my intention based on the fact that I have served for over seven months as acting president.\nI was given very serious responsibilities as an acting president.\nAdvertisement“Many times, the president, when he was away, said pointedly to me that ‘look, I don’t want to feter your discretion in any way; as acting president, you are president; just make sure you are fair and just; don’t refer anything to me; don’t ask me any questions; just do whatever you need to do’."
  },
  {
    "headline": "It’ll be betrayal to Nigeria if I don’t run for president, says Osinbajo",
    "summarized_story": "Vice-President Yemi Osinbajo says it will be a “betrayal” to Nigeria if he doesn’t contest the presidency in the general election.\nThe vice-president said aside from his current position, having served as acting president for over seven months has also given him the needed experience to lead Nigeria.\nI declared my intention based on the fact that I have served for over seven months as acting president.\nI was given very serious responsibilities as an acting president.\nAdvertisement“Many times, the president, when he was away, said pointedly to me that ‘look, I don’t want to feter your discretion in any way; as acting president, you are president; just make sure you are fair and just; don’t refer anything to me; don’t ask me any questions; just do whatever you need to do’."
  },
  {
    "headline": "Elon Musk agrees to buy Twitter for $44bn",
    "summarized_story": "Elon Musk, the billionaire founder of Tesla Inc., has agreed to buy Twitter Inc. for $44 billion.\nAccording to the deal, investors will receive $54.20 for each Twitter share they own, the company said in a statement Monday.\nUpon completion of the transaction, Twitter will become a privately held company.\nAdvertisementBret Taylor, Twitter’s Independent Board Chair, said, “The Twitter Board conducted a thoughtful and comprehensive process to assess Elon’s proposal with a deliberate focus on value, certainty, and financing.\nAdvertisementRecently, Musk acquired a 9.2 per cent stake and announced a $43 billion offer to buy the company."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Twitter accepts Elon Musk’s $44 billion offer to buy the company. Users are bracing for changes",
    "summarized_story": "Twitter has accepted Elon Musk’s offer to purchase the company for roughly $44 billion.\nThe social media platform disclosed in a press release today that Musk purchased the company at $54.20 a share, the same price named in his initial offer on April 14, 2022.\nIn the initial SEC filing, Musk expressed his plan to take the company private.\nParag Agrawal, Twitter’s CEO, appeared to support the move, saying in the press release that “Twitter has a purpose and relevance that impacts the entire world.\nLet’s see how the new owner of Twitter deal with fake accounts, spam bots and authenticating all human beings of this platform."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, It's the weekend again, and I've been looking forward to it!\nFirst off, thank you for sticking with me...."
  },
  {
    "headline": "Cheers to a healthier you or a faster Internet?",
    "summarized_story": "I had contacted Reliance hoping that they would cover a mental health illness different from depression.\nSo, while we raise a glass to a healthy and productive week, I’ll be discussing:Equiano: A faster Internet connectionWave’s e-money licenceEquiano: A faster Internet connectionGoogle’s Submarine Cable shipThis week looks wonderful.\nHere it is: Equiano, a cutting-edge submarine Internet cable, is set to arrive in Lagos, Nigeria, on Friday, April 29, 2022.\nFunded by Google, the Internet cable has a capacity of 144 terabits (18 Terabytes) and is named after Olaudah Equiano, the historical abolitionist.\nBut Google’s Internet cable could help reduce the download time to 1.2 minutes."
  },
  {
    "headline": "Say goodbye to clout chasing on the gram",
    "summarized_story": "AdvertisementWhen you compare this to, say, California, United States – which has an estimated 630,000 developers – you’ll see that this is a problem.\nInstagram prioritises originalityAdam Mosseri, Instagram CEO, announced on Wednesday, April 20, 2022, that the company will change its ranking algorithm to emphasise original content more prominently on its platform.\nThis would also help to prioritise the distribution of original content over reposted content in places like the Reels tab and feed.\nWe’re going to do more to try and value original content more, particularly compared to reposted content,” he says.\nWhat’s more, Mosseri mentioned two recent product launches: product tagging and enhanced tagging."
  },
  {
    "headline": "What you need to know as Google’s Equiano cable lands In Nigeria",
    "summarized_story": "Share this article:Google has announced the launch of Equiano, a state of the art submarine Internet cable, which is set to land in Lagos, Nigeria.\nThe Internet cable, named after Olaudah Equiano, a historical abolitionist, has a capacity of 144 terabits (18 Terabytes).\nOne of the landmark moments was in 2009, during the launch of the MainOne submarine cable, a private submarine cable that today spans Nigeria, Ghana, and Cote d’Ivoire.\nThere’s a vast submarine cable capacity in Africa that still doesn’t reflect on your download speeds or streaming quality.\nAs of 2020, Africa had a submarine cable capacity of 100 Tbps, but it was only using 10%."
  },
  {
    "headline": "Twitter share price surges as board reconsiders Elon Musk takeover bid",
    "summarized_story": "Following Twitter’s reconsideration of Elon Musk’s offer to acquire the micro-blogging platform, Twitter’s share price has increased by 5.3 percent.\n“Twitter share price rises by 5.3 percent in premarket trading” Spectacular index tweeted.\nAccording to Bloomberg, an undisclosed source revealed that Twitter board made the move to negotiate with Musk on Sunday.\n“Those who dismissed Elon’s plan to buy Twitter last week now look foolish as Twitter boards in advanced discussions with Elon Musk to come to a deal.\nThis in combination with the shared amount of public support has made sure that the board must make a deal.”@pirateStyle7 tweeted that “the whole world stands with Elon Musk.”"
  },
  {
    "headline": "Premium Trust Bank opens to customers, to prioritise ‘speed of execution’",
    "summarized_story": "Nigeria’s latest licensed bank, Premium Trust Bank, opened to customers after the Easter holidays in Port Harcourt as the Managing Director, Emmanuel Emefienim, says the speed of execution of activities and programmes would set the new bank apart in the industry.\nSpeaking with newsmen after the opening, the CEO who left Sterling Bank to pilot Premium Trust explained that the bank operates within the same rules and within limits allowed by the regulators.\nHowever, it is the strategic method or style of delivering on products that set a bank apart.\nWe know the people, we know the market, we understand the environment, and we understand the market.\nHe said within a few years, Premium Trust Bank would become a household name in Nigeria."
  },
  {
    "headline": "Nigeria’s biggest consumer goods firms walk tight rope on rising operation cost",
    "summarized_story": "The cost-to-income ratio gives a clear view of how efficiently the firm is being run and is calculated by dividing the operating expenses by the operating income generated.\nOperating expenses increased to N11.54 billion from N9.69 billion in the comparable period.\nThe company increased operating expenses by 9.27 percent to N59.87 billion from N54.79 billion in the period under review.\nOperating expenses jumped to N6.01 billion compared to N5.74 billion in the comparable periods.\nCost of sales grew to N135.9 billion compared to N106.32 billion in the period under review."
  },
  {
    "headline": "What positive effect will a change of guard bring in 2023?",
    "summarized_story": "For many years, one can hardly see a few committed leaders in the polity.\nAnd it is doubtful if Nigeria’s democracy of more than 20 years has groomed committed leaders with shared vision in quality and quantity to bring about the positive effect that we crave for in 2023.\nWhile Exide in Ibadan produced the batteries, not just for Nigeria but for the entire West Africa.\nSome firms in Ibadan produced the windshields, brake pads and discs.\nWe strongly believe that committed leaders have a continual passion for a difference in the lives of the citizens through good governance."
  },
  {
    "headline": "2023 Election: I can only contest if I am endorsed by the President-Jonathan – Nigerian Observer",
    "summarized_story": "The NIGERIAN OBSERVER gathered that Jonathan had informed some APC leaders that he would only join the presidential race if he was directly endorsed by the President, Major General Muhammadu Buhari (retd.).\nThe party chieftain stated, “I can tell you they are facing a tough task as far as Jonathan is concerned.\n“Another tough task the party may face is how it will convince other aspirants like Tinubu, Osinbajo, Amaechi, Umahi and Bello to step down.\nAnd for him to contest, he must have spent a year in the party and our primary will hold in the one month’s time.\nUntil he now proves to the whole world that he is a card-carrying member of the APC, it can’t be."
  },
  {
    "headline": "Falana condemns APC N100m nomination forms, As Party begins sale of forms – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestHuman rights Lawyer, Femi Falana, SAN, Sunday, condemned the APC for fixing the fees of its presidential nomination and expression of interest forms at N100m.\nHe, therefore, suggested that the APC and PDP should remove the “outrageous fees” and charge administrative fees of not more than N10,000 per aspirant.\nIn a statement he signed titled, ‘Illegality of outrageous nomination fees,’ he noted that the apparent endorsement of the controversial nomination fees by Buhari reeks of hypocrisy because, in 2014, he had told Nigerians that he had to borrow N27.5m to purchase his nomination form.\n“In this circumstance, political parties may only be permitted by law to charge administrative fees,” he said.\nConsequently, nomination forms for aspirants vying for the House of Assembly would be sold at the various state secretariats of the party nationwide while forms for other positions such as the House of Representatives, Senate, governorship and Presidency would be sold at the national secretariat, Abuja."
  },
  {
    "headline": "2023: Makinde invites PDP aspirants over party’s primary – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Governor of Oyo State, Seyi Makinde, has invited all aspirants who have the ambition to contest for different political positions in 2023.\nThe meeting which was scheduled to hold at the Oyo State Government House will commence at 11.am today.\nMakinde instructed all the aspirants to attend the meeting as all pending issues ahead of the 2023 primary of the party would be resolved.\nThe NIGERIAN OBSERVER gathered that the Governor invited the aspirants due to some discrepancies trailing the forthcoming primary of the party.\nIt was gathered that leaders and aspirants of the party in some constituencies are not in agreement with the candidates to flag the party’s flag due to some internal wrangling."
  },
  {
    "headline": "Obaseki pledges quality healthcare, as Edo begins free treatment, surgeries for heart, kidney, other ailments – Nigerian Observer",
    "summarized_story": "The beneficiaries during the five-day medical mission are to receive surgical interventions and treatments for heart, kidney, eye and other ailments.\n“The Nigerian professionals who are working with them are going to continue to be here; come for your follow-ups.\nThis mission is aimed at providing top of the range and critical medical services to the ordinary Edo citizens,” he added.\nThe governor further noted, “Nobody is going to come from anywhere in the world to treat us or give us care.\nWe have to do it ourselves and we’re lucky that some of the best people providing care for us around the world are our own children."
  },
  {
    "headline": "Elon Musk reach deal with Twitter to buy platform for $44bn",
    "summarized_story": "Tesla CEO, Elon Musk, on Monday, struck a deal oto buy Twitter for roughly $44 billion.\nTwitter agreed to sell itself to Mr. Musk for $54.20 a share, a 38 percent premium over the company’s share price this month before he revealed he was the firm’s single largest shareholder.\nIt would be the largest deal to take a company private — something Mr. Musk has said he will do with Twitter — in at least two decades, according to data compiled by Dealogic.\nBy taking the company private, Mr. Musk could work on the service out of sight of the prying eyes of investors, regulators and others.\nHow hands-on Mr. Musk plans to be at Twitter is unclear."
  },
  {
    "headline": "Biafra: Kanu kicks against secret trial, heads to court to challenge decision",
    "summarized_story": "Mazi Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), has gone to court to challenge the practice direction of the Federal High Court, which ordered that his trial should be done in secret.\nThe IPOB leader in a suit,asked the court to declare that the provisions of Order III of the Federal High Court Practice Directions (On Trial of Terrorism Cases) 2022, were already the subject of Section 36 (4)(a) and (b) of the constitution of the Federal Republic of Nigeria, 1999, as amended, and consequently, “they areotiose, inoperative and outright ultra vires.”Kanu in the originating summons filed by his lawyer, Ifeanyi Ejiofor, asked the court to declare it “invalid, null, void and of no effect whatsoever.”The Chief Judge of the Federal High Court, Justice John Tsoho, and its Chief Registrar were listed as defendants in the suit which processes were obtained by journalists in Abuja on Monday.\nRecall that Justice Tsoho had released a new practice direction for the trial of terrorism cases before the court.\nThe cases of Kanu, Bureau de Change operators indicted over sponsorship of terrorism, and Boko Haram suspects are currently before the court.\nJustice Tsoho said the new practice direction was in the exercise of his constitutional powers as enshrined in Section 254 of the Constitution of the Federal Republic of Nigeria 1999 (as amended)."
  },
  {
    "headline": "Nigeria recorded N2.23trn fiscal deficit in Q4 2021",
    "summarized_story": "The federal government of Nigeria recorded N2.23 trillion fiscal deficit in the fourth quarter (Q4) of 2021, according to Central Bank of Nigeria (CBN).\nThe CBN which made the disclosure in its economic report for the fourth quarter of 2021, said the 12 per cent contraction in fiscal deficit followed a decline in aggregate expenditure in the fourth quarter of 2021.\n“The shortfalls were largely the result of poor performances in some oil revenue components.\n“This is a deviation from the 51:49 non-oil versus oil revenue mix, projected in the 2021 budget.\n“Federation receipts in the fourth quarter of 2021 declined, following shortfalls in oil revenue."
  },
  {
    "headline": "Mother Earth Day: Dangote Cement doubles measures to curb degradation",
    "summarized_story": "As the world celebrates the United Nations International Mother Earth Day, leading Cement manufacturer in Africa, Dangote Cement Plc, has reiterated its commitment to protecting the earth through efforts aimed at mitigating environmental degradation.\nHe remarked that poor waste management is a known environmental challenge on the continent and that “Dangote cement is addressing this problem through co-processing of various alternative fuels.\nThe key message for Earth Day, according to him is to act in a bold way, innovate in a broad way, and implement climate action in an equitable manner which supports Dangote Cement’s contributions to SDG 13 and aligns with the Environment pillar of the Dangote way.\nIn his remark, the Head, Alternative Fuel Project, Dangote Cement Plc, Mr. Peter Anagbe said this year’s Earth Day offers Dangote Cement the opportunity among others to “demonstrate our contribution to sustainable waste management and the inclusion of local communities in our value chain through the Alternative Fuel (AF) Project.\nAlso speaking on the occasion of the World Earth Day, the Head, Sustainability, Dr. Igazeuma Okoroba explained that Dangote Cement has done a lot to protect the mother earth through strategic actions to protection of the environment from further pollution and degradation."
  },
  {
    "headline": "Arts: Onobrakpeya, Kanye Tagbo-Okeke Lend Voices To Autism",
    "summarized_story": "Nigeria’s art colossus and father of art in the country, Prof. Bruce Onobrakpeya will be participating at the maiden exhibition to raise awareness for children living with autism.\nThis was disclosed in a statement made known to the public by Mr. Femi Coker, the manager Orisun Art Gallery Abuja.\nThe exhibition will be in collaboration with Mr. Tagbo-Okeke, the father of Kanye who will organize a first-of-its-kind art exhibition, to commemorate the event, bringing together in an art exhibition Prof. Bruce Onobrakpeya, a quintessential master artist and educator and the prodigious autistic teenage artist, Kanye Tagbo-Okeke, from April 29, 2022 at the gallery.\nTherefore, children with autism have a special need for care and attention.\n“We are particularly delighted to be working with Bruce, he is a name that is being respected in the art circles."
  },
  {
    "headline": "JUST-IN: Elon Musk Strikes Deal To Buy Twitter For $44bn",
    "summarized_story": "The board of Twitter has agreed to a $44bn (£34.5bn) takeover offer from the billionaire Elon Musk.\nMr Musk, who made the shock bid less than two weeks ago, said Twitter had “tremendous potential” that he would unlock.\nThe firm initially rebuffed Mr Musk’s bid, but it will now ask shareholders to vote to approve the deal.\nThe firm company is currently led by Parag Agrawal, who took over from co-founder and former boss Jack Dorsey last November.\nMr Musk has suggested this will give him freedom to make the changes he wants to the business."
  },
  {
    "headline": "Farmers Applaud CBN’s Interventions In Grain Production, Urge Expansion Of ABP",
    "summarized_story": "Farmers in Nigeria have commended input and market linkage interventions of the CBN, calling on the Federal Government to spread the coverage of the Anchor Borrowers’ Programme (ABP) to every state of the country following good results in rice and maize production.\nAlthough the country is said to be deficient in the two commodities, production have increased significantly through the ABP.\nThe farmers lamented that seeds, fertiliser and other inputs for food crop production have become too expensive, and escalating assistance to them through the ABP scheme is not only desirable but also expedient for the country.\nThe farmers include grain, cereal, cassava, cocoa, yam and sweet potato farmers, among others.\nA maize breeder at the Institute of Agricultural Research and Training, Prof. Samuel Olakojo, said improved seeds and new production technologies would boost productivity of farmers and ensure closing the production gap."
  },
  {
    "headline": "Chairmanship: Abia APC Stalwarts Switch Support To Ononogbu, Donate Funds",
    "summarized_story": "The party stalwarts include members of the National Assembly – House of Representatives spokesman, Hon.\nSam Onuigbo representing Bende, and Ikwuano/Umuahia federal constituencies of Abia State respectively – as well a two-time governorship aspirant in the state, Chief Henry Ikoh.\nOthers include members of the State House of Assembly, Chijioke Chukwu and Mike Ukoha of Bende South and Arochukwu state constituencies respectively, and a former legislator, Dr.\nObioma emerged state party chairman at a parallel state congress conducted by a former member of the State House of Assembly on the platform of the defunct All Nigeria Peoples Party (ANPP), Hon.\nNkeiruka Onyejeocha, said the time to sit on the fence on issues concerning the state had gone, urging APC members to take the message to every nook and cranny of the state."
  },
  {
    "headline": "EFCC Arrests Man, 30, For Allegedly Defrauding Kwara Monarch N33.3m",
    "summarized_story": "The victim, Alh Idris Sero Abubakar, is the Emir of Okuta in Baruten local government area of the state.\nThe Head, Media and Publicity of EFCC, Wilson Uwujaren, made the disclosure in a statement on Monday.\n“The monarch stated that the syndicate provided different accounts for him to pay ‘the money for the clearance of the goods’, one of which included that of Fidelis Poor.\n“He further stated that efforts to get the goods delivered or recoup his money had been unsuccessful, hence he petitioned the EFCC.\n“The Commission upon the receipt of the petition commenced discrete investigation into the matter, which led to his (Fidelis) arrest,” Uwujaren stated."
  },
  {
    "headline": "Video: PDP would have given Tinubu automatic ticket",
    "summarized_story": "Bauchi State Governor and presidential aspirant, Bala Mohammed on Monday said if Asiwaju Bola Tinubu were to be in PDP, he would have gotten the party’s ticket automatically.\nTinubu is aspiring for the 2023 presidency under the banner of the All Progressives Congress (APC), while Mohammed is aspiring for the same position under the PDP.\nSpeaking on Arise TV, Mohammed said when he met Tinubu at the event, he was calling him consensus.\nHe said he told Tinubu that if he were to be in PDP, he would be given an automatic ticket to contest the presidential election.\n“I was luck I met Bola Tinubu, he was calling me consensus and I told him that if he were in PDP, PDP would have just given him the ticket because we knew that without you Buhari would not have been president and in PDP, we recognise contribution."
  },
  {
    "headline": "Graham-Douglas left a legacy of service: Buhari mourns 4-time minister",
    "summarized_story": "President Muhammadu Buhari said Chief Alabo Tonye Graham-Douglas, who held several portfolios as minister, left a legacy of distinguished service to the nation.\nPresident Buhari in a statement by Femi Adesina sympathised with the Government and people of Rivers State over the loss of the politician.\nDouglas was at different times Minister of Aviation, Minister of Labour and Productivity, and Minister of Tourism.\nGraham-Douglas public service began in 1986 when he became Commissioner for Youths, Sports and Culture in the Rivers State.\nIn 1989, the military government of Ibrahim Babangida appointed him Federal Minister for Social Development, Youths and Sports."
  },
  {
    "headline": "Confusion, stampede as hoodlums invade Owerri at noon, residents scamper for safety",
    "summarized_story": "There was stampede in Owerri, the Imo state capital when sporadic gunshots were heard Monday afternoon.\nBlueprint reports that as soon as the sound reverberated, business outfits around popular Okigwe road, works layout and Imo State University (IMSU) junction stood still.\nIt was also gathered that security operatives at the Owerri Correctional Centre, close to the Government House, replied with gunshots, obviuosly to signal their readiness to ward off a possible attack.\nAs at the time of filing this report, no casualty was reported, and no statement had come from the Imo state Police command on what transpired or the cause of the shootout.\nShare this: TwitterFacebook"
  },
  {
    "headline": "At last, Twitter set to accept Elon Musk’s $43 billion buyout offer",
    "summarized_story": "According to a report, Twitter is on the verge of accepting Elon Musk’s $43 billion bid to take the social network private.\nReuters reports that Twitter could announce that it has accepted Musk’s offer later on Monday, after its board has met to recommend the transaction to Twitter shareholders.\nDespite this, Twitter would be able to accept an offer from another party if it paid Musk a break-up fee, according to the sources.\nAccording to the report, Musk’s outreach forced the Tesla CEO’s $43 billion takeover bid to be seriously considered by the board of directors.\nAccording to the sources, Musk’s insistence that his bid for Twitter is his “best and final” has become a stumbling block in the deal negotiations."
  },
  {
    "headline": "Breaking: Pandemonium as explosion rocks Senate President’s home town, 1 dead, 6 injured",
    "summarized_story": "Resisdents of Gashua in Bade local government area of Yobe state are now living in fear after an Improvised Explosive Device (IED) triggered explosion hit the community Sunday night.\nAlready, one person has been confirmed dead while six others in a specialist hospital are injured.\nAn eyewitness said the incident occurred around 7:20pm when a heavy sound was heard, which threw the entire area into pandemonium.\nPolice Public Relations Officer (PPRO) Yobe state command, ASP Dungus Abdulkarim, confirmed to newsmen in Damaturu, that the explosion occurred from a likely IED.\n“Although our EOD detectives are at the scene to find out what type of explosion and the cause of the explosion."
  },
  {
    "headline": "Local bitumen production will crash cost of road construction – Adegbite",
    "summarized_story": "By Palma IleyeMinister of Mines and Steel Development, MMSD, Arc Olamilekan Adegbite has said that the cost of road construction in the country would ultimately go down with the local production of bitumen.\nAdegbite made this statement in Abuja during a press briefing on the concession of the delineated Nigerian bitumen blocks, as the nation commenced the process of local bitumen production.\nHe also observed that local bitumen production would save the country foreign exchange and generate income for the government.\nHe said: “To ensure that Nigeria’s bitumen resources are fully harnessed for industrial and infrastructural development, I constituted a nine-member Ministerial Bitumen Development Committee on 31 January 2020.\nThis will increase demand for road infrastructure and put additional strain on the current road network, resulting in higher demand for asphalt for construction and maintenance."
  },
  {
    "headline": "NCC, stakeholders brainstorm on Blockchain’s benefits to economy",
    "summarized_story": "By Onu OkorieThe Nigerian Communications Commission (NCC), stakeholders in the academia, the public sector and enthusiasts of technology for development, have deliberated on the benefits derivable from emerging technologies such as Blockchain, to advance the growth of the Nigerian economy.\nThe stakeholders, who spoke in turn at the workshop, acknowledged and profoundly appreciated the role of NCC in engendering a dynamic digital regulatory environment, the remarkable contribution to the growth and development of novel and emerging technologies, and NCC’s adoption of adaptive mechanisms that have enhanced emerging technologies in Nigeria.\nHe also affirmed that Blockchain would be central in the implementation of the National e-Govt Masterplan.\nArabi asserted that Nigeria ranks third in Africa, in the use of telecommunications for public service delivery, coming behind South Africa and Egypt.\nArabi called on policymakers to ensure robust policy formulation that ensures improved digital literacy and increased automation in public service delivery."
  },
  {
    "headline": "CBN defends multiple exchange rates",
    "summarized_story": "This was in reaction to the president of the World Bank, David Malpass, who had mentioned on Wednesday, at a press conference that, the multiple exchange rates in the country is not encouraging to investors and also not an effective way of managing the country’s exchange rate.\nAccording to Emefiele, the CBN is working on a home grown solution at merging the exchange rates even as he said there is need to first merge the level of demand with that of supply.\nThat will also start to also reduce the demand for foreign exchange that will normally will go for importation of petroleum products.\nRight now no foreign exchange for importation of rice or maize, very little amount for wheat.\nThat is what we’re trying to do and I imagine that by the time we achieved this, we will continue to engage with World Bank or the IMF,” he pointed out."
  },
  {
    "headline": "Sovereign Trust Insurance grows profit by 42%",
    "summarized_story": "By Kehinde Ibrahim LagosSOVEREIGN Trust Insurance Plc has announced that it recorded 42 per cent growth in its Profit After Tax in 2021.\nThe company’s Profit After Tax during the period stood at N974 million as against N687 million recorded in year 2020.\nProfit Before Tax equally increased from N796 million in 2020 to N885 million in the year under review, representing 11 per cent growth.\nThe net premium income also grew by 11 per cent from N6.5 billion to N7.2 billion in 2021.\n“The development is indeed a commendable one considering the myriad of challenges that the insurance industry had to deal with in the past year of 2021, ”the Sovereign Trust Insurance boss stated."
  },
  {
    "headline": "LG Technology helping families reduce food waste at Ramadan",
    "summarized_story": "By Kehinde Ibrahim LagosLG Electronics has said its innovative technology is helping families eat healthier and reduce food wastage during Ramadan.\nAccording to the general manager, Home Appliances Division, LG Electronics West Africa, Mr. Brian Kang, LG is committed to not just helping people eat healthy, but reducing food waste.\nHe said, “Food waste is a known issue during Ramadan, and.\nThe company said in a statement that global food waste is a massive issue with huge financial, ethical, and environmental costs.\nOne global brand that have continuously rethink how food wastage can be better managed is home appliance leader, LG Electronics."
  },
  {
    "headline": "2023: I’m Contesting In Order Not To Betray Nigerians – Osinbajo",
    "summarized_story": "﻿Vice-President Yemi Osinbajo on Monday said it will be a betrayal to Nigeria if he doesn’t contest the presidency in the 2023 general elections.\nSpeaking during a visit to Ondo State Governor, Rotimi Akeredolu and stakeholders of the All Progressives Congress (APC) in the state, Osinbajo said aside from his current position, having served as acting president for months has also given him the needed experience to lead Nigeria.\nREAD ALSO: 2023: Amaechi Visits Ondo Traditional Ruler, Pledges To Construct Railways If Elected President“Many people are dying for the country every day.\nI declare my intention based on the fact that I have served for over seven months as acting president.\nSince Osinbajo announced his intention to run for president on April 11, he has been travelling round the country to seek support for his ambition."
  },
  {
    "headline": "Twitter Confirms Sale Of Company To Elon Musk For $44bn",
    "summarized_story": "“Free speech is the bedrock of a functioning democracy, and Twitter is the digital town square where matters vital to the future of humanity are debated,” Musk said in a statement released by Twitter.\nMusk, who has complained of overzealous moderation on the platform, bought a nine-percent stake in Twitter earlier in April, then offered to buy the whole company outright, citing a mission of preserving free speech.\nLast week, Musk — whose immense wealth stems from the popularity of Tesla electric vehicles as well as other ventures — said he had lined up financing.\nDespite Musk’s wealth, the question of financing had been seen as a potential stumbling block because much of his holdings are in Tesla shares rather than cash.\nMusk’s efforts have raised hopes about the commercial potential of Twitter, which has struggled to achieve profitable growth despite its influential spot in culture and politics."
  },
  {
    "headline": "Death Toll In Imo Illegal Refinery Explosion Rises To 110 – NEMA Official",
    "summarized_story": "The death toll in the illegal refinery explosion in Imo State has risen to 110, the National Emergency Management Agency (NEMA) has said.\nMr Ifeanyi Nnaji, who is the agency’s Head of Operations in the state, confirmed the toll in an interview with Channels Television on Monday.\nChannels Television had reported that an unconfirmed number of people were killed in the explosion that occurred at an illegal refinery site on Friday night.\nHe, however, stated that NEMA and other relevant agencies involved in the recovery have yet to ascertain the cause of the tragedy.\nREAD ALSO: Many Burnt Beyond Recognition In Imo Illegal Refinery ExplosionAccording to Nnaji, those who should have recounted what transpired already lost their lives to the incident, but NEMA will soon come out with a report."
  },
  {
    "headline": "Malaria Killed Over 602,000 People In Africa Last Year – WHO",
    "summarized_story": "No fewer than 602,000 people died of malaria across Africa last year, an official of the World Health Organisation (WHO) has said.\nDr Matshidiso Moeti, WHO’s Regional Director for Africa, said this on Monday in her message to commemorate this year’s World Malaria Day tagged ‘Harness innovation to reduce the malaria disease burden and save lives’.\n“Malaria remains a significant public health and development challenge,” she declared.\nShe said the past year has seen significant breakthroughs in malaria prevention and control, in spite of the COVID-19 pandemic.\n“Despite some slowing of progress to reduce malaria cases and deaths, and the disruptions to health services caused by COVID-19, we are still much further ahead than we were in 2000."
  },
  {
    "headline": "Reps Suspend Plenary Over Renovation Of Chambers",
    "summarized_story": "The House of Representatives have suspended its plenary session scheduled to hold on Tuesday.\nThis is due to ongoing renovations in the House Chambers, a notice from the House Clerk said.\n“This is to inform all Honourable Members and other legislative Staff that the House Plenary earlier scheduled for Tuesday, 26th April, 2022 will no longer hold,” the notice read.\nREAD ALSO: Chrisland Schools Reopen After One Week“This is due to the early commencement of renovations in the Chambers and extension of time for Committees to file in their outstanding reports.\n“A new date will be communicated in due course."
  },
  {
    "headline": "I Will Betray Nigerians If I Don't Contest-Osinbajo -",
    "summarized_story": "Vice President Yemi Osinbajo on said that he would be betraying Nigerians if he failed to contest for president.\nOsinbajo stated this in Akure, the Ondo State capital when he visited Governor Oluwarotimi Akeredolu to expressed his intension to succeed President Muhammadu Buhari in 2023.\nHe admitted that he was given responsibilities by President Buhari to run the affairs of the nation as an acting president.\nThe vice president disclosed that President Buhari only charged him to be fair and just while in charge.\nAccording the vice president, “It’s an opportunity to be called to public service."
  },
  {
    "headline": "There's little or no difference between APC, PDP",
    "summarized_story": "Veteran Journalist, Babajide Kolade-Otitoju, has described the ruling All Progressives Congress and the People’s Democratic Party as inseparable couple whose ideologies are the same.\nHe made this disclosure while featuring on a live streaming show, #IssuesWithJide on Saturday.\nMr Kolade-Otitoju says there is little or no difference between the two parties."
  },
  {
    "headline": "2023: PDP row thickens as NEF disowns Bala, Saraki",
    "summarized_story": "The Northern Elders Forum (NEF) distancing itself from the purported consensus among some presidential aspirants within the People’s Democratic Party.\nThe quartet of Sokoto state Governor Aminu Waziri Tambuwal, Bauchi state Governor Abdulkadir Bala Mohammed, former Senate President Abubakar Bukola Saraki and renown economic expert and seasoned banker, Mohammed Hayatuo-Deen, had traversed the length and breadth of the country championing the consensus arrangement.\nBut the arrangement collapsed when the duo of Bala and Saraki from the North-east and North-central respectively, were announced by a committee of northern leaders and presidential aspirants within the party."
  },
  {
    "headline": "APC, PDP have monetised democracy in Nigeria",
    "summarized_story": "Veteran Journalist and Public Affairs Analyst, Babajide Kolade-Otitoju has accused the All Progressives Congress and the People’s Democratic Party of monitising democratic with their extravagant nomination form fees.\nHe made this known on Saturday while tearing on his show “Issues With Jide” an online programme that streams on TVC News Youtube Channel.\nThe Kogi-born journalists said the current fees released by the two parties for nomination forms clearly show democracy has been monitised in Nigeria."
  },
  {
    "headline": "Elon Musk and Twitter Reach Agreement for $44bn Takeover",
    "summarized_story": "Twitter has reached an agreement for billionaire Elon Musk to buy the social media platform in a $44bn (£34.6bn) deal.\nThe announcement followed, what were reported to be, extensive discussions between Mr Musk and Twitter’s board starting on Sunday that stretched into Monday.\nThe purchase price represents a 38% premium to Twitter’s closing stock price on 1 April, which was the last trading day before Mr Musk disclosed his 9% stake.\nBret Taylor, Twitter’s independent board chair, said of the numbers: “The Twitter board conducted a thoughtful and comprehensive process to assess Elon’s proposal with a deliberate focus on value, certainty, and financing.\nIt came just days after he rejected a seat on the social media company’s board, which would have stopped him from taking over the company."
  },
  {
    "headline": "Presidency Blames Kukah For Delayed Jets + Aisha Wants Female Vps- Trending With Ojy Okpe",
    "summarized_story": "Reactions have trailed First Lady Aisha Buhari’s Iftar dinner in which she hosted presidential hopefuls from various political parties.\nDuring the dinner, the first lady encouraged the aspirants to ensure that the forthcoming elections are free and fair and advised them to adopt women as their running mates.\nIn another development, presidential spokesman Garba Shehu has come under fire on social media for saying criticism the administration of President Muhammadu Buhari contributed to delaying of the delivery of the Super Tucano fighter jets ordered from the United States."
  },
  {
    "headline": "Nigeria: NDLEA Arrests Suspected Drug Baron Behind N3bn Tramadol Linked to Abba Kyari’s Team",
    "summarized_story": "Nigeria’s National Drug Law Enforcement Agency (NDLEA) on Monday said the billionaire drug baron fingered in the N3 billion tramadol deal involving the embattled suspended Deputy Commissioner of Police, Abba Kyari-led Intelligence Response Team, IRT, is now in their net.\nThe price of a carton of tramadol was negotiated at N17 million each as against the then black market value that ranged between N18 million and N20 million a carton in Lagos.\nHe said after the arrest of Ukatu’s staff: Pius Enidom and Sunday Ibekwete, Kyari’s men were then led by the suspects to Mallinson’s warehouse at Ojota in Lagos where 197 additional cartons of tramadol 225mg were seized by the IRT Team.\nThe monetary value of the 202 cartons of the seized products from Mallinson in one day was over N3 billion.\nBabafemi recalled that Kyari and four top members of his team are already facing trial for a different but similar offence at a Federal High Court in Abuja."
  },
  {
    "headline": "Twitter Set to Accept Musk’s Original $43bn Takeover Offer",
    "summarized_story": "Twitter may announce the $54.20-per-share deal later on Monday once its board has met to recommend the transaction to Twitter shareholders, the sources said.\nStill, Twitter would be allowed to accept an offer from another party by paying Musk a break-up fee, the sources added.\nStill, Twitter would be allowed to accept an offer from another party by paying Musk a break-up fee, the sources added.\nMusk’s negotiating tactics – making one offer and sticking with it – resembles how another billionaire, Warren Buffett, negotiates acquisitions.\nMusk did not provide any financing details when he first disclosed his offer for Twitter, making the market skeptical about its prospects."
  },
  {
    "headline": "‘If Zoning Means the Person with the Muscle Takes it, Then There’s No Basis for It’- Osita Chidoka",
    "summarized_story": "Nigeria’s former Aviation Minister, Osita Chidoka, joins ARISE News on #TheMorningShow to discuss the current state of affairs within the political landscape in Nigeria, as the 2023 elections are fast approaching.\nOne of the Chieftains and member of the People’s Democratic Party comments on the issues of zoning, consensus candidacy amongst othetr things."
  }
]