[
  {
    "headline": "Agric subsidy: Farmers fault FG, govt claims six million operators registered",
    "summarized_story": "The Presidency and the All Farmers’ Association of Nigeria on Wednesday clashed over the Federal Government’s claim on the registration of farmers.\nIn Bauchi State, the Chairman of the association, Mahmoud Yakubu, in an interview with The PUNCH, stated, “In my capacity as Chairman of Bauchi state farmers’ association, I am not aware of that.\nWe have representatives for yam farmers, poultry farmers, fish farmers and others.\n“We’ve captured over six million and very soon we will be giving direct subsidy to registered farmers.\n“I am the president of all farmers’ association and we have chapters in the 36 states and in the 774 local governments."
  },
  {
    "headline": "Caught in the web: Killer herdsmen, floods overrun farms, destroy yields, insurance firms fail to lift hapless farmers",
    "summarized_story": "Some of them also claimed that insurance companies were selective of the type of agricultural insurance offers to make available to farmers.\nHe noted that the collaboration between farmers and insurance firms was also geared towards addressing issues of mistrust which farmers had for insurance.\nHe said insurance firms had also told cassava farmers that destruction caused by herdsmen could not be insured.\n“This is because we have insurance companies that are specialists in agric insurance, such as the Nigerian Agricultural Insurance Corporation, which is one of the companies licensed solely for agric insurance.\n“Therefore I don’t believe that insurance firms do not want to insure farmers."
  },
  {
    "headline": "My youth, middle age, old age have been glorious, now every day is for thanksgiving, says Osoba at 82",
    "summarized_story": "My feeling is that of thanksgiving to God for His grace and his benevolence in all aspects of my life.\nI can confess to you that Oba Sikiru Adetona, the Awujale of Ijebuland, reminds me every day that I should take every day as a day of thanksgiving.\nHe tells me that every aspect of my life, my youth, my schooldays, my middle age, my old age, have all been very glorious.\nHe is a father in a million and he keeps reminding me every day that I should be doing thanksgiving to God.\nI stand on the fact that we should rotate the Presidency between the North and South of the party."
  },
  {
    "headline": "85 lives lost in road traffic crashes in Edo — FRSC",
    "summarized_story": "No fewer than 85 persons have lost their lives and 279 injured in various road traffic crashes (RTCs) recorded in Edo between January and June, the News Agency of Nigeria (NAN) reports.\nThe figure was given by Mr Henry Benamaisia, Sector Commander of the Federal Road Safety Corps (FRSC) in the state.\nGiving a breakdown of the lives lost, the sector commander disclosed that 24 persons died in January; 13 in February and 14 in March.\nThe sector commander also disclosed that of the 114 road traffic crashes recorded, 23 occurred in January, 18 in February, and 17 in March.\n“From the total crashes, 39 were fatal and 61 serious, while we recorded 14 minors involved in the crashes”, Benamaisia said."
  },
  {
    "headline": "Governor Lalong condoles Chukwu Anthony Kanu, OSA",
    "summarized_story": "On 9th July 2021, the Governor of Plateau State, and the Chairman of the Northern Governors Forum visited the Prior Provincial of the Order of Saint Augustine, Province of Nigeria, Very Rev.\nProf. Ikechukwu Anthony KANU, OSA to commiserate with the Order of Saint Augustine on the demise of Rev.\nRaymond Hickey, OSA.\nDuring the visit, the Governor acknowledged the role that Fr Raymond Hickey OSA played in the development of the faith and culture of the Northern part of Nigeria.\nProf. Ikechukwu Anthony Kanu, OSA, the Prior Provincial of the Augustinians in Nigeria appreciated the visit of the Governor and observed that Fr Raymond Hickey OSA would remain immortal in the hearts of the Augustinian family in Nigeria and that the Province would ensure that they keep alive the fascination of the values of Fr Hickey."
  },
  {
    "headline": "State of the Nation: Obasanjo in closed-door meeting with SDP leaders",
    "summarized_story": "By Dayo Johnson AkureThe former President, Chief Olusegun Obasanjo has met privately with national leaders of the Social Democratic Party, SDP on the state of the nation.\nAgunloye was a two time Minister under President Obasanjo as Minister of State Defence (Navy) and later full Minister of Power and Steel while Dr Faroumbi was the Nigerian Ambassador to the Philippines, also under the President Obasanjo regime.\nContacted, Dr Olu Agunloye confirmed the meeting of top leaders of the party with the former President to vanguard.\nDr Faroumbi and I met the former President Obasanjo in private.\nBut vanguard learnt that the party leaders would be meeting again with the former President at a later date."
  },
  {
    "headline": "Effective collaboration will help address sub-regional standard challenges – Osinbajo",
    "summarized_story": "The Strategic Framework for the establishment of National Early Warning and Response mechanisms was adopted by the ECOWAS Heads of State and Government at the 45th ordinary session which held in Accra, Ghana in July, 2014.\nA major objective of a national Coordination Centre for the early warning mechanism is to strengthen the ECOWAS strategy for information sharing among Member States, so as to avert or reduce threats.\nAccording to the Vice President, “I don’t think there is a better time for this process (than now) which will lead to full implementation of the Early Warning and Response System.\nWe are at a time nationally, and sub-regionally, where the security threats that confront us are becoming more violent, they are asymmetric, spread faster than before, and they are cross border in their nature.\n); Interior, Ogbeni Rauf Aregbesola; Finance, Budget and National Planning, Dr Zainab Ahmed; Humanitarian Affairs, Disaster Management and Social Development, Hajiya Sadiya Farouq; Women Affairs, Dame Pauline Tallen; and National Security Adviser, Maj. Gen. Babagana Monguno (retd."
  },
  {
    "headline": "Zulum emerges Vanguard Personality of The Year 2020 Award",
    "summarized_story": "By Ndahi Marama, MaiduguriProfessor Babagana Umara Zulum, the Executive Governor, Borno State and Chairman, North East Governors’ Forum has emerged VANGUARD PERSONALITY OF THE YEAR 2020 AWARD.\nHe said, “I am much honoured to emerge as the only Governor Awardee 2020 in the whole of Northern Nigeria by most reputable National Tabloid, Vanguard Media Limited, VML”.\n“It is obvious that you mean well for the people of Borno State and that you want to leave solid legacies that can stand the test of time.\n“For these and many reasons, VML here confers on you this well deserved award, which is in recognition of and celebration of Excellence and quality service to humanity.\nYours truly,”For: Vanguard Media LimitedEze AnabaEditor."
  },
  {
    "headline": "Gunmen murder Udala FC owner, Philip, manager, policemen",
    "summarized_story": "Unknown gunmen have killed Philip Udala, Chairman of Udala Football Club in Anambra State.\nThe billionaire was murdered when his convoy was ambushed at Eke-Agu Market junction in Abatete, Idemili North Local Government Area.\nThe policemen attached to Udala were killed and vehicles set ablaze.\nAnambra: Gunmen kill AIFL scribe as club chairman goes missingGodsent Eriobu, Udala FC Manager and Secretary of Anambra Independent League (AIFL), also in the motorcade, was shot dead.\nFr Obinna Dike, Chairman of AIFL, said the league lost two key members who loved the game."
  },
  {
    "headline": "Residents, commuters beg FG to repair dilapidated Osogbo-Ogbomoso road",
    "summarized_story": "Residents of Ilobu, Ifon-Osun and Erin-Osun towns in Irepodun and Orolu Local Government Councils of Osun and motorists plying the Osogbo-Ogbomoso road, have cried out to the Federal Government to expedite action and rehabilitate the abandoned road.\nSpeaking with DAILY POST Tuesday, residents of the towns and commuters, expressed fears over the state of the road as Eid-l-Kabir festival approaches.\nA transporter, Jelili Olawale revealed that commuters plying the road apart from spending much time also spend hugely on spare parts as a result of poor road network.\n“We spend too much time on the road and also spend huge amount on spare parts every week as a result of this bad road.\nMeanwhile, the Osun State Commissioner for Works and Transport, Remi Omowaiye when contacted, said the state government had concluded plans to take over the road project from the Lameco junction, Osogbo to Ifon-Osun."
  },
  {
    "headline": "World Bank commends Yahaya Bello for returning $4.63m",
    "summarized_story": "The World Bank has hailed Kogi State Governor, Yahaya Bello, for refunding US$4.63million surplus funds under the Nigeria Erosion and Watershed Management project (NEWMAP).\nThe institution said the action has made it possible to extend similar projects to other States facing deficit funds.\nChaudhuri said the timeliness helped the bank’s decision to extend the closing date of the project from June 30, 2021 to June 30, 2022.\nThe World Bank urged the state government to bring the project to an orderly closure, while achieving its intended objective of transforming lives and alleviating poverty.\n“We also take this opportunity to request that you kindly also expedite the issuance of a required Letter of Comfort”, Chaudhuri added."
  },
  {
    "headline": "Suleiman Yakubu: We have lost an exceptional journalist",
    "summarized_story": "The Speaker of the Kaduna State House of Assembly, Chairman Northern Speakers Forum, Alhaji Yusuf Ibrahim Zailani, has described the demise of veteran journalist, Suleiman Yakubu as a great loss not only to his family, employers, Kaduna State, but the entire nation.\nZailani expressed this while reacting to the death of the journalist, who died early Wednesday after a brief illness.\nThe Speaker, in a condolence message through his Special Adviser, Media and Publicity, Ibrahim Dahiru Danfulani, described that the deceased was a professional to the core, who was exceptional in serving Freedom Radio, Kaduna, until his demise.\nZamfara Lawmaker, Ahmad’s death shocking — SpeakerAccording to Speaker the death of Suleiman Yakubu is a great loss, saying that he is short of words and sad about the news of the tragic loss.\nAccording to him, “As the chairman of Freedom Radio chapel of the Nigeria Union of Journalist, he was a role model, mentoring several contemporaries and fresh journalists.”The Speaker condoled his immediate family, the NUJ Kaduna State Council and Freedom Radio over the incident and prayed Almighty Allah to grants him Aljannah Firdaus."
  },
  {
    "headline": "Reps order suspension of Navy recruitment with all 44 new intakes from the North",
    "summarized_story": "The House of Representatives has ordered the Nigerian Navy to suspend its ongoing recruitment exercise, describing it as unfair and not in compliance with the federal character principle in the Constitution.\nThe House noted that “every Nigerian deserves to be treated with dignity and rights, irrespective of where they may be located physically in the country.”Also, the lower chamber requested the Navy to provide details of all its recruitments from 2014 to date, including the geographical spread.\nIt further mandated the Navy to “investigate the exercise and recommend appropriate measures to avoid similar constitutional violations in all future government recruitment and report back within 12 weeks for further legislative action.”These resolutions followed the unanimous adoption of a motion to investigate the process of the Nigerian Navy Supplementary Recruitment of 44 candidates.\nSponsor of the motion, Ben Igbakpa, explained that all the successful candidates that are to report for training at the Nigerian Navy Basic Training School Onne, Port Harcourt, Rivers State, “are all from a particular part of the country, which negates the federal character principle of all inclusiveness, equity and fair play.”Recall that the Nigeria Navy described as ”fake” a list of supplementary candidates making the rounds on social media.\nThe list had all 44 candidates from the North."
  },
  {
    "headline": "Two soldiers killed as troops battle ESN in Enugu",
    "summarized_story": "By Okodili Ndidi, AbujaTwo soldiers have been killed as troops repelled attack by Eastern Security Network at Adani community in Uzo-Uwani Council Area of Enugu State.\nThe troops were deployed to check the activities of gunmen in the community before gunmen attacked thier location at Iggah/Asaba checkpoint.\nRead Also: Protesting women seal hotel allegedly harbouring ESN members“Sadly, during the fire fight that ensued, two soldiers paid the supreme price.\n“We assure the general public of our commitment to provide adequate security in the general area in collaboration with other security agencies.\nWe also urge members of the public to complement the effort of the security agencies by remaining law abiding and provide useful information on the fleeing gunmen”."
  },
  {
    "headline": "Lawan: I received 900 SMS in one day over alleged ‘doctoring’ of Electoral Bill",
    "summarized_story": "By Sanni Onogu, AbujaSenate President Ahmad Lawan has refuted allegations the Senate had introduced extraneous clauses into the Electoral Act (amendment) Bill.\nLawan spoke following the laying of the report on the Bill by the Chairman, Senate Committee on the Independent National Electoral Commission, Senator Kabiru Gaya (Kano South) at plenary.\nKey among the clauses said to have been surreptitiously introduced into the Bill was the ban on electronic transmission of election results by INEC.\n“Because my phone numbers and that of the Speaker were published and in one day, I received over 900 text messages saying we have manipulated this.\nAnd lobbying is part of democracy.”The report of the Senate Committee on INEC on the Electoral Act (amendment) Bill is expected to be considered tomorrow (Thursday) by the Senate."
  },
  {
    "headline": "Police arrest more suspects over SuperTV boss' murder",
    "summarized_story": "By Precious IgbonwelunduMore suspects have been arrested in connection with the murder of late SuperTV boss, Usifo Ataga, Lagos Police Commissioner, Hakeem Odumosu has said.\nThe police chief disclosed this during a briefing and parade of over 1,000 suspects at the Command headquarters in Ikeja.\nADVERTISEMENTAlthough he didn’t give details on the number of suspects arrested and their connection to the murder, Odumosu said the case was progressing and the police would never compromise on it.\nHe reminded the public the prime suspect, Chidinma Ojokwu, 21, was still a suspect with her rights guaranteed by the constitution, dismissing insinuations the police were attempting to give her a soft landing.\nOdumosu said: “We have established a case of conspiracy in the murder and we have arrested more suspects.”Ataga, 50, was killed on June 15 at a shortlet apartment where he was spending weekend with his lover, Ojokwu."
  },
  {
    "headline": "Riyom community protests killing of youths",
    "summarized_story": "By Kolade Adeyemi, JosRiyom community of Plateau has protested the killing of two youths on Tuesday night by suspected bandits.\nThe protesters, who blocked the Jos-Abuja highway, chanted different solidarity songs while others carried leaves and placards with different inscriptions.\nThe Nation gathered the killing took place around 8pm in Kum village of Riyom Local Government Area.\nADVERTISEMENTOne of the protesters said the killers came in military uniforms and attacked three youths guarding their community as local vigilantes.\nAnother protester demanded the military personnel at a checkpoint near Kum should be withdrawn and replaced by another security outfit."
  },
  {
    "headline": "Breaking: Governors approve template to implement financial autonomy of the nation’s judiciary, legislature",
    "summarized_story": "Recall that President Muhammadu Buhari, had in May 2020, signed into law an Executive Order 10 to grant financial autonomy to the legislature and the judiciary across the 36 states of the country.\nThe union had embarked on a nationwide strike in April to protest the non-implementation of the financial autonomy of the nation’s judiciary.\nThe union directed all its members across the federation to shut down all courts after the expiration of the 21-day ultimatum earlier given over the failure of the government to implement the financial autonomy of the judiciary.\nThe Forum resolved to engage with the National Assembly on the matter.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "PIB: Northern lawmakers, govs override Southern counterparts",
    "summarized_story": "The Senate, during the consideration of the Bill, crashed the 5% funds earmarked for host communities to 3%.\nThe push for the reduction was spearheaded by Northern senators.\nWhereas, in the House of Representatives, lawmakers passed 5% as recommended by the Joint Committee on Petroleum.\nUnlike the Senate, the House of Representatives didn’t tamper with the recommendation.\nIt was learnt that lawmakers who voted during the Committee meeting, opted for regional interests."
  },
  {
    "headline": "Plateau: Herdsmen kill two as youths protest in Riyom",
    "summarized_story": "From Gyang Bere, JosTwo people are reported to have died in a bloody attack suspected to have been carried out by Fulani herdsmen in Kum village of Riyom Local Government Area of Plateau State.\nDaily Sun gathered that the incident which occurred at about 9 pm Tuesday, left one Mr Titus John and Iliya Dalyop dead.\nA lawmaker representing Riyom Constituency in the Plateau State House of Assembly, Hon Timothy Dantong, confirmed the incident and said the deceased persons were ambushed and killed.\n‘It is true that two persons were killed on Tuesday night in Kum village of Riyom LGA by gunmen.\nThe youths blocked the major Abuja-Jos express route which tempered with the smooth flow of vehicles into Jos, the state capital."
  },
  {
    "headline": "Ataga: Chidimma must not die in custody, Reps warn police",
    "summarized_story": "From Ndubuisi Orji, AbujaThe House of Representatives, yesterday, cautioned the Nigeria Police to ensure that Ms Chidimma Ojukwu, who is being held in connection with the death of late Usifo Ataga, does not die in their custody.\nThe House also urged the police to conduct a thorough investigation into the murder incident and refrain from parading “Ms.\nChidinma around to grant interviews” on a matter under investigation.\nThis followed the adoption of a motion by Tolu Akande-Sadipe, calling for compliance of the police force with extant laws in the investigation into the death of late Ataga.\nThe lawmaker noted that since her arrest, the suspect has been paraded around, granting interviews to several news platforms, including the Nigerian Television Authority (NTA)."
  },
  {
    "headline": "INEC: PDP, Arewa group, CTA hail rejection of Onochie’s nomination",
    "summarized_story": "The nomination of Onochie by the Presidency was trailed by controversy, which reached a climax, yesterday, as the Senate rejected the nomination.\nDelta State where Onochie hails from has a serving national commissioner in INEC.\nThe PDP said the rejection of Onochie has saved the country from a serious crisis and salvaged INEC and the entire Nigerian electoral process.\nThe CTA, in a statement by its Executive Director, Faith Nwadishi, said Onochie’s rejection would augur well for Nigeria’s democracy.\n“We admonish the leaders of the National Assembly to continue to put Nigeria’s democracy first above party/individual sentiments,” he said."
  },
  {
    "headline": "Emefiele: N15tn Infrastructure Company to Take off Third Quarter",
    "summarized_story": "Ndubuisi FrancisThe N15 trillion Infrastructure Company Limited (InfraCo), created by the federal government to bridge the nation’s huge infrastructure gap is to take off in the third quarter of the year, the Governor of Central Bank of Nigeria (CBN), Mr. Godwin Emefiele, has said.\nInvestors in the N15 trillion InfraCo include the CBN, Nigeria Sovereign Investment Authority (NSIA) and Africa Finance Corporation (AFC).\nHe stated that for Nigeria to attain meaningful growth, there must be huge investments in key sectors of the economy, including infrastructure such as rail and power, among others.\n“The sustenance of these measures have also helped to support growth of 0.51 per cent during the first quarter of 2021.\nHe stated that about N500 billion is expected to be contributed into the federal government coffers from the privatisation proceeds this year."
  },
  {
    "headline": "INEC Pledges to Use Technology to Deepen Democracy",
    "summarized_story": "• Says 542,576 Nigerians have completed online voter registrationChuks OkochaThe Chairman of the Independent National Electoral Commission (INEC), Prof. Mahmood Yakubu, yesterday expressed the determination of the commission to deepen democracy through the use of technology.\nAlso, the third quarter of the physical registration will start from January 3, 2022, to April 1, 2022, and the fourth quarter will kick off on April 11 to June 30, 2022.\n“Out of 542,576 online registrants so far, 356,777 (or 66 per cent) are young people between the ages of 18 and 34 years.\nAccording to him, the commission is aware that not all Nigerians have access to computers, smart phones or internet connectivity to register online.\nEven the online registrants will have to complete their registration physically at those centres."
  },
  {
    "headline": "222 Killed, 774 Abducted by Kaduna Bandits in Three Months",
    "summarized_story": "By John ShiklamA total of 222 people have been killed while 774 others have been kidnapped by bandits in Kaduna state in the past three months.\nIn the first quarter report, present in April, a total of 323 persons were killed while 949 others were kidnapped by bandits across Kaduna State.\nAccording to him, 159 of the deaths, were recorded in Kaduna Central Senatorial District while Southern Kaduna Senatorial District and Northern Senatorial District recorded 54 and nine deaths respectively.\nThe commissioner said of the 774 people kidnapped, Kaduna Central SenatorialDistrict topped the list with 555 people abducted.\nHe said, “Southern Kaduna Senatorial District recorded 164 kidnapped persons, with Kachia LGA reporting the highest number of 111."
  },
  {
    "headline": "Buhari: Nigeria is Lucky to Remain as One Entity Despite Security Challenges",
    "summarized_story": "*Says people should be free to choose leaders of their choice irrespective of party, religionDeji ElumoyePresident Muhammadu Buhari has disclosed that Nigeria is lucky to have remained as one indivisible entity notwithstanding the myriad of problems incuding security challenges facing the nation.\nThis is just as he also canvassed for the citizens right to choose a leader of their choice at elections irrespective of party affiliation or religion.\nThe President made this disclosure Tuesday at the State House, Abuja while receiving the report of the National Security Summit of the House of Representatives from the Speaker, Hon.\n“Thank you Mr President for what you have done so far to douse tension and for Nigeria to remain one.\nAnd Nigeria will work, by the grace of God”, the Speaker further said."
  },
  {
    "headline": "Breaking: Senate Bows to Pressure, Rejects Onochie as INEC Commissioner",
    "summarized_story": "By Deji Elumoye and Juliet AkojeThe Senate on Tuesday bowed to public pressure and rejected the nomination of Presidential aide, Lauretta Onochie, as Independent National Electoral Commission (INEC) National Commissioner.\nThe upper chamber at plenary described Onochie as ineligible for the position of National Commissioner of the Independent National Electoral Commission based on the report of its committee on INEC.\nPresenting the report, Chairman of the Senate Committee on INEC, Senator Kabiru Gaya, said Onochie’s nomination contravenes the principle of Federal Character Commission as enshrined in the 1999 Constitution.l (As Amended).\nGaya recalled that Delta state which Onochie was supposed to represent had been adequately represented by May Agbamuche-Mbu, INEC’s current National Commissioner, who incidentally is from Delta state as Onochie.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "It's A Year After Nigeria's First Female Combat Pilot, Tolulope Arotile Died. Will Justice Be Served?",
    "summarized_story": "A year after the death of Tolulope Arotile, Nigeria's first-ever female combat pilot, justice has not been served.\nArotile died in an accident on July 14, 2020, at the Nigeria Air Force (NAF) base in Kaduna at the age of 24.\nTolulope ArotileHer father, Akintunde Arotile, said if justice could be served as soon as possible, their minds would be put to rest.\n\"She was inadvertently hit by the reversing vehicle of an excited former Air Force Secondary School classmate while trying to greet her,\" Daramola said.\nShe attended the Air Force Primary School, Kaduna (2000 to 2005) and the Air Force Secondary School, Kaduna (2005 to 2011)."
  },
  {
    "headline": "It's A Year After Nigeria's First Female Combat Pilot, Tolulope Arotile Died. Will Justice Be Served?",
    "summarized_story": "A year after the death of Tolulope Arotile, Nigeria's first-ever female combat pilot, justice has not been served.\nArotile died in an accident on July 14, 2020, at the Nigeria Air Force (NAF) base in Kaduna at the age of 24.\nTolulope ArotileHer father, Akintunde Arotile, said if justice could be served as soon as possible, their minds would be put to rest.\n\"She was inadvertently hit by the reversing vehicle of an excited former Air Force Secondary School classmate while trying to greet her,\" Daramola said.\nShe attended the Air Force Primary School, Kaduna (2000 to 2005) and the Air Force Secondary School, Kaduna (2005 to 2011)."
  },
  {
    "headline": "BREAKING: University Of Lagos Shuts Campus Over COVID-19 Scare",
    "summarized_story": "The management of University of Lagos has asked students to vacate hostels on campus over COVID-19 concerns.\nProf Oluwatoyin Ogundipe, the Vice-Chancellor, had summoned an emergency senate meeting over the potential third wave of COVID-19.\nThe university had earlier confirmed that the medical centre had recorded an increase in the number of patients with COVID-19 symptoms.\nThis is with a concurrent increase in the occupancy rate at Lagos State isolation centres.\n“The University of Lagos community has also been affected by this potential 3rd wave, with an increase in the number of patients presented to the University of Lagos Medical Centre with flu-like symptoms which are similar to COVID-19."
  },
  {
    "headline": "BREAKING: University Of Lagos Shuts Campus Over COVID-19 Scare",
    "summarized_story": "The management of University of Lagos has asked students to vacate hostels on campus over COVID-19 concerns.\nProf Oluwatoyin Ogundipe, the Vice-Chancellor, had summoned an emergency senate meeting over the potential third wave of COVID-19.\nThe university had earlier confirmed that the medical centre had recorded an increase in the number of patients with COVID-19 symptoms.\nThis is with a concurrent increase in the occupancy rate at Lagos State isolation centres.\n“The University of Lagos community has also been affected by this potential 3rd wave, with an increase in the number of patients presented to the University of Lagos Medical Centre with flu-like symptoms which are similar to COVID-19."
  },
  {
    "headline": "Bandits Killed Nearly 300 Nigerians in June, Highest Figure This Year",
    "summarized_story": "More than half of the people killed by the bandits last month were in Zamfara State which had received much of the atrocities from the bandits along with Kaduna State.\nThe increasing death toll shows that the terrorism by the bandits has outpaced that of Boko Haram/ISWAP and Fulani herdsmen which have been described as among the deadliest terrorist groups in the world.\nFrom January to June this year, bandits have killed no fewer than 952 people and kidnapped over a thousand Nigerians, according to a tally by the Civic Media Lab.\nAs the bandits took over the rein of terror from Boko Haram/ISWAP and Fulani herdsmen, the Nigerian government appeared to be clueless on how to deal with these terrorists who target vulnerable communities and farmers.\nOverall, more than 400 civilians were killed across the country last month."
  },
  {
    "headline": "Senate asks NPA to refund $37.6m, N67.51bn 'unremitted' revenues",
    "summarized_story": "It added that the failure to remit capitalised interest to the CRF, “totalling” N99.71 million, between 2013 and 2014 contravened Rule 236 of the Financial Regulations.\nAdvertisementThe senate said the funds were diverted contrary to a directive approved by FEC on February 21, 2007.\nThese are part of the 59 recommendations adopted by the Senate on the annual report of the auditor-general for the year ended 31st December 2015.\nThe accountant-general is expected to report back to the senate committee on public accounts within ninety days.\nThe senate demanded the refund of the amount to government coffers, including the sum of N718,911,848.00 made in the cashbook as payments to eleven corporate bodies without documentation."
  },
  {
    "headline": "Senate asks NPA to refund $37.6m, N67.51bn 'unremitted' revenues",
    "summarized_story": "It added that the failure to remit capitalised interest to the CRF, “totalling” N99.71 million, between 2013 and 2014 contravened Rule 236 of the Financial Regulations.\nAdvertisementThe senate said the funds were diverted contrary to a directive approved by FEC on February 21, 2007.\nThese are part of the 59 recommendations adopted by the Senate on the annual report of the auditor-general for the year ended 31st December 2015.\nThe accountant-general is expected to report back to the senate committee on public accounts within ninety days.\nThe senate demanded the refund of the amount to government coffers, including the sum of N718,911,848.00 made in the cashbook as payments to eleven corporate bodies without documentation."
  },
  {
    "headline": "NGF: States to reintroduce COVID protocol, fast-track vaccine procurement to prevent third wave",
    "summarized_story": "The Nigeria Governors’ Forum (NGF) says states will reintroduce measures for curbing the spread of the coronavirus to prevent a third wave of infections.\nAdvertisementThis was part of the resolutions reached by the governors after a meeting on Wednesday.\nThe decision was taken following a presentation by Babajide Sanwo-Olu, governor of Lagos, on the concerns about a third wave of infections in the state.\n“Following the update, the Forum called on all State Governors to revive their COVID protocols and collaborate with the Nigeria Centre for Disease Control (NCDC) to take appropriate and immediate actions to flatten the transmission curve.\nHowever, with concerns raised over a possible increase in infections, following the confirmation of the “highly infectious” Delta variant in Abuja and Oyo, it isn’t yet clear what exact measures the governors will reintroduce."
  },
  {
    "headline": "NGF: States to reintroduce COVID protocol, fast-track vaccine procurement to prevent third wave",
    "summarized_story": "The Nigeria Governors’ Forum (NGF) says states will reintroduce measures for curbing the spread of the coronavirus to prevent a third wave of infections.\nAdvertisementThis was part of the resolutions reached by the governors after a meeting on Wednesday.\nThe decision was taken following a presentation by Babajide Sanwo-Olu, governor of Lagos, on the concerns about a third wave of infections in the state.\n“Following the update, the Forum called on all State Governors to revive their COVID protocols and collaborate with the Nigeria Centre for Disease Control (NCDC) to take appropriate and immediate actions to flatten the transmission curve.\nHowever, with concerns raised over a possible increase in infections, following the confirmation of the “highly infectious” Delta variant in Abuja and Oyo, it isn’t yet clear what exact measures the governors will reintroduce."
  },
  {
    "headline": "NNPC failed to remit N3.87trn crude oil proceeds in 2015, says senate",
    "summarized_story": "The senate has criticised the Nigerian National Petroleum Corporation (NNPC) for not remitting N3.87 trillion revenue from domestic crude oil sales to the federation account from January to December 2015.\nAdvertisementIn the last few months, deductions from NNPC revenue to pay for petrol subsidy have reduced the monthly remittance accrued to the FAAC.\nIn April, the NNPC had projected zero monthly remittance to the FAAC for May.\nThe corporation had also deducted N126.2 billion from remittance due to the federation in June, as reported by TheCable.\nThe senate also faulted the outstanding collection from solid minerals (N12,137,140,361.58) not remitted to the federation account but kept in an account maintained by the Central Bank of Nigeria (CBN)."
  },
  {
    "headline": "Safaricom to pay blind man $56,000 for refusing to hire him",
    "summarized_story": "A High Court in Kenya has ordered Safaricom to pay a blind man KSh6 million ($56,000) for failing to hire him after he had gone through the entire recruitment process.\nWilson Macharia sued the network operator to seek compensation because his rights were violated, BusinessDaily reported.\nHe told Justice James Makau that Safaricom declined to employ him as a customer care executive on grounds that it did not have specialised software to help him with his work.\nAlong with other persons living with disabilities, Macharia was shortlisted for the job, went through the oral interview and medical test, after which he was invited to sign the contract in July 2017.\nThere’s a long history of discrimination and exclusion of persons with disabilities around the world."
  },
  {
    "headline": "Visa launches first card payment service in Somalia",
    "summarized_story": "Visa has partnered with the International Bank of Somalia (IBS Bank) to launch Somalia’s first Visa card payment service.\n“For Visa to come to Somalia, it means that we are on the right path of growth and progress.\nSomalia, a country that had no formal banking or financial system since the collapse of its government in 1991, has been making serious headways in reawakening the pulse of its financial entities.\nAccording to Somalia’s Central Bank Governor, Abdirahman Mohamed Abdullahi, the Visa partnership will connect Somalia to the global financial system and show the growing confidence in the country’s banking and finance sector.\nThe presence of both Mastercard and Visa in Somalia will help position its market as arable land ready to receive seed and produce a bounty harvest."
  },
  {
    "headline": "Central bank digital currencies differ from crypto. Here’s how they work",
    "summarized_story": "With cryptocurrencies like Bitcoin becoming increasingly popular, central banks across the world have been working towards developing digital currencies of their own.\nOnly two countries have officially launched digital fiat currency.\nNigeria and Ghana plan to pilot an official digital currency (e-naira and e-cedi respectively) later this year.\nA Central Bank Digital Currency (CBDC) is a country’s official currency in digital form.\nWith their values pegged, a digital currency will fall and rise in line with general swings in the value of the national currency."
  },
  {
    "headline": "Flutterwave lands Visa and MTN veteran to lead government and regulatory affairs",
    "summarized_story": "Before IHS, he spent 10 years at MTN in various government and regulatory advisory roles, and four years representing VISA in conversations with West African regulators.\nIn appointing a regulatory lead with broad industry experience, Flutterwave expresses an enthusiasm for deeper engagement with African governments.\nFlutterwave’s payments processing business is live in 33 African countries.\nThat spread commands a regulatory burden similar to what multinational financial services companies and telecommunications networks have to contend with.\nIt may have figured in their selection process for a regulatory lead, choosing someone with experience spanning these sectors."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Spazio Ideale designs iconic workspaces for tech companies like Paystack, uLesson, others",
    "summarized_story": "The acceptance of space design in Nigeria coincided with the coming of interior design startups like Spazio Ideale — an Italian expression loosely translated as ‘Ideal Space’.\nTomi Bamgbelu, Founder and Creative Director of Spazio Ideale, has always had a flair for architecture and computers.\nSpazio Ideale team.\nThat’s the only way we can add value.”Bamgbelu gives her take on why people reach out to Spazio Ideale.\nAlthough uncommon at that time, the founder decided to do something different with the office space design."
  },
  {
    "headline": "Flutterwave’s regulatory officer, VerifyMe digital address system, Mobile app downloads skyrocket",
    "summarized_story": "Good day,Today I’m discussing:Flutterwave’s new appointmentVerifyMe’s VeriFind launchMobile app downloads skyrocketFlutterwave appoints Oluwabankole Falade as Chief Regulatory and Government Relations OfficerFlutterwave’s new Chief Regulatory and Government Relations Officer, Oluwabankole Falade.\nThe story: Nigerian fintech unicorn, Flutterwave, has announced Oluwabankole Falade as its Chief Regulatory and Government Relations Officer.\nFor more context: Flutterwave appoints Oluwabankole Falade as Chief Regulatory and Government Relations Officer.\nWell, VerifyMe Nigeria, an identity verification startup, wants to change that with its geotagging solution, VeriFind.\nNigeria leads mobile app downloads in AfricaSmartphone userMobile app installs in Nigeria grew by 43% between Q1 2020 and Q1 2021, according to a report by Appflyer and Google."
  },
  {
    "headline": "Flutterwave appoints Oluwabankole Falade as Chief Regulatory and Government Relations Officer",
    "summarized_story": "Online payments solution platform, Flutterwave has appointed former MTN and Visa executive, Oluwabankole Falade as its new Chief Regulatory and Government Relations Officer.\nFalade, who has worked in similar roles in companies like MTN and Visa, brings a wealth of legal, regulatory, business development, and government relations experience from a 16-year stint in the financial and telecoms industries.\nFalade’s regulatory experience with global giants like MTN and Visa should serve as good reference points in his new role.\nA trend that has seen Chaka bag the Securities Exchange Commissions’ (SEC) first digital stock trading licence.\nDo you think we will see more appointments like this in fintech companies?"
  },
  {
    "headline": "50 years after, OPEC gains still evade Nigeria",
    "summarized_story": "A country celebrating 50 years of its Organisation of Petroleum Exporting Countries (OPEC) membership, Nigeria is a clear example that a natural resource such as oil is not necessarily a blessing.\nEndowed with some of the world’s biggest oil reserves, plenty of arable lands, Nigeria had the potential to break onto the global stage by…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Fintech attraction: Investors find benefits outweigh costs in Nigeria",
    "summarized_story": "Nigeria’s financial technology (Fintech) companies have increasingly become a top investment destination for foreign investors.\nTo have a piece of the industry’s cake, investors are queuing and waiting for a window of entry.\nConsidered a ‘goldmine’, the opportunities foreign investors see in Nigeria’s Fintech industry has forced them to turn a blind eye to the…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "NEITI reveals revenue leakages in Nigeria’s extractive sector",
    "summarized_story": "The Nigerian Extractive Industries Transparency Initiative (NEITI), a transparency watchdog, has published its 2019 report on Nigeria’s extractive sector showing a disturbing pattern of poor practices fostering revenue leakage to the Federation.\nNEITI observed that some companies reported crude losses due to metering error, theft and sabotage that were higher than the volume of production…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Insecurity In Kaduna In Relation With Military-Police Formations – Nigerian Observer",
    "summarized_story": "Kaduna State is the most terrorize state by bandits and other criminals despite the presence of military-police formation.\nI have watched helplessly in Kaduna State where the President’s efforts are not being replicated.\nI cannot explain the level of high insecurity in relation to several military-police formation in Kaduna State.\nThere is several military-police formation yet there is no peace in Kaduna State.\n* Nigerian Army Depot, Zaria* Armed Forces Command and Staff College, Jaji* Nigerian Defense Industry (NDI) Kaduna* Nigerian Airforce Training School, Kaduna* Nigerian Police College, Kaduna* Nigerian Navy School of Armament, Kachia Kaduna* Nigerian Army School of Legal Services, Bassawa Zaria* Nigerian Defense Academy (NDA) Kaduna* Nigerian Army School of Artillery, Kachia Kaduna* Nigerian Army School of Military Police, Bassawa ZariaI am worried that bandits and kidnappers operate freely without any challenge from the military and police formation located in Kaduna State."
  },
  {
    "headline": "Human Trafficking/Forced Migration: Foundation Holds Workshop For Community-Based Women Led Organisations In Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – In its resolved to curb Human Trafficking and Forced Migration in Edo State, CLEEN Foundation, a non-profit and governmental organisation in the country has organised a 2-Day Capacity Building Workshop for Community-Based Women Led Organisations In the State.\nHe disclosed that the program was conceptualised following failure of various institutional and legal frameworks to address human trafficking, forced migration, gender and non-gender related crime in Nigeria.\nSpeaking with The NIGERIAN OBSERVER during the workshop, the Edo State Coordinator of CLEEN Foundation, Mrs.\nBlessing Eromon, said that the foundation has taken the fight against human trafficking and forced migration in Edo State as one of his core mandates.\nShe revealed that forced migration is the push that makes one to leave the present place of habitation to a different place as a result of conflict, insecurity, disaster, persecution and government authority, adding that the underlying reason for forced migration is to seek better living condition."
  },
  {
    "headline": "Edo govt rallies stakeholders, targets top spot as world’s leading producer of oil palm – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has partnered the Initiatief Duurzame Handel (IDH), an international organisation, to initiate a Multi-Stakeholders Platform (MSP) aimed at ensuring that the state regains its leading position in oil palm production in Africa.\nPermanent Secretary, Edo State Ministry of Communication and Orientation, Mr. Joses Isede disclosed this to journalists in Benin City when he received the MSP facilitator from IDH, Mrs. Ngozi Unuigbe, who was on a courtesy visit.\nIsede said Edo is leveraging on the investment-friendly environment provided by the Governor Godwin Obaseki-led administration to drive agricultural development in the state.\nThe Permanent Secretary expressed satisfaction with the import of the collaboration which he added was in tune with the state government’s Making Edo Great Again (MEGA) Agenda.\nOn her part, Unuigbe said IDH was supporting Edo State to improve oil palm production by smallholder farmers, adding, “Not just improvement, but in a sustainable way that is environmentally friendly.”..."
  },
  {
    "headline": "Electoral Act Amendment : Lobby lawmakers, Don’t Blackmail NASS leadership – Lawan – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – President of the Senate, Ahmad Lawan, has kicked against what he described as the ‘calculated blackmail’ against the leadership of the National Assembly over the Electoral Act (Amendment) Bill 2021, presently before both chambers.\nThe report on the Electoral Act (Amendment) Bill, 2021, was laid by the Chairman of the Committee on Independent National Electoral Commission (INEC), Senator Kabiru Gaya.\nThe Senate President, therefore, advised Nigerians to lobby lawmakers on any aspect of the bill they feel strongly about, insisting that the National Assembly would do only what is right when it eventually considers the bill.\nLawan said,there are various accusations, insinuations that the leadership of the Senate, sometimes the leadership of the National Assembly have tampered with the report of the committee on INEC of both chambers.\nThe Senate President, however, maintained that the National Assembly can only consider aspects of the amendment bill contained in the Committee’s report presented to the upper chamber for consideration."
  },
  {
    "headline": "NFIU speaks on illegal pressure from politicians, senior govt officials",
    "summarized_story": "ADVERTISEMENTThe Nigerian Financial Intelligence Unit (NFIU) has said it is facing “illegal” pressure from politicians and senior government officials making dishonest request for information.\nThe Nigeria’s foremost financial intelligence body said this in a public notice titled, ‘Public Notice and Advisory to Politicians and Senior Government Officials,’ on Wednesday.\n“We are forced to react to attempts to introduce politics, illegal pressure on and inordinate requests for information from the NFIU,” the notice signed by the unit’s chief media analyst, Ahmed Dikko, read in part.\n“The Nigerian Financial Intelligence Unit is also an agency created at the heart of global best practice to support crime analysis and Intelligence building locally and internationally.\n“Any officer, whose conducts do not meet FIU best practices, will always be responded to within the law,” the advisory added."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Supreme Court stops Malami, 3 others from ceding ‘Rivers’ oil well to Imo",
    "summarized_story": "The Supreme Court has granted an order of injunction restraining the federal government from ceding 17 disputed oil wells located at Akri and Mbede in Rivers to Imo.\nMr Ukala prayed the court to stop the alleged implementation of the ceding of the 17 oil wells to Imo pending the determination of the suit filed by Rivers government, NAN reported.\nThe letter is said to have cancelled the equal sharing of proceeds from the 17 oil wells by Rivers and Imo.\nThe Rivers government dragged the AGF and the Attorney-General of Imo to the Supreme Court over disagreement on boundaries.\nThe plaintiff also sought a declaration that all the oil wells within Akri and Mbede communities were wrongly attributed to Imo and that they were all oil wells within the territory of Rivers."
  },
  {
    "headline": "I got 900 text messages in a day over alleged tampering with electoral act – Lawan",
    "summarized_story": "Nigeria’s Senate President, Ahmad Lawan, has said that he received over 900 text messages in one day over allegations of tampering with the report of the Electoral Act.\nHe described those accusing the leaders of the National Assembly of removing electronic transmission of results from the report as mischievous and rabble-rousers.\nLawan who stated this shortly after the Chairman of the committee on Independent National Electoral Commission (INEC), Senator Kabiru Gaya, submitted a report of the committee, explained that this is the first time the committee is submitting its report on the Electoral Act to the Senate.\n“There are various accusations and insinuations that leaders of the National Assembly have tempered with the report of the INEC committee.\nIn one day, I received 900 text messages,” he said."
  },
  {
    "headline": "Osun: Oyetola swears in 69 newly-appointed LGA, LCDA caretaker chairmen",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun state governor, Adegboyega Oyetola, on Monday swore in newly-appointed Local Government Caretaker Committees in all the Local Government Areas, Local Council Development Areas, Area Councils and Administrative Offices, in the State.\n“You will recall that since our assumption of office, we have run an Administration that is transparent, inclusive, purposeful and absolutely pro-people.\nGovernor was able to bring out 69 out of millions of people of the State to serve.\nDon’t disappoint Mr Governor.\nSamuel Abiodun Idowu, hailed the Governor for counting them worthy to serve their people just as he promised their commitment to deliver."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Buhari, wife congratulate Alakija at 70",
    "summarized_story": "By AZUH AMATUSPresident Muhammadu Buhari and the First Lady Aisha Buhari rejoice with Mrs Folorunsho Alakija, distinguished business leader and philanthropist on her 70th birthday on July 15, 2021, extolling her for dedicating her resources to humanitarian causes.\nThe President and the First Lady thank Mrs Alakija for being an ardent supporter of many social, economic, religious and health causes, contributing generously to the fight against COVID-19 in the country through her donations.\nPresident Buhari and his wife believe that the joyous occasion provides an opportunity for family, friends, associates and well-wishers to reflect on the importance of reaching out to people around with the benevolence God has committed to us.\nOn behalf of his family, the President offers his best wishes to this remarkable Nigerian, praying almighty God to grant her more years of robust health and happiness.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Buhari, wife congratulate Alakija at 70",
    "summarized_story": "By AZUH AMATUSPresident Muhammadu Buhari and the First Lady Aisha Buhari rejoice with Mrs Folorunsho Alakija, distinguished business leader and philanthropist on her 70th birthday on July 15, 2021, extolling her for dedicating her resources to humanitarian causes.\nThe President and the First Lady thank Mrs Alakija for being an ardent supporter of many social, economic, religious and health causes, contributing generously to the fight against COVID-19 in the country through her donations.\nPresident Buhari and his wife believe that the joyous occasion provides an opportunity for family, friends, associates and well-wishers to reflect on the importance of reaching out to people around with the benevolence God has committed to us.\nOn behalf of his family, the President offers his best wishes to this remarkable Nigerian, praying almighty God to grant her more years of robust health and happiness.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "I won’t stop celebrating Sound Sultan – Tuface",
    "summarized_story": "Singer Innocent Idibia aka 2baba has said he will never stop celebrating late musician Olanrewaju Fasasi, popularly known as Sound Sultan who died on July 11.\nSound Sultan died after battling Angioimmunoblastic T-Cell Lymphoma.\nThe singer who died at the age of 44 is survived by his wife, three children and siblings.\n“Will never stop celebrating u. I promise u your fam will be safe and good.\n#GRATEFUL for u and the blessings that u represented in my life.”2baba and Sound Sultan have songs together e.g Bush Meat, Enter The Place, Prayer etc."
  },
  {
    "headline": "I won’t stop celebrating Sound Sultan – Tuface",
    "summarized_story": "Singer Innocent Idibia aka 2baba has said he will never stop celebrating late musician Olanrewaju Fasasi, popularly known as Sound Sultan who died on July 11.\nSound Sultan died after battling Angioimmunoblastic T-Cell Lymphoma.\nThe singer who died at the age of 44 is survived by his wife, three children and siblings.\n“Will never stop celebrating u. I promise u your fam will be safe and good.\n#GRATEFUL for u and the blessings that u represented in my life.”2baba and Sound Sultan have songs together e.g Bush Meat, Enter The Place, Prayer etc."
  },
  {
    "headline": "GTBank appoints Olusanya first female Managing Director",
    "summarized_story": "Guarantee Trust Bank (GTB) has appointed Mrs Miriam Olusanya as its first female Managing Director.\nShe takes over from the former Managing Director, Segun Agbaje.\nA statement from the bank on Wednesday said aiming to strengthen its long-term competitiveness and growth prospects, Guaranty Trust Bank plc has completed its re-organisation to a Holding Company Structure.\n“The corporate name of Guaranty Trust Holding Company Plc and GTCO Plc will be used by the newly established operating company.\n“The newly established Guaranty Trust Holding Company Plc is also pleased to announce its new Board of Directors as well as changes to the Board of its banking subsidiary, Guaranty Trust Bank Limited."
  },
  {
    "headline": "Euro 2020: England deserved to lose",
    "summarized_story": "All of them have since become victims of cruel social media venoms.\nThe issue of online abuse of players led to British soccer authorities briefly boycotting social media platforms before the Euro 2020 tournament.\nMusa Okwonga, an English soccer writer aptly captures the whole episode on Twitter: “Hate is a strong word.\nIn Europe, America and other parts of the world, racism, sadly, remains a contentious subject.\nAs for the three Black players and others who have been victims of horrific racial abuse, they should hold their heads high in glory."
  },
  {
    "headline": "Nigerian Mission takes stock of losses by Nigerians in Zuma riots",
    "summarized_story": "The Nigeria Mission in South Africa has begun counting the losses Nigerian businessmen incurred in the orgy of looting triggered by the jailing of former President Jacob Zuma.\nConsul-General Abdulmalik Ahmed who is based in Johannesburg expressed sympathy for Nigerians who lost property and merchandise.\nHe said the mission had taken stock of losses incurred by Nigerians in the mayhem, with a view to seeking appropriate redress, where possible.\nAhmed advised Nigerians living in the country to insure their shops and goods, so as to ensure they were indemnified against losses.\n“Whereas, the situation is calming down gradually, Nigerians have been continually urged to refrain from venturing into flashpoints and to exercise utmost caution."
  },
  {
    "headline": "DSS Raid On Sunday Igboho’s House Was Within The Law- Popular Lawyer, Daniel Bwala",
    "summarized_story": "Daniel Bwala, a popular Abuja based lawyer has given his opinion on the recent raid on Chief Sunday Adeyemo, aka Sunday Igboho’s home by DSS.\nProbably the rationale behind that is law enforcement can even investigate a governor.\nThen number two, this has to do with whether the law enforcement obtains a search or arrest warrant.\nSo the law enforcement can come to execute arrest or search warrant order at any time.\nWhat I have learnt from my practice, because search warrant can be executed anytime, it means you can go to the judge’s house and have him sign a search warrant."
  },
  {
    "headline": "BREAKING: Unknown Gunmen Assassinate Billionaire Chief Philip Udala In Anambra",
    "summarized_story": "Chairman of Udala FC, Uke, Idemili South Local Government Area, Chief Philip Udala, has died.\nUdala, a grassroots football development expert, was killed unnecessarily when his convoy collided with a group of armed gunmen at the Eke-Agu Market crossing in Abatete, Idemili North Local Area.\nWhen the militants intercepted the Udala convoy in Abatete, they had apparently attacked a local police station and were fleeing the scene.\nGodsent Eriobu, Udala FC Manager and Secretary of Anambra Independent League (AIFL) who was also in the convoy was equally shot and died instantly at the scene on Tuesday.\nAccording to Dike, may the souls of Chief Philip Udala and Godsent Eriobu rest in the Lord, Amen."
  },
  {
    "headline": "Katsina Police Restrict Movement On Some Highways For Buhari’s Visit",
    "summarized_story": "The State Police Command has announced the restriction of movement of persons, vehicles, motorcycles, and herders in some major highways in the state as part of measures to ensure adequate security during President Muhammadu Buhari’s Thursday visit to his home state of Katsina for the commissioning of some projects.\nThe Dutsinma – Kankara road, the Dutsinma – Tsaskiya road, and other routes going to the event grounds are among the highways.\nSP Gambo Isah, the Command’s Spokesperson, who announced the mobility restrictions, said the highways would be restricted for six hours.\nAccording to him, “the Command wishes to announce the temporary closure of Dutsinma – Kankara road, Dutsinma – Tsaskiya road and other adjoining roads to the venue of the two events on 15th July 2021 from 13:00hrs – 18:00hrs.\nThe President is expected to commission the Zobe Regional Water Supply Project in Dutsinma LGA and the newly built Tsaskiya road in Safana LGA of Katsina state."
  },
  {
    "headline": "Gunmen Abduct First-Class Kogi Monarch, Demand N30m Ransom",
    "summarized_story": "Mohammed Adembe, a first-class traditional ruler in Kogi State and Adogu of Eganyi in Ajaokuta Local Government Area, was kidnapped by mysterious abductors along the Okene-Adogo route on Tuesday evening.\nThe kidnapping, which was one of many in recent months, happened just three days after the kidnapping of AbdulAzeez Obajimoh, the Managing Director of AZECO Pharmaceutical Company, in Ozuwaya in the state’s Okene district.\nObajimoh’s abduction was attended by gunshots that killed one Habeeb Anda and injured two others before the kidnappers escaped.\nConfirming the incident, the Police Public Relation Officer , Kogi State Police Command, Mr. William Ayah, said the monarch was kidnapped and that the police command has deployed special squad to trail the abductors.\nHe called on the general public to assist the police with useful information to enable security agents rescue the royal father."
  },
  {
    "headline": "NNPC N3.87trn non-remittance: Senate mandates EFCC, ICPC to go after culprits, frowns at N865.44bn revenue deductions",
    "summarized_story": "Accordingly, the upper chamber called on the Corporation to desist from further deductions at source as this contravenes Section 162(1) of the 1999 Constitution (as amended).\nThe Accountant General is expected to report back to the Senate Committee on Public Accounts within ninety days.\nThe Senate also noted that the failure to remit capitalized interest to the Consolidated Revenue Fund totaling N99, 712, 464.24 between 2013 and 2014 contravened Rule 236 of the Financial Regulations.\nThe infractions, the Senate noted, were in violation of Rule 3117.\nIn meting further disciplinary actions, the chamber called on the EFCC to prosecute within thirty days, officers of the Nigeria Bulk Electricity Trading PLC (NBET) who were behind the non-remittance of accrued interest on investment in Nigeria Treasury Bills."
  },
  {
    "headline": "Pictures: See Quadri Aruna, Oshanaike, other Nigeria’s Table Tennis players ready for battle at Tokyo Olympics",
    "summarized_story": ""
  },
  {
    "headline": "VIDEO: Team Nigeria arrive training camp in Kizarasu, days before Tokyo Olympics action",
    "summarized_story": "NextPictures: See Quadri Aruna, Oshanaike, other Nigeria’s Table Tennis players ready for battle at Tokyo Olympics"
  },
  {
    "headline": "World bank commends Kogi gov for returning $4.63m surplus project funds -NigPilot",
    "summarized_story": "The World bank’s commendation was contained in a letter of appreciation signed by the bank’s Country Director for Nigeria Western and Central Africa Region, Shubham Chaudhuri, and addressed to the governor.\nWe trust the project can be brought to an orderly closure in your state, while achieving its intended objective and contributing to transforming lives and alleviating poverty.\n“We have attached the template for ease of reference.\n“Allow me to thank your Excellency once again, for your continuous support to NEWMAP activities in Kogi State.\nPlease accept the assurances of my highest regards.”"
  },
  {
    "headline": "Buhari’s anti-corruption fight focus on preventive systems, accountability mechanisms – APC Legacy group -NigPilot",
    "summarized_story": "Support group under the auspices of APC Legacy Awareness and Campaign has stated that President Muhammadu Buhari’s anti-corruption campaign is built on establishing preventive systems and mechanisms that promote lasting accountability rather than the conventional arrest and prosecution method.\nThe TSA system, launched in 2012, had struggled to gain traction until President Buhari’s executive order.\n“Similar to the TSA is the Integrated Payroll and Personnel Information System (IPPIS), through which the Federal Government pays its staff.\n“The increased oversight of Ministries, Departments and Agencies (MDAs) and their finances under this Administration has since started yielding results, through increased remittance of operating surpluses by MDAs.\nPICA helped identify and remove more than 54,000 fraudulent payroll entries, amounting to savings of N200 billion per annum."
  },
  {
    "headline": "Imo North: Ibezim opens constituency offices in 6 LGs -NigPilot",
    "summarized_story": "In a statement signed by his Special Assistant on Constituency Affairs, Hon.\nThe address and location of the offices, according to the statement are No.\nOthers are Ehime Mbano LGA at No 4, Okigwe – Umuahia Road, close to T-Jocson Petrol Station, Aba Branch; Ihitte/Uboma LGA, located at former APC Secretariat, Along Isinweke – Orieagu Road, Isinweke, and Obowo LGA, at Achingali junction, along Owerri – Umuahia Road, Alike, Obowo.\nThe statement also noted that the official date for the dedication/opening of the offices to constituents would be announced soon by the Director-General of his team, Dr. Love Ineh.\nIt would be recalled that Senator Ibezim had shortly after his inauguration appointed constituency officers, and constituency office secretaries for each the LGA."
  },
  {
    "headline": "Senate backs JAMB on 2021 UTME performance -NigPilot",
    "summarized_story": "The Committee members made this disclosure after the JAMB Registrar, Prof. Ish-aq Oloyede clarified them on the alleged poor performance of the 2021 UTME during their oversight visit to JAMB on Monday.\nEyakenyi also said the committee will pursue the amendment of the law establishing the Joint Admissions and Matriculation Board, JAMB, to enable it limit the age of candidates writing the Unified Tertiary Matriculation Examination, UTME to 16 years and above.\nHe said the committee had identified two major areas to be addressed in the proposed amendment for the exam body to function better.\nThe committee however queried why JAMB had almost 100% performance of its 2020 budget and over N500 million devoted to staff welfare apart from their regular salaries.\nResponding to the alleged poor performance, Oloyede who spoke earlier saidUTME is not a certification exam; hence, there cannot be an issue of mass failure."
  },
  {
    "headline": "Police Arrest More Suspects In Connection With Murder Of Super TV CEO",
    "summarized_story": "The Lagos State Police Command says it has arrested more suspects in connection with the killing of Usifo Ataga, the chief executive officer of Super TV.\nCommissioner of Police, Hakeem Odumosu, said on Wednesday that said the police have established a case of conspiracy and murder and more suspects have been arrested.\nMr. Odumosu, during a parade of suspects at the police command in Ikeja, however, did not disclose who the suspects are or how many of them have been arrested.\nREAD ALSO: Super TV CEO: ‘Chidinma Must Not Die In Custody’, Reps Tell PoliceEarlier, the police had arrested Chidinma Ojukwu, a 300-level mass communication student at the University of Lagos, as the prime suspect in the case.\nMeanwhile, the deceased’s family in a statement last month said there was more to Mr. Ataga’s death and urged the police to go beyond the prime suspect’s confession."
  },
  {
    "headline": "COVID-19 Third Wave: UNILAG Asks Students To Vacate Hostels",
    "summarized_story": "The management of the University of Lagos (UNILAG) has ordered students to vacate hostels on campus over fears of COVID-19.\nThere were fears in the university community on Tuesday after a number of students contracted the disease.\nThe development led the school management to convey an emergency Senate meeting on Wednesday.\nIn a statement issued after the meeting, the Senate said the students who tested positive for the disease, are being treated, and contact tracing already in place.\n“The situation is, indeed, worrisome especially noting the reluctance of themajority of students to comply with the COV1D-19 prevention protocols,” the statement read."
  },
  {
    "headline": "Supreme Court Orders FG To Refrain From Ceding Oil Wells To Imo",
    "summarized_story": "The Supreme Court has granted an order of injunction refraining the Federal Government and its agencies from ceding oil wells at Akri and Mbede communities, to Imo State.\nThe order was granted on Wednesday to stop a purported implementation of the ceding of about 17 oil wells to Imo State, pending the determination of a suit brought before the court by the Rivers State Government.\nIn the ruling, the Supreme Court restrained the Attorney General of the Federation and the Attorney General of Imo State, from taking further action on the ownership of the Oil Wells, till the disputes surrounding them are resolved.\nThe Rivers State government through its Attorney General had dragged the AGF and the Attorney of Imo State before the Supreme Court over the disputed oil wells.\nRivers State, therefore, urged the Supreme Court to declare that the correct instrument, maps and documents to be relied on in determining the boundary between Rivers and Imo State are those used by the plaintiff in delineating the boundary lines between Rivers and Imo."
  },
  {
    "headline": "Nigeria Confirms 154 More COVID-19 Cases As Third Wave Fears Rise",
    "summarized_story": "COVID-19 cases have continued to soar in Nigeria as 154 more infections were confirmed in the country on Tuesday, raising further concerns about the third wave of the pandemic which was first detected in the West African nation in February 2020.\nNigeria Centre for Disease Control (NCDC), the agency spearheading the fight against the pandemic, announced the latest figures in its daily update late Tuesday.\nOf the number of confirmed infections for the day under review, Lagos State had 119 new cases, while Akwa Ibom followed with 11 more persons contracting the disease.\nAs of the time of this report, Nigeria has confirmed 168,867 cases while 164,623 have been discharged.\nDespite fears over the spike in cases and the confirmation of the highly contagious Delta strain, many Nigerians have abandoned safety protocols recommended by health authorities."
  },
  {
    "headline": "Abducted Zamfara College Provost Regains Freedom",
    "summarized_story": "The abducted provost of College of Agriculture and Animal Science Bakura, Mr Habibu Mainasara, has regained his freedom.\nMr Mainasara’s elder brother, Nasiru Mainasara, told Channels TV that he was freed on Wednesday night, three days after bandits abducted him from his official residence in the institution.\nDetails about his release remain sketchy and his brother did not disclose whether a ransom was paid.\nHis brother, however, said prominent members of the community told the family to stop the negotiation and assured them that he will be rescued safely.\nThe communities – Gudan-Baushi, Gidan-Adamu,Gudan-Maidawa, Tsauni, and Wari – were attacked by motorcycle-riding bandits in the late hours of Thursday, July 8."
  },
  {
    "headline": "Asiwaju Tinubu Hails Babatunde Ogala at 60",
    "summarized_story": "All Progressives Congress National Leader, Asiwaju Bola Ahmed Tinubu, has lauded the contributions of former National Legal Adviser of the party, Hon.\nBabatunde Ogala, SAN, to democracy, good governance, social justice and rule of law on his attainment of 60 on Thursday.\nAsiwaju Tinubu extolled the virtues of Ogala in a special statement by his Media Office signed by Tunde Rahman.\nThe APC leader said Ogala has done excellently well in the various spheres of life he has traversed thus far.\nHe said in the statement: “Warmest congratulations to former National Legal Adviser of the All Progressives Congress and prominent lawyer, Hon."
  },
  {
    "headline": "GTB announces Miriam Olusanya as new MD",
    "summarized_story": "Guaranty Trust Bank has announced the appointment of Miriam Olusanya as Managing Director.\nThis is according to a notice signed by the company’s secretary, Erhi Obebeduo, and sent to the Nigerian Exchange Group Limited (NGX).\nIn addition, a new Board of Directors as well as changes to the Board of its banking subsidiary (GTBank) was also announced.\nIn light of this, the GTCo’s Board will comprise of the following personalities: Mr Sola Oyinlola (Chairman), Mr Segun Agbaje (Group CEO), Mrs Cathy Echeozo (Non-Executive Director), Mrs Helen Bouygues (Independent Non-Executive Director) and Mr Adebanji Adeniyi (Executive Director).\nThe banking subsidiary (GTBank) Board will comprise of Mr Inrahim Hassan (Chairman), Mrs Miriam Olusanya (Managing Director), Mr Olabode Agusto (Non-Executive Director), Ms Imponi Akpofure (Independent Non-Executive Director), Mrs Victoria Adefala (Independent Non-Executive Director), Mr Jide Okuntola (Deputy Managing Director) and Mr Haruna Musa (Executive Director)."
  },
  {
    "headline": "Court Sentences couple To 3-Years in prison For Confinement Of 12 Year Old",
    "summarized_story": "A Sokoto Magistrate Court has sentenced Emmanuel Bassey and his wife Esther Emmanuel to three years imprisonment for confining their twelve year old niece in an unused fridge for eight month.\nChief Magistrate Shu’aibu Ahmad while delivering the judgement fined the couple the sum of twenty five thousand naira or six months jail term for criminal conspiracy.\nThe Magistrate also fined them N50,000 for wrongful confinement and in default they would spend 12 months in prison.\nHe however granted bail to Goodness Emmanuel and Happiness Emmanuel the children of Emmanuel Bassey in the sum of N500,000 and one surety each in the like sum.\nTVCNEWS reported in May, 2021that a twelve year old girl was caged in an unused fridge by her aunty Esther Emmanuel with the consent of her husband Emmanuel Bassey and their two daughters."
  },
  {
    "headline": "Buhari Excited Nigerians Voted For Him Despite Being Poor – Trending With Ojy Okpe",
    "summarized_story": "Arise News celebrates the Chairman and Editor-in-Chief of THISDAY ARISE Media Group Prince Nduka Obaigbena who turned 62 today.\nReactions have trailed President Muhammadu Buhari’s comment about being excited that Nigerians voted for him despite not being richThe senate on Tuesday prescribed a 20 year jail term for persons caught snatching ballot materials and a fifteen year jail term for those who influence the out come of electionsGhanian first lady Rebecca Akufo-Addo has offered to refund all the allowances she has received amounting to 899, thousand Ghanaian cedes, since the her husband president Nana Akufo Addo assumed office in 2017 following a public outcry over salaries"
  },
  {
    "headline": "Messi Agrees Five-year Barcelona Contract, Takes Huge Pay Cut: ESPN",
    "summarized_story": "The 34-year-old’s previous contract was worth over €500 million over four years and that expired at the stroke of midnight on June 30.\nHowever, with the return of Joan Laporta as president in March, Messi grew more open to staying at Camp Nou.\nHe will link up with Ronald Koeman’s squad later in the summer, with Barca’s league campaign kicking off on August 15 against Real Sociedad at Camp Nou.\nHe was Barca’s president when Messi made his first-team debut and when he signed his first professional contract with the club.\nIn public and in private, Laporta had always maintained that he was “convinced” he could persuade Messi to stay."
  },
  {
    "headline": "ICC to Consider Yoruba Secessionist Sunday Igboho’s Petition Against President Buhari",
    "summarized_story": "The International Criminal Court (ICC) says it will consider a petition filed by Yoruba Nation separatist agitator Sunday Adeyemo, popularly known as Sunday Igboho; Banji Akintoye, leader of Ilana Omo Oodua, and 49 other Yoruba self-determination groups against Nigeria’s President Muhammadu Buhari.\nThe Yoruba nation agitators are demanding the secession of the southwestern states from Nigeria and is in tune with the demands of the governors of the region.\n“In Nigeria, there are ongoing violations of Human Rights, as expressed specifically in the Rome Statute, being perpetrated against the Yoruba People, particularly genocide under Article 6, and Crimes Against Humanity under Article 7, of the Rome Statute,” the petition read in part.\n“This communication has been duly entered in the Communications Register of the Office,” Dilon said in a letter to the petitioners’ lawyer.\n“We will give consideration to this communication, as appropriate, in accordance with the provisions of the Rome Statute of the International Criminal Court."
  },
  {
    "headline": "Burna Boy, Tiwa Savage, Ed Sheeran, Others to Perform in Global Citizen Concert to Unite the World, Defeat Poverty",
    "summarized_story": "Nigerian grammy award winning Burna Boy alongside Ed Sheeran will lead a group of artistes to perform at the Global Citizen live concert aimed at uniting the world, defending the planet and defeating poverty.\nGlobal Citizen Live is powered by citizens around the world who are taking action together with governments, corporations and philanthropists to make change.\nSpace can wait!”“I am very excited to perform at the Global Citizen Live concert this year.\nAccess Bank, will also support the Global Citizen Live campaign as a partner in Nigeria.\nSince March 2020, Global Citizen has mobilized $2 billion in cash grants to fund global pandemic relief efforts, and over 26 million COVID-19 vaccine doses."
  },
  {
    "headline": "Pope Francis Returns to Vatican 10 days after Surgery",
    "summarized_story": "Pope Francis was discharged from a Rome hospital and returned home to the Vatican on Wednesday, 10 days after undergoing surgery to remove half his colon.\nAfter the brief stop, Francis’ small motorcade approached a side entrance to the Vatican.\nFrancis had half of his colon removed for a severe narrowing of his large intestine on July 4, his first major surgery since he became pope in 2013.\nThe Vatican spokesman, Matteo Bruni, confirmed Francis’ return from the hospital and visit to the Rome basilica.\nThe Vatican had originally said Francis could be discharged last weekend, but later said he would stay a few days extra for further recovery and rehabilitation therapy."
  }
]