[
  {
    "headline": "Cross River govt denies non-payment of workers’ salaries",
    "summarized_story": "The Cross River government has faulted media reports alleging that it had been unable to pay salaries to workers and gratuities to pensioners in the state.\nThis was contained in a statement signed by the state’s Head of Service, Mr. Timothy Akwaji on Tuesday in Calabar.\nAkwaji said that the reports were malicious, untrue, and concocted to dent the good image of Governor Ben Ayade.\n“However, any person or group of persons who have genuine claims of being owed salaries and pensions should forward same to the HOS for investigation and further action.\nHe said that the government would remain focused on its determination to address the concerns of workers and senior citizens of the state."
  },
  {
    "headline": "Court jails man three months for snatching handbag",
    "summarized_story": "An Ota Magistrates’ Court in Ogun on Tuesday sentenced a 40-year-old man, Akinola Obisesan, to three months imprisonment, for snatching a handbag containing N100,000 and other valuables.\nThe police charged Akinola with two counts of stealing and conspiracy, to which he pleaded not guilty.\nAdaraloye, told the court that the convict and others still at large, committed the offences on December 8, 2021, at about 8:30 pm in the Oju-Ore area of Ota, Ogun State.\nAdaraloye informed the court that the convict and his accomplices conspired and snatched a handbag containing cash of N100,000 and other valuables from the complainant, Ijamakinwa Folashade.\nHe said the offence contravened Sections 390(9) and 516 of the Criminal Code, Laws of Ogun, 2006."
  },
  {
    "headline": "Edo SUBEB visit schools to assess compliance with EdoBEST pedagogy",
    "summarized_story": "Following the successful graduation ceremony of hundreds of EdoBEST Induction trainees (teachers, headteachers and principals), the Executive Chairman of Edo State Universal Basic Education Board (Edo SUBEB), Mrs. Ozavize Salami, visited 16 schools to assess the implementation of new school management techniques and adherence with the EdoBEST pedagogy.\nIn November 2021, the Edo State Ministry of Education brought JSS management and administration under the purview of Edo SUBEB in what is termed the JSS disarticulation process.\nThereafter in late 2021, a comprehensive baseline assessment was carried out to ascertain the level of competence of students in English and Mathematics, ahead of whole-scale intervention by Edo SUBEB.\nIn February 2022, a batch of 1,859 teachers and principals from Junior Secondary Schools across Edo state were given a comprehensive 10-day training to prepare them to deliver lessons and manage their schools using the EdoBEST pedagogy.\nMost principals and teachers in the schools visited reported that their pupils are learning better while classrooms are being managed better."
  },
  {
    "headline": "FG to champion linkage of land-locked countries to coastal states by rail",
    "summarized_story": "By Dirisu YakubuABUJA- As part of effort to reap the benefits of the African Continental Free Trade Agreement, AfCFTA, the federal government is to set champion the extension of rail lines from land-locked countries to coastal states of Benin Republic, Togo, Ghana and other African countries.\nRepresented by the Permanent Secretary, Federal Ministry of Transportation, Dr. Magdalene Ajani, Sen. Saraki noted a total revamp of the transport sector through ensuring connectivity, safety, regulation of the road sub-sector, port reforms (electronic call-up), deployment of the Deep Blue Project, are necessary for the realization of AfCFTA.\nShe described the gesture by government as a milestone in the quest for regional development and integration of Africa, saying the major objective of the agreement is to boost intra – African trade through the elimination of tariffs and free movement of goods and services within member states.\nAlso speaking, Secretary, National Office for Trade Negotiation, NOiN, Winnifred Ofili, while decrying Nigeria’s share of trade which remains low at 3 per cent, said AfCFTA aims to create a single market for goods and services in order to deepen the economic integration of the continent.\nln his presentation, executive secretary, national action committee on AfCFTA, Francis Anatogu, appreciated the preparedness for the trade agreement as the Transportation Ministry already has a master plan and was amongst the first to set up a Technical Working Group, adding however that Ministry needs to prioritize aspects of its interventions to make expected impact."
  },
  {
    "headline": "11 soldiers feared dead, 19 injured as bandits attack Birnin Gwari in Kaduna",
    "summarized_story": "Burn 3 APC, injure 19 soldiers at a military baseBy Ibrahim Hassan-WuyoThere were reports from Birnin Gwari in Kaduna State that 11 soldiers died during a fierce encounter with a large number of suspected bandits who invaded a military base at the Pole wire village on Monday.\nAccording to a source, the bandits on motorbikes were said to have invaded the base and opened fire on the soldiers.\nAlso ReadBandits kidnap 22 in community near Kaduna-Abuja road” Some of the bandits were carrying Rocket-Propelled Grenade (RPG).\nThey killed 11 men and 19 soldiers were wounded in action.\nThey burnt down 3 Armoured Personel Carriers (APC).”“They went away with several weapons belonging to the soldiers; “the source alleged."
  },
  {
    "headline": "Katsina govt debunks report of bandits attack on Akwa Ibom people",
    "summarized_story": "L-R: Secretary Akwa Ibom Indigenes Association, Pioneer President Non-indigene Resident in Katsina, SSA Security, Acting DG Mediaalleged victims fabricated the idea to curry favour from Akwa Ibom government**By Ogalah IbrahimKatsina State Government has declared as untrue the information circulating on social and main stream media that some Akwa Ibom people residing in Katsina State were attacked and displaced by bandits, resulting in the evacuation of about 38 of the purported victims from Katsina state by the Akwa Ibom State Government.\nThis was disclosed on Monday at a pres briefing organized by the Katsina State Government in conjunction with some leaders of Akwa Ibom people in the state.\nSimilarly, Obong Samson Patrick, an Akwa Ibom man, who was the pioneering Chairman of Nigeria Indigenes Resident in Katsina said the action was mischievous and intended for selfish gains.\nHe called for the removal of the President of Akwa Ibom people in Katsina State who championed the fabrication of this falsehood.\nRecall that Vanguard reported that Akwa Ibom State Government over the weekend evacuated from Katsina State a total of 34 of her citizens, who were stranded following attacks by bandits and insurgents in some parts of Katsina state."
  },
  {
    "headline": "2023: PDP able to take over presidency — Okowa",
    "summarized_story": "…Assures free, fair primaries…as Jaro Egbo, his supporters dump APCBy Festus Ahon & Ochuko Akuopha, UGHELLIGOVERNOR Ifeanyi Okowa of Delta State, Monday, said the Peoples Democratic Party, PDP, was able to take over the presidency in the 2023 general election.\nHe said: “We are well able to take over Aso Rock, so we have to be strong, courageous and work very hard.\nOn his part, leader of the Highvoltage movement, Olorogun Jaro Egbo said: “I am the Biblical Caleb who was sent to go and view the enemy’s camp.\n“I have viewed the enemy’s camp and l have come with the good news that that PDP is the promised land.\n“Now that we are back home, the PDP will start the winning for 2023 here in Ughelli North."
  },
  {
    "headline": "Expert threatens to drag Cross River forestry boss to EFCC, ICPC",
    "summarized_story": "An expert in forestry and conservation activism, Odey Oyama, has threatened to drag the Chairman of the Cross River State Forestry Commission, Tony Undiandeye, before the Economic and Financial Crimes Commission (EFCC) and Independent Corrupt Practices and other Related Offences Commission (ICPC) if he fails to take action on a reported case of illegal conveyance of timber.\nThere have continued to be massive deforestation activities in the vast forests of Cross River by persons and groups suspected to be very powerful despite public outcry.\nOdey Oyama said by dragging the forestry chairman before the anti-graft agencies, Governor Ayade will be portrayed in a bad light to the nation and the international community.\n“Please despatch the Forestry Commission Enforcement Officers to make arrest and compound offense and/or prosecute offenders in accordance with the Cross River State Forestry laws & regulations; and other extant laws related therewith.”Oyama who is executive director of Rainforests Resources and Development Centre, said they were acting in compliance with Part II, Section 100 of the Forestry Commission Law 2011.\nHe also disclosed that their undercover agents have been monitoring the situation and reporting accordingly, remarking that the Forestry Commission Enforcement officers have not acted to save the forests."
  },
  {
    "headline": "UTME: JAMB Registrar expresses disappointment over lawmakers’ allegation of ‘exploiting’ candidates",
    "summarized_story": "Registrar and Chief Executive Officer of the Joint Admissions and Matriculation Board, JAMB, Prof. Ishaq Oloyede has criticised the House of Representatives for falsely accusing the Board of imposing multiple fees on candidates preparing to take the Unified Tertiary Matriculation Examination, UTME.\nOloyede, who has been nominated by Vanguard Newspapers for an award of excellence, expressed his displeasure while responding to questions on the level of preparations for the mock UTME slated for Saturday, April 9th nationwide.\nRecall that the House of Representatives had, in its plenary session recently, taken a resolution to probe JAMB over the alleged imposition of multiple fees on candidates, following a motion raised by Honourable Sergius Ogun (PDP-Edo).\nHe had also submitted that JAMB was established to control the conduct of matriculation examinations for candidates seeking admission into Universities, Polytechnics and Colleges of Education in Nigeria, but alleged that in recent times, in addition to the registration fees for the examination, all sorts of processing and administrative fees were imposed on JAMB examination candidates.\nAccording to the Registrar, the initial amount permitted to be charged was N700 but due to the energy crisis, no centre should charge candidates above N1000."
  },
  {
    "headline": "Minister advocates removal of barriers in traditional medicine practice",
    "summarized_story": "The Minister of State for Health, Adeleke Mamora, has called for concerted efforts to remove all barriers hindering the growth of traditional medicine in Nigeria and Africa, in general.\nMamora said traditional medicine is part and parcel of the culture of Africa and must be encouraged to thrive, barring all barriers on its path.\nHe said there are plans to facilitate research and development, human capital development and community engagement, all in the context of the Traditional Medicine Value Chain.\nThe move is also expected to produce various socio-economic benefits including business and investment opportunities, jobs and income generation opportunities for stakeholders involved in the African Traditional Medicine Pharmaceutical Value Chain, especially traditional health practitioners.\n“Embedded in the medicine security concept are social-economic indicators that align with local manufacturing and local development of these resources."
  },
  {
    "headline": "Nigeria asks Apple, Google to delete more loan apps as FCCPC uncovers owners",
    "summarized_story": "The Federal Government of Nigeria has served supplementary orders to Apple’s Appstore and Google Play Store to take down more loan apps.\nThe Federal Competition and Consumer Protection Commission (FCCPC) has also secured new freezing orders against accounts and financial institutions involved.\nA statement by the CEO, Babatunde Irukera said the actions were in furtherance of the March 11 raid on certain digital money lenders in Lagos.\nFCCPC now has information about other money lending operators; account information associated with some of the companies; information about staffing and recruiting policies and strategies.\nFCCPC confirmed custody of credible evidence of the planning, discussions, meetings, execution (including tangible evidence of inducement), and participants in the “criminal enterprise”."
  },
  {
    "headline": "Pastor Giwa fumes as Facebook deletes his post",
    "summarized_story": "The Senior Pastor of Awaiting The Second Coming Of Christ Ministry, Adewale Giwa, has lashed out at the popular social media app, Facebook, over its censorship of religious views and bible verses.\nSpecifically, the fiery pastor wondered why Facebook would allow other issues on its platform but silence innocuous views as well as shut down harmless voices.\nThe pastor had posted a new month’s prayer and bible verses on his Facebook handle which the blue app had taken down.\nWhile vowing to quit the app, Giwa said, “This is what Facebook has been doing to me for a long time.\n“Of course, I vehemently disagreed and questioned why they could delete a ‘prayer post’ that had nothing to do with politics."
  },
  {
    "headline": "Extradition: Malami cautions court against bail for Kyari",
    "summarized_story": "Attorney-General of the Federation (AGF) and Justice Minister Abubakar Malami has cautioned a Federal High Court (FHC) in Abuja against granting bail to suspended Deputy Commissioner of Police (DCP) Abba Kyari in his ongoing extradition case.\nMalami, in a counter-affidavit to the bail application by Kyari., said the embattled officer could abscond if his request was granted.\nIn his affidavit, the AGF told the court that Kyari was being untruthful about his health going by the fact that the medical report he ‘parades’ was issued three years ago.\nBefore the April 27 fixed by Justice Inyang Ekwo for the hearing of the extradition application, Kyari applied for bail, claiming ill-health.\nBut, in his counter-affidavit, Malami told the court there was nothing to show at the moment that Kyari still suffers the ailment he claims."
  },
  {
    "headline": "What you probably didn’t know about sacked Abuja Chief Imam Nuru Khalid",
    "summarized_story": "What you probably didn’t know about sacked Abuja Chief Imam Nuru KhalidThe sack of the Chief Imam of the National Assembly Legislators’ Quarters Mosque, Sheikh Muhammad Nuru Khalid, has continued to generate mixed reactions.\nRead Also: Sacked Abuja Imam gets new appointmentKhalid asked his listeners not to vote for any politician who cannot guarantee them the safety of lives and property.\nHe became the Chief Imam of the National Assembly Mosque Zone E, Apo Legislators’ Quarters, Gudu District, Abuja in 20075.\nBefore becoming the Chief Imam in Apo, Sheikh Khalid had also served as the Chief Imam of Nyanya mosque also in Abuja.\nAlso called Digital Imam, Sheikh Khalid became popular for speaking truth to power over issues bordering on insecurity, and crises facing the country."
  },
  {
    "headline": "Hotelier to appear in court over alleged raping of corps member",
    "summarized_story": "Hotelier to appear in court over alleged raping of corps memberA hotel manager, who allegedly raped a National Youth Service Corps (NYSC) member in Osogbo, will appear in court on Tuesday.\nOpalola said that the management of NYSC in Osun was following up on the case and providing the needed support.\n“They are interested party in the matter, being guardians and parents in charge of the wellbeing of corps members in the state,” she said.\nThe incident was reported to have occurred at about 8:30 p.m on March 25, when the victim was on duty.\nThe matter was reported at the Police Station, Dugbe in Osogbo, by other corps members serving in the hotel."
  },
  {
    "headline": "ESUT gets new Vice-Chancellor",
    "summarized_story": "The Enugu State Government has appointed Prof. Aloysius-Michaels Okolie as the new Vice-Chancellor (VC) of the Enugu State University of Science and Technology (ESUT).\nThis is contained in a statement, signed by the Secretary to the Enugu State Government, Prof. Simon Ortuanya, and made available to newsmen in Enugu on Tuesday.\nAccording to the statement, Okolie holds a Bachelor of Science Degree (B.Sc.)\n“Prof Okolie belongs to several national and international scholarly and professional Associations and has served in several national and international Committees.\n“Professor Okolie is a Knight of the Order of St. Mulumba and he is married with children,” the statement said."
  },
  {
    "headline": "2023 presidential ticket splits PDP aspirants into 3 camps",
    "summarized_story": "The contenders are former Senate President Bukola Saraki, Bauchi State Governor Bala Mohammed and his Sokoto State counterpart, Aminu Tambuwal.\nOther members of the third group include Enugu State Governor Ifeanyi Ugwuanyi, Abia State Governor Okezie Ikpeazu, Oyo State Governor Seyi Makinde, Benue State Governor Samuel Ortom and his predecessor, Senator Gabriel Suswam.\nThe aspirants are exploring the possibility of having one of the 13 aspirants as a consensus candidate for the 2023 presidential ticket.\nThe four PDP governors have aligned with the demand of the Southern Governors Forum for power to shift to the South in 2023.\nThe team had held a similar meeting with the Taraba State Governor Darius Ishaku in Abuja last week."
  },
  {
    "headline": "Bandits abduct villagers on Abuja-Kaduna highway after IGP declared it safe",
    "summarized_story": "From Noah Ebije, KadunaBandits raided some houses at Anguwar Maji in Jere town, Kaduna State, along the Abuja-Kaduna Highway and abducted 22 villagers at about 11pm, on Sunday.\nJere, which shares a boundary with Tafa-Sabon-Wuse in Niger State, is located on the ever-busy Abuja-Kaduna Highway.\nWhen contacted, spokesman of the Kaduna State Police Command, ASP Mohammed Jalinge, said he would contact the DPO in the area and get back to Daily Sun.\nHe said the bandits, who came in large numbers, invaded some houses and whisked away 22 residents, including five women.\n“The bandits came in their large numbers and some of them wore army uniforms."
  },
  {
    "headline": "Soldiers on red alert in Abuja over planned attack",
    "summarized_story": "From Molly Kilete, AbujaSoldiers have been placed on red alert following intelligence report of planned terror attack on the Federal Capital Territory (FCT).\nDaily Sun sighted some of the soldiers on condone and search operations at Giri close to the University of Abuja.\nAside the road blocks and security checkpoints, the soldiers are also carrying out snap check in different parts of the city.\n“The criminals are taking advantage of these rural communities in the FCT to establish an attack and kidnap innocent persons.\nFor sometime, cases of kidnapping have been rife in the FCT, especially in the communities located along the Abuja/Lokoja highways."
  },
  {
    "headline": "Bishop hails Ugwuanyi on job creation, youth empowerment",
    "summarized_story": "The event commenced with a Mass at St. Alfred’s Catholic Church, Agbudu, which was celebrated by Bishop Callistus Onaga of the Catholic Diocese of Enugu, and attended by Gov.\nThe bishop thanked Ugwuanyi for his presence at the event, in spite of his busy schedule, to support and encourage the company to grow.\nHe added that the governor’s gesture was in keeping with his administration’s commitment to job creation and youth empowerment as well as peace and good governance.\nBishop Onaga disclosed that Gov.\nHe said: “One of us, Emeka Emmanuel Eneh who is sitting down here (Church) is flagging off a rare factory."
  },
  {
    "headline": "Nigeria has no big cake to share anymore — Obaseki",
    "summarized_story": "Governor Godwin Obaseki of Edo has said Nigeria no longer has a big cake to share.\nHe said whoever wants to be the next president must be ready to bake a big cake for all Nigerians to share.\n“Forty years ago, we had a big cake to share but today that cake has disappeared.\n“Thanks for providing leadership and trust, God Almighty that has given you the wisdom to make Nigeria the higher goal.\nWe don’t want to dissipate our energy on just trying to get to power, but how to help make Nigeria better."
  },
  {
    "headline": "PDP govs tackle Presidency over state of the nation – The Sun Nigeria",
    "summarized_story": "From Ndubuisi Orji, AbujaThe Peoples Democratic Party (PDP) Governors, yesterday, berated the Presidency over its response to the opposition governor’s recent communique on the state of the nation.\nThe Forum, in a statement by its Director General, CID Maduabum, described the response of the Presidency through Garba Shehu as infantile.\nThe PDP governors noted that their March 23 communique merely stated the facts as it relate to the existential threat confronting the country under the All Progressives Congress (APC)-led administration.\n“The PDP Governors communiqué made a comparative sketch of Nigeria of 2015 under PDP and Nigeria of 2022 under APC.\nThe communiqué reeled out the fact that in almost all sectors, things have gotten worse by over 1000%."
  },
  {
    "headline": "Nigeria’s Presidential Options: The Die is Cast",
    "summarized_story": "An indigene of Ebonyi State, Anyim is one presidential hopeful, who has stayed away from scandals and maintained a lowkey profile.\nBeing speaker and governor are not enough, he has yet to acquit himself as a potential presidential material.\nHe also has age on his side and from a party, which might throw its presidential ticket open for all.\nDele Momodu (PDP, South South)One of the most influential celebrity journalists in Nigeria’s modern history, Bashorun Dele Momodu, is having his second outing in the nation’s presidential run.\nYahaya Bello(APC, North Central)The Kogi State Governor, Yahaya Bello, is another controversial governor, albeit in the ruling party."
  },
  {
    "headline": "JNI: Any Govt Incapable of Protecting Citizens Lacks Moral Justification to Be in Power",
    "summarized_story": "It bemoaned the recent attack on an Abuja-Kaduna passenger train in which eight people were confirmed killed while many others were either abducted or injured.\n“We claim to be people of faith and all these occurrences are allowed without any form of prompt intervention.\n“Moreover, why must security budget and expenditure remain so secretive, despite the reported release of funds?\nThe statement queried, “Again, why can’t the government proactively take the battle to the criminals’ hideouts and wipe them off?\n“Likewise, parents, religious and community leaders have a role to play in the fight against illicit drugs/substance pervading most households within our neighbourhoods."
  },
  {
    "headline": "16 Months after, FG Bars Unlinked SIM Cards, Begins Enforcement",
    "summarized_story": "The recent order to bar all unlinked SIM cards came 16 months after the federal government gave the first order to deactivate all SIM cards not registered and linked to NIN.\nThe deadlines for the NIN-SIM linkage has been extended on multiple occasions to allow Nigerians to freely comply with the policy.\n“Accordingly, Mr. President graciously approved the many requests to extend deadlines for the NIN-SIM linkage.\nAt this point however, government has determined that the NIN-SIM Policy implementation can proceed, as machinery has already been put in place to ensure compliance by citizens and legal residents.\n“Outgoing calls will subsequently be barred for telephone lines that have not complied with the NIN-SIM linkage policy from the 4th of April, 2022."
  },
  {
    "headline": "Terrorists Attack Zamfara Community, Commissioner’s Son Among those Killed",
    "summarized_story": "By Onuminya InnocentThe Nigeria Police on Monday confirmed terrorists attack on Tsafe local government area of Zamfara State.\nIn the attack on Tsafe town, no fewer than four persons were reportedly killed by the terrorists, including the son of the Zamfara State Commissioner for Internal Security and Home Affairs, DIG Mamman Tsafe (retired).\nSources told THISDAY that the suspected terrorists invaded Tsafe Local Government headquarters in Zamfara State Sunday evening firing gunshots.\nThey killed thr Commissioner’s son, Abba Mamman Tsafe, and also cut his hands.\n“With what just happened they have declared war on government , in Zamfara State now no one is safe”, he said."
  },
  {
    "headline": "Breaking: FG Bars Outgoing Calls on SIM Cards not Linked to NIN",
    "summarized_story": "Emma OkonjiThe federal government has barred all outgoing calls on every SIM card that is not linked to the National Identification Number (NIN) of the SIM card owner.\n“As of date, over 125 Million SIMs have had their NINs submitted for immediate linkage, verification and authentication.\nSimilarly, the National Identity Management Commission (NIMC) has issued over 78 million unique NINs till date,” Pantami said.\nConsequently, the Federal Government has directed all Telcos to strictly enforce the Policy on all SIMs issued (existing and new) in Nigeria.\nOutgoing calls will subsequently be barred for telephone lines that have not complied with the NIN-SIM linkage Policy from the 4th of April, 2022."
  },
  {
    "headline": "EXCLUSIVE Nigerian Police Authorities Sack Six Policemen For ‘Organising’ Strike Action Over Poor Salaries, Terrible Working Conditions",
    "summarized_story": "Some policemen had in March said they would embark on the warning strike to protest poor working conditions, poor salaries, lack of genuine welfare benefits and outdated weapons.\nThereafter, a police signal obtained by SaharaReporters showed that some policemen were arrested as leaders of the aggrieved officers.\nAMOS NAGURAH X F/NO.\nOSTEKU ADEMOLA X F/NO.\nEHIGHAMHEN FAVOUR EBELLE X F/NO."
  },
  {
    "headline": "EXCLUSIVE Nigerian Police Authorities Sack Six Policemen For ‘Organising’ Strike Action Over Poor Salaries, Terrible Working Conditions",
    "summarized_story": "Some policemen had in March said they would embark on the warning strike to protest poor working conditions, poor salaries, lack of genuine welfare benefits and outdated weapons.\nThereafter, a police signal obtained by SaharaReporters showed that some policemen were arrested as leaders of the aggrieved officers.\nAMOS NAGURAH X F/NO.\nOSTEKU ADEMOLA X F/NO.\nEHIGHAMHEN FAVOUR EBELLE X F/NO."
  },
  {
    "headline": "EXCLUSIVE Nigerian Police Authorities Sack Six Policemen For ‘Organising’ Strike Action Over Poor Salaries, Terrible Working Conditions",
    "summarized_story": "Some policemen had in March said they would embark on the warning strike to protest poor working conditions, poor salaries, lack of genuine welfare benefits and outdated weapons.\nThereafter, a police signal obtained by SaharaReporters showed that some policemen were arrested as leaders of the aggrieved officers.\nAMOS NAGURAH X F/NO.\nOSTEKU ADEMOLA X F/NO.\nEHIGHAMHEN FAVOUR EBELLE X F/NO."
  },
  {
    "headline": "BREAKING: Terrorists Sack Nigerian Military Base In Kaduna, Kill 11 Soldiers, Three Vigilantes",
    "summarized_story": "At least 11 soldiers were killed after some terrorists locally dubbed as bandits raided a Nigerian military base in Polwire village in Birnin Gwari Local Government Area of Kaduna State.\nHe said the bandits came in large numbers on motorcycles and engaged the troops in a battle that lasted for two hours before dislodging them.\nThree members of the Kaduna Vigilante Group were also killed during the attack.\n1 X 19 SLDRS AND 2 X KADVS.”On Monday, SaharaReporters had reported that the terrorists also stormed villages across Kagarko and Kachia Local Government Areas of Kaduna State.\nHe said the bandits, who came in large numbers, invaded some houses and whisked away 22 residents, including five women."
  },
  {
    "headline": "BREAKING: Terrorists Sack Nigerian Military Base In Kaduna, Kill 11 Soldiers, Three Vigilantes",
    "summarized_story": "At least 11 soldiers were killed after some terrorists locally dubbed as bandits raided a Nigerian military base in Polwire village in Birnin Gwari Local Government Area of Kaduna State.\nHe said the bandits came in large numbers on motorcycles and engaged the troops in a battle that lasted for two hours before dislodging them.\nThree members of the Kaduna Vigilante Group were also killed during the attack.\n1 X 19 SLDRS AND 2 X KADVS.”On Monday, SaharaReporters had reported that the terrorists also stormed villages across Kagarko and Kachia Local Government Areas of Kaduna State.\nHe said the bandits, who came in large numbers, invaded some houses and whisked away 22 residents, including five women."
  },
  {
    "headline": "NIN: Subscribers lament as telcos commence blocking of outgoing calls on unlinked SIMs",
    "summarized_story": "On Monday, the federal government directed all telcos to restrict unlinked SIMs from making calls.\nTheCable had reported that the deadline for NIN-SIM linkage ended on March 31 — after about nine times of postponing it.\nAdvertisementLamenting difficulties in making calls on Tuesday, a Twitter user and Glo subscriber, @Tee_Classiquem1, taunted the telco for quickly complying with the government’s directive.\nAdvertisement“MTN has barred me from making calls due to NIN-SIM linkage.\nMTN has barred me from making calls due to NIN-SIM linkage."
  },
  {
    "headline": "NIN: Subscribers lament as telcos commence blocking of outgoing calls on unlinked SIMs",
    "summarized_story": "On Monday, the federal government directed all telcos to restrict unlinked SIMs from making calls.\nTheCable had reported that the deadline for NIN-SIM linkage ended on March 31 — after about nine times of postponing it.\nAdvertisementLamenting difficulties in making calls on Tuesday, a Twitter user and Glo subscriber, @Tee_Classiquem1, taunted the telco for quickly complying with the government’s directive.\nAdvertisement“MTN has barred me from making calls due to NIN-SIM linkage.\nMTN has barred me from making calls due to NIN-SIM linkage."
  },
  {
    "headline": "'I've no history of betrayal' -- Malami declares for Kebbi governorship",
    "summarized_story": "Abubakar Malami, attorney-general of the federation (AGF), has declared his intention to run for the Kebbi state governorship in 2023.\nMalami, who is also the minister of justice, declared his intention to run for the office at an event in Kebbi on Monday.\nHe lost the Kebbi governorship ticket of the All Progressives Congress (APC) to Atiku Bagudu, the state governor, in 2014.\n“If God in His mercies permits, and all goes well, I will as a politician contest the governorship of Kebbi state.\nI will work for you.”As minister, Malami has not been able to stay clear of controversies, disproving his actions with corresponding reactions."
  },
  {
    "headline": "'I've no history of betrayal' -- Malami declares for Kebbi governorship",
    "summarized_story": "Abubakar Malami, attorney-general of the federation (AGF), has declared his intention to run for the Kebbi state governorship in 2023.\nMalami, who is also the minister of justice, declared his intention to run for the office at an event in Kebbi on Monday.\nHe lost the Kebbi governorship ticket of the All Progressives Congress (APC) to Atiku Bagudu, the state governor, in 2014.\n“If God in His mercies permits, and all goes well, I will as a politician contest the governorship of Kebbi state.\nI will work for you.”As minister, Malami has not been able to stay clear of controversies, disproving his actions with corresponding reactions."
  },
  {
    "headline": "FACT CHECK: Is this video of ‘Niger residents' fleeing from bandits true?",
    "summarized_story": "Many social media users claimed the people in the viral video are residents of Shiroro LGA, Niger state, who were allegedly fleeing from bandits.\nA Facebook user, Ma Azi, posted the video with the caption, “Residents fleeing as bandits sack six communities in Niger state.” The video has gathered almost 10,000 views, over 122 shares and 62 comments.\nAdvertisementThe video was also posted here:Another Video showing Residents fleeing their homes after bandits attacked the border Communities within Shiroro, Munya & Kafikoro LGAs 3 days ago.\nAdvertisementOn February 20, TheCable had reported how gunmen killed at least 10 persons, including security operatives, in Galadima Kogo community, Shiroro LGA, Niger state.\nVERDICTBased on available evidence, the viral video attributed to fleeing residents of Shiroro LGA of Niger state was from Kousseri, Cameroon."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "13 years, $10bn processed. How has Paga evolved over the years?",
    "summarized_story": "After considering several ideas for a couple of months, Oviosu came up with what is now Paga.\nPaga was arguably the first fintech company in Nigeria to popularise mobile money among the unbanked.\nIn 2021, Paga opened up its platform to more businesses through Collect APIs, which more than 200 businesses currently use.\nExpansion“The vision is still the same—to solve payments for individuals and businesses,” Oviosu said.\nTayo Oviosu, Paga co-founder and CEO."
  },
  {
    "headline": "Peace Itimi: From Nigeria to the UK in search of peace",
    "summarized_story": "Peace Itimi has spent 9 months away from Nigeria but doesn’t miss the country.\nShe said university had been one of the most definitive phases of her life because it was where she found God, found herself, and digital marketing.\nFresh from school, she launched a digital marketing agency with a friend in 2016.\nIn 2018, she joined Wild Fusion, another digital marketing agency, where she trained people on digital marketing, branding, Google Ads, and SEO.\nDuring one of her travels for digital marketing training in Accra, she realised that even though she loved travelling, her physical reach was limited."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ever heard of the term, Hope as a Service?\nWell, me neither.\nAt least until last Wednesday when we recorded..."
  },
  {
    "headline": "Jumia X UPS, Fun with USSD, More on Pitch Friday",
    "summarized_story": "Source: SuppliedQuick one: How often do you use USSD to perform payment transactions as a smartphone user?\nMy best guess is that you would almost always choose a bank app over USSD.\nAccording to the Global System for Mobile Communications Association (GSMA), nine in 10 mobile money transactions in sub-Saharan Africa are done through USSD.\nCatch up on the previous edition: Nerves and laughter as Techpoint Pitch Friday returnsThere, three selected founders get to pitch their startups or ideas before an audience and get feedback.\nThis month’s Pitch Friday holds by 5 pm on Friday, March 8, 2022, at 43b Emina Crescent, Opebi, Allen, Ikeja (See directions)."
  },
  {
    "headline": "Stax is levelling the playing field between USSD and bank apps",
    "summarized_story": "According to the Global System for Mobile Communications Association (GSMA), nine in 10 mobile money transactions in sub-Saharan Africa are done through USSD.\nLyon described Stax as an online payment super app for Africa that brings together all USSD based services in one place.\nWhat Stax does is run the USSD in the background and reduce the USSD menus to fewer taps within the app.\nThe Stax app works almost like any bank app, but offline.\nHow Stax makes moneyFree to use, Stax only takes a USSD telco session charge."
  },
  {
    "headline": "King MTN and the tax collector",
    "summarized_story": "Even though I’ve been a football fan for the last 13 years, I’ve never understood the craze behind fantasy football.\nSo imagine my surprise when I heard African football fantasy startup, Eksab had raised $3million in funding on Monday, March 28, 2022.\nWhat’s fantasy football, though?\nBut what does a fantasy football startup raising money mean for the “ecosystem”?\nApart from this, however, is one crucial fact: MTN contributes double-digit percentages to Nigeria’s tax revenue."
  },
  {
    "headline": "Vigilante operatives escapes ambush by suspected herdsmen in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEvboesi – Vigilante operatives at Evboesi community in Orhionmwon local government area of Edo state narrowly escape death on Monday after suspected armed herdsmen ambushed their vehicle along the Benin-Abraka road adjacent the railway line.\nThe operatives numbering six were about to park their operational vehicles at their base along the road to commence daily security duties when the armed men opened fire on them.\nAs they were about to pack their vehicles, suddenly the herdsmen starting shooting at the vehicles while my men were still inside.\nA motorist, Benjamin Ebiyemi appealed to the state government to support the vigilante groups operating in the area with the necessary logistics to enable them complement the police.\nIf no dem, nobody fear go let am pass that road; and na im the herdsmen dey vex for them."
  },
  {
    "headline": "Enhancing Anti-Corruption and Social Inclusive Reforms Initiatives in Nigeria: ANEEJ lauded at Inception meeting – Nigerian Observer",
    "summarized_story": "“There are research that have now demonstrated that when there is absence of transparency the tendency is to have accountability impaired.\nIn the past, ANEEJ was known for coming from the confrontational background, throwing stones.\nHaving to associate with ANEEJ we know that we would be able to achieve that at the National Assembly,” she enthused.\n“We thank ANEEJ for including the people with disability in this project, we have never had it so good.\nAccording to Sandra Eguagie, the second indicator to be measured in this project is the total number of anti-corruption commitment and oil commission mandate and policy documents reviewed."
  },
  {
    "headline": "Edo extends internship, apprenticeship programme to youths in Edo North, Central – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government through the state’s skills development agency, EdoJobs has extended its internship and apprenticeship programme to youths in Edo North and Central Senatorial Districts, deploying the youths to different organizations to acquire firsthand knowledge of how organizations operate.\nThe programme is being organised in partnership with the German development agency, the Deutsche Gesellschaft Fur Internationale Zusammenarbeit (GIZ) and the Swiss Agency for Development Cooperation (SDC).\nThe Managing Director, EdoJobs, Ukinebo Dare, who disclosed this to journalists in Benin City, said the extension followed the success of the programme in Edo South.\nShe said the project is an arm of the Rural Youth Employment (RYE) to tackle unemployment in rural areas.\nThe scheme, which began in January and ends in April, is for the youths in Edo North and Edo Central."
  },
  {
    "headline": "Edo begins assessment of workers for promotion – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has commenced the evaluation and assessment exercise for the promotion of workers in the state’s civil and public service.\nThe Edo State Head of Service, Anthony Okungbowa Esq., who disclosed this to journalists, in Benin City, during training/evaluation exercise for the workers, said the government is committed to sustaining reforms in the civil and public service to enhance optimal service delivery.\nOkungbowa said the Governor Godwin Obaseki-led administration will sustain efforts at retooling workers with the right skills and knowledge to provide quality service to Edo people.\nHe further disclosed that Governor Obaseki had earlier granted approval for the 2020 and 2021 promotions in order to ensure that all outstanding promotions are cleared, thereby guaranteeing that promotion in the civil and public service is done as and when due.\nOkungbowa stated that “the Government will always place the welfare of workers as a top priority as every Edo worker is valuable and essential for the programme and policies of Government to effectively strive.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Abuja Imam sacked for criticising Buhari gets new appointment",
    "summarized_story": "Sheikh Muhammad Nuru Khalid, erstwhile Chief Imam of the National Assembly Legislators’ Quarters Mosque removed for criticising the government of President Muhammadu Buhari over rising insecurity in the country, has gotten a new appointment.\nHe described the termination of his appointment by Legislators’ Quarters Mosque’s management committee as necessary price he had to pay for identifying with the sufferings masses and speaking truth to power.\n“This is the price we pay for aligning with the people and identifying with their sufferings.\n“By the Grace of Almighty Allah, I will be leading my new congregation this Friday, because as cleric we need a platform for operate.\n“There’s a Jum’mat mosque we built behind the CBN Quarters, in Abuja; I will now be leading the congregation there.”"
  },
  {
    "headline": "Ramadan 1443AH: Ademola Adeleke shares rice, beans to Osun indigents",
    "summarized_story": "By Sunday Oguntuyi, OsogboSenator Ademola Adeleke, governorship candidate of the People’s Democratic Party (PDP) in the July 16 governorship election in Osun state, has begun to distribute food items to the less privileged in the state in bid to make the ramadan period smooth for the indigenes.\nAdeleke commenced rice and beans distribution across the 332 wards in the state.\nAccording to one of his aides in charge of the exercise who preferred anonymity, the exercise has become routine for Adeleke dynasty to cushion the hardship melted on the people as a result of battered economy.\nThe exercise which commenced on Monday, will cover all the 10 local government in Osun West Senatorial District.\nHe also urged the people to be orderly during the exercise as no one would be excepted in the food distribution exercise."
  },
  {
    "headline": "Saving public tertiary education in Nigeria",
    "summarized_story": "For several years now, the public tertiary education space in Nigeria has been afflicted by a rash of industrial actions arising from the displeasure of academics and other stakeholders in the system over the inability of government to honour collective bargaining agreements and give a jolt of life to the sector.\nThe latest experience of this disruption in the academic calendar of public tertiary institutions began in February when the Academic Staff Union of Nigerian Universities, ASUU resumed its warning strike action that it had earlier suspended.\nAnd for the better part of seven weeks, the institutions have in the immediate, remained cold rooms for study purposes.\nThey include the challenge of securing enduring quality for the system in a world where tertiary education is evidently a universal engagement where global best practices are the norm.\nIn the past there have been several suggestions, including one that public office holders be forced to compulsorily educate their children and wards within the countrys public tertiary educational system."
  },
  {
    "headline": "Tension mounts over Lekki Tollgate reopening",
    "summarized_story": "By ADEBAYO OBAJEMUIf not properly handled the proposed reopening of Lekki Toll gate may prove a sticky one for the administration of Babajide Sanwoolu of Lagos State.\nBut that was not before the Lekki Concession Company, operators of the Lekki Toll Gate, where the killings happened, was indicted.\nRecently, the Lagos State Commissioner for Information, Gbenga Omotoso, announced plans by the Lagos State Government to open the Lekki Toll Gate closed for over 18 months since the massacre.\n“For money, reopening Lekki Toll gate without the state paying adequate compensations to victims and publicly apologizing is not the path to go”, said Professor Adeagbo Moritiwon, a political scientist.\nSome Nigerians also took to social media to demand justice for people killed and injured at Lekki Toll Gate during the #EndSars protest."
  },
  {
    "headline": "Sacked Abuja Imam Gets New Appointment",
    "summarized_story": "The sacked Chief Imam of National Assembly Mosque Zone E, Apo Legislative Quarters in Abuja, Sheikh Nuru Khalid, has been appointed by the Management Committee of a new Jum’mat Mosque behind the Central Bank Nigeria (CBN) Quarters, Abuja.\nSheikh Khalid was sacked by the Apo mosque’s Steering Committee on Monday for criticising President Muhammadu Buhari over last Monday night’s attack on an Abuja-Kaduna train.\nHe, however, described the termination of his appointment by the mosque’s management committee as a necessary price he had to pay for identifying with the suffering masses and speaking truth to power.\nADVERTISEMENTKhalid said: “By the Grace of Almighty Allah, I will be leading my new congregation this Friday, because as clerics we need a platform to operate.\n“There’s a Jum’mat mosque we built behind the CBN Quarters, in Abuja; I will now be leading the congregation there.”ADVERTISEMENT"
  },
  {
    "headline": "NYSC Opens Garment Factory, Others To Boost IGR",
    "summarized_story": "National Youth Service Corps (NYSC) has commissioned North-Central Skill Acquisition Centre (SAED) and the garment, bakery and water factories located in Keffi, Nasarawa State to boost Internally Generated Revenue (IGR).\n“They will also serve as additional training avenues for Corps members enrolling for relevant vocational skills under the SAED programme.\nADVERTISEMENTADVERTISEMENTHe emphasised the need to train youths to be self-sufficient, saying that the government alone cannot give jobs to everyone.\nThe Emir of Lafia, Sidi Bage Muhammad said the DG has set a pace that any one coming after him will have to work very well.\nThe event was attended by former Chiefs of Army Staff: Lieutenant General AB Danbazau (rtd) and Lieutenant General TY Buratai (rtd), among other dignitaries."
  },
  {
    "headline": "NNPP Condemns Spate Of Insecurity, Urges FG To Arrest Situation",
    "summarized_story": "New Nigeria People’s Party (NNPP) has condemned the spate of insecurity in the country and urged the federal government to arrest the situation immediately as no part of the country is safe.\nThe need for a new Nigeria which only New Nigeria People’s Party will provide cannot be overemphasised.\nThe party said it is time to take governance seriously, arrest the perpetrators of these heinous crimes against the fatherland and their sponsors to face the full weight of the law.\nIt noted that Nigeria cannot be the great arsenal of democracy in Africa when its leaders are still groping in the dark confused on the way forward.\nADVERTISEMENTThe party urged eligible Nigerians to register and obtain their voter cards, and ensure they vote out all those that have brought the nation to this sorry state and their stooges to pave way for a new Nigeria."
  },
  {
    "headline": "NNPP Condemns Spate Of Insecurity, Urges FG To Arrest Situation",
    "summarized_story": "New Nigeria People’s Party (NNPP) has condemned the spate of insecurity in the country and urged the federal government to arrest the situation immediately as no part of the country is safe.\nThe need for a new Nigeria which only New Nigeria People’s Party will provide cannot be overemphasised.\nThe party said it is time to take governance seriously, arrest the perpetrators of these heinous crimes against the fatherland and their sponsors to face the full weight of the law.\nIt noted that Nigeria cannot be the great arsenal of democracy in Africa when its leaders are still groping in the dark confused on the way forward.\nADVERTISEMENTThe party urged eligible Nigerians to register and obtain their voter cards, and ensure they vote out all those that have brought the nation to this sorry state and their stooges to pave way for a new Nigeria."
  },
  {
    "headline": "Nigerians Spend $1bn Annually On Medical Tourism – NMA",
    "summarized_story": "Nigerian Medical Association (NMA) has said that Nigerians spend $1billion annually on medical tourism, adding that 9,000 doctors left the country for the United Kingdom, United States of America and Canada in two years (2016-2018), leaving the country with just 4.7 per cent specialists.\nThis, the NMA said, has negatively impacted the country’s health care system.\nSpeaking at the association’s maiden annual lecture, theme: “Brain Drain and Medical Tourism: The Twin Evil in Nigeria’s Health System,” on Monday in Abuja, NMA president, Professor Innocent Ujah, said Africa, including Nigeria, was encountering a health workforce crisis.\nNoting that human resources for health represents one of the six pillars of a strong and efficient health system, Ujah said, “The Nigerian health sector today groans under the devastating impact of huge human capital flight which now manifests as brain drain.”ADVERTISEMENTHe said the huge amount Nigerians were injecting into medical tourism was weakening Nigeria’s economy.\nADVERTISEMENT"
  },
  {
    "headline": "You are tone deaf: Naomi Campbell blasts Grammys for Wizkid-Tems snub",
    "summarized_story": "In a post on Instagram early Tuesday, Naomi first consoled Wizkid for being snubbed by the Academy in two awards categories.\nNaomi attached Essence song in her post and peerless statistics that really showcased Essence and Made In Lagos as champions.\nThen, she descended on the Recording Academy for choosing to be “tone deaf” to what is going in the universe.\n“#MadeinLagos Album and song Essence ,was clearly in the wrong category.\nAfrobeats in our hearts Africabeats to the world !, Naomi wrote."
  },
  {
    "headline": "Cross River govt does not owe workers: HoS Akwaji",
    "summarized_story": "By Christian NjokuThe Cross River government has faulted media reports alleging that it has been unable to pay salaries to workers and gratuities to pensioners in the state.\nThe Head of Service (HoS), Mr Timothy Akwaji made the clarification in a statement on Tuesday in Calabar.\nAkwaji said the reports were malicious, untrue and concocted to dent the good image of Gov.\n“However, any person or group of persons who have genuine claims of being owed salaries and pensions should forward same to the HOS for investigation and further action.\nHe said that the government would remain focused in its determination to address the concerns of workers and senior citizens of the state."
  },
  {
    "headline": "2023 Zoning: The Age Of Reasoning By Chief Olisa Metuh",
    "summarized_story": "The truth is that zoning at this late hour was designed to favour just one man.\nThe plan is that once it comes to the South even the southeast governors will support the southsouth aspirant to emerge.\nI still submit that zoning at this late hour will breed rancour, division, resentment and bitterness.\nA lot of PDP members erroneously believe that whoever is our presidential candidate will easily win the election.\nI kept quiet in 2015 and will no longer keep quiet when I see plans that will only bring electoral failure."
  },
  {
    "headline": "JUST IN: Terrorists Gun Down Soldiers In Kaduna, Set Armoured Vehicles On Fire",
    "summarized_story": "JUST IN: Terrorists Gun Down Soldiers In Kaduna, Set Armoured Vehicles On FireIn Kaduna State, at least 11 troops were murdered in an ambush set up by militants along the Kaduna-Birnin Gwari route.\nThe 123-kilometer Kaduna-Birnin Gwari highway has been rated as one of northern Nigeria’s most dangerous highways.\nHundreds of militants ambushed and slaughtered the soldiers, according to security officials, setting two military Armoured Personnel Carriers (APC) on fire.\nHe claimed the terrorists were going in large groups with multiple herds of cows when the soldiers engaged them, believing the cows had been rustled.\n“The soldiers thought it was a few bandits and tried to engage them, yes, they killed some of the bandits but the terrorists overpowered them."
  },
  {
    "headline": "Nigerian Army Deploys Troops Around Abuja Over Intel On Planned Invasion By Terrorists",
    "summarized_story": "Nigerian Army Deploys Troops Around Abuja Over Intel On Planned Invasion By TerroristsThe Nigerian Army has deployed more troops around communities in the Federal Capital Territory, Abuja as well as placed its men on red alert to contain a terrorist attack on the FCT.\nSome of the villages and area councils located along the Abuja/Lokoja expressway namely Abaji, Kwali and Gwagwalada Area Councils are being fortified as well as Bwari, Zuba and areas close to the Kaduna Road."
  },
  {
    "headline": "US Extradition: Abba Kyari To Know Fate June 14",
    "summarized_story": "The Federal High Court’s Abuja Division postponed hearing on a complaint seeking to prevent the Federal Government from extraditing suspended Deputy Commissioner of Police Abba Kyari to the United States of America for trial until June 14.\nThe Nigeria Police Force and Attorney General of the Federation and Minister of Justice, Abubakar Malami, SAN, are named as defendants in the FHC/ABJ/CS/854/2021 complaint.\nFollowing the absence of all parties in court on Monday, Justice Donatus Okorowo delayed the case.\nNeither the applicant nor the respondents were in court when the case was called for a hearing.\nAs a result, Justice Okorowo, who had threatened to dismiss the case for lack of diligence, indicated he was willing to grant another adjournment."
  },
  {
    "headline": "At last, Cubana Chief Priest breaks silence after EFCC ordeal",
    "summarized_story": "Politician and Businessman, Pascal Chubuike Okechukwu, popularly known as Cubana Chief Priest, has finally broken silence after his arrest by the Economic and Financial Crimes Commission (EFCC).\nIt was reported on Saturday night that the socialite was arrested by the commission over allegations of tax fraud.\nHe was said to have been apprehended at the Nnamdi Azikiwe International Airport in Abuja on Wednesday.\nThe entrepreneur however returned to social media on Monday shortly after singer, Davido, announced his return from EFCC custody.\nIn one of the posts on his Instagram page, the Chief Priest, reacted to his recent ordeal, saying “what doesn’t kill you makes you stronger.”"
  },
  {
    "headline": "Train attack: The humanity in us slowly being eroded – JNI – Blueprint Newspapers Limited",
    "summarized_story": "It also expressed worry that the tragic train attack may have indicated the nation was heading towards an unknown destination of chaos.\nJNI Secretary-General Dr. Khalid Abubakar Aliyu made the group’s position known Monday in a statement issued to journalists in Kaduna.\nTitled ‘Passengers’ bound train attack along Abuja-Kaduna rail track’, the statement said: “To say the least Jama’atu Nasril Islam (JNI) is agonised and short of words to express her-self over the gory incident of the infamous train attack which happened on Monday, 28th March, 2022.\nThe mind boggling train attack of Monday, 28th March, 2022, the kidnap and sporadic shootings that ensued thereafter the train en-route Kaduna needs to be seriously investigated and punitive measures taken.\nAlthough, without doubt, the security men have exhibited capacity, resilience, determination and dexterity during the rescue operation of the same ill-fated train attack."
  },
  {
    "headline": "2023: Ortom-led PDP zoning committee set to meet",
    "summarized_story": "The race to the Presidential Villa in 2023 is getting more intense in the Peoples Democratic Party (PDP) as the party’s 37-man zoning committee meets to take a decisive position.\nThe source, a high ranking member of the party and also a member of the committee who did not want his name in print said, “the zoning committee has met twice since inauguration.\n“The previous meetings ended inconclusively as members of the committee were advancing arguments to favour their zone.\nOthers who have obtained the PDP presidential nomination form include, Sokoto state Governor Aminu Tambuwal, Bauchi state Governor Bala Mohammed; Akwa Ibom state Governor Udom Emmanuel; former Senate President Abubakar Bukola Saraki; Oliver Diana Teriela, Nwachukwu Anakwenze, Ovation Publisher, Dele Mohammed, Sam Ohuabunwa and Mohammed Hayatu-Deen.\nDokpesi hopeful on AtikuIn a related development, the chairman, Technical Committee, Atiku Presidential Project, High Chief Raymond Dokpesi, has expressed confidence that the PDP zoning would not affect the former VP."
  },
  {
    "headline": "Social Media Marketing for Franchises is Meant for Women",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nI think I’d go mad if I didn’t have a place to escape to."
  },
  {
    "headline": "Radio Air Time Marketing: A New Strategy for the Economy",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nI think I’d go mad if I didn’t have a place to escape to."
  },
  {
    "headline": "Style Spy: Fashion Model Goes Casual in Faux Furr and Plaid",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nFashion moves so quickly that, unless you have a strong point of view, you can lose integrity."
  },
  {
    "headline": "Now Is the Time to Think About Your Small-Business Success",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nI think I’d go mad if I didn’t have a place to escape to."
  },
  {
    "headline": "Entrepreneurial Advertising: The Future Of Marketing",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nI think I’d go mad if I didn’t have a place to escape to."
  },
  {
    "headline": "10 Soldiers Killed As Bandits Attack Military Base In Kaduna",
    "summarized_story": "At least 10 soldiers have been killed and some others injured by bandits proscribed as terrorists who attacked a military base in Birnin-Gwari Local Government Area of Kaduna State.\nAccording to the source, the bandits monitored the movement of the soldiers and when some of them went out to the headquarters of the Forward Operational Base located inside Birnin-Gwari town, they immediately launched an attack on the few soldiers at the FOB extension.\nThe superior firepower of the bandits led to the death of about 10 soldiers, while a patrol vehicle was also destroyed during the attack.\nMonday’s attack followed the abduction of 11 persons by bandits who attacked Angwar Maji community at Jere town in Kagarko Local Government Area of the state.\nThe attack occurred on Sunday night at the community located close to the Abuja-Kaduna Highway and the Kaduna- Bwari Road."
  },
  {
    "headline": "COVID-19: Nigeria’s Vaccinated Population Exceeds 32 Million",
    "summarized_story": "The figure comprises those who have taken the first and second doses, as well as the booster shots of these vaccines.\nIt stated that across the country, 19,357,049 of total eligible persons targeted for vaccination have been partially vaccinated while 12,831,601 have fully taken the jabs.\nThis means that 32,188,650 of the total eligible persons targeted for vaccination have taken at least a jab of the vaccines.\n“Kindly avail yourselves of this opportunity in the ongoing mass vaccination exercise to get vaccinated against COVID-19.\n“Complete your COVID-19 vaccine doses for full protection."
  },
  {
    "headline": "CBN Warns Nigerians To Avoid Dealing With Illegal, Unlicensed Financial Operators",
    "summarized_story": "The Central Bank of Nigeria (CBN) has warned Nigerians to avoid dealing with illegal and unlicensed financial operators who lure and defraud members of the public.\nThe Apex Bank in a statement on Monday said the increase in the activities of Illegal Financial Operators (IFOs) is becoming worrisome and portends a grave risk to public confidence and the stability of the Nigerian Financial System.\n“The FSRCC wishes to draw the attention of the general public to the worrisome increase in the activities of the Illegal Financial Operators (IFOs) which portends grave risk to public confidence and the stability of the Nigerian Financial System.\nCBN, therefore advised members of the public to visit its official website and that of the Securities and Exchange Commission (SEC) and other relevant member agencies of the FSRCC to verify the registration and license status of such companies and schemes before investing in them.\nThey also advised Nigerians to report any individual or entities suspected to be involved in such nefarious activities to the law enforcement agencies."
  },
  {
    "headline": "Mock-UTME: Diesel Price, Others Force JAMB To Increase Service Charge",
    "summarized_story": "The Joint Admissions and Matriculations Board (JAMB) has announced an increase in the service charge for this year’s mock Unified Tertiary Matriculation Examination (UTME).\nLess than a week to the optional examination, the board disclosed that the service charge has been increased by N400.\nIt stated that while the examination would be conducted freely at its centres, JAMB said candidates willing to take part would have to pay N1,000 to their Computer-Based Test (CBT) centres as a service charge.\nIt explained that the mock examination was introduced to give candidates the opportunity to familiarise themselves with the CBT environment.\n“However, candidates assigned to JAMB owned centres would not be required to pay for the use of the centres."
  },
  {
    "headline": "Five Dead In Hungary Train Crash",
    "summarized_story": "Five people died in a train crash in Hungary on Tuesday when a van drove onto the rails at a crossing, causing the train to derail, police said.\nAll of the victims were passengers in the van which was carrying workers to work, police said in a statement.\n“Five people died at the scene and more than 10 were injured”, the statement said.\nAccording to Hungarian state railway MAV, the van entered the level-crossing despite the stop sign showing.\n“There were 22 passengers on the train, two were seriously injured, eight suffered minor injuries, several of the van’s passengers were killed,” said the MAV statement."
  },
  {
    "headline": "Sunshine Stars end Plateau United’s 11- game winning streak",
    "summarized_story": "Sunshine Stars have ended Plateau United’s 11- game winning streak after edging out the Jos club 1-0 in their Nigeria Professional Football League matchday 20 in Ijebu Ode.\nThe result means Plateau United remain in second position, two points adrift of leaders Rivers United.\nLobi Stars ended their five-game winless streak with a 2-0 home win against Enugu Rangers.\nIn Aba, Enyimba recorded a 2-0 win against Wikki Tourists courtesy of goals by Abel James and Victor Mbaoma.\nFULL RESULTSMFM 1-0 HeartlandKwara Utd 2-1 Remo StarsTornadoes 1-0 DakkadaSunshine Stars 1-0 Plateau UtdEnyimba 2-0 WikkiLobi 2-0 RangersGombe Utd 1-0 Kano PillarsNasarawa Utd 2-0 3SC"
  },
  {
    "headline": "Tottenham thump Newcastle 5-1 to move into top four",
    "summarized_story": "Tottenham came from behind to comfortably beat Newcastle and moved up to fourth in the Premier League.\nElsewhere, West Ham moved up to sixth in the Premier League with a win over 10-man Everton, a result that keeps the Toffees in relegation trouble.\nAt the top, Liverpool recorded a 2-0 home win over Watford to keep pace with Manchester city who were also 2-0 winners over Burnley.\nMeanwhile, lots of attention was on the Barcelona versus Sevilla cracker and the match lived up to its hype.\nIt was end to end football but it was the catalans who edged the game 1-0, courtesy of Pedri’s 72nd minute goal."
  },
  {
    "headline": "2022 World Cup draw: USMNT faces England, Iran in Group B",
    "summarized_story": "World Cup Group B drawEnglandHaving reached the semifinals of the 2018 World Cup and then the final of Euro 2020 — only to lose painfully on penalties to Italy — England will be determined to go one better in Qatar and finally win their first major trophy since 1966.\nCurrent FIFA world ranking: No.\nThe U.S. will be a real threat going forward for teams to worry about, given their 21 goals scored in qualification.\nWales will look to qualify for a first World Cup finals since 1958, when they reached the quarterfinals of the competition.\nGareth Bale and Daniel James will be crucial to any World Cup hopes."
  },
  {
    "headline": "11 Soldiers Feared Killed, Several Reported Injured in Terrorists Attack in Kaduna -",
    "summarized_story": "In Kaduna State, about 11 soldiers are feared to have been killed in a fierce fire exchange with terrorists who allegedly invaded a military base in Brinin Gwari local council on Monday.\nAlthough the military authorities are yet to confirm the incident, it was gathered that several other soldiers allegedly sustained injuries while the military also recorded equipment casualty.\nThe incident is coming barely a week after terrorists ambushed a kaduna bound train and open fire on trapped passengers killing at least eight of them.\nBrining Gwari Local government area is tagged one of the most unsafe areas in Kaduna state and the North west region due to the overwhelming presence of terrorists.\nMany have been killed while several people have been displaced."
  },
  {
    "headline": "Kyiv Mayor Klitschko Says All European Payments to Russia Are ‘Blood Money’",
    "summarized_story": "The flow of “bloody money” to Russia must stop, Kyiv’s mayor said on Tuesday as the West prepared new sanctions on Moscow after dead civilians were found lining the streets of a Ukrainian town seized from Russian invaders.\nRussia denies targeting civilians and said the deaths had been staged by the West to discredit it.\n“Every euro, every cent that you receive from Russia or that you send to Russia has blood, it is bloody money and the blood of this money is Ukrainian blood, the blood of Ukrainian people,” Mayor of Kyiv Vitali Klitschko, dressed in military clothes, told a mayors’ conference in Geneva via video link.\nRussian news agency Interfax cited a deputy Russian foreign minister as saying talks, which last convened on Friday, were continuing via video link.\nSo far, however, Moscow has kept gas flowing to Europe, despite uncertainty over Putin’s demands for payments in roubles."
  },
  {
    "headline": "Civilians and Police Clash in Peru Over Inflation, President Castillo Imposes Curfew in Lima",
    "summarized_story": "Peruvian President Pedro Castillo has imposed a curfew in the capital, Lima, and the port city of Callao following nationwide protests over rising fuel and fertiliser prices.\nPresident Castillo announced the curfew after a meeting with his Council of Ministers.\nSocial protest is a constitutional right, but it must be done within the law,” President Castillo said in a TV address.\nThe curfew – which will affect some 10 million people – has been widely criticised as “authoritarian” by critics of the president.\nThe protests come at a time when Peru is already suffering from high inflation and the president’s popularity is low."
  },
  {
    "headline": "Sudan: ICC to Try Darfur War Crimes Suspect",
    "summarized_story": "A suspected former leader of the pro-government Janjaweed militia has been charged with 31 counts of war crimes and crimes against humanity.\nHe is wanted on charges of genocide and war crimes, which he denies the charges.\nMr Abd-al-Rahman surrendered to the ICC in 2020 after 13 years on the run.\n“He is alleged to have implemented the counter-insurgency strategy of the Government of Sudan that also resulted in the commission of war crimes and crimes against humanity in Darfur,” the ICC said.\nDuring previous court appearances, Mr Abd-al-Rahman said he was the victim of mistaken identity, Reuters news agency reports."
  },
  {
    "headline": "Dele Momodu: I Am The Only Presidential Candidate With National Spread",
    "summarized_story": "As the zoning committee of the Peoples Democratic Party – the PDP meets today to decide their resolution on zoning of the 2023 presidential ticket, there are currently, two divides in the campaign for the zoning of the presidential ticket.\nOn the one hand is the pro-zoning group, which wants the presidential ticket to be zoned to the South.\nThis group consists majorly of PDP leaders from the South, while on the other hand the proponents of no zoning are majorly from the north.\nThe latter wants the PDP presidential ticket thrown open to all qualified aspirants.\nFor a critical view of what to expect in today’s meeting, Dele Momodu, a PDP Presidential hopeful, a journalist/publisher, businessman, and motivational speaker joins us."
  },
  {
    "headline": "Nigeria Urges Shell, Chevron, NNPC to Allow Third Parties Use Their Gas Pipelines",
    "summarized_story": "Shell Nigeria, Chevron and the Nigerian National Petroleum Company (NNPC) Limited are hindering full operation of the Nigeria Liquefied Natural Gas (NLNG) project by not allowing third parties transit gas through their pipelines, Nigeria’s federal government alleged on Monday.\n“The issue we have with the existing NLNG Trains is that of insufficient gas supply.\nThe partners are running out of gas and they are refusing third party to supply gas to the Trains.\n“The partners are insisting that they can only allow third party supply gas to the plant only if they agree to supply at subsidised rates.\nEurope has recently begun to pile pressure in Nigeria to ramp of gas supply to the continent following the Russia-Ukraine war."
  }
]