[
  {
    "headline": "Army flag flies at half-mast at headquarters",
    "summarized_story": "The flag of the Nigerian Army is currently flying at half mast at its headquarters in Abuja.\nAs of the time our correspondent visited the headquarters of the Nigerian Army located within the Armed Forces Complex in Garki, Abuja about 10.30am on Saturday, only the Army flag was flying at half-mast.\nSoldiers on sentry duty were seen watching movements around the premises with keen attention.\nAs expected, the premises looked deserted since it’s weekend.\nThe premises of the Nigeria Defence College located on Herbert Macaulay Way also looked deserted as of the time our correspondent visited."
  },
  {
    "headline": "Corpses of Kaduna plane crash victims arrive church premises",
    "summarized_story": "Sami Olatunji and Deborah Tolu-KolawoleAmbulances conveying the remains of some of the military officers who died in the Beachcraft 350 aircraft that crashed at the Kaduna International Airport on Friday have arrived at the premises of the Nigerian Air Force Protestant Church for the funeral prayer.\nFamilies of Brigadier General Olayinka, Flying Lt Asaniyi, Flying Lt AA Olufade, Sergeant Adesina and ACM Oyedepo are at the service."
  },
  {
    "headline": "Gunmen kill two NSCDC officers, cart away arms in Anambra",
    "summarized_story": "Gunmen have killed two officers of the Nigerian Security and Civil Defence Corps in Anambra State.\nHe said the State Commandant, David Bille, was collaborating with sister security agencies to unravel the circumstances surrounding the incident.\nHe said, “Some yet-to-be identified hoodlums attacked Civil Defence outpost in Nneyi, Umueri in Anambra East Local Government Area of the state, shooting indiscriminately.\nAt the end of the melee, two officers of the corps that sustained gunshot injury from the incident lost their lives.\n“The State Commandant, David Bille, has activated all apparatus in conjunction with sister security agencies to unravel the circumstances surrounding the ugly incident.”"
  },
  {
    "headline": "Attahiru died when Nigerians are enjoying renewed confidence in army — Governors",
    "summarized_story": "According to the Governors, the tragic and shocking incident took place also during the period the soldiers themselves are showing appreciation for their leaderships’ encouraging impetus in boosting their morale on the battlefields.\nAccording to Fayemi, the NGF received with deep shock and utter disbelief the death of Lt Gen. Ibrahim Attahiru, in a plane crash at the Kaduna International Airport on Friday evening.\n“Already, all well-meaning Nigerians are enjoying a renewed confidence in the army, while the soldiers themselves are showing appreciation for their leaderships’ encouraging impetus in boosting their morale on the battlefields.\nThey were worthy and dedicated soldiers who devotedly fought for our country on the battlefield.\n“As Governors, we will miss the gallant soldiers."
  },
  {
    "headline": "Hammer dangles over four policemen in Ekiti for assault, harassment",
    "summarized_story": "Kindly Share This Story:By Rotimi Ojomoyela, Ado-EkitiThe Ekiti State Police Command on Saturday said it has discovered the identity of all the policemen involved in the Wednesday assault and harassment of teachers at the Mary Immaculate Secondary School in Ado EkitiFour armed policemen led by one Agnoise Elijah had on Wednesday stormed the School where they allegedly harassed and assaulted the Principal and teachers.\nIt was gathered that the policemen’s action was informed by the disciplined meted to the daughter Agnoise Elijah for improper conduct against the rules of the school.\nThe daughter, a JSS 1 student, Miss Agnoise Gift Omeizie reportedly came to school in a weird haircut which was against the school rule.\nThe ASUSS Chairman commended the state Government through the Ministry of Education and Teaching Service Commission for rising to the occasion.\nComrade Adigun explained that the Union was working with the state Ministry of Education and the Teaching Service Commission on measures to curb incessant harassment of teachers."
  },
  {
    "headline": "Okowa mourns COAS, Gen Attahiru",
    "summarized_story": "He recalled that the late Attahiru, who died in a plane crash along with 10 other officers on Friday in Kaduna, was appointed the 25th COAS about four months ago, precisely Jan. 26, 2021.\nOkowa said that the news of the incident was devastating, especially as the nation was in dire need of his services at this critical time of intense fight to win the war against insurgency and banditry.\nHe said that the deceased had a rich military career, and had held several command positions with distinction, including Theatre Commander, “Operation Lafia Dole’’, an experience the nation hoped to gain from as Army Chief.\nAttahiru had an illustrious military career and served the nation with full dedication and died on active duty.\nKindly Share This Story:"
  },
  {
    "headline": "Attahiru: Reps’ minority caucus calls for probe of recent military plane crashes",
    "summarized_story": "The Caucus called for an investigation into the immediate military plane crash and the two recent ones to ascertain their causes.\nHe said the Nigerian military, especially the Nigeria Army, has lost a dedicated and committed senior officer whose services to fatherland will be sorely missed.\nThe Speaker in a statement by his media aide, Lanre Lasisi sent his condolences to President Muhammadu Buhari, the Nigerian military, and the Attahiru family over the loss.\nOn Friday “The Nigerian Army had confirmed the passing away of its Chief of Army Staff, Lt Gen Ibrahim Attahiru.\nHe said the Nigerian military has lost a dedicated and gallant officer whose service to fatherland will be sorely missed."
  },
  {
    "headline": "Kaduna crash: Bodies of dead Christian military officers arrive Protestant Church",
    "summarized_story": "The remains of the officers who died in the Air crash together with the Chief of Army Staff, Lt Gen Ibrahim Attahiru have arrived at the Protestant Church, Air Force Base, Abuja.\nA burial service has already commended for five of them at the Church.\nDAILY POST reported on Friday that Lt General Ibrahim Attahiru died in an air crash at about 6:00p.m.\nA military Beachcraft 350 carrying him went down at the Kaduna International Airport on Friday, claiming all passengers.\nThe top military officer, alongside his senior aides and other senior army officers, were in Kaduna on an official trip."
  },
  {
    "headline": "Attahiru: Learn from Army chief's death",
    "summarized_story": "Biafra Nations League, BNL, has described the death of the Chief of Army Staff, Lt. Gen. Ibrahim Attahiru as a lesson to President Mohammadu Buhari, the Inspector General of Police and all Service Chiefs.\nAs DAILY POST had earlier reported, Lt. General Ibrahim Attahiru died in an air crash at about 6:00p.m.\nA military Beechcraft 350 carrying him went down at the Kaduna International Airport on Friday, claiming all passengers, including the Army chief’s aides.\nThe group said that “the President and Governors, including all Service Chiefs are human beings who, when they die, would be buried like commoners.\nThey warned of more plane crashes ahead , adding that the more the government tries to kill it’s people the more they die in plane crashes."
  },
  {
    "headline": "Attahiru: NASS told to probe military plane crashes",
    "summarized_story": "Godwin Obaseki of Edo State, says the National Assembly should probe the causes of recent military plane crashes in the country.\nHe noted that Friday’s military plane crash was the third this year, with a total of 20 lives lost so far.\n“Recall that the Vice President of the country some time ago, was involved in a plane crash, but luckily he survived it.\nThere should be a public probe by the national assembly to find out what is really happening.\n” It’s a dereliction of duty for Nigerians not to know the cause or causes of the recent increasing military plane crashes."
  },
  {
    "headline": "Attahiru: Nigeria has lost a brilliant officer – Akeredolu reacts to COAS’ death",
    "summarized_story": "Governor Oluwarotimi Akeredolu of Ondo State has described the late Chief of Army Staff, General Ibrahim Attahiru, who died in a plane crash alongside other officers, as a General who within a short period he served, gave his best.\nAkeredolu, who expressed shock at the news of the death of the Chief of Army Staff, said the nation lost a brilliant officer.\nAccording to the Governor, the late General displayed vigour and total commitment to the security of the nation, adding that he died serving his fatherland with a dexterous passion.\n“While commiserating with President Muhammadu Buhari, Governor Akeredolu also joins the military in mourning the death of the highly decorated officers.\n“He prays for the repose of his soul and for God’s comfort for the families of the departed souls.”"
  },
  {
    "headline": "Shehu Sani blasts Nigerians celebrating Attahiru’s death",
    "summarized_story": "Senator Shehu Sani, who represented Kaduna Central in the 8th National Assembly, has slammed some Nigerians celebrating the death of the Chief Of Army Staff, Lieutenant General Ibrahim Attahiru, who died alongside other top military officers in an air crash on Friday.\nDAILY POST had reported that the army chief and other top military officers died on Friday evening when a military Beachcraft 350 conveying them crashed at the Kaduna International Airport.\nWhile Nigerians mourn the officers, Shehu Sani on his official Facebook page on Saturday alleged that some Nigerians are rejoicing over the ugly incident.\nHe lamented how some elements would celebrate the death of other persons stressing that such people are evil.\nWhy have we become so evil in life and death”?"
  },
  {
    "headline": "Chief of Army Staff, wife, others die in military plane crash",
    "summarized_story": "The Chief of Army Staff, Lieutenant General Ibrahim Attahiru and his wife, Fati, have died in a plane crash involving a Nigerian Air Force aircraft.\nThe couple and six other military officers died near Kaduna airport where the Chief of Army Staff was billed to commission a project in one of the military formations in Kaduna State.\nHe said there was an air crash involving a Nigerian Air Force plane but did not reveal identities of those on board.\nHowever, it was gathered the Chief of Army Staff Lt Gen Ibrahim Attahiru was on board the aircraft with his wife and some other senior military officers.\nBefore his appointment as the Chief of Army Staff, he was the General Officer Commanding 82 Division of the Nigerian Army, Enugu."
  },
  {
    "headline": "VIDEO: Military aircraft crashes in Kaduna airport",
    "summarized_story": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator."
  },
  {
    "headline": "BREAKING: 12 die as Military plane crashes in Kaduna airport",
    "summarized_story": "A military plane suspected to be that of the Nigerian Air Force (NAF) has crashed around the Kaduna International Airport.\nThe plane, which crashed around 6pm on Friday, according to a source, exploded and got burnt completely.\nA competent source from the Airport told The Nation all the crew members and passengers numbering 12 died in the crash.\nThough, there has not been any official statement from the Armed Forces, eyewitnesses suspected the crew lost control of the aircraft due to sudden change of weather before the evening rain in KadunaDetails shortly…"
  },
  {
    "headline": "BREAKING: Chief of Army Staff, Lt Gen Attahiru, dies in plane crash",
    "summarized_story": "The Chief of Army Staff, Lt General Ibrahim Attahiru, has died in an plane crash with some of his aides.\nMilitary source said Gen. Attahiru was on a trip to Kaduna.\nEfforts were on to locate the wreckage of the plane and evacuate remains of the victims.\nHis mission to Kaduna was said to be “official.”Details shortly…"
  },
  {
    "headline": "How I was raped by a music Producer at 19 - Lady Gaga",
    "summarized_story": "Stefani Germanotta, the US singer better known as Lady Gaga, has revealed that she had a “total psychotic break” after a sexual assault at 19 left her pregnant.\nBut in the latest docuseries, Gaga revealed that she was sexually assaulted by a music producer who threatened to burn her music if she didn’t take off her clothes at the time.\n“I was 19 years old, and I was working in the business, and a producer said to me, ‘Take your clothes off,” she said.\nThe way that I feel when I feel pain was how I felt after I was raped.\nThe music star added that after years of grappling with the experience, she had “learned all the ways to pull myself out of it."
  },
  {
    "headline": "Miyetti Allah leader to Fulani herders: Don’t obey open grazing ban",
    "summarized_story": "How will Fulani herdsmen cope with the ban on open grazing declared by the Southern governors?\nAnywhere you go now, you see Fulani grazing cows and you will think they belong to them.\nNo state can progress without Fulani being in that state; any state without Fulani is backward and poor.\nFulani don’t have borders or boundaries; they don’t need permission to graze their cows from one area to another area.\nThe Fulani don’t have borders."
  },
  {
    "headline": "Agitators for Biafra, Yoruba Nation are illiterates -Ex Presidential Aspirant, Olawepo-Hashim",
    "summarized_story": "Oil mogul and former presidential candidate in 2019, Gbenga Olawepo-Hashim has dismissed those agitating for secession in the country.\nThat is the solution, not secession and I have not seen an African country that achieved secession that has been better off.\nEven in countries of Africa that were one party states, the party was strong.\nThey brought armoured tanks to the party secretariat because they wanted to get some people out of the party forcefully.\nAnd we can write our lawmakers now, to amend the sub-sections of the constitution and get concurrence from the states."
  },
  {
    "headline": "Creating time for marriage, my greatest challenge –Ebere Nwizu",
    "summarized_story": "Eberechukwu Nwizu, who wormed her way into the hearts of movie lovers after winning the Amstel Malta Box Office reality show season 3, is not giving up on marriage despite having a child out of wedlock.\nHowever, I welcome marriage.\nThe Lagos State University graduate of Philosophy also commended the rate at which female filmmakers are taking over the industry, churning out international standard movies.\n“Female filmmakers in Nigeria are expressing their God-given talent and skills at the top level, and creating their niche.\nFor me, it’s a case of doing what you know how to do well, and the rest will fall into place naturally."
  },
  {
    "headline": "Buhari shocked over Attahiru, others’ death",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has expressed sadness and shock over the air crash that claimed the Chief of Army Staff, Lt. Gen. Ibrahim Attahiru, and other military officers.\nHe said the crash “is one mortal blow to our underbelly, at a time our armed forces are poised to end the security challenges facing the country.”According to a statement by Special Adviser to the President on Media and Publicity, Femi Adesina, Buhari described them as “heroes who paid the ultimate price for peace and security in the land.”He condoled with families of the deceased, the military, and Nigerians in general and prayed that God receives the souls of the patriots.\nPresident Buhari pledged that the departed would not die in vain."
  },
  {
    "headline": "Confusion in Military as Army Chief, 10 others die in plane crash",
    "summarized_story": "Molly Kilete AbujaConfusion enguled the military yesterday about the whereabouts of the Chief of Army Staff (COAS), Lieutenant General Ibrahim Attahiru, who reportedly died in a plane crash involving a Nigeria Air Force place.\nGen Attahiru, with his ADC, Army PRO and other officers were said to be aboard the air force plane, which crashed in Kaduna while trying to take off.\nThe Nigerian Air Force had announced the crash of one its aircraft in Kaduna, but did not give details.\nA tweet by Air Commodore Edward Gabkwet, Director of Public Relations and Information, said: “An air crash involving a @NigAirForce aircraft occurred this evening near the Kaduna International Airport.\nOfficers that travelled with the deceased included: Maj. Gen Abdulkadir, Maj. Gen Olayinka Provost Marshal, Brig Gen Kuliya, Maj L. A Hayat, Maj Hamza and Sgt Umar."
  },
  {
    "headline": "Late Army Chief, Attahiru, Others for Burial Today",
    "summarized_story": "By Kingsley NwezehThe Nigerian Army Headquarters has released the burial programme for the late Chief of Army Staff, Lt. General Ibrahim Attahiru and other senior officers, who died in a plane crash in Kaduna Friday evening.\nOther senior officers, who died in the crash include Brig Gen MI Abdulkadir, Brig Gen Olayinka, Brigadier-General Kuliya, ADC to the late COAS, Major LA Hayat, Major Hamza and Sergeant Umar.\nA statement signed by the Director, Army Public Relations, Brigadier-General Mohammed Yerima, said the burial of the fallen officers would take place at the National Cemetery, Abuja.\n“The burial proceedings of the Chief of Army Staff (COAS), Late Lieutenant General Ibrahim Attahiru and six other senior officers who lost their lives in an air mishap in Kaduna is slated for today Saturday, 22 May 21.\n“Consequently, the interment for the late COAS and 6 other senior officers will take place at the National Military Cemetery, Abuja today by 1300hrs”, it said."
  },
  {
    "headline": "Nigeria’s 21st Army Chief, 10 Others Die in Air Crash",
    "summarized_story": "Meanwhile, President Muhammadu Buhari has expressed deep sadness over the air crash, saying the military officers would not die in vain.\nAttahiru, a Gallant SoldierAttahiru was named as the nation’s Chief of Army Staff on January 26 this year alongside other service chiefs.\nHe was a graduate of the Nigerian Defence Academy, Armed Forces Command and Staff College, Jaji, and Nigerian Army School of Infantry.\nAlso, he had the unique privilege of having commanded with distinction all through the chain of command in the Nigerian Army.\nProminent among these appointments is Commanding Officer 146 Battalion Nigerian Army (Operation Harmony IV) in the Bakassi Peninsula, Commander 13 Brigade Nigerian Army (Operation Pulo Shield), General Officer Commanding 82 Division Nigerian Army."
  },
  {
    "headline": "FG Rejects Govs’ Advice, Says No to Fuel Price Increase",
    "summarized_story": "Peter UzohoThe federal government yesterday rejected recommendation by the Nigeria Governors Forum for an increase in the price of petrol, saying despite the huge under-recovery otherwise known as subsidy paid on the product, the current price of between N162 per litre and N165 per litre would remain.\nThe Nigeria Governors’ Forum (NGF) had last Wednesday recommended a petrol price of between N408.5/litre and N380/litre, and also called for immediate removal of petrol subsidy.\nThe NGF’s advice was based on the report of its committee headed by the Kaduna State Governor, Mallam Nasir el-Rufai, that full deregulation of petrol should be entrenched.\nThe minister said the current price would be retained until the ongoing negotiation with the organised labour was concluded.\n“The current price of petrol will be retained in the month of June until the ongoing engagement with organised labour is concluded."
  },
  {
    "headline": "Defence Headquarters Orders Probe into Air Crash",
    "summarized_story": "*Condoles with families of officers, restates commitment to war against insurgencyKingsley Nwezeh in AbujaThe Defence Headquarters (DHQ) Friday night ordered a probe into the circumstances sorrounding the air crash that killed the Chief of Army Staff, Lt. General Ibrahim Attahiru and 10 officers and crew members.\nA statement issued by the Director, Defence Information (DDI), Brigadier-General Onyema Nwachukwu, said the Chief of Defence Staff, General Lucky Irabor, ordered the constitution of an accident investigation board to probe the air mishap.\n“The Chief of Defence Staff, (CDS) General Lucky Irabor, has therefore directed that an Accident Investigation Board be constituted to unravel the immediate and remote cause(s) of the unfortunate accident”, he said.\nThe Chief of Defence Staff (CDS) General Lucky Irabor has therefore directed that an Accident Investigation Board be constituted to unravel the immediate and remote cause(s) of the unfortunate accident”.\nWe wish to state that the Armed Forces of Nigeria remains resolute in combatting the security challenges bedeviling our nation."
  },
  {
    "headline": "News in Photographs: Defence Minister, CDS Brief Buhari on Air Crash that Claimed Army Chief, 10 Others",
    "summarized_story": "Minister of Defence, Major General Bashir Magashi (rrd), Chief of Defence Staff, General LEO Irabor, and Chief of Air Staff, Air Marshall Oladayo Amao, were at the State House Friday night to brief President Muhammadu Buhari on the plane crash that claimed the Chief of Army Staff, Lt Gen Ibrahim Attahiru, and 10 other military officers and crew members.\nGen Attahiru and some military officers died in the plane that crashed near Kaduna Airport on Friday evening.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "REVEALED: Identities Of Officers, 4 Crew Members Killed Along With Chief Of Army Staff In Plane Crash",
    "summarized_story": "Seven officers including the Chief of the Army Staff, Lt Gen Ibrahim Attahiru, along with four crew members were killed in Friday's military plane crash, SaharaReporters has learnt.\nMAJ LA HAYATThe crew members were: FLT LT TO ASANIYI; FLT LT AA OLUFADE; SGT ADESINA; ACM OYEDEPO.\nSee Also Military Nigeria's Chief Of Army Staff, Attahiru Dies In Plane CrashThe Nigerian Air Force has said it has begun an investigation into the cause of the crash of its NAF aircraft in which the Chief of the Army Staff, Lt Gen Ibrahim Attahiru, his aides and others were travelling and killed on Friday.\nHe said, \"An air crash involving a @NigAirForce aircraft occurred this evening near the Kaduna International Airport.\nSee Also Military Nigerian Air Force Investigates Plane Crash Which Killed Chief of Army Staff, 11 Others"
  },
  {
    "headline": "REVEALED: Identities Of Officers, 4 Crew Members Killed Along With Chief Of Army Staff In Plane Crash",
    "summarized_story": "Seven officers including the Chief of the Army Staff, Lt Gen Ibrahim Attahiru, along with four crew members were killed in Friday's military plane crash, SaharaReporters has learnt.\nMAJ LA HAYATThe crew members were: FLT LT TO ASANIYI; FLT LT AA OLUFADE; SGT ADESINA; ACM OYEDEPO.\nSee Also Military Nigeria's Chief Of Army Staff, Attahiru Dies In Plane CrashThe Nigerian Air Force has said it has begun an investigation into the cause of the crash of its NAF aircraft in which the Chief of the Army Staff, Lt Gen Ibrahim Attahiru, his aides and others were travelling and killed on Friday.\nHe said, \"An air crash involving a @NigAirForce aircraft occurred this evening near the Kaduna International Airport.\nSee Also Military Nigerian Air Force Investigates Plane Crash Which Killed Chief of Army Staff, 11 Others"
  },
  {
    "headline": "Nigeria's Chief Of Army Staff, Attahiru Dies In Plane Crash",
    "summarized_story": "General Ibrahim Attahiru, the Chief of Army Staff, has died in a plane crash.\nIbrahim AttahiruBREAKING: Nigeria's Chief of Army Staff, Attahiru and 11 others die in Plane crash in Kaduna — Sahara Reporters (@SaharaReporters) May 21, 2021The Chief of Army Staff (COAS) is the highest ranking military officer of the Nigerian Army.\nThe position is often occupied by the most senior commissioned officer appointed by the President of Nigeria.\nGeneral Attahiru was redeployed to Nigerian Army Headquarters as Deputy Chief of Policy and Plans.\nHe was former General Officer Commanding, 82 Division of the Nigerian Army, Enugu."
  },
  {
    "headline": "Nigeria's Chief Of Army Staff, Attahiru Dies In Plane Crash",
    "summarized_story": "General Ibrahim Attahiru, the Chief of Army Staff, has died in a plane crash.\nIbrahim AttahiruBREAKING: Nigeria's Chief of Army Staff, Attahiru and 11 others die in Plane crash in Kaduna — Sahara Reporters (@SaharaReporters) May 21, 2021The Chief of Army Staff (COAS) is the highest ranking military officer of the Nigerian Army.\nThe position is often occupied by the most senior commissioned officer appointed by the President of Nigeria.\nGeneral Attahiru was redeployed to Nigerian Army Headquarters as Deputy Chief of Policy and Plans.\nHe was former General Officer Commanding, 82 Division of the Nigerian Army, Enugu."
  },
  {
    "headline": "Protesters Storm Akure, Demand Yoruba Nation",
    "summarized_story": "Again, agitators for the independence of the Yoruba nation stormed Akure, the Ondo State Capital, on Saturday.\nIn a video that has now gone viral, the protesters gathered at Isinkan Roundabout, Akure, calling for self-determination.\nOne of the agitators, who identified himself as Tosin, said, \"We know why we call for Oduduwa Nation.\nThe independence of the Oduduwa Nation will be actualized because we are all in support of this move.\"\nA week ago, SaharaReporters reported that several Yoruba youths, under the aegis of Omo Oduduwa United, stormed the streets of Osogbo, Osun State, to agitate for the Yoruba nation despite threats by security operatives."
  },
  {
    "headline": "Remains of Attahiru, other officers arrive in Abuja",
    "summarized_story": "The remains of Ibrahim Attahiru, the late chief of army staff, and other officers who died in a plane crash on Friday have arrived in Abuja from Kaduna.\nAttahiru and 10 other military officers were on board a Beechcraft 350 aircraft that crashed near Kaduna International Airport on Friday.\nMohammed Yerima, army spokesman, had announced that burial proceedings for the officers would take place later on Saturday.\nIt will commence at the National Mosque and National Christian Centre, Abuja by 1000hrs respectively,” he said.\n“Consequently, the interment for the late COAS and 6 other senior officers will take place at the National Military Cemetery, Abuja today by 1300hrs.”PHOTO: Channels TV"
  },
  {
    "headline": "Remains of Attahiru, other officers arrive in Abuja",
    "summarized_story": "The remains of Ibrahim Attahiru, the late chief of army staff, and other officers who died in a plane crash on Friday have arrived in Abuja from Kaduna.\nAttahiru and 10 other military officers were on board a Beechcraft 350 aircraft that crashed near Kaduna International Airport on Friday.\nMohammed Yerima, army spokesman, had announced that burial proceedings for the officers would take place later on Saturday.\nIt will commence at the National Mosque and National Christian Centre, Abuja by 1000hrs respectively,” he said.\n“Consequently, the interment for the late COAS and 6 other senior officers will take place at the National Military Cemetery, Abuja today by 1300hrs.”PHOTO: Channels TV"
  },
  {
    "headline": "OBITUARY: Attahiru, the eloquent and gallant army chief who died just four months in office",
    "summarized_story": "Upon his appointment as army chief in January, he continued to visit troops at the frontline every month before his death.\nGiving a 48-hour ultimatum, the army chief also assured the troops of improved equipment in getting the task done.\nBuratai, the immediate past army chief, had given Attahiru a 40-day ultimatum to capture Shekau.\nHe was commissioned as an infantry officer in the rank of a second-lieutenant with the Nigerian Army in December 1986.\nAttahiru who is the 21st chief of army staff will, in the recent time, be the shortest serving chief."
  },
  {
    "headline": "OBITUARY: Attahiru, the eloquent and gallant army chief who died just four months in office",
    "summarized_story": "Upon his appointment as army chief in January, he continued to visit troops at the frontline every month before his death.\nGiving a 48-hour ultimatum, the army chief also assured the troops of improved equipment in getting the task done.\nBuratai, the immediate past army chief, had given Attahiru a 40-day ultimatum to capture Shekau.\nHe was commissioned as an infantry officer in the rank of a second-lieutenant with the Nigerian Army in December 1986.\nAttahiru who is the 21st chief of army staff will, in the recent time, be the shortest serving chief."
  },
  {
    "headline": "How Asaniyi, soon-to-wed pilot, died in Kaduna crash",
    "summarized_story": "Rest well Flt LT TO Asaniyi.\nRest well Flt LT TO Asaniyi.\n“Flight lieutenant Asaniyi T.O, he flew the plane.\nFLT LT Asaniyi,” he wrote in a terse post accompanying the video.\nFLT LT Asaniyi 💔💔😭😭 pic.twitter.com/hQ2x4NBoRW — Daddy G.O (God’s Ordained) (@_victor_kings) May 22, 2021AdvertisementTheCable had earlier reported how Alfred Ayodeji Olufade, another flight lieutenant who got married in February, also died in the crash."
  },
  {
    "headline": "NCC plans to deploy Device Management System to prevent phone theft",
    "summarized_story": "Two weeks after the Nigerian Communications Commission (NCC) said it had issued 54 million people their national identity numbers, it is in the process of deploying a Device Management System (DMS).\nA Device Management System will take this step even further, allowing the government even more access to what should be private information.\nWhen there’s a central registry for IMEI, the police could identify the owners of lost and stolen phones thousands of times daily.\nA critical part of this paper argues for a central database of mobile phones that law enforcement agencies presumably can access.\n*An earlier version of this report stated that the NCC asked telcos to register the IMEI numbers of their subscribers; the NCC has now clarified its position"
  },
  {
    "headline": "How to build high-performance teams with Chichi Offodile and Seni Sulyman",
    "summarized_story": "In what can be termed a mini-MBA session, Seni Sulyman and Chichi Offodile in an edition of TechCabal Live shared expert advice on how to build high-performance teams.\nTheir Journey at Helium Health and AndelaThe conversation begins with Chichi and Seni talking about their journeys at Helium Health and Andela respectively.\nHer strength lies in figuring out how to build a sustainable company and that’s what she set out to do via a transformation plan.\nBoth Seni and Chichi believe that it starts with hiring people with the potential to be high achievers and then setting a good example as a leader.\nHe ends with a caveat – it’s a little difficult to build a high-performing team without working really hard."
  },
  {
    "headline": "Stax wants you to enjoy USSD with better design, without ever dialling codes again",
    "summarized_story": "—Most people who started using mobile phones in the 2000s became familiar with USSD through loading and checking airtime balance.\nMaking USSD smartStax is a mobile app currently available only to Android users in 10 countries, including Nigeria, Uganda, Kenya and Tanzania.\nWhen a user gives Stax access, the app activates a screen reading functionality and acts as a web browser.\nStax wants the app to be under 10MB so that it will work easily on every (Android) phone.\nWith a large user base, Stax could begin enabling discovery and access to third party services, in what could make Stax a super app of sorts."
  },
  {
    "headline": "Are you ready to Branch in?",
    "summarized_story": "Here are a few more things that sets Branch apart from both your regular banking and other financial apps.\nBonus programs: Most financial apps have some form of bonus program but none of them is like Branch.\nWhereas other financial apps pay one-time bonuses for referrals, Branch pays you N500 when friends you refer pay up their first loan.\nThe money part: Branch gives you up to N500,000 in loans within seconds of applying on the app.\nClearly, Branch offers you more flexibility and a lot more profit than other financial apps."
  },
  {
    "headline": "Founders of TradeDepot selected as Endeavor Entrepreneurs",
    "summarized_story": "Fast-growing retail distribution platform in Africa joins the leading global entrepreneur support organizationLagos, May 20 — Endeavor Nigeria has welcomed three new entrepreneurs into its global network.\nOnyekachi Izukanne, Michael Ukpong, and Ruke Awaritefe, the co-founders of TradeDepot, were selected as Endeavor Entrepreneurs on May 18, 2021, at the 15th Virtual International Selection Panel (v-ISP #15).\nThe Endeavor network includes some of the world’s most exciting scale-up entrepreneurs and most experienced mentors and investors.\nTo date, Endeavor has screened more than 60,000 individuals and selected more than 2,000 founders leading over 1,200 scale-up companies.\nIn Nigeria, we aim to select 4-6 companies a year and today there are 19 Endeavor Entrepreneurs who are leading 11 companies in the portfolio."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "App review – How does Bitnob work?",
    "summarized_story": "At first glance, the Bitnob app feels fantastic, with a simple UI and easy-to-find functions.\nGetting started with BitnobLet’s begin with the onboarding processAdvertisementCreating a new account on BitnobSetting up your Bitnob app begins with installing it from your app store.\nTo protect its users, Bitnob doesn’t let you buy BTC straight from your bank account.\nYou simply paste their address or scan their Bitnob BTC wallet address.\nFinal thoughtsOverall, the Bitnob app delivers an impressive performance."
  },
  {
    "headline": "App review – How does Bitnob work?",
    "summarized_story": "At first glance, the Bitnob app feels fantastic, with a simple UI and easy-to-find functions.\nGetting started with BitnobLet’s begin with the onboarding processAdvertisementCreating a new account on BitnobSetting up your Bitnob app begins with installing it from your app store.\nTo protect its users, Bitnob doesn’t let you buy BTC straight from your bank account.\nYou simply paste their address or scan their Bitnob BTC wallet address.\nFinal thoughtsOverall, the Bitnob app delivers an impressive performance."
  },
  {
    "headline": "Does the Nigerian government want safety or surveillance with its new IMEI policy?",
    "summarized_story": "From July 2021, the Nigerian Communications Commission (NCC) will require Nigerians to submit their IMEI numbers to a Centralised Equipment Identity Register.\nThe International Mobile Equipment Identity (IMEI) is a unique number used to identify a mobile phone.\nWith an IMEI number, a phone can be tracked, but more than that, it can also be used for identity theft and even cloning a phone.\nAdvertisementIf a phone owner possesses their IMEI number, they could provide law enforcement agencies with this information to track these phones if they are stolen.\nAdding IMEI data to this would mean that they can also get real-time location data on anyone."
  },
  {
    "headline": "News",
    "summarized_story": "The past few days have seen the value of cryptocurrencies take a massive dip, which is said to have stemmed from Elon Musk’s tweet.\nWhile this is not the worst crash the market has witnessed, how shou…"
  },
  {
    "headline": "Naira closes the week lowest since March as turnover declines 19.55%",
    "summarized_story": "Naira closes the week lowest since March as turnover declines 19.55%The foreign exchange trading week ended on Friday with the Naira depreciating by 0.12 percent against the dollar at the official market, the lowest since March 2021 due to low liquidity.\nRead Also: Naira gains as dollar market turnover rises by 122.75% Naira closed at N412.00k per dollar on Friday, the same rate quoted on March…"
  },
  {
    "headline": "Weakest link in cybersecurity chain is people, here’s what SMEs can do",
    "summarized_story": "Weakest link in cybersecurity chain is people, here’s what SMEs can doAt the recent Franco Nigerian Chamber of Commerce and Industry (FNCCI) virtual conference on cybersecurity and process automation in today’s business environment, experts reveal how small businesses can protect themselves against cybersecurity threats within and outside the business writes ISAAC ANYAOGU.\nWhat is even more disconcerting is that experts say that 95 percent of security threats are not reported.\nThis is why taking control of the human element which constitutes the weakest link in the security chain is vital, analysts at the virtual conference said.\nMany companies, even if they have smart cybersecurity systems are still susceptible to attacks due to third-party compromise.\nDevelop a strategyIn many organisations, cybersecurity threats are issues considered at the board level highlighting how important it has become to the well being of a business."
  },
  {
    "headline": "Economy still awaits FG’s 300,000-unit housing intervention 12months after",
    "summarized_story": "The Nigerian economy, which is in dire straits at the moment, is still waiting for the federal government with its intervention in the housing sector as provided for in the economic sustainability plan (ESP) more than 12 months after that plan was inaugurated.\nHousing was listed among growth sectors and the strategy was to provide 300,000 housing units yearly.\nThe strategy envisaged the creation of 1.8 million jobs, starting in 12 months and subsequently creating 1.5 million homes for families across the country.\nAbout 82.9 million Nigerians were in poverty before COVID-19, according to the World Bank.\nAmong other things, the ESP strategy aims at easing bottlenecks in the delivery of social housing and delivering affordable homes through direct government interventions in housing construction."
  },
  {
    "headline": "Expert Tasks Journalists On Relaxation And Water Therapy As Tools For Managing Stress – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – Dr. Uzo Israel ,a consultant clinical psychologist has advocated what she termed “Relaxation And Water Therapy” as the most effective ways of managing stress especially in a pandemic.\nSpeaking during a one day webinar on the topic “Managing Stress , Trauma And Other Psychological /Mental Health Challenges In The Coverage Of Pandemics And Crisis Situations” , Dr. Israel said, both water and relaxation therapies were cheap and without any side effects.\nShe said, the Covid 19 pandemic , especially the lockdown period saw an increase rate in metabolic diseases rather than the infectious disease itself.\nArogundade said,“This workshop is expected to enhance capacity to manage difficult safety challenges while carrying out our work.\nParticipating journalists are expected to be able to practice with increased confidence and manage dangerous situations ."
  },
  {
    "headline": "Obaseki mourns passing of COAS, Lt. Gen. Attahiru – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has mourned the passing of Nigeria’s Chief of Army Staff, Lt. Gen. Ibrahim Attahiru.\nIn a statement, Obaseki expressed shock and sadness over the unfortunate incident, praying that God will grant the repose of their souls.\n“We pray for the repose of the souls of those who lost their lives in the unfortunate incident and admonish the military to continue with the patriotic efforts to secure the country,” he said.\nGen. Attahiru served Nigeria meritoriously, bringing his skill, experience and expertise to bear in prosecuting the war against terror.\n“He will always be remembered for his gallantry, commitment to service and dedication to our fatherland,” Obaseki added."
  },
  {
    "headline": "NAF aircraft crashes with top officers onboard – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – A Nigerian Air Force (NAF) aircraft conveying some top military officers has crashed near Kaduna, NAF Twitter handle @NigAirForce, has confirmed.\nChief of Army Staff, Lt.-Gen. Ibrahim Attahiru, is feared dead in the crash on Friday, unconfirmed reports said.\nA tweet by the Nigerian Air Force confirmed that air crash, involving a @NigAirForce aircraft, occurred t?near the Kaduna International Airport.\nThe Air Force spokesperson, Air Commodore Edward Gabkwet, in the tweet, said that the immediate cause of the crash was still being ascertained.\nHowever, effort to get confirmation from Nigerian Army has been unsuccessful as the spokesperson, Brig.-Gen. Mohammed Yerima, did not respond to calls."
  },
  {
    "headline": "Edo First Lady tasks parents, teachers to support govt efforts in checking drug abuse – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo First Lady, Mrs. Besty Obaseki, has urged parents and teachers to monitor the activities of students, as part of efforts to check drug abuse among school children.\nTherefore, parents, teachers and guardians need to monitor their wards closely and show them love.\nTake your studies seriously so that you can become great men and women in our society in future,” Mrs. Obaseki added.\nThe consequences are too grave for your mental health.”The governor’s wife commended members of Edo State Drug Control Committee for their efforts and urged them not to relent in taking the message to all the nooks and crannies of the state and to all schools.\nHe added that the state Drug Control Committee was set up in 2019, to sensitize the youths and the public against drug abuse and the dangers of drug abuse and its potential to destroy their lives."
  },
  {
    "headline": "LIVE UPDATES: Nigerian Army buries COAS, Attahiru, six others in Abuja",
    "summarized_story": "The Nigerian Army has arranged the burial proceedings of the late Chief of Army Staff, Ibrahim Attahiru, and six other senior officers for 10 a.m. on Saturday.\nBefore his appointment, the late army major, was the General Officer Commanding 82 Division of the Nigerian Army, Enugu.\nWife of the late Army Chief, Fatima Attahiru arriving the National mosque, venue of the funeral prayer.\nShe is flanked by friends and relatives Wife of the late Army Chief, Fatima Attahiru arriving the National mosque, venue of the funeral prayer.\nCaskets of five of the late Nigerian Army officers laid on the altar."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Buhari govt’s rising hostility against Southeast a matter of great concern – Afenifere",
    "summarized_story": "He went ahead to threaten police officers who fail to carry out his orders and gets killed in the process.\n“The rising hostility against the South-East Zone since the beginning of the Buhari administration has now become a matter of great concern to Afenifere, as this reality should also become a major concern to other stakeholders in the Nigerian project,” Adebanjo said in a statement on Thursday.\nHe urged other leaders in the zones to condemn the shoot-on-sight order to prevent another looming massacre in the South-East zone, saying: “To prevent yet another looming massacre in the South-East Zone, leaders in other zones should condemn the shoot-on-sight order.\nThe President must be told that if he is sincere about peace and unity of this country, the order should be revoked forthwith.\nCertainly, if the President has no hidden agenda, there are more civilised and democratic ways to beef up security in the South-East.”"
  },
  {
    "headline": "FG, states, LGAs share N616bn in May as FAAC disbursement drops by N63bn",
    "summarized_story": "Nigeria’s three tiers of government shared a total of N616.886 billion received from the federation accounts allocation committee (FAAC) being revenue from April as allocation for May.\nIn March, gross statutory revenue was N466.687 billion, value added tax revenue was N181.712 billion and exchange gain was N2.931 billion.\nAccording to the statement, gross statutory revenue fell to N429.733 billion in April.\nRevenue from the value added tax also reduced to N164.340 billion while revenue from the exchange gain dipped to N2.250 billion.\nFor non-oil revenue, the federal government received N10.536 billion, the state government got N5.344 billion and the local governments was allocated N4.120 billion."
  },
  {
    "headline": "Late Army Chief, six others for burial in Abuja at 1pm today",
    "summarized_story": "Burial of the late Chief of Army Staff, late Lt. Gen. Ibrahim Attahiru as well as six other senior military officers who died in the Beachcraft 350 aircraft that crashed at the Kaduna International Airport on Friday holds today in Abuja.\nAccording to an invitation released by the Director, Army Public Relations, Brigadier General Mohammed Yerima, they will be buried at the National Military Cemetery in Abuja.\nAccording to the invite, the burial will be preceded by prayers that will hold simultaneously at the National Mosque and National Christian Centre, Abuja.\n“It will commence at the National Mosque and National Christian Centre, Abuja by 1000hrs respectively.\n“Consequently, the internment for the late COAS and six other senior officers will take place at the National Military Cemetery, Abuja today by 1300hrs.”"
  },
  {
    "headline": "Nigerian Military confirms death of its Chief of Army Staff, Attahiru, 10 officers in air crash",
    "summarized_story": "OBINNA EZUGWUThe Nigerian Army has confirmed the passing away of its Chief of Army Staff, Lieutenant General Ibrahim Attahiru, and ten senior officers who died on Friday in a military Plane Crash in Kaduna State.\nMeanwhile, former vice president, Alhaji Atiku Abubakar has described the death as a dark day for the nation.\nThe loss of COAS Major Gen. Ibrahim Attahiru and others today sends a rude shock across Nigeria and our friends worldwide,” he said.\n“I sympathise with the Commander-in-Chief and our armed forces on this sad development.\nMay the Attahiru family and other affected families be comforted, and their memories be a blessing.”"
  },
  {
    "headline": "Plane Crash: Navy Cancels 65th Anniversary Activities",
    "summarized_story": "The Nigerian Navy has announced the cancellation of its 65th anniversary programmes in honour of the late Chief of Army Staff, Lt Gen Ibrahim Attahiru.\nLEADERSHIP reports that General Attahiru died on Friday May 21, 2021 in a NAF plane crash in Kaduna State while on official assignment.\nThe director of Information, Naval Headquarters, Commodore Suleman Dahun, said the Chief of Naval Staff directed the cancellation while he commiserated with the nation and families of fallen heroes.\nThe statement reads: “the Chief of the Naval Staff (CNS), Vice Admiral Awwal Gambo has directed the cancellation of the events marking the 65th Anniversary of the Nigerian Navy.\n“The CNS commiserates with the nation and offers the condolences of officers and ratings of the Nigerian Navy to Mr President, the Nigerian Army and Nigerian Air Force as well as families of the departed."
  },
  {
    "headline": "Crash: Ndume Mourns Late Gallant Soldiers, Says Army Chief Died A Hero",
    "summarized_story": "The chairman, Senate Committee on Army and Senator representing Borno South, Mohammed Ali Ndume, said he received the news of the death of Chief of Army Staff, Lt. General Ibrahim Attahiru, and 10 others, with shock.\nNdume in a statement personally signed by him on Saturday, lamented that the late gallant General died at a time when the nation was looking up to him to effectively provide the necessary leadership that would eliminate insurgency and other forms of criminality in Nigeria.\nHe described Attahiru’s death as a national tragedy, adding that the army chief died a worthy hero.\nNdume prayed Allah to grant eternal salvation for all that lost their lives in the air mishap.\n“I pray that Almighty Allah (SWT) will grant the families and the Armed Forces the strength and fortitude to bear the painful loss."
  },
  {
    "headline": "APC Govs Rule Out Zoning, Say Anyone Can Aspire For Any Office",
    "summarized_story": "In a move, which appears to have knocked out zoning of elective positions in the next political dispensation, governors of the ruling All Progressives Congress (APC) has said any qualified Nigerian can aspire for any political office.\n“The coming of Mr. Ayade into the APC further reinforces the process of membership and leadership recruitment at all levels.”It further stressed that “Given all his achievements in Cross River State, Mr. Ayade is only coming home where he belongs.\nAPC is indeed the party that will provide him and his people, and indeed all Nigerians the viable platform for political aspirations and negotiations.\n“Our party, APC, is open, transparent and will continue to guarantee fair contestation in politics, in line with the overarching commitment of President Muhammadu Buhari and all our founding leaders.\nWith the coming of Mr. Ayade, the capacity of our party to mobilise all patriots and other like-minded progressive Nigerians to join the APC is stronger.”"
  },
  {
    "headline": "FRSC, Construction Firms Partner On Road Traffic Control In Rivers",
    "summarized_story": "Following ongoing massive construction of roads and flyovers leading to several major roads in Port Harcourt, Rivers State, the Federal Road Safety Corps (FRSC) has said it was collaborating with construction companies to control road traffic in the metropolis.\nFRSC sector commander in the state, Salisu Galanducci, disclosed this in Port Harcourt on Friday while flagging off the 2021 United Nations Global Road Safety Week.\nGalanducci said: “Every May 18, the whole world mark what we call the United Nations Global Road Safety Week.\n“It was earmarked by the Office of the Secretary General of the United Nations.\nThis year’s theme, as chosen by the United Nations is ‘Street for Life’."
  },
  {
    "headline": "Summer Series Tour: Waldrum Invites Oshoala, Ajibade 23 Others To Camp",
    "summarized_story": "Nigeria’s Head Coach, Randy Waldrum has made a provisional list of 25 players for the upcoming Summer Series tour of the United States of America, where the nine-time African champions will play four-time world champions USA, Portugal and Jamaica.\nWaldrum has made it known that 23 players will make the trip to the US, meaning two players will be dropped from the provisional squad.\nWaldrum has included 10 home-based players in the provisional squad.\nTheir last match is against the USA squad, four-time winners of the FIFA World Cup and four-time winners of the Olympic football gold, at the Q2 Stadium on 16th June.\nADVERTISEMENTThe USA is the only one of the four teams in the Summer Series that will compete in the 2021 Tokyo Olympics."
  },
  {
    "headline": "House C’ttee on Airforce mourns Army Chief, others",
    "summarized_story": "By Tom OkpeThe House of Representatives Committee on Airforce has described as painful and shocking the unfortunate death of the Chief of Army staff,.\nLt Gen Ibrahim Atahiru and eleven others on board the plane crash, Friday evening enroute Kaduna.\nChairman of the Committee Shehu Koko, APC Kebbi State in a statement at the weekend said the news came to him as a shock having embarked on an official duty to Makurdi, Benue State on Thursday with the late chief of army staff.\n“This is painful and shocking, as I condole with President Muhammadu Buhari, the Military, Nigerian Army and Airforce.”The lawmaker said he is not unmindful of the Nigeria Military dedication and gallant effort to secure the country, tasking them not to relent in their fight against insurgency in Nigeria.\nThe Nigerian Army confirmed the passing away of its Chief of Army Staff, Lt Gen Ibrahim Attahiru and ten others on Friday, which occurred following an air crash enroute Kaduna from Abuja."
  },
  {
    "headline": "BREAKING: Remains of Ibrahim Attahiru, others arrive Abuja for burial",
    "summarized_story": "Corpses of the Chief of Army Staff, Lt. Gen. Ibrahim Attahiru, and others who died in a Beachcraft 350 aircraft that crashed at the Kaduna International Airport on Friday have arrived Abuja.\nThey were received at the Presidential Wing of the Nnamdi Azikwe International Airport, Abuja at about 11am.\nREAD ALSO: APC welcomes Ayade, urges other PDP Governors to follow footstepsThey were being moved to the National Mosque and the Nigerian Air Force Protestant Church venues of funeral prayers amidst tight security.\nDetails later…"
  },
  {
    "headline": "Chief Of Army Staff, 6 others to be buried today — Daily Times Nigeria",
    "summarized_story": "The Nigerian Army has announced that the Burial proceedings of the Chief of Army Staff (COAS), Late Lieutenant General Ibrahim Attahiru and 6 other senior officers who lost their lives in an air mishap in Kaduna is slated for Saturday 22 MayThe Director Army Public Relations, Brigadier General Mohammed Yerima disclosed in an invitation letter to media organizations early Saturday.\nHe said the burial proceeding will commence at the National Mosque and National Christian Centre, Abuja by 1000hrs respectively.\nREAD ALSO: APC welcomes Ayade, urges other PDP Governors to follow footstepsHe said, “Consequently, the interment for the late COAS and six other senior officers will take place at the National Military Cemetery, Abuja today by 1300hrs.”"
  },
  {
    "headline": "Updated: Chief of Army Staff, Ibrahim Attahiru, others die in plane crash —",
    "summarized_story": "“The Nigerian Army regrets to announce the passing away of its Chief of Army Staff, Lt. Gen. Ibrahim Attahiru.\nProminent among these appointments are Commanding Officer 146 Battalion Nigerian Army (Operation HARMONY IV) in the Bakassi Peninsula, Commander 13 Brigade Nigerian Army (Operation PULO SHIELD), General Officer Commanding 82 Division Nigerian Army.\nHowever, the Chief of Defence Staff, Gen. Lucky Irabor, has called for an investigation into the air crash that claimed the lives of the Chief of Army Staff, Lt. Gen. Ibrahim Attahiru and 10 others on Friday.\nMeanwhile, President Muhammadu Buhari has expressed sadness over the air crash that claimed the Chief of Army Staff, Lt. Gen. Ibrahim Attahiru, and other military officers.\nThe News Agency of Nigeria (NAN) reports that the minister was accompanied by the Chief of Defence Staff, Gen. LEO Irabor, Chief of Air Staff, Air Marshall Isiaka Amao and other senior officers."
  },
  {
    "headline": "Kaduna plane crash: Church funeral service for victims commence",
    "summarized_story": "The funeral service for the senior military officers who died in the Beachcraft 350 aircraft that crashed at the Kaduna International Airport on Friday is currently ongoing.\nThe service is holding at the Nigerian Air Force Protestant Church, Bill Clinton Drive, Airport Road Abuja.\nThe mood in the church is pensive as choristers render solemn songs just as bereaved families, friends and others arrive at the church.\nMore to follow…PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Kaduna plane crash: Church funeral service for victims commence",
    "summarized_story": "The funeral service for the senior military officers who died in the Beachcraft 350 aircraft that crashed at the Kaduna International Airport on Friday is currently ongoing.\nThe service is holding at the Nigerian Air Force Protestant Church, Bill Clinton Drive, Airport Road Abuja.\nThe mood in the church is pensive as choristers render solemn songs just as bereaved families, friends and others arrive at the church.\nMore to follow…PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Kaduna crash: How crew member shared prediction of bloody May, called for prayer",
    "summarized_story": "Kaduna crash: How crew member shared prediction of bloody May, called for prayerKaduna crash: How crew member shared prediction of bloody May, called for prayerOne of the crew members of the Beachcraft 350 aircraft that crashed at the Kaduna International Airport on Friday, Sgt Adesina Opeyemi Deeziah, died less than a month after sharing a post predicting bloody May in Nigeria and asking for prayers for the country.\nWe need to pray for Nigeria.\nWe need to pray for Nigeria,” the cleric had said.\nMeanwhile, Adesina died alongside others about three weeks after his daughter’s dedication.\nHe and his wife of three years, Adesina Gift Funke, dedicated their five-month-old daughter to God in their family church on May 2."
  },
  {
    "headline": "Kaduna crash: How crew member shared prediction of bloody May, called for prayer",
    "summarized_story": "Kaduna crash: How crew member shared prediction of bloody May, called for prayerKaduna crash: How crew member shared prediction of bloody May, called for prayerOne of the crew members of the Beachcraft 350 aircraft that crashed at the Kaduna International Airport on Friday, Sgt Adesina Opeyemi Deeziah, died less than a month after sharing a post predicting bloody May in Nigeria and asking for prayers for the country.\nWe need to pray for Nigeria.\nWe need to pray for Nigeria,” the cleric had said.\nMeanwhile, Adesina died alongside others about three weeks after his daughter’s dedication.\nHe and his wife of three years, Adesina Gift Funke, dedicated their five-month-old daughter to God in their family church on May 2."
  },
  {
    "headline": "Faces of Indianapolis shooter Brandon Scott Hole",
    "summarized_story": "By AbankulaPolice authorities in Indianapolis on Friday released the photo of Brandon Scott Hole, the 19-year-old former FedEx worker, who killed eight people Thursday night.\nThe release of his photo corrected false images of the shooter earlier published in the social media.\nHole went on a shooting spree at the FedEx facility before turning the gun on himself.\nAccording to reports, he last worked for FedEx in 2020.\nCops still don’t know his motive and where he got the rifle he used."
  },
  {
    "headline": "52 Nigerians hit with severe reactions after taking AstraZeneca vaccine",
    "summarized_story": "By Kazeem UgbodagaThe National Primary Health Care Development Agency, NPHCDA, on Friday disclosed that 52 Nigerians have experienced moderate to severe reactions after taking the AstraZeneca vaccine.\nExecutive Director and Chief Executive Officer, NPHCDA, Dr. Faisal Shuaib disclosed this at a news conference in Abuja.\nHe also said 8,439 Nigerians experienced mild Adverse events following immunization (AEFI) after taking the vaccine.\n“Similarly, 52 cases of moderate to severe incidents of AEFI have been reported.\nAccording to Shuaib, as of today, April 16th, 1,071,346, representing 53.2% of the eligible persons targeted with the AstraZeneca vaccine had been administered their first dose in this vaccination phase."
  },
  {
    "headline": "BREAKING: Remains Of Ibrahim Attahiru, Others Arrive Abuja For Burial",
    "summarized_story": "Corpses of Lt. Gen. Ibrahim Attahiru, the Chief of Army Staff, and others who died in a Beachcraft 350 plane crash at Kaduna International Airport on Friday have arrived in Abuja.\nAt around 11 a.m., they arrived at the Presidential Wing of the Nnamdi Azikwe International Airport in Abuja.\nThey were transferred to the National Mosque and the Nigerian Air Force Protestant Church, both of which were heavily guarded, for funeral rites.\nMore details later…"
  },
  {
    "headline": "BREAKING: Heavily Armed Policemen Storm PDP Secretariat In Cross River",
    "summarized_story": "Armed police officers supervised the removal of flags and other symbols from the Peoples Democratic Party (PDP) secretariat in Calabar, Cross River State, on Saturday.\nNtufam Inok Edim, the party’s caretaker committee chairman, is on the scene, according to Cross River Watch.\nHe is said to have remarked that the secretariat building should be used for anything else.\nDSP Irene Ugbo, the police spokesperson in Cross River, said an official statement on the incident will be released later.\nIt is the character, it is an honour, it is the commitment to the vision of this great nation."
  },
  {
    "headline": "UPDATED: Yoruba Nation Protest Hits Akure",
    "summarized_story": "Scores of youths under the aegis of Omo Oduduwa United have stormed the streets of Akure captial of Ondo State to agitate for the Yoruba nation.\nNEWS DIRECT reports that the protesters gathered at Isinkan roundabout in Akure to begin the Yoruba Nation protest.\nAdeleye stated that the demonstration would demand the Oduduwa Republic adamantly and loudly.\nThe state governor, Oluwarotimi Akeredolu, has already advised all Yoruba nation agitators to keep away from the state.\nHe claimed that no section of the entire state, known and delimited as Ondo State, would allow any gathering or agitation that may imply, even tangentially, that the people support what he called “unthinking rabble-rousing.”"
  },
  {
    "headline": "Pictures: Remains of fallen soldiers arrive Abuja NAF base for church service",
    "summarized_story": "PreviousPictures: Attahiru’s wife at Central mosque for burial service of late husband"
  },
  {
    "headline": "Pictures: Attahiru’s wife at Central mosque for burial service of late husband",
    "summarized_story": "PreviousBreaking: Remains of late COAS, others in Abuja for burial"
  },
  {
    "headline": "Breaking: Remains of late COAS, others in Abuja for burial",
    "summarized_story": "The remains of late Army Chief of Staff Lt. Gen. Ibrahim Attahiru and 10 other Military officers are now in Abuja for burial at the National Military cemetery.\nDetails loading…Share this:TweetPrintTelegramWhatsApp"
  },
  {
    "headline": "NASS laments Nigeria’s extremely high mortality indices -NigPilot",
    "summarized_story": "*Calls for prioritization of health securityNational Assembly has decried the extremely high mortality indices in Nigeria, despite huge resources sunk into the health sector over the years by the government at all levels.\nIt therefore called for prioritization of health security in the country on the template of Universal Health Coverage, which it added, cannot be achieved through the exclusive National Health Insurance Scheme being run by the federal government now.\nHe said: “This action by the legislature has become critically necessary as the country’s mortality indices have remained extremely high with minimal improvements, despite the magnitude of resources contributed to improve the statistics.\n“Although the country is making attempts to take giant strides in its pursuit of Universal Health Coverage (UHC); these efforts and whatever achievements have been recorded could be quickly eroded if health security is not prioritized.\nTanko Sununu said there is need for amendment of the existing National Health Insurance Scheme Act for actualisation of the Universal Health Coverage and by extension, health security."
  },
  {
    "headline": "NASS laments Nigeria’s extremely high mortality indices -NigPilot",
    "summarized_story": "*Calls for prioritization of health securityNational Assembly has decried the extremely high mortality indices in Nigeria, despite huge resources sunk into the health sector over the years by the government at all levels.\nIt therefore called for prioritization of health security in the country on the template of Universal Health Coverage, which it added, cannot be achieved through the exclusive National Health Insurance Scheme being run by the federal government now.\nHe said: “This action by the legislature has become critically necessary as the country’s mortality indices have remained extremely high with minimal improvements, despite the magnitude of resources contributed to improve the statistics.\n“Although the country is making attempts to take giant strides in its pursuit of Universal Health Coverage (UHC); these efforts and whatever achievements have been recorded could be quickly eroded if health security is not prioritized.\nTanko Sununu said there is need for amendment of the existing National Health Insurance Scheme Act for actualisation of the Universal Health Coverage and by extension, health security."
  },
  {
    "headline": "PDP to Buhari: Engage Nigerians at home in geo-political zones townhall meetings -NigPilot",
    "summarized_story": "Opposition Peoples Democratic Party, PDP, has charged President Muhammadu Buhari to summon courage and hold sessions with Nigerians via townhall meetings in the six geo-political zones just like the one he had with Nigerian citizens living in France.\nAccording to the PDP Spokesman, Kola Ologbondiyan , President Buhari should be bold to face Nigerians at home and give account of his administration in the last six years.\nThe PDP noted that it was not enough for President Buhari to visit far away France and attempt to use unsuspecting Nigerians living in Paris in a desperate effort to window dress the shambolic economic and security situation foisted on our nation by his failed administration.\nPresident must be reminded that his administration conducted the worst election in our national history as witnessed in the 2019 elections as well as some of the off-season elections.\n“Moreover, our party shudders that Mr. President can assert that he is committed to a multi-party system, in a situation where brazen efforts are being made by his administration to strangulate the main opposition party, with various instruments of suppression including encouraging the EFCC to unconstitutionally harass our party leaders.”The PDP stressed that it was equally jolted by Mr. President’s presentation of imaginary commitment of his administration towards security, economy, agriculture and education."
  },
  {
    "headline": "PDP to Buhari: Engage Nigerians at home in geo-political zones townhall meetings -NigPilot",
    "summarized_story": "Opposition Peoples Democratic Party, PDP, has charged President Muhammadu Buhari to summon courage and hold sessions with Nigerians via townhall meetings in the six geo-political zones just like the one he had with Nigerian citizens living in France.\nAccording to the PDP Spokesman, Kola Ologbondiyan , President Buhari should be bold to face Nigerians at home and give account of his administration in the last six years.\nThe PDP noted that it was not enough for President Buhari to visit far away France and attempt to use unsuspecting Nigerians living in Paris in a desperate effort to window dress the shambolic economic and security situation foisted on our nation by his failed administration.\nPresident must be reminded that his administration conducted the worst election in our national history as witnessed in the 2019 elections as well as some of the off-season elections.\n“Moreover, our party shudders that Mr. President can assert that he is committed to a multi-party system, in a situation where brazen efforts are being made by his administration to strangulate the main opposition party, with various instruments of suppression including encouraging the EFCC to unconstitutionally harass our party leaders.”The PDP stressed that it was equally jolted by Mr. President’s presentation of imaginary commitment of his administration towards security, economy, agriculture and education."
  },
  {
    "headline": "Ayade: PDP urges members in Cross Rivers State to remain united -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Bodies Of Officers Killed In Air Crash Arrive Protestant Church, Abuja",
    "summarized_story": "﻿Bodies of Air Force officers killed in a plane crash in Kaduna have arrived at the Protestant church, Airforce base, Abuja.\nThe officers who are all Christians include Brigadier General Olayinka and other crew members, FLT LT T.O Asaniyi, FLT LT AA Olufade, SGT Adesina, and ACM Oyedepo.\nSome of the wives of the deceased officers could not hold back their tears at the church service.\nSome of the wives of the deceased officers during the church service with family members.\npic.twitter.com/iGJMvOb6VT — Channels Television (@channelstv) May 22, 2021The Secretary to the Government of the Federation, Boss Mustapha, and the Permanent Secretary, Ministry of Defence, Musa Istifanus are also at the church service."
  },
  {
    "headline": "NAF Plane Crash: Military Takes Over Site, AIB To Commence Investigation",
    "summarized_story": "Soldiers have cordoned off the site where the Nigerian Airforce plane crashed on Friday evening at the Kaduna International Airport.\nSpeaking on the incident, the Manager of Kaduna airport, Amina Salami told Channels Television that the military authorities have taken over the crash site.\n﻿She added that they have prevented civil aviation officials from gaining access to the crash site pending the arrival of officials from the Accident Investigation Bureau (AIB).\nShe explained that the military plane was initially scheduled to land at the Nigerian Airforce Base in Mando area, but was later diverted to the Kaduna airport due to poor weather conditions.\nAccording to her, only the Accident Investigation Bureau will determine the actual cause of to crash."
  },
  {
    "headline": "Kaduna Crash: Attahiru, Others Paid Ultimate Price For Peace, Security – Buhari",
    "summarized_story": "President Muhammadu Buhari has mourned the Chief of Army Staff, Lieutenant Ibrahim Attahiru and other victims of the military plane crash in Kaduna, saying they paid the ultimate price for peace and security in Nigeria.\nThe late COAS was killed on Friday after a military Beachcraft 350 aircraft crashed at the Kaduna International Airport, claiming all eight souls on-boardPresident Buhari in a statement issued by his spokesman, Femi Adesina, said he is saddened over the loss of the army chief and other military officers.\nHe pledged that their death would not be in vain, condoling with the families of the deceased, the military, and Nigerians in general.\nREAD ALSO: Chief Of Army Staff, Others Die In Kaduna Plane CrashThe statement read, “President Muhammadu Buhari is deeply saddened over the air crash that claimed the Chief of Army Staff, Lt. Gen. Ibrahim Attahiru, and other military officers.\nThe President pledged that the departed would not die in vain.”"
  },
  {
    "headline": "Tributes Pour In For Late COAS Attahiru, Others",
    "summarized_story": "An avalanche of tributes were paid to former Chief of Army Staff, Lieutenant General Ibrahim Attahiru and ten others who died in an air crash in Kaduna on Friday.\nAccording to an army statement confirming the death, the ex-COAS was en-route Kaduna from Abuja when the unfortunate incident happened.\n“The Nigerian Army regrets to announce the passing away of its Chief of Army Staff, Lt Gen Ibrahim Attahiru,” the statement, signed by army spokesman, Brigadier-General Ibrahim Yerima, said.\nGbajabiamila, who said he had a few meetings with Attahiru in search of solutions to the challenges, noted that the late Army Chief came across as a core professional officer.\nThe Governor said the late Chief of Army Staff has, within his short time in the office, demonstrated and showed remarkable commitment and professionalism in the course of discharging his duty."
  },
  {
    "headline": "Biden Vows To Help ‘Rebuild’ Gaza, Insists On Two-State Solution",
    "summarized_story": "President Joe Biden on Friday pledged to help organize efforts to rebuild Gaza and said creating a Palestinian state alongside Israel is the “only answer” to the conflict.\nA Mideast peace plan devised by Trump’s adviser and son in law Jared Kushner was billed as providing for a two-state solution.\nBut that blueprint envisioned a Palestinian state with only limited sovereignty and Israel maintaining security over that state.\n“There is no shift in my commitment to the security of Israel, period, no shift, not at all,” he said.\nThe shift is that we still need a two-state solution."
  },
  {
    "headline": "Governor Hope Uzodinma mourns General Attahiru",
    "summarized_story": "Imo State Governor, Hope Uzodinma has expressed deep saddeness by the tragic news of the sudden passing of the Chief of Army Staff, Lt. Gen. Ibrahim Attahiru and ten (10) other military officials.\nOn behalf of the government and the good people of Imo State, the Governor conveyed his sincere condolences to President Muhammadu Buhari, Commander-in-Chief of the Nigerian Armed Forces and every member of the Nigerian Armed Forces over this sad development.\nIn a statement on his Twitter handle said is one loss too many, considering the commitment of these officers to ending the surging insecurity challenges faced today as a people and nation.\nHe prayed that the Armed Forces, families and associates of the late COAS and those of the other officers who were involved in the unfortunate air mishap find the fortitude to bear this irreparable loss.\nMay their souls rest in perfect peace"
  },
  {
    "headline": "Bodies of Chief of Army Sttaff, Other Muslim late officers arrive National Mosque, Abuja",
    "summarized_story": "A pensive atmosphere at the National mosque as wives, children, other family members, friends, well wishers and sympathisers of the six Muslim officers who died in Friday’s plane crash in Kaduna.\nNigeria’s 21st Chief of Army Staff, along with ten other officers across ranks, died in Kaduna after the Air force plane conveying them crashed.\nThe Chief of Defence Staff attributed the cause of crash to inclement weather, although he has ordered a thorough investigation into the incident.\nAdvertisementArrival of the wives of the Chief of Army Staff, Lieutenant General Ibrahim Attahitru, Other officers who lost their lives in Friday's plane crash in Kaduna at the National Mosque, Abuja @HQNigerianArmy @DefenceInfoNG @CDS_Nig @GenMagashi @NGRPresident @MBuhari @ProfOsinbajo pic.twitter.com/h40kVgChF5 — TVC News (@tvcnewsng) May 22, 2021Sympathisers are here at the National Mosque in their numbers, awaiting the arrival of the remains of the affected officers for the final burial rites."
  },
  {
    "headline": "Nigeria: Police Boss Insists Abuja Safe Despite Bandits’ Suleja Raid",
    "summarized_story": "Bandits, late on Wednesday, invaded Kwankwashe community, in Suleja, Niger State, just 30 minutes’ drive from Abuja, killing two people, thus fueling growing fears of possible attack in Abuja.\nThe Acting Inspector-General of Police, Usman Baba, on Firday swiftly assured residents of Abuja, Plateau State and other contiguous states of their safety and security as they go about their lawful duties, but he failed to speak on the attack in Suleja.\nThe bandits, apart from killing two people in the Kwankwashe attack, also reportedly broke into different houses in the community and abducted an unspecified number of residents, including children.\nThe abductors are yet to contact the families of the abductees but the matter has been reported to security agencies in Niger State.\n“The alert does not in any way suggest that an attack is imminent in any of the two states."
  },
  {
    "headline": "Israel and Hamas Both Claim Victory as Ceasefire Holds",
    "summarized_story": "Israel and Hamas both claimed victory on Friday after their forces ended 11 days of fighting, but humanitarian officials warned that the damage to Gaza would take years to rebuild.\nThe Israeli military said an Israeli soldier had been killed as well as 12 civilians, including two children.\nBoth countries cite concerns about weapons reaching Hamas, the Islamist group that controls Gaza and led the rocket barrage.\nThe Israeli military said that 90% of those that crossed the border had been intercepted by the Iron Dome missile defence system.\nIran, which does not recognise Israel but supports Hamas and says it has transformed the Palestinian fighters’ arsenal, said they had won a “historic victory” over Israel."
  },
  {
    "headline": "Israel-Palestinian Conflict: Aid Arrives in Gaza as Ceasefire Holds",
    "summarized_story": "The first convoys of humanitarian aid have arrived in Gaza, hours after a ceasefire between Israel and Palestinian militants came into effect.\nMore than 250 people were killed in the 11-day conflict, most of them in Gaza.\nTrucks from various aid agencies, including those affiliated with the United Nations, started bringing much-needed medicine, food and fuel into Gaza, after Israel reopened the Kerem Shalom crossing.\nAt least 248 people, including more than 100 women and children, were killed in Gaza, according to its health ministry.\nThe Israeli army said militants fired more than 4,300 rockets during the conflict, of which 90% were intercepted by its air defences."
  },
  {
    "headline": "Nuno Espirito Santo to Leave Wolves through ‘Mitual Agreement",
    "summarized_story": "Wolves head coach Nuno Espirito Santo will leave the club after their final Premier League match of the season against Manchester United on Sunday.\nThe 47-year-old leaves four years after originally taking charge of Wolves, having restored the side’s Premier League status and leading them to a Europa League quarter-final in 2020.\n“I, of course, want to thank all of the staff at Wolves, for their support and total commitment, every single day.\nHe established Wolves as Premier League regulars in the following seasons, securing back-to-back seventh-placed finishes which earned the club a spot in the Europa League, their first European qualification in 39 years.\n“Nuno has brought us some incredibly special moments at Wolves that will never be forgotten, but every chapter comes to an end,” Shi said."
  },
  {
    "headline": "Amid Man City Interest, Kane Says De Bruyne Is ‘a Striker’s Dream’",
    "summarized_story": "Harry Kane has said he wants to stay in the Premier League and has encouraged interest from Manchester City by naming “striker’s dream” Kevin De Bruyne as the player he would most like to play in front of.\nCity are among the few clubs with the resources to test Spurs’ resolve not to sell and can offer Kane a shot at the team trophies he craves.\n“When I watch De Bruyne play, he’s a special, special player and some of the balls I see him put in for City are just a striker’s dream if I’m honest.\nHe’s outstanding, an outstanding player with the ball, off the ball, pressing.\nIf Levy refuses to allow Kane to join another English club, the forward’s desire to overhaul Alan Shearer as the Premier League’s all-time top scorer is one reason he could be persuaded to stay at Spurs."
  }
]