[
  {
    "headline": "Ohanaeze faults Oluwo on Igbo Presidency",
    "summarized_story": "The Igbo apex socio-cultural organisation, Ohanaeze Ndigbo, has described as untrue the statement credited to the Oluwo of Iwo, Oba Abdulrosheed Akanbi, that the Igbo cannot be entrusted with the office of the Nigerian presidency.\nOhanaeze noted that Akanbi’s attack on the Igbo was not based on verifiable evidence but rather self-serving.\n“For the avoidance of doubt, the Igbo are adventurous nation builders; they are found in all parts of Nigeria and beyond.\nSeveral other eminent Yoruba icons are also in the advocacy for the presidency to be zoned to the South-East region of Nigeria.\n“Interestingly, the credentials of the presidential aspirants from the South-East region are not only impressive but very intimidating."
  },
  {
    "headline": "SANs, Uzodinma, Afenifere fault Afe Babalola on interim govt",
    "summarized_story": "He also advocated for an interim government to replace the regime of Major General Muhammadu Buhari (retd.)\nHe stated, “I think Nigerians need a stable political environment and an interim government is unstable.\n“The constitution is not the problem of Nigeria; our problem is with the operators of the constitution.\nAdegboruwa stated, “I don’t agree with the revered legal luminary that we should have an interim government, especially consisting of past heads of state.\nThe governor stated, “By May 29, if there is no elected government, our 1999 Constitution has not provided for an interregnum."
  },
  {
    "headline": "Bandits threaten to kill more kidnap victims, demand N20m",
    "summarized_story": "The fear was further heightened as a result of the killing of three out of the 26 kidnapped victims by bandits on Monday night.\nThe bandits threatened to kill more of the hostages if the N20m ransom they demanded was not paid.\nAccording to the monarch, the bandits killed the victims around the Dutse community, along the Kaduna-Abuja expressway.\nHe stated, “They have threatened to kill more, especially women, if their demands are not met.\nHe has a liver disease.”The monarch recalled that the bandits on March 31, 2022, invaded the community, killed two residents and abducted 26 persons."
  },
  {
    "headline": "YOV appoints new General Secretary, Deputy",
    "summarized_story": "Prominent Diaspora Organisation, Yoruba One Voice, YOV, has appointed Prince Adedokun Ademiluyi as the new General Secretary, and Akogun Olakanye Franklin as the deputy respectively of the group.\nThe Yoruba diaspora organization added that the move is in line with the agenda of the organization to re-organize and reposition the diaspora group, insisting that it is also to expand the scope of the organization and accommodate other like-minded Yoruba sons and daughters across the world.\nIn a statement by its Publicity Secretary, Mrs Omoladun Orolugbagbe, YOV stated further that the appointment into the two positions takes immediate effect.\nOrolugbagbe, however, stated also that the re-organization of the YOV executives was done across all the departments of the coalition.\nPrince Ademiluyi is a South African- based Yoruba son, a technocrat with many qualifications, including Business, Real estate, Business Informatics, Education, Project Management a Masters’s degree holder in Engineering (M,eng) and Information Technology."
  },
  {
    "headline": "2023: PDP knocks UPU over endorsement of guber aspirant",
    "summarized_story": "-says UPU usurping its functionsBy Festus Ahon, ASABATHE Peoples Democratic Party, PDP, in Delta Central Senatorial District, has frowned at the Urhobo Progress Union, UPU endorsement of Olorogun David Edevbie as its preferred gubernatorial candidate on the platform of the party for the forthcoming general election.\nThe PDP in a statement by its Chairman in the senatorial district, Chief A. P Fovie and 30 others, urged UPU leadership to with immediate effect withdraw the endorsement, adding that the UPU was usurping the functions of the party in the ongoing electioneering process leading to the primaries.\n“UPU efforts in the affairs of Urhobo nation of Delta Central Senatorial District will always be appreciated if and only such efforts or interests are not in conflict with the duties and regulations of our party, PDP, and its organs.\n“And in the instant case, we found out that the purported endorsement of our party member who is a governorship aspirant usurped the functions of our party in the ongoing electioneering process leading to the party primaries.\n“This obvious external interference by UPU and her leadership occasioned by the endorsement of a PDP governorship aspirant in Delta State cannot in any way be encouraged, hence this subtle appeal to the leadership of this great socio-cultural organization to immediately repudiate and/or nullify the endorsement via another press statement, please."
  },
  {
    "headline": "Bank of Industry Group grows profit by 75% to N62b in 2021",
    "summarized_story": "The Bank of Industry Group has reported a profit before tax of N62.28 billion for the financial year ended December 31, 2021; 75 per cent higher than the 2020 profit of N35.54 billion.\nDiscounted for tax, the profit for the year under review comes to N53.41 billion, compared to N31.59 billion in 2020.\nThe Group comprises the Bank of Industry, herein referred to as The Bank, and its subsidiary companies.\nThe Bank made an after-tax profit of N52.60 billion in 2021, compared to N30.90 billion in 2020.\nThis includes a $750mn syndicated medium-term loan in 2018 (fully paid); a €1bn syndicated loan in March 2020; a $1bn syndicated loan in December 2020; and in addition, a €750mn Senior Eurobond (the first by any African national DFI) in February 2022."
  },
  {
    "headline": "PDP Lagos4Lagos sacks chairman over alleged N100m gift",
    "summarized_story": "The sack came following approval of the apex body led by Jandor to relieve Ajayi who was accused of sabotage and anti-group activities.\nAjayi was alleged to have a been a mole for the APC all along.\nHe has also obtained the nomination form as one of the governorship aspirants in Lagos state, preparatory to 2023 general election.\n“Jandor made him (Ajayi) realise that the movement is based on personnel commitment and contributions and not on pecuniary gains which Ajayi has been championing.\n“The development will not in anyway affect our good fortune as maximum support for Lagos4Lagos movement is intact and solid."
  },
  {
    "headline": "Imo SDP members exchange blows over-sharing positions in Congress",
    "summarized_story": "By Chinonso AlozieOwerri- Members of the Imo state Social Democratic Party, SDP, on Tuesday exchanged blows as well as destroyed some of their properties in Owerri, after accusing the national executive of the party, of allegedly planning to conduct a one-sided congress to favour a group of people in the SDP.\nThe Acting Imo State Chairman, of the SDP, Mr Ben Anochie, who confirmed this to Vanguard in Owerri, also said the congress could not hold because of the battle among members of the party.\nHe told Vanguard, “The problem is that the main structure of the SDP which has been in existence for almost a decade felt that the National body that came to organise for the congress has sold out.\nOut of the 34 positions they only gave four positions to the main structure of the SDP, including the secretary position so they got angry and said that it will not happen.\nThe Congress did not hold."
  },
  {
    "headline": "Federal High Court’s six new judges, FCT’s one for inauguration April 20",
    "summarized_story": "President Muhammadu Buhari has approved the appointment of six new judges for the Federal High Court of Nigeria and one for the High Court of the Federal Capital Territory FCT.\nA statement in Abuja on Tuesday evening from the Office of the Chief Justice of Nigeria said that the CJN, Ibrahim Tanko Muhammad, will tomorrow, April 20 swear in the new judges.\nThe new Judges comprised the incumbent Chief Registrar of the Federal High Court, Mr Emmanuel Gakko, Bala Khalifa-Mohammed Usman, Aminu Garba, Musa Sulaiman Liman, Ahmad Gama Mahmud and Segun-Bello Mabel Taiye.\nA statement by Mr Ahuraka Yusuf Issah, Senior Special Assistant to the CJN on Media, indicated that another judge appointed for the FCT High Court, Joseph Adebayo Aina will also be inaugurated along with his counterpart from the Federal High Court.\nThe new Judicial Officers would be sworn in at the Supreme Court complex by 2 pm."
  },
  {
    "headline": "2023: I won’t allow anyone destabilise Nigeria – Buhari",
    "summarized_story": "President Muhammadu Buhari on Tuesday in Abuja said he would not allow any individual or group destabilise the country.\nBuhari also urged Nigerians to resist agents bent on causing breakdown of law and order.\nBut I do not know why people will allow themselves to be successfully subverted to destabilise their own country,’’ the President said at an Iftar dinner with Governors, Ministers and Heads of Government Agencies.\nHe thanked the Governors and Ministers for honouring his invitation to break the Ramadan fast and expressed confidence that in spite of the current security challenges, the country will succeed.\nSpeaking on the forthcoming general elections, Buhari said that being beneficiary of free, fair and credible elections, the introduction of technology and the Permanent Voters Card (PVCs) will make it impossible for anyone to claim millions of votes again in the country."
  },
  {
    "headline": "Top ISIS commander, Ammar Bin-Umar killed in Lake Chad airstrike",
    "summarized_story": "Troops of the Multinational Joint Task Force (MNJTF) have eliminated a top leader of the Islamic State of Iraq and Syria (ISIS), Ammar Bin-Umar, in massive airstrikes in Lake Chad.\nThe top ISIS Commander was reportedly sent by the terror group to coordinate attacks for the Islamic State West Africa (ISWAP) operating from the Tumbuns in Lake Chad against targets in Nigeria, Niger, Chad and Cameroon.\nAccording to the report, the elimination of the top ISIS Commander was confirmed by a military intelligence officer who disclosed that the coordinated airstrikes by the Nigerian Air Force Super Tucano jets were in conjunction with the Multi-National Joint Task Force (MNJTF), Niger Air Task Force’s Mi35 and Mi171 helicopter Gunship on April 14, 2022, at Arinna in Marte Local Government Area of Borno State.\nHe was reportedly killed while trying to flee Lake Chad as a result of the week-long sustained onslaught on the terrorists by a combined team of Operation Desert Sanity and the MNJTF Lake Sanity on some Boko Haram/ ISWAP strongholds in which over a 100 terrorists, as well as ten of their commanders, have so far been neutralized.\nAccording to the report, Ammar Bin-Umar was one of the top ISIS Mujahedeen’s dialogue committee deployed to the Boko Haram/Islamic State West Africa Province (ISWAP), caliphates in February 2022, to broker peace between the two warring factions, fighting over supremacy among the Jamā’at Ahl as-Sunnah lid-Da’wah wa’l-Jihād of Boko Haram factions and the ISWAP."
  },
  {
    "headline": "2023: South-West presidential aspirant funding genocide against Igbos – HURIWA alleges",
    "summarized_story": "Human Rights Writers Association of Nigeria, HURIWA has alleged that there is credible evidence of well-funded plots to engineer genocidal killings of Igbos in different parts of the country.\nHURIWA, in a statement signed by its National Coordinator, Comrade Emmanuel Onwubiko, alleged that the move was being funded by an unnamed presidential aspirant from the South West.\nThe group said that those it described as apostles of genocide, who, according to it, hate Igbos passionately, are already deploying their pulpits and traditional stools and their media outlets to promote anti-Igbo sentiments.\nHURIWA called on Igbo leaders to report this matter to President Muhammadu Buhari and the National Assembly to table the media published diatribes and hate speeches against the Igbos which are deliberately put out there in the media.\nAccording to HURIWA, since the 2019 polls that Senator Oluremi Tinubu openly canvassed hate speeches directed at the Igbos residents in Lagos over her perceived fear that the large majority of Igbos may vote for PDP, the Igbo sentiment has taken a more sinister and deadly dimension."
  },
  {
    "headline": "EFCC reacts to Bawa’s ‘controversial visit’ to Lagos Chief Judge",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) insists the visit of the Chairman, Abdulrasheed Bawa to Justice Kazeem Alogba was a routine one.\nBawa had met with Alogba, the Chief Judge of Lagos State, after a court session where he was a prosecution witness.\nEFCC spokesman, Wilson Uwujaren said the commission was constrained to state the fact of the visit to forestall innuendos and misrepresentation.\nUwujaren maintained the chairman’s visit was in official capacity and not as a witness in a criminal trial before the Lagos High Court.\n“The visit should not be exploited by mischief makers to fan the embers of disaffection between the Commission and members of the Bench”, the EFCC warned."
  },
  {
    "headline": "Alleged gang sex: Chrisland denies pregnancy test claim",
    "summarized_story": "By Alao AbiodunThe management of Chrisland Schools, Lagos has refuted allegations that the institution conducted pregnancy tests on one of the students who participated in the World School Games in Dubai, UAE last month.\nThe mother of the 10-year-old girl, while alleging that Chrisland School attempted to cover up the gang rape of her daughter, alleged that they also conducted a pregnancy test on her without their consent.\nThe school said out of the 77 students in Dubai, only six were involved in the “immoral act”.\n“We are proud to reassure our stakeholders that no rape of anyone or the administration of a pregnancy test on any child took place on our watch.\nTo insinuate that a pregnancy test was carried out on a student, for whatever reason therefore, is a highly unfortunate conjecture."
  },
  {
    "headline": "National insecurity: Has Kogi found the solution?",
    "summarized_story": "Although Kogi State may not be entirely crime-free, it seems to have found a way for its people to cohabit without the terrorism, banditry and ethno-religious violence rocking some parts of the country.\nKogi’s past security challengesAt the seminar, speakers and participants highlighted aspects of the state’s security situation before and during Bello’s tenure.\nOmodara, who delivered a paper entitled, “Succeeding in the fight against insecurity, terrorism: the Kogi example,” traced the problems to several factors.\nGovernor Bello listed some of the measures his administration had put in place to achieve the relative success.\nIn Kogi State, the people understand our approach; we are fighting terrorists and other criminalities by applying our local compact system that is suitable for the state."
  },
  {
    "headline": "Lagos Transportation Policy remains in limbo",
    "summarized_story": "After three years, experts are asking, where is the Lagos State Transportation Policy unveiled with fanfare?\nADEYINKA ADERIBIGBE writesExperts agreed that Lagos State couldn’t have been luckier.\nOladeinde, former director in the Lagos Metropolitan Transportation Authority, LAMATA, was a member of the panel of experts who drafted the policy.\nBa’walla, a Russia-trained railway engineer, was a former Managing Director of the Lagos State Mass Transit Service (LSMTS), and pioneer Dean of the Lagos State University School of Transportation (LASU-SoT).\nThe way to go, they said, is a properly planned public transportation system."
  },
  {
    "headline": "Senators, Reps to court: sustain Electoral Act 84 (12)",
    "summarized_story": "By Yusuf Alli, AbujaThe High Court lacks the powers to order the deletion of Section 84(12) of the Electoral Act 2022, the National Assembly has told the Court of Appeal.\nNot determining the appeal before the deadline for the submission of the list of candidates will defeat the purpose of the law, the National Assembly said.\nThe Independent National Electoral Commission (INEC) has given the parties June 3 deadline to complete the conventions.\nThe National Assembly faulted the Federal High Court judge for not giving it a fair hearing by denying it an opportunity to be heard.\nThe National Assembly sought an order to allow the appeal and set aside the judgment delivered by Justice Anyadike."
  },
  {
    "headline": "Police probe pupil’s Dubai rape allegation",
    "summarized_story": "The state government also announced the closure of all Chrisland schools in the state pending the outcome of investigations.\nThe woman said: “My child attended Chrisland School, VGC.\nAbout a month ago, I was on my way out of Lagos when I got a call from Mrs. Azike, the head teacher from Chrisland School.\nThere have been reactions to the viral sex tape of the Chrisland Schools pupils.\nOne Dr. Dipo Awojide said “Chrisland School has a duty of care for their pupils and students."
  },
  {
    "headline": "Sun, rain won’t beat us again, say teachers as Kalu commissions renovated schools",
    "summarized_story": "They stated this on Monday when the Senate Chief Whip led a delegation to commission the newly reconstructed school building which he expedited in the community.\nHe also lamented the discontinuation of the free education programme which he implemented when he was governor of the state between 1999-2007.\n“Unlike before, when I was governor, I ensured that we have free education.\nAside from renovation, we have distributed free learning materials, which include, school bags, text books, desks and so on.\nIf you support the APC to take over the state, we will ensure that free education comes back."
  },
  {
    "headline": "2 pilots feared dead as NAF aircraft crashes in Kaduna",
    "summarized_story": "A Nigerian Air Force (NAF) trainer aircraft has crashed in Kaduna, Tuesday evening.\nSources said the two pilots onboard were feared dead.\nA source said the Super Mushak, which is trainer aircraft, crashed while on a training mission.\nThe aircraft, sources added, crashed inside a NAF facility in the state capital.\nA message sent to the NAF director Public Relations and Information on the crash was not responded to at press time."
  },
  {
    "headline": "Sex scandal: Police interrogates Chrisland head teacher, parents, others at SCID",
    "summarized_story": "The invitation was extended to Mrs. Georgie Azike, Chrisland Schools, VGC, parents of the female and male pupils involved in the immoral act in Dubai, United Arab Emirates.\nThe Lagos State Police Public Relations Officers (PPRO), Benjamin Hundeyin, said all parties involved in the case had been asked to report to SCID Panti yesterday, for interrogation.\nMeanwhile, the National Parents Teachers Association of Nigeria (NAPTAN) has described as unfortunate, the trending sex video of Chrisland Schools pupils engaged in sexual misconduct last month in Dubai.\n“ Parents don’t have time for their children; they dump them at school and expect teachers to train them.\nHe also faulted the school for keeping the incident away from parents, adding, “the school ought to have told the parents immediately they returned from the trip."
  },
  {
    "headline": "Terrorists kill 5 abductees in Kaduna",
    "summarized_story": "From Sola Ojo, KadunaThere is palpable fear among the residents of Kaduna, especially those in Angwan Bulus in Chikun Local Government Area of Kaduna State, following the discovery of the lifeless bodies of five kidnapped people, including three from Angwan Bulus.\n“The bandits called earlier yesterday, saying that they have killed three of the people they kidnapped from Angwan Bulus and told us where their bodies were dumped.\n“The terrorists called last evening and said since we refused to pay the ransom, we should go to a location and carry the corpses of our people.\n“Before we got there, we learnt that police had already evacuated the bodies and deposited them at Saint Gerald Catholic Hospital, Kakuri, Kaduna.\nSpokesman for the Kaduna State Police Command, ASP Mohammed Jalige, confirmed the unfortunate development via a telephone call."
  },
  {
    "headline": "Breaking: NAF Aircraft crashes in Kaduna",
    "summarized_story": "From Molly Kilete, AbujaA Super Mushak aircraft belonging to the Nigerian Air Force(NAF), has crashed in Kaduna State, killing the two pilots on board the aircraft, Daily Sun, has gathered.\nThe Super Mushak aircraft manufactured in Pakistan, was said to be on a training flying as part of activities lined up to mark the Nigerian Air Force day slated for May, 14, when it crashed Tuesday afternoon.\nThe NAF, is yet to issue a statement on the crash.\nThe incident of the crash has thrown the entire NAF family into a mourning mood, which may result to a low key 2022 NAF day celebrations.\nThe NAF has suffered a total of eleven crashes Between August 29, 2015, and 2021, killing no fewer than 33 officers."
  },
  {
    "headline": "Amid Worsening Insecurity, Defence Minister Seeks God’s Intervention to Defeat Terrorists",
    "summarized_story": "The terrorists had, allegedly, fired mortar bombs at civilian targets in Gujba Local Government Area of Yobe State, recently.\nIt said the aircraft was, at the time of filling this report, still patrolling Maiduguri, the Borno State capital, to ensure that the city remained safe.\nZulum said this in his Easter message, stressing that the surrender is a miracle towards the healing of Borno State and the North-east.\nHe said, “The mass surrender of over 35,000 fighters and commanders is, certainly, one of Allah’s many miracles towards healing Borno State and rest of the North-east.\n“This mass surrender is the product of the endless prayers citizens across Borno State, the North-east region, rest of Nigeria and, indeed, the world have been offering, seeking God’s intervention to heal Borno State."
  },
  {
    "headline": "Marginal Fields: We’ll Not Accept People Trading in Our Papers, Says Komolafe",
    "summarized_story": "According to him, “In many cases the moment people get a letter of award, they write to say they want to assign.\nWe shouldn’t be encouraging people making money by trading papers.\n“It is better you have a regulator that abides by the rule of law than to have a genius as a regulator.\nOn how he intended to tackle the challenges, Komolafe said, “I came with a revolutionary mind-set.\nAuthorities claimed tribal leaders in southern Libya had shut down the county’s largest oil field — the latest closure of an oil facility amid a bitter standoff between two rival governments."
  },
  {
    "headline": "Chrisland Speaks on Suspension of Students in Sex Tape, Silent on Action Taken against Staff Members for Negligence",
    "summarized_story": "Funmi OgundareThe management of Chrisland schools has explained why it had to suspend some students over a sex tape which went viral on social media.Some students from the private school located in Victoria Garden City, who were in Dubai, the United Arab Emirates (UAE), for the World School Games in March were involved in immoral acts in a trending video on social media.\nHe added that it was also to caution students on the need to remain on the path of resisting wrong influences.\n“The school, he noted, had taken a critical view of the number of students who participated in this trip to Dubai and who did the school proud in its quest to expand the horizons of its students holistically through global exposure, adding that it takes into account a wholesome development of the mind, body and spirit through sporting engagements.\nOf the 76 children who represented Chrisland, Fadeyi said 71 ensured an untainted adherence to its standards, abiding with laid down regulations and code of conduct, while doing us very proud in the process.\n“Within these 71, we kept our girls on the 11th floor and boys on the fourth floor, to draw clear lines that respect moral boundaries."
  },
  {
    "headline": "Breaking: LASG Shuts down Chrisland Schools over Sexual Violence Allegations",
    "summarized_story": "Rebecca EjifomaThe Lagos State Government, Monday, ordered the indefinite shut down of all Chrisland Schools in the state pending investigation of the alleged sexual violence case involving students of the school.\nThis was announced in a media statementissued on Monday.\nThis includes “producing, distributing, receiving, or possessing an image of child pornography”.\nIn the meantime, all Chrisland schools within Lagos State are hereby closed, pending further investigations.\nThe Ministry of Education, Office of Education Quailty Assurance, Ministry of Youth and Social Development, Ministry of Justice,and the Lagos State Domestic and Sexual Violence Agency signed the statement."
  },
  {
    "headline": "Atiku: After Seven Years of APC’s Incompetence, Nigeria Needs Unifier",
    "summarized_story": "Atiku said Nigeria needed a “unifier, not a pacifier”.\nSpeaking directly to some of the issues defining the state of the nation on the journey to 2023, Atiku said, “I think after seven years of incompetence, Nigerians just want competence.\nNigeria needs a unifier, not a pacifier.\n“In the year 2022, Nigeria is the world headquarters for extreme poverty, and the third most insecure nation in the world.\nOur individual hearts are broken; our family dreams are broken; homes are broken; churches, mosques, infrastructure are broken."
  },
  {
    "headline": "BREAKING: Igbo Board Of Deputies Drags Pastor Tunde Bakare To Court Over ‘Hate Speech, Genocidal Comments’ During Sermon",
    "summarized_story": "The Igbo Board of Deputies, comprising stakeholders of South-East extraction, has vowed to take Pastor Tunde Bakare of the Citadel Global Community Church, Lagos State, to court over his alleged hate speech and genocidal comments against the Igbo people of Nigeria.\nYour hate speech and your premeditated incitement designed for ethnic cleansing of the Igbo people in Nigeria were aired and viewed right at the heart of Lent.\n“We have waited without success for you to, on your own accord, recant your hate speech and/or withdraw the incitement of genocide against the Igbo people.\nThe fact that we have not exhaustively dealt with this matter at present shouldnot be construed as a waiver, omission and/or novation of our clients’ rights.\nAll our clients’ rights are fully reserved."
  },
  {
    "headline": "BREAKING: Igbo Board Of Deputies Drags Pastor Tunde Bakare To Court Over ‘Hate Speech, Genocidal Comments’ During Sermon",
    "summarized_story": "The Igbo Board of Deputies, comprising stakeholders of South-East extraction, has vowed to take Pastor Tunde Bakare of the Citadel Global Community Church, Lagos State, to court over his alleged hate speech and genocidal comments against the Igbo people of Nigeria.\nYour hate speech and your premeditated incitement designed for ethnic cleansing of the Igbo people in Nigeria were aired and viewed right at the heart of Lent.\n“We have waited without success for you to, on your own accord, recant your hate speech and/or withdraw the incitement of genocide against the Igbo people.\nThe fact that we have not exhaustively dealt with this matter at present shouldnot be construed as a waiver, omission and/or novation of our clients’ rights.\nAll our clients’ rights are fully reserved."
  },
  {
    "headline": "BREAKING: Igbo Board Of Deputies Drags Pastor Tunde Bakare To Court Over ‘Hate Speech, Genocidal Comments’ During Sermon",
    "summarized_story": "The Igbo Board of Deputies, comprising stakeholders of South-East extraction, has vowed to take Pastor Tunde Bakare of the Citadel Global Community Church, Lagos State, to court over his alleged hate speech and genocidal comments against the Igbo people of Nigeria.\nYour hate speech and your premeditated incitement designed for ethnic cleansing of the Igbo people in Nigeria were aired and viewed right at the heart of Lent.\n“We have waited without success for you to, on your own accord, recant your hate speech and/or withdraw the incitement of genocide against the Igbo people.\nThe fact that we have not exhaustively dealt with this matter at present shouldnot be construed as a waiver, omission and/or novation of our clients’ rights.\nAll our clients’ rights are fully reserved."
  },
  {
    "headline": "I Was In Germany For ‘Deserved Rest’ – Governor Akeredolu Confirms SaharaReporters’ Story On Medical Trip",
    "summarized_story": "Rotimi Akeredolu, governor of Ondo State, has returned to Nigeria after staying in Germany for at least 10 days.\nA source had told SaharaReporters that the governor was in the European country for medical treatment after the March 26 All Progressives Congress (APC) national convention in Abuja.\n“What exposes this shameful falsehood is the fact that SaharaReporters claimed the Governor was flown out of the country to Germany when in fact, he left for Dubai,” Olatunde had said.\nSee Also Politics Ondo Governor, Akeredolu Reportedly Hospitalised in GermanyHowever speaking on the state-owned television station, OSRC, the governor confirmed he was in Germany for his “deserved rest.”He said, “On the 1st, I took up my deserved rest in Germany; this is what I have done in the last a week and the half until I heard about this; the best way you can describe it is a wicked rumour that I’m not alive.\nThey said I was bed ridden, that I was on life support but my support is Christ.”"
  },
  {
    "headline": "I Was In Germany For ‘Deserved Rest’ – Governor Akeredolu Confirms SaharaReporters’ Story On Medical Trip",
    "summarized_story": "Rotimi Akeredolu, governor of Ondo State, has returned to Nigeria after staying in Germany for at least 10 days.\nA source had told SaharaReporters that the governor was in the European country for medical treatment after the March 26 All Progressives Congress (APC) national convention in Abuja.\n“What exposes this shameful falsehood is the fact that SaharaReporters claimed the Governor was flown out of the country to Germany when in fact, he left for Dubai,” Olatunde had said.\nSee Also Politics Ondo Governor, Akeredolu Reportedly Hospitalised in GermanyHowever speaking on the state-owned television station, OSRC, the governor confirmed he was in Germany for his “deserved rest.”He said, “On the 1st, I took up my deserved rest in Germany; this is what I have done in the last a week and the half until I heard about this; the best way you can describe it is a wicked rumour that I’m not alive.\nThey said I was bed ridden, that I was on life support but my support is Christ.”"
  },
  {
    "headline": "Resist agents who want to destabilise Nigeria, Buhari tells citizens",
    "summarized_story": "President Muhammadu Buhari has advised Nigerians against allowing themselves to be used to promote disunity in the country.\nThe president spoke on Tuesday during an iftar he hosted for governors, ministers and heads of government agencies.\nAccording to a statement by Garba Shehu, presidential spokesman, Buhari advised Nigerians to “resist agents” who want to destabilise the country.\nBut I do not know why people will allow themselves to be successfully subverted to destabilise their own country,” he added.\nAdvertisementThe president also expressed confidence that in spite of the current security challenges, the country will overcome."
  },
  {
    "headline": "Resist agents who want to destabilise Nigeria, Buhari tells citizens",
    "summarized_story": "President Muhammadu Buhari has advised Nigerians against allowing themselves to be used to promote disunity in the country.\nThe president spoke on Tuesday during an iftar he hosted for governors, ministers and heads of government agencies.\nAccording to a statement by Garba Shehu, presidential spokesman, Buhari advised Nigerians to “resist agents” who want to destabilise the country.\nBut I do not know why people will allow themselves to be successfully subverted to destabilise their own country,” he added.\nAdvertisementThe president also expressed confidence that in spite of the current security challenges, the country will overcome."
  },
  {
    "headline": "Ndume: Amaechi's presidential bid is my project — he's the best for APC",
    "summarized_story": "Ali Ndume, senator representing Borno south district, says the decision of Rotimi Amaechi, minister of transportation, to contest the presidency is his “project”.\nThe minister of transportation will challenge APC presidential hopefuls like Bola Tinubu, Vice-President Yemi Osinbajo, David Umahi, Chris Ngige, Yahaya Bello, among others, for the party’s ticket.\n“In the APC, I feel the best candidate we can present is Amaechi.\nAdvertisement“Among them, I feel Amaechi is the Nigerian candidate.\nWe need a Nigerian candidate, not somebody who seems to be considered as a sectional or regional candidate,” he said."
  },
  {
    "headline": "Ndume: Amaechi's presidential bid is my project — he's the best for APC",
    "summarized_story": "Ali Ndume, senator representing Borno south district, says the decision of Rotimi Amaechi, minister of transportation, to contest the presidency is his “project”.\nThe minister of transportation will challenge APC presidential hopefuls like Bola Tinubu, Vice-President Yemi Osinbajo, David Umahi, Chris Ngige, Yahaya Bello, among others, for the party’s ticket.\n“In the APC, I feel the best candidate we can present is Amaechi.\nAdvertisement“Among them, I feel Amaechi is the Nigerian candidate.\nWe need a Nigerian candidate, not somebody who seems to be considered as a sectional or regional candidate,” he said."
  },
  {
    "headline": "Sources: Amosun to announce presidential bid on May 5",
    "summarized_story": "Ibikunle Amosun, senator representing Ogun central, is set to declare his interest in running for president, TheCable understands.\nAccording to sources, the former Ogun governor is expected to announce his presidential bid at an event scheduled to take place on May 5.\nAdvertisementAmosun’s reported interest in the presidency comes three years after he was a major feature in the news over the controversy in his state in the build-up to the 2019 governorship election.\nFollowing the loss, Akinlade defected to the Allied Peoples Movement (APM) and became the governorship candidate of the party.\nAdvertisementMeanwhile, the APC national working committee (NWC) at the time suspended Amosun for “anti-party activities” days before the 2019 governorship election."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Google announces its first African development centre",
    "summarized_story": "Google recently announced that it will soon launch its first African product development centre in Nairobi, Kenya.\nThis is to continue its commitment to creating “transformative products and services for people in Africa and around the world”.\nThis announcement is coming about 7 months after the company pledged to invest $1billion in Africa over the next 5 years at its Google for Africa event last October.\nGet the best African tech newsletters in your inboxIt has since opened a Google AI research center in Accra, Ghana to help drive useful innovations.\nGoogle has now joined a growing list of big tech companies like Microsoft and Visa that have launched research and development, and innovation hubs in Nairobi, Kenya, respectively."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Many feared dead as NAF aircraft crashes in Kaduna",
    "summarized_story": "Many feared dead as NAF aircraft crashes in KadunaA military aircraft belonging to the Nigerian Airforce, NAF, has crashed in Kaduna state with many officers on board reportedly killed.\nRecall that last year a military aircraft conveying Ibrahim Attahiru, the former, Chief of Army Staff and 10 others, crashed killing all the officers onboard including the Army Chief."
  },
  {
    "headline": "BusinessDay set to host PRINVEST 2022 to drive real estate development",
    "summarized_story": "BusinessDay Media Limited, West Africa’s leading provider of business intelligence and information on diversified media platforms including online, mobile, and print, is set to hold its property investment conference tagged PRINVEST 2022.\nThe conference themed ‘Dream Residential Communities: Closing The Gap’ is scheduled to hold as a hybrid event on April 21 and 22, 2022 at the Landmark events centre Lagos, Nigeria, and via Zoom.\nOver 70 speakers and over 2500 exhibition visitors are expected at the conferenceExperts in the real estate industry are expected to grace the conference and proffer solutions that will address the housing deficit, highlight necessary reforms to develop infrastructure and provide solutions to mortgage inefficiency in Nigeria.\nThe event will also connect international and local investors with opportunities and players, while also directly showcasing properties and products to end-users (buyers).\nInterested participants can register for the program via https://lnkd.in/dYpU5ZAm."
  },
  {
    "headline": "Cost of preparing Jollof rises by 7% on diesel price",
    "summarized_story": "The average cost of making a pot of Jollof rice, a popular Nigerian delicacy for a family of five rose by 7.3 percent to N8,595 in Q1 (Jan-Mar) 2022 from N8,008 in Q3 (Jul-Sep) last year, the latest Jollof Index report released Tuesday shows.\nThe Jollof index report published by SBM Intelligence, an Africa focused geopolitical research and strategic communications consulting firm attributed the increase to issues such as high cost of diesel, petrol scarcity and heightened insecurity.\nThe SBM Jollof Index is a composite index that tracks how much it costs to make a pot of Jollof rice across 13 markets in nine states in the six geopolitical zones for a family of five or six, the average rural and urban family size in Nigeria.\nIn addition to her loss, she said the cost of preserving her goods has increased, due to the high diesel cost forcing her to increase the price of her wares.\nThe report also highlighted that across the states surveyed, it cost the most to make a pot of Jollof rice in Wuse II, Abuja at N10,900 while Bayside Mbakpa in Calabar accounts for the lowest cost at N6,840."
  },
  {
    "headline": "Drugs War: NDLEA Foils Brazilian Based Cartels Efforts To Smuggle Cocaine – Nigerian Observer",
    "summarized_story": "Three of them were arrested during the inward screening of passengers on board Qatar Airline flight QR1433 from Doha to Port Harcourt.\nThe first is 51-year-old Udogwu James Johnson who hails from Orlu LGA, Imo state.\nHe was arrested with 5.48kg of cocaine concealed in lotion plastic bottles sealed with candle wax.\nThe father of one who claims he’s a motor spare parts dealer is from Ezeagu in Ezeagu LGA, Enugu state.\nGen. Mohamed Buba Marwa (rtd) has for disrupting desperate attempts by drug cartels to traffic dangerous drugs into Nigeria and across the country."
  },
  {
    "headline": "Police Spokesman Office: IGP Confirms Appointment Of CSP Olumuyiwa Adejobi As 25th FPRO – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLagos – The acting Force Public Relations Officer (FPRO) CSP Olumuyiwa Adejobi has been confirmed as the 25th indigenous Police Spokesman by the Inspector-General of Police, IGP Usman Alkali Baba.\nThis was contained in a statement signed by SP Anjuguri Jesse Manzah, Admin Officer, Force Public Relations Department, Abuja.\n“CSP Olumuyiwa Adejobi studied Archeology and Geography (Combined Honours) from the Premier University in Nigeria, University of Ibadan.\nHe had a long stint as Police Public Relations Officer in Ogun State Police Command from 2008 -2016.\n“CSP Adejobi has carved a niche for himself in Police Public Relations Management with the experience he has gained serving as PPRO in different Police Commands and Zone for more than a decade."
  },
  {
    "headline": "Flooding: Edo begins desilting of drains, warns against indiscriminate disposal of refuse – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has commenced the desilting of drainages across the state, warning residents against indiscriminate disposal of refuse to prevent blocking of drainages and avert flooding.\nSpeaking to journalists during monitoring of the desilting exercise, the Edo State Commissioner for Environment and Sustainability, Engr.\nHe noted that the desilting of drains and drainages must be done always to allow the free flow of flood water to the right channel.\nLawani added that the flood and erosion challenges experienced in some parts of the city is due to the indiscriminate disposal of waste in unauthorised places by some persons.\nHe further urged residents to desist from dumping refuse in unauthorised places as the state government will prosecute anyone caught in the act in line with extant environmental laws."
  },
  {
    "headline": "Ehanlen Community Suspends Sales of Lands, Sets Up Audit Committees – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEHANLEN-UHIELE – Members of Ehanlen-Uhiele Community of Ekpoma, Esan West Local Government Area of Edo State have suspended sales of lands in the community pending the completion of assignment, by the Land Audit Committee set up to investigate issues concerning sales of lands in the community.\nThree committees, including Constitutional Review Committee, Land Audit Committee and Finance Audit Committee have been set up in the community, with a three-month period to submit reports.\nThese were part of resolutions reached at the end of an enlarged community meeting, held at Ehanlen Primary School, which was chaired by the stand in Odiomwele of Ehanlen Community, Mr. Sylvester Ebohon.\n“The Finance Audit Committee is to look into community account.\nBecause, we have heard that the community account is empty."
  },
  {
    "headline": "Buhari Vows: Nobody will be allowed to destabilize Nigeria",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has vowed that his government will not allow anybody to destabilize the country.\nThis is as he urged Nigerians to resist agents bent on causing breakdown of law and order in the country.\nThe president, according to a statement from Femi Adesina, presidential spokesman, gave the assurance at an Iftar dinner with governors, ministers and heads of government agencies in Abuja on Tuesday.\nPresident Buhari, who thanked the Governors and Ministers for honouring his invitation to break the Ramadan fast, expressed confidence that in spite of the current security challenges, the country will succeed.\nChairman, Nigeria Governors Forum and Governor of Ekiti State, Dr Kayode Fayemi, commended President Buhari for demonstrating resilience and determination at a crucial period in Nigeria’s history."
  },
  {
    "headline": "Chris Ngige officially joins presidential race, says APC hasn’t failed Nigerians",
    "summarized_story": "Minister of labour and employment, and former governor of Anambra State, Dr. Chris Ngige, has officially declared his intention to contest for president in the 2023 general election.\nHe noted that the All Progressives Congress (APC) has not failed Nigerians and that President Muhammadu Buhari is greatly misunderstood, particularly in the Southeast.\n“Shall we say the APC as a party and as a government has failed?\nThe three cardinal issues upon which Nigeria gave us a mandate in 2015 are infrastructure/economic development, security and anti-corruption.\nIn properly assessing this government and our programmes, it is important we start from where we met Nigeria in 2015."
  },
  {
    "headline": "2023: Oyetola directs appointees wishing to contest election to resign",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun state governor, Adegboyega Oyetola on Tuesday directed all political appointees in the state with interest to contest in the 2023 general elections to resign their appointment with immediate effect.\nThis is sequel to the Executive Council meeting of Wednesday 13th April 2022 and the combined effect of Sections 84 (12) and 29(1) of the Electoral Acts 2022 as well as the Electoral timetable released by the Independent National Electoral Commission.\nA release issued and signed by the secretary to the state government, Prince Wole Oyebamiji, instructed all political appointees in the state with interest in elective office to comply with the directive of Mr.\nGovernor and the provision of the Law."
  },
  {
    "headline": "Nigeria Air Force officers feared dead as jet crashes in Kaduna",
    "summarized_story": "Officers of Nigerian Air Force (NAF) are feared killed in a plane crash that occurred on Tuesday in Kaduna State, Northwest Nigeria.\nDetails of the incident are still sketchy, but it is understood that the incident involved a training aircraft which had two pilots on board.\nMore subsequently…"
  },
  {
    "headline": "Sex Tape: Chrisland Students’ Immoral Act Not Rape – NAPTAN – Leadership News",
    "summarized_story": "The National Parent-Teacher Association of Nigeria (NAPTAN) has reacted to the closure of Chrisland Schools by the Lagos State Government over viral sex video involving minors.\nThe state government noted that that the closure of Chrisland Schools across the state on Monday, was to allow for proper investigation of the incident.\nOgunbanjo, however, expressed sadness at the development, which according to him, was not in anyway a rape case, as claimed by the mother of the suspended pupil in the viral video.\nI trust the Lagos State Commissioner for Education in ensuring that thorough investigations commences immediately.\nHe also condemned the approach of the Chrisland Schools Management on the development, adding that since March, they ought to have informed the pupils’ parents and carry them along immediately."
  },
  {
    "headline": "Akpabio Hands Over Healthcare Centres To A’ Ibom Communities",
    "summarized_story": "Minister of Niger Delta Affairs, Godswill Akpabio, has handed over blocks of healthcare centres to Edem Idim Ishiet community in Onna local government area of Akwa State.\nHanding over the projects at the weekend, Akpabio tasked the host communities to be dedicated in the protection and co-maintenance of the facilities provided by the government.\nHe said the federal government would continue to provide healthcare services to ameliorate the challenges faced by Niger Delta people.\nhealth care facilities in their communities.\nADVERTISEMENTThe construction of the health centre in this region is geared towards making care easily accessible to the communities especially the rural areas”."
  },
  {
    "headline": "Okowa Achievements: Omo-Agege Shying Away From Truth – Delta Govt – Leadership News",
    "summarized_story": "Delta State government has described the recent attack on Governor Ifeanyi Okowa by the Deputy Senate President Ovie Omo-Agege.\nInformation commissioner, Mr Charles Aniagwu, who responded to LEADERSHIP enquiries, described Omo-Agege’s attacks on the Okowa administration and the Peoples Democratic Party (PDP) in the state as petty and an indication that the Delta Central senator was being economical with the truth for political reasons.\n“We are not talking about the human capital development that cuts across the 270 wards in the state which the wards in Ndokwa nation are also very inclusive.\nWe would need to remind him that he needs to visit Obiaruku and see what is going on with the Obiaruku bridge and the internal roads constructed there as well as the Technical College built by the Okowa administration,” he said.\nAniagwu said the Okowa administration had transformed the creeks of Delta with bridges and several road projects including the Ayakoromo bridge, Trans Warri Road and bridges, the 20.4 km Ogulaha-Obotebe-Yokri, Sokebolou, Burutu internal roads, Ode-Itsekiri and Ogidigben internal roads among others."
  },
  {
    "headline": "Okowa Achievements: Omo-Agege Shying Away From Truth – Delta Govt – Leadership News",
    "summarized_story": "Delta State government has described the recent attack on Governor Ifeanyi Okowa by the Deputy Senate President Ovie Omo-Agege.\nInformation commissioner, Mr Charles Aniagwu, who responded to LEADERSHIP enquiries, described Omo-Agege’s attacks on the Okowa administration and the Peoples Democratic Party (PDP) in the state as petty and an indication that the Delta Central senator was being economical with the truth for political reasons.\n“We are not talking about the human capital development that cuts across the 270 wards in the state which the wards in Ndokwa nation are also very inclusive.\nWe would need to remind him that he needs to visit Obiaruku and see what is going on with the Obiaruku bridge and the internal roads constructed there as well as the Technical College built by the Okowa administration,” he said.\nAniagwu said the Okowa administration had transformed the creeks of Delta with bridges and several road projects including the Ayakoromo bridge, Trans Warri Road and bridges, the 20.4 km Ogulaha-Obotebe-Yokri, Sokebolou, Burutu internal roads, Ode-Itsekiri and Ogidigben internal roads among others."
  },
  {
    "headline": "Lagos GAC Okays Sanwo-Olu For Second Term In Office",
    "summarized_story": "Lagos State Governor Babajide Sanwo-Olu yesterday got the nod of the Governance Advisory Council (GAC) the highest decision making organ of the state ruling All Progressives Congress (APC)for a second term in office.\nLEADERSHIP gathered that the GAC approved a second term for Governor Sanwo-Olu at its meeting held at State House, Marina.\nCongratulations Dear Boss!”Before the Monday endorsement, the GAC members whose opinions were sought affirmed that Sanwo-Olu deserves a second term.\nIkorodu people recently endorsed him for a second term, I am aware when he came to commission some projects in the zone.\nGoing down memory lane, his predecessor, Mr. Akinwumi Ambode failed to secure a second term in office because he fell out of favour with the party structure and GAC members."
  },
  {
    "headline": "Shock, grief as Pilot in NAF aircraft crash identified [Photos]",
    "summarized_story": "One of the pilots who died in the Nigerian Air Force aircraft crash of Tuesday in Kaduna has been identified as Flt.\nAlkali died alongside another of his colleague who was also on a training at the Nigerian Air Force (NAF) base in Kaduna, on Tuesday.\n“May Almighty Allah grant him Jannah”, wrote Ismaeel Kasim.\nKadijat Braimah wrote: May Almighty Allah grant him Jannah🙏A Hero that died in the month full of blessings.”.\nThe Nigerian Air Force has not issued an official statement on the crash."
  },
  {
    "headline": "Bank of Russia set to sue EU, UK, USA over gold, reserves freeze",
    "summarized_story": "The Bank of Russia will challenge the block placed on its gold and foreign exchange reserves, its governor Elvira Nabiullina said on Tuesday.\n“This freezing of gold and foreign exchange reserves was unprecedented, so we are going to work on legal claims, and we are getting ready to put them forward.\n“This block on the gold and foreign exchange reserves of such a large country is unprecedented on a global scale,” she stated.\nIf we had these gold and foreign exchange reserves in possession, and had this part not been frozen, there would have been no need for such draconian measures on the movement of capital,” she explained.\nEarlier, the foreign ministers of 27 EU countries approved a ban on all transactions with the Bank of Russia and froze its assets."
  },
  {
    "headline": "BREAKING: Many Feared Dead As NAF Aircraft Crashes In Kaduna",
    "summarized_story": "BREAKING: Many Feared Dead As NAF Aircraft Crashes In KadunaA Nigerian Air Force (NAF) training plane has crashed in Kaduna State.\nThe plane crash that occurred on Tuesday is thought to have killed several officers.\nGeneral Ibrahim Attahiru, the previous Chief of Army Staff, perished in a plane crash in the same state just over a year ago.\nOn Friday, May 21, 2021, Attahiru and other military commanders were killed when their plane crashed as it was ready to land at the Kaduna International Airport.\nIn a statement, the military said the crash “took the lives of ten other officers, including the crew.”"
  },
  {
    "headline": "BREAKING: NAF Aircraft Crashes In Kaduna, Officers Feared Dead",
    "summarized_story": "A military aircraft belonging to the Nigerian Airforce, NAF, has crashed in Kaduna state with many officers on board reportedly killed.\nAlthough the details of the incident are still sketchy, it is understood that the incident involved a training aircraft that had two pilots on board.\nRecall that last year a military aircraft conveying the former, Chief of Army Staff, Ibrahim Attahiru, and 10 others, crashed killing all the officers onboard including the Army Chief.\nThis crash is the 5th air force plane crash in recent times.\nDetails shortly…"
  },
  {
    "headline": "BREAKING: IGP Orders Maximum Security In Schools, Colleges",
    "summarized_story": "IGP Usman Alkali Baba, the Inspector-General of Police, has ordered a review of police personnel and operational assets deployed to schools and institutions around the country.\nThis is to assure the protection of schools and colleges, notably boarding schools, tertiary institutions, and their campuses in regions prone to security breaches across the country, according to Force PRO CSP Olumuyiwa Adejobi.\nThe decision was delivered at the Force Management Team’s management meeting on Tuesday at the IGP Conference Hall, Force Headquarters, Abuja.\nAs a result of several isolated incidents recorded in various schools, the meeting assessed the country’s overall security, including the security of schools and universities.\n“The Inspector-General of Police, therefore, assured that all hands will be on deck to ensure a safe environment for all pupils and students in the various schools and colleges of learning within the country."
  },
  {
    "headline": "BREAKING: 2023: Ngige Finally Declares For Presidency",
    "summarized_story": "The Minister of Labour and Employment, Chris Ngige, has formally declared his desire to run for President in 2023.\nNgige stated that he aspires to see a Nigeria that is rich, united, and equal.\nOn Tuesday, the Minister proclaimed his presidential ambition while speaking to a large crowd at St. Mary’s Catholic Church in Alor, Anambra State’s Idemili South local government area.\nDue to his 40 years of public service experience, the former governor of the state claimed he was well-equipped as an administrator.\nNgige claims to have a plethora of expertise, capacity, and enthusiasm, as well as a big heart to accommodate Nigerians’ differences."
  },
  {
    "headline": "Minister applauds Sen. Kyari’s commitment to development of FCT",
    "summarized_story": "By Kingsley MadakiMinister of the FCT, Malam Muhammad Musa Bello has expressed the appreciation of the FCT Administration to Senator Abubakar Kyari for his commitment to the development of the the capity city while he served as Chairman, Senate Committee on FCT.\nMinister of State, the Permanent Secretary, the Chief of Staff, and all the senior management staff.\n“In all our official encounters with you, you did it with dedication to duty and passion for the development of the Federal Capital Territory.\nMinister and staff of the FCTA and FCDA”.\nThe APC Deputy National Chairman, however, pointed out that the population explosion challenge which forced relocation of capital out of Lagos was currently facing the FCT and exerting undue pressure on existing facilities."
  },
  {
    "headline": "Bashir Nura Alkali resumes Office as New Permanent Secretary for Works Ministry – NigPilot",
    "summarized_story": "Newly appointed Permanent Secretary of the Federal Ministry of Works and Housing, Mr. Bashir Nura Alkali has resumed duty following the recent approval and redeployment of Permanent Secretaries in the Federal Civil Service by His Excellency, President Muhammadu Buhari.\nEarlier in his remarks, Director Overseeing the Office of the Permanent Secretary, Engr.\nThat tells you the kind of person the new Permanent Secretary is.\nBut it is a gain to us in the Federal Ministry of Works and Housing,’’ Uzo said.\nUzo handed over two sets of handover notes, that of the former Permanent Secretary and that of when he acted as the Director Overseeing the Permanent Secretary’s Office."
  },
  {
    "headline": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE – NigPilot",
    "summarized_story": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE, CALLS BOOT PARTY AN APPENDAGE OF THE ALL PROGRESSIVE CONGRESS (APC)The Alliance of Collaborating Political Parties (ACPP) has condemned the felonious court case instituted against the People’s Democratic Party Governorship Candidate in Osun State by the Governorship Candidate of the Boot Party, Adesoji Adeleke.\nIn a statement issued by a Chieftain of the Alliance, Wole Adedoyin who was also the 2018 Governorship Candidate of the Hope Democratic Party (HDP) said the case is baseless, mischievous and full of contradictions to ridicule Senator Demola Adeleke and the People’s Democratic Party (PDP).\nACPP said the suit against Senator Demola Adeleke was in bad faith and targeted by undemocratic elements to undermine democracy and good governance in Osun State.\nAdedoyin said: The Boot Party has become an appendage of the All Progressive Congress (APC) in Osun State.\nThe party is not serious about winning the forthcoming Osun Governorship Election."
  },
  {
    "headline": "Soludo sets up 15 man peace Committee on insecurity in South East",
    "summarized_story": "Anambra state government has set up a truth, justice and peace Committee which is comprised of 15 members drawn from different fringes of the South Eastern region.\nThe members of the committee are Prof.Chidi Odinkalu as the Chairman, Amb.\nMrs. Bianca Ojukwu, Secretary, Dr. Joe Nworgu,Dr. Udenta Udenta, Mr. Charles Oputa(Charly Boy), Ms. Onyeka Onyenu.\n” To identify the remote and immediate causes of the agitations, restiveness, violence, and armed struggle in the South East since 1999.\nIt was gathered the committee would be inaugurated on a date to be communicated to its members."
  },
  {
    "headline": "Lalong salutes elder statesman Amb Yahaya Kwande @ 93",
    "summarized_story": "Plateau State Governor Simon Bako Lalong has sent warm felicitations to elder statesman Ambassador Yahaya Kwande on the occasion of his 93rd birthday.\nGovernor Lalong in a message signed by Macham Makut the director of press and public affairs to Governor Lalong congratulated the seasoned Administrator, Politician, Diplomat and philanthropist for his selfless service to Nigeria, Plateau State and humanity at large.\nHe described him as an accomplished personality who has made huge impact in the lives of the people at various times when he occupied various offices in the country.\nThe Governor said Ambassador Kwande has mentored many in public service, politics and humanitarian activities by his record of performance over the years where he has freely offered counsel, support and goodwill to those in power and others.\nAccording to Governor Lalong, Ambassador Yahaya is one of the few elders that have demonstrated sufficient interest in the peace, progress and prosperity of Plateau State and Nigeria over the years, hence his willingness to advise and share his wealth of experience with the Government on key issues."
  },
  {
    "headline": "Military Officers Feared Dead As Trainer Aircraft Crashes In Kaduna",
    "summarized_story": "An Air Force trainer Aircraft has reportedly crashed in Kaduna state, with the two pilots on board feared dead.\nAlthough the Airforce authorities are yet to confirm the incident, a security source told Channels Television that the trainer Aircraft crashed at the Air Force training base in Kaduna during a training session on Tuesday.\nIn 2018, a pilot sustained injuries after a jet belonging to the Nigerian Air Force was involved in a mishap in Kaduna state .\nDiamond 40 is a one-person seater training aircraft used for the training of air force personnel.\nIn May 2021, a NAF aircraft crashed in Kaduna killing the then Chief of Army Staff, Ibrahim Attahiru and 10 other military officers."
  },
  {
    "headline": "Bomb Explosion Rocks Cattle Market In Taraba",
    "summarized_story": "No fewer than three persons have been confirmed killed following a bomb explosion that rocked a drinking joint at a cattle market in Iware Community, a suburb of Ardo-Kola Local Government Area of Taraba State.\nAt least 19 other persons have also been confirmed injured and receiving treatment at various health centres within the community and beyond.\nIware Community is known for its cattle market and attracts buyers from all over Nigeria and neigbouring Cameroon who storm the market every Tuesday to make purchases at affordable prices.\nFew minutes later, he said he was going in search of his friend and seconds after the bomb exploded.\nPantuvo said one of the suspected bombers was later caught and killed by the angry residents who cut his body into parts in anger."
  },
  {
    "headline": "2023: Ngige Formally Declares Interest In Presidential Race",
    "summarized_story": "﻿Ahead of the 2023 general elections, the Minister of Labour and Employment, Sen. Chris Ngige Tuesday formally declared his intention to contest for the position of President of the Federal Republic of Nigeria.\nNgige unveiled his presidential ambition before a crowd at St. Mary’s Catholic Church Alor, Idemili South local government area of Anambra State.\nNgige said, “I also know the unproductive areas and the areas of waste in the public service.\nThe three cardinal issues upon which Nigeria gave us a mandate in 2015 are infrastructure/economic development, security and anti-corruption.\nThe Minister of Labour is neither a member of the Governing Council of universities nor the Minister of Education or Finance."
  },
  {
    "headline": "Alleged Abuse: Police Invite Chrisland Authorities, Parents, Others",
    "summarized_story": "Police have invited the parties involved in the alleged abuse of a 10-year-old pupil of Chrisland Schools in Lagos State.\nThe Public Relations Officer of the Lagos State Police Command, Benjamin Hundeyin, confirmed to Channels Television on Tuesday that all parties involved had been contacted.\nAmid the controversy trailing the alleged abuse of the minor, police authorities in Lagos had vowed to ensure that justice was served in the matter.\nChannels Television also reported that the state government had ordered that all Chrisland Schools within Lagos be shut down, pending further investigations.\nShe claimed that Chrisland sought to cover up the matter and suspended her daughter once the school found out she was aware of the gravity of the alleged abuse."
  },
  {
    "headline": "Lawmaker Escapes Gunmen Attack In Plateau",
    "summarized_story": "Newly elected member representing Jos North/Bassa Federal Constituency in the House of Representatives, Musa Agah Avia escaped an ambush by gunmen on Tuesday night.\nIn a statement signed by the National Secretary of Irigwe Development Association, Danjuma Dickson Auta, the lawmaker alongside his wife and children as well as his personal assistant and driver were ambushed along twin hill in Miango chiefdom of Bassa local government area of Plateau State.\nREAD ALSO: Things Are Getting Worse Than In 2015 – DiriAlthough they all escaped unhurt the car was battered with gunshot bullets as the driver against all odds bravely manoeuvred the vehicle amidst the sporadic shooting by the attackers.\nThe statement added that two others who were on a motorcycle and ahead of the lawmaker’s vehicle ran into the ambush and were killed by the attackers.\nSecurity agencies are yet to react to the incident which occurred near the spot where some people were killed recently during a festival ceremony in the chiefdom."
  },
  {
    "headline": "BREAKING: Lagos GAC okays Sanwo-Olu for second term",
    "summarized_story": "Lagos State Governor, Babajide Sanwo-Olu has secured the consent of the Governance Advisory Council (GAC) to run for a second term in office.\nThe GAC, the apex body within the state ruling political class of All Progressives Congress (APC) approved second term for Sanwo-Olu at its meeting this afternoon at State House, Marina.\nWith the APC governorship election primaries slated for May 27, the speculation on whether Sanwo-Olu will get a second term has become rife among the business and political elites in the state, especially members of the APC."
  },
  {
    "headline": "Akeredolu backs wife's senatorial ambition In Imo",
    "summarized_story": "Ondo state governor, Oluwarotimi Akeredolu has declared support for his wife’s Senatorial ambition.\nThe governor’s declaration was contained in a statement he personally signed.\nOndo First Lady, Betty Anyanwu- Akeredolu has shown interest to run for Imo East Senatorial SeatRecall that the state opposition People’s Democratic Party had on Sunday alleged that the governor was using the state fund to sponsor the wife’s Senatorial ambition in Imo state.\nBut in a subtle response, Akeredolu, in the statement, said he believed in the mission of the First Lady to emancipate women from the shackles of all forms of oppression.\nHe described her as a fiercely independent personality who is never afraid to voice her dissent on any issue."
  },
  {
    "headline": "Why brilliant people like Moghalu may never get chance to rule Nigeria -",
    "summarized_story": "Veteran Journalist and Public Affairs Analyst, Babajide Kolade-Otitoju says he longs for the day the current ruling class will fade out and the rein of leadership will be held by young, bright energetic minds like Kingsley Moghalu.\nHe however shares reasons why his wish may not come to pass."
  },
  {
    "headline": "IGP procures additional assets for strategic deployment",
    "summarized_story": "The Inspector-General of Police, IGP Usman Alkali Baba has acquired 55 additional Lorries, five water tankers, two coaster buses and 15 Armoured Personnel Car­riers (APCs) to aid strategic deployment of tactical squads to tackle insecurity across the length and breadth of the country, especially in the cri­sis affected areas.\nThis is in a bid to restrategise for better security networking in Nigeria.\nThe IGP, who has reiterated his commitment to continual­ly provide necessary welfare and safer environment for po­lice operatives at the forefront in crisis areas, immediately directed that the logistics and assets be made available for the ongoing serial operations being executed by the police at strategic locations in the county.\nAlso, IGP Usman Alkali Baba, has released adequate funds to upgrade the police ICT platforms to the required status, capable of combating the present security issues and realities in Nigeria as such will go a long way in alleviating the operational challenges of police troops on various tactical operations in Nigeria."
  },
  {
    "headline": "Bode George: I Do Not Agree With Atiku, Zoning is Necessary to Appease The Minds of The Masses",
    "summarized_story": "The former Deputy National Chairman of the Peoples Democratic Party – the PDP, Chief Bode George, has warned that any attempt to jettison the PDP zoning arrangement, will affect the party’s chances in 2023.\nCiting Section 7 sub-section 3(c) of the party’s Constitution, he noted that in the spirit of equity, fairness and justice, the PDP must zone the presidential ticket of the party to the South East.\nRecalling how the founding fathers of the PDP came up with the idea of zoning, he said the leaders took the decision to ensure equity and fairness just as he urged the National Working Committee of the party not to ignore it.\nGeorge, who was a member of the PDP zoning committee, said the zoning committee urged the National Executive Committee, NEC, of the PDP “to listen and feel the pulse of the people on the issue”.\nChief Bode George, Former Deputy National Chairman of the Peoples Democratic Party is our guest."
  },
  {
    "headline": "10-Year-Old In Sex Scandal + Apostle Suleman Castigates Igbos – Trending With Ojy Okpe",
    "summarized_story": "Reactions have trailed the sex scandal that has dominated the social media space in Nigeria.\nOn Monday the mother of a 10-year-old student of Chrisland School took to social media to claim that her daughter was raped during a trip to Dubai which was organised by the School.\nMeanwhile, the authorities of Chrisland School have reacted to the sex tape scandal stating that no rape or pregnancy test was carried out on any of the pupils as widely claimed and also countered that there was no rape involved in the infamous sex scandal.\nIn another development, the Governor of Imo State Hope Uzodinma on Monday absolved President Muhammadu Buhari over the spate of insecurity in the State.\nFinally, Clergyman Apostle Johnson Suleman in a recent sermon blamed the disunity amongst the Igbos on the Igbo people themselves"
  },
  {
    "headline": "Bode George: PDP Must Zone the Presidential Ticket",
    "summarized_story": "The former Deputy National Chairman of the Peoples Democratic Party – the PDP, Chief Bode George, has warned that any attempt to jettison the PDP zoning arrangement, will affect the party’s chances in 2023.\nCiting Section 7 sub-section 3(c) of the party’s Constitution, he noted that in the spirit of equity, fairness and justice, the PDP must zone the presidential ticket of the party to the South East.\nRecalling how the founding fathers of the PDP came up with the idea of zoning, he said the leaders took the decision to ensure equity and fairness just as he urged the National Working Committee of the party not to ignore it.\nGeorge, who was a member of the PDP zoning committee, said the zoning committee urged the National Executive Committee, NEC, of the PDP “to listen and feel the pulse of the people on the issue”.\nChief Bode George, Former Deputy National Chairman of the Peoples Democratic Party is our guest."
  },
  {
    "headline": "‘Buhari Has Done a Terrible Job as President of Nigeria’- Bishop Matthew Kukah",
    "summarized_story": "Yesterday, the Presidency of Nigeria reacted to the criticism of the Catholic Bishop of Sokoto Diocese, Reverend Matthew Hassan Kukah, who in his Easter message titled, ‘To mend a broken nation: The Easter metaphor’, had alleged that every aspect of life in the country had been destroyed while corruption was enthroned under President Muhammadu Buhari.\nThe bishop, who also criticised the president over his government’s “inability to tackle insecurity and corruption”, further claimed that President Buhari had divided Nigerians on the basis of ethnicity, religion, and region.\nIn a press release by Femi Adesina, Special Adviser to the President on Media and Publicity, he said that “For a man who has been spreading hate for decades, nothing new in the homily, except for the fact that while millions of Christians were remembering the Lord’s crucifixion on Friday, His descent on Saturday, His resurrection on Sunday, and subsequent appearance to his disciples, Bishop Matthew Kukah was playing politics.\nFrom his pulpit he devoted his Easter message not to Christ’s death and rebirth so Man might be saved – but to damning the government in the most un-Christian terms.\nOur guest is Reverend Matthew Hassan Kukah, from Sokoto State of Northern Nigeria."
  },
  {
    "headline": "South Africa Deploys Troops to Help with Flood Relief Efforts",
    "summarized_story": "South Africa’s armed forces have been deployed to help with relief efforts in the KwaZulu-Natal province, where more than 440 people died following torrential rains that triggered floods and mudslides last week.\nThe South African National Defence Force (SANDF) said it had been instructed to activate 10,000 troops for tasks including mop-up work and transporting aid.\nThe floods have left thousands homeless, knocked out power and water services and disrupted operations at one of Africa’s busiest ports, Durban.\n‘Extensive damage’Swathes of eThekwini, the municipality that includes Durban, remain without power or water, and the province said it could take time before services are restored.\nThe floods have left thousands homeless, knocked out power and water services and disrupted operations at one of Africa’s busiest ports, Durban."
  }
]