[
  {
    "headline": "Bees attack mourners at Alaafin’s palace",
    "summarized_story": "Some residents of Oyo town who thronged the Oyo Palace to mourn the death of the Alaafin of Oyo, Oba Lamidi Adeyemi on Saturday were stung by bees.\nThis happened around 10 am after Islamic clerics had arrived at the palace in preparation for the burial of Oba Adeyemi, who died on Friday night.\nOur correspondent observed that to ward off the attacking bees, residents in the open space in the palace who were affected plucked tree branches and leaves to drive the unwanted creatures away.\nA policeman was one of the victims and some of the mourners assisted him to drive away the bees and removed some of the insects which got stuck in his uniform.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Oyo Chief Imam, others arrive palace for Alaafin’s burial",
    "summarized_story": "The Chief Imam Of Oyo State, Masud Ajokidero, has led other members of the Oyo State League of Imams to the Alaafin of Oyo’s Palace for the burial of Oba Lamidi Adeyemi III.\nThe remains of the Alaafin of Oyo, Oba Lamidi Adeyemi III, would be buried today, The PUNCH has learnt.\nThe Head of Oyo Mesi, who is the Prime Minister of Oyo Kingdom, High Chief Yusuf Ayoola, said added, “We have called the Imam.\nThe Governor of Oyo State, Seyi Makinde, is expected to make an official announcement of the death soon.\nThe late Alaafin of Oyo was from the Adeyemi branch of the Alowolodu family."
  },
  {
    "headline": "King Hakbal: Styling Royalties",
    "summarized_story": "What inspired the King Hakbal brand?\nThese are the major reasons that inspired the King Hakbal Royal Bespoke brand.\nWho is the perfect King Hakbal Lion Man?\nThe perfect King Hakbal Lion Man is one that is fearless in the pursuit of what sets his soul on fire.\nA King Hakbal Lion Man is also one that sees himself as a King at heart; a driven- man who puts his money where his mouth is."
  },
  {
    "headline": "King Hakbal: Styling Royalties",
    "summarized_story": "What inspired the King Hakbal brand?\nThese are the major reasons that inspired the King Hakbal Royal Bespoke brand.\nWho is the perfect King Hakbal Lion Man?\nThe perfect King Hakbal Lion Man is one that is fearless in the pursuit of what sets his soul on fire.\nA King Hakbal Lion Man is also one that sees himself as a King at heart; a driven- man who puts his money where his mouth is."
  },
  {
    "headline": "Aisha Gambo: In Pursuit of Sustainable Development",
    "summarized_story": "As president of Nowa, what major initiative have you embarked upon to improve the lives of members of your organisation?\nThere is always room for NOWA members in the NOWA organization.\nIn what ways do you cater to both the developmental and moral growth of women and children left behind by late officers?\nWe also give work opportunities when the chance arises.\nHow do you balance being at the head of a property development and interior decorating company at the same time?"
  },
  {
    "headline": "Aisha Gambo: In Pursuit of Sustainable Development",
    "summarized_story": "As president of Nowa, what major initiative have you embarked upon to improve the lives of members of your organisation?\nThere is always room for NOWA members in the NOWA organization.\nIn what ways do you cater to both the developmental and moral growth of women and children left behind by late officers?\nWe also give work opportunities when the chance arises.\nHow do you balance being at the head of a property development and interior decorating company at the same time?"
  },
  {
    "headline": "IWD: Women who broke glass ceilings",
    "summarized_story": "In honour of Women’s History Month, we celebrate ten Nigerian historic firsts that broke barriers so that other women could dare to dream.\nShe was a foundation student of University College Ibadan, from where she got a scholarship to Cambridge University as the first Nigerian female student.\nShe became a professor of Mathematical Education, then the first female Nigerian Vice-Chancellor of the University of Benin.\nShe is the first female Senior Advocate of Nigeria and the first Nigerian female lawyer to wear the silk gown as Senior Counsel.\nShe remains the only woman to compete at both the FIFA Women’s World Cup as a footballer and the Olympics as a track and field athlete."
  },
  {
    "headline": "Alaafin: Makinde confirms death of Oyo traditional ruler",
    "summarized_story": "Governor Seyi Makinde of Oyo State has confirmed the death of the Alaafin of Oyo, Oba Lamidi Olayiwola Adeyemi.\nMakinde, who is the chief announcer and the Governor of the State, said he had been informed about the death of the traditional ruler.\nHe declared that the death of the traditional ruler is a huge loss to the State, Nigeria and the Yoruba race.\n“I equally commiserate with the Oloris, children and entire Adeyemi family on the demise of their patriarch and worthy father.\n“Oba Adeyemi was our last man standing in the rank of most eminent royal fathers with long years of leadership”."
  },
  {
    "headline": "Chrisland video: ‘What’s the outcome of investigation’ – Nigerians query Lagos govt",
    "summarized_story": "Nigerians have queried the Lagos State government over the reopening of Chrisland schools barely a week after it was shut down.\nGovernor Babajide Sanwo-Olu ordered that Chrisland school be shut on April 18, after controversies following a video of a female student involved in sexual activity with male students in Dubai.\nHere are some comments gathered by DAILY POST:@FisayoSoyumbo “Closing Chrisland Schools, what exactly was it meant to achieve in the first place?\nChrisland School cannot be exonerated.\nSet rules and follow them strictly.”@Stanleyonuajah “Government is reopening Chrisland Schools in Lagos."
  },
  {
    "headline": "Alaafin: Oba Adeyemi was a force to be reckoned with – Oluwo",
    "summarized_story": "The Oluwo of Iwo, Oba Abdulrosheed Adewale Akanbi, has described the late Alaafin of Oyo, Oba Lamidi Adeyemi III as a force to be reckoned with and a true and responsible father to the Yoruba nation.\nThe Oluwo also described the demise of the revered Yoruba monarch as the end of an era.\nAccording to him, “I visited Baba Alaafin last week when my mind got attracted to him.\nThe traditional ruler, who revealed that from this interactions with Oba Adeyemi, he served Oyo and his people wholeheartedly till the very end, added that he will continue to adore him by promoting his achievements.\nWhile condoling with the family he left behind, the Oyomesi, Oyo town, the State and Nigeria, Oba Abdulrosheed also prayed for the repose of the soul of the renowned monarch."
  },
  {
    "headline": "FCT: Bwari Council chairman involved in ghastly accident",
    "summarized_story": "John Gabaya, chairman, Bwari Area Council, Federal Capital Territory (FCT), Abuja, has been involved in a ghastly motor accident.\nDetails of the accident are not known as of the time of filing the story.\nIt happened within the Bwari area on Friday.\nA source told DAILY POST that the chairman has been rushed to an undisclosed hospital for treatment as he sustained injuries on his legs.\nThe chairman is due to be sworn in on 29th May, 2022 for a second term, having won the last council poll under the Peoples Demo6ractic Party, PDP."
  },
  {
    "headline": "It’s like a dream – Obasanjo reacts to Alaafin’s death",
    "summarized_story": "Former President Olusegun Obasanjo has reacted to the passing of the Alaafin of Oyo, Oba Lamidi Adeyemi.\nThe former president, who described the late Alaafin as a symbol of the nation’s epic struggle in self discovery and self actualisation, said the Oba was a fervent promoter of mutual tolerance.\nIn a letter to the Oyo State Governor, Seyi Makinde, Obasanjo, who is presently in Ethiopia, condoled with the family of the late Oba and the entire people of Oyo.\n“Like most great leaders, Alaafin was all things to all people.\n“In fact, we ought to give gratitude to God for his worthy life,” Obasanjo said, praying God to grant his family and the entire Oyo State the grace to bear the heavy loss of his death."
  },
  {
    "headline": "JUST IN: Five injured as another explosion rocks Taraba",
    "summarized_story": "JUST IN: Five injured as another explosion rocks TarabaGet real time updates directly on you device, subscribe now.\nFive persons were injured on Friday evening when another bomb exploded in Jalingo, the Taraba State capital.\nAn eyewitness, Danlami Kwambo, told The Nation the explosion occurred around 7:30 pm at the palace of the Ward Head in Nukkai area of Jalingo.\nHe said youths in the area went on rampage over the incident before the intervention of some elders in the area calmed the situation.\nTaraba experienced an explosion a few days ago in Iware, Ardo Kola LGA which killed six persons and left several injured.."
  },
  {
    "headline": "BREAKING: Alaafin joins ancestors at 83",
    "summarized_story": "Get real time updates directly on you device, subscribe now.\nThe Alaafin of Oyo, Oba Lamidi Adeyemi, has joined his ancestors.\nPalace officials said he died on Friday night at the Afe Babalola University Teaching Hospital, Ado Ekiti.\nHis remains were received at Idi-Igba in Oyo town in the early hours of Saturday, The Nation learnt.\nBy tradition, the head of the Oyomesi, Basorun of Oyo, High Chief Yusuf Akinade Ayoola, would take over pending the appointment of a new Alaafin."
  },
  {
    "headline": "2023: I can’t declare for presidency yet, process ongoing – Jonathan",
    "summarized_story": "Supporters of former President Goodluck Jonathan, who are pressuring him for another shot at the presidency in 2023, will have to wait for more time to know his decision.\nHe said the “political process is ongoing”, hence his inability to give a firm response to their agitation yet.\nI cannot tell you I’m declaring; the political process is ongoing.\nThat is why we want you to declare and contest.”Some of the placards read: “Goodluck, declare now”; “We are sorry, Goodluck don’t abandon us, come back”; “Goodluck, please come”; “Goodluck, we love you” among many others.\nThe CECPC however denied that it was trying to drag Jonathan into the party or the 2023 presidential race."
  },
  {
    "headline": "PDP ticket: Consensus a scam, says Wike",
    "summarized_story": "Wike, who is one of the aspirants seeking the PDP presidential ticket, said he would never be sucked in by such a move.\nWike, speaking on BBC Pidgin ahead of the PDP presidential primaries, declared that only death could abort his participation in the election.\n“I did not visit Governor Godwin Obaseki because that was not where the People’s Democratic Party (PDP) sent me.\nAddressing Ebonyi State PDP delegates at the party’s state secretariat in Abakaliki, Wike said: “Every consensus must be based on equity, fairness and justice as propagated by my brother Governor of Enugu State, Rt.\nHowever, he was introduced as the state chairman of the party and mounted the podium to address Wike and members present."
  },
  {
    "headline": "Ogunbayo joins the league of 50",
    "summarized_story": "Get real time updates directly on you device, subscribe now.\nTHE Chief Executive Officer of A-Plus Enterprises, Mrs. Eunice Abimbola Ogunbayo, was full of joy as she turned 50 on April 12.\nA church service was held at Emmanuel Anglican Church, Sabo, Sagamu, and the auditorium was filled with royal fathers, politicians, pastors, and captains of industries.\nShe was praised for her determination to succeed in whatever she does and for her love for God as well as people.\nOgunbayo also enjoyed the support of her realtor husband Otunba Peter Oluwole Ogunbayo."
  },
  {
    "headline": "Just In: Alaafin of Oyo confirmed dead",
    "summarized_story": "From Oluseye Ojo, IbadanThe Alaafin of Oyo, Oba Lamidi Olayiwola Adeyemi III, has joined his ancestors at the age of 82 after reigning as king for 52 years.\nBode Durojaiye, confirmed to The Sun at 6:55a.m today Saturday April 23, 2022, that Oba Adeyemi is dead.\nThere are many people that have stormed the palace at Oke-Afin in Oyo town.\nOba Adeyemi was said to have gone to the teaching hospital for routine medical check-up before death allegedly caught up with him at the facility.\nHis paternal grandfather, according to historians, was Alaafin Adeyemi I Alowolodu, who ruled during the Kiriji War, and was the last independent ruler of the Oyo Empire before British colonialism."
  },
  {
    "headline": "LASG reopens Chrisland Schools as academic activities begins on Monday",
    "summarized_story": "By Gabriel DikeThe Lagos State Ministry of Education on Saturday directed that all Chrisland Schools shut for alleged misconduct of some pupils in Dubai be reopened from Monday April 25th, 2022.\nDo not miss the Vital Information, it goes off in 2 days!\nShe said the state government shut the schools for safety of students and the staff and to ensure unhindered investigation of the incident.\nAccording to her, the ministry of education and other relevant agencies of the state, in conjunction with the school’s Parent Teachers Association, will be working on a scheduled psychosocial support for the students.\nSaid she: “An extensive assessment of the school’s procedure, especially on external trips and excursions, is being made to identify safety gaps and prevent such incidents."
  },
  {
    "headline": "Alaafin rumoured death “fake news”-Media aide",
    "summarized_story": "The Alaafin of Oyo Oba Lamidi Adeyemi 111 is not dead, so his media aide ‘Bode Durojaiye has said.\nIt was earlier reported that the top Yoruba monarch has passed on,Are you a Man 40 yrs and above?\nAlaafin Adeyemi, the third from the Alowodu Ruling House, was alleged to have died in the late hours of Friday at the Afe Babalola University Teaching Hospital, Ado Ekiti, the capital of Ekiti State in South-West Nigeria.\n“Members of the public are hereby urged to disregard the unfounded report , as the Paramount Ruler is hale and hearty .\n“The general public should not entertain any fear at all, as IKu Baba Yeye is healthy, physically fit and mentally stable.”"
  },
  {
    "headline": "2023: Give me more time, I’m still consulting, Jonathan begs supporters",
    "summarized_story": "While persuading him to declare for the 2023 presidential poll, the supporters took turns to ask him to return to office in 2023, promising to work for his victory at the polls.\nThey carried placards with various inscriptions like ‘Goodluck Jonathan, you must run;’ ‘We need you to restore Nigeria, among others.\nSo, we will continue to encourage you to get involved in the political process, and as long as many youths get involved in the political process, we will be able to get the government that we want.\nThe political process is ongoing.\nOnly recently, some groups like the Nigerian Young Professionals in Diaspora (NYPD), gave Jonathan one week ultimatum to declare for 2023 Presidential race or risked litigation."
  },
  {
    "headline": "2023: Ohanaeze begins screening of Igbo presidential aspirants next week",
    "summarized_story": "From Magnus Eze and Geoffrey Anyanwu, EnuguAhead of political parties’ primaries for the 2023 general elections, Ohanaeze Ndigbo Worldwide has disclosed that it would next week commence screening for a consensus aspirant to be supported for the Presidency from the South East.\nOgbonnia said Ohanaeze would not allow its sons and daughters take suicidal actions in the primaries of the political parties by fielding several aspirants.\nGiving indications on the plans and efforts of Ohanaeze Ndigbo in actualizing a President of Igbo origin next year, Ogbonnia said: “By next week we will begin to look into the issue of consensus.\nOhanaeze, he said, was waiting for the aspirants to conclude buying forms so that they would be able to know who the actual aspirants are and the political parties they intend to pursue their ambition.\n“It is for this reason that I call on all political parties in the country, to zone the Presidency to the South East,” he counselled."
  },
  {
    "headline": "Breaking : Alaafin, Oba Lamidi Adeyemi, Dies at 83",
    "summarized_story": "By Kemi OlaitanThe Alaafin of Oyo, Oba Lamidi Adeyemi, is dead.\nAdeyemi, the third from the Alowodu Ruling House, died in the late hours of Friday at the Afe Babalola University Teaching Hospital, Ado Ekiti.\nThe monarch had been sick and a plan had been made to fly him abroad before he passed on late Friday night.\nA source familiar with the medical travel plan said his tickets and those of a few wives were already procured.\nWith the demise of Oba Adeyemi, it is now the turn of the Agunloye Ruling House to produce the next Oyo monarch as his predecessor, Bello Ladigbolu, was from the Agunloye House."
  },
  {
    "headline": "2023: Under Pressure Jonathan Hints at Contesting, Tells Supporters to ‘Watch out’",
    "summarized_story": "‘I cannot tell you I’m declaring; the political process is ongoing’Adedayo AkinwaleFormer President Goodluck Jonathan yesterday in Abuja came under intense pressure from his supporters, urging him to contest for president in 2023 and he did not disappoint, telling them that “the political process is ongoing; just watch out.\njust watch out.”The supporters, comprising largely women and youths, stormed the Jonathan Foundation’s Abuja office, chanting his name, forcing him to come out to address them.\nThe supporters, who demanded the return of Jonathan as President in 2023, arrived in four buses and displayed placards at Jonathan’s Taraba Close, Maitama office.\nSome of the placards read, “Goodluck declare now”; “We are sorry, Goodluck don’t abandon us, come back”; “Goodluck please come”; and “Goodluck we love you”, among others.\n“We want Jonathan to run under the Nigeria Peoples Party."
  },
  {
    "headline": "Osinbajo Takes Campaign to Ibadan, Upbeat about Becoming Next President",
    "summarized_story": "On arrival in Ibadan, the Vice President received a rousing reception right from the airport and on the streets by excited residents.\nComing after Osinbajo declared his intention to contest the 2023 presidential election on the platform of the APC last week Monday, the vice president intimated the Monarch of his intention to run for president.\nThe Vice President said: “I have followed you very closely.\nThe Deputy Governor also joined the vice president for the visit to the Olubadan.\nMembers of the National Assembly with the Vice President besides Folarin, included Senator Adamu Bukkachuwa, Kola Balogun, Fatahu Muhammad, Odebunmi Olusegun, Shehu Saleh Rijau and Karu Simon."
  },
  {
    "headline": "Northern PDP Consensus Arrangement Collapses, Tambuwal Pulls out, Set for Primary",
    "summarized_story": "Governor Aminu Tambuwal of Sokoto State has pulled out of the drive by the northern Peoples Democratic Party to produce consensus candidate for the 2023 presidential election.\nThis came just as news emerged that former Senate President Bukola Saraki and Bauchi State Governor Bala Mohammed had emerged PDP consensus candidates for the North.\nA statement by the Tambuwal Campaign Organization (TCO) Friday said the team met on Wednesday at Bauchi Governor’s Lodge in Abuja for a review and unanimously agreed that the consensus arrangement was not working.\nThe statement read: The attention of Tambuwal Campaign Organization (TCO) has been drawn to a news item that former Senate President, Bukola Saraki and Gov.\n“Members of the public should be reminded that what was canvassed for was a consensus candidate and not consensus candidates."
  },
  {
    "headline": "Buhari: Military Not Doing Enough to End Insecurity Despite Logistics Provided",
    "summarized_story": "Buhari frowned on the fact that his previous directives to the military to end insecurity in the country had not yielded much results.\nMonguno said there was no way the president would be happy, when people were being killed on a daily basis.\nThe NSA added that the president was of the belief that enough was not being done by the security agencies, despite the logistics being provided.\n“A lot of lives are being lost, the president is not happy about this situation, he’s made it very clear.\nHe condemned the recent spate of attacks on police officers, facilities and other police operational assets across the country."
  },
  {
    "headline": "BREAKING: Top Yoruba Monarch, Alaafin Of Oyo, Is Dead",
    "summarized_story": "The Alaafin of Oyo, Lamidi Adeyemi, has passed on, a report by PREMIUM TIMES said.\nAlaafin Adeyemi, the third from the Alowodu Ruling House, died in the late hours of Friday at the Afe Babalola University Teaching Hospital, Ado Ekiti, Ekiti State.\nHis death came after the two other senior Oyo State monarchs – the Olubadan of Ibadan, Saliu Adetunji, and the Soun of Ogbomoso, Jimoh Oyewumi – died.\nA new Olubadan has been installed but the Soun remains vacant.\nWith the demise of Alaafin Adeyemi, it is now the turn of the Agunloye Ruling House to produce the next Oyo monarch."
  },
  {
    "headline": "BREAKING: Top Yoruba Monarch, Alaafin Of Oyo, Is Dead",
    "summarized_story": "The Alaafin of Oyo, Lamidi Adeyemi, has passed on, a report by PREMIUM TIMES said.\nAlaafin Adeyemi, the third from the Alowodu Ruling House, died in the late hours of Friday at the Afe Babalola University Teaching Hospital, Ado Ekiti, Ekiti State.\nHis death came after the two other senior Oyo State monarchs – the Olubadan of Ibadan, Saliu Adetunji, and the Soun of Ogbomoso, Jimoh Oyewumi – died.\nA new Olubadan has been installed but the Soun remains vacant.\nWith the demise of Alaafin Adeyemi, it is now the turn of the Agunloye Ruling House to produce the next Oyo monarch."
  },
  {
    "headline": "EXCLUSIVE: How Nigerian Ports Authority Managing Director, Koko Bought £1.75Million Mansion In London While ‘Serving As Amaechi’s Bank Account Officer’",
    "summarized_story": "SaharaReporters gathered that the Kebbi state-born banker was the Zenith Bank accounts officer to Rivers state government when Rotimi Amaechi was governor.\n“During his term as governor of Rivers State, Amaechi routinely broke his own procurement laws and awarded contracts involving large sums of money to many questionable causes and invisible services.\nUsing several personal and corporate proxies, hundreds of billions of Rivers State taxpayers' monies were simply siphoned off the state’s coffers by his cronies.\nAs a reward for continued cooperation and connivance for such corrupt deals, Mr. Amaechi recently ensured the promotion of Mr. Bello-Koko to the post of CEO of the NPA.\nThe same individual received N430 million in cash payments from the same bank a few weeks later."
  },
  {
    "headline": "EXCLUSIVE: How Nigerian Ports Authority Managing Director, Koko Bought £1.75Million Mansion In London While ‘Serving As Amaechi’s Bank Account Officer’",
    "summarized_story": "SaharaReporters gathered that the Kebbi state-born banker was the Zenith Bank accounts officer to Rivers state government when Rotimi Amaechi was governor.\n“During his term as governor of Rivers State, Amaechi routinely broke his own procurement laws and awarded contracts involving large sums of money to many questionable causes and invisible services.\nUsing several personal and corporate proxies, hundreds of billions of Rivers State taxpayers' monies were simply siphoned off the state’s coffers by his cronies.\nAs a reward for continued cooperation and connivance for such corrupt deals, Mr. Amaechi recently ensured the promotion of Mr. Bello-Koko to the post of CEO of the NPA.\nThe same individual received N430 million in cash payments from the same bank a few weeks later."
  },
  {
    "headline": "EXCLUSIVE: How Nigerian Ports Authority Managing Director, Koko Bought £1.75Million Mansion In London While ‘Serving As Amaechi’s Bank Account Officer’",
    "summarized_story": "SaharaReporters gathered that the Kebbi state-born banker was the Zenith Bank accounts officer to Rivers state government when Rotimi Amaechi was governor.\n“During his term as governor of Rivers State, Amaechi routinely broke his own procurement laws and awarded contracts involving large sums of money to many questionable causes and invisible services.\nUsing several personal and corporate proxies, hundreds of billions of Rivers State taxpayers' monies were simply siphoned off the state’s coffers by his cronies.\nAs a reward for continued cooperation and connivance for such corrupt deals, Mr. Amaechi recently ensured the promotion of Mr. Bello-Koko to the post of CEO of the NPA.\nThe same individual received N430 million in cash payments from the same bank a few weeks later."
  },
  {
    "headline": "PHOTOS: Sympathisers throng Oyo palace over Alaafin's death",
    "summarized_story": "Sympathisers have thronged the palace of Lamidi Adeyemi, the late Alaafin of Oyo, to pay their last respect.\nThe longest-reigning monarch passed away on Friday night at Afe Babalola Teaching Hospital, Ado Ekiti.\nWhen TheCable visited the palace in Oyo, sympathisers were seen outside and within the compound.\nA condolence register has been opened at the palace.\nAdvertisementThe burial of the late monarch will take place by 4pm today."
  },
  {
    "headline": "PHOTOS: Sympathisers throng Oyo palace over Alaafin's death",
    "summarized_story": "Sympathisers have thronged the palace of Lamidi Adeyemi, the late Alaafin of Oyo, to pay their last respect.\nThe longest-reigning monarch passed away on Friday night at Afe Babalola Teaching Hospital, Ado Ekiti.\nWhen TheCable visited the palace in Oyo, sympathisers were seen outside and within the compound.\nA condolence register has been opened at the palace.\nAdvertisementThe burial of the late monarch will take place by 4pm today."
  },
  {
    "headline": "Alaafin of Oyo to be buried today, says palace",
    "summarized_story": "Lamidi Adeyemi, Alaafin of Oyo, will be buried today.\nHe also disclosed that the monarch will be buried at 4pm today.\nBaba will be buried today around 4pm,” he said.\nTo prepare him for the throne, Adeyemi lived in several palaces in some parts of Yoruba land.\nAyoola as Bashorun of Oyo will take over pending the appointment of a new Alaafin."
  },
  {
    "headline": "Alaafin of Oyo to be buried today, says palace",
    "summarized_story": "Lamidi Adeyemi, Alaafin of Oyo, will be buried today.\nHe also disclosed that the monarch will be buried at 4pm today.\nBaba will be buried today around 4pm,” he said.\nTo prepare him for the throne, Adeyemi lived in several palaces in some parts of Yoruba land.\nAyoola as Bashorun of Oyo will take over pending the appointment of a new Alaafin."
  },
  {
    "headline": "Kola Abiola: My opinion on Hafsat comparing my father to Yahaya Bello not for public",
    "summarized_story": "Kola Abiola, son of the late MKO Abiola, says he will not react publicly to the recent comment by his sister comparing their father to Yahaya Bello, governor of Kogi.\nThe Kogi governor’s campaign slogan is ‘Hope 2023’, which is similar to the slogan used by Abiola during the 1993 presidential election campaign.\nSpeaking on her appointment, Hafsat had said she accepted it because the Kogi governor shares some qualities with that of her father.\nAdvertisementBut reacting to the development, Tundun Abiola — another daughter of Abiola — said Hafsat does not have the right to “exploit” their father’s name for Bello’s benefit.\nIt’s to protect that, and not just to protect that, but to protect what MKO himself stands for,” he said."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Google’s Africa internet cable arrives in Lagos, Nigeria",
    "summarized_story": "Google has announced that earlier today, Equiano, a subsea internet cable running through Portugal to South Africa landed in Lagos, Nigeria.\nThis announcement is coming a month after Equiano first landed on the African continent in Togo.\nThe project, which is named after Nigerian-born writer and abolitionist Olaudah Equiano, is expected to help support further digital transformation in Nigeria, a country with a thriving tech ecosystem.\n“Google is committed to supporting Africa’s digital transformation and we are excited to see the impact of the landing of Equiano in Nigeria,” Juliet Ehimuan, Director, West Africa at Google said.\nLast October, Google CEO Sundar Pichai announced a plan to invest $1billion over 5 years to support digital transformation in Africa, of which project Equiano is part."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, It's the weekend again, and I've been looking forward to it!\nFirst off, thank you for sticking with me...."
  },
  {
    "headline": "Say goodbye to clout chasing on the gram",
    "summarized_story": "AdvertisementWhen you compare this to, say, California, United States – which has an estimated 630,000 developers – you’ll see that this is a problem.\nInstagram prioritises originalityAdam Mosseri, Instagram CEO, announced on Wednesday, April 20, 2022, that the company will change its ranking algorithm to emphasise original content more prominently on its platform.\nThis would also help to prioritise the distribution of original content over reposted content in places like the Reels tab and feed.\nWe’re going to do more to try and value original content more, particularly compared to reposted content,” he says.\nWhat’s more, Mosseri mentioned two recent product launches: product tagging and enhanced tagging."
  },
  {
    "headline": "What you need to know as Google’s Equiano cable lands In Nigeria",
    "summarized_story": "Share this article:Google has announced the launch of Equiano, a state of the art submarine Internet cable, which is set to land in Lagos, Nigeria.\nThe Internet cable, named after Olaudah Equiano, a historical abolitionist, has a capacity of 144 terabits (18 Terabytes).\nOne of the landmark moments was in 2009, during the launch of the MainOne submarine cable, a private submarine cable that today spans Nigeria, Ghana, and Cote d’Ivoire.\nThere’s a vast submarine cable capacity in Africa that still doesn’t reflect on your download speeds or streaming quality.\nAs of 2020, Africa had a submarine cable capacity of 100 Tbps, but it was only using 10%."
  },
  {
    "headline": "Blockchain-powered insurance: Meet the decentralised insurance protocol, Etherisc, insuring Kenyan farms against bad climate",
    "summarized_story": "Share this article:The concept of decentralised insurance became a theoretical possibility with the emergence of decentralised finance (DeFi).\nWhile DeFi platforms continue to offer borrowing, lending, and staking services, Etherisc, an open-source, decentralised insurance protocol, brings affordable insurance to African farmers away from the complex DeFi protocols.\nFrom traditional insurance to decentralised insuranceEtherisc team with Keyan localsBerende has been in the insurance space since the early 2000s.\nAccording to the Africa Insurance Pulse 2022, insurance penetration in Africa stood at 2.78%, a decline from 2.98% in the previous year.\nHowever, satellite data is not as precise as data obtained from the ground when measuring precipitation."
  },
  {
    "headline": "Alaafin of Oyo, Oba Lamidi Adeyemi is dead",
    "summarized_story": "Oba Lamidi Adeyemi,the Alaafin of Oyo, is dead.\nSeyi Makinde, Governor of Oyo State, is expected to make an official announcement upon receiving the report of the monarch’s passing from the Bashorun of Oyo, Yusuf Akinade, who will now lead Oyo before a new Alaafin is announced.\nWith the demise of Alaafin Lamidi Adeyemi, it is now the turn of the Agunloye Ruling House to produce the next Oyo monarch.\nAdeyemi became the Alaafin of Oyo in November 18, 1970, succeeding Oba Gbadegesin Ladigbolu I, during the governorship of Colonel Robert Adeyinka Adebayo, after the civil war.\nThe Alaafin of Oyo is survived by Ayaba Abibat Adeyemi, his senior wife popularly known as Iya Adodo; junior wives including; Ayaba Rahmat Adedayo Adeyemi, Mujidat Adeyemi, Rukayat Adeyemi,Folashade Adeyemi, Badirat Ajoke Adeyemi, Memunat Omowunmi Adeyemi, Omobolanle Adeyemi, Moji Adeyemi, Anuoluwapo Adeyemi, Damilola Adeyem and numerous children."
  },
  {
    "headline": "Naira gains after Emefiele insists on managed float FX regime",
    "summarized_story": "Nigeria’s currency on Friday gained 0.28 percent against the dollar at the official market, a day after Godwin Emefiele, governor of the Central Bank of Nigeria insisted on a managed float exchange rate regime.\nMost currency dealers who participated in the auction maintained bids between N410.00 (low) and N444.00 (high) per dollar.\nOn the CBN’s website, the exchange rate stood at N416.08/$ as at April 21, 2022, while at the parallel market, naira exchanged with the dollar at N587 on Friday.\nAfrica’ largest economy’s gross official reserves declined by $317m (-0.8%) month/month to $39.5 billion in March 2022.\nForeign exchange reserves have been under pressure following Nigeria’s low crude oil output, which has been exacerbated by oil theft and pipeline vandalisation."
  },
  {
    "headline": "Chinelo, doctor slain in Kaduna train attack, laid to rest",
    "summarized_story": "Twenty-nine-year-old Chinelo Megafu lost her life in the terror attack on a Kaduna-bound train from Abuja on March 28, 2022.\n“Here we gather at this service, conducting her funeral because some bandits decided to attack the train she boarded.\nRead also: Train attack: Victims’ families lament neglect by government“If these were foreign armies ravaging our land, do we really have an army to defend us?” he asked.\nI have also forgiven the country that enabled all these to happen.”“Frankly, the past three weeks have been quite traumatic.\nNow ruminating over some things, I just discovered that Chinelo had a way of becoming first in many areas."
  },
  {
    "headline": "Obaseki, police partner to tackle land grabbing, others in Edo – Nigerian Observer",
    "summarized_story": "Obaseki disclosed this when he received the new Edo Commissioner of Police, Abutu Yaro.\nHe said, “I thank the IGP for deploying two police special squads to Edo State.\nThis squad will deal with community issues and issues of land grabbing.\n“We are dealing with the issue of land grabbing squarely as it is impeding development in Edo State.\nWe must have a peaceful election; both pre and post-electioneering activities must be peaceful in Edo State."
  },
  {
    "headline": "Obaseki identifies tourism sector as critical to nation’s economic diversification – Nigerian Observer",
    "summarized_story": "Obaseki gave the charge when he declared open the Edo State Tourism Key Stakeholders Workshop, at the John Odigie-Oyegun Staff Training Centre, in Benin City.\nWe have had to depend on hydro-carbon assets, oil and gas for the last 40 years to drive our economy.\nAnd one unique asset that we have as a state is tourism.\nEdo is strategically located and traffic must flow through the state and we must utilize it effectively to generate revenue for the state.\nTourism must begin at home; it’s local, and we must have strong tourism that is locally based to attract international tourists into the state."
  },
  {
    "headline": "‘Obaseki, a superlative performer, champion of Edo’s industrial revolution’ – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestConvener of the pro-development group, Esan Agenda, Mr. Akhere Obozele, has described the Edo State Governor, Mr. Godwin Obaseki as a superlative performer, hailing his strides in infrastructure and industrial revolution in the state.\nThe group noted that despite the paucity of funds facing states, Edo under the leadership of Governor Obaseki has become a huge construction site with several projects to improve the livelihood of Edo people and ensure economic prosperity for the state.\n“Apart from his commitment towards an infrastructural and industrial revolution in Edo State, one other area Governor Obaseki has hugely invested in is agriculture.\nThis has helped address food security as well as created thousands of jobs for citizens,” he noted.\nAkhere said, “Obaseki is a superlative performer with the interest of the majority of Edo people at heart."
  },
  {
    "headline": "Obaseki’s industrial reforms: Duport refinery to boost petrol, kerosene, CNG production in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Managing Director of Duport Midstream Company Limited, Dr. Akintoye Akindele, has said the Duport Energy Park will boost the production of naphtha, diesel, kerosene, CNG, LPG and LNG in the state, in furtherance of the state government’s industrialization drive.\nSimbi Kesiye Wabote, to the energy park complex in Egbokor, in Edo State.\nThe Duport Energy Park is the second refinery project in Edo State after the Edo Modular Refinery in Ologbo, which is a 6600bpd facility established through a joint venture between the Edo Refinery and Petrochemical Limited and AIPCC Energy Limited.\nWabote, on his part, said Duport Energy Park is the first integrated energy park in Nigeria, with a 2,500 barrels refinery, CNG Gas processing plant, 10 megawatts power plant, and a data centre.\nA member of the Board of Directors of the Duport Energy Park, Dr. Olatutu Sholeye, expressed delight at the work done, adding that it had created employment opportunities and built capacities among the teeming youth in the community."
  },
  {
    "headline": "Dangote Refinery will be ready before Buhari’s tenure ends – Dangote assures",
    "summarized_story": "Alhaji Aliko Dangote, chairman of the Dangote Group, has said that the Dangote Refinery would be ready for commissioning before President Muhammadu Buhari leaves office on May 29, 2023.\nDangote spoke to State House Correspondents on Friday after meeting with President Muhammadu Buhari at the Presidential Villa, Abuja.\nAsked when the refinery would be ready for operations, the Forbe’s Africa richest man said: “By the grace of God, Mr. President will come and commission before the end of his tenure”.\nYes, Ukraine and Russia have about 26% of the world’s potash but it does not mean that you cannot source potash elsewhere.\nSo, I’m here with my board of directors, just to show gratitude to Mr. President and he received us very well”."
  },
  {
    "headline": "Life and times of Alaafin of Oyo, prominent Yoruba monarch who died at 83",
    "summarized_story": "The Alaafin of Oyo, Oba Lamidi Adeyemi, has died, aged 83.\nHis remains were brought to Oyo town, 62 kilometres from Ibadan, the Oyo State capital, in the early hours of Saturday and traditional rites began.\nAlaafin Adeyemi was born Lamidi Olayiwola Atanda Adeyemi on October 15, 1938 into the Alowolodu Royal House of the famous Oyo town.\nDuring his reign, Oba Adeyemi permanently chaired the Oyo State Council of Obas and Chiefs.\nHis junior wives included Ayaba Rahmat Adedayo Adeyemi, Ayaba Mujidat Adeyemi, Ayaba Rukayat Adeyemi, Ayaba Folashade Adeyemi, Ayaba Badirat Ajoke Adeyemi, Ayaba Memunat Omowunmi Adeyemi, Ayaba Omobolanle Adeyemi, Ayaba Moji Adeyemi, Ayaba Anuoluwapo Adeyemi, and Ayaba Damilola Adeyemi."
  },
  {
    "headline": "Buhari approves reopening of Idiroko, Ikom, two other land borders",
    "summarized_story": "Muhammadu Buhari, Nigeria’s president, has ordered the immediate reopening of Idiroko border in Ogun State, Ikom border in Cross River, and two additional land borders.\nThe additional border posts reopened are Jibia (Katsina State) and Kamba (Kebbi State).\nPresident Buhari had in December 2020 opened the Seme, Mfun borders in the Southwest, Ilela and Maigatari borders in the Northwest.\nDeputy Comptroller-General of Customs, EI Edorhe, disclosed this in a circular on Friday issued behalf of the Comptroller General of Customs.\n“Consequently, all Customs formations and JBPTy are to take note and ensure that proper manning takes place in compliance with extant operational guidelines.”"
  },
  {
    "headline": "Court sacks ex-Speaker Yakubu Dogara from House of Reps",
    "summarized_story": "A Federal High Court in Abuja has sacked former speaker of the house of representatives, Yakubu Dogara, from the green chamber of the national assembly.\nThe court ordered the lawmaker on Friday, to vacate his seat as a member representing Dass, Tafawa Balewa and Bogoro Federal Constituency of Bauchi State.\nThe News Agency of Nigeria (NAN) reports that the PDP and one of its members in Bauchi State had, in a suit marked: FHC/ABJ/CS/1060/20, sued Dogara, the speaker of the House of Representatives.\nNAN on April 11, reported that the judgments, in the two separate suits filed against Dogara, were stalled due to the FHC’s Easter vacation.\nThe lawmakers comprise two House of Representatives members and 18 state House of Assembly members"
  },
  {
    "headline": "SERAP Vows To Sue Federal Govt Over Failure To End ASUU Strike",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) has said that it will drag the Federal Government to court for failing to end the ongoing strike action by the Academic Staff Union of Universities (ASUU).\nSERAP stated that the President Muhammadu Buhari administration’s failure to end the lingering ASUU strike was a violation of the legal obligation of the the government to provide access to Higher education.\nADVERTISEMENTThe civil society organisation, in a series of tweets on its verified Twitter handle on Friday wrote: “We’re suing the Buhari administration over its failure to end the strike action by ASUU, which is a violation of the legal obligation to provide access to higher education without discrimination.”Recall that ASUU embarked on a one-month warning strike on February 14, 2022, and extended it by another two months over the alleged failure of the Federal Government to fulfil its side of the agreements with ASUU."
  },
  {
    "headline": "Senator Ogbeha Leads Tambuwal’s Presidential Campaign",
    "summarized_story": "Aminu Waziri Tambuwal, has appointed Senator Tunde Ogbeha as the chairman of his presidential campaign organisation.\nTambuwal, in a statement by his special adviser on media and publicity, Muhammad Bello, said the appointment takes immediate effect.\nThe statement said, “Senator Ogbeha is expected to deploy his vast experience in administration, public policy and politics to the Campaign and will chair meetings of the Tambuwal Campaign Council.\n“Senator Tunde Ogbeha is a retired general from Kogi State Nigeria who was administrator of Akwa Ibom State and then of Bendel State during the military rule of General Ibrahim Babangida.\n“After leaving the Senate in 2007, Ogbeha became Chairman of the Confluence Cable Network, Kogi State’s first private broadcasting station."
  },
  {
    "headline": "Senator Ogbeha Leads Tambuwal’s Presidential Campaign",
    "summarized_story": "Aminu Waziri Tambuwal, has appointed Senator Tunde Ogbeha as the chairman of his presidential campaign organisation.\nTambuwal, in a statement by his special adviser on media and publicity, Muhammad Bello, said the appointment takes immediate effect.\nThe statement said, “Senator Ogbeha is expected to deploy his vast experience in administration, public policy and politics to the Campaign and will chair meetings of the Tambuwal Campaign Council.\n“Senator Tunde Ogbeha is a retired general from Kogi State Nigeria who was administrator of Akwa Ibom State and then of Bendel State during the military rule of General Ibrahim Babangida.\n“After leaving the Senate in 2007, Ogbeha became Chairman of the Confluence Cable Network, Kogi State’s first private broadcasting station."
  },
  {
    "headline": "Imo PDP Charged On Level Playing Ground For Aspirants",
    "summarized_story": "A member representing Orlu/Oru East/Orsu federal constituency of Imo State at the House of Representatives, Hon.\nJerry Alagboso, has called on the state chairman of the Peoples Democratic Party (PDP), Engr.\nCharles Ugwuh, to ensure that all aspirants are given a level-playing ground at the forthcoming party primaries.\nCharles Ugwu in piloting the affairs of the party since his emergence as the state party chairman.\nThe senatorial aspirant expressed gratitude to former Governor of Imo State Emeka Ihedioha and PDP national Secretary Senator Sam Daddy Anyanwu for restoring peace in Imo PDP."
  },
  {
    "headline": "Imo PDP Charged On Level Playing Ground For Aspirants",
    "summarized_story": "A member representing Orlu/Oru East/Orsu federal constituency of Imo State at the House of Representatives, Hon.\nJerry Alagboso, has called on the state chairman of the Peoples Democratic Party (PDP), Engr.\nCharles Ugwuh, to ensure that all aspirants are given a level-playing ground at the forthcoming party primaries.\nCharles Ugwu in piloting the affairs of the party since his emergence as the state party chairman.\nThe senatorial aspirant expressed gratitude to former Governor of Imo State Emeka Ihedioha and PDP national Secretary Senator Sam Daddy Anyanwu for restoring peace in Imo PDP."
  },
  {
    "headline": "Gunmen attack Kogi's Ogaminana police station, kill 3 cops",
    "summarized_story": "At least six gunmen killed three policemen on duty at Ogaminana police station, in Adavi Local Government Area (LGA) of Kogi state.\nThe attack took place around 2 a.m, with residents alerted when they heard gunshots from the police station.\nThey explained that the gunmen, numbering about six, attacked the police station from different directions and succeeded in killing some of the personnel on duty.\nMr William Aya, the Police Public Relations Officer in Kogi, also confirmed the incident in a statement on Saturday.\nThe police commissioner also asked the operatives to go after the hoodlums and ensure they were arrested and made to face justice."
  },
  {
    "headline": "We have lost our father: Makinde reacts to Oba Adeyemi's death",
    "summarized_story": "The governor, who described Oba Adeyemi’s death as a personal loss, noted that Oba Adeyemi was an ever-supportive royal father and a worthy leader.\nMakinde said the late monarch spared nothing in trying to make Oyo State and Nigeria greater.\nMakinde has sent condolences to the Oyo State Traditional Council, the Oyomesi, Oba Adeyemi’s immediate family, the people of Oyo Kingdom and the entire Yoruba race.\n“I equally commiserate with the Oloris, children and entire Adeyemi family on the demise of their patriarch and worthy father.\n“Oba Adeyemi was our last man standing in the rank of most eminent royal fathers with long years of leadership."
  },
  {
    "headline": "Makinde confirms Alaafin of Oyo’s demise, mourns",
    "summarized_story": "Oyo state Governor, Seyi Makinde, on Saturday, declared that the death of the Alaafin of Oyo, His Imperial Majesty, Oba Lamidi Olayiwola Adeyemi III, was a huge loss to the state, Nigeria and the Yoruba race.\n“I express heartfelt condolences to the Oyo State Council of Obas and Chiefs, which Oba Adeyemi chaired for decades, the Oyomesi and the entire people of Oyo Kingdom.\n“I equally commiserate with the Oloris, children and entire Adeyemi family on the demise of their patriarch and worthy father.\n“Oba Adeyemi was our last man standing in the rank of most eminent royal fathers with long years of leadership.\nKabiyesi never spared anything in his strive to make Oyo State greater and to bring about the Nigeria of everyone’s collective dream."
  },
  {
    "headline": "20 interesting facts about late Alaafin Of Oyo, Oba Adeyemi",
    "summarized_story": "The Alaafin of Oyo, His Majesty, Alaiyeluwa Oba Dr. Làmídì Oláyíwolá Atanda Adéyemí III , passed on, Friday night, after his 52nd-year reign.\nHere are 20 interesting facts about the late Monarch.\nEspecially when you realize that many of the most popular empires, like the famed British Empire, did not last half of that.\n12-The Alaafin can communicate with the deities like Sango (the god of thunder) in their own language.\nHe was the 43rd Alaafin of Oyo."
  },
  {
    "headline": "Breaking: Lagos government makes new pronouncement on Chrisland schools",
    "summarized_story": "Few days after, the Lagos state government has ordered the reopening of all Chrisland Schools shut down minors’ sexual abuse which steered controversy.\nThe state Commissioner of Education, Mrs Folasade Adefisayo, who announced this on Saturday morning via a press statement said, “The Lagos State Ministry of Education has directed that all Chrisland Schools shut for alleged misconduct of some students in Dubai be reopened from Monday, April 25th, 2022.\n“The State Government shut the schools for the safety of students and the staff and to ensure unhindered investigation of the incident.\n“An extensive assessment of the school’s procedure, especially on external trips and excursions, is being made to identify safety gaps and prevent such incidents.\n“Besides, the Ministry will launch the reviewed guidelines/protocols governing private and public schools across the state within the next one month.”The state government had shut down all Chrisland Schools in Lagos State on April 18, 2022."
  },
  {
    "headline": "Fashola Inaúgurates FMBN Board, Executive Management Team",
    "summarized_story": "By Mathew Dadiya, AbujaThe Minister of Works and Housing, Babatunde Raji Fashola has officially inaugurated the newly appointed members of the Federal Mortgage Bank of Nigeria (FMBN) Board and Executive Management Team.\nFashola urged the new oard and executive management team to work within the conceptual framework of FMBN as a specialized banking institution that was established to deliver on a specialized job of driving affordable housing for Nigerians nationwide; Group Head, Corporate Communications ofFMBN, Lawal Isa K/Sauri stated.\nHe also advised the Board and Management to promptly engage with the Central Bank of Nigeria (CBN) and ensure FMBN’s compliance with regulatory stipulations for operating as a Bank.\nFurthermore, the minister expressed appreciation to the immediate past Board and Executive Management Team for their service saying their efforts cannot be forgotten.\nIn his response, the new FMBN Managing Director/Chief Executive, Madu Hamman on behalf of the Board members and Executive Management Team, thanked President Muhammadu Buhari for the privilege and opportunity to serve the nation."
  },
  {
    "headline": "World Bank tells Nigeria to drop fuel subsidy",
    "summarized_story": "By Emmanuel ObisuePresident of the World Bank Group, David Malpass has asked the Federal Government to have a rethink on its policy on fuel subsidy, stating that the huge amount being expended on the policy could be channeled into other critical sectors.\nMalpass noted this on Wednesday at a media briefing at the ongoing World Bank/International Monetary Fund Spring Meetings in Washington DC, United States.\nIt would be recalled that the Nigerian Senate last week approved N4 trillion for petrol subsidy in 2022.\n“So, we encourage that when there is need for subsidy, either food or for fuel, that it should be carefully targeted at those most in need of it.\nThe World Bank had in November 2021 warned Nigeria not to delay any further in removing the fuel subsidy which had been described as a major drain and waste on the economy."
  },
  {
    "headline": "Naira depreciates, sells at N419.50 to dollar",
    "summarized_story": "Agency reportThe Naira exchanged at N419.50 to the dollar at the Investors and Exporters window on Thursday.\nThis represents 0.28 per cent depreciation, compared to N418.33 to the dollar recorded on Wednesday.\nAn exchange rate of N444 to the dollar was the highest rate recorded within the day’s trading before it settled at N419.50.\nThe Naira sold for as low as N410 to the dollar within the day’s trading.\nA total of $124.85 million dollars was traded in foreign exchange at the official Investors and Exporters window on Thursday."
  },
  {
    "headline": "ONU inducted into ASURI hall of fame",
    "summarized_story": "By Eunice OrikeThe Minister of Science, Technology and Innovation, Dr. Ogbonnaya Onu, has made history as he became the first inductee into the hall of fame of the Academic Staff Union of Research Institutes ASURI.\nThis historical event took place at the sensitisation workshop of the staff of FMSTI on the full implementation of the Presidential Executive Order 05 yesterday in Abuja.\nThe Minister enunciated that the essence of the Executive Order 5, is to ensure that Nigeria acquires technologies that will help in positioning the nation towards self-sufficiency.\nHe said, “The Executive Order is revolutionary as it is a contribution of the Ministry towards transforming the nation to the level of greatness ordained by God”.\nThe National Coordinator of the Strategy implementation task office of the Presidential Executive Order No."
  },
  {
    "headline": "Okowa says Delta Agro-Industrial Park to be ready Nov 2022",
    "summarized_story": "By Anastacia Eluwa, AsabaGovernor Ifeanyi Okowa of Delta State on Thursday, said the Agro-Industrial Park being executed by his administration at Aboh-Ogwashi, Aniocha South Local Government Area, would be ready for inauguration in November, 2022.\n“Let me appreciate the level of cooperation we have had with the Ogwashi-Uku community because they gave us over 180 hectares of land for the Agro-Industrial Park.\n“The contractor has promised to deliver the project towards the end of November which means if they start the road project now, they will still have time during the break in August and in the later part of October to finish with the road project,” Okowa said.\n“The park is a community of its own where you have various agro-processing industries co-sharing common facilities for agro-indstrialisation in the state,” he stated.\nHe said that the state government was working with the Federal Ministry of Trade and Investment to designate the park as an Export Processing Zone."
  },
  {
    "headline": "‘Good Night, Iku Baba Yeye,’ Makinde Confirms Alaafin Of Oyo’s Death",
    "summarized_story": "Oyo State Governor, Seyi Makinde, has confirmed the death of the Alaafin of Oyo, His Imperial Majesty, Oba Lamidi Olayiwola Adeyemi III.\n“I have been informed about the death of our father, His Imperial Majesty, Iku Baba Yeye, Oba Lamidi Olayiwola Adeyemi III,” Makinde said.\n“Oba Adeyemi was our last man standing in the rank of most eminent royal fathers with long years of leadership.\nKabiyesi never spared anything in his strive to make Oyo State greater and to bring about the Nigeria of everyone’s collective dream.\nAlaafin Adeyemi, the third to ascend the throne from the Alowolodu Ruling House, ruled for 52 years – making him the longest-reigning traditional ruler in Oyo town."
  },
  {
    "headline": "All Chrisland Schools To Reopen On Monday – Lagos Govt",
    "summarized_story": "All branches of Chrisland Schools in various parts of Lagos State are to reopen from Monday, April 25, authorities in the state have announced.\nThe Lagos State Ministry of Education made the announcement in a statement on Saturday, five days after it ordered the schools to close.\nThe government had ordered the closure of all branches of Chrisland Schools amid a controversy over the alleged misconduct of some of its pupils while on a trip to Dubai, the United Arab Emirates (UAE).\nShe explained that it was also necessary to reopen the schools to ensure that students were not denied access to learning when the new term begins on Monday.\nShe stated that the ministry and other relevant agencies would partner with the school’s Parent Teachers Association (PTA) to work on scheduled psychosocial support for the affected pupils."
  },
  {
    "headline": "2023 Presidency: Osinbajo Visits Olubadan, Receives Royal Blessings",
    "summarized_story": "Vice President, Professor Yemi Osinbajo on Friday, visited the Olubadan of Ibadan, Senator Lekan Balogun to officially inform him of his presidential ambition.\nThe monarch, in turn, offered his blessings to the Vice President saying: “I conclude my contribution to you by handing you over to Allah, let him protect you”.\nDuring the meeting, he said he was confident that the past seven years as VP have prepared him for a higher purpose.\nOsinbajo formally declared his intention to run for President in 2023 on April 11.\nHis declaration brought an end to months of speculation over his interest in the 2023 presidential race and widens the pool of candidates for the position."
  },
  {
    "headline": "At Least Five Injured As Explosion Rocks Taraba Again",
    "summarized_story": "An explosion has occurred in Jalingo the Taraba State capital, leaving at least five persons injured.\nAlthough no life was lost in the explosion, some of the victims are reported to have lost consciousness.\nHe added that some of the children around who saw the suspected suicide bomber could not speak, until after the explosion.\nHowever, intelligence reports revealed earlier that suspected suicide bombers will attack any of the drinking joints in Kasuwan Bera, Nukkai, Mayo Dasa or mile six market.\nWhile six persons were confirmed dead, at least 19 others were said to have been injured."
  },
  {
    "headline": "South Africa’s Deadly Floods Shine Spotlight On Housing Crisis",
    "summarized_story": "Hers was among the 87 homes — shacks made of corrugated iron — that vanished in seconds when the ground, over-saturated with flood water — crumbled at the informal settlement of eNkanini, on a hilltop residential area of central Durban.\nDespite more than three million government houses being constructed since then, the shortfall has ballooned to 3.7 million homes, according to the Centre for Affordable Housing Finance in Africa.\n“It’s not by our choice that we have no land, we have no homes,” Zikode said.\n“It is this reason people will occupy land that is not safe.\nThey will occupy land that is along riverbanks, they will occupy land that is along floodplains.”The less desirable locations on floodplains have now also brought deadly consequences."
  },
  {
    "headline": "Police hunt for fleeing lover who machetted girlfriend in Ondo -",
    "summarized_story": "The Police in Ondo State are investigating the bloody attack on a lady identified as Funmilola Ogundare by her boyfriend in Akure.\nHer boyfriend left her in a pool of blood.\nThe boyfriend left her in a pool of blood inside an apartment located in Ijapo Estate.\nSpokesperson of Ondo State Polo Command, Mrs Funmilayo Odunlami, explained that the suspect took the victim to his friend’s house where he allegedly committed the dastardly act.\nThe suspect took the woman to the apartment to spend the night with her."
  },
  {
    "headline": "APC reschedules sale of nomination forms, sends directors on leave -",
    "summarized_story": "The All Progressives Congress (APC) has rescheduled for next week the sale of expression of interest and nomination forms for elective positions which was originally fixed for today.\nThe leadership of the party has also sent all the six directors at the APC National Secretariat, on compulsory leave.\nAs the party rev up arrangements for their primaries which must be concluded by 3rd June , the Independent National Electoral Commission (INEC) has asked them to submit their membership registers to enable it monitor the primaries at all levels."
  },
  {
    "headline": "INEC suspends CVR in parts of Imo, Anambra, Kaduna States",
    "summarized_story": "The Independent National Electoral Commission has suspended the continuous voters registration exercise in parts of Imo, Anambra, and Kaduna States due to the spate of insecurity and attacks on its field officers.\nChairman of INEC, Mahood Yakubu also disclosed that security agencies have enough time to address the challenges before the 2023 elections.\nProfessor Yakubu spoke during a meeting with resident electoral commissioners in Abuja, where he disclosed that the voters registration exercise has been suspended in 54 centers in imo, 42 centers in Anambra, as well as the registration centers in jemaa, kaura, and large areas of Birnin Gwari and Giwa local government areas in Kaduna state.\nProfessor Mahmood Yakubu also directed all registered political parties to submit copies of membership register to the commission, in compliance with the new Electoral Act 2022, before their primary elections."
  },
  {
    "headline": "Osinbajo pays courtesy visit to Olubadan, meets Oyo APC stakeholders -",
    "summarized_story": "Vice President, Professor Yemi Osinbajo earlier today paid a courtesy visit to the Olubadan of Ibadan Land.\nHe also engaged with Stakeholders of the Oyo State All Progressives Congress chapter in Ibadan, Oyo State"
  },
  {
    "headline": "Nigeria: Court Orders Ex-Speaker Dogara to Vacate Seat Over Defection",
    "summarized_story": "Justice Donatus Okorowo of the Abuja Division of the Federal High Court has ordered the former Speaker of the House of Representatives, Hon.\nYakubu Dogara to vacate his seat as a member of the House of Representatives for defection.\nThe judge held that Dogara cannot continue to occupy the seat in the ninth Assembly because his defection violated Section 68(1) (g) of the constitution.\nThe PDP and the group had asked the court to remove Dogara as member representing Dass, Tafawa Balewa and Bogoro Federal Constituency of Bauchi State, over his defection to APC.\nDogara had, on July 24, 2020, defected from the PDP to the APC when he submitted a resignation letter to the Chairman of the Bogoro ‘C’ Ward in Bauchi State."
  },
  {
    "headline": "British Military Trains 150 Nigerian Special Forces Called Panthers, Set for Deployment Against Terrorists",
    "summarized_story": "A British Military Advisory Training Team, in partnership with the Nigerian Air Force, has trained 150 Advanced Special Forces operatives to be deployed to troubled areas to help in tackling security challenges in the country.\nThe Special Forces, known as Nigerian Air Force Panthers, graduated on Friday at the Regiment Training Centre Annex, Special Operations Command of the Nigerian Air Force, Bauchi.\nSpeaking during the graduation ceremony, after the Advanced Special Operations Course 1/2022, the Air Officer Commanding, Ground Training Command, Air Vice Marshal Ibukunle Daramola said 285 personnel were nominated for the training.\nAs such, these newly bred operatives would be employed as part of our offensive to ensure normalcy and calm are restored to restive communities within Nigeria.\nThe deployment of what we’ve conveyed here will help save lives and defeat a common enemy."
  },
  {
    "headline": "Nigeria: VP Osinbajo Takes Campaign to Ibadan, Upbeat About Becoming Next President – Arise News",
    "summarized_story": "On arrival in Ibadan, the Vice President received a rousing reception right from the airport and on the streets by excited residents.\nComing after Osinbajo declared his intention to contest the 2023 presidential election on the platform of the APC last week Monday, the vice president intimated the Monarch of his intention to run for president.\nThe Vice President said: “I have followed you very closely.\nThe Deputy Governor also joined the vice president for the visit to the Olubadan.\nMembers of the National Assembly with the Vice President besides Folarin, included Senator Adamu Bukkachuwa, Kola Balogun, Fatahu Muhammad, Odebunmi Olusegun, Shehu Saleh Rijau and Karu Simon."
  },
  {
    "headline": "Nigeria: Ex-President Jonathan Hints at Contesting 2023 Presidrntial Election",
    "summarized_story": "Former President Goodluck Jonathan on Friday in Abuja came under intense pressure from his supporters, urging him to contest for president in 2023 and he did not disappoint, telling them that “the political process is ongoing; just watch out.\njust watch out.”The supporters, comprising largely women and youths, stormed the Jonathan Foundation’s Abuja office, chanting his name, forcing him to come out to address them.\nThe supporters, who demanded the return of Jonathan as President in 2023, arrived in four buses and displayed placards at Jonathan’s Taraba Close, Maitama office.\nSome of the placards read, “Goodluck declare now”; “We are sorry, Goodluck don’t abandon us, come back”; “Goodluck please come”; and “Goodluck we love you”, among others.\n“We want Jonathan to run under the Nigeria Peoples Party."
  },
  {
    "headline": "El-Rufai Should Keep Mum Says Monguno + Aisha Invites Presidential Aspirants- Trending With Ojy Okpe",
    "summarized_story": "Babagana Monguno, reacted to the statement made by Kaduna State Governor Nasir El-Rufai in which he alleged that the camps and phone numbers of bandits are known by the security agencies stating that intelligence operations of security agencies against bandits are not for public consumption.\nIn another development, First Lady Aisha Buhari has come under fire on social media for inviting All Presidential aspirants from various political parties to an Iftar dinner at the State House Conference Centre.\nFinally, in the United States a video showing boxing legend Mike Tyson throwing a flurry of punches at a fellow passenger on a jet blue flight from San Francisco to Florida leaving the man with a bloody forehead has gone viral."
  }
]