[
  {
    "headline": "‘Good education may lower dementia risk’",
    "summarized_story": "Lara AdejoroA senior psychiatrist at the Federal Neuro-Psychiatric Hospital, Yaba, Dr. Tomi Alalade says good education may help reduce the risk of dementia.\nAlalade said studies have confirmed that having a good education and embracing lifelong learning could help reduce dementia risk.\nDr. Alalade said having lower educational status may be a risk factor to having Alzheimer’s disease.\nAccording to him, Alzheimer’s disease is the most common cause of progressive dementia, and having memory loss alone doesn’t mean one has dementia.\nHe explained that other types of dementia are vascular dementia, Lewy body dementia, frontotemporal dementia and mixed dementia."
  },
  {
    "headline": "‘Good education may lower dementia risk’",
    "summarized_story": "Lara AdejoroA senior psychiatrist at the Federal Neuro-Psychiatric Hospital, Yaba, Dr. Tomi Alalade says good education may help reduce the risk of dementia.\nAlalade said studies have confirmed that having a good education and embracing lifelong learning could help reduce dementia risk.\nDr. Alalade said having lower educational status may be a risk factor to having Alzheimer’s disease.\nAccording to him, Alzheimer’s disease is the most common cause of progressive dementia, and having memory loss alone doesn’t mean one has dementia.\nHe explained that other types of dementia are vascular dementia, Lewy body dementia, frontotemporal dementia and mixed dementia."
  },
  {
    "headline": "Record-breaking birth of 10 babies yet to be confirmed, says South Africa",
    "summarized_story": "Yusuff MoshoodThe South African Government says it has not been able to confirm a widely reported story that a woman from Pretoria, South Africa, gave birth to 10 babies – seven boys and three girls – on June 7, 2021.\nSithole, it was reported had given birth to 10 babies.\nHowever, the South African Government in a media statement released on June 9 said it has not been able to verify the news about the delivery.\nThe media statement reads: “Government has noted media reports and social media posts alleging that a South African woman has given birth to 10 babies and reportedly broken the world record.\n“The posts attribute the birth of the babies to Gosiame Thamara Sithole from Gauteng."
  },
  {
    "headline": "Record-breaking birth of 10 babies yet to be confirmed, says South Africa",
    "summarized_story": "Yusuff MoshoodThe South African Government says it has not been able to confirm a widely reported story that a woman from Pretoria, South Africa, gave birth to 10 babies – seven boys and three girls – on June 7, 2021.\nSithole, it was reported had given birth to 10 babies.\nHowever, the South African Government in a media statement released on June 9 said it has not been able to verify the news about the delivery.\nThe media statement reads: “Government has noted media reports and social media posts alleging that a South African woman has given birth to 10 babies and reportedly broken the world record.\n“The posts attribute the birth of the babies to Gosiame Thamara Sithole from Gauteng."
  },
  {
    "headline": "Man docked over alleged shop- breaking, stealing",
    "summarized_story": "A 27-year-old man, Biola Taiwo, was on Thursday arraigned before an Ile-Ife Magistrates’ Court, Osun for alleged shop-breaking and stealing.\nThe prosecutor, ASP Abdullahi Emmanuel, told the court that the defendant committed the offence on June 12, around 4:00 a.m. at Iloro Market, Ile-Ife.\nEmmanuel said that the defendant entered into the house of one Oladele Abake with intent to commit felony.\nAccording to him, the defendant stole one keg of palm oil valued at N14,000, one keg of groundnut oil valued at N29,000, a pack of spaghetti valued at N5,000 and N85,000 cash.\nThe defendant, however, pleaded not guilty to the three-count charge bordering on shop-breaking and stealing."
  },
  {
    "headline": "It’s our turn to produce governor in 2023, Enugu Speaker, Nwobodo, APC Chairman, other Enugu East people tell Ugwuanyi",
    "summarized_story": "Speaking at the well-attended rally, themed “Oganiru Enugu East Senatorial District”, the Convener and Speaker of the Enugu State House of Assembly, Rt.\nAligning with the Speaker’s speech, the Chairman of the All Progressives Congress (APC) in Enugu State, Dr. Ben Nwoye announced that the party has zoned its governorship position in 2023 to Enugu East Senatorial District.\nIt means that you have agreed to endorse someone from Enugu East Senatorial District come 2023.\n“We (APC) have zoned the governorship candidate to Enugu East Senatorial District.\nUgwuanyi’s leadership qualities and appealed to him to stick to the existing rotational zoning arrangement in respect of the Office of the Governor of Enugu State, stressing: “We want governor of Enugu State come 2023”."
  },
  {
    "headline": "Okowa sends names of 18 commissioner nominees to Delta assembly",
    "summarized_story": "Gov Ifeanyi Okowa of Delta on Thursday forwarded the names of 18 nominees for appointment as commissioners to the state house of assembly for screening and confirmation.\nThe names of the nominees were contained in a letter read by the Speaker of the state House of Assembly, Chief Sheriff Oborevwori, during plenary of the assembly in Asaba.\nThe News Agency of Nigeria (NAN) reports that Okowa on May 18, dissolved the State Executive Council.\nThe seven new nominees are: Mr Jonathan Ukodhiko, Mrs Evelyn Oboro, Mr Noel Omordon, Mrs Rose Esenwu, Princess Shola Ogbemi-Daibo, Mrs Kate Oniawan, and Mr Johnbull Edema.\nThe confirmation of the nominees followed a motion moved by the Deputy Majority Leader of the Assembly, Mr Oboro Preyor."
  },
  {
    "headline": "Peace Corps bill to be passed soon – Doguwa",
    "summarized_story": "A bill for an Act to establish the Nigerian Peace Corps currently before the House of Representatives is to be passed soon, House Majority Leader, Alhaji Alhassan Doguwa, has said.\nIt quoted Doguwa as pledging continous support for the Peace Corps of Nigeria and its resolve to engage youths within the ages of 18 to 45, in more productive ventures.\nSen. Mas’ud Doguwa, in a remark, urged members of the Peace Corps to remain steadfast and committed to their struggle.\nResponding, the National Commandant of the Peace Corps of Nigeria, Prof. Dickson Akoh, said the Corps was one of the leading youth organisations in Africa.\nAkoh urged youths to continue to be peaceful and unite toward building a prosperous country(NAN)Vanguard News Nigeria"
  },
  {
    "headline": "Gov Makinde orders investigation into Ibadan mayhem",
    "summarized_story": "Seyi Makinde of Oyo State, on Thursday ordered investigations into the mayhem that broke out on Wednesday, between cell phone sellers and suspected hoodlums at Iwo Road in Ibadan.\nMakinde made this known on Thursday when he visited scene, saying the investigation was, “to ensure that everyone involved in the dastardly act is brought to book”.\nThe governor, accompanied by the Commissioner of Police, Mrs Ngozi, and other senior security agents, described the mayhem that claimed the life of one person as unfortunate.\nMakinde, while addressing the traders, promised that such incident would never happen again.\nA shopping complex housing the phone sellers was vandalised, while cell phones and their accessories, among other valuables, were destroyed in the process."
  },
  {
    "headline": "Oyetola okays N285 million severance allowances of ex-council office holders",
    "summarized_story": "Governor Gboyega Oyetola has approved the payment of N285,560,000 as severance allowances of all the former political office holders in the various local governments, local Council Development Areas and Areas Offices of the state.\nOyetola approved 25 percent of the severance allowances of all the former political office holders in the various local councils.\nCommissioner for local government and Chieftaincy affairs, Adebayo Adeleke disclosed this while addressing the Conference hall of the Ministry of Local Governments and Chieftaincy affairs, government secretariat, Osogbo.\nIt would be recalled that in February this year, Oyetola disengaged all the political office holders in the various local governments, local Council Development Areas and Area Offices of their respective posts.\nSupreme Court judgement: Makinde finally bows to pressure, promises to pay sacked council bosses"
  },
  {
    "headline": "Kenneth Kaunda: Last of African freedom fighters is gone – Obasanjo mourns",
    "summarized_story": "Former Nigerian President, Chief Olusegun Obasanjo has disclosed that the death of Kenneth Kaunda marks the end to the list of African freedom fighters on earth.\nObasanjo described the late Zambian President as “one of the pioneers who led the struggles for the decolonisation of the African continent.”It was said that Kaunda and others like him fought and received the instrument of independence from the colonial masters in Africa.\nThe former President said this in a statement, describing as sad, the news of a man he called “a founding father of Zambia.”Obasanjo appealed to all Africans and her friends to take solace in the fact that President Kaunda has gone home to what he termed a well-deserved rest.\nDAILY POST reports that Kaunda died Thursday at the age of 97.\nEx-Zambian President, Kenneth Kaunda is dead, Jonathan reacts"
  },
  {
    "headline": "Buhari’s threat against South-East real",
    "summarized_story": "Orji, in a statement he made available to journalists, said President Muhammadu Buhari’s threat to deal with Biafra agitators in the language they understand should not be taken for granted.\nHe claimed that it was clearly an indication that the government was preparing to repeat the 1967 genocide against Ndigbo.\n“This threat is real and I urge BNG to step up their preparation towards the defense of defenseless Biafrans.\nHe further claimed that, “Nigeria is dead and gone; Buhari’s threat is the last kick of a dying horse and there is practically nothing he can do about the breakup of Nigeria.\n“Above all, you gallant men should remember that victory comes from God alone, to whom He has given victory shall victory come to."
  },
  {
    "headline": "Imo: DSS to assist government fight insecurity",
    "summarized_story": "The Department of State Service (DSS) in Imo State says it will provide critical intelligence support to the state government’s fight against insecurity in the State.\nNwachuku quoted Dr Wilcox Idaminabo, the DSS Director in the State, to have made the promise when Governor Hope Uzodinma visited the agency’s headquarters in Owerri.\nIdaminabo was said to have told Uzodinma that the agency’s poise to assist him in fighting insecurity was meant to reciprocate his support to the DSS.\nIn a speech, the Governor thanked the DSS for being dependable partners in securing Imo.\nInsecurity: We have critical security situation in South-East, South-South – IGP Baba"
  },
  {
    "headline": "Nnamdi Kanu reacts as Navy moves institute to Kano",
    "summarized_story": "Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, has mocked the Nigerian Navy for deciding to move to Kano instead of fighting from the sea.\nDAILY POST understands that the role of the navy is characterised by threat or use of force at and/or from the sea.\nThe navy applies maritime power in offensive operations against enemy forces, territory and trade, among others.\n“For 60 whole years, no stable electricity, no running water, cows roaming the streets, now NAVY in the desert.\nKanu, while reacting to the latest Global Terrorism Index, added, “NIGERIA now ranks 3rd amongst nations most impacted by terror, behind only Afghanistan and Iraq."
  },
  {
    "headline": "Why Hadiza Bala-Usman was suspended - Amaechi",
    "summarized_story": "The Minister of Transportation, Rotimi Amaechi has explained why the Managing Director of Nigerian Ports Authority (NPA) Hadiza Bala Usman was suspended.\nAmaechi noted that Bala Usman was asked to step aside for proper investigation into the activities of NPA.\nBala Usman was reportedly suspended for various infractions, including failure to remit surpluses to the Consolidated Revenue Fund.\n“Don’t forget we are investigating the NPA and not the managing director of NPA.” He added.\nWhen asked if she (Bala-Usman) might return back to her position as the managing director, Amaechi said “I don’t know; only the president can make that decision.”"
  },
  {
    "headline": "'My husband refused to touch me for 23 years, told me to see other men'",
    "summarized_story": "After a disappointing first marriage, a lady named Peninah Mueni Kyalo met a man who checked all the boxes.\nHe was a military soldier, did not drink alcohol, was religious and showered her with love like never before.\nDespite not being intimate for 23 years, Peninah Kyalo has kept herself pure and is proud of it.\nThe Man of Her DreamsIt did not take long before the two moved in together and in 1993 she got pregnant with her son.\n\"He told me to get intimate with whoever I wanted and he would never stand in my way.\""
  },
  {
    "headline": "Show viewers some respect, Ka3na warns ex-BBNaija housemates",
    "summarized_story": "Reality TV star, Kate Jones aka Ka3na, has warned BBNaija Season 5 Lockdown former housemates to maintain their ‘mature’ approach to issues ahead of the reunion show, which premieres on Thursday.\nIn a post shared on her Instagram account, she recalled how the housemates met and lived together in the same hotel.\nKa3na also noted that she believed everyone has had the opportunity to throw tantrums and trash out issues in a responsible way.\nAccording to her, viewers and fans should be given utmost priority to enjoy the reunion show.\nNow let the viewers and the fans of the show get entertained.”"
  },
  {
    "headline": "Anthony Joshua narrates journey from Nigerian boarding school to jail",
    "summarized_story": "Anthony Joshua, the WBO world heavyweight champion, has recounted his journey from boarding school in Nigeria to jail and how Mike Tyson inspired him to become a boxer.\n“I spent about nine months in a boarding school,” he said.\nI was in jail for a little bit, and on tag for about 14 months.”After leaving prison, Joshua said Ben Ileyemi, his cousin, taught him the basics of boxing.\nWhen I moved from Watford into London, I started chilling with my cousin, and he was boxing at the time.\nSo I took boxing a little bit more seriously,” he said."
  },
  {
    "headline": "Drama as married woman allegedly gets stuck to lover during sex",
    "summarized_story": "There was a drama in Uganda when a married woman allegedly got stuck to another man after having sex together.\nThe incident was said to have happened in Gulu city, in the Northern Region of Uganda on Wednesday morning, June 16.\nThey were eventually separated by the woman's husband after he touched their waists.\n#There was drama this morning in Gulu city as a married woman who was having sexual intercourse with another man got stucked like dogs.\nin that after they were done with sex, their sexual organs could not seperate but was stucked in that it failed to seperate however much they tried."
  },
  {
    "headline": "2023: It’s Enugu East turn to produce gov, Speaker, Nwobodo, APC chairman tell Ugwuanyi",
    "summarized_story": "Speaking at the well-attended rally, themed “Oganiru Enugu East Senatorial District”, convener and Speaker, Enugu State House of Assembly, Edward Ubosi, said the only agenda of the gathering was to demand for the governorship seat in 2023 in the spirit of equity, fairness and justice, stressing it was the turn of Enugu East going by the long established rotational template in the state.\nThe speaker who applauded Governor Ugwuanyi for attending the rally stated that it was the unanimous stance of the people of Enugu East, and beyond, that the governor has a major role to play in the choice of his successor since his predecessors enjoyed such privileges during their tenures.\nChairman of the All Progressives Congress (APC) in the state, Dr. Ben Nwoye, announced that the party had zoned its governorship position in 2023 to Enugu East.\nFormer Governor of old Anambra State and former Senator who represented Enugu East, Jim Nwobodo, expressed optimism that Governor Ugwuanyi would endorse his successor from the zone.\nNwododo maintained that it was the turn of Enugu East to produce the next governor in 2023, appealing to other senatorial districts to support the choice candidate of the governor from the zone when the time comes."
  },
  {
    "headline": "Police take fight to unknown gunmen in Imo rural areas",
    "summarized_story": "From Stanley Uzoaru, OwerriCommissioner of Police, Abutu Yaro, has ordered the immediate deployment of special forces to the rural areas in a bid to totally end the activities of unknown gunmen ravaging the state.\nThey killed and beheaded a guard of a lawmaker in the state, Ekene Nnodimele and another All Progressives Congress (APC) chieftain, Jonathan Ugochukwu.\nThe CP said the hoodlums turned to the rural areas because of their defeat by the police in the urban areas.\nWhile briefing the Special Forces at the command headquarters in Owerri, yesterday, the commissioner urged them to deal ruthlessly with the criminal elements disturbing the rural settlers.\n“They are to carry out their statutory duties in line with our extant laws and global best practices,” the CP said."
  },
  {
    "headline": "Bandits strike in Kebbi, abduct students, teachers",
    "summarized_story": "From Olanrewaju Lawal, Birnin Kebbi and Ndubuisi Orji, AbujaBandits stormed the Federal Government College, Birnin Yauri, Kebbi State, yesterday, abducted yet to be ascertained number of students, five teachers and killed a policeman, in a mid day operation.\nMultiple sources said several students and security men who sustained various injuries were receiving care at the Yauri General Hospital.\nThe Commissioner of Police, Adeleke Adeyinka, assured parents and guardians of students that the Command was following credible leads and intensifying efforts to track the assailants and ensure the rescue of the students and teachers.\nAn activist from one of the villages, Mallam Muktar Yauri, told Daily Sun on phone that almost all the villagers have relocated for safety.\nKebbi State has porous borders with neighbouring countries."
  },
  {
    "headline": "FG, states to convene special session on autonomy of judiciary, legislature",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe National Economic Council (NEC) is set to convene a special session to review reports of the judicial panels set up by governors to resolve issues of police brutality and related concerns across the country round up their assignments.\nAlmost all States in the Federation set up the panels including the Federal Capital Territory.\nAlso at the meeting, the VP inaugurated the National Road Safety Advisory Council as a demonstration of government’s continued commitment to addressing the challenges of road safety in the country.\nThe Advisory Council is a critical aspect of the updated National Road Safety Strategy adopted by NEC and approved by the Federal Executive Council late last year.\nThe Road Safety Advisory Council is chaired by Vice President Yemi Osinbajo, with the Corps Marshal of the Federal Road Safety Corps (FRSC), Mr Boboye Oyeyemi as Secretary."
  },
  {
    "headline": "‘Air Peace to create 17,000 jobs with 30 new aircraft by 2023’",
    "summarized_story": "By Chinelo ObogoAir Peace will create up to 17,000 jobs by 2023 when it completes delivery of 30 new Embraer jets, the chairman and Chief Executive Officer of the airline, Allen Onyema, has said.\nOnyema said the airline has fully paid for 13 new aircraft and made purchase rights of additional 17 more which will be activated by 2023.\n“We hope to have all the 13 aircraft we paid for in 2022.\nWe hope to have all the 13 aircraft we paid for in 2022.\n“In addition to the firm’s orders of 13 aircraft, which we would have received before the end of 2022, we would make further commitment of 10 additional aircraft and by the time we have 30 aircraft we would employ about 17,000 personnel."
  },
  {
    "headline": "Buhari in Maiduguri, Vows Not to Rest Until Peace is Restored",
    "summarized_story": "He also commended the state Governor, Prof. Babagana Zulum, for his resilience and relentless efforts in rebuilding the state.\nAccording to him, “It was part of these measures that I gave approval for the federal government to build 10,000 resettlement homes in Borno State.\n“I will never forget in my life that during my career as a politician, Borno State is where I got the highest percentage of votes, more than 90 per cent!\nBuhari also interacted with some of the wounded soldiers assuring them that the government was committed to their recovery and welfare.\n“We have witnessed the gradual return of peace to Borno State and it is our sincere hope that insurgency will soon be brought to an end,” he said."
  },
  {
    "headline": "Kyari: Rising Oil Prices Will Create Problems for Nigeria",
    "summarized_story": "He spoke just as the International Monetary Fund (IMF) expressed concern over the re-emergence of fuel subsidy in Nigeria in the face of the country’s low revenue mobilisation.\nHe added that oil prices had started exiting the comfort zone set by the NNPC, and becoming a burden.\nHe said adding that number to demand will stabilise and probably bring oil prices down to about $60 level or a little below $60, stressing that that’s a comfort zone for every producing company or country.\nAnd it’s very difficult to distinguish the two because as you get peak oil, in many cases, you know, oil is produced alongside gas.\nWith the recovery in oil prices and remittance flows, the strong pressures on the balance of payments have somewhat abated, although imports are rebounding faster than exports and foreign investor appetite remains subdued resulting in continued forex shortage."
  },
  {
    "headline": "Govs Promise Speedy Composition of Allocation Committee for Judicial, Parliamentary Autonomy",
    "summarized_story": "•SGF unveils FG’s plan to build 38 oxygen plantsChuks Okocha in AbujaGovernors have agreed to set up and inaugurate as soon as possible the State Account Allocation Committee (SAAC) in their states to ease the release of funds to the judicial and legislative arms of government in line with the terms of agreements that ended the 10-week industrial strike by workers in the two sectors.\nAn insider at the meeting told THISDAY that the governors agreed to immediately set up the SAACs in their respective states to ease the release of funds to the judiciary and legislature in each state.\nThe communiqué said the governors received an update on the federal government’s response to the COVID-19 pandemic from Mustapha, who is also the chairman of the Presidential Steering Committee (PSC) on COVID-19.\nThe communiqué said: “To bolster the government’s efforts, the SGF informed the forum that Mr. President has approved the set-up of 38 oxygen plants in the country, with at least one plant in each state and two each in Lagos and Abuja.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Zambia’s First President, Kenneth Kaunda, is Dead",
    "summarized_story": "Kenneth Kaunda, Zambia’s first president and a key figure in its independence struggle, has died at the age of 97, his family has confirmed.\nKaunda was admitted to a hospital in the capital Lusaka on Monday suffering from pneumonia.\nIn the 1950s, Kaunda was a key figure in what was then Northern Rhodesia’s independence movement from Britain.\nAs head of the left-leaning United National Independence Party (UNIP), Kaunda then led the country through decades of one-party rule.\nKaunda – popularly known as KK – was a strong supporter of efforts to end apartheid in South Africa."
  },
  {
    "headline": "Keep CBN Overdrafts within Legal Limits, IMF Tells FG",
    "summarized_story": "Says banking sector remains liquid, well capitalisedBy Ndubuisi FrancisThe International Monetary Fund (IMF) has advised the federal government to keep reliance on overdrafts from the Central Bank Bank of Nigeria ((CBN) within legal limits.\nAccording to the IMF, real gross domestic product (GDP) is recovering but unemployment and inflation remain elevated, noting that recent exchange rate measures were encouraging.\nThe IMF mission recommended stepping up efforts to strengthen tax administration to mobilise additional revenues and help address priority spending pressures.\nIt also described as encouraging the recent removal of the official exchange rate from the CBN website and measures to enhance transparency in the setting of the NAFEX exchange rate.\nThe IMF called for the sustenance of the momentum towards fully unifying all exchange rate windows and establishing a market-clearing exchange rate."
  },
  {
    "headline": "BREAKING: Bandits Invade Federal Government College In Kebbi, Abduct Students",
    "summarized_story": "Bandits have abducted some students at Federal Government College, Birnin Yauri in Kebbi State.\nDetails of the incident are still sketchy, according to Daily Trust, but there are reports that a security operative was shot dead during the operation, though the killing of the security operative could not be confirmed.\nThwre have been a series of attacks on schools and abduction of pupils and students in Northern Nigeria.\nThe gunmen abducted two lecturers and eight students, according to Samuel Aruwan, the state's commissioner of internal security.\nAruwan confirmed that two students were shot; one died while the other was being treated in hospital."
  },
  {
    "headline": "BREAKING: Bandits Invade Federal Government College In Kebbi, Abduct Students",
    "summarized_story": "Bandits have abducted some students at Federal Government College, Birnin Yauri in Kebbi State.\nDetails of the incident are still sketchy, according to Daily Trust, but there are reports that a security operative was shot dead during the operation, though the killing of the security operative could not be confirmed.\nThwre have been a series of attacks on schools and abduction of pupils and students in Northern Nigeria.\nThe gunmen abducted two lecturers and eight students, according to Samuel Aruwan, the state's commissioner of internal security.\nAruwan confirmed that two students were shot; one died while the other was being treated in hospital."
  },
  {
    "headline": "EXPOSED: Nigeria's Central Bank Governor, Emefiele Bribes, Silences National Assembly Members With Bureau de Change Licences",
    "summarized_story": "The Governor of the Central Bank of Nigeria, Godwin Emefiele, is currently currying the favour of the National Assembly's top echelon by awarding to them Bureau de Change licences.\nSaharaReporters learnt that principal and vocal members of the National Assembly have been awarded the licences by Emefiele so that they could mellow down on the several probes of infractions and misappropriations concerning the CBN.\nThe attempts by the National Assembly to probe into these CBN NIRSAL allegations had reportedly prompted the 'settlement' by the CBN governor.\n“The governor has issued the licences to these legislators through the companies of their choice and many used third party companies.\n“The 9th Assembly of National Assembly under Senator Ahmad Lawan and Femi Gbajabiamila can better be described as a compromised and silenced legislative arm of government under the current dispensation."
  },
  {
    "headline": "EXPOSED: Nigeria's Central Bank Governor, Emefiele Bribes, Silences National Assembly Members With Bureau de Change Licences",
    "summarized_story": "The Governor of the Central Bank of Nigeria, Godwin Emefiele, is currently currying the favour of the National Assembly's top echelon by awarding to them Bureau de Change licences.\nSaharaReporters learnt that principal and vocal members of the National Assembly have been awarded the licences by Emefiele so that they could mellow down on the several probes of infractions and misappropriations concerning the CBN.\nThe attempts by the National Assembly to probe into these CBN NIRSAL allegations had reportedly prompted the 'settlement' by the CBN governor.\n“The governor has issued the licences to these legislators through the companies of their choice and many used third party companies.\n“The 9th Assembly of National Assembly under Senator Ahmad Lawan and Femi Gbajabiamila can better be described as a compromised and silenced legislative arm of government under the current dispensation."
  },
  {
    "headline": "Sowore Lambasts UFC Star, Usman, For Posing With Nigerian Leaders He Knocked During EndSARS Killings",
    "summarized_story": "Human rights activist, Omoyele Sowore, has lambasted Ultimate Fighting Championship star, Kamaru Usman, for posing with Nigerian politicians, including Lagos State Governor, Babajide Sanwo-Olu who superintended the October 2020 EndSARS killings at the Lekki Tollgate.\nUsman had been critical of the roles of the Nigerian leaders during the recent EndSARS violence which engulfed several parts of the country.\npic.twitter.com/ADUXvlh9E0 — Omoyele Sowore (@YeleSowore) June 17, 2021In the photographs shared by Sowore, Usman posed with the Lagos State Governor, Sanwo-Olu, and posed with Kogi State Governor, Yahaya Bello in another photograph.\nNigerian elites and corrupt politicians are quick to celebrate a successful Nigerian who made their mark outside Nigeria...What happened to our hidden talents back home?.\nEnjoy it while it lasts with@OfficialGYBKogi the most irresponsible and incompetent Nigerian governor below 50.\""
  },
  {
    "headline": "INTERVIEW: I still feel fear each time I fight, says Kamaru Usman",
    "summarized_story": "He left the country a twinkling little star, came back a nebula: the ‘Nigerian Nightmare’ considered one of the best pound-for-pound mixed martial artists in the world.\nAdvertisementHow was the transition from wrestling to mixed martial arts?\nThe transition from wrestling to mixed martial arts was tough.\nEach time I fight, I still feel that fear; that never leaves you.\nWhat’s your opinion about the depth of talents that Nigeria can mine for more success in mixed martial arts?"
  },
  {
    "headline": "INTERVIEW: I still feel fear each time I fight, says Kamaru Usman",
    "summarized_story": "He left the country a twinkling little star, came back a nebula: the ‘Nigerian Nightmare’ considered one of the best pound-for-pound mixed martial artists in the world.\nAdvertisementHow was the transition from wrestling to mixed martial arts?\nThe transition from wrestling to mixed martial arts was tough.\nEach time I fight, I still feel that fear; that never leaves you.\nWhat’s your opinion about the depth of talents that Nigeria can mine for more success in mixed martial arts?"
  },
  {
    "headline": "I don't think gunmen who attacked my school are Nigerians, says Kebbi student",
    "summarized_story": "A female student of Federal Government College, Birnin-Yauri, Kebbi state, who escaped the attack on the school on Thursday, says she doesn’t think the gunmen are Nigerians.\nAdvertisementOn Thursday, gunmen stormed the school in motorcycles and reportedly kidnapped many students.\nDuring the attack, police officers on the ground were said to have been overpowered, leading to the death of a an officer.\nAdvertisementSpeaking after the attack, the female student said two of her schoolmates, who sustained gunshot injuries during the attack, are currently receiving treatment.\nShe noted that some of the students were released by the gunmen, while others were taken away."
  },
  {
    "headline": "I don't think gunmen who attacked my school are Nigerians, says Kebbi student",
    "summarized_story": "A female student of Federal Government College, Birnin-Yauri, Kebbi state, who escaped the attack on the school on Thursday, says she doesn’t think the gunmen are Nigerians.\nAdvertisementOn Thursday, gunmen stormed the school in motorcycles and reportedly kidnapped many students.\nDuring the attack, police officers on the ground were said to have been overpowered, leading to the death of a an officer.\nAdvertisementSpeaking after the attack, the female student said two of her schoolmates, who sustained gunshot injuries during the attack, are currently receiving treatment.\nShe noted that some of the students were released by the gunmen, while others were taken away."
  },
  {
    "headline": "Insecurity: I feel safer in Maiduguri than Abuja, says Ndume",
    "summarized_story": "Ali Ndume, senator representing Borno south, says he feels safer in Maiduguri, the Borno capital, than in the federal capital territory (FCT).\nThe Borno senator also noted that insurgents are not operating within Maiduguri, but outside the state capital.\nOnce I come to Maiduguri, I feel safer than Abuja, because somebody can knock at your door, knock down your door with a gun,” he said.\nAdvertisement“Let me add, the president went round for six hours.\n“For those people who are saying the president is sick and all that, we went through the four corners of Maiduguri."
  },
  {
    "headline": "TeamApt anticipates unicorn bells on the back of $16bn agent banking blitz",
    "summarized_story": "TeamApt has become a leader in Nigeria’s agent banking business and that could drive it to the envied status of a billion-dollar startup in the coming months.\nHis audacity is based on data from SANEF, the body empowered by the Central Bank of Nigeria to oversee agent banking in Nigeria.\nAccording to this data, TeamApt accounts for 74% of the agent banking industry based on the volume of transactions processed monthly.\nIn March 2021, TeamApt processed over ₦1trillion ($2.4 bn) for the first time, according to the CEO.\n🚀🚀🚀 #JustPagait — Tayo Oviosu (@oviosu) June 7, 2021Not much is known about Firstmonie, also in the agent banking heavyweight category."
  },
  {
    "headline": "Banks and startups need to partner for growth but who can solve the risks involved?",
    "summarized_story": "Five Nigerian banks have signed up as pioneer members of a new initiative that aims to increase partnerships between corporations and startups in emerging markets.\nVFD Group, an investment company that owns VBank, a digital bank, has also signed up.\nBut emerging market narratives of disruption that pit startups and corporates against each other gloss over many avenues of collaboration that currently lie fallow.\nStartups are experiments and could come with reputational risks for corporates when they fail or splinter into some sort of scandal.\nIt is possible that startups and corporates can, on their own, set up the right structures and interfaces to reduce such risks."
  },
  {
    "headline": "Netflix kicks off inaugural skills development initiatives in Africa",
    "summarized_story": "Netflix on Sunday, June 13, commenced its first 3-month Episodic Lab (EPL) and Development Executive Traineeship (DET) programmes in Africa.\nOver 500 applications were received from Nigeria, Kenya, Mozambique, South Africa and Zimbabwe for the inaugural development lab for African writers and DET initiatives.\nOther participants are Andile Ngcizela, Dominique Jossie and Kudakwashe Maradzika from South Africa and Mary Waireri from Kenya.\n“Without the existence of our storytellers, our favourite Netflix stories wouldn’t be possible,” Alison Triegaardt, Netflix manager for Grow Creative in Africa, said.\nPotential boost to subscriber baseIn addition to improving quality storytelling in Africa, Netflix would most likely be looking to grow its relatively small subscriber base in the region by producing more relatable, original local content with the help of the development lab."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "From Q3 2021, Nigerian fintechs without defined regulations must undergo incubation before operating",
    "summarized_story": "Starting Q3 2021, fintech platforms with no defined framework will have to go through an incubation program to legitimately operate.\nAdvertisementIn the situation where the said innovation doesn’t have an existing regulatory framework, the startup will proceed to apply for the RI program.\nTen months into the incubation program, the startup will be presented with guidelines covering its services.\nA possible implication is that API fintech startups, micro-lending platforms, investment tech, and other innovations operating under no specific regulatory framework may have to cease operation until certified through the incubation program.\nThe SEC’s incubation program, however, has the added incentive of legitimacy, but the Commission has not revealed how it plans to enforce it."
  },
  {
    "headline": "Gebeya announces the relaunch of its freelance marketplace, plans to grow its talent pool to 15,000 in 3 years.",
    "summarized_story": "Ethiopia-based startup, Gebeya, has announced the launch of its Pan-African freelance marketplace, which would connect startups and small and medium enterprises with the professional talents needed to grow their businesses.\nFounded in 2016 to train African youth in technology skills, Gebeya is similar to freelance platforms such as Upwork and Fiverr.\nGebeya began as an edtech startup helping Africans gain tech skills before matching them with employers.\nWith the relaunch of the talent platform, the startup can connect more talents with jobs.\nGebeya’s matching algorithm considers location, language, and budget when matching businesses with talents."
  },
  {
    "headline": "Kenya-based foodtech startup, Kune, closes $1 million pre-seed round for official launch",
    "summarized_story": "Kune, a Kenya-based foodtech startup, has announced raising $1 million in pre-seed funding.\nConsonance Investments, Liechtenstein-based investment company, Century Oak Capital GmbH, and Pariti, an ecosystem management firm also invested in this round.\nFounded in December 2020 by France-born Robin Reecht, Kune’s objective is to provide ready-to-eat food services at a moderate price.\nHe took it upon himself to proffer a sustainable solution to bridge the gap between great food and affordable pricing.\nWith Kune anticipating a fast growth rate, we just might have more founders looking into Africa’s foodtech space."
  },
  {
    "headline": "Nigeria among top 5 growth markets for e-commerce in alcoholic drinks",
    "summarized_story": "Nigeria among top 5 growth markets for e-commerce in alcoholic drinksThe purchase of alcohol drinks via e-commerce channels is gaining traction with Nigeria, Africa’s biggest economy, identified among top five key markets with potential for growth, a new report by Euromonitor International, the world’s leading independent provider of strategic market research shows.\nThis means that the alcohol industry, which historically has been very hesitant to…"
  },
  {
    "headline": "Oil price at $75 may push subsidy to N1trn",
    "summarized_story": "If there is anything to take away from the current increase in international oil price, it is the reality that Africa’s biggest oil-producing country may pay more than half a trillion naira subsidising the cost of petrol within the first six months in 2021.\nThe current rising oil prices float all boats in Nigeria.\nWhile…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Allow freedom of speech, Nigerian press urges Reps",
    "summarized_story": "The Nigerian media industry has called on the House of Representatives to step down a bill seeking to amend the Nigerian Press Council Act, saying it is still a subject of litigation at the Supreme Court.\nIn recent time, several media organisations and groups have criticised various clauses in the bill as possibly discouraging Freedom of Speech in the country.\nOdebunmi said, “So, I am sorry if there is anybody who thinks we did not invite them.\n“A consideration is that the amendment seeks an unabashed focus to restrict freedom of expression while masking the toga of something else.\n“The power to determine sanctions relating to hefty fines should be vested in the courts and not the council."
  },
  {
    "headline": "Former MD, Bank PHB, Atuche Received Six Years Imprisonment For N25.7Billion Fraud, Wife Acquitted – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The former Managing Director of the defunct Bank PHB, Francis Atuche has been sent to six years imprisonment for defrauding the financial institution of N25.7billion.\nWith the pronouncement, the ex MD after been on trial for 10 years, is to be in prison for six years.\nIn the judgement, Justice Okunnu held that the Economic and Financial Crimes Commission (EFCC) had proved the case beyond reasonable doubt that Atuche actually committed the crime.\nOkunnu however discharged Atuche’s wife Elizabeth who was facing trial alongside the duo.\nThe trial judge also held that in case of conspiracy and stealing against the 2nd defendant, the prosecution failed to prove any case against her."
  },
  {
    "headline": "NDDC has failed, not living up to its responsibilities, Obaseki insists – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has restated that the Niger Delta Development Commission (NDDC) is not living up to its responsibility of ensuring infrastructural development in the Niger Delta and raising the standard of living of the people.\nObaseki said this on Thursday when he received the Odiowere and elders of Ugha Quarters of Urhonigbe Town in Orhionmwon Local Government Area, who were on a courtesy visit at the Government House, Benin City.\nHe said: “We are aware and know that the road has been awarded by NDDC.\nObaseki continued: “As soon as possible, we would send government agencies to check the immediate state of the road and report back.\nWe will deliver the dividends of democracy to the people of the State, including Ugha Quarters in Urhonigbe."
  },
  {
    "headline": "Edo Poly matriculates 2,200 new students, as Rector lauds Obaseki on support, partnership – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Polytechnic, Usen, has matriculated 2,200 new students into its National Diploma (ND) and Higher National Diploma (HND) programmes, with the intakes charged to be of good character and pursue excellence in their studies.\nRector of the Polytechnic, Professor Abiodun Falodun, made the submission during the school’s 19th matriculation ceremony, held in Usen, Ovia South West Local Government Area (LGA) of Edo State.\nThe Rector noted that the Edo State Governor, Mr. Godwin Obaseki, has provided immense support to drive change and community impact in the school, especially in securing accreditation for new programmes.\nHe added that the governor recently entered into partnership with the school for training of government’s secretarial staff in computer science/data processing.\nOur sincere gratitude to His Excellency, Governor Godwin Obaseki, for the invaluable assistance in the accreditation exercise."
  },
  {
    "headline": "Osinbajo presides over virtual NEC meeting – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – Vice President Yemi Osinbajo presided over a virtual meeting of the National Economic Council (NEC) on Thursday at the Presidential Villa, Abuja.\nUnder the Nigerian Constitution, the vice president is the chairman of NEC.\nThe council’s meeting is held monthly to deliberate on the coordination of the economic planning efforts and economic programmes of the various levels of government.\nNEC comprises the 36 state governors, the governor of Central Bank of Nigeria, minister of finance, Secretary to the Government of the Federation and other government officials whose duties hinge on the economy.\nAt the last meeting on May 20, NEC declared its support for Nigeria’s effort at digital switch over."
  },
  {
    "headline": "Spotlighting Femi Fani-Kayode, Nigeria’s anti-vaccination champion who later took the jab",
    "summarized_story": "For over a year since the virus was first detected in Nigeria, his name, Femi Fani-Kayode, rang a deterrent bell of anti-vaccination.\nDespite the fact-checking efforts, Mr Fani-kayode still shared the video in January 2021.\nTwo days later, on May 2, Mr Fani-Kayode tweeted again, “@WHO are set to begin Covid 19 vaccine trials in our country.\nIn short, it was a time of panic and tweets by Mr Fani-Kayode readily reinforced people’s fears and biases.\nThe conversion and the dangers inherent in peddling falsehoodAgainst the nature of his comments, Mr Fani-Kayode announced on March 30, 2021, that he had taken a jab."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Arla Builds Dairy Farm in Nigeria to Support Local Milk Production",
    "summarized_story": "Arla Foods, makers of Dano Milk, has said it will build a state-of-the-art commercial dairy farm in Northern Nigeria.\nArla Foods also states that the dairy farm will also train and support up to 1,000 local dairy farmers as part of its long term commitment to public private partnerships that support the development of the Nigerian dairy sector as part of the country’s efforts to increase local food production.\nThe facilities and expertise provided by Arla, will ensure a first class opportunity to train local dairy farmers to improve milk yields and quality, animal welfare and farm profitability, contributing to the country’s aims to develop local milk production.\nOur new dairy farm is our next step in our commitment to Nigeria,” says Managing Director of Nigeria Peder Pedersen.\nWhen it is built, we can support local dairy farmers to create better livelihoods and it is a key enabler to growing dairy and food production on a local scale.”Advertisements"
  },
  {
    "headline": "CBN Grants Lotus Non-Interest Banking License",
    "summarized_story": "The Central Bank of Nigeria (CBN) has granted a non-interest banking license to LOTUS BANK LIMITED.\nLOTUS Bank seeks to pursue the mission of creating value and growth for all through digital innovation and best-in-class customer experience for Nigerians.\nNon-Interest Banking is geared towards supporting the real sector and LOTUS Bank aims to improve financial inclusion in the country.\nGlobally, non-interest banking is worth $2.23 trillion and is expected to grow to about $4 trillion by 2024.\nLOTUS Bank is the first non-interest bank to commence operations from South-West, Nigeria with a focus to serve people of all faiths."
  },
  {
    "headline": "Nigeria Ends $1bn Annual Capital Flight On Aircraft Maintenance",
    "summarized_story": "Nigeria seems to have ended $1billion annual capital flight spent on maintenance of aircraft abroad by West African countries as the Nigerian Civil Aviation Authority (NCAA) has granted a private firm, 7star Global Hangar Ltd licence to operate Aircraft Maintenance Organisation (AMO) and an all-inclusive Maintenance Repair and Overhaul (MRO) on aircraft in the country.\nAdvertisementsThis would mean that aside Nigeria, aircraft from neighbouring countries can come and do their maintenance in Nigeria, hence, generating income for the econom.\nAccording to him, 7Star will be focusing on aircraft Maintenance Repair and Overhaul (MRO), saying, the organisation will carry out operations as permitted by the NCAA.\nAdvertisementsThe huge capital in aircraft maintenance we often experience, amounting to over $1billion that is annually spent in West Africa alone is going to help create jobs here in Nigeria, he said.\nWe are happy and proud about the history Nigeria is making even in West Africa”"
  },
  {
    "headline": "Group Blames Muslims, Christians For Lingering Crisis In Kaduna",
    "summarized_story": "A group, African Initiative for Peace Building Advocacy and Advancement (Afripeace) has said the lack of cohabitation between Muslims and Christians as largely responsible for the persistent crises in Kaduna State.\nAdvertisementsThe group made the assertion in Kaduna yesterday during the training of relevant stakeholders in the State on inclusive community-led reconciliation and conflict recovery, adding that the situation also makes it difficult for conflict resolution in the State.\nIn the same vein, Afripeace noted that a situation whereby the two religions faithful respectively dominated one area as settlement because of ethno-religious differences contributed to rising cases of conflicts in the State.\nThe resource person, Rev.\nBitrus Dangiwa from the Interfaith Mediation Centre (IMC) Kaduna, said that conflict was inevitable, adding that it could be managed if community members have the capacity to recover from conflict, reconcile and live peacefully with one another."
  },
  {
    "headline": "Taraba IDPs Return To Farms, Communities",
    "summarized_story": "Some internally displaced persons (IDPs) in the central zone of Taraba State have returned to their communities following the directive by Governor Darius Ishaku.\nAdvertisementsThe chairman, Taraba State Tiv Traditional Leaders’ Council and Ter Tiv Bali, Zaki David Gbaa, who confirmed the development to LEADERSHIP, thanked the governor for ensuring the return of peace in the area.\nHe said the governor had directed the chairman of the local government area, Prince Musa Mahmud, to facilitate the return of all displaced persons in the local government back to their homes.\nAdvertisements"
  },
  {
    "headline": "Northern groups place N100m bounty on Nnamdi Kanu over ‘crimes against humanity’",
    "summarized_story": "A coalition of 75 Northern groups under the auspices of the Northern Consensus Movement on Thursday evening, announced a N100 million reward for anyone who can produce the leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, to stand trial for alleged treason.\nThe groups disclosed this at a press briefing in Abuja.\nHe said: “The Northern Consensus Movement, an amalgamation of more than 75 civil society groups of Northern extraction, has declared in unequivocal terms that:“We are declaring Nnamdi Kanu wanted for crimes against humanity and for instigating the killing of innocent Northerners in the South-East via his hate speech.\nREAD ALSO: Buhari in Borno, tasks security agencies on terrorism…“We want him to answer for the killing and destruction of properties of Northerners residing and undertaking lawful businesses in South-East Nigeria.\n“So, we are placing a bounty of N100m as an offer to anyone who can produce him alive, hale, hearty, and uninjured to us for onward delivery to the security agencies for the continuation of his prosecution."
  },
  {
    "headline": "Boko Haram appoints a new leader Bakura Modu, confirms Shekau’s death",
    "summarized_story": "Boko Haram has confirmed the death of its erstwhile commander, Abubakar Shekau.\nThe confirmation came through a video announcement sent to the media by the presumed new leader of the terror group, Bakura Modu, aka Sahaba.\nREAD ALSO: Buhari in Borno, tasks security agencies on terrorism…He said: “Commanders of Jama’atu Ahlu Sunna Lidda’awati Wal Jihad.\nThis is because Allah has not forsaken your efforts.”He also encouraged Boko Haram commanders to reject Barnawi.\nBakura’s faction is one of the Boko Haram elements operating in the Lake Chad area where they have access to porous borders with Chad and Niger."
  },
  {
    "headline": "2023: Shekarau urges the APC to nominate a presidential candidate from the south.",
    "summarized_story": "The All Progressives Congress has been charged by a former Governor of Kano State, Ibrahim Shekarau, to field a presidential candidate from the South in 2023.\nThe former Governor noted that a political power shift is necessary for all Nigerians to have a sense of belonging.\nHe further stated that failure to shift power would further divide Nigerians.\nThe senator said, “This is also the same with rotating the presidency between the North and the South.\nIf we ignore power shifts, we are not being fair to ourselves and we are not fair to history."
  },
  {
    "headline": "Sanwo-Olu, El-Rufai, Others Get Fresh FG Appointments",
    "summarized_story": "The National Road Safety Advisory Council has been inaugurated by the Vice President of Nigeria, Professor Yemi Osinbajo.\nThe 29-member Advisory Council is a major aspect of the updated National Road Safety Strategy adopted by NEC and approved by the Federal Executive Council late last year.\nThe Road Safety Advisory Council is chaired by Osinbajo, while the Corps Marshal of the Federal Road Safety Corps (FRSC), Mr Boboye Oyeyemi will serve as Secretary.\nSix governors, representing the six geo-political zones in the council are: Chief Willie Obiano, Governor of Anambra State, representing the South-East zone; Ifeanyi Okowa, Governor of Delta State, representing the South-South zone; Babajide Sanwo-Olu, Governor of Lagos State, representing the South-West zone; Alh.\nMuhammad Inuwa Yahaya, Governor of Gombe State representing the North-East zone; Mallam Nasir El-Rufai, Governor of Kaduna State representing North-West; Mr. Abdulrahman AbdulRasaq, Governor of Kwara State, representing the North-Central zone."
  },
  {
    "headline": "Bandits collect N16m for 11 victims in Kaduna, hold 17, demand N17m",
    "summarized_story": "Bandits have released 11 women out of the 28 abducted in the Kabode Kachia Local Government Area of Kaduna State.\nThe kidnappers had initially demanded N30m as ransom, the community said.\nSources said the kidnappers dragged the women out of their houses and zoomed off.\nOne of them said, “They released 11 women after we paid N16m ransom, but they are still demanding N17m before releasing the other 17 women.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Bandits collect N16m for 11 victims in Kaduna, hold 17, demand N17m",
    "summarized_story": "Bandits have released 11 women out of the 28 abducted in the Kabode Kachia Local Government Area of Kaduna State.\nThe kidnappers had initially demanded N30m as ransom, the community said.\nSources said the kidnappers dragged the women out of their houses and zoomed off.\nOne of them said, “They released 11 women after we paid N16m ransom, but they are still demanding N17m before releasing the other 17 women.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Court Remands Property Manager in Prison Over N132m Fraud",
    "summarized_story": "By JUMOKE SANNIJustice J.E Obanor of the Federal Capital Territory High Court, Abuja today June 17, 2021 remanded one Ifeanyi Israel in prison for fraud.\nIsrael was arraigned by the Economic and Financial Crimes Commission EFCC alongside his company, UI Properties Limited, on one count charge bordering on dishonesty, breach of trust and conversion of funds to the tune of N132,503,000 belonging to his client, a certain, Dr. J.K. Okoye.\nThe charge reads, “that you Ifeanyi Israel and UI Properties Ltd sometime in 2006 at Abuja within the jurisdiction of the Federal Capital Territory, being entrusted to collect and remit rent from tenants from 6 properties at Wuse Zone 6, Utako, Garki in Abuja and Lekki Phase 1 in Lagos by one Dr. J.K Okoye received a total sum of N132,503,000 000 (One Hundred and Thirty Two Million Five Hundred and Three Thousand Naira only) from the tenants, dishonestly misappropriated the stated sum to your own use and thereby committed an offence contrary to section 311 and punishable under section 312 of the Penal Code Act, Laws of the Federation (Abuja), 1990.”The suspect pleaded “not guilty” to the charge preferred against him and has been remanded at the Correctional Centre while the case was adjourned till 29thJune, and 1st and 2nd July 2021 for commencement of trial.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Court Remands Property Manager in Prison Over N132m Fraud",
    "summarized_story": "By JUMOKE SANNIJustice J.E Obanor of the Federal Capital Territory High Court, Abuja today June 17, 2021 remanded one Ifeanyi Israel in prison for fraud.\nIsrael was arraigned by the Economic and Financial Crimes Commission EFCC alongside his company, UI Properties Limited, on one count charge bordering on dishonesty, breach of trust and conversion of funds to the tune of N132,503,000 belonging to his client, a certain, Dr. J.K. Okoye.\nThe charge reads, “that you Ifeanyi Israel and UI Properties Ltd sometime in 2006 at Abuja within the jurisdiction of the Federal Capital Territory, being entrusted to collect and remit rent from tenants from 6 properties at Wuse Zone 6, Utako, Garki in Abuja and Lekki Phase 1 in Lagos by one Dr. J.K Okoye received a total sum of N132,503,000 000 (One Hundred and Thirty Two Million Five Hundred and Three Thousand Naira only) from the tenants, dishonestly misappropriated the stated sum to your own use and thereby committed an offence contrary to section 311 and punishable under section 312 of the Penal Code Act, Laws of the Federation (Abuja), 1990.”The suspect pleaded “not guilty” to the charge preferred against him and has been remanded at the Correctional Centre while the case was adjourned till 29thJune, and 1st and 2nd July 2021 for commencement of trial.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "You contributed to current upheavals: Femi Adesina attacks Obasanjo",
    "summarized_story": "Michael AdeshinaFemi Adesina has identified former President Olusegun Obasanjo as one of the persons who contributed to the current upheavals in Nigeria.\nHe, however, added that Obasanjo contributed to the current political foolishness in Nigeria through his actions and inactions.\nPlease read Femi Adesina’s article titled NIGERIA’S UNITY AND ALL THE IBERIBERISM belowWhich one is Iberiberism again o?\nOkorocha engaged in neologism when he created the word Iberiberism, and used it to describe political foolery and trickery or stupidity.\nDespite all that he has contributed to the current upheavals by his actions and inactions, words and bile, he says it is idiotic to wish Nigeria disintegration now."
  },
  {
    "headline": "My last encounter with Kenneth Kaunda before his death – Obasanjo",
    "summarized_story": "By Kazeem UgbodagaNigeria’s former President, Olusegun Obasanjo has recounted his last encounter with former Zambian President, Kenneth Kaunda before his death.\n“President Kaunda was visibly pained in his response and at some point he broke down and wept.\nObasanjo said in this moment of great loss to Zambians and indeed all Africans, “I wish to express my heartfelt condolences to the Kaunda family, President Edgar Lungu, and the government and people of the Republic of Zambia.\nWe are consoled that God granted President Kaunda long life to witness the progression of Africa through five decades of proud and not-so proud moments.\n”As we mourn President Kaunda, my prayer is that the death of this great African son and leader will remind us of the sacrifices that he and his contemporaries who fought for Africa’s independence made."
  },
  {
    "headline": "Obasanjo lands in Addis Ababa for Ethiopia’s election",
    "summarized_story": "Former Nigerian leader Olusegun Obasanjo, has arrived Addis Ababa to monitor Ethiopia’s general election scheduled for 21 June.\nObasanjo is the head of the African Union Elections Observation Mission to the country.\nThe election was originally slated for August last year.\nStaging the polls in the vast country of 110 million is a logistical challenge at the best of times.\nAnd things are worsened by unrest, conflict and Covid-19."
  },
  {
    "headline": "Akwa Ibom First Lady bags United Nations Award",
    "summarized_story": "Wife of Akwa Ibom State governor, Her Excellency Dr. Mrs. Martha Udom Emmanuel, has bagged the “Champion of Sustainable Development Goals” award of the United Nations, UN, conferred on her by the United Nations Secretary General, Mr. Antonio Guterres.\nThe award was conferred on her for using her position and non-governmental platform, Family Empowerment and Youth Reorientation Path-Initiative FEYReP, to advance the cause of women and children in the state.\nThe award was conferred on the First Lady by the UN Secretary Generalthrough his Nigerian representative, the Resident Humanitarian Coordinator, Mr. Edward Kallon, who led a high-powered delegation of the organization on a courtesy visit to the governor’s wife at Government House, Uyo.\n“It is a pleasure to be here to meet you in person and appraise things for myself.\nIn her words, “We have been very vocal against rape and violence against women against in this state and this has resulted in many speaking up and seeking justice."
  },
  {
    "headline": "I’m Paying Nigerians Back Because They Love Me — Buhari",
    "summarized_story": "President Muhammadu Buhari has stated that he is dedicated to helping Nigerians as a result of their love for him.\nBuhari claims he owes Nigerians a debt of gratitude for allowing him to serve by providing adequate security and livelihood.\n“My dedication to assist Nigerians is my way of repaying the affection that has been offered to me.\nMoreover, despite security challenges, Buhari praised the State Governor for his forthrightness, resilience, and drive in bringing prosperity to the state.\nFew leaders, the President noted, would take the risks that Governor Zulum had made over the years to protect his people and promote peace and development, particularly by spending nights with vulnerable people."
  },
  {
    "headline": "Nigeria’s Central Bank Governor, Emefiele Bribes, Silences National Assembly Members With Bureau de Change Licences",
    "summarized_story": "Godwin Emefiele, the Governor of the Central Bank of Nigeria, is currently currying favor with the National Assembly’s upper echelon by granting them Bureau de Change licenses.\nAccording to SaharaReporters, Emefiele granted the licenses to key and vociferous members of the National Assembly so that they could take a break from the numerous investigations into CBN infractions and misappropriations.\nAccording to SaharaReporters, some politicians used third-party firms to secure CBN licenses, while others who lacked the required financial deposits were helped by the CBN governor to obtain government loans.\n“The governor has issued the licences to these legislators through the companies of their choice and many used third party companies.\n“The 9th Assembly of National Assembly under Senator Ahmad Lawan and Femi Gbajabiamila can better be described as a compromised and silenced legislative arm of government under the current dispensation."
  },
  {
    "headline": "Court Orders Akeredolu To Stop Investigating The Chief Judge For Alleged Wrongdoings",
    "summarized_story": "Rotimi Akeredolu, the governor of Ondo, and the state house of assembly have been ordered to cease the investigation into Oluwatoyin Akeredolu, the state’s chief judge, over a viral video created by one Olupelumi Fagboyegun by a federal high court in Abuja.\nIn a video that went viral on social media, Fagboyegun accused the top judge of misusing her position and influencing his lengthy arrest.\nAs a result, the governor ordered an investigation into the accusation by the state attorney general.\nHe held it is only the NJC that is empowered under the constitution to probe allegations of official misconduct against any judge.\nEkwo set aside all steps taken in the investigation and granted an order of perpetual injunction, restraining all the defendants from further taking any steps in relation to the case."
  },
  {
    "headline": "Breaking: Kidnapped NPFL ‘s Rivers United coach, Stanley Eguma, regains freedom",
    "summarized_story": "Rivers United head coach, Stanley Eguma, has been freed by his adoptors.\nCoach Eguma was kidnapped on Tuesday in Enugu.\nRivers United are one of the clubs contending for Nigeria Football Professional League (NPFL) top finish in 2021.\nDetails loading…"
  },
  {
    "headline": "Breaking: Again, armed robbers attack POS operatives in Imo",
    "summarized_story": "Armed robbers numbering about five, Thursday, attacked some POS operatives around Eke Atta market in Ikediru Local Government Area (LGA) of Imo state, taking away monies belonging to both the operatives and customers waiting to transact business.\nThe amount taken away totaled N500,000, according to those that spoke to Blueprint.\nIt was also gathered that this was the second attack on POS operatives in one week along the major Owerri-Okigwe- Enugu road in the LGA.\nLast week, armed robbers suspected to be the same gang stormed the popular Ama Nwozuzu junction in Owerri, and made away with monies, phones and accessories belonging to POS and a phone seller which caused stampede at the nearby Eke Iho market before they left.\nWhen contacted, the Police Public Relations Officer( PPRO) Imo command, Bala Elkana, said he had not heard about the robbery incident, top stories but promised to find out."
  },
  {
    "headline": "Breaking: Blessing Okagbare breaks own record, wins 100m event ahead Tokyo Olympics (PICTURES)",
    "summarized_story": "Serial Champion, Blessing Okagbare, is at it again.\nThe Delta-born Nigerian has just finished a 100 metres race at 10.63secs during the ongoing national trials holding in Lagos ahead of 2020 Tokyo Olympics.\nBefore now in an official note, Okagbare had ran 10.79 secs."
  },
  {
    "headline": "Association of lawyers call for immediate govt action in Oju LGA -NigPilot",
    "summarized_story": "An association of lawyers from Conflict Zones in Benue State has called on the government for timely intervention into the constant attack on Ukpute in the Oju Local Government Area of the state and other communities in the zone.\nIn a statement by the association’s President, John Owulo Esq the lawyers are demanding the immediate intervention of the government to restore peace in those crisis-prone areas in the state.\n“We members of the Association of Lawyers from Conflict Zones would wish to urge the Benue State Goverment to put an immediate end to the invasion of Ukpute Community in Oju Local Government of Benue State by the Bonta militia and their collaborators by deploying security personnel to the conflict area.\n“We believe such an initiative will minimise further loss of lives, destruction of property and mass suffering of the displaced, especially women and children.\n“The same conflict had snowballed into the killing of a Captain and eleven soldiers earlier in the year by the same Bonta militia."
  },
  {
    "headline": "Association of lawyers call for immediate govt action in Oju LGA -NigPilot",
    "summarized_story": "An association of lawyers from Conflict Zones in Benue State has called on the government for timely intervention into the constant attack on Ukpute in the Oju Local Government Area of the state and other communities in the zone.\nIn a statement by the association’s President, John Owulo Esq the lawyers are demanding the immediate intervention of the government to restore peace in those crisis-prone areas in the state.\n“We members of the Association of Lawyers from Conflict Zones would wish to urge the Benue State Goverment to put an immediate end to the invasion of Ukpute Community in Oju Local Government of Benue State by the Bonta militia and their collaborators by deploying security personnel to the conflict area.\n“We believe such an initiative will minimise further loss of lives, destruction of property and mass suffering of the displaced, especially women and children.\n“The same conflict had snowballed into the killing of a Captain and eleven soldiers earlier in the year by the same Bonta militia."
  },
  {
    "headline": "Again, Sen. Ibezim wins at Tribunal as PDP loses -NigPilot",
    "summarized_story": "Election Petition Tribunal sitting in Owerri, Imo State, today, 17/06/2021, has delivered a final Judgment dismissing the Peoples Democratic Party, PDP, ‘s petition in a keenly contested Election Petition for the Imo North Senatorial District.\nIn Petition No: EPT/OW/SEN/3/2020: EMMANUEL OKEWULONU and PDP -V- APC & SENATOR FRANK IBEZIM , the Tribunal while considering the Preliminary Objection raised by All Progressives Congress, APC, & its candidate Senator Frank Ibezim, on the issue of whether the Petition is competent?\nThe Preliminary Objection of APC and Distinguished Senator Ibezim therefore succeed and the PDP & its candidate, Emmanuel Okewulonu Petition is hereby struck out, the Tribunal held.\nRecalled that yesterday, 16/06/2021, the Tribunal dismissed the other two Petitions brought by YPP and ADC against APC and its candidate Distinguished Senator Frank Ibezim.\nWith this Judgment today, the Landslide Victory of Distinguished Senator Frank Ibezim has been confirmed and reconfirmed by all the Courts and Election Petition Tribunal."
  },
  {
    "headline": "Again, Sen. Ibezim wins at Tribunal as PDP loses -NigPilot",
    "summarized_story": "Election Petition Tribunal sitting in Owerri, Imo State, today, 17/06/2021, has delivered a final Judgment dismissing the Peoples Democratic Party, PDP, ‘s petition in a keenly contested Election Petition for the Imo North Senatorial District.\nIn Petition No: EPT/OW/SEN/3/2020: EMMANUEL OKEWULONU and PDP -V- APC & SENATOR FRANK IBEZIM , the Tribunal while considering the Preliminary Objection raised by All Progressives Congress, APC, & its candidate Senator Frank Ibezim, on the issue of whether the Petition is competent?\nThe Preliminary Objection of APC and Distinguished Senator Ibezim therefore succeed and the PDP & its candidate, Emmanuel Okewulonu Petition is hereby struck out, the Tribunal held.\nRecalled that yesterday, 16/06/2021, the Tribunal dismissed the other two Petitions brought by YPP and ADC against APC and its candidate Distinguished Senator Frank Ibezim.\nWith this Judgment today, the Landslide Victory of Distinguished Senator Frank Ibezim has been confirmed and reconfirmed by all the Courts and Election Petition Tribunal."
  },
  {
    "headline": "APC Governors pass confidence vote on party leadership -NigPilot",
    "summarized_story": "They also commended Governor Buni for providing excellent leadership to the party at the most critical period.\nAccording to PGF, the vote of confidence was imperative to encourage the interim leadership of the party to continue its strides in piloting APC to its next level.\nThis is even as other stakeholders are calling for a National convention to elect new leadership to move the party forward.\nIt would be recalled that the CECPC of the party under the leadership of Governor Buni was put in place to strengthen the ruling party in the face of some challenges.\nThe Yobe State governor and his committee members have succeeded in attaracting serving and former governors, Senators, House of Representatives members as well as other notable opposition figures to the party."
  },
  {
    "headline": "Insecurity: I Feel Safer In Maiduguri Than Abuja – Ndume",
    "summarized_story": "﻿Solomon Elusoji, LagosChairman of the Senate Committee on Army, Senator Ali Ndume, on Thursday said he is more at ease when visiting Maiduguri than Abuja, the nation’s capital.\n“Once I come to Maiduguri, I feel safer than in Abuja, because somebody can knock down your door with a gun.\nA turning pointSenator Ndume was speaking on the heels of President Buhari’s visit to Borno earlier on Thursday.\nHe came in 10 o’clock and we were going to see various projects until four o’clock this evening before he left,” he said, praising President Buhari’s stamina.\nSenator Ndume also commended President Buhari’s bold welfare plans for the state, including the decision to build 10,000 houses for displaced persons and the provision of financing for a power plant."
  },
  {
    "headline": "Gunmen Abduct Students From Federal Government College In Kebbi",
    "summarized_story": "Gunmen suspected to be bandits have stormed Federal Government College, Birnin-Yauri in Kebbi State and abducted an unspecified number of students and four teachers.\nIn late May, about 200 students of an Islamiyya school in Niger state were abducted by gunmen.\nHe said the Bandits were able to abduct four teachers and an unconfirmed number of students away to an unknown destination.\nAbubakar also disclosed that a policeman lost his life, while one student sustained gun shot injury during an exchange of fire between security operatives and the bandits.\nHe added that security operatives have launched a manhunt for the bandits with a view to rescuing the kidnap victims and arresting the criminals."
  },
  {
    "headline": "‘Give No Breathing Space To Terrorists And Criminals,’ Buhari Charges Security Agents",
    "summarized_story": "﻿President Muhammadu Buhari has urged the military and other security agents not to give breathing space to terrorists and criminals in the country.\nThe President gave the charge on Thursday while addressing personnel of the Armed Forces and security agencies in Operation Hadin Kai at the Maimalari Cantonment during a visit to Borno State.\n“We should not allow our adversaries the opportunity or breathing space to challenge or undermine our national interests and core values.\nThe defence and security agencies should rest assured of the Federal Government’s unalloyed commitment to winning the battle against terror and criminality.\nMuch more equipment will be procured for the Armed Forces to cater for both the short and long-term requirements."
  },
  {
    "headline": "EFCC To Prosecute Orji Kalu All Over Again – Bawa",
    "summarized_story": "﻿Chairman of the Economic and Financial Crimes Commission (EFCC) Abdulrasheed Bawa has said former Abia State governor, Orji Uzor Kalu will be prosecuted by the agency all over again.\nBawa disclosed this on Thursday while addressing journalists during the weekly ministerial chat at the State House in Abuja.\nHe also clarified reports accredited to him concerning the involvement of a Minister in the laundering of about $37 million into real estate.\nBawa said he is confident that when the unit is fully established, corruption will significantly decline in the country.\nAccording to him, most proceeds of crime are laundered through real estate and have become a huge challenge."
  },
  {
    "headline": "Kaunda’s Death Ends Era Of African Leaders Who Fought Colonialism – Obasanjo",
    "summarized_story": "Former Nigerian President, Olusegun Obasanjo says the death of Zambia’s founding father and long-term leader, Kenneth Kaunda, has ended a long list of African leaders who fought colonialism and took over the reins of power at independence.\nPresident Kaunda was visibly pained in his response and at some point he broke down and wept.\n“Let us, African leaders and people, never let the labour of these heroes’ past be in vain,” he said.\nCabinet secretary Simon Miti said in an address on public television that Kaunda “died peacefully” at 2:30 pm (1230 GMT) at a military hospital where he had been admitted on Monday with pneumonia.\n“You have gone at a time we least expected,” he said on Facebook, describing him as a “true African icon.”"
  },
  {
    "headline": "Kenneth Kaunda: One of the greatest African and world leaders of all time – Buhari",
    "summarized_story": "President Muhammadu Buhari has described Zambia’s founding father and independence nationalist Kenneth Kaunda as “one of the greatest African and world leaders of all time who loved his country and people profoundly.”Reacting to Kaunda’s death at the age of 97, the President said “I have received his passing with great shock because I knew his contributions to the development of not only Zambia but also Africa at large.”According to President Buhari, “we can’t forget in a hurry how Kaunda gave shelter to anti-apartheid freedom fighters from South Africa and from former Rhodesia.”The Nigerian leader noted that “the late Kaunda was one of the loudest voices for the liberation of Africa from colonialism and imperialism and he did so with passion and sincerity.\nIt is impossible to reflect on Kaunda’s legacy without acknowledging his selflessness and passion for service.”President Buhari extended his condolences and that of the nation to the family, the government and people of Zambia over Kaunda’s death."
  },
  {
    "headline": "Danish Soccer star Christian Eriksen to get implantable heart defibrillator",
    "summarized_story": "The Danish Football Union (DBU) announced Thursday that Christian Eriksen, who suffered a cardiac arrest during his country’s Euro 2020 opener last weekend, will have a heart defibrillator implanted.\nEriksen is recovering in a Copenhagen hospital after collapsing during Denmark’s European Championship game against Finland.\nAccording to the Danish federation, doctors determined that Eriksen requires an ICD — implantable cardioverter-defibrillator.\n”This device is necessary after a cardiac attack due to rhythm disturbances,” the federation said in a statement.\nThe game will feature a minute’s applause for Eriksen in the 10th minute in honor of his No."
  },
  {
    "headline": "Ibadan Crisis: Gov Makinde visits violence scene, says perpetrators would be brought to book",
    "summarized_story": "Governor of Oyo State, Seyi Makinde has condemned the recent violence in Iwo Road axis of Ibadan which led to the death of two persons.\nThe governor, who toured the affected area, said the government will bring perpetrators of the act to book.\nMakinde described the occurrence as unfortunate, adding that his government has ordered investigations into the violent act.\n“I visited the scene of the Iwo Road incident this morning.\nAdvertisement“I give you my word that we will ensure that everyone involved in the dastardly act is brought to book.,” the governor said."
  },
  {
    "headline": "Zambia’s First President Kenneth Kaunda Dies at 97",
    "summarized_story": "Zambia’s former president, Kenneth Kaunda, the father of Zambia’s independence who led the country for 27 years has died at the age of 97.\nHe had been admitted to the Maina Soko Medical Center, a military hospital in Lusaka, on Monday where authorities disclosed he was being treated for Pneumonia.\nBut a Facebook post by his son Kambarage Kaunda, announced the Zambian founding president’s passage.\nKambarage asked for prayers for his father whom he called Mzee."
  },
  {
    "headline": "30 Schoolgirls Abducted as Terrorists Invade School in Northwest Nigeria’s Kebbi State",
    "summarized_story": "Reports suggest bandits have abducted about 30 students and three teachers of a Federal Government Girls College in northeastern Kebbi State.\nThe heavily armed bandits rode on motorcycles from neighbouring Rijau forest and stormed the school after overpowering the mobile police unit guarding the school.\nThe situation at Birnin Yauri where the school is situated is tensed and people are in the state of confusion.\nThis is definitely not the first attack on schools in northern Nigeria.\nAbductions have become more indiscriminate across northern Nigeria as local criminal gangs view victims as a source of income, and the villagers — who have been ignored by the government — as disposable."
  },
  {
    "headline": "Twitter Suspension Reduced The Spread Of Fake News – Trending With Ojy Okpe",
    "summarized_story": "Garba Shehu, Media Aide to President Mohammadu Buhari has come under fire on social media for saying that the suspension of Twitter has reduced the spread of fake news by governors on the platform of the people’s Democratic Party.\nFollowing the controversial ban of micro blogging platform Twitter, The federal government has asked the house of representatives to enact a law to regulate social and online media in Nigeria.\nU.S. president Joe Biden has apologized to CNN’s chief White House correspondent, Kaitlan Collins, after he lost his temper while speaking during a press conference following the Geneva summit with Russian President Vladimir Putin."
  },
  {
    "headline": "Under My Watch, Nigeria’s Military Has Clear Sense of Direction, Buhari Proclaims in Borno",
    "summarized_story": "Nigeria’s President Muhammadu Buhari says his administration in the past six years has provided the country’s armed forces a firm strategy and clear sense of direction to safeguard the sovereignty and territorial integrity of the West African country.\nPresident Buhari stated this on Thursday in northeastern Borno state when he visited personnel of the country’s security forces of Operation Hadin Kai.\n“Under my watch, the Armed Forces of Nigeria have been provided a firm strategy and clear sense of direction to safeguard the sovereignty and territorial integrity of the country,” Mr Buhari said.\nMuch more equipment will be procured for the Armed Forces to cater for both the short and long-term requirements.\n“I would like, at this point to also commend the hierarchy of our Armed Forces for their strategic foresight in ensuring that some of our critical military equipment are fabricated locally."
  },
  {
    "headline": "Buhari Visits Borno, Says Insurgents and Bandits to Feel Ferocity of Nigeria’s Firepower",
    "summarized_story": "President Muhammadu Buhari has promised to visit on insurgents and bandits the ferocity of the nation’s firepower and the weight of the resolve to allow for peace and security.\nHe said: “Your collective efforts have resulted in the relative peace being enjoyed in the region today.\nThe President said: “Alongside investment in development and reconstruction, we will sustain our investment in the Armed Forces in a manner that balances the “carrot and stick”.\nThe President had touched down at the Nigeria Air Force Base in Maiduguri at 10.15 am where he was welcome by Governor Babagana Zulum and other top dignitaries.\nDriving through the town in a long convoy, he was warming received by an array of students, civil servants and other section of the society who have lined the streets."
  }
]