[
  {
    "headline": "Police rescue two kidnapped children, arrest suspects in Rivers",
    "summarized_story": "The Rivers State Police Command has rescued two children kidnapped in various locations in the state, while three members of the kidnapping syndicate were arrested.\nParading the suspects alongside other alleged criminals at the Police headquarters in Port Harcourt on Friday, the state Commissioner of Police, Friday Ebuka said the rescued children, aged four and 12 were kidnapped from their mother’s shop on September 25, 2020.\nEboka said operatives from the command rescued the children following a covert operation on June 2021, and February 23, 2022, respectively.\nHe added that the police were on the trail of other fleeing members of the gang.\n“You could recall that on 25th of September 2020, two little children were stolen from their mother in her shop, the children are Favour Boniface and Miracle Boniface, and just two days ago on the 23rd of February, 2022, we were able to rescue that little girl and arrest three suspects in connection with that matter."
  },
  {
    "headline": "FG, states, LGAs share N574.6bn in January",
    "summarized_story": "The N574.66bn total distributable revenue comprised distributable statutory revenue of N291.40bn, distributable Value Added Tax revenue of N178.06bn, and Exchange Gain of N5.202 billion and Non-Mineral Revenue of N100 billion.\nThe distributable statutory revenue of N291.4bn was available for the month.\nFrom this, the Federal Government received N122.749bn, the state governments received N62.260bn and the local government councils received N48bn.\nThe sum of N5.507bn allocation to NEDC and N7.649bn cost of the collection were deducted from the N191.2bn gross VAT revenue, resulting in the distributable VAT revenue of N178.06bn.\nFrom the N178.066 billion distributable VAT revenue, the Federal Government received N26.710bn, the state governments received N89.033bn and the Local Government Councils received N62.32bn."
  },
  {
    "headline": "Edo banks robbery: cash, vehicles recovered from fleeing robbers",
    "summarized_story": "In the course of the robberies, eight persons made up of two policemen and six civilians including a mad man reportedly lost their lives.\nA press statement by the Edo State Command Police Public Relations Officer, Kontongs Bello(SP) late yesterday said a combined of police and vigilante groups evacuated the abandoned items to the police station.\nEZA 105 KJA, One ash Colour Camry Car with Reg.\nKWL 19 DU, One Dark Ash colour corolla car with Reg.\nENU 204 QL, Two small bags containing women’s Items, one Union Bank ATM card and Cash Sum Thirty-four million, five hundred and ten thousand Naira only ( #34,510,000.00)."
  },
  {
    "headline": "Rep Onuigbo excited as work finally begins on Umuahia-Ikot Ekpene road",
    "summarized_story": "Sam Onuigbo, has expressed delight as the total reconstruction of Umuahia-Ikot Ekpene federal road has finally commenced after years of dilapidation, agony and public outcry.\nAddressing newsmen yesterday, while inspecting work on the 50-kilometre road, Onuigbo said the total reconstruction of the federal highway would end the ordeals of his constituents, commuters and motorists plying the road.\nHe assured that the firm had fully mobilised to fix the road and promised that the highway would wear a new look in the weeks ahead.\nEarlier during the commissioning of market and water borehole, the folks of Obuohia had showered encomiums on Rep. Onuigbo for alleviating their plights and for his numerous interventions in the community.\nThe event was attended by people from the neighbouring Nkalu Ifa community in Akwa Ibom State that equally make use of the market."
  },
  {
    "headline": "2023: I’ll resolve issues surrounding NIGERCEM within 100 days in office, says PDP Governorship election aspirant",
    "summarized_story": "By Peter Okutu, AbakalikiA Peoples Democratic Party (PDP), governorship aspirant for the 2023 general election in Ebonyi State, Dr Ezeh Emmanuel Ezeh, yesterday stated that he would resolve issues surrounding the lack of productivity of the Nigeria Cement Company, Nkalagu, within his 100 days in office as Governor of the State.\nDr. Ezeh has declared his interest to contest the governorship position in the 2023 general election.\nDr Ezeh, an Oxford University-trained Entrepreneur and businessman of good repute, made this known during Ebonyi State PDP expanded State Executive Council meeting held in Abakaliki.\n“With the present challenges facing Nigeria and Ebonyi State now, Ebonyi requires a man of ideas.\nDr Ezeh called on PDP to ensure that zoning in maintained in Ebonyi State noting that Ebonyi State was created as a prayer answered from oppression and neglect."
  },
  {
    "headline": "Warri Stadium was never abandoned by Okowa – Ossai",
    "summarized_story": "Warri StadiumThe Special Assistant on Media to the Delta State Governor Mr. Ossai Ovie Success has described All Progress Congress APC in Delta State as an uninformed Party.\nOssai who disclosed this on his Facebook page noted that the statement signed by the State APC Director Of Publicity, Dr. Omene Odafe Wilson about Governor Okowa abandoning Warri township stadium is laughable.\n“The fact is that Governor Okowa being a sport lovely governor never abandoned Warri township stadium.\nThe same uninformed APC will be the same people who will come out, later on, to castigate the governor for reconstructing the Warri Stadium without solving the flood issues surrounding the stadium and warri city.\nI must commend Pastors Korede and his lovely wife Esther Komaya together with the Master’s Place International Church, Effurun for their services toward the beautification of Warri stadium even as the state government continues solving the flooding challenges facing Warri and the reconstruction of the Warri stadium at the end of the ongoing draining work.” he said."
  },
  {
    "headline": "2023: We’ll mobilise one million youths to galvanise support for presidential bid of Funmi Adekojo — EYN",
    "summarized_story": "Dayo Johnson AkureA group, under the aegis of the Ekiti State Youth Network (ESYN) has promised to mobilise one million youths to galvanise support for the Presidential ambition of Dr Funmilayo Wahhed- Adekojo in 2023.\nThey stated this at an emergency meeting held in Ado- Ekiti, Ekiti state weekend.\nThe group in a statement issued by its State Coordinator, Adeyemi Azeez and Organising Secretary, Adewumi Ifeoluwa said that Waheed Adekojo remained the best material for the presidential election in 2023.\nAccording to them ” we are ready to galvanise support for the presidential ambition of Waheed Adekojo across the country.\nThe group added that time is now ripe for Dr Funmilayo Waheed-Adekojo to govern Nigeria”."
  },
  {
    "headline": "Nigeria diversifying from oil – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo says Nigeria is diversifying from the oil sector so as to boost rapid economic growth through jobs.\nThe VP spoke on Friday at the commissioning of the Kimberly-Clark Huggies Diaper Manufacturing Plant in Ikorodu, Lagos.\nNoting that seven million babies are born every year in Nigeria, Osinbajo expressed excitement that the factory signaled the beginning of greater investments.\nOn FG’s National Development Plan 2021-2025 sector collaboration), Osinbajo stressed that the success of the plan depends greatly on a conscious reliance on private enterprise and initiative.\nOsinbajo highlighted the 7th 60-day National Action Plan (NAP 7.0) on Ease of Doing Business by the Presidential Enabling Business Environment Council (PEBEC)."
  },
  {
    "headline": "Electoral Act: INEC holds extra-ordinary meeting Saturday",
    "summarized_story": "The Independent National Electoral Commission (INEC) has said the nation now has an Electoral Act 2022, which replaced the Electoral Act 2010 (as amended).\nThis followed the signing into law of the Electoral Bill by President Muhammadu Buhari on Friday.\nThe commission, in a statement by Barrister Festus Okoye, the National Commissioner and Chairman Information and Voter Education, said that given the tight timelines contained in the new law, the commission fully appreciates the importance of proceeding with their implementation in earnest, adding that an extraordinary meeting of the COMMISSION has been scheduled to hold on Saturday February 26, in order to discuss on the way forward.\nAccording to him, the 1999 Constitution (as amended) and the new Act will now constitute the principal law to govern the conduct of future elections, including the 2023 General Election."
  },
  {
    "headline": "Ukraine vs Russia: Aisha Buhari calls for ‘calm’",
    "summarized_story": "President Muhammadu Buhari’s wife, Aisha, has joined Nigerian parents in prayers and solidarity for the safe evacuation of their children and Nigerian students trapped in the troubled nation of Ukraine.\nMrs Buhari, however, commended the Federal Government’s directive on the evacuation of 5,600 Nigerian students trapped in Ukraine.\nShe wrote: ”In view of the state of heightened insecurity in Ukraine, I stand with all Nigerian parents in praying for global peace and human solidarity.\n”I commend the directives of (the) federal government and the House of Representatives for the evacuation of our more than 5,600 students trapped in the conflict.\nThe conflict escalated on Friday, with reports of fighting within the capital city of Kyiv."
  },
  {
    "headline": "President Biden nominates first black woman for US Supreme Court",
    "summarized_story": "United States President, Joe Biden, has nominated Judge Ketanji Brown Jackson for the Supreme Court on Friday, according to the White House.\nJackson, who currently sits on the US Court of Appeals for the District of Columbia Circuit, will be the first black woman serving on the country’s highest court if the Senate confirms the nomination.\nJackson will break the court’s 232-year history if confirmed.\nThe nomination came about a month after Supreme Court Justice Stephen Breyer, a longtime liberal, said that he was about to retire this summer after nearly three decades on the bench.\n“The Senate should move forward with a fair and timely hearing and confirmation.’’Biden will deliver remarks announcing the nomination at the White House on Friday afternoon."
  },
  {
    "headline": "Gov. Ugwuanyi, Sen. Utazi, Supreme Court Judge, others celebrate Michael Ajogwu at 80",
    "summarized_story": "It was edited by the first son of the celebrant, Prof. Fabian Ajogwu, SAN.\nPresenting his goodwill message at the event, titled: “Plaudits for an Achiever @ 80: Dr Michael Ajogwu, SAN”, Gov.\nUgwuanyi conveyed the warmest felicitations of the government and good people of Enugu State to Dr Ajogwu “on this joyous occasion of your 80th Birthday celebration”.\nUgwuanyi expressed delight that Dr Ajogwu at 80 stands strong, “strong enough to discharge critical duties which even the younger generation dread to discharge”.\nDignitaries at the event also include the Chief Judge of Akwa Ibom State, Hon."
  },
  {
    "headline": "Ukraine: FG assures Nigerians of safe evacuation",
    "summarized_story": "Putin ready for talks with Ukraine delegation in MinskRussian forces enter Kyiv, ready to overthrow presidentNATO holds emergency summit over crisisThe Federal Government yesterday assured Nigerians living in Ukraine of their safe evacuation amidst Russia’s multiple attacks on Ukraine.\nThe minister assured Nigerians that the ministry was following the event since it began and assured of the Federal Government’s readiness to speedily ensure the safe evacuation of Nigerians, particularly the students in Ukraine.\n‘Putin ‘ready’ for talks with Ukraine’The Kremlin (Russian government) said yesterday that President Vladimir Putin was ready to send a delegation to Belarus for talks with Ukraine.\nRussia has thousands of troops stationed in Belarus, and Ukraine said it was being attacked from several sides – including from Belarus.\nIn different formats and in any place.”As Russian troops closed in on Kyiv yesterday, Zelenskyy issued a new statement urging talks."
  },
  {
    "headline": "Court freezes Katsina local governments joint account",
    "summarized_story": "Justice Emeka Nwite of the Federal High Court, Abuja, has ordered the freezing of the Katsina State Local Governments Joint Account following the inability of the state government to pay the entitlements of the dissolved local government chairmen and councillors.\nIn a suit number FHC/ABJ/CS/122/2022, Justice Nwite ordered that the state’s local government joint account should remain frozen till March 21, 2022.\nHe spoke while addressing the dissolved chairmen and their councillors at the party’s secretariat in Katsina.\nMajigiri explained that the Federal High Court, in a garnishing order issued on 16th February, has frozen the joint account of the state local governments till March 21, 2022.\nHe said: “When Aminu Masari refused to comply with the judgment of the Supreme Court, we decided to go and seek a garnishing order from the Federal High Court and the garnishing order has been granted by the court."
  },
  {
    "headline": "Varsities shutdown looms as SSANU, NASU, NAAT threaten strike",
    "summarized_story": "The university – based unions include: the National Association of Academic Technologists (NAAT), Senior Staff Association of Nigeria Universities (SSANU) and the Non-Academic Staff Union of Educational and Associated Institutions (NASU).\nThe JAC of NASU and SSANU said it could no longer guarantee industrial peace in the university system.\nHe added that a two-week warning strike would be declared by NAAT on March 17, 2022 at the expiration of the two week grace (February 28 – March 14) without concrete feedback from the government.\nBy March 17, the National Executive Council will meet and declare a warning strike.\n“The warning strike will be for two weeks after which NAAT will embark on an indefinite strike until our demands are met."
  },
  {
    "headline": "MTN, Mafab pay for 5G Spectrum, says NCC",
    "summarized_story": "The Nigerian Communications Commission has confirmed full payments of 273.6 million dollars each by MTN Nigeria and Mafab Communications Ltd for 5G Spectrum license.\nThe statement reads:”Provisional winners of the 3.5 Gigahertz (GHz) spectrum licence, MTN Communications Nigeria Plc and Mafab Communications Limited, have made their full payment of $273.6 million each for the 5G Spectrum license to the Nigerian Communications Commission.\n“The Executive Vice Chairman of the Nigerian Communications Commission (NCC), Prof. Umar Danbatta, officially confirmed the payment status today, February 24, 2022, just as the deadline set for the two winners of the spectrum auction elapsed.\nBy the deadline for receipt of applications on November 29, 2021, the Commission received applications from three licensed telecommunications companies, namely: Airtel Networks Limited, Mafab Communications Limited, and MTN Communications Nigeria Plc.\nThe Provisional licence winners were then directed to pay the Winning Bid Price less the Intention-to-Bid Deposit, by February 24, 2022."
  },
  {
    "headline": "Robbers abandon N34.5m, vehicles after confrontation with youths in Edo",
    "summarized_story": "Edo Police Command last night disclosed that N34, 510,000 was recovered from fleeing armed robbers who Thursday evening, attacked four commercial banks at Uromi, headquarters of Esan Northeast Local Government Area of the state.\nMeanwhile, Edo Governor Godwin Obaseki, yesterday described the Uromi robbery as well organised, while suing for calm.\nObaseki stated this when he led other top Edo government functionaries for an on-the-spot assessment of the scene of the robbery.\nWe are here on behalf of the governor to find out what happened and know the extent of the damage.\n“I am here with all the security chiefs and have seen the damage and beefed up security in the area."
  },
  {
    "headline": "G7 countries meet FG over Russia-Ukraine crisis",
    "summarized_story": "From Aidoghie Paulinus, AbujaEnvoys of the Group of Seven (G7) countries, yesterday, met with the Federal Government over the Russia-Ukraine crisis.\nWhile commending Nigeria for putting in its weight, Ory stated that Nigeria is a very important voice that the world needed to hear.\nResponding, Onyeama restated Nigeria’s condemnation of the military incursion into Ukrainian territory by Russia.\nOnyeama added that the Federal Government made it clear that Nigeria does not condone those aggressions and urged Russia to pull back and stop intervention and urged peace and diplomacy to be prioritised by both sides.\n“We support every effort being made to stop the aggression and Russian troops to return to Russia,” Onyeama said."
  },
  {
    "headline": "Breaking: Buhari signs Electoral Act Amendment into law",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari at exactly 12:27 signed the long-awaited Electoral Act Amendment Bill 2021, into law.\n“It is gratifying to note that the current Bill comes with a great deal of improvement from the previous Electoral Bill 2021.\nPresident Buhari noted that the National Assembly forwarded the Electoral Bill for Presidential Assent, via a letter dated 31st January, 2022.\nSenate President, commended Buhari for signing the bill into law despite his reservations on 84(12) of the Electoral Bill, 2022.\nI can count off head at least 10 to 15 provisions in that electoral law, that if properly executed by INEC, and the people who the laws are made for, it will be a turning point in electoral Electoral history of Nigeria."
  },
  {
    "headline": "2023: Business group pressures Osinbajo to contest for presidency",
    "summarized_story": "From Fred Itua, AbujaA group, Business Men For Osinbajo (BFO), has urged Vice President Yemi Osinbajo to run for the 2023 presidential election promising to buy the All Progressives Congress (APC) nomination form for him.\nHe said though Osinbajo was yet to declare his interest for the presidency, the group was putting structures in place to ensure he emerges the next president.\nCo-convener of BFO, Mr. Olatunji Davies, said business owners were pushing for an Osinbajo presidency because of his acceptability by Nigerians, irrespective of the economic, social, religious and ethnic background.\n“Our group called the Business Men for Osinbajo (BFO) is officially launched as a first major step to change the narrative.\nThe mandate is simple: to deliver the incoming President Come 2023, Professor Oluyemi Osinbajo.”"
  },
  {
    "headline": "Opebi plane crash: Aircraft didn’t have sufficient fuel for destination –AIB",
    "summarized_story": "It also stated that in spite of this challenge, the pilot still wanted to get to destination even after noticing that.\nSpeaking during the realease of four accident reports in Abuja on Thursday, AIB-N Commissioner, Akin Olateru, said there was fuel exhaustion at low altitude and the low speed landing led to loss of control in flight.\nThe report also blamed lack of effective management supervision of the airline’s flight operations as well as inadequate safety oversight.\n“Quorum Aviation must make sure that all its personnel are well acquainted with their respective schedules of responsibilities and are capable of discharging their duties effectively in line with their standard operating procedures,” Olateru said.\nRegular individuals can earn as low as $300 daily Find out how it works."
  },
  {
    "headline": "Abia community lauds Kalu over road reconstruction",
    "summarized_story": "From Okey Sampson, UmuahiaThe people of Amankalu-Alayi community in Bende Local Government Area of Abia State has commended Senate Chief Whip, Dr. Orji Uzor Kalu, for the reconstruction of their road.\nTh lawmaker representing Abia North had, last year, attracted the reconstruction of the two-kilometre Amankalu-Alayi-Akoli-Imenyi Road.\nExpressing the community’s delight, President General of Amankalu-Alayi, Iheanyi Okoronkwo, said it was the first time his people were benefitting from any government largesse.\nThe president general said his people were surprised when the project was flagged off and completed within the stipulated time.\nA community leader, Eme Mba, said his people would remain eternally grateful to Kalu for attracting the reconstruction of the road."
  },
  {
    "headline": "Breaking: Court Freezes Katsina LGs Joint Account",
    "summarized_story": "Francis Sardauna in KatsinaA Federal High Court sitting in Abuja has ordered the freezing of the Katsina State Local Governments Joint Account following the inability of the state government to pay the entitlements of the dissolved local government chairmen and councillors.\nThe court, presided over by Justice Emeka Nwite, in a suit number FHC/ABJ/CS/122/2022, ordered that the state’s local government joint account should remain frozen till March 21, 2022.\nMajigiri explained that the Federal High Court, in a garnishing order issued on 16th February, has frozen the joint account of the state local governments till March 21, 2022.\nHe said: “When Aminu Masari refused to comply with the judgment of the Supreme Court, we decided to go and seek a garnishing order from the Federal High Court and the garnishing order has been granted by the court.\nHe added that the state government would present all evidence of payment before the Federal High Court on the next adjournment date of March 21, 2022."
  },
  {
    "headline": "In Signing Electoral Law, Buhari Asks N’Assembly to Amend Section that Bars Political Appointees from Participating in Party Primaries",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari on Friday signed into law the reworked Electoral Act Amendment Bill transmitted to him by the National Assembly on January 31 with a call on the legislative arm to delete Section 84(12) of the Act which bars political office holders from participating in their parties’ primaries.\nHe, however, stressed the need to amend section 84(12), which contravenes the rights of political office holders to vote, or be voted for in political party conventions and congresses.\nHis words: “Distinguished Senators and Honourable Members of the National Assembly, from the review it is my perspective that the substance of the Bill is both reformative and progressive.\nI am making this bold declaration because I foresee the great potentials of the Bill.\nWorthy of note include the democratic efficacy of the Bill with particular reference to sections 3, 9(2), 34, 41, 47, 84(9), (10) and (11) among others."
  },
  {
    "headline": "News in Photographs: Buhari Signs New Electoral Law",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "Breaking: Buhari Signs Electoral Act Amendment Bill into Law",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari on Friday signed the reworked Electoral Act Amendment Bill into law.\nThe President who signed the Electoral Amendment Act at about 12.25pm at the State House, was supported by the President of the Senate, Dr Ahmad Lawan; Speaker of the House of Representatives, Hon Femi Gbajabiamila, and Chief of Staff to the President, Prof Ibrahim Gambari, and other top government officials.\nThe National Assembly had transmitted the reworked Electoral Amendment Bill to the President for his assent on January 31, 2022.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Global Order in Peril As Russia Invades Ukraine",
    "summarized_story": "Owing to the attack, oil prices jumped yesterday, with Brent rising above $105 a barrel for the first time since 2014, after the attack exacerbated concerns about disruptions to global energy supply.\nThe Russian attack began around 4:30 am in Ukraine yesterday, with a barrage of over 100 ballistic, cruise and surface-to-air missiles, and included 75 medium and heavy bombers.\nThe U.S. already has about 90,000 troops in Europe and has deployed more to the continent as tensions simmered in the weeks before Russia’s invasion of Ukraine.\n“President Putin has re-introduced war to the European continent.\nAhmed Munir lamented that the conflict between Russia and Ukraine was deteriorating by the hour."
  },
  {
    "headline": "BREAKING: Court Sentences Billionaire Kidnapper, Evans, Two Others To Life Imprisonment",
    "summarized_story": "Chukwudimeme Onwuamadike, aka Evans, and two others, have been declared guilty of kidnapping and sentenced to life imprisonment by a Lagos High Court, sitting in Ikeja.\nJustice Hakeem Oshodi of the Lagos High Court in Ikeja on Friday sentenced the man popularly known as billionaire kidnapper or Evans, and his accomplices – Uche Amadi and Okwuchukwu Nwachukwu to life imprisonment.\nThe Ikeja High Court premises in Lagos were under tight security as the judge gave the verdict.\nThe judge, however, discharged and acquitted the other co-defendants: Ogechi Uchechukwu, Chilaka Ifeanyi, formerly a soldier; and Victor Aduba, also an ex-soldier.\nThe court said there was no evidence linking them to the crimes."
  },
  {
    "headline": "BREAKING: Court Sentences Billionaire Kidnapper, Evans, Two Others To Life Imprisonment",
    "summarized_story": "Chukwudimeme Onwuamadike, aka Evans, and two others, have been declared guilty of kidnapping and sentenced to life imprisonment by a Lagos High Court, sitting in Ikeja.\nJustice Hakeem Oshodi of the Lagos High Court in Ikeja on Friday sentenced the man popularly known as billionaire kidnapper or Evans, and his accomplices – Uche Amadi and Okwuchukwu Nwachukwu to life imprisonment.\nThe Ikeja High Court premises in Lagos were under tight security as the judge gave the verdict.\nThe judge, however, discharged and acquitted the other co-defendants: Ogechi Uchechukwu, Chilaka Ifeanyi, formerly a soldier; and Victor Aduba, also an ex-soldier.\nThe court said there was no evidence linking them to the crimes."
  },
  {
    "headline": "BREAKING: Police Reinvite Sowore After Illegal Arrest As Buhari's Minister, Malami, Nwoko Secure Judge To Remand Activist In Prison Custody",
    "summarized_story": "The Nigeria Police Force has again invited human rights activist, Omoyele Sowore over a frivolous petition by a former member of the House of Representatives, Ned Nwoko.\nA team of armed policemen who laid siege to the entrance of the Court of Appeal had on Thursday arrested Sowore.\nA police source told SaharaReporters that Nigeria's Attorney-General of the Federation (AGF) and Minister of Justice, Abubakar Malami and Nwoko were unhappy the activist was released.\nThe source added that the duo has secured a judge to remand Sowore in prison as soon as he honours today’s invitation.\nThey have secured a judge to remand in prison custody today,” the source said."
  },
  {
    "headline": "BREAKING: Police Reinvite Sowore After Illegal Arrest As Buhari's Minister, Malami, Nwoko Secure Judge To Remand Activist In Prison Custody",
    "summarized_story": "The Nigeria Police Force has again invited human rights activist, Omoyele Sowore over a frivolous petition by a former member of the House of Representatives, Ned Nwoko.\nA team of armed policemen who laid siege to the entrance of the Court of Appeal had on Thursday arrested Sowore.\nA police source told SaharaReporters that Nigeria's Attorney-General of the Federation (AGF) and Minister of Justice, Abubakar Malami and Nwoko were unhappy the activist was released.\nThe source added that the duo has secured a judge to remand Sowore in prison as soon as he honours today’s invitation.\nThey have secured a judge to remand in prison custody today,” the source said."
  },
  {
    "headline": "Russia Threatens Military, Political Consequences If Sweden, Finland Try Joining NATO",
    "summarized_story": "Russia has threatened \"military and political consequences\" against Finland and Sweden if they attempt to join NATO.\nRussian foreign ministry spokesperson Maria Zakharova warned against other countries attempting to join NATO after Russia started a war with Ukraine Thursday, The Hill reports.\n\"Finland and Sweden should not base their security on damaging the security of other countries and their accession to NATO can have detrimental consequences and face some military and political consequences,\" Zakharova said in a viral clip of a press conference.\nFinland and Sweden have given significant military and humanitarian support to Ukraine since Russia invaded.\nRussia and Ukraine are both sending delegations to Belarus to discuss Ukraine potentially adopting a nonaligned status with NATO."
  },
  {
    "headline": "Panic as explosion rocks Niger community",
    "summarized_story": "Residents of Niger have been thrown into panic following an explosion that occurred in Galadima Kogo community of the state.\nYusuf Kokki, co-convener of Concerned Shiroro Youths, disclosed the development in a statement on Friday.\nThe development comes days after an explosive device detonated in Galadima Kogo community in Shiroro LGA, killing 10 persons including security operatives.\nTheCable understands that the explosion was heard by security operatives stationed at Erena, while they were travelling through Galadima Kogo to Kuta, the headquarters of Shiroro LGA.\nSpeaking with TheCable on Friday, Salis Sabo, spokesperson of the Coalition of Shiroro Youths, said the security operatives who reported the incident said the explosion was heard twice."
  },
  {
    "headline": "Panic as explosion rocks Niger community",
    "summarized_story": "Residents of Niger have been thrown into panic following an explosion that occurred in Galadima Kogo community of the state.\nYusuf Kokki, co-convener of Concerned Shiroro Youths, disclosed the development in a statement on Friday.\nThe development comes days after an explosive device detonated in Galadima Kogo community in Shiroro LGA, killing 10 persons including security operatives.\nTheCable understands that the explosion was heard by security operatives stationed at Erena, while they were travelling through Galadima Kogo to Kuta, the headquarters of Shiroro LGA.\nSpeaking with TheCable on Friday, Salis Sabo, spokesperson of the Coalition of Shiroro Youths, said the security operatives who reported the incident said the explosion was heard twice."
  },
  {
    "headline": "EXTRA: It's a thinking job not bricklaying, says Tinubu on being fit to contest presidency",
    "summarized_story": "Bola Tinubu, a chieftain of the All Progressives Congress (APC), says he is psychologically fit to contest the presidency in 2023.\nTinubu said this on Friday when he visited the palace of Jimoh Olanipekun, the Ataoja of Osogbo, to inform the latter of his 2023 presidential ambition.\nSpeaking on the development, Tinubu said becoming president is more about a person’s thinking capacity than physical strength.\n“I am applying for a thinking job and I will do it right.\nWe need progress for our country and we need someone that can do this."
  },
  {
    "headline": "EXTRA: It's a thinking job not bricklaying, says Tinubu on being fit to contest presidency",
    "summarized_story": "Bola Tinubu, a chieftain of the All Progressives Congress (APC), says he is psychologically fit to contest the presidency in 2023.\nTinubu said this on Friday when he visited the palace of Jimoh Olanipekun, the Ataoja of Osogbo, to inform the latter of his 2023 presidential ambition.\nSpeaking on the development, Tinubu said becoming president is more about a person’s thinking capacity than physical strength.\n“I am applying for a thinking job and I will do it right.\nWe need progress for our country and we need someone that can do this."
  },
  {
    "headline": "'Prioritise diplomacy' -- FG asks Russia to withdraw troops from Ukraine",
    "summarized_story": "The Nigerian government has asked Russia to withdraw its troops from Ukraine and embrace diplomatic measures to address the current crisis involving both countries.\nGeoffrey Onyeama, minister of foreign affairs, said this on Friday after a meeting with the envoys of the G7 countries in Nigeria.\nMonths of tensions between Russia and Ukraine took another dimension on Thursday with airstrikes recorded in Ukraine.\nAdvertisementIn a televised address on Friday, Russian President Vladimir Putin called on the Ukrainian military to seize power in their country.\nThe German ambassador commended Nigeria for taking a position, adding that the federal government’s stance is an important voice the world needs to hear."
  },
  {
    "headline": "Kenyan influencers were paid $10 to $15 to discredit controversial bills on Twitter",
    "summarized_story": "The bills are the Reproductive Healthcare Bill and the Assisted Reproductive Technology Bill, also known as the Surrogacy Bill.\nThe Mozilla report reveals that CitizenGO paid the owner of these accounts or “disinformation influencers” around $10 to $15 to make tailored tweets that discredited the bills.\nIn response to this report, Twitter has permanently suspended 240 accounts connected to this disinformation campaign for violating its platform manipulation and spam policy.\nHeightening Twitter Trend’s criticismTwitter’s Trends section helps users identify the most discussed topics on the platform and also help them find popular information or discussion.\nLast year, a Buzzfeed investigation revealed that Nigerian influencers paid to tweet in a coordinated manner successfully manipulated Twitter Trends in order to sway public opinion and court judgement in favour of Venezuelan politician, Alex Saab."
  },
  {
    "headline": "Payroll tech heats up in Africa, on the heels of a booming fintech sector",
    "summarized_story": "Amid the fintech boom, new frontiers are being explored by African entrepreneurs in the sector, one of which is payroll and corporate benefits management.\nThrough web portals or mobile self-service apps, companies can track time, process a locally compliant payroll, and pay their employees.\nZuberi is a Ghana-based earned wage access platform.\nIt’s easy to see why investors are backing payroll fintechs or broadly tech startups digitising the administrative stack for companies.\nAnd to increase chances of repayment, Bento Africa requires employees that apply for its loans to take unemployment and health insurance covers."
  },
  {
    "headline": "Nigeria’s 5G race: MTN and Mafab pay $547.2m licence fee",
    "summarized_story": "The winners of the bid for 3.5GHz 5G spectrum, MTN and Mafab have each completed payment of the $273.6m licence fee required by the Nigerian Communications Commission (NCC).\nHow MTN and Mafab wonThe top bidders were Airtel Networks Limited, Mafab Communications Limited and MTN Communications Nigeria Limited, with the bidding price starting at $199,374,000.\nSimply put, Airtel offered to pay the least amount among the three companies for the 5G licence, thus falling out of the race.\nMafab Communications Limited was registered on July 8, 2020, according to the company’s website and TechCabal’s search on the Corporate Affairs Commission (CAC) site.\nThe race to deploy 5G in Nigeria is still on, as MTN and Mafab head into the deployment phase."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "What Flutterwave’s fintech as a service means for the African tech ecosystem",
    "summarized_story": "In addition to its payment infrastructure, the startup unveiled the addition of Apple and Google Pay, Grow (its SME financing service), and fintech as a service (FaaS).\nAkurateco, a Dutch software provider, defines fintech as a service as offering financial technology as a service.\nAdvertisementFlutterwave founder and CEO, Olugbenga AgboolaAfrican API fintech startups have gained more attention in recent years, but they often focus on a few services.\nBy enabling other companies to integrate financial services to existing offerings, they allow the businesses to expand already existing offers.\nOutsourcing the provision of their fintech services could, therefore, leave startups at the mercy of the service provider as they often lose control over the quality and security of their fintech service."
  },
  {
    "headline": "Can Russia-Ukraine tensions spark World War III?",
    "summarized_story": "While tensions between Russia and Ukraine, a former Soviet republic, had existed for some time, the situation began to spiral out of control in early 2021.\nAdvertisementUkrainian president, Volodymyr Zelenskyy, urged US president, Joe Biden, to allow Ukraine to join NATO in January of last year.\nSadly, 14,000 people have died in Ukraine since 2014; I’m sure many more will perish if caution is not exercised.\nPlus, I think this conflict has the potential to spark World War III.\nAccording to CoinGlass data, $462.91 million in cryptocurrency has been ‘rekt’ – financially lost – since two nights ago, Wednesday, February 23, 2022."
  },
  {
    "headline": "Space Universe Africa launches new technology-enabled R&D lab to power next layers of human advancements from Africa",
    "summarized_story": "Also, a significant product of Space Universe Africa known as the School of Ground Truth embodies this principle.\nSpace Universe Africa is solving problems on many fronts, and here are some of their products that are doing just that.\nWith Awamaridi, Space Universe Africa plans to take a bold step into space and chart the unknown to make life better for humans while creating a healthy environment.\nCurrently serving companies across verticals like media and gaming, the company is furthering its vision to build the continent of our dreams through its innovative Space Universe Africa R&D lab.\nTo learn more about this lab and what Space Universe Africa represents, visit https://spaceuniverse.africa/."
  },
  {
    "headline": "FAQ Troubleshooting",
    "summarized_story": "Relevant discussion thread is https://wordpress.org/support/topic/234726Top ↑Why isn’t the admin user listed as an author when editing posts?\n# Why isn’t the admin user listed as an author when editing posts?\nnewadmin) with Administrator Role Login as ‘newadmin’ Degrade the old ‘admin’ user to Role of Subscriber and Save Promote the old ‘admin’ back to Administrator Role and Save Login as the old ‘admin’If that doesn’t work, try:Create a new admin user (e.g.\nnewadmin) with Administrator Role Login as ‘newadmin’ Delete the old ‘admin’ user and assign any posts to ‘newadmin’ Create ‘admin’ user with Administrator Role Login as ‘admin’ Delete ‘newadmin’ user and assign posts to ‘admin’Top ↑Why is the wrong author name displayed for a post on a blog?\nThere are various resources that will help you find more help with WordPress, in addition to these FAQ."
  },
  {
    "headline": "‘Sons’ of Benson Idahosa to hold Mega-Conference in September – Nigerian Observer",
    "summarized_story": "The conference tagged ‘Sons of Benson Idahosa Conference (SOBIC) is scheduled to hold in September later this year and will be a convergence of every man and woman whose life has been impacted directly or indirectly by the Archbishop Benson Idahosa of blessed memory.\nAnother member of the AA Governing Body, Bishop Chris Otaigbe said ”The Sons of Idahosa Conference is kick-starting a movement and it will be a yearly event.\nIf the man Benson Idahosa were here with us , a lot of the manifestations in our midst today would not have happened.\nWith Archbishop Benson Idahosa coming into the center stage of Christianity, that expression no longer exists.\nThe Sons of Benson Idahosa Conference (SOBIC) 2022 is scheduled to come up in September later this year."
  },
  {
    "headline": "Obaseki pays tribute to late Imasogie, hails contribute to devt of Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has paid glowing tributes to the late philosopher, preacher, Baptist minister and scholar, Prof. Osadolor Imasogie, describing him as a great bridge builder who contributed immensely to the development of mankind.\nOsaigbovo Iyoha and other top government functionaries to commiserate with the family of late Prof. Imasogie, said the late philosopher touched many lives while here on earth and will be sorely missed.\nThe governor noted, “I am here to commiserate with the Imasogie family over the passing of the patriarch of the family, late Rev.\nProf. Osadolor Imasogie, who touched many lives while here on earth.\nProf. Osadolor Imasogie was an institution, a point of reference and represented a bridge for this generation."
  },
  {
    "headline": "Edo residents hail Obaseki, NEWMAP for gully erosion, flood control interventions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki and the Nigeria Erosion and Watershed Management Project (NEWMAP) in Edo State have been commended for bringing succor and restoring the hope of residents in flood-prone communities in the state.\nSome residents, who are beneficiaries of the project’s gully sites and flood alleviation intervention within the Benin metropolis, said the government has continued to alleviate their sufferings, improving the living standards of the people.\nAccording to Pastor Samuel Omo, “We thank Governor Godwin Obaseki for prioritizing the wellbeing of Edo people, embarking on projects to better the lives of residents.\nThe gully erosion, formerly, reduced most landlords in our communities to tenants as flood and silt took over our houses and lands.\nOn his part, Elder Richard Omwenyeke, a resident of Ebo Street, thanked the government for the massive erosion control projects from Gapiona to Amagba River."
  },
  {
    "headline": "Edo govt, automobile dealers partner to host Africa’s biggest car auction, expo in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State Government is collaborating with local and international automobile dealers to host Africa’s biggest car auction and expo in Benin City, the Edo State capital.\nThe Edo Car Auction 2022 (ECA 22) will serve as a platform to link buyers and sellers of automobiles across the globe, ensuring access to affordable and quality automobiles.\n“We are glad to be uniting the biggest automobile dealers across the world and our local car dealers in Benin City with car buyers and promoters to enhance access to quality and cheap cars through our forthcoming Edo Car Auction, which is well-positioned to become the biggest car auction and expo in Africa.\nAccording to him, “This is not just for car dealers, but other citizens who have cars to sell.\nFidelis Okungbowa and ECA Legal Adviser and Assistant Secretary of Motor Dealers Association of Nigeria, Edo State Chapter, Mr. Paul Akhilomen, among others."
  },
  {
    "headline": "Electoral Act: Buhari Asks NASS to amend section stopping appointees from contesting elections",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has asked the National Assembly to amend the section of the Electoral Act which bars political appointees from electoral contest.\nBuhari made the demand while signing the bill at the presidential villa in Abuja on Friday.\nSection 84 (12) of the bill makes it mandatory for political appointees who want to run for office in 2023 to resign.\nWhile signing the bill into law, Buhari said section 84(12) of the act contravenes the rights of political office holders to vote, or be voted for in political party conventions and congresses.\n“The practical application of section 84(12) of the Electoral Bill, 2022 will, if assented to, by operation of law, subject serving political office holders to inhibitions and restrictions referred to under section 40 and 42 of the 1999 Constitution as amended."
  },
  {
    "headline": "Air Peace dismisses allegations of disrespecting Emir of Kano, says it couldn’t delay flight because of him, others",
    "summarized_story": "West Africa’s leading airline, Air Peace has said it did not disrespect the Emir of Kano, Alhaji Aminu Ado Bayero.\nThe airline said this while responding to a letter of complaint written by a cousin to the Emir, Prince Isa Bayero.\nAccording to the Air Peace, contrary to the insinuation that the Emir was disrespected, the Airline even protected the image of the Emir.\nThe COO added, “On seeing that it was Isa Bayero calling, he took the call.\n“I am the Chief Operating Officer (COO) of Air Peace."
  },
  {
    "headline": "Performers thrill fans at Fidelity Bank’s The Euphoria Event",
    "summarized_story": "With spell binding musical performances from Johnny Drille, Chike and Fave as well as interesting games, The Euphoria lived up to its billing as a major A-class event in Nigeria’s entertainment schedule in 2022.\nHosted by leading Nigerian bank, Fidelity Bank Plc in commemoration of the Valentine’s season on Saturday, 19 February 2022, the well-attended event saw a host of customers, students and staff of the bank bask in a convivial atmosphere as the bank took them through several themed activities.\nThe event showcased a fully interactive experience centre, which featured photo booths, karaoke competitions, a love wall and several other engaging activities geared toward creating bonding opportunities and memorable experiences for guests.\nHeld at the multi purpose-built Fidelity Bank Grounds on Abila Oniru Street, Oniru, Lagos, The Euphoria also featured several interesting competitions that saw guests go home with mouth-watering prizes including weekend getaways, dinner dates and other family related prizes.\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "FAAC shares N574.668bn revenue to three tiers of govt",
    "summarized_story": "The N574.668 billion total distributable revenue comprised distributable statutory revenue of N291.400 billion; distributable Value Added Tax (VAT) revenue of N178.066 billion, Exchange Gain of N5.202 billion and Non Mineral Revenue of N100.000 billion.\nIn the month of January 2022, the gross revenue available from the Value Added Tax (VAT) was N191.222 billion.\nThe sum of N5.507 billion allocation to NEDC and N7.649 billion cost of collection were deducted from the N191.222 billion gross Value Added Tax (VAT) revenue, resulting in the distributable Value Added Tax (VAT) revenue of N178.066 billion.\nFrom the N178.066 billion distributable Value Added Tax (VAT) revenue, the Federal Government received N26.710 billion, the State Governments – N89.033 billion and the Local Government Councils – N62.323 billion.\nThe Federal Government received N52.680 billion, the State Governments – N26.720 billion and Local Government Councils – N20.600 billion from the N100.000 billion Non Mineral Revenue."
  },
  {
    "headline": "Nigeria’s Vision Has Not Been Realised – Buhari",
    "summarized_story": "President Muhammadu Buhari has said that the vision of the founding fathers of Nigeria has not been realised.\nAccording to Buhari, more intellectuals are needed in governance for a better Nigeria.\nADVERTISEMENT“The vision of our founding fathers has not been realised,” Buhari said adding that it was the reason the book should be read.\n“Politics is not a dirty game,” Ganduje said while encouraging intellectuals to join politics.\nADVERTISEMENT“In Nigeria, intellectuals are afraid of governance because they see politics as a dirty game."
  },
  {
    "headline": "Federal Govt Promises To Enact, Implement Ecosystem Friendly Policies",
    "summarized_story": "The federal government has reiterated its commitment to enact and implement policies that will ensure the success of the ecosystem.\nPantami cited the National Startup Bill, the National Council for Digital Innovation and Entrepreneurship, the National Policy for the Development of Indigenous Content in the Telecommunications sector, among others, as examples of government’s commitment to enact and implement policies that enable the ecosystem.\nHe however challenged startups and innovators in the Nigeria ecosystem to take ownership of existing policies to further consolidate and enhance the success of the ecosystem.\nADVERTISEMENT“The importance of a vibrant, functional innovation ecosystem cannot be underscored and that is why we have taken deliberate steps to organise this interactive session specifically, to address certain pertinent issues.\nThis is key to the success of our ecosystem because government has a major role to play in providing an enabling environment,” he added."
  },
  {
    "headline": "Ayu Urges Buhari To Sign Electoral Bill",
    "summarized_story": "National chairman of the Peoples Democratic Party (PDP) Senator Iyorchia Ayu has challenged President Muhammadu Buhari to immediately sign the Electoral Act Amendment Bill so that the nation can have elections which are impossible to rig.\nHe also said All Progressives Congress (APC) is scared of getting the electoral act amendment bill signed into law because the party is afraid of losing the 2023 general elections.\nThe PDP national chairman at the event received a former state chairman of APC, Chief Letep Dabang, and others who decamped to PDP.\nPresident Buhari must sign the electoral act immediately, that will make elections impossible to rig.”Speaking on behalf of the decampees, Dabang, recalled how he ran errands for the late PDP chairman, Chief Solomon Lar, Professor Dakum Shown, Senators Ayu, and Jang, among others.\nFidelis Tapgun: Senator Jonah Jang; Senator Jeremiah Useni; PDP vice chairman, North Central; Theophilus Dakashan among others."
  },
  {
    "headline": "In Major Shake-up, INEC Redeploys 186 Staff",
    "summarized_story": "The Independent National Electoral Commission (INEC) has redeployed 186 staff across the country as part of efforts to ensure efficient and optimal performance.\nThe affected staff are either serving in their states of origin or have served for between 10 and 32 years in the same state.\nFestus Okoye noted that the commission considers the long stay of staff in the same state as unhealthy for the sensitive responsibilities they discharge.\nOkoye in the statement said “Commission has identified 186 staff for immediate redeployment.\nHe added that the exercise “will be an ongoing exercise that will extend to other categories of staff in the commission’s headquarters, state and local government offices nationwide.”ADVERTISEMENT"
  },
  {
    "headline": "C/River By-elections: PDP Kicks Over Deployment Of Soldiers",
    "summarized_story": "Ahead of February 26, Ogoja/Yala federal constituency and Akpabuyo state constituency by-elections, the Peoples Democratic Party (PDP) has raised the alarm over planned deployment of soldiers for the conduct of the by-elections.\nThe PDP said the state as an entity has no power to deploy soldiers for elections stressing that it is only the military high command at the defence headquarters that has the right to deploy soldiers for any reason.\nPDP state chairman, Venatius Ikem raised the alarm while addressing journalists about rumours making the rounds that the APC government has hatched a plan to deploy soldiers for the election.\nADVERTISEMENTHe said, “There are legitimate ways you can deploy the army as well as illegal ways to intimidate voters.\n“That directive can only come from the Chief of Army Staff and if there are reasons to deploy the army it will be so stated."
  },
  {
    "headline": "Nigeria hits at Russia, condemns aggression in Ukraine",
    "summarized_story": "Minister of Foreign Affairs, Geoffrey Onyeama, met with the envoys on Friday in Abuja, saying that the Nigeria government call for peace and use of diplomacy in resolving all differences.\nOnyeama said that the Federal Government had stated that Nigeria does not condone the approach of aggression by Russia, calling on Russia to pull back.\n“We support every effort being made to stop the aggression and Russian troops to return to Russia,” Onyeama said.\nOry who also commended Nigeria for putting in its weight, said Nigeria is a very important voice that the world needed to hear.\nAlso in attendance were; United States Ambassador to Nigeria, Mary Beth Leonard; British High Commissioner to Nigeria, Catriona Laing; Head of the European Union Delegation to Nigeria and ECOWAS, Samuela Isopi."
  },
  {
    "headline": "'Fix Politics' movie challenges Nigerians about 2023 election",
    "summarized_story": "However two years on, Kininso Koncepts Production, a creative/cultural hub has adapted it into a movie entitled Fix Politics.\nAnd this is indeed timely as the nation is just few months away from the 2023 General elections.\nFix Politics, which interrogates bad governance and dirty politics such as corruption, tribalism and nepotism and other issues and inspires Nigerians to participate in politics in order to make a change.\nAlabi also said since the movie is geared towards conscientizing the citizens and raising their social awareness, it won’t be restricted only to the cinemas.\nThese works have served as catalyst for social orientation especially as it concerns Nigerians and youths."
  },
  {
    "headline": "BREAKING: N35m Recovered From Robbers Who Raided Edo Banks",
    "summarized_story": "A total of N35 million has been recovered one day after armed robbers invaded four banks in Uromi, the capital of Edo State’s Esan North-East Local Government Area, carrying away large sums of money in bags.\nBello Kotongs, Police Public relations Officer in Edo, confirmed this to Daily Trust on Friday night.\nHe said the money was currently in custody of the police.\nIt reported how the armed gang broke into Zenith, UBA, First and Union Banks in the community, gunning down seven person, including two security personnel."
  },
  {
    "headline": "JUST IN: G7 Countries Meet FG Over Russia-Ukraine Crisis",
    "summarized_story": "On Friday, the Federal government met with representatives from the Group of Seven (G7) countries to discuss the Russia-Ukraine issue.\nOry further said there will be resolutions in the United Nations Security Council, as well as the General Assembly and other United Nations fora such as the Human Rights Council where Nigeria is a very important voice and member.\nWhile commending Nigeria for putting in its weight, Ory stated that Nigeria is a very important voice that the world needed to hear.\n“We support every effort being made to stop the aggression and Russian troops to return to Russia,” Onyeama said.\nThe meeting which took place at the Tafawa Balewa House, Abuja, had in attendance the Minister of Foreign Affairs, Geoffrey Onyeama; the leader of the delegation and German Ambassador to Nigeria, Birgitt Ory; United States Ambassador to Nigeria."
  },
  {
    "headline": "BREAKING: Court Convicts Evans, Two Others Of Kidnapping Businessman, Donatus Duru",
    "summarized_story": "BREAKING: Court Convicts Evans, Two Others Of Kidnapping Businessman, Donatus DuruThe Lagos High Court in Ikeja has convicted kidnap kingpin, Chukwudumeme Onwuamadike popularly known as Evans on a two-count of conspiracy and kidnapping of a businessman, Donatus Duru.\nThe victim is the Managing Director of Maydon Pharmaceuticals Ltd.Justice Hakeem Oshodi on Friday convicted Evans alongside two of his co-defendants, Uchenna Amadi and Okuchuwkwu Nwachukwu.\nThe judge held that the prosecution had successfully proved the charge against the three convicts beyond a reasonable doubt.\nThe court discharged and acquitted Ogechi Uchechukwu and two former soldiers of the Nigerian Army, Chilaka Ifeanyi and Victor Aduba for lack of sufficient evidence linking them to the crime.\nThe Lagos State government had arraigned Evans alongside Uche Amadi, Okwuchukwu Nwachukwu, Ogechi Uchechukwu, Chilaka Ifeanyi, and Victor Aduba for allegedly kidnapping the Managing Director of Maydon Pharmaceuticals Limited, Donatus Dunu February 14, 2017."
  },
  {
    "headline": "BREAKING: Buhari Signs Electoral Act Amendment Bill",
    "summarized_story": "At the Council Chamber of the Presidential Villa in Abuja, President Muhammadu Buhari began the process of signing the reworked Electoral Act Amendment Bill into law.\nThe ceremony is still taking on in the Presidential Villa’s Council Chamber in Abuja.\nProfessor Yemi Osinbajo, Vice President; Ahmed Lawan, President of the Senate; and Femi Gbajabiamila, Speaker of the House of Representatives, were among those present at the ceremony, which began at lunchtime.\nDetails later…"
  },
  {
    "headline": "Huge relief as Buhari signs Electoral Act 2022, asks NASS to amend Section 84",
    "summarized_story": "The president made the call before assenting to the Electoral Act at the Council Chambers of the Presidential Villa in Abuja.\n“It is gratifying to note that the current Bill comes with a great deal of improvement from the previous Electoral Bill 2021.\nINEC’s declarationsMeanwhile, the Independent National Electoral Commission (INEC) has stated that it fully appreciates the importance of proceeding with the implementation of the newly signed 2022 Electoral Act in earnest.\n“This is historic, being the fourth time since the restoration of democracy in Nigeria in 1999 that the Electoral Act is repealed and re-enacted.\n“The nation now has the Electoral Act 2022 which replaces the Electoral Act 2010 (as amended)."
  },
  {
    "headline": "[Breaking] 2022 Electoral Act: INEC summons extraordinary meeting",
    "summarized_story": "The Independent National Electoral Commission has said it fully appreciated the importance of proceeding with the implementation of the newly signed 2022 Electoral Act in earnest.\nTo this end, the commission has summoned an extraordinary meeting scheduled for Saturday February 26, 2022.\nThe statement read: “Today Friday 25th February 2022, the President of the Federal Republic Nigeria signed the Electoral Bill 2022 into law.\n“This is historic being the fourth time since the restoration of democracy in Nigeria in 1999 that the Electoral Act is repealed and re-enacted.\n“The nation now has the Electoral Act 2022 which replaces the Electoral Act 2010 (as amended)."
  },
  {
    "headline": "[Breaking] Kidnapping: Court convicts Evans, 2 others",
    "summarized_story": "Chukwudimeme Onwuamadike also known as Evans and two others Uchenna Amadi and Okuchuwkwu Nwachukwu have been convicted of kidnapping by a Lagos High Court in Ikeja.\nFive persons were arraigned along with Evans, but the court found only two of the defendants guilty.\nThe judge held that the prosecution had successfully proved the charge against the three convicts beyond a reasonable doubt.\nIn reaching his verdict on Evans, the judge held that he observed the demeanour of the witness.\nstating that in some of the confessional videos played in court, Evans had mentioned some of the other defendants and the roles they played in the crime."
  },
  {
    "headline": "Finally, President Buhari Signs Electoral Act Amendment Bill Into Law",
    "summarized_story": "﻿President Muhammadu Buhari has finally signed the Electoral Act Amendment Bill into law.\nThe President of the Senate, Ahmed Lawan, and Speaker of the House of Representatives, Femi Gbajabiamila, witnessed the signing of the bill.\nAmid an outcry over the delay in signing the bill into law, sources had indicated that President Buhari was billed to give his assent on Wednesday.\nREAD ALSO: Again, Buhari Rejects Electoral Act Amendment BillFailed AttemptsPrevious attempts to amend the nation’s electoral laws were unsuccessful during the 8th National Assembly led by former Senate President Bukola Saraki and former Speaker Yakubu Dogara.\nThe harmonised version was received by President Buhari a week later, as confirmed by his Senior Special Assistant on NASS Matters (Senate), Senator Babajide Omoworare."
  },
  {
    "headline": "Putin Ready To Negotiate With Ukraine, Says  Kremlin",
    "summarized_story": "The Kremlin on Friday said President Vladimir Putin was ready to send a delegation to Belarus for talks with Ukraine, as Russian forces approached Kyiv on the second day of Moscow’s invasion.\nKremlin spokesman Dmitry Peskov said the Russian leader was “ready” to send a high-level delegation “for talks with a Ukrainian delegation” to Belarusian capital Minsk, which has previously hosted rounds of peace talks over the Ukraine crisis.\nRussia has thousands of troops stationed in Belarus, and Ukraine said it was being attacked from several sides — including from Belarus.\nHours before Putin announced he was sending troops to Ukraine, Zelensky said he tried to call the Kremlin chief but “there was no answer, only silence”.\nPutin announced the start of a military operation against Ukraine in the hourly hours of Thursday when Moscow was asleep."
  },
  {
    "headline": "INEC To Hold Extraordinary Meeting Over Implementation Of Electoral Act 2022",
    "summarized_story": "The Independent National Electoral Commission (INEC) will hold an extraordinary meeting on Saturday in a bid to proceed with implementing the provisions guiding the forthcoming election within the new law.\nINEC’s National Commissioner and Chairman, Information and Voter Education Committee, Festus Okoye Esq, disclosed this in a statement on Friday.\nHe said the Electoral Act 2022 contains many progressive provisions that will facilitate the conduct of free, fair, and credible elections in Nigeria.\nWhile explaining that the nation now has the Electoral Act 2022 which replaces the Electoral Act 2010 (as amended), the INEC commissioner said together with the 1999 Constitution (as amended), the new Act constitutes the principal law to govern the conduct of future elections, including the 2023 poll.\nConsequently, he disclosed that an extraordinary meeting of INEC is billed for Saturday 26th February 2022."
  },
  {
    "headline": "Court Sentences Billionaire Kidnapper Evans, Two Others To Life Imprisonment",
    "summarized_story": "The Lagos High Court in Ikeja has sentenced kidnap kingpin Chukwudumeme Onwuamadike popularly known as Evans and two others, Uchenna Amadi and Okuchuwkwu Nwachukwu, to life imprisonment.\nIn convicting the trio, Justice Oshodi held that the prosecution had successfully proved the charge against them beyond a reasonable doubt.\nHe is seen laughing even when he was told that he must be a rich kidnapper,” Justice Oshodi said.\nThe Lagos State government subsequently arraigned the defendants before the court in August 2017.\nEvans is also facing similar charges before Justice Oluwatoyin Taiwo and Justice Adedayo Akintoye of the same court."
  },
  {
    "headline": "Again, Explosion Rocks Niger Community",
    "summarized_story": "An Improvised Explosive Device (IEDs) has exploded at Galadima Kogo, Shiroro Local Government Area, Niger State.\nThis was confirmed in a statement by co-convener, Concerned Shiroro Youths of Niger State, Sani Abubakar Yusuf Kokki on Friday.\nRead Also: Katsina APC Reacts As Court Freezes Local Government Council’s AccountThe explosion comes a few days after the first-ever bomb blast occurred at the same Galadima Kogo, on Monday.\nAccording to the statement, the number of casualties is yet to be ascertained as the affected areas are not yet accessible due to fear of further possible explosions.\nKokki noted that preliminary reports are, however, not suggestive of any loss."
  },
  {
    "headline": "Ekiti Youth Network urges Funmilayo Waheed-Adekojo to contest for President",
    "summarized_story": "Ekiti State Youth Network (ESYN) has urged a reputable Engineer, Dr Funmilayo Waheed- Adekojo popularly known as Funmi Ayinke to contest for the 2023 presidential election.\nThe group said Waheed Adekojo remains the best material for the presidential election in 2023.\nAdvertisementThe youths group at an emergency meeting in Ado- Ekiti, said they would mobilise one million youths for the erudite lawyer.\nThe group in a statement issued by its State Coordinator, Adeyemi Azeez and Organising Secretary,Adewumi Ifeoluwa, declared to galvanise support for her across the country"
  },
  {
    "headline": "Nigeria takes a stand with Ukriane",
    "summarized_story": "A day after walking away from reporters, Nigeria’s foreign Affairs Minister after a closed door meeting with Ambassadors of Russia and Ukraine says Nigeria cannot condone the violation of the territorial integrity of a United Nations Member StateThe Minister who met with both envoys separately says Nigeria sympathizes with Ukraine and acknowledges the diplomatic ties it shares with the European country.\nAdvertisementNigerian government wants Russia to revert to status quo and prioritise Diplomacy and dialogue."
  },
  {
    "headline": "Tinubu is a credible, hale and hearty politician",
    "summarized_story": "The Ataoja of Osogbo has described Asiwaju Bola Tinubu as a credible, hale and hearty politician who can bring the desired development to Nigeria.\nOba Jimoh Oyetunji made this known while endorsing Bola Tinubu’s 2023 presidential aspiration.\nHe said the people of Osogbo will support him in his quest to becoming the President of Nigeria.\nAdvertisementThe 2023 presidential aspirant says he is fit and ready to restore the glory of Nigeria."
  },
  {
    "headline": "2023 Presidency: Tinubu takes consultation tour to Ataoja of Osogbo -",
    "summarized_story": "National leader of the All Progressives Congress, Asiwaju Bola Tinubu has taken his consultation tour to the palace of the Ataoja of Osogbo, Oba Jimoh Olanipekun OyetunjiHe is accompanied by the Governor of Osun State, Adegboyega Oyetola and other chieftains of the All Progressives Congress.\nAdvertisementThe former governor of Lagos state on Thursday paid same visit to the Ooni of Ife, Oba Adeyeye Enitan Ogunwusi and the paramount ruler of Ijeshaland."
  },
  {
    "headline": "Russia to Restrict Facebook Access for ‘Censoring’ Its Media",
    "summarized_story": "Russia said on Friday it was partially limiting access to Meta Platforms Inc’s Facebook, accusing it of “censoring” Russian media, the latest in a series of steps against U.S. social media giants.\nThe state communications regulator said that Facebook had ignored its demands to lift restricts on four Russian media outlets on its platform – RIA news agency, the defence ministry’s Zvezda TV and websites gazeta.ru and lenta.ru.\nIt was not immediately clear what Russia’s restrictions on Facebook would involve.\n“In accordance with the decision of the General Prosecutor’s Office, starting from Feb. 25, partial access restrictions are being imposed by Roskomnadzor on the Facebook social network,” the regulator, Roskomnadzor, said in a statement.\nMoscow routinely fines the company small sums for what it says is a failure to delete illegal content quickly enough."
  },
  {
    "headline": "Nigerians Stranded In Ukraine, As FG Works On Evacuation Plan – Trending With Ojy Okpe",
    "summarized_story": "The minister of foreign affairs Geoffrey Onyeama announced on Thursday, that the federal government is working on arranging a special flight to evacuate Nigerians currently in Ukraine once airports reopen.\nReactions trail on social media as Super Falcons faced delay for over 3 hours and subjected to traumatic experiences at the Nnamdi Azikiwe International Airport, in Abuja, due to some unclear COVID-19 protocols in the early hours of Thursday.\nOn Thursday, a group of armed men attacked four banks and a police station in Edo State leaving two police officers and five civilians dead.\nA video now making the rounds on social media, shows the moment one of the banks exploded as civilians took to their heels.\nA video showing men clad in military uniform alleged to be soldiers of the Nigerian army taking cover as the gunmen attacked the bank in edo state has gone viral."
  },
  {
    "headline": "NIgeria: Finally, President Buhari Signs Electoral Act Amendment Bill",
    "summarized_story": "Nigeria’s President Muhammadu Buhari Friday signed Electoral Act Amendment Bill into law, about a month after the National Assembly sent the bill to him.\nThe signing ceremony was held at the Council Chamber of the Presidential Villa in Abuja.\n1 of 6 - +Among those present at the ceremony which began at about midday are the Vice President, Professor Yemi Osinbajo; President of the Senate, Ahmed Lawan, and Speaker of the House of Representatives, Femi Gbajabiamila.\nDetails later…"
  },
  {
    "headline": "Champions League Final Moved to Paris from St Petersburg after Russian Invasion of Ukraine",
    "summarized_story": "“I welcome UEFA’s decisive action to strip St Petersburg of staging this year’s Champions League final.\nRussia host Poland in a play-off semi-final on March 24 and would then face the winner of the Sweden vs Czech Republic semi-final in Russia for a place in Qatar.\nUkraine are due to face Scotland at Hampden Park in a play-off semi-final on March 24, but that match is also in doubt with the Ukrainian league suspended following the invasion.\nPlayers, fans and football clubs will be free to protest against the Russian invasion of Ukraine, without fear of punishment from the FA, Premier League or EFL – so long as those displays are not offensive or overtly political.\nBut there is widespread feeling among officials displays of support for Ukraine should not be judged in this light."
  },
  {
    "headline": "US: Three Minneapolis Ex-Police Officers Guilty of Violating George Floyd’s Rights",
    "summarized_story": "RelatedStories No Content AvailableIt is a rare instance of police officers being held criminally responsible for a colleague’s excessive force.\nAll three men were convicted of denying Floyd’s constitutional right to medical care while in police custody.\nIn December, Chauvin pleaded guilty to the federal charge of violating Floyd’s rights.\nUnder Chauvin’s plea agreement, federal prosecutors will seek a 25-year sentence, concurrent with his state prison sentence.\nHis three former colleagues are also due to stand trial in Minneapolis in June on state charges of aiding and abetting Floyd’s murder."
  }
]