[
  {
    "headline": "I’ll provide free education, says PDP gov aspirant",
    "summarized_story": "A chieftain of the Peoples Democratic Party, Olanrewaju Jim-Kamal, has assured residents that if elected the next governor of Lagos State, he will provide free and compulsory education and health care for all.\nJim-Kamal, according to a statement on Wednesday, said this while he formally disclosed his interest to contest the state governorship election on the platform of the PDP in 2023.\nHe said, “Once elected we will ensure the provision of automated free and compulsory e- education at all levels, automated free e-healthcare facilities, social security, mechanised food production, sports development, modern transportation system and restructuring.\n“We have not been winning because Lagos PDP has always promoted imposition but our last elective state congress has brought in the light that we can get it right now.\nThe best way to address all these problems is for the party to go for elective primaries in Lagos like we did in the congress."
  },
  {
    "headline": "LASG set to graduate 104 trained cooperative members",
    "summarized_story": "THE Lagos State Cooperative College has expressed its readiness to graduate 104 students under its professional diploma programme as part of efforts to address sector-specific skill gaps.\nThe Provost of LASCOCO, Mr Akorede Ojomu, disclosed this on Wednesday during a press briefing to announce the maiden convocation of professional diploma students in Lagos.\nCopyright PUNCHAll rights reserved.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "NCFRMI Bill awaiting Presidential assent, says Federal Commissioner",
    "summarized_story": "By Funmi AjumobiThe Federal Commissioner, National Commission For Refugees, Migrants and Internally Displaced Persons (IDPs), Hon Imaan Sulaiman-Ibrahim, has hinted that the NCFRMI does not have an Act yet but a bill awaiting presidential assent.\nIbrahim disclosed this in Lagos on Wednesday when she engaged some selected media personnel where she sought collaboration to further deepen the existing relationship between her commission and the fourth estate of the realm.\nShe added that the strategic project drivers of the commission’s vision are at varying stages of implementation like the NCFRMI Project Zero Hunger initiative, which is a project aimed at bringing immediate relief to vulnerable Persons of Concern and their families facing food insecurity.\nOthers are Project Skill Up, which is designed to train selected persons of concern across trades such as carpentry, welding and others.\nThe Commissioner who took time to reel out all she has been doing reiterated the Commission’s commitment to strengthen the collaboration among all stakeholders and to ensure a concerted effort in providing support and assistance to Persons of Concern in Nigeria."
  },
  {
    "headline": "Youths Empowerment: Gov Inuwa distributes 1,000 tricycles to Keke-NAPEP riders",
    "summarized_story": "…Operators Describe Gesture as Unprecedented…As Governor Inuwa Rides Keke-NAPEP To Venue Of EventGombe State Governor, Muhammadu Inuwa Yahaya has flagged off the distribution of 1,000 tricycles as part of his administration’s sustainable economic plan to empower the teeming unemployed youths in the state.\nHe said 1,000 tricycles were provided for 1,000 individuals through his administration’s Human Capital Development Initiative.\nAccording to the Governor, economic development and progress do not just happen without realistic visions, careful choices as well as resolute commitment of leaders and followers to doing the right thing.\nGovernor Yahaya said Gombe State had always been recognised as the most peaceful, secure and socially cohesive state in the country.\nChairman, Gombe State’s branch of the Tricycles Riders Association of Nigeria, Mohammed Abdullahi Sarki, said the distribution of 1,000 tricycles marked a turning point in the history of the association."
  },
  {
    "headline": "Malnutrition: Cognito gets SON’s MANCAP certification",
    "summarized_story": "By Juliet UmehThe Standards Organisation of Nigeria, SON, has awarded Cognito Micronutrient Powder, a locally manufactured micronutrient for food fortification, the award of the Mandatory Conformity Assessment, MANCAP certification for addressing infant malnutrition.\nHe said: “Cognito MNP is a product of Micronutrient Laboratories Ltd. and it is designed to prevent malnutrition and also maintain the nutritional status of infants and young children in Nigeria.\n“Cognito MNP is a well-formulated single-serve blend of 15 essential micronutrients (10 vitamins and five minerals).\nA sachet of Cognito® MNP is sufficient to provide 100 percent recommended nutrient intake (RNI) for infants and young children within the age range of six months to 59 months.\n“Users add Cognito MNP to complementary food for children after the first six months of exclusive breastfeeding."
  },
  {
    "headline": "NAFDAC, Egypt’s medicines regulator attain WHO’s high maturity level 3",
    "summarized_story": "… As countries obtain ‘Global Benchmarking Too’By Chioma ObinnaThe World Health Organisation, WHO, yesterday upgraded the National Agency for Food and Drug Administration and Control, NAFDAC, and Egypt’s medical products regulatory agency to high maturity level 3.\n“Regulatory authorities that reach maturity levels 3 and 4 will be eligible for inclusion among WHO-listed authorities, after additional evaluation of their performance.\nFewer than 30 per cent of the world’s regulatory authorities are considered fully functioning and operational.\nFor that reason, WHO has intensified efforts to bolster the capacity to regulate medical products in all regions.\nThe transitional WLA combines pre-existing lists of Stringent Regulatory Authorities for medicines, highly performing regulatory authorities for vaccines, Regional Reference Authorities for medicines and vaccines in the Americas (AMRO/PAHO), national regulatory authorities operating at maturity levels 3 and 4, and vaccine producing countries with functional regulatory authorities."
  },
  {
    "headline": "2023: Tinubu support group berths in Kosofe, tasks Lagosians on unity",
    "summarized_story": "By Olayinka AjayiTHE Asiwaju Bola Tinubu Movement, ABAT, has charged residents of Kosofe Local Council and Lagosians to back the presidential aspiration of former Lagos State Governor, Asiwaju Bola Ahmed Tinubu.\nThe group spoke, on Wednesday, during the launch of its Kosofe chapter.\nOur mission is just to bring the ABAT movement in Kosofe together.\nTinubu is not a man of the South-West alone, he is a man of the whole federation.\nEverybody should just rally around him and give him full support to ensure that he becomes Nigeria’s president in 2023.”"
  },
  {
    "headline": "Nigeria’s insecurity: Police acquire more high-powered unmanned aerial vehicles",
    "summarized_story": "The Nigeria Police Force (NPF) acquired five additional high-powered Unmanned Aerial Vehicles (UAVs).\n“The drones will assist the Police in monitoring active crime scenes, coordinating response operations, and providing aerial support to responding officers”, he said.\nThey can cover up to 92m altitude with high endurance of up to 50 hours and other sensitive and forensic-based features.\nThe drones will be remotely operated by pilots from the Police Airwing who have undergone specialized training from Engineers of Elistair company.\nBaba has directed the immediate and strategic deployment of the UAVs to areas prone to high-security breaches."
  },
  {
    "headline": "BREAKING: Slap drama: Mrs Obiano apologizes to Bianca, Soludo, others",
    "summarized_story": "The immediate past First Lady of Anambra State, Mrs Ebelechukwu Obiano, has formerly apologised to Governor Charles Chukwuma Soludo, Ndigbo and friends of Ndigbo, over the incident between her and Mrs Bianca Ojukwu in Awka at the inauguration programme of Soludo on March 17, 2022.\nThis was, even as she has also declared her intention to join the contest for the forthcoming Anambra North Senatorial District election.\n“Without any equivocation, your achievements as a towering intellectual of national and international repute are enduring legacies and pride for the State and Ndigbo in general.\nNo excuse can therefore be tenable as justification for such public embarrassment, no matter the height of provocation.\n“Equally, I wish to extend the same apology to all the important dignitaries, the people of Anambra State, as well as the entire Ndigbo for that unintended embarrassment at the occasion."
  },
  {
    "headline": "Zamfara Assembly condemns Kaduna-Abuja train attack",
    "summarized_story": "The Speaker of Zamfara State House of Assembly, Hon.\nNasiru Muazu Magarya, has condemned outrightly the recent Abuja-Kaduna train attack, urging the federal government measures towards the protection of lives and properties of Nigerians in the axis.\nHe also commiserated with those that were injured, particularly the former Deputy Governor of Zamfara state and chieftain of the APC in the state, Mallam Ibrahim Muhammad Wakkala and prayed to Allahu (SWT) for their speedy Recovery.\nAccording to him, his special concern goes to the abducted ones and prayed for their safe return to their loved one.\nHe called on the security agencies in the country to use their professional expertise in tracking the enclaves of the terrorists and rescue the victims safely."
  },
  {
    "headline": "Kwara denies borrowing N93b",
    "summarized_story": "Kwara State Government has denied borrowing N93bn over the last three years as alleged by a member of the state House of Assembly.\n“The N93 billion loan claim is spurious.\nFor the sake of emphasis, as against the unfounded claims, the totality of this loan was not accrued over the last three years under the leadership of the Executive Governor of Kwara State, Mallam AbdulRahman AbdulRazaq.\nThis is apart from the domestic debt of over 63 billion naira that this administration met on the ground.\nThe effect of what the administration has accessed can be seen in the numerous projects that are ongoing across the state."
  },
  {
    "headline": "Bandits attack: NLC Kaduna condoles TUC over death of NEC members",
    "summarized_story": "The Nigeria Labour Congress (NLC), Kaduna State Council, on Wednesday, condoled the Trade Union Congress(TUC), over the death of its Secretary General, Comrade Barrister Musa Lawal Ozigi and the Chairman Kwara State, Comrade Akinsola Akinwunmi during the Abuja-Kaduna train attack.\nDAILY POST recalls that bandits attacked Kaduna- Abuja train, killed eight passengers, wounded 26, while several others were Kidnapped.\nAmong those killed were; Chairman Kwara State, Comrade Akinsola Akinwunmi, TUC Secretary General, General, Comrade Barrister Musa Lawal Ozigi and six others.\nAccording to the statement, It’s really unfortunate that the Abuja-Kaduna train attack happened two days after the International Airport Kaduna was attacked, adding that government at all levels and the security agencies need to do more.\nIt extends it’s condolences to the government of Kaduna State and the families of those who lost their loved ones during the attack."
  },
  {
    "headline": "One dies, 15 pupils injure in Ondo school bus fire",
    "summarized_story": "A total of 15 pupils of Hope of Tomorrow Academy in Akungba, Akoko South West Local Government suffered burnt injuries after the bus they were boarded to school was engulfed in flames.\nOne of the affected pupils was said to have died after being rushed home.\nWitnesses said the driver of the bus was picking up the pupils from their various homes when fire gutted the bus.\nOndo Police Public Relations Officer, DSP Funmilayo Odunlami, said the affected children were in the hospital.\nOdunlami said she got information that one of them passed on in his parents house."
  },
  {
    "headline": "Bandits kill 23, abduct others in Kaduna village",
    "summarized_story": "Bandits on Tuesday night killed 23 persons and abducted several others during separate attacks in two villages of Giwa Local Government Area of Kaduna State.\nThe Nation recalls bandits had attacked nine villages in Giwa Local Government, killing 50 and abducted many.\nTuesday’s night attack was the fourth in Giwa Local Government area in March 2022.\nA resident of the community told journalists the bandits came in large numbers, shooting sporadically.\nMany residents, who ran for safety, were hit by bandits’ bullet."
  },
  {
    "headline": "Panic among relatives as bandits hold missing train passengers",
    "summarized_story": "There is panic among families and relatives of kidnapped victims of the Abuja-Kaduna train, which came under terror attack on Monday, The Nation has gathered.\nOne of the families told The Nation the abductors contacted them but only confirmed their daughter and many other passengers were with them.\nAccording to the source: “They called Tuesday night and told us our sister and other missing passengers are with them in their camps and she is safe.\nA Kaduna- based journalist, whose mother and elder sister were kidnapped, confirmed the bandits contacted his elder brother.\nBut now, the bandits have contacted my elder brother but they didn’t ask for ransom yet."
  },
  {
    "headline": "Dickson, Ortom in race to Senate as Fintiri seeks return ticket",
    "summarized_story": "Dickson, Ortom in race to Senate as Fintiri seeks return ticketFormer Bayelsa Governor Seriake Dickson and his Benue counterpart Samuel Ortom have picked nomination forms for the Senate.\nAlso Adamawa Governor, Ahmadu Fintiri is asking for a return ticket to return to office in 2023.\nWhile Ortom is seeking to represent his Benue North-West senatorial district from 2023, Dickson is seeking to retain his Bayelsa West district seat which he presently occupies.\nPolitical leaders from Bayelsa’s Sagbama/Ekeremor local government area, had on Tuesday, stormed the PDP Abuja secretariat to pick the form for Dickson.\nThe group, led by Deputy Bayelsa Speaker, Mr Michael Ogbere, said they purchased the form for the senator because he has done exceptionally well in his current tenure."
  },
  {
    "headline": "ACF blasts FG over Kaduna train attack",
    "summarized_story": "The mouthpiece of the North, the Arewa Consultative Forum (ACF), has tackled the Federal Government over Monday’s train terror attack in Kaduna.\nACF said it was tired of crying over insecurity in the region, stating that the north is clearly under siege.\nRead Also: Mayorkun blames FG for Kaduna train attack“It is curious that a train carrying almost 1000 (one thousand) passengers be exposed to the kind of situation we found, on the fateful Monday evening, without any precautionary measures taken.\n“The Arewa Consultative Forum calls on government to put 24-hour surveillance on the route to at least avert the ugly situations occurring.\nACF equally, prevails on the AZMAN and Air Peace airlines to have a rethink over their resolve to suspend flights to Kaduna International Airport."
  },
  {
    "headline": "2023: PDP alleges plot to alter Electoral Act, extends sale of forms, screening",
    "summarized_story": "From Ndubuisi Orji, AbujaPeoples Democratic Party (PDP), yesterday, accused the Presidency and the All Progressives Congress (APC) of plot to alter the newly enacted Electoral Act.\nThe opposition party claimed the ploy is to create an avenue for the Independent National Electoral Commission (INEC) to alter the timetable for the 2023 general election.\nIt claimed APC wants the election timetable pushed forward because the ruling party is running behind schedule.\n“The APC, having realised it is running out of time and cannot meet up with the already released electoral timetable now seeks to frustrate and derail the ongoing electoral process.\nMeanwhile, the PDP has extended deadline for the sale of nomination forms from April 1 to April 8."
  },
  {
    "headline": "Death of TUC officials huge loss –Ngige",
    "summarized_story": "Minister of Labour and Employment, Senator Chris Ngige, described the death of Trade Union Congress’ (TUC) Secretary General, Musa Lawal Ozigi and Kwara State Chairman, Akinsola Akinwunmi as a huge loss to Nigeria’s tripartite community.\nA statement by Ngige’s media team said the minister had in a condolence letter to the union, described Ozigi as “a dogged and consummate labour leader.”100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nOzigi’s self-effacing personality often belied his depth of thought and ideas.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nClick here to see how you too can get paid ."
  },
  {
    "headline": "Adamu assumes office, says APC’ll not fail under him",
    "summarized_story": "From Romanus Ugwu, AbujaSenator Adamu Abdullahi, yesterday, formally assumed office as National Chairman of the All Progressives Congress (APC) with a pledge that the party would not fail under his leadership.\nAdamu, who arrived the party’s headquarters around 12.45pm assured party members that his administration would not fail in meeting up with the expectations of the party, admitting, however, that it was not going to be easy for his administration.\nSpeaking after the official handover by Governor Mai Mala Buni, chairman APC caretaker/extraordinary convention planning committee (CECPC), Adamu described his emergence as divine, claiming that he was not aware he would become party’s chairman few months ago.\nGovernor Buni thanked Adamu and other members of his executives for their victory at the convention.\nSo, as at it is and as members of NWC, you should study Mr. President’s speech as your guide."
  },
  {
    "headline": "Murder of OAU student: Hotelier, staff’ve case to answer –Court",
    "summarized_story": "The prosecution team led by M. O. Omosun, called eight witnesses and tendered 32 exhibits to prove his case.\nBut, counsels to the defendants filed a no case submission, stating that the prosecutor has not established a prima facie case against them, and none of the exhibits tendered has a link with the defendants.\nRuling on the no case submission, Justice Ojo held that the prosecutor has established a prima facie case against the defendants and directed them to enter their defence.\n“I am of the respective view that a prima facie case has been established against the defendants.\nIt should be noted, however, that this ruling is not the determination of the guilt or otherwise of the defendants,” the court added."
  },
  {
    "headline": "Presidency: Blackmail won’t deter north from fielding candidate – CNG",
    "summarized_story": "From Okwe Obi, AbujaCoalition of Northern Groups (CNG), yesterday, said that no amount of blackmail and intimidation would deter the region from fielding a candidate for the 2023 presidential poll.\nIts spokesperson, Abdul-Azeez Suleiman, at a press briefing, said some southern forces were working to use zoning arrangements in the major political parties to prevent the north from fielding candidates of the election.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nFor the avoidance of doubt, no amount of blackmail, intimidation, brigandage, gangsterism or rascality by any other person or group from whichever ever section of the country and in whichever party can stop the north from fielding and backing candidates for the presidency.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood."
  },
  {
    "headline": "News in Photographs: FEC Observes a Minute Silence for Victims of Train Attack",
    "summarized_story": "Deji Elumoye in AbujaThe weekly Federal Executive Council (FEC) meeting presided over by President Muhammadu Buhari at the State House, Abuja on Wednesday observed a minute silence for the victims of the Kaduna bound passenger train attacked on Monday by terrorists.The meeting holding at the Council Chambers kicked off with the Secretary to the Government of the Federation, Boss Mustapha, while calling for the observance of a minute silence for the deceased, disclosed that both the main train and the rescued train were attacked resulting in the death of eight persons, over 46 people injured and several others kidnapped.\nThe virtual meeting which is being attended by Vice President Yemi Osinbajo, Secretary to Government of the Federation (SGF), Boss Mustapha; National Security Adviser (NSA), Major General Babagana Monguno (rtd); Chief of Staff to the President, Prof Ibrahim Gambari and Head of Civil Service of the Federation, Dr (Mrs) Folashade Yemi-Esan.Ministers attending the meeting include that of Works and Housing, Babatunde Fashola; Information and Culture, Lai Mohammed; Finance, Budget and National Planning, Zainab Ahmed; Foreign Affairs, Geoffrey Onyema; Trade and Investment, Niyi Adebayo; Humanitarian Affairs and Disaster Management, Sadiya Umar Farouk; Attorney General of the Federation and Justice Minister, Abubakar Malami; and Health, Dr Ehanire Osagie.Others are Minister of State for Labour and Employment, Festus Keyamo; his Mines and Steel counterpart, Uche Ogar.\nOther Ministers are attending the meeting virtually from their respective offices in Abuja.\nSee ImagesShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking News: CAF Doctor Dies in Abuja Stadium Stampede",
    "summarized_story": "He was on duty as Doping officer.\nHe collapsed suddenly and died.\nCause of death not confirmed yet.\nHe lost consciousness was rushed to an ambulance closer to the Ghana dressing for CPR.\nThe entire Ghanaian contingent watched on as resuscitation attempts were made with oxygen mask."
  },
  {
    "headline": "Scores Feared Kidnapped in Terrorists’ Daredevil Raid on Kaduna Train",
    "summarized_story": "According to her, “The terrorists were moving about in the train, but they did not come to where I was seated.\nThe security personnel on the train announced that everybody should lie down on the floor of the train.\nMeanwhile, the Kaduna State Governor, Mallam Nasir El-Rufai, has visited victims of the attacks in the hospitals.\nThe lawmaker, noted that terrorists had in recent times stepped up attacks on some communities and public facilities in Kaduna State.\nThis came as the police IG said seven people lost their lives while 29 persons sustained injuries in Monday’s train attack along the Abuja- Kaduna route."
  },
  {
    "headline": "Nigeria’s Multiple, Overlapping Tax System Worries Buhari",
    "summarized_story": "•Says it’s inefficient, creates uncertainty, instability•Canvasses efficient tax administration for increased revenueDeji Elumoye in AbujaPresident Muhammadu Buhari has faulted the nation’s current multiple and overlapping tax system saying it’s inefficient and creates uncertainty and instability.\n”One key deliverable of this year’s tax dialogue is to promote synergy in tax administration among the different tiers of government.\nAccording to her: “The other tax revenue objectives are:”To institutionalise a healthy tax culture among Nigerians.\nThe right attitude towards taxation will enable every Nigerian to become a co-guardian of the tax system and the commonwealth.\nAs such, all hands must be on deck to support the tax system and make it function efficiently."
  },
  {
    "headline": "$418m Paris Refund: Governors Appeal Suit Challenging Dismissal of Deductions",
    "summarized_story": "Chuks OkochaGovernors of the 36 States of the Federation have appealed the court judgment which dismissed their suit challenging the federal government’s planned deduction of $418 million from the federation account to settle debts owed consultants engaged by the states and local governments on the Paris Club refunds.\nJustice Inyang Ekwo had dismissed a suit by the Attorney-General of the 36 states against the federal government in a judgment delivered recently saying the attorneys-general have not shown enough evidence to accord them the right to institute the action.\nHe held that there was no express evidence to show that the governors of the 36 states consented to the filing of the suit.\nHowever, the governors through their attorneys in their appeal, advised the general public and all financial institutions in Nigeria and abroad that the matter was subjudice and urging them to desist from dealing with the defendants in the suit.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EXCLUSIVE: How Ex-Lagos Governor Tinubu Was Embarrassed, Forced To Cancel Birthday Colloquium After Buhari, Osinbajo, Others Snubbed Event",
    "summarized_story": "“Contrary to his claims, the real reason was poor attendance; Buhari boycotted; the Senate President boycotted; only three governors showed up; Ganduje, Oyetola Gboyega of Osun and Lagos Governor, Babatunde Sanwo-Olu.\nIt was all false that he cared about the train victims,” one of the top sources explained.\n“They used their absence to send a final message to Tinubu that he won’t be their candidate.\n“He (Tinubu) only used that to save face; the truth is that he was embarrassed by the level of attendance despite assurances that heavyweights would attend.\n\"Even the Vice President (Prof Yemi Osinbajo) didn’t attend, though he was in Abeokuta the previous day,” another top source said."
  },
  {
    "headline": "EXCLUSIVE: How Ex-Lagos Governor Tinubu Was Embarrassed, Forced To Cancel Birthday Colloquium After Buhari, Osinbajo, Others Snubbed Event",
    "summarized_story": "“Contrary to his claims, the real reason was poor attendance; Buhari boycotted; the Senate President boycotted; only three governors showed up; Ganduje, Oyetola Gboyega of Osun and Lagos Governor, Babatunde Sanwo-Olu.\nIt was all false that he cared about the train victims,” one of the top sources explained.\n“They used their absence to send a final message to Tinubu that he won’t be their candidate.\n“He (Tinubu) only used that to save face; the truth is that he was embarrassed by the level of attendance despite assurances that heavyweights would attend.\n\"Even the Vice President (Prof Yemi Osinbajo) didn’t attend, though he was in Abeokuta the previous day,” another top source said."
  },
  {
    "headline": "FULL LIST: Names, Phone Numbers Of Over 300 Passengers On Abuja-Kaduna Train Attacked By Terrorists",
    "summarized_story": "The Kaduna State Government has released the passenger manifest for the Abuja-Kaduna train service AK9 which was attacked by bandits on Monday.\nSaharaReporters had reported how terrorists bombed the Abuja-Kaduna train en route Rigasa destination with hundreds of passengers on-board.\nDuring the attack, many passengers were feared kidnapped, others shot dead and unascertained number of the passengers also sustained various degrees of injury.\nSaharaReporters had reported that Wakkala was among the Abuja-Kaduna train passengers who was shot by terrorists on Monday evening.\nSaharaReporters had reported that two cleaners and workers of the attacked Abuja-Kaduna train identified as Loretta and Abdul were confirmed dead."
  },
  {
    "headline": "FULL LIST: Names, Phone Numbers Of Over 300 Passengers On Abuja-Kaduna Train Attacked By Terrorists",
    "summarized_story": "The Kaduna State Government has released the passenger manifest for the Abuja-Kaduna train service AK9 which was attacked by bandits on Monday.\nSaharaReporters had reported how terrorists bombed the Abuja-Kaduna train en route Rigasa destination with hundreds of passengers on-board.\nDuring the attack, many passengers were feared kidnapped, others shot dead and unascertained number of the passengers also sustained various degrees of injury.\nSaharaReporters had reported that Wakkala was among the Abuja-Kaduna train passengers who was shot by terrorists on Monday evening.\nSaharaReporters had reported that two cleaners and workers of the attacked Abuja-Kaduna train identified as Loretta and Abdul were confirmed dead."
  },
  {
    "headline": "Pro-Biafra Group, BnL Gives Date To Mount Roadblocks On South-East Major Roads To Support Nnamdi Kanu",
    "summarized_story": "Pro-Biafra group, the Biafra Nations League (BNL) has directed its fighters to mount roadblocks on major roads in the South East on April 8.\nThe group said it gave the order following the Indigenous People of Biafra (IPOB) leader, Nnamdi Kanu’s court proceedings coming up on the particular date.\nBNL, like IPOB is seeking to break the South-East away from Nigeria to form an independent country called Biafra.\nA statement issued by its leader, Princewill C Richards also directed members to block all border entrances.\nRecall that a few weeks ago, an attempt was reportedly made to apprehend two French oil workers in Bakassi by a militant group suspected to be BnL members."
  },
  {
    "headline": "Residents 'drown' while fleeing bandit attacks in Niger",
    "summarized_story": "A boat conveying residents has reportedly capsized in a river in Guni village, Munya LGA of Niger state.\nTheCable understands that the incident occurred on Wednesday afternoon.\nAdvertisementAccording to Muhammad, delegates have been sent to the area where the incident occurred, but they are yet to report back on their findings.\nEfforts to reach Wasiu Abiodun, Niger police spokesman, were not successful as he didn’t respond to calls or message.\nThe incident comes amid attacks by gunmen across communities in Niger state, which has resulted in killings, abductions, and displacement of scores of residents."
  },
  {
    "headline": "Residents 'drown' while fleeing bandit attacks in Niger",
    "summarized_story": "A boat conveying residents has reportedly capsized in a river in Guni village, Munya LGA of Niger state.\nTheCable understands that the incident occurred on Wednesday afternoon.\nAdvertisementAccording to Muhammad, delegates have been sent to the area where the incident occurred, but they are yet to report back on their findings.\nEfforts to reach Wasiu Abiodun, Niger police spokesman, were not successful as he didn’t respond to calls or message.\nThe incident comes amid attacks by gunmen across communities in Niger state, which has resulted in killings, abductions, and displacement of scores of residents."
  },
  {
    "headline": "Amaechi: Why NAF air surveillance was unavailable on day of Kaduna train attack",
    "summarized_story": "Rotimi Amaechi, minister of transportation, says trains are usually monitored by the Nigerian Air Force (NAF), but bad weather affected air surveillance on the day of the Abuja-Kaduna train attack.\nSpeaking on efforts to improve security arrangements when he visited patients at the 44 Nigerian Army Reference Hospital in Kaduna on Wednesday, he said the air force has resumed surveillance.\n‘But even if we don’t install, we have spoken with the Nigerian Air Force.\nAmaechi also commended the army hospital for giving the “maximum” medical treatment available to every patient without charging a dime.\nAdvertisement“The ministry and I think the federal government are grateful to the Nigerian Army for providing such services."
  },
  {
    "headline": "Amaechi: Why NAF air surveillance was unavailable on day of Kaduna train attack",
    "summarized_story": "Rotimi Amaechi, minister of transportation, says trains are usually monitored by the Nigerian Air Force (NAF), but bad weather affected air surveillance on the day of the Abuja-Kaduna train attack.\nSpeaking on efforts to improve security arrangements when he visited patients at the 44 Nigerian Army Reference Hospital in Kaduna on Wednesday, he said the air force has resumed surveillance.\n‘But even if we don’t install, we have spoken with the Nigerian Air Force.\nAmaechi also commended the army hospital for giving the “maximum” medical treatment available to every patient without charging a dime.\nAdvertisement“The ministry and I think the federal government are grateful to the Nigerian Army for providing such services."
  },
  {
    "headline": "‘An aberration’ — reps kick as IGP, defence minister shun invitation over Kaduna train attack",
    "summarized_story": "Members of the house of representatives have expressed dissatisfaction with the attitude of heads of agencies invited to the lower legislative chamber over the recent attack on a train in Kaduna.\nAdvertisementHowever, at the meeting on Wednesday, the public officials were absent and sent in their representatives instead.\nWase expressed displeasure over the non-appearance of the invited public officials and declined to allow their representatives to make presentations.\nAkinjobi, a representative of the minister of defence, said his boss was in a meeting summoned by the president over the attack.\n”It is in Nigerian parliament that you summon accounting officers that they won’t come."
  },
  {
    "headline": "Beyond investing in startups, Factor[e] is de-risking them for other investors",
    "summarized_story": "“The reward for work well done is the opportunity to do more.”The origin story of Factor[e] Ventures best exemplifies this statement by Jonas Stalk.\nDelcore joined Factor[e] in 2016 and has since risen to become a director at Factor[e].\nIn this interview she shares insights on how Factor[e] invests in tech startups.\nDA: What do you look out for before investing in these startups?\nMembers of Factor[e] Nairobi office brainstormingDA: What are some market trends you notice or look out for?"
  },
  {
    "headline": "How Ire Aderinokun is helping to shape Helicarrier's culture",
    "summarized_story": "The search for remote work has increased by 490% since the beginning of the pandemic.\nIn 2021, there were a number of product/market expansions on the continent that were fueled by raises and eased by remote work options.\nFounded in 2017 by Timi Ajiboye, Tomiwa Lasebikan and Ire Aderinokun, Helicarrier was originally Bitkoin Africa, a website for peer-to-peer (P2P) Bitcoin trading.\nOn building and maintaining company culture, Aderinokun states that most of the team members have direct relationships with 2 of the 3 co-founders.\nAs more team members get hired, though, Aderinokun believes that the team will have to find a sustainable method."
  },
  {
    "headline": "What does it look like to build a payment network marketplace?",
    "summarized_story": "But, with the increasing need to move money faster across different countries and continents, and the number of available cross-border payment networks, the answer is now yes.\nZazuu is a platform aggregating cross-border payment networks for people who want to send money to Africa from the UK and Europe.\nZazuu is the first marketplace for cross-border payment in the world, and it’s safe to say that the many ways its power can manifest haven’t been fully realised yet.\nBut one thing is clear: it will control the rate of cross-border payment in Africa.\nHowever, this is the first time in the world that a company is aggregating not just payment networks but cross-border payment networks."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ever heard of the term, Hope as a Service?\nWell, me neither.\nAt least until last Wednesday when we recorded..."
  },
  {
    "headline": "The complete guide to startup funding rounds",
    "summarized_story": "If you’ve read any tech media recently, you’ve come across funding terms like pre-seed, Series A, or Series B.\nThis guide will help you understand startup funding rounds.\nPre-seed rounds are typically below $1 million, but numerous African startups have raised pre-seed rounds that are above $1 million.\nSeed fundingAt the seed funding stage, your startup is ideally more mature than at the pre-seed stage.\nThe size of the rounds is also larger and for African startups ranges between $2.3 million and $110 million."
  },
  {
    "headline": "Why Y Combinator is interested in East and North Africa",
    "summarized_story": "Share this article:Hello there,Today, I’ll be discussing:Why Y Combinator is interested in East and North AfricaCredPal’s bridge roundDisney+’s launch in South AfricaWhy Y Combinator is interested in East and North AfricaPaystack CEO, Shola Akinlade speaking to participants at a YC meetup in Lagos“What’s the big deal with fundraising?” I asked last week while talking with Ogheneruemu, Bolu, Chimgozirim, and Joy.\nAnd one of the VCs I always watch out for is Y Combinator (YC).\nLaunched in 2005, Y Combinator is a startup accelerator based in the United States.\nFind out here: Investors on high alert as Y Combinator shows interest in East and North AfricaCredPal’s bridge roundSome finance and investment jargons used in funding news are beyond my comprehension.\nConsequently, bridge rounds assist startups in “bridging” the funding gap between larger funding rounds."
  },
  {
    "headline": "Investors on high alert as Y Combinator shows more interest in East and North Africa",
    "summarized_story": "Share this article:In 2005, while walking home after dinner, Paul Graham and Jessica Livingston decided to start Y Combinator (YC).\nEvery year since then has seen at least one African startup get into the famous accelerator programme.\nBeyond the usual suspects, Y Combinator has invested in startups founded or operating in Namibia, Uganda, Zambia, and Sudan in the last three years.\nDue to the conflict in the North African country, there have been several sanctions from the United Nations, the United States, and the European Union since 1997.\n“We believe that African startup founders will be a massive part of the continued development of the continent."
  },
  {
    "headline": "Land Grabbing: Community calls for Oba Ewuare II Intervention – Nigerian Observer",
    "summarized_story": "According to Idemudia and Ekhaguere, the duo have continually constituted themselves as a threat to peace in the community.\n“These persons have sold off all the land in the village belonging to indigenes; as a result of this act, there is no longer free land for indigenes to farm.\n“That these persons who are non-indigenes of the village have capitalised on this and had forcefully taken over, even the land belonging to the mother of your Royal Majesty,” they said.\nThey added that “It is on record that from time immemorial, Iguomo community was founded and belongs to the mother of the Oba of Benin Kingdom, but it is unfortunate that non-natives have taken over all the land and sold them, with the aid of Pa Godwin Usiomoifo.\n“These persons have formed and become the overlords of the entire village as innocent indigenes of the village can no longer move freely in their own village."
  },
  {
    "headline": "Edo plans cultural hubs in senatorial districts to preserve, promote heritage – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has disclosed plans to establish cultural hubs in the three senatorial districts of the state to preserve and promote Edo’s rich cultural heritage.\nThe Edo State Commissioner for Arts, Culture, Tourism and Diaspora Affairs, Hon.\nPrince Bamidele Obaitan, disclosed this to journalists in Benin City during a programme organized by the Ministry to mark the 2022 World Theatre Day.\nObaitan said the cultural hubs will leverage technology and the innovative potential of Edo youths to advance the preservation of the state’s cultural assets.\nObaitan announced that the Ministry of Arts, Culture and Tourism is currently doing a collation of all local festivals across the state in a bid to develop it into a calendar to boost the development of culture."
  },
  {
    "headline": "Obaseki seeks investments in Benin River Port, Enterprise Park, others at Dubai summit …showcases Edo’s business potential – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki at this year’s Annual Investment Meeting (AIM) in Dubai, thrilled investors with his pitch for investments in the Benin River Port, the Enterprise Park, and the Benin Inland Container Depot/Dry Port, among other big-ticket projects, in a drive to deepen development and open up the state’s economy for productivity and industrialization.\nThe governor is among members of the Nigeria Governors’ Forum (NGF) participating in the annual summit and seeking foreign direct investments from businesses and organisations in the United Arab Emirates (UAE).\nOthers on the delegation include Governors of Abia, Akwa Ibom, Bauchi, Bayelsa, Cross River, Ekiti, Enugu, Kwara, Niger, Ondo, Plateau, Sokoto and Yobe States.\nNoting the economic benefits of the Benin River Port and Edo Enterprise Park projects, the governor said his government will continue to push for more of such projects to ensure the requisite infrastructure to attract and keep investment and engender inclusive growth.\nThe Annual Investment Meeting (AIM) is an initiative of the UAE Ministry of Economy designed to provide a framework for global exchange on the key principles underpinning international investment policies, strategies and practices for sustainable development to achieve smart and inclusive global growth."
  },
  {
    "headline": "Financial crises rock Edo cooperative societies over non remittance of deductions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestCooperative societies in the eighteen local government councils and the Ambrose Ali University, Ekpoma are struggling under serious financial crises following the non remittance of due deductions by the respective Managementsof the councils and the university.\nAddressing newsmen shortly after a meeting with officials of the Edo State Ministry of Trade, Investment and Cooperatives led by the Commissioner Aishetu Braimah where the nagging issues were tabled, President of the Federation of Edo Cooperative societies Mr Filani Ojo said the non remittance of the said deductions has crippled activities of the aforementioned cooperative societies in the state.\nHe disclosed that the management of Ambrose Alli University was yet to remit deductions in Union dues and workers financial commitments to the AAU’s Cooperative Society in the tune of over N800 million.\nOredo Local Council he said had withheld over N120 million in deduction of monies belonging to the workers’ Cooperative Society.\nHe said the unhealthy development has crippled the activities of the cooperative societies and make them inable to meet their financial obligations to contributors of the funds."
  },
  {
    "headline": "FEC votes N1bn for lie detector, other equipment for NDLEA",
    "summarized_story": "The Federal Executive Council (FEC), has approved the sum of N1.06 billion for the purchase of lie detector equipment and night vision goggles for the National Drug Law Enforcement Agency (NDLEA).\nAbubakar Malami, the attorney-general of the federation, who made the disclosure on Wednesday, said the equipment is to enhance the operations of the NDLEA.\n“One was a memo seeking the approval of the council for the award of contract for the supply of eye-scanning lie detector.\n“So, the memo in that respect was presented, it was taken and the contract was approved for Messrs Zettabytes Technologies Limited to procure for the agency this lie detector equipment.\n“The second memo sought the approval of the council for the supply of digital night vision goggles."
  },
  {
    "headline": "2023: PDP extends date for sale of forms, reschedules screening",
    "summarized_story": "Nigeria’s main opposition party, the People’s Democratic Party (PDP), has extended the deadline for sale of its nomination forms ahead of the 2023 general elections.\nThe party which announced the decision in a memo by its national organising secretary, Umar Bature, to all states chairmen on Wednesday, also rescheduled the date for screening aspirants.\nThe memo dated March 30, reads, “The National Working Committee (NWC) of our great party and the Peoples Democratic Party (PDP), has approved the extension of Sales of Forms for all offices from the initial date of Friday, 1 April 2022, to Friday, 8 April 2022.\n“In the same vein, the last day for the return of already completed Forms and Screening Exercises for both the State House of Assembly and National Assembly (Senate and House of Representatives) have been rescheduled.\n“For the avoidance of doubt, the last day for the purchase of all Forms is now Friday, 8 April 2022.”Recall that the party had earlier slated Friday, 1 April 2022, as closing date for the sale of forms,Facebook Notice for EU!"
  },
  {
    "headline": "Bishop Kukah blames Nigeria’s challenge on poorly educated leadership",
    "summarized_story": "Matthew Hassan Kukah, Catholic Bishop of Sokoto Diocese, has attributed the current lack of good governance in Nigeria to poor of knowledge among the political elite.\nBishop Kukah who spoke when he paid a courtesy call on the Vice-Chancellor of the Federal University Dutsinma (FUDMA), Katsina State on Tuesday, noted that the late Umaru Musa Ya’Adua was the first Nigerian president who had a university degree.\nThe Catholic clergy decried the prevalence of tribal and religious discrimination in the academic circle and called for understanding among the academics.\nBecause frankly if this does not happen, politics will not change our country, it is only knowledge that can change our society” he stated.\n“In FUDMA we give equal opportunity to all irrespective of their inclinations so that one can be useful to himself and his community."
  },
  {
    "headline": "BUA Cement declares N90bn profit in audited 2021 results",
    "summarized_story": "BUA Cement Plc, has recorded 24.51% growth in profit, year-on-year, to N90 billion in its audited 2021 financial year results.\nSales of bulk cement increased by 40.45% to bring in N615 million, while sales of bagged cement grew by 22.83%, generating N257 billion during the period.\nDespite the growth in topline revenues, however, administrative expenses rose much higher than the inflation rate at 29% year on year.\nSelling and distribution expenses grew by 23%, however, the company drastically reduced its expenses on Adverts and promotions by 87% compared to the prior-year period.\nBUA Cement has earnings per share (EPS) for the period was at N2.66, a 24% increase from N2.14 in FY 2020."
  },
  {
    "headline": "Knowledge, Not Politics Will Change Nigeria’s Situation – Kukah",
    "summarized_story": "The Catholic Bishop of Sokoto Diocese, Matthew Hassan Kukah, has said that the clergymen will continue to pray for university community to end the problem between the academics and government, adding that only knowledge and not politics can change Nigeria’s situation.\nBishop Kukah also attributed the current lack of good governance in Nigeria to a lack of knowledge among those holding power in the country.\nKukah stated this when he paid a courtesy call on the Vice Chancellor of the Federal University Dutsinma (FUDMA) in Katsina State on Tuesday.\nADVERTISEMENT“So whenever I have the opportunity, I like to encourage members of the university community because they are engaged in a long-suffering job that the country itself does not recognise and appreciate.\nBecause frankly if this does not happen, politics will not change our country, it is only knowledge that can change our society,” he added."
  },
  {
    "headline": "Insecurity: Police Acquire 5 High-powered Unmanned Aerial Vehicles",
    "summarized_story": "The inspector-general of Police, IGP Usman Baba, has acquired five additional high-powered Unmanned Aerial Vehicles (UAVs) to improve surveillance operations to checkmate criminal activities in the country in line with the IGP’s vision and mission statements which include technology-driven policing.\nThe acquisition is the manifestation of the IGP’s determination to integrate the use of innovative technology in the law enforcement duties of the Nigeria Police Force and ultimately enhance its intelligence gathering and operational capabilities.\nForce PRO, CSP Olumuyiwa Adejobi, said the drones will assist the Police in monitoring active crime scenes, coordinating response operations, and providing aerial support to responding officers.\nThe UAVs include an ALTI Transition, capable of covering up to 150km in a single flight with high endurance of up to 14 hours, and an Elistair Orion fixed-wing aircraft, capable of covering up to 92m altitude with high endurance of up to 50 hours and other sensitive and forensic-based features.\nThe IGP has, however, directed the immediate, adequate, and strategic deployment of these drones to areas prone to high-security breaches, for monitoring and intelligence gathering to tackle criminality headlong."
  },
  {
    "headline": "Insecurity: Police Acquire 5 High-powered Unmanned Aerial Vehicles",
    "summarized_story": "The inspector-general of Police, IGP Usman Baba, has acquired five additional high-powered Unmanned Aerial Vehicles (UAVs) to improve surveillance operations to checkmate criminal activities in the country in line with the IGP’s vision and mission statements which include technology-driven policing.\nThe acquisition is the manifestation of the IGP’s determination to integrate the use of innovative technology in the law enforcement duties of the Nigeria Police Force and ultimately enhance its intelligence gathering and operational capabilities.\nForce PRO, CSP Olumuyiwa Adejobi, said the drones will assist the Police in monitoring active crime scenes, coordinating response operations, and providing aerial support to responding officers.\nThe UAVs include an ALTI Transition, capable of covering up to 150km in a single flight with high endurance of up to 14 hours, and an Elistair Orion fixed-wing aircraft, capable of covering up to 92m altitude with high endurance of up to 50 hours and other sensitive and forensic-based features.\nThe IGP has, however, directed the immediate, adequate, and strategic deployment of these drones to areas prone to high-security breaches, for monitoring and intelligence gathering to tackle criminality headlong."
  },
  {
    "headline": "Leading RSPHCM Board, A Dream Come True – Dr. Harry",
    "summarized_story": "The Permanent Secretary in the Rivers State Primary Health Care Management Management Board (RSPHCMB) Dr. Agiriye Monima Harry, has stated that heading the agency is a long-term dream as it affords him the opportunity to serve the public in different dimensions.\nDr. Harry, who is a Nigerian trained Medical practitioner with specialty in Orthopaedic Medicine, has dedicated almost the last two decades of his life into the Rivers State Civil Service.\nAt a recent event while speaking with journalists, he stated that, “Leading RSPHCMB is a dream come true” for him and he was ready to put in more work to take the agency to greater heights.\nCoordinator of River State Emergency Medical Services from April 2003 through October 2007; and director of River State Emergency Medical Services from October 2007 through 2013.\nDirector of medical service, River State Ministry of Health from May 2013 through July 2013; director of special programmes at River State Emergency Medical Services from July 2013 through August 2015; appointed permanent secretary Rivers State Primary Health Care Management Board (RSPHCMB) on August 2015."
  },
  {
    "headline": "Leading RSPHCM Board, A Dream Come True – Dr. Harry",
    "summarized_story": "The Permanent Secretary in the Rivers State Primary Health Care Management Management Board (RSPHCMB) Dr. Agiriye Monima Harry, has stated that heading the agency is a long-term dream as it affords him the opportunity to serve the public in different dimensions.\nDr. Harry, who is a Nigerian trained Medical practitioner with specialty in Orthopaedic Medicine, has dedicated almost the last two decades of his life into the Rivers State Civil Service.\nAt a recent event while speaking with journalists, he stated that, “Leading RSPHCMB is a dream come true” for him and he was ready to put in more work to take the agency to greater heights.\nCoordinator of River State Emergency Medical Services from April 2003 through October 2007; and director of River State Emergency Medical Services from October 2007 through 2013.\nDirector of medical service, River State Ministry of Health from May 2013 through July 2013; director of special programmes at River State Emergency Medical Services from July 2013 through August 2015; appointed permanent secretary Rivers State Primary Health Care Management Board (RSPHCMB) on August 2015."
  },
  {
    "headline": "Nigerian lady set to wed in April is missing after being in the illfated Abuja-Kaduna train",
    "summarized_story": "Nigerian lady set to wed in April is missing after being in the illfated Abuja-Kaduna trainA young woman identified as Hannah Ajewole, whose wedding is slated for April 30, 2022, is missing after being a victim of the Monday, March 28, Abuja-Kaduna train attack.\nHannah worked with the tea section of the railway services and was on the train when it was attacked by the terrorists.\n“They’ve checked the mortuary among the dead, she’s not there, they’ve checked the hospitals among the injured; she’s not there either.\nShe is getting married on April 30, 2022.\nIt is not certain if the bandits have contacted the families of the abducted persons."
  },
  {
    "headline": "Kwankwaso Reveals Reason Why He Dumped PDP For NNPP",
    "summarized_story": "Senator Rabiu Musa Kwankwaso, a former governor of Kano State, has disclosed why he switched from the opposition Peoples Democratic Party (PDP) to the New Nigeria Peoples Party (NNPP).\nKankwaso, a presidential candidate in the 2019 elections, officially abandoned the PDP on Wednesday, according to NEWS DIRECT.\nKwankaso, speaking while receiving his new party’s membership card, blamed his actions on the main opposition party’s crisis.\nHe said, “We had a situation in April last year where zonal positions were being shared among the States and all leaders in the six other States were given the opportunity to nominate.\nBut in Kano, some people felt I wasn’t that important, so they had to do what they did."
  },
  {
    "headline": "Osun Guber: Oyetola Will Be Re-elected, The Odds Notwithstanding — Sanwo-Olu",
    "summarized_story": "The Governor of Lagos State, Mr. Babajide Sanwo-Olu, has expressed confidence in the ability of his Osun State counterpart, Adegboyega Oyetola, to be re-elected for second term.\nSanwo-Olu said the Governor has done well to get re-elected for second term, saying “Against all odds Oyetola will be returned for second term”The Lagos State Governor made the statements while giving his remarks at the special prayers session organised to celebrate the 70th birthday anniversary of a former Governor of Lagos State and National Leader of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu.\nThe prayer which was held at the premises of the residence of the former Lagos State Governor, had in attendance ‘who is who’s in the country."
  },
  {
    "headline": "Katsina Commissioner Shot By Terrorists During Abuja-Kaduna Train Bombing, Loses Two Toes",
    "summarized_story": "The Katsina State Commissioner for Health, Nuhu Danja, has been confirmed to be among those who sustained gunshot wounds in the Kaduna-Abuja train attack.\nThe Secretary-General of the Trade Union Congress (TUC) of Nigeria, Barrister Musa-Lawal Ozigi, was also confirmed among the passengers killed when terrorists bombed the Abuja-Kaduna train.\nSaharaReporters earlier reported that a former Deputy Governor of Zamfara State, Malam Ibrahim Wakkala, was among the Abuja-Kaduna train passengers who was shot by terrorists on Monday evening.\nSaharaReporters had reported that two cleaners and workers of the attacked Abuja-Kaduna train identified as Loretta and Abdul were confirmed dead.\nThere are at least 970 passengers on board the train, according to official sources familiar with the train service."
  },
  {
    "headline": "Breaking: CAF official dies day after fans invaded Abuja stadium",
    "summarized_story": "An official of the Confederation of African Football (CAF) has reportedly passed on following the invasion of the Nigeria’s National Stadium by hoodlums.\nHoodlums invaded the Moshood Abiola Stadium in Abuja after Nigeria lost on aggregate to Ghana in the second leg of the 2022 World Cup qualifying tie.\nAs soon as the referee declared the match closed, a lot of angry Nigerian fans invaded the stadium complex, destroying the facility as well as causing havoc.\nDr. Joseph Kabungo, one of the CAF’s doping officials for the game between Ghana and Nigeria was caught in the crisis.\nHe was reported to have lost lost consciousness after he was beaten and stepped on as fans try to make their way out of the stadium due to stampede."
  },
  {
    "headline": "Train attack: Names of prominient dead, missing, injured victims emerge as Buhari, NASS drop hint for security chiefs",
    "summarized_story": "Kaduna state Governor Nasir el-Rufai has confirmed that eight dead bodies were recovered, 26 people injured, with several passengers onboard the Abuja-Kaduna train attacked Monday night by bandits, still missing.\n“Security agencies have reported that eight bodies were recovered and 26 persons were injured during the attack.\nThe missing, dead passengersIn a related development, the Secretary General, Trade Union Congress (TUC), Comrade Musa Lawal Ozigi and the Kwara state branch chairman of the union, Comrade Akin Akinsola, were among victims of the Kaduna train attack.\n“The current security malaise in the state is certainly not what the people of Kaduna state bargained for.\nThe terrified passengers only breathed a sigh of relief when security agencies arrived and secured the train and the area."
  },
  {
    "headline": "Breaking: Super Eagles fail to pick 2022 World Cup ticket",
    "summarized_story": "After a disappointing 1-1 draw in the return leg of 2022 FIFA World Cup playoffs against the Black stars of Ghana, Super Eagles failed to pick the expected ticket to Qatar.\nDetails loading…"
  },
  {
    "headline": "Kaduna Train Attack: FG To Begin Repair Works, Recruit Locals For Security",
    "summarized_story": "Repairs on the damaged portion of the Abuja-Kaduna rail line will commence immediately as the Federal Government is considering recruiting locals for security at blackspot areas.\nThe Minister of Transportation, Rotimi Amaechi, disclosed this in Kaduna on Wednesday during a visit to victims of the attack on a Kaduna-bound train by gunmen.\nThe minister also disclosed that the Federal Government is also working out plans to engage locals in the communities where the bandits operate along the rail.\nThe hospitals he visited include the Nigerian Army Reference Hospital, Kaduna where 25 victims were said to have been admitted.\nAt the St. Gerrard Catholic Hospital, eleven victims were admitted, out of which ten have been discharged, and one female currently receiving treatment."
  },
  {
    "headline": "Kaduna Train Attack Questions Our Collective Ability To Govern – Nigerian Governors",
    "summarized_story": "The Nigeria Governors Forum (NGF) has condemned the Abuja-Kaduna train attack, stating that such violent attacks are becoming too many and it questions their collective capacity to govern.\nThe governors said this in a statement on Wednesday and described the attack as a horror dream.\n“The Kaduna -Abuja train attack on Monday night is a horror dream orchestrated by the wicked merchants of death that we must all wake up from to address.\nIt will certainly pass.”They also expressed condolences to Nigerians, the Kaduna State government, and the people of Kaduna State.\nThey applauded the Nigerian security agents for their efforts in coming to the rescue of the victims of the attack."
  },
  {
    "headline": "Senate Asks Pay-TV Service Providers To Revert To Pay-Per-View Subscription Model",
    "summarized_story": "The Senate has asked the Federal Ministry of Communications and Digital Economy and the Nigerian Communications Commission (NCC) to direct all pay-TV providers to introduce a pay-per-view model of subscription as against the monthly prepaid model currently in place.\nThe upper chamber is also asking all pay-tv service providers in Nigeria to immediately review their bouquet prices downwards in tandem with the prevailing economic realities in the country.\nREAD ALSO: Abuja-Kaduna Train Attack: ‘I Warned That Lives Will Be Lost’ – AmaechiThese decisions taken by the Senate are sequel to a motion by Senator Abba Morro titled “Nigerians dumbfounded and outraged over pay-tv tariff hikes, demand for the pay-per-view subscription model”.\nSenator Moro informed the Senate of the recent subscription price hike announced by leading pay-tv service provider, Multichoice Nigeria, of an increase in subscriber fees.\nAccording to him, Nigerians are demanding that rather than paying fixed rates for packages monthly, pay-tv service providers should introduce a subscription model which allows subscribers pay-per-view to enable them to match their tv consumption to subscription as is the case with electricity metering and mobile telephony."
  },
  {
    "headline": "FG Approves Procurement Of Lie Detectors, Night Vision Goggles For NDLEA",
    "summarized_story": "﻿The Federal Government has approved the purchase of lie detectors and night vision Goggles for the National Drug Law Enforcement Agency (NDLEA).\nThis was disclosed by the Minister of Justice and the Attorney General of the Federation, Abubakar Malami (SAN) after the Federal Executive Council (FEC) meeting in Abuja on Wednesday.\n“One was a memo seeking the approval of the council for the award of contract for the supply of eye-scanning lie detector.\n“So, the memo in that respect was presented, it was taken and the contract was approved for Messrs Zettabytes Technologies Limited to procure for the agency this lie detector equipment.\n“The second memo sought the approval of the council for the supply of digital night vision goggles."
  },
  {
    "headline": "Kaduna Train Attack: Passengers Opt For Road Transportation",
    "summarized_story": "Road travel was at full swing on Wednesday at various motor parks in Kaduna State with the passengers trooping in to board vehicles to Abuja.\nThe followed the attack on an Abuja-Kaduna bound train and the subsequent temporary suspension of train services on that route by the Nigerian Railway Corporation (NRC).\nThey are also calling on the Federal Government to deploy more security on that road.\nRELATED:Abuja-Kaduna Train Attack: ‘I Warned That Lives Will Be Lost’ – AmaechiKaduna Train Attack Questions Our Collective Ability To Govern – Nigerian GovernorsKaduna Train Attack: FG To Begin Repair Works, Recruit Locals For SecurityAt the popular Command Junction Motor Park, passengers are trooping, either arriving or departing from the park unlike in the past years.\nThose who have braved the odds to travel by road may have to do so with their hearts in their hands and not by choice."
  },
  {
    "headline": "Enugu Environment Commissioner resigns to contest Governorship Seat -",
    "summarized_story": "Enugu State commissioner for Environment and Mineral Resources, Chijioke Edeoga, has resigned from the State Executive Council.\nEdeoga, who made his resignation known in a farewell remarks to the staff of the ministry, note that his resignation was in consonant with the newly amended 2022 electoral act, to contest the Enugu State 2023 Governorship election.\nHe thanked Governor Ifeanyi Ugwuanyi the opportunity to serve in his cabinet, staff of the ministry for their support and cooperation while he worked with them.\nThe commissioner hails from Isi-Uzo Council Area of Enugu East Senatorial district, which the state ruling People’s Democratic Party have zoned the next governorship election to."
  },
  {
    "headline": "Gbajabiamila pays tribute to Tinubu at 70, says he's pillar of modern developmental strides in Lagos",
    "summarized_story": "The Speaker of the House of Representatives Rep. Femi Gbajabiamila has paid glowing tributes to the national leader of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu, on his 70th birthday.\nThe speaker noted with delight Tinubu’s invaluable contributions to Nigeria’s democracy in the past decades, saying he has unmatched credentials.\nSpeaker Gbajabiamila recalled how Tinubu used his acumen to turn things around in Lagos State when he served as governor for eight years.\nReferring to Tinubu as the pillar of modern developmental strides in Lagos State, Gbajabiamila said he believes the APC national leader will go down in history as one of the best and most impactful democrats Nigeria has had.\nThe speaker wished the Asiwaju more fruitful years in good health as well as increased wisdom from the Almighty God."
  },
  {
    "headline": "Niger Governor greets Tinubu at 70, describes him as a \"transformative leader\"",
    "summarized_story": "Niger State Governor and Chairman North Central Governors Forum (NCGF) Abubakar Sani Bello has paid glowing tributes to National Leader of All Progressives Congress APC and former Governor of Lagos State, Senator Asiwaju Bola Tinubu as he celebrate his 70th birthday.\nGovernor Sani Bello, in a congratulatory massage to the septuagenarian described him as a visionary and transformative leaderThe Governor said the celebrant who is also the Jagaban of Borgu Kingdom, has remained a Colossus and a phenomenon in the annals of the ruling party and the nation’s political history.\nThe Governor noted that the exceptional political career and service of Tinubu, has inspired so many people and has produced many successful leaders in the country.\nHe added that the APC National Leader is an icon, bridge builder and a patriotic elder statesman who believes in the development, unity and corporate existence of Nigeria.\nThe Governor prayed for more years in good health and wisdom for the celebrant, to continue to serve humanity."
  },
  {
    "headline": "Femi Adekanmbi eulogises Asiwaju Bola Tinubu @ 70",
    "summarized_story": "A former commissioner for culture, tourism and special duties in Ondo State, Chief Femi Adekanmbi has described the National leader of the All Progressives Congress, APC, Asiwaju Bola Tinubu as a phenomenon in the annals of the nation’s political history.\nAdekanmbi in a message to celebrate the former Lagos State Governor at 70, described him as a visionary and transformative leaderAccording to him, ” Asiwaju Bola Ahmed Tinubu who is also the Jagaban of Borgu Kingdom, has remained a colossus and a phenomenon in the annals of the ruling party and the nation’s political history.\n“The exceptional political career and service of Tinubu, has inspired so many people and has produced many successful leaders in the country”.\nHe added that the APC National Leader is an icon, bridge builder and patriotic elder statesman who believes in the development, unity and corporate existence of Nigeria.\n“I felicitate with you on your 70th birthday Asiwaju."
  },
  {
    "headline": "‘We Will Wrestle Power From the Ruling Party, APC, in Lagos’- Abdul-Azeez Adediran",
    "summarized_story": "The Lead Visioner of the Lagos4Lagos Movement, Mr Olajide Adediran, popularly known as Jandor, has formally declared his interest to contest the Lagos State governorship election on the platform of the Peoples Democratic Party in 2023.\nAdediran, who defected from the All Progressives Congress to join the PDP, made the declaration last week during an event attended by party members and supporters in Ikeja GRA.\nHe said his movement is joining forces with the PDP to wrestle power from the ruling APC in Lagos state.\nTo discuss why he wants to be the next governor of Lagos state, is Abdul-Azeez Olajide Adediran (JANDOR)"
  },
  {
    "headline": "Tinubu Cancels Colloquium Over Terrorist Attack+ Osinbajo’s Visit To Kaduna – Trending With Ojy Okpe",
    "summarized_story": "Presidential Aspirant Bola Ahmed Tinubu on Tuesday cancelled the colloquium organised in commemoration of his 70th birthday over the Abuja Kaduna train attack by terrorists on Monday.\nMeanwhile, Vice-President Yemi Osinbajo who was meant to be at the colloquium made a detour to Kaduna to visit the victims of the train attack.\nFinally, following the Super Eagles’s defeat by the Black Stars of Ghana, at the Moshood Abiola Stadium where supporters of the Super Eagles were seen invading the pitch in protest and vandalizing facilities, A journalist Shina Oludare who was at the scene took to Twitter accusing military officers and policemen of assaulting him while he was recording the stampede at the entrance of the Stadium."
  },
  {
    "headline": "Russia Launches New Attacks after Peace Promise",
    "summarized_story": "The governor of Ukraine’s Chernihiv region says there is no let-up in attacks by Russia, despite its pledge to reduce military activity there.\nOf course not,” he said, adding Russia had bombarded Chernihiv “all night long”.\nOn Tuesday, Russia said it would cut back operations around Chernihiv and the capital, Kyiv.\nAir raid sirens sounded in Kyiv in the early hours of Wednesday, hours after Russia said it would withdraw some troops from around the capital.\nRussia’s pledge to cut back military activity was met with scepticism."
  },
  {
    "headline": "Air France KLM Loses Fight Against EU Cartel Fine",
    "summarized_story": "Air France-KLM and its Dutch subsidiary KLM on Wednesday lost their challenge against million-euro fines re-imposed by EU antitrust regulators five years ago for taking part in an air cargo cartel two decades ago.\nThe European Commission had fined Air France 182.9 million euros ($204 million), the highest, followed by KLM at 127.1 million.\nRelatedStories No Content AvailableThe Luxembourg-based General Court rejected Air France KLM and KLM’s appeals and those brought by Martinair Holland, Cargolux, Lufthansa (LHAG.DE) and Singapore Airlines (SIAL.SI).\nIt reduced the Commission’s fines but also hiked them for Japan Airlines, Air Canada, British Airways, Cathay Pacific Airways, SAS Cargo Group and Others, Latam Airlines Group and Lan Cargo.\nThe cases are T-323/17 Martinair Holland, T-324/17 SAS Cargo Group and others, T-325/17 KLM, T-336/17 Air Canada, T-334/17 Cargolux Airlines, T-337/17 Air France–KLM, T-338/17 Air France, T-340/17 Japan Airlines, Case T-341/17 British Airways, T-342/17 Deutsche Lufthansa and others, T-343/17 Cathay Pacific Airways, T-344/17 Latam Airlines Group & Lan Cargo and T-350/17 Singapore Airlines & Singapore Airlines Cargo."
  },
  {
    "headline": "Russian Pledge to Scale Back in Ukraine Draws Skepticism",
    "summarized_story": "Russia’s pledge to scale back some military operations in Ukraine drew skepticism, a bitter reality check in a rare moment of optimism five weeks into what has devolved into a bloody war of attrition.\nRussian delegation head Vladimir Medinsky said negotiators would take Ukraine’s proposals to Russian President Vladimir Putin and then Moscow would provide a response, but he did not say when.\nCavusoglu said he expected a meeting between the Russian and Ukrainian foreign ministers at an unspecified time.\n“We judge the Russian military machine by its actions, not just its words,” British Deputy Prime Minister Dominic Raab told Sky News on Wednesday.\n“Such activity is placing further pressure on Russia’s already strained logistics and demonstrates the difficulties Russia is having reorganizing its units in forward areas within Ukraine.”"
  }
]