[
  {
    "headline": "PICTORIAL: Oyedepo visits Taiwo Odukoya over wife’s death",
    "summarized_story": "Founder and General Overseer of the Living Faith Church Worldwide, Bishop David Oyedepo, on Wednesday paid a condolence visit to the senior pastor of Fountain of Life Church, Taiwo Odukoya, over the death of his wife.\nThe late wife of the cleric, Nomthi Odukoya, died on Tuesday after a two-year battle with cancer.\nTo commiserate with the Odukoyas, Oyedepo, alongside his wife, Faith Oyedepo, visited the family’s residence and were received by Pastor Taiwo.\nSee photos below:Photo credit: Church GistOdukoya, got married to Nomthi in 2010 after the death of his first wife, Bimbo, in the 2005 Sosoliso plane crash.\nNomthi, in her 11 years of marrying the cleric, had two sons for him: Jomiloju and Timilehin Odukoya."
  },
  {
    "headline": "Google wins UK legal case over iPhone tracking",
    "summarized_story": "Britain’s highest court on Wednesday blocked a $4-billion class action against Google that had accused the company of illegally tracking millions of iPhone users.\nThe “Google You Owe Us” association had sought compensation of £3 billion ($4 billion, 3.5 billion euros) after accusing the group of secretly tracking iPhone users’ internet activity.\nA UK court had already dismissed the case in October 2018 but the judgement was overturned by the Court of Appeal, allowing the latest hearing to take place.\nJudge George Leggatt, delivering the Supreme Court ruling, declared the intention to seek damages without proving financial loss or mental distress, was “unsustainable”.\nIt claimed Google “illegally misused the data of millions of iPhone users” via the “clandestine tracking and collation” of information about internet usage on iPhones."
  },
  {
    "headline": "217 new research proposals to gulp N6.3bn- TETFund",
    "summarized_story": "By Joseph ErunkeABUJA– A total sum of N6,396,159,060.00 has been approved by the Tertiary Education Trust Fund, TETFund, for 217 research proposals.\nREAD ALSO:Reps extend teachers retirement ageHe disclosed this at the inauguration of the Fund’s National Research Fund Screening and Monitoring Committee,NRFS&MC, and Technical Advisory Group,TAG, in Abuja.\nHe said the TETFund National Research Fund intervention line was introduced in 2009 as a Special Intervention Programme, aimed at promoting the conduct of applied research and innovation by academics in public tertiary educational institutions and research institutes.\n” Categorize pre-qualified Research Proposals into streams and disciplines to aid the appointment Assessors/Reviewers;Recommend pre-qualified and categorized proposals; among others.\nThe inaugurated National Research Fund Screening and Monitoring Committee have two years life span."
  },
  {
    "headline": "Prof Soludo: Ten facts you need to know about Anambra Governor-elect",
    "summarized_story": "By Udo WisdomThe Independent National Electoral Commission (INEC) on Wedneday, declared Charles Chukwuma Soludo as winner of the just concluded Anambra gubernatorial election having polled a total of 112,229 votes.\nVanguard reports APGA, the ruling party in the state, scored the most votes in the Ihiala supplementary election that held on Tuesday.\nIn this article, Vanguard gathered ten (10) facts you should know about the Anambra Governor-elect;Charles Chukwuma Soludo, born on 28 July, 1960, few months before Nigeria’s independence, hails from Aguata Local Government Area of Anambra.\nSoludo studied Economics from the University of Nigeria, Nsukka where he graduated with a First Class Honours.\nProf Soludo has served as the Economic Adviser to President Obasanjo and the Chief Executive of the National Planning Commission (NPC)."
  },
  {
    "headline": "Buhari condoles with Pastor Odukoya over wife’s death",
    "summarized_story": "President Muhammadu Buhari has condoled with Pastor Taiwo Odukoya of the Fountain of Life Church, over the loss of his wife, Nomthi.\nThe president, in a condolence message by his Special Adviser on Media and Publicity, Mr Femi Adesina, on Wednesday in Abuja, also condoled with the Christendom in general over the unfortunate passage.\nPresident Buhari, who prayed God’s comfort and succour for Odukoya, described the passage as “sad and quite touching.”He urged Odukoya to bear the adversity with equanimity, being convinced that nothing could have happened without the knowledge and permission of Almighty God.\nThe president prayed for strength for the bereaved family, asking God to give them the fortitude to bear the loss."
  },
  {
    "headline": "Trouble looms in Delta OML 42",
    "summarized_story": "As host communities issue 14 days ultimatum to NPDC/NECONDEBy Akpokona Omafuaire – WarriTrouble looms in Delta OML 42 as Host Communities of OML 42 in Warri South and Warri South West Local Government Areas of Delta State have handed a 14 Days Ultimatum to the managements of NPDC/NECONDE AMT JV, operators of the OML over alleged unresolved contractual issues.\nThe OML 42 Host Communities Forum is demanding that within the 14 days period, NPDC/NECONDE AMT JV should address the issues of the Field Memorandum of Understanding (FMOU) with the OML 42 host communities, the issue of contracts award to OML 42 host communities, Payment of Scholarship arrears awarded to OML 42 host community students in post primary schools and tertiary institutions and other key issues.\n“Address the issue of contracts award to OML 42 host communities.\nPayment of Scholarship arrears awarded to OML 42 host community students in post primary schools and tertiary institutions.\nPayment of contractors high profile debts from 2017 to 2021“Payment of outstanding FTO’s, MOU’s, O&M and other financial entitlement due OML 42 host communities."
  },
  {
    "headline": "Soludo’s Victory: Sheathe your swords, ‘Ndi Anambra’ have spoken — Metuh warns contenders against litigations",
    "summarized_story": "“I heartily congratulate Prof. Chukwuma Soludo on his emergence as the governor-elect of our dear state, Anambra, after the keenly contested November 6, governorship election.\n“Ndi Anambra has spoken and their voices were heard loud and clear.\n“I implore contenders who are hurting over the outcome of the election to sheathe their swords and put aside all personal interests for the sake of Ndi Anambra.\nNdi Anambra looks up to him to unite the people and return Anambra state to her pride of place as the flagship of development in our country.\n“Once again, I congratulate you, Mr. Governor-elect and wish you a successful tenure in the service of the people of Anambra State,” the statement read."
  },
  {
    "headline": "Why US-bound Bob-Oseni was in collapsed Ikoyi building – Family",
    "summarized_story": "Mrs. Adeola Oseni, the widow of Wale Bob-Oseni, one of the victims of the Ikoyi building collapse, has refuted the claims that the US returnee was one of the contractors in the skyscraper.\nSadly, the building collapsed with both men and over 50 others inside, killing them and many others.\n“It is not true that Wale Bob Oseni was a director or contractor in the Fourscore Properties construction transaction.\n“The owner, Femi Osibona and Wale, were both alumni of Mayflower School, Ikenne where both of them bonded.\nFamilies are now claiming bodies of their relatives who were involved in the sad incident with the Lagos State Government carrying out a DNA test as a means of identification."
  },
  {
    "headline": "Man drags ex-Reps member, Reyenieju to IGP, claims life under threat",
    "summarized_story": "The complainant is accusing Reyenieju of an attempt to forcefully take over six acres of land belonging to the Ogbe family of Ugbuwangue town in Warri South local government area of Delta State.\nHe told journalists in Enugu that his life was no longer safe owing to the alleged plot of Reyenieju, a senior legislative aide in the National Assembly, to take over their family land.\nMr. Odunometa alleged that Rejenieju and four other mentioned suspects have been threatening his life which has made him become afraid of the safety of his life.\nReyenieju, when contacted, told DAILY POST that he was not aware of any petition in Enugu.\nWhy are they making the police useless?”On the alleged threat to life, he said: “I don’t know what they are talking about."
  },
  {
    "headline": "Anambra election: Going to court will be counterproductive – Metuh warns contenders",
    "summarized_story": "Metuh, in a statement he personally signed on Wednesday, described the election of Soludo as a reflection of the will of the people of Anambra State.\n“I heartily congratulate Prof. Chukwuma Soludo on his emergence as the governor-elect of Anambra state after the keenly contested November 6, governorship election.\n“Ndi Anambra has spoken and their voices were heard loud and clear.\nHe called on Ndi Anambra, irrespective of political affiliations, to avoid going to court and unite with Soludo to chart a new course for the state.\n“I implore contenders who are hurting over the outcome of the election to sheathe their swords and put aside all personal interests for the sake of Ndi Anambra."
  },
  {
    "headline": "Judge refused us entry before adjourning trial till January – Nnamdi Kanu’s lawyer, Ejimakor",
    "summarized_story": "Ejimakor accused Justice Nyako of locking Kanu’s lawyers out and refusing them entry into the courtroom.\nIn solidarity with those barred, Kanu’s lawyers were said to have vacated the courtroom to join their colleagues outside.\nHowever, Ejimakor countered the claim, stressing that the judge locked Kanu’s lawyers out of the courtroom, and arbitrarily adjourned the case till January 19, 2022.\nThe Judge LOCKED out Mazi Nnamdi Kanu’s lawyers and refused us entry into the courtroom.\nWe will surely take urgent and decisive measures.”Nnamdi Kanu: Lawyers’ disappearance forces court to adjourn trial"
  },
  {
    "headline": "Quack private guard companies will be flushed out – Osun NSCDC Commandant",
    "summarized_story": "The Osun State Command of the Nigerian Security and Civil Defence Corps (NSCDC) has warned that it will embark on flushing out of quack private security guards from the state as their activities are not only inimical to the state but to the country in general as it undermines national security and drains the economy of licensed private guard companies.\nThis was made known by Emmanuel Ocheja, the NSCDC Osun Commandant, during the training exercise organised for private guards companies operating in the state.\nOcheja noted that there was a need to bring the private guard companies up to speed as the state was preparing for the 2022 gubernatorial election and the recent security challenges in the country.\n“Private guards are often posted to sensitive areas therefore there is a need for them to be a step ahead of criminal elements.\nWhile buttressing the essence of beat management, patrol, physical security and security management, Ocheja called for synergy between private guards and other security agencies."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "“My victory reflects supreme will of God, people’s mandate” -Soludo",
    "summarized_story": "Prof. Chukwuma Soludo, the Governor-elect of Anambra State, says his victory reflects the supreme will of the Almighty God, as well as an overwhelming sacred mandate of the people.\nThe declaration of Soludo was, however, sequel to his victory after the successful conduct of the supplementary election in Ihiala local government on Tuesday.\n- Advertisement -Obi in the early hours of Wednesday declared Soludo of the All Progressives Grand Alliance (APGA) winner after polling a total of112,229 votes.\nHe defeated his closest rival, Mr Valentine Ozigbo of the Peoples Democratic Party (PDP), who scored 53,807, to emerge second.\nSoludo congratulated other candidates who contested in the election and urged them to support him."
  },
  {
    "headline": "Anambra Election: Buhari congratulates Soludo, lauds INEC, Security agencies",
    "summarized_story": "President Muhammadu Buhari has congratulated Prof. Charles Chukwuma Soludo, the candidate of the All Progressives Grand Alliance (APGA) for winning the gubernatorial election in Anambra.\nThe president in a statement by his media aide, Mr Femi Adesina, on Wednesday in Abuja also praised the security agencies for their determination to ensure that the election went on as smoothly as possible.\nHe equally commended the Independent National Electoral Commission (INEC) for the successful conclusion of the exercise despite the initial challenges encountered.\nRead Also: Ohanaeze congratulates Anambra Governor-elect SoludoPresident Buhari enjoined Soludo, member of the Presidential Economic Advisory Committee, to rally other stakeholders to tackle the enormous challenges confronting the State and the Southeast in general.\n- Advertisement -The president said he looked forward to working with the incoming governor for the peace, security and development of not only Anambra, but the entire country."
  },
  {
    "headline": "GAIN, IPAN tackle malnutrition, stunted growth in Nigeria",
    "summarized_story": "The Global Alliance for Improved Nutrition (GAIN) and the Institute of Public Analysts of Nigeria (IPAN) have created the GAIN-IPAN Certificate Course in Laboratory Analysis of Food Micronutrients (LAoFM) with the support from Bill and Melinda Gates Foundation (BMGF).\nThe course is aimed at tackling malnutrition and the associated stunted growth.\nGAIN is a Swiss-based foundation launched at the UN in 2002 to tackle the human suffering caused by malnutrition.\n- Advertisement -According to UNICEF: “Nigeria has the second-highest burden of stunted children in the world with a national prevalence rate of 32 per cent of children under five.\n“An estimated two million children in Nigeria suffer from severe acute malnutrition (SAM), but only two out of every 10 children affected is currently reached with treatment."
  },
  {
    "headline": "Senate indicts EFCC, AGF, police on invasion of Justice Odili’s home",
    "summarized_story": "From Fred Itua, AbujaThe Senate, yesterday, said a joint panel recovery unit of the Ministry of Justice, comprising the Economic and Financial Crimes Commission (EFCC), police and Ministry of Justice, was behind the invasion of the Abuja residence of Justice Mary Odili of the Supreme Court.\nAttorney General of the Federation (AGF), Abubakar Malami and the Economic and Financial Crimes Commission (EFCC) had denied involvement in the raid.\nThese formed part of resolutions reached by the Senate, following a point of order raised by Betty Apiafi during plenary.\nGeorge Sekibo recalled that the Port Harcourt residence of Justice Mary Odili was invaded a couple of months ago.\nThe minister of justice has denied and dissociated himself from that, the chairman of EFCC has also done that."
  },
  {
    "headline": "At last, NASS passes Electoral Act amendment Bill",
    "summarized_story": "From Fred Itua and Ndubuisi Orji, AbujaThe Senate and House of Representatives, yesterday, passed the harmonised version of the Electoral Act (Amendment) Bill, 2021 at separate sittings.\nSenate Leader, Yahaya Abdullahi, who chaired the Conference Committee in the Senate, presented the report on the harmonised version of the Electoral Act (Amendment) Bill, 2021.\nThe chamber on October 13, 2021, re-amended certain aspects of the Electoral Act (Amendment) Bill contained in Clauses 43, 52, 63 and 87, respectively.\nHe said the Electoral Act Amendment Bill would be ready for President Muhammadu Buhari’s assent in the next seven days.\nKalu said with the passage of the Electoral Act Amendment Bill, the National Assembly had passed the ball to the executive arm of government."
  },
  {
    "headline": "Buhari vows to end annual $2bn wheat importation",
    "summarized_story": "From Gyang Bere, JosPresident Muhammadu Buhari has vowed to end wheat importation which cost Nigeria $2 billion annually.\nSpeaking during the flag-off of the rainfed commercial wheat cultivation at the Wheat Seed Multiplication Farm in Kwall, Bassa Local Government Area of Plateau State, yesterday, he charged Nigerian farmers to embrace wheat farming.\nHe lamented that Nigeria still spends humongous amounts of money on wheat importation which is not acceptable because the country has the capacity to meet domestic consumption demands and also export.\nThis is because millers have had to resort to importation to meet the huge demand for wheat by-products.\nWheat cultivation, similar to rice, has the capacity to thrive in Nigeria due to the tropical climatic conditions."
  },
  {
    "headline": "Bandits kill 7 police officers, set patrol vehicle ablaze in Zamfara",
    "summarized_story": "Seven police personnel were killed by suspected bandits along the Tofa-Magami Road in the Gusau Local Government Area of Zamfara State.\nA spokesperson of Governor Bello Matawalle, confirmed the incident but did not provide details.\nHe said the governor had cancelled his schedules in mourning of the fallen police officers.\n“The governor is shocked over the bandits’ incursion which claimed the lives of the police officers.\n“The bandits ambushed the police personnel, killed seven of them, and set their operational vehicle ablaze."
  },
  {
    "headline": "2023: Imams, others lobby for Middle Belt presidency",
    "summarized_story": "From Fred Itua, AbujaReligious leaders, drawn from the Middle Belt states, including imams and bishops, have resolved to ignore religious and ethnic differences in their drive to produce a consensus candidate.\nThe Middle Belt is a mini Nigeria.\n“There is a North and South because there is a Middle between them.\nIt is now time for that middle to also feel a sense of belonging to the larger body,” the clergymen said.\nAdopting the position of their Christian counterparts, the imams said: “We noted with happiness the position of our brother Christian clergy which visited you last week."
  },
  {
    "headline": "CBN Unveils Strategy to Cut Wheat Importation by 60% in Two Years",
    "summarized_story": "He said the plan was to ultimately eliminate wheat importation or reduce it to an insignificant contributor to the country’s total food import bill, adding that the wheat programme would benefit over 150,000 farmers.\nHe said the country only produces about one per cent (63,000 metric tons) of the 5-6 million metric tons of the commodity consumed annually in Nigeria.\nHe said the enormous demand-supply gap was bridged with over $2 billion spent annually on wheat importation, making wheat the second highest contributor to the country’s food import bill.\nHe said the CBN’s strategy for the wheat value chain involvedensuring availability of high-yield seeds by financing seed multiplication and establishment of seed ripple centres.\nHe said the strategy was to also pursue strategic collaboration with key stakeholders in the wheat value chain for sustained local production."
  },
  {
    "headline": "After Ihiala, Soludo emerges Anambra Governor-elect",
    "summarized_story": "I thank the service chiefs, the people of Anambra State.\nIn Onitsha North LGA: APC, 3909; APGA, 5587; PDP, 3781 and YPP, 682 and in Aguata LGA: APC, 4773; APGA, 9136; PDP, 3798 and YPP, 1070.\nIn Orumba North LGA: PDP, 1847; APC, 2672; and APGA, 4787 and in Ihiala LGA: APC, 343; APGA, 8283; PDP, 2,485 and YPP, 344.\nThe police in Anambra State have denied knowledge of the killing of anybody during the supplementary election in Ihiala.\nObi said, “Reports received from Ihiala LGA indicate late deployment of materials and INEC staff from the LGA office."
  },
  {
    "headline": "Senate, in a Resolution, Condemns Invasion of Justice Odili’s Home",
    "summarized_story": "•Wants IG to make outcome of investigation publicEmameh Gabriel in AbujaThe upper chamber of the National Assembly yesterday condemned the invasion of the Abuja residence of Supreme Court Justice, Mary Peter-Odili, by security operatives.\n“Further worried that the home of such a highly revered judicial officer could be raised in such a manner by security agents.\nOn his part, Senator George Thompson Sekibo (PDP, Rivers East), recalled that the Port Harcourt residence of Justice Odili was invaded a couple of months ago.\n“The Minister of Justice has denied and dissociated himself from that, the Chairman of EFCC has also done that.\n“My problem is this, oftentimes, things happen and then police investigates and, in most cases, we don’t get the result of investigation."
  },
  {
    "headline": "Breaking: INEC Declares Soludo Winner of Anambra Governorship Election",
    "summarized_story": "By David-Chyddy Eleke in AwkaThe Independent National Electoral Commission (INEC) has declared the candidate of the All Progressives Grand Alliance (APGA), Prof. Chukwuma Soludo the winner of Saturday’s governorship election in Anambra State.\nThe returning officer for the election and Vice Chancellor of the University of Calabar, Prof. Florence Obi, announced the final result at about 1:50am on Wednesday.\nI thank the service chiefs, the people of Anambra State, we remain very grateful.\nI Prof Florence Banku Obi hereby certify that I’m the returning officer of the Anambra governorship election held on 6 and 9 of November.\n“That Charles Chukwuma Soludo of APGA, having certified the requirement of the law is hereby declared the winner of the election,” Prof. Obi said."
  },
  {
    "headline": "Breaking: Soludo Wins Ihiala LGA",
    "summarized_story": "By David-Chyddy Eleke in AwkaThe All Progressives Grand Alliance candidste, Prof Chukwuma Soludo, has won Tuesday’s supplementary governorship election in Ihiala Local Government Area or Anambra StateThe Independent National Electoral Commission, INEC had on Sunday after announcing 20 out of the 21 Local Government Areas of the state scheduled a supplementary election in Ihiala, after being unable to deploy materials to the area on Saturday.\nAnnouncing the result, Dr German Anagbogu of the University of Calabar, who worked as the returning officer for the local government stated that: “12,298 is the total number of accredited voters in the area.”He said, the All Progressives Congress, APC polled, 343 votes, APGA polled, 8,283, the Peoples Democratic Party, PDP polled 2,485, while the Young Progressives Party, YPP got 344 votes.\nThis brings to 19, the number of local government areas won by the APGA in the election.\nAnagbogu however reported that elections were not held in two communities because of resistance.\nHe said: “In the process of the election, we received report that there was resistance in Orsumoghu and Lilu, as INEC deployed to the communities, but could not enter.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Many Feared Killed As Bandits Launch House-To-House Raid In Buhari’s Home State",
    "summarized_story": "Many people are feared killed and properties burnt down in fresh attacks on communities in Batsari Local Government Area of Katsina State, Daily Trust reports.\nThere were speculations that one of the victims killed in the attack was lawyer, one Barr.\nThe source added that several of the victims were trying to escape from the onslaught of the marauding gunmen when they sustained injuries.\nWhen contacted, the Member representing Batsari in the Katsina State House of Assembly, Hon.\nOn December 11, 2020, some bandits kidnapped 344 students of Government Science Secondary School, Kankara, while Buhari was on a visit to the state."
  },
  {
    "headline": "BREAKING: Many Feared Killed As Bandits Launch House-To-House Raid In Buhari’s Home State",
    "summarized_story": "Many people are feared killed and properties burnt down in fresh attacks on communities in Batsari Local Government Area of Katsina State, Daily Trust reports.\nThere were speculations that one of the victims killed in the attack was lawyer, one Barr.\nThe source added that several of the victims were trying to escape from the onslaught of the marauding gunmen when they sustained injuries.\nWhen contacted, the Member representing Batsari in the Katsina State House of Assembly, Hon.\nOn December 11, 2020, some bandits kidnapped 344 students of Government Science Secondary School, Kankara, while Buhari was on a visit to the state."
  },
  {
    "headline": "BREAKING: Many Feared Killed As Bandits Launch House-To-House Raid In Buhari’s Home State",
    "summarized_story": "Many people are feared killed and properties burnt down in fresh attacks on communities in Batsari Local Government Area of Katsina State, Daily Trust reports.\nThere were speculations that one of the victims killed in the attack was lawyer, one Barr.\nThe source added that several of the victims were trying to escape from the onslaught of the marauding gunmen when they sustained injuries.\nWhen contacted, the Member representing Batsari in the Katsina State House of Assembly, Hon.\nOn December 11, 2020, some bandits kidnapped 344 students of Government Science Secondary School, Kankara, while Buhari was on a visit to the state."
  },
  {
    "headline": "Nigeria's Secret Police, DSS Mobilise Thugs To Attack Sowore During Kanu’s Trial On Wednesday",
    "summarized_story": "A source told SaharaReporters that a contingent of the DSS arrived and took over the court premises on Tuesday.\nThe source also revealed that the DSS operatives instructed the thugs to inflict harm should there be any resistance.\nIt took the intervention of journalists to stop the assault on Sowore at the time.\n\"They told them to inflict harm if there is any resistance and promised them that nobody will intervene,\" the source told SaharaReporters on Tuesday.\nRecall that the DSS had made similar arrangements during the last trial held in October, allowing three vehicles packed with thugs to arrive on the court premises to attack Sowore."
  },
  {
    "headline": "Nigeria's Secret Police, DSS Mobilise Thugs To Attack Sowore During Kanu’s Trial On Wednesday",
    "summarized_story": "A source told SaharaReporters that a contingent of the DSS arrived and took over the court premises on Tuesday.\nThe source also revealed that the DSS operatives instructed the thugs to inflict harm should there be any resistance.\nIt took the intervention of journalists to stop the assault on Sowore at the time.\n\"They told them to inflict harm if there is any resistance and promised them that nobody will intervene,\" the source told SaharaReporters on Tuesday.\nRecall that the DSS had made similar arrangements during the last trial held in October, allowing three vehicles packed with thugs to arrive on the court premises to attack Sowore."
  },
  {
    "headline": "BREAKING: Senate approves $16bn, €1bn loans requested by Buhari",
    "summarized_story": "The senate has approved $16,230,077,718 and €1,020,000,000 loans requested by President Muhammadu Buhari.\nAdvertisementThe upper legislative chamber also approved grant components of $125 million.\nThe president had made the request for the facilities in an addendum to the 2018-2020 borrowing plan in September.\nMore to follow…"
  },
  {
    "headline": "BREAKING: Senate approves $16bn, €1bn loans requested by Buhari",
    "summarized_story": "The senate has approved $16,230,077,718 and €1,020,000,000 loans requested by President Muhammadu Buhari.\nAdvertisementThe upper legislative chamber also approved grant components of $125 million.\nThe president had made the request for the facilities in an addendum to the 2018-2020 borrowing plan in September.\nMore to follow…"
  },
  {
    "headline": "APGA chairman: Peter Obi cannot achieve anything politically unless he returns to our party",
    "summarized_story": "Victor Oye, national chairman of the All Progressives Grand Alliance (APGA), says Peter Obi “cannot achieve anything” unless he returns to the party.\nAdvertisementObi ran on the APGA platform to become the governor of Anambra state in 2006 and spent two terms in office.\nThe APGA chairman then said if Obi “wants to achieve anything politically, he should come back to APGA”.\nNo government since Peter Obi till now have failed in that responsibility.\nRemember that Peter Obi was in APGA, and he performed superlatively when he was in APGA, but the moment he left, the APGA spirit left him, and he never achieved anything ever since,” Oye said."
  },
  {
    "headline": "APGA chairman: Peter Obi cannot achieve anything politically unless he returns to our party",
    "summarized_story": "Victor Oye, national chairman of the All Progressives Grand Alliance (APGA), says Peter Obi “cannot achieve anything” unless he returns to the party.\nAdvertisementObi ran on the APGA platform to become the governor of Anambra state in 2006 and spent two terms in office.\nThe APGA chairman then said if Obi “wants to achieve anything politically, he should come back to APGA”.\nNo government since Peter Obi till now have failed in that responsibility.\nRemember that Peter Obi was in APGA, and he performed superlatively when he was in APGA, but the moment he left, the APGA spirit left him, and he never achieved anything ever since,” Oye said."
  },
  {
    "headline": "'Three killed, many injured' as gunmen invade Imo market",
    "summarized_story": "Three persons were killed by gunmen who attacked Anara market in Isiala Mbano LGA of Imo state on Tuesday.\nWitnesses in the area told TheCable that the gunmen invaded the market in a white Sienna vehicle and opened fire on the people.\nAdvertisement“The gunmen were in a white Sienna vehicle.\nAdvertisementThe south-east has been under attack by gunmen, a situation that has heightened the insecurity in the region.\nMany lives have been lost to these attacks while properties, owned by the government and private individuals, have also been destroyed by the assailants."
  },
  {
    "headline": "How to secure funding for your early-stage startup in Africa",
    "summarized_story": "Ayobami and Ayobamigbe work with Ingressive Capital, a venture capital firm that writes up to $400K cheques to early-stage startups.\nDisrupt Africa reported a 68.4% jump in the number of investors in 2020 (370 investors) from 2019’s reported number of 261 investors.\nStartup accelerators like Y Combinator and TechStars have become incredible partners to the growth of the African startup ecosystem.\nwith FirstCheck Africa, Let’s Talk with Microtraction), Invest in the Future with Future Africa), and How I Got Funded (Ingressive Capital).\nYour investment pitch deck should address the pivotal questions of the problem, why the problem matters, your solution, and the market opportunity (total addressable market)."
  },
  {
    "headline": "Nestcoin wants to create wealth with crypto beyond trading",
    "summarized_story": "The brainchild of Taiwo Orilogbon and Yele Bademosi, Nestcoin is a parent company that wants to create crypto-native products beyond trading and investments, with a focus on driving the adoption of crypto in Africa.\nIt wants to do this through its media publication, Breach, and other products that use crypto technology—spanning across DeFi, media, digital art and gaming.\nBefore Nestcoin, Bademosi was a former director at Binance’s venture capital programme.\nIncentivising the crypto communityNestcoin wants to create a community of users that understands crypto, as a way to make their lives easier.\nNestcoin will then harness the power of this community to create new products and embark on projects that can generate revenue."
  },
  {
    "headline": "MTN Group to sell $245m-worth shares of Nigerian subsidiary",
    "summarized_story": "South Africa-based MTN Group has announced plans to sell 575 million shares of its most profitable subsidiary MTN Nigeria, which went public in Lagos in 2019.\nThe offer is expected to close in December 2021.”The transaction will see MTN Group rake in proceeds of about ₦101 billion ($245 million), based on MTN Nigeria’s (MTNN) current share price of ₦175.60.\nA Bit of HistoryThe planned sell-off is part of a broader intention, announced by MTN Group earlier, to sell down 14% of its current shareholding in the Nigerian unit.\nLast year, the Johannesburg-based group was unable to repatriate its $280 million dividend from its Nigerian subsidiary due to the challenges of securing foreign currency, amid the country’s forex liquidity crisis.\nDespite the domestic challenges, MTN Nigeria has shown resilience."
  },
  {
    "headline": "Lemonade Finance raises money to ease diaspora remittances",
    "summarized_story": "That’s why Lemonade Finance, a Nigerian startup that wants to ease the payment process for Africans in North America and Europe, was founded.\nLemonade Finance faces regulatory and compliance problems.\nBut Lemonade Finance is dedicated to letting global banks know that lowering financial barriers into Africa is a beneficial and strategic move.\nThey have been able to get some of their partner banks to green-light Nigeria, Kenya, Cameroon and some other West African countries.\nCurrently, Lemonade Finance is only live in Canada, where it has gained thousands of customers already."
  },
  {
    "headline": "What you need to know about the world’s four oldest universities",
    "summarized_story": "But even though knowledge originated from the Greeks or Europeans, Africa standardized it by being the first pioneer in the establishment of first world’s universities.\nFrom a research report by Erudera, the world’s first education research platform, Tunisia, Morocco, Egypt and Mali are the top four countries with the oldest universities in the world that are still in operation today.\nOn this note, BusinessDay will be profiling each of these universities in the particular order they were established.\nAliko Dangote, a Nigerian business mogul and Africa’s richest man studied Business at Al-Azhar University.\nThe curriculum consisted not just of Islamic subjects, but science, mathematics, philosophy, astronomy and even the occult science and medicine."
  },
  {
    "headline": "Woodsmoke clouds Nigeria’s carbon reduction plans after return to firewood",
    "summarized_story": "High prices for smokeless liquid petroleum gas (LPG) have forced Adunni and many like her to add wood and charcoal to their cookstands.\nread moreNigeria’s LPG use faltered in 2020 after nearly 10 years of growth, according to World LPG Association data.\nHousehold demand began faltering in 2020, according to the World LPG Association, and while data for 2021 is not yet available, the Nigeria LPG Association (NLPGA) said the country is at risk of reversing the LPG use gains it has made.\nNLPGA deputy president Felix Ekundayo said a global power crunch that boosted U.S., European and Middle Eastern LPG prices to a near seven-year high was a major factor behind Nigeria’s rising prices.\nThis has resulted in excess demand for domestic supplies, the Nigerian Association of Liquefied Petroleum Gas Marketers, said Monday."
  },
  {
    "headline": "MTN Nigeria, Airtel PSBs to create 1m direct jobs",
    "summarized_story": "Following the granting of approval in principle (AIP) by the Central Bank of Nigeria (CBN), MTN Nigeria and Airtel now have about six months to become licenced Payment Service Banks (PSBs).\nApart from helping to include 40 million adult Nigerians outside the financial services industry, the move could create over 1 million direct jobs in 2022.\nMTN Nigeria and Airtel combined boast 124.6 million voice subscribers and 96.1 data subscribers.\nThis is the same strategy it deployed in nearly all the 14 African countries where it currently operates mobile money services.\nMTN Nigeria and Airtel could also be the push Globacom needs to launch its mobile money operations after one year of securing the licence."
  },
  {
    "headline": "Impeachment: Senate urges Plateau House of Assembly to abide by Rule of Law – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Senate has called on the Plateau House of Assembly to be guided by the Rule of Law and the Constitution in all legislative business.\nThe Senate said it was necessary particularly where and when it affects appointment and impeachment of a Presiding officer.\n“Majority of the members are opposed to the alleged impeachment and have pledged loyalty and solidarity with the speaker against those loyal to Sanda.\n“The Conference of Speakers of the 36 States have denounced the alleged impeachment and withheld recognition for Sanda.”The lawmaker said that an impasse and stalemate had arisen which if left unattended to, may degenerate.\nIf they were not, certainly that is something that the Senate, particularly, and the National Assembly in general, will not tolerate.”..."
  },
  {
    "headline": "Edo begins issuance of building plans, conveyance letters processed in 10 days – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government, on Tuesday, flagged off the distribution of building plans and conveyance letters to applicants whose applications were processed within the last 10 days.\nCommissioner for Physical Planning and Urban Development, Isoken Omo said the development is part of Governor Godwin Obaseki-led government’s efforts at embracing e-governance.\nAccording to him, “This new trend of doing things is to introduce us to electronics records; the new plan shows what the master plan is.\nFor us to approve your plan, it means that the land used and the structure is within the master plan.\n“The approved Conveyance Letter stipulates what you should do and not do and consequences against it."
  },
  {
    "headline": "Obaseki receives Okogie in Benin as cardinal blames nation’s woes on poor leadership choices – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Governor, Mr. Godwin Obaseki, on Tuesday, received in audience, the Emeritus Archbishop of the Catholic Archdiocese of Lagos, Cardinal Olubunmi Okogie, who is in Benin for the 90th birthday celebration of Archbishop Patrick Ekpu, the Emeritus Archbishop of Benin.\nReceiving the clergy at the Government House in Benin City, the governor celebrated Cardinal Okogie, describing him as an icon and a father.\nThe governor said, “The Cardinal came to pay me a courtesy visit; you know he is our father.\nHe is here in Benin to celebrate another icon, Archbishop Patrick Ekpu, the Emeritus Archbishop of Benin who will be 90 years tomorrow.\nWe vote for them because of the three or four pence they will give us,” Okogie added."
  },
  {
    "headline": "Female Genital Mutilation still rampant in Nigeria …UNFPA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAlthough certain authorities recently put the practice of Female genital mutilation, FGM, in Nigeria as down to 20%According to the 2018 NDHS, an overall 20 per cent of women aged 15-49 are still required to be circumcised before their marriages.\nThe Nigeria Demographic and Health Survey (NDHS) in 2013 had also reported that the prevalence of FGM was above 20 per cent for women aged 15-49.\nGiving the latest update after a walk against FGM in Abuja, the UNFPA resident representative in Nigeria, Ulla Müller, said the NDHS 2018 survey indicates a downward slope that is doubtful.\nThe official said; “In Nigeria, according to the 2018 NDHS, an overall 20 per cent of women aged 15-49 have been circumcised, down 5 per cent from the 2013 NDHS.\nThe convener of the event and President of WAVE Foundation, Lola Ibrahim, indicated measures that could help to eradicate the harmful practice in Nigeria."
  },
  {
    "headline": "ANALYSIS: From Academia and Central Banking to Governor, Chukwuma Soludo’s story in resilience",
    "summarized_story": "“I became everything in my 30s…I became a professor in my 30s,” Mr Soludo boasted during the Anambra governorship debate.\nIn May 2004, Mr Obasanjo appointed Mr Soludo to the CBN as the governor, which Mr Uba would claim he made possible.\nMr Uba was at the time of Mr Soludo’s CBN appointment a close aide to Mr Obasanjo.\nThough then a political greenhorn, coming from the academia and central banking to operate in a tumultuous political terrain, Mr Soludo clinched the PDP ticket.\nMr Soludo’s story is an example of resilience, passion and persistence."
  },
  {
    "headline": "Buhari congratulates Anambra governor-elect Soludo, seeks his support to tackle challenges ahead",
    "summarized_story": "OBINNA EZUGWUNigeria’s president, Muhammadu Buhari, has congratulated Prof. Charles Chukwuma Soludo on his victory in the recently concluded Anambra governorship election.\nProf. Soludo, candidate of the All Progressives Grand Alliance (APGA), was in the early hours of Wednesday, announced winner of the Anambra gubernatorial poll held on Saturday, after the conclusion of supplementary election is Ihiala local government on Tuesday.\nPresident Buhari in the congratulatory message signed by his media aide, Mr Femi Adesina, praised the security agencies for their determination to ensure that the election went on as smoothly as possible, and the Independent National Electoral Commission (INEC) for the successful conclusion of the exercise despite the initial challenges encountered.\nHe enjoined Prof. Soludo, member of the Presidential Economic Advisory Committee, to rally other stakeholders to tackle the enormous challenges confronting the State and the Southeast in general.\nThe President said he looks forward to working with the incoming governor for the peace, security and development of not only Anambra State, but the entire country."
  },
  {
    "headline": "Gunmen invade Imo market, kill three, injure many others",
    "summarized_story": "Gunmen on Tuesday, attacked Anara Market in Isiala Mbano LGA of Imo state, killing three people, while many others were injured.\nThe gunmen, according to witnesses, invaded the market in a white Sienna vehicle around 10 and opened fire.\n“They just opened fire on people as they came.\nThey killed three people,” a witness said.\n“We don’t know why they attacked the market."
  },
  {
    "headline": "Court adjourns Nnamdi Kanu’s trial till Jan 19",
    "summarized_story": "Federal High Court in Abuja on Wednesday adjourned the trial of Mazi Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), till January 19.\nThe trial judge, Justice Binta Nyako, announcement the adjournment during Kanu’s court appearance on Wednesday.\nHe told Justice Nyako that Fein, who was handling a case for him in the US, was around to witness his trial.\nMeanwhile, counsel to the Federal Government and Director of Public Prosecution, M. D. Abubakar, urged the court to proceed with the trial in the absence of Kanu’s lawyers.\nDelivering a short ruling, Justice Nyako expressed displeasure over the conduct of Kanu’s lawyers, but declined to dismiss the pending application and rather adjourned the case till January 19 and 20, 2022, for trial."
  },
  {
    "headline": "For the Record: A Divine Journey Whose Time Has Come – Charles Soludo’s acceptance speech",
    "summarized_story": "The acceptance of speech of Prof Chukwuma Charles Soludo, CFR, following victory in the Anambra State governorship election concluded on Tuesday, October 9, 2021.\nWith utmost humility and gratitude to God, I accept the results of the 2021 Anambra Governorship election as declared by INEC.\nFor 12 years since the massive clamour by the people of Anambra for us to serve them, we persevered to this Divine moment.\nThe run up to this election and the election itself tested the resilience and integrity of our federal institutions.\nLong live Anambra State!"
  },
  {
    "headline": "Senate Moves To Establish Metallurgical Training Institute In Anambra",
    "summarized_story": "The Senate, on Tuesday, considered a Bill seeking to establish the National Metallurgical Training Institute in Onitsha, Anambra State.\nThe National Metallurgical Training Institute (Establishment) Bill, 2021, which scaled second reading is sponsored by the Senate Leader, Yahaya Abdullahi (APC, Kebbi North).\n“In 40 years of the existence, the Institute has trained many Nigerians from six geopolitical zones in the country.\nADVERTISEMENT“The Institute was involved in the training of ex-militant of the Niger Delta amnesty Programme.\nContributing to the debate, Senator Uche Lilian Ekwunife, drew the attention of the Senate that the Institute ought to be sited in Obosi, and not Onitsha."
  },
  {
    "headline": "Senate Moves To Establish Metallurgical Training Institute In Anambra",
    "summarized_story": "The Senate, on Tuesday, considered a Bill seeking to establish the National Metallurgical Training Institute in Onitsha, Anambra State.\nThe National Metallurgical Training Institute (Establishment) Bill, 2021, which scaled second reading is sponsored by the Senate Leader, Yahaya Abdullahi (APC, Kebbi North).\n“In 40 years of the existence, the Institute has trained many Nigerians from six geopolitical zones in the country.\nADVERTISEMENT“The Institute was involved in the training of ex-militant of the Niger Delta amnesty Programme.\nContributing to the debate, Senator Uche Lilian Ekwunife, drew the attention of the Senate that the Institute ought to be sited in Obosi, and not Onitsha."
  },
  {
    "headline": "President Buhari Congratulates Anambra Gov-elect, Soludo",
    "summarized_story": "President Muhammadu Buhari has congratulated Prof. Charles Chukwuma Soludo, the candidate of the All Progressives Grand Alliance (APGA) as he emerges winner in the gubernatorial election in Anambra State.\nThe President in a statement by his media aide, Femi Adesina, praised the security agencies for their determination to ensure that the election went on as smoothly as possible, and the Independent National Electoral Commission (INEC) for the successful conclusion of the exercise despite the initial challenges encountered.\nPresident Buhari enjoined Prof. Soludo, who is a member of the Presidential Economic Advisory Committee, to rally other stakeholders to tackle the enormous challenges confronting the State and the South-East in general.\nThe statement added that the President looked forward to working with the incoming governor for the peace, security and development of not only Anambra State, but the entire country."
  },
  {
    "headline": "President Buhari Congratulates Anambra Gov-elect, Soludo",
    "summarized_story": "President Muhammadu Buhari has congratulated Prof. Charles Chukwuma Soludo, the candidate of the All Progressives Grand Alliance (APGA) as he emerges winner in the gubernatorial election in Anambra State.\nThe President in a statement by his media aide, Femi Adesina, praised the security agencies for their determination to ensure that the election went on as smoothly as possible, and the Independent National Electoral Commission (INEC) for the successful conclusion of the exercise despite the initial challenges encountered.\nPresident Buhari enjoined Prof. Soludo, who is a member of the Presidential Economic Advisory Committee, to rally other stakeholders to tackle the enormous challenges confronting the State and the South-East in general.\nThe statement added that the President looked forward to working with the incoming governor for the peace, security and development of not only Anambra State, but the entire country."
  },
  {
    "headline": "Buhari Condoles With Pastor Taiwo Odukoya On Wife’s Death",
    "summarized_story": "President Muhammadu Buhari has raised God’s comfort and succour for Pastor Taiwo Odukoya of the Fountain of Life Church, over the loss of his wife, Nomthi.\nThe President in a statement by his media aide, Garba Shehu, on Wednesday, condoled with the cleric, his church, and Christendom in general over the unfortunate passage, describing it as “sad and quite touching.”He urged Pastor Odukoya to bear the adversity with equanimity, being convinced that nothing could have happened without the knowledge and permission of Almighty God.\nThe President prayed strength for all who mourn the departed, asking God to give them fortitude to bear the loss."
  },
  {
    "headline": "Senate to IGP: Make report of Odili’s residence raid probe public",
    "summarized_story": "The Senate on Tuesday mandated the Inspector General of Police, Mr Baba Alkali, to make public the report of the investigations into the invasion of the residence of a justice of the Supreme Court, Justice Mary Odili.\nThe Senate resolution followed a point of order by Senator Betty Apiafi, (PDP, Rivers West) at the resumption of plenary.\nShe explained that Justice Mary Odili “is the second most senior judicial officer in Nigeria.\nI pray that this investigation comes to limelight.”The Senate in its resolutions condemned the invasion of the home of the second and most senior judicial officer in Nigeria, Justice Odili.\nThe chamber urged the Inspector General of Police to make public the outcome of investigations.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Senate to IGP: Make report of Odili’s residence raid probe public",
    "summarized_story": "The Senate on Tuesday mandated the Inspector General of Police, Mr Baba Alkali, to make public the report of the investigations into the invasion of the residence of a justice of the Supreme Court, Justice Mary Odili.\nThe Senate resolution followed a point of order by Senator Betty Apiafi, (PDP, Rivers West) at the resumption of plenary.\nShe explained that Justice Mary Odili “is the second most senior judicial officer in Nigeria.\nI pray that this investigation comes to limelight.”The Senate in its resolutions condemned the invasion of the home of the second and most senior judicial officer in Nigeria, Justice Odili.\nThe chamber urged the Inspector General of Police to make public the outcome of investigations.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Tears as pastor Odukoya’s wife, dies of cancer",
    "summarized_story": "The wife of Pastor Taiwo Odukoya of the Fountain of Life Church, Nomthi, is dead.\nAccording to the statement released by the church, Nomthi died after battling cancer for two years.\nThe statement read, “With deep regret and gratitude to God, we have to announce the passing of our Senior Pastor’s wife, Pastor Nomthi Odukoya.\n“She battled cancer for the better part of two years, she stood on the word of God, and she fought.\nSo for now, till we meet again in glory, goodbye Pastor Nomthi.”The PUNCH reports that Odukoya got married to Nomthi in 2010 after the death of his first wife, Bimbo, in the Sosoliso plane crash in 2005."
  },
  {
    "headline": "Tears as pastor Odukoya’s wife, dies of cancer",
    "summarized_story": "The wife of Pastor Taiwo Odukoya of the Fountain of Life Church, Nomthi, is dead.\nAccording to the statement released by the church, Nomthi died after battling cancer for two years.\nThe statement read, “With deep regret and gratitude to God, we have to announce the passing of our Senior Pastor’s wife, Pastor Nomthi Odukoya.\n“She battled cancer for the better part of two years, she stood on the word of God, and she fought.\nSo for now, till we meet again in glory, goodbye Pastor Nomthi.”The PUNCH reports that Odukoya got married to Nomthi in 2010 after the death of his first wife, Bimbo, in the Sosoliso plane crash in 2005."
  },
  {
    "headline": "Nnamdi Kanu’s lawyers stage walkout at trial, case adjourned again",
    "summarized_story": "By Taiye AgbajeLawyers representing embattled leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu staged a walkout before the court began the trial on Wednesday.\nCounsel to the Federal Government, Mohammed Abubakar told the Abuja High Court, that the lawyers representing Kanu, staged the walkout before the trial opened.\nWhen Nnamdi Kanu’s trial was called, Abubakar announced appearance for the AGF.\nAbubakar then told the court that Kanu’s counsel, led by Ifeanyi Ejiofor, staged a walkout because some of the lawyers, including the American lawyer, Bruce Fein, were denied access.\nAlso speaking, Kanu told the court that in the previous sitting, his foreign lawyer, Fein, was also denied access."
  },
  {
    "headline": "Danish Queen Margrethe begins four-day visit to Germany",
    "summarized_story": "Denmark’s Queen Margrethe II and her son, Crown Prince Frederik, have begun a four-day state visit to Germany.\nThey will meet German President Frank-Walter Steinmeier and his wife at Bellevue Palace on Wednesday after their arrival.\nThe queen will then visit the Charite hospital in Berlin and will also meet Chancellor Angela Merkel for a late breakfast.\nThe Danish queen, who is 81, and her 53-year-old son will take part in a wreath-laying ceremony at Berlin’s memorial to the victims of war and tyranny.\nQueen Margrethe will then travel alone to Munich."
  },
  {
    "headline": "BBNaija's Angel clinches new ambassadorial deal",
    "summarized_story": "Former housemate in BBNaija’s Shine Ya Eye edition, Angel Smith, popularly known as Angel has bagged a new ambassadorial deal.\nThe writer cum reality star on Tuesday made the announcement on social media.\nAngel took to her Instagram page to announce that she is the newest ambassador of Jenny’s Glow Nigeria, an organic skincare brand.\nThey sell the absolute best organic skincare products for all skin types.\nMy arch Angels, I want you all to follow their IG page @jennysglownigeria and flood their website www.jennysglowng.com with our orders in 3,2,1!!"
  },
  {
    "headline": "Tight Security At Federal High Court as IPOB leader, Nnamdi Kanu Returns To Court.",
    "summarized_story": "The leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu, is brought before the Federal High Court in Abuja today to face his trial.\nNEWS DIRECT recalls that on October 21, when the secessionist was brought to the court to begin his trial, a similar security presence was there.\nThe move for heavy security personnel at the court premises and its surroundings on Wednesday was to forestall security breaches during the hearing.\nThe entrances leading to the court premises were barricaded by combined armed officers of the Department of State Services (DSS) operatives, the Army, Nigeria Security and Civil Defence and the Nigeria Police.\nAlthough five media houses would be given access into the court room out of the list presented to the DSS operatives, a number of media practitioners would be asked to stay at the media Centre at the court basement."
  },
  {
    "headline": "Ikoyi Building Collapse: Lagos State Conducts DNA Tests For Identification Of Bodies.",
    "summarized_story": "The Lagos State Government reported on Tuesday that 29 families had provided DNA samples to help identify victims rescued from a collapsed 21-story building in the Ikoyi neighborhood of the state.\nThe State Commissioner for Information and Strategy, Mr Gbenga Omotoso, stated in a statement on Monday that body identification was continuing at the IDH, Yaba, Lagos Mainland.\n”Twenty-nine families have come forward to submit samples for DNA to identify bodies that they wish to claim.\n”In cases where identification is clear and there are no arguments, the bodies will be released to the families as from this week.\nThe 15 injured persons who were rescued are receiving treatment at the Police Hospital in Falomo."
  },
  {
    "headline": "Anambbra Governorship Winner, Soludo Dedicates Victory To Three Police Officers Killed By Unknown Gunmen.",
    "summarized_story": "Professor Charles Chukwuma Soludo, the newly elected governor of Anambra State, has dedicated his victory in the state’s gubernatorial election to three police officers who were killed during a town hall meeting in his hometown.\nAccording to NEWS DIRECT, the former governor of the Central Bank of Nigeria, CBN, was assassinated by unknown gunmen during a town hall meeting in his birthplace of Isuofia in the state’s Aguata Local Government Area in April 2021, killing three police officers.\nSpeaking on Wednesday morning after he was declared winner of the governorship poll, Soludo of the All Progressives Grand Alliance, APGA said his victory calls for the remembrance of the slain officers.\nHe said, “At this moment we must remember and must continue to remember all those who died during the course of this moment, especially the three policemen who were killed by unknown gunmen during our town hall meeting with youths in my ward.\nMany times there were tensions, especially as one party boasted that it must take or ‘conquer’ but the judiciary stood for the integrity of the judiciary”."
  },
  {
    "headline": "Federal Government Give Updates On Third Mainland Bridge",
    "summarized_story": "THE Federal Government on Tuesday debunked a social media rumor that the Lagos State’s Third Mainland Bridge had ‘opened up.’On Monday, a message on WhatsApp advised cars to avoid the Third Mainland Bridge in order to avert a “big calamity.”Reacting to the rumour, spokesperson of the Federal Ministry of Works, in a statement, Boade Akinola said the Federal Controller of Works in Lagos, Olukayode Popoola, drove on the bridge without noticing “any shaking” as claimed in the social media messages.\nAkinola said: “The Federal Controller of Works in Lagos, Mr. Olukayode Popoola, has debunked insinuations making the rounds in the social media that the Third Mainland Bridge in Lagos has opened up and shaking and, therefore, unsafe to traffic saying the claim was both false and unfounded,” the statement reads.\n“Giving an on-the-spot report on the Bridge, the controller, who said he just drove along the Bridge without noticing any opening or experiencing any shaking as contained in the social media report, advised members of the public not to take report seriously.\n“He especially advised commuters to ignore the insinuations as to the Bridge, which is receiving regular attention along others across the country.”This is not the first time social media will be inundated by rumour on the safety of the Third Mainland Bridge.\nIn 2019, the Federal Government debunked a similar rumour about the bridge."
  },
  {
    "headline": "Breaking: Again, Court adjourns Nnamdi Kanu’s trial (PICTURES)",
    "summarized_story": "The federal high court has again adjourned the case involving Nnamdi Kanu and the federal government to January 19, 2022.\nKanu had filed an application against the federal government regarding the treasonable felony charges preferred against him.\nHowever, the operatives of the Department of State Services (DSS) barred Journalists, lawyers and other notable Nigerians from gaining access to the courtroom.\nDetails loading…RelatedNo tags for this post.No tags for this post."
  },
  {
    "headline": "[Breaking] Nnamdi Kanu: We have been instructed to bar Journalists from Court – DSS",
    "summarized_story": "Journalists who arrived the federal high court on Wednesday November 10, 2021, date of an adjourned hearing on the trial of the leader of Indigenous People of Biafra (IPOB) Nnamdi Kanu, have been shut out by Department of State Services (DSS).\nOne of the DSS operatives told Journalists, “We are working on instruction.\nWe can’t let you people in.”Some lawyers, former governor of Anambra, Chukwuemeka Ezeife and Igbo monarch that arrived the court around 7am, were also turned back.\nThe embattled IPOB leader had file an application challenging the federal government over the treasonable felony charges against him.\nKanu, who was re-arraigned before Justice Binta Nyako of the Abuja Division of the Federal High Court, is facing a seven-count amended treasonable felony charge the Federal Government preferred against him."
  },
  {
    "headline": "Happening now: Again, ex-governor storms Court for Nnamdi Kanu",
    "summarized_story": "For the third time, former governor of Anambra state governor, Chukwuemeka Ezeife, is at the Federal High Court in Abuja in respect of the case of the leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu.\nThe Federal High Court, Abuja, had last month scheduled November 10, 2021, to hear an application filed by Kanu challenging the competence of the treasonable felony charges filed against him by the Federal Government.\nHe also asked the judge, Binta Nyako, to dismiss the newly-amended charges of seven counts.\nKanu was charged with terrorism, treason and perpetuation of falsehoods against President Muhammadu Buhari, mainly through broadcasts on the controversial Radio Biafra outlet and also through social media.\nTthe President General of Ohanaeze Ndigbo Worldwide, Professor George Obiozor, had appointed Ezeife to lead the Ohanaeze delegation to the trial of Kanu."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "Nigeria has more work to do to End Tuberculosis, Aisah Buhari -NigPilot",
    "summarized_story": "On Tuesday, first lady Aisha, wife of President Muhammadu Buhari hinted that Nigeria has a lot more to do in her efforts to end Tuberculosis (TB) in Nigeria.\n” Since I was appointed Global TB Champion and Ambassador, I have used my position to push TB issues among stakeholders at the National, Regional and Global levels.\nKey among the interventions was a strategic engagement of the private sector, the introduction of targeted, data-driven community TB case finding activities, integration of TB case finding in COVID-19 outreaches, active TB, and integrated TB/COVID-19 case finding activities in health facilities among others.\nSome of these helpful practices in TB case finding will be shared during this conference, so I urge participants to attend all the sessions.\n“We know that we still have a way to go to reach the targets for ending the TB epidemic and that most of our TB cases are yet undetected."
  },
  {
    "headline": "UNICEF donates items to 6 Benue IDPs camps for adequate sanitation, cleanliness, hygiene -NigPilot",
    "summarized_story": "United Nations Children’s Fund, UNICEF, Tuesday, donated selected items and materials to six Internally Displaced Persons, IDPs, camps in Benue state to ensure proper sanitation, cleanliness, and hygiene.\nThe items donated to the camps were detergents, disinfectants, scrubbing brushes, hand gloves, and brooms.\n“The fact is that if you maintain cleanliness in the camps other groups might be moved to also render further assistance to your camps.\nAnd we will always visit the camps to ensure that things are properly done,” he added.\n“We must thank UNICEF because they are taking practical steps to ensure healthy living in Benue IDPs camps; we ask for more and urge others to emulate what they are doing in Benue state,” he said."
  },
  {
    "headline": "Akpanudoedehe’s Contribution To Party’s Stability, Growth Immeasurable – APC Directors -NigPilot",
    "summarized_story": "National Directors of the governing All Progressives Congress (APC) have commended the contributions of the Party’s National Secretary, Caretaker/Extraordinary Convention Planning Committee (CECPC), Sen. John James Akpanudoedehe to the stability, growth, and development of the party.\nThis was contained in a 58th birthday congratulatory statement in honour of Akpanudoedehe jointly signed by departmental directors of the APC National Secretariat, viz: Director of Administration – Alh.\nAbubakar Suleiman; Director of Publicity – Salisu Na’inna Dambatta; Director of Organisation – Prof. Ussiju Medaner; Director of Welfare – Dr. Anietie Ofong; Director of Finance – Abubakar Suleiman and Director of Research, Planning and Strategy – Barr.\n“On behalf of the APC National Secretariat staff we wish the Secretary of the CECPC, Distinguished Senator (Pastor) John James Akpanudoedehe, Ph.D, a resounding birthday anniversary, today November 9 2021.\n“We celebrate the National Secretary of our party for his immense contributions towards the implementation of the CECPC mandate by the Party’s National Executive Committee (NEC) to achieve peace and stability in the governing party."
  },
  {
    "headline": "Heirs Life CEO Joins Ogun State Governor, NAICOM, others to advocate for a digitised insurance industry -NigPilot",
    "summarized_story": "Onifade, during his panel discussion, corroborated Abiodun and Thomas, and analyzed the differences between digital, digitalization, and digital transformation, and charged the industry to embrace digitalization because of the sensitive role it plays.\nAccording to Onifade, the insurance industry serves as an insulator to every other industry and as such, must work at the pace that others are, if not ahead.\nIn his words, “The insurance industry plays a significant role in the economic development of Nigeria, providing support and back up for people and businesses.\nOnifade’s Heirs Life has continued to be at the vanguard of digital insurance, actively pushing the campaign for a digital-first approach not only with its products but also with service.\nEarlier in the year, the company announced that customers can now purchase insurance products via its website www.heirslifeassurance.com, in less than five minutes, a feat that was erstwhile deemed impossible."
  },
  {
    "headline": "Court Adjourns Kanu’s Trial As Lawyers Stage Walk Out",
    "summarized_story": "READ ALSO: Court Sentences Maina To Eight Years ImprisonmentThe IPOB leader told the court that Mr. Fein, who he said was handling a case for him in the US, was around to witness his trial.\nMeanwhile, counsel to FG, Mister Mohamed Abubakar, who is the Director of Public Prosecution, urged the court to proceed with the trial in the absence of Kanu’s lawyers.\nAbubakar told the court that ordinarily, the matter was fixed for a hearing of an application that was filed by the defendant.\nIn a short ruling, though Justice Nyako expressed her displeasure over the conduct of Kanu’s lawyers.\nShe also declined to dismiss the pending application and rather adjourned the case till January 19 and 20, 2022, for trial."
  },
  {
    "headline": "Buhari Congratulates Soludo, Urges Him To Tackle Challenges In The State, Southeast",
    "summarized_story": "President Muhammadu Buhari has congratulated Professor Charles Chukwuma Soludo, as he emerged winner in the gubernatorial election in Anambra State, saying that he looks forward to working with him.\nThe President also called on the governor-elect, who is a member of the Presidential Economic Advisory Committee, to rally other stakeholders to tackle the enormous challenges confronting the state and the Southeast in general.\nRead Also: ‘Let’s Take Anambra To The Moon’: Soludo Hands Olive Branch To Other Contestants“President Buhari enjoins Prof. Soludo, member of the Presidential Economic Advisory Committee, to rally other stakeholders to tackle the enormous challenges confronting the State and the Southeast in general.\n“The President looks forward to working with the incoming governor for the peace, security and development of not only Anambra State, but the entire country,” the statement read in part.\nOzigbo had 53,807 votes while the other two frontline contenders – Andy Uba and Ifeanyi Ubah scored 43,285 and 21,261 votes respectively."
  },
  {
    "headline": "Charles Soludo Wins Anambra Governorship Election",
    "summarized_story": "Professor Charles Soludo of the All Progressives Grand Alliance (APGA) has swept to victory in the Anambra governorship elections, winning 19 of the 21 local government areas of the state.\nBut the candidate of the All Progressives Congress (APC), Senator Andy Uba, was unable to win any local government in the election.\nSoludo, 61, a former Governor of the Central Bank of Nigeria, secured 112,229 votes, twice more than his closes rival – PDP’s Ozigbo to be returned as winner of the election.\n[READ ALSO] Charles Soludo: 9 Key Things To Know About Anambra’s Governor-ElectAs the usual practice, election results were trickling in a day after the election and those from 20 local government areas were collated, except Ihiala.\n“The next thing that should happen in Anambra will be to consolidate the wonderful works that are ongoing, especially under the 16 years of APGA in Anambra State,” he promised."
  },
  {
    "headline": "VIDEO: Soludo Celebrates Victory, Says It Reflects The People’s Will",
    "summarized_story": "﻿Former governor of the Central Bank of Nigeria (CBN), Professor Charles Soludo, has reacted to his victory in the Anambra State governorship election.\nAlmost four days after the keenly contested election and a supplementary poll that ensued, INEC finally returned Soludo elected as the winner.\nHe swept to victory in the election, winning 19 of the 21 local government areas of the state, while the candidates of the Peoples Democratic Party (Mr Valentine Ozigbo) and Young Progressives Party (Senator Ifeanyi Ubah) each won a local government.\nThe candidate of the All Progressives Congress (APC), Senator Andy Uba, could not win any local government in the election.\nSoludo, 61, a former Governor of the Central Bank of Nigeria, secured 112,229 votes, twice more than his closes rival – PDP’s Ozigbo who polled 53,807 votes."
  },
  {
    "headline": "Anambra Polls: Ortom Congratulates Soludo On Guber Victory",
    "summarized_story": "Governor Samuel Ortom, on behalf of the government and people of Benue State, has congratulated Professor Charles Chukwuma Soludo of the All Progressives Grand Alliance (APGA) on his victory at the November 6, 2021, Anambra State governorship election.\nHe described Prof. Soludo’s victory as a true reflection of the wishes of the people of Anambra and not the machinations of some individuals or groups outside the state.\nHe also commended security agencies deployed in the state for maintaining law and order, before, during, and after the conduct of the polls with no known cases of violence.\nThe governor equally congratulated the Independent National Electoral Commission (INEC) and said they also deserve commendation for the credible conduct of the polls “without yielding to external pressure to frustrate the will of the people of Anambra State”.\nGovernor Ortom prayed that God will guide the Anambra State governor-elect to enable him to serve the people faithfully and to actualize his vision for the State."
  },
  {
    "headline": "Breaking: INEC declares APGA's Charles Soludo as Anambra Governor-elect",
    "summarized_story": "See the full result below..\nThe candidate of the All Progressives Congress, Senator Andy Uba came a distant third with 43,285 votes.\nThe candidate of the All Progressives Congress, Senator Andy Uba came a distant third with 43,285 votes.\nThe Independent National Electoral Electoral Commission, INEC, has declared Professor Chukwuma Soludo of the All Progressives Grand Alliance as the winner of the November 6th Governorship Election in Anambra State.\nRecent PostsNews Feed RSS Error: WP HTTP Error: A valid URL was not provided."
  },
  {
    "headline": "Pastor Taiwo Odukoya loses wife, Nomthi, to Cancer",
    "summarized_story": "Nomthi, the wife of Taiwo Odukoya, the senior pastor of The Fountain of Life Church, is dead.\nPastor Odukoya announced her death in a post on his Instagram page on Tuesday evening.\nAccording to him, Nomthi “battled cancer for the better part of two years”.\n“With deep regret and gratitude to God, I have to announce the passing of my wife, Pastor Nomthi Odukoya,” he wrote.\nOdukoya’s marriage to Nomthi — a South African — came years after his first wife, Bimbo, died in the 2005 Sosoliso plane crash which occurred in Port Harcourt, the Rivers capital."
  },
  {
    "headline": "Woman killed 3 years after daughter's gruesome murder in Ondo -",
    "summarized_story": "A woman identified as Yemi Ajayi has been stabbed to death by unknown persons in Ondo State.\nHer killing is coming three years after her daughter, Seun Ajila was also killed gruesomely.\nUp till now, security agencies have not been able to fish out her killersMrs. Ajayi, it was learnt was killed in the wee hours of Tuesday at her residence residence of the deceased at Abusoro area of Akure, Ondo State capital.\nMultiple sources disclosed that the woman was stabbed five times on her stomach.\nA source who preferred not to be mentioned, said the woman’s daughter alerted neighbours when saw her mother in the pool of blood."
  },
  {
    "headline": "President Buhari seeks Senate confirmation of Omotayo as NIPSS DG -",
    "summarized_story": "President Muhammadu Buhari has written the Senate to confirm the nomination of Professor Ayo Omotayo for appointment as the Director-General of the National Institute for Policy and Strategic Studies (NIPISS) in Kuru, near Jos, Plateau State.\nPresident Buhari’s letter of request was read at plenary by the Senate President, Ahmad Lawan, on resumption of Senators’ 18- day working recess to enable Ministries, Departments and Agencies (MDAs) defend their 2022 budget proposals.\nThe President, in the letter, said the nomination of Professor Omotayo for the NIPISS top job was in accordance with Section 5(2) of the NIPSS Act 2004.\nThe letter titled: “Request for confirmation of appointment of Prof. Ayo C. Omotayo PhD as Director General, National Institute for Policy and Strategic Studies (NIPSS),” reads: “In accordance with the provision of Section 5 subsection 2 of the National Institute for Policy and Strategic Studies Act 2004, I write to present for confirmation by the Senate, the appointment of Prof. Ayo C. Omotayo as Director-General, National Institute for Policy and Strategic Studies (NIPSS).\nIt is my hope that the Senate will consider and confirm the nominee in the usual expeditious manner.”"
  },
  {
    "headline": "Soludo Celebrates Victory – Trending With Ojy Okpe",
    "summarized_story": "As south easterners and many Nigerians celebrate Charles Chukwuma Soludo’s emergence as Governor-Elect of Anambra State, the harrowing glitches of the electoral process continue to trend.\nOn Tuesday, voters in Ihiala local government area of the Anambra state, were subjected to delays by the independent national electoral commission.\nGovernor elect of Anambra State, Charles Chukwuma Soludo on Tuesday Nov. 9th was announced winner of the Anambra governorship election by the Independent National Electoral Commission.\nA video now making the rounds on social media captured the moment a truck driver got into an altercation with a vehicle inspection officer, after the officer allegedly stopped the driver to inspect his vehicle..\nThe driver who appeared to be out of control bit one of the officer’s arms leaving him bloodied."
  },
  {
    "headline": "Biafra Separatist Kanu’s Lawyers Walk Out as Judge Adjourns Trial to Next Year",
    "summarized_story": "However, before the judge came into the court room, Kanu’s lawyers, staged a walk-out to protest the refusal of operatives of the Department of State Services (DSS) to allow some members of the legal team to come into the courtroom.\nThe IPOB leader told the court that Mr. Fein, whom he said was handling a case for him in the US, was around to witness his trial.\n“He has been to the DSS to see me, but they denied him access to me.”Asked by the judge, if he was ready to conduct the proceedings himself, in the absence of his lawyers, Kanu replied in the negative.\nMeanwhile, counsel to the federal government, Mr. M. D. Abubakar, who is also the Director of Public Prosecution, urged the court to proceed with the trial in the absence of Kanu’s lawyers.\nIn a short ruling, though Justice Nyako expressed his displeasure over the conduct of Kanu’s lawyers, she declined to dismiss the pending application and rather adjourned the case till January 19 and 20, 2022, for trial."
  },
  {
    "headline": "Travis Scott Should Have Stopped Astroworld Concert Earlier, Says Fire Chief – Arise News",
    "summarized_story": "Rapper Travis Scott should have halted a show in Houston which saw a deadly crowd surge when he noticed people in trouble, the city’s fire chief says.\n“From the artist on down.”Eight people were killed and hundreds more injured in a crush at his Astroworld concert in Texas on Friday.\nThe artist has command of that crowd,” Mr Peña, the chief of the Houston Fire Department, told NBC’s Today show.\nIn an Instagram video following the event, Scott said he was devastated about what had happened and was “sending prayers to the ones that were lost”.\nPolice have launched an investigation, including looking into separate reports that somebody in the audience was injecting people with drugs."
  },
  {
    "headline": "Poland PM Blames Russia’s Putin for Belarus Migrant Crisis",
    "summarized_story": "Poland’s Prime Minister has accused Russian President Vladimir Putin of being behind a migrant crisis at Belarus’s border with Poland.\nOn Tuesday, Lithuania declared a state of emergency on its border with Belarus, which will come into effect at midnight.\nPoland has been accused of pushing migrants back across the border into Belarus, contrary to international rules of asylum.\n“Nobody is letting us get in anywhere, Belarus or Poland,” 33-year-old Shwan Kurd from Iraq told the BBC by video-call.\n“There is always a certain level of risk when there’s a large number of people crossing the border,” Mr Lancinskas said."
  },
  {
    "headline": "Colombian Leader Sees Opportunity in Cannabis, But Not Coca",
    "summarized_story": "Colombian President Iván Duque has high hopes for the medical marijuana industry in a country that has been waging a costly war against a different drug — cocaine — for decades.\n“In order to plant one hectare of coca in Colombia, two hectares of tropical jungle are destroyed,” he said.\n“We’re seeing a lot of international investment coming to Colombia,” said Duque, who will be replaced following a presidential election next year.\nMedical marijuana was legalized years ago, and more than 100,000 Israelis — out of a population of over 9 million — are licensed users.\nIsrael is also among the largest importers of medical cannabis flower."
  }
]