[
  {
    "headline": "Shisha more toxic than cigarettes, health experts warn",
    "summarized_story": "Amarachi OkehHealth experts have warned that smoking shisha is far more dangerous to health than smoking cigarettes.\nHowever, public health experts have warned that smoking shisha puts people at risk of the same health complications as cigarette smokers, if not more.\nA public health expert, Dr. Taiwo Obembe in an interview with PUNCH HealthWise said smoking Shisha is worse because the smoker is smoking unfiltered smoke, unlike cigarettes.\nAlso speaking, a Professor of Public Health, Dr. Tanimola Akande in agreement said there is no practical health benefit in smoking shisha.\nLike cigarettes, the health experts say the damages shisha does to the health are the same such as lung cancer and cardiovascular diseases."
  },
  {
    "headline": "Shisha more toxic than cigarettes, health experts warn",
    "summarized_story": "Amarachi OkehHealth experts have warned that smoking shisha is far more dangerous to health than smoking cigarettes.\nHowever, public health experts have warned that smoking shisha puts people at risk of the same health complications as cigarette smokers, if not more.\nA public health expert, Dr. Taiwo Obembe in an interview with PUNCH HealthWise said smoking Shisha is worse because the smoker is smoking unfiltered smoke, unlike cigarettes.\nAlso speaking, a Professor of Public Health, Dr. Tanimola Akande in agreement said there is no practical health benefit in smoking shisha.\nLike cigarettes, the health experts say the damages shisha does to the health are the same such as lung cancer and cardiovascular diseases."
  },
  {
    "headline": "COVID-19: Experts worry as 221 inbound passengers test positive in three weeks",
    "summarized_story": "Deborah Tolu-KolawoleNo fewer than 221 out of the 11, 671 international inbound passengers tested positive for COVID-19 in three weeks.\nThey particularly expressed concern about the sharp increase in the rate of COVID-19 positive cases among passengers coming into Nigeria.\nA check on epidemic week 26(June 28 to July 4) revealed that only 14 out of the inbound passengers to Nigeria tested positive for COVID-19.\nThe data also revealed that in week 28 (July 12 to July 18), no fewer than 107 inbound passengers tested positive making a total of 221 passengers in three weeks.\nWere the passengers positive before getting onboard or were they positive after getting into the country?"
  },
  {
    "headline": "COVID-19: Experts worry as 221 inbound passengers test positive in three weeks",
    "summarized_story": "Deborah Tolu-KolawoleNo fewer than 221 out of the 11, 671 international inbound passengers tested positive for COVID-19 in three weeks.\nThey particularly expressed concern about the sharp increase in the rate of COVID-19 positive cases among passengers coming into Nigeria.\nA check on epidemic week 26(June 28 to July 4) revealed that only 14 out of the inbound passengers to Nigeria tested positive for COVID-19.\nThe data also revealed that in week 28 (July 12 to July 18), no fewer than 107 inbound passengers tested positive making a total of 221 passengers in three weeks.\nWere the passengers positive before getting onboard or were they positive after getting into the country?"
  },
  {
    "headline": "Umahi charges Muslim community to contribute to Ebonyi development",
    "summarized_story": "David Umahi of Ebonyi has admonished the Muslim community in the state to be resourceful and contribute to the peace and economic growth of the state.\nUmahi made the commendation on Wednesday in Abakaliki when a delegation of the Muslim faithful in the state paid him an Eid-el-Kabir homage at the Government House.\nHe said, “Muslims are gifted in commerce and agriculture, among other ventures and I pray for your prosperity in Ebonyi and beyond,” Umahi said.\nHe also commended the group for shunning crime and urged them to continue to sustain the security and peace in the state.\n“You will continue to benefit from government policies and programmes with the delivery of democratic dividends to the people,” Umahi said."
  },
  {
    "headline": "Okonjo-Iweala counsels Nigeria’s diaspora to support the nation’s economy for peace",
    "summarized_story": "The DG said this at a webinar to celebrate the National Diaspora Day on Sunday, in Abuja, organised by the Nigerians in the Diaspora Commission (NiDCOM) to commemorate its establishment and its achievements so far.\nThe News Agency of Nigeria (NAN) reports that the event was themed: ” Diaspora Integration for National Peace and Development”, which NiDCOM described as being anchored on the levers of peace that would accelerate Diaspora engagement for national growth and development.\nIn her contribution, Okonjo-Iweala applauded the Diaspora for their huge contributions to the nation’s economy, citing in particular how their remittances had brought about development of the rural areas and the sustenance of the economy.\nHe added that the government had taken a further step by approving and adopting the National Diaspora Policy 2021 and its Action Plan, for a more holistic approach to the nation’s engagement with the diaspora.\nNAN reports that the National Diaspora Policy 2021 was unveiled by the NiDCOM Boss, Mr Franz Celestin, Chief of Mission, International Organization for Migration (IOM) and Sir Chibuzor Ugochi of the Nigerians in Diaspora Organisation, (NIDO UK-SOUTH)."
  },
  {
    "headline": "Gridlock on Lagos-Ibadan expressway, as travellers return from Sallah break",
    "summarized_story": "Traffic situation along Lagos-Ibadan expressway.\nPHOTO: TwitterBy Bose AdelajaRoad users plying Lagos/Ibadan Expressway, on Sunday, experienced heavy traffic gridlock inbound Lagos State, occasioned by travellers entering the axis after the Sallah celebrations.\nIt was learnt that the traffic gridlock was heightened by the ongoing construction activities on the expressway.\nFollowing the gridlock, TRACE has issued a travel advisory urging road users to use alternative routes.\n“Anybody in a hurry can make use of other alternative routes such as Lagos/Abeokuta Expressway, Ijebu-Ode /Epe Road and Sagamu/Ogijo/Ikorodu Road."
  },
  {
    "headline": "Nigerians spend N7trn annually on power generation- Expert",
    "summarized_story": "Nigerians, and by extension, their businesses, expend about N7 trillion annually on power generation, a Renewable Energy expert, Mr Stephen Ogboko, has said.\nOgboko, also the Executive Director and Chief Operating Officer, Off Grid Tech Solutions Ltd., made this known at a virtual news conference in Lagos.\nHe said that inadequate power supply had been a major challenge facing businesses in the country, forcing them to source for alternative power supply for their operations.\nOgboko said the Off Grid Tech Solutions Ltd. partners with the global innovators of off-grid solutions to provide reliable.\nOff-grid energy solutions is one of the key drivers of the nation’s push for industrialisation."
  },
  {
    "headline": "Nnamdi Kanu: Adopt UK, US manner of secret trials, ex-federal lawmaker tells FG",
    "summarized_story": "File image of Nnamdi Kanu when he was first brought to court on after his extradition to Nigeria from Kenya.\nHe advised the Federal Government to embrace secrecy in court terrorism trials, being the model used by several Western nations.\nAccording to him, acts of terrorism are tantamount to acts of war.\nHe said: “Secrecy of terrorism trials, which is another common feature of terrorism trials globally, can be found in Nigerian law.\n“Surprisingly, the 2011 Terrorism Act did not create a separate court for the trial of terrorists."
  },
  {
    "headline": "Sunday Igboho: Details of Yoruba monarchs’ meeting in Benin Republic revealed",
    "summarized_story": "The Yoruba monarchs in Benin Republic who met on Sunday over the arrest and detention of the Yoruba nation freedom fighter, Sunday Igboho, have resolved to write the president of the country, Patrice Talon.\nThe monarchs made the disclosure after a meeting at the Ajohoun Palace in Adjohoun, Benin on Sunday.\nDAILY POST earlier reported that the traditional rulers in the West African country, met to discuss ways of ensuring that the secessionist I’d freed by Beninese authorities.\nThe traditional rulers told BBC News Yoruba at the end of the meeting that they were working towards finding a solution to Sunday Igboho’s issues with authorities of the country.\nThey said that it was agreed upon that a letter should be written to the president of Benin Republic, the Minister of Justice, the Minister of Interior, and the Head of the country’s parliament."
  },
  {
    "headline": "Police thought Amotekun was established to take over its roles – Makinde",
    "summarized_story": "Governor Seyi Makinde of Oyo State on Sunday declared that men of Nigeria Police Force (NPF) thought that Western Nigeria Security Network (WNSN) also known as Amotekun was established to take over their roles.\nMakinde made this disclosure while speaking in Ibadan, the state capital.\nMakinde claimed that his government has invested heavily in security more than any of the previous governments in the state.\nBut, Makinde while speaking, said that the police thought that the security outfit was established to take over its roles.\n“When Amotekun was established, the Police thought it came to take over their jobs but we have been able to streamline between Amotekun and other security agencies and they are now working together in unity."
  },
  {
    "headline": "Attack insecurity, not Igboho, Kanu – Anglican Bishop blasts FG",
    "summarized_story": "The Bishop of Owo Anglican Diocese, Right Reverend Stephen Fagbemi, has urged the federal government to dissipate the energy being used to deal with agitators in the country on the insecurity challenges.\nAccording to Revd Fagbemi, the inability of the federal government to tackle the insecurity situation in the country had led to agitations from some sections of the country.\nThe cleric stated this at the 3rd session of the 13th Synod of the Diocese of Owo, Church of Nigeria (Anglican Communion) at the Saint Paul’s Church, Okeluse in Ose Local Government Area of Ondo State.\nHe added that agitation in the South West became glaring due to the mindless killings and attacks allegedly carried out by herdsmen.\n“If only our government could exact the same efforts it used on attacking Chief Sunday Adeyemo a.k.a."
  },
  {
    "headline": "Yoruba Nation: Sunday Igboho may die if extradited – Lawyer",
    "summarized_story": "Ibrahim Bamidele Salami, counsel to Yoruba freedom fighter, Sunday Igboho, has warned against extraditing the agitator to Nigeria.\nSalami disclosed that Igboho may die, if extradited to Nigeria from Benin Republic.\nThe lawyer, who disclosed this while featuring on BBC Yoruba, said extraditing Igboho is the same as sending him to his early grave.\nDSS had declared Igboho wanted after a cache of weapons were discovered in his residence in Ibadan, Oyo State.\nSunday Igboho handcuffed inside Cotonou cell, being fed by someone – Lawyer, Salami"
  },
  {
    "headline": "Nnamdi Kanu: Masked armed officers take over Federal High Court ahead of IPOB leader’s trial",
    "summarized_story": "Ahead of the continuation of the trial of Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, the Nigerian government has deployed operatives of the Department of State Services (DSS) to the premises of the Federal High Court, Maitama in Abuja.\nThe IPOB leader is standing trial before the Justice Binta Nyako Federal High Court, Abuja nine charges bordering on terrorism, treasonable felony, among others.\nA detachment of hooded armed officers was seen stationed at the entrance of the Federal High Court with motorbikes and vehicles preventing human and vehicular movements into the area.\nThe Attorney-General of the Federation and Minister of Justice, Abubakar Malami, had earlier warned members of the IPOB not to show up at the Court hearing on Monday.\nAlso, people in various hotels in the area are being prevented from moving in and out as the officers insisted that they were on a special operation in the area and appealed to them for understanding."
  },
  {
    "headline": "First House BBN House mate Boma checks out the house",
    "summarized_story": "The first housemate of the BBNAIJA season 6 tagged \"shine your eyes\" is Boma.\nHe introduced himself thus;A mixologist,He was a footballer but sustained injuries and had to go into modeling,A masseuse, likes to talk and listen to people, loves being the Mc in a party, anticipates hosting the parties in the house.\nHe is single and ready to mingle in the house"
  },
  {
    "headline": "Sunday Igboho not abandoned, says Sanwo-Olu",
    "summarized_story": "Lagos Governor Babajide Sanwo-Olu has assured leaders of the Southwest are working to ensure the release of Yoruba Nation agitator Sunday Adeyemo aka Sunday Igboho.\nIgboho was arrested in Cotonou, Benin Republic last Monday on his way to Germany.\nHe said: “People are working behind the scenes but the matter doesn’t have to be a public conversation.\n‘’These are very difficult times for all of us, but I can assure you that people are working behind the scenes.\nIn times like this, it’s not by how many press people you call.”"
  },
  {
    "headline": "VIDEO: Dog effortlessly shows artistic skills as it paints on canvas",
    "summarized_story": "In a video making the rounds online, a dog is seen displaying its artistic skills on canvas.\nThe dog which was seen working without any guidance from its owner shocked people on social media.\nIn the video, the dog is seen showing off the different colors it intends to use for the painting and it used the brush to effortlessly paint a flower as though it were a human.\nMy dog is useless af but I still love her@Crjstixn said; How does this dog know what color it’s choosing???\n😍🙌@mandala.tales said; Wow, wow, can I collaborate with Secret, please😍😍@rruhaa___ly said; So beautiful and she is the most amazing and talented dog I have ever seen🥺🥺😭😭😭😭"
  },
  {
    "headline": "VIDEO: Erica, Laycon make up, hang out",
    "summarized_story": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator."
  },
  {
    "headline": "Layrica. Fans react with video of Laycon an Erica together",
    "summarized_story": "Fans have reacted over the news development of ex BBNAIJA housemates Erica and Laycon in a video.\nThe duo have been in constant beef after a misunderstanding happened in the house which also led to Erica been disqualifiedAt the reunion, Erica who appeared once made known her displeasure in Laycon.\nThe video which was handled by Erica showed her introducing Laycon as the love and light guy.\nThe question now on the lips of Nigerians is, what happens to the fans of both persons who have turned enemies on their behalf?\nwatch video herehttps://www.facebook.com/OsaremenGist/videos/1225894104550258/?app=fbl"
  },
  {
    "headline": "BREAKING: Nigeria's Secret Police Operatives Take Over Federal High Court, Abuja Ahead of Nnamdi Kanu's Trial",
    "summarized_story": "Operatives of the Department of State Services (DSS) have taken over the premises of the Federal High Court, Maitama in Abuja ahead of the trial of the leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, on Monday.\nKanu is standing trial before Justice Binta Nyako for charges bordering on terrorism, treasonable felony, illegal possession of arms, among others levelled against him by the Nigerian government.\nThe operatives took over the surroundings of the court and the Ministry of Justice building, down to Abia State Government's liaison office, preventing people from accessing the area.\nIt is not clear if the operatives will allow those working in the area to have access to their offices on Monday.\nMeanwhile, supporters of the detained IPOB leader have vowed to storm the court to show solidarity with their leader."
  },
  {
    "headline": "BREAKING: Nigeria's Secret Police Operatives Take Over Federal High Court, Abuja Ahead of Nnamdi Kanu's Trial",
    "summarized_story": "Operatives of the Department of State Services (DSS) have taken over the premises of the Federal High Court, Maitama in Abuja ahead of the trial of the leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, on Monday.\nKanu is standing trial before Justice Binta Nyako for charges bordering on terrorism, treasonable felony, illegal possession of arms, among others levelled against him by the Nigerian government.\nThe operatives took over the surroundings of the court and the Ministry of Justice building, down to Abia State Government's liaison office, preventing people from accessing the area.\nIt is not clear if the operatives will allow those working in the area to have access to their offices on Monday.\nMeanwhile, supporters of the detained IPOB leader have vowed to storm the court to show solidarity with their leader."
  },
  {
    "headline": "BREAKING: Bandits Release 28 Abducted Bethel School Students In Kaduna, More Still In Kidnappers' Den",
    "summarized_story": "Bandits have released 28 students kidnapped from Bethel Baptist Academy in the Chikun Local Government Area of Kaduna State.\nTwo of the students had earlier escaped while the bandits had released one on health grounds.\nThe gunmen who invaded the school on July 5, 2021 had demanded N500,000 for each of the students, Daily Trust reports.\nSee Also News Two Abducted Bethel Baptist Students Rescued By Security Operatives Now In Hospital—PoliceChairman of the Christian Association of Nigeria (CAN) in Kaduna, Rev.\nJohn Hayab, said about 80 students were still held captive by the bandits while the released students would be reunited with their families."
  },
  {
    "headline": "BREAKING: Bandits Release 28 Abducted Bethel School Students In Kaduna, More Still In Kidnappers' Den",
    "summarized_story": "Bandits have released 28 students kidnapped from Bethel Baptist Academy in the Chikun Local Government Area of Kaduna State.\nTwo of the students had earlier escaped while the bandits had released one on health grounds.\nThe gunmen who invaded the school on July 5, 2021 had demanded N500,000 for each of the students, Daily Trust reports.\nSee Also News Two Abducted Bethel Baptist Students Rescued By Security Operatives Now In Hospital—PoliceChairman of the Christian Association of Nigeria (CAN) in Kaduna, Rev.\nJohn Hayab, said about 80 students were still held captive by the bandits while the released students would be reunited with their families."
  },
  {
    "headline": "Buhari Gags Press, Accredits 10 Media Organisations To Cover Nnamdi Kanu's Trial",
    "summarized_story": "DSS, which has kept Kanu in its custody, restricted the number of media organisations to cover the trial to 10, to limit its coverage.\nOther broadcast media are Channels Television, Africa Independent Television, and TVC.\nLawless DSS has 'accredited' only 10 media houses to cover @MaziNnamdiKanu’s trial, it will be a shame and a crime against #freepress for any independent news source to apply to DSS for accreditation.\npic.twitter.com/XFnt7VnGXF — Omoyele Sowore (@YeleSowore) July 25, 2021\"These media houses must withdraw from this sabotage of free press.\nThe DSS has no right to engage in the accreditation of media houses to cover a public trial in a Federal High Court in Nigeria."
  },
  {
    "headline": "'Minimum of 10 years in prison' -- Penalty for charges levelled against Sunday Igboho",
    "summarized_story": "Sunday Adeyemo, the Yoruba Nation activist popularly known as Sunday Igboho, will be appearing before the appeal court in Cotonou on Monday.\nBefore then, we bring you a quick update of all the charges levelled against him.\nHere are the offences against Igboho and the corresponding penalty in Nigerian law:AdvertisementArms smuggling/traffickingIgboho is charged with trafficking and possession of unlicenced arms and ammunition in Nigeria.\nThe Nigerian laws are not entirely clear about what should be done to secessionists, therefore, the government often charges them with treason or promotion of inter-communal war.\nIgboho has denied all the allegations levelled against him and his lawyers have said the government has no evidence to back up its claims."
  },
  {
    "headline": "'Minimum of 10 years in prison' -- Penalty for charges levelled against Sunday Igboho",
    "summarized_story": "Sunday Adeyemo, the Yoruba Nation activist popularly known as Sunday Igboho, will be appearing before the appeal court in Cotonou on Monday.\nBefore then, we bring you a quick update of all the charges levelled against him.\nHere are the offences against Igboho and the corresponding penalty in Nigerian law:AdvertisementArms smuggling/traffickingIgboho is charged with trafficking and possession of unlicenced arms and ammunition in Nigeria.\nThe Nigerian laws are not entirely clear about what should be done to secessionists, therefore, the government often charges them with treason or promotion of inter-communal war.\nIgboho has denied all the allegations levelled against him and his lawyers have said the government has no evidence to back up its claims."
  },
  {
    "headline": "'Risks death sentence' -- all you need to know about Nnamdi Kanu’s trial as hearing resumes",
    "summarized_story": "The trial of Nnamdi Kanu, leader of the proscribed Indigenous People of Biafra (IPOB), will continue on Monday before a federal high court in Abuja.\nAbubakar Malami, attorney-general of the federation (AGF), had said the IPOB leader was “intercepted through the collaborative efforts of Nigerian intelligence and security services”.\nThe IPOB leader subsequently went into hiding during a military operation in the southeast where he is from, only to reappear after one year in Israel.\nPOSSIBILITY OF ADDITIONAL CHARGESFrom recent happenings and statements by government officials, there are indications that the charges against the IPOB leader may be increased.\n(2) without prejudice to subsection (2) of this section, where death results from any terrorist act the penalty shall be death sentence."
  },
  {
    "headline": "'Risks death sentence' -- all you need to know about Nnamdi Kanu’s trial as hearing resumes",
    "summarized_story": "The trial of Nnamdi Kanu, leader of the proscribed Indigenous People of Biafra (IPOB), will continue on Monday before a federal high court in Abuja.\nAbubakar Malami, attorney-general of the federation (AGF), had said the IPOB leader was “intercepted through the collaborative efforts of Nigerian intelligence and security services”.\nThe IPOB leader subsequently went into hiding during a military operation in the southeast where he is from, only to reappear after one year in Israel.\nPOSSIBILITY OF ADDITIONAL CHARGESFrom recent happenings and statements by government officials, there are indications that the charges against the IPOB leader may be increased.\n(2) without prejudice to subsection (2) of this section, where death results from any terrorist act the penalty shall be death sentence."
  },
  {
    "headline": "Akin Oyebode: There could be crisis if north resists power shift to south in 2023",
    "summarized_story": "Akin Oyebode, professor of international law and jurisprudence, says there could be crisis if the north resists power shift to the south in 2023.\nAdvertisementIn an interview with Nigerian Tribune, Oyebode said those who are against a peaceful power shift will make a violent change inevitable.\nHe accused President Muhammadu Buhari of running a divisive administration that doesn’t consider the plight of other ethnic groups.\n“The feeling of the Southern governors is quite understandable.\nAnd those who are against the change, peaceful change, if they are not careful, will make violent change inevitable."
  },
  {
    "headline": "CBN regulations holding back mobile money revolution in Nigeria",
    "summarized_story": "In Ghana, it would be an “anomaly” for a supermarket, small store, or business merchant to not use a mobile money service for transactions.\nNew agent and electronic money guidelines were released in 2014, allowing network operators to run mobile money services, with supervision from the banking regulator.\nUptake in mobile money services and financial inclusion have equally increased across the country.\nThe regulatory framework is one of the core reasons why mobile money uptake has been relatively slow in Nigeria.\n“The CBN recognises the importance of Mobile Network Operators in the operations of mobile money services and appreciates the criticality of the infrastructure they provide."
  },
  {
    "headline": "This app wants to simplify Twitter giveaways, without bank accounts",
    "summarized_story": "Let’s say I wanted to send a surprise ‘happy birthday’ cash gift to a friend; my first thought would be to ask for their bank account number.\nI would do this for people I know very well but also for someone I only know on social media.\n“Like sending money through email addresses using PayPal, Vendly hopes to replicate that using social media handles,” he said.\nLong-term, Vendly will help social media users monetize their social media presence, the CEO said.\nThe message states the amount sent; recipient inputs the bank account where they want the cash to go."
  },
  {
    "headline": "Hundreds of MTN, Vodacom towers damaged in South Africa unrest",
    "summarized_story": "Telecommunications infrastructure owned by several mobile network operators was severely damaged in the rampant looting and destruction of property that rocked South Africa last week.\nThe Independent Communications Authority of South Africa (ICASA) revealed on Tuesday, July 13, that the vandalism included more than 100 mobile network towers in some parts of the country.\nVirtually all network providers operating in South Africa reported disruption to service delivery.\nChildren are evacuated from a burning building in downtown Durban, South Africa.\nJust one of its network towers was vandalised within the Durban area but it did not affect service delivery to consumers."
  },
  {
    "headline": "Senegal to produce rapid Covid tests in tech deal with major biotech companies",
    "summarized_story": "The Pasteur Institute in Senegal will produce rapid antigen tests for diagnosing the coronavirus disease from early 2022 with the help of a new tech transfer agreement.\nAn antigen test is regarded as a suitable ‘first line of defense’ against the coronavirus disease for individuals who have symptoms.\nIt plans to make 2.5 million tests per month in 2022, according to the statement.\nHowever, the rapid antigen test deal involving the Pasteur Institute comes at a time when Senegal is grappling with soaring coronavirus cases.\nAccording to health ministry spokesman Mamadou Ndiaye, the West African nation was seeing an “unprecedented” surge in Covid infections."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "The Central Bank of Nigeria (CBN) has disclosed that it’ll launch the pilot scheme of its digital currency on October..."
  },
  {
    "headline": "Nigeria’s apex bank chooses open-source blockchain to run digital currency pilot on October 1, 2021",
    "summarized_story": "Share this article:The Central Bank of Nigeria (CBN) has disclosed that it’ll launch the pilot scheme of its digital currency on October 1, 2021.\nThe apex bank announced earlier on June 10, 2021, that it would launch a pilot scheme for its digital currency before the end of the year.\nHyperledger Fabric blockchainThe Hyperledger Fabric blockchain is a private and permissioned blockchain network designed by computer hardware company, International Business Machines Corporation (IBM).\nIn a Cointelegraph article on July 2, 2019, Stuart Popejoy, blockchain expert and founder of hybrid blockchain platform, Kedena, said that “Fabric’s architecture is far more complex than any blockchain platform while also being less secure against tampering and attacks.\nAdvertisementMeanwhile, CBN says Nigeria cannot be left behind when 80% of central banks globally are considering issuing a central bank digital currency (CBDC)."
  },
  {
    "headline": "Twitter’s downvote button, Cellulant’s licence approval, Convergence Partners’ $120m round",
    "summarized_story": "Today, I’m discussing:Twitter’s shiny new downvote buttonConvergence’ Partners’ $120m roundCellulant’s licence approval in TanzaniaTwitter is testing out a downvote buttonPhoto by Claudio Schwarz | @purzlbaum on UnsplashWhat happened?\nTwitter says while the downvote button will be visible, only the reply owner can know the exact number received.\nHowever, according to Twitter, this is not a dislike button and while it bears some resemblance to Reddit’s downvote button, it will not affect the order of replies.\nCellulant’s new approval will allow it connect to banks, online merchants, payment processors, merchants, state governments, and customers to meet their digital payment demands in Tanzania.\nConvergence Partners raises $120 millionSouth African tech investment firm, Convergence Partners, has raised $120 million to drive inclusion in Africa."
  },
  {
    "headline": "Google x Maliyo Games, Instagram and YouTube’s new features, and Clubhouse leaves beta",
    "summarized_story": "Mobile gaming: Per Business Wire, the mobile gaming market was worth $98 billion globally in 2020 and is expected to grow to $272 billion by 2030.\nAccording to Kevuru games, 59.9% of games were played on mobile in 2020, while 28.70% and 16.11% were played on PC and console, respectively.\nOn July 20, 2021, the company announced in a blog post that it was launching Sensitive Content Control.\nAccording to Instagram, sensitive content isn’t content that breaks the rules but could upset some users.\nOn July 20, 2021, YouTube announced it is rolling out a beta version of its new feature, Super Thanks."
  },
  {
    "headline": "The Week Ahead",
    "summarized_story": "“The kind of employment that the poultry sector gives to Nigeria, the cattle sector cannot give such but the government is not taking the poultry sector seriously.\nThe Naira closed the week at $/N411.50 at the I&E FX window, at the NAFEX (spot market) it closed at $/N411.11.\nMore of the same is expected in the week ahead as the Naira is anticipated to continue to hover around N406/$1-N412/$1 threshold in the NAFEX window.\nThe Nigerian capital marketLast week was a brief trading week as the Federal Government of Nigeria declared Tuesday 20th and Wednesday 21st July 2021 as Public Holidays to commemorate the Eid el-Kabir celebration.\nMarket breadth for the week closed positive with 43 gainers led by CUTIX and TOTAL as against 16 losers led by SMURFIT and SOVRENINS."
  },
  {
    "headline": "How wrong use of the gavel ruins Nigeria’s democracy",
    "summarized_story": "Nigeria’s long journey to a consolidated democracy where there will be credible and transparent elections appears to be under threat.\nAccording to Wikipedia, a gavel is a small ceremonial mallet commonly made of hardwood, typically fashioned with a handle.\nHowever, the new Act in section 52 leaves the electronic transmission of election results at the mercy of INEC, which can decide when and where to transmit votes electronically or manually.\nOkechukwu moved that Clause 52 (2) be amended to read that: “Voting and transmission of results shall be by electronic transmission”.\nThe Deputy Speaker did not hide his opposition to electronic transmission of votes when he argued that the entire country was not yet covered by broadband and as such, there would be issues with electronic transmission of results."
  },
  {
    "headline": "Poverty and the psychology of ‘money rain’",
    "summarized_story": "In 2020, many argued the World Bank report that revealed that Nigeria had overtaken India as the World Poverty Capital, considering that India has the most people living in extreme poverty.\nBut the poor are also making an effort to shake hands with the rich, who rain money amid lack, hence the high level of crime in the society today.\nHe further noted that the implication of naira rain on Nigeria in the midst of abject poverty is obvious.\n“Some of those who rain money are their mates; all they need to do is find out how and where to get their own money.\n“You cannot close the poverty gap when inflation is rising every day, when the corrupt are getting away with their loot, when youths are seeing violence as a means to quick money."
  },
  {
    "headline": "Bendel Insurance FC Overtake Remo as Tanimu scores on birthday – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBendel Insurance Football Club of Benin on Saturday evening pipped Abia Comets by a lone goal in Benin to reach the Nigeria National League (NNL) Group B2 Summit.\nInsurance reliable defender Benjamin Tanimu was the hero after scoring the only goal of the match in the 26th minute for his side on his birthday.\nIt was indeed a beautiful header from the birthday boy converting a superb corner kick by Insurance mercurial midfielder Meyiwa Oritseweyinmi from the left flank.\nInsurance pulled away goalless draw at Abia Comets in the first stanza of the League.\nThe home victory has now pushed the Benin Arsenals atop the table with 34 points,tied with bitter rivals Remo Stars but lead with higher number of goals."
  },
  {
    "headline": "BSM alleges Ijaws plan to excise Edo commmunity – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Benin Solidarity Movement (BSM), a socio-cultural non-political organisation, has alerted the Edo State Governor, Mr Godwin Obaseki and the Benin Monarch, His Royal Majesty, Oba Ewuare II of plans by the Ijaws in Ovia-North-East Local Government Area of the State to excise the Iko commmunity from the inhabitants.\nIko, corrupted to Ikoro is a community in Obazuwa Dukedom.\nBSM was apparently reacting to a media report of July 21,2021 credited to “a self acclaimed Ijaw Group, IYC Chairman.\n“From history, the Ijaws benefited from the large heart of the Oba of Benin who gave them a settlement in their fishing business, but they have now become major land rivals, which they termed to be their ancestral land.\nOur area of interest lies within our territory, Iko community in Ovia-North-East Local Government Area of Edo State where we have over the years accommodated them and other tribes.”He said that Obazuwa commmunity has been in existence before the reign of Oba Ewuare I in 1440."
  },
  {
    "headline": "Alleged insecurity in Rivers, others exaggerated – Korean Ambassador – Nigerian Observer",
    "summarized_story": "The Korean ambassador stated this during a courtesy call to Governor of Rivers State, Nyesom Ezenwo Wike at the Government House, Port Harcourt on Saturday evening.\nHe commended the Peoples Democratic Party chairman in Rivers State, Ambassador Desmond Akawor for being a worthy ambassador of Nigeria to the Republic of Korea.\nIn his response, Governor Wike commended the Korean ambassador for his pragmatic and objective analysis of the security situation in Rivers State.\nGet the security statistics from the Police, from the State Security Services, from the military, they will tell you so.\nAnd for Rivers State to survive, he said the government is focusing on agriculture by establishing a cassava processing company."
  },
  {
    "headline": "Police move to dislodge bandits in Edo forest – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY-Special squad of Edo Police Command have moved into a forest in Akoko-Edo local government area in search of bandits, kidnappers and other criminal elements terrorising the area.\nThe commissioner of police in Edo State CP Philip Ogbadu directed the special operation led by SP Richard Balogun of the Anti-Kidnapping and Cyber-crime unit, to smoke out the hoodlums.\nThe special squad was said to had deployed high-tech tracking device, trailed the hoodlums to their hideout in Uneme-Erunu/Okpela area of Akoko-Edo where the boy, Onose Friday Umasabor was rescued on July 23, 2021.\nIt however stated that the commissioner of police in Edo State CP Philip Ogbadu has ordered criminals and their collaborators to quit the state or be prepared to face the full wrath of the law.\nThe release advised members of the general public to call police control room following numbers whenever the need arises; 08037646272, 08123827225, 08056776365, and 08077773721."
  },
  {
    "headline": "INTERVIEW: I’ll quit Methodist Church if it accepts same sex marriage – Nigerian Bishop",
    "summarized_story": "Wesley: For many years the LGBT community has been advocating for acceptance in the United Methodist Church, but the church has objected to that.\nOn the division in the church in NigeriaWesley: In the United Methodist Church, there are so many groups with different motives and intents.\nEmmanuel Ande: Christmas Covenant has no connection with homosexualityOn Christmas Covenant and homosexualityAnde: Christmas Covenant has nothing to do with the issue of homosexuality.\nThat is why they want to create a new church within the United Methodist Church.\nThe British Methodist Church in the UK adopted homosexuality and even went to the extreme to allow same sex marriage in their church, but we still have British Methodist Church in Nigeria."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Okonjo-Iweala hails contribution of Nigerians in diaspora to economy, calls for more effort",
    "summarized_story": "The DG said this at a webinar to celebrate the National Diaspora Day on Sunday, in Abuja, organised by the Nigerians in the Diaspora Commission (NiDCOM) to commemorate its establishment and its achievements so far.\nIn her contribution, Okonjo-Iweala applauded the Diaspora for their huge contributions to the nation’s economy, citing in particular how their remittances had brought about development of the rural areas and the sustenance of the economy.\nHe added that the government had taken a further step by approving and adopting the National Diaspora Policy 2021 and its Action Plan, for a more holistic approach to the nation’s engagement with the diaspora.\nShe urged the diaspora to collaborate with Nigeria, their country of origin, in sharing ideas , technology and others skills, that would promote her development.\nThe National Diaspora Policy 2021 was unveiled by the NiDCOM Boss, Mr Franz Celestin, Chief of Mission, International Organization for Migration (IOM) and Sir Chibuzor Ugochi of the Nigerians in Diaspora Organisation, (NIDO UK-SOUTH), NAN reported."
  },
  {
    "headline": "APC wins all in Ogun LG polls",
    "summarized_story": "The ruling All Progressive Congress (APC), has won all 20 local governments in the Ogun State local government election held on Saturday.\nThis is according to the results released by the Ogun State Independent Electoral Commission (OGSIEC) on Sunday.\nAdo-Odo/Ota local government, Musa Sheriff Adewale has 73,727 votes, Abeokuta South local government polled 25,611 votes while Adeyemi Waliat Afolashade garnered 12, 466 votes.\nOsibodu disclosed that the total number of votes cast in the chairmanship elections in the 20 local government areas in the state was 396, 641.\nHe said, “I want to say that APC won all the chairmanship seats in the 20 local government areas in the state, ” he said."
  },
  {
    "headline": "APC wins 17 chairmanship seats in Ogun LG poll as counting continues",
    "summarized_story": "The ruling All Progressive Congress (APC) has won the 17 chairmanship seats announced for the local government elections in Ogun State.\nThe results were announced on Sunday by Babatunde Osibodu, the chairman of the Ogun State Independent Electoral Commission (OGISIEC), at the commission’s head office in Abeokuta.\nOsibodu said that pending results from Odeda, Ado-Odo/Ota and Abeokuta-South LGAs would be announced as soon as they were received from the collation centres.\nHe said the results of the elections into all the 236 councillorship positions in the state would also be announced when they were ready.\nThe LG elections in Ogun were largely characterised by low turnout of voters and logistic challenges at the early stage of the exercise in most council areas."
  },
  {
    "headline": "Nnamdi Kanu Suffering For The Sins Of Igbo Leaders, By SKC Ogbonnia",
    "summarized_story": "The objective fact is that Kanu is suffering for the sins of the Igbo leaders.\nTHE FIRST SIN of these Igbo leaders is lack of development in Igboland that drew the ire of Kanu in the first place.\nUnlike the Igbo leaders, Nnamdi Kanu is a student of the History and has stoutly rejected the “dot in a circle” label far before Buhari made the conspiracy public.\nUnfortunately, unlike Nnamdi Kanu, the Igbo leaders are grossly naïve.\nThe problem is that the Igbo leaders who claim to know how best to deliver the message choose to do nothing at all."
  },
  {
    "headline": "Three armed robbers burnt to death in Imo",
    "summarized_story": "Three suspected armed robbers have been burnt to death in Owerre Ebeiri in Orlu Local Government Area of Imo State after they were caught robbing traders in the market.\nThe Imo State Commissioner of Police, Abutu Yaro, confirmed this to newsmen in Owerri on Sunday.\nAlso, the suspects were alleged to be members of the gang of armed robbers robbing commuters plying on Owerri/Orlu road in the State.\nThe Police Chief said: “On 24/7/2021 at about 06:30 hours, the inhabitants of Owerre Ebeiri in Orlu caught in the act, three armed robbers while robbing some traders yet to be identified.\n“It is believed that they are the ones that have been terrorising the community using an unmarked motorcycle to rob innocent people, especially traders along Owerri Orlu Road, Imo State."
  },
  {
    "headline": "Three armed robbers burnt to death in Imo",
    "summarized_story": "Three suspected armed robbers have been burnt to death in Owerre Ebeiri in Orlu Local Government Area of Imo State after they were caught robbing traders in the market.\nThe Imo State Commissioner of Police, Abutu Yaro, confirmed this to newsmen in Owerri on Sunday.\nAlso, the suspects were alleged to be members of the gang of armed robbers robbing commuters plying on Owerri/Orlu road in the State.\nThe Police Chief said: “On 24/7/2021 at about 06:30 hours, the inhabitants of Owerre Ebeiri in Orlu caught in the act, three armed robbers while robbing some traders yet to be identified.\n“It is believed that they are the ones that have been terrorising the community using an unmarked motorcycle to rob innocent people, especially traders along Owerri Orlu Road, Imo State."
  },
  {
    "headline": "POWA: 265 policemen killed in Borno since insurgency outbreak",
    "summarized_story": "At an event welcoming Hajara Alkali, POWA president and wife of IGP Usman Baba Alkali, over the weekend in Maiduguri, the chairman Borno State POWA, Zara Yakubu, said that over 260 police officers have been killed in Borno State since the outbreak of the Boko Haram insurgency in the Northeast.\n“Their families have, as a result, been exposed to all forms of hazards and vulnerabilities,” POWA said.\n“It heartbreaking to note that 265 police officers have paid the supreme price in the counter-insurgency war here in Borno.\nThey have been allowed to bear the burden of the sacrifices of their bread winners,” Zara Yakubu noted.\nShe donated grinding machines, deep freezers, tailoring equipment and other items to 500 widows of fallen police officers."
  },
  {
    "headline": "POWA: 265 policemen killed in Borno since insurgency outbreak",
    "summarized_story": "At an event welcoming Hajara Alkali, POWA president and wife of IGP Usman Baba Alkali, over the weekend in Maiduguri, the chairman Borno State POWA, Zara Yakubu, said that over 260 police officers have been killed in Borno State since the outbreak of the Boko Haram insurgency in the Northeast.\n“Their families have, as a result, been exposed to all forms of hazards and vulnerabilities,” POWA said.\n“It heartbreaking to note that 265 police officers have paid the supreme price in the counter-insurgency war here in Borno.\nThey have been allowed to bear the burden of the sacrifices of their bread winners,” Zara Yakubu noted.\nShe donated grinding machines, deep freezers, tailoring equipment and other items to 500 widows of fallen police officers."
  },
  {
    "headline": "PDP governors meet Monday over state of nation",
    "summarized_story": "By Emmanuel OloniruhaGovernors elected under the platform of the Peoples Democratic Party (PDP) will on Monday meet in Bauchi, to deliberate on unemployment and the state of the Nigerian economy.\nDirector-General, PDP Governors Forum (PDP-GF), CID Maduabum disclosed this on Sunday.\nMaduabum said that PDP governors would, at the meeting, examine and deliberate on the current state of the nation, and the state of their respective States.\nHe said the health of Nigeria’s democracy, including the Electoral Act Amendment, Constitution alteration bills, pending before the National Assembly, would also feature in discussions at the meeting.\nMaduabum said the meeting would continue to interrogate the Federal Government’s response to insecurity that was still pervading the country and proffer workable solutions."
  },
  {
    "headline": "ICYMI: France upset USA in Olympic basketball",
    "summarized_story": "Agency ReportsThe U.S lost Tokyo Olympic men’s basketball match for the first time in 17 years on Sunday, with a 76-83 loss to France.\nThe American team led by eight points at half-time, but the French roared back in the third quarter where Kevin Durant ran into foul trouble.\nThe French won the quarter 25-11 and then ended the match with a 16-2 run for an impressive victory after the Americans had briefly regained their composure.\n“Every single guy that came in the game brought us something —— with scoring, without scoring on defence, on rebounds.\nIt’s really the team that we want to be and it’s exciting for the rest of the tournament.”The last U.S Olympic loss was in the Athens 2004 semi-finals against Argentina."
  },
  {
    "headline": "Poet, fashion designer, wedding planner: BBNaija female housemates unveiled",
    "summarized_story": "The 11 female housemates taking part in the BBNaija Season 6, Shine Your Eye, were unveiled on Sunday 25 July.\nHere are some titbits about the ladies:Arinola Olowoporoku, a.k.a Arin:She is 29 years old.\nShe is a fashion entrepreneur and loves cooking, travelling and photography.She has four other siblings.\nShe is a 29 year-old from Abia.\nThe 29 year-old self employed lady is from Port Harcourt."
  },
  {
    "headline": "Family Announces Burial Arrangements For Super TV CEO, Usifo Ataga",
    "summarized_story": "Usifo Ataga, the slain CEO of Super TV, will be laid to rest on Friday, July 30, 2021, according to his family.\nOn Thursday, July 29, at The Incubator, also on Victoria Island, a song service will be conducted in his honor.\nRecall that Ataga’s body was discovered in a flat in Lekki, Lagos, just days after his family reported him missing.\nAtaga’s remains were discovered with multiple stab wounds, according to the police investigation.\nIn connection with his death, the Lagos State police command has detained Chidinma Ojukwu and a number of other people."
  },
  {
    "headline": "Masked Armed Officers Take Over Federal High Court Ahead Of Nnamdi Kanu’s Trial",
    "summarized_story": "The Nigerian government has deployed operatives of the Department of State Services (DSS) to the premises of the Federal High Court, Maitama in Abuja, ahead of the resumption of Nnamdi Kanu’s trial as the leader of the Indigenous People of Biafra, IPOB.\nThe IPOB leader is facing nine accusations, including terrorism and treasonable crime, before Justice Binta Nyako Federal High Court in Abuja.\nA detachment of hooded armed officers with motorbikes and cars was spotted stationed outside the Federal High Court’s entrance, prohibiting human and vehicular movement into the area.\nAbubakar Malami, the Attorney-General of the Federation and Minister of Justice, had already urged IPOB members not to attend the Court hearing on Monday.\nPeople in other hotels in the region are also being barred from entering and exiting since the cops insisted that they were conducting a special operation in the area and pleaded for their patience."
  },
  {
    "headline": "Meet All Female Housemates Of BBNaija Season 6",
    "summarized_story": "Big Brother Naija 2021 Season 6 premiered on Saturday, July 24th, with 11 male housemates being the first to arrive.\nThe theme for this year’s show is “Shine Ya Eye.”Ebuka Obi-Uchendu, a well-known media personality, returned to host the show and revealed some adjustments to the formats.\nThe females who entered the Big Brother House on Sunday night are listed below.\nMariaMaria joins BBNaija ‘Shine Ya Eye’ as the 17th Housemate.\nBeatriceThe 19th Housemate to enter BBNaija Shine Ya Eye is Beatrice."
  },
  {
    "headline": "BREAKING: Yoruba Monarchs In Benin Republic Meet Over Igboho",
    "summarized_story": "On Sunday, Yoruba monarchs in Benin Republic convened to discuss the imprisonment and incarceration of Yoruba Nation agitator Sunday Adeyemo, also known as Sunday Igboho.\nThe summit took place in Adjohoun’s Palace of Alajohoun, which is around 60 kilometers from Ajase.\nAlajashe of Ajase from Port Novo, Alajohoun of Adjohoun, Onikoyi Abesan, and Oba of Seme are among those who attended the conference.\nAfter his five lawyers failed to persuade the prosecutor that he had no case to answer, the Beninese court deferred Igboho’s case until Monday (tomorrow).\nDuring the court, prosecutors claimed Igboho was on a watchlist for alleged arms trafficking, encouraging violence that might cause societal unrest, and fostering divisiveness in Nigeria, according to the lawyers."
  },
  {
    "headline": "Tension in Abuja, masked security operatives take over court premises as Nnamdi Kanu’s trial begins",
    "summarized_story": "Trial of the leader of Indigenous People of Biafra (IPOB) Nnamdi Kanu regarding the treasonable felony charge preferred against him by the federal government will commence on Monday.\nAhead of the trial to be held at the federal high court in Abuja, there is growing tension moment after a security alert was issued especially those whose offices are located with Central Business District and Maitama.\nThis follows the commencement of the trial of proscribed IPOB leader, Nnamdi Kanu.\nEmployees are advised to seek alternative routes, exercise caution.”Blueprint reports that rhe security operatives who are on ground around the court premises have been stationed amidst threat by IPOB members that they would besiege the court as the trial begins.\nThe IPOB leader is standing trial before the Justice Binta Nyako of the Federal High Court, Abuja."
  },
  {
    "headline": "Pictures: BBNaija housemates wear underwear as headgear on arrival of female folks",
    "summarized_story": ""
  },
  {
    "headline": "How my daughter celebrated birthday in bandits’ captivity, parent of released Bethel Baptist student recounts",
    "summarized_story": "Following the release of 28 students of Bethel Baptist High School Kaduna on Sunday, parents of the children have been recounting their ordeal while their children were in bandits’ captivity.\nOne of the parents, Malam Danboyi Begs, said her daughter Louis was kidnapped the day she was to start her NECO examinations, adding that she celebrated her 16th birthday in the forest.\n“My daughter was kidnapped the day she was to start her Neco examination, she celebrated her 16th birthday on July 23 in the bush with kidnappers.\nGovernment should take precaution and address the issue.”Malam Danladi Badi is a very happy man on Sunday after receiving his daughter Ruth who was released from bandits captivity.\nSo far my child Goodness, was released, others would be released,” he said."
  },
  {
    "headline": "Job racketeering: NCCSALW cautions job seekers against fraudsters -NigPilot",
    "summarized_story": "The National Centre for the Control of Small Arms and Light Weapons (NCCSALW) , on Friday, cautioned job seekers to beware of Job racketeers and fraudsters parading selves as a recruitment agent of the agency, saying that NCCSALW is currently not recruiting.\nIt also disclosed that the fraudsters involved in the illegal recruitment, fraudulent inducement and operation of fake websites are targeting unsuspecting members of the public.\n“The National Centre for the Control of Small Arms and Light Weapons is currently not recruiting and has not engaged the services of any individual or recruitment agents to recruit on its behalf.\n“For the avoidance of doubt, the information on recruitment circulating on social media is fake and did not emanate from the Centre.\nConsequently, job seekers are advised to disregard the same."
  },
  {
    "headline": "Job racketeering: NCCSALW cautions job seekers against fraudsters -NigPilot",
    "summarized_story": "The National Centre for the Control of Small Arms and Light Weapons (NCCSALW) , on Friday, cautioned job seekers to beware of Job racketeers and fraudsters parading selves as a recruitment agent of the agency, saying that NCCSALW is currently not recruiting.\nIt also disclosed that the fraudsters involved in the illegal recruitment, fraudulent inducement and operation of fake websites are targeting unsuspecting members of the public.\n“The National Centre for the Control of Small Arms and Light Weapons is currently not recruiting and has not engaged the services of any individual or recruitment agents to recruit on its behalf.\n“For the avoidance of doubt, the information on recruitment circulating on social media is fake and did not emanate from the Centre.\nConsequently, job seekers are advised to disregard the same."
  },
  {
    "headline": "Buhari’s consistent consistency on NYSC -NigPilot",
    "summarized_story": "This year alone, much more than the last four decades of the existence of the institution of the National Youth Service Corps (NYSC), there have been nearly a dozen well-researched books that speak to the strategic essence of that national asset known as the National Youth Service Corps (NYSC).\nOne of the nine books on the NYSC inaugurated recently when the NYSC clocked 40 years is the National Youth Service Corps and National integration.\n‘‘For them (NYSC members) to be brought to the desert or near the Sahel region is a very difficult thing but it will make an impact on Nigeria.\nPresident Buhari gave the corps members two cows from his farm, 20 bags of rice and N1, 000,000 (one million naira).\nThe Director General of the National Youth Service Corps (NYSC), Brigadier General Ibrahim Shuaibu, last Thursday, visited Reverend Oluwole Adetiran, the composer of the NYSC anthem, at his Mowe-Ibafo residence in Ogun State."
  },
  {
    "headline": "Buhari’s consistent consistency on NYSC -NigPilot",
    "summarized_story": "This year alone, much more than the last four decades of the existence of the institution of the National Youth Service Corps (NYSC), there have been nearly a dozen well-researched books that speak to the strategic essence of that national asset known as the National Youth Service Corps (NYSC).\nOne of the nine books on the NYSC inaugurated recently when the NYSC clocked 40 years is the National Youth Service Corps and National integration.\n‘‘For them (NYSC members) to be brought to the desert or near the Sahel region is a very difficult thing but it will make an impact on Nigeria.\nPresident Buhari gave the corps members two cows from his farm, 20 bags of rice and N1, 000,000 (one million naira).\nThe Director General of the National Youth Service Corps (NYSC), Brigadier General Ibrahim Shuaibu, last Thursday, visited Reverend Oluwole Adetiran, the composer of the NYSC anthem, at his Mowe-Ibafo residence in Ogun State."
  },
  {
    "headline": "NASS insensitive to concerned Nigerians on PIB, Electoral Act – Senator Dickson -NigPilot",
    "summarized_story": "Senator representing Bayelsa West District in the National Assembly, Seriake Dickson, has described the recently passed Petroleum Industry Bill, PIB , and the Electoral Act (Amendment) Bill, 2021 by the parliament as offensive and insensitive to concerned Nigerians.\nDickson, who addressed journalists yesterday in Abuja over the perceived shortcomings in the two bills, however, warned that the approved three percent Host Communities Trust Fund in the PIB may lead to unrest in the Niger Delta region.\n“Might and majority do not build a diversified nation like Nigeria, but presence of justice, fairness.\nHe therefore appealed to President Muhammadu Buhari not to assent to the bill, but send it back for more consultation and required Inclusiveness in its proposals.\n“Fortunately a window of striking out that amendment is already provided by the House of Representatives which adopted the clause as originally proposed."
  },
  {
    "headline": "VIDEO: Tears, Joy As 28 More Kidnapped Students Regain Freedom In Kaduna",
    "summarized_story": "﻿ ﻿28 more abducted students of the Bethel Baptist Secondary School in Chikun Local Government Area of Kaduna State have regained their freedom.\nThe students were found inside the Tsoho Gaya Forest in Chikun Local Government Area of the state in the early hours of Sunday.\nIt is not clear whether the bandits released them for ransom or they were rescued by security operatives or escaped by themselves.\n121 students of Bethel Baptist secondary school in Chikun local government area of Kaduna state were abducted from their hotels by bandits on July 8.\nBut mass school abductions have soared this year, with almost 1,000 students kidnapped, according to UNICEF."
  },
  {
    "headline": "SERAP Sues Buhari Over Gag Order On Reporting Of Terrorist Attacks",
    "summarized_story": "The Socio-Economic Rights and AccountabilityProject (SERAP) and the Centre for Journalism Innovation and Development have filed a lawsuit against President Muhammadu Buhari and the Minister of Information and Culture, Mr Lai Mohammed, over the order stopping journalists and broadcast stations from reporting details of terrorist attacks and victims.\nThey are asking the court to declare the order as.\nJoined in the suit as Defendant, is the National Broadcasting Commission (NBC).\nThe suit followed the directive by the NBC, asking journalists, television and radio stations in Nigeria to stop “glamourising and giving too many details on the nefarious activities of terrorists and kidnappers” during their daily newspaper reviews.\nIn the suit number FHC/ABJ/CS/725/2021 filed last Friday, SERAP and PTCIJ are seeking: “an order of perpetual injunction restraining the government of President Buhari, the NBC, and Mr Lai Muhammed or any other persons from imposing fines or other sanctions on broadcast stations for carrying out their constitutional duties of reporting details of terrorist attacks and victims during daily newspaper reviews.”Read Also: ‘Information Blackout’: Nigeria Newspapers Campaign Against Media BillsThey are also seeking “an order to compel and direct the NBC and Mr Lai Muhammed to withdraw the directive asking journalists and broadcast stations to stop reporting details on terrorist attacks and victims, as the directive is unlawful and inconsistent with the Nigerian Constitution of 1999 [as amended], and the country’s international human rights obligations."
  },
  {
    "headline": "FG Extends NIN-SIM Verification Deadline To October",
    "summarized_story": "The Federal Government has approved the extension of the deadline for the National Identification Number (NIN)-SIM data verification to October 31.\nThis was disclosed in a statement jointly signed by the Head, Corporate Communications, Nigeria Identity Management, Mr Kayode Adegoke and Dr. Ikechukwu Adinde of the Nigerian Communications Commission, on Saturday.\nIt also followed a review of the progress of the exercise which indicated significant progress hence the need to consolidate the gains of the enrolment and NIN-SIM verification process across the country.\n“As at July 24th, 2021, there are over 5,500 enrolment systems within and outside the country and this would significantly ease the NIN enrolment process and subsequent linkage of NIN to SIM,” the statement read.\nHe thanked Nigerians for what he described as their patience and compliance with the directive on the NIN-SIM registration exercise so far."
  },
  {
    "headline": "Twelve Years of Terror: A Timeline Of The Boko Haram Insurgency",
    "summarized_story": "11 August 2013: Boko Haram kills 44 worshipers at a mosque in Konduga, Borno.\n﻿26 February 2014: Boko Haram murders at least 59 boys at the Federal Government College in Buni Yadi, Yobe state.\nMay 2015: Boko Haram renames itself the Islamic State’s West Africa Province (ISWAP)9 September 2015: The Nigerian military says it has destroyed all known Boko Haram terrorists’ camps and cells in the North-East.\n23 February 2021: Boko Haram kills 10 people in Maiduguri using rocket-propelled grenades.\nJune 2021: Boko Haram and ISWAP reportedly unite and pledge allegiance to one Aba Ibrahim Al-Hashimiyil AlKhuraishi."
  },
  {
    "headline": "Tunisian President Suspends Parliament, Sacks PM",
    "summarized_story": "Tunisian President Kais Saied announced Sunday the suspension of the country’s parliament and the dismissal of Prime Minister Hichem Mechichi following a day of protests against the ruling party.\nCar horns sounded after Saied made the announcement following an emergency meeting at his palace.\nIn the capital Tunis, hundreds of protesters had gathered in front of parliament, shouting slogans against the Islamist-inspired ruling Ennahdha party and premier Mechichi, with the crowd call for the “dissolution of parliament”.\nSaied said he would take over executive power “with the help” of a government headed by a new chief appointed by the president himself.\nSince Saied was elected president in 2019, he has been locked in a showdown with Mechichi and parliament speaker Rached Ghannouchi."
  },
  {
    "headline": "Just In: Bandits abduct dozens of travellers along Sokoto-Gusau highway",
    "summarized_story": "Bandits have again blocked Sokoto-Gusau road and abducted unspecified number of travellersThe bandits blocked the ever busy highway Sunday afternoon at about three o’clock along Dogon Karfe community and started shooting sporadically in the air forcing motorists to stopTVC News gathered that the victims are mostly passengers of three busses belonging to Sokoto state government known as state Transport AuthoritiesBandits had last Wednesday blocked the highway at same location and abduct twelve travellers but eleven were rescued by troops of the Zamfara state Police Command before they were taken to the bushPolice in Zamfara are yet to respond to the incident as the Spokesperson of the command is not responding to phone calls."
  },
  {
    "headline": "Trial of Igboho: Olubadan sends delegates to Benin Republic to monitor court proceedings",
    "summarized_story": "The Olubadan of Ibadan land, Oba Saliu Adetunji, has sent a delegation to Cotonou, Benin Republic to observe the proceedings of the court case involving Sunday Adeyemo, popularly known as Sunday Igboho.\nOba Adetunji disclosed this at his palace in Ibadan while exchanging views with some delegates who paid a visit to his palace.\nAlthough, the monarch did not disclose the identity of the delegation who are to observe the proceedings, but he assured that those to observe would be in court unfailingly tomorrow Monday.\nThe first class monarch stated that he is in constant touch with Yoruba prominent royal fathers, including Igboho royal crowns.\nOba Adetunji however urged the people to remain calm and law abiding as truth will prevail."
  },
  {
    "headline": "ECTDA arrests seven fake revenue collectors",
    "summarized_story": "The Enugu Capital Territory Development Authority, ECTDA, have arrested seven fake revenue collectors operating in Enugu North Local Government Area.\nThe ECTDA Executive Chairman, Mr. Josef Onoh, and a team of security operatives apprehended the phony revenue collectors on Friday.\nThey claimed to be employees of the state Ministry of Environment and Enugu North Local Government Area.\nCollecting property levy and other levies are illegal and against the law of Enugu State.\nWe don’t go on drive without team of security agents and don’t accept or collect cash because Enugu state have a single account where we pay."
  },
  {
    "headline": "Shanghai Cancels Flights as Typhoon In-Fa Lashes Eastern China",
    "summarized_story": "Two international airports in the Chinese city of Shanghai have cancelled all flights and authorities banned outdoor activities as Typhoon In-Fa lashed eastern China with high winds and heavy rains.\nHundreds of flights at Shanghai Pudong and Shanghai Hongqiao airports were canceled and more were expected to be canceled on Monday, state TV reported on its website.\nTrain service to Ningbo, a port city south of Shanghai, was also suspended, according to state TV.\nSchools, markets and businesses in Zhejiang province were ordered earlier to close.\nState TV said a ship lock in Nantong, which abuts Shanghai to the north, stopped releasing vessels into the Yangtze River."
  },
  {
    "headline": "‘Out Bolsonaro!’: More Protests in Brazil Over Covid Crisis",
    "summarized_story": "Protesters have taken to the streets across Brazil once more to demand far-right President Jair Bolsonaro step down over his government’s handling of the coronavirus pandemic as well as recent corruption allegations.\nThe far-right leader is under political pressure after questions surfaced about alleged irregularities in his government’s coronavirus vaccine procurement process, as well as accusations of past corruption.\n“What we have is a continuous loss of political support for the president,” Claudio Couto, a political scientist at the Getulio Vargas Foundation in Brazil, told Al Jazeera.\nCouto said while political will to impeach Bolsonaro is rising, the president retains considerable support in Congress.\nTo date, 17 percent of the Brazilian population is considered fully vaccinated while 44 percent have received the first of two jabs."
  },
  {
    "headline": "Tokyo Olympics: Tunisia’s Hafnaoui Wins Shock Swimming Gold",
    "summarized_story": "Tunisian swimmer Ahmed Hafnaoui took a shock gold medal in the men’s 400m freestyle on Sunday.\nIt was Tunisia’s fifth-ever gold – and third in swimming.\nIn 2019, he told Tunisian outlet La Presse he was aiming to win his first gold medal at the 2024 Olympic Games in Paris.\nHafnaoui will have a second shot at gold as he competes in the 800m freestyle, with heats starting on Tuesday.\n“I couldn’t go to the Rio Olympics, so for the past five years, this became a big dream for me."
  },
  {
    "headline": "Tokyo Olympics: Tennis World Number One Barty Stunned By Sorribes Tormo in First Round",
    "summarized_story": "World number one Ashleigh Barty was stunned by Sara Sorribes Tormo of Spain in the first round of women’s Olympics singles in Tokyo.\nAustralian Barty, who won her second Grand Slam title at Wimbledon in July, cut a frustrated figure in her 6-4 6-3 loss to 48th-ranked Sorribes Tormo.\nShe put in an error-strewn performance against Sorribes Tormo, making 55 unforced errors to the Spaniard’s 13.\n“It’s something I’ve been dreaming all my life, being here and, even more, beating a number one,” Sorribes Tormo said.\nSpain’s Carla Suarez Navarro claimed her first singles victory since her recovery from cancer as she beat Tunisia’s Ons Jabeur 6-4 6-1."
  },
  {
    "headline": "Thousands Protest in France, Italy, UK and Australia Amid Global Anger Against Covid Restrictions",
    "summarized_story": "“Freedom, freedom”, chanted demonstrators in France, carrying placards denouncing “Macron, Tyrant”, “Big Pharma shackles freedom” or saying “No to the pass of shame”.\nPeople in Rome, Naples and Turin chanted “freedom” and “down with the dictatorship” over plans for the so-called “green pass”.\nThe certificate will be needed from early next month to eat in restaurants and visit cinemas among other indoor activities.\nThousands of people have also protested in London, against what they describe as an erosion of their civil liberties.\nSeparately, in Indonesia and the UK, governments have pressed ahead with the easing of restrictions even in the face of surging infections."
  }
]