[
  {
    "headline": "Fayemi, Akeredolu absent as S’West leaders endorse ranching, state police",
    "summarized_story": "); a former governor of Ogun State, Aremo Segun Osoba; Minister of Industry, Trade and Investment, Otunba Niyi Adebayo, Pius Akinyelure, among others.\nThe communiqué reads partly, “For Nigeria to overcome these challenges, we must do so with unity of purpose and action.\n“We endorse the position of the southern governors taken at their May 11, 2021 summit in Asaba, Delta State, regarding ranching.\nEfforts to speak to Akeredolu’s Chief Press Secretary, Olabode Olatunde, and the state Commissioner for Information, Donald Ojogo, were not successful.\nBut the Senior Special Assistant to Governor Kayode Fayemi on Public Communication, Segun Dipe, said he did not know the governor’s itinerary."
  },
  {
    "headline": "How we foiled attempted kidnap, robbery by herdsmen along Akure/Ilesha highway – Police",
    "summarized_story": "THE Osun State Police Command on Sunday said its men, with the support of local security outfits, foiled an attempt by some suspected Fulani bandits to rob motorists along Ilesha/Akure expressway.\nIn a video obtained by The PUNCH, posted on the social media by a supporter of Yoruba nation, who claimed to have arrived at the scene of the attack few minutes after the assailants struck on Saturday, claimed that seven people were abducted by the suspected Fulani herdsmen.\nReacting to enquiries on the incident in a statement, the state Police Command spokesperson, Yemisi Opalola, said no one was abducted, even though attempt was made by some suspected Fulani bandits.\nOpalola said, “It is true that some suspected Fulani bandits came out of the bush and attempted to rob some motorists along Akure/Ilesha road, by Iwaraja on Saturday, 22nd May, 2021, at about 6:00pm, but for the quick intervention of the Police, JTF and other local security outfits.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "BOOK REVIEW: Akinyemi harps on man’s mental strength in Everybody Don Kolomental",
    "summarized_story": "Akinyemi weaves his exuberant latest collection of poems around the themes of depression and mental health problems.\nWith candour and verve, he captures the pain of living with mental illness in “Mental,” as he writes: “How do I find healing in tranquillity?\n“Therapy” examines the stigma associated with seeking help for mental health problems.\n“Therapist in Need of Therapy” studies mental health professionals’ struggles with mental illnesses.\nThe book’s title poem, “Everyday Don Kolomental” conveys resolve while maintaining a sort of crude optimism."
  },
  {
    "headline": "Open Grazing Ban: Southern Govs should factor good herders in their policy — Igbo Youths",
    "summarized_story": "The deduction from his comment on open grazing is clear.\n“Banning open grazing without a considered enabling environment for an average herder who is used to his primitive ways of cattle rearing would seem a policy which has to take away his means of livelihood.\n“With this arrangement on the ground, once the cows come in, herders should be given a place to stay with their cows.\nVillagers can now be provided employment by engaging them to supply grasses to these herders to feed their cows at a minimal cost.\nThis arrangement would also isolate the good herders from those carrying AK47 for kidnapping and other crimes."
  },
  {
    "headline": "Unknown gunmen attack INEC secretariat, police division in Anambra",
    "summarized_story": "Kindly Share This Story:Unknown gunmen Sunday evening attacked B Division of the Nigeria Police Divisional Station and the Independent National Electoral Commission (INEC) in Akwa, Anambra.\nThe News Agency of Nigeria (NAN) gathered that the fully armed attackers came in three Hilux trucks at about 8pm on Sunday, May 23.\nAn eyewitness who almost ran into the troubled area located in between the popular Ekwueme Square, Awka said the bandits shot into the air close to one hour at B Police Division before proceeding to INEC office.\nWhen contacted, Dr Nkwachukwu Orji, INEC Resident Electoral Commissioner in Anambra said he had received information on the attack in his office, but that he could not officially comment on the matter.\n“I need to get clear picture of what happened in my office before I can speak”, he said."
  },
  {
    "headline": "Ughelli King didn’t ask for ‘ground levy’— PG",
    "summarized_story": "And when it got to a critical position, we decided to meet HRM Ovie of Ughelli Kingdom to intervene and after several meetings.\nAlso read:“Initially they were collecting ground money N2,500 per cow, N1,000 per goat and N1,000 per pig.\n“The emphasis here is that this ground money is not part of the money they pay to buy these animals.\nIt is the buyers that pay the ground money and so we the ground owners said give us a small fraction and they are saying no.\nThis protest is Ill motivated and they have evil intention to destroy the image of the Ovie of Ughelli Kingdom."
  },
  {
    "headline": "Down with cancer, housewife begs for lifeline",
    "summarized_story": "Kindly Share This Story:By Kennedy MbeleMrs Olanrewaju Tunde Adegoke is critically ill after being diagnosed with cancer.\nTreatment started immediately after cancer was confirmed to shrink the tumour and it is stage 2 cancer.\nPeople generally believe cancer treatment can be painful and expensive.\nCancer treatment is actually very painful and expensive.\nDo you think the government is doing enough to help cancer patients in the country?"
  },
  {
    "headline": "Presidency shares Buhari’s discussion with late General Attahiru’s wife",
    "summarized_story": "President Muhammadu Buhari has described Lt. General Ibrahim Attahiru, the late Chief of Army Staff as an outstanding soldier and an institution builder.\nThe Nigerian President said General Attahiru fought valiantly for Nigeria until he breathed his last.\nGarba Shehu, the presidential spokesman, disclosed details of Buhari’s telephone conversation with Mrs. Fati Attahiru, in a statement Sunday night.\nBuhari hailed the sacrifices of the military men who lost their lives and the Armed Forces in general.\nThe President gave the grieving spouses assurances that the nation will never forget the supreme sacrifice of their spouses."
  },
  {
    "headline": "FG declares 63 Nigerians, 27 foreigners wanted",
    "summarized_story": "63 Nigerians and 27 foreigners have been declared wanted by the federal government over violation of COVID-19 guidelines.\nThe Secretary to the Government of the Federation (SGF) and Chairman Presidential Steering Committee (PSC) on COVID-19, Boss Mustapha disclosed this Sunday night."
  },
  {
    "headline": "Again, herders sack Taraba community, slaughter five",
    "summarized_story": "A source from the community who claimed he narrowly escaped the scene said apart from the five persons who were gruesomely murdered by the herders, several other persons were inflicted with various degrees of injuries.\nUkoo Abaa, a border community between Taraba and Benue States, as at the time of filing this report was said to have been deserted by the people for fear of further attacks.\nSince the beginning of the rainy season, communities in Taraba State have witnessed scores of unrests between herders and farmers who have continued to fight.\nA situation he says has relegated herders whom he described as bonafide “indigenes of this state” to the background.\nA top-ranking officer of the force who confided in DAILY POST appeared to affirm the speculations, saying “in the areas of logistics, the Taraba state government is doing nothing to assist us in arresting the situations.”"
  },
  {
    "headline": "Military Plane Crash: Aisha Buhari visits family of COAS, Ibrahim Attahiru (PHOTOS)",
    "summarized_story": "The wife of President Muhammadu Buhari, Aisha has visited the family of the late Chief of Army Staff, Lt. Gen. Ibrahim Attahiru.\nAisha Buhari sympathised with the Attahiru’s widow, Fati and the family of the deceased.\nShe visited the family at the Flag Staff House at Niger Barracks, Abuja, on Sunday.\nDisclosing her visit via Twitter, the First Lady described the death of the Army Chief and other military officers as a monumental loss to Nigeria.\nShe wrote: “I paid a condolence visit to the Family of the Late Chief of Army Staff, Lt. Gen. Ibrahim Attahiru."
  },
  {
    "headline": "Gunmen invade ‘B’ division police station in Awka",
    "summarized_story": "Report reaching DAILY POST has it that gunmen are currently operating at “B’ division police station in Awka, Anambra State.\nA source said the gunmen are shooting into the air currently, causing fear in the entire area as residents scamper for safety.\n‘B’ division police station is situated directly opposite the Jerome Udoji Secretariat in Awka, a three massive buildings housing civil service in the state.\nDetails of the attack is not yet clear, but a source said the area has been totally cordoned off.\nDetails soon…"
  },
  {
    "headline": "Serie A: Morata nets brace as Juve seal UCL place",
    "summarized_story": "Wojciech Szczesny went down to block a cross from Lorenzo De SilvestriFederico Chiesa broke the deadlock after just five minutes.\nAlvaro Morata doubled the Bianconeri’s lead and, just like, Chiesa, had just to put the ball inside an empty net.\nThe Spaniard’s goal game after a superb solo action by Paulo Dybala who dribbled past the defender and tried a lob shot that Morata helped in.\nJuventus had more chances with Chiesa, Morata and Dybala, while Szczesny blocked a Vignato shot.\nA Musa Barrow shot was parried by Carlo Pinsoglio while Dybala hit the post from a tight angle."
  },
  {
    "headline": "Serie A: AC Milan seal UCL return after win",
    "summarized_story": "AC Milan sealed a return to the Champions League for the first time in seven years as two Frank Kessie penalties earned a 2-0 victory over Atalanta, who also secured a top four finish.\nMilan got their chance to go ahead just before half time when Theo Hernandez played a smart one-two before being brought down by Joakim Mæhle, allowing Kessie to confidently slot home the penalty.\nADVERTISEMENTDespite a nervy finish, the Kessie fired another penalty home in stoppage time to secure second place with Atalanta taking third and Juventus taking fourth at the expense of Napoli who dramatically dropped out."
  },
  {
    "headline": "Teary Guardiola insists Man City cannot replace Aguero",
    "summarized_story": "An emotional Pep Guardiola claimed Manchester City ‘cannot replace’ Sergio Aguero after their all-time top scorer played his final Premier League game for the club.\nThe Argentine, who will leave City after 10 years in the summer when his contract ends, signed off in style with two goals in a 5-0 victory over Everton as he lifted his fifth Premier League trophy.\nADVERTISEMENTAguero’s 260 goals for City make him by far and away their leading scorer and despite allowing him to move on, Guardiola said his qualities as a player and person will be impossible to replicate in the future.\nWhen asked about Aguero, the teary Spaniard told Sky Sports: ‘We love him so much.\nHe is so nice, he is so nice."
  },
  {
    "headline": "VIDEO: I have not endorsed anyone for Lagos council poll, says Tinubu",
    "summarized_story": ""
  },
  {
    "headline": "Full list of 90 COVID-19 violators declared wanted by FG",
    "summarized_story": ""
  },
  {
    "headline": "Northern youths split over Malami’s opposition to open grazing ban",
    "summarized_story": "The group said it supported the position of Malami on open grazing.\n“Banning open grazing is automatically putting a stop to all these benefits and termination of many people’s source of livelihood.\nThus, we are highly disappointed and frown at the southern governors’ decision to ban open grazing.\nHe said: “We have taken time to study the communique issued by the southern governors, especially on the ban on open grazing.\n“We, also, condemn the statement credited to the Attorney General of the Federation on the ban on open grazing."
  },
  {
    "headline": "Attahiru, others died to keep Nigeria safe, says CAN",
    "summarized_story": "•Ishaku, speaker condole with army, Atahiru’s familyTaraba State Governor, Darius Ishaku, has condoled with the army and families of Chief of Army Staff (COAS) Gen. Ibrahim Attahiru and 10 other military officers who died in the Friday plane crash.\nThe death of the Chief of Army Staff and the other victims of the crash at this time has robbed the country of their contributions to this highly sought new strategy in the war against insecurity in Nigeria,” Ishaku said.\nHe prayed God to grant the souls of the late military officers peaceful rest and their families the fortitude to bear these monumental losses.\nIn a related development, Speaker of the state’s House of Assembly, Prof. Joseph Albasu Kunini, also described the death of the COAS and other military officers as “worrisome and heartbreaking loss”.\nIn the last three months or so, we have witnessed three military plane crashes with collateral losses."
  },
  {
    "headline": "Okorocha did not give us N500m –IPOB",
    "summarized_story": "From Stanley Uzoaru, OwerriIndigenous People of Biafra (IPOB) has exonerated former Imo governor, Rochas Okorocha, from the accusation that he gave the group N500 million.\nHowever, Media and Publicity Secretary of the group, Emma Powerful, in a statement, yesterday, said both lUzodimma and Okorocha lacked the financial capacity to finance the group.\n“We, therefore, wish to clarify that we never received any financial payment, donation or gift from Okorocha, we have nothing to do with traitors like Okorocha and Uzodimma.\nThe truth remains that both Okorocha and Uzodima cannot bankroll IPOB.\n“Other politicians that may have sabotaged IPOB and Eastern Security Network may be forgiven, but Okorocha, Uzodimma, and the Rivers State Governor, Nyesom Wike, will never be forgiven."
  },
  {
    "headline": "Breaking: COAS, others death: Buhari orders flag flown at half -mast",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has ordered flag to be flown at half-mast in honour of Lt. General Ibrahim Attahiru, the late Chief of Army Staff and 10 others who died in the Friday air crash.\nIn a statement by Secretary to the Government of the Federation Boss Mustapha, the flag is to be flown in all public buildings, facilities and official residences from Monday, May 24 to Wednesday, May 26th.\nBuhari has also approved Monday as work free say for members of the Armed Forces."
  },
  {
    "headline": "Tanker Explosion injures 48 persons, 8 fire officers in Kano",
    "summarized_story": "From Desmond Mgboh, KanoNo fewer than 56 people were injured following an explosion by a petroleum tanker which occurred at Sharada Phase 1 area of Kano State.\nDaily Sun gathered that the tanker with registration number NSR183 XW was carrying a total of 6600 liters of fuel when it exploded and overwhelmed the whole environment.\nAccording to the Public Relations Officer, Kano Fire Service, SaminuYusuf Abdullahi, 56 peoplr including eight firemen sustainedvarious degrees of burn as a result of the explosion adding that the explosion was caused procedural error while off loading its content.\nHe said thst one Ahmef Mohammed, aged 26.ignorantly opened up one of the tankets compartment ,a situation which ignited the fire .\nKano Secretary General of the Nigerian Red Cross Society, Alhaji Musa Abdullahi said thst the Emergency First Aid Team of the Red Cross promptly responded and evacuated 72 affected victims to Murtala Muhammad Specialists Hospital, Kano for medical attentionHe added that Seven Red Cross Volunteers actively participated in the operation."
  },
  {
    "headline": "Breaking: FG Revokes Visas of 27 Indians, Declares 63 Nigerians Persons of Interest",
    "summarized_story": "The Chairman Presidential Steering Committee (PSC) on COVID-19 and Secretary to the Government of the Federation, Mr Boss Mustapha, announced the measures against the passengers in a public statement issued on Sunday.\nHe said the violators arrived in Nigeria through the Murtala Mohammed International Airport, Lagos and Nnamdi Azikwe International Airport, Abuja between May 8 and 15, 2021.\nIn the list released by the PSC, 90 persons from Nigeria and India were found to have violated the Health Protection Regulations after arriving in Nigeria from restricted countries.\nThe PSC stated that the indiscretion of the persons of interests constituted an immediate health hazard to the society.\nIt subsequently warned the violators to report to the nearest public health departments within 48 hours for immediate evaluation."
  },
  {
    "headline": "Buhari Phones Attahiru’s Widow, Says Death of Army Chief, 10 Others Will Not be in Vain",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari on Sunday evening commiserated on phone with Mrs Fatima Attahiru and the wives of the other 10 military officers and soldiers over the death of Chief of Army Staff (COAS), Lt General Ibrahim Attahiru and others in the ill fated plane crash in Kaduna last Friday evening.\nPresidential spokesman, Garba Shehu, in a release on Sunday evening, said the President in the course of the telephone conversation with Attahiru’s wife described late General Attahiru, as an outstanding soldier and an institution builder, who fought valiantly for Nigeria until he breathed his last.\nHe gave the grieving spouses assurances that the nation will never forget the supreme sacrifice of their spouses, urging them to take solace in the surge of extraordinary feelings of emotions across regions, religions and tribes all over the country in appreciation of their sacrifices.\nMrs Attahiru, on behalf of the rest of the families thanked the President for the love and care he has shown to them.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "South-West APC Leaders Endorse Southern Govs’ Ban on Open Grazing, Call for True Federalism",
    "summarized_story": "The leaders also endorsed the position of southern governors on open grazing, saying besides reducing the tension between herders and farmers, it will minimise the friction in the country.\n“True federalism and the reallocation of resources and authority that comes with it will empower the states to solve localized issues before they spread and transform into national ones.\nTerrorism and violent criminality threaten many areas, adversely affecting the lives and livelihoods of too many innocent and peace-loving Nigerians.\n“For Nigeria to overcome these challenges, we must do so with unity of purpose and action.\n“We restate our abhorrence of violence as a means to achieve either political or economic power and influence."
  },
  {
    "headline": "Nigeria’s GDP Records 0.51% Growth in Q1",
    "summarized_story": "By James Emejo in AbujaNigeria’s real Gross Domestic Product (GDP) grew by 0.51 per cent in the first quarter of the year (Q1 2021) compared to 0.11 per cent in Q4 2020 & 1.87 per cent in Q1 2020, the National Bureau of Statistics (NBS) said Sunday.\nOil GDP contracted -2.21 per cent in Q1 compared to a contraction of 19.76 per cent in Q4 2020 and growth of 5.06 per cent in Q1 2020According to the GDP estimates for Q1 2021, which was released by the statistical agency, non-oil GDP grew 0.79 per cent in Q1 compared to 1.69 per cent in Q4.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari: Attahiru was a Brave Soldier Who Led from the Front",
    "summarized_story": "“Lieutenant General Attahiru was an epitome of gallantry and bravery which culminated in his being appointed the chief of army staff.\n“He led the Nigerian Army from the front and was emulated by others.\nHouse Mourns Army Chief, Attahiru, OthersMembers of the House of Representatives have expressed sadness over the death of Chief of Army Staff, Lt. Gen. Ibrahim Attahiru and his entourage in an air crash in Kaduna.\nFemi Gbajabiamila, in a statement described as shocking and sad the death Attahiru and others involved in the plane crash.\nThe Speaker sent his condolences to President Muhammadu Buhari, the Nigerian military, and the Attahiru family over the loss."
  },
  {
    "headline": "Tension As Vice-President, Osinbajo Is Sighted At Reddington Hospital",
    "summarized_story": "There is unexplained tension as the Vice President, Yemi Osinbajo, was seen at the Reddington Hospital, Lagos on Saturday.\nHis presence at the hospital raised questions as to the reason the number two citizen was there.\nYemi OsinbajoAccording to a report by Boss newspaper, the panic that trailed the VP’s presence at the Reddington Hospital worsened, following his absence at the funeral ceremonies of the late Chief of Staff, Lt General Ibrahim Attahiru and 10 other officers, who died in the ill-fated military aircraft that crashed in Kaduna.\nIt was gathered that the Vice President’s convoy was seen entering Reddington Hospital Lagos on Saturday around 10 am and remained there till around 2 pm.\nSince it is not in the Vice President’s character to miss occasions of great magnitude, people who know him well have become quite baffled, and asking the question regarding to state of health."
  },
  {
    "headline": "Tension As Vice-President, Osinbajo Is Sighted At Reddington Hospital",
    "summarized_story": "There is unexplained tension as the Vice President, Yemi Osinbajo, was seen at the Reddington Hospital, Lagos on Saturday.\nHis presence at the hospital raised questions as to the reason the number two citizen was there.\nYemi OsinbajoAccording to a report by Boss newspaper, the panic that trailed the VP’s presence at the Reddington Hospital worsened, following his absence at the funeral ceremonies of the late Chief of Staff, Lt General Ibrahim Attahiru and 10 other officers, who died in the ill-fated military aircraft that crashed in Kaduna.\nIt was gathered that the Vice President’s convoy was seen entering Reddington Hospital Lagos on Saturday around 10 am and remained there till around 2 pm.\nSince it is not in the Vice President’s character to miss occasions of great magnitude, people who know him well have become quite baffled, and asking the question regarding to state of health."
  },
  {
    "headline": "Council Polls: Oyo Speaker's Security Guard Allegedly Kills Two, Youths Burn Lawmaker's Bus",
    "summarized_story": "The death of the victims led to a mob attack on the vehicle of the Speaker, which was set ablaze.\nThe name of one of the victims was given as Ebenezer, a security officer at The Ibarapa Polytechnic, Eruwa.\nSome online reports said on Saturday that the victims were hit by stray bullets from the guns of Customs officials.\nMeanwhile, the State Secretary of PDP, Wasiu Adeleke, has described the election as victory for the loyal supporters of the party.\nPDP in Oyo State is proud of you and once again, we say congratulations to you all.\""
  },
  {
    "headline": "Council Polls: Oyo Speaker's Security Guard Allegedly Kills Two, Youths Burn Lawmaker's Bus",
    "summarized_story": "The death of the victims led to a mob attack on the vehicle of the Speaker, which was set ablaze.\nThe name of one of the victims was given as Ebenezer, a security officer at The Ibarapa Polytechnic, Eruwa.\nSome online reports said on Saturday that the victims were hit by stray bullets from the guns of Customs officials.\nMeanwhile, the State Secretary of PDP, Wasiu Adeleke, has described the election as victory for the loyal supporters of the party.\nPDP in Oyo State is proud of you and once again, we say congratulations to you all.\""
  },
  {
    "headline": "BREAKING: 90 Travellers Declared Wanted, Tagged ‘Persons Of Interest’ For Violating COVID Protocol",
    "summarized_story": "The presidential steering committee on COVID-19 has declared 90 travellers as ‘persons of interest’ for violating the protocol for passengers arriving Nigeria from selected countries.\nIn a statement issued on Sunday, the PSC said it will sanction the travellers by disabling their passports for a year, while foreigners visa will be cancelled.\nThey have been mandated to report to the nearest government health facility within the next 48 hours.\nThe statement read, “Members of the public are by this notice advised that these persons of interest constitute an immediate health hazard to the society.\n“The PSC shall, in addition, take further steps to sanction these violators."
  },
  {
    "headline": "fiancée of pilot killed in Kaduna crash pens touching tribute",
    "summarized_story": "Bunmi Oladuntoye, fiancée of Taiwo Olufemi Asaniyi, the pilot who flew the military aircraft that crashed in Kaduna state, has penned a touching tribute to her late lover.\nThe deceased and Oladuntoye were said to have scheduled their wedding for October later in the year before the tragic incident.\nAdvertisementShe also described the late flight lieutenant as a man of charming personality who brought her happiness and also encouraged her.\nTo Nigerians and the world at large, my fiancé, flight lieutenant to Asaniyi was a great man who dedicated his life to serving this country,” she added.\n“To Nigerians and the world at large, my fiancé flight lieutenant to Asaniyi was a great man who dedicated his life to serving this country."
  },
  {
    "headline": "fiancée of pilot killed in Kaduna crash pens touching tribute",
    "summarized_story": "Bunmi Oladuntoye, fiancée of Taiwo Olufemi Asaniyi, the pilot who flew the military aircraft that crashed in Kaduna state, has penned a touching tribute to her late lover.\nThe deceased and Oladuntoye were said to have scheduled their wedding for October later in the year before the tragic incident.\nAdvertisementShe also described the late flight lieutenant as a man of charming personality who brought her happiness and also encouraged her.\nTo Nigerians and the world at large, my fiancé, flight lieutenant to Asaniyi was a great man who dedicated his life to serving this country,” she added.\n“To Nigerians and the world at large, my fiancé flight lieutenant to Asaniyi was a great man who dedicated his life to serving this country."
  },
  {
    "headline": "Buhari calls Attahiru's wife, says late army chief was an outstanding soldier",
    "summarized_story": "President Muhammadu Buhari has condoled with Fati, wife of late Ibrahim Attahiru, chief of army staff, via a telephone call.\nAdvertisementAttahiru and 10 other military officers died in an air crash near the Kaduna international airport on Friday.\nIn a statement on Sunday, Garba Shehu, presidential spokesman, said the president described the army chief as an outstanding soldier who fought valiantly for Nigeria until his death.\nAdvertisement“President Muhammadu Buhari has described Lt. General Ibrahim Attahiru, the late Chief of Army Staff as an outstanding soldier and an institution builder, who fought valiantly for Nigeria until he breathed his last,” Shehu said in the statement.\n“Mrs Attahiru, on behalf of the rest of the families, thanked the President for the love and care he has shown to them,” Shehu said."
  },
  {
    "headline": "Buhari calls Attahiru's wife, says late army chief was an outstanding soldier",
    "summarized_story": "President Muhammadu Buhari has condoled with Fati, wife of late Ibrahim Attahiru, chief of army staff, via a telephone call.\nAdvertisementAttahiru and 10 other military officers died in an air crash near the Kaduna international airport on Friday.\nIn a statement on Sunday, Garba Shehu, presidential spokesman, said the president described the army chief as an outstanding soldier who fought valiantly for Nigeria until his death.\nAdvertisement“President Muhammadu Buhari has described Lt. General Ibrahim Attahiru, the late Chief of Army Staff as an outstanding soldier and an institution builder, who fought valiantly for Nigeria until he breathed his last,” Shehu said in the statement.\n“Mrs Attahiru, on behalf of the rest of the families, thanked the President for the love and care he has shown to them,” Shehu said."
  },
  {
    "headline": "Kaduna crash: Buhari directs flags to fly at half-mast for three days",
    "summarized_story": "President Muhammadu Buhari has ordered flags to be flown at half-mast in honour of Ibrahim Attahiru, the chief of army staff, and 10 other officers who died in an air crash in Kaduna.\nAdvertisementThe 11 officers were on board a military aircraft which crashed near the Kaduna international airport on Friday.\nThe officers were buried at the national military cemetery in Abuja on Saturday.\nAdvertisementAccording to a statement issued on Sunday by Boss Mustapha, secretary to the government of the federation, the directive on the flags is to be carried out in all public buildings and official residences for three days.\n“Similarly, the President has also approved a work-free day for members of the Armed Forces on Monday, 24th May, 2021.”"
  },
  {
    "headline": "NCC plans to deploy Device Management System to prevent phone theft",
    "summarized_story": "Two weeks after the Nigerian Communications Commission (NCC) said it had issued 54 million people their national identity numbers, it is in the process of deploying a Device Management System (DMS).\nA Device Management System will take this step even further, allowing the government even more access to what should be private information.\nWhen there’s a central registry for IMEI, the police could identify the owners of lost and stolen phones thousands of times daily.\nA critical part of this paper argues for a central database of mobile phones that law enforcement agencies presumably can access.\n*An earlier version of this report stated that the NCC asked telcos to register the IMEI numbers of their subscribers; the NCC has now clarified its position"
  },
  {
    "headline": "How to build high-performance teams with Chichi Offodile and Seni Sulyman",
    "summarized_story": "In what can be termed a mini-MBA session, Seni Sulyman and Chichi Offodile in an edition of TechCabal Live shared expert advice on how to build high-performance teams.\nTheir Journey at Helium Health and AndelaThe conversation begins with Chichi and Seni talking about their journeys at Helium Health and Andela respectively.\nHer strength lies in figuring out how to build a sustainable company and that’s what she set out to do via a transformation plan.\nBoth Seni and Chichi believe that it starts with hiring people with the potential to be high achievers and then setting a good example as a leader.\nHe ends with a caveat – it’s a little difficult to build a high-performing team without working really hard."
  },
  {
    "headline": "Stax wants you to enjoy USSD with better design, without ever dialling codes again",
    "summarized_story": "—Most people who started using mobile phones in the 2000s became familiar with USSD through loading and checking airtime balance.\nMaking USSD smartStax is a mobile app currently available only to Android users in 10 countries, including Nigeria, Uganda, Kenya and Tanzania.\nWhen a user gives Stax access, the app activates a screen reading functionality and acts as a web browser.\nStax wants the app to be under 10MB so that it will work easily on every (Android) phone.\nWith a large user base, Stax could begin enabling discovery and access to third party services, in what could make Stax a super app of sorts."
  },
  {
    "headline": "Are you ready to Branch in?",
    "summarized_story": "Here are a few more things that sets Branch apart from both your regular banking and other financial apps.\nBonus programs: Most financial apps have some form of bonus program but none of them is like Branch.\nWhereas other financial apps pay one-time bonuses for referrals, Branch pays you N500 when friends you refer pay up their first loan.\nThe money part: Branch gives you up to N500,000 in loans within seconds of applying on the app.\nClearly, Branch offers you more flexibility and a lot more profit than other financial apps."
  },
  {
    "headline": "Founders of TradeDepot selected as Endeavor Entrepreneurs",
    "summarized_story": "Fast-growing retail distribution platform in Africa joins the leading global entrepreneur support organizationLagos, May 20 — Endeavor Nigeria has welcomed three new entrepreneurs into its global network.\nOnyekachi Izukanne, Michael Ukpong, and Ruke Awaritefe, the co-founders of TradeDepot, were selected as Endeavor Entrepreneurs on May 18, 2021, at the 15th Virtual International Selection Panel (v-ISP #15).\nThe Endeavor network includes some of the world’s most exciting scale-up entrepreneurs and most experienced mentors and investors.\nTo date, Endeavor has screened more than 60,000 individuals and selected more than 2,000 founders leading over 1,200 scale-up companies.\nIn Nigeria, we aim to select 4-6 companies a year and today there are 19 Endeavor Entrepreneurs who are leading 11 companies in the portfolio."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "App review – How does Bitnob work?",
    "summarized_story": "At first glance, the Bitnob app feels fantastic, with a simple UI and easy-to-find functions.\nGetting started with BitnobLet’s begin with the onboarding processAdvertisementCreating a new account on BitnobSetting up your Bitnob app begins with installing it from your app store.\nTo protect its users, Bitnob doesn’t let you buy BTC straight from your bank account.\nYou simply paste their address or scan their Bitnob BTC wallet address.\nFinal thoughtsOverall, the Bitnob app delivers an impressive performance."
  },
  {
    "headline": "App review – How does Bitnob work?",
    "summarized_story": "At first glance, the Bitnob app feels fantastic, with a simple UI and easy-to-find functions.\nGetting started with BitnobLet’s begin with the onboarding processAdvertisementCreating a new account on BitnobSetting up your Bitnob app begins with installing it from your app store.\nTo protect its users, Bitnob doesn’t let you buy BTC straight from your bank account.\nYou simply paste their address or scan their Bitnob BTC wallet address.\nFinal thoughtsOverall, the Bitnob app delivers an impressive performance."
  },
  {
    "headline": "Does the Nigerian government want safety or surveillance with its new IMEI policy?",
    "summarized_story": "From July 2021, the Nigerian Communications Commission (NCC) will require Nigerians to submit their IMEI numbers to a Centralised Equipment Identity Register.\nThe International Mobile Equipment Identity (IMEI) is a unique number used to identify a mobile phone.\nWith an IMEI number, a phone can be tracked, but more than that, it can also be used for identity theft and even cloning a phone.\nAdvertisementIf a phone owner possesses their IMEI number, they could provide law enforcement agencies with this information to track these phones if they are stolen.\nAdding IMEI data to this would mean that they can also get real-time location data on anyone."
  },
  {
    "headline": "News",
    "summarized_story": "The past few days have seen the value of cryptocurrencies take a massive dip, which is said to have stemmed from Elon Musk’s tweet.\nWhile this is not the worst crash the market has witnessed, how shou…"
  },
  {
    "headline": "Nigeria’s Q1 GPD numbers show poverty still on the rise",
    "summarized_story": "There were no surprises in the latest GDP numbers for Nigeria published by the National Bureau of Statistics (NBS) on Sunday.\nRead Also: Nigeria needs 14% of GDP to meet SDG by 2030, says IMF Africa’s largest economy expanded at a tepid 0.51 percent in the first quarter of 2021, a rate too slow to reduce…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "The Week Ahead",
    "summarized_story": "AGRICULTURECocoa prices are expected to decline in the coming week as a result of weak demand from Europe.\nHowever, Corn prices climbed by 1.49% Week on Week (W-o-W).\nMore of the same is expected in the week ahead as the Naira is anticipated to continue to hover around N406/$1-N412/$1 threshold.\nThe Nigerian Treasury Bills market continued its bearish sentiment for most of the previous week, however, the sentiments improved slightly at the end of the week.\nNIGERIAN CAPITAL MARKET OUTLOOKIn the coming week, we expect a likelihood of undulating trading sessions during the week."
  },
  {
    "headline": "How National Assembly’s blind loyalty to presidency destroys separation of powers",
    "summarized_story": "But National Assembly played their role; the electoral body played its role appropriately and the country was saved from going into crisis.\nIn Nigeria’s case, the nation’s Judiciary and National Assembly are extension of the Executive.\nOn a number of occasions, the National Assembly had discussed the seriousness of the insecurity situation in the country.\nA National Assembly that worth its salt protects the interest of the masses by prevailing on the Executive to do what is right.\nSome, out of mischief, describe the National Assembly as a rubber stamp, some out of misunderstanding."
  },
  {
    "headline": "Residents excited with progress on 8.3km Ekehuan Road dualisation project … As contractor commences asphalting of road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestResidents in Benin City have commended the Governor Godwin Obaseki-led administration for the progress of work on the 8.3km Ekehuan Road dualisation project.\nA cross section of residents who spoke to journalists at the weekend, said the timely completion of the road project will fast track economic development along the road, which is the major link road to the Benin River Port project.\n“With the pace of work, we are confident that a good part of the 8.3km road will be open to motorists.\nThe state government should ensure that contractors handling the project move faster in delivering the project.\nA part of the road project includes an underground drainage system, which on completion, will tackle flooding problems in the area."
  },
  {
    "headline": "COVID-19: Edo govt urges vaccination, compliance with guidelines to contain pandemic – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has reiterated the need for residents to get vaccinated against coronavirus (COVID-19) and continue to comply with all preventive protocols to contain the pandemic in the state.\nEdo State COVID-19 Incident Manager, Dr. Andrew Obi, who gave the charge while speaking to journalists in Benin-city, said the state has continued to record success in the management of the pandemic.\nObi, who urged residents to support the government’s efforts at curbing the spread of the virus to ensure a total victory over the pandemic, reassured that the Governor Godwin Obaseki-led administration will continue to deploy resources to check the spread of the pandemic and protect residents across all communities in the state.\n“We urge everyone to support the government’s efforts at containing the pandemic by complying with guidelines to curtail the spread of the virus.\nHe charged residents with any COVID-19 symptoms to contact the Edo Emergency Operation Centre on this toll-free number: 08003625000 for assistance."
  },
  {
    "headline": "German govt firms collaboration with FG, Obaseki, Oba of Benin on return of Benin artefacts – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Director General for Culture and Communication in the German Foreign Ministry, Dr. Andreas Gorgen, has maintained that the German Government has acknowledged the looting of Benin artefacts and is committed to its return and restoration.\n“We express our gratitude to Governor Godwin Obaseki, the Federal Government and the Oba of Benin who have granted us an audience on this issue.\nIt’s a historical day for me as well, as I saw the tradition and culture of the Benin people.\nWe are happy that the objects will return to this museum and back to Nigeria.\nWe want to support you in capacity building, training, education, and learn from you the knowledge of the Benin Bronze.”..."
  },
  {
    "headline": "Examining the causes of rampant plane crashes – Nigerian Observer",
    "summarized_story": "“It was the wind shear and the government put in money to install wind shear system in all international airports.\n“I think if I am not making mistake, somewhere along he line, all airports were installed with wind shear system.\n“My worry is that are we sure the wind shear system in Kaduna airport is working,?” he asked.\nWind shear, sometimes referred to as wind gradient, is a difference in wind speed or direction over a relatively short distance in the atmosphere.\n“However, globally, there are three or four reasons that are attributed to air crashes in any part of the world."
  },
  {
    "headline": "COVID-19: Nigeria declares 90 travellers as ‘health hazards’",
    "summarized_story": "ADVERTISEMENTNigerian government has publicly declared a total of 90 travellers who recently visited or arrived from India, Brazil and Turkey, as potential health hazards to the society and seek their whereabouts.\nAccording to the statement, the list, which contains a total of 27 Indians and 63 Nigerians, arrived Nigeria through the Muritala Muhammed International Airport in Lagos and Nnamdi Azikiwe International Airport in Abuja, the Federal Capital Territory.\nAccording to the PSC, while the affected airlines are Ethiopian airline and Qatar airways, the 27 Indian violators were categorised as unregistered.\nThese precautionary measures are a necessary step to mitigate the risk of importation of variants of concern and break the chain of transmission to the population.\n“The Presidential Steering Committee (PSC) has, however, observed that while most of the arriving passengers dutifully observed the guidelines, some (Nigerians and foreigners) have violated them in contravention of the provisions of the CORONAVIRUS (COVID-19) HEALTH REGULATIONS PROTECTION, 2021."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "SEC adopts sustainable finance guidelines for capital market operators",
    "summarized_story": "The Securities and Exchange Commission (SEC), says it has adopted the Nigerian Sustainable Finance Principles (NSFP) which was developed by the Financial Services Regulation Coordinating Committee (FSRCC) for Capital Market Operators (CMOs).\nThe commission in a statement in Abuja on Sunday, said that the objectives of the guidelines were to stimulate a resilient, competitive and sustainable market that would promote economic development.\nIt said it will also help in accessing affordable capital market products by the economically less privileged.\nAccording to the Commission, the guidelines and approach were principle-based and therefore do not prescribe specific implementation requirements.\nSEC, however, listed its regulated entities to include CMOs, Trade Groups, Self-Regulated Organisations (SROs) and Capital Trade Points"
  },
  {
    "headline": "How LG is Championing SDGs through Environmentally Friendly Products and Collaboration",
    "summarized_story": "According to Mr. IL Hwan Lee, President, LG Electronics, Middle East & Africa Region, LG is committed to the triple bottom line of people, planet and profit.\n“As a responsible global corporate citizen, LG Electronics is set to contributing to the achievement of the SDGs as the main goal of its social contribution activities.\nSome of such that promote eco-friendly society include LG DUAL Inverter, LG NeON 2, LG WashTower and the CordZero M9 robot vacuum cleaner.\nLG Electronics continuously develops and implements initiatives that contribute to achieving these 5 SDGs, and monitors the progress.\nTo fulfill this commitments, LG Electronics is improving the life of its customers by providing more easy-t-use products applied with AI and future technology."
  },
  {
    "headline": "LG HVAC Tech earns international certifications for indoor air quality",
    "summarized_story": "Bamidele BamikeCommercial air conditioning technology from LG Electronics has garnered a number of recognitions from trusted international organizations for its ability to improve indoor air quality, the company has said.\nCertifications from Intertek, TÜV Rheinland and Underwriters Laboratories (UL) awarded to LG Dual Vane Cassette system are confirmation of the effectiveness of LG HVAC solutions in delivering clean air, LG said in a statement.\nThe LG DUAL Vane Cassette is the world’s first HVAC solution to receive UL’s GREENGUARD Gold Certification for low volatile organic compound (VOC) emissions.\nFor these reasons alone, LG DUAL Vane Cassette is the ideal option for use in schools and healthcare facilities where air quality is of utmost priority.\n2 What’s more, LG Dual Vane Cassette’s air-cleansing and allergen-removing capabilities are also certified by the British Allergy Foundation."
  },
  {
    "headline": "Nigeria’s economy grows by 0.51% in Q1, 2021",
    "summarized_story": "OBINNA EZUGWUNigeria’s gross domestic product (GDP) increased by 0.51 percent in the first quarter of 2021, an improvement from 0.11 percent increase in the fourth quarter of 2020.\n”The Q1’21 growth rate was slower than the 1.87 percent growth rate recorded in Q1’20 but higher than 0.11 percent recorded in Q4’20, indicative of a slow but continuous recovery.\n“Nevertheless, quarter on quarter, real GDP grew at -13.93 percent in Q1’21 compared to Q4’20, reflecting a generally slower pace of economic activities at the start of the year.\nCompared to Q4 2020 which recorded –19.76 percent growth rate, growth in Q1’21 was higher by 17.6 percent points.\n“Quarter-on-quarter, the oil sector recorded a growth rate of 35.65% in Q1 2021."
  },
  {
    "headline": "Buhari Calls Late Attahiru’s Wife, Other Victims’ Spouses",
    "summarized_story": "President Muhammadu Buhari has described Lt. General Ibrahim Attahiru, the late Chief of Army Staff as an outstanding soldier and an institution builder, who fought valiantly for Nigeria until he breathed his last.\nIn a telephone conversation on Sunday evening with Mrs. Fati Ibrahim Attahiru, the wife of the late COAS and the spouses of the other deceased officers through her, President Buhari in a statement by his media aide, Garba Shehu hailed the sacrifices of the military men who lost their lives and the Armed Forces in general, saying that Nigerians will continue to appreciate and support the fearlessness with which our courageous soldiers are confronting the threats facing the nation.\nHe gave the grieving spouses assurances that the nation will never forget the supreme sacrifice of their spouses, urging them to take solace in the surge of extraordinary feelings of emotions across regions, religions and tribes all over the country in appreciation of their sacrifices.\nThe President, who had earlier given directives to the Defence Headquarters and the Ministry of Defence to do everything a government can do to provide comfort and ease the hardships of the families of the deceased, prayed to Almighty God to repose their souls and grant their families the fortitude to bear the losses.\nMrs Attahiru, on behalf of the rest of the families thanked the President for the love and care he has shown to them."
  },
  {
    "headline": "Buhari Calls Late Attahiru’s Wife, Other Victims’ Spouses",
    "summarized_story": "President Muhammadu Buhari has described Lt. General Ibrahim Attahiru, the late Chief of Army Staff as an outstanding soldier and an institution builder, who fought valiantly for Nigeria until he breathed his last.\nIn a telephone conversation on Sunday evening with Mrs. Fati Ibrahim Attahiru, the wife of the late COAS and the spouses of the other deceased officers through her, President Buhari in a statement by his media aide, Garba Shehu hailed the sacrifices of the military men who lost their lives and the Armed Forces in general, saying that Nigerians will continue to appreciate and support the fearlessness with which our courageous soldiers are confronting the threats facing the nation.\nHe gave the grieving spouses assurances that the nation will never forget the supreme sacrifice of their spouses, urging them to take solace in the surge of extraordinary feelings of emotions across regions, religions and tribes all over the country in appreciation of their sacrifices.\nThe President, who had earlier given directives to the Defence Headquarters and the Ministry of Defence to do everything a government can do to provide comfort and ease the hardships of the families of the deceased, prayed to Almighty God to repose their souls and grant their families the fortitude to bear the losses.\nMrs Attahiru, on behalf of the rest of the families thanked the President for the love and care he has shown to them."
  },
  {
    "headline": "Reps Mull Legal Protection For Patents, Utility Models, Designs",
    "summarized_story": "The House of Representatives has passed for a second reading, a Bill seeking to strengthen the legal protection of inventions such as patents, utility models, and designs in Nigeria.\nOluga Taiwo, also seeks to repeal the Patents Design Act of 1971 and re-enact the Patents and Designs Act, 2019, to bring about an upgrade in the body of laws governing patents, designs and utility models in the country.\nEarlier, Oluga in her lead debate on the Bill noted that the 1971 Act does not recognise utility models as a type of patent or class of intellectual property in Nigeria.\nThis, according to her, is in contravention of the International Legal Instruments on Intellectual Property.\nA strong system of intellectual property rights is indispensable to technological development and advancement."
  },
  {
    "headline": "Reps Mull Legal Protection For Patents, Utility Models, Designs",
    "summarized_story": "The House of Representatives has passed for a second reading, a Bill seeking to strengthen the legal protection of inventions such as patents, utility models, and designs in Nigeria.\nOluga Taiwo, also seeks to repeal the Patents Design Act of 1971 and re-enact the Patents and Designs Act, 2019, to bring about an upgrade in the body of laws governing patents, designs and utility models in the country.\nEarlier, Oluga in her lead debate on the Bill noted that the 1971 Act does not recognise utility models as a type of patent or class of intellectual property in Nigeria.\nThis, according to her, is in contravention of the International Legal Instruments on Intellectual Property.\nA strong system of intellectual property rights is indispensable to technological development and advancement."
  },
  {
    "headline": "Kwara Uncovers Alleged Unlawful Payment To 48 Disengaged Teachers",
    "summarized_story": "Kwara State governor, AbdulRahman AbdulRazaq, has received a report of the committee that investigated the unlawful salary payment to 48 disengaged sunset teachers for the month of March, 2021.\nAbdulRazaq had set up a three-man committee to probe revelations that some of the teachers who were disengaged in December 2020 were paid in March, 2021.\nSpeaking at the submission of the committee’s report, the governor insisted that the “integrity of the payroll of the state government was very important to us.\nGovernment will look into it and take appropriate action.”The committee’s report confirmed the unlawful inclusion of 48 names of sunset teachers into the March, 2021 payroll and recommended that queries be issued to some officers involved in the preparation of the payroll.\nRazaq, for his part, said the committee was inaugurated on April 30, 2021 to consider the circumstances surrounding the infiltration of 48 disengaged SUBEB sunset staff into the March 2021 payroll of the state government."
  },
  {
    "headline": "Son of former Senate President Pharaoh Okadigbo, is dead",
    "summarized_story": "Pharaoh Okadigbo, the first son of late Senate President Dr. Chuba Okadigbo, has died.\nREAD ALSO: Pastor Tunde Bakare: “Nigerian youths are responsible for the country’s woes”The deceased was involved in a car accident on Saturday night, according to sources close to the family, and his body was deposited at the morgue.\nThere was no official statement from the family at the time of filing this report."
  },
  {
    "headline": "Primate Ayodele Warns APC Chairman, Buni : “Don’t fly in October, another plane crash may happen”",
    "summarized_story": "The leader Of INRI Evangelical Spiritual Church, Primate Elijah Ayodele has said God showed him another plane crash in Nigeria.\nPrimate Ayodele said Nigerians need to pray against the crash of another military aircraft that will claim the lives of some important personalities.\nThe man of God revealed this during a live service and was contained in a statement forwarded to DAILY POST.\nIn these warnings, he called on the All Progressives Congress, APC, interim chairman, Mala Buni not to travel in October by air with his team on the same aircraft because he foresees danger happening.\n‘’The governor of Yobe State, Mala Buni, who is also the interim chairman of the APC should avoid flying by air on the 2nd and 3rd Of October, 2021 with his reconciliation team on the same aircraft."
  },
  {
    "headline": "FCTA moves to resolve multiple taxation issues — Daily Times Nigeria",
    "summarized_story": "Ukpono Ukpong, AbujaThe Federal Capital Territory Administration (FCTA) has begun moves to end multiple taxation in the nation’s capital and ensure a smooth business environment for entrepreneurship to thrive.\nThe one-day event, titled: “Evaluating and Tackling issues on Multiple Taxation in the FCT”, will be attended by top representatives from the six Area Councils in the FCT and the Ngerian Employers Consultative Association (NECA), whose persistent complaints necessitated the retreat.\nThe director further disclosd that also expected at the event include, Chairmen, Senate and House Committees on FCT, Sen. Abubakar Kyari and Hon.\nAbdullahi Garba, respectively, as well as the FIRS Chairman, Muhammad Nami and DG, Bureau of Public Service Reform (BPSR), Dr. D. I. Arabi, among several others.\nDr. Ahmadu hoped that such a high calibre meeting would ensure iron out all contentious issues, restore trust and confidence in the taxation process, which sanitation, she pointed would boost IGR generation and improve service delivery in the FCT."
  },
  {
    "headline": "N6.5bn contracts: Senate questions NECO over failure to follow due...",
    "summarized_story": "Tunde Opalana, AbujaThe National Examination Council (NECO) has been asked to explain how contracts worth N6.5 billion for the printing of security and non- security documents were awarded without due process.\nHinging on the 2017 report of Office of Auditor General of the Federation, the Senate Committee on Public Account faulted NECO on shoddy handling of two contracts worth N451 million and N6.1 billion respectively.\nThe report indicted the examination body of inability to present any record of approval for the contract in the first contract that cost about N451 million.\n” The above unilateral award of contracts without following due process may lead to awarding contracts to unqualified contractors.\nThere was no Technical and Financial evaluation, Evidence of placement of advertisement was not attached to either payment vouchers or contract files."
  },
  {
    "headline": "Ortom to Benue people: No more complaints, cries, we must defend ourselves from killer herdsmen",
    "summarized_story": "Governor Samuel Ortom of Benue State weekend said though the state was under siege of armed herdsmen, there was no need for anyone to cry or complain anymore except for the people to stand up and defend themselves in order to live.\nThe Governor spoke during a funeral oration in honour of Mama Enenu Ebute, mother of Justice Mary Abounu, wife of the Benue State Deputy Governor, Mr Benson Abounu at Adoka, Otukpo Local Government Area of the state.\n“We have had enough of this, we cannot continue to cry, we must all defend ourselves.\nHe also pointing out that support and synergy with security agents was imperative in the fight against the worsening insecurity in the country.\nAnd urged that all hands must be on deck to salvage the country."
  },
  {
    "headline": "Ortom to Benue people: No more complaints, cries, we must defend ourselves from killer herdsmen",
    "summarized_story": "Governor Samuel Ortom of Benue State weekend said though the state was under siege of armed herdsmen, there was no need for anyone to cry or complain anymore except for the people to stand up and defend themselves in order to live.\nThe Governor spoke during a funeral oration in honour of Mama Enenu Ebute, mother of Justice Mary Abounu, wife of the Benue State Deputy Governor, Mr Benson Abounu at Adoka, Otukpo Local Government Area of the state.\n“We have had enough of this, we cannot continue to cry, we must all defend ourselves.\nHe also pointing out that support and synergy with security agents was imperative in the fight against the worsening insecurity in the country.\nAnd urged that all hands must be on deck to salvage the country."
  },
  {
    "headline": "Econet founder Strive Masiyiwa becomes Britain’s first black billionaire",
    "summarized_story": "Econet founder, Strive Masiyiwa, has been named Britain’s first black billionaire.\nMasiyiwa, who is based in London, is the only black billionaire in the Sunday Times Rich List with a net worth of £1.087bn (about N655bn), earning him the title of Britain’s first black billionaire, according to DailyMail.\nHe currently sits on the board of Netflix and Unilever.\nMasiyiwa is actively working as an African Union special envoy on COVID-19, saddled with the responsibility of providing Africa with vaccines.\nIn 2016, Masiyiwa was appointed as a Non-Executive Director in Unilever, while in 2020, he became a member of the board of directors of Netflix."
  },
  {
    "headline": "Econet founder Strive Masiyiwa becomes Britain’s first black billionaire",
    "summarized_story": "Econet founder, Strive Masiyiwa, has been named Britain’s first black billionaire.\nMasiyiwa, who is based in London, is the only black billionaire in the Sunday Times Rich List with a net worth of £1.087bn (about N655bn), earning him the title of Britain’s first black billionaire, according to DailyMail.\nHe currently sits on the board of Netflix and Unilever.\nMasiyiwa is actively working as an African Union special envoy on COVID-19, saddled with the responsibility of providing Africa with vaccines.\nIn 2016, Masiyiwa was appointed as a Non-Executive Director in Unilever, while in 2020, he became a member of the board of directors of Netflix."
  },
  {
    "headline": "Many feared killed as hoodlums hit INEC, police offices in Awka",
    "summarized_story": "By Francis Onyeukwu/AwkaGunmen Sunday night attacked the Nigeria Police Divisional Station and the Independent National Electoral Commission (INEC) office in Akwa, Anambra.\nThey then moved to INEC office.\nOther residents reported possibility of deaths, as the hoodlums appeared to have subdued the police before moving to INEC office.\nINEC office Awka was gutted by fire in February 2019DSP Tochukwu Ikenga, the state Police Public Relations Officer (PPRO) said he was still making contacts to get correct situation of things around the two federal institutions in the state.\nAttacks on INEC and police offices have become rampant in both the South East and South South zones of Nigeria."
  },
  {
    "headline": "ICYMI: Enyimba fail to conjure miracle against Pyramids",
    "summarized_story": "Anayo Iwuala’s equaliser eight minutes later in the quarter-final second leg match at Enyimba International Stadium was all the hosts could muster.\nElshenawy was the hero again in the 23rd minute when he brilliantly saved Ozor Felix’s shot from distance.\nElshenawy was forced to leave the field injured after 38 minutes, and just a couple of minutes later Enyimba found the equaliser.\nAhmed Fathy saved Pyramids from conceding a second goal after 72 minutes when he stopped Olisema Chinedu’s shot on the goalline.\nMoments later, Ekramy brilliantly saved substitute Ibitham Orok’s rebound shot, while he was again there five minutes later to stop Orok’s shot from distance."
  },
  {
    "headline": "Buhari orders National flag flown half-mast, declares holiday for armed forces",
    "summarized_story": "By Kazeem UgbodagaPresident Muhammadu Buhari on Sunday ordered that the National Flag of Nigeria be flown at half-mast in all public buildings and official residence across the country to honour Chief of Army Staff, Lt General Ibrahim Attahiru and 10 others who died in Kaduna plane crash.\nAttahiru and 10 others died in a plane crash on Friday in Kaduna State.\nTo honour the deceased, the president said the flag would be flown at half-mast for three days beginning from Monday, May 24, 2021 till Wednesday.\nThe president also approved Monday, May 24, 2021 as work free day for members of the Armed Forces.\n“The President has also approved Monday May 24, 2021 as a work-free day for members of the Nigerian Armed Forces,” a statement issued by the presidency said."
  },
  {
    "headline": "BREAKING: Gunmen Attack Police Station, Set INEC Office Ablaze In Anambra",
    "summarized_story": "The B-Division police station and INEC office in Awka, Anambra state have been attacked by some unknown gunmen.\nAccording to reports, the gunmen firstly attacked B-Division police station and shot for more than an hour, stopped at Ekwueme Square and shot for 10 minutes before proceeding to the INEC office.\nThe INEC office in Awka is currently on fire but there are no records of any deaths yet.\nMore details later…"
  },
  {
    "headline": "Chief Of Army Staff: General Attahiru’s Possible Successors Emerge",
    "summarized_story": "The search for a replacement to Lt. General Ibrahim Attahiru, the late Chief of Army Staff (COAS), has begun.\nBrig-Gen. Kuliya, the Chief of Military Intelligence, and Brig-Gen. Olayinka, the Provost Marshall, were among those killed.\nMajor General Danjuma Ali-Keffi, the General Officer Commanding (GOC) of the Nigerian Army’s 1st Division in Kaduna, is rumored to be the next COAS.\nBeyond seniority, a senior military commander told PRNigeria that several considerations are examined when service chiefs are appointed.\nHe is currently the Theatre Commander Operation in the North-East and was previously the General Officer Commanding Officer of 1 Division."
  },
  {
    "headline": "Primate Ayodele Foresees Another Plane Crash, Terrorist Group After Boko Haram",
    "summarized_story": "The Leader Of INRI Evangelical Spiritual Church, Primate Elijah Ayodele, has warned that the Islamic State West Africa Province (ISWAP) will be deadlier than Boko Haram, adding that another group will come up after the latter.\nThe clergyman, who issued the prophecies while addressing his members, assured that Boko Haram’s leader, Abubakar Shekau is dead.\nAccording to Primate Ayodele: ‘‘Abubakar Shekau is dead and buried, anyone that claims to be Shekau is just a joker but ISWAP will become deadlier as they want to shoot down planes, another terrorist group will rise up through Boko Haram but will fade out soon.’’He also mentioned some states that should be on alert against deadly attacks and killings.\n‘’The following states must be very watchful of major attacks that will happen; Lagos, Abuja, Kaduna, Yobe, Bauchi, Plateau, Benue, Adamawa, Ekiti, Ondo, Oyo, Imo, Anambra, Ebonyi, Cross River.\nThey must not joke with this message,’’ he said."
  },
  {
    "headline": "Insecurity: Bandits abduct 14 in Kaduna, NAF rescues scores, 20 gunmen invade FCT, abduct father, son",
    "summarized_story": "Armed bandits Sunday attacked Unguwan Kabulo community in Chikun local government area of Kaduna state and abducted 14 people, Blueprint has gathered.\nThe commissioner said when the air platforms traced them to the outskirts of the village, the bandits had scampered into the forest and abandoned the women.\nSecurity agencies reported that the armed bandits attacked the Buruku-Birnin Gwari road and Nasiru Muhammad was shot dead around Ungwan Yako forest along the route.\nSokotoAlso, some suspected bandits Friday night killed three persons at Garin Zogo village in Sabon Birni local government of Sokoto state.\n“But the quick intervention of the Police, JTF, and other local security outfits prevented the gunmen from carrying out their nefarious activities,” she said."
  },
  {
    "headline": "Breaking: Gunmen abduct undergraduate, farmer in Ogun",
    "summarized_story": "A 400-level student of Aquaculture and Fisheries Management of Federal University of Agriculture Abeokuta (FUNAAB), Toyinbo Nathaniel Olayinka, has been abducted on Saturday from a farm at Abule-Itoko on the Abeokuta-Ibadan road in Odeda local hovernment area of Ogun state.\nOlayinka was reportedly kidnapped alongside the owner of the private farm, identified as Dominic, and a 17-year-old Togolese lady.\nAdepoju noted that the victim has been living and working as a practicing livestock farmer for the past three years to sustain himself as a self sponsored indigent student of the University.\nHe affirmed that the management of the University has reported the abduction at Ogun State Police Command headquarters, Eleweran and its working with the command to ensure the safety and release of the kidnapped student.\nConfirming the incident, the Police Public Relations Officer (PPRO), DSP Abimbola Oyeyemi, confirmed that the student was abducted with a relative of the farm owner at the early hours of Saturday."
  },
  {
    "headline": "Breaking: Saudi Arabia pegs entire 2021 Hajj slots for pilgrims at 60,000",
    "summarized_story": "Nigeria, which hirtherto got 95,000 Hajj quota, will share just 45,000 slots with over 60 countries of the World as Saudi embargoes Hajj for people under the age of 18 and above 60 yearsThe Kingdom of Saudi Arabia has pegged the global attendance for 2021 Hajj at only 60,000 with just 45,000 quota, out of this, slated for prospective pilgrims from outside the kingdom.\nThe announcement made by the Kingdom few hours ago via a twitter handle; @HaramainInfo sighted by Platforms Africa, noted that only 60,000 pilgrims will be allowed to perform the 2021 (1442) Hajj from across the world.\nThe breakdown shows that only 45,000 pilgrims will perform the Hajj from outside the Kingdom of Saudi Arabia and 15,000 from within.\n“Only 60,000 pilgrims in total for all countries to perform Hajj rituals for this year 2021 / 144245,000 pilgrims from outside KSA will be allocated and 15,000 from inside KSA.\nOnly 1,000 pilgrims from KSA performed a symbolic Hajj last year, a far cry from over two million Muslims that usually perform the religious ritual annually."
  },
  {
    "headline": "Senate is serious about constitutional amendment, says BMO",
    "summarized_story": "Buhari Media Organisation, BMO, on Sunday said the one week suspension of plenary by the Senate to enable its members to participate in the zonal public hearing for the constitution review across the country has shown that the legislative body is serious about constitutional amendment.\nBMO said the public hearing for amendment of constitution as facilitated by National Assembly committee on Constitution review is the only acknowledged constitutional platform recognized by law, as part of the process of amending the Constitution and should be acknowledged by everybody.\n“The National Assembly has been very much up to speed on national opinions around the amendment and updating of the Nigerian Constitution.\nIt would witness two public hearings per geopolitical zone and a national public hearing is expected to hold in Abuja, the nation’s capital.\n“Chairman, Senate Committee on Constitution Review, Senator Ovie Omo-Agege called on those who have already submitted memoranda to speak to the documents at the events”."
  },
  {
    "headline": "PDP is still the party of choice for Nigerians – Chief Segun Oni -NigPilot",
    "summarized_story": "Former governor of Ekiti State, Segun Oni has declared that the Peoples Democratic Party, PDP, remains the choice party for Nigerians.\nReacting to the defection of Governor Ben Ayade of Cross Rivers State to the APC, Segun Oni advised members of the PDP not to despair or lose hope about the development.\n“I will like to urge members of the PDP to not despair or lose hope about the recent developments.\nThe country’s political environment reflects people seeking an alternative to the APC, and it is only the PDP that can provide this alternative.\nThe PDP is still the party of choice for all Nigerians."
  },
  {
    "headline": "Stop military aggression in South East, HURIWA tells Buhari -NigPilot",
    "summarized_story": "A leading civil rights advocacy group, Human Rights Writers Association of Nigeria, HURIWA, has asked President Muhammadu Buhari to end his “unwarranted military aggression” in parts of South East with specific reference to the reported airstrikes in Imo State.\nThe Rights group stated that the airstrikes have created an atmosphere of fear and a climate of uncertainty in the entire Imo State with millions of people unsure of their safety any longer.\nHURIWA lamented that human rights violations by the soldiers during internal military operations which became unprecedented in the past few weeks in the South East of Nigeria have started portraying the Nigerian Army in bad light around the World with the concomitant use of extralegal killings of civil by the soldiers.\n“The directive by President Buhari to the military to wage aggressive attacks against locations in the South East of Nigeria without provocation may lead to a genocide which the Rights group is appealing to World leaders to intervene now before it becomes too late.\nThe civil rights advocacy group stated that an indigene of the area reortedly said, “There is an ongoing military airstrike in Odenkwume and Amuzi communities in Obowo and their neighbouring communities in Ihitte/Uboma LGA."
  },
  {
    "headline": "IPC Trains 51 Journalists on Safety Security and Trauma Management -NigPilot",
    "summarized_story": "The International Press Centre has trained 51 Journalists in the Southeast and South South on Safety Security and Management of Trauma in Coverage of Dangerous Assignments.\nThe online zoom training centred on security consciousness of journalists, safety measures and methods of managing stress, trauma and other psychological effects while carrying out their assignments.\nHe explained that IFEX also supports the building of appropriate capacities for journalists including safety in investigative reporting, digital security and management of post-traumatic stress disorder.\nGillo reminded journalists that security of their devices from optimal confidentiality is key to safe practice of the profession.\nDr. Uzo Israel who spoke on managing stress, trauma and other psychological effects called on journalists to take the Management of their health seriously."
  },
  {
    "headline": "Buhari Directs National Flag To Fly At Half-Mast, Declares Monday Work-Free Day For Military Personnel",
    "summarized_story": "President Muhammadu Buhari has directed that the national flag be flown at half-mast in all public buildings, facilities, and official residences across the country.\nMustapha added that the President has approved Monday as a work-free day for members of the Nigerian Armed Forces.\nThe remains of the late Attahiru and 10 other officers who died in the plane crash in Kaduna were laid to rest on Saturday at the National Military Cemetery in Abuja.\nOther officers and who lost their lives included Brigadier-General MI Abdulkadir, Brigadier-General Olayinka, Brigadier-General Kuliya, Major LA Hayat, Major Hamza and Sergeant Umar.\nDetails of his conversation are highlighted in the statement below signed by the President’s spokesman, Garba Shehu."
  },
  {
    "headline": "Gunmen Burn INEC Office In Anambra",
    "summarized_story": "The headquarters of the Independent National Electoral Commission (INEC) in Anambra State has been set ablaze by gunmen.\nThey also attempted to attack the Police ‘B’ Divisional Headquarters close to the INEC office but were repelled by the operatives on duty.\nThey were reported to have later proceeded to the Ekwueme Square axis and fired gunshots for another 10 minutes before storming the INEC headquarters and set it on fire.\nChannels Television obtained a video showing the INEC office going up in flames.\nThey included the Roban Road, Central Bank of Nigeria (CBN) Road, Arroma Road, and Ifite Road – all in the state capital."
  },
  {
    "headline": "How Bandits Attacked Five Zamfara Communities, Killed Over 20 People – Witnesses",
    "summarized_story": "No fewer than 20 people have been killed and many others injured when bandits attacked five communities in two local government areas of Zamfara State.\nThey noted that the bandits, in large numbers, invaded the communities on Saturday afternoon and started shooting sporadically, killing innocent residents in the process.\n“They (the bandits) attacked a village called Gabaken and killed five people; in Torawa, they killed five people.\nOne person was killed in a village called Rigiya; a village called Donroyi in Zurmi Local Government, they killed four people.\n“In a village called Riwoji where I come from, they killed four and injured seven people, including my father’s younger brother,” said one of the witnesses, Umar Abubakar."
  },
  {
    "headline": "COVID-19: FG Publishes Names Of 90 Nigerians, Foreigners Who Evaded Quarantine",
    "summarized_story": "The Presidential Steering Committee (PSC) has published the names of 90 returning travellers who evaded the mandatory seven-day quarantine for persons arriving from restricted countries.\nA statement issued on Sunday by the PSC Chairman and Secretary to the Government of the Federation (SGF), Boss Mustapha, revealed that the erring persons comprised 63 Nigerians and 27 foreigners.\nMustapha advised Nigerians to be wary of such persons of interest, saying they constitute an immediate health hazard to the society.\n“Additional list of Batch II defaulters shall be published in a subsequent announcement by the PSC,” the committee chairman stated.\nSee the full list of the persons whose names were published below:"
  },
  {
    "headline": "PHOTOS: Aisha Buhari Visits Attahiru’s Widow, Family",
    "summarized_story": "The First Lady, Mrs Aisha Buhari, has paid a condolence visit to the family of the late Chief of Army Staff, Lieutenant General Ibrahim Attahiru.\nMrs Buhari took to Twitter on Sunday to share photos of her visit to the deceased’s family on her verified handle.\nShe described the death of the late army chief and the other military officers aboard the aircraft as a monumental loss to their families and the nation at large.\nOther officers and who lost their lives included Brigadier-General MI Abdulkadir, Brigadier-General Olayinka, Brigadier-General Kuliya, Major LA Hayat, Major Hamza, and Sergeant Umar.\nMustapha added that the President has approved Monday as a work-free day for members of the Nigerian Armed Forces."
  },
  {
    "headline": "Aisha Buhari pays condolence visit to family of Chief of Army Staff",
    "summarized_story": "The First, Aisha Buhari has paid a condolence visit to the Family of the Chief of Army Staff, Lt. Gen. Ibrahim Attahiru.\nShe was accompanied by the Minister of Women Affairs, APC Women Rep, DG National Centre for Women Development and other associates.\nThe wife of the President described the death of the Chief Of Army Staff and the ten other officers aboard the ill-fated aircraft as a monumental loss to their families and the Nation at large.\nShe further prayed that the Almighty grant their families the fortitude to bear the irreplaceable loss."
  },
  {
    "headline": "Kaduna insecurity: Bandits kill driver of traditional ruler",
    "summarized_story": "Bandits in Kaduna have killed the driver to the Emir of Birnin Gwari, Jibril Mai-Gwari the Second.\nThe driver Nasiru Mohammed was shot by armed Bandits while driving back to Kaduna around Ungwan Yako in Brinin Gwari local government area of the state.\nThe state Commissioner for Security and Home affairs Samuel Aruwan, said the state Governor Nasir El- Rufai, is saddened by the incident.\nAccording to him, Governor El-Rufai has sent condolences to His Royal Highness the Emir of Birnin Gwari, and also prayed for the repose of the soul of the slain driver."
  },
  {
    "headline": "Italian Cable Car Crash Kills at Least 13",
    "summarized_story": "At least 13 people have died and three were seriously injured when a cable car linking Italy’s Lake Maggiore with a nearby mountain in the Alps collapsed.\nThe Stresa-Mottarone cable car takes tourists and locals from the town on Lake Maggiore, almost 1,400 metres above sea level to the top of the Mottarone mountain in 20 minutes.\nThe accident happened as the cable car was travelling up the mountain, with the cabin dropping some 20 metres and rolling several times down the steep slopes before it was stopped by trees.\nLuca Cari, a fire brigade spokesman, said it was still not clear how many people were in the cable car.\nThe cable car service first opened in August 1970 after almost three years of works to replace a cog railway, its website saidSeverino said that important maintenance works, including changing the cables, had been carried out in recent years."
  },
  {
    "headline": "Liverpool, Chelsea Claim Last Champions League Spots, Leicester Lose Out",
    "summarized_story": "Liverpool secured third place in the Premier League and Champions League football with a 2-0 win over Crystal Palace at Anfield on Sunday.\nIt took Mane until 36 minutes to tap the ball in from close range following a Roberto Firmino corner.\nPalace sought an equaliser in the second half but none materialised as Liverpool took advantage with a second Mane goal.\nMeanwhile, West Ham and Leicester City will play Europa League football next season after plenty of twists and turns on a dramatic final day of the 2020/21 Premier League campaign.\nChelsea however squeezed into the top four above Leicester by one point despite going down 2-1 at Aston Villa, with Liverpool third behind champions Manchester City and Manchester United."
  },
  {
    "headline": "Nigeria Drug Agency Intercepts $20m Cocaine, Arrests Brazil-based Kingpin at Lagos Airport",
    "summarized_story": "A Brazil based drug kingpin has been nabbed with 36 blocks of cocaine, weighing about 30 kilogrammes with a street value of over N8 billion (about $20m) at the Murtala Muhammed International Airport, MMIA, Lagos by operatives of the National Drug Law Enforcement Agency (NDLEA).\nBabafemi disclosed that the disclaimed bag was opened in the presence of the arriving passenger and the man who had come to negotiate it’s release.\nHe said when it was opened, the bag was found to contain 36 blocks of cocaine, weighing 27.95 kilogrammes.\nThe spokesman said during preliminary interrogation after his arrest, Enwereakuconfessed to have been contracted by his Ethiopian associate who is a notorious drug baron to claim and push out the consignment in Lagos, Nigeria.\nBabafemi said the suspect also admitted to have paid the $24,500 bribe in three tranches to compromise NDLEA officers."
  },
  {
    "headline": "Severe Weather Kills 21 Ultramarathon Runners in China",
    "summarized_story": "The race was halted when some of the 172 runners went missing, and a rescue operation was launched.\nHigh winds and freezing rain hit participants in the 100km (60-mile) ultramarathon in the Yellow River Stone Forest, a tourist site in Gansu province, on Saturday.\nOfficials said 151 runners were now confirmed safe, and that eight of them were injured.\nSurviving participants said the forecast had shown some wind and rain was anticipated, but nothing as extreme as what they experienced.\nShe headed back to the hotel after previous experience with hypothermia but others continued or were already in worst hit areas."
  },
  {
    "headline": "Hamas Defiant with Military Parade, Appearance of Top Leader",
    "summarized_story": "Hundreds of masked Hamas fighters brandishing assault rifles paraded in Gaza City and the group’s top leader made his first public appearance on Saturday, in a defiant show of strength after the militants’ 11-day war with Israel.\nIn the fighting, Israel unleashed hundreds of airstrikes against militant targets in Gaza, while Hamas and other militants fired more than 4,000 rockets toward Israel.\nOn Saturday, hundreds of Hamas fighters wearing military camouflage paraded past the mourning tent for Bassem Issa, a senior commander killed in the fighting.\nThe top Hamas leader in Gaza, Yehiyeh Sinwar, paid his respects in his first public appearance since the war began.\nPrime Minister Netanyahu said Friday that more than 200 militants were killed, including 25 senior commanders."
  }
]