[
  {
    "headline": "Senators fault ‘small’ allocation to comatose Ajaokuta steel",
    "summarized_story": "The Senate, on Monday, condemned the poor budgetary provision for the Ajaokuta Steel Complex in Kogi State and blamed the development for the inability of the firm to take off.\nThe Senate Committee on Solid Minerals, Mines, Steel Development and Metallurgy made the condemnation when officials of the Ministry of Mines and Steel Development appeared before it to defend the 2022 budget.\nIt insisted that the abandonment of the Ajaokuta Steel project through the non-provision of required budgetary votes on a yearly basis was not the best for the country.\nThe Chairman of the committee, Senator Tanko Al-Makura, condemned the idea of envelope budgeting.\nHe also solicited the intervention of the federal lawmakers to put an end to the envelope budgeting regime."
  },
  {
    "headline": "Fuel queues resurface in Nasarawa, Abuja, Niger, marketers hike price",
    "summarized_story": "Also, queues of desperate motorists were noticeable in some parts of neighbouring states such as Nasarawa and Niger.\nRetailers claimed that the ex-depot price of the commodity had been increased by private tank farm owners from the recommended N148 and N149.5/litre to between N153 and N155/litre.\nHowever, officials of the Nigerian National Petroleum Company denied any increase in petrol price, insisting that there had been no official directive on the issue.\nThe NNPC official insisted that the corporation had enough of the product and stressed that the queues would completely disappear in the shortest possible time.\n“We have stocks in Lagos; we are expecting more product supply from the NNPC, and there is no need to panic-buy,” he said."
  },
  {
    "headline": "Covid-19 recovery:NB’s revenue up 32.1 %, declares N3.23bn dividend",
    "summarized_story": "By Peter EgwuatuAmidst coranavirous recovery in the country, the Nigerian Breweries, NB Plc, has recorded N309.22 billion in revenues for the third quarter of 2021, Q3’21, representing an increase of 32.1 per cent from N234.02billion recorded in the corresponding period in 2020, Q3’20, just as it declared an interim dividend of N3.23 billion.\nAccording to the audited result sent to the Nigerian Exchange Limited, NGX , the Company’s profit grew to 8.47billion, from N7.1billion representing a 20.1 per cent rise.\nREAD ALSO:Banks’ borrowing from CBN rises 74% to N901bnOther financial indicators show that cost of sales rose significantly by 37.9 per cent toN198.74billion in the period under review in 2021 from N144.1 billion in 2020 while marketing, distribution, and administration expenses also grew by 27,2 per cent to N86.32 billion in 2021 from N67.86 billion in 2020.\nThe board of directors of the Company has approved an interim dividend of N3.23billion payable to shareholders at 40kobo each per ordinary share.\nA statement signed by the Company Secretary/Legal Director, Nigerian Breweries Plc, Uaboi Agbebaku stated that: The Company remains committed to its strategy to deliver improved growth as it continues to monitor the business environment and remain dynamic in its response to challenges confronting the business as well as that of the economy, particularly in the face of COVID-19 pandemic.”Agbebaku explained that the company would continue to deploy cost-efficient measures to keep the balance sheet strong and healthy while ensuring that the health, safety and welfare of its employees, customers and partners are protected."
  },
  {
    "headline": "[Updated] Lagos Building Collapse: 5 rescued, 4 dead",
    "summarized_story": "Rescue operation still in progressBy Arogbonlo IsraelThe Southwest Coordinator of National Emergency Management Agency, NEMA, Ibrahim Farinloye, says five people were rescued alive while four dead bodies were recovered from the debris of the 21-storey building that collapsed this afternoon on Gerald road, Ikoyi, Lagos.\nSpeaking to Vanguard, Farinloye said the rescue operation is still in progress as they are getting closer to where some of the construction workers are being trapped.\nHowever, he couldn’t ascertain the total number of casualties as well as the number of persons trapped in the building.\nVanguard also gathered more people have been rescued and currently undergoing treatment at the time of writing this report.\nVanguard News Nigeria"
  },
  {
    "headline": "Editors urge govt to create safe, enabling environment for journalists",
    "summarized_story": "The editors also reminded the government that attacks on journalists have a destructive effect on the dissemination of information and helpful debate in a democratic space.\nThey expressed concern over the way journalists are increasingly subjected to all forms of threats, including kidnapping, torture, physical attacks and other forms of harassment.\nThis milestone resolution condemns all attacks and violence against journalists and media workers.\n‘’If journalists are to discharge their constitutional and social responsibilities earnestly and robustly, politicians, government officials and security agents must treat them respectfully.\nThey must ensure regular flow of information and frank dispassionate approach in dealing with journalists’’, the editors stated."
  },
  {
    "headline": "Premier League: Iwobi scores as Wolves devour Everton",
    "summarized_story": "CREDIT | Premier LeagueBy Emmanuel OkogbaAlex Iwobi saw seventy-seven minutes of action and found the back of the net in the 66th but it was not enough to stop Everton from falling to their third successive defeat and fourth of the season.\nTwo first half goals ensured that Wolves continued with their fine form, drawing just once and four wins in their last five Premier League matches.\nThe game of two halves saw Wolves dominate the first half and survive the nail-biting second by a whisker.\nIwobi who is included in Gernot Rohr’s team that will prosecute the final two first round group matches of the 2022 World Cup qualifiers missed the double header against the Central African Republic due to injury.\nEverton will next play Tottenham while Wolves faces Crystal Palace just before they head into the international break."
  },
  {
    "headline": "EFCC arrests Obi Cubana over money laundering allegation",
    "summarized_story": "Soni Daniel – AbujaSocialite and businessman, Obinna Iyiegbu, aka Obi Cubana, has been arrested by the Economic and Financial Crimes Commission, EFCC.\nThe Anambra-born tycoon, who arrived the headquarters of the EFCC at Jabi Abuja at about noon on Monday, was still being interrogated by operatives of the Commission as at 10:30 pm.\nThough allegations against the socialite were sketchy as of press time, a source disclosed that his case borders on alleged money laundering and tax fraud.\nWhen contacted, spokesman of the Commission, Wilson Uwujaren said he was yet to be briefed on the development.\nIt was unclear as at press time, if the businessman, who commands large followers across Nigeria, would sleep in EFCC cell or be released on bail to go home before daybreak."
  },
  {
    "headline": "EFCC interrogates Obi Cubana for money laundering, tax fraud",
    "summarized_story": "Obi Cubana.\nThe famous socialite and entrepreneur is being probed for alleged money laundering and tax fraud.\nObi Cubana got to the EFCC headquarters in Jabi Abuja around noon on Monday.\nIn July, Obi Cubana dominated social media after the burial of his mother in Afor Uzo, Oba town in Anambra State.\nDuring the Cubana-Kyari public discourse, an activist, Deji Adeyanju questioned the source of Obinna Iyiegbu’s wealth."
  },
  {
    "headline": "Jeff Bezos hails Buhari’s leadership in Glasgow",
    "summarized_story": "American billionaire and founder of Amazon, Jeff Bezos, on Monday commended President Muhammadu Buhari’s leadership role in restoring degraded lands in the country.\nBezos described Buhari’s commitment to restore four million hectares as exemplary.\n‘‘Nigeria plays a critical role in the restoration movement and has pledged to restore 4 million hectares of degraded lands.\nPresident Buhari had used the occasion of his address to appeal to fellow leaders to continue to make concerted efforts at land restoration.\n‘‘I am optimistic that Africa’s ambition of restoring over 100million hectares of degraded landscape for productive agriculture is achievable,’’ he said."
  },
  {
    "headline": "Anambra: How I facilitated Nnamdi Kanu’s release from Kuje prison – Charles Soludo",
    "summarized_story": "Professor Charles Soludo, candidate of the All Progressives Grand Alliance (APGA) for the November 6, 2021, governorship election, has revealed that he addressed an international press conference to ask for Nnamdi Kanu’s release when he heard the leader of the proscribed Indigenous People of Biafra, IPOB, was in Kuje prison in 2016.\nSoludo explained that after his press conference, Kanu was released from Kuje prison four weeks later.\nAccording to Soludo: “2016, 2017 I am on record speaking I did say Nnamdi Kanu, I didn’t know him, I never heard of him, IPOB.\nBut when I heard, he was in Kuje prison and the court ordered to release him and the court judgement to release him and they refused.\nThe federal government of Nigeria had arrested Kanu in 2017, but Nayko of an Abuja Federal High Court granted him bail."
  },
  {
    "headline": "Igbo youths insist on Malami’s resignation over alleged invasion of Justice Mary Odili’s Abuja residence",
    "summarized_story": "The Igbo youths tasked the President Muhammadu Buhari-led federal government of Nigeria, on thorough investigation of the incident.\nRecall that Justice Odili’s family residence at lmo Rivers Street in Maitama was said to have been besieged by fully armed plain-clothed security men for undisclosed reasons at about 5pm of Friday, October 29.\nThe Igbo youth group regretted over the ugly scenario, describing the alleged invasion as a “Igbophobic inspired attack on the judiciary.\nThe Ohanaeze youths further argued that if the operation wasn’t aimed at something sinister, those involved would have come out boldly to own it up.\nAccording to the youth wing, “the mission was to abduct the honorable Justice and kill her off because she is Igbo and she is occupying a very sensitive position in one of the arms of government."
  },
  {
    "headline": "COP26: Global climate alliance charge leaders on 1.5C target to avoid disaster",
    "summarized_story": "The Global Climate and Health Alliance on Monday urged world leaders to make health and social equity the beating heart of COP26 negotiations.\nCOP26, the 2021 United Nations Climate Change Conference, is being held in Glasgow, Scotland, United Kingdom.\nMiller reminded high income countries to deliver the promised annual $100billion climate finance to support lower income countries, including funds to help them protect people, health systems and climate mitigation measures.\nFormed in 2011, The Global Climate and Health Alliance comprises more than 500 organisations representing 46 million nurses and doctors.\nThey warned that the climate crisis is the single biggest health threat facing humanity and called on leaders to deliver on climate action."
  },
  {
    "headline": "Ayefele praises Davido after second meeting in Atlanta",
    "summarized_story": "Ayefele praises Davido after second meeting in AtlantaPopular singer, Yinka Ayefele has reaffirmed his love for Davido as they met in USA recently.\nAlthough it was not the first time of meeting the ‘FIA’ singer, Ayefele noted that Davido’s humility is compared to none in the music industry.\nThe ‘Tungba’ styled singer shared a picture of himself and Davido on his Instagram page after they met in Atlanta, USA.\n- Advertisement -He narrated how Davido ran towards him when he sighted him from a distance.\nAyefele and Davido had met previously at an event in Ogun state where Davido was filmed spraying Ayefele."
  },
  {
    "headline": "EFCC quizzes Obi Cubana over alleged money laundering",
    "summarized_story": "Obi Cubana) was reportedly interrogated by Economic and Financial Crimes Commission (EFCC) officials yesterday.\nHis interrogation was said to be over alleged money laundering and tax-related issues.\nThe Anambra-born club owner, who arrived at the Jabi headquarters of the EFCC in Abuja at about 12.00 noon, was still with the anti-graft’s interrogators last night.\n- Advertisement -There was no confirmation on the allegations against the socialite, but it was learnt he was being quizzed on alleged money laundering and tax evasion.\n“Obi Cubana was arrested and brought to the EFCC headquarters on Monday afternoon over allegations of money laundering and tax fraud."
  },
  {
    "headline": "Lagos APC congress followed guidelines, says Oladejo",
    "summarized_story": "The Publicity Secretary Secretary of All Progressive Congress (APC) in Lagos State, Seye Oladejo, has defended its state congress recently held at Mobolaji Johnson Arena, Onikan, Lagos.\n“Our state Congress was held, based on rules, guidelines and constitution of our party, and members are conversant with these rules,” he said on a live MITV programme.\nThe congress, Oladejo emphasised, was witnessed by Independent National Electoral Commission (INEC) officials.\nChiding them for conducting unlawful congresses outside party rules and guidelines, he said the events lacked basis and credibility, adding that their attitude smacked of impunity and indiscipline.\nFollowing the successful congress, Oladejo said the belief of majority of party members in the party structures has been sustained."
  },
  {
    "headline": "Why crisis persists between Kwara governor, minister",
    "summarized_story": "Yakubu Danladi-Salihu, engineer and Speaker of Kwara State House of Assembly, represents Ilesha-Gwanara Constituency.\nAn example is the Kwara State Social Investment Programme Bill, which we worked on.\nTake the Kwara State Education Trust Fund, which has also been assented to by the Governor.\nThe Kwara State Sports Commission Bill is another milestone.\nSenator Saraki said a few days ago that the people of Kwara State have regretted their decision on Otoge."
  },
  {
    "headline": "2023: PDP ready to rescue Nigeria – Ortom",
    "summarized_story": "From Rose Ejembi, MakurdiBenue State Governor, Samuel Ortom, has said the Peoples Democratic Party (PDP) was now better repositioned and ready to rescue Nigeria from the doldrum of the All Progressives Congress (APC)-led Federal Government.\nThe governor, who also posited that the ruling APC is worse than the worst military government assured that with new leadership of the PDP was ready to rescue the country from the current plague of insecurity and corruption.\nOrtom said this, yesterday, in a chat with newsmen at the Makurdi airport, on his arrival from the PDP national convention in Abuja at the weekend.\nThanking God for the victory and emergence of Iyorchia Ayu and other party leaders at the convention, Ortom said the party was now better positioned to take over the mantle of leadership in Nigeria in 2023.\n“And today, I can tell you Nigeria is hopeful and by the grace of God, we will make ourselves available, sacrifice our time, resources and our energy."
  },
  {
    "headline": "APC govs DG applauds PDP on successful convention",
    "summarized_story": "From Romanus Ugwu, AbujaThe Director-General of the All Progressives Congress (APC) Progressive Governors Forum (PGF), Dr. Salihu Moh Lukman, has said the Peoples Democratic Party (PDP) deserves commendation for conducting a successful national convention last weekend.\nHe said apart from consolidating on the successful composition of a new national leadership, the party should avoid culture of arrogance and impunity.\n“With the successful conclusion of the PDP national convention, credit must be given to leaders and members of the party for being able to manage the process and elect a new leadership for the party,” he wrote in the statement.\n“Ordinarily, the successful conclusion of the PDP National Convention should only be celebrated by PDP members.\nEvery Nigerian should wish PDP, its leaders and party members well.”100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "IGP orders probe into invasion of Justice Odili’s residence",
    "summarized_story": "From Magnus Eze, Enugu, Molly Kilete, Abuja, Femi Folaranmi, Yenagoa and Adewale SanyaoluInspector General of Police, Usman Baba, yesterday, ordered investigation into the invasion of Justice Mary Odili’s residence in Abuja.\nOdili’s residence was reportedly invaded by officials from the Federal Ministry of Justice and operatives from the Economic and Financial Crimes Commission (EFCC).\nThe governor described the raid as ill-advised and an attempt to intimidate the judiciary, which is an independent arm of government.\nChairman of ADF’s Media and Publicity Bureau, Abia Onyike claimed Odili was targetted because she is the next in rank to the Chief Justice of Nigeria, Justice Ibrahim Tanko Muhammad.\nIn its reaction, SESSPN described the invasion as a new low of deliberate rascality, too sordid for rational comprehension."
  },
  {
    "headline": "Aviation: Ground handlers to embark on indefinite strike over cargo charges",
    "summarized_story": "By Chinelo ObogoDomestic aviation ground handlers are set to embark on an indefinite strike on November 5 over the reversal of increase in cargo charges by the House of Representatives.\nThe Aviation Ground Handling Association of Nigeria (AGHAN) said it is already putting modalities in place to commence indefinite strike to enforce the commencement of the new price regime as approved by the Nigerian Civil Aviation Authority (NCAA) two months ago.\nCompanies like the Nigerian Aviation Handling Company (NAHCO) Plc, the Skyway Aviation Handling Company (SAHCO) Plc, Precision Aviation Handling Company Limited (PAHCOL) and the Swissport Handling Company, were expected to charge the same handling rates as their counterparts in the sub-African countries.\n“We do not want all these to be jeopardised or ridiculed by interference in the decisions taken by the regulator.\nSo, we appeal to the House Committee on Aviation and Senate Committee to back off from the decisions taken by NCAA with respect to the industry."
  },
  {
    "headline": "Editors task govt on safe, enabling environment for journalists",
    "summarized_story": "As the world marks the International Day to End Impunity for Crimes Against journalists today, the Nigerian Guild of Editors (NGE) has called on governments, at all levels, to make deliberate and sustained efforts to promote a safe and enabling environment for journalists to perform their work freely.\nThe editors also reminded the government that attacks on journalists have destructive effect on dissemination of information and helpful debate in a democratic space.\nThey expressed concern over the way journalists are increasingly subjected to all forms of threats, including kidnapping, torture, physical attacks and other forms of harassments.\nThis milestone resolution condemns all attacks and violence against journalists and media workers.\nThey must ensure regular flow of information and frank dispassionate approach in dealing with journalists,’’ the editors said."
  },
  {
    "headline": "Video: Several People Trapped in Collapsed Lagos High-rise Building",
    "summarized_story": "Ayodeji AkeA 20-storey building, located on Gerrard Road, Ikoyi, Lagos has collapsed.\nAccording to reports, many people are trapped in the collapsed building.\nThe Lagos State Emergency Management Agency (LASEMA), said in a phone conversation with THISDAY that the agency had activated its rescue team.\n“The agency has activated its emergency response plan to the collapsed building.\nAll first responders are enroute to secure the scene while the heavy duty equipment and life detection equipment have been dispatched,” he said."
  },
  {
    "headline": "Breaking: One Dead, Two Rescued in Collapsed Ikoyi High-rise Building",
    "summarized_story": "Rebecca EjifomaThe body of a yet-to-be identified man has been recovered and two other persons rescued in the rubble of a 21-storey building which collapsed on Gerrard Road, Ikoyi, Lagos MondayThe South West Spokesman of the National Emergency Management Agency (NEMA), Mr. Ibrahim Farinloye, who confirmed the recovery of a body, said emergency respondents were currently on ground.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: High-rise Building Collapses in Ikoyi, Lagos",
    "summarized_story": "A high-rise building, located at 20, Gerrard Road, Ikoyi, Lagos has collapsed.\nThe building was said to have collapsed at about 3pm on Monday.\nThe number of casualties is unknown but several people are believed to be trapped in the rubble.\nWhile search and rescue operation has not commenced at the time of filing this report, a crowd gathered at the site of the incident.\nA fire service truck is already at the scene while other emergency responders are said to be on their way."
  },
  {
    "headline": "Ayu: PDP is Back to Rescue Nigeria from Her Current Mess",
    "summarized_story": "PDP is back to rescue Nigeria from the terrible mess we have been in, in the last six years.\nTwenty-one people were elected at its national convention, which began on Saturday, October 30, and lasted till Sunday, October 31, at the Eagle Square, Abuja.\nAyu was declared national chairman after 3,426 delegates affirmed his unopposed position.\nThe office of the Deputy National Chairman (South), was keenly contested and Amb.\nSetonji Koshoede is the new deputy national secretary, Ndubisi Eneh David, deputy national treasurer, Ibrahim Abdullahi is the deputy national publicity secretary, Ighoyota Amori, deputy national organising secretary, Adamu Kamale, deputy national financial secretary, Hajaja Yakubu Wanka, deputy national woman leader, Timothy Osadolor, deputy national youth leader and Okechukwu Osuoha, deputy national legal adviser."
  },
  {
    "headline": "Rotimi Amaechi: Our 2019 Experience Won’t Happen Again in Rivers",
    "summarized_story": "Somebody told me that it was Goodluck Jonathan’s government that did the feasibility studies and design and all that, I don’t know how true it is.\nI don’t know how much longer it will take them.\nI don’t know if I should tell you this, but let me give you an example.\nYou can’t just say don’t come to Rivers, or don’t come to Ogun State, no.\nHe may crack a joke, a lot of people don’t know him."
  },
  {
    "headline": "BREAKING: Nigeria’s Anti-graft Agency, EFCC Detains Socialite, Obi Cubana For Money Laundering, Tax Fraud",
    "summarized_story": "Popular socialite and businessman, Obinna Iyiegbu, aka Obi Cubana, has been arrested by the Economic and Financial Crimes Commission for money laundering.\nObi CubanaThough allegations against the socialite were sketchy as of press time, a source disclosed that his case borders on alleged money laundering and tax fraud.\nThe source said, “Obi Cubana was arrested and brought to the EFCC headquarters on Monday afternoon over allegations of money laundering and tax fraud.\nHe is being grilled by detectives as we speak.”The EFCC spokesman, Wilson Uwujaren, said he has yet to be briefed on the development.\nObi Cubana made headlines in July when he hosted an ostentatious burial for his mother in Oba, Anambra State, in which over 200 cows were reportedly killed."
  },
  {
    "headline": "BREAKING: Nigeria’s Anti-graft Agency, EFCC Detains Socialite, Obi Cubana For Money Laundering, Tax Fraud",
    "summarized_story": "Popular socialite and businessman, Obinna Iyiegbu, aka Obi Cubana, has been arrested by the Economic and Financial Crimes Commission for money laundering.\nObi CubanaThough allegations against the socialite were sketchy as of press time, a source disclosed that his case borders on alleged money laundering and tax fraud.\nThe source said, “Obi Cubana was arrested and brought to the EFCC headquarters on Monday afternoon over allegations of money laundering and tax fraud.\nHe is being grilled by detectives as we speak.”The EFCC spokesman, Wilson Uwujaren, said he has yet to be briefed on the development.\nObi Cubana made headlines in July when he hosted an ostentatious burial for his mother in Oba, Anambra State, in which over 200 cows were reportedly killed."
  },
  {
    "headline": "BREAKING: Nigeria’s Anti-graft Agency, EFCC Detains Socialite, Obi Cubana For Money Laundering, Tax Fraud",
    "summarized_story": "Popular socialite and businessman, Obinna Iyiegbu, aka Obi Cubana, has been arrested by the Economic and Financial Crimes Commission for money laundering.\nObi CubanaThough allegations against the socialite were sketchy as of press time, a source disclosed that his case borders on alleged money laundering and tax fraud.\nThe source said, “Obi Cubana was arrested and brought to the EFCC headquarters on Monday afternoon over allegations of money laundering and tax fraud.\nHe is being grilled by detectives as we speak.”The EFCC spokesman, Wilson Uwujaren, said he has yet to be briefed on the development.\nObi Cubana made headlines in July when he hosted an ostentatious burial for his mother in Oba, Anambra State, in which over 200 cows were reportedly killed."
  },
  {
    "headline": "EXCLUSIVE: Buhari's Minister, Malami Intervenes, To Defend Suspended Nigerian Ports Authority Boss, Hadiza In Court",
    "summarized_story": "The Attorney General of the Federation, Abubakar Malami has opted to defend the suspended Managing Director of the Nigerian Ports Authority (NPA), Hadiza Bala Usman, in a suit filed against her and others.\nA source noted, ”As the hearing of the originating summons resumes at the Federal High Court, Ikoyi on Thursday, President Buhari is opting to defend Hadiza in court.\nThat Nigerian Ports Authority that instructed me to defend the 3rd and 4th Defendant has informed me that the Attorney General of the Federation has intervened in the suit.\n“That the Attorney General and Minister of Justice being the Law Officer of the Federation, I have to withdraw from the Suit.\n“It was observed that the total expenditure reported by the Authority increased astronomically by 128% from N87,474,781,088.00 to N198,989,352,119.00 in 2017."
  },
  {
    "headline": "EXCLUSIVE: Buhari's Minister, Malami Intervenes, To Defend Suspended Nigerian Ports Authority Boss, Hadiza In Court",
    "summarized_story": "The Attorney General of the Federation, Abubakar Malami has opted to defend the suspended Managing Director of the Nigerian Ports Authority (NPA), Hadiza Bala Usman, in a suit filed against her and others.\nA source noted, ”As the hearing of the originating summons resumes at the Federal High Court, Ikoyi on Thursday, President Buhari is opting to defend Hadiza in court.\nThat Nigerian Ports Authority that instructed me to defend the 3rd and 4th Defendant has informed me that the Attorney General of the Federation has intervened in the suit.\n“That the Attorney General and Minister of Justice being the Law Officer of the Federation, I have to withdraw from the Suit.\n“It was observed that the total expenditure reported by the Authority increased astronomically by 128% from N87,474,781,088.00 to N198,989,352,119.00 in 2017."
  },
  {
    "headline": "EFCC grills Obi Cubana over ‘money laundering’",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has detained Obi Cubana, the Abuja-based business mogul, for alleged money laundering.\nAdvertisementThe 46-year-old socialite arrived at the headquarters of the EFCC at Jabi on Monday where he is undergoing interrogation.\nWhen contacted by TheCable Lifestyle, a top source at the EFCC confirmed the development.\nThe case against the Anambra-born nightlife promoter, according to the source, borders on alleged money laundering and tax fraud.\nAdvertisement“I don’t have time for people who want to tell me how to spend the money that I made through my own efforts."
  },
  {
    "headline": "EFCC grills Obi Cubana over ‘money laundering’",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has detained Obi Cubana, the Abuja-based business mogul, for alleged money laundering.\nAdvertisementThe 46-year-old socialite arrived at the headquarters of the EFCC at Jabi on Monday where he is undergoing interrogation.\nWhen contacted by TheCable Lifestyle, a top source at the EFCC confirmed the development.\nThe case against the Anambra-born nightlife promoter, according to the source, borders on alleged money laundering and tax fraud.\nAdvertisement“I don’t have time for people who want to tell me how to spend the money that I made through my own efforts."
  },
  {
    "headline": "65% sold out, billed for completion in 2022... what to know about collapsed Lagos building",
    "summarized_story": "The main contractor for the project, FourScore Homes, is owned by Femi Osibona, a UK-trained estate developer.\nAccording to Highbrow Living Magazine, the property, consisting of four-bedroom maisonettes, flats, duplex and penthouses, was 65 percent sold out.\n“The 20-floor strictly residential facility is the brain works of Fourscore Homes, evolving from a desire to build an original masterpiece.\n“We have exhibited our expertise in property development in the United Kingdom, South Africa, the United States of America and Nigeria.\nFourscore Homes possesses uncommon capabilities in redefining property development in any market we choose to play in."
  },
  {
    "headline": "65% sold out, billed for completion in 2022... what to know about collapsed Lagos building",
    "summarized_story": "The main contractor for the project, FourScore Homes, is owned by Femi Osibona, a UK-trained estate developer.\nAccording to Highbrow Living Magazine, the property, consisting of four-bedroom maisonettes, flats, duplex and penthouses, was 65 percent sold out.\n“The 20-floor strictly residential facility is the brain works of Fourscore Homes, evolving from a desire to build an original masterpiece.\n“We have exhibited our expertise in property development in the United Kingdom, South Africa, the United States of America and Nigeria.\nFourscore Homes possesses uncommon capabilities in redefining property development in any market we choose to play in."
  },
  {
    "headline": "How firm withdrew services from collapsed Lagos building over poor execution",
    "summarized_story": "Details have emerged on how Prowess Engineering Limited withdrew its services from the building that collapsed in Ikoyi, Lagos state, over poor execution of the project.\nAdvertisementThe 21-storey building situated along Gerard road in Ikoyi collapsed on Monday afternoon while many workers are trapped and some feared dead in the building which is still under construction.\nAdvertisement“This letter is to formally inform you of the withdrawal of our structural consultancy service from the above named project.\nWe look forward to future cooperation in other projects.”There are ongoing rescue efforts at the site of the collapsed building.\nThe state government recently launched a rebranded certificate of completion and fitness to limit the frequency of building collapse incidents in Lagos."
  },
  {
    "headline": "Facebook changes company name to Meta, reflecting its ambitions beyond social media",
    "summarized_story": "Facebook on Thursday, October 28 announced that it has changed its company name to Meta.\nThis change of name was announced by Facebook CEO Mark Zuckerberg at Facebook’s annual Connect augmented and virtual reality conference.\nThe company said it chose the name “Meta” to serve as a reminder that there is always more to build.\nFacebook said its corporate structure is not changing, however, how the company reports its financials will.\nIn addition, Facebook assured users that the announcement does not affect how the company uses or shares data."
  },
  {
    "headline": "Nigerian youth rally in support of the Nigeria Startup Bill",
    "summarized_story": "Hundreds of Nigerian youth rallied on Thursday across five states in the country to show support for the Nigeria Startup Bill (NSB).\n“This rally is to support and create awareness around the importance of the NSB.\nGet the best African tech newsletters in your inboxNSB is a set of reforms co-created by players in Nigeria’s startup ecosystem including the Nigerian presidency, ministries, startup innovators, investors, regulatory agencies, and local and international volunteering think tanks.\nFor instance, Edo state has scheduled its rally for its Investment Summit Day when invited investors and other stakeholders will be in town.\nShe also hinted that the bill has passed a second draft and is now at the judiciary."
  },
  {
    "headline": "Buycoins’ journey to powering Africa’s financial and digital economy",
    "summarized_story": "We all had conversations and thought, “Oh, how difficult would it be to build a crypto exchange?” It was supposed to be a little project that enabled people to trade Bitcoin without stress.\nFor instance, MailChimp reached out to say we can’t use them anymore because we are a crypto exchange company and they don’t support crypto exchange companies at the moment.\nSome just think of us as a crypto exchange or platform for sending cash.\nSo, there are four major things we do: the crypto exchange, Sendcash, Sendcash Pay, and the OTC desk, which is a way for businesses to effectively move money across borders.\nSQ: How would you describe the Buycoins users?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Airtel records $1.03bn in revenue for Q3 2021 as data revenue increases by almost $100m, surpassing growths in voice and mobile money",
    "summarized_story": "Airtel’s Q3 2021 revenue breakdown.\nData went from $283 million to $377 million within the same period, signifying a 33.0% — $94 million — increase.\nAccording to MTN Nigeria’s financials for Q3 2021, voice also led with a revenue of $234.3 million; data came in second at $137.68 million.\nIt rose from $216 million in Q3 2020 to $233 million in Q3 2021.\nAirtel attributes its data revenue growth to an increase in data usage per customer."
  },
  {
    "headline": "NIN-SIM linkage extension, School abductions in Nigeria, Airtel Africa’s H1 results",
    "summarized_story": "A smattering of progress: In July 2021, the NCC said there were 59.8 million unique NIN enrolments.\nSince then, at least 1,800 school children have been abducted.\nAccording to Intelligence by Techpoint, with 11 abductions this year, more school children were kidnapped in 2021 than in previous years.\nData comes in a close second with $733 million, in comparison to $548 million in the same period last year.\nFlowing from our earlier discussion on the number of kidnapped children, the graph above shows the reported number of abducted school children in Nigeria by state since 2014."
  },
  {
    "headline": "Bolt’s EV option, aYo Holdings’ new business model, Facebook’s new name, Namibia’s crime-busting plans",
    "summarized_story": "The company plans to drive greater scale, better customer experience, and faster access to markets across the African continent in the coming years.\n50 countries in Africa have introduced mandatory SIM card registration laws.\nUa-Ndjarakana said that the SIM card registration process would be done to protect consumers’ privacy.\nDo you think SIM card registration combats crime or increases surveillance in Africa?\nVictoria Fakiya for Techpoint Africa."
  },
  {
    "headline": "Edo unveils plans, activities for Alaghodaro Summit 2021 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, on Monday, announced plans and programme of activities for the fifth edition of the Alaghodaro Investment Summit, held annually to mark the anniversary of the Governor Godwin Obaseki-led administration.\nHe said some projects to be commissioned as part of activities for the Alaghodaro Summit 2021include the John Odigie-Oyegun Training Centre, New High Court Building, Creative Hub, amongst others.\nOgie noted that the fifth edition of the summit, with the theme, “Edo of Our Dreams: Building a Sustainable Future,” will be held from Friday, November 12 to 14, 2021, at different venues across Benin City, the Edo State capital.\nHe explained that the annual summit, which is organized by the Edo State Government in collaboration with private sector partners, is aimed at showcasing investment opportunities and engendering economic prosperity in the state.\n“You are once again invited to join us in building a sustainable future, as we collectively work to make Edo great again.”..."
  },
  {
    "headline": "TUESDAY SERMON: COME UNTO ME – Nigerian Observer",
    "summarized_story": "“Come unto me all ye that labour and are heavy laden, and I will give you rest.\n9:4So Jesus Christ actually came to set people free from all the problems that confront them and from sins that easily beset them.\nWhen that woman from Samaria received pardon from Jesus Christ she went to preach Christ to people bringing them to Christ: “Come, see a man which told me all things that ever I did: is not this the Christ?\nExcept you are meek and lowly in heart like Jesus you cannot come to Christ to give you rest.\nAnd they said believe on the Lord Jesus Christ and thou shalt be saved, and thy house.” Act 16:30-31."
  },
  {
    "headline": "Edo SUBEB Chair, Salami outlines board’s priorities under EdoBEST 2.0 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Chairman of Edo State Universal Basic Education Board (Edo SUBEB), Mrs. Ozavize Salami has outlined priorities of the board under her leadership as the board strategises to consolidate on gains ofthe Edo Basic Education Sector Transformation (EdoBEST).\nSalami, at her maiden schools’ visit as Edo SUBEB Chairman, listed some of the priorities to include learner progression, strengthened school governance and management, child protection/safeguarding, focused in-service professional development, public-private partnerships and enhanced school environment.\nShe disclosed that, in line with the Universal Basic Education (UBE) disarticulation policy, the Edo State Ministry of Education has handed over 306 Junior Secondary Schools across the state to Edo SUBEB.\nThe schools visited during her tour include Niger College, Idia College, Ozolua Model Primary School, Enikaro Primary School, St. Maria Goretti Girl’s Junior Secondary School, Imaguero Junior Secondary School and Imaguero Primary School.\nSpeaking at Ikpoba-Okha LGA, Salami said, “Edo SUBEB takes the responsibility of providing quality education service to pupils very seriously; improving learning outcomes must be at the heart of all we do."
  },
  {
    "headline": "World Stroke Day: Obaseki urges residents to take advantage of health insurance to check menace – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has urged residents in the state to take advantage of the state government’s Health Insurance Scheme to prevent the risks of stroke.\nThe governor said this in commemoration of the World Stroke Day marked by the World Stroke Foundation.\nThe governor added, “It is important for stakeholders to sustain enlightenment campaigns that encourage people to adopt health behaviours that limit the risk of stroke.\nAccording to the World Stroke Foundation, “When somebody has a stroke, every second that goes by is crucial.\nAs brain tissue and millions of neurons begin to fade away, time could not be more precious.”..."
  },
  {
    "headline": "Police order investigation into raid on Mary Odilli’s residence",
    "summarized_story": "The Nigerian Police authorities have ordered “detailed” investigations into the recent invasion of the residence of a Supreme Court Justice, Mary Odili.\nMrs Odili’s Abuja residence was raided by armed security operatives last week.\nConsequently, the IGP has directed the Force Intelligence Bureau (FIB) to conduct a discrete investigation into the incident.\nHe assured the commitment of the Force to the safety and security of the members of the Judiciary and Nigerians in general.\nThe IGP assured that the details of Police investigations would be made public on conclusion of investigations."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Four dead, many trapped as 21-storey building collapses in Ikoyi, Lagos",
    "summarized_story": "At least four persons are reported to have died, while several others are injured under the rubble of a 21-storey building that collapsed at Musikiu Junction by Gerard Road, Ikoyi, Lagos.\nThe building which was still under construction caved in at about 2pm, burying workers at the sight.\nMen of the Federal, state Fire Services and Rescue Team and men of Lagos State Emergency Management Agency, LASEMA, are currently at the scene of the incident to salvage the lives of those trapped.\nIt is reported that many construction workers and developers of the building, identified as Mr Wale Bobb are among the victims trapped under the rubbles.\nThe Acting Coordinator, National Emergency Management Agency, NEMA, Lagos State, Ibrahim Farinloye, who confirmed it said rescue operation is ongoing."
  },
  {
    "headline": "U.S. Consulate Supports STEM Workshops for 500 Students in Lagos",
    "summarized_story": "From October 12 to 28, more than 500 high school students from underserved communities of Agege, Alimosho and Ifako-Ijaiye in Lagos Education District 1, participated in a series of STEM workshops sponsored by the U.S. Consulate General in Lagos.\nHe noted that ensuring access to opportunities in STEM fields drives innovation and create conditions for a more prosperous society.\nThe capacity building program tagged “Global Air Drone Challenge for Students” was led by instructors from U.S.-headquartered Global Air Drone Academy in partnership with the Lagos State Ministry of Education.\nThe Global Air Drone Challenge for Students builds on the five-day Global Air Drone Challenge for Teachers which introduced 50 teachers from Agege, Alimosho and Ifako-Ijaiye to the best practices in implementing an integrated approach to teaching STEM in the classroom.\nThese capacity building workshops for teachers and students support the U.S. Mission’s goal of strengthening human capital for inclusive Nigerian economic growth and human development."
  },
  {
    "headline": "Kennedy Uzoka, UBA GMD wins ‘Finovator of the Year’ Award",
    "summarized_story": "Mr. Kennedy Uzoka, Group Managing Director/Chief Executive Officer of United Bank for Africa (UBA) Plc, has emerged winner of the Finovator of the Year Award for 2021.\nThe Finovator of the Year’ Award is organised by the Finnovex West Africa Awards 2021, co-located with Finnovex West Africa Virtual Summit.\nUzoka was chosen as the winner in recognition and appreciation of his efforts and exceptional value provided in the field of financial services.\nA statement from the bank earlier today, said UBA, Africa’s global bank, also bagged the ‘Excellence in Digital Banking’ award at the same event.\nUBA, Africa’s global bank, offers financial services to more than 25 million customers, across over 1,000 business offices and customer touch points, in 20 African countries."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "BREAKING: EFCC Quizzes Obi Cubana Over Alleged Tax Fraud, Money Laundering",
    "summarized_story": "Popular socialite and businessman, Obinna Iyiegbu, a.k.a Obi Cubana, is currently being quizzed by the Economic and Financial Crimes Commission (EFCC).\nThis follows his honouring of the invitation extended to him by the EFCC over some issues bothering on alleged tax fraud and money laundering.\nThe EFCC sources said the Anambra-born tycoon who arrived the headquarters of the EFCC at Jabi District, Abuja at about noon on Monday November 1, 2021, is currently being interrogated by operatives of the Commission as at the press time.\nThe sources also said allegations against the socialite were sketchy as of press time but they border on alleged money laundering and tax fraud.\nWhen contacted, spokesman of the Commission, Wilson Uwujaren, said he was yet to be briefed on the development."
  },
  {
    "headline": "BREAKING: EFCC Quizzes Obi Cubana Over Alleged Tax Fraud, Money Laundering",
    "summarized_story": "Popular socialite and businessman, Obinna Iyiegbu, a.k.a Obi Cubana, is currently being quizzed by the Economic and Financial Crimes Commission (EFCC).\nThis follows his honouring of the invitation extended to him by the EFCC over some issues bothering on alleged tax fraud and money laundering.\nThe EFCC sources said the Anambra-born tycoon who arrived the headquarters of the EFCC at Jabi District, Abuja at about noon on Monday November 1, 2021, is currently being interrogated by operatives of the Commission as at the press time.\nThe sources also said allegations against the socialite were sketchy as of press time but they border on alleged money laundering and tax fraud.\nWhen contacted, spokesman of the Commission, Wilson Uwujaren, said he was yet to be briefed on the development."
  },
  {
    "headline": "Zamfara Attack: NSCDC Boss Advocates New Approaches To Tackle Insecurity",
    "summarized_story": "Following a recent assault on members of the Joint Task Force by bandits in Zamfara State, the Commandant General, Nigeria Security and Civil Defence Corps(NSCDC), Ahmed Abubakar Audi, has called for new approaches against all criminal elements threatening the internal peace and security of Nigeria.\nAudi, while reacting to the incident, which left one police officer and two officers of the NSCDC dead, strongly condemned the deadly attack on security operatives, innocent citizens and critical national assets and infrastructure.\nHe described the attack, which happened in Shinkafi, along Kauran Namoda road in Zamfara State, while the operatives were on deployment to checkmate the rising wave of banditry, kidnapping and other heinous crimes in the state, as not only condemnable but callous, despicable and inhuman.\nHe praised the efforts and resilience of the gallant operatives for preventing greater loss of lives and destruction of public property, assuring that efforts would be fully mobilized to go after the bandits, apprehend and deal decisively with them under the full weight of the law.\nADVERTISEMENTAudi appealed to members of the public to be vigilant, security conscious and to promptly assist security agencies with credible information that could lead to the arrest of these criminals who perpetrated this despicable act before they cause more havoc in the society."
  },
  {
    "headline": "Zamfara Attack: NSCDC Boss Advocates New Approaches To Tackle Insecurity",
    "summarized_story": "Following a recent assault on members of the Joint Task Force by bandits in Zamfara State, the Commandant General, Nigeria Security and Civil Defence Corps(NSCDC), Ahmed Abubakar Audi, has called for new approaches against all criminal elements threatening the internal peace and security of Nigeria.\nAudi, while reacting to the incident, which left one police officer and two officers of the NSCDC dead, strongly condemned the deadly attack on security operatives, innocent citizens and critical national assets and infrastructure.\nHe described the attack, which happened in Shinkafi, along Kauran Namoda road in Zamfara State, while the operatives were on deployment to checkmate the rising wave of banditry, kidnapping and other heinous crimes in the state, as not only condemnable but callous, despicable and inhuman.\nHe praised the efforts and resilience of the gallant operatives for preventing greater loss of lives and destruction of public property, assuring that efforts would be fully mobilized to go after the bandits, apprehend and deal decisively with them under the full weight of the law.\nADVERTISEMENTAudi appealed to members of the public to be vigilant, security conscious and to promptly assist security agencies with credible information that could lead to the arrest of these criminals who perpetrated this despicable act before they cause more havoc in the society."
  },
  {
    "headline": "Anambra Election: Group Says APGA Has Failed",
    "summarized_story": "Ahead of the Anambra State governorship election scheduled to hold on Saturday, November 6, 2021, a political pressure group, Coalition for True Democracy (CTD), has described the government of the All Progressives Grand Alliance (APGA) in the State as a colossal failure, which doesn’t deserve a reelection.\nIn a statement on Monday in Awka, Anambra State, the coordinator of the group, Mr. Samuel Okolo, said APGA has succeeded in taking the state 20 years backward 30 years after its creation.\nADVERTISEMENT“We as a political pressure group have done a critical evaluation of this administration and seen the high level of man in humanity to man.\nAccording to him, Obiano administration inherited N75 billion from the Peter Obi administration, but the APGA government has allegedly “squandered” it.\n“Wastage of Anambra tax payer’s money will not return APGA and its candidate, Prof Chukwuma Soludo to power as the Anambra electorate are wiser and better informed now more than ever before."
  },
  {
    "headline": "Woman Docked for N15m Fraud in Maiduguri, Gets N20m Bail",
    "summarized_story": "Afterwards, the complainant, defendant and her son through their lawyers signed an agreement to use the ten vehicles owned by Nehemiah for a ‘‘car hire business’’ and the proceeds derived to pay the complainant monthly until the N15million was fully repaid.\nProsecution counsel, Fatsuma Muhammad asked for a trial date and urged the court to remand the defendant pending the outcome of the case.\nBut counsel for the defendant, A. M. Balami applied for bail his client.\nJustice Kumaliya after listening to both parties granted the defendant bail.\nIn her words, ‘‘the defendant is admitted to bail in the sum of N20m with two sureties in like sum."
  },
  {
    "headline": "Woman Docked for N15m Fraud in Maiduguri, Gets N20m Bail",
    "summarized_story": "Afterwards, the complainant, defendant and her son through their lawyers signed an agreement to use the ten vehicles owned by Nehemiah for a ‘‘car hire business’’ and the proceeds derived to pay the complainant monthly until the N15million was fully repaid.\nProsecution counsel, Fatsuma Muhammad asked for a trial date and urged the court to remand the defendant pending the outcome of the case.\nBut counsel for the defendant, A. M. Balami applied for bail his client.\nJustice Kumaliya after listening to both parties granted the defendant bail.\nIn her words, ‘‘the defendant is admitted to bail in the sum of N20m with two sureties in like sum."
  },
  {
    "headline": "Halloween horror: About 12 killed, 52 injured in weekend mass shootings in US",
    "summarized_story": "It was one of at least 11 mass shootings in the US over the holiday weekend, including several at places where crowds had assembled.\nThe number of mass shootings in the US increased during the coronavirus pandemic.\nThere have been 599 mass shootings so far this year, according to the archive.\nOver the weekend, gunfire erupted at house parties, a boxing event and on the streets.\nThese are the mass shootings that took place across seven states."
  },
  {
    "headline": "Halloween horror: About 12 killed, 52 injured in weekend mass shootings in US",
    "summarized_story": "It was one of at least 11 mass shootings in the US over the holiday weekend, including several at places where crowds had assembled.\nThe number of mass shootings in the US increased during the coronavirus pandemic.\nThere have been 599 mass shootings so far this year, according to the archive.\nOver the weekend, gunfire erupted at house parties, a boxing event and on the streets.\nThese are the mass shootings that took place across seven states."
  },
  {
    "headline": "JUST IN: Obi Cubana arrested by EFCC",
    "summarized_story": "Night club owner Obinna Iyiegbu, a.k.a Obi Cubana has been arrested by the EFCC, according to multiple reports.\nHe was arrested by the EFCC today and is now being questioned at the commission’s headquarters in Abuja over money laundering allegations.\nHe reportedly arrived at the EFCC office around noon on Monday.\nSpokesman of the EFCC, Wilson Uwujaren is yet to issue an official statement.\nObi Cubana made headlines a few months ago when he buried his mum in a lavish and ostentatious manner."
  },
  {
    "headline": "U.S. millionaire Robert Durst indicted for wife's murder 39 years after",
    "summarized_story": "Agency ReportsMillionaire real estate scion Robert Durst was indicted Monday for the murder of his first wife, Kathie Durst, who disappeared nearly four decades ago, prosecutors said.\nA warrant has been issued for his arrest in the killing of Kathie Durst, Westchester District Attorney Mimi Rocah said in a statement announcing the indictment.\nKathie Durst was 29 and in her final months of medical school when she was last seen.\nRelated News U.S.millionaire Robert Durst convicted for killing best friendShe and Robert Durst, who was 38 at the time, had been married nearly nine years and were living in South Salem, a community in Lewisboro.\nDurst, testifying in the Los Angeles trial in August, denied killing Kathie Durst."
  },
  {
    "headline": "BREAKING: EFCC Arrests Obi Cubana For Money Laundering, Tax Fraud",
    "summarized_story": "Obinna Iyiegbu, nicknamed Obi Cubana, a well-known socialite and businessman, has been detained for money laundering by the Economic and Financial Crimes Commission.\nThough details about the claims against the socialite were scarce at press time, a source said his case included alleged money laundering and tax fraud.\nThe source said, “Obi Cubana was arrested and brought to the EFCC headquarters on Monday afternoon over allegations of money laundering and tax fraud.\nObi Cubana made news in July when he conducted an elaborate burial for his mother in Oba, Anambra State, reportedly killing over 200 cows.\nMany Nigerians were curious about his source of money after seeing his ostentatious display of wealth."
  },
  {
    "headline": "EFCC Confirms Army’s Handover Of 20 Arrested TASUED Students",
    "summarized_story": "The handover of Tai Solarin University of Education (TASUED) students arrested by the Nigerian Army has been confirmed by the Economic and Financial Crimes Commission (EFCC).\nThe alleged online fraudsters were taken to the EFCC Ibadan zonal command by officials from the 12 Field Engineering Regiment in Ijebu Ode, Ogun State.\nThe students were apprehended during a brawl with soldiers last Thursday as they celebrated the completion of their final exam.\nOthers include Bamgboye Tobiloba Quadri, Ayede Opeyemi Oluwaseun, Oseni Abolore Ismail, Olaniyan Mayowa Emmanuel, Akanni Qudus Olaleye and Onasile Abiodun Sunday.\nIn the current inquiry, 19 of the 20 pupils have been indicted, according to Uwujaren."
  },
  {
    "headline": "Corpses Recovered From Collapsed 21-storey Building In Lagos",
    "summarized_story": "Three bodies have been discovered from the ruins of a 21-story skyscraper that fell in Lagos State on Monday afternoon.\nThe structure, which was under construction and located off Alexander Way, Gerrard Road in Ikoyi, collapsed, trapping an unidentified number of construction workers, according to DAILY POST.\nWhile speaking with reporters at the scene, Ibrahim Farinloye, Coordinator of the National Emergency Management Agency (NEMA), stated that three lifeless bodies had been discovered and sent to a state-owned morgue.\n“The deceased bodies were pulled out from under the rubble,” he said.\nIt was also gathered that three persons have been rescued and are currently being treated by the medical team of the Lagos State General Hospital."
  },
  {
    "headline": "BREAKING: IGP Orders Probe Into Invasion Of Mary Odili’s Home",
    "summarized_story": "Usman Alkali Baba, inspector-general of police (IGP), has ordered an investigation into the raid on the home of Mary Odili, a judge of the supreme court.\nOn Friday, security operatives stormed the Abuja residence of the supreme court justice over an allegation that illegal activities were going on there.\nDocuments seen by The Cable have revealed that the warrant presented by security operatives to search Odili’s residence bore a wrong address.\nIn a statement issued on Monday, Frank Mba, force public relations officer, quoted Baba as describing the invasion as “unacceptable”.\n“The IGP assured that the details of Police investigations would be made public on conclusion of investigations.”"
  },
  {
    "headline": "Exposed! Why Ikoyi 21-storey building collapsed, killed, trapped many",
    "summarized_story": "The initial firm handling the collapsed 21-storey building along Gerrard Road, Ikoyi, Lagos state, has said it pulled out of site when its clients insisted on going beyond 4-storey building.\nNAN reports that many were feared trapped as the storey building under construction collapsed in Ikoyi.\nThis latest building collapse is coming barely a month after three persons were reportedly trapped and another killed when a building collapsed in Ikorodu area of Lagos state last month.\nLASEMA spokesman, Nosa Okunbo, confirmed the incident in a terse electronic statement which said: “A 25-storey building collapsed by Musliu Junction, Ikoyi, Lagos.\nOsanyintolu said: “Collapsed Building at Gerard Road, Ikoyi: The agency has activated its emergency response plan to the above incident."
  },
  {
    "headline": "Pictures: Rescue operation on as 21-storey building collapses in Lagos",
    "summarized_story": ""
  },
  {
    "headline": "Pictures: FG reassures youth inclusiveness, support as first NYC kicks off",
    "summarized_story": "President Muhammadu Buhari who declared the epoch-making event open said his administration has designed and delivered innovative means of empowering Nigerian youths.\nEarlier, Minister of Youth and Sports development, Chief Sunday Dare, said November 1 is a day set aside by the African Union Commission and dedicated by the federal government to celebrate Nigerian youth.\nThe Minister revealed that already the Youth and Sports Ministry has designed programmes aimed at creating viable opportunities for youth.\n“The DEEL programme helps to fill the knowledge and skills gap in the Nigerian youth.\n“The Nigerian Youth Investment Fund (NYIF) scheme provides access to funds much needed by MSMEs and thousands of our youth are benefiting."
  },
  {
    "headline": "President does not have powers to pardon convicted corrupt public servants- CCB -NigPilot",
    "summarized_story": "The Code of Conduct Bureau, CCB has disclosed that the Office of the Nigerian Presidency does not have the power to pardon nor commute the sentence of any public official convicted of corrupt practices in Government.\nHe also revealed that corruption does not offer double jeopardy to the convicted, stating that an officer convicted for corrupt practices could be retried on the same offence.\nWhile stressing that corruption was a worldwide phenomenon, the CCB regretted that Nigeria was usually presented as a country with a high incidence of corrupt practices in government, adding that Nigeria had established institutions meant to check corrupt practices in the public service.\nThe Economic and Financial Crimes Commission, EFCC its own presentation, defined corruption as abuse of public office for private gain.\nDeterrence is now the norm in fighting corruption, not prevention."
  },
  {
    "headline": "President does not have powers to pardon convicted corrupt public servants- CCB -NigPilot",
    "summarized_story": "The Code of Conduct Bureau, CCB has disclosed that the Office of the Nigerian Presidency does not have the power to pardon nor commute the sentence of any public official convicted of corrupt practices in Government.\nHe also revealed that corruption does not offer double jeopardy to the convicted, stating that an officer convicted for corrupt practices could be retried on the same offence.\nWhile stressing that corruption was a worldwide phenomenon, the CCB regretted that Nigeria was usually presented as a country with a high incidence of corrupt practices in government, adding that Nigeria had established institutions meant to check corrupt practices in the public service.\nThe Economic and Financial Crimes Commission, EFCC its own presentation, defined corruption as abuse of public office for private gain.\nDeterrence is now the norm in fighting corruption, not prevention."
  },
  {
    "headline": "Uniport Alumni Felicitate with V.C, Uniport on Ranking as 5th Best University in Nigeria -NigPilot",
    "summarized_story": "The University of Port Harcourt Alumni has felicitated with the Vice-Chancellor and the entire Uniport community on its recent ranking as the 5th best University in Nigeria.\nThis, the Alumni insisted was made possible owing to the dynamic and visionary leadership of the Vice-Chancellor Prof. Georgewill Owunari.\nIn a congratulatory message over the weekend, Ag.\nHe stated that the recognition is a great achievement born out of hard work and resilience of the V.C and members of the University Committee.\nAlso, the Uniport Alumni President described the ranking as a big plus for the University of Port Harcourt and another endorsement of the University’s acclaimed commitment to excellence."
  },
  {
    "headline": "Uniport Alumni Felicitate with V.C, Uniport on Ranking as 5th Best University in Nigeria -NigPilot",
    "summarized_story": "The University of Port Harcourt Alumni has felicitated with the Vice-Chancellor and the entire Uniport community on its recent ranking as the 5th best University in Nigeria.\nThis, the Alumni insisted was made possible owing to the dynamic and visionary leadership of the Vice-Chancellor Prof. Georgewill Owunari.\nIn a congratulatory message over the weekend, Ag.\nHe stated that the recognition is a great achievement born out of hard work and resilience of the V.C and members of the University Committee.\nAlso, the Uniport Alumni President described the ranking as a big plus for the University of Port Harcourt and another endorsement of the University’s acclaimed commitment to excellence."
  },
  {
    "headline": "Pam urges youths to fight for peace of Nigeria -NigPilot",
    "summarized_story": "Executive Secretary of the Nigeria Christian Pilgrim Commission , NCPC, Rev.\nYakubu Pam has advised the Nigerian youth to fight for the peace of Nigeria.\nHe lauded the youths for their initiatives and relentless efforts of coming together as one body to fight and propagate peace in Nigeria.\n“Nigeria has hope and that hope lies on the youths, this is not a vision to look down upon,” he said.\nHe further called on institutions to inculcate peace building as part of their curriculum, while reaching out to the government to ensure that peace building forms part of the Nigerian educational curriculum in different levels of education."
  },
  {
    "headline": "Ikoyi Building Collapse: Four Dead As Rescue Operations Continue For Survivors",
    "summarized_story": "﻿At least four persons have died after a high-rise building collapsed in the Ikoyi area of Lagos on Monday.\nSome five persons have also been rescued alive as rescue operations intensified into the night.\nNear Monday’s collapse site, soldiers kept back a crowd of onlookers watching the rescue operation.\nLagos State police commissioner Hakeem Olusegun Odumosu said it was still too early to determine the cause of the collapse.\n“One of my partners is dead.”Taiwo Sule, 21, another worker, said he had seen five bodies on top of the collapsed building, where he had tried to help recover them."
  },
  {
    "headline": "PHOTOS: Rescuers Scramble To Search For Ikoyi Building Collapse Survivors",
    "summarized_story": "﻿It was a sad day for many Lagos residents after a high-rise building collapsed in the high-brow neighbourhood of Ikoyi, trapping many persons.\nThe building was said to be under construction before it caved in and crumbled, shattering the dreams of those caught within it.\nAt least three bodies have been recovered from the site as rescue operations intensified into Monday night.\nSee photos below:"
  },
  {
    "headline": "COP26: World Leaders In Glasgow For ‘Last, Best Hope’ Climate Summit",
    "summarized_story": "﻿More than 120 world leaders meet in Glasgow on Monday in a “last, best hope” to tackle the climate crisis and avert a looming global disaster.\n“It’s one minute to midnight and we need to act now,” British Prime Minister Boris Johnson was due to tell them, according to extracts from his speech.\nBut this did not convince NGOs, the British prime minister, or the United Nations.\nCOP26 marks the “last, best hope to keep 1.5C in reach”, summit president Alok Sharma said as he opened the meeting on Sunday.\nThis goal has been postponed to 2023, exacerbating the crisis of confidence between the North, responsible for global warming, and the South, which is the victim of its effects."
  },
  {
    "headline": "Troops Kill Over 30 Terrorists During Raid In Borno",
    "summarized_story": "Over 30 terrorists have been killed following a raid by joint troops of Operation Hadin Kai (OPHK) carrying out onslaughts on terrorists’ enclaves in the North East.\nThe spokesman for the Nigerian Army, Brigadier General Onyema Nwachukwu, who disclosed this in a statement on Sunday said the raid was part of intensified operations by the military in the region.\n“In the early hours of Saturday 30 October 2021, the vigilant troops observed the movement of six gun trucks within Sambisa Forest general area, which were subsequently located at a settlement near Yuwe,” General Nwachukwu narrated.\n“The air crew immediately relayed the coordinates of the location of the gun trucks to troops of the Land Component at Bama, who promptly engaged the location with artillery fire bombardment, neutralising the insurgents’ gun trucks,” he said.\nHe asserted that troops of OPHK remained resolute and unshaken in their effort to bring the insurgents to their knees."
  },
  {
    "headline": "CDS Calls For Increased Collaboration In The Armed Forces",
    "summarized_story": "﻿The Chief of Defence Staff, General Lucky Irabor, says there is a greater need for stronger collaboration in the armed forces, in order to effectively deal with contemporary security challenges in the country.\nThe defence chief made the remarks at the ongoing joint military operations planning exercise in Abuja, a week-long event that aims to prepare the Nigerian military on quick and effective response to contemporary and potential security threats in the country.\nREAD ALSO: Ongoing Exercise Not Aimed At Military Occupation Of South East – Nigerian ArmyAccording to him, several ongoing military operations across the country, require collaboration between the army, navy, air force and the police to succeed.\nThere are several ongoing military operations across the country.\nThese operations are are either targeted at combating security threats posed by proscribed groups, or other organized criminal groups who kidnap, kill or attack public infrastructure across the country."
  },
  {
    "headline": "BREAKING: 21-Storey building collapses in Lagos -",
    "summarized_story": "A 21-storey building under construction in the Ikoyi area of Lagos state has collapsed.\nTVC News reliably gathered that many are feared trapped.\nThe Lagos State Emergency Agency which confirmed the development, says it has activated its emergency response plan.\nLASEMA added that all first responders are enroute to secure the scene while the heavy duty equipment and life detection equipment have been dispatched."
  },
  {
    "headline": "CBN announces criteria for selection of companies in 100 for 100 PPP",
    "summarized_story": "The Central Bank of Nigeria (CBN) has announced the criteria for private sector companies to be considered for participation in the 100 for 100 Policy on Production and Productivity (PPP).\nAccording to the CBN, participants in the PPP will be selected based on their immediate contribution to economic growth, job creation, and social impact.\nThe new CBN’s 100 for 100 financial instrument aims to reduce the country’s reliance on imports by establishing a platform that identifies and supports the right companies and projects that have the potential to transform and jumpstart the economy’s productive base.\nThe CBN also added that the 100 for 100 PPP intervention will provide Naira Intervention funding through existing CBN intervention processes, as well as complete FX funding for new machinery (this instrument is for only new projects, will not cover any refinance of existing facilities and will be subject to independent evaluation by international audit firms).\nTo complement and propel the initiative, the CBN said it will work with fiscal authorities to facilitate power sector, port, and export reforms, as well as ease of doing business, to improve Nigeria’s competitiveness."
  },
  {
    "headline": "Gov Matawalle orders reopening of weekly markets in five LGAs -",
    "summarized_story": "The Zamfara State Government has ordered the Immediate reopening of weekly markets in five local governments of the stateThe Markets Includes Gusau Central market in Gusau local government,, Nasarawa Burukullu market in Bukuyyum Local government, Shinkafi weekly market in Shinkafi local government , Kasuwan Daji market in Kaura Namoda and Talata Mafara weekly market in Talata Mafara local government areaIn a press statement signed by the state Commissioner for Information Ibrahim Dosara says, the move becomes necessary following improvement on the Security situation in the affected governments.\nThe statement adds that ban on the sale and movement of cattle in and out of the state is still in place.\nIbrahim Dosara noted that Government will deal decisively with any person or group taking laws into their hands.\nThe Government also enjoin residents to embrace peace , report any suspicious person or movements and continue to support security agencies at all times to rid the state of criminal elements.\nZamfara State Government had in August this year closed all weekly markets and movement of cattle in and out of the state as part of measures to stem the tide of Banditry, Kidnapping and cattle rustling."
  },
  {
    "headline": "Youth protest impeachment of Plateau Assembly speaker",
    "summarized_story": "Some Youths have converged on the premises of the Plateau State House of Assembly, protesting the impeachment of Former Speaker Nuhu Ayuba Abok.\nRecent PostsNews Feed RSS Error: WP HTTP Error: A valid URL was not provided.\nArchives Archives Select Month November 2021 (18) October 2021 (496) September 2021 (546) August 2021 (544) July 2021 (519) June 2021 (603) May 2021 (614) April 2021 (693) March 2021 (769) February 2021 (685) January 2021 (770) December 2020 (677) November 2020 (609) October 2020 (507) September 2020 (780) August 2020 (768) July 2020 (735) June 2020 (682) May 2020 (532) April 2020 (530) March 2020 (456) February 2020 (486) January 2020 (656) December 2019 (705) November 2019 (650) October 2019 (607) September 2019 (574) August 2019 (631) July 2019 (719) June 2019 (747) May 2019 (908) April 2019 (620) March 2019 (516) February 2019 (528) January 2019 (561) December 2018 (492) November 2018 (583) October 2018 (616) September 2018 (568) August 2018 (585) July 2018 (500) June 2018 (437) May 2018 (408) April 2018 (430) March 2018 (510) February 2018 (547) January 2018 (550) December 2017 (291) November 2017 (498) October 2017 (715) September 2017 (675) August 2017 (689) July 2017 (671) June 2017 (679) May 2017 (987) April 2017 (1042) March 2017 (1141) February 2017 (676) January 2017 (612) December 2016 (596) November 2016 (571) October 2016 (639) September 2016 (162) March 2016 (39) May 2015 (1)Categories Categories Select Category #AnambraVotes (15) #Ekiti2018 (25) #EkitiVotes (14) #LagosBuildingCollapse (2) #LiberiaRunOff (6) #OsunDebate (5) #OsunVotes (29) America (554) Asia (279) Athletics (113) Basketball (44) Boxing (69) Breaking News (118) Business News (5,406) Central Africa (85) East Africa (179) Election 2019 (26) Entertainment News (703) Europe (405) Events (16) Fashion (5) fashion & style (15) Featured (533) Football (1,584) Formula 1 (19) Golf (15) Health News (2,204) inside lagos (1) International (7,174) Kogi Election (10) labour lens (5) Lassa Fever & Coronavirus (18) Latest News (25,728) Africa (363) West Africa (184) Livestream (3) Metro (25) Middle East (174) Movies (31) Music (74) Nigeria News (21,379) Nollywood (34) Non classifié(e) (1) North Africa (175) Politics News (5,631) #EdoDecides (22) #LagosCouncilElections (4) #NigeriaVotes (240) #OndoDecides (100) Bayelsa Election (7) nnamdi kalu (9) Presidential Election (45) Science & Technology (8) Shows (2) Southern Africa (173) Sports News (3,415) Table Tennis (20) Tech (22) Tennis (111) the platform (1) Top Stories (38) U-Report (5) Uncategorized (284) VIDEO (1,201) Business Nigeria (3) Business Week (2) Community Forum (11) Crime Watch (102) Fireworks (13) Green Angle (4) Journalists Hangout (106) News at 10 PM (23) Special Reports (112) Sports Debate (32) Sports Desk (3) Standpoint (1) The Big Issue (4) The Sunday Interview (108) This Morning (85) TVC Breakfast (831) TVC Investigates (6) Wildlife (5) World News (2,040)"
  },
  {
    "headline": "Godwin Maduka: Anambra State Is a War Zone",
    "summarized_story": "Keeping track of the buildup to the November 6th Governorship Election in Anambra State, ARISE News spoke to Accord Party’s candidate, Dr Godwin Maduka on how insecurity and the threat of a state of emergency is shaping the campaigns.\nWatch the interview for more…"
  },
  {
    "headline": "Nigeria: 21-Storey Building Under Construction Collapses in Ikoyi",
    "summarized_story": "A 21-storey building under construction has just collapsed on Gerrard Road, Ikoyi.\nScores are trapped in the rubble building located just after the Onikoyi Road junction.\nDetails later…"
  },
  {
    "headline": "Atiku Says Nigeria Has Never Been In Such Bad Shape – Trending With Ojy Okpe",
    "summarized_story": "The national convention of the Peoples Democratic Party in Abuja took centre stage on social media over the weekend, following comments by various party stakeholders.\nFormer Vice President Atiku Abubakar said Nigeria was passing through the most difficult period of its existence and that, in his lifetime of over 70 years, he has never seen the country in such bad shape.\nMeanwhile on Sunday, news that wife of the late spokesperson of Afenifere, Yinka Odumakin, delivered a set of twins in the United States made waves on social media.\nThe family announced that the set of twins, a boy and a girl and mother Dr. Joe Okei-Odumakin are in excellent health condition.\nThe Governor while explaining the title of the budget, says it is a cascade of so many projects, back to back, to ensure their completion."
  },
  {
    "headline": "World Leaders Take Centre Stage at Glasgow Climate Talks",
    "summarized_story": "It’s time for more than 130 world leaders to feel the heat.\nThat leaves India’s Modi the only leader present from the so-called BRICS nations, which account for more than 40% of global emissions.\nKevin Conrad, a negotiator from Papua New Guinea who also chairs the Coalition for Rainforest Nations, said he’s watching the big carbon-polluting nations.\nThe Biden administration has tried hard to temper expectations that two weeks of climate talks will produce major breakthroughs on cutting climate-damaging emissions.\nRather than a quick fix, “Glasgow is the beginning of this decade race, if you will,” Biden’s climate envoy, John Kerry, told reporters Sunday."
  },
  {
    "headline": "Ethiopia’s Tigray Crisis: PM Abiy Calls on Citizens to Take Up Arms Against Rebels",
    "summarized_story": "Ethiopia’s Prime Minister, Abiy Ahmed, has appealed to citizens to take up arms to block advancing rebel fighters.\nHe made the call on Facebook after the rebels, from the northern Tigray state, reportedly seized control of more towns in neighbouring Amhara.\nThe Tigray People’s Liberation Front (TPLF) says its aim is to break a siege of the northern region.\nIn his statement on Sunday, Mr Abiy said the rebels’ advance was “pushing the country to its demise”.\nHe urged citizens to “organise and march through [any] legal manner with every weapon and power… to prevent, reverse and bury the terrorist TPLF”, according to a translation on the Addis Standard news site."
  }
]