[
  {
    "headline": "Nigeria wants transparency to eliminate fraud in government activities -Onu",
    "summarized_story": "The Minister of Science and Technology, Dr. Ogbonnaya Onu, has said Nigeria needs transparency in governance to eliminate all fraud in all government activities and in the private sector.\nThe statement was titled ‘Onu: Nigeria will overcome security challenges.’According to the minister, the country has the needed resources, both human and material, to tackle the ongoing security challenges, especially by supporting forensic experts with the required evidence to prosecute crime.\nWhile highlighting how the application of cyber security could help reduce malpractices and fraud in government Ministries, Departments and Agencies and the Organised Private Sector in the country, he said there was a need for transparency within the public and private sectors.\n“Nigeria wants transparency in governance to eliminate all fraud in all government activities and in the private sector, which will help to reduce crime in the country,” the statement quoted Onu as saying.\nThe President/Chairman of the Computer Forensics Institute of Nigeria, Prof. Peter Olayiwola, said the aim of the visit was to persuade the ministry to support the rapid execution of the chartered computer forensics bill."
  },
  {
    "headline": "Nigeria’s challenges not insurmountable, says Lalong",
    "summarized_story": "Plateau State Governor, Simon Lalong, says Nigerians will overcome the current challenges facing the nation when they pray and also work with resolve to remove all obstacles to peaceful coexistence, under development and productivity.\nGovernor Lalong was speaking on Friday during the monthly prayer and fasting session held at the Government House Chapel, Rayfield, Jos the state capital.\nLalong who acknowledged that Nigeria is facing challenges of insecurity, unemployment, illiteracy among others, said there is no need to despair because tough times do not last forever.\nHe said, “When we took over, there was so much agony and despondency because of crisis and other suspicious interactions.\nWe will never allow them because our prayer and commitment will defeat these evil people who thrive in creating chaos."
  },
  {
    "headline": "Ayade flags off N8.2b Obudu Ranch Resort Hydro- Electricity Power project",
    "summarized_story": "Kindly Share This Story:By Emma UnaSENATOR Ben Ayade on Thursday flagged off 8.2 billion naira hydro electricity project situated at the Obudu Ranch Resort to provide alternative electricity to the state and other surrounding states.\nSpeaking at the workshop for technicians, and stakeholders in hydro electricity, Senator Ayade bemoaned the failure of Nigeria to utilise the billions of cubit water available in the country to provide alternative power supply in the country.\n“After the construction of the Obudu hydro power project, let the next plant be constructed by Nigerian engineers because we have those willing to acquire the skill”.\nHe said the Chinese who are serving as consultants to the hydro power project adopted the technology from Germany and there is nothing wrong if Nigeria adopts the same approach to meets its electricity needs.\nHe said four types of alternative sources of electricity: hydro, wind, solar are available for exploit in the state."
  },
  {
    "headline": "Rejiging Akwa Ibom economy: The Udom Emmanuel interministerial model (2)",
    "summarized_story": "The developmental torch of the Deacon Udom Emmanuel led administration arrived Oron where twelve life touching projects were commissioned.\nA four Classroom block was reconstructed at St Leo’s Primary School, Okobo Ebughu, a four Classroom block reconstructed at Primary School, Udesi Isong Inyang, a reconstructed four Classroom block at Community Secondary School, Udesi Akai Owo, three-four Classroom blocks renovated at Community Secondary School, Oduo Ebughu, St Paul A Primary School, Ibaka saw a four Classroom block renovated, Primary School, Udesi Isong Inyang has a four Classroom block reconstructed whole Community Secondary School, Oduo Ebughu had a four Classroom block renovated.\nFor Mkpat Enin LGA, a four Classroom block was reconstructed at QIC Community Secondary School, Minya, another four Classroom block reconstructed at St Augustine Primary School, Ikot Ntot, a four Classroom block reconstructed at Government Primary School, Asana/Ibianga while Government Primary School, Ikot Obio Ndoho was blessed to have a four Classroom block completed and commissioned.\nFor the people of Eastern Obolo, a four Classroom block was reconstructed at Government Primary School, Iko Town, and another four Classroom block reconstructed at Government Primary School, Okoro Mbokho.\nAlso, Lutheran Primary School, Nung Oku Ekanem had a four Classroom block renovated, Community Secondary School, Ikot Ebiere witnessed the construction of a four Classroom block, Government Primary School, Ikot Eko Ibon got a reconstructed four Classroom block while a reconstructed four Classroom block was commissioned at Government Primary School, Ikot Edor."
  },
  {
    "headline": "What Nigeria must get right",
    "summarized_story": "Kindly Share This Story:By Clifford Ndujihe, Politics EditorTODAY is a special day in Nigeria’s history.\nIt is the 22nd anniversary of the world’s largest black nation’s fourth democratic sojourn following years of military interregnum.\nYes, the Fourth Republic started on May 29, 1999 on a very promising note.\nHas the country fared well in socio-economic indices?\nNigeria down in 22 yrs!"
  },
  {
    "headline": "Nigeria down in 22 yrs! Why?",
    "summarized_story": "Weak Economic GrowthNotwithstanding these laudable improvements, the economy is still characterised by weak Gross Domestic Growth (GDP) growth amidst steady population growth.\nThough the average GDP growth rate during the 22 years of democracy stands at 5.1 per cent, average growth for the past six years (2015-2020) is 0.68 per cent, far below the average population growth rate of about 2.5 per cent per annum since 1999.\nCBN data shows that oil revenue accounted for 48 per cent of total revenue into the federation account in 2020.\nHis words: “Yes, Nigeria has been in a democratic governance for an unbroken period of 22 years but our democracy has been mostly checkered, manipulated and exploitative.\n“Since the beginning of the current democratic dispensation, Nigeria has not allocated up to the recommended percentage to the sector."
  },
  {
    "headline": "Crisis brews in PDP as12 aspirants spoil for showdown over zoning",
    "summarized_story": "Those who appended their signatures in a communique issued at the end of the meeting are Mr. Walter Okeke,.\nGodwin Maduka, Dr. Winston Udeh, Chief Johnny Maduafokwa, Senator Ugochukwu Uba, Chief Chuma Nzeribe and Chief Emeka Etiaba (SAN).\nPDP aspirants who did not attend the meeting were Dr. Obiora Okonkwo, Dr. Tony Nwoye, Senator Uche Ekwunife and Mrs. Ekwochi.\nApart from Dr. Tony Nwoye who is from Anambra North senatorial zone, the other three are from Anambra Central senatorial zone.\nHowever, some aides of the aspirants who are not from Anambra South argue that there was no agreement about zoning of governorship ticket in the PDP."
  },
  {
    "headline": "Boko Haram suffers heavy defeat as Nigerian troop kills 10 terrorists in Borno",
    "summarized_story": "No fewer than 10 Boko Haram terrorists have been killed by troops of Operation Hadin Kai in Rann, the headquarters of Kala Balge LGA of Borno State.\nThe troops decimated the terrorists during a fierce gun battle on Friday.\nYerima explained that the troops countered the move and inflicted humiliating defeat on the terrorists who abandoned their evil mission and took to their heels.\n‘The troops chased the retreating terrorist and ensured there was no further threat to the town and its residents.\n”Troops successfully destroyed one of the gun trucks and recovered multiple weapons including one anti-aircraft gun, two machine guns and eight AK-47 rifles neutralising ten terrorists in the process,” he added."
  },
  {
    "headline": "Mali coup leader, Col Assimi Goïta named transitional president",
    "summarized_story": "Mali’s constitutional court has installed military coup leader, Colonel Assimi Goïta, as transitional president.\nGoïta had declared himself interim president on Wednesday, two days after seizing power, the second time.\nInterim President, Bah Ndaw and Prime Minister, Moctar Ouane were detained by the military on Monday.\nThey were held along with Defence Minister, Souleymane Doucouré.\nGoita, the former interim Vice President, said they were removed for violating the transition charter."
  },
  {
    "headline": "FG warns Nigerians about IGVM ransomware, money extorting crypto-virus",
    "summarized_story": "The National Information Technology Development Agency (NITDA) has warned Nigerians to be wary of IGVM, a file-encrypting Ransomware infection.\nThe IGVM, according to the agency, restricts access to data (documents, images, videos) by encrypting files with the “igvm” extension.\nNITDA explained that IGVM attempts to extort money from victims by requesting for “ransom”, in the form of Bitcoin cryptocurrency in exchange for access to data.\nThis crypto-virus, according to the agency, spread in different methods like web injectors, pirated software, spam emails, malicious software bundles, fake software updates, and deceiving online ads.\nThe billionaire listed other areas he put money into, but added that he had no problem with those who make their money via digital currency."
  },
  {
    "headline": "Zamfara govt makes clarifications on renewed banditry attacks in State",
    "summarized_story": "The Zamfara State Government has commented that following the recent escalation and the wave of attacks by bandits in some parts of the State, it has become necessary for the State Government to further explain its previous and current position as well as additional measures being taken to contain the situation.\nThis was stated in a press statement signed by the Special Adviser to the Governor on media and publicity, Hon.\nAs you may recall, one of these is the procurement and distribution of 200 brand new vehicles to the security forces.\nIt appears, or even certain, that some forces are bent on frustrating the efforts of this administration to address the security challenge.\nAbubakar Muhammad Dauran, had observed that part of the hurdles hindering the success of the fight against banditry in the state is the lack of quick response by the Security forces in the wake of attacks by bandits."
  },
  {
    "headline": "Adamu Garba compares IPOB with Boko Haram, says they are biggest enemy of South East",
    "summarized_story": "A former presidential aspirant, Adamu Garba has opined that members of the Indigenous People of Biafra, IPOB, are the biggest enemies of the South East and South-Eastern interests, just as Boko Haram is to the North.\nThe former Presidential aspirant who stated this via his Twitter handle further said that “99.9% Igbo people know this, that’s why they take IPOB as a joke.”He also advised that people should not be deceived or get carried away by what they see on social media.\n“As Boko Haram becomes the biggest enemy of the North & Northern interest, so is IPOB the biggest enemy of the South East & South-Eastern interests.\n“The real great 99.9% Igbo people know this, that’s why they take IPOB as a joke.\n“Don’t know some Twitter goons deceive you here,” he wrote."
  },
  {
    "headline": "BREAKING: Umahi dissolves Ebonyi executive council",
    "summarized_story": "Ebonyi Governor David Umahi has dissolved the State Executive Council with immediate effect.\nSecretary to the State Government (SSG) Kenneth Ugbala announced the dissolution after the council’s meeting on Friday in Abakaliki.\nHe however pointed out some key officers were not affected by the first phase of the dissolution.\nThose not affected, according to him, include SSG, Attorney General and Commissioner for Justice, Cletus Ofoke; Commissioner for Finance, Orlando Nweze and Commissioner for Information, Uchenna Orji.\nOthers are Commissioner for Border Peace, Stanley Okoro Emegha; SSA Investment, Chioma Nweze and Commissioner for Capital City, Onyekachi Nwebonyi."
  },
  {
    "headline": "Nike reveals reason behind Neymar split",
    "summarized_story": "Sportswear giant, Nike Inc, has confirmed that it ended its relationship with Brazil and Paris Saint Germain superstar, Neymar Jr, last year.\nThe former Barcelona star was investigated by the company last year after a Nike employee accused him of sexual assault, an allegation the footballer denied.\nAfter spending eight years with the sports company, Nike cut Neymar’s deal without stating the reason for the termination in August 2020.\nAlthough the investigation was inconclusive reports added that Neymar refused to cooperate with the Cooley inquest.\nHowever, in a press release on Friday, Nike finally revealed the reason why their deal with Paris Saint-Germain star Neymar was called off in a press release."
  },
  {
    "headline": "Serial rapist sentenced to 1,088 years for defiling 56 victims",
    "summarized_story": "A South African man, Sello Abram Mapunya, has been sentenced to 1,088 years in prison for allegedly raping and robbing 56 women across Pretoria suburbs for five years.\nHis youngest victim, a 14-year-old girl, was attacked while walking home with a friend in Olievenhoutbosch.\nHe sentenced Mapunya to life terms for raping his teenage victim and three other women who he raped multiple times.\nHis youngest victim, Refilwe Selamolela who is now 19 and agreed to be identified, said she had spent years asking herself why men raped and hurt women.\nThuleleni Mtsweni, who was beaten over the head with a hammer and raped by Mapunya in her Nellmapius home, said some victims had almost lost their lives."
  },
  {
    "headline": "BBNaija lockdown reunion show date revealed",
    "summarized_story": "Ex-BBNaija housemate Dorathy Bachor has revealed the official date for the premiering of the BBNaija Season 5 Lockdown reunion show.\nThe reality star cum entrepreneur on Friday said the reunion show will begin June 17, 2021.\nOn March 24, 2021, organisers of BBNaija announced the commencement of Big Brother Naija Season 6 Edition with an open call for the season 6 audition.\nThey also confirmed that the production of BBNaija 2021 reunion show for the season 5 “Lockdown” housemates is in progress.\nHowever, taking to her Instagram page, Dorathy posted a photo of the reunion show with an accompanying caption that reads: “It’s a date 17th of June 2021 @dstvnigeria @bigbronaija.”"
  },
  {
    "headline": "Social media agog as Amaechi’s gospel music video goes viral",
    "summarized_story": "A viral gospel video that featured the current Minister of Transportation, Rotimi Amaechi and members of his family, is currently trending online.\nThe musical single, which is packaged and shared by Obiblo Music on their Facebook page, titled ‘Psalm 33.’The ‘Psalm 33’ title was preceded by a catchphrase ‘Blessed the people the Lord has chosen as his heritage.’The viral clip was also shared by a Twitter user who is simply identified as @Maybeks.\nAs expected, Amaechi’s husky voice and solo performance in the video seemed to be generating reactions from Nigerians who have since taken to the comment section to air their opinion.\nWatch video below:"
  },
  {
    "headline": "I might act nude if paid in foreign currency –Jessica Fabulous",
    "summarized_story": "Beautiful fast rising actress cum model, Jessica Fabulous, is a Nollywood greenhorn, but she’s ready to carve a place for herself in the make-believe world.\n“That’s why I am looking for that man that will give me the freedom to express myself and pursue my career.\nHe must also be a rich man but not necessarily as old as Regina Daniels’ husband.\nSpeaking further, Fabulous, who features in Elina, a new movie that hit cinemas last Friday, hints at the only condition that will make her act nude.\nHowever, if the money is right, I might give it a second thought, especially if it’s in foreign currency.”"
  },
  {
    "headline": "Kalu salutes, tasks new Chief of Army Staff",
    "summarized_story": "While congratulating the Chief of Army Staff, Kalu extolled the virtues of the Major-General, describing him as a gallant and committed military officer with a passion for professionalism and national development.\nThe former governor urged the new Army Chief to sustain his outstanding attributes in his new role.\nIn a congratulatory message, the Senate Chief Whip, stressed that the Nigeria Army has continually played a noble role in nation building.\nHe said: “I felicitate the new Chief of Army Staff, Major-General Farouk Yahaya, on his new national assignment.\n“Considering his antecedents, I am optimistic that the new Chief of Army Staff will bring to bear his expertise in the discharge of his duties and responsibilities."
  },
  {
    "headline": "MAY 29 SPECIAL: Nothing has changed under Buhari –Gen. Ishola-Williams",
    "summarized_story": "Making the assertion in an interview with TUNDE THOMAS, the retired General regretted that nothing has changed in the polity under the leadership of President Muhammadu Buhari.\nBuhari has refused to take decisions, often crucial decisions that can help to move the nation forward.\nAre you saying President Buhari is not doing what he supposed to do?\nThe APC came to office promising to transform the country, but some Nigerians are saying that nothing has actually changed.\nIt is not the same Buhari that Nigerians used to know in the days of the military that is the Buhari that we have today."
  },
  {
    "headline": "MAY 29 SPECIAL: Buhari hasn’t rewarded many of us who worked for",
    "summarized_story": "Will you advise the APC constitution review committee to make zoning an official policy of the party?\nI also don’t know if that is part of the scope of the assignment of the committee.\nAnd if that is part of it, fine, they can go ahead and incorporate zoning in the APC constitution.\nWe are getting to another election and you can’t face the national convention of the party without a fresh, reviewed party constitution for the people to be approved.\nI believe they will come up with a very solid party constitution."
  },
  {
    "headline": "Lamentation greets 22 years of democracy",
    "summarized_story": "That is the position of a number of prominent Nigerians and groups as the nation’s Fourth Republic clocks 22 years today.\nHe noted that when democracy returned in 1999, Nigerians had high expectations but regretted that not much has been achieved so far.\n“It is unfortunate that 22 years after democracy, we are still not out of the woods simply because things are not being done well.\nPresident of Southern Kaduna People’s’ Union, Hon Jonathan Asake, described the 22 years of unbroken democracy as ‘good’.\nFormer Publicity Secretary, Nigeria Bar Association (NBA), Lagos Branch, Emeka Nwadioke said: “While progress has been made in some sectors, the results have at best been woeful in others."
  },
  {
    "headline": "Six Years After, President Presents Achievements",
    "summarized_story": "Other efforts under this category include the establishment in 2020 of the Presidential Infrastructure Development Fund (PIDF), with more than $1 billion in funding so far.\nOn road projects, the statement listed the PIDF, the investment of over a billion dollars on three flagship projects: Lagos-Ibadan expressway, Second Niger Bridge and Abuja-Kaduna-Zaria-Kano expressway.\nThe Buhari administration, according to the statement, has done well in boosting the capacity of the nation’s ports.\nIn the power sector, Adesina listed President Buhari’s effort to include the implementation of Energising Education Programme, which involves taking clean and reliable energy (Solar and Gas) to Federal Universities and Teaching Hospitals across the country.\nThe achievements also included the Policy, Regulatory and Funding Support for the establishment of Modular Refineries across the Niger Delta."
  },
  {
    "headline": "FG Defends Choice of Farouk Yahaya as Chief of Army Staff",
    "summarized_story": "Critics also argued that the office of Army Chief had been restricted to Northerners in the six years Buhari has spent so far as President and that the President ought to have shifted a bit by picking the new Army Chief from among Southern Generals in the Army, so as to give the rest of the country a sense of belonging.\n“With the appointment of General Yahaya, President Buhari has expediently put national interest above ethnic and religious chauvinism by fulfilling all requirements necessary.\nYahaya is from Sokoto State and he was a member of the 37th Regular Course of the Nigerian Defence Academy.\nYahaya ResumesMeanwhile, General Yahaya formally resumed duty as the nation’s Chief of Army Staff yesterday.\n“General Yahaya later held a brief meeting with principal staff officers after observing a minute silence in honour of former COAS, late General Ibrahim Attahiru and 10 others."
  },
  {
    "headline": "EFCC Estimates Value of Diezani’s Jewelry at N14.4bn",
    "summarized_story": "•Explains delay in disposing assetsAdedayo Akinwale in AbujaThe Economic and Financial Crimes Commission (EFCC) yesterday revealed that the estimated value in Naira of jewelry seized from former petroleum minister, Diezani Alison-Madueke is N14.4 billion.\nThe EFCC boss said though they got the forfeiture order for assets recovered from the former Petroleum Minister in 2019, they were yet to be auctioned.\nHe stated: “The estimated value of Diezani Allison’s jewelry in naira is N14.4 billion.\nThe estimated value of houses for the former Minister of Petroleum, Diezani Allison is worth $80 million”.\n“This is to ensure that assets that are not only recovered by the EFCC but the entirety of the recovery agencies assets are disposed of.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Alleged Certificate Forgery: Obaseki Wins again",
    "summarized_story": "Chuks Okocha, Alex Enumah in Abuja and Adibe Emenyonu in Benin CityThe Supreme Court yesterday dismissed the appeal of the All Progressives Congress (APC) on the alleged certificate forgery against Edo State Governor, Mr. Godwin Obaseki.\nThe court in addition awarded a cost of N1 million in favour of Obaseki.\nThe trial court had on January 9 this year dismissed the alleged certificate forgery suit against Obaseki, on grounds that the party failed to substantiate its claim of forgery.\nBut not satisfied APC approached the Appeal Court to challenge the judgment of the lower court.\nToday’s judgement has reinforced this saying due to the celebration all over Edo State and other parts of the World."
  },
  {
    "headline": "Alleged Certificate Forgery: Obaseki Wins Again, as Supreme Court Dismisses APC’s Appeal",
    "summarized_story": "By Alex EnumahThe Supreme Court on Friday dismissed the appeal of the All Progressive Congress (APC) on the alleged certificate forgery against Edo State Governor, Mr Godwin Obaseki.\nThe apex court in a unanimous judgment held that the appellants failed to prove their case beyond reasonable doubt.\nAccording to the judgment, the appellants failed woefully in their case having not provided any disclaimer from the school that the said result was not issued by it.\nThe apex court in the judgment delivered by Justice Emmanuel Agim agreed with the lower courts that the appellants did not meet sufficient requirement of the law in proving their allegations.\nThe court accordingly upheld two judgments of the Court of Appeal Abuja and the Federal High Court, Abuja, which had earlier dismissed the case of the appellants for lacking merit."
  },
  {
    "headline": "Daily COVID Tracker: Nigeria records 63 infections in 7 states -- but zero deaths",
    "summarized_story": "AdvertisementFrance supports COVID vaccine production in AfricaPresident Emmanuel Macron says France is in support of COVID vaccine production in Africa to boost the availability of the jab in the continent.\nAdvertisement“Trying to lift the hurdles in order to allow vaccine production in South Africa and all of Africa, we are in favour of that,” Macron said.\nEU drug regulator approves Pfizer COVID vaccine for people aged 12-15AdvertisementThe European Medicines Regulator (EMA) has approved the Pfizer-BioNTech COVID-19 vaccines for 12 to 15-year-olds.\nAdvertisement“Also, supporting nicotine replacement therapies through WHO partners, establishing national toll-free quitlines, making quitting courses available, and more.”Nigeria records 63 COVID casesThe Nigeria Centre for Disease Control (NCDC) says the country recorded 63 infections on Friday.\nBritain approves J&J COVID-19 vaccineBritain has approved the Johnson & Johnson COVID-19 vaccine for use."
  },
  {
    "headline": "Daily COVID Tracker: Nigeria records 63 infections in 7 states -- but zero deaths",
    "summarized_story": "AdvertisementFrance supports COVID vaccine production in AfricaPresident Emmanuel Macron says France is in support of COVID vaccine production in Africa to boost the availability of the jab in the continent.\nAdvertisement“Trying to lift the hurdles in order to allow vaccine production in South Africa and all of Africa, we are in favour of that,” Macron said.\nEU drug regulator approves Pfizer COVID vaccine for people aged 12-15AdvertisementThe European Medicines Regulator (EMA) has approved the Pfizer-BioNTech COVID-19 vaccines for 12 to 15-year-olds.\nAdvertisement“Also, supporting nicotine replacement therapies through WHO partners, establishing national toll-free quitlines, making quitting courses available, and more.”Nigeria records 63 COVID casesThe Nigeria Centre for Disease Control (NCDC) says the country recorded 63 infections on Friday.\nBritain approves J&J COVID-19 vaccineBritain has approved the Johnson & Johnson COVID-19 vaccine for use."
  },
  {
    "headline": "Harvard Business School honours Ndidi and Mezuo Nwuneli with Alumni Achievement Award",
    "summarized_story": "Ndidi Nwuneli and Mezuo Nwuneli have been conferred with the Harvard Business School’s Alumni Achievement Award.\nThe award comes one year after the Nwunelis became the first couple to deliver a keynote address on Harvard Business School (HBS) class day.\nMezuo Nwuneli is the managing partner, Sahel Capital Agribusiness Managers Ltd., which manages FAFIN, a private equity fund that manages over $65.9 million, and invests in mid-sized agribusinesses in Nigeria.\nAdvertisementNdidi Nwuneli is the managing partner of Sahel Consulting Agriculture & Nutrition Ltd., and the founder of LEAP Africa.\nAccording to HBS, the six award recipients have distinguished themselves in terms of significant contributions to development within their communities."
  },
  {
    "headline": "Harvard Business School honours Ndidi and Mezuo Nwuneli with Alumni Achievement Award",
    "summarized_story": "Ndidi Nwuneli and Mezuo Nwuneli have been conferred with the Harvard Business School’s Alumni Achievement Award.\nThe award comes one year after the Nwunelis became the first couple to deliver a keynote address on Harvard Business School (HBS) class day.\nMezuo Nwuneli is the managing partner, Sahel Capital Agribusiness Managers Ltd., which manages FAFIN, a private equity fund that manages over $65.9 million, and invests in mid-sized agribusinesses in Nigeria.\nAdvertisementNdidi Nwuneli is the managing partner of Sahel Consulting Agriculture & Nutrition Ltd., and the founder of LEAP Africa.\nAccording to HBS, the six award recipients have distinguished themselves in terms of significant contributions to development within their communities."
  },
  {
    "headline": "Death toll from Kebbi boat mishap rises to 81",
    "summarized_story": "The Sokoto office of the National Emergency Management Agency (NEMA) says 81 bodies have been recovered, following the boat mishap that occurred in Wara, Ngaski LGA of Kebbi state.\nWhile 22 persons were rescued alive, more than 100 persons were feared to have drowned in the incident.\nAccording to a statement from the Sokoto NEMA office, as of Thursday, 59 bodies had been recovered from the river.\nAdvertisement“Twenty two (22) more dead bodies has been recovered today (Friday 28-05-2021) following the recent boat mishap which occurred last Wednesday in Wara, Ngaski Local Government Area, Kebbi state,” the statement reads.\n“So far, at the time of filling this report, which is the third day since the incident happened, rescuers have successfully removed 81 dead bodies in total from the river."
  },
  {
    "headline": "Nokia X20 Review – Dualsight Camera, 2-day battery life, and more",
    "summarized_story": "Early in April, HMD Global announced the launch of six new Nokia Android smartphones.\nIts major selling points include 3 years worth of Android updates from Nokia, cinema mode and dualsight camera, 2-day battery life and a large screen that allows you to watch virtually anything in full HD+.\nThe Nokia X20 retails for about $480.\nFinally, inside the box we have the following:The Nokia X20 : I mean, it would be extremely awkward if this was not in there.\nThe Look, The Feel, The HeftI will start by saying the Nokia X20 is a large phone."
  },
  {
    "headline": "How can you make your company hack-proof? These five experts know.",
    "summarized_story": "Adeoluwa, Daniel, Joseph, Sophina and Nick will be discussing how you can protect your organization and customers from online fraud.\nAdeoluwa is a skilled Information Security Professional.\nHe is responsible for building the backend infrastructure, driving product roadmap, leading the technical team and driving company strategy.\nSophina is a cybersecurity professional currently working with a leading financial services firm.\nHe has over 13 years experience in the technology industry and has worked for multinational, leading technology companies."
  },
  {
    "headline": "GovTech In Nigeria: From Regulatory Maze to Models of Good Practice",
    "summarized_story": "Nigerian public procurement and regulation can be labyrinthine, but recent policy reforms and the model of good practice provided by Kaduna State hint at opportunities for public-purpose innovation to flourish in the country.\nIt has also mandated Nigerian companies with large public sector IT contracts to engage Nigerian startups as R&D partners on the projects.\nBut the Federal Government need not look far for inspiration; it can take a page out of the Kaduna State Government (KDSG)’s Govtech playbook.\nAccording to the World Bank’s latest subnational Doing Business ratings, Kaduna is the most accessible state to register property and get contracts enforced in Nigeria.\nKaduna’s example is an exciting preview of what could be should the Federal Government follow through on a promising start."
  },
  {
    "headline": "How GOtv Nigeria Built the Widest Coverage in Nigeria with Investments in Local Infrastructure",
    "summarized_story": "Nationwide digital terrestrial television operator GOtv has greatly contributed to Nigeria’s digital migration through eye-watering infrastructure investment.\nBut GOtv, launched by Details Nigeria in October 2011, has shown confidence in the local broadcast industry.\nThe company has since worked closely with the government and the Nigerian Communications Commission (NCC) in providing affordable digital television for everyone through unmatched investments in modern broadcast infrastructure.\nOver the years, GOtv has continued to invest heavily in the latest technology in digital television, especially on its transmission technology, which it has consistently improved upon.\nThese investments by GOtv in the local broadcast infrastructure and the expansion of its network coverage have come as the government-driven digital switchover programme (DSO) progresses in fits and starts."
  },
  {
    "headline": "Brand Africa Ranks TECNO 6th on the Most Admired brands in Africa List",
    "summarized_story": "– In the recently released Africa’s Best Brands 2021, TECNO ranked for five consecutive years among the TOP 6 brands on the African continent, marking another prestigious recognition of the brand’s leadership in Africa.\nEstablished in 2011, the Brand Africa 100: Africa’s Best Brands rankings is the most authoritative survey and analysis on brands and underlying businesses in Africa, based on a study by Geopoll across 28 countries spanning all the five economic regions and analysis and ranking by Kantar and Brand Leadership.\nThe 2021 survey was conducted between March and April 2021 and yielded over 80,000 brand mentions and over 3,500 unique brands.\nWhen TECNO launched dual SIM cards in Africa, there had been nothing of the kind before then.\nAnd now, with Brand Africa’s new rankings, TECNO has once again come out tops, becoming a leading player in mid to high-end mobile brand segments in Africa."
  },
  {
    "headline": "Care homes for the elderly present untapped investment opportunities",
    "summarized_story": "For investors seeking green fields that harbour opportunity for good yields, retirement and care homes offer such opportunity and it is largely untapped in Nigeria, according to a new report.\nThe opportunity in this market arises mainly from the lack of functional national policy on the care and welfare of older persons in Nigeria.\nAlso, changing demographics in the country coupled with the breakdown in family structure and absence of a social security system, present unique challenges to the elderly in Nigeria.\nThis means an investment opportunity for investors ready to deliver fit-for-purpose homes and other facilities that will address the current challenges that the aged community in the country faces.\nOpportunities in the retirement/care homes which are largely untapped also arise from the 2014 reform in the Pension Fund Administration (PFA) scheme."
  },
  {
    "headline": "Reps minority group says Nigeria becoming a failed state",
    "summarized_story": "The house of representative minority group has asked President Muhammadu Buhari to “buckle up” in addressing the challenges confronting the country.\nIn a statement Friday to mark the sixth anniversary of the present administration, Ndudi Elumelu, minority leader of the lower chamber, tackled the All Progressives Congress (APC) over “economic crisis and avoidable acrimony”.\n“The caucus holds that with its failure to check worsening insecurity and mass killing of citizens; its intrinsic corruption, mismanagement of our national economy, as well as the unrelenting assault on our national diversity, the APC administration at the center has failed on all fronts in the last six years,” the statement reads.\n“Failure of the government to address escalated insecurity challenges has crippled the agricultural sector and disorganised commercial activities, leading to imminent food crisis with cost of food and other necessities of life skyrocketing beyond the reach of Nigerians,” the lawmakers said.\n“As representatives of the people, the minority caucus is worried that our nation is heading towards a failed state."
  },
  {
    "headline": "Customer loyalty in the shadows of scepticism",
    "summarized_story": "The problem with customer satisfactionTo maximize their share of customers’ wallets, most brands spend large—if not the largest—portion of their data collection budget on monitoring customer satisfaction.\nAnd, this is where the problem of customer satisfaction metrics lies.\nCustomer satisfaction measures what researchers call ‘The Expectancy-Disconfirmation Paradigm (EDP)’.\nCustomer satisfaction is an evaluation of how well something performs relative to how the customer thinks it will perform.\nThe problem with loyalty programmesMost loyalty programmes aren’t truly about loyalty."
  },
  {
    "headline": "The Buhari Administration @ 6: Presidency lists achievements – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Presidency says the Muhammadu Buhari administration is recording giant strides, enough to make Nigerians proud.\nIn 2020 President Buhari commissioned the first phase of the Waltersmith Modular Refinery, in Imo State.\n– Nigeria national U-17 football team, the Golden Eaglets, won the FIFA U-17 World Cup for the fifth time, in 2015.\nTheir first ever win was 30 years earlier, in 1985, when President Buhari was military Head of State.\n– The designation of President Buhari as the African Union (AU) Anti-Corruption Champion for 2018– The designation of President Buhari by ECOWAS Heads of State as West Africa’s Covid-19 Champion in 2020."
  },
  {
    "headline": "COVID-19: Edo immunises over 38, 500 persons in first phase, begins second dose vaccination Tuesday – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has vaccinated over 38,500 persons in the first dose of phase one COVID-19 vaccination campaign and is set to begin the second dose vaccination on Tuesday, June 01, 2021.\nHealth Educator with the State Primary Healthcare Development Agency, Mrs. Irene Uabor, who disclosed this to journalists in Benin City, urged all those that have been vaccinated with the first dose of the Oxford-AstraZeneca COVID-19 vaccine to come out and take the second dose for full protection against the virus.\nShe noted that all eligible persons for the second dose vaccination are expected to take the second dose least 6 weeks from the first dose and before the 9th of July 2021.\nUabor further charged them to go to the health facility where the first dose was administered to access their second dose, adding, “For those that were vaccinated by roaming teams, they should check their cards and go to the health facility written on it for their vaccination.\n“You must continue to wear your facemask when in public; wash your hands regularly under running water, use alcohol-based hand sanitizers and observe social distancing.”She further charged residents with any COVID-19 symptoms to contact the Edo Emergency Operation Centre on this toll-free number: 08003625000 for assistance."
  },
  {
    "headline": "Certificate forgery: Supreme Court upholds Appeal’s ruling, affirms Obaseki as Governor – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…APC gets N1 million fine…ruling buries diabolical controversy – ObasekiThe Supreme Court on Friday upheld the ruling of the Appeal Court, dismissing the alleged certificate forgery suit filed by the All Progressives Congress (APC) against the Governor, during the 2020 governorship election.\nThe verdict affirms the victory of Governor Godwin Obaseki at the September 19 polls.\n“From the statement by the Supreme Court Justices, it is clear that they align with what Edo people knew all along, which is that there was no merit in the case.\nRecall that the Federal High Court, Abuja, had on January 9 dismissed the alleged certificate forgery suit against Governor Obaseki.\nApparently not satisfied with the decision of the lower court, the APC approached the appellate court to challenge the judgment."
  },
  {
    "headline": "Edo govt, UN strengthens collaboration to combat COVID-19, illegal migration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, met with a delegation of the United Nations to bolster the government’s efforts at containing the coronavirus (COVID-19) pandemic and further reduce the menace of irregular migration.\nThe delegation, headed by the United Nations Resident and Humanitarian Coordinator, Mr. Edward Kallon, was received at Government House in Benin City.\nPhilip Shaibu, reaffirmed the government’s commitment to containing the pandemic and curbing irregular migration among youths in the state.\nHe noted that the present administration of Governor Obaseki is putting in place reforms and policies to ensure a business-friendly environment to attract investment into the state.\nHe noted that a part of the aim for the visit was to discuss ideas that would put an end to irregular migration among youths in Edo."
  },
  {
    "headline": "Evil times are behind us – UNILAG Pro-chancellor",
    "summarized_story": "Lanre Tejuoso, the newly-appointed Pro-Chancellor and Chairman of Governing Council, University of Lagos, has prayed God to prevent any further crisis in the university.\n”We pray that the evil witnessed in the times past, we shall witness no more; love will radiate within the council.\nThe News Agency of Nigeria (NAN) reports that President Muhammadu Buhari appointed Mr Tejuoso the university’s Pro-Chancellor and Chairman of Governing Council on April 10.\nMr Tejuoso noted that the occasion was to honour Mr Chukwu, and prayed God to make him to age gracefully.\nAccording to him, Mr Chukwu had built for himself, a strong reputation of excellence and discipline."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Just In: Supreme Court dismisses Ize-Iyamu’s forgery suit against Obaseki",
    "summarized_story": "The apex court in a judgement delivered by Justice Emmanuel Agim held that the appellants failed to prove its case beyond a reasonable doubt, NAN reported.\n“This court agrees with the lower courts completely, that the appellants did not meet sufficient requirement to prove their case”.\nThe Supreme Court, therefore, awarded a cost of one million naira in favour of Governor Obaseki.\nThe appeal court in Abuja had dismissed the suit challenging Obaseki’s certificates on March 18.\nThe Appeal Court further held that Mohammed’s verdict was without ambiguity and that the APC did not prove its case."
  },
  {
    "headline": "Total changes name to TotalEnergies as part of transition to renewable energy",
    "summarized_story": "Total on Friday changed its name to TotalEnergies as pushes to become one of the world’s top five in renewables by 2030.\nThe shareholders, the statement said, approved, almost unanimously, the resolution to change the company’s name from Total to TotalEnergies, thereby anchoring its strategic transformation into a broad energy company in its identity.\nMr Patrick Pouyanné, Chairman and Chief Executive Officer of TotalEnergies said in tandem with this name change, TotalEnergies was adopting a new visual identity.\nEnergy is reinventing itself, and this energy journey is ours,” he said.\nHe said TotalEnergies would be a broad energy company committed to producing and providing energies that are ever more affordable, reliable and clean."
  },
  {
    "headline": "ADF backs May 30 Remembrance Day, says Biafra part of Igbo history",
    "summarized_story": "OBINNA EZUGWUThe Alaigbo Development Foundation (ADF), has encouraged all patriotic Igbo people across the globe to observe the May 30 Biafra Remembrance Day, as according to it, the day remained an important part of the history of Igbo nation.\nThe ADF which made call in a statement signed by its president, Professor Uzodinma Nwala and spokesperson, Chief Abia Onyike on Friday, argued that May 30 has become an official Igbo Remembrance Day, which cannot be wished away.\n“Events in Alaigbo on May 30, each year show that May 30 has become an official Igbo Remembrance Day not only within Alaigbo but throughout the entire world where Igbo citizens live.\n“It is in the light of this that the ADF fully supports observance of May 30, this year as Igbo Day Celebration.\n“May 30 marks the day Biafra was declared in 1967 and no patriotic Igbo son or daughter can pretend that Biafra is not part of the history and indeed the major water-shed in the history of the Igbo nation,” the group noted."
  },
  {
    "headline": "Any PDP tour of Osun without resolution chairmanship tussle a waste of time – Adagunodo",
    "summarized_story": "The embattled chairman of Osun State Chapter of People’s Democratic Party (PDP) Hon.\nIt is not an official programme of the Osun State chapter of the Peoples Democratic Party.\nInterest groups within a political party are allowed to consult but this should not be misconstrued as an official programme of Osun PDP.\nThere is a difference between OSUN PDP AND PATHFINDER TEAM.\nWill you consider your removal as the genesis of the Osun PDP crisis?"
  },
  {
    "headline": "‘Yan Bindiga Sun Kashe Mutane Da Yawa A Wushishi",
    "summarized_story": ""
  },
  {
    "headline": "Shawarwarin Kasar Sin Sun Bayyana Yadda Sin Da Afirka Suke Tsayawa Juna A Lokacin Farin Ciki Da Akasinsa",
    "summarized_story": ""
  },
  {
    "headline": "Li Keqiang Zai Halarci Taron Sauyin Yanayi Na Green Goal Partners 2030",
    "summarized_story": ""
  },
  {
    "headline": "Kudin Shigar Bangaren Fina-finan Da Suka Yi Fice A Kasar Sin Ya Kai RMB Yuan Biliyan 25",
    "summarized_story": ""
  },
  {
    "headline": "Xi Jinping Ya Bukaci Da A Karfafa Ci Gaban Kasa Ta Hanyar Kimiyya Da Fasaha",
    "summarized_story": ""
  },
  {
    "headline": "Nigerians will praise Buhari after his tenure in 2023",
    "summarized_story": "The Presidency says by the time President Muhammadu Buhari completes his tenure in another two years, Nigerians will praise him for his achievements.\nMr. Femi Adesina, the President’s spokesman, stated this in a special write-up on the achievements of the President Buhari administration as it clocks six years today, May 29, 2021.\nThe statement released on Friday was titled, ‘The Buhari Administration at 6: Counting the Blessings One by One’.\nAccording to Adesina, the Buhari administration is recording giant strides, enough to make Nigerians proud.\nA Fact Sheet, a report card on the Buhari Administration, just a bit of the successes, as the milestone of six years is attained."
  },
  {
    "headline": "Students beg Gov el-Rufai over 500% tuition fees increment —",
    "summarized_story": "The students disclosed this in a statement issued and signed by President, National Association of Science Students (NASS), KASU chapter, Comrade Abubakar.\nTitled: An open letter to the Kaduna State Government on tuition fees increment on tertiary institutions (Especially KASU), the students stated that “the 500% school fees increment is a threat to the education sector and also to the education of the poor masses in the state”.\nThey expressed surprise that KASU is trying to link increment of fees to the scholarship of N109, 000 they could not access.\nAccordingly, they observed that with the retrenchment of student’s parent in civil service through rightsizing and those sacked without entitlement, many poor students are surely going to drop out in the midst of heightened fees and insecurity.\nThey added that many government officials, NGOs, religious and traditional leaders have been advocating for higher education, believing that good education would help the society to reduce social vices and criminality."
  },
  {
    "headline": "Panic in A’Ibom community as business partners fight dirty —",
    "summarized_story": "One of the documents made available to our correspondent indicated that the Oil Flow Qua-Steel partners had to raise the N200 million payment for purchase of Qua-Steel metals, with KAM STEEL Company as principal partners.\n“When Oil Flow won the bid, it had no money to pay the N200m requested by the state government.\n“We paid a total sum of N250m, N200m to state government and N50m to Oil Flow as those who won the bid.\nHowever, the squabble between the partners have resulted in insecurity in the community as different partners brought thugs and soldiers to protect their interest in the transaction.\n“As for hoodlums, they will not be able to operate here without the support of the community,” the youth president said."
  },
  {
    "headline": "Entrepreneurs must be well educated, says CEO of Sonaira Business World",
    "summarized_story": "By Mutiat AlliThe idea that education has no correlation with the founding of successful businesses is grossly misplaced according to Sonia Omon-Obehi Ovuehor, CEO, Sonaira Business World.\nObtaining a quality education is very important and crucial to entrepreneurship in contemporary society, she argued.\nThe graduate of the University of Benin enrolled at the Pan African Institute for Entrepreneurship and Community Development in 2014, where she further expanded her knowledge about business.\nThe education at the institute helped to crystallised her then decade-long experience trading in commodity.\nShe added: “Growing up, I watched my mom run several businesses, mostly petty trading, even as she took on a daily paid job at times."
  },
  {
    "headline": "DAYLIGHTTV VOX POP: Have you ever cheated on your spouse?",
    "summarized_story": "DAYLIGHTTV VOX POP: Have you ever cheated on your spouse?"
  },
  {
    "headline": "DAYLIGHTTV VOX POP: Have you ever cheated on your spouse?",
    "summarized_story": "DAYLIGHTTV VOX POP: Have you ever cheated on your spouse?"
  },
  {
    "headline": "Nwodo demands additional state creation for S-East",
    "summarized_story": "Former President General of apex Igbo socio-cultural organisation, Ohanaeze Ndigbo, John Nnia Nwodo, yesterday, called for the creation of Adada State in the South East.\nAccording to Nwodo, the South East has long been marginalized in the distribution of state entities and as such, the creation of an additional state would help give the people a sense of belonging.\n“No demand is as old as the demand for an additional creation of an additional state for the people and this shows it can be recommended” he said.\nHe recalled that former president Goodluck Jonathan convened a national conference in 2014 where the need for additional state creation and other recommendations were made.\nHe noted that although those who made the constitution made it almost impossible for the creation of an additional state, it can still be achieved."
  },
  {
    "headline": "Nwodo demands additional state creation for S-East",
    "summarized_story": "Former President General of apex Igbo socio-cultural organisation, Ohanaeze Ndigbo, John Nnia Nwodo, yesterday, called for the creation of Adada State in the South East.\nAccording to Nwodo, the South East has long been marginalized in the distribution of state entities and as such, the creation of an additional state would help give the people a sense of belonging.\n“No demand is as old as the demand for an additional creation of an additional state for the people and this shows it can be recommended” he said.\nHe recalled that former president Goodluck Jonathan convened a national conference in 2014 where the need for additional state creation and other recommendations were made.\nHe noted that although those who made the constitution made it almost impossible for the creation of an additional state, it can still be achieved."
  },
  {
    "headline": "Buhari wins 2021 Trophée Babacar Ndiaye",
    "summarized_story": "By Temitope PonlePresident Muhammadu Buhari has been named winner of the 2021 Great Builder Super Prize for Trophée Babacar Ndiaye, taking over from Abdel Fattah al-Sissi of Egypt, who won the 2020 prize.\nAccording to a statement from the African Development Bank (AfDB) on Friday, Buhari was named the winner during the inaugural Africa Road Builders Conference held on March 31 in Cairo, Egypt.\nThe trophy would be awarded on June 24 on the sidelines of the AfDB’s Annual Meetings.\nFattah al-Sissi received the award “for his personal leadership and for the efforts made to ensure road safety and the health of the population in the context of transport”.\nHowever, the selection committee cited Nigeria’s efforts to improve road safety and air quality for road users."
  },
  {
    "headline": "COAS: Buhari is President of the North, says Ohanaeze chieftain",
    "summarized_story": "By Taiwo OkanlawonChuks Ibegbu, immediate past Deputy National Publicity Secretary of Igbo apex socio-political organization, Ohanaeze Ndigbo, has described President Muhammadu Buhari as a nepotistic and sectional leader.\nAccording to the former Ohanaeze spokesman, Buhari’s leadership lacked balance who appears to be ruling the Northern part of the country alone.\nIn his words; “For the past six years, Buhari has been running a sectional and nepotistic government; he appears to be the president of Northern Nigeria instead of the president of Nigeria.\n“Buhari has the prerogative to appoint his Chief of Army Staff when it comes to appointment, but that right is subject to equity and fairness.\n“Mr President has done his duty of appointing the Chief of Army Staff but has not addressed the peculiarity and diversity of Nigeria."
  },
  {
    "headline": "Eight villagers, two bandits shot dead in fresh attack in Kaduna",
    "summarized_story": "By Mohammed TijjaniThe Kaduna State Government on Friday said bandits have killed eight persons in Giwa, Chikun, Igabi and Sabon Gari Local Government Areas of the state.\nThe state government also said that two suspected bandits were killed in reprisal attacks.\nThe Commissioner for Internal Security and Home Affairs, Mr Samuel Aruwan confirmed the killings in a statement on Friday in Kaduna.\nAruwan said: “Security agencies reported that bandits invaded Na’ikko village in Giwa LGA and community volunteers engaged the bandits and in the ensuing gun duel, three residents were killed.\n“In another incident, bandits invaded Dakyauro village, Sabon Birni, Igabi LGA and killed four persons after rustling about 25 cows."
  },
  {
    "headline": "Why Buhari Appointed Farouk Yahaya As New Chief Of Army Staff – Minister Of Defence",
    "summarized_story": "The Minister of Defence, Bashir Salihi-Magashi has defended the decision of President Buharu to appoint Major General Farouk Yahaya as the new Chief of Army Staff.\nMagashi explained that Buhari didn’t consider ethnic or religious factors but rather national interest in choosing the new Army Chief.\nRecall that Presisent Buhari on Thursday appointed Major General Farouk Yahaya as the new Chief of Army Staff to replace the late Lt-Gen Ibrahim Attahiru who died last week in a military plan crash in Kaduna.\nThe Minister describe Yahaya as the best first for the job and expressed confidence in the ability of the new Chief of Staff to deliver.\n“The appointment of General Yahaya, President Buhari has expediently put national interest above ethnic and religious chauvinism by fulfilling all requirements necessary."
  },
  {
    "headline": "BREAKING: New COAS, Farouk Yahaya Resumes",
    "summarized_story": "On Friday, Major General Farouk Yahaya took over as the nation’s 22nd Chief of Army Staff.\nYahaya was sworn in at the Army Headquarters in Abuja during a ceremony.\nWhen he arrived, he first went to the sentry to view the guard of honour, after which he went to the conference room.\nHe led others in observing a minute of silence before the start of the program in memory of his late predecessor and ten others who died in a plane tragedy last Friday.\nFirst photo of the new COAS sitting at his official desk."
  },
  {
    "headline": "JUST IN: Disaster Averted As Tanker Guts Fire On Otedola Bridge (Photos)",
    "summarized_story": "On Friday, men from the Lagos State Fire Service extinguished flames from a tanker that had been parked near the Otedola Bridge in the Berger Area of Lagos.\nThe front of the truck was heavily damaged by the fire, according to photos taken at the scene.\nThe fire erupted as a result of an electrical problem, according to the Lagos State Emergency Management Agency.\nLASEMA tweeted, “Upon arrival at the scene it was observed a Mack tanker truck with no registration number loaded with 45,000 litres of diesel was gutted by fire while descending Otedola bridge inward Berger.\n“Further investigation gathered at the scene revealed that (the) fire started as (a) result of an electrical fault."
  },
  {
    "headline": "VIDEO:#MilitaryAppreciationDay: Nigerians honor late COAS Attahiru, military personnel",
    "summarized_story": ""
  },
  {
    "headline": "#MilitaryAppreciationDay: Nigerians honor late COAS Attahiru, military personnel",
    "summarized_story": ""
  },
  {
    "headline": "Breaking: In Ebonyi, Umahi fires Commissioners, others",
    "summarized_story": "Governor David Umahi of Ebonyi state, Friday, dissolved the State Executive Council (SEC).\nSecretary to the State Government (SSG), Dr Kenneth Ugbala, during a joint exco briefing in Abakaliki, said the dissolution was in two phases.\nThose not affected, according to him, include SSG, Attorney General and Commissioner for Justice, Cletus Ofoke; Commissioner for Finance, Orlando Nweze and Commissioner for Information, Uchenna Orji.\nOthers are Commissioner for Border Peace, Stanley Okoro Emegha; SSA Investment, Chioma Nweze and Commissioner for Capital City, Onyekachi Nwebonyi.\nThe Special Assistants to the Governor office of the Deputy Governor, Capital City, Finance, Parks, Media and Medicals are also to remain in their positions."
  },
  {
    "headline": "Stolen Artefacts: ARAN commends FG’s recovery efforts -NigPilot",
    "summarized_story": "Rescuers Association of Nigeria, (ARAN) a body responsible for the rescue of Nigeria artifacts and its patrimonies has commended Minister of Information and Culture, Alhaji Lai Mohammed, over his recent call for all artifacts looted from Nigeria by foreigners to be returned.\nThe President, Obalosa Bamidele made the commendation in Abuja on Monday while speaking with journalists saying that Alhaji Mohammeds’ call is yielding fruitfulness with some foreign institutions with the nations’ patrimonies agreeing to negotiate with the country for possible returns.\nHe said with the renewed calls for the repatriation of all looted Nigeria artifacts , with passion and commitment of the Minister, there is hope that “most stolen riches of the country will find its way back.”Recall that the Federal Government launched campaign for the repatriation of looted artefacts from the country in 2019 which yielded fruitfully with spate of return of stolen Nigerian antiquities from around the world.\nThe German Government and Museums, both of which are currently at the forefront of repatriating the nations’ antiquities set the stage for a global movement to restitute colonial loot with its March announcement that it planned to hand over some Benin bronze to Nigeria.\nAlso, the Jesus College at the University of Cambridge has pledged to return a bronze cockreal along with the University of Aberdeen in Europe, committed in returning a Benin bronze, head of an oba (king) in its possession, acquired in a way that is considered extremely immoral."
  },
  {
    "headline": "FG reiterates commitment to effective waste management system -NigPilot",
    "summarized_story": "Minister for Environment, Dr Muhammad Mahmoud Abubakar has said that the Federal Government is committed to an effective waste management system in Nigeria.\nThe Minister stated this at the 3rd International Waste Summit 2021, organised by the Waste Management Society of Nigeria, WAMASON, held in Port Harcourt, Rivers State.\nAbubakar noted that the Federal Government is seeking greater partnership with professional bodies like WAMASON on useful ideas on effective waste management in the country.\nHe stressed that youths could benefit through all the stages of waste management, from sorting, storage, transporting to treatment.\nIn achieving an effective waste management system, the Minister stated that the federal government will continue to develop policies to ensure that actions towards waste management are profitable."
  },
  {
    "headline": "NAPTIP DG calls for implementation of policies for protection of children",
    "summarized_story": "Director-General of the National Agency for the Prohibition of Trafficking in Persons, NAPTIP, Imaan Sulaiman – Ibrahim has called for the strengthening of policies, programs, and legal instruments that will further enhance the protection of Children in the Country.\nThe NAPTIP boss said “I join millions of Nigerians across the globe in wishing our children a Happy Children’s Day.\nQuite a large number of Nigerian children have fallen victims of illicit commercial activities which include human trafficking, sexual exploitation domestic servitude, and street begging.\n“It is therefore imperative that parents work closely with NAPTIP and other law Enforcement Agencies in ensuring that perpetrators of evil acts towards our children are reported in order to ensure that such perpetrators are brought to book.\n“NAPTIP on its part shall continue to work assiduously towards the protection of our children,” she said."
  },
  {
    "headline": "Children’s Day: UNICEF calls for protection of child rights -NigPilot",
    "summarized_story": "Commemorating the event of the Children’s Day, the United Nations Children’s Fund, UNICEF, has advocated the need to reinforce protection mechanisms for children especially at a challenging moment for child rights in the country and the world, with the COVID-19 pandemic threatening gains made for children’s development.\n“As we rightfully celebrate Nigerian children today, let us also remember that the COVID-19 crisis has been a child rights crisis – in Nigeria and around the world.\n“On this Nigerian Children’s Day, let us all agree that we cannot let one crisis compound another.\n“Violence is perpetrated against one in four Nigerian children – and one in three Nigerian girls is sexually abused.\n“Nigerian children are resilient, talented and aspire to do great things."
  },
  {
    "headline": "Supreme Court Dismisses APC Forgery Suit Against Obaseki",
    "summarized_story": "The Supreme Court has dismissed the All Progressives Congress’ (APC) forgery suit against the Edo State Governor, Godwin Obaseki.\nThe court dismissed the suit for lack of merit.\nIt was filed against Governor Obaseki, the Peoples Democratic Party (PDP) and the Independent National Electoral Commission (INEC).\nThe apex court’s judgement comes two days after the Court of Appeal in Benin upheld the victory of Governor Obaseki of Edo at the 2020 governorship election.\nIn its ruling, the appellate court held that Obaseki did not forge his certificates with which he contested the 2020 governorship election."
  },
  {
    "headline": "Diezani Forfeited Jewellery Worth N14.4bn, Houses Valued At $80m – EFCC",
    "summarized_story": "The Chairman of the Economic and Financial Crimes Commission (EFCC), Abdulrasheed Bawa has disclosed that the jewellery forfeited by the former Minister of Petroleum Resources Diezani Alison-Madueke is worth N14.4 billion.\nThe EFCC chairman stated this on Friday when he appeared before the House of Representatives ad-hoc committee investigating the assessment and status of recovered loot.\nHe said the “jewellery forfeited from the former minister has been valued by relevant government agencies and the estimated value of the jewellery is 14.4 billion naira.”Bawa also noted that the estimated value of the houses seized and forfeited from Diezani is $80 million.\nREAD ALSO: EFCC Hands Over Diezani’s Forfeited Property To Lagos For Isolation CentreEarlier this year, the EFCC handed a property forfeited by the former minister to the Lagos Government for use as an isolation centre for COVID-19 patients.\nThe six flats of three bedrooms and a boys’ quarter had been forfeited to the Federal Government, following an order of a Federal High Court in Lagos in 2017."
  },
  {
    "headline": "New COAS Maj. Gen Yahaya Assumes Office",
    "summarized_story": "The newly-appointed Chief of Army Staff Major General Farouk Yahaya has officially resumed duties.\nHe began his resumption by inspecting the Quarter Guard.\nThe new COAS succeeds Lieutenant Ibrahim Attahiru who died in a plane crash exactly one week ago in Kaduna state alongside other military officers.\nChannels Television’s Sodiq Adelakun captured the event:"
  },
  {
    "headline": "Three Officers Killed In Attack On Delta Police Station",
    "summarized_story": "Three officers have been killed in an attack on the Umutu Police Divisional Headquarters in Ukwuani Local Government Area of Delta State.\nThe Acting Public Police Relations Officer Bright Edafe confirmed the incident in a statement on Friday.\nEdafe noted that the incident started at about 2.am when armed men in their numbers stormed the Umutu police formation, shooting sporadically at the station.\nThe attackers invaded the police station in the early hours of the day with three officers feared dead.\nNigeria’s security situation has worsened in recent months despite the federal government’s reassurances and efforts by security agencies."
  },
  {
    "headline": "Nigerians Will Appreciate Buhari Better After His Tenure In 2023, Says Adesina",
    "summarized_story": "The Presidency on Friday said Nigerians will appreciate President Muhammadu Buhari after the expiration of his tenure in 2023.\nIn 2020 President Buhari commissioned the first phase of the Waltersmith Modular Refinery, in Imo State.\n– Nigeria national U-17 football team, the Golden Eaglets, won the FIFA U-17 World Cup for the fifth time, in 2015.\nTheir first ever win was 30 years earlier, in 1985, when President Buhari was military Head of State.\n– The designation of President Buhari as the African Union (AU) Anti-Corruption Champion for 2018– The designation of President Buhari by ECOWAS Heads of State as West Africa’s Covid-19 Champion in 2020."
  },
  {
    "headline": "The Buhari administration at 6: Counting the Blessings One By One By Femi Adesina",
    "summarized_story": "In 2020 President Buhari commissioned the first phase of the Waltersmith Modular Refinery, in Imo State.\n– Nigeria national U-17 football team, the Golden Eaglets, won the FIFA U-17 World Cup for the fifth time, in 2015.\nTheir first ever win was 30 years earlier, in 1985, when President Buhari was military Head of State.\n– President Buhari approved 5 billion Naira in take-off grant for the Maritime University.\n– The designation of President Buhari as the African Union (AU) Anti-Corruption Champion for 2018– The designation of President Buhari by ECOWAS Heads of State as West Africa’s Covid-19 Champion in 2020."
  },
  {
    "headline": "Bandits kill 10 people in fresh attack in Kaduna",
    "summarized_story": "No fewer than ten person have been killed by armed bandits during an attack and counter attack in some villages in Giwa local government Area, Kaduna State.\nMr Aruwan disclosed that youths of Na’ikko village reacted to the killings by attacking Rugan Abdulmuminu, a nearby Fulani settlement, killing two persons they alleged were involved in the attack.\nArmed bandits also invaded Dakyauro village in Igabi Local government area killing four persons and rustling about 25 cattle.\nKaduna State Governor, Nasir El-Rufai expressed sadness over the attack and condoled with the families of those who were killed.\nThe Kaduna state government has also urged private schools operating in high-risk areas, to adhere to the security advisories issued to them."
  },
  {
    "headline": "Our Achievements Since 2015 Should Make Nigerians Proud: Presidency",
    "summarized_story": "The Nigerian Presidency says the Muhammadu Buhari administration has recorded giant strides – since he assumed office on May 29, 2015 – enough to make Nigerians proud.\nThe federal government’s position comes ahead of the sixth anniversary of President Buhari administration on May 29.\nIn 2020 President Buhari commissioned the first phase of the Waltersmith Modular Refinery, in Imo State.\n– Nigeria national U-17 football team, the Golden Eaglets, won the FIFA U-17 World Cup for the fifth time, in 2015.\nTheir first ever win was 30 years earlier, in 1985, when President Buhari was military Head of State."
  },
  {
    "headline": "Buhari Meets Former Nigeria President Jonathan Over Worsening Crisis in Mali",
    "summarized_story": "Nigeria’s President Muhammadu Buhari has called on actors in the political crisis in Mali to come together for the peace and unity of the country.\nMr Buhari stated this on Friday in the Nigerian capital, Abuja when he received in audience former President Goodluck Jonathan who is Special Envoy and ECOWAS mediator to the West African country.\nPresidential aide, Femi Adesina in a statement quoted President Buhari as saying “a situation where most parts of the country are in the hands of insurgents calls for a consensus and restoration of peace, not a further escalation of the crisis.”Former President Goodluck had briefed the President on the current situation in Mali after meeting with the key political actors ahead of the meeting of ECOWAS leaders under the Chairmanship of President Nana Akufo-Addo of the Republic of Ghana.\nHe added that the meeting of the regional leaders was necessary to urgently find an acceptable solution to the current impasse in the West African nation.\nBy Abel Ejikeme"
  },
  {
    "headline": "Kenya Stops Giving First Doses of AstraZeneca Jabs",
    "summarized_story": "Kenya’s health ministry has advised hospitals to stop giving first doses of the AstraZeneca Covid-19 vaccines.\nHealth Minister Mutahi Kagwe says a shipment arriving on Friday from global-sharing scheme Covax is meant for those due for their second shots.\nMore than 950,000 Kenyans who received their first jab of the Covid-19 vaccine in mid-March will receive the booster shots from Friday.\nMr Kagwe says under the current circumstances it will be better to ensure that these people are fully vaccinated.\nA single dose of the AstraZeneca vaccine gives around 70% protection for at least 12 weeks and 81% after a full dose."
  },
  {
    "headline": "Juventus Sack Pirlo as Head Coach, Allegri Announcement Imminent",
    "summarized_story": "Italian football club Juventus has sacked Andrea Pirlo as head coach and are close to announcing the return of Massimiliano Allegri to replace the football legend.\n53-year-old Allegri is expected to re-sign within the next 24 hours, according to Sky Sports.\nJuve issued the following message to Pirlo upon his departure from the Allianz Stadium: “Thank you, Andrea.\nA few months ago, Andrea Pirlo, an icon of world football, began his new adventure, his first as a coach.\n“Pirlo has just begun the first steps of what will no doubt become a brilliant career as a coach."
  },
  {
    "headline": "Liverpool Signs Konate From RB Leipzig",
    "summarized_story": "Liverpool have signed centre-back Ibrahima Konate from RB Leipzig after agreeing to pay his £36m release clause.\nThe 22-year-old made 21 appearances for Leipzig this season including eight Bundesliga starts as the club finished second – 13 points behind champions Bayern Munich.\nThe injuries saw Fabinho and Jordan Henderson at times deployed at centre-back, while Nathaniel Phillips and Rhys Williams were the defensive pairing at the tail-end of the season as Liverpool secured a top-four place and Champions League football next year.\nLiverpool had signed Ben Davies permanently and Ozan Kabak on loan from Schalke as defensive cover in January.\nDavies is yet to make his Liverpool debut, he was an unused substitute eight times, while Kabak made 13 appearances but looks set to return to Germany despite the club having the option to buy the 21-year-old this summer."
  }
]