[
  {
    "headline": "Nigerians present divergent views as constitutional panel holds hearing",
    "summarized_story": "PARTICIPANTS at the public hearing on the National Assembly’s proposed alterations to the 1999 Constitution on Wednesday called for a fresh constitution for the country.\n1999 Constitution hurriedly put up – OkowaIn Delta State, Governor, Ifeanyi Okowa, said a new constitution for the country had become imperative in view of observed lacunas in the 1999 Constitution.\nOkowa stated this on Wednesday when the Senate Sub-Committee on review of the 1999 Constitution visited him at the Government House, Asaba.\nHe warned that the ongoing process of amendment of the 1999 Constitution must not be taken frivolously.\nYahaya made this disclosure, while declaring the North-East zone constitution review public hearing held in the state."
  },
  {
    "headline": "Volcano warning sparks evacuation order, exodus in DR Congo",
    "summarized_story": "The risk of further eruptions from volcano Nyiragongo led DR Congo authorities to order the evacuation of parts of the city of Goma Thursday, causing an immediate exodus of tens of thousands of people.\n“Right now we can’t rule out an eruption on land or under the lake, which could happen very soon and without warning,” he added.\nThe United Nations says 32 people have died and at least 5,000 are feared to be homeless after the volcano erupted on Saturday.\nGoma, a lakeshore city of 1.5 million people, lies around a dozen kilometres (eight miles) from the volcano.\nA so-called strato-volcano nearly 3,500 metres (11,500 feet) high, Nyiragongo straddles the East African Rift tectonic divide."
  },
  {
    "headline": "VIDEO: So This Happened (99) reviews Buhari’s absence at Attahiru’s burial, bride showing up for exam in wedding dress, other",
    "summarized_story": "Sign Up For Punch Newsletter Subscription Successful Enter a valid email address Enter a valid email address Email Address already existSubmit No, thanksBy submitting you agree to our privacy policy"
  },
  {
    "headline": "May 30: Ignore IPOB’s sit-at-home order — Udeogaranya",
    "summarized_story": "Udeogaranya spoke at a time the Indigenous People of Biafra, IPOB, Victoria Community in Australia, disclosed that it will hold a two-day candle light dinner and procession programme between May 30 and May 31,2021 in the heart of Melbourne, Australia, to remember Biafra’s fallen heroes.\nUdeogaranya pointed out that “by faith as Christians, our God commanded us not to be rebels as vengeance belongs to God”.\nBut nevertheless, we have to manage the situation very well in order to safe guard our people through this trying period”.\nThis was disclosed in a statement by IPOB’s Director of Socials and Leader, Community Affairs Committee, IPOB Victoria, Australia, Mazi Nnamdi Nwokedi, in a statement made available to Vanguard.\n“IPOB Victoria Community Australia also applauded the decision of Comrade Uchenna Madu leadership of the Movement for the Actualization of the Sovereign State of Biafra, MASSOB, to observe a sit-at-home, on May 31st 2021."
  },
  {
    "headline": "NGF faults Buhari’s Executive Order on judicial autonomy",
    "summarized_story": "Kindly Share This Story:By Rotimi OjomoyelaEKITI—VICE-Chairman of the Nigeria Governors’ Forum, NGF, Governor Aminu Tambuwal, yesterday, accused President Muhammadu Buhari of overreaching himself on the Executive Order 10 that canvassed judicial and legislative autonomies for states.\nSpeaking on the topic ‘The Judicial Autonomy: Perspective of the Nigerian Governors’ Forum’, Tambuwal said Buhari was ill-advised in issuing the order that craved judicial autonomy for states, adding that such illegal voyage undermined the powers of the governors.\nThat was the basis of the position that we took on Executive Order 10.\n“The Executive Order 10 ostensibly intended to support the implementation of judicial financial autonomy, was completely unnecessary and ill-advised.\nLet me at this juncture state clearly that we never questioned the right of Mr. President to issue Executive Orders."
  },
  {
    "headline": "- Vanguard News",
    "summarized_story": "Umahi insisted that there is no suicide bomber or bombing in Ebonyi State even as he expressed worry over the carriers of fake news.\nI have received a lot of calls that there was a Fulani herdsman suicide bomber in Afikpo and this is really unfortunate.\nIn respect to the the South East regional security outfit, Ebube-Agu, Governor Umahi pointed out that “Ebube-Agu has come to stay.\nIf you are law-abiding and you are in the state, you will enjoy the protection of the conventional security and the Ebube-Agu security.\nAnd we do believe that when we have a peaceful environment, it guarantees development, it guarantees economic progress of the people."
  },
  {
    "headline": "Kuda Bank hits 1m customer base",
    "summarized_story": "Kindly Share This Story:Kuda Technologies, the digital-led challenger bank for Africa said that its Nigeria subsidiary – Kuda Microfinance Bank – has acquired over one million customers.\nTo mark the milestone, Kuda Chief Executive Officer, Babs Ogundeyi, and Chief Technical officer, Musty Mustapha, presented the bank’s 1-millionth customer, Mr. Abiola Jewoola, a gift of N1 million at its Lagos office.\nNot only is Kuda’s strong digital offering appealing to Nigerian millennials, many of whom are inseparable from their connected smartphones, the bank’s proposition of zero fees on cards, account maintenance and transfers has helped it make headway in Nigeria’s highly competitive retail banking market which is dominated by traditional incumbents.\n“Our growth in Nigeria is remarkable no doubt but more importantly, it is an indication of what we can achieve in other markets across the world,” said Babs Ogundeyi.\nKindly Share This Story:"
  },
  {
    "headline": "NIPOST not at war with any government agency — PMG",
    "summarized_story": "Kindly Share This Story:The Postmaster-General (PMG) Nigeria Postal Services (NIPOST), Dr Ismail Adewusi, has said that the outfit is not at war with any agency of the government.\nAdewusi said that rather than fight any battle with another government agency, the post was working with them to move the government forward.\nHe said NIPOST had a mandate which includes the production of postage stamps including revenue stamps.\n“NIPOST has a mandate which includes production of postage stamps including revenue stamps which was covered by the Finance Act 2020.\n“The postage stamps that NIPOST creates are not just to post letters but to also authenticate documents,” he said."
  },
  {
    "headline": "Tell Nigerians how you spent recovered loot",
    "summarized_story": "Some Nigerian stakeholders have called on President Muhammadu Buhari to disclose spending details of all recovered funds for the past four years.\nThe Federal Government on July 28 2020, said it recovered over N800 billion in looted funds.\n“This administration has recorded over 1,400 convictions, including high profile ones, and recovered funds in excess of N800 billion, not to talk of forfeiture of ill-gotten properties.\nAccording to Malami, The FG has recovered a total of $700 million looted funds in the last four years.\nCiting the current economic situation in the country, some Nigerians have demanded to know what has happened to the recovered funds."
  },
  {
    "headline": "Igbos in diaspora call on UN, EU, others to intervene in South-East crisis",
    "summarized_story": "The Igbos under the umbrella of Ekunie Initiatives, IEI have called on the United Nations, European Union and other International Organisations to intervene in the current face-off between the Nigerian Security Operatives and the Southeastern citizens.\nDAILY POST reports that the South-East region of the country has been plunged into unusual unrest recently over the clash between security agencies and the Igbos particularly the Indigenous People of Biafra, IPOB.\nAccording to the statement, the International Organisations are urged to visit the region in a bid to ascertain the state of insecurity in the area.\nThe group called on the Federal Government to take charge of the security situation in the South-East region, urging it to live up to its constitutional responsibility of protecting lives and property.\nIEI also condemned the activities of the unknown gunmen attacking the security formations and other government property in South-East."
  },
  {
    "headline": "Constitutional review: It may end up inconclusive like others",
    "summarized_story": "The President, Christian Lawyers in Africa, Barrister Sunny Abayomi Akanni, has alleged that the constitutional review exercise embarked on by the 9th Senate may end up like the previous ones in the country which till date had remained inconclusive.\nHe said, “l am sure that if this Senate will do the constitutional review we (Nigerians) are asking for, they will become the only lawmakers that may have made Nigerians happy but nothing may come out of it and l will not be surprised.\nThis is not the first constitutional review exercise that l have participated in.\nI have not seen fundamental changes that we are looking for because the 1999 constitution is not a constitution for Nigeria, the constitution was imposed on us.\nHe lamented that the former constitutional review exercises have no conclusive outcome, adding that the National Conference report of 2014 is somewhere wasting away."
  },
  {
    "headline": "Open grazing ban: Buhari not in charge, Garba Shehu has sidelined Osinbajo, taken over govt",
    "summarized_story": "He called on President Buhari to address Nigerians as soon as possible, adding that Shehu lacks the constitutional right to act as President of Nigeria.\nThe Governors had met to deliberate on the security challenges facing their region and thus pronounced a ban on open grazing.\n“It was equally reported that President Buhari backed Malami’s stand on the resolutions of the Southern Governors.\n“Why won’t President Buhari who went round the country to campaign, come out and address the nation on a national TV broadcast?\n“I think it’s high time President Buhari addressed the nation."
  },
  {
    "headline": "Bomb explosion in Afikpo: Police, Ebonyi Govt lied",
    "summarized_story": "The Human Rights Writers Association of Nigeria, HURIWA, has claimed that the Ebonyi State Government and the police command in the state lied over the detonated ‘bomb’ which killed a policeman on Tuesday.\nDAILY POST had reported that an explosion occurred opposite Amizi Amangbala Primary School in Afikpo North in Ebonyi State on Tuesday which plunged residents into tension while passersby ran for safety.\nA statement by the Special Assistant to the Ebonyi State Governor on Media and Publicity, Francis Nwaze also described the report as the handiwork of mischief-makers.\n“We want the Ebonyi state governor David Nweze Umahi and Commissioner of police to clarify us because one of them or even the two of them have lied to us through their aides.\nEbonyi State government and the Ebonyi State Command are twin evils and haven’t told Nigerians the whole truth and nothing but the truth and Nigerians should take their conclusion with a pinch of salt."
  },
  {
    "headline": "CBN Senior Tennis Open Championship: Impressive Quadre, Samuel advance",
    "summarized_story": "Olamide, who gained entrance into the main draw from the qualifiers, decried her painful exit in the first round after succumbing to the superior fireworks of the top seed, Quadre.\nADVERTISEMENTMeanwhile, Nene Yakubu beat Amara Nwokoro 6-3, 7-5 to advance to the next round while Blessing Samuel defeated Blessing Omotayo 6-5, 6-4.\nBut in the Men’s singles category of the 2021 CBN Open Tennis tournament ,Ehi Endurance suffered a 6-4,6-4 defeat in the hands of Isaac Omeruah who moved on to the next round.\nIn other matches decided yesterday, Peter Lawal beat Suleiman Ibrahim 6-3,6-4 to cruise into the 3rd round while Musa Mohammed defeated Dickson John 6-2 ,6-2 as Isaac Attah earned a 6-2,6-2 victory over Leo Emmanuel.\nIsaac Emeruwa was beaten 6-1, 6-2 by Micheal Chima while Wilson Igbinovia stopped Adehi Ochei 6-1,2-6,7-5."
  },
  {
    "headline": "Afe Babalola to NASS: Substitute 1999 constitution with 1963 constitution",
    "summarized_story": "By Tony Akowe and Nicholas Kalu, AbujaLegal luminary Chief Afe Babalola (SAN) has urged the National Assembly to find ways of reawakening and reenacting the 1963 Constitution as against the 1999 Constitution being contemplated for amendment.\nADVERTISEMENTBabalola, who gave the advice yesterday in a statement he personally signed in Ado-Ekiti, said the 1999 Constitution will not solve Nigeria’s problems.\nHe said: “Alternatively, since amendment in law includes substitution for an existing document, why is it that the National Assembly cannot call for a Public Hearing on the substitution of the 1999 Constitution for the 1963 Constitution which was made with the consent of the people?”"
  },
  {
    "headline": "Tecno: COVID-19 has changed economies",
    "summarized_story": "By Lucas AjanakuOriginal equipment manufacturer (OEM), Tecno Mobile, has said the outbreak of COVID-19 has had a defining impact on global economy.\nIts General Manager, Stephen Ha, who spoke during the unveiling of Tecno Camon 17 Pro said the technology company will continue to innovate to ensure the satisfaction of its customers.\nTecno upgrade product design and qualities, which is increasingly elegant, energetic, durable and constantly pioneering and touches human spirit.\nThis gave the audience an understanding of why the Camon 17 is so well-suited for its users.\nThe Camon 17 Series have the Camon 17 Pro, Camon 17P, Camon 17, will sell at a recommended retail price N125,000, N97,000 and N75,000 respectively and is already available in all authorised phone dealers and retail stores nationwide."
  },
  {
    "headline": "Govt seeks single-digit interest for MSMEs",
    "summarized_story": "By Franca Ochigbo, AbujaThe Minister of State, Industry Trade and Investment, Mariam Katagum has called for single digit rate financing for the Micro, Small and Medium Enterprises (MSMEs).\nKatagum made this call during the virtual EcoBank MSME and Financial Inclusion Summit with the theme “Unlocking credit growth in a changing MSME lending landscape”.\nADVERTISEMENTShe urged Ecobank and the financial sector to continue in the provision of much- needed support for the Federal Government’s initiatives by granting accessible financing for the MSMEs at single digit interest rate.\nShe said: “I am delighted to be part of the event which came at a time when the present administration is strategically repositioning the MSMEs landscape towards achieving its full potentials with a view to contributing more to the economy.’’“It is in this regard that I commend the efforts of the management of Ecobank Plc, for being the major sponsors of this event and more importantly, for your sustained commitment in providing credit to entrepreneurs and small businesses in the country.”The minister said there is no doubt that MSMEs are regarded as the driving force behind structural changes and sustainable economic growth and development, particularly with respect to their contributions to job and wealth creation.\nThese enterprises play a big role in the economy and are crucial drivers of innovation and competition in many sectors of the economy."
  },
  {
    "headline": "Constitution review public hearing: Senate gets requests for state police, power devolution, new state in S’East",
    "summarized_story": "“We need to have federal, state and community police, with each granted sufficient powers to make them effective in securing the areas assigned to them and cooperating closely with each other.\n•State police, additional states dominate S’East constitution reviewThe public hearing on the review of the 1999 Constitution which kicked off in Owerri, Imo State, yesterday, was dominated by popular agitations for State policing and creation of another State in South East.\n“The truth is that there is no way the National Assembly can amend the 1999 constitution to cure the inherent defects in the 1999 constitution.\nOr can we, by way of amendment, change the Judicial powers of the President under the 1999 constitution?\nIt is a well-known fact that everything about the 1999 constitution is wound around the Presidential system of government."
  },
  {
    "headline": "NPO proffers way forward for Nigeria",
    "summarized_story": "It said the country’s resources hold innumerable economic and soft power advantages for the well being of the entire population if well managed.\nThese positions are contained in a communique jointly signed today by Kabiru A. Yusuf, President NPAN and President NPO; Mustapha Isa, President of NGE and Chris Isiguzo, President of NUJ after the end of its recent meeting in Abuja.\nSaid the NPO: “A Federal system of government, particularly in a country like Nigeria which is an overbearing centre is counterproductive to the development of the centre itself and the component units.\nHowever, the current borrowing in the face of the slide in the value of the country’s number one revenue earner-oil remains worrisome,” NPO said.\n“Today, criminality – kidnapping for ransom, banditry, arson, killings – defines the everyday reality for a good number of our citizens.”"
  },
  {
    "headline": "Edo guber: Appeal Court upholds Obaseki’s election",
    "summarized_story": "From Tony Osauzo, BeninThe Court of Appeal, sitting in Benin, yesterday, upheld the ruling of the Edo State Governorship Election Petition Tribunal against the Action Democratic Party (ADP), and reaffirmed the victory of Governor Godwin Obaseki at the 2020 governorship election.\nDelivering the judgement in favour of the governor, the Presiding Justice, M.A.\nOwoade, dismissed the main appeal, the preliminary objection and the cross appeal.\nGovernor Obaseki praised the verdict of the Court of Appealdescribing it as “another victory for Edo people.”In a statement, the governor said the verdict of the Court of Appeal is a testament to the fairness and equity of the Judiciary.\n“The verdict of the Court of Appeal, Benin City, upholding the ruling of the Edo State Governorship Election Petition Tribunal is another victory for Edo people and a testament to the fairness and equity of the judiciary.”"
  },
  {
    "headline": "South East seeks devolution of power, review of revenue allocation formula, state, local police",
    "summarized_story": "From Kenneth Udeh, OwerriChief Whip of the Senate, Dr. Orji Uzor Kalu, yesterday, presided over the South East zonal public hearing on the national review of the 1999 constitution held in Owerri, Imo State.\nThe former Abia State governor who is Chairman, South East Senate Committee supervised the exercise held for participants from Imo and Abia states, where most speakers demanded devolution of power, fiscal federalism, state and local government police.\nGovernor Ikpeazu also advocated a review of the current revenue allocation formula and argued that the current system under the Nigerian Constitution is not beneficial to states.\nHe said: “The current revenue allocation formula allocates more funds to the Federal Government at the detriment of the states and local governments.\nOther amendments suggested by the group include establishment of local government police, alteration of the revenue allocation formula, abolition of joint account, funding of primary education from the federation account among others."
  },
  {
    "headline": "State of the nation: Akeredolu calls for national dialogue",
    "summarized_story": "From Bamigbola Gbolagunte, Akure and David Onwuchekwa, NnewiOndo State Governor, Mr. Rotimi Akeredolu, yesterday, said Nigerians are desirous of a national dialogue to chart a new course for the country.\nThe governor said national dialogue was crucial for the continued existence of the country.\nHe charged the committee to address the minds and concerns of Nigerians as it commences its public hearing.\nPeople are saying ‘we want national dialogue.’ How we convoke it, I don’t know.\nPeople are being killed and places burnt, yet the President has not visited any of the states involved.”"
  },
  {
    "headline": "NNPC Seeks to Acquire 20% Stake in Dangote Refinery",
    "summarized_story": "Yakubu said discussions were already ongoing with the Dangote Group for the acquisition of the stake.\nHe said: “We have what we call the green field refinery and the Greenfield Refining Projects Division (GRPD) of the NNPC.\n“At the moment, we have Dangote Refinery, which is the 650,000 capacity barrels per day plus a mini 80,000 tonnes per annum petrochemical plant.\nI can tell you today that we are seeking to have a 20 per cent minority stake in Dangote Refinery as part of our collaboration and you know that there’s a huge quantity of crude for that refinery.\nHe added that the agency would rather want more royalties than penalties as a business enabler and a revenue generator."
  },
  {
    "headline": "Buhari Mourns as 158 Feared Dead in Kebbi Boat Mishap",
    "summarized_story": "In Sokoto, Governor Aminu Tambuwal yesterday confirmed 22 persons killed by bandits in Rabah Local Government Area of the state.\nThe boat, conveying about 180 passengers from Niger State to Kebbi State, sank in the Niger River.\nTHISDAY gathered that as at 6.30 pm yesterday, only 22 passengers had been rescued while four corpses had been recovered.\nThe Administrative Head of Ngaski District in Kebbi State, Mr. Abdullahi Wara, said only 22 survivors and one corpse were found.\nIn separate attacks on Sunday and Tuesday, the bandits killed 22 people, including a village head."
  },
  {
    "headline": "Breaking: Over 100 Feared Dead in Boat Mishap",
    "summarized_story": "By Laleye DipoTragedy struck on Wednesday when a boat conveying over 180 passengers capsized with over 100 of the passengers feared dead.\nThe boat was said to have taken off from Loko mina in Niger state at about 7.30am Wednesday and was heading to a market in Kebbi state.\nIt was learnt that the cause of the accident was the overloading of the boat and its old age.\nThe Director General of the Niger State Emergency Management Agency (NSEMA), Alhaji Ibrahim Ahmed Inga, confirmed the incident.\nEyewitnesses had claimed that in that accident too, the boat was overloaded, carrying no less than 100 passengers as against 30 that it was supposed to ferry."
  },
  {
    "headline": "Accountant General Recants, Says £4.2m Ibori Loot Has Not Been Returned to Delta",
    "summarized_story": "By James EmejoThe Accountant General of the Federation (AGF), Mr. Ahmed Idris, Wednesday clarified that the recovered £4.2m Ibori loot had not been returned to Delta State.\n“This is the true position as regards the £4.2m Ibori Loot.\n“The issue of the £4.2m Ibori Loot has not been properly resolved.\n“The Office of the Accountant General of the Federation (OAGF) wishes to put the records straight regarding the widely circulated media report on the £4.2m Ibori Loot,” the AGF stated.\nhe Accountant General of the Federation,had on Tuesday claimed that the £4.2 million loot recovered from a former Governor of Delta State, James Ibori, and his associates, which was recently repatriated from the United Kingdom, had been returned to Delta State."
  },
  {
    "headline": "Abiodun Inaugurates Roads in Ota LG",
    "summarized_story": "Ogun State governor, Dapo Abiodun, has restated that his administration would continue to consult the residents of the state to determine infrastructural projects they want government to undertake.\nThe governor stated this on Wednesday, at the official inauguration of 4.92KM AIT/Raypower and Ikola-Osi Ota-Navy Roads, in Ado-Odo/Ota Local Government Area of Ogun State.\nAbiodun noted that the two roads received his administration’s attention and were prioritised due to its importance to the residents of Lagos and Ogun States.\nThe governor, who disclosed that roads in the state would be constructed and rehabilitated to improve the lives of residents, stressed the roads fitted with street lights and walkway, would further open up Ota and Agbado borderline to investors.\nIn his welcome remarks, Commissioner for Works and Infrastructure, Ade Akinsanya, said the two roads were community based projects, adding the roads were commenced and completed within the first one year of Governor Abiodun in office."
  },
  {
    "headline": "REVEALED: How AGF Malami Covered Up $370million Abacha Loot Repatriated Through UK Attorney-General",
    "summarized_story": "“I was privy to the initial efforts to recover this sum by Obono-Obla, but Malami wrote and asked Obono-Obla to hands off,” the source revealed.\n“As chairman of our agency, I have directed that Dr Jaja hand deliver a letter to your office in Jersey.\nYou can also confirm from the Nigerian High Commission in the UK or from the UK High Commission in Abuja, Nigeria.\nThe lawmakers had also tackled the minister of justice for allegedly requesting payment of approved solicitors’ fees from the recovered loot.\nAdejoro Adeogun, chairman of the committee, had said, “The honourable AGF is requesting payment of approved solicitors’ fees."
  },
  {
    "headline": "REVEALED: How AGF Malami Covered Up $370million Abacha Loot Repatriated Through UK Attorney-General",
    "summarized_story": "“I was privy to the initial efforts to recover this sum by Obono-Obla, but Malami wrote and asked Obono-Obla to hands off,” the source revealed.\n“As chairman of our agency, I have directed that Dr Jaja hand deliver a letter to your office in Jersey.\nYou can also confirm from the Nigerian High Commission in the UK or from the UK High Commission in Abuja, Nigeria.\nThe lawmakers had also tackled the minister of justice for allegedly requesting payment of approved solicitors’ fees from the recovered loot.\nAdejoro Adeogun, chairman of the committee, had said, “The honourable AGF is requesting payment of approved solicitors’ fees."
  },
  {
    "headline": "BREAKING: Scores Feared Dead As 160-Passenger Boat Capsizes In Kebbi",
    "summarized_story": "About 140 boat passengers are said to be missing in Kebbi State after an overloaded boat ferrying them sank in the Niger River.\nThe boat left central Niger state and was heading to northwest Kebbi state when it sank, Abdullahi Buhari Wara, administrative head of Ngaski district said.\n“A rescue operation is underway but only 22 survivors and one dead body have been recovered,” Wara said.\n“We are talking of around 140 passengers still missing.”According to AFP, Wara blamed the Kebbi accident on overloading as the boat was meant to ferry not more than 80 passengers.\nThe boat ferrying 100 local traders split into two after hitting a stump during a storm as they were returning from a local market, according to emergency officials."
  },
  {
    "headline": "BREAKING: Scores Feared Dead As 160-Passenger Boat Capsizes In Kebbi",
    "summarized_story": "About 140 boat passengers are said to be missing in Kebbi State after an overloaded boat ferrying them sank in the Niger River.\nThe boat left central Niger state and was heading to northwest Kebbi state when it sank, Abdullahi Buhari Wara, administrative head of Ngaski district said.\n“A rescue operation is underway but only 22 survivors and one dead body have been recovered,” Wara said.\n“We are talking of around 140 passengers still missing.”According to AFP, Wara blamed the Kebbi accident on overloading as the boat was meant to ferry not more than 80 passengers.\nThe boat ferrying 100 local traders split into two after hitting a stump during a storm as they were returning from a local market, according to emergency officials."
  },
  {
    "headline": "\"We Want Our Own State\"— Southern Kaduna Wants Region Carved Out Of Kaduna To Stop Bloody Violence",
    "summarized_story": "Southern Kaduna Peoples Union (SOKAPU) has sought a new state from the present Kaduna State to stop the bloody violence that seemed to defy solution in the state.\nSOKAPU President, Jonathan Asake, said the Southern and Northern Kaduna, infamous for incessant inter-ethnic and religious clashes for decades, have agreed that creating a new state from the present Kaduna State will solve the age-long problem.\n\"The wish of Southern Kaduna is to have a brand new constitution, not an amended one.\nHe added, \"Southern Kaduna is made up of 67 ethnic nationalities, spread in 13 of the 23 Local Government Areas (LGAs) of Kaduna state.\n\"Kaduna South has been complaining of marginalization ever since, even though chiefdoms have been given to them and they occupy 60% of the workforce of Kaduna state.\""
  },
  {
    "headline": "EXPLAINER: What financial autonomy means for judiciary and how it affects you",
    "summarized_story": "But why is financial autonomy important for the judiciary?\nPresident Muhammadu in May 2020 signed an executive order granting financial autonomy to both the judicial and the legislative arms of government.\nAdvertisementThe president’s decision was met with commendation, especially from the judiciary but state governors expressed concerns over its constitutionality and financial implications.\nBut financial autonomy of the judiciary has been in the Constitution of the Federal Republic of Nigeria since 1999.\nOne may ask: “How does financial autonomy for the judiciary affect a common man?”The absence of financial autonomy has made it difficult for some judges to be impartial in handling cases that involve the executive (governors)."
  },
  {
    "headline": "EXPLAINER: What financial autonomy means for judiciary and how it affects you",
    "summarized_story": "But why is financial autonomy important for the judiciary?\nPresident Muhammadu in May 2020 signed an executive order granting financial autonomy to both the judicial and the legislative arms of government.\nAdvertisementThe president’s decision was met with commendation, especially from the judiciary but state governors expressed concerns over its constitutionality and financial implications.\nBut financial autonomy of the judiciary has been in the Constitution of the Federal Republic of Nigeria since 1999.\nOne may ask: “How does financial autonomy for the judiciary affect a common man?”The absence of financial autonomy has made it difficult for some judges to be impartial in handling cases that involve the executive (governors)."
  },
  {
    "headline": "'100 students' hospitalised in Ekiti after fumigation exercise",
    "summarized_story": "Students of the College of Health Sciences and Technology in Ijero Ekiti, Ekiti state, were hospitalised on Wednesday, after reportedly inhaling chemicals used for a fumigation exercise in the school.\nThe state also disclosed that the incident was the result of a fumigation exercise carried out in the school.\nAdvertisement“Today, we received information that a number of students from the Ekiti State College of Health Technology, Ijero, were hospitalised at State Specialist Hospital Ijero, as a result of an ill-timed fumigation exercise,” the statement reads.\n“We regret this situation and we are closely monitoring the hospitalised students to ensure they fully recover.\nToday, we received information that a number of students from the Ekiti State College of Health Technology Ijero were hospitalised at State Specialist Hospital Ijero, as a result of an ill-timed fumigation exercise."
  },
  {
    "headline": "'100 students' hospitalised in Ekiti after fumigation exercise",
    "summarized_story": "Students of the College of Health Sciences and Technology in Ijero Ekiti, Ekiti state, were hospitalised on Wednesday, after reportedly inhaling chemicals used for a fumigation exercise in the school.\nThe state also disclosed that the incident was the result of a fumigation exercise carried out in the school.\nAdvertisement“Today, we received information that a number of students from the Ekiti State College of Health Technology, Ijero, were hospitalised at State Specialist Hospital Ijero, as a result of an ill-timed fumigation exercise,” the statement reads.\n“We regret this situation and we are closely monitoring the hospitalised students to ensure they fully recover.\nToday, we received information that a number of students from the Ekiti State College of Health Technology Ijero were hospitalised at State Specialist Hospital Ijero, as a result of an ill-timed fumigation exercise."
  },
  {
    "headline": "Donald Duke: It's unfortunate Ayade left after encouraging me to rejoin PDP",
    "summarized_story": "Donald Duke, former governor of Cross River state, says he returned to the Peoples Democratic Party (PDP) in 2020.\nAdvertisementDuke, who served as governor for eight years on the platform of PDP, left the party in 2018 to contest for the presidential election under the Social Democratic Party (SDP).\nIn a statement on Wednesday, Duke said Ben Ayade, governor of the state, urged him to return to the PDP, adding that it was unfortunate the governor defected from the party.\nAdvertisement“Dear Friends, a lot is being said about my return to the Peoples Democratic Party, PDP.\nIt is rather unfortunate that Governor Ben Ayade who constantly egged me to rejoin the party has himself had cause to leave,” Duke said."
  },
  {
    "headline": "OPay in talks to raise $400 million from investors at $1.5bn valuation to finance expansion plans",
    "summarized_story": "OPay is reportedly in talks to raise $400 million from investors at a valuation of $1.5 billion, according to an exclusive report from The Information.\nOPay is looking to raise funding to finance its expansion plan, having launched in Egypt this year.\nAn Africa-focused company with Chinese backersWhile OPay is based in Nigeria, its backers are mostly Chinese companies like Meituan, a multi-billion-dollar Chinese shopping platform.\nIn July 2019, OPay raised $50 million from Sequoia Capital, IDG Capital, Source Code, GSR Ventures and Meituan-Dianping.\nYet, should they successfully raise $400 million, it will be the kind of war chest that makes anything possible."
  },
  {
    "headline": "Dominic Joshua’s ‘hedge fund’ paid out 30% monthly returns. Then the scam unravelled",
    "summarized_story": "That payment arrived two weeks later after Adigun repeatedly pressured Dominic Ngene Joshua, the founder and head of Brisk Capital, on Instagram.\nAdigun says her sister also invested in Brisk Capital but never received any returns.\nPosh Josh sells ChanelEmpowered with an increasingly posh image and a slick Brisk Capital website, Joshua began taking funds from willing investors.\nAn advisory note from ChiveGPS, a consultancy, to a client who wanted to invest with Dominic Joshua’s Brisk Capital.\nShe thought the percentage was outrageous but trusted her friend who was a Brisk Capital agent to help her invest."
  },
  {
    "headline": "Dr Vuyane Mhlomi is helping patients receive treatment from the comfort of their own homes",
    "summarized_story": "Before he turned ten, a typical Friday would find Vuyane Mhlomi on one of many trains making his way back home from school.\nToday, Vuyane is a medical doctor, Rhodes scholar, and the co-founder of Quro Medical – a startup making it possible for patients to receive the best care from the comfort of their homes.\nVuyane with his mother Nomsa at his graduation from UCTVuyane lost his father when he was eleven years old.\nVuyane returned to South Africa ready to start a business that would change the healthcare landscape forever.\nOn one hand, Quro finally had capital to begin expanding their services across South Africa and beyond."
  },
  {
    "headline": "Brand Africa Ranks TECNO 6th on the Most Admired brands in Africa List",
    "summarized_story": "– In the recently released Africa’s Best Brands 2021, TECNO ranked for five consecutive years among the TOP 6 brands on the African continent, marking another prestigious recognition of the brand’s leadership in Africa.\nEstablished in 2011, the Brand Africa 100: Africa’s Best Brands rankings is the most authoritative survey and analysis on brands and underlying businesses in Africa, based on a study by Geopoll across 28 countries spanning all the five economic regions and analysis and ranking by Kantar and Brand Leadership.\nThe 2021 survey was conducted between March and April 2021 and yielded over 80,000 brand mentions and over 3,500 unique brands.\nWhen TECNO launched dual SIM cards in Africa, there had been nothing of the kind before then.\nAnd now, with Brand Africa’s new rankings, TECNO has once again come out tops, becoming a leading player in mid to high-end mobile brand segments in Africa."
  },
  {
    "headline": "How OctaFX became the first financial company in Nigeria to organise a cooking session for Ramadan",
    "summarized_story": "OctaFX brought two popular bloggers together in a cooking studio: the comedian Apaokagi Maryam and the music video director Abdulazeez Greene.\nThey prepared a special evening meal for Ramadan called Iftar and compared the subtleties of cooking with those ingrained in trading.\n‘Ramadan Special’ is the first cooking show in Nigeria produced by a financial company.\nApaokagi Maryam is a frequent collaborator of the global Forex broker and took part in the last OctaFX Goal Booster promotion.\nThe company is aspiring to create more shows like ‘Ramadan Special’ in the future."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Brand Africa ranks TECNO 6th on the most admired brands in Africa list",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa's audience directly.\nTo promote your brand via Brand Press, please email [email protected]In the recently released Africa’s Best Brands 2021, TECNO ranked for five consecutive years among the TOP 6 brands on the African continent, marking another prestigious recognition of the brand’s leadership in Africa.\nEstablished in 2011, the Brand Africa 100: Africa’s Best Brands rankings is the most authoritative survey and analysis on brands and underlying businesses in Africa, based on a study by Geopoll across 28 countries spanning all the five economic regions and analysis and ranking by Kantar and Brand Leadership.\nThe 2021 survey was conducted between March and April 2021 and yielded over 80,000 brand mentions and over 3,500 unique brands.\nAnd now, with Brand Africa’s new rankings, TECNO has once again come out tops, becoming a leading player in mid to high-end mobile brand segments in Africa."
  },
  {
    "headline": "Brand Africa ranks TECNO 6th on the most admired brands in Africa list",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa's audience directly.\nTo promote your brand via Brand Press, please email [email protected]In the recently released Africa’s Best Brands 2021, TECNO ranked for five consecutive years among the TOP 6 brands on the African continent, marking another prestigious recognition of the brand’s leadership in Africa.\nEstablished in 2011, the Brand Africa 100: Africa’s Best Brands rankings is the most authoritative survey and analysis on brands and underlying businesses in Africa, based on a study by Geopoll across 28 countries spanning all the five economic regions and analysis and ranking by Kantar and Brand Leadership.\nThe 2021 survey was conducted between March and April 2021 and yielded over 80,000 brand mentions and over 3,500 unique brands.\nAnd now, with Brand Africa’s new rankings, TECNO has once again come out tops, becoming a leading player in mid to high-end mobile brand segments in Africa."
  },
  {
    "headline": "Have you ever worked as an insurance sales agent, or currently work as one? Help provide insight",
    "summarized_story": "If you’ve ever worked as an insurance sales agent — financial services advisor — or currently do, please keep reading.\nWe have designed the research project to get information from major players in the insurance industry: the potential buyers of insurance products, the sales agents, and the insurance companies.\nPlease, take five minutes to fill this multiple-choice questionnaire if you have insurance sales experience.\nAdvertisementAnd if you have no insurance sales experience, kindly send this to anyone you know who does.\nIntelligence by Techpoint also offers research consultancy services to businesses and institutesComments"
  },
  {
    "headline": "News",
    "summarized_story": "The past few days have seen the value of cryptocurrencies take a massive dip, which is said to have stemmed from Elon Musk’s tweet.\nWhile this is not the worst crash the market has witnessed, how shou…"
  },
  {
    "headline": "Nigeria’s trade sector seen exiting 2 years of negative growth",
    "summarized_story": "Nigeria’s trade sector, the second-biggest contributor to GDP, could return to positive growth in the second quarter of 2021, according to several analysts polled in a BusinessDay survey.\nAn analysis of the recently published first-quarter GDP 2021 report by the National Bureau of Statistics (NBS) shows that activities in the sector contracted by 2.43 percent…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Tax cuts, low prices top benefits of special airport zones",
    "summarized_story": "OR Tambo International Airport in South Africa and Charles De Gaulle in France are typical examples of this well integrated airport community.\nOR Tambo International Airport has incentives packaged to support foreign or domestic direct investment.\nA special economic zone (SEZ) is an area in which the business and trade laws are different from the rest of the country.\nThe airport community is ordinarily a large community.\nFrom these figures, Murtala Muhammed International Airport, Lagos (MMIA) recorded 1,046,568 passenger traffic, representing 11.1 percent; Nnamdi Azikiwe International Airport, Abuja, recorded 473,008, representing 5 percent, and Port Harcourt International Airport recorded 29,526 passenger traffic, representing 0.31, while Kano International Airport recorded 46,071 passenger traffic, representing 0.48 percent."
  },
  {
    "headline": "Speculation pushes naira to one-year low",
    "summarized_story": "The pressure on Nigeria’s currency intensified on Wednesday as black market speculators have taken advantage of the Central Bank of Nigeria (CBN) newly adopted exchange rate to buy up and hoard dollars.\nConsequently, the naira fell to N493 per dollar on Wednesday, the lowest since November 30, 2020, when it weakened to as low as…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Reps Committee wants authors of anonymous “Non-Paper” petition prosecuted – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The House of Representatives Committee on Foreign Affairs has called on security agencies to investigate and prosecute the authors of a “Non-Paper” petition, accusing the leadership of the Ministry of Foreign Affairs of monumental corruption.\nBuba said that the reform is dealing with the many years of suspected systemic corruption and official malfeasance in the ministry.\n“Part of the allegations contained in the so- called petition dealt extensively with the fiscal years of 2018, 2019 and 2020 respectively.\n“He has indeed, pointed out the way he intends to go in actualising the dreams of the National Assembly for the Ministry of Foreign Affairs.\n“As a result, the committee, unanimously commends the permanent secretary for his dogged commitment to upholding the reforms of President Buhari at the Ministry of Foreign Affairs,’’ he said."
  },
  {
    "headline": "PTI Tasks Students On Entrepreneurial Development, Matriculates 1,901 Students – Nigerian Observer",
    "summarized_story": "Dr. Henry Adimula stated this during the Institute’s annual matriculation ceremony held at PTI Conference Centre, Effurun, Uvwie Local Government Area, Delta State.\n“Entrepreneurship Development is another area that we are building the capacity of our students.\nSome of the visibly excited matriculants, Miss Aishat Oluwatosin and Usuangbon Irehze they were happy becoming bonafide students of the Petroleum Training Institute.\n“My name is Aishat Oluwatosin, I’m matriculating today in the Petroleum Training Institute.\n“I promise to give my best to the Petroleum Training Institute and come out with excellence” he said..."
  },
  {
    "headline": "EIRS Hails IUO On Tax Compliance – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOKADA(OVIA NORTHEAST) – Edo State Internal Revenue Service (EIRS), yesterday appreciated Igbinedion University, Okada (IUO) for being tax compliant.\nResponding to the raised tax issues on behalf of the Vice Chancellor, IUO, Professor Lawrence Ikechukwu Ezemonye, Dr. Nosa Edogiawerie (Bursar) appreciated the delegation and encouraged its continuance for ease of tax administration in the state.\nHe affirmed that non payment of tax would dent the image of the hospital and possibly attract a riot act from government.\nAn expatriate and Director of Administration, Igbinedion University Teaching Hospital, Michael Strauss, stated that taxes must be deducted to be responsible employees to government which depends on revenue to succeed.\nHe stated that if taxes are not paid to government one could get punished (nailed) as applicable in advanced countries hence appreciated government for it’s resilience at tax collection."
  },
  {
    "headline": "Ambrose Alli Varsity: Visitation Panel indicts ousted mgt of 1.7bn fraud – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…N133m lease obtained for motor vehicle procurementBENIN CITY – The Ambrose Alli University, Ekpoma, Special Visitation Panel has indicted the ousted management of the institution for “indiscriminate procurement of loans/overdraft” to the tune of N1,794,069,811.02 within the period under review.\nThe panel, which was constituted by Governor Godwin Obaseki in the wake of the agitation by staff unions in the school and other stakeholders in the university community, was tasked to investigate operations of the university in terms of revenue generation, transparency, accountability, adherence to due process, mode of employment and promotions and sustainability.\nThe panel, set up in October, 2020, was chaired by Prof. Ikponmwosa Omoruyi, a Professor of Law at the University of Benin.\nProf. Lawrence Atsegbua, who is a member of the panel, is also a Professor of Law at the University of Benin and a Senior Advocate of Nigeria (SAN).\nOthers on the panel are Mrs. M. E. Ohiowele, Roland Ogbebor, Dr. J. O. Okovido and Venerable Osaze Egbenusi, as members, with Mrs. P. E. Aziegbemhin, as Secretary."
  },
  {
    "headline": "Ibori Loot: Accountant General clarifies stance, says money not yet returned to Delta",
    "summarized_story": "ADVERTISEMENTThe Accountant General of the Federation, Ahmed Idris, has said that the 4.2 million pounds Ibori loot has not been returned to Delta State, contrary to his earlier claim.\nMr Idris had on Tuesday told federal lawmakers in Abuja that the money, returned to the Nigerian government by the UK government, had been returned to Delta State from where it was stolen by James Ibori, former Delta governor.\nHowever, the Delta State Government said on Wednesday that it has yet to receive the money.\nHe is back in Nigeria where he is actively involved in the politics of the Delta State as a godfather.\nThe stolen money was recently returned to the Nigerian government by the UK government which seized it from the former governor."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Children must be brought up to be most innovative – Modupe Adeyinka-Oni",
    "summarized_story": "Now you see your products out there, children you have raised, and who have gone on to play roles in society.\nAnd so, I needed a school where my children would not just go but will thrive.\nWe are a small school, a family school, and we believe that children should be able to express themselves in their natural environment.\nWhere the children will place you in terms of the seniors and where the staff will place you.\nFor a lot of children, their voices are being drowned out under that old philosophy of children only being permitted to listen and not be heard."
  },
  {
    "headline": "U.S. Consulate, Exchange Alumnus seek inclusion of arts in healthcare, launch innovation hub",
    "summarized_story": "United States Consulate General in collaboration with Tender Arts Nigeria unveiled an “Arts and Medicine Innovation Hub” hosted at the Federal Neuropsychiatric Hospital, Yaba, Lagos.\nSpeaking at the formal opening of the innovation hub, U.S. Consulate Acting Public Affairs Officer Jennifer Foltz explained that incorporating the arts into healthcare delivery will enhance holistic patient care.\nAccording to her, the innovation hub will provide opportunities for cultural exchange for art therapists, arts in health practitioners and mental health advocates in Nigeria and beyond.\nIn Lagos State, we will be seeking the input of artists in the design of our new public healthcare facilities,” Professor Abayomi added.\nFounder/Executive Director Tender Arts Nigeria, Kunle Adewale, said creative arts programs can help patients work towards recovery in an effective and enjoyable way."
  },
  {
    "headline": "Army bust Boko Haram logistics stockpile, arrest fuel suppliers",
    "summarized_story": "OBINNA EZUGWUTroops of Operation Hadin Kai on Tuesday, May 25, 2021 raided a suspected Boko Haram logistics stockpile in Kurkareta town, Yobe State, a statement from Army spokesperson, Brig.\nAccording the statement, items recovered during the raid operations by troops in conjunction with local vigilantes include 62 jerrycans loaded with Premium Motor Spirit popularly called petrol, hidden in different houses and shops.\nThree vehicles belonging to the terrorists’ suppliers with registration numbers DAL 626 YE (Kano), GBK 413 GR (Benue) and XA 390 SHN (Borno) were also impounded.\n“The successful raid was undertaken following credible intelligence that some members of the community are suppliers of fuel and other products to insurgents.\nAll the recovered items and the suspects are in our custody for preliminary investigations before handing them over to the appropriate agency for prosecution,” the statement said."
  },
  {
    "headline": "Iran bans Bitcoin mining over power outage",
    "summarized_story": "Iran has banned the mining of Bitcoin after a series of blackouts across major cities.\nThe ban comes amidst a growing unease over cryptos energy usage, and follows a regional ban placed on Bitcoin by China.\nAccording to Bloomberg, Iranian officials are blaming a surge in mining for blackouts in their cities.\nSubsidised power prices allow miners to run the complex computers that compete to solve mathematical problems and receive Bitcoin as a reward.\nThe University of Cambridge estimates Iran was home to 3.4% of Bitcoin mining in the first four months of 2020, putting it in sixth place globally."
  },
  {
    "headline": "Seven Tips: On Healthy Workplace Drinks",
    "summarized_story": "Here are tips on healthy drinks you can have at home or in the workplace!\nINFUSE YOUR WATER WITH DELICIOUS FLAVORFlavored waters are everywhere these days, but many contain sugar or artificial sweeteners.\nStart with a glass of sparkling or seltzer water and add a few slices of lemon or lime (or both) and a dash of stevia-based sweetener, which is calorie-free and low in carbohydrates.\nJUICE FRESH VEGETABLES, NO CHOPPING NEEDEDVegetable juice offers a quick, low-calorie way to get many of the benefits of veggies, without fiber.\nFor example, 1 cup of orange juice contains roughly 24 grams (g) of sugar, while 1 cup of tomato juice contains 6 g of sugar."
  },
  {
    "headline": "T Pumpy Kiddies Abuja Estate Land with C-of-O Goes for N120k",
    "summarized_story": "As part of the programme to celebrate this year’s Children’s Day celebration, Abuja-based real estate firm, T Pumpy Concept Limited has announced a slash in the prices of their lands.\nWith the promo, a 300SQM of land located in Kwali area of Abuja with Certificate of Occupancy is now going for N120k.\nADVERTISEMENTThe Children’s Day special promo ends on the 28th of May, 2021The T-Pumpy Concept team has decades of providing industry-acclaimed off-site home designs and constructions.\n12, Monrovia Street, Off Aminu Kano Crescent, Wuse II district, Abuja, Annex House 23, (F) Road, Beside RCCG Resurrection Parish, FHA Lugbe, Abuja.\nInstagram: T.pumpy_estatesFacebook: Tpumpy EstatesYouTube : T.pumpy EstatesWebsite: http://tpumpyconcept.comWhatsApp/call: 09054545468 or 09023333380"
  },
  {
    "headline": "Health & Wellness /Future Doctor: How To Treat/Prevent Diarrhea",
    "summarized_story": "By Augustine, Ojone Bridget, SS 3A, GSS Wuse Zone 3When a person has loose or watery stool, the person is said to have diarrhoea.\nCAUSES OF DIARRHEADiarrhoea has many different causes, the most common are infection and poor nutrition, with good hygiene and good food, most diarrhea could be prevented.\nPoor nutrition – this weakens the child and make diarrhea worstShortage of water and unclean conditions spread the germs that cause diarrhoeaVirus infection or intestinal flu (i.e.\nan infection of the gut caused by the bacteria)AIDS (long lasting diarrhoea may be an early sign)ADVERTISEMENTPREVENTIONPrevent diarrhea by preventing malnutritionPrevention of diarrhea also depends on good nutrition and cleanlinessHere are some other important tips for preventing diarrhea in babies:Breastfeed rather than bottle feed babies.\nBut they themselves sometimes cause diarrhoea, especially in small children."
  },
  {
    "headline": "President Buhari Commends Education Minister At 67",
    "summarized_story": "President Muhammadu Buhari congratulated the minister of Education, Malam Adamu Adamu, as he marked his 67th birthday.\nBuhari in a statement by his media aide, Garba Shehu said from his decades-long association with Adam, a close associate, some of the characteristics that mark him (Adamu) out of the crowd are “his insightful ideas and motivational thoughts.”The president said he is pleased that the country’s education sector is moving ahead with energy, innovation and excellence due to the minister’s strong qualities.\n“Happy Birthday to our respectable minister of Education, wishing you many more happy returns of the day!” said the President"
  },
  {
    "headline": "COVID-19: Minister Hands 40 Vehicles Over To States",
    "summarized_story": "Minister of Humanitarian Affairs, Disaster Management and Social Development, Sadiya Umar Farouq has handed over 40 operational vehicles for onward distribution to coordinators of the State COVID=19 Action Recovery and Economic Stimulus (NG-CARES)The vehicles which were procured by the Federal Project Support Unit of the Federal Ministry of Humanitarian Affairs were handed over to the minister of state for Budget and National Planning, Prince Clem Ikande Agba, on Wednesday at the Eagle Square, Abuja.\nThe NG CARES is the federal government initiative with support from the World Bank to mitigate the effects of the COVID-19 pandemic.\nPresenting the vehicles, the minister thanked the World Bank for coming to the aid of the poor and vulnerable people of Nigeria affected by the Covid-19 pandemic.\nIn his remark, the minister of state for Budget and National Planning said the programme under the National COVID-19 Action Recovery and Economic Stimulus (NG-CARES) will assist vulnerable Nigerians who were hit by the pandemic.\nEach state will receive the sum of $20 million dollars over a period of two years while the FCT will get $15 million and the Federal Care Support gets $15 million with effect from June 30, 2021."
  },
  {
    "headline": "Southern, northern Kaduna want state split — Daily Times Nigeria",
    "summarized_story": "The President of the Southern Kaduna Peoples Union (SOKAPU), Hon.\nJonathan Asake, who defended the memo of Southern Kaduna people said: “The wish of Southern Kaduna is to have a brand new constitution, not an amended one,” he said.\n“Southern Kaduna is made up of 67 ethnic nationalities spread in 13 of the 23 Local Government Areas (LGAs) of Kaduna State.\n“On our part, we are asking for the creation of ‘New Kaduna State’, which will include Kaduna North and Kaduna Central Senatorial zones,” he said.\nGovernor Nasir el-Rufai of Kaduna State, who declared the meeting open, also asked for true Federalism, State Police and Financial Autonomy to Local Government Councils."
  },
  {
    "headline": "EFCC, ICPC, others under lawmakers' scrutiny over recovered Loots —",
    "summarized_story": "Tom Okpe, AbujaTo intensify the Buhari administration’s fight against corruption, the House of Representatives Adhoc Committee on Assessment and Status of All Recovered Loots on Wednesday queried the Economic and Financial Crimes Commission (EFCC), Independent Corrupt Practices and Other Related Offences (ICPC) as well as other relevant agencies over the assets.\n“The EFCC only relied on annual budget for its operational cost, we do not take money from recovered loot for operations.”The EFCC Chairman later pleaded that he should be excused by the committee to attend to another serious pressing engagement which got the committee angry.\nChairman of the Committee, Adejora Adeogun told the EFCC chairman that he was undermining the powers of the committee, but the Chairman immediately apologised, pleading for understanding.\nHe said the sum of N5.5 billion had gone to the Federal Government from the recovered loot, noting that it was disturbing that the system of assets recovery had not been efficient in terms of record.\nOwasanloye said that the ICPC had an assets recovery account where recovered loots were usually deposited, as the commission had no business with consolidated revenue fund."
  },
  {
    "headline": "Lagos attracts $8.32 billion investment in two years — Daily Times Nigeria",
    "summarized_story": "Lagos State Government has attracted $8.32 billion investment in the last two years as it has the ability to bring in, retain and leverage on inclusive and sustainable economic growth.\n“Other strategies and efforts undertaken to promote sustainable investment in Lagos include the strategic partnerships with development agencies, including the International Finance Corporation (IFC), Africa Development Bank (AfDB), World Bank and the French Development Agency (AFD),” Hammond disclosed.\nBeside exploring foreign collaborations to make Lagos a premier of investment in Africa, the Special Adviser pointed out that the Office has established a good relationship with Nigeria Investment Promotion Commission (NIPC), with the appointment of a Lagos Liaison Officer.\n“The Office coordinated the launch of the Lagos Care Initiative, a socio-economic intervention programme for vulnerable residents, designed to impact about 20,000 people, 69 markets and 2,512 MSMEs.\nM.E.S Agenda with SDGs, the Office has launched the SDGs’ Champions in all Ministries Departments and Agencies (MDAs)."
  },
  {
    "headline": "'Delta govt hasn't received £4.2 million returned from UK' —",
    "summarized_story": "*Why state can’t get money, by Buhari’s aideBy Nosa Akenzua, AsabaDelta State Government on Wednesday said it had not received the 4.2 million pounds Ibori cash returned by the United Kingdom from the Federal Government.\nThe Accountant-General told the Committee such funds looted from the treasury of a state are always returned to the state.\n“Was the recovered Ibori loot returned to the Dr. Ifeanyi Okowa-led Delta State government?\nAgain, no penny was paid to the Delta State government.\n“If we break the conditions for getting this chicken amount, how do we get the elephant amount that is still coming?"
  },
  {
    "headline": "Kaduna varsity students protest fees hike from N35, 000 to N150, 000",
    "summarized_story": "Aggrieved students of the Kaduna State University (KASU) on Wednesday staged a peaceful protest in the main campus over plans by government to increase school fees from N35, 000 to minimum of N150, 000.\nThe students alleged the hike appeared to be a continuous attempt to deny them their right to education.\nPresident National Association of Science Students, Abubakar Buhari, told reporters the old fee was between N24, 000 and N26, 000 depending on the course of study for indigenes while non-indigenes pay between N31, 000 and N36, 000.\nPresident, Nigerian Association of Microbiology Students, Yusuf Rahama, noted education was one key thing that keeps students away from the street vices including banditry and kidnapping.\nThe government should decrease the fees since some of our parents are being sacked and can no longer afford to pay our fees,” he said."
  },
  {
    "headline": "Kaduna varsity students protest fees hike from N35, 000 to N150, 000",
    "summarized_story": "Aggrieved students of the Kaduna State University (KASU) on Wednesday staged a peaceful protest in the main campus over plans by government to increase school fees from N35, 000 to minimum of N150, 000.\nThe students alleged the hike appeared to be a continuous attempt to deny them their right to education.\nPresident National Association of Science Students, Abubakar Buhari, told reporters the old fee was between N24, 000 and N26, 000 depending on the course of study for indigenes while non-indigenes pay between N31, 000 and N36, 000.\nPresident, Nigerian Association of Microbiology Students, Yusuf Rahama, noted education was one key thing that keeps students away from the street vices including banditry and kidnapping.\nThe government should decrease the fees since some of our parents are being sacked and can no longer afford to pay our fees,” he said."
  },
  {
    "headline": "Suspected Yahoo boy kills twin brother in Delta",
    "summarized_story": "A suspected Yahoo boy, who allegedly killed his twin brother at Oleh, headquarters of Isoko South Local Government Area, Delta State, has been arrested by police operatives.\nThough the reason for the killing could not be ascertained at press time, sources said it might have been carried out for ritual purposes.\nThe door was forced open and they found him sitting close to the decomposing body of his twin brother.\nA dog was also found in the house,” a source, who craved anonymity, said.\nWhen they broke into the house, they saw the decomposing body and the twin brother.” VanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Ecobank Set To Host Second AgriBusiness and Food Security Summit",
    "summarized_story": "By JOHN MOMODUAll is now set for the 2nd edition of the Ecobank Agribusiness and Food Security Summit organized in association with Vanguard Economic Forum Series.\nThe primary content objective of summit is to discuss the role of technology and digitisation across the agricultural value chain.\nStrategic Partners to Ecobank on the summit are Small and Medium Enterprises Development Agency of Nigeria (SMEDAN) and the Nigerian Association of Small & Medium Enterprises (NASME).\nOthers include the Nigeria Incentive-Based Risk Sharing System for Agricultural Lending (NIRSAL) and Nigeria Agribusiness Group (NABG).\nThe Ecobank Digital Series is a virtual programme organised by Ecobank to educate and enlighten the public on crucial issues of public interest, especially as it relates to their financial empowerment."
  },
  {
    "headline": "Faces of Indianapolis shooter Brandon Scott Hole",
    "summarized_story": "By AbankulaPolice authorities in Indianapolis on Friday released the photo of Brandon Scott Hole, the 19-year-old former FedEx worker, who killed eight people Thursday night.\nThe release of his photo corrected false images of the shooter earlier published in the social media.\nHole went on a shooting spree at the FedEx facility before turning the gun on himself.\nAccording to reports, he last worked for FedEx in 2020.\nCops still don’t know his motive and where he got the rifle he used."
  },
  {
    "headline": "52 Nigerians hit with severe reactions after taking AstraZeneca vaccine",
    "summarized_story": "By Kazeem UgbodagaThe National Primary Health Care Development Agency, NPHCDA, on Friday disclosed that 52 Nigerians have experienced moderate to severe reactions after taking the AstraZeneca vaccine.\nExecutive Director and Chief Executive Officer, NPHCDA, Dr. Faisal Shuaib disclosed this at a news conference in Abuja.\nHe also said 8,439 Nigerians experienced mild Adverse events following immunization (AEFI) after taking the vaccine.\n“Similarly, 52 cases of moderate to severe incidents of AEFI have been reported.\nAccording to Shuaib, as of today, April 16th, 1,071,346, representing 53.2% of the eligible persons targeted with the AstraZeneca vaccine had been administered their first dose in this vaccination phase."
  },
  {
    "headline": "Plane Crash: Apostle Okikijesu Releases ‘Shocking’ June, July Prophecies",
    "summarized_story": "Apostle Paul Okikijesu has revealed that Nigerians should pray to avert plane crash of a private jet betwen June and July.\nThe popular prophet disclosed this in the prophecies sent to newsmen on Wednesday.\nHe said; “Thus says the Lord: I the Lord had previously instructed people to pray against plane crash and fire incidents or accidents at the airports; another private jet may crash that will cause loss of lives; if people are not prayerful.”“Pray against plane crash of a private jet between June and July 2021.\n“Thus says the Lord: People should pray against the plane crash of a private jet that can make the country to weep; due to loss of lives of the influential figures between June and July 2021.\nOkikijesu also said God’s judgment will fall on former Governors who are now Senators."
  },
  {
    "headline": "President Kagame Advises Buhari, Others To Tackle Africa’s Crises",
    "summarized_story": "President Paul Kagame of Rwanda has urged President Muhammadu Buhari and other African leaders to involve a balanced approach to deal with the root cause of the continent’s security and other crises.\nMr Kagame gave the advice at the UBA Africa Conversations 2021 held virtually to commemorate Africa Day on Tuesday in Lagos.\nHe said, “We did not have to ask the question as to what African leaders are doing to stop the crisis going on across the continent.\n“The continued emergence and spread of this crisis require resources and a mindset to pursue peace, also put in place good politics.\nWe cannot benefit until countries work together in peace, with security in place and stability,” explained the Rwandan president."
  },
  {
    "headline": "Nigerians Don’t Need Bank Accounts — EFCC",
    "summarized_story": "Amid the growing number of bank frauds and insider crimes in the banking sector, the Economic and Financial Crimes Commission says it is not mandatory for Nigerians to have bank accounts.\nThe EFCC also opposed the concept of opening bank accounts using “mere phone numbers,” claiming that approximately 40% of Americans lack bank accounts.\nAs a result, having a bank account is not a requirement for anyone in Nigeria,” said Bawa Usman, the EFCC’s zonal head in Sokoto.\nThe meeting was called by the EFCC to improve the partnership and cooperation between the EFCC and banks in the fight against fraud.\nMr Usman went on to say that banks often stymied the EFCC’s investigations by failing to respond to its letters."
  },
  {
    "headline": "Revealed! How Manchester United’s ‘trophyless’ seasons turned Samuel Chukwueze’s Villarreal to Europa League Champions",
    "summarized_story": "David de Gea failed at the end of a marathon penalty shootout as Villarreal dashed Manchester United’s hopes of Europa League glory in Gdansk.\nIt gave Villarreal a first major trophy in their history and saw former Arsenal boss Unai Emery lift the Europa League for an unprecedented fourth time.\nUnited simply did not do enough, despite the massive gulf in transfer fees and salaries between the two clubs.\nAny goal would have been ruled offside but Rashford was not to know that as his scuffed effort rolled wide.\nBut Maguire was on the pitch when United conceded a very similar kind of goal against Everton in February."
  },
  {
    "headline": "NGF: Legislature, Judiciary autonomy doesn’t require Executive Order 10",
    "summarized_story": "The Nigeria Governors’ Forum (NGF) Wednesday said the Executive Order 10 issued 2020 by President Muhammadu Buhari to guarantee financial autonomy of state legislature and judiciary was needless.\n“The concept of judicial autonomy has its foundations in the time tested doctrine of Separation of Powers.\nThat was the basis of the position that we took on the Executive Order 10.\n“The Executive Order 10 ostensibly intended to support the implementation of judicial financial autonomy, was completely unnecessary and ill advised.\nSpeaking at the event, Justice Daramola said judicial autonomy was essential ingredients for democratic consolidation."
  },
  {
    "headline": "Breaking: El-Rufai sacks deputy Chief of Staff, 18 others",
    "summarized_story": "Kaduna state Governor Nasir El-Rufai has sacked at least 19 political appointees.\nA statement from the state government on Wednesday, said affected officials include two Special Advisers, a deputy Chief of Staff and several special assistants.\nAccording to the statement, the governor said the 19 disengaged staff were the first phase of public servants who will depart the public service, in continuation of rightsizing the workforce.\nShare this:TweetPrintTelegramWhatsApp"
  },
  {
    "headline": "Akpabio appeals to protesting Ijaw youths to suspend action -NigPilot",
    "summarized_story": "Minister of Niger Delta Affairs, Sen. Godswill Akpabio, has urged protesting youths in the Niger Delta region to suspend their action and embrace sustainable peace.\nAkpabio remarked that the Niger Delta, which has been one of the most peaceful regions in the country, should not allow itself to be plunged into crisis, promising that the issues tabled by the youths from the region will be addressed.\nHe said a board for the Niger Delta Development Commission, NDDC, will be constituted after the forensic audit ordered by President Muhammadu Buhari.\nBut he regretted that the exercise was extended by three months due to the difficult nature of the job.\nEkerefa noted that the Igbifa was on his way to Abuja to lead the council to the discussion with the Minister of Niger Delta when the unfortunate incident took place."
  },
  {
    "headline": "COVID-19: NILDS tasks FG on health emergencies’ preparedness -NigPilot",
    "summarized_story": "The book, according to the Director-General of NILDS, Professor Abubakar Sulaiman, is one of the most multi-disciplinarian document on a global issue.\n“Health emergency is a constant element of human nature, requiring emergency preparedness, which the book is all about,” he said.\nReviewer of the book and the Resident Electoral Commissioner, REC of the Independent National Electoral Commission, INEC, Professor Sam Egwu, said the book is not primarily about COVID-19 but health emergencies generally and the required state of preparedness.\nAccording to him, pandemics and emergencies are political issues to be addressed by elected political leaders through decisive policy measures and parliamentary oversights.\n“The issue of elites is also very important as far as implementation of such policy measures are concerned."
  },
  {
    "headline": "Group urge FG to consider oral interview in selecting Permanent Secretaries",
    "summarized_story": "Civil Society Organization under the aegis of New Era for Sustainable Leadership and Accountability Initiative, NESLAI , has called on the Federal Government to consider conducting oral interviews/interactive sessions for the selection and appointment of Permanent Secretaries across Nigeria’s Civil Service.\n“We are of the opinion that it is time for us to be part of the leadership selection process in Nigeria.\nWe want to advice the government that the appointment and selection of Permanent Secretaries, should be based on competence, and not just mere elementary examination.\nThe spokesman of the group, Muhammed Basah, further explained that subjecting these appointees to elementary examinations, was ridicule to the Civil Service.\n“It is wrong and it ridicules the entire Civil Service, because these are supposed to be the best of the best, who are going to take Nigeria forward,” Basah said."
  },
  {
    "headline": "UBEC to build 17 additional smart schools in states -NigPilot",
    "summarized_story": "Universal Basic Education Commission , UBEC, has said it will soon commence the construction of 17 additional smart schools in states that are yet to benefit from the intervention.\nBobboyi, who gave a breakdown of the cost of constructing the schools, said each of the 7 smart schools located in the six geopolitical zones was constructed at approximately N600 million while N350 million each would be spent on constructing model smart schools in each state of the federation.\nThe UBEC boss disclosed that twenty of the smart schools were already completed, while construction work on the remaining 17 will commence in the next one month.\nBobboyi said UBEC was collaborating with state governments to make the model schools a paradigm that states can replicate, adding however that the carrying capacity of the schools will not be high.\nAbubakar Sa’ad, said the smart schools initiative, which was started by the leadership of Bobboyi is aimed at creating a conducive learning environment for the children."
  },
  {
    "headline": "UPDATED: Over 100 Missing As Boat Capsizes In Kebbi",
    "summarized_story": "Over a hundred people have been reported missing after a boat capsized at Corner Libata in Ingaski Local Government Area of Kebbi State.\nAbout 180 persons were said to have been aboard the boat which capsized 30 minutes after taking off from Loko Mina in Niger State.\nThe Victims, most of whom are traders were said to be heading to a market in Kebbi State when the accident took place.\nREAD ALSO: Buhari Mourns Victims Of Boat MishapAuthorities say search and rescue operations are ongoing.\nBetween 2019 and 2020, at least 50 people lost their lives on the Malale River following incidents of boat mishaps."
  },
  {
    "headline": "Delta State Govt Counters Accountant General, Denies Receiving £4.2m Ibori Loot",
    "summarized_story": "﻿The Delta State Government has denied receiving £4.2 million looted by its former governor, James Ibori.\nBut the truth is that the money has not hit the Delta State government’s account.\nHe assured that the Delta State government will ensure that the funds are judiciously utilised to improve infrastructure across the state, once received.\nThe loot – £4.2 million – was seized from the associates of convicted former Governor of Delta State, Ibori by the United Kingdom and recently returned to Nigeria.\nWe pay them their money.”ContradictionThe Accountant General’s response contradicts the earlier position of the Federal government on the recovered loot."
  },
  {
    "headline": "Why Libya’s Stability Matters To Us – Buhari",
    "summarized_story": "President Muhammadu Buhari says Nigeria is concerned about Libya’s stability because issues affecting the North African nation greatly impact the Lake Chad Basin, which in turn affects Nigeria.\nThe stability or instability of Libya will directly affect us.”Pleased to host the Chairman of the Presidential Council of Libya, HE Mohammed Younis Menfi, today.\nThe stability or instability of Libya directly affects us.\nREAD ALSO: Buhari Meets With Trump, Blames Killings On Libyan CrisisThe Libyan leader who said his country is making progress in the fight against insecurity informed President Buhari that Libya “now have one government, active on the ground”.\nREAD ALSO: Libya’s Instability Affects All Of Us In Sahel Region – BuhariA Region Facing ‘Severe Challenges’President Buhari had repeatedly linked the renewed crime wave in Nigeria to instability in Libya."
  },
  {
    "headline": "National Security Summit: Lawan, Gbajabiamila Identify Challenges, Seek Solutions",
    "summarized_story": "The National Security Summit commenced on Wednesday with leaders of the National Assembly seeking urgent solutions to insecurity confronting the nation.\nSpeaking at the summit which was held at the National Intelligence Agency (NIA), Abuja, Senate President Ahmed Lawan said the procurement processes by security agencies must be reviewed by the National Assembly.\nSenator Lawan said the security architecture of the country must be reviewed, for better results.\nThe lawmaker noted that there is no better investment than investing in security right now, maintaining that the non-functioning local government system and traditional system, are major challenges for the country.\nThe SGF believes Nigeria will overcome the security challenges and urged Nigerians to commit to a common endeavor in the national interest."
  },
  {
    "headline": "Villarreal Beat Manchester United To Win Europa League",
    "summarized_story": "Villarreal stunned Manchester United after a marathon penalty shoot-out, with goalkeeper David de Gea missing the last spot-kick, in the Europa League final to lift their first-ever major trophy on Wednesday in Gdansk.\nIt finished 1-1 after 120 minutes as Gerard Moreno put the unfancied Spaniards ahead in the 29th minute before Edinson Cavani levelled early in the second half.\nBut Villarreal won a remarkable shoot-out 11-10, leaving Ole Gunnar Solskjaer still waiting for his first trophy as United manager."
  },
  {
    "headline": "Wara Boat Mishap: Niger State Governor describes accident as unfortunate",
    "summarized_story": "Niger State Governor Abubakar Sani Bello has described as unfortunate a boat mishap with about 180 passengers that occurred at Corner Libata in Ingaski local government area of Kebbi State about 30 minutes after taking off from Loko Mina in Niger State.\nGovernor Sani Bello in a condolence message expressed concern over the tragedy,explaining that the situation is worrisome and pathetic.\nMay God forgive those who died in the mishap, and heal those injured and traumatisedAdvertisementEarlier, it was reported that a boat carrying about 180 Persangers capsized at Corner Libata in Kebbi State after it took off from Loko Mina in Niger State.\nThe Victims most of whom are Traders were said to be heading to a Market in Kebbi State from loko mina in Niger state.\nSearch and rescue operation is ongoing even as report has it that 20 people have been rescued and 4 bodies recovered so far."
  },
  {
    "headline": "Police arrest suspect, recover stolen vehicle in Zamfara",
    "summarized_story": "Police at a stop and search operations at Zamfara /Katsina boarder known as YANKARA, intercepted a stolen carThe suspect one Abdullahi Aliyu of Anguwan Yarima area Gusau was intercepted with a Honda Civic, Ash colour with Registration Number EKY 66 GB.\nIn the course of interrogation, the suspect confessed to have stolen the vehicle at the Yariman Bakura Specialist Hospital, Gusau.\nAdvertisementThe Vehicle was confirmed to be the property of one Zuwaira Aliyu of Samaru area, GusauThe suspect is Undergoing interrogation at the Zamfara state criminal investigation Department of the police commandPolice in Zamfara says efforts are ongoing to arrest other members of his gang, adding that the suspects when arrested will be charge to court for prosecution to serve as deterant to others."
  },
  {
    "headline": "Yellow Submarines Sink Red Devils: Villarreal Win Europa Final with Shootout Win over Man United",
    "summarized_story": "Villarreal beat Manchester United in an epic penalty shootout in the Europa League final in Poland on Wednesday night after the match finished 1-1 in regular and extra time.\nUnited were the better side throughout the second half, but neither side was able to find a winner in regulation and the match went to extra time.\nThe pace of the game continued into extra time and with no goals scored it was on to a penalty shootout to decide the Europa League winner.\nThe teams went back and forth in the shootout, with Villarreal keeper Rulli scoring his penalty attempt before De Gea missed his after all 10 outfield players from both teams had converted their spot kicks in the 11-10 shootout final.\nThe result means Man United have not won a title of any kind in four seasons, since last lifting the Europa League trophy in the 2016-17 campaign under Jose Mourinho."
  },
  {
    "headline": "Antonio Conte Leaves Inter Milan After Clinching Serie A Title",
    "summarized_story": "Antonio Conte has left his position as Inter Milan coach, it was announced on Wednesday.\nThe move comes three weeks after Conte led the club to the Serie A title.\n“FC Internazionale Milano can confirm that an agreement has been reached with Antonio Conte for the termination of his contract by mutual consent.\nThe club would like to thank Antonio for the extraordinary work that he has done, culminating in Inter’s 19th top-flight title.\nAntonio Conte will forever remain a part of our Club’s history,” the club said in a statement."
  },
  {
    "headline": "Young Nigerians Should Be Empowered to Get Right Skills: Jobberman CEO Rosiji",
    "summarized_story": "Rolake Rosiji is the Chief Executive Officer of Jobberman and notes that helping young Nigerians get employment should first commence at the skills level.\nIn this conversation with ARISE News, Ms Rosiji says the young citizens need to be empowered to get the right skills and confidence to take on their first employment.\nThis she says is what her organisation, Jobberman – Nigeria’s first job portal and career platform – has been doing."
  },
  {
    "headline": "West African Coup Mediators Meet Mali’s Military Leaders",
    "summarized_story": "Visiting West African mediators have met Mali’s senior military figures who carried out the country’s second coup in less than a year.\nOn Tuesday a military colonel – who was the vice-president in the transitional government – accused President Bah Ndaw and Prime Minister Moctar Ouane of sabotaging the transition.\nThe two men have been held at a military camp since Monday with analysts stating that the Ecowas team has an extremely difficult mission.\nLed by the former Nigerian President Goodluck Jonathan, it hopes to get the ousted president and prime minister released from military detention as soon as possible.\nBut beyond that, it is not clear what it can achieve now that Colonel Assimi Goïta is running the country and looks set to name a new prime minister."
  },
  {
    "headline": "South Africa’s Ex-president Zuma Pleads Not Guilty For Multi-billion Dollar Arms Deal",
    "summarized_story": "A former South African president, Jacob Zuma has pleaded not guilty in a corruption trial involving a $5 billion arms deal from the 1990s.\nMr Zuma blames political enemies in the governing African National Congress (ANC) party for his legal troubles.\nThe arms deal involved buying new fighter jets, helicopters, submarines and warships.\nMr Zuma was South Africa’s president from 2009 until 2018 when he was forced to resign after a vote of no confidence.\nOn Wednesday crowds gathered outside the courthouse in Pietermaritzburg city in KwaZulu-Natal province to cheer on Mr Zuma, who still enjoys some popular support."
  }
]