[
  {
    "headline": "Again, bandits attack palace, kidnap Plateau monarch",
    "summarized_story": "Bandits numbering over 20, have again, reportedly kidnapped a traditional ruler in Plateau State, His Royal Highness, Aminu Derwan, after attacking his palace in Panyam, Mangu Local Government Area of the state.\nIt was learnt that the gunmen took away Derwan, the district head of Panyam, after scaring residents with gunshots in the early hours of Monday.\nA resident of Panyam community, Moses Garuba, confirmed the abduction of the monarch to The PUNCH in Jos, on Monday.\nGaruba said, “It was last night around midnight that the bandits, who were more than 20 and heavily armed, surrounded the district head’s palace in Panyam.\nThe two personalities were, however, released a few days later, after a ransom was allegedly paid to the abductors."
  },
  {
    "headline": "Strike: We are waiting for govt’s reply to our presentation – ASUU",
    "summarized_story": "Speaking in a telephone chat with our correspondent, the National President of ASUU, Prof. Emmanuel Osodeke, said his union had done its best in the circumstance.\n“We have made our presentation to the committee and there is nothing more to add,” he said.\nWhen contacted, Prof. Briggs said his committee had met with ASUU and had done its assignment.\n“We have met and ASUU have made their presentation.\nRecall that ASUU went on a four-week warning strike on February 14 this year and has extended the strike twice."
  },
  {
    "headline": "ActionAid calls for close watch on outgoing govs’ borrowings",
    "summarized_story": "By Gabriel Ewepu – AbujaThe ActionAid Nigeria, AAN, has called for close watch on outgoing governors’ borrowings who are almost completing their second term in 2023.\nThe alarm was raised Deputy Chairman, Board of AAN, Mac Imoni Amarere, in Abuja, while the General Assembly of AAN addressed journalists on state of the nation.\nShe lamented that the current debt profile mortgages the future of born and unborn Nigerians, which is unacceptable.\nFrom 1999 when Nigeria transitioned to democracy, to 2022, university teachers have gone on nationwide strikes 16 times, covering 51 months.\n“Rising public debt, unemployment, inflation, and high cost of living require the immediate embrace of fiscal federalism in absolute terms."
  },
  {
    "headline": "2023: Only Ibrahim Dauda can square up with Peter Obi — APC group",
    "summarized_story": "By Fortune Eromosele — AbujaAs the search for a running mate for the All Progressives Congress Presidential candidate, Asiwaju Bola Ahmed Tinubu, heightens, a group, the APC Integrity Group, has advised the leadership of the party to pick Ibrahim Bello Dauda as a candidate for Tinubu, saying that only him (Dauda) can square up with Labour Party’s presidential candidate, Peter Obi.\n“When one listens to the Labour Party candidate, Peter Obi he has a message that appeal to the youths and other Nigerians.\n“The APC Integrity Group, therefore believes that a party man like Dr. Dauda can rise to such responsibilities.\nThe Integrity Group submitted that another legacy that President Buhari should bequeath to Nigerians is a strong and erudite leadership that would take the country to the next level.\nThe APC Integrity Group is made of members of the Congress for Progressives Change, CPC, Action Congress, AC, All Nigerian Peoples Party, ANPP and a faction of the All Progressives Grand Alliance, APGA."
  },
  {
    "headline": "Court steps down Osinachi husband’s case due to multiple counsel",
    "summarized_story": "He further stated that he was equally served additional proof of evidence in the court just before the court started the day’s proceedings.\nI.A Aliyu on his part informed the court that he was briefed by the defendant on June 18 to take over the case.\nThe court therefore stepped down the case to 11am in order for counsel to align themselves and come proper before it.\nNews Agency of Nigeria (NAN), reports that in Monday’s proceeding, family members of the deceased singer, Osinachi were in court.\nHe was therefore remanded pending the hearing and determination of the23-count charge bordering on domestic violence and homicide instituted against him."
  },
  {
    "headline": "Ruling on Hijab strengthens our belief in judiciary — Onike of Nasfat",
    "summarized_story": "Ishola BalogunThe Chief Missioner of Nasrul-Lahi-l-Fatih Society (NASFAT) Imam Abdul-Azeez Onike has congratulated the entire Muslim women and other ladies of faith on the well-deserved victory at the Nigerian Supreme Court.\nOnike said the rulling affirms their right to dress in accordance with their religious dictate, which commands them to maintain modesty and privacy from unrelated males by wearing the hijab.\nReacting to the judgement, Sheikh Onike said: “the Islamic dress for Muslim women is a symbol of personal space/ownership, privatisation of physical charms and bodily attraction.\n“The decision to wear hijab is a personal statement echoing that a woman’s body is her own private business.\nIt has also reinforced the Muslims’ belief that, the court remains the bastion of hope for Nigerian Muslims."
  },
  {
    "headline": "Kano Assembly elects new deputy speaker",
    "summarized_story": "The Kano State House of Assembly has elected Alhaji Kabiru Dashi (APC-Kiru) as its deputy speaker following the resignation of Malam Zubairu Massu who defected to the New Nigeria Peoples Party (NNPP).\nNAN reports that Dashi’s election followed his nomination by Mr Sale Marke (APC-Dawakin-Tofa) at plenary on Monday.\nThe nomination was seconded by Mr Nuhu Achika (APC-Wudil), after which the lawmakers affirmed his election as the new deputy speaker.\nDashi was immediately sworn in by the director, house legal matters, Malam Nasidi Aliyu at a plenary presided over by Speaker Hamisu Chidari.\nDashi in his acceptance speech appreciated the house for finding him worthy of the new appointment."
  },
  {
    "headline": "Ekiti election: UK speaks on conduct of governorship poll, advises INEC",
    "summarized_story": "The United Kingdom has congratulated the people of Ekiti State for their peaceful and democratic participation in the just concluded governorship election in the state.\nThe UK advised the Independent National Electoral Commission (INEC) to reflect on other potential improvements to the electoral process ahead of general elections in 2023.\n”We urge any party or individual who is dissatisfied with the process to seek redress in a peaceful manner and through the appropriate legal channels.\n”As Nigeria moves closer to the 2023 general elections, we encourage people to register and collect their PVCs and to participate actively in the political process.\nThe UK will continue to assist INC and our partners in their aspiration to support peaceful, credible and inclusiveelections in Nigeria.,” it said."
  },
  {
    "headline": "Ekiti election: Some youths are looters in training – Apostle Suleman",
    "summarized_story": "Apostle Johnson Suleman of Omega Fire Ministry has said some youths are looters in training.\nSuleman said this while reacting to a viral video of some youths in Ekiti celebrating after they sold their votes during the state governorship election on Saturday.\nRecall that there were several reports of massive vote-buying and selling during the just concluded governorship election in Ekiti State.\nHe wrote: “So in the just concluded Ekiti State election, some youths were selling their votes?.\n”I have always said it, not all youths are leaders of tomorrow, some are looters in training.”"
  },
  {
    "headline": "War: Zelensky reveals what Ukraine, other countries should expect from Russia this week",
    "summarized_story": "Ukrainian President Volodymyr Zelensky has said that Ukraine should expect “greater hostile activity” from Russia as the European Union (EU) considers whether the country should be formally considered for candidate status in the wake of Russia’s invasion.\nZelensky, who said this in his nightly address on Sunday, also informed other European countries to expect the same hostile activity from Russia.\n“We should expect greater hostile activity from Russia.\n“And not only against Ukraine, but also against other European countries.”He added, “A week when we will hear the answer from the European Union on the candidate status for Ukraine.\nRussian President, Vladimir Putin, had in February ordered the invasion of Ukraine due to some political differences between both neighbouring nations."
  },
  {
    "headline": "Fuel scarcity: Arewa youths ask Buhari to sack Sylva, Kyari, Farouk",
    "summarized_story": "Following the continued fuel scarcity in parts of the country for some months without end, the Amalgamation of Arewa Youths Groups (AAYG) has called for the sacking of Chief Timipre Sylva, the Minister of State for Petroleum; Mr Mele Kyari, the Group Managing Director of Nigerian National Petroleum Corporation (NNPC) Limited; and Mr Farouk Ahmed, the Managing Director of Nigeria Midstream and Downstream Petroleum Regulatory Authority.\nThe forum described them as saboteurs who have betrayed the trust of President Muhammadu Buhari and quest to leave a legacy of easy access to petroleum products without queues.\nThe statement lamented that till date, nobody has been punished for inflicting pain on Nigerians.\nThe statement regretted, “While Mr Farouk and his boys are sleeping or in active, independent petroleum marketers are selling PMS in most Northern states as high as N250.\nThis is against the National benchmark and highly subsidized rate of N165.”It called on Mr. President to wield the big stick on the trior of Sylva, Kyari and Ahmed for a clear act of sabotage and an attempt to pitch Nigerians against him."
  },
  {
    "headline": "JUST IN: Gunmen abduct traditional ruler in Plateau The Nation Newspaper",
    "summarized_story": "Gunmen in the early hours of Monday abducted District Head of Panyam in Mangu Local Government Area of Plateau HRH Adamu Derwam.\nThe paramount ruler was abducted at his residence in Panyam town by heavily armed gunmen.\nRead Also: Gunmen on rampage shoot five in Imo communityPlateau Police Command spokesperson DSP Alfredo Alabo, confirmed the incident.\nHe said there had been deployment of combined tactical team of Police, Army, vigilante and hunters to the area for rescue of the traditional ruler.\nPanyam is the fifth traditional ruler abducted in Plateau State in the last six months."
  },
  {
    "headline": "Mbaka disowns protests at Adoration ground The Nation Newspaper",
    "summarized_story": "Controversial Catholic priest and Spiritual Director of the Adoration Ministry Enugu, Rev.\nEjike Mbaka has distanced himself from Sunday’s protests by his followers at the Adoration ground.\nThe protest was a reaction to the ban imposed on the Adoration Ministry by Bishop Onaga.\nHe said rather he received in obedience the ban on his Adoration ministry and had since shut the ministry till further notice.\n“Adoration Ministry is ever submissives to the mother Church."
  },
  {
    "headline": "Sanwo-Olu and Tinubu’s emergence as APC presidential flag bearer The Nation Newspaper",
    "summarized_story": "Like a Boy Scout, he was ever ready for the Tinubu Presidential ambition.\nThis rare capacity to inspire and lead people to greatness are the greatest attributes that make Asiwaju Tinubu exceptional.\nSanwo-Olu, who was a leading campaigner for the APC presidential ticket for Tinubu, was in Abeokuta the same day.\nSo, when APC members and Excos members in the Lagos State Cabinet stormed Lagos Airport, it was understandable.\nTrust, Sanwo-Olu will lead from the front as he did in the keenly struggle for the APC Presidential ticket."
  },
  {
    "headline": "No 40% telecom tariff hike now, says NCC The Nation Newspaper",
    "summarized_story": "The Nigerian Communications Commission (NCC) has said the proposal of telecom operators for a 40 per cent end user tariff on services is not realistic this year.\nIn the letter, the telecom companies had said there had been a 40 per cent increase in the cost of doing business.\nIn annexure one section of the letter, the body requested an upward adjustment of the MTR by 40 per cent.\n“For large operators, new interim MTR of N5.46 from N3.90 reflecting 40 per cent increase in the cost of business.\n“For small operators, new interim MTR of N6.58 from N4.70 reflecting 40 per cent increase in the cost of business,” the operators had stated."
  },
  {
    "headline": "FAAN suspends issuance of licences for airport trade zones The Nation Newspaper",
    "summarized_story": "The Federal Airports Authority of Nigeria (FAAN) has suspended the issuance of licences to applicants on the free trade zones at the airports until conflicts in the regulatory framework between it and the Nigeria Export Processing Zones Authority (NEPZA) are resolved.\nThis is as stakeholders have decried the multiple regulations between FAAN and NEPZA, saying it is one of the major factors slowing the growth of free trade zones.\nRabiu Yadudu, who gave the suspension notice to intending free trade zone applicants, said at the Lagos Airport alone, there are two free trade zone operators, while additional two companies have applied.\nHe explained that the five international airports in the country have been designated as free trade zones and warned that if not well-regulated, it might be a big challenge for the country in the future.\nAt the level of implementation, FAAN will tell you it is against its own approval,” he said."
  },
  {
    "headline": "Mbaka condemns protest by Adoration worshippers, denies involvement",
    "summarized_story": "From Geoffrey Anyanwu, EnuguThe Spiritual Director of Adoration Ministry Enugu Nigeria (AMEN) Rev.\nEjike Mbaka has condemned the protest staged at the Adoration ground yesterday by worshippers and his supporters declaring that he has no hands in it.\nCallistus Onaga, insisted that the bishop must go for “closing their worship centre,” by the ban he imposed on the Adoration Ministry.\nBut Mbaka who distanced himself from the protest stressed he was not on any way involved in it.\n“Adoration Ministry is ever submissives to the mother Church."
  },
  {
    "headline": "Kidnappers demand N150m ransom to release Ex-NFF Secretary, others",
    "summarized_story": "From Paul Orude, BauchiKidnappers of a former Secretary of the Nigeria Football Federation, Alhaji Sani Toro are demanding N150million.\nThe former NFF scribe and others were said to have left Abuja on Saturday about 5 pm and were kidnapped about 7pm in Nasarawa State.\nA source said the kidnappers are demanding N150 million as ransom before they are released.\nHe said they are demanding ransom of N50 million for each of themThe State Police Command Public Relations Officer, Ahmed Wakili, confirmed the kidnapped of the victims.\nPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "3 killed, 2 injured as gunmen attack Kaduna Catholic church",
    "summarized_story": "Gunmen, yesterday, attacked worshippers at a Catholic church in Kajuru Local Government Area of Kaduna State, killing three people and injuring two others.\nHe explained that in Rubu village, the bandits attacked worshippers in the Maranatha Baptist Church and St. Moses Catholic Church.\n“Three locals have been confirmed killed in the attacks, and two people were left injured – one of them a man, and a yet-to-be identified woman.\nHe said the Acting Governor also commiserated with the attacked churches, and prayed for the speedy recovery of the injured.\nWhen contacted, the Kaduna Command Police Public Relations Officer, DSP Mohammad Jalige, also confirmed the incident, saying the attack happened yesterday while worshippers were in church."
  },
  {
    "headline": "Ekiti: Buhari, Kalu, Fayemi, others hail Oyebanji over victory",
    "summarized_story": "From Romanus Ugwu, Juliana Taiwo-Obalonye, Abuja, Laide Raheem, Abeokuta and Priscilla Ediare, Ado-EkitiPresident Muhammadu Buhari, Chief Whip of the Senate, Orji Uzor Kalu, Governors of Ekiti State, Kayode Fayemi, Kebbi State, Atiku Bagudu, Adegboyega Oyetola of Osun and others have congratulated Biodun Oyebanji, Ekiti State Governor-elect.\nWhile commending the people of Ekiti for voting the candidate of the APC, Kalu urged Oyebanji to consolidate on the achievements of Governor Fayemi.\n“The victory of the governorship candidate of the All Progressives Congress (APC), Mr Biodun Oyebanji is timely and well deserved.\n•Fayemi, BaguduIn his reaction, Governor Fayemi said APC won because the party has a sellable product in Oyebanji.\nAdamu said Oyebanji has the pedigree, experience and vision to take Ekiti State to the next level of development."
  },
  {
    "headline": "Uneasy calm in PDP as Wike, others weigh options",
    "summarized_story": "From Ndubuisi Orji, AbujaThe dust raised by the nomination of Delta State Governor, Ifeanyi Okowa as vice presidential candidate of the Peoples Democratic Party (PDP) is yet to settle as aggrieved party leaders are weighing their options.\nSigns of dissent became evident when some of the governors, who rooted for Wike boycotted the unveiling of Okowa in Abuja.\nWhat is paramount to every member of the PDP is not personal interest, but national issues.\nWe recognise that when people feel aggrieved, feel offended, we have to reach out to them,” said the source.\nNevertheless, Daily Sun gathered that the dismal performance of the PDP in the just concluded Ekiti State governorship election is attributable to the indifference of some of the governors to the election."
  },
  {
    "headline": "Buhari to Oyebanji: You Must Be Magnanimous in Victory",
    "summarized_story": "Buhari, however, advised Oyebanji to be magnanimous in victory, in a release yesterday by the president’s media adviser, Femi Adesina.\nTinubu: Ekiti Victory Will Motivate APC for More in 2023Presidential candidate of APC, Senator Bola Tinubu, said the party’s victory in the Ekiti State governorship election would spur it on to more victories in the coming elections.\nIn a statement yesterday by his media office, Tinubu congratulated Oyebanji and the party for winning the governorship election.\nHe also commended the APC governors and members of the NWC under Adamu’s leadership for recording their first major electoral victory.\nThis victory is for the people of Ekiti State and all lovers of democracy across the country."
  },
  {
    "headline": "14 Banks Raked in N47trn as Deposits, Disbursed N25trn Loans in 2021",
    "summarized_story": "The banks are Access Bank, Fidelity Bank, FCMB Group, FBN Holdings, GTCO, Union Bank, United Bank for Africa (UBA), Zenith Bank, Ecobank Group, Stanbic IBTC, Sterling Bank, Unity Bank, Wema Bank and Jaiz Bank.\nHowever, the financial results showed that the six largest banks – Access, Zenith, First Bank, GTCO, UBA, Ecobank – with respect to deposits, assets, loans and profitability, maintained their industry dominance.\nSimilarly, in terms of customers’ deposits, Zenith Bank posted N6.472 trillion; Access Bank –N6.955 trillion; FBN Holdings – N5.849 trillion; GTCO – N4.130 trillion; UBA – N6.309 trillion and Ecobank – N8.360 trillion.\nAlso, whereas Access Bank’s total assets in the review period was N11.732 trillion; Ecobank – N11.689 trillion; Zenith Bank – N9.448 trillion; FBN Holdings – N8.932 trillion; UBA – N8.541 trillion and GTCO – N5.436 trillion.\nFintechs have continued to encroach on commercial banks’ businesses, thereby threatening the operations and deposit mobilisation by the banks."
  },
  {
    "headline": "Terrorists Attack Two Churches in Kaduna Community, Kill Three, Abduct 44",
    "summarized_story": "By John Shiklam in KadunaFour people have been killed while 44 others were abducted by terrorists in an attack on two churches in Rubu community, Kajuru Local Government Area of Kaduna state.\nSources said the terrorists attacked worshipers at St. Moses Catholic Church and Maranatha Baptist Church in the community on Sunday during worship service.\nThree people were said to have been killed in the attack on Catholic Church while 30 people were abducted at Maranatha Babtist Church.\nThose who sustained injuries were said to have been taken to the St. Gerald Catholic Hospital, Kaduna, for treatment.\nIn a statement on Sunday, the Commissioner for Internal Security and Home Affairs, Samuel Aruwan, said the bandits attacked three communities, looted shops and carted away some valuables from the villages."
  },
  {
    "headline": "In Landslide Victory, APC Wins Ekiti Governorship Election as Vote-buying Mars Poll",
    "summarized_story": "The governorship election, which was held under a calm and peaceful atmosphere, also recorded a large turnout of voters.\nThe winner of the governorship election, Oyebanji, is a former Secretary to the State Government (SSG), to Governor Kayode Fayemi.\nEFCC Arrests Vote Buyers, Election Calm, PeacefulFollowing the widespread vote-buying, which characterised the governorship election, the operatives of the Economic and Financial Crimes Commission (EFCC) arrested persons suspected to be engaged in vote-buying in the poll.\nSituation Room noted that the election was generally peaceful, with voters civilly conducting themselves in most of the polling units.\nMeanwhile, the Socio-Economic Rights and Accountability Project (SERAP) has asked INEC to prosecute all those involved in vote-buying in the governorship election."
  },
  {
    "headline": "Breaking: APC’s Oyebanji Wins Ekiti Guber Election",
    "summarized_story": "All Progressives Congress Governorship candidate, Biodun Abayomi Oyebanji, has won the Ekiti Governorship Election.\nHe polled 187,057 votes.Oyebanji won in 14 of the 16 local government areas in the election conducted on Saturday.\nHis closest rival, Segun Adebayo Oni of the Social Democratic Party, polled 82,211 votes.\nOni won in Moba local government area.Mr.\nBisi Kolawole of the Peoples Democratic Party scored 67,457 votes to emerge third in the race."
  },
  {
    "headline": "How FCMB, Principal Officers Of Nigeria Police Academy Conspired To Withhold My Salary, Illegally Deducted My Money – Lecturer Cries Out",
    "summarized_story": "He fulfilled the restructuring requirements on August 4, 2020, but he did not have access to his bank account and the money in the account.\n“Till date, I do not have access to my bank account….\nHowever, when SaharaReporters contacted Mr. Jimoh of the FCMB about Dr. Igbaekemen’s complaints, he said that the matter is complicated.\n“He had a loan and the loan was bad because it was illegally suspended by the POLAC and it was reinstated.\nMeanwhile, when asked if Dr. Igbaekemen had access to his account, Jimoh answered in affirmation after running a brief check on the account."
  },
  {
    "headline": "How FCMB, Principal Officers Of Nigeria Police Academy Conspired To Withhold My Salary, Illegally Deducted My Money – Lecturer Cries Out",
    "summarized_story": "He fulfilled the restructuring requirements on August 4, 2020, but he did not have access to his bank account and the money in the account.\n“Till date, I do not have access to my bank account….\nHowever, when SaharaReporters contacted Mr. Jimoh of the FCMB about Dr. Igbaekemen’s complaints, he said that the matter is complicated.\n“He had a loan and the loan was bad because it was illegally suspended by the POLAC and it was reinstated.\nMeanwhile, when asked if Dr. Igbaekemen had access to his account, Jimoh answered in affirmation after running a brief check on the account."
  },
  {
    "headline": "EXCLUSIVE: How Lopsided Promotion Of Officers By Nigeria’s Anti-Narcotics Agency, NDLEA Favours Candidates Of Political Office Holders, Denies Others For About 20 Years",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA), through its harmonisation exercise, has allegedly denied some officers promotion for about 20 years, while some of their colleagues recruited much later after have been promoted up to two times.\nThe sources said that their promotions have been cumulatively stagnated for about 10 to 20 years which translates to a loss of three to six ranks.\nAccording to him, all CNAs with earlier or 2004 effective dates were made to go through conversion course 1/2008 with no cognizance of the fact that some older NA courses 7/94 and 8/96 were on re-sit.\nThe imposition of the conversion course on these unprepared sets of officers made them unsuccessful in conversion course 1, it was learnt.\nThough the effective dates of promotion of successful candidates of CNA conversion course 1 were backdated appropriately, that of CNA course 2/2013 converted officers were not backdated,” the source continued."
  },
  {
    "headline": "EXCLUSIVE: How Lopsided Promotion Of Officers By Nigeria’s Anti-Narcotics Agency, NDLEA Favours Candidates Of Political Office Holders, Denies Others For About 20 Years",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA), through its harmonisation exercise, has allegedly denied some officers promotion for about 20 years, while some of their colleagues recruited much later after have been promoted up to two times.\nThe sources said that their promotions have been cumulatively stagnated for about 10 to 20 years which translates to a loss of three to six ranks.\nAccording to him, all CNAs with earlier or 2004 effective dates were made to go through conversion course 1/2008 with no cognizance of the fact that some older NA courses 7/94 and 8/96 were on re-sit.\nThe imposition of the conversion course on these unprepared sets of officers made them unsuccessful in conversion course 1, it was learnt.\nThough the effective dates of promotion of successful candidates of CNA conversion course 1 were backdated appropriately, that of CNA course 2/2013 converted officers were not backdated,” the source continued."
  },
  {
    "headline": "EXCLUSIVE: How Lopsided Promotion Of Officers By Nigeria’s Anti-Narcotics Agency, NDLEA Favours Candidates Of Political Office Holders, Denies Others For About 20 Years",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA), through its harmonisation exercise, has allegedly denied some officers promotion for about 20 years, while some of their colleagues recruited much later after have been promoted up to two times.\nThe sources said that their promotions have been cumulatively stagnated for about 10 to 20 years which translates to a loss of three to six ranks.\nAccording to him, all CNAs with earlier or 2004 effective dates were made to go through conversion course 1/2008 with no cognizance of the fact that some older NA courses 7/94 and 8/96 were on re-sit.\nThe imposition of the conversion course on these unprepared sets of officers made them unsuccessful in conversion course 1, it was learnt.\nThough the effective dates of promotion of successful candidates of CNA conversion course 1 were backdated appropriately, that of CNA course 2/2013 converted officers were not backdated,” the source continued."
  },
  {
    "headline": "Orubebe resigns from PDP, says party not ready to regain power in 2023",
    "summarized_story": "Godsday Orubebe, former minister of Niger Delta Affairs, has resigned his membership of the Peoples Democratic Party (PDP).\nOrubebe communicated his resignation in a letter addressed to Iyorchia Ayu, national chairman of the PDP.\nThe former minister said his resignation is effective immediately, and that he has notified his ward chairman in Burutu LGA of Delta state.\nAdvertisement“However, the present situation in the party does not inspire confidence that the party is ready to regain power in 2023.\nAdvertisementHe had accused Attahiru Jega, the then chairman of the Independent National Electoral Commission (INEC), of bias against the PDP."
  },
  {
    "headline": "Orubebe resigns from PDP, says party not ready to regain power in 2023",
    "summarized_story": "Godsday Orubebe, former minister of Niger Delta Affairs, has resigned his membership of the Peoples Democratic Party (PDP).\nOrubebe communicated his resignation in a letter addressed to Iyorchia Ayu, national chairman of the PDP.\nThe former minister said his resignation is effective immediately, and that he has notified his ward chairman in Burutu LGA of Delta state.\nAdvertisement“However, the present situation in the party does not inspire confidence that the party is ready to regain power in 2023.\nAdvertisementHe had accused Attahiru Jega, the then chairman of the Independent National Electoral Commission (INEC), of bias against the PDP."
  },
  {
    "headline": "INVESTIGATION: How illegal mining fuels poverty, river pollution, sacred grove desecration in Osun",
    "summarized_story": "Google Earth revealed that many rivers are tributaries of the Osun river.\nAdvertisementA sacred grove desecratedThe Oṣun river is named after one of the most popular and venerated deities in Yorubaland.\nAt the meeting, the stakeholders directed that the public should desist from the consumption of the Osun river water until the pollution is resolved.\nConfirmatory tests should be carried out by the Osun state government, through Osun State University, while NESREA carries out another test through the Institute of Ecology and Environmental Studies, OAU.\n“The Osun state government reacted by constituting the mineral resources and environmental management committee (MIREMCO) to address the Osun river pollution and all other issues resulting from mining activities in Osun state."
  },
  {
    "headline": "INVESTIGATION: How illegal mining fuels poverty, river pollution, sacred grove desecration in Osun",
    "summarized_story": "Google Earth revealed that many rivers are tributaries of the Osun river.\nAdvertisementA sacred grove desecratedThe Oṣun river is named after one of the most popular and venerated deities in Yorubaland.\nAt the meeting, the stakeholders directed that the public should desist from the consumption of the Osun river water until the pollution is resolved.\nConfirmatory tests should be carried out by the Osun state government, through Osun State University, while NESREA carries out another test through the Institute of Ecology and Environmental Studies, OAU.\n“The Osun state government reacted by constituting the mineral resources and environmental management committee (MIREMCO) to address the Osun river pollution and all other issues resulting from mining activities in Osun state."
  },
  {
    "headline": "PHOTOS: Tinubu's convoy attacked by hoodlums in Lagos",
    "summarized_story": "Hoodlums on Sunday reportedly attacked a bus carrying journalists in the convoy of Bola Tinubu, APC presidential candidate.\nThe attack was said to have happened while Tinubu’s convoy was leaving the palace of Rilwan Akiolu, Oba of Lagos.\nTinubu was said to have visted the Oba of Lagos shortly after arriving in the city from Abuja.\nThe hoodlums were said to have wielded cutlasses and sticks, and threw stones at the convoy.\nHis visit to Lagos which has been dubbed “homecoming” by his supporters is said to be his first since clinching the ticket."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Abena, a voice assistant wants to preserve African languages",
    "summarized_story": "But these voice technologies support only Western languages and are unavailable in African languages because of the low-revenue opportunities in African markets.\n“Working on voice tech for African languages has been a completely different ball game.\nHe spent 6 years building Abena AI, and released it in the Google Play Store this April as a Mobobi product.\nAbena AI works with smart lights, smart plugs, and other smart home devices.\n“The feedback from a few people who tried Abena AI out before it was released kept us going."
  },
  {
    "headline": "Meet 11 female founders making strides in Africa",
    "summarized_story": "This article aims to recognize some African female founders making great strides across various industries and sectors on the continent.\nMeet 11 African female founders we are rooting:Sethebe Manake – Botswana 🇧🇼Image source: Sethebe ManakeMy name is Sethebe Manake (she/her) and I am a real-estate expert turned tech entrepreneur who enjoys dancing and game nights.\nLinkedIn: Neema IyerTao Laine Boyle – South Africa 🇿🇦Image source: Tao BoyleMy name is Tao Boyle (she/her).\nThato Schermer – South Africa 🇿🇦Image source: Thato SchermerMy Name is Thato Schermer (she/her) and I’m the Founder of Zoie Health Technologies.\nI graduated from the University of Cape Town (South Africa) and the University of California (Los Angeles) with a triple major in computer science, genetics, and biochemistry."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Businesses abandon power grid for alternative sources",
    "summarized_story": "From manufacturing firms to small service companies, businesses are abandoning the national grid to provide their own power, following abysmal levels of power supply and the rising cost of diesel, BusinessDay gathered from conversations with energy companies.\nBusinesses are signing contracts with embedded power companies, and smaller ones are turning to off-grid companies to augment supply from the creaking grid as diesel gradually morphs into black gold.\nNwani said his company had had to sign about 10 power supply contracts with different businesses within the last three months and was still taking orders and answering inquiries from prospective customers.\nSmaller businesses though are making the switch to petrol generators, decommissioning their diesel generators on account of diesel prices.\nSimilarly, Bonachristus Izuchukwu, who runs Bonachristub International Limited, said there is a surge in demand for petrol generators, especially from hotels and filling stations."
  },
  {
    "headline": "How to lead in a multicultural organisation",
    "summarized_story": "However, a formal leader from another culture may not be accepted in a multicultural situation because of cultural differences, particularly in expected leadership methods.\nA leader who can meet followers’ expectations of a good leader can develop better trust and quality relationships.\nSome followers need more leading along each of these dimensions than others.\nTrying to mimic the behaviours of a leader belonging to the followers’ culture may lead to unintended consequences.\nIn multicultural situations, it is probably best not to model your leadership behaviour after a leader in the follower’s culture."
  },
  {
    "headline": "Impeachment plot against Oyo Dep Gov will fail, says Folarin",
    "summarized_story": "The 2023 governorship candidate of the All Progressives Congress (APC) and lawmaker representing Oyo central senatorial district, Senator Teslim Folarin has said that the impeachment plot of deputy governor Rauf Olaniyan by Governor Seyi Makinde and his lawmakers would fail because two-third members required to carry out the process cannot be achieved.\nFolarin, in a statement issued on Saturday through his special adviser on media and publicity, YSO Olaniyi warned that the impeachment agenda will be resisted by conscientious lawmakers and the people of Oyo State that gave Olaniyan a 4-year mandate as deputy governor.\nAccording to Folarin, “I wish to reiterate that His Excellency, Rauf Olaniyan’s position as the validly elected Deputy Governor of Oyo state is secured and constitutionally backed; his tenure ends on 29th of May 2023.\n“It is visible to the blind and audible to the deaf that the charges brought against the deputy governor are frivolous.\nTo this end, I strongly advise the induced lawmakers to refrain from taking any action that could throw Oyo State into a catastrophic political crisis and civil unrest,” the statement concluded."
  },
  {
    "headline": "Edo PDP: Obaseki sues for peace, appoints Igbinedion to chair Peace Committee – Nigerian Observer",
    "summarized_story": "The governor disclosed this while meeting with over 135 PDP members drawn from the National Executive Committee, State Executive Committee, and Zonal Committee of the party, at the party Secretariat in Benin City.\nI have consulted and for the time being decided that Chief Lucky Igbinedion, a former Governor of the State to chair the peace committee of the party in the state.\nThe internal wrangling is the only thing that can stop us as it has stopped PDP in Ekiti State.\n“If we sue for peace in the party, we will certainly find one.\nHe called on the party leaders to activate the youths wing to bring youths into the party in preparation for the 2023 general election."
  },
  {
    "headline": "CVR: Ex Edo LG Chairman task stakeholders on mobilization – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbudu – With 10 days to the end of the Continuous Voters Registration (CVR) by the Independent National Electoral Commission (INEC), a former chairman of Orhionmwon local government, Hon.\nOtamere Aigbogun on Sunday called on political stake holders in the area to mobilize those who are yet to register to visit Esigie college and the Primary Health Center (PHC) at Abudu for registration.\nAigbogun who made the call in message made available to The Nigerian OBSERVER stated that the registration will continue at Abudu (Abiokunla Ward 1) on Monday, 20th June, 2022 through Wednesday, 22nd June 2022.\nThe exercise is expected to move to Ogan community in the area on Thursday 23rd June 2022 and Friday 24th June 2022.\nThe online registration is scheduled to end on 30th June year 2022 with the commission undecided on the issue of extension."
  },
  {
    "headline": "Obaseki inspects ongoing revamp of Abudu College of Education, reassures on September resumption date – Nigerian Observer",
    "summarized_story": "Obaseki, who inspected the demonstration school by the Universal Basic Education Commission (UBEC) and the main campus of the college, said his government is committed to human capacity development.\n“The demonstration school would be like a laboratory for training basic teachers because what we are trying to do is to make these facilities in Abudu another education hub.\n“The college will help in training teachers, particularly those to teach basic education.\nYou can see that the same thing is happening in the school of agriculture, as well as the school of nursing.\nFirst, you have to have quality schools, and then quality teachers to now produce the kind of students you need."
  },
  {
    "headline": "FATHERS DAY: Shaibu Harps on Godly Virtues …Serves as Altar Boy – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – As Nigeria joins the rest of the world in celebrating Father Day, Edo State Deputy Governor, Rt.\nHon.Comrade Philip Shaibu,has advocated the need for parents to imbibe and impact the virtues of Godliness andmoral discipline in their homes, by bringing up their children in the way of the Lord.\nAccording to him, “the starting point of building a nation is by building our homes”,while calling on Fathers to amplify issues that will unite the nation.\n“A Father or Leader should not say or do in secret, what he cannot own up to in public, because nothing is secret.\nIf we can act as St. Joseph in the Bible, then the issues of insecurity will be history in Nigeria”, he stated."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Mbaka disowns followers who protested against Enugu bishop",
    "summarized_story": "Reverend Father Ejike Mbaka, Enugu based fiery Catholic priest, has disassociated himself from the protests on Sunday against the ban imposed on his adoration ministry by the Enugu Diocesan Bishop, Most Rev Callistus Onaga.\nBishop Onaga had, in a pastoral injunction read in all Catholic parishes, chaplaincies and religious formations, imposed a ban on the ministry.\nHe said that he received with obedience the directive of the Bishop and warned his followers against any measure of violence either in action or by abusive utterances.\nWe received with obedience the directive issued by my Bishop, His Excellency, Most Rev CVV Onaga, on June 17, 2022.\n“Adoration Ministry is ever submissive to the mother Church."
  },
  {
    "headline": "Multiple Council: Court steps down Osinachi husband’s case",
    "summarized_story": "He further stated that he was equally served additional proof of evidence in the court just before the court started the day’s proceedings.\nI.A Aliyu on his part informed the court that he was briefed by the defendant on June 18 to take over the case.\nThe court therefore stepped down the case to 11am in order for counsel to align themselves and come proper before it.\nNews Agency of Nigeria (NAN), reports that in Monday’s proceeding, family members of the deceased singer, Osinachi were in court.\nHe was therefore remanded pending the hearing and determination of the23-count charge bordering on domestic violence and homicide instituted against him."
  },
  {
    "headline": "Hope rises for cancer patients as new cancer vaccine finds way to overcome tumor defenses",
    "summarized_story": "Some vaccines target multiple types of cancer, while others are personalized for individual tumors.\nHowever, hope is rising as developing vaccines for tumors are able to dodge the desired immune response via a molecular escape mechanism.\nThis week, Medical News Today reported on the development of a new vaccine that is designed to target the immune escape mechanism and leave cancer cells open to attack.\nThis means vaccinated tumor cells remain “visible” to the immune system, allowing a coordinated immune attack by both T cells and natural killer (NK) cells.\nThis week, there’s another cancer research breakthrough, with news of a trial in which all the participants emerged free of colorectal cancer."
  },
  {
    "headline": "When I realized there was a gang up against me, I turned to God – Tinubu",
    "summarized_story": "Presidential candidate of the All Progressives Congress (APC), Bola Ahmed Tinubu has said he resorted to prayers when he knew there was a gang-up against his presidential bid.\nGboyega Akosile, chief press secretary (CPS) to Babajide Sanwo-Olu, governor of Lagos, quoted Tinubu as saying this when he visited Rilwan Akiolu, Oba of Lagos, on Sunday.\n“The highest position attained by any Lagosian in national leadership is the position of chief judge of the federation.\nOn his part, the Oba prayed that Tinubu realises his quest to be president of Nigeria.\n“Your emergence as the presidential candidate of your party is the beginning of another journey in your political career,” he said."
  },
  {
    "headline": "PDP, APC members in Imo constituency collapse structures for Peter Obi’s LP",
    "summarized_story": "Members of the Peoples Democratic Party (PDP) and All Progressives Congress (APC) in Imo North senatorial District of Imo State have collapsed their structures into the Labour Party and pledged their loyalty and support to Peter Obi, its presidential candidate.\nWe have resolved to collapse our structures in the zone into the Labour Party and to work for the victory of Peter Obi.\nPeter Obi symbolises the hope of the ordinary people of Nigeria.\n“Peter Obi is tested and trusted and he has the support of the people who vote during the election.\nThe Labour Party is for a mass movement."
  },
  {
    "headline": "‘Yan Sanda Sun Kashe Dan Bindiga, Sun Kwato AK-47 A Zamfara",
    "summarized_story": ""
  },
  {
    "headline": "Za A Shafe Shekaru Kafin A Kawo Karshen Yakin Ukraine Da Rasha —NATO",
    "summarized_story": ""
  },
  {
    "headline": "Mai Juna Biyu, Mai Yi Wa Kasa Hidima Da Wasu Sun Mutu A Hatsarin Jirgin Ruwa A Bayelsa",
    "summarized_story": ""
  },
  {
    "headline": "‘Yan Bindiga Sun Sace Hakimi Da Dansa A Bauchi",
    "summarized_story": ""
  },
  {
    "headline": "Tawagar NIS Ta Kai Ziyarar Aiki A Poland Kan Tsaron Iyakoki",
    "summarized_story": ""
  },
  {
    "headline": "Peter Obi: Lunatics have taken over Nigeria's politics",
    "summarized_story": "Labour Party (LP) presidential candidate, Peter Obi, has likened Nigerian politics to an asylum taken over by lunatics, saying most political actors have no reason to be there.\nObi said only a lunatic in government would steal N80 billion of the citizens money for personal use.\nI have said it, politics in Nigeria is a case where lunatics have taken over the asylum.\n“How do you explain that one person took N80 billion, it is not greed, it is sickness.\nWhen you take one billion that is greed but when you take N80 billion that is sickness."
  },
  {
    "headline": "Ajadi buys nomination forms for 20 youths vying for House of Assembly seats",
    "summarized_story": "A chieftain of the New Nigeria People’s Party (NNPP) in the Southwest, Comrade Olufemi Ajadi is relentless in his efforts to ensure victory for the party in next year’s general election.\nThe latest is that he has undertaken to bankroll the cost of nomination forms and other logistics for 20 youths vying for House of Assembly seats in the South-West.\nHe said aside from purchasing nomination forms for such, he would also make more necessary support to ensure that they performed well at the polls.\nHe implored all NNPP supporters and party men to close ranks to ensure that the party emerged victorious during the elections.\n“Hundreds of thousands of youths, including young girls are idle malingering about because there is no meaningful program to help them after school."
  },
  {
    "headline": "BREAKING: Panic In Abuja As Suspected Ritualists Dump Woman’s Butchered Body Near River",
    "summarized_story": "There is tension in Kubwa, a suburb of the Federal Capital Territory (FCT), Abuja as residents on Monday found the butchered body of a yet-to-be-identified lady by a river in PW area, near Deeper Life Church.\nIt was believed to have been dumped there by suspected ritualistsThe incident attracted a large crowd as residents thronged the location to catch a glimpse of the butchered and decapitated body of the lady.\nWhen our reporters visited the scene, a beheaded corpse of a naked woman packed inside two bags was seen beside the river.\nHe said the body might have been dumped by suspected ritualists in the night.\nWe don’t know who dumped the body there but this looks like a ritual killing."
  },
  {
    "headline": "JUST IN: Ex-Jonathan’s minister, Godsday Orubebe dumps PDP",
    "summarized_story": "Orubebe, who hail from Delta State and visible loyalist of Jonathan during his administration, made this known in a letter obtained by News Direct and addressed to Dr. Iyorchia Ayu, national chairman of the PDP on Monday.\nAccording to the former minister, his resignation was as a result of the party’s ‘disregard’ to its constitution on zoning, amongst other issues.\nRead the full letter below:I write to formally inform you of my resignation from the People’s Democratic Party, (PDP).\nThis I have communicated to the Chairman of Burutu Ward 3, Burutu Local Government Area, Delta State, effective 20th June 2022.\nHowever, the present situation in the party does not inspire confidence that the party is ready to regain power in 2023."
  },
  {
    "headline": "BREAKING: Again, Bandits Attack Palace, Kidnap Plateau Monarch",
    "summarized_story": "Bandits numbering in the dozens have purportedly abducted His Royal Highness, Aminu Derwan, a traditional ruler in Plateau State, during an attack on his residence in Panyam, Mangu Local Government Area.\nAfter terrifying locals with gunshots in the early hours of Monday, the gunmen abducted Derwan, the district head of Panyam.\nOn Monday, a member of Panyam community, Moses Garuba, verified the monarch’s kidnapping to NEWS DIRECT in Jos.\nGaruba said, “It was last night around midnight that the bandits, who were more than 20 and heavily armed, surrounded the district head’s palace in Panyam.\nThe two personalities were, however, released a few days later, after a ransom was allegedly paid to the abductors."
  },
  {
    "headline": "Ex-Nigerian Military Ruler, Abdulsalami Abubakar Flown Abroad Over Ill-Health",
    "summarized_story": "General Abdulsalami Abubakar (retd.\n), the former military Head of State, is said to have travelled abroad due to his poor health.\nAccording to the report, he was transferred abroad for medical treatment roughly three weeks ago.\nHe was flown to Dubai, United Arab Emirates (UAE), but is now being treated at a UK hospital (UK).\nJustice Fati Abubakar, Abubakar’s wife and former First Lady, accompanied him."
  },
  {
    "headline": "Buhari, Tinubu on Ekiti governorship election: Oyebanji’s victory ‘ll inspire APC in 2023",
    "summarized_story": "“We thank the people of Ekiti State for recognising our contributions and for rewarding us with this victory”, Bagudu stated.\nThe breakdown of results declared are as follows: Ekiti South-West LG: APC – 9, 679, PDP – 4,474 and SDP – 4,577, Ekti West LG APC -15, 202, PDP – 3,386 and SDP – 3,863, Efon LG APC – 4012, PDP – 6,303 and SDP – 339; IJERO LG APC – 13,754, PDP – 4897 and SDP – 5006, IKERE LG APC – 12,086,PDP – 3,789 and SDP – 1,943; Ilejemeje LG APC – 4,357, PDP – 1,157 and SDP – 2,344.\nIn Irepodun/Ifelodun LG APC – 13,125, PDP – 4,712 and SDP – 5010, Ise/ Orun LG APC – 8,074, PDP – 2,588 and SDP – 5,909, Moba LG APC – 11,609, PDP – 3530 and SDP – 4904.\nOye LG APC – 13396, PDP – 4122 and SDP – 3591, Ado LG APC – 23,831, PDP – 7,575 and SDP – 15,214, Ido/Osi LG APC – 10,321, PDP – 2,871 and SDP – 9,489; , Emure LG APC – 7,728, PDP – 2,610 and SDP – 3,445.\nIkole LG APC-16,417, PDP – 6,266 and SDP – 5,736, Gbonyin LG APC -11,247, PDP–3,947 and SDP – 4,059 while in Ekiti East LG APC –12,099, PDP-5,230and SDP- 4,982."
  },
  {
    "headline": "Competency test: Kaduna sacks NUT President, 2,356 other teachers",
    "summarized_story": "Kaduna state government has confirmed that it has sacked 2,357 teachers in the state.\nOut of the number, 2,192 were eased out for failing to sit for a competency test and 165 for failing the said test, Kaduna State Universal Basic Education Board (KADSUBEB) has said.\nHowever, Chairman of the Nigeria Union of Teachers (NUT), Kaduna state chapter, Ibrahim Dalhatu, told journalists that sacking the teachers based on the competency test was illegal, adding that the test was conducted against court order and the test should not be a basis to sack teachers.\nThe state government conducted a competency test for over 30,000 primary school teachers in December 2021, KADSUBEB said in a statement issued by Hauwa Mohammed in Kaduna on Sunday.\nShe said 2,192 primary school teachers including the National President of the Nigeria Union of Teachers (NUT) Mr Audu Amba had been dismissed for refusing to sit for the competency test."
  },
  {
    "headline": "Breaking: Ex-NFF top official kidnapped",
    "summarized_story": "Unknown gunmen on Saturday night struck and kidnapped former General Secretary of the Nigeria Football Federation (NFF) Sani Ahmed Toro.\nI got across to one of his sons, who told me he was abducted around Akwanga road in Nasarawa while returning from Abuja.\nOther details when I get them will be communicated to you,” Mr Wakili was quoted by Premium Times.\nMr Toro and Mr Yila were kidnapped on their way from Abuja to Bauchi after attending the wedding ceremony of the son of Former NFF President, Aminu Maigari.\nOne of the sons of the victims Nasiru Sani Toro confirmed that his father along two others were kidnapped while returning from Abuja around 7-8pm."
  },
  {
    "headline": "ACCI Appoints Former NNPC, DPR Executive, Chairperson Women-in-Business Trade Group",
    "summarized_story": "Abuja Chamber of Commerce and Industry (ACCI) has appointed former Nigerian National Petroleum Corporation (NNPC) and the Department of Petroleum Resources (DPR) Executive, Mrs Chioma Nonyerem Njoku, as the Chairperson of the Women-in-Business Trade Group of the Chamber.\nIn a letter signed by the Director General ACCI, Victoria Akai on Tuesday, the DG stated that the Trade Group is one of the working organs of the Chamber and its roles include promoting activities of Women in Business by providing necessary support, activities and opportunities for members in the Trade Group to succeed in their ventures.\nMrs Njoku, an oil industry expert who would bring to bear over 40 years of experience of working in the oil sector to the Women – in – Business Trade Group, before this appointment has held several positions at the NNPC and DPR, including as Acting Director of Petroleum Resources.\nShe had served as the Senior Special Assistant/Adviser on Petroleum, to the Imo State Governor and as the Secretary of the Bureau of Oil and Gas Matters.\nFurthermore, she attended various Executive Management Courses including the prestigious Harvard Business School program for Leadership and General Management."
  },
  {
    "headline": "NIHOTOUR to unveil mobile training kitchens",
    "summarized_story": "… As key players gear up for 2022 Sustainable Gastronomy Day CelebrationBy Palma IleyeNational Institute for Hospitality and Tourism, NIHOTOUR, has stated that it was set to unveil mobile training kitchens at the 2022 World Sustainable Gastronomy Day Celebration which is expected to attract high level attendance by critical stakeholders of the industry at the event which opens on Saturday, 18th June 2022 at the International Conference Centre, Abuja.\nDisclosing this to newsmen at the headquarters of the Institute in Abuja, Director General and Chief Executive Officer of NIHOTOUR, Nura Sani Kangiwa, said the institute has acquired the mobile kitchens in order to up its skill acquisition and training outreach programs to Nigerian youths in the nooks and crannies of the country.\nKangiwa noted that the Sustainable Gastronomy Day celebration for this year recognizes the practices and principles associated with sustainable food consumption combined with the art of collecting, preparing and consuming the food we eat, stating further that the observances of the day acknowledges the social, cultural and artistic expression related to gastronomy that defines the three dimensions of sustainable development which are; people, planet and profit (benefits).\nHe noted that gastronomy was a cultural expression of nations through their food choices, sources of ingredients and types of cuisines which thrives in culturally rich destinations and Nigeria being one of the most competitive Gastronomy tourist destination in Africa because of its corresponding unique foods culture and enticing cuisines of international repute.\nThe NIHOTUR boss also noted that the occasion will also feature the presentation of a paper to mark the observance Day to be delivered by Olufemi Falebita titled ‘Marketing Nigerian Foods Abroad’The United Nations General Assembly proclaimed World Sustainable Gastronomy Day in December, 2016 and first celebrated it in 2017."
  },
  {
    "headline": "PenCom says only five states, Kaduna, Lagos, Delta 2 others pay pensions",
    "summarized_story": "It has been reported that only five states are paying pensions under the Contributory Pension Scheme as more workers retired by the end of the first quarter of 2022, findings have revealed.\nPenCom listed the states that were funding the accrued rights of the retirees and paying pensions under the CPS to be Lagos, FCT, Osun, Kaduna and Delta.\nData obtained from PenCom on ‘Status of implementation of the CPS by states’ showed that 25 states had enacted laws on the CPS and that out of them, 15 had pension bureaux and boards in line with the CPS.\nThe data revealed that the 25 states are Lagos, FCT, Osun, Kaduna, Delta, Ekiti, Ondo, Edo, Benue, Kebbi, Niger, Rivers, Ogun, Bayelsa, Kogi, Anambra, Abia, Taraba, Imo, Sokoto, Adamawa, Ebonyi, Nasarawa, Enugu and Oyo.\nPenCom data showed that states with other pension schemes were Jigawa, Kano, Gombe and Zanfara."
  },
  {
    "headline": "Adegbite woos investors with huge gold, lead-zinc, iron-ore deposits",
    "summarized_story": "By Palma IleyeIn continued efforts to grow the economy through the mining sector, the Minister of Mines and Steel Development, Arc Olamilekan Adegbite, Thursday, has wooed investors abroad with huge gold, lead-zinc, iron-ore and barite deposits in Nigeria.\n“Target minerals under the first phase include Gold, Lead-Zinc, Iron Ore, and the Battery Minerals, among others.\n“These include Thor Exploration Limited’s Segilola Gold Mine Project, in Osun State, which has an initial production capacity of 80,000 ounces of gold annually, representing the first large-scale Gold Mine in Nigeria.In June last year, we commissioned the Dukia Gold & Precious Metals Refinery, DGPMR, Project.\nIts potential impact on the gold sector is nothing short of revolutionary.\n“From the revenue drive perspective, the Nigerian Mining Sector has demonstrated a marked improvement despite the challenges of the pandemic."
  },
  {
    "headline": "Safety Engineers call for establishment of Safety Commission",
    "summarized_story": "Emeka Samuel,UYOThe National Chairman of the Nigerian Institution of Safety Engineers (NISafetyE), Engr.\nAkaninyene Ekong has called on the States’ Houses of Assembly to enact a law for the establishment of Safety Commissions across all states in Nigeria.\nEkong made this call yesterday during the 2022 Annual Public Lecture on “Advancing Safety Engineering for Sustainable Development” organized for the Investiture of Engr.\nThe chairman tasked Safety practitioners and professional bodies to woo and lobby the political class in order to engender a robust and better safety culture in Nigeria through legislation in line wiith ILO guidelines.\nThe chairman called for synergy with the practitioners and developers in the building and environment industry, the political class and particularly, the legislators for the rebirth of a serene safety culture in Nigeria through the use of qualified Engineers in projects and the establishment of a safety regulatory agency, otherwise known as Safety Commission."
  },
  {
    "headline": "‘Lunatics Have Taken Over The Asylum’: Obi Tells Nigerians To Take Back Country",
    "summarized_story": "Peter Obi has called on Nigerians to take back the country, claiming the nation’s political space has been taken over by those he described as “lunatics”.\nThe presidential candidate of the Labour Party (LP) believes many of those in the political space do not have business being there.\nPolitics in Nigeria is a case where lunatics took over the asylum.\nAPC Ticket: When I Was Almost Fed Up, I Resorted To Prayers – Tinubu“How do you think about one person taking N80 billion?\nGreed is taking one N1 billion which he is not entitled to but taking N80 billion is sickness."
  },
  {
    "headline": "Alleged Homicide: How Osinachi’s Husband Threatened To Kill Singer – Victim’s Mother",
    "summarized_story": "The mother of Osinachi Nwachukwu has narrated before the FCT High Court in Abuja how the late gospel singer’s husband threatened to kill the late victim.\nWhen the singer was sick, Madu claimed to have told Osinachi that she needed treatment.\nShe, however, said she would have to plead with her husband, adding that if she visited her, her husband would kill her.\nREAD ALSO: Alleged Homicide: Osinachi’s Relatives Present As Husband Arrives Abuja CourtThe singer’s mother, who was in tears, accused Peter of coming to steal her child.\nDuring Osinachi’s pregnancy, the mother said her husband will beat her and when she asked her to come and see him, the singer’s husband refused."
  },
  {
    "headline": "Bandits Attack Kaduna Communities, Kidnap At Least 36 Persons",
    "summarized_story": "At least 36 people were reported kidnapped during Sunday’s attack by bandits on four communities in the Kajuru Local Government Area of Kaduna State.\nThis was disclosed by the residents of the communities during a meeting with security agencies on Monday.\nHe said they killed some of the villagers who tried to repel the attack injured others.\nOthers present at the meeting include the Kaduna State Commissioner of Police, Yekini Ayoku, other heads of security agencies in the state, community leaders, and the chairman of Kajuru Local Government Area.\nThe bandits had on Sunday attacked four communities during which they killed three worshippers from two churches and also took away several other residents."
  },
  {
    "headline": "APC Ticket: When I Was Almost Fed Up, I Resorted To Prayers – Tinubu",
    "summarized_story": "﻿The presidential candidate of the All Progressives Congress (APC), Bola Tinubu, has recounted the struggle to emerge as the flagbearer of the ruling party in the 2023 general elections.\nEarlier, all roads leading to the presidential wing of the Murtala Mohammed International Airport (MMIA) were a beehive of activities as supporters trooped to the airport to receive Tinubu.\nTinubu’s arrival in the state is the first since he won the APC presidential ticket.\nThose on his entourage included the Governor Abdullahi Ganduje of Kano State; Senator Kashim Ibrahim; former APC national chairman, Adams Oshiomhole; and Kashim Ibrahim-Imam, among others.\nGovernor Hope Uzodimma of Imo State; Senator Solomon Adeola; Senator Tokunbo Abiru; Lagos APC chairman, Cornelius Ojelabi; and members of the Lagos Executive Council led by Governor Sanwo-Olu joined the dignitaries who received the APC presidential flagbearer at the airport."
  },
  {
    "headline": "Gunmen Kidnap Village Head, Son In Bauchi",
    "summarized_story": "Gunmen have abducted the village head of Zira, Yahaya Saleh, and his son, Habibu Saleh, in Toro Local Government Area of Bauchi State.\nThe abduction of the village head was confirmed by the Bauchi State Police Public Relations Officer, Ahmed Wakili.\nHe explained that the gunmen attacked Zira village which shares a border with Plateau State on Saturday night and carried out the act.\nResidents are troubled by the increasing spate of kidnappings in Toro and they are calling on the authorities to take appropriate measures to curb the spread.\nThe latest abduction is coming five days after bandits killed four people and injured three others in Alkaleri Local Government Area."
  },
  {
    "headline": "Ekiti Governor-elect Biodun Oyebanji pledges to build on Fayemi's legacies",
    "summarized_story": "Winner of the June 18 Governorship Election in Ekiti State, Biodun Abayomi Oyebanji has pledged to build on the Legacy of the outgoing administration led by the Governor, John Kayode Fayemi.\nFollowing his declaration as the Governorship Election Winner earlier today, the Ikogosi-born Technocrat hosted three governors and one former governor, who came to congratulate him and present the election results to him.\nThe Governor of Kebbi State, Atiku Bagudu, who also serves as the Chairman of the Ekiti State Governorship Campaign Council, believes that the performance of Ekiti State Governor, Kayode Fayemi, was crucial in Saturday’s victory, which serves as a model for success in the Presidential election in 2023.\nReading his acceptance speech, Biodun Oyebanji expressed gratitude to all who made the mandate possible and promised to build on Governor Kayode Fayemi’s legacies.\nOyebanji won the election with a Margin of over a 100, 000 to his closest Challenger."
  },
  {
    "headline": "BREAKING: APC wins Ekiti Governorship election with audacious margin -",
    "summarized_story": "The governorship candidate of the All Progressives Congress in Ekiti State, Biodun Abayomi Oyebanjo, has been declared the winner of the Saturday governorship election.\nThe People’s Democratic Party came third with 67,457 votes.\nThe APC governorship candidate won 15 out of the 16 local governments in the state to emerge victory at the poll.\nBelow is the breakdown of the results as released by the electoral umpire.\nAdo-Ekiti LGARegistration Area – 13Registered – 179,088Accredited – 50,596APC – 23,831PDP – 7,575SDP – 15,214================================Ikere LGARegistration Areas – 11Registered voters – 65,661Accredited voters – 24,109ADC – 3,763APC – 12,086SDP – 1, 946PDP – 3,789=============================Oye LGARegistration Areas – 12Registered Voters – 65,170Accredited Voters -24,925APC – 13,396PDP – 4,122SDP – 5,391================================Gbonyin LGARegistration Areas – 10Registered Voters – 53,788Accredited Voters – 20,308APC – 11,247PDP – 3,947SDP – 4,059==============================Efon LGARegistration Area – 10Registered Voters –Accredited Voters 11046APC – 4,012PDP – 6,303SDP – 339=============================Ekiti East LGRegistration Areas – 12Registered Voters – 61,360Accredited Voters – 24024APC – 12,099PDP – 5,230SDP – 4,982=============================Ekiti South-West LGAAPC – 9,679PDP – 4,474SDP – 4,577=============================Ekiti West LGARegistration Areas – 11Registered Voters – 59,270Accredited Voters – 23,750APC – 15,322PDP – 3,386SDP – 3,863============================Emure LGAAPC – 7,728PDP – 2,610SDP – 3,445=====================================Ido-Osi LGARegistration Area – 11Registered Voters – 57,780Accredited Voters – 23,848APC – 10,321PDP – 2,871SDP – 9,489=====================================Ijero LGA12 Registration AreasRegistered voters- 65,328Accredited voters- 25,103ADC- 96ADP-201APC – 13,754PDP – 4,897SDP – 5006=============================Ikole LGARegistration Areas – 10Registered Voters – 71,690Accredited Voters – 30,403APC – 16,417PDP – 6,266SDP – 5,736==============================Ilejemeje LGARegistered Voters -18791Accredited Voters – 8439APC – 4357PDP – 1,157SDP – 2,344=============================Irepodun/Ifelodun LGARegistration Areas – 11Registered Voters – 70,467Accredited Voters – 24,123APC – 13,125PDP – 4,712SDP – 5,010==============================Ise/Orun LGARegistration Area – 10Registered voters – 46,712Accredited voters – 17,534APC – 8,074PDP – 2,588SDP – 5,909=========================Moba LGARegistration – 11Registered Voters – 53,527Accredited Voters – 20,743APC -11,069PDP – 3,530SDP – 4,904Final ResultsAccredited Voters – 363,468A – 166AAC – 409ADC – 5,597ADP – 3,495APC – 187,057APGA – 376APM – 290APP – 1,980LP – 195NNPP – 529NRM – 347PDP – 67,457PRP – 856SDP – 82,211YPP – 618ZLP – 282Total Vote Cast – 360,753"
  },
  {
    "headline": "Ekiti Governorship Election: Live Collation of Final Results -",
    "summarized_story": "The collation and announcement of results from the sixteen local government areas has commenced at the State Collation Centre in Ado-Ekiti.\n=================================================================Ado-Ekiti LGARegistration Area – 13Registered – 179,088Accredited – 50,596APC – 23,831PDP – 7,575SDP – 15,214================================Ikere LGARegistration Areas – 11Registered voters – 65,661Accredited voters – 24,109ADC – 3,763APC – 12,086SDP – 1, 946PDP – 3,789=============================Oye LGARegistration Areas – 12Registered Voters – 65,170Accredited Voters -24,925APC – 13,396PDP – 4,122SDP – 5,391================================Gbonyin LGARegistration Areas – 10Registered Voters – 53,788Accredited Voters – 20,308APC – 11,247PDP – 3,947SDP – 4,059==============================Efon LGARegistration Area – 10Registered Voters –Accredited Voters 11046APC – 4,012PDP – 6,303SDP – 339=============================Ekiti East LGRegistration Areas – 12Registered Voters – 61,360Accredited Voters – 24024APC – 12,099PDP – 5,230SDP – 4,982=============================Ekiti South-West LGAAPC – 9,679PDP – 4,474SDP – 4,577=============================Ekiti West LGARegistration Areas – 11Registered Voters – 59,270Accredited Voters – 23,750APC – 15,322PDP – 3,386SDP – 3,863============================Emure LGAAPC – 7,728PDP – 2,610SDP – 3,445=====================================Ido-Osi LGARegistration Area – 11Registered Voters – 57,780Accredited Voters – 23,848APC – 10,321PDP – 2,871SDP – 9,489=====================================Ijero LGA12 Registration AreasRegistered voters- 65,328Accredited voters- 25,103ADC- 96ADP-201APC – 13,754PDP – 4,897SDP – 5006=============================Ikole LGARegistration Areas – 10Registered Voters – 71,690Accredited Voters – 30,403APC – 16,417PDP – 6,266SDP – 5,736==============================Ilejemeje LGARegistered Voters -18791Accredited Voters – 8439APC – 4357PDP – 1,157SDP – 2,344=============================Irepodun/Ifelodun LGARegistration Areas – 11Registered Voters – 70,467Accredited Voters – 24,123APC – 13,125PDP – 4,712SDP – 5,010==============================Ise/Orun LGARegistration Area – 10Registered voters – 46,712Accredited voters – 17,534APC – 8,074PDP – 2,588SDP – 5,909=========================Moba LGARegistration – 11Registered Voters – 53,527Accredited Voters – 20,743APC -11,069PDP – 3,530SDP – 4,904=================================================================Final ResultsA – 166AAC – 409ADC – 5,597ADP – 3,495APC – 187,057APGA – 376APP – 1,980LP – 195NNPP – 529NRM – 347PDP – 67,457PRP – 856SDP – 82,211YPP – 618ZLP – 282Total Vote Cast – 360,753"
  },
  {
    "headline": "Zamfara declares one week public holiday for civil servants to obtain PVC -",
    "summarized_story": "Zamfara State Government has declared Monday to Friday next week 20th – 21st June, as work free week to allow civil servants travel to their localities and register in the ongoing permanent voter card registration.\nThe state Commissioner for Information, Ibrahim Dosara in press state made available to Newsmen in Gusau, Confirmed the developmentHe says, Commissioners, Special advisers, Tradition rulers and other Political Party Officials are expected to monitor the exercise in their respective areas.\n“By this announcement, all Commissioners, Special Advisers, Permanent Secretaries, other public office holders, party officials and traditional rulers are here by directed to monitor and supervise the on going Voter Registration exercise to ensure that all eligible voters within their wards and local governments register and obtain their Permanent Voter Cards to enable them exercise their fundamental rights and civic responsibilities in the Coming Elections” The statement read."
  },
  {
    "headline": "Ukraine Bans Some Russian Books and Music in Latest Step of ‘Derussification’",
    "summarized_story": "Ukraine’s parliament has voted through two laws that will place severe restrictions on Russian books and music as Kyiv seeks to break many remaining cultural ties between the two countries following Moscow’s invasion.\nOne law will forbid the printing of books by Russian citizens, unless they renounce their Russian passport and take Ukrainian citizenship.\nThe ban will only apply to those who held Russian citizenship after the 1991 collapse of Soviet rule.\nIt will also ban the commercial import of books printed in Russia, Belarus and occupied Ukrainian territory, while also requiring special permission for the import of books in Russian from any other country.\nAnother law will prohibit the playing of music by post-1991 Russian citizens on media and on public transport, while also increasing quotas on Ukrainian-language speech and music content in TV and radio broadcasts."
  },
  {
    "headline": "Oleksandr Usyk-Anthony Joshua Heavyweight Title Rematch Confirmed for August 20 in Saudi Arabia",
    "summarized_story": "The heavyweight title rematch between Oleksandr Usyk and Anthony Joshua is now set for Aug. 20 in Jeddah, Saudi Arabia, it was announced Sunday.\nThe fight had been planned for July 23, but now Joshua will have nearly 30 more days to work with new trainer Robert Garcia.\nWhen they met in September, Usyk (19-0, 13 KOs) dominated Joshua en route to a unanimous decision victory to capture three heavyweight titles.\nIn the meantime, Joshua parted ways with Robert McCracken, the only head trainer he’d ever had in the pros.\nMcCracken also led Joshua to a gold medal in 2012 as the head coach of the Great Britain Olympic boxing team."
  },
  {
    "headline": "Gustavo Petro: Colombia Elects Ex-Rebel as First Left-Wing President",
    "summarized_story": "Gustavo Petro, the former mayor of Bogota and ex-rebel fighter, has become Colombia’s first left-wing president.\nThe 62-year-old Mr Petro hailed what he called a “victory for God and for the people”.\n“May so much suffering be cushioned by the joy that today floods the heart of the homeland,” Mr Petro wrote on Twitter.\n“I hope that Mr Gustavo Petro knows how to run the country and is faithful to his discourse against corruption,” he added.\nBut Mr Petro will face challenges from a fragmented congress, which includes representatives of more than a dozen parties."
  },
  {
    "headline": "Nigeria: Atiku Mocks Tinubu and Peter Obi, Says They Can’t Take First and Most Important Decision",
    "summarized_story": "The APC presidential candidate, Bola Tinubu and his Labour counterpart, Peter Obi have chosen placeholders because of their inability to choose their preferred presidential running mate.\nWhile Tinubu picked Usman Masari and Obi chose Doyin Okupe.\n“Ifeanyi and I are incurable optimists in the future of Nigeria and the promises it holds as one united, peaceful and prosperous country.\n“A victory for the PDP in the general election is a victory for Nigeria.\nThe stakes in the election are very high, and it gives me tremendous joy that I can count on your support to win the election and get to work in earnest.”, Atiku stated."
  },
  {
    "headline": "Ekiti Election: Be Magnanimous in Victory, Buhari Tells Oyebanji, Says Success Indicative of People’s Confidence in APC",
    "summarized_story": "He urged a continuation of the winning trend in the Osun State governorship poll in July.\nTinubu: Ekiti Victory Will Motivate APC for More in 2023Presidential candidate of APC, Senator Bola Tinubu, said the party’s victory in the Ekiti State governorship election would spur it on to more victories in the coming elections.\n“Hearty congratulations to our own BAO, the governor-elect, and a bigger congratulations to our party, APC.\n“No doubt, BAO’s vast experience in public service is an asset that would be deployed for the good of the people of Ekiti State.\n“There are reports of a brazen pattern of vote-buying and electoral bribery in several polling units during the just concluded Ekiti governorship election."
  }
]