[
  {
    "headline": "Bandits release five Katsina victims after 66 days",
    "summarized_story": "Bandits who attacked Batsari community in Katsina State last May have released five of their victims.\nThe victims regained their freedom after spending 66 days in captivity.\nThe family member who pleaded anonymity said the bandits released the other victims on compassionate ground.\nHe gave the names of other freed victims as Zainab Bello, Muhammad Bello and Yakubu Bello.\nAn opinion leader in Batsari also revealed on Sunday that Hussaina and other freed victims joined their families over the weekend."
  },
  {
    "headline": "Sunday Igboho can only be extradited on political grounds -Lawyer",
    "summarized_story": "He explained that there was no accord between Nigeria and Benin Republic that can give room for extradition.\nThe lawyer said Igboho can only be extradited by political arrangement, which according to him, is dangerous for his safety.\n“There is no accord between Nigeria and Benin that allows Benin to extradite Igboho to Nigeria.\n“It is important that Igboho is not extradited to Nigeria under any circumstances.\nIt is better for him to die here in Benin than be extradited to Nigeria.”"
  },
  {
    "headline": "COVID-19: Lack of autopsy may cause recurring deaths in Iseyin ― Group",
    "summarized_story": "By Adeola Badru, IbadanA socio-cultural group, Ebedi Frontliners, Iseyin (EFI), has urged the government at all tiers to look into the causes of sudden deaths among the people of Iseyin community in Oyo State, as they claimed many have died without prior sickness.\nA statement signed by the Public Relations Officer (P.R.O) of the organization, Alhaji Segun Fasasi made available to Vanguard on Sunday, said the group was worried about sudden deaths of individuals that had no medical crisis but were found dead in their sleep.\nALSO READ: If you have an issue with ‘Oko Iyabo’, go to court, Yomi Fabiyi blows hotFasasi urged the government to carry out an autopsy of deaths that occurred suddenly, to ascertain the causes and stop the spread of the dreaded Delta Variant of COVID-19, which he claimed does not give symptoms like the first two types of the virus, which started for a year ago.\nThe state government had recently announced that the Delta Variant of COVID-19 has killed some people in the state, calling on the people to keep up their guards against contracting and spreading the virus.\nVanguard News Nigeria"
  },
  {
    "headline": "Bandits release 28 Bethel Baptist students",
    "summarized_story": "By Ibrahim Wuyo, KadunaBandits who kidnapped students of Bethel Baptist High School in Kaduna state, have on Sunday, released 28 of the students who were in captivity for about 20 days.\nRev.John Joseph Hayab, Chairman of the Christian Association of Nigerian (CAN), in Kaduna state, confirmed the development to journalists on Sunday, July 25, 2021.\nIt could be recalled that the bandits raided the school on the 5 of July 2021 and kidnapped 121 students after killing two military personnel.\nSimilarly, 2 more students managed to escape from the kidnappers’ den when they were asked to go and fetch fuelwood by the bandits.\nThe bandits had reportedly demanded a N60 million ransom before they would release the students."
  },
  {
    "headline": "Kidnapped five maritime workers union members, others, regain freedom",
    "summarized_story": "By Dirisu YakubuEight Nigerians, including five members of the Maritime Workers of Nigeria, MWUN, abducted by gunmen in Rivers State, penultimate Monday have regained freedom.\nThe release of the abducted travellers, which occurred on Saturday evening is sequel to the intervention of the Director-General of Nigerian Maritime Administration and Safety Agency (NIMASA), Dr. Bashir Jamoh and other stakeholders.\nThe DG of NIMASA broke the news after a phone conversation with the President-General of the Maritime Workers Union of Nigeria, MWUN, Comrade Adewale Adeyanju.\nThe abductees are believed to be in good physical condition and the MWUN President General is expected to provide detailed report on the incidents surrounding the abduction this week.\nVanguard reports that the eight persons were travelling to Port Harcourt from Kula area in Akuku-Toru Local Government Area, before the gunmen abducted them at the Kula-Abonnema waterway."
  },
  {
    "headline": "FG extends NIN-SIM verification deadline to October 31",
    "summarized_story": "The Federal Government has extended the deadline for National Identity Number (NIN)-Subscriber Identity Module (SIM) data verification to October 31.\nAccording to the officials, the extension is also to address low enrolments in schools and hospitals, as evidenced by enrolment statistics.\nAccording to them, the decision also followed a review of the progress of the exercise which indicates significant progress, hence the need to consolidate the gains of the enrolment and NIN-SIM verification process across the country.\n“As at July 24, 2021, there are over 5,500 enrolment systems within and outside the country and this will significantly ease the NIN enrolment process and subsequent linkage of NIN to SIM.\nPantami appreciated Nigerians for their patience and compliance with Federal Government’s directive on the NIN-SIM registration."
  },
  {
    "headline": "Breaking: Bandits release 28 Bethel Baptist students",
    "summarized_story": "By Ibrahim WuyoBandits who kidnapped students of Bethel Baptist High School in Kaduna state, have on Sunday, released 28 of the students.\nThese students have spent 20 days in captivity.\nJohn Joseph Hayab , Chairman of the Christian Association of Nigerian (CAN), in Kaduna state, confirmed the development to journalists on Sunday, July 25, 2021.\nIt could be recalled that the bandits raided the school on the 5 of July, 2021 and kidnapped 121 students after killing two military personnel.\nThe bandits had, reportedly demanded for N60 million ransom before they would release the students."
  },
  {
    "headline": "HURIWA raises alarm over alleged compromise, hack of online voters registration",
    "summarized_story": "The Human Rights Writers Association of Nigeria, HURIWA, has raised an alarm that the ongoing online registration of prospective voters by the Independent National Electoral Commission, INEC, may have been heavily compromised and probably hacked.\n“So it is expected that the Chairman will guide against any technological breaches that may undermine the integrity of the voters registration process,” the group said.\nAccording to a date released by INEC, Osun State is trailed by another southwest state, Lagos, which has 30,338 followed by Ogun State with 8,886.\nThe rights group faulted this demography of the released updated figures of online registered potential.\nIt calls on INEC to investigate Osun figures and not hesitate to sanction any of its staff or agents found wanting."
  },
  {
    "headline": "My successor should probe me if I steal Imo money – Uzodinma",
    "summarized_story": "The Governor of Imo State, Senator Hope Uzodinma, has urged anyone who will succeed him to probe his administration if he steals the state’s patrimony.\nThe governor said governance is about transparency and that is what he has come to offer to Imo people and not to steal their money.\nHe said this while addressing a cross section of Imo stakeholders on Saturday at the Eze Imo palace in Owerri, the state’s capital.\nAccording to him, “I have come to serve Imo people and not to steal their money.\nPresent and former members of the National Assembly, speaker and members of Imo state House of Assembly, the traditional rulers among others."
  },
  {
    "headline": "Physician advocates proper use of contraceptives for family planning",
    "summarized_story": "Couples who desire to practice proper methods of family planning or contraception have been advised to discuss with their doctor rather than taking pills like Postinor 2 as a regular contraceptive.\nThis advice was given by an Osogbo-based family physician, Dr. Esther Oke, in a chat with DAILY POST on Sunday.\nDr. Oke stated that amongst couples, getting pregnant is a condition to be desired but family planning is also advisable in order to properly space the birth of children in light of the prevailing economic situation in the country.\nPostinor 2 taken within the first 72 hours of unprotected sex will prevent only 85% of pregnancies.\nHypertension: Physician urges monitoring, lifestyle changeOthers according to her include: diarrhoea, dizziness, headache, skin changes and vaginal bleeding."
  },
  {
    "headline": "Bandits release students of Baptist school in Kaduna",
    "summarized_story": "A resident of Gadan Gaya village in Chickun Local Government Area of the state, Mr. Jonathan Awe, said the released students were found inside the Tsoho Gaya Forest in Chikun Local Government Area of the state in the early hours of Sunday.\nRecall that 121 Bethel Baptist School students were kidnapped on 8th July, 2021.\nThree of the students were released on two different occasionsIt was not immediately confirmed whether ransom was paid before the abducted students were released on Sunday, just as parents had been negotiating with Bandits over #60 million Naira ransom demanded by the bandits."
  },
  {
    "headline": "Irigwe people lament killings, destruction of farmlands by suspected Fulani militias in Plateau",
    "summarized_story": "The Irigwe people of Plateau State have called for help following incessant attacks on their farmlands and properties by suspected Fulani militias.\nRecall that in the last two months, there have been reported cases of destruction of crops on farmlands of some natives in different communities in Plateau State.\nAmong the worst-hit are communities in Riyom, Barkin Ladi, and Bassa local government areas of the state.\nThe statement added, “Over 25 farmlands have also been destroyed by the same marauders at Ancha village within the same period.\nIt said that the lack of government’s action has contributed to allowing the perpetrators to continue having a field day in committing their atrocities."
  },
  {
    "headline": "First House BBN House mate Boma checks out the house",
    "summarized_story": "The first housemate of the BBNAIJA season 6 tagged \"shine your eyes\" is Boma.\nHe introduced himself thus;A mixologist,He was a footballer but sustained injuries and had to go into modeling,A masseuse, likes to talk and listen to people, loves being the Mc in a party, anticipates hosting the parties in the house.\nHe is single and ready to mingle in the house"
  },
  {
    "headline": "Sunday Igboho not abandoned, says Sanwo-Olu",
    "summarized_story": "Lagos Governor Babajide Sanwo-Olu has assured leaders of the Southwest are working to ensure the release of Yoruba Nation agitator Sunday Adeyemo aka Sunday Igboho.\nIgboho was arrested in Cotonou, Benin Republic last Monday on his way to Germany.\nHe said: “People are working behind the scenes but the matter doesn’t have to be a public conversation.\n‘’These are very difficult times for all of us, but I can assure you that people are working behind the scenes.\nIn times like this, it’s not by how many press people you call.”"
  },
  {
    "headline": "VIDEO: Dog effortlessly shows artistic skills as it paints on canvas",
    "summarized_story": "In a video making the rounds online, a dog is seen displaying its artistic skills on canvas.\nThe dog which was seen working without any guidance from its owner shocked people on social media.\nIn the video, the dog is seen showing off the different colors it intends to use for the painting and it used the brush to effortlessly paint a flower as though it were a human.\nMy dog is useless af but I still love her@Crjstixn said; How does this dog know what color it’s choosing???\n😍🙌@mandala.tales said; Wow, wow, can I collaborate with Secret, please😍😍@rruhaa___ly said; So beautiful and she is the most amazing and talented dog I have ever seen🥺🥺😭😭😭😭"
  },
  {
    "headline": "VIDEO: Erica, Laycon make up, hang out",
    "summarized_story": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator."
  },
  {
    "headline": "Layrica. Fans react with video of Laycon an Erica together",
    "summarized_story": "Fans have reacted over the news development of ex BBNAIJA housemates Erica and Laycon in a video.\nThe duo have been in constant beef after a misunderstanding happened in the house which also led to Erica been disqualifiedAt the reunion, Erica who appeared once made known her displeasure in Laycon.\nThe video which was handled by Erica showed her introducing Laycon as the love and light guy.\nThe question now on the lips of Nigerians is, what happens to the fans of both persons who have turned enemies on their behalf?\nwatch video herehttps://www.facebook.com/OsaremenGist/videos/1225894104550258/?app=fbl"
  },
  {
    "headline": "Breaking: Kaduna Bandits Release 28 Abducted Students of Baptist High School",
    "summarized_story": "By John ShiklamTwenty-eight of the abducted students of Bethel Baptist High School, Damishi, Kaduna have been released after 20 days in captivity.\nKaduna state chairman of Christian Association of Nigerian (CAN), Rev.\nJoseph Hayab, confirmed their release on Sunday in a telephone interview.\nThe students were abducted by bandits in the school on July 5.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "People Working Behind the Scenes on Igboho’s Arrest, Sanwo-Olu Reveals",
    "summarized_story": "The lawyer explained that the authorities of Benin Republic did not apprehend Igboho because he violated the Constitution of Benin Republic or any law of the Francophone country.\nInside Igboho’s Nigerian passport, according to Igboho’s lawyer, security operatives also found a German Residency Permit.\n“Despite bringing this violation to their attention, the police authorities in Benin Republic have not removed handcuffs from Igboho’s hands.\nIn international law, refusal to surrender a fugitive is tantamount to granting asylum.\nThose are critical questions that the Benin Republic must answer."
  },
  {
    "headline": "Buni Faces Fresh Challenges as APC Chairmanship Aspirants Reject Consensus Option",
    "summarized_story": "Al-Makura, Adamu, and Akume are the leading contenders for the position of the national chairman of the ruling party.\nBut the political camps of Al-Makura, Adamu, and Akume, who feared that the party would also apply the same consensus option to elect its national chairman, have expressed their opposition to the option of a consensus national chairman.\nOne of the campaign managers of Al-Makura, who is a member of the House of Representatives, told THISDAY that the option of a consensus national chairman would not be acceptable to his principal.\nBut to impose a candidate as a consensus option will be resisted,” he explained.\nIt cautioned the party against allowing any of the former governors to emerge as the national chairman of the party."
  },
  {
    "headline": "Again, CBN Guarantees Safety, Resilience of Banking Industry",
    "summarized_story": "The assurance came against the backdrop of “false and unfounded stories circulating in the social media attacking the soundness and safety of some Nigerian banks”.\nThe apex bank had severally reassured the banking public about the soundness and safety of the financial system.\nThe CBN Governor, Mr. Godwin Emefiele, recently emphasised the resilience of the banking sector amidst the impact of the pandemic.\nHe said: “Let me say that the Nigerian banking system remains very strong and resilient.\nI will say that unlike in other climes, the Nigerian banking industry appears to be one of the well-regulated industries in the world today."
  },
  {
    "headline": "BBNaija Returns with a Jaw-dropping Colourful House",
    "summarized_story": "The Big Brother House which is a main feature of the show dominated conversations on social media for its spectacular decor.\nThe Head of House room which is on the mezzanine floor spotted a new look.\nThe addition of the new floor has ultimately seen an increase in the number of cameras in the house.\nIn the BBNaija Pepper Dem edition in 2019, the house was designed to take seven hand-held cameras and 32 que ball cameras.\nBilled for two nights this weekend, the launch show saw 11 male housemates enter the house on Saturday night."
  },
  {
    "headline": "BREAKING: Bandits Release 28 Abducted Bethel School Students In Kaduna, More Still In Kidnappers' Den",
    "summarized_story": "Bandits have released 28 students kidnapped from Bethel Baptist Academy in the Chikun Local Government Area of Kaduna State.\nTwo of the students had earlier escaped while the bandits had released one on health grounds.\nThe gunmen who invaded the school on July 5, 2021 had demanded N500,000 for each of the students, Daily Trust reports.\nSee Also Sahara Reporters Two Abducted Bethel Baptist Students Rescued By Security Operatives Now In Hospital—PoliceChairman of the Christian Association of Nigeria (CAN) in Kaduna, Rev.\nJohn Hayab, said about 80 students were still held captive by the bandits while the released students would be reunited with their families."
  },
  {
    "headline": "BREAKING: Bandits Release 28 Abducted Bethel School Students In Kaduna, More Still In Kidnappers' Den",
    "summarized_story": "Bandits have released 28 students kidnapped from Bethel Baptist Academy in the Chikun Local Government Area of Kaduna State.\nTwo of the students had earlier escaped while the bandits had released one on health grounds.\nThe gunmen who invaded the school on July 5, 2021 had demanded N500,000 for each of the students, Daily Trust reports.\nSee Also Sahara Reporters Two Abducted Bethel Baptist Students Rescued By Security Operatives Now In Hospital—PoliceChairman of the Christian Association of Nigeria (CAN) in Kaduna, Rev.\nJohn Hayab, said about 80 students were still held captive by the bandits while the released students would be reunited with their families."
  },
  {
    "headline": "EXCLUSIVE: How Oyedepo’s Living Faith Pastors Send Fake Church Attendance, Offerings To Headquarters To Keep Their Jobs – Another Pastor Opens Up",
    "summarized_story": "He said, “Well, they (Living Faith) planted over 10,000 churches before the end of 2020 and they celebrated it.\nAfter this were the different issues of no church hall and other necessary materials for the pastors to work.\nBut some senior Pastors keep telling lies that we (the employed pastors) should be patient with them.\nAll these were what we were facing; no church hall and other things but attendance must prove that the church was growing.\nSee Also Christianity How Oyedepo's Living Faith Church Paid Graduate Pastors N38,000 Monthly — Another Pastor Opens Up"
  },
  {
    "headline": "EXCLUSIVE: How Oyedepo’s Living Faith Pastors Send Fake Church Attendance, Offerings To Headquarters To Keep Their Jobs – Another Pastor Opens Up",
    "summarized_story": "He said, “Well, they (Living Faith) planted over 10,000 churches before the end of 2020 and they celebrated it.\nAfter this were the different issues of no church hall and other necessary materials for the pastors to work.\nBut some senior Pastors keep telling lies that we (the employed pastors) should be patient with them.\nAll these were what we were facing; no church hall and other things but attendance must prove that the church was growing.\nSee Also Christianity How Oyedepo's Living Faith Church Paid Graduate Pastors N38,000 Monthly — Another Pastor Opens Up"
  },
  {
    "headline": "EXCLUSIVE: How Oyedepo’s Living Faith Pastors Send Fake Church Attendance, Offerings To Headquarters To Keep Their Jobs – Another Pastor Opens Up",
    "summarized_story": "He said, “Well, they (Living Faith) planted over 10,000 churches before the end of 2020 and they celebrated it.\nAfter this were the different issues of no church hall and other necessary materials for the pastors to work.\nBut some senior Pastors keep telling lies that we (the employed pastors) should be patient with them.\nAll these were what we were facing; no church hall and other things but attendance must prove that the church was growing.\nSee Also Christianity How Oyedepo's Living Faith Church Paid Graduate Pastors N38,000 Monthly — Another Pastor Opens Up"
  },
  {
    "headline": "40m Twitter users in Nigeria? Africa Check says it’s probably only 3m",
    "summarized_story": "No credible data supports the widespread claim that there are 40 million Twitter users in Nigeria, according to a report by Africa Check.\nAdvertisementThe fact-checking platform said publicly available data shows that the number of Twitter users in Nigeria is around 3 million.\nExperts told Africa Check that the pollster’s conclusion and methodology were faulty and cannot be used as the sample for the entire Nigerian population.\nWhen the fact-checking platform contacted Twitter to ask about how many users it had in Nigeria, Gareth Field, Twitter’s spokesperson, said: “We do not disclose such information externally.”To ascertain the number of Twitter users in Nigeria, Africa Check observed Statista’s list of the top 20 counties ranked by Twitter users.\nIn the report, Twitter is ranked as the country’s sixth most-used platform behind WhatsApp, Facebook, YouTube, Instagram, and Facebook Messenger."
  },
  {
    "headline": "40m Twitter users in Nigeria? Africa Check says it’s probably only 3m",
    "summarized_story": "No credible data supports the widespread claim that there are 40 million Twitter users in Nigeria, according to a report by Africa Check.\nAdvertisementThe fact-checking platform said publicly available data shows that the number of Twitter users in Nigeria is around 3 million.\nExperts told Africa Check that the pollster’s conclusion and methodology were faulty and cannot be used as the sample for the entire Nigerian population.\nWhen the fact-checking platform contacted Twitter to ask about how many users it had in Nigeria, Gareth Field, Twitter’s spokesperson, said: “We do not disclose such information externally.”To ascertain the number of Twitter users in Nigeria, Africa Check observed Statista’s list of the top 20 counties ranked by Twitter users.\nIn the report, Twitter is ranked as the country’s sixth most-used platform behind WhatsApp, Facebook, YouTube, Instagram, and Facebook Messenger."
  },
  {
    "headline": "'He supports, loves Igbo' -- Ohanaeze condemns IPOB's attack on Edwin Clark",
    "summarized_story": "Ohanaeze Ndigbo, apex Igbo socio-cultural organisation, has condemned the attack on Edwin Clark, Ijaw leader, by the Indigenous People of Biafra (IPOB).\nThe Pan Niger Delta Forum (PANDEF) had subsequently asked Igbo leaders to denounce the statement made by IPOB and apologise to Clark.\nAdvertisementIn a statement on Sunday, Alex Ogbonnia, national publicity secretary of Ohanaeze Ndigbo, described IPOB’s comment as youthful exuberance, saying Clark has contributed positively to the south-east region.\n“The attention of Ohanaeze Ndigbo Worldwide has been drawn to remarks by the spokesman of the Indigenous People of Biafra (IPOB),” Ohanaeze said.\n“Ohanaeze Ndigbo makes it abundantly clear that the Igbo extol old age with courtesy and reverence."
  },
  {
    "headline": "'He supports, loves Igbo' -- Ohanaeze condemns IPOB's attack on Edwin Clark",
    "summarized_story": "Ohanaeze Ndigbo, apex Igbo socio-cultural organisation, has condemned the attack on Edwin Clark, Ijaw leader, by the Indigenous People of Biafra (IPOB).\nThe Pan Niger Delta Forum (PANDEF) had subsequently asked Igbo leaders to denounce the statement made by IPOB and apologise to Clark.\nAdvertisementIn a statement on Sunday, Alex Ogbonnia, national publicity secretary of Ohanaeze Ndigbo, described IPOB’s comment as youthful exuberance, saying Clark has contributed positively to the south-east region.\n“The attention of Ohanaeze Ndigbo Worldwide has been drawn to remarks by the spokesman of the Indigenous People of Biafra (IPOB),” Ohanaeze said.\n“Ohanaeze Ndigbo makes it abundantly clear that the Igbo extol old age with courtesy and reverence."
  },
  {
    "headline": "Bandits release abducted students of Kaduna Baptist school",
    "summarized_story": "Bandits have released 28 of the abducted students of Bethel Baptist High School, Damishi, Kaduna, after 20 days in captivity.\nAdvertisementJoseph Hayab, Kaduna state chairman of the Christian Association of Nigerian (CAN), confirmed their release to TheCable on Sunday.\nA total of 121 students were abducted from their hostels by bandits on July 5.\nIsrael Akanji, president of the Nigerian Baptist Convention (NBC), had earlier said no ransom will be paid for the release of the students.\nEditor’s note: This report has been updated to reflect the number of students released."
  },
  {
    "headline": "CBN regulations holding back mobile money revolution in Nigeria",
    "summarized_story": "In Ghana, it would be an “anomaly” for a supermarket, small store, or business merchant to not use a mobile money service for transactions.\nNew agent and electronic money guidelines were released in 2014, allowing network operators to run mobile money services, with supervision from the banking regulator.\nUptake in mobile money services and financial inclusion have equally increased across the country.\nThe regulatory framework is one of the core reasons why mobile money uptake has been relatively slow in Nigeria.\n“The CBN recognises the importance of Mobile Network Operators in the operations of mobile money services and appreciates the criticality of the infrastructure they provide."
  },
  {
    "headline": "This app wants to simplify Twitter giveaways, without bank accounts",
    "summarized_story": "Let’s say I wanted to send a surprise ‘happy birthday’ cash gift to a friend; my first thought would be to ask for their bank account number.\nI would do this for people I know very well but also for someone I only know on social media.\n“Like sending money through email addresses using PayPal, Vendly hopes to replicate that using social media handles,” he said.\nLong-term, Vendly will help social media users monetize their social media presence, the CEO said.\nThe message states the amount sent; recipient inputs the bank account where they want the cash to go."
  },
  {
    "headline": "Hundreds of MTN, Vodacom towers damaged in South Africa unrest",
    "summarized_story": "Telecommunications infrastructure owned by several mobile network operators was severely damaged in the rampant looting and destruction of property that rocked South Africa last week.\nThe Independent Communications Authority of South Africa (ICASA) revealed on Tuesday, July 13, that the vandalism included more than 100 mobile network towers in some parts of the country.\nVirtually all network providers operating in South Africa reported disruption to service delivery.\nChildren are evacuated from a burning building in downtown Durban, South Africa.\nJust one of its network towers was vandalised within the Durban area but it did not affect service delivery to consumers."
  },
  {
    "headline": "Senegal to produce rapid Covid tests in tech deal with major biotech companies",
    "summarized_story": "The Pasteur Institute in Senegal will produce rapid antigen tests for diagnosing the coronavirus disease from early 2022 with the help of a new tech transfer agreement.\nAn antigen test is regarded as a suitable ‘first line of defense’ against the coronavirus disease for individuals who have symptoms.\nIt plans to make 2.5 million tests per month in 2022, according to the statement.\nHowever, the rapid antigen test deal involving the Pasteur Institute comes at a time when Senegal is grappling with soaring coronavirus cases.\nAccording to health ministry spokesman Mamadou Ndiaye, the West African nation was seeing an “unprecedented” surge in Covid infections."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "The Central Bank of Nigeria (CBN) has disclosed that it’ll launch the pilot scheme of its digital currency on October..."
  },
  {
    "headline": "Nigeria’s apex bank chooses open-source blockchain to run digital currency pilot on October 1, 2021",
    "summarized_story": "Share this article:The Central Bank of Nigeria (CBN) has disclosed that it’ll launch the pilot scheme of its digital currency on October 1, 2021.\nThe apex bank announced earlier on June 10, 2021, that it would launch a pilot scheme for its digital currency before the end of the year.\nHyperledger Fabric blockchainThe Hyperledger Fabric blockchain is a private and permissioned blockchain network designed by computer hardware company, International Business Machines Corporation (IBM).\nIn a Cointelegraph article on July 2, 2019, Stuart Popejoy, blockchain expert and founder of hybrid blockchain platform, Kedena, said that “Fabric’s architecture is far more complex than any blockchain platform while also being less secure against tampering and attacks.\nAdvertisementMeanwhile, CBN says Nigeria cannot be left behind when 80% of central banks globally are considering issuing a central bank digital currency (CBDC)."
  },
  {
    "headline": "Twitter’s downvote button, Cellulant’s licence approval, Convergence Partners’ $120m round",
    "summarized_story": "Today, I’m discussing:Twitter’s shiny new downvote buttonConvergence’ Partners’ $120m roundCellulant’s licence approval in TanzaniaTwitter is testing out a downvote buttonPhoto by Claudio Schwarz | @purzlbaum on UnsplashWhat happened?\nTwitter says while the downvote button will be visible, only the reply owner can know the exact number received.\nHowever, according to Twitter, this is not a dislike button and while it bears some resemblance to Reddit’s downvote button, it will not affect the order of replies.\nCellulant’s new approval will allow it connect to banks, online merchants, payment processors, merchants, state governments, and customers to meet their digital payment demands in Tanzania.\nConvergence Partners raises $120 millionSouth African tech investment firm, Convergence Partners, has raised $120 million to drive inclusion in Africa."
  },
  {
    "headline": "Google x Maliyo Games, Instagram and YouTube’s new features, and Clubhouse leaves beta",
    "summarized_story": "Mobile gaming: Per Business Wire, the mobile gaming market was worth $98 billion globally in 2020 and is expected to grow to $272 billion by 2030.\nAccording to Kevuru games, 59.9% of games were played on mobile in 2020, while 28.70% and 16.11% were played on PC and console, respectively.\nOn July 20, 2021, the company announced in a blog post that it was launching Sensitive Content Control.\nAccording to Instagram, sensitive content isn’t content that breaks the rules but could upset some users.\nOn July 20, 2021, YouTube announced it is rolling out a beta version of its new feature, Super Thanks."
  },
  {
    "headline": "How wrong use of the gavel ruins Nigeria’s democracy",
    "summarized_story": "Nigeria’s long journey to a consolidated democracy where there will be credible and transparent elections appears to be under threat.\nAccording to Wikipedia, a gavel is a small ceremonial mallet commonly made of hardwood, typically fashioned with a handle.\nHowever, the new Act in section 52 leaves the electronic transmission of election results at the mercy of INEC, which can decide when and where to transmit votes electronically or manually.\nOkechukwu moved that Clause 52 (2) be amended to read that: “Voting and transmission of results shall be by electronic transmission”.\nThe Deputy Speaker did not hide his opposition to electronic transmission of votes when he argued that the entire country was not yet covered by broadband and as such, there would be issues with electronic transmission of results."
  },
  {
    "headline": "Poverty and the psychology of ‘money rain’",
    "summarized_story": "In 2020, many argued the World Bank report that revealed that Nigeria had overtaken India as the World Poverty Capital, considering that India has the most people living in extreme poverty.\nBut the poor are also making an effort to shake hands with the rich, who rain money amid lack, hence the high level of crime in the society today.\nHe further noted that the implication of naira rain on Nigeria in the midst of abject poverty is obvious.\n“Some of those who rain money are their mates; all they need to do is find out how and where to get their own money.\n“You cannot close the poverty gap when inflation is rising every day, when the corrupt are getting away with their loot, when youths are seeing violence as a means to quick money."
  },
  {
    "headline": "Who invented Chapman?",
    "summarized_story": "The Chapman is known around Nigeria and in many parts of the world and it carries fond memories for many Nigerians.\nThe beginningsBefore I go any further, let me take you out of … the mystery: The Chapman drink was not created in Ikoyi Club and it was not created for or by a Mr. Chapman.\nThe Chapman was created by a man called Mr. Sam Alamutu who was later to become known as Apostle Samuel Alamutu of Ogun State.\nMr. Samuel AlamutuHow the Chapman spread across the worldAccording to his daughter Sola Alamutu, Ikoyi Hotel in Lagos was the first place the Chapman was created for the public.\nEverybody loved the Chapman and many British people did spread the gospel of the infamous drink.To set the record straight, let us clearly state here that the Chapman is a Nigerian invention created by Mr. Samuel Alamutu of Ogun State."
  },
  {
    "headline": "Investment in education a priority for my govt, Obaseki reassures – Nigerian Observer",
    "summarized_story": "Obaseki gave the assurance while addressing the newly elected Global President of the Eghosa Anglican Grammar School Alumni Association, Mr. Bernard Eboreime, who led other members of the association on a courtesy visit to the Government House, Benin City.\nThe governor, who is also an alumnus of the school, reassured his government’s support to help the school regain its lost educational values.\n“I am committed to ensuring that Eghosa Grammar School is repositioned as a premier Anglican Grammar School in this part of the country.\n“Let me also congratulate the new executive members and thank you for your support during my second term electioneering campaign.\nYou were one of the very vibrant and active groups that I saw posting messages and campaigning very actively for me."
  },
  {
    "headline": "EdoJobs to partner experienced fashion designers to boost skills devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government through the Edo State Skills Development Agency (EdoJobs) has said it will partner with experienced fashion designers in the state to boost skills development in the fashion industry.\nManaging Director of EdoJobs, Ukinebo Dare, in a chat with journalists in Benin City, said the partnership is aimed at boosting job creation opportunities for youths in the state.\nAccording to her, the state government is exploring different avenues to drive growth and development that would benefit more youths in the state.\nShe urged interested experienced fashion designers residing in the three senatorial districts of the state “to take hold of this opportunity to become major players in skills development and youth empowerment in their communities.\n“We welcome the submission of proposals in person to Edo Innovates Hub at 59 I.C.E Road, off Wire Road, Benin City,” she noted."
  },
  {
    "headline": "Voters’ apathy, logistics problem greet Ogun LG polls – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbeokuta – The Saturday local government elections in Ogun was largely characterised by low turnout of voters and logistic challenges at the early stage of the excercise in most council areas.\nApathy also played out in other council areas like the Ado-Odo/Ota and Ikenne council areas in spite of the fact that the electoral officers were on ground.\nCommenting, Mr Abdullahi Jabi, an Election Observer, told NAN that the exercise was peaceful and orderly in many of the polling booths.\n“For the areas we have covered so far, it has been peaceful, but there has been clear evidence of apathy.\nHe ascribed the situation to fear of insecurity and lack of faith by the electorate in the state electoral agency."
  },
  {
    "headline": "No person die of COVID-19 complications in UI- Management – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestIbadan – The management of University of Ibadan, Oyo State, says no member of staff or student of the institution died of COVID-19 complications as being purportedly reported in some quarters.\nAccording to him, the university management had earlier stated in the university’s periodic Bulletin of July 19 that there was need to adequately observe all the necessary COVID-19 protocols in the campus.\nHe said: “The management also urged members of the University of Ibadan community to keep to safety protocols.\nEach person must take direct responsibility of his/her health safety,” Oladejo said.\nAlso, the Coordinator, UI COVID-19 Emergency Response Committee, Prof. Victoria Adetunji, told NAN that the acting vice-chancellor never said we lost 10 people to COVID-19."
  },
  {
    "headline": "Again, FG extends NIN-SIM verification deadline",
    "summarized_story": "ADVERTISEMENTThe Federal Government has extended the deadline for National Identity Number (NIN)-Subscriber Identity Module (SIM) data verification to October 31.\nAccording to the officials, the extension is also to address low enrolments in schools and hospitals, as evidenced by enrolment statistics.\nAccording to them, the decision also followed a review of the progress of the exercise which indicates significant progress, hence the need to consolidate the gains of the enrolment and NIN-SIM verification process across the country.\n“As at July 24, 2021, there are over 5,500 enrolment systems within and outside the country and this will significantly ease the NIN enrolment process and subsequent linkage of NIN to SIM.\nMr Pantami appreciated Nigerians for their patience and compliance with Federal Government’s directive on the NIN-SIM registration."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Trial of Mazi Nnamdi Kanu: Ohanaeze names high powered observer delegation",
    "summarized_story": "The apex Igbo sociocultural group, Ohanaeze Ndigbo, has named a high powered observer delegation to monitor the trial of the leader of Indigenous People of Biafra (IPOB), Mazi Nnamdi Kanu.\nKanu who was arrested late last month in Kenya, under controversial circumstances, is currently facing trial before Federal High Court in Abuja for treasonable felony.\nHis trial continues on Monday, and ahead of the scheduled trial, President-general of Ohanaeze Ndigbo, Professor George Obiozor, has named a delegation to monitor proceedings.\nAmong those appointed are former Anambra State governor, Dr Chukwuemeka Ezeife, who is to lead the Ohanaeze delegation to the trial.\nOthers are the organisation’s National Legal Adviser, Bar Joseph Ojobu and Chief Goddy Uwazurike, both of whom will be the lawyers representing Ohanaeze on a watching brief."
  },
  {
    "headline": "Glo extends 22X value to all prepaid customers",
    "summarized_story": "Glo has announced the extension of its 22X Value offer to its customers on the pre-paid platform.\nThe 22X Value offer which was first launched in January offered subscribers who had not used their lines for 30 consecutive days 22 times value of every voice or data recharge from N100.\nGlobacom explained that the 22X offer is meant to allow customers to satisfy their browsing and talking needs from the same recharge.\nThey will also receive a bonus value of N2,100 for data and voice calls to all networks in Nigeria.\nDepending on the recharge amount, customers can enjoy as much as 5GB of bonus data and hundreds of bonus minutes Glo said."
  },
  {
    "headline": "We’re determined to ensure food sufficiently, job creation in Ogun – Gov Abiodun",
    "summarized_story": "Olakunle IdowuOgun State governor, Prince ‘Dapo Abiodun, yesterday said his administration is determined to make sure there is food in abundance in the state while people also live without fear.\nAbiodun added that part of his government’s initiative is also to create employment opportunities for the people especially the youth.\nA beneficiary, Ogunkola Gbemisola, while commending the state governor for providing them with different anchors for their various agricultural produce, noted that the agric scheme has helped in developing their economic worth.\nThe monarch called on the party candidates not to betray the trust of the people when they eventually get into office.\nResponding, Abiodun informed Alake of his administration’s decision to regenerate the state capital."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "BREAKING: 28 Abducted Bethel Baptist Students Regain Freedom",
    "summarized_story": "28 of the kidnapped 121 Bethel Baptist High School students have regained their freedom and are presently being reunited with their parents at the school premises amidst tears of joy from parents.\nDetials Later…ADVERTISEMENT"
  },
  {
    "headline": "BREAKING: 28 Abducted Bethel Baptist Students Regain Freedom",
    "summarized_story": "28 of the kidnapped 121 Bethel Baptist High School students have regained their freedom and are presently being reunited with their parents at the school premises amidst tears of joy from parents.\nDetials Later…ADVERTISEMENT"
  },
  {
    "headline": "BREAKING: Again, Federal Govt Extends NIN-SIM Verification Deadline",
    "summarized_story": "The federal government has approved the extension of the deadline for NIN-SIM data verification to October 31, 2021.\nA statement from the National Identity Management Commission (NIMC), a copy of which was made available to LEADERSHIP on Sunday, said the decision followed a review of the progress of the exercise which indicated significant progress, hence the need to consolidate the gains of the enrolment and NIN-SIM verification process across the country.\nAs at July 24, 2021, NIMC said there were over 5,500 enrolment systems within and outside the country and this would significantly ease the NIN enrolment process and subsequent linkage of NIN to SIM.\n“The Federal Government is also excited at the news that the use of NIN in the process of the Joint Admissions and Matriculation Board (JAMB) exam significantly reduced the challenge of exam malpractice,” he said.\nThe minister appreciated Nigerians for their patience and compliance with the federal government’s directive on the NIN-SIM registration exercise."
  },
  {
    "headline": "BREAKING: Again, Federal Govt Extends NIN-SIM Verification Deadline",
    "summarized_story": "The federal government has approved the extension of the deadline for NIN-SIM data verification to October 31, 2021.\nA statement from the National Identity Management Commission (NIMC), a copy of which was made available to LEADERSHIP on Sunday, said the decision followed a review of the progress of the exercise which indicated significant progress, hence the need to consolidate the gains of the enrolment and NIN-SIM verification process across the country.\nAs at July 24, 2021, NIMC said there were over 5,500 enrolment systems within and outside the country and this would significantly ease the NIN enrolment process and subsequent linkage of NIN to SIM.\n“The Federal Government is also excited at the news that the use of NIN in the process of the Joint Admissions and Matriculation Board (JAMB) exam significantly reduced the challenge of exam malpractice,” he said.\nThe minister appreciated Nigerians for their patience and compliance with the federal government’s directive on the NIN-SIM registration exercise."
  },
  {
    "headline": "ECOWAS Parliament To Deploy Information Technology Against Insecurity",
    "summarized_story": "The Parliament of the Economic Community of West African States (ECOWAS) is strategizing on how to increase the use of telecommunications and information technologies to address the lingering security challenges bedeviling the region as well as boost economic development.\nThis was disclosed at the weekend in a statement issued by the Communications Divisions of the Headquarters of the ECOWAS Parliament in Abuja ahead of the delocalized meeting of the parliament that will commence in Ghana on the July 27.\nAccording to the statement the Parliament is organizing the joint committee delocalized meeting under the theme: “the role of telecommunications and information technologies (TIT) in achieving regional development, peace, security and human rights”, from 27-31 July, 2021 in Winneba, Ghana.\nThe Joint Committee on Political Affairs, Peace, Security and the African Peer Review Mechanism (APRM) / Legal Affairs and Human Rights /Telecommunications and Information Technology (TIT) will lead delegation to the meeting.\nThe regional bloc has invested enormously to help member states ravaged by insurgency and terrorism to address the lingering crises, coordinate regional economic integration measures and boost people-to-people relationship."
  },
  {
    "headline": "Kidnapped Kaduna Baptist school students regain freedom",
    "summarized_story": "The remaining abducted students of Bethel Baptist High School, Kaduna have been released by bandits.\nThe students were kidnapped in the Early hours of July 5, 2021, around 2am at the school premises along the Kaduna – Kachia Highway, Damishi, Chikun Local Government Area of the state.\nThey had spent twenty days in the kidnappers’ den.\nThree of the students were reported to have escaped from the bandits, 118 students were still with the bandits with a ransom of N60million dangling on their heads.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Kidnapped Kaduna Baptist school students regain freedom",
    "summarized_story": "The remaining abducted students of Bethel Baptist High School, Kaduna have been released by bandits.\nThe students were kidnapped in the Early hours of July 5, 2021, around 2am at the school premises along the Kaduna – Kachia Highway, Damishi, Chikun Local Government Area of the state.\nThey had spent twenty days in the kidnappers’ den.\nThree of the students were reported to have escaped from the bandits, 118 students were still with the bandits with a ransom of N60million dangling on their heads.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Olympics: Barty suffers shock defeat in first round",
    "summarized_story": "World number one Ashleigh Barty crashed out of the Olympics women’s singles tennis tournament in the opening round on Sunday, losing 6-4, 6-3 to Spain’s Sara Sorribes Tormo.\nBarty, the reigning Wimbledon champion, dropped serve twice in each set as 48th-ranked Sorribes Tormo made just five unforced errors to the Australian’s 27 to earn a shock win.\n“It’s an amazing feeling, I still can’t believe it,” said Sorribes Tormo, who will go on to face France’s Fiona Ferro in the second round.\nIt’s something that I’ve been dreaming of all my life, being here and even more so beating the world number one.\nBarty could potentially come up against Sorribes Tormo again in the quarter-finals of that competition."
  },
  {
    "headline": "Olympics: Barty suffers shock defeat in first round",
    "summarized_story": "World number one Ashleigh Barty crashed out of the Olympics women’s singles tennis tournament in the opening round on Sunday, losing 6-4, 6-3 to Spain’s Sara Sorribes Tormo.\nBarty, the reigning Wimbledon champion, dropped serve twice in each set as 48th-ranked Sorribes Tormo made just five unforced errors to the Australian’s 27 to earn a shock win.\n“It’s an amazing feeling, I still can’t believe it,” said Sorribes Tormo, who will go on to face France’s Fiona Ferro in the second round.\nIt’s something that I’ve been dreaming of all my life, being here and even more so beating the world number one.\nBarty could potentially come up against Sorribes Tormo again in the quarter-finals of that competition."
  },
  {
    "headline": "Another 28 kidnapped students of Kaduna Baptist school released",
    "summarized_story": "Bandits have released another 28 students of Bethel Baptist High School, Damishi, Kaduna, who were abducted from their school 20 days ago.\nA total of 121 students of the school were kidnapped by bandits early this month at the premises of the school.\nHowever, the Chairman, Christian Association of Nigeria (CAN), Kaduna State Chapter, Joseph Hayab told TheCable that additional 28 students had been freed by the bandits, while the remaining were still being awaited.\nArmed men had stormed the school on July 5, shooting sporadically as they kidnapped 121 students and leaving two security guards in the defensive struggle.\nThe abduction was the fourth mass abduction in the state over the past six months."
  },
  {
    "headline": "Buhari, Lai Mohammed dragged to court over ‘gag order’",
    "summarized_story": "Socio-Economic Rights and Accountability Project (SERAP) and Centre for Journalism Innovation and Development have filed a lawsuit against President Muhammadu Buhari and Mr. Lai Mohammed, Minister of Information and Culture.\nSERAP asked the court to “declare illegal the gag order stopping journalists and broadcast stations from reporting details of terrorist attacks and victims, as the order violates media freedom and Nigerians’ freedom of expression and access to information.”Joined in the suit as Defendant is the National Broadcasting Commission (NBC).\nThe suit followed the directive by NBC asking journalists, television and radio stations in Nigeria to stop “glamourising and giving too many details on the nefarious activities of terrorists and kidnappers” during their daily newspaper reviews.\nThe NBC is using ‘national security’ as a pretext to intimidate and harass journalists and broadcast stations, and to violate Nigerians’ rights to freedom of expression and access to information.”SERAP and PTCIJ are also arguing that: “Factual reporting on the growing violence in some parts of Nigeria is a matter of public interest.\nAll other legislations in this country take their hierarchy from the provisions of the Constitution."
  },
  {
    "headline": "10,000 passengers dodge COVID-19 test, cases balloon at entry points",
    "summarized_story": "The travellers came into Nigeria through the premier Murtala Muhammed International Airport, Lagos and Nnamdi Azikiwe International Airport in Abuja.\nThe agency gave the alert Sunday morning, as it also reported a decline in COVID-19 cases.\nStates that recorded fresh infections include Oyo State (10), Abia (7), Ogun (7), Ekiti State (5), Delta (2) and Plateau (1).\nThree states, including Kaduna, Kano and Sokoto States recorded zero cases.\nNigeria’s COVID-19 active cases stood at 3,975 and death toll 2,132."
  },
  {
    "headline": "BREAKING: Bandits release Kidnapped students of Kaduna Baptist School",
    "summarized_story": "Bandits have released students of the Kaduna Baptist School after holding them in captivity for 20 days.\nOver 100 students were kidnapped by the daredevil gunmen on July 5th after they gained access into Bethel Baptist Secondary School, Kujuma in Chikun LGA of Kaduna State.\nAccording to Cable, their release was confirmed by the Kaduna state chairman of the Christian Association of Nigeria, CAN, Mr. Joseph Hayab.\nMore to come…"
  },
  {
    "headline": "Nnamdi Kanu’s Trial: Be Prepared To Kill Us, We Will Flood Abuja- IPOB",
    "summarized_story": "Nnamdi Kanu, who was reportedly arrested in Kenya was extradited to Nigeria few week ago and kept in the custody of the Department of State Services, DSS.\n“The federal government of Nigeria has no right to stop IPOB or Biafrans from coming to Abuja to witness the court proceedings or to show solidarity to our leader, Mazi Nnamdi Kanu.\n“One thing they forget is that it’s not about Nnamdi Kanu, it’s about Biafra.\nThe issue of Biafra agitation has since gone beyond Nnamdi Kanu.\n“The truth is that not just IPOB members but thousands of Biafrans and their sympathizers will flood Abuja on Monday to show solidarity to our leader, Nnamdi Kanu."
  },
  {
    "headline": "How Oyedepo’s Living Faith Church Paid Graduate Pastors N38,000 Monthly — Another Pastor Opens Up",
    "summarized_story": "Another pastor, who was one of the 40 pastors recently fired by Bishop David Oyedepo’s Living Faith Church, told how pastors who were graduates were paid N38,000 per month.\nAccording to the pastor, the gross income was N53,000, but they only received N38,000 because the rest was supposed to cover pension and housing allowance.\nSomeone went online to post lies in support of the church that the recently sacked pastors were being paid N80,000 and house rent of N150,000.\n“I will just say a little here; no employed pastor was paid N80,000 in the church.\nIt was when they sacked us that they started paying into the pension accounts."
  },
  {
    "headline": "BREAKING: Again, FG Extends NIN-SIM Verification Deadline To October 31",
    "summarized_story": "The deadline for NIN-SIM data verification has been extended by the federal government until October 31, 2021.\nThe Nigerian Communications Commission’s Director of Public Affairs, Ikechukwu Adinde, and the Nigeria Identity Management Commission’s Head of Corporate Communications, Kayode Adegoke, announced this in a joint statement on Monday titled “FG Extends NIN-SIM verification deadline to October 31, 2021.”FG had previously granted a postponement of the NIN-SIM data verification deadline until July 26, 2021.\nThe Director, Public Affairs Nigerian Communications Commission, Ikechukwu Adinde; and the Head, Corporate Communications, Nigeria Identity Management Commission, Kayode Adegoke, disclosed this in a joint statement on Monday titled ‘FG approves July 26 as NIN-SIM verification deadline as enrolment systems increase to 5,410 .’The statement read, “The Federal Government has approved the extension of the deadline for NIN-SIM data verification to October 31, 2021.\n“It also followed a review of the progress of the exercise which indicated significant progress hence the need to consolidate the gains of the enrolment and NIN-SIM verification process across the country.\n“As of July 24th, 2021, there are over 5,500 enrolment systems within and outside the country and this would significantly ease the NIN enrolment process and subsequent linkage of NIN to SIM."
  },
  {
    "headline": "Matsalar rashin aiki ta fi ƙamari a mulkin Buhari – Bankin Duniya",
    "summarized_story": ""
  },
  {
    "headline": "An kama ma’aurata kan shirya garkuwar ƙarya a Neja",
    "summarized_story": ""
  },
  {
    "headline": "Laifin waye taɓarɓarewar surukuta a ƙasar Hausa?",
    "summarized_story": "A zamanin da, ba komai sai kunya da tsakanin surukai a ƙasar Hausa.\nHaka ita uwar mijin ba ta yarda surukar ta raina ta ba.\nBa shakka wannan mataki ne da ba a taɓa gani ba a ƙasar Hausa.\nWato ma’ana da ma dukkan surukan da suke cin mutunci ko raina juna da ma can ba mutanen kirki ba ne masu mutunci ba.\nDomin kuwa za ta yi ta wahala a kan abinda ba ta isa ta hana ba.Domin uwar nan tasa tare kika gansu."
  },
  {
    "headline": "Gwamnatin Zamfara ta ba da tallafin miliyan N15 ga iyalan ’yan sanda 13 da aka kashe",
    "summarized_story": ""
  },
  {
    "headline": "Job racketeering: NCCSALW cautions job seekers against fraudsters -NigPilot",
    "summarized_story": "The National Centre for the Control of Small Arms and Light Weapons (NCCSALW) , on Friday, cautioned job seekers to beware of Job racketeers and fraudsters parading selves as a recruitment agent of the agency, saying that NCCSALW is currently not recruiting.\nIt also disclosed that the fraudsters involved in the illegal recruitment, fraudulent inducement and operation of fake websites are targeting unsuspecting members of the public.\n“The National Centre for the Control of Small Arms and Light Weapons is currently not recruiting and has not engaged the services of any individual or recruitment agents to recruit on its behalf.\n“For the avoidance of doubt, the information on recruitment circulating on social media is fake and did not emanate from the Centre.\nConsequently, job seekers are advised to disregard the same."
  },
  {
    "headline": "NASS insensitive to concerned Nigerians on PIB, Electoral Act – Senator Dickson -NigPilot",
    "summarized_story": "Senator representing Bayelsa West District in the National Assembly, Seriake Dickson, has described the recently passed Petroleum Industry Bill, PIB , and the Electoral Act (Amendment) Bill, 2021 by the parliament as offensive and insensitive to concerned Nigerians.\nDickson, who addressed journalists yesterday in Abuja over the perceived shortcomings in the two bills, however, warned that the approved three percent Host Communities Trust Fund in the PIB may lead to unrest in the Niger Delta region.\n“Might and majority do not build a diversified nation like Nigeria, but presence of justice, fairness.\nHe therefore appealed to President Muhammadu Buhari not to assent to the bill, but send it back for more consultation and required Inclusiveness in its proposals.\n“Fortunately a window of striking out that amendment is already provided by the House of Representatives which adopted the clause as originally proposed."
  },
  {
    "headline": "Finally, Nigeria takes delivery of six Super Tucano aircraft -NigPilot",
    "summarized_story": "The statement added that top government functionaries and Service Chiefs received the modern platforms from the manufacturer.\nRecall that the Nigerian Air Force (NAF) on 15, July 2021, in a statement announced that the first batch of six A-29 Super Tucano aircraft departed the United States of America on Wednesday, 14 July 2021 enroute Nigeria.\nThe second batch of the remaining six aircraft brand would be delivered towards the end of the year.\nMilitary experts believe that the arrival of the six A-29 Super Tucano aircraft would change the paradigm in the war against insurgency and anti banditry operations.\n“With the delivery of the modern aircraft to government today, there is end in sight in the over one decade war against insurgency and terrorism,” they said."
  },
  {
    "headline": "Nigerian Army immortalize late COAS, Ibrahim Attahiru -NigPilot",
    "summarized_story": "The Nigerian Army on Thursday immortalized the immediate past Chief of Army Staff (COAS), late Lt Gen Ibrahim Attahiru who died in an air mishap in Kaduna.\nThe Chief of Army Staff (COAS) Lieutenant General Faruk Yahayadisclosed that the complex was christened after the late Chief of Army Staff, Lieutenant General Ibrahim Attahiru, to honor him for his contribution and sacrifice towards the upliftment of the Nigerian Army.\nThe structure, as described by the cantonment maintenance officer, Major Suleiman, has the capacity to accommodate eight staff officers and other supporting staff.\nThe new office accommodation consists of six medium size en-suite offices, two executive size en-suite offices, two Personal Assistants’ offices, as well as two offices for administrative staff.\nDignitaries present at the occasion were the Chief of Operations Army, Major General Olufemi Akinjobi, Theatre Commander OPHK, Major General Christopher Musa, Provost Marshal Army, Major General Olumuyiwa Aiyenigba, Chief of Military Intelligence (Army) Brigadier General Danladi Salihu, Acting General Officer Commanding 7 Division/Commander Sector 1 OPHK, Brigadier General Abdulwahab Eyitayo, Component Commanders OPHK and Principal Staff Officers, amongst others."
  },
  {
    "headline": "Kaduna School Abduction: 28 More Students Regain Freedom",
    "summarized_story": "﻿28 more abducted students of the Bethel Baptist Secondary School in Chikun Local Government Area of Kaduna State have regained their freedom.\nThe students were found inside the Tsoho Gaya Forest in Chikun Local Government Area of the state in the early hours of Sunday.\n121 students of Bethel Baptist secondary school in Chikun local government area of Kaduna state were abducted from their hotels by bandits on July 8.\nThe bandits later demanded a ransom of ₦60 ransom for the release of the students.\nAt the school, parents hold daily hours-long prayers and vigils and call for President Muhammadu Buhari to help free the children."
  },
  {
    "headline": "FG Extends NIN-SIM Verification Deadline To October",
    "summarized_story": "The Federal Government has approved the extension of the deadline for the National Identification Number (NIN)-SIM data verification to October 31.\nThis was disclosed in a statement jointly signed by the Head, Corporate Communications, Nigeria Identity Management, Mr Kayode Adegoke and Dr. Ikechukwu Adinde of the Nigerian Communications Commission, on Saturday.\nIt also followed a review of the progress of the exercise which indicated significant progress hence the need to consolidate the gains of the enrolment and NIN-SIM verification process across the country.\n“As at July 24th, 2021, there are over 5,500 enrolment systems within and outside the country and this would significantly ease the NIN enrolment process and subsequent linkage of NIN to SIM,” the statement read.\nHe thanked Nigerians for what he described as their patience and compliance with the directive on the NIN-SIM registration exercise so far."
  },
  {
    "headline": "Low Turnout As LG Elections Hold In Lagos, Ogun",
    "summarized_story": "Many eligible voters failed to turn up as local government elections were held in Lagos and Ogun states on Saturday.\nIn Ogun State, voting had to be extended by one hour to make up for the late arrivals.\nLagos State Governor Babajide Sanwo-Olu commended the voting process in the Ikoyi area of Lagos where he cast his vote.\nLateness, poor Covid protocolsIn Ogun state, at least 12 political parties vied for votes.\n‘Necessary extension’In Ogun State, the election was extended by one hour over the late arrival of election materials."
  },
  {
    "headline": "Twelve Years of Terror: A Timeline Of The Boko Haram Insurgency",
    "summarized_story": "11 August 2013: Boko Haram kills 44 worshipers at a mosque in Konduga, Borno.\n﻿26 February 2014: Boko Haram murders at least 59 boys at the Federal Government College in Buni Yadi, Yobe state.\nMay 2015: Boko Haram renames itself the Islamic State’s West Africa Province (ISWAP)9 September 2015: The Nigerian military says it has destroyed all known Boko Haram terrorists’ camps and cells in the North-East.\n23 February 2021: Boko Haram kills 10 people in Maiduguri using rocket-propelled grenades.\nJune 2021: Boko Haram and ISWAP reportedly unite and pledge allegiance to one Aba Ibrahim Al-Hashimiyil AlKhuraishi."
  },
  {
    "headline": "Osaka Makes Winning Return At Tokyo Olympics",
    "summarized_story": "Japan’s Naomi Osaka, the star of the Tokyo Olympics opening ceremony, began her quest for gold Sunday with a 6-1, 6-4 win over China’s Zheng Saisai in her first match since taking a break for mental health reasons.\nThe second-seeded Osaka, the favourite for gold following the shock first-round exit of Ashleigh Barty, will play Switzerland’s Viktorija Golubic in the last 32.\nAustralian Open champion Osaka had not played since May, when she walked out of the French Open saying that media commitments were harming her mental health.\nOsaka, who was chosen to light the Olympic cauldron on Friday, is attempting to become her country’s first Olympic tennis champion."
  },
  {
    "headline": "Kaduna: Another batch of 28 Abducted Bethel Baptist College Students Regain Freedom",
    "summarized_story": "At least 28 Students abducted from Bethel Baptist school in Chikun Local government area in Kaduna state have been released.\nSome of the students’ parents told TVC News that the bandits were paid a ransom before the students were released.\nIt will be recalled that armed bandits seized 121 students from Bethel Baptist College in Chikun Local Government Area on July 5th, when they burst into the school and shot randomly to create panic.\nAdvertisementTwo security operatives were killed while trying to rescue the students.\nTwo students were rescued by security operatives July 21 while another was released by the bandits due to poor health condition."
  },
  {
    "headline": "Ogun Council Poll: APC wins all seventeen LGAs",
    "summarized_story": "The All Progressives Congress candidates in Ogun State have won all seventeen local government areas declared by the State Independent Electoral Commission.\nThe chairman of the electoral commission, Babatunde Osinbodu made this known in Abeokuta.\nHe noted that results from the remaining three local governments are being expected, but candidates with the highest number of votes from seventeen local government areas have been declared winners, elected and returned, having complied with the requirements of the law."
  },
  {
    "headline": "Damaged Air Peace Plane evacuated from Ilorin Airport’s runway",
    "summarized_story": "An aircraft in the Air Peace fleet has been evacuated from the Ilorin International Airport after its tyre busted shortly after landing at the Airport on Friday.\nReprieve, however, came the way of the airline operators and passengers on Saturday as the Air Peace plane was evacuated from the runway of the airport.\nArik Air and Overland airlines had on Friday cancelled their flight schedules from Abuja to Ilorin as well as Ilorin-Lagos.\nAdvertisementThe incident left so many passengers who were waiting to board the Air Peace flight to Lagos at 11am on Friday stranded.\nMost passengers, it was gathered resolved to travel by road why others returned home for fear of bad road network and insecurity."
  },
  {
    "headline": "Shanghai Cancels Flights as Typhoon In-Fa Lashes Eastern China",
    "summarized_story": "Two international airports in the Chinese city of Shanghai have cancelled all flights and authorities banned outdoor activities as Typhoon In-Fa lashed eastern China with high winds and heavy rains.\nHundreds of flights at Shanghai Pudong and Shanghai Hongqiao airports were canceled and more were expected to be canceled on Monday, state TV reported on its website.\nTrain service to Ningbo, a port city south of Shanghai, was also suspended, according to state TV.\nSchools, markets and businesses in Zhejiang province were ordered earlier to close.\nState TV said a ship lock in Nantong, which abuts Shanghai to the north, stopped releasing vessels into the Yangtze River."
  },
  {
    "headline": "‘Out Bolsonaro!’: More Protests in Brazil Over Covid Crisis",
    "summarized_story": "Protesters have taken to the streets across Brazil once more to demand far-right President Jair Bolsonaro step down over his government’s handling of the coronavirus pandemic as well as recent corruption allegations.\nThe far-right leader is under political pressure after questions surfaced about alleged irregularities in his government’s coronavirus vaccine procurement process, as well as accusations of past corruption.\n“What we have is a continuous loss of political support for the president,” Claudio Couto, a political scientist at the Getulio Vargas Foundation in Brazil, told Al Jazeera.\nCouto said while political will to impeach Bolsonaro is rising, the president retains considerable support in Congress.\nTo date, 17 percent of the Brazilian population is considered fully vaccinated while 44 percent have received the first of two jabs."
  },
  {
    "headline": "Tokyo Olympics: Tunisia’s Hafnaoui Wins Shock Swimming Gold",
    "summarized_story": "Tunisian swimmer Ahmed Hafnaoui took a shock gold medal in the men’s 400m freestyle on Sunday.\nIt was Tunisia’s fifth-ever gold – and third in swimming.\nIn 2019, he told Tunisian outlet La Presse he was aiming to win his first gold medal at the 2024 Olympic Games in Paris.\nHafnaoui will have a second shot at gold as he competes in the 800m freestyle, with heats starting on Tuesday.\n“I couldn’t go to the Rio Olympics, so for the past five years, this became a big dream for me."
  },
  {
    "headline": "Tokyo Olympics: Tennis World Number One Barty Stunned By Sorribes Tormo in First Round",
    "summarized_story": "World number one Ashleigh Barty was stunned by Sara Sorribes Tormo of Spain in the first round of women’s Olympics singles in Tokyo.\nAustralian Barty, who won her second Grand Slam title at Wimbledon in July, cut a frustrated figure in her 6-4 6-3 loss to 48th-ranked Sorribes Tormo.\nShe put in an error-strewn performance against Sorribes Tormo, making 55 unforced errors to the Spaniard’s 13.\n“It’s something I’ve been dreaming all my life, being here and, even more, beating a number one,” Sorribes Tormo said.\nSpain’s Carla Suarez Navarro claimed her first singles victory since her recovery from cancer as she beat Tunisia’s Ons Jabeur 6-4 6-1."
  },
  {
    "headline": "Thousands Protest in France, Italy, UK and Australia Amid Global Anger Against Covid Restrictions",
    "summarized_story": "“Freedom, freedom”, chanted demonstrators in France, carrying placards denouncing “Macron, Tyrant”, “Big Pharma shackles freedom” or saying “No to the pass of shame”.\nPeople in Rome, Naples and Turin chanted “freedom” and “down with the dictatorship” over plans for the so-called “green pass”.\nThe certificate will be needed from early next month to eat in restaurants and visit cinemas among other indoor activities.\nThousands of people have also protested in London, against what they describe as an erosion of their civil liberties.\nSeparately, in Indonesia and the UK, governments have pressed ahead with the easing of restrictions even in the face of surging infections."
  }
]