[
  {
    "headline": "Strike: FG, ASUU to resume talks next week",
    "summarized_story": "The Federal Government and the striking Academic Staff Union of Universities would resume talks next week with a view to ending the prolonged closure of public universities.\nHe assured that the government was tackling all the disputes in education sector holistically, knowing fully well that none of the unions could function effectively without the other union.\nThat is why the health sector is quiet.\nBut the education unions don’t take advantage of my open door policy.\nWhen I finish with you today, I will continue with ASUU next week."
  },
  {
    "headline": "Pictorial: Atiku meets PDP stakeholders in Lagos",
    "summarized_story": "Former Vice President, Atiku Abubakar, had a meeting with the leaders and delegates of the Peoples Democratic Party in Lagos.\nAtiku, on his Instagram page late Friday, shared pictures from the “fruitful meeting”, which was geared towards the 2023 general elections.\nHe captioned the photos, “I had a fruitful meeting with leaders and delegates of the PDP in Lagos State.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "I’m now expensive, Portable says after UK trip",
    "summarized_story": "Singer, Habeeb Okikiola, popularly known as Portable, on Friday, declared himself a “superstar” and also said he is now rich and “expensive”.\nThe PUNCH reports that popular socialite and businessman, Emeka ‘E-Money’ Okonkwo, sponsored Portable to the United Kingdom.\nAfter arriving in the UK, Portable took to his Instagram page to share photos and videos of himself and the socialite at the airport.\nI’m now expensive; expensive than your cars and houses.\nI won’t lie, I’m not poor anymore.”View this post on Instagram A post shared by Dr Zeh (@portablebaeby)Copyright PUNCH."
  },
  {
    "headline": "Regulate migration of nurses, midwives to reduce brain drain, NANNM tells FG",
    "summarized_story": "*Seeks insurance coverage for nurses, and midwives due to exposure to hazardsBy Joseph ErunkeABUJA–THE National Association of Nigeria Nurses and Midwives, NANNM, has called on the federal government to regulate the migration of nurses and midwives in the country, saying it was a major way of reducing the brain drain which it noted, has“impacting negatively on the Nigeria health sector.”This was as it appealed to the government to provide insurance coverage for nurses and midwives due to exposure to hazards.\nThe nurses’ association also urged the federal government to create Department of Nursing Services to allow for expanded professional roles of members.\nWhile noting that,”Motivation is an essential component of performance which is fundamental to driving every human function”, the organisation said:” The government and stakeholders – Federal Ministry of Health, Ministry of Labour and Employment, Office of Head of Civil Service of the Federation, NSIWC, IPPIS office, etc., are called toinvolve nurses and midwives as policy decision-makers”, it said.\nIt tasked the government to “invest in the nursing workforce and consider special salary package for nurses (NSS) to address brain just as it said the government should, “Employ more nurses and midwives to improve workforce so as to reduce maternal and child morbidity and mortality rates in the country.\n“The Federal Ministry of Health, FMOH is requested to address the issue of allocation of intern nurses,” it further said."
  },
  {
    "headline": "2023: SDP, a viable option to APC, PDP misrule — Adewale",
    "summarized_story": "But Adewale, in his reaction, wondered why those claiming to be members of the SDP would tell hopefuls not to fly the party’s flag.\nThe Chairman said that ” We, therefore, take strong exceptions to the false innuendo being passed around by expelled members of our party.\n“Nigerians are beginning to regard the SDP as a viable option to the two major political parties that have ruled the country since 1999.\nThe party’s Chairman also took exception to the attack on the party’s National Secretary, Dr Olu Agunloye by the expelled members at the Ibadan meeting.\nHe noted that their “reckless and baseless allegations against the National Secretary is unfortunate and an insult to our Leader’s hard-earned reputation which he has strongly maintained."
  },
  {
    "headline": "Colette Otusheso unveils ‘The Phoenix Project’",
    "summarized_story": "“Our society is ûlled with a large pool of resourceful, creative, and energetic young people seeking opportunities to advance and build rewarding careers borne out of passion.”The above assertion by Colette Otusheso, Chief Executive Ofûcer of Nigeria’s leading digital, lifestyle and entertainment platform, Accelerate, rings true.\nTherefore, “The Phoenix Project”, an exciting learning platform aimed at expanding the creative potential of Nigeria’s youthful population was unveiled last weekend.\nREAD ALSO:The Phoenix Project covers twelve knowledge areas grouped into three bundles; Film and Production, Business of Entertainment, and Social Media for Business.\nAt the advanced level, high-achieving individuals will have access to the Phoenix Den, a seed fund designed to help participants soar and expand their creative endeavours.\nThe ûrst of its kind in Nigeria, facilitators include Kemi Lala Akindoju, Amaka Agbakoba and Uche Ugo."
  },
  {
    "headline": "Pomp, colour as Osinbajo graces Durbar Festival",
    "summarized_story": "“Not only is the Kano Durbar festival a fantastic spectacle from a city of firsts,but it is also a symbol of Nigeria’s diverse and beautiful cultures.”Those were the words of the Vice President Yemi Osinbajo, SAN on Tuesday evening at the Royal Durbar organised by the Kano Emirate Council to commemorate the 2022 Eid-el-Fitr celebrations.\nThe festival which held from the 2nd to the 5th of May 2022 is the largest procession of colourful horses in the world.\nIt dates back to the 14th century in Kano, the largest city in Northern Nigeria.\nProf. Osinbajo who was a special guest, commended the organisers and participants and also prayed for the prosperity of the city and its inhabitants.\nThe Vice President was accompanied on the visit by Senator Kabiru Gaya, House of Representatives Member Hafiz Kawu, Special Adviser on Infrastructure, Ahmad Zakari, and Alwan Hassan among others."
  },
  {
    "headline": "IPOB not a proscribed organization in UK, says British High Commission in Nigeria",
    "summarized_story": "By Nwafor SundayBritish High Commission in Nigeria has faulted reports that UK Government has added the Indigenous People of Biafra, IPOB, to the UK’s list of terrorist groups.\nThis is coming a day after it was reported that UK sought to exclude IPOB members who have committed human rights abuses from its asylum program.\nClarifying its message, British High Commission in Nigeria in a statement made available to newsmen opined: “We are aware of inaccurate reporting circulating in the media and online that the UK Government has added the Indigenous People of Biafra (IPOB) to the UK’s list of terrorist groups or organisations banned under UK law.\nThe Indigenous People of Biafra (IPOB) is not a proscribed organisation in the UK.\nCPINs provide country of origin information (COl) and analysis of COI for use by UK Government decision-makers handling particular types of protection and human rights claims."
  },
  {
    "headline": "ICC prosecutor visited Buhari after shunning letters on Christians’ persecution in Nigeria – CAN",
    "summarized_story": "The Christian Association of Nigeria (CAN) has expressed its displeasure with the International Criminal Court (ICC) prosecutor, Karim Khan.\nKhan, who was in Nigeria a fortnight ago, held talks with President Muhammadu Buhari and Vice President Yemi Osinbajo at the State House in Abuja.\nIn a statement on Friday, CAN General Secretary, Joseph Daramola said the body wrote to Khan twice in 2021 to engage him on religious violence affecting Christians.\nThe statement noted that for many years, the Christian community has borne the brunt of the religious violence in Africa’s biggest nation.\nNoting that the search for justice and redress for “persecuted and brutalized Christians” will not stop, the body said it remained willing to engage Khan and his office."
  },
  {
    "headline": "2022 UTME: JAMB issues stern warning to candidates",
    "summarized_story": "The Joint Admission and Matriculation Board (JAMB) has warned candidates writing the 2022 Unified Tertiary Matriculation Examination (UTME) to ensure punctuality as it would not alter its timetable for any candidate.\nJAMB started UTME 2022 for 1,761,338 candidates that successfully registered for the examination in 755 registered computer based centres.\n“If your child will be writing the JAMB exam this weekend, especially those for the 7a.m.\nOnce the exams start, no student will be allowed into the examination hall, hence, early arrival is important,” he warned.\nHe urged parents to take their ward to the venue of their examination as early as possible to avoid the risk of not writing the examination due to lateness."
  },
  {
    "headline": "2023: Court orders PDP not to tamper with Enugu delegates’ list",
    "summarized_story": "The order will subsist until the hearing of the Motion on Notice filed on 6/5/2022 in respect of the same issue.\nThe motion, dated 4/5/2022 and filed on the 6th day of May, 2022, was brought pursuant to Order 39 Rule 3 of the High Court Rules of Enugu State, 2020, and under the inherent jurisdiction of the Honourable Court.\nRecall that the 5-man Electoral Committee from the National Secretariat of the PDP described the April 30, 2022 ward congresses in Enugu State, which were monitored by officials of the Independent National Electoral Commission (INEC), as peaceful, transparent and credible.\nThe Chairman added that the electoral processes were well organized, and commended the Governor Ifeanyi Ugwuanyi-led PDP leadership in Enugu State for the peaceful outcome of the ward congresses in the state.\nHe disclosed that the panel will submit the names of those who emerged winners from the ward congresses to the National Secretariat in Abuja, stressing that “nobody can change delegates who emerged from the exercise”."
  },
  {
    "headline": "FCDA blames developers for flood in Abuja",
    "summarized_story": "The Executive Secretary of the Federal Capital Development Authority, Shehu Ahmad, has blamed developers in Abuja for floods in the city.\nAhmed disclosed that all houses built along flood plains in the city would be demolished.\nAhmad made this known during the visit of the management of the Federal Capital Territory Emergency Management Agency to his office.\nFEMA’s spokesperson, Nkechi Isa said the agency will work with FCDA to remove all illegal developments distorting master plans along flood plains.\n“Noting that unscrupulous developers were erecting structures in undesignated areas, thereby distorting the master plan, the Executive Secretary vowed that such buildings would be demolished."
  },
  {
    "headline": "Airlines to shut down operations from Monday as aviation fuel hits N700",
    "summarized_story": "The Airline Operators of Nigeria, AON, has announced plans to shut down operations nationwide.\nAON said the shutdown would take effect from Monday, due to the increase in the price of aviation fuel which cost N700 per litre.\nSarina lamented that Jet A1 has shot up the cost of operations to over 95 percent, thereby, causing hardship on passengers.\n“Overtime, aviation fuel price (JetA1) has risen from N190 per litre to N700 currently.\n“While aviation fuel worldwide is said to cost about 40% of an airline’s operating cost globally, the present hike has shut up Nigeria’s operating cost to about 95%."
  },
  {
    "headline": "Sanwo-Olu’s second term and MURIC’s Jaguda logic",
    "summarized_story": "Issues affecting Lagos State naturally bothers me.\nThere is a Lagos side of me which I should say has had a certain level of influence in my thinking.\nLagos for many then and now was what I will call the poster boy of tolerance.\nThe professor of Arabic and Islamic Studies is wondering why Governor Babajide Sanwo-Olu is seeking a second term and believes that Lagos should have a Muslim as governor.\nLet me state that irrespective of what anyone thinks Governor Sanwo-Olu is entitled to seek a second term."
  },
  {
    "headline": "Tambuwal: Nigeria inching towards failed state",
    "summarized_story": "The Sokoto State Governor, Aminu Tambuwal has observed that Nigeria is inching towards a failed state, saying that the country has never had it so bad.\nTambuwal and Hayatu-Deen, who are presidential aspirants of the Peoples Democratic Party (PDP) made the observations at separate fora in Abuja.\nThe general summation of the situation of the country is that we are inching towards a failed state.\nI am not saying that Nigeria is already a failed state, but we are inching towards that.\nOn his part, Hayatu-Deen attributed the general state of insecurity to the nation’s collapsed economy."
  },
  {
    "headline": "2023: Is Ayade waging war by proxy?",
    "summarized_story": "Cross River State governor, Ben Ayade, is one of the numerous aspirants who have declared their intention to run for the presidency at the 2023 general elections under the platform of the ruling All Progressive Congress (APC).\nHe announced his intention shortly after meeting with President Muhammadu Buhari at Aso Villa in Abuja last Tuesday.\nIt was further gathered that the governor may have perfected a plan to keep the APC ticket for the senatorial district within his reach while he continues his presidential chase.\nSources within the party claimed that the desire of the governor is to return to the senate.\nOf course, if he is not given the nod by the party, he will have the senate ticket as planned,’ a party leader explained – lending credence to the proxy claim being bandied in some quarters."
  },
  {
    "headline": "Buhari to Igbo Leaders: Only court can decide Nnamdi Kanu’s fate",
    "summarized_story": "Buhari, responding to latest pleas from South East leaders for the release of the arrow head of the agitation for Biafra, said Kanu’s matter should be allowed to be properly adjudicated in court.\nBuhari, referencing the violence in the South East sparked by the Biafran/Kanu issue, added: “I must register my deep and grave concern with regards to the deteriorating state of affairs in this region.\n“We stand by you in all efforts towards the fight against insecurity in the South East and the country in general.\n“As a father of our dear nation and South East, we bring to your notice that the sit-at-home has crippled the economy of South East and banditry is engulfing the nation.\nInsecurity has been on the rise in the South East over the last few months following the resumption of Kanu’s trial for alleged treason."
  },
  {
    "headline": "Strike: FG, ASUU to resume talks next week",
    "summarized_story": "The Federal Government and the striking Academic Staff Union of Universities (ASUU) will resume talks next week with a view to ending the prolonged closure of Nigerian public universities.\nHe assured that the government was tackling all the disputes in the education sector holistically, knowing full well that none of the unions could function effectively without the others.\nHe said: “If you are from any union, you don’t need to book an appointment to see me.\n“But the education unions don’t take advantage of my open door policy.\nLet us look at your issues to see the ones we can handle immediately, the ones we can do in the medium term and the ones we can do in the long term."
  },
  {
    "headline": "Buhari to S’East leaders: Court’ll decide Kanu’s fate",
    "summarized_story": "President Buhari vowed that the Federal Government would deploy its strength to protect innocent and hardworking Nigerians from terrorists and those causing breakdown of law and order in the South-East region.\nHe urged Southern leaders to work towards finding a political solution in resolving some challenging issues, warning that the region is at a crossroads.\n“On this issue of a political solution, I have never believed in IPOB’s method of operation, I disagree with them but we have gotten ourselves to a very terrible and pitiable solution.\nI have been to you and I have begged you for a political solution.\nThe Chairman of Southeast Traditional Rulers, Eze Charles Mkpuma and CAN Chairman, South-East, Very Rev."
  },
  {
    "headline": "Rivers wins ownership of 17 oil wells at Supreme Court",
    "summarized_story": "From Godwin Tsa, Abuja And Tony John, Port HarcourtThe Supreme Court on Friday resolved the legal dispute between Rivers and Imo over the ownership of 17 oil wells in favour of Rivers State.\nIn a unanimous judgment, the apex court specifically declared that the oil wells located in Ndoni and Egbema communities belong to Rivers State.\nThe state sought a declaration that all the oil wells within Akri and Mbede communities are wrongly attributed to Imo State and that they are all oil wells within the territory of Rivers state.\nMeanwhile, Governor Nyesom Wike said Rivers State was in court with its neighbouring Imo State, not to claim victory, but to defend its ownership rights of oil wells in Akri and Mbede communities.\nGovernor Wike pointed out that while the dispute lingered, the NBC did nothing in demarcating the boundaries to establish the proper location and title to the disputed oil wells."
  },
  {
    "headline": "FG, ASUU to resume talks next week",
    "summarized_story": "Adanna Nnamani, AbujaThe Federal Government and the striking Academic Staff Union of Universities (ASUU) would resume talks next week with a view to ending the prolonged closure of Nigerian public universities.\nThe Minister who also decried the rivalry between the education unions, made it clear that everybody is important in the university system.\nHe assured that the government was tackling all the disputes in education sector holistically, knowing fully well that none of the unions could function effectively without the other union.\nThat is why the Health Sector is quiet.\nBut the education unions don’t take advantage of my open door policy."
  },
  {
    "headline": "Nigerian airlines to shut down operations Monday over fuel cost",
    "summarized_story": "By Chinelo ObogoAirline Operators of Nigeria (AON) have said that due to the high cost of aviation fuel, member airlines will from Monday, May 9, discontinue operations nationwide until further notice.\nThis is coming following Daily Sun’s report about how exasperated the airlines were over the recent increase in fuel price after some airlines considered shutting downAre you a Man 40 yrs and above?\nMusa Nuhu, the body that aviation fuel price (JetA1) has risen from N190 per litre to N700 currently and that no airline in the world can absorb the shock from such an astronomical rise over a short period.\n“Overtime, aviation fuel price (JetA1) has risen from N190 per litre to N700 currently.\nThe airlines which endorsed the statement and will be shutting down are; Max Air, United Nigeria Airlines, Ibom Air, Arik Air, Aero Contractors, Azman Air, Overland Airways, Dana Air and Air Peace."
  },
  {
    "headline": "Visa policy: UK set to exempt Nigerian graduates",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe United Kingdom (UK), has disclosed plans to issue visas that will allow Nigerian degree holders to work in specific sectors in the UK.\nThe new visa policy, according to the United Kingdom, will commence on May 30, even as it said applicatants must possess a degree that is equivalent to a first degree in the United Kingdom.\nUnited Kingdom Minister of Safe and Legal Migration, Kevin Foster, while speaking about the new United Kingdom visa policy, said the High Potential Individual visa route aimed at high-skilled foreign university graduates.\n“The new High Potential Individual route will make it as simple as possible for internationally mobile individuals who demonstrate high potential to come to the UK.\nThis visa can only be granted once and will not be available to those who have already had a Graduate visa,” Foster said."
  },
  {
    "headline": "News in Photographs: S’West APC Leaders Meet Osinbajo, Tinubu, Other Presidential Aspirants",
    "summarized_story": "News in Photographs: S’West APC Leaders Meet Osinbajo, Tinubu, Other Presidential AspirantsA meeting of South West leaders of the All Progressives Congress with presidential aspirants from the zone is under way in Lagos.\nThe meeting convened by former Governors Bisi Akande and Segun Osoba is holding at the State House, Marina.\nIn attendance are APC presidential aspirants from the zone, including Vice President Yemi Osinbajo, Asiwaju Bola Ahmed Tinubu, Governor Kayode Fayemi and former Governor Ibikunle Amosun.\nAlso attending the meeting are Speaker Femi Gbajabiamila, Works Minister Babatunde Fashola, Interior Minister Rauf Aregbesola, Governor Gboyega Oyetola, Governor Babajide Sanwo-Olu, Governor Rotimi Akeredolu, Governor Dapo Abiodun, APC National Secretary Iyiola Omisore, former Governor Gbenga Daniel and Trade Minister Niyi Adebayo, among others.\nThough the agenda of the meeting was not announced, it was gathered that the meeting was aimed at addressing rhe rising number of presidential aspirants from.the zone on the platform of APC."
  },
  {
    "headline": "Amosun, Onu Pick N100m APC Presidential Nomination Forms",
    "summarized_story": "Adedayo Akinwale in AbujaFormer Governor of Ogun State, Senator Ibikunle Amosun; Senator representing Ondo-North senatorial district, Prof. Ajayi Boroffice; and Minister of Science, Technology and Innovation, Dr. Ogbonnaya Onu, have obtained N100 million Expression of Interest and Nomination forms of the All Progressives Congress (APC) to run for president.\nIt was also gathered that former Governor of Zamfara state, Sani Yerima, will obtain his form today.\nThe forms were collected for the aspirants by proxy.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "ACF to Southern Leaders: Enough of Blackmail, North Not Afraid of Break-up",
    "summarized_story": "*Says threat over zoning unacceptable“These Southerners contest the facts that the North has 78% of the landmass of Nigeria.\nThey refuse to accept that the North has over 55% of the population of Nigeria.\nThey refuse to accept that the North has over 55% of the population of Nigeria.\nBut in-spite of this, some southern politicians are furious, issuing dare warnings against the election of any Northerner as president.\nGone are the days when Northerners felt blackmailed and intimidated by threats of re-structuring, secession, break up or break down of Nigeria."
  },
  {
    "headline": "Private Sector Operators Propose 10-Point Action Plan to Boost Nigeria’s Fiscal Position",
    "summarized_story": "Ndubuisi Francis in AbujaThe Nigeria Economic Summit Group (NESG), a private sector-led think-tank and policy advocacy group, has proposed a ten-point action plan under an integrated strategy for revenue optimisation, expenditure efficiency and public debt management.\nHe said: “At the NESG, our mission is an open, inclusive, sustainable and globally competitive economy.\nWe champion sustainable debt management because unsustainable public debt accumulation is inimical to economic growth, not only in Nigeria but ECOWAS as a whole.\nHe added: “The DMR report is holistic and includes workable recommendations that, if adopted, can prevent West Africa from getting into a debt trap.\nThe report provides some background on the ECOWAS fiscal landscape and public debt portfolio, including several policy recommendations for debt sustainability and key performance indicators."
  },
  {
    "headline": "INEC Reminds Parties of Deadline, Says They Have till June 3 to Conduct Primaries",
    "summarized_story": "Chuks Okocha in AbujaFor the third time, the Independent National Electoral Commission (INEC) has sent a reminder to the 18 political parties expected to participate in the 2023 general election, saying they have till June 3 to conduct their primaries for all elections.\nIn a statement yesterday by INEC’s National Commissioner in charge of Publicity and Chairman, Voter Education, Festus Okoye, the commission said, “It is imperative to remind political parties that they have one month from today to conclude their primaries.\nINEC said political parties were further reminded that they must submit to the commission the list of candidates, who must have emerged from valid primaries.\nMeanwhile, in an update on the continuous voter registration, the commission said fresh registrants stood at 8,855,996 as at Monday, May 2, 2022.\nIt also said completed registration of voters stood at 5,415,619, while online registrants were 2,379,063, and physical registration was 3,036,556."
  },
  {
    "headline": "COVID-19 Vaccine: CBN To Fund Nigerian Researchers, Science Institutions",
    "summarized_story": "The Central Bank of Nigeria says it is developing a framework under which grants and long term facilities will be provided to researchers, science institutions and biotechnology firms to develop COVID-19 vaccine.\nThe Governor of CBN, Godwin Emefiele, disclosed this at the unveiling of the THISDAY Dome Testing, Tracing and Treatment Centre, Abuja, on Tuesday.\nEmefiele said if Nigeria was to wait for foreign countries to develop their vaccines, it would be the last in the queue to receive curative remedies for the teeming population.\nHe said, “The CBN today challenges Nigerian scientists at home and in the Diaspora to go back to their laboratories and develop a Nigerian vaccine.\nOnce validated by the Health Authorities, the CBN will step in and do the needful for the sake of over 200 million Nigerians now confronted by COVID-19."
  },
  {
    "headline": "President Donald J. Trump’s Concession Speech, By Rudolf Okonkwo",
    "summarized_story": "The first time I ran for office, I ran for president.\nI have shown you that everything is possible if you have the right man to do the right job.\nThanks to me, they will grow up knowing that ours is a Christian nation where it is allowed to say Merry Christmas.\nTell those terrible lowlifes that they have proved themselves unworthy of Donald Trump’s genius and have opted to reduce America to a Second Class nation in the world.\nYours truly,President Donald J. TrumpThe 45th President of the United States."
  },
  {
    "headline": "Bandits Free Niger State Monarch After 45 Days In Captivity, N10million Ransom",
    "summarized_story": "The Dodo of Wawa community, Niger State, Dr Mahmoud Ahmed Aliyu, has been freed by his abductors after spending 45 days in their captivity.\nHe was said to have been released at about 7:30pm on Tuesday after the payment of N10million ransom to the bandits.\nThe Wazirin Wawa, Alhaji Ja’afar Ibrahim Bio, confirmed the release of the traditional ruler to Daily Trust, on the telephone but declined comment on how much was paid to secure his release.\nIn a video shared by his family, the traditional ruler was seen in a white turban being welcomed by his family and members of the palace.\nAliyu was abducted in his palace by heavily armed men around 9pm on September 4."
  },
  {
    "headline": "The Teflon President With Nine Lives Is On His Way Out By Dr. Wumi Akintide",
    "summarized_story": "The Teflon President with nine lives I have in mind is nobody else but Donald J. Trump.\nIn cahoots with Trump, Republicans have not ended their campaign of calumny to humiliate, blackmail and delegitimize Barack Obama, the first black President.\nThe one-term young Senator from Illinois was elected President in 2008 and re-elected again in 2012 with a wider margin.\nThe voters concluded he had told a lie even though he was one of the most honorable and dependable men of honor ever to serve as American President.\nThe list goes on and on without end but Donald Trump is still there despite an abysmal approval opinion of only 33 percent or less."
  },
  {
    "headline": "UK: Only IPOB members involved in violence will be denied asylum",
    "summarized_story": "The government of the United Kingdom (UK) says only violent members of the Indigenous People of Biafra (IPOB) will be denied asylum in Britain.\nThe high commission added that IPOB members who have committed violent crimes in Nigeria will not be granted asylum.\nA few days after the policy notes were published, the UK government took it down, following complaints from the Nigerian government.\nAdvertisementIn July 2021, an updated policy on asylum had no clear mention of IPOB, but more emphasis on Nigerians fleeing Boko Haram’s onslaught.\nThe UK stated categorically that the “Indigenous People of Biafra” (IPOB) “is not a proscribed organisation in the UK”."
  },
  {
    "headline": "UK: Only IPOB members involved in violence will be denied asylum",
    "summarized_story": "The government of the United Kingdom (UK) says only violent members of the Indigenous People of Biafra (IPOB) will be denied asylum in Britain.\nThe high commission added that IPOB members who have committed violent crimes in Nigeria will not be granted asylum.\nA few days after the policy notes were published, the UK government took it down, following complaints from the Nigerian government.\nAdvertisementIn July 2021, an updated policy on asylum had no clear mention of IPOB, but more emphasis on Nigerians fleeing Boko Haram’s onslaught.\nThe UK stated categorically that the “Indigenous People of Biafra” (IPOB) “is not a proscribed organisation in the UK”."
  },
  {
    "headline": "Ahmed Yerima: Why I introduced Sharia law in Zamfara",
    "summarized_story": "Ahmed Yerima, former governor of Zamfara, says he introduced Sharia law in the state in line with the constitution on the freedom of religion.\nYerima said this on Friday while speaking with journalists after a meeting with President Muhammadu Buhari.\nThe former Zamfara governor had, in October 1999, introduced Sharia law in the state, after which several other states in the north followed suit.\n“On the issue of Sharia, I’m a Muslim and I say everywhere I go, that I am a Muslim and I want to die as a Muslim.\nLike I said, I’m going to fight the problem of ignorance and this is one of them,” he said."
  },
  {
    "headline": "Ahmed Yerima: Why I introduced Sharia law in Zamfara",
    "summarized_story": "Ahmed Yerima, former governor of Zamfara, says he introduced Sharia law in the state in line with the constitution on the freedom of religion.\nYerima said this on Friday while speaking with journalists after a meeting with President Muhammadu Buhari.\nThe former Zamfara governor had, in October 1999, introduced Sharia law in the state, after which several other states in the north followed suit.\n“On the issue of Sharia, I’m a Muslim and I say everywhere I go, that I am a Muslim and I want to die as a Muslim.\nLike I said, I’m going to fight the problem of ignorance and this is one of them,” he said."
  },
  {
    "headline": "Akeredolu asks Emefiele to resign before joining presidential race",
    "summarized_story": "Rotimi Akeredolu, governor of Ondo, has asked Godwin Emefiele, the governor of the Central Bank of Nigeria (CBN), to resign his position if he wants to contest the presidency.\nTheCable had reported that three interest groups procured the presidential nomination form of the All Progressives Congress (APC) for Emefiele.\nThe development stirred varied reactions on social media as some Nigerians queried the possibility of the CBN governor contesting the presidency while in office.\nAdvertisementSpeaking on the development in a statement, Akeredolu said Emefiele cannot participate actively in partisan politics and also hold the position of CBN governor.\n“Consequently, we admonish Mr Emefiele to leave the office, immediately, for him to pursue his interest,” the Ondo governor said."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "CAF is tackling Africa's $4bn cybersecurity threat",
    "summarized_story": "From ransomware attacks and phishing scams, to cryptojacking and malware, cybersecurity threats are on the rise as the world moves to become a “global village”.\nAlthough many African countries might not have the largest cybersecurity threats, they are still at risk of cyberattacks.\nThe top 5 cyber threats are online scams, digital extortion, business email compromise or BECs, ransomware, and botnets, and most were distributed through emails.\nUp until a few years ago, it was forbidden to send money, through Western Union, to Canada from Côte d’Ivoire.\nThe programme will take place in Abidjan, Côte d’Ivoire, on May 9 and 10, 2022."
  },
  {
    "headline": "WhatsApp confirms outage, as thousands around the world are unable to send messages",
    "summarized_story": "On Thursday evening, April 28, nearly 10,000 users reported that WhatsApp is not functioning for them, according to data from Down detector.\nIt’s not immediately clear what caused the outage but WhatsApp has confirmed the outage through its official Twitter account.\n“You may be experiencing some issues using WhatsApp at the moment,” the company said.\nWe’ll keep you updated and in the meantime, thanks for your patience.”You may be experiencing some issues using WhatsApp at the moment.\n— WhatsApp (@WhatsApp) April 28, 2022Share this article"
  },
  {
    "headline": "Can Anambra State spearhead a digital revolution in South-East Nigeria with Fred Agbata’s appointment?",
    "summarized_story": "Share this article:The Anambra State Governor, Charles Chukwuma Soludo, has announced the appointment of Chukwuemeka Fred Agbata as the MD/CEO of the Anambra State ICT Agency for a four-year tenure.\nMuch of the growth in Nigeria’s tech sector has been seen in Lagos State.\nThe hub provides a place for state residents to convene and potentially build technological products.\nAccording to data from the National Bureau of Statistics, the South Eastern region of Nigeria, where Anambra State is, has the lowest Internet penetration rates, with 13.7 million users.\nIn Agbata’s experience and Soludo’s previous experience as a Governor of the Central Bank of Nigeria (CBN), the state could become a digital powerhouse."
  },
  {
    "headline": "TikTok will start rewarding creators",
    "summarized_story": "AdvertisementToday, I’ll be discussing:Problems YC-backed startups are solvingTikTok’s PulseTigerrise’s plan to improve mental healthWhat problems are YC-backed startups solving?\nIsn’t this fantastic news for TikTok Pulse creators?\nTigerrise to improve mental health accessPhoto by Emily Underworld on UnsplashIn Africa, mental health care is scarce.\nTo back up this claim, Kenya’s health ministry reports that 75% of people in need of mental health services cannot obtain them.\nVictoria Fakiya A writer with ADHD who is interested in mental health and how technology is improving the lives of Africans with ADHD."
  },
  {
    "headline": "What problems are Y Combinator-backed startups solving in Africa?",
    "summarized_story": "This has significantly changed how African startups operate and, per some founders, helped refine their business processes.\nLittle wonder that 53% (51) of YC-backed African startups (95) are from Nigeria.\nBut the big question remains: What problems are Y Combinator-backed startups solving?\nWhat problems are Africa’s YC-backed startups solving?\nSo far, YC has invested in a whopping 47 Financial Services startups in Africa, almost half of its Africa alumni."
  },
  {
    "headline": "Aladdin Digital Bank, Closes a Debt-Financing Deal Up to $3.5 Million",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:Aladdin Scheme Ltd, the leading Ecosystem Digital bank in Nigeria has announced its successful closing of a debt-financing deal up to $3.5 million.\nIn the last couple of months, Aladdin Digital bank has transformed from a digital bank app to a full scale financial powerhouse for individuals, freelancers and SMEs consistently delivering state of the art digital products on its banking platforms to support their hustle.\nIG: @aladdinbankngFacebook:@aladdinbankngLinkedIn:@aladdindigitalbankBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Microsoft Africa Development Center (ADC) West Africa inspires schoolgirls on the International Girls in ICT Day 2022",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:The International Girls in ICT Day was celebrated globally on April 28th, 2022, and the team at the Microsoft Africa Development Center (ADC), West Africa, celebrated the day at an intimate event with schoolgirls and female tech enthusiasts.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Domestic airlines to shut operations from Monday over fuel price hike",
    "summarized_story": "Domestic airlines operating in Nigeria have said they will discontinue operations nationwide with effect from Monday May 9, 2022 until further notice as a result of the fuel increase nationwide.\nRead also: International airlines shun new Lagos terminal over space constraints” While aviation fuel worldwide is said to cost about 40percent of an airline’s operating cost globally, the present hike has shut up Nigeria’s operating cost to about 95 percent.\nThe latter cannot be fully passed to passengers who are already experiencing a lot of difficulties.\n“While AON appreciates the efforts of the current government under the leadership of President Muhammadu Buhari to ensure air transport in Nigeria grows, unfortunately, the cost of aviation fuel has continued to rise unabated thereby creating huge pressure on the sustainability of operations and financial viability of the airlines.\nThis is unsustainable and the airlines can no longer absorb the pressure,” the body stated."
  },
  {
    "headline": "Unbundling, sales, seen saving Aero Contractors",
    "summarized_story": "There are indications that Aero Contractors, the oldest airline in Nigeria, is on its way to closing shop.\n“The methodology I proposed is to establish Aero parts, a part trading and aircraft support company, Aero maintenance, to continue the profitable aircraft maintenance business; Aero support, to provide field support to the industry, Aero Services, which can leverage the 62-year business experience and provide services across many sectors from training to manuals and business process development; catering, cleaning etc.\nand the core airline business which requires the Air Operating Certificate (AOC), so the helicopter and aircraft business would not be easily split,” Nwuba said.\n“I expected that by now, Aero would have sold the airline to investors and this would have allowed the airline to survive.\nAero was very successful and the best-managed airline at the time and still holds their safety records."
  },
  {
    "headline": "Bad economic management robs Nigeria of benefit from massive oil windfall",
    "summarized_story": "Many of the country’s economists and business leaders have called the overbearing focus on maintaining a costly petrol subsidy regime a show of bad economic management by the government.\nData published by the Nigerian National Petroleum Co. show how high oil prices are weighing down rather than boosting public finances in Africa’s largest crude producer.\nThat makes pump prices in Nigeria among the lowest in the world, at 162.5 naira a liter.\nThe NNPC last year contributed about 15% of its gross revenue of 3.43 trillion naira to the fund, according to company data.\nThe firm says it spent 1.43 trillion naira subsidizing gasoline in 2021 — it is on track to nearly double that figure this year."
  },
  {
    "headline": "2023: Edo PDP’ll obey party decisions, Obaseki assures – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said the state’s chapter of the Peoples Democratic Party (PDP) will obey any decision reached by the party at the national level ahead of the presidential primary election as long as the decision is fair and just.\nHe said, “I believe that you know what the issues are in Nigeria today and have practically touched all of them.\nThere is nothing wrong when you throw your hat in the ring, and you’ve been quite clear and not ambiguous.\nThey also have the privilege to hear from you and know the decision to take when the time comes,” Obaseki noted.\nI know the country very well and the people of the country know me."
  },
  {
    "headline": "Edo unveils tech training programme for 5000 women – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government in partnership with Udacity, a global online educational organization, has announced the opening of 5000 slots for women on the EdoWorX Tech Fundamentals Programme.\nManaging Director of Edo State Skills Development Agency, EdoJobs, Mrs. Ukinebo Dare, in a statement, said the EdoWorX Tech Fundamental Programme which is being managed by the agency, will provide scholarships to train women on in-demand tech skills.\n“This partnership will benefit over 800 Edo women who have already received training on high-demand tech skills in areas such as Web Development, Data Analysis and Digital Marketing which commenced in February, 2022,” Dare explained.\nThe Managing Director noted, “The initiative is in line with Governor Godwin Obaseki’s agenda to furnish and prepare the Edo State talent pool for digital jobs.\n“There are local ICT centres in rural areas with access to laptops, internet and trainers to assist learners with their courses."
  },
  {
    "headline": "World Hand Hygiene Day: Edo urges stakeholders to sustain campaign on regular hand-washing – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Primary Health Care Development Agency (ESPHCDA) has urged stakeholders to collaborate with the government across all levels to sustain awareness campaigns on regular hand washing to prevent diseases.\nThe Executive Secretary, ESPHCDA, Dr. (Mrs.) Otaniyenuwa Obarisiagbon, made the submission in commemoration of the 2022 World Hand Hygiene Day in Benin City.\nShe urged healthcare workers, parents and other stakeholders to adopt the culture of washing hands frequently in order to prevent diseases.\nAfter hand washing, hands can be air dried or single use hand towels should be used to dry our hands.\nAccording to her, “the celebration helps to increase awareness on the importance of washing our hands regularly and ensure people of all levels work together to influence the culture of washing hands always."
  },
  {
    "headline": "Edo set for Farm-to-Table Initiative, to connect farmers to produce buyers online …as EXCO hails N40,000 new minimum wage – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has concluded plans to launch an online portal to connect farmers in the state to produce buyers globally in a renewed drive to promote trade and develop farmer cooperatives.\nAccording to her, “We are providing access and boosting trade by creating a website to connect farmers and the buyers.\n“We are working with other stakeholders to identify products that are shop-ready as we plan to showcase these products at the 6th Lagos Trade Fair.\n“The harmonised pension for Edo pensioners which had not been done in the last 21 years was made possible by Obaseki.\nCommissioner for Physical, Urban and Regional Planning, Isoken Omo, said the state is transitioning from the ‘Operation Show Your Building Plan’ to ‘Operation Plan Edo,’ in collaboration with other ministries in the state."
  },
  {
    "headline": "2023: South-west leaders resolve next president ‘must come’ from region",
    "summarized_story": "Political leaders in the South-west and presidential aspirants from the region on the platform of the ruling All Progressives Congress (APC) resolved at a meeting in Lagos Friday that the region “must produce” the next Nigerian president.\nThe aspirants met with two former governors of the party – Segun Osoba and Bisi Akande.\nThe aspirants in attendance were Vice President Yemi Osinbajo; Bola Tinubu, the national leader of the party and former Lagos governor; Governor Kayode Fayemi of Ekiti State; and Ibikunle Amosun, a serving senator and former governor of Ogun State.\nAlso present at the meeting werep Femi Gbajabiamila, speaker of the house of representatives; Babatunde Fashola, minister of works and housing; and Rauf Aregbesola, former Osun State governor.\nHe, however, did not entertain questions from journalists."
  },
  {
    "headline": "UK govt denies declaring IPOB as a terrorist organisation",
    "summarized_story": "The United Kingdom has denied reports that it added separatist group, the Indigenous People of Biafra (IPOB) to a list of terrorist groups banned from the country.\n“We are aware of inaccurate reporting circulating in the media and online that the UK Government has added the Indigenous People of Biafra (IPOB) to the UK’s list of terrorist groups or organisations banned under UK law.\nThe Indigenous People of Biafra (IPOB) is not a proscribed organisation in the UK,” a statement from the UK high commission in Nigeria said on Friday.\npic.twitter.com/pPou7SxQ9S — UK in Nigeria🇬🇧🇳🇬 (@UKinNigeria) May 6, 2022Meanwhile, the Nigerian governor, relying on the apparently inaccurate report of the UK prescribing IPOB as a terrorist group, on Friday evening, released a statement welcoming the decision.\n“Nigeria welcomes the decision by the United Kingdom to proscribe the Indigenous People of Biafra (IPOB) as a terrorist group,” a tweet from the official Nigerian government twitter handle read."
  },
  {
    "headline": "Nigeria’s domestic airlines to stop operations from Monday over high cost of fuel",
    "summarized_story": "Airline operators in Nigeria have issued a notice that with effect from Monday, 9th May, they will shut down their operations due to the high cost of aviation fuel which has hit 700 naira per litre.\nA statement by all the operators Thursday, advised the traveling public who intend to fly to make alternative arrangements to avoid being stranded at the country’s airports.\nThe statement signed by Alhaji Abdulmunaf Yunusa Sarina, President, AON continued, “Overtime, aviation fuel price (JetA1) has risen from N190 per litre to N700 currently.\nNo airline in the world can absorb this kind of sudden shock from such an astronomical rise over a short period.\nWhile aviation fuel worldwide is said to cost about 40% of an airline’s operating cost globally, the present hike has shut up Nigeria’s operating cost to about 95%."
  },
  {
    "headline": "30,000 youths to benefit from Osun govt’s health insurance scheme",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe government of Osun State under the leadership of Governor Adegboyega Oyetola, has ordered immediate enrolment of 30,000 youth into its Health Insurance Scheme.\nThis is even as the government announced that it has also kick started massive recruitment into Osun Youth Employment Scheme popularly called O’YES.\n“The present administration’s efforts in making sure that healthcare delivery is accessible and affordable to all citizens and residents of the State led to the establishment of the Osun Health Insurance Scheme (OHIS).\n“In order to address this, Governor Adegboyega Oyetola, who is a lover of the youth, directed that 30,000 vulnerable youth drawn from all the local government areas of the State be enrolled under the Osun Health Insurance Scheme (OHIS).\n“The enrollment of (30,000) thirty thousand vulnerable youth in all the Local Government in the State shall be as follows: Distribution of (OHIS) Osun Health Insurance Scheme forms to the vulnerable youth through Local Government Chairmen; Capturing and Documentation of vulnerable youth beneficiaries in each of Local Government in the State by Osun Health Insurance Scheme Team; Inauguration ceremony of (30,000) thirty thousand vulnerable youths into (OHIS) Osun State Health Insurance Scheme to be presided over by Mr."
  },
  {
    "headline": "PDP clears Ozigbo to contest Anambra south senate seat",
    "summarized_story": "The People’s Democratic Party (PDP) has given Mr. Valentine Ozigbo clearance to contest for Anambra south senate in the 2023 general election.\n“I am pleased and honoured to formally inform you that I have received my clearance certificate to contest for the ticket for the Anambra South Senatorial seat in the Peoples Democratic Party’s (PDP) primary coming up later this month,” Ozigbo said.\nThe PDP National Assembly Screening Panel for Anambra never disqualified me.\nThat is why I am running for the senatorial seat for Anambra South.\nWe deserve the best in governance; we deserve the best in leadership, and we deserve the best in representation at all levels."
  },
  {
    "headline": "Oil Wells Tussle: Rivers Defeats Imo At Supreme Court",
    "summarized_story": "The Supreme Court has resolved the ownership dispute of 17 oil-rich wells in favour of Rivers State.\nIn a judgment prepared by Justice Heleen Ogunwumiju and delivered by Justice Emmanuel Agim, the apex court dismissed the counter claim ownership put forward by Imo State Government.\nThe oil wells located in the territories of Rivers and Imo States had been a subject of litigation at the apex court, with seven Justices in the panel.\nAccording to Justice Agim, reliefs 1, 3, 4, 5 and 6 sought by Rivers State Government were granted by the Court.\nJustice Ogunwumiju, however, refused to grant the N500m cost requested by Rivers State."
  },
  {
    "headline": "Lagos Gov’ship: Tinubu Paid For My Nomination Forms – Sanwo-Olu",
    "summarized_story": "All Progressives Congress (APC) national leader and 2023 presidential hopeful, Asiwaju Bola Ahmed Tinubu, has paid for the N50m Expression of Interest and Nomination Forms of Governor Babajide Sanwo-Olu’s re-election bid.\nSanwo-Olu’s chief press secretary, Gboyega Akosile, who took to his verified Twitter handle on Friday, disclosed this while attributing same to his principal.\nAkosile wrote: “Breaking: Asiwaju Tinubu paid for my second term nomination and expression of interest forms to run for second term, Says Sanwo-Olu.”Recall that Sanwo-Olu had been given a clean bill of heath to recontest the governorship position for the second term by the Governor’s Advisory Council (GAC), which is the highest decision-making body of the APC in Lagos State."
  },
  {
    "headline": "JUST-IN: Ex-Zamfara Gov, Yerima, Joins Presidential Race",
    "summarized_story": "A former governor of Zamfara State, Senator Ahmed Sani Yerima, has joined the 2023 presidential race.\nHe disclosed this to State House correspondents in Abuja on Friday after meeting with President Muhammadu Buhari at the Presidential Villa, Abuja.\nAccording to him, he will be seeking the presidential ticket on the platform of the ruling All Progressives Congress (APC).\nSpeaking about his plans to set things straight for Nigeria, Yerima said he would be focusing on three critical areas of need, namely insecurity, poverty, and ignorance.\n“So, I have three points as well; to fight insecurity, fight poverty, and ignorance,” he said of his plans for Nigeria, if he gets elected."
  },
  {
    "headline": "JUST-IN: Ex-Zamfara Gov, Yerima, Joins Presidential Race",
    "summarized_story": "A former governor of Zamfara State, Senator Ahmed Sani Yerima, has joined the 2023 presidential race.\nHe disclosed this to State House correspondents in Abuja on Friday after meeting with President Muhammadu Buhari at the Presidential Villa, Abuja.\nAccording to him, he will be seeking the presidential ticket on the platform of the ruling All Progressives Congress (APC).\nSpeaking about his plans to set things straight for Nigeria, Yerima said he would be focusing on three critical areas of need, namely insecurity, poverty, and ignorance.\n“So, I have three points as well; to fight insecurity, fight poverty, and ignorance,” he said of his plans for Nigeria, if he gets elected."
  },
  {
    "headline": "BREAKING: CBN Gov, Emefiele, Picks N100m APC Presidential Forms",
    "summarized_story": "Governor of the Central Bank of Nigeria (CBN), Godwin Emefiele, has obtained the nomination and expression of interest forms of the All Progressives Congress (APC) to contest the 2023 presidential poll.\nEmefiele paid N100million for the nomination and expression of interest forms on Friday, at the International Conference Center, Abuja venue of the sale of forms.\nEmefiele’s decision to run for the office of the president in 2023 follows months of speculations regarding the political aspiration of the Agbor, Delta State-born former Managing Director of Zenith Bank.\nThis is coming weeks after the CBN governor had warned interest groups not to drag him into partisan politics, saying he was focusing more on fixing Nigeria’s monetary policies and aligning them with federal government’s fiscal policies.\nDetails Later…"
  },
  {
    "headline": "Russian warship Admiral Makarov burning after hit by Ukrainian missiles",
    "summarized_story": "Russia’s Admiral Makarov warship is burning in the Black Sea after it was hit by Ukrainian missiles, Ukrainian officials said.\nUkrainian presidential adviser Anton Gerashchenko reported on his Telegram page that Admiral Makarov was hit by a Ukrainian “Neptune” anti-ship missile.\nRussian navy ships stationed in Crimea were sent to help Admiral Makarov, he said.\nAdmiral Makarov is a modern frigate loaded with guided missiles, according to the World Directory of Modern Warships.\nIf lost, Russia’s frigate fleet will be down to 10."
  },
  {
    "headline": "Nigerian airlines set to ground flights from Monday",
    "summarized_story": "Airlines in Nigeria said they will suspend operations from Monday, May 9, over rising cost of aviation fuel, that now sells for N700 per litre, from N190.\nAzman Air, Max Air, United Nigeria Airways, Ibom Air, Arik Air, Air Peace, Dana Air and Overland Airways in a joint statement Friday, made their plan known to the authorities.\nThe airlines said no airline in the world can absorb the astronomical hike in the fuel cost, which has increased its fuel cost component from 40% to 95%.\nOvertime, aviation fuel price (JetA1) has risen from N190 per litre to N700 currently.\nWhile aviation fuel worldwide is said to cost about 40% of an airline’s operating cost globally, the present hike has shut up Nigeria’s operating cost to about 95%."
  },
  {
    "headline": "IPOB not listed as terrorist group, says UK",
    "summarized_story": "The British government frowned on reports stating that IPOB was proscribed in the country, describing them as “inaccurate reporting”.\nThe statement read, “We are aware of inaccurate reporting circulating in the media and online that the UK Government has added the Indigenous People of Biafra (IPOB) to the UK’s list of terrorist groups or organisations banned under UK law.\nThe Indigenous People of Biafra (IPOB) is not a proscribed organisation in the UK.\nCPINs provide country of origin information (COl) and analysis of COI for use by UK Government decision-makers handling particular types of protection and human rights claims.\n“This CPIN also acknowledges that the Nigerian government has proscribed IPOB as a terrorist organisation, some members of IPOB have reportedly used violence against the state and members of the public, and advises that persons who have committed human rights abuses must not be granted protection.”"
  },
  {
    "headline": "BREAKING: South-West APC leaders, aspirants reach agreement on 2023 presidency",
    "summarized_story": "South-West presidential aspirants and leaders of the All Progressives Congress have reached an agreement to ensure that the region produces the next APC presidential candidate of the party.\nA former National Chairman of the APC, Chief Bisi Akande, made this known while addressing journalists at the end of a meeting with presidential aspirants from the zone on Friday night in Lagos State.\nAccording to him, the South-West APC presidential aspirants, governors and other leaders are united ahead of the 2023 general elections.\nHe said, “We are united as we will ensure that the presidency of the Federal Republic of Nigeria will come to the South-West.\nOther APC leaders at the meeting were Otunba Gbenga Daniel, former governor of Ogun; Chief Iyiola Omisore, the APC National Secretary; Otunba Moses Adeyemo, former Deputy Governor of Oyo State and Chief Pius Akinyelure, former National Vice Chairman of APC, South-West Zone among others."
  },
  {
    "headline": "BREAKING: Wole Adetiran, NYSC anthem composer is dead",
    "summarized_story": "Wole Adetiran, composer of the National Youth Service Corps anthem, NYSC, anthem is dead.\nThis newspaper gathered that the 74-year-old died on Friday evening.\nThe Ogun State NYSC Coordinator, Dr Belinda Faniyi, also confirmed the development.\nAdetiran death has also been announced in multiple Facebook groups of the Celestial Church of Christ, as he held the post of National Music Director before his death.\nThe septuagenarian, who composed the anthem in 1984 while he was a corps member in Oyo State, studied music at the University of Nigeria, Nsukka."
  },
  {
    "headline": "BREAKING: Tinubu, Osinbajo, Aregbesola, Fayemi, Sanwo-Olu, begin crucial meeting at Lagos House",
    "summarized_story": "The National Leader of All Progressives Congress, APC, Bola Tinubu, Vice President, Yemi Osinbajo, Governor of Ekiti State, Kayode Fayemi, and all presidential aspirants in the 2023 general poll are currently in a crucial stakeholders’ meeting at Lagos House, Marina.\nOthers at the meeting include Lagos State Governor, Bababjide Sanwo-Olu, who is the host, Ondo State Governor, Rotimi Akeredolu, Governor of Ogun State, Dapo Abiodun, Governor of Osun State, Gboyega Oyetola, Minister of the interior, Rauf Aregbesola, Minister for Works and Housing, Babatunde Fashola, former Governor of Ekiti State, Otunba Niyi Adebayo and Dr Iyiola Omisore.\nAs of 7.30 pm, the meeting was being held behind closed doors, which also have in attendance, the conveners, former National Chairman of APC, Pa Bisi Akande and former Ogun State Governor, Aremo Olusegun Osoba was still ongoing.\nAregbesola arrived in Osinbanjo’s convoy at about 6.45 pm and was ushered into the main hall.\nAccording to a source, the meeting is centre around arriving at a mutual consensus of candidates among the various presidential aspirants from the South West region of the country in the forthcoming APC primaries."
  },
  {
    "headline": "Exclusive: Experts proffer solutions to brazen oil theft",
    "summarized_story": "According to him, the act is perpetrated with the aid of security personnel and some oil companies’ staff.\nHe said the presidential task force set up to address the issues of oil theft had failed to produce the desired result.\n“The shameful involvement of security personnel as an act of sabotage in reducing oil theft rather escalates it in more complex ways,” he said.\nHe said further that to tackle oil theft there was the need for a declaration of war on oil thieves.\nOil companies and NNPC must see the need to replace oil wells and pipelines that are already in obsolete conditions."
  },
  {
    "headline": "Updated: Onu joins presidential race, promises to make Nigeria a production hub",
    "summarized_story": "Nigeria must be a producer nation instead remaining a consumer nation.\nThis is the road that science, technology and innovation will make possible for us to take.”According to him, when elected, he will use science, technology and innovation to unlock the prosperity of Nigeria.\n“Fellow Nigerians, we have the key to unlock the prosperity of our dear nation, and this key is a knowledge economy driven by science, technology and innovation.\nThis is so because no nation has ever become truly great, whether in ancient or modern times, without the efficient and effective deployment of science, technology and innovation to nation building.\nThe Almighty God has created us, gave our dear nation everything she needs to be a leader in the world."
  },
  {
    "headline": "UK makes u-turn, takes fresh stand on IPOB",
    "summarized_story": "Five years after, the United Kingdom government has eventually designated Nigeria’s Indigenous People of Biafra (IPOB) as a terrorist organisation.\nThe federal government had in 2017 branded IPOB a terrorist group, since then, the sect has continued their agitation with insecurity rising in Southeast.\nAccording to reports, UK’s U-turn followed series of atrocities committed by the group.\n“MASSOB has been banned, but is not a proscribed terrorist group in Nigeria.\n“Persons who commit human rights violations must not be granted asylum.”Share this: TwitterFacebook"
  },
  {
    "headline": "Naira weakens against dollar, exchanges at N419",
    "summarized_story": "Agency reportNaira on Thursday depreciated at the Investors and Exporters window exchanging at N419 to the dollar, 0.24 percent depreciation, weaker than N418 it traded on Wednesday.\nThe open indicative rate closed at N417.40 to the dollar on Thursday.\nAn exchange rate of N444 to the dollar was the highest rate recorded within the day’s trading before it settled at N419.00.\nThe Naira sold for as low as 410 to the dollar within the day are trading.\nA total of 108.24 million dollars was traded in foreign exchange at the official Investors and Exporters window on Thursday."
  },
  {
    "headline": "Oil price tops $108 a barrel ahead of OPEC+ meeting",
    "summarized_story": "Agency reportOil prices rose on Wednesday ahead of the periodic meeting of the Organisation of Petroleum Exporting Countries (OPEC) and its allies.\nBrent crude futures, the global oil benchmark, climbed 3.35 per cent to $108.25 a barrel at 10.20 GMT+1 — the first time since April 29.\nOn Wednesday, Ursula von der Leyen, president of the European Commission, announced that European Union countries would stop importing Russian oil in the next six months.\nThe ban on Russian oil is expected to have a ripple effect on the EU’s energy supply chain.\nAlready, the United States placed a ban on Russian oil imports, and the UK said it would follow suit by the end of the year."
  },
  {
    "headline": "GSM calls, data: Nigerians to pay more",
    "summarized_story": "Based on their proposal, the price floor of calls will increase from N6.4 to N8.95 while the price cap of SMS will increase from N4 to N5.61.\nThis was revealed in a letter titled, ‘Impact of the Economic and Security Issues on the Telecommunications Sector,’ which was sighted by our correspondent.\nThe letter was written by the telecommunications companies under the aegis of the Association of Licensed Telecommunication Operators of Nigeria, ALTCON, to the NCC.\nIn the letter, the telecom companies said there had been a 40 per cent increase in the cost of doing business in the nation.\nThey said this had resulted in an increase in energy costs, increasing their operating expenses by 35 per cent."
  },
  {
    "headline": "Govt, commercial users to pay for using Twitter – Elon Musk",
    "summarized_story": "By Emmanuel ObisueOn the heels of his acquisition of Twitter, billionaire entrepreneur, Elon Musk, on Wednesday said governments and other commercial users may have to pay to use the micro-blogging platform.\nAfter his $44 billion purchase of Twitter, Musk has now hinted that Buhari and other users may have to pay for using the platform.\nConfirming fears by the majority that his takeover might lead to commercialisation of the social media platform, Musk in a tweet in the early hours of Wednesday, said commercial and government users will pay for the platform.\n“Twitter will always be free for casual users, but maybe a slight cost for commercial/government users.\n“Twitter will always be free for casual users, but maybe a slight cost for commercial/government users,” he tweeted."
  },
  {
    "headline": "Naira slides to N589 to $1 at parallel market as FX liquidity crisis persists",
    "summarized_story": "By Agency reportThe free fall of Nigerian naira continued on Wednesday, dropping to N589 against the dollar at the parallel market.\nCurrency traders known as Bureaux De Change operators (BDCs) said that the forex liquidity crisis still persists in the market despite low demands.\nA parallel market (street market) is characterised by noncompliant behaviour with an institutional set of rules.\nThe Central Bank of Nigeria (CBN) has often maintained that the parallel market is not the true reflection of the naira.\nIt may increase the cost of foreign borrowing, force foreign investors to pull out their funds, causing further depreciation of the naira."
  },
  {
    "headline": "We Didn’t Designate IPOB As Terrorist Organisation – UK",
    "summarized_story": "The United Kingdom has clarified that it did not designate the Indigenous People of Biafra (IPOB) as a terrorist organisation.\nThe clarification comes after it emerged that the UK sought to exclude IPOB members who have committed human rights abuses from its asylum program.\nREAD ALSO: UK Bars IPOB, Others From Seeking Asylum“We are aware of inaccurate reporting circulating in the media and online that the UK Government has added the Indigenous People of Biafra (IPOB) to the UK’s list of terrorist groups or organisations banned under UK law,” the statement said.\nThe ‘Indigenous People of Biafra’ (IPOB) is not a proscribed organisation in the UK.\nCPINs provide country of origin information (COI) and analysis of COI for use by UK Government decision-makers handling particular types of protection and human rights claims."
  },
  {
    "headline": "ASUU Strike: FG To Resume Talks With Varsity Lecturers",
    "summarized_story": "The Federal Government will resume talks with the Academic Staff Union of Universities (ASUU) by next week as part of moves to end the lingering strike by the lecturers.\nBut the education unions don’t take advantage of my open-door policy,” the former Anambra State governor said.\nThe move is the government’s latest effort to end the strike which was embarked on by ASUU on February 14, 2022.\nSeveral high-profile personalities including the First Lady of Lagos State, Ibironke Sanwo-Olu, have also waded into the matter.\nShe is concerned that with students at home for over two months, they risk taking up crimes."
  },
  {
    "headline": "Airlines Threaten To Shutdown Services On Monday Over Price Of Jet Fuel",
    "summarized_story": "The Airline Operators of Nigeria have announced suspension of their operations from Monday, May 9, following a rise in cost of jet A1 and other costs.\nThe airlines – Azman Air, Max Air, United Nigeria Airways, Ibom Air, Arik Air, Air Peace, Dana Air and Overland Airways – made this known in a letter addressed to the Minister of Aviation, Hadi Sirika while copying the Director General of the Nigerian Civil Aviation Authority, Captain Musa Nuhu.\nAviation fuel price (JetA1) has risen from N190 per litre to N700 and the airlines have revolted, stressing that no airline in the world can absorb the astronomical hike.\nREAD ALSO: Airline Operators Threaten To Sue FGThe airlines said with the current fuel hike, it has increased its fuel cost component from 40% to 95% in Nigeria and also affected the cost of a seat per head which should be at least N120,000.\nThe operators appealed to passengers for understanding as the situation is currently biting."
  },
  {
    "headline": "UPDATED: South West United To Produce Next President – Akande",
    "summarized_story": "A former governor of Osun State Chief Bisi Akande says the South West is united and will work to produce Nigeria’s next president.\nHe made the comment while speaking to journalists at the end of a meeting of presidential aspirants of the All Progressives Congress (APC) from the South West.\nThe meeting, which was held on Friday at the Lagos House in Marina, had Vice President Yemi Osinbajo; a former Lagos State governor, Bola Tinubu, and some governors in the region in attendance.\nThe ministers of works and housing; trade and industry and investment, and interior amongst others also attended.\nThe meeting was convened by Akande and a former Ogun State governor Olusegun Osoba."
  },
  {
    "headline": "Biden Appoints First Black White House Press Secretary",
    "summarized_story": "US President Joe Biden on Thursday named Karine Jean-Pierre as the next White House press secretary, the first Black person to hold the high-profile post.\nAlso visibly moved, the future press secretary said: “This is a historic moment and it’s not lost on me.\nFrom May she’ll take center stage at the daily White House press conference, which is broadcast live and highly scrutinized.\nBefore her, only one other Black woman, Judy Smith, had been deputy White House press secretary, during George H.W.\nJean-Pierre was previously chief public affairs officer for liberal advocacy group MoveOn.org and worked as a political analyst with NBC and MSNBC, the White House statement said."
  },
  {
    "headline": "Governor Akeredolu asks Godwin Emefiele to resign from CBN -",
    "summarized_story": "The Governor of the Central Bank of Nigeria, Godwin Emefiele, has reportedly picked the All Progressives Congress N100m presidential nomination and expression of interest form.\nGodwin Emefiele was first appointed the CBN governor in 2014 and has since remained at the apex bank through a second term given him by the Muhammadu Buhari administration.\nAbubakar Badaru, Mr Godwin Emefiele, Sen. Ahmed Sani Yerima, Sen. Ajayi Borroffice, Mrs Uji Ohnenye, Pastor Nicholas Felix Nwagbo, Hon.\nThe Senior Advocate of Nigeria conceded that it is within the constitutional rights of the CBN governor belong to any group of his choice and vie for any office he desires.\nIt also confirms the illegality of the act should he proceed to submit the forms while occupying the seat as Governor of the Central Bank of Nigeria."
  },
  {
    "headline": "Makinde receives PDP Southwest Special Reconciliation Committee -",
    "summarized_story": "Oyo State Governor, Seyi Makinde, has advised the Special Reconciliation Committee of the South West Peoples Democratic Party to ensure it speaks truth to power in the course of its assignment.\nMakinde, who received the Barrister Eyitayo Jegede-led Committee at his office in Ibadan, said that the team should be ready to apportion blames where necessary.\nThe Special Reconciliation Committee is saddled with the task of resolving the crisis in the Lagos and Osun State chapters of the party.\nAccording to him, genuine reconciliation is necessary, while the Committee must explore all avenues that will ensure full reconciliation.\nSpeaking earlier, the Chairman of the Special Reconciliation Committee, Barrister Eyitayo Jegede, SAN, said that the committee’s mandate was basically to end all rifts and disagreements with the fold of the party in the region, especially in Lagos and Osun states."
  },
  {
    "headline": "South-west APC leaders meet presidential hopefuls in Lagos",
    "summarized_story": "Vice-President Yemi Osinbajo, Bisi Akande, former interim chairman of the All Progressives Congress (APC) and the national leader of all progressive congress, Asiwaju Bola Ahmed Tinubu are currently at a meeting involving south-west leaders of the party and presidential hopefuls from the region.\nThe meeting, which is holding in Lagos, is said to be focused on presenting a united front for the region on securing the party’s presidential ticket.\nAlso present at the meeting are Femi Gbajabiamila, speaker of the house of representatives, as well as APC governors from the south-west region."
  },
  {
    "headline": "Lagos APC Endorses Governor Sanwo-Olu, Deputy, Hamzat for Second Term in Office -",
    "summarized_story": "The National Leader of All Progressive Congress (APC), Asiwaju Bola Tinubu, and other stakeholders of the state chapter of the party have officially endorsed Governor Babajide Sanwo-Olu and his Deputy, Obafemi Hamzat, for another term in office.\nThe decision was taken after an APC Stakeholders meeting held at the Lagos House in Ikeja.\nThere had been rumours over the last few days of an alleged plan by the Leadership of the APC in the State to deny the governor and his deputy another shot at leading Lagos State like his predecessor, Akinwunmi Ambode."
  },
  {
    "headline": "Nigerian Airlines to Suspend Operations from May 9 over High Cost of Aviation Fuel",
    "summarized_story": "The Airline Operators of Nigeria (AON) has served notice of ceasing operations on Monday, May 9, over the high cost of aviation fuel otherwise known as JetA1.\nThe operators revealed that aviation fuel is about 40% of an airline’s operating cost globally but the recent hike in prices has shot up Nigerian airlines’ operating cost to about 95%.\nOvertime, aviation fuel price (JetA1) has risen from N190 per litre to N700 currently.\nWhile aviation fuel worldwide is said to cost about 40% of an airline’s operating cost globally, the present hike has shut up Nigeria’s operating cost to about 95%.\nAllen Onyema, Chairman, Air PeaceCC: Honourable Minister of Aviation DG, Nigerian Civil Aviation AuthorityDemola Ojo"
  },
  {
    "headline": "U.K. Recognises IPOB As Terrorist Group + Bakare Obtains N100M APC Form – Trending With Ojy Okpe",
    "summarized_story": "The government of the United Kingdom has made a U-turn on its treatment of members of the Indigenous People of Biafra recognising Nigeria’s classification of the group as a terrorist organisation.\nNigerians have shared mixed reactions after Pastor Tunde Bakare obtained the one hundred million naira All Progressive Congress presidential nomination and expression of interest forms."
  },
  {
    "headline": "Nigeria: Enough of Blackmail, North Not Afraid of Break-Up, ACF Tells Southern Leaders",
    "summarized_story": "“These Southerners contest the facts that the North has 78% of the landmass of Nigeria.\nThey refuse to accept that the North has over 55% of the population of Nigeria.\nBut in-spite of this, some southern politicians are furious, issuing dare warnings against the election of any Northerner as president.\nGone are the days when Northerners felt blackmailed and intimidated by threats of re-structuring, secession, break up or break down of Nigeria.\n“The North does not seek to dominate any part of the country but will not submit itself to be relegated to serfdom."
  },
  {
    "headline": "Price of Jet Fuel Rises Further in Nigeria, Hurting Airlines",
    "summarized_story": "Many Nigerian airlines were shocked on Thursday when they were informed by oil marketers that aviation fuel had risen from N500 per litre to N680 per litre.\nThe marketers published the new prices as follows: Lagos, N600 per litre, Abuja, N650 per litre and Kano N680 per litre.\nRelatedStories No Content AvailableBut the Airline Operators of Nigeria (AON) which is billed to meet today, hinted that airlines might not pass the high cost of aviation fuel to their customers, but could decide to take the matter to government.\nA top official of one of the airlines told THISDAY that despite the resolution reached by industry stakeholders in March, that the price of fuel be pegged at N500, pending the determination of a substantive uniform price, the fuel marketers decided to increase the price to N680.\nThe Head of Communication of Dana Air, Kingsley Ezenwa told THISDAY that AON would be meeting today to deliberate over the increase."
  },
  {
    "headline": "Buhari ‘Impressed’ with Ebonyi Governor Umahi’s Performance",
    "summarized_story": "President Muhammadu Buhari on Thursday said he was impressed with the performance of Ebonyi State Governor, Engr.\nThe president has commissioned several projects constructed by the Umahi administration in the governor’s hometown Uburu, Ohaozara Local Government Area of the state.\nBuhari also commended the governor for ensuring the projects were of high quality.\nUmahi during the commissioning, appealed to the federal government to take over the university’s teaching hospital because it was beyond the scope of any state to manage.\nHe thanked the president for his numerous assistance towards the realisation of the King David University of Medical Sciences, noting that the edifice was three years old."
  }
]