[
  {
    "headline": "Youth unemployment, a time bomb in North – ACF",
    "summarized_story": "It also said thet youth unemployment in the region was a time bomb.\nThe statement added, “Similarly, the board decried the lack of media houses in the north to keep the citizens of the north well informed.\n“The board observed that without a sound financial foundation and backing, the north will always remain backward.\n“On the problems of unemployment in the north, the board said it is regrettable that the north has not realised it is sitting on a time bomb which can explode at any time.\nThe ACF said the development showed that the government was capable of handling security matters."
  },
  {
    "headline": "NBA faults planned Land Use Act review, SANs say move suspicious",
    "summarized_story": "The Secretary to the Government of the Federation, Boss Mustapha, had on Thursday said the Federal Government was reviewing the Land Use Act of 1978.\nI won’t support violation of Land Use Act- MakindeBut Makinde said the Land Use Act of 1978 vested the control of land in each state in the governor.\nAccording to the Nigerian constitution, only the National Assembly can review or amend the Land Use Act.\nNevertheless, I view with suspicion the attempt by the President to review the Land Use Act, considering his stance on this grazing issue.\nAlthough the President can initiate this process, it has to first pass through the National Assembly; there is no other way."
  },
  {
    "headline": "Security expert advocates measure to boost Police morale -",
    "summarized_story": "He advocated a change of the current negative attitude towards the police and insisted that to boost the morale of police officers, citizens must also play the role of showing love, care, and appreciation.\nHe said: “Until we begin to change this negative attitude, we may not get the kind of police we desire.\n“Showing love to police officers’ wives, husbands, children, and relatives around you, gives, them the impression that they are respected and are obliged to do more.\n“No nation can survive in this world without police, as long as lives, properties, law, and order are concerned in that nation.\n“I’m looking for a time when our governors will declare a day as “POLICE APPRECIATION DAY” (PAD) Just to encourage them.”Vanguard News Nigeria"
  },
  {
    "headline": "Delta Poly Rector tasks students on payment of service charge",
    "summarized_story": "He said: “Many of the students have not paid their service charges.\nBut what we did this year is, before the results are brought here, they are taken to Bursary to confirm those that have paid the charges.\n“So it is those that are confirmed that the academic board will consider their results and release.\nFor those who have not paid the service charges, we would not release their results.\nSo if you want to see your result, go and pay the service charges."
  },
  {
    "headline": "Nigeria misses out on $4.4bn World Bank COVID-19 vaccine rollout package earmarked for 51 countries",
    "summarized_story": "By Sola OgundipeThe World Bank has announced a provision of $4.4 billion for the purchase and deployment of COVID-19 vaccines for 51 developing countries, but Nigeria is not listed among the benefiting countries half of which are in Africa.\nSince the start of the COVID-19 pandemic, the World Bank Group has approved more than $150 billion to fight the health, economic, and social impacts of the pandemic.\nSpeaking on the development, World Bank Managing Director of Operations, Axel van Trotsenburg, said: “The World Bank is helping developing countries in every region of the world with vaccine purchase and rollout.\nThe Bank is also convening a task force with the IMF, WHO, WTO, and other partners to track, coordinate, and advance delivery of COVID-19 vaccines to developing countries.\nHowever, only 59 percent have developed plans to train the large number of vaccinators needed and less than half have a plan in place to generate public confidence, trust, and demand for COVID-19 vaccines."
  },
  {
    "headline": "PIB: Petroleum Minister, NNPC GMD to brief Senators in closed session Thursday",
    "summarized_story": "President of the Senate, Ahmad Lawan, has said that the Minister of State for Petroleum Resources, Timipre Sylva and the Group Managing Director of the Nigerian National Petroleum Corporation (NNPC), Mele Kyari, would tomorrow brief Senators in a closed session ahead of the consideration of the Petroleum Industry Bill by the upper chamber on Thursday.\n“The Minister of State, Petroleum Resources, as well as the GMD NNPC would brief us on some of the details and make clarifications on the PIB.\n“That closed session will start at 10:00 a.m, so that we have some time before we start our plenary.\n“[And] tomorrow’s session will be dedicated to the consideration of the Petroleum Industry Bill for the whole day.\n“I will urge that we avail ourselves tomorrow by 10 am, so that we listen to the Minister of State, Petroleum Resources, and the GMD NNPC."
  },
  {
    "headline": "Tunji Bello at 60: He is an accomplished administrator —Ogunsan -",
    "summarized_story": "The Chairman of Executive Group and Board Member, Lagos State Security Trust Fund (LSSTF), Dr. Ayo Ogunsan, has described the Lagos State Commissioner for Environment and Water Resources, Mr. Tunji Bello, as an accomplished administrator.\nLending his voice to the congratulatory birthday messages that have continued to pour in for Bello who clocks 60 today, Ogunsan who hailed Bello, said the public office holder has exhibited enviable leadership qualities deserving an adoration.\n“He is a different personality to different people — say, an environmentalist, political scientist, accomplished journalist, a lawyer — but to me, he is an accomplished administrator with a difference.\n“In the words of John C. Maxwell, “a leader is one who knows the way, goes the way, and shows the way”.\nSir, permit me to say I am grateful and thankful for having you as a brother, leader, role model, and guardian."
  },
  {
    "headline": "Insecurity: Oyetola launches Hunters Group of Nigeria",
    "summarized_story": "The Osun State Governor, Gboyega Oyetola has inaugurated the state chapter of Hunters Group of Nigeria (HGN) to further harness the security apparatuses.\nThe security outfit will complement the efforts of other security agencies in a bid to deliver security in every nook and cranny of the State.\nDemanding all the security apparatus on integrity and diligence, Oyetola charged them to work with police to secure communities and forests.\nHe cautioned the Hunters Group to avoid harassing harmless citizens declaring that they must deliver their duty with all sense of responsibility, integrity, honesty and patriotism.\n“The members of Osun Hunters Group must justify the rigorous selection that qualifies them as Members of this Association and you must carry with you the Omoluabi ethos as you discharge your responsibilities."
  },
  {
    "headline": "Nnamdi Kanu: Buhari asked to order arrest of terrorist, bandit leaders",
    "summarized_story": "The Niger Delta Congress (NDC) says it received news of the arrest of Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB) with “mixed feelings”.\nThe NDC charged President Muhammadu Buhari to extend his government’s action to leaders of terrorists and bandits.\nThe statement reiterated that human beings have basic rights, such as fair hearing, and self determination which the Niger Delta people are considering.\n“The Niger Delta Congress stands with all oppressed groups within and without the Nigerian federation and will be following the situation keenly”, Eni added.\nGrazing Routes: Niger Delta Congress warns Buhari, Malami"
  },
  {
    "headline": "Youths attacking policemen to evade arrest of suspects",
    "summarized_story": "Oyo State Police Command has raised the alarm that some youths are attacking some of its officers in order to evade arrest.\nOsifeso in the statement made available to DAILY POST on Wednesday noted that some youths have been attacking policemen regarding arrest of criminal offenders in some areas in the state.\nThe police alleged that some youths on Tuesday 28th June attacked some policemen in Ajaawa in Ogo Oluwa Local Government Area in the state.\n“Meanwhile, crime fighting effort is intensified in birthing a crime free Oyo state of our collective dreams.\n“In cases of emergency, the Command can always be reached through these emergency control room numbers: 615 (toll free) (OYO STATE SECURITY TRUST FUND), and Oyo State Police Command emergency lines 07055495413 and 08081768614."
  },
  {
    "headline": "Nigerians should buy petrol at N256 per liter",
    "summarized_story": "The Nigerian National Petroleum Corporation, NNPC, has said the cost of Premium Motor Spirit, PMS, in the country should be N256 per litre.\nKyari noted that there is nowhere in the world where Diesel sells more than petrol.\nI am sure many people buy AGO (Diesel) in the market and it is selling at N280/litre in the market Today.\nPIB: NNPC boss, Kyari to brief Senate Thursday – Lawan“So (there is) nowhere in the world diesel sells more expensive than PMS.\nMeanwhile, Kyari had stated that the inability to find a suitable price for petrol is responsible for the continued subsidy scheme."
  },
  {
    "headline": "Oyo Assembly passes audit bill into law",
    "summarized_story": "The Oyo State House of Assembly has passed the Oyo State Audit Bill, 2021 into law.\nThe bill will among other things see to the establishment of the Oyo State Audit Commission.\nMustapha in his contribution, said the essence of the Oyo State Audit Bill is to give room for the Auditor General to perform his/her constitutional roles effectively.\n“Before now there was no Law that made provision for the smooth running of the activities of the Auditor Generals.\n“This is the first time the law will see the light of the day in Oyo State and we have to thank Governor Seyi Makinde for this."
  },
  {
    "headline": "Six states owing N1.8b for exams, says NECO",
    "summarized_story": "By Nicholas Kalu, AbujaThe National Examinations Council (NECO) has said the six states are owing it N1,788,740,509 for examinations.\nOther states owing the examination body are: Adamawa (N281,455,500), Kano (N240,043,000), Gombe (N7,214,150), Borno (N40,027,675) and Niger (N234,453,157).\nNECO Acting Registrar Ebikibina Ogborodi announced this when the House of Representatives Committee on Finance queried him about the non-remittance of N636,778,000 in 2019.\nADVERTISEMENTRead Also; NECO names Ogborodi as Acting registrarWhen Committee Chairman James Faleke asked him about the balance, Ogborodi said NECO could not remit more than it did due to the state governments’ debts.\nThe acting Registrar said NECO had written to relevant authorities to help in the recovery of the money."
  },
  {
    "headline": "VIDEO: How FG re-arrested IPOB’s leader Nnamdi Kanu, by AGF Malami",
    "summarized_story": "For many African customers from Nigeria, Benin, Congo, Burkina Faso and Togo where Hollantex fabrics are developed, there is only..."
  },
  {
    "headline": "TIMELINE of Nnamdi Kanu's arrest, trial",
    "summarized_story": "He was granted bail by Justice Binta Nyako of the Federal High Court, Abuja.\nFebruary 19, 2018 — The Federal High Court in Abuja ordered that Kanu, be separately tried from the rest of his co-defendants.\nNovember 26, 2020 — A Federal High Court in Abuja commenced Kanu’s trial, in his absence.\nJanuary 27, 2021 — The Federal High Court Abuja continued the trial of Kanu.\nJuly 26, 2021 — The Federal High Court, Abuja, ordered that Kanu, be remanded in the Department of State Service (DSS) facility, pending the trial continuation."
  },
  {
    "headline": "Defection: Wike queries Matawalle's integrity, credibility",
    "summarized_story": "By Mike Odiegwu, Port HarcourtRivers State Governor, Nyesom Wike, has slammed his Zamfara State’s counterpart, Muhammad Matawalle, for dumping the Peoples Democratic Party (PDP) for the All Progressives Congress (APC ) saying his integrity and credibility were at stake.\nWike maintained that curfew imposed in the state following attacks on security formation would only be relaxed when he received security briefs from the State Security Council.\nHe said: “I will not lift the curfew until the security people tell me it is time to call off the curfew.\n“Most importantly, these roads have been built to last, freeing up funds for other needs in the future.\nIt is said that it is always cheaper to do it well the first time thereby avoiding costly repairs and repeat works.”"
  },
  {
    "headline": "Nigeria reviews COVID-19 quarantine protocol, insists airlines pay $3,500 for defaulting passengers",
    "summarized_story": "Mustapha stated that defaulting airlines would pay $3,500 as a fine for each defaulting passenger, adding that passengers on board who are non-Nigerians will be denied entry and returned to the country at a cost to the airline.\nThe statement entitled “COVID-19 response: Provisional quarantine protocol for travellers arriving in Nigeria”, reads:‘Non-Nigerian passport holders and non-residents who visited Brazil, India, Turkey or South Africa within 14 days preceding travel to Nigeria, shall be denied entry into Nigeria.\n‘A negative COVID-19 PCR test administered within three days (72 hours) of departure.\nAirlines have been directed not to board passengers with non-PCR COVID-19 tests (such as antigen/or antibody tests), a positive COVID-19 PCR test result or tests performed beyond 72 hours of boarding,’ he stated.\n‘Permit to Travel Certificate/QR Code – generated from the Nigeria International Travel Portal on completion of a health questionnaire, uploading of a negative COVID-19 PCR result and schedule of PCR test at Day-7 of arrival in Nigeria."
  },
  {
    "headline": "Igbo-British lawyers attack Kenyan govt over Nnamdi Kanu’s arrest",
    "summarized_story": "The coalition of Igbo-British lawyers has condemned the arrest of leader of the Indigenous people of Biafra (IPOB), Mazi Nnamdi Kanu, in a foreign land and his forceful repatriation to Nigeria, while fingering Kenya in the plot.\nIn a statement by Attorney E.R Okoroafor in Glasgow, Scotland, the group said Kanu’s arrest was “illegal and archaic.”It accused the Kenyan government of playing a major role “in the illegal detention of the leader of the Indigenous People of Biafra MAZI NNAMDI KANU and subsequent handing him over to the Nigerian government without any due process.”The group said Kanu “entered Kenya with his British passport, and the Kenya government is fully aware of his citizenship status but still went ahead to perpetrated their illegal act which does not only breach the personal human rights of MAZI NNAMDI KANU but also undermine the sovereignty of the British government.”Giving notice to the Kenyan government of a legal action against it, the group said “we shall be heading to the International Criminal Court to rectify the injustice done as it is trite law that injustice to one is injustice to all.\nWe are also by this medium informing the Nigerian government that they have 48 hours to return MAZI NNAMDI KANU to the United Kingdom and if he has any charges to answer to, they should as a nation that is governed by the constitution, pass through the legal means of filing an extradiction notice as failure to do so, we shall not hesitate to term this an a declaration of war on not only on MAZI NNAMDI KANU and IPOB but also on all IGBOS generally, and this we shall vehemently resist with all apparatus of law available at our disposal.”The lawyers warned that “no bodily harm whatsoever must be done to MAZI NNAMDI KANU to avoid a total breakdown of law and other in the fast crumbling entity called Nigeria.”Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "The role Kenyan govt played in extradition of Nnamdi Kanu- Family",
    "summarized_story": "From Stanley Uzoaru,OwerriA sibling of Nnamdi Kanu , Kingsley Kanu, has revealed how his brother and leader of the Indigenous People of Biafra (IPOB) was arrested and returned to Nigeria.\nAccording to Kingsley Kanu, contrary to speculation, Nnamdi Kanu was arrested in Kenya where he claimed to have visited from his base.\n“My brother Nnamdi Kanu demands the right to self-determination for Biafra.\nNnamdi Kanu must be returned home to the UK to his wife and his sons who live here.\nThe British Government must insist upon justice for Nnamdi Kanu.” He stated."
  },
  {
    "headline": "Lauretta Onochie: PDP leaders defy Abuja rain, protest in NASS",
    "summarized_story": "From Fred Itua, AbujaMembers of the national working committee of the Peoples Democratic Party (PDP), on Wednesday, led a protest to the National Assembly, over plans by the Senate to confirm Lauretta Onochie as a national commissioner of the Independent National Electoral Commission (INEC).\nThe letter read: “The National Working Committee (NWC) of the Peoples Democratic Party (PDP) has learnt of the nomination of Mrs. Lauretta Onochie as a Commissioner in INEC by Mr. President and Commander-in-Chief of the Federal Republic of Nigeria.\n“The Nigeria Constitution 1999 as amended clearly prohibits people like Mrs. Onochie, who is very partisan, in fact, a card carrying member of a political party to be appointed into INEC as an electoral umpire.\n“We are, therefore, writing to ask the Chairman to save the Senate President, the Senate itself and Mr. President from being ridiculed.\n“Her confirmation will be a wholesome abuse of democratic tenets and dragging the reputation of the President and the Senate in the political mud."
  },
  {
    "headline": "BREAKING: Senate passes N74.78bn 2021 Police Trust Fund budget",
    "summarized_story": "The Senate on Wednesday approved the sum of N74,773,601,916.30 as the 2021 budget of the Nigeria Police Trust Fund.\nThe approval followed the presentation of the harmonised report of the Senate and the House of Representatives Committees on Police Affairs at plenary.\nChairman Senate Committee on Police Affairs, Senator Haliru Dauda Jika, presented the report.\nDetails later…Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Nnamdi Kanu Now Dot in a Circle, Arrested in Addis Ababa, Remanded",
    "summarized_story": "Kanu, according to the security source, was able to travel to many countries around the world because he holds a British passport.\nWith the money Kanu reportedly garnered through fundraising to “establish his phantom Biafran Republic”, according to the source, Kanu lived large, and that eventually proved to be his undoing.\nKanu returned yesterday to the court of Justice Nyako that had in late 2017 granted him bail.\nThough they pleaded not guilty to the charge, different judges, including Justice Nyako, who heard the case denied their bail.\nHowever, Justice Nyako soft-pedaled following Kanu’s deteriorating health and admitted him to bail to enable him to access quality medical care."
  },
  {
    "headline": "APC’s Good Performance made Matawalle Defect, Says Buhari",
    "summarized_story": "However, the deputy governor of the state, Mr. Mahdi Gusau, who refused to defect with Matawalle, has said the PDP could retrieve its mandate from the governor.\nSpeaking at a rally yesterday in Gusau, Matawalle said that he had been nursing the ambition of leaving his party, PDP, for several reasons.\nThe APC National Caretaker Committee Chairman and Yobe State Governor, Mai Mala Buni, congratulated Matawalle for defecting to the party.\nFor me, I will not defect and will continue as the deputy governor and do the job for which I am elected”The deputy governor also stated that nobody will sack him from office as the deputy governor as he has not committed any offence that could warrant his removal.\nSecondus acknowledged that the deputy governor, Gusau and eight members of the Zamfara State House of Assembly did not defect with the governor."
  },
  {
    "headline": "Senate Receives PIB Report, Begins Consideration Tomorrow",
    "summarized_story": "The Senate also passed an N329.963 billion statutory budget for the Federal Capital Territory (FCT) for the 2021 fiscal year.\nThe PIB report was laid during the plenary by the Chairman of the Joint Committee, Senator Sabo Mohammed.\nSpeaking after the report was laid, the President of the Senate, Dr. Ahmad Lawan, told his colleagues that the report would be considered tomorrow.\nThis was a sequel to the consideration of the report of the Committee on Federal Capital Territory on the FCT Appropriation Bill, 2021.\nHe said: “I will be meeting with the ad-hoc committee on PIB, today by 3 pm to tidy up some things."
  },
  {
    "headline": "Again, FG Shifts Deadline for NIN Verification to July 26",
    "summarized_story": "According to the committee’s report, active telephone lines as of May were 192 million, and a cumulative 95.6 million NIN owners submitted their NIN in the same month.\nIt stated that the trend will continue as long as bulk NIN Verification by NIMC is not in place.\nThe committee’s report said: “It is pertinent to mention that Bulk NIN Verification is still at the Proof-of-Concept (POC) stage since January 2021.\nNIMC needs to confirm a timeline when Bulk NIN Verification will commence.\nWithout Bulk NIN Verification, MNOs would have to resort to overnight Batch NIN Verification processing using the Single NIN Verification API or otherwise invite their customers to visit MNO outlets for Individual NIN verification using the same API."
  },
  {
    "headline": "NNPC to Borrow $3.8bn to Acquire Dangote Refinery Shares",
    "summarized_story": "· Says no petrol price increase in next two monthsEmmanuel AddehThe Nigerian National Petroleum Corporation (NNPC) is planning to borrow $3.8 billion to actualise its agenda of acquiring a 20 per cent stake in Dangote Refinery.\nHe said: “I am not sure Mr (Aliko) Dangote wants to sell his equity in the refinery.\n“Even for this Dangote Refinery, we are not going to take government money to buy it.\nWe are taking 20 per cent equity of the Dangote Refinery.\n“The Declaration of Cooperation (DoC) participants clearly continue to play an important and valuable role in accelerating the oil market rebalancing process,” he stated."
  },
  {
    "headline": "Nigeria’s Problem is Nigerians; Not Ethnicity, Religion – Buhari",
    "summarized_story": "President Muhammadu Buhari has stated that the problem confronting Nigeria is Nigerians, and not ethnicity or religion as being opined in some quarters.\nBuhari noted that Nigerians should be blamed for the injustices rather than ethnicity or religion, not minding the complexities of the Nigerian condition.\nHe said, “Our problem is not ethnicity or religion, it is ourselves.\n“I’ve taken you round this to prove that our problem is not ethnicity or religion.\nAnd I’ve been everything; Governor, Minister of Petroleum Resources, Head of State, President and in my second term."
  },
  {
    "headline": "Nigeria’s Problem is Nigerians; Not Ethnicity, Religion – Buhari",
    "summarized_story": "President Muhammadu Buhari has stated that the problem confronting Nigeria is Nigerians, and not ethnicity or religion as being opined in some quarters.\nBuhari noted that Nigerians should be blamed for the injustices rather than ethnicity or religion, not minding the complexities of the Nigerian condition.\nHe said, “Our problem is not ethnicity or religion, it is ourselves.\n“I’ve taken you round this to prove that our problem is not ethnicity or religion.\nAnd I’ve been everything; Governor, Minister of Petroleum Resources, Head of State, President and in my second term."
  },
  {
    "headline": "Nigeria’s Problem is Nigerians; Not Ethnicity, Religion – Buhari",
    "summarized_story": "President Muhammadu Buhari has stated that the problem confronting Nigeria is Nigerians, and not ethnicity or religion as being opined in some quarters.\nBuhari noted that Nigerians should be blamed for the injustices rather than ethnicity or religion, not minding the complexities of the Nigerian condition.\nHe said, “Our problem is not ethnicity or religion, it is ourselves.\n“I’ve taken you round this to prove that our problem is not ethnicity or religion.\nAnd I’ve been everything; Governor, Minister of Petroleum Resources, Head of State, President and in my second term."
  },
  {
    "headline": "BREAKING: Bandits Attack Convoy Of Kano State Governor, Ganduje",
    "summarized_story": "There was a shootout between security operatives attached to the convoy of Kano State Governor, Dr Abdullahi Ganduje, and some armed bandits along Shema in Katsina State on their way back to Kano from Zamfara State.\nAlthough Ganduje was not in the convoy, it came under attack by bandits who blocked Zamfara, Katsina and Kano Road, around Shema on Tuesday, Vanguard reports.\nGanduje was in Zamfara to attend the formal defection of Governor Bello Matawale into the All Progressives Congress (APC) from the Peoples Democratic Party (PDP).\nBut after the event, Ganduje joined the Jigawa State Governor, Muhammadu Abubakar Badaru, back to Kano, which explains why he was not in his convoy.\nHowever, on their way back to Kano, the convoy came under heavy gun attacks from the bandits, but was repealed by the security operatives attacked to the convoy."
  },
  {
    "headline": "BREAKING: Bandits Attack Convoy Of Kano State Governor, Ganduje",
    "summarized_story": "There was a shootout between security operatives attached to the convoy of Kano State Governor, Dr Abdullahi Ganduje, and some armed bandits along Shema in Katsina State on their way back to Kano from Zamfara State.\nAlthough Ganduje was not in the convoy, it came under attack by bandits who blocked Zamfara, Katsina and Kano Road, around Shema on Tuesday, Vanguard reports.\nGanduje was in Zamfara to attend the formal defection of Governor Bello Matawale into the All Progressives Congress (APC) from the Peoples Democratic Party (PDP).\nBut after the event, Ganduje joined the Jigawa State Governor, Muhammadu Abubakar Badaru, back to Kano, which explains why he was not in his convoy.\nHowever, on their way back to Kano, the convoy came under heavy gun attacks from the bandits, but was repealed by the security operatives attacked to the convoy."
  },
  {
    "headline": "Illegal firearms: Senate passes bill to increase fine from N1,000 to N1m",
    "summarized_story": "An amendment bill seeking to increase the fine for the illegal importation and sale of firearms, from N1,000 to N1 million, has been passed by the senate.\nAdvertisementThe bill titled, ‘Firearms Act 2004 (Amendment) Bill 2021’, was passed on Wednesday after the senate considered the report of its committee on judiciary, human rights and legal matters.\nMichael Bamidele, chairman of the committee, during the presentation of the bill, said the N1,000 fine in the extant act was not punitive enough to deter illegal importation and sale of firearms.\nAdvertisementBamidele noted that the bill gives other law enforcement agencies, besides the police and military, the power to seize and destroy confiscated illegal firearms.\nAdvertisement“This is necessary because the power to confiscate or seize illegal firearms should be all-inclusive and not limited to a particular arm of force or law enforcement agency.”"
  },
  {
    "headline": "Illegal firearms: Senate passes bill to increase fine from N1,000 to N1m",
    "summarized_story": "An amendment bill seeking to increase the fine for the illegal importation and sale of firearms, from N1,000 to N1 million, has been passed by the senate.\nAdvertisementThe bill titled, ‘Firearms Act 2004 (Amendment) Bill 2021’, was passed on Wednesday after the senate considered the report of its committee on judiciary, human rights and legal matters.\nMichael Bamidele, chairman of the committee, during the presentation of the bill, said the N1,000 fine in the extant act was not punitive enough to deter illegal importation and sale of firearms.\nAdvertisementBamidele noted that the bill gives other law enforcement agencies, besides the police and military, the power to seize and destroy confiscated illegal firearms.\nAdvertisement“This is necessary because the power to confiscate or seize illegal firearms should be all-inclusive and not limited to a particular arm of force or law enforcement agency.”"
  },
  {
    "headline": "Uncertainty over Anambra APC guber primary as INEC monitors 'didn't witness voting'",
    "summarized_story": "The Independent National Electoral Commission (INEC) says its monitors mobilised for the June 26 governorship primary of the All Progressives Congress (APC) in Anambra state did not witness voting at the collation centres.\nAdvertisementINEC noted that until its monitors were recalled at 5:30pm, they didn’t witness anything on accreditation, voting, counting of votes, collation, or declaration of results.\nThe commission, in its report on the APC primary, noted that no resolutions were made at the party’s voting centres because of the “unavailability of the election officials between 8am to 5:30pm” on Saturday.\n“The commission’s monitors did not witness accreditation, voting, counting of votes, collation or declaration of result at the voting centres and collation centres up till 5:30pm when the monitors were recalled.\nOn Sunday, Dapo Abiodun, governor of Ogun state and chairman of the APC primary election committee, announced that Andy Uba, a former senator, won the election."
  },
  {
    "headline": "Uncertainty over Anambra APC guber primary as INEC monitors 'didn't witness voting'",
    "summarized_story": "The Independent National Electoral Commission (INEC) says its monitors mobilised for the June 26 governorship primary of the All Progressives Congress (APC) in Anambra state did not witness voting at the collation centres.\nAdvertisementINEC noted that until its monitors were recalled at 5:30pm, they didn’t witness anything on accreditation, voting, counting of votes, collation, or declaration of results.\nThe commission, in its report on the APC primary, noted that no resolutions were made at the party’s voting centres because of the “unavailability of the election officials between 8am to 5:30pm” on Saturday.\n“The commission’s monitors did not witness accreditation, voting, counting of votes, collation or declaration of result at the voting centres and collation centres up till 5:30pm when the monitors were recalled.\nOn Sunday, Dapo Abiodun, governor of Ogun state and chairman of the APC primary election committee, announced that Andy Uba, a former senator, won the election."
  },
  {
    "headline": "British High Commission 'in talks' with FG over Nnamdi Kanu's arrest",
    "summarized_story": "The British High Commission says it is “in the process of seeking clarification” from the federal government regarding the arrest of Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB).\nAdvertisementDean Hurlock, a spokesperson of the British High Commission, disclosed this in a message sent to TheCable on Wednesday.\nKanu, who is also a British citizen, was arrested on Sunday and extradited to Nigeria to face trial for alleged treason.\nAdvertisement“The British High Commission in Abuja is currently in the process of seeking clarification from the Nigerian government about the circumstances of the arrest,” he said.\nAdvertisementFor almost four years after he fled the country, the separatist leader piloted the affairs of IPOB from abroad."
  },
  {
    "headline": "Inside Branch’s ambitious '20% investment' challenge to Nigerian banks",
    "summarized_story": "Four years, ₦40 billion (~$97 million) and three million loans later, the business is evolving.\nIt was the first question Dayo Ademola, Branch Nigeria’s managing director, faced on CNBC in May.\nBoth numbers would give a clearer picture of the returns on their three million loans.\nGoing by its profitability and investor capital, it would appear both metrics are in good health.\nIt will then be intriguing to see customer reaction to the newly launched investment offer."
  },
  {
    "headline": "Eswatini government shuts down internet amid violent pro-democracy protests",
    "summarized_story": "pic.twitter.com/Pk9ao9duio — Swazi News (@SwaziNews) June 29, 2021Eswatini protestors now operating at night burning businesses linked to King Mswati and Government properties.\nESWATINI GOVT orders major network providers to cut internet connection, closes schools, imposes 6pm-5am curfew as protests continue.\nBetween January 2020 and February 2021, internet and social media blackouts were imposed in Uganda, Chad, Tanzania, and Ethiopia.\nKing Mswati III has ruled by decree for more than three decades, with unfettered political power over his 1 million people.\nAmid the protests, reports say the king has fled to neighbouring South Africa although Eswatini’s acting Prime Minister, Themba Masuku, denied the claims on Tuesday."
  },
  {
    "headline": "From Supa Strikas to Startups, Tomi Davies’ approach to Angel Investing",
    "summarized_story": "With this knowledge, he co-founded the Lagos Angel Network in 2012, and a few years after, the African Business Angel Network (ABAN).\nAt Slush, they said we needed an African Angel network to create networks and to educate people on what angel investing is all about.\nI looked at Dotun Suleiman, he was my senior at King’s college and we formed the Lagos Angel Network together.\nIn Nigeria, I’ve been responsible for the South-South Angel Network, Abuja Angel Network and also in Lagos, the women’s only angel network called Rising Tide Africa.\nWe created the Diaspora Angel Network, to co-invest in the local angel networks."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Nigerian healthtech startup, MDaaS Global, raises a $2.3m seed extension, launches e-diagnostic feature",
    "summarized_story": "Diagnostic healthtech startup, MDaaS, secured a $2.3 million seed extension funding and added a new product feature to its array called SentinelX.\nAlongside Opeyemi Ologun and Genevieve Oni, MDaaS Global was born.\nThey began by bringing secondary medical equipment into Nigeria from the US, offering service support, and then distributing it to hospitals via outright sale, rent, or lease.\nThis funding will be channelled toward building more diagnostic centres in Nigeria.\nFor the big picture, the startup is looking to be one of Nigeria’s three largest diagnostic centres."
  },
  {
    "headline": "Technology has supposedly made 81% of Nigerian SMEs optimistic about the next 12 months",
    "summarized_story": "Despite systemic and infrastructural challenges facing Small and Medium Enterprises (SMEs) in Nigeria, Mastercard’s SME Confidence Index claims 81% are optimistic about revenue and growth for the next 12 months.\nThe Confidence Index, the first of its kind, also shows that 74% of SMEs in sub-Saharan Africa are optimistic about the next 12 months.\nCompared to data from the National Bureau of Statistics (NBS), this is 0.41% of the 73,081 SMEs in Nigeria.\nMastercard Payment Index of 2021 reveals that 93% of 15,569 consumers — 14,479 — will consider using advanced methods such as biometrics or QR codes.\nConducted across 18 countries, the Payment Index also shows that 63% of the consumers who used digital forms of payment did so due to the pandemic."
  },
  {
    "headline": "Power potential: Investors tap into DisCos’ underserved franchise areas",
    "summarized_story": "Investors are seeing a path to profitability investing to help troubled power distribution companies improve their network infrastructure across poorly served communities in their franchise areas.\nWhile some have applied for their own independent licences to carve out spaces in areas already allocated to a DisCos, which is poorly served – often resulting in litigation…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "China grew economy on land reform, Nigeria can",
    "summarized_story": "Nigeria’s rigid traditional land tenure system and onerous land titling that excludes many from formal land ownership and also discourages investment in productive activities lend it easily to lessons from other countries with efficient land administration.\nAs done in other countries, Nigeria needs land and property ownership reforms that can unlock its huge stock of…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "#EndSARS to cost Nigerian insurers N20bn",
    "summarized_story": "The looting and vandalism that followed the #EndSARS protest that engulfed Nigeria in 2020 are estimated to cost the nation’s insurance industry N20 billion in claims and handling expenses.\nAt the moment, N5 billion claims has been paid, while a lot more are being processed and adjusted, the Nigerian Insurers Association (NIA), said.\nGaniyu Musa,…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Group Hails UN On Reparation For Africa – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… Urges Criminalisation Of Slavery, RacismBENIN CITY – The Leadership of the NBM of Africa has hailed the decision of the United Nations to grant reparation to Africa for the various crimes committed against the continent.\nThe group in a statement by its National Public Relations Officer (PRO), Mr. Oluwatosin Dixon, on Tuesday made available to newsmen also declared racism as a crime to humanity.\nAccording to the statement, “The NBM of Africa wholeheartedly welcomes Monday’s report by the U.N. High Commissioner for Human Rights, Michelle Bachelet, on reparation to Africa, for various crimes, including slavery and the systemic racism committed against the continent.\n“We demand further that slavery and its other upshoots, including racism be declared crimes against humanity.\n“We, therefore, call on the African Union (AU) to seize the momentum and redouble its effort to ensure that the window so opened for reparation to the continent is quickly actualized.”..."
  },
  {
    "headline": "Obaseki inaugurates 15-man c’ttee to screen political nominees, gives two weeks ultimatum – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, on Tuesday, inaugurated a 15-man committee, charged with the responsibility of screening political nominees that will be appointed into his cabinet.\nObaseki, during the inauguration ceremony at the Government House, Benin City, urged the committee, headed by Prof. Dennis Agbonlahhor, to submit its report on or before 15th of July, 2021.\nOthers are, Osayamwanbor Agbons; Matthew Iduoriyekemwen; Dr. (Mrs.) Bob Osazee; Prof Maureen Isoken Ebomoyi; Prof. Ahmed Uwubamwen; Hillary Otsu and Pastor Osagiede Joseph.\nWe believe that in the next two to three weeks, you will come with what we can work with,” he added.\nIn his response, the Chairman of the Committee, Prof. Agbonlahor said, “We will try as much as possible to deliver on our mandate within the stipulated time.”..."
  },
  {
    "headline": "Obaseki signs audit bill into law, to establish Audit Service Commission, Office of Auditor-General – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, on Tuesday, signed the Edo State Audit Bill 2021 into law to ensure accountability and transparency in governance.\nObaseki, while signing the bill at the Government House in Benin City, thanked the State House of Assembly for expeditiously passing the amendment bill into law.\n“So, the Audit Service Commission, when established, will be made up of reputable and credible persons who will ensure the right thing is done,” he added.\nEarlier, the Speaker of Edo State House of Assembly (EDHA), Hon.\nMarcus Onobun said, “We have passed the bill to repeal the Edo State Audit Law 2019 and enact the Edo State Audit Law 2021, which provides for the establishment of the Audit Service Commission and the Office of the Auditor-General of Edo State and Local Governments and other connected purposes.”..."
  },
  {
    "headline": "New Traffic Directive: EDSTMA Sends out Parking purview, modalities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Poised to make Edo State a dream state, devoid of traffic buildup, the Edo State Traffic Control and Management Agency (EDSTMA) has put out a parking purview/modalities to guide against random parking of vehicles by motorists.\nSpeaking with the Nigerian Observer Newspaper on the road traffic law which comes into immediate effect in the state, Head of Enlightenment, EDSTMA, OMORUYI EGUAVOEN, appealed to motorists to comply with the directive to make for the ease of driving.\nRoutes where cars are to be parked on the right side of the road from Ring Road are – the New Lagos road on Forestry road; from Sapele road on the First East Circular; from Sapele road on the Third East Circular; from Sakponmba road to First East Circular on Igun Street and from Mission road to Akpakpava on Cook road.\nOthers are- Mission road to Akpakpava on James Watt road; to Oba Palace on Plymouth road; from Airport road on Akenzua street; from Akenzua street to Ekenwan road on Stadium road; from Oba Market road up till Isekhere Junction on Ibiwe Street.\nAlso, up to Mission road on Navis Road; from Urubi to Upper Lawani on Lawani Street; from Urubi to New Lagos Road on 3rd Cemetery Street; up to Sapele Road on Adesuwa Grammar School Road and from Sapele Road to Upper Sakponmba on Erediawa Street."
  },
  {
    "headline": "PhD Certificate Scandal: Head of Service’s report affirms ICPC’s indictment of ex-FIIRO boss",
    "summarized_story": "Mr Igwe has been under ICPC investigation for claiming to have secured a PhD at the Universite d’Abomey Calavi, Republic of Benin, but has no certificate to show for it.\nBased on the outcome of ICPC investigation, the FIIRO board suspended him and demoted him to the level he was 18 years ago.\nAfter the outcome of the ICPC investigation, the FIIRO’s governing board said, through the attestation, Mr Igwe earned undeserved salaries for years.\nAfter his suspension by the board, Mr Igwe returned to the Benin Republic University in February 2020 to defend his thesis and was issued another attestation to indicate he completed the PhD.\n“The probing of Mr Igwe has nothing to do again with the appointment of a DG because he is not qualified to be part of the process,” he said."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "PIB: Sylva, Kyari To Brief Senators In Closed Session Thursday",
    "summarized_story": "According to him, the closed session, which is expected to start at 10am, would avail lawmakers the opportunity to seek clarifications on technical aspects of the PIB.\n“The Minister of State, Petroleum Resources, as well as the GMD NNPC would brief us on some of the details and make clarifications on the PIB.\n“That closed session will start at 10:00 a.m, so that we have some time before we start our plenary.\n“[And] tomorrow’s session will be dedicated to the consideration of the Petroleum Industry Bill for the whole day.\n“I will urge that we avail ourselves tomorrow by 10am, so that we listen to the Minister of State, Petroleum Resources and the GMD NNPC."
  },
  {
    "headline": "PIB: Sylva, Kyari To Brief Senators In Closed Session Thursday",
    "summarized_story": "According to him, the closed session, which is expected to start at 10am, would avail lawmakers the opportunity to seek clarifications on technical aspects of the PIB.\n“The Minister of State, Petroleum Resources, as well as the GMD NNPC would brief us on some of the details and make clarifications on the PIB.\n“That closed session will start at 10:00 a.m, so that we have some time before we start our plenary.\n“[And] tomorrow’s session will be dedicated to the consideration of the Petroleum Industry Bill for the whole day.\n“I will urge that we avail ourselves tomorrow by 10am, so that we listen to the Minister of State, Petroleum Resources and the GMD NNPC."
  },
  {
    "headline": "UK Seeks Clarification On Kanu’s ‘Extradition’, Demands Fair Trial",
    "summarized_story": "The arrest and reported extradition of the leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu, have continued to trigger reactions as the government of the United Kingdom, which earlier denied any involvement in the saga, is now seeking clarification from the Federal Government of Nigeria over the circumstances surrounding Kanu’s arrest.\n“He was intercepted through the collaborative efforts of the Nigerian intelligence and security services,” Malami had said.\nKanu was earlier detained at the Kuje correctional center for two years on charges of criminal conspiracy and belonging to an illegal organisation.\nHe was later released on bail in April 2017.\nHe thereafter jumped bail and disappeared from the country on the claim that he fled for his life after soldiers invaded his house."
  },
  {
    "headline": "UK Seeks Clarification On Kanu’s ‘Extradition’, Demands Fair Trial",
    "summarized_story": "The arrest and reported extradition of the leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu, have continued to trigger reactions as the government of the United Kingdom, which earlier denied any involvement in the saga, is now seeking clarification from the Federal Government of Nigeria over the circumstances surrounding Kanu’s arrest.\n“He was intercepted through the collaborative efforts of the Nigerian intelligence and security services,” Malami had said.\nKanu was earlier detained at the Kuje correctional center for two years on charges of criminal conspiracy and belonging to an illegal organisation.\nHe was later released on bail in April 2017.\nHe thereafter jumped bail and disappeared from the country on the claim that he fled for his life after soldiers invaded his house."
  },
  {
    "headline": "APC Group Hails Buhari’s Strides In Agriculture",
    "summarized_story": "The President Muhammadu Buhari-led administration is moving Nigeria steadily towards self-sufficiency in food production in a way that has never been witnessed since independence, a group within the ruling All Progressives Congress (APC) has said.\nThe group operating under the aegies of APC Legacy Awareness and Campaign, which is a voluntary think-tank group of the governing party, made the disclosure on Wednesday.\nA statement jointly signed by officials of the group including Barr.\nSuch policies according to the statement include the inauguration of the National Food Security Council (NFSC), Agriculture for Food and Jobs Plan (AFJP), National Livestock Transformation Plan, the Anchors Borrowers Programme, and National Fertilizer Initiative (NFI).\nIt further stated that the impact of these programmes clearly show that Nigeria’s journey towards prosperity was already afoot."
  },
  {
    "headline": "Nigeria standstill as Buhari’s only son, Yusuf marries his sweetheart in Kano",
    "summarized_story": "President Buhari’s son, Yusuf is getting married to, Zara Nasir Ado Bayero, the daughter of Emir of Bichi, Kano.\nSeveral governors, ministers, government officials and VIPs have been flying to Kano state for the wedding.\nThey are being hosted by the current Emir of Kano who is the older brother of the prospective bride’s father, Emir of Bichi.\nThe bride-to-be, Zara, is a 19-year-old graduate of Brighton University, UK.\nREAD ALSO: Nigerian Bishop makes a comprehensive list of…Her father is the fourth child of the late Emir of Kano, Alhaji Ado Bayero."
  },
  {
    "headline": "Nigerian Bishop makes a comprehensive list of adulterous pastors and politicians",
    "summarized_story": "A Nigerian Bishop, identified as Don Simon Osieme has compiled a comprehensive list of all adulterous pastors and politicians across Isoko land in Delta State.\nThe cleric took to his social media to share the list immediately after his children arrive safely in Texas, USA.\nAccording to him, the list contains profile cases of adultery perpetuated by pastors and politicians with whom, when, and where.\nHe wrote; ADULTERYMANIA SAGA VS THE HIDDEN EYES”Adultery by a wife in Isoko tradition is attempted murder and in some cases very close to me, first-degree murder.\nNo current Isoko House of Assembly member is on this list."
  },
  {
    "headline": "No graduate should be employed without certificate of national service – DG NYSC",
    "summarized_story": "Ukpono Ukpong, AbujaAll Employers of labour in the public and private sector have been warned against employing graduates without demanding for Certificate of National Service.\nThe Director-General, National Youth Service Corps (NYSC), Brig Gen Shuaibu Ibrahim, gave the warning yesterday at the opening ceremony of Corps Legal Aid Workshop, yesterday in Abuja.\nSpeaking further, he advised all employers to present the NYSC certificates of their existing employers to the scheme for authentication.\n“Would like to use this medium to remind all employers in the public and private sectors that it is mandatory to demand the Certificate of National Service or Exemption Certificate duly issued by the National Youth Service Corps before offering employment to any holder of Degree or Higher National Diploma.\nHe urged Legal Officers and Corps Lawyers to redouble efforts at enlightening the general public on the provisions of the NYSC Act."
  },
  {
    "headline": "Senate places 75% import duties on importation of syringes, needles",
    "summarized_story": "Tunde Opalana, AbujaThe Senate has ordered a hike in importation duties on syringes and needles into the country and therefore recommended 75 percent port duties.\nThe two directives were meant to protect local manufacturers, give them enabling environment to contribute to the revenue base of the nation and to reduce unemployment.\n“Importation of syringes and needles is killing local manufacturers making them to lay off staff and preventing them from contributing effectively to the economy.\nThis has been an impediment to local manufacturers attaining this status and preventing their being patronized by organisations using donor funds”.\n“The local manufacturers are actually the highest supplies of syringes and needles for hospitals."
  },
  {
    "headline": "Alleged fraud: FG to arraign Dana Air MD, Hathiramani Ramesh, others – Daylight",
    "summarized_story": "Managing director of Dana Air Hathiramani Ramesh will on October 13 face fraud charges in a Federal High Court, Abuja.\nMr Ramesh and two others will be prosecuted by the Federal Government in suit number CR/101/21.\nAlthough other defendants in the matter were in court on Wednesday, Ramesh was absent.\nThe senior lawyer stated that if his office had known that the matter was slated for Wednesday, he would have politely declined to accept the service.\n“But to the knowledge of counsel to the prosecution, the principal defendant is not in the country which was made known to the prosecution."
  },
  {
    "headline": "Alleged fraud: FG to arraign Dana Air MD, Hathiramani Ramesh, others – Daylight",
    "summarized_story": "Managing director of Dana Air Hathiramani Ramesh will on October 13 face fraud charges in a Federal High Court, Abuja.\nMr Ramesh and two others will be prosecuted by the Federal Government in suit number CR/101/21.\nAlthough other defendants in the matter were in court on Wednesday, Ramesh was absent.\nThe senior lawyer stated that if his office had known that the matter was slated for Wednesday, he would have politely declined to accept the service.\n“But to the knowledge of counsel to the prosecution, the principal defendant is not in the country which was made known to the prosecution."
  },
  {
    "headline": "Bitcoin Fraud: Man Bags Two Years Jail Term in Benue",
    "summarized_story": "The defense counsel, D. M. Kwaghtser pleaded with the Court to temper justice with mercy, that his client has become remorseful.\nJustice Dogo convicted and sentenced James to one year Imprisonment on each count with an option of N50, 000 (Fifty Thousand Naira) fine on each count.\nThe Court further ordered First Bank to close down the account Number 314166765 used to perpetrate the fraud, and forbids the convict from opening or operating any Account within two years.\nThe credit balance in the account was ordered forfeited to Federal Government of Nigeria.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Bitcoin Fraud: Man Bags Two Years Jail Term in Benue",
    "summarized_story": "The defense counsel, D. M. Kwaghtser pleaded with the Court to temper justice with mercy, that his client has become remorseful.\nJustice Dogo convicted and sentenced James to one year Imprisonment on each count with an option of N50, 000 (Fifty Thousand Naira) fine on each count.\nThe Court further ordered First Bank to close down the account Number 314166765 used to perpetrate the fraud, and forbids the convict from opening or operating any Account within two years.\nThe credit balance in the account was ordered forfeited to Federal Government of Nigeria.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Zamfara bandits rain bullets on Ganduje’s convoy, three policemen shot",
    "summarized_story": "Bandits in Zamfara State have rained bullets on the convoy of Kano State Governor, Abdullah Ganduje and injured three policemen in the convoy.\nThe convoy ran into a road block mounted by the bandits on the Zamfara, Katsina and Kano Road, around Shema and on seeing the convoy, the bandits opened fire on it.\nGanduje was not in the convoy when the attack happened, said Kano State Commissioner for Information, Malam Muhammad Garba, who confirmed the incident on Wednesday.\nThe Kano governor was said to have joined his counterpart from Jigawa, Muhammadu Abubakar Badaru, back to Kano, which was what saved his life.\nThe three injured policemen were said to have been taken to the hospital for treatment."
  },
  {
    "headline": "Amina Mohammed opens skills centre in Gombe",
    "summarized_story": "Amina Mohammed, Deputy Secretary General of the United Nations, has inaugurated a skills acquisition centre named after her in Gombe.\nThe centre was built by the national office of Sustainable Development Goals (SDGs) in partnership with Gombe State Government.\n“The skill acquisition centre is for women; they do not have to wait for government jobs because it’s not forthcoming.\nMohammed thanked the SDGs office for constructing a befitting skills acquisition centre in Gombe and bridging gaps in the execution of the programme.\nAdejoke Orelope Adefulire, Senior Special Assistant to the President on SDGs, said the inauguration of the Amina J Mohammed Skills Acquisition Centre was to commemorate her 60th birthday ."
  },
  {
    "headline": "Faces of PDP Senators who fled to APC",
    "summarized_story": "By Kazeem UgbodagaThree Senators belonging to the Peoples Democratic Party, on Wednesday, resigned their membership of the party and defected to the All Progressives Congress (APC).\nThe lawmakers in three separate letters to the Senate President, Ahmad Lawan, attributed their resignation from the opposition party to internal crisis, tyranny and leadership failure within the PDP.\nThe lawmakers who defected are: Senators Sahabi Ya’u (Zamfara North); Lawali Hassan Anka (Zamfara West); and Peter Nwaoboshi (Delta North).\nThe Senate President, Ahmad Lawan, who stopped midway while reading the defection letters as a result of interjections from PDP Senators, jokingly remarked that more defections were underway.\nNwaoboshi’s defection letter reads: “I write to respectfully notify Your Excellency and, indeed, the Senate that I’ve formally joined the All Progressives Congress (APC)."
  },
  {
    "headline": "BREAKING: UK Govt ‘In Talks’ With FG Over Nnamdi Kanu’s Rearrest, Pledges To Assist IPOB Leader",
    "summarized_story": "Nnamdi Kanu, the leader of the Indigenous People of Biafra, has been detained by the Nigerian government, according to the British High Commission.\nThe British High Commission’s spokesperson, Dean Hurlock, said the commission is “in the process of obtaining clarification” from the federal government over Kanu’s re-arrest.\nKanu was extradited to the Federal High Court in Abuja, where he would be tried by Justice Binta Nyako.\nThe IPOB leader is being prosecuted for treason.\nEmmanuel Kanu, Kanu’s brother, revealed that the IPOB leader was apprehended in Kenya over the weekend."
  },
  {
    "headline": "APC Will Die After Buhari’s Tenure In 2023 — PDP",
    "summarized_story": "The Peoples Democratic Party (PDP) challenged President Muhammadu Buhari to stop hallucinating on Wednesday, citing the fact that his party, the All Progressives Congress (APC), will not last beyond May 29, 2023.\nKola Ologbondiyan, the party’s Publicity Secretary, said this in a statement on Wednesday.\n“After all, when such individuals join the APC, all their misdemeanors, which border on corruption, are immediately pardoned.\n“Today, the APC has become a sanctuary of “who is who” in the world of corruption as well as army of terrorist apologists, election riggers and patrons of bandits, kidnappers and vandals.\n“The PDP therefore urges the remaining patriotic Nigerians still trapped in the APC to be courageous and join other compatriots rallying on the platform of the PDP in the collective effort to rescue our nation from the stranglehold of the APC,” the statement said."
  },
  {
    "headline": "Kano Hisbah Bans Use Of Mannequins For Display Of Clothes By Tailors, Boutique Owners",
    "summarized_story": "On Wednesday, the Hisbah, an institution tasked with enforcing Shariah doctrine in Kano State, placed a ban on tailors, grocers, and boutique owners in the state using mannequins to exhibit clothing.\nThis came as the agency threatened to raid those locations to remove the mannequins, calling the use of the mannequins for advertising purposes as idolatry.\nSheikh Aroun ibn Sina, commander of the state Hisbah board, who declared the prohibition in the state, stated that the usage of mannequins by tailors, boutique owners, and others violated Islamic injunctions.\nAccording to him: “Hisbah prohibits the use of mannequins at shops, commercial and private residences and other public places.\nThis violates Islamic provisions, it is also responsible for immoral thoughts among some members of the public, all these are against Islam."
  },
  {
    "headline": "Blame Yourselves For Your Problems Not Religion Or Ethnicity – President Buhari Tells Nigerians",
    "summarized_story": "Nigeria’s challenges, according to President Muhammadu Buhari, are not based on ethnicity or religion.\nAt the State House in Abuja, the President spoke while receiving members of the Muhammadu Buhari/Osinbajo (MBO) Dynamic Support Group.\n“Our problem is not ethnicity or religion, it is ourselves,” the President submitted.\nWhen the President of the court decided that we should present our case, my first witness was in the box.\n“I’ve taken you round this to prove that our problem is not ethnicity or religion."
  },
  {
    "headline": "Breaking: Court frees popular US Comedian, Bill Cosby, from prison",
    "summarized_story": "US comedian Bill Cosby was freed from prison on Wednesday, in a blow to the #MeToo movement, after a US court overturned his conviction for drugging and sexually assaulting a woman 15 years ago.\nThe 83-year-old left SCI Phoenix, a state jail 35 miles (56 kilometers) northwest of Philadelphia, after the Pennsylvania Supreme Court ruled that Cosby had been denied a fair trial.\nCosby, who also starred as a dad and doctor on the hit TV series “The Cosby Show,” in the 1980s, left prison just before 2:30 pm (1830 GMT), a spokesperson for Pennsylvania’s Department of Corrections told AFP.\nHis conviction was the first guilty verdict for sexual assault against a celebrity since the advent of the worldwide reckoning against sexual violence and abuse of power dubbed the #MeToo movement.\nAlthough more than 60 women charged that they had been victims of sexual assault by Cosby, he was tried criminally only for Constand’s assault, since the statute of limitations had expired in the other cases."
  },
  {
    "headline": "Pictures: PDP’s NWC invades National Assembly, protests over appointment of Lauretta Onochie as INEC commissioner",
    "summarized_story": ""
  },
  {
    "headline": "Defection: Zamfara Senators , Nwaoboshi’s move reduce PDP in Senate to 38",
    "summarized_story": "As earlier reported by the Blueprint, membership of Senators on the platform of the Peoples Democratic Party ( PDP) in the Senate, got depleted from 42 to 38 in plenary on Wednesday .\nThe three Senators in their separate letters , hinged their defections from PDP to APC on alleged crises rocking the PDP in their respective states .\nSenator Mohammed Hassan ( Zamfara Central) , had on Tuesday defected from PDP through a letter written to that effect and also on alleged crisis rocking the party in Zamfara State.\nWith the defections , total number of PDP Senators in the Senate now , is 38 while that of APC is 70.\nSenator Ifeanyi Ubah ( Anambra South) of the Young Progressives Party ( YPP) , makes up the 109 seats in the Senate."
  },
  {
    "headline": "Defection: Gov Matawalle has lost his memory – PDP Chairman -NigPilot",
    "summarized_story": "…Says PDP will bounce back in 2023National chairman of the Peoples Democratic Party, PDP, Prince Uche Secondus on Tuesday said Governor Bello Matawalle of Zamfara State must have lost his memory on how he came into office despite the fact that he lost the 2019 governorship election in the state.\nAddressing a press conference at the PDP national secretariat in Abuja, Prince Secondus said Governor Matawalle, who is on the verge of defecting to the ruling All Progressives Congress, APC, came into office on a statutory mandate given to the PDP by the Supreme Court.\nThe governors have one vote but we are after the people, the masses, the people who are suffering under this government.\n“It is a shame for all the governors that left the PDP for fear.\nThey were intimidated by the instrument of this government but am happy that the masses in their state especially in Zamfara none of them left.”"
  },
  {
    "headline": "Defection: Gov Matawalle has lost his memory – PDP Chairman -NigPilot",
    "summarized_story": "…Says PDP will bounce back in 2023National chairman of the Peoples Democratic Party, PDP, Prince Uche Secondus on Tuesday said Governor Bello Matawalle of Zamfara State must have lost his memory on how he came into office despite the fact that he lost the 2019 governorship election in the state.\nAddressing a press conference at the PDP national secretariat in Abuja, Prince Secondus said Governor Matawalle, who is on the verge of defecting to the ruling All Progressives Congress, APC, came into office on a statutory mandate given to the PDP by the Supreme Court.\nThe governors have one vote but we are after the people, the masses, the people who are suffering under this government.\n“It is a shame for all the governors that left the PDP for fear.\nThey were intimidated by the instrument of this government but am happy that the masses in their state especially in Zamfara none of them left.”"
  },
  {
    "headline": "Terrorism: NAF advocates for regional collaboration -NigPilot",
    "summarized_story": "The Hierarchy of the Nigerian Air Force (NAF) on Tuesday said that there is a need for enhanced regional cooperation in the fight against insurgency and terrorism in the West African sub-region.\nIt added that the Armed Forces of Nigeria (AFN) and other armed forces in the region must synergize their efforts in view of the transnational nature of terrorism and its impact on the security of the entire region.\nHe applauded the Senegalese Armed Forces for always being on hand to collaborate with the Nigerian Air Force (NAF) whenever the need arises.\nThe Inspector-General of Senegalese Armed Forces (SAF), General El hadji Daouda Niang said he was in Nigeria to seek collaboration as well as strengthen cooperation between the SAF and the AFN.\nHe commended the NAF and other Services for their commitment to Nigeria’s internal security as well as the regional security of West Africa."
  },
  {
    "headline": "Terrorism: NAF advocates for regional collaboration -NigPilot",
    "summarized_story": "The Hierarchy of the Nigerian Air Force (NAF) on Tuesday said that there is a need for enhanced regional cooperation in the fight against insurgency and terrorism in the West African sub-region.\nIt added that the Armed Forces of Nigeria (AFN) and other armed forces in the region must synergize their efforts in view of the transnational nature of terrorism and its impact on the security of the entire region.\nHe applauded the Senegalese Armed Forces for always being on hand to collaborate with the Nigerian Air Force (NAF) whenever the need arises.\nThe Inspector-General of Senegalese Armed Forces (SAF), General El hadji Daouda Niang said he was in Nigeria to seek collaboration as well as strengthen cooperation between the SAF and the AFN.\nHe commended the NAF and other Services for their commitment to Nigeria’s internal security as well as the regional security of West Africa."
  },
  {
    "headline": "2021 UTME: JAMB denies using wrong syllabus, links performance to ill-preparation -NigPilot",
    "summarized_story": "Joint Admissions and Matriculation Board, JAMB, has said that all the 2021 Unified Tertiary Matriculation Examination, UTME, were based on texts prescribed for the examination in its syllabus.\nJAMB was reacting to the candidates’ allegation that the mass failure in the 2021 UTME was as a result of the Board using the old syllabus in setting its questions.\n“The truth of the matter is that all Unified Tertiary Matriculation Examination (UTME) questions are based on texts prescribed for the UTME in its syllabus.\n“For instance, in the 2021 UTME, 1, 415,501 registered for both UTME/DE.\nOut of this figure, 1,340,003 candidates registered for UTME and 75, 498 registered for DE."
  },
  {
    "headline": "Senate Approves N74.7bn Budget For Police Trust Fund",
    "summarized_story": "The Senate has approved the sum of N74,773,601,916 billion as the 2021 budget for the Nigeria Police Trust Fund.\nThe approval followed the consideration of a report by the Joint Committee of the Senate and House of Representatives on Police Affairs during plenary on Wednesday.\nChairman of the Senate Committee on Police Affairs, Dauda Halliru Jika (APC, Bauchi Central), in his presentation, observed that the 2021 NPTF budget is the second since the establishment Act came into being in 2019.\nREAD ALSO: NASS To Consider Petroleum Industry Bill On ThursdayHe disclosed that the total revenue roll-over from 2020 was N23,632,857,141.30.\nGiving a breakdown of the budget, the lawmaker said the sum of N988,279,006.05 is for Personnel Cost; N10,027,610,310.25 for Overheads Expenditure; N11,015,889,316.30 for Recurrent; and N63,757,712,600.00 for Capital Expenditure."
  },
  {
    "headline": "PDP Leaders Storm NASS To Protest Onochie’s Nomination As INEC Commissioner",
    "summarized_story": "Leaders of the main opposition party, the People’s Democratic Party (PDP), on Wednesday stormed the National Assembly in protest.\nThe leaders are demanding the immediate reversal of President Muhammadu Buhari’s nomination of Lauretta Onochie as National Commissioner of the Independent National Electoral Commission (INEC).\nLauretta Onochie is currently the media aide to President Buhari on Social Media.\nHe urged the National Assembly leadership to impress on President Muhammadu Buhari to immediately withdraw her nomination.\nWe are, therefore, writing to ask the Chairman to save the Senate President, the Senate itself and Mr. President from being ridiculed."
  },
  {
    "headline": "Zamfara Lawmaker Killed After Welcoming Matawalle To APC",
    "summarized_story": "Bandits have killed the member representing Shinkafi constituency in the Zamfara State House of Assembly Muhammad Ahmad.\nHe was on his way to Kano after attending a rally to welcome Governor Bello Matawalle of Zamfara State and members of the State House of Assembly to the ruling All Progressives Congress (APC).\nThe Director-General of Media and Publicity in the Zamfara State House of Assembly Mustapha Jafaru confirmed the incident to Channels Television.\nAhmad was buried on Wednesday morning at the Mussallah Eid Cemetery in Gusau, the Zamfara State capital.\nREAD ALSO: Bandits Kill 26 In Deadly Attack On Zamfara StateREAD ALSO: 12 Farmers, 10 Others Killed As Bandits Attack Zamfara CommunitiesBanditry Taking ‘Ugly Dimensions’Banditry and kidnappings have become commonplace in Zamfara State."
  },
  {
    "headline": "Guarantee Nnamdi Kanu’s Safety, World Igbo Congress Tells FG",
    "summarized_story": "The World Igbo Congress (WIC) is calling on the Nigerian authorities to ensure the safety of the self-acclaimed leader of the proscribed Indigenous Peoples of Biafra (IPOB) Nnamdi Kanu, saying the rights of the secessionist leader must be protected.\nKanu who jumped bail in 2017 was rearrested and brought back to Nigeria on Tuesday.\nBut the World Igbo Congress in a statement signed and issued by its chairman Anthony Ejiofor and spokesperson Basil Onwukwe, urged the federal government to treat the IPOB leader according to universally accepted laws.\n“The UK government needs to investigate the collusion of any other country or party in this saga,” the Igbo group further stated.\nOn the other hand, the Igbo has been subjected to massive shoot-at-sight order, arrests and abduction."
  },
  {
    "headline": "Gunmen Kidnap Six Ceramic Workers In Kogi",
    "summarized_story": "Gunmen on Wednesday morning kidnapped six staff of West African Ceramic Company in Ajaokuta Local Government Area of Kogi State.\nThe incident happened in the early hours of the day within the Emiworo community under the Ajaokuta Council.\nSources say the workers were abducted while loading stones which were expected to be delivered in the ceramic site located at Itobe in the same council area.\nThe suspected criminals who were fully armed whisked the six victims away to a yet-to-be-disclosed destination.\nAccording to him, the operatives are still combing the bushes in the local government to see if the gunmen might be lingering close by."
  },
  {
    "headline": "Tinubu Welcomes Governor Matawalle into APC Family",
    "summarized_story": "All Progressives Congress National Leader, Asiwaju Bola Tinubu, has formally welcomed Zamfara State Governor Matawalle to the party, commending him for not succumbing to the coercion and pressure mounted by the Peoples Democratic Party for him to remain with it.\nThe Zamfara governor formally joined the APC on Tuesday at a ceremony in Gusau, the state capital where he was received into APC by the Chairman, Caretaker Committee of the party and Yobe State Governor Mai Buni, and several governors of the party.\nBefore Buni, Governors David Umahi of Ebonyi State and Ben Ayade of Cross River had earlier defected from PDP to APC.\nTinubu said in the statement: “Along with all other All Progressives Congress members, I heartily welcome Governor Bello Matawalle of Zamfara State into the APC.\nAdvertisement“I encourage Governor Matawalle to now work even more closely and cooperatively with President Muhammadu Buhari to help realize his progressive mandate and tackle the challenges that now face us."
  },
  {
    "headline": "Tottenham appoint Nuno Espirito Santo as manager",
    "summarized_story": "Tottenham Hotspurs have appointed former Wolves boss, Nuno Espirito Sancho as manager on a two year deal.\nThe former Wolves boss has signed a two-year deal with the north London club bringing an end to their long-running search for Jose Mourinho’s successor.\nThe Spurs hierarchy have held talks with Antonio Conte, Mauricio Pochettino, Paulo Fonseca, Gennaro Gattuso and Julen Lopetegui since the end of the Premier League season.\nSanto was not a candidate when he left Wolves at the end of the season as Spurs pursued other targets, but emerged as the leading contender in the last week.\nAdvertisementThe Portuguese brought Wolves into the Premier League in 2018 and established them as a top-half side – twice finishing seventh – until last season, when they ended 13th."
  },
  {
    "headline": "APC Group backs President Muhammadu Buhari on food production",
    "summarized_story": "A group within the All Progressives Congress, the APC Legacy and Awareness Campaign says the President Muhammadu Buhari led administration is committed to moving the country towards self-sufficiency in food production.\nThis is contained in a statement in Abuja signed by the leader of the group, Mr Ismail Ahmed.\nThe group expresses satisfaction with the country’s steady progress in repositioning the nation’s economy through agriculture.\nThe statement also explains that President Buhari’s administration will redouble efforts in ensuring that agriculture remains the mainstay of the economy for food security and export.\nIt says it will continue to back the efforts of the President Muhammadu Buhari led administration to move the nation towards self sufficiency in food production and Other sectors."
  },
  {
    "headline": "NNPC Boss Mele Kyari on Equity Aquisition in Private Refineries",
    "summarized_story": "To boost Nigeria’s refining capacity with a view to becoming a net exporter of petroleum products, which is certain to boost the nation’s economy, the Nigerian National Petroleum Corporation revealed that it is currently considering equity participation in a number of private refineries in the country, including a proposed $2.8bn investment in the Dangote refinery.\nThis is in line with a federal government policy directive, which stipulates the mandatory participation of the corporation in any privately owned refinery that exceeds 50,000 barrels per day capacity in keeping with its statutory role of safeguarding national energy security.\nGroup Managing Director of NNPC, Mele Kyari, was on ARISE NEWS’ Morning Show on Wednesday and revealed the country’s oil company is taking concrete steps in transiting into an energy company that will be recognised by international experts.\nKyari assured that the move to seek equity participation in the private refineries would not undercut its commitment to the rehabilitation of its own refineries and the strengthening of the domestic refining sector.\nHe also spoke on a wide range of issues affecting Nigeria’s energy sector."
  },
  {
    "headline": "Bill Cosby Regains Freedom after Court Overturns Sex Assault Conviction",
    "summarized_story": "Pennsylvania’s highest court overturned Bill Cosby’s sex assault conviction Wednesday after finding an agreement with a previous prosecutor prevented him from being charged in the case.\nThe trial judge had allowed just one other accuser to testify at Cosby’s first trial, when the jury deadlocked.\nHowever, he then allowed five other accusers to testify at the retrial about their experiences with Cosby in the 1980s.\nIn May, Cosby was denied parole after refusing to participate in sex offender programs during his nearly three years in state prison.\nThe other accusers knew Cosby through the entertainment industry and did not go to police."
  },
  {
    "headline": "Hong Kong Security Law Has ‘Decimated’ Freedoms, Says Amnesty",
    "summarized_story": "Authorities in Hong Kong are using the national security law that China imposed a year ago to crack down on legitimate dissent, “decimate” the territory’s freedoms and create a climate of fear, Amnesty International said in a report released on Tuesday.\nThe broadly-worded National Security Law (NSL) punishes activities deemed subversion, terrorism, collusion with foreign forces and secession with up to life in prison.\nIn November, four pro-democracy members of the territory’s legislature were disqualified from their seats in the chamber – accused of ‘endangering national security‘.\n“In one year, the National Security Law has put Hong Kong on a rapid path to becoming a police state and created a human rights emergency for the people living there,” Yamini Mishra, Amnesty International’s Asia-Pacific regional director, said in a statement.\nIt found that the government had “repeatedly used ‘national security’ as a pretext to justify censorship, harassment, arrests and prosecutions”."
  },
  {
    "headline": "Dozens Dead as Canada Heatwave Shatters Records",
    "summarized_story": "Dozens of people have died in Canada amid an unprecedented heatwave that has smashed temperature records.\nPolice in the Vancouver area have responded to more than 130 sudden deaths since Friday.\nThe heatwave is due to a dome of high pressure hovering over the north-western US and Canada.\nThe suburb of Burnaby, meanwhile, reported at least 34 sudden deaths and the Surrey area recorded 38.\nThe country’s weather service, Environment Canada, has issued heat warnings for the provinces of British Columbia and Alberta, along with areas of Saskatchewan, the Northwest Territories and Manitoba."
  },
  {
    "headline": "At 100, China’s Communist Party Looks to Cement Its Future",
    "summarized_story": "For China’s Communist Party, celebrating its 100th birthday on Thursday is not just about glorifying its past.\nYet in marking its centenary, the Communist Party is using this past — selectively — to try to ensure its future and that of Xi, who may be eyeing, as Mao did, ruling for life.\nTiananmen Square, where Mao proclaimed the founding of communist China in 1949, is no longer a home for student protesters with democratic dreams.\nOn Thursday, the plaza in the center of Beijing will host the nation’s major celebration of party rule.\nThe anniversary marks a meeting of about a dozen people in Shanghai in 1921 that is considered the first congress of the Chinese Communist Party — though it actually started in late July."
  }
]