[
  {
    "headline": "Ex-DIG says cops’ new dress code illegal",
    "summarized_story": "A retired Deputy Inspector General of Police, Parry Osayande, has faulted the approval of hijab for female police officers by the Inspector General of Police, Usman Baba.\nThe new dress code also allows female officers to wear stud earrings under their berets or peak caps while in uniform.\nOsayende, at a press conference in Benin, Edo State on Wednesday described the newly-approved dress code for female police officers in the country as illegal and unconstitutional.\n“The Constitution of Nigeria is the highest law of the land, and the Constitution says that if any other law is in variance with the constitution, that law will be null and void.\nIf the Attorney General does not know his job, somebody has to teach him,” he said."
  },
  {
    "headline": "Hanifa’s killing: Court dismisses torture, intimidation claims by suspected killers",
    "summarized_story": "Justice Usman Na’aba of a Kano State High Court, on Wednesday, overruled allegations of threat to life, confession under-duress and torture raised by Abdulmaliq Tanko, the prime suspect in the murder of five-year-old pupil of Noble Kiddies Academy, Kano, Hanifa Abubakar.\nAt the resumed trial on Wednesday, Justice Na’aba declared that there was no substantive evidence brought before the court to prove that the suspects were not responsible for their earlier statements.\nIn his ruling on the trial within a trial, Justice Na’aba declared that Abdulmaliq failed to clearly prove the identity of the device, which he claimed was used to penetrate his body parts, and dismissed the suspect’s argument.\nBoth Abdulmaliq and Fatima Musa (third defendant), at the last sitting, denied signing the confessional statements brought by the police.\nSubsequently, Usman sought the court’s permission to order a trial within trial so as to clear the claim and counterclaim."
  },
  {
    "headline": "Ortom asks residents to confront killer herders as gunmen kill five",
    "summarized_story": "Benue State Governor, Samuel Ortom, on Wednesday, reiterated his call to the people of the state to stop crying over herdsmen invasion and instead take up arms to confront the invaders.\nThe governor also fumed over the situation where killer herders take shelter in a neighbouring state, which they use as a launch pad to attack Benue indigenes and residents.\nThe governor said this would help end the invasion of Benue communities by killer herdsmen, who have continued to use the porous nature of the state’s borders to invade hapless communities in Benue State.\n“Let us dislodge these invaders from wherever they may be hiding for peace to return to our communities,” Ortom added.\nThis is another way we can assist the security agencies in combating this menace since it has obviously overstretched beyond limits,” the governor said."
  },
  {
    "headline": "Sack of Umahi: Politicians plotting to takeover over Ebonyi through back door must be jokers – Ebonyi Reps member",
    "summarized_story": "Governor David Umahi of Ebonyi State…APC members should remain calm, law-abidingBy Peter Okutu, AbakalikiThe member representing Ikwo/Ezza South Federal Constituency at the National Assembly, Hon.\nComrade Chinedu Ogah (OON), Wednesday, stated that those politicians plotting to takeover Ebonyi Government House through the back door must be Jokers.\nOgah who is a Chieftain of the All Progressives Congress, APC, Ebonyi State, stated this while briefing newmen on the outcome of Tuesday’s Federal High Court ruling in Abuja.\n“I want to urge all APC members to remain calm and law-abiding as there’s no cause for alarm.\nI want to urge the Governor to be focused on his developmental strides that he is doing in Ebonyi State.”"
  },
  {
    "headline": "CIS, AFEX sign MoU, insist on ethical standards for commodity brokers",
    "summarized_story": "By Luminous Jannamike, AbujaThe Chartered Institute of Stockbrokers (CIS) has said it is looking to introduce a strict ethical standard for commodity brokers.\nSpeaking during the MoU signing ceremony, the President and Chairman of Council, CIS, Mr Tunde Amolegbe, said: “Integrity, ethics and professionalism run through every single activity we do.\nOf course, that is also what is expected as we now partner with AFEX, and we now bring on board, commodity brokers into our institute.\n“The standard which we have set for other professionals playing in other marketplaces is not going to be watered down.\n“My expectation is that, as certified and recognized commodity brokers, they will be able to practice under a code of governance and practice that meets international standards,” Amolegbe added."
  },
  {
    "headline": "2023: Abia professionals hail Sen Orji for supporting power shift to Abia North",
    "summarized_story": "By Steve OkoAbia North Professionals have lauded Senator Theodore Orji for lending his support to the agitation for a power shift to Abia North in 2023.\nSenator Orji had on Sunday gathered some political stakeholders to his Umuahia country home where he told them that power should rotate back to Abia North in keeping with the Abia Charter of Equity.\nHe declared that anybody working against power rotation arrangement in line with Abia Charter of Equity was on a futile voyage.\nAbia North professionals, however, advised politicians from the zone to also observe equity by giving special consideration to the politically marginalized Councils and blocs in the zone.\n” We call on Abia North to also show equity by giving consideration to those LGAs like Isuikwuato, Umunneochi and Arochukwu that have never produced Governor or Deputy”."
  },
  {
    "headline": "Gender bill rejection: Women deserve better, Mrs Osaro-Onaiwu blows hot",
    "summarized_story": "Mrs Joy Osaro-Onaiwu, the coordinator of FCT Women4Women (W4W) Community, has reacted to the news of the National Assembly rejecting the bill that was intended to provide for affirmative action for women in political party administration and for related matters.\n“FCT W4W Community condemns the move and actions of the National Assembly in the strongest term possible.\nNational Assembly rejecting that bill stands condemned.\nRejecting that bill is totally an affront against women in Nigeria.\nThe FCT Women 4 Women group said they will continue to agitate for the place of women in Nigeria to further advance a just society."
  },
  {
    "headline": "Int’l Women’s Day: SWAN urges NASS to reconsider proposed gender/affirmative action bills",
    "summarized_story": "By Peter Okutu, AbakalikiThe Society of Women Accountants of Nigeria, SWAN, Abakaliki proposed Chapter, Tuesday called on the National Assembly to reconsider all the proposed gender and affirmative action bills in the 5th Constitution Amendment Bills.\nThe 10th National Chairperson, SWAN, Nwamara Catherine Nnaji stated this during the 2022 International Women’s Day celebration at Girls High School, Aziyiokwu, Abakaliki.\n“This action by the men of the 9th NASS has taken the country backwards.\n“We are joining Nigerian women to demand that all gender bills be reconsidered.\nEvery woman who has broken the gender barrier and has risen to be a woman of note, we celebrate them today."
  },
  {
    "headline": "Security operatives, bandits die in Kebbi battle",
    "summarized_story": "A team of security agents comprising Nigerian soldiers and policemen are feared dead in Kebbi State.\nThe operatives lost their lives in a gun duel with several bandits, PRNigeria reports.\nThe incident occurred 24 hours after bandits killed dozens of vigilantes in an ambush near Sakaba on Monday.\nAn intelligence source in Kebbi confirmed that security forces engaged the attackers for hours.\nInjured security personnel are receiving treatment at a hospital in the state."
  },
  {
    "headline": "2023 presidency: Only Buhari can convince me to be Amaechi’s running mate – El-Rufai",
    "summarized_story": "Governor Nasir El-Ruffai of Kaduna State has said that he would only run for the 2023 presidency either as a presidential aspirant or a running mate to the Minister of Transport, Rotimi Amaechi if President Muhammadu Buhari insists.\nEl-Rufai insisted that he has no intention to run for presidency or be a running mate to Amaechi as being rumoured on social media.\nHe said Amaechi was free to run for the presidency but maintained that President Buhari is the only one who can convince him to join the race.\nAsked if he would maintain this stand if President Buhari asks him to run for the President or be Amaechi’s running mate, he added, “That would be a different conversation.\nBut I’m tired ."
  },
  {
    "headline": "South West university technologists back moves to embark on strike",
    "summarized_story": "Members of the National Association of Academic Technologists (NAATS), South West zone have on Wednesday, supported the moves by the national body of the group to embark on an indefinite strike.\nThe national body of NAAT had threatened a strike action over what it called the non-implementation of the Memorandum of Agreement it signed with the Federal Government in 2009.\nThe national leadership of NAAT, had on February 28, issued a two-week ultimatum, asking the Federal Government to address all the union’s grievances on or before March 14.\nRising from its zonal executive committee meeting held at the NAAT secretariat, at the Federal University of Agriculture, Abeokuta, Ogun State, NAAT members in the South West said they are battle-ready to join the proposed nationwide indefinite strike, unless their demands were met.\nAddressing newsmen after the meeting, the Zonal Coordinator, Joseph Olurinde, said the South West zone has eleven-point demands from the Federal Government, saying all the demands must be met to avert the looming indefinite strike."
  },
  {
    "headline": "Egbunike: Nigeria Police generally pained – Baba visits family of late DIG",
    "summarized_story": "The Inspector-General of Police, Usman Baba, paid a condolence visit to the widow and family of the late DIG Joseph Egbunike at their Abuja residence.\nBaba urged the family to be strong and focused on upholding the legacies of the deceased.\nHe restated that the late DIG was a man of knowledge, resourcefulness, commitment and diligence in his lifetime.\nBaba said the Force is “generally pained” to have lost a dedicated senior officer who put in 34 years and 7 months of meritorious service to Nigeria.\nThe police chief disclosed that deliberations are in top gear to, in conjunction with the family, arrange befitting burial rites for Egbunike."
  },
  {
    "headline": "Kwara: Court remands four herders for alleged murder of 50-year-old farmer",
    "summarized_story": "A Magistrate’s court sitting in Ilorin, on Wednesday, remanded four herdsmen who allegedly killed a 50-year-old farmer, Samson Alade, in Lanwa village, a suburb area of Kwara State.\nThe victim’s son, Sunday Alabi, reported the case at the Divisional Police Headquarters, Bode Saadu, Moro Local Government Area of Kwara State.\nHe alleged that his father was killed by four Fulani herdsmen, namely, Idris Yusuf, Issa Gambo, Hassan Sheu and Adamu Saleh.\nThe Prosecutor, Inspector Sekunda Olayide, prayed the court to remand the suspects to enable the police complete their investigation into the case.\nTrial Magistrate Foluke Olokoyo, however, said her court lacks jurisdiction to try culpable homicide, but adjourned the matter till March 28, 2022."
  },
  {
    "headline": "Minister urges ITF, others to tackle unemployment",
    "summarized_story": "The Minister of Industry, Trade and Investment Otunba Richard Adeniyi has urged the Industrial Training Fund (ITF) and other sister agencies to show more commitment to the training and retraining of Nigerians, especially youths so as to bridge the gap of unemployment in the country.\nHe also advised them to strive to grow the national economy and resolve other challenges that are currently confronting the country through performing their constitutional duties.\nOtunba Adeniyi stated this at the end-of-the-year performance review for 2021 with the theme “Actualising the ITF Mandate in a VUCA World” in Jos yesterday.\nHowever, the Director-General and Chief Executive Officer (CEO) of the ITF Mr. Joseph Ari said over N1.195 billion was paid last year as students’ industrial works experience scheme as SIWES students supervisory allowances.\nAri also commended stakeholders such as state governments, the organised private sector, NGOs that have collaborated with ITF to equip Nigerians with skills for employability and entrepreneurship."
  },
  {
    "headline": "APC NEC meeting now holds next Thursday",
    "summarized_story": "The Caretaker/Extraordinary Convention Planning Committee (CECPC) of the ruling All Progressives Congress (APC) is to hold an emergency National Executive Committee (NEC) meeting on March 17, 2022.\nThe NEC, which is the highest decision making organ of the party, last met on December 8, 2020.\nNotice of invitation for the meeting, which will be through virtual was signed by nine out of the 12 members of the caretaker committee.\nOthers are Chief David Lyon – South-South representative; Senator Abba Ali – North West representative; Prof. Tahir Mamman – North East representative and Barr.\n“All members of the NEC are by this invitation to take notice of the meeting by Article 12.3.”"
  },
  {
    "headline": "El-Rufai: 19 APC governors endorsed Buni’s removal",
    "summarized_story": "El-Rufai, who spoke on a Channels Television programme, said he had the authority of Chairman of the Progressives Governors Forum (PGF) Kebbi State Governor Atiku Bagudu to explain the action that led to the appointment of Niger State Governor Abubakar Sani Bello as acting chairman of APC.\nHe said 19 of the 23 governors elected on the ticket of the party were on same page on the mission to prevent the party from collapsing.\nBuni and Caretaker Secretary James Akpanudoedehe have been excluded from the revised caretaker committee, inaugurated yesterday by acting Chairman Sani Bello.\nHe said the fate of caretaker secretary James Akpanudoedehe had been decided after he refused to take instruction from acting Chairman Bello who took over on Monday.\nI can tell you that Bello has the full backing of the president and at least 19 of the 23 APC governors."
  },
  {
    "headline": "Umahi under fire for attacking judge",
    "summarized_story": "Faulting the judgment, Umahi accused the judge of being a “hatchet man”, who was “on a mission,” and implied that the judgment was “purchased”.\n“We have petitioned him to NJC (National Judicial Council) and we will follow it up to ensure that this man is brought to justice,” Umahi added.\nUmahi to instead resort to attacking and denigrating the high office of a judge in this unprecedented manner is disgraceful, undemocratic and completely unacceptable…“We view Engr.\nI was doing my projects inspection when the Deputy Governor called to inform me that Ebonyi people are here.\n“The trial court relied on Amaechi v. INEC and Faleke v. INEC when same are no longer the law on the ownership of votes cast in an election,” they said."
  },
  {
    "headline": "INEC registers 111,762 voters in Adamawa",
    "summarized_story": "The Independent National Electoral Commission (INEC) said it has registered 111,762 voters in Adamawa State.\nThe INEC Resident Electoral Commissioner in Adamawa State, Kassim Gaidam said this yesterday in Yola, the state capital, saying 83,395 of the registrations started online, had been completed in the course of the ongoing continuous voter registration (CVR) exercise.\nGaidam said all the figures were as generated from around the 21 local government areas of Adamawa State.\nHe announced that continuous voter registration will be suspended around June this year preparatory to processing the data in readiness for the 2023 general elections.\nHe stated that the next activity dictated by the new electoral act with the 2023 election in view, is conduct of primaries by political parties, commencing on April 4 and ending on June 3, 2022."
  },
  {
    "headline": "Former Iyalode’s daughter assassinated in Ibadan: family source",
    "summarized_story": "From Oluseye Ojo, IbadanThe only surviving daughter of the former Iyalode of Ibadanland, the late Alhaja Aminat Abiodun, Fatimah, is reported to have been assassinated by gunmen in Ibadan, the Oyo State capital, on Wednesday.\nThe former Iyalode was preceded by Wuraola Akintola, and was succeed by the incumbent Iyalode, Chief (Mrs) Theresa Oyekanmi.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nA family source, who preferred anonymity, told journalists: ‘Our sister, the daughter of the late Iyalode Abiodun, was assassinated in Basorun, Bodija area of Ibadan.\nThis is a big loss to the family.’The Police Public Relations Officer,l (PPRO) for Oyo State Police Command, Adewale Osifeso, was contacted to confirm the assassination."
  },
  {
    "headline": "Anambra awards: Obiano honours Obi, Anyaoku, Amaechi, Ekwueme, others",
    "summarized_story": "From Obinna Odogwu, AwkaThe outgoing governor of Anambra State, Chief Willie Obiano, on Wednesday, conferred state awards on some prominent sons and daughters of the state who have contributed to the growth and development of the state.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nThe governor, while presenting the awards to the awardees, said that he was empowered by the Anambra State Honours Law of 1995 to perform the duty.\nAlso awarded are: Senator Uche Ekwunife, Senator Victor Umeh, Chief Victor Oye, Senator Ben Obi, Dame Virgy Etiaba, Justice Onochie Anyachebelu, the state Chief Judge; and Igwe Kenneth Orizu, the monarch of Nnewi Kingdom among others.\nBefore the awards presentation, a book on the governor written by the Chairman of Anambra State Investment Promotion and Protection Agency (ANSIPPA), Ike Chioke, was launched."
  },
  {
    "headline": "FG bans foreigners from buying farm produce directly from farmers",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Federal Executive Council (FEC) presided over by Vice President Yemi Osinbajo, Wednesday approved the immediate ban of foreigners buying farm produce directly from farmers.\nThe move, the government is to ensure that the farmers are no longer cheated in the purchase of their farm produce.\nAccording to Adebayo, over the years, foreigners have been going to the farm gates to buy produce from the farmers at low prices, thus discouraging the farmers from continuing with their trade.\nThis is a copy of the report; IT Project Clearance Performance Report for Government Digital Services 2021.\nSome of the stages of building a system include feasibility study, preliminary investigation, system analysis, system design, system coding, and also system implementation, and also system testing."
  },
  {
    "headline": "Strike: ASUU yet to meet govt demand – FG",
    "summarized_story": "“So when they came, we said okay, fine, we will do user acceptance test, ASUU you’ve built this system, but you are not the one that will use the system.\nThen also you need to have a data center where you need to put that system because just having a system without the data center it will not operate also.\nWe wrote the reports and submitted it back to the Honorable Minister, which he forwarded to all relevant institutions, including ASUU.\n“The second half of the story also, we need to find where to put that system like IPPIS we have a data center built for it.\nThat means we need to have the data center and also that data center, we need to check to make sure it meets minimum requirement."
  },
  {
    "headline": "Court fixes March 23 to hear FG’s request to extradite Abba Kyari",
    "summarized_story": "The application, titled: “Application for the Extradition of Abba Alhaji Kyari to the United States of America,” was dated and filed March 2.\nWhile the AGF is the applicant, Kyari is the respondent in the application.\nThe application was filed under the Extradition Act, as part of Nigerian government’s approval of the request by the U. S. for Kyari’s extradition.\n“Count one: Conspiracy to commit wire fraud in violation of Title 18, United States Code, Sections 1349, ll.\nHe said besides that the offences for which Kyari is accused are extraditable, they are also punishable under the Nigerian laws."
  },
  {
    "headline": "Bello Constitutes APC Convention Sub-committees, Lawan, Masari, Fayemi, Others Appointed Chairmen (Full List)",
    "summarized_story": "Adedayo AkinwaleThe acting Chairman of the All Progressives Congress (APC) has constituted the members of the sub-convention committee of the party ahead of the Mach 26 convention.\nThe Governor of Kastina state, Hon.\nAminu Masari, will head the screening committee, while the President of the Senate, Ahmed Lawan, will chair the screening appeal committee.\nThe Governor of Jigawa state, Abubakar Badaru will head the election committee, while the Governor of Ekiti state, Dr. Kayode Fayemi, heads the Election Appeal Committee.\nClick to see full listShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Senate Confirms Five ICPC Commissioners",
    "summarized_story": "Sunday AborisadeThe Senate on Wednesday confirmed the nominations of five commissioners on the board of the Independent Corrupt Practices and other Related Offences Commission (ICPC).\nThe confirmation of the nominees followed the consideration of a report by the Anti-Corruption and Financial Crimes Committee.\nThe confirmed nominees included Senator Anthony Agbo, Anne Otelafu Odey, Alhaji Goni Ali Gujba, Dr. Louis Solomon Mandama and Olugbenga Adeyanju.\nThe Chairman of the Committee, Senator Suleiman Abdu Kwari (Kaduna North), in his presentation, recalled that one of the nominees, Dr. (Mrs) Mojisola Yaya-Kolade, was withdrawn by President Muhammadu Buhari and replaced with Olugbenga Adeyanju AIG (rtd.\nHe disclosed that the nominees gave in-depth responses to the questions posed by the committee on ways they would fulfill the commission’s mandate."
  },
  {
    "headline": "APC Zones National Chairmanship Position to North-Central, South-West Gets Secretary",
    "summarized_story": "The positions zoned to the South-south are:National Vice Chairman, National Publicity Secretary, National Women Leader, Deputy National Treasurer, Deputy National Welfare Secretary, Zonal Secretary, Zonal Youth Leader, Zonal Organising Secretary, Zonal Women Leader, Zonal Special Leader (Persons with Disabilities – PWD) a d National Ex – Officio member.\nThe positions zoned to the South-west are: National Secretary, National Vice Chairman, National Youth Leader, National Physically Challenged Leader, Deputy National AuditorZonal Secretary, Zonal Youth Leader, Zonal Organising Secretary, Zonal Women Leader, Zonal Special Leader (Persons with Disabilities – PWD) and National Ex – Officio member.\nFor South-east, the positions are: Deputy National Chairman (South), National Vice Chairman, National Treasurer, National Welfare Secretary, Deputy National Organising Secretary, Zonal Secretary, Zonal Youth Leader, Zonal Organising Secretary, Zonal Women Leader, Zonal Special Leader (Persons with Disabilities – PWD) and National Ex – Officio member.\nThe positions zoned to the North-east are: Deputy National Chairman (North), National Auditor, National Vice Chairman (North East), Deputy National Financial Secretary, Deputy National Women Leader, Zonal Secretary, Zonal Youth Leader, Zonal Organising Secretary, Zonal Women Leader, Zonal Special Leader (Persons with Disabilities – PWD) and National Ex – Officio member.\nFor North-west, the positions are: National Vice Chairman (North West), National Legal Adviser, National Organising Secretary, National Financial Secretary, Deputy National, Youth Leader, Zonal Secretary, Zonal Youth Leader, Zonal Organising Secretary, Zonal Women Leader10."
  },
  {
    "headline": "(Breaking) Electoral Act: Senate Rejects Buhari’s Request for Fresh Amendments",
    "summarized_story": "Sunday Aborisade in AbujaThe Senate on Wednesday rejected the amendments sought by President Muhammdu Buhari to the Electoral Act 2022.\nBuhari’s bill seeking the amendments is titled: “A Bill for an Act to amend the Electoral Act 2022 and for related matters, 2022,”It was overwhelmingly rejected by Senators, a development that effectively stopped its second reading.\nThe Bill had earlier scaled first reading on Tuesday despite a court order barring the Senate from acting on it.\nSenate President Ahmad Lawan had on Tuesday, challenged the Court order saying that the Judiciary cannot in any circumstances stop the Legislature from performing its constitutional duties.\nBefore the Senate commenced consideration of the Bill on Wednesday, Senator Adamu Aliero had while citing order 52(5) of the Senate Standing Rules, urged the Senate President to jettison proposed action on the Bill."
  },
  {
    "headline": "APC Stakeholders Mull Soft-landing for Buni, Akpanudoedehe’s Fate Uncertain",
    "summarized_story": "At the same time, there was a pall of confusion yesterday at the national secretariat of the APC over the fate of the National Secretary of the CECPC, Senator John Akpanudoedehe.\nA reliable source privy to the meeting told THISDAY that Bello said both Buni and Akpanudoedehe would be given soft-landing.\nHe insisted that he remained the national secretary of the party until President Buhari says otherwise.\nHowever, following the leadership change that occurred on Monday, Bello later met with APC state chairmen same night at Transcorp Hilton, Abuja.\nBello said his major task was to fix the party and ensure a successful National convention of the party at the stipulated date."
  },
  {
    "headline": "EXCLUSIVE: Mountain Of Fire Ministries General Overseer, Olukoya Asks Family Of Regional Pastor Abducted For 10 Months To Keep Praying",
    "summarized_story": "The General Overseer of the Mountain of Fire and Miracles Ministries International, Dr. Daniel Olukoya, has asked the family of a Regional Pastor, Dan Osato Osamwonyi, abducted 10 months ago to keep praying instead of wasting money on the case.\nThe family alleged that the MFM GO had ignored the family, stressing that up till the moment, no single word or trace of pastor Daniel Osamwonyi had been seen and no call placed for a ransom.\nPastor Daniel Olukoya, General Overseer of the Mountain of Fire and Miracles Ministries (MFM).\nWhat was expected of the G.O was to be actively involved and go to any lengths to make sure his Regional Overseer pastor was found.\n\"This is why we the family are crying out loud for the public to help us ask MFM to rise for Pastor Daniel Osamwonyi, the MFM Regional Overseer,\" the source added."
  },
  {
    "headline": "EXCLUSIVE: Mountain Of Fire Ministries General Overseer, Olukoya Asks Family Of Regional Pastor Abducted For 10 Months To Keep Praying",
    "summarized_story": "The General Overseer of the Mountain of Fire and Miracles Ministries International, Dr. Daniel Olukoya, has asked the family of a Regional Pastor, Dan Osato Osamwonyi, abducted 10 months ago to keep praying instead of wasting money on the case.\nThe family alleged that the MFM GO had ignored the family, stressing that up till the moment, no single word or trace of pastor Daniel Osamwonyi had been seen and no call placed for a ransom.\nPastor Daniel Olukoya, General Overseer of the Mountain of Fire and Miracles Ministries (MFM).\nWhat was expected of the G.O was to be actively involved and go to any lengths to make sure his Regional Overseer pastor was found.\n\"This is why we the family are crying out loud for the public to help us ask MFM to rise for Pastor Daniel Osamwonyi, the MFM Regional Overseer,\" the source added."
  },
  {
    "headline": "BREAKING: Court Fixes March 16 For Hearing Of Businessman, Ned Nwoko’s Trumped-Up Charges Against Activist, Sowore",
    "summarized_story": "“Good morning sir, this is to inform you that the case btw Dr Ned Nwoko and Comrade Omoyele Sowore will be coming up on 16/03/2022 at Federal High Court 8 Abuja.\nYou are expected to be at Abattoir, old SARS Office Abuja by 0830 hours.\nAbubakar was hurriedly arraigned before an Area Court in Kabusa before a judge who was hired by Ned Nwoko to do the hatchet job.\nSaharaReporters on Tuesday reported that an Upper Area Court sitting in Kabusa at the Federal High Court, Abuja, granted Marshal bail.\nOn Monday, Sowore visited the police facility to obtain the charges which they claimed were filed against him by Nwoko."
  },
  {
    "headline": "BREAKING: Court Fixes March 16 For Hearing Of Businessman, Ned Nwoko’s Trumped-Up Charges Against Activist, Sowore",
    "summarized_story": "“Good morning sir, this is to inform you that the case btw Dr Ned Nwoko and Comrade Omoyele Sowore will be coming up on 16/03/2022 at Federal High Court 8 Abuja.\nYou are expected to be at Abattoir, old SARS Office Abuja by 0830 hours.\nAbubakar was hurriedly arraigned before an Area Court in Kabusa before a judge who was hired by Ned Nwoko to do the hatchet job.\nSaharaReporters on Tuesday reported that an Upper Area Court sitting in Kabusa at the Federal High Court, Abuja, granted Marshal bail.\nOn Monday, Sowore visited the police facility to obtain the charges which they claimed were filed against him by Nwoko."
  },
  {
    "headline": "BREAKING: Court Fixes March 16 For Hearing Of Businessman, Ned Nwoko’s Trumped-Up Charges Against Activist, Sowore",
    "summarized_story": "“Good morning sir, this is to inform you that the case btw Dr Ned Nwoko and Comrade Omoyele Sowore will be coming up on 16/03/2022 at Federal High Court 8 Abuja.\nYou are expected to be at Abattoir, old SARS Office Abuja by 0830 hours.\nAbubakar was hurriedly arraigned before an Area Court in Kabusa before a judge who was hired by Ned Nwoko to do the hatchet job.\nSaharaReporters on Tuesday reported that an Upper Area Court sitting in Kabusa at the Federal High Court, Abuja, granted Marshal bail.\nOn Monday, Sowore visited the police facility to obtain the charges which they claimed were filed against him by Nwoko."
  },
  {
    "headline": "ASUU's UTAS failed three integrity tests, says NITDA DG",
    "summarized_story": "Kashifu Inuwa, director-general of the National Information Technology Development Agency (NITDA), says the University Transparency Accountability Solution (UTAS) failed three integrity tests.\nAccording to him, the tests were meant to qualify UTAS — which was brought forward by the Academic Staff Union of Universities (ASUU) — as an alternative payment platform to the Integrated Payroll and Personnel Information System (IPPIS).\n“When we received the request to review UTAS, you know, building a complex system like UTAS that involves employees’ personal data, and also payment system, we have to subject it to best practice tests before approving,” he said.\n“Normally, when we are reviewing that kind of system, we perform three tests.\n“We did all these three tests with them and the system couldn’t pass."
  },
  {
    "headline": "ASUU's UTAS failed three integrity tests, says NITDA DG",
    "summarized_story": "Kashifu Inuwa, director-general of the National Information Technology Development Agency (NITDA), says the University Transparency Accountability Solution (UTAS) failed three integrity tests.\nAccording to him, the tests were meant to qualify UTAS — which was brought forward by the Academic Staff Union of Universities (ASUU) — as an alternative payment platform to the Integrated Payroll and Personnel Information System (IPPIS).\n“When we received the request to review UTAS, you know, building a complex system like UTAS that involves employees’ personal data, and also payment system, we have to subject it to best practice tests before approving,” he said.\n“Normally, when we are reviewing that kind of system, we perform three tests.\n“We did all these three tests with them and the system couldn’t pass."
  },
  {
    "headline": "'PDP misled court' -- Umahi denies criticising judge who ordered his sack as governor",
    "summarized_story": "Dave Umahi, governor of Ebonyi, says lawyers of the Peoples Democratic Party (PDP) misled the judge into issuing the court ruling ordering his removal as governor.\nA federal high court sitting in Abuja had, on Tuesday, ordered the sack of the Ebonyi governor and Eric Igwe, his deputy.\nResponding to the court ruling, Umahi had said the judge did a “hatchet job”, and described the ruling as a “sham”.\nAddressing his supporters on Wednesday, the Ebonyi governor said he did not criticise the judge, adding that the PDP lawyers were to blame.\nThe blame is on the PDP lawyers who misled the judge,” NAN quoted him as saying."
  },
  {
    "headline": "'PDP misled court' -- Umahi denies criticising judge who ordered his sack as governor",
    "summarized_story": "Dave Umahi, governor of Ebonyi, says lawyers of the Peoples Democratic Party (PDP) misled the judge into issuing the court ruling ordering his removal as governor.\nA federal high court sitting in Abuja had, on Tuesday, ordered the sack of the Ebonyi governor and Eric Igwe, his deputy.\nResponding to the court ruling, Umahi had said the judge did a “hatchet job”, and described the ruling as a “sham”.\nAddressing his supporters on Wednesday, the Ebonyi governor said he did not criticise the judge, adding that the PDP lawyers were to blame.\nThe blame is on the PDP lawyers who misled the judge,” NAN quoted him as saying."
  },
  {
    "headline": "Oil price drops to $110 a barrel as UAE push for output hike",
    "summarized_story": "Global oil prices plummeted by over 13 percent as the United Arab Emirates called for an output hike amid supply disruptions caused by sanctions on Russian oil.\nOn Wednesday, Brent crude futures, the global benchmark, fell 13.36 percent to $110, while West Texas Intermediate plunged $12.44 percent to $108.3.\nThey can probably bring about 800,000 barrels to the market very quickly, even immediately, bringing us one-seventh of the way there in replacing Russian supply,” Bob Yawner, director of energy futures at Mizuho, said.\nThe United States had banned the importation of coal, gas and oil from Russia amid the invasion of Ukraine.\nAdvertisementOn the side, Britain had said it would phase out imports of Russian oil by the end of 2022 and consider banning its natural gas."
  },
  {
    "headline": "Why e-commerce is king in Egypt",
    "summarized_story": "Furthermore, a Disrupt Africa report released in January shows that 20% of Egyptian startups are decidedly pursuing opportunities in the e-commerce and retail-tech space.\nLast year, Egyptian e-commerce startups received USD$ 131.27 million; according to Africa: The Big Deal, which is 1.4 times the e-commerce funding Nigeria, Kenya, and South Africa received in the same period.\nToday Egyptian e-commerce is expected to grow at least 30% this year, buoyed by younger shoppers and rising incomes from Egypt’s expanding middle class.\nPhoto: Fady Fouad/UnsplashAs e-commerce accelerated in Egypt, it created a ripple effect on the logistics sector.\nLast year and led by funding into e-commerce and retail tech companies, Egyptian startups raised $403.5 million, according to data from Disrupt Africa."
  },
  {
    "headline": "Fintech innovations on the rise in DR Congo’s nascent startup landscape",
    "summarized_story": "As with most countries in sub-Saharan Africa, access to basic financial services is significantly limited in the Democratic Republic of Congo (DRC).\nA number of startups have sprung up over the past 5 years, which, through fintech innovations, have brought financial services closer to where people live and work.\nSince its launch, Flash has recorded stellar growth and is currently integrated with several banks, mobile money, and telecom operators.\nWe have to work together,” the Okapi Finance founder said.\nWith internet access at around 17%, feature phones – which retail at about $20 – play a huge role in enabling Congolese to access digital finance services."
  },
  {
    "headline": "These women are building Africa’s neobank for the supply chain industry",
    "summarized_story": "Pivo entered the market with Pivo Capital, a credit-focused financial services platform for supply chain small and medium businesses (SMEs), because of the co-founders’ track record in the supply chain industry, especially the logistics aspect.\nWith Amadi-Emina’s experience in the logistics side of the supply chain, having worked and led the port operation effort at Kobo360, Akwiwu’s experience in law, and their collective knowledge of running an exportation business, building a business that serves the logistics arm of the supply chain was a no-brainer.\nLogistics supply chain is Pivo’s first stopIn Africa, access to credit is still one of the biggest challenges small businesses deal with, especially small supply chain businesses.\nImage source: LoriLaunched in September last year, Pivo provides flexible and quick financing options for supply chain businesses like logistics service providers, clearing and forwarding businesses, and FMCG distributors.\nBut to understand what Pivo does, one must first understand how supply chain financing works."
  },
  {
    "headline": "Togolese inventor builds $12,000 mini tractors for the West African market",
    "summarized_story": "It’s a step out of the kitchen and into the field for this award-winning Togolese inventor.\nBetter known in Togo and the region as the “father of Foufoumix” Logou requires little introduction to those who keep an eye on the world of African invention.\nLogou tries to provide local solutions to local problems.\nThe prototype for the tractor, which retails for the local equivalent of $12,000, was built using salvaged parts, with the idea that doing so would help buyers easily access spare parts.\n“I can’t stay in recovery or recycling anymore and I am now manufacturing some of the spare parts of this machinery myself,” he explained."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, What comes to mind when you hear the term \"financial inclusion\"?\nI asked because it has become a..."
  },
  {
    "headline": "After verifying over 300,000 addresses in Kenya, OkHi secures $1.5 million to expand across Nigeria",
    "summarized_story": "Share this article:Smart-addressing startup, OkHi has announced a seed extension round of $1.5 million after a seed round of the same amount in 2020.\nFor example, how is an eCommerce business supposed to deliver an order to the correct location without a reliable method of verifying a customer’s address?\nVerifying one million addressesIn December 2020, the startup launched in Nigeria after reportedly verifying over 300,000 addresses in Kenya.\n“A great use case for that is address verification and being able to use your address to help onboard financial services.\nWhile customers can use their OkHi addresses for free, OkHi charges businesses ₦500 (~$1) every time they verify a customer’s address using OkHi."
  },
  {
    "headline": "How no-code tools helped two UNILAG graduates build omni-channel messaging platform, Ozi",
    "summarized_story": "Soon, they pretty much conducted all their business on the messaging platform and turned into a WhatsApp TV, helping businesses advertise on their statuses for ₦500 or ₦1,000.\nSelf-styled Ozi, the first WhatsApp automation platform in Nigeria, helps users automate their messages on several messaging platforms.\n“So basically, you go to Termii, and you sign up on their website, then if you want to add your WhatsApp messaging channel, you apply for it.\nAccording to Azeez, Ozi frowns on spamming and rarely allows marketers to use the platform.\nAzeez plans to set up a no-code platform to propagate the gospel of no-code and train no-code professionals to meet the rising global need for their services."
  },
  {
    "headline": "South Africa’s spectrum drama",
    "summarized_story": "Share this article:Hello there,So yesterday was International Women’s Day, and most organisations took to social media to show their support.\nAdvertisementHere’s what we’re discussing today:South Africa’s spectrum auctionBitmama’s physical cardsSouth Africa’s spectrum auction beginsA telecom towerAfter more than a decade, South Africa’s spectrum auction is about to commence.\nIn response, one of the foremost cryptocurrency startups in the country, Bitmama, has launched physical cards.\nTypically, crypto debit cards automatically convert cryptocurrencies at the point of transacting to fiat and Bitmama’s card may work similarly.\nChimgozirim Nwokoma Accidental writer, covering Africa’s startup landscape and its heroes."
  },
  {
    "headline": "Nigeria’s petrol subsidy set to surpass N3.36tn oil revenue",
    "summarized_story": "The petrol subsidy to be incurred by the Nigerian government this year looks set to outpace its budgeted oil revenue of N3.36 trillion as global oil prices are expected to remain at record highs.\nBarclays and Rystad Energy said Brent could rise to $200 if Europe and the United States banned Russian oil imports.\n“With slowing oil production and increasing subsidy, Nigeria’s oil revenue will not be enough to pay oil subsidy if the present scenario continues in the global market,” Sheriffdeen Tella, a professor of economics at Olabisi Onabanjo University, Ogun State, told BusinessDay.\nOn Tuesday, the United States announced a ban on Russian oil and other energy imports, in retaliation for the invasion of Ukraine.\n“At some point, we might use all of our oil revenue to pay for subsidy, which will still not be enough,” Tella warned."
  },
  {
    "headline": "Nigeria’s petrol subsidy set to surpass N3.36tn oil revenue",
    "summarized_story": "The petrol subsidy to be incurred by the Nigerian government this year looks set to outpace its budgeted oil revenue of N3.36 trillion as global oil prices are expected to remain at record highs.\nBarclays and Rystad Energy said Brent could rise to $200 if Europe and the United States banned Russian oil imports.\n“With slowing oil production and increasing subsidy, Nigeria’s oil revenue will not be enough to pay oil subsidy if the present scenario continues in the global market,” Sheriffdeen Tella, a professor of economics at Olabisi Onabanjo University, Ogun State, told BusinessDay.\nOn Tuesday, the United States announced a ban on Russian oil and other energy imports, in retaliation for the invasion of Ukraine.\n“At some point, we might use all of our oil revenue to pay for subsidy, which will still not be enough,” Tella warned."
  },
  {
    "headline": "Businesses suffer as diesel price surges 160%",
    "summarized_story": "“The marketers are selling at a price that covers their cost price, import cost and exchange rate price,” said Mike Osatuyi, national operations controller of Independent Petroleum Marketers Association of Nigeria.\nBusiness experts have expressed fear that the spike in diesel price might force more businesses to sack employees amid rising energy costs.\nDiesel is mostly used by businesses, especially manufacturers, to power their generators amid a lack of reliable power supply from the national grid.\n“High diesel cost would trigger higher transportation costs.\nThe NBS data also showed that diesel price was N131.47 in June 2015 when the President Muhammadu Buhari-led administration came into power."
  },
  {
    "headline": "IWD: Obaseki celebrates women, pledges support for more representation in elective positions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…blames Edo Assembly crisis on lack of women representationBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has linked the crisis that rocked the state’s House of Assembly to the lack of women representation in the House, reassuring support for more representation in elective positions.\nObaseki gave the assurance during an event at the Government House, Benin City, to mark this year’s International Women’s Day.\nI will go out there to campaign and more women will be elected into our State House of Assembly.\nRest assured that our government will create more opportunities to support women and build structures that will allow you to achieve your goals,” he assured.\nSpeaking on efforts to end all forms of gender bias in Edo, Obaseki said, “In Edo, we are clear."
  },
  {
    "headline": "Edo partners NAHCON on digital database for Muslims – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government through the Edo State Muslim Pilgrims Welfare Board (EDSMPWB) is partnering with the National Hajj Commission of Nigeria (NAHCON) to develop a digital database of all Muslims in the state.\nThe Chairman, EDSMPWB, Sheik lbrahim Oyarekhua, who received members of the board of NAHCON to the board’s office in Benin City, said the government will continue to prioritize the welfare and wellbeing of Edo Muslims and other residents.\nNAHCON is on an inspection tour of the board’s facilities to ascertain the state’s preparedness for the forthcoming 2022 Hajj exercise to Saudi Arabia.\nAccording to him, the board through the Edo State Government has ensured that the required facilities are on ground to qualify the state for the renewal of the 2022 Hajj.\nAmong the areas inspected by the team were the computer section, conference hall, and the mosque where the Muslim faithful perform their spiritual exercise, among others."
  },
  {
    "headline": "Obaseki mourns passing of Pa Omoregie Idehen – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has mourned the passing of Pa Omoregie Idehen, describing him as a great community leader who contributed immensely to societal development.\nIn a statement, Obaseki noted, “It is with a heavy heart that I mourn the passing of Pa Omoregie Idehen, a great man and community leader, who led a fulfilled life.\n“A hardworking man, Pa Omoregie was a devout family man and showed compassion and courage in equal measure.\n“He will be remembered for his wise counsel and forbearance as well as his commitment to societal development.\n“I commiserate with the Omoregie family and pray that God grants all the fortitude to bear the irreparable loss.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo revs up efforts to address adulteration, hike in fuel price, meets marketers, regulators, others – Nigerian Observer",
    "summarized_story": "He noted that the meeting followed increasing allegations of adulterated fuel and a hike in the price of PMS in Edo State.\nAccording to him, “Following the allegations of adulterated fuel and hike in the price of petroleum products in Edo State, we decided to visit depots within the environs.\n“The Edo State Government is partnering with Nigeria Security Civil Defense Corp (NSCDC) as they have the technology to checkmate adulterated fuel distributed to fuel stations across Edo.\n“I call on all citizens of Edo State to remain calm and never engage in panic buying of petroleum products as it will soon become available everywhere in the state.\nAnything adulterated is bad for consumption; be it food, petroleum products or any other goods or services."
  },
  {
    "headline": "India beats Nigeria to retake position as poverty capital of the world",
    "summarized_story": "Word’s second most populous country, India, has reclaimed its position as the poverty capital of the world, after overtaking Nigeria in the latest report by the World Poverty Clock (WPC).\nThe World Poverty Clock, an online tool that monitors the progress against poverty globally and regionally and provides real-time poverty data across countries, blamed Covid-19 for India’s latest ranking.\nIn 2018, Nigeria held the position with about 87 million people in extreme poverty, compared with India’s 73 million.\nFor Nigeria, WPC said 70 million people are living in extreme poverty, representing 33 percent of Nigeria’s over 200 million people.\nIn 2020, the National Bureau Of Statistics (NBS) said more than 80 million Nigerians live in extreme poverty (on a dollar per day)."
  },
  {
    "headline": "Gov Umahi makes u-turn, apologises to NBA over attacks on judge",
    "summarized_story": "Ebonyi State governor, Dave Umahi, on Wednesday, apologized to the Nigerian Bar Association (NBA) over some uncomplimentary remarks he made against justice Inyang Ekwo, the Abuja High Court judge who ordered his removal as governor.\nThe NBA had in a statement by its president, Olumide Akpata earlier on Wednesday, berated Umahi for attacking the judge and demanded an apology from him.\nHe noted that he has no regrets in defecting to the ruling APC and threatened to engage in battle with the opposition party in Ebonyi State, especially for trying to distract his administration.\n“I’m still the governor of Ebonyi state and I’m still working.\nWe said we will obey the judgement in Ebonyi state."
  },
  {
    "headline": "Soldiers, police killed as bandits run rampage in Kebbi",
    "summarized_story": "In continuation of attacks in Kebbi State, North West Nigeria, bandits on Tuesday attacked the convoy of Samaila Yombe, the state deputy governor, killing a police officer.\nThe attack comes on the heels on the reported killing of about 20 security operatives, including about 15 soldiers by the bandits in the state.\n“Immediately after banning our local security outfit, bandits then moved in and have been killing mercilessly since then.\n“Some hours ago, some soldiers were deployed but unfortunately, the bandits have just killed eight of the soldiers.\n“They killed many of the Bandits; along the line, someone called them and gave them wrong information about the location of the bandits, so that was how they fell into the ambush of the bandits."
  },
  {
    "headline": "Ebonyi gov, Umahi, deputy appeal sack, say high court judge erred",
    "summarized_story": "The duo contended that the apex court had in its decision, held that no constitutional provision prohibited a sitting President or Vice President, and invariably, the Governor or Deputy Governor, from defecting to another political party.\nThey argued that the trial court ought to have dismissed the case of the Peoples Democratic Party, PDP, in view of the clear provision of section 308 of the 1999 Constitution, as amended.\nThey said their was no evidence before the trial court that they had at any time, tendered such resignation.\nThey averred that the trial court erred in law, when it ordered the 1st Respondent (PDP) to submit to the 2nd Respondent (INEC), names of its candidates to replace the Appellants as Governor and Deputy Governor of Ebonyi State.\nThey maintained that Justice Ekwo ought to have been persuaded by subsisting decisions of both the High Court in Ebonyi state and the Federal High Court in Zamfara State, on the issue of detection."
  },
  {
    "headline": "Kaduna Police Parade 220 Suspected Bandits, Armed Robbers",
    "summarized_story": "The Kaduna State Police Command, on Wednesday, paraded 200 suspected bandits and 20 armed robbers.\nAmong those paraded were the prime suspects in the murder of Air Vice Marshal Maisaka (retd), and suspected bandits who allegedly killed over 15 persons at different times.\n“The Kaduna Command during the period under review is not unmindful of the security challenges bedeviling the State amongst which are banditry, kidnappings, armed robbery and farmers/herders clashes just to mention but a few.\n“It is worthy to note that, amid the period CP Mudassiru Abdullahi assumes office few months ago, Kaduna State was witnessing some daunting security challenges.\n“All the suspects being paraded here are currently in various stages of investigation and will be charged to court on completion of investigation.”"
  },
  {
    "headline": "Jubilations As Kaduna Senator Lights Up District, Donates Transformers",
    "summarized_story": "There were jubilations in Kaduna Central senatorial district as Senator Uba Sani donated 11 units of 300KVA transformers to support electrification in communities of the district.\nThe Senator’s gesture was in response to the communities’ complaints over poor power supply resulting from faulty or insufficient transmission plants.\nThe transformers were spread across communities in all the seven local government areas that make up the Kaduna Central senatorial district.\nADVERTISEMENTThe beneficiary local government areas worst hit by the lack of electricity supply include Kaduna North, Kaduna South, Igabi, Chikun and Giwa.\nMaking the donation, Senator Uba Sani pledged to continue to deliver on his campaign promises by prioritising the welfare of his constituents."
  },
  {
    "headline": "7 Officers Injured As NDLEA Arrests Suspected Drug Kingpin In Taraba",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA), has arrested a suspected notorious drug kingpin, Micha Godwin, at Nukai market, along Jalingo-Wukari road in the Taraba State capital, Jalingo, during which seven anti-narcotic officers sustained different degrees of injury.\nThe arrest came after operatives of the NDLEA came under attack from the people loyal to the kingpin, which also led to the damage of the NDLEA operational vehicle.\n“Soon after the arrest of Godwin, miscreants mobilised from the community to attack the officers and vehicles with dangerous weapons.\nI don’t know who invited the boys who attacked the NDLEA officers,” the suspect said.\nADVERTISEMENTHe again warned that henceforth any obstruction or attack on NDLEA operatives in line of duty by suspects or their supporters would receive commensurate response."
  },
  {
    "headline": "How DIG Joseph Egbunike Died – Police",
    "summarized_story": "The Nigeria Police Force (NPF) has denied viral reports that the Deputy Inspector-general of Police in charge of Force Criminal Investigation Department, DIG Joseph Egbunike, slumped and died in his office at the Force Headquarters.\nThe NPF said the senior police officer had health issues which took him to the National Hospital in Abuja where he later died on Tuesday.\nAdejobi wrote: “The late DIG Joseph Egbunike did not slump nor die in the office contrary to the news making rounds.\nHe had health related issues and went to the national hospital abuja where he later died.\nRIP.”ADVERTISEMENTBefore his death, DIG Egbunike headed the Nigerian Police Force Panel which investigated the suspended Deputy Commissioner of Police, Abba Kyari, over the latter’s indictment by the US Federal Bureau of Investigation (FBI)."
  },
  {
    "headline": "JUST IN: U.S. chickens out from giving Ukraine MiG-29 fighter jets, afraid of Russia",
    "summarized_story": "The United States on Wednesday chickened out from supplying MiG-29 fighter jets to Ukraine, saying the move could increase the chances of a Russian escalation with NATO.\nAccording to the U.S., its intelligence community assessed it would be a “high risk” to make the combat jets available to Ukraine.\nNATO ally Poland surprised Washington on Tuesday with a public offer to transfer its Russian-made MiG-29 fighter jets to a U.S. base in Germany as a way to replenish Ukraine’s air force.\nThe United States has sought to speed weapons deliveries to Ukraine.\nRussia’s defense ministry warned this week that countries even offering air fields to Ukraine — let alone flying in fighter jets — for attacks on Russia may be considered as having entered the conflict."
  },
  {
    "headline": "Leaked Sex Video: What Tiwa Savage, Harrysong have in common",
    "summarized_story": "By Nehru OdehNigerian popular singers Tiwa Savage and Harrysong do not just have something in common, they have a thing that binds them together.\nAnd that is the leaked Sex video.\nWhen a blackmailer leaked Savage’s sex video last October it not only set the internet on fire, but also stirred up some amorous feelings in Harrysong.\nIf the “runs” girl eventually releases the sextape, Harrysong will join a long list of celebrities whose sex video have been trending.\nThey include: Tiwa Savage, Oxlade, Nengi,Harrysong got married to Alexa Gopa in 2021."
  },
  {
    "headline": "Gov Buni Remains APC Caretaker Chairman, Senate Caucus Insists",
    "summarized_story": "Solution into the leadership crisis rocking the All Progressives Congress, APC, appears not to be in sight yet as the Senate caucus of the party on Wednesday, declared that Governor Mai Mala Buni, remains the substantive chairman of the Caretaker/Extra-ordinary Convention Planning Committee, CECPC of the party.\nSpeaking with journalists after a second day running emergency meeting of the caucus, the Senate Leader, Dr. Yahaya Abdullahi, said that the storm in the party is now over.\nAbdullahi disclosed that various issues facing the party, were exhaustively deliberated upon with clear indication of peace ahead of the March 26, 2022 national convention of the party.\n“Governor Buni to us, remains the Chairman of National Caretaker/ Extraordinary Convention Planning Committee of the party.\nThe caucus specifically resolved to meet with CECPC of the party , Leaders of Governors Forum and aspirants/candidates from this coming weekend."
  },
  {
    "headline": "Gunmen Kill Late Iyalode Of Ibadan’s Daughter",
    "summarized_story": "Suspected gunmen reportedly invaded the residence of the daughter of the late Iyalode of Ibadan, Fatima, and shot her dead.\nIt was gathered that the hoodlums stormed the home early Wednesday and shot the deceased in the head.\nThey also ruled out an armed robbery attack, saying the hoodlums just shot her dead and fled.\nThe slain Fatimah was said to be the only surviving daughter of the late Iyalode of Ibadanland, Alhaja Aminat Abiodun.\nA family source, who spoke on condition of anonymity, told our correspondent that she just got the news of the demise of her cousin."
  },
  {
    "headline": "BREAKING: Four Feared Dead As Fashola, Buhari’s CoS, Ngige’s Convoy Crashes",
    "summarized_story": "During the inspection of a bridge in Asaba, Delta State, the convoy comprising President Muhammadu Buhari’s Chief of Staff, Prof. Ibrahim Gambari; Minister of Works and Housing, Babatunde Fashola; and his counterpart in Labour and Employment, Christ Ngige, crashed.\nAccording to a report by PUNCH, four police officers were believed to have died in the accident on Tuesday evening.\nWe learned that the driver of the van transporting security officers lost control and crashed into a deep pit.\nAlso, a Delta Line driver, who spoke on the condition of anonymity to our correspondent, stated, “The incident was very fatal.\n“I have not received the accident report, I will get back to you,” he said."
  },
  {
    "headline": "ASUU Strike: Students Protest, Block Lagos-Ibadan Expressway",
    "summarized_story": "The south-west zone of the National Association of Nigerian Students (NANS) has shut down the Lagos-Ibadan expressway in protest of the Academic Staff Union of Universities’ strike (ASUU).\nOn Tuesday, motorists and commuters were stranded on the Lagos-Ibadan expressway when students went to the streets to protest ongoing industrial action and the country’s petroleum shortage.\nAfter the union’s national executive council deliberated, ASUU went on a warning strike on February 14.\nSince then, the federal administration has been meeting with the union to discuss methods to terminate the strike.\nThe government has recently established a committee to revise its 2009 agreement with ASUU, as well as promising that the strike will be finished shortly."
  },
  {
    "headline": "VIDEO: Sunday Igboho breaks silence days after release from Benin Republic detention",
    "summarized_story": "Yoruba Nation activist, Sunday Igboho, has appeared in first video since his release from Benin Republic prison.\nThe Oyo-born activist shared the video via his official Instagram handle with caption “Thank you everyone.”"
  },
  {
    "headline": "[Breaking] Electoral Act: Senate rejects Buhari’s request for amendment",
    "summarized_story": "The Senate Wednesday threw out request of President Muhammadu Buhari for amendment of section 84(12) of the Electoral Act which prevents appointive political office holders from contesting for election from party primary level without resigning.\nAfter the Senate Leader , Yahaya Abdullahi ( APC Kebbi North ) made the lead debate for second reading of the bill, many of the Senators kicked against it and voted no when put to voice votes by the President of the Senate, Ahmad Lawan.\nDetails loading…"
  },
  {
    "headline": "Police DIG, Joseph Egbunike, slumps, dies",
    "summarized_story": "A Deputy Inspector General of Police and the head of the Force Criminal Investigation Department (FCID), Joseph Egbunike has reportedly slumped and died.\nBlueprint gathered that Egbunike collapsed inside his office in Abuja late Tuesday March 8, 2022 and was rushed to the hospital where he was confirmed dead.\nUntil his death, Egbunike was in charge of the highest investigating arm of the Nigeria Police, and headed probe panel investigating suspended deputy commissioner of Police Abba Kyari.\nHis functions include investigation and prosecution of serious and complex criminal cases within and outside the country.\nDetails loading…"
  },
  {
    "headline": "Several Security Operatives Feared Dead As Bandits Attack Kebbi Deputy Governor",
    "summarized_story": "There are fears that several security operatives might have been killed late on Tuesday after bandits attacked the convoy of Colonel Samaila Yombe Dabai (rtd), the Deputy Governor of Kebbi State.\nThe deputy governor was attacked on his way back from Danko-Wassagu Local Government Area of the state where he visited some communities raided by bandits a few days ago.\nAn assessment of the structure and logistics for military operatives in the area was part of the itinerary for the trip.\nThough he could not confirm the numbers of security operatives killed during the assault, the media aide said once the casualty figures are confirmed, the press would be availed the data.\nAbdullahi Abubakar, a native of Danko-Wassagu said the armed bandits rode on motorcycles and laid ambush for the convoy of the deputy governor in Kanya village."
  },
  {
    "headline": "Senate Rejects Buhari’s Request To Amend Section 84 (12) In Electoral Act",
    "summarized_story": "The Senate has thrown out the request of President Muhammadu Buhari for amendment of section 84 (12) of the Electoral Act which prevents appointive political office holders from contesting for election from party primary level without resigning.\nThe Senators kicked against it and voted no when put to voice votes by the Senate President Ahmad Lawan.\nPresident Buhari last week wrote the Senate seeking an amendment of section 84 (2) subsection 12 in the 2021 Electoral Act.\nPresident Buhari stressed that the provision introduced qualification and disqualification criteria that ultra vires the Constitution by way of importing blanket restrictions to serving political officeholders.\nThe Federal High Court in Abuja in a ruling on Monday, March 7 stopped President Buhari, the Attorney General of the Federation, Abubakar Malami, and the Senate President, Ahmad Lawan, from tampering with the newly signed amended Electoral Act 2022."
  },
  {
    "headline": "Umahi Appeals Court Order Sacking Him And His Deputy",
    "summarized_story": "Ebonyi State Governor Dave Umahi has appealed the Federal High Court judgement which ordered the removal of him and his deputy, Eric Igwe, from office.\nThey listed eight grounds of appeal against the lower court’s judgment.\nThey further submitted that there is no provision in the constitution that states that a governor or deputy governor will vacate his office if he defects from his political party to another political party.\nThey, therefore, asked the appellate court to set aside the judgement of the Federal High Court.\nFind below the notice of the appeal as obtained by Channels TV…"
  },
  {
    "headline": "NBA Slams Umahi, Describes Response To Court Order As Executive Rascality",
    "summarized_story": "The Nigerian Bar Association (NBA) has slammed Ebonyi State Governor Dave Umahi for refusing to obey a court order which has asked him to vacate office as governor of the state.\nNBA President, Olumide Akpata, in a statement on Wednesday, described Umahi’s response as “impunity of the highest order and executive rascality taken too far.”Mr Akpata said the NBA has absolutely no interest in the outcome of the case in question and will continue to stay away from partisan politics.\n﻿The NBA, therefore, demand an immediate apology from the governor and a retraction of the comments he made against the person and Judgment of the Hon.\nJustice Inyang Ekwo of the Federal High Court.\nSEE THE FULL STATEMENT BY THE NBA PRESIDENT BELOW…"
  },
  {
    "headline": "Gov. El- Rufai: Our Presidential Candidate Is Expected To Come From The South",
    "summarized_story": "The All Progressives Congress (APC) presidential candidate for the 2023 election is expected to come from the southern region of the country.\n“Our expectation is that our presidential candidate will come from somewhere in the south,” he said during his appearance on Channels Television’s Politics Today.\nAccording to him, the southern caucus of the ruling party will then decide which part of the area the candidate will come from.\nGovernor El-Rufai also believes the APC will retain the presidential seat, arguing that the party has all it takes to do that.\nI’ll explain to him why I don’t think it’s a good idea but of course, if he insists, I will."
  },
  {
    "headline": "Senate throws out PMB proposed Amendment of Electoral Act 2022 -",
    "summarized_story": "The Nigerian Senate has Rejected president Buhari’s Proposal for the Amendment of the 2022 Electoral Act .\nAccording to the Majority of the lawmakers who opposed the Amendment, it will be highly unconstitutional to go against a court ruling delivered by the Federal High Court in Abuja on Monday .\nThe Federal High Court had approved an ex-parte application by the People’s Democratic Party preventing President Muhammadu Buhari, the Attorney General of the Federation and the Senate President from tampering with the newly amended Electoral Act 2022.\nThe Senate President had tried to argue that under no Circumstance can the Judiciary prevent the National Assembly from performing its Legislative functions as it would be considered an Anarchy.\nBut the Lawmakers disagreed with the Senate President’s Position, Advising him that the Senate should await the Outcome of the Appeal already Filed against the Judgement of the Federal High Court."
  },
  {
    "headline": "Federal High Court Abuja sacks 15 Ebonyi Lawmakers over defection -",
    "summarized_story": "A Federal High Court sitting in Abuja has ordered 15 members of the Ebonyi House of Assembly, including the Speaker, who defected from the Peoples Democratic Party (PDP) to the All Progressives Congress (APC) to immediately vacate their seats.\nJustice Inyang Ekwo, in a judgment held that their defection was unlawful and that having abandoned that political party on which platform they stood election, they could no longer occupy the seats.\nJustice Ekwo declared their seats vacant and restrained them from further parading themselves in the capacity of members of the Ebonyi State House of Assembly."
  },
  {
    "headline": "APC Secretary resigns 24hrs after Gov Sani replaces Buni",
    "summarized_story": "Dr John Akpan Udoedehe has resigned as trhe Secretary of the All Progressives Congress Caretaker Committee a day after Governor Sani Bello assumed office as acting Chairman of the party.\nThe Niger state governor had on Monday assumed office as the chairman of the party’s caretaker committee.\nEarlier, there were reports that President Muhammadu Buhari had ordered the sacking of Governor Mai Mala Buni as the chairman of the party."
  },
  {
    "headline": "BREAKING: Repsmake U-turn, to reconsider three Gender bills -",
    "summarized_story": "The House of Representatives has rescinded decisions on three gender bills earlier rejected during the consideration of bills for amendment of the 1999 constitution.\nThe lawmakers have now agreed to reconsider bills Citizenship for foreigners married to Nigerian women, 20 per cent reservation of party positions to women, indigeneship for women married to men from states other than their own statesThe decision is coming at a time civil society groups, have occupied the National assembly, demanding for a revisit of the Gender equality Bill"
  },
  {
    "headline": "Aisha Yesufu Protest + Buhari Pledges Support for Women – Trending With Ojy Okpe",
    "summarized_story": "As the world marked International women’s day on Tuesday March 8th , President Muhammadu Buhari applauded the contributions of women in his administration.\nMeanwhile, human rights activist Aisha Yesufu and many women stormed the National Assembly on Tuesday to protest against the rejection of the gender equity bills.\nFollowing the discussions and controversies surrounding Russia’s invasion of Ukraine an old video highlighting the United Kingdom’s involvement in Nigeria’s civil war has resurfaced."
  },
  {
    "headline": "Nigeria: Senate Rejects Amendement of Electoral Act Despite Buhari’s Request to Expunge Section 84(12)",
    "summarized_story": "The Senate has thrown out President Muhammadu Buhari’s request for amendment of section 84(12) of the Electoral Act.\nThe request was thrown out unanimously by the lawmakers during the consideration of the clause that prevents political appointees from contesting for election from party primary level without resigning.\nAfter the Senate Leader, Yahaya Abdullahi, made the lead debate for second reading of the bill, many of the Senators kicked against it and voted no when put to voice votes.\nDetails later…"
  },
  {
    "headline": "“I Am Proud of My Nigerian Background”- Zain Asher",
    "summarized_story": "The celebration of International Women’s Day will not be complete without highlighting the role of women in journalism who have made gender equality campaigns a front burner issue around the world for decades.\nTo further the discussion on International Women’s Day, the role of women in media, her work life experience and motherhood, is Zain Asher, anchor of CNN Newsroom.\nBased in New York, Zain can also regularly be seen filling in on the network’s premier business programmes – Quest Means Business, The Express and First Move with Julia Chatterley.\nBorn in the UK, Zain graduated from Oxford University where she studied French and Spanish and graduated with a distinction in oral Spanish.\nShe is fluent in French, Spanish and Igbo (her native Nigerian dialect)."
  },
  {
    "headline": "Salihu Lukman: President Buhari Did the Right Thing on Buni",
    "summarized_story": "Prior to the ouster of Governor Mai Mala Buni of Yobe State as the Chairman Caretaker/Extraordinary Convention Planning Committee of the All Progressives Congress, Salihu Lukman, a member of the ruling party, had raised that alarm that Buni was not working in the interest of the APC.\nFor having the temerity to expose Buni’s alleged acts of subterfuge and attempts to defer the national convention of the APC for as long as possible, some powerful elements in the party forced Lukman to resign last January as the Director General of the Progressives Governors’ Forum.\nToday, Lukman has been vindicated for speaking truth to power and is now joining us from Abuja to provide more insight into the antics that led to Buni’s removal at the weekend.\nHe will also be telling us what next steps the APC needs to take to hold on to power in 2023."
  },
  {
    "headline": "Transmission Company of Nigeria Blames GenCos for Nationwide Load Shedding, Worsening Power Supply",
    "summarized_story": "The Transmission Company of Nigeria (TCN) on Tuesday attempted to explain the worsening nationwide power supply, stating that the Generation Companies (Gencos) were not generating enough electricity to be transmitted by the company.\n“The media has been awash with reports that TCN has reduced the load allocation to distribution companies.\nThe correct position is that TCN can only transmit the quantum of power generated by Gencos through the national grid to distribution load centres nationwide.\n“For clarity, TCN does not generate electricity and therefore can only transport cumulative generation from all the generation companies nationwide to distribution load centres.\nThe company noted that presently, the cumulative generation nationwide was low and generation companies have attributed this to several factors including poor gas supply."
  }
]