[
  {
    "headline": "No amount of threat will stop Igbo from demanding rights —Abaribe",
    "summarized_story": "The Senate minority leader, Senator Enyinnaya Abaribe, has warned that no amount of threat against Ndigbo will stop them from demanding equitable treatment in Nigeria.\nAbaribe, who spoke in Enugu on Monday at the inauguration of the Igbonine Organisation, a group advocating a president from the South-East, lamented that the Igbo had been pushed to the fringes in the country.\n“No amount of threat should stop Ndigbo from consistently demanding equitable treatment in Nigeria and that which is our due.\n“If the dominant position in Nigeria today is restructuring, then the minimal demand of Ndigbo in Nigeria cannot be anything less than that of restructuring.\nAbaribe maintained that the Igbo wanted a united country, where they would be emancipated from unfair treatment."
  },
  {
    "headline": "Buhari asks National Assembly to approve N895bn supplementary budget",
    "summarized_story": "The President of the Senate, Ahmad Lawan, on Tuesday, read an official communication from the President, Major General Muhammadu Buhari (retd.\n), asking the National Assembly to approve a supplementary budget of N895bn.\nThe amount had earlier been approved by the Federal Executive Council.\nA large chunk of the money was meant to fund the procurement of military hardware to prosecute the war against insurgency and banditry.\nThe Federal Government is also expected to spend the remaining amount on health-related issuesDetails later…"
  },
  {
    "headline": "FG sets up team to engage with Twitter over suspension",
    "summarized_story": "By Emmanuel ElebekePresident Muhammadu Buhari has approved the composition of the FederalGovernment’s Team to engage with Twitter over the recent suspension ofthe operations of the microblogging and social networking service inNigeria.\nThe approval was announced in a statement in Abuja on Tuesday by theMinister of Information and Culture, Alhaji Lai Mohammed, who willchair the team.\nThe Federal Government’s team also comprises the Attorney General ofthe Federation and Minister of Justice, Minister of Communications and Digital Economy, Minister of Foreign Affairs, Minister of Works and Housing, Minister of State for Labour and Employment as well as other relevant government agencies.\nAccording to the statement, “following the indefinite suspension of its operations in Nigeria, for activities that are capable of undermining Nigeria’s corporateexistence, Twitter wrote to President Buhari seeking to engage withthe Federal Government over the suspension, with a view to charting apath forward.”Vanguard News Nigeria"
  },
  {
    "headline": "BREAKING: Senate Confirms Yahaya as Chief of Army Staff",
    "summarized_story": "Urges him to address the security challenges in the countryBy Henry Umoru – AbujaThe Senate on Tuesday confirmed the appointment of Major General Farouk Yahaya as the Chief of Army Staff.\nRecall that President Buhari appointed General Yahaya as the Chief of Army Staff following the death of Lt. General Ibrahim Attahiru who died in a plane crash near Kaduna International Airport penultimate Friday.\nAlso recall that Muhammadu Buhari had last week, written to the Senate, seeking for the confirmation of the appointment of Major General Farouk Yahaya as the Chief of Army Staff.\nThe letter according to President Buhari was in line with the 1999 constitution of the Federal Republic of Nigeria as amended.\nIt is my hope that the Senate will consider and confirm the nominee in the usual expeditious manner.”Vanguard News Nigeria"
  },
  {
    "headline": "Poor grid power supply raises production cost for plastic manufacturers",
    "summarized_story": "By Prince OkaforThe absence of a regular power supply from the national grid is increasing costs for some manufacturers of plastic products.\nThis lack of regular power compelled the company to invest in its own power source relying on Clarke Energy, a multinational specialist in distributed power generation solutions, to set up its own power.\nClarke Energy, provided a 1.8MW gas power plant for PPIL which the company purchased and regularly maintains.\nThe company carried out a technical study and recommended the deployment of a gas power plant.\nApart from power plastic manufacturers also contend with the lack of feedstock for producing high-quality plastic products."
  },
  {
    "headline": "93-yr-old grandmother of slain student advocates measures to stop police extra-judicial killings",
    "summarized_story": "Mrs. Obeya, a retired educationist noted that although the pain of her grandson’s death remains fresh, she has since forgiven the policeman behind the act but wishes that such killings would stop.\nWe have forgiven the policeman behind his death but, sadly, such an ugly incident continues to happen even today.\nThere should be reform to stop this kind of needless killings.\nI believe that when they are well trained, they are most likely to relate well to the public and this issue of extrajudicial killings will reduce.\nI believe that due to their poor remuneration, an average police officer is antagonistic towards the rich and well-to-do."
  },
  {
    "headline": "Ubani kicks against FG anti-democratic policies, FHC practice direction, NDLEA drug test",
    "summarized_story": "The illegality and draconian nature of this Practice Direction should get any sane man in Nigeria thinking about the motive and rationale behind it.\nThe Practice Direction is questionable under the following parameters;“ It is an affront on the right of fair hearing to a citizen for a law to take away constitutionally guaranteed rights without any justification.\nPractice Direction by ranking as laws is on the lowest ladder and cannot be used in whatever manner to wrestle the rights of the citizens that are guaranteed by the constitution.\n“The truth of the matter is that this Practice Direction must not be allowed to stand.\nIf the Chief Judge of the Federal High Court refuses, and, or fails to see the danger and illegality of issuing this Practice Direction, the court of the land should determine this issue simpliciter."
  },
  {
    "headline": "Southeast govs misleading people with Igbo presidency",
    "summarized_story": "The Biafra Nations League (BNL) has accused Southeast governors of misleading people of the region with the clamour for an Igbo Presidency come 2023.\nBNL said Southeast governors are misleading people that a President of Igbo extraction is the solution to Biafra agitation.\nThe group’s National Leader, Princewill Chimezie Richard, made the remark while rebuking the governors and Ohanaeze Ndigbo for disowning the pro-Biafra groups.\nBNL warned Igbo leaders to desist from attempting to hijack the Biafra struggle to make it look like an Igbo affair.\nThe group issued the warning in a statement signed and forwarded to DAILY POST by Richard."
  },
  {
    "headline": "BREAKING: Senate finally confirms Farouk Yahaya as Chief of Army Staff",
    "summarized_story": "The Senate has confirmed the appointment of Maj. Gen. Farouk Yahaya as the new Chief of Army Staff.\nThe Red Chamber took the decision on Tuesday after the consideration of the report of its joint committee on Defence and Army led by senators Aliyu Wamakko and Ali Ndume.\nThe President of the Senate, Ahmad Lawan, had on June 2, referred the request of the President, Major General Muhammadu Buhari (retd.\nThe Defence Committee, which is chaired by Wamakko, was mandated to be the lead panel to screen the newly appointed Army chief.\nUntil his appointment, Yayaha was the Theatre Commander of Operation Hadin Kai, the counter-insurgency operation in the North-East."
  },
  {
    "headline": "Buhari urges Senate to approve N895bn supplementary budget",
    "summarized_story": "President Muhammadu Buhari on Tuesday urged the Senate to consider and approve N895 billion as supplementary budget.\nSenate President, Ahmad Lawan, read President Buhari’s letter of request during Tuesday plenary.\nA substantial part of the amount has been earmarked for the procurement of military hardware to prosecute the war against insurgency and banditry.\nThe Federal Government is also expected to use part of the amount for the purchase of COVID-19 vaccines and other health-related needs.\nRecall that President Buhari had in April submitted a supplementary budget to the National Assembly to request for more funds to tackle insecurity across many parts of the country."
  },
  {
    "headline": "Army arrests bandits travelling to Ibadan with military kits, charms",
    "summarized_story": "The Nigerian Army on Tuesday disclosed that some bandits heading to Ibadan, the Oyo State capital, were intercepted along Mokwa-Jebba road.\nNwachukwu said the bandits were intercepted with a pair of military camouflage, military boots, a knife and substance suspected to be charms.\nHe said on further interrogation, the suspect disclosed that he was travelling to Ogbomosho and further claimed that the uniform and boots belonged to his brother, who was a soldier.\nAccording to the army, the suspect was fleeing from the ongoing military operations in Niger to a safe haven.\nMembers of the public, particularly around Niger and contiguous states are, therefore, enjoined to be vigilant and report any suspected movement of fleeing bandits to security agencies."
  },
  {
    "headline": "BREAKING: Buhari mandates Lai Mohammed, Pantami, Malami, others to negotiate with Twitter",
    "summarized_story": "President Muhammadu Buhari has appointed a Federal Government’s Team to engage with Twitter over the suspension of its operations in the country.\nMinister of Information and Culture, Alhaji Lai Mohammed, who will chair the team made the announcement on Tuesday.\nThe team also comprises the Attorney General of the Federation and Honourable Minister of Justice, Honourable Minister of Communications and Digital Economy, Honourable Minister of Foreign Affairs, Honourable Minister of Works and Housing, Honourable Minister of State for Labour and Employment and other relevantgovernment agencies.\nRecall that the Buhari-led federal government had indefinitely suspended Twitter’s operations over “activities that are capable of undermining Nigeria’s corporate existence.”Attacks on President Buhari in London, barbaric – Kawu Sumaila"
  },
  {
    "headline": "Teenage #ENDSARS protester gets N10m bail",
    "summarized_story": "By Osagie Otabor, AkureAn Ondo State High Court sitting in Akure has granted bail to a teenage #ENDSARS protester, Kemisola Ogunniyi, who gave birth to a baby boy last week.\nPresiding Judge, Justice Omolara Adejumo, granted Kemisola bail in the sum of N10m and a surety in like sum.\nADVERTISEMENTThe surety is to be residing in Akure and should show evidence of payment of taxes.\nKemisola was two months pregnant when she was arrested alongside four others for burning some buildings in Akure during the #ENDSARS protest.\nLawyer to Kemisola, Tope Tomekun, said the joy was that the naming ceremony of Kemisola’s baby would not hold inside the prison."
  },
  {
    "headline": "THE DIABETES DRUG THAT SAVED ME FROM CUTTING MY LEG",
    "summarized_story": "The journey of my diabetes started on a terrific Tuesday morning.\nI woke up early to catch up with the early morning flight; that 45 minutes journey was the beginning of my predicament.\nADVERTISEMENTThe situation got worsened when I had a wound on my leg which later became sore.\nSo I ordered for 2 months’ treatment.\nNow I am well and healthy after 18 years of battling diabetes which almost claim my leg."
  },
  {
    "headline": "13 vehicles burnt in tanker explosion on Lagos-Ibadan expressway – FRSC",
    "summarized_story": "Agency ReporterThe Federal Road Safety Corps (FRSC), says six tankers, five trucks and two cars were destroyed in a tanker explosion at Ogere on the Lagos-Ibadan expressway on Tuesday.\nMeanwhile, the Ogun State Traffic Compliance and Enforcement Corps (TRACE), has advised motorists plying the road to use alternative routes.\nTRACE spokesman, Mr Babatunde Akinbiyi explained that the tanker which was laden with fuel suddenly burst into flames affecting other vehicles.\n“In addition, vehicles moving inbound Ibadan should also go through Sagamu-Iperu-Ode/Remo-Saapade to relink Lagos-Ibadan expressway,’’ Akinbiyi said.\nOn March 21, a fuel tanker was the cause of the fire on Otedola Bridge, also on the Lagos-Ibadan Expressway in which many vehicles were burnt."
  },
  {
    "headline": "BREAKING: Senate okays Maj. Gen Yahaya as COAS",
    "summarized_story": "By Sanni Onogu, AbujaThe Senate on Tuesday confirmed the nomination of Major General Farouk Yahaya for appointment as Chief of Army Staff (COAS).\nThe confirmation of Yahaya followed the presentation and consideration of the report of the Joint Senate Committee on Defence and Army at plenary.\nChairman of the Senate Committee on Defence, Senator Aliyu Wamakko presented the report.\nADVERTISEMENTGeneral Yahaya has been serving as COAS on acting capacity following the death of his predecessor, Lt. Gen. Ibrahim Attahiru, who died in a military plane crash in Kaduna.\nDetails shortly…"
  },
  {
    "headline": "Court dissolves 12-year-old marriage over abandonment",
    "summarized_story": "Agency ReporterA Grade I Area Court in Kubwa, Abuja, on Tuesday, dissolved a 12 -year-old marriage between Fatima Salisu and Abubakar on grounds of abandonment.\nSalisu in her petition prayed the court to dissolve her marriage on grounds that Abubakar abandoned her in February 2020.\nDelivering judgment, the Presiding judge, Muhammad Adamu also ordered the petitioner to observe “Iddah”, a waiting period to be observed for three months before contracting another marriage.\nThe petitioner revealed that she got married to Abubakar under Islamic Personal Law in 2009 and that they do not have children.\nShe prayed to the court to dissolve her marriage due to lack of love based on her husband’s abandonment."
  },
  {
    "headline": "9 vehicles burnt as petrol tanker explodes on Lagos-Ibadan Expressway",
    "summarized_story": "From Laide Raheem, AbeokutaNo fewer than nine vehicles were burnt when a petroleum tanker exploded at the proposed new Kara Market, Ogere-Remo, Ogun State, along the Lagos-Ibadan Expressway, on the early morning of Tuesday.\nHe added that a petroleum tanker laden with fuel also held up in the traffic, suddenly burst into flames affecting seven other trucks and two cars in the process.\n“Vehicles moving inbound Lagos should go through Saapade-Ode-Remo-Iperu-Sagamu to relink Lagos-Ibadan Expressway.\nIn addition, vehicles moving inbound Ibadan should also go through Sagamu-Iperu-Ode/Remo-Saapade to relink Lagos-Ibadan expressway.\n“While any inconveniences is highly regretted, drivers are implored to please maintain lane discipline, so as not worsen the traffic situation”, TRACE PRO stated."
  },
  {
    "headline": "Pope to collaborate with Nigeria to end insecurity",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe Catholic Pontiff, Pope Francis, has expressed readiness to collaborate with the Federal Government to end insecurity in the country and in the sub-Saharan Africa.\nHE gave the assurance when he received letter of credence from Nigerian Ambassador to the Holy See, Vatican City, Paul Oga Adikwu.\nA statement by the Embassy of Nigeria in the Holy See said Pope Francis commended the effort of President Muhammadu Buhari-led administration in combating security challenges in the country.\nIt also said during a private chat with the Holy Father, Ambassador Adikwu conveyed the greetings of President Buhari to the Pope.\nPope Francis prayed for the new ambassador who was in the company of his family and senior officials of the embassy, committing the envoy to the hands of God to succeed during his tour of duty in the Holy See."
  },
  {
    "headline": "Buhari, Afenifere, Ohanaeze, MBF clash over appointments",
    "summarized_story": "By Sunday Ani, Chukwudi Nweje and Romanus OkoyePresident Muhammadu Buhari has defended his appointments and policies, saying they are fair and inclusive.\n“So far, all the policies initiatives, projects and even appointments by this administration has been guided by equity and inclusiveness.\nNational Publicity Secretary of Afenifere, Jare Ajayi, said the administration has been most unfair in terms of appointments and policies.\n“There has never been an administration in this country that is as unfair and alienates certain parts of the country as that of President Buhari.\nIt seems certain English words connote a different meaning to president Buhari,” he said."
  },
  {
    "headline": "#RevolutionNow protesters block Abuja airport road",
    "summarized_story": "From Molly Kilete, AbujaThere was pandemonium in Abuja, yesterday morning as protesters under the aegis of #RevolutionNow blocked the popular Umaru Musa Yar’Adua Way leading to the Nnamdi Azikiwe International Airport.\nThe protesters, mostly youths, carried various placards and set up bonfires with used motor tyre leaving motorists and commuters stranded.\nThe protesters chanted: “Se democracy be this, se democracy be this, people dey die like flies, se democracy be this (Is this a democracy?\nWe did not make any arrest, we just restored calm and allow free flow of traffic,” he said.\nThe protesters were on June 12, violently dispersed by a combined armed security operatives at Gudu junction with teargas."
  },
  {
    "headline": "INEC targets 100m voters for 2023 polls",
    "summarized_story": "“The expansion of voters’ access to polling units prepares the ground for the discharge of another important responsibility of the Commission.\nThe registration of eligible Nigerians as voters is one of the immediate tasks before the Commission.\nMonday June 28, 2021, the Commission will resume the Continuous Voter Registration (CVR) nationwide.\n“The Commission will demonstrate the procedure for the proposed online registration and also present the new INEC Voter Enrollment Device (IVED) to you shortly.\n“We intend to undertake the CVR exercise over a period of at least one year."
  },
  {
    "headline": "Projects, Appointments Guided By Equity, Inclusiveness, Says Buhari",
    "summarized_story": "•Vows to prosecute criminals terrorising NigeriaAdedayo Akinwale in AbujaPresident Muhammadu Buhari yesterday tackled critics that accused him of nepotism and lopsidedness in appointments and execution of projects, insisting that all decisions about policies, projects, and appointments by his administration have been guided by equity and inclusiveness.\nThe conference was organised by the All Progressives Congress (APC) youth wing.\nHe said: “So far, all the policies, initiatives, projects, and even appointments by this administration have been guided by equity and inclusiveness.\nBuhari urged the youths not to despair, or relent in their joint task of nation-building, saying they have no other country but Nigeria.\nBuni said the ruling party had repositioned itself as Nigeria’s leading party and Africa’s largest political party."
  },
  {
    "headline": "WTO: Nigeria, S’Africa, Others Considered as Vaccine Production Hubs",
    "summarized_story": "Speaking yesterday during a virtual meeting monitored by Reuters, Okonjo-Iweala stated that regional production hubs would offer a more promising path to preparedness for a future health crisis.\n“We have now seen that over-centralisation of vaccine production capacity is incompatible with equitable access in a crisis situation.\n“Regional production hubs, in tandem with open supply chains, offer a more promising path to preparedness for future health crisis,” She stated.\nOkonjo-Iweala had stated that a rapid global and equitable vaccine rollout would be the best stimulus for a strong and sustained economic recovery for the global economy.\nShe, however, had stated that these support measures would not “be enough to bring an end to the crisis."
  },
  {
    "headline": "Buhari: My Policies, Projects, Appointments Guided By Equity, Inclusiveness",
    "summarized_story": "•Says criminal elements terrorising Nigeria will be prosecutedBy Adedayo AkinwalePresident Muhammadu Buhari on Monday said that all the policy initiatives, projects and even appointments by his administration were guided by equity and inclusiveness.\nBuhari stated this in Abuja while declaring open the maiden edition of the Progressives Youth Conference with the theme, “The Future Is A Decision”, organized by the All Progressives Congress (APC) youth wing.\nHe stated: “So far, all the policies initiatives, projects and even appointments by this administration have been guided by equity and inclusiveness.\nBuni stressed that the ruling party had no doubt repositioned itself as Nigeria’s leading party and Africa’s largest political party.\nHe added that power was not given but taken, adding that the life and future of the country is in their hands."
  },
  {
    "headline": "Amid Global Pressure, UAE to Fine Violators of New Corporate Transparency Rules",
    "summarized_story": "The report gave graphic details of illicit financial flows (IFFs) from Nigeria to the UK and the UAE, specifically Dubai.\nHowever, as the UAE prepares to implement the new rules on beneficial owners, there are questions about numerous exemptions and loopholes in the rules.\nThere’s a lack of interest behind this beneficial ownership law,” Kumar said.\nGovernment-owned corporations and publicly traded entities are also excluded from the ownership reporting requirement.\nAdministrative penalties and fines of up to 100,000 UAE dirhams for companies that don’t comply with reporting beneficial ownership information will begin July 1."
  },
  {
    "headline": "Breaking: CAS Reduces Siasia’s Life Ban to Five Years",
    "summarized_story": "CAS ruling Monday is the fallout of the appeal filed by Siasia challenging the decision rendered by the Adjudicatory Chamber of FIFA on 11 April 2019.\nIn 2010, a match fixer tried to involve Mr Siasia as a coach of a club under his strict instructions.\nWith the promise of employment benefits, Mr Siasia would have had to always field several players under the control of the match fixer.\nThe negotiations between the match fixer and Mr Siasia in relation to the conditions of employment were conducted by email over a period of two months.\n” *The imposed fine of CHF 50,000 (fifty thousand Swiss Francs) on Mr Siasia is set aside."
  },
  {
    "headline": "BREAKING: 18-year-old Alleged #EndSARS Protester, Kemisola Who Gave Birth in Prison Granted Bail",
    "summarized_story": "The Ondo State High Court sitting at the Olokuta Medium Prison in Akure has granted bail to Kemisola Ogunniyi, an 18-year-old girl detained over #EndSARS protest who birthed a baby at theSurulere Prison in Ondo town, Ondo East Local Government Area of the state.\nJustice Omolara Adejumo granted Kemisola bail in the sum of 10 million naira and a surety in like sum.\nThe judge ordered prison authorities to bring Kemisola and her newborn as a prelude to releasing her from prison.\nShe recently birthed the baby at the Surulere Prison in Ondo town, Ondo East Local Government Area of the state.\nAlso, counsel will move bail motion for three others arrested over the alleged #EndSARS protest, who are still in prison."
  },
  {
    "headline": "BREAKING: 18-year-old Alleged #EndSARS Protester, Kemisola Who Gave Birth in Prison Granted Bail",
    "summarized_story": "The Ondo State High Court sitting at the Olokuta Medium Prison in Akure has granted bail to Kemisola Ogunniyi, an 18-year-old girl detained over #EndSARS protest who birthed a baby at theSurulere Prison in Ondo town, Ondo East Local Government Area of the state.\nJustice Omolara Adejumo granted Kemisola bail in the sum of 10 million naira and a surety in like sum.\nThe judge ordered prison authorities to bring Kemisola and her newborn as a prelude to releasing her from prison.\nShe recently birthed the baby at the Surulere Prison in Ondo town, Ondo East Local Government Area of the state.\nAlso, counsel will move bail motion for three others arrested over the alleged #EndSARS protest, who are still in prison."
  },
  {
    "headline": "Nigerian Navy Personnel Sack Ogun Community To Take Over Land, Expel Traditional Ruler",
    "summarized_story": "SaharaReporters gathered that the military men have also sent packing the local chief, Baale, Chief Waheed Muraino, as the people continued to desert their homes due to the invading military men.\n“The navy personnel are being used by warring families and parties laying claim to lands in the community.\nThe Ogun State Police Command has also invited Sufi Taiwo several times, but he never honoured the invitation once.\n“We hereby call on the Ogun State Government, human rights lawyers, and other well-meaning Nigerians to come to our aid.\nDOCUMENTS: Nigerian Navy Personnel Sack Ogun Community to Take Over Land, Expel Traditional Ruler by Sahara Reporters on Scribd"
  },
  {
    "headline": "Nigerian Navy Personnel Sack Ogun Community To Take Over Land, Expel Traditional Ruler",
    "summarized_story": "SaharaReporters gathered that the military men have also sent packing the local chief, Baale, Chief Waheed Muraino, as the people continued to desert their homes due to the invading military men.\n“The navy personnel are being used by warring families and parties laying claim to lands in the community.\nThe Ogun State Police Command has also invited Sufi Taiwo several times, but he never honoured the invitation once.\n“We hereby call on the Ogun State Government, human rights lawyers, and other well-meaning Nigerians to come to our aid.\nDOCUMENTS: Nigerian Navy Personnel Sack Ogun Community to Take Over Land, Expel Traditional Ruler by Sahara Reporters on Scribd"
  },
  {
    "headline": "BREAKING: Nigeria's Senate Confirms Yahaya As Chief Of Army Staff",
    "summarized_story": "The Senate has confirmed the appointment of Major General Farouk Yahaya as the new Chief of Army Staff.\nThe Senate confirmed the Army chief on Tuesday following the consideration of a report of its joint committee on Defence and Army, led by senators Aliyu Wamakko and Ali Ndume.\nThe Senate President, Ahmed Lawan had on June 2 referred President Muhammadu Buhari's request to confirm Yahaya to the committees.\nThe Defence Committee, chaired by Wamakko, was mandated to lead the screening of the newly appointed Army chief.\nYahaya was appointed after the death of his predecessor, Lt Gen Ibrahim Attahiru in a plane crash in May."
  },
  {
    "headline": "JUST IN: Malami, Lai, Ngige -- Buhari appoints team to engage Twitter over suspension",
    "summarized_story": "President Muhammadu Buhari has approved the composition of a federal government team to engage Twitter over its suspension in Nigeria.\nAccording to Adeyemi, Lai Mohammed, minister of information, announced that the decision came after Twitter wrote to the president seeking an engagement.\nIn June, the federal government suspended Twitter alleging that the microblogging site was being used to undermine the existence of Nigeria.\nAdvertisement“President Muhammadu Buhari has approved the composition of the Federal Government’s Team to engage with Twitter over the recent suspension of the operations of the microblogging and social social networking service in Nigeria,” the statement said.\nThe Federal Government’s team also comprises the Attorney General of the Federation and Honourable Minister of Justice, Honourable Minister of Communications and Digital Economy, Honourable Minister of Foreign Affairs, Honourable Minister of Works and Housing, Honourable Minister of State for Labour and Employment as well as other relevant government agencies."
  },
  {
    "headline": "JUST IN: Malami, Lai, Ngige -- Buhari appoints team to engage Twitter over suspension",
    "summarized_story": "President Muhammadu Buhari has approved the composition of a federal government team to engage Twitter over its suspension in Nigeria.\nAccording to Adeyemi, Lai Mohammed, minister of information, announced that the decision came after Twitter wrote to the president seeking an engagement.\nIn June, the federal government suspended Twitter alleging that the microblogging site was being used to undermine the existence of Nigeria.\nAdvertisement“President Muhammadu Buhari has approved the composition of the Federal Government’s Team to engage with Twitter over the recent suspension of the operations of the microblogging and social social networking service in Nigeria,” the statement said.\nThe Federal Government’s team also comprises the Attorney General of the Federation and Honourable Minister of Justice, Honourable Minister of Communications and Digital Economy, Honourable Minister of Foreign Affairs, Honourable Minister of Works and Housing, Honourable Minister of State for Labour and Employment as well as other relevant government agencies."
  },
  {
    "headline": "EXTRA: Leaking roof, power failure disrupt court hearing in Abuja -- judge resorts to flashlight",
    "summarized_story": "As the FCT high court presided over by Angela Otaluka began proceedings on Tuesday morning, an unsightly phenomenon occurred — the roof of the courtroom dripped as the rain poured.\nIn no time, the floor beneath the leaking roof was swamped by rain water.\nAdvertisementThe leaking roof was surprisingly, not the only problem.\nA few minutes after the downpour began, power was interrupted.\nAfter realising the futility of her efforts, the judge stood up and retired to her chambers to wait out the rain."
  },
  {
    "headline": "EXTRA: Leaking roof, power failure disrupt court hearing in Abuja -- judge resorts to flashlight",
    "summarized_story": "As the FCT high court presided over by Angela Otaluka began proceedings on Tuesday morning, an unsightly phenomenon occurred — the roof of the courtroom dripped as the rain poured.\nIn no time, the floor beneath the leaking roof was swamped by rain water.\nAdvertisementThe leaking roof was surprisingly, not the only problem.\nA few minutes after the downpour began, power was interrupted.\nAfter realising the futility of her efforts, the judge stood up and retired to her chambers to wait out the rain."
  },
  {
    "headline": "Akwa Ibom varsity expels 500-level student for ‘insulting’ governor on Facebook",
    "summarized_story": "A 500-level student of the Akwa Ibom State University in Ikot Akpaden identified as Iniobong Ekpo has been expelled for allegedly insulting Emmanuel Udom, the state governor, on Facebook.\nThe university also said that he was made to appear before a disciplinary committee but Ekpo denied any such hearing.\nAdvertisement“As its 69th meeting held on Wednesday, 31st of March, 2021, the senate of Akwa Ibom State University deliberated on the report from the disciplinary committee,” the varsity wrote to Ekpo.\n“You will recall that you appear before the committee on a case of publication of a derogatory and defamatory article on Facebook about the executive governor of Akwa Ibom state and the visitor to the university.\n“This act constitutes a breach of matriculation oath and violation of the university rules and regulations enshrined in the student information handbook."
  },
  {
    "headline": "A Nigerian-Taiwanese couple, on their love for online gaming",
    "summarized_story": "The real reason, however, is that she wants him to have a “normal” childhood away from video games.\nWhen they started dating, Olaide introduced Ying-Yi (who is half-Nigerian, half-Taiwanese) to online gaming.\nOlaide: I have been playing video games since I was a kid.\nI’ve had many conversations with companies that want to get into online gaming but they fear the risks.\nAlexander: So how do you pitch online gaming to people in government, as something good for the digital economy?"
  },
  {
    "headline": "How to avoid investment scams in Nigeria",
    "summarized_story": "Over the past few weeks, two different scams have been uncovered in Nigeria.\nIt’s safe to say that many more investment scams will continue to spring up.\nOfficial website: https://t.co/HMfsRY9aCspic.twitter.com/i0gqGXYzjJ — Instablog9ja (@instablog9ja) May 28, 2021In it, the actor claimed that the company, Millionaires Club Investment, would give you 50% ROI (Return on Investment) in 3 days.\nLegitimate investment platforms are usually keen to inform you of the risks involved when you’re putting your money with them.\n“And you are licensed by…?”This is probably one of the most essential checks you must perform before you hand over funds to an investment company."
  },
  {
    "headline": "The Next Wave: $1.3 billion is not healthy enough",
    "summarized_story": "Between 2015 and 2020, 97 private equity and venture capital fund investments worth $1.3bn were made in health care in Africa.\nBetween 2015 and 2020, AVCA estimates that healthtech accounted for 35% of health care investments in Africa.\nIn 2020 alone, healthtech was the bright star too – gulping 45% of health care investments.\nBoluwatife Sanwo/TC InsightsAs with mPharma, new innovative health startups are relying on VC funding to rise to popular consciousness.\nCOVID-19, while an unfortunate pandemic, has spurred a welcome boost in visibility for healthcare startups."
  },
  {
    "headline": "After suspending Twitter, Nigerian government intensifies bid to control online media",
    "summarized_story": "The Buhari administration has stepped up efforts to regulate the online media in Nigeria in what is seen by many as attempts to further stifle the civic space in the country.\nMany have taken to Twitter to express criticism over the proposed regulation of online media.\nBREAKING: NBC Amendment Bill Is Social Media Bill Through The Backdoor — SERAP (@SERAPNigeria) June 17, 2021Amendment of the NBC act;grafting the shoot of autocracy.\n— #OurFavOnlineDoc 🩺🇳🇬🇬🇧💎 (@DrOlufunmilayo) June 17, 2021NBC Amendment Bill = Social Media Bill + Hate Speech Bill in disguise.\nThe government responded by suspending Twitter two days later and directed the NBC to immediately begin the process of licensing all over-the-top (OTT) media service and social media operations in Nigeria."
  },
  {
    "headline": "Obaseki takes second jab of COVID-19 vaccine – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Monday, received the second jab of the Oxford-AstraZeneca COVID-19 vaccine, urging eligible members of the public to make themselves available for the booster dose meant to provide full protection against the virus.\nReceiving the vaccine in Benin City, Obaseki said the government is committed to ensuring that all eligible persons are vaccinated against the virus.\nAccording to him, “I took the first jab and I had no reaction; I believe this second jab won’t react on me.\nSo, I advise those who have not taken their second jab to come forward to complete their vaccination.\n“For those who have not been vaccinated, the second phase vaccination exercise would commence shortly."
  },
  {
    "headline": "Edo enforces physical planning laws, demolishes two illegal structures in Benin – Nigerian Observer",
    "summarized_story": "The Ministry had, at the weekend, commenced the exercise from a private property in Aideyan Road, Government Reservation Area (GRA), Benin City.\nAccording to the ministry, the owner of the property had earlier been served notice on his property at 13 Aideyan Street, on the Ihama axis of the GRA in Benin City.\nAccording to investigations, the owner of the building did not approach the appropriate authorities for approval of the building plan.\nA resident in the area, who spoke on the condition of anonymity, commended the government for the action, noting that it would serve as a deterrent to others who plan to disregard the state’s town planning laws.\n“When I was growing up in the 70s and 80s, there was no flood or erosion because town planning laws were obeyed strictly."
  },
  {
    "headline": "Obaseki, Obasanjo, Ehanire seek home-grown solution to improve COVID-19 vaccine access – Nigerian Observer",
    "summarized_story": "Obaseki noted that his government is currently implementing a wide range of healthcare reforms geared towards achieving high quality healthcare and universal health care services for Edo people.\n“In Edo, our government is currently implementing a wide range of healthcare reforms which are geared towards achieving high-quality healthcare and universal health care services for our people.\n“Edo will partner with CoDA and other veritable collaborators in the task ahead, particularly that of achieving equitable access to vaccines and vaccinations in Africa,” he reassured.\nDelivering his welcome address, former President Obasanjo, who was represented by Prof. Abdoulaye Bathily, from Senegal, said Nigeria and Africa must begin to harness its local resources to solve their problems.\n“We need to begin to take actions to harness our local resources to solve our local problems."
  },
  {
    "headline": "Edo charges workers on role in realising Obaseki’s MEGA agenda – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has urged workers in the state to be committed to their duties and support the Governor Godwin Obaseki-led administration in the actualisation of the ‘Making Edo Great Again’ Agenda.\nSecretary to the State Government, Osarodion Ogie Esq., gave the charge on Monday, during a meeting with staff of the Edo State Public Procurement Agency, in Benin City.\nAccording to him, “Governor Godwin Obaseki is in a hurry; we are in a hurry to develop and upgrade roads, public buildings, schools or hospitals.\nOgie further urged the agency to adopt international best practices and professionalism in discharging their responsibilities so they can become the leading procurement regulatory agency in Nigeria.\nEarlier, the Managing Director of Edo State Public Procurement Agency, Mr. Henry Idogun, assured the governor of the agency’s commitment to contributing their quota to the development of the state."
  },
  {
    "headline": "Alleged $500,000 bribe: It’s judgement day for Farouk Lawan",
    "summarized_story": "It was alleged that Mr Lawan received $500,000 out of the $3million he demanded from the businessman.\nOur correspondent, who arrived the FCT High Court at Apo at 9:15 a.m., observed that the defendant, Mr Lawan, was not in court.\n“Mr Lawan is in one of the offices close to the courtroom.\nPREMIUM TIMES had reported that billionaire oil magnate, Femi Otedola, had narrated how he exposed Mr Lawan of collecting three-million-dollar bribe.\nMr Otedola had told the court how he was able to expose Mr Lawan."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Prominent Nigerians Root For e-Voting System To Curb Electoral Fraud",
    "summarized_story": "As part of measures to strengthen the integrity of election process in the country, prominent Nigerians have called for electoral reforms that would bring about an e-voting system in the country.\nChief George said, ‘’We must change the process of voting to electronic voting, this will allow Nigerians outside the country the opportunity to vote.\nThis bill has been before the National Assembly for some time, they should pass the Bill into law.\nIf we start using electronic voting, it will reduce manipulation of votes.\nADVERTISEMENT‘’We have 17 percent of voting population participating in the election, and it gets weaker every time, because the people don’t believe in the electoral system again, they don’t believe in government.’’"
  },
  {
    "headline": "Prominent Nigerians Root For e-Voting System To Curb Electoral Fraud",
    "summarized_story": "As part of measures to strengthen the integrity of election process in the country, prominent Nigerians have called for electoral reforms that would bring about an e-voting system in the country.\nChief George said, ‘’We must change the process of voting to electronic voting, this will allow Nigerians outside the country the opportunity to vote.\nThis bill has been before the National Assembly for some time, they should pass the Bill into law.\nIf we start using electronic voting, it will reduce manipulation of votes.\nADVERTISEMENT‘’We have 17 percent of voting population participating in the election, and it gets weaker every time, because the people don’t believe in the electoral system again, they don’t believe in government.’’"
  },
  {
    "headline": "N13.6bn Akwa Ibom Drainage Project Under Threat",
    "summarized_story": "Multi-billion naira pipe jacking drainage project in Akwa Ibom State has come under threat due to the failure of the state government to conduct periodic maintenance on the facility.\nAdvertisementsThe N13.6 billion underground drainage system in Uyo was built by former Governor Godswill Akpabio and commissioned by former President Goodluck Jonathan in 2011 to distill flood waters threatening lives, properties and markets at the Itam axis of the state capital.\nThe pipe jacking method according to Julius Berger, had water drainage capacity of about 29m3/s with DN2000 and has improved self-cleansing capability of the pipes but in open drains, however additional manpower was not engaged after the construction to clean them periodically.\nNewsmen who visited Ikot Ekan, host community of the underground drainage system on Monday got mixed reactions from the residents on the wellbeing of the project 10 years after it was inaugurated.\nMeanwhile, the state government has said that emphasis would remain on the timely completion of the N14billion IBB Avenue drainage project and the distillation of major open drains that has hampered water flow and constituted risk to lives of residents within Uyo metropolis."
  },
  {
    "headline": "N13.6bn Akwa Ibom Drainage Project Under Threat",
    "summarized_story": "Multi-billion naira pipe jacking drainage project in Akwa Ibom State has come under threat due to the failure of the state government to conduct periodic maintenance on the facility.\nAdvertisementsThe N13.6 billion underground drainage system in Uyo was built by former Governor Godswill Akpabio and commissioned by former President Goodluck Jonathan in 2011 to distill flood waters threatening lives, properties and markets at the Itam axis of the state capital.\nThe pipe jacking method according to Julius Berger, had water drainage capacity of about 29m3/s with DN2000 and has improved self-cleansing capability of the pipes but in open drains, however additional manpower was not engaged after the construction to clean them periodically.\nNewsmen who visited Ikot Ekan, host community of the underground drainage system on Monday got mixed reactions from the residents on the wellbeing of the project 10 years after it was inaugurated.\nMeanwhile, the state government has said that emphasis would remain on the timely completion of the N14billion IBB Avenue drainage project and the distillation of major open drains that has hampered water flow and constituted risk to lives of residents within Uyo metropolis."
  },
  {
    "headline": "Court Delays Release Of Detained #ENDSARS Protester Who Delivered Baby In Prison",
    "summarized_story": "Despite assurances by the Ondo State government to release on bail Kemisola Ogunniyi, the detained #EndSars protester who was delivered in prison custody, the process was stalled on Monday at High Court.\nAdvertisementsJustice Omolara Adejumo, of Court 10, Olokuta Correctional Centre, Ondo Road, Akure, said she was unaware of the bail application by the counsel to the defendant.\nAccording to him, “The assurance we had was to get her released today (Monday) but as a lawyer, I know the procedure.\nThe boy has been announced to the world and I am very confident that the boy is going to be great.\nAdvertisementsHe said, “But that is not to say that we should allow the naming ceremony to take place in prison."
  },
  {
    "headline": "TETFund: PhD scholars in MSU to prioritise public health, others, says...",
    "summarized_story": "Doosuur Iwambe, AbujaThe Tertiary Education Trust Fund, TETFund, has said that Nigerian academics undertaking PhD studies at Morgan State University, MSU, in Maryland, USA will, henceforth, prioritise Public Health, climate change, and Computer Technology.\nThe issues of public health are so obvious.\n“And in the case of public health it is very obvious; the challenges for public health are very obvious.\nAstatke, who was the host of the meeting, has been instrumental to cementing the partnership between TETFund and MSU.\nThe MSU official also gave opportunity to a number PhD scholars from Nigeria to make presentations on their Doctoral research being pursued in various fields."
  },
  {
    "headline": "Muslim cleric in jail after he was caught on video sexually assaulting a male student",
    "summarized_story": "A prominent Muslim cleric has been arrested and charged with sexually abusing a male student at a religious school in Pakistan.\nAziz-ur-Rehman was recently arrested after footage purporting to show him forcing himself on the student went viral on social media.\nHe said this was part of a plot to throw him out of the seminary, the Jamia Manzoor-ul-Islamia.\nThe police said the student had told them that the cleric had been abusing him for several years.\nHe started filming the abuse after he got sick of it, and sent the video clips of the abuse to the head of the Wafaq-ul-Madaris, the student claims."
  },
  {
    "headline": "Stop another civil war in Nigeria, NADECO writes UN —",
    "summarized_story": "National Democratic Coalition (NADECO) has called on the United Nations, United States of America, United Kingdom and European Union among other world powers to stop Nigeria from “the dangerous paths it is treading” and prevent another civil war in the country.\n“Nigeria’s current situation is so deplorable because of the imposed centralist and unitarist 1999 constitution which was manufactured by a military clique and imposed upon us.\n“Nigerians have never accepted the suspension, and abrogation of the negotiated Independence Constitution.\n“We are appealing to you to take appropriate steps to help Nigeria resolve the dangerous paths the country is treading now.\nPolitical upheavals, instability, another civil war are better prevented now by the international community because it will cost you far less if you prevent the possible eruption of open hostilities in Nigeria."
  },
  {
    "headline": "Fani-Kayode Blasts Gumi: Defender of child-abductors, hell fire awaits you",
    "summarized_story": "The Minister of Aviation under the Goodluck Jonathan administration, Femi Fani-Kayode, has called out Islamic cleric, Ahmad Gumi, for asking the Federal Government to stop killing bandits.\nThe Islamic cleric in an interview with Punch on Monday had urged President Muhammadu Buhari-led government to stop killing bandits, insisting that they are also victims.\nGumi further stated that no school in the North West will be free from attacks until the government negotiates with the bandits.\nThe former minister in his reaction to the statement of the Islamic cleric described him as a heartless defender of child abductors, a dark and wicked soul.\nREAD ALSO: BBNaija’s Nina Ivy’s husband Reacts to her decision to get her butt enlargedFani-Kayode in a post on Twitter wrote, “Just listen to this heartless defender of child-abductors and cold-blooded killers."
  },
  {
    "headline": "Alleged threat to life: Actress Eniola Badmus raises alarm",
    "summarized_story": "Popular actress, Eniola Badmus, has raised the alarm that an unknown person is threatening to kill her.\nThe Omo Ghetto star took to her verified Instagram page to show some private messages the unknown person has been sending to her.\nIn the messages, the person threatened to kill her, however, soon after she shared the screenshots with the person’s Instagram handle on her page, the internet troll deactivated the account.\nRaising the alarm, the actress wrote, “Happening right now… This person constantly writes to me and say different things to me….\nMembers of the public, Egbami ooooooooo.”(sic)Badmus is one of many Nigerian celebrities who is often trolled on the internet."
  },
  {
    "headline": "Alleged threat to life: Actress Eniola Badmus raises alarm",
    "summarized_story": "Popular actress, Eniola Badmus, has raised the alarm that an unknown person is threatening to kill her.\nThe Omo Ghetto star took to her verified Instagram page to show some private messages the unknown person has been sending to her.\nIn the messages, the person threatened to kill her, however, soon after she shared the screenshots with the person’s Instagram handle on her page, the internet troll deactivated the account.\nRaising the alarm, the actress wrote, “Happening right now… This person constantly writes to me and say different things to me….\nMembers of the public, Egbami ooooooooo.”(sic)Badmus is one of many Nigerian celebrities who is often trolled on the internet."
  },
  {
    "headline": "Ekiti panel: Kidnappers, herders, resident-informants share ransoms",
    "summarized_story": "The Joint Security Committee of Emure, Ise and Ikere communities in three council areas of Ekiti State have called for intensified and regular combing of the expansive forests from Ikere Ekiti to the borders of Ondo and Kogi states to keep kidnappers at bay.\nIt stated, “There is no dichotomy between one sect of Fulani herders and others because they always have linkages and network among themselves.\nThey all share the ransom collected from the kidnapped victims together.\nFalana, who lamented dearth of patrol vehicles in Ikere Police Division, called on the Commissioner of Police, Tunde Mobayo, to redress the trend for the security agents to be able to carry out their duties effectively and efficiently.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Ekiti panel: Kidnappers, herders, resident-informants share ransoms",
    "summarized_story": "The Joint Security Committee of Emure, Ise and Ikere communities in three council areas of Ekiti State have called for intensified and regular combing of the expansive forests from Ikere Ekiti to the borders of Ondo and Kogi states to keep kidnappers at bay.\nIt stated, “There is no dichotomy between one sect of Fulani herders and others because they always have linkages and network among themselves.\nThey all share the ransom collected from the kidnapped victims together.\nFalana, who lamented dearth of patrol vehicles in Ikere Police Division, called on the Commissioner of Police, Tunde Mobayo, to redress the trend for the security agents to be able to carry out their duties effectively and efficiently.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Yoruba scholars meet in Ogun; send message to Igboho",
    "summarized_story": "A conference of Yoruba has urged Sunday Igboho and others pushing for secession to take things easy and see it from broader perspectives.\nThe conference, which had in attendance Yoruba scholars and traditional rulers, was led by Professor of History, University of Texas, Austin, Toyin Falola.\nThe Yoruba leaders and scholars met at Babcock University, Ilishan-Remo, Ogun State, on Monday, for the sixth Atanda lectures and conference on Yoruba culture and society.\nWhat is the cost of taking Yoruba out of Nigeria?\n“You have to do this thing very clinically; you must get your parameters right; is it going to be peaceful?"
  },
  {
    "headline": "12-year-old marriage dissolved over abandonment",
    "summarized_story": "A Grade I Area Court in Kubwa, Abuja, on Tuesday, dissolved a 12-year-old marriage between Fatima Salisu and Abubakar on grounds of abandonment.\nSalisu in her petition prayed the court to dissolve her marriage on grounds that Abubakar abandoned her since February 2020.\nDelivering judgment, the Presiding judge, Muhammad Adamu also ordered the petitioner to observe “Iddah”, a waiting period to be observed for three months before contracting another marriage.\nShe prayed to the court to dissolve her marriage due to lack of love based on her husband’s abandonment.\nAbubakar consented to his wife’s petition for divorce."
  },
  {
    "headline": "Cuba’s Abdala COVID-19 vaccine 92.28 percent effective",
    "summarized_story": "By Agency ReportersCuba said on Monday its three-shot homemade Abdala vaccine against COVID-19 had proved 92.28 percent effective in last-stage clinical trials.\nThe announcement came just days after the government said another homegrown vaccine, Soberana II, had proved 62% effective, with two of its three doses.\nCuba, whose biotech sector has exported vaccines for decades, has five coronavirus vaccine candidates.\n“Hit by the pandemic, our scientists at the Finlay Institute and Center for Genetic Engineering and Biotechnology have risen above all the obstacles and given us two very effective vaccines,” President Miguel Diaz-Canel tweeted.\nDaily cases have halved in the capital, Havana, since the start of the vaccination campaign a month ago, using Abdala, according to official data."
  },
  {
    "headline": "INEC Unveils Portal For Voters E-registration",
    "summarized_story": "The Independent National Electoral Commission has launched an online registration gateway ahead of the commencement of its Continuous Voter Education program next week.\nIn a statement released on Tuesday titled “Continuous Voter Registration: Media Professionals and INEC Agree to Sensitize Citizens,” INEC Chairman Mahmood Yakubu noted that online registration will help to alleviate the strain of long lines during CVR.\nHe said, “In the next one week, Monday 28th June 2021, the Commission will resume the Continuous Voter Registration nationwide.\n“In doing so, the Commission is introducing a portal to enable eligible Nigerians to commence registration as voters online before completing the exercise physically at designated centres nationwide”.\nThere will be new registrants, requests for intra-state and inter-state transfers as well as the replacement of voters’ cards as provided by law,” he said."
  },
  {
    "headline": "JUST IN: Leaking National Assembly Roof Disrupt Senate Plenary",
    "summarized_story": "The extensive leakage of the roof in the Senate hallowed Chamber delayed activities on Tuesday morning.\nRain fell in the early hours of Tuesday morning in the nation’s capital, Abuja, according to NEWS DIRECT.\nSenators who were already in the chamber were compelled to come outside and debate in groups after the roof began to leak.\nAccording to Vanguard, National Assembly personnel have been packing the water with buckets and Packers in the last few minutes, just as the entire atmosphere, fora is covered with water.\nSenators who arrived later, while the building was still flooded, had to pass through the House of Representatives."
  },
  {
    "headline": "‘You’re Hypocrites,’ Nnamdi Kanu Blasts Southeast Governors For Rejecting IPOB",
    "summarized_story": "The leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, called Southeast governors hypocrites on Tuesday.\nKanu made the comment while emphasizing that governors have no authority over Igbos’ trust in Biafra.\nKanu, speaking through IPOB spokesman Emma Powerful, claimed that the governors have lost the Southeast’s support.\n“It’s only unfortunate, shameful and disgraceful that the so-called Igbo leaders will be quick to disown and betray their own in their quest to appease their slave masters.\nThe South East Governors again, in 2017 they sat together in Enugu State to proscribe IPOB and the federal government declared them terrorists with the support of South East Governors while they are not."
  },
  {
    "headline": "Fulanis Are Our Security, Not Enemies – Oluwo of Iwo",
    "summarized_story": "Oba Abdulrosheed Akanbi, the Oluwo of Iwo, has stated that Fulanis are not enemies of the Iwo people and that they assist secure the community.\nThe statement titled: ‘How Fulani Repel, Send Suspected Bandits Out of Iwoland’ reads: “Bororo men with their cattle encroached Iwo.\n“Since that time the leadership of the Fulanis, Seriki, has been keeping up to the responsibility of ensuring culprits are identified, arrested and prosecuted.\n“In Iwoland, Fulanis are our security, not our enemies.\nThe three local governments of Iwoland comprising Iwo, Ayedire and Ola Oluwa, enjoy a peaceful coexistence with Fulanis.”"
  },
  {
    "headline": "Breaking: Roof leaks, Senate plenary disrupted as heavy rain pours into National Assembly (Video)",
    "summarized_story": "Heavy rain on Tuesday morning exposed the National Assembly’s leaked roof as water poured into the Three Arms Zone of the National Assembly.\nBlueprint gathered that the roof covering the White House section of the National Assembly was leaking and the foyer leading to the two chambers of the Senate has been covered with water.\nThe sanitation workers of the NASS complex are currently scooping water and using vacuum machine to mop it up.\nOngoing plenary at the Senate was however, disrupted when the situation became worse.\nDetails loading…"
  },
  {
    "headline": "Pictures: Ex-Super Eagles captain, John Mikel Obi, visits Governor Babajide Sanwo-Olu in Lagos",
    "summarized_story": ""
  },
  {
    "headline": "Pictures: Fire guts fuel tanker in Lagos",
    "summarized_story": ""
  },
  {
    "headline": "FRSCN Officials vist to the Nigerian Pilot Newspaper Headquarter -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nIf you wish to use copyrighted material from this site for purposes of your own that go beyond “fair use,” you must obtain permission from the copyright owner or Nigerian Pilot WEBMASTER.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "FG reiterates commitment on STEM devt -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "2023: We’re making efforts to approach our congresses, convention as a united entity – APC -NigPilot",
    "summarized_story": "Leadership of the ruling All Progressives Congress, APC, Monday stated that the party is working hard to unite its members and clear all grey areas so as to approach its proposed national convention and State congresses with a united front.\nChairman of APC Caretaker/Extraordinary Convention Planning Committee, Mai Mala Buni, stated this in his keynote address at the maiden edition of Progressives Youths Conference held in Abuja.\nThe APC is currently being rocked with different leadership crises in its state chapters while it battles with dissenting voices at the national level over zoning and organization of the party’s national convention ahead of 2023 general elections.\nThe national chairman thanked the youths for remaining progressively united to the course of the party despite the turbulent times.\n“The Caretaker/Extraordinary committee had during the reconciliation process found the APC youth very cooperating to our collective approach to rebuilding the party."
  },
  {
    "headline": "Men in military uniform, not soldiers torture, mutilate victim -NigPilot",
    "summarized_story": "The Nigerian Army on Monday night said that men in military uniform, not soldiers were seen torturing and mutilating their victim in a trending video.\nDirector Army Public Relations, Brigadier General Onyema Nwachukwu in a statement said that It is crucial to refute and properly inform the public on the said footage.\nAccording to the statement, “The Nigerian Army (NA) has been notified of an online video footage making the rounds in the social media, showing some persons in military fatigue torturing and mutilating an individual.\n“The NA therefore, wishes to clearly inform the general public that the video being circulated does not have any connection with its operations.\nThose in the footage are not troops of the NA and do not represent any operation of the NA."
  },
  {
    "headline": "Explosion: Six Tankers, Five Trucks Burnt On Lagos-Ibadan Expressway",
    "summarized_story": "﻿Vehicles numbering 13 have been destroyed in a fuel tanker explosion around a trailer park at Ogere, Lagos-Ibadan expressway.\nThe burnt vehicles include six tankers, five trucks, and two cars.\nAccording to eyewitnesses, the explosion occurred at about 6:20 a.m. on Tuesday impeding traffic outward Lagos State.\nOfficials told Channels Television that the casualty figure cannot be ascertained for now.\nThe officials said as they tried to remove the burnt vehicles and open up a detour for other vehicles, the fire ignited again prompting firefighters to resume to extinguish the fire."
  },
  {
    "headline": "Those Waiting For Nigeria To Break Will Be Sorely Disappointed – Osinbajo",
    "summarized_story": "The Vice President, Professor Yemi Osinbajo, is confident that Nigeria will remain united as a strong nation to the frustration of those waiting to see the country broken into pieces.\nHe made the remark on Monday in Abuja at the maiden edition of the All Progressives Congress (APC) Progressives Youth Conference.\n“Even if that was true at some point, today, that notion stands on very weak legs indeed,” he said.\nThe event had in attendance APC youth leaders and older party leaders from various parts of the country, as well as top government officials.\nConversations at the conference centred on more youth inclusiveness in party politics and the positioning of young people for the 2023 general elections."
  },
  {
    "headline": "Suspected IPOB Members, Others Arrested Over Attacks On Police, INEC Facilities In Ebonyi",
    "summarized_story": "Dozens of suspected members of the Indigenous People of Biafra (IPOB)/ Eastern Security Network (ESN) have been arrested in connection with the attacks on police stations and offices of the Independent National Electoral Commission (INEC) in Ebonyi State.\nRead the full text of the police commissioner’s briefing below:PRESS BRIEFING/PARADING OF 60 SUSPECTS ARRESTED FOR DIFFERENT OFFENCES BY THE COMMISSIONER OF POLICE EBONYI STATE CP.\nThe gang are also responsible for the attacks on some government facilities and the killing of security agents in the area.\nThe said gang members were alleged to have fled the scene on sighting Police on the day he was arrested.\nI wish to thank immensely His Excellency, the Executive Governor of Ebonyi State, Chief Engr."
  },
  {
    "headline": "‘Night Operation, Chinese Connection’: How A Rail Vandalism Operation Thrived In Nasarawa",
    "summarized_story": "But they couldn’t make the arrest because the youths refused.”Another railway staff suggested that the youths were motivated by a sense of entitlement.\nChinese connectionThe youths, according to the police, were in cahoots with several top politicians, corrupt police officers and NSCDC staff, and Chinese nationals.\nThis month, the police announced that it had cracked down on a criminal syndicate engaged in vandalising rail tracks across the North-West and North-Central.\nInside the warehouse, the police discovered different vandalised rail equipment, stolen rail installation racks, weld-shear, rail puller, other rail accessories and consumables.\n“Removal of rail tracks can cause train derailment, with deadly consequences,” he said at a town hall meeting recently."
  },
  {
    "headline": "Baba Ijesha To Be Arraigned Tomorrow",
    "summarized_story": "Popular Yoruba actor, James Olanrewaju (also known as Baba Ijesha), will be arraigned on Thursday before a Special Offences Court sitting in Ikeja on allegations of sexual assault of a minor.\n3, Laws of Lagos State, 2015 and Sexual Assault by Penetration contrary to *Sections 259* Criminal Law Ch C17, Vol.\n3, Laws of Lagos State, 2011.\nLawyers to Baba Ijesha have also filed an application for his bail before the court dated the 21st of June 2021.\nOn the 16th of June, Baba Ijesha was arraigned by the police on a five count charge at a Chief Magistrate Court in Yaba."
  },
  {
    "headline": "Breaking: Senate confirms Faruk Yahaya as Chief of Army Staff",
    "summarized_story": "The Senate has confirmed the nomination of Major General Farouk Yahaya for appointment as Chief of Army Staff (COAS).\nThe confirmation of Yahaya followed the presentation and consideration of the report of the Joint Senate Committee on Defence and Army at plenary.\nChairman of the Senate Committee on Defence, Senator Aliyu Wamakko presented the report."
  },
  {
    "headline": "#ENDSARS Protester Who Gave Birth In Prison Gets 10Million Naira Bail",
    "summarized_story": "The Ondo state high court sitting at the Olokuta Medium Prison in Akure has granted bail to detained alleged Endsars Protester, Kemisola Ogunniyi.\nJustice Omolara Adejumo granted Kemisola bail in the sum of 10 million naira and a surety in like sum.\nThis is coming a day to the naming ceremony of her newborn."
  },
  {
    "headline": "Chief of Army Staff visits 82 Division Enugu",
    "summarized_story": "The Chief of Army Staff Major Gen. Faruk Yahaya is currently at 82 Division of the Nigerian Army Enugu.\nThe COAS staff is on his first official familiarization visit to the divisional headquarters, that oversees army operations in the South East.\nThe Army chief was received by theGeneral Officer Commanding 82 Division of the Nigerian Army, Major General Abiodun Lagbaja.\nUntil his appointment as the COAS, Maj Gen Farouk Yahaya was the Theatre Commander Operation HADIN KAI, responsible for Counter Terrorism and Counter Insurgency operations in North East Nigeria."
  },
  {
    "headline": "Terrorists Are Victims And Should Be Used To Secure Schools – Trending With Ojy Okpe",
    "summarized_story": "Following the release of footage of abducted students and staff members of the Federal Government College, Birnin Yauri in Kebbi State, Islamic cleric Ahmad Gumi who has been in the centre of negotiations with the bandits, called on the federal government to engage with bandits in order to guarantee security in schools by using them as security personnel.\nIn the meantime, the Governor of Niger State, Abubakar Sani Bello while commenting on the recent abduction claimed… that most of the bandits terrorizing the country are not Nigerians.\nSome members of staff, of Heritage Bank in a video now circulating online besieged the residence of the former senator from Anambra state Andy Uba, over non-payment of loans he allegedly borrowed by the bank.\nVice president Yemi Osinbajo has accused Nigerian youth of not taking active roles in the nation’s politics."
  },
  {
    "headline": "Nigeria: Analysts Upbeat about Central Bank’s Proposed Digital Currency",
    "summarized_story": "The CBN had on June 10, 2021, unfolded plans to launch a digital currency before the end of the year.\nIn his contribution, Managing Director/Chief Executive, SD&D Capital Management Limited, Mr. Idakolo Gbolade, stated that the impact of digital currency on the economy will yield positive results.\nAccording to him, it will also help the bank to regulate the activities of digital currency traders and place Nigeria as a major player in the digital currency space.\nAccording to him, it will also reduce pressure on demand for foreign currency and external reserves.\nHe, however, sought for more clarity on the modalities and framework for the implementation of digital currency so it could be scrutinised by analysts to get quality inputs."
  },
  {
    "headline": "Nigeria Customs Threatens to Impound Unverified Private Jets By July 6",
    "summarized_story": "The Nigeria Customs Service (NCS) on Monday warned that private jet owners risk having their airplanes impounded if they fail to verify their documents before July 6, 2021, when the one-month grace period given them would have expired.\nTHISDAY had reported that NCS had directed all private aircraft owners to present their importation clearance documents to the agency for verification.\nHe, however, said on Monday that only six private jet owners had responded to the invitation.\nWe also know that some brought their private jets under a temporary import certificate, which has expired and not renewed.\nAccording to him, the ongoing verification is not intended to inconvenience any owner of a private aircraft, as such individuals or representatives can come with the documents for verification."
  },
  {
    "headline": "South Africa, Senegal, Rwanda to House Vaccine Production Hubs, Nigeria Considered",
    "summarized_story": "Speaking Monday during a virtual meeting monitored by Reuters, Okonjo-Iweala stated that regional production hubs would offer a more promising path to preparedness for a future health crisis.\n“We have now seen that over-centralisation of vaccine production capacity is incompatible with equitable access in a crisis situation.\n“Regional production hubs, in tandem with open supply chains, offer a more promising path to preparedness for future health crisis,” She stated.\nRwandan President, Mr. Paul Kagame, also confirmed Monday at the Qatar Economic Forum that Senegal, Rwanda, and South Africa were in talks with investors to start the production of COVID-19 vaccines in Africa.\nOkonjo-Iweala had stated that a rapid global and equitable vaccine rollout would be the best stimulus for a strong and sustained economic recovery for the global economy."
  },
  {
    "headline": "Hong Kong Leader Defends Crackdown on Apple Daily",
    "summarized_story": "Hong Kong’s leader has defended a crackdown on the pro-democracy Apple Daily newspaper, insisting that the arrest of senior editors and a freeze on its assets did not amount to an attack on press freedom.\nCarrie Lam’s comments on Tuesday came after the United States criticised the Hong Kong authorities’ use of the China-imposed national security law to target the tabloid.\nAuthorities also froze 18 million Hong Kong dollars’ worth ($2.3 million) of the tabloid’s assets.\n“Don’t try to underplay the significance of breaching the national security law,” Lam said.\nApple Daily has come under increasing pressure since its owner Jimmy Lai was arrested last year under the national security law."
  }
]