[
  {
    "headline": "Ex-director pledges support for Osun devt",
    "summarized_story": "A former director in the Federal Civil Service, Dr Olubunmi Siyanbola, has pledged support for the development of Osun State especially Ibokunland, saying she will do everything within her power to enhance peace, unity and growth.\nAccording to her, the development of the state will be her top priority, noting that job creation among youths and empowerment of the populace through various initiatives will top her agenda.\nShe thanked the Ibokunland Development Union and other key stakeholders for their support.\nRead AlsoThe statement said Siyanbola’ services endeared her to many governors including Governor Oyetola Adegboyega of Osun State; and the Osun State Commissioner for Finance/Chairman of the 2022 Ibokun Day, Chief Bola Oyebamiji.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Abba Kyari seeks fresh bail, claims threat to life",
    "summarized_story": "The suspended Deputy Commissioner of Police, Abba Kyari, currently standing trial for alleged drug trafficking on Thursday asked a Federal High Court in Abuja to release him on bail over alleged threat to his life.\nAccording to him, some of the inmates at the correctional centre are people that Kyari’s Police Intelligence Response Team arrested.\nLawyer for the National Drug Law Enforcement Agency, Sunday Joseph, asked the court to reject the bail request.\nThey had on March 7, when they were arraigned alongside Kyari, pleaded guilty to the drug trafficking charge.\nJustice Emeka Nwite adjourned the case till June 14 to hear the defendants’ fresh application for bail."
  },
  {
    "headline": "APC Presidential Primary: FCT delegates endorse Lawan",
    "summarized_story": "***As Musa, Others describe candidacy, as a saving grace for APCBy Henry Umoru, ABUJAAHEAD of the primaries of the ruling All Progressives Congress, APC to pick its Presidential candidate for the 2023 Presidential election slated for Sunday, National delegates from the Federal Capital Territory, FCT, Abuja, yesterday endorsed the President of the Senate, Senator Ahmad Lawan.\nThe development has however boosted the chances of Lawan clinching the Presidential ticket of the APC.\nThe endorsement took place at the Palms Hotel, Central Area, Abuja when the President of the Senate met with the National Delegates led by the Chairman of the FCT chapter of APC, Hon Abdulmalik Usman.\n“What the country needs is stability and what APC as a party needs now is a candidate who can win the Presidential contest in 2023 through the required votes where they are.\nHe said, “National Delegates from FCT are no doubt, for you and will vote for you at the convention but as the Speaker of the FCT House of Assembly, we want all the critical demands forwarded to the National Assembly to be considered and approved.”"
  },
  {
    "headline": "Senate Leader polls zero vote as NUT president wins Kebbi APC governorship primary",
    "summarized_story": "It was a poor outing for Senate Leader, Dr Yahaya Abdullahi, in Kebbi on Thursday as he did not get a single vote at the governorship primary election of the All Progressives Congress.\nThe Returning Officer and Chairman, APC National Monitoring Committee, Alhaji Idris Yahuza, declared the results at the end of the exercise.\nHe is also Deputy National Chairman of the NLC.\nAtiku Bagudu, Sen. Adamu Aleiro, Sen. Bala Ibn-Na’Allah, Sen. Muhammadu Magoro, Sen. Yahaya Abdullahi, the Senate Leader; and Deputy Governor, Alhaji Samaila Yombe-Dabai.\nOthers included the Minister of Justice and Attorney- General of the Federation, Abubakar Malami, SAN; members of the House of Representatives and members of the state’s House of Assembly."
  },
  {
    "headline": "Gov. el-Rufai nominates new commissioner, appoints special advisers, others",
    "summarized_story": "Nasir el-Rufai of Kaduna State, has nominated a new commissioner and appointed new Special Advisers.\nThis is contained in a statement issued by the Special Adviser on Media and Communication, Mr Muyiwa Adekeye, on Thursday in Kaduna.\nAdekeye said that the governor’s Special Adviser, Political Matters, Abdullahi Ibrahim, is now the new Administrator, Birnin Gwari Local Government.\nAccording to Adekeye, Murtala was most recently, the chairman of the Kaduna State Fiscal Responsibility Commission.\nAdeleye added that Dr Jibrin Alhaji is the new Secretary of the Kaduna State House of Assembly Service Commission."
  },
  {
    "headline": "APC shifts Lagos House of Assembly primaries to Friday",
    "summarized_story": "The All Progressives Congress (APC) House of Assembly primaries in Lagos State has been postponed to Friday, an official has confirmed.\nSpeaking with the News Agency of Nigeria (NAN) Mr Yesiru Karamo, APC Acting Publicity Secretary in Lagos state confirmed the shift of the primaries scheduled to hold on Thursday.\nNAN recalls that the APC planned to hold its governorship and house of assembly primaries on Thursday but could only conduct the governorship primary election.\nMeanwhile, the ruling party has also fixed its House of Representatives primaries for Friday, while senatorial primaries would hold on Saturday.\nBabajide Sanwo-Olu was on Thursday, declared winner of the governorship primaries by the APC Electoral Committee chaired by Alhaji Adamu Yuguda, a former Borno deputy governor."
  },
  {
    "headline": "APC presidential primary: FCT delegates endorse Lawan’s candidacy",
    "summarized_story": "The All Progressives Congress (APC ) delegates for the party’s presidential primary election have unanimously endorsed the candidacy of the President of the Senate, Ahmad Lawan for the upcoming National Convention scheduled for May 30.\nLawan got the endorsement, when he met the National Delegates led by the Chairman of FCT chapter of APC, Abdulmalik Usman, in Abuja on Thursday.\n” Your votes for me at the Presidential primary are investments for a better Nigeria in no distant time, ” he said .\nHe thereafter, in line with parliamentary procedures, put approval of his candidacy to voice votes of the delegates, who all responded affirmatively .\n” National Delegates from FCT are no doubt for you and will vote for you at the convention."
  },
  {
    "headline": "2023: I don’t need to be strong like Ronaldo to lead Nigeria – Tinubu",
    "summarized_story": "Tinubu, who was reacting to speculations over his health status, disclosed that all that is required for him if elected as president are ideas.\nDuring the visit to the state, Tinubu emphasised that he remained the only one and best among the aspirants to lead the party to victory in 2023.\nAccording to Tinubu, what Nigeria has been lacking is a spirit of unity and a sense of hope, both of which he claims he can restore.\n“When they talk about my health, I tell them, I’m not looking for a wrestling job, I don’t want to beat Ronaldo.\n“My running is not because I need pockets of money, that was past."
  },
  {
    "headline": "May 27: My govt working to make Nigerian children’s future bright – Buhari",
    "summarized_story": "President Muhammadu Buhari is celebrating with young Nigerians on the occasion of the 2022 Children’s Day.\nBuhari assured that his administration will continue to work hard to ensure that every child has access to education, which prepares them for a bright future.\nA statement on Thursday by spokesman, Femi Adesina, said the Nigerian leader recognises the place of education in the development of every country.\nThe government assured that Buhari was committed to seeing a further significant reduction in the number of out-of-school children.\nThe President said with investments in infrastructure, youth development, education, ICT, digital economy, culture, arts and entertainment, “we are laying a solid foundation for future generations”."
  },
  {
    "headline": "Prison Service reacts to report of attack on Abba Kyari in Kuje correctional centre",
    "summarized_story": "The Nigerian Correctional Service (NCoS) has reacted to claim by former Deputy Commissioner of Police, Abba Kyari, that he was not safe in custody as there was no threat to his life.\nReport had also emerged that Kyari was assaulted by some inmates and he escaped death.\nReacting, Mr Francis Enobore, the Service Public Relations Officer (SPRO), Mr Francis Enobore, described the allegation that Kyari was attacked by his fellow inmates as fake.\n“For the record, Abba Kyari is one of the over 800 inmates in the location where he is being kept.\nHe emphasized that Kyari was safe and sound and goes about his daily routine like any other inmate unharmed."
  },
  {
    "headline": "2023: Why Buhari should sack Emefiele as CBN gov – Falana",
    "summarized_story": "Human rights lawyer, Femi Falana, has urged President Muhammadu Buhari to sack the Central Bank of Nigeria, CBN, Governor, Godwin Emefiele.\nFalana said Emefiele’s continued as CBN governor could compromise the credibility of the 2023 general elections.\nEmefiele had indicated interest to contest as president in 2023 on the platform of the ruling All Progressives Congress, but rescinded the decision on Wednesday.\nHowever, Falana said the Independent National Electoral Commission, INEC, should remove sensitive voting materials from the CBN for the sake of free, fair and credible 2023 general elections, NAN reports.\n“We can’t look for alternative place to keep our electoral materials; it is the CBN governor that must be removed and whether President Buhari likes it or not, Emefiele must go."
  },
  {
    "headline": "Beware of politicians luring you with cash, they are just businessmen – University Don to delegates",
    "summarized_story": "The Head of Department, Political Science, University of Lagos, Dr. Rotimi Fayemi on Thursday in Kaduna warned politicians against using money to influence their votes.\nDr. Fayemi noted that some people call themselves politicians when their motive is to be elected into public office to loot and empty the treasury of government to the detriment of the masses.\n“It is so disgraceful, for a politician to share money, and bribe delegates to vote for him.\nWe are where we are today because the wrong people were voted into the right place, and so, to put things right becomes difficult.\nThose who do not know anything about finance, or the economy, are right there as heads of the committee, whereas, they have no knowledge about the office they occupy.”"
  },
  {
    "headline": "NNPP offers Obi vice presidential ticket",
    "summarized_story": "Supporters insist on presidential slotNo automatic ticket for new members, says national chairThe New Nigeria Peoples Party (NNPP) is offering former Anambra State governor Peter Obi the ticket of running mate to the National Leader of the party, Rabiu Musa Kwankwaso, The Nation has learnt.\nThe source, however, said the zoning of the presidential ticket of the APC and the PDP would determine the final decision of the NNPP.\nAsked whether the former PDP presidential aspirant was heading for the NNPP, the source said: “I heard authoritatively that he wants to join NNPP, but whether he will accept to be the vice presidential candidate, which they are prepared to offer him, is not confirmed.\n“But the issue of automatic ticket does not arise because other members of the party are going to fight him.\nThere are people who will fee aggrieved that you are giving automatic ticket to some people."
  },
  {
    "headline": "NECO warns as police parade couple, three others over N10m employment scam",
    "summarized_story": "Candidate of the Peoples Democratic Party (PDP) for the Ilaje Constituency I seat in the Ondo State House of Assembly, Kayode Ehinlanwo, has said the Peoples Democratic Party (PDP) will win majority of the seats because the All Progressives Congress (APC) has lost touch with the people.\nEhinlanwo identified economic hardship and poor policies of the APC as reasons the party would fail in next year’s election.\n“Go to the street, even among civil servants and pensioners, hear from them their comments about the hardship APC put upon them.\nPDP is the party of the moment.\nNigerians have realised now that they made a very grave mistake in 2015.”"
  },
  {
    "headline": "Oduah to NYSC: retract abscondment allegation or risk legal action",
    "summarized_story": "The senator representing Anambra North, Stella Oduah, has threatened to sue the National Youth Service Corps (NYSC), if it does not retract the allegation that she failed to complete her youth service.\nIn a May 24 letter, the NYSC had claimed that Oduah did not complete the mandatory national youth service scheme.\nShuaibu Ibrahim, NYSC director-general, had said Oduah was mobilised for national service in 1982/83 and was posted to Lagos, but absconded after the orientation.\n“That issue also attended litigation and she has a court judgment in her favour in the case of Chinedu Emmanuel Emeka v. Princess Stella Oduah, EPT/AWK/SEN/13/2019.\n“You are by this letter given 48 hours to retract your statement, failing which legal actions shall be commenced against you.”"
  },
  {
    "headline": "Children’s Day: Buhari pledges provision of access to education for every Nigerian Child",
    "summarized_story": "President Muhammadu Buhari has pledged that his administration will continue to work hard to ensure that every child has access to education, which prepares them for a bright future.\nThe President made the pledge in a statement issued by his Special Adviser on Media and Publicity, Mr Femi Adesina, Thursday evening, in commemoration of this year’s Children’s Day celebration.\nHe, however, celebrated the Nigerian Child, saying he recognises the place of education in the development of every country and is committed to seeing a further significant reduction in the number of out-of-school children.\n“He acknowledges that while education of the Nigerian child will remain on the front burner for this government, other issues – healthcare, protection from harm, drugs, cultism, child trafficking and abuse, domestic violence- are equally receiving needed attention from the government.\n“President Buhari believes that Nigerian children deserve the best and a safe country where they can grow, make friends, interact and travel freely, and emerge as successful leaders in different fields of endeavour” the statement said."
  },
  {
    "headline": "COEASU to Fed Govt: migrate academics to UTAS",
    "summarized_story": "The Colleges of Education Academic Staff Union (COEASU) has asked the Federal Government to adopt the University Transparency and Accountability Solution (UTAS), developed by the Academic Staff Union of Universities (ASUU), as a payment platform for lecturers.\nDeploring the continuous use of the Integrated Personnel and Payroll Information System (IPPIS) by the Federal Government to pay its members, the union said the government had no excuse in migrating academics in tertiary institutions to UTAS.\nCOEASU said this yesterday in Abuja in a statement by its President, Dr. Smart Olugbeko.\n“For the umpteenth time, the union is calling on the Federal Government to adopt the home-grown UTAS developed by ASUU as a payment platform for academics in tertiary institutions in Nigeria,” it added."
  },
  {
    "headline": "APC guber primary: Confusion as exercise is postponed over security threats",
    "summarized_story": "From Oluseye Ojo, IbadanThe governorship primary of the All Progressives Congress (APC) in Oyo State has been postponed over perceived security threats, probably till Friday May 27, 2022.\nThe five governorship aspirants, Chief Adebayo Adelabu, Senator Teslim Folarin, Dr. Azeez Adeduntan, Akeem Agbaje, and Alao Oyedele, also left the venue with their supporters.\nThe chairman of the APC governorship electoral committee, Senator Tokunbo Afikuyomi, and Chairman of APC in the state, Isaac Omodewu, refused to grant interview to journalists on the development.\nThe Resident Electoral Commissioner for the state, Mutiu Agboke, a team of Independent National Electoral Commission (INEC) to the venue.\nThe team also left when it was said that the primary has been postponed."
  },
  {
    "headline": "I prefer to be Borno governor, not VP – Zulum",
    "summarized_story": "From Timothy Olanrewajua, MaiduguriGov Babagana Zulum said he prefers to be re-elected as governor of Borno State than accepting to be a vice presidential candidate of his All Progressive Congress (APC) after the party primaries weekend.\nZulum disclosed this while delivering his acceptance speech shortly after his re-election by the state APC delegates as the party gubernatorial candidate in the 2023.\n“I have asked myself, what happens to all these plans that I am central to, which are helping to fast track our recovery in Borno State?,” he declared.\n“However, I have asked myself, that should I get the opportunity to become VP and raise my political profile, what happens to all our ongoing works for the people of Borno State?,” he asked rhetorically.\nChairman of the State Primaries Election Committee and former deputy governor of Taraba State, Alhaji Maigari Uba Amodu announced Zulum the winner of the party election having polled 1,411 votesPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "Sanwo-Olu wins APC guber ticket for second term",
    "summarized_story": "By Lukman OlabiyiLagos State Governor, Babajide Sanwo-Olu has been declared winner of the All Progressives Congress (APC) governorship primary election with 1170 votes.\nAt the exercise that held at the Mobolaji Johnson Arena, Onikan, 1,225 state delegates were expected from 245 wards; five delegates per ward, in 20 statutory Local Government Areas of the state.\nReacting to winning his party’s candidature, Governor Sanwo-Olu who thanked all delegates and party members for deeming him worthy, described it as an affirmation of the confidence reposed in him.\nThe security personnel on ground comprised of men of Nigeria Police, Department of State Services, Lagos State Neighborhood and Safety Corps, as of 12.\n50pm, only one governirship aspirant out of the three was present in person of Sanwo-Olu."
  },
  {
    "headline": "Abba Kyari is comfortable in prison, says Controller General of Corrections",
    "summarized_story": "From Isaac Anumihe, AbujaThe Controller-General of Corrections, Haliru Nababa, has described as false the rumour that is going round that Abba Kyari was attacked in the centre where he was kept.\nOn calls demanding his relocation from the centre, Nababa assured Nigerians that there is no course for alarm as he is very comfortable.\n“Abba Kyari is safe and sound and goes about his daily routine like any other inmate, unharmed.\nAccording to the statement, the Controller General is determined to make inmates comfortable in their detention and so would not be distracted by anyone.\nThe trial Justice Emeka Nwike ordered the National Drug Law Enforcement Agency, (NDLEA), to transfer the defendants to prison custody, shortly after he denied them bail."
  },
  {
    "headline": "Extraordinary Rendition: Kanu family sues UK Foreign Secretary Liz Truss",
    "summarized_story": "From Okey Sampson, UmuahiaThe family of the detained leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, has sued UK Foreign Secretary Liz Truss, for not acknowledging that the IPOB leader, a UK citizen, has been a victim of extraordinary rendition and illegal detention.\nThe family accused the Foreign, Commonwealth and Development Office of abdication of its responsibility, to acknowledge and respond to Kanu’s extraordinary rendition.\nThe family’s counsel, Bindmans LLP, has sent a pre-action letter on behalf of the family, to the Foreign Secretary, Truss, challenging her failure to acknowledge that Kanu, has been subjected to extraordinary rendition and torture.\nKanu was renditioned from Kenya to Nigeria in June 2021 and has remained in detention since then.\nThe Federal Government has denied that Kanu was renditioned, claiming he was intercepted in Kenya with the help of security agencies."
  },
  {
    "headline": "Sanwo-Olu Emerges Lagos APC Governorship Candidate, Mustapha, Oluwo Disqualified from Exercise",
    "summarized_story": "Segun JamesThe Governor of Lagos state, Mr Babajide Sanwo-Olu has emerged as the All Progressives Congress (APC) governorship candidate for Lagos state.\nSanwo-Olu’s emergence followed the disqualification of his opponents, Olawale Oluwo and Olufemi Mustapha from participating in the exercise by the election committee of the party.\nIn attendance included Deputy Governor, Dr Obafemi Hamzat, Speaker House of Representatives, Rt.\nFemi Gbajabiamila, former Deputy Governors in the State, Lagos APC chairman, State executive council members among others.\nIn his address, Governor Sanwo-Olu said, “I acknowledge all the committee members from Abuja."
  },
  {
    "headline": "Winners of PDP Governorship Primaries (See Table)",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "News in Photographs: Buhari Meets Osinbajo",
    "summarized_story": "President Muhammadu Buhari Thursday met with Vice President Yemi Osinbajo shortly before his departure to Malabo, Equatorial Guinea.\nThe meeting held in the President’s office at the State House Abuja.\nThe meeting is coming few days to the All Progressives Congress Presidential primaries in which Osinbajo is one of the top contenders.\nThe party’s presidential primary holds May 29 and 30 in Abuja.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "FAAC Shares N656, 602bn April Revenue to FG, States, LGs",
    "summarized_story": "Citing the communique, the Director (Information, Press and Public Relations), Office of the Accountant-General of the Federation, Henshaw Ogubike said theN656.602 billion total distributable revenue comprised distributable statutory revenue of N461.189 billion, distributable Value Added Tax (VAT) revenue of N166, 522 billion, and N8.891 billion being Excess bank charges recovered as well as a N20 billion augmentation.\nThe communiqué confirmed that from the total distributable revenue of N656, 602 billion, the federal government received N257.611 billion; states received N201, 256 billion while the local government councils received N149.251 billion.\nThis was lower than the N933.304 billion received in the preceding month by N298.267 billion.\nFrom the N461,189 billion distributable statutory revenue, the federal government received N217.412 billion; the states got N110.275 billion while the local government councils received N85.017 billion.\nFrom the N166,522 billion distributable VAT revenue, the federal government received N24.978 billion, states received N83,261billion and the local government councils received N58,283 billion."
  },
  {
    "headline": "Bandits Kill 3 PDP Delegates, One Other in Niger",
    "summarized_story": "By Laleye Dipo in MinnaThree unnamed delegates to the People’s Democratic Party Governorship primary in Minna and one other person were on Wednesday killed by gunmen.\nThe deceased delegates were in Minna along with 10 others before the primary was postponed till Thursday and were returning to their local government area, Mariga to collect their identification materials when the incident occured.\nThe incident occurred between Mariga and Tegina towns, according to the report.\nIt was learnt that the vehicle in which the delegates were traveling ran into an ambulance by the gunmen and during sporadic shooting the four people were hit and lost their lives.\nThe Chairman of the Peoples Democratic Party Primary Election Committee and Deputy Governor of Bayelsa State Mr. Lawrence Ewhrudjakpo confirmed the incident in an announcement when the exercise commenced on Thursday."
  },
  {
    "headline": "EXCLUSIVE: Ex-President Jonathan Secretly Submits APC Presidential Nomination Form To Party Chairman, Adamu",
    "summarized_story": "Former President Goodluck Jonathan has secretly submitted his All Progressives Congress (APC) presidential nomination and expression of interest forms.\nHe submitted his nomination form through the APC Chairman a few days ago,” a source in the ruling party privy to information said.\nJonathan won the 2011 presidential election but lost his attempt to secure a second term in office in 2015.\nBackgroundJonathan had recently rejected the presidential form of the ruling APC purchased for him, purportedly by a group of supporters from the northern region.\n“And upon purchasing the form, Jonathan alerted Buhari."
  },
  {
    "headline": "EXCLUSIVE: Ex-President Jonathan Secretly Submits APC Presidential Nomination Form To Party Chairman, Adamu",
    "summarized_story": "Former President Goodluck Jonathan has secretly submitted his All Progressives Congress (APC) presidential nomination and expression of interest forms.\nHe submitted his nomination form through the APC Chairman a few days ago,” a source in the ruling party privy to information said.\nJonathan won the 2011 presidential election but lost his attempt to secure a second term in office in 2015.\nBackgroundJonathan had recently rejected the presidential form of the ruling APC purchased for him, purportedly by a group of supporters from the northern region.\n“And upon purchasing the form, Jonathan alerted Buhari."
  },
  {
    "headline": "EXCLUSIVE: Nigerian Court To Pronounce Jonathan ‘Constitutionally, Morally’ Qualified To Contest For 2023 President On Friday",
    "summarized_story": "A Federal High Court sitting in Yenegoa, Bayelsa State will on Friday rule that former President Goodluck Jonathan is “constitutionally” qualified to contest for president in 2023, SaharaReporters has gathered.\nJonathan won the 2011 presidential election but lost his attempt to secure a second term in office in 2015.\n“They are tying up their loose ends,” a source privy to the case told SaharaReporters on Thursday.\nHe later contested and won the 2011 presidential election.\nHaving spent five years in office as President, Dr. Jonathan is disqualified from contesting the 2023 presidential election."
  },
  {
    "headline": "EXCLUSIVE: Nigerian Court To Pronounce Jonathan ‘Constitutionally, Morally’ Qualified To Contest For 2023 President On Friday",
    "summarized_story": "A Federal High Court sitting in Yenegoa, Bayelsa State will on Friday rule that former President Goodluck Jonathan is “constitutionally” qualified to contest for president in 2023, SaharaReporters has gathered.\nJonathan won the 2011 presidential election but lost his attempt to secure a second term in office in 2015.\n“They are tying up their loose ends,” a source privy to the case told SaharaReporters on Thursday.\nHe later contested and won the 2011 presidential election.\nHaving spent five years in office as President, Dr. Jonathan is disqualified from contesting the 2023 presidential election."
  },
  {
    "headline": "Anti-graft Group, CACOL Demands Resignation, Prosecution Of Senator Oduah Over NYSC Certificate Scandal",
    "summarized_story": "The Centre for Anti-Corruption and Open Leadership (CACOL), has called on Senator Stella Oduah to resign from the National Assembly if she cannot come clean from the allegation of perjury levelled against her.\nStella OduahSaharaReporters had reported that the lawmaker representing Anambra North Senatorial zone did not complete her National Youth Service.\nThe letter was in response to an inquiry by a group known as the Concerned Anambra North PDP Stakeholders.\nThis scandal in which Mrs Stella Oduah is currently enmeshed is another major, monumental and massive disgrace not only to the hallowed chamber of the Senate where she is currently representing her constituency but to the country at large.\nAlthough, we know that a Federal High Court had already ruled that possessing an NYSC certificate was not a condition for holding public office but what happened in a situation whereby the person lied on oath."
  },
  {
    "headline": "NUT president defeats senate majority leader to win Kebbi APC guber ticket",
    "summarized_story": "Nasiru Idris, president of the Nigeria Union of Teachers (NUT), has won the governorship ticket of the All Progressives Congress (APC) in Kebbi state.\nIdris defeated Yahaya Abdullahi, senate majority leader, and Abubakar Gari-Malam, another aspirant, to clinch the ticket.\nAnnouncing the result during the exercise which took place on Thursday, Idris Yahuza, returning officer for the election, said Abdullahi didn’t get any vote.\nAccording to Yahuza, the NUT president secured 1,055 votes out of the 1,090 votes that were cast, while Gari-Malam got the remaining 35 votes.\nAside from being the national president, Idris is also the deputy national chairman of the NLC."
  },
  {
    "headline": "NUT president defeats senate majority leader to win Kebbi APC guber ticket",
    "summarized_story": "Nasiru Idris, president of the Nigeria Union of Teachers (NUT), has won the governorship ticket of the All Progressives Congress (APC) in Kebbi state.\nIdris defeated Yahaya Abdullahi, senate majority leader, and Abubakar Gari-Malam, another aspirant, to clinch the ticket.\nAnnouncing the result during the exercise which took place on Thursday, Idris Yahuza, returning officer for the election, said Abdullahi didn’t get any vote.\nAccording to Yahuza, the NUT president secured 1,055 votes out of the 1,090 votes that were cast, while Gari-Malam got the remaining 35 votes.\nAside from being the national president, Idris is also the deputy national chairman of the NLC."
  },
  {
    "headline": "IN FULL: Dapo Abiodun, Omo-Agege, Tonye Cole... winners of APC guber tickets",
    "summarized_story": "In Ogun state, Dapo Abiodun secured the party’s ticket to seek a second term in office.\nDapo Abiodun.”AdvertisementOMO-AGEGE CLINCHES TICKET FOR DELTAOvie Omo-Agege, the deputy senate president, will represent the APC as the governorship candidate for Delta state.\nIn his acceptance speech, the APC governorship candidate appreciated the party delegates for their support and promised not to disappoint them.\nTONYE COLE TO REPRESENT RIVERS APCTonye Cole, a former executive director of Sahara Group, won the governorship ticket of the All Progressives Congress (APC) in Rivers state.\nNASIRU IDRIS, NUT PRESIDENT, WINS KEBBI TICKETNasiru Idris, president of the Nigeria Union of Teachers (NUT), has been declared as the APC governorship candidate for Kebbi state."
  },
  {
    "headline": "IN FULL: Dapo Abiodun, Omo-Agege, Tonye Cole... winners of APC guber tickets",
    "summarized_story": "In Ogun state, Dapo Abiodun secured the party’s ticket to seek a second term in office.\nDapo Abiodun.”AdvertisementOMO-AGEGE CLINCHES TICKET FOR DELTAOvie Omo-Agege, the deputy senate president, will represent the APC as the governorship candidate for Delta state.\nIn his acceptance speech, the APC governorship candidate appreciated the party delegates for their support and promised not to disappoint them.\nTONYE COLE TO REPRESENT RIVERS APCTonye Cole, a former executive director of Sahara Group, won the governorship ticket of the All Progressives Congress (APC) in Rivers state.\nNASIRU IDRIS, NUT PRESIDENT, WINS KEBBI TICKETNasiru Idris, president of the Nigeria Union of Teachers (NUT), has been declared as the APC governorship candidate for Kebbi state."
  },
  {
    "headline": "Zulum: I've gotten offers for VP slot -- but I'll prefer to continue as governor",
    "summarized_story": "Babagana Zulum, governor of Borno, says he has been approached by presidential aspirants to be their running mate in the 2023 general election.\nHe said this on Thursday during the governorship primary organised by the All Progressives Congress (APC) in the state.\nZulum, who secured the APC governorship ticket, said he would rather prefer to focus on continuing on his achievements as governor.\nI have asked myself, what happens to all these plans that I am central to, which are helping to fast-track our recovery in Borno state?\n“Ladies and gentlemen, the killings in Kala-Balge at the weekend made me more critical, and the incident seriously reminded me of the challenges that are still ahead of us in Borno state."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Egyptian health startup Esaal raises $1.7 million in seed funding",
    "summarized_story": "Esaal, a health and wellness startup, which has enjoyed unprecedented success in the MENA’s telemedicine industry, has announced a $1.7 million seed investment from A15, according to a statement released by the MENA-focused company.\nSince its launch in 2018, Esaal has accumulated $3 million in funding, to fund its physical health and mental health and nutrition consultation services which it offers for subscription or on-demand consultation fees.\nEsaal’s foray into mental health consultancy is not unrelated to Egypt’s mental crisis, where one-quarter of the country’s population is estimated to suffer from mental health issues.\nAccording to surveys, in the wider MENA region, (one-third) 35% of the MENA population frequently experience stress, while 29% suffer from depression, and even more adults increasingly suffer from obesity.\nAt the end of each session, Esaal users can pay using cash, credit card, Fawry, or Vodafone."
  },
  {
    "headline": "Nigeria wants to help creators sell their intellectual properties",
    "summarized_story": "The Nigerian government has signed a 3-year intellectual property rights (IPR) agreement with Developing Africa Group (DAG) to create a marketplace where Nigerians can sell their intellectual property rights and receive royalties.\nThe platform will allow Nigerian creators commercialise registered intellectual property rights, and enable them to sell or exchange those rights internationally.\nGlobally, the intellectual property rights market is worth $8.2 billion and is set to reach $16.1 billion by 2026 with the advent of cloud-based solutions.\nIntellectual property in NigeriaIntellectual property rights (IPR) are the exclusive rights creators have over their works.\nThe country’s Copyright Act governs the intellectual property rights of literary, artistic, musical works, broadcasting, recorded, and cinematographic works."
  },
  {
    "headline": "Dear healthtech startups, Jumia is coming for your bread!",
    "summarized_story": "It also represents a more formidable competitor for existing healthcare startups.\nThis makes it imperative that healthtech startups build solutions for this purpose.\nIn a chat with Techpoint Africa, he said, “Jumia can potentially build out its healthtech play through more partnerships to facilitate diagnostics.\nHealthtech startups, for example, can provide faster and more efficient services by partnering with Jumia.\nDespite being boosted by the COVID-19 pandemic, healthtech startups are still a long way from meeting Africa’s healthcare needs."
  },
  {
    "headline": "Reclaiming stolen African artefacts",
    "summarized_story": "Also, a Nigerian, Chidi Nwaubani, launched the “Looty” project to reclaim African artefacts stolen by European colonists.\nThe project will create 3D images of these artefacts, sell them as non-fungible tokens (NFTs), and use the proceeds to support young African artists.\nThis is because some of us mistake mental health for a mental illness, which it is not.\nMental health is more than just the absence of a mental disorder.\nVictoria Fakiya A writer with ADHD who is interested in mental health and how technology is improving the lives of Africans with mental disorders."
  },
  {
    "headline": "[PODCAST] Relooting African art with NFTs",
    "summarized_story": "Share this article:If you listened to the last Techpoint African Podcast, you definitely remember Oluwanifemi and Chimgozirim going at it for several minutes, debating the Nigerian government’s decision to tax calls to provide healthcare.\nToday we talked about the Kenyan government’s plans to roll out a telemedicine programme.\nBut it also made a nice segue into the African Mobility Conference organised by GIG Mobility which will hold on June 2, 2022, at Eko Hotel and Suites, Victoria Island, Lagos.\nAnother topic on the discussion table was the Central African Republic’s decision to launch an official crypto hub named Sango.\nYou can also get the podcast on Spotify, Apple Podcasts, and Google Podcasts or anywhere else you get your podcasts."
  },
  {
    "headline": "VerifyMe Launches Instant Vehicle License Verification Service in Nigeria",
    "summarized_story": "With products such as license plate verification, VerifyMe continues to bring relevant products to market to help power growth in the fintech, insurance, and services industries.\nAccording to Esigie Aguele, Co-founder/CEO, VerifyMe Nigeria, the plate number verification service is designed to fill the need for trusted real-time data within Nigeria’s burgeoning vehicle and asset verification market.\nHe said: “We are enthusiastic about the possibilities Plate Number Verification service offers in opening new opportunities for the insurance sector.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Where and How to Buy and Sell cars, Spare parts on Carmart.ng",
    "summarized_story": "Nevertheless, its easy for anyone to know how to buy or sell cars on Carmart Nigeria.\nClick on the Sell ButtonThis is one of the final steps to buy and sell a car on Carmart Nigeria.\nWhy Choose Carmart Nigeria to Buy and Sell a CarThis car shop is recognized as a reliable place to buy and sell used vehicles.\nThis is the reason why you need to carefully study the tips on how to buy and sell a car on Carmart Nigeria.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team."
  },
  {
    "headline": "Bank stocks jump after CBN rate hike",
    "summarized_story": "Bank stocks rose Thursday as investor sentiments improved after the Central Bank of Nigeria (CBN)‘s blockbuster hike in interest rates.\nThe banking index, which tracks the share price movement of all publicly-listed banks, rose 1.22 percent on the day to emerge the best performing sector.\nAnalysts had forecast bank stocks to rise in the coming months following the 150 basis points hike in interest rates by the CBN on Tuesday, the first increase in rates in six years.\nHigher interest rates bode well for banks who invest heavily in government securities and can also reprice their assets higher on the back of the hike.\nThe low interest rate environment had subdued banks which have returned only 4 percent since January as at May 26."
  },
  {
    "headline": "Nigeria’s subsidy bill doubles to near N600bn in one month, data shows",
    "summarized_story": "Nigeria’s subsidy bill doubles to near N600bn in one month, data showsThe finances of Africa’s largest crude producer are sinking under weight of a wasteful gasoline subsidy which doubled during the first full month of Russia’s invasion of Ukraine.\nThe Nigerian National Petroleum Corp. spent 521 billion naira ($1.26 billion) on subsidies in March, a 97% increase from February, according to data published by the company on Thursday.\nTotal expenditure in the first three months of the year was 982 billion naira, the same figures show.\nThe state-owned energy firm ramped up imports in March to 2.06 million tons of the fuel, compared with 1.32 million tons in February and 1.35 million tons in January.\nLawmakers last month amended the government’s budget to increase the sum set aside to fund the subsidies to $9.6 billion."
  },
  {
    "headline": "CBN rate hike threatens real sector’s recovery – Manufacturers",
    "summarized_story": "The Manufacturing Association of Nigeria (MAN) has said the interest rate hike by the Central Bank of Nigeria will reduce the pace of full recovery of the real sector, making manufacturing sector performance to remain lackluster.\nThe Monetary Policy Committee, on Tuesday, increased the monetary policy rate to 13 percent from 11.5 percent.\nThe association said the rate hike would spur upward review of existing lending rates dependent on obligations of manufacturing concerns, which will drive up costs.\nIt said it would intensify demand crunch emanating from the heavily eroded disposable income of Nigerians, constrained access of households and individuals to cheap funds.\nRead also: Naira gains 0.32% after CBN rate hikeAccording to MAN, the rise in key interest rate will exacerbate the intensity of idle capital assets, worsen the already declining profit margin of private businesses and heighten the mortality rate of small businesses."
  },
  {
    "headline": "Edo steps up efforts to contain Lassa fever in communities, to relocate civil service recreation centre – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government is ramping up efforts to contain the spread of Lassa fever across communities in the state, with a charge to environmental health officers in various local government areas to ensure zero incidence in their localities.\nThe Edo State Commissioner for Information, Andrew Emwanta, disclosed this while briefing journalists after the weekly Edo State Executive Council (EXCO) meeting chaired by Governor Godwin Obaseki, at the Government House, in Benin City.\nEmwanta said Governor Obaseki has also approved the relocation of the Edo State Civil Service Recreation Centre at Osadebe Avenue in the GRA axis of the state to a more suitable location.\nHe said, “According to the Edo State Commissioner for Health, Prof. Akoria Obehi, who is also a member of the State Taskforce on Lassa fever, the state has not had any new case or incident of the disease.\n“The Council has resolved that the environmental health officers of the various local government areas especially those in the affected area of Lassa fever will be held responsible for any new outbreak of Lassa fever."
  },
  {
    "headline": "Obaseki’s reforms: CBN rallies investors for devt of 1,590 hectares plantation – Nigerian Observer",
    "summarized_story": "With the global demand for oil palm on the increase amid supply disruptions, investors are taking advantage of the Edo State Oil Palm Programme (ESOPP), to deepen imprints in the country’s oil palm sector.\nAlready, Edo has about 120,000 hectares of oil palm plantation under development.\nAgenmonmen said work is in top gear to supply crude palm oil (CPO) and palm kernel oil (PKO) to the market through the current expansion programme of its palm plantation and mill.\nHe stated that there was no better time to invest in palm oil cultivation and production in Nigeria other than now, particularly against the backdrop of the recent ban on the exportation of palm oil and oil palm produced by the Indonesian government.\n“In recent times, people that normally import can no longer import palm oil and other products from Indonesia."
  },
  {
    "headline": "Obaseki parleys Christian bodies on Benin Master Plan – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, on Tuesday, met with the Christian community in the state, including the Pentecost Fellowship of Nigeria (PFN) and the Christian Association of Nigeria (CAN), to seek the collaboration of Christians and churches toward the realization of the Benin Master Plan and the Edo Regional Development Plan.\nObaseki, at an interactive session/stakeholders’ meeting with the organizations, at the Government House, Benin City, said his government will sustain reforms to improve the livelihoods of the people.\nThe governor said his administration has declared war on land grabbers in the state.\nMrs. Margaret Agbonifo assured the governor that churches in the State will key into the Benin Master Plan and Edo Regional Development Plan to ensure development in the state.\nWe are here to intimate you on what is going on and get your input because the impact of the master plan will benefit all.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Obaseki, U.S govt partner to sustain investment in agric, health, education, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki and the United States are exploring areas of investment to sustain the gains recorded by the Obaseki-led government in agriculture, economy, healthcare and education, among others.\nObaseki disclosed this when he received the United States Ambassador to Nigeria, Mary Leonard, who was on a courtesy visit at the Government House, Benin City.\nThe governor said his government is sustaining efforts at engendering sustainable growth and development and ensuring economic prosperity for Edo people.\nWhile reassuring the support of the United States, she further hailed the Obaseki-led government for its various programmes to positively engage Edo youths.\nLeonard further revealed that museums in the United States of America are intensifying efforts to repatriate Benin artifacts in their possession."
  },
  {
    "headline": "Stakeholders make case for Nigeria’s restructuring at The Difference Africa Day 2022",
    "summarized_story": "Nigeria, today, is a crippled giant; one with troubled institutions, a questionable constitution and inchoate social order requiring very deliberate acts of visionary reformulation and strategic reconstruction to unlock its presidential.\nThis was verdict of stakeholders who gathered at the Oak Gardens Event Centre, Isheri, Lagos on May 25, on the occasion of the seventh edition of the annual Africa Day Colloquium convened by The Difference Newspapers and partners.\n“That the nation is in dire need of a structure reset while the elite need to be schooled on what to do with power.\n“That in realisation of this, every step be taken to ensure the replacement of the extant Lugardian Architecture that has continued to constrain Nigeria’s political evolution and its replacement with a more agreeable, consensually negotiated and development-inclined Nigerian Project.\n“That Nigeria yet occupies a prime place in the African experience and the resolution of its political and social challenges would have a booster effect on the dignity and self-worth of all people of African descent.”"
  },
  {
    "headline": "2023: Sanwo-Olu wins Lagos APC governorship primary",
    "summarized_story": "Lagos State Governor, Bababjide Sanwo-Olu, on Thursday, emerged Lagos All Progressives Congress (APC) candidate for the 2023 governorship poll.\nSanwo-Olu, a sole contestant, emerged candidate at the APC 2023 Governorship primary, held at the Mobolaji Johnson Arena, formerly, Onikan Stadium, Lagos Island.\n1,198 out of 1,225 registered State delegates were officially accredited for the exercise.\nMembers of the Lagos State Governorship Primary Election Committee of APC had barred one of the aspirants from the venue of the primary.\nMustapha, resigned about 14 months ago and declared to vie against Sanwo-Olu picking up the N50 million governorship form of the party."
  },
  {
    "headline": "FY’21: FBN Holdings grows profit by 99% to N166.7bn",
    "summarized_story": "FBN Holdings Plc (FBNH) has announced its audited results for its 2021 financial year posting strong financial performance.\nThe Group also recorded improved performance of 99% increase in its profit before tax (PBT) to N166.7 billion, up from N83.7 billion in the previous year.\nThe Group’s deposit from customers also increased by 19.5% y-o-y to N5.9 trillion, up from N4.9 trillion it made in 2020.)\nHighlighting revenue and profitability, the Group delivered a stellar performance growing gross revenue by 28.2% to ₦757.3 billion and profit before tax by 99.1% to ₦166.7 billion.\nProfit before tax is up 77.9%, gross earnings 30.3%, total assets 15.9% and customer deposits up 19.5%."
  },
  {
    "headline": "Court issues arrest warrant on teacher accused of sexual harassment",
    "summarized_story": "Adebayo ObajemuA High Court in Abuja, on Tuesday, issued arrest warrant on a dismissed teacher who failed to appear in court to face charges of sexual abuse.\nAccording to him, Mr Ada opted to disrespect the court for the second time by rejecting the court’s invitation.\nHe asked the judge to issue an arrest warrant on the accused so that the police may apprehend him and bring him before the court.\n“An arrest warrant is hereby issued against the defendant.\nThe Commissioner of Police on January 18 filed a child molestation charge against Mr Ada at the Abuja court."
  },
  {
    "headline": "Buhari jets out of the country, with wife, others",
    "summarized_story": "President Muhammadu Buhari on Thursday, left Abuja for Equatorial Guinea to participate in the African Union Extra-ordinary Session of Assembly of Heads of State and Government in Malabo, with a special focus on security.\nPresident Buhari will join other Heads of State and Government to deliberate on Humanitarian Challenges, Hopes and Challenges in Africa, and participate in the adoption of the Assembly Declaration on Humanitarian Summit and pledging conference.\nThe Statement is titled ‘President Buhari attends AU Extra-ordinary summit in Malabo.’The three-day summit, which will hold on May 26th-28th, will also focus on Humanitarian Challenges in Africa, with related issues on migration, refugees, returnees and Internally Displaced Persons.\nAt the summit, the African leaders will consider Terrorism and Unconstitutional Change of Government, with attendant spiraling effects on human rights and economies.\nHe is expected back to Abuja on Saturday, ahead of the All Progressives Congress presidential primary elections holding on Sunday into Monday."
  },
  {
    "headline": "Reconciliation: Yari Withdraws 4 Court Cases Against Zamfara APC",
    "summarized_story": "Following the reconciliation of the warring camps in the Zamfara State chapter of the All Progressives Congress (APC), a former governor of the state, Alhaji Abdulaziz Yari, has ordered the immediate withdrawal of four litigations instituted against the party in the state and outside.\nRecall that the national chairman of the APC, Senator Abdullahi Adamu, had on May 8 and 9, 2022 reconciled the camps of the state governor, Bello Matawalle, and that of his predecessor, Yari, and Senator Kabiru Garba Marafa.\nThe reconciliation is said to have opened a new chapter in the ruling party in the state.\nEfforts by the defunct national caretaker committee of APC under the leadership of the Yobe State governor, Mai Mala Buni, to resolve the issue yielded no results.\nHe said the APC in Zamfara was now united under one leadership and that all members are now working in harmony in the interest of the state."
  },
  {
    "headline": "A’Ibom Govt, African Delta Power Sign 732mw Agreement",
    "summarized_story": "The Government of Akwa Ibom State has entered into a co-location and power production pact with African Delta Power Limited to add the additional 366 megawatts to the existing 191 megawatts of the state-owned Ibom power plant.\nIme Asibong signed for Ibom Power; while Jemeriah Oluwaseun and Christabel Nwagum (CEO of African Delta and secretary respectively) signed the agreement on behalf of African Delta Power.\nSpeaking on the development, the Chairman of Ibom Power Company Limited, Engr.\nEtido Inyang said the first phase of Ibom power is already operational with an installed capacity of 191megawatts.\nHe said Ibom Power has a license to generate 685megawatts of power which the proposed power plant will leverage on."
  },
  {
    "headline": "A’Ibom Govt, African Delta Power Sign 732mw Agreement",
    "summarized_story": "The Government of Akwa Ibom State has entered into a co-location and power production pact with African Delta Power Limited to add the additional 366 megawatts to the existing 191 megawatts of the state-owned Ibom power plant.\nIme Asibong signed for Ibom Power; while Jemeriah Oluwaseun and Christabel Nwagum (CEO of African Delta and secretary respectively) signed the agreement on behalf of African Delta Power.\nSpeaking on the development, the Chairman of Ibom Power Company Limited, Engr.\nEtido Inyang said the first phase of Ibom power is already operational with an installed capacity of 191megawatts.\nHe said Ibom Power has a license to generate 685megawatts of power which the proposed power plant will leverage on."
  },
  {
    "headline": "Arewa Youths Knock ASUU Over Call For CBN Gov’s Sack",
    "summarized_story": "The Arewa Consultative Youth Movement (ACYM) has come down hard on the Academic Staff Union of Universities (ASUU) for calling for the sack of the Governor of the Central Bank of Nigeria (CBN), Dr. Godwin Emefiele, over the depreciating value of the Naira.\nThe statement reads, “We urge ASUU and its ilks to stop attacking the CBN Gov that has been busy clearing the mess that they created in the education sector.\n“All Nigerians are aware that ASUU’s incessant strikes have done more harm than good to the system.\n“It is surprising how the union is not seeing this but is busy calling for the sacking of the head of an agency for no just cause.\nThey should not be beclouded by politics and hatred but be objective in their pronouncements.”"
  },
  {
    "headline": "Arewa Youths Knock ASUU Over Call For CBN Gov’s Sack",
    "summarized_story": "The Arewa Consultative Youth Movement (ACYM) has come down hard on the Academic Staff Union of Universities (ASUU) for calling for the sack of the Governor of the Central Bank of Nigeria (CBN), Dr. Godwin Emefiele, over the depreciating value of the Naira.\nThe statement reads, “We urge ASUU and its ilks to stop attacking the CBN Gov that has been busy clearing the mess that they created in the education sector.\n“All Nigerians are aware that ASUU’s incessant strikes have done more harm than good to the system.\n“It is surprising how the union is not seeing this but is busy calling for the sacking of the head of an agency for no just cause.\nThey should not be beclouded by politics and hatred but be objective in their pronouncements.”"
  },
  {
    "headline": "BREAKING: Sanwo-Olu Wins APC Gov Ticket For Second Term",
    "summarized_story": "Babajide Sanwo-Olu, the governor of Lagos State, has won the All Progressives Congress governorship primary in Lagos State.\nOn Thursday, he was named the victor of the primary held at Mobolaji Johnson Sport Arena in Onikan, Lagos.\nHe received 1,170 votes out of 1,182 total votes cast.\nHis rivals had argued that they had been barred from running in the primary.\n“To the other contestants, I congratualte you for being a part of this very democratic process and invite you to join hands with me #ForAGreaterLagos.”"
  },
  {
    "headline": "BREAKING: APC Presidential Primary Shaky, Aspirants Confused As Junketing Nigerian President, Buhari Jets Off To Malabo On Three-day Visit",
    "summarized_story": "BREAKING: APC Presidential Primary Shaky, Aspirants Confused As Junketing Nigerian President, Buhari Jets Off To Malabo On Three-day VisitPresident Muhammadu Buhari will depart Abuja on Thursday to participate in the African Union Extra-ordinary Session of Assembly of Heads of State and Government in Malabo, Equatorial Guinea.\n“President Buhari will join other Heads of State and Government to deliberate on Humanitarian Challenges, Hopes and Challenges in Africa, and participate in adoption of Assembly Declaration on Humanitarian Summit and pledging conference.\n“President Buhari will also hold sideline meetings with some leaders during the meeting in Malabo.\n“Mrs Aisha Buhari, who is the President of African First Ladies Peace Mission, is accompanying her husband to the African Union meeting.\nAhmed Rufa’i Abubakar and Chairman, Nigerians In Diaspora Commission (NiDCOM) Abike Dabiri-Erewa.”His latest trip comes three days before the All Progressives Congress (APC) presidential primary election."
  },
  {
    "headline": "2022: Osun NATA endorses Oyetola for second term, assures him 10,000 votes",
    "summarized_story": "The artisans also professed thier readiness to vote massively for the re-election of Governor Adegboyega Oyetola in the next governorship election in the State.\nThey assured the Governor of over 10,000 votes saying all their members across the State will vote massively to ensure his return.\n“We are endorsing Mr Governor for a second term because of his modest achievements in the last three and a half years.\n“We have already mobilised our people and I can assure you that over 10,000 members in Osun will vote for him.\nWe want the entire world to know why we have resolved to identify and endorse the governor for second term."
  },
  {
    "headline": "BREAKING: APC committee bars Sanwo-Olu’s challenger from primary venue",
    "summarized_story": "The Lagos State Governorship Primary Election Committee of the All Progressives Congress, on Thursday, barred one of the aspirants from the venue of the primary at the Mobolaji Johnson Arena, formerly Onikan Stadium, Lagos Island, The PUNCH authoritatively reports.\nPunch correspondent learnt that the committee prevented one of the contenders of Governor Babajide Sanwo-Olu, Abdul-Ahmed Mustapha, from the venue.\nIt was gathered that the committee chaired by a former deputy governor of Borno State, Shettima Yuguda, claimed that Mustapha was not cleared by the screening committee of the party.\n“We went to the APC state secretariat at Acme Road yesterday (Wednesday), we tried to get our accreditation tags but we were not given.\nAlso, APC chairman for Lagos, Cornelius Ojelabi, did not take his calls as of press time."
  },
  {
    "headline": "2023: I have come to bring good tidings in Arochukwu, Ohafia constituency, Ikoku tells APC delegates",
    "summarized_story": "Mary, a media guru and notable social advocate spoke in a press statement through her campaign organisation on Thursday.\nPart of her statement titled, “The Dawn of Transparency and Accountability”, reads, “These are two vital attributes that have, historically, been found to be deficit in the Nigerian polity transparency and accountability.\nThis deficit in transparency and accountability has caused us a lot in good governance, development and progress.\nI come fully prepared to take up the office of House of Representatives from day one and begin to deliver tangible and meaningful results.\n“I have served successfully in the public sector, organised private sector and NGO sector and I stand ready to take up this higher calling."
  },
  {
    "headline": "Sultan to FG: Smoke out terrorists, other criminals from forests, communities, prosecute them",
    "summarized_story": "The Sultan called for intensified efforts in identifying and prosecuting “the so called unknown gunmen”, adding that governments at all levels should collaborate with security agencies in tackling insecurities in whatever guises.\nThe incident is but an addition to the series of many other killings meted, particularly to Muslims in the South-Eastern states of Nigeria.\nGovernment must spare no efforts to take control of all forests and swampy areas that have become hideouts for criminals.\nSouth-Eastern states’ governments and governors, as well as community leaders should be seen and heard condemning and assuaging fears and tension within their respective states and communities (as the case may be).\nPerhaps they should emulate the Northern Governors in reacting quickly and appropriately, on similar happenings within their jurisdictions; security surveillance should, maximally be accorded Muslim communities in the South-Eastern Nigeria,” the Sultan added."
  },
  {
    "headline": "Presidential ticket: APC national chairman, Adamu, breaks silence on consensus arrangement",
    "summarized_story": "Ahead of the All Progressive Congress (APC) presidential primaries scheduled for Sunday, the party’s leadership Wednesday said consensus arrangement on its choice candidate is not on the table for now.\nAPC National Chairman Senator Abdullah Adamu revealed this while speaking to some select journalists in Abuja.\nParty’s standBut speaking in an interview Wednesday at the party’s national secretariat, the APC national chairman, Senator Adamu, said “the party has its own rules and strategies, which I will not expose now.\nLawan had already scheduled some engagements for Wednesday one of which was to meet with the APC leaders and delegates in Borno state.\n“We are therefore here to condole with you, the government and people of Borno state for this loss."
  },
  {
    "headline": "Group hails CBN’s decision to raise MPR to 13% after 2yrs",
    "summarized_story": "…commends Emefiele’s achievements…calls on police arrest those behind fake news on alleged Emefiele’s sackA group called South West Professional Forum, SWPF, Thursday, hailed the decision of the Central Bank of Nigeria, CBN, to raise the Monetary Policy Rate (MPR) to 13 per cent after two years.\n“We want hail Emefiele and his seasoned team of professionals that is the Monetary Policy Committee (MPC) of the Central Bank of Nigeria (CBN) to vote unanimously to raise the Monetary Policy Rate (MPR) to 13 per cent on Tuesday, and indeed is a very crucial decision for national interest.\n“Through his people based policies, Nigerians have been offered numerous interventions and support for Small Medium Enterprises, SMEs and others.\n“We condemn those who just woke up from their mischief to relay fake news about the alleged sack of the CBN Governor on Wednesday.\n“This is handiwork of some politicians who have nothing to offer because they have run out of steam and are only out to blackmail the CBN Governor with such sponsored fake news."
  },
  {
    "headline": "GPP 2022: Canon drives innovation, showcases latest digital technologies across industry",
    "summarized_story": "In keeping with global trends in a post-pandemic era, where customer demand has shifted towards digital technologies, Canon will be spotlighting its digital printing technology, inkjet capabilities, wide format technology and complete workflow, from pre-press to post-press technology, spanning various industries including packaging, labelling, and retail.\nOffering 5 dedicated zones with live demonstrations that underscore the real-life applications of inkjet, wide format and production printing, Canon will also have dedicated webinars and virtual stand tours for participants who cannot attend in person.\nBecause of various technological advancements, we always propose the right solution and product to the end customer with this knowledge.\nWe’re doing this by transitioning from offset to digital printing.\nCanon prioritises our customers’ needs in everything we do, including providing expert advice on how to reimagine their business opportunities."
  },
  {
    "headline": "Soludo earmarks 4bn for completion of Anambra Int’l Airport project",
    "summarized_story": "By Tony Oraeki, AwkaAnambra State Governor, Prof. Charles Soludo yesterday said he has budgeted the sum of N4 billion to continue work at the Anambra State International passenger/Cargo Airport, built by his predecessor, Chief Willie Obiano.\nSoludo gave this hint through the State Commissioner for Budget and Economic Planning, Mrs. Chiamaka Nnake, during a press conference on the revised 2022 budget breakdown at the government house, Awka.\nShe added that the funding for the N170 billion 2022 revised budget for the state is not a problem for the state governor, Prof Chukwuma Soludo.\n“The revised budget size is about N170 billion versus the existing appropriation of N142 billion (with the capital expenditure accounting for 64% compared to 57% previously).\n“Capital expenditure increased by 33% from N81 billion to N108 billion while Recurrent expenditure increased marginally by 0.79% from N60.9 billion to N61.4 billion."
  },
  {
    "headline": "CIBN appoints Fidelity Bank’s Ken Opara as 22nd President",
    "summarized_story": "Fidelity Bank Plc Executive Director, South West and Lagos, Dr Ken Onyewuchi Opara will tomorrow take over the mantle of leadership of the Chartered Institute of Bankers of Nigeria, CIBN.\nDr Opara, who was elected a month ago, will be sworn in as the 22nd President and Chairman in Council of the highly revered Institute.\nA graduate of Finance from the University Of Nigeria, Dr opara has had a distinguished career in banking spanning over 30years.\nHis Bank, Fidelity Bank Plc is one of the leading financial institutions leveraging in this area .\nDr Ken Opara is married with four Children."
  },
  {
    "headline": "Border Demarcation, A Big Challenge In The Curbing Of Petrol Smuggling – Customs",
    "summarized_story": "Deputy Comptroller of Customs, Timi Bomodi, who made known the challenges of Customs in tackling petrol smuggling in the border communities, said the service has been devising strategies to reduce smuggling along Nigeria’sporous borders.\nHe disclosed that the customs service is applying the rules in ensuring that bad eggs within and outside the service are dealt with appropriately.\nHe added that strategies and technology are already reducing petrol smuggling across Nigeria’s borders.\n“Nigeria Customs Service is gradually tilting towards minimizing physical contact in all its activities.\nReacting to the investigation, the Executive Director, Center for Transparency Advocacy, Faith Nwadishi, noted that impunity is the primary reason petrol smuggling is still thriving across Nigeria’s borders."
  },
  {
    "headline": "Abiodun, Sanwo-Olu, Omo-Agege, Matawalle, Buni, Others . . . Winners Emerge In APC Governorship Primaries",
    "summarized_story": "﻿After weeks of political drama and campaigns, the All Progressives Congress held governorship primaries across states in the country.\nThe primary election was held at the Pa Oruta Ngele Township Stadium in Abakaliki, the Ebonyi State capital.\nThe Chairman Electoral Committee for the APC governorship primary election in the state, Babagana Tijani, announced that Matawalle polled 733 votes to emerge as the winner of the primary election.\nThe primary election, which was held at the Federal College of Education, Asaba, saw Omo-Agege contest as the sole aspirant.\nOmo-Agege expressed joy over the smooth conduct of the primaries and thanked his supporters and the entire APC family in Delta."
  },
  {
    "headline": "APC Governorship Primary Committee Member Shot In Taraba – Committee Chairman",
    "summarized_story": "A member of the Taraba State APC governorship primary electoral committee has been shot and is in critical condition at a hospital.\nChairman of the Committee, Lawrence Onuchukwu, informed journalists of the development at the Police Headquarters in Jalingo, the state capital on Thursday night.\nA protest had erupted after some youths in Jalingo accused the governorship primary committee chairman of presenting fake result sheets for the primary when there was none in the state.\nThe youths are calling on Onuchukwu to address the press on the true situation of things and declare that the primary election failed to hold.\nIn reaction to the intervention of the police, many party supporters occupied the Command’s headquarters awaiting the outcome of expected talks."
  },
  {
    "headline": "Buhari Departs Abuja For AU Summit In Equatorial Guinea",
    "summarized_story": "President Muhammadu Buhari will on Thursday leave Abuja to participate in the African Union Extra-ordinary Session of Assembly of Heads of State and Government in Malabo, Equatorial Guinea.\n“The three-day summit, which will hold on May 26th-28th, will also focus on Humanitarian Challenges in Africa, with related issues on migration, refugees, returnees, and internally displaced persons.\nPresident Buhari will join other Heads of State and Government to deliberate on humanitarian challenges, hopes, and challenges in Africa, and participate in the adoption of the Assembly Declaration on Humanitarian Summit and the pledging conference.\nPresident Buhari will also hold sideline meetings with some leaders during the meeting in Malabo.\nMrs. Aisha Buhari, who is the President of the African First Ladies’ Peace Mission, is accompanying her husband to the African Union meeting."
  },
  {
    "headline": "Sanwo-Olu Wins Lagos APC Governorship Primary",
    "summarized_story": "Governor Babajide Sanwo-Olu has won the All Progressives Congress’ (APC) governorship primary in Lagos State.\n“Today, May 26, 2022, a purported “Governorship Primary Election” of the All Progressives Congress (APC) Lagos state is being held at the Mobolaji Johnson Stadium, Onikan,” the statement said.\n“The one-sided Congress, which excluded all the other aspiring delegates that bought the APC Delegates Nomination Forms, was conducted in gross violation of the APC Electoral guidelines, APC Constitution and the Electoral Act.\nThe Lagos State APC State Exco, headed by one pastor Cornelius Ojelabi, is complicit in the exercise of this blatant rape of democracy in APC Lagos.\n“It is clear that my candidacy in this2022 APC primary elections has generated massive positive excitement from party members and Lagosians generally."
  },
  {
    "headline": "Danmarke Wins Katsina PDP Governorship Primary",
    "summarized_story": "Senator Garba Yakubu Lado Danmarke has emerged as the winner of the Katsina Peoples Democratic Party gubernatorial primary held on Thursday.\nThe Electoral Committee Chairman, Mr. Chika Nwozuzu, declared Danmarke the winner of the primaries at about 12: 55 am on Friday.\nHe announced that Danmarke polled 740 votes to beat his closest rival Salisu Yusuf Majigiri who scored 257 votes, and two others.\nThe other aspirants, Ahmed Yar’Adua and Shehu Inuwa Imam, got 53 and 44 votes, respectively.\nA total of 1,117 delegates drawn from the 34 local government areas of the state took part in the primaries held at the party headquarters, KatsinaIn all, 1,108 delegates were accredited out of the 1,117 with 10 invalid, while four accredited delegates that didn’t vote the after accreditation."
  },
  {
    "headline": "Zulum wins APC Governorship ticket in Borno",
    "summarized_story": "Borno State Governor, Professor Babagana Zulum has been declared winner of the APC governorship primaries ahead of the forthcoming general elections in 2023.\nUba Maigari Ahmadu, Chairman of the APC Governorship and House of Assembly primaries for Borno State, announced that Zulum won with 1,411 votes by delegates.\nHe explained that 1,560 voters were registered for the primaries, while 1,422 voters were accredited, out of which 1,411 votes were recorded with no record of invalid votes.\nZulum in his acceptance speech, thanked delegates and stakeholders, after which he revealed his position on the calls for him to become Vice President.\nHe added that the recent killings in the state, still remain to face more security challenges before people’s lives and property are protected to sustain peace."
  },
  {
    "headline": "Again Sokoto APC Guber Aspirants Call For Direct Primaries",
    "summarized_story": "As the All Progressives Congress APC in Sokoto prepares to hold its governorship primaries, some governorship aspirants have urged the party’s leadership to use direct primaries in the state.\nThe aspirants threatened that anything done contrary to their request may spell doom for the party.\nAccording to them, the party chairman should remember that only a few days before the primaries, the Sokoto federal high court issued a confusing decision that was neither here nor there.\n“We are aware that Sokoto State was among the several other states that requested for a direct primaries due to unresolved issues in their respective states leadership.\n“We are also aware that states like Osun,, Abia and Benue has since been permitted to select their candidates through direct primaries."
  },
  {
    "headline": "Matawalle emerges Zamfara APC Governorship candidate",
    "summarized_story": "Governor Bello Matawalle has emerged the Governorship Candidate of the All Progressive Congress in Zamfara.\nMr. Matawalle pulled 733 votes to emerged winner.\nThis follows the withdrawal of one of the Governorship aspirant Abdulmalik Gajam who announced his withdrawal from the race few minutes before the Commencement of the primary election.\nThe Seven Man Zamfara Governorship Primary election monitoring team delegated by the APC National Headquarters led by Babagana Tijjani Banki Described the exercise as a SuccessHe described Zamfara delegates and party supporters as peace LoversIn his acceptance speech, Governor Bello Matawalle dedicate his victory to the people of the stateHe said this will further strengthen him to deliver more dividends of Democracy to the peopleAmong the Delegates are former Governors Mamuda Aliyu Shinkafi, Abdul’azeez Yari, Senator Kabiru Marafa, Abdullahi Wanban Shinkafi among other top Politicians in the state."
  },
  {
    "headline": "INEC warns about dangers of monetising Nigerian politics",
    "summarized_story": "The Independent National Electoral commission, INEC, has warned that money is increasingly influencing politics, and that the country risks becoming a plutocracy for the wealthy rather than a democracy for the people.\nProf. Mahmood Yakubu, the INEC chairman, stated this at the Centre for Democracy and Development’s (CDD) one-day colloquium on “Emerging Issues that Will Shape the 2023 General Elections in Nigeria” on Wednesday in Abuja.\nHe also stated that INEC is collaborating with the EFCC to combat financial inducements in Nigeria’s electoral process.\nAccording to Prof Yakubu, the conduct of the 2023 election will face three major challenges: insecurity, fake news, and money politics.\nHe went on to say that the antidote to fake news is more real news, as well as greater openness and transparency."
  },
  {
    "headline": "Obi Quiting PDP Shows The Party Is On A Journey Of Self Destruction – Victor Umeh – Arise News",
    "summarized_story": "Former National Chairman, All Progressives Grand Alliance, APGA, Sen. Victor Umeh, says Former PDP Presidential Aspirant Peter Obi’s departure from the PDP is reflective of the failings of the party."
  },
  {
    "headline": "Kayode Fayemi on APC Presidential Screening, Upcoming Elections",
    "summarized_story": "All Progressives Congress APC, party primaries are getting set to take place, presidential hopefuls, governorship aspirants, and others looking to secure the party tickets to represent their various constituencies will be testing their popularity at the party primaries.\nCurrently, there is confusion over the panel that will screen presidential aspirants and when the exercise will be done.\nThe party had on Sunday night postponed indefinitely, it’s screening of presidential aspirants earlier slated for Monday.\nThe confusion over the screening of aspirants followed comments by the National Organizing Secretary of the party, Sulaiman Argungu that the party will be screening the aspirants between 24th and 25th of May 2022.\nJoining us on the show as we discuss the readiness of the party ahead of its primaries, and also to get clarity on the presidential screening, is Kayode Fayemi, Governor of Ekiti state, and presidential aspirant of the All Progressives Congress APC."
  },
  {
    "headline": "Peter Obi Dumps PDP, Nigerians React + Widower Grieves for Slain Family- Trending With Ojy Okpe",
    "summarized_story": "Reactions have trailed Peter Obi’s resignation from the people’s Democratic Party in a letter that went viral on Wednesday, addressed to the party’s national chairman, Obi said that recent developments within the party have made it impossible for him to continue participating in making constructive contributions.\nIn another development, Jubril Ahmed, the husband of the pregnant woman killed; along with her four children by unknown gunmen in Anambra state over the weekend; has opened up about his grief.\nFinally, Sheriff Oborevwori , speaker of the Delta house of assembly, won the Peoples Democratic Party governorship primary in the state on Wednesday polling 590 votes to beat his closest rival, David Edevbie.\nOborevwori who is the preferred candidate of Ifeanyi Okowa, the Governor of delta state was seen celebrating in a video that is now making the rounds on social media."
  },
  {
    "headline": "APC Presidential Primary: Consensus Is Not Undemocratic, However I Prefer Competition, Says Governors’ Chairman Fayemi",
    "summarized_story": "Ekiti State Governor and Chairman of the Nigeria Governors’ Forum, Kayode Fayemi, has revealed his preference to test his popularity with delegates at the forthcoming All Progressives Congress presidential primary slated for May 29-30 in Abuja, rather than a possible consensus arrangement which the APC considers as an option.\nFayemi who was a guest on ARISE TV’s Morning Show stressed that the consensus mode of choosing candidates is democratic, as long the process is fair.\n“Consensus is provided for in the APC constitution, as well as direct and indirect elections,”” Fayemi said.\n“Once you get the buy-in of all aspirants, and they agree on one person to be the candidate representing the party, there is nothing anti-democracy about that,”” Fayemi said.\n“I believe I have a very robust and warm relationship with all the governors, regardless of their party.”Watch the full video belowDemola Ojo"
  },
  {
    "headline": "Minutes Before School Attack, Texas Gunman Sent Online Warning",
    "summarized_story": "Eventually, Ramos, a high school dropout with no known criminal record or history of mental illness, was shot dead by law enforcement.\nThe wounded included “multiple children” who survived the gunfire in their classroom, Texas Department of Public Safety spokesperson Chris Olivarez said.\nVictims’ loved ones took to social media to express anguish over the loss of children who never came home from school.\nThe National Rifle Association’s annual meeting starts on Friday in Houston, where Republicans including Abbott, Texas U.S.\nThe Texas rampage stands as the deadliest U.S. school shooting since a gunman killed 26 people, including 20 children, at Sandy Hook Elementary School in Connecticut in December 2012."
  }
]