[
  {
    "headline": "Reps condemn Justice Odili’s home invasion, frivolous court orders",
    "summarized_story": "The House of Representatives’ Committee on Judiciary has condemned the invasion of the home of a Justice of the Supreme Court, Mary Peter-Odili, by security operatives and officials of the Federal Ministry of Justice.\nLuke also reechoed the calls by the Chief Justice of the Federation, Justice Tanko Muhammad, that judicial officers should be cautious of the orders being issued by their courts.\nThe statement was titled ‘The siege at Justice Peter-Odili’s residence: A repudiation of judicial independence and an assault on the sanctity on the nation’s judiciary’.\nThey described the invasion of the Abuja residence of a Supreme Court’s Justice, Mary Odili, as reprehensible, roguish and barbaric.\n“Lawyers in Imo State strongly condemn this reprehensible, roguish, barbaric and abominable invasion of the residence of the Honourable Justice Mary Peter-Odili, who is the second most senior Justice of the Supreme Court."
  },
  {
    "headline": "Police lack vehicles, fuel, communication gadgets, receive N58.9bn in six years",
    "summarized_story": "Analysis of the police budgets from 2015 to 2020 indicates that the force proposed N115.8billion for capital projects while N58.9billion was released by the Federal Government.\nItems in the capital budget include security equipment, air navigational equipment, vehicles and trucks, industrial equipment, books, police stations, barracks, rehabilitation of residential and office buildings, aerodromes, and medical equipment.\nThe traffic officer said, “In our department, only three men have communication radios out of the 12 men in the unit.\nThe spokesman, Ministry of Police Affairs, Bolaji Kareem, explained that the vehicles provided for the police were equipped with communication gadgets.\nHe said, “Recently, the government procured some equipment for the police and most of their vehicles are equipped with walkie-talkies and other communication gadgets."
  },
  {
    "headline": "COVID-19: Lab screens 30, 000 overseas travellers",
    "summarized_story": "By Dennis AgboNigeria Center for Disease Control, NCDC, accredited Coronavirus testing laboratory has screened over 30, 000 overseas travellers from Nigeria since the resumption of international travels after the Covid-19 global lockdown.\nNna said that the lab was responsible for reduction in the amount being charged in Nigeria for testing of Covid-19 samples.\nHe however acknowledged that the cost for testing of Covid-19 was still very exorbitant in Nigeria.\nOur staffs are graduates of Medical lab Science and other science researchers,” Nna stated.\n“We charge the lowest rate in tests for Covid-19 because we don’t see a reason why we should charge as high as others do."
  },
  {
    "headline": "Benue First Lady reads to Benue pupils in Read Aloud initiative to revive reading culture in children",
    "summarized_story": "By Peter Duru, MakurdiWife of the Benue state Governor, Dr. Eunice Ortom has commenced the revival of reading culture among Benue children as she personally reads to pupils in schools in her Read Aloud initiative for Primary School Pupils.\nAs children are read to, they learn new words which builds their vocabulary and communicative skills.\n“And as I do this, I also want our teachers to encourage the children to deal with their reading skills.\n“So it is not just about reading or encouraging children to read in the school environment.\nWe should encourage our children to read at home and we should also find time to read stories and other educational materials to our children."
  },
  {
    "headline": "Just in: 600 Nigerians risk deportation from Kuwait",
    "summarized_story": "By Victoria OjemeAbout six hundred Nigerians residing in Kuwait are at the risk of being deported over failure to get their residential permit renewed.\n“At the moment, we have more than 500 Nigerians in Kuwait who are at the risk of being deported with their families.\nThe Nigerian Embassy in kuwait does not issue or renew passports and due to Covid-19 restrictions in Kuwait, airports have only be opened this October 2021 since it’s closure in March 2019.\nMeaning they could be accosted by security officers and deported as illegals,” some of the Nigerians in Kuwait said.\nHe said, “It is a wrong time because the covid-19 affected all the missions abroad including Nigeria Embassy in Kuwait."
  },
  {
    "headline": "Aso Rock Meeting: What I discussed with Buhari — Tinubu",
    "summarized_story": "By Johnbosco Agbakwuru, ABUJAThe national leader of the All Progressives Congress, APC, Asiwaju Bola Tinubu, has revealed what he went to see President Muhammadu Buhari about at the Presidential Villa, Abuja, today.\nThe APC national leader arrived at the residence of the Presidential Villa, at about 11 am and the meeting lasted for about one hour.\nThe APC national leader came alone this time, unlike the previous visits he normally comes with the pioneer interim chairman of the party, Chief Bisi Akande.\nRecall that President Buhari had few months ago, visited the APC national leader in London when the latter was said to be receiving medical treatment.\nTinubu added that he was not obliged to speak on other things they discussed."
  },
  {
    "headline": "2023: Lagos ex-council secretaries seek Power-shift to South, LG autonomy",
    "summarized_story": "By Clifford NdujiheTHE Conference of former Local Government Executive Secretaries in the 20 councils and 37 LCDAs in have thrown their weight to power-shift to the South in 2023 as a measure to douse rising agitations in the polity.\nThey canvassed full autonomy for local councils to drive development in the third tier of government.\nThe former council scribes spoke at a meeting held at Magodo, Lagos, weekend.\nWe believe there will be tremendous improvement and development in local government if autonomy is fully operational.\nWe also agreed that the issue of banditry and security has developed multifaceted challenges to the extent that government should now be thinking more of peace building strategy than reactionary strategy that is currently being adopted.”"
  },
  {
    "headline": "Army foils kidnap of Catholic Bishop in Imo",
    "summarized_story": "Nigerian troops, on Sunday, foiled an attempt to kidnap the Catholic Bishop of Orlu Diocese, Most Reverend Augustine Ukwuoma.\nDAILY POST reports that the incident occurred at the Orlu Diocesan Catholic Secretariat, BSC Road, Orlu Imo State.\nThe Catholic Bishop was saved after troops responded to a distress call at about 2:30am on Sunday 31 October 2021.\nThe statement read:“Troops conducting Exercise GOLDEN DAWN Sector 3 have foiled an attempted kidnap and robbery of Most Reverend Augustine Ukwuoma at the Orlu Diocesan Catholic Secretariat, BSC Road, Orlu Imo State.\nThe Bishop, his Secretary and Assistant Secretary are safe and unhurt."
  },
  {
    "headline": "Anambra election: Religious leaders urge IPOB to sheathe swords",
    "summarized_story": "The South East Council of Traditional Rulers and the Representatives of Igbo Archbishop and Bishops, have advised the Indigenous People of Biafra (IPOB) not to engage in any bad tendency that will hinder the smooth running of the November 6th governorship election in Anambra State.\nThey asked the pro-Biafra group to cancel all scheduled sit-at-home orders, as these had already caused untold hardship for the people.\nThe southeast traditional and religious leaders, also called on all the candidates in the coming gubernatorial poll in Anambra to eschew violence and commit to a free, fair and credible election.\nThey gave the admonition in a joint statement signed by the Chairman of South East Council of Traditional Rulers, Igwe Charles Mkpuma, and the Catholic Bishop of Owerri, Most Rev.\nWe are of the firm belief that this act of courage and statesmanship is not only imperative but will speedily de-escalate the heightened state of insecurity and dislocation in the South East Zone”."
  },
  {
    "headline": "Tinubu reveals why he visited Buhari",
    "summarized_story": "Bola Tinubu, National leader of the All Progressives Congress (APC), on Sunday met with President Muhammadu Buhari.\nTinubu met with Buhari at the Presidential Villa on Sunday.\nTinubu speaking to newsmen after the meeting said the purpose of his visit was not political but to welcome Buhari from his trip to Saudi Arabia where he went for lesser hajj.\nThe former Lagos governor said he also thanked the President for visiting him in London after his medical procedure.\n“No politics involved, just a courtesy call to thank him in a big way, that’s all.”Recall that Buhari had visited Tinubu in London after a knee surgery."
  },
  {
    "headline": "Invasion of Supreme Court Justice, Mary Odili was assassination attempt – Wike",
    "summarized_story": "Governor Nyesom Wike of Rivers State, on Sunday, alleged an assassination attempt on Justice Mary Odili of the Supreme Court.\nWike alleged that the invasion of Justice Odili’s residence by security agents was actually an assassination attempt.\nThe governor disclosed that series of events have shown that the Odili family is being targeted.\n“If anything happens to my Lord, Justice Mary Odili, the husband and the children, the Federal Government should be held responsible.\n“That is the position of the Rivers State government and Rivers people because enough is enough!"
  },
  {
    "headline": "Reps committee on Judiciary calls for investigation into invasion of Justice Odili’s home",
    "summarized_story": "The House of Representatives Committee on Judiciary has condemned in totality the siege at Justice Mary Peter -Odili’s residence, describing it as a repudiation of judicial independence and an assault on the sanctity of the justice system.\nThe Committee has now called for an investigation into the incident to unravel the persons behind the act, which it said is capable of straining the existing relationship between the Judiciary and the Executive arms government.\nA press statement signed by the Chairman, House Committee on Judiciary, Onofiok Luke, maintained that the incident is a wake-up call for authorities to tighten administrative and supervisory control over the operations of law enforcement agencies in the country.\nThe committee decried that the judiciary was exposed to public ridicule due to the raid on the residence of a justice of the supreme court, allegedly following a warrant signed by a Magistrate.\n”As we already know, the judiciary harps on due process in the dispensation of justice and the House Committee on the Judiciary avows to collaborate with the judiciary and relevant stakeholders to secure the nation’s democracy.”"
  },
  {
    "headline": "Tears, sorrow as hoodlums invade Ogun community",
    "summarized_story": "Mathew’s body has been in the custody of the Ogun State Government since his death on September 27, as the government insists on keeping it until the case is determined in court.\nThe traditional ruler of Imoshe community, Chief Amusa Lawal, has also been living in fear since the three-hour invasion of the community last year.\nHe called on the Ogun State governor, Prince Dapo Abiodun, to save his community from likely attacks in the future.\nOnikogbo of Ikogbo land should stop disturbing us.”The youth leader of Imoshe community, Hon Odunoye Kolawole Rasak said the land matters between the two communities had not been settled since September 2020.\n“When the incident happened, Femi Falana called the Inspector General of Police, the IG called the CP and he mobilised his men“I was the first person to call the attention of Ogun State Government to do land grabbers law in Ogun State."
  },
  {
    "headline": "Anambra 2021: Who succeeds Obiano as governor?",
    "summarized_story": "He is a member of President Muhammadu Buhari’s Economic team and heads Anambra State Vision 2050, launched by Obiano, among others.\nHe said “tell Egbunike and others to stay away from Anambra election as Biafrans already decided there will be no movement or election in Anambra State on the 6th of November, 2021.\nYakubu said: “INEC is determined to proceed with the Anambra State governorship election, as scheduled.\n“The 2021 Anambra State governorship election is holding on November 6, 2021.\nThe IGP reassures the nation that the Force is adequately prepared for the Gubernatorial Elections in Anambra State come November 6th, 2021,” he said."
  },
  {
    "headline": "Why I’m still active at 90 — Akinola, first Lagos State Surveyor-General",
    "summarized_story": "Chief Olukunle Akinola (FRICS, FNIS), the first Surveyor-General and Coordinating Director Lands/Survey Services of Lagos State will turn 90 today.\nThey transferred me to the Survey Department in Ikeja; it was then that Lagos State was created and I opted to stay in Lagos State.\nSo I love to do survey work, I love ‘bush work’.\nFor example, I left Lagos as the First Lagos State Surveyor-General.\nWhen I left Lagos State to be on my own, I had gotten to where I wanted to get to in the profession."
  },
  {
    "headline": "FG developing local drug for cancer treatment, others",
    "summarized_story": "The Minister of Health, Dr Osagie Ehanire has disclosed that the Federal Government is earnestly developing local preventive and treatment remedies for cancer and other ailments.\nBreast cancer is the commonest cancer in women and Prostate cancer in Men.\nIn Nigeria, breast cancer is the commonest cancer followed by cervical cancer in women with estimated 26 per 100,000 population new cases occurring every year.\n- Advertisement -Speaking during the 28th Annual Live Above Poverty Organization (LAPO) Development Forum in Abuja.\n“Cancer treatment is holistic."
  },
  {
    "headline": "Gov Ortom visits Senator Kalu in Abuja",
    "summarized_story": "Governor of Benue State, Samuel Ortom, paid a courtesy visit to the Chief Whip of the Senate and former Governor of Abia State, Senator Orji Uzor Kalu, in his Aso villa residence, AbujaOn arrival, the governor was received by Kalu in company of his wife.\nAlthough a long time ally and friend, this is Ortom’s first visit to the residence of the Senate Chief Whip since he became Governor of Benue State.\nGovernor Ortom and Senator Kalu behind closed doorsDetails of the visit are yet to be disclosed as of the time of filing this report.\n100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection.\nClick here ."
  },
  {
    "headline": "BREAKING: Iyorchia Ayu emerges PDP National Chairman",
    "summarized_story": "Iyorchia Ayu, a former senate president, was early on Sunday elected as the national chairman of the Peoples Democratic Party (PDP).\nAyu, who was earlier adopted as the consensus candidate for the position, won the election unchallenged with 3,426 votes.\nTaofeek Arapaja, a former deputy governor of Oyo state, has also emerged as national deputy chairman (south), with 2,004 votes to defeat Olagunsoye Oyinlola, former governor of Osun state, who scored 705 votes.\nThe offices include national secretary, deputy national secretary, national treasurer, national financial secretary, deputy national financial secretary, national organising secretary, and deputy national organising secretary.\nOthers are national publicity secretary, deputy national publicity secretary, national auditor, deputy national auditor, national legal adviser, deputy national legal adviser, national women leader, deputy national women leader, deputy national youth leader, and national vice-chairpersons for north and south."
  },
  {
    "headline": "PDP convention: Atiku, Tambuwal, Bala Mohammed, Kwankwaso supporters showcase their presidential ambition",
    "summarized_story": "This is as the opposition party elected its national officers, most of who were returned unopposed.\nConsequently, he stated that the citizens were looking unto the opposition party to rescue the country in 2023.\nThis is a Nigeria rescue mission.\n“The 2021 National Convention, presents a starting point for the Nigeria rescue mission.\nAkinwonmi stated that there was need for the PDP leaders to put the interest of the opposition party and the country above their personal interests."
  },
  {
    "headline": "Many feared dead as military, bandits exchange gunfire in Niger",
    "summarized_story": "From John Adams, MinnaTroops of the Nigerian Army and gunmen were engaged in a heavy gunfire on Friday night at Pandogari community in Rafi Local Government area of Niger State.\nAccording to our source, the soldiers engaged the gunmen for several hours and later called for reinforcement, which promptly arrived.\nThey, however, managed to evacuate the dead and the injured ones.\n“The bandits were equally looking for a base in the state because of the military operations in Zamfara and Katsina states.\nThey have been dislodged there so they are desperately looking for a base in Niger state,” he added."
  },
  {
    "headline": "I need a crazy lover –Moyo Lawal, actress",
    "summarized_story": "By Rita OkoyeNothing scares actress and entrepreneur, Moyo Lawal, more than bringing children into the world to suffer.\nIn this interview, pretty and voluptuous Moyo Lawal opened up on her celibate years, reasons she’s still single and her need for a crazy lover.\nUSA companies need customer service reps to work from home, hourly pay in $13 per hour, must have a quiet environment to work, internet access.Click here to apply .\nWhat I don’t like is don’t come and be pretending that you are holier than thou, and don’t neglect your duties.\nDo you think with that kind of self-control, I still won’t have sense than most regular girls and even some married women?"
  },
  {
    "headline": "Buhari Departs Abuja Sunday for Climate Change Conference in Glasgow",
    "summarized_story": "To also participate in Paris peace summitBy Deji ElumoyePresident Muhammadu Buhari is expected to depart Abuja on Sunday for Glasgow, Scotland to attend the 26th Conference of Parties (COP26) to the United Nations Framework Convention on Climate Change (UNFCCC).\nPresident Buhari’s address is expected to highlight Nigeria’s key priorities and action to tackle climate change as well as progress on the country’s transition to low carbon economy, consistent with achieving the Paris Climate Agreement.\nIn Glasgow, President Buhari will participate in some side-line events hosted by US President Joe Biden and French President Emmanuel Macron.\nPresident Buhari will thereafter travel to Paris, France on an official visit to reciprocate an earlier one to Nigeria by the French President, Emmanuel Macron, and also attend the Paris Peace forum 2021, the fourth edition to be hosted by the French President.\nPresident Buhari is expected back in the country after the engagements."
  },
  {
    "headline": "News in Photographs: Tinubu Visits Buhari in State House",
    "summarized_story": "By Deji ElumoyeNational Leader of the ruling All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu on Sunday visited President Muhammadu Buhari in Abuja.\nAlthough details of the visit was not immediately known, President Buhari played host to the former Lagos State Governor at his official residence at the Presidential Villa in Abuja.\nThe President had last month visited Tinubu at his London residence and the Sunday’s visit by Asiwaju may be a way of reciprocating the President’s earlier visit.\nTinubu who arrived the President’s residence at about 10.50am and left at about 12.28pm was said to have discussed happenings in the APC and the way forward with President Buhari during the one and half hour meeting.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "ARISE NEWS Channel Holds Anambra Governorship Political Debate Tomorrow",
    "summarized_story": "•Supported by Enough-is-Enough, Nigeria•Will broadcast live in over 150 countriesBy Ejiofor AlikeARISE News Channel, in line with global standards will tomorrow host a first -of-its-kind -The ARISE NEWS Anambra Governorship Political Debate.\nSupported by Enough-is-Enough, Nigeria, the debate will be broadcast LIVE around Nigeria and the world on the ARISE NEWS Channel and the Anambra Broadcasting Service Radio and TV as well as the Ogene FM.\nAccording to a statement by the management of ARISE NEWS Channel, the programme will also be live in over 150 countries.\nDuring the debate, candidates are expected to show clearly how they understand the plight of Anambra people and to provide solutions to issues of the day, including unemployment, security, economy, education, health, infrastructure and poverty.\n“In Nigeria and Africa you can watch on DSTV Channel 416, and GoTV Channel 44."
  },
  {
    "headline": "In Plot to Retake Power in 2023, PDP Shows Strong Cohesion at National Convention",
    "summarized_story": "Ayu and Anyanwu were affirmed as national chairman and national secretary following their nomination through consensus.\nThe office of the Deputy National Chairman (South) was being contested by a former national secretary of PDP, Prince Olagunsoye Oyinlola, and a former deputy national chairman of the party in the South-west, Ambassador Taofeek Arapaja.\nTraditionally, when the national chairman emerges from the North, the presidential candidate of the party will emerge from the South and vice versa.\nThe Adawama State governor said Nigerians are yearning for the return of the party, particularly at the centre in 2023.\n“The 2021 national convention, presents a starting point for the Nigeria rescue mission,” he added."
  },
  {
    "headline": "In Ordering Investigation, FG Denies Involvement in Raid on Justice Odili’s Residence",
    "summarized_story": "Shortly after the invasion was made public, the anti-graft agency through its spokesperson, Mr. Wilson Uwujiaren, denied the involvement of its operatives in the raid.\nThe NBA president Mr. Olumide Akpata specifically described the invasion of Justice Odili’s residence as an “affront” on the judiciary.\n“The general public needs to know that there was nothing called Joint Panel Recovery under the Ministry of Justice in the Office of the Attorney General of the Federation and Minister of Justice, and by extension the entire Federal Ministry of Justice.\nIyanna had issued the search warrant on October 29, 2021, to the Joint Panel Recovery unit of the Federal Ministry of Justice to enable the panel to search Justice Peter-Odili’s home.\nOzekhome, who visited Odili’s house after the incident, said the raid could make Nigeria a laughing stock in the international community."
  },
  {
    "headline": "Again, Presidency Confirms SaharaReporters’ Story, Announces Buhari Travelling To Scotland, France",
    "summarized_story": "Two days after returning from Saudi Arabia where he attended a summit and also held prayers for Nigeria, President Muhammadu Buhari is heading for Glasgow, Scotland, as earlier exclusively reported by SaharaReporters.\n“In Glasgow, President Buhari will participate in some side-line events hosted by US President Joe Biden and French President Emmanuel Macron.\n“Baba (Buhari) is going to Saudi Arabia, France and Glasgow from Tuesday.\nThe trip will not exceed two weeks but the first stop is Saudi Arabia.\n“Buhari to visit Glasgow, Scotland, Paris, France and Dubai, UAE before the end of 2021 amidst strong rumour of third term agenda,” another source had said on Wednesday, October 6."
  },
  {
    "headline": "Again, Presidency Confirms SaharaReporters’ Story, Announces Buhari Travelling To Scotland, France",
    "summarized_story": "Two days after returning from Saudi Arabia where he attended a summit and also held prayers for Nigeria, President Muhammadu Buhari is heading for Glasgow, Scotland, as earlier exclusively reported by SaharaReporters.\n“In Glasgow, President Buhari will participate in some side-line events hosted by US President Joe Biden and French President Emmanuel Macron.\n“Baba (Buhari) is going to Saudi Arabia, France and Glasgow from Tuesday.\nThe trip will not exceed two weeks but the first stop is Saudi Arabia.\n“Buhari to visit Glasgow, Scotland, Paris, France and Dubai, UAE before the end of 2021 amidst strong rumour of third term agenda,” another source had said on Wednesday, October 6."
  },
  {
    "headline": "Again, Presidency Confirms SaharaReporters’ Story, Announces Buhari Travelling To Scotland, France",
    "summarized_story": "Two days after returning from Saudi Arabia where he attended a summit and also held prayers for Nigeria, President Muhammadu Buhari is heading for Glasgow, Scotland, as earlier exclusively reported by SaharaReporters.\n“In Glasgow, President Buhari will participate in some side-line events hosted by US President Joe Biden and French President Emmanuel Macron.\n“Baba (Buhari) is going to Saudi Arabia, France and Glasgow from Tuesday.\nThe trip will not exceed two weeks but the first stop is Saudi Arabia.\n“Buhari to visit Glasgow, Scotland, Paris, France and Dubai, UAE before the end of 2021 amidst strong rumour of third term agenda,” another source had said on Wednesday, October 6."
  },
  {
    "headline": "EXCLUSIVE: Real Reason Why Buhari Presidency Cabal Ordered Raid On Home Of Ex-Rivers Governor Odili's Wife, Justice Mary Odili",
    "summarized_story": "Less than three years after assuming office as the Chief Justice of Nigeria (CJN), Tanko Ibrahim Muhammad may be removed.\nIt was also learnt that the plot to remove Muhammad and harass Justice Odili or also remove her, if necessary, is gathering steam by the day, sources told SaharaReporters.\nJustice Odili, a Supreme Court judge, is being haunted to ensure she does not replace Muhammad when he is removed, as the one who is next in line to the Chief Justice.\nSaharaReporters gathered that the recent illegal raid of the Abuja residence of Justice Odili of the Supreme Court is connected with the plot to remove Muhammad.\nSee Also Legal Security Operatives Raid Supreme Court Judge, Odili’s Residence In AbujaSecurity operatives had on Friday night invaded the house of the Supreme Court Justice based on information that “illegal activities” were going on there."
  },
  {
    "headline": "EXCLUSIVE: Real Reason Why Buhari Presidency Cabal Ordered Raid On Home Of Ex-Rivers Governor Odili's Wife, Justice Mary Odili",
    "summarized_story": "Less than three years after assuming office as the Chief Justice of Nigeria (CJN), Tanko Ibrahim Muhammad may be removed.\nIt was also learnt that the plot to remove Muhammad and harass Justice Odili or also remove her, if necessary, is gathering steam by the day, sources told SaharaReporters.\nJustice Odili, a Supreme Court judge, is being haunted to ensure she does not replace Muhammad when he is removed, as the one who is next in line to the Chief Justice.\nSaharaReporters gathered that the recent illegal raid of the Abuja residence of Justice Odili of the Supreme Court is connected with the plot to remove Muhammad.\nSee Also Legal Security Operatives Raid Supreme Court Judge, Odili’s Residence In AbujaSecurity operatives had on Friday night invaded the house of the Supreme Court Justice based on information that “illegal activities” were going on there."
  },
  {
    "headline": "Worshippers abducted, two killed as gunmen attack Kaduna Baptist church",
    "summarized_story": "Gunmen suspected to be bandits have killed two worshippers at Baptist Church, Kakau Daji, Chikun LGA of Kaduna state.\nA yet to be ascertained number of worshippers were also abducted from the church.\nAdvertisementIshaya Jangado, president of the Kaduna Baptist Convention, confirmed the attack to TheCable.\nMohammad Jalige, spokesman of the Kaduna state police command, was not reachable for comment over the incident.\nThe attack on the church comes months after suspected bandits invaded the Bethel Baptist High School in Damishi, Kaduna, abducting 121 students."
  },
  {
    "headline": "Worshippers abducted, two killed as gunmen attack Kaduna Baptist church",
    "summarized_story": "Gunmen suspected to be bandits have killed two worshippers at Baptist Church, Kakau Daji, Chikun LGA of Kaduna state.\nA yet to be ascertained number of worshippers were also abducted from the church.\nAdvertisementIshaya Jangado, president of the Kaduna Baptist Convention, confirmed the attack to TheCable.\nMohammad Jalige, spokesman of the Kaduna state police command, was not reachable for comment over the incident.\nThe attack on the church comes months after suspected bandits invaded the Bethel Baptist High School in Damishi, Kaduna, abducting 121 students."
  },
  {
    "headline": "'No politics' -- Tinubu speaks on meeting with Buhari",
    "summarized_story": "Bola Tinubu, chieftain of the All Progressives Congress (APC), says politics was not on the agenda during his meeting with President Muhammadu Buhari.\nTinubu said the purpose of his visit was to welcome the president back from his trip to Saudi Arabia where he went for lesser hajj.\nSo that’s what I came for and to welcome him back from the trip from Saudi,” Tinubu said after the meeting.\nWhile in the UK, President Buhari had paid a visit to Tinubu.\nAlthough Tinubu is yet to officially declare his ambition for the 2023 presidential election, several campaign initiatives have been launched in his name."
  },
  {
    "headline": "'No politics' -- Tinubu speaks on meeting with Buhari",
    "summarized_story": "Bola Tinubu, chieftain of the All Progressives Congress (APC), says politics was not on the agenda during his meeting with President Muhammadu Buhari.\nTinubu said the purpose of his visit was to welcome the president back from his trip to Saudi Arabia where he went for lesser hajj.\nSo that’s what I came for and to welcome him back from the trip from Saudi,” Tinubu said after the meeting.\nWhile in the UK, President Buhari had paid a visit to Tinubu.\nAlthough Tinubu is yet to officially declare his ambition for the 2023 presidential election, several campaign initiatives have been launched in his name."
  },
  {
    "headline": "Odili's home invasion: Malami's denial unsatisfactory, says Wike",
    "summarized_story": "Nyesom Wike, governor of Rivers, has issued a 48-hour ultimatum for the federal government to prosecute the masterminds behind the invasion of Mary Odili’s residence.\nAdvertisementSecurity operatives had on Friday night invaded the house of the supreme court justice based on information that “illegal activities” were going on there.\nSpeaking during a press conference in Abuja, on Sunday, Wike described Malami’s denial as unsatisfactory.\n“The governor noted that though the Attorney General of the Federation and Minister of Justice had denied involvement in the siege on Justice Odili’s residence, the people of Rivers State consider his mere denial as unsatisfactory.\nWike visited Odili’s home a few minutes after the security operatives stormed the residence."
  },
  {
    "headline": "Facebook changes company name to Meta, reflecting its ambitions beyond social media",
    "summarized_story": "Facebook on Thursday, October 28 announced that it has changed its company name to Meta.\nThis change of name was announced by Facebook CEO Mark Zuckerberg at Facebook’s annual Connect augmented and virtual reality conference.\nThe company said it chose the name “Meta” to serve as a reminder that there is always more to build.\nFacebook said its corporate structure is not changing, however, how the company reports its financials will.\nIn addition, Facebook assured users that the announcement does not affect how the company uses or shares data."
  },
  {
    "headline": "Beyond investing in African startups, Kepple Africa Ventures is creating new industries",
    "summarized_story": "Afterwards, he returned to Africa as a general partner at Kepple Africa Ventures.\nI knew I had to be a part of it.”Daniel Adeyemi: How did Kepple Africa Ventures start?\nThis provided Kepple with access to a network of investors to raise $18 million for Kepple Africa Ventures.\nRyosuke Yamawaki handles investing in East and Southern African startups while I focus on investing in West and North African startups.\nDA: Talking about Japanese investors, are there any other Japanese investors in Africa?"
  },
  {
    "headline": "eNaira: How to use Nigeria’s central bank digital currency",
    "summarized_story": "Nigeria became the first country in Africa to launch a central bank digital currency (CBDC) this week after President Muhammadu Buhari unveiled the eNaira at the State House in Abuja, the nation’s capital.\nIssued by the Central Bank of Nigeria (CBN), the digital currency is built on a private blockchain technology developed by Bitt Inc and has the same value as the fiat or physical currency.\nThe new currency can be accessed and used via the eNaira wallet (named “Speed”), a digital storage held and managed on a distributed ledger.\neNaira use casesFinancial institutions are responsible for onboarding their customers and integrating the eNaira wallet feature into their digital banking channels.\nThe digital currency could also bring a significant majority of Nigerians without bank accounts into the formal financial economy."
  },
  {
    "headline": "Frustration grows as lack of jobs rack Nigerians",
    "summarized_story": "Nigeria’s unemployment crisis, the worst since the country’s transition to democracy in 1999, is unrelenting and waging a continuous war on the people.\nRead Also: How age as job criterion worsens Nigeria’s unemployment crisisThe economic situation has not improved much since then.\nWhat must be doneProviding enough productive jobs for Nigeria’s young and growing population presents a particular challenge, especially at a time of weak economic growth.\nThis means that the labour market is “the primary vehicle through which the proceeds of economic growth are spread to households and individuals.\nEconomic growth without transformation is much less effective."
  },
  {
    "headline": "Frustration grows as lack of jobs rack Nigerians",
    "summarized_story": "Nigeria’s unemployment crisis, the worst since the country’s transition to democracy in 1999, is unrelenting and waging a continuous war on the people.\nRead Also: How age as job criterion worsens Nigeria’s unemployment crisisThe economic situation has not improved much since then.\nWhat must be doneProviding enough productive jobs for Nigeria’s young and growing population presents a particular challenge, especially at a time of weak economic growth.\nThis means that the labour market is “the primary vehicle through which the proceeds of economic growth are spread to households and individuals.\nEconomic growth without transformation is much less effective."
  },
  {
    "headline": "Eagle Square agog as party leaders, delegates converge for PDP National Convention",
    "summarized_story": "Eagle Square is currently agog as party leaders and delegates gather to elect new members of the National Working Committee (NWC) of the People’s Democratic Party (PDP) that will pilot the affairs of the party for the next four years.\nUncertainty had trailed the convention as the suspended national chairman of the party, Uche Secondus dragged the party to court in a bid to stop the convention.\nHe also sought an order of injunction restraining the PDP from holding its national convention scheduled for October 30th and 31st.\nReacting to the Appeal Court ruling, Secondus said he respects the position of the court even though he disagrees totally with it.\nChairman of the National Convention Organising Committee (NCOC), Ahmadu Fintiri disclosed on Friday while briefing journalists ahead of the national convention that 3600 delegates would file out this weekend to elect new officers of the party."
  },
  {
    "headline": "World Stroke Day: Obaseki urges residents to take advantage of health insurance to check menace – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has urged residents in the state to take advantage of the state government’s Health Insurance Scheme to prevent the risks of stroke.\nThe governor said this in commemoration of the World Stroke Day marked by the World Stroke Foundation.\nThe governor added, “It is important for stakeholders to sustain enlightenment campaigns that encourage people to adopt health behaviours that limit the risk of stroke.\nAccording to the World Stroke Foundation, “When somebody has a stroke, every second that goes by is crucial.\nAs brain tissue and millions of neurons begin to fade away, time could not be more precious.”..."
  },
  {
    "headline": "PUWOV arrests illegal revenue collector, as govt warns against street trading – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOfficials of the Edo State Public Works Volunteers (PUWOV) have arrested an alleged illegal revenue collector extorting motorists along Oba Market Road, in Benin City.\nIn a statement, the State Commander, PUWOV, Mukhtar Yusuf-Osagie, said after receiving several complaints of the unlawful acts in the recent weeks, PUWOV officials were deployed to effect the arrest.\nAccording to him, “we received a distress call from a concerned Edo citizen, which led to the discovery and arrest of one Oghomen Osagie, an illegal revenue collector, who specialised in extorting motorists.”He urged members of the public to report any individual or group suspected in such illegal acts, noting, “We are urging members of the public to report any suspicious act of criminality.”On the incidence of street trading, he said, “As part of measure to curtail unnecessary gridlock usually caused by traders displaying wares on the road and walkways, our officials were at Egor Market and environs to sensitize traders and motorists to desist from all unlawful act of street trading and reckless parking as the traders took to trading on the road.\n“The traders were given a 7-day notice to evacuate all tables and makeshift shops from the road and walkway as the State Government has directed the Clean Up of the area, referencing a petition from the Nigerian Postal Institute, at Egor.\n“Officials of PUWOV have restored sanity to Egor Market and environs as all makeshift shops and tables have been evacuated from the road and moved inside the main market.”He added, “Motorists and other road users can now get free access to their destination via Egor Market without any form of harassment from street traders.”..."
  },
  {
    "headline": "Edo restores 218 hectares of forest land to boost green economy – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestIn furtherance of efforts to boost the state’s green economy, Edo State Governor, Mr. Godwin Obaseki, has said his administration has restored 218 hectares of forest land across the state.\nAddressing participants at the Wood Expo 2021, in Abuja, the governor said part of the state’s strategy on reforestation include replanting of the degraded forest compartments of 256 hectares each in four zones across the state.\nThis shows our readiness for investments in this sector.\n“We urge manufacturers, investors and other interest groups to come to Edo State and tap from the numerous investment opportunities that abound.\nShe added that the Benin River Port project will help in decongesting the Apapa Port in Lagos, noting that the strategic location of Edo State as a gateway to all states in the six geo-political zones in Nigeria, is advantageous."
  },
  {
    "headline": "UNSCR 1325: Edo State Commences Development of Action Plan for the Inclusion of Women in Peacebuilding – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City: In a bid to getting women involve in peacebuilding and security issues in Edo State, a 3- day workshop geared towards the development of the state action plan has been held in Benin.\nParticipants at the workshop are members of the Technical Steering Committee on United Nations Security Council Resolution (UNSCR) 1325.\nSpeaking, WANEP’s Head of Programs- Patience Ikpeh Obaulo, said the objectives of the workshop were to develop Edo State Action Plan in line with UNSCR 1325 and the Nigeria Action Plan (NAP), and to ascertain the cost of the state action plan and promote systematic coordination and accountability in implementation of the state action plan.\nAs part of the program the draft SAP on UNSCR 1325 was develop by members of the Technical Steering Committee.\nAs part of the program the draft SAP on UNSCR 1325 was develop by members of the Technical Steering Committee ."
  },
  {
    "headline": "Reps panel demands investigation into invasion of Mary Odili’s home",
    "summarized_story": "The House of Representatives Committee on Judiciary has called for an investigation into the raid on the home of Mary Odili, a justice of the Supreme Court.\nThe court’s orders followed a suit that was instituted by Mr Odili against the Nigeria Immigration Service (NIS) for impounding his international passport upon his return to Nigeria from the United Kingdom in June this year.\nThe Nigerian Bar Association (NBA) had also condemned the raid on the jurist’s house and called for probe.\nMr Onofiok said the raid further exposed the judiciary to public opprobrium due to the manner the search warrant was procured.\nMrs Odili is currently the second most senior Justice of the Supreme Court and she is due to retire in 2022."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Zenith Bank grows earnings to N519bn in Q3 2021",
    "summarized_story": "OBINNA EZUGWUNigeria’s leading lender, Zenith Bank Plc has announced its unaudited results for the nine months ended 30 September 2021, with Gross Earnings rising by 2% from NGN509 billion recorded in the same period in 2020 to NGN519 billion.\nProfit Before Tax (PBT) also rose to NGN180 billion, reflecting a 1% growth over the NGN177 billion recorded in the same period in the previous year.\nThis resulted in the growth in net interest income of 4%, from NGN225 billion recorded at the end of Q3 2020 to NGN235 billion in the current period.\nIn recognition of its track record of excellent performance, Zenith Bank was voted as Best Commercial Bank in Nigeria in the World Finance Banking Awards 2021, Bank of the Year (Nigeria) in The Banker’s Bank of the Year Awards 2020, Best Bank in Nigeria in the Global Finance World’s Best Banks Awards 2020 and 2021, and Best in Corporate Governance ‘Financial Services’ Africa 2020 and 2021 by the Ethical Boardroom.\nFor over three decades, Zenith Bank has distinguished itself in the Nigerian financial services industry through superior service offerings, unique customer experience, and sound economic indices."
  },
  {
    "headline": "FirstBank reinforces support for Georgian Cup tourney, sponsors 102nd edition in Kaduna",
    "summarized_story": "First Bank of Nigeria Limited, the title sponsor of one of polo’s most prestigious trophy, the Georgian Cup is grabbing all the headlines and attention as the 102nd edition of the competition gets underway in Kaduna.\nExpectedly, this year’s edition of the famous Georgian Cup is generating lots of excitement within Kaduna and beyond as combatants storm Kaduna is quest for honour and fame on the turf.\nFirstBank has since maintained the sponsorship of the prestigious cup since 1919 and has remained a key support to the Kaduna Polo Club.\nThe Georgian Cup, donated by FirstBank in 1918 is the oldest and most respected Polo trophy in West Africa.\nThe Kaduna Polo Club was founded in 1918 by the British Army and is one of the most prestigious clubs in Nigeria."
  },
  {
    "headline": "Intrigues, power play at the PDP national convention as Iyorchia Ayu emerges national chairman",
    "summarized_story": "Olusesan LaoyeThe Peoples Democratic Party (PDP)’s convention Saturday after some delay and power play which prompted stakeholders to adopt consensus arrangements, to pick candidates for the next national executive of the party.\nThe convention was a show of intrigues and power play, which saw the governors in the party coming up as a strong team against the elders who have been calling the shots in the past.\nObvious from the outcome of the convention, is that governors now have total cotroll of the party.\nThey were the choice of Deputy National Chairman South and that of the North.\nMany of the positions, including the chairmanship, won by Dr Iyorchia Ayu, were filled by consensus."
  },
  {
    "headline": "2023: Anyim declares intention to contest for president",
    "summarized_story": "Nigeria’s former senate president, Anyim Pius Anyim has declared interest for contest for president under the country’s main opposition party, the People’s Democratic Party (PDP) in 2023.\nAnyim who made the disclosure on Saturday in an interview with journalists, said that the party was being repositioned to take power in 2023.\nAnyim noted that the party’s national convention would signal the commencement of its political activities.\nWe currently have less than 18 months to the next elections, and I feel the time is ripe to indicate my interest,” Anyim said.\n“Zoning of such positions was deferred but nothing stops anyone from South-East Zone from contesting the presidency even if it is not zoned to it,” he said."
  },
  {
    "headline": "Wike Condemns Invasion Of Mary Odili’s House",
    "summarized_story": "Governor Nyesom Wike of Rivers State has condemned security agent’s invasion of the Abuja house of Justice Mary Odili of the Supreme Court, describing the incident as an assassination attempt.\nHe said the federal government would be held responsible if anything happens to the family of Odili.\nAt a press conference with Rivers State Leaders of Thought in Abuja, yesterday, Wike said the series of events had shown that the Odili family was being targeted.\n“If anything happens to my Lord, Justice Mary Odili, the husband and the children, the federal government should be held responsible.\nThat is the position of the Rivers State government and Rivers people because enough is enough!"
  },
  {
    "headline": "Wike Condemns Invasion Of Mary Odili’s House",
    "summarized_story": "Governor Nyesom Wike of Rivers State has condemned security agent’s invasion of the Abuja house of Justice Mary Odili of the Supreme Court, describing the incident as an assassination attempt.\nHe said the federal government would be held responsible if anything happens to the family of Odili.\nAt a press conference with Rivers State Leaders of Thought in Abuja, yesterday, Wike said the series of events had shown that the Odili family was being targeted.\n“If anything happens to my Lord, Justice Mary Odili, the husband and the children, the federal government should be held responsible.\nThat is the position of the Rivers State government and Rivers people because enough is enough!"
  },
  {
    "headline": "6 Days To Anambra Poll, Residents Flee Over Rising Insecurity",
    "summarized_story": "A mass exodus of residents has hit Anambra State following the increasing level of violence ahead of the governorship election coming up in the state on Saturday.\nFrom Abuja, Nigeria Police Force assured the people of Anambra State that the police were prepared to safeguard the citizens of the state before, during and after the elections.\nThe statement reads in part: “We, the South East Council of Traditional Rulers and the Representatives of Igbo Archbishops and Bishops, note with deep concern the high level of insecurity and socio-economic disruption in the South East Zone of Nigeria.\nThis is just as they called on the candidates in the forthcoming Anambra State governorship election to eschew violence and commit to free, fair and credible election.\nShe urged election stakeholders to continue to show determination to ensure credible and peaceful conduct of the election."
  },
  {
    "headline": "6 Days To Anambra Poll, Residents Flee Over Rising Insecurity",
    "summarized_story": "A mass exodus of residents has hit Anambra State following the increasing level of violence ahead of the governorship election coming up in the state on Saturday.\nFrom Abuja, Nigeria Police Force assured the people of Anambra State that the police were prepared to safeguard the citizens of the state before, during and after the elections.\nThe statement reads in part: “We, the South East Council of Traditional Rulers and the Representatives of Igbo Archbishops and Bishops, note with deep concern the high level of insecurity and socio-economic disruption in the South East Zone of Nigeria.\nThis is just as they called on the candidates in the forthcoming Anambra State governorship election to eschew violence and commit to free, fair and credible election.\nShe urged election stakeholders to continue to show determination to ensure credible and peaceful conduct of the election."
  },
  {
    "headline": "Irabor Wants Voluntary Retirement For 19 ‘Victimised’ Generals",
    "summarized_story": "Among those sacked “arbitrarily” by the Nigerian Army authorities in 2016 were nine major generals, 10 brigadier generals, colonels and a major.\nADVERTISEMENT“It is in view of the foregoing, and to lay the matter to rest, this appeal is recommending that the 38 NA senior officers be voluntarily retired with effect from January 1, 2018.”The affected officers are Maj Gen MY Ibrahim, Maj Gen SD Aliyu, Maj Gen FO Alli, Maj Gen IN Ijioma, Maj Gen Ejemai, Maj Gen LC Ilo, Maj Gen Ude, Maj Gen EJ Atewe and Maj Gen LI Wiwa.\nThe Brigadier Generals are Brig Gen LM Bello, Brig Gen ASH Saad, Brig Gen Mormoni-Bashir, Brig Gen DM Onoyvieta, Brig Gen B Fibuonuma, Brig Gen Koko-Essien, Brig Gen IM Lawson, Brig Gen AI Onibasa, Brig Gen D Abdulsalam and Brig Gen Aghachi.\nThe Colonels are Col DR Hassan, Col MA Suleiman, Col FD Kayode, Col TT Minimah, Col FE Ekpenyong, Col OU Nwankwo and Col CK Ukoha.\nThe Lieutenant Colonels are Lt Col TO Oladuntoye, Lt Col CO Amadi, Lt Col OA Baba-Ochankpa, Lt Col E Egemole, Lt Col KO Adimoha, Lt Col DB Dazang, Lt Col T Arigbe, Lt Col Enemchukwu, Lt Col GC Nyekwu, Lt Col A Mohammed, Lt Col AS Mohammed and Major TA Williams."
  },
  {
    "headline": "Hushpuppi: Abba Kyari still under investigation – PSC, Mba",
    "summarized_story": "The embattled Commander of the Intelligence Response Team (IRT), Abba Kyari, who has been on suspension since July 31, following his indictment by the Federal Bureau of Investigation (FBI) has not been reinstated, the Police Service Commission (PSC) said on Sunday.\nA member of the PSC, Mr. Austine Braimoh, told The Nation that Kyari is still under investigation.\nReacting to the development, the Force Public Relations Officer, Frank Mba also said the IGP cannot unilaterally effect the reinstatement of Kyari.\nHis words: “The powers to exercise disciplinary control over officers of the cadres of Abba Kiyari is exclusive and statutory responsibility of the Police Service Commission (PSC), and all enquiries on the issues of reinstatement should be directed to PSC”.\nKyari had been under investigation for allegedly fraternising with a suspected Internet fraudster, Abbas Ramon, commonly known as Hushpuppi."
  },
  {
    "headline": "Hushpuppi: Abba Kyari still under investigation – PSC, Mba",
    "summarized_story": "The embattled Commander of the Intelligence Response Team (IRT), Abba Kyari, who has been on suspension since July 31, following his indictment by the Federal Bureau of Investigation (FBI) has not been reinstated, the Police Service Commission (PSC) said on Sunday.\nA member of the PSC, Mr. Austine Braimoh, told The Nation that Kyari is still under investigation.\nReacting to the development, the Force Public Relations Officer, Frank Mba also said the IGP cannot unilaterally effect the reinstatement of Kyari.\nHis words: “The powers to exercise disciplinary control over officers of the cadres of Abba Kiyari is exclusive and statutory responsibility of the Police Service Commission (PSC), and all enquiries on the issues of reinstatement should be directed to PSC”.\nKyari had been under investigation for allegedly fraternising with a suspected Internet fraudster, Abbas Ramon, commonly known as Hushpuppi."
  },
  {
    "headline": "Botched Anambra Airport flight: Air Peace to refund fares to intended passengers",
    "summarized_story": "Air Peace airline is to refund fares to passengers who paid for a special flight arranged by the airline for the official opening of the newly constructed Anambra International Cargo and Passengers Airport, Umueri, Anambra State.\nThis is due to the federal government directive that the official opening of the newly constructed airport to commercial flights should be postponed due to security reasons.\nMeanwhile, the Governor of Anambra State on Saturday declared the airport “opened”.\nAccording to the state Governor, Willie Obiano, the approval of NCAA to open the facility for operations on October 21 had been sought “and given”.\nMeanwhile, the State Governor, Willie Obiano on Saturday “declared the airport opened”."
  },
  {
    "headline": "Botched Anambra Airport flight: Air Peace to refund fares to intended passengers",
    "summarized_story": "Air Peace airline is to refund fares to passengers who paid for a special flight arranged by the airline for the official opening of the newly constructed Anambra International Cargo and Passengers Airport, Umueri, Anambra State.\nThis is due to the federal government directive that the official opening of the newly constructed airport to commercial flights should be postponed due to security reasons.\nMeanwhile, the Governor of Anambra State on Saturday declared the airport “opened”.\nAccording to the state Governor, Willie Obiano, the approval of NCAA to open the facility for operations on October 21 had been sought “and given”.\nMeanwhile, the State Governor, Willie Obiano on Saturday “declared the airport opened”."
  },
  {
    "headline": "Troops bomb Boko Haram's hideout in Sambisa, kill 37 terrorists",
    "summarized_story": "The Joint troops of Operation HADIN KAI (OPHK) have bombed Boko Haram’s enclave in Sambisa Forest, killing 37 terrorists and destroying gun trucks.\nOver 50 Boko Haram/ ISWAP fighters were observed to have gathered at the meeting.\n“Having clearly identified the terrorists’ hideout, the Air Component of OPHK immediately dispatched two aircrafts to conduct air interdiction on the location.\nNwachukwu added that in another development, as the aircrafts retreated to base after the air interdiction, the combat air crew located another set of four Gun Trucks about six kilometres South West of Bama.\nHe said the air crew immediately relayed the coordinates of the location of the Gun Trucks to troops of the Land Component at Bama, who promptly engaged the location with artillery fire bombardment, neutralizing the insurgents’ gun trucks."
  },
  {
    "headline": "COVID-19 scare in White House as press secretary Psaki isolates",
    "summarized_story": "There are concerns for U.S. President Joe Biden after the press secretary Jen Psaki tested positive for COVID-19 on Sunday.\nBiden tested negative for COVID-19 on Saturday, said a person familiar with the matter.\n“I am disclosing today’s positive test out of an abundance of transparency,” Psaki said.\nThe White House has been struggling to get the pandemic under control, with millions of Americans declining to take life-saving vaccines.\nThe White House has declined to disclose the number of breakthrough COVID-19 infections that have occurred among staff."
  },
  {
    "headline": "Six Months After Afenifere Spokesman Odumakin’s Death, Wife Gives Birth To Twins",
    "summarized_story": "Almost seven months after Yinka Odumakin’s death, his wife, Dr Joe Okei-Odumakin, gave birth to twins — a boy and a girl – in a hospital in the United States of America on Wednesday.\nHer late husband had left the names he intended for the babies, according to Okei-statement.\nOdumakin’sThe statement read in part, “He had, however, prophetically left words concerning what the baby or babies should be called if his wishes materialised.\nThe girl was named after Joe, while the boy was named Abraham after the late Afenifere leader, Pa Abraham Adesanya.\nHowever, the twins are coming 18 years after the birth of their last child."
  },
  {
    "headline": "BREAKING: Tinubu Visits Buhari At Aso Rock",
    "summarized_story": "The All Progressives Congress (APC) national leader, Asiwaju Bola Ahmed Tinubu has just paid President Muhammadu Buhari a visit in Aso Rock, the nations capital.\nIn the pictures obtained by NewsDirect, Buhari and Tinubu could be seen clearly greeting themselves and then after after a chat while on the couch in the government house.\nIn a brief statement by Tinubu, he noted that he came to thank the president paying him a visit while he was in London.\n“I came to thank President Muhammadu Buhari for visiting me in London when I had a knee surgery.\nNeither Tinubu nor Osinbajo has publicly declared interest in the race but there are indications that they are interested in succeeding Buhari."
  },
  {
    "headline": "SERAP Sues Buhari Over Missing N881bn In 367 MDAs",
    "summarized_story": "The Socio-Economic Rights and Accountability Project has sued President Muhammadu Buhari (retd.)\nfor failing to investigate charges that over $880 billion in public monies had gone missing from 367 ministries, divisions, and organizations.\n“President Buhari has a constitutional duty to ensure the investigation and prosecution of allegations of corruption, as well as recovery of any missing public funds.\nSection 15[5] of the 1999 Nigerian Constitution [as amended], requires the Buhari administration to abolish all corrupt practices and abuse of power.”SERAP added that the missing funds have hindered the ability of the MDAs to meet the needs of the citizens.\nSpending public funds without appropriation will create opportunities for corruption."
  },
  {
    "headline": "Most Corrupt Party, APC Was Never Prepared To Lead Nigeria – Atiku Abubakar.",
    "summarized_story": "Former Vice President Atiku Abubakar has stated that the current All Progressives Congress (APC) was never prepared to manage the country when it came to power in 2015.\nThe Peoples Democratic Party’s (PDP) flag bearer for the 2019 general elections stated this on Saturday during the party’s national convention in Abuja.\nAccording to Atiku, the responsibility of restoring the glory of Nigeria is bestowed on the PDP, adding that the victory of the party is the victory of Nigerians.\nThey have shown themselves to be corrupt, in fact, the most corrupt, sectional and divisive party that was never prepared to lead this country.\nIf we had the idea of what it took to lead a diverse, multiethnic and multi-religious country like Nigeria."
  },
  {
    "headline": "PDP National Chairman-elect Ayu: Our party’s successful convention, quit notice to APC",
    "summarized_story": "National Chairman-Elect of the Peoples Democratic Party (PDP) Dr Iyorchia Ayu has thrown a challenge to the All Progressives Congress (APC).\nAyu stated this in the early hours of Sunday after he was declared winner at the party’s Special National Convention held at the Eagle Square, Abuja.\nHe said: “Indeed, the PDP, through the National Convention, has, once again, demonstrated its firm believe in participatory democracy.\nHis contesting for the same post lends more credibility to the PDP National Convention.\n“Take the power sector for instance where the contract agreement between Federal Government and DisCos and GenCos are in favour of the private companies."
  },
  {
    "headline": "Troops foil 100-man bandit attack on Niger community",
    "summarized_story": "Troops over the weekend foiled a coordinated attack by bandits on Pandogari town in Rafi local government area of Niger state.\nBlueprint learnt that not less than 100 heavily armed men riding on motorcycles stormed the town from Zamfara state with the intention of killing and kidnapping members of the community, in addition to rustling their cattle.\nWitness accounts said the bandits first launched attack on the military base in Pandogari town but met stiff opposition from soldiers who engaged them in fierce battle.\nIt was gathered that the action of the soldiers stopped the gunmen from gaining access into Pandogari town where they would have wrecked havoc.\nHe simply said: “What the security men did was to repel the attack.”"
  },
  {
    "headline": "Boosting SMEs growth through FirstSME Account",
    "summarized_story": "First Bank of Nigeria Limited, the nation’s most valuable bank brand, has over the years shown commitment towards the success and growth of SMEs business in Nigeria.\nFirstSME AccountThe First Bank’s leading SME Initiative-FirstSME account- was specifically created on August 2020, to support SMEs towards the sustenance and expansion of their businesses.\nApart from supporting SMEs, FirstSME account is also available to all non-individual entities like Limited liability Companies, Public sector institutions, Enterprises/Sole proprietorships, Partnerships & Associations, Religious Bodies, Traders NGOs.\nBenefits to customersFirstSME account has been beneficial to a lot of companies, especially SMEs, in terms enhancing the capacity to sustain growth.\nImpacts beneficiaries/economyThe First Bank FirstSME account will go a long way to reducing cost of operating corporate account which frees up funds for the beneficiaries to grow their businesses faster."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "Kalu urges FG to probe invasion of Justice Odili’s residence by police -NigPilot",
    "summarized_story": "Chief Whip of the Senate, Senator Orji Uzor Kalu has called on the federal government to commence a full-scale investigation into the invasion of the Abuja residence of a Justice of the Supreme Court, JSC, Mary Odili by men of the Nigeria Police.\nSenator Kalu specifically called on the federal government to bring the perpetrators of the evil act to book, adding that unlawful invasion of a citizen’s residence is against the constitution of Nigeria and tenets of democracy.\nHe said: “The invasion of the residence of Justice Mary Odili of the Supreme Court in a gestapo manner is totally condemnable and unacceptable in a democratic dispensation.\n“The country’s democracy is gradually growing and as such, acts that are not in tandem with the constitution of Nigeria and democratic process must not tolerated.\nKalu called on the federal government and the citizenry to embrace the tenets of democracy in all pursuits, adding that no country can progress in an atmosphere of lawlessness.”"
  },
  {
    "headline": "The Birth of a new economic dawn -NigPilot",
    "summarized_story": "Olamilekan Adegbite in his keynote address said the launch of the Nigerian Barite was a culmination of several efforts and collaboration with critical stakeholders in the sector.\nOthers he mentioned were; Job creation along the Barite value chain and Local Content promotion in line with federal government policy.\nAdegbite added that the launch of Nigerian Barite was poised to save the country millions of dollars spent importing barite.\nHe disclosed that an open market place Portal that would connect all stakeholders along the Barite value chain would soon be commissioned.\nHe said the launch of Nigerian Barite is an attestation that the Ministry’s investment in exploration activities and capacity building targeted at sustainable production of Nigerian processed Barite has finally paid off."
  },
  {
    "headline": "2023: Utomi, Jega, Agbakoba to launch ‘Third Force’ mega party in Nov – Yunusa -NigPilot",
    "summarized_story": "Top political gladiators in the country are set to launch an alternative mega party in November to challenge the ruling All Progressives Congress, APC, and the major opposition, Peoples Democratic Party, PDP, in the 2023 general elections.\noised to deliver Nigeria from her present crises of collapse foisted by failed political leadership and system.\nThese leaders of conscience who are under the auspices of the National Consultative Front, NCFront , said they are pIn a press statement released Friday by the Head , Public Affairs Bureau of NCFront, Dr Tanko Yunusa, the group said apart from the major political parties, which are set to work together to form the nucleus of the new credible alternative platform, the process should also seeks to explore electoral alliance with other political parties with similar ideological values, in building a major groundswell of formidable solidarity for the new Mega Party.\nDr. Yunusa noted that the National Secretariat of the NCFront has already mobilised relevant stakeholders to work out the modalities of ensuring equal benefits and responsibilities for partners and stakeholders fusing into the new alternative political platform.\nHe said, “However, the latest people’s centred working together is being facilitated by the leadership of the NCFront is being built on the three layers of key like minded Ideological political parties, which are to form the nucleus of the ‘Third Force’ Mega Party, other political parties, who are interested in undertaking electoral alliance with the nucleus of the New Mega Party and finally political associations, interest and stakeholders’ Groups and civil society leaders and allies who are committed to fuse into the the grand political coalition in bringing about a credible alternative mass political platform to save Nigeria from the disastrous grip of failed political leadership and the heightening constitutional crisis and agitations rocking the country, which are currently doing great damage to the economic prosperity of Nigerians."
  },
  {
    "headline": "Alleged EFCC invasion of Justice Mary Odili’s private residence barbaric, reprehensible – CUPP",
    "summarized_story": "The Coalition of United Political Parties, CUPP, has condemned in strong terms, the alleged invasion of the private residence of a renowned Justice of the Supreme Court of Nigeria, Justice Mary Odili, by officers suspected to be operatives of the Economic and Financial Crimes Commission, EFCC, working in collaboration with Officers and men of the Nigeria Police Force, describing it as unjustified and Illegal.\nThough the EFCC, through its Chairman, Abdulrasheed Bawa, has denied any involvement of the anti-graft agency in the operation, the CUPP asserted that Intimidation and harassment of Judicial Officers by the administration of President Muhammadu Buhari led APC Government is an act of terror.\n“As long as we profess to be be in a democracy, it is incumbent on all elected and appointed Officials to act within the confines of the Law.\n“With the worsening security and economic situations in Nigeria occasioned by unprecedented ineptitude on the part of Mohamadu Buhari led APC Government, it has become clear that the current administration has wilfully and consciously chosen to derail our nascent democracy and lead Nigeria to a part of no return.\n“We therefore demand an immediate withdrawal of security operatives from the private residence of Justice Mary Odili and an unreserved apology from the Nigerian government in this regards and further call on all Nigerians to stand up and defend our democracy which this administration is bent on derailing.”"
  },
  {
    "headline": "Channels Television Wins TV Station Of The Year For The 14th Time",
    "summarized_story": "﻿Channels Television has won the Nigerian Media Merit Award (NMMA) for Best Television Station of the Year for the 14th time.\nExtending its record in the category, the award-winning station claimed the prize on Sunday morning at an event held in Lokoja, the Kogi State capital.\nChannels Television’s Controller of Programmes, Mr Ambrose Okoh, and some senior staff members received the award on behalf of the organisation.\nThe award for Best TV Station, which recognises media excellence in the country, is one of the numerous recognitions Channels Television has received in Nigeria and globally for its programming, with an audience of over 20 million people within and outside the country.\nPrior to the award bagged on Saturday, Channels Television last won the Best Station of the Year for 2018."
  },
  {
    "headline": "Wike Gives FG 48-Hour Ultimatum To Probe Raid On Justice Odili’s Residence",
    "summarized_story": "﻿Rivers State Governor, Nyesom Wike has issued a 48-hour ultimatum to the Federal Government to probe the invasion of the residence of Justice Mary Odili.\nSecurity agents had on Friday raided the home of the Supreme Court, but Wike asked the current administration to bring to book those behind the invasion.\n“We think that there is an attempt to assassinate Justice Mary Odili, the husband and members of the family, there are no two ways about it.\n“The issue here has nothing to do with the Attorney General, we are happy he said he is not aware.\n“If anything happens to my Lord, Justice Mary Odili, the husband and the children, the Federal Government should be held responsible."
  },
  {
    "headline": "UPDATED: Iyorchia Ayu Emerges PDP Chairman As Party Gets New National Officials",
    "summarized_story": "﻿A former President of the Senate, Senator Iyorchia Ayu, has emerged as the new National Chairman of the Peoples Democratic Party (PDP).\nSenator Ayu, a consensus candidate for the position, took over the leadership of the main opposition party alongside 20 others elected into various positions within the PDP National Working Committee.\nThe new set of leaders were elected at the party’s national convention which began on Saturday and lasted till the early morning of Sunday.\nHundreds of party delegates participated in the election of the new national officers at the Eagle Square in Abuja.\nWhile Bayelsa State Governor served as the Co-Chairman of the PDP National Convention Election, Governor Seyi Makinde of Oyo State is the Secretary."
  },
  {
    "headline": "SERAP Sues Buhari, Demands Recovery Of Missing ₦881bn In 367 MDAs",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) has filed a lawsuit against President Muhammadu Buhari “over his failure to probe allegations that over ₦880bn of public funds are missing from 367 ministries, departments and agencies (MDAs).”The suit followed the grim allegations contained in Part 2 of the 2018 Annual Audited Report by the Office of the Auditor-General of the Federation that ₦880,894,733,084.811 was spent by 367 MDAs without any appropriation.\nSERAP is, therefore, calling for the prosecution of those suspected to be responsible, and the recovery of any missing or diverted public funds.\nSection 15[5] of the 1999 Nigerian Constitution (as amended), requires the Buhari administration to abolish all corrupt practices and abuse of power.\n“Granting the reliefs sought would help to address the adverse consequences of unconstitutional and poor management of public resources on the human rights of poor Nigerians.\nNo date has been fixed for the hearing of the suit."
  },
  {
    "headline": "32.9kg Cocaine Seizure: Court Grants NDLEA’s Request To Attach Ship, Detain 29 Suspects",
    "summarized_story": "NDLEA spokesman, Femi Babafemin noted in a statement on Sunday that besides the attachment order, the court also granted NDLEAs request to detain the master of the ship, Mr. Tanahan Krilerk, and 21 foreign crewmembers as well as seven Nigerians arrested in connection to the case.\nThe anti-narcotic agency had on October 13 intercepted the ship at the Apapa Seaport following intelligence from international partners and support from other security forces such as the Nigerian Navy, Customs, DSS, and the police.\nA thorough search of the ship led to the recovery of 30 parcels containing cocaine which weighed 32.9kg.\nGen. Mohamed Buba Marwa (Retd) on Tuesday 26th directed that an application to attach the ship and detain the suspects for two weeks pending the conclusion of investigation and filing of criminal charges against suspects be filed in court.\nThe case was thereafter adjourned till 25th November 2021 for the report of investigation."
  },
  {
    "headline": "Gov Obiano commissions Anambra airport for commercial operations",
    "summarized_story": "Governor Willie Obiano of Anambra State has commissioned the Anambra International Passenger and Cargo Airport for commercial operations.\nThis came as the Nigeria Civil Aviation Authority (NCAA), the country’s aviation regulatory body, refused to approve the takeoff of two commercial flights scheduled to land at the airport from Lagos and Abuja, respectively.\nObiano said: “I thank Buhari for approving this Airport, also Sidika for the oversight activities he did here, and also Nuhu of NCAA.\n“The airlines that will operate in this airport include Air Peace, Ibom Air, Dana Air, United Nigeria Air and Anab Jets.\nToday’s commissioning of the airport is yet another of your dreams and you have brought it to fruition”."
  },
  {
    "headline": "PFN advises President Buhari to declare bandits terrorists",
    "summarized_story": "President Muhammadu Buhari has been challenged by the Pentecostal Fellowship of Nigeria’s (PFN) South West zone to declare bandits in the North West and Northeast terrorists.\nAccording to PFN, the fight against insecurity will take a new turn once President Buhari declares the bandits terrorists.\nNational Vice President PFN South West zone, Archbishop John Osa-Oni, argued that the Indigenous Peoples of Biafra (IPOB), which was declared a terrorist organisation, had not wreaked as much havoc as bandits.\n“We trust President Buhari will incline his executive ears on these pieces of truth and chart the path of statesmanship to make the nation better secured.”The organization bemoaned the fact that nearly all of the region’s highways were undergoing rehabilitation.\nIt stated that the Benin-Ore-Sagamu-Lagos highway, the Benin-Owo-Akure-Ilesha-Ile Ife highway, the Lagos-Ibadan highway, and the Lagos-Ota highway were critical to the region’s economic growth and should be repaired immediately."
  },
  {
    "headline": "FG extends NIN-Sim deadline till end of 2021",
    "summarized_story": "The Federal Government has extended the deadline for linkage of National Identity Numbers with the Subscribers Identity Module card till the end of the year.\nAccording to the statement, “As of October 30, 2021, there were over 9,500 enrolment systems and over 8,000 NIN enrolment centres within and outside the country- this has significantly eased the NIN enrolment process and subsequent linkage of NIN to SIM.\nThe NIN-SIM verification process is supporting the Government’s drive to develop Nigeria’s digital economy, strengthen our ability to protect our cyberspace and support the security agencies.\n“The Federal Government will ensure that all innocent, law abiding citizens and residents will not lose access to their phone lines as long as they obtain and link their NIN.\nGovernment will also continue to provide an enabling environment for investors in the telecommunications sector."
  },
  {
    "headline": "Iyorchia Ayu emerges PDP chairman, says opposition party back to rescue Nigeria from 'mess'",
    "summarized_story": "A former President of the Senate, Iyorchia Ayu, has been elected the National Chairman of the People’s Democratic Party.\nIyorchia Ayu was earlier adopted as the consensus candidate for the position.\nThe former Chairman of the National Assembly won the election unchallenged with 3,426 votes.\nA former Deputy Governor of Oyo state, Taofeek Arapaja, also emerged as National Deputy Chairman (South), with 2,004 votes.\nHe defeated former governor of Osun state, Olagunsoye Oyinlola, who scored 705 votes."
  },
  {
    "headline": "Special Report: A Day in the Life of a Nigerian Park Ranger (Watch)",
    "summarized_story": "The Nigeria National Parks Service is a parastatal under the Federal Ministry of Environment and the body is responsible for the preservation and protection of wildlife across Nigeria’s national parks.\nThis week on ‘Go Wild’, ARISE Environmental Correspondent, Laila Johnson-Salami, takes us through a day in the life of a National Parks Service ranger.\nWatch the video for more…"
  },
  {
    "headline": "Saudi Aramco Sees Q3 2021 Income Rise to $30.4bn",
    "summarized_story": "The world’s largest oil company, Saudi Aramco, reported $30.4 billion in third-quarter net income on Sunday, bolstered by a surge in oil prices and recovery in demand as the coronavirus pandemic eases.\nSaudi Arabia’s majority state-owned oil giant Aramco, formally known as the Saudi Arabian Oil Co., said its net income more than doubled from $11.8 billion during the same three-month period a year earlier.\nLast year’s figure came after profits plunged dramatically as global lockdowns slammed oil prices.\nNet income refers to the amount left after taxes and preferred dividends have been paid.\n“We are optimistic that energy demand will remain healthy for the foreseeable future,” Nasser said."
  },
  {
    "headline": "Japan Votes in Test for New PM Kishida, Political Stability",
    "summarized_story": "The vote is a test for Kishida, who called the election soon after taking the top post early this month, and for his Liberal Democratic Party (LDP), which has been battered by its perceived mishandling of the coronavirus pandemic.\nAlready, Kishida has struggled to advance policies to help poorer people, while securing a big boost in military spending and taking a harder line on China.\nThe biggest opposition group, the Constitutional Democratic Party of Japan, is expected to gain seats but not come near toppling Kishida’s coalition.\nBefore the election, the coalition had a commanding two-thirds majority of 305, with the LDP holding 276.\n“If it does, the LDP will become a better party, considering the number of talented lawmakers they’ve got."
  },
  {
    "headline": "Again, Nigeria Extends NIN-SIM Verification Deadline to December",
    "summarized_story": "The minister added that the extension will also help to increase enrolments in countries with a significant number of Nigerians.\nYesterday’s extension of the deadline was the ninth extension by the federal governmen since the directive on NIN-SIM verification and linkage was issued in December 2020.\nFollowing the inability of Nigerians to meet up with the initial December 31, 2020 deadline, the federal government had continued to extend the deadline.\nGiving the review of the progress of the NIN-SIM registration and verification exercise, Pantami said over 66 million unique National Identity Numbers (NIN) have been issued- an indication of progress achieved in the ongoing NIN-SIM linkage.\nThe NIN-SIM verification process is supporting the government’s drive to develop Nigeria’s digital economy, strengthen our ability to protect our cyberspace and support the security agencies."
  },
  {
    "headline": "Sudanese Rally in Paris Denounces Military Coup",
    "summarized_story": "Dozens of Sudanese took to the streets of Paris in France on Saturday to protest against the coup d’état of General Abdel Fattah al-Burhane, after violent protests claimed the lives of three demonstrators and injured around 100.\n“All Sudanese in Sudan, all the people came out and said +no, we cannot accept the coup.\nThe military has only brought misery and wars and now we have to stop,” a protester saidAnother protester said, “the military council is the old regime in disguise.\nAll we ask now is that the military council be overthrown, we want power in civilian hands, we also want an elected government, that’s all we ask.”The protesters have rejected the military rule and are now calling for a civilian-led government.\nInternet services have been largely blocked since the coup, and phone calls regularly disrupted."
  }
]