[
  {
    "headline": "UFC 271: ‘I thought I did enough’, Whittaker rues defeat to Adesanya",
    "summarized_story": "Robert Whittaker has regretted his defeat to Israel Adesanya in their UFC 271 encounter.\nWhittaker came into the challenge to regain the middleweight championship he lost to Adesanya in 2019.\nThe win over Whittaker was Adesanya’s fourth defense of the middleweight championship since winning the belt in the first meeting with Whittaker.\nI’m gutted.\nI’m gutted."
  },
  {
    "headline": "Portugal-Ukraine flight forced to land in Moldova over Russia standoff",
    "summarized_story": "A flight from Madeira, Portugal, to Kyiv was barred from entering Ukraine on Sunday because of the crisis with Russia and forced to land in Moldova, its operator said.\nUkraine’s low-cost carrier SkyUp said the flight’s permission to cross into Ukraine was removed at the last minute by the plane’s Irish leasing company.\nSkyUp said it was trying to arrange a transfer for the flight’s 175 passengers from the Moldovan capital Chisinau to Kyiv.\nThe incident occurred a day after Dutch carrier KLM suspended flights into Ukraine until further notice due to mounting fears that Russia was preparing an invasion of the former Soviet state.\nIndustry analysts believe other international airlines may also ban flights into Ukraine soon because of the growing cost to travel insurers."
  },
  {
    "headline": "NDLEA detains Indian businessman over 134,700 bottles of codeine",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency have taken an Indian man, Vyapak Nutal, into custody for interrogation over the smuggling of 134,700 bottles of Codeine syrup into the country through the land border between Nigeria and the Niger Republic in Sokoto State.\nAccording to the NDLEA, the suspect had loaded the consignment into trucks in Cotonou, Benin Republic and drove through the land borders via the Niger Republic before entering Sokoto State at the Illela border.\n“Settled in a hotel in Sokoto state, credible intelligence reveals that Nutal began to look for buyers for the controlled drug.\n“No less than 25 kilograms of Methamphetamine, Tramadol, Cannabis and Khat concealed in motor parts, MP3 player, speaker and fabrics heading to the USA, UK, Australia, Dubai and Madagascar were seized at three major courier companies in Lagos.\nThis followed the arrest of Aliu Salami, 43, with 143.9kg cannabis at Oke-Ata, Abeokuta South LGA, Ogun State, on Wednesday 9th February.”Copyright PUNCH."
  },
  {
    "headline": "Children sit on the ground, learn under trees in IDP camps",
    "summarized_story": "Also Read:The Almajiri Catastrophe in Northern NigeriaAnd today Benue is warehousing an army of helpless out-of-school-children in IDP camps.\n“It is not a properly structured teaching arrangement but it gives the children that sense of being in school while sitting on the ground.\nShe stated that in the last five years, most of Benue’s children had been out of school and living in IDP camps.\n“Aside from the herdsmen induced humanitarian crisis, Benue State is also besieged by nature-induced humanitarian disasters like flooding.\nThis was disclosed by the outgoing UNICEF Chief of Enugu Field Office, Dr Ibrahim Conteh when he paid a farewell visit to the Tse Uikpam IDP camp."
  },
  {
    "headline": "BUHARI: Tinubu, Osinbajo, Amaechi in battle for ‘anointing’",
    "summarized_story": "Rochas OkorochaAPC stalwart and one of the founding members of the APC, Owelle Rochas Okorocha, is another aspirant who has presented his 2023 presidential ambition to Buhari.\nOkorocha, like President Buhari, has been a regular aspirant and it is not certain yet whether he has a lobby group that will convince the President on why he should be considered as his (successor).\nBut it is not clear yet whether Osinbajo will contest the 2023 presidency or not despite the ongoing consultations organized by various support groups urging him to run.\nRecall that it was Tinubu who nominated Osinbajo as Buhari’s running mate in 2015 after it became clear that he (Tinubu) couldn’t run with then presidential candidate of the APC (Buhari) because of the widespread opposition to Muslim-Muslim ticket.\nThis has increased the speculation that Amaechi is the APC anointed candidate in the 2023 presidential election."
  },
  {
    "headline": "Herdsmen’s Siege in Edo: ‘AK47-wielding teenagers invaded our farmlands with cattle’",
    "summarized_story": "For now, I only pray to God to help us as nobody can go to the farm to harvest plantain.\n“I showed them the pictures of the destroyed farm and crops.\nFor about four years now, some fierce-looking herdsmen accompanied by AK47- wielding teenagers have invaded our farmlands with hundreds of cattle.\n“In our latest contact with him, he disowned the cattle and herders now in our farms, insisting that they are cattle rustlers with stolen cattle from Kogi State.\n“Now we are afraid to enter our old farms to harvest or start cultivating new farms."
  },
  {
    "headline": "Israel Adesanya retains UFC middlewight belt with victory over Whittaker",
    "summarized_story": "Judge Mike Beltran had Adesanya winning all but the second round, which he gave to Whittaker.\nAdesanya outlanded Whittaker 79-59 in significant strikes, according to UFC Stats.\nBut Whittaker landed more significant strikes to the head, 38-36, with Adesanya outlanding Whittaker in strikes to the legs, 29-13.\nAt middleweight, Adesanya was No.\nAdesanya (22-1) stopped Whittaker via second-round knockout at UFC 243 in October 2019 to win the title."
  },
  {
    "headline": "How Indian businessman smuggled over 134,700 bottles of Codeine into Nigeria ― NDLEA",
    "summarized_story": "By Kingsley Omonobi – AbujaAn Indian businessman, Vyapak Nutal, has been taken into custody for interrogation by operatives of the National Drug Law Enforcement Agency, NDLEA, over the smuggling of 134,700 bottles of Codeine syrup into the country through the land border between Nigeria and Niger Republic in Sokoto state.\nThe suspect had loaded the consignment into trucks in Cotonou, Benin Republic and drove through the land borders via the Niger Republic before entering Sokoto state at the Illela border.\nA statement by the Director, Media and Advocacy said the Indian businessman Nutal settled in a hotel in Sokoto state, began to look for buyers for the controlled drug.\n“While operatives were on his trail, officers of the Department of State Security were able to apprehend him and swiftly handed him over to NDLEA on Wednesday 10th February 2022”.\nNo lesser than 25 kilograms of Methamphetamine, Tramadol, Cannabis and Khat concealed in motor parts, MP3 player, speaker and fabrics heading to USA, UK, Australia, Dubai and Madagascar were seized at three major courier companies in Lagos."
  },
  {
    "headline": "Why marriages are failing – Pastor Ibiyeomie",
    "summarized_story": "Pastor David Ibiyeomie of Salvation Ministry has asserted that there is currently a high rate of divorce across the globe due to couples’ ideology before they enter into marriage.\nHe said it is wrong to expect divorce in marriage, urging church members to embrace marriage with the mindset to stay forever.\nthey will say “if it doesn’t work then I will walk away”.\n“Look, I am going in, if it doesn’t work then I’ll step out”.\n“When you have a strong expectation, you won’t be confused by anything, you’re sure that this thing must happen”."
  },
  {
    "headline": "Security operatives repel terrorists, rescue abductees in Kaduna",
    "summarized_story": "Security operatives at Hayin Gada, Shika ward in Giwa local government area of Kaduna State have killed one terrorist while others were repelled from the community.\nAccording to the source who sought anonymity, the terrorists invaded the area at about 11pm in the night on Friday with a small number but met the resistance of security operatives who were already stationed.\nThe local government area has reportedly become host to terrorists who are fleeing the surrounding area following security bombardment being carried out in Zamfara and Katsina States.\nThe source explained that Shika ward hosts the ABU Teaching Hospital and National Animal Production Research Institute, housing many staff of both Institutes.\nHe said the security operatives were able to rescue a staff of the National Animal Production Research Institute, NAPRI, Shika one Mr.Katung and his two children."
  },
  {
    "headline": "TSA: Corruption in Nigeria reduced by 80 to 90 percent – Presidency",
    "summarized_story": "The presidency says the introduction of the Treasury Single Account (TSA) has reduced corruption in the country by 80-90 percent.\nAt the News Agency of Nigeria (NAN) Forum, Director-General, Bureau of Public Service Reforms (BPSR), Dasuki Arabi, said the implementation was initially difficult for citizens to accept.\nThe official noted that TSA had impacted positively on the economy and in the fight against corruption in public services.\nThe Federal Inland Revenue Services (FIRS), Nigeria Customs Service (NCS), Nigerian Port Authority (NPA) and Shippers Council are involved in the monitoring, the DG added.\n“I am confident that it has reduced corruption by more than 80 to 90 per cent."
  },
  {
    "headline": "Buhari, Lai Mohammed sued over failure to publish Nigeria, Twitter agreement",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) has sued President Muhammadu Buhari for the failure to publish the Federal Government of Nigeria’s agreement with Twitter.\nJoined in the suit as Respondent is Lai Mohammed, Minister of Information and Culture who announced the ban on Twitter in June 2021.\nIn suit FHC/L/CS/238/2022 filed at the Federal High Court in Lagos, SERAP is asking the court to compel Buhari and Mohammed to make the details public.\n“Any agreement with social media companies must meet the constitutional requirements of legality, necessity, proportionality and legitimacy.\n“Secretly agreed terms and conditions will fail these fundamental requirements”, the suit read in part."
  },
  {
    "headline": "Ogun CP orders arrest of youths who burnt suspected ritual killers to death",
    "summarized_story": "The Ogun State Commissioner of Police, Lanre Bankole has ordered the arrest of youths who set ablaze two men found with a human head in Oja Odan, Yewa North Local Government Area of the State on Saturday.\nDAILY POST reported earlier that two men, Idowu Afolabi and Johnson Adebiyi, were detained at Oja Odan police station for having a fresh human head in their possession.\nBut, the youths stormed the police station, broke in and dragged out the two suspects, whom they set on fire in front of the station.\nReacting on Sunday, the Ogun State Police Command said there will be no room for jungle justice in the state, warning the general public that “such barbaric and unlawful action will no longer be tolerated.”The Ogun State Police Public Relations Officer, Abimbola Oyeyemi, in a statement on Sunday, confirmed that the two suspected ritualists were arrested and brought to the Oja Odan division by some vigilant and law-abiding members of the public, with allegations that a fresh human head concealed in a sack was seen with them.\nHe said, “While the suspects were being interrogated in the station, some unscrupulous elements went and mobilized a large number of people who invaded the station aggressively, overwhelmed the police personnel on duty and subsequently hijacked the suspects, beat them to death and set their corpses ablaze.”Sounding a note of warning, Oyeyemi told those in the habit of taking laws into their hands to desist from such “uncivilized behaviour” as the command will henceforth “deal with whoever carries out such actions in the most decisive manner.”The PPRO maintained that “a suspect remains a suspect until he/she is convicted by a court of competent jurisdiction, no matter how grievous the crime he suspected to have committed might be.”He explained that “It is only the court that has the power to impose punishment on anyone found guilty of a crime, not an individual or group of people.”Therefore, the Commissioner of Police, Lanre Bankole, Oyeyemi “has ordered a full-scale investigation into the incident with the view to bringing to justice those who participated in carrying out the barbaric and unlawful killing of the suspects.”The CP also appealed to members of the public to have confidence in the nation’s criminal justice system and desist from self-help, saying such is alien to the law of the land."
  },
  {
    "headline": "Hijab row in Kwara school politically motivated, say ex-students",
    "summarized_story": "Former students of the Oyun Baptist High School (OBHS) Ijagbo in Oyun local government area of Kwara State have said the recent bloody clash in the school over hijab (veil) wearing by female students was politically motivated.\nChief Adesina appealed to the State Government to resolve the row with alacrity for the sake of the students.\nAccording to hin: “The recent hijab row in the school is very unfortunate that it is happening now.\nMore so that we are really preparing to celebrate the 50th anniversary of the school.\nThe students are the ones losing.”Lending his voice, one of the former teachers of the school Alhaji Ibiyeye B Razaq, said that the hijab palaver in the school was unfortunate."
  },
  {
    "headline": "PDP wins Abuja Municipal Area Council",
    "summarized_story": "The candidate of the People’s Democratic Party (PDP) Christopher Zakka has been declared the winner of the Chairmanship election for Abuja Municipal Area Council (AMAC).\nHe polled a total of 19,302 to beat his closest rival of the All Progressives Congress (APC), Murtala Usman, who got 13,240.votes.\nREAD ALSO: FCT poll: PDP floors APC to win Kuje councilHe was declared winner by the INEC Returning Officer Professor Sani Zaka."
  },
  {
    "headline": "Nigerians decry threat, intimidation, cyberbullying by loan sharks",
    "summarized_story": "“I took a loan of N6000 from (one of the loan companies).\nAnother borrower, speaking on condition of anonymity, bemoaned the death of his relative due to harassment by some of the loan sharks.\nHe called for a decisive regulatory action to curb excesses of these loan sharks.\n“There is no need for you to go to loan sharks for a loan.\n“We can only continue to advise that there is no need to go for loan sharks,” he said."
  },
  {
    "headline": "Indian businessman held for allegedly smuggling over 134,700 bottles of codeine",
    "summarized_story": "Babafemi said the suspect had loaded the consignment into trucks in Cotonou, Benin Republic and driven through the land borders via Niger Republic before entering Sokoto State at the Illela border.\nThe spokesman said Nutal settled in a hotel in Sokoto State and credible intelligence revealed that he began to look for buyers for the controlled drug.\n“While operatives were on his trail, officers of the Department of State Security were able to apprehend him and swiftly handed him over to NDLEA on Wednesday 10th February 2022,” Babafemi said.\n“Not less than 25 kilograms of Methamphetamine, Tramadol, Cannabis and Khat concealed in motor parts, MP3 player, speaker and fabrics heading to USA, UK, Australia, Dubai and Madagascar were seized at three major courier companies in Lagos.\nA follow up operation led to the arrest of Salisu and two others; Sani Musa and Auwal Amina the day after at different locations within Kaita LGA, Katsina."
  },
  {
    "headline": "FCT poll: PDP floors APC to win Kuje council",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared Suleman Sabo of the Peoples Democratic Party (PDP) winner of the February 12 Kuje Area Council chairmanship election in the Federal Capital Territory.\nBy this, the PDP candidate defeated the APC with a total margin of 5,607 votes.\nINEC Returning Officer for the Kuje Area Council election, Sule Magaji announced the final results on Sunday morning.\nAbubakar, a former chairman of the council, defeated his opponent, Mohammed Kassim of the Peoples Democratic Party (PDP).\nThe Saturday elections were held across the 68 wards/constituencies spread across Bwari, Abaji, Gwagwalada, Kuje, Kwali and Abuja Municipal Council (AMAC) area councils of the FCT."
  },
  {
    "headline": "Two dead, two rescued as building collapses in Lagos",
    "summarized_story": "Two bodies have been recovered and two people rescued from the rubble of a three-storey building that collapsed in Yaba, Lagos, on Saturday.\nEarlier on Saturday, an official of LASEMA had said some construction workers were in the building when it collapsed.\n‘Upon the arrival of LASEMA response team at the incident scene, a three-storey building under construction was discovered to have collapsed,’ the official had said.\nFurther investigation revealed that the construction workers numbering about five were on site when the structure came down and are still trapped underneath.\nAn eyewitness also said a part of the building had collapsed in 2021, but that construction had continued."
  },
  {
    "headline": "How Igboho, Kanu can be released – Dansudu, National President,",
    "summarized_story": "But what matters to me and what I think should matter to every Nigerian is not where the next president comes from.\nRather we should be concerned about electing a credible and competent person as the next president.\nSo, as far as I am concerned, there are just two divisions in the country: the North and the South.\nHow best do you think the continued detention of Sunday Igboho and Nnamdi Kanu, two separatist agitators, can be resolved with the Federal Government?\nOn the other hand, Igboho can be released, but then you have to remember that he is not in the government’s custody."
  },
  {
    "headline": "One feared dead as thugs attack Igboho’s residence in Ibadan",
    "summarized_story": "From Oluseye Ojo, IbadanArmed thugs yesterday attacked the Sims, Ibadan residence, of Yoruba nation activist, Chief Sunday Adeyemo, fondly called Sunday Igboho, with one person feared dead, while some others said to be Igboho’s followers also sustained varying degrees of injuries.\nIt was gathered that the attack on Igboho’s house followed the fracas that broke out between people suspected to be members of the Oyo State Park Management System (PMS) and a group known as Federal Boys.\nThe pandemonium, which started two days ago, has caused serious unrest and public disturbance at areas such as Soka, Oremeji, and Agugu, the capital of Oyo State.\nLead counsel to Igboho, Chief Yomi Alliyu (SAN), confirmed the Saturday’s attack on Igboho’s residence to newsmen, saying that the armed thugs stormed the residence with dangerous weapons, which they used to inflict injury on associates of Igboho.\nA source in Igboho’s house alleged that the supporters of the Yoruba nation agitator were the target of the attack, saying that “Soka Junction, Sanyo, Academy, Oremeji were currently under attack."
  },
  {
    "headline": "Money ritual: Anxiety over growing national evil",
    "summarized_story": "Nigeria has never been at such crossroads as another monster of gargantuan size and stature – ritual killing for money – bulldozes its way into the national psyche, staring every one in the face.\nAccording to Sunday Sun investigation, this “money ritual’ now making Nigeria and Nigerians edgy didn’t start yesterday.\nSome people believe “money ritual” has already attained a menace of epidemic proportion, spreading far faster than ever imagined, treacherously threatening the real existence of the Nigerian society now in distress.\nMoney ritual and NOAAccording to Paul Odenyi, assistant director, Press, at National Orientation Agency (NOA), Abuja, ritual killings and advance-fee fraud are considered a part of the general concept of value decay in the country.\n“But now, teenagers are even killing their own parents for money rituals – all because money has become everything."
  },
  {
    "headline": "My irresistible big butt, my selling point –Chioma Richard, actress",
    "summarized_story": "By Ephraim NwosuMy irresistible big butt, my selling pointI can kiss in movies only on one conditionNigerians can now work and earn dollars DAILY from home.\nI doubt if my dad of blessed memory would have supported me if he were alive when I started acting.\nHave you ever been asked for sex in exchange for movie role?\nHave you at any point in your acting career thought of quitting?\nMy greatest assets are my complexion, beautiful face and constant smiles as well as my big, natural and irresistible butt."
  },
  {
    "headline": "Head of Sokoto Caliphate Kingmakers, Danbaba Dies Suddenly, Buried in Glory",
    "summarized_story": "*President expresses shock, millions mournJohn Shiklam in Kaduna and Onuminya Innocent in SokotoThe Head of Sokoto kingmakers, the Magajin Garin Sokoto, Alhaji Hassan Danbaba, who died yesterday, has been laid to rest in a glorious ceremony.\n“By virtue of his position as the head of the kingmakers of Sokoto Caliphate, there is a reserved cemetery, Hubbaren Shehu, where royal leaders are usually buried in Sokoto,” the source added.\nMagajin Garin Sokoto was part of the eminent Nigerians who converged on Lagos last weekend to find solutions to the challenges confronting the country ahead of the 2023 elections.\nMay his soul rest in peace.”Meanwhile, the Senator representing Sokoto North Senatorial district, Aliyu Magatakarda Wamakko, has also expressed grief over the demise of Magajin Garin Sokoto.\nAccording to Wamakko, the Sokoto Caliphate has indeed lost a father and a respected leader who lived a life of service to the Caliphate, Nigeria and humanity."
  },
  {
    "headline": "Atiku Under Fire for Kicking against Zoning Presidential Ticket",
    "summarized_story": "But Atiku, who is one of the prominent northern politicians interested in contesting the 2023 presidential election, has faulted the agitation.\nThe former vice president argued: “There is no zoning in the constitution; there is none.\nPANDEF: Atiku’s Position on Zoning Unfortunate, DisappointingOn its part, the Pan Niger Delta Forum (PANDEF) has described the position of Atiku that zoning is not provided for in the 1999 Constitution as unfortunate and disappointing.\nKen Robinson, told THISDAY yesterday that his group was disappointed at the statement credited to Atiku on the zoning of the presidency.\nHe further noted that Atiku should not to allow his presidential ambition to becloud his sense of reasoning."
  },
  {
    "headline": "FG Rejects Two Cargoes of Adulterated Petrol Imported from Belgium",
    "summarized_story": "Group Managing Director of the NNPC, Mallam Mele Kyari, however, stated that from his investigation, the four petrol cargoes were imported by MRS, Emadeb/Hyde/AY Maikifi/Brittania-U Consortium and Oando.\nEach consortia THISDAY learnt, receives some quantities of crude oil in exchange for petrol.\nRussia delivers Europe with one-third of its natural gas needs and exports around 2 million bpd of both crude oil and refined products to European nations.\nThis was in contrast to December 2021, when it pumped 1.197 million barrels per day and November when it was only able to produce 1.275 million bpd.\nThe biggest increases in crude oil production came from Nigeria, Saudi Arabia, the United Arab Emirates (UAE), and Kuwait, while output declined in OPEC’s second-largest producer Iraq, as well as in Venezuela and Libya."
  },
  {
    "headline": "Security Operatives at Makurdi Air force Base Stop Ortom from Receiving Osinbajo",
    "summarized_story": "It is not clear if the vice president was aware of the governor’s visit to the base to receive him.\nHe expressed regrets that he had set out to attend the burial of Professor Ignatius Ayua but had to delegate his deputy in order to receive the Vice President.\nThe letter which was signed by Ambassador Abdullahi Gwary said the vice president would return through the same route in the afternoon.\nHe vowed to report the matter to the Vice President for necessary action, stressing that there should be a clear difference between politics and governance.\nOrtom further described the presidency as a lame duck who could not tackle the security challenges of the country."
  },
  {
    "headline": "Buhari Sacks First Lady’s Aide, Redeploys Three Others",
    "summarized_story": "Appoints Zorro as media aide to AishaDeji Elumoye in AbujaPresident Muhammadu Buhari has approved the sack of one aide of the First Lady, Aisha Buhari, and the redeployment of three others.\nHe also okayed the appointment of former President of the Nigerian Union of Journalists (NUJ), Mallam Sani Zorro, as media aide to the First Lady.\nPresident Buhari also gave the go ahead for the appointment of Muhammad Sani Zorro, journalist, politician and former lawmaker as the Senior Special Assistant to the President on Public Affairs and Strategy, Office of the First Lady.\nZorro, a famous journalist brings to the new job decades-long experience in media practice, publishing and unionist leadership.\nHe was at various times President, Nigeria Union of Journalists, NUJ, West African Journalists Association (WAJA) and the Federation of African Journalists, FAJ."
  },
  {
    "headline": "EXCLUSIVE: Nigerian Journalist, Lanre Arogundade Recently Detained Because Buhari Presidency Included Him In Fresh List Of Persons Considered Dangerous",
    "summarized_story": "Arogundade was detained by the secret police, DSS on Thursday upon his arrival at the Murtala Muhammed International Airport in Lagos.\nHowever, hours after his arrest, he was released, following public outcry, especially from the media and civil society organisations.\n“The presidency recently submitted a fresh list of Nigerians it considered dangerous to airports and land borders and Arogundade's name was there,” an immigration official confirmed to SaharaReporters on Sunday.\nThe documents deactivated had included the activist’s national identity card, permanent voter card, passport and driver's licence.\nSee Also Breaking News BREAKING: Buhari's Regime Deactivates Sowore’s National ID Card, Permanent Voter Card, International Passport, Gives No Reason For ActionPresident Buhari’s regime did not give any explanation for the move."
  },
  {
    "headline": "EXCLUSIVE: Nigerian Journalist, Lanre Arogundade Recently Detained Because Buhari Presidency Included Him In Fresh List Of Persons Considered Dangerous",
    "summarized_story": "Arogundade was detained by the secret police, DSS on Thursday upon his arrival at the Murtala Muhammed International Airport in Lagos.\nHowever, hours after his arrest, he was released, following public outcry, especially from the media and civil society organisations.\n“The presidency recently submitted a fresh list of Nigerians it considered dangerous to airports and land borders and Arogundade's name was there,” an immigration official confirmed to SaharaReporters on Sunday.\nThe documents deactivated had included the activist’s national identity card, permanent voter card, passport and driver's licence.\nSee Also Breaking News BREAKING: Buhari's Regime Deactivates Sowore’s National ID Card, Permanent Voter Card, International Passport, Gives No Reason For ActionPresident Buhari’s regime did not give any explanation for the move."
  },
  {
    "headline": "Building Under Construction Collapses In Lagos",
    "summarized_story": "A three-storey building still under construction on Akanbi Crescent in the Yaba area of Lagos State has collapsed, a report by PUNCH said.\nAccording to an eyewitness, a part of the building had collapsed late last year but the construction did not stop.\nA resident of number 29, Lawani Street, a street off the scene of the incident, revealed that her car was affected last year when a section of the building collapsed, however, construction continued despite the police being called in.\nThe Lagos State Emergency Management Agency Response Unit was called to the scene but had yet to arrive.\nSo far, only a 16-year-old boy and another adult male have come out of the rubble while there is an unconfirmed number still trapped in the collapsed building."
  },
  {
    "headline": "Building Under Construction Collapses In Lagos",
    "summarized_story": "A three-storey building still under construction on Akanbi Crescent in the Yaba area of Lagos State has collapsed, a report by PUNCH said.\nAccording to an eyewitness, a part of the building had collapsed late last year but the construction did not stop.\nA resident of number 29, Lawani Street, a street off the scene of the incident, revealed that her car was affected last year when a section of the building collapsed, however, construction continued despite the police being called in.\nThe Lagos State Emergency Management Agency Response Unit was called to the scene but had yet to arrive.\nSo far, only a 16-year-old boy and another adult male have come out of the rubble while there is an unconfirmed number still trapped in the collapsed building."
  },
  {
    "headline": "Rise Up And Challenge Nigeria's 'Dirty, Money Politics System' – Northern Academics, Elders Tell Students",
    "summarized_story": "A convergence of academics and progressive section of the northern leaders and elders have charged youths in the region to step up and revamp Nigeria's dirty political system.\nHe decried the dirty politics being played by Nigerian politicians while expressing the need for the mindset of the youths to be changed for the better.\nHe said: “The money politics system is bad, that is why we are here.\nWe are playing a very wrong, very dirty and very unproductive politics.\n\"We have so many opportunities to explore, but we are lazy and place too much reliance on government,\" he said."
  },
  {
    "headline": "Lai: Canada brands anti-vax protesters as insurrectionists but supported #EndSARS in Nigeria",
    "summarized_story": "Lai Mohammed, minister of information and culture, says Canada’s reaction towards the truckers’ protest against COVID-19 restrictions shows no country allows violent protest.\nAdvertisementSpeaking at a news briefing, the minister said the Canadian government branded the protesters as insurrectionists, whereas they supported the #EndSARS protesters in Nigeria, which shows double standards.\nBut we are only calling attention to the double standard involved in the way protesters deemed to be violent are perceived in Nigeria and in the West.\nIf there is no Nigeria, no one will be talking of freedom of expression or freedom of association and the likes.\nAnd this also explains why we have continued to insist on the regulation of social media to ensure responsible content."
  },
  {
    "headline": "Lai: Canada brands anti-vax protesters as insurrectionists but supported #EndSARS in Nigeria",
    "summarized_story": "Lai Mohammed, minister of information and culture, says Canada’s reaction towards the truckers’ protest against COVID-19 restrictions shows no country allows violent protest.\nAdvertisementSpeaking at a news briefing, the minister said the Canadian government branded the protesters as insurrectionists, whereas they supported the #EndSARS protesters in Nigeria, which shows double standards.\nBut we are only calling attention to the double standard involved in the way protesters deemed to be violent are perceived in Nigeria and in the West.\nIf there is no Nigeria, no one will be talking of freedom of expression or freedom of association and the likes.\nAnd this also explains why we have continued to insist on the regulation of social media to ensure responsible content."
  },
  {
    "headline": "FCT council election: PDP wins in Kuje, Bwari -- but APC takes Gwagwalada",
    "summarized_story": "The election was conducted in over 60 wards spread across Bwari, Abaji, Gwagwalada, Kuje, Kwali and Abuja Municipal Council (AMAC) area councils of the FCT.\nPDP WINS IN KUJE AREA COUNCILThe electoral umpire has declared Suleman Sabo of the PDP winner of Kuje area council chairmanship election in the FCT.\nSule Magaji, INEC returning officer for Kuje area council, announced the final results on Sunday morning.\nAdvertisementAPC DEFEATS PDP IN GWAGWALADAJubrin Abubakar, candidate of the APC, has been declared the winner of the chairmanship poll in Gwagwalada area council.\nHe was declared winner of the exercise by ID Umar, INEC returning officer for Gwagwalada area council."
  },
  {
    "headline": "FCT council election: PDP wins in Kuje, Bwari -- but APC takes Gwagwalada",
    "summarized_story": "The election was conducted in over 60 wards spread across Bwari, Abaji, Gwagwalada, Kuje, Kwali and Abuja Municipal Council (AMAC) area councils of the FCT.\nPDP WINS IN KUJE AREA COUNCILThe electoral umpire has declared Suleman Sabo of the PDP winner of Kuje area council chairmanship election in the FCT.\nSule Magaji, INEC returning officer for Kuje area council, announced the final results on Sunday morning.\nAdvertisementAPC DEFEATS PDP IN GWAGWALADAJubrin Abubakar, candidate of the APC, has been declared the winner of the chairmanship poll in Gwagwalada area council.\nHe was declared winner of the exercise by ID Umar, INEC returning officer for Gwagwalada area council."
  },
  {
    "headline": "Kashim Shettima: Tinubu supported Buhari -- north shouldn't abandon him now",
    "summarized_story": "Kashim Shettima, former governor of Borno state, says the north cannot afford to let Bola Tinubu, former Lagos governor, down because he worked hard in getting President Muhammadu Buhari into office.\nIn an interview with Daily Trust, Shettima said without the south-west, Buhari would not have been president in 2015.\nIt was the south-west political machine that repackaged and resold the Buhari brand to Nigerians in 2015.\n“Without the block support of the South-West, it would have been difficult for President Buhari to emerge as the candidate of the APC.\nTinubu worked for Buhari in 2015 and in 2019."
  },
  {
    "headline": "11 African startups to watch out for in 2022",
    "summarized_story": "About 20 startups are currently listed on its platform and over $400,000 has been invested on the platform.\nThe startup creates a reliable portal to guide African students in their tertiary education, course selection, and career decisions.\nThe startup handles everything it takes for a business to launch in a new African country.\nWe think this startup is building a game-changing product; something that will have a significant impact on the growth of African startups.\nWe know you have some startups you are rooting for this year that we might have missed."
  },
  {
    "headline": "Nigerian stock exchange wants to attract tech IPOs with new listing rules",
    "summarized_story": "Nigeria has set in motion what could herald a new dawn for African tech startups as it moots the adoption of new listing rules to encourage tech companies to go public.\nOlumide Bolumole, division head of stock exchange listing activities at NXG revealed that the bourse will make sweeping changes to make listing attractive to tech companies.\nNGX consists of a holding company and three subsidiaries that cover the operations of the Nigerian Stock Exchange (NSE), its regulation, and its real estate.\nThis structure is similar to those of other international market groups such as the London, New York, and Johannesburg stock exchange groups.\nIn recent decades, Nigeria’s stock market capitalisation has fallen well below potential."
  },
  {
    "headline": "TechCabal’s Valentine’s Gift Guide",
    "summarized_story": "Price range: > $99We’ve labelled this a Series C-type gift because it’s a long-term investment beneficial to all involved.\nPrice range: $2 – $4 (for Individual plans)We’re labelling this a seed-type gift because, any way you dice it, you’re sowing seeds.\nWell, here’s how you can someday build up to that: get them video streaming subscriptions for Valentine’s Day.\nLog on to your MTN, Safaricom, Airtel, or Ethio Telecom services and gift your loved one gigabytes of data.\nFor Valentine’s, add to your loved one’s crypto stash and help them build their way into digital wealth."
  },
  {
    "headline": "This developer transitioned to blockchain development in order to solve Web2 problems",
    "summarized_story": "Akinyemi Akindele, 27, studied computer science at the University of Ibadan, where he trained as a Web2 software developer.\nEventually, he got to build a blockchain supply chain solution with his team, the first of its kind in the country, he said.\nAfter two years at Binance, Akindele joined EMTECH, a US blockchain company that builds digital currency for central banks across the world.\nBreaking into blockchain developmentAnother idea that endeared Akindele to blockchain engineering was that the blockchain was a melting point for a lot of things.\nHe also advised them to contribute to open source blockchain projects and look for ways to solve the problems that exist today in Web2 with Web3."
  },
  {
    "headline": "Demand for office space falls to 5yr low",
    "summarized_story": "The prime office segment of the Nigerian real estate market recorded its worst performance in five years with the vacancy rate remaining unchanged as of the second half of 2021, a new market report has shown.\nThe report describes 2021 generally as the office market’s less than a desirable period when the performance of key metrics such as take-up was at its lowest.\nIn Ikoyi and Victoria Island, Lagos, for instance, asking rents for grade A office space were $700 and $630, respectively, down from $1,000 and $850, respectively, about three years ago.\nThough retail and hospitality sub-sectors were equally hard-hit along with office space by the pandemic, in terms of recovery, office is lagging.\nThis shows a decline of about 78 percent relative to take-up recorded in 2020."
  },
  {
    "headline": "IMF says Nigeria risking financial squeeze as debt piles",
    "summarized_story": "“Public debt threshold for emerging markets stand at 10 percent; however, Nigeria currently spends above 80 percent to service its debt.\nDebt servicing for Nigeria since the oil decline in 2020 has been dependent on CBN overdraft and Eurobond subscriptions.\n“Nigeria’s debt trend is not looking favorable on the debt portfolio end but the estimates are dependent on various economic factors.\nSince 2017, this administration has spent a total of N15.375trn on debt servicing, excluding N296bn and N110bn allocated for sinking funds in 2019 and 2020.\nThe Nigerian economy has been and is still operating in ‘reverse’, Productivity rates are low while debt servicing is increasing (ridiculous)."
  },
  {
    "headline": "Apathy, dysfunctional BVAS, late arrival of officials mark FCT Area Council poll",
    "summarized_story": "There are a total of 1.373 million registered voters in the FCT spread across the six Area Councils, 62 Wards, and 2,822 Polling Units in the Territory.\n“We have this long-standing issue of non-indigenes not wanting to come out and vote during area council elections,” said a voter who simply identified himself as Ahmed.\nINEC Chairman, Mahmood Yakubu at the last extended stakeholders meeting ahead of the FCT election on Tuesday said lessons learned from the Anambra election had been considered in planning for the Area Council election.\nA visit to most of the centers in Nyanya, Karu, Jikwoyi, Kpeghi, Asokoro, Garki, and Kuduru communities in the Abuja Municipal Area Council, showed no presence of men and materials.\nHowever, security agents made up of Police, Civil Defence and Road Safety were seen at the various polling units visited."
  },
  {
    "headline": "Obaseki lauds Ogbeifun for setting up Maritime Institute in Edo Poly, Usen – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has eulogized Engr.\nGreg Ogbeifun, for his outstanding contributions to the development of the state’s education sector, especially the setting up of the Greg Ogbeifun Maritime Institute of Technology (GOMINT).\nObaseki said, “You are doing something to enhance the development of the state and its economy.\nWhat you are doing in the Edo State Polytechnic, Usen, is there for us all to see.\nDignitaries at the event include former Edo State Governor, Chief Lucky Igbinedion and Senator representing Edo South Senatorial District, Senator Matthew Urhoghide, among others."
  },
  {
    "headline": "Obaseki seeks better collaboration to expand opportunities for girls, females in science – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for stronger collaboration among global stakeholders to expand opportunities for women researchers and end all forms of discrimination and stereotypes about women in science.\nThe governor gave the charge in commemoration of the 2022 International Day for Women and Girls in Science, marked by the United Nations (UN).\nHe said, “In commemoration of this year’s International Day for Women and Girls in Science, it is imperative to restate the need for global stakeholders to come together to support initiatives that will further open up the space for more female researchers in sciences to explore innovative approaches to providing solutions to everyday problems.”The governor noted, “As part of the implementation of the Edo State Government Transformation and Enhancement (EdoSTEP) programme, we have sustained efforts aimed at supporting more women to explore opportunities in various scientific fields.\nThrough this programme, we will support more women scientists to develop innovative solutions to development needs in our communities.”Obaseki further stated, “We have expanded our basic education reforms to junior secondary schools and technical colleges to ensure equal opportunity and a growth path for our children, including boys and girls, to explore careers in science and technology without discrimination.”“With increased support from multi-national organisations, donor agencies, and other stakeholders, we will sustain programmes and policies geared at encouraging our female children to achieve their goals in science disciplines,” he added.\nOn this year’s theme, ‘Equity, Diversity, and Inclusion: Water Unites Us,’ Obaseki said, “I urge young girls to take advantage of the unique opportunities in the Edo Tech Park, and compete with the male folks in developing innovative solutions to societal problems.”According to the UN, the General Assembly adopted a resolution to establish an annual International Day on 22 December 2015, “to recognise the critical role women and girls play in science and technology communities.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo begins asphalting of 105.6km Benin-Abraka Road – Nigerian Observer",
    "summarized_story": "The governor gave the assurance when he inspected the laying of asphalt on the ongoing reconstruction of the 105.6km Benin-Abraka Road.\nThe road stretches from Ikpoba-Okha Local Government Area of the state through Orhionmwon LGA, Edo State and terminates at Abraka in Delta State.\nThe road was jointly awarded by the Edo State Government and the Edo State Oil and Gas Producing Areas Development Commission (EDSOGPADEC), to Raycon Construction Company Nigeria Ltd in 2021, with the mandate to complete the road project within a specified period of four years.\nEnabulele Ferguson, while speaking to journalists during the inspection of the asphalting of 5km road, for the first phase of the total of 105.6km Benin-Abraka Road, expressed satisfaction with the progress of work on the road.\nHe, however, noted that despite being a federal road, the project will be completed and delivered to the people at the stipulated time, pledging to ensure its completion before 2025."
  },
  {
    "headline": "National Sports Festival: Redeem N500m pledge, Obaseki urges FG – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has called on the Federal Government to redeem the outstanding N500 million which it pledged to pay as contribution for the hosting of the last edition of the National Sports Festival (NSF), tagged Edo 2020.\nObaseki made the appeal when he received the Edo 2020 Report from the Local Organising Committee, headed by his deputy, Rt.\nThe governor, who noted that the national sports competition has ignited the spirit of sportsmanship amongst young people, said the state set a new record in the hosting of the games.\nAccording to him, “I will talk on the issue of the outstanding N500 million that the Federal Government promised to contribute to the games.\nI want to thank the team for the discipline in procurement, management of finances and accountability."
  },
  {
    "headline": "Police gets new spokesperson, Olumuyiwa Adejobi, as Frank Mba proceeds on course at NIPSS",
    "summarized_story": "The Nigerian Police Force Public Relations Officer, CP Frank Mba, has handed over the duties and responsibilities of the Force Public Relations Department to his Deputy, CSP Olumuyiwa Adejobi, who takes charge of the Department with immediate effect, a statement from the force said at weekend.\nOlumuyiwa Adejobi, a Chief Superintendent of Police, according to the statement, is an alumnus of the prestigious University of Ibadan where he studied Archeology and Geography (Combined Honours).\nCSP Olumuyiwa is an experienced communicator and image manager who has achieved great strides in his previous appointments.\nHe is a member of several professional bodies and associations which include: Nigerian Institute of Public Relations (NIPR); International Public Relations Association (IPRA); Pointman Leadership Institute, USA; International Association of Chiefs of Police (IACP), USA; and the Institute of Corporate Administration, Nigeria.\nCSP Adejobi can be reached on cell phone number 08037168147 while he seeks support from all and sundary as he discharges his duties."
  },
  {
    "headline": "Sterling Bank Confers Heart Fellowship Awards on Five Tech Founders",
    "summarized_story": "Sterling Bank Plc, has awarded its HEART Fellowship to five (5) lucky tech founders to enable them to participate in the Founder Institute (FI) Lagos Spring Virtual 2022 Cohort.\nThe award recipients are Tech Founders who have demonstrated creativity and employed innovative solutions to tackle challenges in the HEART sectors.\nThe HEART sectors are Health, Education, Agriculture, Renewable Energy, and Transportation.\nSpeaking at the award ceremony in Lagos on Wednesday, Head, Business Growth and Partnerships with Sterling Bank, Mr. David Adebayo, said the HEART sectors represent the focus and strategy of the bank.\nThe recipients were informed that they will have access to fellow Founder Institute Lagos Alumni during the training program, along with exposure to founders from other markets across Africa."
  },
  {
    "headline": "Buhari appoints Sani Zorro SSA to First Lady, redeploys Kamal Abdulrahman, Hadi Uba, Wole Aboderin, sacks Zainab Kazeem",
    "summarized_story": "Those affected by the redeployment are: Dr. Mohammed Kamal Abdulrahman, Senior Special Assistant to the President on Health and Development Partners and Personal Physician to the First Lady; Hadi Uba, Special Assistant to the President on Administration and Wole Aboderin, Special Assistant to the President on Non-Governmental Organisations, NGOs.\nAlso approved with effect from 11th February is the disengagement of Zainab Kazeem, the Special Assistant to the President on Domestic and Social Events, Office of the First Lady.\nZorro, a famous journalist brings to the new job decades-long experience in media practice, publishing and unionist leadership.\nHe was at various times President, Nigeria Union of Journalists, NUJ, West African Journalists Association (WAJA) and the Federation of African Journalists, FAJ.\nHe was in the House of Representatives where he chaired the committee on Internally Displaced Persons (IDPs), Refugees and Initiatives on North East."
  },
  {
    "headline": "Climate change threat to food security in Nigeria – Dare",
    "summarized_story": "Nigeria’s minister of youth sports, Mr. Sunday Dare, has called on Nigerians to take issues of climate change seriously to tackle food insecurity and imbalances in the planet’s ecosystem.\nHe noted that climate change represents a threat to food security in the country.\n“Nigeria is not immune from the adverse effects of climate change.\nClimate change is increasingly threatening Nigeria’s ecosystem, with increasing desertification in the north, erosion in the east, ocean surge in places like Lagos, among others.\nA Nigerian born, British activist, Emeka Obasi Jnr, is leading an awareness campaign in this regard, through his NGO, Our Tomorrow."
  },
  {
    "headline": "Iranian Revolution @43: Strengthening Economic Development Amid Sanctions",
    "summarized_story": "The Ambassador of Iran to Nigeria, Mohammad Alibak reiterated this in a statement to mark the forty-third anniversary of the Iranian Revolution popularly called Iran’s National Day at the weekend.\nThe revolution also emboldened the people of Iran and possibly all freedom seekers in the world to assert themselves in world affairs.\nBut the will and resilience of the great and proud nation of Iran was and is, stronger than their schemes.\nUnder the Barack Obama administration in the US, Iran reached a nuclear deal with five world powers, which inspired confidence about the resolution of the nuclear saga.\nThey used economic terrorism against the Iranian people, a clear example of which was to prevent drugs from entering the country during the Coronavirus epidemic."
  },
  {
    "headline": "Osun 2022: God Of Our Ancestors Is With You, Oba Olubosin Tells Oyetola",
    "summarized_story": "This is even as the Apetumodu of Ipetumodu, Oba Olusegun Joseph Oloyede, the Salu of Edunabon, Oba Kehinde Oladepo and other traditional rulers pledged their loyalty and support for the Governor to serve the state for second term.\nGovernor Oyetola had in the last two weeks embarked on a strategic engagement tour to familiarise with the newly-elected executives of the All Progressives Congress (APC) at the grassroots.\nADVERTISEMENTSpeaking on behalf of the traditional rulers in Ife-South Local Government Area, Olubosin of Ifetedo Kingdom, Oba Akinola Akinrera, extolled Governor Oyetola for the good works his administration has done to transform the state.\nOba Oladepo who represented the Chairman of the Traditional Council in the Local Government and Apetumodu of Ipetumodu, Oba Olusegun Joseph Oloyede, commended the Governor for being faithful to his electoral promises.\nADVERTISEMENTAddressing the traditional rulers and members of his party, Governor Oyetola said his administration was committed to taking the state to enviable heights ever known in history."
  },
  {
    "headline": "Students Reject Makinde’s Move To Rename LAUTECH",
    "summarized_story": "Students of Ladoke Akintola University of Technology (LAUTECH), Ogbomoso, Oyo State have rejected the decision of the state governor, Seyi Makinde, to rename the institution.\nThe governor had recently sent a bill to the state assembly on the proposed renaming of Ladoke Akintola University of Technology (LAUTECH) to Ladoke Akintola University (LAU).\nOn Monday, February 7, 2022, NUC visited our dear institution, LAUTECH, for the proposed Departments of English and Literacy studies, Philosophy, Hospitality and Tourism Management, Sociology, and History.\nHence, there is no need to hide under the so-called change to conventional university as this doesn’t have any effect on the name.\n“A case study is Enugu State University of Technology, ESUT, which is offering some of these conventional university courses yet retained her technology name."
  },
  {
    "headline": "Students Reject Makinde’s Move To Rename LAUTECH",
    "summarized_story": "Students of Ladoke Akintola University of Technology (LAUTECH), Ogbomoso, Oyo State have rejected the decision of the state governor, Seyi Makinde, to rename the institution.\nThe governor had recently sent a bill to the state assembly on the proposed renaming of Ladoke Akintola University of Technology (LAUTECH) to Ladoke Akintola University (LAU).\nOn Monday, February 7, 2022, NUC visited our dear institution, LAUTECH, for the proposed Departments of English and Literacy studies, Philosophy, Hospitality and Tourism Management, Sociology, and History.\nHence, there is no need to hide under the so-called change to conventional university as this doesn’t have any effect on the name.\n“A case study is Enugu State University of Technology, ESUT, which is offering some of these conventional university courses yet retained her technology name."
  },
  {
    "headline": "2023: Tinubu Visits Alake, Awujale, Seeks Ogun Monarchs’ Royal Blessings",
    "summarized_story": "Addressing the convergence of other Egba chiefs, after his private meeting with Alake, the APC national leader disclosed that he informed President Muhammadu Buhari about his presidential ambition just to “step into his shoes and not to step on his toes”.\nI have contested with the support of the people for the Senate and I won at the youngest age ever.\n“The people said, this time around, I should run for the President of the Federal Republic of Nigeria.\nI told them that we have elected someone there and I don’t want to pull the carpet from his feet.\nADVERTISEMENT“I want to seek the permission of the kabiyesi, I want to seek his blessings and his prayers and seek the blessings of other chiefs."
  },
  {
    "headline": "It's time for the North to pay back Tinubu: Shettima",
    "summarized_story": "A former governor of Borno State, Senator Kashim Shettima, has said this is the time for the North to support the presidential ambition of the national leader of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu.\nShettima said Tinubu did a lot in actualising the long-time ambition of President Muhammadu Buhari, who defeated President Goodluck Jonathan of the Peoples Democratic Party (PDP).\nBuhari and Tinubu are believed to be the two most important men whose agreement to form the APC, in 2013, and subsequent collaboration led to the Buhari presidency.\nShettima said Tinubu had supported President Buhari through thick and thin, and one good turn always deserves another.\nIt was Asiwaju Bola Tinubu that provided him with a sanctuary and platform to contest the 2007 presidential election."
  },
  {
    "headline": "Saudi Arabia gives $80B of Aramco stocks to sovereign Public Investment Fund",
    "summarized_story": "Saudi Arabia said Sunday it will transfer 4% of the stock in the state-run oil giant Aramco to its sovereign Public Investment Fund.\nThe Public Investment Fund has been Prince Mohammed’s vehicle to invest in everything from Uber to British soccer team Newcastle United.\nThe Public Investment Fund also has invested in the electric car manufacturer Lucid Motors Inc. of Newark, California.\nSaudi Arabia offered a sliver of shares of the oil firm on Riyadh’s Tadawul stock market in 2019.\nA share of Aramco stood at 37.3 Saudi riyals, or $9.94, ahead of trading Sunday."
  },
  {
    "headline": "FG creates healthcare fund to boost medicare",
    "summarized_story": "He explained that the fund was aimed at upgrading basic health care facilities in all the 774 local governments of the federation.\n“You will access healthcare as long as you are in the local community where the facility is and it is free.\nArabi said that a conference would soon be held on the basic health care provision fund to be chaired by the president.\n“And all the governors, the commissioners of finance and all the key players around the basic healthcare provision fund will be at the conference.\n“The National Health Insurance Scheme, Primary Health Care Development Agency, Ministry of Health and the development partners that have been working around basic healthcare provision fund will be there."
  },
  {
    "headline": "PDP canters ahead of Buhari's APC in Abuja Municipal Council",
    "summarized_story": "Christopher Zakka Mai Kalangu, the PDP chairmanship candidate is poised to deal a humiliating blow to the ruling APC, by winning the Abuja Municipal Area Council, famously called AMAC.\nThe party went into the election fractured following a legal battle for the chairmanship ticket between Dr Murtala Usman Karshi and Suleiman Gwagwa.\nAlthough final results are being awaited, the PDP candidate has won in seven out of eight wards declared for the council.\nThe APC candidate won massively in his Karshi ward, polling 1,477 votes to PDP’s 180 votes.\nBased on the results, Kalangu is cruising ahead with 11,494 votes against APC’s Dr Murtala Usman Karshi, who won 8,234 votes."
  },
  {
    "headline": "UPDATED: Death Toll Rises As Three-Storey Building Collapses In Lagos",
    "summarized_story": "Eyewitness accounts said the construction workers were at their various duty posts when the building collapsed on them.\nThe Director-General, Lagos State Emergency Management Agency (LASEMA), Olufemi Oke-Osanyintolu confirmed the incident but did not give further details on it.\nSurvivor Comes Out Of Collapsed Building In Lagos A survivor came out of a collapsed storey building in Lagos on Saturday.\nThe Saturday incident occurred barely three months after a 21-storey Ikoyi building collapsed in Ikoyi area of Lagos killing many people.\nDeveloper ArrestedThe Lagos State government says it has arrested the developer of the three-storey building under construction that collapsed at No."
  },
  {
    "headline": "JUST IN: President Buhari Appoints New Personal Physician For First Lady",
    "summarized_story": "JUST IN: President Buhari Appoints New Personal Physician For First LadyPresident Muhammadu Buhari has approved the appointment of Dr. Zabah Muhammad Jawa as Personal Physician to the First Lady, Mrs. Aisha Muhammadu Buhari.\nThe President also approved the appointment of A’isha Rimi, a law graduate of the University of Buckingham in England as the Senior Special Assistant to the President on Legal Matters, Office of the First Lady.\nThe appointments were disclosed via a statement issued by the Senior Special Assistant to the President on Media and Publicity, Mallam Garba Shehu.\nThe statement explained that, “A’isha is a resourceful administrative executive and a founding partner at Africa Law Practice, a commercial law firm in Nigeria.”It further said, “The President has also approved the appointment of Dr. Zabah Muhammad Jawa as Personal Physician to the First Lady.\nJawa is a Senior Consultant in Nuclear medicine and European Certified in Nuclear Medicine."
  },
  {
    "headline": "BREAKING: Fire Guts Sheikh Gumi’s Residence In Kaduna",
    "summarized_story": "Sheikh Ahmad Gumi, a Kaduna-based Islamic cleric, had his home destroyed by fire.\nThe cause of the fire outbreak is not known as at the time of filing this report, however, a source who sought for anonymity, told DAILY POST that the fire started at the section of the Islamiyya School.\nAccording to the source, “We just saw smoke coming out from one of the classes.\nWe immediately drew the attention of the people around and started fetching water to prevent the fire from reaching the other buildings.”Details later…"
  },
  {
    "headline": "JUST IN: Another Storey Building Collapses In Lagos",
    "summarized_story": "JUST IN: Another Storey Building Collapses In LagosA 3 storey building located in Akanbi Crescent, Yaba area of Lagos state has collapsedAccording to reports, section of the building which is still under construction collapsed onto another building beside it.\nWhile the cause of the collapse is not yet known, an eye witness who spoke with the media said a part of the building had collapsed last year.\nShe disclosed that the construction went ahead despite the collapse as no appropriate authorities weighed into the matter.\nThis comes few months after a 21-storey building collapsed at Ikoyi area of the state.\nAs of last count by the Lagos state government, a total of 46 deaths were confirmed from the incident."
  },
  {
    "headline": "[Official] FCT council election: Like Kuje, Bwari, INEC declares PDP winner in AMAC",
    "summarized_story": "Like it did in Kuje and Bwari Area Councils, the Peoples Democratic Party (PDP) has won the Chairmanship election held on Saturday in the Abuja Municipal Area Council (AMAC), in the FCT Area Council election.\nThere are 12 wards in AMAC, including Gwagwa, City Centre, Garki, Kabusa, Wuse, Gwarinpa, Jiwa, Gui, Karshi, Orozo, Karu and Nyanya.\nHowever, the All Progressives Congress (APC) won in only Wuse and Karshi wards, leaving the PDP to win the remaining 10 wards.\nDetails below:Collation of election results for AMAC.\nNYANYA WARDREGISTERED VOTERS : 53, 263ACCREDITED VOTERS: 3301APC: 1,199PDP: 1,861JIWA WARDREGISTERED VOTERS :43, 572ACCREDITED VOTERS : 2831APC: 1,224PDP : 1,429GUI WARDREGISTERED VOTERS : 27,378ACCREDITED VOTERS : 2591APC : 834PDP: 1606KARSHI WARDREGISTERED VOTERS : 13,943ACCREDITED VOTERS : 1678APC: 1,477PDP: 180Reports of Snatching of Chairmanship ballot box and malfunctioning of BVASGWAGWA WARDREGISTERED VOTERS : 39,960ACCREDITED VOTERS : 2952APC: 1,158PDP : 1,624OROZO WARDREGISTERED VOTERS : 30, 417ACCREDITED VOTERS : 1051APC: 335PDP: 674Reports of attacks at the collation centre, two people were killed and others injuredCITY CENTER WARDREGISTERED VOTERS : 74, 245ACCREDITED VOTERS : 2360APC: 1,093PDP: 1,137Reports of attack on INEC officials who were reportedly beaten upGARKI WARDREGISTERED VOTERS : 86,109ACCREDITED : 4,385APC: 914PDP : 2,983KARU WARDREGISTERED VOTERS : 59,485ACCREDITED VOTERS: 2,857APC: 863PDP: 1,848GWARIMPA WARDREGISTERED VOTERS: 99,384ACCREDITED VOTERS : 4,953APC: 2,086PDP: 2,609WUSE WARDREGISTERED VOTERS :88070ACCREDITED VOTERS :1897APC: 933PDP : 857KABUSA WARDREGISTERED VOTERS: 71,448ACCREDITED VOTERS : 4,154APC: 1,124PDP: 2,494Total votesPDP: 19,302APC: 13,240Following the conclusion of the collation, the Retuning Officer, Professor Sani Saka, declared the PDP candidate, Christopher Zakka, winner of the election, having polled 19,302, against the candidate of the APC, Mr Murtala Karshi, who polled 13,240."
  },
  {
    "headline": "[Breaking] FCT council election: INEC declares PDP winner in Bwari",
    "summarized_story": "The Candidate of the Peoples Democratic Party (PDP), Mr John Gabaya, has been declared winner of the Chairmanship election in Bwari Area Council of the Federal Capital Territory (FCT).\nThe Returning Officer for the chairmanship election in Bwari, Professor Amuche Madu, declared Mr Gabaya winner as he polled 13,045 to defeat his closest rival, Mr Haruna Shekwolo, of All Progressives Congress (APC), who scored 7,697.\nMr Gabaya was then returned elected, having met the requirements of the constitution and the electoral law.\nDetails loading…"
  },
  {
    "headline": "[Happening now] FCT Area Council election: INEC begins collation of results for AMAC as APC wins in Gwagwalada",
    "summarized_story": "The Independent National Electoral Commission (INEC) has commenced collation of results for the Abuja Municipal Area Council (AMAC) in the FCT Area Council election.\nThe Returning Officer, Professor Sani Saka, said results on the Chairmanship election have been collated from only seven, out of the 12 wards in the council.\nThe wards whose results have been collated so far include:Nyanya Ward 011Jiwa Ward 006Gui Ward 07Karshi Ward 08Gwagwa Ward 12Orozo Ward 09City Center ward 001As of 8am, INEC officials were still awaiting results from five wards before final collation and announcement of results.\nMeanwhile, the chairmanship candidate of the All Progressives Congress, Abubakar Jibrin Giri, has been declared winner of Gwagwalada Area Council in the Saturday council elections.\nHowever, PDP beat APC in six out of the ten wards in the council."
  },
  {
    "headline": "Four Dead Bodies Recovered From Collapsed Lagos Building, Developer Arrested",
    "summarized_story": "Four dead bodies have been recovered from the collapsed building in the Yaba area of Lagos State, just as the property developer was arrested.\nThe recovered bodies were some of the people working at the building site before it collapsed on Saturday at NO.16 Akanbi Crescent.\nFollowing the incident, the Lagos State Government said it has arrested the developer of the property.\nThe Lagos State Government has arrested the developer of a collapsed building at No.\n@jidesanwoolu @drobafemihamzat @idreezsalako @ud_mpp @gbenga_omo @hmokunola_ pic.twitter.com/iNrObWU44x — The Lagos State Govt (@followlasg) February 13, 2022[READ ALSO] Ikoyi Building Collapse: Mistakes Were Made From All Angles – Sanwo-OluSaturday’s incident is the latest in the rising cases of building collapse in Lagos State."
  },
  {
    "headline": "SERAP Sues Buhari, Lai Over ‘Failure To Publish Copy Of Agreement With Twitter’",
    "summarized_story": "Socio-Economic Rights and Accountability Project (SERAP) has filed a lawsuit against President Muhammadu Buhari over “the failure to publish a copy of the agreement the Federal Government recently signed with Twitter, Inc, and the failure to publish the details of the terms and conditions of any such agreement”.\nBut in suit number FHC/L/CS/238/2022 filed last Friday at the Federal High Court, Lagos, SERAP is asking the court to “direct and compel President Buhari and Alhaji Lai Mohammed to release and widely publish a copy of the agreement with Twitter, and the terms and conditions of any such agreement”.\nSERAP is also arguing that “Publishing the agreement with Twitter would promote transparency, accountability, and help to mitigate threats to Nigerians’ rights online, as well as any interference with online privacy and freedom of expression”.\nSERAP is also seeking “an order of mandamus to direct and compel President Buhari and Alhaji Lai Mohammed to clarify the manner and scope in which the agreement with Twitter will be enforced, and whether the agreement incorporates respect for constitutional and international human rights”.\nThese open-ended terms and phrases may be used to suppress the legitimate exercise of human rights online."
  },
  {
    "headline": "Israel Adesanya Beats Whittaker, Retains UFC Middleweight Belt",
    "summarized_story": "Israel Adesanya has defeated Robert Whittaker with a unanimous decision (48-47, 48-47, 49-46) in the main event of UFC 271 on Saturday night at Toyota Center.\nThis is the second time Adesanya will clash with Whittaker, his arch-rival at the Toyota Center in Houston, Texas.\nWhittaker got a chance at revenge on Sunday morning but failed.\nAdesanya employed his length and reach to counter Whittaker’s boxing, ensuring he left the Octagon with his middleweight belt.\nBut the fight was very close, so much so that the crowd booed the decision, thinking Whittaker was the rightful winner."
  },
  {
    "headline": "NDLEA Detains Indian Businessman Over 134,700 Bottles Of Codeine Smuggled Into Nigeria",
    "summarized_story": "An Indian businessman, Vyapak Nutal, has been taken into custody for interrogation by operatives of the National Drug Law Enforcement Agency, NDLEA, over the smuggling of 134,700 bottles of Codeine syrup into the country through the land border between Nigeria and the Niger Republic in Sokoto State.\nCredible intelligence revealed that Nutal began to look for buyers for the controlled drug.\nWhile operatives were on his trail, officers of the Department of State Security apprehended him and swiftly handed him over to NDLEA on Wednesday 10th February 2022.\nNo less than 25 kilograms of Methamphetamine, Tramadol, Cannabis, and Khat concealed in motor parts, MP3 player, speaker, and fabrics heading to the USA, UK, Australia, Dubai, and Madagascar were seized at three major courier companies in Lagos.\nThis followed the arrest of Aliu Salami, 43, with 143.9kg cannabis at Oke-Ata, Abeokuta South LGA, Ogun state on Wednesday 9th Feb."
  },
  {
    "headline": "Two Suspected Ritualists Set Ablaze In Ogun, Police Warn Against Jungle Justice",
    "summarized_story": "Two suspected ritualists have been set ablaze in Oja Odan, Yewa North Local Government Area of Ogun State.\nPolice Public Relations Officer in the state, Abimbola Oyeyemi, disclosed this via a statement issued on Sunday, warning Ogun residents are against taking the laws into their hands.\nREAD ALSO: 18-Year-Old Adeoye Charged With Murder In LondonHe, therefore, warned that the Ogun State Police Command will not tolerate such barbaric and unlawful action.\nOn his part, the Commissioner of Police in the state, Lanre Bankole, ordered a full-scale investigation into the incident with the view to bringing to justice those who participated in the act.\nHe also appealed to members of the public to have confidence in the nation’s criminal justice system and desist from self-help as such is alien to the laws of the land."
  },
  {
    "headline": "Tinubu visits Awujale, informs him of his presidential ambition",
    "summarized_story": "National leader of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu has paid a courtesy visit to the Awujale of Ijebuland, Oba Sikiru Adetona in Ijebu Ode, Ogun State.\nAsiwaju Bola Tinubu said the essence of the visit is to officially inform the paramount ruler of Ijebu land his intention to run for the position of President of Nigeria in the 2023 Presidential election.\nAdvertisement"
  },
  {
    "headline": "Senator Philip Aduda raises concern over BVAS Operation",
    "summarized_story": "The Senator representing Federal Capital Territory has raised concerns over the functionality of the Bimodal Voting Accreditation System, BVAS.\nPhillip Aduda enjoins INEC to get its act right ahead the 2023 general election.\nAdvertisementHe spoke after casting his vote at the Polling units 004 in Karu.\nWhile he describes his accreditation and voting process as seamless, the lawmaker said reports reaching him from other parts of the nation’s capital are not palatable regarding the BVAS."
  },
  {
    "headline": "APC CECPC Notifies National Convention of Proposed Amendments to Constitution -",
    "summarized_story": "In accordance with Article 30 (iii) of the All Progressives Congress (APC) Constititution, the Governor Mai Mala Buni-chaired Caretaker/Extraordinary Convention Planning Committee (CECPC) has served a notice of proposed amendments to the Party’s Constitution on members of the National Convention.\nArticle 30 (iii) stipulates that the notice is served at least fourteen (14) days before the date of the National Convention at which the proposed amendments is to be considered.\nAdvertisementAPC Constitution 2014 has been in effect for almost eight years and together with judgments from Courts of competent jurisdiction, administrative experiences have revealed flaws in the Constitution.\nIt became imperative to conduct a review of the Party’s Constitution.\nThe Caretaker/Extraordinary Convention Planning Committee established a Constitution Review Committee under the chairmanship of Prof. Tahir Mamman OON, SAN to thoroughly review the Constitution in accordance with Article 30 which provides for Constitutional amendments."
  },
  {
    "headline": "FCT Council Polls: Ortom vows to resist any form of rigging",
    "summarized_story": "The Benue State Governor Samuel Ortom has vowed to resist any form of rigging or manipulation in Saturday’s Abuja territory elections.\nAdvertisementLast minute preparation for Saturday’s Abuja territory elections necessitated this gathering of critical stakeholders of the country’s main opposition party at the instance of the campaign council Chairman.\nHe quickly goes into the business of the day by setting the tone for the closed door session.\nAdvertisementAccording to him the ruling party has made their job pretty simple by its abysmal performance.\nThe meeting was attended by Governor’s of Benue ,Oyo, Bauchi and Rivers State as well as Senators, former Governor’s, former Senators and other party leaders."
  },
  {
    "headline": "Nigeria: Shake-up in Aso Villa as Buhari Sacks First Lady’s Aide, Redeploys Three Others",
    "summarized_story": "President Muhammadu Buhari has approved the sack of one aide of the First Lady, Aisha Buhari and the redeployment of three others.\nHe also approved the appointment of former President of the Nigerian Union of Journalists (NUJ), Mallam Sani Zorro, as media aide to the First Lady.\nBuhari has also approved the appointment of two more personal aides to Aisha.\nBuhari has also approved the appointment of two more personal aides to the First Lady.\nRimi, is a resourceful administrative executive and a founding partner at Africa Law Practice, a commercial law firm in Nigeria."
  },
  {
    "headline": "Nigeria: No Winner, No Loser in Nullification of Executive Order 10, Senior Lawyers Say – Arise News",
    "summarized_story": "The move it was believed would curtail the alleged dominance of the state executive over the two other arms of government.\nBut the states through theirAttorneys-General swiftly approached the court to challenge the legality of the presidential order, insisting that it was unconstitutional and should be voided.\nAccording to the majority decision, the Executive Order 10 was inconsistent with the 1999 Constitution and therefore unconstitutional, illegal, null and void and of no effect whatsoever.\nHe however, agreed with the majority judgment that since the Constitution has covered the field, the Executive Order 10 made by the President becomes unnecessary.\nState governors over the years have always hijacked the funds of the judiciary and they will now be giving pittance to judiciary as if doing them a favour."
  },
  {
    "headline": "Nigeria: APC Begins Sale of Forms on Monday Ahead of National Convention",
    "summarized_story": "The All Progressives Congress (APC) will on Monday commence the sale of forms to all aspirants vying for national offices ahead of the party’s national convention slated for February 26.\nThe party said: “Sale of Forms to all aspirants vying for National Offices (APC National Secretariat) – 14/02/2022.\nHowever, there appears to be cracks in the Progressives Governors’ Forum over the choice of a consensus national chairman.\nIt was learnt that the two governors presented their choice to the Presidency but other APC governors rejected the choice.\nYari, who spoke through his Chief of Staff, Mr. Abdulkarim Tsafe, told THISDAY that he would prefer an elective convention."
  },
  {
    "headline": "Chelsea Become Club World Champions as Late Havertz Penalty Ends Palmeiras’ Resistance",
    "summarized_story": "In less than a year, he’s crowned Chelsea champions of both Europe and the world.\nFinally, owner Roman Abramovich, who was in attendance, has got his hands on the Club World Cup trophy, making it 20 titles in 19 years of the Russian’s rule.\nN’Golo Kante can now boast of being a world champion for club and country, while Cesar Azpilicueta became the first Chelsea player to complete a clean sweep of honours.\nTuchel and his players will now be targeting more silverware, with Chelsea set to face Liverpool in the Carabao Cup final later this month.\nHe understands how things work at the club and he has every chance of staying longer than the 18 months Chelsea managers average under Abramovich."
  },
  {
    "headline": "Nigeria Rejects Two Cargoes of Adulterated Petrol Imported from Belgium",
    "summarized_story": "Following the circulation of adulterated petrol in Nigeria, which damaged vehicle engines last week, the federal government has turned back two tankers carrying petrol loaded in Antwerp, Belgium, and destined for Lagos.\nGroup Managing Director of the NNPC, Mallam Mele Kyari, however, stated that from his investigation, the four petrol cargoes were imported by MRS, Emadeb/Hyde/AY Maikifi/Brittania-U Consortium and Oando.\nEach consortia THISDAY learnt, receives some quantities of crude oil in exchange for petrol.\nRussia delivers Europe with one-third of its natural gas needs and exports around 2 million bpd of both crude oil and refined products to European nations.\nThis was in contrast to December 2021, when it pumped 1.197 million barrels per day and November when it was only able to produce 1.275 million bpd."
  }
]