[
  {
    "headline": "Twin pregnancy delivery should be in hospital, supervised by experts –Gynaecologist",
    "summarized_story": "According to the gynaecologist, the need to have the delivery of twins in a hospital and under the supervision of competent caregivers is to ensure the risks associated with a twin pregnancy and childbirth are effectively managed.\nAccording to Dr. Magashi, women pregnant with twins or more babies require more care, noting that twin pregnancy and delivery are high-risk.\nThe maternal health expert said, “Twin gestation is a high-risk pregnancy.\nGiving insight into other risks associated with twin pregnancy, the gynaecologist said, “As the pregnancy progresses, there will be an increase in special symptoms as she will be complaining about the excessive heaviness of the tummy.\nHe cautioned that if the complications associated with twin gestation are not well managed, it could lead to the death of the woman."
  },
  {
    "headline": "Twin pregnancy delivery should be in hospital, supervised by experts –Gynaecologist",
    "summarized_story": "According to the gynaecologist, the need to have the delivery of twins in a hospital and under the supervision of competent caregivers is to ensure the risks associated with a twin pregnancy and childbirth are effectively managed.\nAccording to Dr. Magashi, women pregnant with twins or more babies require more care, noting that twin pregnancy and delivery are high-risk.\nThe maternal health expert said, “Twin gestation is a high-risk pregnancy.\nGiving insight into other risks associated with twin pregnancy, the gynaecologist said, “As the pregnancy progresses, there will be an increase in special symptoms as she will be complaining about the excessive heaviness of the tummy.\nHe cautioned that if the complications associated with twin gestation are not well managed, it could lead to the death of the woman."
  },
  {
    "headline": "WHO to conduct training on integration of oral cholera vaccine in Abuja",
    "summarized_story": "The World Health Organisation says it will conduct a hybrid training in Abuja from April 25 to 29 for health professionals emphasizing the importance of integrating the Oral Cholera Vaccine (OCV) as an option.\nWHO Regional Director for Africa, Dr. Matshidiso Moeti, said in a statement, that the vaccine would help for emergency and preventive cholera outbreaks in endemic countries.\n“The increasing use of the vaccines will complete other interventions, including water, sanitation and hygiene, for prevention and control of cholera outbreaks.\nAccording to her, the Global Task Force on Cholera Control (GTFCC) is a global network of organizations that brings together partners involved in the fight against cholera across all sectors.\n“The GTFCC provides a framework to support countries in intensifying efforts to control cholera,” she said."
  },
  {
    "headline": "WHO to conduct training on integration of oral cholera vaccine in Abuja",
    "summarized_story": "The World Health Organisation says it will conduct a hybrid training in Abuja from April 25 to 29 for health professionals emphasizing the importance of integrating the Oral Cholera Vaccine (OCV) as an option.\nWHO Regional Director for Africa, Dr. Matshidiso Moeti, said in a statement, that the vaccine would help for emergency and preventive cholera outbreaks in endemic countries.\n“The increasing use of the vaccines will complete other interventions, including water, sanitation and hygiene, for prevention and control of cholera outbreaks.\nAccording to her, the Global Task Force on Cholera Control (GTFCC) is a global network of organizations that brings together partners involved in the fight against cholera across all sectors.\n“The GTFCC provides a framework to support countries in intensifying efforts to control cholera,” she said."
  },
  {
    "headline": "2023: Adebanjo, Clark, govs dialogue on Igbo presidency",
    "summarized_story": "By Omeiza Ajayi, AbujaElder statesman and Afenifere leader, Pa Ayo Adebanjo and South-South leader, Chief Edwin Clark, alongside other eminent Nigerians are set to participate in a dialogue aimed at making a stronger advocacy for a Nigerian President of Igbo extraction in next year’s general election.\n“It is dedicated towards awakening the best ethnic and political fraternities of Nigerians to appreciate the binding need for accommodation and sacrifice, in supporting a Nigerian President from the South-East region of Nigeria come 2023 elections.\n“Hear him in clear sync with the GNC project: ‘No one in Nigeria can deny the fact that Ndigbo are zealous, patriotic and committed to the oneness of Nigeria.\nAll that they demand is a level playing field for all of us to operate and compete’.\n“‘That same underlying love for the country that inspired them to do what they did for the Southwest in 1999, should inspire them to do the same for the Southeast in 2023′."
  },
  {
    "headline": "CONSUMER RELATIONS: Rite Foods preaches uprightness to Muslim faithful at Ramadan",
    "summarized_story": ",Rite Foods, a truly world-class and proudly Nigerian food and beverage company, has continued in its consumer-centric approach to celebrating with the Muslim faithful as they observe the Ramadan fasting in fulfilment of the fourth pillar of Islam.\nThe company with its award-winning brands has also continued in its resolve to provide its quality products to the Muslim faithful for refreshment and enjoyment at this special moment and all occasions of great celebrations.\nWhile admonishing them during this fasting period, the Managing Director of Rite Foods, Mr Seleem Adegunwa, wishes the Islamic believers which constitute part of its consumers, a happy celebration which is intended at ushering in peace and happiness for mutual co-existence.\nAdegunwa further prays that the guidance of Allah will continue to be with the Nigerian nation and its citizenry wherever they may be.\nShe vowed that Rite Foods will continue to ensure that consumers in all spheres of life and religion have a taste of its high-quality brands which have been the hallmark of distinctiveness in the industry it operates."
  },
  {
    "headline": "Okowa felicitates with Gov Ortom at 61",
    "summarized_story": "Governor Ifeanyi Okowa of Delta has congratulated his Benue counterpart, Mr Samuel Ortom, as he turned 61.\nIn a statement by his Chief Press Secretary, Mr Olisa Ifeajika, in Asaba, Okowa commended Ortom for his discernable determination and unalloyed commitment to the security and welfare of Benue people.\nHe commended Ortom for his laudable efforts at developing Benue and for his remarkable contributions to the development of Nigeria as a former minister.\nAccording to Okowa, Ortom had since assuming office as governor demonstrated immense courage and determination to protect the lives and property of Benue people.\n“On behalf of my family, the government and people of Delta, I congratulate an astute businessman, administrator, outstanding statesman and a consummate politician, Mr Samuel Ortom, on his 61st birth anniversary."
  },
  {
    "headline": "Tinubu, Umahi, Mohammed, Ngige, other presidential aspirants attend Aisha Buhari’s Iftar dinner",
    "summarized_story": "First Lady, Aisha BuhariBy Johnbosco AgbakwuruNational leader of the All Progressives Congress, APC, Asiwaju Bola Tinubu; Governors Dave Umahi of Ebonyi State; Bala Mohammed of Bauchi State and the Minister of Labour and Employment, Senator Chris Ngige, are among the presidential aspirants at the Iftar dinner hosted by the First Lady, Dr. Aisha Buhari.\nThe dinner took place at the Old Banquet Hall, Presidential Villa, Abuja.\nRecall that the First Lady had sent out invitation to all presidential aspirants of different political parties, ministers, governors and some other personalities for Ramadan Iftar dinner on Saturday.\nAs early as 6:20p.m., some of the expected dignitaries had started entering the venue of the event, which was slated to take off by 6:30 pm in the invitation cards.\nAlso present as at the time the event took off were Mallam Nasir el-Rufa’i of Kaduna State; Minister of Niger Delta Affairs, Godswill Akpabio; one-time National Chairman of the Peoples Democratic Party, PDP, Senator Barnabas Gemade; former Speaker of the House of Representatives, Yakubu Dogara, as well as the oil and gas mogul, Tein Jack-Rich."
  },
  {
    "headline": "PDP’s NEC meeting holds Wednesday",
    "summarized_story": "By Dirisu YakubuABUJA- The much awaited National Executive Committee, NEC, meeting of the Peoples Democratic Party, PDP, comes up on Wednesday, the 4th day of May, 2022.\nIn a statement signed by Senator Samuel Anyanwu, national secretary of the party, the meeting kicks off at the NEC hall, national headquarters of the party, Wuse, Zone 5, Abuja at 2PM.\nNEC at its 96th meeting is expected to take a final decision on behalf of the party on the zoning of its Presidential ticket, which has been hotly debated in the past few months amongst party stakeholders including governors elected on its platform, National Assembly members, Board of Trustees members and other layers of leadership.\nWhile the likes of former Vice President Atiku Abubakar, Governors Aminu Tambuwal (Sokoto) and Bala Mohammed (Bauchi) are of the opinion that an open ticket would make room for broad-based search for a Presidential flag bearer for the party in the 2023 election; Governor Nyesom Wike and his Akwa Ibom state counterpart, Udom Emmanuel argue in favour of the South producing the candidate for the party.\nThe Presidential primaries of the party is slated for May 28 this year."
  },
  {
    "headline": "Ortom, Abounu, Moro, others attend burial of Mrs. Obla",
    "summarized_story": "Governor Samuel Ortom and his Deputy, Engineer Benson Abounu, on Saturday, April 23, joined other dignitaries to witness the burial of Mrs. Judith Obla, wife of former chairman of Otukpo LGC, Chief Godwin Obla (SAN).\nIn his funeral oration, Governor Ortom poured encomiums on Mrs. Obla, describing her as his personal friend and a woman who related well with everyone, irrespective of their political affiliations.\nHe said that the presence of members of leaders of various political parties in the state is a sign how the family of Chief Obla lived a life by impacting others in the society.\nReverend Oyifioda called on all to live with eternity in mind by impacting lives of humanity.\nThe burial ceremony which took place at Ogobia, Ugboju in the Otukpo Local Government area was also attended by the Senator representing Benue South Senatorial District, Senator Abba Moro and other top political, military and the legal professions."
  },
  {
    "headline": "Alaafin of Oyo: He’ll be missed by Oduduwas – Ooni of Ife reacts to death of Oba Adeyemi",
    "summarized_story": "The Ooni of Ife, Oba Adeyeye Enitan Ogunwusi, on Saturday, mourned the death of the Alaafin of Oyo, Oba Lamidi Adeyemi.\nOoni of Ife said Adeyemi’s death was a loss to the entire Oduduwa race worldwide.\nThe monarch said the deceased would be missed for his imprints as a descendant of Oduduwa.\nThe statement read, “We have lost a great icon, a great monarch who saw Oyo through civilization and modern development without jettisoning the cultural sacredness of the throne first occupied by Alaafin Oranmiyan The Great.\nThe remains of the Alaafin of Oyo have since been taken to his palace for burial later today."
  },
  {
    "headline": "Alaafin: Fayemi pays tributes Oba Adeyemi",
    "summarized_story": "Ekiti State Governor, Kayode Fayemi, has extolled the virtues of the late Alaafin of Oyo, Oba Lamidi Olayiwola Adeyemi III, who passed on Friday, aged 83 years.\nFayemi said the departure of the revered monarch has created a big vacuum in the traditional institution in Oyo State in particular and Yoruba land in general.\nThe Governor, in a statement by his Chief Press Secretary, Yinka Oyebode, said the late Oba Adeyemi was a bridge builder, a patriot, courageous leader, who contributed to the unity of Nigeria in his lifetime.\nHe added that Oba Adeyemi earned much respect and accolades for his ability to speak truth to power, without playing to the gallery .\n“I, on behalf of the Government and good people of Ekiti State, commiserate with the Adeyemi family , the Alaafin – in- Council, the people of Oyo town and the Government of Oyo State on the passage of our highly revered Kabiyesi, Alaafin Oba Adeyemi."
  },
  {
    "headline": "Cable Equiano: Pantami, Danbatta pledge enabling policy environment for wider connectivity",
    "summarized_story": "The duo stated this on the sideline of the reception marking the landing of the Equiano undersea Cable System in Nigeria at the Open Access Data Centre at Lekki in Lagos.\nPantami and Danbatta commended Google LLC, the West Indian Ocean Cable Company (WIOCC), and other investors for bringing additional bandwidth capacity into the country to drive connectivity and growth.\nPantami also promised an enabling environment that encourages foreign and local investment in infrastructure projects such as the way Google and its co-investors have done.\nDanbatta expressed delight that Equiano has joined the list of other submarine cables at the shores of Nigeria, including SAT3 cable, MainOne cable, Glo1 cable, ACE cable WACS cable, Dolphin by Natcom, and MTN respectively.\nThe Chief Executive Officer (CEO) of WIOCC, Chris Wood, also described the landing of the submarine cables as a major investment in the Nigerian digital economy."
  },
  {
    "headline": "NCC, stakeholders brainstorm on blockchain’s benefits to economy",
    "summarized_story": "The Nigerian Communications Commission (NCC), stakeholders in the academia, the public sector and enthusiasts of technology for development, have deliberated on the benefits derivable from emerging technologies such as Blockchain, to advance the growth of the Nigerian economy.\nThe stakeholders, who spoke in turn at the workshop, acknowledged and profoundly appreciated the role of NCC in engendering a dynamic digital regulatory environment, the remarkable contribution to the growth and development of novel and emerging technologies, and NCC’s adoption of adaptive mechanisms that have enhanced emerging technologies in Nigeria.\nArabi asserted that Nigeria ranks third in Africa, in the use of telecommunications for public service delivery, coming behind South Africa and Egypt.\nArabi called on policymakers to ensure robust policy formulation that ensures improved digital literacy and increased automation in public service delivery.\nIn her contribution to the discourse, Okonkwo said adoption of Blockchain technology would be essential in documentation, archiving, cloud storage, identity management, and online education."
  },
  {
    "headline": "Umahi anoints Ebonyi Speaker as successor",
    "summarized_story": "Ebonyi Governor David Umahi has anointed Speaker Francis Nwifuru to succeed him in 2023.\nUmahi endorsed Nwifuru during the internment of father of Commissioner for Trade and Investment, Barrister Chioma Nweze in Okposi on Saturday.\nHe expressed hope the Speaker would consolidate on the divine mandate leadership in the State.\nUmahi appealed to people of Ebonyi South to support the Speaker for the sake of equity, justice and fairness.\n“To Okposi people and people of Ebonyi State, I present to you the choice of the people in the person of the Speaker of Ebonyi State House of Assembly, Rt."
  },
  {
    "headline": "17-year-old herder, 4 cows killed in Plateau",
    "summarized_story": "17-year-old Buhari Muhammad has been killed around Rangyel community of Bassa LGA of Plateau State.\nFour cows were also killed and injuries inflicted on five others in the incident.\nThe State Chairman of Gan Allah Cattle Breeders Association of Nigeria (GAFDAN), Abdullahi Garba, confirmed the incident.\nGarba explained that Muhammad was attacked when he took his cattle to graze and the gunmen suddenly opened fire on him.\nHowever, ASP Gabriel Ogaba, the spokesman of the police in the state, told The Nation that he was yet to get the information."
  },
  {
    "headline": "150 clubs, associations pay N50m for Zulum’s APC forms",
    "summarized_story": "A total of 150 social clubs, associations and professional bodies in Borno are combining to pay the N50 million needed to buy nomination forms for Gov.\nThe clubs and associations are seeking Gov.\n“The coalition was brought together by registered clubs and associations alongside professional bodies in academia, healthcare, marketing, transportation and women groups, among others.\nZulum,’’ Shettima said.\nThe News Agency of Nigeria (NAN) reports that up till Friday, no aspirant has indicated interest in Zulum’s seat on the platform of the APC."
  },
  {
    "headline": "JUST IN: Tinubu, Umahi, Mohammed, others at First Lady’s Iftar",
    "summarized_story": "JUST IN: Tinubu, Umahi, Mohammed, others at First Lady’s IftarGet real time updates directly on you device, subscribe now.\nDignitaries, including some presidential aspirants, are being hosted to Iftar dinner by the First Lady, Mrs Aisha Buhari, at the Old Banquet Hall of the Presidential Villa, Abuja.\nAs at 6:20pm, some of the dignitaries had started entering the venue of the event, which was slated to take off by 6:30pm in the invitation cards.\nThe First Lady had invited all presidential aspirants, across all political parties, to the Ramadan Iftar.\nAs of the time the event took off, All Progressives Congress (APC) stalwart, Asiwaju Bola Ahmed Tinubu; Governors Dave Umahi (Ebonyi) and Bala Mohammed (Bauchi) are among the presidential aspirants attending the event."
  },
  {
    "headline": "100 roasted in Rivers illegal refinery explosion.",
    "summarized_story": "Over 100 persons have been burnt beyond recognition at a major illegal oil refinery site located in Omoku, Ogba-Egbema-Ndoni Local Government Area, Rivers State.\nSources said the fire from the explosion spread rapidly and consumed everything and everybody at the site at a time many buyers of the illegal products arrived with their vehicles.\nThe source said: “It was one of the biggest illegal refinery sites in Rivers.\nThe Executive Director of YEAC, Fyneface Dumnamene Fyneface, said many vehicles that were waiting to buy the illegal products were also burnt.\n“We also call on the Rivers State government to reactivate the Committee on alternative livelihood opportunities for artisanal refiners headed by the Deputy Governor, Dr. Ipalibo Banigo."
  },
  {
    "headline": "Kalu extols virtues of Alaafin of Oyo, Oba Adeyemi",
    "summarized_story": "Former Governor of Abia State and Chief Whip of the Senate, Dr. Orji Kalu has described the demise of Alaafin of Oyo, Oba Lamidi Adeyemi III as a huge loss to Nigeria.\nThe former Governor while commiserating with the government and people of Oyo state, especially the royal household in Oyo kingdom, prayed to Allah to forgive the shortcomings of the late Oba Adeyemi and grant him al-Jannah Firdaus.\nHe said, “the passing of the Alaafin of Oyo, Oba Lamidi Adeyemi III is a big loss to the country.\n“The late monarch was an accomplished and outstanding personality, who was passionate about the progress of Oyo state and Nigeria in general.\nKalu prayed to Allah to give the family of the late monarch the fortitude to bear the loss."
  },
  {
    "headline": "Illegal bunkering: 150 persons roasted by fire in Imo",
    "summarized_story": "From George Onyejiuwa,OwerriNot less than 150 persons were Friday night roasted by fire break out at an illegal refinery at Abizi community in Egbema in Ohaji/Egbema council area of Imo State.\nThe state government has also declared one Okenze Onyenwoke , the alleged owner of the illegal refinery wanted .\nAdding , ” The activities of this illegal refineries have caused damages of the aquatic life and farmlands in our communities ,this is very unnecessary death “.\nOpiah disclosed that most of the illegal refineries are not indigenes of Ohaji/ Egbema council but from out side Imo state.\nThe stste government has declared one Okenze Onyenwaoke who is the owner of the illegal refinery wanted and he should make himself available to the police immediately”."
  },
  {
    "headline": "Hausa not enemy of Ndigbo – IPOB",
    "summarized_story": "“Those behind this madness are working with the Nigeria security to criminalize IPOB.\n“Biafrans shall never try to harm any Hausa man or woman in Biafra land for any reason.\nIPOB will ensure the protection of all persons living in Biafra land including non indigenes.\n“wish to state unequivocally that those behind these atrocities are not IPOB member nor are they Eastern Security Network operatives.\nNo member of IPOB will engage in acts inimical to the people we are struggling to liberate."
  },
  {
    "headline": "Just In: Alaafin of Oyo confirmed dead",
    "summarized_story": "From Oluseye Ojo, IbadanThe Alaafin of Oyo, Oba Lamidi Olayiwola Adeyemi III, has joined his ancestors at the age of 82 after reigning as king for 52 years.\nBode Durojaiye, confirmed to The Sun at 6:55a.m today Saturday April 23, 2022, that Oba Adeyemi is dead.\nThere are many people that have stormed the palace at Oke-Afin in Oyo town.\nOba Adeyemi was said to have gone to the teaching hospital for routine medical check-up before death allegedly caught up with him at the facility.\nHis paternal grandfather, according to historians, was Alaafin Adeyemi I Alowolodu, who ruled during the Kiriji War, and was the last independent ruler of the Oyo Empire before British colonialism."
  },
  {
    "headline": "LASG reopens Chrisland Schools as academic activities begins on Monday",
    "summarized_story": "By Gabriel DikeThe Lagos State Ministry of Education on Saturday directed that all Chrisland Schools shut for alleged misconduct of some pupils in Dubai be reopened from Monday April 25th, 2022.\nDo not miss the Vital Information, it goes off in 2 days!\nShe said the state government shut the schools for safety of students and the staff and to ensure unhindered investigation of the incident.\nAccording to her, the ministry of education and other relevant agencies of the state, in conjunction with the school’s Parent Teachers Association, will be working on a scheduled psychosocial support for the students.\nSaid she: “An extensive assessment of the school’s procedure, especially on external trips and excursions, is being made to identify safety gaps and prevent such incidents."
  },
  {
    "headline": "Breaking : Alaafin, Oba Lamidi Adeyemi, Dies at 83",
    "summarized_story": "By Kemi OlaitanThe Alaafin of Oyo, Oba Lamidi Adeyemi, is dead.\nAdeyemi, the third from the Alowodu Ruling House, died in the late hours of Friday at the Afe Babalola University Teaching Hospital, Ado Ekiti.\nThe monarch had been sick and a plan had been made to fly him abroad before he passed on late Friday night.\nA source familiar with the medical travel plan said his tickets and those of a few wives were already procured.\nWith the demise of Oba Adeyemi, it is now the turn of the Agunloye Ruling House to produce the next Oyo monarch as his predecessor, Bello Ladigbolu, was from the Agunloye House."
  },
  {
    "headline": "2023: Under Pressure Jonathan Hints at Contesting, Tells Supporters to ‘Watch out’",
    "summarized_story": "‘I cannot tell you I’m declaring; the political process is ongoing’Adedayo AkinwaleFormer President Goodluck Jonathan yesterday in Abuja came under intense pressure from his supporters, urging him to contest for president in 2023 and he did not disappoint, telling them that “the political process is ongoing; just watch out.\njust watch out.”The supporters, comprising largely women and youths, stormed the Jonathan Foundation’s Abuja office, chanting his name, forcing him to come out to address them.\nThe supporters, who demanded the return of Jonathan as President in 2023, arrived in four buses and displayed placards at Jonathan’s Taraba Close, Maitama office.\nSome of the placards read, “Goodluck declare now”; “We are sorry, Goodluck don’t abandon us, come back”; “Goodluck please come”; and “Goodluck we love you”, among others.\n“We want Jonathan to run under the Nigeria Peoples Party."
  },
  {
    "headline": "Osinbajo Takes Campaign to Ibadan, Upbeat about Becoming Next President",
    "summarized_story": "On arrival in Ibadan, the Vice President received a rousing reception right from the airport and on the streets by excited residents.\nComing after Osinbajo declared his intention to contest the 2023 presidential election on the platform of the APC last week Monday, the vice president intimated the Monarch of his intention to run for president.\nThe Vice President said: “I have followed you very closely.\nThe Deputy Governor also joined the vice president for the visit to the Olubadan.\nMembers of the National Assembly with the Vice President besides Folarin, included Senator Adamu Bukkachuwa, Kola Balogun, Fatahu Muhammad, Odebunmi Olusegun, Shehu Saleh Rijau and Karu Simon."
  },
  {
    "headline": "Northern PDP Consensus Arrangement Collapses, Tambuwal Pulls out, Set for Primary",
    "summarized_story": "Governor Aminu Tambuwal of Sokoto State has pulled out of the drive by the northern Peoples Democratic Party to produce consensus candidate for the 2023 presidential election.\nThis came just as news emerged that former Senate President Bukola Saraki and Bauchi State Governor Bala Mohammed had emerged PDP consensus candidates for the North.\nA statement by the Tambuwal Campaign Organization (TCO) Friday said the team met on Wednesday at Bauchi Governor’s Lodge in Abuja for a review and unanimously agreed that the consensus arrangement was not working.\nThe statement read: The attention of Tambuwal Campaign Organization (TCO) has been drawn to a news item that former Senate President, Bukola Saraki and Gov.\n“Members of the public should be reminded that what was canvassed for was a consensus candidate and not consensus candidates."
  },
  {
    "headline": "Buhari: Military Not Doing Enough to End Insecurity Despite Logistics Provided",
    "summarized_story": "Buhari frowned on the fact that his previous directives to the military to end insecurity in the country had not yielded much results.\nMonguno said there was no way the president would be happy, when people were being killed on a daily basis.\nThe NSA added that the president was of the belief that enough was not being done by the security agencies, despite the logistics being provided.\n“A lot of lives are being lost, the president is not happy about this situation, he’s made it very clear.\nHe condemned the recent spate of attacks on police officers, facilities and other police operational assets across the country."
  },
  {
    "headline": "EXCLUSIVE: Document Exposes How Wema Bank Officials Offered Policeman Bribe To Stop Investigation On N1.7billion Money Laundering, Fraud",
    "summarized_story": "“The culpability of WEMA Bank officers was further confirmed when the officers tried to bribe investigating officers with large envelopes that contained money.\nThe Executive Director of the Bank, Mr Wole Akinleye, was also invited and he tried hard to derail and stop the investigation.\nMeanwhile, the police has charged one Ojo Oladipupo, Chief Security Officer of Wema Bank Plc, to court for attempted bribery.\nSee Also Exclusive EXCLUSIVE: How Wema Bank Top Officials Used Redeemed Church Pastor’s Account For N1.7billion Money Laundering, Fraud“Guess what they do after, they now moved that N1.7billion from Adewole’s account into different bank accounts in tranches.\nIn January 2022, a group, Transparency Nigeria Group, asked the Central Bank of Nigeria to dismiss the Chief Executive Officer of Wema Bank, Ademola Ademise, over alleged fraud."
  },
  {
    "headline": "EXCLUSIVE: Document Exposes How Wema Bank Officials Offered Policeman Bribe To Stop Investigation On N1.7billion Money Laundering, Fraud",
    "summarized_story": "“The culpability of WEMA Bank officers was further confirmed when the officers tried to bribe investigating officers with large envelopes that contained money.\nThe Executive Director of the Bank, Mr Wole Akinleye, was also invited and he tried hard to derail and stop the investigation.\nMeanwhile, the police has charged one Ojo Oladipupo, Chief Security Officer of Wema Bank Plc, to court for attempted bribery.\nSee Also Exclusive EXCLUSIVE: How Wema Bank Top Officials Used Redeemed Church Pastor’s Account For N1.7billion Money Laundering, Fraud“Guess what they do after, they now moved that N1.7billion from Adewole’s account into different bank accounts in tranches.\nIn January 2022, a group, Transparency Nigeria Group, asked the Central Bank of Nigeria to dismiss the Chief Executive Officer of Wema Bank, Ademola Ademise, over alleged fraud."
  },
  {
    "headline": "Alaafin Of Oyo Told Us His Forefathers Were Calling Him Two Weeks Ago --Aide",
    "summarized_story": "The Alaafin of Oyo, Oba Lamidi Adeyemi III, had a premonition of his death, an aide of the palace has claimed.\nThe palace worker urged people to find solace in the fact that the late monarch lived a worthy life.\n“Two weeks ago, he called and told us that his late father was calling him to come.\nWe are happy to have him as the Alaafin.”Meanwhile, the Janazah (funeral) prayer has been conducted on the remains of the late Alaafin at the ancient palace in Oyo Town.\nAdeyemi, who was born on October 15, 1938, succeeded Oba Gbadegesin Ladigbolu I as Alaafin on November 18, 1970."
  },
  {
    "headline": "Alaafin Of Oyo Told Us His Forefathers Were Calling Him Two Weeks Ago --Aide",
    "summarized_story": "The Alaafin of Oyo, Oba Lamidi Adeyemi III, had a premonition of his death, an aide of the palace has claimed.\nThe palace worker urged people to find solace in the fact that the late monarch lived a worthy life.\n“Two weeks ago, he called and told us that his late father was calling him to come.\nWe are happy to have him as the Alaafin.”Meanwhile, the Janazah (funeral) prayer has been conducted on the remains of the late Alaafin at the ancient palace in Oyo Town.\nAdeyemi, who was born on October 15, 1938, succeeded Oba Gbadegesin Ladigbolu I as Alaafin on November 18, 1970."
  },
  {
    "headline": "Buhari, Governors Need To Act Fast Because Nigerians Are Angry, Sad —Catholic Archbishop Of Abuja, Kaigama",
    "summarized_story": "The cleric made the call on Saturday while addressing the maiden general congress of the indigenous people of the Catholic Archdiocese of Abuja.\nFile Photo of the Archbishop of Abuja, Ignatius KaigamaHe stated that Nigerian people were sad, angry and frustrated with the situation of the country.\n“I call on our leaders to rethink and know that there is God and He is watching.\nIt is not just about aspiring to gain access to the wealth of the nation and use it in a very arbitrary manner.\nWe elected our political leaders to provide these, and they promised to do so, but we are dismayed that they are so incapable and unwilling to provide these basics for the people.”"
  },
  {
    "headline": "Gunmen abduct ‘10 Miyetti Allah members’ in Anambra",
    "summarized_story": "Gunmen have reportedly abducted 10 members of the Miyetti Allah Cattle Breeders Association of Nigeria (MACBAN) in Ogbaru LGA of Anambra state.\nAdvertisementCommenting on the incident, Tochukwu Ikenga, Anambra police spokesperson, told TheCable that the command will spare no effort to ensure that the assailants are brought to justice.\nOn Wednesday, a police divisional headquarters in Anaku, Anyamelum area of the state, was attacked by gunmen.\nAdvertisementOn April 18, five persons returning from a traditional wedding ceremony were abducted by gunmen in Akpo-Nkpologwu road in Aguata LGA of the state.\nDays before the abduction of the wedding guests, gunmen attacked a police checkpoint in Aguata LGA, which resulted in three officers sustaining injuries."
  },
  {
    "headline": "Gunmen abduct ‘10 Miyetti Allah members’ in Anambra",
    "summarized_story": "Gunmen have reportedly abducted 10 members of the Miyetti Allah Cattle Breeders Association of Nigeria (MACBAN) in Ogbaru LGA of Anambra state.\nAdvertisementCommenting on the incident, Tochukwu Ikenga, Anambra police spokesperson, told TheCable that the command will spare no effort to ensure that the assailants are brought to justice.\nOn Wednesday, a police divisional headquarters in Anaku, Anyamelum area of the state, was attacked by gunmen.\nAdvertisementOn April 18, five persons returning from a traditional wedding ceremony were abducted by gunmen in Akpo-Nkpologwu road in Aguata LGA of the state.\nDays before the abduction of the wedding guests, gunmen attacked a police checkpoint in Aguata LGA, which resulted in three officers sustaining injuries."
  },
  {
    "headline": "ICYMI: I'm still agile and most likely to win presidency in 2023, says Atiku",
    "summarized_story": "Former Vice-President Atiku Abubakar says he has what it takes to win the presidency in the 2023 general election on the platform of the Peoples Democratic Party (PDP).\nAdvertisement“The reason why APC came into being is because they saw Buhari [with] the same 11 to 12 million votes he garnered in the previous election.\n“So, why not give me the right of first refusal since I am still capable, I am still able, I am still agile.\nWhat you want to do is you want to win and who is most likely to win?\nI dare say the person who is most likely to win is sitting here before you, and I am not carrying any baggage."
  },
  {
    "headline": "ICYMI: I'm still agile and most likely to win presidency in 2023, says Atiku",
    "summarized_story": "Former Vice-President Atiku Abubakar says he has what it takes to win the presidency in the 2023 general election on the platform of the Peoples Democratic Party (PDP).\nAdvertisement“The reason why APC came into being is because they saw Buhari [with] the same 11 to 12 million votes he garnered in the previous election.\n“So, why not give me the right of first refusal since I am still capable, I am still able, I am still agile.\nWhat you want to do is you want to win and who is most likely to win?\nI dare say the person who is most likely to win is sitting here before you, and I am not carrying any baggage."
  },
  {
    "headline": "'Over 100 killed' as explosion rocks illegal oil refining site in Imo",
    "summarized_story": "At least 100 people have been reportedly killed following an explosion at an illegal oil refining site in Ohaji/Egbema area of Imo state.\nOpiah also said Okenze Onyewoke, identified as the owner of the illegal refining site, had been declared wanted by the state government.\nAdvertisement“The fire outbreak occurred at an illegal bunkering site and it affected over 100 people who were burnt beyond recognition,” he said.\nAdvertisement“Look around, you’ll find smoke coming from this illegal act.\nAdvertisement“On behalf of the Imo state government, we condole with the bereaved families."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Google’s Africa internet cable arrives in Lagos, Nigeria",
    "summarized_story": "Google has announced that earlier today, Equiano, a subsea internet cable running through Portugal to South Africa landed in Lagos, Nigeria.\nThis announcement is coming a month after Equiano first landed on the African continent in Togo.\nThe project, which is named after Nigerian-born writer and abolitionist Olaudah Equiano, is expected to help support further digital transformation in Nigeria, a country with a thriving tech ecosystem.\n“Google is committed to supporting Africa’s digital transformation and we are excited to see the impact of the landing of Equiano in Nigeria,” Juliet Ehimuan, Director, West Africa at Google said.\nLast October, Google CEO Sundar Pichai announced a plan to invest $1billion over 5 years to support digital transformation in Africa, of which project Equiano is part."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, It's the weekend again, and I've been looking forward to it!\nFirst off, thank you for sticking with me...."
  },
  {
    "headline": "Say goodbye to clout chasing on the gram",
    "summarized_story": "AdvertisementWhen you compare this to, say, California, United States – which has an estimated 630,000 developers – you’ll see that this is a problem.\nInstagram prioritises originalityAdam Mosseri, Instagram CEO, announced on Wednesday, April 20, 2022, that the company will change its ranking algorithm to emphasise original content more prominently on its platform.\nThis would also help to prioritise the distribution of original content over reposted content in places like the Reels tab and feed.\nWe’re going to do more to try and value original content more, particularly compared to reposted content,” he says.\nWhat’s more, Mosseri mentioned two recent product launches: product tagging and enhanced tagging."
  },
  {
    "headline": "What you need to know as Google’s Equiano cable lands In Nigeria",
    "summarized_story": "Share this article:Google has announced the launch of Equiano, a state of the art submarine Internet cable, which is set to land in Lagos, Nigeria.\nThe Internet cable, named after Olaudah Equiano, a historical abolitionist, has a capacity of 144 terabits (18 Terabytes).\nOne of the landmark moments was in 2009, during the launch of the MainOne submarine cable, a private submarine cable that today spans Nigeria, Ghana, and Cote d’Ivoire.\nThere’s a vast submarine cable capacity in Africa that still doesn’t reflect on your download speeds or streaming quality.\nAs of 2020, Africa had a submarine cable capacity of 100 Tbps, but it was only using 10%."
  },
  {
    "headline": "Blockchain-powered insurance: Meet the decentralised insurance protocol, Etherisc, insuring Kenyan farms against bad climate",
    "summarized_story": "Share this article:The concept of decentralised insurance became a theoretical possibility with the emergence of decentralised finance (DeFi).\nWhile DeFi platforms continue to offer borrowing, lending, and staking services, Etherisc, an open-source, decentralised insurance protocol, brings affordable insurance to African farmers away from the complex DeFi protocols.\nFrom traditional insurance to decentralised insuranceEtherisc team with Keyan localsBerende has been in the insurance space since the early 2000s.\nAccording to the Africa Insurance Pulse 2022, insurance penetration in Africa stood at 2.78%, a decline from 2.98% in the previous year.\nHowever, satellite data is not as precise as data obtained from the ground when measuring precipitation."
  },
  {
    "headline": "FG reopens another four land borders three years after",
    "summarized_story": "The Federal Government has given directive for the re-opening of four additional land border closed in August of 2019.\nAccording to a circular released on Friday by the Nigeria Customs Service (NCS), which was signed by E.I Edorhe, deputy comptroller-general of Customs, the Federal Government directed the Customs to open Idiroko, Ogun State; Jibiya, Katsina State; Kamba, Kebbi State and Ikon, Cross River State borders with immediate effect.\nRecall that the Federal Government in August 2019 closed the nation’s borders as part of policy geared towards preventing the smuggling of illegal arms, food and agricultural products into the country in order to stimulate local production.\nIn December 2020, the Presidency announced the immediate re-opening of the first four major land borders including Seme, Illela, Maigatari and Mfun.\nThis action was believed to be in readiness for the commencement of the African Continental Free Trade Agreement (AfCFTA) scheduled for January 1, 2021."
  },
  {
    "headline": "Over 60 burnt to death in Imo – Rivers oil community explosion",
    "summarized_story": "An explosion related to either crude oil or gas has occurred at a location between Rivers and Imo states today, Saturday, April 23, 2022, and over 60 persons are feared roasted to death.\nInitial outcry said it was a gas explosion, but latest hints from the place said it could be an oil bunkering site.\nBusinessDay gathered that the location could be between Okuizu and Abacheta on the side of Imo State or Egbema on the side of Rivers State.\nThe chairman of Ogba/Egbema/Ndoni Local government of Rivers State, Vincent Job, has confirmed the tragedy and commiserated with the families of the Egbema victims.\nThe statement warned youth’s to desist from illegal oil refining or any nefarious activities capable of truncating their future but should channel their energies towards meaningful ventures."
  },
  {
    "headline": "Oba Lamidi Adeyemi laid to rest in Oyo Town",
    "summarized_story": "The Alaafin of Oyo, Oba Lamidi Olayiwola Adeyemi III, has been buried in the ancient town of Oyo.\nIslamic clerics led by the Chief Imam of Oyo Town Sheikh Moshood Ajokideru joined by family members and some of his chiefs offered prayers for the repose of his soul.\nAfter the Janaza prayers, his body was taken back to the palace where the final burial was held.\nThe late monarch joined his ancestors on Friday, at the Afe Babalola University Teaching Hospital, Ado Ekiti.\nRead also: Alaafin: End of a glorious era, says OlubadanAlaafin, aged 83 was on the throne for 25 years."
  },
  {
    "headline": "Edo charges residents on food, environmental hygiene as Lassa fever cases reach 185 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State has confirmed 185 cases of Lassa fever since the outbreak of the epidemic in the state, with the government reiterating the need for residents to maintain good environmental health and sanitation habits as well as proper hygiene in the handling and preparation of food.\nProf. Akoria noted, “Edo State has confirmed 185 Lassa fever cases since the outbreak of the disease in the state.\nThe fatality rate stands at 14 percent and this is not acceptable to the Edo State Government.\n“The intervention of the Edo State Government is targeted at reducing the number that fall ill with Lassa fever as we focus on downstream approaches that require ownership and participation.\nWe are also working with the Edo State Waste Management Board.”“I call on the people to improve their food and environmental hygiene in the state,” she urged."
  },
  {
    "headline": "Obaseki mourns passing of Alaafin of Oyo, Oba Lamidi Adeyemi – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has mourned the passing of an illustrious leader of the Yoruba race, the Alaafin of Oyo, Oba Lamidi Olayiwola Adeyemi III.\nIn a statement, the governor described the Alaafin of Oyo, as a “a great ruler, who displayed kindness and compassion to his people, espousing the virtues of hard work, diligence and love for humanity.”He noted, “It is with a heavy heart that I mourn the passing of a revered monarch and an illustrious leader of the Yoruba race, the Alaafin of Oyo, Oba Lamidi Olayiwola Adeyemi III.\n“Brave and cheerful, Oba Adeyemi embodied the ideals of the Yoruba nation, promoting the rich culture and heritage of the Yorubas and providing wise counsel to those who sought guidance from the throne.”According to him, “During his over 50-year spell on the throne, Oyo witnessed numerous transformations and transitions, but he remained true to his heritage and harped on the need for brotherly love and conscientious living.”“He will be remembered for his kind-nature, conviviality, wisdom and love for humanity and living.”Obaseki commiserated with the Government and people of Oyo State, the Oyo Kingdom, family, friends, associates and well-wishers, and prayed that God will grant all the fortitude to bear this irreparable loss.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo updates digital database of students, advances on new education policy – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government is updating a digital database of all students in the state to facilitate planning and budgeting for the education sector in line with the government’s efforts to sustain the progress recorded in the sector over the past five years.\nThe Edo State Commissioner for Education, Dr. Joan Osa-Oviawe, who disclosed this to journalists in Benin City, said the ministry has already captured over 45,000 biometric data of secondary school students in private and public schools across the state.\nOviawe said, “We have also started gathering the biometrics of secondary school students and have captured 45,000 SSS3 students from both public and private schools across the state.\nWe plan to capture all students in our schools from kindergarten to tertiary level both in private and public institutions.\nWe are looking at the disarticulation of junior secondary schools from the senior secondary schools.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Obaseki, police partner to tackle land grabbing, others in Edo – Nigerian Observer",
    "summarized_story": "Obaseki disclosed this when he received the new Edo Commissioner of Police, Abutu Yaro.\nHe said, “I thank the IGP for deploying two police special squads to Edo State.\nThis squad will deal with community issues and issues of land grabbing.\n“We are dealing with the issue of land grabbing squarely as it is impeding development in Edo State.\nWe must have a peaceful election; both pre and post-electioneering activities must be peaceful in Edo State."
  },
  {
    "headline": "‘The Iroko has fallen’ – Yoruba Global Alliance pays tribute to Late Alaafin, Oba Adeyemi",
    "summarized_story": "The Yoruba Global Alliance (YGA), has paid tribute to the His Imperial Majesty, Oba Lamidi Olayiwola Atanda Adeyemi, the Alaafin of Oyo, who passed away on Friday.\nThe Alaafin, a prominent Yoruba monarch, breathed his last at 83, after over 50 years on the throne.\n“The Alaafin Oba Adeyemi lll was a veritable inspirer and an inspiration to Yoruba self-consciousness.\n“Oba Adeyemi was a phenomenal monarch and an embodiment of the quintessential Yoruba mores, traditions and culture and a huge encyclopaedia of Yoruba history.\n“The transition of Oba Adeyemi is a painful loss to the Yoruba nation, to the African race and to global humanity in general."
  },
  {
    "headline": "DMO auctions three new N225bn FGN bonds",
    "summarized_story": "Nigeria’s Debt Management Office (DMO), has offered three new Federal Government of Nigeria (FGN) bonds valued at N225 billion for subscription through auction in April.\nThey include a N75 billion FGN bond at 13.5 per cent interest rate, due in March 2025 (10 year re-opening) and a N75 billion FGN bond, due in April 2032 (10 year new issue).\nThe third one is a N75 billion bond at 13 per cent interest rate, due in January 2042 (20 year re-opening).\n“They are listed on The Nigerian Stock Exchange Ltd. and FMDQ OTC Securities Exchange.”It added that all FGN bonds qualify as liquid asset for liquidity ratio calculation for banks.\n“FGN bonds are backed by the full faith and credit of the FGN and are charged upon the general assets of Nigeria.”"
  },
  {
    "headline": "Over 100 feared dead as illegal refinery explodes in Imo",
    "summarized_story": "More than 100 people reportedly died on Friday night after an illegal refinery exploded at Abaezi forest in the Ohaji-Egbema Local Government Area of Imo State.\nThe state Commissioner for Petroleum Resources, Goodluck Opiah, told Punch at the scene that the state government had declared the owner of the illegal refinery, Okenze Onyenwoke, wanted.\nHe advised the suspect whom he said was on the run to turn himself in at the nearest police station.\nThe Imo State Government has declared wanted, Okenze Onyenwoke, who owns this illegal refinery.\nPeople are rushing to look for their relations but the unfortunate thing is that the victims were burnt beyond recognition.”"
  },
  {
    "headline": "5th Anniversary: PDP Group salutes political doggedness of Senator Isiaka Adeleke",
    "summarized_story": "By Sunday Oguntuyi, OsogboIn commemoration of the 5th anniversary of the death of Senator Isiaka Adetunji Adeleke, a socio political group within Osun state chapter of People’s Democratic Party (PDP), the Pathfinder Team, has saluted the political doggedness of the late sage in the area of good governance.\nAccording to the group, late Isiaka Adetunji Adeleke lived an examplanry life full of human development, a legacy they said, still live after him.\nAccording to them, his death is not in vain as the people of the state recognized his good deeds and transferred the love to his brother, Senator Ademola Adeleke who has continued from where the late sage stopped.\n“Your departure though, painful but we are glad that your good legacies continue.\nWe are still enjoying your good work, your dynasty is God-sent to the people of Osun, we miss you our dear daddy,” the group added."
  },
  {
    "headline": "Tinubu, Umahi, Bala Mohammed, Others Attend First Lady’s Iftar Dinner",
    "summarized_story": "Some presidential aspirants are currently being hosted for Iftar dinner by the First Lady, Aisha Buhari, at the Presidential Villa, Abuja on Saturday evening.\nRecall that the First Lady had invited all presidential aspirants, across all political parties, to the Ramadan Iftar, it was however gathered that the event will also be hosting elected party officials.\nAt the time the event took off, All Progressives Congress (APC) national leader, Asiwaju Bola Ahmed Tinubu, Governor Dave Umahi of Ebonyi State, Mallam Nasir El-Rufa’i of Kaduna State, and Governor Bala Mohammed of Bauchi State were among the presidential aspirants attending the event.\nADVERTISEMENTAlso, Minister of Labour and Employment, Senator Chris Ngige; Minister of Niger Delta Affairs, Godswill Akpabio; one-time national chairman of the Peoples Democratic Party (PDP), Chief Barnabas Gemade; former Speaker of the House of Representatives, Yakubu Dogara; and oil and gas mogul, Tein Jack-Rich were also in attendance.\nDetails Later…"
  },
  {
    "headline": "JUST-IN: 100 Dead As Illegal Refinery Explodes In Imo",
    "summarized_story": "A night fire which started by 11pm at an illegal crude oil bunrkering site in Abaezi forest, in Ohaji-Egbema local government area of Imo State, has killed about 100 persons.\nHe said, “it is true that a fire incident occurred at Ohaji/Egbema Local Area of Imo State.\n“I wish to appeal to our youths to desist from making themselves available for this illegal act.\n“On behalf of Imo State Government, we condole with the bereaved families.\nImo State Government pray God gives the family of those who lost their lives the fortitude to bear the irreparable loss,” he stated."
  },
  {
    "headline": "President Buhari Mourns Alaafin Of Oyo, Oba Adeyemi III",
    "summarized_story": "President Muhammadu Buhari has condoled with the Government and people of Oyo State over the passing of Alaafin of Oyo, Lamidi Olayiwola Adeyemi III, 83, whose reign covered major historic transitions in the country, and witnessed transformations in his domain.\nThe President in a statement by his media aide, Femi Adesina, on Saturday, affirmed that the Alaafin of Oyo’s 52 years rule was remarkable in many ways, most significant was the emphasis he placed on human development, thereby encouraging learning as a culture and formal education as a necessity while promoting values of peace and stability.\nAs a highly revered traditional ruler, President Buhari noted the late monarch’s numerous participations in national meetings and conferences to shape the future of the country, and the living words of wisdom he shared at every opportunity on unity and people-focused governance.\nThe President shares the grief with the Oyo State Traditional Council, Oba Lamidi’s family, friends, and associates, particularly in sports where he left another footprint.\nADVERTISEMENTPresident Buhari prayed that the Almighty God will receive the monarch’s soul."
  },
  {
    "headline": "Abiodun Mourns Passing Of Alaafin Of Oyo",
    "summarized_story": "Governor Dapo Abiodun of Ogun State has mourned the passing of the Alaafin of Oyo, Oba Lamidi Adeyemi III, who joined his ancestors on Friday night.\nOba Adeyemi was reported to have passed on at the Afe Babalola University Teaching Hospital, Ado Ekiti, at the age of 82.\nAlaafin reigned for 52 years on the throne of his forebears.\n“I commiserate with the Oyomesi, the wives and children of the late monarch and the entire Adeyemi family over this irreplaceable loss.\nAbiodun prayed God grants the departed monarch eternal rest and rewards him with Aljannah Firdaus."
  },
  {
    "headline": "2023: Atiku Contesting As National Candidate, Not Regional Contestant – Group",
    "summarized_story": "The Atiku Support Organisation (ASO) has dismissed the idea of a consensus candidate of northern extraction in the 2023 general election, affirming that former Vice President, Atiku Abubakar, will be contesting as a Nigerian candidate an not regional contestant.\nThis is just as he affirmed that Atiku was not perturbed by the move of the northern elders.\nIt is important to note that the Wazirin Adamawa, His Excellency, Atiku Abubakar, GCON is contesting for the office of the President of Nigeria as a Nigerian candidate aimed at uniting and rebuilding the nation, and not as a northern or regional candidate.\nWith very strong capacity and rich credentials, we firmly believe that the PDP national delegates will no doubt support His Excellency, Atiku Abubakar to lead the party to victory in the 2023 presidential election.\nBala Mohammed to submit and subject themselves to the scrutiny and decision of the PDP’s national delegates, and not to a regional ethnic group."
  },
  {
    "headline": "Breaking: Tyson Fury knocks out Dillian Whyte to retain WBC title",
    "summarized_story": "World Boxing Council (WBC) Heavyweight Champion, Tyson Fury has knocked out challenger, Dillian Whyte in the sixth round to retain his belt.\nFury controlled all the rounds in a dominant performance to show that Whyte was no match for his superiority.\nA huge right uppercut floored Whyte as The Gypsy King took his professional record to 32 wins and a draw from 33 fights.\nWhyte, after receiving that brutal right uppercut, got to his feet, but he is all over the place and referee Mark Lyson waved it off.\nIn round four, Whyte looked to rough up Fury and Fury was furious that Whyte caught him on the break."
  },
  {
    "headline": "Tyson Fury retires from boxing after knocking out Dillian Whyte",
    "summarized_story": "WBC heavyweight boxing champion, Tyson Fury has announced his retirement from the sport after knocking out Dillian Whyte on Saturday.\nFury knocked out Whyte in the sixth round of their encounter in front of 94,000 capacity-filled Wembley Stadium.\nSpeaking to BT Sport Box Office, Tyson Fury said said this would be his last fight and was happy that he had remained undefeated in 33 fights.\nFury described Whyte as a warrior and believed that he would be a world champion one day.\n“Dillian [Whyte] is a warrior and I believe he will be a world champion."
  },
  {
    "headline": "Breaking: Tyson Fury lands stunning punch on Dillian Whyte, retains WBC heavyweight title",
    "summarized_story": "WBC champion Tyson Fury produced a stunning one-punch stoppage in the sixth round to beat fellow Briton Dillian Whyte, and then suggested he may now retire from the sport.\nWhyte, admirably, got to his feet within the count before staggering into the referee as the fight was halted.\nBut the challenger could not get close to Fury, who used his height and reach advantage to keep Whyte at bay as the fight progressed.\nThen came arguably Fury’s greatest punch of what is proving to be an illustrious career.\nHe teed it up with a left jab and as Whyte stepped forward, Fury whipped in the brutal uppercut."
  },
  {
    "headline": "Breaking: Scores dead as fire engulfs illegal oil bunkering site",
    "summarized_story": "Up to 100 people, mostly youth are believed to have been burnt to death, while others sustained varying degrees of burns at an ilegal oil bunkering site at Abaezu forest in Ohaji Egbema local government area of Imo state Friday night.\nAn eyewitness who spoke to Blueprint said the fire incident occurred around 11pm, and that smoke from the fire enveloped the atmosphere which made villagers uncomfortable and forced them to wake up.\nReacting to the incident, Imo state Commissioner for Petroleum Resources, Rt.Hon.\nGoodluck Nanah Opiah, said the fire incident took lives of many youth at the site.\nHe added that the owner of the ilegal refinery was nowhere to be found, and had been declared wanted by the government."
  },
  {
    "headline": "Gunmen attack police station, kill 3 in Kogi",
    "summarized_story": "Unknown gunmen numbering about six on Saturday attacked Ogaminana Police station in Adavi local government area of Kogi State, killing three policemen on duty.\nA source in Ogaminana community told Blueprint that the attack took place around 2am on Saturday when they started hearing gun shots at the police station.\nThe source said the gunmen attacked the police station from different directions and succeeded in killing some policemen.\nThe PPRO called on the people of Adavi and the adjoining communities to be on the lookout and report anybody seen with bullet wounds to the Police or any other security forces nearest to them.\nShare this:TelegramPrintTweetWhatsApp"
  },
  {
    "headline": "Fashola Inaúgurates FMBN Board, Executive Management Team",
    "summarized_story": "By Mathew Dadiya, AbujaThe Minister of Works and Housing, Babatunde Raji Fashola has officially inaugurated the newly appointed members of the Federal Mortgage Bank of Nigeria (FMBN) Board and Executive Management Team.\nFashola urged the new oard and executive management team to work within the conceptual framework of FMBN as a specialized banking institution that was established to deliver on a specialized job of driving affordable housing for Nigerians nationwide; Group Head, Corporate Communications ofFMBN, Lawal Isa K/Sauri stated.\nHe also advised the Board and Management to promptly engage with the Central Bank of Nigeria (CBN) and ensure FMBN’s compliance with regulatory stipulations for operating as a Bank.\nFurthermore, the minister expressed appreciation to the immediate past Board and Executive Management Team for their service saying their efforts cannot be forgotten.\nIn his response, the new FMBN Managing Director/Chief Executive, Madu Hamman on behalf of the Board members and Executive Management Team, thanked President Muhammadu Buhari for the privilege and opportunity to serve the nation."
  },
  {
    "headline": "World Bank tells Nigeria to drop fuel subsidy",
    "summarized_story": "By Emmanuel ObisuePresident of the World Bank Group, David Malpass has asked the Federal Government to have a rethink on its policy on fuel subsidy, stating that the huge amount being expended on the policy could be channeled into other critical sectors.\nMalpass noted this on Wednesday at a media briefing at the ongoing World Bank/International Monetary Fund Spring Meetings in Washington DC, United States.\nIt would be recalled that the Nigerian Senate last week approved N4 trillion for petrol subsidy in 2022.\n“So, we encourage that when there is need for subsidy, either food or for fuel, that it should be carefully targeted at those most in need of it.\nThe World Bank had in November 2021 warned Nigeria not to delay any further in removing the fuel subsidy which had been described as a major drain and waste on the economy."
  },
  {
    "headline": "Naira depreciates, sells at N419.50 to dollar",
    "summarized_story": "Agency reportThe Naira exchanged at N419.50 to the dollar at the Investors and Exporters window on Thursday.\nThis represents 0.28 per cent depreciation, compared to N418.33 to the dollar recorded on Wednesday.\nAn exchange rate of N444 to the dollar was the highest rate recorded within the day’s trading before it settled at N419.50.\nThe Naira sold for as low as N410 to the dollar within the day’s trading.\nA total of $124.85 million dollars was traded in foreign exchange at the official Investors and Exporters window on Thursday."
  },
  {
    "headline": "ONU inducted into ASURI hall of fame",
    "summarized_story": "By Eunice OrikeThe Minister of Science, Technology and Innovation, Dr. Ogbonnaya Onu, has made history as he became the first inductee into the hall of fame of the Academic Staff Union of Research Institutes ASURI.\nThis historical event took place at the sensitisation workshop of the staff of FMSTI on the full implementation of the Presidential Executive Order 05 yesterday in Abuja.\nThe Minister enunciated that the essence of the Executive Order 5, is to ensure that Nigeria acquires technologies that will help in positioning the nation towards self-sufficiency.\nHe said, “The Executive Order is revolutionary as it is a contribution of the Ministry towards transforming the nation to the level of greatness ordained by God”.\nThe National Coordinator of the Strategy implementation task office of the Presidential Executive Order No."
  },
  {
    "headline": "Okowa says Delta Agro-Industrial Park to be ready Nov 2022",
    "summarized_story": "By Anastacia Eluwa, AsabaGovernor Ifeanyi Okowa of Delta State on Thursday, said the Agro-Industrial Park being executed by his administration at Aboh-Ogwashi, Aniocha South Local Government Area, would be ready for inauguration in November, 2022.\n“Let me appreciate the level of cooperation we have had with the Ogwashi-Uku community because they gave us over 180 hectares of land for the Agro-Industrial Park.\n“The contractor has promised to deliver the project towards the end of November which means if they start the road project now, they will still have time during the break in August and in the later part of October to finish with the road project,” Okowa said.\n“The park is a community of its own where you have various agro-processing industries co-sharing common facilities for agro-indstrialisation in the state,” he stated.\nHe said that the state government was working with the Federal Ministry of Trade and Investment to designate the park as an Export Processing Zone."
  },
  {
    "headline": "UPDATED: Alaafin Of Oyo, Lamidi Adeyemi Laid To Rest",
    "summarized_story": "The Alaafin of Oyo, Oba Lamidi Adeyemi III, has been buried in the ancient town of Oyo in south-west Nigeria.\nAlaafin was born Lamidi Olayiwola Atanda Adeyemi on October 15, 1938, and succeeded Oba Gbadegesin Ladigbolu I, as the new Alaafin on November 18, 1970.\nFollowing his demise, the Bashorun of Oyo and Head of the ‘Oyo Mesi’, Yusuf Akinade, is expected to lead Oyo town before a new Alaafin would be installed.\n“Oba Adeyemi was our last man standing in the rank of most eminent royal fathers with long years of leadership,” the governor said.\nObasanjo, in a letter, condoled with Governor Makinde, the family of Oba Adeyemi, and the entire people of Oyo on the transition."
  },
  {
    "headline": "Tributes Pour In For ‘Golden King’ Alaafin Of Oyo",
    "summarized_story": "﻿An avalanche of condolences and accolades were recorded on Saturday in the wake of the passing away of the Alaafin of Oyo, Oba Lamidi Adeyemi III.\nOyo State Governor, Seyi Makinde, described the royal father as “our last man standing in the rank of most eminent royal fathers with long years of leadership” and “a golden king”.\n“I express heartfelt condolences to the Oyo State Council of Obas and Chiefs, which Oba Adeyemi chaired for decades, the Oyomesi and the entire people of Oyo Kingdom.\n“I equally commiserate with the Oloris, children and entire Adeyemi family on the demise of their patriarch and worthy father.\nKabiyesi never spared anything in his strive to make Oyo State greater and to bring about the Nigeria of everyone’s collective dream."
  },
  {
    "headline": "Many Burnt Beyond Recognition In Imo Illegal Refinery Explosion",
    "summarized_story": "Many people have been killed after fire engulfed an illegal crude oil refining site in the Abaezi forest, in Ohaji-Egbema Local Government Area of Imo State.\nVideos of the scene of the illegal refinery, hours after the flames went out, depict the extent of the deadly blaze’s impact-charred equipment, vehicles, and human remains littered the scene.\nThe governor warned those still in the business of running illegal refinery in the state to stop forthwith or face the wrath of the law.\nEconomic sabotageSpeaking to reporters, Governor Uzodimma said the incident was a form of economic sabotage.\n“So people must be law-abiding, must refrain from taking into any activity that will amount to economic sabotage, criminality and all that."
  },
  {
    "headline": "2023 Presidency: Osinbajo Visits Olubadan, Receives Royal Blessings",
    "summarized_story": "Vice President, Professor Yemi Osinbajo on Friday, visited the Olubadan of Ibadan, Senator Lekan Balogun to officially inform him of his presidential ambition.\nThe monarch, in turn, offered his blessings to the Vice President saying: “I conclude my contribution to you by handing you over to Allah, let him protect you”.\nDuring the meeting, he said he was confident that the past seven years as VP have prepared him for a higher purpose.\nOsinbajo formally declared his intention to run for President in 2023 on April 11.\nHis declaration brought an end to months of speculation over his interest in the 2023 presidential race and widens the pool of candidates for the position."
  },
  {
    "headline": "‘Phenomenal Energy’ Drives Djokovic Into Belgrade Final",
    "summarized_story": "Novak Djokovic reached his first final of the year at the Serbia Open on Saturday after recovering from a set down to beat Karen Khachanov 4-6, 6-1 6-2 and described his home support as “phenomenal”.\nThe world number one will face another Russian, Andrey Rublev, who defeated Fabio Fognini 6-2, 6-2, as he bids for a third Belgrade crown, and the 87th title of his career.\n“As soon as the second set started I was just feeling the ball, particularly the backhand which was not working in the first set,” said Djokovic.\n“The second and third sets were the best two sets of the season for me.\n“All three matches were key matches for me, to be honest,” added said Djokovic."
  },
  {
    "headline": "Police hunt for fleeing lover who machetted girlfriend in Ondo -",
    "summarized_story": "The Police in Ondo State are investigating the bloody attack on a lady identified as Funmilola Ogundare by her boyfriend in Akure.\nHer boyfriend left her in a pool of blood.\nThe boyfriend left her in a pool of blood inside an apartment located in Ijapo Estate.\nSpokesperson of Ondo State Polo Command, Mrs Funmilayo Odunlami, explained that the suspect took the victim to his friend’s house where he allegedly committed the dastardly act.\nThe suspect took the woman to the apartment to spend the night with her."
  },
  {
    "headline": "APC reschedules sale of nomination forms, sends directors on leave -",
    "summarized_story": "The All Progressives Congress (APC) has rescheduled for next week the sale of expression of interest and nomination forms for elective positions which was originally fixed for today.\nThe leadership of the party has also sent all the six directors at the APC National Secretariat, on compulsory leave.\nAs the party rev up arrangements for their primaries which must be concluded by 3rd June , the Independent National Electoral Commission (INEC) has asked them to submit their membership registers to enable it monitor the primaries at all levels."
  },
  {
    "headline": "INEC suspends CVR in parts of Imo, Anambra, Kaduna States",
    "summarized_story": "The Independent National Electoral Commission has suspended the continuous voters registration exercise in parts of Imo, Anambra, and Kaduna States due to the spate of insecurity and attacks on its field officers.\nChairman of INEC, Mahood Yakubu also disclosed that security agencies have enough time to address the challenges before the 2023 elections.\nProfessor Yakubu spoke during a meeting with resident electoral commissioners in Abuja, where he disclosed that the voters registration exercise has been suspended in 54 centers in imo, 42 centers in Anambra, as well as the registration centers in jemaa, kaura, and large areas of Birnin Gwari and Giwa local government areas in Kaduna state.\nProfessor Mahmood Yakubu also directed all registered political parties to submit copies of membership register to the commission, in compliance with the new Electoral Act 2022, before their primary elections."
  },
  {
    "headline": "Osinbajo pays courtesy visit to Olubadan, meets Oyo APC stakeholders -",
    "summarized_story": "Vice President, Professor Yemi Osinbajo earlier today paid a courtesy visit to the Olubadan of Ibadan Land.\nHe also engaged with Stakeholders of the Oyo State All Progressives Congress chapter in Ibadan, Oyo State"
  },
  {
    "headline": "Oyalowo Ayobami: Tinubu Will Win Over at Least 4000 Out of 7800 Delegates",
    "summarized_story": "Spokesperson for Asiwaju supporters in Nigeria Diaspora, Oyalowo Ayobami, shares his thoughts with ARISE on what he thinks Bola Tinubu’s chances are of securing the presidential ticket in the primaries and winning the overall elections in 2023."
  },
  {
    "headline": "Gunman Takes Own Life After Wounding Four Near Elite Washington Prep School",
    "summarized_story": "A gunman opened fire on random victims from a sniper’s nest in an apartment building near an elite prep school in the nation’s capital on Friday, wounding four people, before taking his own life as police closed in, officials said.\nWith help from eyewitness reports, police managed to pinpoint the gunman’s position to the fifth floor of a “particular apartment building” and ultimately “breached the location where the suspect took his own life,” Contee said.\nJennifer DiGiacinto told Reuters she learned of the shooting from a text message from her son, a Burke School 11th grader.\nDozens of police vehicles with flashing lights were parked outside the school building, as police in full tactical gear and some in camouflage assembled nearby.\nLocal NBC affiliate WRC-TV showed evacuees from a building running down a sidewalk, some with their hands raised."
  },
  {
    "headline": "Amsterdam Airport Urges Travellers to Stay Away as Strike Causes Chaos",
    "summarized_story": "Amsterdam’s Schiphol airport urged travellers on Saturday to stay away as a strike by ground personnel at the start of a school holiday caused chaos at Europe’s third-busiest airport.\n“The terminal is too full at the moment … Schiphol is calling on travellers to not come to the airport anymore”, airport authorities said in a statement issued shortly before noon (1000 GMT).\nPolice closed down highway exits to the airport on Saturday afternoon as lines at departure gates stretched out of the airport buildings.\nTravellers were advised to stay away until at least 1300 GMT, while airport staff work to get as many as possible of the thousands of frustrated passengers aboard their often-delayed flights.\nKLM ground staff handle about half of all luggage coming through Schiphol, Europe’s third-busiest airport after Paris Charles de Gaulle and London Heathrow."
  },
  {
    "headline": "Nigeria: Court Orders Ex-Speaker Dogara to Vacate Seat Over Defection",
    "summarized_story": "Justice Donatus Okorowo of the Abuja Division of the Federal High Court has ordered the former Speaker of the House of Representatives, Hon.\nYakubu Dogara to vacate his seat as a member of the House of Representatives for defection.\nThe judge held that Dogara cannot continue to occupy the seat in the ninth Assembly because his defection violated Section 68(1) (g) of the constitution.\nThe PDP and the group had asked the court to remove Dogara as member representing Dass, Tafawa Balewa and Bogoro Federal Constituency of Bauchi State, over his defection to APC.\nDogara had, on July 24, 2020, defected from the PDP to the APC when he submitted a resignation letter to the Chairman of the Bogoro ‘C’ Ward in Bauchi State."
  },
  {
    "headline": "British Military Trains 150 Nigerian Special Forces Called Panthers, Set for Deployment Against Terrorists",
    "summarized_story": "A British Military Advisory Training Team, in partnership with the Nigerian Air Force, has trained 150 Advanced Special Forces operatives to be deployed to troubled areas to help in tackling security challenges in the country.\nThe Special Forces, known as Nigerian Air Force Panthers, graduated on Friday at the Regiment Training Centre Annex, Special Operations Command of the Nigerian Air Force, Bauchi.\nSpeaking during the graduation ceremony, after the Advanced Special Operations Course 1/2022, the Air Officer Commanding, Ground Training Command, Air Vice Marshal Ibukunle Daramola said 285 personnel were nominated for the training.\nAs such, these newly bred operatives would be employed as part of our offensive to ensure normalcy and calm are restored to restive communities within Nigeria.\nThe deployment of what we’ve conveyed here will help save lives and defeat a common enemy."
  }
]