[
  {
    "headline": "Borno shuts colleges after students’ clash",
    "summarized_story": "The Borno State Government has ordered the closure of two tertiary institutions in the state following students’ unrest for two weeks.\nThe affected schools are the Kashim Ibrahim College of Education, Maiduguri, and Umar Ibn Ibrahim El Kanemi College of Science and Technology, Bama.\nA statement signed by the Permanent Secretary, Ministry of Higher Education, Mr Mohammed Abatcha, on Thursday, in Maiduguri, said the decision was to avoid escalation of violence.\n“The decision became necessary to avoid further escalation of the clashes and to save lives and properties pending further investigation of the root cause of the matter,” Abatcha said.\nInsurgency forced the state government to relocate the Umar Ibn Ibrahim El-Kanemi College of Education Science and Technology, Bama, to Maiduguri, to share structures with Kashim Ibrahim College of Education."
  },
  {
    "headline": "ICAN, ANAN rivalry resufaces at Reps hearing on forensic fraud institute",
    "summarized_story": "The Chartered Institute of Forensic and Investigative Professionals of Nigeria alleged that the bill being considered by the House was plagiarised, as the National Assembly had recently passed a similar bill it sponsored.\nShe noted that the CIFIPN had been in existence since 2009, recalling that the 8th National Assembly unanimously passed the bill to legalise the body.\nHe said, “For the past 10 years, the institute has been promoted by ANAN, which is a sister-body of ICAN.\nThere are only there accounting organisations in Nigeria – ICAN, ANAN and in addition to that is the Chartered Institute of Taxation.\n“We understand that the House had worked on a bill in the 8th National Assembly."
  },
  {
    "headline": "Fresh fuel hike: We’ll shut Nigeria without notice — NLC",
    "summarized_story": "The communiqué signed by President of NLC and Acting General Secretary, Ayuba Wabba and Ishmail Bello respectively, said: “NEC also noted that there is currently no negotiation with government over fuel price increase.\nThe NEC recalled that the last meeting with Government in February 2021 was adjourned sine die.\nSince then, no other meeting has been called by government.\nThe NEC recalled and reiterated the decision it took on February 17, 2021, after the last meeting between labour and the Federal Government team on fuel price increase.\nAccording to the communiqué “The NEC reviewed the preparation of Congress for appearance and presentation of workers’ demands at the Zonal Public Hearings on the Review of the 1999 Constitution of the Federal Republic of Nigeria."
  },
  {
    "headline": "Insecurity: Nigeria in safe hands, says Lai Mohammed",
    "summarized_story": "Kindly Share This Story:By Emmanuel ElebekeThe Minister of Information and Culture, Lai Mohammed, has urged Nigerians not to succumb to doomsday predictions about the country because they won’t come to pass.\nHe also assured that Nigeria was in safe hands, despite the current security challenges bedeviling the countryThe Minister gave the charge yesterday, while receiving the Oluyin of Iyin-Ekiti, Oba Adeola Adeniyi Ajakaiye, who on a courtesy visit to his office in Abuja.\nREAD ALSO:He appealed to Oba Ajakaiye to work with his fellow traditional rulers, as well as the government of Ekiti State, to ensure peace and security in the state.\nOba Ajakaiye used the occasion of his visit to invite the minister to his forthcoming coronation as well as visit the tourist sites at Iyin-Ekiti – the two requests that were granted by the minister.\n‘’Putting the tourist sites on the national and global map will attract tourists, which will in turn boost the economy of not just Iyin town but, indeed, the entire Ekiti State,” he said."
  },
  {
    "headline": "Amnesty International laments spate of killings in Nigeria",
    "summarized_story": "“Amnesty International started working on Nigeria on 1 June in 1967 with an intervention on the Nigerian civil war which ended in 1970.\nBetween 1968 and 1969 the annual report documented and expressed concern over suspension of human rights in the context of the civil war.\n‘’From the June 12, 1993, pro-democracy protests, occupy Nigeria protest of 2012, to the #EndSARS protest of 2020, Nigerian authorities continue to violently repress peaceful protests.\n“While facing violations or policies that undermine people’s rights, Nigerians always resort to protest – and other peaceful means of seeking change.\nBut violent clampdown on protests remains a major area of human rights violation."
  },
  {
    "headline": "'Halt the genocide, stop Israel now', Muslim Women tell UN, Biden",
    "summarized_story": "“Palestine predates Israel but the latter is really out to wipe out Palestine.\nThe powers that be have watched Israel maim, kill, and commit war crimes on innocent civilians in Palestine.\nIsrael must desist from further occupations of East Jerusalem, illegal settlement building on Palestinian land, Al-Aqsa Mosque hostilities and continued siege and invasions of Gaza.\n“The terrorist State of Israel has since expanded and taken over 80% of the Palestinian lands.\nWhen media says ‘fight’ or ‘uprising’ between Israel and Palestine, note that it is nothing but wanton killings and daylight robbery of ancestral properties by Israel."
  },
  {
    "headline": "NDDC: Akpabio appeals to protesting Ijaw youths for peace",
    "summarized_story": "The Minister of Niger Delta Affairs, Senator Godswill Akpabio, has appealed to the protesting Ijaw youths to sheath their swords and allow peace to reign.\nRecall that the Ijaw Youths Council had on Thursday staged a nationwide protest, shutting down all the NDDC offices in the country in demand for a constitution of substantive NDDC board members.\nMeanwhile, the leadership of IYC after a consultative meeting with Akpabio urged the youths to remain calm and maintain peace adding that they should not allow the genuine protest to be hijacked by people who never meant well for the region.\nAnd now we’ve discussed with the Honourable Minister of Niger Delta Affairs.\n“Immediately after now, we will communicate back to our people that something is in the offing that will benefit everybody in the region and the youths will be carried along."
  },
  {
    "headline": "Abductors yet to contact family five days after kidnap of APC youth leader’s wife",
    "summarized_story": "The abductors of the wife of Salawu Areokuta, the youth leader of All Progressives Congress (APC) in Oyo State, are yet to contact the family, five days after the incident.\nThe incident occurred at Aromolaran area, old Ife Road in Ibadan, DAILY POST gathered.\nPublicity Secretary of APC, Dr. Abdulaziz Olatunde, who spoke with DAILY POST, noted that all efforts to know the whereabouts of the victim have not yielded results.\nOlatunde told DAILY POST that the family of the victim are yet to be contacted as at Friday.\n“The wife will now be in a problem and dilemma of who they will contact."
  },
  {
    "headline": "Again, tanker catches fire on Otedola bridge [Video]",
    "summarized_story": "A tanker carrying a petroleum product caught fire on the Otedola bridge in Lagos on Friday.\nThe Fire Service, the Police, LASTMA, LASEMA and FRSC are at the scene to control the situation and manage traffic.\nThe Otedola bridge has become infamous for accidents involving heavy duty vehicles and others, with attendant deaths and damages.\nIn December 2020, at least 11 people sustained injuries when a tanker, loaded with diesel, exploded on the bridge.\nThe tanker rolled back and collided with another truck carrying goods as well as a salon car."
  },
  {
    "headline": "Taraba Assembly promises more legislation to protect children",
    "summarized_story": "The leadership of the Taraba State House of Assembly has again agreed to continue to work round the clock to come up with legislation that will enhance the safety of children across the state.\nThe members, who on Friday in Jalingo, the state capital, made this known, agreed that children are gifts from God, hence the need for them to be given adequate protection.\nSpeaking through the speaker of the House, Joseph Albasu Kunini, they beckoned to the members of the public to try as much as possible to extend hands of friendship to vulnerable children in the state.\n”Urging all and sundry to do the needful to better the lots of children , they said ” we must wake up and give the children the much needed protection, love, care, comfort and the right upbringing.”The members reaffirmed their readiness as legislators to continue to ensure through oversight duties that the child protection law is passed and implemented.\nThe bill which had been signed into law, was noticed to have begun to yield positive results as ills often inflicted on women and other vulnerable persons, have drastically been reduced in the state."
  },
  {
    "headline": "Godfathers, money are Nigeria's major electoral problems",
    "summarized_story": "Senator Magnus Abe, formerly representing Rivers South-East Senatorial District, has identified godfathers and money as major problems the electoral process in Nigeria faces.\nThe former lawmaker stated that the foundation of everything wrong in the country is the electoral process.\nHe said once godfathers observe that they can no longer compromise the process, they will keep their money.\nAbe further lamented how Nigeria spends so much on elections, with eighty percent of resources going into the process.\n“We must have elections in which money has no place, godfathers have no place."
  },
  {
    "headline": "Tackling security challenge in Lagos State",
    "summarized_story": "Lagos is a state that gives hope to a lot of Nigerians.\nThe ever-escalating insecurity challenge in Nigeria has become a clear and present danger to all of us.\nThe deployment of CCT cameras, street lights and drones all over Lagos State will do it a world of good.\nAnd with regards to involving the people, it has become imperative for the government to hold more meetings with the local government chairmen, councillors, leaders of youth groups and traditional rulers of different ethnic groups resident in Lagos State.\nNetwork security and physical security are converging."
  },
  {
    "headline": "Wizkid, Burna Boy, nominated for 2021 ‘Best International Act’ BET Awards",
    "summarized_story": "By Ekaete BasseyGrammy-winning superstars, Ayodeji Ibrahim Balogun, popularly known as Wizkid and Damini Ogulu, popularly known as Burna Boy got a nomination each at the 2021 BET Awards.\nADVERTISEMENTBurna Boy won the “Best International Act” category at the 2019 and 2020 BET Awards.\nWhile Wizkid won it in 2012, when the category had two divisions for Africa and the UK.\nFor the 2021 edition, Burna Boy and Wizkid are up for “Best International Act”, along with Aya Nakamura (France), Diamond Platnumz (Tanzania), Emicida (Brazil), Headie One (UK), Young T & Bugsey (UK) and Youssoupha (France).\nWizkid and Burna Boy won the “Best Music Video” and “Best Global Music Album” categories respectively at the 2021 Grammy Awards."
  },
  {
    "headline": "Neymar, Nike split over sexual assault investigation",
    "summarized_story": "Agency ReporterUS sportswear giant Nike says it stopped working with Brazilian footballer Neymar because he “refused to co-operate in a good faith investigation” into an allegation of sexual assault against an employee.\nThe alleged incident happened in 2016 and was reported to Nike in 2018.\nNike said its investigation was inconclusive.\nA spokeswoman for Neymar said he denied the sexual assault and split with Nike last year for commercial reasons.\nRead Also; Neymar signs contract extension to 2025 with PSGNike parted ways with Neymar in August 2020, ending one of its most high-profile sponsorship deals."
  },
  {
    "headline": "Sit-at-home: Police assure Enugu traders, transporters, others",
    "summarized_story": "By Damian Duruiheoma, EnuguIn what looked like response to the apprehension generated ahead of the sit-at-home order by pro-Biafran groups for May 31, Enugu Police Commissioner, Mohammed Aliyu, has met with transport, market, youths and students leaders in the state.\nHe spoke to the leaders and other law-abiding citizens of the state on the needs for sustained support to the command, in its bid to professionally stabilize security order in the state through the operation.\nThe CP’s meeting was contained in a statement by Enugu spokesman, Daniel Ndukwe.\nADVERTISEMENTAccording to the release, the police boss solicited sustained support from the citizenry, while reaffirming commitment to collaboratively attain goals of Operation RP and urging residents to go about their lawful businesses without fear of intimidation or harassment.\nHe also reaffirmed commitment to collaborate with sister security agencies and law-abiding citizens to maximally attain goals of the operation in the state, in view of emerging security challenges."
  },
  {
    "headline": "Kalu salutes new Chief of Army Staff, General Yahaya",
    "summarized_story": "Congratulating the Chief of Army Staff, Kalu extolled the virtues of the Major-General, describing him as a gallant and committed military officer with passion for professionalism and national development.\nThe former governor, urged the new army chief to sustain his outstanding attributes in his new role.\nIn a congratulatory message, the Senate Chief Whip, stressed that the Nigerian army has continually played a noble role in nation building.\nHe said: “I felicitate with the new Chief of Army Staff, Major-General Farouk Yahaya, on his new national assignment.\n“Considering his antecedents, I am optimistic that the new Chief of Army Staff will bring to bear his expertise in the discharge of his duties and responsibilities."
  },
  {
    "headline": "45 generals to retire as Buhari names, Yahaya, new chief of army staff",
    "summarized_story": "From Molly Kilete, AbujaPresident Muhammadu Buhari has appointed Major Gen. Farouk Yahaya as new Chief of Army Staff (CAOS).\nHe was granted regular combatant commission as a member of 37 regular course on 22 September 1990 in the rank of Second Lieutenant with seniority in the same rank effective September 27, 1985.\nWith his appointment of Yahaya, a member of 37 Regular Course of the Nigerian Army, it was learnt that about 45 generals would have to resign .\nThe affected officers Daily Sun gathered are mostly officers of 35 Regular Course, 36 Regular Course and 37 Regular Course who incidentally are Course-mates of the new army chief.\nThe directive Daily Sun gathered has not changed, thus meaning more officers would retire with the naming of a new service chief."
  },
  {
    "headline": "Immigration increases production capacity to beat deadline for passport backlogs",
    "summarized_story": "Comptroller–General, Nigeria Immigration Service (NIS), Mr Muhammad Babandede, has said the service has increased its production capacity to beat the May 31 deadline set to clear backlog of passport applications.\nBabandede announced this while briefing newsmen on the NIS passport reforms and recruitment exercise, yesterday, in Abuja.\nHe said that the passport production centres across the country were working round the clock to clear the backlogs before the commencement of the new passport regime on June 1.\nHe also said that all passport collection centres would be opened from 6:00 a.m. to 6:00 p.m. daily for applicants.\nOn recruitment, NIS boss said that the current recruitment exercise was the best ever in immigration and assured all applicants of transparency and fairness."
  },
  {
    "headline": "Open grazing ban: Miyetti Allah seeks meeting with govs, other leaders",
    "summarized_story": "From Obinna Odogwu, AwkaThe leadership of Miyetti Allah Cattle Breeders’ Association of Nigeria (MACBAN), yesterday, appealed to governors of the 36 states and other leaders in the country to convene a meeting to enable them have a second look at the ban placed on open grazing by Southern governors.\nHe suggested that instead of the straight ban on open grazing by the Southern governors, a middle course should be taken to douse tension in the country, particularly in the Southern Nigeria.\nExplaining what he meant by middle course, Siddiki said that it was simply be the coming together of leaders of the South and North to chart the way forward for an improved and more modern mode of livestock keeping.\n“It will douse tension and the heightening tension across the north and south and give sufficient room for gradual adjustment that will be beneficial to the generality of Nigerians.\nNeither the northern nor the southern political leaders should call the bluff of the commoners whose surface interpretation of the situation has the tendency of brewing misgiving, rancour and avoidable friction across the board,” he said."
  },
  {
    "headline": "Constitution: Northern govs set up committee on restructuring",
    "summarized_story": "He advised that discussion on the review of the 1999 Constitution should be within the context of unity, stability, peace and progress of Nigeria.\nLalong made the remarks at the North Central Senate Committee’s public hearing on the review of the 1999 constitution review, in Jos, Plateau State.\n“We have to conduct the discussion on the review of the 1999 constitution within the context of the unity, stability, peace and progress of the country.\n• How Nigeria can enact new Constitution- EkweremaduFormer Deputy Senate President, Ike Ekweremadu, said while a new constitution is possible and would become ultimately inevitable, the nation needs to amend the 1999 Constitution to create a provision for achieving that.\nSome say, bring back the 1960 Constitution; some say bring back the 1963 Constitution."
  },
  {
    "headline": "REVEALED: The 24 Army Officers Buhari Bypassed Over Ethnic, Religious Sentiments To Appoint Lesser Qualified Yahaya As Army Chief",
    "summarized_story": "President Muhammadu Buhari bypassed no fewer than 24 top senior Nigerian Army officers to appoint Major-General Farouk Yahaya as the Chief of the Army Staff, according to a document, Seniority Roll Nigerian Army Officers 2021 (Revised) obtained by SaharaReporters on Friday.\nNigerian President Muhammadu BuhariMilitary sources said Buhari might have appointed a less qualified Yahaya, from Sokoto State, based on the president’s usual ethnic and religious sentiments as seen in his other various appointments.\nThe new army chief, Yahaya, now 55 years old, was taken by the Nigerian Army Infantry Corps on September 22, 1990.\nIn 2018, former President Olusegun Obasanjo wrote an open letter to Buhari, asking him not to bother to seek re-election.\nAlso, a retired Colonel Abubakar Umar, former military governor of Kaduna State, accused Buhari of nepotism, saying it could tear the country apart."
  },
  {
    "headline": "REVEALED: The 24 Army Officers Buhari Bypassed Over Ethnic, Religious Sentiments To Appoint Lesser Qualified Yahaya As Army Chief",
    "summarized_story": "President Muhammadu Buhari bypassed no fewer than 24 top senior Nigerian Army officers to appoint Major-General Farouk Yahaya as the Chief of the Army Staff, according to a document, Seniority Roll Nigerian Army Officers 2021 (Revised) obtained by SaharaReporters on Friday.\nNigerian President Muhammadu BuhariMilitary sources said Buhari might have appointed a less qualified Yahaya, from Sokoto State, based on the president’s usual ethnic and religious sentiments as seen in his other various appointments.\nThe new army chief, Yahaya, now 55 years old, was taken by the Nigerian Army Infantry Corps on September 22, 1990.\nIn 2018, former President Olusegun Obasanjo wrote an open letter to Buhari, asking him not to bother to seek re-election.\nAlso, a retired Colonel Abubakar Umar, former military governor of Kaduna State, accused Buhari of nepotism, saying it could tear the country apart."
  },
  {
    "headline": "BREAKING: Two Officers Killed As Unknown Gunmen Attack Another Police Station In Delta",
    "summarized_story": "Unknown gunmen have attacked Umutu Police Divisional Headquarters in the Ukwuani Local Government Area of Delta state, killing at least two officers.\nSaharaReporters gathered that the hoodlums attacked the facility around 2:30am on Friday.\nThere has been a spate of attacks on security agencies in the South East and South South geopolitical zones of the country, which has compounded the security challenges in the two regions."
  },
  {
    "headline": "BREAKING: Two Officers Killed As Unknown Gunmen Attack Another Police Station In Delta",
    "summarized_story": "Unknown gunmen have attacked Umutu Police Divisional Headquarters in the Ukwuani Local Government Area of Delta state, killing at least two officers.\nSaharaReporters gathered that the hoodlums attacked the facility around 2:30am on Friday.\nThere has been a spate of attacks on security agencies in the South East and South South geopolitical zones of the country, which has compounded the security challenges in the two regions."
  },
  {
    "headline": "Kano University Sets Aside Day To Annually Celebrate Popular Arabian Clothe Called Abaya",
    "summarized_story": "Kano State University of Science and Technology has set aside May 27 to celebrate Arabian clothe known as abaya annually after some male students harassed a female student for her outfit.\nIn a viral online video, the students can be seen taunting the female student dressed in the Arabian clothe called abaya with chants of 'Mai Abaya', a loose fitting long garment that reaches to the ankles.\nThe school management described the actions of the male students as shameful and said their suspension was to serve as a warning to others.\nSeventeen male students are under investigation for their role in the incident and at least five have been suspended.\nThey were apprehended on Thursday for allegedly harassing the female student who wore the free flowing Arabian dress popularly known as Abaya."
  },
  {
    "headline": "ICYMI: Southern, northern Kaduna groups agree to split state into two",
    "summarized_story": "Representatives of southern and northern Kaduna have agreed to create two new states from the present Kaduna state.\nFor over 30 years, the people of southern Kaduna have always presented a case for a state creation.\nAhmed said they demand the creation of “new Kaduna state”, which will include ”Kaduna north and central senatorial zones”, adding those asking for Gurara state should have it.\n“Kaduna south has been complaining of marginalisation ever since, even though chiefdoms have been given to them and they occupy 60% of the workforce of Kaduna state.\nAdvertisement“Let the state be split and if they are asking for Gurara state, let them have it“On our part, we are asking for the creation of new Kaduna state, which will include Kaduna north and Kaduna central senatorial zones."
  },
  {
    "headline": "ICYMI: Southern, northern Kaduna groups agree to split state into two",
    "summarized_story": "Representatives of southern and northern Kaduna have agreed to create two new states from the present Kaduna state.\nFor over 30 years, the people of southern Kaduna have always presented a case for a state creation.\nAhmed said they demand the creation of “new Kaduna state”, which will include ”Kaduna north and central senatorial zones”, adding those asking for Gurara state should have it.\n“Kaduna south has been complaining of marginalisation ever since, even though chiefdoms have been given to them and they occupy 60% of the workforce of Kaduna state.\nAdvertisement“Let the state be split and if they are asking for Gurara state, let them have it“On our part, we are asking for the creation of new Kaduna state, which will include Kaduna north and Kaduna central senatorial zones."
  },
  {
    "headline": "Police begin investigation as #BenueUnderAttack trends on Twitter",
    "summarized_story": "There appears to be anxiety in Benue over the alleged killing of some people in Katsina Ala LGA of the state.\nBut the reported killings have led to an outrage on Twitter, a microblogging platform.\n— adunni (@_ShadeAK) May 28, 2021 AdvertisementThe world does not need to see, because the world will never do anything about it.\n“I have not been able to confirm that from any of the officers on the ground because there were no reports,” Sewuese said.\nSamuel Ortom, Benue governor, had asked residents of the state to protect themselves using weapons not prohibited by law."
  },
  {
    "headline": "Police begin investigation as #BenueUnderAttack trends on Twitter",
    "summarized_story": "There appears to be anxiety in Benue over the alleged killing of some people in Katsina Ala LGA of the state.\nBut the reported killings have led to an outrage on Twitter, a microblogging platform.\n— adunni (@_ShadeAK) May 28, 2021 AdvertisementThe world does not need to see, because the world will never do anything about it.\n“I have not been able to confirm that from any of the officers on the ground because there were no reports,” Sewuese said.\nSamuel Ortom, Benue governor, had asked residents of the state to protect themselves using weapons not prohibited by law."
  },
  {
    "headline": "MATTERS ARISING: Accountant-general's 'false' claim on status of Ibori loot is a jailable offence",
    "summarized_story": "Stakeholders, including Femi Falana, human rights lawyer, and Itse Sagay, chairman of the Presidential Advisory Committee Against Corruption (PACAC), also insisted that the funds should be returned to Delta state.\nAhmed Idris, accountant-general of the federation, on Tuesday, noted that the funds had been returned to the Delta state government.\nTo Delta state.\nIt was paid to Delta state,” Idris said while appearing before the senate committee investigating the status of recovered loot.\n“For now, no money has been returned to Delta state."
  },
  {
    "headline": "How can you make your company hack-proof? These five experts know.",
    "summarized_story": "Adeoluwa, Daniel, Joseph, Sophina and Nick will be discussing how you can protect your organization and customers from online fraud.\nAdeoluwa is a skilled Information Security Professional.\nHe is responsible for building the backend infrastructure, driving product roadmap, leading the technical team and driving company strategy.\nSophina is a cybersecurity professional currently working with a leading financial services firm.\nHe has over 13 years experience in the technology industry and has worked for multinational, leading technology companies."
  },
  {
    "headline": "GovTech In Nigeria: From Regulatory Maze to Models of Good Practice",
    "summarized_story": "Nigerian public procurement and regulation can be labyrinthine, but recent policy reforms and the model of good practice provided by Kaduna State hint at opportunities for public-purpose innovation to flourish in the country.\nIt has also mandated Nigerian companies with large public sector IT contracts to engage Nigerian startups as R&D partners on the projects.\nBut the Federal Government need not look far for inspiration; it can take a page out of the Kaduna State Government (KDSG)’s Govtech playbook.\nAccording to the World Bank’s latest subnational Doing Business ratings, Kaduna is the most accessible state to register property and get contracts enforced in Nigeria.\nKaduna’s example is an exciting preview of what could be should the Federal Government follow through on a promising start."
  },
  {
    "headline": "OPay in talks to raise $400 million from investors at $1.5bn valuation to finance expansion plans",
    "summarized_story": "OPay is reportedly in talks to raise $400 million from investors at a valuation of $1.5 billion, according to an exclusive report from The Information.\nOPay is looking to raise funding to finance its expansion plan, having launched in Egypt this year.\nAn Africa-focused company with Chinese backersWhile OPay is based in Nigeria, its backers are mostly Chinese companies like Meituan, a multi-billion-dollar Chinese shopping platform.\nIn July 2019, OPay raised $50 million from Sequoia Capital, IDG Capital, Source Code, GSR Ventures and Meituan-Dianping.\nYet, should they successfully raise $400 million, it will be the kind of war chest that makes anything possible."
  },
  {
    "headline": "Brand Africa Ranks TECNO 6th on the Most Admired brands in Africa List",
    "summarized_story": "– In the recently released Africa’s Best Brands 2021, TECNO ranked for five consecutive years among the TOP 6 brands on the African continent, marking another prestigious recognition of the brand’s leadership in Africa.\nEstablished in 2011, the Brand Africa 100: Africa’s Best Brands rankings is the most authoritative survey and analysis on brands and underlying businesses in Africa, based on a study by Geopoll across 28 countries spanning all the five economic regions and analysis and ranking by Kantar and Brand Leadership.\nThe 2021 survey was conducted between March and April 2021 and yielded over 80,000 brand mentions and over 3,500 unique brands.\nWhen TECNO launched dual SIM cards in Africa, there had been nothing of the kind before then.\nAnd now, with Brand Africa’s new rankings, TECNO has once again come out tops, becoming a leading player in mid to high-end mobile brand segments in Africa."
  },
  {
    "headline": "How OctaFX became the first financial company in Nigeria to organise a cooking session for Ramadan",
    "summarized_story": "OctaFX brought two popular bloggers together in a cooking studio: the comedian Apaokagi Maryam and the music video director Abdulazeez Greene.\nThey prepared a special evening meal for Ramadan called Iftar and compared the subtleties of cooking with those ingrained in trading.\n‘Ramadan Special’ is the first cooking show in Nigeria produced by a financial company.\nApaokagi Maryam is a frequent collaborator of the global Forex broker and took part in the last OctaFX Goal Booster promotion.\nThe company is aspiring to create more shows like ‘Ramadan Special’ in the future."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Celebrating the kids, Crypto withdrawal on PayPal, Facebook hiding Likes, Twitter Spaces arrives Web",
    "summarized_story": "Becoming even more crypto-friendly: Currently, PayPal users cannot withdraw or send cryptocurrencies directly to friends and families.\nMore crypto users?\nPayPal’s purported crypto tolerance could be a ploy to lure more crypto users to its platform.\nInstagram and Facebook users now have more control over their experience on the apps.\nThis way, Facebook satisfies those who feel pressured by Likes and those who depend on Like counts — such as influencers — to use the app."
  },
  {
    "headline": "News",
    "summarized_story": "The past few days have seen the value of cryptocurrencies take a massive dip, which is said to have stemmed from Elon Musk’s tweet.\nWhile this is not the worst crash the market has witnessed, how shou…"
  },
  {
    "headline": "Celebrating the kids, Crypto withdrawal on PayPal, Facebook hiding Likes, Twitter Spaces arrives Web",
    "summarized_story": "Becoming even more crypto-friendly: Currently, PayPal users cannot withdraw or send cryptocurrencies directly to friends and families.\nMore crypto users?\nPayPal’s purported crypto tolerance could be a ploy to lure more crypto users to its platform.\nInstagram and Facebook users now have more control over their experience on the apps.\nThis way, Facebook satisfies those who feel pressured by Likes and those who depend on Like counts — such as influencers — to use the app."
  },
  {
    "headline": "Low-wage manufacturing jobs can dent Nigeria’s unemployment problem",
    "summarized_story": "Creating low-skilled jobs in the manufacturing sector that offer lower wages can help Nigeria temporarily tackle unemployment problem, experts have said.\nWith the unemployment rate at 33.3 percent and youth unemployment rate at 42.5 percent, Nigeria’s population forecast could create a situation where the structure and pattern of growth are insufficiently geared towards job creation….\nDon’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Stanbic Bank lines up $100m to fund renewables in Nigeria",
    "summarized_story": "The manager of Nigeria’s biggest pension fund is to commit $100m in financing for the renewables sector but it’s also embracing solar energy for the good of its own business.\nStanbic IBTC will set aside the $100 million for lending to local companies in the renewables sector over the next three years to help boost…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Green Africa disrupts airline business with cheap airfares",
    "summarized_story": "“Actually, if I ran an airline in Nigeria, I would do exactly what Green Africa appears to be trying to do – target the mid-to-lower end of the market with cheap tickets by using propeller aircraft instead of jet aircraft.\n“If Green Africa does not get people to experience their flights, they won’t be able to penetrate the market.\nHe assured that after two weeks of offering promotional prices, Green Africa would begin to adjust prices to fit into current operational and economic realities.\nIt cost airlines between $500,000 and $1 million to carry out mandatory C-checks on their aircraft every 18 months.\nHowever, Tolu Odutola, a pilot and aviation expert, argued that Green Africa operates ATR 72-600, which are generally cheaper to maintain than the 737s, CRJs and other aircraft operated by local airlines."
  },
  {
    "headline": "Edo govt, UN strengthens collaboration to combat COVID-19, illegal migration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, met with a delegation of the United Nations to bolster the government’s efforts at containing the coronavirus (COVID-19) pandemic and further reduce the menace of irregular migration.\nThe delegation, headed by the United Nations Resident and Humanitarian Coordinator, Mr. Edward Kallon, was received at Government House in Benin City.\nPhilip Shaibu, reaffirmed the government’s commitment to containing the pandemic and curbing irregular migration among youths in the state.\nHe noted that the present administration of Governor Obaseki is putting in place reforms and policies to ensure a business-friendly environment to attract investment into the state.\nHe noted that a part of the aim for the visit was to discuss ideas that would put an end to irregular migration among youths in Edo."
  },
  {
    "headline": "Children’s Day: We must build strong institutions to assure better future for our children – Obaseki – Nigerian Observer",
    "summarized_story": "Children’s Day: We must build strong institutions to assure better future for our children – ObasekiShare FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has assured that his administration will sustain ongoing reforms to strengthen public institutions to guarantee a sustainable future for children in the state.\nThe governor made the submission in a statement to mark the 2021 Children’s Day celebration, adding that his administration will continue to implement policy reforms to benefit children in the state.\nHe said, “I am delighted to mark this year’s Children’s Day and celebrate our children, who are the future of Edo State and Nigeria.\n“Our children remain the most important stakeholders in the Nigerian project and all our developmental efforts must be geared towards building a vibrant country with critical institutions and structures to assure a better future for them.”According to him, “In Edo State, children are beneficiaries of very pragmatic reforms that we have undertaken in the education sector over these past four years.\nI wish all Edo children a very happy Children’s Day!!"
  },
  {
    "headline": "Ambrose Alli Varsity: Obaseki sets up special intervention team with Olotu as chair – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has appointed a Special Intervention Team to exercise all the powers and functions of the Governing Council of Ambrose Alli University in accordance with the provisions of the Ambrose Alli University (Special Intervention Powers) Law 2021, except with respect to the appointment and removal of Principal Officers.\nThe Special Intervention Team is chaired by the Managing Director of Schlumberger Nigeria Ltd, Mr. Andrew Olotu.\nOther members of the Special Intervention team include Bar.\nPatrick E. Inegbedion, Mr. Uyi Izekor, Prof. Esther Ikuoria, Mrs. Imo Okundaye, Mr. Emmanuel Etomi, Mr. Osen Iyahen, Mr. Yusuf Mohammed, Comr.\n“This Special Intervention Team shall exercise all the powers and function of the Governing Council of the University as contained in the Ambrose Alli University Law 1999 (as amended) except with respect to the appointment and removal of Principal Officers.”..."
  },
  {
    "headline": "EDSG pledges to pay outstanding emoluments of AAU Staff – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEKPOMA – Edo State Government has pledged to pay the emoluments, including Cheque off dues of the striking workers of the Ambrose Alli University, (AAU), Ekpoma, Edo State, as soon as they return back to work.\nHe declared that the vision of the state governor, Mr. Godwin Obaseki was to reposition the university, and address the issues militating against the progress of the state owned institution.\nHe solicited the support of the monarch and his community, promising the traditional ruler that he would not disappoint him.\n“I have no issue with with the decision of governor, since the decision is to move the university forward.\nThough the university in Ekpoma, it is a state owned university”, the monarch said."
  },
  {
    "headline": "BPE proposes privatisation of Transmission Company of Nigeria",
    "summarized_story": "ADVERTISEMENTIn a bid to transform the operations of the Transmission Company of Nigeria (TCN), the Bureau of Public Enterprises (BPE) has recommended the full privatisation of the country’s electricity transmission network.\nThe Transmission Company of Nigeria, which coordinates the nation’s electricity transmission network, is one of 18 companies that were unbundled from the defunct Power Holding Company of Nigeria (PHCN) in April 2004.\nTCN’s licensed activities include: electricity transmission, system operation and electricity trading.\n“The objective ultimately is for the government to exit the power sector and just let the private sector drive the sector,” he said.\nThe privatisation agency terminated all incomplete processes it had initiated in 2014 for all 10 facilities before introducing a new privatisation process."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Any PDP tour of Osun without resolution chairmanship tussle a waste of time – Adagunodo",
    "summarized_story": "The embattled chairman of Osun State Chapter of People’s Democratic Party (PDP) Hon.\nIt is not an official programme of the Osun State chapter of the Peoples Democratic Party.\nInterest groups within a political party are allowed to consult but this should not be misconstrued as an official programme of Osun PDP.\nThere is a difference between OSUN PDP AND PATHFINDER TEAM.\nWill you consider your removal as the genesis of the Osun PDP crisis?"
  },
  {
    "headline": "Unknown gunmen attack Police station in Delta, 5 killed",
    "summarized_story": "Some unknown gunmen in the early hours of Friday, attacked the Umutu police station, Ukwuani Local Government Area Delta, killing three police officers, while two of them were killed.\nThe state Police Public Relations Officer, Mr Bright Edafe who confirmed the attack in a statement, said “In the early hours of today 28th may 2021 at about 0130 hours, armed men in their numbers stormed Umutu police station.\n“The armed men had to retreat when they saw that the policemen on duty were not relenting, two of the armed bandit were gun down while others injured.\nThe Command lost two policemen, while one ASP died out of High Blood pressure in the hospital.\n“The armed bandit who came with the intention of causing mayhem and burning down the station and carting away arm did not succeed, as they could not penetrate the station, no arm loss, the station was not burnt, normalcy has been restored."
  },
  {
    "headline": "Nigeria needs N35trn infrastructure investments for double-digit growth – Emefiele",
    "summarized_story": "Governor of Nigeria’s Central Bank, Mr. Godwin Emefiele has said the country needs N35 trillion worth of investment in infrastructure to achieve double-digit economic growth.\nIn February, President Muhammadu Buhari approved the establishment of a N1 trillion infrastructure company (Infra-Co) to focus on critical infrastructural investments.\nAccording to Emefiele, “If we take into account Nigeria’s Infrastructure Masterplan, we require close to N35 trillion worth of investment to attain double-digit growth.\nIn the first quarter, Nigeria’s economy recorded a 0.51 percent growth, from 0.11 per cent recorded in the fourth quarter of 2020.\n“While this news is positive, growth is still well below our population growth of 2.7 per cent."
  },
  {
    "headline": "CBN disburses N333.2bn for projects in South South",
    "summarized_story": "Nigeria’s apex bank, the Central Bank of Nigeria (CBN), says it has disbursed N333.2bn for various projects in the South South geopolitical zone to provide funding for activities in different economic sectors.\nThe Governor, Central Bank of Nigeria, Godwin Emefiele, disclosed this on Thursday in Port-Harcourt at the launch of the Rivers Cassava Processing Company Limited.\nThe company is designed to support improved production and processing of cassava into high-quality flour in Rivers State.\nAccording to him, four South South states had accessed N7.4bn to boost their agriculture productivity.\nHe said the CBN had partnered with several states governments in the region under the Accelerated Agricultural Development Scheme."
  },
  {
    "headline": "Rivers: 7 ESN Members Killed As Security Operatives Raid Camp",
    "summarized_story": "No fewer than seven suspected armed members of the Eastern Security Network (ESN), were killed on Thursday evening when a joint security team, raided the group’s camp located in a forest between Oyigbo and Eleme local government areas of Rivers State.\nThe joint security team, comprising of personnel of the Nigerian Army, the Department of State Services (DSS) and the Nigerian Security and Civil Defence Corps (NSCDC), had stormed the camp located in the forest along Pipelines Road Ogali/Kom-Kom boundary between Eleme and Oyigbo local government areas.\nHowever, during the firefight, 7 x IPOB/ESN members were neutralized and 5 x suspects were arrested.\n“Items recovered during the clearance/raid include: Communication gadgets, assorted cell phones, army uniforms arms and ammunition were also recovered.\n“Also recovered from the camp two AK 47 rifles, two G3 rifles, one locally made machine gun and one G3 magazine."
  },
  {
    "headline": "Rivers: 7 ESN Members Killed As Security Operatives Raid Camp",
    "summarized_story": "No fewer than seven suspected armed members of the Eastern Security Network (ESN), were killed on Thursday evening when a joint security team, raided the group’s camp located in a forest between Oyigbo and Eleme local government areas of Rivers State.\nThe joint security team, comprising of personnel of the Nigerian Army, the Department of State Services (DSS) and the Nigerian Security and Civil Defence Corps (NSCDC), had stormed the camp located in the forest along Pipelines Road Ogali/Kom-Kom boundary between Eleme and Oyigbo local government areas.\nHowever, during the firefight, 7 x IPOB/ESN members were neutralized and 5 x suspects were arrested.\n“Items recovered during the clearance/raid include: Communication gadgets, assorted cell phones, army uniforms arms and ammunition were also recovered.\n“Also recovered from the camp two AK 47 rifles, two G3 rifles, one locally made machine gun and one G3 magazine."
  },
  {
    "headline": "Initiative Tasks MDAs On Financial Transparency",
    "summarized_story": "A non-governmental organisation, Transparency Advocacy for Development Initiative (TADI) has hailed the management of Fiscal Responsibly Commission (FRC) for their outstanding leadership that has led to the return of over N2.15 trillion into the Consolidated Revenue Fund (CRF) of the federal government over the past years as operating surplus.\nAddressing journalists on Wednesday in Abuja, executive director, TADI, Amb.\nYomi David, called on other government agencies to emulate the prudent leadership of the FRC chairman, Victor Muruako.\nDavid said, to culminate the historic event, the TADI leadership has officially passed a vote of confidence on Muruako and presented him with its outstanding “Certificate of Credence” in recognition of his exemplary performances and forthright servitude to his fatherland.\nHe said, ‘’The Initiative equally used the medium to formally congratulate the commission’s chairman on his confirmation as the substantive head of the commission having served in acting capacity for the last seven years before being confirmed by the Senate early this year, an attestation of his prudent, dexterous and charismatic doggedness at the helm of affairs of the sensitive commission."
  },
  {
    "headline": "Initiative Tasks MDAs On Financial Transparency",
    "summarized_story": "A non-governmental organisation, Transparency Advocacy for Development Initiative (TADI) has hailed the management of Fiscal Responsibly Commission (FRC) for their outstanding leadership that has led to the return of over N2.15 trillion into the Consolidated Revenue Fund (CRF) of the federal government over the past years as operating surplus.\nAddressing journalists on Wednesday in Abuja, executive director, TADI, Amb.\nYomi David, called on other government agencies to emulate the prudent leadership of the FRC chairman, Victor Muruako.\nDavid said, to culminate the historic event, the TADI leadership has officially passed a vote of confidence on Muruako and presented him with its outstanding “Certificate of Credence” in recognition of his exemplary performances and forthright servitude to his fatherland.\nHe said, ‘’The Initiative equally used the medium to formally congratulate the commission’s chairman on his confirmation as the substantive head of the commission having served in acting capacity for the last seven years before being confirmed by the Senate early this year, an attestation of his prudent, dexterous and charismatic doggedness at the helm of affairs of the sensitive commission."
  },
  {
    "headline": "Children’s Day: UNICEF Calls For Protection Of Child’s Rights",
    "summarized_story": "The United Nations Children’s Fund (UNICEF) has called for the protection of the child’s rights while celebrating the Nigerian children on Thursday, May 27.\nUNICEF, in a statement, noted that the COVID-19 crisis has been a child rights crisis in Nigeria and around the world.\nThe orgsnisation said, “On this Nigerian Children’s Day, let us all agree that we cannot let one crisis compound another.\n“The pandemic is threatening decades of progress we have made for children.\n“Violence is perpetrated against one in four Nigerian children – and one in three Nigerian girls are sexually abused."
  },
  {
    "headline": "Excitement, challenges on ancestral throne for 22 yrs -His Royal Highness",
    "summarized_story": "It has been twenty-two years down the line when this very difficult decision was taken by His Royal Highness, Alhaji Aliu Kelvin Danesi.\nOba Idanesi II, who always waxed philosophical whenever he engaged other people in discussions, will always say, “In all situations, always endeavor to extract the honey but do not break the hive.\nIf you must know, this is how, I have survived my nineteen years sojourn on the throne so far.\nHis Royal Highness Aliu Kelvin Danesi, the Aidonojie of South-Ibie, concludes, “We should always accept life as it is.\nAny surprise that Oba Idanesi II has done so well for himself and the people of South-Ibie, during his twenty-two years reign on the throne of South-Ibie?"
  },
  {
    "headline": "Restitution Funds and Benin Royal Museum — Daily Times Nigeria",
    "summarized_story": "The prized heritage items were stolen from the Benin Palace in 1889 by the British forces that invaded ancient city in that year.\nI’m told that you are the representative of Legacy Restoration Trust in Benin and in Nigeria.\nThe following international museums and institutions, Osaretin stressed, are also collaborating effectively with the Benin Palace on the stolen items.\nThey are the University of Aberdeen, Museum of Archaeology and Anthropology (MAA), Cambridge, The British Museum (BM) London, Pitt Rivers Museum, Oxford, Great North Museum, Newcastle.\nThe Royal Pavilion & Museum Trust, (RPMT), Brighton."
  },
  {
    "headline": "Lawan tasks ECOWAS Parliament on terrorism, cross-border crimes —",
    "summarized_story": "Tunde Opalana, AbujaPresident of the Senate, Ahmad Lawan, has charged the Economic Community of West African States (ECOWAS) Parliament to, as a matter of urgency, seeks ways of addressing the prevalence of terrorism and irregular migration affecting member states.\nLawan gave the charge on Thursday in a speech delivered during the 2021 First Ordinary Session of the Economic Community of West African States (ECOWAS) Parliament.\n“An accord of purpose between member nations creates the needed synergy for the actualization of uniform visions.\n“I am additionally assured that we are well prepared to make our inputs from our individual appreciation of the issues, towards finding lasting solutions to the challenges.”Among those present at the 2021 First Ordinary Session of the ECOWAS Parliament are the Speaker of the ECOWAS Parliament, Rt.\nJewel Cianeh Taylor; and President of the ECOWAS Community Court of Justice, Honourable Justice Edward Amoako Asante."
  },
  {
    "headline": "B-lord group will be biggest company in Nigeria soon – Williams Ifejika, CEO",
    "summarized_story": "By Mutiat AlliWilliams Ifejika, popularly known as Bitcoin Lord or Blord, has continued to soar as a serial entrepreneur.\nThe Anambra State – based tycoon has buttress on his readiness to make his company, B-lord group the biggest company in Nigeria soon.\nThe popular Bitcoin merchant who recently splashed millions on a new whip, Mercedes-Benz GLE 350 luxury SUV said, “We are Africa’s biggest crypto vendor and we buy bulk BTC.\nThe other two cars, his Mercedes-Benz vehicles, are yet to be released.\nEFCC’s refusal to give back the vehicles later forced Bitcoin Lord to drag the Nigerian law enforcement agency to court."
  },
  {
    "headline": "UEFA: Chukwueze ranked 16,th as Europa names Fernandes best player",
    "summarized_story": "Manchester United midfielder Bruno Fernandes has been ranked the Europa League’s best player while Nigerian Villarreal winger Samuel Chukwueze is the 16th best player of the just-concluded Europe’s second-tier league competition by UEFA, The PUNCH reports.\nReigning champions Villarreal edged Manchester United 11-10 on penalties after score stood at 1-1 in Wednesday night’s Europa League final in Gdansk.\nBruno Fernandes was the top-ranked player of the competition with 9531 points.\nVillarreal’s Gerard Moreno is second with 8555 points, while Manchester United’s Edinson Cavani finished third with 8506 points.\nThe winger, who is the only Nigerian in the top 100, was ranked ahead of Arsenal trio Thomas Partey, Martin Odegaard and Granit Xhaka."
  },
  {
    "headline": "UEFA: Chukwueze ranked 16,th as Europa names Fernandes best player",
    "summarized_story": "Manchester United midfielder Bruno Fernandes has been ranked the Europa League’s best player while Nigerian Villarreal winger Samuel Chukwueze is the 16th best player of the just-concluded Europe’s second-tier league competition by UEFA, The PUNCH reports.\nReigning champions Villarreal edged Manchester United 11-10 on penalties after score stood at 1-1 in Wednesday night’s Europa League final in Gdansk.\nBruno Fernandes was the top-ranked player of the competition with 9531 points.\nVillarreal’s Gerard Moreno is second with 8555 points, while Manchester United’s Edinson Cavani finished third with 8506 points.\nThe winger, who is the only Nigerian in the top 100, was ranked ahead of Arsenal trio Thomas Partey, Martin Odegaard and Granit Xhaka."
  },
  {
    "headline": "How abuse of wife landed Empire star Bryshere Gray sentenced in jail",
    "summarized_story": "American actor, Bryshere Gray, who played the role of Hakeem Lyon in Fox’s Empire series, has been reported to have entered a guilty plea in his domestic violence case.\nAs part of his plea agreement, per the latest report, Gray will be required to spend a brief period in jail.\nAdditionally, Gray is said to have been ordered to pay restitution and enrol in a domestic violence offender treatment program.\nIn July 2020, a regional ABC outlet reported that Gray had been arrested in Goodyear, Arizona, in connection with a domestic violence incident.\nSWAT and Crisis Negotiations officials were then dispersed to the home, where Gray later surrendered to authorities early the following morning."
  },
  {
    "headline": "How abuse of wife landed Empire star Bryshere Gray sentenced in jail",
    "summarized_story": "American actor, Bryshere Gray, who played the role of Hakeem Lyon in Fox’s Empire series, has been reported to have entered a guilty plea in his domestic violence case.\nAs part of his plea agreement, per the latest report, Gray will be required to spend a brief period in jail.\nAdditionally, Gray is said to have been ordered to pay restitution and enrol in a domestic violence offender treatment program.\nIn July 2020, a regional ABC outlet reported that Gray had been arrested in Goodyear, Arizona, in connection with a domestic violence incident.\nSWAT and Crisis Negotiations officials were then dispersed to the home, where Gray later surrendered to authorities early the following morning."
  },
  {
    "headline": "Bishop Wale Oke blows hot against Sharia agenda in South-west",
    "summarized_story": "President of Pentecostal Fellowship of Nigeria (PFN), Bishop Francis Wale Oke, has kicked against the move to introduce Sharia law to the South-West states in the country.\nHe further warned those pushing the ‘Fulani agenda’ to drop it or else they will drop dead.\n“Tell them I am in the South West and there is no way for sharia here.\n“They are pushing Nigeria to the point of breaking apart, by the mercy of God Nigeria will not break.\nThey now want to create religious confusion in the South West?"
  },
  {
    "headline": "Foundation to distribute 5m sanitary pads",
    "summarized_story": "The AIDS Healthcare Foundation (AHF) Nigeria, is to distribute five million sanitary pads in Africa, to promote menstrual hygiene practices.\nAHF Deputy Chief, disclosed its theme as: “A Necessity, Not a Luxury!’’ saying the foundation would be launching a campaign to distribute five million sanitary pads across African countries.\nLutung however, noted that sanitary pads should be considered a necessity, as lack of access to menstrual health and hygiene needs could lead to stigma, harassment, and social exclusion, particularly for adolescent girls.\n“We therefore owe our girls this monthly necessity as the Foundation will be making available over 40, 000 sanitary towels both disposable and reusable to young and indigent girls during the commemoration.\n“The foundation will also donate sanitary pads to the Sanitary Pad Bank Initiative of the Federal Ministry of Women’s Affairs,’’ Ijezie said."
  },
  {
    "headline": "Gunmen attack Umutu police station in Delta; kill 2 cops",
    "summarized_story": "Michael AdeshinaArmed men in their numbers attacked Umutu police station, in Delta state, in the early hours of today 28th May, 2021.\nBright noted that the attack took place at about 0130 hours today.\nHe said the criminals were faced with stiff resistance by policemen on duty.\nHe added that two of the gunmen were also killed but their bodies were taken away by other members of the criminal gang.\n“The Command lost two policemen, while one ASP died out of High Blood pressure in the hospital."
  },
  {
    "headline": "Outrage As Fulani Herdsmen Kill 36 Benue Residents, College Students",
    "summarized_story": "In the latest round of violence, Fulani herders attacked Shikaan Mbagena Kpav, a TIV town in Benue State, murdering at least 36 people, including students from Katsina Ala College of Education.\nAccording to NEWS DIRECT, the Fulani assailants assaulted the community in the early hours of Thursday morning and massacred the residents.\nOn social media, Nigerians were outraged by the episode, which they described as a “quiet genocide” perpetrated by President Muhammadu Buhari’s government.\nPls Retweet to the World to see,” another wrote.\n“If you see these pictures about the Genocide on going in Benue State and you are not scared or worried then you are not human."
  },
  {
    "headline": "PFN Warns Against Introduction Of Sharia Law In South-West",
    "summarized_story": "The Pentecostal Fellowship of Nigeria (PFN) Wednesday warned against underhanded attempts by some groups to impose Sharia rule in the country’s southwest through the Senate’s ongoing constitutional review.\nSharia law is alien to our culture of religious existence in the SouthWest.\nDon’t instigate religious crisis in the SouthWest, as this could further threaten the fragile peace of the country.\n“Without the Sharia, we have always lived peacefully with our Muslim brothers.\nIt implored them to always comport themselves by not taking laws into their hands, but make peaceful co-existence their watchword."
  },
  {
    "headline": "BREAKING: Unknown Gunmen Attack Police Station, Kill Two Officers In Delta",
    "summarized_story": "Unknown gunmen allegedly attacked the Umutu Police Divisional Headquarters in Delta State’s Ukwuani Local Government Area around 2 a.m. on Friday.\nIt was unclear whether the attackers took any weapons or ammo from the police station.\nThe gunmen stormed the community from the Ndemili axis, wreaking devastation on the Police Station, according to reports.\nWhen contacted for comments at about 7:13 am, the Delta State Commissioner of Police, CP Ari Muhammed Ali said,”No comments for now.\nAs at the time filings this report, there is serious tension in Umutu community."
  },
  {
    "headline": "Pictures: Fire razes oil tanker on Otedola bridge in Lagos",
    "summarized_story": ""
  },
  {
    "headline": "Pictures: ECOWAS special envoy on Mali, ex-President Goodluck Jonathan, meets President Buhari",
    "summarized_story": ""
  },
  {
    "headline": "Pictures: Commendienne Ada Jesus buried amidst tears in Imo",
    "summarized_story": "PreviousPDP in denial of its problems, control by godfathers, says APC group"
  },
  {
    "headline": "Disregard bill seeking to scrap NYSC, youth group tells NASS leadership -NigPilot",
    "summarized_story": "The group’s president, Obande Gideon Obande made this known in a statement titled ‘Move by Green Chambers to Scrap NYSC Scheme; A Major Drift Away from National Unity’ on Wednesday.\nAccording to Obande, the NYSC was established to unite Nigerians after the civil war.\nHe, therefore, warned that an attempt to scrap the NYSC will rather jeopardise the chances of a greater united Nigeria, one envisaged by our leaders past.\n“In view of the aforementioned and many other reasons, as Concerned Nigerian Youth we align our position with other progressives calling for total disregard for this bill,” Obande added.\nHe, however, called on all members of the Nigerian parliament with the interest of the Nigerian youth at heart to rise up against the obnoxious bill."
  },
  {
    "headline": "Disregard bill seeking to scrap NYSC, youth group tells NASS leadership -NigPilot",
    "summarized_story": "The group’s president, Obande Gideon Obande made this known in a statement titled ‘Move by Green Chambers to Scrap NYSC Scheme; A Major Drift Away from National Unity’ on Wednesday.\nAccording to Obande, the NYSC was established to unite Nigerians after the civil war.\nHe, therefore, warned that an attempt to scrap the NYSC will rather jeopardise the chances of a greater united Nigeria, one envisaged by our leaders past.\n“In view of the aforementioned and many other reasons, as Concerned Nigerian Youth we align our position with other progressives calling for total disregard for this bill,” Obande added.\nHe, however, called on all members of the Nigerian parliament with the interest of the Nigerian youth at heart to rise up against the obnoxious bill."
  },
  {
    "headline": "AREWA PERSONS WITH DISABILITIES FORUM BEGINS COVID-19 VACCINATION -NigPilot",
    "summarized_story": "The Executive Secretary National Commission for Persons with Disabilities (NCPWD) Mr. James Lalu has applauded President Muhammadu Buhari for giving persons with Disabilities a common ground to dwell on.\nThis was made known at the Arewa covid 19 vaccination and consultative meeting held in kaduna.\nIn his opening remarks, The Executive Secretary thanked Mr President for the signing into an Act, the Prohibition Against Persons with Disabilities Act 2018 and in furtherance the creation of the National Commission for Persons with Disabilities.\nHe welcomed all stakeholders to the forum put together by the Arewa PWDs to Deliberate on how to strategically strengthen issues of Disabilities.\nShe further added that the forum was attended by Stakeholders in the Disability Community, leaders of different clusters, SA’s to President Muhammad Buhari, Council Members and Management of the National Commission for Persons with Disabilities."
  },
  {
    "headline": "AREWA PERSONS WITH DISABILITIES FORUM BEGINS COVID-19 VACCINATION -NigPilot",
    "summarized_story": "The Executive Secretary National Commission for Persons with Disabilities (NCPWD) Mr. James Lalu has applauded President Muhammadu Buhari for giving persons with Disabilities a common ground to dwell on.\nThis was made known at the Arewa covid 19 vaccination and consultative meeting held in kaduna.\nIn his opening remarks, The Executive Secretary thanked Mr President for the signing into an Act, the Prohibition Against Persons with Disabilities Act 2018 and in furtherance the creation of the National Commission for Persons with Disabilities.\nHe welcomed all stakeholders to the forum put together by the Arewa PWDs to Deliberate on how to strategically strengthen issues of Disabilities.\nShe further added that the forum was attended by Stakeholders in the Disability Community, leaders of different clusters, SA’s to President Muhammad Buhari, Council Members and Management of the National Commission for Persons with Disabilities."
  },
  {
    "headline": "FG orders for immediate release of detained Malian leaders -NigPilot",
    "summarized_story": "The Federal Government of Nigeria has ordered the military junta in Mali to immediately and unconditionally release the detained transitional President and Prime Minister.\nAccording to the statement, “The Federal Government of Nigeria condemns in strong terms the detention of the duo of interim President Bah Ndaw and Prime Minister Moctar Ouane of Mali.\nThe sacking of the pillars of the coup was an enormous misjudgement,” a senior former Malian government official told the international medium.\nThe United Nations’ mission in Mali called for the group’s “immediate and unconditional” release and said those who hold the leaders would have to answer for their actions.\nThe U.S. State Department called in a statement for the “unconditional release of those currently being held”."
  },
  {
    "headline": "Three Officers Killed In Attack On Delta Police Station",
    "summarized_story": "Three officers have been killed in an attack on the Umutu Police Divisional Headquarters in Ukwuani Local Government Area of Delta State.\nThe Acting Public Police Relations Officer Bright Edafe confirmed the incident in a statement on Friday.\nEdafe noted that the incident started at about 2.am when armed men in their numbers stormed the Umutu police formation, shooting sporadically at the station.\nThe attackers invaded the police station in the early hours of the day with three officers feared dead.\nNigeria’s security situation has worsened in recent months despite the federal government’s reassurances and efforts by security agencies."
  },
  {
    "headline": "We Suffered 41 Attacks In Two Years, INEC Laments",
    "summarized_story": "﻿The Independent National Electoral Commission (INEC) says within the last two years, its offices and facilities have been attacked 41 times.\nProf Yakubu stated that nine of the incidents happened in 2019 while 21 cases were recorded in 2020.\nHe added that “In the last four weeks, 11 offices of the commission were either set ablaze or vandalized”.\nYakubu further noted that two of these incidents were caused by Boko Haram and bandits’ attacks while 10 resulted from thuggery during the election and post-election violence.\nGraphical details of attacks on INEC Offices since the 2019 General Election, as at 24th May 2021 (1) pic.twitter.com/xhIYp9eBvI — INEC Nigeria (@inecnigeria) May 27, 2021Graphical details of attacks on INEC Offices since the 2019 General Election, as at 24th May 2021 (3) pic.twitter.com/zXJocliHvx — INEC Nigeria (@inecnigeria) May 27, 2021Graphical details of attacks on INEC Offices since the 2019 General Election, as at 24th May 2021 (4) pic.twitter.com/kTDdp3Gen8 — INEC Nigeria (@inecnigeria) May 27, 2021Attacks on INEC Offices since the 2019 General Election, as at Monday 24th May 2021 (1) pic.twitter.com/ArZhXhV6Wb — INEC Nigeria (@inecnigeria) May 27, 2021Attacks on INEC Offices since the 2019 General Election, as at Monday 24th May 2021 (3) pic.twitter.com/3aQQhbC3Tv — INEC Nigeria (@inecnigeria) May 27, 2021Attacks on INEC Offices since the 2019 General Election, as at Monday 24th May 2021 (4) pic.twitter.com/huQGR08Miv — INEC Nigeria (@inecnigeria) May 27, 2021Attacks on INEC Offices since the 2019 General Election, as at Monday 24th May 2021 (2) pic.twitter.com/FUgI2T55yE — INEC Nigeria (@inecnigeria) May 27, 2021"
  },
  {
    "headline": "Our Greatest Legacy Is To Give You A Better Country, Buhari Tells Nigerian Children",
    "summarized_story": "President Muhammadu Buhari Thursday celebrated Children’s Day with a solemn promise to bequeath a better country for the present and future generations.\nAs part of the activities to commemorate Children’s Day, observed on May 27, the President hosted a group of Nigerian children at the State House.\nAccording to the President’s special media aide, Garba Shehu, the short ceremony witnessed the cutting of a ‘national cake’, a guided tour of the President’s office, meeting rooms, banquet hall, and the zoo at the Presidential Villa.\nDescribing children as precious blessings who should be nurtured to carry the burden of the society in the future, President Buhari, after spending a memorable time with his august visitors, bade them farewell, saying:“Bye-bye, see you next year.”Below are some photos from the Children’s Day celebration at the State House.\nREAD ALSO: PHOTOS: Buhari Celebrates Children’s Day"
  },
  {
    "headline": "Malami Denies Receiving N2bn From Recovered Loots",
    "summarized_story": "Attorney General of the Federation and Minister of Justice, Abubakar Malami (SAN) has denied allegations suggesting that N2 billion was paid to his office from the recovered funds.\nMalami, therefore, challenged any person who has any evidence of such payments to either him or his office, to come out publicly with proofs.\nN2bn Illegally PaidEarlier in the week, a House of Representatives panel said the Central Bank of Nigeria (CBN) illegally paid N2 billion to Abubakar Malami, attorney-general of the federation (AGF), from recovered loot.\nAt its sitting on Tuesday, the house ad hoc committee probing the status of recovered loot queried Malami on the funds which they said they never approved as a budgetary allocation.\nThey also challenged the Minister of Justice for allegedly requesting payment of approved solicitors’ fees from the recovered assets, a claim which Malami utterly denied."
  },
  {
    "headline": "Man City, Chelsea Eye Champions League Glory In Porto Final",
    "summarized_story": "Pep Guardiola’s Manchester City are 90 minutes away from the trophy they so desperately crave but a Chelsea side transformed in recent months stand in their way in Saturday’s all-English Champions League final in Porto, the Portuguese city which was named as a last-minute host.\nAnd these are the two clubs whose own transformations in the last two decades under mega-rich foreign owners have done the most to change forever the landscape of the Premier League.\nNot so long ago, the idea of Chelsea and City meeting in the biggest club game of all would have been laughable.\nTheir only previous encounter in a final came in 1986 in the short-lived Full Members Cup, when Chelsea won 5-4 at Wembley.\nThat was before the Premier League and modern Champions League existed before Roman Abramovich bought Chelsea in 2003 and before the Abu Dhabi takeover of City in 2008."
  },
  {
    "headline": "Civil Society groups protest on Day of National Mourning over rising insecurity",
    "summarized_story": "Concerned civil society groups have taken to the streets across Nigeria to protest against rising cases of kidnapping in the country.\nIn Lagos, the national day of mourning was commemorated to remember victims of violent killings across the country.\nThe protesters used the occasion as an avenue to demand for accountability in the provision of security and welfare for Nigerian citizens.\nThey moved to the Lagos State House of Assembly to submit their 6-point demand to the lawmakers, including their petition."
  },
  {
    "headline": "Kidnapping: Zamfara Govt releases pictures of rescued victims",
    "summarized_story": "Zamfara state government has released the pictures of the seventy five kidnap victims rescued through the state peace and dialogue initiative with bandits.\nThe pictures were released by the state commissioner for information Ibrahim DosaraThe kidnap victims whom were mostly women and children are natives of Yar Katsina village of Bingi area in Bungudu local government of Zamfara state.\nThey regained freedom from their abductors last Wednesday after days in captivityAuthorities of the state government says no ransom was paid for their release and were rescued unhurtAdvertisementThe victims have been reunited with their families."
  },
  {
    "headline": "Wike Threatens To Flog The Hell Out Of Ex-Niger Governor – Trending with Ojy Okpe",
    "summarized_story": "Nysome Wike, the Governor of Rivers state on Thursday threatened to Flog the hell out of the former Governor of Niger state, Babangida Aliyu for calling him a dictator.\nFollowing the appointment of new Chief of Army Staff Major General Farouk Yahaya, a video of soldiers jubilating with their commander has now gone viralThe Brekete Family Show Under the Human Rights Radio, hosted by Ahmad Isah has been suspended by the the National Broadcasting Commission for a clear violation of the broadcasting code."
  },
  {
    "headline": "Arinola Oloko Speaks on Constitutional Review and Encounter with Remi Tinubu",
    "summarized_story": "A Nigerian politician and educationist, Arinola Oloko has questioned the choice of Marriot Hotel in southwestern Lagos state as the venue for a public hearing on the review of the 1999 constitution as against the earlier booked Tafawa Balewa Square (TBS).\nThe Marriot hotel could only accommodate 250 participants in a state that has a population of over 10 million peopliewe.\nMs Oloko whom had been insulted by the Senator representing Lagos Central, Oluremi Tinubu and called her a thug, said that the review was not a fair one as the organisers never wanted them to be a part of it.\nShe said this on Friday when she featured on an ARISE News programme, The Morning Show.\nWatch the video."
  },
  {
    "headline": "‘Shut Up! Get This Thug Out of Here’: Arinola Oloko Recounts Encounter with Remi Tinubu – Arise News",
    "summarized_story": "Nigerian politician and educationist, Arinola Oloko has told ARISE News how a Nigerian Senator representing Lagos Central, Oluremi Tinubu called her a thug and demanded the police whisk her away from a public hearing of the constitutional review.\nMs Tinubu, the wife of APC chieftain Bola Tinubu is leading the Senate Committee on Review of the 1999 Constitution in the South-West.\nAccording to Ms Oloko, she had only complained about the limited space at the venue of the hearing which she says could only contain 250 people before Ms Tinubu told her to “shut up” and called her a thug.\nShe said this on Friday when she featured on an ARISE News programme, The Morning Show.\nWatch the video for more…"
  },
  {
    "headline": "Ogun Governor’s Aide Abidemi Rufai Indicted for ‘$350k Fraud’, Remains in Custody",
    "summarized_story": "The US says Abidemi Rufai, a senior special assistant to Ogun State Governor, Dapo Abiodun, governor of Ogun remains in custody at the Metropolitan Detention Center in Brooklyn, New York he was indicted for alleged conspiracy, wire fraud, and aggravated identity theft.\n“Rufai is now charged with conspiracy to commit wire fraud, nine counts of wire fraud, and five counts of aggravated identity theft,” the statement reads.\nRufai used variations of a single e-mail address in a manner intended to evade automatic detection by fraud systems.\n“Rufai was residing at his brother’s home during part of the period of the fraud.\nAccording to the US attorney, conspiracy to commit wire fraud and wire fraud are punishable by up to 30 years in prison when the offence relates to benefits paid in connection with a presidentially-declared disaster or emergency, such as the COVID-19 pandemic."
  },
  {
    "headline": "Nigeria Names 132 Travellers Who Violated Covid Protocols",
    "summarized_story": "The Nigerian government has released a second batch of names of travellers who reportedly violated the protocol for international passengers.\nThe travellers have now been directed to report to the nearest government health facility within the next 48 hours.\nFurther sanctions to be taken against the travellers will also include “disabling their travel passports for a period not less than one year, and cancellation of visas/permits of foreigners”.\nThe PSC had last week released names of 90 travellers accused of violating the protocol on mandatory self-siolation for passengers from Brazel, Turkey, and India.\nThe Nigerian government had mandated travellers who arrived the country within 14 days of visiting the three countries to embark on isolation."
  }
]