[
  {
    "headline": "FG dismisses NARD strike, doctors down tools today",
    "summarized_story": "THE Federal Government on Sunday said it was not aware of any plan by the National Association of Resident Doctors to embark on strike on Monday (today).\nThis was just as NARD maintained that there was no going back on the planned strike.\nI cannot confirm if there is any document in the office concerning NARD and strike.\nLagos denies slashing NYSC doctors’ payMeanwhile, the Lagos State Government has dismissed claims by NARD that it directed a reduction in the monthly payment of National Youth Service Corps doctors from N75,000 to N15,000.\nThe statement titled, ‘LASG did not issue directive to reduce allowances of NYSC doctors –Commissioner,’ described the claim of the purported reduction of NYSC doctors’ allowances as false and misleading."
  },
  {
    "headline": "LG chair orders suspension of seven-day East-West road protest",
    "summarized_story": "SEVEN days after hundreds of youths shut down the Eleme section of the East-West road in Rivers State to protest the deplorable state of the road, the action was on Sunday suspended and the road reopenedThe Chairman of Eleme Local Government Area, Obarilomate Ollor, announced the suspension of the protest while addressing newsmen along with officials of RCC, the contracting firm at the Trailer Park in Onne, Eleme LGA.\nOllor said the Minister of Niger Delta Affairs, Senator Godswill Akpabio, had given his words that the Federal Government was sourcing the sum of N85bn, being the cost of the project, to ensure its take-off and completion in record time.\n“Three days ago, the Hon.\nMinister of Niger Delta Affairs (Senator Godswill Akpabio) phoned me through the Permanent Secretary and told me that he has got approval of N2.5bn for work to commence on this road.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Insecurity: Nigerians urged to go beyond prayers, activate rights to self-defence",
    "summarized_story": "“I don’t know.\n“Unfortunately, we have never had a common vision and a common understanding of our problem.\nThey are solving problems in a way that will align with their own strategic ethnic geopolitical needs.\n“Like I said today, you need humility to say that you don’t know and seek for answers to “why is this happening?\nThey don’t know the problem, they don’t care about the people and they cannot even execute the solutions well”, Dr Amadi said."
  },
  {
    "headline": "Abia govt raises alarm on plot by group to attack, kidnap VIPs",
    "summarized_story": "The Abia State Government has raised an alarm on a plot by group to foment trouble in the state by attacking and kidnapping individuals in the state.\nThis was revealed in a press statement signed by Chief John Kalu, the Abia State Commissioner for Information.\nThe statement reads, “Abia State Government has uncovered plots by renegade ground of a non state group to attack and kidnap prominent persons in the state including public office holders, traditional rulers, members of the clergy, and hold them as human shield and ransom for negotiations.\nGovernment further appeals to all citizens and visitors to keep their focus on maintaining the existing peace in the state and avoid acts that are capable of reversing the gains we have made collectively in securing the State through the understanding and cooperation of all.\nVanguard News Nigeria"
  },
  {
    "headline": "Zulum visits Marte, provides returnees with livelihood support",
    "summarized_story": "By Ndahi Marama, MaiduguriBorno State Governor, Babagana Umara Zulum, on Sunday visited returnees in Garade, a community in Marte Local Government Area.\nThe Governor provided livelihood support to enable them meet up their needs.\nZulum also discussed modalities for providing support to enhance dry season farming activities in order to strengthen livelihood capabilities of the returnees.\nWhile in Marte, Zulum took time to visit a makeshift market established by the returnees.\nMarte Local Government was one of the Boko Haram insurgents strong hold liberated by the Nigerian military and the Multinational Joint Taskforce."
  },
  {
    "headline": "Directive to reduce NYSC doctors’ allowances in Lagos, false – Commissioner",
    "summarized_story": "According to Ponnle, “Lagos State Government has noted the decision of the National Association of Residents Doctors (NARD) to call out doctors on a strike from Monday, 2nd August 2, 2021.\n“The decision followed the directive of its National Executive Committee meeting held in Umuahia on 30th July, 2021.\nREAD ALSO: Buhari consoles NYSC over tragic death of 5 Corps members“The communique cited, among other grievances, a purported directive from the Lagos State Government, through the Ministry of Special Duties, to reduce the monthly payment of NYSC Doctors from N75,000 to N15,000, effective July 2021.\n“Governor Babajide Olusola Sanwo-Olu remains committed to the welfare of Lagos State Government employees, particularly the health workers who have showed commitment, bravery and resilience in the fight against the Covid-19 pandemic,” she stated.\nWe, therefore, appeal for restraint by the Lagos Chapter of the Association of Resident Doctors and Nigerian Medical Association."
  },
  {
    "headline": "Stop threat of lockdown in South East Zone, VON DG counsels IPOB",
    "summarized_story": "The Director General of the Voice of Nigeria (VON), Mr Osita Okechukwu, has counselled the outlawed Indigenous People of Biafra (IPOB) against threatening a lockdown in the South-East Zone every Monday.\nOkechukwu, however, urged the South East Zone to consider the immense infrastructural development being undertaken by the Muhammadu Buhari administration in the zone.\n“Let me for the umpteenth time appeal to my brothers in IPOB to sheath their sword, for to lockdown the South-East is simply waging atrocious war against Ndigbo.\n“Accordingly, it will be very big error for IPOB to lockdown the South-East and think they are tough, strategic and will achieve any meaningful result, capital NO.\n“IPOB should not cut off Ndigbo’s nose to spite Buhari’s face, for Buhari is compensating with infrastructure."
  },
  {
    "headline": "Hushpuppi: Igboho’s lawyer reacts to suspension of Abba Kyari, advises IGP, Baba",
    "summarized_story": "Pelumi Olajengbesi, the lawyer to the Yoruba Nation activist, Sunday Adeyemo, (Sunday Igboho), has reacted to the suspension of Abba Kyari, Deputy Commissioner of Police, by the Nigeria Police Force, NPF.\nHe urged the Inspector-General of Police, Usman Alkali Baba, to make the trial of Kyari over alleged bribery open with full press access.\nThe United States Federal Bureau of Investigation, FBI, had linked Kyari to Hushpuppi during their investigation.\nThe FBI had alleged that Hushpuppi bribed Kyari to jail an errant gang member over a fraud deal worth millions of dollars.\nFollowing the revelation, the Inspector-General of Police, Usman Alkali Baba, had recommended Kyari’s suspension pending the outcome of investigations."
  },
  {
    "headline": "Abba Kyari: HURIWA advocates disqualification of Braimoh from investigative team",
    "summarized_story": "Human Rights Writers Association of Nigeria, HURIWA, has warned of adverse consequences if the federal government sweep under the carpet the indictment of super cop, Abba Kyari by the United States authorities.\nAbba Kyari: Why US is out to expose Buhari’s govt – Bamgbose“We warn that this Abba Kyari’s matter is purely a diplomatic matter and not a matter that should be looked upon with the binoculars of Ethnic and religious prisms.\nHURIWA claimed Braimoh had openly sided with Abba Kyari and thereby his presence in any investigation of the same matter will automatically nullify the impartiality and the objectivity of such a probe.\nThe indicted officer Abba Kyari has already denied the allegations, stating that he did not demand any money from Hushpuppi but admitted acting as a go-between the fraudster and a local tailor in which Hushpuppi allegedly made payments to.\nHURIWA, however, commended the IGP, Usman Baba for directing the immediate suspension of Abba Kyari from police duties, saying the decision was the right thing under the circumstances."
  },
  {
    "headline": "Abba Kyari: No difference between Hushpuppi, Buhari, Tinubu – Reno Omokri",
    "summarized_story": "A former aide to ex-President Goodluck Jonathan, Reno Omokri, has claimed that there was no difference between President Muhammadu Buhari; National Leader of the All Progressives Congress, APC, Bola Tinubu and International fraudster, Hushpuppi.\nExplaining further, Reno Omokri alleged that while Hushpuppi defrauded unsuspecting people and used the proceed to bride a deputy commissioner of police, Abba Kyari, the source of the billions of Naira Tinubu spent to enthrone Buhari in 2015 and 2019 is yet unknown.\nThe Inspector-General of Police has ordered the suspension of Abba Kyari to allow a thorough investigation into the matter.\nAnd in a tweet on Sunday, Omokri said, “What is the difference between Abba Kyari and Buhari?\n“Where did Bola Tinubu get the money he used to instal Buhari?"
  },
  {
    "headline": "Arrest hoodlums who invaded Amuludun FM – NUJ, MMPN tell Police",
    "summarized_story": "The Nigeria Union of Journalists (NUJ), Oyo State Council and Muslim Media Practitioners of Nigeria (MMPN) have called on security agencies to arrest the hoodlums who invaded Amuludun 99.1 FM radio station in Ibadan.\nNUJ statement was signed by the duo of Comrades Ademola Babalola and Sola Oladapo, Chairman and Secretary respectively.\nDAILY POST recalls that some hoodlums had on Saturday invaded the station located at Moniya area of Ibadan.\nAbout four cars were affected while some property within the radio station were also damaged.\n“Called on the police to ensure that the hoodlums are brought to book stressing that arresting them would send warning signals to other criminal elements."
  },
  {
    "headline": "Rev. Hayab denies free release of students of Bethel Baptist School, Kaduna",
    "summarized_story": "John Joseph Hayab has refuted reports that no ransom was paid for the release of the abducted students of Bethel Baptist High school, Damishi, Kaduna.\nIn a statement he personally issued on Sunday in Kaduna, Hayab said a media platform had claimed to have interviewed an unnamed parent, quoted the parent, alleging that he ( Rev.\nHayab) said no ransom was paid when he was interviewed by Liberty radio, Kaduna.\nHayab emphasized, “My attention has been drawn to a report that said no ransom was paid for the release of the abducted students of Bethel Baptist High School, Damishi, Kaduna.”Rev.\nHe explained that right now, they are even soliciting money because the bandits are asking for more money, saying that there is no truth in that report."
  },
  {
    "headline": "It’s unlikely to see an Igbo President in our lifetime – Okolo-Olisa",
    "summarized_story": "Anthony Okolo Olisa is a legal practitioner and the President of Igbo National Movement (INM).\nSimply put, the Igbo National Movement is a movement created to re-establish our Igbo nation.\nIt is one of our objectives to make this call and to support all Nigerian Indigenous Peoples to join this call.\nADVERTISEMENTIt is unlikely we will see an Igbo President in our lifetime.\nWhen you say, Igbo National Movement where does your Igbo map start and where does it stop?"
  },
  {
    "headline": "El- Zakzaky, Shi’ites and their many battles with authorities",
    "summarized_story": "IBRAHIN Yakub El-Zakzaky is the spiritual leader of the Shi’ite Islamic sect otherwise known as Islamic Movement in Nigeria (IMN).\nEl Zakzaky are allegedly indoctrinated to lose their belief in the establishment so much so that they pledge allegiance to him.\n“I listen to Sheikh el-Zakzaky and he speaks against stealing, corruption, and everything he mentions is found in Nigeria.\nSheikh El-Zakzaky preaches Justice.\nGeneral Ibrahim Babangida also arrested Sheikh Zakzaky in connection with a conflict in Kafanchan."
  },
  {
    "headline": "‘I watched in horror as gunman took my screaming two-year-old away’",
    "summarized_story": "Nothing, perhaps, provoked her agony and helplessness more than the screaming of the kids as the gunmen made away with them.\nHe was shouting at the boy to shut up because he was screaming for me, his mother.\nI couldn’t do anything,” Mrs Hashim told the BBC.\nMrs Hashim describes how they wake up in the middle of the night screaming, terrified they will be taken again.\nMrs Hashim teaches science in a nearby junior school, now closed because of the insecurity caused by criminal gangs."
  },
  {
    "headline": "Resident doctors begin strike tomorrow amidst COVID-19 third wave",
    "summarized_story": "By Moses Emorinken, AbujaDoctors under the aegis of the National Association of Resident Doctors (NARD) have unanimously agreed to embark on an indefinite strike from Monday, August 2, 2021.\nThis is coming at a very critical time when the country is currently experiencing a rise in COVID-19 infections; the signal of a third wave of the pandemicThe association however reached the decision after its National Executive Council (NEC) meeting, which was attended by over 50 of its members across the country.\nThey noted that the government has failed to honour and implement the memorandum of understanding (MoU) it signed with the doctors over 100 days ago.\nIt particularly demanded the immediate withdrawal of the circular removing House Officers from the scheme of service, which was not implemented.\n“The NEC noted the suspension of the total indefinite strike action one hundred and thirteen (113) days ago due to government promises as entailed in the Memorandum of Actions (MOA) signed at the instance of the Minister of Labour, Dr. Chris Ngig"
  },
  {
    "headline": "Abia alleges plot to attack, kidnap monarchs, govt officials, others",
    "summarized_story": "Abia State Government said it had uncovered plots by renegade members of a non state group to attack and kidnap prominent persons in the state including public office holders, traditional rulers, members of the clergy, and hold them as human shield and ransom for negotiations.\nCommissioner for Information, John Okiyi Kalu, who raised the alarm in a statement, yesterday a strongly admonished those behind the dastardly plot to desist from it.\n“We advise such high profile personalities mentioned above to exercise utmost vigilance while going about their normal duties as security agents in the country are on the trail of the arrowheads of the plot with a view to nipping it in the bud and bring those involved to justice.\nGovernment further appeals to all citizens and visitors to keep their focus on maintaining the existing peace in the state and avoid acts that are capable of reversing the gains we have made collectively in securing the State through the understanding and cooperation of all.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Supreme Court ruling: APC snubs Keyamo",
    "summarized_story": "From Adetutu Folasade-Koyi, AbujaIn the aftermath of the Supreme Court ruling on Ondo State governorship case between Rotimi Akeredolu and Eyitayo Jegede, the All Progressives Congress (APC) has shunned the legal advice from Minister of State for Labour and Employment, Festus Keyamo (SAN).\nDismissing the possibility of the Supreme Court judgment concerning Governor Buni’s position having effect on the party, a party chieftain insisted that since the Yobe governor was not earning salary occupying the position of chairmanship of the party, he violated no law.\n“Governor Buni is not violating any law as chairman of the ruling party.\nMember representing North East in the APC Caretaker Committee, Prof. Mamman Tahir, had insisted that the party is on legal high ground with the decision to continue with Buni as party boss.\n“The business of the law is not about speculating what a court will decide in a particular dispute."
  },
  {
    "headline": "Anambra guber: APGA begs Bianca, invokes Ojukwu’s spirit",
    "summarized_story": "Speaking after the about fourhour meeting, Umeh expressed gratitude to Mrs Ojukwu for playing host to the high-powered team, noting that their deliberation was fruitful.\nSo, they would work closely with his wife, Bianca, to achieve success in the party beginning with the November 6 election.\nUmeh, who described Mrs Ojukwu as the missing rib of the party, was elated that she had finally “returned” to the fold.\nIn her remarks, Mrs Ojukwu expressed dismay over how the party had been torn apart with several grievances unattended to.\nMoving forward, Mrs Ojukwu said that she would join hands with the other leaders to advance the fortunes of the party, while efforts were being made to pacify other aggrieved APGA chieftains."
  },
  {
    "headline": "Seven people killed, many injured, 200 houses burnt in fresh Plateau attack",
    "summarized_story": "From Gyang Bere, JosSeven persons were reportedly killed and over 200 houses were burnt when armed bandits suspected to be Fulani herdsmen attacked Jebu Miango community in Bassa Local Government Area of Plateau State in the early hours of Sunday.\nIt was gathered that the deadly operation which lasted for about 4 hours into the early hours of Sunday left several people badly injured, including women and children.\nA lawmaker representing Rukuba/Irigwe Constituency in the Plateau State House of Assembly, Hon Musa Agah Avia, confirmed the incident and blamed security for lack of quick intervention.\nFor now, three corpses have been recovered and well over 200 houses burnt.\nA community leader who gave his name as Joshua Lawrence said seven corpses have been recovered and nine persons hospitalised."
  },
  {
    "headline": "Alleged corruption: EFCC arrests Saraki, ex-Senate president",
    "summarized_story": "Saraki served as President of the Senate between 2015 and 2019.\nDuring his reign as Senate President, he had a running battle with President Muhammadu Buhari.\nIn 2015, Saraki was tried by the Code of Conduct Tribunal, over alleged under-declaration of assets when he held sway as governor of Kwara State.\nMedia aide to Saraki, Yusuph Olaniyonu, did not respond to calls made to his active mobile line when contacted.\nBut sources at the anti-graft agency said that Saraki was being grilled over alleged theft and other sundry allegations leveled against him by the EFCC."
  },
  {
    "headline": "FBI Indictment: DCP Kyari Suspended",
    "summarized_story": "By Kingsley NwezehThe Police Service Commission (PSC) has suspended Deputy Commissioner of Police and Head, Intelligence Response Team (IRT), Abba Kyari.\nA statement issued by the police service commission Sunday afternoon, said the suspension took effect from July 31, 2021.\nThe PSC statement read:”The Police Service Commission has suspended Abba Kyari, a Deputy Commissioner of Police and Head, Intelligence Response Team (IRT) of the Nigeria Police Force from the exercise of the Powers and functions of his office.\nThe statement said “the Commission has also directed the Inspector General of Police to furnish it with information on further development on the matter for necessary further action.\n“The Commission’s decision which was conveyed in a letter with reference, PSC/POL/D/153/vol/V/138 to the Inspector General of Police today, Sunday, August 1st, 2021, was signed by Hon."
  },
  {
    "headline": "IG Recommends Kyari’s Suspension over FBI Indictment",
    "summarized_story": "A United States Court had recently ordered the arrest of DCP Kyari.\nThe suspension is without prejudice to the constitutional presumption of innocence in favour of the officer”, it said.\nThe statement titled “FBI Indictment: IGP Recommends Suspension of DCP Abba Kyari”, reads:“The Inspector-General of Police, IGP Usman Alkali Baba, psc (+), NPM, fdc has recommended the immediate suspension of DCP Abba Kyari, the Head of the Police Intelligence Response Team (IRT), from the Service of the Nigeria Police Force, pending the outcome of an ongoing internal investigations touching on him.\n“The IGP further noted that the suspension is also expected to create an enabling environment for the NPF Special Investigation Panel to carry out its investigations into the weighty allegations against DCP Abba Kyari without interference.\nThe suspension is without prejudice to the constitutional presumption of innocence in favour of the officer."
  },
  {
    "headline": "Protests Hit APC Congresses in Kwara, Lagos, Imo, Osun, A’Ibom, Delta, Others",
    "summarized_story": "Some of the affected states include: Kwara, Ekiti, Kano, Lagos, Imo, Oyo, Osun, Akwa Ibom, Rivers, Delta, and Enugu.\nOne person was killed in Ado Ekiti, the Ekiti State capital, during the ward congress held across the 177 wards in the state.\nHowever, despite the protests, the APC last night hailed the conduct of the congresses across the states, saying that its National caretaker chairman and Yobe State Governor, Mr. Mai Mala Buni, was not distracted.\nThe protesters demanded the cancellation of the ward congress, alleging that Akpanudoedehe “fraudulently manipulated the lists to include only his loyalists as candidates for the congresses”.\nThe Enugu APC ward congress was also characterised by the allegation of missing result sheets across the 260 wards in the state."
  },
  {
    "headline": "MTN Records N790.3bn Revenue in Q1 2021",
    "summarized_story": "The company’s Earnings Before Interest, Tax, Depreciation, and Amortisation (EBITDA), grew by 27.6 per cent to reach N417.2 billion.\n“Voice revenue grew by 13.1 per cent, benefitting from an 11.8 per cent increase in traffic and our customer value management (CVM) initiatives.\n“Data revenue continued the positive momentum from H2 2020, rising by 48.3 per cent,” he explained.\nAccording to him, Fintech revenue rose by 48.2 per cent driven by increased adoption of Xtratime and the core fintech services.\nThis puts MTN Nigeria on the highest possible GCR scale for short-term and long-term ratings, providing a solid platform for growth.”According to him, 2021 would mark the 20th anniversary of MTN’s presence in Nigeria."
  },
  {
    "headline": "Resident Doctors to Resume Nationwide Indefinite Strike Tomorrow",
    "summarized_story": "*Consultants give 21-day ultimatumOnyebuchi Ezigbo in Abuja and Seriki Adinoyi in JosNigeria’s health sector is about to face another round of crisis as the resident doctors have resolved to commence a nationwide indefinite industrial action tomorrow (Monday).\nThe resident doctors, under the auspices of the National Association of Resident Doctors (NARD), said they would embark on the strike due to the failure by the federal and state governments to attend to the issues affecting the welfare of its members.\nThey also noted the alleged non-payment of COVID-19 inducement allowance to some of its members in federal and state tertiary institutions.\nConsultants Give FG 21-day UltimatumMeanwhile, MDCAN has given 21-day ultimatum to the federal government and NSIWC to halt persistent cut in wages of members or face total and indefinite nationwide strike action.\n“All clinical lecturers in the remaining universities should be placed on CONMESS Scale for the purpose of their remuneration in the university."
  },
  {
    "headline": "BREAKING: Nigeria’s ‘Super Cop’, Abba Kyari Finally Suspended Over FBI Fraud Allegations",
    "summarized_story": "The Police Service Commission has suspended the embattled Deputy Commissioner of Police and Head of the Intelligence Response Team (IRT) of the Nigeria Police Force, Abba Kyari.\nThis was disclosed in a statement issued by the spokesperson for the commission, Ikechukwu Ani.\n“The Commission has also directed the Inspector General of Police to furnish it with information on further development on the matter for necessary further action.\nThe Inspector-General of Police, IGP, Usman Alkali Baba, had recommended the immediate suspension of Kyari, the Head of the Police Intelligence Response Team (IRT), from the service of the Nigeria Police Force, pending investigation into fraud allegations against him.\nThe suspension is without prejudice to the constitutional presumption of innocence in favour of the officer."
  },
  {
    "headline": "BREAKING: Nigeria’s ‘Super Cop’, Abba Kyari Finally Suspended Over FBI Fraud Allegations",
    "summarized_story": "The Police Service Commission has suspended the embattled Deputy Commissioner of Police and Head of the Intelligence Response Team (IRT) of the Nigeria Police Force, Abba Kyari.\nThis was disclosed in a statement issued by the spokesperson for the commission, Ikechukwu Ani.\n“The Commission has also directed the Inspector General of Police to furnish it with information on further development on the matter for necessary further action.\nThe Inspector-General of Police, IGP, Usman Alkali Baba, had recommended the immediate suspension of Kyari, the Head of the Police Intelligence Response Team (IRT), from the service of the Nigeria Police Force, pending investigation into fraud allegations against him.\nThe suspension is without prejudice to the constitutional presumption of innocence in favour of the officer."
  },
  {
    "headline": "BREAKING: Nigeria’s ‘Super Cop’, Abba Kyari Finally Suspended Over FBI Fraud Allegations",
    "summarized_story": "The Police Service Commission has suspended the embattled Deputy Commissioner of Police and Head of the Intelligence Response Team (IRT) of the Nigeria Police Force, Abba Kyari.\nThis was disclosed in a statement issued by the spokesperson for the commission, Ikechukwu Ani.\n“The Commission has also directed the Inspector General of Police to furnish it with information on further development on the matter for necessary further action.\nThe Inspector-General of Police, IGP, Usman Alkali Baba, had recommended the immediate suspension of Kyari, the Head of the Police Intelligence Response Team (IRT), from the service of the Nigeria Police Force, pending investigation into fraud allegations against him.\nThe suspension is without prejudice to the constitutional presumption of innocence in favour of the officer."
  },
  {
    "headline": "BREAKING: Nigeria's Police IG Recommends Suspension Of Embattled 'Super Cop', Abba Kyari As Panel Begins Probe",
    "summarized_story": "The Inspector-General of Police, IGP, Usman Alkali Baba, has recommended the immediate suspension of DCP Abba Kyari, the Head of the Police Intelligence Response Team (IRT), from the service of the Nigeria Police Force, pending fraud allegations against him.\nDCP Abba KyariThis was disclosed in a statement on Sunday with Ref No.\nUS court documents outlined a dispute among members of the Hushpuppi conspiracy, which allegedly prompted him to arrange to have an individual identified as ‘co-conspirator’ Kelly Chibuzor Vincent, jailed in Nigeria by DCP Kyari.\nThe suspension is without prejudice to the constitutional presumption of innocence in favour of the officer.\nThe SIP, inter alia, is to undertake a detailed review of all the allegations against DCP Abba Kyari by the US Government as contained in relevant documents that have been availed the NPF by the Federal Bureau of Investigation (FBI)."
  },
  {
    "headline": "BREAKING: Nigeria's Police IG Recommends Suspension Of Embattled 'Super Cop', Abba Kyari As Panel Begins Probe",
    "summarized_story": "The Inspector-General of Police, IGP, Usman Alkali Baba, has recommended the immediate suspension of DCP Abba Kyari, the Head of the Police Intelligence Response Team (IRT), from the service of the Nigeria Police Force, pending fraud allegations against him.\nDCP Abba KyariThis was disclosed in a statement on Sunday with Ref No.\nUS court documents outlined a dispute among members of the Hushpuppi conspiracy, which allegedly prompted him to arrange to have an individual identified as ‘co-conspirator’ Kelly Chibuzor Vincent, jailed in Nigeria by DCP Kyari.\nThe suspension is without prejudice to the constitutional presumption of innocence in favour of the officer.\nThe SIP, inter alia, is to undertake a detailed review of all the allegations against DCP Abba Kyari by the US Government as contained in relevant documents that have been availed the NPF by the Federal Bureau of Investigation (FBI)."
  },
  {
    "headline": "'Seven killed', houses razed as gunmen attack Plateau communities",
    "summarized_story": "Gunmen have reportedly killed seven persons and razed over 250 houses in some communities in Miango chiefdom of Bassa LGA of Plateau state.\nAdvertisementThis was disclosed on Sunday by the Iregwe development association (IDA) in Jos, the Plateau capital.\nMalison said the incident occurred on Saturday night, adding that the injured persons are currently receiving treatment at an undisclosed hospital.\n“Seven people were killed, while several others were injured and are receiving treatment at an undisclosed hospital.\nUbah Ogaba, Plateau police spokesman, who confirmed the incident, said the command has deployed its personnel to the area to restore peace."
  },
  {
    "headline": "'Seven killed', houses razed as gunmen attack Plateau communities",
    "summarized_story": "Gunmen have reportedly killed seven persons and razed over 250 houses in some communities in Miango chiefdom of Bassa LGA of Plateau state.\nAdvertisementThis was disclosed on Sunday by the Iregwe development association (IDA) in Jos, the Plateau capital.\nMalison said the incident occurred on Saturday night, adding that the injured persons are currently receiving treatment at an undisclosed hospital.\n“Seven people were killed, while several others were injured and are receiving treatment at an undisclosed hospital.\nUbah Ogaba, Plateau police spokesman, who confirmed the incident, said the command has deployed its personnel to the area to restore peace."
  },
  {
    "headline": "'It's war against Ndigbo' -- VON DG asks IPOB to reconsider lockdown order on south-east",
    "summarized_story": "Osita Okechukwu, director-general of Voice of Nigeria (VON), has asked the proscribed Indigenous People of Biafra (IPOB) to reconsider their decision to lock down the south-east zone.\nEmma Powerful, IPOB publicity secretary, had said the lockdown, tagged ‘ghost Monday’, will also affect schools and marketplaces.\n“Let me for the umpteenth time appeal to my brothers in IPOB to sheath their sword, for to lockdown the South-East is simply waging atrocious war against Ndigbo,” the statement reads.\n“Accordingly, it will be very big error for IPOB to lockdown the South-East and think they are tough, strategic and will achieve any meaningful result, capital NO.\n“Hence, IPOB should be aware that to lock down South-East is nothing but to punish Ndigbo; to degrade against Ndigbo, South-East economy, to starve Ndigbo and akin to the obnoxious civil war doctrine of hunger as the best weapon,” he said."
  },
  {
    "headline": "'It's war against Ndigbo' -- VON DG asks IPOB to reconsider lockdown order on south-east",
    "summarized_story": "Osita Okechukwu, director-general of Voice of Nigeria (VON), has asked the proscribed Indigenous People of Biafra (IPOB) to reconsider their decision to lock down the south-east zone.\nEmma Powerful, IPOB publicity secretary, had said the lockdown, tagged ‘ghost Monday’, will also affect schools and marketplaces.\n“Let me for the umpteenth time appeal to my brothers in IPOB to sheath their sword, for to lockdown the South-East is simply waging atrocious war against Ndigbo,” the statement reads.\n“Accordingly, it will be very big error for IPOB to lockdown the South-East and think they are tough, strategic and will achieve any meaningful result, capital NO.\n“Hence, IPOB should be aware that to lock down South-East is nothing but to punish Ndigbo; to degrade against Ndigbo, South-East economy, to starve Ndigbo and akin to the obnoxious civil war doctrine of hunger as the best weapon,” he said."
  },
  {
    "headline": "EXTRA: 'Everything is not about money' -- FG cautions youths seeking employment abroad",
    "summarized_story": "The federal government has cautioned youths seeking employment opportunities abroad to be careful, so as not to end up as victims of trafficking.\nIdu-Lah, who advised youths to seek opportunities within the country, said there are different empowerment programmes of the federal government that can enable youths to be productive.\nAdvertisement“I think we should discourage the youths from going out.\n“These agencies can support youths to learn something and be productive, rather than looking at running out.\n“Both ways, we are trying to help the economy and we are also trying to save lives that are going to be lost."
  },
  {
    "headline": "The dawn of Ghana’s tech ecosystem: Here’s what you should know",
    "summarized_story": "Here’s what you should know about Ghana’s tech ecosystem, beyond cliches.\n“We are seeing more Ghanaian tech talents being headhunted by global companies.\n“When Impact Hub Accra started, we were pretty much the only Hub in town,” Kelechi Ofoegbu, COO Impact Hub Accra, said.\nA number of established Ghanaian tech companies like Hubtel, Farmerline, Sayetech, Green Afro-Palms began in Kumasi.\nJorge Appiah, who is also the CEO of SolarTaxi, believes the Ghanaian tech ecosystem is in its early days."
  },
  {
    "headline": "Here’s why Nigeria’s central bank is banning forex sales to money changers",
    "summarized_story": "Nigeria’s Central Bank (CBN) has stopped the sale of foreign exchange (FX) to Bureau De Change (BDC) operators in the country.\nHowever, Emefiele said the MPC noted that the money changers had become wholesale dealers and illegally traded FX to the tune of millions of dollars per transaction.\nThe apex bank also accused BDC operators of speculative, rent-seeking behaviour and involvement in money laundering activities.\nSome have praised the CBN for ending the “mindless sales” of foreign currency to BDC operators and an end to the reign of traders.\nHowever, there are concerns that thousands of Nigerians working at the 3,000+ BDC operators in the country will be thrown into the already large unemployment pool as a result of the ban."
  },
  {
    "headline": "Ato Bentsi-Enchill is helping African startups raise capital and protecting them from difficult investors",
    "summarized_story": "To understand how Ato Bentsi-Enchill started investing in startups, let’s rewind to 2014.\nBut while in the US, I had attended many Africa-focused business conferences at business schools at Harvard, MIT, Wharton, Stanford and NYU.\nOnce I can understand your business model, I can raise money for you or invest.\nFor example with InstantRad, outside of helping them engage investors, I do a lot of business development work for them.\nI also help companies build a path to exit; It’s something a lot of people don’t understand."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Joining the rank of one of the most valuable startups on the continent, South Africa-based fintech startup, Yoco, has..."
  },
  {
    "headline": "Airtel Africa receives $200 million to invest in network and sales infrastructure",
    "summarized_story": "It had also gotten a $100m investment from Mastercard in Airtel Mobile Commerce BV (AMC BV) in April.\nAirtel Africa says that QIA will hold a minority stake in the company while it retains the majority.\nComparing revenue from Q1 2020 with Q1 2021, Airtel saw a significant increase in revenue at $1.03b, dwarfing Q1 2020’s revenue of $899m by 21.7%.\nIts mobile money customer base went from 18.3 million in Q1 2020 to 21.7 million in Q1 2021, an 18.5% increase.\nHe also believes that the Sovereign Wealth Fund’s investment in Airtel Africa will contribute to sub-Saharan Africa’s financial inclusion."
  },
  {
    "headline": "Who puts out your IT fires when you’ve deleted an entire file from the company’s servers?",
    "summarized_story": "Share this article:Recently, the job of a system administrator — sometimes called a sysadmin or system admin — had begun to fascinate me.\nMy first experience with system administrators was with the technical support staff in the ICTU/CRPU unit of the University of Benin.\nAdvertisementWho are System Administrators?\nSystem Administrators troubleshoot all day, every day.\nHowever, according to Olusegun Balogun, an IT Support Specialist, you don’t necessarily have to have those degrees to become a system administrator."
  },
  {
    "headline": "How LoftyInc Capital invests, Dyslexia and assistive technology, Google’s app update",
    "summarized_story": "How LoftyInc Capital Management invests in Capital investsLoftyInc Capital Management Management Partners.\nThey are all LoftyInc Capital Management (LCM) portfolio companies, one of the oldest venture capital firms in Nigeria.\nThis is an excellent time to revisit it: The unique case of Africans with learning disabilities and assistive technology.\nGoogle has announced a new policy update on the Android Play Store to support user control, privacy, and security, beginning September 1, 2021.\nGoogle claims that with its User Data Policy update, it will be illegal to link persistent device identifiers to personal and sensitive user data or resettable device identifiers unless for pre-approved use cases."
  },
  {
    "headline": "Trapped firms in Onne-Eleme cry out in face of stalemate",
    "summarized_story": "Over 300 companies trapped in the shutdown of the Eleme-Onne section of the East-West Road area near Port Harcourt, Rivers State, have cried out over bleak weeks ahead.\nThe stalemate has caused panic within the companies as the youth began making arrangements for church service at the venue on Sunday.\n“You have large scale corporations such as two fertilizer manufacturing companies who serve the entire country,” he said.\nThe source said: “This is an economic road that delivers traffic to Ogoni of Rivers State, to Akwa Ibom, and to the Cross River States.\n“It is also the road that links the nation to the construction site of the N120billion Bodo-Bonny Road across the sea."
  },
  {
    "headline": "The Week Ahead",
    "summarized_story": "The Naira closed the week at $/N411.44 at the I&E FX window, at the NAFEX (spot market) it closed at $/N411.19.\nMore of the same is expected in the week ahead as the Naira is anticipated to continue to hover around N406/$1-N412/$1 threshold in the NAFEX window.\nTreasury bills marketThe treasury bills market was largely bullish for most of the trading session last week, as we saw some buying in the week.\nNGX IND, NGX-30, NGX Consumer Goods, and NGX Banking closed the week with -1.32%, -0.60%, +0.06%, and -0.95% respectively.\nMarket breadth for the week closed positive with 37 gainers led by OANDO and BOCGAS as against 35 losers led by LINKASSURE and REGALINSIn the coming week, we expect the possibility of bargain hunting as investors look to take advantage of the result season."
  },
  {
    "headline": "Insecurity: Arrival of Super Tucano in Nigeria raises hope of terrorists’ defeat",
    "summarized_story": "With the arrival, a few days ago, of six Super Tucano jet fighters, Nigeria is set to put to rout the assorted terrorist groups in the country, but experts say Nigeria needs the political will and attitudinal change in order to win the low-grade war.\nRead Also: Security: Six A-29 Super Tucano aircraft leave US for NigeriaIt is celebrating the acquisition of six Super Tucano jets, which arrived Nigeria penultimate Thursday, and some people are commending the government, expressing the optimism that with the military jets, the days of Boko Haram, bandits and kidnappers are numbered.\nWhich African country will want Nigerian soldiers now, when it is obvious that they cannot fight their own battle?\nApart from the Tucano fighter jets, Nigeria is also said to be expecting other fighter jets from Pakistan.\nThe security challenged has over the last five years worsened with the bloody campaign of various categories of terrorists across Nigeria, mainly, the northern part of the country."
  },
  {
    "headline": "Edo govt praises Olympics-100m finalist, Enoch Adegoke – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has praised the outstanding performance of Olympics 100m athlete, Enoch Adegoke, who took part in the final 100m track event in the 2020 Tokyo Olympic games.\nEdo State Deputy Governor, Rt.\nHe said despite the outcome of the race in the final, the Edo State Government will give Adegoke a red-carpet reception when he returns to the country as he is a worthy ambassador of Edo State.\nShaibu said, “Edo people are very proud of the performance of Enoch Adegoke.\nWe are proud of Enoch Adegoke who made us proud in Tokyo following his outstanding performance in the race until the muscle pull stole the show from him in the final of the 100m mens final,” he added."
  },
  {
    "headline": "Obaseki harps on collaboration with Judiciary, NAPTIP to secure conviction of traffickers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the state government is collaborating with the judiciary and the National Agency for the Prohibition of Trafficking in Persons (NAPTIP), to ensure conviction of traffickers.\nAccording to him, convicting the perpetrators and liquidating their assets will serve as a deterrent to others who are still scouting for vulnerable Nigerians to traffic.\nNot because the prosecutors are not doing their utmost best, but because of the very nature of our legal system.\n“We are working very hard with the High Courts and NAPTIP to ensure that we get convictions.\nObaseki added: “We will work with the judiciary to try and reduce the long adjournments and also the way they treat evidence from victims."
  },
  {
    "headline": "Edo Chief of Staff, Iyoha tasks AAU alumni on Edo’s devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Chief of Staff to Edo State Governor, Osaigbovo Iyoha, has enjoined the alumni of Ambrose Ali University (AAU) and other stakeholders to contribute to the development of the state.\nIyoha noted: “AAU has produced great personalities in government.\nEarlier, the Chairman of AAU Alumni Association, Benin Branch, Hon.\nOgbejiele Fidelix, congratulated Iyoha on his well-deserved appointment as Chief of Staff.\n“Your choice as Chief of Staff is an eloquent testimony of your contribution to the service of humanity."
  },
  {
    "headline": "Edo community applauds revocation of C-of-O of 18-hectare land purportedly belonging to Ize-Iyamu – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The indigenes of Amagba Community in Oredo Local Government Area (LGA) of Edo State have commended the revocation of the title to a land measuring 18 hectares in their community purportedly belonging to Osagie Ize-Iyamu by the state governor, Mr. Godwin Obaseki.\nIn a statement signed by the Odionwere of Amagba, Hon.\nJoseph Iduoriyekemwen J.P., Elder Victor Aigbe, Elder O. Igbinidu, Monday Iduoriyekemwen and Elder John Eware, the community said the land was dubiously taken from the community some time ago by Ize-Iyamu.\n“The people of Amagba also acknowledge the numerous developmental projects embarked upon by the Governor in our community, including the over 15km Ugbor-Amagba Road, which has since been completed, as well as several other adjoining roads that have been constructed.\nWe, once more, reaffirm our unflinching support for the Governor for his interest in the development of Amagba Community and appeal that these efforts be sustained.”..."
  },
  {
    "headline": "In FUOYE, students toil for toilets on campus",
    "summarized_story": "But the thought of which toilet to use made her break out into a cold sweat: there was no toilet available for students.\nI was so disturbed.”The nearest toilets to Ms Adeniyi are the ones in the Faculty of Arts.\nSince 2011 when it was established, FUOYE has not provided toilet facilities for students across its faculties.\n“So, the toilets are now like storerooms where drums are kept and students mostly use the nearby bushes,” he said.\nWhen contacted, the Deputy Dean of Faculty of Arts, Harry Olufunwa, maintained that toilets had been assigned to students and lecturers in the faculty."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "WFP partners corporate bodies to provide N120m funding to Nigerian agribusiness start-ups",
    "summarized_story": "By OBINNA EZUGWUThe World Food Programme (WFP), the food-assistance branch of United Nations committed to ending hunger, achieving food security and improving nutrition globally by 2030, has partnered corporate organisations in Nigeria to provide N120 million funding to six agribusiness start-ups, as part of its push to tackle food insecurity in the country.\nThe initiative is a programme of the Zero Hunger Roundtable, a public-private initiative created by the WFP with a view to bringing together key actors who can develop collective pathways to achieve zero hunger in Nigeria.\nAs part of the initiative, the Zero Hunger Sprint was launched to foster innovative approaches to end hunger, to be championed by Nigerian start-ups which would be funded by participating corporate bodies, including TGI Group, Heineken / Nigerian Breweries PLC, Promasidor, Tolaram Group, and Guinness Nigeria Plc.\nAlso speaking, Paul Howe, WFP country director in Nigeria, noted that the WFP as an organisation focused on achieving zero hunger, is relatively new to Nigeria bu has since realised that enormity or the challenge of hunger in the country.\nHe emphasized that if Nigeria were to successfully achieve zero hunger by 2030, it needed to have a network that is unique to it and committed to achieving the goal."
  },
  {
    "headline": "Ekeigwe Harps on Importance of Self-Control in Organizations",
    "summarized_story": "Ace Nigerian accountant, Christian Ekeigwe, has harped on the need for accountants to exercise sufficient self-control as they play their gatekeeping roles in society.\nHe said that after four decades of training and working in the accounting profession, he has come to the conclusion that self-control, the “skill that matters most,” is the blindside of accounting.\nDwelling on the importance of self-control, Ekeigwe pointed out that empires, companies and individuals have collapsed as a result of poor self-control, noting that in all philosophies, religions and civilizations, self-control has been shown to be a critical success factor.\n“One can conclude that the majesty and affordances of accounting could not be sustained without self-control as a deliberate competence”, he added.\nIn particular, job profiles that are associated with oversight of high-value assets or sensitive resources should require high self-control reliability index.”Ekeigwe maintained that “self-control is the most important emerging competence for the accounting profession."
  },
  {
    "headline": "Police IG recommends Abba Kyari for suspension over Hushpuppi multimillion-dollar fraud",
    "summarized_story": "The IGP further noted that the suspension is also expected to create an enabling environment for the NPF Special Investigation Panel to carry out its investigations into the weighty allegations against DCP Abba Kyari without interference.\nThe suspension is without prejudice to the constitutional presumption of innocence in favour of the officer.\nThe Special Investigation Panel (SIP), comprising four (4) Senior Police Officers, is headed by DIG Joseph Egbunike, the Deputy Inspector General of Police in-charge of the Force Criminal Investigations Department (FCID).\nThe SIP, inter alia, is to undertake a detailed review of all the allegations against DCP Abba Kyari by the US Government as contained in relevant documents that have been availed the NPF by the Federal Bureau of Investigation (FBI).\nThe SIP is also to obtain detailed representation of DCP Abba Kyari to all the allegations levelled against him, conduct further investigations as it deems fit, and submit recommendations to guide further actions by the Force Leadership on the matter."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "21,000 Persons Mentally Unstable In Benue – Official",
    "summarized_story": "No fewer than 21,000 persons are suffering from mental health disorder (MH) in 23 local government areas of Benue State and currently placed on treatment.\nThe commissioner for health and human services, Dr Joseph Ngbea, who disclosed this to LEADERSHIP attributed the increased cases of mental health disorder in the state to invasion of Benue communities by gunmen and armed herdsmen.\nHe said the constant attack and displacement of farmers from their ancestral homes has left thousands of them in psychological trauma.\n“There is also an efficient Drug Revolving Fund (DRF) in all the health facilities providing MH services and for now Benue State is the only state reporting the services on District Health Information System (DHIS) a national platform on which Nigeria’s data pool is collected,” he said.\nWhile commending the Benue State government for the feat achieved so far in mental health disorder, through the sustained approval and release of budget, he said this has helped the Ministry of Health and Human Services to scale up its activities on mental health."
  },
  {
    "headline": "21,000 Persons Mentally Unstable In Benue – Official",
    "summarized_story": "No fewer than 21,000 persons are suffering from mental health disorder (MH) in 23 local government areas of Benue State and currently placed on treatment.\nThe commissioner for health and human services, Dr Joseph Ngbea, who disclosed this to LEADERSHIP attributed the increased cases of mental health disorder in the state to invasion of Benue communities by gunmen and armed herdsmen.\nHe said the constant attack and displacement of farmers from their ancestral homes has left thousands of them in psychological trauma.\n“There is also an efficient Drug Revolving Fund (DRF) in all the health facilities providing MH services and for now Benue State is the only state reporting the services on District Health Information System (DHIS) a national platform on which Nigeria’s data pool is collected,” he said.\nWhile commending the Benue State government for the feat achieved so far in mental health disorder, through the sustained approval and release of budget, he said this has helped the Ministry of Health and Human Services to scale up its activities on mental health."
  },
  {
    "headline": "Zenith Bank Seeks Increased Impact Investment For Africa",
    "summarized_story": "The group managing director/chief executive of Zenith Bank, Mr. Ebenezer Onyeagwu, has called for increased impact investing in Africa for the continent to attain its full potential.\nDelivering the keynote address with the theme “Leveraging Impact Investment Opportunities for Growth in Africa”, Onyeagwu described impact investing as an investment that yields optimal returns for investors, value for all stakeholders and guarantees continued sustenance and existence of humanity.\nHe made a case for increased impact investment in Africa, noting that investment opportunities on the continent cut across agriculture, healthcare, housing, infrastructure, electricity, and the creative sectors.\nOnyeagwu also noted that as a socially responsible organisation, Zenith Bank continues to promote impact investment in Africa.\nHe also said that the bank leverages its in-depth knowledge of the African market to guide investors and hedge their exposures."
  },
  {
    "headline": "Zenith Bank Seeks Increased Impact Investment For Africa",
    "summarized_story": "The group managing director/chief executive of Zenith Bank, Mr. Ebenezer Onyeagwu, has called for increased impact investing in Africa for the continent to attain its full potential.\nDelivering the keynote address with the theme “Leveraging Impact Investment Opportunities for Growth in Africa”, Onyeagwu described impact investing as an investment that yields optimal returns for investors, value for all stakeholders and guarantees continued sustenance and existence of humanity.\nHe made a case for increased impact investment in Africa, noting that investment opportunities on the continent cut across agriculture, healthcare, housing, infrastructure, electricity, and the creative sectors.\nOnyeagwu also noted that as a socially responsible organisation, Zenith Bank continues to promote impact investment in Africa.\nHe also said that the bank leverages its in-depth knowledge of the African market to guide investors and hedge their exposures."
  },
  {
    "headline": "Nigeria Ready To Work With Global Partners On Health Challenges – Onuwu",
    "summarized_story": "Nigeria’s Ambassador to the European Union (EU), Amb.\nObinna Onowu, has presented His Letters of Credence to Ms Ursula von der Leyen, President of the European Commission on July 29, 2021 in Brussels, Belgium.\nThis is contained in a statement by the counsellor, Embassy of Nigeria in Brussels, Mrs Olamide Adediran.\nDuring their discussions, Ambassdor Onowu underscored Nigeria’s readiness to work with global partners to find lasting solutions to health challenges facing the country.\nADVERTISEMENTThe meeting further discussed the need for collaboration to address security challenges, improve trade and supply of COVID-19 vaccines to Nigeria."
  },
  {
    "headline": "VON DG to IPOB: Stop threat of lockdown in South East Zone",
    "summarized_story": "The Director General of the Voice of Nigeria (VON), Mr Osita Okechukwu, has counselled the outlawed Indigenous People of Biafra (IPOB) against threatening a lockdown in the South-East Zone every Monday.\nOkechukwu, however, urged the South East Zone to consider the immense infrastructural development being undertaken by the Muhammadu Buhari administration in the zone.\n“Let me for the umpteenth time appeal to my brothers in IPOB to sheath their sword, for to lockdown the South-East is simply waging atrocious war against Ndigbo.\n“Accordingly, it will be very big error for IPOB to lockdown the South-East and think they are tough, strategic and will achieve any meaningful result, capital NO.\n“IPOB should not cut off Ndigbo’s nose to spite Buhari’s face, for Buhari is compensating with infrastructure."
  },
  {
    "headline": "VON DG to IPOB: Stop threat of lockdown in South East Zone",
    "summarized_story": "The Director General of the Voice of Nigeria (VON), Mr Osita Okechukwu, has counselled the outlawed Indigenous People of Biafra (IPOB) against threatening a lockdown in the South-East Zone every Monday.\nOkechukwu, however, urged the South East Zone to consider the immense infrastructural development being undertaken by the Muhammadu Buhari administration in the zone.\n“Let me for the umpteenth time appeal to my brothers in IPOB to sheath their sword, for to lockdown the South-East is simply waging atrocious war against Ndigbo.\n“Accordingly, it will be very big error for IPOB to lockdown the South-East and think they are tough, strategic and will achieve any meaningful result, capital NO.\n“IPOB should not cut off Ndigbo’s nose to spite Buhari’s face, for Buhari is compensating with infrastructure."
  },
  {
    "headline": "Again, gunmen strangle motorcyclist to death in Delta",
    "summarized_story": "Again, gunmen strangle motorcyclist to death in DeltaAgain, gunmen strangle motorcyclist to death in DeltaSuspected gunmen at the weekend strangled to death a motorcyclist, Edoja Ediri.×His motorcycle was also taken away after he was murdered.\nEdiri, who was in his 30s, was strangled to death at Oviri-Ogor community, Ughelli North local government area of Delta State.\nIt was learnt the body and helmet of the deceased, who was said to have hailed from Igbuku-Orogun, were found in an uncompleted building in the area with hands and legs tied.\nA source, who pleaded anonymity, said the incident created panic in Oviri-Ogor community.\nNationShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Again, gunmen strangle motorcyclist to death in Delta",
    "summarized_story": "Again, gunmen strangle motorcyclist to death in DeltaAgain, gunmen strangle motorcyclist to death in DeltaSuspected gunmen at the weekend strangled to death a motorcyclist, Edoja Ediri.×His motorcycle was also taken away after he was murdered.\nEdiri, who was in his 30s, was strangled to death at Oviri-Ogor community, Ughelli North local government area of Delta State.\nIt was learnt the body and helmet of the deceased, who was said to have hailed from Igbuku-Orogun, were found in an uncompleted building in the area with hands and legs tied.\nA source, who pleaded anonymity, said the incident created panic in Oviri-Ogor community.\nNationShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Terrorists kill 15 soldiers in ambush",
    "summarized_story": "Fifteen soldiers were killed as a result of an ambush in southwestern Niger on Saturday, the country’s defence ministry said.\n“We regret that unfortunately 15 soldiers were killed, seven were wounded and six are missing,” it said.\nLike its neighbours Mali and Burkina Faso, Niger is a regular target for militant groups linked to al Qaeda and Islamic State.\nThe Jihadist threat has grown stronger despite the deployment of thousands of regional, Western and U.N. troops across West Africa’s Sahel region.\nSuspected Islamic State fighters killed at least 100 civilians on Jan. 2 in raids on two villages in western Tillabery region ."
  },
  {
    "headline": "Akwa United win Nigeria’s professional league, victory parade today",
    "summarized_story": "Akwa United Football Club of Uyo on Sunday comfortably won the 2020/2021 Nigeria Professional Football League (NPFL), with a victory parade slated for Uyo today.\nAlthough they still have a match in hand, Akwa United have now moved to 71 points to take an unassailable lead in the competition.\nAlimi Adebayo’s own goal in the second minute of first half added time, and Mfon Udoh’s 62nd minute goals added to their goals’ haul.\nAkwa United 37 +30 712.\nKwara United 36 +15 597."
  },
  {
    "headline": "Falana breaks silence on fresh charge against El-Zakzaky, wife",
    "summarized_story": "By Kazeem UgbodagaHuman rights activist, Femi Falana on Sunday said the fresh charge of terrorism filed by the Kaduna State Government against leader of the Islamic Movement in Nigeria (IMN), Ibrahim El-Zakzaky and his wife Zeenat constitutes worst violation of judicial process.\nThe Kaduna State High Court had last week dismissed the 8-count charge of conspiracy and abetment of culpable homicide level against the duo by the Kaduna State Government.\n“In other words, the new charge was maliciously filed when the Kaduna State Government anticipated that the ruling fixed for July 28 in respect our no case submission would succeed,” he said.\n“No doubt, the new charge constitutes the worst abuse of the process of the Federal High Court.\nOnce the case charge is served on the defence we shall not hesitate to file the necessary application for the immediate termination of the prosecutorial charade."
  },
  {
    "headline": "After Banning Twitter, Buhari Emerges Special Ambassador For Indian App Koo",
    "summarized_story": "President Muhammadu Buhari appears to have been appointed as a special ambassador to Indian social media site Koo, with the app promising to give “exclusive updates from him only on Koo App!”In June, the app Koo, which is comparable to Twitter, was released in Nigeria.\nPresident Muhammadu Buhari threatened to punish regional secessionists in the country’s South-East area in a tweet that was removed by Twitter two days later.\nAs official federal government social media outlets stopped tweeting and shifted to Koo, Koo’s popularity skyrocketed.\nAccording to the federal government, all social media platforms functioning in Nigeria must now be registered as a corporate entity in the country.\nWhat say?”Within days after the Twitter suspension, Koo was accessible in the Apple and Google app stores, and employment openings for local language speakers were advertised on LinkedIn."
  },
  {
    "headline": "FBI Submits Evidence Against Abba Kyari To Nigerian Police",
    "summarized_story": "NEWS DIRECT has learned that the Federal Bureau of Investigation (FBI) has presented evidence against DCP Abba Kyari to the Nigerian police force.\nThe NPF admitted receiving documents from the FBI detailing Kyari’s offenses in a statement signed by force PRO Frank Mba on Monday.\nThe records would aid a special panel set up by IGP Usman Alkali to fully examine Kyari, according to the statement.\n“The IGP further noted that the suspension is also expected to create an enabling environment for the NPF Special Investigation Panel to carry out its investigations into the weighty allegations against DCP Abba Kyari without interference.\n”“The suspension is without prejudice to the constitutional presumption of innocence in favour of the officer.”“The Special Investigation Panel (SIP), comprising four (4) Senior Police Officers, is headed by DIG Joseph Egbunike, the Deputy Inspector General of Police in-charge of the Force Criminal Investigations Department (FCID).”“The SIP, inter alia, is to undertake a detailed review of all the allegations against DCP Abba Kyari by the US Government as contained in relevant documents that have been availed the NPF by the Federal Bureau of Investigation (FBI).”“The SIP is also to obtain detailed representation of DCP Abba Kyari to all the allegations levelled against him, conduct further investigations as it deems fit, and submit recommendations to guide further actions by the Force Leadership on the matter,” the statement read."
  },
  {
    "headline": "Two Abducted Kebbi College Students Rescued",
    "summarized_story": "Two abducted students from the Federal Government College in Birnin Yauri, Kebbi State, have been rescued by the Zamfara police command.\nThe state Commissioner of Police, Mr Hussaini Rabi’u, announced this at a press conference in Gusau on Sunday.\n“The girl who hailed from Wushishi LGA of Niger and a 17 year-old-boy, Faruk Buhari, from Wara in Ngaski LGA in Kebbi state were rescued from a nearby bush in Babbar Doka village of Dansadau emirate.\n“Our investigation revealed that the rescued victims were among the abducted students of the FGC Birnin Yauri, Kebbi state,” he said.\n“They will be handed over to the Kebbi state government through the police command.”"
  },
  {
    "headline": "Hushpuppi Fraud: Aisha Reacts To Abba Kyari’s Suspension",
    "summarized_story": "Aisha Yesufu, a popular activist, has praised the suspension of DCP Abba Kyari, one of Nigeria’s most decorated police officers.\nYesufu described the news as “Fantastic News” in a statement posted on Twitter on Sunday.\nThe Inspector-General of Police, Usman Alkali, had suspended Kyari on Sunday morning because of his ties to disgraced fraudster Ramon Olorunwa Abass a.k.a Hushpuppi.\nKyari will appear before a Special Investigation panel convened by the IGP to investigate Kyari’s indictment by the FBI.\nDIG Joseph Egbunike will serve as the panel’s chairman."
  },
  {
    "headline": "Breaking: Akwa United quench MFM fire, emerge Champions of 2020/21 NPFL season",
    "summarized_story": "After over two decades, and with a match to go in the current league campaign, Akwa United are the champions of 2020/2021 Nigeria Professional Football League (NPFL) season.\nThe Uyo-based side were confirmed the League overall winners Sunday evening after they beat visiting Mountain of Fire Ministry (MFM) FC 5-2 in one of matchday 37 games.\nDetails loading…"
  },
  {
    "headline": "Breaking – Hushpuppi: Police slam suspension on DCP Abba Kyari",
    "summarized_story": "Hours after the Inspector General of Police, Usman Ahmed Baba, recommended his suspension, the PSC, in charge of the promotion and discipline of senior police officers in Nigeria, approved his removal from office pending the outcome of the entire saga.\n“Abba Kyari’s suspension took effect from Saturday, July 31st 2021 and would subsist pending the outcome of the investigation in respect of his indictment by the Federal Bureau of Investigation of the United States .\n“The Commission has also directed the Inspector General of Police to furnish it with information on further development on the matter for necessary further action.\nThe Commission’s decision which was conveyed in a letter with reference, PSC/POL/D/153/vol/V/138 to the Inspector General of Police today, Sunday, August 1st, 2021, was signed by Hon.\nJustice Clara Bata Ogunbiyi, a retired Justice of the Supreme Court and Honourable Commissioner 1 in the Commission for the Commission’s Chairman, Alhaji Musiliu Smith, a retired Inspector General of Police who is currently on leave.”"
  },
  {
    "headline": "Breaking: Fresh medal hopes rises for Team Nigeria as Enoch Adegoke, Tobi Amusan reach 2020 Olympics 100m final",
    "summarized_story": "Nigerians are now very much hopeful that Team Nigeria will finally win medals at the ongoing 2020 Olympic Games after three Nigerians – Enoch Adegoke, Ese Brume and Tobi Amusan qualified for the final.\nTeam Nigeria began on a wrong foot with different set backs but the coast is now clearer with current feat by the Nigerians.\nAdegoke is first Nigeria to reach 100 m final at the Olympics in 25 years while Amusan won her race and qualified for the final of the 110m hurdles event with a time of 12.61s at the ongoing Tokyo 2020 Olympics.\nBrume leaped to a joyous moment after nicking 6.75 long stretch in the long jump on Sunday morning."
  },
  {
    "headline": "FG Vs MNK: The FG’s Futile Propaganda/Media Trial and Recommendations of A Peace and Conflict Theorist -NigPilot",
    "summarized_story": "Nevertheless, the International responses and/or consequences of this latest blunder by the Buhari Government will surely be a Case Study for Researchers and Students of International Relations and International Law.\nJust as the Decisions of both Local and International Courts that will be involved, would have serious Implications on International Law Jurisprudence.\nThe Undeniable fact is that the Existential Battle before the Land and People of Eastern Nigeria is not about Mazi Nnamdi Kanu or his ways and manners.\nBut, you never know, as his life and mission on Earth, even as it concerns Eastern Nigeria/Biafra is in the hands of the Almighty God and must conform to the Dictates of the Almighty God’s Divine Order.\nAnd presently, whether anyone likes his Personality or Not, I wish to emphasize that MNK Represents the FACE of a Courageous Battle for the Total emancipation of Eastern Nigeria/Biafra, by his beleaguered Generation."
  },
  {
    "headline": "NAPTIP rescues over 17,000 victims of human trafficking -NigPilot",
    "summarized_story": "Speaking at the World Day against Human Trafficking, the Director-General, NAPTIP, Senator Basheer Garba Muhammed said the Agency has empowered a good number with no fewer than five victims employed at NAPTIP after seeing them through the university education.\nThe projects included, ” Strengthening Nigeria’s Criminal Justice Response to Trafficking in Persons and Smuggling of Migrants- PROMIS.” This particular project, according to NAPTIP is supported by the Netherlands.\nIt seeks to strengthen national capacities to prevent, investigate and prosecute TIP/ SOM cases in line with international human rights standards.\nThe second project was ” Strengthening Trans-Regional Action and Responses against the Smuggling of Migrants-STARCOM.” It is supported by Canada.\nMuhammed, however, appreciated the Development Partners, UNODC, IOM, and FIIAPP, for their unalloyed support for the age"
  },
  {
    "headline": "Paris Agreement: Nigeria submits 2021 final report to UN -NigPilot",
    "summarized_story": "Nigeria has on Friday, submitted its Nationally Determined Contribution, NDC, the final report of 2021 to the United Nations Framework Convention on Climate Change, UNFCCC.\nThe updated report, which was approved by President Muhammadu Buhari, replaced the interim NDC report that was submitted in May 2021.\nAbubakar said: “This submitted updated NDC communicated that Nigeria has raised its ambition by including emission reduction from the waste sector as a new sector in the NDC.\n“Nigeria’s has increased its conditional contribution from 45% to 47% while retaining the unconditional target of 20%.\n“Hence the updated NDC has an unconditional target of 20% below business as usual by 2030 and 47% conditional contribution on international support.”"
  },
  {
    "headline": "There will be peace in Nigeria after 2020 pilgrimage- Pam -NigPilot",
    "summarized_story": "Executive Secretary, Nigeria Christian Pilgrim Commission, NCPC, Rev Yakubu Pam has expressed optimism that the 2020 Pilgrimage exercise would restore peace in Nigeria.\nThe Prayer Congress was the first to be held in Jordan for the 2020 Pilgrimage exercise.\nIn his welcome address, the Executive Secretary of the Nigeria Christian Pilgrim Commission, Rev Yakubu Pam expressed his profound gratitude to the Jordanian authority.\nPam further commended the Jordanian government for opening their doors to Nigerian Pilgrims at a “perilous time like this”.\nYabo appreciated the dynamic and pragmatic leadership of the NCPC boss for making sure that the Jordan Pilgrimage became a reality."
  },
  {
    "headline": "FBI Indictment: Police Commission Suspends Abba Kyari",
    "summarized_story": "﻿The Police Service Commission has suspended a Deputy Commissioner of Police and Head, Intelligence Response Team of the Nigeria Police Force, Abba Kyari.\nHe also allegedly sent Hushpuppi bank account details into which he (Hushpuppi) could deposit payment for Vincent’s arrest and imprisonment.\nThe dispute allegedly prompted Vincent – one of the members, to contact the victim and inform them of the scam operation.\nAfter this contact, Hushpuppi allegedly arranged to have Vincent jailed in Nigeria by Kyari.\nThe clothes “were brought to our office and he sent somebody to collect them in our office,” Kyari said."
  },
  {
    "headline": "Akwa United Wins 2020/2021 NPFL Title",
    "summarized_story": "Akwa United have been crowned champions of the 2020/2021 Nigeria Professional Football League season after producing a remarkable 5-2 victory over MFM FC in Uyo on matchday 37 in Uyo.\nAkwa United confirmed their intention to win the league after recorded the longest unbeaten run of 18 games.\nThis is the first time the Promise Keepers will be winning the NPFL title since the club was established 25 years again.\nBut it is the second time coach Kennedy Boboye will be winning the trophy, he also led Plateau United to win their first league title in 2017.\nA seven-goal thriller and a maiden league title was quality football experience for spectators at the Godswill Akpabio Stadium who have waiting for this day since 1997."
  },
  {
    "headline": "VIDEO: NDLEA Recovers 35 Wraps Of Cocaine From Lady’s Underwear At Lagos Airport",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency (NDLEA), on Saturday 31st July 2021, recovered 35 wraps of cocaine from the underwear of a lady, Okafor Ebere Edith during the outward clearance of passengers on Air Cotevoire, to Monrovia, Liberia from the Murtala Muhammed International Airport, MMIA, Ikeja, Lagos.\nThe suspect who tucked the pellets of cocaine in her underwear to beat security checks at the Airport was however picked up for search and questioning during which the wraps of the illicit drug were found on her.\nDuring the preliminary interview, she claimed her desire to make money pushed her into drug trafficking.\nChairman/ Chief Executive of the NDLEA, Brig.\nHe charged them and their counterparts in other commands to remain focussed and resolute in pursuit of the goal to rid Nigeria of illicit substances and drug-related criminalities."
  },
  {
    "headline": "Two Abducted Kebbi Students Regain Freedom",
    "summarized_story": "Two out of the abducted students of Federal Government College, Birnin Yauri in Kebbi State have regained their freedom.\nThe students were rescued by the police authorities in a forest of Dansadau District, Maru Local Government Area of Zamfara State.\nSpokesman of the Zamfara State Police Command, SP Mohammed Shehu, confirmed this on Sunday to journalists in Gusau.\nThe rescue effort is coming about six weeks after gunmen suspected to be bandits stormed the school and abducted an unspecified number of students and four teachers.\nREAD ALSO: Gunmen Abduct Students From Federal Government College In KebbiPrior to the Kebbi students’ kidnap, gunmen had whisked away about 200 students of an Islamiyya school in Niger State in May."
  },
  {
    "headline": "FBI’s Indictment Of Abba Kyari, A Dent On Nigeria’s Image – SAN",
    "summarized_story": "﻿A Senior Advocate of Nigeria, Muiz Banire has described the indictment of a Deputy Commissioner for Police, Abba Kyari, in the case of international fraud, as a dent on the image of the country.\nHe also allegedly sent Hushpuppi bank account details into which he (Hushpuppi) could deposit payment for Vincent’s arrest and imprisonment.\nThe dispute allegedly prompted Vincent – one of the members, to contact the victim and inform them of the scam operation.\nAfter this contact, Hushpuppi allegedly arranged to have Vincent jailed in Nigeria by Kyari.\n“Our focus was to save people’s lives that were purported to have been threatened,” Kyari said.”"
  },
  {
    "headline": "UNIPORT’S DVC Andrew Efemini dead before confirmation of appointment",
    "summarized_story": "The newly appointed Deputy Vice-Chancellor (Academics) of the University of Port Harcourt (UNIPORT),Andrew Efemini, has died.\nProfessor Efemini, whose appointment had not been confirmed, died over the weekend at the University of Port Harcourt Teaching Hospital of an unexplained illness (UPTH).\nThe incident was confirmed by a senior university official who spoke on the condition of anonymity.\nEfemini was a professor of Developmental Psychology in the Department of Psychology, Faculty of Humanities, until his death.\nAdvertisementHe was named DVC Academics at the 459th Senate Meeting on July 28th, but died before his new position could be ratified by the institution’s Governing Council."
  },
  {
    "headline": "One dead as hoodlums, vigilante group clash in Shasha, Ibadan",
    "summarized_story": "At least one person was killed in an altercation between hoodlums and members of the Soludero Vigilante group in Shasha area of Ibadan.\nTVC News gathered that, members of the vigilante group apprehended one of the hoodlums who was suspected of being involved in a robbery case.\nThe incident eventually led to the death of one of the hoodlums after a clash ensued between members of both parties.\nA statement by the Public Relations Officer Oyo State Police command, Adewale Osifeso confirmed the death of the victim.\nSeveral items and property were destroyed, he claimed, while the hoodlums were on the premises."
  },
  {
    "headline": "South-West Governors propose supreme courts for geopolitical zones",
    "summarized_story": "Governors from the South-West geopolitical zone have proposed decentralization of the Supreme Court in the National Assembly’s ongoing amendments to the 1999 Constitution.\nNigeria currently has one Supreme Court, which is located in Abuja, the Federal Capital Territory, and hears all cases from the Court of Appeal.\nOn July 6, the South-West Governors’ Forum met behind closed doors with the South-West Caucus at the National Assembly in Abuja and presented the memo.\nAdvertisementThe section presently reads, “Establishment of the Supreme Court of Nigeria: (1) There shall be a Supreme Court of Nigeria.\nThe Supreme Court in the geopolitical zones shall be the final court in all disputes and appeals from the Court of Appeal."
  },
  {
    "headline": "Italian Jacobs Takes Surprising Gold in Olympic 100",
    "summarized_story": "Usain Bolt would not recognize what went down on the Olympic track he used to own.\nThe Italian crossed the line in 9.8 seconds Sunday night, the first medal ever for the country in the 100 meters.\nPietro Mennea won the 200 in 1980 and Livio Berruti won that race at the 1960 Games in Rome.\nThe day’s other gold medal went to Gong Lijao of China, who bested American Raven Saunders of the United States.\nBromell ran his semifinal heat in 9.996 seconds to finish third, and said “I’m not really sure what I could’ve done better, but the race went the way the race went.”"
  },
  {
    "headline": "FBI Indictment: Celebrated Cop Abba Kyari Suspended By Nigeria Police",
    "summarized_story": "Nigeria’s Police Service Commission has suspended Abba Kyari, a Deputy Commissioner of Police and Head, Intelligence Response Team (IRT) of the Nigeria Police Force.\nNigeria’s Inspector-General of Police Usman Alkali Baba had earlier recommended the immediate suspension of Kyari, pending the outcome of an ongoing internal investigations.\nThe IGP further noted that the suspension is also expected to create an enabling environment for the NPF Special Investigation Panel to carry out its investigations into the weighty allegations against DCP Abba Kyari without interference.\nThe SIP, inter alia, is to undertake a detailed review of all the allegations against DCP Abba Kyari by the US Government as contained in relevant documents that have been availed the NPF by the Federal Bureau of Investigation (FBI).\nThe SIP is also to obtain detailed representation of DCP Abba Kyari to all the allegations levelled against him, conduct further investigations as it deems fit, and submit recommendations to guide further actions by the Force Leadership on the matter."
  },
  {
    "headline": "Turkey Declares ‘Disaster Areas’ as Wildfire Death Toll Rises",
    "summarized_story": "Turkish President Recep Tayyip Erdogan has declared parts of southern Turkey ravaged by wildfires as “disaster areas”, with the death toll from the fires rising to six after two forest workers were killed.\nFires across Turkey since Wednesday have burned down forests, encroaching on villages and tourist destinations and forcing people to evacuate.\nErdogan declared the regions affected by the forest fires “disaster areas” in a statement on Twitter.\nTurkey has blamed some previous forest fires on arson or outlawed groups such as the Kurdistan Workers Party (PKK).\nSpeaking from Antalya, Al Jazeera’s Resul Serdar said there are still active forest fires in at least 10 locations in Turkey."
  },
  {
    "headline": "Chinese-Canadian Pop Star Kris Wu Detained on Suspicion of Rape",
    "summarized_story": "Police in Beijing have detained Chinese-Canadian pop star Kris Wu on suspicion of rape.\nThe claim prompted widespread condemnation of Wu on Chinese social media and resulted in several luxury brands dropping deals with him.\nThe teenager publicised her accusations against him on social media last month and later in an interview with the internet portal NetEase.\nSince her accusations, more people have spoken out online, accusing Wu’s staff of predatory behaviour such as inviting them to boozy karaoke parties.\nWu, who grew up between Vancouver and Guangzhou, has denied all allegations of assault and insisted he was innocent in multiple social media statements."
  },
  {
    "headline": "How Nairobi Became a Thriving Arts Hub",
    "summarized_story": "For many years, the cultural spotlight in Africa has seemed to be stubbornly focused on the west or south of the continent rather than East Africa.\nMuch of this cultural verve is centred on Kenya’s capital Nairobi, which has emerged as a creative hub.\nIn the two decades Eltayeb has lived in Nairobi, his artwork has been able to thrive with stunning results.\nBeyond Nairobi, across East Africa, creatives are also shaping a new cultural palette, fusing ancient histories with contemporary realities.\nIn Mogadishu, Italian-b rn Somali architect Omar Degan is re-examining the recent histories of a city ravaged by war."
  }
]