[
  {
    "headline": "Desist from attacking my bishop, Mbaka warns followers",
    "summarized_story": "The Spiritual Director of the Adoration Ministry Enugu Nigeria, Fr Ejike Mbaka, has disassociated himself from the protests in the Adoration Ground on Sunday.\nThe protest was against the ban imposed on Mbaka by the Enugu Diocesan Bishop, Most Rev Callistus Onaga.\nOnaga, in a pastoral injunction, which was read in all Catholic parishes, chaplaincies and religious formations, had imposed a ban on Mbaka ministry.\nThe statement read in part, “My attention has been drawn to activities that took place in the Adoration Ground on Sunday.\n“Adoration Ministry is ever submissive to the mother Church."
  },
  {
    "headline": "Court stops INEC from ending voter registration",
    "summarized_story": "The Federal High Court in Abuja has stopped the Independent National Electoral Commission (INEC) from ending voter registration on 30 June 2022.\nHonourable Justice Mobolaji Olajuwon (Court 10) today granted an order of interim injunction following the hearing of an argument on motion exparte by Socio-Economic Rights and Accountability Project (SERAP).\nThe suit followed the decision by INEC to extend the deadline for the conduct of primaries by political parties by six days, from June 3 to June 9.\nBut the commission failed to also extend the online pre-registration which ended May 30 2022 and the Continuous Voter Registration (CVR) ending 30 June 2022.\nThe extension of voter registration would ensure that Nigerian voters are treated equally and fairly."
  },
  {
    "headline": "Court stops INEC from ending voter registration",
    "summarized_story": "The Federal High Court in Abuja has stopped the Independent National Electoral Commission (INEC) from ending voter registration on 30 June 2022.\nHonourable Justice Mobolaji Olajuwon (Court 10) today granted an order of interim injunction following the hearing of an argument on motion exparte by Socio-Economic Rights and Accountability Project (SERAP).\nThe suit followed the decision by INEC to extend the deadline for the conduct of primaries by political parties by six days, from June 3 to June 9.\nBut the commission failed to also extend the online pre-registration which ended May 30 2022 and the Continuous Voter Registration (CVR) ending 30 June 2022.\nThe extension of voter registration would ensure that Nigerian voters are treated equally and fairly."
  },
  {
    "headline": "Buhari hails Afe Babalola as ABUAD ranked best in Nigeria, 400th globally",
    "summarized_story": "By Johnbosco Agbakwuru, AbujaPresident Muhammadu Buhari has congratulated the Founder and Chancellor of Afe Babalola University, ABUAD, Ado-Ekiti, its management and staff over the varsity’s ranking as the best in Nigeria.\nThe ranking institution, the Times Higher Education World Rankings also ranked ABUAD as the 400th best in the world.\nThe president noted the visionary and scholarly leadership style that had continued to shape the curriculum, operations and results of ABUAD, since it was established 12 years ago.\nBuhari noted with interest the fact that the ranking analysed more than 108 million citations across more than 14.4 million research publications in arriving at ABUAD’s placement.\nPresident Buhari congratulated the chancellor for facilitating resources and for channelling energies and assembling exemplary staff at ABUAD."
  },
  {
    "headline": "Ex-Lagos commissioner, Orekoya celebrates Tinubu victory on return to Lagos",
    "summarized_story": "By Miftaudeen RajiA former commissioner in Lagos State Local Government Service Commission, Abiodun Orekoya has extolled Asiwaju Bola Ahmed Tinubu upon his return to Lagos, 13 days after his victory at the ruling All Progressives Congress, APC.\nHe also commended Tinubu on emergence as the presidential flag bearer of the APC in the 2023 general elections.\nHe said he was overjoyed that Tinubu, who he described as a political enigma, emerged as the presidential candidate of the APC.\nHe described Tinubu’s victory as deserving considering Tinubu’s years of investment in building impeccable leaders, nurturing the party and working for the growth of democracy in Nigeria.\nOrekoya, who noted that the contributions of Tinubu to development of democracy transcended the shores of Nigeria, said Tinubu’s victory has demonstrated that the ruling APC has secured another chance at victory in 2023."
  },
  {
    "headline": "Nigeria set to make gospel music history as 5th Dimension raises 1,000 singers",
    "summarized_story": "The enlistment for the project put together by 5th Dimension Entertainment began with the maiden edition of the Gospel Music Auditions in Lagos weekend.\n“We want to change this narrative by using gospel music as the tool.\nHe said the project is 5th Dimension Entertainment’s way of contributing to making the world saner through gospel music.\nHe said the choice of gospel music was to celebrate God’s goodness, noting that a large percentage of music, including secular ones, has an undertone of glorifying God.\nWe are coming up with stories to promote our culture and this culture has moved and that is the dream we have for Christian gospel music."
  },
  {
    "headline": "Gov El-Rufai under fire over sacking of 2,357 teachers in Kaduna",
    "summarized_story": "The Nasir El-Rufai-led Kaduna State Government has come under scrutiny for sacking 2,357 teachers in the state.\nThe Human Rights Writers Association of Nigeria, HURIWA, carpeted the state government, describing the decision as vindictive, illegal and absolutely wicked.\nThe sacked teachers included the National President of Nigerian Union of Teachers (NUT) Audu Amba, who was dismissed for allegedly refusing to sit for the competency test.\nHURIWA backed Ibrahim Dalhatu, Chairman of the State’s NUT, who earlier described the sacking of teachers as illegal.\nDAILY POST reported earlier that the education board was said to have conducted a competency test for over 30,000 teachers in December, 2021 and afterward, 2,192 were dismissed."
  },
  {
    "headline": "Why South-East insecurity degenerated – Chima Christian",
    "summarized_story": "A public commentator, Chima Christian, has blamed the insecurity in the South-East on the political leadership.\nIn a statement, Christian said the challenge was “both foreseeable and preventable”, but the leadership failed to act timely.\nThe pundit maintained that Abuja-controlled security resources became lethargic and unresponsive to the security demands of the country.\n“While the Southwest responded with Amotekun, as imperfect as it is, Southeast political power players did not show as much commitment and decisiveness.”Separatists, he continued, saw an opportunity to plant themselves as that credible alternative given the reaction of the region’s East political leadership.\nHe added that those pushing anti-establishment rhetoric in the pursuit of their political agenda must take some form of responsibility for what is happening in the South-East."
  },
  {
    "headline": "What I would’ve done at Adoration ground when Fr Mbaka declared me ‘stingy’ – Peter Obi",
    "summarized_story": "Peter Obi, Labour Party presidential candidate has finally reacted to the statement by Spiritual Director of Adoration Ministry Enugu Nigeria, Rev Fr Ejike Mbaka that he is stingy and will never be Nigeria’s President.\nDAILY POST had reported that worshippers on Sunday protested at the Adoration Ministry over sanction on Fr Mbaka by the Catholic authority.\nMbaka was sanctioned and services at the Adoration Ministry were suspended till further notice over his political statement.\nSpeaking in a viral video on Monday, Peter Obi said that Mbaka remains his priest and father in faith and he respects the cleric.\n“For me, Father Mbaka is an ordained priest of God and as a priest, he remains my priest."
  },
  {
    "headline": "2023: Intensify prayers for peaceful conduct of elections – Hadeji Emir tells politicians",
    "summarized_story": "The Emir of Hadejia in Jigawa State, Alh.\nAdamu Abubakar Maje, has asked Nigeriains to intensify prayers for the peaceful conduct of the 2023 general elections.\nThe Emir made the call on Monday when he received the Peoples Democratic Party, PDP, gubernatorial candidate, Mustapha Sule Lamido, in his palace.\nAccording to the Emir, peace is the bedrock of any development of a state and a country.\nHe advised all gubernatorial candidates and their supporters to be fervent in their prayers to God for the peaceful conduct of the polls."
  },
  {
    "headline": "Presidency confirms ex-Head of State, Abdulsalami Abubakar’s illness, gives update",
    "summarized_story": "Garba Shehu, Senior Special Assistant on Media and Publicity to the President Muhammadu Buhari has given an update on the state of health of former military Head of State, General Abdulsalami Abubakar.\nDAILY POST had reported that Abdulsalami was reportedly flown out of Nigeria for medical treatment.\nHe was first flown to a hospital in the United Kingdom (UK).\nWriting on his Twitter page on Monday, Shehu confirmed that Abubakar is out of hospital and there was no cause for alarm.\n“I just ended a visit to His Excellency Abdulsalami Abubakar, former Head of State."
  },
  {
    "headline": "Petrol marketers increase pump price amid scarcity The Nation Newspaper",
    "summarized_story": "Nigerians are now paying more for petrol despite the official price still fixed at N162.50 and N165 per litre.\nIndependent marketers, who started implementing a new price regime of between N170 to N190 at the weekend, insisted yesterday that it would be difficult for them to sell at the official pump price.\nIn Lagos yesterday, many independent stations were shut, the few that were dispensing recorded long queues.\nHe said the government fixed pump price at N165 per litre even when current realities showed that the minimum price should be N180.\nThis is a common situation with Muhammad, who has always been evasive in responding to media inquiries about petrol scarcity."
  },
  {
    "headline": "Abdulsalami stable in UK, says Presidency The Nation Newspaper",
    "summarized_story": "The Presidency yesterday allayed fears on the health of former Head of State Gen. Abdulsalami Abubakar.\nBut the Presidency said the one-time leader was stable and recuperating in a private apartment in the UK after treatment.\nGen. Abdulsalami, 80, was head of state between 1998 and 1999 when he handed over power to President Olusegun Obasanjo.\nRead Also: Abdulsalami Abubakar at 80The tweets: “Alhamdu Lillahi for Allah’s mercy.\nI just ended a visit to His Excellency Abdulsalami Abubakar, former Head of State."
  },
  {
    "headline": "Governor-elect disputes Ekiti vote-buying claim The Nation Newspaper",
    "summarized_story": "Trend worrisome, says UK envoyExcited Buhari receives OyebanjiEkiti State Governor-elect Biodun Oyebanji yesterday disputed the allegation of vote buying during weekend election.\nCandidate of the Social Democratic Party (SDP) Chief Segun Oni alleged vote buying in the election and vowed to challenge the outcome at the tribunal.\nAlso yesterday, the British High Commission described the trend as worrisome and alien to democracy but it hailed Ekiti voters for their peaceful conduct.\nHe said: “I have noticed that over the last maybe four or five general elections in this country, this issue of vote buying has taken a center stage.\n‘Oh no, they are buying votes and all the kind of money they have, we don’t have."
  },
  {
    "headline": "Okowa ticket: Orubebe resigns from PDP The Nation Newspaper",
    "summarized_story": "A former Minister of Niger Delta Affairs, Elder Godsday Orubebe, has resigned from the opposition Peoples Democratic Party (PDP).\nHis resignation is said to be about the choice of Delta State Governor Ifeanyi Okowa as the running mate to the PDP presidential candidate, Alhaji Atiku Abubakar.\nIn a letter, dated June 20, Orubebe, a native of Burutu in Delta State, hinged his resignation on the PDP primaries and the party’s failure to zone the 2023 presidency to the South.\nThis, I have communicated to the Chairman of Burutu Ward 3 in Burutu Local Government Area of Delta State, effective June 20, 2022.\nThe former minister hailed Rivers State Governor Nyesom Wike for his performance during the presidential primaries of the PDP where he came second."
  },
  {
    "headline": "Buhari congratulates Ize-Iyamu at 60 The Nation Newspaper",
    "summarized_story": "President Muhammadu Buhari has congratulated former Secretary to the Edo State Government (SSG) and the governorship candidate of the All Progressives Congress (APC) in the last election, Pastor Osagie Ize-Iyamu, as he celebrates his 60th birthday today.\nA statement yesterday in Abuja by his Senior Special Assistant on Media and Publicity, Mallam Garba Shehu, reads: “President Buhari warmly congratulates former Chief of Staff and Secretary to the Edo State Government, Pastor Osagie Ize-Iyamu, on his 60th birthday, June 21, 2022, rejoicing with the political leader for many achievements, especially in service to his state, nation and humanity.”“The President joins members and leaders of All Progressives Congress (APC) in celebrating the party stalwart, who was a governorship candidate, and showed his credentials of maturity, experience, reliability and wisdom, and attracted many votes.\n“President Buhari notes Pastor Ize-Iyamu’s pedigree as a minister in church, public servant and politician, with vast experience in governance garnered over many years, commending his courage for always accepting the call to serve his people and the nation.\n“As the former Chief of Staff turns 60, the President believes his visionary leadership style, network of friends across the country and insight into governance, particularly in placing people first, will continually be relevant.\n“The President prays for the wellbeing of Pastor Ize-Iyamu and his family.”"
  },
  {
    "headline": "Gunmen bomb Imo market, scores injured, vehicles burnt",
    "summarized_story": "From Stanley Uzoaru, OwerriGunmen enforcing the sit-at-home order of the Indigenous People of Biafra (IPOB) yesterday bombed the popular Izombe market in Oguta Local Government Area of Imo State.\nA witness told Daily Sun that the incident led to a pandemonium as the traders and customers in the market scampered for safety.\nIrked by their defiance, the gunmen set two vehicles ablaze in the market, which caused serious pandemonium before bombing the market.\n“They came and threw a local bomb inside the market and everybody started running for safety; they poured fuel on two vehicles and everywhere went up in flame,” a witness narrated.\nPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "Fuel scarcity gets messier as depot run out of stock",
    "summarized_story": "By Adewale SanyaoluFuel queues on Monday persisted in parts of Lagos State following the decision of some members of the Independent Petroleum Marketers Association of Nigeria (IPMAN) to shutdown their operations.\nMr Akin Akinrinade, Chairman, IPMAN, Lagos Satellite Depot, Ejigbo, who confirmed the development to newsmen in Lagos said they took the decision because they could no longer continue to operate at a loss.\nAccording to him, the current scarcity being witnessed in Lagos is because majority of petrol stations in the state are owned by IPMAN members who are finding it difficult to operate in a hostile environment.\nHe said: “As you can see, the queues are back and this is the second time we are witnessing it this year.\n“However, this one is peculiar in the sense that for a particular reason, IPMAN members decided to shut their stations."
  },
  {
    "headline": "Abia Police parade 2 for murder of woman, selling of her 11-month-old baby – The Sun Nigeria",
    "summarized_story": "From Okey Sampson, UmuahiaAbia State Commissioner of Police, Janet Agbede, yesterday paraded two suspected murderers and child traffickers, arrested over the killing of a woman and the abduction and selling of her 11 months old baby.\nThe suspects identified as Chimaobi Kalu, 25, and David Ogwo Orji, 21, were alleged to have murdered one Chimhurumnaya Udeh, 21.\n“It was discovered that the suspects were motorcyclist operators who hails from Ugwueke in Bende Local Government Area of Abia State.\n“Chimaobi Anyim Kalu resides at No 44 Nwogu street, while David Ogwo Orji lives at Umunkama roundabout all in Ngwa road area of Aba.\nPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "Pension fraud: We’ve blocked all loopholes –Uzodimma’s aide",
    "summarized_story": "From Stanley Uzoaru, OwerriImo State Government said it has restructured the pension board to curb fraudulent activities in the pension system and facilitate prompt payment to retiring civil servants.\nThe commissioner, who described the problem as incredible, said some staff of the board below Grade Level 6 were living above their income level because of padding of figures and impersonation of dead staff.\n“The state is bleeding, they continue to drag down government with all kinds of fraud, some of them in Grade Level 6 are already richer than their permanent secretary, they own many houses and spend government money as if it’s their own.\nPartner with me, let's get you making N500K to N500K a month!\nSkills open the doors to financial opportunities Click here to learn it ."
  },
  {
    "headline": "NECO releases Unity Schools’ exam results",
    "summarized_story": "From Fred Ezeh, AbujaNational Examination Council (NECO) has released the results for the 2022 Common Entrance Examination into Federal Government Colleges (FGCs), also known as Unity Schools.\nNECO Registrar, Ibrahim Wushishi, presented the results to Minister of Education, Adamu Adamu, in Abuja, yesterday.\nHe said 15 candidates across a number of states had the lowest score in the examination.\nIn terms of participation, 96 per cent of candidates (68,633) sat for the examinations out of the 71,738.\nThe state that had registered the highest number of candidates was Lagos with 19,518, out of which 18,787 sat for the examination."
  },
  {
    "headline": "News in Photographs: Ekiti Governor-elect, Oyebanji, Visits Buhari in State House",
    "summarized_story": "Ekiti State Governor-elect, Biodun Abayomi Oyebanji, was received by President Muhammadu Buhari, Monday, at the State House Abuja.\nOyebanji, who was declared winner of the Ekiti Governorship Election held on Saturday, polling 187,057 votes, was accompanied on the visit to the State House by Ekiti State Governor Kayode Fayemi, Jigawa State Governor Mohammed Badaru, APC National Chairman Abdullahi Adamu, Kebbi State Governor Abubakar Atiku Bagudu and Minister of Industry Trade and Investment Niyi Adebayo.\nAlso present at the visit was Chief of Staff to the President, Prof Ibrahim Gambari.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari to Oyebanji: You Must Be Magnanimous in Victory",
    "summarized_story": "Buhari, however, advised Oyebanji to be magnanimous in victory, in a release yesterday by the president’s media adviser, Femi Adesina.\nTinubu: Ekiti Victory Will Motivate APC for More in 2023Presidential candidate of APC, Senator Bola Tinubu, said the party’s victory in the Ekiti State governorship election would spur it on to more victories in the coming elections.\nIn a statement yesterday by his media office, Tinubu congratulated Oyebanji and the party for winning the governorship election.\nHe also commended the APC governors and members of the NWC under Adamu’s leadership for recording their first major electoral victory.\nThis victory is for the people of Ekiti State and all lovers of democracy across the country."
  },
  {
    "headline": "14 Banks Raked in N47trn as Deposits, Disbursed N25trn Loans in 2021",
    "summarized_story": "The banks are Access Bank, Fidelity Bank, FCMB Group, FBN Holdings, GTCO, Union Bank, United Bank for Africa (UBA), Zenith Bank, Ecobank Group, Stanbic IBTC, Sterling Bank, Unity Bank, Wema Bank and Jaiz Bank.\nHowever, the financial results showed that the six largest banks – Access, Zenith, First Bank, GTCO, UBA, Ecobank – with respect to deposits, assets, loans and profitability, maintained their industry dominance.\nSimilarly, in terms of customers’ deposits, Zenith Bank posted N6.472 trillion; Access Bank –N6.955 trillion; FBN Holdings – N5.849 trillion; GTCO – N4.130 trillion; UBA – N6.309 trillion and Ecobank – N8.360 trillion.\nAlso, whereas Access Bank’s total assets in the review period was N11.732 trillion; Ecobank – N11.689 trillion; Zenith Bank – N9.448 trillion; FBN Holdings – N8.932 trillion; UBA – N8.541 trillion and GTCO – N5.436 trillion.\nFintechs have continued to encroach on commercial banks’ businesses, thereby threatening the operations and deposit mobilisation by the banks."
  },
  {
    "headline": "Terrorists Attack Two Churches in Kaduna Community, Kill Three, Abduct 44",
    "summarized_story": "By John Shiklam in KadunaFour people have been killed while 44 others were abducted by terrorists in an attack on two churches in Rubu community, Kajuru Local Government Area of Kaduna state.\nSources said the terrorists attacked worshipers at St. Moses Catholic Church and Maranatha Baptist Church in the community on Sunday during worship service.\nThree people were said to have been killed in the attack on Catholic Church while 30 people were abducted at Maranatha Babtist Church.\nThose who sustained injuries were said to have been taken to the St. Gerald Catholic Hospital, Kaduna, for treatment.\nIn a statement on Sunday, the Commissioner for Internal Security and Home Affairs, Samuel Aruwan, said the bandits attacked three communities, looted shops and carted away some valuables from the villages."
  },
  {
    "headline": "In Landslide Victory, APC Wins Ekiti Governorship Election as Vote-buying Mars Poll",
    "summarized_story": "The governorship election, which was held under a calm and peaceful atmosphere, also recorded a large turnout of voters.\nThe winner of the governorship election, Oyebanji, is a former Secretary to the State Government (SSG), to Governor Kayode Fayemi.\nEFCC Arrests Vote Buyers, Election Calm, PeacefulFollowing the widespread vote-buying, which characterised the governorship election, the operatives of the Economic and Financial Crimes Commission (EFCC) arrested persons suspected to be engaged in vote-buying in the poll.\nSituation Room noted that the election was generally peaceful, with voters civilly conducting themselves in most of the polling units.\nMeanwhile, the Socio-Economic Rights and Accountability Project (SERAP) has asked INEC to prosecute all those involved in vote-buying in the governorship election."
  },
  {
    "headline": "UK Hospital Treats Ex-Head Of State, Abdulsalami Suspected To Have Deteriorating Health Condition",
    "summarized_story": "A former Nigerian Head of State, General Abdulsalami Abubakar (retd.\n), has been discharged from a London hospital after treatment for an unknown ailment.\nSaharaReporters had earlier reported that General Abdulsalami (retd.)\nHe was first flown to Dubai in the United Arab Emirates (UAE) but was thereafter taken to a hospital in the United Kingdom (UK).\nI just ended a visit to His Excellency Abdulsalami Abubakar, former Head of State."
  },
  {
    "headline": "UK Hospital Treats Ex-Head Of State, Abdulsalami Suspected To Have Deteriorating Health Condition",
    "summarized_story": "A former Nigerian Head of State, General Abdulsalami Abubakar (retd.\n), has been discharged from a London hospital after treatment for an unknown ailment.\nSaharaReporters had earlier reported that General Abdulsalami (retd.)\nHe was first flown to Dubai in the United Arab Emirates (UAE) but was thereafter taken to a hospital in the United Kingdom (UK).\nI just ended a visit to His Excellency Abdulsalami Abubakar, former Head of State."
  },
  {
    "headline": "#EkitiDecides: Abiodun Oyebanji Of APC Wins Ekiti Governorship Election",
    "summarized_story": "Abiodun Oyebanji, candidate of the All Progressives Congress, has emerged the winner of the 2022 Ekiti governorship election.\nOyebanji was announced as the winner by Kayode Adebowale, returning officer for the election, after amassing a total of 187,057 votes.\n“Oyebanji, having scored the highest number of votes is hereby declared the winner and returned elected as the governor-elect of Ekiti State,\" the returning officer said.\nSee Also Elections Highest Bidder: How Rampant Vote-buying Marred Ekiti Governorship ElectionThe election also saw widespread of vote-buying especially by the APC.\nSee Also Breaking News LIVE UPDATE: Ekiti State Governorship Election"
  },
  {
    "headline": "#EkitiDecides: Abiodun Oyebanji Of APC Wins Ekiti Governorship Election",
    "summarized_story": "Abiodun Oyebanji, candidate of the All Progressives Congress, has emerged the winner of the 2022 Ekiti governorship election.\nOyebanji was announced as the winner by Kayode Adebowale, returning officer for the election, after amassing a total of 187,057 votes.\n“Oyebanji, having scored the highest number of votes is hereby declared the winner and returned elected as the governor-elect of Ekiti State,\" the returning officer said.\nSee Also Elections Highest Bidder: How Rampant Vote-buying Marred Ekiti Governorship ElectionThe election also saw widespread of vote-buying especially by the APC.\nSee Also Breaking News LIVE UPDATE: Ekiti State Governorship Election"
  },
  {
    "headline": "#RevolutionNow: Nigerians Don’t Deserve Hard Life; We Are Fighting For Our Future – Sowore",
    "summarized_story": "Sowore, who reminded Nigerians that they all had one life to live, noted that the one life did not have to be filled with hardship caused by deceptive leaders.\nYou've got one life to live, it didn't have to be this hard!\nWe've come to you without sugarcoating it, your life could be better.\nAs long as Yoruba people are persecuted, I’m persecuted.\nAs long as Kano people are persecuted, I’m persecuted."
  },
  {
    "headline": "'I'm out of hospital and doing well' -- Abdulsalami thanks Nigerians for concern over health",
    "summarized_story": "Abdulsalami Abubakar, former head of state, says he is recovering well from knee problems which led to his cancelling activities to mark his 80th birthday.\n“I had a swollen knee and was unable to walk for days in the last week of May,” he told TheCable.\n“After initial care by my doctors, they advised that I should seek further expert care abroad.\nAdvertisement“I was on admission for a brief period but I have now been discharged while doctors do a regular follow-up.\n“I appreciate the support, love and care that Nigerians have been showing since the story went on social media."
  },
  {
    "headline": "'I'm out of hospital and doing well' -- Abdulsalami thanks Nigerians for concern over health",
    "summarized_story": "Abdulsalami Abubakar, former head of state, says he is recovering well from knee problems which led to his cancelling activities to mark his 80th birthday.\n“I had a swollen knee and was unable to walk for days in the last week of May,” he told TheCable.\n“After initial care by my doctors, they advised that I should seek further expert care abroad.\nAdvertisement“I was on admission for a brief period but I have now been discharged while doctors do a regular follow-up.\n“I appreciate the support, love and care that Nigerians have been showing since the story went on social media."
  },
  {
    "headline": "We may have 50% invalid registrants for 2023 polls because of court verdict, says INEC",
    "summarized_story": "The Independent National Electoral Commission (INEC) says extending the period for continuous voter registration (CVR) may result in a significant percentage of invalid registrants.\nEarlier on Monday, a federal high court in Abuja granted an order of interim injunction stopping INEC from ending voter registration on June 30.\nThe commission had fixed June 30 as the deadline to suspend the CVR exercise across the country ahead of the 2023 general election.\n“The implication is that we will not be in a position to display the voter register for claims and objections.\nIt is only in the last two weeks that voter registration is about to end that we have this surge."
  },
  {
    "headline": "We may have 50% invalid registrants for 2023 polls because of court verdict, says INEC",
    "summarized_story": "The Independent National Electoral Commission (INEC) says extending the period for continuous voter registration (CVR) may result in a significant percentage of invalid registrants.\nEarlier on Monday, a federal high court in Abuja granted an order of interim injunction stopping INEC from ending voter registration on June 30.\nThe commission had fixed June 30 as the deadline to suspend the CVR exercise across the country ahead of the 2023 general election.\n“The implication is that we will not be in a position to display the voter register for claims and objections.\nIt is only in the last two weeks that voter registration is about to end that we have this surge."
  },
  {
    "headline": "'Placeholder': VP candidate selection followed careful legal advice, says Adamu",
    "summarized_story": "Abdullahi Adamu, national chairman of the All Progressives Congress (APC), says choosing a vice-presidential candidate for the party was done after “careful” legal consultations.\nAdamu spoke on Monday while addressing state house correspondents after accompanying Biodun Oyebanji, governor-elect of Ekiti, on a visit to President Muhammadu Buhari.\nTheCable had reported that Kabiru Faskari, an APC chieftain, had said Kabir Masari was chosen as the running mate to Bola Tinubu, presidential candidate of the party.\nAdvertisementSpeaking on the development, Adamu said such speculations should be dismissed.\nThere’s nothing our presidential candidate has done with regards to returning his forms that is not within the confines of the law of the land,” the APC chairman said."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Afropolitan wants to build a digital nation for Africans",
    "summarized_story": "Afropolitan, a startup that wants to build a digital nation for Africans, has raised pre-seed funding of $2.1 million, according to its co-founder, Eche Emole.\nSrinivasan envisions that this new country, the “network state,” he calls it, will be ”built on the cloud first.\nSrinivasan conceives a network state as a digital nation built without the historical constraints of a physical nation, and that presents citizens with a fresh stab at societal and financial freedom.\nEmole is convinced that Africa has the most need for a digital nation because of the numerous failed states on the continent.\nEmole envisions a digital nation as Facebook—the biggest social media platform in the world with over almost 3 billion users—filled with people with shared values and governed by a single cryptocurrency,Afropolitan’s digital nation will be built in 4 phases."
  },
  {
    "headline": "Abena, a voice assistant, wants to preserve African languages",
    "summarized_story": "But these voice technologies support only Western languages and are unavailable in African languages because of the low-revenue opportunities in African markets.\n“Working on voice tech for African languages has been a completely different ball game.\nHe spent 6 years building Abena AI, and released it in the Google Play Store this April as a Mobobi product.\nAbena AI works with smart lights, smart plugs, and other smart home devices.\n“The feedback from a few people who tried Abena AI out before it was released kept us going."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Abuja court orders INEC not to discontinue ongoing registration",
    "summarized_story": "A Federal High Court sitting in Abuja has stopped the Independent National Electoral Commission (INEC) from ending voter registration on June 30, 2022 as earlier scheduled.\nThis decision is seen as good omen for millions of Nigerians yet to register for the 2023 general elections.\nThe suit followed the decision by INEC to extend the deadline for the conduct of primaries by political parties by 6 days, from June 3 to June 9.\nBut INEC had remained adamant insisting that the deadline would not be changed.\nRead also: INEC’s decision on Akpabio over APC senatorial candidacy is final, says IginiThis made SERAP to drag the electoral umpire to court."
  },
  {
    "headline": "How Nigerian firms can retain tech talents",
    "summarized_story": "In a recent statement, Abubakar Suleiman, the chief executive officer of Sterling Bank referred to the exit of these tech talents as a “great resignation”.\nBusinessDay reached out to experts in the tech ecosystem who outlined various ways businesses in Nigeria can retain talents.\nMuhammad Habib, a software engineer explained that the government have a crucial role to play in keeping tech talents from leaving the country.\n“Unethical behaviour at work has to stop if businesses really want to retain tech talents.\n“Everyone knows very few Nigerian companies can afford to compete with what people are paid on freelancing platforms."
  },
  {
    "headline": "Fuel queues resurface in Lagos as marketers blame NNPC for supply gap",
    "summarized_story": "There seems to be anxiety and confusion in Nigeria’s commercial capital as queues resurfaced in filling stations across the metropolis on Monday morning.\nThe long queues were also noticed along the Lagos-Ibadan expressway, Ikorodu road, and the Lagos Island.\nThe National Operations Controller of the Independent Petroleum Marketers Association of Nigeria (IPMAN), Mike Osatuyi, explained to BusinessDay that the current scarcity was caused by NNPC’s failure to supply petrol.\nLast week, the South-West zone of the Independent Petroleum Marketers Association of Nigeria (IPMAN) threatened to direct its members to increase petrol and diesel pump prices.\nIn February, Nigeria experienced petrol scarcity, lasting for over one month — caused by the recall of off-spec petrol in circulation."
  },
  {
    "headline": "Edo PDP: Obaseki sues for peace, appoints Igbinedion to chair Peace Committee – Nigerian Observer",
    "summarized_story": "The governor disclosed this while meeting with over 135 PDP members drawn from the National Executive Committee, State Executive Committee, and Zonal Committee of the party, at the party Secretariat in Benin City.\nI have consulted and for the time being decided that Chief Lucky Igbinedion, a former Governor of the State to chair the peace committee of the party in the state.\nThe internal wrangling is the only thing that can stop us as it has stopped PDP in Ekiti State.\n“If we sue for peace in the party, we will certainly find one.\nHe called on the party leaders to activate the youths wing to bring youths into the party in preparation for the 2023 general election."
  },
  {
    "headline": "CVR: Ex Edo LG Chairman task stakeholders on mobilization – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbudu – With 10 days to the end of the Continuous Voters Registration (CVR) by the Independent National Electoral Commission (INEC), a former chairman of Orhionmwon local government, Hon.\nOtamere Aigbogun on Sunday called on political stake holders in the area to mobilize those who are yet to register to visit Esigie college and the Primary Health Center (PHC) at Abudu for registration.\nAigbogun who made the call in message made available to The Nigerian OBSERVER stated that the registration will continue at Abudu (Abiokunla Ward 1) on Monday, 20th June, 2022 through Wednesday, 22nd June 2022.\nThe exercise is expected to move to Ogan community in the area on Thursday 23rd June 2022 and Friday 24th June 2022.\nThe online registration is scheduled to end on 30th June year 2022 with the commission undecided on the issue of extension."
  },
  {
    "headline": "Obaseki inspects ongoing revamp of Abudu College of Education, reassures on September resumption date – Nigerian Observer",
    "summarized_story": "Obaseki, who inspected the demonstration school by the Universal Basic Education Commission (UBEC) and the main campus of the college, said his government is committed to human capacity development.\n“The demonstration school would be like a laboratory for training basic teachers because what we are trying to do is to make these facilities in Abudu another education hub.\n“The college will help in training teachers, particularly those to teach basic education.\nYou can see that the same thing is happening in the school of agriculture, as well as the school of nursing.\nFirst, you have to have quality schools, and then quality teachers to now produce the kind of students you need."
  },
  {
    "headline": "FATHERS DAY: Shaibu Harps on Godly Virtues …Serves as Altar Boy – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – As Nigeria joins the rest of the world in celebrating Father Day, Edo State Deputy Governor, Rt.\nHon.Comrade Philip Shaibu,has advocated the need for parents to imbibe and impact the virtues of Godliness andmoral discipline in their homes, by bringing up their children in the way of the Lord.\nAccording to him, “the starting point of building a nation is by building our homes”,while calling on Fathers to amplify issues that will unite the nation.\n“A Father or Leader should not say or do in secret, what he cannot own up to in public, because nothing is secret.\nIf we can act as St. Joseph in the Bible, then the issues of insecurity will be history in Nigeria”, he stated."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "You must marry us, 150 Anambra widows beg Reps candidate",
    "summarized_story": "A mild drama occured in Woliwo, Onitsha South Local Government Area of Anambra Onitsha State on Sunday when over 150 widows begged a House of Representatives candidate, Edward Ibuzo, to marry them.\nThey widows made the plea when the candidate, who is currently a member of the state House of Assembly, representing the Onitsha North II, came for Thanksgiving at the Saint Jude Catholic Church, Woliwo, Onitsha.\nIbuzo said he came to thank God for being an unopposed Reps candidate under the platform of All Progressives Grand Alliance (APGA).\nWe need protection and care and he has been doing it before now, so he should marry us.\n“I believe that if elected I will achieve more than what I have achieved in the State House of Assembly."
  },
  {
    "headline": "Osun 2022: Ensure you collect your PVCs, Oyetola charges state residents",
    "summarized_story": "By Sunday Oguntuyi, OsogboMr. Gboyega Oyetola, Osun State governor, has charged residents of the state to ensure that they collect their permanent voter cards (PVCs) as, as according to him, it is very important.\nOyetola made the appeal while speaking during his tour of Ifelodun and Boripe local government areas of the state.\nThe governor told the residents that their PVCs remained their only power to vote in the July 16 governorship election.\nSpeaking at the venues of the campaign, Governor Oyetola also urged members of the party to begin door-to-door campaigns and mobilise the electorate to vote massively for APC.\nOdusola said Oyetola has done tremendously well area of human and Infrastructural development, urging the people of the state to ensure the good work didn’t stop by massively voting for APC."
  },
  {
    "headline": "Father Mbaka remains my priest and father in faith, says Peter Obi",
    "summarized_story": "Former Anambra State governor and presidential candidate of the Labour Party (LP), Peter Obi, has said that the Spiritual Director of Adoration Ministry, Enugu, Father Ejike Mbaka, remains his priest and father in faith.\nObi said this during an interview on the Voice of the People 90.3 FM monitored in Lagos.\nMbaka had said that the former Anambra State governor cannot win next year’s general election because he is “stingy”.\nHowever, speaking during the radio interview, Obi said, “For me, Father Mbaka is an ordained priest of God and as a priest, he remains my priest.\n“Whatever he says, I will take it because he’s my father in faith."
  },
  {
    "headline": "Forex Scarcity: Nigeria withholding $450m belonging to foreign airlines",
    "summarized_story": "The amount represents the total amount of foreign airline revenues that cannot be repatriated by the airlines.\nOther African countries, Algeria, Ethiopia, and Zimbabwe also account for a combined $271 million also owed to foreign airlines.\nAccording to IATA, Nigeria restricted the funds to allow for foreign currency to be used for imports of essential goods and services as well as for investors looking to repatriate dividends.\nHe also expressed fears that the situation could “damage” Nigeria’s aviation sector down the road as airlines seek options to protect their revenues.\n“The International Air Transport Association’s Vice President for Africa and the Middle East, Kamal Al Awadhi, described talks with Nigerian officials to release the funds as a “hectic ride."
  },
  {
    "headline": "Popular singer, Portable, in hot water for beating up man who tried wooing his wife",
    "summarized_story": "The Ogun State Police Command has ordered popular hip-hop musician, Habeeb Okikiola, popularly known as Portable, to report himself at the nearest police station.\nThis was in connection to a video clip circulating on social media, where he allegedly organised some youths to beat up a young man.\nThe Zazu crooner was seen in the video asking some youths to beat up a man he accused of messaging his wife.\n“The incident was said to have taken place somewhere within Ogun State about two days ago.\n“In view of this, the Command is using this medium to advise Okikiola Habeeb a.k.a Portable to report himself at the nearest police station in Ogun State, failure of which his arrest will be ordered."
  },
  {
    "headline": "Group Accuses NDDC Interim Boss Of Working Against Board Inauguration",
    "summarized_story": "The Niger Delta United Congress (NDUC) has alleged that the sole administrator of the interventionist agency, Effiong Akwa, is working against the Niger Deltans’ legitimate demand for the inauguration of a substantive board for NDDC, in accordance with the law setting up the Commission.\nPeople should reduce the agitation on board and work with the current management of the NDDC”.\nAt that occasion, President Buhari said that ‘‘Based on the mismanagement that had previously bedeviled the NDDC, a forensic audit was set up and the result is expected by the end of July, 2021.\nThe ongoing contraption of administering the Commission by a Sole Administrator is a violation of the NDDC Act.\nWhat the NDDC Act provides is that the Board and Management (Managing Director and two Executive Directors) of the NDDC at any point in time should follow the provisions of the law which states that the Board and management is to be appointed by the President, subject to confirmation by the Senate."
  },
  {
    "headline": "Group Accuses NDDC Interim Boss Of Working Against Board Inauguration",
    "summarized_story": "The Niger Delta United Congress (NDUC) has alleged that the sole administrator of the interventionist agency, Effiong Akwa, is working against the Niger Deltans’ legitimate demand for the inauguration of a substantive board for NDDC, in accordance with the law setting up the Commission.\nPeople should reduce the agitation on board and work with the current management of the NDDC”.\nAt that occasion, President Buhari said that ‘‘Based on the mismanagement that had previously bedeviled the NDDC, a forensic audit was set up and the result is expected by the end of July, 2021.\nThe ongoing contraption of administering the Commission by a Sole Administrator is a violation of the NDDC Act.\nWhat the NDDC Act provides is that the Board and Management (Managing Director and two Executive Directors) of the NDDC at any point in time should follow the provisions of the law which states that the Board and management is to be appointed by the President, subject to confirmation by the Senate."
  },
  {
    "headline": "Jungle Justice: FCT Police Meet Okada Riders In Abuja",
    "summarized_story": "Worried by the rising cases of jungle justice and the menace caused by commercial motorcyclists, populary known as Okada Riders, the Nigeria Police Force (NPF) has met with the leadership of the riders’ associations with a view at addressing the issues.\nThe deputy FCT Police PRO, ASP Oduniyi Omotayo, said the meeting became necessary following “the recent spate of the outbreak of violence largely traceable to commercial motorcyclists popularly known as okada riders, which has become a menace occasionally playing out as self-help in obtaining justice known as jungle justice, vandalization of government and private properties, and sundry antisocial behaviours demanding an immediate redress.”The meeting, which was held at the FCT Police Command headquarters in Abuja, had about 150 leaders of the various unions of okada riders in attendance.\nADVERTISEMENTHe warned sternly that forthwith, sanctions according to the letters of the law will be meted on erring parties.\nDuring the meeting, few of the chairmen in attendance while speaking on behalf of others, appreciated the Commissioner of Police and promised to play by laid down rules henceforth.\nThe Commissioner of Police also reassured the people of the FCT of the command’s unflinching commitment to riding the FCT of criminal elements and bringing crime and criminality to the barest minimum."
  },
  {
    "headline": "Jungle Justice: FCT Police Meet Okada Riders In Abuja",
    "summarized_story": "Worried by the rising cases of jungle justice and the menace caused by commercial motorcyclists, populary known as Okada Riders, the Nigeria Police Force (NPF) has met with the leadership of the riders’ associations with a view at addressing the issues.\nThe deputy FCT Police PRO, ASP Oduniyi Omotayo, said the meeting became necessary following “the recent spate of the outbreak of violence largely traceable to commercial motorcyclists popularly known as okada riders, which has become a menace occasionally playing out as self-help in obtaining justice known as jungle justice, vandalization of government and private properties, and sundry antisocial behaviours demanding an immediate redress.”The meeting, which was held at the FCT Police Command headquarters in Abuja, had about 150 leaders of the various unions of okada riders in attendance.\nADVERTISEMENTHe warned sternly that forthwith, sanctions according to the letters of the law will be meted on erring parties.\nDuring the meeting, few of the chairmen in attendance while speaking on behalf of others, appreciated the Commissioner of Police and promised to play by laid down rules henceforth.\nThe Commissioner of Police also reassured the people of the FCT of the command’s unflinching commitment to riding the FCT of criminal elements and bringing crime and criminality to the barest minimum."
  },
  {
    "headline": "2023 Polls: Court Stops INEC From Ending Voter Registration",
    "summarized_story": "Justice Mobolaji Olajuwon of a Federal High Court in Abuja, has ordered the Independent National Electoral Commission (INEC) not to end the ongoing voter registration on June 30, 2022.\nThe court granted an order of interim injunction following the hearing of a motion exparte by Socio-Economic Rights and Accountability Project (SERAP).\nSERAP and 185 concerned Nigerians had earlier this month filed the lawsuit against INEC, asking the court to “declare unconstitutional, illegal, and incompatible with international standards the failure of the electoral body to extend the deadline for voter registration to allow eligible Nigerians to exercise their rights.”In the suit, SERAP had asked the court for “an order restraining INEC, its agents, privies, assigns, or any other person(s) claiming through it from discontinuing the continuous voters’ registration exercise from the 30th June 2022 or any other date pending the hearing and determination of the motion on notice.”ADVERTISEMENTThe suit is adjourned to June 29, 2022 for the hearing of the Motion on Notice for interlocutory injunction."
  },
  {
    "headline": "Falana issues 7-day deadline to Gbajabiamila for information on EOC Bill",
    "summarized_story": "Human rights activist, Femi Falana has issued seven days ultimatum to the Speaker of the House of Representatives, Femi Gbajabiamila to furnish him with information on the Electoral Offences Commission (EOC) Bill or be prepared for legal battle.\nFalana, in a letter to Gbajabiamila, dated June 17, 2020, said he wrote to the speaker in pursuant to the Freedom of Information Act, 2011.\nHe said the Independent National Electoral Commission (INEC) was empowered to prosecute electoral offenders under section 150 of the repealed Electoral Act 2010 as amended.\nFalana said even though sections 114-121 of the Electoral Act had made adequate provisions for electoral offences, the Independent National Electoral Commission did not have the capacity to arrest, investigate and prosecute electoral offenders.\n“As this request is made pursuant to the Freedom of Information Act, 2011 you are requested to provide the requested information within seven days of the receipt of this letter."
  },
  {
    "headline": "HEFAMAA downgrades Lagos Executive Cardiovascular Centre to hospital",
    "summarized_story": "The Lagos Executive Cardiovascular Centre (LECC) has been downgraded from a Specialist Hospital category to a Hospital category.\nThe Executive Secretary, Health Facilities Monitoring and Accreditation Agency (HEFAMAA), Dr Abiola Idowu disclosed this in Ikeja, Lagos on Monday.\n“Following painstaking considerations of the circumstances leading to the death of the patient, the Agency has decided to downgrade LECC from a Specialist Hospital category to Hospital category for a period of three months at the first instance.\nThis may be extended if necessary,” she stated.\nShe explained that the outcome of the investigation revealed lack of preparedness in receiving the patient despite prior knowledge of referral from another hospital."
  },
  {
    "headline": "JUST-IN: Ex-Head Of State, Abdulsalami, Hospitalised In London, Discharged",
    "summarized_story": "A former Head of State, General Abdulsalami Abubakar, who was hospitalised for an unknown ailment in London, has been discharged from the hospital.\nBut, a media aide to President Muhammadu Buhari, Malam Garba Shehu, made a public disclosure about the health status of the former head of state on Monday evening.\nShehu, who took to his verified Facebook page, said he visited General Abdulsalami in London and that he was not in any serious condition any longer, hence there was no cause for alarm.\nI just ended a visit to His Excellency Abdulsalami Abubakar, former Head of State.\nHe is out of hospital in a London apartment and apparently in no serious condition."
  },
  {
    "headline": "2023: Tinubu Reacts To Atiku Mockery Over Choice Of Running Mate",
    "summarized_story": "The presidential candidate of the All Progressives Congress (APC), Bola Tinubu has reacted to the mockery comment made by the presidential candidate of the People’s Democratic Party (PDP), Atiku Abubakar over the delay of his opponents to produce their running mate within the stipulated time frame given by the Independent National Electoral Commission (INEC).\nAtiku had in a statement issued earlier chide his opposition candidates especially from the APC, NNPP, and the LP over what he described as lack of clarity and inability to make decisions at a critical time to pick their running mates.\nIn developed democratic countries, the process and picking of a running mate by a presidential candidate is a step to understanding the capacity of a candidate and his capability to do the job”.\nReacting swiftly to the development through his spokesman, Tunde Rahman, Tinubu said it is pathetic for the PDP to utter such, adding that the party ought to focus more on resolving its internal crisis.\nSpeaking in an interview with the BBC, Tinubu Spokesperson said, “The PDP should pay attention to resolving their internal crisis, they failed to fulfill all their internal promises.They should stop the propaganda campaign on Muslim-Muslim ticket, amongst others.”"
  },
  {
    "headline": "BREAKING: Speculation of vote-buying by APC, imagination of opposition class – Ekiti Governor-Elect, Oyebanji",
    "summarized_story": "Governor-elect of last Saturday’s Ekiti State governorship election, Biodun Oyebanji, has written off speculations that his party, the All Progressive Congress helped him procure victory through vote-buying.\nOyebanji said neither he nor the ruling APC was involved in the alleged votes buying scam during the polls.\nOyebanji spoke to State House Correspondents on Monday, after the party’s leadership presented him to President Muhammadu Buhari as the winner of the election and governor-elect of the state.\nChairman of the APC, Senator Abdullahi Adamu, led the delegation to the Presidential Villa.\nCorroborating Oyebanji, the National Chairman of the APC, Abdullahi Adamu, said such allegation of vote-buying may be the handwork of the opposition class who are angry for losing out at the poll."
  },
  {
    "headline": "‘No Going Back On Yoruba Nation, We Want Freedom’ — Sunday Igboho Says, Urges Yoruba Monarchs To Support Struggle",
    "summarized_story": "‘No Going Back On Yoruba Nation, We Want Freedom’ — Sunday Igboho Says, Urges Yoruba Monarchs To Support StruggleYoruba Nation agitator, Sunday Adeyemo, popularly known as Sunday Igboho has insisted that despite his travails, he is not backing down from the struggles for the independence of the Yoruba Nation.\nIgboho called on the Olugbon to speak to other Yoruba monarchs to desist from appointing ‘unqualified persons’ to positions of authority, saying the menace of insecurity is affecting every part of the South-West region.\nHe also warned that things might go sour if Yoruba people get angry over the appointment of ‘unqualified persons’.\nHe also debunked reports from some quarters that he is no longer interested in the struggle for the Yoruba Nation.\nI just want to use this opportunity to explain that I wouldn’t want you to toe the path of other monarchs who are appointing unqualified persons into positions of authority."
  },
  {
    "headline": "Breaking: Court issues fresh order on INEC ‘s voter registration deadline",
    "summarized_story": "The Independent National Electoral Commission (INEC) has been ordered by the Federal High Court in Abuja not to stop voter registration on June 30, 2022.\nHonourable Justice Mobolaji Olajuwon granted an order of interim injunction following the hearing of an argument on motion exparte by Socio-Economic Rights and Accountability Project (SERAP).\nSERAP and 185 concerned Nigerians had in early June filed the lawsuit against INEC asking the court to “declare unconstitutional, illegal, and incompatible with international standards the failure of the electoral body to extend the deadline for voter registration to allow eligible Nigerians to exercise their rights.”In the suit, SERAP had asked the court for “an order restraining INEC, its agents, privies, assigns, or any other person(s) claiming through it from discontinuing the continuous voters’ registration exercise from the 30th June 2022 or any other date pending the hearing and determination of the motion on notice.”However, the suit has adjourned to June 29, 2022 for the hearing of the Motion on Notice for interlocutory injunction.\nDetails loading…Share this: TwitterFacebook"
  },
  {
    "headline": "Pictures: Court resumes trial of Osinachi’s ‘killer’ husband",
    "summarized_story": "Peter, the husband of the late gospel singer, Osinachi Nwachukwu, on Monday resumed trial at the Abuja High Court.\nHe is facing 23-count charge of the domestic violence and homicide which he already pleaded not guilty.\nFamily members of Osinachi also were in court for the trial.\nBefore on Monday, the trial judge, Justice N.K Nwosu-Iheme, had fixed 16 and 17 June, 2022 for the accelerated hearing on the charges but he was absent on the fixed dates and the case was adjourned to 20 and 21 of June, 2022.\nShare this: TwitterFacebook"
  },
  {
    "headline": "Buhari, Tinubu on Ekiti governorship election: Oyebanji’s victory ‘ll inspire APC in 2023",
    "summarized_story": "“We thank the people of Ekiti State for recognising our contributions and for rewarding us with this victory”, Bagudu stated.\nThe breakdown of results declared are as follows: Ekiti South-West LG: APC – 9, 679, PDP – 4,474 and SDP – 4,577, Ekti West LG APC -15, 202, PDP – 3,386 and SDP – 3,863, Efon LG APC – 4012, PDP – 6,303 and SDP – 339; IJERO LG APC – 13,754, PDP – 4897 and SDP – 5006, IKERE LG APC – 12,086,PDP – 3,789 and SDP – 1,943; Ilejemeje LG APC – 4,357, PDP – 1,157 and SDP – 2,344.\nIn Irepodun/Ifelodun LG APC – 13,125, PDP – 4,712 and SDP – 5010, Ise/ Orun LG APC – 8,074, PDP – 2,588 and SDP – 5,909, Moba LG APC – 11,609, PDP – 3530 and SDP – 4904.\nOye LG APC – 13396, PDP – 4122 and SDP – 3591, Ado LG APC – 23,831, PDP – 7,575 and SDP – 15,214, Ido/Osi LG APC – 10,321, PDP – 2,871 and SDP – 9,489; , Emure LG APC – 7,728, PDP – 2,610 and SDP – 3,445.\nIkole LG APC-16,417, PDP – 6,266 and SDP – 5,736, Gbonyin LG APC -11,247, PDP–3,947 and SDP – 4,059 while in Ekiti East LG APC –12,099, PDP-5,230and SDP- 4,982."
  },
  {
    "headline": "Minister says Apapa Port rail track will be ready in 2 weeks",
    "summarized_story": "Minister of State for Transportation, Senator Gbemisola Saraki, has assured that the rail track that leads to the Apapa Port Terminals would be completed in two weeks.\nThe Minister made the disclosure during an inspection of the ongoing rail construction at the Apapa port on MondayShe was accompanied by the Apapa Port Manager, Mrs. Funmi Olotu; the Managing Director, Nigerian Railway Corporation, Mr. Fidet Okhiria, and the Project Manager, China Civil Engineering Construction Company.\nShe said the Project Manager, China Civil Engineering Construction Company, Mr. Xia Lijun, had assured her that the laid track would be completed in two weeks.\nSaraki said, “As you can see, the building belonging to the Nigeria Customs Service Scanner Centre needs to be pulled down but there have been issues surrounding it.\n“Before the end of next week, the solution to improve the construction at the Apapa rail track will be provided and the rail will be operational in two weeks”, he added."
  },
  {
    "headline": "ACCI Appoints Former NNPC, DPR Executive, Chairperson Women-in-Business Trade Group",
    "summarized_story": "Abuja Chamber of Commerce and Industry (ACCI) has appointed former Nigerian National Petroleum Corporation (NNPC) and the Department of Petroleum Resources (DPR) Executive, Mrs Chioma Nonyerem Njoku, as the Chairperson of the Women-in-Business Trade Group of the Chamber.\nIn a letter signed by the Director General ACCI, Victoria Akai on Tuesday, the DG stated that the Trade Group is one of the working organs of the Chamber and its roles include promoting activities of Women in Business by providing necessary support, activities and opportunities for members in the Trade Group to succeed in their ventures.\nMrs Njoku, an oil industry expert who would bring to bear over 40 years of experience of working in the oil sector to the Women – in – Business Trade Group, before this appointment has held several positions at the NNPC and DPR, including as Acting Director of Petroleum Resources.\nShe had served as the Senior Special Assistant/Adviser on Petroleum, to the Imo State Governor and as the Secretary of the Bureau of Oil and Gas Matters.\nFurthermore, she attended various Executive Management Courses including the prestigious Harvard Business School program for Leadership and General Management."
  },
  {
    "headline": "NIHOTOUR to unveil mobile training kitchens",
    "summarized_story": "… As key players gear up for 2022 Sustainable Gastronomy Day CelebrationBy Palma IleyeNational Institute for Hospitality and Tourism, NIHOTOUR, has stated that it was set to unveil mobile training kitchens at the 2022 World Sustainable Gastronomy Day Celebration which is expected to attract high level attendance by critical stakeholders of the industry at the event which opens on Saturday, 18th June 2022 at the International Conference Centre, Abuja.\nDisclosing this to newsmen at the headquarters of the Institute in Abuja, Director General and Chief Executive Officer of NIHOTOUR, Nura Sani Kangiwa, said the institute has acquired the mobile kitchens in order to up its skill acquisition and training outreach programs to Nigerian youths in the nooks and crannies of the country.\nKangiwa noted that the Sustainable Gastronomy Day celebration for this year recognizes the practices and principles associated with sustainable food consumption combined with the art of collecting, preparing and consuming the food we eat, stating further that the observances of the day acknowledges the social, cultural and artistic expression related to gastronomy that defines the three dimensions of sustainable development which are; people, planet and profit (benefits).\nHe noted that gastronomy was a cultural expression of nations through their food choices, sources of ingredients and types of cuisines which thrives in culturally rich destinations and Nigeria being one of the most competitive Gastronomy tourist destination in Africa because of its corresponding unique foods culture and enticing cuisines of international repute.\nThe NIHOTUR boss also noted that the occasion will also feature the presentation of a paper to mark the observance Day to be delivered by Olufemi Falebita titled ‘Marketing Nigerian Foods Abroad’The United Nations General Assembly proclaimed World Sustainable Gastronomy Day in December, 2016 and first celebrated it in 2017."
  },
  {
    "headline": "PenCom says only five states, Kaduna, Lagos, Delta 2 others pay pensions",
    "summarized_story": "It has been reported that only five states are paying pensions under the Contributory Pension Scheme as more workers retired by the end of the first quarter of 2022, findings have revealed.\nPenCom listed the states that were funding the accrued rights of the retirees and paying pensions under the CPS to be Lagos, FCT, Osun, Kaduna and Delta.\nData obtained from PenCom on ‘Status of implementation of the CPS by states’ showed that 25 states had enacted laws on the CPS and that out of them, 15 had pension bureaux and boards in line with the CPS.\nThe data revealed that the 25 states are Lagos, FCT, Osun, Kaduna, Delta, Ekiti, Ondo, Edo, Benue, Kebbi, Niger, Rivers, Ogun, Bayelsa, Kogi, Anambra, Abia, Taraba, Imo, Sokoto, Adamawa, Ebonyi, Nasarawa, Enugu and Oyo.\nPenCom data showed that states with other pension schemes were Jigawa, Kano, Gombe and Zanfara."
  },
  {
    "headline": "Adegbite woos investors with huge gold, lead-zinc, iron-ore deposits",
    "summarized_story": "By Palma IleyeIn continued efforts to grow the economy through the mining sector, the Minister of Mines and Steel Development, Arc Olamilekan Adegbite, Thursday, has wooed investors abroad with huge gold, lead-zinc, iron-ore and barite deposits in Nigeria.\n“Target minerals under the first phase include Gold, Lead-Zinc, Iron Ore, and the Battery Minerals, among others.\n“These include Thor Exploration Limited’s Segilola Gold Mine Project, in Osun State, which has an initial production capacity of 80,000 ounces of gold annually, representing the first large-scale Gold Mine in Nigeria.In June last year, we commissioned the Dukia Gold & Precious Metals Refinery, DGPMR, Project.\nIts potential impact on the gold sector is nothing short of revolutionary.\n“From the revenue drive perspective, the Nigerian Mining Sector has demonstrated a marked improvement despite the challenges of the pandemic."
  },
  {
    "headline": "Selling Petrol At N165 Unrealistic, Says IPMAN As Scarcity Hits Lagos",
    "summarized_story": "In an interview with Channels Television, the Lagos Zonal Chairman of IPMAN, Akin Akinrinade, explained the rationale behind the fuel scarcity.\n“Members of Independent Petroleum Marketers Association of Nigeria IPMAN have shut down their stations, not because we are striking; we are not on strike,” he said.\n“Rather, the business environment has been very hostile to us such that we can no longer do business under this condition.\n“You now have to add the cost of transportation which is between N6 to N8, depending on the distance within Lagos,” he explained.\nThere is no station in Lagos that uses less than 50 litres (of diesel) per day."
  },
  {
    "headline": "We Will Give Effect To Court Order On Voter Registration – INEC",
    "summarized_story": "The Independent National Electoral Commission (INEC) says it will give effect to the ruling of the Federal High Court in Abuja on the Continuous Voter Registration (CVR).\nINEC’s National Commissioner and Chairman of Information and Voter Education Committee, Festus Okoye, said this on Monday during an appearance on Channels Television’s Politics Today.\n“The commission is a constitutional body, and we are under a constitutional obligation to give effect to judgements and orders of properly constituted courts of law, and we are going to give effect to the order made by the Federal High Court,” he said.\nREAD ALSO: INEC Loses Bid To Stop Voter Registration On June 30Justice Mobolaji Olajuwon of the Federal High Court in Abuja had stopped INEC from going ahead with its decision to end the CVR exercise on June 30, as scheduled.\nDespite the decision to give effect to the order of the court, Okoye insisted that INEC would convince the court on the adjourned date on why the exercise should be discontinued for now."
  },
  {
    "headline": "We Didn’t Buy Votes, Ekiti People Supported Us To Win Election – Oyebanji",
    "summarized_story": "The governor-elect of Ekiti State, Biodun Oyebanji, has faulted the allegation of vote-buying against the All Progressives Congress (APC) in the just concluded governorship election in the state.\nHe stressed that neither he nor the ruling party was involved in vote-buying as alleged, saying they canvassed for votes from the electorate which led to their victory at the poll.\nApart from Adamu, Oyebanji was also accompanied by Governor Kayode Fayemi of Ekiti State, Governor Atiku Bagudu of Kebbi State, and Governor Abubakar Badaru of Jigawa State.\nThe Independent National Electoral Commission (INEC) had declared Oyebanji, the APC candidate as the winner of the keenly contested election it conducted on Saturday.\nOyebanji polled 187,057 votes – over 100,000 votes more than that of his closest rival, Segun Oni of the Social Democratic Party (SDP), who scored 82,211 votes in the election."
  },
  {
    "headline": "INEC Loses Bid To Stop Voter Registration On June 30",
    "summarized_story": "Justice Mobolaji Olajuwon of the Federal High Court in Abuja on Monday stopped the Independent National Electoral Commission (INEC) from ending the voter registration on 30 June 2022.\nJustice Olajueom granted an order of interim injunction following the hearing of an argument on motion exparte by Socio-Economic Rights and Accountability Project (SERAP).\nThe suit followed the decision by INEC to extend the deadline for the conduct of primaries by political parties by six days, from June 3 to June 9.\nBut the commission failed to also extend the online pre-registration which ended May 30 2022 and the Continuous Voter Registration (CVR) ending 30 June 2022.\nSERAP is asking the court for “a declaration that the failure of INEC to extend the deadline for voter registration is a violation of eligible Nigerians’ rights to participate freely in their own government, equality, and equal protection”."
  },
  {
    "headline": "APC Confident In Its Decision To Name Kabiru Masari As Tinubu’s VP – Adamu",
    "summarized_story": "The National Chairman of the All Progressives Congress (APC), Abdullahi Adamu, said on Monday the ruling party had not flouted any laws in naming Kabiru Masari as running mate to its presidential candidate, Bola Ahmed Tinubu.\nWhile the APC has not officially announced Masari as its vice-presidency candidate, a chieftain of the party, Kabiru Faskari, confirmed the development to Channels Television on Friday.\nMasari is widely believed to be a placeholder to beat INEC’s Friday deadline for the submission of Vice-Presidential candidates.\nThe National Chairman of the All Progressives Congress (APC), Abdullahi Adamu, said on Monday the ruling party had not flouted any laws in naming Kabiru Masari as running mate to its presidential candidate, Bola Ahmed Tinubu.\nThere’s nothing our presidential candidate has done in regards to submitting of forms that is not within the confines of the laws of the land."
  },
  {
    "headline": "'We are looking beyond South Africa at WAFCON' says Oshoala -",
    "summarized_story": "Nigeria striker, Asisat Oshoala said the Super Falcons are looking beyond facing title rivals South Africa at this year’s Women’s Africa Cup of Nations in Morocco.\nThe record nine-time African champions will open their 2022 tournament campaign just as they ended the last edition against 2018 runners-up, the Banyana Banyana.\nBoth teams are in Group C, alongside Botswana, and Burundi.\nThe Super Falcons bowed twice in last three meetings with South African since 2018 but the Barcelona forward believes the Falcons will leave nothing to chance in the quest for another record-extending 10th continental crown."
  },
  {
    "headline": "Ekiti governor-elect, Oyebanji visits Buhari at Presidential villa",
    "summarized_story": "Ekiti state governor-elect, Abiodun Abayomi Oyebanji, on Monday paid a thank you visit to President Muhammadu Buhari following his victory at the poll on Saturday.\nAccompanied by the outgoing governor, Kayode Fayemi and minister of Industry, Adebayo, Mr Oyebanji thanked the president and the party for the support.\nHe promised to consolidate on the successes of the outgoing administration.\nHe was also joined at the villa by the National chairman of the All Progressives Congress, Abdullahi Adamu."
  },
  {
    "headline": "Sani Bello congratulates Ekiti-Governor elect, Biodun Oyebanji",
    "summarized_story": "Governor of Niger State and Chairman of the North Central States Governors Forum (NCSGF),Abubakar Sani Bello, has congratulated Biodun Oyebanji of the All Progressives Congress (APC) on his overwhelming victory in the recently concluded Ekiti State gubernatorial election.\nIn a statement, Governor Sani Bello stated that Oyebanji’s victory is a clear indicator that the APC-led government in Ekiti State and the country at large has executed people-oriented projects.\nThe Governor added that the governor-elect has significant work to do in complimenting the efforts of Governor Kayode Fayemi as governance is a continuous process.\n“Ekiti State has witnessed a significant progress, I am confident that the governor-elect will continue with the good work by the present governor”, he said.\nThe Governor added that the victory of the APC at the Ekiti State gubernatorial poll is a good omen for the ruling party ahead of the 2023 general elections."
  },
  {
    "headline": "Sanwo-Olu, Abiodun congratulate Ekiti Governor-elect, Oyebanji -",
    "summarized_story": "Lagos State Governor, Mr Babajide Sanwo-Olu and his Ogun State counterpart, Dapo Abiodun have congratulated Mr Biodun Oyebanji for emerging victorious in the Saturday’s governorship election in Ekiti State.\nGovernor Sanwo-Olu said the result of the election signified a great day for the people of Ekiti State and a deserving victory for the APC.\n“I congratulate Mr. Biodun Oyebanji for emerging victorious in yesterday’s gubernatorial election where he was duly elected as the next governor of Ekiti State.\n“The APC in Ekiti under the able leadership of Governor Kayode Fayemi has delivered beyond expectations.\nIn the same vein, Ogun state governor, Dapo Abiodun, in a statement by his Chief Press Secretary, Kunle Somorin, on Sunday, lauded the people of Ekiti State for electing to continue to witness good governance in the state courtesy of the ruling party."
  },
  {
    "headline": "VP Candidates: No Place for Placeholder in Our Law – Festus Okoye",
    "summarized_story": "INEC National Electoral Commissioner, Festus Okoye, maintains that the political trend of a ‘stand by’ vice presidential candidate, is not recognized by the commission.\nHe further clarified that all candidates at the point of submission of forms submitted their running mates and not their place holders."
  },
  {
    "headline": "Mayhem At Tinubu’s Homecoming + Mbaka’s Supporters Protest – Trending With Ojy Okpe",
    "summarized_story": "A video showing thousands of supporters welcoming the flag bearer of the All progressives Congress Asiwaju Bola Ahmed Tinubu on Sunday at the Presidential Wing of the Muritala Mohammed International Airport, in Lagos has gone viral.\nThe former governor of Lagos State was returning to his home state for the first time after clinching the APC presidential ticket.\nIn another development,The bus conveying press crew covering the Lagos State Governor’s Office on Sunday was heavily attacked by thugs leaving no fewer than two journalists wounded with others sustaining various scars on their bodies.\nAlso, The New Nigeria Peoples Party, has dismissed reports that their presidential candidate Rabiu Kwankwaso has accepted to be the running mate to Peter Obi, presidential candidate of the Labour Party.\nThen, supporters of the Spiritual Director of the Adoration Ministry in Enugu Statec Rev Father Ejike Mbaka on Sunday, defied in protest, a directive of the Catholic Bishop of Enugu Diocese, Most Rev Callistus Onaga, to stop attending Mass at the Adoration Ministry."
  },
  {
    "headline": "APC’s Strategy For The Ekiti Election Was To Buy Votes – Moses Jolayemi",
    "summarized_story": "Spokesman and Media Committee Chairman, Segun Oni Campaign, says the result of the Ekiti election was riddled with fraudulent activities from the APC with vote-buying taking center stage.\nMr. Jolayemi says the result will be challenged in courts on grounds of vote buying, thuggery, ballot box snatching and intimidation.\nRelatedStories No Content Available"
  },
  {
    "headline": "The Emergence of Ahmed Lawan is Shrounded in Secrecy – Dr Kayode Ajulo",
    "summarized_story": "The ruling All Progressives Congress has asked the Independent National Electoral Commission to adopt Ahmed Lawan as its senatorial candidate for Yobe North in the 2023 election, following his loss of the party’s presidential ticket to Bola Tinubu at the national convention on June 8."
  },
  {
    "headline": "Ukraine Bans Some Russian Books and Music in Latest Step of ‘Derussification’",
    "summarized_story": "Ukraine’s parliament has voted through two laws that will place severe restrictions on Russian books and music as Kyiv seeks to break many remaining cultural ties between the two countries following Moscow’s invasion.\nOne law will forbid the printing of books by Russian citizens, unless they renounce their Russian passport and take Ukrainian citizenship.\nThe ban will only apply to those who held Russian citizenship after the 1991 collapse of Soviet rule.\nIt will also ban the commercial import of books printed in Russia, Belarus and occupied Ukrainian territory, while also requiring special permission for the import of books in Russian from any other country.\nAnother law will prohibit the playing of music by post-1991 Russian citizens on media and on public transport, while also increasing quotas on Ukrainian-language speech and music content in TV and radio broadcasts."
  }
]