[
  {
    "headline": "Nigerians will praise Buhari after his tenure in 2023 -Adesina",
    "summarized_story": "Special Adviser to President Muhammadu Buhari on Media and Publicity, Femi Adesina, has said that the president has recorded achievements that will make Nigerians proud of him after leaving office in 2023.\nAdesina said this in a statement titled ‘The Buhari Administration at 6: Counting the Blessings One by One’, on Friday.\nThe statement outlined the achievements of Buhari’s regime in the last six years.\nIt read, “The Muhammadu Buhari administration clocks six years May 29, 2021.\n“From infrastructure, to finance, education, healthcare, sports, anti-corruption, human development, housing, oil and gas, foreign relations, and many others, the administration is recording giant strides, enough to make Nigerians proud."
  },
  {
    "headline": "Nigerian embassy in Paris denies allegation of extortion",
    "summarized_story": "The Nigerian Embassy in Paris, France has denied allegations that it treats Nigerians with disdain and also extorts money from them.\n“Contrary to @henryabebe’s allegations, the Nigerian Embassy France has been at the forefront of delivering efficient and timely consular and immigration services with the highest levels of professionalism.\nIt is pertinent to highlight that due to the efficiency and professionalism of the Nigerian Embassy in Paris, Nigerians from various countries in Europe travel to Paris to apply for their passports, with a same-day collection policy.\n“The Embassy staff assured our nationals that they would be attended to.\n“The Nigerian Embassy in Paris assures all Nigerian citizens and the general public that it will continue to provide timely, efficient, and professional passport, visa and consular service to our nationals, whom we treat with the highest levels of respect."
  },
  {
    "headline": "Bandits kill 8 persons in Kaduna – Commissioner",
    "summarized_story": "Kindly Share This Story:The Kaduna State Government on Friday said bandits allegedly killed eight persons in Giwa, Chikun, Igabi and Sabon Gari Local Government Areas of the state.\nThe Commissioner for Internal Security and Home Affairs, Mr Samuel Aruwan confirmed the killings in a statement on Friday in Kaduna.\nAruwan said: “Security agencies reported that bandits invaded Na’ikko village in Giwa LGA and community volunteers engaged the bandits and in the ensuing gun duel, three residents were killed.\n“In another incident, bandits invaded Dakyauro village, Sabon Birni, Igabi LGA and killed four persons after rustling about 25 cows.\n“Bandits also invaded farmlands on the outskirts of Gigani village, Kerawa, Igabi LGA and rustled about 14 bulls being used by farmers to plough the land.”The commissioner said Gov."
  },
  {
    "headline": "Borno Govt resettles displaced persons occupying schools -",
    "summarized_story": "Kindly Share This Story:The Borno Government has commenced resettlement of Internally Displaced Persons (IDPs) occupying school premises in Maiduguri.\nKolo said that another set of over 700 displaced households occupying the state NYSC camp would also be resettled.\nSome of the IDPs resettled in the newly completed housing estate in Auno village expressed happiness over the development which they said was a big relief.\nAisami said that his people had stayed for six years in the camp before this opportunity to resettle them came.\nAlso speaking, the District Head of Auno, Alhaji Abba Anas, assured the resettled persons of support and cooperation, and urged them to reciprocate the gesture by being law abiding."
  },
  {
    "headline": "Ugwuanyi replaces Innoson patrol van stolen by hoodlums at Iwollo Police Division, Ezeagu LGA",
    "summarized_story": "Kindly Share This Story:In compliance with the directives of #Governor Ifeanyi #Ugwuanyi of #Enugu State for immediate replacement of the Innoson patrol van that was made away with by hoodlums at Iwollo Police Division, Ezeagu Local Government Area, on Tuesday, among other interventions, the Enugu State Government has taken delivery of the brand new vehicle it purchased from Innoson Vehicle Manufacturing Company.\nThe reconstruction of the damaged police buildings, and other interventions by the state government as directed by the governor have commenced.\nUgwuanyi, in the wake of the unfortunate attack on police facilities in Iwollo and their personnel, visited the scene and expressed sadness over the heinous act.\nThe governor consoled and requested to meet with families of slain policemen.\nHe ordered immediate reconstruction of damaged police buildings, replacement of Innoson patrol van stolen by the yet-to-be identified hoodlums and construction of barricades before the police post."
  },
  {
    "headline": "Why EFCC is yet to dispose off Diezani Madueke’s N14bn worth of jewellery, $80m worth of house – Bawa",
    "summarized_story": "Kindly Share This Story:By Levinus Nwabughiogu-AbujaChairman of the Economic and Financial Crimes Commission, EFCC, Abdurasheed Bawa, Friday, said that court processes, administrative exigencies were stalling auctioning of seized assets.\nHe also said the Commission was waiting for a presidential Committee which was set for that purpose to finalize its assignment.\nHe said though a forfeiture order for assets recovered from the former Petroleum Minister was acquired in 2019, they were yet to be auctioned.\nChairman of the Committee, Adeogun had said that the assets could depreciate in value if kept for so long at time.\nHe assured that with the completion of the Committee’s, all assets recovered by the EFCC, as well as those recovered by other authorized agencies would be disposed."
  },
  {
    "headline": "Defend yourselves from attackers, Umahi tells security agents",
    "summarized_story": "David Umahi of Ebonyi has charged security agencies in the state to defend themselves against armed aggressors who attack them and destroy their facilities.\nThe governor, who reiterated his support for the ‘Operation Restore Peace’ a police initiative in the zone, charged security agents to engage anyone who attacked them.\n“I state clearly that if a youth has the courage to attack a security agent with gun, such security agent should shoot to defend himself if he can.\nHe noted that the security personnel were human beings like others in the society and also peoples’ fathers and mothers.\nThe governor however, complained about shortage of police personnel in the state and urged the DIG to post more to the state for adequate security."
  },
  {
    "headline": "Many killed as suspected herdsmen sack Taraba communities",
    "summarized_story": "As at the time of filing this report, no fewer than twelve dead bodies were said to have been recovered from the scenes of the two separate attacks.\nThe separate attacks, which occurred in Sabon-Gida village of Gassol Council and Pangari village of Bali, were said to have been necessitated by the herders.\nA source told DAILY POST that the herders stormed the communities at night when the residents were deep asleep.\nSome persons who claimed to have narrowly escaped the scenes, also told our correspondent that apart from the killings and injuries inflicted on residents of the communities, massive destructions of valuables also took place.\nThe leadership of the state chapter of the Miyetti Allah Cattle Breeders Association of Nigeria (MACBAN), accused Governor Darius Dickson Ishaku of alleged refusal to wade into the ongoing killings."
  },
  {
    "headline": "BREAKING: Umahi dissolves Ebonyi Executive council",
    "summarized_story": "The Governor of Ebonyi State, David Umahi, has dissolved the State Executive Council with immediate effect.\nSecretary to the State Government (SSG), Kenneth Ugbala, announced the dissolution after the council’s meeting on Friday in Abakaliki.\n“Others are Commissioner for Border Peace, Stanley Okoro Emegha; SSA Investment, Chioma Nweze and Commissioner for Capital City, Onyekachi Nwebonyi.\n“The Special Assistants to the Governor office of the Deputy Governor, Capital City, Finance, Parks, Media and Medicals are also to remain in their positions.\n“Also all Personal Assistants to the Governor are also not affected by the dissolution,” the statement said."
  },
  {
    "headline": "Emir of Kano reinstates DanAgundi as kingmaker",
    "summarized_story": "The Emir of Kano Alhaji Aminu Ado Bayero, has Turbaned Alhaji Amminu Babba DanAgundi as Sarkin Dawaki Maituta and a kingmaker after he was sacked by his father, late Ado Bayero.\nHowever, Kano State Governor Dr. Abdullahi Umar Ganduje was among hundreds of dignitaries and well wishers who graced the turbanning ceremony of Alh.\nSunusi Ado Bayero as Wambai of Kano and Alh.\nAminu Babba Dan Agundi as King maker and Sarkin Dawaki Babba on Friday at Kano Emir’s Palace.\nThe Emir also charged them to discharge their duties effectively with the fear of Allah and should use their wealth of experience towards the development of Kano State and the Emirate."
  },
  {
    "headline": "Gov Umahi orders security agents",
    "summarized_story": "Chairman of the South East Governors Forum and Ebonyi State Governor, David Umahi, at the weekend said he feels so ashamed that youths are razing police stations in the south east region to say that the region is at war.\nUmahi made this known while receiving the Deputy Inspector General of Police (DIG) in charge of South East zone, Joseph Egbunike, who paid him an official visit at the old Government House, Abakaliki, Ebonyi State capital.\nHe equally charged security agents in the state to protect themselves from attacks of armed men who attack them.\n“I charge security agents to engage anyone who attacks them as it is stupid for you to be holding a gun and someone will kill and snatch your gun.”He noted that if a youth has the stupid courage to attack a security agent who has a gun, such security agent should shoot to defend himself if he can.\n“The security agents are human beings like others in the society and are also peoples’ fathers and mothers."
  },
  {
    "headline": "May 29: PDP cautions Buhari against empty speech, false claims",
    "summarized_story": "The Peoples Democratic Party (PDP) has cautioned President Muhammadu Buhari to use the May 29 speech to accept his failure in governance and desist from further exasperating Nigerians with his usual prepared text of false performance claims and empty promises.\nThis was contained in a statement on Friday by Kola Ologbondiyan, National Publicity Secretary of the party.\n“If indeed the Buhari Presidency and the APC have any achievement to showcase, would it be organizing an awareness campaign to seek the understanding of Nigerians for its mass failures?\n“If they have anything to show, would President Buhari be begging that history should be kind to him for his failures?\nWould he go to far away Paris, France, to declare that his administration is being plagued by ill-luck?"
  },
  {
    "headline": "Chelsea vs Man City: Who wins 2021 UCL Champions league final?",
    "summarized_story": "By Alao Abiodun with agency reportsChelsea and Manchester City will on Saturday night lock horns in all-English Champions League final.\nManchester City had defeated Paris Saint-Germain to reach the final and can make history by claiming a first-ever Champions League title, which would complete the treble in a stunning season, having already won the Premier League and Carabao Cup.\nAlso, Chelsea had put in a phenomenal performance to see off Real Madrid en route to the final.\nChelsea last won three successive games against City between 2005 and 2009, after winning eight in a row.\nThis will be the first time they meet in the Champions League."
  },
  {
    "headline": "Champions League Final: Vital stats for Chelsea FC and Man City",
    "summarized_story": "Agency ReporterChelsea and Manchester City’s seasons will draw to a close on Saturday night as the English rivals battle it out in the Champions League Final in Porto.\nHere is a closer look at the vital statistics for Saturday’s showpiece event:3 | This will be the third all-English Champions League final.\n14 | It will be the 14th time an English club has won the Champions League or European Cup, second behind Spain (18).\n15 | First-time finalists such as City have won the Champions League or European Cup on just 15 occasions, compared to 26 defeats.\n25 | Goals scored by City on their route to the final, compared to Chelsea’s 22."
  },
  {
    "headline": "10 killed in fresh bandit, reprisals attacks in Kaduna",
    "summarized_story": "By AbdulGafar Alabelewe, KadunaNo fewer than 10 persons have been killed by bandits during an attack and counterattacks on two villages in Giwa Local Government Area of Kaduna State.\nAccording to him: “Security agencies reported that armed bandits invaded Na’ikko village in Giwa LGA.\nCommunity volunteers engaged the bandits and in the ensuing gun duel, three residents were killed, identified as: Alhaji Shafiu, Alhaji Balailu Sano and Abdulsamad Hussaini.\nThe Commissioner added: “In another incident, armed bandits invaded Dakyauro village, Sabon Birni, Igabi LGA and killed four persons after rustling about 25 cows.\nThe four persons killed were listed as: Musbahu Yusuf Basiru Jaafaru, Ja’afaru Yahaya and Umaru Sulaiman."
  },
  {
    "headline": "Wild reactions as Wizkid, Burna Boy get 2021 Bet Awards nomination",
    "summarized_story": "By Ekaete BasseyIt has been buzzing on social media as Wizkid and Burna boy receive nomination for 2021 Bet Awards.\nOn Thursday, May 27, BET announced on their official Instagram page Grammy-winning superstars, Ayodeji Ibrahim Balogun, popularly known as Wizkid and Damini Ogulu, popularly known as Burna Boy got a nomination each at the 2021 BET Awards.\nBurna Boy and Wizkid are up for “Best International Act”, along with several other International artistes.\nWizkid and Burna Boy won the “Best Music Video” and “Best Global Music Album” categories respectively at the 2021 Grammy Awards.\nHe also won the award in 2014 for “Best International Act: Africa.”This has not stopped social media users from the nomination of Wizkid and Burna Boy for Bet Awards to troll Davido."
  },
  {
    "headline": "Bloody Friday: Bandits kill 10 in fresh attacks in Kaduna, rustle 39 cattle",
    "summarized_story": "From Noah Ebije, KadunaNo fewer than 10 persons have been reported killed by bandits on Friday in three Kaduna communities.\nThe attacks and reprisal left five dead in Giwa Local government area of Kaduna State, just as four were killed and two injured by bandits in Igabi LGA.\nThe bandits also killed a community leader in Chikun LGA.\n“In another incident, armed bandits invaded Dakyauro village, Sabon Birni, Igabi LGA and killed four persons after rustling about 25 cows.\n“Armed bandits also invaded farmlands on the outskirts of Gigani village, Kerawa, Igabi LGA and rustled about 14 bulls being used by farmers to plough the land."
  },
  {
    "headline": "BREAKING: Obaseki wins at Supreme Court",
    "summarized_story": "From Godwin Tsa AbujaSupreme Court on Friday struck out the appeal filed by the All Progressive Congress (APC) and its candidate, Pastor Osagie Ize-Iyamu, against the outcome of the September 19, 2020 governorship election, which returned Mr. Godwin Obaseki of the Peoples Democratic Party (PDP) as Governor of Edo State, for lacking in merit.\nIn a unanimous judgment delivered by Justice Emmanuel Agim, the apex court affirmed the decision of the Court of Appeal which upheld the election of Governor Obaseki.\nThe Supreme agreed completely with the judgment of the lower courts that the appellants did not placed sufficient material evidence to upturned the decision.\nMeanwhile, the court has slammed a cost of N1million against the appellants in favour of Obaseki.\nDetails soon."
  },
  {
    "headline": "Kalu salutes new Chief of Army Staff, General Yahaya",
    "summarized_story": "Congratulating the Chief of Army Staff, Kalu extolled the virtues of the Major-General, describing him as a gallant and committed military officer with passion for professionalism and national development.\nThe former governor, urged the new army chief to sustain his outstanding attributes in his new role.\nIn a congratulatory message, the Senate Chief Whip, stressed that the Nigerian army has continually played a noble role in nation building.\nHe said: “I felicitate with the new Chief of Army Staff, Major-General Farouk Yahaya, on his new national assignment.\n“Considering his antecedents, I am optimistic that the new Chief of Army Staff will bring to bear his expertise in the discharge of his duties and responsibilities."
  },
  {
    "headline": "45 generals to retire as Buhari names, Yahaya, new chief of army staff",
    "summarized_story": "From Molly Kilete, AbujaPresident Muhammadu Buhari has appointed Major Gen. Farouk Yahaya as new Chief of Army Staff (CAOS).\nHe was granted regular combatant commission as a member of 37 regular course on 22 September 1990 in the rank of Second Lieutenant with seniority in the same rank effective September 27, 1985.\nWith his appointment of Yahaya, a member of 37 Regular Course of the Nigerian Army, it was learnt that about 45 generals would have to resign .\nThe affected officers Daily Sun gathered are mostly officers of 35 Regular Course, 36 Regular Course and 37 Regular Course who incidentally are Course-mates of the new army chief.\nThe directive Daily Sun gathered has not changed, thus meaning more officers would retire with the naming of a new service chief."
  },
  {
    "headline": "Immigration increases production capacity to beat deadline for passport backlogs",
    "summarized_story": "Comptroller–General, Nigeria Immigration Service (NIS), Mr Muhammad Babandede, has said the service has increased its production capacity to beat the May 31 deadline set to clear backlog of passport applications.\nBabandede announced this while briefing newsmen on the NIS passport reforms and recruitment exercise, yesterday, in Abuja.\nHe said that the passport production centres across the country were working round the clock to clear the backlogs before the commencement of the new passport regime on June 1.\nHe also said that all passport collection centres would be opened from 6:00 a.m. to 6:00 p.m. daily for applicants.\nOn recruitment, NIS boss said that the current recruitment exercise was the best ever in immigration and assured all applicants of transparency and fairness."
  },
  {
    "headline": "Alleged Certificate Forgery: Obaseki Wins Again, as Supreme Court Dismisses APC’s Appeal",
    "summarized_story": "By Alex EnumahThe Supreme Court on Friday dismissed the appeal of the All Progressive Congress (APC) on the alleged certificate forgery against Edo State Governor, Mr Godwin Obaseki.\nThe apex court in a unanimous judgment held that the appellants failed to prove their case beyond reasonable doubt.\nAccording to the judgment, the appellants failed woefully in their case having not provided any disclaimer from the school that the said result was not issued by it.\nThe apex court in the judgment delivered by Justice Emmanuel Agim agreed with the lower courts that the appellants did not meet sufficient requirement of the law in proving their allegations.\nThe court accordingly upheld two judgments of the Court of Appeal Abuja and the Federal High Court, Abuja, which had earlier dismissed the case of the appellants for lacking merit."
  },
  {
    "headline": "Jubilations in Maiduguri as Yahaya Emerges New Army Chief",
    "summarized_story": "The officers at the same level with the current army chief that has just been appointed can be posted to tri-service institutions with those that are ahead of him.\n“He (new Army Chief) can also decide to retire them.\nHe described the new army chief as a man known to have the welfare of the army at heart.\nProfile of New Army Chief, YahayaYahaya was born on January 5, 1966, in Sifawa, Bodinga Local Government Area of Sokoto State.\nHe was also Director, Manpower at the Army Headquarters, Military Secretary, Army Headquarters and General Officer Commanding (GOC) 1 Division of the Nigerian Army."
  },
  {
    "headline": "Emefiele: N35tn Infrastructure Investment Needed for Double-digit Growth",
    "summarized_story": "Besides, Emefiele, at another forum yesterday, also called on governors to make their states economically viable in order to reduce their dependence on allocations from the Federation Account.\n“If we take into account Nigeria’s Infrastructure Masterplan, we require close to N35 trillion worth of investment in order to attain double-digit growth.\n“This will help document a pipeline of PPP projects across various sectors of the economy,” he said.\nHe added that some MDAs have submitted their PPP Project Information Data ahead of the final submission date of May 31.\nEmefiele Urges Govs to Make States Economically ViableAlso yesterday, Emefiele called on governors to make their states economically viable in order to reduce their dependence on allocations from the Federation Account."
  },
  {
    "headline": "Buhari Felicitates with Sports Minister, Dare, at 55",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari has felicitated with the Minister of Youth and Sports Development, Sunday Dare, as he marks his 55th birthday anniversary.\nThe president, in a release on Friday by his spokesman, Garba Shehu, thanked the minister for the positive energy, patriotism and the invaluable contributions he brings in manning a very important ministry, which is strategic in moulding a better future for the country and harnessing the innate potentials and talent of Nigerians in sports.\nPresident Buhari joined members of the Dare family, friends and well-wishers in praying for good health and happiness for the celebrant, who has maintained a track record of excellence as a journalist and public office holder, having served as a former Executive Commissioner in Nigerian Communications Commission (NCC) before he came on board as a minister.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Felicitates with Sports Minister, Dare, at 55",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari has felicitated with the Minister of Youth and Sports Development, Sunday Dare, as he marks his 55th birthday anniversary.\nThe president, in a release on Friday by his spokesman, Garba Shehu, thanked the minister for the positive energy, patriotism and the invaluable contributions he brings in manning a very important ministry, which is strategic in moulding a better future for the country and harnessing the innate potentials and talent of Nigerians in sports.\nPresident Buhari joined members of the Dare family, friends and well-wishers in praying for good health and happiness for the celebrant, who has maintained a track record of excellence as a journalist and public office holder, having served as a former Executive Commissioner in Nigerian Communications Commission (NCC) before he came on board as a minister.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "How Akwa Ibom Police Aided And Abetted Ini Umoren’s Killer, Frank, His Accomplices",
    "summarized_story": "Investigations have revealed that Uduak Frank, the rapist and killer of Akwa Ibom job seeker, Iniubong Umoren had criminal cases to answer for before the latest saga.\nFor instance, MacDon did not say anything about an accomplice in a statement he issued on the arrest of Uduak Akpan on May 1.\nNot long after the search for her went viral on social media, Emmanuel quickly deleted his conversation with late Umoren.\nBoth accomplices disappeared into thin air shortly after making their respective posts while the search for the late Miss Umoren on social media became the top trending topic.\nThe circumstances that led to the arrest of Uduak Akpan have been a subject of controversy."
  },
  {
    "headline": "How Akwa Ibom Police Aided And Abetted Ini Umoren’s Killer, Frank, His Accomplices",
    "summarized_story": "Investigations have revealed that Uduak Frank, the rapist and killer of Akwa Ibom job seeker, Iniubong Umoren had criminal cases to answer for before the latest saga.\nFor instance, MacDon did not say anything about an accomplice in a statement he issued on the arrest of Uduak Akpan on May 1.\nNot long after the search for her went viral on social media, Emmanuel quickly deleted his conversation with late Umoren.\nBoth accomplices disappeared into thin air shortly after making their respective posts while the search for the late Miss Umoren on social media became the top trending topic.\nThe circumstances that led to the arrest of Uduak Akpan have been a subject of controversy."
  },
  {
    "headline": "How Akwa Ibom Police Aided And Abetted Ini Umoren’s Killer, Frank, His Accomplices",
    "summarized_story": "Investigations have revealed that Uduak Frank, the rapist and killer of Akwa Ibom job seeker, Iniubong Umoren had criminal cases to answer for before the latest saga.\nFor instance, MacDon did not say anything about an accomplice in a statement he issued on the arrest of Uduak Akpan on May 1.\nNot long after the search for her went viral on social media, Emmanuel quickly deleted his conversation with late Umoren.\nBoth accomplices disappeared into thin air shortly after making their respective posts while the search for the late Miss Umoren on social media became the top trending topic.\nThe circumstances that led to the arrest of Uduak Akpan have been a subject of controversy."
  },
  {
    "headline": "REVEALED: The 24 Army Officers Buhari Bypassed Over Ethnic, Religious Sentiments To Appoint Lesser Qualified Yahaya As Army Chief",
    "summarized_story": "President Muhammadu Buhari bypassed no fewer than 24 top senior Nigerian Army officers to appoint Major-General Farouk Yahaya as the Chief of the Army Staff, according to a document, Seniority Roll Nigerian Army Officers 2021 (Revised) obtained by SaharaReporters on Friday.\nNigerian President Muhammadu BuhariMilitary sources said Buhari might have appointed a less qualified Yahaya, from Sokoto State, based on the president’s usual ethnic and religious sentiments as seen in his other various appointments.\nThe new army chief, Yahaya, now 55 years old, was taken by the Nigerian Army Infantry Corps on September 22, 1990.\nIn 2018, former President Olusegun Obasanjo wrote an open letter to Buhari, asking him not to bother to seek re-election.\nAlso, a retired Colonel Abubakar Umar, former military governor of Kaduna State, accused Buhari of nepotism, saying it could tear the country apart."
  },
  {
    "headline": "REVEALED: The 24 Army Officers Buhari Bypassed Over Ethnic, Religious Sentiments To Appoint Lesser Qualified Yahaya As Army Chief",
    "summarized_story": "President Muhammadu Buhari bypassed no fewer than 24 top senior Nigerian Army officers to appoint Major-General Farouk Yahaya as the Chief of the Army Staff, according to a document, Seniority Roll Nigerian Army Officers 2021 (Revised) obtained by SaharaReporters on Friday.\nNigerian President Muhammadu BuhariMilitary sources said Buhari might have appointed a less qualified Yahaya, from Sokoto State, based on the president’s usual ethnic and religious sentiments as seen in his other various appointments.\nThe new army chief, Yahaya, now 55 years old, was taken by the Nigerian Army Infantry Corps on September 22, 1990.\nIn 2018, former President Olusegun Obasanjo wrote an open letter to Buhari, asking him not to bother to seek re-election.\nAlso, a retired Colonel Abubakar Umar, former military governor of Kaduna State, accused Buhari of nepotism, saying it could tear the country apart."
  },
  {
    "headline": "Garba Shehu: Buhari administration healthiest since 1999 -- we respect citizens' rights",
    "summarized_story": "Garba Shehu, presidential spokesman, says no administration since 1999 has performed better than that of President Muhammadu Buhari in terms of respecting the rights of citizens.\nShehu was speaking on 22 years of uninterrupted democracy in Nigeria, and how the current administration has performed so far.\nAccording to him, the Buhari administration places national interest above that of individuals, especially in relation to justice and aligning with the rule of law.\n“I want to think that the current justice administration under Malami is governed by a global philosophy, which places national interest above individual interest.\nAdvertisement“But by and large, with regards to the rights of citizens and respect of the law, this perhaps is the healthiest administration we’ve ever had from 1999 till date, in terms of respect for the courts, and respect for the rights of citizens."
  },
  {
    "headline": "Garba Shehu: Buhari administration healthiest since 1999 -- we respect citizens' rights",
    "summarized_story": "Garba Shehu, presidential spokesman, says no administration since 1999 has performed better than that of President Muhammadu Buhari in terms of respecting the rights of citizens.\nShehu was speaking on 22 years of uninterrupted democracy in Nigeria, and how the current administration has performed so far.\nAccording to him, the Buhari administration places national interest above that of individuals, especially in relation to justice and aligning with the rule of law.\n“I want to think that the current justice administration under Malami is governed by a global philosophy, which places national interest above individual interest.\nAdvertisement“But by and large, with regards to the rights of citizens and respect of the law, this perhaps is the healthiest administration we’ve ever had from 1999 till date, in terms of respect for the courts, and respect for the rights of citizens."
  },
  {
    "headline": "Supreme court dismisses APC's certificate forgery suit against Obaseki",
    "summarized_story": "The supreme court has dismissed a certificate forgery suit against Godwin Obaseki, governor of Edo state.\nBut the governor had insisted that the error on the copy of his certificate, which he submitted to INEC, was made by a photocopying machine.\nAdvertisementAfter losing out at the trial court and the court of appeal, the appellants went ahead to the supreme court seeking an upturn of the verdicts.\nIn a unanimous decision on Friday, a five-member panel of justices of the apex court held that the appellants failed to prove their case against Obaseki.\nEmmanuel Agim, who read the lead judgment, held that the appellants woefully failed to substantiate their forgery allegation against the governor."
  },
  {
    "headline": "Supreme court dismisses APC's certificate forgery suit against Obaseki",
    "summarized_story": "The supreme court has dismissed a certificate forgery suit against Godwin Obaseki, governor of Edo state.\nBut the governor had insisted that the error on the copy of his certificate, which he submitted to INEC, was made by a photocopying machine.\nAdvertisementAfter losing out at the trial court and the court of appeal, the appellants went ahead to the supreme court seeking an upturn of the verdicts.\nIn a unanimous decision on Friday, a five-member panel of justices of the apex court held that the appellants failed to prove their case against Obaseki.\nEmmanuel Agim, who read the lead judgment, held that the appellants woefully failed to substantiate their forgery allegation against the governor."
  },
  {
    "headline": "REPORT CARD: Presidency lists Buhari's achievements in six years",
    "summarized_story": "A Fact Sheet, a report card on the Buhari Administration, just a bit of the successes, as the milestone of six years is attained.\nThey are stubborn things.”AdvertisementBelow is the report card released by the presidency.\nIn 2020 President Buhari commissioned the first phase of the Waltersmith Modular Refinery, in Imo State.\n– Nigeria national U-17 football team, the Golden Eaglets, won the FIFA U-17 World Cup for the fifth time, in 2015.\nTheir first ever win was 30 years earlier, in 1985, when President Buhari was military Head of State."
  },
  {
    "headline": "Nokia X20 Review – Dualsight Camera, 2-day battery life, and more",
    "summarized_story": "Early in April, HMD Global announced the launch of six new Nokia Android smartphones.\nIts major selling points include 3 years worth of Android updates from Nokia, cinema mode and dualsight camera, 2-day battery life and a large screen that allows you to watch virtually anything in full HD+.\nThe Nokia X20 retails for about $480.\nFinally, inside the box we have the following:The Nokia X20 : I mean, it would be extremely awkward if this was not in there.\nThe Look, The Feel, The HeftI will start by saying the Nokia X20 is a large phone."
  },
  {
    "headline": "How can you make your company hack-proof? These five experts know.",
    "summarized_story": "Adeoluwa, Daniel, Joseph, Sophina and Nick will be discussing how you can protect your organization and customers from online fraud.\nAdeoluwa is a skilled Information Security Professional.\nHe is responsible for building the backend infrastructure, driving product roadmap, leading the technical team and driving company strategy.\nSophina is a cybersecurity professional currently working with a leading financial services firm.\nHe has over 13 years experience in the technology industry and has worked for multinational, leading technology companies."
  },
  {
    "headline": "GovTech In Nigeria: From Regulatory Maze to Models of Good Practice",
    "summarized_story": "Nigerian public procurement and regulation can be labyrinthine, but recent policy reforms and the model of good practice provided by Kaduna State hint at opportunities for public-purpose innovation to flourish in the country.\nIt has also mandated Nigerian companies with large public sector IT contracts to engage Nigerian startups as R&D partners on the projects.\nBut the Federal Government need not look far for inspiration; it can take a page out of the Kaduna State Government (KDSG)’s Govtech playbook.\nAccording to the World Bank’s latest subnational Doing Business ratings, Kaduna is the most accessible state to register property and get contracts enforced in Nigeria.\nKaduna’s example is an exciting preview of what could be should the Federal Government follow through on a promising start."
  },
  {
    "headline": "How GOtv Nigeria Built the Widest Coverage in Nigeria with Investments in Local Infrastructure",
    "summarized_story": "Nationwide digital terrestrial television operator GOtv has greatly contributed to Nigeria’s digital migration through eye-watering infrastructure investment.\nBut GOtv, launched by Details Nigeria in October 2011, has shown confidence in the local broadcast industry.\nThe company has since worked closely with the government and the Nigerian Communications Commission (NCC) in providing affordable digital television for everyone through unmatched investments in modern broadcast infrastructure.\nOver the years, GOtv has continued to invest heavily in the latest technology in digital television, especially on its transmission technology, which it has consistently improved upon.\nThese investments by GOtv in the local broadcast infrastructure and the expansion of its network coverage have come as the government-driven digital switchover programme (DSO) progresses in fits and starts."
  },
  {
    "headline": "Brand Africa Ranks TECNO 6th on the Most Admired brands in Africa List",
    "summarized_story": "– In the recently released Africa’s Best Brands 2021, TECNO ranked for five consecutive years among the TOP 6 brands on the African continent, marking another prestigious recognition of the brand’s leadership in Africa.\nEstablished in 2011, the Brand Africa 100: Africa’s Best Brands rankings is the most authoritative survey and analysis on brands and underlying businesses in Africa, based on a study by Geopoll across 28 countries spanning all the five economic regions and analysis and ranking by Kantar and Brand Leadership.\nThe 2021 survey was conducted between March and April 2021 and yielded over 80,000 brand mentions and over 3,500 unique brands.\nWhen TECNO launched dual SIM cards in Africa, there had been nothing of the kind before then.\nAnd now, with Brand Africa’s new rankings, TECNO has once again come out tops, becoming a leading player in mid to high-end mobile brand segments in Africa."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Celebrating the kids, Crypto withdrawal on PayPal, Facebook hiding Likes, Twitter Spaces arrives Web",
    "summarized_story": "Becoming even more crypto-friendly: Currently, PayPal users cannot withdraw or send cryptocurrencies directly to friends and families.\nMore crypto users?\nPayPal’s purported crypto tolerance could be a ploy to lure more crypto users to its platform.\nInstagram and Facebook users now have more control over their experience on the apps.\nThis way, Facebook satisfies those who feel pressured by Likes and those who depend on Like counts — such as influencers — to use the app."
  },
  {
    "headline": "News",
    "summarized_story": "The past few days have seen the value of cryptocurrencies take a massive dip, which is said to have stemmed from Elon Musk’s tweet.\nWhile this is not the worst crash the market has witnessed, how shou…"
  },
  {
    "headline": "Celebrating the kids, Crypto withdrawal on PayPal, Facebook hiding Likes, Twitter Spaces arrives Web",
    "summarized_story": "Becoming even more crypto-friendly: Currently, PayPal users cannot withdraw or send cryptocurrencies directly to friends and families.\nMore crypto users?\nPayPal’s purported crypto tolerance could be a ploy to lure more crypto users to its platform.\nInstagram and Facebook users now have more control over their experience on the apps.\nThis way, Facebook satisfies those who feel pressured by Likes and those who depend on Like counts — such as influencers — to use the app."
  },
  {
    "headline": "Why some Nigerians might not miss Internet Explorer but would use Microsoft Edge",
    "summarized_story": "Microsoft announced in a blog post that it would retire the Internet Explorer (IE) on June 15, 2022.\nNonetheless, while Internet Explorer was going through its steady decline in market share, and Google Chrome dominated other browsers with 69% market share, Microsoft was building Microsoft Edge to replace IE.\nWith the Microsoft Edge browser launch in 2015, the software giant revealed plans to kill off Internet Explorer, though it would continue working until the end.\nMicrosoft also claims that Edge is its solution to the security issues faced on Internet Explorer over the years.\nAnd with reportedly the highest-rated protection against malware and phishing attacks, Microsoft Edge seems to be up to the task of protection."
  },
  {
    "headline": "Low-wage manufacturing jobs can dent Nigeria’s unemployment",
    "summarized_story": "Creating low-skilled jobs in the manufacturing sector that offer lower wages can help Nigeria temporarily tackle unemployment problem, experts have said.\nWith the unemployment rate at 33.3 percent and youth unemployment rate at 42.5 percent, Nigeria’s population forecast could create a situation where the structure and pattern of growth are insufficiently geared towards job creation….\nDon’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Stanbic Bank lines up $100m to fund renewables in Nigeria",
    "summarized_story": "The manager of Nigeria’s biggest pension fund is to commit $100m in financing for the renewables sector but it’s also embracing solar energy for the good of its own business.\nStanbic IBTC will set aside the $100 million for lending to local companies in the renewables sector over the next three years to help boost…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Green Africa disrupts airline business with cheap airfares",
    "summarized_story": "“Actually, if I ran an airline in Nigeria, I would do exactly what Green Africa appears to be trying to do – target the mid-to-lower end of the market with cheap tickets by using propeller aircraft instead of jet aircraft.\n“If Green Africa does not get people to experience their flights, they won’t be able to penetrate the market.\nHe assured that after two weeks of offering promotional prices, Green Africa would begin to adjust prices to fit into current operational and economic realities.\nIt cost airlines between $500,000 and $1 million to carry out mandatory C-checks on their aircraft every 18 months.\nHowever, Tolu Odutola, a pilot and aviation expert, argued that Green Africa operates ATR 72-600, which are generally cheaper to maintain than the 737s, CRJs and other aircraft operated by local airlines."
  },
  {
    "headline": "Certificate forgery: Supreme Court upholds Appeal’s ruling, affirms Obaseki as Governor – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…APC gets N1 million fine…ruling buries diabolical controversy – ObasekiThe Supreme Court on Friday upheld the ruling of the Appeal Court, dismissing the alleged certificate forgery suit filed by the All Progressives Congress (APC) against the Governor, during the 2020 governorship election.\nThe verdict affirms the victory of Governor Godwin Obaseki at the September 19 polls.\n“From the statement by the Supreme Court Justices, it is clear that they align with what Edo people knew all along, which is that there was no merit in the case.\nRecall that the Federal High Court, Abuja, had on January 9 dismissed the alleged certificate forgery suit against Governor Obaseki.\nApparently not satisfied with the decision of the lower court, the APC approached the appellate court to challenge the judgment."
  },
  {
    "headline": "Edo govt, UN strengthens collaboration to combat COVID-19, illegal migration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, met with a delegation of the United Nations to bolster the government’s efforts at containing the coronavirus (COVID-19) pandemic and further reduce the menace of irregular migration.\nThe delegation, headed by the United Nations Resident and Humanitarian Coordinator, Mr. Edward Kallon, was received at Government House in Benin City.\nPhilip Shaibu, reaffirmed the government’s commitment to containing the pandemic and curbing irregular migration among youths in the state.\nHe noted that the present administration of Governor Obaseki is putting in place reforms and policies to ensure a business-friendly environment to attract investment into the state.\nHe noted that a part of the aim for the visit was to discuss ideas that would put an end to irregular migration among youths in Edo."
  },
  {
    "headline": "Children’s Day: We must build strong institutions to assure better future for our children – Obaseki – Nigerian Observer",
    "summarized_story": "Children’s Day: We must build strong institutions to assure better future for our children – ObasekiShare FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has assured that his administration will sustain ongoing reforms to strengthen public institutions to guarantee a sustainable future for children in the state.\nThe governor made the submission in a statement to mark the 2021 Children’s Day celebration, adding that his administration will continue to implement policy reforms to benefit children in the state.\nHe said, “I am delighted to mark this year’s Children’s Day and celebrate our children, who are the future of Edo State and Nigeria.\n“Our children remain the most important stakeholders in the Nigerian project and all our developmental efforts must be geared towards building a vibrant country with critical institutions and structures to assure a better future for them.”According to him, “In Edo State, children are beneficiaries of very pragmatic reforms that we have undertaken in the education sector over these past four years.\nI wish all Edo children a very happy Children’s Day!!"
  },
  {
    "headline": "Ambrose Alli Varsity: Obaseki sets up special intervention team with Olotu as chair – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has appointed a Special Intervention Team to exercise all the powers and functions of the Governing Council of Ambrose Alli University in accordance with the provisions of the Ambrose Alli University (Special Intervention Powers) Law 2021, except with respect to the appointment and removal of Principal Officers.\nThe Special Intervention Team is chaired by the Managing Director of Schlumberger Nigeria Ltd, Mr. Andrew Olotu.\nOther members of the Special Intervention team include Bar.\nPatrick E. Inegbedion, Mr. Uyi Izekor, Prof. Esther Ikuoria, Mrs. Imo Okundaye, Mr. Emmanuel Etomi, Mr. Osen Iyahen, Mr. Yusuf Mohammed, Comr.\n“This Special Intervention Team shall exercise all the powers and function of the Governing Council of the University as contained in the Ambrose Alli University Law 1999 (as amended) except with respect to the appointment and removal of Principal Officers.”..."
  },
  {
    "headline": "‘Bandits kidnap many travellers on Abuja-Kaduna road’ – Shehu Sani, Sources",
    "summarized_story": "ADVERTISEMENTBandits blocked the Abuja-Kaduna road on Friday, kidnapping travellers, an ex-senator and some sources have said.\nAccording to Shehu Sani who said he received a distress call from a traveller, ”the bandits blocked the road between Jere and Katari at about 4 pm”.\n“I have just got a call that bandits have blocked the Kaduna Abuja road, in between Jere and Katari village in this broad daylight.\n“When we got there, we were told by some people that the kidnappers have kidnapped scores of travellers before the operatives arrived the scene.\nPREMIUM TIMES reported how communities living around the Abuja-Kaduna road protested on Monday over incessant kidnappings."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Just In: Supreme Court dismisses Ize-Iyamu’s forgery suit against Obaseki",
    "summarized_story": "The apex court in a judgement delivered by Justice Emmanuel Agim held that the appellants failed to prove its case beyond a reasonable doubt, NAN reported.\n“This court agrees with the lower courts completely, that the appellants did not meet sufficient requirement to prove their case”.\nThe Supreme Court, therefore, awarded a cost of one million naira in favour of Governor Obaseki.\nThe appeal court in Abuja had dismissed the suit challenging Obaseki’s certificates on March 18.\nThe Appeal Court further held that Mohammed’s verdict was without ambiguity and that the APC did not prove its case."
  },
  {
    "headline": "Total changes name to TotalEnergies as part of transition to renewable energy",
    "summarized_story": "Total on Friday changed its name to TotalEnergies as pushes to become one of the world’s top five in renewables by 2030.\nThe shareholders, the statement said, approved, almost unanimously, the resolution to change the company’s name from Total to TotalEnergies, thereby anchoring its strategic transformation into a broad energy company in its identity.\nMr Patrick Pouyanné, Chairman and Chief Executive Officer of TotalEnergies said in tandem with this name change, TotalEnergies was adopting a new visual identity.\nEnergy is reinventing itself, and this energy journey is ours,” he said.\nHe said TotalEnergies would be a broad energy company committed to producing and providing energies that are ever more affordable, reliable and clean."
  },
  {
    "headline": "ADF backs May 30 Remembrance Day, says Biafra part of Igbo history",
    "summarized_story": "OBINNA EZUGWUThe Alaigbo Development Foundation (ADF), has encouraged all patriotic Igbo people across the globe to observe the May 30 Biafra Remembrance Day, as according to it, the day remained an important part of the history of Igbo nation.\nThe ADF which made call in a statement signed by its president, Professor Uzodinma Nwala and spokesperson, Chief Abia Onyike on Friday, argued that May 30 has become an official Igbo Remembrance Day, which cannot be wished away.\n“Events in Alaigbo on May 30, each year show that May 30 has become an official Igbo Remembrance Day not only within Alaigbo but throughout the entire world where Igbo citizens live.\n“It is in the light of this that the ADF fully supports observance of May 30, this year as Igbo Day Celebration.\n“May 30 marks the day Biafra was declared in 1967 and no patriotic Igbo son or daughter can pretend that Biafra is not part of the history and indeed the major water-shed in the history of the Igbo nation,” the group noted."
  },
  {
    "headline": "Any PDP tour of Osun without resolution chairmanship tussle a waste of time – Adagunodo",
    "summarized_story": "The embattled chairman of Osun State Chapter of People’s Democratic Party (PDP) Hon.\nIt is not an official programme of the Osun State chapter of the Peoples Democratic Party.\nInterest groups within a political party are allowed to consult but this should not be misconstrued as an official programme of Osun PDP.\nThere is a difference between OSUN PDP AND PATHFINDER TEAM.\nWill you consider your removal as the genesis of the Osun PDP crisis?"
  },
  {
    "headline": "Scores Kidnapped On Abuja-Kaduna Road, Says Shehu Sani",
    "summarized_story": "A former Kaduna Central Senator and civil rights advocate, Comrade Shehu Sani, has raised the alarm that scores of travelers have been kidnapped on Abuja-Kaduna Expressway on Friday.\nSenator Sani took to his social media handles to announce the incident.\nOn Facebook, he posted: “Scores kidnapped along Kaduna Abuja road, in between Jere and Katari villages this Friday afternoon.”Earlier on his Tweeter handle, the former lawmaker advised Nigerians to be careful while plying Kaduna-Abuja Road as bandits have blocked the ever-busy road.\nIn a tweet on Friday, Sani wrote: “I have just got a call that Bandits have blocked the Kaduna Abuja road, in between Jere and Katari village in this broad daylight.\nScores of people were kidnapped while many have made a fast u-turn in the face of gunshots.”"
  },
  {
    "headline": "Scores Kidnapped On Abuja-Kaduna Road, Says Shehu Sani",
    "summarized_story": "A former Kaduna Central Senator and civil rights advocate, Comrade Shehu Sani, has raised the alarm that scores of travelers have been kidnapped on Abuja-Kaduna Expressway on Friday.\nSenator Sani took to his social media handles to announce the incident.\nOn Facebook, he posted: “Scores kidnapped along Kaduna Abuja road, in between Jere and Katari villages this Friday afternoon.”Earlier on his Tweeter handle, the former lawmaker advised Nigerians to be careful while plying Kaduna-Abuja Road as bandits have blocked the ever-busy road.\nIn a tweet on Friday, Sani wrote: “I have just got a call that Bandits have blocked the Kaduna Abuja road, in between Jere and Katari village in this broad daylight.\nScores of people were kidnapped while many have made a fast u-turn in the face of gunshots.”"
  },
  {
    "headline": "May 29: Buhari Has Achieved Alot In 6 Years, Says Presidency",
    "summarized_story": "The presidency has said as the Muhammadu Buhari administration clocks six years on Saturday, May 29, 2021, the milestone affords the opportunity to reflect and recount the impact that has been made and being made in different sectors of national life.\nPresidential spokesman, Femi Adesina, said from infrastructure, to finance, education, healthcare, sports, anti-corruption, human development , housing, oil and gas, foreign relations, and many others, the Buhari administration was recording giant strides, enough to make Nigerians proud.\n“That is, those who are dispassionate and fair-minded, not beclouded by political partisanship and undue cynicism.\nA Fact Sheet, a report card on the Buhari Administration, just a bit of the successes, as the milestone of six years is attained.\nWhen the Administration breasts the tape in another two years, by the grace of God, the applause will be resounding, even from the worst of sceptics."
  },
  {
    "headline": "May 29: Buhari Has Achieved Alot In 6 Years, Says Presidency",
    "summarized_story": "The presidency has said as the Muhammadu Buhari administration clocks six years on Saturday, May 29, 2021, the milestone affords the opportunity to reflect and recount the impact that has been made and being made in different sectors of national life.\nPresidential spokesman, Femi Adesina, said from infrastructure, to finance, education, healthcare, sports, anti-corruption, human development , housing, oil and gas, foreign relations, and many others, the Buhari administration was recording giant strides, enough to make Nigerians proud.\n“That is, those who are dispassionate and fair-minded, not beclouded by political partisanship and undue cynicism.\nA Fact Sheet, a report card on the Buhari Administration, just a bit of the successes, as the milestone of six years is attained.\nWhen the Administration breasts the tape in another two years, by the grace of God, the applause will be resounding, even from the worst of sceptics."
  },
  {
    "headline": "10 Killed In Fresh Attacks In Kaduna Villages",
    "summarized_story": "No fewer than 10 residents were killed in some villages in Kaduna State, the state government said on Friday.\nAruwan explained that community volunteers engaged the bandits and in the ensuing gun duel, three residents were killed.\n“The four persons killed were listed as: Musbahu Yusuf, Basiru Jaafaru, Ja’afaru Yahaya, Umaru Sulaiman.Two persons were injured in the attack: Anas Ibrahim, Aisha Abbas,” he added.\nThe statement noted that a community leader, Dauda Adamu, was also killed by bandits at Ungwan Ayaba in Chikun LGA.\nAccording to the statement, Governor Nasir El-Rufai sent condolences to the families of those who lost their lives in the attacks, as he prayed for the repose of their souls."
  },
  {
    "headline": "Remembering Nigeria’s Biafra war, which many Nigerians would rather forget",
    "summarized_story": "He joined the Biafran army and was assigned to the signal unit, whose responsibilities included “active intelligence and eavesdropping on the Nigerian military”.\nNigerian troops entering Port Harcourt, after routing Biafran troops during the Biafran War.\nHe also remembers the last year of the war when his unit was continuously on the move, fleeing the advancing Nigerian army.\nBIAFRA- By all military odds, Biafra should have lost its war with federal Nigeria long ago.\nIts primary responsibility was to provide technological support to the Biafran army, which was poorly equipped."
  },
  {
    "headline": "Lagos Gov. Babajide Sanwo-Olu vows to punish parents of children convicted of cultism",
    "summarized_story": "Lagos State Governor, Mr Babajide Sanwo-Olu, has said the parents of children convicted for cultism will also face punitive measures.\nSanwo-Olu stated this on Thursday during the Children’s Day celebration at the Police College, Ikeja, addressing pupils and students.\nHe stated that a new law had been signed to fight cultism, adding that parents must be alive to their responsibilities by paying attention to the moral upbringing of their children.\nSanwo-Olu, who was represented by the Deputy Governor, Dr. Obafemi Hamzat, said,Quote“The new law against cultism prescribes punitive measures for parents of young people convicted of cultism.\n“It is not by accident that the education sector got the highest budget in 2020 and 2021."
  },
  {
    "headline": "Doctor narrates his encounter with a female ghost in his house, shares ‘proof’ of her presence",
    "summarized_story": "A medical doctor took to Twitter to complain about a “female ghost” that’s in his house and uses his things.\nDr Maxvayshia said the ghost slams his door, uses his shower, cleans her body with his towel, and also wipes her makeup on his clean T-shirts.\nHe shared a photo of one of his T-shirts smeared with what appears to be makeup.\nHe then issued a warning to the ghost, writing, “I don’t know what u are all about.\nBack in 2020, he shared a thread, narrating his encounter with a ghost while sleeping over at a colleague’s house."
  },
  {
    "headline": "IPOB Sit at home order: Panic buying in Imo — Daily Times Nigeria",
    "summarized_story": "Following the sit at home order issued by the leadership of the Indigenous People of Biafra (IPOB), residents of Owerri, the Imo state capital thronged to markets scrambling for food items.\nOur correspondent who visited some markets at the state capital observed that intending buyers besieged the food stuff section of the markets .\nA cross section of people who spoke to Saturday Daily Times said that with the security situation in the state nobody should take the threat by IPOB for granted.\n”Nowadays nobody can identify the people responsible for the insecurity in Imo state.\nMeanwhile, the state government on Thursday called the people of the state to ignore the sit at home order by IPOB and go about their normal business unmolested."
  },
  {
    "headline": "Bandits kill 10 in Kaduna villages",
    "summarized_story": "The state Commissioner for Internal Security and Home Affairs, Mr. Samuel Aruwan, who confirmed the attack and counter attacks, was, however, silent on when the attack occurred.\nAccording to the Commissioner, security agencies have reported that bandits invaded Na’ikko Village in Giwa LGA, killing three residents of the area.\nSimilarly, the commissioner said some bandits also invaded Dakyauro Village, Sabon Birni, Igabi LGA and killed four persons after rustling about 25 cows.\n“The four persons killed were listed as Musbahu Yusuf, Basiru Jaafaru, Ja’afaru Yahaya, Umaru Sulaiman.\nMeanwhile, the Commissioner said bandits killed a community leader, Dauda Adamu, at Ungwan Ayaba in Chikun LGA of the state."
  },
  {
    "headline": "Bandits kill 10 in Kaduna villages",
    "summarized_story": "The state Commissioner for Internal Security and Home Affairs, Mr. Samuel Aruwan, who confirmed the attack and counter attacks, was, however, silent on when the attack occurred.\nAccording to the Commissioner, security agencies have reported that bandits invaded Na’ikko Village in Giwa LGA, killing three residents of the area.\nSimilarly, the commissioner said some bandits also invaded Dakyauro Village, Sabon Birni, Igabi LGA and killed four persons after rustling about 25 cows.\n“The four persons killed were listed as Musbahu Yusuf, Basiru Jaafaru, Ja’afaru Yahaya, Umaru Sulaiman.\nMeanwhile, the Commissioner said bandits killed a community leader, Dauda Adamu, at Ungwan Ayaba in Chikun LGA of the state."
  },
  {
    "headline": "EFCC Arrests One for Money laundering, Seven Others for Internet Fraud – Daylight",
    "summarized_story": "EFCC Arrests One for Money laundering, Seven Others for Internet FraudEFCC Arrests One for Money laundering, Seven Others for Internet FraudBy JUMOKE SANNIOperatives of the Lagos Zonal Office of the Economic and Financial Crimes Commission, EFCC have arrested eight suspected internet fraudsters.\nUpon their arrest, items such as mobile devices, laptops, exotic cars and expensive jewelleries were recovered from them.\nIn the course of investigation, it was revealed that one of the suspects, Ogundiyan was also involved in money laundering.\nThe suspect who acquired his ill-gotten wealth from internet fraud, layered the proceeds into bitcoin account and then integrated it by purchasing a Range Rover Vela P380 2018 model worth N44,000,000 ($97,626 USD in bitcoin) sometime in March 2021.\nThe suspects have volunteered useful statements to the Commission and will be charged to Court soon."
  },
  {
    "headline": "EFCC Arrests One for Money laundering, Seven Others for Internet Fraud – Daylight",
    "summarized_story": "EFCC Arrests One for Money laundering, Seven Others for Internet FraudEFCC Arrests One for Money laundering, Seven Others for Internet FraudBy JUMOKE SANNIOperatives of the Lagos Zonal Office of the Economic and Financial Crimes Commission, EFCC have arrested eight suspected internet fraudsters.\nUpon their arrest, items such as mobile devices, laptops, exotic cars and expensive jewelleries were recovered from them.\nIn the course of investigation, it was revealed that one of the suspects, Ogundiyan was also involved in money laundering.\nThe suspect who acquired his ill-gotten wealth from internet fraud, layered the proceeds into bitcoin account and then integrated it by purchasing a Range Rover Vela P380 2018 model worth N44,000,000 ($97,626 USD in bitcoin) sometime in March 2021.\nThe suspects have volunteered useful statements to the Commission and will be charged to Court soon."
  },
  {
    "headline": "Edo poll: Supreme Court dismisses Ize-Iyamu’s certificate forgery suit against Obaseki",
    "summarized_story": "EdThe Supreme Court on Friday struck out Osagie Ize-Iyamu’s of the All Progressives Congress appeal challenging the election of Governor Godwin Obaseki in the 2020 governorship election in Edo State.\nThe apex court in a judgement delivered by Justice Emmanuel Agim held that the appellants failed to prove its case beyond a reasonable doubt.\nThe Supreme Court, therefore, awarded a cost of one million naira in favour of Governor Obaseki.\nThe appeal court in Abuja had dismissed the suit challenging Obaseki’s certificates on March 18.\nThe Appeal Court further held that Mohammed’s verdict was without ambiguity and that the APC did not prove its case."
  },
  {
    "headline": "Ponzi scheme operator fleeing from Lagos, arrested in Sokoto",
    "summarized_story": "By AbankulaWanted Ponzi scheme operator Omotade-Sparks Amos Sewanu, who fled from Badagry, Lagos State, has been arrested by the EFCC in Sokoto.\nSewanu was the mastermind of the Inks Nation Ponzi Scheme.\nThe suspect who had been at large, was finally arrested on 27 May.\nHe went ahead to distribute a payment card called “Pink Card” to further confuse his victims.\nOmotade-Sparks equally made false claims that he was in partnership with the EFCC to persuade people to invest in his devious scheme."
  },
  {
    "headline": "Sanwo-Olu pays condolence visit to Brig. Olayinka’s family (Photos)",
    "summarized_story": "By Nimot Adetola SulaimonLagos State Governor, Mr Babajide Sanwo-Olu on Friday paid a condolence visit to the family of late Brigadier-General, Olatunji Olayinka, who died in a military plane crash.\nRecall that the former Chief of Army Staff, Lt-Gen. Ibrahim Attahiru and 10 others including Olayinka died in the ill-fated military plane.\nThe governor was accompanied by Senator Tokunbo Abiru, and wife to Late Gen Murtala Muhammed, Mrs Ajoke.\nSee more photos below"
  },
  {
    "headline": "Aso Rock silences Buhari naysayers with catalogue of achievements",
    "summarized_story": "In 2020 President Buhari commissioned the first phase of the Waltersmith Modular Refinery, in Imo State.\n– Nigeria national U-17 football team, the Golden Eaglets, won the FIFA U-17 World Cup for the fifth time, in 2015.\nTheir first ever win was 30 years earlier, in 1985, when President Buhari was military Head of State.\n– President Buhari approved 5 billion Naira in take-off grant for the Maritime University.\n– The designation of President Buhari as the African Union (AU) Anti-Corruption Champion for 2018– The designation of President Buhari by ECOWAS Heads of State as West Africa’s Covid-19 Champion in 2020."
  },
  {
    "headline": "Why Buhari Appointed Farouk Yahaya As New Chief Of Army Staff – Minister Of Defence",
    "summarized_story": "The Minister of Defence, Bashir Salihi-Magashi has defended the decision of President Buharu to appoint Major General Farouk Yahaya as the new Chief of Army Staff.\nMagashi explained that Buhari didn’t consider ethnic or religious factors but rather national interest in choosing the new Army Chief.\nRecall that Presisent Buhari on Thursday appointed Major General Farouk Yahaya as the new Chief of Army Staff to replace the late Lt-Gen Ibrahim Attahiru who died last week in a military plan crash in Kaduna.\nThe Minister describe Yahaya as the best first for the job and expressed confidence in the ability of the new Chief of Staff to deliver.\n“The appointment of General Yahaya, President Buhari has expediently put national interest above ethnic and religious chauvinism by fulfilling all requirements necessary."
  },
  {
    "headline": "BREAKING: New COAS, Farouk Yahaya Resumes",
    "summarized_story": "On Friday, Major General Farouk Yahaya took over as the nation’s 22nd Chief of Army Staff.\nYahaya was sworn in at the Army Headquarters in Abuja during a ceremony.\nWhen he arrived, he first went to the sentry to view the guard of honour, after which he went to the conference room.\nHe led others in observing a minute of silence before the start of the program in memory of his late predecessor and ten others who died in a plane tragedy last Friday.\nFirst photo of the new COAS sitting at his official desk."
  },
  {
    "headline": "JUST IN: Disaster Averted As Tanker Guts Fire On Otedola Bridge (Photos)",
    "summarized_story": "On Friday, men from the Lagos State Fire Service extinguished flames from a tanker that had been parked near the Otedola Bridge in the Berger Area of Lagos.\nThe front of the truck was heavily damaged by the fire, according to photos taken at the scene.\nThe fire erupted as a result of an electrical problem, according to the Lagos State Emergency Management Agency.\nLASEMA tweeted, “Upon arrival at the scene it was observed a Mack tanker truck with no registration number loaded with 45,000 litres of diesel was gutted by fire while descending Otedola bridge inward Berger.\n“Further investigation gathered at the scene revealed that (the) fire started as (a) result of an electrical fault."
  },
  {
    "headline": "VIDEO:#MilitaryAppreciationDay: Nigerians honor late COAS Attahiru, military personnel",
    "summarized_story": ""
  },
  {
    "headline": "#MilitaryAppreciationDay: Nigerians honor late COAS Attahiru, military personnel",
    "summarized_story": ""
  },
  {
    "headline": "Breaking: In Ebonyi, Umahi fires Commissioners, others",
    "summarized_story": "Governor David Umahi of Ebonyi state, Friday, dissolved the State Executive Council (SEC).\nSecretary to the State Government (SSG), Dr Kenneth Ugbala, during a joint exco briefing in Abakaliki, said the dissolution was in two phases.\nThose not affected, according to him, include SSG, Attorney General and Commissioner for Justice, Cletus Ofoke; Commissioner for Finance, Orlando Nweze and Commissioner for Information, Uchenna Orji.\nOthers are Commissioner for Border Peace, Stanley Okoro Emegha; SSA Investment, Chioma Nweze and Commissioner for Capital City, Onyekachi Nwebonyi.\nThe Special Assistants to the Governor office of the Deputy Governor, Capital City, Finance, Parks, Media and Medicals are also to remain in their positions."
  },
  {
    "headline": "Disregard bill seeking to scrap NYSC, youth group tells NASS leadership -NigPilot",
    "summarized_story": "The group’s president, Obande Gideon Obande made this known in a statement titled ‘Move by Green Chambers to Scrap NYSC Scheme; A Major Drift Away from National Unity’ on Wednesday.\nAccording to Obande, the NYSC was established to unite Nigerians after the civil war.\nHe, therefore, warned that an attempt to scrap the NYSC will rather jeopardise the chances of a greater united Nigeria, one envisaged by our leaders past.\n“In view of the aforementioned and many other reasons, as Concerned Nigerian Youth we align our position with other progressives calling for total disregard for this bill,” Obande added.\nHe, however, called on all members of the Nigerian parliament with the interest of the Nigerian youth at heart to rise up against the obnoxious bill."
  },
  {
    "headline": "Disregard bill seeking to scrap NYSC, youth group tells NASS leadership -NigPilot",
    "summarized_story": "The group’s president, Obande Gideon Obande made this known in a statement titled ‘Move by Green Chambers to Scrap NYSC Scheme; A Major Drift Away from National Unity’ on Wednesday.\nAccording to Obande, the NYSC was established to unite Nigerians after the civil war.\nHe, therefore, warned that an attempt to scrap the NYSC will rather jeopardise the chances of a greater united Nigeria, one envisaged by our leaders past.\n“In view of the aforementioned and many other reasons, as Concerned Nigerian Youth we align our position with other progressives calling for total disregard for this bill,” Obande added.\nHe, however, called on all members of the Nigerian parliament with the interest of the Nigerian youth at heart to rise up against the obnoxious bill."
  },
  {
    "headline": "AREWA PERSONS WITH DISABILITIES FORUM BEGINS COVID-19 VACCINATION -NigPilot",
    "summarized_story": "The Executive Secretary National Commission for Persons with Disabilities (NCPWD) Mr. James Lalu has applauded President Muhammadu Buhari for giving persons with Disabilities a common ground to dwell on.\nThis was made known at the Arewa covid 19 vaccination and consultative meeting held in kaduna.\nIn his opening remarks, The Executive Secretary thanked Mr President for the signing into an Act, the Prohibition Against Persons with Disabilities Act 2018 and in furtherance the creation of the National Commission for Persons with Disabilities.\nHe welcomed all stakeholders to the forum put together by the Arewa PWDs to Deliberate on how to strategically strengthen issues of Disabilities.\nShe further added that the forum was attended by Stakeholders in the Disability Community, leaders of different clusters, SA’s to President Muhammad Buhari, Council Members and Management of the National Commission for Persons with Disabilities."
  },
  {
    "headline": "AREWA PERSONS WITH DISABILITIES FORUM BEGINS COVID-19 VACCINATION -NigPilot",
    "summarized_story": "The Executive Secretary National Commission for Persons with Disabilities (NCPWD) Mr. James Lalu has applauded President Muhammadu Buhari for giving persons with Disabilities a common ground to dwell on.\nThis was made known at the Arewa covid 19 vaccination and consultative meeting held in kaduna.\nIn his opening remarks, The Executive Secretary thanked Mr President for the signing into an Act, the Prohibition Against Persons with Disabilities Act 2018 and in furtherance the creation of the National Commission for Persons with Disabilities.\nHe welcomed all stakeholders to the forum put together by the Arewa PWDs to Deliberate on how to strategically strengthen issues of Disabilities.\nShe further added that the forum was attended by Stakeholders in the Disability Community, leaders of different clusters, SA’s to President Muhammad Buhari, Council Members and Management of the National Commission for Persons with Disabilities."
  },
  {
    "headline": "FG orders for immediate release of detained Malian leaders -NigPilot",
    "summarized_story": "The Federal Government of Nigeria has ordered the military junta in Mali to immediately and unconditionally release the detained transitional President and Prime Minister.\nAccording to the statement, “The Federal Government of Nigeria condemns in strong terms the detention of the duo of interim President Bah Ndaw and Prime Minister Moctar Ouane of Mali.\nThe sacking of the pillars of the coup was an enormous misjudgement,” a senior former Malian government official told the international medium.\nThe United Nations’ mission in Mali called for the group’s “immediate and unconditional” release and said those who hold the leaders would have to answer for their actions.\nThe U.S. State Department called in a statement for the “unconditional release of those currently being held”."
  },
  {
    "headline": "Supreme Court Dismisses APC Forgery Suit Against Obaseki",
    "summarized_story": "The Supreme Court has dismissed the All Progressives Congress’ (APC) forgery suit against the Edo State Governor, Godwin Obaseki.\nThe court dismissed the suit for lack of merit.\nIt was filed against Governor Obaseki, the Peoples Democratic Party (PDP) and the Independent National Electoral Commission (INEC).\nThe apex court’s judgement comes two days after the Court of Appeal in Benin upheld the victory of Governor Obaseki of Edo at the 2020 governorship election.\nIn its ruling, the appellate court held that Obaseki did not forge his certificates with which he contested the 2020 governorship election."
  },
  {
    "headline": "Diezani Forfeited Jewellery Worth N14.4bn, Houses Valued At $80m – EFCC",
    "summarized_story": "The Chairman of the Economic and Financial Crimes Commission (EFCC), Abdulrasheed Bawa has disclosed that the jewellery forfeited by the former Minister of Petroleum Resources Diezani Alison-Madueke is worth N14.4 billion.\nThe EFCC chairman stated this on Friday when he appeared before the House of Representatives ad-hoc committee investigating the assessment and status of recovered loot.\nHe said the “jewellery forfeited from the former minister has been valued by relevant government agencies and the estimated value of the jewellery is 14.4 billion naira.”Bawa also noted that the estimated value of the houses seized and forfeited from Diezani is $80 million.\nREAD ALSO: EFCC Hands Over Diezani’s Forfeited Property To Lagos For Isolation CentreEarlier this year, the EFCC handed a property forfeited by the former minister to the Lagos Government for use as an isolation centre for COVID-19 patients.\nThe six flats of three bedrooms and a boys’ quarter had been forfeited to the Federal Government, following an order of a Federal High Court in Lagos in 2017."
  },
  {
    "headline": "New COAS Maj. Gen Yahaya Assumes Office",
    "summarized_story": "The newly-appointed Chief of Army Staff Major General Farouk Yahaya has officially resumed duties.\nHe began his resumption by inspecting the Quarter Guard.\nThe new COAS succeeds Lieutenant Ibrahim Attahiru who died in a plane crash exactly one week ago in Kaduna state alongside other military officers.\nChannels Television’s Sodiq Adelakun captured the event:"
  },
  {
    "headline": "Three Officers Killed In Attack On Delta Police Station",
    "summarized_story": "Three officers have been killed in an attack on the Umutu Police Divisional Headquarters in Ukwuani Local Government Area of Delta State.\nThe Acting Public Police Relations Officer Bright Edafe confirmed the incident in a statement on Friday.\nEdafe noted that the incident started at about 2.am when armed men in their numbers stormed the Umutu police formation, shooting sporadically at the station.\nThe attackers invaded the police station in the early hours of the day with three officers feared dead.\nNigeria’s security situation has worsened in recent months despite the federal government’s reassurances and efforts by security agencies."
  },
  {
    "headline": "Police Arrest Four More Suspects Involved In Attack On Owerri Command HQ",
    "summarized_story": "The police have arrested four more suspects involved in an attack on the Owerri Command Headquarters and the Correction Centre in Imo State.\nIn a statement on Friday, spokesman of the command, SP Bala Elkana disclosed that the suspects include Ojukwu Ukonu ‘m’ 47 years old; Smith Amadokwa ‘m’ 45 years old; Ikechukwu Okomah ‘m’ 50 years old; and Ugbor Casmir Nnaemeka ‘m’ 49 years old, all citizens of Imo State.\nHe said they were arrested on May 27, 2021, at about 4:30pm in a coded operation.\nREAD ALSO: Two Suspects Linked To Attacks On Prison, Police HQ In Imo KilledHe added that the Commissioner of Police Imo State, CP Abutu Yaro has directed that the suspects be charged to court as soon as the investigation is completed.\nRead Full Statement Below:"
  },
  {
    "headline": "The Buhari administration at 6: Counting the Blessings One By One By Femi Adesina",
    "summarized_story": "In 2020 President Buhari commissioned the first phase of the Waltersmith Modular Refinery, in Imo State.\n– Nigeria national U-17 football team, the Golden Eaglets, won the FIFA U-17 World Cup for the fifth time, in 2015.\nTheir first ever win was 30 years earlier, in 1985, when President Buhari was military Head of State.\n– President Buhari approved 5 billion Naira in take-off grant for the Maritime University.\n– The designation of President Buhari as the African Union (AU) Anti-Corruption Champion for 2018– The designation of President Buhari by ECOWAS Heads of State as West Africa’s Covid-19 Champion in 2020."
  },
  {
    "headline": "Bandits kill 10 people in fresh attack in Kaduna",
    "summarized_story": "No fewer than ten person have been killed by armed bandits during an attack and counter attack in some villages in Giwa local government Area, Kaduna State.\nMr Aruwan disclosed that youths of Na’ikko village reacted to the killings by attacking Rugan Abdulmuminu, a nearby Fulani settlement, killing two persons they alleged were involved in the attack.\nArmed bandits also invaded Dakyauro village in Igabi Local government area killing four persons and rustling about 25 cattle.\nKaduna State Governor, Nasir El-Rufai expressed sadness over the attack and condoled with the families of those who were killed.\nThe Kaduna state government has also urged private schools operating in high-risk areas, to adhere to the security advisories issued to them."
  },
  {
    "headline": "Buhari Meets Former Nigeria President Jonathan Over Worsening Crisis in Mali",
    "summarized_story": "Nigeria’s President Muhammadu Buhari has called on actors in the political crisis in Mali to come together for the peace and unity of the country.\nMr Buhari stated this on Friday in the Nigerian capital, Abuja when he received in audience former President Goodluck Jonathan who is Special Envoy and ECOWAS mediator to the West African country.\nPresidential aide, Femi Adesina in a statement quoted President Buhari as saying “a situation where most parts of the country are in the hands of insurgents calls for a consensus and restoration of peace, not a further escalation of the crisis.”Former President Goodluck had briefed the President on the current situation in Mali after meeting with the key political actors ahead of the meeting of ECOWAS leaders under the Chairmanship of President Nana Akufo-Addo of the Republic of Ghana.\nHe added that the meeting of the regional leaders was necessary to urgently find an acceptable solution to the current impasse in the West African nation.\nBy Abel Ejikeme"
  },
  {
    "headline": "Kenya Stops Giving First Doses of AstraZeneca Jabs",
    "summarized_story": "Kenya’s health ministry has advised hospitals to stop giving first doses of the AstraZeneca Covid-19 vaccines.\nHealth Minister Mutahi Kagwe says a shipment arriving on Friday from global-sharing scheme Covax is meant for those due for their second shots.\nMore than 950,000 Kenyans who received their first jab of the Covid-19 vaccine in mid-March will receive the booster shots from Friday.\nMr Kagwe says under the current circumstances it will be better to ensure that these people are fully vaccinated.\nA single dose of the AstraZeneca vaccine gives around 70% protection for at least 12 weeks and 81% after a full dose."
  },
  {
    "headline": "Juventus Sack Pirlo as Head Coach, Allegri Announcement Imminent",
    "summarized_story": "Italian football club Juventus has sacked Andrea Pirlo as head coach and are close to announcing the return of Massimiliano Allegri to replace the football legend.\n53-year-old Allegri is expected to re-sign within the next 24 hours, according to Sky Sports.\nJuve issued the following message to Pirlo upon his departure from the Allianz Stadium: “Thank you, Andrea.\nA few months ago, Andrea Pirlo, an icon of world football, began his new adventure, his first as a coach.\n“Pirlo has just begun the first steps of what will no doubt become a brilliant career as a coach."
  },
  {
    "headline": "Liverpool Signs Konate From RB Leipzig",
    "summarized_story": "Liverpool have signed centre-back Ibrahima Konate from RB Leipzig after agreeing to pay his £36m release clause.\nThe 22-year-old made 21 appearances for Leipzig this season including eight Bundesliga starts as the club finished second – 13 points behind champions Bayern Munich.\nThe injuries saw Fabinho and Jordan Henderson at times deployed at centre-back, while Nathaniel Phillips and Rhys Williams were the defensive pairing at the tail-end of the season as Liverpool secured a top-four place and Champions League football next year.\nLiverpool had signed Ben Davies permanently and Ozan Kabak on loan from Schalke as defensive cover in January.\nDavies is yet to make his Liverpool debut, he was an unused substitute eight times, while Kabak made 13 appearances but looks set to return to Germany despite the club having the option to buy the 21-year-old this summer."
  },
  {
    "headline": "Syria’s Assad Wins 4th Term with 95% of Vote, In Election the West Calls Fraudulent",
    "summarized_story": "The foreign ministers of France, Germany, Italy, Britain and the United States said in a statement criticising Assad ahead of the election that the vote would not be free or fair.\nTurkey, an Assad adversary, has also said the election was illegitimate.\nThe win delivers Assad, 55, seven more years in power and lengthens his family’s rule to nearly six decades.\n… For the future of Syria’s children and its youth, let’s start from tomorrow our campaign of work to build hope and build Syria,” Assad wrote on his campaign’s Facebook page.\nRallies with thousands of people waving Syrian flags and holding pictures of Assad while singing and dancing took place all day Thursday in celebration of the election."
  }
]