[
  {
    "headline": "Ishaku knocks FG for shunning state in relief materials’ distribution",
    "summarized_story": "Taraba State Governor, Darius Ishaku, on Monday accused the Federal Government of bypassing the state government in the distribution of relief materials to the residents of the state.\nIshaku stated this shortly after he inspected the areas of Jalingo that were affected by flood on Saturday.\nHe stated, “Last week, I understand that the Ministry of Humanitarian Affairs was here sharing money to the people.\n“Generally, assistance from the Federal Government doesn’t get us in Taraba, and even when it does, it comes through some certain proxies.\nWe have the State Emergency Management Agency and the ministry of Humanitarian Affairs exists in the state."
  },
  {
    "headline": "Delta monarch, ex-LG secretary, man arrested for king’s sons, cop’s murder",
    "summarized_story": "It was gathered that the monarch was picked up at his Lagos residence over a month ago, while the two others were arrested at different locations in Delta State two weeks ago.\nThe victims’ killing was alleged not to be the first time that riot policemen attached to the monarch were killed.\nBoth Ighohwo and Mukoro were said to be contending for the traditional stool in Orhunwhorhun community.\nFollowing the arrest of the monarch and the two others, some members of Orhunwhorhun community have reportedly gone into hiding for fear of being picked up by the police over the murder.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "We have approved land for Ruga project, says Zulum",
    "summarized_story": "Governor Babagana Zulum of Borno has announced that his administration had already approved land for the Ruga project in the state, under the National Livestock Development Plan (NLDP).\n“Borno State Governor, Babagana Umara Zulum on Monday visited the Minister of Agriculture and Natural Resources, Alh.\nMohammad Sabo Nanono in Abuja, towards domesticating the Federal Government’s programme on ranching otherwise known as ‘Ruga’ project.\n“Governor Zulum informed the Minister that he had already approved the land for the Ruga project under the National Livestock Development Plan.\n“Zulum explained that, in addition to the ongoing ranching project sited in the central part of Borno, the State was in another collaborative project that will be extended to southern and northern parts of the State”, Gusau said."
  },
  {
    "headline": "LEDAP, Malala Fund embark on awareness campaign to address school drop-out, others",
    "summarized_story": "By Bashir Bello, KanoWorried by the high rate of out of school children, a Non-Governmental Organization, Legal Defence and Assistance Project (LEDAP) in partnership with Malala Fund says it is embarking on an awareness campaign to address the trend.\nMaryam Ahmad further decried the high rate of out of school children in the country which stands at 13.5 million.\nCrisis, insecurity, cultural and religious dispositions and poor funding have been limiting factors to quality education in these states.\n“The emergence of the novel COVID-19 pandemic has further put a strain on child education.\n“Against this backdrop, LEDAP in conjunction with Malala Fund is raising awareness on the right to free, compulsory and quality basic education in Nigeria."
  },
  {
    "headline": "Kemi Adeosun was not forced to resign, Official says",
    "summarized_story": "Kemi Adeosun*Confirms that investigation report was sent to SGF by NYSCFormer Minister of Finance, Mrs Kemi Adeosun was not asked to resign by the Presidency, a top official close to the Office of the Secretary to the Government of the Federation has said.\nAnother top National Youth Service Corps (NYSC) official confirmed that indeed an investigation was conducted and the report circulated in the Presidency and few other top offices in the Federal Government.\nAccording to official sources, weeks after she was accused of using an allegedly forged NYSC exemption letter, Mrs Adeosun resigned of her own volition having had a meeting with President Muhammadu Buhari where she communicated her decision.\n“I think her brother’s claim is misleading and even false because it was not up to the Vice President or his office to make the call.\nSince when has the Vice President of Nigeria or his office have the powers to ask ministers to resign?, the source quizzed."
  },
  {
    "headline": "Human Rights: IHRC report absolves Nigeria, Kenya authorities",
    "summarized_story": "Soni Daniel, AbujaThe International Human Rights Commission based in Geneva has admitted receiving no fewer than 25 petitions from individuals and groups worldwide in respect of the leader of the Indigenous People of Biafra, Nnamdi Kanu, who was recently re-arrested and repatriated to Nigeria to face trial over alleged treasonable felony.\nThe International human rights body said in a statement dated July 7, 2021 and seen by Vanguard on Monday night that majority of the petitions, which came from Nigeria, urged it to conduct an independent inquiry into human rights violations and possible breaches to established international and regional diplomatic protocols.\n…Resolves to monitor Kanu’s trial to ensure his rights are not violated"
  },
  {
    "headline": "Insecurity driving up oil production cost in Nigeria – Sylva",
    "summarized_story": "By Obas Esiedesa, AbujaThe cost of providing security for the smooth operation of the Oil and Gas Industry in Nigeria is driving up production cost per barrel in the country, the Minister of State Petroleum Resources, Chief Timipre Sylva has said.\nSylva who stated this in Abuja on Monday at the 4th annual Valuechain lecture and award, pointed out that for oil production cost per barrel to fall, cost of security has to be lower.\nHe said the government was working out ways to ensure that indigenous ship owners are patronized to grow local participation in the maritime sector.\n“As an example”, Auwalu explained, “the maritime industry is responsible for hauling oil and gas all around the world while oil and gas has fueled the maritime industry.\nThe maritime as well as the oil & gas sector have greater potential contribution to Nigeria’s Gross Domestic Product (GDP)”, he added."
  },
  {
    "headline": "COVID-19: Govt denies Delta variant killed two in Oyo",
    "summarized_story": "Olabode Ladipo, the Oyo State Incident Manager and Coordinator of the Emergency Operations Centre, says it is misleading to say COVID-19 Delta variant has killed two persons in the state.\n“That the Delta variant killed two people in the state was not what I said.\n“We then discovered that some of the cases had the Delta variant of the Coronavirus.\n“I didn’t say that those dead persons were killed by the Delta variant; let us not create unnecessary public panic,” he said.\n“It is not true that the Delta variant doesn’t have symptoms, it does have symptoms,” he said."
  },
  {
    "headline": "Buhari hails Akwa Ibom Gov. Udom Emmanuel",
    "summarized_story": "President Muhammadu Buhari hailed Governor Udom Emmanuel of Akwa Ibom State on the occasion of his 55th birthday.\nIn a statement signed by Garba Shehu, his spokesman, the President said he is mindful of Emmanuel’s devotion to serving his people.\nHe prayed God Almighty to sustain the Governor with good health and happiness to celebrate more successes in his administration.\nBuhari urged Emmanuel, who has had successful careers as a banker and chartered accountant before joining politics, not to relent in using his privileged position as an elected public officer holder to move Nigeria forward."
  },
  {
    "headline": "APC planning to create faction in PDP",
    "summarized_story": "Abuja-based right activist, Deji Adeyanju, has exposed an alleged plot by the All Progressives Congress, APC, to create a faction within the Peoples Democratic Party, PDP.\nIn a tweet, the convener of Concerned Nigerians Group wrote: “APC will soon create a faction in PDP if care is not taken.\nYou heard it here first.”This is coming at a time several top chieftains of the PDP defected to APC.\nRecently, APC National Leader, Bola Tinubu had urged members of PDP to defect to the ruling party.\nTinubu had claimed that PDP members can not achieve anything for Nigeria under the platform of the former ruling party."
  },
  {
    "headline": "Nigeria elections: Blocking e-transmission of results is coup",
    "summarized_story": "To Build A Nation (TBAN), a civil society group, says National Assembly’s blockage of electronic transmission of election results will be regarded as a coup against Nigerians.\nIn a statement on Monday, Moghalu cited media reports that the much-anticipated Electoral Act (Amendment) Bill 2021 does not provide for e-transmission of results by the Independent National Electoral Commission (INEC).\n“One, electronic transmission of election results is a popular demand by Nigerians who are keen to see significant improvements in the country’s electoral processes and outcomes.\n“Two, the National Assembly will further erode its credibility if it decides against a reasonable and popular legislative demand.\nTBAN disclosed that its findings confirm the availability of practical and inexpensive technological solutions for e-transmission of results from any polling unit Nigeria."
  },
  {
    "headline": "Atiku demands arrest of scammers using his name",
    "summarized_story": "Scammers are again using the name of former Vice President Atiku Abubakar to fleece unsuspecting Nigerians.\nThe Wazirin Adamawa’s spokesman, Paul Ibe, raised the alarm on Monday.\nHe said a fake online portal, the Atiku Foundation Youth Empowerment Fund has been set up by unscrupulous elements.\n“The portal is fake and certainly does not enjoy the authorisation of Atiku.\nThe statement urged law enforcement agencies to track and arrest and prosecute the individuals behind the identity forgery."
  },
  {
    "headline": "How to tackle Nigeria’s $32.85b public debt, by Moghalu",
    "summarized_story": "By Collins NwezeConvener of “Moghalu4Nigeria Movement (M4N) Prof. Kingsley Moghalu has proffered solutions to Nigeria’s rising debt profile.\nHe disclosed that Nigeria’s public debt profile rises by over N3.6 trillion annually, making it difficult for the government to deliver economic growth.\nHe explained that for every one naira generated in public revenue, more than 90 kobo is used to pay the interest on government’s loans.\n“This remains very important for ensuring value for money and to support public revenue growth by restoring investor confidence in the economy,” he emphasises.\nHe concluded that to realise a positive long-term public revenue outlook, the economy must be successfully diversified through value-added exports."
  },
  {
    "headline": "Stop mortgaging Nigeria’s future with your borrowings, TUC tells Fed Govt",
    "summarized_story": "By Frank Ikpefan, AbujaThe Trade Union Congress (TUC) has asked the Federal Government to stop mortgaging the future of Nigerians by taking many foreign loans.\nThe congress urged the government to look inwards by harnessing the country’s natural endowments for its financial needs.\nThe TUC also lambasted the government for the rising cost of living in the country, saying such development erodes the importance of National Minimum Wage, which some states are yet to implement.\nThe communiqué reads: “CWC-in-Session is alarmed at the rising cost of living in the country that has made minced meat of the National Minimum Wage, which some states are yet to implement.\n“CWC-in-Session vehemently detests the heavy government external borrowings to avoid mortgaging the future of Nigeria."
  },
  {
    "headline": "DSS tenders 40 exhibits against suspected killers, rapists of UNILORIN student",
    "summarized_story": "By Adekunle Jimoh, IlorinThe Department of State Security Service (DSS) has tendered not less than 40 items as exhibits at Ilorin High Court against suspected rapists and killers of a 300-level student of the University of Ilorin(UNILORIN) Olajide Blessing Omowumi.\nThe witness told the court that Akande Taiye called her with a phone number suspected to be that of the late Blessing Olajide.\nShe was tracked and invited by the DSS and this later led to the arrest of the accused person through her.\nAnother witness, a policeman, Adewale Adesola, while being led in evidence, described the sixth accused person as a neighbour he had known for the past 15 years.\nHe said the accused person gave him the stolen phone for safe keep."
  },
  {
    "headline": "Keeping Nigeria together and media’s dilemma",
    "summarized_story": "Service to Nigeria is not a favour or obeisance to the government.\nService to Nigeria is a duty to its people.\nAre we really doing our bounden duty as citizens and as seekers and keepers of the truth?\nThat Nigeria is still a going venture is largely because of the commitment of the media to the country’s unity.\nThe military force cannot defeat insecurity without the ‘’national force’’ – which comprises the civil population."
  },
  {
    "headline": "I neither visited nor discussed IPOB with British High Commissioner, Kalu clarifies",
    "summarized_story": "Chief Whip of the Senate and former governor of Abia State, Senator Orji Uzor Kalu, has debunked reports circulated in the social media that he paid a private visit to the British High Commissioner to Nigeria, Mrs. Catriona Laing, to allegedly discuss the affairs of the Indigenous People of Biafra (IPOB).\nIn a statement signed by Barrister Emeka Nwala of the Office of the Chief Whip, Kalu explained that the British High Commissioner visited him (Kalu) in his Abuja residence on May 13 in company of the Political Counsellor, British High Commission, Mr Jonathan Bacon and Mr Stuart Gardner, the 1st Secretary, Political.\n“Ngige was not even aware that the British envoy was paying me a visit on that fateful day.\nThis habit of sponsoring recycled false allegations against me is simply to discredit my goodwill on the good people of Nigeria.\n“To put the records straight, I neither visited nor discussed IPOB With British High Commissioner as reported."
  },
  {
    "headline": "Delta: Gunmen kill former NULGE chairman",
    "summarized_story": "From Paul Osuyi, AsabaA former chairman of the Nigeria Union of Local Government Employees (NULGE) in Oshimili South Local Government Area of Delta State was on Monday shot dead.\nThe official popularly known as Sanchino was allegedly killed by marauding gunmen at about 7 am around Camp 74 area of Asaba, the state capital.\nThe unknown gunmen were said to have also shot his wife who was by his side in the car at the time of the attack.\n‘The man and his wife were in the vehicle coming back after they dropped off their children in school,’ a local source said.\n‘He is a revenue officer in the local government here in Asaba, he was on his way coming back together with his wife when the gunmen shot at them around camp 74 area of Asaba."
  },
  {
    "headline": "Sound Sultan lived an exemplary life – Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has declared that the renowned singer and songwriter, Olanrewaju Fasasi, popularly known as Sound Sultan, lived an exemplary life.\nIn a statement by Special Adviser on Media and Publicity, Femi Adesina, Buhari while condoling with the Fasasi family over the death of the 44-year-old singerafter “a hard-fought battle with Angioimmunoblastic T-Cell Lymphoma”, demise is not only a loss to the Nigerian music industry, but to the country as a whole.\nSound Sultan was buried in New Jersey, U.S. on Sunday (the same day he died) according to Muslim rites amidst tears and tributes.\nThe President prayed for the eternal repose of the soul of the departed and divine peace and comfort for the family, friends, and associates.\n—Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Kalu mourns popular artiste, Sound Sultan",
    "summarized_story": "Former Abia State Governor and Senate Chief Whip, Dr. Orji Uzor Kalu, has lamented the passing of popular singer and recording artiste, Olanrewaju Fasasi, also known as Sound Sultan.\nDescribing the talented rapper and comedian as one of the best in the Nigerian entertainment industry, Kalu urged Nigerian youths to use their talents and skills to add value to the society as Fasasi did.\nThe former governor, who is also a stakeholder in the entertainment industry under the platform of Orji Uzor Kalu (OUK) Entertainment Incorporated, said the entertainment industry, if properly harnessed, would create employment and wealth for the teeming Nigerian populace.\nIn a condolence message, Kalu said: “I join stakeholders in the entertainment industry in mourning the demise of renowned rapper and sound artist, Olanrewaju Fasasi (Sound Sultan).\n“His demise is a huge loss to the entertainment industry and Nigeria in general.’’Kalu prayed for the repose of the soul of Fasasi."
  },
  {
    "headline": "Nigeria on brink of avoidable catastrophe –Afenifere",
    "summarized_story": "From Oluseye Ojo, Ibadan and Chukwudi NwejeAfenifere, pan-Yoruba socio-political organisation, has raised the alarm that Nigeria is at the brink of an avoidable catastrophe that requires urgent actions.\n“Afenifere is in full support of the governors to have laws banning open grazing latest by September 1, this year.\n“It is on record, for instance, that open grazing is one of the major causes of desertification that is occurring in the northern part of the country.\nAnd the state security body has no control anymore since the police is a federal agency, who does not take order from the governor.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Emir of Kajuru, One Baptist School Student Regain Freedom",
    "summarized_story": "Also, one of the students of Bethel Baptist High School, Damishi, Kaduna, has been released by their abductors.\nThe spokesman of the Kaduna state police command, Mohammad Jalige confirmed the release of the emir in a telephone interview with THISDAY on Monday in Kaduna.\nSimilarly one of the students of the Bethel Baptist High School, Damishi, Kaduna, have been released by their captors following ill health.\nChairman of Kaduna state Chapter of the Christian Association of Nigeria (CAN), Rev.\nThe students were abducted on July 5, when bandits invaded the school and abducted 121 of them."
  },
  {
    "headline": "APC Congresses Begin July 31",
    "summarized_story": "According to him, the congresses were shifted by one week, because the initial dates clashed with Sallah festivities.\nSpeaking while welcoming the two Governors to APC, President Buhari hailed the duo for having the courage to defect from the opposition Peoples Democratic Party (PDP) to the ruling All Progressives Congress (APC).\nAccording to him, by these defections, the two Governors will now earn more respect from their people for having the courage to move to the ruling party.\n“Your people will respect you more for having the courage to come to APC at your own time.\nWe lost many states at the last election, which is unusual for a ruling party."
  },
  {
    "headline": "News in Photographs: Buhari Presents APC Flag to Ayade, Mutawalle",
    "summarized_story": "President Muhammadu Buhari, Monday, received new All Progressives Congress Governors of Cross River, Prof Ben Ayade, and Zamfara State, Mr Bello Matawalle, in the State House Abuja.\nThe two governors who recently defected to the APC from the opposition Peoples Democratic Party were led to the State House by the Chairman of the APC Caretaker Committee, Governor Mai Mala Buni of Yobe State.\nAt the State House, President Buhari presented APC flags to the two governors.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "APC Senators Move to Delegitimise Future Elections, Democracy",
    "summarized_story": "THISDAY had, however, reported that the Senate committee had bowed to public pressure and had decided to insert a clause authorizing INEC to use electronic transmission of results whenever and wherever practicable.\nTHISDAY gathered that the APC has mobilised its members to ensure the defeat of the controversial clauses during the passage of the draft electoral law.\nInvestigations revealed that the senator met other APC senators and House of Representatives members at the weekend to convey the position of their party to them.\n“For party interest, we are mobilised to ensure that the clauses of electronic voting and transmission of results are defeated – at least, for now.\n“Under the circumstances, we shall call for division because it is in our rules, or we take electronic voting; they are all in our rules."
  },
  {
    "headline": "Onochie, Adam’s Fate Uncertain as Senate Receives INEC Committee’s Report",
    "summarized_story": "THISDAY gathered that the Senate committee will make the final decision on the two nominees latest by Tuesday before forwarding its recommendations to the upper chamber the following day.\nBuhari had on October 12, 2020, nominated Onochie and others as INEC national commissioners and their names forwarded to the Senate for confirmation.\nThe list of the nominees was forwarded last month by the President of the Senate, Dr. Ahmad Lawan, to the Senate Committee on INEC for screening.\nThe Federal High Court in a considered judgment on 6th June 2008 gave him judgment and availed him his prayers.\nThe other four INEC National Commissioner-nominees, who don’t have any petition against their candidature are Prof. Muhammad Kallah (Katsina); Prof. Kunle Ajayi (Ekiti); Mr. Saidu Ahmad (Jigawa); and Dr. Baba Bila (North East)."
  },
  {
    "headline": "Kaduna University Prepares Letter For Students To Waive Rights To Protest Against School Fees Hike",
    "summarized_story": "Kaduna State University has released a letter of undertaking to compel students from protesting against any increment of school fees.\nHowever, the letter also makes the parents pledge that their \"son/daughter/ward should be expelled without warning if he/she engages in any demonstration/protest against the increment in tuition fees or any contrary activities of the university's rules and regulation\".\nStudents of Kaduna State University on Tuesday, June 1st took to the streets to protest the hike in tuition by the state government.\nAlso for social sciences, indigenes will pay N170,000, non-indigenes will pay N200,000.\nIndigenes admitted to study medicine will pay N300,000 while non-indigenes will pay N400,000."
  },
  {
    "headline": "Kaduna University Prepares Letter For Students To Waive Rights To Protest Against School Fees Hike",
    "summarized_story": "Kaduna State University has released a letter of undertaking to compel students from protesting against any increment of school fees.\nHowever, the letter also makes the parents pledge that their \"son/daughter/ward should be expelled without warning if he/she engages in any demonstration/protest against the increment in tuition fees or any contrary activities of the university's rules and regulation\".\nStudents of Kaduna State University on Tuesday, June 1st took to the streets to protest the hike in tuition by the state government.\nAlso for social sciences, indigenes will pay N170,000, non-indigenes will pay N200,000.\nIndigenes admitted to study medicine will pay N300,000 while non-indigenes will pay N400,000."
  },
  {
    "headline": "Ondo Varsity Lecturers Sell Students Expensive Handouts For Marks To Survive Nonpayment Of Salaries",
    "summarized_story": "Some students of the Adekunle Ajasin University, Akungba-Akoko, Ondo State, have cried out over the unending expensive handouts they are forced to buy from lecturers every semester.\nSaharaReporters learnt that buying of handouts attracts good marks in some of the courses so students, therefore, pay through their nose to obtain them.\nOnce you get one, the man promised to give you 15 marks,” the course representative told the students.\nBut things have gone upside down in Ondo State; workers are owed salaries, pensions are not forthcoming.\nThe university is handicapped; it is when salaries are regular that you can maintain standards and give rules to your lecturers."
  },
  {
    "headline": "Ondo Varsity Lecturers Sell Students Expensive Handouts For Marks To Survive Nonpayment Of Salaries",
    "summarized_story": "Some students of the Adekunle Ajasin University, Akungba-Akoko, Ondo State, have cried out over the unending expensive handouts they are forced to buy from lecturers every semester.\nSaharaReporters learnt that buying of handouts attracts good marks in some of the courses so students, therefore, pay through their nose to obtain them.\nOnce you get one, the man promised to give you 15 marks,” the course representative told the students.\nBut things have gone upside down in Ondo State; workers are owed salaries, pensions are not forthcoming.\nThe university is handicapped; it is when salaries are regular that you can maintain standards and give rules to your lecturers."
  },
  {
    "headline": "Students Of Nnamdi Azikiwe University Protest Against Hike In School Fees, Others",
    "summarized_story": "The students of the Nnamdi Azikiwe University, Awka, Anambra State have protested against hike in their school fees on the school campus.\nThe students displayed different kinds of placards with inscriptions with messages such as: ‘Say no to school fees hike’, and ‘Reduce Unizik School Fees #My papa no dey pluck money from tree.'\nOne of the protesting students who contacted SaharaReporters on Monday said, “Our school fees went from N20,100 to N56,700.\nIt's looking like education is no longer for the poor.”On Saturday, the university authorities issued a press release titled ‘Re: Increment of fees for returning students of Nnamdi Azikwe University’ to debunk the rumour of hike in school fees.\n“For clarity, the University Management has not increased the tuition for students since harmonizing fees payable by students in 2019; which includes dues such as Faculty, Department, Association and the Convocations fees for the graduating classes."
  },
  {
    "headline": "PHOTOS: Sanwo-Olu nabs suspected robbers on Lagos highway",
    "summarized_story": "Babajide Sanwo-Olu, governor of Lagos, has reportedly apprehended three persons for attempting to rob a motorist on a highway in the state.\nAdvertisementThe incident reportedly occurred on Monday, when the governor was passing through the Ojota highway.\nThe suspects were said to be attempting to dispossess a motorist of his vehicle, when the convoy of the governor arrived the scene.\n“The war against criminality in Lagos State has gone a notch higher as the State Governor, Mr. Babajide Sanwo-Olu, personally arrested a gang of suspected criminals, which specialises in harassing motorists and road users in traffic,” a statement issued on Monday by the state reads.\nAdvertisement“The gang of suspected criminals met their waterloo Monday morning while attempting to unleash terror on a motorist around Ojota in-bound Alausa."
  },
  {
    "headline": "PHOTOS: Sanwo-Olu nabs suspected robbers on Lagos highway",
    "summarized_story": "Babajide Sanwo-Olu, governor of Lagos, has reportedly apprehended three persons for attempting to rob a motorist on a highway in the state.\nAdvertisementThe incident reportedly occurred on Monday, when the governor was passing through the Ojota highway.\nThe suspects were said to be attempting to dispossess a motorist of his vehicle, when the convoy of the governor arrived the scene.\n“The war against criminality in Lagos State has gone a notch higher as the State Governor, Mr. Babajide Sanwo-Olu, personally arrested a gang of suspected criminals, which specialises in harassing motorists and road users in traffic,” a statement issued on Monday by the state reads.\nAdvertisement“The gang of suspected criminals met their waterloo Monday morning while attempting to unleash terror on a motorist around Ojota in-bound Alausa."
  },
  {
    "headline": "Gbaja: N'assembly won't pass bill to gag press -- but media should be regulated",
    "summarized_story": "Femi Gbajabimila, speaker of the house of representatives, says no bill seeking to gag the press will be passed on the floor of the house.\nI will not be part of any bill that will seek to gag the press.\nNo bill will come to the floor of the house that seeks to gag the press, because the press is supposed to be the voice of the people,” he said.\n“However, I hold very strongly to the view that there is press freedom and there is freedom of expression.\nWe talk about good governance, but we don’t want to regulate and achieve good governance."
  },
  {
    "headline": "Gbaja: N'assembly won't pass bill to gag press -- but media should be regulated",
    "summarized_story": "Femi Gbajabimila, speaker of the house of representatives, says no bill seeking to gag the press will be passed on the floor of the house.\nI will not be part of any bill that will seek to gag the press.\nNo bill will come to the floor of the house that seeks to gag the press, because the press is supposed to be the voice of the people,” he said.\n“However, I hold very strongly to the view that there is press freedom and there is freedom of expression.\nWe talk about good governance, but we don’t want to regulate and achieve good governance."
  },
  {
    "headline": "PDP asks court to sack Matawalle over defection to APC",
    "summarized_story": "The Peoples Democratic Party (PDP) has asked a federal high court in Abuja to sack Bello Matawalle, Zamfara governor, over his defection to the ruling All Progressives Congress (APC).\nAdvertisementMatawalle, who defected to the APC on June 29, had said his defection is nothing out of the ordinary, adding that Zamfara will experience growth as a result of his decision.\nHowever, Mahdi Gusau, deputy governor of Zamfara, has said he will not defect to the APC.\nAdvertisementThey also submitted that Matawalle’s defection affects Gusau, Zamfara deputy governor.\nSpecifically, the court directed that the processes be served on the defendants through the national secretariat of APC in Abuja."
  },
  {
    "headline": "How Charlotte Bwana leads partnerships at Audiomack",
    "summarized_story": "At Audiomack Africa, Charlotte leads business development and media partnerships and is responsible for connecting creators, listeners, and brands to each other.\n“Business development is not sales.”In your own words, what exactly is business development?\nIn my role, business development means identifying and developing growth opportunities that will benefit Audiomack internally and forge mutually beneficial partnerships with external parties.\nAudiomack is in the media industry, but we are also in the entertainment industry.\nThis means we deal with three groups of people: creators (music artists), listeners (fans), and partners (brands)."
  },
  {
    "headline": "Telecom operators are trapped in Africa’s internet shutdowns: Can they fight back?",
    "summarized_story": "The internet ban came as the small southern African kingdom grappled with violent protests demanding the abolishment of a monarchy that has lasted more than three decades.\nNetwork operators in Africa have been severally called on to challenge internet restriction orders instead of simply implementing government directives as they come.\n“So challenging internet ban directives would be a waste of time and political suicide for telecoms businesses.\nIt’s not a sound business decision.”If telecom companies can’t challenge governments, who can?\n“So they don’t actually have a business argument or concern and it is clear that the internet ban doesn’t necessarily pose a notable threat to revenues."
  },
  {
    "headline": "The Next Wave: Dead fintech startups are seeds",
    "summarized_story": "As a recent report shows, more than one hundred fintech startups have failed in Africa in the last half decade.\nFail forward The number of fintech startups in Africa has increased by nearly 90% between 2017 and 2021.\nOne in five failures Out of the 301 fintech startups recorded in 2017, 72 had shut down by 2019.\nIt appears that at least 20% of the total fintech startups in Africa in a given year will close in two years.\n– Alexander Onukwue, Staff writer, TechCabal Share this newsletter Share Share Sign up for The Next Waveby TechCabal Sign me up"
  },
  {
    "headline": "MTN says internet access has been restored in Eswatini",
    "summarized_story": "The Eswatini subsidiary of MTN on Thursday said access to social media platforms had been restored, more than a week after internet services were reportedly restricted in the country.\n“Please take note that as of this morning all social media platforms are accessible.\nWe regret the inconvenience caused by the unavailability of these platforms,” the company said in a statement posted on its social media platforms.\npic.twitter.com/5M1gDOXzTt — MTN Eswatini (@MTNSwaziland) July 8, 2021MTN and other network operators in the southern African nation suspended access to social media and online platforms from Tuesday, June 29.\nEswatini authorities allegedly shut down internet services as a wave of pro-democracy protests demanding a regime change swept through the Kingdom, formerly Swaziland."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "5 ways to attract the right customers for your online business",
    "summarized_story": "Whatever your preferred social media platform, the five steps below provide strategies to attract the right customers to your business.\nIdentify the people who need youNow that you’ve identified the value you’re offering, the next thing to do is find your people, the ones who will be willing to pay for the value you’re offering.\nThat’s why you shouldn’t miss the upcoming SME Clinic 2021, where you’d get first hand proven strategies from seasoned experts to grow your business online.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business online.\nLearn how to launch, market and grow your business online."
  },
  {
    "headline": "Nigeria’s CribMD acquires Charisland Pharmaceuticals to facilitate quick drug deliveries to patients",
    "summarized_story": "Nigerian healthtech startup, CribMD has announced its acquisition of Charisland Pharmaceuticals Group to ensure fast and efficient one-hour drug deliveries to its patients across Nigeria.\nCharisland Pharmaceuticals Group was founded nine years ago and has a presence in major Nigerian cities.\nAs part of the sale, the startup would be assimilating Charisland Pharmaceuticals Group’s staff and hiring more to build out its operations.\nBefore the acquisition, CribMD dispensed drugs from pharmacies that they own.\nSpeaking on the choice of Charisland Pharmaceuticals Group, Ossai reveals that the group’s commitment to excellence was a decisive factor."
  },
  {
    "headline": "Nigeria’s Mobile Money regulations, Flutterwave’s tax relief miss, World Population Day",
    "summarized_story": "Good day,Today, I’m discussing:CBN’s new regulations for Mobile Money services in NigeriaFlutterwave misses out on tax reliefNigeria’s young population and techCBN releases new regulations for Mobile Money services in NigeriaOn Friday, July 9, 2021, Nigeria’s banking regulator, the Central Bank of Nigeria (CBN), released the new Framework and Guidelines on Mobile Money Services in Nigeria(PDF) as part of its financial inclusion strategy for the unbanked.\nFlutterwave misses out on tax reliefThe Nigeria Investment Promotion Commission (NIPC) has released its Report on Pioneer Status Incentive Applications Q1 2021 (PDF) under the Industrial Development (Income Tax Relief) Act.\nOthers include Flour Mills of Nigeria (FMN), Envoy Hotels, Fountain Manufacturing Company Limited, Al-Hamsad Rice Mill Limited, Benchmark Constructions Limited, and Super Packaging Limited, Royal Foam Products Nigeria Limited, ENGIE Fenix Nigeria Limited, Technology Solutions Limited, and Echostone Development Nigeria Limited.\nWorld Population DayDid you know that July 11th was World Population Day?\nWhat you missed on Techpoint Africa last weekWhat I’m reading/watchingDo white founders in Africa have an easier time getting capital?"
  },
  {
    "headline": "Marketers fear PIB removes level playing field in petroleum products importation",
    "summarized_story": "In the new PIB passed by the national assembly, only owners of refinery licences would be allowed to import petrol into the country to meet any shortfall raising fears that lawmakers are removing a level playing field for everyone.\nSection 317 (8) (2) of the Senate version of the PIB states: “License to import any…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Crypto market struggles for answers months after CBN’s ban",
    "summarized_story": "On a wall under the flyover bridge at Masha roundabout, a popular junction at Surulere Lagos is a message scribbled in white paint, ‘Bitcoin Exchange’.\nThe writer has left a number for anyone interested to call.\nAnyone who calls the number could be talking to either a legitimate trader or a potential scammer.\nThere are…Don’t miss another story Become a BusinessDay Subscriber today.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "In post-oil world, host communities fund debate off-point",
    "summarized_story": "Since the Petroleum Industry Bill (PIB) was passed on July 1, by both chambers of the National Assembly, the host community provision has stirred controversy and drowning out the threat of energy transition.\nIn the bill, the House of Representatives provided for 5 percent of prior year’s total operating expenditure while the Senate provided for…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Edo govt pledges support for Olympics-bound Edo sprinter, Enoch Adegoke – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has pledged to give all necessary support to the state’s Ambassador to the Tokyo 2020 Olympic Games, Enoch Olaoluwa Adegoke, reassuring the provision of both moral and financial support needed to succeed in the Games.\nAdegoke, who won the 100m gold medal for Edo State at the 2020 National Sports Festival, is the 12th Nigerian athlete to qualify for the Olympics in the track and field event.\nEdo State Deputy Governor, Rt.\nPhilip Shaibu, who virtually hosted the Olympic-bound sprinter on Monday, hailed the Edo athlete, reassuring the government’s support to ensure that he succeeds in Tokyo.\nOn his part, the Edo Athlete, Enoch Adegoke thanked the government for their support so far, and promised to do his best in representing the state and the country."
  },
  {
    "headline": "Federal High Court to begin 2021 annual vacation, July 26 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Federal High Court will begin it’s 2021 annual vacation on July 26.\nA circular from the Chief Judge of the Court, Justice John Tsoho, sighted by the News Agency of Nigeria (NAN) said that the vacation would end on Sept. 17.\n“Pursuant to the provisions of Order 46, Rule 4 (d) of the Federal High Court (Civil Procedure) Rules 2019, the Federal High Court will proceed on its annual vacation for the year 2021 from July 26 to Sept. 17.”The chief judge said that the court would resume sitting on Sept. 17.\nJustice Tsoho said that the vacation was to enable judges the opportunity to rest and to prepare for the challenges of the new legal year.\n“Port Harcourt: Justice S.D Pam and Justice A.T Mohammed.”Justice Tsoho wished all the judges a happy vacation."
  },
  {
    "headline": "Obaseki pledges protection of women’s rights, improved reproductive health services – Nigerian Observer",
    "summarized_story": "Obaseki noted that his administration will continue to prioritize policies that eliminate inequality, engender inclusive growth and ensure the sustenance of the reproductive health and rights and women and girls in the state.\nAccording to the UN Secretary-General, António Guterres, “Our latest estimates indicate that COVID-19 will push 47 million women and girls into extreme poverty.\n“In every corner of the world, we are seeing a reversal of hard-won gains and an erosion of women’s reproductive rights and choices, among other things.\nWith the onset of the pandemic, resources for sexual and reproductive health services were diverted.\n“These gaps in access to health rights are unacceptable."
  },
  {
    "headline": "Benin artefacts: Obaseki will continue to engage His Royal Majesty to secure final return – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said Governor Godwin Obaseki will continue to engage with His Royal Majesty, Omo N’Oba N’Edo Uku Akpolokpolo, Oba of Benin, Oba Ewuare II, to secure the final return of Benin artefacts to the state.\nIn a statement, the Secretary to the Edo State Government, Osarodion Ogie Esq., said the actions of the government thus far on the issue have been driven by selfless, patriotic considerations and in the best interest of Edo State and Edo people.\nThe statement reads: “The attention of the Edo State Government (EDSG) has been drawn to the widely publicized media statement issued by the Palace of His Royal Majesty, Omo N’Oba N’Edo Uku Akpolokpolo, Oba of Benin, Oba Ewuare II.\n“It is concerning that, the statement appears to have created the impression that there is a major conflict between the interests of the EDSG and His Royal Majesty with regards to the laudable national milestone of having our highly valued artefacts returned home to Nigeria.\n“The Governor has consequently ordered that on no account should anyone, whether in government or acting independently, engage in disrespectful exchanges and/or altercation with our revered Royal Majesty and the Benin Royal Palace,” he added."
  },
  {
    "headline": "Ohaneze Ndigbo welcome to monitor Nnamdi Kanu’s trial – Malami",
    "summarized_story": "The Attorney-General of the Federation, Abubakar Malami, on Monday welcomed the legal team set up by the Igbo socio-cultural group, Ohaneze Ndigbo, to monitor the trial of Nnamdi Kanu, leader of the proscribed Indigenous People of Biafra.\nBinta Nyako, a judge of the Federal High Court in Abuja where Mr Kanu is being prosecuted on charges of treasonable felony, fixed July 26 for continuation of Mr Kanu’s trial.\nMr Kanu was on bail granted him by the Federal High Court in Abuja where he was being prosecuted over his separatist activities when he fled the country.\nHe therefore promised that Mr Kanu would get justice in his trial with or without the Ohaneze’s monitoring team.\n“Hence, with or without the so-called monitoring group, justice will be adequately served to Nnamdi Kanu in compliances with the enshrined provisions of the law,” the statement added."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Electoral Act: Save Nigeria’s democracy, do the wish of Nigerians – Secondus charges NASS",
    "summarized_story": "National Chairman of Nigeria’s main opposition party, Peoples Democratic Party (PDP), Prince Uche Secondus, has enjoined members of the National Assembly to ensure that whatever they do regarding the Electoral amendment reflects the wishes and desires of Nigerians.\n“Free and fair election is critical to the future of our democracy and it behoves on you parliamentarians to save this democracy by doing the needful,” he said.\n“There is no doubt that every Nigerian desires a free and transparent elections and this can only be gotten if the Electoral Act is adequately amended to meet their aspirations.\n“Laws are made for the interest of the nation not to satisfy any individual, political party or groups”Prince Secondus charged Nigerians, and civil society bodies desirous of bequeathing true and lasting democracy in this country to rise and pressure their legislators to do the needful.\nFinally, the National Chairman urged the lawmakers to appreciate the mood of the nation and endeavor to take actions that will bring down rather than aggravate issues."
  },
  {
    "headline": "Nigeria’s policing system has failed badly ― Ekweremadu",
    "summarized_story": "Former Deputy President of the Senate, Ike Ekweremadu, has said that Nigeria’s policing system had failed to tackle insecurity.\nEkweremadu said the decentralisation of the police had become expedient in the face of rising wave of banditry and kidnapping across the country.\n“Our policing system has failed woefully.\nEkweremadu said that restructuring the police was no longer a matter of choice but a matter of urgency NAN reported.\n“Now that the federal policing have collapsed because they do not have the resources, the funding and the manpower, there is nothing to hold on to, Ekweremadu stressed."
  },
  {
    "headline": "Nigerian businesses attacked, shops looted as pro-Zuma protesters in South Africa",
    "summarized_story": "Businesses belonging to Nigerians and other nationals have been attacked and goods carted away by protesters demanding the release of former South African president, Jacob Zuma who jailed for contempt of court.\nThe areas affected by the attacks are the various cities in Kwa Zulu Natal and Gauteng provinces, Adetola Olubajo, ppresident of the Nigerian community in South Africa said in statement.\nOlubajo said five Nigerian-owned businesses were attacked in the unrest sparked by pro-Jacob Zuma protesters, advising members of the community in the affected areas to be safety conscious.\n“We identified five businesses belonging to Nigerians looted and destroyed yesterday, Sunday 11 July 2021 by the angry mob,” he said.\n“Cars were burnt and businesses belonging to both locals and foreign nationals were looted and destroyed by angry protesters,” Olubajo said."
  },
  {
    "headline": "Amaechi tasks Lekki Deep Seaport promoter on 2022 completion deadline",
    "summarized_story": "Nigeria’s Minister of Transportation, Chibuike Rotimi Amaechi, has urged the promoter of the Lekki Deep Seaport, Lekki Port LFTZ Enterprise Limited, to ensure that the project is completed by next year, 2022.\n“I am very delighted and impressed with the pace and the progress of construction work on this project from the last time I was here in November 2020,” he said.\n“The promoter of the project – Lekki Port LFTZ Enterprise Limited has demonstrated strong commitment and capacity to deliver the project as agreed.”Amaechi urged the management of the seaport and other stakeholders to work tirelessly to ensure that the Port becomes operational by mid 2022.\nThe Chairman, Lekki Port LFTZ Enterprise Limited, Mr Abiodun Dabiri, while briefing the Minister on the status of construction of the Port, disclosed that the entire construction is now at 55.4 per cent completion.\nHe added that the Port has the deepest seaport in the sub-Saharan African region and would serve as transhipment hub for the region."
  },
  {
    "headline": "N8bn Fraud: Court Admits Forensic Report Against Former JTF Commander, Others",
    "summarized_story": "Justice Ayokunle Faji of the Federal High Court in Lagos yesterday admitted the report of forensic documents examiner against a former commander of the Military Joint Task Force (MJTF), Operation Pulo Shield, in the Niger Delta, Major General Emmanuel Atewe (rtd) and his co-defendants.\nThe Economic and Financial Crimes Commission (EFCC) had arraigned Atewe and 10 others before the court on an amended 22-count charge of conspiracy, illegal conversion and fraud.\nDocked alongside Atewe are former director-general of the Nigerian Maritime Administration and Safety Agency (NIMASA), Patrick Akpobolokemi, Kime Engozu and Josephine Otuaga.\nADVERTISEMENTAt the resumed hearing of the matter on Monday, the EFCC counsel, Suleiman Suleiman, presented the sixth prosecution witness, Benedict Agweyi, a Forensic Documents Examiner and the Commission’s acting Director of Forensics.\nIn forensically analysing the documents, Agweyi said he used three methodologies bearing in mind three principles in signature analysis that guided the analysis of this nature."
  },
  {
    "headline": "N8bn Fraud: Court Admits Forensic Report Against Former JTF Commander, Others",
    "summarized_story": "Justice Ayokunle Faji of the Federal High Court in Lagos yesterday admitted the report of forensic documents examiner against a former commander of the Military Joint Task Force (MJTF), Operation Pulo Shield, in the Niger Delta, Major General Emmanuel Atewe (rtd) and his co-defendants.\nThe Economic and Financial Crimes Commission (EFCC) had arraigned Atewe and 10 others before the court on an amended 22-count charge of conspiracy, illegal conversion and fraud.\nDocked alongside Atewe are former director-general of the Nigerian Maritime Administration and Safety Agency (NIMASA), Patrick Akpobolokemi, Kime Engozu and Josephine Otuaga.\nADVERTISEMENTAt the resumed hearing of the matter on Monday, the EFCC counsel, Suleiman Suleiman, presented the sixth prosecution witness, Benedict Agweyi, a Forensic Documents Examiner and the Commission’s acting Director of Forensics.\nIn forensically analysing the documents, Agweyi said he used three methodologies bearing in mind three principles in signature analysis that guided the analysis of this nature."
  },
  {
    "headline": "OUR STAND: Kill The Press Council Bill",
    "summarized_story": "Even worse, the bill intends to deny the average man in the street the right to be informed, to know the truth.\nBy the provisions of this code of conduct, the Council shall cause to be established in the Nigerian Press Council Journal, the Code of Professional and Ethical Code of Conduct as approved under Section (1) of this section which shall be binding on every media Houses, Journalists and media practitioners in Nigeria.\nIn the case of a journalist to a fine of N250, 000 only and in an extreme case, the council shall order the striking out of the name of the journalist from the register.\nThe bill is claiming that only the government knows the truth which the media must propagate or be damned.\nIt is from this stand point that we urge the lawmakers to do the right thing that their consciences demand, which is, kill this bill because it is a direct affront to the right to know."
  },
  {
    "headline": "OUR STAND: Kill The Press Council Bill",
    "summarized_story": "Even worse, the bill intends to deny the average man in the street the right to be informed, to know the truth.\nBy the provisions of this code of conduct, the Council shall cause to be established in the Nigerian Press Council Journal, the Code of Professional and Ethical Code of Conduct as approved under Section (1) of this section which shall be binding on every media Houses, Journalists and media practitioners in Nigeria.\nIn the case of a journalist to a fine of N250, 000 only and in an extreme case, the council shall order the striking out of the name of the journalist from the register.\nThe bill is claiming that only the government knows the truth which the media must propagate or be damned.\nIt is from this stand point that we urge the lawmakers to do the right thing that their consciences demand, which is, kill this bill because it is a direct affront to the right to know."
  },
  {
    "headline": "School, Parents Sell Properties To Raise Ransom For Abducted Islamiyya Pupils",
    "summarized_story": "Both parents and the proprietors of the Salihu Tanko Islamiyya School, Tegina, Niger State, are making efforts to raise the ransom demanded by the bandits who abducted pupils from the school about six weeks ago.\nMeanwhile, the abductors of pupils of have again reduced their ransom demand from N50 million to N30 million.\nThey had initially demand N200 million to release the 136 pupils in their custody.\nConsequently, it was learnt that the parents had started selling their properties to raise the ransom, with the school authorities selling a plot of land within the school premises to raise some money for the purpose.\nADVERTISEMENTThe head teacher of the school, Alhassan Garba Abubakar, told LEADERSHIP that the school authorities sold a plot of land adjacent the school meant for further expansion to contribute to the ransom."
  },
  {
    "headline": "Dud Cheque: Court Arraigns Glotech Resources Limited",
    "summarized_story": "By TONY ADAMSThe Abuja Zonal Office of the Economic and Financial Commission, EFCC, today July 12, 2021 arraigned a company, Glotech Resources Limited, before Justice E. Okpe of the FCT High Court, Apo, Abuja for offence bordering on issuance of dud cheque.\nUgochukwu Okeke, a director of the company pleaded ‘not guilty’, in writing, to the charge.\nHowever the judge frowned that the plea was not written on the letter head of the company.\nProsecution Counsel Mariya Ujudud Shariff thereafter requested for a short date for commencement of trial.\nThe court obliged the request and adjourned till July 16, 2021 for trial."
  },
  {
    "headline": "Dud Cheque: Court Arraigns Glotech Resources Limited",
    "summarized_story": "By TONY ADAMSThe Abuja Zonal Office of the Economic and Financial Commission, EFCC, today July 12, 2021 arraigned a company, Glotech Resources Limited, before Justice E. Okpe of the FCT High Court, Apo, Abuja for offence bordering on issuance of dud cheque.\nUgochukwu Okeke, a director of the company pleaded ‘not guilty’, in writing, to the charge.\nHowever the judge frowned that the plea was not written on the letter head of the company.\nProsecution Counsel Mariya Ujudud Shariff thereafter requested for a short date for commencement of trial.\nThe court obliged the request and adjourned till July 16, 2021 for trial."
  },
  {
    "headline": "Baba Ijesha’s GoFundMe page taken down after protest",
    "summarized_story": "A GoFundMe page that was set up to raise money for the legal cost of embattled actor, Olanrenwaju Omiyinka, aka Baba Ijesha, has been taken down, The PUNCH has learnt.\nThe actor had been charged with indecent treatment of a child, defilement of a child, sexual assault by penetration, attempted sexual assault by penetration and sexual assault, which contravene sections 135, 137, 261, 202, 262 and 263 of the Lagos State Criminal Law, 2015.\nHowever, a supporter, Oladele Matti, based in Ireland, set up a fundraiser titled, ‘Help Olanrewaju Omiyinka with Legal Costs’ with the aim of raising €50,000.\nExplaining the reason behind organising the fundraiser for the distressed actor, Matti said, “Hi, my name is Oladele Matti and I am fundraising for Olanrewaju Omiyinka aka Baba Ijesha legal costs.\nOur correspondent, who visited the website on Monday, observed that the page could not be found."
  },
  {
    "headline": "Baba Ijesha’s GoFundMe page taken down after protest",
    "summarized_story": "A GoFundMe page that was set up to raise money for the legal cost of embattled actor, Olanrenwaju Omiyinka, aka Baba Ijesha, has been taken down, The PUNCH has learnt.\nThe actor had been charged with indecent treatment of a child, defilement of a child, sexual assault by penetration, attempted sexual assault by penetration and sexual assault, which contravene sections 135, 137, 261, 202, 262 and 263 of the Lagos State Criminal Law, 2015.\nHowever, a supporter, Oladele Matti, based in Ireland, set up a fundraiser titled, ‘Help Olanrewaju Omiyinka with Legal Costs’ with the aim of raising €50,000.\nExplaining the reason behind organising the fundraiser for the distressed actor, Matti said, “Hi, my name is Oladele Matti and I am fundraising for Olanrewaju Omiyinka aka Baba Ijesha legal costs.\nOur correspondent, who visited the website on Monday, observed that the page could not be found."
  },
  {
    "headline": "Jihadists wipe out all male Christians in two Nigerien towns, women flee",
    "summarized_story": "Jihadists in Niger Republic have wiped out all the male Christians in Fantio and Dolbel, two towns in the Tillabéri region in the south west.\nSurvivors of the attack, a group of women, with small children and babies fled to the Dori region of Burkina Faso.\nAID TO THE CHURCH IN NEED (ACN), which reported the attacks, quoted the women as saying the terrorists attacked the towns twice, killing the men.\nIn Fantio, the jihadists took a statue of the Virgin Mary, liturgical books and musical instruments and burned them.\nThis is the third parish in this part of Niger that has been abandoned due to terrorist attacks and incursions by extremist groups."
  },
  {
    "headline": "Ramaphosa: 10 dead, 4 SAP members injured in Zuma riots",
    "summarized_story": "In a special broadcast from his office at Tuynhuys, Cape Town, Ramaphosa revealed that 10 people have died in the riots, while four SAP members have been injured.\nRamaphosa appealed to their sense of reasoning, about the inviolability of the constitution, whether one is rich or the poor.\nRamaphosa however warned that his government was prepared to protect every person in the country.\nEach of us, no matter our position or our circumstances, has an interest in maintaining and upholding the rule of law.\nWe will stand as one people, united against violence, unanimous in our commitment to peace and to the rule of law."
  },
  {
    "headline": "Sanwo-Olu arrests suspected criminals in Ojota (Photos)",
    "summarized_story": "The war against criminality in Lagos State has gone a notch higher as the State Governor, Babajide Sanwo-Olu, personally arrested a gang of suspected criminals, which specialises in harassing motorists and road users in traffic.\nThe gang of suspected criminals met their waterloo Monday morning while attempting to unleash terror on a motorist around Ojota in-bound Alausa.\nThe security personnel attached to the Governor swooped on the suspects, retrieved the dangerous weapons from them and arrested the three of them.\n“We are determined to stabilize the security situation in Lagos State, as our own contribution towards lasting national security.\nWe will find you, wherever you may be lurking and we will bring the full weight of the law on you,” Governor Sanwo-Olu declared."
  },
  {
    "headline": "Terror-linked Pantami Bags Another Award For Continuing Ahmadu Bello’s Agenda Across Nigeria",
    "summarized_story": "It comes after a slew of other honors have been conferred on Mr Pantami since his former ties to terrorist organizations including al-Qaeda and the Taliban were exposed.\nMr Pantami had professed his support for terrorist organizations and even criticized the then-federal government for killing his “Muslim brothers,” Boko Haram, in a series of publications published by Peoples Gazette.\nMr. Pantami was named the most outstanding minister of the year in 2021 by the tabloid Elite Exclusive Magazine in June of that year.\nMr. Bello, the former Northern Nigerian premier and a conservative politician, campaigned hard for Northern Nigeria’s modernisation and the union of the region’s numerous tribes.\nHe also pushed for the Northernisation Policy, which aimed to deploy northerners in federal jobs like as the public service, military, and paramilitary."
  },
  {
    "headline": "BREAKING: GoFundMe Deletes Baba Ijesha’s Page",
    "summarized_story": "NewsDirect has learned that a GoFundMe page set up to gather money for the legal costs of troubled actor Olanrenwaju Omiyinka, alias Baba Ijesha, has been pulled down.\nIndecent treatment of a child, defilement of a child, sexual assault by penetration, attempted sexual assault by penetration, and sexual assault were all filed against the actor under sections 135, 137, 261, 202, 262, and 263 of the Lagos State Criminal Law, 2015.\nHowever, a supporter in Ireland, Oladele Matti, has set up a fundraising with the goal of earning €50,000 to help Olanrewaju Omiyinka with legal costs.\nExplaining the reason behind organising the fundraiser for the distressed actor, Matti said, “Hi, my name is Oladele Matti and I am fundraising for Olanrewaju Omiyinka aka Baba Ijesha legal costs.\nOn Monday, our correspondent went to the website and discovered that the page was missing."
  },
  {
    "headline": "Oyetola Swears In 69 Newly-appointed Local Government Caretaker Chairmen",
    "summarized_story": "…tasks them on progressive ideals, fairness, equity…urges them to hit the ground runningThe Governor of the State of Osun, Adegboyega Oyetola, on Monday swore in newly-appointed Local Government Caretaker Committees in all the Local Government Areas, Local Council Development Areas, Area Councils and Administrative Offices, in the State.\nHe also urged them to look inward and make their services count in the lives of the people in the best progressive ideals that the party is known for.\n“You will recall that since our assumption of office, we have run an Administration that is transparent, inclusive, purposeful and absolutely pro-people.\nGovernor was able to bring out 69 out of millions of people of the State to serve.\nDon’t disappoint Mr Governor."
  },
  {
    "headline": "BREAKING: Malami And Ohanaeze Meet Over Nnamdi Kanu",
    "summarized_story": "The Ndigbo Group’s legal team met with Attorney General of the Federation and Minister of Justice, Abubakar Malami, to discuss the case of Nnamdi Kanu, the leader of the Indigenous People of Biafra.\nJibrilu Gwandu, the Special Assistant on Media and Public Relations in the Office of the AGF, made the announcement in a statement.\nThe position of Ohanaze Ndigbo on the question of kanu, according to the statement, proved their acknowledgement of Nigerian citizenship and submission to the rule of law.\n“The group showed a mature departure from the mindset of the proscribed Indigenous People of Biafra when Ohanaeze said they ‘do not support the use of any form of violence’ while channelling concerns and presenting demands.\nMalami also stated that the current administration “respects the rule of law and does not advocate for the breach of law."
  },
  {
    "headline": "Chidinma gives fresh insight on death of Super TV owner’s death",
    "summarized_story": "Chidinma Ojukwu, the suspect arrested in connection with the death of Michael Ataga, CEO of Super TV, has denied killing him.\nThe University of Lagos Student, alleged late Ataga, had revealed that he had marital problems before his death.\nAtaga was found dead days after checking into an apartment with the suspect in Lekki, Lagos.\nI don’t know who must have come into the apartment, and did that… I don’t know who that person is.\nI don’t know what happened."
  },
  {
    "headline": "Updated: Emir of Kajuru regains freedom",
    "summarized_story": "The Emir of Kajuru, Malam Alhassam Adamu, who was kidnapped alongside 10 other members of his community has been freed over 36-hours after his abduction.\nThe 85-year-old was released at about 5pm on Monday after spending a night in the custody of the bandits.\nThe Police Public Relations Officer, Kaduna state Police Command, ASP Muhammed Jalige, told Blueprint on Monday that, “yes he has been released.\n“The Emir of Kajuru has been released.\nThe spokesman of Kajuru Emirate Council, Dahiru Abubakar, also confirmed the release of the emir, saying that Emir Adamu was released at an undisclosed location within Kajuru local government area."
  },
  {
    "headline": "Pictures: Another heavy rain pours into National Assembly",
    "summarized_story": "PreviousGwagwalada FIRS controller harps on value of planning for retirement"
  },
  {
    "headline": "GOC 7 Division commends troops’ fighting spirit, resilience, gallantry -NigPilot",
    "summarized_story": "Gen Eyitayo lauded the troops during a maiden operational tour of 24 Task Force Brigades, Dikwa, and Special Intervention Battalion IV, as well as Mobile Strike Team 16 collocated in New Marte.\nHe commended troops’ high level of alertness and undampened fighting spirit in recent encounters with elements of Boko Haram terrorists (BHTs) and Islamic State West Africa Province (ISWAP).\nThe GOC urged the troops to sustain the momentum and ensure that remnant of the terrorists is completely neutralized.\nGeneral Eyitayo told the troops, that his visit was necessitated by the need to evaluate and address security and operational challenges, as well as issues bordering on the welfare of the troops.\nDuring the visit, the GOC inspected a large cache of arms, ammunition, and Gun trucks captured from neutralized terrorists."
  },
  {
    "headline": "MHWUN passes vote of confidence on HRM Biobelemoye -NigPilot",
    "summarized_story": "Josiah challenged staff not to hoard any information from the incoming acting Secretary-General, to enable him quickly understand the workings of his new office.\nThe Royal Father also reminded the administrative staff to render the same support extended to Late Silas Adamu to the new Acting Secretary-General, to perform his duties optimally.\nHe recalled the relentless commitment of the Late MHWU Secretary-General, Silas Adamu, and charged the new Acting Secretary-General to ensure bureaucracy is seemless in memory of his predecessor.\nAuwolu Kiawa’s Appointment, Follows the Sudden Demise of MHWUN Secretary-General, Mr. Silas Adamu, in a ghastly autocrash along Abuja- Kaduna Expressway, on 8th of March 2021.\nLate silas Adamu who died along with his wife and daughter has since been buried."
  },
  {
    "headline": "Lock-up Capital in Land breeds huge economic loss – SGoF -NigPilot",
    "summarized_story": "The Surveyor General of the Federation (SGoF), Surv Samuel Adeniran Taiwo said that Nigeria has suffered huge economic loss because of lock-up capital in land resulting from ineffective land administration, improper land use, and property management.\nHe noted that the theme of the conference, “Unlocking Real Estate Potentials for Economic Development” was timely and inspiring.\nHe added that there was no gainsaying the fact that land remained a major resource of any type of physical development, impacting heavily on national economic architecture.\nHe reiterated that land remained a major factor of production and “it is key for all purposes of socioeconomic development”.\nHead of Press and Public Relations, Office of the Surveyor General of the Federation Abu, Michael in a statement said that Surv."
  },
  {
    "headline": "Nigeria trade relation with Qatar is very low – Nigerian Envoy",
    "summarized_story": "The Ambassador Extraordinary and Plenipotentiary of the Federal Republic of Nigeria to the State of Qatar, Ambassador Yakubu Abdullahi has said that Nigeria’s trade relation with Qatar is very low.\nAmbassador Abdullahi said this while presenting his Letters of Credence to the Emir of the State of Qatar, His Highness Sheikh Tamim bin Hamad Al-Thani.\nAmbassador Ahmed expressed gratitude to President Muhammadu Buhari for finding him worthy of appointment as his Principal Envoy to the State of Qatar.\nThe Emir of Qatar in his response assured the Nigerian Envoy of his support to succeed in the discharge of his mandates.\nThe credential’s presentation ceremony was preceded by the inspection of the Guard of Honour by the Nigerian Ambassador, who until his appointment as Ambassador to the State of Qatar was the Director of Protocol, State House."
  },
  {
    "headline": "Nnamdi Kanu: FG Welcomes Ohanaeze To Monitor Trial Of IPOB’s Leader",
    "summarized_story": "Attorney General of the Federation (AGF) and Minister of Justice, Abubakar Malami, SAN has welcomed the formation of a legal team by Ohanaeze Ndigbo to monitor the proceedings at the trial of the self-acclaimed IPOB leader, Nnamdi Kanu, a move which is in line with the doctrine of the right of fair hearing rooted in Section 36 of the Constitution of the Federal Republic of Nigeria.\n“Inherent in the position of the Ohanaeze Ndigbo on the matter was the demonstration of their recognition of belonging to Nigeria and succumbing to the rule of law while maintaining their stance that they were not averse to the trial of Nnamdi Kanu,” a communique by the AGF’s spokesman, Dr. Umar Jibrilu Gwandu reads in part.\nAccording to Malami, by urging the youths to be law-abiding and sheath their sword as well as asking them to try to obtain voter’s card to enable them to contribute to national development, the position of Ohanaeze becomes glaringly constitutional and commendable.\n“Let it be made abundantly clear that President Muhammadu Buhari-led Federal Government respects the rule of law and does not advocate for the breach of law.\nHence, with or without the so-called monitoring group, justice will be adequately served to Nnamdi Kanu in compliance with the enshrined provisions of the law,” the minister’s communique further reads."
  },
  {
    "headline": "Emir Of Kajuru Regains Freedom After One Night In Kidnappers’ Den",
    "summarized_story": "Kidnapped Emir of Kajuru, Alhassan Adamu, has regained his freedom, authorities confirmed to Channels Television on Monday.\nA top official of the Kajuru council area as well as the spokesman of the Kajuru Emirate council, Dahiru Abubakar confirmed the release of the 85-year-old traditional ruler to Channels Television.\nHe said Emir Adamu was released at an undisclosed location within Kajuru Local Government Area of Kaduna and is in good condition.\nREAD ALSO: Bandits Abduct Emir of Kajuru, 13 Family MembersThe bandits had swooped on the Emir in the early hours of Sunday morning, just six days after the abduction of 121 students of Bethel Baptist school in neighboring Chikun Local Government Area.\nAccording to the spokesperson of the Kajuru Emirate Council, the bandits also gave assurances that all the victims are in good condition and were not being molested."
  },
  {
    "headline": "Alleged Funds Misappropriation: Judge Threatens To Order Arrest Of Stella Oduah",
    "summarized_story": "A Federal High Court in Abuja has threatened to issue a bench warrant of arrest on Former Aviation Minister, Stella Oduah over her continuous absence in court.\nJustice Inyang Ekwo issued the threat on Monday, following the refusal of the former minister to honour court proceedings.\nOduah, now a Senator representing Anambra North Senatorial District in the National Assembly, was billed to be arraigned on a 25-count alongside four others.\nThe Economic and Financial Crimes Commission (EFCC) is alleging that Oduah misappropriated public funds while serving as a minister.\nOther defendants are Gloria Odita, Nwosu Emmanuel Nnamdi, Chukwuma Irene Chinyere, Global Offshore, and Marine Limited, Tip Top Global Resources Limited, Crystal Television Limited, Sobora International Limited, and China Civil Engineering Construction Corporation (CCECC) Nigeria Limited."
  },
  {
    "headline": "‘Information Blackout’: Nigeria Newspapers Campaign Against Media Bills",
    "summarized_story": "Several newspapers in Nigeria on Monday published an advertorial against media regulations bills being considered at the National Assembly.\nWith a bold headline titled ‘Information Blackout’, the advertorial said the NPC and NBC (Media) Act amendment bills being considered by federal lawmakers was geared against the right of citizens information.\nREAD ALSO: ‘Avoid Controversy,’ Jega Advises Buhari To Withdraw Onochie’s Nomination“It’s not just against the media,” the advertorial said.\nMeanwhile, Mr Odebunmi has said his bill to amend the Nigerian Press Council act is not designed to gag the media.\n“Most of the people commenting on the bill have no knowledge of it,” he said recently, as reported by Vanguard newspaper."
  },
  {
    "headline": "Alleged N2.8bn Fraud: Court Grants Ex-Surveyor General Awudu N100m Bail",
    "summarized_story": "A Federal Capital Territory (FCT) High Court in Maitama on Monday granted N100 million bail to the former Surveyor-General of the Federation, Ebisintei Awudu.\nAwudu was arraigned before Justice Olusegun Adeniyi, on a 22-count charge of fraud.\nREAD ALSO: Alleged Unlawful Defection: PDP Urges Court To Sack Zamfara GovernorUpon arraignment, Awudu pleaded not guilty to all counts.\nF.B Olorogun, the defendant’s counsel, urged the court to grant bail to his client.\nRuling on the application, Justice Adeniyi granted the defendant bail in the sum of N100 million."
  },
  {
    "headline": "GOC 3- Division of Nigerian Army, Major General Ibrahim Ali assumes Command",
    "summarized_story": "The newly appointed General Officer Commanding, GOC, 3- Division of the Nigerian Army, Major General Ibrahim Ali has assumed command of the Division.\nAt a ceremony in at the Division Headquarters Jos, Major General Ali thanked the Chief of Army Staff, Lieutenant General Faruk Yahaya for the confidence reposed in him to command the Division.\nHe urged senior officers to work as a team, imbibe positive attitude to work, l and demonstrate professionalism in the discharge of their duties.\nMajor General Ali said that is the only way to ensure success and move the Division to greater heights.\nEarlier in in the ceremony, his the outgoing Acting GOC, Brigadier General Bello Muhammad thanked God for granting him successful tenure of office."
  },
  {
    "headline": "2 Carriers of Delta variant of Covid-19 in Oyo are dead – Taskforce",
    "summarized_story": "The Oyo State COVID-19 Task Force says two residents that contracted the Delta variant of the COVID-19 virus are dead.\nCurrently, he said the state had about five patients of COVID-19 at the state Infectious Diseases Centre, Olodo, Ibadan.\nHe noted that the Delta variant was about 90 per cent more transmissible, faster to spread than the original COVID-19 virus found in Wuhan, China, and charged residents of the state to reactivate all COVID-19 protocols to stem further spread of the Delta variant.\nWe have gotten one of the contacts in isolation; one of the contacts came positive and is currently in isolation in the state facility.\n“The Delta variant is the variant that was giving quite a lot of people concern to countries around the world."
  },
  {
    "headline": "President Buhari Mourns Sound Sultan, condoles family",
    "summarized_story": "President Muhammadu Buhari has mourned the death of popular entertainment star Olanrewaju Fasasi aka Sound Sultan, describing it as a loss to the entire nation.\nAccording to a statement by his Special Adviser on Media and Publicity, Mr Femi Adesina, President Buhari noted the singer/rapper/actor lived an exemplary life, having done much to contribute to the Nigerian entertainment industry.\nHe recalled that Sound Sultan, during his lifetime, showed so much kindness and generosity just as he exhibited a lot of passion about issue concerning his country, as reflected in his musical works.\n“President Muhammadu Buhari extends heartfelt condolences to the Fasasi family on the death of renowned singer and songwriter, Olanrewaju Fasasi, popularly known as Sound Sultan, aged 44.\nAdvertisement“The President notes that Sound Sultan’s demise is not only a loss to the Nigerian music industry, but to the country as a whole."
  },
  {
    "headline": "AU Delegation Urges Nigeria to Motivate Other African Countries on Governance",
    "summarized_story": "A delegation from the the Africa Union (AU) has urged Nigeria to live up to its Big Brother tag on the continent by motivating other African countries in governance.\nThe AU delegates on Country Review Mission (CRM), on the second Peer Review process in Abuja on Monday said Nigeria needs to serve as motivator to other African countries in governance and other good virtues.\nThe Lead Panelist on AU CRM, Prof. Janneh Abdoulie, made the call in Abuja, at the town hall meeting, organised by the African Peer Review Mechanism (APRM), to engage State/Non-Actors on the review process.\nAccording to him, the review mission will address the four thematic areas of democracy/political governance, economic, social development, and corporate governance.\nAlso, Mr Boboye Oyeyemi, Corps Marshal, Federal Road Safety Corps (FRSC), said the corps was exploiting new mechanism to boost its services to reduce traffic crisis and fatality on Nigeria road."
  },
  {
    "headline": "Nigeria: Kidnappers Release Emir of Kajuru, Hold Grandchildren, Others in Captivity",
    "summarized_story": "A Nigerian monarch, the Emir of Kajuru in northwestern Kaduna state Adamu Alhassan has been released by his abductors.\nTerrorists who on Sunday abducted the 85-year-old emir had on Monday demanded a ransom of N200 million, some $487,804 for his release.\nARISE News had reported that the monarch was kidnapped in the wee hours of Sunday along with 13 of his family members, including two grandchildren.\nNews of the ransom demand was disclosed by spokesperson of the Kajuru Emirate Council, Dahiru Abubakar on Monday.\nBut according to the Chairman of Kajuru Local Government Area, Cafra Caino told journalists in the state that the emir was released Monday evening."
  },
  {
    "headline": "Rights Group Condemns Arrest of 12 Journalists in Ethiopia, Demands Release",
    "summarized_story": "A campaign group Reporters Without Borders is calling on authorities in Ethiopia to release twelve journalists who were recently detained in a wave of arrests in the capital Addis Ababa.\nMost of the journalists, including one who runs a YouTube channel critical of the government, were arrested on June 30, according to the group.\nIt said no explanation had been given for their arrests until July 2, when police linked the journalists to a terrorist group, referring to the Tigray People’s Liberation Front (TPLF).\n“We condemn these mass arrests of journalists, which clearly aim to deter independent investigative reporting on the war in Tigray,” said Arnaud Froger, the head of RSF’s Africa desk.\nReporters Without Borders ranks the Horn of Africa nation at 101 out of 180 in the world on its annual press freedom index."
  },
  {
    "headline": "South Africa President Ramaphosa to Address Nation as Violence Rages Over Ex-President Zuma’s Conviction",
    "summarized_story": "South Africa’s President Cyril Ramaphosa is set to address the nation Monday as violence and looting rages in parts of the country, acting minister in the presidency Khumbudzo Ntshavheni has confirmed.\nZuma was convicted of contempt of court after failing to attend an inquiry into corruption during his presidency.\nThe 79-year-old, who denies corruption, is hoping to get his sentence rescinded or reduced at the Constitutional Court hearing.\nThe address later on Monday comes a day after Ramaphosa announced the country would remain on adjusted lockdown level 4.\n“The majority of South Africans do not and should not tolerate violence, the destruction of property and the endangering of livelihoods."
  },
  {
    "headline": "You Were a Student When Nigeria’s North and South Agreed on Rotation’: Ohanaeze Slams Kogi Governor Bello",
    "summarized_story": "The apex Igbo socio-cultural organisation, Ohanaeze Ndigbo, has slammed Kogi state governor Yahaya Bello over his recent comment on rotational presidency, saying the governor was still in school when the agreement was reached.\nMr Bello on Friday described talks by southern states governors (who had in a resolution said that Nigeria’s president in 2023 should come from the south) of rotational presidency as unconstitutional.\nOhanaeze, however, noted that there was actually an agreement for rotational presidency in Nigeria between the North and the South.\n“Governor Bello was still a student, studying accountancy at the Ahmadu Bello University (ABU), Zaria when an agreement was reached between the North and the South with respect to Rotational Presidency,” National Publicity Secretary of the group, Alex Ogbonnia said in the statement.\nDr Chuba Okadigbo spoke on behalf of the South while Alh Abubakar Rimi spoke for the North."
  }
]