[
  {
    "headline": "US demands democracy as Tunisian president suspends parliament",
    "summarized_story": "Tunisian President Kais Saied on Friday dismissed US concerns over threats to democracy in the North African country more than a month after he suspended parliament, raising charges of a coup.\n“There is no reason to worry about the subject of freedom, justice and democracy” in Tunisia, Saied said in a statement from his office during a visit by a high-level US delegation.\nFiner delivered a message from President Joe Biden “urging a swift return to the path of Tunisia’s parliamentary democracy”, a White House statement said.\nRead Also Tunisia's president fires defence ministerSaied on July 25 froze parliament for 30 days, lifted parliamentary immunity and sacked the prime minister along with other top officials.\nThe largest party in parliament accused him of staging a coup, charges dismissed by Saied."
  },
  {
    "headline": "Sit-at-home will hold whenever Kanu appears in court —IPOB",
    "summarized_story": "The proscribed Indigenous People of Biafra led by detained Nnamdi Kanu has ordered the suspension of ‘Every Monday’ sit-at-home order by the group in the South-East.\nThe group also said the sit-at-home will hold whenever Kanu appears in court.\nHe said, “The suspension of the Sit-At-Home by the IPOB Head of Directorate was as a result of an order from the leader of this great movement, Onyendu Mazi Nnamdi Kanu.\n“There is no gain saying the fact that one of the major fundamental guiding principle of IPOB is Command and Control.\nAny other information regarding Sit-At-Home in Biafraland not emanating from IPOB through our main channels of information dissemination should be disregarded."
  },
  {
    "headline": "Attack on Police Station: 3 suspected ESN members, 2 policemen killed in Imo",
    "summarized_story": "By Chinonso Alozie, OwerriThe Imo State Police Command has killed three suspected members of the Eastern Security Network, ESN, the combat arm of the Indigenous People of Biafra, IPOB, and lost two police officers, when the ESN men allegedly attack Izombe Police Station in Oguta Local Government Area in the State.\nThe State Police Public Relations Officer, PPRO, Michael Abattam, said this to newsmen in Owerri, on Saturday.\nThe Police said the incident which happened on Friday at about 02:45 pm, saw the police repelled the attackers from destroying the Police Station.\nHowever, the Police said it has called on the members of the community to assist the Command on the whereabouts of the fleeing suspects.\nAlso, hospitals are advised to ensure that they report any person(s) who come to them for treatment of bullet wounds,” Police said."
  },
  {
    "headline": "Ahmed Joda was a patriot, great public servant — ACF",
    "summarized_story": "By Ibrahim Wuyo, KadunaThe Arewa Consultative Forum(ACF) has said that the late Ahmed Joda was a calm and honest, soft-spoken but firm public servant.\n“In his death, Nigeria has lost a great civil servant and patriot,” the Forum said.\nEmmanuel Yawe, National Publicity Secretary Arewa Consultative Forum, said in a statement that ACF was thrown into deep mourning over the death of Alhaji Ahmed Joda.\n“Ahmed Joda was until his death the pillar on which the Northern Region and indeed Nigeria relied in times of turbulence.\nIn his death, Nigeria has lost a great civil servant and patriot."
  },
  {
    "headline": "Ahmed Joda: Nigeria lost a stabilizer — Kaduna Speaker",
    "summarized_story": "By Ibrahim Wuyo, KadunaChairman, Northern Speakers Forum and Speaker of the Kaduna State House of Assembly, Rt.\nYusuf Ibrahim Zailani has described the demise of Alhaji Ahmed Joda as a huge loss not just to his family or Adamawa State where he hailed from, but to the entire country.\n“Late Alhaji Joda who died at the age of 91 was a stabilizer, who has for decades contributed to the peace and progress of the country,” Zailani said.\nThe Kaduna Speaker said that although he rarely spoke, he worked silently behind the scenes, promoting peaceful coexistence.\nIt would be recalled that Alhaji Joda died on Friday afternoon, August 13, 2021, at Federal Medical Center, Yola."
  },
  {
    "headline": "Masari condemns recurring killings by customs’ operatives in Katsina",
    "summarized_story": "Governor Aminu Masari of Katsina StateGov.\nAminu Masari of Katsina State has condemned the recurring killings of innocent citizens through reckless driving by operatives of the Nigeria Customs Service (NCS) in the state.\nIn a statement by Malam Abdu Labaran, Director-General, Media and Publicity to Masari and made available the News Agency of Nigeria ((NAN) in Katsina on Friday, Masari said he would no longer condone such senseless killings.\n“The state government is considering legal action against the NCS, to serve as a deterrent against future occurrences of the fatal incident” Masari said.\n(NAN)Vanguard News Nigeria"
  },
  {
    "headline": "Lack of implementation of laws, oversight by legislators breed insecurity, terrorism in Nigeria — Eric Ufom alleges",
    "summarized_story": "In the same vein, the National Assembly has been advised to wake up to the responsibility of monitoring activities of the officials who run the activities of the Nigerian Disabilities Commission through a vibrant oversight function that would ensure proper implementation of the Nigerians Disability Law as passed by the legislators in 2019.\n“Such people have gone way off the guidelines of the laws that established the Commission by taking their own discretions while setting the laws aside and once the foundation is faulty, what can the righteous do?\n“It is not a hopeless situation for the country yet.\n“These series of historic traumas that originated from those gory experiences have been passed down from generation to generation and victims of post-traumatic stress disorder are swelling in their ranks daily and the nation is bleeding daily from security challenges across the land.\n“Lack of true implementation of the Nigerians with Disabilities Act 2018 by the Executive arm of Government and proper oversight by the Legislative arm destroys excellent historic legacy made by President Buhari for over 31 million Nigerians with disabilities."
  },
  {
    "headline": "Malami condoles family over death of Shagari’s widow",
    "summarized_story": "The Attorney General of the Federation and Minister of Justice, Abubakar Malami, SAN, has paid a condolence visit to the family of late former Nigerian president, Shehu Shagari over the death of his wife, Hajiya Hadiza Shehu Shagari.\nDr. Umar Jibrilu Gwandu, Special Assistant on Media and Public Relations to Malami, made this known in a statement issued on Saturday in Abuja.\nAccording to the statement, Malami who was in Sokoto at the residence of the late President Shehu Shagari described the late widow, Hajiya Hadiza Shehu Shagari as a woman of integrity whose virtues will always be remembered.\nResponding, the representative of the family, who received the minister at the residence, Alhaji Ahmad Shehu Shagari thanked Malami for his care and concern demonstrated through the condolence visit to the family.\nBuhari mourns Shehu Shagari’s wife"
  },
  {
    "headline": "Biafra: Ex-IPOB deputy leader reveals abomination allegedly committed by Nnamdi Kanu",
    "summarized_story": "Former deputy leader of the Indigenous People of Biafra, IPOB, Uche Mefor, has alleged that Nnamdi Kanu, leader of the group committed “sacrilege and abomination”.\nHe claimed that the IPOB leader deliberately spilled the blood of Igbo people.\nAccording to Mefor, the spirit of the land will continue to work against Kanu until he makes atonement for the abomination he committed.\nIn a post on his Facebook page, Mefor wrote: “The lies and the subsequent beheading of Igbos by IPOB Nnamdi Kanu is an abomination too many.\n“We don’t know Uche Mefor, it’s his personal opinion and we have nothing to say about that."
  },
  {
    "headline": "FG urged to address unemployment to reduce violent extremism",
    "summarized_story": "A non-governmental organization, Actionaid Nigeria, has called on the Federal Government to urgently address the growing unemployment rate in the country to reduce violent extremism.\nAtakpu, who described unemployment and marginalization as a critical driver of violent extremism, stressed the need for all stakeholders and policy makers to support the drive for innovative ideas as it comes to issues of food security.\nContinuing Atakpu said, ” this will create job opportunities that would address unemployment which holistically will deduce violent extremism in the country”.\nWhen there is hunger next year, it will escalate conflict and violent extremism in all areas in the country”.\nIsah Abdulkareem, described Youth engagement in Agriculture as cardinal if the issues of unemployment gap in the country must be tackled."
  },
  {
    "headline": "Flood renders many homeless, destroys farmlands in Bauchi [Photos]",
    "summarized_story": "Flood has again destroyed many houses, farmlands among others as a result of a heavy downpour in Kirfi Local Government Area of Bauchi State.\nMany foodstuffs was destroyed, farmlands were destroyed, many of them are stranded,” he said.\n“In Celedi alone, not less than 150 houses were destroyed and razed to the ground apart from the ones that were soaked.\nI’ll give an estimate of 600 houses destroyed in the local government area.\nThe items are 600 bags of maize (100kgs) and 600 bags of rice (50kgs)."
  },
  {
    "headline": "Southeast group tasks youths to embrace agriculture",
    "summarized_story": "A sociopolitical organization has advised youths to develop and build themselves rather than relying on the government for Nigeria greatness.\nThe Southeast Youths For Equity Alliance (SEYEA) noted that the era of dependency on the government for their self development is over and such ideas should be thrown into the waste bin.\nIf Nigeria youths in time past can achieve all of these, I don’t think anything can stop the resilient spirit of our Youths in turning the narrative for a better, united and prosperous Nigeria where equity, justice and fairness dwells,” it added.\nThe sociopolitical organization reemphasized on the need for Nigerian youths to embrace agriculture with an innovative approach to help the nation in its food chain network.\nThe group maintained that if Nigerian youths can make do with their fertile and level ground natural endowment, they will beat every other country in the world in meeting up with the vision 2030 global food security goals of the United nations."
  },
  {
    "headline": "Mob sets suspected burglar ablaze in Delta",
    "summarized_story": "By Elo Edremoda, WarriAn angry mob on early Saturday morning set a suspected burglar ablaze in Warri, Delta state.\nThe suspect was burnt alive by Cinema Site Roundabout in Okumagba Avenue, Warri South council area.\nADVERTISEMENTAccording to residents, the suspect was caught while breaking into a house in the area.\nREAD ALSO: Military deactivates illegal refineries in Niger DeltaIn a video seen by our reporter, a crowd gathered at the scene, staring at the burnt corpse.\nPolicemen from the ‘B’ Division Warri, who got a hint of the incident were deployed to the scene to ensure calm and vehicular movement."
  },
  {
    "headline": "BREAKING: IPOB suspends sit-at-home order",
    "summarized_story": "By Ogochukwu Anioke, AbakalikiThe Indigenous People of Biafra(IPOB) has suspended the weekly sit-at-home exercise it commenced this week in the southeast.\nIPOB had declared a weekly sit-at-home exercise to protest the arrest and detention of its leader, Nnamdi Kanu by the Federal Government.\nIt explained: “The leadership of the Indigenous People of Biafra (IPOB) understands the concern being expressed by the global IPOB family on the suspension of the weekly Sit-At-Home earlier announced by the IPOB Head of Directorate of State of the Indigenous people of Biafra.\nADVERTISEMENT“The suspension of the sit-at-home by the IPOB Head of Directorate was as a result of a direct order from the leader of this great movement Onyendu Mazi Nnamdi Kanu.\nAny other information regarding Sit-At-Home in Biafraland not emanating from IPOB through our main channels of information dissemination should be disregarded”."
  },
  {
    "headline": "Masari threatens to sue Customs over killings in Katsina",
    "summarized_story": "By Augustine Okezie, KatsinaKatsina Governor Aminu Bello Masari has threatened legal action against the Customs Service after 10 residents were killed during a border drill operation in JibiaA statement by the Governor’s Director-General Media, Abdulabaran Malumfashi, said Masari condemned the frequent killing of innocent residents in the State by the Nigeria Customs Service.\nIt reads: “The Governor condemns in the strongest term the oft-recurring senseless killings of citizens through reckless driving by operatives of the Nigerian Customs Service.\nADVERTISEMENT“Government will henceforth not condone any more of such incidents again.\nREAD ALSO: Masari seeks review of 2021 budget‘’Government is considering instituting legal action against the Nigerian Customs Service so that it may serve as a deterrent against a future occurrence of these fatal incidents which have assumed a frightening regularity in the State’’.\nMasari’s position, The Nation reports, was based on the recent killing of eight persons, which has risen to 10, who were run over by operatives of the Nigerian Customs border drill in Jibia Local Government on Monday, August 9, 2021."
  },
  {
    "headline": "JUST IN: Abducted Niger APC chairman regains freedom",
    "summarized_story": "By Justina Asishana – MinnaThe abducted All Progressives Congress (APC) Zone ‘C’ Chairman in Niger State, Alhaji Aminu Musa Bobi has been freed.\nBobi was abducted last week by gunmen on his way to the farm along Ukuru road in Bobi district area of Mariga local government area.\nIt said the APC chairman has been taken to the General Hospital, Kontagora for medical attention.\nADVERTISEMENTHe said: “The Command mobilised a joint Police, army and vigilante team to the area for manhunt of the gunmen.\n* The abducted chairman was released by the abductors on 13/08/2021 at about 1530hrs and resurfaced around Igwama forest, Bobi district area of Mariga local government area of the state."
  },
  {
    "headline": "BBNaija Shine Ya Eye: Biggie bars Maria, Peace, Liquorose from HoH lounge",
    "summarized_story": "By Gbenga BadaBig Brother recently lost his temper when BBNaija Shine Ya Eye housemates flouted his rules.\nDeputy head Of House Maria had invited Liquorose and Peace into the Head Of House lounge, flouting page 4 of the rule book, which says no one except the Head of house, deputy head of house are allowed to stay in the room.\nADVERTISEMENTBiggie barred Maria, Liquorose and Peace from the Head of House lounge for two weeks.\nHe said the three female housemates will have to stay in the common bedrooms for the next two weeks even if they emerge as Head Of House or Deputy on Monday."
  },
  {
    "headline": "Self-determination agitation: Proposed UN protest divides Southern, Middle Belt leaders",
    "summarized_story": "Middle Belt Forum National Publicity Secretary, Dr Dogo Isuwa, told Saturday Sun in a telephone interview that his group did not participate in any meeting where a decision to hold such a protest march was discussed or taken.\nThe person that signed the statement also signed on behalf of Akintoye, who is not leader of Afenifere.\nMeanwhile Secretary-General of NINAS, Mr. Tony Nnadi, has said that the group does not need the approval of Afenifere, Ohanaeze, PANDEF and Middle Belt Forum (MBF) for proposed march at the UN.\nHe said: “It is something involving the entire alliance fellowship, talking about the East, West and Middle Belt and all of us who are fed up with Nigeria.\n“In December last year, when we came out, the heads of all the blocs signed – PANDEF, Middle Belt Forum; Afenifere was having issues at that time, Banji, Akintoye, a confidant of Awolowo signed."
  },
  {
    "headline": "Kanu, Igboho: Nothing illegal in agitations for secession –Muiz Banire",
    "summarized_story": "Even, your party, APC has restructuring in its manifesto and further to that, it set us a committee headed by Kaduna State Governor, Nasir el-Rufai towards its implementation.\nFor me, restructuring was part of it, but why they are not doing anything, I don’t know.\nI have always believed that we do not have, technically speaking, political parties in Nigeria.\nThat is why you find people moving from one political party to the other at will because there is not ideological commitments.\nBy the time we assumed that, you would see some sort of checks against the political parties."
  },
  {
    "headline": "Trying to conceive? These are things you should and shouldn’t do",
    "summarized_story": "This, according to the professor, is called preconception care.\n“Although, there is no well-defined preconception care services in the health care system for now in Nigeria, preconception care services are however provided in cases where the health workers perceive a need or in cases where the clients outright seek such services”.\nThree: Avoid stressWhile trying to get pregnant, it is advisable to get rest, sufficient relaxation and avoid stress.\nIt is important to note that even a small quantity of alcohol drinking among pregnant women put the foetus at risk for development of foetal alcohol syndrome (FAS).\n“In fact, 80 per cent of couples get pregnant within six months after they begin trying to conceive."
  },
  {
    "headline": "Tears, romance, fights hallmark BBNaija show",
    "summarized_story": "From White Money making a mark with his culinary skills to Yousef waxing candid about his personal life, the show is getting hotter by the hour.\nThe lucky ones included White Money, Yerins, Saga, Arin, Angel, Tega, and Beatrice.\nWhite Money as viewers’ favouriteIf there is one thing that White Money knows how to do best, it’s to warm his way gradually into the hearts of viewers with humour and remarkable quotes.\nWith so many celebrities and fans on social media rooting for him, White Money never ceases to prove he is the content viewers have signed up for.\nSix housemates win N.5m eachThe housemates were divided into three groups namely Team Gold, Team Smooth, and Team Foreign Extra Stout."
  },
  {
    "headline": "Showdown looms in South- East over sit-at-home order",
    "summarized_story": "As Igbo mull the experience, opinions are divided as to the possibility of sustaining the every Monday sit-at-home order.\nShe feared that, going by the way Igbo youths are being killed by suspected IPOB sit-at-home enforcers, the zone may soon be devoid of able-bodied youths.\nHowever, ahead of next sit-at-home exercise, indications are that the people might decide to stay indoors or resist the order.\nAn importer, Chief Onyebuchi Ikpa, said many of them took loans from banks, noting that the banks would not consider the sit-at-home days when computing days due for repayment.\nBut IPOB’s spokesman, Emmanuel Powerful said no price was too much for the Igbo to pay in securing their freedom and release of IPOB leader, Kanu."
  },
  {
    "headline": "Accolades as Elder Statesman, Ahmed Joda, Dies at 91 in Yola",
    "summarized_story": "He rose through the administrative cadre of the Northern regional government, and then the federal civil service, to retire as Permanent Secretary, Ministry of Industries.\nDuring the administration of the youthful General Yakubu Gowon, he was considered to be among a group known as Super Permanent Secretaries.\nHe later worked with the then Northern Broadcasting Corporation in Kaduna before joining the Northern Nigeria civil service as Chief Information Officer.\nJoda became a federal permanent secretary in 1967 in the Ministry of Information and subsequently moved to Lagos.\nIf every Nigerian have the attributes of Joda, Nigeria will have been better than what it is now."
  },
  {
    "headline": "President Hails ‘Robust Response’ to Insecurity By Military",
    "summarized_story": "The President said his government was focused on taking the country out of the security challenges.\nHe said: “We are making continuous efforts at consolidating the progress made in improving the enabling security environment for peace and development.\nAccording to him, some of the measures include disarmament, demobilisation and rehabilitation, deradicalisation programmes, political reconciliation measures and instruments of development intervention.\nThe course, which commenced in September 2020, had 22 participants from the Nigerian Army, 25, from Nigerian Navy and 11 from Nigerian Air Force.\nThere were 24 participants from Ministries, Departments and Agencies (MDAs), comprising six from Nigeria Police, three each from Department of State Service (DSS), National intelligence Agency (NIA) and Defence Intelligence Agency (DIA), among others."
  },
  {
    "headline": "FG May Be Liable for N25bn of N45bn Ruling against Shell in Ogoni",
    "summarized_story": "Shell only runs the operations of joint ventures (JVs) in Nigeria where the federal government is the holder of 55 per cent of the assets.\nJudgment first came in favour of the Ogoni community in 2010, courtesy of Justice Ibrahim Buba of the Lagos division of the Federal High Court.\nHowever, Mohammed ruled that the money should be paid through the counsel to the Ogoni community, Chief Lucius Nwosu (SAN).\nThe case was instituted in 2001 by 10 representatives of the Ejama Ebubu community against the oil company for the losses caused by the oil spills.\nShell is planning to sell off all its assets in the shallow waters and onshore, leaving only its offshore operations intact in Nigeria."
  },
  {
    "headline": "Marburg Virus Hits Guinea, NCDC Says Nigeria at Low Risk",
    "summarized_story": "Ihekweazu spoke following the reported outbreak of the virus in Guinea.\nAccording to the NCDC boss, the center is collaborating with sister West African health organisations and the Center for African Disease Control to extend needed support to combat the virus.\n“We are very aware and it tells us that we have to always be on our guard here.\nWe set up a risk analysis team yesterday, evaluated the risk for Nigeria.\n“What we did is to make sure that we have the facilities to detect this if there were to be a suspect case."
  },
  {
    "headline": "Buhari Returns to Abuja",
    "summarized_story": "* Inspects Guard of Honour at AirportBy Deji ElumoyePresident Muhammadu Buhari is back in Abuja, the nation’s capital, after a two-week visit to London, the United Kingdom.\nHis plane, Nigeria Air Force 1, touched down at the Presidential Wing of the Nnamdi Azikwe International Airport, Abuja at about 18.00 hours on Friday.\nOn arrival, President Buhari inspected a guard of honour mounted by officers and men of the Guards Brigade of the Nigerian Army before watching displays by cultural troops representing different Nigerian cultures.\nAccording to a police wireless message dispatched Thursday, all Sector Commanders and Divisional Police Officers at the Federal Capital Territory (FCT) Command were directed to mobilise adequately inward Abuja.\nThe message stated inter alia: “Mr President will be arriving Abuja from his trip outside the country tomorrow (Friday), the 12/08/2021 by 1700hrs."
  },
  {
    "headline": "Bobrisky Is Risky, Buhari Regime Warns Travellers, Tourists",
    "summarized_story": "The President Muhammadu regime has warned tourists and travellers to be wary of Nigerian crossdresser, Okuneye Idris Olarenwaju, aka Bobrisky.\nThe health hazard Bobrisky has is worse than Ebola Virus Disease; travellers and tourists should be careful wherever they notice the presence of Bobrisky, mostly as it affects sharing of public facilities.\nNow, Bobrisky will enter the same toilet with a woman and at the end the woman will contract some kind of diseases.\n“If Bobrisky is even using men’s toilet, we can understand.\nAs I speak, we got a report of how a woman was very upset with the Federal Airports Authority of Nigeria because on this day she saw Bobrisky using female toilet in Abuja airport."
  },
  {
    "headline": "Bobrisky Is Risky, Buhari Regime Warns Travellers, Tourists",
    "summarized_story": "The President Muhammadu regime has warned tourists and travellers to be wary of Nigerian crossdresser, Okuneye Idris Olarenwaju, aka Bobrisky.\nThe health hazard Bobrisky has is worse than Ebola Virus Disease; travellers and tourists should be careful wherever they notice the presence of Bobrisky, mostly as it affects sharing of public facilities.\nNow, Bobrisky will enter the same toilet with a woman and at the end the woman will contract some kind of diseases.\n“If Bobrisky is even using men’s toilet, we can understand.\nAs I speak, we got a report of how a woman was very upset with the Federal Airports Authority of Nigeria because on this day she saw Bobrisky using female toilet in Abuja airport."
  },
  {
    "headline": "REPORTER'S DIARY: 'Who Did You Come To See?' — A Visit To The 'Racist' Shi Shi Chinese Restaurant In Lagos",
    "summarized_story": "SaharaReporters visited Shi Shi Chinese restaurant on Thursday due to multiple allegations of racism towards Nigerian visitors to the restaurant, located at 21B, Emina Crescent, off Toyin Street, Ikeja, Lagos.\nOur ExperienceOn arriving Shi Shi, tucked away in a residential area in Ikeja, we approached the gate.\nThe security guard looked as if he was contemplating a response, but seemed to think twice about it and stepped back.\nThe team proceeded (we came disguised as a company of people who had come to hang out).\nShe beckoned to another lady (Chinese) and spoke something to her in their language, while motioning at us."
  },
  {
    "headline": "REPORTER'S DIARY: 'Who Did You Come To See?' — A Visit To The 'Racist' Shi Shi Chinese Restaurant In Lagos",
    "summarized_story": "SaharaReporters visited Shi Shi Chinese restaurant on Thursday due to multiple allegations of racism towards Nigerian visitors to the restaurant, located at 21B, Emina Crescent, off Toyin Street, Ikeja, Lagos.\nOur ExperienceOn arriving Shi Shi, tucked away in a residential area in Ikeja, we approached the gate.\nThe security guard looked as if he was contemplating a response, but seemed to think twice about it and stepped back.\nThe team proceeded (we came disguised as a company of people who had come to hang out).\nShe beckoned to another lady (Chinese) and spoke something to her in their language, while motioning at us."
  },
  {
    "headline": "REPORTER'S DIARY: 'Who Did You Come To See?' — A Visit To The 'Racist' Shi Shi Chinese Restaurant In Lagos",
    "summarized_story": "SaharaReporters visited Shi Shi Chinese restaurant on Thursday due to multiple allegations of racism towards Nigerian visitors to the restaurant, located at 21B, Emina Crescent, off Toyin Street, Ikeja, Lagos.\nOur ExperienceOn arriving Shi Shi, tucked away in a residential area in Ikeja, we approached the gate.\nThe security guard looked as if he was contemplating a response, but seemed to think twice about it and stepped back.\nThe team proceeded (we came disguised as a company of people who had come to hang out).\nShe beckoned to another lady (Chinese) and spoke something to her in their language, while motioning at us."
  },
  {
    "headline": "'He saved Nigeria from break-up' — Obasanjo mourns Ahmed Joda",
    "summarized_story": "Former President Olusegun Obasanjo says the late Ahmed Joda, an elder statesman and public administrator, saved the country from breaking up during the 1966 crisis.\nBorn in 1930, Joda attended Yola Elementary School and Yola Middle School before proceeding to Barewa College from 1945 to 1948.\nReacting to his death, Obasanjo, in a statement by Kehinde Akinyemi, special assistant on media, recalled how Joda and other permanent secretaries saved the country from breaking up during the 1966 coup.\nI know that if not for people like Joda and other Senior Permanent Secretaries after the first upheaval we would have had Nigeria broken into pieces.\nBut, it was Ahmed Joda and other Super Permanent Secretaries (senior civil servants) like Philip Asiodu, Liman Ciroma, Alison Ayida who prevailed not to have Nigeria broken up.”"
  },
  {
    "headline": "'He saved Nigeria from break-up' — Obasanjo mourns Ahmed Joda",
    "summarized_story": "Former President Olusegun Obasanjo says the late Ahmed Joda, an elder statesman and public administrator, saved the country from breaking up during the 1966 crisis.\nBorn in 1930, Joda attended Yola Elementary School and Yola Middle School before proceeding to Barewa College from 1945 to 1948.\nReacting to his death, Obasanjo, in a statement by Kehinde Akinyemi, special assistant on media, recalled how Joda and other permanent secretaries saved the country from breaking up during the 1966 coup.\nI know that if not for people like Joda and other Senior Permanent Secretaries after the first upheaval we would have had Nigeria broken into pieces.\nBut, it was Ahmed Joda and other Super Permanent Secretaries (senior civil servants) like Philip Asiodu, Liman Ciroma, Alison Ayida who prevailed not to have Nigeria broken up.”"
  },
  {
    "headline": "Shehu of Borno: It'll be difficult to accept repentant Boko Haram members in our communities",
    "summarized_story": "Traditional and religious leaders in Borno have said it will be difficult to reintegrate repentant Boko Haram members into their communities.\nAdvertisementThe leaders expressed fear over the de-radicalisation of repentant members of Boko Haram by the Nigerian Army under its Safe Corridor programme.\n“The Safe Corridor programme of the Army led to the de-radicalisation of repentant terrorists in Gombe state.\nAnd you people and the media expect us to forget and forgive the repentant terrorists?”AdvertisementOn August 12, about 1000 members of Boko Haram reportedly surrendered to troops in Konduga, Gwoza and Bama in Borno.\nThose who surrendered will go through the Safe Corridor programme which was launched in 2016 for the de-radicalisation, rehabilitation and re-integration (DRR) of ex-insurgents in the country."
  },
  {
    "headline": "Shehu of Borno: It'll be difficult to accept repentant Boko Haram members in our communities",
    "summarized_story": "Traditional and religious leaders in Borno have said it will be difficult to reintegrate repentant Boko Haram members into their communities.\nAdvertisementThe leaders expressed fear over the de-radicalisation of repentant members of Boko Haram by the Nigerian Army under its Safe Corridor programme.\n“The Safe Corridor programme of the Army led to the de-radicalisation of repentant terrorists in Gombe state.\nAnd you people and the media expect us to forget and forgive the repentant terrorists?”AdvertisementOn August 12, about 1000 members of Boko Haram reportedly surrendered to troops in Konduga, Gwoza and Bama in Borno.\nThose who surrendered will go through the Safe Corridor programme which was launched in 2016 for the de-radicalisation, rehabilitation and re-integration (DRR) of ex-insurgents in the country."
  },
  {
    "headline": "INSIGHT: How climate change fuels cholera outbreaks in Nigeria",
    "summarized_story": "The recent cholera outbreak in Nigeria has become dreadful with hundreds of people dying from it and thousands more coming down with the disease.\n“The two key ways in which climate change is having an impact in a range of different ecosystems and physical environments in Nigeria is through change in temperature and change in rainfall pattern, especially the latter which is change in rainfall pattern.\n“Climate change is a contributing factor, especially flooding.\nGoing by the recent climate change report by the Intergovernmental Panel on Climate Change (IPCC), — human activities have caused damages to the earth that will be irreversible over hundreds and thousands of years.\nThis means that climate change impacts like flooding which Nigeria currently experiences cannot easily be wished away soon but would most likely increase in the coming years."
  },
  {
    "headline": "Tech entrepreneur Rebecca Enonchong to appear in Cameroon court",
    "summarized_story": "Rebecca Enonchong, one of Africa’s most prominent tech entrepreneurs, is reportedly set to appear before a court in her home country, Cameroon, on Thursday after she was arrested on Tuesday, August 10.\nThis is according to Edith Kah Walla, the leader of the Cameroon People’s Party (CPP).\n— Kah Walla (@KahWalla) August 11, 2021Enonchong remains in police custody and has been scheduled to appear at the Bonanjo Court of First Instance, Douala, on Thursday morning.\nhttps://t.co/8FxfOLSxlq — Kah Walla (@KahWalla) August 11, 2021Who is Rebecca Enonchong?\nOutside of her work in tech, Enonchong has been an advocate for progressive policies and better governance in Cameroon."
  },
  {
    "headline": "Nigerian government to lift Twitter ban “in a matter of days or weeks”",
    "summarized_story": "The Nigeria Government has hinted on lifting the ban on twitter after a series of meetings and agreements with the company.\nMost importantly, the company has agreed to open an office in the country.\nThough there is still an ongoing deliberation on when that will be, twitter said the earliest it can make that happen will be in 2022.\nIt’s been a little over two months since the Nigerian government banned twitter over the “inappropriate presidential tweet” (according to twitter’s guide book) that was taken down by the social media company.\nGet the best African tech newsletters in your inboxThis is good news for millions of twitter users in the country who now rely on VPN to access the platform; both lifting of the ban and the prospect of having a Twitter office in the country."
  },
  {
    "headline": "Beyond funding, MAGIC Fund’s value-add helps early-stage founders scale",
    "summarized_story": "A fund by founders for foundersMAGIC Fund, launched in 2017, is an early-stage venture capital fund built by founders turned investors.\n“MAGIC is like a fund of micro funds built by founders,” Greenleaf told TechCabal in an interview.\nHelping founders on their journeyTwo, MAGIC believes that smaller funds run by founders perform best in early-stage investing.\nThis way, they help early-stage founders find product-market fit, fine-tune business models, and fundraising strategies for successful seed rounds.\nAccording to Greenleaf, the Fund’s partners offer mentoring, advice, and network connectivity to support investee-founders as they scale their businesses."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, What we’re discussing today: Yemi Keri and more women becoming angel investorsFundraising in Africa so..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Wellness: A day at the Dew centre in Lagos",
    "summarized_story": "Wellness has always been an important part of my work-life balance, so I was excited to discover wellness at the Dew Centre which is located on 31 Adebayo Doherty Streetin the upscale neighbourhood of Lekki Lagos.\nThe Dew Wellness CentreThe Dew Centre is the brainchild of notable interior designer and wellness advocate, Omon Anenih-Mordi and Africa’s first design consultancy, boutique hotel and wellness centre.\nThe Dew centre is the first of its kind in Africa, mixing elements of design, education and wellness.\nThe Dew Centre offers the possibility to become a plant mom or dad.\nWe left the DEW centre feeling excited, rejuvenated and relaxed."
  },
  {
    "headline": "Africa most vulnerable to climate change, yet can’t fund research",
    "summarized_story": "Time is running out to stop global warming from intensifying over the next 30 years, and Africa, which could suffer devastating impacts, lacks adequate data to monitor the trend and the ability to fund research to mitigate its impacts.\nIn a new report issued last Monday by the Intergovernmental Panel on Climate Change, a body…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigeria’s palm oil producers post highest profit in 6yrs",
    "summarized_story": "Nigeria’s palm oil producers posted their highest profit in six years in the first half of 2021 as the industry continues to reap the gains of a boom in local demand.\nOkomu Oil Palm Company and Presco PLC, the largest players in Nigeria’s oil palm space collectively recorded a revenue increase of 67 percent year on year in the first half of 2021, reaching N45.09 billion from N26.98 billion in 2020.\nInvestment bank, United Capital, in a recent report, gives an optimistic projection about the future of the Palm oil industry in Nigeria as the key player continues to invest aggressively in capacity expansion.\nThe major challenges affecting the palm oil industry include smuggling, outdated farming techniques, inadequate funding, substandard mills, and poor storage facilities resulting in post-harvest losses.\nNigeria is the largest consumer of palm oil in Africa, with demand predominantly propelled by household consumption as 90 percent of palm oil consumption comes from the food industry while the non-food industry accounts for 10 percent."
  },
  {
    "headline": "Foundation donates accident, emergency ward building to Edo central hospital – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestA non-governmental organisation, Mathew Okpebholor Foundation on Friday donated an accident emergency medical ward building/equipment to central hospital Uromi, Edo.\nSpeaking during the dedication ceremony, the founder of the foundation, Dr Mathew Okepebholor said the construction of the accident and emergency ward is to save lives.\nAccording to the founder, the project was 100 per cent funded by the organisation, adding the project cost N100 million.\n“So this touch me and I decided to take it upon myself to build, equip the ward to aid emergency cases in the hospital.\nThe Mathew Okpebholor Foundation is an independent, humanitarian health organistion who have been touching heart and saving lives in the last 25 years."
  },
  {
    "headline": "Edo govt to sanction developers converting residential premises to commercial use without permits – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has warned property developers against the practice of converting residential premises to commercial use without applying and obtaining the necessary Change of Use Permit from the Ministry of Physical and Urban Development.\nIn a statement, Secretary to the Edo State Government, Osarodion Ogie Esq., said the government will sanction property developers, who violate the state’s Extant Town Planning Laws and Regulations.\nHe said, “The Edo State Government has observed with dismay that some developers have continued the unwholesome practice of converting residential premises to commercial use without applying and obtaining the necessary Change of Use Permit from the Ministry of Physical Planning and Urban Development.”According to him, “Government strongly condemns this act of violation of the state’s Extant Town Planning Laws and Regulations and is poised to administer appropriate sanctions in accordance with the laws.\n“Consequently, all such developers are to discontinue such illegality and submit their applications for Change of Use to the Ministry for consideration and approval as deemed fit,” he added.\nOgie noted, “For the avoidance of doubt, developers who fail to comply with the laws will be visited with the attendant sanctions, including removal of such illegal structures and recovery of the cost of carrying out the action from them.”..."
  },
  {
    "headline": "Obaseki congratulates Odigie-Oyegun on 82nd birthday, hails contribution to devt of Edo, Nigeria – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has congratulated ex-governor of the state and former national chairman of the All Progressives Congress (APC), Chief John Odigie-Oyegun on his 82nd birthday, hailing his commitment to Nigeria’s unity and development.\nIn a statement, the governor extolled the virtues of the elder statesman, describing him as an “erudite politician, true democrat and administrator par excellence, whose exemplary leadership has positively impacted the nation’s political space.”Obaseki noted, “On behalf of the government and good people of Edo State, I congratulate you, Chief John Odigie-Oyegun, as you mark your 82nd birthday anniversary.\n“You have continued to lead an enviable life that is worthy of emulation, distinguishing yourself as a role model, true democrat and administrator par excellence.\n“From your early days in the federal public service, where you rose to the peak of your career as a permanent secretary, up to when you got elected as the governor of Edo State, you have carried on with your vision of engendering sustainable development.\n“I applaud your unalloyed dedication and commitment to the Nigerian project and pray that the Almighty God will grant you more years in good health and happiness.”..."
  },
  {
    "headline": "Edo readies to receive second batch of COVID-19 vaccines – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the state would, by weekend, receive its second batch of the coronavirus (COVID-19) vaccines, to protect the people against the deadly virus.\n“The Edo State COVID-19 response team has been reactivated; l am the chairman of the team and the deputy governor is the chairman of the Technical Committee.\nOko-Oboh noted: “We are receiving about 3.2 million doses of the COVID-19 vaccines, including Moderna, AstraZeneca, as well as Johnson and Johnson.\nIf you take AstraZeneca as the first dose, it must be AstraZeneca for the second dose and not Moderna.\nWe are expecting and encouraging everyone to come forward for the second dose of the AstraZeneca vaccine when it arrives.”..."
  },
  {
    "headline": "Masari fumes, threatens to sue Customs over killing of Katsina residents",
    "summarized_story": "ADVERTISEMENTGovernor Aminu Masari of Katsina State has condemned the recurring killings of innocent citizens through reckless driving by operatives of the Nigerian Customs Service (NCS) in the state.\nPREMIUM TIMES reported how at least six people were killed Monday when a customs vehicle rammed into road users in Jibia Local Government Area.\nWitnesses said the customs officials were chasing smugglers in the border community when the accident occurred.\nHowever, a customs spokesperson said the brake of the customs vehicle failed and they were not chasing smugglers.\nIn a Friday statement by his spokesperson, Abdu Labaran, Governor Masari said he would no longer condone such senseless killings."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Nigeria records 11 deaths, 636 cases of Covid-19",
    "summarized_story": "Nigeria, on Friday, recorded 11 more deaths from Covid-19 and 636 cases of the virus, with Lagos and Rivers states leading infection numbers.\nThe agency added that the country logged 636 additional infections on Friday, 117 fewer than the 753 cases recorded on Thursday.\nAccording to the NCDC, the additional 636 infections were confirmed in 16 states and the Federal Capital Territory (FCT).\nLagos State, the epicentre of the COVID-19 in Nigeria, recorded the lion share on Friday with 291 cases, followed by Rivers with 117 cases.\nThe FCT recorded 13 new cases; Oyo State 11; Edo 9; Osun 6; Bayelsa 5; Delta and Gombe 4 each; Abia and Plateau 3 each and Sokoto State 1."
  },
  {
    "headline": "CBN projects 13% inflation reduction by end of year if lock down doesn’t return",
    "summarized_story": "This was disclosed by Dr Hassan Mahmud, Director, Monetary Policy Department of the Central Bank of Nigeria (CBN) at the Mid-year Economic Review and Outlook 2021, organised by the CIBN Centre for Financial Studies, in collaboration with B. Adedipe Associates, on Friday in Lagos.\nAccording to him, “Also, if the CBN forecasts for GDP growth are sustained and there is improved vaccination and the health hazards and lockdowns are not resurfacing, we will see GDP getting close to three per cent by the end of 2021.\n“We will also see the inflation number coming down less than 13 per cent by the end of the year and further down to the NBS projection of single-digit by 2022 or the middle of 2022.\n“We will start seeing a downward trend in inflation numbers particularly, headline inflation,” he said.\nMahmud said sustained policies would also improve foreign exchange, insecurity and other factors required to return the economy towards positive trajectory by 2022, citing that food inflation would also drop substantially if the supply side of it is addressed"
  },
  {
    "headline": "Int’l Youth Day 2021: 9mobile restates support for youth, seeks more tech adoption",
    "summarized_story": "Nigeria’s telecommunications company, 9mobile has restated its support for youth entrepreneurship and innovation, urging Nigerian youth to take advantage of the incredible opportunities that technology offer to optimize their businesses and professional endeavors.\nThe telecom company stated this during a virtual session, titled “Driving Youth Innovation in Business through Technology”, organized by 9mobile to mark this year’s International Youth Day.\nDefining innovation, Tricia Biz noted that innovation doesn’t necessarily mean inventing something new or that has never been done before, but simply about improvement.\nYouths must therefore not hesitate to embrace innovative technology for their respective businesses to succeed,” Ado stated.\nThe international youth day is celebrated annually on 12th August to highlight youth-impacting issues to the international community and to celebrate the potentials of young people as active partners in the global society."
  },
  {
    "headline": "Glo-sponsored African Voices features Wildlife care, tourism",
    "summarized_story": "Preservation of wildlife and tourism is the focus of this week’s edition of African Voices Changemakers.\nGuests on the 30-minute programme are Miguel Gonçalves, a wildlife conservationist at the Maputo Special Reserve in Mozambique, and Bemugi Sochaka who is uplifting his Santa Maria community, also in Mozambique, through sustainable tourism development.\nHe is a recipient of the 2018 African Ranger Award – a prestigious accolade presented by Paradise Foundation International and Alibaba Foundation.\nOn the other hand, Sochaka is reputed as the country’s star of tourism who guides nature enthusiasts round major spots in Mozambique.\nAfrican Voices Changemakers airs on CNN Channel 401 on Saturday at 9.30a.m., with repeats on Sunday at 4.30a.m., 7.30a.m., 12.30p.m., 7.30p.m."
  },
  {
    "headline": "Imo: 5 Killed As Police Hunt For Suspects With Bullet Wound",
    "summarized_story": "Five persons including two policemen have been gunned down in an early Saturday morning attack on the Izombe Police Divisional headquarters in Oguta local government area of Imo State.\nThis is even as the police has appealed to Imo people and hospitals to immediately report anyone with gunshot wounds.\nWhile three gunmen were gunned down, the police command lost two men whose identities were yet to be identified.\nADVERTISEMENTPolice spokesman for Imo State, Michael Abattam, made the disclosure in a statement on Saturday.\nPolice formations in the state have recently come under serious attacks from persons termed unknown gunmen."
  },
  {
    "headline": "Imo: 5 Killed As Police Hunt For Suspects With Bullet Wound",
    "summarized_story": "Five persons including two policemen have been gunned down in an early Saturday morning attack on the Izombe Police Divisional headquarters in Oguta local government area of Imo State.\nThis is even as the police has appealed to Imo people and hospitals to immediately report anyone with gunshot wounds.\nWhile three gunmen were gunned down, the police command lost two men whose identities were yet to be identified.\nADVERTISEMENTPolice spokesman for Imo State, Michael Abattam, made the disclosure in a statement on Saturday.\nPolice formations in the state have recently come under serious attacks from persons termed unknown gunmen."
  },
  {
    "headline": "FMN Mourns Joda, Says He Was One Of Nigeria’s Great Titans Of Industry",
    "summarized_story": "The Late elder statesman Alhaji Ahmed Joda, CFR, OFR, CON who passed away on 13 August 2021, has been described by the chairman and management of Flour Mills of Nigeria Plc as one of the iconic titans of industry in Nigeria.\n“The Chairman, Board and Management of Flour Mills of Nigeria Plc (FMN) deeply grieve and sympathize with the family of the elder statesman, Alhaji Ahmed Joda, a great titan of industry on his passing.\nADVERTISEMENT“Many Nigerians in this generation and those to come would remain indebted to his remarkable legacy and stewardship.\nAlhaji Joda, a former vice Chairman, and member of the FMN board of directors (June 1978 – September 2012), was instrumental to the growth and success story of the FMN group, which has continued to contribute to the economic upliftment of our great country since the early 1960s.\nMay his soul rest in eternal peace.”"
  },
  {
    "headline": "FMN Mourns Joda, Says He Was One Of Nigeria’s Great Titans Of Industry",
    "summarized_story": "The Late elder statesman Alhaji Ahmed Joda, CFR, OFR, CON who passed away on 13 August 2021, has been described by the chairman and management of Flour Mills of Nigeria Plc as one of the iconic titans of industry in Nigeria.\n“The Chairman, Board and Management of Flour Mills of Nigeria Plc (FMN) deeply grieve and sympathize with the family of the elder statesman, Alhaji Ahmed Joda, a great titan of industry on his passing.\nADVERTISEMENT“Many Nigerians in this generation and those to come would remain indebted to his remarkable legacy and stewardship.\nAlhaji Joda, a former vice Chairman, and member of the FMN board of directors (June 1978 – September 2012), was instrumental to the growth and success story of the FMN group, which has continued to contribute to the economic upliftment of our great country since the early 1960s.\nMay his soul rest in eternal peace.”"
  },
  {
    "headline": "BREAKING: Abducted Niger APC Chairman Regains Freedom",
    "summarized_story": "The kidnapped zonal chairman of the All Progressives Congress (APC) for Niger North, Alh.\nAminu Musa Bobi, has been released by his abductors.\nHe was abducted last a week ago by suspected armed men on his way to his farm along Ukuru road in Bobi district area of Mariga local government area of Niger State.\nDetails of his release by the bandits terrorising state were sketchy as at the filing this report.\nADVERTISEMENTDetails Later…"
  },
  {
    "headline": "VIDEO: 10 NOLLYWOOD STARS WHO ARE THEATRE ARTS GRADUATES OF UNIPORT",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "VIDEO: 10 NOLLYWOOD STARS WHO ARE THEATRE ARTS GRADUATES OF UNIPORT",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "VIDEO: WHY I WANT TO PERFORM THIRD COSMETIC SURGERY ON MY BODY – TONTO DIKEH",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "VIDEO: WHY I WANT TO PERFORM THIRD COSMETIC SURGERY ON MY BODY – TONTO DIKEH",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "ICYMI: Buhari won't dare to support Tinubu or anyone before 2023",
    "summarized_story": "Femi Adesina, a presidential spokesperson, said it will be too risky for President Muhammadu Buhari to support Tinubu or any other person for Presidency before 2023.\nAdesina stated this on Friday during an interview with Channels Television while reacting to Buhari’s recent visit to Bola Tinubu.\nHe was the one who came out to say ‘no, don’t do it; don’t jump the gun’.\n“The president himself will dare not jump the gun in terms of supporting one candidate or the other.\nKnowing President Buhari, he will never jump the gun.”"
  },
  {
    "headline": "How we rescued APC chairman Bobi",
    "summarized_story": "The Police Command in Niger State, on Saturday, confirmed that it had rescued the abducted APC Zone C Chairman, Aminu Bobi, from his abductors.\nAbiodun said that the chairman was rescued on Friday at about 3:30 pm.\n), suspected armed men had attacked the victim and his driver, one Nasiru Bobi, on their way to their farm on Ukuru road in Bobi district area of Mariga LGA.\n“The driver was shot on the leg and abandoned by the assailants, while the chairman was abducted,” Abiodun said.\nHe said that the driver was later rescued and taken to the general hospital, Kontagora, where he received medical treatment."
  },
  {
    "headline": "Biafra: Ex-IPOB Deputy Leader Reveals Abomination Allegedly Committed By Nnamdi Kanu",
    "summarized_story": "Uche Mefor, a former deputy leader of the Indigenous People of Biafra, IPOB, has accused the group’s leader, Nnamdi Kanu, of “sacrilege and abomination.”According to Mefor, Igbo people were beheaded by the Kanu-led IPOB.\nHe alleged that the IPOB leader had purposefully spilled Igbo blood.\nThe spirit of the land, according to Mefor, will continue to work against Kanu until he atones for the abomination he committed.\nIn a post on his Facebook page, Mefor wrote: “The lies and the subsequent beheading of Igbos by IPOB Nnamdi Kanu is an abomination too many.\n“We don’t know Uche Mefor, it’s his personal opinion and we have nothing to say about that."
  },
  {
    "headline": "Aregbesola Supporters Attack Appeal Committee Members [Photos]",
    "summarized_story": "…Chase party members out of secretariatSupporters of former Osun Governor, Rauf Aregbesola, operating under the name, The Osun Progressives, TOP, on Saturday invaded the State Party Secretariat, in Osogbo and chased away the members of the Appeal Committee, who had arrived the state, yesterday.\nThe group had submitted its petitions to the party secretariat in Abuja, which were in turn delivered to the Appeal Committee for scrutiny.\nBut rather than allow the committee to do their job, TOP members, led by its Chairman, Elder Adelowo Adebiyi and Gbenga Akanwo, led armed thugs to the party secretariat, beating everyone in sight, especially those warring any cap or T-shirt that identify them with the Governor of the state."
  },
  {
    "headline": "BREAKING: Thugs Invade Osun APC Secretariat [Video]",
    "summarized_story": "Thugs wearing OYETOLA and 4+4 face caps invaded the Osun All Progressives Congress (APC) secretariat on Saturday morning, warning party members belonging to The Osun Progressives (TOP), a caucus inside the party, to leave.\nAt around 10:40 a.m., the thugs stormed the party secretariat and began calling out and identifying members of the caucus.\nThey were then attacked and hauled away from the party’s secretariat after being identified.\nThe thugs and their leader, Asiri Eniba, were confronted by party members who had come to present petitions and chased them out of the secretariat."
  },
  {
    "headline": "BREAKING: Five Killed As Hoodlums Attack Imo Police Station",
    "summarized_story": "On Saturday morning, hoodlums attacked the Izombe Police Divisional headquarters in the Oguta Local Government Area of Imo State, killing five people.\nWhile two officers on duty were killed, three intruders were also killed, according to reports.\nThe attackers, who planned to explode the station, engaged the officers in a duel that resulted in several lives being lost.\n“While others escaped into the bush with bullet wounds.\n“Also hospitals are advised to ensure that they report any person(s) who come to them for treatment of bullet wounds.”"
  },
  {
    "headline": "Submit to your husbands, questioning his position in the family is demonic – Mrs Oyedepo tells women",
    "summarized_story": "Winners’ Chapel has said any woman who questions the position of the man in the family is under demonic influence.\nShe said God expects that just as the Church is subject to Christ in everything, even so, women should be in subjection to their husbands in everything.\n“Any woman or women’s organization that attempts to question the position of the man in the family should be regarded as being under a demonic influence,” she said.\n“God expects that just as the Church is subject to Christ in everything, even so, women should be in subjection to their husbands in everything.\n“Once a woman lays hold on the key of reverence, she has succeeded in unlocking her husband’s heart."
  },
  {
    "headline": "Breaking: Arsenal succumb to Brentford defeat in Premier League opener",
    "summarized_story": "Brentford celebrated their return to the top tier after a 74-year absence with a memorable, magnificent victory over woeful Arsenal as they opened their Premier League campaign in style.\nArsenal, without strike pair Alexandre Lacazette and Pierre-Emerick Aubameyang through illness, paid the price for a hopeless attempt to defend substitute Mads Sorensen’s routine long throw.\nBrentford could not have made a better start to life in the Premier League, showing the pedigree that has made them such an entertaining side on their journey to this stage.\nOnce they realised Arsenal had little offer after the early exchanges, Brentford took charge and Bryan Mbeumo had already struck the post before Canos opened the scoring.\nNo-one can begrudge them their victory – and the manner in which they revelled in it."
  },
  {
    "headline": "Ex-super perm sec, Ahmed Joda, is dead",
    "summarized_story": "A former super permanent secretary and one of Nigeria’s elder statesmen, Ahmed Joda, is dead.\nConfirming the death, Mohammed Baba, a long time associate of Joda told our reporter that the elder statesman died Friday afternoon.\nAhmed Joda was born in Girei local government area of Adamawa State 91 years ago.\nAfter completing his secondary education in 1948, Ahmed Joda was admitted to Moor Plantation, Ibadan.\nIn 1967, he became a federal permanent secretary in the Ministry of Information and subsequently moved to Lagos."
  },
  {
    "headline": "NIG @60: ALGON President applauds initiative to foster economic growth -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "NHGSFP: Humanitarian Commenced the physical verification, capturing of Data of Primary School Pupils in Nasarawa -NigPilot",
    "summarized_story": "Minister of Humanitarian Affairs, Disaster Management and Social Development, Sadiya Umar Farouq has commenced the physical verification and capturing of 196,878 primary school pupils in Nasarawa state is ongoing National Home Grown School Feeding program NHGSFPIn a statement signed by Adeyemo Felicia, chief information officer to Deputy Director information to the Minister said.\nThey are: the Conditional Cash Transfer CCT, the N-Power, the National Home Home Grown School Feeding Programme NHGSFP and Government Entrepneure Progamme GEEP.\nNine 9 Million’s pupils are currently benefiting from one free nutritious meals a day during the school term nationwide.\nShe noted that the Ministry now has the mandate of reaching an additional 5 million pupils by 2023.\nYakubu Habiba, a Food Vendor at RCM primary school Eggon, expressed his gratitude to the Federal Government for engaging and empowering them."
  },
  {
    "headline": "Abducted Niger state Information Commissioner released -NigPilot",
    "summarized_story": "The Niger State Police Command has said the abducted Commissioner for Information, Mohammed Sani Idris, has regained freedom” The Niger state police command wishes to inform members of the public that the abducted Commissioner for information, Hon Mohammed Sani Idris has been released by his abductors and successfully rescued unhurt.”The state Police Public Relations Officer, PPRO, Wasiu Abiodun, DSP, said on 8/08/2021 at about 2345hrs, the said victim was abducted by unknown gunmen in his residence at Babban-Tunga village, Tafa LGA of the state.\nThe PPRO said on the receipt of the incident, the Command immediately mobilized a joint Police, military, and vigilante team to the area for a manhunt of the hoodlums with a view to rescue the victim and arrest the culprits.\n” However, as a result of sustained pressure and trailing of the hoodlums by the joint team, the victim was released by the abductors on 12/08/2021 at about 2130hrs and surfaced at Kofa Dam area of Tafa LGA.\nHe was later debriefed and immediately taken to a hospital for medical attention."
  },
  {
    "headline": "Photo Op of the Flag off of construction of access road and car park of the Kagini Train Station -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "The Devastating Flood That Left Taraba Residents Hopeless",
    "summarized_story": "“We just rushed out and left them there because I cannot predict what could happen.”Simon’s was just one among many families affected by the recent flooding in Taraba State.\nSome of us are still counting our losses till now.”Relocating To Higher GroundsParts of Taraba State – especially the river belt areas – are particularly prone to flooding.\nResidents of Jalingo – the state capital – were not left out of the tragedy.\nAccording to the Taraba State Governor, Darius Ishaku, the flooding is caused by people who have encroached on the river valleys in the state.\n“If we knew this would happen, we would not have settled here and I pray that Taraba State government and Nigerian Government will come to our aid.”"
  },
  {
    "headline": "Nigeria Records 636 New COVID-19 Cases, More Deaths",
    "summarized_story": "Nigeria on Friday confirmed 636 new cases of COVID-19 in various parts of the country, said the Federal Government agency responsible for the control of disease outbreaks.\nGiving an update on the outbreak of the disease in the country, the Nigeria Centre for Disease Control (NCDC) disclosed that 12 more fatalities were recorded yesterday.\nNo LockdownData from the NCDC revealed that as of Friday, Nigeria has confirmed a total of 181,297 cases from the 2,589,130 samples tested so far.\nOf the confirmed cases – in the 36 states of the Federation and the Federal Capital Territory (FCT), 166,709 people have been discharged and 2,211 deaths recorded.\nAs Nigeria’s confirmed cases continue to rise, authorities have expresses concerns and put measures in place to tackle the third wave of the pandemic."
  },
  {
    "headline": "President Buhari Returns From UK Trip",
    "summarized_story": "﻿President Muhammadu Buhari has arrived in the country after a two-week trip to the United Kingdom.\nThe President had travelled to attend the Global Partnership for Education (GPE) organised Global Education Summit (GES) before undergoing a scheduled medical check-up.\nIn the weeks President Buhari spent in the UK, he met and played host to various dignitaries including the UK Prime Minister, Boris Johnson, who gave an assurance that the UK is available to assist Nigeria in its war against terrorism.\nNwajiuba disclosed this on Tuesday when he made an appearance on Channels TV’s Politics Today.\nWhile in London, President Buhari also met with a chieftain of the All Progressives Congress (APC) Bola Tinubu, in the wake of the recent crisis rocking the party."
  },
  {
    "headline": "All Civil Servants Ought To Own A Home – Osinbajo",
    "summarized_story": "Prof Osinbajo reportedly made the comment on Thursday at the Presidential Villa when he received a brief on the Federal Civil Service Strategy & Implementation Plan 2021-2025, presented by the Head of the Civil Service of the Federation, Dr Folashade Yemi-Esan.\nThe meeting is a Presidential Level Briefing of the reform process of the Federal Civil Service which has been on since 2017.\nA civil servant ought to be able to own a home, and justify to his family the reason why he went for the job”.\nThe Head of the Civil Service of the Federation also presented a report on the implementation status of the Federal Civil Service Strategy Plan 2017-2021.\nThe Head of the Civil Service of the Federation said the current reform in the Federal Civil Service has enabled government to save huge sums through the verification of personnel payroll and digitization of some operations, among others."
  },
  {
    "headline": "Appeal Court Set To Rule On Cross River North Senatorial Seat Dispute",
    "summarized_story": "The Court of Appeal in Abuja is set to deliver a ruling on the Cross River North senatorial district by-election dispute between Senator Stephen Odey and Jarigbe Agom.\n[READ ALSO] 2023 Presidency: Why Buhari Cannot Support Anybody Now – AdesinaThrough his counsel, Senator Odey has asked the Appeal Court in Abuja to review and set aside the judgement of the Court of Appeal in Calabar, Cross River State made in favour of Jarigbe.\nBut Jarigbe’s counsel, Emmanuel Ukala, who cited Order 20 Rule 4 of the Procedural Rules of the appeal court argued that the court cannot sit over an appeal in its own judgment.\nIn the judgment delivered on July 30, the Calabar Division of the appeal court declared Jarigbe as the duly elected Senator for Cross River North Senatorial District.\nThe court had invalidated the Certificate of Return issued to Senator Odey by INEC and directed the electoral empire to withdraw it."
  },
  {
    "headline": "BREAKING: IPOB suspends sit-at-home order",
    "summarized_story": "The proscribed Indigenous People of Biafra(IPOB) has suspended the weekly sit-at-home exercise it commenced this week in the southeast.\nThe group said the suspension of the exercise is due to a direct order from Kanu to that effect.\nIt explained: “The leadership of the Indigenous People of Biafra (IPOB) understands the concern being expressed by the global IPOB family on the suspension of the weekly Sit-At-Home earlier announced by the IPOB Head of Directorate of State of the Indigenous people of Biafra.\n“The suspension of the sit-at-home by the IPOB Head of Directorate was as a result of a direct order from the leader of this great movement Onyendu Mazi Nnamdi Kanu.\nRecall that IPOB had declared a weekly sit-at-home exercise to protest the arrest and detention of its leader, Nnamdi Kanu by the Federal Government."
  },
  {
    "headline": "National Handball Championship: Team Sokoto Qualifies For Semi Final in All Categories",
    "summarized_story": "Team Sokoto have qualified for the semi final in all categories at the National Under 12/15 Handball Championship ongoing in Sokoto.\nThey defeated Plateau 21-2 and also defeated Kebbi 24-12.\nIn other results of the category, FCT defeated Kebbi 25-17 while Kaduna defeated Gboko 12-9.\nAbia defeated Suleja 17-7.\nAdvertisementIn Under 15 Boys Category, Adamawa defeated Suleja Shooters 26-15 while Kaduna defeated Katsina 22-11Under 12 Boys Category, Kaduna defeated Zamfara 19-11 while Sokoto defeated Gboko 19-13Other results of the match day five of the Championship are we follows."
  },
  {
    "headline": "NEMA inaugurates upgraded Call Centre for Inter-agency collaboration in managing disaster",
    "summarized_story": "The National Emergency Management Agency has commissioned the upgraded emergency response centre headquarters in Abuja.\nThe Centre is expected to complement inter-agency collaboration on disaster management across the country."
  },
  {
    "headline": "Grief Grips South African Town after Gruesome Vigilante Killings",
    "summarized_story": "According to official reports, groups of Indian residents in Phoenix and surrounding areas formed vigilante groups to protect their property.\nThe average monthly salary was 6,899 rand ($469) for Black South Africans, 14,235 rand ($967) for Asian South Africans, and 24,646 rand ($1,674) for white South Africans, according to a Statistics SA report released in February 2020.\nAccording to Shandu, the traumatic incidents of racial violence in Phoenix left many survivors facing destitution.\nIn addition to allegations over the police’s lax response, Mkhwebane accused the mainstream media of largely failing to cover the racial violence.\nWe want closure,” an impassioned Ngcobo told the almost 100 people in attendance."
  },
  {
    "headline": "Diplomats Hasten Exit from Afghanistan as Taliban Near Kabul",
    "summarized_story": "The first US troops are arriving in Afghanistan to help diplomatic staff and others leave, as many countries scramble to evacuate workers and citizens amid a rapid Taliban advance.\nOn Friday, militants captured Pul-e-Alam, capital of Loghar province, just 80km (50 miles) from the capital Kabul.\nThe Taliban advance comes as US and other foreign troops withdraw after 20 years of military operations.\nUS-led forces toppled the Taliban: In 2001 US-led forces overthrew Afghanistan’s Taliban rulers after the 9/11 attacks masterminded by al-Qaeda leader Osama bin Laden, who was based there.\nEventually the US made a deal with the Taliban: They would pull out if the militants agreed not to host terrorist groups."
  },
  {
    "headline": "Nigeria: NNPC May Be Liable for 55% of $110m Oil Spillage Ruling against Shell in Ogoni",
    "summarized_story": "Shell only runs the operations of joint ventures (JVs) in Nigeria where the federal government is the holder of 55 per cent of the assets.\nThe affected oil field has the government-owned Nigerian National Petroleum Corporation – NNPC owning (55 per cent share), SPDC (30 per cent), Total E&P Nigeria Ltd (10 per cent) and the Eni subsidiary Agip Oil Company Limited (five per cent), according to details on Shell’s website.\nJudgment first came in favour of the Ogoni community in 2010, courtesy of Justice Ibrahim Buba of the Lagos division of the Federal High Court.\nHowever, Mohammed ruled that the money should be paid through the counsel to the Ogoni community, Chief Lucius Nwosu (SAN).\nThe case was instituted in 2001 by 10 representatives of the Ejama Ebubu community against the oil company for the losses caused by the oil spills."
  },
  {
    "headline": "Buhari Returns to Nigeria After 18 Days in UK",
    "summarized_story": "Nigeria’s President Muhammadu Buhari is back in Abuja after his 18-day visit to London, United Kingdom.\nHis plane, Nigeria Air Force 1, touched down at the Presidential wing of the Nnamdi Azikwe International Airport, Abuja at about 18.00 hours on Friday.\nOn arrival, President Buhari inspected a guard of honour mounted by officers and men of the Guards Brigade of the Nigerian Army before watching displays by cultural troops representing different Nigerian cultures.\nThereafter, the President hopped into an helicopter which took him to the Presidential Villa, Abuja.\nBuhari left Nigeria for the United Kingdom on July 26 to participate in the Global Education Summit on Financing Global Partnership for Education (GPE) 2021-2025."
  },
  {
    "headline": "Nigeria: Accolades as Elder Statesman Ahmed Joda Dies at 91",
    "summarized_story": "Elder statesman and former federal “Super Permanent Secretary”, Ahmed Joda, died in Yola, Adamawa State in Northeast Nigeria on Friday at the age of 91.\nDuring the administration of the youthful General Yakubu Gowon, he was considered to be among a group known as Super Permanent Secretaries.\nHe later worked with the then Northern Broadcasting Corporation in Kaduna before joining the Northern Nigeria civil service as Chief Information Officer.\nJoda became a federal permanent secretary in 1967 in the Ministry of Information and subsequently moved to Lagos.\nIf every Nigerian have the attributes of Joda, Nigeria will have been better than what it is now."
  }
]