[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "My disagreement with Tinubu in 2007 was over Muslim-Muslim ticket, says Atiku",
    "summarized_story": "Tinubu and AtikuBy Miftaudeen RajiPresidential candidate under the platform of the Peoples Democratic Party, PDP, Abubakar Atiku has said his major disagreement with the presidential candidate of the ruling All Progressives, APC, Asiwaju Bola Tinubu in 2007 was over Muslim-Muslim ticket.\nAtiku said, “I have always opposed Muslim-Muslim ticket.\nThere should be balance.”Meanwhile, the PDP candidate has expressed confidence that he will defeat the APC candidate Tinubu in 2023.\nRecall that outcry has greeted the Muslim-Muslim ticket by the APC, which has been widely described as not truly reflective of the plurality of the Nigerian nation.\nThe Christian Association of Nigeria (CAN) and some APC youths have been critical of the APC Muslim-Muslim joint ticket."
  },
  {
    "headline": "PHOTOS: Ex-AGF, Idris Ahmed, others remanded in prison over alleged N109.4b fraud",
    "summarized_story": "A High Court of the Federal Capital Territory sitting at Maitama, on Friday, remanded the former Accountant-General of the Federation, Ahmed Idris, in prison custody, following his alleged complicity in the illegal diversion of public funds to the tune of about N109.4 billion.\nThe court held that Idris and other Defendants in the matter should remain in custody of the Nigerian Correctional Service till Wednesday when their bail applications will be heard.\nREAD FULL STORY"
  },
  {
    "headline": "Alleged N109bn Scam: Court remands ex-AGF, Idris Ahmed, others in prison",
    "summarized_story": "Adeyemi Ajayi remanded the ex-AGF, after he was arraigned on a 14-count charge that bordered on conspiracy, criminal breach of trust and money laundering.\nThe court held that Idris and other Defendants in the matter should remain in custody of the Nigerian Correctional Service till Wednesday when their bail applications will be heard.\nChris Uche, SAN, who appeared for the ex-AGF, assured the court that his client would be available to face the charge against him.\nLikewise, counsel to the 2nd and 3rd Defendants urged the court to accede to the request for bail.\nHowever, the Prosecution counsel, Mr. Rotimi Jacobs, SAN, told the court that he would need time to respond to the Defendants’ bail applications."
  },
  {
    "headline": "2023: Obasanjo doesn’t have better candidate to support than myself, says Atiku",
    "summarized_story": "By Miftaudeen RajiPresidential candidate of the People’s Democratic Party, PDP, Abubakar Atiku has said former President Olusegun does not have a better presidential candidate to support than himself.\nThe PDP candidate made this assertion while speaking in an interview with Arise TV on Friday.\nWhen asked if Atiku has or needs Obasanjo’s support, Atiku simply said, “Why will I not need his support?\nRecall that the presidential candidate of the Labour Party, Peter Obi had earlier visited the former president to seek his support and blessing ahead of the 2023 presidential election.\nAfter the unveiling of Okowa by Atiku, Wike had been speculated to be considering moving to the ruling All Progressives Congress, APC."
  },
  {
    "headline": "2023: Don’t expect any miracle from Peter Obi, Labour Party – Atiku",
    "summarized_story": "Mr Peter Obi and PDP Presidential candidate, AtikuBy Miftaudeen RajiPresidential candidate of the People’s Democratic Party, PDP, Abubakar Atiku has asked Nigerians not to expect a miracle to happen on the basis that Peter Obi joined the Labour Party to contest the presidency in 2023.\nAtiku, who spoke in an interview with Arise TV on Friday, said he does not expect the Labour Party to take a smash vote from the PDP as people are suggesting.\n“What is the performance of the Labour Party?\nSo, it is very very difficult to expect a miracle to happen simply because Peter Obi is in the Labour Party,” he said.\nBut how many people turned out to vote for the Labour Party,” he added."
  },
  {
    "headline": "2023: Obono-Obla calls for merger of LP, NNDP",
    "summarized_story": "Former presidential adviser, Barrister Okoi Obono-Obla has advocated for the merger of the Labour Party (LP) and the New Nigeria Democratic Party (NNDP) to enable them to shore up a formidable base to challenge the two big political parties, the All Progressives Congress (APC) and People Democratic Party (PDP).\n“They need to merge or align to be able to give PDP and APC a run.\nBut the merger or coalition is too late for them because the presidential election of 2023 is looming large,” he said.\nObono-Obla advised the two parties and smaller ones to learn from the CPC and ACN experience and begin to lay the foundation for the merger to fight the 2027 presidential election.\nHe added that the reality in Nigeria today is that “there are no political parties with the strength of the PDP and APC."
  },
  {
    "headline": "Awomama massacre should not be swept under the carpet – Catholic Bishop",
    "summarized_story": "Five days after the gruesome murder of some youths at Awomama in Imo State, the Metropolitan Archbishop of Owerri, Lucius Iwejuru Ugorii has cried out to the government not to allow the sad incident to be swept under the carpet.\nThe cleric, who described the development as barbaric, offensive, and totally unacceptable made this known in a statement he signed and made available to journalists on Friday in Owerri, Imo State capital.\nHe said, “As moral agents, no one should clearly aim at taking away human life no matter the circumstances.\nThe Awomama massacre should not be swept under the carpet.\nThat slaughter, no matter the reasons, is barbaric, offensive, and totally unacceptable.”The statement reads, “The gruesome murder of some youths at Awomama in Imo State a few days ago has caused public outrage."
  },
  {
    "headline": "Tinubu: Bishops at Shettima’s unveiling not fake – MURIC replies CAN",
    "summarized_story": "Muslim Rights Concern (MURIC) said clerics that attended the unveiling of Bola Tinubu’s running mate, Kashim Shettima are not fake.\nMURIC Director, Professor Ishaq Akintola issued a statement on Friday in reaction to the dissociation by the Christian Association of Nigeria (CAN).\nMURIC accused the Christian leadership of shying away from reality and living in self-denial.\nMURIC noted that CAN “is not to be trusted” for CAN disowning “but knowledgeable bishops and pastors”.\nUgo Ugokwe, an APC member and one of the clerics, responded to critics in a Facebook post on Wednesday."
  },
  {
    "headline": "Rivers: Amaechi, Cole will face trial – Wike",
    "summarized_story": "Governor Nyesom Wike of Rivers State has named the state’s former governor Chibuike Amaechi and the All Progressives Congress (APC) Rivers governorship candidate, Tonye Cole, as persons clearly identified to have allegedly looted the state.\nHe said that Amaechi and Cole would face trial even if the pair brought 500 Senior Advocates of Nigeria (SANs).\nWhat Rivers people will hear, Rivers people will be shocked to know what the former governor of the state and Minister did in this state with his partner, Tonye Cole,” Wike said.\n“If they (Ameachi and Cole) like, let them bring 500 Senior Advocates of Nigeria, they’ll face the trial.\n“The previous administration that had a lot of money, if they had done them, we would’ve concentrated on other things."
  },
  {
    "headline": "Osun: Oluwo dumps Oyetola, asks residents to support Adeleke",
    "summarized_story": "It appears the Oluwo of Iwo, Oba Abdulrosheed Adewale, has dumped the Governor of Osun State, Gboyega Oyetola, who lost his re-election bid in Saturday’s governorship poll.\nThis is as the Oba congratulated the governor-elect, Ademola Adeleke of the Peoples Democratic Party (PDP), asking people to cooperate with him.\n“I congratulate the Osun State Governor elect, Senator Ademola Adeleke on his victory at the keenly contested poll.\nThere is always reward for hardwork”“I look forward to having an Iwo man as the Osun State Governor if God permits!\nI pray for divine wisdom, courage and understanding for Senator Ademola Adeleke to effectively manage Osun State affairs,” the statement read."
  },
  {
    "headline": "Court refuses to move Orji Kalu’s trial to Lagos The Nation Newspaper",
    "summarized_story": "A Federal High Court in Abuja has refused the request for the transfer of the trial of former Abia Governor Senator Orji Kalu to the court’s Lagos division.\nThe Economic and Financial Crimes Commission (EFCC) had applied to the court that the N7.1billion money laundering charge against Kalu and two others be transferred to the Lagos division of the court in line with an earlier ruling of the Court of Appeal that Lagos was the proper forum for the trial of the case.\nJustice Ekwo held that the prosecution had twice written the Chief Judge, requesting for the transfer and which request the Chief Judge declined.\nThe Judge noted that granting the request to transfer the case to Lagos would breach the provision of Section 235 of the 1999 Constitution and amount to a challenge of the finality and supremacy of the Supreme Court of Nigeria.\nJustice Ekwo, who described the EFCC’s application as an abuse of court process, ordered the lawyer to the prosecution, Rotomi Jacobs to show cause within seven days why he should not be disqualified from further prosecuting the case."
  },
  {
    "headline": "Southeast youths reject Obi, back Tinubu",
    "summarized_story": "Youths from the Southeast geopolitical zone have declared support for the presidential candidate of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu and his running mate, Senator Kashim Shetima.\nThe youths specifically drew attention to the people-oriented policies and infrastructural transformation that defined the tenures of the APC’s presidential and vice presidential candidate in Lagos and Borno states respectively.\n“After due and extensive consultation, we have decided to endorse the presidential candidate of the APC, Senator Bola Ahmed Tinubu, and his running mate Alh Kashim Shettima, for the 2023 presidential election.\n“We totally reject the social media presidential candidate from our zone, H.E Peter Obi, because he is not prepared for the highest office of the land, and may just jeopardise our chances of Igbo Presidency.\n“Our position is informed by the fact that Obi does not have the national spread needed to win the Presidency of Nigeria."
  },
  {
    "headline": "Peter Obi’s Labour Party won’t go far in 2023",
    "summarized_story": "The presidential candidate of the People’s Democratic Party (PDP) has dismissed the chances of the Labour Party (LP) and its presidential candidate Peter Obi in 2023 polls.\nThe party and Obi, he said, won’t go far less alone to cause an upset as widely believed based on social media trends.\nAtiku, who spoke in an interview with Arise TV on Friday, assured the Labour Party cannot eat into the traditional PDP strongholds as suggested.\nHe said the just-concluded Osun governorship election has shown the Labour Party and Obi stand no chance at all in 2023.\nSo, it is very ,very difficult to expect a miracle to happen simply because Peter Obi is in the Labour Party."
  },
  {
    "headline": "FAO targets 296,800 persons in wet season farming The Nation Newspaper",
    "summarized_story": "UNITED NATIONS’ Food and Agriculture Organisation (FAO) has targeted 296, 800 vulnerable with seeds and fertilisers for 2022 rainy season farming in Adamawa, Borno, Sokoto, Taraba and Yobe States.\nCisse said provision of quality input would improve farmers’ productivity, contributing to enhancing resilience, food security and nutrition.\nHe said the input would help households mitigate rising food insecurity while building the resilience of host communities and returnees.\n“These challenges coupled with other effects of climate change have compounded the threat to food security in the country, this concern guided the inclusion of Sokoto and Taraba states in the 2022 rainy season intervention.\n“FAO, with support from donors since 2016, has been implementing extensive programmes targeting internally displaced persons (IDPs), returnees and their host communities in Borno, Adamawa and Yobe, most affected by prolonged conflict”."
  },
  {
    "headline": "Trial census under way in Oyo The Nation Newspaper",
    "summarized_story": "The Federal Commissioner, National Population Commission in Oyo State, Mr Eyitayo Oyetunji, has said that the enumeration of persons for the “Trial Census“ is underway in the state.\nOyetunji said that the trial census was s a major pre-census activity for the 2023 Population and Housing Census which was flagged-off two weeks ago.\nOyetunji said that actual enumeration of persons for the trial census is commencing nationwide fully in one LGA in six states.\n“A total of 90 enumerators and nine supervisors are involved in the actual enumeration exercise in Oyo State.\nHe said that the trial census was a full “dress rehearsal” of the main census."
  },
  {
    "headline": "Breaking; Gunmen Storm Niger Community, Kill five, Abduct 50 In Midnight Raid",
    "summarized_story": "From John Adams, MinnaGunmen, numbering about 100 on Thursday night, stormed Kuchi community in Munya local government area of Niger state and abducted about 50 people after killing five of the villagers.\nThe gunmen who invaded the community at about 1:00am went from one house to another, waking up their victims which include women and children before leading them into the bush through cattle roots.\n“As I speak to you they are now stranded at the river because they couldn’t cross.\nIt could be recalled that Kuchi, a railway town in Munya local government remained one of the most tormented communities in the area by gunmen, forcing the people to relocate.\nMeanwhile there is no statement from either the state government or the state police command on the latest attack as at the time of filing this reports."
  },
  {
    "headline": "Soludo signs revised budget of N170bn, borrows N100bn",
    "summarized_story": "Chukwuma Soludo of Anambra, has signed the revised budget of N170 billion into law.\nSoludo said that the budget christened; “Building off from the Blocks”, fell short of N250 billion, estimated as the amount required in building critical infrastructure in the state.\n`While commending the speedy passage of the budget, the governor called for stronger synergy between the legislature and other arms of government.\nThe governor said he obtained the approval to borrow N100 billion to boost available finances, for effective execution of the budget.\nThe governor thanked the people of the state for their support and sacrifices through payment of their taxes and other civic duties."
  },
  {
    "headline": "BREAKING: Atiku speaks on Wike, others",
    "summarized_story": "The Presidential Candidate of the People’s Democratic Party, PDP Alhaji Atiku Abubakar has criticised the attempt by the present government of President Muhammadu Buhari to force the RUGA policy sown the throat of Nigerians, saying RUGA is a state affairs.\nAtiku Abubakar, also spoke on his choice of Governor Ifeany Okowa over Nyesom Wike saying he did not pick Nyesom Wike, governor of Rivers, as his running mate because he wanted someone he could work with “amicably”.\n“In other words, the person must have the qualities to be President.\nAtiku Abubakar, said he did not pick Nyesom Wike, governor of Rivers, as his running mate because he wanted someone he could work with “amicably”.\nDetails soon…"
  },
  {
    "headline": "Terrorist attacks: FG mulls nationwide ban on motorcycles, mining",
    "summarized_story": "From Juliana Taiwo-Obalonye, Abuja and Chukwuma UmeorahThe National Security Council presided over by President Muhammadu Buhari has unveiled measures being considered to thwart terrorist activities, including a nationwide ban on motorcycles and mining to cut off their sources of funding.\nHe said the ban would include motorcycles used for movement and mining, which provides them the money to fund their arms supply.\n“Placing a ban on the use of motorcycles and mining activities will cut the supply of logistics to the terrorists.\nHe said motor vehicles cannot easily access most rural areas and a ban would only increase the untold hardship of Nigerians in those areas.\n“If we say there is a ban on motorcycles, how would people be travelling ,especially in rural areas and remote communities?” he queried."
  },
  {
    "headline": "FG records N3trn deficit in 4 months",
    "summarized_story": "From Uche Usim and Isaac Anumihe, AbujaNigeria recorded a N3.09 trillion deficit in its 2022 budget operations between January and April.\nAccording to the Minister, the deficit brought to the fore the lingering fiscal challenges facing the government.\n72 trillion, N1.94 trillion was spent on debt service; N1.26 trillion on personnel cost, including pensions; and N773.63 billion on capital expenditure”.\nShe added, “Actual average crude oil price is higher than the budget benchmark price of $73 per barrel.\nHowever, higher oil price is offset by lower oil output, which as of April 2022 stood at an average of 1.32 mbpd.”"
  },
  {
    "headline": "Group of Professionals Target 5m Votes for Atiku – THISDAYLIVE",
    "summarized_story": "Adibe Emenyonu in Benin CityThe National Coordinator of Nigerian Professionals for Atiku/Okowa 2023, Dr. Folus Ekele, yesterday said that the group is mandated to garner five million votes in the 2023 presidential elections for ex-Vice President Atiku Abubakar.\nThe group also described Abubakar as the fit and proper person to succeed President Muhammadu Buhari in 2023.\n“I was commissioned as a consultant medical doctor to talk to professionals and our plan is to get five million votes for Atiku come 2023 election.\nLook at the classification of all the major contenders, Atiku, Obi and Tinubu.\n“People talk about Atiku being corrupt but people forget that Atiku doesn’t have any single corruption case in court today."
  },
  {
    "headline": "Detention: Court Orders DSS, Perm Sec to Pay N3m Damages to Teenager on Trial – THISDAYLIVE",
    "summarized_story": "The girl (name withheld) had through her counsel, Andrew Arthur, sued the retired permanent secretary and the Department of State Security (DSS) for her arrest and detention for 13 days without trial.\nThe decision of the court stated that the retired Permanent Secretary, Dr. Walto Liverpool, would pay N1 million, while the DSS would pay additional N 2 million to the teenager as damages.\nHe, therefore, ruled that using multiple security agencies to detain the teenager amounted to intimidation and high-handedness which breached her fundamental human rights.\nThe teenager allegedly shot the video after ‘sexual intercourse’ with the retired permanent secretary in a hotel in Yenagoa in August 2021.\nThe trial of the teenager is currently ongoing, while the DSS has headed to the Court of Appeal in Port Harcourt to challenge the decision of the Bayelsa State High Court on the fundamental human rights enforcement of the teenager."
  },
  {
    "headline": "Tenant Kills Landlord over Rent Dispute in Abuja – THISDAYLIVE",
    "summarized_story": "Olawale Ajimotokan in AbujaA middle-age man, Muhammed Mukailu, is presently on the run after he was alleged to have killed his landlord over a rent dispute.\nA neighbour confirmed the incident yesterday.\nHe said trouble started the fateful day when Mukailu allegedly smashed a plank on the head of his landlord following a row over outstanding rent.\nNeighbours, who were alerted to the scene, rushed the landlord to the hospital where doctors battled unsuccessfully to revive him while on admission.\nIt was gathered that the landlord was said to have accused the tenant of insulting him over the unpaid rent, which escalated into an argument that degenerated into a fight."
  },
  {
    "headline": "Ebonyi Guber: Odii Remains PDP Candidate, Says Group – THISDAYLIVE",
    "summarized_story": "Benjamin Nworie in AbakalikiA group, Anyichuks Grassroots Organisation of the governorship candidate of the Peoples Democratic Party (PDP) in Ebonyi State, Mr. Ifeanyi Odii, has reiterated that Odii remains the gubernatorial candidate of the party in the state.\nIt is equally important we make it abundantly clear that Dr. Ifeanyi Chukwuma Odii remains the authentic gubernatorial candidate of the PDP in Ebonyi State.\nThis is contrary to the fake news being spread by mischief makers and hired foot-soldiers of falsehood and deceit.\nThe Appeal Court remitted the appeal filed by Sen. Obinna Ogba to the Chief Judge of the Federal High Court to re-assign the matter to another Judge of the Federal High Court for re-trial.”He added: “On the other hand, the Federal High Court in Abakaliki passed another judgement on a related issue.\n“The court upheld the authentic PDP primaries conducted on May 28 and 29, 2022, which produced Dr. Ifeanyi Chukwuma Odi and other candidates elected during the primaries."
  },
  {
    "headline": "Nigeria Shippers Council Launches Operational Manual for Inland Dry Port – THISDAYLIVE",
    "summarized_story": "Ibrahim Shuaibu in KanoThe Nigerian Shippers Council (NSC) has launched its operational manual for inland dry ports to promote efficient transportation, enhance efficiency at the ports and engender trade facilitation.\nSpeaking at the official launch in Kano yesterday, the Executive Secretary/CEO of the council, Emmanuel L. Jime, said the manual was produced to articulate the step-by-step procedures for receiving, storing, handling and delivery of cargoes as well as highlighting the operations, the responsibilities of agencies and timelines for discharging such tasks.\nRepresented by Phillip Eduwa, the council director of Inland Transport, Jime noted that while the manual is based on the international best practices, it has been adapted to local context, and since each dry port would have its own specialties, organisational implementation, lay-out constraints and services offered, aspects of it that relates to these will be amended in a case-by-case basis.\nOn his part, the Minister of Transportation, Muazu Jaji Sambo, who was represented by a Deputy Director in the ministry, Ewache Victor, harped on the significance of the manual, and urged all stakeholders in the sector to ensure full implementation of the operational manual as a workable policy document that will drive the operations of the inland dry ports in Nigeria.\nAlso, the Kano State Governor, Abdullahi Umar Ganduje, who was represented by the Commissioner for Commerce, Ibrahim Mukhtar, expressed optimism that when the Dala Dry Inland Port in Kano is inaugurated later this year, it will bring more employment opportunities not only to the Kano people but also to the people across the country, especially the northern states and boost the internally generated revenue of the state."
  },
  {
    "headline": "EXCLUSIVE: How Lower Niger River Basin Development Authority Spent N100M On Kwara Lawmaker, Alajagusi's Failed Water Projects",
    "summarized_story": "For her water needs, the nursing mother had relied on a neighbour who had a borehole in her community.\nGaa-Lamba is one of the communities that benefited from the Zonal Intervention Borehole Water Project facilitated by an honourable member of the Federal House of Representatives, representing Asa/Ilorin West Federal Constituency, Abdulyekeen Alajagusi.\nOn-site fact-findingTo monitor the projects, SaharaReporters embarked on site verification of these borehole projects supervised by the Lower Niger River Basin Development Authority (LNRBDA) at Alapa/Onire Odegiwa Ward.\n\"All this would have stopped if the borehole installed for us was working well,\" Balikisu added.\nAlso, Micheal Jacobs Consulting Limited, the company that handled the project, did not return several calls, text messages, and Whatsapp messages sent to them, asking for their comment on the dam project."
  },
  {
    "headline": "EXCLUSIVE: How Lower Niger River Basin Development Authority Spent N100M On Kwara Lawmaker, Alajagusi's Failed Water Projects",
    "summarized_story": "For her water needs, the nursing mother had relied on a neighbour who had a borehole in her community.\nGaa-Lamba is one of the communities that benefited from the Zonal Intervention Borehole Water Project facilitated by an honourable member of the Federal House of Representatives, representing Asa/Ilorin West Federal Constituency, Abdulyekeen Alajagusi.\nOn-site fact-findingTo monitor the projects, SaharaReporters embarked on site verification of these borehole projects supervised by the Lower Niger River Basin Development Authority (LNRBDA) at Alapa/Onire Odegiwa Ward.\n\"All this would have stopped if the borehole installed for us was working well,\" Balikisu added.\nAlso, Micheal Jacobs Consulting Limited, the company that handled the project, did not return several calls, text messages, and Whatsapp messages sent to them, asking for their comment on the dam project."
  },
  {
    "headline": "PHOTOS: Safe With Foreign Currencies, Posh Vehicles Recovered From Ex-Army Chief, Buratai",
    "summarized_story": "SaharaReporters has exclusively obtained photographs of things including posh vehicles recovered by the Independent Corrupt Practices and Other Related Offences Commission (ICPC) from the house of a former Chief of Army Staff, Lt Gen Tukur Buratai (retd.\nThey include pictures of the safe where foreign currencies were recovered, Mercedes Benz 2022, Bulletproof G Wagon (voice customized), recovered from him valued at N150 million and BMW also recovered from him during the execution of a search warrant.\nSaharaReporters on Friday reported that the ICPC confirmed the recovery of cash, vehicles and other items from a military contractor fronting for Buratai.\nOthers were former Chief of Defence Staff, Gabriel Olonishakin; Chief of Air Staff, Abubakar Sadique and Chief of Naval Staff, Ibok Ibas.\nOn August 17, 2015, the Chief of Army Staff paid the sum of N3,270,000 into the account."
  },
  {
    "headline": "PHOTOS: Safe With Foreign Currencies, Posh Vehicles Recovered From Ex-Army Chief, Buratai",
    "summarized_story": "SaharaReporters has exclusively obtained photographs of things including posh vehicles recovered by the Independent Corrupt Practices and Other Related Offences Commission (ICPC) from the house of a former Chief of Army Staff, Lt Gen Tukur Buratai (retd.\nThey include pictures of the safe where foreign currencies were recovered, Mercedes Benz 2022, Bulletproof G Wagon (voice customized), recovered from him valued at N150 million and BMW also recovered from him during the execution of a search warrant.\nSaharaReporters on Friday reported that the ICPC confirmed the recovery of cash, vehicles and other items from a military contractor fronting for Buratai.\nOthers were former Chief of Defence Staff, Gabriel Olonishakin; Chief of Air Staff, Abubakar Sadique and Chief of Naval Staff, Ibok Ibas.\nOn August 17, 2015, the Chief of Army Staff paid the sum of N3,270,000 into the account."
  },
  {
    "headline": "How Suspended Accountant-General, Ahmed Idris Got N15billion bribe To Manipulate Payment To Oil-Producing States – Anti-graft Agency, EFCC",
    "summarized_story": "The suspended Accountant-General of the Federation (AGF), Ahmed Idris, received N15 billion bribe to fast track 13% derivation funds to oil-producing states, according to the Economic and Financial Crimes Commission (EFCC).\nThe 13% derivation fund is a benefit-sharing system that helps communities get funds meant for development.\nReports show that the nine oil-producing states in Nigeria shared N450.60 billion from the federation account through the 13 percent derivation formula in 2021.\nAccording to the EFCC, Idris accepted from Olusegun Akindele, a gratification in the aggregate sum of N15,136,221,921.46 for accelerating the payment of 13% derivation to the states.\nAkindele was a Technical Assistant to the Accountant General of the Federation between February and November 2021."
  },
  {
    "headline": "Muslim-Muslim ticket: Tinubu wanted to be my running mate in 2007 but I disagreed, says Atiku",
    "summarized_story": "Atiku Abubakar says a Muslim-Muslim presidential ticket is the bane of his “fundamental disagreement” with Bola Tinubu, candidate of the All Progressives Congress (APC), since 2007.\nTinubu had picked Kashim Shettima, former governor of Borno, as his running mate for the APC presidential ticket.\nReacting to Tinubu’s choice of a Muslim running mate, Atiku said it was why he “departed politically” from the former Lagos governor.\nAdvertisementHe claimed that Tinubu had wanted to be his running mate for the AC presidential ticket, and he refused.\n“Tinubu wanted to be my running mate when I was given the ACN presidential ticket in 2007, but I disagreed."
  },
  {
    "headline": "Muslim-Muslim ticket: Tinubu wanted to be my running mate in 2007 but I disagreed, says Atiku",
    "summarized_story": "Atiku Abubakar says a Muslim-Muslim presidential ticket is the bane of his “fundamental disagreement” with Bola Tinubu, candidate of the All Progressives Congress (APC), since 2007.\nTinubu had picked Kashim Shettima, former governor of Borno, as his running mate for the APC presidential ticket.\nReacting to Tinubu’s choice of a Muslim running mate, Atiku said it was why he “departed politically” from the former Lagos governor.\nAdvertisementHe claimed that Tinubu had wanted to be his running mate for the AC presidential ticket, and he refused.\n“Tinubu wanted to be my running mate when I was given the ACN presidential ticket in 2007, but I disagreed."
  },
  {
    "headline": "EFCC arraigns Ahmed Idris, suspended accountant-general, over ‘N109bn fraud’",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arrived at a federal capital territory (FCT) high court with Ahmed Idris, suspended accountant-general of the federation.\nIn May, TheCable had reported how Idris was arrested in Kano after he failed to respond to invitations by the commission to answer questions over the allegation of N80 billion fraud.\nTwo days later, Idris was suspended indefinitely “without pay” by Zainab Ahmed, the minister of finance, budget and national planning.\nIdris was arraigned alongside Godfrey Olusegun Akindele and Mohammed Kudu Usman, and a firm — Gezawa Commodity Market and Exchange Limited.\nAdvertisementThe EFCC said Idris and his co-defendants are indicted on a 14-count charge of stealing and criminal breach of trust to the tune of N109.5 billion."
  },
  {
    "headline": "EFCC arraigns Ahmed Idris, suspended accountant-general, over ‘N109bn fraud’",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arrived at a federal capital territory (FCT) high court with Ahmed Idris, suspended accountant-general of the federation.\nIn May, TheCable had reported how Idris was arrested in Kano after he failed to respond to invitations by the commission to answer questions over the allegation of N80 billion fraud.\nTwo days later, Idris was suspended indefinitely “without pay” by Zainab Ahmed, the minister of finance, budget and national planning.\nIdris was arraigned alongside Godfrey Olusegun Akindele and Mohammed Kudu Usman, and a firm — Gezawa Commodity Market and Exchange Limited.\nAdvertisementThe EFCC said Idris and his co-defendants are indicted on a 14-count charge of stealing and criminal breach of trust to the tune of N109.5 billion."
  },
  {
    "headline": "Atiku: LP can't win presidential election — 90% of northerners not on social media",
    "summarized_story": "Atiku Abubakar, presidential candidate of the Peoples Democratic Party (PDP), says he is not expecting the Labour Party (LP) to pull off a surprise to win the 2023 presidential election.\n“So, it is very difficult to expect a miracle to happen, simply because Peter Obi is in the Labour Party.\nAfter all, they were saying through social media, they had more than one million votes in Osun state,” he said.\nAnd then again, mark you, you’re talking about social media.\nIn the north, 90 percent of our people are not tuned to social media.”"
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "Netflix loses 970,000 subscribers in Q2",
    "summarized_story": "Yesterday, global streaming service Netflix announced via its Q2 2022 financial results that it lost 970,000 subscribers in the second quarter of the year.\nAccording to Netflix, over 100 million of its 222 million paying subscribers are sharing their passwords with people outside of their households.\nNetflix, however, still has the biggest share of the streaming service market with 220 million subscribers while Amazon’s Prime Video holds 200 million, while Disney+ and HBO Max hold 87.6 million and 74 million subscribers respectively.\n1 million subscribers in Q3The service also plans to keep its top spot and add 1 million subscribers to its tally by Q3.\nWhile its total number of subscribers might have declined by 970,000, its year-on-year revenue, however, increased by 9% in Q2 2022."
  },
  {
    "headline": "Hannah Subayi believes the gap between Anglophone and Francophone African startups is reducing",
    "summarized_story": "As you know anglophone Africa tends to be a bit more advanced than Arab-speaking and francophone Africa.\nHowever, we cannot deny that the operational environment remains a bit tougher to some extent in francophone Africa.\nWe see more anglophone African investors trying to invest in francophone Africa.\nHS: Historically, francophone Africa, just by virtue of the language, mainly only looked to France for funding and expansion.\nIf you look at francophone African startups, they are incorporated in Paris but that’s not any different from other startups that are incorporated in Delaware."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "How to navigate delivery apps and traditional logistics companies in Lagos and Kaduna",
    "summarized_story": "This time, we’ll be talking to three business owners about their experiences with delivery and logistics in the bustling city of Lagos and the ancient Kaduna town.\nKachiThey eventually did the delivery, but that was it for me; I just went back to my individual rider companies.\nBut…I think logistics companies that focus on other forms of logistics have no business with the food business because, first off, the margins are very low.\nAt first, I was using all these normal bike logistics companies for deliveries within Kaduna.\nDelivery within Kaduna used to cost ₦500 ($1), but the people using cars were charging ₦1,000 ($2) or ₦1,500 ($3)."
  },
  {
    "headline": "Jollof leaves bitter taste as prices surge 22%",
    "summarized_story": "Nigerians are now adopting survival strategies as the cost of preparing a pot of Jollof rice – a popular Nigerian delicacy has increased by 22.2 percent in one year, the latest Jollof Index report shows.\nPrices of seasoning, curry, pepper, vegetable oil, turkey and onions increased in most markets,” the report stated.\nThe commodities that makes-up the index are rice, groundnut oil, chicken or turkey, beef, seasoning, pepper, tomatoes, salt and onions.\nAccording to the National Bureau of Statistics, food inflation (prices), rose year-on-year by 20.6 percent in June 2022, the highest in 11 months, when compared to 19.5 percent in the previous month.\nTo combat the rising food prices, the report recommends that it is important that the federal government tackles insecurity while also boosting domestic food production."
  },
  {
    "headline": "Five things to know to start your Friday",
    "summarized_story": "Five things to know to start your FridayBiden tests positive for Covid-19Karine Jean-Pierre, the White House Press Secretary said in a statement that the US President Joe Biden has tested positive for Covid-19.\nThis comes despite the 79-year-old president being fully vaccinated against the virus, having received two Covid booster shots.\nJean-Pierre said that the President was experiencing “very mild symptoms.” The president had previously tested negative on Tuesday.\nThe Peoples Democratic Party (PDP) had earlier asked the court to stop Obi from replacing Okupe as his running mate.\nThe objection by Obi to the PDP’s prayers is based on the fact that the PDP’s suit is speculative, conjectural in nature, and devoid of hard facts."
  },
  {
    "headline": "Obaseki and Senate Bill to allow States Generate, distribute Electricity – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestIn June 2017, Governor Godwin Obaseki announced to the world that in six month’s time, his administration would provide uninterrupted power supply to Bénin City and environs.\nThe senate has passed the electricity bill 2022 that would allow states to generate and distribute power as well as solve the sector’s challenges.\nAccording to the lawmaker, the piece of legislation will reinvigorate the institutional framework for the reform of the Nigerian Electricity Supply Industry (NESI) initiated and implemented by the federal government.\nI have instructed the Attorney General of Edo State to file charges of criminal negligence against the senior management of BEDC,” Obaseki said.\nToday, Ossiomo power is providing affordable, secure and reliable electricity by attracting investors with low risk, stable returns."
  },
  {
    "headline": "Ezechi Urged Beneku Youths To Stand Firm In PDP – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAsaba – Youths of Beneku community, in Ndokwa East local government area of Delta state, have been urged to stand firm in their support for the Peoples Democratic Party, PDP.\nThe PDP candidate for the 2023 Ndokwa/Ukwuani Federal Constituency House of Representatives election, Hon Nnamdi Ezechi, made the call when a delegation of Beneku Concerned Youths paid him a solidarity visit in Asaba.\nThe PDP House of Reps candidate enjoined the Beneku Concerned Youths to remain united and focused on achieving the set objectives of the group, adding that the members must remain peaceful and law abiding in their conducts and activities.\nSpeaking on behalf of the group, the Public Relations Officer, Comrade Azubuike Ojonoku, said the visit was to congratulate Hon Ezechi on his victory in the House of Representatives primary election.\nComrade Ojonoku assured Hon Ezechi of the support of the group for him and other PDP candidates, from the presidential to the House of Assembly elections."
  },
  {
    "headline": "Judges’ salary: Obaseki sets up c’ttee to review fiscal implication of Industrial Court judgement – Nigerian Observer",
    "summarized_story": "The governor said this during a meeting with the Chief Judge of Edo State, Justice Joe Acha, at the Government House in Benin City, the state capital.\nOne of the issues we have come to talk about is the implication of the recent Industrial Court judgement on the remuneration of judges.\nJust like His Excellency has said, Edo State is one family.\n“In Edo State, we are one family.\nMuch as there are issues with staff salaries in other states, we believe that Edo State can be a model.”Share this: TweetWhatsAppEmailPrint..."
  },
  {
    "headline": "Benin artefacts: Edo unveils EMOWAA Phase I, as Obaseki says no conflict between govt, palace – Nigerian Observer",
    "summarized_story": "Obaseki made the clarification while addressing participants at a stakeholders’ engagement and unveiling of phase one of the Edo Museum of West African Art (EMOWAA), in Benin City, the Edo State capital.\nAs a people, we have a lot of assets from our past and it’s our responsibility to recreate them.\nIt is about using that as the contact point to bring out the best of who we are.\n“That is why we must insist that when these works come, we host them here in Edo State, their home, so that it’s available for everybody to see.\nHe added: “The invasion of 1897 shocked our system and it’s taking us almost 100 years to recover from that shock."
  },
  {
    "headline": "Reps okay bill seeking to make UTME results valid for four years",
    "summarized_story": "Nigeria’s house of representatives has approved the extension of the lifespan of the Joint Admission and Matriculation Board’s Unified Tertiary Matriculation Examination (UTME) result from one year to four years.\nThe result’s validity extension was proposed in JAMB Act Amendment Bill which passed second reading at the House on Thursday.\nSponsored by a member of the House from Oyo State, Tolulope Akande-Sadipe, the legislation is titled, ‘A Bill for an Act to Amend the Joint Admission and Matriculation Board (Establishment, Etc.)\nAct, 2021, and Other Related Matters.’According to Akande-Sadipe, the amendment is meant to overhaul the existing Act, most especially the validity of scores, tenure of the registrar and membership of the board, among others.\nThe bill specifically seeks to amend Sections 5(1)(a) and 5(2) of the principal Act."
  },
  {
    "headline": "PDP’s victory in Osun, others proof of my commitment to credible election – Buhari",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari, has said the outcome of recent elections in Anambra, Ekiti and Osun states are proof of his administration’s commitment to free and fair elections in Nigeria.\nRecall that in November last year, Prof Charles Soludo won the Anambra governorship election under the All Progressives Grand Alliance (APGA).\nIn June, Biodun Oyebanji of the APC won the Ekiti State governorship election, while Ademola Adeleke of the PDP defeated incumbent governor, Gboyega Oyetola in the Osun governorship election held on Saturday, July 16th.\n“This is also why I made sure I signed the new Electoral Act.\nI am very pleased with what we have accomplished so far.”"
  },
  {
    "headline": "15 APC Chieftains Dump Party in Kaduna",
    "summarized_story": "Not less than 15 chieftains of the All Progressives Congress, APC, in Kaduna State, on Thursday, dumped the party, citing a lack of internal democracy.\nThe latest party chieftains, who left the party on Thursday, July 21, 2022 were: Mallam Audu Bode, Alh.\nHabila Latu, Boniface Ubandoma, Mr. Yakubu Simon, Jashua Peter, Camio Bitrus, Patrick Paul (Pato), Mr. Samuel Wyah, Zaka Makoshi, Jonathan Fedelix, Barnabas Samuel (Barry), Shua’ibu Yusuf, Alexander Danladi (Lulu), Samuel Ibrahim.\nIbrahim Samuel, in a letter addressed to his Ward Chairman, said, “His decision to dump the party was based on the internal crises of the party.\n“Another reason was that the State House of Assembly party primaries has come and gone but certainly not without some avoidable challenges."
  },
  {
    "headline": "Court sends ex-AGF, Ahmed Idris, others to Kuje prison over alleged N109bn scam",
    "summarized_story": "The court held that Idris and other Defendants in the matter should remain in custody of the Nigerian Correctional Service till Wednesday when their bail applications will be heard.\nOther Defendants in the matter are: Godfrey Olusegun Akindele, Mohammed Kudu Usman and Gezawa Commodity Market and Exchange Limited.\nChris Uche, SAN, who appeared for the ex-AGF, assured the court that his client would be available to face the charge against him.\nLikewise, counsel to the 2nd and 3rd Defendants urged the court to accede to the request for bail.\nHowever, the Prosecution counsel, Mr. Rotimi Jacobs, SAN, told the court that he would need time to respond to the Defendants’ bail applications."
  },
  {
    "headline": "It would take a miracle for Peter Obi to win power in 2023 – Atiku Abubakar",
    "summarized_story": "Going by history, I picked an Igbo as running mate in 2007, in 2019.\nI still picked an Igbo as running mate for 2023,” Atiku said.\nPeople should be fair to me and state the facts.”On the possibility of resolving issues with Wike, Atiku said the party was talking to Wike.\nOn Peter Obi, the presidential candidate of the Labour Party, Atiku said Obi did not consult him before joining Labour, but only informed him after he had declared for the party.\nAsked whether he misses the former Anambra State governor, Atiku signed and said, “Unfortunately he did not consult me.”The former vice president, however, noted that it would difficult for Obi to win power under Labour Party."
  },
  {
    "headline": "I Disagreed With Tinubu Over Muslim-Muslim Ticket In 2007 – Atiku",
    "summarized_story": "Former Vice President and presidential candidate of the Peoples Democratic Party (PDP), Abubakar Atiku, has said that his major fallout with the All Progressives Congress (APC) presidential candidate, Asiwaju Bola Ahmed Tinubu, was because he wanted to be his running mate in the 2007 presidential election.\nSpeaking on Friday on the Arise News TV, Atiku said the Muslim-Muslim ticket by the APC was “unwelcoming and unripe for Nigeria as a democratic state.”“Asiwaju planned to be my running mate in 2007 but I disagreed.\n“Nigeria is a multi-ethnic and multi- religious nation and there should be a religious balance in our leadership,” Atiku said.\nThe PDP presidential candidate expressed confidence that he will defeat the APC presidential candidate in the 2023 presidential election.\nHe also dismissed the insinuation that the emergence of Senator Kashim Shettima as Tinubu’s running mate will reduce his chances in the North-East region come 2023."
  },
  {
    "headline": "I Disagreed With Tinubu Over Muslim-Muslim Ticket In 2007 – Atiku",
    "summarized_story": "Former Vice President and presidential candidate of the Peoples Democratic Party (PDP), Abubakar Atiku, has said that his major fallout with the All Progressives Congress (APC) presidential candidate, Asiwaju Bola Ahmed Tinubu, was because he wanted to be his running mate in the 2007 presidential election.\nSpeaking on Friday on the Arise News TV, Atiku said the Muslim-Muslim ticket by the APC was “unwelcoming and unripe for Nigeria as a democratic state.”“Asiwaju planned to be my running mate in 2007 but I disagreed.\n“Nigeria is a multi-ethnic and multi- religious nation and there should be a religious balance in our leadership,” Atiku said.\nThe PDP presidential candidate expressed confidence that he will defeat the APC presidential candidate in the 2023 presidential election.\nHe also dismissed the insinuation that the emergence of Senator Kashim Shettima as Tinubu’s running mate will reduce his chances in the North-East region come 2023."
  },
  {
    "headline": "2023: Why I Picked Okowa Over Wike, Atiku Reacts To PDP Crisis",
    "summarized_story": "The presidential candidate of the Peoples Democratic Party (PDP), Alhaji Atiku Abubakar, said that he chose Governor Ifeanyi Okowa of Delta State as his running mate for the 2023 elections, over Rivers State governor, Nyesom Wike, because of his desire to unite Nigeria.\nI was given a ticket in 2007, I picked an Igbo.\nI was given a ticket in 2019, I picked an Igbo.\nAtiku, a former vice president, noted that his choice of Okowa was not a rejection of Wike.\nHe added that, “Governor Wike is a brilliant politician."
  },
  {
    "headline": "2023: Why I Picked Okowa Over Wike, Atiku Reacts To PDP Crisis",
    "summarized_story": "The presidential candidate of the Peoples Democratic Party (PDP), Alhaji Atiku Abubakar, said that he chose Governor Ifeanyi Okowa of Delta State as his running mate for the 2023 elections, over Rivers State governor, Nyesom Wike, because of his desire to unite Nigeria.\nI was given a ticket in 2007, I picked an Igbo.\nI was given a ticket in 2019, I picked an Igbo.\nAtiku, a former vice president, noted that his choice of Okowa was not a rejection of Wike.\nHe added that, “Governor Wike is a brilliant politician."
  },
  {
    "headline": "8 Local Airlines Now Operating As NCAA Suspends Dana Air",
    "summarized_story": "Number of commercial airlines operating in the nation’s aviation sector have shrunk to eight from 10 in the last one week after the NIgerian Civil Aviation Authority (NCAA), shut down the operations of Dana Air Indefinitely for audit amid financial struggles and recurrent flight incidents.\nFollowing the suspension, the airline, on yesterday, said customers who sought refund of their ticket fare should contact the airline for refund.\nHowever, with Aero Contractors, temporarily shut down and Dana Air shut indefinitely by NCAA, airlines presently operating in Nigeria includes, Air Peace airline; Arik Air; Azman Air; Green Africa; Ibom Air; Max Air; Overland and United Nigeria Airlines.\nMusa Nuhu, had on Wednesday Night, announced the suspension of Dana Airlines’ Air Transport Licence (ATL) and Air Operator Certificate (AOC) indefinitely, with effect from midnight of Wednesday, 20th July, 2022.\nThe statement read, “our operations have been suspended as advised by the NCAA in order to undergo a full operational audit with effect from midnight 20th July, 2022."
  },
  {
    "headline": "I did not reject Wike, I picked who can deliver – Atiku – P.M. News",
    "summarized_story": "“In these consultations, I made clear that my running mate would have the potential to succeed me at a moment’s notice, that is, a president-in-waiting.\nOrtom said it was surprising that Atiku could jettison the recommendation of 14 out of 17 members of the committee that recommended Wike as his running mate.\n14 out of 17 members say that Wike should be the VP but in his wisdom, he chose Governor Okowa.\nGovernor Okowa is a nice man and my friend and I have no problem with him.\nPeople should be fair to me and state the facts.”On the possibility of reconciliation with Wike, Atiku confirmed that talks were ongoing with the Rivers governor."
  },
  {
    "headline": "Afenifere gets new leadership in Ondo – P.M. News",
    "summarized_story": "The Ondo State chapter of the pan-Yoruba socio-cultural organization, Afenifere, has picked a former Commissioner for Education in the state, Chief Korede Duyile, as its chairman.\nA statement by the Publicity Secretary, Mr Remi Olayiwola, on Friday in Akure, said new executives had been constituted for the chapter.\n“Consequent upon the decision of the Ondo State Chairman of Afenifere, Basorun Seinde Arogbofa, to step aside as chairman, the leadership of the Yoruba socio-cultural organization has constituted a new state executive committee for the group.\nAccording to the statement, Chief Bayo Fajemilua, a former chairman of Akure North Local Government, emerges as the Deputy Chairman.\nDuyile thanked the leadership of Afenifere that deemed him fit for the post and promised to carry on the excellent job of his predecessor."
  },
  {
    "headline": "2023: Atiku Speaks On Obasanjo Supporting Him For President",
    "summarized_story": "2023: Atiku Speaks On Obasanjo Supporting Him For PresidentAtiku Abubakar, the Peoples Democratic Party’s (PDP) nominee for president in 2023, has stated that he thinks former President Olusegun Obasanjo will back his bid.\nThis was stated by Atiku in a Friday interview with Arise Tv.\nIf his old boss, Obasanjo, supports him, the former vice president was questioned.\nHe responded, ”I have been talking to Olusegun Obasanjo, I assume I have his support, I don’t think he has a better partner to support than myself because I have his legacies to continue.”Atiku also said the Labour Party (LP) presidential candidate, Peter Obi has no political structure that can guarantee him victory.\nHe said Obi is expecting miracles and such miracles are difficult to come by."
  },
  {
    "headline": "BREAKING: EFCC Brings Suspended Accountant-general To Court Over ‘N109bn Fraud’",
    "summarized_story": "Ahmed Idris, the temporarily suspended accountant-general of the federation, has appeared in a federal capital territory high court with the Economic and Financial Crimes Commission (EFCC).\nTheCable had reported in May that Idris had been detained in Kano after declining the commission’s invitations to provide answers about the alleged N80 billion scam.\nIdris was placed on indefinite “pay suspension” by Zainab Ahmed, the minister of finance, budget, and national planning, two days later.\nIdris will likely be charged alongside Godfrey Olusegun Akindele, Mohammed Kudu Usman, and a company named Gezawa Commodity Market and Exchange Limited.\nThe EFCC said Idris and his co-defendants are indicted on a 14-count charge of stealing and criminal breach of trust to the tune of N109.5 billion."
  },
  {
    "headline": "2023: Kwara APC aspirant, Ola-Peters dies in his sleep",
    "summarized_story": "An aspirant of the All Progressives Congress, APC, for the Kwara State House of Assembly, Share/Oke-Ode Constituency, Chief Oladipupo Ola-Peters is dead.\nOla-Peters, who was until his death, a chieftain of the APC from Ilere district of Ifelodun Local Government Area of Kwara State, reportedly died in his sleep on Thursday morning in Lagos.\nDAILY POST recalls that Ola-Peters was one of the aggrieved aspirants for the botched House of Assembly party primary which was crisis ridden.\nA condolence message in Ilorin on Thursday, by the spokesman of Governor Abdulrahman Abdulrazaq, Rafiu Ajakaye, described the death of Ola-Peters as shocking and devastating.\nHe commiserated with the Idera Community in Ifelodun Local Government Area of the state and the APC family on the death of the prominent chieftain of the party in the state."
  },
  {
    "headline": "Tears As Family, Loved Ones Bury Cairo-based Nigerian Burnt To Death By Wife Over Alleged Infidelity",
    "summarized_story": "Tears As Family, Loved Ones Bury Cairo-based Nigerian Burnt To Death By Wife Over Alleged InfidelityA man in Osun State, Bolu Bamidele, who died after he was allegedly set ablaze by his wife, Ifeoluwa, over allegations of having an extramarital affair has been buried.\nBamidele, popularly known as Teebam, was said to have returned to Osogbo, the capital of Osun State from Cairo, Egypt, to give his wife a nice treat on her birthday.\nThe wife, according to findings, discovered that Bamidele had cheated on her and even had a child outside their union.\nThe deceased was buried amid tears on Wednesday in Osogbo in the presence of family and loved ones.\nThe spokesperson for the state police command, SP Yemisi Opalola, said the police had declared Ifeoluwa Bamidele wanted."
  },
  {
    "headline": "How Muslim-Muslim ticket tore Tinubu, I apart in 2007 – Atiku",
    "summarized_story": "Presidential candidate under the platform of the Peoples Democratic Party (PDP), Abubakar Atiku, has described the Muslim-Muslim ticket by the ruling All Progressive Congress (APC), as “unwelcoming and unripe for Nigeria as a democratic state”.\nAtiku made this known, Friday, during an interview with Arise TV.\nWhen asked to comment on the Muslim-Muslim ticket, the former VP said, “My fundamental disagreement with Tinubu in 2007 was as a result of Muslim-Muslim ticket.\n“I have always opposed Muslim-Muslim ticket.\nAtiku also vowed to defeat the APC flag-bearer Bola Tinubu come 2023 while kicking against the idea of the emergence of Kashim Shettima reducing his chances in the North East."
  },
  {
    "headline": "How Muslim-Muslim ticket tore Tinubu, I apart in 2007 – Atiku",
    "summarized_story": "Presidential candidate under the platform of the Peoples Democratic Party (PDP), Abubakar Atiku, has described the Muslim-Muslim ticket by the ruling All Progressive Congress (APC), as “unwelcoming and unripe for Nigeria as a democratic state”.\nAtiku made this known, Friday, during an interview with Arise TV.\nWhen asked to comment on the Muslim-Muslim ticket, the former VP said, “My fundamental disagreement with Tinubu in 2007 was as a result of Muslim-Muslim ticket.\n“I have always opposed Muslim-Muslim ticket.\nAtiku also vowed to defeat the APC flag-bearer Bola Tinubu come 2023 while kicking against the idea of the emergence of Kashim Shettima reducing his chances in the North East."
  },
  {
    "headline": "Oshoala, Mane, full list of winners from #CAFAwards2022",
    "summarized_story": "Asisat Oshoala and Sadio Mane both won the biggest awards at the 2022 edition of the annual Confederation of African Football awards held in Rabat, Morocco on Thursday night.\nBelow are the big winners from the continental football award.\nSadio Mane: Senegalese player and new Bayern signee won the African Player of the Year (Men) award for the second consecutive year.\nAsisat Oshoala: Nigeria’s Super Falcons player made history when she won the award on Thursday.\nShe is the only African to have won the Best Player award for five times."
  },
  {
    "headline": "Debt servicing surpasses revenue by N310bn as FG releases 4-month fiscal report",
    "summarized_story": "Cost of servicing debt surpassed the federal government’s retained revenue by N310 billion in the first four months of 2022.\nThe federal government said this in its 2022 fiscal performance report for four months released on Thursday.\nAccording to the report, the federal government’s total revenue for the period was N1.63 trillion, while debt service gulped N1.94 trillion.\n“The aggregate expenditure for 2022 is estimated at N17.32 trillion, with a prorata spending target of N5.77 at end of April,” the report reads.\nOf this amount, N1.94 trillion was for debt service, and N1.26 trillion was for personnel costs, including pensions."
  },
  {
    "headline": "CBN governor commissions N600m UNILORIN poultry farm",
    "summarized_story": "By Kayode AbdulazeezGovernor of the Central Bank of Nigeria, CBN, Godwin Emefiele on Thursday commissioned a 600 million naira poultry farm project at the University of Ilorin, Kwara State.\nTo close this gap, the Central Bank of Nigeria has introduced various Intervention Schemes focused on boosting poultry production, creating decent jobs, and fostering innovation in the poultry sub-sector.\nOne of such schemes is the Tertiary Institutions Poultry Revival Scheme that was conceptualised specifically for Tertiary Institutions to design and implement viable poultry projects.\n“Today we witness the commissioning of the first project to be funded and completed through the Scheme.\nThe SPV is Unilorin Bizface synergy Limited, a limited liability company registered with the Corporate Affairs Commission."
  },
  {
    "headline": "Bayelsa Govt Clears Air On State Of Its Airport",
    "summarized_story": "… Says Bayelsa Airport Is Not DowngradedBy Eunice Nnachi, YenagoaThe Bayelsa State Government has made a clarification that the state-owned international airport had not been downgraded, as being insinuated in some quarters.\nThe Deputy Governor, Senator Lawrence Ewhrudjakpo, gave the clarification on Wednesday when the Federated Correspondents Chapel of the Nigeria Union of Journalists, Bayelsa State Council, paid him a courtesy call in Government House, Yenagoa.\nAccording to the Deputy Governor, the D-Check is a major maintenance check to determine the air-worthiness of an aircraft after it had made commercial flights for a period of 10 years.\nI know that you are going to ask us what is happening to the Bayelsa International Airport.\nThe Bayelsa Airport has not been downgraded."
  },
  {
    "headline": "IYC leadership enroll 301 youths in ICT scheme",
    "summarized_story": "By Eunice Nnachi, YenagoaThe Ijaw Youths worldwide, the Ijaw Youths Council (IYC) on Tuesday marked its second year in office, with the enrollment of 301 youths from ijaw communities into Information and communications technology (ICT) scheme.\nThe First batch of benefiting 60 youths are expected to be trained in Computer programming, coding and appreciation and handed starter packs at the end of the training scheme.\nIn his speech, the initiator of the ICT Scheme and National Spokesman of the Ijaw Youths Council (IYC), Comrade Ebilade Ekerefe, said the scheme was initiated to change the narrative of the ijaw youths worldwide rather than adopting repeated combatant approach which has yielded less results.\nYou know a lot of people misunderstand the Ijaw youths Council.\nThe Ijaw youths Council itself was founded to propel economic development of the Ijaw nation, which meant that we need to educate our people”."
  },
  {
    "headline": "NDDC launches talent hunt in Niger Delta to address youth unemployment",
    "summarized_story": "By Eunice Nnachi, YenagoaThe Niger Delta Development Commission, (NDDC) has launched a novel Niger Delta Talent Hunt (NIDETH) to harness creativity among youths in the entertainment industry and address unemployment in the Niger Delta region.\nDr. Akwa commended President Muhammadu Buhari and the Minister of Niger Delta Affairs, Mr. Umana Okon Umana, for supporting activities aimed at harnessing the creative potential of youths in the Niger Delta.\nUdengs Eradiri, described the Niger Delta youths as enterprising, observing that artistes from the region had challenges of getting support and platforms to express themselves.\n“The Niger Delta youths need to be a part of these opportunities.\nHe said that 80 per cent of the entertainment industry was rooted in the Niger Delta."
  },
  {
    "headline": "Alleged Fraud: Court Orders Remand Of Ex-Accountant General Idris In Kuje Prison",
    "summarized_story": "A Federal High Court in Abuja has ordered that a former Accountant General of the Federation, Ahmed Idris, and three other defendants be remanded in the Kuje Correctional Facility.\nAlleged N109bn Fraud: EFCC Arraigns Ex-Accountant General IdrisEFCC Arrests Accountant-General Over N80bn FraudCounsel to Mr Idris, Chris Uche prayed the court to allow the defendant to continue enjoying the administrative bail granted to him by the antigraft agency.\nThe lawyer asked the court to permit the defendants to come back on Monday and not remand them at any correctional facility.\nInterjecting, Idris’ counsel pleaded with the court that due to the porous security nature of the Kuje correctional facility, his client should be remanded in the EFCC custody.\nJustice Ajayi however, repeatedly ordered the Senior Advocate to sit down, stressing that nobody can overturn her orders before her."
  },
  {
    "headline": "Security Council Considers Nationwide Ban On Motorcycles, Mining Activities",
    "summarized_story": "﻿ ﻿The National Security Council on Thursday announced that it is considering a nationwide ban on motorcycles and mining activities in the country as part of its strategy to curb terrorist activities, checkmate loopholes and cut off their sources of funding.\nThis was the outcome of the meeting presided over by President Muhammadu Buhari at the State House in Abuja.\nAddressing state house correspondents after the meeting chaired by the President, the Attorney General of the Federation and Minister of Justice, Abubakar Malami stated that investigations are still ongoing especially to establish the correlation between mining and motorcycles which they suspect provide funding for the supply of arms to the terrorists.\nTerrorist groups, in particular in Nigeria, are increasingly interested in controlling areas of production of goldThe opportunistic nature of these activities ties strongly to the fact that gold is often the favoured mineral of the terrorist groups as many of these groups use this to secure a source of funding for future operations.\nSee more photos from the meeting below:"
  },
  {
    "headline": "ASUU Strike: Our Right To Protest Is Lawful, NLC President Tackles Lai Mohammed",
    "summarized_story": "NLC President, Ayuba Wabba in a statement on Wednesday, said “it is elementary knowledge, that the right to peaceful assembly and protest is fundamental global right guaranteed by the UN charter on Human and Peoples’s right and the constitution of the federal republic of Nigeria”.\nWabba’s comment was in reply to a statement by the Minister of Labour and Employment, Lai Mohammed, suggesting that a proposed NLC protest in solidarity with ASUU is illegal.\nReacting further, Wabba said the proposed march is not a solidarity protest, adding that the NLC is directly involved in the current dispute in the nation’s university system.\nHe emphasized that all peaceful assembly are lawful and does not require any permission under the law.\nAccording to him, in a democratic society such statement as was uttered by the minister is not consistent with the rule of law."
  },
  {
    "headline": "Party Disqualification: Peter Obi Asks Court To Dismiss PDP’s Suit",
    "summarized_story": "The Presidential candidate of the Labour Party, Peter Obi, is asking a Federal High Court in Abuja to dismiss a suit seeking his disqualification for nominating his campaign manager, Doyin Okupe, as his placeholder.\nLast week, the Peoples Democratic Party had asked the court to bar Obi from replacing Okupe as his running mate.\nIn the suit, the PDP also asked the court to disqualify both Obi and Tinubu if they replace Okupe and Masari as their running mates.\n— PDP’s suit —The PDP had sued INEC, APC, Tinubu, Masari, Labour Party, Obi and Okupe last week over the use of placeholders and choice of running mate.\nThe party asked the court to rule that both Tinubu and Obi will be disqualified the moment they substitute the names of their running mates."
  },
  {
    "headline": "Mali Army Thwarts Terrorist Attack At Key Garrison Town",
    "summarized_story": "The Malian army said it had thwarted a “terrorist” attack on Friday at a town on the outskirts of the capital where a key base used by the ruling military is located.\nArmed forces “vigorously repelled” a dawn attack at the garrison town of Kati in which assailants used two explosives-laden vehicles, the army said on Facebook.\n“The situation is under control and operations are underway to flush out those behind (the attack) and their accomplices,” it said.\nThe French embassy sent text messages to French nationals saying, “attack underway at Kati” and urging caution.\nA spat with France has triggered a pullout of French forces that have been fighting jihadists in Mali for nearly a decade."
  },
  {
    "headline": "𝗔𝗸𝗶𝗻𝗹𝗮𝗱𝗲, 𝗖𝗵𝗶𝗲𝗳 𝗗𝗮𝗱𝗮 𝗺𝗲𝗲𝘁 𝗢𝗴𝘂𝗻 𝗪𝗲𝘀𝘁 𝗣𝗗𝗣 l𝗲𝗮𝗱𝗲𝗿𝘀",
    "summarized_story": "The Deputy Governorship Candidate of the People’s Democratic Party, Adekunle Akinlade on Tuesday met with the leadership of the party in Ogun West, at the private residence of Chief Alani Akinde, in Ota.\nThis is in line with the spirited campaign for the restoration of a people-centered government and adequate security in Ogun State."
  },
  {
    "headline": "APC to unveil Shettima as Tinubu's running mate on Wednesday -",
    "summarized_story": "The All Progressives Congress (APC) will formally unveil its Vice Presidential Candidate, Senator Kashim Shettima, to the Nigerian public on Wednesday, 20th July.\nThe event which will start at 11am prompt will hold at the Shehu Musa Yar’Adua Centre, Abuja.\nAdvertisementIn a statement signed by the party’s Organising secretary, Sulaiman Muhammad Argungu, all members of the National Executive Committee (NEC), members of the Progressives Governors’ Forum, members of APC Caucus in the National Assembly, members of the Federal Executive Council (FEC) are to attend.\nOther are members of the Diplomatic Corps, Presidential Aspirants at the June 2022 Special National Convention, APC State Chairmen, APC State Secretaries and APC State Organising Secretaries.\nAdvertisementAdvertisement"
  },
  {
    "headline": "Oyebanji seeks Ekiti stakeholders' cooperation as he begins thank you tour of LGAs -",
    "summarized_story": "Ekiti State Governor-elect, Biodun Abayomi Oyebanji, has said he would run an inclusive government and give equal opportunity to all Ekiti indigenes, regardless of political leanings and background.\nOyebanji stated this on Monday during his ‘thank you tour’ in Ikole, Oye and Ilejemeje local government areas, where he met traditional rulers, party leaders and other stakeholders and shared some of his plans and programmes for the state.\nIn particular, I appreciate our traditional rulers for their support and prayers.\nAdvertisementAdvertisement“To our party members and other people of Ekiti State, I thank you because you are truthful to yourselves, God and the generation yet unborn.\nThe Governor-elect called on party members to be magnanimous in victory by reaching out to aggrieved members and intending members and integrating them into the progressive fold."
  },
  {
    "headline": "Ekiti APC, Governor-elect begin thank you tour, road show",
    "summarized_story": "Ekiti State Governor- elect, Biodun Abayomi Oyebanji and the deputy governor- elect, Monisade Afuye on Monday (today) July 18, commenced a ‘thank you tour’ to all the 16 local government areas of the state to express their gratitude to the people of the State for their support in the June 18 governorship election.\nThe tour kicked off from Ikole local Government on Monday by 10am.\nAdvertisementAdvertisementThe second phase of the tour would involve visitation to ethnic groups, trade unions and community leaders.\nRecall that the Governor-Elect had visited prominent Ekiti leaders and stakeholders within and outside the state shortly after his election.\nAdvertisementOyebanji said the consultation would continue till his inauguration, adding that regular consultation with stakeholders and leaders will be a major feature of his administration’s Public engagement policy."
  },
  {
    "headline": "Nigeria Urges Labour Unions to Shelve Protest and Stop Supporting Labour Party",
    "summarized_story": "It also urged the organised labour not to mobilise support for Labour Party as it would amount to a violation of the Trade Union Act.\nFurthermore, Ngige told NLC not go ahead with plans to campaign for the Labour Party in the 2023 General election.\n“I heard when you said you are mobilising for Labour Party.\nBut, a trade union is not a political party.\nOne of the provisions is that people of like minds can organise themselves and form a political party."
  },
  {
    "headline": "Rivers’ Governor Wike Vows to Prosecute Amaechi, Cole Over Alleged Looting of State’s Assets",
    "summarized_story": "Rivers State Governor, Nyesom Wike has vowed that a former governor of the state and the immediate past Minister of Transportation, Chibuike Amaechi as well as the All Progressives Congress (APC) governorship candidate for the state, Tonye Cole must face court trial over alleged looting of state’s assets.\nWike said he was determined to safeguard the state from those who are only interested in looting the commonwealth of Rivers people.\nWhat Rivers people will hear, Rivers people will be shocked to know what the former governor of the State and Minister did in this state with his partner, Tonye Cole.\nBut we are still working within the city to change its landscape.”The Rivers State governor said alleged looters were desperate to cover their track, maintaining that Rivers people would not allow such persons who do not have the interest of the state to take over its affairs.\nWike explained that genuine lovers of the state should be the ones presenting themselves to serve the state as governor not looters."
  },
  {
    "headline": "Nigeria: Lagos, Ogun Sign MoU on 31Km Redline Rail Project",
    "summarized_story": "Ogun State and Lagos State have signed a memorandum of understanding (MoU) on the 32km redline rail project.\nThe project when completed would run from Oyingbo in Lagos to Agbado in Ogun State.\nSpeaking during the signing of the MoU, Secretary to the Ogun State Government, Mr. Tokunbo Talabi, said the passenger train would begin operations in the first quarter of 2023.\nTalabi said the project was another significant achievement in the series of developments engendered by the Lagos/Ogun Joint Commission.\nSpeaking with newsmen after the signing of the MoU, the Commissioner for Transportation, Lagos State, Dr. Frederick Oladeinde, explained that the redline rail project is 31km, the first phase of 25km stretch from Oyingbo to Agbado."
  },
  {
    "headline": "Nigeria Challenges Indigenous Oil Firms to Fill Void Created by Divesting IOCs",
    "summarized_story": "Nigeria’s federal government has challenged the Indigenous Petroleum Producers Group (IPPG) to take advantage of the ongoing divestments by International Oil Companies (IOCs) to significantly increase their investments in oil and gas assets in the country.\nHe assured potential investors that divestments would be adequately managed to ensure that Nigeria remains a prime destination for competitive oil and gas business.\n“As global energy consumption grows, it is apparent that oil and gas will remain significant components of future energy mix.\nDispelling the impressions by government and many industry stakeholders that the current decline in Nigeria’s oil production was due to oil theft, Avuru said a combination of factors contributed to the poor production performance.\nHe explained that the oil production declined started around 2012 when the six big IOCs including Shell, ConocoPhillips, TotalEnergies, ExxonMobil, Chevron and Eni started contemplating of divesting from Nigeria, resulting in their withdrawal from further spending in the Nigerian oil and gas industry."
  },
  {
    "headline": "CBN Clarifies Emefiele’s Statement on Conversion of Naira to Dollar",
    "summarized_story": "The Central Bank of Nigeria (CBN) has clarified a statement made by its Governor, Mr. Godwin Emefiele, at Tuesday’s post-Monetary Policy Committee (MPC) meeting media briefing.\nIt stressed that Emefiele had during the media briefing warned bank customers against converting the naira to dollars for electioneering purposes.\nCBN Director, Corporate Communications Department, Mr. Osita Nwanisobi stated this following what he described as attempts by persons to deliberately misrepresent Emefiele’s caution on electioneering spending by the political class.\nHe, therefore, urged bank customers not to get involved in unauthorised movement of funds for currency conversion in order not to fall foul of the extant laws of the land.\nNwanisobi also admonished Nigerians to be more patriotic as it relates to the naira, noting that it was the duty of every citizen to support the CBN in preserving the value of the naira."
  }
]