[
  {
    "headline": "Hunters arrest bandits, rescue nine villagers, gunmen abduct five in Kaduna",
    "summarized_story": "Hunters in Udawa community along the Kaduna-Birnin Gwari Highway in Chikun Local Government Area of Kaduna State, have rescued no fewer than nine villagers.\nRecently, bandits attacked a convoy of Kano-bound traders where over 70 of them were taken into the forest.\nBut the police in Kaduna, following reinforcement by escorts who accompanied the traders, rescued 48 of the kidnapped traders while a female trader is still missing, according to the state police public relations officer, Mohammad Jalige.\nA source told our reporter that the hunters rescued nine kidnapped victims.\n“The hunters engaged the bandits, forcing them to abandon the victims,” the source said."
  },
  {
    "headline": "Ondo CP vows to end illegal checkpoints",
    "summarized_story": "The Ondo State Commissioner of Police, Mr Oyediran Oyeyemi, has promised to ensure the removal of illegal police checkpoints along Shagamu -Ore -Benin Expressway.\nIt was gathered that there are over 200 police checkpoints on the highway.\nThe situation causes regular traffic jam on the road.\nHe said there would be an end to the checkpoints on the expressway.\nOyeyemi said, “We don’t want a situation where travellers will suffer for several hours due to traffic jam."
  },
  {
    "headline": "Sultan, Oyetola, others charge Muslims to embrace peaceful coexistence, brotherliness",
    "summarized_story": "Gboyega Oyetola of Osun and Alhaja Noimot Salako, Ogun Deputy Governor, have urged Muslims to embrace peaceful coexistence.\nAbubakar urged them to be peaceful and good ambassadors of Islam, whether in schools, homes, social events or wherever they find themselves.\nGboyega Oyetola of Osun, commended the contributions of MSSN leadership to the country through their dawah activities in schools and national education.\nHe urged Muslims to propel the ummah to greater heights as well as prioritise education of youths and moral rebirth.\n“We must invest in Islamic schools, be dedicated to reducing poverty and social exclusion of Muslims, among others,” he said."
  },
  {
    "headline": "Don’t take part in strikes, Ngige charges newly-inducted doctors",
    "summarized_story": "Chris Ngige, Minister of Labour and EmploymentThe Federal Government has charged newly-inducted medical graduates to desist from participating in incessant strikes by doctors in the country.\nNgige gave the charge while speaking at the induction of six medical graduates of the University of Abuja (UniAbuja) into the Medical and Dental Council of Nigeria (MDCN).\nNgige whose son, Dr Andrew Ngige, is among the new inductees, urged the medical graduates to be of good behaviour and uphold the highest ethical standards while carrying out their duties.\nHe noted that the medical profession is a noble one and hence, they should abstain from any conduct which is capable of bringing their esteemed profession to disrepute.\n“I am a medical doctor."
  },
  {
    "headline": "UN Deputy Chief, Amina Mohammed, mourns Archbishop Desmond Tutu",
    "summarized_story": "Desmond TutuUN Deputy Secretary-General Amina Mohammed on Sunday paid tribute to the late Archbishop Desmond Tutu, extoling his exceptional qualities.\nMohammed joined other UN leaders to lament the passing away of the anti-apartheid leader and human rights activist, who died in Cape Town at the age of 90.\nArchbishop Tutu had travelled to UN Headquarters in New York on many occasions over the past decades, including as a member of The Elders, an independent group of eminent global leaders working to promote peace and human rights.\nArchbishop Tutu received countless honours for his activism and advocacy, including the Global Champion Against Hunger award presented by the UN World Food Programme (WFP) in November 2012.\nA month later, the UN Educational, Scientific and Cultural Organisation (UNESCO) announced he was the recipient of the UNESCO/Bilbao Prize, honouring his role in building a universal culture of human rights around the world"
  },
  {
    "headline": "Group appeals to APC Caretaker Committee to conduct National Convention on Feb. 5, 2022",
    "summarized_story": "Mai Mala Buni-led All Progressives Congress (APC) Caretaker and Extra-ordinary Convention Planning Committee (CECPC) to ensure that the party’s National Convention is conducted on February 5, 2022.\nThe PMM, which claimed to be a foundational group of the APC, called on the Buni-led CECPC not to prolong the date for the party’s national convention a day beyond Feb. 5,2022.\n“The delay in conducting the overdue APC national convention is already giving the opposition Peoples Democratic Party (PDP) some advantages, making it look like nobody is in charge of the ruling party.\nBuni-led APC national caretaker committee not to go beyond Feb. 5, 2022, to hold our party’s national convention,” it said.\nThe statement said the group is in possession of the instructions given to the committee by the Presidency on the need to conduct the party’s national convention on Feb. 5."
  },
  {
    "headline": "12 fake medical laboratories shut down for alleged illegality in A’Ibom– Official",
    "summarized_story": "Prof. Augustine Umoh, the Akwa Ibom Commissioner for Health, said that he has closed 12 medical laboratories for allegedly involving in unwholesome medical practices dangerous to excellent health care delivery services.\nUmoh made the disclosure to newsmen in Uyo after the Inspection Team sealed some laboratories on Sunday.\nHe said the clampdown is in compliance with the directive from the State Executive Council over sub standard services of medical Laboratories operators in the state.\n“I have received a number of complains with regards to medical laboratory facilities and practice and this is an attempt to correct some of this abnormalities.\n“We have started with medical Laboratories in Uyo metropolis but we would certainly extend it to all nooks and crannies of the state,” the Health Commissioner said."
  },
  {
    "headline": "Nwosu: Police assaulted my wife, tore my daughter’s cloth before arresting son-in-law – Okorocha",
    "summarized_story": "Imo West Senator, Rochas Okorocha, has reacted to the arrest of his son-in-law, Uche Nwosu by operatives of the state Police Command.\nOkorocha said the police officers that arrested Nwosu pushed his wife, Nkechi, to the ground and tore the clothes of his first daughter, Uloma.\nPolice officers had on Sunday arrested Nwosu the St Peter’s Anglican Church, Eziama Obieri in the Nkwerre Local Government Area of the state.\nThe former governor of the state lamented there was no arrest warrant or invitation by the policemen who arrested his son-in-law.\nOver 100 gunshots to arrest Uche Nwosu."
  },
  {
    "headline": "Many have died – NAFDAC warns Nigerian men against use of performance-enhancing drugs",
    "summarized_story": "The National Agency for Food and Drug Administration and Control, (NAFDAC) on Sunday warned Nigerian men to desist from using performance-enhancing substances, known as “aphrodisiac”, in a bid to impress their female partners.\nAdeyeye denounced the preponderance of performance-enhancing drugs, otherwise known as ‘’Manpower’’ in the local parlance, in the Nigeria market.\nHe said that most of the performance-enhancing drugs aren’t registered with NAFDAC, adding that some of the drugs were smuggled into Nigeria.\nHe said, “If they were registered, the producers and peddlers wouldn’t get it to the supermarkets, social media platforms and on the streets.\n“Many men have died using such drugs and their relatives would blame their death on some imaginary witches in the village."
  },
  {
    "headline": "Christmas: Gov. Buni charges Christian faithful to continue praying for full return of peace in Yobe, Nigeria",
    "summarized_story": "Yobe State Governor, Mai Mala Buni, has charged Christian faithful in the state to continue praying for the full return of peace to the state and the country in general.\nThe governor gave the charge on Sunday in a statement issued by his Spokesman Mamman Mohammed when he receivedYobe State leadership of the Christian Association of Nigeria, (CAN), on a courtesy visit.\nBuni assured the faithful in the state of equal treatment at all times.\nThe association commended Governor Buni for the goodwill extended to the Christian faithful during the Christmas season, while appreciating Yobe state government for its all inclusive policy of giving sense of belonging to everyone in the state.\nThe statement, further, recalled that Yobe state government has supported members of the Christian Association of Nigeria, (CAN), with food items, cows and cash to celebrate the Christmas."
  },
  {
    "headline": "Jonathan responsible for rise of banditry in Nigeria – Amaechi",
    "summarized_story": "The Minister of Transportation, Rotimi Amaechi, has said that banditry became rampant because of the poverty created by Goodluck Jonathan’s administration.\nAmaechi, speaking on ‘Hard Copy’ a Channels Television programme, claimed the money Jonathan left for Nigeria after he left office in May 2015, was not enough to run the country for three weeks.\nThe ex-Governor of Rivers State claimed that while he was chairman of the Nigerian Governors’ forum, he was informed by officials of the Presidency that there was virtually no money left in the treasury.\nAmaechi said, “When you talk about bandits and all these people that kill, it’s a question about poverty and it did not start in this regime.\nAnd I was speaking at that time as the chairman of the governors’ forum.”"
  },
  {
    "headline": "I’m proud of your records – Buhari tells Bagudu, Dogara",
    "summarized_story": "President Muhammadu Buhari at the weekend extolled the virtues of Governor Atiku Bagudu of Kebbi State and Yakubu Dogara, a former Speaker of the House of Representatives, on their birthday anniversaries on Dec. 26, describing them as committed party men.\n“You did not disappoint the voters that put you into office.\n“Your records of performance have reinforced my belief that given the opportunity, our younger politicians have the capacity to deliver results.\n“You’re a source of inspiration to other younger politicians.\n“I wish you many more years on earth and good health in the service of Nigeria,” Buhari told the two politicians."
  },
  {
    "headline": "Okorocha, Imo Govt clash over Nwosu’s arrest",
    "summarized_story": "Most security operatives in Imo State know nothing about the arrest.\n“Over one hundred gunshots to arrest Uche Nwosu?\nRecall that Hope Uzodinma said he is going to name sponsors of insecurity in Imo state on January 3.\nEmelumba said: “If Uche Nwosu is arrested, what he (Okorocha) should do is to wait and see why he was arrested.\nThis sort of unprovoked violence and primitive show of force by the Imo State Police Command is unconstitutional, illegal, despicable, treacherous, and reprehensible."
  },
  {
    "headline": "Goods worth billions razed in Abuja supermarket fire",
    "summarized_story": "By Gbenga Omokhunu and Blessing OlaifaGoods worth billions of Naira were destroyed in a fire outbreak that engulfed the Next Cash and Carry Supermarket building in the Jahi area of Abuja.\nAn eyewitness and one of the cashiers of the supermarket, Ogochukwu Aniekwe, told our correspondent that the goods destroyed by the inferno were worth billions of Naira.\nThe people that you saw were the members of staff of NEXT cash and carry trying to move their goods from the inferno.\nShe said: “Today Thursday, December 26, 2021, at about 11:15 a.m. there was a report of a fire outbreak at Next Cash and Carry Supermarket at Jahi District of the FCT.\n“This is contrary to the news getting the rounds as there is no successful case of looting or carting away of goods from the store."
  },
  {
    "headline": "Police arrest man for ‘killing’ union leader",
    "summarized_story": "Police in Ogun State have arrested a 32-year-old technician on Saturday for allegedly stabbing a union leader to death in the Agbado area of the state.\nPolice spokesman, Abimbola Oyeyemi, an Assistant Superintendent of Police (ASP), stated at Ota Ogun State, yesterday that the suspect was arrested following a distress call received by the police.\nHe added that Oladipupo, 42, a member of an Ogun State transport union, was at the hotel to celebrate Christmas with the owner when he was stabbed to death.\nHe added that upon interrogation, the suspect confessed to the killing of the deceased and claimed it was the devil’s handiwork.\nIt was then he brought out his knife and stabbed Oladipupo many times."
  },
  {
    "headline": "First-class monarch abducted in Plateau",
    "summarized_story": "However, the Military in Jos confirmed the kidnap of the monarch of Gindiri, Charles Mato Dakar in his palace yesterday.\nAccording to the lawmaker, security operatives had been deployed to the community and were combing the bushes in search of the kidnapped traditional ruler.\nAlso, bandits terrorising parts of Kaduna State at the weekend kidnapped five peasants at the Kuregu area of Wusasa in Zaria Local Government Area of Kaduna State.\nThough Kaduna State Police Command was yet to comment on the incident, The Nation gathered that the gunmen stormed the area on Saturday evening shooting intermittently.\nAlso, in Ekiti State, gunmen suspected to be kidnappers abducted two persons on Christmas Day in Ijan-Ekiti, Gbonyin Local Council Development Area of Ekiti State."
  },
  {
    "headline": "Akwa Ibom shuts 12 fake medical labs",
    "summarized_story": "Akwa Ibom State Government has shut 12 medical laboratories operating without licences and in default of standard best practices.\n“I have received a number of complaints with regards to medical laboratory facilities and practice and it is an attempt to correct some of these abnormalities.\nSo, our intention is to use this exercise to give further directive to the practice of laboratory services in the state,” Umoh said.\n“We have started with medical laboratories in Uyo metropolis, but we will certainly extend it to the nooks and crannies of the state,” the commissioner said.\nThe Head of the Monitoring/Inspection Team, Dr. Udoh, said lack of precision in the medical laboratory test administered to patients had resulted in poor medical diagnosis."
  },
  {
    "headline": "(UPDATED) Uche Nwosu arrested,not Kidnapped – Police",
    "summarized_story": "The Imo State Command of the Nigeria Police has said that the son-in-law of former Governor Rochas Okorocha, Chief Uche Nwosu, was arrested and not kidnapped as being speculated.\nArmed officers had stormed St. Peter’s Anglican Church, Nkwerre and arrested Nwosu during church service, leading to earlier speculation that he may have been abducted.\nThe statement reads in part: “This is to inform the general public that Chief Uche Nwosu was not kidnapped but was arrested by the police and Imo state police command is aware of the arrest and presently he is in police custody.\n“This is to refute the earlier news that has been making the rounds on social media that he was kidnapped by unknown gunmen.\n“This is to refute the earlier news that have been making the rounds on social media that he was kidnapped by unknown gunmen."
  },
  {
    "headline": "BREAKING! Archbishop Desmond Tutu dies at 90",
    "summarized_story": "Archbishop Desmond Tutu of South Africa, the Nobel Peace prize laureate who helped end apartheid in that country, has died at aged 90.\nPresident Cyril Ramaphosa said the Archbishop’s death marked “another chapter of bereavement in our nation’s farewell to a generation of outstanding South Africans”.\nHe said Archbishop Tutu had helped bequeath “a liberated South Africa”.\nHe was awarded the Nobel prize in 1984 for his role in the struggle to abolish the apartheid system.\nPresident Ramaphosa said Tutu was “an iconic spiritual leader, anti-apartheid activist and global human rights campaigner”."
  },
  {
    "headline": "20% pay rise: Police officers unhappy, indifferent",
    "summarized_story": "From Molly Kilete, AbujaWhen President Muhammadu Buhari announced the approval of 20 per cent salary increase for officers and men of the Nigerian Police Force (NPF) on December 15, there was jubilation and mixed reactions not just among the officers, but also the general public.\nSome police officers who spoke to Sunday Sun have mixed feelings about the increase, saying that the problem in the force was more than salary increase.\nMore than the salary increase, many police officers said that they would prefer that government provide them with good healthcare facility, scholarship for their children, good and affordable accommodation, transport system, among other goodies to make their job comfortable.\nAn Inspector of police who spoke to Sunday Sun said: “I heard the president has increased our salary by 20 per cent.\nTo him, the 20 per cent increase is nothing to write home about and should not be something to use to praise the achievements of the Buhari’s government."
  },
  {
    "headline": "Christmas: Osinbajo, govs, senators, others felicitate with",
    "summarized_story": "Governor Abiodun made the call at a church service held at the St. James’ Anglican Church, Iperu-Remo, Ikenne Local Government Area yesterday.\nNoting that the country’s present challenges were surmountable, he said: “God has kept us alive despite the raging COVID-19 pandemic.\nKebbi State Governor, Senator Abubakar Atiku Bagudu has felicitated with Christians as they celebrate this year’s Christmas and urged them the period to continue to live in peace with each other irrespective of their religious, political and ethnic differences.\nWith Christian faithful marking the birth of Jesus Christ, Kebbi State governor, Senator Abubakar Atiku Bagudu has called for peaceful coexistence, unity, and patriotism.\nStephen Adegbite, called on Christians to celebrate Christmas by helping the less fortunate and also go for COVID-19 vaccination."
  },
  {
    "headline": "NANS berates Akeredolu over non-payment of poly workers",
    "summarized_story": "From Bamigbola Gbolagunte, AkureOndo State chapter of the National Association of Nigerian Students (NANS) has berated the administration of Governor Rotimi Akeredolu over the non-payment of 14 months salaries of some staff of the state-owned Rufus Giwa Polytechnic, Owo.\nThe Non Academic Staff of the Polytechnics had embarked on an industrial action as a result of the non-payment of their salaries.\nThe students’ body in a statement by Mr Surprise Omotoso frowned at the action of the state government, saying that the present administration is insensitive to the yearning of the workers.\n“It’s also an apparent show of lack of sympathy and empathy on the part of the Ondo State government led by Governor Akeredolu.\n“The detrimental effect of the industrial action embarked upon by the Non Academic Staff Union would have its effect on the students of the institution."
  },
  {
    "headline": "Archbishop Desmond Tutu is Dead",
    "summarized_story": "Archbishop Desmond Tutu, the Nobel Peace prize laureate who helped end apartheid in South Africa, has died aged 90.\nHe said Archbishop Tutu had helped bequeath “a liberated South Africa”.\nTutu was one of the country’s best known figures at home and abroad.\nHe was awarded the Nobel prize in 1984 for his role in the struggle to abolish the apartheid system.\nPresident Ramaphosa said Tutu was “an iconic spiritual leader, anti-apartheid activist and global human rights campaigner”."
  },
  {
    "headline": "In Christmas Dispatch, Buhari Promises Nigerians End to Killings, Kidnappings",
    "summarized_story": "Hope, Peace, Joy, Love are the recurring themes of this time.\nUrges Citizens to Get VaccinatedAlso in the Christmas message, the President pleaded with all citizens to get vaccinated against COVID-19.\nIgnatius Kaigama yesterday lamented that the hearts of Nigerians are heavy with the suffering they had experienced and seen in 2021 alone.\nThe bishops said Nigerians should always remember the popular Christmas refrain, Emmanuel which is that “God is with us” and try to be hopeful of a better future.\nIn its Christmas message issued by the Catholic Bishops Conference of Nigeria (CBCN) jointly signed by the President, Most Rev."
  },
  {
    "headline": "FG: ISWAP’s Ability to Launch Rockets on Borno Disturbing",
    "summarized_story": "This is just as the federal government allayed the fears of Nigerians over the reported planned attack by terrorists on Abuja, the nation’s capital.\nISWAP had launched multiple rockets on Maiduguri, the state capital, hours before the visit of the President to Borno State.\nHe said: “The marching orders are always the same; you have even told Nigerians the marching orders of the President.\nGanduje Demands Deployment of more SoldiersGovernor Abdullahi Ganduje of Kano State has asked President Muhammadu Buhari to deploy more military personnel to forests in the state.\n“In Kano State, we have taken some measures."
  },
  {
    "headline": "NCDC: 45 Cases of Omicron so far Detected in Nigeria",
    "summarized_story": "*Says country now experiencing community transmission of variantOnyebuchi EzigboThe Nigeria Centre for Disease Control (NCDC) yesterday announced that 45 cases of the Omicron variant of COVID-19 had so far been recorded in the country, with no death logged.\nNCDC Director-General, Dr Ifedayo Adetifa, who disclosed the Nigerian Omicron statistics at a virtual media briefing, said the new cases were in people without travel history, which suggested that the country was already experiencing community transmission.\nAdetifa said the six cases of Omicron earlier detected were in persons with recent travel history to South Africa.\nAccording to him, it is important for Nigerians to maintain physical distance and avoid contact with anyone showing symptoms of respiratory illness.\nThe agency however said all the COVID-19 vaccines in the country offered significant protection against the Omicron variant, and that two doses should still ward off severe disease."
  },
  {
    "headline": "Buhari in Borno, Promises to Cater for Families of Dead, Wounded Soldiers",
    "summarized_story": "* Says with new hardware, military more prepared to flush out terroristsDeji Elumoye in AbujaPresident Muhammadu Buhari, yesterday, said his administration would support families of dead and wounded soldiers, and help them realise their potential.\nBuhari stated this in Maiduguri, the Borno State capital, when he addressed troops at the Nigerian Air Force Base.\nBuhari assured the families of soldiers, who paid the supreme price for the country, and the injured that the federal government would cater for their needs, in recognition of their sacrifices for all Nigerians.\nI am also happy with the increased level of cooperation between the good people of Borno State, other stakeholders and the security agencies.\nThis intervention will benefit not only students from Borno and the North-east but also students from all parts of Nigeria."
  },
  {
    "headline": "BREAKING: Boko Haram Currently Attacking Yobe Community",
    "summarized_story": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), are currently attacking Buni Yadi, a community in Yobe State.\n“There is confusion in the community now, sporadic shooting currently going on,” a source said.\nISWAP, which split from the mainstream Boko Haram in 2016, has become a dominant group, focusing on military targets and high-profile attacks, including against aid workers.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau."
  },
  {
    "headline": "BREAKING: Boko Haram Currently Attacking Yobe Community",
    "summarized_story": "Militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), are currently attacking Buni Yadi, a community in Yobe State.\n“There is confusion in the community now, sporadic shooting currently going on,” a source said.\nISWAP, which split from the mainstream Boko Haram in 2016, has become a dominant group, focusing on military targets and high-profile attacks, including against aid workers.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau."
  },
  {
    "headline": "BREAKING: South Africa's Archbishop Desmond Tutu Is Dead",
    "summarized_story": "Archbishop Desmond Tutu, the Nobel Peace Prize laureate who helped end apartheid in South Africa, has died aged 90.\nPresident Cyril Ramaphosa said the churchman's death marked \"another chapter of bereavement in our nation's farewell to a generation of outstanding South Africans\".\nHe said Archbishop Tutu had helped bequeath \"a liberated South Africa\".\nTutu was one of the country's best-known figures at home and abroad, BBC News reports.\nHe was awarded the Nobel prize in 1984 for his role in the struggle to abolish the apartheid system."
  },
  {
    "headline": "BREAKING: South Africa's Archbishop Desmond Tutu Is Dead",
    "summarized_story": "Archbishop Desmond Tutu, the Nobel Peace Prize laureate who helped end apartheid in South Africa, has died aged 90.\nPresident Cyril Ramaphosa said the churchman's death marked \"another chapter of bereavement in our nation's farewell to a generation of outstanding South Africans\".\nHe said Archbishop Tutu had helped bequeath \"a liberated South Africa\".\nTutu was one of the country's best-known figures at home and abroad, BBC News reports.\nHe was awarded the Nobel prize in 1984 for his role in the struggle to abolish the apartheid system."
  },
  {
    "headline": "APC Group Threatens Protest If Ruling Party Fails To Hold National Convention By February 5",
    "summarized_story": "A sub-group of the ruling All Progressives Congress (APC), identified as the Progressive Mandate Movement (PMM), has threatened to occupy the national secretariat of the party if the Governor Mai Mala Buni-led Caretaker Extraordinary Convention Planning Committee (CECPC) exceeds its February 5 deadline to conduct a national convention.\nAbdullahi Mohammed and Secretary, Comrade Adekunle Fijabi, the group said it will launch operation #OccupyAPCNationalSecretariat in order to get party leaders to do the “right thing”.\nThe statement claimed that President Muhammadu Buhari had desired the APC National Convention to hold in December 2021 but due to appeals by the Buni-led CECPC, the Presidency accepted February 2022.\n“The delay in conducting the overdue APC national convention is already giving the opposition Peoples Democratic Party (PDP) some advantages, making it look like nobody is in charge of the governing party.\n“We, therefore, call on the Governor Mai Mala Buni-led National Caretaker Committee not to go beyond February 5 to hold our party’s National Convention."
  },
  {
    "headline": "'Presidential aides can fall sick' -- Femi Adesina speaks on COVID-19 concern in Aso Rock",
    "summarized_story": "There were also reports that other presidential aides had tested positive and are currently in isolation.\nSpeaking on the development, Adesina, in an interview with Channels Television on Sunday, said presidential aides are also humans.\nAdvertisement“What I like to say is that presidential aides are just humans.\nIf anything happens to human beings, it can also happen to presidential aides,” he said.\n“The fact that we are presidential aides does not make us immune to certain things."
  },
  {
    "headline": "'Presidential aides can fall sick' -- Femi Adesina speaks on COVID-19 concern in Aso Rock",
    "summarized_story": "There were also reports that other presidential aides had tested positive and are currently in isolation.\nSpeaking on the development, Adesina, in an interview with Channels Television on Sunday, said presidential aides are also humans.\nAdvertisement“What I like to say is that presidential aides are just humans.\nIf anything happens to human beings, it can also happen to presidential aides,” he said.\n“The fact that we are presidential aides does not make us immune to certain things."
  },
  {
    "headline": "ISWAP fighters arrested as troops repel attack on Yobe town",
    "summarized_story": "Troops of the Nigerian army have repelled an attack by suspected fighters of the Islamic State of West Africa Province (ISWAP) in Buni Yadi, Gujba LGA of Yobe state.\nAdvertisementBukar Bulama, a resident of Buni Yadi, told TheCable that the insurgents attacked the town in armoured trucks on Sunday evening.\nBulama said the troops, with the help of the hunters, were able to repel the attack.\nOn December 1, troops of the Nigerian army had neutralised an attack from suspected ISWAP fighters, recovering gun trucks.\nBuni Yadi came into the limelight in 2014 after Boko Haram insurgents killed 58 male students of the town’s Federal Government College."
  },
  {
    "headline": "ISWAP fighters arrested as troops repel attack on Yobe town",
    "summarized_story": "Troops of the Nigerian army have repelled an attack by suspected fighters of the Islamic State of West Africa Province (ISWAP) in Buni Yadi, Gujba LGA of Yobe state.\nAdvertisementBukar Bulama, a resident of Buni Yadi, told TheCable that the insurgents attacked the town in armoured trucks on Sunday evening.\nBulama said the troops, with the help of the hunters, were able to repel the attack.\nOn December 1, troops of the Nigerian army had neutralised an attack from suspected ISWAP fighters, recovering gun trucks.\nBuni Yadi came into the limelight in 2014 after Boko Haram insurgents killed 58 male students of the town’s Federal Government College."
  },
  {
    "headline": "It's unethical for doctors to embark on strike, says Ngige",
    "summarized_story": "Chris Ngige, minister for labour and employment, says it is unethical for medical doctors to embark on strike.\nNgige advised the inductees, which include Andrew Ngige, his son, not to join any form of strike action.\nThe minister said the medical profession is a noble one, hence, the new doctors should abstain from any conduct capable of bringing the profession to disrepute.\n“It is unethical for doctors to embark on strike.\nTherefore, you should desist from going on strike in the interest of humanity and our noble profession.”"
  },
  {
    "headline": "Nigeria’s lastest loan to fund startups is a product of VP Osibajo Silicon Valley visit",
    "summarized_story": "When they got back from the trip, the office of the Vice President contacted the African Development Bank (AfDB) to support Nigeria with funding.\nThis investment will stimulate 226 technology and creative startups and provide non-financial benefits to 451 digital technology and small and medium enterprises.\nThe programme will support the digital and creative space across four pillars: human capital, enabling environment, finance, and infrastructure.\nIt will also support technology and creative enterprises by organising Hackathons, providing mentorship, launching a startup voucher programme that will support early-stage startups and entrepreneurs with access to workspace and hubs.\nAnother important reason for the government’s foray into the tech ecosystem is to invest outside the Lagos and Abuja bubble."
  },
  {
    "headline": "Venture funding in Senegal remains muted despite Wave’s $200m buzz",
    "summarized_story": "The reality is reflected in annual reports on startup funding in the continent and 2021 has been no different.\nAt the time, Wave’s continental record raise was considered by some as a sign that Senegal’s startup funding fortunes were beginning to change.\nNigeria alone accounts for 35% of this funding and, along with Ghana, took the lion’s share, some 86%, of funding that flowed into West African startups.\nFrench-speaking Senegal (13%), Cameroon (0.7%), and Côte d’Ivoire (0.3%) make up the rest of the startup funding share, according to available data.\nHowever, instead of equity, the majority of funding available in the market are grants and concessional loans."
  },
  {
    "headline": "Flutterwave x Wizkid to drive global payments adoption",
    "summarized_story": "While Paystack was more involved with helping startups collect payments, Flutterwave focused on helping anyone send and receive money via its API.\nSince then, the digital payments service has transformed payments in Africa with a number of solutions.\nIt allows African merchants collect payments from their customers anywhere in the world, on web and mobile.\nFlutterwave SendFlutterwave Send dashboardIts latest product, Flutterwave Send, is taking payments to the global level.\nThe Essence of Flutterwave SendAt the helm of Flutterwave Send is Afrobeats artiste, Ayodeji Ibrahim Balogun—popularly known as Wizkid—who was signed on as Flutterwave’s global brand ambassador."
  },
  {
    "headline": "Ghana’s answer to Silicon Valley is inside refurbished government buildings",
    "summarized_story": "This project in the heart of Ghana’s capital city, the Accra Digital Centre, is a symbol of Ghana’s ambition to be the startup capital of Africa.\nAn aerial view of the Accra Digital Centre“Beyond Ghana’s capital city, the government has identified unused government buildings around the country,” said David Ofori, Head of Operations at the Accra Digital Centre.\nFour years later, the Accra Digital Centre is living up to expectation and looks to be a worthy template for other centres across the country.\nAnother early tenant of the Accra Digital Centre is aYo, an affordable insurance product by MTN.\nThe Accra Digital Centre is looking to partner with local or foreign investors and investment companies to expand its reach and impact."
  },
  {
    "headline": "Christmas: Edo govt urges love, sacrifice, fetes orphans, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has urged residents in the state to show love to orphans and the less privileged, in the spirit of the Christmas celebration.\nAddressing journalists in Benin City, after presenting gift items to children at the Project Charilove Foundation, in Benin City, the Commissioner for Social Development and Gender Issues, Hon.\nMaria Edekor said the government is committed to the welfare of all citizens, including the less privileged.\nGod gave them to us and we are happy because every gift from God is a good gift.”The commissioner further stated, “His Excellency thought it wise that we bring these gift items to these children.\nThe government is ready to serve the people, irrespective of your status or vulnerability.”The founder and service leader, Project Charilove Foundation, Bro."
  },
  {
    "headline": "CHRISTMAS MESSAGE – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestI wish all Edo people in the state and the Diaspora a merry Christmas.\nKindly adhere to the COVID-19 protocols and be safe as you celebrate with your friends and loved ones.\nFor security and other emergencies, please call the Edo helpline on 08000911911 and 08001235111.\nI wish you all a joyful Christmas celebration.\nSignedHis Excellency, Godwin ObasekiGovernor, Edo State..."
  },
  {
    "headline": "AIG Zone 5 Warns Officers Against Bullying, Extortion, others – Nigerian Observer",
    "summarized_story": "AIG Ahmad Abdurrahman stated this in his maiden chat with our crime reporter at his office, Zone 5 Command headquarters, Adesuwa road, Benin City, yesterday.\n“I have held my maiden address with some senior police officers and some personnel of the zone.\nAIG Ahmad stated.\nRecall that AIG Ahmad Abdurrahman assumed duty in zone 5 on December 16, 2021 after taking over from AIG Isaac O. Akinmoyede who has been redeployed to zone 9, Umuahia.\nZone 5 Command with its headquarters on Adesuwa road in Benin City is in charge of Edo and Delta States police command."
  },
  {
    "headline": "Buhari calls for cooperation among elites in tackling Nigeria’s challenges – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – President Muhammadu Buhari says there is need for more cooperation among the elites in the country in resolving the challenges facing the nation.\nThe president’s spokesman, Mr Femi Adesina, in a statement in Abuja, said Buhari made the call when he visited the palace of the Shehu of Borno.\nHe said the elites owe it to the people to inform, guide and shape opinions since they had more access and knowledge on the economy.\n“What our country needs now is the continued cooperation of the elites.\nThe president assured Nigerians that his administration will use the remaining period to consolidate on efforts in restoring peace and improving the economy."
  },
  {
    "headline": "Osun West leaders denounce Adeoti, Salam, throw weight behind Oyetola",
    "summarized_story": "The party faithful drawn from Ayedaade, Ayedire, Ede North,Ede South, Egbedore, Ejigbo, Irewole, Isokan, Iwo, and Ola-Oluwa local Governments, on Friday, reaffirmed their commitment and support to the re-election of Governor Oyetola at APC Senatorial Office, Iwo.\nThe APC Members said they were totally convinced by the starling administrative style of Governor Oyetola which they said has brought solace and comfort to their Senatorial District and the state in general.\n“Our agitations in 2018 tagged “West Lokan” was borne out of perceived and adjudged marginalisation and neglect in the preceding years which served as fueling pads for the movement.\n“Our senatorial districts has benefited greatly from Oyetola’s Administration massive Infrastructural Programmes in the following Sectors such as roads, education, health and social services, water provision, flood control, dredging of rivers and streams across the entire senatorial district, fumigation of market stalls/Schools and public places across the entire senatorial district.\n“At this juncture, we leaders of APC Osun West Senatorial District are declaring our hearty resolution to remain committed, loyal , supportive and dependable allies of His Excellency Isiaka Adegboyega Oyetola in working selflessly for the realisation of his second term come 16th day of July 2022."
  },
  {
    "headline": "Ex Imo governorship candidate, Uche Nwosu abducted in church by police",
    "summarized_story": "Uche Nwosu, son-in-law to former Imo State governor, Owelle Rochas Okorocha, has been arrested by police officers during a church service in Nkwere.\nNwosu, a former All Progressive Congress (APC) governorship candidate and later Action Alliance (AA) candidate during the 2019 governorship election was taken by armed police officers at St. Peters Anglican Church Nkwerre inside the church premises and was put in a car booth.\nThe Police Public Relations officer in the State, Michael Abatam, confirmed that Nwosu was “arrested and not kidnapped.”Nwosu served as Chief of Staff to Okorocha, who wanted him to be his successor, during his time as governor."
  },
  {
    "headline": "South Africa anti-apartheid hero, Desmond Tutu, dies aged 90",
    "summarized_story": "Nobel Peace prize laureate and South Africa’s anti apartheid hero, Archbishop Desmond Tutu, has died aged 90.\nTutu’s death comes just weeks after that of South Africa’s last apartheid-era president, FW de Clerk, who died at the age of 85.\nA shepherd.”It is impossible to imagine South Africa’s long and tortuous journey to freedom – and beyond – without Archbishop Desmond Tutu.\nLater he turned that same fierce gaze on the failings, in government, of South Africa’s former liberation movement, the ANC.\nHe became Bishop of Johannesburg in 1985, and was appointed the first black Archbishop of Cape Town the following year."
  },
  {
    "headline": "805 Nigerian doctors secure British licence in six months",
    "summarized_story": "Data from the General Medical Council of Britain has shown that 805 Nigeria-trained doctors were licensed between July and December 25, 2021.\nThis as the number of Nigerian-trained doctors in the United Kingdom increased to 9,189.\nThe figure different from the number of Nigerian doctors trained and practising in the UK.\nIn June, 8,384 Nigerian doctors had been licensed while the number of Nigeria-trained specialists and consultants who migrate have continued to increase over the years, PUNCH reported.\nAccording to the data made available by the council, 233 Nigerian doctors passed the examination to practise in the UK in 2015."
  },
  {
    "headline": "Policemen Stripped My Daughter, Humiliated My Wife While Arresting Nwosu – Okorocha",
    "summarized_story": "Former governor of Imo State, Rochas Okorocha, on Sunday, alleged that policemen humiliated his wife, Nneoma and daughter, Uloma Nwosu while arresting his son-in-law, Uche Nwosu.\n“My wife was pushed down and my daughter’s clothes were torn into pieces by the policemen who came into the church to arrest Uche Nwosu without a warrant of arrest.\n“Uche Nwosu, my wife and daughter were at the church for an outing service when a group of men in police uniform, while sermon was on going, started shooting.\nUche Nwosu was dragged into a bus carrying Imo State government number.\n“Over one hundred gunshots to arrest Uche Nwosu."
  },
  {
    "headline": "Ugwuanyi, Idoma Voice, Others Bag Awards At 2021 Otukpo Carnival",
    "summarized_story": "The Governor of Enugu State, Ifeanyi Ugwuanyi, has bagged the award of “Friend Of Idoma” at the ongoing Idoma International Carnival in Otukpo, headquarters of Otukpo local government area of Benue State.\nUgwuanyi was honoured for restoring peace through amity between two warring communities in Enugu and Benue States.\nADVERTISEMENTHe was hailed for ensuring that the amity restored six years ago is sustained with construction of an access road linking Amuteyi in Enugu State and Ikalugu in Benue State.\nUgwuanyi who speaks Idoma fluently is always considered a son of the soil by the Idoma people hence the peaceful relationship between communities in the two states.\nThe media house is a popular online platform in Benue State and theADVERTISEMENTpremier community tabloid in the North Central region of the country."
  },
  {
    "headline": "Convention: I’ll Bring 10m Youths Into APC, Aspirant Vows",
    "summarized_story": "An aspirant to the office of the National Organising Secretary of the All Progressives Congress (APC), Barr.\nShola Gariel, has said that if elected, he will mobilise 10 million youths into the party.\nGabriel, who said he has the administrative and experiential capacity to occupy the office, urged members of the party to support his ambition.\nI am from Ekiti State, my mother from Kebbi and I am married to a beautiful Imo lady.\nYour support is needed in this refocused campaign for youth inclusion now than ever,” he stated."
  },
  {
    "headline": "Convention: I’ll Bring 10m Youths Into APC, Aspirant Vows",
    "summarized_story": "An aspirant to the office of the National Organising Secretary of the All Progressives Congress (APC), Barr.\nShola Gariel, has said that if elected, he will mobilise 10 million youths into the party.\nGabriel, who said he has the administrative and experiential capacity to occupy the office, urged members of the party to support his ambition.\nI am from Ekiti State, my mother from Kebbi and I am married to a beautiful Imo lady.\nYour support is needed in this refocused campaign for youth inclusion now than ever,” he stated."
  },
  {
    "headline": "Okorocha: Policemen who arrested my son-in-law humiliated my wife, daughter",
    "summarized_story": "He said, “Uche Nwosu, my wife and daughter were at the church for an outing service, when a group of men in police uniform started shooting while the sermon was ongoing.\nUche Nwosu was dragged into a bus carrying Imo State Government number plate.\n“They were identified as policemen from Imo State Government House by their colleagues attached to Uche for the burial (of his mother).\nOver 100 gunshots to arrest Uche Nwosu.\nBuhari should be informed about what is happening in Imo State."
  },
  {
    "headline": "Okorocha: Policemen who arrested my son-in-law humiliated my wife, daughter",
    "summarized_story": "He said, “Uche Nwosu, my wife and daughter were at the church for an outing service, when a group of men in police uniform started shooting while the sermon was ongoing.\nUche Nwosu was dragged into a bus carrying Imo State Government number plate.\n“They were identified as policemen from Imo State Government House by their colleagues attached to Uche for the burial (of his mother).\nOver 100 gunshots to arrest Uche Nwosu.\nBuhari should be informed about what is happening in Imo State."
  },
  {
    "headline": "Yobe community currently under Boko Haram attack",
    "summarized_story": "Buni Yadi, a community in Yobe State, is currently under Boko Haram attack.\nThe terrorists were said to have invaded the town on Sunday evening shooting indiscriminately, Sahara Reporters reports.\nIt was learnt that many residents were fleeing into the forest for safety.\n“There is confusion in the community now, sporadic shooting currently going on,” a security source was quoted as saying.\nDetails later… PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Younger brother’s death: Anyim commiserates with Anyaoku",
    "summarized_story": "LETTER OF CONDOLENCEI have received, with sadness, news of the death of your younger brother, Engr.\nAs the elder in the family this will be a painful experience for you.\nI pray that the good Lord will grant you and the rest members of your family the courage to bear this huge loss.\nAs you prepare for his final rite of passage, may the Lord grant his soul eternal rest in His bosom.\nAnyim Pius Anyim."
  },
  {
    "headline": "Customs busts N1.4B Tramadol concealed in diapers",
    "summarized_story": "The Nigeria Customs Service (NCS), Seme Command, said it has intercepted some items suspected to be tramadol capsules concealed with packaged jumbo size adult diapers in a container.\nMr Hussain Abdulahi, the Customs Public Relations Officer, in a statement in Seme, said the container number is MRKU 9090415.\n“On the Dec. 20, Seme Customs Service invited other security agencies and stakeholders to witness the examination of the said container.\n“The items discovered during 100 percent examination are 200 packages of adult diapers, 100 cartoons of Gabadol 120mg suspected to be tramadol equivalent to 360kg.\n“The diapers were smartly arranged at the front of the container while the drugs were was the back."
  },
  {
    "headline": "Troops foil ISWAP attacks in Yobe, kill 7 terrorists",
    "summarized_story": "Seven members of Islamic State of West African Province, ISWAP were killed as troops foiled attacks by terrorists at School of Special Forces and Buni Yadi town in Yobe State on Sunday.\nThe Special Forces worked with the Air Task Force of the Nigerian Military to foil the terrorist attack on their school.\nBut according to PRNigeria, seven ISWAP insurgents were eliminated when the troops again repelled a separate attack on civilian population at Buni Yadi, a popular town in the North East State.\nOne of the group attacked from ‘Charly Company’, while other terrorist group attempted to attack the School of Special Forces.\nThe source, while speaking further, said: “The ISWAP fighters, however, succumbed to the superior fire-power of our military troops and attempted to flee."
  },
  {
    "headline": "JUST IN: Fire Guts Peter Obi’s Next Cash and Carry Supermarket In Abuja [VIDEO]",
    "summarized_story": "The popular supermarket in Abuja, Next cash and carry in Kado, is currently on fire, a day after Christmas, and people appear to be questioning why supermarkets are being destroyed.\nSome people, however, believe it is unusual that Ebeano caught fire and that Next Cash and Carry only burned down.\nA Twitter user said, “The fire service truck that used to be stationed at Next Cash and carry went where?\nI have plenty of questions before Shoprite kills us with bills.“Another Twitter user said, “Ebeano supermarket burnt down.\nNext cash and carry Abuja is presently on fire."
  },
  {
    "headline": "Crush Boko Haram, ISWAP Terrorists Before 2023 – Buhari Tells Service Chiefs",
    "summarized_story": "President Muhammadu Buhari gave the service chiefs a new marching order yesterday to smash the Islamic State of West Africa Province (ISWAP), which has surpassed Boko Haram in the North East conflict, before he leaves office in 2023.\nBuhari wondered why ISWAP insurgents kept striking from the same corridor unchecked and told the Service Chiefs to be prepared to win the war against insurgency before he leaves office.\nBuhari said he meant what he told the troops in Maiduguri on the need to rout Boko Haram and ISWAP insurgents.\nHe also sought a more proactive campaign to rout the insurgents, whether Boko Haram or ISWAP.\nNational Chairman of the PDP, Dr. Iyorchia Ayu, charged Nigerians to keep hope alive in spite of daunting circumstances."
  },
  {
    "headline": "I’ll Deal With Bandits, Next President Must Secure Nigeria — Buhari",
    "summarized_story": "President Muhammadu Buhari has stated that his government will consider using military force to fight robbers in the northwest.\nBuhari remarked in Maiduguri, Borno State, that Nigeria is now receiving military weapons that will be utilized to combat bandits.\nIn addition, the President stated that his successor would work to ensure the country’s security.\nOnly a secure country, according to Buhari, can be managed.\n“The problem is in the North West as I said, is same people, same culture, we are going to deal with them."
  },
  {
    "headline": "2023: Primate Ayodele Gives Revelation On Nigeria’s Next President",
    "summarized_story": "Primate Elijah Ayodele, the leader of INRI Evangelical Spiritual Church, has described how Nigeria’s next president will appear.\nThe future president of Nigeria, according to Primate Ayodele, will not be an old man or a child.\nThe cleric said in a statement signed by his Media Aide, Oluwatosin Osho, that Nigeria’s next president will be one who is devoid of scandal, as God has revealed him.\nThere will be a lot that will surround who will become the next president of Nigeria.\nThe spirit of God says Buhari is ready to handover and will not interfere or dabble into the affairs of who becomes the next President."
  },
  {
    "headline": "Abuja artisans cry out: AEPB officials extorting, forcing us into crime",
    "summarized_story": "The artisans claimed the AEPB officials often extorted money from them for allegedly flouting FCT sanitation laws.\nIn a chat with Blueprint, the artisans called government’s attention to activities of the AEPB officials who moved around in their numbers daily in a patrol van.\nWhen I was told that AEPB people came and carried my machine, I quickly returned and went to their office at Area 3.\nAEPB Deputy Director Information and Public Relations Mrs Janet Peni made the agency’s position known in an interview with Blueprint.\nShe said officials of the board were concerned with maintaining sanity in the city and would not compromise, noting that linking AEPB to AMAC officials was wrong."
  },
  {
    "headline": "FCTA launches probe into Next Cash and Carry fire",
    "summarized_story": "The Federal Capital Territory Administration (FCTA) said it will launch an investigation into the circumstances surrounding Sunday morning inferno at one of Abuja’s high scale shopping mall, Next Cash n Carry.\nFCT Minister Muhammad Musa Bello, who expressed shock and sadness over the inferno, said the administration would commence a probe into the incident.\n“The Minister commended the FCT Fire Service, the Federal Fire Service, the Fire Service Departments of the Nigerian Navy, Air Force, Guards Brigade and Julius Berger Nig.\n“He equally commended the FCT FEMA, the National Emergency Management Agency, Security agencies and other responders for their efforts in containing the blaze.\n“What we saw on social media was staff of Next Cash n Carry trying to salvage the goods using trolleys."
  },
  {
    "headline": "NPower employment: 400,000 youths enlisted for Batch C2",
    "summarized_story": "The Minister of Humanitarian Affairs, Disaster Management and Social Development, Sadiya Umar-Farouq, has said the Federal Government will soon enlist additional 400,000 youths under the N-power programme.\nUmar-Farouq said the youths will be enlisted under Batch C2 for the program which is aimed at equipping the youths with life-long skills.\nWe have carefully implemented this where the Batch C1 accommodates a total of 510,000 beneficiaries and the batch C2 will commence soon.\n“N-Power has 3 core segments: N-Power Volunteer Corps – the Graduate programme, N-Power Build – Non graduate programme and N-Power Knowledge – Which is a non-graduate programme and embodies the N-Tech Hardware, N-Tech Software and the N-Creative training programmes (Animation and Scriptwriting).\n“This training component is targeted at developing competencies of the youth in software development, hardware training and creative industry which is catalytic as well as the groundwork to make Nigeria compete in the outsourcing market for software development."
  },
  {
    "headline": "His Life Was A ‘Message On Love And Forgiveness’ – Buhari Mourns Tutu",
    "summarized_story": "President Muhammadu Buhari has paid tribute to the late South African anti-apartheid hero, Desmond Tutu, describing him as one whose life was a message on love and happiness.\nAccording to Buhari, the legacies of Archbishop Tutu who died at 90 on Sunday, “will resonate through generations, bringing more light and clarity to religious diversity, democracy, and good governance.\n“The President prays for the repose of the soul of Archbishop Tutu, whose life and times sent an unforgettable message on love and forgiveness.”READ ALSO: ‘Prisoner Of Hope’: Tributes Pour In For TutuBuhari in a statement issued by a presidential aide, Femi Adesina, condoled with the late cleric’s wife, Leah Tutu, the Christian community globally; the people, and the Government of South Africa over Tutu’s demise.\n“President Buhari believes the death of the iconic teacher, human rights activist, leader of thought, scholar, and philanthropist, further creates a void in a world in dire need of wisdom, integrity, courage, and sound reasoning, which were qualities that the Nobel Peace Prize Winner, 1984, typified and exemplified in words and actions,” the statement added.\nHe recalled Tutu’s historic role in the fight against apartheid, noting that the late preacher endured “physical assaults, jail terms, and prolonged exile.”"
  },
  {
    "headline": "UPDATED: Okorocha’s Son-In-Law Uche Nwosu Arrested",
    "summarized_story": "Police have arrested a former Imo State gubernatorial candidate, Uche Nwosu.\nNwosu, a son-in-law to former Governor Rochas Okorocha, was whisked away by the security agencies at St. Peter’s Anglican Church, Eziama-Obaire, Nkwerre Local Government Area of Imo State on Sunday.\nThe heavily-armed security operatives stormed the church with high-powered security vehicles.\nWhile police authorities did not immediately confirm the incident, they released a statement later to clarify that Nwosu was arrested and not abducted as feared in some quarters.\n“This is to inform the general public that chief Uche Nwosu was not kidnapped but was arrested by the police and Imo state police command is aware of the arrest and presently he is in police custody,” a statement from the spokesman of the command, Michael Abattam, added."
  },
  {
    "headline": "Anti-Apartheid Icon Archbishop Desmond Tutu Is Dead",
    "summarized_story": "South African anti-apartheid icon Archbishop Desmond Tutu, described as the country’s moral compass, died on Sunday aged 90, sparking an outpouring of tributes for the outspoken Nobel Peace Prize winner.\nSouth Africa’s President Cyril Ramaphosa honoured this fight in a tribute to Tutu, announcing the archbishop’s death on Sunday.\nThe South African cricket team wore black armbands in his honour of the first day of the first Test against India in South Africa.\nFamously outspoken, even after the fall of the racist apartheid regime, Tutu never shied away from confronting South Africa’s shortcomings or injustices.\nHe retired in 1996 to lead a harrowing journey into South Africa’s brutal past, as head of the Truth and Reconciliation Commission."
  },
  {
    "headline": "Fire Guts Next Cash And Carry Supermarket In Abuja",
    "summarized_story": "﻿Next Cash and Carry, one of Abuja’s biggest shopping malls has been gutted by fire.\nThe Head of Search and Rescue National Emergency Management Agency (NEMA) Abuja, Labuan Ahman who spoke with Channels Television called on mutual aid fire services for support.\n“The whole of Next Cash and Carry is on fire.\nWe are calling on all mutual aid fire services to deploy to Next Cash and Carry.\nThe mutual aid fire services are Julius Berger, CBN, and then the Armed Forces."
  },
  {
    "headline": "Police Have Every Right To Arrest Uche Nwosu, Imo Govt Tells Okorocha",
    "summarized_story": "The Imo State government has reacted to the arrest of Mr Uche Nwosu, saying the police have the right to arrest him if suspected of any crime.\nHe also faulted the reaction of the immediate past governor of Imo, Rochas Okorocha, to the arrest of Nwosu, the latter’s son-in-law.\n“Uche Nwosu is just an indigene of Imo State and a citizen of Nigeria, and if he has run afoul of the law, the police have every right to arrest him, and nobody should dictate to them how they do it.\nEmelumba described the claim by Okorocha, in which he accused the state government of instigating Nwosu’s arrest, as untrue and disgusting.\nThe commissioner asked the former governor to desist from such an act and allow the security operatives who already confirmed the arrest of Nwosu to do their duty."
  },
  {
    "headline": "PGF greets Nasarawa Gov, Abdullahi Sule at 62",
    "summarized_story": "The Progressive Governors’ Forum (PGF) has described as insightful and resolute, the contributions of Nasarawa state governor, Abdullahi Sule’s contributions to a united and prosperous Nigeria.\nThe PGF stated this in a statement to mark governor Sule’s 62nd birthday on Sunday.\n“We join Governor of Nasarawa State to celebrate his 62nd birthday.\nAlong with the people of Nasarawa State, and other well-meaning Nigerians, we celebrate this special occasion with you and your family.\nAs Governor of Nasarawa State, through all the development initiatives being implemented by your APC-led government, you represent the shining light of our politics."
  },
  {
    "headline": "Christmas: Senator Remi Tinubu felicitates with Constituents, Nigerians -",
    "summarized_story": "The Senator representing Lagos Central Senatorial District, Oluremi Tinubu is felicitating with Christians in her Constituent and all Nigerians at home and in Diaspora on this joyous celebration of Christmas.\nShe said, looking back at the year 2020 and the challenges that 2021 brought, to witness another Christmas celebration is a privilege that one cannot take for granted.\nSenator Tinubu urged that the birth of Jesus be a reminder that what was foretold will definitely come to pass, praying that the commemoration of Christmas cause hope to well-up within each and every Nigerian.\nShe also urged citizens to reflect on the love, kindness and virtues of peace which the birth and life of Jesus teaches.\nThe lawmaker reiterated her call for citizens to be vaccinated, adhere strictly to the COVID-19 guidelines, ensure social and physical distance at all times."
  },
  {
    "headline": "President Buhari greets Gov Ganduje at 72, describes him as effective administrator -",
    "summarized_story": "President Muhammadu Buhari has congratulated the Governor of Kano State, Abdullahi Umar Ganduje as he marked his 72 birthday, describing him as an effective administrator who has written new chapters in development, peace and security in Kano State.\n“Happy birthday and best wishes to Governor Ganduje.\nI wish you good health and long life as you continue to serve the State and the nation with your well-known commitment to peace, security and development.\n“Kano State is making steady progress under the APC administration.\nI pray for your long life and good health,” said the President."
  },
  {
    "headline": "APC Governors celebrate Ganduje at 72, describe him as shining light -",
    "summarized_story": "The Progressives Governors Forum has described Kano state governor, Abdullahi Umar Ganduje as a strong pillar whose leadership, vision and commitment to a united prosperous Nigeria cannot be overemphasized.\nThe Progressive Governors Forum (PGF) says it joins the Kano state governor to celebrate his 72nd birthday.\nalong with the people of Kano State, and other well-meaning Nigerians.\nAs Governor of Kano State, through all the development initiatives being implemented by your APC-led government, you represent the shining light of our politics.\n“Once again, congratulations and Happy Birthday to HE Abdullahi Umar Ganduje!,” the statement said."
  },
  {
    "headline": "Yinka Davies: Regardless of What 2021 Brought, We Must Stay Positive",
    "summarized_story": "The Nigerian Music Industry in 2021.\nThat is, a review of major developments in the industry while setting agenda for 2022.\nGUEST: Yinka Davies, Nigerian vocalist, dancer, lyricist and judge of reality show, Nigerian Idol.\nYinka has been in the Nigerian entertainment industry for 28 years."
  },
  {
    "headline": "Sudan Forces Fire Tear Gas as Protesters Head to Presidential Palace",
    "summarized_story": "A Reuters witness said security forces fired tear gas to disperse the crowds on a tenth day of major demonstrations since an Oct. 25 coup.\nIn separate statements, the committee said security forces entered Khartoum Hospital and Port Sudan Hospital.\nBut on Saturday they were met with by security forces and turned back.\nIn Omdurman, security forces fired tear gas at protesters near a bridge connecting the city to central Khartoum, another Reuters witness said.\nLast Sunday, hundreds of thousands of people marched to the presidential palace and security forces fired tear gas and stun grenades to disperse protesters."
  },
  {
    "headline": "Musa, Ighalo, Osimhen, 25 Others in Nigeria’s 28-Man Nations Cup List",
    "summarized_story": "Head Coach Augustine Eguavoen has named his 28-man final list of the Super Eagles of Nigeria for the 33rd Africa Cup of Nations taking place in Cameroon fron January 9 to February 6, 2022, with Captain Ahmed Musa, midfield enforcer Wilfred Ndidi, returnee Odion Ighalo and effervescent forward Victor Osimhen all making the cut for the big houseparty.\nFormer Nigeria captain Eguavoen, who coached the Super Eagles to third-place finish at the finals in Egypt 15 years ago, has selected four goalkeepers, nine defenders, five midfielders and 10 forwards to aim for Nigeria’s fourth diadem in Cameroon.\nGoalkeepers Maduka Okoye and Francis Uzoho, defenders Kenneth Omeruo, Olaoluwa Aina and Abdullahi Shehu, midfielders Joseph Ayodele-Aribo and Chidera Ejuke and forwards Moses Simon, Odion Ighalo and Samuel Chukwueze are also on the roster.\nThere is a return to the group for former U17 World Cup –winning captain Kelechi Nwakali, forward Emmanuel Dennis and 2016 Olympics star Sadiq Umar.\nAll invited players, bar the UK-based crew, are expected to arrive in camp in the Nigeria’s federal capital, Abuja on 29th December, with the UK-based players expected to start arriving on Monday, 3rd January."
  },
  {
    "headline": "Omicron: More Travel Misery as Nearly 6,000 Flights Cancelled on Christmas Eve, Christmas Day, Boxing Day",
    "summarized_story": "Commercial airlines around the world canceled more than 5,900 flights over the Christmas weekend, as a mounting wave of COVID-19 infections driven by the Omicron variant created greater uncertainty and misery for holiday travelers.\nThe website showed that 1,779 Christmas Day flights were called off worldwide, along with 402 more that had been scheduled for Sunday.\nAirline carriers globally scrapped at least 2,401 flights on Friday, which fell on Christmas Eve and is typically a heavy day for air travel, according to a running tally on the flight-tracking website FlightAware.com.\nThe average number of new U.S. coronavirus cases has risen 45% to 179,000 per day over the past week, according to a Reuters tally.\nNew York reported more than 44,000 newly confirmed infections on Friday alone, shattering that state’s daily record."
  },
  {
    "headline": "South African Anti-Apartheid Campaigner, Archbishop Desmond Tutu, Dies Aged 90",
    "summarized_story": "Archbishop Desmond Tutu, Nobel Peace Prize laureate and veteran of South Africa’s struggle against white minority rule, has died aged 90, the presidency said on Sunday.\n“The passing of Archbishop Emeritus Desmond Tutu is another chapter of bereavement in our nation’s farewell to a generation of outstanding South Africans who have bequeathed us a liberated South Africa,” President Cyril Ramaphosa said.\nHe was an outspoken critic of the country’s previous brutal system of oppression against the country’s Black majority.\nHe was awarded the Nobel Peace Prize in 1984 for his campaign of non-violent opposition to South Africa’s white minority rule.\nA statement on behalf of the Tutu family described him as a man who “turned his own misfortune into a teaching opportunity to raise awareness and reduce the suffering of others.”"
  }
]