[
  {
    "headline": "Illegal mining: Senate summons minister over revenue losses",
    "summarized_story": "The Senate on Friday summoned the Minister of Mines and Steel Development, Olamilekan Adegbite, over activities of illegal miners which was leading to a great loss of the nation’s revenue.\nNkom had in his submissions before the joint committees said in 2019, N2.58bn revenue was generated and remitted to the Consolidated Revenue Fund.\n“These are apart from other companies carrying out illegal mining activities across the country that are not captured in your revenue generation.\nRoyalties and illegal mining are not under my purview and I cannot dabble into them.”The committee chairman then ordered the Clerk of the committee to summon the Minister of Mines and Steel Development for required interface on way out of the problem in the sector, particularly as regards illegal mining and low revenue generation.\nHe said, “The minister will have to appear before this committee for required interface on the way out of the problem in the sector."
  },
  {
    "headline": "Lekki, Lagos posh neighbourhood, now haven for crypto fraudsters, dating scammers – EFCC",
    "summarized_story": "The Economic and Financial Crimes Commission says it arrested 402 suspected Internet fraudsters in Lekki, Lagos, between April and June 2021.\nIt explained that 64 per cent of the suspects benefitted from dating scams to the tune of N8, 310,000; $349,290; £ 900; €10 and Cryptocurrency 0.17513.\nIt added that Badore had eight suspects while the neighbouring Ikoyi and Eko Atlantic had two and one suspects each.\n“Analysis of the data from the Cybercrime Section further shows that the dominant form of Internet crime is dating scam/online dating scam/romance scam.\n“A total of $12,512.49 was recovered from the e-wallet accounts of four suspects within the period,” Uwujaren said."
  },
  {
    "headline": "Ortom files N60bn defamation suit against Akume",
    "summarized_story": "By Peter Duru, MakurdiGovernor Samuel Ortom of Benue state, Friday filed a N60billion suit against the Minister of Special Duties and Inter-Governmental Affairs, Senator George Akume at the Makurdi High Court for defamation.\nMHC/268/2021 was filed by Mr. Okon Efut and four other lawyers and the writ of summons was backed by 17 paragraph statement of claim.\nGovernor Ortom in the suit is seeking N50 billion as general damages for libel and N10 billion as exemplary and aggravated damages.\nThe Governor also seeks a perpetual injunction restraining the defendant by himself or through any agent, servants or privies from similar or further publication of any defamatory statement against him.\nNo date has yet been fixed for the hearing of the matter."
  },
  {
    "headline": "We spent N203bn on doctors’ welfare, did everything humanly possible to stop strike —FG",
    "summarized_story": "They said the Residency Training Fund is not in 2021 budget.\n“They also needed the hazard allowance to be upgraded and demanded that states should domesticate Residency Training Act.\nGovernment pledged that the 2021 Residency Training Fund will be captured in the supplementary budget.\nWe also abolished bench fees for Residency Training for those doing specialty.\n“We told them that the Residency Training Fund is in the supplementary budget signed into law."
  },
  {
    "headline": "BREAKING: Unknown gunmen abduct father, son in Abuja; police launch manhunt",
    "summarized_story": "Unknown gunmen suspected to be kidnappers have abducted a man, Abdullahi Benda, and his 23-year-old son, Jibrin Abdullahi Benda at an Abuja community, Yangoji village in Kwali Area Council of Abuja.\nResidents of the area told Newsmen that the incident happened in the early hours of Friday, September 3, 2021.\nA resident said the kidnappers, who positioned themselves at strategic places, scaled the fence of the victim’s house.\nThe resident said the kidnappers forcefully destroyed the doors and went into the room and whisked away the man and one of his sons at gunpoint.\nHe said, “Yes, we are aware and efforts are being made by the command to rescue the victims.”Vanguard News Nigeria"
  },
  {
    "headline": "Breaking: Nigerian ‘hacker’ bags 5yrs imprisonment in US",
    "summarized_story": "In total, Muraina’s fraudulent tax returns using stolen identities sought refunds from the IRS exceeding $2.6 million from 2018 through 2020.\nThe 64% involved in the dating scam benefitted to the tune of N8, 310,000; $349,290 USD; £ 900; €10 and Cryptocurrency 0.17513.\nOther typologies of fraud identified include forgery, possession of fraudulent documents, spamming, credit card fraud, impersonation, rental scam, loan fraud, Business Email Compromise, Hacking, stealing, cheque scam, phishing, and money laundering.\nThe data also reveals gift cards, at 39%, as the prevalent method employed by the suspects to access their illicit funds.\nA total of $12, 512.49USD was recovered from the e-wallet accounts of four suspects within the period."
  },
  {
    "headline": "I didn’t pass vote of no confidence on Usman Baba – Masari",
    "summarized_story": "Governor Aminu Masari of Katsina State at no time passed a vote of no confidence on the Inspector-General of Police (IGP) Usman Baba.\nAlhaji Abdu Labaran, Director-General, Media to Masari, disclosed this in a statement on Friday in Katsina.\nThese clarifications came on the heels of reports suggesting that the governor passed a vote of no confidence on the IGP during his recent visit to Masari.\n“To our greatest surprise, the medium on Friday published the story with a leading headline that “Masari passes vote of no confidence on the IGP”.\nAccording to Labaran, the state government is still waiting for response from the medium before knowing what action to take."
  },
  {
    "headline": "Lawmakers who support legalisation of cannabis in Nigeria dare not return to their constituencies – Marwa",
    "summarized_story": "The chairman of the National Drug Law Enforcement Agency (NDLEA), Buba Marwa, has said National Assembly lawmakers who vote to support the legalisation of cannabis in the country, cannot dare return to their constituencies.\nThe lower chamber began moves to legalise cannabis in May 2021, in a bid to take advantage of its economic benefits.\nHowever, speaking on Friday after a courtesy visit to President Muhammadu Buhari in Abuja, Marwa said cannabis has destroyed a lot of lives.\n“We can never support legalisation and I don’t see how the national assembly would pass the act because I know 90% or more of the distinguished members of the national assembly know the implications of this legalisation.\n“They dare not go back to their constituencies if anyone signs legalisation because we’re seeing the implication on the ground."
  },
  {
    "headline": "Why bandits in North can’t seize Nigeria’s Tucano fighter jets – Shehu Sani",
    "summarized_story": "A socio-political activist, Shehu Sani, has disclosed why bandits in the North can not seize the newly-purchased Tucano fighter jets.\nSani, who is a former Kaduna Central Senator said bandits in the North can not take over the Tucano jets because they are not Talibans.\nIn a tweet, the former lawmaker explained that bandits use motorcycles to achieve their targets.\nBuhari to launch Tucanos weeks after delivery amid bandits, terrorists’ attacksAccording to Sani: “The terrorists and bandits in our Northern part of Nigeria don’t have the capacity to seize the newly purchased Tucano fighters, despite their show of anti aircraft capabilities.\nAmid the insecurity challenges, Nigeria recently took delivery of some Tucano fighter jets from the United States."
  },
  {
    "headline": "Cabinet reshuffle: Buhari did well, but he should sack other Ministers, SGF, NSA – APC Chieftain, Gololo",
    "summarized_story": "President Muhammadu Buhari had on Wednesday, replaced the two ministers, through a press briefing by his Media Adviser, Femi Adesina.\nThat is why I was not happy that he replaced the sacked Ministers with other serving Ministers who originally should be out of office too.\n“Their lack of performance has caused serious embarrassment to the government of President Buhari and our great party.\nIt would be recalled that, Gololo had in January 2021, called on President Buhari to sack his cabinet and inject fresh blood.\nGololo also advised that the SGF and the NSA should be removed, “to get the country out of corruption and regain international confidence.”"
  },
  {
    "headline": "Osinbajo charges AU member states to ratify AfCFTA protocols",
    "summarized_story": "Vice-President Yemi Osinbajo has urged African Union (AU) member states to ratify agreements under the Africa Continental Free Trade Area (AfCFTA).\nThese include protocols on free movement of persons, right of residence and right of establishment.\nOsinbajo noted the importance of well-negotiated rules of origin in the context of the free trade agreement, which he said was key to preventing trans-shipment and the deflection of trade.\nThe VP urged nations to adopt the right type of macroeconomic and industrial policies.\nOsinbajo advised MAN to involve itself in an advisory capacity to the government."
  },
  {
    "headline": "IGP reacts as police arrest 1,503 high-profile criminal suspects, rescue 393 victims",
    "summarized_story": "He said the IGP gave the commendation during a one-day official visit to Katsina State on Thursday, 2nd September, 2021.\nHe said the visit was part of efforts at carrying out on-the-spot security assessments in the State, and to mobilize members of the public and other credible stakeholders against crimes.\nThis, according to the statement, would boost the confidence of Police operatives in the Command and provide the needed leadership for onslaught against crimes and criminality.\n“The arrests include two hundred and sixty-seven (267) suspected Armed Robbers, three hundred and four (304) suspected Kidnappers, ninety-seven (97) bandits, amongst others.\nHe said there was great evidence in the interception and recovery of sophisticated weapons, including 4 GPMG, 37 AK47 rifles, 2 G3 rifles, 288 anti-aircraft ammunition and 118 AK47 ammunition."
  },
  {
    "headline": "Why God stopped talking to me in my early Christian life – Pastor Adeboye",
    "summarized_story": "The General Overseer of the Redeemed Christian Church of God, Pastor Enoch Adeboye, says he had his first Baptism of fire when he stopped hearing the voice of his creator.\nAdeboye recounted how he allowed his ego and pride made God avoid talking to him shortly after he got born again.\nHe tells me the road to ply in Lagos so that I can bypass hold up, most of you here know how terrible Lagos traffic is.\nI used to be an interpreter to the general overseer or general superintendent like we call it those days.\nAfter the conversation, God stopped speaking to me, I didn’t hear His voice again."
  },
  {
    "headline": "BBNaija: Angel’s dad replies Boma after 'biggest achievement' comment",
    "summarized_story": "The single dad on his Instagram page, @meyagy, on Friday stated that nobody has the right to dictate another person’s life.\nAngel will never, I repeat, never be intimidated.”@meyagy's comment comes a day after Boma told Angel that participating in the BBNaija reality tv show will be her biggest achievement in life.\nIn response, Angel told Boma that she will surely make it after the show, telling him that she will show him 'pepper.'\nAngel said, “You say that this will be my biggest achievement?\nDon’t ever in your life say that to me.”Annie’s Marriage Clash"
  },
  {
    "headline": "Nkechi Blessing reacts to 2baba, Annie Idibia’s marriage saga",
    "summarized_story": "Actress Nkechi Blessing has reacted to the ongoing saga between family of Tuface Idibia and his wife, Annie.\nThis is coming after the singer’s wife called him out on social media over an alleged affair with one of his baby mamas.\nReacting to the feud, Nkechi Blessing condemned the use of social media as a law court while emphasizing the damage it has caused in many relationships today.\n“No matter how pushed I am you ain’t hearing jack shit from me, I take my L and move d F**k on.\n“God forbid**This Evil app that the devil has hijacked is making marriage look like a bad thing, I refuse to allow an app that can be deleted tomorrow take the better part of my life, Never,” she said."
  },
  {
    "headline": "VIDEO: Paul Okoye reunites with family in Atlanta amid divorce saga",
    "summarized_story": "Paul Okoye a.k.a The Rudeboy of PSquare fame has surfaced in Atlanta, Georgia to meet his wife, Anita and their kids, amid stories of a family breakup.\nIn the video, simultaneously uploaded on Instagram by the couple, Paul arrives to pick the twin kids at an Atlanta secondary school, we bet, with his wife shooting the video.\nPaul’s appearance in Atlanta may have rubbished the stories that the couple that married in 2014 were about to break up.\nThe Nation recently reported that Anita Okoye filed for divorce from her husband, Paul Okoye of defunct music group P-Square citing lack of mutual conjugal relationship to lack of communication and irreconcilable differences.\nDays ago, Paul Okoye had begged for peace for the Okoye family in the social media."
  },
  {
    "headline": "I bought house worth N450m on my birthday - Bobrisky",
    "summarized_story": "Popular crossdresser, Bobrisky who never gets tired of bragging has again told his fans and followers that he bought a house worth 450 million naira on his birthday.\nThe male barbie in an Instagram post further disclosed that the house would be unveiled in October, without really giving an actual date.\nHe, however, said only billionaires are invited to the unveiling party.\n“My house warming party is in October, another big party coming up Aso ebi is (200k)I bought a house for my 30th birthday worth over 450 million I’m opening it in October, fans my Aso ebi is 200,000.\nStrictly billionaire party only”"
  },
  {
    "headline": "IGP commends Katsina Police command for achievements in crime fighting",
    "summarized_story": "The IGP noted that the operational strategies currently being implemented by the Force to stabilize security order across the country and improve public safety has began to yield positive and significant results.\nThe arrests include two hundred and sixty-seven (267) suspected Armed Robbers, three hundred and four (304) suspected Kidnappers, ninety seven (97) bandits, amongst others.\nHe also stated that Police operatives also successfully rescued three hundred and ninety-three (393) kidnapped victims and have since reunited them with their families and communities.\nThe IGP also confirmed that the Force has made tremendous success in breaking the weapon supply chain to bandits and other criminal elements in the State.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Breaking: Anambra Guber: Appeal Court Declares Ozigbo PDP’s Candidate",
    "summarized_story": "The court awarded a cost of ten million against the Senator Ugochukwu Ubah for being a meddlesome interloper.\nIn a dramatic twist, Justice Nwabunike made away with the case file preventing the defendants from obtaining copies of the judgement for their appeal.\nIn an unprecedented move, the PDP had slammed Nwabunike labelling his ruling as “a black-market judgement which cannot stand in appeal”.\nAlready regarded as a frontrunner in the November poll, Valentine Ozigbo, who describes himself as a child of grace, is the immediate past President and Group CEO of Transcorp Plc.\nHis emergence as the candidate of the PDP in the keenly contested primary is regarded as one of the most inspiring stories in Nigeria’s recent political history."
  },
  {
    "headline": "You lack capacity to police Katsina, Masari tells IGP",
    "summarized_story": "Masari said the policemen in the were not enough to arrest the the security situation in the state.\n“Katsina State has a population of about eight million people and how many policemen do we have in Katsina State?\n“From my assessment of policemen in the local government areas, I don’t think we have up to 3,000 policemen in the entire state.\nThey are in South-South battling militants, they are in the South-East battling IPOB, they are in North-East battling Boko Haram and ISWAP and insurgents and they are in the North-West battling bandits.\n“I am in Katsina on a working visit and I will also meet with other arms of security services to see how best to tackle the security situation in the states."
  },
  {
    "headline": "FG mulls compulsory COVID-19 vaccination for its workers",
    "summarized_story": "From Fred Ezeh,, Abuja and Oluseye Ojo, IbadanFederal civil servants may soon be subjected to compulsory COVID-19 vaccination as part of plan to weaken the strength of the disease in Nigeria.\nThis is as government assured that sufficient dose of the vaccine would be made available before the policy on compulsory vaccination for civil servants would be implemented.\nMinister of State for Health, Olorunnimbe Mamora, said the Federal Government was working towards increasing domestic resources for the health sector by pooling ‘sin’ taxes on tobacco and other products.\n“One doubts if Nigeria can yet boast of having 10 million vaccines available for a country with over 200million population.\nIf the Federal Government makes available about 250 million vaccines and Nigerians, who are yet to be vaccinated refused the COVID-19 vaccines, then the government can be justified in its action."
  },
  {
    "headline": "NDDC forensic audit report: Buhari talks tough on mismanaged N6trn",
    "summarized_story": "From Godwin Tsa, AbujaPresident Muhammadu Buhari, yesterday, received the forensic audit report of the Niger Delta Development Commission(NDDC) with a vow to prosecute those who mismanaged about N6trillion allocated to the commission for projects.\nPresident Buhari specifically queried the operation of 362 accounts by the commission without proper reconciliation.\nHe also expressed concerns with multitudes of NDDC’s bank accounts amounting to 362 and lack of proper reconciliation of accounts.\nThe Federal Government will in consequence apply the law to remedy the deficiencies outlined in the audit report as appropriate.\nThe appointment of members of the board of the NDDC had been suspended until the release of the audit report."
  },
  {
    "headline": "Lekki Now Hotbed of Cyber Crime, Says EFCC",
    "summarized_story": "Between April and June, 2021, the Advance Fee Fraud and Cyber Crime Sections of the Command recorded a total of 402 internet-related fraud arrests.\nWhile the Advance Fee Fraud Section was responsible for 243 arrests, the cyber crime section executed 18 sting operations which resulted in 159 arrests, from which 13 convictions have so far been recorded.\nA statement by the commission affirmed that of the 159 suspects arrested by the cyber crime section, 70 are from Lekki, comprising communities such as Ajah, Badore, Victoria Garden City, Sangotedo and Oniru.\nAnalysis of the data from the cyber crime section further shows that the dominant form of internet crime is dating scam/online dating scam/romance scam.\nThe 64% involved in the dating scam benefitted to the tune of N8, 310,000; $349,290 USD; £ 900; €10 and cryptocurrency 0.17513."
  },
  {
    "headline": "Anambra Guber: Appeal Court Declares Ozigbo PDP’s Candidate",
    "summarized_story": "Knocks lawyers for forum shoppingSays INEC should stop acting on orders of trial courtBy Alex EnumahThe Court of Appeal Abuja has declared Valentine Oziigbo as the authentic candidate of the People’s Democratic Party (PDP) in the forthcoming November 6 governorship election in Anambra State.\nThe Court in a unanimous decision set aside the decision of Justice A. O. Nwabunike of a High Court of Anambra State which had earlier declared Senator Ugochukwu Uba as PDP candidate.\nIn the unanimous decision delivered by President of the Court of Appeal, Justice Monica Dongban-Mensem, the appellate court, held that the primary election held at the Professor Dora Akunyuli Women Center, Awka, which produced Ozigbo as PDP candidate, was conducted in line with the law and the PDP guidelines.\nWhile declaring as an aberration the parallel primary held at saint Paul University, it berated Justice Nwabunike for sitting as an appellate court over the judgment of Justice Adeniyi of the Federal Capital Territory (FCT) High Court.\nThe Court accordingly awarded a cost of N10 million against Uba in favour of Ozigbo."
  },
  {
    "headline": "Forensic Audit Uncovers Colossal Mismanagement of N6trn NDDC Funds",
    "summarized_story": "To this end, the president has directed that the report of the forensic audit on the NDDC be forwarded to the Federal Ministry of Justice for necessary action.\n“It is evident that considerable resources have been channeled by the federal government to the development of the Niger Delta from 2001 to 2019.\n“The essence of the forensic audit is to ensure probity and accountability in the use of public funds.\nSpecifically, Buhari disclosed that his administration would apply the law to remedy the deficiencies outlined in the audit report as appropriate.\nHe added: “A Personnel Audit and Review of the governance and organisational structure of NDDC was also carried out."
  },
  {
    "headline": "Osinbajo: African Cross-border Trade Worth $93bn",
    "summarized_story": "*Says AfCFTA is indispensable if industrial development is to take off on the continentDeji Elumoye in AbujaThe Vice President, Prof. Yemi Osinbajo yesterday estimated that the African cross-border informal trade is worth $93 billion.\nThis is just as the vice president begins a four-day official visit to Arusha, Tanzania today.\nIn other words, while our manufacturing industries must be nurtured and supported, they cannot remain infants forever”.\nSimilarly, South African car manufacturers already buy leather for car seats from Botswana.\nMeanwhile, the Vice President is going on a brief official visit to Arusha in Tanzania from Thursday (today) to Monday."
  },
  {
    "headline": "Masari: Nigeria’s Security Forces Overstretched, Poorly Armed",
    "summarized_story": "“While the South-South and South East are stabilising, the situation in the North Central and the North West is getting worse.\n“The counter insurgency efforts of the troops through kinetic and non-kinetic operations compelled the terrorists to surrender in large numbers.\n“Troops within the period arrested criminal informants/collaborators, whose activities have been causing setbacks for own troops’ operations in the zone.\n“During the operations, troops discovered and deactivated a total of 33 illegal refining sites with 46 illegal refining units, 94 boiler ovens and nine reservoirs.\nBrigadier-General Onyeuko said the Armed Forces of Nigeria remained steadfast in the fight against all forms of criminality in different parts of the country."
  },
  {
    "headline": "BREAKING: Nigerian Government Orders Telcos To Shut Down Mobile Phone Services In Zamfara As Bandits Take Over State",
    "summarized_story": "The Nigerian government has ordered all telecom operators to shut down their networks in Zamfara State.\n“The pervading security situation in Zamfara State has necessitated an immediate shutting down of all telecommunications service in the state from today September 03, 2021.\n“This is to enable relevant security agencies carry out required activities towards addressing the security challenge in the state, in line with the requirement, Globacom is hereby directed to shut down all sites in Zamfara State and any site(s) in neighboring state that could provide telecommunications service in Zamfara State.\nThe Zamfara State Government had last Friday also announced some new measures aimed at tackling the growing activities of bandits in the state.\nSimilarly, the government suspended the transportation of livestock to and from the state, saying the transportation of food across the state and outside Zamfara must be verified."
  },
  {
    "headline": "BREAKING: Nigerian Government Orders Telcos To Shut Down Mobile Phone Services In Zamfara As Bandits Take Over State",
    "summarized_story": "The Nigerian government has ordered all telecom operators to shut down their networks in Zamfara State.\n“The pervading security situation in Zamfara State has necessitated an immediate shutting down of all telecommunications service in the state from today September 03, 2021.\n“This is to enable relevant security agencies carry out required activities towards addressing the security challenge in the state, in line with the requirement, Globacom is hereby directed to shut down all sites in Zamfara State and any site(s) in neighboring state that could provide telecommunications service in Zamfara State.\nThe Zamfara State Government had last Friday also announced some new measures aimed at tackling the growing activities of bandits in the state.\nSimilarly, the government suspended the transportation of livestock to and from the state, saying the transportation of food across the state and outside Zamfara must be verified."
  },
  {
    "headline": "It’s Absurd Nigeria Still Relies On 1999 Constitution Imposed By Military 22 Years After — Nnamdi Kanu’s American Lawyer",
    "summarized_story": "Bruce Fein, the US-based lawyer to Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), has said it is absurd that Nigeria still uses the 1999 constitution although it was imposed on the people by a military dictator.\nBruce FeinKanu had remained in detention since he was re-arrested by Nigerian authorities in collaboration with others outside the country.\nThe court had earlier ordered that his lawyers should be granted a routine visit to interact with the separatist leader while in detention.\nBut on Thursday, the DSS had denied the pair access despite meeting formal notification and existing procedures on visitation.\nSpeaking during the interview, Fein condemned the disregard for human rights and due process in Nigeria by government institutions."
  },
  {
    "headline": "It’s Absurd Nigeria Still Relies On 1999 Constitution Imposed By Military 22 Years After — Nnamdi Kanu’s American Lawyer",
    "summarized_story": "Bruce Fein, the US-based lawyer to Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), has said it is absurd that Nigeria still uses the 1999 constitution although it was imposed on the people by a military dictator.\nBruce FeinKanu had remained in detention since he was re-arrested by Nigerian authorities in collaboration with others outside the country.\nThe court had earlier ordered that his lawyers should be granted a routine visit to interact with the separatist leader while in detention.\nBut on Thursday, the DSS had denied the pair access despite meeting formal notification and existing procedures on visitation.\nSpeaking during the interview, Fein condemned the disregard for human rights and due process in Nigeria by government institutions."
  },
  {
    "headline": "It’s Absurd Nigeria Still Relies On 1999 Constitution Imposed By Military 22 Years After — Nnamdi Kanu’s American Lawyer",
    "summarized_story": "Bruce Fein, the US-based lawyer to Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), has said it is absurd that Nigeria still uses the 1999 constitution although it was imposed on the people by a military dictator.\nBruce FeinKanu had remained in detention since he was re-arrested by Nigerian authorities in collaboration with others outside the country.\nThe court had earlier ordered that his lawyers should be granted a routine visit to interact with the separatist leader while in detention.\nBut on Thursday, the DSS had denied the pair access despite meeting formal notification and existing procedures on visitation.\nSpeaking during the interview, Fein condemned the disregard for human rights and due process in Nigeria by government institutions."
  },
  {
    "headline": "Umahi: Secondus was naive — I knew he'd be removed as PDP chairman",
    "summarized_story": "David Umahi, governor of Ebonyi, says he knew beforehand that Uche Secondus, embattled chairman of the Peoples Democratic Party (PDP), would be removed from his position.\nIn compliance with the most recent court order, the party’s national working committee (NWC) named Yemi Akinwonmi, national deputy chairman (south), as the acting national chairman.\n“I won’t say I’m happy with what is happening to the chairman — Secondus — because he was a bit naive.\nI was told that the working committee, especially Secondus, was going to be unduly removed to give one man or two the leverage of owning the PDP.\nI said that should not happen, and I told Secondus and I told all the working committee when they visited me in Abuja."
  },
  {
    "headline": "Umahi: Secondus was naive — I knew he'd be removed as PDP chairman",
    "summarized_story": "David Umahi, governor of Ebonyi, says he knew beforehand that Uche Secondus, embattled chairman of the Peoples Democratic Party (PDP), would be removed from his position.\nIn compliance with the most recent court order, the party’s national working committee (NWC) named Yemi Akinwonmi, national deputy chairman (south), as the acting national chairman.\n“I won’t say I’m happy with what is happening to the chairman — Secondus — because he was a bit naive.\nI was told that the working committee, especially Secondus, was going to be unduly removed to give one man or two the leverage of owning the PDP.\nI said that should not happen, and I told Secondus and I told all the working committee when they visited me in Abuja."
  },
  {
    "headline": "Buhari has approved construction of first-ever NDLEA barracks, says Marwa",
    "summarized_story": "Buba Marwa, chairman of the National Drug Law Enforcement Agency (NDLEA), says President Muhammadu Buhari has approved the construction of barracks for operatives of the agency.\nAdvertisementMarwa disclosed this to state house correspondents on Friday, after briefing President Muhammadu Buhari on the activities of the agency at the presidential villa in Abuja.\nThe NDLEA boss said the building of barracks for operatives of the agency is par of efforts to protect officers and their families.\nAll other agencies — armed forces, police, customs, immigration, road safety — all have estates and barracks, except the NDLEA; we still don’t have barracks,” he said.\n“As far as activities in the drug supply reduction sphere are concerned, we have seized drugs worth billions of naira — over N100 billion."
  },
  {
    "headline": "Buhari has approved construction of first-ever NDLEA barracks, says Marwa",
    "summarized_story": "Buba Marwa, chairman of the National Drug Law Enforcement Agency (NDLEA), says President Muhammadu Buhari has approved the construction of barracks for operatives of the agency.\nAdvertisementMarwa disclosed this to state house correspondents on Friday, after briefing President Muhammadu Buhari on the activities of the agency at the presidential villa in Abuja.\nThe NDLEA boss said the building of barracks for operatives of the agency is par of efforts to protect officers and their families.\nAll other agencies — armed forces, police, customs, immigration, road safety — all have estates and barracks, except the NDLEA; we still don’t have barracks,” he said.\n“As far as activities in the drug supply reduction sphere are concerned, we have seized drugs worth billions of naira — over N100 billion."
  },
  {
    "headline": "Marwa: Any lawmaker who votes to legalise cannabis can’t return home",
    "summarized_story": "Buba Marwa, chairman of the National Drug Law Enforcement Agency (NDLEA), says members of the national assembly who vote to support the legalisation of cannabis cannot dare return to their constituencies.\nAdvertisementThe house of representatives had, in May 2021, began moves to legalise cannabis to take advantage of its economic benefits.\nMarwa said the World Health Organization (WHO) has confirmed the dangers of cannabis to the brain, adding that Nigeria is the highest consumer of substances.\nAnd up to this point, science has not developed up to the point where it can remove the THC in cannabis to zero,” Marwa said.\n“We can never support legalisation and I don’t see how the national assembly would pass the act because I know 90% or more of the honorable and distinguished members of the national assembly know the implications of this legalisation."
  },
  {
    "headline": "With Awabah, Tunji Andrews wants to make pensions as popular as banking",
    "summarized_story": "Awabah Nigeria Co-founder, Tunji Andrews.\nThe micro pension scheme was formally introduced in 2019 but is yet to gain traction.\n“When I heard about the new micro pension scheme two years ago, I was excited as I had been thinking about pensions.\n“The bigger goal is to create a larger awareness of micro pensions in Africa,” Andrews said.\n“The lack of micro pension licenses can be a drawback as we believe we are best positioned to drive the product."
  },
  {
    "headline": "Fintech Focus: The link between Open Banking and financial inclusion",
    "summarized_story": "In their place, fintech firms are extending access to financial services in these areas through agent networks and mobile money wallets.\n“Open Banking is a major step forward in solving restricted access to financial services in Nigeria,” said Orioke.\nNigeria’s central bank also recently launched draft regulations for Open Banking, which establishes principles for data sharing across the banking and payments ecosystem.\nOpen Banking could be the ultimate solution to all current difficulties with access to financial services in Nigeria,” Orioke said.\nConsidering its numerous benefits and rapid adoption, Open Banking could potentially revolutionise the financial services ecosystem in Nigeria and go down as one of the most important innovations in the financial inclusion drive."
  },
  {
    "headline": "Ridelink raises $150k pre-seed to build e-logistics technology for East Africa",
    "summarized_story": "Ridelink, an Ugandan e-logistics platform, has just closed a $150k pre-seed investment round to improve its technology and double down on its marketing efforts.\nThe investment was birthed from the startup’s partnership with Ortus Africa Capital, Omidyar Network and African Leadership Academy’s Young Entrepreneurs Fund(Anzisha).\nFounded in 2017 by Daniel Mukisa, Ridelink operates an e-logistics platform developed to seamlessly connect SMEs to a network of transport operators.\nThough Ridelink launched its operation in Uganda, it has since expanded and serves business hubs across East Africa – in the urban, peri-urban and rural Uganda, Kenya and Tanzania.\n“The Young Entrepreneurs Fund is designed to incentivise co-investments into graduates of our programs like Daniel who have chosen to become career entrepreneurs.” said Thokoza Mjo of the Anzisha Prize, who manages the fund."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "On the heels of $40 million Series A in July — one of the largest fundings in the Middle East and North Africa (MENA)..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Understanding why customers act the way they do",
    "summarized_story": "This is the reason why a business needs to consistently reinvent itself to maintain its relevance.\nArchetypal images: the internal tension can trigger specific emotions and images in the customer’s psyche, activating an archetype that leads to set patterns of behavior.\nAlthough the customer’s tension may be reduced, it’s not eliminated.\n… customers’ needs changeJust like your needs and your criteria for fulfilling those needs tend to change over time, it is important for you to understand that, so do those of your customers.\nGetting to know your customers’ tensions isn’t always easy."
  },
  {
    "headline": "Telcos’ data business still struggling to shake off recession",
    "summarized_story": "Telcos’ data business still struggling to shake off recessionOperators in the telecommunication industry are yet to find a path to growth in their data business as the latest industry report shows that internet subscriptions declined by 430,989 in July.\nThe number of internet subscriptions lost between November 2020 and July 2021 now amounts to 15.13 million.\nThe last time the industry recorded internet…"
  },
  {
    "headline": "Nigeria set to miss WHO’s month-end virus vaccination target",
    "summarized_story": "Africa’s largest economy is likely to miss the goal set by the World Health Organisation (WHO) to vaccinate 10 percent of its most vulnerable population against COVID-19 by the end of September.\nNigeria has only been able to fully vaccinate 1.44 million people which is equivalent to 0.7 percent of the entire populace, according to WHO data.\nData from the WHO also shows that at the current inoculations and vaccine delivery rate, 41 other African countries will miss the goal set by the World Health Assembly in May.\nWhile there is an increase in the upsurge of different covid 19 variants, the vaccination of a larger percentage is imperative.\nNigeria aims to inoculate 40 percent of its 200 million people by the end of 2021 and 70 percent by 20"
  },
  {
    "headline": "Warri Kingdom Gets New Prime Minister, As Olu Revalidates Ariyo, 10 others as chiefs – Nigerian Observer",
    "summarized_story": "Warri Kingdom Gets New Prime Minister, As Olu Revalidates Ariyo, 10 others as chiefsShare FacebookTwitterStumbleuponLinkedInPinterestWarri – Following a public notice dated September 1 and signed by the Olu of Warri, Ogiame Atuwaste III, dissolving the traditional council, committees and sub-committees across Warri kingdom, a revalidation and confirmation exercise began Thursday.\nIt will be recalled, that Chief Ayiri Emami, held the position of ‘Ologbotsere’ and served as prime minister of Warri kingdom during the reign of Ogiame Ikenwoli, the 20th Olu of Warri who was crowned in 2015 and later joined his ancestors in 2020.\nThe first class monarch during the colourful ceremony, placed beads around the neck of the chiefs and handed them swords, signifying their readmission into the Warri Council of Chiefs.\nShortly after the ceremony, elated Iyatsere expressed delight over the new turn of events in the kingdom, saying ,“I feel very happy because Warri kingdom has come back to its feet.\n“Today, I have been decorated as the most Senior Chief and traditional Prime Minister of Warri kingdom, so I am happy that Warri kingdom has come back to its feet again”."
  },
  {
    "headline": "Edo govt warns PUWOV officers against abuse of power, extortion of traders, drivers, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…urges citizens to report erring officialsThe Edo State Government has cautioned officers of the Public Works Volunteers Scheme (PUWOV) against extortion and abuse of power in the discharge of their duties.\nIn a statement, the State Coordinator of PUWOV, Mukhtar Yusuf-Osagie, urged citizens to call or chat the PUWOV helplines on 08132030846 or 09150322999 to report erring officials.\n“We urge you to call to report any PUWOV official found extorting money from drivers and traders on the road; you can identify each official by the number on their reflective jacket as all officials have a unique identification number at the back of their reflective jacket,” he noted.\nThe statement further reads: “Call and report any PUWOV official in an unlawful act of giving priority to commercial drivers and traders (i.e.\n“Also report any PUWOV staff found harassing or victimizing a driver/traders; official and patrol team in a wrongful mode of operations and enforcement as they are expected to be civil in operations and dealing with offenders; official on operation without the PUWOV reflective jacket."
  },
  {
    "headline": "COVID-19 3rd wave: Death of unvaccinated persons rise to 19, as Edo records four more deaths, 28 new cases – Nigerian Observer",
    "summarized_story": "COVID-19 3rd wave: Death of unvaccinated persons rise to 19, as Edo records four more deaths, 28 new casesShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State has recorded the deaths of four more persons who have not been inoculated with the COVID-19 vaccines, bringing the total number of unvaccinated persons who have died in the third wave of the pandemic in the state to 19.\nHead of the state’s COVID-19 Case Management, Dr Ebomwonyi Osagie, disclosed this on Friday during a press briefing at the Government House, in Benin City.\nOsagie, who reiterated the need for citizens to get vaccinated to get protected against the deadly virus, noted that the state also recorded 28 new cases and zero recoveries.\nAccording to him, “We have recorded 28 new cases of COVID-19, no recoveries, and four more deaths of unvaccinated persons within the last 24 hours.”On his part, Permanent Secretary, Edo State Ministry of Health, Dr. Osamwonyi Irowa, said efforts are being made to vaccinate teachers ahead of school resumption.\nIrowa further said there was the need for parents to also get vaccinated so that they don’t get infected with the virus transmitted through their children."
  },
  {
    "headline": "Obaseki seeks support of Nigerian Air Force to tackle insecurity – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for support of the Nigerian Air Force to tackle insecurity in the state.\nThe governor made the appeal in a farewell message to the outgoing Commander, 107 Air Maritime Group of the Nigerian Air Force, Commodore Emmanuel Effiom, at the Government House in Benin City.\nWhile commending the Commander, Obaseki said: “The level of work and commitment which you have shown generally are commendable.\nI recall your role during the #EndSARS demonstrations and how you provided leadership and support during that period.\n“You understand the security challenges of this state; you know what we have been up to and what we need to do."
  },
  {
    "headline": "World Cup Qualifiers: Iheanacho shoots Super Eagles to victory over Liberia",
    "summarized_story": "Two first-half goals by Kelechi Iheanacho saw the Super Eagles soaring to the top of their qualifying group that includes Cape Verde and the Central Africa Republic.\nBut as the game progressed, the Super Eagles began to make in-roads for an opening goal.\nThe Super Eagles almost took the lead moments after, but Joe Aribo failed to hit the target after he was nicely set up by Alex Iwobi.\nThe Super Eagles continued with the pressure after the break but they could not add to their tally.\nSuper Eagles head coach Gernot Rohr made double substitutions in the 77th minute with Paul Onuachu and Samuel Kalu replacing Osimhen and Moses Simon."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Osun APC LG Congress: TOP Urges APC Members To Vote For Credible Candidates",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe Osun Progressives (TOP), a caucus within the All Progressives Congress (APC) in Osun state, has called on members of the party to turn out in their numbers and vote for their chosen leaders in Local Government Congress, holding tomorrow, September 4, 2021.\nHe urged members of the APC and those of TOP in particular to be peaceful and orderly notwithstanding whatever provocation brought to them.\nAdebiyi who noted that the Osun Progressives has fulfilled all righteousness to qualify its members to participate in tomorrow’s local government congress, said he was convinced that all the candidates of TOP will emerge victorious in the exercise.\nAccording to him, the commitments to rebuilding and re-energising Osun APC has been taken sacrosanct for the Osun Progressives in spite of the impunity embarked upon by the Governor’s group, IleriOluwa, in executing the ongoing congress.\nAdebiyi assured all members of the group that the security and INEC have been duly notified of exercise by the Osun Progressives which is contesting tomorrow’s local government congress in 28 local governments of the state."
  },
  {
    "headline": "Osun: Oyetola committed to workers’ welfare – Tunde Adedeji",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe Governor of Osun State, Mr Aregboyega Oyetola is unrelenting towards ensuring the overall welfare of workers across the state.\nThe Chairman Local of the Government Service Commission in the State of Osun, Elder Tunde Adedeji stated this during his visitation to Local Government Areas in Isokan and Irewole, including Isokan South Local Council Development Area, Isokan Local Government Area, Ikoyi Local Government Area, Apomu, Irewole Local Government Area, Ikire and Irewole North Local Council Development area, Wasimi.\nHe stressed that the state helmsman runs a people-centered administration, while charging the workers to be disciplined and dedicated to duty so as to compliment the effort of the government.\nAlso, the Cordinating Director of Local Government Service Commission, Bar.\nLekan Babalola encouraged workers to ensure that they were fully vaccinated, saying they must observe COVID-19 protocol and promote the culture and economy of the state by wearing Adire attire on Thursdays as directed by Governor Oyetola."
  },
  {
    "headline": "Insecurity: El-Rufai bans transportation of livestock from Kaduna",
    "summarized_story": "Amid growing incidents of banditry in the state, Kaduna State governor, Nasir El-Rufai has banned the transportation of livestock from the state to other parts of the country as part of efforts to tackle the menace.\nThe governor who stated this in a statement issued on Thursday in Kaduna by the Commissioner for Internal Security and Home Affairs, Samuel Aruwan, also prohibited the transportation of livestock from other parts of the country to state.\n“After wide consultations and thorough security reviews, the Kaduna State Government has banned the transportation of livestock from the state to other states in the country,” the statement said.\n“This ban also prohibits the transportation of livestock into Kaduna state from other states.\n“Furthermore, the Kawo weekly market, which usually holds every Tuesday in Kaduna North LGA, has been suspended with immediate effect."
  },
  {
    "headline": "Nigerian Customs seize donkey hides, charcoal worth N644m",
    "summarized_story": "The Comptroller General of Strike Force, Zone A, Nigerian Customs Service (NCS) Ahmadu Shuaibu, says the unit has intercepted N643.73 million worth of poisonous Donkey hides and skin, charcoal, and wood already kept in a warehouse in Apapa set to be moved to the Apapa port for export.\nShuaibu who made the disclosure while briefing the press at Ikodoru over the seizures, said the seized items were discovered stacked in a warehouse not too far from Apapa port and that those behind the illegal storage took to their heels on sighting the Customs team.\nAccording to him, the export prohibition guideline is in tandem with the Federal Government’s policies for the protection of endangered species, protection of the local economy and to promote the National Forest Policy that was approved by the Federal Executive Council, which according to him, is aimed at greatly assisting the nation’s sustainable management of its vast forest resources against deforestation."
  },
  {
    "headline": "Why We Lost Some Lawmakers To APC – APGA",
    "summarized_story": "The Jude Okeke-led faction of the All Progressives Grand Alliance (APGA), has explained the reasons why lawmakers in the party defected to All Progressive Congress (APC).\nAccording to him, the desperate attempt to impose Chukwuma Soludo as the party’s flagbearer in the state will surely boomerang.\nADVERTISEMENTThe statement reads” we have noted with dismay and great concern the mass defection of lawmakers elected on the platform of our dear party, the All Progressives Grand Alliance (APGA) in the Anambra State House of Assembly to the All Progresives Congress (APC).\n“The mass defection is a clear indication that our party, APGA, is losing its grip of the grassroots where real politicking is.\n“It is clear that Umeoji is the candidate that has mass appeal among party members and in the state in general."
  },
  {
    "headline": "Why We Lost Some Lawmakers To APC – APGA",
    "summarized_story": "The Jude Okeke-led faction of the All Progressives Grand Alliance (APGA), has explained the reasons why lawmakers in the party defected to All Progressive Congress (APC).\nAccording to him, the desperate attempt to impose Chukwuma Soludo as the party’s flagbearer in the state will surely boomerang.\nADVERTISEMENTThe statement reads” we have noted with dismay and great concern the mass defection of lawmakers elected on the platform of our dear party, the All Progressives Grand Alliance (APGA) in the Anambra State House of Assembly to the All Progresives Congress (APC).\n“The mass defection is a clear indication that our party, APGA, is losing its grip of the grassroots where real politicking is.\n“It is clear that Umeoji is the candidate that has mass appeal among party members and in the state in general."
  },
  {
    "headline": "Why Lawmakers Won’t Support Legalisation Of Cannabis – Marwa",
    "summarized_story": "Marwa disclosed this to State House correspondents after meeting with President Muhammadu Buhari at the Presidential Villa, Abuja.\nADVERTISEMENTHe said, “Now, the World Health Organisation itself has declared cannabis affects the brain, alters brain function.\nAnd up to this point, science has not developed up to the point where it can remove the THC in cannabis to zero.\nAll other agencies, armed forces, police, customs, immigration,road safety all have estates, and barracks, except the NDLEA, we still don’t have barracks.\nEqually, messages come through family, through colleagues, and sometimes people at random who we don’t know but live in the territory."
  },
  {
    "headline": "Why Lawmakers Won’t Support Legalisation Of Cannabis – Marwa",
    "summarized_story": "Marwa disclosed this to State House correspondents after meeting with President Muhammadu Buhari at the Presidential Villa, Abuja.\nADVERTISEMENTHe said, “Now, the World Health Organisation itself has declared cannabis affects the brain, alters brain function.\nAnd up to this point, science has not developed up to the point where it can remove the THC in cannabis to zero.\nAll other agencies, armed forces, police, customs, immigration,road safety all have estates, and barracks, except the NDLEA, we still don’t have barracks.\nEqually, messages come through family, through colleagues, and sometimes people at random who we don’t know but live in the territory."
  },
  {
    "headline": "2023: Benue Will Be My Priority – Igbawua",
    "summarized_story": "Top governorship aspirant on tbe platform of the Peoples Democratic Party (PDP) in Benue State and immediate-past Chief Comissioner of Public Complaints Commission (PCC), Hon.\nChille Igbawua, has assured that if elected in 2023, his administration will streghthen the traditional institutions through budgetry provisions such that would eliminate financial incumberances to allow them respond promptly to situations related to their constitutional mandate.\nIn his response, the Tor Kwande expressed happiness that Hon.\nIgbawua has no record of inefficiency and criminal behaviour in the state, national and international, adding that the promise to restructure the settlement pattern of the Benue people stands amongst the other good intentions of Igbawua if elected.\nThe royal father expressed delight that his council members have all give good accounts and testimonies about the aspirant, adding that his international exposure will have a positive influence on his administration if elected as Benue governor even as he offered royal blessings on Igbawua."
  },
  {
    "headline": "ASUU heads to court as DSS smashes professor’s car windscreen",
    "summarized_story": "The Kano Zone of ASUU has said it will institute legal action against the Department of State Service over an alleged assault of one of its members.\nChairman of the Ahmadu Bello University chapter of the union, Prof. Rabiu Nasiru, made the declaration at a news conference he addressed on Friday in Zaria, Kaduna State.\nHe alleged that the DSS assaulted one Prof. Abdulkadir Mohammed, the Kano Zonal Coordinator of the union while on a union assignment.\nProf. Nasiru said that operatives of the DSS assaulted Prof. Mohammed while he was travelling to Katsina in his personal vehicle along Hadejia Road bye-pass in Kano.\nThe Kano Zone of ASUU comprises Ahmadu Bello University, Zaria, Bayero University Kano, Kano State University Wudil, Kaduna State University, and Federal University Dutsinma, Katsina State."
  },
  {
    "headline": "ASUU heads to court as DSS smashes professor’s car windscreen",
    "summarized_story": "The Kano Zone of ASUU has said it will institute legal action against the Department of State Service over an alleged assault of one of its members.\nChairman of the Ahmadu Bello University chapter of the union, Prof. Rabiu Nasiru, made the declaration at a news conference he addressed on Friday in Zaria, Kaduna State.\nHe alleged that the DSS assaulted one Prof. Abdulkadir Mohammed, the Kano Zonal Coordinator of the union while on a union assignment.\nProf. Nasiru said that operatives of the DSS assaulted Prof. Mohammed while he was travelling to Katsina in his personal vehicle along Hadejia Road bye-pass in Kano.\nThe Kano Zone of ASUU comprises Ahmadu Bello University, Zaria, Bayero University Kano, Kano State University Wudil, Kaduna State University, and Federal University Dutsinma, Katsina State."
  },
  {
    "headline": "Town planners rank Lagos as most planned state",
    "summarized_story": "The Nigerian Institute of Town Planners passed the vote of confidence on Lagos, noting that the State had gone far ahead of others in domesticating the national town planning legislation and setting up administrative structures to coordinate its planning in accordance with the laws.\nSanwo-Olu acknowledged the Institute’s feedback on the State’s town planning effort, saying the progress indicated Lagos was on the right track towards improving livability for its residents.\nHe said: “We fully understand how critical the town planning profession is to our development.\n“I welcome the generous feedback from the Institute of Town Planners, which commended Lagos Government on the progress we have recorded so far after domesticating national Town Planning laws.\nThe Town Planners’ president said the recruitment of 70 professional town planners into the civil service was another pace-setting decision taken by the Lagos Government in achieving coordinated development in the State."
  },
  {
    "headline": "Town planners rank Lagos as most planned state",
    "summarized_story": "The Nigerian Institute of Town Planners passed the vote of confidence on Lagos, noting that the State had gone far ahead of others in domesticating the national town planning legislation and setting up administrative structures to coordinate its planning in accordance with the laws.\nSanwo-Olu acknowledged the Institute’s feedback on the State’s town planning effort, saying the progress indicated Lagos was on the right track towards improving livability for its residents.\nHe said: “We fully understand how critical the town planning profession is to our development.\n“I welcome the generous feedback from the Institute of Town Planners, which commended Lagos Government on the progress we have recorded so far after domesticating national Town Planning laws.\nThe Town Planners’ president said the recruitment of 70 professional town planners into the civil service was another pace-setting decision taken by the Lagos Government in achieving coordinated development in the State."
  },
  {
    "headline": "Kaduna deploys electronic voting machines for council polls, first in Nigeria",
    "summarized_story": "Kaduna State will use electronic voting machines for its local government elections which hold today, Saturday, 4 September in all the 23 local councils.\nIn 2018, Kaduna also used electronic voting to conduct its council polls, becoming the first state to do so in Nigeria and the second in Africa, after Namibia.\nShe stated that KADSIECOM therefore acquired electronic voting machines which were successfully used in 2018.\nBriefing journalists, Dr. Dikko-Audu explained that the electronic voting machines used in 2018 have been upgraded to prevent multiple voting while preserving speed of voting and the integrity of the voting process.\nApart from Namibia, electronic voting is used in Belgium, Bolivia, Brazil, Curacao, Mexico, Haiti, Philippines, the United States of America and Venezuela."
  },
  {
    "headline": "Spanish teenager Alcaraz stuns Tsitsipas in New York",
    "summarized_story": "Spanish teenager Carlos Alcaraz upset Stefanos Tsitspas, the Greek third seed with a 6-3 6-4 7-6 (2) 0-6 7-6 (5) victory on Friday, to advance to the fourth round of the U.S. Open.\nThe 18 year-old player did not allow himself to be distracted by a Stefanos Tsitsipas mid-match bathroom break, as he held his focus to claim a memorable win in New York.\nBut Alcaraz refused to lose focus becoming the youngest player to reach the fourth round of a Grand Slam since 17-year-old Andrei Medvedev at 1992 Roland Garros.\nTactic or mother nature calling Tsitsipas again took a bathroom break at a crucial point in the match leaving the court after losing a third set tie-break that put the Spaniard ahead 2-1.\nPlanned or not Tsitsipas returned five minutes later and stormed through the fourth set 6-0 just as he did in the second round against Adrian Mannarino."
  },
  {
    "headline": "Lawyer To Igboho’s Aides Warns Director-General Of Department Of State Services To Release Two Remaining Detainees Or Risk Jail",
    "summarized_story": "Pelumi Olajengbesi, the lawyer for 12 detained aides of Yoruba Nation leader Sunday Adeyemo, also known as Sunday Igboho, has warned the Director-General of the Department of State Services, Yusuf Bichi, to obey the court order and free the remaining two detainees held by the agency.\nThe secret police had on August 30 released eight of the 12 aides of the agitator.\n“Sequel to the refusal of the DSS to release the other detainees, concerted efforts were immediately made to resolve all technical issues raised by the DSS.\nNo valid reasons on law were availed the Legal Team for this willful disobedience of the rule of law and court.\nAny iota of non-compliance to an order of court is tantamount to disregard of such an order in its entirety and same is contemptuous."
  },
  {
    "headline": "BREAKING: Lawless Department Of State Services Releases Two More Sunday Igboho’s Aides",
    "summarized_story": "Sunday Adeyemo, alias Sunday Igboho, a Yoruba activist, has released two more aides.\nAwo had filed a remand application for the four detainees saying their release would affect investigation.\nHe had also approached an Appeal Court sitting in Abuja to revoke the bail earlier granted to the four persons.\nThe aides were released to Olajengbesi after the Department of State Services (DSS) failed to comply with a court ruling on the matter.\nIt would be recalled that the lawyer had issued an ultimatum to the DSS to release the detained aides, who were arrested at Igboho’s house."
  },
  {
    "headline": "Buhari Is Not Using NNPC As Personal ATM – Femi Adesina Claims",
    "summarized_story": "President Muhammadu Buhari, according to the Presidency, is not plundering the Nigerian National Petroleum Corporation (NNPC).\nBuhari’s Media Adviser, Femi Adesina, said the president is not using NNPC as his personal Automated Teller Machine, ATM.\nAdesina said NNPC declared a net profit in 2020 because Buhari “did not use it as his personal Automated Teller Machine (ATM)”.\nThe presidential spokesman stated this in an article titled; “How Buhari Broke The Jinx At NNPC.”He explained that NNPC declared the profit because the president refused to operate NNPC like his personal ATM.\nThe article reads partly: “Well, it happened because perhaps for the first time in the history of the country, and of the NNPC, there is a President who is not using the place like a personal Automated Teller Machine (ATM)."
  },
  {
    "headline": "Lekki Now Hotspot Of Cyber Crime In Nigeria — EFCC",
    "summarized_story": "The Economic and Financial Crimes Commission has designated the Lekki neighborhood of Lagos State as a cybercrime hotspot in Nigeria.\n“Lekki, the fast-developing upper middle-class area of Lagos Metropolis, is emerging as the new hub of internet-related fraud.\n“Data from the investigation activities of the Lagos Command of the Economic and Financial Crimes Commission, EFCC, for the second quarter of 2021, indicates that Lekki District is the preferred location for all manner of cyber fraud syndicates.\n“Between April and June, 2021, the Advance Fee Fraud and Cyber Crime Sections of the Command recorded a total of 402 internet-related fraud arrests.\nWhile the Advance Fee Fraud Section was responsible for 243 arrests, the Cyber Crime Section executed 18 sting operations which resulted in 159 arrests, from which 13 convictions have so far been recorded,” the agency said."
  },
  {
    "headline": "Breaking: DSS ‘release 2 more Sunday Igboho’s aides’",
    "summarized_story": "Tajudeen Irinloye and Uthman Adelabu, two more aides of the Yoruba Nation agitator, Sunday Adeyemo also knownasSunday Igboho have been released by the operatives of Department of Security Services (DSS).\nThe DSS released them on Friday after two months.\nThe detainees’ lawyer, Pelumi Olajengbesi, confirmed their release Friday night.\nLast week, the DSS released eight of the 12 aides of the Yoruba agitator.\nJustice Obiora Egwuatu of the Federal High Court sitting in Abuja had on August 4, 2021, granted bail to the 12 detainees."
  },
  {
    "headline": "Breaking: Super Eagles edge Liberia in 2022 World Cup qualifying opener",
    "summarized_story": "The Super Eagles of Nigeria began their Qatar 2022 World Cup Qualifier campaign with a 2-0 win over the Lone Stars of Liberia.\nIheanacho doubled the Super Eagles lead in the 44th minutes courtesy of an assist from Alex Iwobi .\nThe Librarians played a little bit better in the second half but failed to hurt the Super Eagles on the counter .\nThe Super Eagles now tops group C of their world cup qualifiers courtesy of the convincing win .\nNigeria will play their second game of the qualifiers against Cape Verde on Tuesday ."
  },
  {
    "headline": "Breaking: Kaduna state electoral body postpones council poll in 4 LGAs",
    "summarized_story": "The Kaduna State Independent Electoral Commission (KADSIECOM) has postponed the LG elections in four local government areas of the state.\nKADSIECOM chairman, Dr. Saratu Binta Dikko-Audu, who disclosed this on Friday while briefing newsmen at the commission’s head office in Kaduna, said, “I have been reliably informed that security report in the state would make it impossible to peacefully conduct local government council election in a number of local government areas.\n“Consequently in order to protect lives and property including those of elections and materials, we have had to suspend the election in a number of local government areas and reschedule election in these local government areas for a later date after consultation with members of the commission.\n” The state independent electoral commission has decided to reschedule the local government councils in the following local government areas – Birnin Gwari, Chikun, Kajuru, Zango Kataf,” she said.\nLG election in Kaduna state is scheduled for Saturday September 4, 2021."
  },
  {
    "headline": "Fayemi Urges FCC To Focus More On What Could Deepen Bond of National Unity -NigPilot",
    "summarized_story": "The Governor of Ekiti State, Dr. Kayode Fayemi has called on the Federal Character Commission to focus more on deepening national unity and integration of the various facets of the nation including culture, ethnicity, and religion.\nDr Fayemi, made the call in Ado-Ekiti on Wednesday while receiving in audience a team from the Federal Character Commission led by its Executive Chairman, Alhaja Muheeda Dankaka.\nHe noted that Nigeria, with its diversities, required a body like the FCC and commended the Commission for utilizing a wide range of initiatives to manage such diversities.\nHe however challenged the FCC leadership to address the fundamental inadequacies in gender representation in the country, while reiterating the urgent need to promote inclusion in all national activities.\n“Any effort taken in fostering nation integration and national unity ought to be commended by all of us and this is one thing this body has been doing."
  },
  {
    "headline": "Fayemi Urges FCC To Focus More On What Could Deepen Bond of National Unity -NigPilot",
    "summarized_story": "The Governor of Ekiti State, Dr. Kayode Fayemi has called on the Federal Character Commission to focus more on deepening national unity and integration of the various facets of the nation including culture, ethnicity, and religion.\nDr Fayemi, made the call in Ado-Ekiti on Wednesday while receiving in audience a team from the Federal Character Commission led by its Executive Chairman, Alhaja Muheeda Dankaka.\nHe noted that Nigeria, with its diversities, required a body like the FCC and commended the Commission for utilizing a wide range of initiatives to manage such diversities.\nHe however challenged the FCC leadership to address the fundamental inadequacies in gender representation in the country, while reiterating the urgent need to promote inclusion in all national activities.\n“Any effort taken in fostering nation integration and national unity ought to be commended by all of us and this is one thing this body has been doing."
  },
  {
    "headline": "Terrorism: Nigeria, Turkey to strengthen Defence Relation -NigPilot",
    "summarized_story": "The Nigerian Army and its Turkish counterpart have pledged to strengthen Defence relations to tackle terrorism.\nAmbassador Bayraktar said the purpose of the visit was to improve upon the existing relationship between the two countries and assist Nigeria in its fight against terrorism.\nThe Ambassador further averred that like Nigeria, Turkey had equally been confronted with challenges of insecurity, pointing out that the Defence Corporations of both countries have to come into mutual agreement in order to curtail the activities of terrorists in both countries.\nThe Chief of Army Staff (COAS), described the visit as an opportunity to further enhance the existing cordial relationship between both countries, particularly the Land Forces of Turkey.\nHe disclosed that during his recent tour of Turkey, he paid a visit to the Turkish Defence Corporation, describing it as a very insightful tour."
  },
  {
    "headline": "Terrorism: Nigeria, Turkey to strengthen Defence Relation -NigPilot",
    "summarized_story": "The Nigerian Army and its Turkish counterpart have pledged to strengthen Defence relations to tackle terrorism.\nAmbassador Bayraktar said the purpose of the visit was to improve upon the existing relationship between the two countries and assist Nigeria in its fight against terrorism.\nThe Ambassador further averred that like Nigeria, Turkey had equally been confronted with challenges of insecurity, pointing out that the Defence Corporations of both countries have to come into mutual agreement in order to curtail the activities of terrorists in both countries.\nThe Chief of Army Staff (COAS), described the visit as an opportunity to further enhance the existing cordial relationship between both countries, particularly the Land Forces of Turkey.\nHe disclosed that during his recent tour of Turkey, he paid a visit to the Turkish Defence Corporation, describing it as a very insightful tour."
  },
  {
    "headline": "Army denies alleged recruitment in 44 NA Reference Hospital -NigPilot",
    "summarized_story": "The Nigerian Army (NA) on Wednesday denied the alleged ongoing sales of Graduate Internship forms for recruitment into 44 Nigerian Army Reference Hospital Kaduna (NARHK).\nAccording to the statement, “The Nigerian Army (NA) has been notified of an advert making the rounds in the social media on sales of Graduate Internship forms for recruitment into 44 Nigerian Army Reference Hospital Kaduna (NARHK).\nThese online fraudsters are warned to desist from such criminal activities, which adversely affect the image and reputation of the Nigerian Army.\nIt is also important to state that at present, the Nigerian Army has not put out any advert for sales of forms.\nThe Nigerian Army however, reiterated that all activities relating to Graduate Internship recruitment into the 44 NARHK are usually publicized in the print and traditional electronic broadcast media when the need arises."
  },
  {
    "headline": "Drugs Worth Over ₦100bn Seized, 1,630 Criminals Jailed – NDLEA Chairman",
    "summarized_story": "Since January 2021, drugs worth over ₦100billion have been seized and about 1,630 criminals arrested by the National Drug Law Enforcement Agency.\nThis is according to NDLEA Chairman, General Buba Marwa.\n“Nigeria has 10.6million cannabis users, this is the highest in the world, isn’t it sad?” the NDLEA Chairman asked rhetorically.\nDebates regarding a proposed legalization of cannabis in Nigeria have from time to time been brought to the fore especially since President Muhammadu Buhari appointed Gen. Marwa as NDLEA Chairman earlier in the year.\nFor the NDLEA Chairman, the agency will continue to burn down marijuana farms and prosecute whoever is caught doing the business."
  },
  {
    "headline": "DSS Releases Two More Igboho’s Aides – Lawyer",
    "summarized_story": "The Department of State Services (DSS) has released two more aides of Yoruba Nation agitator Sunday Adeyemo.\nThis comes after the DSS had released eight of Igboho’s aides on Monday.\nHe however noted that two other aides – Amudat Habibat Babatunde and Jamiu Noah Oyetunji – remain in the unlawful custody of the DSS.\n“Sequel to the refusal of the DSS to release the other detainees, concerted efforts were immediately made to resolve all technical issues raised by the DSS.\nSee the full statement here:‘DSS’ RELEASES TWO MORE IGBOHO’S Aides – Tajudeen Irinloye and Uthman Opeymi Adelabu “DSS’ SELECTIVE OBEDIENCE TO COURT ORDER; AN AFFRONT TO AND DISREGARD OF THE AUTHORITY OF THE COURT” By."
  },
  {
    "headline": "Teenager Arrested For Tampering UTME Result",
    "summarized_story": "A 19-year-old candidate in the 2021 Unified Tertiary Matriculation Examination has been arrested by the police for allegedly tampering with his result.\nThe spokesman of the Joint Admissions and Matriculation Board (JAMB), Fabian Benjamin, said the arrest followed the suspect’s claim of scoring 380 in the examination conducted in June.\n“After several enquiries, 265 kept appearing as his score as against the 380 score,” the JAMB spokesman said via a statement issued on Friday.\nBecause this boy has accused JAMB, we are going to withhold his result until the investigation is concluded.\nI saw 380 the first time I checked then the second I saw 265.”"
  },
  {
    "headline": "UPDATED: Appeal Court Declares Valentine Ozigbo Anambra PDP Gov Candidate",
    "summarized_story": "The Court of Appeal sitting in Abuja has declared Valentine Ozigbo as the validly elected candidate of the Peoples Democratic Party (PDP) for the Anambra Governorship election slated for November 6, 2021.\nThe court held that the appeal challenging the judgement of the Awka High Court, which barred him from parading himself as the PDP candidate in the coming election, had merit and was, therefore, allowed.\nIn July, INEC dropped Ozigbo’s name from the list of candidates for the election in obedience to a court order.\nBut an unperturbed Ozigbo stated INEC’s reliance on a court order in not publishing his name as the PDP candidate was “a matter of procedure and temporary”.\nThe PDP candidate insisted that the party had forwarded only his name to INEC as its candidate for the forthcoming governorship election in Anambra."
  },
  {
    "headline": "Presidency: Umahi To ‘Feel Bad’ If APC Doesn’t Give South-East Opportunity",
    "summarized_story": "﻿Governor of Ebonyi State, Dave Umahi, says he will feel bad if the All Progressives Congress (APC) does not give the South-East a chance at the presidency.\nUmahi said this when he made an appearance on Channels Television’s Politics Today on Friday.\n“If I follow APC for this length of time, and they don’t give the South-East an opportunity, I will feel bad.\n“I will feel bad if I stay the same length of time as I did in the PDP and that happens.\nAfter years in the PDP, Governor Umahi defected to the APC in November 2020."
  },
  {
    "headline": "NCC Shutdown GLOBACOM signals in Zamfara State -",
    "summarized_story": "The Nigerian Communications Commission has directed the management of Second National Carrier, GLOBACOM Nigeria Limited to shutdown its signal in Zamfara State.\nThe Letter signed by the Executive Vice Chairman of the commission, Professor Garba Dambatta, and addressed to the managing director of GLOBACOM says the shutdown was for an initial period of two weeks.\nIt further directed that the company should also shutdown all base stations in neighbouring states that could be used to communicate within Zamfara State."
  },
  {
    "headline": "Police Restrict Movement From Midnight Friday for Kaduna LG Polls -",
    "summarized_story": "Kaduna State Police Command has ordered the restriction of human and vehicular movements in and within the state from Friday midnight to 6PM on SaturdayThis is due to the Local Government elections taking place in 19 local councils in the state,4th of September.\nThe order is contained in a statement released by the Command’s spokesperson, Mohammed Jalije on Friday in Kaduna.\nHe also reveals that large gathering and political campaigns have been suspended on the state.\nAccording to him, effective security deployment has been made to all the poling units and collation centres across the state.\nA Rapid Response Team has also been deployed to all local government areas to promptly respond to distress calls."
  },
  {
    "headline": "Customs, NDLEA, DSS intercept ISIS drug, Captagon, in Lagos -",
    "summarized_story": "The Nigeria Customs Service (NCS), the Department of State Services (DSS) and the National Drug Law Enforcement Agency (NDLEA) have intercepted Captagon pills at the Apapa port in Lagos.\nComptroller Malanta Yusuf, Apapa Command Area Controller announced the discovery of the Drug in a statement on Wednesday night.\nCaptagon, popularly known as Fenethylline, is a codrug of amphetamine and theophylline and popular with the Islamic State of Iraq and Syria (ISIS).\nMr Yusuf Malanta added that more details will be made public at the end of the examination and counting process.\nThe NCS vowed that security units will sustain the fight against all forms of smuggling and infractions against the nations law."
  },
  {
    "headline": "Attempt to legalise Marijuana will fail in the National Assembly",
    "summarized_story": "The Chairman of the National Drugs Law Enforcement Agency (NDLEA), Brig.\nGen. Buba Marwa, has expressed confidence that the pressure to get marijuana legalised will fail at the National Assembly.\nMarwa spoke while briefing State House Correspondents after a meeting with President Muhammadu Buhari at the Presidential Villa in Abuja.\nAccording to the former Lagos military administrator, more than 90% of the members of the National Assembly will not dare vote in support of marijuana legalisation because they know their constituents will not take it kindly with them.\nThis, he said, informed his optimism the move will failHe also revealed that he constantly receives death threats from criminals in the course of his job but was not overly concerned even though he takes precaution."
  },
  {
    "headline": "General Motors, Ford To Temporarily Shut Down As Chip Shortage Worsens",
    "summarized_story": "Ford also will stop making pickups at its Kansas City Assembly Plant for the next two weeks.\nThe global shortage in computer chips is getting worse, forcing automakers to temporarily close factories including those that build popular pickup trucks.\nU.S. light vehicle sales fell nearly 18% in August compared with a year ago, while the average vehicle sale price hit over $41,000, a record, according to J.D.\nThe August sales dip and inventory shortages prompted Schuster to cut his U.S. sales forecast for the year to 15.7 million.\nFord said its overall production rose to nearly 80% from July to August, although it’s not clear how long that would last."
  },
  {
    "headline": "Cholera Epidemic Kills 104 in Niger",
    "summarized_story": "104 people are dead in Niamey, the Niger capital following a cholera epidemic that has seen 2,874 cases in six regions, the Ministry of Health announced Friday.\nThe region of Tillabéri, in the “three borders” zone between Niger, Burkina and Mali, the scene of regular jihadist attacks, is also affected, according to the ministry.\nStocks of medicines and rapid screening tests have been sent to the affected regions where the sick are being treated free of charge in isolation sites, the Nigerien government says.\nThe health authorities call on the population “to urgently present themselves in a health centre” as soon as “signs” of cholera appear, including “diarrhoea and vomiting”.\nIn 2018, a previous cholera outbreak resulted in 78 deaths out of 3,824 cases reported in Niger, mainly in areas close to Nigeria, according to the WHO."
  },
  {
    "headline": "Get Vaccinated to Avoid Devastating Wave of Infections, Ramaphosa Tells South Africans",
    "summarized_story": "South African President Cyril Ramaphosa has asked all South Africans to get vaccinated against COVID-19 as one of the main tools in avoiding another devastating wave of infections.\nWhile answering questions from Parliament on Friday Ramaphosa the need for more to be done to educate people and fight vaccine hesitancy.\n“If we can vaccinate a large enough proportion of our population, particularly the adult population, by December, we can avoid another devastating wave of infections and restrictions on the economy,” Ramaphosa said.\nHe said a large scale campaign to encourage vaccination uptake was being set up and he would personally take part.\nVaccine production within the continent is seen as key to meeting the stated target of vaccinating 60% of the people."
  },
  {
    "headline": "Development Bank SA Partners With Invest Africa To Create Sustainable Finance Solutions",
    "summarized_story": "As a means of generating sustainable finance solutions adapted to African markets, Development Bank of Southern Africa (DBSA), is partnering with Invest Africa.\nThe coming together of DBSA, a leading Development Finance Institution (DFI) in Africa, and with Invest Africa would create a finance solutions for the Continent during The Africa Debate 2021.\nGroup Executive, Origination & Coverage DBSA, Mohan Vivekanandan, will be leading a discussion with regulators, capital markets investors and others to outline how sustainable finance can generate growth in emerging markets.\nMoreover, our accreditation to global partners including the Global Environment Facility (GEF) and the GCF has further propelled our role in promoting and leveraging sustainable development regionally in support of the Sustainable Development Goals (SDGs) and the Paris Agreemen”.\nThe Development Bank of Southern Africa (DBSA) is a leading Development Finance Institution (DFI) in Africa and it’s mission is to improve people’s lives, boost economic growth and promote regional integration through infrastructure development."
  },
  {
    "headline": "Twelve Die in DR Congo After Angola Mine Toxic Leak",
    "summarized_story": "Twelve people are dead and 4,500 people have fallen sick in southern Democratic Republic of the Congo (DRC) following a toxic leak from the Catoca diamond mine in neighbouring Angola in July, the DRC’s environment minister said Thursday.\nShe said the DRC will seek reparations in line with the “polluter pays” principle, Bazaiba said, but did not specify how exactly the 12 people died.\nKasai provincial Governor Dieudonne Pieme banned people from drinking water and eating fish from the Tshikapa River after the spill, which he said significantly depleted the river’s fish population.\nSociedade Mineira de Catoca, which manages the mine that produces 75 per cent of Angola’s diamonds, did not immediately respond to a request for comment on the deaths, the Reuters news agency reported.\nThe company previously said it immediately took measures to minimise the flow of sediment into rivers and that it donated food baskets to affected communities to mitigate the impact of the spill."
  }
]