[
  {
    "headline": "Igboho drags FG before Abuja court, demands release of detained aides",
    "summarized_story": "Chief Sunday Adeyemo, aka Sunday Igboho, has approached the Federal High Court, Abuja, for the release of his aides arrested by operatives of the Department of State Services at his house in the Soka area of Ibadan on July 1.\nCounsel for the Yoruba Nation agitator, Chief Yomi Aliyu (SAN), told our correspondent on the telephone on Thursday that he had filed an action before a Federal High Court in Abuja for the release of the 13 arrested persons.\nAsked what step he was taking to ensure their release, Aliyu said, “We have filed an action before a Federal High Court in Abuja concerning their bail.\nWe filed it today.”The DSS had invaded the residence of Igboho around 1:30am on July 1.\nHe said, “We know that they have been in police custody for so many days now but our lawyers are working to ensure their release."
  },
  {
    "headline": "Baptist school students: Parents panic as bandits threaten starvation, demand 30 bags of rice",
    "summarized_story": "An official, who confided in one of our correspondents, said the bandits said the parents must supply 30 bags of rice, 20 bags of beans and 10 kegs of palm oil.\nRecall that the bandits had at 1am on Monday invaded the school and kidnapped 121 students, who are mostly in Senior Secondary School 2 and 3.\nThe PUNCH on Tuesday reported that the bandits contacted the school management and demanded food to feed the abductees.\nMadugu said the gunmen rejected nine bags of rice as well as other food items offered by the school.\nHe further stated that the bandits said authorities had blocked their access to food and therefore demanded that the school and the parents make food items available."
  },
  {
    "headline": "Ex-Ambassador warns FG to stop harassing Nnamdi Kanu",
    "summarized_story": "Nnamdi KanuBy Steve OkoFormer Nigeria Ambassador to Argentina, Ambassador Empire Kanu, has lambasted the federal government for the alleged abduction and extradition of the Leader of the Indigenous Peoples of Biafra, IPOB, Mazi Nnamdi Kanu.\nThe ex-diplomat argued that instead of persecuting Kanu, the Nigeria Authorities should be concerned about addressing the germane issues he is raising.\n” Why is the federal government so worried about Nnamdi Kanu.\nEven Britain that put us into this union also had referendum and opted out of European Union.\nIs Government not the one harrasing Nnamdi Kanu?"
  },
  {
    "headline": "Non-GMO, gluten-free foods highly recommendable for healthy living — Nutritional industrialist",
    "summarized_story": "In this interview, Kehinde talks about the effects of GMO food, eating habits and other things.\nSpeaking about eating habits generally, what do you consider harmful in the way people eat?\nA vast majority of people give little or no attention to proper eating habits or even study about eating habits and what it entails.\nPoor eating habits are detrimental to the body.\nWhen you say, snacking on organic, gluten-free, non-GMO foods is highly recommendable and body-friendly, what do you mean?"
  },
  {
    "headline": "Anti-corruption: ICPC inaugurates Ministry of Mines’ Anti-Corruption Unit",
    "summarized_story": "By Gabriel Ewepu – AbujaThe Independent Corrupt Practices and Other Related Offences Commission, ICPC, yesterday, inaugurated the Anti-Corruption and Transparency Monitoring Unit, ACTU, of the Ministry of Mines and Steel Development, to fight all tendencies of corruption in the sector.\nOwasanoye also called for effective utilization and revenue generation in accordance with the diversification mantra of the Federal Government towards national development.\nHe said: “It is therefore important for staff of the Ministry to understand their responsibility and live above board in order to propel the Ministry to greater heights.\nMeanwhile, she (Akinlade) also acknowledged the strategic role being played by the ICPC in strengthening the ACTU and in putting the Unit constantly on its toes across the civil service.\nShe said the Ministry sincerely appreciates ICPC’s close monitoring of the effectiveness of ACTU as well as the Transparency and Integrity rating of the Sector all along."
  },
  {
    "headline": "Insecurity: We can’t afford to disappoint Nigerians ― Buhari",
    "summarized_story": "Condemns Adamawa attackBy Johnbosco AgbakwuruPresident Muhammadu BuhariPRESIDENT Muhammadu Buhari Thursday bemoaned the recent attack in Adamawa State by criminal elements, saying that his administration can’t afford to disappoint Nigerians that have entrusted their security in his hands.\nThe President expressed sadness over the brutal killing of some citizens, including a vigilante leader and Village Head of Dabna, a village in Dugwaba, Hong Local Government Area of the State.\nReacting to the incident which happened on Wednesday, President Buhari in a statement issued by his Senior Special Assistant on Media and Publicity, Mallam Garba Shehu, said: “This level of savagery, inhumanity and reckless disregard for the sanctity of life cannot go unpunished.”The President directed security officials to “redouble their efforts and respond to these security threats promptly and decisively.”“We can’t afford to disappoint Nigerians that have entrusted their security in our hands,’’ he declared.\nThe President directed respective agencies under the Ministry of Humanitarian Affairs, Disaster Management, and Social Development to immediately assess losses in the community and send support.\nMeanwhile, President Buhari has raised a high-powered delegation to visit the community to convey his sympathies to the families of victims and the government of Adamawa State."
  },
  {
    "headline": "Police AIG: Probe outcome’ll determine Magu’s promotion eligibility ― Presidency",
    "summarized_story": "By Johnbosco AgbakwuruIbrahim MaguTHE Presidency Thursday said that President Muhammadu Buhari has no hand in the promotion exercise of the police that declined the promotion of former acting Chairman of the Economic and Financial Crimes Commission (EFCC), Ibrahim Magu.\nThere was insinuation in some quarters that President Buhari was pushing for the promotion of former acting Chairman of the Economic and Financial Crimes Commission (EFCC), Ibrahim Magu, who has been under probe over allegations of misuse of his office.\nAccording to the statement, “We will be happy if your paper can correct the misinformation published, that President Buhari has ordered the promotion of Commissioner of PoliceIbrahim Magu.\nPresident Buhari or any Nigerian President for that matter is not responsible for promotions in the Police.\nThat is the business of the Police Service Commission, PSC."
  },
  {
    "headline": "Zamfara Governor signs autonomy bill for judiciary, legislature",
    "summarized_story": "Zamfara State Governor, Bello Matawalle, on Thursday, signed the bills granting financial autonomy for the judiciary and legislature in the state.\n“The two new laws are now the Zamfara State Judiciary Autonomy Law and the Zamfara State Legislative Fund Management Law and Related Matters Connected Therewith, 2021 (1442 AH).”According to the spokesman, Governor Matawalle attached great importance to the two bills and would not entertain any further delay in signing the bills into law.\nHe equally said the governor promised to continually ensure that all statutory responsibilities are directed to the appropriate channels.\nMatawalle also appealed to members of the judiciary and legislative arm of government to shelve corrupt practices.\nThe Speaker of the House of Assembly, Nasiru Magarya, in his remark said Governor Matawalle has successfully maintained a cordial relationship with both the legislative and judiciary arm of government."
  },
  {
    "headline": "Pope Francis, UK, Canada react to killing of Haiti’s Moïse",
    "summarized_story": "Pope Francis, UK Prime Minister and Canadian Prime Minister have joined the world in condemning the murder of President Jovenel Moise of Haiti.\nPresident Moise was assassinated by armed men at his private residence.\nPope Francis expressing sadness over Moïse death, condemned all forms of violence to resolve conflicts.\n“I am shocked and saddened at the death of President Moïse.\nHow Haiti President Moise was killed days after gangs declared revolution“Canada stands with the people of Haiti during these difficult and uncertain times."
  },
  {
    "headline": "Buhari reacts as Boko Haram attack Dabna, kills many in Adamawa",
    "summarized_story": "President Muhammadu Buhari has expressed sadness over the brutal killing of some citizens, including a vigilante leader and Village Head of Dabna, a village in Dugwaba, Hong Local Government Area of Adamawa.\nBuhari conveyed this in a statement by his Senior Special Assistant on Media and Publicity, Malam Garba Shehu, on Thursday in Abuja.\nShehu said the president was reacting to the incident which happened on Wednesday in the state.\nBuhari said: “This level of savagery, inhumanity and reckless disregard for the sanctity of life cannot go unpunished.’’The President directed security officials to “redouble their efforts and respond to these security threats promptly and decisively.\nMeanwhile, President Buhari has raised a high powered delegation to visit the community to convey his sympathies to the families of victims and government of Adamawa."
  },
  {
    "headline": "Biafra: ‘King of Dragon’ members captured in Imo after gun duel with police",
    "summarized_story": "The Imo State Police Command has apprehended two suspected members of the Eastern Security Network, ESN, a security wing of the Indigenous People of Biafra, IPOB who were also linked to a terrorists’ gang, ‘King of Dragon’.\nThe suspects were arrested after they engaged the security operatives in a gun duel at their hideout in Emekwukwu, Owerri North Local Government Area of the state.\nThis is coming barely three days after ESN members, who were allegedly planning to plant explosives in a military checkpoint along Owerri/Orlu road in Imo State were arrested by the police.\nPolice engage bandits in gun duel, kill 14 in BenueThe Imo state Commissioner of Police, Abutu Yaro, who paraded the suspects on Thursday in Owerri the state capital, said other suspects who engaged the operatives in the gun battle, escaped with bullet wounds.\nHe admitted being amongst those that attacked Orji Police Station and have committed several other crimes in the state.”"
  },
  {
    "headline": "Biafra: It's not by force to stay together, grant Ndigbo referendum",
    "summarized_story": "Empire Kanu, former Nigeria Ambassador to Argentina, has lambasted the Federal Government for what he described as the abduction and extradition of Nnamdi Kanu, leader of the Indigenous Peoples of Biafra, IPOB.\n“Why is it that Britain allowed Ireland and Scotland to have a referendum but is unwilling to allow the Eastern region to have a referendum?\nIf you give us a referendum nobody will agitate again because the outcome of the referendum will solve this quarrel.\nIs the Government not the one harassing Nnamdi Kanu?\nThey are the ones harassing the poor boy.”Kanu demanded that Nigerian Government accord the IPOB leader his legitimate rights after they abducted him back to the country."
  },
  {
    "headline": "Buhari has nothing to do with PSC's decision on Magu -- Presidency",
    "summarized_story": "By Bolaji Ogundele, AbujaThe Presidency has debunked reports that President Muhammadu Buhari attempted to influence promotion of former Acting Chairman of the Economic Financial Crimes Commission (EFCC), Ibrahim Magu.\nThe Police Service Commission (PSC), in a statement by its spokesman, Ikechukwu Ani, had in reaction to certain media report, denied the Commission considered Magu for promotion to his next rank of Assistant Inspector-General of Police.\nAn online medium had claimed that President Buhari was pressuring the PSC to include the former EFCC Acting Chairman on the promotion list.\n“We will be happy if your paper can correct the misinformation published, that President Buhari has ordered the promotion of Commissioner of PoliceIbrahim Magu.\nPresident Buhari, or any Nigerian President for that matter, is not responsible for promotions in the Police."
  },
  {
    "headline": "Petrol tanker crushes pupils to death in Delta",
    "summarized_story": "By Elo Edremoda, WarriAt least nine students of Army Children Primary School, Effurun, Uvwie council area of Delta state, have reportedly died after a petrol-laden tanker ran into them on Thursday afternoon.\nSeveral others were reportedly rushed to the military hospital located inside the General David Ejoor Barracks, Effurun and Central Hospital, Warri.\nIt was gathered 12 pupils were rushed to the Central Hospital, Warri from which nine were confirmed dead on arrival.\nThe other three were reportedly referred to the Delta State University Teaching Hospital (DELSUTH), Oghara after being stabilised.\nDelta Police spokesman, DSP Bright Edafe, confirmed the death of six pupils, noting the number is “tentative”."
  },
  {
    "headline": "Report on plane crash of late COAS ready next week, says AIB",
    "summarized_story": "By Faith Yahaya, AbujaThe Accident Investigation Bureau (AIB), on Thursday, said a report on the crash of a military aircraft would be ready next week.\nThe crash, which occurred in Kaduna in May claimed 11 people including the late Chief of Army Staff, Lt. General Ibrahim Attahiru.\nThe Commissioner, AIB, Akin Olateru, disclosed this in Abuja while releasing eight flight accident reports.\nSpeaking on the report of the crash, Olateru said: “Recall its a NAF aircraft but unfortunately it happened at the civil airport.\nBut within the next one week, for us, the preliminary report will be ready.”The bureau also said the eight latest report was the biggest haul since establishment of AIB."
  },
  {
    "headline": "LASEMA confirms 5-year-old boy dead in Lagos building collapse",
    "summarized_story": "Agency ReporterThe Lagos State Emergency Management Agency (LASEMA) on Thursday said it recovered one dead body from a building that collapsed in Lagos Island.\nThe LASEMA Director-General, Dr Olufemi Oke-Osanyintolu, who confirmed this in a statement in Lagos, said the five-year-old casualty died as a result of a beam that collapsed on him.\nHe said that the agency received a distress call at about 10:55 a.m. of a collapsed building at No.\n“Further investigation revealed that the building had been slated for non integrity test because of visible cracks on the beam and columns of the building.\n“Unfortunately, an adolescent lost his life to the incident,” he saidHe said that LASEMA Response Team, the Lagos State Building Control Agency (LABSCA) and the Lagos State Safety Commission were all at the scene to conduct proper assessment of the affected building."
  },
  {
    "headline": "Fans disprove of Yemi Alade’s gender-based post",
    "summarized_story": "By Ekaete BasseySocial media users have disagreed with a gender-based post by Afro-pop singer, Yemi Alade.\nThey expressed disapproval over the songstress’ depiction that women face more obstacles than men.\nADVERTISEMENTThe award-winning singer and performer shared an image via her Instagram page depicting men and women on a race track.\nI am not against the post don’t get me wrong o I just think it’s missing elements in the man’s path.\nMen Support Alot!”myque.1 wrote: “Disputed."
  },
  {
    "headline": "Save Nigeria from collapse, CAN urges Buhari, again",
    "summarized_story": "From Fred Ezeh, AbujaChristian Association of Nigeria (CAN) has again called on President Muhammadu Buhari to save Nigeria from an imminent collapse.\nIn warned that the case of Pastor Kayode should not be like that of Rev.\n“Why should the government leave Nigerians to be at the mercy of insurgents, bandits and kidnappers?\nThough, we are praying earnestly continuously, we know faith without hard work from the side of government is vain.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "BREAKING: NCDC confirms Delta variant of COVID-19 now in Nigeria",
    "summarized_story": "From Juliana Taiwo-Obalonye and Fred Eze, AbujaThe Nigeria Center for Disease Control (NCDC) has confirmed detection of SARS-CoV-2 Delta variant, also known as lineage B.1.617.2 in the country.\nThe NCDC Director-General, Dr Chikwe Ihekweazu confirmed this Thursday evening, urging Nigerians that given the high transmissibility of the Delta variant and following its detection in Nigeria, to ensure strict adherence to public health and social measures in place.\nThe Delta variant which has been detected in over 90 countries is recognised by the World Health Organization (WHO) as a variant of concern, given its increased transmissibility.\nThe variant has also been linked to a surge in cases in countries where it is the dominant strain in circulation.\nGiven the global risk of spread of the Delta variant, positive samples from international travelers to Nigeria are sequenced regularly,” he explained."
  },
  {
    "headline": "2023: Nigeria’s democracy at risk – British govt warns",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe British government has warned the rise in conflicts can destabilise Nigeria’s democracy in the run-up to the 2023 elections.\nBoth spoke at the launch of the Nigeria Governors’ Forum (NGF) Peace and Inclusive Security Initiative (PISI) in Abuja on Thursday.\nHe stressed that the conflict represents an existential threat to Nigeria’s unity and its development.\nAccording to him, “The rise in conflict risks destabilising Nigeria’s democracy in the run-up to the 2023 elections.\nAccording to him, poverty is not the cause of violence in Nigeria, arguing that China has about 300 million unemployed."
  },
  {
    "headline": "Wailing as Prophet TB Joshua’s body arrives church",
    "summarized_story": "Led by the bereaved wife, Evelyn and their three daughters, the corpse arrived the church at exactly 10.40am.\nUpon sighting the motorcade and ambulance that brought the body, tears cascaded down the cheeks of women and men alike.\nJune 8 is the lying-in-state as the day four of the activities marking the burial ceremony of the departed prophet.\nAs they bid Joshua farewell, the church’s ushers had a hectic day in calming and consoling people whose voices went above the speakers.\nTB Joshua will be laid to rest tomorrow Friday at his church."
  },
  {
    "headline": "58 private jet owners report for Customs verification",
    "summarized_story": "From Uche Usim, AbujaThe Nigeria Customs Service NCS on Thursday disclosed that 58 private jet owners have come forward to have their airplanes verified in line with its new directive on ascertaining their status.\nThe Public Relations Officer of the NCS, Joseph Attah made the disclosures in Abuja at a media briefing.\nHe said that the Customs management has extended the private jet verification deadline to July 20, 2021.\nOn seizures, Attah noted that the Service between January to June 2021 effected 2,333 assorted seizures with duty paid value of N4,422,548,980.\nOn the private jets verification, the Customs Spokesman said that infractions discovered during the verification exercise so far include;breach of Temporary Importation agreement, non-appropriate payment of duty and taxes."
  },
  {
    "headline": "Nigeria Confirms First Case of Covid’s Delta Variant",
    "summarized_story": "Onyebuchi Ezigbo in AbujaThe Nigeria Centre for Disease Control (NCDC) has detected a confirmed case with the SARS-CoV-2 Delta variant, also known as lineage B.1.617.2 in Nigeria.\n“Given the global risk of spread of the Delta variant, positive samples from international travelers to Nigeria are sequenced regularly,” it said.\nIt added, “Proven public health and social measures such as physical distancing, frequenthandwashing, and proper use of face masks, prevent infections and save lives.\nThe Delta variant is recognised by the World Health Organization (WHO) as a variant ofconcern, given its increased transmissibility.\nIt is veryimportant that this is strictly adhered to, to prevent a surge in COVID-19 cases in Nigeria."
  },
  {
    "headline": "FIRS Goes After Multichoice, Mandates Banks to Recover N1.82trn Tax Debt",
    "summarized_story": "By James EmejoThe Executive Chairman, Federal Inland Revenue Service (FIRS), Mr. Muhammad Nami, Thursday said the service had appointed some commercial banks as agents to recover the sum of N1.82 trillion from accounts of Messrs Multi-Choice Nigeria Limited (MCN) and Multi-Choice Africa (MCA).\nNami said:”The level of non-compliance by Multi-Choice Africa (MCA), the parent Company of Multi-Choice Nigeria (MCN) is very alarming.\n“The issue with tax collection in Nigeria, especially from foreign-based companies conducting businesses in Nigeria and making massive profits is frustrating and infuriating to the Federal Inland Revenue Service (FIRS).\n“Regrettably, companies come into Nigeria just to infringe on our tax laws by indulging in tax evasion.\nIt is further requested that the Federal Inland Revenue Service be informed of any transactions before execution on the account, especially transfers of funds to any of their subsidiaries.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "FG Demands Unconditional Repatriation of Looted Benin Art Works from Germany",
    "summarized_story": "By Olawale AjimotokanThe Federal Government has asked Germany to ensure a full and unconditional return ofthe 1,130 Benin artefacts that were looted from the country in the 19th century and domiciled in German museums.\n“That they are known as Benin Bronzes is already a confirmation of their source of origin (which is Benin)”, Mohammed said.\nHe stressed the need for the parties to commit to definite timelines for the return of the Benin Bronzes in addition to concluding all necessary negotiations in a very short term.\nHe thanked Germany for taking the lead in the global efforts to repatriate all artefacts that were looted from Nigeria and the African continent.\nHe also commended the government of Germany for taking the lead in the repatriation process."
  },
  {
    "headline": "Alleged Fraud: Former JAMB Registrar, Ojerinde, Gets N200m Bail",
    "summarized_story": "By Alex EnumahJustice Obiara Egwuatu of a Federal High Court in Abuja, on Thursday admitted former Registrar of the Joint Admission and Matriculation Board (JAMB), Professor Adedibu Ojerinde, to bail in the sum of N200 million in his alleged fraud trial.\nJustice Egwuatu in a ruling on Ojerinde’s bail application held that bail was at the discretion of the court, adding that there is no evidence before him why the defendant should not be admitted to bail.\nThe Professor in addition must provide documented evidence of professorship, letter of appointment and staff identity card.\nHe was said to have committed the offense during his tenure as Registrar of the National Examination Council (NECO) and JAMB.\nJustice Egwuatu however declined and adjourned to Thursday 8 for hearing of the bail application."
  },
  {
    "headline": "Just In: Bandits Attack Another Kaduna Community, Abduct Many People",
    "summarized_story": "By John ShiklamAn unspecified number of people have been abducted in Anguwan Gimbiya, a suburb of Kaduna metropolis.\nThe incident has resulted in protest by hundreds of residents of the area who blocked the road along Sabon Tasha area of the metropolis.\nA resident of the community said the bandits stormed the community at about 11 pm on Wednesday, wielding sophisticated weapons and shooting sporadically.\n“There was nothing anybody could do because they were carrying very sophisticated weapons and they were many.\nOn Monday, bandits invaded Bethel Baptist High School, Damishi, Kaduna, and abducted 121 students who are still in captivity."
  },
  {
    "headline": "BREAKING: Tanker Crushes 15 Army Day Secondary School Pupils To Death In Delta",
    "summarized_story": "Not fewer than 15 pupils of the Army Day Secondary School, Effurun, Uvwie Local Government Area of Delta State have been crushed to death by a petrol tanker.\nSaharaReporters gathered that the students were returning from school around 3:30pm Thursday when the tanker loaded with petroleum product crushed the students to death while others still alive were taken to the Army Hospital, Effurun Barracks for medical attention.\nThe accident, it was learnt occurred opposite the General David Ejoor's Barracks of the Nigerian Army in Effurun, close to Warri."
  },
  {
    "headline": "BREAKING: Tanker Crushes 15 Army Day Secondary School Pupils To Death In Delta",
    "summarized_story": "Not fewer than 15 pupils of the Army Day Secondary School, Effurun, Uvwie Local Government Area of Delta State have been crushed to death by a petrol tanker.\nSaharaReporters gathered that the students were returning from school around 3:30pm Thursday when the tanker loaded with petroleum product crushed the students to death while others still alive were taken to the Army Hospital, Effurun Barracks for medical attention.\nThe accident, it was learnt occurred opposite the General David Ejoor's Barracks of the Nigerian Army in Effurun, close to Warri."
  },
  {
    "headline": "2023: How Buhari Undermined Tinubu Again, Continued To Weaken His Influence In All Progressives Congress Party",
    "summarized_story": "SaharaReporters gathered that the reluctance to announce national convention and choose national executives was to weaken the power and influence of Asiwaju in pushing for his candidates who would then begin more mobilisation for his yet-to-be-announced 2023 presidential ambition.\nThe development is already polarizing further the Buhari camp and the Tinubu camp in the APC, while other smaller camps have to take a stand between Buhari and Tinubu in the silent struggle.\n“The indefinite tenure exten­sion granted to the Caretaker/Extraordinary Convention Planning Committee of the APC is not going down well with us.\n“The president ap­proved the timetable for APC ward, local government and state congresses.\nWard con­gresses will hold 24th July, 2021 followed by local govern­ment congresses on 14th Au­gust, 2021 and state congresses on 18th September, 2021."
  },
  {
    "headline": "2023: How Buhari Undermined Tinubu Again, Continued To Weaken His Influence In All Progressives Congress Party",
    "summarized_story": "SaharaReporters gathered that the reluctance to announce national convention and choose national executives was to weaken the power and influence of Asiwaju in pushing for his candidates who would then begin more mobilisation for his yet-to-be-announced 2023 presidential ambition.\nThe development is already polarizing further the Buhari camp and the Tinubu camp in the APC, while other smaller camps have to take a stand between Buhari and Tinubu in the silent struggle.\n“The indefinite tenure exten­sion granted to the Caretaker/Extraordinary Convention Planning Committee of the APC is not going down well with us.\n“The president ap­proved the timetable for APC ward, local government and state congresses.\nWard con­gresses will hold 24th July, 2021 followed by local govern­ment congresses on 14th Au­gust, 2021 and state congresses on 18th September, 2021."
  },
  {
    "headline": "#Justice4KerenRally: Police Invite Gender Activist, Lemmy Ughegbe Over Planned Protest For Rape Victim, Keren",
    "summarized_story": "The Nigeria Police Force has invited the Executive Director, Men Against Rape Foundation, Lemmy Ughegbe following a planned protest tagged #Justice4KerenRally to demand justice for a 14-year-old rape victim, Miss Keren-Happuch Akpagher.\nCoalition of Gender-Based Violence (GBV) Responders had scheduled the rally for Friday, July 9, 2021at Unity Fountain based on information on a flyer being circulated on social media.\nHe had demanded from the police a copy of the medical report on the death of Keren-Happuch.\nThe pathologist said having a copy of the medical report was a pre-condition for him to conduct the autopsy.\nCoalition of Gender-Based Violence (GBV) Responders is committed to this and we are continually seeking safe spaces for our children."
  },
  {
    "headline": "BUSTED: Despite claiming to quit politics in 2019, Onochie promoted APC in 2020",
    "summarized_story": "Lauretta Onochie, presidential aide, promoted the All Progressives Congress (APC) in August 2020, contrary to a claim she made on Thursday.\nAdvertisementWhile appearing before the senate committee on the Independent National Electoral Commission (INEC), Onochie claimed that she quit partisan politics after President Muhammadu Buhari was reelected in 2019.\nI am madam due process and this is the reason behind my attacks, because I follow the law and due process,” Onochie told the senators.\nAdvertisementOn June 24, 2020, Onochie said the APC was growing through a growth process.\nThe presidential aide posted the tweet a day before the Oshiomhole-led NWC was disbanded."
  },
  {
    "headline": "BUSTED: Despite claiming to quit politics in 2019, Onochie promoted APC in 2020",
    "summarized_story": "Lauretta Onochie, presidential aide, promoted the All Progressives Congress (APC) in August 2020, contrary to a claim she made on Thursday.\nAdvertisementWhile appearing before the senate committee on the Independent National Electoral Commission (INEC), Onochie claimed that she quit partisan politics after President Muhammadu Buhari was reelected in 2019.\nI am madam due process and this is the reason behind my attacks, because I follow the law and due process,” Onochie told the senators.\nAdvertisementOn June 24, 2020, Onochie said the APC was growing through a growth process.\nThe presidential aide posted the tweet a day before the Oshiomhole-led NWC was disbanded."
  },
  {
    "headline": "Insecurity: Over 76,000 deaths reported in 10 years, says Fayemi",
    "summarized_story": "Kayode Fayemi, governor of Ekiti state, says over 76,000 people have been reported dead across the country in 10 years, as a result of insecurity.\nAdvertisementFayemi spoke on Thursday at the launch of the Nigeria Governors’ Forum (NGF) Peace and Inclusive Security Initiative (PISI) in Abuja.\nHe also noted that the situation is further worsened by the proliferation of small arms and light weapons.\n“Between May 2011 and February 2021, over 76,000 deaths were reported,” Fayemi said.\n“The Peace and Inclusive Security Initiative is a consequence of our determination to contribute to the conversation on inclusive security, and add the leverage of the sub-nationals to the efforts to secure the lives and property of our countrymen and women,” Okauru said."
  },
  {
    "headline": "Insecurity: Over 76,000 deaths reported in 10 years, says Fayemi",
    "summarized_story": "Kayode Fayemi, governor of Ekiti state, says over 76,000 people have been reported dead across the country in 10 years, as a result of insecurity.\nAdvertisementFayemi spoke on Thursday at the launch of the Nigeria Governors’ Forum (NGF) Peace and Inclusive Security Initiative (PISI) in Abuja.\nHe also noted that the situation is further worsened by the proliferation of small arms and light weapons.\n“Between May 2011 and February 2021, over 76,000 deaths were reported,” Fayemi said.\n“The Peace and Inclusive Security Initiative is a consequence of our determination to contribute to the conversation on inclusive security, and add the leverage of the sub-nationals to the efforts to secure the lives and property of our countrymen and women,” Okauru said."
  },
  {
    "headline": "Delta COVID variant, linked to high infection rate, detected in Nigeria",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) has confirmed the index case of the delta variant of the coronavirus in Nigeria.\n“The Nigeria Centre for Disease Control (NCDC) has detected a confirmed case with the SARS-CoV-2 Delta variant, also known as lineage B.1.617.2.\nAdvertisement“The Delta variant is recognised by the World Health Organisation (WHO) as a variant of concern, given its increased transmissibility.\n“Given the high transmissibility of the Delta variant and following its detection in Nigeria, NCDC urges all Nigerians to ensure strict adherence to public health and social measures in place.\nProven public health and social measures such as physical distancing, frequent handwashing, and proper use of face masks, prevent infections and save lives."
  },
  {
    "headline": "Peter Njonjo wants to change the way food moves in Africa",
    "summarized_story": "Peter Njonjo started his first business in high school.\nHis name is Peter Njonjo and this is his life in tech.\nHe chose to attend the United States International University Africa (USIUA), a private university in Nairobi.\nThree years later, he would be in charge of Coca-Cola’s operations in six countries across East Africa: Kenya, Uganda, Tanzania, Ethiopia, Eritrea, and Mozambique.\nI’m the firstborn of four children.”That is how Peter Njonjo starts his story on our call."
  },
  {
    "headline": "MultiChoice’s bank accounts blocked in Nigeria over alleged ₦1.8 trillion tax fraud",
    "summarized_story": "Nigeria’s Federal Inland Revenue Service (FIRS) on Thursday said it has directed commercial banks to freeze the accounts of MultiChoice Nigeria Limited (MCN) And MultiChoice Africa (MCA), in an attempt to recover ₦1.8 trillion in taxes from the companies.\nMultiChoice Group is a South African entertainment giant and owner of the popular DStv and GOtv services.\nParticularly, [MultiChoice Nigeria Limited] has avoided giving the FIRS accurate information on the number of its subscribers and income,” he said.\nAccording to the FIRS chair, Nigeria contributed 34% of total revenue for the group and the bulk of revenue for MultiChoice Africa.\nMultiChoice is the latest South African firm involved in a huge tax scandal in Nigeria."
  },
  {
    "headline": "Nigeria’s Daystar Power secures $20 million from IFC",
    "summarized_story": "Daystar Power, a provider of hybrid solar power solutions to businesses in West Africa, has secured a facility of $20 million from the International Finance Corporation (IFC) to fund its project pipeline in Nigeria.\nFounded in 2017 by Sunrah Ventures, Daystar Power is an off-grid power service provider whose solutions, “Solar-as-a-Service” and “Power-as-a-Service” provide clean and reliable power while significantly reducing overall power costs for clients.\nDaystar Power will receive a $10 million local currency loan from IFC, which will be provided to its Nigerian subsidiary, Daybreak Power Solutions.\nDaystar Power is working with the Canadian-funded IFC program, Energy2Equal, to close gender gaps and increase women’s participation in the renewable energy sector.\nDaystar Power has 29 megawatts (MW) of installed solar power capacity to date."
  },
  {
    "headline": "Netflix and chill just got a whole lot cheaper for Africa",
    "summarized_story": "But what happens when the elephants in question are not two, but three of the biggest Subscription Video-On-Demand (SVOD) platforms in Africa!\nNextflix just announced a mobile-only subscription starting at $3.99— that’s more than half the price of its basic subscription plan.\nNetflix also launched a Play Partial Download feature that allows users to play Netflix videos which haven’t downloaded completely.\nNetflix’s streaming tussle in AfricaWhen Netflix arrived in Africa in 2016, everyone anticipated a struggle with reigning SVOD champion, iRokoTV, even though Netflix offered mostly foreign movies and while iRokoTV focused on Nollywood.\nBut not for long…Obviously, with the release of this cheaper plan, Netflix may come out on top in this SVOD race to corner the African market."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Kenyan B2B retail platform, MarketForce, raises $2m pre-Series A to scale its B2B e-commerce marketplace for merchants",
    "summarized_story": "End-to-end retail distribution platform, MarketForce, was founded in 2018 by Tesh Mbaabu and Mesongo Sibuti, Chief Executive Officer (CEO) and Chief Technology Officer (CTO), respectively.\nThese stores also help customers access various forms of financial services such as payments, savings, remittances, and insurance.\nPer TechCrunch, the retail startup got into Y Combinator because they utilise FMCG distribution networks.\nRejaReja model, a B2B e-commerce marketplace for merchants, was launched in 2020 to assist informal retail merchants purchase and sell FMCGs and digital financial services.\nAlthough retail distribution is a core business, the CEO stated that finding the right talent and individuals willing to innovate and revolutionise the space has been an interesting challenge."
  },
  {
    "headline": "African startups have raised over $1 billion in H1 2021, more than double H1 2020’s figures",
    "summarized_story": "According to data from Maxime Bayen, Senior Venture Builder at BFA Global, African startups raised $1.19 billion in the first half of 2021.\n🚀🌍In H1'21, startups in Africa have raised more than they had raised in H1'19 and H1'20 combined ‼️#AfricaTheBigDeal @Cvllr➡️ Full insight: https://t.co/4KfeUE8dMr➡️ Underlying data: https://t.co/kRhHrIJMXA pic.twitter.com/QB59RskBEZ — Maxime Bayen (@MaxBayen) July 5, 2021This amount is more than double what African startups raised in the first halves of 2019 and 2020 combined.\nPartech Africa and Briter Bridges reported that African startups ended the year with $1.4 billion and $1.3 billion, respectively.\nA closer look at Digest Africa‘s numbers reveals that funding for African startups grew steadily from January to March before dropping off in April.\nAs vaccination numbers across Africa pick up and economies stabilise, investments in African startups could also see an increase."
  },
  {
    "headline": "Costanoa Ventures and CRE Venture Capital lead $7m Series A funding in Smile Identity",
    "summarized_story": "Identity verification startup, Smile Identity has announced a $7 million Series A investment led by Costanoa Ventures and CRE Venture Capital.\nOther investors that joined in the round include LocalGlobe, Intercept Ventures, Future Africa, Khosla Impact, ValueStream Ventures, Beta.\nFollowing the raise, John Cowgill, a partner at Costanoa Ventures, will be joining the board of Smile Identity.\nIn 2017, Mark Straub and William Bares founded Smile Identity after the former noticed how IndiaStack changed identity verification for Indians.\nIt also covers verification for 15 different ID types and now performs over one million identity checks monthly."
  },
  {
    "headline": "International Passport New Regime 2021 – Nigerian Observer",
    "summarized_story": "There is a new passport regime that is driven by technology.\nAregbesola has predicted that technology would play a major role in the future of the issuance of passport.\nAregbesola is considering the benefit from online passport application roll out.\nThe new date for the beginning of the new Passport Regime is now June 8.\nHowever, before the beginning of the new passport processing regime, a promise was made to Nigerians to clear all passport backlog."
  },
  {
    "headline": "Obaseki congratulates Okowa on 62nd birthday – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has congratulated his Delta State counterpart, Dr. Ifeanyi Okowa, on his 62nd birthday.\nThe governor, in a statement, said, “I celebrate with you, my friend and brother, Dr. Ifeanyi Okowa, as you add another year today.\n“I wish you many more years of impactful service to the people of Delta State and Nigeria.”Governor Obaseki lauded Okowa for his far-reaching reforms and programmes undertaken in Delta State since his foray into public service, noting that his contribution to the development of the state was phenomenal."
  },
  {
    "headline": "Obaseki pledges improved collaboration with security agencies to enhance security on Benin-Auchi Road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has reassured that the government will sustain collaboration with the military, the Nigeria Police Force, members of the Edo State Community Vigilante Security Network and other security outfits in the state to tackle insecurity on the Benin-Auchi Expressway.\nThe governor gave the assurance when he received Student Union Government (SUG) leadership of the Ambrose Alli University, on a courtesy visit at the Government House in Benin City.\nOsaigbovo Iyoha, reaffirmed the government’s commitment to the security of lives and property of Edo citizens, noting that measures had been put in place to enhance security in the axis and other parts of the state.\nAccording to him, “the issue of insecurity on the highway is not peculiar to Edo State alone.\nOsamagbe Eghobamien, decried the level of insecurity on the Benin-Auchi Road, urging the government to expedite actions to ensure the safety of road users on the axis."
  },
  {
    "headline": "Edo govt restates citizens’ role in realisation of ‘MEGA’ agenda, urges participation in governance – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has called for increased citizens’ participation in governance and decision making, urging for the support of all Edo people in the realization of the Governor Godwin Obaseki-led administration’s Making Edo Great Again (MEGA) Agenda.\nChief of Staff to the Governor, Hon.\nOsaigbovo Iyoha, gave the charge when he received the executives and members of the Immaculate Conception College Old Boys Association (ICCOBA), at the Government House, Benin City.\nIyoha, who is an alumnus of the Immaculate Conception College, noted, “We are proud of our heritage and where we come from.\nAt every opportunity, we will try and galvanize our people to make sure they participate in whatever the government is doing."
  },
  {
    "headline": "Ebonyi Govt confirms three deaths from cholera outbreak",
    "summarized_story": "ADVERTISEMENTThe Ebonyi State Government has confirmed three deaths from the cholera outbreak in Amachi-Igwebuike Village, Agba in Ishielu Local Government Area of the state.\nHe said the deaths recorded were due to the victim’s refusal to visit the hospital for treatment.\nTwelve cases were recorded from the outbreak, according to Mr Nnabu who, however, said the situation was under control.\nMr Nnabu further said the state epidemiology team had visited the area and that the cases were being handled at the General Hospital.\n“Government and well-meaning organisations should assist us in this regard and also provide other amenities for improved living conditions in this place,” Mr Nnabu said."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Globacom Announces Commencement of Pre-paid Roaming, 4G Services in China",
    "summarized_story": "Leading telecommunications service provider, Globacom, has commenced pre-paid roaming, data roaming and 4G LTE services in China and the United Arab Emirates (UAE).\nIt noted that the expansion of its roaming service to prepaid customers in China and UAE is a part of efforts to continuously enrich the experience of subscribers to its network.\nFollowing this announcement, Glo customers visiting China and UAE will have unhindered access to super-fast 4G LTE and pre-paid roaming, in addition to all postpaid services which had been launched by Globacom many years ago.\nChina and United Arab Emirates, therefore, join other countries where Glo customers can enjoy its prepaid and postpaid services.\nOthers are Mongolia, Myanmar, Maldives, Philippines, Syria, Taiwan, Tajikistan and Vietnam also form the list of countries where Glo postpaid services are also available."
  },
  {
    "headline": "Sterling Bank pledges support for Lagos Tourism Masterplan",
    "summarized_story": "Sterling Bank Plc has pledged support for the 20-year Lagos State Tourism Masterplan and Policy crafted to transform the State of Aquatic Splendour into one of the top five tourism destinations on the African continent.\nHe said although Lagos has been a beacon for managing tourism in a structured, coordinated, and sustainable manner, the unveiling of a masterplan and policy will further harness the power of innovation, entrepreneurship, and communication to develop the sector.\nHe said this is the time for collaboration and not competition among the three tiers of government.\nLagos State Commissioner of Ministry of Tourism, Arts and Culture, Pharm.\nThe commissioner said the 20-year document was conceived with the vision “to make Lagos State one of the top five urban tourism destinations in Africa and recognised as the face of art in Africa for its multiple creative and innovative tourism products and experiences."
  },
  {
    "headline": "UBA obtains order restraining Energy Firm, Polaris Bank from tampering with N2.8trn credit",
    "summarized_story": "The 3rd to 26th respondents are Access Bank plc), (Citibank Nigeria Ltd), (Diamond Bank Plc), (Ecobank Nigeria ltd), (Enterprise Bank Ltd.), (Fidelity Bank Plc.\n), (First City Monument Bank Plc), (Globus Bank Limited), (Guaranty Trust Bank Plc), (Heritage Bank Plc.\n), (Jaiz Bank Limited), (Keystone Bank Limited), (Polaris Bank Limited), (Providus Bank Limited), (Stanbic IBTC Bank Nigeria Ltd.), (Standard Chartered Bank Ltd.) (Sterling Bank Plc.\n(Titan Trust Bank Limited), (Union Bank Plc), (Unity Bank Plc.).\nIt applied to and received a $162,400,000 syndicated loan from the plaintiff, the 2nd Defendant (formerly Skye Bank Plc), Diamond Bank Plc now Access Bank Plc, First City Monument Bank Ltd, Heritage Bank Plc and Keystone Bank Ltd (jointly referred to as the lenders)."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Tears as tanker kills six students in Delta",
    "summarized_story": "Tragedy befell Army Children Primary School, Effurun in Uvwie Local Government Area of Delta State on Thursday afternoon as no fewer than six students of the school were crushed to death by a fuel-laden tanker.\nWitnesses said that the accident occurred at around 3pm directly opposite the Gen. David Ejoor Barracks of the Nigerian Army in Effurun near Warri.\nThe students were reportedly returning from school when the tanker suddenly ran into them.\nConfirming the gory incident, the acting Police Public Relations Officer for Delta State Command, DSP Bright Edafe, told journalists that six students were crushed to death, adding that “the number is tentative”.\nHowever, the PPRO could not ascertain the whereabouts of the driver of the ill-fated tanker as of the time of filing this report."
  },
  {
    "headline": "Tears as tanker kills six students in Delta",
    "summarized_story": "Tragedy befell Army Children Primary School, Effurun in Uvwie Local Government Area of Delta State on Thursday afternoon as no fewer than six students of the school were crushed to death by a fuel-laden tanker.\nWitnesses said that the accident occurred at around 3pm directly opposite the Gen. David Ejoor Barracks of the Nigerian Army in Effurun near Warri.\nThe students were reportedly returning from school when the tanker suddenly ran into them.\nConfirming the gory incident, the acting Police Public Relations Officer for Delta State Command, DSP Bright Edafe, told journalists that six students were crushed to death, adding that “the number is tentative”.\nHowever, the PPRO could not ascertain the whereabouts of the driver of the ill-fated tanker as of the time of filing this report."
  },
  {
    "headline": "COVID-19: NCDC confirms deadly Delta variant in Nigeria",
    "summarized_story": "The Nigeria Centre for Disease Control on Thursday said it has detected a confirmed case with the SARS-CoV-2 Delta variant, also known as lineage B.1.617.2.\nThe deadly Delta variant is recognised by the World Health Organisation as a variant of concern, given its increased transmissibility.\nThe variant has been detected in over 90 countries and is expected to spread to more countries, according to the NCDC.\nGiven the global risk of spread of the Delta variant, positive samples from international travellers to Nigeria are sequenced regularly,” the statement partly read.\nGiven the high transmissibility of the Delta variant and following its detection in Nigeria, NCDC urges all Nigerians to ensure strict adherence to public health and social measures in place,” the statement said."
  },
  {
    "headline": "COVID-19: NCDC confirms deadly Delta variant in Nigeria",
    "summarized_story": "The Nigeria Centre for Disease Control on Thursday said it has detected a confirmed case with the SARS-CoV-2 Delta variant, also known as lineage B.1.617.2.\nThe deadly Delta variant is recognised by the World Health Organisation as a variant of concern, given its increased transmissibility.\nThe variant has been detected in over 90 countries and is expected to spread to more countries, according to the NCDC.\nGiven the global risk of spread of the Delta variant, positive samples from international travellers to Nigeria are sequenced regularly,” the statement partly read.\nGiven the high transmissibility of the Delta variant and following its detection in Nigeria, NCDC urges all Nigerians to ensure strict adherence to public health and social measures in place,” the statement said."
  },
  {
    "headline": "Photos: Haitian Americans James Solage, Vincent among suspects in President Moise’s assassination",
    "summarized_story": "Two Haitian Americans, James Solage and Joseph Vincent were among the six suspects arrested by Haitian police in connection with the assassination on Wednesday of President Jovenel Moise.\nHaiti’s minister of elections and interparty relations, Mathias Pierre identified one of the arrested Haiti Americans as James Solages.\nCurrently, Mr. Solages works as a corporate executive serving as a consultant in different locations throughout South Florida.\nMr. Solages also serves as a politician promoting his country by focusing on compassion programs and counseling economic development program.\nMr. Solages is a youth leader and an advocate for underprivileged kids."
  },
  {
    "headline": "Dangerous Delta COVID-19 variant in Nigeria: NCDC",
    "summarized_story": "By AbankulaThe Nigeria Centre for Disease Control (NCDC) announced Thursday night that it has detected a confirmed case of the Delta variant of COVID-19, also known as lineage B.1.617.2.\n“Given the high transmissibility of the Delta variant and following its detection in Nigeria, NCDC urges all Nigerians to ensure strict adherence to public health and social measures in place.\nRead the rest of the statement:The Delta variant is recognised by the World Health Organization (WHO) as a variant of concern, given its increased transmissibility.\nGiven the global risk of spread of the Delta variant, positive samples from international travellers to Nigeria are sequenced regularly.\nGiven the high transmissibility of the Delta variant and following its detection in Nigeria, NCDC urges all Nigerians to ensure strict adherence to public health and social measures in place."
  },
  {
    "headline": "JUST IN: Fuel tanker crushes many students to death in Delta",
    "summarized_story": "By Jethro IbilekeThere was heightened anxiety on Thursday, in Effurun, near Warri, Uvwie Local Government Area of Delta State, when a fuel tanker ran into dozens of students of Army Day Secondary School, killing many in the process.\nThe accident occurred at about 3.00pm, as the students just closed from school, when the petroleum product-laden tanker, allegedly ran into them.\nNine of them were said to have been confirmed dead on arrival, while three others were referred to the Delta State University Teaching Hospital, Oghara, after being stabilised.\nA heavy duty crane was also drafted to the scene to pull off the tanker to enable rescue workers recover other pupils still trapped under the petroleum tanker.\nAs at the time of filing this report, no official statement has been issued by the Delta State Police Command, neither was the Command’s Spokesman, DSP Bright Edafe reached on his mobile phone."
  },
  {
    "headline": "Gani Adams, Yorubas Blast Buhari Govt Over DSS Detention Of Sunday Igboho’s Relatives",
    "summarized_story": "Iba Gani Adams and other leaders of the South-West Security Stakeholders Group (SSSG), a Yoruba-led coalition, have criticized the arrest of people at Sunday Igboho’s Soka residence in Ibadan, Oyo’s capital.\nThe Department of State Services (DSS) reported on July 1 that 13 of the Yoruba agitator’s associates had been apprehended.\n“As a group that is determined to secure the South-West region, we will not fold our arms and allow the criminal Fulani herdsmen to overrun our communities.\nWe also will not relent in our efforts in ensuring a safe region,” Ireti said.\nThe SSSG appealed to prominent Yoruba leaders, including traditional rulers, not to leave Igboho alone to suffer injustice against the Yoruba race."
  },
  {
    "headline": "BREAKING: Police Service Commission Rejects Ibrahim Magu’s Promoition",
    "summarized_story": "Ibrahim Magu, a former Acting Chairman of the Economic and Financial Crimes Commission (EFCC), was denied promotion by the Police Service Commission on Thursday.\nMagu would not be promoted until the Attorney-General of the Federation and Minister of Justice, as well as the Office of the Inspector General of Police, have cleared him of recent corruption charges, according to the panel.\nRecall that in July 2020, Mr Magu was arrested and forced to appear before a presidential tribunal examining claims of corruption and insubordination leveled against him by Nigeria’s justice minister, Abubakar Malami.\nMr Magu and Mr Malami have repeatedly clashed over the anti-corruption fight, and many Nigerians, including Femi Odekunle, a member of a presidential anti-corruption committee, feel Mr Magu’s plight is part of a power play with Mr Malami.\nDetails later…"
  },
  {
    "headline": "BREAKING: Gunmen Attack Imo House Of Assembly, Speaker Escapes Death [PHOTOS]",
    "summarized_story": "Unknown gunmen attacked the Imo State House of Assembly on Thursday, shooting randomly.\nThe attack occurred shortly after the leadership of the parliament suspended six house members, according to NEWS DIRECTThe assembly’s speaker, Paul Emeziem, and other members of the House narrowly avoided being shot by gunmen who invaded the building during plenary.\nThe legislators who were suspended were accused of indulging in “unparliamentary acts.”However, the state’s All Progressives Congress (APC) has requested a cease-fire following the suspension of six House of Assembly members.\nHe stated that as law-abiding citizens, the party would not only respect the Assembly’s independence, but would also support any decisions made by its leadership.\n“The APC respects the House of Assembly’s independence and supports any disciplinary procedures that promote decorum."
  },
  {
    "headline": "Unknown gunmen kidnap politician in Bauchi",
    "summarized_story": "Unknown gunmen have abducted an All Progressives Congress (APC) politician Uba Boris in Bauchi metropolis.\nAccording to reports, he was accosted by the gunmen at the CBN roundabout, close to the AA Rano filling station along the Federal Lowcost road at about 8 pm on Wednesday.\nAn eyewitness said that the politician was immediately bundled from his car into a waiting car after which they drove away still firing shots into the air.\nHe added that the kidnappers drove along Nassarawa street but made a u-turn after sighting a Police patrol van ahead and then sped along the Federal Lowcost road.\nNEWS DIRECT reports that till this morning, nothing has been heard about the whereabouts of the kidnapped politician."
  },
  {
    "headline": "‘N5.2bn fraud’: ex-JAMB registrar Ojerinde gets bail",
    "summarized_story": "The former Registrar of Joint Admissions and Matriculation Board (JAMB), Prof Lawrence Adedibu Ojerinde, was Thursday granted by a Federal High Court sitting in Abuja.\nThe bail was sequel to the bail application argued by the Defense Counsel, Peter Olorunnishola, SAN.\nBut the Prosecution’s lawyer, Shogunle, opposed the bail application, arguing that while Ojerinde was in their custody, they granted him administrative bail, but that he breached it.\nHe argued further that the claim of ill-health which Ojerinde was relying on as a ground for the bail application was not supported by a medical report.\nAccording to the bail terms, one surety must be a professor in a Federal University and the other must be a property owner in Abuja."
  },
  {
    "headline": "Breaking: Senate screens Buhari’s aide, others as INEC Commissioners",
    "summarized_story": "The Senate Committee on the Independent National Electoral Commission (INEC) has begun the screening of the nominees of the President Muhammadu Buhari including his Special Assistant on Social Media, Ms Lauretta Onochie as national commissioners of the electoral umpire.\nThey are already waiting around the Senate for screening.\nOnochie arrived at the Senate wing of the National Assembly about 11 am; accompanied by the Special Adviser to the President on National Assembly Matters, Babajide Omoworare.\nShe was immediately ushered into the office of the Chairman of the Senate Committee on INEC, Senator Kabri Gaya.\nOnochie is currently waiting for her turn to be screened by the Senate panel."
  },
  {
    "headline": "Pictures: Dignitaries grace late prophet TB Joshua’s lying-in-state",
    "summarized_story": "NextNigeria committed to implementation of MoU with The Gambia-Defence minister"
  },
  {
    "headline": "GOC 7 Division commends troops’ fighting spirit, resilience, gallantry -NigPilot",
    "summarized_story": "Gen Eyitayo lauded the troops during a maiden operational tour of 24 Task Force Brigades, Dikwa, and Special Intervention Battalion IV, as well as Mobile Strike Team 16 collocated in New Marte.\nHe commended troops’ high level of alertness and undampened fighting spirit in recent encounters with elements of Boko Haram terrorists (BHTs) and Islamic State West Africa Province (ISWAP).\nThe GOC urged the troops to sustain the momentum and ensure that remnant of the terrorists is completely neutralized.\nGeneral Eyitayo told the troops, that his visit was necessitated by the need to evaluate and address security and operational challenges, as well as issues bordering on the welfare of the troops.\nDuring the visit, the GOC inspected a large cache of arms, ammunition, and Gun trucks captured from neutralized terrorists."
  },
  {
    "headline": "MHWUN passes vote of confidence on HRM Biobelemoye -NigPilot",
    "summarized_story": "Josiah challenged staff not to hoard any information from the incoming acting Secretary-General, to enable him quickly understand the workings of his new office.\nThe Royal Father also reminded the administrative staff to render the same support extended to Late Silas Adamu to the new Acting Secretary-General, to perform his duties optimally.\nHe recalled the relentless commitment of the Late MHWU Secretary-General, Silas Adamu, and charged the new Acting Secretary-General to ensure bureaucracy is seemless in memory of his predecessor.\nAuwolu Kiawa’s Appointment, Follows the Sudden Demise of MHWUN Secretary-General, Mr. Silas Adamu, in a ghastly autocrash along Abuja- Kaduna Expressway, on 8th of March 2021.\nLate silas Adamu who died along with his wife and daughter has since been buried."
  },
  {
    "headline": "Lock-up Capital in Land breeds huge economic loss – SGoF -NigPilot",
    "summarized_story": "The Surveyor General of the Federation (SGoF), Surv Samuel Adeniran Taiwo said that Nigeria has suffered huge economic loss because of lock-up capital in land resulting from ineffective land administration, improper land use, and property management.\nHe noted that the theme of the conference, “Unlocking Real Estate Potentials for Economic Development” was timely and inspiring.\nHe added that there was no gainsaying the fact that land remained a major resource of any type of physical development, impacting heavily on national economic architecture.\nHe reiterated that land remained a major factor of production and “it is key for all purposes of socioeconomic development”.\nHead of Press and Public Relations, Office of the Surveyor General of the Federation Abu, Michael in a statement said that Surv."
  },
  {
    "headline": "Nigeria trade relation with Qatar is very low – Nigerian Envoy",
    "summarized_story": "The Ambassador Extraordinary and Plenipotentiary of the Federal Republic of Nigeria to the State of Qatar, Ambassador Yakubu Abdullahi has said that Nigeria’s trade relation with Qatar is very low.\nAmbassador Abdullahi said this while presenting his Letters of Credence to the Emir of the State of Qatar, His Highness Sheikh Tamim bin Hamad Al-Thani.\nAmbassador Ahmed expressed gratitude to President Muhammadu Buhari for finding him worthy of appointment as his Principal Envoy to the State of Qatar.\nThe Emir of Qatar in his response assured the Nigerian Envoy of his support to succeed in the discharge of his mandates.\nThe credential’s presentation ceremony was preceded by the inspection of the Guard of Honour by the Nigerian Ambassador, who until his appointment as Ambassador to the State of Qatar was the Director of Protocol, State House."
  },
  {
    "headline": "NCDC Confirms Deadly Delta COVID-19 Variant In Nigeria",
    "summarized_story": "Nigeria has confirmed the detection of the Delta COVID-19 variant in the West African country.\n“The Nigeria Centre for Disease Control (NCDC) has detected a confirmed case with the SARS-CoV-2 Delta variant, also known as lineage B.1.617.2,” the health agency said in a statement on Thursday night.\n“The variant has also been linked to a surge in cases in countries where it is the dominant strain in circulation,” the NCDC explained.\n“The surge in cases in countries across the world and Africa is an important reminder of the risk we face,” he said.\nAs of the time of this report, over 160, 000 cases of the disease have been confirmed in Nigeria."
  },
  {
    "headline": "Gunshots Fired As Imo Speaker Removes Chief Whip, Suspends Six Others",
    "summarized_story": "﻿There were sporadic gunshots and pandemonium at the Imo State House of Assembly on Thursday following the suspension of six lawmakers by the Speaker, Paul Emeziem.\nRead Also: Bandits Kill Seven, Kidnap 10 In Fresh Kaduna AttacksThe House also removed the Chief Whip, Authur Egwim, (Ideato North, APC), and replaced him with Obinna Okwara (Nkwerre, APC).\nSources told Channels Television that four All Progressives Congress (APC) lawmakers and two from the Peoples Democratic Party (PDP) were among those suspended.\nThe lawmakers are former Majority Leader and member representing Ikeduru state constituency, Uche Ogbuagu; member representing Obowo state constituency, Kennedy Ibe and member representing Oru West, Dominic Ezerioha.\nOthers are members representing Ezinihitte Mbaise state constituency, Anyadike Nwosu; member representing Owerri North Philip Ejiogu, and the member representing Ihite Uboma, Onyemechi Njoku."
  },
  {
    "headline": "PSC Drops Magu, Promotes 24 Police Commissioners",
    "summarized_story": "The Police Service Commission (PSC) has declined the promotion of a former acting chairman of the Economic and Financial Crimes Commission (EFCC), Ibrahim Magu but promoted others including 24 Commissioners of Police.\nAll newly-promoted Commissioners of Police are now ranked as Assistant Inspectors General (AIGs).\nNasarawa State; Musa Adze, CP Anti Fraud, FCIID, Abuja; Philip Sule, former CP Ebonyi and currently CP SPU Force Headquarters, Abuja; Usman Sule Gomna, CP Jigawa State Command.\nThey are Tijanni Baba who took over from Rtd DIG Aminchi Samaila Baraya for North East; Zanna Mohammed Ibrahim, who replaced Rtd DIG Ibrahim Larmode, North East and DIG Moses A. Jitoboh who succeeded Rtd DIG Ogbizi Michael for South South.\nThirty-five Deputy Commissioners of Police were also promoted to Commissioners."
  },
  {
    "headline": "I Am Not A Member Of Any Political Party, Onochie Tells Senate",
    "summarized_story": "﻿Presidential aide, Lauretta Onochie has denied involvement in partisan politics, telling the Senate Committee on the Independent National Electoral Commission (INEC) she does not belong to any political party.\nOnochie was screened as an INEC National Commissioner on Thursday despite public outcry over her nomination by President Muhammadu Buhari.\n“So, as I am sitting down here, I am not a member of any political party in this country,” Onochie told the lawmakers in Abuja, insisting that she stopped partisan politics after her principal won a second term in office in 2019.\n“Since 2019, I have not had anything to do with any political organization in this country.\nEven the Buhari support organisations, I have not had anything to do with them since 2019,” Onochie who was nominated to represent Delta State, maintained."
  },
  {
    "headline": "Insecurity: We Can’t Afford To Disappoint Nigerians – Buhari",
    "summarized_story": "President Muhammadu Buhari on Thursday reiterated his administration’s resolve in tackle the numerous security challenges in the country, noting that the Federal Government cannot afford to disappoint Nigerians.\n“This level of savagery, inhumanity and reckless disregard for the sanctity of life cannot go unpunished,” President Buhari said.\nThe President directed respective agencies under the Ministry of Humanitarian Affairs, Disaster Management and Social Development to immediately assess losses in the community and send support.\nHe equally raised a high-powered delegation to visit the community to convey his sympathies to the families of victims and the government of the north-eastern state.\nThe community is said to have come under attack in the early hours of yesterday, with insurgents shooting sporadically and setting houses and shops ablaze."
  },
  {
    "headline": "Imo PDP condemns suspension of Imo Lawmakers, says it’s undemocratic",
    "summarized_story": "The People’s Democratic Party (PDP) in Imo State has condemned the suspension of some lawmakers at the State House of Assembly.\nThe party in a statement described the suspension as undemocratic and called on the state governor to urgently intervene.\nWe would, therefore warn that the executive arm of Government should desist from its meddlesomeness in the affairs of the legislative arm.\nGovernor Uzodinma should leave Imo State House of Assembly alone to make useful laws for Imo people.\nLet there be genuine efforts to keep Imo State peaceful."
  },
  {
    "headline": "Just in: Nigeria confirms first case of COVID-19 Delta Variant",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) has detected a confirmed case of the SARS-CoV-2 Delta variant, also known as lineage B.1.617.2.\nThe variant was detected in a traveller to Nigeria, following the routine travel test required of all international travelers and genomic sequencing at the NCDC National Reference Laboratory, Abuja.\nThe NCDC says measures put up by the PSC like the introduction of travel restrictions from countries where there is a surge in cases associated with widespread prevalence of variants of concern , compulsory seven-day self-isolation and repeat test on the seventh day after arrival, are still in place to reduce the risk of spread of the virus."
  },
  {
    "headline": "Matawalle signs Zamfara State Legislative, Judiciary Autonomy Bills Into Law",
    "summarized_story": "Zamfara state governor, Bello Matawalle has assented to the Zamfara State Legislative and Judiciary Autonomy Bills into Laws.\nSpeaking shortly after the event, the governor said as a true democrat, he will continue to ensure that all statutory responsibilities are directed to the right channels.\nHe also expressed optimism that the signing of two bills will further strengthen the existing relationship between the two arms of government“I do not see any reason why we will not allow the autonomy of these two strong arms of government which will ensure the smooth running of government and the progress of our dear state.”“We will not politicize or joke with your responsibilities, your funding and the autonomy, therefore, with this signing into law, it is my strong conviction that we will continue to work as partners for the growth and progress of our dear state and the good people of Zamfara,” Governor Matawalle said.\nAdvertisementHe appealed to the Legislative arm of government to guard against all forms of corrupt practices and weed out anyone found wanting of corruptionResponding, the Speaker of the Zamfara State House of Assembly, Nasiru Ma’azu Magarya commend the governor for maintaining a cordial relationship with the legislature and judiciary, making the three arms of government a one big familyMua’zu Magarya assures that the legislative and judicial arms of government will continue to give the executive all the necessary support to forge the state forward."
  },
  {
    "headline": "Covid: Nigeria Confirms First Case of Delta Variant – Arise News",
    "summarized_story": "Health authorities in Nigeria have detected a confirmed case with the SARS-CoV-2 Delta variant, also known as lineage B.1.617.2.\nThey urged citizens to ensure strict adherence to public health and social measures given the deadly nature of the variant.\nThe Delta variant is recognised by the World Health Organization (WHO) as a variant of concern, given its increased transmissibility.\n“Given the high transmissibility of the Delta variant and following its detection in Nigeria, NCDC urges all Nigerians to ensure strict adherence to public health and social measures in place,” the agency said.\n“Proven public health and social measures such as physical distancing, frequent handwashing, and proper use of face masks, prevent infections and save lives."
  },
  {
    "headline": "Exploration of Resources Should Go Beyond Political Considerations: Yabagi Sani",
    "summarized_story": "Petroleum engineer and politician, Yabagi Sani, reacts to 30% of NNPC profits going to frontier basins exploration.\nWatch the interview for more…"
  },
  {
    "headline": "Nigeria: President Buhari’s Aide Onochie Denies Being Member of Any Political Party",
    "summarized_story": "A Nigerian presidential aide, Lauretta Onochie has denied being a member of any political party in the country.\nLast week, the leadership of the main opposition Peoples Democratic Party (PDP) staged a peaceful protest to the National Assembly to demand the rejection of Onochie.\nI follow due process, I follow the law.”Dissatisfied lawmakers on the panel however demanded Onochie reject the nomination and “protect the integrity of the president”.\nIstifanus Gyang, senator representing Plateau North, presented an affidavit in which Onochie had said she is an APC member.\nAs I am sitting down here, I am not a member of any political party in this country.”By Abel Ejikeme"
  },
  {
    "headline": "Nigeria: North-Central Kwara State Gets $6m to Build Largest Oncology Center in West Africa",
    "summarized_story": "The sum was recently awarded to the state by Abdul Samad Rabiu Africa Initiative (ASR Africa) from its annual $100 million Africa Fund for Social Development and Renewal.\nA joint announcement for the construction of the centre was made on Thursday in Ilorin by the Kwara state governor Abdulrahman Abdulrazaq and the Abdul Samad Rabiu Africa Initiative (ASR Africa).\nASR Africa is the brainchild of Nigeria’s industrialist and founder of BUA Group, Abdul Samad Rabiu.\nThis aligns with the vision of Abdul Samad Rabiu through the ASR Africa Initiative.\nThe governor in his response said, “Kwara is lucky to have the attention of Abdul Samad Rabiu, BUA Group and ASR Africa”."
  },
  {
    "headline": "Mourners Queue to Say Final Farewell to Late Nigerian Preacher TB Joshua",
    "summarized_story": "Thousands of mourners have turned up in huge numbers to view the body of influential Nigerian preacher Temitope Balogun Joshua popularly called TB Joshua, who died last month at the age of 57.\nTB Joshua was one of Nigeria’s most popular televangelists but was perhaps the least flamboyant of his peers.\nHis rise to prominence in the late 1990s coincided with the explosion of “miracle” programmes performed on national TV by various pastors.\nTB Joshua was often mocked for lacking the finesse of his colleagues during “deliverance” sessions – an intense prayer that resembles exorcism.\nHis ministry professed to heal all manner of illnesses including HIV/Aids and attracted people from all over the world."
  }
]