[
  {
    "headline": "Address high cost of essential medicines, healthcare providers tell FG",
    "summarized_story": "Angela OnwuzooHealthcare providers in Nigeria have urged the Federal Government to address the high cost of essential medicines in the country.\nAccording to them, the cost of essential medicines has been going up in recent times thus making life more difficult for Nigerians.\nThe healthcare providers under the aegis of the Healthcare Providers Association of Nigeria stressed that the FG should as a matter of urgency address the problem, lamenting that the high cost of essential medicines is causing a serious problem in the health sector.\nAccording to them, the high cost of drugs has become a heavy and unbearable burden on patients.\nHe also urged the Pharmacists Council of Nigeria and the Pharmaceutical Society of Nigeria to collaborate with healthcare providers in a joint effort to help ordinary Nigerians."
  },
  {
    "headline": "Address high cost of essential medicines, healthcare providers tell FG",
    "summarized_story": "Angela OnwuzooHealthcare providers in Nigeria have urged the Federal Government to address the high cost of essential medicines in the country.\nAccording to them, the cost of essential medicines has been going up in recent times thus making life more difficult for Nigerians.\nThe healthcare providers under the aegis of the Healthcare Providers Association of Nigeria stressed that the FG should as a matter of urgency address the problem, lamenting that the high cost of essential medicines is causing a serious problem in the health sector.\nAccording to them, the high cost of drugs has become a heavy and unbearable burden on patients.\nHe also urged the Pharmacists Council of Nigeria and the Pharmaceutical Society of Nigeria to collaborate with healthcare providers in a joint effort to help ordinary Nigerians."
  },
  {
    "headline": "South Africa says UK’s travel ban over new COVID-19 variant ‘rushed’",
    "summarized_story": "South Africa on Friday slammed as “rushed” Britain’s travel ban from six southern African countries, following the discovery of a new COVID-19 variant with a large number of mutations.\nJust hours after scientists in South Africa announced they had detected a new variant, Britain said all flights from South Africa and its neighbours Namibia, Lesotho, Eswatini, Zimbabwe and Botswana would be prohibited starting 1200 GMT on Friday.\nThe ministry said it would speak to the UK government to try to persuade it to reconsider its decision.\nSouth Africa has in recent days experienced a surge in infections -recording 2,465 new infections in a 24-hour cycle on Thursday – nearly double the previous day’s tally.\nScientists blamed the spike in infections on the variant, which goes by the scientific label B.1.1.529."
  },
  {
    "headline": "South Africa says UK’s travel ban over new COVID-19 variant ‘rushed’",
    "summarized_story": "South Africa on Friday slammed as “rushed” Britain’s travel ban from six southern African countries, following the discovery of a new COVID-19 variant with a large number of mutations.\nJust hours after scientists in South Africa announced they had detected a new variant, Britain said all flights from South Africa and its neighbours Namibia, Lesotho, Eswatini, Zimbabwe and Botswana would be prohibited starting 1200 GMT on Friday.\nThe ministry said it would speak to the UK government to try to persuade it to reconsider its decision.\nSouth Africa has in recent days experienced a surge in infections -recording 2,465 new infections in a 24-hour cycle on Thursday – nearly double the previous day’s tally.\nScientists blamed the spike in infections on the variant, which goes by the scientific label B.1.1.529."
  },
  {
    "headline": "How we’ll leverage tech to make CUSTECH world-class university— Gov. Bello",
    "summarized_story": "He said this on Thursday during the maiden matriculation ceremony for pioneer students of the university held at Osara, Kogi State.\nIt was designed and built to provide first-grade training in Science, Technology, Engineering and Mathematics (STEM) disciplines for our youth.\n“This phase will deliver the University Senate Building, the University Library, Faculty of Engineering, Faculty of Computing and Informatics, and Faculty of Basic Medical and Health Sciences.\nThis support will help us achieve our desire to make this university of international standard all the more faster”, he said.\nHitherto, the Eastern and Western Senatorial districts already have the Prince Abubakar Audu University, Anyigba, and the Federal University, Lokoja respectively."
  },
  {
    "headline": "Highway attacks: Again CNG tackles Buhari, says his threats ineffective",
    "summarized_story": "Following the renewed regular attacks on passengers on Kaduna-Abuja highway, and the recent order by President Muhammadu Buhari for troops to get merciless with bandits, the Coalition of Northern Groups (CNG) has described the administration as the worst in the history of the country.\nHe said as things stand, the federal government and troops can no longer be relied upon to provide even the minimal guarantee of security for citizens.\nThe Coalition said northerners have heard enough of excuses and fake promises of action from the Buhari-led administration.\nCNG said it was unacceptable for the people of the North to continue to live under this level of exposure to criminals who freely attack, kill, maim, rape, kidnap, burn villages and rustle cattle, while the President and security chiefs issue threats and promises that have no effect.\nIt said further that the situation under which all northern communities live today is no longer tolerable, adding that everyone must rise to protect themselves."
  },
  {
    "headline": "Nembe: Leaking wellhead to be secured in 48 hours – Aiteo",
    "summarized_story": "Aiteo Eastern Exploration and Production Company (AEEPCO) Friday said the wellhead in the Santa Barbara South field in Nembe, Rivers State which blew up on November 5, would be secured in 48 hours.\nIt said its Safety and security and HSE teams are monitoring the quality of air every six hours to ascertain the livability of the areas adjoining ground zero, while also mobilizing additional relief materials for the affected communities.\nThe firm disclosed this in a statement by the Group Managing Director (GMD) Aiteo Eastern E & P Company Ltd, Mr Victor Okoronkwo.\nThe wellhead in the Santa Barbara South field blew up on November 5, spewing oil into the water bodies.\nUseh assured the minister that the well would be secured within 48 hours of the visit."
  },
  {
    "headline": "We’ve paid N11.76bn to over 530,000 bank depositors —NDIC",
    "summarized_story": "*Warns Nigerians against Ponzi schemes, illegal fund managersBy Gabriel EnogholaseNIGERIA Deposit Insurance Corporation, NDIC, has disclosed that it has paid a cumulative amount of N11.76 billion as insured sum to 535,815 depositors of closed banks since its inception till date.\nHe said: “Instructively, the corporation has declared full payment of insured and uninsured sums to depositors of 18 banks in liquidation.\nThis implies that the corporation has realised liquidation dividend to pay all depositors of the banks who present themselves for payment.\n“Before now, a lot of people did not know what NDIC is, but your presence has changed the narrative.\nWe don’t want a situation where we put our money in the bank and do not get it,” Omo-Ojeonu said."
  },
  {
    "headline": "Breaking: Suspected Fulani herdsmen abduct 10 travelers, rape, stab woman to death in Abia",
    "summarized_story": "The victim who was reportedly stabbed by the bandits hailed from Amagu, Mbaugwu, Uturu in Isuikwuato LGA.\nConfirming the dastardly incidents to our Correspondent, the Isuikwuato LGA Chairman, Hon.\nThe Council boss particularly expressed shock and rage that bandits successfully abducted travelers despite having many security checkpoints on the same road.\nOn the identity of the abducted travelers, the LG boss said efforts were ongoing to unravel it.\nKidnapping for ransom by Fulani bandits have become a regular occurrence around Isuikwuato LGA and some parts of Abia North."
  },
  {
    "headline": "Benue Govt allocates hectares of land for low-income houses for civil servants",
    "summarized_story": "Benue State Government has allocated 127 hectares of land to Family Homes Funds, an agency of the Federal Government for the purpose of building low-income houses for civil servants in the state.\nGovernor Samuel Ortom stated this Thursday, November 25, 2021, when he received the Managing Director and Chief Executive Officer, Family Homes Funds, Mr. Femi Adewole, in his Abuja residence.\nThe Governor, who commended the Federal Government for the initiative, said he was happy that Benue State is considered to be part of the scheme.\nEarlier, Adewole had implored state governors to take direct ownership of the project.\nHe disclosed that the idea was to make housing affordable to all Nigerians particularly the low-income earners."
  },
  {
    "headline": "There’ll be no elections in 2023 – Nigerian prophet warns IGP, AGF, Defence minister",
    "summarized_story": "Apostle Paul Okikijesu of the Christ Apostolic Miracle Ministry has said that there will be no general election in Nigeria in 2023.\nHe also said that the Minister of Defence, the Attorney-General of the Federation and the Inspector-General of Police, need to be prayerful.\n“This period is a grave and critical time for these aforementioned people; including the Minister of Defence, Attorney General and the Inspector General of Police,” he said.\n“I am sending messages to the Minister of Defence, Attorney General and the Inspector General of Police again this year, that they should be prayerful; because the spiritual vehicle of Nigeria is currently bowing down its head.\nSome aspirants will be after one another’s life; while death will not allow some aspirants to survive this year 2021."
  },
  {
    "headline": "Boko Haram will soon recruit out-of-school children – Obasanjo warns Buhari",
    "summarized_story": "Former President Olusegun Obasanjo has warned that Boko Haram might soon recruit out-of-school children if the government fails to return them to their classrooms.\nObasanjo said this while addressing participants at the presidential youth mentorship retreat held at the Youth Development Centre, Olusegun Obasanjo Presidential Library, Abeokuta, Ogun State.\nObasanjo blamed security challenges in the country for the increasing rate of out-of-school children.\nHe lamented that about 14 million children who ought to be in school are on the streets; therefore, the situation can worsen the nation’s security situation.\nNigeria has highest number of out-of-school children in sub-Saharan Africa – Minister"
  },
  {
    "headline": "Cleric asks Davido, others to help IDPs, orphans in north",
    "summarized_story": "The General Overseer, Christ Evangelical and Life Intervention Ministry, Kaduna, Pastor Yohanna Buru, has called on popular musician, David Adeleke also known as Davido, to extend his humanitarian assistance to some Northern orphanage homes, following the increased number of orphans and widows due to bandit attacks.\nHe called on Northern traditional and modern musicians, top celebrities, actors, and wealthy individuals as well as corporate organizations to emulate such gestures with the aim of reducing hardship been faces by millions of orphans and widows in the region.\nSpeaking during an interactive section with Christians and Muslim clerics towards promoting peaceful co-existence among different faith-based organizations and Kaduna to mark the end of World International Tolerance Week by United Nations, he noted that millions of children have been turned to orphans due to the attacks by Boko Haram, bandits, kidnapping and terrorism.\nHe enjoined all the 774 chairmen of local government areas in the country to support changing the lives of orphans for the better in the future.\nDavido’s N250m: Group makes case for northern orphans"
  },
  {
    "headline": "No plans to install Olufon today – Ruling family dispels rumour",
    "summarized_story": "The Morounfolu royal family of Ifon-Orolu kingdom has dismissed the rumour in circulation that the Osun State Governor, Adegboyega Oyetola has decided to go ahead with the installation of the new Olufon on Friday, November 26, 2021.\nThe Moronfolu royal family seized the opportunity to remind Orolu indigenes that the town being a peaceful one will not do anything that can rubbish its traditions and culture.\nTherefore, we request the Osun State Government to make immediate remediation of this grave error.\n“We also assure all the Royal Family and traditional Chiefs of their safety and caution that they should not succumb to cheap frustration that is targeted to impose new Olufon on the Ifon-Orolu Kingdom,” he said.\n“We are seizing this medium to call the attention of all security agencies to rescue Orolu people from intimidation by fake and hired hooligans that are impersonating them just to perpetrate illegalities.”"
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "CJN, Supreme Court Justices, Ozekhome, others to celebrate 40 years as lawyers",
    "summarized_story": "The Chief Justice of Nigeria (CJN) Justice Ibrahim Muhammad, some Justices of the Supreme Court and the Court of Appeal, as well as some Senior Advocates of Nigeria (SANs) are to converged on Abuja on Saturday to celebrate their 40 years of qualification as lawyers.\nThe Nigerian Law School Class of 1981 has as its Chairman, Mike Ozekhome (SAN).\nWhen we look back, 40 years ago in the lives of each and everyone of us, we certainly have so much to be grateful for.\n“As we know, our Set currently boasts of 6 members at the same time in the Supreme Court, with a Chief Justice of Nigeria, and a 7th Supreme Court Justice, now, the Emir of Lafia.\nUche assured that adequate security arrangements have been put in place to make the anniversary hitch free for the celebrants."
  },
  {
    "headline": "VIDEO: How we kidnapped Deeper Life Pastor, by suspect",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "NLC calls for implementation of core development plans",
    "summarized_story": "The Nigeria Labour Congress (NLC) has said social services must be improved in Africa, calling for the implementation of the core provisions of development plans with a focus on the fourth industrial revolution.\nThis challenge is symptomatic of poor industrialisation and the consequent dearth of decent jobs in Africa,” it said.\nAccording to the union, poor industrialisation results in low productivity, stunted economic growth, fewer jobs, and social chaos.\nIt highlighted the importance of paying serious attention to industrialisation, productivity, economic growth, job creation and social development in Africa.\n“There are several ways to catch up before we can hop on the train of the fourth industrial revolution."
  },
  {
    "headline": "Elimination of child labour critical to West Africa’s development, say experts",
    "summarized_story": "The International Labour Organisation (ILO) says the elimination of child labour is critical to the growth and development of West Africa.\nThe impacts of child labour on our safety and development cannot be over-emphasised.\n“Take immediate and effective measures to eradicate forced labour, end modern slavery and human trafficking and secure the prohibition and elimination of the worst forms of child labour, including recruitment and use of child soldiers, and by 2025 end child labour in its forms.\nDeputy Director, Inspectorate, Ministry of Labour and Employment, Olaolu Olaitan, cautioned that not all work done by children are child labour, saying there are differences between child labour and child work.\nTo tackle the menace, Dauda said the ministry was reviewing the Labour Act CAP L1, LFN, 2004 and other labour laws to address the gaps in labour administration and elimination of child labour."
  },
  {
    "headline": "Herdsmen kill 11 persons in Plateau village",
    "summarized_story": "“Again this same Fulani herders attacked the Village of Ta’agbe and as at now we have already established the dead of 11 people while the search is ongoing.\nThe Governor totally condemned the attack and said there is no explanation that can justify it.\nHe therefore directs security agencies to take immediate and drastic steps to apprehend the perpetrators and ensure that they pay for their crimes.\nLalong said “the persistent attacks in this general area remains condemnable and unacceptable to Government.\n“I expect the security agencies to deploy everything at their disposal to arrest those who carried out the crime no matter how long it takes."
  },
  {
    "headline": "Ohanaeze congratulates the first woman president",
    "summarized_story": "The National leadership of the Apex Igbo social-cultural Organization, Ohanaeze Ndigbo Worldwide, has sent a congratulatory message to the newly elected President of Ohanaeze Ndigbo UK and Ireland, Chief Lady Aqueen Ibeto.\nStepping into the culturally reserved enclave of men, Aqueen Ibeto made history, became the very first Igbo woman to be entrusted with the exulted office of Ohanaeze President anywhere in the world.\nChief Lady Aqueen Ibeto came into prominence with her election as the deputy President of Ohanaeze UK, representing Enugu State in 2018.\nThe office of the President General of Ohanaeze Ndigbo Worldwide will always accord you all the support and cooperation while your tenure ends”.\nThis special recognition by the National headquarters of Ohanaeze Ndigbo worldwide has put to rest some discordant voices that are not comfortable with the emergence of woman as Ohanaeze President."
  },
  {
    "headline": "No rest until insurgents, bandits’re crushed –Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has again issued marching order to security chiefs over insecurity across the country occasioned by activities of bandits and insurgents, saying they must not rest until all Nigerians are at rest.\nMinister of Interior, Rauf Aregbesola, made the disclosure at the end of the National Security Council (NSC) meeting at the State House, Abuja.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nThe police and other security agencies had been mobilised to intensify surveillance, patrol in pursuit of the criminals.\n“The president was particularly happy with the fact that a free and fair election was made possible by the INEC and our security agencies."
  },
  {
    "headline": "‘FG’s bailout funds to states hit N1.7trn’",
    "summarized_story": "From Fred Itua, AbujaBailout funds given to the 36 states to cushion the effects of recession have hit N1.75 trillion.\nThe funds approved by the President Muhammadu Buhari-led Federal Government did not get the nod of the National Assembly.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nA former senator, Dino Melaye, during a press conference, wondered why President Buhari has not queried how governors expended the funds since the first tranche was given.\n“Each state is to receive N18.2 billion from the facility, which according to the report, will help the states afford the repayment of previous bailout facilities namely the Salary Bailout, Excess Crude facility and Budget Support facility guaranteed to them by the Federal Government."
  },
  {
    "headline": "Sultan, Fayemi, Ikpeazu, Lalong others to brainstorm on insecurity in Abuja",
    "summarized_story": "From Fred Itua, AbujaReligious, traditional and political leaders have concluded plans to converge on Abuja for national unity summit.\nAccording to organisers of the event, it would provide a platform for illustrious Nigerians representing diverse interests and groups to have a meaningful conversation on the themes of peace, unity, equity and nation-building.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nThe summit would also provide new perspectives to the issues of equity, inclusion and economic prosperity for Nigerians and in the end, stimulate the process of national healing, understanding and progress.\nAlso expected are Prof. Attahiru Jega, former Chairman of INEC, who is to deliver the keynote address and Prof. Doyin Salami, chairman of the Presidential Economic Council."
  },
  {
    "headline": "Breaking: Fresh Attack on Plateau, Several People Killed, Houses Burnt",
    "summarized_story": "Corpses evacuated, says community leaderSeriki Adinoyi in JosNo fewer than 10 persons were killed as gunmen attacked Te’egbe community in Bassa Local Government Area of Plateau state on Friday.\nSpokesman for the Miango Youth Development Association, Mr Nuhu Bitrus, while confirming the attack on Friday morning said search and rescue operations for the victims were still ongoing.\nHe said, “Last night was really another black day for the Rigwe nation as (suspected) Fulani militia attacked Te’egbe village, killed so many people and injured many others.\nThey also set their houses on fire.\nWe will let you know when we are done with the search and rescue operation.”The Police are yet to confirm the incident."
  },
  {
    "headline": "In Matching Words with Action, Emefiele Inaugurates N500m Youth Entrepreneurs’ Scheme",
    "summarized_story": "He urged government at all levels to evolve policy measures to support entrepreneurial development among the youth in the country.\nOther members of the BoE include Chief Financial Officer, First Bank Plc, Mr. Patrick Iyamabo; Mr. Adamu Lawani (Zenith Bank Plc); Ms. Ngover Ihyembe-Nwankwo (Rand Merchant Bank); Mr. Ashafa Ladan (National Universities Commission); Mr. Abbati D.K.\nEmefiele also noted that the development grant component was aimed at raising awareness and visibility of entrepreneurship among undergraduates of Nigerian tertiary institutions.\nHe insisted that the grant awards should be used by the tertiary institutions solely for the development of the award-willing ideas.\nHe said the CBN was playing a significant role in laying a solid foundation for technological development in the tertiary institutions."
  },
  {
    "headline": "FG: Nembe Oil Spill Now Under Control",
    "summarized_story": "Minister of Environment, Sharon Ikeazor, who made disclosed the control of the spill at the weekly ministerial press briefing organised at the State House, Abuja.\nSylva, also disclosed that the federal government and Aiteo oil company had moved to contain the massive oil spill.\nShe also disclosed plans to institute stiffer penalty for companies involved in oil spill in the country, adding that the operating company is blaming locals for the latest incident in OML29, Nembe.\nShe said, “I got briefings and what I saw in terms of the pollution either through oil refining or illegal oil refining and otherwise – the devastation of the Niger Delta is massive.\nIt’s a collective action between the Ministry of Petroleum Resources, the Ministry of Environment, and the oil company involved."
  },
  {
    "headline": "Oil Market Defies US-led Coalition’s Strategy to Lower Rising Prices",
    "summarized_story": "Emmanuel Addeh in AbujaDespite the United States-led coalition’s strategy to cool oil prices, the market remained steady yesterday, with Brent, Nigeria’s benchmark oil, still above $80 per barrel.\nCrude oil prices recently touched seven-year highs and although they are still some way short of levels reached between 2011 and 2014, when they broke through $100 a barrel, many consumers are feeling the pain of a dramatic increase from a year ago.\nHigh oil prices have added to inflationary concerns, with the coordinated release expected to add around 70-80 million barrels of crude supply to markets, according to analysts at Goldman Sachs.\nThe US Department of Energy had launched an auction to sell 32 million barrels of strategic petroleum reserves(SPR) for delivery between late December to April 2022.\nThat is, if 66 million barrels are injected by major consumers over the two-month period, according to a document leaked to the public."
  },
  {
    "headline": "Buhari Presides over Security Meeting, Decorates ADC With New Rank",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari on Thursday presided over the National Security Council (NSC) meeting at the State House, Abuja.\nThe meeting is being attended among others by the Vice President Yemi Osinbajo, Chief of Staff to the President, Prof Ibrahim Gambari; National Security Adviser (NSA), Major General Babagana Monguno (rtd) and the Chief of Defence Staff (CDS), General Leo Irabor.\nThe three service chiefs of Army, Navy and Air Force as well as the Inspector General of Police, Usman Alkali Baba, are also attending the meeting.\nThe President is expected to be briefed about latest security developments across the country.\nBefore the commencement of the meeting, President Buhari with the assistance of Vice President Osinbajo decorated his Aide De Camp (ADC), Lt Col Yusuf Mukhtar Dodo, with his new red neck rank of Collonel."
  },
  {
    "headline": "BREAKING: Appeal Court Backs Forfeiture Of Ex-Minister, Diezani's $40million Jewellery Including 315 Costly Rings, 189 Wristwatches To Nigerian Government",
    "summarized_story": "The Appeal Court held that there was no substance in Diezani's bid to overturn the lower court's order.\nThe appellate court gave its judgment in an appeal filed by Diezani marked as Appeal - No CA/L/1263/19 between Diezani Alison-Madueke and the EFCC).\nOn July 5, 2019, the EFCC secured an order of the high court temporarily forfeiting the expensive items to the Nigerian Government.\nThe Former Minister on her part had challenged the seizure of the jewellery from her premises by the EFCC.\nShe also accused the anti-graft agency of entering her apartment illegally and taking the items without any court order."
  },
  {
    "headline": "BREAKING: Appeal Court Backs Forfeiture Of Ex-Minister, Diezani's $40million Jewellery Including 315 Costly Rings, 189 Wristwatches To Nigerian Government",
    "summarized_story": "The Appeal Court held that there was no substance in Diezani's bid to overturn the lower court's order.\nThe appellate court gave its judgment in an appeal filed by Diezani marked as Appeal - No CA/L/1263/19 between Diezani Alison-Madueke and the EFCC).\nOn July 5, 2019, the EFCC secured an order of the high court temporarily forfeiting the expensive items to the Nigerian Government.\nThe Former Minister on her part had challenged the seizure of the jewellery from her premises by the EFCC.\nShe also accused the anti-graft agency of entering her apartment illegally and taking the items without any court order."
  },
  {
    "headline": "BREAKING: Nigeria's Anti-graft Agency, EFCC Invites About 25 Senior Civil Servants For Questioning Over Alleged Corruption",
    "summarized_story": "The anti-corruption agency, Economic and Financial Crimes Commission (EFCC) has invited about 25 members of the Association of Senior Civil Servants of Nigeria (ASCSN), for questioning over alleged corruption, SaharaReporters has learnt.\n\"Our source also confirmed the interrogation of the Kwara State secretary of the union, Comrade Joseph Meshech.\nAmong those also invited for interrogation include the Deputy Secretary-General of ASCSN Comrade, Apebo Joshua.\nGroups like the All Workers Convergence (AWC) and the Congress of Senior Civil Servants of Nigeria (CSCSN) have been raising alarm over the rot in the labour movement especially in the Association of Senior Civil Servants of Nigeria (ASCSN) which has assumed a crisis situation.\nLawal must pay for his crimes against Civil Servants and humanity."
  },
  {
    "headline": "BREAKING: Nigeria's Anti-graft Agency, EFCC Invites About 25 Senior Civil Servants For Questioning Over Alleged Corruption",
    "summarized_story": "The anti-corruption agency, Economic and Financial Crimes Commission (EFCC) has invited about 25 members of the Association of Senior Civil Servants of Nigeria (ASCSN), for questioning over alleged corruption, SaharaReporters has learnt.\n\"Our source also confirmed the interrogation of the Kwara State secretary of the union, Comrade Joseph Meshech.\nAmong those also invited for interrogation include the Deputy Secretary-General of ASCSN Comrade, Apebo Joshua.\nGroups like the All Workers Convergence (AWC) and the Congress of Senior Civil Servants of Nigeria (CSCSN) have been raising alarm over the rot in the labour movement especially in the Association of Senior Civil Servants of Nigeria (ASCSN) which has assumed a crisis situation.\nLawal must pay for his crimes against Civil Servants and humanity."
  },
  {
    "headline": "How Nigerian Army Has Illegally Detained 95 Igbos In Kaduna Prisons Since 2020 #EndSARS Protest—Report",
    "summarized_story": "International Society for Civil Liberties and Rule of Law has accused the Nigerian army of unjustly detaining no fewer than 95 persons abducted from Obigbo, Rivers State and Orlu, Imo State in Kaduna Prisons.\nThe human rights watch also known as Intersociety said the detainees had been denied access to their families and lawyers since their abduction by Nigerian soldiers in October and November 2020.\n“The total number discovered was 100 persons and out of same only one whose father has links in the military has regained freedom.\nFour have died including Citizen Ugochukwu, who died of Asthma, leaving 95 others remaining and presently languishing in the Kaduna Prisons and Lock Centers.\n“Till date, the whereabouts of the remaining 257 others held in different parts of the State have remained unknown."
  },
  {
    "headline": "Africa Investment Forum: A continent; its destiny and capital",
    "summarized_story": "AdvertisementThe Africa Investment Forum Market Days event brings together investors, project sponsors, transaction advisors, legal and other applicable professionals under ‘one roof’ to engage and continue the process of addressing the continent’s investment gap.\nThe inaugural Africa Investment Forum 2018 (AIF2018) boardrooms convened investors, project sponsors, and transaction facilitators around 63 deals valued at $46.9 billion.\nClearly, Africa needs investment in critical infrastructure – power, transportation, water, agriculture, etc — if it must industrialise and bridge the deficit, as well as reduce the unemployment of millions of youths.\nNigeria has been a principal feature in the Africa Investment Forum since 2018.\nThe Africa Investment Forum offers Nigeria a smorgasbord of opportunities to attract the needed investments to the country."
  },
  {
    "headline": "Africa Investment Forum: A continent; its destiny and capital",
    "summarized_story": "AdvertisementThe Africa Investment Forum Market Days event brings together investors, project sponsors, transaction advisors, legal and other applicable professionals under ‘one roof’ to engage and continue the process of addressing the continent’s investment gap.\nThe inaugural Africa Investment Forum 2018 (AIF2018) boardrooms convened investors, project sponsors, and transaction facilitators around 63 deals valued at $46.9 billion.\nClearly, Africa needs investment in critical infrastructure – power, transportation, water, agriculture, etc — if it must industrialise and bridge the deficit, as well as reduce the unemployment of millions of youths.\nNigeria has been a principal feature in the Africa Investment Forum since 2018.\nThe Africa Investment Forum offers Nigeria a smorgasbord of opportunities to attract the needed investments to the country."
  },
  {
    "headline": "Nigeria Air will commence operation with three rented planes, says FG",
    "summarized_story": "The federal government says that Nigeria Air will commence operations with three wet-leased aircraft.\nAdvertisementWet-lease is an arrangement covering the hire of an aircraft, including the provision of a flight crew and sometimes fuel.\n“They will start with wet-leased aircraft and that’s how 90 percent of airlines in the world would have started,” he said.\n“Nigeria Air would be quoted on the stock exchange and Nigerians would be allowed to buy shares in the airline.\n“This is because Nigeria Air is a limited liability company for now, registered under the law of the land and structured in a public-private partnership (PPP) manner."
  },
  {
    "headline": "Nigeria Air will commence operation with three rented planes, says FG",
    "summarized_story": "The federal government says that Nigeria Air will commence operations with three wet-leased aircraft.\nAdvertisementWet-lease is an arrangement covering the hire of an aircraft, including the provision of a flight crew and sometimes fuel.\n“They will start with wet-leased aircraft and that’s how 90 percent of airlines in the world would have started,” he said.\n“Nigeria Air would be quoted on the stock exchange and Nigerians would be allowed to buy shares in the airline.\n“This is because Nigeria Air is a limited liability company for now, registered under the law of the land and structured in a public-private partnership (PPP) manner."
  },
  {
    "headline": "Court proscribes bandit groups, declares them terrorists",
    "summarized_story": "A federal high court in Abuja has declared the activities of Yan Bindiga and Yan Ta’adda bandit groups as acts of terrorism.\nMohammed Abubakar, director of public prosecution (DPP) at the federal ministry of justice, who filed the motion ex-parte, said President Muhammadu Buhari gave approval for his action, of which objective is the proscription of Yan Bindiga and Yan Ta’adda groups and other terrorist groups in the country.\nDelivering ruling on Thursday, the court specifically declared the activities of the “Yan Bindiga group” and the “Yan Ta’adda group” and other similar groups in any part of the country, especially in the north-west and the north-central as “acts of terrorism and illegality”.\nAdvertisementThe court proscribed the activities of the group as well as other similar groups in any part of Nigeria, “either in groups or as individuals by whatever names they are called”.\nThe court asked the federal government to publish the proscription order in the official gazette and two national dailies."
  },
  {
    "headline": "African female founders need access to high-impact mentors",
    "summarized_story": "Beyond funding, African female entrepreneurs need access to high-impact mentors and who are willing to open up their network and teach what they know.\nWhile FirstCheck argues that African women in tech are “over-mentored” and “under-funded”, early-stage female founders need some handholding.\nSo Ouffata founded The African Tech Vision (ATV) to create and open up entrepreneurial pathways for ambitious African female founders and executive leaders.\nEmpowering African female entrepreneurs at scaleThe African Tech Vision is a free entrepreneurial programme designed to support early-stage African female founders and help them achieve their goals.\nFor Ouffata, betting on African female founders is a personal decision that fits into the larger vision of The African Tech Vision program."
  },
  {
    "headline": "Bolt partners with MAX to expand its vehicle finance scheme in Nigeria",
    "summarized_story": "In Nigeria, insufficient purchasing power among middle-class citizens, coupled with limited or no access to vehicle financing, puts car purchases out of reach for over 90% of the population.\nEarlier this year, Bolt launched a vehicle financing programme that offered drivers a flexible plan through which they could purchase their own vehicles.\nFor the partnership with Bolt, the company’s alternative credit-scoring technology will allow access to proprietary performance and revenue analytics to underwrite the Bolt car loans for drivers.\nThe car financing programme is currently open only to drivers in Lagos and Abuja, with Bolt planning to expand the offer to all active drivers across Nigeria.\nThe low rate of vehicle ownership in Nigeria is similar across Africa, a continent with the lowest per capita vehicle ownership in the world."
  },
  {
    "headline": "Jump Capital leads $4.2m seed round in Nigerian crypto exchange Busha",
    "summarized_story": "Busha, a Nigeria-based digital platform that helps people buy, sell and store cryptocurrency, has raised seed funding of $4.2 million in a round led by Jump Capital.\nCadenza Ventures, Blockwall Capital, CMT Digital, Greenhouse Capital, Raba Capital, and other investors also participated in the financing round.\nAccording to the company, the new funding will go towards deepening its market positioning in Nigeria, the leading crypto economy in Africa where all of its users are based.\nAs crypto adoption in Africa continues to accelerate, the inclusive offering from Busha is in line with the company’s stated mission to make crypto accessible to a broader population and reduce entry barriers.\nFor context, there are more than a million registered accounts from Nigeria on Paxful, an international peer-to-peer bitcoin marketplace."
  },
  {
    "headline": "Ex-DealDey managers reunite to launch ThankUCash deals",
    "summarized_story": "And at its peak, the startup could claim to be sub-Saharan Africa’s largest online deals platform.\nInterestingly, some of DealDey’s former managers—including Mohammed Abubakar, Juwon Ajao, and Joy Amadi—now have an opportunity to take another shot at building the continent’s largest online deals platform, but this time under the ThankUCash brand.\nThankUCash intends to leverage its existing analytics capabilities in order to do things better now, according to Simeon Ononobi.\nSimeon Ononobi is bullish on ThankUCash’s chances of becoming a super aggregator of such deals, helping businesses grow and consumers access bargains.\n“It’s huge,” the CEO said of his company’s ambitions in the online deals space."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Today, we'll be discussing: What to expect at Techpoint Build 2021All you need to know about meme..."
  },
  {
    "headline": "The next frontier for fintech: Disruptive business models",
    "summarized_story": "Africa’s fintech industry is one of the largest and probably the most advanced.\n“We would see more fintech companies, funding more fintech companies.\nCurrently, the fintech industry is very API and cloud computing driven.\nHowever, Olowe and Hassan believe that rather than disruptive technologies, it would be a more disruptive business model.\nCiting companies like Inflow Finance and Sproutly Nigeria, Hassan says infrastructure like Mono’s would be the base of novel business models."
  },
  {
    "headline": "Nigerian fintech startup, FairMoney, hosts its first “Investor Conference”",
    "summarized_story": "Laurin Hainy, CEO and Co-Founder of FairMoneyAs of October 2021, Africa: The Big Deal reported that 57% of the amounts raised which was slightly above $1.6 billion has gone to fintech startups.\nOne such fintech is FairMoney, a digital bank that currently offers lending services in Nigeria, India, and France.\nL – R: Oluwatomide Oluwole, Finance Manager, FairMoney; Henry Obiekea, VP CapitalMarkets, FairMoney; Yaw Mante, Head, Finance – FairMoney and James Edeh, Head,Compliance, FairMoney, at the FairMoney investor’s conference.\nThey need to be able to pay, they need to be able to save, they need to be able to invest.\nThere was also a panel session on the role of fintech startups in financial inclusion in Nigeria."
  },
  {
    "headline": "Nigeria’s ranking on NFTs, Asilimia’s $2m funding, OnePipe’s $3.5m seed",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:Nigerians and NFTsAsilimia’s $2m fundingOnePipe’s $3.5m seedNigeria’s NFT rankingA new report by Finders.com shows that 13.7% of Nigerian Internet users own non-fungible tokens (NFTs).\nThe report was based on a survey conducted on 1,205 Nigerian Internet users.\nThe survey also went on to estimate that Nigeria’s NFT ownership rate could reach 35% as 21.7% of the surveyed Internet users, plan to own NFTs.\nCan 1,205 Internet users out of 101.72 million tell the true story about NFTs in Nigeria?\nOnePipe’s $3.5m seedOnePipe teamNigerian fintech API, OnePipe, has closed a $3.5 million seed, co-led by Atlantica Ventures, Tribe Capital and V&R Associates."
  },
  {
    "headline": "Global stocks and oil tumble on new coronavirus fears after new variant found",
    "summarized_story": "Global stocks and oil tumble on new coronavirus fears after new variant foundStocks, Treasury yields and oil sank in early trading Friday while the yen jumped as a new Covid-19 strain discovered in southern Africa sent a chill across global markets.\nThe World Health Organization and scientists in South Africa are studying the recently identified variant described as very different to previous versions and of serious concern.\nThe U.K. and Israel banned flights from South Africa and some neighboring countries.\nRead also: The US hints at suppression of global oil pricesFutures in London slid toward $80 a barrel as crude was swept up in a wave of caution across global markets.\n“The new Covid variant found in South Africa is ringing fresh alarm bells,” said Vandana Hari, founder of Vanda Insights in Singapore."
  },
  {
    "headline": "Ties with global firms seen unlocking Nigeria’s pharma opportunities",
    "summarized_story": "Opportunities lie in these quests for local companies with idle capacities estimated to have a $4 billion growth potential that key stakeholders say can be unlocked through contract manufacturing.\nAccording to the Nigerian Representative of Overseas Pharmaceutical Manufacturers (NIROPHARM) sector analysis, African markets are diverse in consumer choices, pricing, manufacturing, and distribution.\nThere has been a significant increase in the number of these partnerships in manufacturing, contract manufacturing, and distribution over the last 10 years.\nAlready, there seems to be a clear indication of the growing investment in higher quality drug manufacturing in Nigeria.\n“All of the above factors support the case for a strategic contract manufacturing plan for Nigeria,” it said."
  },
  {
    "headline": "Task before PDP’s new executive ahead inauguration",
    "summarized_story": "Ahead of the December 10, 2021, inauguration date for the newly elected members of the National Working Committee (NWC) of the People’s Democratic Party (PDP), Nigerians have tasked the Iyorchia Ayu-led executive to urgently reposition the party for victory in 2023 and beyond.\nPerhaps, one of the key issues that has remained controversial is where the party should zone the presidency in 2023.\nAmong them are two former Senate presidents, Bukola Saraki, Pius Anyim; Bala Mohammed, Bauchi State governor, and Sam Ohuabunwa, a pharmacist and business executive.\nIt is a key decision that could determine the party’s fate in the 2023 general election,” Adewale notes.\nThey know where they are coming from and the onerous tasks ahead of them,” Anene states."
  },
  {
    "headline": "No Truth About Rumored 5k Disburment for Nigerians – Senator Olamilekan – Nigerian Observer",
    "summarized_story": "Senator Olamilekan stated this during the presentation of 2022 budget report before the committee on Appropriations in Abuja.\nSenator Solomon Adeola Olamilekan said the budget appropriated for the Ministry of Finance has fallen below standard and needed to be reviewed.\nAlso presenting his committee’s report on power, senator Gabriel Suswam said the 2022 budget was aimed addressing some challenges in the power sector.\nSenator Suswam said he was worried with the poor electricity supply in the country looking at the funds expended on the sector.\nSenator Gabriel Suswam said that already the ministry of power has begun to carry out minor road construction to the site."
  },
  {
    "headline": "Secret Employment on-going in Civil Service – Senate – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Senate has bemoaned the high scale secret employment ongoing in the civil service despite claims that the Federal Government has placed embargo on job placement.\nThe Senate Committee on Federal Character and Inter- Governmental Affairs said government should as a matter of urgency ensure recruitment of eligible Nigerians into public service.\nChairman of the Committee, Senator Danjuma La’ah made this known while submitting the report of the committee to the Senate Appropriations Committee compiling submission on the 2022 budget in Abuja.\nSenator La’ah challenged the Federal Government to come out with evidence on job embargo while standing his ground that top civil servants engaged in secret job placement.\nThe Senate Committee demanded that Federal Government should step up process of employment to engage millions of Nigerians."
  },
  {
    "headline": "Poor Funding Responsible for Development of Mines & Steel Sector – Senator Almakura – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The chairman senate Committee on Mines and Steel, senator Tanko Al Makura has said that poor funding in the Mines and Steel sector has stalled its development in the country.\nSenator Tanko Al Makura made this known during the presentation of the committee’s report before the appropriations committee in Abuja.\nAccording to Senator Tanko Al Makura who spoke passionately about the development of Solid Minerals, bemoaned the poor funding of the sector as a bane to its development.\nSenator AlMakura described the Solid Minerals as a sector next to the Agriculture in areas of revenue generation and job creation but has been abandoned for too long.\nHe disclosed that Nigeria is naturally endowed with solid Minerals, saying that every state in the country has one or two solid Minerals untapped, which could have turned the fortunes of the country if developed."
  },
  {
    "headline": "Edo govt takes campaign against illegal logging, bush burning to Benin residents – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, on Thursday, urged residents to desist from illegal tree felling and indiscriminate bush burning so as to preserve the state’s ecosystem.\nThe government team, led by the Acting Team lead, Edo State Oil Palm Programme Implementation Office, Mr. Churchill Oboh, took to major streets in the Benin metropolis and some communities hosting the state’s forest reserves to sensitize the residents on the dangers of illegal logging and bush burning.\nSpeaking to journalists in Benin City, Oboh urged residents to embrace planting of trees to support the government’s efforts at sustaining the health of citizens and growing the economy.\nWe are encouraging them to go into planting trees, which is very key to our health and the economy.\n“We are willing to support the government in the protection of oil palm trees, as it will further create jobs for our young ones,” he said."
  },
  {
    "headline": "Nigeria Air to begin operation with three rented planes",
    "summarized_story": "Nigeria’s federal government has said the proposed national carrier, Nigeria Air will commence operation early next year with three rented aircraft.\nKnown as wet-leased, it is an arrangement covering the hire of an aircraft, including the provision of a flight crew.\n“They will start with wet-leased aircraft and that’s how 90 percent of airlines in the world would have started,” he said.\n“Nigeria Air would be quoted on the stock exchange and Nigerians would be allowed to buy shares in the airline.\n“This is because Nigeria Air is a limited liability company for now, registered under the law of the land and structured in a public-private partnership (PPP) manner."
  },
  {
    "headline": "Court declares two bandit groups terrorists",
    "summarized_story": "A federal high court in Abuja, presided over by Justice Taiwo Taiwo, has declared the activities of Yan Bindiga and Yan Ta’adda bandit groups as acts of terrorism.\nAbubakar who filed the motion ex-parte, said President Muhammadu Buhari gave approval for his action, of which objective is the proscription of Yan Bindiga and Yan Ta’adda groups and other terrorist groups in the country.\nDelivering ruling on Thursday, the court specifically declared the activities of the “Yan Bindiga group” and the “Yan Ta’adda group” and other similar groups in any part of the country, especially in the north-west and the north-central as “acts of terrorism and illegality”.\nThe court proscribed the activities of the group as well as other similar groups in any part of Nigeria, “either in groups or as individuals by whatever names they are called”.\nThe court asked the federal government to publish the proscription order in the official gazette and two national dailies."
  },
  {
    "headline": "Mkpuru Mmiri: Elliot Uko sends save our soul message to Southeast governors",
    "summarized_story": "“It ruins, demolishes, destroys and completely lays waste young promising lives, turning them into animals.”Uko warned that if nothing is done urgently to stop the epidemic, many lives would be ruined in the Southeast.\nIf left unchecked, the mkpuru mmiri pandemic can destabilise a whole generation.\n“This raging fire that has caught on especially, amongst young people, has the capacity to ruin the future of our land.\n“Youth organisations and town unions, are doing a good job resisting the surge of this wicked storm raging in our land.\n“Laws should be made to demolish the buildings where the drug is manufactured and stiff punishment meted to both dealers and addicts."
  },
  {
    "headline": "NUPENG extends 14-day strike notice by 7 days",
    "summarized_story": "Nigeria Union of Petroleum and Natural Gas Workers (NUPENG) has announced the extension of its earlier issued 14-day ultimatum to the Federal Government by another seven days.\nThis disclosure is contained in a statement issued by NUPENG’s General Secretary, Mr Afolabi Olawale, on Thursday night in Lagos.\nHe asked the government and all other concerned entities to take advantage of the extension to do the needful.\nThe decision of the union to give another seven-day ultimatum should not be misconstrued as a sign of capitulation or weakness,” he said.\nIt is our hope that government does the needful and save the nation the pains and losses our industrial action will bring.’’"
  },
  {
    "headline": "Gov Lalong Furious As Gunmen Kill Scores In Plateau Village",
    "summarized_story": "Plateau State governor, Simon Lalong, has expressed anger over a fresh attack by unknown gunmen, which claimed scores of lives in Taagbe village, Bassa local government area of the State, on Friday morning.\nGovernor Lalong, who confirmed the attack, said he was outraged by the reported attack on Ta’agbe village, where a number of persons including children were killed and houses burnt.\nLalong, therefore, directed security agencies to take immediate and drastic steps to apprehend the perpetrators and ensure that they pay for their crimes.\n“I expect the security agencies to deploy everything at their disposal to arrest those who carried out the crime no matter how long it takes.\nThe governor also called on the people to assist the security agencies with relevant information that will enable them crack the identities and motives of the attacks."
  },
  {
    "headline": "Gov Lalong Furious As Gunmen Kill Scores In Plateau Village",
    "summarized_story": "Plateau State governor, Simon Lalong, has expressed anger over a fresh attack by unknown gunmen, which claimed scores of lives in Taagbe village, Bassa local government area of the State, on Friday morning.\nGovernor Lalong, who confirmed the attack, said he was outraged by the reported attack on Ta’agbe village, where a number of persons including children were killed and houses burnt.\nLalong, therefore, directed security agencies to take immediate and drastic steps to apprehend the perpetrators and ensure that they pay for their crimes.\n“I expect the security agencies to deploy everything at their disposal to arrest those who carried out the crime no matter how long it takes.\nThe governor also called on the people to assist the security agencies with relevant information that will enable them crack the identities and motives of the attacks."
  },
  {
    "headline": "Abuja Nightclub Denies Electrocution Of Female Clubber",
    "summarized_story": "Popular Abuja nightclub, Hustle & Bustle, has provided details of what happened to a female clubber, who was said to have died in its premises some days.\nRecall that the club was shut down after the female clubber was allegedly electrocuted and died at the club.\nIn a statement on Friday, the management of Hustle & Bustle, disclosed that contrary to online reports, the female clubber was leaving the club with her friends and was playing when she slipped and fell.\n“We assure the public that we have employed several health and safety standards and we will continue to place safety over profit.\nMeanwhile, a CCTV footage in circulation has also shown how the female clubber slipped while leaving the club."
  },
  {
    "headline": "Abuja Nightclub Denies Electrocution Of Female Clubber",
    "summarized_story": "Popular Abuja nightclub, Hustle & Bustle, has provided details of what happened to a female clubber, who was said to have died in its premises some days.\nRecall that the club was shut down after the female clubber was allegedly electrocuted and died at the club.\nIn a statement on Friday, the management of Hustle & Bustle, disclosed that contrary to online reports, the female clubber was leaving the club with her friends and was playing when she slipped and fell.\n“We assure the public that we have employed several health and safety standards and we will continue to place safety over profit.\nMeanwhile, a CCTV footage in circulation has also shown how the female clubber slipped while leaving the club."
  },
  {
    "headline": "CSOs To Hold Conference On Fuel Subsidy Removal",
    "summarized_story": "Civil Society Organisations (CSOs) in Nigeria operating under the aegis of Civil Society Coalition for Economic Development (CED), on Thursday, said plans were afoot to organise a conference on ‘Fuel subsidy removal’ in Nigeria.\nThe convener of the group, Comrade Yusuf Dan Maitama, further said that the proposed theme of the conference is “Subsidy removal and the Future of Nigeria’s Economy,” adding that there was no better time for total removal of fuel subsidy than now given the economic challenges the nation is going through.\n“The fuel subsidy regime has in the last 20 years done more harm than good to the economy of the nation and it appears Nigeria is the only country in the world that has fuel subsidy regime in place.\nADVERTISEMENT“We have slated a conference for Tuesday and Wednesday, 2022 and we are going to assemble top class oil experts to speak on reasons fuel subsidy regime should be put to rest,” the group said.\nLEADERSHIP recall that the Minister of Finance, Budget and National Planning, Mrs Zainab Ahmed, had few days ago disclosed to the Senate Committee on Finance that the Federal government would offer N5,000 transportation grant to poor Nigerians to cushion the effect of fuel subsidy removal in 2022."
  },
  {
    "headline": "Gunmen kidnap principal, vice, three teachers in Ondo",
    "summarized_story": "Suspected kidnappers have again abducted a Principal, Joshua Adeyemi, his Vice, lfedayo Yesufu and three other teachers along Auga-Ise road in Akoko North East council area of Ondo state.\nThe source said that the unsuspecting victims were ambushed and whisked away into the thick forest by the abductors.\nOne of the victims, Blessing Okeke, was released after the captors discovered that she was pregnant.\nNarrating the incident, Blessing said they were waylaid while traveling in the Principal vehicle from the school back home.\nBlessing added that they trekked for hours inside thick forest before she was released after their abductors discovered she was pregnant."
  },
  {
    "headline": "Gunmen kidnap principal, vice, three teachers in Ondo",
    "summarized_story": "Suspected kidnappers have again abducted a Principal, Joshua Adeyemi, his Vice, lfedayo Yesufu and three other teachers along Auga-Ise road in Akoko North East council area of Ondo state.\nThe source said that the unsuspecting victims were ambushed and whisked away into the thick forest by the abductors.\nOne of the victims, Blessing Okeke, was released after the captors discovered that she was pregnant.\nNarrating the incident, Blessing said they were waylaid while traveling in the Principal vehicle from the school back home.\nBlessing added that they trekked for hours inside thick forest before she was released after their abductors discovered she was pregnant."
  },
  {
    "headline": "Buhari supporter killed, burnt in Anambra",
    "summarized_story": "A rights activist said to be a supporter of the President, Major General Muhammadu Buhari (retd.\n), Kenechukwu Okeke, has been burnt to dead in Anambra State.\nThe wife told some journalists that her husband was killed by a former tenant.\nI called my husband and told him what the boy said and that he should not come to confront him.\nSome time, he will come to our house and break open the gate and come in and pick whatever he wanted to pick."
  },
  {
    "headline": "Buhari supporter killed, burnt in Anambra",
    "summarized_story": "A rights activist said to be a supporter of the President, Major General Muhammadu Buhari (retd.\n), Kenechukwu Okeke, has been burnt to dead in Anambra State.\nThe wife told some journalists that her husband was killed by a former tenant.\nI called my husband and told him what the boy said and that he should not come to confront him.\nSome time, he will come to our house and break open the gate and come in and pick whatever he wanted to pick."
  },
  {
    "headline": "Amotekun rescues two Fulani herdsmen abducted by fellow herdsmen",
    "summarized_story": "The Ondo State Security Network, also known as the Amotekun Corps, has rescued two Fulani herdsmen who were abducted by their fellow herdsmen.\nAdeleye revealed that the victims were abducted by a gang of herdsmen in Supare Akoko, in the Akoko South-West Local Government Area of the state a few days back.\nHe said they all scattered when the Amotekun men came, in order not to be arrested.\nHe also confessed that they robbed at some bad spots in Akunnu Akoko, Supare Akoko, and Ajowa Akoko, but the two brothers were kidnapped for the purpose of ransom.\nThey beat us and were about to kill us when the Amotekun men arrived in the forest.”"
  },
  {
    "headline": "Updated: Gunmen kill 11 persons in Plateau",
    "summarized_story": "Gunmen in the early hours of Friday killed eleven persons in the Ta’agbe community of Miango Chiefdom in Bassa Local Government Area of Plateau.\nThe Police Public Relations Officer (PPRO) of the command, ASP Uba Ogba, confirmed the incident to newsmen in Jos on Friday.\nOgaba said that the Commissioner of Police in the state had moved to the scene of the incident.\nHe added that the commissioner had deployed more personnel to curb further breakdown of law and order in the area.\nIn his reaction to the incident, Danjuma Auta, the Secretary-General of Iregwe Development Association (IDA), expressed concern over the incident."
  },
  {
    "headline": "Scary Events Will Happen Soon – Fresh Prophecy Emerges Concerning Nigeria",
    "summarized_story": "The Christ Apostolic Miracle Ministry’s Apostle Paul Okikijesu has warned of a significant security situation in most sections of the country.\n“The event will make people afraid to discuss in their homes; or even use their cell phone to discuss with other people.\nThese scary events will start very soon; if adequate security is not provided for the country, then people will be mindful of their speeches.\nPeople should also pray for the banking sector, oil and gas sector, foreign sector and every other sector, because all the sectors in Nigeria need supervision.\n“Nigeria should be prepared; so that it will not become a slave of those countries that are below her in every ramifications,” he added."
  },
  {
    "headline": "Boko Haram Has Ready Tools From Today’s 14 Million Out-of-school Children – Obasanjo",
    "summarized_story": "Former President Olusegun Obasanjo stated on Thursday that if the government fails to restore out-of-school children to classrooms, Boko Haram will recruit them.\nThis was mentioned by Obasanjo during a presidential youth mentorship retreat conducted at the Olusegun Obasanjo Presidential Library’s Youth Development Centre in Abeokuta, Ogun State.\nThe former President bemoaned the rise in out-of-school children, blaming it on a lack of sufficient education for security issues.\nHe stated that over 14 million youngsters who should be in school are out on the streets, and that this situation has the potential to aggravate the country’s security situation.\n“So, if you deal with Boko Haram by stick today, in a few years’ time, the situation will be worst because we are talking about security, it will be worst."
  },
  {
    "headline": "BREAKING: Notorious Kidnapper Evans Sentenced To Death By The High Court",
    "summarized_story": "Evans, dubbed “Nigeria’s most notorious kidnapper” by the police, was apprehended in 2017 and condemned to death four years later.\nThe Intelligence Response Team of the Inspector General of Police, directed by Abba Kyari, captured him.\nIn 2013, Evans was declared wanted after he allegedly masterminded the attempted kidnap of Mr Vincent Obianudo, a businessman who owns the popular ‘Young Shall Grow Motors’.\nThe suspect was said to have carried out kidnapping operations for more than five years before he met his waterloo."
  },
  {
    "headline": "Deal With Highway Criminals Mercilessly, Buhari Orders Security Agencies",
    "summarized_story": "Aregbesola, who addressed State House correspondents at the end of the meeting, said the police and other security agencies had been mobilised to intensify surveillance and patrols in pursuing of the criminals.\nHe said President Buhari particularly ordered the armed forces and other security agencies and intelligence organisations, not to rest on their oars.\nAnd until we achieve that, we will not rest.’’The minister assured that Nigerians would soon witness serious security improvement as specific orders had been given to all security agencies to tackle security challenges across the country.\nHe said: “specific orders have been given to all security agencies.\nIn attendance at Thursday’s National Security Council meeting were Vice-President Yemi Osinbajo, Chief of Staff to the President, Prof Ibrahim Gambari, and the National Security Adviser, retired Maj.-Gen. Babagana Monguno."
  },
  {
    "headline": "Npower batch C employment: How payment issue will be solved",
    "summarized_story": "For N-Power Batch C volunteers whose payroll status recently changed from “failed” to “pending”, should take note the stages below which are the procedures stipend will undergo before payments.\n1) If you are an N-Power Batch C volunteer and your payroll status says ‘PENDING’ it simply means you are being processed into the payroll structure, once you are on the payroll list it means your chances of being paid is at 100%.\n2) From “PENDING” your payroll status will change to “PROCESSING” this simply means your money/stipend has been sent to your bank from Central Bank of Nigeria, again your chances of being paid at this stage is 100%.\n3) Once your payroll status displays “PAID” it simply means your account has been credited, if your payment status displays paid, it means your chances of being paid is >100%, at this stage all N-Power Batch C Volunteers are advised to keep checking their banking app or use their bank USSD to check if there was an increase in their account balance.\nRelatedNo tags for this post."
  },
  {
    "headline": "Insecurity: Buhari gives service chiefs marching orders",
    "summarized_story": "For the umpteenth time, President Muhammadu Buhari has given marching orders to the security chiefs to go after insurgents, bandits and terrorists, saying they must not rest until all Nigerians are at rest.\nAregbesola said President Buhari appreciated the successes and gains recorded by all security chiefs, the security agencies and intelligence organisations on security situation nationwide after he received briefs from them at the meeting.\n“The President was particularly happy with the fact that a free and fair election was made possible by the INEC and our security agencies.\nThe police and other security agencies had been mobilised to intensify surveillance, patrol in pursuit of the criminals.\nDirector Defence Media Operations (DMO) Brigadier-General Bernard Onyeuko stated this while briefing journalists on update of military operations across the country from 11 to 25."
  },
  {
    "headline": "Pictures: Late veteran Baba Suwe’s burial rites begins",
    "summarized_story": "NextPius Awodi, passage of a man of honour and intergity"
  },
  {
    "headline": "Air Nigeria returns April 2022, to create 70,000 jobs – Sirika",
    "summarized_story": "Minister of Aviation Hadi Sirika has said the country’s national air carrier, Air Nigeria, is expected to take off April 2022.\nSitrika said, when it becomes operational, the national carrier would create about 70,000 jobs for Nigerians.\n“Today in Council, civil aviation presented two memoranda.\nThe first one is approval for the award of contract for the provision of Automated Civil Aviation Regulatory Equipment, including software support and training, which will be located in Nnamdi Azikiwe International Airport.\nThese 70,000 jobs are higher than the total number of civil servants that we have in the country."
  },
  {
    "headline": "2022: Minister reveals full fuel deregulation plans as FG removes subsidy provision from budget",
    "summarized_story": "Minister of Finance, Budget and National Planning Hajiya Zainab Ahmed has said the federal government cannot sustain the current N250 billion monthly petroleum subsidy.\nAnd in the 2020 budget, we made a provision to assume that at the maximum by the end of June, we must exit subsidy.\nGrowth in the service sector was largely driven by better performance in the rail transport sector, pipeline sector, air transport, financial institutions, road transport sector, water transport as well as crude.\n“It includes the improvement that we’ve witnessed in the rail transport sector, pipelines, air transport, road transport, as well as water transport.\nWe don’t have anywhere in the budget where 40 million Nigerians will collect N5000 monthly as transportation allowance totalling N2.4 trillion."
  },
  {
    "headline": "Ondo Assembly Suspends Ifedore council Chairman",
    "summarized_story": "The Ondo State House of Assembly has suspended the Chairman of Ifedore local government of Ondo State, Hon Alex Oladimeji from office for three months for alleged gross misconducts.\nThe assembly gave announced his suspension despite a court order restraining it.\nThe embatlled Chairman had on Wednesday dragged the state House of Assembly, the Speaker and the Clerk before the State High Court to restrain them from carrying any suspension or impeachment against him under any guise.\nReacting to his suspension, the council chairman said the lawmakers’ decision was illegal."
  },
  {
    "headline": "Appeal Committee Begins Sitting In Gusau, Insist No Faction In Zamfara APC -",
    "summarized_story": "The All Progressive Congress APC appeal Committee on Zamfara ward and local government congresses says it has not received petition from any quata after five days of it’s sitting in Gusau, the state CapitalThe Committee also says the party is one and United in the state and has no FactionSecretary of the Committee set up by the National Headquarters of the APC Barr.\nSuleiman Usman Elegwu at a press conference says the Committee is committed to doing justice to it’s mandateThe Press Conference took place at the state party’s Secretariate of the Matawalle’s led FactionBarr.\nElegwu says the main objective of the committee is to receive complain from aggrieved members of the party regarding the just concluded ward and local government Congresses should there be anyThe five man APC appeal Committee led by its chairman Hamman Komo says it is yet to receive complain from any quata after five days of it’s sitting in GusauThe Committee also promises to be fair in the discharge of it’s responsibilitiesGovernor Bello Matawalle and Senator Kabiru Marafa’s Factions had conducted pararell congresses during the ward and local government congresses in the stateAPC Ward Congress in Zamfara held on Saturday 13th November while the Local Government congress held on Saturday 20th and the state Congress is expected to hold this Saturday 27th NovemberThe congresses has afforded members to elect officers of their choice that will steer the ship of the party at all levels in the next four yearsThe Governor Bello Matawalle’s led Faction and that of Senator Kabiru Marafa’s Faction has been at loggerhead since the Defection of Governor Bello from the PDP to the ruling APC in July this yearThe five man APC appeal Committee which is holding it’s sitting at the Headquarters of the Matawalle’s led Faction of the party is expected to complete it’s assignment before the State Congress of the party slated for Saturday, November 27thThe Committee also recognizes the Matawalle’s led Faction secretariate as the authentic in the state."
  },
  {
    "headline": "Anambra Election Conduct was our most Challenging",
    "summarized_story": "The chairman of the Independent national electoral commission, Mahmood Yakubu , said the Anambra governorship election is the most difficult election ever conducted in the history of the commission.\nHe made the statement at a two day interactive meeting for Online publishers, media executives .\nThe commission Chairman said the sit at home order on Mondays in Anambra State by IPOB affected the preparation for election.\nMr Mahmood Yakubu said the commission lost everything in Anambra State in preparation for the election when the inec office in Awka was razed down in June.\nAs a result of that all non sensitive materials were gotten from neighbouring States, Enugu and Imo."
  },
  {
    "headline": "Concerned APC Stakeholders welcome Buhari's approval of APC Convention in Feb -",
    "summarized_story": "The Concerned APC Stakeholders has welcomed President Muhammadu Buhari’s approval of February as the Convention date.\non the 6th of October, 2021, the Group wrote a letter to President Muhammadu Buhari calling on him to intervene in some urgent matters posing existential threat to the party.\nThey commend the President as the leader of the party for demonstrating an obvious willingness to listen to all party men and women without any iota of prejudice.\nThey called on the Caretaker/Extra-Ordinary Convention Planning Committee ( CECPC) to take the presidential mandate further by immediately commencing the process that will give APC a befitting and transparent convention that all members would be proud of.\nApart from showing the seriousness it attach to the approval by the president, the Caretaker Committee they say, must not only announce a specific date for the convention, it must put all the necessary machineries for the conduct of the convention in place without further delay."
  },
  {
    "headline": "WTO DG Okonjo-Iweala Tasks Members on Reform, Improved Access to Vaccines",
    "summarized_story": "The Director General of the World Trade Organisation (WTO), Dr. Ngozi Okonjo-Iweala, on Thursday urged members of the global trade body who would be gathering next week in Geneva for Ministerial Conference 12 (MC 12) to put in progress a process for the reforming of the WTO.\n“Nothing on the ministerial conference (agenda) is really more important than the response of the ministers on the COVID-19 pandemic.\n“We hope that ministers will come up with response to the pandemic including a middle ground that will help us to make impact on this area.\nWe need a response that will ramp up more regionally diverse productions, which addresses the problem of inequity in vaccines.\n“This inequity of access is a sour point and I think we need to figure out how to deal with."
  },
  {
    "headline": "Three Weeks after Eruption, Nigeria Says Nembe Oil Spill Now Under Control",
    "summarized_story": "Nigeria’s federal government on Thursday announced that the OML 29 oil spill in Nembe, Bayelsa State, had been brought under control, with necessary personnel and equipment deployed to begin recovery and remediation efforts.\nSylva, also disclosed that the federal government and Aiteo oil company had moved to contain the massive oil spill.\nShe also disclosed plans to institute stiffer penalty for companies involved in oil spill in the country, adding that the operating company is blaming locals for the latest incident in OML29, Nembe.\nShe said, “I got briefings and what I saw in terms of the pollution either through oil refining or illegal oil refining and otherwise – the devastation of the Niger Delta is massive.\nIt’s a collective action between the Ministry of Petroleum Resources, the Ministry of Environment, and the oil company involved."
  },
  {
    "headline": "Nigeria Senate Threatens Daewoo, Saipem with Arrest",
    "summarized_story": "Nigeria’s Senate has threatened to issue warrant of arrest against $10 billion Train 7 project promoters, Saipem and Daewoo, for shortchanging the federal government in the execution of the project.\n“We would want to advise those invited not to dare the Senate by again failing to honor our invitation.\nThe offences run contrary to sections 518 (6) and (7), 419 (A) (1) (b), section 421 of the Criminal Code Law of Rivers State, Cap 37 Vol.\n2 Laws of Rivers State of Nigeria 1999.\nThis is $11 million in excess of the total contract sum while the contract is still at a preliminary stage only."
  },
  {
    "headline": "Nigeria: CBN Governor Emefiele Inaugurates N500m Youth Entrepreneurs’ Scheme",
    "summarized_story": "Governor of the Central Bank of Nigeria (CBN), Mr. Godwin Emefiele, on Thursday launched the apex bank’s N500 million Tertiary Institutions Entrepreneurship Scheme (TIES).\nThe CBN governor said this was particularly crucial given that about 600,000 students graduate yearly from Nigerian tertiary institutions without commensurate employment opportunities in both the public and private sectors.\nOther members of the BoE include Chief Financial Officer, First Bank Plc, Mr. Patrick Iyamabo; Mr. Adamu Lawani (Zenith Bank Plc); Ms. Ngover Ihyembe-Nwankwo (Rand Merchant Bank); Mr. Ashafa Ladan (National Universities Commission); Mr. Abbati D.K.\nHe insisted that the grant awards should be used by the tertiary institutions solely for the development of the award-willing ideas.\nHe said the CBN was playing a significant role in laying a solid foundation for technological development in the tertiary institutions."
  },
  {
    "headline": "Nigeria’s BUA and Finland’s Wartsila OY Seal New Deal on 70MW Gas Power Plant",
    "summarized_story": "The BUA Group has signed yet another agreement with Wartsila OY of Finland for the construction of a 70 megawatts (MW) dual-fuel power plant for its cement Obu Line 3 project in Edo State.\nThe gas power plant would also be the third power plant to be commissioned by BUA from Wartsila as the company seeks to increase its total production capacity across all its locations to 17million metric tonnes by 2023.\nAccording to Rabiu, the 70MW gas powered plant ordered by BUA for its Obu Line 3 cement plant would ensure that the company remains very efficient in its energy utilisation in the cement production process.\nBUA Cement Plc is Nigeria’s second largest cement company and the largest producer in its north-west, south-south, and south-east regions.\nBUA Cement operates strategically from Okpella, Edo State and Kalambaina, Sokoto State with its headquarters in Lagos, Nigeria."
  }
]