[
  {
    "headline": "FG risks vaccine donation reduction as one million doses expire",
    "summarized_story": "Nigeria is on the verge of losing more donations from multilateral agencies and other countries following the expiration of about one million doses of donated COVID-19 vaccines.\nEhanire on Wednesday justified the expiration of over one million donated doses of the AstraZeneca vaccine.\nBut Nigeria left the vaccine doses on the shelf and allowed them to expire thereby depriving others from using them.\nThe Africa Centres for Disease Control and Prevention had in May commended the Democratic Republic of Congo for its “remarkable and strategic move” in returning the vaccine doses that they could not administer on time.\nWe also have a pool of vaccines, almost 57 million vaccines that are awaiting shipment."
  },
  {
    "headline": "States grumble as FG slashes N36bn COVID-19 fund, Omicron hits 57 countries",
    "summarized_story": "Thirty-six states of the federation have faulted the Federal Government’s handling of N36bn international fund meant to combat COVID-19.\nThe commissioner said that states were expecting international funds to tackle COVID-19, especially, to make isolation centres more functional.\nOn his part, the Ekiti State Commissioner for Information, Akin Omole, said that the COVID-19 isolation and treatment centres in the state were functional.\nThe state Epidemiologist , Dr Stephen Fagbemi, who spoke on development disclosed that the state had four isolation centres .\nWe don’t intend to open more isolation centres – LagosThe Lagos State Commissioner for Information and Strategy, Mr Gbenga Omotoso, on his part disclosed that the state did not intend to open more isolation centres."
  },
  {
    "headline": "Sokoto bus massacre: Ortom sympathizes with state govt",
    "summarized_story": "By Peter Duru – MakurdiGovernor Samuel Ortom of Benue State has again expressed deep pains and sympathized with the Governor of Sokoto State, Alhaji Aminu Tambuwal, as well as the people of the state over the gruesome massacre of scores of commuters who were burnt to death by armed bandits in the state.\nThe passengers were said to be travelling from Sabon Birni Local Government Area to Sokoto town when the bus conveying them was stopped around Gidan Bawa village, where the bandits blocked the road and set the vehicle ablaze.\nALSO READ: Nasarawa gov, Abdullahi Sule, appoints 18 SAs“The Governor laments the unprovoked attacks on various communities and says this is threatening the unity of Nigeria and weakening the faith of the citizens in their government.\n“He calls on Nigerians to shun partisanship but join hands with government and security agencies to expose these terrorists to save Nigeria from these mindless killings by the bloodthirsty aliens.\n“Governor Ortom then condoled with Governor Tambuwal and the people of Sokoto state and prays God to grant the victims rest, and the families they left behind the fortitude to bear the irreparable loss.”Vanguard News Nigeria"
  },
  {
    "headline": "2022 Census: NPC commences second pre-test census in Benue",
    "summarized_story": "By Peter Duru – MakurdiThe National Population Commission, NPC, has commenced the second Pre-Test of Population and Housing Census in Benue state ahead of the coming 2022 national census.\n“And in making this commitment, the Commission is conscious of the important role of the pre-test in the process of authenticating and updating the Enumeration Areas (EADs) in preparation for the next census.\n“We would like to caution that the Pre-test is not the actual census but the mirror through which we look at our readiness for the next census.\n“I, therefore, wish to appeal to the respondents in the selected LGAs and EAs to extend maximum cooperation to the interviewers and answer all the questions truthfully.\n“All information volunteered will be treated with the utmost confidentiality and will not be divulged for any other purpose."
  },
  {
    "headline": "How to know you will achieve financial freedom",
    "summarized_story": "AgadaOne of the wisest things to do early in your career is to know upfront if you will achieve financial freedom.\nYou then assess what kind of financial freedom you will achieve and what your chances of achieving total financial freedom you have.\nNot everyone that sets out to achieve financial freedom will achieve it.\nAchieving financial freedomThere are three factors that will show you if you would achieve financial freedom; And your understanding or ignorance of these factors is what will determine your financial success.\nKnowing what to do to achieve financial freedom is easy – now you know."
  },
  {
    "headline": "FCT warns residents against noise pollution, vows to sanction offenders",
    "summarized_story": "He said that the notice was informed by the alarming rate of noise pollution emanating from such quarters and unending complaints received from residents within the areas.\n“We have been inundated with complaints of indiscriminate noise pollution from event centres, parks, gardens and other facilities in the last one year.\n“We are stating in very strong terms that the nuisance of noise pollution contravenes both national regulations on acceptable noise levels, and the provisions of AEPB Act, which prohibits any noise that disturbs the neighbourhood.\nHe explained that noise pollution posed serious health risks, particularly to those who are sick, recuperating at home or elderly and infant populations.\nHe said that the board had received complaints from people who had developed high blood pressure and migraine as a result of noise pollution from their neighbours."
  },
  {
    "headline": "Bill on youth entrepreneurship devt trust fund passes 2nd reading",
    "summarized_story": "The Bill seeking to establish Youth Entrepreneurship Development Trust Fund on Wednesday in Abuja scaled the second reading in the House of Representatives.\nHe added that unemployment as being currently experienced by the country’s younger population would be addressed by the youth entrepreneurship development trust fund bill.\nHe said that the youth would be fully in charge of the Trust Fund and provide sources of revenue, as well as transparency of the management process.\n“We are also bringing in private entities to contribute to the Youth Fund.\nThe News Agency of Nigeria (NAN) reports that the Bill was unanimously agreed that the bill should be allowed to scaled and passed for committee stage."
  },
  {
    "headline": "Buhari reacts as bandits roast over 40 travellers in Sokoto",
    "summarized_story": "President Muhammadu Buhari has expressed sadness over the recent killing of over 40 passengers in Sokoto State by armed men suspected to be bandits.\nThis was disclosed in a statement by Buhari’s spokesman, Femi Adesina, on Wednesday.\nDAILY POST reports that passengers who were travelling from Sabon Birni Local Government Area of the state to Sokoto Town were ambushed by the armed men who set fire on their vehicle and burnt them alive.\n“I am very distressed at the manner of death visited on these hapless citizens who were undertaking a legitimate journey to another part of the country,” Buhari said.\n“It shows that the evil this administration is confronting is one that requires the support and involvement of all Nigerians."
  },
  {
    "headline": "Dowen College: Buhari breaks silence on student’s death, reveals what to do",
    "summarized_story": "President Muhammadu Buhari has assured that no one involved in the alleged killing of Dowen College’s student, Sylvester Oromoni Jr would be spared.\nIn a statement issued on Wednesday evening by his spokesman, Garba Shehu, the president condemned the incident that led to the death of the 12-year-old schoolboy.\nRecall that Sylvester Oromoni had prior to his death, alleged that five senior students of the Dowen College, Lekki, Lagos State had bullied him for refusing to be initiated into a cult group.\nThe incident which led to the death of the young boy had triggered a reaction from several Nigerians who continued to demand justice for the late schoolboy.\nThe Lagos State government had launched an investigation into the incident to unravel the controversy surrounding the death."
  },
  {
    "headline": "Osoba returns to Nigeria after knee surgery in UK",
    "summarized_story": "A former Ogun State Governor, Olusegun Osoba has returned to Nigeria after a successful knee replacement surgery in the United Kingdom.\nOn Wednesday, the octogenarian was visited by members of the Ogun State Executive Council at his Ikoyi residence, Lagos.\nTalabi appreciated God for Osoba’s successful surgery, declaring that Ogun is happy to see him back on his feet.\nHowever, after the report, Gov Abiodun, the Speaker of the Ogun State House of Assembly and some lawmakers visited the Oluwo of Oba.\nAlso, some serving Senators, including Solomon Adeola of Lagos West, were in London last week to identify with Osoba as he recuperates."
  },
  {
    "headline": "Reps consider Bill to fund Nigeria’s unemployed youths",
    "summarized_story": "Titled: “a Bill for an Act to make Provision for the Establishment of Youth Entrepreneurship Development Trust Fund and a Management Team to Administer the Funds; and for Related Matters (HB.\nThe lawmaker explained that the Bill considers the relevance of the youths in the society as paramount as it is hoped that the proposed Youth Fund law would provide a vehicle for assured socioeconomic security for them.\n”Ensure reduced unemployment, diminish social vices and produce a confident and global worthy citizen in the average Nigerian youth”.\n“The Nigerian state needs to protect its own, the youth, who arguably constitutes more than half of the country’s population and are the future leaders.\nYear in and out, thousands of Nigerian youths are churned out of tertiary institutions but the state does not have enough carrying capacity to empty them into."
  },
  {
    "headline": "Reps to investigate CBN, AMCON, others, for refusal to defend 2022 budget",
    "summarized_story": "The leadership of the House of Representatives is to meet with the Committee on Banking and Currency to determine why some agencies, including the Central Bank of Nigeria (CBN), Asset Management Corporation of Nigeria (AMCON) and the Nigerian Security Printing and Minting Company have failed to appear before lawmakers to defend their 2022 budget proposals.\nMohammed in the motion said the agencies have not defended their 2022 budget proposals before the Banking and Currency Committee constituted by Order 20, Rule 18, subsection 1 and 2 of the House which empowered it to oversight and evaluate their annual budget.\n“It will interest the house to know that none of the above agencies has been over sighted in the past two years and they have failed to make their 2022 budget available to the committee.\n”This is a breach of law of which this House should make a finding and place it properly the culpability of these agencies.\nIt would be proper for this to come in a way of a motion for an investigation,’’ he said."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Buhari leads dignitaries to honour Akande at book launch",
    "summarized_story": "Barring the unforeseen, President Muhammadu Buhari will today lead other dignitaries to honour All Progressives Congress (APC) pioneer National Chairman Chief Bisi Akande at the public presentation of his autobiography ‘My Participations’.\nA Lagos-based media and publishing company, Gaskia Media Ltd, is the publisher of the 560-page book.\nIt is Akande’s ninth book and may prove to be the most controversial being a comprehensive narration of the former governor’s impactful, colourful and crowded political career.\nWhen the military departed in 1999, he became the second elected governor of Osun State.\nThe event will re-affirm Akande’s relevance and clout as one of the dominant political figures of modern Nigerian politics."
  },
  {
    "headline": "We didn’t sell PDP governorship ticket to Obaseki, says spokesman",
    "summarized_story": "The outgoing leadership of the Peoples Democratic Party (PDP) has dismissed insinuations that the party “taxed” Governor Godwin Obaseki for the September 2020 governorship ticket.\nBut, in an apparent reaction to the speed with which Osaseki secured the party’s ticket, Rivers State Governor Nyesom Wike had branded the PDP leaders “tax collectors”, a veiled accusation of selling the ticket to the highest bidder.\nHowever, the spokesman for the PDP, Kola Ologbondiyan, rejected the “tax collectors” tag as he urged Obaseki to explain to Nigerians and PDP members the processes that led to his emergence as a PDP candidate.\n“I will like to place on record that this NWC did not demand any form of gratification from Obaseki before he got the ticket of our party.\nIt is also important to restate that this NWC did not demand any form of “tax” from Governor Obaseki nor did we collect the same."
  },
  {
    "headline": "Telecom equipment to detect, block fraudsters coming, says Fed Govt",
    "summarized_story": "The Federal Executive Council (FEC) yesterday approved the procurement of two sets of telecommunications equipment for the detection and blockage of internet criminals.\nThe minister said the approval of the new regulatory system, which will cost N1.8 billion, would help to support the country in addressing its security challenges.\n- Advertisement -Read Also: NCC to revitalise telecom numbering service segment“These regulatory systems have two components.\nComponent number one is the deployment of a regulatory system to monitor, detect and block SIM box traffic.\n“This deployment of system to monitor, detect and block SIM is to fight what we call voice traffic termination fraught."
  },
  {
    "headline": "Nasarawa APC, PDP bicker over Sule’s performance",
    "summarized_story": "The Nasarawa State chapter of the All Progressives Congress (APC) has condemned the opposition Peoples Democratic Party (PDP) in the state over its criticism of Governor Sule’s performance in the past two-and-a-half years.\nThe PDP state chairman, Francis Orogu, had recently described Governor Sule as the worst Governor the state had ever produced, with no single project in the past two-and-a-half years.\nBut the APC chairman, John Mamman has called on citizens to ignore recent comments by the PDP state chairman, discrediting the performance of the governor.\nThe APC Chairman said only a political bigot will fail to recognise the quantum and quality of the positive transformation taking place in rural areas of Nasarawa State, which cuts across all sectors.\n“The giant strides being recorded in all sectors of the state economy by Governor Sule’s administration abound, and they are verifiable."
  },
  {
    "headline": "Breaking: Raid on Justice Mary Odili: CJN spits fire, says enough is enough",
    "summarized_story": "The CJN who made reference to the invasion of the official residence of Justice Mary Odili of the Supreme Court, by some security operatives, warned that the silence of the judiciary should never be mistaken for stupidity or weakness.\nJustice Mary Peter Odili, on Friday October 29, 2021, by men suspected to be security operatives, acting on a search warrant purportedly obtained from an Abuja Magistrate’s Court under questionable circumstances.\n” I must make it known to all and sundry that we have had enough dosage of such embarrasments and harassments of our judicial officers across the country and we can no longer take any of such shenanigans.\nThe time to oppress, suppress and intimidate judicial officers is gone.\nNo law permits anyone to invade, subdue or overawe any Nigerian citizen in his or her residence with a flimsy, fraudulently obtained search warrant."
  },
  {
    "headline": "Gunmen kidnap Catholic priest in Ondo",
    "summarized_story": "Joseph Ajayi, the parish priest of St. Peter Clavar, Ilara Mokin, in Ifedore Local Government Area of Ondo State.\nThe abduction of the clergyman was confirmed on by the Catholic Diocese of Ondo.\nA source revealed that the cleric was traveling to Akure, the Ondo State capital from Ikere, Ekiti State, when the hoodlums struck and whisked him away.\nThe Secretary to the Bishop of Ondo Catholic Diocese, Jude Arogundade, Rev.\nVictor Ibiyemi, who confirmed the incident said the abductors had contacted the church, demanding a sum of N20million ransom."
  },
  {
    "headline": "Truck crushes 17 schoolchildren in Lagos",
    "summarized_story": "By Christopher OjiThere was pandemonium yesterday at Ogba area of Lagos as a truck crushed 17 students to death and injured many others.\nThe truck was being chased by the Federal Road Safety Corps (FRSC) officials for violating traffic law, and the driver of the truck sped off to avoid arrest.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\n“The men of FRSC were called upon by passersby to help intervene after the crash had happened.\n“The general public should disregard the disgruntled information being circulated by some unscrupulous elements that FRSC men caused the crash."
  },
  {
    "headline": "Omicron: NCDC confirms 3 new cases as UK detects virus",
    "summarized_story": "This brings the tally of confirmed Omicron cases in Nigeria to six.\nNCDC, in a statement by its Director General, Dr. Ifedayo Adetifa, noted that all the Omicron cases, so far, were detected in persons with recent travel history to South Africa in November.\nNCDC boss confirmed that the UK has formally written to Nigeria on the matter in line with the global health practice.\n“Confirmed Omicron cases as at December 3rd, across some countries are: Nigeria (3 ); Australia (7); Brazil (3); Germany (9) Israel(4); Italy (9) and Netherlands(16).\nComing under order 42 and 52 of the Senate Rules, he noted with satisfaction the efforts of the Nigerian government in the containment and treatment of COVID-19 cases."
  },
  {
    "headline": "Court refuses to vacate order stopping FG from deducting state govts’ monies over $418m Paris Club",
    "summarized_story": "A Federal High Court, Abuja, yesterday, declined to vacate its order restraining the Federal Government from deducting monies accruing to the 36 states from the federation account to settle $418 million judgment debt in relation to Paris Club Refund.\nThe court had also ruled that the restraining order would subsist pending the determination of the substantive suit.\nAt the resumed hearing, counsel to the plaintiffs, Okutekpa told the court that the matter was slated for hearing.\nOke, who told the court that his clients were affected by the order, urged the court to take their application seeking for the order to be vacated.\nAfter taking all the arguments, Justice Ekwo noted that the restraining order was made subject to the motion on notice filed by the plaintiffs."
  },
  {
    "headline": "Tambuwal Receives Briefing from Security Chiefs over Bandits Attack on 23 Travellers",
    "summarized_story": "At the briefing on the tragic incident held at the Government House, Sokoto, Wednesday, the security chiefs pledged to work with the governor on modalities to checkmate future occurrences.\nHe added that the security agencies mobilized to the spot of the attack and immediately mounted a patrol, that is still ongoing, on the 30 kilometers stretch of road between Gidan Bawa, the attack spot in Sokoto state and Shinkafi town in Zamfara state.\nTwo passenger buses were set ablazed by the bandits at Gidan Bawa leaving 23 people dead on Monday.\nMeanwhile, Sokoto state government has condoled the people of the area on the tragic losses.\nTambuwal prayed for the repose of the souls of the deceased, quick recovery for those hospitalized and others wounded."
  },
  {
    "headline": "Breaking: Finally, Aiteo Stops Bayelsa Wellhead Oil Spill",
    "summarized_story": "By Emmanuel Addeh in AbujaAiteo, operator of the Nigerian National Petroleum Corporation/Aiteo Joint Venture (JV), Oil Mining Lease (OML) 29, Wednesday succeeded in shutting down the leak on its Santa Barbara wellhead in Nembe, Bayelsa state.\nThe company had on Friday, November 5, 2021, reported a hydrocarbon wellhead leak on the facility to the Nigerian authorities.\n“ There’s a rig up pump on the long string and pump opens the ball valve.\nThe team is currently preparing to pump ‘kill fluid’ into the long string.\nOn the next number of steps, the indigenous oil firm said it will: “Complete pumping of kill fluid into the long string (LS)."
  },
  {
    "headline": "Archbishop of Canterbury Condemns Nigeria’s Red Listing, Calls It Travel Apartheid",
    "summarized_story": "The Red chamber at plenary accordingly, called on the British authorities to consider removing Nigeria from the red list.\nThe only people allowed to enter the UK from these countries are UK or Irish nationals, or UK residents.\nHe, therefore, called on the British Parliament to intervene with a view to having Nigeria removed from the country’s COVID-19 red list.\nNCDC had previously announced the detection of three cases of omicron variant on December 2021.\nThe Centre however maintained that the Delta variant has remained the dominant variant than the new omicron variant."
  },
  {
    "headline": "Equinix to Acquire MainOne in $320m Deal",
    "summarized_story": "Emma OkonjiWith the successful acquisition of GPX India and 13 Bell Data Centers in Canada, Equinix, one of the world’s digital infrastructure companies, yesterday announced its expansion into Africa through a deal to acquire MainOne, a West African data centre and connectivity solutions provider.\nEquinix believes MainOne to be one of the most exciting technology businesses to emerge from Africa.\n“Upon closing, these facilities will add more than 64,000 gross square feet of space to Platform Equinix, with 570,000 square feet of land for future expansions,” it added.\nWhen completed, this acquisition will extend Platform Equinix into West Africa, giving organisations based inside and outside of Africa access to one of the world’s fastest growing markets,” it stated.\nSpeaking about the planned acquisition, President and CEO, Equinix, Charles Meyers, said: “The acquisition of MainOne will represent a critical point of entry for Platform Equinix into the expansive and rapidly growing African market."
  },
  {
    "headline": "Buhari Flags Off $300m Afreximbank’s Medical Centre, Laments Brain Drain",
    "summarized_story": "•Facility to save $7bn annual medical tourism spending, says OramahDeji Elumoye andEmmanuel Addeh in AbujaPresident Muhammadu Buhari yesterday conducted the official take-off of the planned $300 million African Medical Centre of Excellence (AMCE) to be implemented in Abuja by the Benedict Oramah-led African Export–Import Bank (Afreximbank).\nAt the event which he attended virtually, the president who decried the rising cases of non-communicable diseases like cancer, noted that unfortunately, West African countries lacked the wherewithal to deal with such aliments.\n“The rising NCD burden coupled with inadequate medical infrastructure on the continent threatens the future of our people.\nRight now, many hospitals in the West African region are underfunded, underequipped, understaffed and relatively inaccessible to most patients especially from rural areas,” he stated.\n“The partnership with King’s College Hospital will increase locally available clinical capabilities, provide education and training, relying on KCH’s two centuries’ of experience in providing specialist healthcare services, medicine, and medical research."
  },
  {
    "headline": "Justice On Trial: Systematic Incarceration Of Omoyele Sowore By Buhari's Tyrannical Regime",
    "summarized_story": "A short documentary on systematic incarceration of Nigerian human rights activist, Omoyele Sowore, by the Muhammadu Buhari tyrannical regime.\nSowore was illegally abducted by Nigeria's secret police, Department of State Services (DSS) on August 3rd, 2019, for planning #RevolutionNow, a series of protests to demand an end to corruption and better living conditions for all citizens.\nSee Also Human Rights ATTACK ON LIBERTY: Tracking Nigeria Police, DSS’ Continued Attacks On Sowore On Court Premises"
  },
  {
    "headline": "Justice On Trial: Systematic Incarceration Of Omoyele Sowore By Buhari's Tyrannical Regime",
    "summarized_story": "A short documentary on systematic incarceration of Nigerian human rights activist, Omoyele Sowore, by the Muhammadu Buhari tyrannical regime.\nSowore was illegally abducted by Nigeria's secret police, Department of State Services (DSS) on August 3rd, 2019, for planning #RevolutionNow, a series of protests to demand an end to corruption and better living conditions for all citizens.\nSee Also Human Rights ATTACK ON LIBERTY: Tracking Nigeria Police, DSS’ Continued Attacks On Sowore On Court Premises"
  },
  {
    "headline": "BREAKING: Court Orders Secret Police, DSS To Pay Human Rights Activist, Sowore N2 Million, Apologise Over Illegal Seizure Of Phones",
    "summarized_story": "A Federal High Court sitting in Abuja has ordered the Department of State Services (DSS) to pay N2,000,000 to human rights activist, Omoyele Sowore for breach of his fundamental rights.\nSowore, the publisher of SaharaReporters, had instituted a suit against the DSS to compel the agency to return his phones seized since August 2019 when he was first arrested.\nIn a judgment delivered on Wednesday, Justice Anwuli Chikere described the action of the secret police as illegal and a violation of the activist’s rights.\nThe activist’s lawyer, Mrs Funmi Falana had prodded the DSS lawyer on the illegality of the seizures when the case came up on December 1.\nThe DSS had told Justice Chikere that the phones were “recovered” during his arrest and not seized."
  },
  {
    "headline": "BREAKING: Court Orders Secret Police, DSS To Pay Human Rights Activist, Sowore N2 Million, Apologise Over Illegal Seizure Of Phones",
    "summarized_story": "A Federal High Court sitting in Abuja has ordered the Department of State Services (DSS) to pay N2,000,000 to human rights activist, Omoyele Sowore for breach of his fundamental rights.\nSowore, the publisher of SaharaReporters, had instituted a suit against the DSS to compel the agency to return his phones seized since August 2019 when he was first arrested.\nIn a judgment delivered on Wednesday, Justice Anwuli Chikere described the action of the secret police as illegal and a violation of the activist’s rights.\nThe activist’s lawyer, Mrs Funmi Falana had prodded the DSS lawyer on the illegality of the seizures when the case came up on December 1.\nThe DSS had told Justice Chikere that the phones were “recovered” during his arrest and not seized."
  },
  {
    "headline": "I’ll No Longer Mediate For Bandits— Sheikh Gumi",
    "summarized_story": "Controversial Islamic cleric, Ahmad Gumi, says he has quit mediating for armed bandits following their declaration as terrorists by the court.\nSheikh Ahmad GumiBefore he started his campaign, the Zamfara State Governor, Bello Matawalle, and his counterparts in Katsina, Aminu Masari, had engaged bandits in their state in dialogue.\nKaduna State Governor Nasir El-Rufai and his Niger State counterpart, Abubakar Sani, have consistently opposed negotiating with the outlaws.\nThe verdict strengthened the call on the Nigerian government to declare bandits ravaging the North-western and the North-central regions as terrorists.\nAnd now with the declaration of the bandits as terrorists, Gumi said it will be dangerous for him to continue to engage the bandits, PREMIUM TIMES reports."
  },
  {
    "headline": "Lagos unveils monthly rent scheme with N5bn allocation",
    "summarized_story": "The Lagos government says it has put in place N5 billion to kickstart the state’s monthly tenancy scheme in January 2022.\nAdvertisementRabiu Olowo, commissioner for finance, disclosed this on Wednesday during a panel discussion at the Lagos real estate market place conference and exhibition, held in Lagos.\nThe two-day event, organised by the Lagos State Real Estate Regulatory Authority (LASRERA), was tagged, ‘Lagos: 21st Century Real Estate Investment Hub’.\nAccording to the commissioner, the scheme was set up to support tenants and landlords regarding rent remittance.\n“Following a survey, we have been able to create a model that will be launched and known as the Lagos monthly rental policy,” the commissioner said."
  },
  {
    "headline": "Lagos unveils monthly rent scheme with N5bn allocation",
    "summarized_story": "The Lagos government says it has put in place N5 billion to kickstart the state’s monthly tenancy scheme in January 2022.\nAdvertisementRabiu Olowo, commissioner for finance, disclosed this on Wednesday during a panel discussion at the Lagos real estate market place conference and exhibition, held in Lagos.\nThe two-day event, organised by the Lagos State Real Estate Regulatory Authority (LASRERA), was tagged, ‘Lagos: 21st Century Real Estate Investment Hub’.\nAccording to the commissioner, the scheme was set up to support tenants and landlords regarding rent remittance.\n“Following a survey, we have been able to create a model that will be launched and known as the Lagos monthly rental policy,” the commissioner said."
  },
  {
    "headline": "WHO: Omicron COVID variant now in 57 countries — number expected to rise",
    "summarized_story": "The World Health Organisation (WHO) says the Omicron COVID variant has now been detected in 57 countries.\nAdvertisementOmicron — labelled a “variant of concern” — was detected by South African authorities and subsequently reported to the WHO.\nThere are reports that the variant had been earlier detected in the Netherlands before the announcement by South Africa.\nHowever, Omicron was detected when transmission of Delta was very low, so it had little competition.\n“I’m pleased that France and Switzerland have lifted their travel bans on southern African countries, and I urge other countries to follow their lead."
  },
  {
    "headline": "WHO: Omicron COVID variant now in 57 countries — number expected to rise",
    "summarized_story": "The World Health Organisation (WHO) says the Omicron COVID variant has now been detected in 57 countries.\nAdvertisementOmicron — labelled a “variant of concern” — was detected by South African authorities and subsequently reported to the WHO.\nThere are reports that the variant had been earlier detected in the Netherlands before the announcement by South Africa.\nHowever, Omicron was detected when transmission of Delta was very low, so it had little competition.\n“I’m pleased that France and Switzerland have lifted their travel bans on southern African countries, and I urge other countries to follow their lead."
  },
  {
    "headline": "CJN: Odili home invasion embarrassing... we've had enough of such harassment",
    "summarized_story": "Ibrahim Muhammad, chief justice of Nigeria (CJN), says harassment of judicial officers will no longer be tolerated.\nAdvertisementHe said this on Wednesday in reaction to the invasion of the home of Mary Odili, a justice of the supreme court, in October.\nSpeaking at an event to mark the 2021/2022 legal year of the supreme court, the CJN said the judiciary’s silence “should never be mistaken for stupidity or weakness”.\n“The time to oppress, suppress and intimidate judicial officers is gone.\nAdvertisement“No law permits anyone to invade, subdue or overawe any Nigerian citizen in his or her residence with a flimsy, fraudulently-obtained search warrant."
  },
  {
    "headline": "Could Africa ditch cash?",
    "summarized_story": "The era of cash could be drawing to an end as central bank-backed digital currencies (CBDC”s) takes root in Africa.\nSo far, it’s only Nigeria that has launched an official, state-backed digital currency – christened the eNaira – on the continent as more countries continue to express interest.\nThe Baobab Network has traced at least 60 cryptocurrency companies in Africa, with the majority (43 percent) of them headquartered in Nigeria, followed by South Africa (18 percent) and Kenya (11 percent).\nThis is affirmed by another comparative study by GSMA published in March 2021 showing more than half of 310 live mobile money services in 2020 across the globe were found in Africa.\nWith over 55 percent of the world’s mobile money services recorded in Africa and a significant population turning to e-wallets and cryptocurrency, the question now becomes whether the continent might ditch paper money altogether."
  },
  {
    "headline": "Equinix in talks to acquire West African digital infrastructure firm MainOne",
    "summarized_story": "The company owns and operates an extensive submarine network extending 7,000 kilometers from Portugal to Lagos, Accra, and along the West African coast, with landing stations in Nigeria, Ghana, and Côte d’Ivoire.\nThese provide connectivity to and from Europe, West African countries, and the major business communities in Nigeria.\nMainOne also owns digital infrastructure assets that include three operational data centers, with an additional facility under construction expected to open in Q1 2022.\nGiven the huge supply gap in digital infrastructure in sub-Saharan Africa, Ayobami Omole, a Lagos-based telecom analyst at Tellimer, expects more of such transactions in the coming years.\nWhen completed, the acquisition will extend Platform Equinix into West Africa."
  },
  {
    "headline": "Earnipay is improving financial well-being for salaried employees",
    "summarized_story": "In Nigeria, wages for formal-sector employees are paid monthly; in the informal sector, however, this is paid daily.\nNow, when salaried employees go broke between paydays, they have three options: borrow, take a loan, or request a salary advance.\nEarnipay, a fintech solution, founded by Nonso Onwuzulike, allows employees flexible access to their accrued salaries on any day of the month.\nCommenting on Earnipay’s plans for 2022, Onwuzulike said, “Our goal is to partner with employers to improve employee financial well-being.\nIn addition to flexible salary access, we provide financial education to advise employees on best practices to manage their finances, and other products to assist them daily.”Share this article"
  },
  {
    "headline": "Herconomy raised $600,000 in a day. Here's how they did it",
    "summarized_story": "The book was a culmination of all the opportunities Durosinmi-Etti had been sharing on her personal Instagram profile for months.\n“I just wanted to create a place where women could get access to opportunities, grants and fellowships,” Durosinmi-Etti told TechCabal in an interview.\nThe startup plans to introduce financial services to its community members which it believes will be of great benefit to them.\nWithin a day, as Durosinmi-Etti explains, she got “hundreds of responses” from community members who were interested in investing.\nThey did this because it was extremely important for their community members to be part of this raise."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "“We like to invest in businesses where the founders are in control.” – Ian Lessem on HAVAÍC’s investment thesis",
    "summarized_story": "Techpoint Africa had a chat with Ian Lessem, where he explained the firm’s origins and how they make investment decisions.\nImportantly, we like to invest in businesses where the founders are in control.\nThere are many, but in South Africa, it would be hearX, which provides audiology solutions to the mass market using technology.\nIn South Africa, we call them spaza shops, but they’re just local shops.\nSo while their main operations are in South Africa, Kenya, or Nigeria, they are very much international businesses."
  },
  {
    "headline": "South Africa-based proptech, Flow, is helping real estate agents and developers automate their social media advertising",
    "summarized_story": "Flow’s websiteSouth Africa-based Flow uses an API that enables estate agencies and property developers to automate their advertising on Facebook, Instagram, and LinkedIn.\nThey currently have a commercial partnership with PropData, one of the largest software providers in that space in South Africa.\nAs of May 2021, there were 25.4 million Facebook users in South Africa — 42.5% of the population.\nAccording to Statista, as of July 2021, South Africa had 6.03 million Instagram users and 9.15 million LinkedIn users, respectively.\n“In contextual terms, in South Africa, there are about 4,500, around 5,000 estate agency offices and 40,000 estate agents."
  },
  {
    "headline": "Adedeji Olowe is building a global reputation as Africa’s open banking leader",
    "summarized_story": "Adedeji Olowe saw all this and decided to do something about the challenges in the industry.\nChatting with Adedeji Olowe in his Lekki Phase 1 homeThe father of three has helped many people build companies.\nOlowe leads Trium, a venture capital firm, and is seen globally as the leader of open banking in Africa.\nDespite Africa being slow to enact open banking regulations like other developing regions, he believes now is the time to catch up with Europe and Asia.\nHe sent an email with a call to action, “Let there be open banking!” to all his friends."
  },
  {
    "headline": "Rising import worsens Nigeria’s trade deficit",
    "summarized_story": "The trade deficit in the reviewed period deteriorated 61.6 percent compared to the second quarter 2021 goods trade deficit of N1.9 trillion.\nThe trade deficit reported by Africa’s most populous nation within the period was despite the higher crude price recorded in 2021.\nSolid minerals imports in Q3 2021 increased by 10.93 percent compared to Q2 2021 and 53.42 percent compared to Q3 2020.\nSolid minerals exports value in Q3 2021, increased by 22.7 percent compared to Q2 2021 and 222.8 percent compared to Q3 2020.\nManufactured goods import value was 13.98 percent higher in Q3 2021 than the level in Q2 2021 and 42.73 percent more than Q3 2020."
  },
  {
    "headline": "Nigeria raises most startup capital but isn’t Africa’s prime investment destination",
    "summarized_story": "Despite this feat, Nigeria has dropped from Africa’s top 10 investment destinations to 14 as Egypt remains the number one nation.\nThis is according to a report by RMB, a division of FirstRand Bank Limited, titled ‘Where to Invest in Africa 2021’.\nIn 2014, Nigeria ranked as number two and dropped to number five in 2015.\n“The sheer size of Nigeria’s economy and large population base has undoubtedly aided the country’s economic environment and has led to an increase in investments in the economy over the past 10 years,” the company said.\nThis inclusion aimed to score governments’ fiscal positions and provided a basis from which investors can understand specific jurisdictions,” Kavishe said."
  },
  {
    "headline": "Coronavirus induced school closures cost students $17trn in lifetime earnings – World Bank",
    "summarized_story": "The COVID-19 pandemic-related school closures have been estimated to cost this generation of students $17 trillion in lifetime earnings, or about 14 percent of today’s global GDP, according to a new report by the World Bank, UNESCO, and UNICEF.\n“The COVID-19 crisis brought education systems across the world to a halt,” said Jaime Saavedra, global director for education at the World Bank.\n“Now, 21 months later, schools remain closed for millions of children, and others may never return to school.\nThe report also shows that many school children may never return to school post-crisis.\nStudents aged 15-18, for whom education is no longer compulsory, were 11 percentage points less likely to go back to school,” the report stated."
  },
  {
    "headline": "Obaseki swears in five SSAs, 40 SAs in Ikpoba-Okha LGA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Wednesday, swore in five Senior Special Assistants (SSAs) and 40 Special Assistants (SAs) in Ikpoba-Okha Local Government Area (LGA) of the state.\nObaseki, who swore in the appointees at Idogbo, the administrative headquarters of Ikpoba-Okha, hailed the LGA for being politically organized and united.\nAccording to him, “Ikpoba-Okha is an LGA with a very high number of PDP members in the country.\n“Ikpoba-Okha is the largest local government in terms of population in Edo State and it’s setting the example in terms of politics.\nYou are well organized and it shows in the unity of leaders in the council, which has made harmonization possible."
  },
  {
    "headline": "WhatsApp launches ‘YouSaid’ campaign to curb false news – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – WhatsApp on Wednesday launched ‘YouSaid,’ a campaign that educates people on how to verify information and reduce the spread of false news in Nigeria.\nWhatsApp in a statement said that the campaign offers tips for users to spot false news and take responsibility in minimising its spread.\n“Regardless of the person you received the information from, as soon as you share, it becomes something people think ‘YouSaid’.\n“If you are unsure whether a message is true, check trusted news sites to see where the story came from.\nThe WhatsApp official noted that today the app protects the personal communication of over two billion users all over the world, securing it with end-to-end encryption by default."
  },
  {
    "headline": "Finance Bill 2021 scales 2nd reading in Senate – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Finance Bill 2021 on Wednesday, scaled second reading in Senate.\nThis followed a presentation of the lead debate by the Senate Leader, Mr Yahaya Abdullahi at plenary.\nThe News Agency of Nigeria (NAN) reports that the bill was transmitted by President Muhammadu Buhari to the senate and was read by Senate President, Dr Ahmad Lawan on the floor of the upper chamber on Tuesday.\n“The Finance Bill, 2021 seeks to support the implementation of the 2022 Federal Budget of Economic Growth and Sustainability by proposing key reforms to specific taxation, customs, excise, fiscal and other relevant laws.\nLawan said: “this joint committee will report to the senate, they will lay and consider on Tuesday."
  },
  {
    "headline": "Why interim management was appointed for AEDC- FG – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Federal Government has clarified issues surrounding Tuesday appointment of an interim management for the Abuja Electricity Distribution Company (AEDC).\nAEDC franchise areas include the Federal Capital Territory (FCT), Kogi, Nasarawa and Niger States.\nAliyu said that the ministry’s engagement with the organised labour had led to the restoring of electricity service to the AEDC franchise areas.\nHe said that the takeover of the majority stake in AEDC by UBA has consequently led to the reported changes in the management of AEDC.\n“The changes in shareholding in AEDC and the appointment of an interim management for AEDC by the shareholders has been endorsed by the Nigerian Electricity Regulatory Commission (NERC) and the Bureau of Public Enterprises (“BPE) as co-shareholders in AEDC,” he said."
  },
  {
    "headline": "Afreximbank, UTM Offshore sign $2bn MoU for Nigeria’s first FLNG project",
    "summarized_story": "The African Export-Import Bank (Afreximbank) and UTM Offshore have signed a Memorandum of Understanding (MoU) to raise $2 billion for the development of first Floating Liquefied Natural Gas (FLNG) project in Nigeria.\nThe UTM Offshore FLNG will be the first such project developed by an African company on the continent.\nKassim said UTM Offshore has been studying and conceptualising the development of an FLNG in Nigeria since 2020.\nHe said, “In February 2021, it received a License to Establish from Nigeria’s former Department of Petroleum Resources for the installation of an FLNG unit on Oil Mining Lease 104.\nThe Group Managing Director of UTM Offshore, Rone, was quoted as saying."
  },
  {
    "headline": "Lagos shuts down Ojodu Grammar School over students’ death",
    "summarized_story": "The government of Lagos State has shut down Babs Fafunwa Millennium School, Ojodu, known popularly as Ojodu Grammar School until January 2022 following the killing of students by a delivery truck on Tuesday.\nA delivery truck had on Tuesday crushed about 15 students of the school, sparking outrage among the students and inhabitants of the area.\nAlso, some parents trooped to the school on Wednesday to protest the death of the students.\nMeanwhile, the General Manager of Lagos State Traffic Management Authority, Bolaji Oreagba, has denied the allegation that officials of the agency were involved in the unfortunate truck accident.\n“LASTMA does not have a traffic management duty post around the accident scene."
  },
  {
    "headline": "SEC DG says Identity Management Will Resolve Unclaimed Dividends, other Issues",
    "summarized_story": "OBINNA EZUGWUThe Director General of Securities and Exchange Commission (SEC), Lamido Yuguda has has said the Commission is engaging relevant stakeholders in a bid to resolve issues of identity management which will assist in solving the rising unclaimed dividends in the capital market as well as other issues.\nYuguda pointed out that part of the problems of unclaimed dividends has to do with identity management, saying the Commission is currently engaging the registrars’ stakeholders and increasing investors’ education to stem the trend.\nAccording to Yuguda, the Commission has set up an identity management committee to harmonise various databases of investors and facilitate data accuracy in the market.\nHe said the committee comprises the SEC, the registrars, the stockbrokers, the issuing houses, the CSCS, and NSE, in addition to the e-dividend management committee.\nYuguda said the committee’s assignment would address the challenges of identity management and help tackle some of the issues of unclaimed dividends, direct cash settlement and multiple subscriptions."
  },
  {
    "headline": "FMDQ calls for development of products for millennials to deepen capital market retail participation",
    "summarized_story": "As a way to increase the inclusion rate in the Nigerian capital market, stakeholders have canvassed for the introduction of “sachet” sized technology driven products that would drive increased retail investors patronage in the capital market particularly the younger generation.\n“Here we are talking about capital market, a small aspect of financial inclusion.\n“Even big men in Nigeria want to buy things that are very small and we have to replicate the sachet size model in the capital market.\nIt has worked in everything it is applied to in this country so why don’t we in the capital market adopt it,” Onadele said.\nHe said market stakeholders needed to design investment products to align with financial inclusion strategies to get to the hinter land."
  },
  {
    "headline": "Buhari Reacts To Sylvester Oromoni’s Death, Says Justice Must Be Served",
    "summarized_story": "For several days now, the nation has been gripped by the news of the tragic incident at Dowen College, in Lagos with morbid details constantly emerging of how a young son, Sylvester Oromoni (Junior) met his death.\nPresident Muhammadu Buhari has condemned the killing of Sylvester Oromoni, one of our bright youngsters doing excellently in school, bringing joy to the family and if this incident is truly arising from bullying or cultism, the President assures that it must act as a trigger leading to a permanent solution to this recurring problem.\n“I share the anger and grief up and down the country following this incident.\nOn behalf of my family and I, and the government of the federation, I convey our heartfelt condolences to the Oromoni family, the government and people of Lagos State and give the firm assurance that this incident will be thoroughly investigated and the appropriate punishment meted out to all those who are culpable.”The President in a statement by Presidential spokesman, Garba Shehu urged the Police to continue the ongoing investigation until they get to the root of the matter in order for the law to take its course, assuring that justice will be done, no matter who is involved."
  },
  {
    "headline": "Jailbreaks: Why I Won’t Resign – Aregbesola",
    "summarized_story": "Minister of Interior, Ogbeni Rauf Aregbesola, has said the incessant jailbreaks in the country were not good enough reasons for him to resign from his position.\nMeanwhile, the council has approved the sum of N965.9 million for the purchase of 49 operational vehicles for us by the Nigerian Correctional Service (NCS).\nHe said the vehicles, which would be procured from local manufacturers, would complement the ones already in use by the Correctional Service.\n“These 49 vehicles will complement the 513 operational and Green Maria vehicles already purchased between 2016 and 2020.\nHe also announced the approval of N136.2 million for the procurement of operational vehicles for the National Agency for the Control of AIDS (NACA)."
  },
  {
    "headline": "BoI Doles Out N100bn Funding To Nigeria’s Health Sector",
    "summarized_story": "The Bank of Industry (BoI) has provided over N100billion in funding for the development of the country’s health sector in the last five years.\nConstruction of the first phase of the Abuja AMCE is scheduled to be completed in 30 months.\nThe health industry is one of the focus areas of the Bank of Industry because we believe that a healthy people will result in a healthy nation.\nOn behalf of the investors in this project, AfreximBank, BoI, GE Health Care, NNPC, African Finance Corporation, we are pleased to be part of this transformational project that will literarily transform the provision of health care services not only in Nigeria and in Africa.\nOramah described the AMCE as a landmark project for Africa that is designed as an initiative under Afreximbank’s 5th Strategic Plan."
  },
  {
    "headline": "Senate Mourns Travelers Burnt To Death By Bandits In Sokoto",
    "summarized_story": "The Senate on Wednesday mourned the death of travelers burnt to death on Monday by suspected bandits on their way to Gayan in Kaduna State.\nThe travelers numbering 23, according to reports, were attacked in Angwan Bawa, Sabon Gari local government area of Sokoto State.\nThe victims were said to be on their way to the southern part of the country when they were intercepted and killed by the bandits.\nComing under order 43 of the Senate rules, Senator Ibrahim Gobir (Sokoto East), drew the attention of his colleagues to the gruesome murder of the travelers.\nThe Senate, thereafter, observed a minute silence to mourn the victims of Monday’s attack by bandits."
  },
  {
    "headline": "Osinbajo: Group Warns Against Campaign Of Calumny",
    "summarized_story": "A group under the aegis of Osinbanjo Grassroots Organisation (OGO) has warned people it described as “political jobbers” to desist from any form of defamation against the Vice President, Prof. Yemi Osinbajo (SAN).\nThe group in a statement by its national convener, Ojo Sylvanus Foluso, on Wednesday, alleged that a Member of the House of Representatives has an agenda to defame the Vice President in order to give his presidential candidate an edge.\nADVERTISEMENT“For the fact that they think this Osinbajo is their only obstacle to power, we shall heighten our pressure on him to harken to our call and enter the ring.\nOsinbajo is as qualified as any other Nigerian and his right is guaranteed under the law of this country to seek the highest office.\nThe qualification for the office is very clear and Osinbajo has this in abundance and it cannot be quesoned, doubted rubbished."
  },
  {
    "headline": "$322.5m Abacha loot: Switzerland, group sign contract to monitor spending",
    "summarized_story": "This was made known by the Executive Director, ANEEJ, Rev David Ugolor, in a statement titled, ‘$322.5m Abacha loot: Switzerland signs $50,000 contract with ANEEJ for MANTRA Phase II’.\nHe said the agreement is coming after a couple of meetings between the swiss government, ANEEJ and other stakeholders.\nCombating corruption necessarily includes the involvement of CSOs in the recovery, repatriation, and management of recovered assets.\nFollowing the downturn in the global economy occasioned by the covid-19 pandemic, the FCDO stopped funding the project in January 2021.\nA report is expected before the end of the year 2021,” the statement added."
  },
  {
    "headline": "$322.5m Abacha loot: Switzerland, group sign contract to monitor spending",
    "summarized_story": "This was made known by the Executive Director, ANEEJ, Rev David Ugolor, in a statement titled, ‘$322.5m Abacha loot: Switzerland signs $50,000 contract with ANEEJ for MANTRA Phase II’.\nHe said the agreement is coming after a couple of meetings between the swiss government, ANEEJ and other stakeholders.\nCombating corruption necessarily includes the involvement of CSOs in the recovery, repatriation, and management of recovered assets.\nFollowing the downturn in the global economy occasioned by the covid-19 pandemic, the FCDO stopped funding the project in January 2021.\nA report is expected before the end of the year 2021,” the statement added."
  },
  {
    "headline": "Senate condemns Aiteo’s oil spill in Bayelsa, demands environmental impact assessment",
    "summarized_story": "The Nigerian Senate has passed resolutions condemning the oil spill at Santa Babara well 1, OML 29 operated by AITEO Eastern Exploration and Production Company Nigeria Limited in Opu Nembe in Nembe Local Government Area of Bayelsa State.\nThe Senate, therefore, asked the company to “urgently seek, explore, and deploy relevant highest level of expertise and technology to stop the spill and prevent the continuous damage to the environment as well as restore the life support system of the people.”The resolution was reached when Senator Biobarakuma Degi Eremienyo (Bayelsa East), drew the attention of the Senate by a motion on the oil spill as a matter of urgent public importance.\nA statement issued on Wednesday by his Special Assistant (Media), Ebinim Omubo, said the Senate urged the relevant agencies to “undertake environmental impact assessment to determine the extent of the pollution with a view to undertaking remediation in accordance with internationally accepted standards.”According to him, the Senate also resolved that the National Emergency Management Agency should as a matter of urgency provide relief materials because the ugly incident has taken a negative toll on the health and well-being of the people of the host communities which can be declared a disaster area.\nThe Senator emphasized that the degree of incompetence is sufficient to attract sanctions such as revocation of AITEO’s operational license by the regulatory authorities to instil sanity in the oil and gas sector in response to the increased global call for protection of the environment.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Senate condemns Aiteo’s oil spill in Bayelsa, demands environmental impact assessment",
    "summarized_story": "The Nigerian Senate has passed resolutions condemning the oil spill at Santa Babara well 1, OML 29 operated by AITEO Eastern Exploration and Production Company Nigeria Limited in Opu Nembe in Nembe Local Government Area of Bayelsa State.\nThe Senate, therefore, asked the company to “urgently seek, explore, and deploy relevant highest level of expertise and technology to stop the spill and prevent the continuous damage to the environment as well as restore the life support system of the people.”The resolution was reached when Senator Biobarakuma Degi Eremienyo (Bayelsa East), drew the attention of the Senate by a motion on the oil spill as a matter of urgent public importance.\nA statement issued on Wednesday by his Special Assistant (Media), Ebinim Omubo, said the Senate urged the relevant agencies to “undertake environmental impact assessment to determine the extent of the pollution with a view to undertaking remediation in accordance with internationally accepted standards.”According to him, the Senate also resolved that the National Emergency Management Agency should as a matter of urgency provide relief materials because the ugly incident has taken a negative toll on the health and well-being of the people of the host communities which can be declared a disaster area.\nThe Senator emphasized that the degree of incompetence is sufficient to attract sanctions such as revocation of AITEO’s operational license by the regulatory authorities to instil sanity in the oil and gas sector in response to the increased global call for protection of the environment.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "FG Arraigns Famzhi CEO, Mariam Suleiman, Over Alleged N2bn Fraud",
    "summarized_story": "Mrs Suleiman and her company were charged with two counts before Justice Inyang Ekwo.\nAccording to the Nigerian News Agency, Mrs Suleiman is the first defendant in the action, while the firm is the second.\nAfter she entered her plea, her attorney, Victor Giwa, reminded the court that a bail application dated and filed on November 1 was pending.\nThe issue was initiated on behalf of the Federal Government by lawyer to the Attorney-General of the Federation, AGF, Moshood Adeyemi, who acknowledged receipt of the bail application.\nMr Adeyemi, on the other hand, informed the court that the first defendant stated her travel documents were missing."
  },
  {
    "headline": "BREAKING: Identities Of Lagos Students Killed By Truck Revealed",
    "summarized_story": "The identity of secondary school kids killed by a truck in the Ojodu region of Lagos State on Tuesday have been published by the Ojodu Local Council Development Association.\nWhen the truck ran over the students at 2 p.m., they were on their way home from school.\n“Unfortunately, as a result of the accident, two students were confirmed dead on the spot.\nAs of now, we can confirm that all the injured students are in stable conditions and are receiving medical attention at the following Hospitals,• God’s Apple City Hospital, Ojodu Berger• Royan Hospital, Aina Street Ojodu• St. Michael Hospital, Ojodu• Lagos State Emergency Hospital, Toll Gate, Ojota.\n“My heartfelt condolences to the victims’ families, May God grant them the fortitude to bear the irreplaceable loss."
  },
  {
    "headline": "We Are Suffering, Hungry, We Need Our November Salary – Policemen",
    "summarized_story": "The non-payment of their November salary has alarmed certain police officers from various formations and commands around the country.\nThe policemen, who spoke on the condition of anonymity, claimed that the nonpayment of their November wage had made their situation worse.\nOther security agents have been paid their November pay, according to the cops, who claim they are hungry.\nOne of the officers said, “Help us shout it loud and clear, no November salary for police, the signal above indicated like that.\n“All others security agents have been paid."
  },
  {
    "headline": "BREAKING: Lagos Shuts Ojodu School After Fatal Truck Accident Until 2022",
    "summarized_story": "The Lagos State Government has shut down Bab Fafunwa Millennium School, Ojodu, formerly Ojodu Grammar School until January 2022.\nEducation commissioner Folashade Adefisayo announced this when she visited the school on Wednesday morning.\nYesterday, a speeding truck rammed into some of the school’s students, killing two and injuring 12, according to the police.\nSome reports, citing eyewitnesses, put the death toll at 17.\nReports claimed that the truck driver, who has since been arrested, was being chased by officers of the Federal Road Safety Commission (FRSC)."
  },
  {
    "headline": "Breaking: Barcelona submit to ‘heavy’ Bayern Munich defeat, crash out of UEFA Champions League",
    "summarized_story": "Barcelona to Bayern Munich to miss out on a Champions League last-16 place and drop down into the Europa League.\nBayern scored their first when Robert Lewandowski’s cross found Thomas Muller and his header just crossed the line.\nThe hosts doubled their lead thanks to a superb 30-yard strike from former Manchester City forward Leroy Sane.\nJamal Musiala added a third goal in the second half with a routine finish after a pull-back from Alphonso Davies on an embarrassing evening for Barcelona.\nDetails loading…"
  },
  {
    "headline": "Why FG sacked AEDC management – NERC, BPE",
    "summarized_story": "The Nigerian Electricity Regulatory Commission (NERC) has revealed reasons behind the sack of the management of the Abuja Electricity Distribution Company (AEDC) over the strike by the Nigerian Union of Electricity Employees (NUEE).\nA statement issued by the Chairman NERC, Sanusi Garba, and the Director General Bureau of Public Enterprises (BPE) Alex A. Okoh on Wednesday, debunked news leading to the change of management.\nNERC said AEDC management had failed to meet up their legal obligations which led electricity workers to protest, an action that disrupted power supply within Abuja and environ up to 14 hours.\n“Eventually, this resulted in a total service disruption on 6th December 2021 for over 14 hours in EDC’s network area.\n“Stakeholders including NERC, Central Bank of Nigeria (“CBN”) and BPE had on several times worked to broker an amicable resolution between the contending parties."
  },
  {
    "headline": "My husband is impotent, assaulted me for 6 years, estranged wife exposes Fani-Kayode",
    "summarized_story": "Precious Chikwendu, the estranged wife of former aviation minister, Femi Fani-Kayode, has told a Customary Court of the Federal Capital Territory (FCT), Abuja that the later has erectile dysfunction.\nAccording to Chikwendu, Fani-Kayode never consummated his six-year relationship with her because he is impotent.\nThe petitioner stated this in her November 29, 2021 “Application for issuance of civil summons/plaint” against Fani-Kayode, who is a respondent in the suit.\nWhile they were married, Chikwendu accused Fani-Kayode of assaulting her severally; she then prayed court to declare that she was never married to him.\nSimilarly, she accused the former minister of lying to her that his marriage to his third wife had ended."
  },
  {
    "headline": "Enough Of Harassment Of Judicial Officers, We Can No Longer Take It – CJN",
    "summarized_story": "﻿The Chief Justice of Nigeria (CJN), Tanko Muhammad, has warned individuals and agencies of the government against any form of harassment and embarrassment of judicial officers in the country.\n“I must make it known to all and sundry that we have had enough dosage of such embarrassments and harassments of our judicial officers across the country and we can no longer take any of such shenanigans.\nAccording to the CJN, the era of oppressing, suppressing, and intimidating judicial officers is long gone and such action will no longer be condoned.\nJustice Muhammad stated that the judiciary would begin to resist any clandestine attempt to silence or ridicule judicial officers to oblivion.\n“No law permits anyone to invade, subdue or overawe any Nigerian citizen in his or her residence with a flimsy, fraudulently obtained search warrant.”"
  },
  {
    "headline": "Bandits Block Highway In Zamfara For Five Days, Kill Six Motorists",
    "summarized_story": "Bandits in Zamfara went on a rampage recently as they blocked a major highway in the state for at least five straight days, locals told Channels Television on Wednesday.\nAlthough the police authorities in Zamfara confirmed the incidents, they stated that the Shinkafi–Moriki–Kaura-Namoda Road has since been cleared and is safe for use.\n“They have burnt down six vehicles, killed six motorists, kidnapped several others, and caused an accident involving a trailer carrying potatoes from Shinkafi market.\n“Now, we have put our heads together with other security chiefs and deployed enough security operatives along the road.\nHe added that the farmers were injured, but they were taken to the hospital by the security operatives deployed in the area."
  },
  {
    "headline": "FG Confirms Some COVID-19 Vaccines Expired, Says They Were Not Distributed",
    "summarized_story": "The Federal Government has confirmed that within the last month, some COVID-19 vaccines expired in the country.\nIn a statement on Wednesday the Minister of Health, Dr Osagie Ehanire, noted that donation of surplus Covid-19 vaccines with short/expiring shelf lives has been of great concern internationally.\n“The vaccines that expired had been withdrawn before then, and will be destroyed accordingly, by NAFDAC,” the health ministry’s statement read n part.\nThis assurance comes a few hours after reports suggested that up to one million COVID-19 vaccines expired in Nigeria last month without being used.\nAccording to the health ministry, this practice is frowned upon in Nigeria because it is not accommodated in the nation’s standards."
  },
  {
    "headline": "Keren-Happuch: Group Protests At Unity Fountain, Demands Probe Into Schoolgirl’s Death",
    "summarized_story": "A group called the Coalition of Gender-Based Violence Responders has staged a solemn protest at the Unity Fountain in Abuja, the nation’s capital demanding a probe into the death of Keren- Happuch Akpagher.\nThe SS1 one boarding student of Premiere Academy, Lugbe Abuja died in June 2021 of alleged rape complications.\nThe group gathered early on Wednesday morning at the Unity Fountain clad in black outfits, displaying placards with various inscriptions.\nThey mandated the House Committees on Education, Youth Development, and Women Affairs and Social Development to follow up with the investigation.\n“Three (3) days after I took away my daughter, she died in a hospital in Abuja on the 22nd day of June 2021."
  },
  {
    "headline": "Yuletide: Lagos Govt Issues Guidelines On Parties, Others",
    "summarized_story": "The Lagos State government has issued a set of guidelines on social events and gatherings during the festive season amid the fourth wave of the COVID-19 pandemic.\nIt stated that all social events must be duly registered to obtain event safety clearance from the Lagos State Safety Commission website (www.lasgsafetyreg.com) prior to holding.\nThis was announced in a statement on Wednesday by the Commissioner for Information in the state, Gbenga Omotoso.\nREAD ALSO: Lagos Announces Fourth COVID-19 Wave, Says Erring Foreigners Risk DeportationSee the guidelines issued by the government below:"
  },
  {
    "headline": "Resign now if you have political ambition, Gov Abiodun tells appointees -",
    "summarized_story": "Ogun State Governor, Prince Dapo Abiodun, has directed all serving political appointees with 2023 political ambitions in the State to resign on or before Jan 31 2022 to pursue their dreams.\nA statement issued in Abeokuta on Tuesday by his Chief Press Secretary, Mr. Kunle Somorin, said the directive had become expedient to avoid observed distractions and loss of focus in the discharge of their responsibilities.\nWhilst noting that it is legitimate to have such ambitions, the Governor, however, said: “As an Administration unwaveringly committed to delivering on its electoral promises, any activity that is capable of undermining the implementation of the Building Our Future Together Agenda of the Administration will not be tolerated”.\nGovernor Abiodun counselled that those who cannot wait till the appropriate time for 2023 electioneering process should take their leave to pursue their ambitions without constituting a clog in the wheel of the implementation of government programmes and activities, the statement concluded."
  },
  {
    "headline": "Nigeria needs thorough review of 1999 Constitution",
    "summarized_story": "Nigeria Needs Thorough Review of Constitution - Group"
  },
  {
    "headline": "I don't see anything wrong In Sanwo-Olu's Peace Walk initiative",
    "summarized_story": "In this interview, Babajide Kolade-Otitoju shares his views on the peace walk suggested by the Lagos State Governor, Babajide Sanwo-Olu.\nThe veteran journalist added that the move by the state governor is a good one, that is geared towards healing the wounds created by the unfortunate incident of October 20, 2020."
  },
  {
    "headline": "Speaker Gbajabiamila inaugurates road in Ikorodu",
    "summarized_story": "The speaker of the House of representatives, Femi Gbajabiamila has inaugurates road facilitated by Babajimi BensonThe road situated in the Ikorodu area of Lagos is designed to help improve intracity movement and boost economic activities."
  },
  {
    "headline": "PM Johnson Imposes Covid ‘Plan B’ in England to Contain Omicron",
    "summarized_story": "Undermined by accusations that his staff partied at Downing Street during a Christmas lockdown last year, Johnson said Omicron was spreading rapidly and he had no choice but to move to “Plan B” while a vaccine booster programme rolls out.\nSterling fell sharply when news first emerged on Wednesday that ‘plan B’ measures were imminent and investors pared back their bets on a Bank of England interest rate hike next week.\nJohnson, who lifted most COVID restrictions in England in July following a rapid vaccine rollout, had vowed to navigate the winter without resorting to a fourth COVID-19 lockdown, but had kept a so-called Plan B in reserve.\nThe prime minister also said COVID restrictions could not last forever and the country may need to have “a conversation” about what to do when a substantial proportion of the population refuses to get a vaccine.\nScotland, Wales and Northern Ireland set their own COVID restrictions and had already set tougher rules."
  },
  {
    "headline": "India Armed Forces Head among 13 Dead in Helicopter Crash",
    "summarized_story": "The head of India’s armed forces, General Bipin Rawat, was among 13 people killed on Wednesday when the military helicopter they were travelling in crashed, the air force said.\nRawat, 63, was appointed as India’s first Chief of Defence Staff by Prime Minister Narendra Modi’s government in late 2019.\nThe position was set up with the aim of integrating India’s three military services – the Army, the Navy and the Air Force.\n“A true patriot, he greatly contributed to modernising our armed forces and security apparatus,” the prime minister said.\n“This is a safe, proven helicopter, I have travelled on it in difficult situations,” former army chief J.J.Singh said."
  },
  {
    "headline": "Pfizer Says Covid Booster May Offer Protection against Omicron",
    "summarized_story": "Pfizer said Wednesday that a booster of its COVID-19 vaccine may offer important protection against the new omicron variant even though the initial two doses appear significantly less effective.\nPfizer and its partner BioNTech said that while two doses may not be strong enough to prevent infection, lab tests showed a booster increased by 25-fold people’s levels of antibodies capable of fighting off omicron.\nFor the lab tests, researchers grew samples of so-called “pseudoviruses” that hold the worrisome new mutations.\nScientists don’t yet know how big a threat the omicron variant really is.\nBut they’re the first from a vaccine maker examining whether the booster doses that health authorities are urging people to get may indeed make a key difference."
  },
  {
    "headline": "‘High Standards’: Nigeria Says It Won’t Dispense Vaccines with Extended Validity, after 1 Million Doses Discarded",
    "summarized_story": "Nigeria’s Federal Ministry Of Health has clarified reports circulating about one million expired covid-19 vaccines in the country, stating that Nigeria does not dispense vaccines with validity extended beyond expiry date.\nThis follows a Reuters report stating that over one million Covid-19 vaccines expired in Nigeria last month without being used.\n“Nigeria does not distribute vaccinations having a validity period that extends beyond the expiration date on the label.\n“Donation of surplus Covid-19 vaccines with expiring shelf lives to developing countries has been a matter of international discussion.\n“Developing countries like Nigeria accept them because they close our critical vaccine supply gaps and, being free, save us scarce foreign exchange procurement cost."
  },
  {
    "headline": "Funke Opeke, Judith Gardiner Throw Light on Equinix Acquisition of MainOne",
    "summarized_story": "Tuesday, Nigerians woke to the good news that the world’s digital infrastructure company, Equinix, was in the process of acquiring MainOne, a West African data centre and connectivity solutions provider, at an enterprise valuation of $320 million.\nThe deal, which is expected to be closed by the first quarter of 2022, will add more than 64,000 gross square feet of space to Platform Equinix, with 570,000 square feet of land for future expansions.\nThe company’s digital assets have helped connectivity to and from Europe, West African countries and the major business communities in Nigeria.\nWhen completed, the acquisition will extend Platform Equinix into West Africa, giving organisations based inside and outside Africa access to one of the world’s fastest growing markets.\nIn this interview, Funke Opeke, CEO of MainOne, who will be staying on as Chief Executive of Platform Equinix after the transaction is closed, and Judith Gardiner, Vice President, Growing & Emerging Markets at Equinix,throw more light on the $320 million deal and the value proposition for both parties and other stakeholders."
  }
]