[
  {
    "headline": "Roommate held over disappearance of Lagos builder from apartment overnight",
    "summarized_story": "The family of a 26-year-old builder, Habeeb Abdulsalam, is worried over the circumstances surrounding his disappearance from his apartment on Odulesi Street, Bariga, Lagos State.\nOur correspondent gathered that Abdulsalam resides in the same apartment with a friend identified only as Jide, who has been arrested by the police.\nIt was gathered that Abdulsalam and Jide went to bed on August 23, but the former was nowhere to be found at dawn.\nAbdulsalam’s elder brother, Shittu, told our correspondent on Thursday that the family reported him missing to the Ilaje Police Division and Jide was invited for questioning.\n“He slept at home on Monday with his friend, Jide."
  },
  {
    "headline": "APC congress: Lagos, Osun, Ogun get parallel excos, Sokoto, Yobe, others back consensus candidates",
    "summarized_story": "A dissatisfied group within the Lagos APC — Lagos4Lagos Movement — held a parallel congress at locations in the state different from where the mainstream APC led by the state Caretaker Committee Chairman, Tunde Balogun, held its congress.\nBut the group loyal to Aregbesola in the council area held a parallel congress at Ola Oni Centre, Gbongan Road, Osogbo.\nOn Saturday, the two groups elected their respective local government party executives, through a consensus approach.\nBut the chairman of the APC local government congress committee in the state, Wale Ohu, insisted that there was no parallel congress in the state.\nOhu said the ward congress results of Abiodun’s faction were upheld and used as the basis for the local government congress."
  },
  {
    "headline": "LG Congress: Committee chair urges unity as Oyo APC holds stakeholders parley",
    "summarized_story": "Amodu gave this admonition in his address at a stakeholders’ meeting of the party in the state, held on Friday evening at the party’s new state secretariat, Oke-Ado, Ibadan.\nThe meeting was in preparation for the congress expected to produce the next set of party executive committee members in the 33 local government areas of the state.\n“The whole world knows we are Progressives and going by the current situation of things in our dear state, APC is being awaited to come back to power in 2023.\nParty leaders and stalwarts who were present at the meeting include; Chief Iyiola Oladokun, Sen. Teslim Folarin, Barr.\nAbu Gbadamosi, Chief Kunle Sanda, Dr. Yunus Akintunde, Dr. Isiaka Kolawole, Mr. Bimbo Adekanmbi, Mrs Hannah Ogunesan, Prince Ayodeji Abass-Alesinloye, Chief (Mrs) Ayoka Lawani, Engr."
  },
  {
    "headline": "APC LG Congress: Party supporters snubs consensus; holds congress in some Kano LGAs",
    "summarized_story": "Our correspondent gathered that congresses were held in Local Governments such as Kano Municipal, Dawakin Tofa, Rimingado and Tofa among others.\nThe party had earlier adopted a consensus arrangement during its stakeholder’s meeting in the state.\nBecause party members under the Buhari Support Organization, BSO led by Alhaji Shehu Dalhatu purchase the forms and were allowed to exercise their rights.\n“We would not succumb to situation where few clique of people would now decide for the majority of the party members,” Sha’aban said.\nHe said “it was agreed by the stakeholders last week presided over by the Governor to adopt consensus arrangement."
  },
  {
    "headline": "FRSC issues traffic alert to southwest travelers",
    "summarized_story": "The Federal Road Safety Corps (FRSC) has alerted motorists travelling to and from the South-West through Kabba-Omuo Ekiti Federal highway of a failed section of the road at Ikoyi, Iyara LGA of Kogi.\nThe Corps Public Education Officer, Assistant Corps Marshal Bisi Kazeem said this in a statement on Saturday in Abuja.\nKazeem said that the development had inhibited free flow of traffic at the affected portion of the road.\n“FRSC solicits maximum cooperation of the motoring public on this development.\nKazeem disclosed that FRSC operatives were on ground controlling traffic at the affected section of the road."
  },
  {
    "headline": "Ganduje to engage expatriates to manage Kano skill acquisition centre",
    "summarized_story": "By Bashir Bello, KANOGovernor Abdullahi Umar Ganduje of Kano State on Saturday disclosed plans by the state government to engage expatriates to manage the newly established Aliko Dangote Utral Modern Skills acquisition centre in the state.\nGanduje disclosed this when he led the Chief of Naval Staff, Vice Admiral Awwal Gambo and his entourage to inspect the centre and other developmental projects across the state.\nIn his remarks, the Chief of Naval Staff Vice, Admiral Awwal Gambo expressed optimism that the centre will bridge the gap of lack of technical training and capacity building.\nI know while we are growing up here we used to have a skill acquisition centre.\nThat is why I say this Dangote centre will address that challenge of self-employment considering the population of Kano state."
  },
  {
    "headline": "GText academy kicks off new session, targets employability, job creation",
    "summarized_story": "By Juliet EbirimIn order to tackle the high unemployment rate in the country and as part of its commitment to help job seek­ers become employable individuals, GText Academy, an offshoot of GText Global, in partnership with Hexavia!\nThe GMD/CEO of GText Global, Dr Stephen Akintayo, disclosed this recently at the launch of the second academic session held at its office in Lagos.\n“We have a goal to train thousands of young people in real estate through virtual and physical classes.\n“We need to give our graduates the necessary training that will position them to be either self-employed or meet the expectations of the modern-day job market.\nAt the event, Faith Adebisi Adedoyin of Doyenne Apparel was presented with a cheque of one million naira for winning the Stephen Akintayo Challenge, a social media competition aimed at supporting young entrepreneurs."
  },
  {
    "headline": "I have no rift with Diri, I just maintained distance – Senator Dickson",
    "summarized_story": "A former Governor of Bayelsa and the current Senator representing Bayelsa West senatorial district, Seriake Dickson has denied having any rift with the incumbent Governor, Douye Diri.\nDickson disclosed that he deliberately maintained a distance from the incumbent administration as he desired to give his successor a respectable distance to operate.\nDAILY POST, gathered that Dickson had since stopped attending government’s functions due to the rift in the duo’s relationship over some of Diri development and economic policies which Dickson wasn’t comfortable with.\nBut Senator Dickson stressed that he was constantly in touch with Diri, especially on issues bordering on the development of the state.\nThe governor urged the people of Bayelsa West to close ranks in order to consolidate the party’s achievements."
  },
  {
    "headline": "Buhari to visit Imo on Thursday – Uzodinma",
    "summarized_story": "Imo Governor, Hope Uzodinma says President Muhammadu Buhari will visit the state on Thursday.\nThe Imo helsman disclosed that his Abuja trip was to “address some political matters and some critical issues”.\nUzodinma announced that the President would commission “significant projects” while in Imo.\nHe listed roads constructed through federal government/World Bank intervention and Nigeria Erosion and Watershed Management (NEWMAP) projects.\n“Imo has been able to attract additional support from Mr. President on the management of some ecological problems in the state,’’ he said."
  },
  {
    "headline": "Islamic group reacts to killing of Felix Sowore",
    "summarized_story": "Muslim Rights Concern, MURIC has reacted to the killing of Felix Olajide Sowore, brother to activist and Sahara Reporters publisher, Omoyele Sowore.\nDAILY POST reported earlier that the Edo Police Command confirmed that suspected kidnappers killed Sowore.\nMURIC, in a statement signed by its director, Professor Ishaq Akintola, said it strongly condemned the killing.\nThe group said it has told the Edo Police Command to find the killers of Sowore’s brother and make them face the law.\n“We … strongly condemn the killing of Felix Olajide Sowore."
  },
  {
    "headline": "How 980 students of Taraba State University lost their admissions",
    "summarized_story": "Dreams of no fewer than Nine Hundred and eighty students who were duly admitted into the Taraba State University to pursue their academics have been dashed.\nThis followed their inability to register within the specified period of time and participate in the just-concluded matriculation exercise carried out by the institution.\nDAILY POST findings showed that 980 of the students admitted did not register or physically appear during the matriculation.\nBy the institution’s tradition, the students who had failed to present themselves for the matriculation, automatically lose their admissions into the institution.\n“We do not know why these students have decided not to turn up for the matriculation but we are actually not happy about it”, the VC said."
  },
  {
    "headline": "Reps minority caucus condemns killing of Sowore’s brother",
    "summarized_story": "The House of Representatives minority caucus has reacted to the killing of Mr. Olajide Sowore, a younger brother of the publisher of Saharareporter and activist, Omoleye Sowore.\nThe caucus frowned at the killing which took place on Saturday, saying the killing of young Nigerians has been unabated in recent times.\nIn a statement by the Minority caucus leader, Ndudi Elumelu, Saturday’s incident is heartbreaking.\nThe Minority caucus calls on the Inspector General of Police to immediately track down the murderers as well as other terrorist and criminal gangs causing havoc in various parts of the country, and bring them to book.\n“While condoling the families of the victims, our caucus charges President Muhammadu Buhari to take clear steps to tackle the insecurity in the country.”Police give details in killing of Sowore’s younger brother"
  },
  {
    "headline": "Why God stopped talking to me in my early Christian life – Pastor Adeboye",
    "summarized_story": "The General Overseer of the Redeemed Christian Church of God, Pastor Enoch Adeboye, says he had his first Baptism of fire when he stopped hearing the voice of his creator.\nAdeboye recounted how he allowed his ego and pride made God avoid talking to him shortly after he got born again.\nHe tells me the road to ply in Lagos so that I can bypass hold up, most of you here know how terrible Lagos traffic is.\nI used to be an interpreter to the general overseer or general superintendent like we call it those days.\nAfter the conversation, God stopped speaking to me, I didn’t hear His voice again."
  },
  {
    "headline": "BBNaija: Angel’s dad replies Boma after 'biggest achievement' comment",
    "summarized_story": "The single dad on his Instagram page, @meyagy, on Friday stated that nobody has the right to dictate another person’s life.\nAngel will never, I repeat, never be intimidated.”@meyagy's comment comes a day after Boma told Angel that participating in the BBNaija reality tv show will be her biggest achievement in life.\nIn response, Angel told Boma that she will surely make it after the show, telling him that she will show him 'pepper.'\nAngel said, “You say that this will be my biggest achievement?\nDon’t ever in your life say that to me.”Annie’s Marriage Clash"
  },
  {
    "headline": "Nkechi Blessing reacts to 2baba, Annie Idibia’s marriage saga",
    "summarized_story": "Actress Nkechi Blessing has reacted to the ongoing saga between family of Tuface Idibia and his wife, Annie.\nThis is coming after the singer’s wife called him out on social media over an alleged affair with one of his baby mamas.\nReacting to the feud, Nkechi Blessing condemned the use of social media as a law court while emphasizing the damage it has caused in many relationships today.\n“No matter how pushed I am you ain’t hearing jack shit from me, I take my L and move d F**k on.\n“God forbid**This Evil app that the devil has hijacked is making marriage look like a bad thing, I refuse to allow an app that can be deleted tomorrow take the better part of my life, Never,” she said."
  },
  {
    "headline": "VIDEO: Paul Okoye reunites with family in Atlanta amid divorce saga",
    "summarized_story": "Paul Okoye a.k.a The Rudeboy of PSquare fame has surfaced in Atlanta, Georgia to meet his wife, Anita and their kids, amid stories of a family breakup.\nIn the video, simultaneously uploaded on Instagram by the couple, Paul arrives to pick the twin kids at an Atlanta secondary school, we bet, with his wife shooting the video.\nPaul’s appearance in Atlanta may have rubbished the stories that the couple that married in 2014 were about to break up.\nThe Nation recently reported that Anita Okoye filed for divorce from her husband, Paul Okoye of defunct music group P-Square citing lack of mutual conjugal relationship to lack of communication and irreconcilable differences.\nDays ago, Paul Okoye had begged for peace for the Okoye family in the social media."
  },
  {
    "headline": "I bought house worth N450m on my birthday - Bobrisky",
    "summarized_story": "Popular crossdresser, Bobrisky who never gets tired of bragging has again told his fans and followers that he bought a house worth 450 million naira on his birthday.\nThe male barbie in an Instagram post further disclosed that the house would be unveiled in October, without really giving an actual date.\nHe, however, said only billionaires are invited to the unveiling party.\n“My house warming party is in October, another big party coming up Aso ebi is (200k)I bought a house for my 30th birthday worth over 450 million I’m opening it in October, fans my Aso ebi is 200,000.\nStrictly billionaire party only”"
  },
  {
    "headline": "Kalu salutes elder statesman, Chief Emmanuel Iwuanyanwu at 79",
    "summarized_story": "Former Governor of Abia State and Chief Whip of the Senate, Dr. Orji Kalu has congratulated the founder of Champion newspapers, Chief Emmanuel Iwuanyanwu on the occasion of his 79th birthday anniversary.\nIn his goodwill message, the Senate Chief Whip, stated that Iwuanyanwu has sustained his goodwill beyond the shores of Nigeria, owing to his large heart, selflessness, boldness and sincerity.\nHe said, “I felicitate with eminent businessman and elder statesman, Chief Emmanuel Iwuanyanwu as he marks his 79th birthday.\n“Chief Iwuanyanwu is a household name across the country because he has consistently played vital roles in the social, economic and political development of Nigeria.\n” Chief Iwuanyanwu deserves accolades for his giant contributions to the society."
  },
  {
    "headline": "BREAKING: Bandits kill 20 in reprisal attack in Niger community",
    "summarized_story": "From John Adams, MinnaArmed bandits in their large numbers, on Friday night invaded Magami community in the Shiroro local government area of Niger state killing no fewer than 20 villagers in what source close to the community said was a reprisal attack by the gunmen.\nA number of the villagers are said to be missing after the night attack while several others fled to neighbouring communities for safety.\n“By a reliable records, no fewer than fifteen people have gruesomely been murdered by the marauding criminals.\nThis, according to him, will guarantee peace and enable the locals to continue with their lawful and legitimate activities.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Gunmen kill Sowore’s brother in Edo",
    "summarized_story": "From Tony Osauzo, BeninOlajide S‎owore, younger to rights activist and convener of “Revolution Now”, Omoyele Sowore, was yesterday morning shot dead by suspected kidnappers in Edo‎ State.\nThe younger Sowore, a Phar‎macy student of Igbinedion University, was reportedly killed about 0645hrs along Lagos-Benin Expressway by Isuwa by the kidnappers who also abducted five unidentified persons‎.\nSpokesman of the Edo State Police Command, Bello Kontongs, who confirmed the incident in a statement, said Sowore’s corpse has been deposited at the Igbinedion University Teaching Hospital.\nHis remai has been deposited at IUTH mortuary Okada while effort is ongoing to rescue the five kidnap victims.\nThe elder Sowore, had in a statement early yesterday, announced that his “immediate younger brother, Olajide Sowore was today shot and killed near Okada in Edo State by reportedly herdsmen /kidnappers on his way from Igbinedion University in Edo sate where he is studying Pharmacy."
  },
  {
    "headline": "Nigeria, Brazil navies promise to end piracy in Gulf of Guinea",
    "summarized_story": "According to Ambassador Luz, fighting piracy in the Gulf of Guinea is important, as the success in the fight will improve the economy of both coastal states and land lock countries.\nHe said: “At the end, the activities of piracy will raise the cost of products for everyone, especially the landlocked countries.\nBrazil and Nigeria share the Atlantic Ocean as a border.\nHe added: “By and large, the Nigerian Navy has done much to ensure that the maritime environment is deprived of any form of illegalities.\nGbassa said that Nigeria and Brazil had come a long way and that both countries had a lot of bilateral agreements, one of which was in defence."
  },
  {
    "headline": "Anti-open grazing law: Miyetti Allah mocks southern govs",
    "summarized_story": "Of the 17, only six, namely, Abia, Ogun, Oyo, Ekiti, Ebonyi, Imo, and Enugu have in place an anti-open grazing law.\nAccording to him, Imo State Law No.\nIn Akwa Ibom, the Executive is yet to send the bill to the State House of Assembly.\nChief Whip of Osun State House of Assembly, Hon.\nThe Speaker of the Edo State House of Assembly, Hon."
  },
  {
    "headline": "Kaduna LG Polls: El-Rufai Loses Polling Unit to PDP",
    "summarized_story": "By John Shiklam in KadunaKaduna state governor, Mallam Nasir El-Rufai, lost his polling unit to the opposition Peoples Democratic Party (PDP) in Saturday’s Local government elections .\n“We will allow the people of Kaduna state to elect who they want, we do not have to win everywhere.\nOur correspondence who visited some polling units in Kaduna South and Kaduna North LGAs, noted the general apathy among residents.\nIn Gidan Hakimi, Kakuri polling unit, Kaduna South LGA, both the agents of the APC and the PDP, confirmed that people did not come out to vote.\nAlso at the Abubakar Kigo LEA Primary School polling unit, Kaduna North LGA, election officials were idle as people did not turn out."
  },
  {
    "headline": "NCC Directs Telcos to Shut down Operations in Zamfara",
    "summarized_story": "By Emma OkonjiThe Nigerian Communications Commission (NCC), the telecoms industry regulator has ordered all telecoms operators (MTN, Airtel, Globacom, 9mobile and ntel), including Fixed Wireless and Wired Network operators, to shut down telecoms sites in Zamfara State.\nThe directive, which was given to NCC by the Federal Government, was meant to address insecurity and kidnapping in Zamfara State, following the recent mass abduction of students in the state.\nAccording to the letter sent out by NCC to all telecoms operators, dated September 3, 2021, and signed by the Executive Vice Chairman of NCC, Prof. Umar Garba Danbatta, which THISDAY sighted, NCC said the prevailing security situation in Zamfara State, necessitated the immediate shut down of all telecommunications services in the state.\nThe letter further said the directive would enable relevant security agencies to carry out the required activities towards addressing the security challenges in the state.\nThe shutdown order would last for two weeks in the first instance, after which the security situation in the state will be reviewed."
  },
  {
    "headline": "Breaking: Foreign Trade Rises to N12.03trn in Q2",
    "summarized_story": "According to the NBS, the increase resulted from the sharp increase in export value during the quarter under review.\nThe export component of trade was valued at N5.08 trillion, representing 42.22 per cent of total trade while import stood at N6.95 trillion.\nAccording to the Foreign Trade in Goods Statistics for Q2 2021 released by the statistical agency Saturday, the trade balance however stood at a deficit of N1.87 trillion.\nCrude oil which remained the country’s major component of export trade stood at N4.08 trillion or 80.29 per cent of total export.\nThe non-crude oil export recorded N1.00 trillion or 19.71 per cent of total export trade during the review period."
  },
  {
    "headline": "Kwankwaso: Unending Crisis Has Weakened PDP, May Tear it Apart",
    "summarized_story": "*Declares internal fighting heightened by those desperate to control the party*Urges combatants to allow Secondus complete tenureBennett OghifoThe former governor of Kano State and a chieftain of the opposition Peoples Democratic Party (PDP), Rabiu Kwankwaso, yesterday said the unending crisis rocking the PDP had weakened it as an opposition and may eventually tear the party apart.\nKwankwaso, who spoke on the PDP crisis yesterday in an interview with BBC Hausa, said the crisis “is heightened by those who are after leadership of the party.”He added: “Now, the strength of the party has reduced, and in the end, what will happen is that it will tear us apart.\n“The party chairman has only one month left.\nUche Secondus, the embattled National Chairman of the PDP, has been under increased pressure to resign from office.\nI greeted his people and made my way, while he too took his own way home,” Kwankwaso said."
  },
  {
    "headline": "APC Holds LG Congresses Today Amid Controversies",
    "summarized_story": "He added that the restriction of the forthcoming local government congresses was limited to Delta State and did not affect other states.\nThe crisis generated by the judgement of the Supreme Court in the Ondo governorship election petition, has also left the APC in tatters.\nThe Supreme Court judgement apparently questioned Buni’s continued stay, both as national chairman of the party and governor of Yobe State.\nNotwithstanding objections to the continuation of the APC congresses because of the status of Buni, the Buni-led interim leadership of the party insisted that today’s congresses in the local governments should go ahead as planned.\nBuni, in a statement yesterday, called on the officials handling the local government congresses across the country to just and fair to all aspirants."
  },
  {
    "headline": "BREAKING: Nigerian Government Orders Telcos To Shut Down Mobile Phone Services In Zamfara As Bandits Take Over State",
    "summarized_story": "The Nigerian government has ordered all telecom operators to shut down their networks in Zamfara State.\n“The pervading security situation in Zamfara State has necessitated an immediate shutting down of all telecommunications service in the state from today September 03, 2021.\n“This is to enable relevant security agencies carry out required activities towards addressing the security challenge in the state, in line with the requirement, Globacom is hereby directed to shut down all sites in Zamfara State and any site(s) in neighboring state that could provide telecommunications service in Zamfara State.\nThe Zamfara State Government had last Friday also announced some new measures aimed at tackling the growing activities of bandits in the state.\nSimilarly, the government suspended the transportation of livestock to and from the state, saying the transportation of food across the state and outside Zamfara must be verified."
  },
  {
    "headline": "BREAKING: Nigerian Government Orders Telcos To Shut Down Mobile Phone Services In Zamfara As Bandits Take Over State",
    "summarized_story": "The Nigerian government has ordered all telecom operators to shut down their networks in Zamfara State.\n“The pervading security situation in Zamfara State has necessitated an immediate shutting down of all telecommunications service in the state from today September 03, 2021.\n“This is to enable relevant security agencies carry out required activities towards addressing the security challenge in the state, in line with the requirement, Globacom is hereby directed to shut down all sites in Zamfara State and any site(s) in neighboring state that could provide telecommunications service in Zamfara State.\nThe Zamfara State Government had last Friday also announced some new measures aimed at tackling the growing activities of bandits in the state.\nSimilarly, the government suspended the transportation of livestock to and from the state, saying the transportation of food across the state and outside Zamfara must be verified."
  },
  {
    "headline": "It’s Absurd Nigeria Still Relies On 1999 Constitution Imposed By Military 22 Years After — Nnamdi Kanu’s American Lawyer",
    "summarized_story": "Bruce Fein, the US-based lawyer to Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), has said it is absurd that Nigeria still uses the 1999 constitution although it was imposed on the people by a military dictator.\nBruce FeinKanu had remained in detention since he was re-arrested by Nigerian authorities in collaboration with others outside the country.\nThe court had earlier ordered that his lawyers should be granted a routine visit to interact with the separatist leader while in detention.\nBut on Thursday, the DSS had denied the pair access despite meeting formal notification and existing procedures on visitation.\nSpeaking during the interview, Fein condemned the disregard for human rights and due process in Nigeria by government institutions."
  },
  {
    "headline": "It’s Absurd Nigeria Still Relies On 1999 Constitution Imposed By Military 22 Years After — Nnamdi Kanu’s American Lawyer",
    "summarized_story": "Bruce Fein, the US-based lawyer to Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), has said it is absurd that Nigeria still uses the 1999 constitution although it was imposed on the people by a military dictator.\nBruce FeinKanu had remained in detention since he was re-arrested by Nigerian authorities in collaboration with others outside the country.\nThe court had earlier ordered that his lawyers should be granted a routine visit to interact with the separatist leader while in detention.\nBut on Thursday, the DSS had denied the pair access despite meeting formal notification and existing procedures on visitation.\nSpeaking during the interview, Fein condemned the disregard for human rights and due process in Nigeria by government institutions."
  },
  {
    "headline": "It’s Absurd Nigeria Still Relies On 1999 Constitution Imposed By Military 22 Years After — Nnamdi Kanu’s American Lawyer",
    "summarized_story": "Bruce Fein, the US-based lawyer to Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), has said it is absurd that Nigeria still uses the 1999 constitution although it was imposed on the people by a military dictator.\nBruce FeinKanu had remained in detention since he was re-arrested by Nigerian authorities in collaboration with others outside the country.\nThe court had earlier ordered that his lawyers should be granted a routine visit to interact with the separatist leader while in detention.\nBut on Thursday, the DSS had denied the pair access despite meeting formal notification and existing procedures on visitation.\nSpeaking during the interview, Fein condemned the disregard for human rights and due process in Nigeria by government institutions."
  },
  {
    "headline": "PHOTOS: Inside dilapidated Zamfara school where 73 students were abducted",
    "summarized_story": "Government Day Secondary School Kaya, Maradun LGA, Zamfara state, where 73 students were abducted is dilapidated and bereft of perimeter fencing.\nAdvertisementSome of the buildings in the school premises are without windows and doors while the ceilings are starting to cave in.\nAdvertisementSecurity experts have also said the absence of perimeter fencing in most of the schools in the north makes students more prone to abductions.\n“A good perimeter fence with well-trained security personnel mounted gates is the first line of defense for schools in this era of student kidnapping.\nBelow are pictures of the Government Day Secondary School in Kaya."
  },
  {
    "headline": "PHOTOS: Inside dilapidated Zamfara school where 73 students were abducted",
    "summarized_story": "Government Day Secondary School Kaya, Maradun LGA, Zamfara state, where 73 students were abducted is dilapidated and bereft of perimeter fencing.\nAdvertisementSome of the buildings in the school premises are without windows and doors while the ceilings are starting to cave in.\nAdvertisementSecurity experts have also said the absence of perimeter fencing in most of the schools in the north makes students more prone to abductions.\n“A good perimeter fence with well-trained security personnel mounted gates is the first line of defense for schools in this era of student kidnapping.\nBelow are pictures of the Government Day Secondary School in Kaya."
  },
  {
    "headline": "Zamfara abduction: Bandits 'gave 73 students one bottle of water' to share",
    "summarized_story": "Suweba Mohammed, a student of Government Day Secondary School, Kaya, Maradun LGA of Zamfara, has narrated her experience in captivity.\nSpeaking with TheCable on Saturday in Kaya village, the SS2 student said she escaped from her abductors at night.\nSuweba said the gunmen gave them food on their palms and a bottle of water for the 73 students.\nThey gave us one bottle of water for all of us to share,” she added.\nFollowing the abduction on Wednesday, the police said security has been beefed up in Kaya village and environs to forestall another attack."
  },
  {
    "headline": "Zamfara abduction: Bandits 'gave 73 students one bottle of water' to share",
    "summarized_story": "Suweba Mohammed, a student of Government Day Secondary School, Kaya, Maradun LGA of Zamfara, has narrated her experience in captivity.\nSpeaking with TheCable on Saturday in Kaya village, the SS2 student said she escaped from her abductors at night.\nSuweba said the gunmen gave them food on their palms and a bottle of water for the 73 students.\nThey gave us one bottle of water for all of us to share,” she added.\nFollowing the abduction on Wednesday, the police said security has been beefed up in Kaya village and environs to forestall another attack."
  },
  {
    "headline": "Kaduna LG poll: APC loses in el-Rufai's polling unit",
    "summarized_story": "The All Progressives Congress (APC) lost in the polling unit of Nasir el-Rufai, governor of Kaduna, during the state’s LGA elections on Saturday.\nAdvertisementEl-Rufai voted at Ungwan Sarkin polling unit 001 in Kaduna north LGA area of the state.\nAnnouncing the results for the polling unit, Mohammed Sani, the presiding officer, said in the chairmanship election, the Peoples Democratic Party (PDP) scored 86 votes while the APC secured 62 votes.\nSani said in the councillorship election, the PDP scored 100 votes while the APC had 53 votes.\n“We will allow the people of Kaduna state to elect who they want, we do not have to win everywhere."
  },
  {
    "headline": "With Awabah, Tunji Andrews wants to make pensions as popular as banking",
    "summarized_story": "Awabah Nigeria Co-founder, Tunji Andrews.\nThe micro pension scheme was formally introduced in 2019 but is yet to gain traction.\n“When I heard about the new micro pension scheme two years ago, I was excited as I had been thinking about pensions.\n“The bigger goal is to create a larger awareness of micro pensions in Africa,” Andrews said.\n“The lack of micro pension licenses can be a drawback as we believe we are best positioned to drive the product."
  },
  {
    "headline": "Fintech Focus: The link between Open Banking and financial inclusion",
    "summarized_story": "In their place, fintech firms are extending access to financial services in these areas through agent networks and mobile money wallets.\n“Open Banking is a major step forward in solving restricted access to financial services in Nigeria,” said Orioke.\nNigeria’s central bank also recently launched draft regulations for Open Banking, which establishes principles for data sharing across the banking and payments ecosystem.\nOpen Banking could be the ultimate solution to all current difficulties with access to financial services in Nigeria,” Orioke said.\nConsidering its numerous benefits and rapid adoption, Open Banking could potentially revolutionise the financial services ecosystem in Nigeria and go down as one of the most important innovations in the financial inclusion drive."
  },
  {
    "headline": "Ridelink raises $150k pre-seed to build e-logistics technology for East Africa",
    "summarized_story": "Ridelink, an Ugandan e-logistics platform, has just closed a $150k pre-seed investment round to improve its technology and double down on its marketing efforts.\nThe investment was birthed from the startup’s partnership with Ortus Africa Capital, Omidyar Network and African Leadership Academy’s Young Entrepreneurs Fund(Anzisha).\nFounded in 2017 by Daniel Mukisa, Ridelink operates an e-logistics platform developed to seamlessly connect SMEs to a network of transport operators.\nThough Ridelink launched its operation in Uganda, it has since expanded and serves business hubs across East Africa – in the urban, peri-urban and rural Uganda, Kenya and Tanzania.\n“The Young Entrepreneurs Fund is designed to incentivise co-investments into graduates of our programs like Daniel who have chosen to become career entrepreneurs.” said Thokoza Mjo of the Anzisha Prize, who manages the fund."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "On the heels of $40 million Series A in July — one of the largest fundings in the Middle East and North Africa (MENA)..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Insecurity, shortage of drivers drive Uber fares up 92%",
    "summarized_story": "Data from Rakuten Intelligence has shown that the cost of Uber rides between January 2018 and July 2021 has increased, 92 percent.\nIn early July 2021, Uber drivers were about 40 percent below capacity.\nUber drivers in Abuja have complained and lamented over the continued threat to their lives by carjackers, kidnappers, ritual killers and armed robbers.\nBut to turn things around, these ride-sharing companies might need to do even more to convince drivers to return.\nTo turn things around, Uber has launched a $250 million driver stimulus and has invested in more driver bonuses and incentives."
  },
  {
    "headline": "An interview with Etop Ikpe, CEO of Autocheck",
    "summarized_story": "Technology presents an opportunity to truly drive this transformational agenda across millions of lives- an interview with Etop Ikpe, CEO of AutocheckYou have an impressive track record across a number of tech businesses.\nSince the launch, we have expanded beyond Nigeria into West Africa and East Africa, and have onboarded over 70 financial partners across these multiple markets.\nBut I have been blessed with a support group that understands my journey and I am looking forward to spending more time with them.\nAfrica is perceived as a continent with a myriad of challenges but these challenges truly represent opportunities for future growth.\nTechnology presents an opportunity to truly drive this transformational agenda across millions of lives."
  },
  {
    "headline": "Netflix reviews for weekender week 2",
    "summarized_story": "The movie was directed by Kayode Kasum and is available now on Netflix.\nDo check it and thank me later, but don’t say I didn’t warn you.\nWHO KILLED SARA SEASON 1I have never really being a series person, but then I guess rules are meant to be broken and I broke mine for this movie after a good number of years.\nYou won’t believe that even at the end of season 1, we still couldn’t find out who killed, Season 2 is out I am hoping to check that out and discover who killed Sara.\nI am sure you will enjoy every bit of the movie."
  },
  {
    "headline": "UTME: Obaseki commends Aidelogie’s performance as best in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has commended the performance of Ehizogie Jeffrey Aidelogie, who emerged as the best candidate in the state in the Unified Tertiary Matriculation Examination (UTME), organised by the Joint Admission and Matriculation Board (JAMB).\nAidelogie also ranks among the first ten highest scorers in the 2021 UTME which held across the country.\nObaseki commended Aidelogie when he received him in his office at the Government House, Benin City, the Edo State Capital.\nWe are investing at the very foundational stage of education with the Edo Basic Education Sector Transformation (EdoBEST) programme.\nEarlier, Ehizogie Jeffrey Aidelogie, who scored 347 in the exam, ascribed the success to hard work and support from his teacher, classmates and his parents."
  },
  {
    "headline": "JARA stores new outlet launch set for Sept. 8 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Nigeria’s leading discount retail outlet, JARA stores, will on Wednesday, September 8, launch its new store in BDPA Estate, Ugbowo, Benin City, to members of the public, promising an exciting shopping experience for residents in Benin metropolis.\nThe new store is the second outlet to open in Benin City, after the first outlet opened to the public in 2020.\nJARA stores is being operated in Benin City through a Memorandum of Understanding (MoU) between the Edo Development and Property Agency (EDPA) and the EDLP Nigeria Limited.\nA representative of JARA stores, Ayo Bademosi, in a statement, said the opening of the store has been fixed for Wednesday, September 8, 2021.\nAccording to her, “We are officially commissioning the new outlet at BDPA Estate in Ugbowo, Benin City, on September 8, 2021."
  },
  {
    "headline": "COVID-19 3rd wave: Edo Taskforce monitors vaccination in mosques – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government COVID-19 Response Team at the weekend monitored the COVID-19 vaccination exercise in mosques in Benin metropolis, applauding the uptake in vaccination across the state.\nA member of the state COVID-19 Response team and Health Educator, Edo State Primary Healthcare Development Agency (ESPHDA), Irene Uabor, monitored the exercise.\nThe mosques visited by the team include Masjid -Al-Qudus Mosque, Akenzua; Ahmadiyya Muslim Jama’at Mosque, Stadium Road; Anwar-ul- Islam Movement, Benin Mission; Central Mosque,Lagos Street and Edo State Muslim Pilgrims Welware Board Mosque, Dumez Road, Benin City, among others.\nChief Imam of Benin Central Mosque, Sheikh Abdultafah Enabulele, commended the vaccination exercise and government’s effort in partnering with different stakeholders in creating access to the vaccines.\nWe want to appreciate the governor for his passionate appeal and good intentions for Edo people."
  },
  {
    "headline": "Obaseki commiserates with Sahara Reporters Publisher, Sowore over brother’s death – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has commiserated with the Publisher of Sahara Reporters, Omoyele Sowore, over the death of his brother, Olajide Sowore.\nOlajide Sowore was reported to have been killed by gunmen on Saturday, September 4, 2021 in the Okada area of Edo State.\nHe was a student of Pharmacy at the Igbinedion University, Okada, Edo State.\nAccording to Governor Obaseki, “I commiserate with the Sowore family and the Publisher of Sahara Reporters, Omoyele Sowore, over the death of his brother, Olajide Sowore.\n“On behalf of the people and Government of Edo State, I condole with the Sowore family and pray that God will grant all the fortitude to bear the irreparable loss.”..."
  },
  {
    "headline": "Robbers write Ogun community over planned invasion",
    "summarized_story": "ADVERTISEMENTResidents of Olosan Community in Leme, Abeokuta, in Ogun State have been living in anxiety since armed robbers informed them of a planned visit to their homes.\nThe robbers communicated their intention to the residents by pasting notices on walls around the community.\nIn the notice, the gang, which described itself as ‘Oga Oga’ meaning ‘ master of masters,’ threatened to kill residents who fail to keep money for them (robbers) during the impending robbery.\nThe notice read: ‘Important notice to residents of Olosan community.\nThe chairman of the community, who identified himself as Alhaji Ajetokun, said the notice by the unknown robbers took them unawares."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "APC L.G Congress: Osun Deputy Gov. Alabi, Oyebamiji, others express satisfaction with conduct in state",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun State deputy governor, Mr Benedict Alabi, members of the National Committee on Local Government Congress, among others, have expressed satisfaction with the peaceful conduct of Saturday’s All Progressives Congress (APC) Local Government Congress in the state, noting that there was no parallel congress anywhere.\nOyebamiji also expressed satisfaction on the conduct of the national delegation under the chairmanship of Hon.\nCommittee Express SatisfactionSimilarly, members of the National Committee on Local Government Congress of the party expressed satisfaction over the peaceful conduct of the party’s members in the State.\nGbenga Elegbeleye, lauded the peaceful conduct of the party loyalists, describing it as commendable and worthwhile.\nAs you all know, the party’s members have reposed confidence in you and you must justify this and you must not disappoint them,” Oyetola added."
  },
  {
    "headline": "Tokyo Paralympics: Ugwunwa takes javelin gold to bring Nigeria’s medal haul to 10",
    "summarized_story": "Nigeria’s Flora Ugwunwa has won gold for Nigeria in the women’s F54 javelin event at the Tokyo Paralympics, to bring the country’s medal haul to 10, two less than it managed in Rio 2016.\nUzbekistan’s Nurkhon Kurbanova took the silver medal as Yang Liwan of China finished with bronze.\nSimilarly, Lauritta Onye won bronze in the women’s F40 shot put event, falling short of retaining her gold medal from Rio.\nOverall, Nigeria finished Tokyo Paralympics with 10 medals from three events.\nAthletics brought the second-largest haul — one gold and two bronze; while table tennis added just a bronze medal."
  },
  {
    "headline": "NIPC’s profit rises by 1,632% to N2.32 billion in 2020",
    "summarized_story": "The Nigerian Investment Promotion Council (NIPC) has reported 1,632% rise in profit to N2.32 billion for the 2020 financial year, compared to the N134.16 million recorded in the corresponding period of 2019.\nThe agency’s total expenditure hit a three year low of N1.51 billion during the period under review, compared to the N2.04 billion (2018 FY) and N2.2 billion (2019 FY).\nHighlights:Gross Income grew by 62% Year-on-Year from N2.37 billion recorded in FY 2019 to N3.83 billion in the period under review.\nEstablishment costs declined by 70% Year-on-Year, from N104.7 million in FY 2019 to N31.78 million during the period under review.\nSurplus surged by 1,632% Year-on-Year, from N134.16 million in FY 2019 to N2.32 billion in the period under review."
  },
  {
    "headline": "EFCC says Lekki, Lagos now headquarters of internet fraud",
    "summarized_story": "Nigeria’s anti graft agency, the Economic and Financial Crimes Commission (EFCC), has said that Lekki, the fast-developing upper middle-class area of the Lagos metropolis, is emerging as the new hub of Internet scammers.\n“Between April and June 2021, the Advance Fee Fraud and Cyber Crime Sections of the Lagos Command recorded a total of 402 internet-related fraud arrests,” the commission said.\nIkorodu and Alagbado on the Lagos Mainland make up the remainder.\n“Analysis of the data from the Cybercrime Section further shows that the dominant form of Internet crime is dating scam/online dating scam/romance scam.\n“A total of $12,512.49 was recovered from the e-wallet accounts of four suspects within the period,” Uwujaren said"
  },
  {
    "headline": "Lawan Congratutates SGF Boss Mustapha At 65",
    "summarized_story": "The President of the Senate, Ahmad Lawan, has rejoiced with the Secretary to the Government of the Federation (SGF), Boss Mustapha, as he marks his 65th birthday.\nLawan described Mustapha as a distinguished Nigerian who has enriched public office with personal integrity and dedication to work.\nA statement by the Special Adviser (Media) to the Senate President, Ola Awoniyi, quoted Lawan as saying Mustapha’s glittering public service record was a testimony to his deep knowledge of the system and understanding of it as a veritable vehicle for development.\nADVERTISEMENTLawan, therefore, joined his family, friends and political associates to rejoice with him on the auspicious occasion.\nThe Senate President wished Mustapha many more years of good health and happiness."
  },
  {
    "headline": "Lawan Congratutates SGF Boss Mustapha At 65",
    "summarized_story": "The President of the Senate, Ahmad Lawan, has rejoiced with the Secretary to the Government of the Federation (SGF), Boss Mustapha, as he marks his 65th birthday.\nLawan described Mustapha as a distinguished Nigerian who has enriched public office with personal integrity and dedication to work.\nA statement by the Special Adviser (Media) to the Senate President, Ola Awoniyi, quoted Lawan as saying Mustapha’s glittering public service record was a testimony to his deep knowledge of the system and understanding of it as a veritable vehicle for development.\nADVERTISEMENTLawan, therefore, joined his family, friends and political associates to rejoice with him on the auspicious occasion.\nThe Senate President wished Mustapha many more years of good health and happiness."
  },
  {
    "headline": "Gov Abiodun, Amosun Loyalists Hold Parallel APC LG Congresses In Ogu",
    "summarized_story": "This, however, is a typical repetition of the exercise conducted on Saturday July 31, 2021 when loyalists of the two political gladiators also conducted parallel ward congresses across the state, as Abiodun and Amosun have been at loggerheads over the control of the party structure in the state.\nAlso, commenting on the conduct of the parallel congress, the publicity secretary of State Caretaker Committee of the party, Amb.\n‘Tunde Oladunjoye, declared that APC members, who had a parallel congress were only celebrating a “charade”, as their purported congress was a “dead on arrival” exercise.\n“There was nothing like “parallel” in Ogun APC’s Local Government Congress held across the state this Saturday.\nSo, all those claiming to have had any “parallel congress” elsewhere were only celebrating charades”."
  },
  {
    "headline": "Gov Abiodun, Amosun Loyalists Hold Parallel APC LG Congresses In Ogu",
    "summarized_story": "This, however, is a typical repetition of the exercise conducted on Saturday July 31, 2021 when loyalists of the two political gladiators also conducted parallel ward congresses across the state, as Abiodun and Amosun have been at loggerheads over the control of the party structure in the state.\nAlso, commenting on the conduct of the parallel congress, the publicity secretary of State Caretaker Committee of the party, Amb.\n‘Tunde Oladunjoye, declared that APC members, who had a parallel congress were only celebrating a “charade”, as their purported congress was a “dead on arrival” exercise.\n“There was nothing like “parallel” in Ogun APC’s Local Government Congress held across the state this Saturday.\nSo, all those claiming to have had any “parallel congress” elsewhere were only celebrating charades”."
  },
  {
    "headline": "We’ll Transform Ibadan To 21st Century City, Others – Makinde",
    "summarized_story": "Oyo State governor, ‘Seyi Makinde, on Saturday, declared that his administration will turn Ibadan to a 21st century city through the provision of developmental projects across the city.\nADVERTISEMENTA statement by the Chief Press Secratary to the governor, Mr.Taiwo Adisa, qouted the governor as saying that most of the projects embarked upon by his administration in Ibadan will transform the city to a 21st Century city.\nIf one can solve the issues in Ibadan, that means one can solve issues in the whole of Oyo State.\nFew of the projects we are doing in Ibadan are projects that can lead Ibadan to a city of 21th century.\nHe added: “I do give Ibadan Indigenes scholarship and I want to contribute 10million Naira for that again.”"
  },
  {
    "headline": "Kaduna LG poll: El-Rufai loses polling unit to PDP",
    "summarized_story": "Kaduna Governor Nasir El-Rufai has lost the Saturday’s chairmanship and councillorship elections in his polling unit to the main opposition, People’s Democratic Party (PDP).\nEl-Rufai voted at his Polling Unit 001 Ungwar Sarki, Kaduna North local government area where he said his target was not to win all the polls but to improve the voting process using the Electronic Voting Machine.\nIn the councillorship election, APC polled 53 votes while PDP polled 100 votes out of 162 total votes cast.\nWe will allow the people of Kaduna State to elect who they want.\n“We don’t believe in cheating, we don’t believe in rigging election but also we don’t believe that other people should cheat us."
  },
  {
    "headline": "Kaduna LG poll: El-Rufai loses polling unit to PDP",
    "summarized_story": "Kaduna Governor Nasir El-Rufai has lost the Saturday’s chairmanship and councillorship elections in his polling unit to the main opposition, People’s Democratic Party (PDP).\nEl-Rufai voted at his Polling Unit 001 Ungwar Sarki, Kaduna North local government area where he said his target was not to win all the polls but to improve the voting process using the Electronic Voting Machine.\nIn the councillorship election, APC polled 53 votes while PDP polled 100 votes out of 162 total votes cast.\nWe will allow the people of Kaduna State to elect who they want.\n“We don’t believe in cheating, we don’t believe in rigging election but also we don’t believe that other people should cheat us."
  },
  {
    "headline": "Ndume to FG: Surrendered insurgents with blood on their hands must be prosecuted",
    "summarized_story": "has insisted that members of the Boko Haram Islamic sect that have surrendered should not be profiled, interrogated and those with blood in their hands must be prosecuted.\nThe former Senate Leader said that the former insurgents especially those that have blood in their hands cannot be let go just because they have surrendered.\n“Normally, when you get to war level, you are expected to either defeat the enemy or the enemy surrenders.\nThose that have surrendered to them are converted to slaves; they farmed for them, they do their manual works for them.\nSo, if such people, in the process of surrender, if they come in, you have to find out whether he is actually Boko Haram or a victim of Boko Haram in the hands of Boko Haram."
  },
  {
    "headline": "Ndume to FG: Surrendered insurgents with blood on their hands must be prosecuted",
    "summarized_story": "has insisted that members of the Boko Haram Islamic sect that have surrendered should not be profiled, interrogated and those with blood in their hands must be prosecuted.\nThe former Senate Leader said that the former insurgents especially those that have blood in their hands cannot be let go just because they have surrendered.\n“Normally, when you get to war level, you are expected to either defeat the enemy or the enemy surrenders.\nThose that have surrendered to them are converted to slaves; they farmed for them, they do their manual works for them.\nSo, if such people, in the process of surrender, if they come in, you have to find out whether he is actually Boko Haram or a victim of Boko Haram in the hands of Boko Haram."
  },
  {
    "headline": "COVID-19: 49 dead, fresh cases soar in Nigeria",
    "summarized_story": "The Nigerian Centre for Disease Control (NCDC) has reported 49 fresh COVID-19 deaths in the country as infections shot up drastically.\nFigures released by the centre on Saturday showed that the nation reported 964 new cases of COVID-19, over 100 percent higher than the 444 cases posted the previous day.\nLagos posted a huge 456 fresh cases, while Ondo reported 180 cases and Edo, 66 cases.\nThe NCDC said the rise in Lagos’ cases was as a result of the backlog from 3rd (237), and 4th (219) September, 2021.\nTotal confirmed COVID-19 cases now stand at 195,052, with 182,463 survivors discharged."
  },
  {
    "headline": "Buni commends APC members for peaceful council congress",
    "summarized_story": "By Emmanuel Mogbede/AbujaThe All Progressives Congress (APC) on Saturday in Abuja said it has instituted internal mechanisms to address differences and grievances that may arise from its just concluded nationwide local government congresses.\nMai Mala Buni of Yobe and Chairman, APC Caretaker and Extra-ordinary Convention Planning Committee (CECPC) said this in a statement in Abuja.\nBuni said that the party’s doors of reconciliation were always open to its members and advised them to take advantage of them, to build a strong and united APC.\nHe congratulated the party faithful, stakeholders and congress officials on the peaceful and successful conduct of the exercise across the country.\nHe lauded the party’s members, stakeholders, candidates and their supporters for the peaceful and rancour free exercise."
  },
  {
    "headline": "President Buhari To Visit Imo On Thursday – Uzodinma",
    "summarized_story": "President Muhammadu Buhari will visit Imo on Thursday, according to Governor Hope Uzodinma.\nThe Imo helsman disclosed that his Abuja trip was to “address some political matters and some critical issues”.\nUzodinma announced that the President would commission “significant projects” while in Imo.\nHe listed roads constructed through federal government/World Bank intervention and Nigeria Erosion and Watershed Management (NEWMAP) projects.\n“Imo has been able to attract additional support from Mr. President on the management of some ecological problems in the state,’’ he said."
  },
  {
    "headline": "What Akeredolu, Fayemi, Amosun Told Tinubu About His 2023 Presidential Ambition During Visit To London",
    "summarized_story": "SaharaReporters had on August 26 reported that Akeredolu of Ondo State and his Ekiti State counterpart, Fayemi, visited Tinubu in London.\nAsides Fayemi and Akeredolu, Lagos State Governor, Babajide Sanwo-Olu, Tinubu’s godson, had first visited the APC National Leader in July.\n“Most of them by the visits are also mocking Tinubu and confirming that his presidential ambition is practically over.\nPolitical supporters and godsons of the APC leader continue to troop to London on a solidarity visit – the latest being the Speaker of the House of Representatives, Femi Gbajabiamila.\non August 12 it was reported that Buhari visited Tinubu in London after his (Tinubu) second surgery at that time."
  },
  {
    "headline": "APC Is Nigeria’s Biggest Mistake – Atiku Tells Defectors To PDP In Adamawa",
    "summarized_story": "Atiku Abubakar, the former Vice President, was in his home state of Adamawa on Saturday to collect defections to the Peoples Democratic Party (PDP).\nInsisting that the ruling APC is Nigeria’s biggest mistake, Atiku said, “We have done a big mistake before by floating a party called APC.\n”It was PDP that gave back life to Adamawa State after it was slain by the APC and usher it to its present state of development.\nGovernor Fintiri assured the defectors that they would be treated fairly and will be given a level playing ground.\n”Allow those who want to contest among them to participate in the electoral process and they should be well accommodated and given a level playing ground."
  },
  {
    "headline": "BREAKING: APC Splits Into Three Factions In Enugu",
    "summarized_story": "The turmoil engulfing the All Progressives Congress, APC, in Enugu State worsened on Saturday with the creation of a third party group.\nThe peace deal, however, fell apart during the party’s ward congress, resulting in two parallel executives in most wards.\nAccording to reports, one faction supports State Caretaker Committee Chairman Dr. Ben Nwoye, another supports Senator Ken Nnamani, and a third supports Foreign Affairs Minister Geoffrey Onyeama.\nThe local government congress, for example, produced Felix Okafor – Osita Okechukwu group, Onyeka Nwabisi, Minister, Onyeama’s side, and Hyacinth Abala, Chime’s faction in Udi Local Government.\nThe tale is claimed to be nearly identical in all of the state’s 17 local government areas."
  },
  {
    "headline": "Breaking: Operation Safe Haven troops burst drug syndicates, recover N9.5m worth of Indian hemp (PICTURES)",
    "summarized_story": "Troops of Operation SAFE HAVEN (OPSH) on Saturday September 4, 2021 bursted drug syndicate and recovered 320 blocks of Indian hemp worth N9.5 million concealed in a Toyota Camry car with registration number Abuja ABC 214 HV.\nInformation Officer of OPSH, Major Ishaku Takwa, made the disclosure in a press release.\n“They alleged that they were contracted to convey the illicit substance from Ondo state to Yola, Adamawa state,” he said.\nThe suspects and items recovered have been handed over to the National Drug Law Enforcement Agency, Plateau state command for further investigation.\nHe equally urged law abiding citizens to continue to support security agencies with credible information on criminal activities."
  },
  {
    "headline": "Breaking – Kaduna LG polls: El-Rufai loses chairman, councillor elections in polling unit",
    "summarized_story": "Governor Nasir el-Rufai has lost Saturday’s chairmanship and councillorship elections in his polling unit, as the main opposition party, People’s Democratic Party (PDP) won both elections.\nEl-Rufai had earlier voted at his Polling Unit 01 Ungwar Sarki, Kaduna North local government area of the state, where he said his target was not to win all the polls but to improve the voting process and ensure that nobody can rig this and future polls using the Electronic Voting Machine (EVM).\nIn the Councillorship election, APC also polled 53 votes, while PDP polled 100 votes, ZLP won two votes, PRP scored two votes and NNPP scored one vote out of the 162 total votes cast.\nSpeaking after casting his vote, el-Rufai said, “We are not going to behave like other parties or other state government of the ruling party.\n“We don’t believe in cheating, we don’t believe in rigging election, but also we don’t believe that other people should cheat us."
  },
  {
    "headline": "BBNaija season 6: Uncertainty as organisers announce ‘Kingsize eviction’ coming",
    "summarized_story": "Fans of various BBNaija season 6 housemates have their fingers crossed after the Big Brother Naija Shine Ya Eye organisers tagged this Sunday’s live show as ‘Kingsize eviction’.\nThe organisers on Friday revealed this through an e-flier.\nThis may not have come as a surprise to viewers, as all the housemates except the Head of House, Jackie B, and her deputy, JayPaul, are up for possible eviction.\nLiquorose and Pere were automatically up for possible eviction, because they were not eligible to play the game.\nWhile Liquorose couldn’t play because she was the immediate past Head of House, Pere did not participate because he was given a strike."
  },
  {
    "headline": "JAMB withdraws 2021 UTME result of 19year-old candidate over forgery – NigPilot",
    "summarized_story": "The 19 year old candidate who claimed that JAMB has been altering his results since 2019 was also handed over to Nigeria Police for investigation.\nOloyede accused the candidate of result tempering, adding that he will be handed over to the police for investigation and subsequently prosecuted.\nBecause this boy has accused JAMB, we are going to withhold his result until the investigation is concluded.\nEarlier, John had said: The result I have been receiving is not the result I am entitled to.\nNigPilot, Daily Nigerian Newspaper, Nigerian News Update, Nigerian News Headlines, Nigerian Pilot Newspaper Online,"
  },
  {
    "headline": "Abuja Police arrest 2 adolescent kidnappers – Nigpilot",
    "summarized_story": "Federal Capital Territory FCT Police Command Abuja has arrested two adolescent kidnappers operating along Kwali area Council of the City.\nPublic Relations Officer of the Command in a statement on Thursday in Abuja, said the Command arrested one Musa Mukailu 18 years and one Damina Wali 17 years all male suspected to be kidnappers along Kwali axis of the FCT.\nAdding that they met their waterloo while trying to kidnap two women along kwali axis of the FCT.\nEffort is in place to arrest other members of the syndicate.”Stressing that the Command pledges its undeterred resolve to ensure lives and properties of residents within the FCT are protected.\nAnd urged the FCT residents to report all suspicious movements,"
  },
  {
    "headline": "Buhari has recovered about N1trn stolen funds, assets since 2015 – APC group – NigPilot",
    "summarized_story": "As part of its anti-corruption drive, the administration of President Muhammadu Buhari has recovered about a trillion Naira worth of stolen funds and assets since assuming office in 2015, Nigerian Pilot has gathered.\nThis is according to APC Legacy Awareness and Campaign, a voluntary think-tank group of the governing All Progressives Congress, APC.\nThe group noted that under President Buhari’s watch the Federal Government has prioritized the recovery and return of stolen assets belonging to the Nigerian people.\nLukman, APC-LAC said all final forfeitures are being deployed for use in the Government’s special Infrastructure and Social Investment Programmes, or put into the annual Budget.\nIt added that the most recent Abacha and Ibori Loots were transferred to the Nigeria Sovereign Investment Authority (NSIA), for transparent management under the Presidential Infrastructure Development Fund (PIDF)."
  },
  {
    "headline": "#EndSARS: Lagos Govt, LCC Ask Panel To Strike Out Protest Coordinator’s Testimony",
    "summarized_story": "One of the Coordinators of the #EndSARS protests, Serah Ibrahim again failed to show up for her cross-examination on Saturday at the Lagos State judicial panel on restitution for victims of SARS-related abuses and other matters.\nThis prompted the lawyers representing the Lagos State Government, the Lekki Concession Company, LCC and the Police to ask the panel to strike out her previous testimony.\nThey premised their application on her continued absence at the proceedings of the panel.\nAs she played the videos, she explained to the panel that soldiers shot at the harmless protesters and even took away some of the dead bodies.\nThe Senior Advocate’s application was supported by Counsel to the LLC, Rotimi Seriki and Counsel to the Police, Joseph Eboseremen."
  },
  {
    "headline": "LG Elections: El-Rufai Loses Polling Unit To PDP",
    "summarized_story": "The Peoples Democratic Party has won the chairmanship and councillorship seats in Governor Nasir El-Rufai’s Ungwar Sarki polling unit in Kaduna North Local Government Area.\nEl-Rufai, a member of the All Progressive Congress, had earlier voted at the polling unit where he also declared that he is not desperate to win at all costs, but to improve the voting process using the Electronic Voting Machine.\nREAD ALSO: APC Holds LG Congress Elections NationwideAnnouncing the election result, the Presiding Officer of the Unit, Muhammad Sani, said the APC polled 62 votes in the chairmanship election, while the PDP scored 86 votes out of the 159 votes cast.\nIn the councillorship election, APC also polled 53 votes, while PDP garnered 100 votes out of 162 total votes cast.\nThe overall result of the Kaduna North Local Government was however still being awaited at the collation centre as of the time of this reporting."
  },
  {
    "headline": "APC Holds LG Congress Elections Nationwide",
    "summarized_story": "The ruling All Progressives Congress (APC) has held local government congress elections across the country.\nAPC held this second layer of the congresses after it ratified the Ward Congress Appeal Reports across the country.\nIn Lagos State, the congress held in the 20 local government areas.\n‘Peaceful process’At the congress held in the Oshodi area of Lagos, officials were chosen by consensus across 11 wards.\nGovernor Abiodun commended party members for displaying maturity in Ikene and other areas where the exercise held."
  },
  {
    "headline": "Police Confirm Killing Of Sowore’s Brother By Suspected Kidnappers",
    "summarized_story": "The Edo State Police Command has confirmed the murder of Olajide Sowore, brother of Sahara Reporters Publisher, Omoyele Sowore by suspeced kidnappers around 6:00 a.m. on Saturday.\nThe pharmacy student at the Igbinedion University Okada was killed along the Lagos-Benin expressway when gunmen kidnapped about five persons travelling on the route.\nREAD ALSO: Gunmen Kill Polytechnic Staff In Bauchi“This is to confirm to you that suspected kidnappers at about 0645hrs along Lagos-Benin expressway, by Isuwa, kidnapped five unidentified persons and in the process shot to death one Sowore Felix Olajide, male, a pharmacy student of Igbinedion University, Okada.\n“His remains have been deposited at IUTH mortuary Okada, while effort is ongoing to rescue the five kidnap victims.\nSearch and rescue operation is ongoing,” the police statement read in part."
  },
  {
    "headline": "Kabba-Omuo Ekiti Traffic: FRSC Advises Motorists On Alternative Routes",
    "summarized_story": "Motorists travelling to and from the South-West through the Kabba-Omuo Ekiti Highway in Kogi State have been advised to use alternative routes.\nThe Federal Road Safety Corps which issued the advisory on Saturday said a section of the road at Ikoyi under the Iyara Local Government Area of the state had failed, leading to a poor flow of traffic.\nFRSC Public Education Officer, Assistant Corps Marshal Bisi Kazeem, asked road users to use Kabba/Asaya/Ogidi/Ikare as an alternative route to or from South-West.\n“In view of the foregoing, motorists, travellers, and the general public are hereby advised to use Kabba/Asaya/Ogidi/Ikare as an alternative route to or from South-West.\n“The Federal Road Safety Corps solicits maximum cooperation of the motoring public on this development."
  },
  {
    "headline": "Kaduna LGA Polls: APC loses Gov. El-Rufai's polling unit to PDP -",
    "summarized_story": "The People’s Democratic Party has emerged winner of the chairmanship and councillorship seats in Ungwar Sarki polling unit, where Governor Nasir El-rufai cast his vote in Kaduna North Local Government Area on Saturday.\nThe Presiding Officer of the Unit, Muhammad Sani, who announced the results said the APC polled 62 votes in the chairmanship election, while the PDP scored 86 votes out of the 159 votes cast.\nIn the councillorship election, APC also polled 53 votes, while PDP gathered 100 votes out of 162 total votes cast.\nThe overall result of the Kaduna North Local Government is still being collatedGovernor Nasir El-rufai had earlier reiterated his administration commitment to conducting free, fair and credible local government elections not minding whose ox is gored."
  },
  {
    "headline": "FRSC issues advisory on failed Kabba-Omuo Ekiti federal highway",
    "summarized_story": "The federal Road Safety Corps has notified members of the motoring public and general commuters travelling from or to Southwest, through Kabba- Omuo Ekiti Federal Highway of a failed section of the road at Ikoyi under Iyara local government area of Kogi State.\nAccording to a statement signed by the Corps public Education Officer, Bisi Kazeem, the development has led to lack of free flow of traffic at the said portion of the road.\nThe FRSC therefore advised road users and the general public to use Kabba/Asaya/Ogidi/Ikare as alternative route to or from South West.\nThe statement added that the Federal Ministry of Works and Housing is already activating appropriate action to ameliorate the situation.\nThe Federal Road Safety Corps is however, soliciting maximum cooperation of the motoring public on this development."
  },
  {
    "headline": "Obaseki commiserates with Sahara Reporters Publisher, Sowore over brother's death -",
    "summarized_story": "Edo State Governor, Godwin Obaseki, has commiserated with the Publisher of Sahara Reporters, Omoyele Sowore, over the death of his brother, Olajide Sowore.\nIn a statement he personally signed, Governor Obaseki assured that the state government will work with relevant security agencies to investigate the unfortunate incident, noting that efforts will be intensified to bring the culprits to book.\nOlajide Sowore was reported to have been killed by gunmen on Saturday, September 4, 2021 in the Okada area of Edo State.\nHe was a student of Pharmacy at the Igbinedion University, Okada, Edo State.\nThe governor said the news of his death is heartbreaking and assured that the perpetrators of the dastardly act must be brought to justice."
  },
  {
    "headline": "Olajide Sowore: One murder too many",
    "summarized_story": "President, Centre for Change, Joe Okei-Odumakin, has described the murder of Olajide Sowore, younger brother of activist, Omoyele Sowore, as “one murder too many”.\nPress ReleaseOlajide Sowore: One murder too manyTo put it mildly, the murder of Olajide Sowore, younger brother of activist, Omoyele Sowore, is one murder too many.\nI hardly could believe this dastardly act until I spoke with Comrade Omoyele Sowore himself and he confirmed the gruesome killing of his brother.\nTo shrug off such suspicion and accusation, it must act swiftly to arrest the killers of Olajide Sowore and bring them to book.\nGovernment need not be told that its running battle with the older Sowore, Omoyele, over the issue of good governance is one reason this murder cannot be swept under the carpet."
  },
  {
    "headline": "Nigeria: Herdsmen Kill Former Presidential Candidate Sowore’s Brother",
    "summarized_story": "Suspected herdsmen have killed the younger brother of a former Nigeria presidential candidate, Omoyele Sowore.\nMr Sowore who is also the convener of the #RevolutionNow movement, says his brother, Olajide Sowore who is a student of Igbinedion University, Okada was shot dead in Nigeria’s southern Edo state on Saturday.\n“My immediate younger brother, Olajide Sowore was today shot and killed near Okada in Edo state by reportedly herdsmen /kidnappers on his way from Igbinedion University in Edo state where he is studying Pharmacy,” Sowore wrote on his Facebook page.\nYou, the boy who snuck out his older ones to parties, taking all the blames when our disciplinarian father found out.\n“You lived your life so that everyone could be alright but now assassinated by everything that’s not alright.”By Abel Ejikeme"
  },
  {
    "headline": "Nigeria Orders Telcos to Suspend Calls, Internet Services in Bandit-ravaged Zamfara State",
    "summarized_story": "Following growing insecurity in northern Zamfara State, the Nigeria Communications Commission (NCC) has instructed telecommunications companies in the country to shut down their services in the state for two weeks.\nDanbatta said the action had become necessary in other to address security challenges in the state.\nRecent reported cases of banditry and kidnappings had also led Governor Bello Matawalle to suspend transportation of livestock beyond the state’s borders.\nMr Matawalle also directed that weekly markets in the state be shut.\n“The pervading security situation in Zamfara state has necessitated an immediate shut down of all telecommunications services in the state from today September 03, 2021,” Danbatta said in the leaked memo."
  },
  {
    "headline": "Iheanacho Double Downs Liberia as Nigeria Tops World Cup Qualifying Group",
    "summarized_story": "Nigeria kicked off their World Cup qualifying campaign with a comfortable 2-0 win over Liberia on Friday.A double from Kelechi Iheanacho gave the Super Eagles the perfect winning start.\nThe Leicester City striker opened the scoring midway through the first half before ensuring the win with a 44th-minute strike.\nNigeria, who are seeking to reach the World Cup for a fourth consecutive time, top Group C with three points, with Central Africa and Cape Verde joint second on one point after playing out a 1-1 draw on Wednesday.\nIn Group B, Zambia, who are eyeing their maiden World Cup appearance, kicked off their qualifying campaign with a 2-1 win away to Mauritania.\nIn Group D, the Ivory Coast were held to a disappointing 0-0 draw away to Mozambique while South Africa’s game against Zimbabwe in Group G also ended goalless."
  },
  {
    "headline": "Osaka Considers Another Break from Tennis after US Open Loss",
    "summarized_story": "Seemed on track for a similar conclusion in the second set, leading 6-5 and serving.\nBut when Osaka sailed a forehand wide, Fernandez had her first break of the match to make it 6-all.\n“I was only focused on myself, my game, what I needed to do.”More to the point, Osaka was not at her best.\nShe left the court with a white towel draped over her head after the second set, then sat in her changeover chair in that same block-out-the-world manner.\nShe won 18 of 19 first-serve points — and never faced a break point — in the third set."
  },
  {
    "headline": "Zambia Elects First Woman as Parliament Speaker",
    "summarized_story": "Zambia’s parliament has elected its first female speaker, more than a week after longtime opposition leader Hakainde Hichilema was sworn in as the country’s new president.\nNelly Mutti, a lawyer based in the capital, Lusaka, was elected unopposed on Friday to replace Patrick Matibini, a retired high court judge who served as speaker for 10 years.\nIn his address at the ceremony, Hichilema said Mutti’s election championed the cause of women in leadership roles in Zambia.\nHichilema, who has promised a “new dawn”, fired several military, police and prisons commanders just days into his rule.\nHichilema promised to let parliament operate independently and without any influence, urging legislators to give top priority to people’s welfare."
  }
]