[
  {
    "headline": "FG has surrendered to terrorists, citizens should defend themselves – CNG",
    "summarized_story": "“In the last few days, armed bandits/terrorists across four northern states of Sokoto, Zamfara, Katsina and Niger have killed scores of helpless and defenceless citizens in addition to multiple kidnappings and other forms of exploitation.\nRegrettably, these killings, abductions, maiming and exploitation have been going on incessantly with no respite in sight.\n“The security forces are grossly understaffed, ill-equipped and poorly motivated to confront the monstrous terrorists in an aggressive manner to eliminate them from their hideouts.\nIt is also alleged that top security personnel are siphoning the little resources earmarked for the purpose of prosecuting the war.\n“Therefore, the CNG calls on traditional rulers to stand with their people in this difficult and scary situation to confront the challenge for our collective survival."
  },
  {
    "headline": "Hijab protest’s victims: CAN blames Kwara for ignoring peace offer",
    "summarized_story": "The letter was titled, ‘The ongoing hijab crisis at Oyun Baptist High School and other mission schools in Oyun and Offa Local Government Areas: Calling for an urgent intervention’.\nThe usage of hijab in Christian mission schools in Ilorin metropolis was forcefully implemented and imposed.\nIt added, “It has been said times without number that we cannot and will not allow the use of hijab in our mission schools.\n“The mission schools were not taken over by the state government in 1974.\nAgbaje said as of Friday, there was no case instituted at the Supreme Court by CAN on the earlier judgments delivered by a Kwara State High Court and the Court of Appeal."
  },
  {
    "headline": "2023: Kidwaya’s uncle, Joseph Waya joins Benue guber race",
    "summarized_story": "Mr. Waya(2nd left) flanked by friendsBy Peter Duru, MakurdiA foremost journalist, Mr. Joseph Waya who is also the uncle of Kidwaya, the popular BBNaija 2020 Housemate, has joined the Benue state gubernatorial race.\nMr. Waya who made his intention known, weekend, in Makurdi said he was joining the race to provide selfless and purposeful leadership after being prompted by his kinsmen and community leaders.\nHowever, the beckoning of my kinsmen and time makes it more imperative than ever that I offer myself for service at this time.\n“On 3rd November 2021, my kinsmen at Mbakena, Mbayongo in Vandeikya Local Government Area invited me home to a unique reception.\nTherefore, my decision to run for the governorship is solely informed by my undying desire to be of service to our people."
  },
  {
    "headline": "Iru royal tussle: Aggrieved family reconciles with Oniru, Lawal",
    "summarized_story": "Oba Oniru at the reconciliatory meeting at his Palace, Victoria Island, on Sunday.\nBy Olasunkanmi AkoniBarely two years after the Oniru of Iru Kingdom, Oba Gbolahan Lawal ascended the throne of his forefathers, a faction of the aggrieved families from the Abisogun ruling houses, Omowunmi, yesterday, reconciled with Oniru.\nBabatunde-Dauda, said that the family had come together to reconcile with the monarch, having observed the all-inclusive leadership style of Oba Lawal.\nHe said that he was happy to receive the aggrieved members of the Abisogun family, adding that it was about time that all members of Abisogun Royal family reunited to move Iru forward.\nWe will give all rights and entitlements to the family as part of the Royal Abisogun Family grow Iruland."
  },
  {
    "headline": "CSO condemns alleged moves to scrap NSCDC",
    "summarized_story": "…urges NASS to jettison billBy Gabriel EwepuAS Nigerians experience deteriorating security situation, a Civil Society Organisation, CSO, Concerned Nigerians, CN, Sunday, condemned alleged moves to scrap the Nigerian Security and Civil Defense Corps, NSCDC, at the National Assembly.\nShina Peller, seeking to scrap the Nigerian Security and Civil Defence Corps (NSCDC).\n“The argument that the Nigerian Police and the NSCDC performs the same function is misconceived and laughable.\nRather than scrap the NSCDC, its officers should be posted across all the schools in the federation.\n“Accordingly, merging the NSCDC with the Nigerian police will do more harm than good to the nation and its security challenges."
  },
  {
    "headline": "National Youth Leader: I’ll ensure addition of over 5 million youths in APC if elected – Obidike",
    "summarized_story": "“If elected as the National Youth Leader of the All Progressives Congress, APC, I will ensure the addition of over five million youths to the party”, said Hon.\nObidike Chukwuebuka, APC National Youth Leader aspirant.\nHe said that Senator Abdullahi Adamu’s National Reconciliation Committee can be generously appraised for their commitment at mitigating major indifferences amongst state party stalwarts.\nAccording to Obidike, the recent inauguration of APC State Chairmen ahead of the National Convention, the Gov.\nObidike Chukwuebuka is also the current Director General – Conference of APC Support Groups and member of the Party’s National Youth Strategic Lobby Committee"
  },
  {
    "headline": "Financial Times hits Buhari, says Nigeria has sleepwalked closer to disaster under his watch",
    "summarized_story": "By Nwafor SundayThe Financial Times has lampooned the administration of President Muhammdu Buhari.\nIn its latest publication the newspaper based in London, England, lambasted Buhari’s administration, noting that Nigeria has sleepwalked closer to disaster under him.\n“Nigeria’s administration is fuelled by oil — though not its economy; more than 90 per cent of output is generated from non-oil activities.\nCampaigning has already begun for presidential elections that in February 2023 will draw the curtain on eight years of the administration of Muhammadu Buhari, on whose somnolent watch Nigeria has sleepwalked closer to disaster.\nNigeria’s administration is fuelled by oil — though not its economy; more than 90 per cent of output is generated from non-oil activities."
  },
  {
    "headline": "Ondo vows to go tough on car owners using NANS, NYCN, NYP number plates",
    "summarized_story": "Ondo State Government has expressed dismay over the abuse on the usage of number plates of the National Association of Nigerian Students, NANS, National Youths Council of Nigeria, NYCN, and Nigerian Youth Parliament, NYP, among others by some car owners in the stateWhile vowing to go tough on those using such number plates, the state government stated that criminals have began to use them to commit crimes.\nA statement issued over the weekend by the Special Adviser to the Governor on Transport, Tobi Ogunleye, said government will no longer tolerate customised number plates of vehicles across the state without the necessary document backing it.\nThe statement partly read, “The Ondo State Government has noted with dismay the practice of some persons adopting special/customised number plates, most of which have the inscription of the presidency.\nThese numbers include, but are not limited to, NANS, NYCN, NYP and others.\n“While residents have the right to modify their license number plates, it is becoming clear that criminals have begun to use this as a means of carrying out their illicit activities in the state.”"
  },
  {
    "headline": "2023 presidency: Tinubu returns to Nigeria from UK",
    "summarized_story": "Bola Tinubu, an All Progressives Congress, APC, presidential aspirant has returned to Nigeria.\nTinubu returned to Nigeria from the United Kingdom, UK, on Sunday, at about 8 pm.\nTinubu had a few weeks ago informed President Muhammadu Buhari of his intention to run for presidency in 2023.\nThe APC National Leader had said his trip to the UK was part of his campaign strategy, adding that he was consulting while abroad.\nPrior to his trip, Tinubu had visitedsome parts of Nigeria like Oyo, Niger, and Zamfara States as part of his consultations."
  },
  {
    "headline": "2023: ‘It is not a criminal offence to contest for president’ – Utomi",
    "summarized_story": "Prof. Pat Utomi, a political economist, has spoken on plans to join the presidential race in the 2023 election.\nWhen asked if he would contest for the office of the president, Utomi said: “It is not a criminal offence.\nI don’t need a title to make a contribution to the betterment of my country.\n“If it then turnouts that a title drops itself in, well, so be it, but I don’t need a title to make a difference to my country’s history.\nUtomi noted that how Nigeria would be led in 2023 would determine where it would be in the comity of nations."
  },
  {
    "headline": "Herdsmen attacks: Ortom expresses disappointment over Atiku’s neglect",
    "summarized_story": "Benue State Governor, Samuel Ortom, has told former Vice President of Nigeria, Alhaji Atiku Abubakar, that people of the state are not happy with him for abandoning them during their trying times.\nGovernor Ortom spoke Sunday, at the Benue Peoples House when he received the former Vice President and his campaign team on a visit.\nIn his words, “Your visit to Benue as the ‘Zege Mule U Tiv’ is long overdue.\nBut let me say here that our people were not happy that you didn’t visit when terrorists Fulani groups were attacking and killing the people in Benue,” Governor Ortom stated.\nThe former Vice President commended the party leaders in the state for their support to Governor Ortom."
  },
  {
    "headline": "Two-party system threat to Nigeria’s democracy – TMG",
    "summarized_story": "Mr. Auwal Rafsanjani, Chairman, TMG, told NAN on Sunday that the situation of two-party system has created a serious threat to multi-party democracy in the country.\nThe TMG chairman also alleged that some state governors use their security votes to finance political parties, thereby causing Nigerians to have limited options and choices to contest for elections and get into political parties in the country.\nHe said that the situation had made options for Nigerians very limited to explore other political parties to vie for political offices.\nAccording to him, “The two parties use public tax payers money to control other smaller political parties especially because they’re the ones who have governors and control over public sector resources.\n”They have been able to use their resources to expand their control of political parties and membership in Nigeria."
  },
  {
    "headline": "Ex-governor cautions APC on crisis",
    "summarized_story": "A former Sokoto State Governor Yahaya Abdulkareem has cautioned the All Progressives Congress (APC) about its internal crisis.\nHe said the crisis could jeopardise the trust which formed the foundation upon which the various parties that formed the alliance were laid.\nThe former governor regretted that the APC has been enmeshed in one crisis or another since the composition of the current caretaker committee.\nThe former governor addressed reporters at the weekend in Kaduna on the internal wrangling within the ruling party ahead on the 2023 general election.\n- Advertisement -He said: “The purpose of party politics is to win elections and APC was formed by a merger of several other parties for that purpose."
  },
  {
    "headline": "Minister slams N100b defamation suit against online publisher",
    "summarized_story": "Information and Culture Minister Lai Mohammed has sued an online publisher, Jackson Ude, for N100 billion over alleged defamatory publication on his news platform, Pointblanknews.\nThe minister said the report, headlined: “Lai Mohamed in N10b fraud scandal as ICPC swoops in NBC,” was published on August 3, 2021 in Pointbalnknews.com and circulated worldwide.\nMohammed said the publication had damaged his reputation, claiming that the imputations about him in the publication were untrue, malicious, unfounded and wicked.\n- Advertisement -He prayed the court to, among others, award N50 billion as aggravated damages and another N50 billion as general damages against the defendants.\nThe minister is also seeking an order restraining the defendants from further publishing defamatory reports against him."
  },
  {
    "headline": "2023: Why zoning shouldn’t sacrifice competence, by Saraki",
    "summarized_story": "Former Senate President Bukola Saraki has said while zoning is necessary to ensure equity in allocation of political offices, it should not be sacrificed for “character, competence, and quality of leadership”.\nThe former Senate President insisted that the country needs modern progressive leaders who understand current issues and can unite the people.\nHe said: “When we talk about zoning, we need to look at it from a historical perspective.\nOur party (the Peoples Democratic Party), after 1999, instituted zoning to ensure that there was equity.\n- Advertisement -“We need a modern progressive leader that understands current issues and can bring people together."
  },
  {
    "headline": "Nigerian equities’ return hits N2.4tr",
    "summarized_story": "Nigerian equities continued their strong rally so far this year with average gain of 2.33 per cent last week, nudging the average year-to-date return to 10.68 per cent.\nNigerian equities had closed January 2022 with average year-to-date return of 9.15 per cent; equivalent to net capital gains of N2.04 trillion in January 2022.\nNigerian equities had in the throes of the outbreak of COVID-19 pandemic in 2020 recorded average return of 50.03 per cent, representing net capital gains of N6.483 trillion.\nHowever, total transactions at the Nigerian equities market dropped by 12.4 per cent to N1.899 trillion in 2021.\nDomestic institutional investors remained upbeat about the market, with institutional investors increasing their participation in the equities market."
  },
  {
    "headline": "Rep, don decry governors’ failure to invest in basic education",
    "summarized_story": "Stakeholders in the Education sector have decried the lack of investments in basic education by state governments.\nThey argued that a good number of states do not appear enthusiastic about funding basic education, stressing the need for governments to declare an emergency on school infrastructure.\nThe stakeholders spoke at a National Education Summit organised by Human Development Initiatives (HDI) – a non-governmental organisation – with the theme: Building Qualitative, Inclusive and Adaptive Education System: Meeting Modern Day Education Challenges in Nigeria, in Abuja.\nChairman of the House of Representatives Committee on Basic Education, Prof. Julius Ihonvbere, said the absence of policy consistency, poor funding and inadequate basic facilities were major challenges in the sector.\n“There is a problem of absence of policy consistency."
  },
  {
    "headline": "BREAKING: Senegal wins AFCON 2021 beats Egypt",
    "summarized_story": "Senegal on Sunday made history as they won the Africa Cup of Nations for the first time, with a dramatic 4-2 victory on penalties over Mohamed Salah.\nAfter just three minutes, Senegal were awarded a penalty after a rash challenge from Mohamed Abdelmonem on Saliou Ciss in the box.\nMohamed Salah could be seen giving his keeper Gabaski advice on how to save his Liverpool team-mate Sadio Mane’s spotkick and it paid off as the goalkeeper pulled off a heroic save.\nIt was always set to be the battle of Liverpool’s superstars, Salah and Mane but ultimately it was the Senegalese who came out a hero.\nMane redeemed himself after his missed early penalty, netting the winning spotkick in the shootout to secure a history-making win for his country."
  },
  {
    "headline": "Chaos as gunmen kill Delta vigilante commander",
    "summarized_story": "From Paul Osuyi, AsabaThere was chaos in Sapele, Delta State where yet to be identified gunmen shot dead the vigilante commander in charge of Zone 2, Lucky Victor also known as Asikolo.\nAs a result, some aggrieved members of the vigilante group allegedly started harassing motorists in town until security operatives came in to restore calm.\nHowever, shortly after the security operatives left, hoodlums took advantage of the situation to allegedly dispossess residents of phones and other belongings at the Olympia area before the police came in again.\nPublic relations officer of the Vigilante Group of Nigeria, Voke Ubuara, when contacted, said they were sad over the development, adding that Asikolo was trailed and shot dead by the gunmen.\nVoke stated that the vigilante group would partner with security operatives to fish out the killers."
  },
  {
    "headline": "Abia APC: Kalu calls for unity, begs aggrieved members not to defect",
    "summarized_story": "Chief Whip of the Senate and leader of All Progressives Congress (APC) Caucus in Abia State, Senator Orji Uzor Kalu, has called on the members of the party to embrace unity and togetherness ahead of the 2023 general electionsThe Abia North senator also appealed to different factions to bury the idea of defecting to another political party amidst the disagreements in the party.\nIn a statement made available to Newsmen on Sunday, Kalu noted that disagreements are eminent in democratic settings, adding that he does not belong to any of the factions.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\n“The wisest actions from all members is to strengthen the party and work with everyone to achieve the common goal of successful outing in 2023“The ward congress, local government congress and state congress is over.\nI will encourage everyone who believes in our party to remain steadfast because what is ahead is more and better“Abians are strongly behind APC and we have what it takes to wrestle power from the ruling party in the state.”"
  },
  {
    "headline": "Commandant applauds Army for EXERCISE STILL WATERS",
    "summarized_story": "The Commandant of the Nigeria Armed Forces Resettlement Centre (NAFRC), AVM Idi Lubo, has commended the Nigerian Army in Lagos on the conduct of ‘Exercise STILL WATERS, explaining that the military maneuver has contributed immensely towards curtailing of criminality and other heinous activities in Lagos State in 2021.\nThe NAFRC Commandant spoke on Saturday at the 81 Division’s West Africa Social Activities (WASA) in Bonny Cantonment, in Lagos, saying that the Nigerian Army had been actively involved in the fight against all forms of insecurity.\nAir Vice Marshal Lubo said: “The climax of the successes recorded include EXERCISE STILL WATER which was conducted in Lagos State and Ogun simultaneously.\n“This is in line with the vision of the Chief of Army Staff (COAS), Lt.-Gen. Faruk Yahaya, which is to have “A Professional Nigerian Army ready to accomplish assigned missions within a joint environment in the defence of Nigeria.\n“I thank the COAS for his continued efforts in repositioning the Nigerian Army through his vision,” Fejokwu said."
  },
  {
    "headline": "2023 presidency: APC plots to dump S’East, S’West",
    "summarized_story": "From Romanus Ugwu, AbujaThere are strong indications that the All Progressives Congress (APC) may have concluded arrangements to micro-zone its 2023 presidential ticket to the South-south geopolitical zone, thereby foreclosing the possibility of the Southeast zone getting the ticket.\nThe source revealed that going by the current dynamics in the party, the South-south will likely get the ticket.\nReacting to the zoning arrangement the ruling party may opt for, the source said: “The possibility of zoning the APC presidential ticket to the Southeast is almost a forgone conclusion.\nThey also know that diminishing returns can set in if they continue to hang on to power more than necessary.\nMeanwhile, the choice of the former Nasarawa governor as the consensus candidate for the national chairmanship position ahead of other aspirants for the post has continued to generate tension and acrimony."
  },
  {
    "headline": "BREAKING: Senegal Win AFCON After Defeating Egypt In Final Match",
    "summarized_story": "Senegal on Sunday night won the Africa Cup of Nations after defeating Egypt on penalty kicks.\nThe game ended goalless throughout the regulation time and added 30 minutes extra period.\nA packed stadium witnessed the thrilling encounter as the two sides battled for the biggest trophy in African football on the night.\nWith Sunday's triumph, Senegal now joins the list of countries to have won the coveted competition.\nThe tournament was hosted by Cameroon this year after being postponed last year as a result of the outbreak of Coronavirus."
  },
  {
    "headline": "BREAKING: Senegal Win AFCON After Defeating Egypt In Final Match",
    "summarized_story": "Senegal on Sunday night won the Africa Cup of Nations after defeating Egypt on penalty kicks.\nThe game ended goalless throughout the regulation time and added 30 minutes extra period.\nA packed stadium witnessed the thrilling encounter as the two sides battled for the biggest trophy in African football on the night.\nWith Sunday's triumph, Senegal now joins the list of countries to have won the coveted competition.\nThe tournament was hosted by Cameroon this year after being postponed last year as a result of the outbreak of Coronavirus."
  },
  {
    "headline": "How Multi-billion Naira Cancer Centre Former Nigerian First Lady, Turai Yar’Adua Raised Billions Of Naira For Remains Abandoned In Abuja After 12 Years",
    "summarized_story": "An Abuja multi-billion-naira International Cancer Centre (ICC) is yet to take off 12 years after the project was established.\nMrs Turai Yar’Adua, the wife of the late former president, Umaru Yar’Adua, was the brains behind the establishment of the centre that is located on Nnamdi Azikiwe Airport Road in the Federal Capital Territory (FCT).\nIt was said that her aim was to build a cancer centre in the nation’s capital that would cater for people, especially the poor.\nTwelve years after, the centre has been abandoned, with the multi-billion-naira equipment and mini-buses already procured for the project rusting away, The Guardian reports.\nBut we have finished the first phase of the hospital, it’s a very big project.”According to Turai Yar’Adua, the first phase consists of about 200 rooms, four theatres and other administration offices."
  },
  {
    "headline": "How Multi-billion Naira Cancer Centre Former Nigerian First Lady, Turai Yar’Adua Raised Billions Of Naira For Remains Abandoned In Abuja After 12 Years",
    "summarized_story": "An Abuja multi-billion-naira International Cancer Centre (ICC) is yet to take off 12 years after the project was established.\nMrs Turai Yar’Adua, the wife of the late former president, Umaru Yar’Adua, was the brains behind the establishment of the centre that is located on Nnamdi Azikiwe Airport Road in the Federal Capital Territory (FCT).\nIt was said that her aim was to build a cancer centre in the nation’s capital that would cater for people, especially the poor.\nTwelve years after, the centre has been abandoned, with the multi-billion-naira equipment and mini-buses already procured for the project rusting away, The Guardian reports.\nBut we have finished the first phase of the hospital, it’s a very big project.”According to Turai Yar’Adua, the first phase consists of about 200 rooms, four theatres and other administration offices."
  },
  {
    "headline": "How Multi-billion Naira Cancer Centre Former Nigerian First Lady, Turai Yar’Adua Raised Billions Of Naira For Remains Abandoned In Abuja After 12 Years",
    "summarized_story": "An Abuja multi-billion-naira International Cancer Centre (ICC) is yet to take off 12 years after the project was established.\nMrs Turai Yar’Adua, the wife of the late former president, Umaru Yar’Adua, was the brains behind the establishment of the centre that is located on Nnamdi Azikiwe Airport Road in the Federal Capital Territory (FCT).\nIt was said that her aim was to build a cancer centre in the nation’s capital that would cater for people, especially the poor.\nTwelve years after, the centre has been abandoned, with the multi-billion-naira equipment and mini-buses already procured for the project rusting away, The Guardian reports.\nBut we have finished the first phase of the hospital, it’s a very big project.”According to Turai Yar’Adua, the first phase consists of about 200 rooms, four theatres and other administration offices."
  },
  {
    "headline": "Mane victorious, Salah heartbroken as Senegal win first-ever AFCON title",
    "summarized_story": "The Senegalese national team on Sunday defeated Egypt to win the 2021 Africa Cup of Nations (AFCON).\nFour minutes into the game, Senegal had a great opportunity to take the lead.\nAdvertisementEgyptian goalkeeper, Abou Gabal Gabaski, denied Sadio Mane from the penalty spot.\nApart from Sadio Mane missing a penalty, the game played out as predicted in the first stanza.\nAdvertisementThe Teranga Lions held their nerve to win 4-2 on penalties, with Sadio Mane netting the decisive kick."
  },
  {
    "headline": "Mane victorious, Salah heartbroken as Senegal win first-ever AFCON title",
    "summarized_story": "The Senegalese national team on Sunday defeated Egypt to win the 2021 Africa Cup of Nations (AFCON).\nFour minutes into the game, Senegal had a great opportunity to take the lead.\nAdvertisementEgyptian goalkeeper, Abou Gabal Gabaski, denied Sadio Mane from the penalty spot.\nApart from Sadio Mane missing a penalty, the game played out as predicted in the first stanza.\nAdvertisementThe Teranga Lions held their nerve to win 4-2 on penalties, with Sadio Mane netting the decisive kick."
  },
  {
    "headline": "PHOTOS: Tinubu returns to Nigeria after 10 days of 'consultation' in UK",
    "summarized_story": "Bola Tinubu, chieftain of the All Progressives Congress (APC), has returned to Nigeria after a week of “consultations” in the United Kingdom (UK).\nTheCable had reported how Tinubu jetted out of the country in January after weeks of consultations across the country over his 2023 presidential ambition.\nAdvertisementTunde Rahman, Tinubu’s media aide, later said his principal went to the UK for “meetings and consultations”.\nWhile in London, he had meetings with the UK chapter of the APC.\nIn January, Tinubu visited President Muhammadu Buhari during which he announced his intention to contest the presidency in 2023."
  },
  {
    "headline": "PHOTOS: Tinubu returns to Nigeria after 10 days of 'consultation' in UK",
    "summarized_story": "Bola Tinubu, chieftain of the All Progressives Congress (APC), has returned to Nigeria after a week of “consultations” in the United Kingdom (UK).\nTheCable had reported how Tinubu jetted out of the country in January after weeks of consultations across the country over his 2023 presidential ambition.\nAdvertisementTunde Rahman, Tinubu’s media aide, later said his principal went to the UK for “meetings and consultations”.\nWhile in London, he had meetings with the UK chapter of the APC.\nIn January, Tinubu visited President Muhammadu Buhari during which he announced his intention to contest the presidency in 2023."
  },
  {
    "headline": "Ortom to Atiku: Benue people not happy you abandoned them during trying times",
    "summarized_story": "Samuel Ortom, governor of Benue, says former vice-president Atiku Abubakar abandoned the people of the state during their trying times.\nOrtom spoke on Sunday when he received Atiku and his campaign team at the Benue government house.\nThe Atiku Abubakar presidential campaign technical committee headed by Raymond Dokpesi, former chairman of Daar Communications, has been mobilising support for the presidential ambition of the former vice-president.\nAdvertisementSpeaking during the visit, Ortom said Abubakar should have visited the state when residents were under repeated attacks.\nAdvertisementBefore leaving the state, Atiku donated the sum of N50 million for the welfare of internally displaced persons (IDPs)."
  },
  {
    "headline": "Saudi Arabia: A new home for Nigerian startups?",
    "summarized_story": "The Startup Passport initiative, which will ultimately be between the 8-member DCO countries, rolled out initially in Saudi Arabia and Nigeria.\nThis announcement implies that Nigerian startups building products that primarily serve the Middle East and North Africa (MENA) region are invited to build their companies from Saudi Arabia with support from the government.\nFaris AlSaqabi, Saudi Deputy Minister for Future Jobs and Capabilities, explained that the bond between Saudi Arabia and Nigeria is fueled by the country’s movement to a digital economy.\nNigerian Minister of Communications and Digital Economy, Isa Ali Pantami in conversation with a representative of the Digital Cooperation Organization.\nThis new program is expected to transform Saudi Arabia into a leading digital entertainment and media production hub."
  },
  {
    "headline": "TechCabal is surging ahead in 2022 and beyond 🚀",
    "summarized_story": "This year, we are hyper-focused on fine-tuning our editorial standards and establishing TechCabal as one of Africa’s most reputable technology and media publication.\nHe was a senior staff writer at TechCabal for 1 year and 8 months.\nHe was a staff writer at TechCabal for almost 2 years.\nMLIT is a flagship launched by Kay Uguwede, a former TechCabal staff writer.\nDigital Nomads was launched and exclusively written by Olumuyiwa, a former senior staff writer at TechCabal."
  },
  {
    "headline": "Detty December: New data identifies Lekki Phase 1 as Lagos’s COVID-19 hotspot",
    "summarized_story": "Adaobi* is a 24-year-old software engineer living with her 49-year-old mother Oge* at Lekki Phase 1, in Lagos, Nigeria.\nWe noticed that customers in Lekki Phase 1 that would normally order 20 packs of antimalarial drugs for sale within 3–4 days were now ordering 60–70 packs every 1–2 days,” said Okwuada.\nA sore throat is not indicative of malaria but it is one of the major symptoms of COVID-19.\nAnother resident of Lekki Phase 1 jokingly said he suspects everybody in Lekki has the virus already.\nAccording to a Reuter data, COVID-19 infections are decreasing in Nigeria, with 94 new infections reported on average each day."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, This Saturday was Techpoint Build 2021, and it was the thing!!!!!\nFrom the Speaker line-up, which in our..."
  },
  {
    "headline": "Afrobeats: “There are global moments, but the biggest opportunity is Nigeria.” — Obi Asika",
    "summarized_story": "Obi Asika, Founder of Storm 360 Records and Co-founder of Social Media Week LagosThere is no doubt that African music, especially Afrobeats — the melting pot of West African music styles blended with American Jazz — has gone global.\nThis was then fused with Western influences to create Afrobeats.\nBy the late 2000s, we had Myspace, then Facebook, followed by YouTube,” Asika noted.\nWhile Asika believes that several platforms played a significant role in making Afrobeats go global, the talents that create the music play the biggest part.\n“Once we see the Internet no longer becoming a barrier, we’re truly going to see how African music will blow up."
  },
  {
    "headline": "How changing customer attitudes will affect fintech business models in Africa",
    "summarized_story": "Nigeria alone has 144 fintech startups, per Statista.\nAn underdeveloped financial system, difficulty accessing credit, and a growing number of smartphone users present a huge opportunity for new and existing fintech players in Africa.\nAdvertisementPreparing for competitionOluwatobi Boshoro, CEO of Infinitetiks, believes that fintech startups can expect to see competition from startups on the fringes of the financial services sector.\nCurrently, most fintech startups in Africa are focused on one financial service.\nSo what does this mean for fintech startups?"
  },
  {
    "headline": "Building a sense of trust and providing insurance for more Africans",
    "summarized_story": "Today, I’m discussing:GIG Logistics’ crypto integrationLAMI’s acquisition to drive expansion in AfricaGIG Logistics’ crypto integrationRecently, the only constant for Bitcoin has been a downward spiral.\nThose who do not have an XPAD wallet can create one on GIGGO.\nDue to the traditional distribution of insurance policies by individual insurance agents, Africa has low insurance coverage.\nTo make insurance coverage available to more people in Africa on a larger scale, the company has acquired Bluewave Insurance Agency for an undisclosed sum.\nAdelaide Odhiambo, who now works as the head of commercial partnerships at Lami, founded Bluewave Insurance, another Kenyan startup."
  },
  {
    "headline": "New payment system to allow naira across Africa",
    "summarized_story": "Nigerians can now use naira to buy goods and services from other African countries without the hurdle of converting to the dollar, thanks to the new African payment system – Pan-African Payment and Settlement System (PAPSS).\nThe new African payment system was officially launched on January 13, 2022, in Accra, Ghana.\nAccording to Afreximbank, PAPSS provides the solution to the disconnected and fragmented nature of payment and settlement systems that have long impeded intra-African trade.\nPrior to the introduction of the new African payment system, over 80 percent of African cross-border payment transactions originating from African banks had to be routed offshore for clearing and settlement using international banking relationships.\nThat posed multiple challenges, ranging from payment delays to operational inefficiencies and compliance concerns for the disparate regional payment systems."
  },
  {
    "headline": "Anger swirls around Buhari over Electoral Bill",
    "summarized_story": "A few days ago, opposition federal lawmakers asked President Buhari to assent to the reworked Electoral Act Amendment Bill 2022 without delay.\nBuhari refused to sign the electoral bill into law for the fifth time in December 2021.\nThe most recent transmission of the electoral bill to Buhari marks the sixth time he (Buhari) will be tasked with signing legislation aimed at reforming the country’s electoral system.\nThe amended electoral bill included strict guidelines for implementing the various primary election models.\nThe presidency issued a statement on January 31 titled ‘Transmission of the Electoral Bill 2022’ to acknowledge the transmission of the electoral bill to Buhari."
  },
  {
    "headline": "Real estate trends to watch as sector recovers",
    "summarized_story": "Regulatory and compliance intensity, heightened risk of title uncertainty in high profile locations, resolute enforcement of city master plans, and innovative financing strategies top experts’ list of trends to watch in the real estate sector in 2022.\nThe experts, who spoke at an event hosted by the Nigerian-British Chamber of Commerce (NBCC) with the theme, ‘Nigerian economic outlook 2022: Intersection with the real estate sector –Top real estate trends to watch’ noted that despite the obvious effect of inflation, foreign exchange challenges, insecurity, and high unemployment rates, Nigeria’s economic fundamentals remain strong.\n“This year is going to be different as Lagos is going to tackle fraudulent activities in the real estate sector this year.\nAlso, Bisi Adeyemi, NBCC president and chairman of the council, observed that the real estate sector had become a major contributor to the country’s economic growth this year.\n“The major objective of this event is to examine the opportunities, challenges, and, indeed, the threats in the real estate sector in 2022."
  },
  {
    "headline": "THREAT TO 2023 ELECTIONS: THE DANGER OF SPONSORTING THUGS TO WIN OSUN 2022 ELECTION – Nigerian Observer",
    "summarized_story": "Governor Oyetola is inducing violence in Osun APC by orchestrating thugs attack and manipulated the state APC congresses.\nThe illegality and the danger of sponsoring thugs to win Osun 2022 election poses a great threat to 2023 election in Nigeria.\nIllegal thugs funding for Osun 2022 election presents certain problems to future elections in modern liberal and the emerging democracy in Nigeria.\nThe outcome of Osun 2022 election may not reflect the interest of the majority in Osun State, but the interest of the financier of the thugs.\nThe danger ahead of Osun 2022 election is that Governor Oyetola used thugs to conduct APC state congress and he is set to use thugs against other political parties that will participate in the Osun 2022 election."
  },
  {
    "headline": "Edo completes training on e-governance for Permanent Secretaries, as Obaseki urges collaboration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has urged the newly appointed Permanent Secretaries to foster the spirit of collaboration so as to achieve the Making Edo Great Again (MEGA) Agenda.\nThe governor made the call while addressing Permanent Secretaries and other participants at the closing ceremony of the onboarding programme for the Permanent Secretaries at the John Odigie-Oyegun Public Service Academy.\nHe noted, “We need to key into this new strategy and continue to use it in our everyday work as Permanent Secretaries to enable us to become professionals and masters of our fields.\n“It will enable you to treat files wherever you are and bring out your creativity.\nIt will put you in the right mode to effectively and efficiently deliver services to the state,” he said."
  },
  {
    "headline": "Edo strengthens policies, enforcement mechanisms to check quackery in built environment sector – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said it is deploying novel initiatives to check the prevalence of quackery and irregularities in the built environment sector.\nCommissioner for Physical Planning, Urban and Regional Development, Isoken Omo, said this during a visit by the executives and members of the Edo State branch of the Nigerian Institution of Estate Surveyors and Valuers at her office, in Benin City, the state capital.\nOmo pledged to sustain the already existing relationship with the branch, promising to contribute her quota to making the institution and its members conduct their activities in a harmonious environment.\nThe commissioner said that the ministry is regularising permits, developing new urban areas, and collating data that would inform the state’s urban and regional development plans.\nChairman of the state’s branch of the institution, Austin Aigbekaen lauded the ministry’s contributions to the advocacy drive of the current leadership of the institution, which, he noted, had put the institution on the national map."
  },
  {
    "headline": "CISLAC Raises Alarm Over Threats to National Assembly Legislative Staff",
    "summarized_story": "According to the release, the rights group is aware of the hostile practices against the staff and aides of the national Assembly.\n“,We express worries for the nation’s democracy if such anarchical pronouncement is surreptitiously mainstreamed into legislative culture, practice and activities of the National Assembly, as a superior legislative arm”.\n“We find it disturbing that adequate welfare for the legislative staff/aides remains unattended despite huge budgetary allocation totalling N9.6billion, N15.9 billion and N5.7billion appropriated to the legislative aides, National Assembly Management and National Assembly Service Commission, respectively in 2021.\nThey also reiterate their position that adequate welfare for the legislative staff/aides is paramount to effective delivery of the core mandates of both Lower and Upper Chambers of the National Assembly.\nThey equally called on the Office of Auditor General of the Federation to carry out a thorough and targeted audit of implementation of the total sum appropriated to legislative aides, National Assembly Management and National Assembly Service Commission, respectively in 2021."
  },
  {
    "headline": "Amaechi Turbaned as Dan Amanar Daura in Katsina",
    "summarized_story": "Mr. Rotimi Amaechi, Minister of Transportation, was on Saturday officially turbaned as the Dan Amanar Daura (the trusted one of Daura) at a ceremony held at the palace of the Emir of Daura, Umar Farouq Umar on Saturday.\nThe Daura Emir, prayed for Amaechi, whom he described as a an extraordinary individual destined to attain higher office.\nTherefore, It is binding on the Daura traditional emirate to acknowledge the kind gesture.\nAlso turbaned by Emir Faruk along with Amechi is another chieftain of the All Progressives Congress (APC), Nasiru Haladu Danu, a reputable businessman and two-time director general of his election campaigns.\nDanu was conferred with the title of “Tafida Baba” by the Daura Emir."
  },
  {
    "headline": "Ekiti 2022: Oni Not Going To APGA, Says Campaign DG",
    "summarized_story": "The former governor of Ekiti State, Chief Segun Oni has again left the opposition People’s Democratic Party (PDP).\nOni was one of the frontline PDP governorship aspirants who participated in the party’s governorship primary on January 26, 2022, but he however denied dumping the party for the All Progressives Grand Alliance (APGA).\nThere have been rumours that Oni, who is one of the aggrieved PDP aspirants, has concluded plans to dump PDP for APGA to contest for the June 18 governorship poll.\nArokodare said, “Chief Oni has left the PDP but he is not going for APGA.\nIn the next one week, we shall reveal our new platform to contest the election”."
  },
  {
    "headline": "APC Women Urge Resolution Of Crises In States",
    "summarized_story": "The Coalition of All Progressives Congress (APC) Women Groups has urged the leadership of the party to resolve lingering crises in state chapters of the party before going for its national convention, warning that it portends great danger if aggrieved members were ignored.\nThe women advised President Muhammadu Buhari to postpone the national convention of the party slated for February 26.\nThe statement came even after the leadership of party officially informed INEC about its decision to conduct its national convention.\nADVERTISEMENT“The party is yet to recover from the attendant losses from elections that were ordinarily guaranteed in Rivers and Zamfara states during the 2019 general elections.\n“As it was with Rivers and Zamfara states, there are legal implications for how the party is progressing with going into a national convention with all the issues surrounding the party."
  },
  {
    "headline": "Assets Recovery: Misrepresenting AGF Malami’s Efforts Unacceptable – CSO",
    "summarized_story": "A civil society group, the Coalition for Human Rights and Rule of Law (CHRRL) has condemned attacks on the attorney general of the federation and minister of justice, Abubakar Malami, over assetsrecovery in the country.\nThe group in a press statement signed by its president, Gabriel Agibi in Abuja said the “campaign of calumny” was ostensibly launched by agents of corruption to misrepresent Malami.\n“As stakeholders in the justice sector, we are tempted to believe that the stance of the AGF with regard to assets recovery has not gone down well with some individuals, hence the puerile attempt at blackmail and intimidation.\nADVERTISEMENT“It is an unfortunate episode in the annals of the country as to why some individuals who, for reasons best known to them, have arrogated certain powers and privileges.\nAs such, they have carried on like mini gods by blackmailing those who have put the country’s interest first."
  },
  {
    "headline": "Assets Recovery: Misrepresenting AGF Malami’s Efforts Unacceptable – CSO",
    "summarized_story": "A civil society group, the Coalition for Human Rights and Rule of Law (CHRRL) has condemned attacks on the attorney general of the federation and minister of justice, Abubakar Malami, over assetsrecovery in the country.\nThe group in a press statement signed by its president, Gabriel Agibi in Abuja said the “campaign of calumny” was ostensibly launched by agents of corruption to misrepresent Malami.\n“As stakeholders in the justice sector, we are tempted to believe that the stance of the AGF with regard to assets recovery has not gone down well with some individuals, hence the puerile attempt at blackmail and intimidation.\nADVERTISEMENT“It is an unfortunate episode in the annals of the country as to why some individuals who, for reasons best known to them, have arrogated certain powers and privileges.\nAs such, they have carried on like mini gods by blackmailing those who have put the country’s interest first."
  },
  {
    "headline": "2023: APM Passes No Confidence Vote On BoT",
    "summarized_story": "The National Executive Committee of the Allied Peoples Movement (APM) has passed a vote of no confidence on its Board of Trustees (BoT).\nThe party after its NEC meeting, presided over by the national chairman, Yusuf Manman Dantalle at the national secretariat in Abuja yesterday accused the BoT of deficiency.\nThe party also passed a vote of confidence on the national chairman, Yusuf Manman Dantalle to lead the party’s NWC.\nBanna said he remained the BoT chairman despite the vote of no confidence passed on him, adding that he could not be removed by Dantalle whom he brought to the party.\nHe said, “I am not suspended because I am a stakeholder of this party and no one can suspend me, I brought the national chairman."
  },
  {
    "headline": "Sunday Igboho to remain in Benin Republic prison for another six months",
    "summarized_story": "Yoruba Nation agitator, Sunday Adeyemo, popularly known as Sunday Igboho will spend another six months in prison in Benin Republic.\nAliyyu told The Punch that contrary to what was speculated in the news by a lawyer, that Igboho would soon be released, the government of the Republic Benin had renewed the incarceration of Igboho for another six months.\nAnother of Igboho’s lawyer, Pelumi Olajengbesi, had said on Saturday that Igboho would soon be released.\nHe said on his Facebook page, “Chief Sunday Igboho will be out very soon and there will be massive jubilation across the entire Yoruba land.\nThis is very authoritative just that our Yoruba leaders should stop being selfish and allow good to prevail.”"
  },
  {
    "headline": "Sadio Mane redeems himself scoring the winner for Senegal",
    "summarized_story": "Sadio Mane made up for an earlier penalty kick miss with the decisive kick on Sunday in Yaounde as Senegal claimed their first Africa Cup of Nations (AFCON) title.\nMane had seen a seventh minute penalty kick saved by Mohamed Abou Gabal and he was fortunate to still be on the pitch for the shootout.\nBut the hero of the night could be Abou Gabal who made three good saves from Senegal’s Bamba Dieng in extra time.\nThe match saw a free-flowing Senegal side with Mane as its attacking spearhead, against Salah’s compact and defensively-minded Egyptian outfit.\nAs a player, he missed a crucial penalty kick in the 2002 final defeat and was in the dugout for their loss three years ago."
  },
  {
    "headline": "Nigerians In Diaspora Don’t Want To Come Home Because Of Insecurity — Gani Adams",
    "summarized_story": "Nigerians In Diaspora Don’t Want To Come Home Because Of Insecurity — Gani AdamsIba Gani Adams, the Aare Onakakanfo of Yoruba land, says the country’s security challenges have kept Nigerians in the diaspora from returning.\nThis was declared by Adams during the presentation of the book “OPU Globalizing Yoruba Value and Culture” at the 10th anniversary of the Oodua Progressive Union.\nHe said: “Since its inception, OPU has morphed into a global brand with a diaspora organization in 96 countries across six continents of the world.\nBut we still have about 40 countries that are yet to be launched officially.\nAlso for OPU 10th anniversary, we embarked on various empowerments programmes for the widows and underprivileged people across the South-West.”"
  },
  {
    "headline": "BREAKING: Emir Of Jama’are Dies, Leaves Behind Two Wives, 35 Children",
    "summarized_story": "BREAKING: Emir Of Jama’are Dies, Leaves Behind Two Wives, 35 ChildrenThe Emir of Jama’are Alhaji Ahmad Muhammadu Wabi III has died after a brief illness, Vanguard has learned.\nThe Emir was said to have died at about 12 midnight on Sunday after 50 years of reign, leaving behind two wives and 35 children.\nDisclosing the death of the Emir, Gadodamasun Jama’are, Alhaji Salleh Malla said the late ruler will be sorely missed.\nBauchi State Government is expected to announce the details of the burial arrangement any moment from now.\nMore details shortly…"
  },
  {
    "headline": "2023 Election: I See Bomb Blasts, Coup – Primate Ayodele Releases Fresh Prophecies",
    "summarized_story": "In a statement signed by his media aide, Osho Oluwatosin, Primate Ayodele gave spiritual warnings to these African countries.\nStarting with South Sudan, Primate Ayodele revealed that he foresees another coup in Africa if the country’s government doesn’t take the right step now.\nIn Somalia, Primate Ayodele revealed that he foresees an attack on the government house and that the coming election will cause rancour and instability in the country.\nFor Sudan, Primate Ayodele revealed that there will be a change of government which will ‘shock’ the present administration.\nIn Libya, Primate Ayodele prophesied that Gadaffi’s son, Saadi, would win the election without the international community’s interference."
  },
  {
    "headline": "“Abba Kyari Showed me Hell’ – Evans Denies Kidnapping Businessman, Collecting $420,000 Ransom",
    "summarized_story": "Chukwudimeme Onwuamadike, alias Evans, the alleged kidnap kingpin, has stated that he witnessed hell in the hands of DCP Abba Kyari, the suspended Head of the Intelligence Response Team.\nEvans said this at an Ikeja Special Offences Court, while denying kidnapping a businessman, Sylvanus Ahamonu, and collecting a 420,000 dollar ransom from his family.\nNAN reports that Evans is standing trial alongside an ex-soldier, Victor Aduba, on a four-count charge of kidnapping and unlawful possession of firearms.\nEvans told the court that he was born on April 22, 1980, and hailed from Nnewi, Anambra State.\nWhen Sule noted that Ahamonu had identified him when he testified virtually (via the Zoom app) in court, Evans said he was easily identifiable."
  },
  {
    "headline": "Breaking: Mo Salah weeps, Sadio Mane celebrates as Senegal beat Egypt, emerge AFCON 2021 champions",
    "summarized_story": "Sadio Mane scored the winning goal in the penultimate penalty shootout that led Senegal to win 2021 Africa Cup of Nations against Egypt after extra time play inside Olembe stadium Cameroon.\nThe Liverpool forward had seen a seventh-minute penalty saved by Egypt keeper Gabaski but Mane held his nerve when he returned in the shootout.\nChelsea’s Edouard Mendy denied Mohanad Lasheen to give Mane the chance to win it in Yaounde’s Olembe Stadium.\nGabaski had made three good saves from Senegal’s Bamba Dieng in extra time.\nShortly after losing the final encounter, Egypt’s Mohammed Salah wept while his Liverpool teammate Mane leaped in celebration."
  },
  {
    "headline": "VIDEO: Watch Senegal President’s reaction as Sadio Mane misses penalty vs Egypt in AFCON 2021 final",
    "summarized_story": "PreviousUNICEF raises alarm over rise in FGM on girls"
  },
  {
    "headline": "Breaking: From UK, Tinubu returns to Nigeria (PICTURES)",
    "summarized_story": "Available information to Blueprint Sunday night indicates that former Lagos state governor, Ahmed Bola Tinubu, has returned to Nigeria after spending few days in the United Kingdom.\nTinubu who is a presidential hopeful, and National Leader of the All Progressives Congress returned on Sunday afternoon after he reportedly went on consultation abroad ahead of 2023 general elections.\nDetails loading…"
  },
  {
    "headline": "Senegal Win AFCON 2021, Claim First Continental Title",
    "summarized_story": "After two previous final defeats, Senegal are Cup of Nations winners at last, while Egypt missed out on a record-extending eighth continental crown that would also have been a first for Salah.\nSenegal’s celebrations followed a disappointing final, the fifth in the last 11 editions of the tournament to be decided in a shoot-out after a goalless draw.\nMane stepped up, but his kick was too close to the middle of the goal and Abou Gabal was able to save.\nExtra time againAliou Cisse’s Senegal team boast a plethora of stars based at major European clubs while Salah and Arsenal’s Mohamed Elneny are exceptions in an Egyptian side still largely based at home.\nBy then it was clear that Egypt were willing to go to extra time again, sure that they could rely on more heroics from their goalkeeper."
  },
  {
    "headline": "Delta Oil Vessel Explosion: Three Crew Members Alive, One Dead Body Found",
    "summarized_story": "Three crew members from the oil vessel that exploded in Delta State have been found alive.\n“We can confirm that three (3) crew members have been found alive in the community and our priority is to ensure that they receive the appropriate medical attention they need,” the company’s Chief Executive Officer, Ikemefuna Okafor, said.\nRead Also: Oil Vessel With 10 Persons On Board Explodes Off Delta StateHowever, Okafor noted that one dead body was discovered in the vicinity of the FPSO but the identity is yet to be ascertained.\n“As earlier confirmed, the fire burnt out completely as of Thursday afternoon, 3rd Feb. 2022, thus enabling closer inspection of the vessel.\n“The focus of our joint efforts is to prioritise investigations towards establishing the whereabouts, safety, and security of the 7 crew members still missing, clean up and limit damage to the environment, and establish the cause of the explosion."
  },
  {
    "headline": "NIN-SIM Linkage: SERAP Writes Buhari Over ‘Unlawful Access To Subscribers’ Details’",
    "summarized_story": "Socio-Economic Rights and Accountability Project (SERAP) has urged President Muhammadu Buhari to use his good offices and leadership position to urgently review and rescind the reported approval for security agencies to access people’s personal details via NIN-SIM linkage without due process of law.\nThe appeal was contained in a letter dated February 5, 2022, and signed by the SERAP Deputy Director Kolawole Oluwadare.\nSERAP believes that the reported approval to allow security agencies to access people’s personal details via NIN-SIM linkage without due process of law directly interferes with the privacy, dignity and liberty of individuals.\n“According to reports, some security agencies have received your approval to access people’s personal details via the database of the National Identity Management Commission in the course of carrying out their duties.\nThese requirements are included in the Nigerian Constitution and the human rights treaties to which Nigeria is a state party."
  },
  {
    "headline": "Woman Arrested For Allegedly Stabbing Teenager To Death In Ogun",
    "summarized_story": "A woman has been arrested for allegedly stabbing and killing an 18-year-old who is said to be the nephew of her husband.\nThe Police Public Relations Officer, Abimbola Oyeyemi, confirmed this in a statement issued in Abeokuta, the state capital over the weekend.\nOyeyemi said the suspect was arrested following a distress call received by policemen attached to the Agbado divisional headquarters that a boy had been stabbed in the neck by his uncle’s wife, following a misunderstanding over broken glass.\nRead Also: Delta Oil Vessel Explosion: Three Crew Members Alive, One Dead Body Found“It was revealed that a mirror glass being used in the house got broken and the deceased was alleged to have broken it,” the statement partly read.\n“It was the allegation that led to a disagreement between the deceased and his uncle’s wife, subsequent upon which the suspect took a kitchen knife and stabbed the deceased on his neck,”."
  },
  {
    "headline": "PDP Cautions Matawalle Over Impeachment Misadventure",
    "summarized_story": "The Peoples Democratic Party (PDP) has in the strongest terms cautioned the Zamfara State Governor, Bello Matawalle, for allegedly stoking and inducing violence in the state by orchestrating and manipulating the State House of Assembly to commence an illegal and undemocratic process of impeachment against the democratically elected Deputy Governor of Zamfara State, Mahdi Aliyu Mohammed Gusau.\nREAD ALSO: PDP Warns Lawmakers Against Move To Impeach Zamfara Deputy GovernorAccording to Ologunagba’s statement, Matawalle violated the provisions of the Constitution of the Federal Republic of Nigeria 1999 (as amended) in recklessly moving to the APC when there is no division in the PDP.\nHe asked Governor Matawalle to note that the people of Zamfara State are solidly with the deputy governor, who enjoys a large political following in the state as the custodian of the PDP mandate after Matawalle’s infamous defection to the APC.\nIt added that any action against the deputy governor amounts to a direct assault on the will of the people which they will firmly resist.\n“Governor Matawalle must know that the people of Zamfara State cannot allow his personal frustration and ego to be exchanged for their mandate which is now embodied in the Deputy Governor,” the PDP stated."
  },
  {
    "headline": "Nigeria will continue to pursue peace, progress in Africa, World",
    "summarized_story": "Nigeria will continue to pursue peace and progress in Africa and the world at large by consistently seeking for justice, fairness and inclusiveness in global affairs.President Muhammadu Buhari stated this today at the ongoing African Union meetings in Addis Ababa, Ethiopia.\nAdvertisementHe assured the Palestinian leader that Nigeria will be “consistent” in pushing for peace and progress, while upholding the tenets of justice.\nThe Heads of State and Government of the African Union have elected President of the Republic of Senegal, Macky Sall, as the new Chairperson of the African Union for the year 2022.\nAdvertisementThe event took place during the ongoing thirty-Fifth Ordinary Session of the Assembly of the Union, holding at the AU Headquarters in Addis Ababa.\nAdvertisementIn his inaugural speech, President Sall said Africa is beset by a multitude of problems despite its commendable progress over the past few decades."
  },
  {
    "headline": "Proposed NSCDC bill misunderstood, says sponsor",
    "summarized_story": "The sponsor of the bill to absorb the Nigeria Security and Defence Corps, Shina Peller, from Oyo state says the proposed bill was misconstrued and misrepresented to Nigerians.\nAdvertisementHe said: “I shall weigh in and make certain clarifications about the proposed bill.\n“On Tuesday, the 1st of February 2022, the Nigeria Security and Civil Defence Corps (Repeal and Enactment) Bill that I sponsored was read for the first time in the House of Representatives.\nAdvertisement“The bill does not in any way seek to render people jobless rather the bill proposes the transfer of assets and personnel of the NSCDC to the Nigera Police.\nAdvertisementRecall that the bill generated a lot of controversies and also led to the withdrawal of NSCDC officials attached to the lawmaker which were later restored."
  },
  {
    "headline": "Zamfara speaker receives impeachment notice against deputy governor -",
    "summarized_story": "The Zamfara State House of Assembly has Commenced impeachment process against the state Deputy Governor, Mahdi Aliyu GusauRecall that the assembly had in November last year summoned the deputy governor for questioning over alleged gross misconductAdvertisementThe deputy speaker of the Zamfara State House of Assembly who doubles as the Chairman House committee on Public Accounts, Musa Bawa said the committee has concluded it’s investigation on the matterMusa Bawa submitted the notice of Impeachment of the State deputy Governor Mahadi Gusau to the speaker of the HouseAdvertisementReceiving the notice, the speaker of the House Nasiru Magarya commended the Committee for a job well-done and assures the Committee that the document will be treated according to the provisions of the constitution of the federal Republic of Nigeria 1999 as amended.\nThe Zamfara State House of Assembly is accusing the state deputy governor of breach of constitution, abuse of office, financial misconduct among other thingsAdvertisementThe House is expected to study the document after which the content would be made publicA Federal High Court in Abuja had on July 19 last year restrained the Zamfara State House of Assembly from taking steps to impeachment the state Deputy Governor Mahdi Aliyu Gusau.\nAdvertisement"
  },
  {
    "headline": "APC inaugurates 34 State chairmen amid unresolved factional crisis",
    "summarized_story": "The All Progressives Congress has inaugurated elected state chairmen in the 34 states of the country and the federal capital territory, Abuja.\nHowever, Kano and Sokoto states chairmen were not inaugurated.\nAdvertisementThis is coming on the heels of preparation for the national convention which has been fixed for February 26th, even as the party has confirmed the convention date to the Independent National Electoral Commission (INEC).\nMaking the announcement during inauguration, the secretary of the Caretaker Committee, James Akpanudoedehe said he has been directed to hand over their certificate of return to them"
  },
  {
    "headline": "Shehu Sani: Governors Can Do More Than Talking About Insecurity",
    "summarized_story": "Former national lawmaker, Senator Shehu Sani, speaks about what government at state and federal levels can do to secure the lives of Nigerians."
  },
  {
    "headline": "Nigeria: At Amaechi’s Turbaning, Daura Emir Says Emirate Doesn’t Give Chieftaincy Titles for Money",
    "summarized_story": "Speaking while conferring the chieftaincy title of Dan Amanar Daura (the Trusted Son of Daura) on the Minister of Transportation, Mr Chibuike Rotimi Amaechi in the ancient city of Daura, the emir said he had no regret conferring the chieftaincy title on the minister.\n“Nigerians should not insinuate that the emirate is looking for money or has no money.\nI want to announce to all Nigerians and everybody here that this emirate doesn’t give chieftaincy titles because of money or any position.\n“I had never given chieftaincy titles because of money, fear of somebody or position.\nWe give chieftaincy titles based on merit and to help our masses who God will ask us hereafter,” the monarch explained."
  },
  {
    "headline": "Emirates Resumes in Nigeria as Flights Land in Abuja, Lagos",
    "summarized_story": "After a long break due to a frosty relationship between the United Arab Emirates (UAE) and Nigeria, the Emirates Airline on Saturday resumed operations in Nigeria with its Flight EK783 landing at the Murtala Muhammed International Airport (MMIA) in Lagos.\nAnother Flight EK785, arrived in Abuja after departing Dubai at 1100hours, landing at the Federal Capital Territory (FCT) at 03.20 pm.\nEmirates reiterated that all passengers travelling from Nigeria with Dubai as their final destination would require a 48-hour PCR test.\nUpon arrival in Dubai, passengers will undergo an additional Covid-19 PCR test and remain in self-quarantine until the results of the test are received.\n“Passengers travelling from Nigeria and transiting in Dubai are required to follow the rules and requirements of their final destination,” the airline also said."
  },
  {
    "headline": "Oil Prices Head for $100 as Bonny Light Sells for $95",
    "summarized_story": "Oil prices continued their surge on Saturday, sending one of Nigeria’s most valued grades, Bonny Light to $95 and Algeria’s Sahara Blend to $97.48, in an obvious push towards the $100 mark.\nNigeria was unable to meet its oil production allocation by OPEC in January, as it was only able to pump 1.46 million barrels per day of the expected 1.683 million bpd for the month.\nHis promise of a 1.8 million barrels target by December 2021 had earlier faltered.\nThe budget was based on the production of 1.8 million barrels per day, including about 400,000 barrels of condensate that Nigeria produces daily.\n“The commission will commence JIV with relevant stakeholders immediately in line with our regulatory oversight function for upstream operations."
  },
  {
    "headline": "Nigeria will Shake When South Takes Position on 2023 Elections, Says Rivers Governor Wike",
    "summarized_story": "Rivers State Governor, Nyesom Wike, has said the stakeholders in the southern region would soon take a position concerning the 2023 presidential election.Wike spoke on Saturday at a reception organised in his honour by the Kalabari people.“The day the South will speak, Nigeria will shake,” the governor said.“We believe in the unity of this country, but nobody can threaten us.\nThe Zamfara State House of Assembly had on Friday served the deputy governor of notice of impeachment from office, accusing him of corruption and disobedience to constituted authority.\nPDP further stated that Matawalle should note that the people of Zamfara State are solid with his deputy as the custodian of the PDP mandate after Matawalle’s infamous defection to the APC.\n“As such, any action against the deputy governor amounts to a direct assault on the will of the people which they will firmly resist.\n“Governor Matawalle must know that the people of Zamfara State cannot allow his frustration and ego to be exchanged for their mandate which is now embodied in the deputy governor,” the statement added."
  }
]