[
  {
    "headline": "FastCash Supports Nigerians with two million digital loans worth 59bn",
    "summarized_story": "FastCash, the fastest-growing instant loan solution in Nigeria, is proud to announce its two millionth loan disbursement.\nAll the loans disbursed by the platform are worth NGN 59 billion and have helped customers from different walks of life meet urgent financial needs and achieve their short-term objectives.\nEvery FastCash loan closes the access to finance gap in Nigeria and ensures the well-being of a Nigerian household.\nIn addition to FastCash, FCMB also offers a Salary Plus Loan, a consumer credit scheme available to salary account holders.\nExisting customers on Salary Plus can also top up their loans when they require additional financial support."
  },
  {
    "headline": "Lekki toll gate: Lagos clarifies legal status over collection of tolls",
    "summarized_story": "“From the foregoing quote what was struck out was the application (that came up before the Court of Appeal on 09/10/17) and not the appeal.\n“As at date, there is no order striking out Lagos State Government’s appeal against the judgment of the Federal High Court delivered on 27th of March, 2014 in Suit No FHC/L/CS/1405/02.\n“It is also notable that before the Federal High Court, the claimant sought ten (10) Declaratory reliefs and one (1) order of injunction[1], to restrain the Lagos State Government from collecting tolls on the Lekki-Ikoyi Link Bridge.\n“However, in its judgment dated the 27th March 2014, the Federal High Court did not specifically or expressly grant either the Declarations or the injunction sought.\n“Dissatisfied with the lack of clarity and precision in the judgment amongst other grievances the Lagos State Government filed a Notice of Appeal against the judgment on 28th March, 2014."
  },
  {
    "headline": "#EndSARS panel issues arrest warrant on commissioner of police",
    "summarized_story": "ABUJA—The Independent Investigation Panel on Human Rights Violations by the defunct SARS and other units of the Nigeria Police Force has issued a warrant of arrest on the Commissioner of Police in charge of Legal Services at the Force Headquarters, CP Igbeh Ochogwu.\nThe arrest order is in respect of the alleged enforced disappearance and unlawful arrest and detention of one John Emeka Alozie by the Force since June 25, 2017.\nDispleased by the ugly development, chairman of the panel Justice Suleiman Galadima, retd, who issued the arrest warrant on the top police officer, observed that the attitude of Ochogwu was unbecoming of a lawyer and officer of the Police Force.\nJustice Galadima said: “The only option left for the panel is to issue a warrant of arrest on the CP Legal and mandate the National Human Rights Commission to write to the Legal Practitioners Disciplinary Committee to report Ochogwu’s conduct in the matter.\nAccording to her, the police refused to obey the order of the court and that prompted her filing this petition before the panel."
  },
  {
    "headline": "2023: Why I withdrew from presidential race— Orji Kalu",
    "summarized_story": "Hails Clark, Adebanjo, others for standing by S-EastSenate Chief Whip, Senator Orji Uzor Kalu, on Tuesday, pulled out of the presidential primary of the All Progressives Congress, APC, urging the South West and South South to support a South East candidate in 2023.\n“I am even shocked with the number of aspirants coming from the South West and the South South .\nIt is embarrassing that these aspirants (APC and PDP) have no single respect and concern for the South East.\n“If there is anything like “fairness”, “equity” and “justice”, it should be the entire South pushing for a president of South East extraction.\n“The two regions that are yet to produce a President are South East and North East."
  },
  {
    "headline": "AIB releases preliminary reports on four aircraft serious incidents, accident",
    "summarized_story": "By Lawani MikairuNigeria Accident Investigation Bureau, AIB-N, yesterday released four preliminary reports on serious incidents and accident involving aircraft owned and operated by United Nigeria Airlines Limited, Max Air, Air Peace and the Nigerian Police Air Wing.\nAIB General Manager, Public Affairs, Mr Tunji Oketunbi who disclosed the release of the reports said they are the Preliminary report on the Serious Incident involving the United Nigeria Airlines Embraer 145LR aircraft with nationality and registration marks 5N-BWW, which was climbing out of the Nnamdi Azikiwe International Airport, Abuja, Nigeria when a serious incident occurred at about 4,000 feet on 17th November, 2021.\nThe third Preliminary report is on serious incident involving a Boeing 737-300 aircraft owned and operated by Air Peace Limited with nationality and registration marks 5N-BUQ, which occurred after take-off from Sam Mbakwe Airport, Owerri, Nigeria enroute Lagos on 22nd November, 2021.\nThe final preliminary report released is on an accident involving a Bell 429 helicopter owned and operated by Nigeria Police Air Wing with Nationality and Registration marks 5N-MDA, which occurred at the Sir Abubakar Tafawa Balewa Airport, Bauchi, Nigeria on 26th January, 2022.\nThe reports are already on the Bureau’s website (www.aib.gov.ng)."
  },
  {
    "headline": "ASUU strike: Children of poor idling away at home, those of rich schooling – NLC laments",
    "summarized_story": "Workers under the auspices of the Nigeria Labour Congress, NLC, have lamented what it described as gross injustice meted out on the Academic Staff Union of Universities, ASUU, and by extension the underprivileged children belonging to the lower class.\n“As you all know, the children of the poor are at home while those of the rich are going to school.\n“This is most disheartening because people in our generation benefited from free education from primary to tertiary level.\nThis is not acceptable, instead of the politicians discussing these issues as a national emergency they are occupied with the 2023 elections.\nNo worker should sit down and just watch, certainly that will not be our portion."
  },
  {
    "headline": "Court orders service of contempt charge against four SANs over $418m Paris Club refund dispute",
    "summarized_story": "A Federal High Court in Abuja on Wednesday ordered that the contempt charge motion against four Senior Advocates of Nigeria (SANs) involved in the $418 million Paris Club refund suit be served on them through courier services.\nThe order for substituted service issued by Justice Inyang Ekwo followed complaints that the four senior lawyers have allegedly refused to personally receive the charge as required by law.\nThe contempt charge was initiated against them by a private company, Panic Alerts and its sponsor, George Uboh, who accused the lawyers of engaging in professional misconduct.\nThe aggrieved applicants asked the court for an order to serve the contempt charge on the lawyers through a nominated courier company and by pasting the same in their respective offices.\nHowever, Justice Ekwo proceeded with the ex-parte application and granted the requests of the two applicants."
  },
  {
    "headline": "Biafra: Only people like us can decide whether Igbos will leave Nigeria – Okorocha",
    "summarized_story": "Senator Rochas Okorocha, a 2023 presidential candidate has claimed that only people like him can decide if the country would disintegrate to pave way for the actualization of Biafra.\nIn an interview with BBC Pidgin, the lawmaker said members of the Indigenous People of Biafra, IPOB lack the ability to separate Igbos from Nigeria as being agitated.\nHe said, “Only people like us can decide whether Igbos will leave Nigeria.\nThe decision is not for our children to make because what we see while sitting down, they won’t see when they stand.\n“These agitators are our children and what we ought to do is to make them understand what they need to know."
  },
  {
    "headline": "Terrorists abandon canoes loaded with food as troops take charge of Lake Chad",
    "summarized_story": "Following heavy firepower from the Nigerian troops during an operation in the Lake Chad region, the ISWAP elements said to have been in control of the area lately were said to have abandoned their canoes carrying food items for their foot soldiers while fleeing military operations.\nA statement from Colonel Muhammad Dolé, Chief of Military Public Information, FMM HQ, N’Djamena, Chad, on Wednesday revealed that the Sector 1 Amphibious Task Force (Cameroon) intensified river patrols and assaults against TBHs in the general area of Tchol and Chaka.\n“During these operations, upon seeing the advancing patrol teams, some suspected terrorist logisticians fled and abandoned canoes loaded with sacks of food (cereals) and other materials intended for the criminals,” the statement said.\nAccording to the statement, all items were confiscated and destroyed as troops continued to patrol the waterways to block possible escape and supply routes used by the terrorists."
  },
  {
    "headline": "Presidency: Keep off Southeast, you denied being Igbo man – IPOB warns Wike",
    "summarized_story": "The Indigenous People of Biafra, IPOB, on Wednesday warned Governor Nyesom Wike of Rivers State and a Presidential aspirant to steer clear of the Southeast.\nRecalling the killings in Obigbo, Rivers State, IPOB vowed to go all out against anybody who hosts Wike in the Southeast.\nHis visits to any Igbo state is highly provocative because some of the Igbo youths taken into several security cells in the Northern states are yet to return.\n“Those hosting Wike now, where were they when Wike was ordering the killing of Igbo youths at Obigbo?\nWike cannot be going about celebrating in Igbo states which he denied having any links with after ordering the execution of Igbo youths and suspected IPOB members."
  },
  {
    "headline": "JUST IN: Gunmen assassinate Bayelsa factional APC leader",
    "summarized_story": "Suspected assassins have killed Mr Sunday Frank-Oputu, factional leader of the All Progressives Congress (APC) in Bayelsa State.\nFrank-Oputu was a strong supporter of a suit contesting the legality of the recently conducted ward, local government and state congresses of the APC in a Bayelsa High Court.\nFrank-Oputu, an indigene of Igbomotoru community in Southern Ijaw Local Government Area, was reportedly killed in an execution like style around 11:50pm yesat his Bay-Bridge residence, Yenezue-gene, Yenagoa.\nThe deceased vehemently condemned the attack on a High Court where the presiding Judge, Justice Nayai Aganaba, was stoned with plastic bottles by hoodlums.\nFrank-Oputu had vowed to follow up the matter to a logical conclusion before his untimely death."
  },
  {
    "headline": "Ondo lawmaker, others chased out of Owo community",
    "summarized_story": "Majority Leader of the Ondo Assembly, Hon Oluwole Ogunmolasuyi known as West escaped being mobbed when he and his entourage were chased out of Iloro community by some youths over alleged poor performance and imposition.\nSources said the action was carried out when Ogunmolasuyi was meeting with some APC leaders in the community.\nIn a viral video, the youths were heard pouring invectives while in pursuit of the lawmaker and his entourage.\nAn armed policeman, supposedly Hon Ogunmolasuyi orderly and others, were seen running in the video.\n“It was an APC meeting."
  },
  {
    "headline": "BREAKING: Amosun joins 2023 presidential race May 5",
    "summarized_story": "Chairman Senate Committee on Capital MarketSenator Ibikunle Amosun has declared his intention to contest the 2023 presidential race.\nAmosun said he will declare for the race on May 5 at the Musa Yar’Adua Centre in Abuja.\nThis was contained in a letter read by Senate President Ahmad Lawan at plenary.\nAmosun is the third Senator of the APC extraction to join the presidential race.\nSenators Rochas Okorocha and Orji Uzor Kalu had announced their bid for the presidency earlier."
  },
  {
    "headline": "Buhari swears-in four Permanent Secretaries",
    "summarized_story": "President Muhammadu Buhari has sworn in four new Federal Permanent Secretaries, who were recently appointed.\nThe new Permanent Secretaries are: Mrs Beatrice Jeddy-Agba, Kachollom Daju, Malla Shehu Ibrahim and Dr Mary Ogbe.\nThe swearing-in ceremony preceded the weekly Federal Executive Council (FEC) meeting.\nSpeaking their inauguration, Malam Shehu Ibrahim said he will bring his experience to bearas he assumes duty as a permanent Secretary.\nThe President is presiding over a virtual meeting of the Federal Executive Council, which started immediately after the swearing-in ceremony."
  },
  {
    "headline": "41 Nigerians who are Guinness World Records holders",
    "summarized_story": "Making it to the Guinness World Records has never been a mean feat.\nYoung and old Nigerians, like others from across the globe, are proud holders of the Guinness World Records, owing to grit and determination.\nHere are 41 Nigerians who are Guinness World Record holders:1.\nKehinde broke his own world record of 220.5 kg, set at the World Championship in December 2017.\nADEOYE AJIBOLAAdeoye Ajibola (Nigeria) ran the men’s 100 metres in 10.72 seconds at the Paralympic Games in Barcelona, Spain, on 6 September 1992."
  },
  {
    "headline": "Six die, one hospitalised as Lassa Fever hits Gombe",
    "summarized_story": "From Abdulrazaq Mungadi, GombeGombe State has recorded six death, one confirmed and 76 suspected cases of Lassa Fever from a new outbreak that occurred in Dogon Ruwa ward in Kaltungo Local Government Area (LGA) of the state.\nAccording to Officials at the LGA, the outbreak was confirmed at an Almajiri School during the recent Easter holiday.\nThe coordinator explained that it all started when five students of the Almajiri School became ill and were taken to a hospital.\n“The five suspected cases were confirmed dead while their teacher who was catering for them later fell ill after their death on Sunday and it was confirmed to be Lassa Fever and died that same day, that makes the number death six,” Comfort said.\nWhile explaining that an isolation centre has been established to cater for the confirmed and suspected cases in the area the coordinator stated that one confirmed case is currently receiving treatment and that samples of 76 other suspected cases have been sent for confirmation."
  },
  {
    "headline": "NDLEA calls for drug test of politicians seeking elective office",
    "summarized_story": "From Godwin Tsa, AbujaChairman and Chief Executive of the National Drug Law Enforcement Agency (NDLEA) Brig-Gen Mohammed Marwa (retd) has called for drug tests for politicians seeking elective public offices in the country.\nThe NDLEA boss said running for public offices is a big responsibility that should not be left in the hands of those whose heads are filled up because of drugs.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nDo not miss the Vital Information, it goes off in 2 days!\nHe made the call on Wednesday in Abuja while conferring awards and honours to deserving personnel and commands of the agency."
  },
  {
    "headline": "Buhari swears-in four permanent secretaries",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has sworn-in four Permanent Secretaries.\nThe president swore them in before the commencement of the Federal Executive Council (FEC) meeting at the Council Chambers of the Presidential Villa, AbujaThe new Permanent Secretaries Ogbe Mary Ada, (Benue); Shehu Ibrahim (Jigawa); Daju Kachallom Shangti; (Plateau) and Beatrice Jeddy-Agba, Solicitor General of the Federation and Permanent Secretary, Federal Ministry of Justice.\n“I’m very elated and I give glory to God for this wonderful day which I have seen after 30 years of service.\nMeanwhile, the President is presiding over a virtual meeting of the Federal Executive Council, which started immediately after the swearing-in ceremony.\nDouglas was Nigeria’s Minister of Youth, Sports and Culture, Aviation, and Culture and Tourism at various times."
  },
  {
    "headline": "DSS alleges plan to bomb worship centres, public places",
    "summarized_story": "By Christopher OjiThe Department of State Services (DSS) has raised the alarm over planned bomb attacks in parts of the country by criminal elements.\nThe service said the target areas are critical infrastructure and other frequented public places like worship and relaxation centres, especially during and after the holidays.\nThe objective is to achieve some self- serving interests as well as cause fear among the citizenry.\nThe Service, however, recalls its earlier warning that some groups and individuals were plotting to stoke violence in the country.\n“Following these, patrons, owners and managers of aforementioned public places are advised to be wary of this development and implement basic security measures to deter the threats."
  },
  {
    "headline": "The Sun award’ll give me more impetus to work for Nigeria –Gov Bala Mohammed",
    "summarized_story": "Governor of Bauchi State, Bala Moh-ammed, has hailed the professionalism of The Sun, describing awards by the newspaper as always driven by integrity.\nThe Bauchi State governor said though he seldom accepts awards, he was happy to be considered for the honour and dedicated it to God and the people of Bauchi State.\nGovernor Mohammed said: “Far away from your office in Lagos, you came to Bauchi and picked me as Governor of the Year.\nIt is going to give me and my team more impetus to work hard, to prove that we deserve the award we have been given.\nHe said Mohammed’s performance and achievements within the period he has been governor of Bauchi State have been outstanding."
  },
  {
    "headline": "Zenith Sustains Position as Nigeria’s Best Bank for Three Consecutive Years in Global Finance Award",
    "summarized_story": "Nume EkegheZenith Bank Plc has emerged as the Best Bank in Nigeria in the Global Finance Magazine’s Best Banks Awards 2022, retaining the award for a third consecutive year.\nThe bank was among other banks from 36 countries in Africa recognised as the prestigious Global Finance announced its 29th Annual Best Bank Awards Winners.\nThe editors of Global Finance made the selections after extensive consultations with corporate financial executives, bankers and banking consultants, and analysts worldwide.\nGlobal Finance considered factors that ranged from the quantitative objective to the informed subjective in selecting the top banks.\nFounded in 1987, Global Finance regularly selects the top performers among banks and other financial services providers, and the awards have become a trusted standard of excellence for the global financial community."
  },
  {
    "headline": "Osinbajo: I’ve Decided to Run, I Owe No One Else Any Allegiance",
    "summarized_story": "The Alake of Egbaland, Oba Adedotun Gbadebo, while praying for the vice president at his palace, also attested to the fact that Osinbajo was competent to run.\nOsinbao stated, “The vice president position is an opportunity to serve and I have served with utmost loyalty.\nHe said the vice president also stood by him during his governorship battle in 2019.\nYou are serving this country and the president meritoriously for the last seven years as the vice president.\nThe paramount ruler of Remoland, Oba Babatunde Ajayi, in his remarks, said the vice president was competent with requisite qualifications to lead the country."
  },
  {
    "headline": "Pregnant Woman Abducted in Kaduna-bound Train Delivers in Captivity",
    "summarized_story": "Also, the terrorists who attacked and abducted the passengers have released four different pictures of their victims, numbering 62.\nNine persons, including a young medical doctor were killed during the attack, scores were injured and over 62 other passengers kidnapped.\n“We humbly request for your facilitation to ensure that the federal government is in touch with the victims families.\nHowever, the pregnant women among the kidnapped train passengers was quoted by a family source, according to Arise, as having given birth at the weekend.\nWe can also report that the terrorists are demanding the release of their top commanders in exchange for the abducted train passengers."
  },
  {
    "headline": "Elon Musk Reaches Agreement to Acquire Twitter for $44bn",
    "summarized_story": "•Over 40 million Nigerians on microblogging platformWorld’s richest man, billionaire Elon Musk has reached an agreement to acquire Twitter for approximately $44 billion, the company said.\n“Twitter has a purpose and relevance that impacts the entire world,” its CEO Parag Agrawal said in a tweet.\nMusk, a prolific Twitter user, has said it needs to be taken private to grow and become a genuine platform for free speech.\nMusk unveiled his intention to buy Twitter on April 14, and take it private via a financing package comprised of equity and debt.\nMusk did not provide any financing details when he first disclosed his offer for Twitter, making the market skeptical about its prospects."
  },
  {
    "headline": "Afenifere, Others Want Tinubu, Osinbajo, Southwest Aspirants to Withdraw from Presidential Race, Say It’s Turn of S’East",
    "summarized_story": "The call by the prominent socio-political groups reflects the sentiment in the country which increasingly favours the emergence of a president of Igbo extraction.\nAfenifere, PANDEF and Middle Belt Forum insisted the South East should produce the president of Nigeria in 2023 for equity, justice and fairness.\nAfenifere leader, Pa Ayo Adebanjo, while addressing the conference, said there was need for aspirants from the south, especially, the Igbo, to be united.\nAdebanjo said the decisions of presidential aspirants, like Minister of Transportation, Rt.\n“I told Bola (Tinubu) himself, not in the papers, face-to-face, ‘You believe this man (Buhari) will make you president?’ He said yes."
  },
  {
    "headline": "Ogun Governor, Abiodun Confirms He Was Arrested For Fraud In USA, Warns APC Party Not To Disqualify Him For 2023",
    "summarized_story": "Ogun State Governor, Dapo Abiodun, has said his arrest in the United States over credit card fraud and forgery in 1986 is not sufficient grounds for his disqualification by the All Progressives Congress (APC).\nGovernor Dapo AbiodunSofela had warned that the party might lose the governorship seat in Ogun due to Abiodun’s criminal history and its concealment from the Independent National Electoral Commission (INEC) despite swearing an oath.\nThe governor was said to have used a pseudo name (Shawn Michael Davids) with the aim of concealing his criminal identity.\nThe record revealed that Abiodun was jailed for committing criminal offences which bordered on credit card fraud, petty theft and check forgery.\nHe was arrested on November 7, 1986, for fighting and injuring a police officer in an attempt to resist arrest."
  },
  {
    "headline": "Ogun Governor, Abiodun Confirms He Was Arrested For Fraud In USA, Warns APC Party Not To Disqualify Him For 2023",
    "summarized_story": "Ogun State Governor, Dapo Abiodun, has said his arrest in the United States over credit card fraud and forgery in 1986 is not sufficient grounds for his disqualification by the All Progressives Congress (APC).\nGovernor Dapo AbiodunSofela had warned that the party might lose the governorship seat in Ogun due to Abiodun’s criminal history and its concealment from the Independent National Electoral Commission (INEC) despite swearing an oath.\nThe governor was said to have used a pseudo name (Shawn Michael Davids) with the aim of concealing his criminal identity.\nThe record revealed that Abiodun was jailed for committing criminal offences which bordered on credit card fraud, petty theft and check forgery.\nHe was arrested on November 7, 1986, for fighting and injuring a police officer in an attempt to resist arrest."
  },
  {
    "headline": "EXCLUSIVE: Terrorists Ambush Nigerian Army In Buhari’s Home State, Kill Two Soldiers, Injure Many Others",
    "summarized_story": "Two Nigerian Army personnel have been killed by Improvised Explosive Device planted by terrorists in an ambush in Katsina State.\nSaharaReporters learnt that other soldiers also sustained various degrees of injuries while a patrol vehicle conveying the troops was burnt.\nThe deceased were identified as Salami Dare (12NA/68/5958) and Hayatudeen Armayau (18NA/77/0055).\nThe soldiers were said to be on a special operation at Kaiga community when one of their vehicles stepped over the planted IED.\nOwn cas KIA 2, 12NA/68/5958 LCp Salami Dare and 18NA/77/0055 pte Hayatudeen Armayau."
  },
  {
    "headline": "EXCLUSIVE: Terrorists Ambush Nigerian Army In Buhari’s Home State, Kill Two Soldiers, Injure Many Others",
    "summarized_story": "Two Nigerian Army personnel have been killed by Improvised Explosive Device planted by terrorists in an ambush in Katsina State.\nSaharaReporters learnt that other soldiers also sustained various degrees of injuries while a patrol vehicle conveying the troops was burnt.\nThe deceased were identified as Salami Dare (12NA/68/5958) and Hayatudeen Armayau (18NA/77/0055).\nThe soldiers were said to be on a special operation at Kaiga community when one of their vehicles stepped over the planted IED.\nOwn cas KIA 2, 12NA/68/5958 LCp Salami Dare and 18NA/77/0055 pte Hayatudeen Armayau."
  },
  {
    "headline": "EXCLUSIVE: Terrorists Ambush Nigerian Army In Buhari’s Home State, Kill Two Soldiers, Injure Many Others",
    "summarized_story": "Two Nigerian Army personnel have been killed by Improvised Explosive Device planted by terrorists in an ambush in Katsina State.\nSaharaReporters learnt that other soldiers also sustained various degrees of injuries while a patrol vehicle conveying the troops was burnt.\nThe deceased were identified as Salami Dare (12NA/68/5958) and Hayatudeen Armayau (18NA/77/0055).\nThe soldiers were said to be on a special operation at Kaiga community when one of their vehicles stepped over the planted IED.\nOwn cas KIA 2, 12NA/68/5958 LCp Salami Dare and 18NA/77/0055 pte Hayatudeen Armayau."
  },
  {
    "headline": "Okorocha: Buhari is unpredictable… his choice of presidential hopeful may surprise everyone",
    "summarized_story": "Rochas Okorocha, senator representing Imo west, says President Muhammadu Buhari may surprise everyone by his choice of presidential hopeful.\nIn January, Buhari said the name of his preferred presidential candidate would remain a secret.\nSpeaking on Wednesday in an interview with Channels Television, Okorocha, a presidential hopeful of the All Progressives Congress (APC), said the president is “unpredictable”, and that Buhari has not revealed his favourite presidential pick.\n“The President Buhari, I know, will want to check the mood of the nation.\nPresident Buhari in making his decision will be guided by so many issues that he he has to consider.”"
  },
  {
    "headline": "Okorocha: Buhari is unpredictable… his choice of presidential hopeful may surprise everyone",
    "summarized_story": "Rochas Okorocha, senator representing Imo west, says President Muhammadu Buhari may surprise everyone by his choice of presidential hopeful.\nIn January, Buhari said the name of his preferred presidential candidate would remain a secret.\nSpeaking on Wednesday in an interview with Channels Television, Okorocha, a presidential hopeful of the All Progressives Congress (APC), said the president is “unpredictable”, and that Buhari has not revealed his favourite presidential pick.\n“The President Buhari, I know, will want to check the mood of the nation.\nPresident Buhari in making his decision will be guided by so many issues that he he has to consider.”"
  },
  {
    "headline": "AfDB will provide $1.5bn to secure Africa’s food security, says Akinwumi Adesina",
    "summarized_story": "Akinwumi Adesina, president, African Development Bank (AfDB), says the bank will provide a $1.5 billion Africa Emergency Food Plan to secure food security.\nAdesina said major steps have been taken by the bank to avert the food crisis in Africa, in the predicted future.\nHe said $1.5 billion food plan would mitigate the food crisis due to the Russia-Ukraine war, adding that the food plan was awaiting the ratification of the bank’s board.\nAdvertisement“We were not ready for COVID-19, but we are planning to avert food crisis on the continent.\nAdesina said the Russia-Ukraine war would create global problems, particularly for Africa, which imports a huge percentage of its food from the two countries."
  },
  {
    "headline": "AfDB will provide $1.5bn to secure Africa’s food security, says Akinwumi Adesina",
    "summarized_story": "Akinwumi Adesina, president, African Development Bank (AfDB), says the bank will provide a $1.5 billion Africa Emergency Food Plan to secure food security.\nAdesina said major steps have been taken by the bank to avert the food crisis in Africa, in the predicted future.\nHe said $1.5 billion food plan would mitigate the food crisis due to the Russia-Ukraine war, adding that the food plan was awaiting the ratification of the bank’s board.\nAdvertisement“We were not ready for COVID-19, but we are planning to avert food crisis on the continent.\nAdesina said the Russia-Ukraine war would create global problems, particularly for Africa, which imports a huge percentage of its food from the two countries."
  },
  {
    "headline": "CLOSE-UP: Elon Musk, billionaire entrepreneur who acquired Twitter to protect free speech",
    "summarized_story": "Practically everyone knows of Elon Musk — the tech entrepreneur who is the world’s richest person.\nA prolific user of Twitter, Musk’s most recent passion project has been his $44 billion acquisition of the microblogging platform.\nBut he said he’s not buying it to make money but to protect free speech.\nDROPPED OUT OF PHD PROGRAM AT STANFORD UNIVERSITYMusk was 24 years old when he moved to California to pursue a PhD in applied physics and materials science at Stanford University.\nAIMS TO MAKE HUMANS A MULTI-PLANETARY SPECIESWith recyclable rockets created by his company SpaceX, Musk hopes to propel humans into space to build settlements on Mars, the Red Planet."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Twitter accepts Elon Musk’s $44 billion offer to buy the company. Users are bracing for changes",
    "summarized_story": "Twitter has accepted Elon Musk’s offer to purchase the company for roughly $44 billion.\nThe social media platform disclosed in a press release today that Musk purchased the company at $54.20 a share, the same price named in his initial offer on April 14, 2022.\nIn the initial SEC filing, Musk expressed his plan to take the company private.\nParag Agrawal, Twitter’s CEO, appeared to support the move, saying in the press release that “Twitter has a purpose and relevance that impacts the entire world.\nLet’s see how the new owner of Twitter deal with fake accounts, spam bots and authenticating all human beings of this platform."
  },
  {
    "headline": "Making sense of the Web3 buzz through the eyes of an African investor, founder, and designer",
    "summarized_story": "The Web3 buzz is more than just another Twitter trend.\nIn the Web1 era, the Internet was in its most basic form in the Web1 era, with primarily text-based websites that visitors on which visitors could not give feedback.\nIn the Web3 era, African creators can release their works on Facebook, for instance, as an NFT and get even more value.\nFor Chika Uwazie, Founder of decentralised autonomous organisation, Afropolitan DAO, the Web3 era means full access to the financial ecosystem.\nTechpoint Africa Blockchain SummitHowever, Hugbo pointed out that while the Web3 buzz opens up many opportunities through decentralisation, we still need to be cautious."
  },
  {
    "headline": "It’s raining licences; which company is next?",
    "summarized_story": "This is aimed at strengthening financial inclusion by expanding financial services to the unbanked and underbanked across the country.\nEthiopia’s plan to allow foreign mobile money servicesIt’s raining licences today, albeit a different type.\nThe Central Bank of Ethiopia (CBE) proposed a bill to allow foreign investors to provide mobile money services in Ethiopia.\nDon’t forget: A consortium led by Safaricom obtained the first private mobile telecommunications licence but lacks a permit for mobile financial services like M-Pesa.\nSince then, 95 companies have participated as of the Winter 2022 launch, about half of which are financial services providers, and 51 are from Nigeria."
  },
  {
    "headline": "How a search for infinite learning led Justin Irabor to the world of computer science",
    "summarized_story": "Full-stack engineer, TradeCoreHowever, despite the challenges and doubts about new ventures, he finds that he is fulfilled at the end of the day.\nFull-stack engineer, TradeCoreSoftware engineering called out to him when he was editor-in-chief at a startup, and every downtime had to be escalated to the technical team.\nI’m a full-stack engineer there.\nFull-stack engineer, TradeCoreAlthough Justin was sure about transitioning into software engineering, he didn’t escape the frustration that came with the move.\nBut Justin says his choice of Mogwai is to remind him to always take responsibility if he wants the best results."
  },
  {
    "headline": "EMURGO Africa and Adaverse to Host Blockchain Founders Hangout in Lagos, Nigeria",
    "summarized_story": "This article is a Brand Press post.\nBrand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nRead on to learn more about EMURGO Africa and Adaverse.\nRead more about EMURGO Africa.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Volition Cap Hosts Maiden Edition of Africa Founders Immersion Event in Dubai",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:A cohort of leading tech founders and venture capitalists in Africa have concluded a 2-day immersion event in Dubai.\nAfrica Founders Immersion Dubai event also provided a platform for African Founders to interact with the funding and investment community in the city.\nThe DET portfolio includes Dubai Corporation for Tourism and Commerce Marketing, Dubai Festivals and Retail Establishment, Dubai Industries and Exports, Dubai Investment Development Agency (Dubai FDI) and Dubai SME, as well as Dubai College of Tourism, Dubai Calendar and Dubai Business Events.\nFor more information and partnership inquiries: Website: https://volitioncap.com/Email: ask@volitioncap.comPhone number: +234 0705 651 1542Brand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "eNaira adoption: The journey after seven months",
    "summarized_story": "Joseph Raji successfully registered and created his eNaira wallet late last year but several attempts to use the digital currency have proved abortive.\nHe is yet to do any transaction because the naira in his bank account is not converting to the eNaira wallet.\n“The eNaira never arrived in my working eNaira speed wallet.”eNaira, Nigeria’s central bank digital currency (CBDC), has not lived up to the expectations of many users like Raji, almost seven months after it was launched, BusinessDay has learnt.\nShe said to receive money to the eNaira wallet, users use the individual barcode or merchant code.\nMany digital currency professionals who could have worked with the CBN to deepen the adoption of the eNaira felt alienated."
  },
  {
    "headline": "eNaira adoption: The journey after seven months",
    "summarized_story": "Joseph Raji successfully registered and created his eNaira wallet late last year but several attempts to use the digital currency have proved abortive.\nHe is yet to do any transaction because the naira in his bank account is not converting to the eNaira wallet.\n“The eNaira never arrived in my working eNaira speed wallet.”eNaira, Nigeria’s central bank digital currency (CBDC), has not lived up to the expectations of many users like Raji, almost seven months after it was launched, BusinessDay has learnt.\nShe said to receive money to the eNaira wallet, users use the individual barcode or merchant code.\nMany digital currency professionals who could have worked with the CBN to deepen the adoption of the eNaira felt alienated."
  },
  {
    "headline": "Why CBN is pushing for eNaira",
    "summarized_story": "In contrast, the eNaira is one that can be controlled by the federal government,” Rume Ophi, a crypto trainer, said.\nTo clear these challenges, there are certain infrastructures needed to be adopted by the CBN to make the eNaira interoperable.\nBoth the government and the CBN are optimistic about the eNaira because of the economic impact they believe it could have on Nigeria.\nGodwin Emefiele, the CBN governor, said the eNaira would help reduce Nigeria’s heavy reliance on imports.\nUwakwe recommends that the infrastructure used to build the eNaira must be upgraded to drive adoption."
  },
  {
    "headline": "Edo residents hail Obaseki for free medical outreach – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – Edo residents who are beneficiaries of the ongoing free medical outreach by the state government have commended Governor Godwin Obaseki for prioritizing the health and welfare of the people.\nThe five-day medical mission for over 4, 000 residents, is being organized in collaboration with the Association of Nigeria Physicians in the Americas (ANPA).\nThe outreach programme includes surgical interventions and treatments for heart, kidney, eye and other ailments.\nShe further stated, “I was examined and given medicated eyeglasses and some medications.”Irene applauded the state government for the access to effective and quality medical care.\nAnother beneficiary, Mr. Kasimi Godswork, who narrated his experience at the free medical outreach, noted, “My experience here today is wonderful and encouraging."
  },
  {
    "headline": "Police storm Edo forests to dislodge kidnappers, killer herdsmen – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- The Edo State Police Command has changed its crime bursting-strategies as it has taken the ongoing renewed battle against criminals to the forests in order to dislodge major kidnappers and killer herders’ den in the state.\nChecks further revealed that the new order was in full compliance with the directive of the Commissioner of police, CP Abutu Yaro, deployed to Edo State few weeks ago.\nA drive round Benin City and some others in the state revealed that the police command has also increased police visibility and patrols for swift response to any untoward occurrence.\nA source at Odighi community in Ovia North East local government area of Edo State stated that police presence has pushed killer herdsmen away from their forest as inhabitants now go to their farms without fear of being attacked or killed by suspected herdsmen or kidnappers.\nInvestigation further revealed that the security arrangements at the divisional police headquarters have also been modified to ensure watertight security as the CP Abutu has zero-tolerance for lapses."
  },
  {
    "headline": "2023 Election: I can only contest if I am endorsed by the President-Jonathan – Nigerian Observer",
    "summarized_story": "The NIGERIAN OBSERVER gathered that Jonathan had informed some APC leaders that he would only join the presidential race if he was directly endorsed by the President, Major General Muhammadu Buhari (retd.).\nThe party chieftain stated, “I can tell you they are facing a tough task as far as Jonathan is concerned.\n“Another tough task the party may face is how it will convince other aspirants like Tinubu, Osinbajo, Amaechi, Umahi and Bello to step down.\nAnd for him to contest, he must have spent a year in the party and our primary will hold in the one month’s time.\nUntil he now proves to the whole world that he is a card-carrying member of the APC, it can’t be."
  },
  {
    "headline": "Falana condemns APC N100m nomination forms, As Party begins sale of forms – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestHuman rights Lawyer, Femi Falana, SAN, Sunday, condemned the APC for fixing the fees of its presidential nomination and expression of interest forms at N100m.\nHe, therefore, suggested that the APC and PDP should remove the “outrageous fees” and charge administrative fees of not more than N10,000 per aspirant.\nIn a statement he signed titled, ‘Illegality of outrageous nomination fees,’ he noted that the apparent endorsement of the controversial nomination fees by Buhari reeks of hypocrisy because, in 2014, he had told Nigerians that he had to borrow N27.5m to purchase his nomination form.\n“In this circumstance, political parties may only be permitted by law to charge administrative fees,” he said.\nConsequently, nomination forms for aspirants vying for the House of Assembly would be sold at the various state secretariats of the party nationwide while forms for other positions such as the House of Representatives, Senate, governorship and Presidency would be sold at the national secretariat, Abuja."
  },
  {
    "headline": "NDLEA writes APC, wants to test aspirants for drugs before primaries",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has written to the Chairman of the All Progressive Congress (APC), Abdullahi Adamu, requesting that officials of the agency be given access to conduct drugs integrity tests for politicians seeking political offices in the country.\nBuba Marwa, chairman and chief executive of the NDLEA who who wrote the letter said when it is the turn of PDP and other parties, to conduct its party primaries, he would also write their national chairmen to request that operatives of NDLEA be allowed to conduct drugs integrity tests on politicians aspiring for higher offices.\nThe NDLEA boss disclosed the development while speaking during the 1st quarter award ceremony of the agency in Abuja.\nHe explained that the drugs test is necessary to ensure that politicians vested with important national offices o not used budgetary allocations to go and buy cocaine or Methamphetamine instead of providing needed services for the masses."
  },
  {
    "headline": "Nigeria’s foreign exchange inflows fall by $9.58bn",
    "summarized_story": "Foreign exchange inflows into Nigeria’s economy declined in the fourth quarter of 2021, owing to lower receipts from the Central Bank of Nigeria and autonomous sources.\nThis is according to the latest figures from the Central Bank of Nigeria’s quarterly report on “Foreign Exchange Flows through the Economy.\n“Foreign exchange inflow into the economy fell by 31.7 per cent to $20.62bn, from $30.2bn in the preceding period.\nForeign exchange outflow through the economy rose by 19.4 per cent to $12.21bn, relative to the level in the preceding quarter, majorly on account of increased foreign exchange intervention and utilisation for visible imports.\nHowever, autonomous outflow decreased by 27.2 per cent to $1.63bn, due to lower utilisation of foreign exchange for invisible imports."
  },
  {
    "headline": "Reps allege documents falsification in N2.6trn MTN tax evasion scandal",
    "summarized_story": "The house of representatives committee on public accounts says it would unravel the mystery behind an alleged N2.6 trillion capital allowances granted to MTN by the Federal Ministry of Trade and Industry.\nWhile responding, MTN’s general manager, Mrs. Yemisi Adebayo explained that the Company has submitted all relevant documents issued by Federal Ministry of Trade and Industry reflecting the value of N2.6 trillion given to MTN.\nShe said in 2017 a log book was brought back reading Abuja switch with Mr. Ike and three others as inspection team members.\nTo this end, the committee resolved that all the officials involved in the inspection from Federal Ministry of Trade and Industry should be made to appear before it.\nThe committee equally requested for the tax records covering the periods under review from both MTN and FIRS for further legislative scrutiny."
  },
  {
    "headline": "Q1 2022: UBA grows profit by 8.76% to N42 billion",
    "summarized_story": "Africa’s global bank, the United Bank for Africa (UBA) Plc has reported N41.50 billion profit for the first quarter of 2022, ended March 31, representing 8.76% growth from the corresponding quarter of 2021.\nFurther look at the report show that in Q1 2022, bet interest income grew by 14.10% from N74.38 billion to N84.87 billion in the current period.\nThe bank earned N125.08 billion from its lending business as interest income grew by 15.18% from N108.59 billion for the period.\nUBA made income from the disposal of property, dividends, rental, and cash handling, which raked in a total of N1.76 billion.\nTrade transactions income for the Q1 2022 period grew by 109.19% from N7.42 billion in the corresponding period of 2021 to N3.55 billion."
  },
  {
    "headline": "NDLEA Marks Abba Kyari’s Houses, Others In Maiduguri",
    "summarized_story": "The chairman of the National Drug Law Enforcement Agency, (NDLEA), Mohammed Buba Marwa, has confirmed the marking of properties belonging to the embattled suspended DCP Abba Kyari in Maiduguri, Borno State, saying that all proceeds of crimes must be retrieved and taken over by the government.\nReacting to the report of the marking of six houses and a plaza belonging to Kyari, the NDLEA chairman said without making reference to any particular individual, there is a law in Nigeria to recover and seize all properties of individuals indicted in crime.\nRecall that Kyari was arrested by the anti-narcotics agency after attempting to bribe an official of the agency to secure the release of seized cocaine earlier this year.\nHowever, the agency marked the properties situated in Maiduguri for investigation.\nThe two-storey shopping plaza, Assurance Plaza, located along the Giwa Barracks Road, has about 100 shops."
  },
  {
    "headline": "Ramadan Iftar And The Bond Of Friendship: Governor Inuwa Yahaya’s Example",
    "summarized_story": "Asides from the spirituality attached to the Holy month of Ramadan, some other good virtues like the Ramadan Iftar (Breaking of Fast) equally abound among the Ummah.\nFurthermore, as a leader of a State, Governor Muhammadu Inuwa Yahaya equally used the Ramadan Iftar to give account of his stewardship in the last 3 years.\nThe groups and Associations took turns to eulogise the incredible performance of Governor Inuwa Yahaya in the last 3 years.\nThe groups did not however shy away from reaffirming their support for Governor Muhammadu Inuwa Yahaya which they unanimously say deserve a second term.\nHis thoughts and prayers at every session of the Ramadan Iftar depict a classical leader with the insatiable desire for the well being of his people."
  },
  {
    "headline": "‘Illegal Logging Threatening Food Security In Niger Delta’ – Leadership News",
    "summarized_story": "Head of Environmental Rights Action (ERA), Bayelsa State Office, Comrade Alagoa Morris, has expressed concern over the indiscriminate and illegal logging in the Niger Delta region, declaring that illegal logging is a huge threat to the ecosystem which is capable of destabilising the food chain in the region.\nMorris made this known in a statement issued in Yenagoa after the sensitisation campaign on the importance of tree planting organised by Woso Woso Friends of Okpoama, in Brass local government area of Bayelsa State.\nThe commissioner said the state government had initiated policies and programmes to tackle illegal logging, stating that the impact will be felt in the near future.\nADVERTISEMENTHe described the Woso Woso Friends as change makers in this era of climate change as world leaders struggle to reverse its impact.\nSpeaking to reporters at the end of the event, the president of Woso Woso Friends, Mr Lucky Sam Igbeta said the initiative was borne out of the desire to to promote environmental sustainability."
  },
  {
    "headline": "‘Illegal Logging Threatening Food Security In Niger Delta’ – Leadership News",
    "summarized_story": "Head of Environmental Rights Action (ERA), Bayelsa State Office, Comrade Alagoa Morris, has expressed concern over the indiscriminate and illegal logging in the Niger Delta region, declaring that illegal logging is a huge threat to the ecosystem which is capable of destabilising the food chain in the region.\nMorris made this known in a statement issued in Yenagoa after the sensitisation campaign on the importance of tree planting organised by Woso Woso Friends of Okpoama, in Brass local government area of Bayelsa State.\nThe commissioner said the state government had initiated policies and programmes to tackle illegal logging, stating that the impact will be felt in the near future.\nADVERTISEMENTHe described the Woso Woso Friends as change makers in this era of climate change as world leaders struggle to reverse its impact.\nSpeaking to reporters at the end of the event, the president of Woso Woso Friends, Mr Lucky Sam Igbeta said the initiative was borne out of the desire to to promote environmental sustainability."
  },
  {
    "headline": "2023: I Will Transform Nigeria If Elected President – Udom – Leadership News",
    "summarized_story": "Presidential aspirant on the platform of opposition Peoples Democratic Party (PDP) and Akwa Ibom State governor, Udom Emmanuel, has promised to turnaround the country’s fortune if elected president in 2023.\n2023 will define whether Nigeria will go forward or remain stagnated in one place,” he said.\nHe lamented that Nigeria is among countries in the world where people will struggle and graduate from tertiary institutions only to become gatemen due to the bad leadership of the country.\nWe are on 85 percent completion of one of the biggest hangers in Nigeria.\nMost of what we do is through creativity and not just because we have the money,” he said."
  },
  {
    "headline": "BREAKING: NDLEA writes APC, seeks drugs integrity test for Politicians before Primaries",
    "summarized_story": "The Chairman and Chief Executive of the National Drug Law Enforcement Agency, Brig Gen Buba Marwa (rtd) has written a letter to the Chairman of the All Progressive Congress APC, Sen Abdullahi Adamu, requesting that officials of the NDLEA be given access to conduct drugs integrity tests for politicians seeking political offices in the country.\nMarwa said that when it is the turn of PDP and other parties, to conduct its party primaries, he would also write the national chairman and request that operatives of NDLEA be allowed to conduct drugs integrity tests on politicians aspiring for higher offices.\nThe NDLEA boss who was speaking during the 1st quarter award ceremony of the agency in Abuja explained that the drugs test is necessary to ensure that politicians vested with important national offices o not used budgetary allocations to go and buy cocaine or Methamphetamine instead of providing needed services for the masses.’"
  },
  {
    "headline": "JUST IN: Senate Deputy Minority Leader decamps to APC",
    "summarized_story": "Deputy Minority Whip of the Senate, Ibrahim Danbaba, has decamped from the opposition Peoples’ Democratic Party, PDP, to the ruling All Progressives Congress, APC.\nThe lawmaker’s decision to join to the APC was conveyed in a letter read at the start of plenary by the Senate President, Ahmad Lawan, on Wednesday.\nMr Danbaba’s defection brings the total number of APC Senators in the upper chamber to 71, and PDP 37.\nMs Ekwunife, while relying on the provisions of Section 68(g) of the 1999 Constitution (as amended), requested that Mr Danbaba’s seat be declared vacant.\nThe Senate President, however, ruled her out of order, explaining that the reasons advanced by Mr Danbaba were valid and excusable under the law."
  },
  {
    "headline": "First Bank Queried By House of Reps",
    "summarized_story": "First Bank has been questioned by the House of Representatives over N94.345 billion in money collected on behalf of the Nigeria Customs Service (NCS).\nThe House also questioned First Bank management on allegations of a N28.3 million breach of agreement on Cash on Transfer (CoT) charges.\nAccording to Oke, the Bank was asked to respond to an oAuGF audit question about the NCS being overcharged by banks in the area of CoT.\nHe claimed that presentations by representatives of various institutions, notably First Bank, were found to be in conflict with the NCS agreement.\nThe First Bank Executive Director, Mr. Shehu Aliyu, stated that the bank should collect 30k every N1,000 as mentioned in the Memorandum of Understanding (MoU) signed by both sides."
  },
  {
    "headline": "How APC Stakeholders Sold Jonathan To Buhari",
    "summarized_story": "Last night, there were hints as to how some APC senior brass sold President Buhari on the idea of a Goodluck Jonathan candidacy.\nAccording to multiple sources, stakeholders, including governors, met Jonathan and sold him on the notion of Jonathan serving one term before handing the presidency over to his would-be Vice President.\nAccording to reliable sources, the stakeholders may have agreed on a running mate from the North-East as part of the Jonathan arrangement.\nMultiple sources told Vanguard that both President Buhari and Jonathan have agreed on the deal.\nFrom what I know and the meeting I attended, they sold the idea to Buhari."
  },
  {
    "headline": "[Breaking] 2023: APC presidential aspirants swell as Ibikunle Amosun joins race as Danbaba dumps PDP",
    "summarized_story": "Ranks of Presidential aspirants within the fold of the ruling All Progressives Congress (APC), swell up with declaration of Senator Ibikunle Amosun on the floor of the Senate Wednesday.\nHe said a formal declaration to that effect , will take place at the Shehu Musa Yar’Adua Centre in Abuja on the 5th of May 2022.\nDeclaration of Amosun for Presidential position in 2023 , makes the total number of aspirants in APC to be 17 now.\nEarlier before Amosun’s declaration , the deputy minority whip of the Senate , Senator Ibrahim Abdullahi Danbaba (Sokoto South ), defected from PDP to APC on alleged crisis rocking the party in North West Senatorial Zone .\nDetails loading…Share this: TwitterFacebook"
  },
  {
    "headline": "WAEC begins massive recruitment *See details, application link",
    "summarized_story": "The West African Examinations Council (WAEC) has announced recruitment into its various vacant positionsThe examination board made this known in a statement via it’s official Twitter handle.\nWAEC advised all interested applicants to visit https://recruitment.waec.com.ng, adding that application closes June 7th, 2022.\nAccording to the statement, “The West African Examinations Council is calling on applicants to fill in vacant positions in its Nigeria National Office and WAEC International Office, Lagos, Nigeria.\n“Interested applicants are to complete the application process online by logging in to the link https://recruitment.waec.com.ng .\n“Application closes on Tuesday, 7th June, 2022.”Share this: TwitterFacebook"
  },
  {
    "headline": "Eid-el-Fitr: DSS uncovers plot to bomb worship, relaxation centres",
    "summarized_story": "The Department of State Services (DSS) has raised the alarm over alleged plot by some criminal elements to bomb worship and recreational centres as well as return the country to pre-2015 general elections during and after Eid-el-Fitr.\n“The objective is to achieve some self- serving interests as well as cause fear among the citizenry.\nThe bandits also shot to death a farmer simply called Tanko in Kuchi village and injured another person, while they made away with eight motorcycles and several cattle after attacking various communities in Kagarko local government area of Kaduna state.\n“One other person by name Tanko was killed in another village called Kuchi and another person sustained injury and in critical condition in the hospital.\n“We also call on all Nigerian governors to also replicate same in their respective states because the unemployed/unengaged youth is a ready tool for all vices and crime.”Share this: TwitterFacebook"
  },
  {
    "headline": "Nigeria’s Petroleum Ministry announce dates for NIES 2023",
    "summarized_story": "By Onu OkorieNigeria’s Federal Ministry of Petroleum Resources has unveiled plans for the 6th edition of the Nigeria International Energy Summit (NIES 2023).\nThe official Oil and Gas meeting of the Federal Republic will take place in Abuja from April 16th to 20th, 2023.\nIn an online media broadcast, Chief Timipre Sylva, Honourable Minister of State for Petroleum Resources, said “NIES 2023 is primed to be a show stopper as it will be the valedictory edition of this administration”.\n“N.I.E.S has grown from year to year and remains the definitive platform, not just for Nigeria, but also for Africa to engage the global energy community”, Shindi said.\nN.I.E.S is a federal government of Nigeria official energy industry event with the Federal Ministry of Petroleum Resources and all its parastatals including the Nigerian National Petroleum Corporation (NNPC), Nigerian Content Development and Monitoring Board (NCDMB), Nigerian Upstream Petroleum Regulatory Commission (NURPC), Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA), Petroleum Technology Development Fund (PTDF) and Petroleum Training Institute (PTI) are joint hosts."
  },
  {
    "headline": "9mobile announces self-service unbarring portal for barred lines",
    "summarized_story": "By Kehinde Ibrahim, Lagos9mobile has announced an easy self-service unbarring portal for customers to connect their NIN and unbar their lines online.\nThe NIN-Web Linking service is a simple, self-service portal that saves customers the hassles of queuing endlessly to link their NIN.\nOmoike explained that the initiative, the first by any Nigerian operator, would enable customers to unbar their lines without stress from the comfort of their homes or offices.\n“We are a caring network and are always on the lookout to make the lives of our customers easier and better.\nWe realized the frustrations of people trying to unbar their lines and came up with the unique initiative that will enable them to regain the use of their lines as quickly as possible,” he further said."
  },
  {
    "headline": "Cable Equiano: Pantami, Danbatta pledge enabling policy environment for wider connectivity",
    "summarized_story": "The duo stated this on the sideline of the reception marking the landing of the Equiano undersea Cable System in Nigeria at the Open Access Data Centre at Lekki in Lagos.\nPantami and Danbatta commended Google LLC, the West Indian Ocean Cable Company, WIOCC, and other investors for bringing additional bandwidth capacity into the country to drive connectivity and growth.\nPantami also promised an enabling environment that encourages foreign and local investment in infrastructure project such as the way Google and its co-investors have done.\nDanbatta expressed delight that Equiano has joined the list of other submarine cables at the shores of Nigeria, including SAT3 cable, MainOne cable, Glo1 cable as well as the African Coast to Europe (ACE) submarine cable by Dolphin and West African Cable System (WACS) by MTN.\nThe Chief Executive Officer (CEO) of WIOCC, Chris Wood, also described the landing of the submarine cables as a major investment in the Nigerian digital economy."
  },
  {
    "headline": "Over $10bn food production at risk in Nigeria, others –AfDB",
    "summarized_story": "By Mathew Dadiya, AbujaThe African Development Bank Group President, Dr Akinwumi Adesina, says a fertiliser crisis triggered by the Russian war in Ukraine could put more than $10bn worth of food production at risk in Africa.\nAfrica will lose $11 billion worth of food, and coming shortly after COVID-19, that would be rather serious,” the AfDB President disclosed.\n“We were not ready for COVID-19, but we are now planning to avert food crisis on the continent.\nDr Adesina submitted: “Mr.\nWe are behind you strongly, and we want to ensure Nigeria won’t feel the impact of the food crisis.”"
  },
  {
    "headline": "Reps summon officials of Ministry of Trade over alleged N2.6trn tax evasion",
    "summarized_story": "By Aaron OssaiHouse of Representatives Committee on Public Accounts, PAC yesterday summoned officials of the Ministry of Trade and Industry over alleged tax evasion by one of the telecommunication companies in Nigeria, MTN to the tune of N2.6 trillion.\nSpeaking at the resumed investigative hearing into the Audit queries on tax evasion issued by the office of the Auditor General for the Federation (oAuGF), Hon.\nOke disclosed that the oAuGF report indicated that the documents relating to the N2.6 trillion capital allowances were allegedly forged.\nWhile stressing that the Committee invited MTN over tax evasion, Hon.\nHe maintained that Nigerians have rights to know the implications of MTN taking a certificate of N2.6 trillion to FIRS for tax waivers on the economy."
  },
  {
    "headline": "Kaduna Train Attack: Relatives Call For Help As Bandits Release Photos Of Abducted Victims",
    "summarized_story": "Family members of victims of the Abuja-Kaduna train attack have continued to cry out for help as abductors yet again, released photos of the remaining victims.\nIn the photographs released on Tuesday, 62 victims were seen in four groups, including children, aged women and men.\nThe Chairman of the group of Concerned Relatives of Abducted Persons, Dr Abdulfatai Jimoh, confirmed to Channels Television that those captured in the photos are the kidnap victims.\nIt was reported after the attack that 68 captives were with the bandits, including 41 women, 22 men and five children.\nGunmen had attacked the Abuja-Kaduna bound train on March 28 with Improvised Explosive Devices."
  },
  {
    "headline": "Russia Cuts Gas Supplies To Poland, Bulgaria Over Ukraine",
    "summarized_story": "Russia halted gas supplies to Poland and Bulgaria on Wednesday, after blasts in a breakaway region of neighbouring Moldova led Kyiv to accuse Moscow of seeking to expand the Ukraine war further into Europe.\nREAD ALSO: Nearly 5.3 Million Flee Ukraine War As Refugees – UN﻿“Russia wants to destabilise the Transnistrian region,” Mykhaylo Podolyak, a Ukraine presidential aide, wrote on Twitter.\n“If Ukraine falls, tomorrow Russian troops will be at Chisinau’s gates,” he said, referring to Moldova’s capital.\nThe United States echoed similar concerns — though stopped short of backing Kyiv’s contention that Russia was responsible.\nRussia said it had carried out high-precision missile strikes against 32 Ukrainian military targets including four ammunition depots on Tuesday."
  },
  {
    "headline": "2023: I Won’t Use Two Years Trying To Decide What To Do, Says Osinbajo",
    "summarized_story": "﻿Vice President Yemi Osinbajo has promised to heat the ground running if elected as the country’s president in the 2023 poll.\nOsinbajo made the remark while addressing his supporters in Ogun State on Tuesday, explaining that he is prepared for the challenge of leading the country.\nI then had the opportunity to serve as acting president on several occasions,” the vice president said.\nThe truth of the matter is that everywhere where I have served, I’ve served with utmost loyalty, and commitment.\nThere is nowhere that those I served will not say I put in everything to make sure they succeed.”"
  },
  {
    "headline": "Buhari Receives Adesina In Abuja, Harps On Food Security",
    "summarized_story": "﻿President Muhammadu Buhari on Tuesday received the President of the African Development Bank, Dr Akinwumi Adesina at the State House in Abuja.\nTheir talks centred on food security for Nigeria.\nPresident Buhari applauded the $1.5 billion African Emergency Food plan developed by the AfDB, which is awaiting ratification by its board.\nIn a chat with State House correspondents, Governor Ayade revealed his presidential aspiration.\nShould he become President in 2023, the Governor hinges his focus on the tripartite areas of security, economy and power."
  },
  {
    "headline": "Police Shut Down Mammy Markets After Attack On Yobe Communities",
    "summarized_story": "The Yobe State Police Command has directed the shut down of all mammy markets across the state following the attack on local drinking joints in the Geidam and Gashua communities.\nThe police spokesperson, Assistant Superintendent of Police, Dungus Abdulkarim, in an exclusive interview with Channels Television revealed that other private drinking joints in the state would also be shut down till proper security measures are put in place.\nHe asked residents to be vigilant and report any suspicious movements to the security personnel, especially during the forthcoming Sallah festivities and Workers’ Day.\nAccording to him, the measure is a temporary one aimed to forestall further attacks on soft targets.\nThe town shares a border with the Niger Republic and Damasak, which is believed to be one of the strongholds of the terrorists in Borno state."
  },
  {
    "headline": "Zone presidential ticket to South East, see miracle, Kalu tells APC, PDP -",
    "summarized_story": "I added that I will run for president if the party zones the ticket to the South East.\nUnless for mischievous and selfish reasons against the South East, no one can comfortably deny these facts.\n“It is a false claim and an old propaganda that the South East is not united in this contest.\nIn this pursuit for presidency, there is nothing the South East is doing that is different from what others are doing.\nLet the two major political parties zone their tickets to the South East and see the miracle that will happen to Nigeria."
  },
  {
    "headline": "Manifesto unveiling: Oyebanji expresses appreciation to APC leaders, Ekiti people -",
    "summarized_story": "Oyebanji, in a statement on Wednesday, expressed his appreciation to God Almighty for the success of the event.\nWhile calling on APC members and his supporters to step up their mobilisation efforts ahead of the June 18 election, Oyebanji reiterated his promise to stand firm and follow to the letter all the developmental plans listed in his manifesto.\nHe also reassured Ekiti people that the APC campaign would be issued-based and devoid of any form of violence.\nThe demonstrated love and support for me, my deputy governorship candidate and the APC has further rekindled my conviction that Ekiti people are truly progressive minded and still prefer our party, APC, to other political parties.\nEkiti has shown us love and I want them to continue giving us the support to enable us win the June 18 election,” he stated."
  },
  {
    "headline": "2023 Presidency: Gov Yahaya Bello pays N100m APC nomination fee, to pick forms Wednesday -",
    "summarized_story": "One of the leading presidential aspirant on the ruling All Progressives Congress, Governor Yahaya Bello of Kogi State, will tomorrow, Wednesday, April 27, 2022, pick his expression of interest and nomination forms.\n“With the payment for the forms, Governor Bello’s teeming supporters should rest assured that he will be on the ballot in the 2023 presidential race.\nHe is always very loyal to his own and his priorities have always been Nigeria, Nigeria and Nigeria.\n“Though the race officially begins now, it is on record that Governor Bello has consistently been at the forefront of the contest.\nWith Senator Jonathan Zwingina as the Chairman of the Hope ’23 Yahaya Bello Presidential Campaign Organisation, and Hafsat Abiola-Costello as the Director-General, the tone is set for Hope to be actualized for Nigerians in 2023, the campaign organization said."
  },
  {
    "headline": "I will not give money to delegates",
    "summarized_story": "Former governor of Anambra State, Peter Obi has advised the People’s Democratic Party’s (PDP’s) delegates to collect the money offered by aspirants, but should think about their children’s future when voting for their preferred candidate.\nObi, a presidential aspirant in the PDP, who said he was on a mission to stop monetisation of the political process, noted that he would not give money to delegates.\nHe spoke in Akure when he addressed Ondo State delegates as part of his nationwide tour to woo delegates ahead of the primary election.\nHe said: “Collect the money, but when you go to vote, think about the future of your children.\nYou are delegates today, you cannot be delegates forever."
  },
  {
    "headline": "Victor Umeh: The Presidency Must Come to The South to keep Nigeria Together",
    "summarized_story": "Former National Chairman of the All Progressives Grand Alliance, Senator Victor Umeh, speaks to ARISE about the call for an Igbo presidency.\nIn light of the zoning controversies several parties have experienced so far in the shadow of 2023 elections, Senator Umeh shares his thoughts on why the presidency should be zoned to the South East, in order to maintain and equal and fair electoral process."
  },
  {
    "headline": "‘My Candidacy Arouses Many People’s Interests in The Political Space’- Khadijah Okunnu-Lamidi",
    "summarized_story": "Now a member of the Social Democratic Party, presidential apsirant Khadijah Okunnu-Lamidi joins ARISE News to speak about her presidential bid.\nRelatedStories No Content AvailableShe shares details of her presidential campaign and its operations, including why she has chosen to join forces with the SDP party in recent times."
  },
  {
    "headline": "Major Japan Railway Now Powered Only by Renewable Energy",
    "summarized_story": "Nicholas Little, director of railway education at Michigan State University’s Center for Railway Research and Education, commends Tokyu for promoting renewable energy but stressed the importance of boosting the bottom-line amount of that renewable energy.\n“I would stress the bigger impacts come from increasing electricity generation from renewable sources,” he said.\nOnly about 20% of Japan’s electricity comes from renewable sources, according to the Institute for Sustainable Energy Policies, a Tokyo-based independent non-profit research organization.\nThat lags way behind New Zealand, for instance, where 84% of power used comes from renewable energy sources.\nThe country aims to have 36%-38% of its energy come from renewable sources by 2030, while slashing overall energy use."
  },
  {
    "headline": "Russia Halts Gas Supplies to Poland, Bulgaria for Failing to Pay in Roubles",
    "summarized_story": "Russian energy firm Gazprom said on Wednesday it had halted gas supplies to Bulgaria and Poland for failing to pay for gas in roubles, the Kremlin’s toughest retaliation yet to international sanctions over the war in Ukraine.\nGazprom said in a statement it had “completely suspended gas supplies to Bulgargaz and PGNiG due to absence of payments in roubles,” referring to the Polish and Bulgarian gas companies.\nPoland receives its Russian gas through the Yamal-Europe pipeline from Russia’s huge gas fields in the Arctic far north, which continues west to supply Germany and other European countries.\n“Cutting gas supplies is a breach of contract and PGNiG reserves the right to seek compensation and will use all available contractual and legal means to do so,” the company said.\nGermany, the biggest buyer of Russian energy, said this week it is hoping to stop importing Russian oil within days."
  },
  {
    "headline": "Nigeria Gets $200m World Bank Loan for Malaria Intervention",
    "summarized_story": "The National Malaria Elimination Programme on Tuesday said the World Bank was providing $200 million loan to fund malaria intervention programme in 13 states of the Federation.\nThe National Coordinator of the Programme, Dr. Perpetua Unomoibni said the loan provided by the World Bank was to take care of anti-malaria efforts in the 13 states not covered by similar intervention programme being implemented in other 23 states.\nSpeaking during a ministerial press briefing at the Federal Ministry of Health in Abuja, the Coordinator said there are two components of the World Bank loan for Nigeria – the one for malaria and that of immunisation plus which is under the National Primary HealthCare Development Agency.\n“We got $200 million from the World Bank to cover malaria Intervention across 13 states.\nHe said: “Nigeria recently completed training on COVID-19 vaccine production technology by WHO in South Africa and work is currently going on at the BioVaccine company."
  }
]