[
  {
    "headline": "FG to sue airlines breaching Disability Act, signing anti-PLWDs policies",
    "summarized_story": "It condemned the situation where it becomes difficult for the category of persons to enjoy public facilities, especially the airports.\n“Therefore, when we receive some of these complaints, we try to look into these policies that most of these airlines continue to sign.\nHe stated that the commission was ready to assist regulators and operators in facilitating movement and services for PLWDs at the airports.\nI don’t think issues and matters and the rights and welfare of persons with disabilities should be treated lightly or with disdain.\n“We will like the general public to take away any form of discrimination and stigma that is attached to disabilities."
  },
  {
    "headline": "FG to sue airlines breaching Disability Act, signing anti-PLWDs policies",
    "summarized_story": "It condemned the situation where it becomes difficult for the category of persons to enjoy public facilities, especially the airports.\n“Therefore, when we receive some of these complaints, we try to look into these policies that most of these airlines continue to sign.\nHe stated that the commission was ready to assist regulators and operators in facilitating movement and services for PLWDs at the airports.\nI don’t think issues and matters and the rights and welfare of persons with disabilities should be treated lightly or with disdain.\n“We will like the general public to take away any form of discrimination and stigma that is attached to disabilities."
  },
  {
    "headline": "Ekiti centre recorded 139 gender-based violence cases in one year",
    "summarized_story": "The Ekiti State Sexual Assault Referral Centre, also known as Moremi Clinic, says it has attended to 139 cases within one year of its establishment.\nThe News Agency of Nigeria reports that the Centre Coordinator, Mrs. Rita Ilevbare, disclosed this in a statement made available to newsmen on Wednesday in Ado-Ekiti.\nShe said that out of the cases, the youngest client was six months old while the oldest was 85 years old.\nIlevbare said that the centre was established on June 23, 2020, following the state of emergency declared on gender-based violence by the Nigeria Governors’ Forum, under the leadership of Ekiti Governor, Dr. Kayode Fayemi.\nShe appreciated the Ministries of Women Affairs and Social Development, Justice, Health and Human Services as well as Ekiti State University Teaching Hospital, police, civil society organisations and the clinic staffers for their support."
  },
  {
    "headline": "Ekiti centre recorded 139 gender-based violence cases in one year",
    "summarized_story": "The Ekiti State Sexual Assault Referral Centre, also known as Moremi Clinic, says it has attended to 139 cases within one year of its establishment.\nThe News Agency of Nigeria reports that the Centre Coordinator, Mrs. Rita Ilevbare, disclosed this in a statement made available to newsmen on Wednesday in Ado-Ekiti.\nShe said that out of the cases, the youngest client was six months old while the oldest was 85 years old.\nIlevbare said that the centre was established on June 23, 2020, following the state of emergency declared on gender-based violence by the Nigeria Governors’ Forum, under the leadership of Ekiti Governor, Dr. Kayode Fayemi.\nShe appreciated the Ministries of Women Affairs and Social Development, Justice, Health and Human Services as well as Ekiti State University Teaching Hospital, police, civil society organisations and the clinic staffers for their support."
  },
  {
    "headline": "Colluding with Bandits: Nigerian Army dismisses Gumi’s allegation",
    "summarized_story": "Sheik Ahmad GumiThe Nigerian Army has dismissed Sheikh Ahmad Gumi’s allegation that its personnel were colluding with bandits who had been responsible for various crimes and atrocities against Nigerians and the Nigerian state.\nThe Director, Army Public Relations, Brig.-Gen. Onyema Nwachukwu, in a statement on Wednesday, was reacting to Gumi’s allegations on ARISE TV Morning Show on Wednesday.\nNwachukwu said that the Nigerian Army remained a symbol of national unity that had discharged its constitutional responsibilities in the most professional manner in line with global best practices.\nHe said that army personnel had always adhered to the rules of engagement and protection of the fundamental human rights of the citizenry.\nThe Army spokesperson also cautioned that patriotism be taken to a trajectory where subversive conversations on the state were brought to the barest minimum."
  },
  {
    "headline": "Leaking Roof: We're not responsible for maintenance of NASS Complex— Senate President",
    "summarized_story": "Senate President, Ahmad LawanThe Senate President, Ahmad Lawal, has said neither the National Assembly nor its leadership is responsible for the maintenance and renovation of the National Assembly Complex.\nSabi had raised Points of Order 14 and 15 of the Senate Standing Rule in reaction to a report on roof leakage in the National Assembly Complex.\nOn who is to blame for the state of the Complex, Lawal released a statement, Wednesday, entitled “National Assembly is Not Responsible for the Maintenance and Renovation of the National Assembly Complex”.\n“None of this amount is even appropriated for the National Assembly bureaucracy or its leadership.”He added that the National Assembly Complex is a National Monument which falls under the purview of control of the Federal Capital Development Agency, FCDA.\n“In essence, the FCDA is responsible for its maintenance as well as renovation and not the Leadership of the National Assembly as being falsely bandied about,” the Senate President said."
  },
  {
    "headline": "Land Dispute: Army inaugurates committee to investigate violent confrontations between soldiers, civilians",
    "summarized_story": "By Evelyn UsmanThe 81 Division of the Nigerian Army, Victoria Island, Lagos , has inaugurated a committee to investigate land disputes between serving and retired Army officers and civilians in Lagos and Ogun states.\nInaugurating the five-man committee yesterday, the General Officer Commander, GOC 81 Division, Major General Lawrence Fejokwu, charged members to establish a mechanism for the amicable resolution of land disputes between soldiers and civilians.\nRather, they should complain to the committee so that the committee can help them through such cases.\nThis is taking another step towards solving the problem of land disputes in 81 Division’s Area of Responsibility involving our personnel both serving and retired”.\nHe said with the committee on ground, Army personnel, whether serving or retired are not allowed to tackle land disputes themselves."
  },
  {
    "headline": "Why African Leaders must demonstrate interest in finding lasting peace in Ethiopia — Goodluck Jonathan",
    "summarized_story": "Former President Goodluck Jonathan has challenged African Leaders to demonstrate a special interest in the current quest for lasting peace in Ethiopia so as to provide a platform upon which democratic ideals and political leadership that are workable within plural societies can be guaranteed on the African continent.\nIn his charge to the leaders in Africa, Dr. Jonathan said, “I call on the central government, and the regional government of Ethiopia to come to some understanding and end hostilities there.\nI also call on African leaders to show considerable interest in the peace process in Ethiopia.\nA nation progresses, and its development gets duly consolidated, when both majority and minority potentials are aggregated for enduring strength.\nThe Guest Speaker at the 2014 Lecture series was a leading legal practitioner based in the United Kingdom, Alan Jones; the Guest Speaker for the series in 2015 was honoubable Justice C.C."
  },
  {
    "headline": "Insecurity: Buhari, northern govs meet in Aso Rock",
    "summarized_story": "The meeting, it was gathered, was primarily on the security situation in the three geopolitical zones that make up the region with 19 states.\nGovernor Matawalle assured farmers that they would be able to safely cultivate their farms this raining season as security would continue to improve.\nWe will do our best to make sure that all farmers will go back to their farms.”Speaking of the meeting held with President Buhari, the governor said “we discussed about the security, not just myself, but the Northern region, because of the current escalation of insecurity.\n“I briefed him and the governor of Niger also briefed him.\nThe President has assured us that action will be taken about what we have discussed about the issue of insecurity.”Vanguard News Nigeria"
  },
  {
    "headline": "NDDC board: Don’t renege on June deadline, IYC warns Akpabio, FG",
    "summarized_story": "The leadership of Ijaw Youths Council (IYC) Worldwide, has called on the Nigerian Government and the Minister of Niger Delta Affairs, Senator Godswill Akpabio, to honour the June deadline agreement reached with stakeholders on the constitution of the substantive board of the Niger Delta Development Commission (NDDC).\nHe insisted that any politician or a member of his cabinet trying to give reasons for any extension simply desired to plunge the Niger Delta, the mainstay of the country’s economy, into avoidable crisis.\nThe IYC boss said it was no longer tenable to continue to use the ongoing forensic audit of the commission to perpetrate the ongoing injustice in NDDC.\nHe said: “We are calling on President Muhammadu Buhari to honour the agreement between the Niger Delta stakeholders and the federal government on the constitution of the NDDC substantive board before the end of this month.\n“Any attempt to demand extension of the ongoing anomaly in NDDC will be resisted vehemently by our youths."
  },
  {
    "headline": "Sign petition in circulation to seek referendum for Yoruba nation – Prof Akintoye",
    "summarized_story": "The leader of the umbrella body of Yoruba Self-Determination Groups, Ilana Omo Oodua, Emeritus Professor Banji Akintoye, has called on Yorubas home and abroad to sign the petition in circulation seeking a referendum for seeking secession.\nThe petition is in order to aide the agitation for Yoruba Nation before the Nigerian Government and International Bodies.\nProfessor Akintoye endorsed the ongoing petition being pushed by the Nigerian Indigenous for Nationalities Alliance for Self-Determination (NINAS) for a referendum.\nAkintoye advised millions of Yoruba people within and beyond Nigeria to vote in support of a petition created by some members of NINAS that is being circulated.\nSo, we Yoruba must all make a rush to vote for the Petition that is now being circulated by NINAS”, Akintoye, said."
  },
  {
    "headline": "Senate approves University of Medicine, Abeokuta",
    "summarized_story": "The Senate on Wednesday approved a bill seeking the establishment of the University of Medicine and Medical Sciences, Abeokuta, Ogun State.\nDAILY POST reports that the bill, which was sponsored by Senator Ibikunle Amosun of Ogun Central, was today presented for the third reading and was unanimously passed without dissenting voicesThe former Ogun State Governor was said to have donated 170 hectares of land as the permanent site for the proposed university.\n“With this latest development, the bill had successfully passed its major hurdle as it awaits a concurrence by the House of Representatives, which is a mere formality,” the Spokesman of the Federal Medical Centre (FMC) Abeokuta, Segun Orisajo, said in a statement.\nOrisajo disclosed that the establishment of the university was the vision of the FMC former Medical Director, Prof Adewale Musa-Olomu, who he said had been vigorous and relentless in the actualization of the objective."
  },
  {
    "headline": "End SARS: Baby born in Ondo prison christened, gets scholarship [PHOTOS]",
    "summarized_story": "The baby born in prison by an 18-year-old girl, Kemisola Ogunniyi, who was arrested during the End SARS protest in Akure, has been christened on Wedneday.\nThe baby was christened at Ayedun area of Akure, Ondo State capital with well-wishers trooping into Vera Christian Assembly to witnessed the event despite the heavy downpour.\nDuring the christening ceremony, the wife of Ooni of Ife, Olori Naomi Ogunwusi, stormed the venue with her entourage and offered the baby scholarship from primary to secondary school level.\nApart from the scholarship, Olori Ogunwusi also presented the new baby and the mother who was shedding tears of joy with food items, toiletries as well as other gifts.\nAn Ondo state High Court sitting in Olokuta Medium Prison in Akure had on Tuesday, granted bail to Kemisola after spending eight months in the prison custody."
  },
  {
    "headline": "Court orders service on Terrence Kuanum for linking Yushau Shuaib with terrorists",
    "summarized_story": "A High Court of the Federal Capital Territory has ordered substituted service of the court process on Terrence Kuanum over libellous publications made against PRNigeria publisher, Yushau Shuaib.\nAbdulsalam sought permission that the court process and the hearing notice be served on the defendant via his last known home address or WhatsApp Number or email address.\nThe Judge granted the requests and ordered that Kuanum be served with the originating summon and the hearing notice.\nLast year, Shuaib slammed a N500million libel suit against a Kuanum as general and exemplary damages for defamation of his character.\nThe publication followed an opinion Shuaib wrote on January 28, 2020, “Memo to President Buhari on Service Chiefs”."
  },
  {
    "headline": "NDDC board: don’t renege on June deadline, IYC warns Akpabio, FG",
    "summarized_story": "Igbifa told President Muhammadu Buhari that anybody suggesting the extension of the current arrangement in NDDC till July ending was an enemy of his administration.\nIgbifa insisted the stakeholders, who met and agreed on the current deadline should not be taken for granted.\nADVERTISEMENTHe said: “We are calling on President Muhammadu Buhari to honour the agreement between the Niger Delta stakeholders and the federal government on the constitution of the NDDC substantive board before the end of this month.\n“Any attempt to demand extension of the ongoing anomaly in NDDC will be resisted vehemently by our youths.\nIt is expected that by now the Federal Government will have released the list of the board nominees."
  },
  {
    "headline": "Anambra 2021: angry aspirants absent as APGA holds primary",
    "summarized_story": "He also announced that some officials from the national and state headquarters of the Independent National Electoral Commission (INEC) were at the venue to monitor the conduct of the governorship primary.\nUmeoji had earlier after his disqualification faulted the party’s leadership decided against him, and, insisted that he must participate in the governorship primary.\nMeanwhile, the heavy presence of security operatives from the Police, Military, Department of State Service (DSS) among others made the arena look like a war zone.\nThe security men nearly outnumbered the party delegates, with the State governor, Chief Willie Obiano in attendance.\nThe intervention of the Commissioner for Information and Public Enlightenment saved the reporters who were not accredited for the primary."
  },
  {
    "headline": "20 intending passengers denied boarding at MMIA",
    "summarized_story": "By Kelvin Osa OkunborNo fewer than 20 Nigerians have been stopped from travelling out of the country through the Murtala Muhammed International Airport (MMIA) Lagos in the last one week by the Nigeria Immigration Service (NIS), Airport Command.\nAlso the NIS, MMIA Command on Wednesday, reunited a mentally-challenged female Nigerian, Motunde Oluwatobi Victoria with her family members at the airport.\nShe confirmed Motunrayo, who had been in Saudi Arabia since 2018, was engaged as a house maid, stressing she got wind of her health challenge about two weeks ago.\n“I am very grateful to the immigration service, MMIA Command for reuniting me with my sister.\nWe will still think she was in Saudi Arabia,” she said."
  },
  {
    "headline": "UNILAG holds 51st convocation one year after",
    "summarized_story": "By Kofoworola Belo-OsagieThe 2019 convocation of the University of Lagos (UNILAG), which was suspended in March 2020 due to the crisis between the Wale Babalakin-led Governing Council and Prof. Oluwatoyin Ogundipe-led management has been scheduled to hold July 5-8, 2021.\nAccording to the schedule released by the university, the exercise will formally commence with an exhibition and convocation lecture on July 5.\nConferment of honorary degrees and awards of PhDs will hold on July 8, 2021, the last day of the convocation.\nThe Vice-Chancellor would announce the names of honorary degrees recipients during the pre-convocation press conference scheduled for June 30, 2021.\nThe convocation was cancelled last year because of disagreement between the management and council over the selection of a convocation lecturer, among others."
  },
  {
    "headline": "Tragedy in Kwara as herbal drink kills family of 10",
    "summarized_story": "From Layi Olanrewaju, IlorinTen members of a family in Biogberu village in Gwanara, Kwara State, have died after consuming a local herbal drink, police spokesman SP Okasanmi Ajayi has disclosed.\nAjayi made the disclosure in a statement he signed and made available to reporters on Wednesday.\nAccording to him, Okosi Musa and Worugura Junlin gave his mother, who was having a foot infection, a local herbal mixture purported to be the cure for her ailment.\nAjayi added: ‘She was told to ensure that all her family members take out of the mixture to prevent the spread of the disease to other family members.\n‘After taking the local herbal mixture, the family members started one after the other, at the last count, 10 members, including the infected legged mother, died."
  },
  {
    "headline": "FG, Reps fight over Twitter ban as ECOWAS Court stops FG",
    "summarized_story": "From Ndubuisi Orji, Godwin Tsa and Aidoghie Paulinus, AbujaThe Federal Government and the House of Representatives clashed yesterday over the suspension of Twitter.\n“We suspended Twitter because Twitter became a platform of choice for those that want to bring down this country.\nSocial media is a menace everywhere in the world.\nWe believe that the best way to start is regulating them.”He added: “Incidentally, the Twitter suspension is indefinite; it’s not banned.\n“We are at the mercy of people who handle social media irresponsibly."
  },
  {
    "headline": "Tanker explosion kills 2, burns 13 vehicles in Ogun",
    "summarized_story": "From Laide Raheem, AbeokutaAt least, two persons have been confirmed dead, while 13 vehicles were burnt when a petroleum tanker exploded at the Ogere-Remo axis of the Lagos-Ibadan Expressway, yesterday morning.\nDaily Sun gathered that a fully loaded 40-feet truck, whose content could not be ascertained, had, around 4am, fallen along the expressway, thereby causing serious gridlock which also narrowed the road.\nThe development also compelled the state’s Deputy Governor, Engineer Noimot Salako-Oyedele, to lead a government delegation on an on-the-spot assessment of the incident.\nWhile extending the state government’s condolences to families of those who lost their lives in the incident, Salako-Oyedele noted that the impact of the loss was too significant.\nShe lauded the officials of the FRSC, police, fire service and TRACE, who responded promptly to the emergency, thereby, helping to limit the tragic loss of lives."
  },
  {
    "headline": "Sanwo-Olu launches 7 new boats, additional jetties",
    "summarized_story": "By Lukman OlabiyiLagos Governor, Bababjide Sanwo-Olu, has enhanced the capacity of Lagos Ferry Services for efficient service delivery with the inauguration of seven high capacity boats and cowry cards.\nHe said his administration would prioritise safety on waterways by ensuring total compliance with safety protocols and regulations by boat operators.\nWe are already witnessing positive outcomes from our investment in the safety and viability of our waterways as a safe alternative to road transportation.\nSanwo-Olu also urged the private sector to invest in water transportation, saying the economic potential is limitless.\nWe will not relent in doing our best for Lagosians and making their daily commute safe and less stressful."
  },
  {
    "headline": "$3m bribe: Farouk Lawal bags 7 years jail term",
    "summarized_story": "Lawan was the chairman of the committee probing the multi-billion naira fuel subsidy fraud in 2012.\nEarlier, Justice Otaluka dismissed the preliminary objection filed by Farouk Lawan against his trial to set the stage for his conviction.\nWhereas the defendant was handed seven years jail term on counts one and two of the charge, the court sentenced him to five years on count three.\nJustice Otaluka held that the sentence would run concurrently.\nLawan was the chairman of an ad hoc committee set up by the House in 2012 to investigate massive petrol subsidy fraud."
  },
  {
    "headline": "Senate May Pass 2021 Supplementary Appropriation Bill Next Tuesday",
    "summarized_story": "Refers bill to appropriate committeeBy Deji Elumoye and Juliet AkojeThe President of the Senate, Dr Ahmad Lawan, has hinted that the 2021 Appropriation Bill sent to the Senate by President Muhammadu Buhari for approval may be passed next Tuesday.\nHe, therefore, referred the Appropriation Bill sent to the Senate by the president on June 15 to the Senate Committee on Appropriation headed by Senator Jibril Barau.\nPresident Buhari had on Tuesday, June 15 transmitted the 2021 Supplementary Appropriation Bill to the National Assembly for consideration and approval.\nThe supplementary budget bill was transmitted via a letter dated 15th June, 2021, and addressed to the President of the Senate, Lawan.\n“It has become necessary to prepare the 2021 Supplementary Appropriation Bill considering the urgent need to make provision for procurement and administration of COVlD-19 vaccines."
  },
  {
    "headline": "Adesina: Presidency has no Input in Media Bills before N’ Assembly",
    "summarized_story": "The spokesman, however, revealed that President Muhammadu Buhari has given approval that the Second Peer Review Country Self-assessment Report should be done.\nAccording to him, “The only thing of interest I would like to talk about is the second Peer Review Country’s Self-assessment Report.\nNigeria is ready for the second Peer Review Country Self -assessment Report to be done by AUDA-NEPAD.\nNow, Nigeria is ready for the second review self-assessment report.\nSo, it’s one of the highlights of the Peer Review Country Self-assessment Report that was presented at the Council meeting today."
  },
  {
    "headline": "US Blocks Iran-affiliated News Sites",
    "summarized_story": "The US has taken down dozens of Iranian and Iran-linked news sites which it accuses of spreading disinformation.\nThe sites were replaced on Tuesday with notices saying they had been “seized” as part of a law enforcement action.\nThe sites had been used by components of the Iranian government “disguised as news organizations or media outlets” to target the US “with disinformation campaigns and malign influence operations”, it alleged.\nYemen’s rebel Houthi movement confirmed that a domain of its news channel, Al-Masirah TV, had been blocked.\nThe .tv domain is owned by the Pacific nation of Tuvalu but is run by the US firm Verisign."
  },
  {
    "headline": "News in Photographs: Buhari Presides over FEC Meeting",
    "summarized_story": "By Deji ElumoyeThe weekly Federal Executive Council (FEC) meeting is holding at the State House, Abuja with President Muhammadu Buhari presiding.\nThe virtual meeting taking place at the conference room of the First Lady’s office has in attendanceVice President Yemi Osinbajo, Secretary to Government of the Federation, Boss Mustapha, and Chief of Staff to the President, Prof Ibrahim Gambari.\nOthers physically attending the meeting include Ministers of Information and Culture, Lai Mohammed; Finance, Budget and National Planning, Zainab Ahmed; Attorney General of the Federation and Minister of Justice, Abubakar Malami; Defence, Major-General Bashir Magashi (rtd); Health, Dr Osagie Ehanire; Labour and Employment, Dr Chris Ngige, and Communications and Digital Economy, Dr Isa Pantami.\nOther Ministers as well as the Head of Civil Service of the Federation, Dr (Mrs) Folashade Yemi-Esan, are attending the meeting virtually from their various offices in Abuja.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Ambassadorial Postings: Olonisakin Deployed to Cameroon, Buratai to Benin Republic",
    "summarized_story": "By Michael OlugbodeFormer Chief of Defence Staff, General Abayomi Olonisakin (Rtd), and former Chief of Army Staff, Lt. Gen. Tukur Buratai (Rtd), have gotten their ambassadorial postings.\nOlonisakin will represent Nigeria in neighbouring Cameroon, with Buratai deployed to Benin, another neighbouring country.\nThe announcement was made at a brief ceremony in Abuja on Tuesday, where the Minister of Foreign Affairs, Geoffrey Onyeama, presented letters of credence to the two ex-service chiefs.\nAccording to a statement signed by the information officer in the Ministry of Foreign Affairs, Mr Kimiebi Ebienfa: “The Honourable Minister of Foreign Affairs, H.E.\nGeoffrey Onyeama on 22 June 2021, presented Letters of Credence to the Ambassador-Designate of Nigeria to the Republic of Cameroon, General Abayomi Gabriel Olonisakin (Retired) and the Ambassador-Designate of Nigeria to the Republic of Benin, Lt.Gen."
  },
  {
    "headline": "Bank Documents Expose How Buhari's Government Funded Adamu Garba’s Crowwe To Rival Twitter—Report",
    "summarized_story": "People's Gazette obtained bank documents that carried a transfer of funds from the Central Bank of Nigeria to Garba’s IPI Solutions, a software engineering firm run by Mr Garba.\nThe company developed and deployed the Crowwe social media app.\nA few months after assuming office in 2015, members of his ruling APC pushed a so-called social media bill that civil liberties campaigners said was too offensive to be accepted in a democratic system.\n“The seriousness of controlling social media cannot be overplayed.”Garba earned instant name recognition in 2018 after showing interest in running for president against Buhari.\nInstead, Garba found his Crowwe app removed from Google Play Store a week after the Twitter ban following a deluge of complaints from users."
  },
  {
    "headline": "Bank Documents Expose How Buhari's Government Funded Adamu Garba’s Crowwe To Rival Twitter—Report",
    "summarized_story": "People's Gazette obtained bank documents that carried a transfer of funds from the Central Bank of Nigeria to Garba’s IPI Solutions, a software engineering firm run by Mr Garba.\nThe company developed and deployed the Crowwe social media app.\nA few months after assuming office in 2015, members of his ruling APC pushed a so-called social media bill that civil liberties campaigners said was too offensive to be accepted in a democratic system.\n“The seriousness of controlling social media cannot be overplayed.”Garba earned instant name recognition in 2018 after showing interest in running for president against Buhari.\nInstead, Garba found his Crowwe app removed from Google Play Store a week after the Twitter ban following a deluge of complaints from users."
  },
  {
    "headline": "Bank Documents Expose How Buhari's Government Funded Adamu Garba’s Crowwe To Rival Twitter—Report",
    "summarized_story": "People's Gazette obtained bank documents that carried a transfer of funds from the Central Bank of Nigeria to Garba’s IPI Solutions, a software engineering firm run by Mr Garba.\nThe company developed and deployed the Crowwe social media app.\nA few months after assuming office in 2015, members of his ruling APC pushed a so-called social media bill that civil liberties campaigners said was too offensive to be accepted in a democratic system.\n“The seriousness of controlling social media cannot be overplayed.”Garba earned instant name recognition in 2018 after showing interest in running for president against Buhari.\nInstead, Garba found his Crowwe app removed from Google Play Store a week after the Twitter ban following a deluge of complaints from users."
  },
  {
    "headline": "#LekkiMassacre: How Nigerian Army, Lagos Government Secretly Took 20 Corpses To State Pathologist",
    "summarized_story": "The Nigerian Army and the Lagos State Government connived and secretly took 20 bodies from the Lekki Tollgate to the state pathologist for autopsies after the October 20, 2020 shootings, SaharaReporters has learnt.\nSaharaReporters gathered from a top source that the Lagos State Pathologist, Prof John Obafunwa, made this revelation secretly to members of the Lagos State EndSARS panel sitting in Lekki.\n\"The pathologist in Lagos has secretly revealed that the Nigerian Army and the Lagos state government brought 20 Lekki massacre victims on October 24, to him but they claimed they were people trying to break out of Ikoyi prisons.\nThis is in addition to the 99 bodies which they confessed were taken to the pathologist earlier, saying three were from Lekki Tollgate,\" the source stated.\nHowever, on October 20, soldiers from the Bonny Camp, 81 division, invaded the Lekki tollgate, where some demonstrators had gathered, and fired gunshots."
  },
  {
    "headline": "#LekkiMassacre: How Nigerian Army, Lagos Government Secretly Took 20 Corpses To State Pathologist",
    "summarized_story": "The Nigerian Army and the Lagos State Government connived and secretly took 20 bodies from the Lekki Tollgate to the state pathologist for autopsies after the October 20, 2020 shootings, SaharaReporters has learnt.\nSaharaReporters gathered from a top source that the Lagos State Pathologist, Prof John Obafunwa, made this revelation secretly to members of the Lagos State EndSARS panel sitting in Lekki.\n\"The pathologist in Lagos has secretly revealed that the Nigerian Army and the Lagos state government brought 20 Lekki massacre victims on October 24, to him but they claimed they were people trying to break out of Ikoyi prisons.\nThis is in addition to the 99 bodies which they confessed were taken to the pathologist earlier, saying three were from Lekki Tollgate,\" the source stated.\nHowever, on October 20, soldiers from the Bonny Camp, 81 division, invaded the Lekki tollgate, where some demonstrators had gathered, and fired gunshots."
  },
  {
    "headline": "JAMB: UTME results will be released today",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB) says the results of the 2021 Unified Tertiary Matriculation Examination (UTME), written so far will be released on June 23.\nOloyede said that he had no reason whatsoever to withhold the results of the UTME.\nHe noted that JAMB registered 1,415,501 candidates in this year’s UTME and that 1,122,095 had taken the examinations so far while 66,111 are yet to take.\nAdvertisementHe added that the board has about 650 examination centres across the country, out of which, 30 have been delisted for performing below standard.\n“And we were able to detect this through NIN and now we have realistic number of JAMB candidates.”Copyright 2021 TheCable."
  },
  {
    "headline": "Akwa Ibom to review case of student expelled for ‘insulting’ governor",
    "summarized_story": "The Akwa Ibom state government says it has approved a panel to review the case of Iniobong Ekpo, the 500-level student, who was expelled for allegedly insulting Emmanuel Udom, the state governor, on Facebook.\nHe was first suspended indefinitely in September 2020 before his expulsion via a letter dated April 9, 2021.\nAdvertisementReacting to his expulsion, Ekpo had given the varsity seven days to restore his studentship or face a lawsuit.\nHe had demanded N20 million from the varsity through his lawyer as damages for “the breach of his fundamental rights.”According to Premium Times, Idongesit Etiebet, Akwa Ibom commissioner for education, said Udom was not aware of Ekpo’s expulsion.\nAdvertisementCommenting about the development on Wednesday, the commissioner also stated that Udom has now approved the constitution of a five-man panel to review the university’s action."
  },
  {
    "headline": "NYSC to employers: Don’t engage graduates without our certificates",
    "summarized_story": "The National Youth Service Corps (NYSC) has called on employers of labour to demand national service or exemption certificates from prospective employees before engaging them.\nAdvertisementShuaib Ibrahim, NYSC director-general, spoke on Tuesday during the scheme’s legal aid workshop held in Abuja.\nAccording to Ibrahim, the move will help checkmate the presentation of fake certificates in workplaces by degree or higher national diploma (HND) holders.\nThe NYSC DG also called on employers to submit the NYSC certificates of their extant employees to the scheme for authentication.\n“Employers are also strongly advised to present the NYSC Certificates of their existing employees to the scheme for authentication.”AdvertisementCopyright 2021 TheCable."
  },
  {
    "headline": "Insecurity: UNIJOS hires hunters to protect students",
    "summarized_story": "The University of Jos (UNIJOS) has hired local hunters to protect students on campus and their hostels amid the heightened state of insecurity in Nigeria.\nAdvertisementSebastian Maimako, the institution’s vice-chancellor (VC), broke the news on Tuesday during the valedictory session to mark the end of his five-year tenure.\nOver the past couple of years, academic institutions have been targeted in multiple attacks and abductions by armed men.\nBefore we could reopen, we were given a condition that we must employ the services of local hunters to help us secure our hostels, particularly at night.\nAccording to him, 43 of the varsity’s programmes have full accreditation status while 30 programmes have interim accreditation status out of 75 programmes which the institution was to run."
  },
  {
    "headline": "Peace Hyde to produce Netflix’s first Africa reality series",
    "summarized_story": "Peace Hyde, a British-Ghanaian education activist and award-winning media personality, is set to executive-produce Netflix’s first-ever Africa reality series titled ‘Young, Famous & African’.\nAdvertisementIn an Instagram post on Tuesday, Hyde revealed that she is also the creator of the unscripted original series set to debut on the streaming platform soon.\nHyde doubles as the founder of Aim Higher Africa, a non-profit organization focused on improving the quality of education in impoverished communities across Africa.\nAdvertisementIn 2018, she was shortlisted among 200 leaders as part of the Obama Foundation Africa Leaders programme.\nHyde is also the head of digital media and partnerships and West African correspondent for Forbes Africa."
  },
  {
    "headline": "Jesse Forrester started an e-mobility company in Kenya after deciding against going to university",
    "summarized_story": "After ALA, Jesse took up a fellowship.\nToday, his company Mazi Mobility is backed by global venture builder, Satgana, and is aiming at implementing an electric vehicle ecosystem in Africa.\nHe started his company without a university degree and he is now preparing himself to dominate the African e-mobility space.\nThe journey to Mazi by way of ALA‘Mazi’ was not always ‘Mazi Mobility’.\nAt ALA, Jesse was a part of the team behind “The Living Machine” a water treatment system that won them the $100,000 Zayed Sustainability Prize in 2019."
  },
  {
    "headline": "SEC approves Chaka as first licensed stock trading app in Nigeria",
    "summarized_story": "Chaka becomes the first to acquire the digital sub-broker license introduced by SEC in April of this year.\nAs part of a major amendment to its Consolidated Rules and Regulations, SEC recognised sub-brokers who use digital platforms to serve multiple brokers.\nOn the 19th of December 2020, the SEC published a statement that effectively barred Chaka from offering its services in Nigeria.\nThat December warning enabled Chaka to take the lead and open talks with the SEC.\nHe said the license also means Chaka could now enable other stockbroking firms who want to have a digital presence."
  },
  {
    "headline": "From Konga to mPharma, logistics for health products is growing in Africa",
    "summarized_story": "These health logistics companies include e-commerce players like Jumia, Copia and Konga, and also core health startups like mPharma, Lifestores Pharmacy, Chekkit and Sproxil.\nSnapshot of innovators in the health products distribution space in Africa.\nKonga.com is a marketplace where pharmaceutical companies can list health products like medicines.\nSalient Advisory’s report notes that “clear and harmonised regulations” could boost this entry of e-commerce players into the health products distribution space.\nImudia declines to share what health products logistics currently contributes to Konga’s overall business."
  },
  {
    "headline": "A Nigerian-Taiwanese couple, on their love for online gaming",
    "summarized_story": "The real reason, however, is that she wants him to have a “normal” childhood away from video games.\nWhen they started dating, Olaide introduced Ying-Yi (who is half-Nigerian, half-Taiwanese) to online gaming.\nOlaide: I have been playing video games since I was a kid.\nI’ve had many conversations with companies that want to get into online gaming but they fear the risks.\nAlexander: So how do you pitch online gaming to people in government, as something good for the digital economy?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Nigerian investment-tech startup, Chaka, secures SEC’s first digital stock trading licence",
    "summarized_story": "Nigeria’s Securities and Exchange Commission (SEC) has issued a new license for digital stock trading to Chaka technologies limited.\nThe commission’s Sub-Broker Serving Multiple Brokers Through a Digital Platform License will enable Chaka to offer stocks directly to Nigerian investors.\nOsibodu reveals that the new digital sub-broker licence would change its investment operations structure as it would no longer need to operate through a broker.\nAdvertisementPer Osibodu, Chaka can now help regular stockbrokers digitise their services.\nThough SEC has not issued an official framework on the new sub-broker licence, other industry players would likely follow suit."
  },
  {
    "headline": "Airtel Money separates from Airtel Uganda to meet regulatory requirements",
    "summarized_story": "Airtel Uganda has announced the separation of Airtel Money from its Telecom business on Tuesday, 22nd June 2021.\nThis means the phone-based service has been transferred to its affiliate, Airtel Mobile Commerce Uganda Limited (AMC Uganda).\nThus, in Uganda, AMC will conduct all Airtel Money services while partnering with and through the licensed telecommunications network of Airtel Uganda.\nHe clarified that the affiliate company, AMC Uganda, will provide Airtel Money services to registered subscribers of Airtel Uganda with the same terms and conditions.\nSimilarly, MTN Uganda promised to hand over its financial services and change its name from MTN MoMo to MTN Uganda Limited on June 1, 2021."
  },
  {
    "headline": "[OPINION] Not too big to fail: How the biggest tech giants could collapse",
    "summarized_story": "Oghenekaro Obrutu (Techpoint Product Lead) asked:Of the tech giants (Microsoft, Amazon, Google, Apple and Facebook).\nWho do you think is most likely to collapse first?\nP.S: I know there isn’t a huge chance of this, but just rank them in order of likely to unlikely (to collapse).\nAdvertisementTeam responses ensue…Then comes Oghenekaro’s answer, increasing order of unlikelihood:FacebookFacebook CEO, Mark ZuckgerbergFacebook has the weakest business model in my opinion.\nBut if one of their products fails or is out innovated by someone else, they could lose many users across all their products, because their other products won’t play nice."
  },
  {
    "headline": "Why Nigeria may buck trend of record-low interest rates on African Eurobonds",
    "summarized_story": "Why Nigeria may buck trend of record-low interest rates on African EurobondsIncreased investors’ appetite for African Eurobonds is spurring record low-interest rates, but Nigeria may miss out when it visits the international market later this year.\nDeclining external reserves, insecurity, policy inconsistency and the recent Twitter ban, which heightened the risk premium of Africa’s largest economy, are top reasons why Nigeria is unlikely to follow the…"
  },
  {
    "headline": "Why luxury real estate still finds buyers amid economic downturn",
    "summarized_story": "In a curious case of twisted law of economics, luxury real estate still finds buyers in the Nigerian property market despite the downturn in economy that has seen incomes drop and consumer purchasing power shrink considerably.\nA luxury real estate or home is one that is valued within the top 10 of such properties on the local market.\nAnother reason for the curious rise in demand for luxury real estate is corruption in governmental systems where public office holders who embezzle public funds find real estate a ready haven for the stolen money.\nCompared to other investment assets like bonds and stocks, real estate has lower risk.\nIn Victoria Island, for instance, luxury real estate is limited in supply due to a fixed amount of land."
  },
  {
    "headline": "Lubricants prices up 200% on poor local capacity, import dependence",
    "summarized_story": "In Africa’s biggest oil-producing country, the price of lubricant, a by-product of crude oil, has skyrocketed as high as 200 percent with businesses suffering more from rising operational cost while Nigeria’s projected $683 million lubricant market continues to face investor apathy.\nFrom heavy manufacturers to small retail businesses, this rise in lubricant price translates to…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Removal of illegal structures: We’ll not tolerate lawlessness in Edo – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the ongoing removal of illegal structures is in line with the State Extant Planning Laws and Regulations and aimed at ensuring order and sanitizing the built environment space.\nObaseki disclosed this when he visited the demolition site of 30 lock-up stores illegally built at Iyekogba Housing Estate, without a building permit.\nThe governor said: “Over the last few weeks, you will notice that our team has been going round the town to remove illegal structures that don’t have a building permit, particularly in areas with public activity.\n“A lot of people build shopping malls across the city without building plans or approvals from the appropriate authority.\nEven this store, which is an illegal structure, was served notice."
  },
  {
    "headline": "Edo intensifies removal of illegal structures, reads riot act – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has intensified the removal of shopping malls, hotels and other commercial buildings erected without appropriate approvals from the relevant regulatory authorities.\nSecretary to the State Government, Osarodion Ogie, Esq., in a statement, said the exercise is aimed at ensuring order and sanitizing the built environment space, in line with the extant laws and guidelines in the state for the benefit of the generality of Edo people.\nThe statement reads: “The Edo State Government hereby informs the general public and property developers in particular, that government is intensifying the removal of shopping malls, hotels and other commercial buildings erected without appropriate approvals from the relevant regulatory authorities.\n“The exercise is aimed at ensuring order and sanitizing the built environment space, in line with the extant laws and guidelines in the state for the benefit of the generality of Edo people.\n“In essence, all buildings and structures planned, being developed or completed in different parts of the state, without approvals, are to be discontinued and (or) removed."
  },
  {
    "headline": "TWITTER BAN :NGOs, Journalists Sue Federal Government at ECOWAS Court over Twitter Ban – Nigerian Observer",
    "summarized_story": "The suit, lodged with number ECW/CCJ/APP/29/21 ECW/CCJ/APP/29/21, in a 73-page documentation, was filed on their behalf by Abuja-based human rights and free expression lawyer, Mrs. Mojirayo Ogunlana Nkanga, under the African Charter on Human and Peoples’ Rights (ACHPR), the International Covenant on Civil and Political Rights (ICCPR), the Revised ECOWAS Treaty, and the Nigerian Constitution, among others.\nThey are claiming that Nigeria’s ongoing suspension of Twitter, which came into effect on or around June 4, 2021, violated their right to freedom of expression and interfered with the ability of the journalists to do their work.\nThe NGOs and journalists are also alleging that the general situation in Nigeria with respect to human rights, has created an environment where freedom of expression is stifled, which has contributed to creating a chilling effect on press and media freedom and which the ongoing suspension of Twitter is a continuation of.\nNo date has been fixed for the hearing of the suit.\nThe suit is being litigated with the support of Media Defence, a London-based NGO, which provides legal assistance to journalists, citizen journalists and independent media."
  },
  {
    "headline": "Unverified Private Aircrafts To Be Impounded By Customs From July 6 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – Private aircrafts that have not been verified by the Customs are to be forfeited to the Government come July 6 this year.\nThe Nigerian Customs Service made the pronouncement on Monday in Abuja with a stern warning that it will, from July 6, begin to impound all private jets that their documents are not verified by it.\nThe Service therefore advised all owners of private jets to ensure that they take advantage of the one-month grace period to verify their documents.\nWe also know that some brought their private jets under a temporary import certificate, which has expired and not renewed.\n“For the avoidance of doubt, private aircrafts owners or their representatives are to report to room 305, Tariff & Trade Departments, Nigeria Customs Service headquarters, Abuja, from 10am to 5pm."
  },
  {
    "headline": "EFCC re-arraigns three FIRS directors, six others for N4.5 billion Fraud",
    "summarized_story": "ADVERTISEMENTThe Economic and Financial Crimes Commission, EFCC, on Wednesday, June 23, 2021 re-arraigned Peter Hena, former Coordinating Director of Federal Inland Revenue Service (FIRS) and eight other officers of the agency before Justice Toyin Bolaji Adegoke of the Federal High Court, Abuja.\nJustice Bolaji granted the defendants bail on the terms earlier offered them by Justice Ojukwu, and fixed September 28, 2021 for commencement of trial.\nJustice Ojukwu had, upon their arraignment on Thursday, March 11, 2021, granted the defendants bail in the sum of N100 million each and sureties in like sum.\nThe sureties who must be Nigerian residing in Abuja with landed property within the jurisdiction of the court, are also to provide evidence of Tax Clearance.\nShe also ruled that the defendants are to deposit their travelling documents with the Court and to seek the permission of the Court before travelling out of the country."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Tsame Albashi A Kasafin 2022: Kungiyar Manyan Ma’aikatan Jami’o’i Ta Yi Barazanar Tsinduna Cikin Yajin Aiki",
    "summarized_story": ""
  },
  {
    "headline": "Ilimi Ba Ya Hana Aure, Haka Aure Ba Ya Hana Ilimi- Nana Aisha",
    "summarized_story": "To, gaskiya ban da wannan ra’ayin duk da de na san aure ba ya hana karatu, haka karatu ba ya hana aure, amman tun tasowa ta ban taba sa a raina zan tsaya da karatu ba.\nAkwai wata Khadija Nura, tana burgeni yanayin mu’amalar ta da mutane, shigarta da kuma maida hankalin ta a kan karatu gaskiya ba ta da laifi.\nYa za ki bambanta rayuwar Sakandare da kuma ta jami’a?\nZa ki ji wasu mazan na cewa ba za su auri waccce ta yi jami’a ba, me za ki ce a kan hakan?\nNana Aisha wannan shafi na godiya bisa bamu lokacin ki da kikayi Allah kara Hasken makarantaAmin, ni ce da godiya sosai"
  },
  {
    "headline": "Makomar Sarakuna A Dimukuradiyya: Shin Hakan Zai Haifar Da Da Mai Ido? (II)",
    "summarized_story": ""
  },
  {
    "headline": "Mu Farka Mata: Dogaro Da Kai A Tsakanin Mata Sana’a",
    "summarized_story": ""
  },
  {
    "headline": "Da Gaske Masari Zai Cika Alkawarin Zaben Kananan Hukumomi Alkawari?",
    "summarized_story": "Akwai batutuwa da dama da suka dabaibaye wannan al’amari na kananan hukumomi a jihar, tun farkon hawa wannan gwamnati karkashin Gwamna Aminu Bello Masari, wanda shi ne ya rushe zababbun shugabanin kananan hukumomi guda 34 da ya tarar akan mulkin wadanda dukkanin ‘yan jam’iyyar PDP ne a wancan lokacin.\nBaban dalilin da gwamnatin Masari ta ba da na rushe wadannan shugabanin kananan hukumomi sun hada da cewa a karkashin jam’iyyar da ta kawo su a kan mulki an yi wata doka da ta bai wa gwamna dama cewa yana iya rushe shugabanni kananan hukumomi idan har an same su da hannu dumu-dumu a cikin wata almundahana ko rashin gaskiya ko kuma kuriciyar bera.\nIta dai jam’iyyar APC mai mulki ta yi nasara da kotu ba ta mai da masu shugabannin kananan hukummomi ba, su kuma ‘yan jam’iyyar PDP sun yi nasara da ba su tashi a tutar babu ba.\nWasu da suka kasa hakuri sun rika danganta matsalar tsaro da rashin yin zaben kananan hukumomi wasu sun ba da misalin da cewa rashin yin wannan zabe ya taimaka wajen karuwar talauci a tsakanin al’umma musamman mutanen karkara wadanda suka dogara da kananan hukumomi.\nDa ya juya akan maganar zaben kananan hukumomi wanda shi ne batun da ya damu kowa sai ya ce yanzu wannan batun ya yi nisan gaske domin shirye-shirye sun kai kashi 70 na yadda za a gudanar da kananan hukumomi a jihar Katsina."
  },
  {
    "headline": "Nigerian Bishop makes a comprehensive list of adulterous pastors and politicians",
    "summarized_story": "A Nigerian Bishop, identified as Don Simon Osieme has compiled a comprehensive list of all adulterous pastors and politicians across Isoko land in Delta State.\nThe cleric took to his social media to share the list immediately after his children arrive safely in Texas, USA.\nAccording to him, the list contains profile cases of adultery perpetuated by pastors and politicians with whom, when, and where.\nHe wrote; ADULTERYMANIA SAGA VS THE HIDDEN EYES”Adultery by a wife in Isoko tradition is attempted murder and in some cases very close to me, first-degree murder.\nNo current Isoko House of Assembly member is on this list."
  },
  {
    "headline": "No graduate should be employed without certificate of national service – DG NYSC",
    "summarized_story": "Ukpono Ukpong, AbujaAll Employers of labour in the public and private sector have been warned against employing graduates without demanding for Certificate of National Service.\nThe Director-General, National Youth Service Corps (NYSC), Brig Gen Shuaibu Ibrahim, gave the warning yesterday at the opening ceremony of Corps Legal Aid Workshop, yesterday in Abuja.\nSpeaking further, he advised all employers to present the NYSC certificates of their existing employers to the scheme for authentication.\n“Would like to use this medium to remind all employers in the public and private sectors that it is mandatory to demand the Certificate of National Service or Exemption Certificate duly issued by the National Youth Service Corps before offering employment to any holder of Degree or Higher National Diploma.\nHe urged Legal Officers and Corps Lawyers to redouble efforts at enlightening the general public on the provisions of the NYSC Act."
  },
  {
    "headline": "Senate places 75% import duties on importation of syringes, needles",
    "summarized_story": "Tunde Opalana, AbujaThe Senate has ordered a hike in importation duties on syringes and needles into the country and therefore recommended 75 percent port duties.\nThe two directives were meant to protect local manufacturers, give them enabling environment to contribute to the revenue base of the nation and to reduce unemployment.\n“Importation of syringes and needles is killing local manufacturers making them to lay off staff and preventing them from contributing effectively to the economy.\nThis has been an impediment to local manufacturers attaining this status and preventing their being patronized by organisations using donor funds”.\n“The local manufacturers are actually the highest supplies of syringes and needles for hospitals."
  },
  {
    "headline": "Eschew differences among yourselves to help end insecurity, Assembly Speakers urges Northern Governors",
    "summarized_story": "By Samuel LukaThe Northern Speakers Forum has called on their Governors to eschew any form of differences among themselves with a view surmounting the menace of insecurity in the region.\nAs Signed by the Chairman of the Communique Drafting Committee Chairman, the Speaker of the Bauchi state Assembly, Rt.\nHonourable Sulaiman Abubakar and two other members, the Forum commended the Chairman Northern Speakers’ Forum, Rt Hon Yusuf Ibrahim Zailani for initiating and hosting the meeting aimed at addressing insecurity in the region.\n“The Forum calls on all the Executive Governors in the Northern Nigeria to eschew differences among them and unite to fight the menace of different forms of insecurity in the North”, the Communique said.\n“The Forum wants budget preparation to skew in favour of security of lives and property."
  },
  {
    "headline": "Black Sea: UK denies claims Russia fires warning shots at warship",
    "summarized_story": "Russia on Wednesday said it fired warning shots at a British Navy destroyer in the Black Sea after it violated the country’s territorial waters, while the UK denied that shots had been fired.\nIt did not react to the warning,” the Russian defence ministry said, as quoted by the Interfax news agency.\nThe defence ministry added that “a border patrol ship fired warning shots” and a Su-24 aircraft dropped four bombs along the destroyer’s path.\n“No warning shots have been fired at HMS Defender.\nAfter announcing that it had fired warning shots at the HMS Defender, Russia’s defence ministry summoned Britain’s military attache, Interfax reported."
  },
  {
    "headline": "Black Sea: UK denies claims Russia fires warning shots at warship",
    "summarized_story": "Russia on Wednesday said it fired warning shots at a British Navy destroyer in the Black Sea after it violated the country’s territorial waters, while the UK denied that shots had been fired.\nIt did not react to the warning,” the Russian defence ministry said, as quoted by the Interfax news agency.\nThe defence ministry added that “a border patrol ship fired warning shots” and a Su-24 aircraft dropped four bombs along the destroyer’s path.\n“No warning shots have been fired at HMS Defender.\nAfter announcing that it had fired warning shots at the HMS Defender, Russia’s defence ministry summoned Britain’s military attache, Interfax reported."
  },
  {
    "headline": "Evans: Again, absence of defence witness stalls trial",
    "summarized_story": "The trial of kidnap kingpin, Chukwudimeme Onwuamadike alias Evans was Wednesday stalled at an Ikeja High Court due to the absence of a witness who was to testify for the defence.\nEvan’s counsel, Oyekunle Falabi informed the trial judge, Justice Hakeem Oshodi that the female witness whose name was not given could no longer be reached via phone.\nFalabi told the court that all efforts to reach the witness have been abortive.\nHe subsequently requested the court for an adjournment to further look for the witness.\nHe adjourned the case until June 29 for the continuation of defence.. NationShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "10 family members die after consuming herbal concoction in Kwara",
    "summarized_story": "The Police Command in Kwara has confirmed that 10 members of the same family died after consuming a local herb mixture purported to be the cure for foot infection.\nAccording to him, on June 22, at about 0700hrs, one Ibrahim Bonnie of Fulani camp Biogberu, via Gwanara, reported at the police station.\n“She was also told to ensure that all her family members take some of the mixture to prevent the spread of the disease to other family members.\n“After taking the local herbal mixture, the family members started dying one after the other, at the last count, 10 members including the infected mother, have died.\n“Suspects will have their day in court at the conclusion of investigation,” he added."
  },
  {
    "headline": "We won’t succumb to pressure from criminals to lift Curfew – Wike",
    "summarized_story": "By Okafor OfieborRivers State Governor, Nyesom Wike on Wednesday said the government would not succumb to pressure from criminals to lift the curfew imposed in the wake of dastardly attacks on security formations in the state.\nWike spoke at the 60th birthday celebration of the federal lawmaker who represents Rivers South East senatorial district in the Senate, Senator Barry Barinada Mpigi in Port Harcourt.\nWike explained that the imposition of the curfew was based on security advise by law enforcement agencies, as a precaution to prevent further attacks on security formations in the State.\nWike thanked God for his grace and benevolence toward Senator Mpigi and his family.\nThe governor, who recalled that his relationship with Senator Mpigi dated back to when they were both council Chairmen, urged the senator to remain a steadfast Peoples Democratic Party stalwart."
  },
  {
    "headline": "Anambra poll: APGA crisis deepens, as faction suspends Soludo",
    "summarized_story": "The crisis rocking the All Progressives Grand Alliance (APGA) in Anambra State deepens on Wednesday as a faction of the party suspended former Central Bank of Nigeria (CBN) Governor, Prof. Charles Soludo for alleged anti-party activities.\nSoludo is aspiring for the governorship seat in Anambra under the platform of APGA.\nOn Wednesday, the Chief Jude Okeke-led National Working Committee of the the party axed Soludo.\nHe said the decision to suspend Soludo, who is a governorship aspirant of the party, was taken late Tuesday night at the meeting of the Party.\nHe stated Soludo was suspended because his activities were threatening the unity of the party."
  },
  {
    "headline": "NIN exposes more than 500,000 fake UTME candidates",
    "summarized_story": "Agency ReportsThe use of the National Identity Number (NIN) in registering for this year’s Unified Tertiary Matriculation Examination (UTME) has exposed the yearly humongous fraud committed by candidates.\nProfessor Ishaq Oloyede, registrar of the Joint Admission and Matriculation Board(JAMB) made the disclosure today in Enugu.\n“And we were able to detect this through NIN and now we have realistic number of JAMB candidates,” the registrar said.\nAccording to Oloyede, the board used 650 examination centres across the country, out of which, 30 centres have been delisted for performing below standard.\n“I want to commend the media for their criticism and support which made the 2021 UTME successful,” Oloyede said."
  },
  {
    "headline": "#LekkiMassacre: How Nigerian Army, Lagos Government Secretly Took 20 Corpses To State Pathologist",
    "summarized_story": "Following the October 20, 2020 gunshots, the Nigerian Army and the Lagos State Government conspired and surreptitiously transported 20 dead from the Lekki Tollgate to the state pathologist for autopsy, according to SaharaReporters.\nThe Lagos State Pathologist, Prof John Obafunwa, conveyed this revelation confidentially to members of the Lagos State EndSARS panel sitting in Lekki, according to a top source.\nThis is in addition to the 99 bodies they admitted to taking to the pathologist previously, three of which were from Lekki Tollgate, according to the source.\nOn June 5, Obafunwa, the Lagos State government’s consultant pathologist, first stated that between October 20 and 24, last year, 99 bodies were deposited in the mortuary of the Lagos State University Teaching Hospital.\nSoldiers from the 81 division’s Bonny Camp, however, attacked the Lekki tollgate, where some demonstrators had congregated, and fired rounds on October 20."
  },
  {
    "headline": "JUST IN: ISWAP attacks army base in Borno, takes over military weapons",
    "summarized_story": "Suspected Islamic fighters stormed into an army base in Maiduguri, Borno State to attack soldiers in a fresh attack.\nJihadists from the Islamic State West Africa Province (ISWAP) rolled up in a dozen gun trucks to attack the military base.\nThe attack NEWS DIRECT gathered occurred at Chobol town, Borno State.\n“Attackers can be seen with standard weapons (RPG-7 w/ OG-7V, AKM/S, Type 56 variants, Type 88 HMG, etc.\nThe operation carried out at the military base includes the capture and burning of at least 1 DICON Ezugwu MRAP."
  },
  {
    "headline": "Bandits Are Useful, Give Them Contracts To Secure Forests, Farmlands — Sheikh Gumi Tells FG",
    "summarized_story": "Sheikh Ahmad Gumi, an Islamic cleric, claims that security forces are collaborating with outlaws who are wreaking havoc across the country.\nGumi accused some security personnel of providing armed gangs a “easy landing” on Arise TV on Wednesday.\nGumi insisted on his demand for amnesty for the bandits, saying they are willing to surrender if the government provides them with a source of income.\nHe dismissed the amnesty granted to bandits by Katsina State Governor Bello Masari, describing it as “political amnesty” without any package.\n“When you grant a political amnesty, I mean amnesty in the front of the press and the media but in the real sense, there was no amnesty."
  },
  {
    "headline": "“VPN Exposes Your Data, Stop Using It To Access Twitter” — Lai Mohammed Warns Nigerians",
    "summarized_story": "Nigeria’s Minister of Information and Culture, Lai Mohammed, has issued a strong warning to Nigerians who visit Twitter over a virtual private network (VPN).\nLai Mohammed cautioned Nigerians not to use VPN to access Twitter in a new video published by OAK Tv.\nHe went on to say that VPNs can disclose all of one’s data, including bank account details, which is dangerous.\nNigerians should think of a method to create an app that can replace Twitter and be used by other countries, according to Lai Mohammed.\nWatch video below:Lai Mohammed advises Nigerians to stop using VPN to access Twitter 🎥: OAKTV pic.twitter.com/abSYhIjMUh — Gistlovers.blog1 (@Gistloversblog1) June 23, 2021"
  },
  {
    "headline": "2021: Senate set to approve N895.8bn supplementary budget",
    "summarized_story": "The Senate Wednesday passed for Second Reading a Supplementary Appropriation Bill of N895,842,465,917 forwarded to it on Tuesday by President Muhammadu Buhari.\nExpeditious consideration of the Bill followed its presentation to that effect in a lead debate by the Senate Leader, Senator Yahaya Abdullahi ( APC Kebbi North) during plenary.\nPresident Muhammadu Buhari had on Tuesday, requested the Senate to consider and approves the supplementary budget to help fight insecurity and purchase vaccines in tackling COVID- 19 pandemic.\nHe said the 2021 Supplementary Budget was needed to fund defence, security and health-related expenditure.\n“We propose to fund the balance of N722.4 billion for capital expenditure on defense and security and capital supplementation from new borrowings in the absence of any supplementary revenue sources”, he explained."
  },
  {
    "headline": "VIDEO: What Minister Sunday Dare told Odion Ighalo when ex-Super Eagles star came Calling",
    "summarized_story": ""
  },
  {
    "headline": "Pictures: NFF top shots watch as Super Eagles begin training ahead Mexico clash",
    "summarized_story": ""
  },
  {
    "headline": "APC Convention: Serving Niger Senator tipped to emerge Chairman -NigPilot",
    "summarized_story": "As preparation for the National Convention of the All Progressives Congress , APC, gears up, a chieftain of the party has revealed that a dark horse might emerge as the National Chairman of the party.\nThe chieftain who craved anonymity said that the dark horse is a serving Senator from Niger State.\nAccording to him, two aspirants have indicated interest from Niger State, a former Minister and Serving Senator but the lot favors the serving Senator.\nThey are all seeing to carry one baggage or the other that may affect the fortunes of the party come 2023.\nHowever, the APC Caretaker/Extraordinary Convention Planning Committee has not concluded the date for the National Convention as the proposed time table for the congresses is before the President, Muhammadu Buhari awaiting approval."
  },
  {
    "headline": "APC Convention: Serving Niger Senator tipped to emerge Chairman -NigPilot",
    "summarized_story": "As preparation for the National Convention of the All Progressives Congress , APC, gears up, a chieftain of the party has revealed that a dark horse might emerge as the National Chairman of the party.\nThe chieftain who craved anonymity said that the dark horse is a serving Senator from Niger State.\nAccording to him, two aspirants have indicated interest from Niger State, a former Minister and Serving Senator but the lot favors the serving Senator.\nThey are all seeing to carry one baggage or the other that may affect the fortunes of the party come 2023.\nHowever, the APC Caretaker/Extraordinary Convention Planning Committee has not concluded the date for the National Convention as the proposed time table for the congresses is before the President, Muhammadu Buhari awaiting approval."
  },
  {
    "headline": "Troops kill 20 terrorists in Lamboa forest -NigPilot",
    "summarized_story": "Director Army Public Relations, Brigadier General Onyema Nwachukwu made the disclosure in a statement.\nThe Army Spokesperson said, “Acting on credible intelligence, the troops with close air support from the Air Task Force component swiftly carried out a simultaneous land and air offensive, penetrating deep into Lamboa forest in Borno state.\nThe gallant troops over ran the position of the terrorists with heavy volume of fire from both land and air, killing over 20 insurgents.\nHe added that the Chief of Army Staff (COAS) Major General Faruk Yahaya has since congratulated the troops for the successful conduct of the operation.\nHe also enjoined the troops to sustain the ongoing offensive under Operation Hadin Kai, until the insurgents are completely surmounted."
  },
  {
    "headline": "Troops kill 20 terrorists in Lamboa forest -NigPilot",
    "summarized_story": "Director Army Public Relations, Brigadier General Onyema Nwachukwu made the disclosure in a statement.\nThe Army Spokesperson said, “Acting on credible intelligence, the troops with close air support from the Air Task Force component swiftly carried out a simultaneous land and air offensive, penetrating deep into Lamboa forest in Borno state.\nThe gallant troops over ran the position of the terrorists with heavy volume of fire from both land and air, killing over 20 insurgents.\nHe added that the Chief of Army Staff (COAS) Major General Faruk Yahaya has since congratulated the troops for the successful conduct of the operation.\nHe also enjoined the troops to sustain the ongoing offensive under Operation Hadin Kai, until the insurgents are completely surmounted."
  },
  {
    "headline": "Soldiers kill six terrorists in latest attack at Kumshe town -NigPilot",
    "summarized_story": "The Nigerian Army said that troops of Operation Hadin Kai killed six Boko Haram terrorists in a repel attack at Kumshe town.\nDirector Army Public Relations, Brigadier General Onyema Nwachukwu in a statement said the terrorists mounted on four Gun Trucks and several motorcycles attempted to infiltrate and attack the camp through the northern part of the troops’ deployment.\n“The terrorists mounted on 4 Gun Trucks and several motorcycles attempted to infiltrate and attack the camp through the northern part of the troops’ deployment, but were met with the fierce fire of the highly alert troops, resulting in the instant killing of 6 BHTs.\nHe said that the Chief of Army Staff, Major General Faruk Yahaya has lauded the troops’ high level of alertness and fighting spirit.\nThe COAS also urged them to sustain the momentum and ensure that the remnants of terrorists hibernating in the area are completely cleared."
  },
  {
    "headline": "Roof Leakage: No Money Released For Renovation Of National Assembly – Senate",
    "summarized_story": "The National Assembly has explained that no money was released for the renovation of the National Assembly complex.\nAlso, the lawmakers said the National Assembly and its leadership is not responsible for the maintenance and renovation of the National Assembly Complex and they have not received a sum of N37 billion or any amount for the renovation of the Complex.\nEven with this reduction, the sum of 9 billion or any amount is yet to be cash backed or released to the National Assembly.\nNone of this amount is even appropriated for the National Assembly bureaucracy or its leadership.\nIt must be reiterated that the National Assembly Complex is a National Monument which falls under the purview of control of the Federal Capital Development Agency."
  },
  {
    "headline": "Senate Threatens To Publish Names Of MDAs Who Failed To Appear Before Committee",
    "summarized_story": "The Senate has threatened to publish the names of government Ministries, Departments and Agencies who failed to appear before its public accounts committee to defend queries issued by the Auditor-General of the Federation.\nSenate President Ahmed Lawan issued the threat on Wednesday after the Chairman of the public accounts committee submitted the annual report of the Auditor-General of the Federation on the accounts of the federation for the year ended 31st December 2015.\nAccording to the report, the agencies which did not respond to the committee are the Nigeria Maritime Administration and Safety Agency (NIMASA), Federal Ministry of Health, Nigeria Police Force, Federal Fire Service, Ahmadu Bello University Teaching Hospital Zaria, Ministry of Police Affairs and Federal Ministry of Information.\nRead Also: ‘They Are Taking Us For Granted,’ Lawmaker Fumes Over Refusal Of IGP, CBN Gov, NSA Others To Appear Before NASSSome of the infractions in the report observed by the committee include withdrawal of funds from the executive from special fund accounts for purposes other than the objectives for which the funds were created, the prevalence of unwholesome financial practices by some principal revenue-generating agencies, deliberate delay in the submission of financial transcripts by the Accountant General of the Federation to the Auditor-General of the Federation and habitual late or non-submission of financial reports to the office of the Accountant-General of the Federation by MDA’s."
  },
  {
    "headline": "Akpabio Gives Date For Submission Of NDDC Forensic Audit To President Buhari",
    "summarized_story": "Minister of Niger Delta, Godswill Akpabio has revealed that President Muhammadu Buhari will receive the report of the ongoing forensic audit of the Niger Delta Development Commission (NDDC) next month.\nAkpabio indicated this while responding to questions from State House correspondents after a meeting with the Chief of Staff to the President, Ibrahim Gambari at the State House on Wednesday.\n﻿The Minister said much progress has been made on the forensic audit.\nAkpabio equally noted that he has been meeting with stakeholders in the region as a way of calming tension.\nHe also recommended that political leaders from other crisis-prone regions do the same to curb restiveness."
  },
  {
    "headline": "Majority Of Lekki Toll Gate Victims Had Fractures, Machete Wounds, Minor Injuries – Lagos HoS Tells Panel",
    "summarized_story": "As proof of this testimony, Mr Muri-Okunola showed the panel visuals and slides from the Lekki toll gate protests.\nHe also informed Lagosians that they were no casualties that had been recorded in the hospitals in the vicinity of the Lekki based on information from monitoring the incident.\nHe informed the governor that it was not his men at the toll gate as they also had been instructed to stand down.\n“We also directed the Commissioner of Health to start speaking to hospitals if there were casualties in the neighbourhood of the Lekki toll gate.\nMr Muri-Okunola’s testimony is coming against the background of a summons sent to him by the panel over the Lekki incident of October 20, 2020."
  },
  {
    "headline": "UK Man Jailed For Sharing Christchurch Mosque Videos",
    "summarized_story": "A 38-year-old British man was on Wednesday jailed for terrorism offences after sharing explosives manuals and extremist videos, including one apparently celebrating the New Zealand mosque massacres, on right-wing chat groups.\nA judge at Kingston Crown Court in southwest London jailed him for three-and-a-half years.\nNugent was arrested on August 19, 2020 and initially charged with 12 Terrorism Act offences.\nNugent pleaded not guilty to two counts of encouraging terrorism.\nThe judge however ruled that even though there was sufficient evidence for a prosecution there was no public interest in proceeding on those charges."
  },
  {
    "headline": "NAPTIP rescues Over 150 SGBV Survivors in Sokoto in 6 Months",
    "summarized_story": "A total of one hundred and fifty one Sexual and Gender Based Violence, SGBV survivors have been rescued by the National Agency for the Prohibition of Traffic in Persons NAPTIP in Sokoto state in the last six months.\nAn official of NAPTIP, Hassana Mikaillu says, one hundred and three of these survivors are girls and forty eight of them are boys all survivors of one form of abuse or the other.\nShe says the abuses range from sexual assault, unnatural offences, child labour, child trafficking and molestation and other emotional and physical assault of the children.\nAccording to her, most of the survivors have since been reunited with their parents after rehabilitation.\nShe however, commended Sokoto state governor Aminu Tambuwal who has severally given the organisation the needed support to carry out its assignment with a particular mention of his role in resolving a sexual assault case in the state."
  },
  {
    "headline": "Court remands 3 clerics, 1 other for spying on police facilities in Taraba",
    "summarized_story": "Three pastors and one member of the United Methodist Church in Nigeria (UMCN) were accused of spying on the premises of the state Police command and spreading the photos to foreign partners.\nIn a brief hearing, at the Justice Mahmud Mohammed National industrial/Magistrate court Jalingo, Magistrate Bartholome Vakkai Kaigama, said the accused: Rev.\nThe clergymen who protested the detention of their colleagues at the state high court premises accusing the police of conniving with a certain bishop to punish his perceived enemies.\nAdvertisementBut, the spokesman of Taraba State Police Command, Mr. David Misal said the Clerics were booked for secretly taking photographs of police properties, the Criminal Investigative Department (CID) and other sensitive locations.\nHe added that the police have no control over the legal proceedings of the court and cannot reverse the decisions of the court."
  },
  {
    "headline": "Alleged murder: Accused driver arraigned for killing LASTMA official in Lagos",
    "summarized_story": "A driver, Elijah Shokoya who allegedly killed an official of the Lagos State Traffic Management Agency, LASTMA, in Ketu has been arraigned before an Ikeja High Court.\nMr. Shokoya was arraigned on a one count charge of involuntary manslaughter, which he pleaded not guilty to.\nThe defendant is said to have crashed down the LASTMA official with his Opel Car with registration number AAA 74 GG.\nThe offence according to State violates Section 224 of the Criminal Law of Lagos State 2015 and is punishable under Section 229 of the same law.\nAdvertisementShe asked for a trial date and requested that defendant be further remanded at the correctional facility."
  },
  {
    "headline": "Fulani Bandits Are Not Aliens From Mars. They’re Nigerians, We Know Them: Sheikh Gumi",
    "summarized_story": "Nigerian Islamic cleric, Sheikh Ahmad Abubakar Gumi, has proposed that the Nigerian government should offer amnesty to criminal herdsmen engaged in banditry and kidnapping.\nAccording to Gumi, the banditry perpetrated by herdsmen in the northern part of the country is a result of neglect by the Nigerian state.\nGumi was on Wednesday a guest on ARISE NEWS’ Morning Show.\nThe bandits have been responsible for crimes including murder, rape and the kidnapping of schoolchildren across different parts of the country’s northern region.\nGumi who is widely accused of sympathising with terrorists, called for amnesty for the herdsmen who he says are ready to give up their arms if their demands are met."
  },
  {
    "headline": "Sheikh Gumi: Bandits Are Children, Just Like Their Abductees. Why Are They Not in School?",
    "summarized_story": "Nigerian Islamic cleric, Sheikh Ahmad Abubakar Gumi, has proposed that the Nigerian government should offer amnesty to criminal herdsmen engaged in banditry and kidnapping.\nAccording to Gumi, the banditry perpetrated by herdsmen in the northern part of the country is a result of neglect by the Nigerian state.\nGumi was on Wednesday a guest on ARISE NEWS’ Morning Show.\nThe bandits have been responsible for crimes including murder, rape and the kidnapping of schoolchildren across different parts of the country’s northern region.\nGumi who is widely accused of sympathising with terrorists, called for amnesty for the herdsmen who he says are ready to give up their arms if their demands are met."
  },
  {
    "headline": "At Some Point, Boko Haram Trusted Buhari to Negotiate on It’s Behalf: Sheikh Gumi",
    "summarized_story": "Nigerian Islamic cleric, Sheikh Ahmad Abubakar Gumi, has proposed that the Nigerian government should offer amnesty to criminal herdsmen engaged in banditry and kidnapping.\nAccording to Gumi, the Nigerian government should also negotiate with southeastern separatists, IPOB.\nUrging the government to embrace dialogue, he mentioned that Boko Haram had once shown willingness to negotiate an end to insurgency by trusting current Nigerian president, Muhammadu Buhari to negotiate on its behalf.\nAnother former president, Olusegun Obasanjo is another who he claims is open to dialoguing with Bandits to bring an end to terrorism in the country.\nGumi was on Wednesday a guest on ARISE NEWS’ Morning Show."
  },
  {
    "headline": "Nigeria: Amnesty for Killer Herdsmen Should Come with Rehabilitation and Social Amenities, Gumi Says",
    "summarized_story": "Nigerian Islamic cleric, Sheikh Ahmad Abubakar Gumi has said amnesty for bandits who he tagged herdsmen should include rehabilitation and provision of social amenities by the Nigerian government.\nThe bandits have been responsible for crimes including murder, rape and the kidnapping of schoolchildren across northern Nigeria.\nGumi who is widely accused of sympathising with terrorists, called for amnesty for the herdsmen who he says are ready to give up their arms of their demands are met.\nHe noted that herdsmen in across regions of the country are lynched, killed and their children are sometimes decapitated.\nAccording to him, governments’ at all level levels and well-meaning Nigerians should remain neutral to bring lasting peace to the issues of banditry and herdsmen attack."
  },
  {
    "headline": "Gumi: Criminal Herdsmen Controlling Land, Important to Nigerian Economy. They Can Be Forest Guards",
    "summarized_story": "Nigerian Islamic cleric, Sheikh Ahmad Abubakar Gumi, has proposed that the Nigerian government should offer amnesty to criminal herdsmen engaged in banditry and kidnapping.\nGumi said the herdsmen are controlling large chunks of land and thus, hampering Nigeria’s economy.\nThe bandits have been responsible for crimes including murder, rape and the kidnapping of schoolchildren across different parts of the country’s northern region.\nGumi who is widely accused of sympathising with terrorists, called for amnesty for the herdsmen who he says are ready to give up their arms of their demands are met.\nHe noted that herdsmen across regions of the country are lynched, killed and their children are sometimes decapitated."
  }
]