[
  {
    "headline": "Court stops Amaechi, AGF, BPP from appointing ICTN operators",
    "summarized_story": "A copy of the enrolled order was obtained by journalists in Abuja on Tuesday.\nThe order specifically restrained Medtech Scientific Limited and Rozi International Nigeria Limited (4th and 5th defendants) or their agents from parading themselves or functioning as operators of ICTN in Nigeria pending the hearing and determination of the motion on notice.\nJustice Okorowo granted the interim orders against the defendants pending the hearing and determination of the motion on notice filed by the plaintiffs.\nAccording to him, CASER was also concerned that Nigeria loses huge billions of dollars following the improper tracking of cargo exports and imports.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "COVID-19: Omicron spreading faster than Delta variant -WHO",
    "summarized_story": "The World Health Organisation says there is now “consistent evidence” that the Omicron variant was outpacing Delta, as COVID-19 continues to account for around 50,000 deaths worldwide every week.\n“There can be no doubt that increased social mixing over the holiday period in many countries will lead to increased cases, overwhelm health systems and more deaths.\n“However, WHO certified two countries – China and El Salvador – as malaria-free this year, and a further 25 are on track to end malaria transmission by 2025,” Ghebreyesus said.\nHe said the WHO also made an historic recommendation for broad use of the world’s first malaria vaccine.\n“When people can’t access the services they need, or can’t afford them, individuals, families, communities and entire societies are put at risk."
  },
  {
    "headline": "Electoral Bill: Reps in somber mood as Gbajabiamila receives, reads Buhari’s letter",
    "summarized_story": "…President reels out reasons for withholding assentBy Levinus Nwabughiogu-AbujaSpeaker, House of Representatives, Hon.\nFemi Gbajabiamila has formerly received and read the letter conveying President Muhammadu Buhari’s reasons for withholding his assent to the Electoral amendment bill.\nThis has confirmed media reports that the President had indeed rejected the bill.\nIn the letter, the President advanced a couple of reasons for withholding the signature.\nThe mood of the House can be described as somber as Gbajabiamila read the letter."
  },
  {
    "headline": "Strong, innovative think-tank panacea to national devt—Buratai",
    "summarized_story": "By Dapo AkinrefonNigerian Ambassador to Benin Republic, Lt Gen Tukur Buratai (retd), weekend, canvassed for strong and innovative think tank as a panacea to Nigeria’s development.\nHis words: “One may want to know why a retired General cum diplomat will decide to collaborate with a university to set up a think-tank like TBRC.\n“Let me make it categorically clear to us that one of the factors that helped the Organisation for Economic Cooperation and Development (OECD) countries is strong and innovative think-tanks.\nIn 1919, scholars like Lionel Curtis of the Oxford University spearheaded the establishment of a think-tank to explore international problems and advocate policy solutions.\nThere is no gainsaying the fact that leadership without well-informed and fool proofed policies will lack clear vision and direction."
  },
  {
    "headline": "FG closes N3.1trn 2021 domestic borrowing",
    "summarized_story": "DMO-debt management officeBy Victoria OjemeWith the latest N250 billion Sukuk, the Debt Management Office, DMO, has successfully brought to close, the sum of N3.143 trillion domestic borrowing contained in 2021 budget.\nAll of the domestic borrowings had been realised prior to now say for N250 billion, whose offer was unveiled to both institutional and private investors at an investors’ forum in Abuja, yesterday.\nThe ministry has road projects to construct across the six geo political zones of the country.\nThat has been extremely successful and has both the DMO as the face of government for borrowing and others.\nThe average citizen on the road has been impressed with what the Sukuk has contributed to the economic growth and development.”Vanguard News Nigeria"
  },
  {
    "headline": "Abia former commissioner, ex-NUJ president, Bonnie Iwuoha reportedly dead",
    "summarized_story": "By Steve OkoFormer Commissioner for Information, Abia State, Mr. Bonnie Iwuoha is dead.\nMr. Iwuoha, a former National President, Nigeria Union of Journalists, NUJ, reportedly died on Monday evening in Umuahia the state capital.\nDetails of his demise are still sketchy but there has been an outpouring of tributes on the WhatsApp platform of Abia NUJ since the news of his death filtered in.\nThe Isiala Ngwa-born Iwuoha, first served as Media Adviser to former Governor Theodore Orj before he was appointed Information Commissioner by Dr. Okezie Ikpeazu.\nDuring his tenure as the Managing Editor of Daily Times, Iwuoha led seven Presidential Monitoring Teams to seven states of Nigeria on inspection of DFRRI projects."
  },
  {
    "headline": "How PSC blew over N1bn unaccounted funds — Reps’ C’ttee",
    "summarized_story": "By Levinus Nwabughiogu – AbujaHouse of Representatives’ Committee on Public Accounts was miffed, yesterday, by how the Police Service Commission, PSC, spent alleged extra-budgetary spending and unaccounted funds to the tune of N1,066,398,223.The committee also discovered that some funds were paid into private accounts of some PSC officials.\nThe commission added that N1,853,456 received in 2015 was paid to one Mr. Asu James Ata as salary arrears.\nIt further stated that the N400m received in 2019 was to enable it to meet its statutory obligations.\nALSO READ: Police arrest 2 suspected kidnappers in Ogun“The PSC in 2019 received the sum of N400million to enable it meet it its statutory obligation.\n“The amount was paid to Vita Construction Limited, a contractor handling the construction of the Police Service Commission’s corporate head office."
  },
  {
    "headline": "Ogun people deserve better than you offer – Owu Chief, Aderinokun tells Gov Abiodun",
    "summarized_story": "The Akinruyiwa of Owu Kingdom, Chief Olumide Aderinokun, has called out the Governor of Ogun State, Prince Dapo Abiodun, over what he called “the low spate of development across the state,” especially in 2021, saying the people deserve better.\nIn a chat with DAILY POST in Abeokuta, the Ogun State capital, the property developer faulted Abiodun’s claim of building the future of Ogun people, asking him to show the basic amenities in each local government.\n“Overall, Ogun State can do better than what we have at the moment.\nThe Amosun administration touched road development across the three Senatorial Districts.\nOgun people truly deserve more than what Abiodun is offering them right now.”“It is another December to mark the end of 2021, how many achievements can you count in Ogun State aside from claims of road rehabilitation?"
  },
  {
    "headline": "Odili’s passport: Judge orders Malami to discipline Immigration’s lawyer for disobeying court order",
    "summarized_story": "The ruling was on an application by Ifedayo Adedipe (SAN), lawyer to a former Governor of Rivers State, Peter Odili, complaining of deliberate disrespect to the lawful order of the court.\nAdedipe had urged the court to among others, penalise Adamu for disrespecting the court and treating it with contempt.\nAdamu has been representing the NIS and its Director-General in a fundamental rights enforcement suit by Odili, with which he challenged the seizure of his international passport by the NIS.\nAdedipe noted that Adamu has failed to obey a subsisting order that the passport is deposited with the Registrar of the court pending the hearing of his motion for stay of execution.\nHe added that Adamu has consistently failed to attend court despite being served with a hearing notice in relation to his pending motion."
  },
  {
    "headline": "Giwa attack: Danmasanin Birnin-Gwari Kaduna laments loss of lives in agrarian communities",
    "summarized_story": "The Danmasanin Birnin-Gwari, Zubair Abdurra’uf Idris, has described as saddening, the loss of lives in agrarian communities in Giwa and Birnin Gwari local government areas of Kaduna State.\nIn a statement, he said the communities of Kauran Fawa, Marke and Ruhiya of Idasu Ward of Giwa Local Government Area have suffered from untold killings and arson by bandits.\nAccording to him, “let me register our heartfelt condolences to the people of Giwa Local Government Area over the cruel coordinated attack and killing of over thirty people by armed bandits.\n“The loss of innocent lives particularly the agrarian rural communities due to bandits activities is saddening and worrisome in this particular era of insecurity in Giwa, Birnin-Gwari and other parts of Kaduna State and the North.\n“Equally, our prayers and solidarity to the people of Giwa and Birnin-Gwari local government areas for God intervention and protection against the armed bandits.”"
  },
  {
    "headline": "Zamfara Gov, telecom networks dragged to court over network shutdown",
    "summarized_story": "Zamfara Circle, a civil society organization, has dragged mobile telecommunications service providers, comprising MTN, GLO, Airtel and 9mobile, to court, demanding N100 million as damages for the deliberate shutdown of their services in the state.\nThe suit has Zamfara State Governor, Bello Matawalle, Commissioner for Justice and Attorney-General of the state, and the National Communications Commission (NCC) as co-defendants in the suit.\nIn the motion filed in a court in the state capital, the plaintiffs said the shutdown of the network has brought suffering and losses to the subscribers.\nThe motion was brought in pursuant to Order 15 Rule 3 (1) of the High Court of Zamfara State (Civil Procedure) Rules 2014, sections 96, 97, 98 and 99 of the Sherriff and civil process Act, Cap 551, LFL 2004 as well as the inherent jurisdiction of the court.\nThe group is praying for the court to determine among others, whether there exists between the plaintiffs and the 4th, 5th and 6th Defendants, a binding contract for the provision of telecommunication services including internet and email."
  },
  {
    "headline": "Omicron: Jigawa rolls out COVID-19 booster vaccine doses",
    "summarized_story": "The Jigawa State Government has commenced the administration of COVID-19 booster vaccines for those who completed their first and second doses in the state.\nGovernor Mohammed Badaru Abubakar stated this after he received his booster dose of the AstraZeneca vaccine in Government House, Dutse.\nHe said it is pertinent to get the booster dose considering the new Omicron variant, which has forced some countries to impose another lockdown in major cities.\nGovernor Badaru however commended the people of the state for accepting the vaccine.\nHe also urged the people of the state to ensure they take the vaccine and take the booster for those who have completed their doses to protect themselves from getting infected by the virus."
  },
  {
    "headline": "‘Monarch accused me of being too stingy with money’",
    "summarized_story": "‘Monarch accused me of being too stingy with money’As governor of Osun State, Chief Bisi Akande had problems with the immediate past Ooni of Ife, Oba Okuade Sijuwade, and the Owa-Obokun of Ijeshaland, Oba Adekunle Aromolaran.\nHe also said Oba Aromolaran was always saying bad things about him because of his belief that he was stingy.\nI told him that Osun State had no money now to buy cars for traditional rulers.\n- Advertisement -“But his pestering was too much and I secretly sent money to him to buy a car.\nHe explained that the late Ooni wanted him to renew the Ede-Osogbo Waterworks which was to be repaired with $300 million."
  },
  {
    "headline": "‘I told Obasanjo he must be out of his mind when he blamed me for Ige’s murder’",
    "summarized_story": "‘I told Obasanjo he must be out of his mind when he blamed me for Ige’s murder’A former Osun State Governor Chief Bisi Akande has relived his confrontation with ex-President Olusegun Obasanjo when Chief Bola Ige (SAN) was murdered while serving as Attorney-General of the Federation and Minister of Justice.\nAkande, in his autobiography ‘My Participations’ said he had just returned from the United Kingdom when he was told of the murder.\n- Advertisement -“How can you say lapses in my security when Bola Ige was killed in Ibadan?\nI rule in Osun State!\n“It was President Obasanjo on the other end."
  },
  {
    "headline": "Akande: I’ve never seen anything genuine in Obasanjo",
    "summarized_story": "Akande: I’ve never seen anything genuine in ObasanjoA former Osun State Governor and first National Chairman of the All Progressives Congress (APC) Chief Bisi Akande has said he has never seen anything genuine in ex-President Olusegun Obasanjo.\nAkande, in his book, ‘My Participations’, narrated several instances of Obasanjo’s alleged attempts to bring him down.\nAkande said during the centenary celebration of the Baptist Church in Abeokuta, Obasanjo announced that he was “an example of a prudent and honest governor”.\n- Advertisement -“I have never seen anything genuine about him despite his self-glorification,” Akande wrote.\nHe accused Obasanjo of ordering that Osun State should be short-paid by N216 million monthly from the Federal Allocation."
  },
  {
    "headline": "Adebanjo: how l built my Lekki house",
    "summarized_story": "The Afenifere leader urged the anti-graft agency to probe how Akande built his houses at Ila, his home town in Osun State, and Ibadan, the Oyo State capital.\nDescribing Akande’s allegations as “malicious falsehood”, Adebanjo challenged the former Osun State governor to disclose how he got his own property as he had done.\nGiving details of how he built his house, Adebanjo said: “I deny the lie propagated by Akande.\nHe said: “On the Osun State Governor’s Office (Bola Ige House) contract, Chief Akande said I wrongly accused him of corruption in the construction of the Governor’s Office.\n“Chief Akande wrote on the Government House that he wanted to build on a site on Ilesa Road in Osogbo, which I stopped."
  },
  {
    "headline": "‘Tinubu refused to release Aregbesola to be my deputy’",
    "summarized_story": "Akande, in his book, ‘My Participations’, narrated how he came across Aregbesola and wanted him first as his deputy and possible successor.\nThat was how we linked up with Rauf Aregbesola,” Akande recalled.\nWhen Omisore was impeached, he discussed with Tinubu about having Aregbesola as his deputy.\n“I offered him the post of deputy governor which would be confirmed by the House of Assembly.\nHe added that Tinubu said after the election, Aregbesola would come to learn more about Osun and its politics."
  },
  {
    "headline": "Lawan confirms Buhari’s rejection of Electoral Amendment Bill",
    "summarized_story": "From Fred Itua, AbujaPresident of the Senate, Ahmad Lawan, on Tuesday, acknowledged the receipt of a letter from President Muhammadu Buhari, rejecting the Electoral Amendment Bill, 2021.\nBuhari, as already reported, cited many reasons for declining his assent.\nHe specifically referred to the expulsion of indirect primaries from the existing Act, insisting that many small political parties that are not financially buoyant, will be left in the cold.\nSpeaker of the House of Representatives, Femi Gbajabiamila, is the arrowhead behind the removal of indirect primaries and imposition of direct primaries.\nHe had also claimed that they had his blessing to settle for direct primaries only."
  },
  {
    "headline": "Electoral Bill: Senate receives Buhari’s letter declining assent, to discuss it this morning",
    "summarized_story": "The Senate President, Ahmad Lawan, has received President Muhammadu Buhari’s letter informing the National Assembly of his decision not to assent to the Electoral Amendment Bill.\nAs reported by Daily Sun on December 9, 2021, President Buhari declined to assent to the Bill citing reasons.\nSome of the reasons President Buhari gave in the letter to the National Assembly include the provision making direct primaries compulsory for political parties and insecurity.\nDaily Sun gathered that the letter from Buhari will be read on the floor of the Senate as soon as senators resume sitting any moment from now."
  },
  {
    "headline": "Buhari withholds assent from electoral bill",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaAs exclusively reported by the Daily Sun on Wednesday December 9, President Muhammadu Buhari has withheld his assent to the Electoral Act (Amendment) Bill 2021.\nBuhari also noted that adopting direct primaries has implications on the rights of citizens to participate in the government, as constitutionally insured.\nHe further stated that security agencies will also be overstretched, as direct primaries will be open to participation from all and sundry.\nMeanwhile, the Presidency has said the National Assembly is free to make public President Buhari’s reasons for withholding assent to the Electoral Act Amendment Bill 2021.\n“The President has sent a letter to the National Assembly stating his position on the bill amending the electoral act."
  },
  {
    "headline": "Protesters storm APC secretariat, insist on Feb. date",
    "summarized_story": "From Romanus Ugwu, AbujaProtesters yesterday stormed the All Progressives Congress (APC) secretariat in Abuja demanding that the February National Convention date remain sacrosanct.\nIn a big banner chronicling their demands, the protesters urged the Governor Mai Mala Buni-led Caretaker/Extraordinary Convention Planning Committee, to leave when the ovation is loudest.\nOur mission here is to press it on the leadership of the party to ensure that the National Convention is conducted unfailingly in February.\nThis comes as the APC Caretaker/Extraordinary Convention Planning Committee (CECPC) has said it will constitute sub-committees ahead of the proposed February 2022 National Convention of the party.\nIn a communique after a meeting at the party’s national secretariat, APC Caretaker Committee National Secretary, Sen John Akpanudoedehe, said that the party would engage critical stakeholders on issues that affect Nigerians."
  },
  {
    "headline": "Bandits seize N5m ransom bearer, 37 other abductees",
    "summarized_story": "From John Adams, MinnaThe impunity by armed bandits in Niger State continued, on Sunday, when they held back a man who took N5 million ransom to them and demanded additional N1 million and motorcycles for his release and 30 others still in captivity.\nThe bandits, after much pleading by the community, agreed to collect N5 million ransom for the release of 55 people, including women and children abducted from Zagzaga community in Munya Local Government Area of the state, last month.\nBut, last Sunday night, the unexpected happened as no fewer than 19 of the captives escaped from the bandits dean, including the man who took the ransom to them, leaving about 37 still being held.\nThe village head also confirmed that 19 people, including the man who took the ransom to the bandits, miraculously escaped from the bandits last Sunday night, adding that despite that, the bandits insisted that N1 million must be paid.\nThis is in addition to the eight people, four men and four women, who had earlier escaped two weeks ago."
  },
  {
    "headline": "Buhari Withholds Assent to Electoral Bill, Says Imposing Direct Primaries Undemocratic",
    "summarized_story": "He argued that direct primaries as envisaged by the Electoral Act (Amendment) Bill 2021 would significantly raise the cost of conducting primary elections by political parties and could have negative implications on the outcome of elections.\nPolitical party membership is a voluntary exercise of the constitutional right to freedom of association.\n“It is thus undemocratic to restrict the procedure or means of nomination of candidates by political parties, as it also amounts to undue interference in the affairs of political parties.\nWike: N’Assembly Can’t Veto Buhari’s Refusal to Sign Electoral BillRivers State Governor, Mr. Nyesom Wike, has said the National Assembly lacked the temerity to veto President Muhammadu Buhari’s withholding of assent tp the Electoral Act amendment bill.\nHis words: “What APC resolved in the meeting they had was that their problem is not necessarily direct primaries, but the electronic transmission of result in 2023."
  },
  {
    "headline": "Lagos Raises N137.3bn Through Bond to Finance Infrastructure Projects",
    "summarized_story": "These he listed to include the Lagos-Badagry Expressway, Lekki Regional Road, Rehabilitation of Ijeododo road and Rehabilitation of the alternative route to Admiralty Circle Toll Plaza.\n“The conclusion of this process will bring to N377.715 billion the total value of bond issued from the Lagos State N500 billion debt issuance programme.\n“In line with the state’s vision to build a Greater Lagos, the proceeds of the Bond will be used to finance key infrastructure projects, primarily in roads and healthcare.\nThese include the Lekki Regional Road, Rehabilitation of Ijeododo road and Rehabilitation of the alternative route to Admiralty Circle Toll Plaza.\n“We equally thank the investing community for their sustained support of Lagos State and our efforts to improve the social and economic welfare of all residents in Lagos."
  },
  {
    "headline": "NCDC Begins Campaign to Curb Omicron, Delta Variants’ Spread",
    "summarized_story": "According to the NCDC, Nigeria has recorded a 500 per cent increase in the number of confirmed COVID-19 cases over the past two weeks across the country due to the Delta and Omicron variants.\nA statement by the centre yesterday said the campaign tagged, “#TakeResponsibility campaign” first began in February, 2020It focuses specifically on measures Nigerians needed to take to protect themselves and loved ones from COVID-19 during this period.\n“Therefore, individuals, families and institutions also need to play their part in protecting each other by ensuring adherence to COVID-19 public health and social measures.\n“Critically, Nigerians are urged to adhere to recommended measures by NCDC and other public health authorities, as they celebrate Christmas and New Year,” it added.\nHe pleaded with residents of the Federal Capital Territory to minimise physical contacts and other non-pharmaceutical measures to control the spread of the virus."
  },
  {
    "headline": "Breaking: Buhari Writes National Assembly, Gives Reasons for Withholding Assent to Electoral Amendment Bill",
    "summarized_story": "Tobi SoniyiPresident Muhammadu Buhari has withheld his assent to the Electoral Act (Amendment) Bill 2021.\nIn a letter to the Senate President, Ahmed Lawan, exclusively obtained by THISDAY, the president said that prevailing situation in the country would not allow him to sign the bill.\nAmong other reasons for rejecting the bill, the president cited high cost of conducting direct primaries, the security challenge of monitoring the election, violation of citizens’ rights and marginalization of small political parties.\nThe president said that it would be better to allow each political party to determine its mode of selecting candidates for election.\n*Watch out for details on Arise TVShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Court Voids APC’s Participation in Anambra Guber Poll over Unlawful Primary",
    "summarized_story": "Disqualifies Andy UbaAlex Enumah in AbujaJustice Inyang Ekwo of the Federal High court, Abuja on Monday voided the participation of the All Progressives Congress (APC) in the just concluded Anambra governorship election.\nJustice Ekwo in a judgement held that the primary election of the APC that produced Senator Andy Uba as flag bearer of the party, substantially failed to comply with the electoral guidelines for the conduct of governorship primary election as well as the APC’s guidelines and constitution.\nThe judge subsequently disqualified Andy Uba and the APC from participating in the November 6 governorship poll, won by Professor chukwuma Soludo of the All Progressives Congress Alliance (APGA).\nDetails later.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Nnamdi Kanu Gets New Senior Attorney To Lead Defence Against Nigerian Government",
    "summarized_story": "Ifeanyi Ejiofor, the lead counsel to the detained leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu has said that an undisclosed senior attorney will henceforth lead the defence team of the pro-Biafra separatist leader.\nThe statement read, “We paid our routine visit to our untiring, unwavering, unrelenting, rock-solid and noble client, Onyendu Mazi Nnamdi Kanu, yesterday, at the DSS detention facility at Abuja.\nAlthough he was not oblivious of my arrangement to enlist the assistance and co-operation of a Senior attorney, he did not know that I could get a Senior attorney of the rarest breed.\n“I must state here and now that the Senior attorney involved has been my mentor over the years.\nHe has worked from the sidelines with our legal team since 2016."
  },
  {
    "headline": "BREAKING: Nnamdi Kanu Gets New Senior Attorney To Lead Defence Against Nigerian Government",
    "summarized_story": "Ifeanyi Ejiofor, the lead counsel to the detained leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu has said that an undisclosed senior attorney will henceforth lead the defence team of the pro-Biafra separatist leader.\nThe statement read, “We paid our routine visit to our untiring, unwavering, unrelenting, rock-solid and noble client, Onyendu Mazi Nnamdi Kanu, yesterday, at the DSS detention facility at Abuja.\nAlthough he was not oblivious of my arrangement to enlist the assistance and co-operation of a Senior attorney, he did not know that I could get a Senior attorney of the rarest breed.\n“I must state here and now that the Senior attorney involved has been my mentor over the years.\nHe has worked from the sidelines with our legal team since 2016."
  },
  {
    "headline": "Yahaya Bello Is The North Central Governor Who Made N60billion Cash Withdrawal From State Coffers–EFCC Sources",
    "summarized_story": "An investigation by SaharaReporters has revealed that Yahaya Bello of Kogi State is the governor whom the Economic and Financial Crimes Commission (EFCC) accused of withdrawing N60 billion cash from the coffers of his state.\nThe anti-graft agency had about a week ago accused a serving Nigerian governor of allegedly withdrawing N60 billion from his state’s purse, saying this was done in about six in office.\nThe EFCC, however, did not disclose the identity of the governor, but partially identified the governor as domiciling in the North Central region of the country.\nBut EFCC sources on Monday told SaharaReporters that the agency could authoritatively confirm that the governor accused of withdrawing N60 billion cash from his state’s purse is Yahaya Bello.\n“In one of them, a governor in a North-Central state within the last six years (one individual) has withdrawn over N60 billion in cash."
  },
  {
    "headline": "Yahaya Bello Is The North Central Governor Who Made N60billion Cash Withdrawal From State Coffers–EFCC Sources",
    "summarized_story": "An investigation by SaharaReporters has revealed that Yahaya Bello of Kogi State is the governor whom the Economic and Financial Crimes Commission (EFCC) accused of withdrawing N60 billion cash from the coffers of his state.\nThe anti-graft agency had about a week ago accused a serving Nigerian governor of allegedly withdrawing N60 billion from his state’s purse, saying this was done in about six in office.\nThe EFCC, however, did not disclose the identity of the governor, but partially identified the governor as domiciling in the North Central region of the country.\nBut EFCC sources on Monday told SaharaReporters that the agency could authoritatively confirm that the governor accused of withdrawing N60 billion cash from his state’s purse is Yahaya Bello.\n“In one of them, a governor in a North-Central state within the last six years (one individual) has withdrawn over N60 billion in cash."
  },
  {
    "headline": "Nigerian Cleric, Guru Maharaj Ji Reacts To Bisi Akande’s Book Causing Ripples Among Yoruba Leaders",
    "summarized_story": "He claimed on Page 415 that the 93-year-old Afenifere leader pestered Tinubu to build him (Adebanjo) the house in Lekki.\n“One day, Sir Olaniwun (Ajayi) was launching a book at Muson Centre, Lagos.\nAfter the book presentation, Tinubu said I should not go and that he would like to see me.\nReacting while briefing newsmen on Monday, Guru Maharaj ji advised Adebanjo and other Yoruba leaders to sheath their swords and extend love to one another.\n“Even if Baba Akande said that Tinubu built his (Adebanjo’s) house, he (Adebanjo) should have said yes, in the name of peace."
  },
  {
    "headline": "Aisha Buhari’s aide debunks pregnancy rumour",
    "summarized_story": "Sulaiman Haruna, the aide to Aisha Buhari, has denied rumours that the first lady is pregnant.\nAdvertisementPhotos of Aisha have been in circulation on social media in connection with insinuations that she’s with child.\nFollowing the development, rumours claimed that she was suffering an ailment while other social media users alluded to pregnancy.\nAdvertisement But in a chat with BBC Pidgin, Haruna denied the claims while stating that the first lady is “perfectly okay”.\nYou know, nowadays, people can tamper with photos.”AdvertisementBuhari got married to Aisha, 50, in December 1989."
  },
  {
    "headline": "Aisha Buhari’s aide debunks pregnancy rumour",
    "summarized_story": "Sulaiman Haruna, the aide to Aisha Buhari, has denied rumours that the first lady is pregnant.\nAdvertisementPhotos of Aisha have been in circulation on social media in connection with insinuations that she’s with child.\nFollowing the development, rumours claimed that she was suffering an ailment while other social media users alluded to pregnancy.\nAdvertisement But in a chat with BBC Pidgin, Haruna denied the claims while stating that the first lady is “perfectly okay”.\nYou know, nowadays, people can tamper with photos.”AdvertisementBuhari got married to Aisha, 50, in December 1989."
  },
  {
    "headline": "Lawan, Gbaja read Buhari's letter rejecting electoral bill",
    "summarized_story": "Senate President Ahmad Lawan on Tuesday read a letter by President Muhammadu Buhari rejecting the electoral act amendment bill.\nAdvertisementIn November, the national assembly transmitted the bill to the president for his assent.\nCompulsory direct primaries for political parties and electronic transmission of election results are among the amendments proposed by the national assembly.\nThe president said the amendment may open up the electoral system to a plethora of litigations based on diverse grounds and issues of law, adding that adopting direct primary violates spirit of democracy.\nThe letter was also read on the floor of the house of representatives by Femi Gbajabiamila, the speaker."
  },
  {
    "headline": "Lawan, Gbaja read Buhari's letter rejecting electoral bill",
    "summarized_story": "Senate President Ahmad Lawan on Tuesday read a letter by President Muhammadu Buhari rejecting the electoral act amendment bill.\nAdvertisementIn November, the national assembly transmitted the bill to the president for his assent.\nCompulsory direct primaries for political parties and electronic transmission of election results are among the amendments proposed by the national assembly.\nThe president said the amendment may open up the electoral system to a plethora of litigations based on diverse grounds and issues of law, adding that adopting direct primary violates spirit of democracy.\nThe letter was also read on the floor of the house of representatives by Femi Gbajabiamila, the speaker."
  },
  {
    "headline": "Trump booed by crowd after revealing he took COVID vaccine booster",
    "summarized_story": "Donald Trump, former US president, was booed by an audience on Sunday when he revealed that he had received a booster shot of the COVID-19 vaccine.\nAdvertisementTrump made the comments during the final stop of his tour with Bill O’Reilly, former Fox News host in Dallas.\nDon’t let them take that away from you.”AdvertisementIn October, Trump, in an interview with Yahoo Finance Live, had said he got vaccinated with the Pfizer COVID-19 vaccine and would consider taking the booster shot.\nIn March, an adviser of Trump had told NBC News that the former US president and Melania Trump, his wife, quietly received COVID-19 vaccine in January, though the type of vaccine they received was not known.\nAsked if he will get the booster shot, Trump said: “If I felt that it was necessary and let’s see where this whole thing is going.”AdvertisementIn August, Trump’s supporters booed him at a rally in Alabama, after he recommended that they should take the COVID-19 vaccine."
  },
  {
    "headline": "Inside TeamApt: How an upstart overturned competition to dominate agency banking",
    "summarized_story": "After the $5.5 million raise, TeamApt had cash in the bank to place orders for terminals in China and invaded the Nigerian market.\nTo improve the reliability of its product, TeamApt introduced to the market a 24-hour resolution service for false debit card withdrawals.\nTosin Eniolorunda, founder and CEO of TeamApt, champions the thought process and is instilling it into the company culture.\nWith TeamApt seemingly to be crowned with unicorn status, the company now has its eyes on digital banking but with a slant.\nSo, we will be launching a hybrid credit-led banking solution that also caters to the offline market,” Eniolorunda concludes."
  },
  {
    "headline": "Koniku closes Series A round led by Nigeria-based Platform Capital",
    "summarized_story": "Koniku Inc., a Nigerian-founded biotech company that operates out of California, on Friday said it has closed a Series A financing round led by Nigeria-based private equity firm, Platform Capital Investment Partners.\nIn the wake of the fresh investment, four new members will be joining the company’s board of directors, including Akintoye Akindele, Chairman and CEO of Platform Capital.\nThe company’s technology combines traditional computer cells with living biological neurons to give computers power to detect odours.\nBeyond security and healthcare, Konikore has broad applications in industrial monitoring, energy, food and agriculture sectors, and more.\nThe founder is also African, intelligent, passionate, and committed to the Koniku vision,” Dr. Akintoye told TechCabal in an interview, explaining the rationale behind backing Koniku for a second time."
  },
  {
    "headline": "Want luxury fashion? Play Africa’s first metaverse crypto game",
    "summarized_story": "Digital fashion can be in the form of digital fashion conceived to produce physical garments or fashion that a person can wear only with augmented or virtual reality.\nA product of digital fashion, hyper-real fashion, is used to explain the use of tech to virtually showcase fashion products.\nThis was how Thrill Digital started Astra, a fashion crypto game where players can win real-life fashion luxury items.\nThe game would have its own crypto token, which must be connected to a crypto wallet like the popular crypto game, Axie Infinity.\nThe leading crypto game has raked in $84.9 million in funds, making its protocol profit one of the biggest in the market."
  },
  {
    "headline": "Ventures Platform launches a $40m fund, invites Seni Sulyman as venture partner",
    "summarized_story": "A sizable portion of the fund comes from local partners, Ventures Platform told TechCabal.\nThis new capital injection will enable Ventures Platform to double down on existing investments in its category-leading portfolio via subsequent rounds.\nAs part of a move to further deepen its expertise, Ventures Platform has also onboarded leading figures across African tech as Venture Partners, including Seni Sulyman (ex-VP at Andela, founder at Black Ops.)\nThis transparency helped ventures attract talents like Kayode Oyewole, partner at Ventures Platform and Fola Olatunji-David, who later left the firm to become Head of Startup Success and Service at Google.\nThis happened because people who were impressed with the performance of the firm’s portfolio companies wanted to invest in Ventures Platform."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "After 5 reluctant years of bootstrapping, CinetPay is closing in on Francophone Africa dominance",
    "summarized_story": "“We saw that we have a good opportunity with mobile money because many people have mobile money accounts.\nCinetPay has been Flutterwave’s Francophone Africa partner since 2019.\nA little bit more detail about CinetPayCinetPay helps merchants in the Francophone Africa region accept and collect online payments from mobile money wallets in nine countries.\nAccording to the Francophone Africa and the Equality Challenge 2019 Report by the University of Chester Area Studies Research Group, female literacy rates in Francophone Africa have not been growing consistently, with outdated datasets being used for policy making and decision making.\nThe plan for now, though, is to focus on consolidating their hold in Francophone Africa."
  },
  {
    "headline": "Here’s to more stormy years with plenty of wins",
    "summarized_story": "MAX raises $31 million for its electric vehicle subscriptionSource: MAX.ng TwitterNigerian mobility startup, Metro Africa Xpress (MAX) has closed a $31 million Series B funding round.\nThe startup also moved into Nigeria’s capital market after completing the issuance of a ₦400 million ($1 million) bond in September 2020.\nMaxAB’s $55m Series A, MNT-Halan’s $120m, Paymob’s $18m Series A, and Trella’s $42 million Series A made the highlights.\nGenerally, it’s a good year for Africa’s startup funding scene.\nTechpoint Africa Techpoint Africa is a digital media company that amplifies the best innovations out of Africa through its media, data, and events."
  },
  {
    "headline": "Blockchain-powered music and bigger investments: The next frontier for music tech",
    "summarized_story": "But after a closer look and talking to some of the industry’s brightest, the signs are there — the next frontier for music tech may be closer than we imagine.\nUltimately, he believes the music industry is worthy of the same attention investors pay to fintech or healthtech, for example.\nWhile Nigeria cannot boast such levels of investment, the state of the music industry signals that more investments could have a positive impact on the economy.\nIn terms of revenue, the music industry raked in $40 million in 2021.\nAdetunji and Okpala are optimistic about the future of African and Nigerian music, one where tech will definitely determine what the next frontier will be."
  },
  {
    "headline": "Is Flour Mills deal to acquire Honeywell made in heaven?",
    "summarized_story": "The expected combination of Flour Mills Nigeria (FMN) and the flour mills unit of Honeywell Flour Mills plc (HFMP) will form a formidable entity and an unassailable market leader in the agro-allied sector in Nigeria, according to industry players and market analysts.\nLast month, Flour Mills announced it had reached a deal to acquire the flour mills business of Honeywell in an N80 billion deal that will significantly enhance its market leadership.\nIn full year ended March 2021, the turnover for the two was N771.6 billion for Flour Mills and N109.59 billion for Honeywell Flour, and the combination will see FMN emerge as a true continental giant, amassing substantial value for shareholders and huge economic benefit for Nigeria.\nRead Also: Honeywell, Flour Mills N80bn merger to boost Nigeria’s food productionFMN, established in 1960, prides itself of being in the vanguard of feeding the nation for the past 60 years.\nUnder the deal, Honeywell Group will dispose of a 71.69 percent stake in its flour business to FMN based on an enterprise value of N80 billion and subject to approval from the appropriate regulators."
  },
  {
    "headline": "The many legal battles of Ecobank and Honeywell",
    "summarized_story": "On October 16, 2015, Ecobank filed two separate suits before Justice Abang.\nSensing that Ecobank’s lawyers might be attempting to use the administration of justice to blackmail Honeywell into submission, on April 7, 2016, Honeywell petitioned the Legal Practitioners Disciplinary Committee also known as the Body of Benchers.\nHoneywell is also in court pressing damages claim against Ecobank for harm to its interests arising from the ex-parte order granted against it and which has now been made voided by courts including the Supreme Court.\nOn July 13, 2018, justices of the Supreme Court made two rulings, both in favour of Honeywell.\nHoneywell is now asking that the court compel Ecobank to deposit the $28 million proceeds from the share sale into the accounts of the court until the determination of the substantive suit brought by Honeywell."
  },
  {
    "headline": "Traditional hospital appeals for increased subvention, occupational therapy for patients – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestUgbokhirima – The management of foremost traditional healing home in Orhionmwon local government area, Ogieva Traditional Hospital have appealed to the Edo state government to increase the subvention for the facility to enable it meet up with current economic realities.\nDr. Ogieva further appealed for occupational therapy for patients, to enable them recuperate faster from their mental illness, maintaining that some of them have been long treated and are fit to be integrate back into the society.\nWith occupational therapy, they can learn and have something doing for themselves.\n“From the little we get as subvention we still manage to feed them.\nGovernment can train them on bricklaying, carpentry, block moulding, vulcanizing, infact anything that can make them useful, because they are just here despite treated”."
  },
  {
    "headline": "Obaseki: We’re leveraging technology, data to drive governance in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government is committed to building physical and digital infrastructure to drive sustainable growth and development in the state.\nObaseki, who spoke to journalists in Benin City, said his administration is leveraging technology and data to drive governance and create a workplace that inspires and motivates the state’s civil and public service to work for the Edo people.\nAccording to him, “In Edo State, we are focused on 12 thematic areas, which include reforms of government structure, making government the enabler in the society, creating a citizen-centric leadership structure and utilizing technology and data to drive governance.\nWe are also ensuring that the government focuses on sustainable economic growth and building the physical and digital infrastructure that we require for our growth.”Obaseki added, “The governance reforms pillar in our agenda is the pivot on which other pillars revolve.\n“We are utilizing technology and creating a workplace that inspires and motivates our public servants to work for Edo people.”..."
  },
  {
    "headline": "Obaseki urges love as Edo hosts students to carol of nine lessons – Nigerian Observer",
    "summarized_story": "Obaseki urges love as Edo hosts students to carol of nine lessonsShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Monday, led other top government functionaries to a special Christmas carol of nine lessons organised for students drawn from various schools across the state, with a charge for the students to show love to one another.\nThe carol in its maiden edition featured special performances from various musical, dance and choreography groups.\n; Chief of Staff to the Governor, Osaigbovo Iyoha; Edo State Chief Judge, Joe Acha; Commissioner for Local Government, Monday Osaigbovo, and Chairman of the Edo State Peoples Democratic Party (PDP), Dr. Anthony Aziegbemi, among others.\nThe event, organized by Edo State Ministry of Education, was held at Imaguero College in Benin City.\nIn his opening remark, a student of Edo College, Osayomore Osayuki, thanked the Obaseki-led state government for the love it has continued to show Edo children."
  },
  {
    "headline": "How we tackled illegal migration, trafficking with job creation-Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has revealed how his administration’s job creation initiatives and entrepreneurship programmes helped the government address the scourge of illegal migration and human trafficking among youths in the state.\nThe governor said his administration has made remarkable success in tackling human trafficking and illegal migration, noting that the government traced its root causes to address it.\nThe governor further stated, “Lack of job increased the problem of human trafficking.\nSo, while campaigning, I did what most politicians would not do; I campaigned with job creation, promising to create 200,000 jobs.\nFive years running now, we have done well in terms of job creation for Edo people.”“For any community to be great, the young people must be very hopeful."
  },
  {
    "headline": "NCC sets new Mobile International Termination Rate for voice services paid by overseas telco carriers",
    "summarized_story": "The Nigerian Communications Commission (NCC), has determined the new International Termination Rate (ITR) for voice services paid by overseas telecom carriers for terminating international calls on local networks in Nigeria at $0.045.\nAccording to him, “The new rate is contained in the ‘Determination of Mobile International Termination Rate’ issued by the Commission on November 25, 2021.\n“No licensee shall charge and or receive effective rate per minute below determined ITR floor rate.\n“However, while the ITR only pertains to the cost of bringing traffic into Nigeria, Nigerian operators will continue to pay the regulated Mobile Termination Rate (MTR), the local termination rate among themselves.\n“The subsisting regime of interconnection rates was sustained by the Commission’s Mobile (voice) termination rate issued on June 1, 2018."
  },
  {
    "headline": "Suspected herders kill 45 farmers in Nasarawa",
    "summarized_story": "Suspected herdsmen on Friday, through Sunday, killed over 45 farmers, while injuring scores following renewed hostilities in Lafia, Obi and Awe local government areas of Nasarawa State.\nThe following day, it was gathered there were reprisals by herdsmen in more than 12 communities across the three local government areas of the state.\nAlhaji Abdullahi Sule, who visited the affected areas on Monday, condemned the act, describing the killings as senseless and barbaric.\nHe tasked security agencies to fish out the perpetrators of the act, saying all those involved would not be spared.\nSule also called on the communities to live in peace, saying without peace, there would not be development."
  },
  {
    "headline": "Fraud Allegations: ICPC clears ex-NIPC boss, Yewande Sadiku",
    "summarized_story": "Former CEO and executive secretary of the Nigerian Investment Promotion Commission (NIPC), Yewande Sadiku, has been cleared by the Independent Corrupt Practices and Other Related Offences Commission (ICPC).\nThe anti graft agency said it was unable to establish allegations of corruption against Sadiku.\nHowever, Akeem Lawal, ICPC director of operations, in the letter, said the allegations couldn’t be substantiated.\n“Upon investigation, none of these allegations was established, and the striking out of suit No FAC/ABJ/CS/249/2019 by his lordship, Hon.\nSadiku, who was appointed executive secretary/CEO of NIPC in 2016, completed her five-year tenure in September."
  },
  {
    "headline": "Lagos raises N137.328b bond to fund infrastructural projects",
    "summarized_story": "This follows the meeting of all statutory instruments that will facilitate the raising of the 13% fixed rate bond by the Lagos state government from the capital market.\nThe signing ceremony finalises the issuance of N137.3 billion bond at 13 per cent fixed rate in our Series IV Bond Issuance under the N500 Billion Fourth Debt Issuance Programme,” he said.\nThis is a strong response from the investing community to our administration’s debut bond issuance.\n“In line with our vision to build a Greater Lagos, proceeds from this bond will be used to finance infrastructure projects, primarily in roads, environment and healthcare.\nThis is undoubtedly another momentous transaction for Lagos.”The Lagos State Attorney-General and Commissioner for Justice, Mr. Moyosore Onigbanjo, SAN, was represented at the occasion by the Permanent Secretary of the ministry, Mrs. Titilayo Shitta-Bey."
  },
  {
    "headline": "SFH Links Rising Gender-based Violence To Economic Crisis",
    "summarized_story": "The Society for Family Health (SFH), has identified economic challenges as major threat to the fight against gender-based violence (GBV).\nDeputy managing director of the society, Dr Jennifer Anyanti, stated this as the group ended its activities towards marking the 16 Days of Activism Against Gender-Based Violence.\nAnyanti noted that COVID-19 brought along some economic challenges due to the attendant lockdown and restrictions which were initiated to check the spread of the virus.\n“we cannot hide ourselves from the act that Covid-19 has brought along some economic challenges.\n“We as Family Health Society are trying to encourage people who faced violence to speak out and discuss with friends, neighbors and family members."
  },
  {
    "headline": "DSS Denies Diverting N4m Feeding Money For El-Zakzaky, Wife While In Detention",
    "summarized_story": "El-Zakzaky had in an interview with a national daily alleged that himself and his wife were both feeding themselves during their five-year incarceration at a DSS facility.\nBut DSS spokesperson, Dr Peter Afunanya, said: “this is a complete falsehood spread by someone desirous of maligning a noble organisation like the DSS.\n“The real truth is that all through our detention we fed ourselves.\nFor the entire five years, seven months that we were in detention, we fed ourselves; nobody gave us a bottle of water!\nWe bought our own generator in Abuja, even when we were in detention and we were buying fuel to run it.”ADVERTISEMENT"
  },
  {
    "headline": "INEC Seeks N305bn For 2023 Elections",
    "summarized_story": "The Independent National Electoral Commission (INEC) has tabled before the National Assembly a request for N305billion as its projected expenditure for the 2023 general elections.\nWe made a submission for N305bn for the 2023 general elections in a very comprehensive 22-page document with 260 budget lines.\nIn making case for more releases from the outstanding N205bn balance, Prof Yakubu informed the lawmakers about the activities that must be carried out ahead of the 2023 general elections.\n“What we have done is to look at the activities that we have to conduct before the general elections.\nPrinting of the permanent voter’s card would have to be concluded before the elections and then some of the critical election technology for the 2023 general election must be concluded and procured before the elections,” he explained."
  },
  {
    "headline": "INEC Seeks N305bn For 2023 Elections",
    "summarized_story": "The Independent National Electoral Commission (INEC) has tabled before the National Assembly a request for N305billion as its projected expenditure for the 2023 general elections.\nWe made a submission for N305bn for the 2023 general elections in a very comprehensive 22-page document with 260 budget lines.\nIn making case for more releases from the outstanding N205bn balance, Prof Yakubu informed the lawmakers about the activities that must be carried out ahead of the 2023 general elections.\n“What we have done is to look at the activities that we have to conduct before the general elections.\nPrinting of the permanent voter’s card would have to be concluded before the elections and then some of the critical election technology for the 2023 general election must be concluded and procured before the elections,” he explained."
  },
  {
    "headline": "ACF Tackles Buhari, Northern Govs Over Continued Killings In North",
    "summarized_story": "Worried by the continued killings in Nigeria and northern Nigeria in particular, the apex northern socio-political group, Arewa Consultative Forum (ACF), has taken a swipe at President Muhammadu Buhari and all the northern governors.\n“The President and the northern governors are unwittingly creating the impression that only their lives, those of their immediate family members and their offices matter.\n“The ACF believes the President and the northern governors have the capacity to do better than this.\nADVERTISEMENT“The Arewa Consultative Forum will like to put on record its total disapproval, frustration and anger agaisnt what appears to be an endless orgy of killings in Northern Nigeria.\n“The people affected by these savage attacks are thus left to think that their lives don’t count,” ACF stated."
  },
  {
    "headline": "IGP orders investigations into alleged extortion of N22m worth of Bitcoin",
    "summarized_story": "This follows the setting up of a Special Investigation Panel by the Inspector General of Police, IGP Usman Alkali Baba, psc (+), NPM, fdc to carryout a discreet and transparent investigation into the allegation.\nConsequently, DSP Cordelia and the other Police personnel allegedly indicted in the report, have been ordered to report to the Special Investigation Panel, Force Headquarters, Abuja, on Tuesday, 21st December, 2021 to answer to the allegations against them.\nThe Special Investigation Panel is headed by DCP Olaolu Adegbite, MFR, of the Force Intelligence Bureau (FIB).\nAn experienced and detailed investigator, he is expected to bring his vast knowledge in investigating corruption-related cases to bear in resolving this case.\nMembers of the public are enjoined to remain calm as the Force will provide timely updates and make the outcome of the investigation public."
  },
  {
    "headline": "IGP orders investigations into alleged extortion of N22m worth of Bitcoin",
    "summarized_story": "This follows the setting up of a Special Investigation Panel by the Inspector General of Police, IGP Usman Alkali Baba, psc (+), NPM, fdc to carryout a discreet and transparent investigation into the allegation.\nConsequently, DSP Cordelia and the other Police personnel allegedly indicted in the report, have been ordered to report to the Special Investigation Panel, Force Headquarters, Abuja, on Tuesday, 21st December, 2021 to answer to the allegations against them.\nThe Special Investigation Panel is headed by DCP Olaolu Adegbite, MFR, of the Force Intelligence Bureau (FIB).\nAn experienced and detailed investigator, he is expected to bring his vast knowledge in investigating corruption-related cases to bear in resolving this case.\nMembers of the public are enjoined to remain calm as the Force will provide timely updates and make the outcome of the investigation public."
  },
  {
    "headline": "Tears as former NUJ President Bonnie Iwuoha dies",
    "summarized_story": "The Nigeria Union of Journalists (NUJ) has lost one of its comrades, Bonnie Iwuoha.\nIwuoha, a former National President of NUJ and former Commissioner for Information in Abia State, died on Monday evening in Umuahia, the Abia State capital, family sources said.\nComrade Iwuoha held several leadership positions in and outside the media.\nUntil his dead, he was a Special Adviser, Media to the Abia State Governor, Okezie Ikpeazu.\nHis last major media engagement was as Chairman, Screening and Election Committee of the Nigerian Guild of Editors (NGE) at the 40th Biennial Convention of the guild held in Kano in June this year."
  },
  {
    "headline": "Tears as former NUJ President Bonnie Iwuoha dies",
    "summarized_story": "The Nigeria Union of Journalists (NUJ) has lost one of its comrades, Bonnie Iwuoha.\nIwuoha, a former National President of NUJ and former Commissioner for Information in Abia State, died on Monday evening in Umuahia, the Abia State capital, family sources said.\nComrade Iwuoha held several leadership positions in and outside the media.\nUntil his dead, he was a Special Adviser, Media to the Abia State Governor, Okezie Ikpeazu.\nHis last major media engagement was as Chairman, Screening and Election Committee of the Nigerian Guild of Editors (NGE) at the 40th Biennial Convention of the guild held in Kano in June this year."
  },
  {
    "headline": "How to know you have Omicron",
    "summarized_story": "With Omicron spreading round the world, scientists offer tell tale signs to know if one has contracted it.\nResearch into Omicron has revealed that the super mutant variant shows different symptoms from previous variants such as Delta.\nIt has also been revealed that 89% of those infected with the Omicron coronavirus variant show the same “initial” sign.\nBesides, being more similar to a common cold, Omicron symptoms have also been described as being far more mild by South African doctor Angelique Coetzee.\nShe said that some patients infected with Omicron – especially those who are unvaccinated – seem to suffer from intense headache and sore muscles (myalgia)."
  },
  {
    "headline": "Divorce-seeking cop changes mind",
    "summarized_story": "By Deborah AkpedeA divorce-seeking cop, Mr Rafiu Ademola, who earlier accused his wife of infidelity in an Igando Customary Court in Lagos, has made a volte face.\nWhen the case came up on Tuesday for judgment, Ademola, came up with a letter, informing the court of his intention to withdraw the case.\n“As a result of the intervention and counselling from the court, I have decided to forgive my wife and discontinue the case,” Ademola said.\nThe News Agency of Nigeria (NAN) reports that the 45-year-old petitioner had initially told the court that his wife, Rashidat, of 14-years was promiscuous.\n“I transferred all the chats into my phone as evidence.”He also accused his wife of being lazy."
  },
  {
    "headline": "Proceed On Leave Until Further Notice, Aisha Buhari Tells Staff",
    "summarized_story": "First Lady of Nigeria, Aishat Buhari as ordered all staff to go on leave till futher notice.\n“This serves to inform all staff that the office of the First lady will be closed for the upcoming festive period of Christmas and New year.\nTo this end, all staff are requested to proceed on leave, untill further notice.\nPlease note that Official engagements and work can also continue virtually as it was done previously”Her Excellency also appreciates and thank all staff for their commitment and hard work and wish all a happy festive period ahead.\nDr Mohammed KamalSSA to the President on Health and Development Partners office of the First Lady Federal Republic of Nigeria"
  },
  {
    "headline": "PDP Chieftain, Usman Decries Insecurity In Kaduna, Govt Inaction",
    "summarized_story": "Alhaji Lawal Adamu Usman, a Peoples Democratic Party (PDP) chieftain and senatorial contender for Kaduna Central in the 2019 elections, has expressed his disgust with the killing of hundreds of people by bandits in attacks on multiple towns in Kaduna State’s Giwa Local Government Area.\nAlhaji Usman, speaking to DAILY POST in Kaduna on Monday, said the escalation of the security situation in Kaduna State was owing to the state government’s lightness and condescension in managing the situation under Nasir El-rufai.\nHe believes that every community in Kaduna State and everywhere should reinvigorate their collective resolve to put an end to senseless killings, emphasizing that this is the finest approach to assist in alleviating the suffering of the afflicted families.\n“I share the anguish of the bereaved and displaced families, as well as the entire inhabitants of the devastated villages of Ruheya, Kauran Pawa, Marke, and Idasu Gari,” he said.\nHe chastised the government and security personnel for not going after the deadly bandits’ hideouts and for responding slowly to distress cries from vulnerable areas."
  },
  {
    "headline": "20 Farmers Killed, 5,000 Displaced As Herders Attack Nasarawa Communities",
    "summarized_story": "A feud between farmers and herders in Nasarawa State’s Lafia, Obi, and Awe local government areas has reportedly resulted in the deaths of 20 persons and the injuries of 27 others.\nAccording to the Daily Trust, at least 5,000 farmers have been displaced as a result of the attacks in the three local government regions, according to a source.\nSome of individuals who were injured are being treated in hospitals in the Obi, Lafia, and Awe local government areas, according to reports.\nASP Ramhan Nansel, the Police Public Relations Officer for the Nasarawa State Command, confirmed that a report was filed on Friday.\n“Relief materials will be sent to displaced persons and government will work with all stakeholders to ensure that they return to their communities and businesses as soon as possible,” he added."
  },
  {
    "headline": "Buhari Govt Values Cows More Than Human Lives — Pastor Ibiyeomie",
    "summarized_story": "Pastor David Ibiyeomie of the Salvation Ministries has condemned the current situation of insecurity in Nigeria under President Muhammadu Buhari’s administration.\nIbiyeomie criticized the Buhari-led government’s decision to place a higher value on cows than on human life.\nThat is why you need protection, especially this part of the world like Nigeria where people value cows more than humans.\n“I have not seen one Boko Haram man convicted, not one.\nIf you say you want to attack the Boko Haram, you may be the victim they want to attack."
  },
  {
    "headline": "Happening now: Uncertainty as Senate goes into closed door session over Electoral bill",
    "summarized_story": "The Senate at plenary has gone into closed-door session over refusal of President Muhammadu Buhari to sign lingering Electoral bill into law.\nIt is yet to be seen if lawmakers will veto the President’s power or not.\nDetails loading…"
  },
  {
    "headline": "Electoral bill: Buhari reveals reason for withholding assent, INEC seeks N305bn for 2023 elections",
    "summarized_story": "The Independent National Electoral Commission (INEC) has tabled before the National Assembly N305billion as projected expenditure for the 2023 general elections.\nIn 2018, President Buhari failed to assent to the bill as amended then with the excuse that the time was too close to the 2019 general election.\nPrior to the end of the 30-day period, a presidential spokesman, Malam Garba Shehu, had said President Buhari was not under obligation to publicly declare his decision on the Bill.\nWe made a submission for N305billion for the 2023 general elections in a very comprehensive 22-page document with 260 budget lines.\n“What we have done is to look at the activities that we have to conduct before the general election."
  },
  {
    "headline": "APC mum on convention date, sets up budget committee, others",
    "summarized_story": "The ruling All Progressives Congress (APC) Monday commenced process leading to the national convention of the party by setting up sub-committees on budgeting and other relevant structures.\nAlthough the party proposed February 2022 for the exercise, it was however still silent on the specific date of the national convention.\nThese were the highlights of a meeting of the party’s Caretaker/Extraordinary Convention Planning Committee (CECPC) in Abuja.\nSpeaking to journalists at the end of the closed-door meeting, APC National Secretary Senator John James Akpanudoedehe said the meeting deliberated on the national convention and decided to set up committees on budget and other relevant structures.\nAkpanudoedehe said: “The All Progressives Congress (APC), Caretaker/Extraordinary Convention Planning Committee (CECPC) at its 18th regular meeting on Monday 20th December, 2021 at the Party’s National Secretariat (Buhari House) reviewed its activities over the past one year."
  },
  {
    "headline": "Buhari Declines Assent To Electoral Act Amendment Bill Over Direct Primaries",
    "summarized_story": "President Muhammadu has declined assent to the Electoral Act Amendment Bill over the direct primaries clause.\nThe President, according to the letter, explained that direct primaries are expensive.\nThe Nigerian leader equally fears that with direct primaries, citizens’ rights will be violated while smaller political parties may face marginalisation.\nBuhari’s most recent move followed debates over the Electoral Act Amendment Bill which he was supposed to sign on or before December 19th, 2021.\nRELATEDINEC Requires N305bn To Conduct 2023 Elections, Says YakubuElectoral Bill: Buhari Will Inform NASS Of His Decision, Says PresidencyBuhari Has No Excuse For Not Signing Electoral Act Amendment Bill, Says WikeConspiracy claimsEarlier, presidential spokesman Garba Shehu had argued that whatever his principal decides to do concerning the Electoral Act Amendment Bill will not affect his public perception."
  },
  {
    "headline": "COVID-19 Cases On The Rise As Nigeria Enters Fourth Wave",
    "summarized_story": "Nigeria on Monday recorded 1,368 more COVID-19 cases, hours after the country confirmed that it had entered the fourth wave of the pandemic.\nA breakdown of the daily infection rate showed that the new cases were confirmed in 19 states and the Federal Capital Territory (FCT) Abuja.\nMonday’s update takes the number of COVID-19 infections in Nigeria to 225,255 out of which 211,660 have been discharged.\n“Nigeria has recorded a 500% increase in the number of confirmed COVID-19 cases over the past two weeks across the country caused by the Delta and Omicron variants,” the NCDC boss, added.\n“The country is now in a fourth COVID-19 wave."
  },
  {
    "headline": "Nigeria Now In Fourth COVID-19 Wave – NCDC",
    "summarized_story": "The Nigeria Centre for Disease Control on Monday said the country was now experiencing a fourth COVID-19 wave.\n“Nigeria has recorded a 500% increase in the number of confirmed COVID-19 cases over the past two weeks across the country caused by the Delta and Omicron variants,” the statement said.\nREAD ALSO: Full Booster Dose Improves Omicron Protection, Says Moderna“The country is now in a fourth COVID-19 wave.\n“Critically, Nigerians are urged to adhere to recommended measures by NCDC and other public health authorities, as they celebrate Christmas and New Year.\nThe virus that causes COVID-19 is more likely to spread in mass gatherings especially when held indoors with full capacity and poor ventilation."
  },
  {
    "headline": "Kaduna Attack: Two More Bodies Recovered, Death Toll Now 40",
    "summarized_story": "Two more bodies have been recovered following separate attacks on three villages in Giwa Local Government Area of Kaduna State bringing the death toll to 40.\nGunmen had invaded the villages between Saturday and Sunday morning and opened fire on the innocent villagers.\nThe bandits also burnt several houses, vehicles, and farmlands during the attack on the three villages – Kauran Fawa, Marke and Riheya.\nAs of Sunday, the Kaduna State Government said the dead bodies retrieved were 38 but the Commissioner for internal security and Home Affairs, Samuel Aruwan confirmed to Channels Television on Monday that two additional bodies were recovered.\nBuhari in a statement by his Senior Special Assistant on Media and Publicity, Garba Shehu, extended his condolences to the Kaduna State Government and the people in the affected local governments."
  },
  {
    "headline": "BREAKING: Buhari’s Letter Declining Assent To Electoral Act Amendment Bill Read At NASS",
    "summarized_story": "The National Assembly on Tuesday read President Muhammadu Buhari’s letter in which he declined assent to the Electoral Act Amendment Bill.\nAfter the session, Senator Lawan read the letter in which President Buhari explained the reasons for his action.\nIn the letter, Buhari cited the direct primaries clause as the reason for his decision.\nHe argued that the clause throws up several challenges one of which is the cost of conducting direct primaries.\nAccording to him, direct primaries will increase the Federal Government’s financial burdens because they are expensive to conduct."
  },
  {
    "headline": "Buhari gives reasons for not signing Electoral Act Amendment Bill -",
    "summarized_story": "Speaker of the House of Representatives, Femi Gbajabiamila has read President Muhammadu Buhari’s letter explaining why he declined to sign the Electoral Act Amendment bill.\nAccording to the president, direct primaries an affront to the right to freedom of association."
  },
  {
    "headline": "Fact check: What Court really said about Ikoyi Marriage Registry -",
    "summarized_story": "Contrary to misconceptions and misinterpretations, the Federal High Court in Lagos did not bar Federal marriage registries in Ikoyi, Lagos and Abuja from further contracting marriages under the Marriage Act, 2004 in Nigeria.\nThe three others are the local government areas, where the Federal Government established Federal Marriage Registries – Egor local LG Council in Edo State, Owerri Municipal LG Council in Imo State and Port Harcourt City LG Council in Rivers State.\nIn the case instituted in 2018, the applicants sued the Minister of Interior and the Attorney-General of the Federation.\nIt also directed marriage registries in the local governments to obtain approval from federal marriage registries so as to continue to conduct marriages in accordance with the marriage act.\nThe stealthy manner in arrogating marriage territories beyond the statutorily delineated Central Licensing place of worship and undermining the local governments (Marriage Districts) is illegal."
  },
  {
    "headline": "APC sets up convention sub-committee",
    "summarized_story": "The ruling All Progressives Congress (APC) has commenced process leading to the national convention of the party.\nTo this end, the party has set up a sub-committees on budgeting and other relevant structures.\nPresident Muhammadu Buhari had in November approved February 2022 as the tentative month for the national convention."
  },
  {
    "headline": "7,000 defects to PDP in Adamawa, APC confident of victory in 2023 -",
    "summarized_story": "Adamawa State Governor, Ahmadu Umaru Fintiri has received over 7,000 members of the All Progressives Congress and Social Democratic Party to the Peoples Democratic Party in Jada Local Government Area of Adamawa State.\nBut, the All Progressives Congress in the state says it is confident of victory in the forthcoming 2023 general election."
  },
  {
    "headline": "Oil Prices Steady as Omicron Worries Linger",
    "summarized_story": "Oil prices steadied on Tuesday after a sharp fall in the previous session as investors worried about the rapid spread of the Omicron coronavirus variant and the impact of renewed restrictions on fuel demand.\nBrent crude was down 8 cents, or 0.1%, at $71.44 a barrel by 0903 GMT, while U.S. West Texas Intermediate (WTI) crude rose 5 cents, or 0.1%, to $68.66 a barrel.\nNew Zealand delayed the planned reopening of its international border because of the sweeping spread of Omicron around the world on Tuesday, as several other countries reimposed social distancing measures.\nStill, Moderna Inc said on Monday that a booster dose of its COVID-19 vaccine appeared to be protective against the fast-spreading Omicron variant in laboratory testing, providing some hope to investors.\nIn the United States, crude oil inventories were expected to have fallen for a fourth consecutive week, while distillate and gasoline stockpiles likely rose last week, a preliminary Reuters poll showed on Monday."
  },
  {
    "headline": "Omicron’s Global Spread Prompts Renewed Lockdowns, Delayed Reopenings",
    "summarized_story": "Omicron infections are multiplying rapidly across Europe, the United States and Asia, including in Japan where a single cluster at a military base has grown to at least 180 cases.\nIn the United States, officials said the variant claimed the life on Monday of an unvaccinated man in Texas after becoming the dominant strain in the country.\nIn Australia, where Omicron cases have surged but hospitalisations remain relatively low, Prime Minister Scott Morrison urged state and territory leaders to avoid further lockdowns.\nThe Omicron variant was first detected last month in southern Africa and Hong Kong and so far has been reported in at least 89 countries.\nMARKET IMPACTThe rapid spread of the variant has ignited fears that more countries may impose economically disruptive restrictions, impacting markets."
  },
  {
    "headline": "US to Be World’s Biggest LNG Exporter in 2022",
    "summarized_story": "The United States is set to become the world’s biggest liquefied natural gas (LNG) exporter in 2022, surpassing Qatar and Australia, and may hold that title for years to come.\nMuch of that global appetite has been met by steadily rising U.S. LNG exports, which have reached new records every year since 2016 and is poised to continue in 2022.\nThe U.S. Energy Information Administration projects U.S. LNG exports will reach 11.5 billion cubic feet per day (bcfd) in 2022.\nThe United States should remain the biggest LNG exporter by capacity until around 2025, when Qatar could regain the lead as its North Field expansion starts to enter service.\nBut if some U.S. developers start building new LNG export plants, the United States may not give up the crown."
  },
  {
    "headline": "OPEC+ Misses Oil Supply Target as Over-Compliance Hits 117% in November",
    "summarized_story": "Compliance with oil production cuts by the Organisation of Petroleum Exporting Countries (OPEC) and its allies known as OPEC+ stood at 117 per cent in November, up from 116 per cent the previous month.\nComparatively, the group remained 580,000 bpd below its 37.94 million bpd November production target, even though collective output rose by 410,000 bpd month on month.\nThe coalition would raise its output goal by 400,000 bpd to 38.34 million bpd this month, and by the same amount again to 38.74 million bpd in January.\nThe previous month, Nigeria had lost its Africa’s top oil producer status to the North African country, as its crude oil production continued to fall mainly due to ageing upstream infrastructure.\nBut in November, Nigeria pumped an additional 47,000 barrels per day when compared to the 1.228 million bpd produced averagely in the month of October 2021."
  },
  {
    "headline": "Conflicting Study on Omicron as Oregon Research Says Infections May Lead to ‘Super Immunity’",
    "summarized_story": "The findings were at variance with that of the Imperial College London, which held that Omicron variant largely evades immunity from past infection or two vaccine doses.\nOur study suggests that individuals who are vaccinated and then exposed to a breakthrough infection have super immunity,” Tafesse added in a statement.\nResearchers did not specifically examine the Omicron variant, which was first detected in South Africa in November and is now circulating throughout the US.\nThe study compared COVID-19 immune response in blood samples from 52 people—all employees of the university.\nOf those people, 26 had experienced mild breakthrough infections after they were vaccinated."
  }
]