[
  {
    "headline": "Drinking coffee could prevent chronic liver disease, study suggests",
    "summarized_story": "Amarachi OkehA new study has suggested that drinking coffee could help reduce the risk of chronic liver disease.\nThe study published in the BMC Public Health Journal said that it has found evidence that all types of coffee (including decaffeinated) have protective effects against chronic liver disease outcomes.\nThe researchers examined the coffee habits of 384,818 coffee drinkers and 109,767 non-coffee drinkers over 11 years with the participants of the study being adults between 40 – 69 years of age.\nAt the end of the study, the researchers said they found that “coffee drinkers were 21% less likely to develop chronic liver disease, 20% less likely to develop chronic or fatty liver disease, and 49% less likely to die from chronic liver disease than non-coffee drinkers.\nThe study said it “agrees with previous cohort studies that generally report inverse associations between coffee consumption and chronic liver disease outcomes, including deranged liver enzymes, fibrosis, cirrhosis and hepatocellular carcinoma – which occurs in people with chronic Hepatitis B and C.”Copyright PUNCHAll rights reserved."
  },
  {
    "headline": "Drinking coffee could prevent chronic liver disease, study suggests",
    "summarized_story": "Amarachi OkehA new study has suggested that drinking coffee could help reduce the risk of chronic liver disease.\nThe study published in the BMC Public Health Journal said that it has found evidence that all types of coffee (including decaffeinated) have protective effects against chronic liver disease outcomes.\nThe researchers examined the coffee habits of 384,818 coffee drinkers and 109,767 non-coffee drinkers over 11 years with the participants of the study being adults between 40 – 69 years of age.\nAt the end of the study, the researchers said they found that “coffee drinkers were 21% less likely to develop chronic liver disease, 20% less likely to develop chronic or fatty liver disease, and 49% less likely to die from chronic liver disease than non-coffee drinkers.\nThe study said it “agrees with previous cohort studies that generally report inverse associations between coffee consumption and chronic liver disease outcomes, including deranged liver enzymes, fibrosis, cirrhosis and hepatocellular carcinoma – which occurs in people with chronic Hepatitis B and C.”Copyright PUNCHAll rights reserved."
  },
  {
    "headline": "State of healthcare infrastructure in Africa appalling, says AfDB president",
    "summarized_story": "Sami TunjiThe President of the African Development Bank Group, Dr. Akinwumi Adesina, has decried the state of healthcare infrastructure in Africa, saying the continent loses $1bn annually to medical tourism.\nThe theme of Friday’s event was ‘Building Africa’s healthcare defence system.’According to him, the state of healthcare in Africa is disturbing as many Africans do not have access to quality healthcare.\nAccess to healthcare on the continent is extremely poor, much less quality healthcare, a luxury enjoyed in developed countries.\n“Only 51 per cent of the public health facilities have basic water and sanitation and electricity is available only in 33 per cent of the healthcare facilities.\nThe state of healthcare infrastructure in Africa is appalling."
  },
  {
    "headline": "State of healthcare infrastructure in Africa appalling, says AfDB president",
    "summarized_story": "Sami TunjiThe President of the African Development Bank Group, Dr. Akinwumi Adesina, has decried the state of healthcare infrastructure in Africa, saying the continent loses $1bn annually to medical tourism.\nThe theme of Friday’s event was ‘Building Africa’s healthcare defence system.’According to him, the state of healthcare in Africa is disturbing as many Africans do not have access to quality healthcare.\nAccess to healthcare on the continent is extremely poor, much less quality healthcare, a luxury enjoyed in developed countries.\n“Only 51 per cent of the public health facilities have basic water and sanitation and electricity is available only in 33 per cent of the healthcare facilities.\nThe state of healthcare infrastructure in Africa is appalling."
  },
  {
    "headline": "Leaders, youths lament high profile killing in Ondo community",
    "summarized_story": "Dayo Johnson AkureLeaders and youths in Ifon Community, in the Ose council area of Ondo state, have cried out over high profile killings by gunmen in the area.\n‘”This unfortunate incidence led to the killing of the APC chieftain, Dele Isibor, having sustained severe injuries from the gunshot and four people were kidnapped by the gunmen.\nOne of the community leaders, Sunday Amudeli who spoke at the meeting said that Ifon community had been in the news for over a year as a result of insecurity and other wrong reasons either about killing or kidnapping.\nAmudeli further stated that Ifon occupies a strategic location in the State, serving as a boundary to Edo and Ondo State.\nThe community is conducive and is ready to provide the land for stability, peace and to maintain law and order."
  },
  {
    "headline": "11 killed, 22 injured as two buses collide in Osun",
    "summarized_story": "Shina Abubakar, OsogboEleven persons were reportedly killed in a fatal auto accident along Gbangan-Ibadan road in Osun state.\nAccording to the spokesperson Osun state command of the Federal Road Safety Corps, Agnes Ogungbemi, the accident occured on Friday night opposite Ayedaade local government Secretariat.\nOgungbemi added that 10 dead victims were taken to the Obafemi Awolowo University Teaching Hospital morgue while the other body was taken away by the family.\nShe added that 16 of the 22 injured victims were taken to Ariremako hospital in Gbongan while the remaining six were taken to central hospital in Osogbo, whose ambulance was at the scene for rescue operation.\n“16 injured victims were taken to Ariremako hospital Gbongan, 6 other injured victims were taken by Central Hospital, Osogbo Ambulance to their hospital after the medical doctor of Ariremako hospital called for their assistance having been rejected at Divine mercy hospital, Gbongan."
  },
  {
    "headline": "I’m alive, hale and hearty —Former Borno Gov, Shettima debunks death rumour",
    "summarized_story": "By Ndahi Marama, MaiduguriFormer Borno State Governor and senator representing Borno Central, Hon Kashim Shettima has debunked his death rumours amongst individuals, groups and associations in the state, which later went viral in some social media platforms, stressing that ‘he is alive, hale and hearty.\nThe senator said, although death is enevitable to mankind, it is also not proper to wish somebody dead, even if such a person is critical on his/her sickbed.\nI am hale and hearty.\n“I am surprised with the rumour too and I don’t know where it came from.\nThis is not the first time the news of my death has been falsely peddled, we give God the glory”."
  },
  {
    "headline": "Okowa urges State Assemblies to pass constitutional amendment bill",
    "summarized_story": "…calls for appropriate consultations between executive, legislative arm of Govt…as Conference of Speakers meet in DeltaBy Festus Ahon, ASABADELTA State Governor, Senator Ifeanyi Okowa, has told States’ Houses of Assembly to ensure the passage of Constitutional Amendment Bill when sent to them by the National Assembly.\nMeanwhile, Governor Ifeanyi Okowa, Saturday, called for appropriate consultations between the executive and legislature arms of government in matters relating to politics and policy formulation.\nThe Chairman, Conference of Speakers of State Legislatures, and Speaker of Bauchi State House of Assembly, Mr Abubarkar Suleiman, said Delta State has become a reference point in any discuss on financial autonomy being the first state to commence its implementation.\nDeputy National Chairman of the Conference of Speakers of State Legislatures and Speaker of Delta State House of Assembly, Chief Sheriff Oborevwori, said they have been enjoying financial autonomy as a House long before now.\nOborevwori said the State Legislatures Forum was “an integral part of Nigeria’s political architecture and the primary of the legislature at all levels is to make laws and promote policies for peace, order and good governance."
  },
  {
    "headline": "Adjogbe hails Nwaoboshi’s defection to APC",
    "summarized_story": "By Festus Ahon, ASABAERSTWHILE Executive Director Projects of the Niger Delta Development Commission, NDDC, Engr Samuel Adjogbe, Friday, described the defection of the Senator representing Delta North Senatorial District at the National Assembly, Senator Peter Nwaoboshi from the Peoples Democratic Party, PDP to the APC as a welcome development.\nSenator Peter Nwaoboshi who defected from the PDP earlier today, was received by President Muhammadu Buhari, Vice Yemi Osinbajo, Deputy Senate President, Senator Ovie Omo-Agege and the National Caretaker/Extraordinary Convention Planning Committee, CECPC at the State House, Abuja.\nNwaoboshi defected to the APC after his purported suspension from the PDP by the State Working Committee of the party on Wednesday.\nAdjogbe in a statement by his Special Assistant on Media and Publicity, Daniel Ughere, said; “as a two-time serving Senator who has held several positions, Senator Peter Nwaoboshi comes with immense wealth of industry, capacity and experience to the fold of the progressives.\n“I welcome him to our great party and I enjoin all party faithful to rally around him with support and cooperation, especially our members in Delta North and Nigeria at large.”"
  },
  {
    "headline": "Torture of suspects must end, SARS still operating",
    "summarized_story": "Chino Obiagwu, the National Coordinator made the request as the global community commemorate the day of solidarity with victims of torture.\nLEDAP, in a statement, expressed concern that torture by security agencies is still on the increase despite being one of the major reasons that sparked the End SARS protest in October 2020.\nObiagwu said it is very disheartening that “the disbanded Special Anti- Robbery Squad (SARS) is still operating even while the State Judicial Panel on Restitution for Victims of SARS is still ongoing”.\nLEDAP declared that the use of torture by security agencies is against the principles of international human rights law and domestic laws.\n“Security agencies especially police officers and SARS continue to use torture and ill treatment in obtaining statements from accused persons."
  },
  {
    "headline": "Being best friend to bandits makes you a terrorist",
    "summarized_story": "Former Aviation Minister, Femi Fani-Kayode has again lambasted renowned Islamic cleric, Sheikh Ahmad Abubakar Gumi over alleged ties with bandits who are currently wreaking havoc in the Northern part of Nigeria.\nGumi, who has met with the bandits in forests several times, had likened their activities to the Indigenous People of Biafra (IPOB) stating that the secessionist group are more dangerous than the bandits.\nRecently, Gumi accused some personnel of the Nigerian Army of colluding with the criminal elements for supply of weapons and drugs.\nOwing to the activities of the cleric with bandits, Fani-Kayode who described him as a terrorist, said he should have been arrested long ago.\n“You are their best friend: that makes you a terrorist as well and you ought to have been arrested long ago.”Tell us how much you got, those sponsoring Fulani terrorists – Fani-Kayode tells Gumi"
  },
  {
    "headline": "Ministries, agencies use consultants, BOT, PPP to steal money",
    "summarized_story": "Abdulrasheed Bawa, the Chairman, Economic and Financial Crimes Commission (EFCC) has revealed the tactics Ministries, Departments and Agencies (MDAs) use to steal money.\nBawa spoke when the Chairman, Fiscal Responsibility Commission (FRC) Victor Muruako and his team visited the EFCC headquarters in Jabi, Abuja.\nPay a special attention to consultants; all these Build, Operate and Transfer, BOT; all these Public Private Partnerships (PPP).\nBawa added that EFCC knows the importance of the fiscal commission and the amount of information at its disposal.\nTinubu is under investigation – EFCC Chairman, Bawa"
  },
  {
    "headline": "Dino Melaye replies critics",
    "summarized_story": "Senator Dino Melaye who represented the Kogi West Senatorial District at the 8th National Assembly has told his critics rumouring his affair with Nigerian ladies not to be worried, stating that he would soon marry.\nRecall that some Nigerians on social media had accused the popular politician of dating some Nigerian celebrities, alleging that he has kids from different women.\nBut Dino who tweeted in pidgin English via his official Twitter handle, described them as jobless people.\nDino wan marry A, Dino give B belle, Dino is dating C, all lori iro….haba!!!!\nMake una no worry, I go soon marry…koboko na im she go take follow una."
  },
  {
    "headline": "COVID-19 delta variant now in 85 countries",
    "summarized_story": "Tedros Ghebreyesus, Director-General, World Health Organization (WHO), has expressed concern over the COVID-19’s delta variant, which he called “the most transmissible” mutation to date.\nGhebreyesus told journalists at a regular briefing on Friday that delta co had been identified in at least 85 countries and is “spreading rapidly among unvaccinated populations.”“As some countries ease public health and social measures, we are starting to see increases in transmission around the world,” he said.\nGhebreyesus acknowledged that new variants were expected, stressing that by preventing transmission, ‘we can stem the emergence of variants.\nHe noted that it is even more urgent today to prevent transmission by consistently using public health and social measures along with vaccines.\nThis, he said is why vaccines must be distributed equitably, to protect health workers and the most vulnerable."
  },
  {
    "headline": "What you probably didn’t know about murdered Super TV boss, Usifo Ataga",
    "summarized_story": "By Alao AbiodunThe controversial death of Super TV Chief Executive Officer, Mr. Micahel Usifo Ataga has continued to elicit flurry of reactions.\nMichael Usifo Ataga was the founder and the Chief Executive Officer of Super TV and a director in Super Network Limited.\nAtaga registered Super Network Limited under the Telecommunications Services Industry, on December 23, 2013, with himself as Director.\nAtaga also floated Super TV in April 2014, as a streaming entertainment platform that offers movies, shows, news, and documentaries.\nSince 2014, he has been the Chief Executive Officer (CEO) and founding Director of Super TV."
  },
  {
    "headline": "Troops neutralise scores of bandits in Zamfara – Army",
    "summarized_story": "Agency ReporterThe Nigerian Army says its troops of 8 Division have eliminated an unspecified number of bandits in fierce encounters in Talata Marafa Local Government Areas of Zamfara.\nADVERTISEMENTNwachukwu said that troops, while on a fighting patrol, came under fire from bandits operating along Mayanchi-Dogo Karfe and Fagantama villages in the area.\nHe said the bandits were overwhelmed by the superior firepower of the troops in the fierce encounter that ensued where scores of bandits were neutralised.\nAccording to him, the Chief of Army Staff, Maj.-Gen. Faruk Yahaya, commended the troops for their combat resilience and renewed vigour.\n“He urged communities in the North West to support the troops with useful information at all times to enhance anti- banditry operations,” he said."
  },
  {
    "headline": "Anambra 2021: Nwoye withdraws from PDP’s primary",
    "summarized_story": "In a statement ahead of the primary election of PDP holding on Saturday, Nwoye instructed his supporters to vote for any aspirant of their choice.\nWhat is at play now is that the afore-listed groups have been excluded from voting in today’s Primary Election.\nThe import is that the primary election as is being purported will only be by a paltry 5 – 6% percent of eligible voters.\nAborting the rights of the people who represent the kindle to our possible success at the election, cannot have my participation at the Primary election.\n“For the reasons stated above, I hereby withdraw from participation as an aspirant in the PDP Primary election of 26th June 2021."
  },
  {
    "headline": "Niger Delta Avengers returns with Operation Humble to cripple economy",
    "summarized_story": "By Mike Odiegwu, Port HarcourtNiger Delta Avengers (NDA) has announced its return to the Niger Delta Creeks with Operation Humble designed to destroy targeted oil installations in the region.\nThe statement also said the operation would target political actors collaborating with the Nigerian Government to undermine the interest of the Niger Delta.\nStakeholders had warned the Federal Government and the Minister of Niger Delta Affairs, Senator Godswill Akpabio of the consequences of reneging on their agreement to constitute a substantive board of the Niger Delta Development Commission (NDDC) at the end of June.\nIt said: “This operation shall be coded‚ Operation Humble aimed at bringing down targetted oil installations in the Niger Delta capable of humbling the economy into permanent recession.\nThis mission is also targetted at political actors, who are collaborating with the Nigerian Government to undermine the interest of the Niger Delta people."
  },
  {
    "headline": "Face to face with alleged murderer of super tv CEO",
    "summarized_story": "Her fellow students who spoke to our paper expressed shock over her involvement with the cold-blooded murder of the TV entrepreneur.\nAs she explained, this was because there was no money for her to go back to school to continue her education pursuit.\nFor her secondary school education, she attended Alagomeji Secondary School, Yaba, Lagos, but initially stopped at Junior Secondary School 2 owing to paucity of fund.\nShe later went back and continued from Senior Secondary School 1 but also stopped again due to lack of finance.\nShe later managed to complete her secondary school education."
  },
  {
    "headline": "Men just want to have a feel of my boobs –Ada Ebere",
    "summarized_story": "For comedienne Ada Ebere aka Ada la Pinky, her unique selling points are her big breasts and she leaves no stone unturned in flaunting them.\nHowever, in a chat with Saturday Sun, the social media influencer lamented the challenges she faces walking around with big boobs.\nAnother challenge is that I can’t sleep lying on my chest; it has to be either up right or sideways.\nClearing the insinuations that she had her boobs enlarged for commercial purposes, Ada claimed they are natural and not enhanced.\nI never liked big boobs, I’d have preferred a portable size but here I am blessed with large ones and I am grateful."
  },
  {
    "headline": "Me, 2Face, Faze and African Queen –Blackface Naija, singer",
    "summarized_story": "He was a member of the Plantashun Boiz alongside 2Baba and Faze, and their band went on to become one of the best of the early 2000s.\nSo, I don’t know why they put their eyes on me and try to slow my roll.\nI don’t know the people and I don’t know what their aim is.\nThere was a time you had issues with your former bandmates for performing some of Plantashun Boiz’ songs.\nThe Plantashun Boiz is independent of Blackface Naija, Faze and 2Face."
  },
  {
    "headline": "Gbajabiamila, Sanwo-Olu, consummate, progressive-minded leaders – Kalu",
    "summarized_story": "Former Governor of Abia State and Chief Whip of the Senate, Dr. Orji Kalu has felicitated the Speaker, House of Representatives, Hon.\nThe former governor, while extolling the virtues of the Speaker, acknowledged the invaluable contributions of Gbajabiamila to nation building in various capacities.\nWhile acknowledging the achievements of the governor in Lagos State, Kalu noted that Sanwo-Olu has sustained and consolidated on the achievements of his predecessors.\nKalu said: “I join the people of Lagos State in celebrating Governor Babajide Sanwo-Olu of Lagos State as he clocks 56.\n“The celebrant is a seasoned administrator and consummate politician, with passion for growth and development of Lagos State."
  },
  {
    "headline": "DSS quizzes Gumi over remarks against military",
    "summarized_story": "From Molly Kilete, Abuja and Noah Ebije, KadunaThe Department of State Service (DSS) has quizzed controversial Islamic cleric, Sheikh Ahmad Abubakar Gumi, over remarks he made on Arise Television that some Nigerian soldiers might be aiding and abetting bandits.\nA Voice of America (VOA) Hausa service report monitored on Friday said Gumi was invited to the Kaduna office of the DSS, after the military authorities took exception to comments by Sheikh Gumi alleging that their operatives were conniving with bandits.\nHowever, Gumi’s spokesman, Malam Tukur Mamu in an interview with VOA Hausa Service, dismissed the allegation against Gumi, saying there was nowhere in the TV interview where Gumi categorically accused the entire military.\nMeanwhile Sheikh Ahmad Gumi has debunked reports that he was invited or quizzed by the DSS.\nThe DSS on Friday confirmed that it invited Islamic cleric Sheikh Ahmad Gumi for questioning."
  },
  {
    "headline": "President Approves Extra 6 Months for APC’s Caretaker Committee",
    "summarized_story": "The President gave the approval yesterday morning after a closed-door meeting with members of the Committee at the State House, Abuja.\n“The President also approved the timetable for APC Ward, Local Government and State Congresses.\nThe President said the APC had been revived, energised and repositioned for its forthcoming national convention and future elections.\nHe told the President and other party members that 14 party members had indicated their interest to contest for the Anambra State elections, assuring that the primary elections will be free, fair and transparent.\n“The party members have agreed to name the secretariat, Muhammadu Buhari House,” he added."
  },
  {
    "headline": "Green Energy: Osinbajo Frets over Looming Fall in Funding for Gas",
    "summarized_story": "•Says Nigeria will continue frontline advocacy for a just transition to zero emissionsVice President Yemi Osinbajo is worried about the global clamour for green energy and the looming reduction in funding for gas and fossil fuel projects, especially in developing countries, by international bodies and institutions.\nAt the virtual meeting, Osinbajo maintained his position that the funding for gas and fossil fuel projects in Nigeria and other developing countries be sustained during the global transition to net-zero emissions and said Nigeria would continue its frontline advocacy for a just transition to zero-emission.\nHe also asserted that Nigeria would play a critical role with other gas exporting countries to stop the defunding of gas and fossil fuel projects in developing countries.\nThe Vice President noted that it was vital that the Forum of Gas Exporting Countries (GEC) join forces to prevent the defunding of gas and fossil fuel projects, especially from developing countries, by international bodies and institutions.\nBoth the Minister of State for Petroleum Resources and Minister of Foreign Affairs were directed to work together, to ensure the GEC Forum reaches a consensus that reflects Nigeria’s advocacy on defunding of gas projects."
  },
  {
    "headline": "DSS Grills, Cautions Ahmad Gumi over Comments on Bandits, Security Agents",
    "summarized_story": "The service invited Sheikh Gumi.\nHow can these big weapons cross our borders and get into the forest without the cooperation of some bad element of the security operatives assisting them?\nYou can’t because the security is alert.”The Nigerian Army kicked against the cleric’s claims and warned that it would not condone acts sabotaging its efforts.\nHe also insisted that he never made any disparaging remarks against the military during his recent live interview on national television.\nAccording to him, there was nowhere in the TV interview that he categorically accused the entire military."
  },
  {
    "headline": "Nwaoboshi Defects to APC, Meets Buhari",
    "summarized_story": "Deji Elumoye in AbujaThe senator representing Delta North, Peter Nwaoboshi, has defected to the All Progressives Congress, days after his suspension from the state’s Peoples Democratic Party.\nPresident Muhammadu Buhari yesterday welcomed Nwaoboshi to the APC.\nThe Senior Special Assistant to the President on Media and Publicity, Garba Shehu, announced the defection in a statement titled ‘President Buhari congratulates Senator Peter Nwaoboshi for decamping to APC’.\nNwaoboshi, representing Delta North District, Delta State, was presented to President Buhari and National Caretaker/Extraordinary Convention Planning Committee at the State House by Deputy Senate President, Ovie Omo-Agege.\n“The Deputy Senate President said Senator Nwaoboshi’s decision to join the APC clearly shows that the effort of the CECPC was yielding fruit."
  },
  {
    "headline": "Buhari Postpones Medical Trip to London",
    "summarized_story": "By Deji ElumoyeThe medical follow-up visit of President Muhammadu Buhari to London, United Kingdom earlier scheduled for Friday (today) has been postponed.\nAccording to a release on Friday by Special Adviser on Media to the President, Femi Adesina, a new date will be announced in due course.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: DSS Invites Sheikh Gumi After Alleging Military-Bandits’ Collusion In Attacks On Citizens",
    "summarized_story": "The State Security Service, also known as the Department of State Services (DSS) has invited controversial Islamic cleric, Sheikh Ahmad Gumi, for questioning.\nThe VOA Hausa reported the DSS invitation, days after a controversy between Gumi and the Nigerian Army.\nThe Nigerian Army had replied to Gumi, same day saying his statement is both sad and unfortunate.\nOn Wednesday, he had described bandits and killer herdsmen’s atrocities as “a tribal war,” accusing the government of taking sides.\n“What you call banditry when you cross to the other side, you find out Nigeria is fighting a tribal war,” he explained."
  },
  {
    "headline": "BREAKING: DSS Invites Sheikh Gumi After Alleging Military-Bandits’ Collusion In Attacks On Citizens",
    "summarized_story": "The State Security Service, also known as the Department of State Services (DSS) has invited controversial Islamic cleric, Sheikh Ahmad Gumi, for questioning.\nThe VOA Hausa reported the DSS invitation, days after a controversy between Gumi and the Nigerian Army.\nThe Nigerian Army had replied to Gumi, same day saying his statement is both sad and unfortunate.\nOn Wednesday, he had described bandits and killer herdsmen’s atrocities as “a tribal war,” accusing the government of taking sides.\n“What you call banditry when you cross to the other side, you find out Nigeria is fighting a tribal war,” he explained."
  },
  {
    "headline": "BREAKING: DSS Invites Sheikh Gumi After Alleging Military-Bandits’ Collusion In Attacks On Citizens",
    "summarized_story": "The State Security Service, also known as the Department of State Services (DSS) has invited controversial Islamic cleric, Sheikh Ahmad Gumi, for questioning.\nThe VOA Hausa reported the DSS invitation, days after a controversy between Gumi and the Nigerian Army.\nThe Nigerian Army had replied to Gumi, same day saying his statement is both sad and unfortunate.\nOn Wednesday, he had described bandits and killer herdsmen’s atrocities as “a tribal war,” accusing the government of taking sides.\n“What you call banditry when you cross to the other side, you find out Nigeria is fighting a tribal war,” he explained."
  },
  {
    "headline": "EXPOSED: Energy Commission Of Nigeria Inflates Transformers, Streetlights' Contracts By N17million",
    "summarized_story": "The Energy Commission of Nigeria, one of the key agencies under the Ministry of Power, has been embroiled in a contract inflation saga, involving transformers and streetlights.\nThe commission is being asked to account for N17 million which it earmarked as the cost of transformers and streetlights, according to a 2018 government’s audit report.\nThese include; the contract for the establishment of 152 solar streetlights in Dawakin Kudu/Warawa, Kano 1, Kano State at a contract sum of N100,190,891.20.\nTwo, the contract for the establishment of solar powered streetlights at Zaria Prison, Kaduna State, for the sum of N4,614,054.20.\nIn the case of any other officer, he shall be surcharged appropriately and removed from the duty schedule, dismissed, and prosecuted."
  },
  {
    "headline": "EXPOSED: Energy Commission Of Nigeria Inflates Transformers, Streetlights' Contracts By N17million",
    "summarized_story": "The Energy Commission of Nigeria, one of the key agencies under the Ministry of Power, has been embroiled in a contract inflation saga, involving transformers and streetlights.\nThe commission is being asked to account for N17 million which it earmarked as the cost of transformers and streetlights, according to a 2018 government’s audit report.\nThese include; the contract for the establishment of 152 solar streetlights in Dawakin Kudu/Warawa, Kano 1, Kano State at a contract sum of N100,190,891.20.\nTwo, the contract for the establishment of solar powered streetlights at Zaria Prison, Kaduna State, for the sum of N4,614,054.20.\nIn the case of any other officer, he shall be surcharged appropriately and removed from the duty schedule, dismissed, and prosecuted."
  },
  {
    "headline": "Ngige: Nigeria seeking intellectual property rights waiver on COVID vaccine",
    "summarized_story": "Chris Ngige, minister of labour and employment, says Nigeria is seeking a waiver of intellectual property rights on COVID vaccine.\nThere have been calls for the waiver of intellectual property rights to boost production of COVID-19 vaccine and promote vaccine equity.\nAdvertisement“Nigeria is in the league of countries who want the intellectual property rights as it relates to COVID-19 vaccines be waived so that developing countries can manufacture them to fight the pandemic,” he said.\nWhile serving as titular, they found us worthy to be the President of the Government Group of the ILO Governing Board between 2019- 2021.\nAnd now this year, barely fortnight ago, we were voted in again, this time, to the highest membership of the Governing Board as a Regular.”"
  },
  {
    "headline": "Ngige: Nigeria seeking intellectual property rights waiver on COVID vaccine",
    "summarized_story": "Chris Ngige, minister of labour and employment, says Nigeria is seeking a waiver of intellectual property rights on COVID vaccine.\nThere have been calls for the waiver of intellectual property rights to boost production of COVID-19 vaccine and promote vaccine equity.\nAdvertisement“Nigeria is in the league of countries who want the intellectual property rights as it relates to COVID-19 vaccines be waived so that developing countries can manufacture them to fight the pandemic,” he said.\nWhile serving as titular, they found us worthy to be the President of the Government Group of the ILO Governing Board between 2019- 2021.\nAnd now this year, barely fortnight ago, we were voted in again, this time, to the highest membership of the Governing Board as a Regular.”"
  },
  {
    "headline": "Ex-Liberian president wants Amina Mohammed as second elected female African president",
    "summarized_story": "Ellen Johnson Sirleaf, former president of Liberia, says she wants Amina Mohammed, deputy secretary-general of the United Nations (UN), as the second elected female African president.\nThe former female president asked Nigerians to emulate Liberia and elect the first female president and second in Africa.\nAdvertisement“Would it not be good to have a second elected female African president in Nigeria,” she said.\nOn his part, Nasir el-Rufai, governor of Kaduna state, noted that the UN deputy secretary-general is an inspiration to young girls, that they can be anything they desire.\n“You do not know how many female young girls you have inspired and whose lives you will change simply from your examples."
  },
  {
    "headline": "Ex-Liberian president wants Amina Mohammed as second elected female African president",
    "summarized_story": "Ellen Johnson Sirleaf, former president of Liberia, says she wants Amina Mohammed, deputy secretary-general of the United Nations (UN), as the second elected female African president.\nThe former female president asked Nigerians to emulate Liberia and elect the first female president and second in Africa.\nAdvertisement“Would it not be good to have a second elected female African president in Nigeria,” she said.\nOn his part, Nasir el-Rufai, governor of Kaduna state, noted that the UN deputy secretary-general is an inspiration to young girls, that they can be anything they desire.\n“You do not know how many female young girls you have inspired and whose lives you will change simply from your examples."
  },
  {
    "headline": "Sept 18 for states, Aug 14 LGAs... Buhari approves APC congresses",
    "summarized_story": "President Muhammadu Buhari, on Friday, approved the review of the timelines for the All Progressives Congress (APC) caretaker/extraordinary convention planning committee (CECPC).\nThe national secretary noted that the president also approved the timetable for APC ward, local government and state congresses.\nHe said the state congresses will hold on September 18, ward congresses July 24, and local government congresses August 14.\nAdvertisementThe committee also noted that the recent revalidation exercise conducted by the party recorded over 40 million membership nationwide.\nBuni also informed the president that the committee has decided to name the party’s national secretariat “Buhari House” in recognition of the president’s leadership role."
  },
  {
    "headline": "Nigerian businesses face an avalanche of losses as the Twitter ban continues",
    "summarized_story": "The ban happened a day after the Nigerian government announced an indefinite Twitter suspension.\nFeranmi Ajetomobi, the founder of Nifries, explained that the Twitter ban has affected anon (short for anonymous) sales which drive about 20% of sales at Nifries.\nFor Habib who runs Smiley Socks, a clothing company that also thrives on the ‘anon sales’ phenomenon, sales via Twitter have been affected.\nCompared to other advertising channels, Twitter is a cheaper and less stressful channel.\nLet’s put it across all the businesses in that range and you see that the number is massive.”With the Twitter ban, Nigerian businesses that have previously relied on the massive reach of the platform now face an avalanche of losses if the decision is not reversed soon."
  },
  {
    "headline": "Google earmarks $6 million to support African tech startups and women-led businesses",
    "summarized_story": "Google, this week, announced the launch of two new initiatives to support African-founded startups and women-led businesses in underserved communities on the continent.\nThe programs include a $3 million Black Founders Fund for African startups and a $3 million Google.org grant to help women in low-income communities develop entrepreneurial skills and access funding.\nThrough the latter, Google is looking to support access to economic opportunity for women in sub-Saharan Africa with a $3 million grant to the Tony Elumelu Foundation (TEF).\nBlack Founders Fund debuts in AfricaThe Google for Startups Black Founders Fund provides grants and technical assistance to early-stage startups led by black and diverse teams, with a goal of advancing the black community.\nAccording to Bosun Tijani, CEO of Co-Creation Hub (CcHub), which is partnering with Google on the Black Founders Fund Africa, the shortage of funding for African startups is driven by several factors."
  },
  {
    "headline": "Jesse Forrester started an e-mobility company in Kenya after deciding against going to university",
    "summarized_story": "After ALA, Jesse took up a fellowship.\nToday, his company Mazi Mobility is backed by global venture builder, Satgana, and is aiming at implementing an electric vehicle ecosystem in Africa.\nHe started his company without a university degree and he is now preparing himself to dominate the African e-mobility space.\nThe journey to Mazi by way of ALA‘Mazi’ was not always ‘Mazi Mobility’.\nAt ALA, Jesse was a part of the team behind “The Living Machine” a water treatment system that won them the $100,000 Zayed Sustainability Prize in 2019."
  },
  {
    "headline": "SEC approves Chaka as first licensed stock trading app in Nigeria",
    "summarized_story": "Chaka becomes the first to acquire the digital sub-broker license introduced by SEC in April of this year.\nAs part of a major amendment to its Consolidated Rules and Regulations, SEC recognised sub-brokers who use digital platforms to serve multiple brokers.\nOn the 19th of December 2020, the SEC published a statement that effectively barred Chaka from offering its services in Nigeria.\nThat December warning enabled Chaka to take the lead and open talks with the SEC.\nHe said the license also means Chaka could now enable other stockbroking firms who want to have a digital presence."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Malawi’s 3D-printed school, learning disabilities and technology, Chrome’s third-party cookies",
    "summarized_story": "Good day,Today, I’m discussing:The world’s first 3D-printed school opening in MalawiLearning disabilities and assistive technologyGoogle’s delay in blocking third-party cookies in ChromeWorld’s first 3D-printed school opens in MalawiPhoto credit: NairametricsWhat happened?\nLearning disabilities (LDs) and assistive technology (AT)Photo by Wulan Sari on UnsplashJust two questions before you proceed: What are learning disabilities?\nAlthough there is no cure for LDs, technology has made learning easier for people with learning disabilities.\nGoogle delays plan to block third-party cookies in ChromePhoto by Brett Jordan on UnsplashAnother announcement?\nGoogle has said that it will delay its plans to block third-party cookies in the Chrome browser until 2023, a year later than planned."
  },
  {
    "headline": "Trying clothes online, virtual store attendants, Facebook plans to over overhaul eCommerce",
    "summarized_story": "Statista showed a rise in eCommerce sales in 2020, with global online sales increasing from $3.35 trillion in 2019 to $4.89 trillion in 2020.\nTo take advantage of this unprecedented rise, the company rolled out Facebook Shops on May 19, 2020.\nAlso, Facebook Shops is coming to WhatsApp soon.\nMeanwhile, the new feature will not be available for Whatsapp users globally.\nIn December 2020, WhatsApp gave an ultimatum for users to accept updated privacy policy."
  },
  {
    "headline": "What you need to know as Malawi gets the world’s first 3D-printed school",
    "summarized_story": "The first 3D-printed school, a partnership between Holcim and CDC Group, has been unveiled in Malawi’s Salima district.\nUsing conventional materials, it would take 70 years to bridge this gap, but 14Trees claims that it could take as little as 14 years with 3D printing.\nUnlike conventional buildings, with 3D printing, schools can now be built in days instead of months and at less cost.\nBuilding infrastructure is one reason many African children are out of school, and 3D printing could provide a way out.\nWhile 3D printing could be good for education, should we be cautiously optimistic if it becomes a big deal?"
  },
  {
    "headline": "Telcos face negative half-year as subscriber numbers hit 16-month low",
    "summarized_story": "The telecommunication sector would require a major growth result in June to stop it from ending the second quarter in decline and the first half of 2021 in the negative zone.\nA decline in the first half of the year results is likely to affect the outcome of the half-year GDP growth of the industry….\nDon’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "The Gumi factor and the politics of insecurity in Nigeria",
    "summarized_story": "The Gumi factor and the politics of insecurity in NigeriaBy the provisions of the Constitution of the Federal Republic of Nigeria, the President of the country is said to be among the most powerful presidents in the world.\nBut it appears that there are some individuals in Nigeria today, commonly referred to as non-state actors, that are more powerful than the president.\nThese actors…"
  },
  {
    "headline": "Six countries show Nigeria’s poverty reduction goal is achievable",
    "summarized_story": "Nigeria’s President Muhammadu Buhari on Tuesday inaugurated the Steering Committee of the National Poverty Reduction with Growth Strategy (NPRGS) to achieve his mission of lifting 100 million Nigerians out of poverty within a decade.\nAlready, he has claimed that his administration has successfully lifted 10.5 million Nigerians out of poverty in the last two years…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Obaseki unveils plans for Benin City Cultural District, EMOWAA pavilion …chronicles journey for return of Benin artifacts – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has unveiled plans for the Benin City Cultural District, which will house the Edo Museum of West African Arts (EMOWAA).\nObaseki disclosed this at the 2021 National Commission for Museums and Monuments (NCMM) Retreat for management staff and curators held in Benin City, the Edo State capital.\n“In this plan, we have included the carving out of a large area as a Cultural District and the Museum will be located in the Cultural District.\nIf we host 5,000 visitors every year as a result of the attraction to the Museum, the state will benefit from it.\n“The Edo Museum of West African Arts (EMOWAA) is a big opportunity for us to be at the forefront of promoting and establishing this museum."
  },
  {
    "headline": "Edo govt, NDLEA link rising crime rate to drug use, lead walk against drug abuse – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government and the National Drug Law Enforcement Agency (NDLEA), as part of activities to mark the 2021 International Day Against Drug Abuse and Illicit Trafficking, led other stakeholders in a sensitization road walk against drug abuse and trafficking across the Benin metropolis.\nThe International Day Against Drug Abuse and Illicit Trafficking is observed globally every June 26 to strengthen action and cooperation to achieve the goal of an international society free of drug abuse.\nTo raise awareness on the dangers of the menace, the Edo State Drug Control Committee (ESDCC) and NDLEA staged a walk from Edo State Secretariat to Sakponba Road, Ring Road, and Sapele Road, warning residents against the intake of drugs.\nAccording to him, “We took this walk against drug abuse today to create the necessary information in society.\nDrug abuse is an ill that must be eradicated completely."
  },
  {
    "headline": "Edo govt pays June salaries, pensions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government on Friday paid June salaries and pension to workers and retirees in the state, in furtherance of efforts by the Governor Godwin Obaseki-led administration to keep to its promise of prompt remuneration to sustain the welfare of workers.\nSecretary to the State Government, Osarodion Ogie Esq., in a statement, reassured that the Obaseki-led administration will sustain its commitment to workers’ welfare, ensuring that public servants and retirees get what is rightly due them for their service to the state.\nAccording to him, “The Edo State Government has paid June salaries and pension to workers and retirees, in continuation of the trend of meeting its statutory obligation well before the end of the month.”Noting that the government remains committed to the welfare of workers in the state, Ogie noted, “The Edo State Government will not relent in its efforts at sustaining its worker-friendly disposition and ensuring an enabling environment for workers to perform optimally.\n“It is imperative that workers reciprocate this gesture by displaying an unalloyed commitment to their duties and supporting the governor in the actualisation of the ‘Making Edo Great Again’ Agenda.”..."
  },
  {
    "headline": "Continuous Voters Registration: INEC Launches Online Portal – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Independent National Electoral Commission (INEC), Thursday launched the online Portal for the continuous voters registration exercise nationwide.\nAccording to the chairman, the register of voters is at the heart of democratic elections, stating that “a good register of voters is a precursor to a good election.\nThe chairman also said that, Monday 28th June 2021 remains sacrosanct, as the registration of voters will commence in full nationwide.\nSome citizens may also have one form of disability or another to make it impossible for them to register online.\n“I wish to assure you that in addition to the online registration portal, there will be some 2,673 centres where citizens can register physically nationwide”, he added."
  },
  {
    "headline": "Police officers engage Boko Haram in shootout, rescue kidnapped travellers",
    "summarized_story": "ADVERTISEMENTA security team led by police officers engaged Boko Haram gunmen in a shootout and rescued many people earlier kidnapped by the terrorists.\nThe incident happened on Friday and involved the Rapid Response Squad (RRS) of the Borno State Government.\nThe attack on travellers on the route was the first since February when gunmen attacked a bridal train and abducted many of them.\n“I was coming in from Damaturu with my Maiduguri-bound passengers when suddenly I saw a military vehicle trailing.\n“We ran into the bush, as we noticed three more trucks of Boko Haram coming."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Troops Kill Scores Of Bandits, Recover Weapons In Zamfara",
    "summarized_story": "The Nigerian Army has said its troops killed scores of bandits and recovered arms and ammunitions in fierce encounters with the marauding bandits in Zamfara State.\nAdvertisementsThe director, Army Public Relations, Brig Gen Onyema Nwachukwu, said troops of 8 Division Nigerian Army (NA), while on a fighting patrol, came under fire of bandits operating along Mayanchi-Dogo Karfe and Fagantama villages in Talata Marafa LGA of Zamfara State.\nHe said in the fierce encounter that ensued, the troops overpowered the bandits, killing scores while one PKT riffle, large cache of ammunition, and a motorcycle were recovered.\nIn a related development, troops neutralised five bandits in another encounter at Bingi village, in Bungudu LGA of the State.\nThe troops recovered one AK47 riffle, one motorcycle and three mobile phones from the routed criminals."
  },
  {
    "headline": "Troops Kill Scores Of Bandits, Recover Weapons In Zamfara",
    "summarized_story": "The Nigerian Army has said its troops killed scores of bandits and recovered arms and ammunitions in fierce encounters with the marauding bandits in Zamfara State.\nAdvertisementsThe director, Army Public Relations, Brig Gen Onyema Nwachukwu, said troops of 8 Division Nigerian Army (NA), while on a fighting patrol, came under fire of bandits operating along Mayanchi-Dogo Karfe and Fagantama villages in Talata Marafa LGA of Zamfara State.\nHe said in the fierce encounter that ensued, the troops overpowered the bandits, killing scores while one PKT riffle, large cache of ammunition, and a motorcycle were recovered.\nIn a related development, troops neutralised five bandits in another encounter at Bingi village, in Bungudu LGA of the State.\nThe troops recovered one AK47 riffle, one motorcycle and three mobile phones from the routed criminals."
  },
  {
    "headline": "Stakeholders Advocate NiMET Commercialisation Over Paucity Of Funds",
    "summarized_story": "Stakeholders in the nation’s aviation sector have called on the federal government to commercialise the Nigerian Meteorological Agency (NiMET) over lack of adequate funding for the agency.\nAdvertisementsThey argued that NiMET as a world-class meteorological agency cannot be allowed to suffer financially after investing huge sums of money in equipment acquisition.\nAbioye, the immediate past general-secretary of NUATE, noted that critical services rendered by NIMET should be paid for by the end users.\nHe called for the commercialisation of the agency to enable it generate revenue to pay salaries and maintain its facilities.\nOn his part, the general secretary of NUATE, Comrade Ocheme Abah, called for improved welfare package for staff of NiMet."
  },
  {
    "headline": "Stakeholders Advocate NiMET Commercialisation Over Paucity Of Funds",
    "summarized_story": "Stakeholders in the nation’s aviation sector have called on the federal government to commercialise the Nigerian Meteorological Agency (NiMET) over lack of adequate funding for the agency.\nAdvertisementsThey argued that NiMET as a world-class meteorological agency cannot be allowed to suffer financially after investing huge sums of money in equipment acquisition.\nAbioye, the immediate past general-secretary of NUATE, noted that critical services rendered by NIMET should be paid for by the end users.\nHe called for the commercialisation of the agency to enable it generate revenue to pay salaries and maintain its facilities.\nOn his part, the general secretary of NUATE, Comrade Ocheme Abah, called for improved welfare package for staff of NiMet."
  },
  {
    "headline": "Kwara To Establish Cancer Treatment Centre",
    "summarized_story": "The Kwara State government is set to establish a multi-billion naira Cancer Treatment Centre.\nAdvertisementsThe Centre will be situated within the premises of the expansive Ilorin General Hospital in the state capital.\nHe said the centre when it becomes operational will also reduce huge financial resources committed to medical tourism in the treatment of cancer by Nigerians .\nThe centre will serve as timely intervention for treatment of cancer for indigenes of the state and neighbouring states such as Niger, Kogi, Oyo and Osun with all the potentials to be the best cancer treatment centre in the entire North-Central zone.\nADVERTISEMENTThe telemedicine innovation, which will provide medical interventions including referral services, targets citizens of the state in remote rural areas."
  },
  {
    "headline": "Nigerian Bishop makes a comprehensive list of adulterous pastors and politicians",
    "summarized_story": "A Nigerian Bishop, identified as Don Simon Osieme has compiled a comprehensive list of all adulterous pastors and politicians across Isoko land in Delta State.\nThe cleric took to his social media to share the list immediately after his children arrive safely in Texas, USA.\nAccording to him, the list contains profile cases of adultery perpetuated by pastors and politicians with whom, when, and where.\nHe wrote; ADULTERYMANIA SAGA VS THE HIDDEN EYES”Adultery by a wife in Isoko tradition is attempted murder and in some cases very close to me, first-degree murder.\nNo current Isoko House of Assembly member is on this list."
  },
  {
    "headline": "No graduate should be employed without certificate of national service – DG NYSC",
    "summarized_story": "Ukpono Ukpong, AbujaAll Employers of labour in the public and private sector have been warned against employing graduates without demanding for Certificate of National Service.\nThe Director-General, National Youth Service Corps (NYSC), Brig Gen Shuaibu Ibrahim, gave the warning yesterday at the opening ceremony of Corps Legal Aid Workshop, yesterday in Abuja.\nSpeaking further, he advised all employers to present the NYSC certificates of their existing employers to the scheme for authentication.\n“Would like to use this medium to remind all employers in the public and private sectors that it is mandatory to demand the Certificate of National Service or Exemption Certificate duly issued by the National Youth Service Corps before offering employment to any holder of Degree or Higher National Diploma.\nHe urged Legal Officers and Corps Lawyers to redouble efforts at enlightening the general public on the provisions of the NYSC Act."
  },
  {
    "headline": "Senate places 75% import duties on importation of syringes, needles",
    "summarized_story": "Tunde Opalana, AbujaThe Senate has ordered a hike in importation duties on syringes and needles into the country and therefore recommended 75 percent port duties.\nThe two directives were meant to protect local manufacturers, give them enabling environment to contribute to the revenue base of the nation and to reduce unemployment.\n“Importation of syringes and needles is killing local manufacturers making them to lay off staff and preventing them from contributing effectively to the economy.\nThis has been an impediment to local manufacturers attaining this status and preventing their being patronized by organisations using donor funds”.\n“The local manufacturers are actually the highest supplies of syringes and needles for hospitals."
  },
  {
    "headline": "FG flags off training for Irish Potato farmers in Kano",
    "summarized_story": "By Nneka NwogwugwuThe Federal Ministry of Agriculture and Rural Development (FMARD) has commenced training for Irish potato farmers in Kano.\nFlagging off the training on Monday at Gezawa Local Government Area of the state, Hajia Karima Babangida, the Director, Federal Department of Agriculture, who spoke on the topic, ‘re-educating Irish potato farmers on farming as business rather than been a culture’, said that Nigerian farmers must begin to change the narratives about farming as a culture to farming as a business.\n‘’It’s important to know that FBS is capable of starting a potato revolution here in Bauchi State especially in Toro LGA and other communities in the state that has potentials to grow potato during dry season.\n‘’FMARD is also poised to build the capacity of farmers in other states with potentials to grow Irish potato with new innovations and techniques on GAP and FBS to ensure productivity and income generation.\nThe training which began on Monday, June 21, will end on Friday June 25, 2021."
  },
  {
    "headline": "Entertainers, media personalities, others gather for Bodex Social Media Hangout",
    "summarized_story": "CEO of Bodex media and convener of the event, Florence Bodex Hungbo, said the theme of this year’s Social Media Hangout came long before the twitter ban and she felt God was using her to pass across a message through the theme.\nI love to create a very good relationship with people I come across and the result is what you are seeing with the class of people present here todayShe hinted that there is still hope for traditional media platforms only if they are able to look for innovative ways to merge social and traditional media to achieve results.\n“There is still hope for traditional media.\nWhat we need to do is to have a road map that can enable us to co-exist.\nWe need to find out what others do traditionally, and what others do digitally for us to be able to coexist and be trendy."
  },
  {
    "headline": "Entertainers, media personalities, others gather for Bodex Social Media Hangout",
    "summarized_story": "CEO of Bodex media and convener of the event, Florence Bodex Hungbo, said the theme of this year’s Social Media Hangout came long before the twitter ban and she felt God was using her to pass across a message through the theme.\nI love to create a very good relationship with people I come across and the result is what you are seeing with the class of people present here todayShe hinted that there is still hope for traditional media platforms only if they are able to look for innovative ways to merge social and traditional media to achieve results.\n“There is still hope for traditional media.\nWhat we need to do is to have a road map that can enable us to co-exist.\nWe need to find out what others do traditionally, and what others do digitally for us to be able to coexist and be trendy."
  },
  {
    "headline": "Madonna stuns gay fans with breast-baring club performance",
    "summarized_story": "Madonna stunned fans at The Standard Hotel’s Boom Boom Room in New York on Thursday night by performing on the bar.\nThe pop superstar belted out her tracks Hung Up and I Don’t Search I Find as stars like Lance Bass, Adam Lambert, Zachary Quinto and Jon Batiste looked on from the crowd during the Boom x Pride event.\nWearing a blue wig, red elbow-length gloves and a revealing black leather and lace outfit that left her breasts exposed, Madonna told the thrilled clubbers in footage posted on social media,”To not celebrate pride without people would have been a tragedy for me…Take nothing for granted because you never know what’s waiting for all of us around the corner.\nLearn to love yourself.”Madonna and Quinto auctioned off Polaroids for two LGBTQ support groups – the Ali Forney Center and the Haus of US – and then each pledged a personal donation of $25,000 (£18,000).\nMusicnewsShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Madonna stuns gay fans with breast-baring club performance",
    "summarized_story": "Madonna stunned fans at The Standard Hotel’s Boom Boom Room in New York on Thursday night by performing on the bar.\nThe pop superstar belted out her tracks Hung Up and I Don’t Search I Find as stars like Lance Bass, Adam Lambert, Zachary Quinto and Jon Batiste looked on from the crowd during the Boom x Pride event.\nWearing a blue wig, red elbow-length gloves and a revealing black leather and lace outfit that left her breasts exposed, Madonna told the thrilled clubbers in footage posted on social media,”To not celebrate pride without people would have been a tragedy for me…Take nothing for granted because you never know what’s waiting for all of us around the corner.\nLearn to love yourself.”Madonna and Quinto auctioned off Polaroids for two LGBTQ support groups – the Ali Forney Center and the Haus of US – and then each pledged a personal donation of $25,000 (£18,000).\nMusicnewsShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Nigeria will chase APC out in 2023 to stop suffering – Wike",
    "summarized_story": "By Okafor Ofiebor/ Port HarcourtGovernor of Rivers State, Nyesom Ezenwo Wike has declared that the current sufferings visited on Nigerians will make them to chase the All Progressives Congress (APC) led federal government out of power in 2023.\nWike noted that APC rode on social media propaganda that sounded so convincing at the time, but had since demonstrated how clueless they are in matters of governance.\nA party that came through propaganda, social media, lies; now we have seen what we have caused ourselves.\nWill you allow them use the social media to deceive us?\nIf Nigerians make the mistake again and allow these (APC) people in 2023, then you have dug your graves."
  },
  {
    "headline": "Troops neutralize bandits, recover ammunition in Zamfara",
    "summarized_story": "The Nigerian Army said its troops of 8 Division have eliminated an unspecified number of bandits in fierce encounters in Talata Marafa Local Government Areas of Zamfara.\nNwachukwu said that troops, while on a fighting patrol, came under fire from bandits operating along Mayanchi-Dogo Karfe and Fagantama villages in the area.\nHe said the bandits were overwhelmed by the superior firepower of the troops in the fierce encounter that ensued where scores of bandits were neutralised.\nNwachukwu also disclosed that the troops neutralised five bandits in another encounter at Bingi village in Bungudu Local Government Area of the state.\n“He urged communities in the North West to support the troops with useful information at all times to enhance anti- banditry operations,” he said."
  },
  {
    "headline": "Abidemi Rufai : Federal marshals moving him to Washington state",
    "summarized_story": "Agency ReportsAbidemi Rufai, the suspended Ogun government official now detained in New York, will be transported by federal marshals to Washington State for trial.\nJudge Settle agreed with federal prosecutors that the 42 year-old Rufai represented a flight risk.\nHe was charged after allegedly stealing over $350,000 in jobless benefits from the Washington state Employment Security Department in 2020.\nWashington state was severely victimized by fraudulent claims for pandemic-related benefits.\nHe also stole around $53,000 in federal disaster loans, according to an indictment returned Wednesday in federal district court in Tacoma."
  },
  {
    "headline": "In Osun, NDLEA Arrests 253 Suspects",
    "summarized_story": "The National Drug Law Enforcement Agency’s (NDLEA) Osun State Command said on Friday that 253 drug suspects had been apprehended in the state.\nAccording to Samuel Egbeola, the Osun NDLEA commander, the agency also confiscated 385.539 kilogrammes of various illicit narcotics.\nWhile marking 2021 United Nations International Day Against Drug Abuse And Illicit Trafficking, Egbeola noted that the feats achieved were made possible through the assistance of several stakeholders.\nThe theme for this year is ‘SHARE THE FACTS ON DRUG AND SAVE LIVES’.\n“This theme highlights the notion and misinformation that has been going on about drugs and the need to share the facts and save lives."
  },
  {
    "headline": "Ondo Versity Closed As Gunmen Rape Four Female Students",
    "summarized_story": "Hundreds of Olusegun Agagu University of Science and Technology (OAUSTECH) students in Okitipupa, Ondo State, have demonstrated against the alleged rape of four female students at the university by gunmen.\nThe hoodlums also looted the students of their goods such as phones, computers, and gadgets before rapping the female students at gunpoint, according to source.\nStudents from the university marched out to express their unhappiness with the frequent robberies in their dorms, threats to their lives and property, and rape of female students.\nHe confirmed that four female students were raped by the hoodlum who invaded the institution from the neighbourhood.\nAccording to him “We are tired of this insecurity, armed hoodlums usually come to our off-campus hostels, rob students at gunpoint, and also rape our female students."
  },
  {
    "headline": "Boko Haram Attempts to Take Over Kaduna’s Air Force Base",
    "summarized_story": "According to an Air Force official, as of 6 a.m. on Saturday, a gunfight between terrorists and military personnel had lasted nearly two hours.\nOn Saturday morning, Boko Haram, an Islamic extremist group, attempted to take over the Nigerian Air Force facility in Kaduna.\nAccording to Newsmen, a gunfight between terrorists and military personnel lasted nearly two hours as of 6 a.m. on Saturday, according to an Air Force official.\nThe Air Force base, which is large in expanse, is susceptible to being porous.\nHe, therefore, expressed shock that the barracks could be so porous for bandits to attack without any form of resistance."
  },
  {
    "headline": "Police Storm Three IPOB/ESN Camps, Kill Members In Imo (Photos)",
    "summarized_story": "Nigerian police stormed camps of alleged Eastern Security Network (ESN) members, the militia branch of the Indigenous Peoples of Biafra (IPOB) group, on Friday.\nMany ESN members were reportedly slain in the raid, which took place in the Atta, Izombe, and Ideato North parts of the state.\nThree camps purportedly connected to IPOB/ESN were fully overrun by the combined security squad.\nAccording to sources, a group commander who had previously been jailed led the operatives to the camps, where they discovered multiple weapons, stolen vehicles, explosives, gun powders, charms, cannabis, ammo, hard drugs, and the gang’s flags.\nSix of the individuals, he claimed, had been captured and were actively assisting police with their investigation."
  },
  {
    "headline": "Hunger, starvation imminent over security concerns",
    "summarized_story": "BENJAMIN SAMSON in this report examines the effects of the ugly security situation on food production and availability.\n“The security situation has crippled the economy as travelling on the highways across the country has become a nightmare to Nigerians.\nFAO, ActionAid’s alarmsIn the same vein, the Food and Agriculture Organisation (FAO) has raised the alarm over the worsening state of food security in the country.\nIt, therefore, stressed the need for urgent measures to protect the most vulnerable, keep the national agricultural supply chains functional and efficient, and mitigate the food security impacts of the Covid-19 pandemic.\nFor example, wheat remains an imported production input costing Nigeria about N222 billion in the first quarter of 2021 alone."
  },
  {
    "headline": "Breaking: DSS invites Sheikh Gumi over comment on Nigerian Military",
    "summarized_story": "Kaduna-based Islamic cleric, Sheikh Ahmad Abubakar Gumi, has been reportedly invited the Department of State Security ( DSS) for questioning over remarks he made on Arise TV interview that allegedly portrayed the Nigerian military in bad light.\nThis was revealed via a report by the Voice of America, VOA, Hausa service monitored on Friday.\nThe report said Gumi was invited at the Kaduna office of the DSS, after the military authorities took exception to comments by Sheikh Gumi, alleging that their operatives were conniving with bandits.\nDetails coming…"
  },
  {
    "headline": "VIDEO: Watch Super TV CEO’s last outing with ‘Killer’ girlfriend",
    "summarized_story": ""
  },
  {
    "headline": "Adanyi Commends Buhari. For appointing Jime Executive Secretary of Shippers Council -NigPilot",
    "summarized_story": "Barrister Adanyi, a Frontline aspirant for the Benue zone B senatorial seat on the platform of the All Progressives Congress, APC described Jime as a credible and proper person who will drive the vision of the organization and establish footprints of new thinking and dynamism that would usher in a fresh beginning for the good of all.\n“I have no doubts in my mind that Honourable Jime will drive the vision of that key transport sector with vigour and deliver on its mandate to boost the economic fortunes of Nigeria”.\nHe further commended the Leader of the party in the North Central and Minister for Special Duties and Inter-Governmental Affairs, Senator George Akume for his usual recommendations to ensure that those deserving of certain responsibilities are brought on board to contribute their quota to the development of Nigeria.\nHe, therefore, called on the newly appointed Executive Secretary to do all within his powers to make his state proud and Nigeria in general through well thought out policies that would fuel the desired economic drive of the country.\nHe maintained that the shippers` council needs the kind of leadership with the type of zeal that Honourable Jime is capable of deploying just as he described him as the right peg who had excelled while at the headship of Nigeria Export Processing Zones Authority, NEPZA as Managing Director."
  },
  {
    "headline": "PDP disowns illegal inauguration of LGA Chairmen in Niger State chapter -NigPilot",
    "summarized_story": "Peoples Democratic Party (PDP) has alerts members and the general public that it did not authorize the inauguration of some unidentifiable persons as local government area chairmen in its Niger state chapter.\n“The Niger State Caretaker Committee, acting on the directive of the NWC, will not tolerate the activities of such individuals who have no legal powers to preside over the affairs of the Party in the state.\n“Accordingly, the purported inauguration of some unidentifiable persons as LGA party Chairmen in Niger state is unknown to the party, illegal, of no effect and should stand disregarded.\nThe party advised our members in Niger State to be wary and to distance themselves from such persons as their activities are without the consent of our party.\n“We urge the members of our PDP in Niger State to remain steadfast, and await further directives from the National Working Committee.”"
  },
  {
    "headline": "APC names national secretariat ‘Buhari House’, releases timetable for congresses -NigPilot",
    "summarized_story": "The party has also named its national secretariat after President Muhammadu Buhari, and now to be known as ‘Buhari House’.\nThis came after President Buhari approved the review of the caretaker/Extraordinary Convention Planning Committee, CECPC , timeline, and timetable for APC Congresses.\nThis was contained in a statement issued Friday by the secretary to the CECPC, Sen James Akpanudoedehe.\nThe statement further explained that the President also approved the timetable for APC Ward, Local Government, and State Congresses.\nAccording to the statement, Ward Congresses will hold 24th July 2021 followed by Local Government Congresses on 14th August 2021, and State Congresses on 18th September 2021."
  },
  {
    "headline": "Australia commends FG for promoting peace in West Africa-NigPilot",
    "summarized_story": "David Hurley AC DSC (retd) has commended the role the Federal Government of Nigeria is playing in promoting peace and stability in the West African sub-region and other parts of Africa.\nThe Governor-General said this when the Nigeria High Commissioner, Mr. Anderson Madubike presented his Letters of Credence to him in Canberra.\nHe also said that Nigeria being the regional power in Africa is very important and strategic to Australia.\nHe wished the High Commissioner a successful tour of duty in Australia.\nHe further assured the Governor-General that the cordial relations between the two friendly countries would grow from strength to strength during his tour of duty."
  },
  {
    "headline": "How Education Was Suspended In Nigeria During A COVID-19 Lockdown",
    "summarized_story": "“I kind of feel like it’s very unfair that public school students and private school students would sit for the same exams.\nOn paper, the Federal Government developed several initiatives to ensure students continued to learn despite the pandemic lockdowns, through the Nigeria Education Sector COVID-19 Response Strategy set up by the Federal Ministry of Education and the Universal Basic Education Commission (UBEC).\nBecause a basic thing the child should get before leaving primary education is literacy.\nThere were radio programs, but he wasn’t sold on their effectiveness for primary school students.\n“In the education sector, we are about 50 years behind developed countries.”More than ever, Nigeria must work to democratise digital education."
  },
  {
    "headline": "DSS Invites Sheikh Gumi For Questioning",
    "summarized_story": "The Department of State Services on Friday said it has invited Kaduna-based cleric Sheikh Ahmad Gumi for questioning.\n“Sheikh Gumi was invited by the Service,” the service’s spokesmperson, Peter Afunaya, said in a response to a Channels Television enquiry.\n﻿Although the DSS did not confirm the rationale for the invitation, Sheikh Gumi has recently been outspoken on the issue of banditry in Nigeria.\nIn a recent interview, Gumi alleged that some military operatives actively connive with bandits to wreak havoc on the country.\nHowever, Gumi, who has visited some bandit groups in the forests where they reside, has advocated for the bandits to be treated with compassion."
  },
  {
    "headline": "Nobody Invited Me For Questioning Or Any Arrest – Sheikh Gumi",
    "summarized_story": "﻿Kaduna-based Islamic cleric, Sheikh Ahmad Gumi, has debunked reports that he was either quizzed or invited for questioning by the Department of State Security Service (DSS) over his remarks against the military.\nRead Also: DSS Invites Sheikh Gumi For QuestioningHe also insisted that he never made any disparaging remarks against the military during his recent live interview on national television.\nAccording to him, there was nowhere in the TV interview that he categorically accused the entire military.\nThe DSS had earlier on Friday said it invited the cleric for questioning.\n“Sheikh Gumi was invited by the Service,” the service’s spokesman, Peter Afunaya, said in a response to a Channels Television enquiry."
  },
  {
    "headline": "APC Is Back To Life, Says Buhari",
    "summarized_story": "President Muhammadu Buhari Friday in Abuja said the All Progressives Congress (APC) has been revived, energized, and repositioned for its national convention and future elections while commending the National Caretaker/Extraordinary Convention Planning Committee (CECPC) led by Governor of Yobe State, Malam Mai Mala Buni.\nThe CECPC Chairman told the President and other party members that 14 party members had indicated their interest to contest for the Anambra State elections, assuring that the primary elections will be free, fair, and transparent.\nThe Yobe State governor said huge legal fees were inherited, and the committee had worked with members to settle all the outstanding, after scaling them down, noting that payment for the APC National Secretariat had been completed.\n“The party members have agreed to name the secretariat, Muhammadu Buhari House,’’ he added.\nOthers are, Governor of Kaduna State, Nasir el’Rufai, Governor of Osun State, Adegboyega Oyetola, and Governor of Niger State, Abubakar Sani Bello."
  },
  {
    "headline": "18 Killed, 16 Injured In Fire At China Martial Arts School",
    "summarized_story": "At least 18 people were killed and 16 injured when a fire broke out at a martial arts school in central China in the early hours of Friday, according to the local government.\nOfficial state news agency Xinhua reported that all victims were boarding pupils, while local media said they were aged between seven and 16.\nAn official confirmed to AFP that the school was the Zhenxing Martial Arts Centre.\nLocal media reports described it as a “comprehensive martial arts training institution” that aimed to “strengthen the body through morality and martial arts”.\nAmong the largest is the famous Shaolin Martial Arts School, which has hundreds of teachers and tens of thousands of students, according to its website."
  },
  {
    "headline": "Police arrest gun runner who supplies arms to bandits in Katsina",
    "summarized_story": "The Police in Katsina have paraded a notorious arms supplier to bandits Ibrahim Abdullahi, 40, who specialized in supplying guns to bandit’s camps in different parts of the country, alongside 4 of his gang members.\nThe team leader according to him confessed in the course of investigation that he was being paid the sum of N100,00 per rifle.\nAdvertisementThe spokesman also disclosed other arrests made during a bandit operation where the bandits in their numbers, riding on motorbikes, shooting sporadically with AK- 47 rifles, attacked Tinya village, Batsari LGA of Katsina state and rustled some domestic animals.\nHe said: “A team of Policemen in collaboration with a vigilante group chased after the hoodlums, engaged them into a fierce gun duel, killed one of the bandits, and recovered one AK- 47 rifle.\nThe scene was immediately scanned by the gallant officers who successfully recovered 12 cows and 11 sheep, rustled by the bandits.”"
  },
  {
    "headline": "Gov. Matawalle pays N100m WAEC fees for Zamfara Students",
    "summarized_story": "The Zamfara state Governor Bello Matawalle has approved the payment of one hundred million Naira examination fee for Zamfara students.\nThe money will be paid to the West African Examination Council, WAEC to enable Zamfara students seat for the 2021 O’level ExaminationA statement signed by the Press Secretary Jamilu Iliyasu said, the payment of the examination fee is part of Governor Bello Matawalle’s stride in encouraging Education in the stateHe assures of the Governments readiness to do all within its power to ensure Zamfara students comes out with flying colours in coming examination.\nGovernor Bello Matawalle appreciates the support of the Federal Ministry of Education and the West African Examination Council for understanding and concern towards the development of education in the state, despite the huge backlog of exam fees owed by the previous administrationAdvertisementThe Governor noted with satisfaction the support of the Federal Ministry of Education to the state, adding that the ministry has been supportive to the course of Education in Zamfara.\nThe Matawalle’s administration assures it will continue to meet its obligations as part of Measures to meet the yearnings and aspirations of the people, especially the young generation through the provision of sound and quality education."
  },
  {
    "headline": "Bandits Abduct Jaba Local Gov’t Vice Chairman, Others in Kaduna",
    "summarized_story": "Gunmen have abducted the Vice Chairman of Jaba Local Government Area of Kaduna state.\nJames Bijimi was whisked away on the Kaduna-Kachia road on Friday with an unspecified number of travellers.\nSpokesperson of Kaduna State Police Command, Mohammed Jalige, confirmed the incidence but couldn’t confirm the actual number of persons taken away.\nLocals in the area say the bandits blocked the road around Gonan Roger and Makyali community in Kajuru local government area where they intercepted and took away commuters.\nThe incidence is coming barely two days after bandits attacked Kachia town killing one person and abducting 33 others."
  },
  {
    "headline": "#EndSARS: Lagos Panel Awards N83m Compensation to Victims of Police Brutality",
    "summarized_story": "The Lagos State Judicial Panel of Inquiry and restitution for SARS related abuses and other matters has awarded a total amount of N83 million in compensation to victims of police brutality.\nAmong those compensated was the family of late Kolade Johnson, awarded the sum of N10 million.\nNigerians voiced their outrage on social media after Johnson was shot during a raid by police officers at Onipetesi area in Lagos on March 31, 2019.\nArise Correspondent, Seyitan Atigarin the details."
  },
  {
    "headline": "Special Report: A Closer Look At Orisa Spirituality",
    "summarized_story": "Yoruba indigenous religion, also known as Orisa spirituality, is practiced by a very small percentage of the population today.\nIn this report, Arise News Correspondent Laila Johnson-Salami visited the family home of an Orisa Priestess in Ibadan, to learn more about the practice…"
  },
  {
    "headline": "Over a Dozen Vaccinated Doctors Dead Amid Indonesia Covid Surge",
    "summarized_story": "More than a dozen fully vaccinated doctors have died of Covid-19 in Indonesia, according to a medical association, as the Southeast Asian country battles a rash of severe cases in inoculated medical workers and highly infectious new virus strains.\nThis month, more than 300 vaccinated doctors and healthcare workers in Central Java were found to have been infected with COVID-19, with about a dozen hospitalised.\nThe country is also grappling with new virus strains, including the highly infectious Delta variant first identified in India.\nMore than a third of the cases reported were elementary school-age students, while a quarter were high school-age students, Inke was quoted by Detik as saying.\n“My sample was among the tested sampling for the Delta variant."
  },
  {
    "headline": "Colombia President Iván Duque’s Helicopter Hit by Gunfire",
    "summarized_story": "Gunfire has hit a helicopter carrying the president of Colombia as it flew near the border with Venezuela.\nPresident Iván Duque was flying toward Cúcuta in the Norte de Santander province, alongside the defence minister, interior minister, and the province’s governor.\n“Our state is strong and Colombia is strong to confront this kind of threat,” he said in a video address posted on Twitter.\nLocal newspaper Semana reports the occupants heard a noise as if something had hit the engine just as the helicopter was coming in to land.\nEarlier this month the ELN denied any involvement in a car bomb attack on a military base in Cúcuta."
  },
  {
    "headline": "Widow Seeks ‘Thorough’ Investigation into John McAfee Death",
    "summarized_story": "“We had a plan of action already in place to appeal that decision,” Janice McAfee told reporters.\nIt said: “We are closely monitoring local authorities’ investigation into the cause of death.\nJohn McAfee had several children from previous relationships, Janice McAfee said.\n“Even though he was born in England, America was his home,” Janice McAfee said.\n“All John wanted to do was spend his remaining years fishing and drinking,” his widow said on Friday."
  }
]