[
  {
    "headline": "Close network deficit in rural areas, CITAD urges FG",
    "summarized_story": "The Centre for Information Technology and Development has called on the Federal Government to create a national policy for community networks in Nigeria that will bridge communication network deficits in rural areas.\nThe Executive Director, CITAD, Yinusa Yau, made the call during a press conference on Thursday in Abuja.\nHe stressed the need to unleash the potential of community networks to address connective gaps.\nHe said CITAD acknowledged the various efforts that the Minister of Communication and Digital Economy had made towards repositioning the country for a digital transformation.\nHe, therefore, called on the ministry and agencies under it to create a national policy that would be beneficial to those in the rural areas."
  },
  {
    "headline": "FG pays N2.03tn interest on CBN loans in 23 months",
    "summarized_story": "The Federal Government paid interest of N2.03tn from January 2020 to November 2021 on the loans it got from the Central Bank of Nigeria through the Ways and Means Advances, according to official data.\nWays and Means Advances is a loan facility used by the central bank to finance the government in periods of temporary budget shortfalls subject to limits imposed by law.\nAccording to the bank, the CBN financing and the fuel subsidy tend to adversely affect investments in human and physical capital.\nIt said that the government had always under-budgeted for debt service as the government failed to consider the cost of ways and means financing in its debt service allocation.\nThe agency said that the use of central bank financing in Nigeria could raise risks to macro-stability in the context of weak institutional safeguards that preserve the credibility of policymaking and the ability of the central bank to control inflation."
  },
  {
    "headline": "IMF’s debt service projection for Nigeria worries experts",
    "summarized_story": "Financial and economic experts have expressed concerns over the International Monetary Fund’s debt service-to-revenue ratio projection for Nigeria.\nThe IMF had on Monday predicted that Nigeria’s debt service-to-revenue ratio would jump to 92 per cent in 2022 from 76 per cent in 2021.\n“Also, capital expenditure will be the worst hit if the government continues the way it is going, which will mean no infrastructure for Nigeria.\nThe Managing Director, Cowry Asset Management Limited, Johnson Chukwu, said the projection of the IMF was expected as the government spent over 70 per cent of its revenue on debt servicing as of November 2021.\nHe said the government could offset the negative consequences associated with its rising debt profile by cutting out unnecessary expenditure from its budget."
  },
  {
    "headline": "BUK Tv station to take up soon — HOD",
    "summarized_story": "By Bashir Bello, KANOThe Head of Department, Mass Communication, Bayero University Kano, BUK, Dr Mainasara Kurfi has on Saturday dropped a hint that the department’s television station will soon commence operation.\nJournalism and Media Studies, B.Sc.\nBroadcasting, B.Sc.\nFilm and Multimedia Studies, B.Sc.\nDevelopment Communication Studies, B.Sc."
  },
  {
    "headline": "Ugborodo youths call on Delta Govt to intervene in alleged SPDC neglect",
    "summarized_story": "youths protesting in UgborodoThe youths of Ugborodo community have called on the Delta State government to intervene in what they described as neglect by the SPDC management operation in their community.\nThe Youth Executives in a statement signed yesterday by its chairman and secretary Mr. Wilson Ejeh and Mr. Dennis Egbayinor noted that “Ogidigben, Ajudaibo down to Madangho Community Water Project have been abandoned by SPDC.\n“The electrification of Otumara down to Ode-Ugborodo , Ajudaibo, and Madangho communities has been abandoned also by SPDC.\n“SPDC has refused to pay attention to the only access road from Ogidigben Community Flow Station through Ogidigben, Ajudaibo down to Madangho community that has been a bad shape for years.\n“We will allow the management of SPDC play to disrespect the entire community”."
  },
  {
    "headline": "Valentine’s Day: FRSC to test drunkenness",
    "summarized_story": "Bose AdelajaAs Another Saint Valentine’s Day approaches, the Federal Road Safety Corps FRSC, Lagos Sector Command on Saturday, said its men will be deployed to strategic locations across the state to run test of drunkeness among motorists.\nTo achieve this, men of the corps will be with breathalyzers to test motorists in order to detect those who drive under the influence of alcohol and get them arrested accordingly.\nREAD ALSO:Presidential Visit: No diversion on Lagos/Ibadan Expressway ― FRSCOlusegun Ogungbemide, Lagos FRSC Sector Commander, who disclosed this over the weekend in a statement in Lagos said this is to curb infractions to traffic rules and regulations.\nThe men, he noted will be with breathalyzers to test motorists in order to detect those who drive under influence of alcohol and get them arrested accordingly.\nWhile wishing everyone a crash free celebration, he admonished motorists to avoid drunk and distracted driving."
  },
  {
    "headline": "2023: I’ll encourage youth development says Emmanuel’s preferred successor",
    "summarized_story": "By Chioma Onuegbu UyoTHE commissioner for Lands, and Water Resources, Akwa Ibom State, and governor Udom Emmanuel’s preferred governorship aspirant, Pastor Umo Eno has said he would promote youth development if given chance to govern the state in 2023.\nHis words, ” I believe that when God gives us the opportunity to run Akwa Ibom we know what to do.\nGovernor Udom Emmanuel by the grace of God has endorsed that I run for the office of governor of Akwa Ibom State.\nWe cannot just be players in Akwa Ibom, we can join the league of international players.\nThese are low-hanging fruits”The governorship aspirant assured that he would build on the legacies of the governor stressing, “I am a good student of governor Udom Emmanuel."
  },
  {
    "headline": "FCT Polls: PDP in early lead as Municipal Area Council results trickle in [Live updates]",
    "summarized_story": "FCT Polls: PDP in early lead as Municipal Area Council results trickle in [Live updates]"
  },
  {
    "headline": "NIN verification service portal fully restored – NIMC",
    "summarized_story": "The National Identity Management Commission (NIMC), on Saturday, announced the full restoration of its National Identification Number (NIN) verification service portal.\nThe portal went down due to maintenance by one of NIMC’s network service providers.\nThe downtime of the portal had affected telecommunication companies, banks, and government agencies who rely on NIN before rendering their services.\nThe Commission urged customers and service providers to take advantage of the restored platform.\nAccording to Adegoke: “The National Identity Management Commission (NIMC) is pleased to announce that the National Identification Number (NIN) Verification Service (NVS) portal, which went down a few days ago due to maintenance by one of the Commission’s network service providers of its infrastructure, has been fully restored."
  },
  {
    "headline": "Bishop Adebiyi: Fayemi mourns Ekiti scholar-priest",
    "summarized_story": "Ekiti State Governor, Kayode Fayemi, has described the passing of the retired Bishop of Lagos West Anglican Diocese, Peter Adebiyi, as a colossal loss.\nBishop Adebiyi, an indigene of Osi Ekiti in Ido Osi Local Government Area of Ekiti State died on Friday.\nGovernor Fayemi stated that the late Bishop Adebiyi simultaneously pursued a career in the ministry as well as a parallel career as an academic and taught at Ondo State University (now Ekiti State University) Ado Ekiti between 1983 and 1987 and later lectured at the Lagos State University, Ojoo.\n“The news of the death of Bishop Peter Adebiyi was shocking and unexpected.\n“Bishop Adebiyi was an excellent and inspiring Ekiti man who always spoke truth to power."
  },
  {
    "headline": "Buhari gives Zorro new appointment, sacks four aides of Aisha",
    "summarized_story": "President Muhammadu Buhari, on Saturday, authorised the appointment of Muhammad Sani Zorro, a former lawmaker, as the Senior Special Assistant to the President on Public Affairs and Strategy, Office of the First Lady.\nThis is as Buhari approved the sack of an aide and redeployment of three other aides of the First Lady, Aisha Buhari, to the office of the Secretary to the Government of the Federation.\nThis was made known in a statement titled, ‘President Buhari Approves Sami Zorro SSA to First Lady, Redeployment and Disengagement of Others’ on Saturday by Garba Shehu, Senior Special Assistant to the President on Media and Publicity.\n“Zorro, a famous journalist, brings to the new job decades of experience in media practice, publishing, and unionist leadership.\nHe was at various times President, Nigeria Union of Journalists, West African Journalists Association, and the Federation of African Journalists,” the statement read in part."
  },
  {
    "headline": "ASUU: Prevail on Buhari, FG to avert nationwide strike – ATBU urges traditional rulers, Nigerians",
    "summarized_story": "The ASUU branch chairman, informed that the Federal Government was yet to release the N1.5 trillion universities revitalisation funds as agreed.\nHe lamented that despite its inability to fulfil its part of the various MoUs and MoAs signed with the union, the Federal Government has increased charges being paid by students.\n“It is wrong for anyone to say that ASUU is insensitive to the problem the strike will have on the academic lives of the students.\nHe then called on the President to be sincere in implementing the various MoUs and MoAs instead of calling on ASUU to rescind its decision of going on another nationwide strike.\n“Mr President too should be sincere in implementing the various MoUs and MoAs in order to have stability in the tertiary education sector."
  },
  {
    "headline": "Akase fumes as security denies Gov Ortom access to receive Osinbajo in Makurdi",
    "summarized_story": "Mr. Terver Akase, former Chief Press Secretary to Governor Samuel Ortom has condemned the conduct of security personnel attached to the gate of the Air Force Base Makurdi who denied the governor to receive the Vice President, Professor Yemi Osinbajo.\nDAILY POST had reported that the governor, who was at the Air Force Base on Saturday to receive the Vice President, who was on his way to Taraba State, was bounced by security personnel at the gate.\nReacting, the Peoples Democratic Party, PDP, governorship aspirant in Benue State, Akase described the action of the security personnel as unfortunate and unwarranted in a democratic setting.\nHe enjoined other Nigerians, particularly those aspiring for the office of governor across party lines, to condemn the action of the Makurdi Air Base security personnel who were responsible for the incident, stressing that it can happen to anyone else tomorrow.\nBenue 2023: Akase reveals what to be prioritized if elected as governor"
  },
  {
    "headline": "Alleged N5b fraud: Why ex-JAMB Registrar Ojerinde’s plea bargain failed",
    "summarized_story": "Rejects custodial sentence as part of dealBegs anti-graft commission not to prosecute his childrenFresh facts emerged yesterday on why the plea bargain of a former Registrar, Joint Admissions and Matriculation Board (JAMB), Prof Adedibu Ojerinde, failed.\nThe ex-registrar is standing trial for alleged N5 billion fraud before a Federal High Court in Abuja presided over by Justice Obiora Egwuatu.\n“The plea bargain failed because the former JAMB registrar asked for a non-custodial sentence, meaning he cannot be given jail terms if his plea bargaining was accepted.\n“Secondly, he also asked in his conditions that his children should not be prosecuted by the anti-corruption agency.”The anti-graft commission however rejected his plea bargain.\n“The scale of justice ought to be balanced in favour of the system and not just Ojerinde.”ICPC counsel, Ebenezer Sogunle, had on Tuesday told the court that Ojerinde’s trial would proceed if the plea bargain failed."
  },
  {
    "headline": "Why Nigeria’s debt servicing is growing, by DMO",
    "summarized_story": "The Debt Management Office (DMO) has explained why Nigeria’s debt servicing is growing at an alarming rate.\nThe DMO re-iterated that the Federal Government “is already implementing policies towards increasing revenues and developing infrastructure through Public Private Partnership arrangements both of which will improve debt sustainability”.\nThe DMO also noted that the Federal Government has active and regular engagements with the IMF on borrowing and debt management.\n- Advertisement -The International Monetary Fund (IMF) recently said the Federal Government could spend as much as 92.6 per cent of its revenue on debt servicing in 2022.\nThe IMF estimated the 2021 debt servicing-to-revenue ratio at 85.5 per cent while Agusto’s 2020 debt-serving-to-revenue ratio projection was put at 90 per cent."
  },
  {
    "headline": "New Lagos airport international terminal for inauguration in March",
    "summarized_story": "The new terminal built by the Chinese Engineering Civil Construction Company (CECCC), at the Murtala Muhammed International Airport (MMIA), Lagos, has reached 98 per cent completion and would be inaugurated before the end of March 2022, Managing Director of Federal Airports Authority of Nigeria (FAAN), Captain Rabiu Yadudu has said.\nYadudu said disclosed this when Senate, and House of Representatives’ joint Committee on Aviation paid an oversight visit to the Federal Airports Authority of Nigeria at the Authority’s Headquarters annex in Lagos.\nHe requested the Committee to assist and collaborate with the Authority in finding lasting solutions to these challenges.\nHe added that FAAN should work more in the area of improving on airport security using technology, and also ensure that her human resources are well motivated.\nThe Chairman, House of Representatives Committee, Honourable Nnolim Nnaji on his part, advised that the new international terminal in Lagos should be reopened as soon as possible since it is the most patronized gateway in the nation."
  },
  {
    "headline": "FG pushes for harmonisation of universities, research centers",
    "summarized_story": "The Federal Government (FG) is pushing for universities and research centres in the country to work in harmony for the benefit of the nation.\nMinister of Science, Technology and Innovation, Dr. Ogbonnaya Onu said the nation would benefit tremendously in ensuring that host universities and energy research centres work in harmony.\nHe said in the past, universities and research institutions have worked in silos, which has not benefited the country as it should.\nHe said this in Abuja when the committee on review of the operational guidelines on Energy Research Centres submitted their report to the Ministry.\n- Advertisement -“The nation will benefit tremendously in ensuring host universities and energy research centres work harmoniously."
  },
  {
    "headline": "2023 Presidency: Tinubu visits Awujale, Alake",
    "summarized_story": "He disclosed that the President afterwards advised him to also let the world – Nigerians know about his 2023 presidential aspiration.\n- Advertisement -The former Lagos State governor said he was at the palace to seek the support and blessings of the monarch towards his 2023 presidential ambition.\nHe said: “This palace is a presidential palace.\nThis state therefore, is a Gateway to fulfilment of destiny.”Responding to the request of Tinubu, Oba Gbadebo prayed God to grant his request.\nMeanwhile, Cross River State governor, Prof. Ben Ayade, has stated that Tinubu deserves to contest for the 2023 presidency because he worked and fought hard for the party."
  },
  {
    "headline": "Fire guts Sheikh Gumi’s residence in Kaduna",
    "summarized_story": "From Noah Ebije, KadunaA fire outbreak has gutted part of the residence of renowned Islamic Scholar, Sheikh Ahmad Gumi, in Kaduna.\nA total of 50 computers were burnt the fire outbreak gutted the school and part of the residence of the renowned Islamic scholar.\nA spokesman for Sheikh Gumi, Malam Tukur Mamu, said in a statement: ‘This is to confirm a fire outbreak in Sheikh Dr Ahmad Gumi’s residence.\nHowever, contrary to media reports the fire did not affect the second part of the large building where the Sheikh and his family resides.\n‘Sheikh Gumi and his entire family including his domestic staff were NOT affected and did not sustain any injury as a result of the unfortunate disaster."
  },
  {
    "headline": "FCT council poll: One feared dead",
    "summarized_story": "From Fred Itua, AbujaA woman has been feared killed after a reckless supporter of one of the major political parties, riding a motorbike, knocked her down.\nNigerians can now work and earn dollars DAILY from home.\nRegular individuals can earn as low as $300 daily Find out how it works.\nThe rider who carried the flag of one of the political parties rode in a frenzy as if he was under the influence of drugs or alcohol.\nVoters in the area immediately apprehended the motorcyclist and handed him over to security operatives deployed for the election."
  },
  {
    "headline": "Area council polls; FCT police makes u-turn, orders restriction of movement from 8am to 3pm over insecurity",
    "summarized_story": "Regular individuals can earn as low as $300 daily Find out how it works.\nFollowing security reports about perceived violence for Saturday’s area council elections, the Federal Capital Territory(FCT), police command has ordered the restrictions of movement from 8am to 3pm to restore law and order.\nThe command which had earlier relaxed the restriction order beginning from 12 midnight Friday to 4pm, Saturday, said the restriction became necessary from credible intelligence at its disposal.\nPolice public relations officer made this known in a statement issued late Friday night in Abuja.\nThe statement reads; “Base on credible intelligence at the disposal of the FCT Police Command and in the best security interest of the territory, the Fct police command has deemed it fit to restore the earlier pronounced restrictions of movement."
  },
  {
    "headline": "2023: APC, PDP in zoning dilemma",
    "summarized_story": "But unlike the PDP, APC initially hinted at zoning its presidential ticket to the South even though it did not state which part of the geopolitical zone will be favoured to produce the party’s flag-bearer.\nAt the moment, certain variables seem to be thawing the earlier position of the APC to go down South.\nSo, in the APC and PDP, there is an impasse over which zone should produce President Buhari’s successor when he leaves office in 2023.\nBoth parties are battling to wriggle through the zoning conundrum at a minimal cost to their political fortunes in 2023.\nFollowing that, there are indications that the APC is currently in a dilemma over the zoning of the 2023 presidency."
  },
  {
    "headline": "I wish to get married this year –Princess Salt",
    "summarized_story": "Pretty actress, Princess Chidimma Agunobi fondly called Princess Salt, has revealed reasons she turned down many marriage proposals.\nAccording to the thespian, she decided to reject some suitors because of their pride and self-aggrandisement.\n“Yes, I have turned down marriage proposals from suitors because they had too much pride in them and it’s so distasteful.\nWhen asked by Saturday Sun if she has had encounter with lesbians in Nollywood, Princess Salt, who is100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nI wish to get married this year if it’s God’s will for me,” the screen diva noted."
  },
  {
    "headline": "Security Operatives at Makurdi Air force Base Stop Ortom from Receiving Osinbajo",
    "summarized_story": "It is not clear if the vice president was aware of the governor’s visit to the base to receive him.\nHe expressed regrets that he had set out to attend the burial of Professor Ignatius Ayua but had to delegate his deputy in order to receive the Vice President.\nThe letter which was signed by Ambassador Abdullahi Gwary said the vice president would return through the same route in the afternoon.\nHe vowed to report the matter to the Vice President for necessary action, stressing that there should be a clear difference between politics and governance.\nOrtom further described the presidency as a lame duck who could not tackle the security challenges of the country."
  },
  {
    "headline": "Buhari Sacks First Lady’s Aide, Redeploys Three Others",
    "summarized_story": "Appoints Zorro as media aide to AishaDeji Elumoye in AbujaPresident Muhammadu Buhari has approved the sack of one aide of the First Lady, Aisha Buhari, and the redeployment of three others.\nHe also okayed the appointment of former President of the Nigerian Union of Journalists (NUJ), Mallam Sani Zorro, as media aide to the First Lady.\nPresident Buhari also gave the go ahead for the appointment of Muhammad Sani Zorro, journalist, politician and former lawmaker as the Senior Special Assistant to the President on Public Affairs and Strategy, Office of the First Lady.\nZorro, a famous journalist brings to the new job decades-long experience in media practice, publishing and unionist leadership.\nHe was at various times President, Nigeria Union of Journalists, NUJ, West African Journalists Association (WAJA) and the Federation of African Journalists, FAJ."
  },
  {
    "headline": "S’Court Annuls Buhari’s Order 10 on Financial Autonomy for States’ Judiciary, Legislature",
    "summarized_story": "The apex court said by the Order, President Buhari usurped the powers of heads of other arms of government.\nAccording to the majority decision, the Executive Order 10 was inconsistent with the 1999 Constitution and therefore unconstitutional, illegal, null and void and of no effect whatsoever.\nThe President has overstepped the limit of his constitutional powers by issuing the Executive Order 10.\n“Thus, the presidential Executive Order 10 is meant to facilitate the implementation of the constitutional provisions…the Executive Order is to aid the states’ legislature and judiciary in curing the constitutional wrong of their financial autonomy which the states have always denied.\nAdetunmbi’s opposition against the Executive Order 10 and his prayer that it should be declared illegal, unconstitutional, voided and set aside was also upheld."
  },
  {
    "headline": "2023: APC to Determine Presidential Candidate By Consensus, Says Zulum",
    "summarized_story": "Zulum emphasised his humble beginnings as a village boy, adding that his major priority is seeing how the people of Borno State would do well within a flourishing economic climate that is achievable in Nigeria.\nEarlier, Chairman of the PCG, Dr. Aliyu Rabiu Kurfi stressed the need for Zulum, other state governors, and party leaders at the ward, state and federal levels to forge a consensus towards making Osinbajo Nigeria’s next president.\nHe urged party leaders to reach a solid consensus on ensuring that Osinbajo become Nigeria’s next President in 2023, adding that self-discipline, moral qualities and competency demonstrated during President Buhari’s absence has made Osinbajo the best candidate for APC’s presidential ticket.\nSome of those on the PCG entourage to Borno State were its Deputy Chairman (North), Mr. Musa Liman Kwande; its Deputy Chairman (South), Dr. Ebenezer Faji; and former Managing Director of African Petroleum Plc, Shettima Abba-Gana who was a former commissioner in Borno State.\nOthers were the PCG Women Leader, Hajia Rabi Dauda; Barrister Emmanuel Pippa (Publicity Secretary); and Mr. Jeff O. Ozomegwa, the Deputy Secretary-General."
  },
  {
    "headline": "Confusion as 4 Oil Companies Named by NNPC as Liable for Imported Substandard Petrol Deny Accusation",
    "summarized_story": "In their separate publications, the four companies – MRS, Emadeb, Brittania-U and Oando – vehemently denied importing the high methanol petrol that is unacceptable in Nigeria.\nOnly Duke Oil, NNPC’s trading arm, also engaged in the Direct-Sale-Direct-Purchase arrangement with NNPC, has been mute about the allegation of importing the bad fuel.\nSurprisingly, the NNPC boss has been silent about the renunciations by the companies he earlier accused of importing the toxic fuel.\nIn its reaction to the allegation, Brittania-U, in a public notice in newspapers yesterday, denied involvement in the importation of the off-spec petrol in circulation.\nThe subsequent stoppage of off-spec petrol sales by marketers resulted in the disruption of petrol supply chain and attendant scarcity and queues in some parts of the country, particularly Lagos, Ogun, Abuja, Port Harcourt, and other cities, since last weekend."
  },
  {
    "headline": "LIVE: Supplementary Election Begins In Ihiala LGA",
    "summarized_story": "LIVE: Supplementary Election Begins In Ihiala LGAThe Independent National Electoral Commission has commenced voting process in Ihiala LGA.\nElection was not conducted in the LGA after violence broke out.\nRecall that Florence Obi, the returning officer for the Governorship Election, had declared the election inconclusive."
  },
  {
    "headline": "LIVE: Supplementary Election Begins In Ihiala LGA",
    "summarized_story": "LIVE: Supplementary Election Begins In Ihiala LGAThe Independent National Electoral Commission has commenced voting process in Ihiala LGA.\nElection was not conducted in the LGA after violence broke out.\nRecall that Florence Obi, the returning officer for the Governorship Election, had declared the election inconclusive."
  },
  {
    "headline": "#AnambraDecides2021: Electoral Commission, INEC Suspends Results Collation, Announces Date For Supplementary Election",
    "summarized_story": "The Independent National Electoral Commission (INEC) has fixed a date for a supplementary election in one local government area of Anambra State where the governorship poll did not hold at the weekend.\nShe, however, said the declaration would be made after the supplementary election has been conducted in the remaining local government area, Ihiala.\nShe announced that the supplementary election would be conducted in the 326 polling units across Ihiala on Tuesday, November 9.\nThe outstanding results are for Ihiala Local Government Area where for various reasons, the commission could not deploy materials yesterday (Saturday).\n\"I have conferred with the commission, being the body that fixes the date for the election, and the commission has decided that the supplementary election will take place on Tuesday, 9th November 2021."
  },
  {
    "headline": "#AnambraDecides2021: Electoral Commission, INEC Suspends Results Collation, Announces Date For Supplementary Election",
    "summarized_story": "The Independent National Electoral Commission (INEC) has fixed a date for a supplementary election in one local government area of Anambra State where the governorship poll did not hold at the weekend.\nShe, however, said the declaration would be made after the supplementary election has been conducted in the remaining local government area, Ihiala.\nShe announced that the supplementary election would be conducted in the 326 polling units across Ihiala on Tuesday, November 9.\nThe outstanding results are for Ihiala Local Government Area where for various reasons, the commission could not deploy materials yesterday (Saturday).\n\"I have conferred with the commission, being the body that fixes the date for the election, and the commission has decided that the supplementary election will take place on Tuesday, 9th November 2021."
  },
  {
    "headline": "BVAS Failure, Low Turnout Mar FCT Council Elections",
    "summarized_story": "Council elections in the Federal Capital Territory on Saturday witnessed low turnout of voters and failure of Bimodal Voter Accreditation System in many areas in the city.\nThe election took place in the six area councils of the FCT including Kwali, Bwari, Kuje, Gwagwalada and Abuja Municipal Area Council.\nThere were cases of failure of BVAS in many areas such as Kubwa, Gwagwalada, Abaji, thereby making accreditation and voting difficult and slow.\nRecall that INEC chairman, Mahmood Yakubu, on Thursday announced that it had deployed 2,822 Biometric Voters Accreditation System for the Federal Capital Territory council elections.\nHe noted that 1,373,492 registered voters were expected to participate in the elections for chairmen and councillors in 2,229 polling units."
  },
  {
    "headline": "Made in Nigeria, only for Nigerians",
    "summarized_story": "After celebrating “Made in Nigeria, Enjoyed Worldwide” in my previous article, I was immediately confronted with the other side of our beloved country as we slipped into the “Only in Nigeria” mode again.\nPresident Olusegun Obasanjo ruled Nigeria for eight years, from 1999 to 2007, and the refineries still did not work.\nNigeria is such a peculiar country that we have devised all kinds of schemes to whitewash the sepulchres.\nOur legendary amateurism and incompetence are what I call “Made in Nigeria, Only for Nigerians”.\nAdvertisementAnother product “Made in Nigeria, Only for Nigerians” — and not fit for export “to be enjoyed around the world” — is the educational requirement for political office holders as enshrined in the constitution."
  },
  {
    "headline": "Made in Nigeria, only for Nigerians",
    "summarized_story": "After celebrating “Made in Nigeria, Enjoyed Worldwide” in my previous article, I was immediately confronted with the other side of our beloved country as we slipped into the “Only in Nigeria” mode again.\nPresident Olusegun Obasanjo ruled Nigeria for eight years, from 1999 to 2007, and the refineries still did not work.\nNigeria is such a peculiar country that we have devised all kinds of schemes to whitewash the sepulchres.\nOur legendary amateurism and incompetence are what I call “Made in Nigeria, Only for Nigerians”.\nAdvertisementAnother product “Made in Nigeria, Only for Nigerians” — and not fit for export “to be enjoyed around the world” — is the educational requirement for political office holders as enshrined in the constitution."
  },
  {
    "headline": "2023: We will make Nigerians happy, says Tinubu after visit to traditional rulers in Ogun",
    "summarized_story": "Bola Tinubu, a chieftain of the All Progressives Congress (APC), says his party will continue to work towards ensuring Nigerians are happy.\nHe spoke on Saturday evening, after visiting three traditional rulers in Ogun state.\nAccording to him, he visited the traditional rulers to inform them of his decision to contest the presidency in 2023.\nAdvertisementAddressing journalists after the visit, he said Nigerians need to understand that there would be difficult times, but that his focus will be on ensuring that people are happy.\n“My message to all Nigerians is that there will always be difficult times and there will be times for joy,” he said."
  },
  {
    "headline": "2023: We will make Nigerians happy, says Tinubu after visit to traditional rulers in Ogun",
    "summarized_story": "Bola Tinubu, a chieftain of the All Progressives Congress (APC), says his party will continue to work towards ensuring Nigerians are happy.\nHe spoke on Saturday evening, after visiting three traditional rulers in Ogun state.\nAccording to him, he visited the traditional rulers to inform them of his decision to contest the presidency in 2023.\nAdvertisementAddressing journalists after the visit, he said Nigerians need to understand that there would be difficult times, but that his focus will be on ensuring that people are happy.\n“My message to all Nigerians is that there will always be difficult times and there will be times for joy,” he said."
  },
  {
    "headline": "Two dead, two rescued as building collapses in Lagos (updated)",
    "summarized_story": "Two bodies have been recovered, while two persons were rescued from the rubble of a three-storey building which collapsed in Yaba, Lagos, on Saturday.\nOlufemi Oke-Osanyintolu, the director-general of the Lagos State Emergency Management Agency (LASEMA), confirmed the development in a statement.\nEarlier on Saturday, an official of LASEMA had said some construction workers were in the building when it collapsed.\n“Upon arrival of LASEMA response team at the incident scene, a three-storey building under construction was discovered to have collapsed,” the official had said.\nAdvertisementHe added that recovery operation is still in progress at the site."
  },
  {
    "headline": "11 African startups to watch out for in 2022",
    "summarized_story": "About 20 startups are currently listed on its platform and over $400,000 has been invested on the platform.\nThe startup creates a reliable portal to guide African students in their tertiary education, course selection, and career decisions.\nThe startup handles everything it takes for a business to launch in a new African country.\nWe think this startup is building a game-changing product; something that will have a significant impact on the growth of African startups.\nWe know you have some startups you are rooting for this year that we might have missed."
  },
  {
    "headline": "Nigerian bourse wants to attract tech IPOs with new listing rules",
    "summarized_story": "Nigeria has set in motion what could herald a new dawn for African tech startups as it moots the adoption of new listing rules to encourage tech companies to go public.\nOlumide Bolumole, division head of stock exchange listing activities at NXG revealed that the bourse will make sweeping changes to make listing attractive to tech companies.\nNGX consists of a holding company and three subsidiaries that cover the operations of the Nigerian Stock Exchange (NSE), its regulation, and its real estate.\nThis structure is similar to those of other international market groups such as the London, New York, and Johannesburg stock exchange groups.\nIn recent decades, Nigeria’s stock market capitalisation has fallen well below potential."
  },
  {
    "headline": "TechCabal’s Valentine’s Gift Guide",
    "summarized_story": "Price range: > $99We’ve labelled this a Series C-type gift because it’s a long-term investment beneficial to all involved.\nPrice range: $2 – $4 (for Individual plans)We’re labelling this a seed-type gift because, any way you dice it, you’re sowing seeds.\nWell, here’s how you can someday build up to that: get them video streaming subscriptions for Valentine’s Day.\nLog on to your MTN, Safaricom, Airtel, or Ethio Telecom services and gift your loved one gigabytes of data.\nFor Valentine’s, add to your loved one’s crypto stash and help them build their way into digital wealth."
  },
  {
    "headline": "This developer transitioned to blockchain development in order to solve Web2 problems",
    "summarized_story": "Akinyemi Akindele, 27, studied computer science at the University of Ibadan, where he trained as a Web2 software developer.\nEventually, he got to build a blockchain supply chain solution with his team, the first of its kind in the country, he said.\nAfter two years at Binance, Akindele joined EMTECH, a US blockchain company that builds digital currency for central banks across the world.\nBreaking into blockchain developmentAnother idea that endeared Akindele to blockchain engineering was that the blockchain was a melting point for a lot of things.\nHe also advised them to contribute to open source blockchain projects and look for ways to solve the problems that exist today in Web2 with Web3."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "Is it possible to reduce or eradicate fraud in Africa?",
    "summarized_story": "To fight this, the company which claims to specialise in fighting fraud in Africa has recently raised a €20 million (~$23m) Series A to help them improve their game in fighting fraud.\nYes, you read that correctly; over $12 million will be invested in combating mobile fraud in Africa.\nWhile I’m interested in how the company intends to accomplish this, there’s also an indigenous company in Nigeria, Stellas digital bank planning to combat fraud.\nSide bar: Is it possible that the rise of startups focused on combating fraud will help achieve its purpose in Africa?\nTo know how, please, read: Stellas digital bank launches, plans to fix major loophole for fintech fraud in Nigeria."
  },
  {
    "headline": "Stellas digital bank launches with ‘Ghost Mode’ to fix major fintech fraud loophole in Nigeria",
    "summarized_story": "However, fraud remains the bane of both digital banks, and traditional banks alike.\nFor the newly launched Stellas digital bank, it plans to guard against one major loophole.\nToday, the company is launching a digital bank to “offer banking services with ease”.\nBasically, Stellas plans to protect user identities when making transactions, to guard against identity theft and ensure privacy and security.\nIn a space graced by the likes of Kuda, Sparkle, Fairmoney, and Carbon, Nigeria’s digital banking space look set to be exciting."
  },
  {
    "headline": "Rising to the challenge with the all-new Redmi Note 11 series",
    "summarized_story": "Xiaomi launched the Redmi Note 11 series for Nigerian markets on Wednesday, February 9th, 2022, carrying on the legacy of the Redmi Note series with three all-new devices – Redmi Note 11 Pro, Redmi Note 11S, and Redmi Note 11.\nMoreover, the Redmi Note 11 Pro, Redmi Note 11S, and Redmi Note 11’s 2MP depth camera allows you to create a natural bokeh effect for your portrait shots.\nAdvertisementThe Redmi Note 11 Pro and Redmi Note 11S rise to the challenge with an advanced octa-core MediaTek Helio G96 processor and up to 8GB of RAM.\nMarket availabilityThe Redmi Note 11 Pro and Redmi Note 11S are available in three configurations: 6GB+64GB, 6GB+128GB, and 8GB+128GB.\nMoreover, the Redmi Note 11 Pro will be available in early March, 2022, while the Redmi Note 11S and Redmi Note 11 are now available."
  },
  {
    "headline": "IMF sees Nigeria risks financial squeeze as debt piles",
    "summarized_story": "“Public debt threshold for emerging markets stand at 10 percent; however, Nigeria currently spends above 80 percent to service its debt.\nDebt servicing for Nigeria since the oil decline in 2020 has been dependent on CBN overdraft and Eurobond subscriptions.\nIn 2019 and 2020, N2.090trn and N2.140trn, respectively, were spent as capital expenditure.\nThe amount budgeted for capital expenditure saw an increase in 2021 and 2022 as N4.989trn and N4.891trn were budgeted for capital projects.\nThe Nigerian economy has been and is still operating in ‘reverse’, Productivity rates are low while debt servicing is increasing (ridiculous)."
  },
  {
    "headline": "Apathy, dysfunctional BVAS, late arrival of officials mark FCT Area Council poll",
    "summarized_story": "There are a total of 1.373 million registered voters in the FCT spread across the six Area Councils, 62 Wards, and 2,822 Polling Units in the Territory.\n“We have this long-standing issue of non-indigenes not wanting to come out and vote during area council elections,” said a voter who simply identified himself as Ahmed.\nINEC Chairman, Mahmood Yakubu at the last extended stakeholders meeting ahead of the FCT election on Tuesday said lessons learned from the Anambra election had been considered in planning for the Area Council election.\nA visit to most of the centers in Nyanya, Karu, Jikwoyi, Kpeghi, Asokoro, Garki, and Kuduru communities in the Abuja Municipal Area Council, showed no presence of men and materials.\nHowever, security agents made up of Police, Civil Defence and Road Safety were seen at the various polling units visited."
  },
  {
    "headline": "Voter apathy, late arrival of INEC officials, materials hallmark FCT council polls",
    "summarized_story": "The Federal Capital Territory Area Council polls got off to a slow start Saturday morning amidst several challenges, as election did not start until about 10am.\nMany people are however going about their activities, following the decision by the FCT Police to relax movement restrictions.\nBusinessDay checks revealed that election materials and polling officials of the Independent National Electoral Commission INEC did not get to the polling units until at about 9.30am, at Kuje, the capital if Kuje Area Council.\nThis is despite the fact that voters had turned out as early as 7.30am at the various polling units waiting for officials of INEC at the units.\nVoting however, took off at the Agwan tiv and Agwan Egan and Agwan Kaduna polling units at about 10am"
  },
  {
    "headline": "Obaseki lauds Ogbeifun for setting up Maritime Institute in Edo Poly, Usen – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has eulogized Engr.\nGreg Ogbeifun, for his outstanding contributions to the development of the state’s education sector, especially the setting up of the Greg Ogbeifun Maritime Institute of Technology (GOMINT).\nObaseki said, “You are doing something to enhance the development of the state and its economy.\nWhat you are doing in the Edo State Polytechnic, Usen, is there for us all to see.\nDignitaries at the event include former Edo State Governor, Chief Lucky Igbinedion and Senator representing Edo South Senatorial District, Senator Matthew Urhoghide, among others."
  },
  {
    "headline": "Obaseki seeks better collaboration to expand opportunities for girls, females in science – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for stronger collaboration among global stakeholders to expand opportunities for women researchers and end all forms of discrimination and stereotypes about women in science.\nThe governor gave the charge in commemoration of the 2022 International Day for Women and Girls in Science, marked by the United Nations (UN).\nHe said, “In commemoration of this year’s International Day for Women and Girls in Science, it is imperative to restate the need for global stakeholders to come together to support initiatives that will further open up the space for more female researchers in sciences to explore innovative approaches to providing solutions to everyday problems.”The governor noted, “As part of the implementation of the Edo State Government Transformation and Enhancement (EdoSTEP) programme, we have sustained efforts aimed at supporting more women to explore opportunities in various scientific fields.\nThrough this programme, we will support more women scientists to develop innovative solutions to development needs in our communities.”Obaseki further stated, “We have expanded our basic education reforms to junior secondary schools and technical colleges to ensure equal opportunity and a growth path for our children, including boys and girls, to explore careers in science and technology without discrimination.”“With increased support from multi-national organisations, donor agencies, and other stakeholders, we will sustain programmes and policies geared at encouraging our female children to achieve their goals in science disciplines,” he added.\nOn this year’s theme, ‘Equity, Diversity, and Inclusion: Water Unites Us,’ Obaseki said, “I urge young girls to take advantage of the unique opportunities in the Edo Tech Park, and compete with the male folks in developing innovative solutions to societal problems.”According to the UN, the General Assembly adopted a resolution to establish an annual International Day on 22 December 2015, “to recognise the critical role women and girls play in science and technology communities.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo begins asphalting of 105.6km Benin-Abraka Road – Nigerian Observer",
    "summarized_story": "The governor gave the assurance when he inspected the laying of asphalt on the ongoing reconstruction of the 105.6km Benin-Abraka Road.\nThe road stretches from Ikpoba-Okha Local Government Area of the state through Orhionmwon LGA, Edo State and terminates at Abraka in Delta State.\nThe road was jointly awarded by the Edo State Government and the Edo State Oil and Gas Producing Areas Development Commission (EDSOGPADEC), to Raycon Construction Company Nigeria Ltd in 2021, with the mandate to complete the road project within a specified period of four years.\nEnabulele Ferguson, while speaking to journalists during the inspection of the asphalting of 5km road, for the first phase of the total of 105.6km Benin-Abraka Road, expressed satisfaction with the progress of work on the road.\nHe, however, noted that despite being a federal road, the project will be completed and delivered to the people at the stipulated time, pledging to ensure its completion before 2025."
  },
  {
    "headline": "National Sports Festival: Redeem N500m pledge, Obaseki urges FG – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has called on the Federal Government to redeem the outstanding N500 million which it pledged to pay as contribution for the hosting of the last edition of the National Sports Festival (NSF), tagged Edo 2020.\nObaseki made the appeal when he received the Edo 2020 Report from the Local Organising Committee, headed by his deputy, Rt.\nThe governor, who noted that the national sports competition has ignited the spirit of sportsmanship amongst young people, said the state set a new record in the hosting of the games.\nAccording to him, “I will talk on the issue of the outstanding N500 million that the Federal Government promised to contribute to the games.\nI want to thank the team for the discipline in procurement, management of finances and accountability."
  },
  {
    "headline": "Police gets new spokesperson, Olumuyiwa Adejobi, as Frank Mba proceeds on course at NIPSS",
    "summarized_story": "The Nigerian Police Force Public Relations Officer, CP Frank Mba, has handed over the duties and responsibilities of the Force Public Relations Department to his Deputy, CSP Olumuyiwa Adejobi, who takes charge of the Department with immediate effect, a statement from the force said at weekend.\nOlumuyiwa Adejobi, a Chief Superintendent of Police, according to the statement, is an alumnus of the prestigious University of Ibadan where he studied Archeology and Geography (Combined Honours).\nCSP Olumuyiwa is an experienced communicator and image manager who has achieved great strides in his previous appointments.\nHe is a member of several professional bodies and associations which include: Nigerian Institute of Public Relations (NIPR); International Public Relations Association (IPRA); Pointman Leadership Institute, USA; International Association of Chiefs of Police (IACP), USA; and the Institute of Corporate Administration, Nigeria.\nCSP Adejobi can be reached on cell phone number 08037168147 while he seeks support from all and sundary as he discharges his duties."
  },
  {
    "headline": "Sterling Bank Confers Heart Fellowship Awards on Five Tech Founders",
    "summarized_story": "Sterling Bank Plc, has awarded its HEART Fellowship to five (5) lucky tech founders to enable them to participate in the Founder Institute (FI) Lagos Spring Virtual 2022 Cohort.\nThe award recipients are Tech Founders who have demonstrated creativity and employed innovative solutions to tackle challenges in the HEART sectors.\nThe HEART sectors are Health, Education, Agriculture, Renewable Energy, and Transportation.\nSpeaking at the award ceremony in Lagos on Wednesday, Head, Business Growth and Partnerships with Sterling Bank, Mr. David Adebayo, said the HEART sectors represent the focus and strategy of the bank.\nThe recipients were informed that they will have access to fellow Founder Institute Lagos Alumni during the training program, along with exposure to founders from other markets across Africa."
  },
  {
    "headline": "Buhari appoints Sani Zorro SSA to First Lady, redeploys Kamal Abdulrahman, Hadi Uba, Wole Aboderin, sacks Zainab Kazeem",
    "summarized_story": "Those affected by the redeployment are: Dr. Mohammed Kamal Abdulrahman, Senior Special Assistant to the President on Health and Development Partners and Personal Physician to the First Lady; Hadi Uba, Special Assistant to the President on Administration and Wole Aboderin, Special Assistant to the President on Non-Governmental Organisations, NGOs.\nAlso approved with effect from 11th February is the disengagement of Zainab Kazeem, the Special Assistant to the President on Domestic and Social Events, Office of the First Lady.\nZorro, a famous journalist brings to the new job decades-long experience in media practice, publishing and unionist leadership.\nHe was at various times President, Nigeria Union of Journalists, NUJ, West African Journalists Association (WAJA) and the Federation of African Journalists, FAJ.\nHe was in the House of Representatives where he chaired the committee on Internally Displaced Persons (IDPs), Refugees and Initiatives on North East."
  },
  {
    "headline": "Climate change threat to food security in Nigeria – Dare",
    "summarized_story": "Nigeria’s minister of youth sports, Mr. Sunday Dare, has called on Nigerians to take issues of climate change seriously to tackle food insecurity and imbalances in the planet’s ecosystem.\nHe noted that climate change represents a threat to food security in the country.\n“Nigeria is not immune from the adverse effects of climate change.\nClimate change is increasingly threatening Nigeria’s ecosystem, with increasing desertification in the north, erosion in the east, ocean surge in places like Lagos, among others.\nA Nigerian born, British activist, Emeka Obasi Jnr, is leading an awareness campaign in this regard, through his NGO, Our Tomorrow."
  },
  {
    "headline": "FCT Elections: Security Agents Arrest Thugs Trying To Disrupt Voting",
    "summarized_story": "Security operatives, on Saturday, arrested four persons who attempted to disrupt voting in the Area Council elections in the Federal Capital Territory (FCT).\nThose arrested were initially beaten up by the security operatives.\nThe election, which held in over 1,000 polling units across the six area councils that make up the FCT was contested by 478 candidates, who are battling for six chairmanship and 62 councillorship positions.\nAlso, in Gwagwalada Area Council polling unit 010 at Angwandodo Primary School, it was observed that security operatives beat up a man who was trying to disrupt voting.\nADVERTISEMENTAlso, at Polling Unit 032/Lambata in Kwali Area Council, voters were complaining about the slow accreditation process and were discouraged to vote because no incentives were given to them."
  },
  {
    "headline": "2023: ‘He For She’ Advocate, Meshack-Hart, Lauds Benue Gov’s Wife For Encouraging Female Aspirants",
    "summarized_story": "Mr. Meshack-Hart while praying God to bless the wife of the Governor for always carrying women along, emphasized the need for female inclusion in politics.\nHe admonished female electorates to queue behind female candidates during elections, stressing that women are more acclimatized with the needs of their fellow women.\nHe urged female aspirants to always rally around women and friends of women in order for them to win the support and confidence of female electorates.\n“My life’s goal is to empower women and the girl child.\n“As the saying goes, “When you empower women, you empower the society,” he added."
  },
  {
    "headline": "Group Demands Release Of Zakzaky’s Travel Documents",
    "summarized_story": "The Advocates for Social Justice has called on the federal government to on humanitarian grounds, release to the leader of the Islamic movement in Nigeria (IMN) Sheikh Ibraheem Zakzaky and his wife, Malama Zeenatuddin Ibraheem who have been discharged and acquitted by the Kaduna State High Court, their travel documents to get treatment for various ailments.\nIt said in a statement signed by its publicity secretary, Mr Segun Fanimo, that even President Buhari took time off from duty to attend to his health situation outside Nigeria, adding that there was no justification to deny the Shiite leader his right to go to any country to attend to his health condition.\nThe statement said; “Information available indicates that their health condition is deteriorating as Sheikh could be seen limping and his wife, Malama Zeenatuddin Ibrahim, is confined to a wheelchairADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "Southern Kaduna Youths Endorse Sunday Katung For Senate",
    "summarized_story": "Thousands of Southern Kaduna youths yesterday endorsed Barrister Sunday Marshall Katung, popularly known as SMK, for the 2023 southern Kaduna Senatorial race.\nKatung was a member of the House of Representatives, representing Zangon-Kataf/ Jaba Federal constituency before he became the running mate to Hon.\nADVERTISEMENTThe youths pledged to move from house to house and ward to ward to solicit support and convince more people on the need to support SMK for the job in 2023.\nHe cansolve insecurity in Southern Kaduna.\nWe have suffered a lot of insecurity, poverty and unemployment in Southern Kaduna."
  },
  {
    "headline": "2023: Jonathan Told Me He Might Run For Reelection – Bala Mohammed",
    "summarized_story": "Bauchi State governor, Bala Muhamamd, has said that he has all it takes to challenge any aspirant running for the 2023 presidential election except former President Goodluck Jonathan who told him he might be seeking reelection.\nGovernor Bala stated this after a closed-door meeting with former president Jonathan in Abuja.\nADVERTISEMENTHe said governors of the southern states in the PDP had no iota of excuse for the PDP to field a presidential candidate from the South.\nGovernor Bala said Jonathan advised him not to withdraw from the race because he might be running for re-election too.\nADVERTISEMENT“I told him that if he ran, I would not run, even in any party, not just the APC or the PDP."
  },
  {
    "headline": "Tinubu: I told Buhari I want to step in his shoes, not on his toes",
    "summarized_story": "Bola Tinubu said he told President Muhammadu Buhari that he wanted to step in his shoes and not on his toes.\nTinubu had visited Buhari at the Aso Villa in January to inform the president of his ambition.\nI told the President that I want to step in his shoes but not step on his toes.\nHe had earlier paid a similar visit to the Awujale and Paramount Ruler of Ijebuland, Oba Sikiru Adetona at his Ijebu-Ode palace.\nAddressing the monarch, Tinubu said, he decided to express his intention to Buhari following calls from his supporters and friends to run for President."
  },
  {
    "headline": "Osun 2022: Traditional rulers back Oyetola",
    "summarized_story": "Omipidan said that the traditional rulers spoke during “Strategic Engagement Tour” of the governor to Ife-South and Ife-North Federal Constituency.\nAccording to the statement, the traditional rulers said that the modest achievements of the governor in the state are enough to convince the electorate to re-elect him for a second term.\nSpeaking on behalf of the traditional rulers in Ife-North State Constituency, the Salu of Edunabon, Oba Kehinde Oladepo, assured the governor of his people’s support.\n“We are assuring you of delivering Ife-North State Constituency to the ruling party, while we will do everything humanly possible to ensure your victory.\nOyetola had, in the last two weeks, embarked on strategic engagement tour to all the Federal Constituencies in the state."
  },
  {
    "headline": "UPDATED: Two Rescued, Others Trapped As Three-Storey Building Collapses In Lagos",
    "summarized_story": "UPDATED: Two Rescued, Others Trapped As Three-Storey Building Collapses In LagosTwo construction workers were reportedly rescued on Saturday while three others were trapped in Yaba area of Lagos following the collapse of a three-storey building.\nEyewitness accounts said the construction workers were at their various duty posts when the building collapsed on them.\nAn eyewitness, Alhaja Adeoye Adesewa said the building had suffered partial collapse in 2021 but this did not stop the ongoing construction.\nSurvivor Comes Out Of Collapsed Building In Lagos A survivor came out of a collapsed storey building in Lagos on Saturday.\nThe Saturday incident occurred barely three months after a 21-storey Ikoyi building collapsed in Ikoyi area of Lagos killing many people."
  },
  {
    "headline": "JUST IN: President Buhari Appoints New Personal Physician For First Lady",
    "summarized_story": "JUST IN: President Buhari Appoints New Personal Physician For First LadyPresident Muhammadu Buhari has approved the appointment of Dr. Zabah Muhammad Jawa as Personal Physician to the First Lady, Mrs. Aisha Muhammadu Buhari.\nThe President also approved the appointment of A’isha Rimi, a law graduate of the University of Buckingham in England as the Senior Special Assistant to the President on Legal Matters, Office of the First Lady.\nThe appointments were disclosed via a statement issued by the Senior Special Assistant to the President on Media and Publicity, Mallam Garba Shehu.\nThe statement explained that, “A’isha is a resourceful administrative executive and a founding partner at Africa Law Practice, a commercial law firm in Nigeria.”It further said, “The President has also approved the appointment of Dr. Zabah Muhammad Jawa as Personal Physician to the First Lady.\nJawa is a Senior Consultant in Nuclear medicine and European Certified in Nuclear Medicine."
  },
  {
    "headline": "BREAKING: Fire Guts Sheikh Gumi’s Residence In Kaduna",
    "summarized_story": "Sheikh Ahmad Gumi, a Kaduna-based Islamic cleric, had his home destroyed by fire.\nThe cause of the fire outbreak is not known as at the time of filing this report, however, a source who sought for anonymity, told DAILY POST that the fire started at the section of the Islamiyya School.\nAccording to the source, “We just saw smoke coming out from one of the classes.\nWe immediately drew the attention of the people around and started fetching water to prevent the fire from reaching the other buildings.”Details later…"
  },
  {
    "headline": "JUST IN: Another Storey Building Collapses In Lagos",
    "summarized_story": "JUST IN: Another Storey Building Collapses In LagosA 3 storey building located in Akanbi Crescent, Yaba area of Lagos state has collapsedAccording to reports, section of the building which is still under construction collapsed onto another building beside it.\nWhile the cause of the collapse is not yet known, an eye witness who spoke with the media said a part of the building had collapsed last year.\nShe disclosed that the construction went ahead despite the collapse as no appropriate authorities weighed into the matter.\nThis comes few months after a 21-storey building collapsed at Ikoyi area of the state.\nAs of last count by the Lagos state government, a total of 46 deaths were confirmed from the incident."
  },
  {
    "headline": "At last, Makinde reveals when new Olubadan of Ibadanland will be announced",
    "summarized_story": "Oyo state Governor, Seyi Makinde, Saturday, promised to name the new Olubadan of Ibadanland on Monday.\nGovernor Makinde stated this while speaking at the final burial rites for the late Olubadan of Ibadanland, His Imperial Majesty, Oba Saliu Akanmu Adetunji, who died on January 2, 2022.\nThe governor added that the emergence of the new Olubadan was in line with the laid-down tradition of the town.\n“I have received a letter from the Olubadan- in-Council and by the grace of God, on Monday, I will make the official announcement of the new Olubadan of Ibadanland on.\nAnd I want to believe that we all know that I, Seyi Makinde, I’m one of those Baba cherished."
  },
  {
    "headline": "Pandemonium as another building collapse rocks Lagos, many trapped",
    "summarized_story": "A three-storey building on Saturday collapsed and trapped unspecified number of persons, mostly workers in Lagos, Blueprint reports.\nAccording to an eyewitness, the building under construction around Yaba area of Lagos, collapsed on a nearby edifice.\nAs at the time of filling this report, Lagos state emergency workers have commenced rescue operations.\nThere have incidences of collapsed building in Lagos with many confirmed dead thereafter.\nIn the course of previous incidents, Lagos state government past and present had promised to take drastic steps to nip the trend."
  },
  {
    "headline": "Breaking: Fire guts Sheikh Gumi’s residence in Kaduna",
    "summarized_story": "Fire outbreak on Saturday gutted part of the residence of renowned Islamic scholar, Sheikh Ahmad Abubakar Gumi, in Kaduna.\nThough, the cause of the fire outbreak was scanty as at the time of filing the report, a source who pleaded for anonymity, said the fire started at the section of the Islamiyya school.\n‘We just saw smoke coming out from one of the classes.\nWe immediately drew the attention of the people around and started fetching water to prevent the fire from reaching the other buildings,” he said.\nDetails loading…"
  },
  {
    "headline": "Accreditation Challenges Mar FCT Council Elections",
    "summarized_story": "﻿There were challenges with the Bimodal Voter Accreditation System on Saturday as many FCT residents trooped out to vote in council elections conducted by the Independent National Electoral Commission (INEC).\nThe polls, conducted to elect council chairmen and councillors, were held in Abaji, Bwari, Gwagwalada, Kuje, Kwali, and Abuja Municipal Area Council (AMAC).\nBut the challenges with BVAS slowed down the voting process in many polling units, giving voters cause for concern.\nIn most polling units in Kuje, Bwari and the Abuja Municipal Area Council, INEC officials arrived early with voting materials.\nChairman Bwari Area Council, John Gabaya, also pleaded with the electorates to allow for a peaceful election."
  },
  {
    "headline": "Workers Trapped As Building Collapses In Lagos",
    "summarized_story": "﻿A building under construction collapsed in the Yaba area of Lagos on Saturday with some workers reportedly trapped under the rubble.\nThe number of casualties is not yet known but officials of the Lagos State Emergency Management Agency have arrived at the scene.\nREAD ALSO: Area Council Elections Hold In FCTRescue equipment have also been mobilised to the scene to aid the recovery of other workers.\nBuilding collapse is not uncommon in Lagos due to lax regulatory oversight and sharp practices by developers.\nIn November a high-rise block of luxury flats under construction collapsed in the Ikoyi area of the state, killing at least 40 people."
  },
  {
    "headline": "Air Force Personnel Bars Ortom From Welcoming Osinbajo To Benue",
    "summarized_story": "﻿A Nigerian Air Force personnel attached to the tactical air command in Makurdi on Saturday prevented Governor Samuel Ortom from welcoming Vice President Yemi Osinbajo to Benue State.\nThe Vice President was in transit through Benue to Wukari in Taraba State.\nThe Governor also called for disciplinary actions against the air force personnel in what he described as an embarrassment to his office.\n“I don’t want to be someone who is a busybody,” Mr Ortom said, holding a letter from the State House formally requesting him to receive the Vice President.\nI have never insulted the President or the Vice President or the Federal Government."
  },
  {
    "headline": "Avoid Unnecessary Travel Within Ukraine, Nigerian Embassy Tells Citizens",
    "summarized_story": "The Nigerian Embassy has informed its citizens living in Ukraine to avoid unnecessary travel within the country.\nThis is contained in a release issued by the Nigerian Embassy in Ukraine on January 26.\n@TheFavoredWoman, kindly note that the Nigerian Mission in Ukraine has since Jan 26th issued a statement asking Nigerians in Ukraine, particularly students, to follow the process stipulated in the release below.\nWe have lots of Nigerian students over there .\nNotably, Belgium, Estonia, and Lithuania advised their nationals to leave Ukraine for fear war breaks out."
  },
  {
    "headline": "Electoral Act Amendment: Presidency Afraid Of APC’s 2023 Chances, Says Wike",
    "summarized_story": "Rivers State Governor, Nyesom Ezenwo Wike says President Mohammedu Buhari is afraid that giving assent to the Electoral Act Amendment Bill will make his party, the All Progressives Congress (APC) to fail in the 2023 general election.\nGovernor Wike wondered why the APC controlled Federal Government always seeks excuse to justify their unwillingness to sign into law what will advance the country’s electoral process.\n“Every time this government, this party will find an excuse of not signing an Electoral Act.\nNational Assembly in their wisdom has amended the bill and agreed to what Mr President said.\nIn his address, Vice Chancellor of Bayelsa Medical University, Yenagoa, Prof. Ebitimitula Etebu said the Bayelsa Medical University had 8 academic programmes in the faculty of science and basic medical sciences when it was established in 2018."
  },
  {
    "headline": "Tinubu visits Awujale, informs him of his presidential ambition",
    "summarized_story": "National leader of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu has paid a courtesy visit to the Awujale of Ijebuland, Oba Sikiru Adetona in Ijebu Ode, Ogun State.\nAsiwaju Bola Tinubu said the essence of the visit is to officially inform the paramount ruler of Ijebu land his intention to run for the position of President of Nigeria in the 2023 Presidential election.\nAdvertisement"
  },
  {
    "headline": "Senator Philip Aduda raises concern over BVAS Operation",
    "summarized_story": "The Senator representing Federal Capital Territory has raised concerns over the functionality of the Bimodal Voting Accreditation System, BVAS.\nPhillip Aduda enjoins INEC to get its act right ahead the 2023 general election.\nAdvertisementHe spoke after casting his vote at the Polling units 004 in Karu.\nWhile he describes his accreditation and voting process as seamless, the lawmaker said reports reaching him from other parts of the nation’s capital are not palatable regarding the BVAS."
  },
  {
    "headline": "APC CECPC Notifies National Convention of Proposed Amendments to Constitution -",
    "summarized_story": "In accordance with Article 30 (iii) of the All Progressives Congress (APC) Constititution, the Governor Mai Mala Buni-chaired Caretaker/Extraordinary Convention Planning Committee (CECPC) has served a notice of proposed amendments to the Party’s Constitution on members of the National Convention.\nArticle 30 (iii) stipulates that the notice is served at least fourteen (14) days before the date of the National Convention at which the proposed amendments is to be considered.\nAdvertisementAPC Constitution 2014 has been in effect for almost eight years and together with judgments from Courts of competent jurisdiction, administrative experiences have revealed flaws in the Constitution.\nIt became imperative to conduct a review of the Party’s Constitution.\nThe Caretaker/Extraordinary Convention Planning Committee established a Constitution Review Committee under the chairmanship of Prof. Tahir Mamman OON, SAN to thoroughly review the Constitution in accordance with Article 30 which provides for Constitutional amendments."
  },
  {
    "headline": "FCT Council Polls: Ortom vows to resist any form of rigging",
    "summarized_story": "The Benue State Governor Samuel Ortom has vowed to resist any form of rigging or manipulation in Saturday’s Abuja territory elections.\nAdvertisementLast minute preparation for Saturday’s Abuja territory elections necessitated this gathering of critical stakeholders of the country’s main opposition party at the instance of the campaign council Chairman.\nHe quickly goes into the business of the day by setting the tone for the closed door session.\nAdvertisementAccording to him the ruling party has made their job pretty simple by its abysmal performance.\nThe meeting was attended by Governor’s of Benue ,Oyo, Bauchi and Rivers State as well as Senators, former Governor’s, former Senators and other party leaders."
  },
  {
    "headline": "Canadian Judge Orders an End to Blockade at Border Bridge",
    "summarized_story": "A judge on Friday ordered protesters at the Ambassador Bridge over the U.S.-Canadian border to end the 5-day-old blockade that has disrupted the flow of goods between the two countries and forced the auto industry on both sides to roll back production.\nWindsor police immediately warned that anyone blocking the streets could be subject to arrest and their vehicles may be seized.\nSince Monday, drivers mostly in pickup trucks have bottled up the bridge connecting Windsor to Detroit.\n“This unlawful activity has to end and it will end,” Trudeau warned just hours earlier.\n“We discussed the American and indeed global influences on the protest,” Trudeau said."
  },
  {
    "headline": "US: In Reversal, FDA Puts Brakes on Covid shots for Kids under 5",
    "summarized_story": "“I think they made the right decision to be careful and wait for the third-dose data,” said Dr. Jesse Goodman of Georgetown University, a former FDA vaccine chief.\nPreliminary study results showed two shots were safe and strong enough to give good protection to babies as young as 6 months.\nSo it was a surprise when a few weeks ago, FDA urged Pfizer and its partner BioNTech to go ahead and apply.\nFriday, the FDA abruptly canceled that meeting, promising to hold it once Pfizer submits the third-dose evidence.\nHow long to wait for new vaccine data — and how much to require — is a difficult balancing act for the FDA."
  },
  {
    "headline": "US to Evacuate Ukraine Embassy Amid Russian Invasion Fears",
    "summarized_story": "The United States is set to evacuate its embassy in Kyiv as Western intelligence officials warn that a Russian invasion of Ukraine is increasingly imminent.\nU.S. officials said the State Department plans to announce early Saturday that virtually all American staff at the Kyiv embassy will be required to leave ahead of a feared Russian invasion.\nThe new move comes as Washington has ratcheted up its warnings about a possible Russian invasion of Ukraine.\nSullivan said Russian President Vladimir Putin could give the order to launch an invasion of Ukraine any day now.\nThe American troops are to train with host-nation forces but not enter Ukraine for any purpose."
  },
  {
    "headline": "Hushpuppi: Police Commission Gives 2-Week Ultimatum for Fresh Probe of Suspended Cop Abba Kyari – Arise News",
    "summarized_story": "The commission also ordered the Inspector-General of Police, Usman Baba, to constitute a new panel to undertake the probe and submit the report in two weeks.\nKyari was indicted by the Federal Bureau of Investigation (FBI) of the United States for alleged involvement with an internet fraudster, Ramon Olorunwa Abbas, popularly known as Hussipuppi.\nA statement by the commission on Friday said it deferred decision on the case involving Kyari, pending the new probe.\nA US District Court had, following an FBI investigation, indicted Kyari and six others.\nThe Police Service Commission suspended Kyari as a result of the allegations."
  },
  {
    "headline": "Nigeria: APC to Determine Presidential Candidate By Consensus, Says Borno Governor Zulum",
    "summarized_story": "He emphasised that Borno State will work with the party’s hierarchy, members of the National Assembly, and leaders at ward and state levels to ensure actualisation of decisions to be made by Buhari who is the party’s leader.\n“Individual aspirations may have to be downplayed because we all have to concur with the decision of the leader of our party.\nZulum emphasised his humble beginnings as a village boy, adding that his major priority is seeing how the people of Borno State would do well within a flourishing economic climate that is achievable in Nigeria.\nSome of those on the PCG entourage to Borno State were its Deputy Chairman (North), Mr. Musa Liman Kwande; its Deputy Chairman (South), Dr. Ebenezer Faji; and former Managing Director of African Petroleum Plc, Shettima Abba-Gana who was a former commissioner in Borno State.\nOthers were the PCG Women Leader, Hajia Rabi Dauda; Barrister Emmanuel Pippa (Publicity Secretary); and Mr. Jeff O. Ozomegwa, the Deputy Secretary-General."
  }
]