[
  {
    "headline": "Speak truth to power, Edo dep gov charges politicians",
    "summarized_story": "Edo State Deputy Governor, Philip Shaibu, has linked the spate of insecurity and banditry being witnessed in the country to the refusal of politicians to speak the truth, urging them to be bold and speak truth to power irrespective of their political affiliations so as to make the nation better.\nIf we tell ourselves the truth, we will not have all these crises that are self-inflicted; we are the cause.\n“But I am happy that we now have a forum that we can use in telling ourselves the truth.\nWhen things are bad, say it’s bad and find a way to provide a solution.\nLet us collectively continue to speak truth to power."
  },
  {
    "headline": "10 Kaduna Baptist students released, 21 still held by bandits",
    "summarized_story": "Ten students of Bethel Baptist School in Kaduna were on Saturday released with 21 others still being held by bandits.\nThe Vice President of the Christian Association of Nigeria (19 Northern States and Abuja) and chairman of CAN in Kaduna State, Rev.\nWe are now hoping that the remaining 21 who are still with the bandits will be released.”CAN had accused the government of abandoning the remaining 31 students of Bethel Baptist High school in Damishi area of Kaduna in the bush with bandits.\nRead AlsoHayab, said this alarm in a statement sent to our correspondent, titled: ‘Our government has abandoned the 31 Bethel Baptist High School in Damishi, Kaduna children in the bush with bandits.’He said, “The silence about the Baptist High School, children still in the hands of their captors is bad and condemnable.\nThe Church in Kaduna State will never keep quiet till all our children and everyone in captivity is released and return home.”"
  },
  {
    "headline": "APC National Convention: Senator, ex-govs battle for Buni’s job",
    "summarized_story": "By Omeiza Ajayi, ABUJAThe battle for the national chairmanship of the ruling All Progressives Congress APC has begun with several stakeholders making behind-the-scenes consultations on their prospects of taking over from the Caretaker National Chairman, Gov.\nWith arguments against having ex-governors as national chairman of the party, there are strong indications that the Chairman, Senate Services Committee is being considered for the plum job.\nAli Modu SheriffThe former Borno state Governor is reputed to not just have a big war-chest, but also regarded as a heavy spender.\nWhat would however count against him is his defection antecedents as well as his less than desirable handling of the PDP when he was its acting National Chairman.\nThe Turaki of Ilorin in a recent interview dismissed fears that he does not have the support of his state governor, Abdulrahman Abdulrazaq."
  },
  {
    "headline": "Agony in South-East as most federal roads collapse",
    "summarized_story": "By Vincent Ujumadu, Dennis Agbo, Steve Oko & Emmanuel IheakaDRIVING through most of the federal roads that crisscross the South-East geopolitical zone has become very agonizing.\nThe Enugu-Onitsha, Onitsha Owerri, Aba-Owerri, Owerri-Umuahia, Enugu-Abakaliki, Oba-Nnewi-Okigwe, among many others are in deplorable condition.\nThe development has put so much pressure on the old Onitsha –Enugu road with the attendant traffic gridlock witnessed on daily basis.\nFor Imo State, to say that federal roads in the area are deplorable, is to state the obvious.\nThe Umuahia-Ohafia-Arochukwu federal road is no exception as it has almost collapsed making trip to Arochukwu from Umuahia the state capital almost a day’s journey."
  },
  {
    "headline": "Why blame Tega?",
    "summarized_story": "Is Tega really guilty of conducts unbecoming of a married woman whilst in the House?\nIronically, your strategy can either make or mar you, which is what has happened in the Boma and Tega adventure.\nTega’s husband ought not to have allowed her walk into the lion’s den in the first place.\nAnd this is a MARRIED woman, sent by her husband to do whatever it takes to get a contract.\nSo, I don’t really blame Tega or Boma."
  },
  {
    "headline": "Needed: A reorientation course on how to pull a decent partner!",
    "summarized_story": "By Bunmi Sofola“Most people want to meet Mr. Or Miss Right”, said Jare a 30-year old single mother of one.\n“What is needed in schools these days is not lesson on the sanctity of marriage which moves you no nearer to an altar, but lessons on how to pull a partner you might actually marry.\nBy the time she realised the love of her life was married, she was literally holding the baby!\nShe said she’s never been in love with the man – just in love with the idea of getting married.\n“Now she’s met a man she’s hopeless in love with but is unfortunately trapped in a loveless marriage with two kids."
  },
  {
    "headline": "We need cutting-edge AI applications for medicine, security, others – Osinbajo",
    "summarized_story": "Professor Yemi OsinbajoVice President Yemi Osinbajo says Nigeria needs to invent and produce cutting-edge Artificial Intelligence (AI) applications for education, business, medicine and security.\nOsinbajo’s spokesman, Laolu Akande, in a statement on Saturday, said the vice president delivered a keynote address to the founding class (2021) of the Nigerian University of Technology and Management (NUTM), Lagos.\nWe need to invent and produce cutting-edge AI applications for education, business, medicine and security.\nBut we know that ground-breaking innovation in technology or commerce will always be the product of the work of well-trained people.\nIn his welcome remarks, Enelamah, who is also the Chairman, Governing Board of the University, thanked the vice president for attending the event."
  },
  {
    "headline": "BREAKING: 10 Bethel Baptist students released in Kaduna",
    "summarized_story": "Bandits have released 10 kidnapped students of Bethel Baptist High School, Kaduna, on Saturday, while 21 others are still being held, Rev.\nAccording to him, 10 students were released this evening and have reunited with their parents.\n“We are now hoping that the remaining 21 who are still with the bandits will be released,” he said.\nRecall that bandits had kidnapped scores of Bethel Baptist students in Kaduna in June.\nThey have been released in batches after payment of huge sums as ransom."
  },
  {
    "headline": "Again, ISWAP blows up high tension electricity lines, plunges Maiduguri into darkness",
    "summarized_story": "More than four high tension towers that supply electricity from Damaturu to Maiduguri in Borno State were blown off again by suspected members of Islamic State in West Africa Province (ISWAP) fighters last night, DAILY POST can authoritatively report.\nAccording to the report, the dastardly act started precisely around 7 pm and lasted up to 10 pm.\nAn eyewitness said four towers are already on the ground while the fifth one is about to fall down.\nResidents have described the development as a pity that hope is not in sight even after about 10 months of lack of electricity supply in the city of Maiduguri.\n“With this development, I don’t think Maiduguri will have light again soon."
  },
  {
    "headline": "Rivers: NCDC identifies local governments with highest COVID-19 cases",
    "summarized_story": "The Nigeria Centre for Disease Control, NCDC, has identified three local governments in Rivers State with the highest number of Coronavirus cases.\nAccording to the NCDC, the local governments include; Obio Akpor, Eleme and Port Harcourt.\nThe Senior Public Health Promotion Officer, NCDC, Junaid Mohammed, disclosed this to journalists at the end of a meeting with stakeholders on maternal, newborn and child health at the Primary Health Care Management Board in Port Harcourt on Saturday.\nJunaid said the NCDC is in the state because of the high rate of COVID-19.\nCOVID-19: NCDC reports 106 fresh cases, more deaths"
  },
  {
    "headline": "Media most hit by Coronavirus in Nigeria – NUJ President, Isiguzo",
    "summarized_story": "The National President of the Nigeria Union of Journalists (NUJ), Mr. Chris Isiguzo, has said that the media is the most hit sector by the outbreak of Coronavirus in the country.\nIsiguzo said this while addressing members of the Oyo State council of the union in Ibadan during his visit on Saturday.\nIsiguzo added that the effect of Coronavirus made some media houses lay off some of their staff.\n“When the Coronavirus came, the media is the most hit in the country.\nThe chairman of the state council of NUJ, Comrade Ademola Babalola, welcomed the delegation on behalf of the Oyo State Council of NUJ."
  },
  {
    "headline": "Bandits lost human rights when they took up arms against Nigeria – Ndume replies activists",
    "summarized_story": "The Senate Committee Chairman on Army, Senator Ali Ndume, has said bandits, terrorists and other criminals must not be spared in the onslaught by the military and other security agents.\nSenator Ndume stated this when asked to speak on operations of the military in the Northwest and in other places with regards to human rights of criminal elements by journalists in Abuja.\nHe chided those blaming the military for not being conscious of the human rights of bandits in their operations, stressing that in war there were bound to be casualties.\n“If we can identify bandits that have been killing people recklessly, we don’t have to waste time to kill them.\nWhen we start talking about human rights, which right?"
  },
  {
    "headline": "Annie Idibia celebrates 2Face on 46th birthday",
    "summarized_story": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator."
  },
  {
    "headline": "You played no role in my defection to APC - Umahi tells Fani-Kayode",
    "summarized_story": "Ebonyi State Governor, Dave Umahi, on Friday vowed that former Minister of Aviation, Femi Fani-Kayode, did not influence him into dumping the Peoples Democratic Party for the ruling All Progressives Congress in November 2020.\nThe governor made the statement on Friday during ‘Sunrise Daily', a breakfast programme on Channels Television.\nI was there and very instrumental when Governor Umahi joined the APC.\nI was there and very instrumental when my friend and brother governor of Zamfara, Governor Matawale did the same thing.\nThe Ebonyi State governor said, “I think he (Fani-Kayode) needs to withdraw that statement, he’s my good friend but, it was an insult on my person and the other governors."
  },
  {
    "headline": "BREAKING: FG to appeal N20bn damages against DSS – Malami",
    "summarized_story": "The Federal Government is to appeal the judgment of an Oyo State High Court which awarded N20 billion in damages against the Attorney-General of the Federation(AGF) and the Department of State Services (DSS).\nThe AGF, Mr Abubakar Malami (SAN), announced the decision of the Federal Government to appeal the judgment while speaking on the development in an interview with the News Agency of Nigeria (NAN) in Abuja on Friday.\nThe suit, bordering on fundamental human rights was brought by self-styled Yoruba Nation activist, Sunday Adeyemo.\nNAN recalls that Igboho’s Counsel, Mr Yomi Alliyu (SAN), had filed a N500 billion fundamental human rights enforcement suit against the AGF, DSS and Director of the DSS in Oyo State over the incident.\nHowever, delivering his judgment, Justice Ladiran Akintola, said the style and procedures adopted by the DSS during the incident was unprofessional."
  },
  {
    "headline": "l once attempted suicide, drank a bottle of sniper - Tonto Dikeh",
    "summarized_story": "Tonto Dikeh, the Nigerian actress, says she once attempted suicide over criticisms and negative perceptions about her personality due to her knack for controversy.\nThe movie star spoke at a recent Tedx where she reflected on her past struggles with suicidal thoughts and how she finally managed to leverage the controversy.\nThe mother of one said the situation left her heavily depressed that she drank a bottle of sniper to end her life.\nGod knows that I was so tired that I took a bottle of sniper and drank it all.\nThe only reason why I can be proud of it is that I’m not fighting it, I’m using it for my advantage, I’m using it for my growth, for my satisfaction,” she added."
  },
  {
    "headline": "You can’t break my unbeaten record - Tyson Fury tells Anthony Joshua",
    "summarized_story": "Tyson Fury believes he will never lose his unbeaten record, despite the looming threat of fights against dangerous punchers such as Deontay Wilder and Anthony Joshua.\nFury defends his WBC belt against Wilder on October 9, which could finally set up an undisputed world title showdown against Joshua.\nSpeaking in an interview with Gary Neville’s The Overlap, which contains language some may find offensive, Fury said, “I’ve never lost a fight.\nI don’t think I’ll ever lose a fight, no.\nI don’t think I will."
  },
  {
    "headline": "NDA attack: How troops rescued Major Datong",
    "summarized_story": "From Sola Ojo, KadunaThe troops of the 1 Division of the Nigerian Army in collaboration with sister agencies have rescued Major Christopher Datong who was abducted from the Nigerian Defence Academy (NDA) on August 24.\nIn the process, scores of bandits were neutralised in their camps at Afaka – Birni Gwari general area, theDeputy Director, Army Public Relations,1 Division, Nigerian Army, Colonel Ezindu Idima, said in a statement.\n“The troops arrived at a camp suspected to be the location where Major Datong was being held.\n“In the process, the gallant troops were able to rescue the abducted officer.\nHowever, the officer sustained a minor injury, but has been treated in a medical facility and handed over to NDA for further action."
  },
  {
    "headline": "Buhari leaves for 76th UNGA Tuesday",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari will depart Abuja today Sunday for New York, United States of America, to participate in the 76th Session of the United Nations General Assembly (UNGA76), the Presidency has said.\nThe President will also hold bilateral meetings with a number of other leaders of delegations and heads of international development organisations.\nPresident Buhari is expected back in the country on Sunday, September 26.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars.\nClick here to apply today."
  },
  {
    "headline": "Violent night raid: Court orders FG, DSS to pay Igboho N20bn",
    "summarized_story": "The court also granted all the 16 reliefs sought by Igboho, through his counsel, Chief Yomi Alliyu (SAN), and awarded additional cost of N2million against the respondents jointly and in favour of Igboho.\nThe reliefs included a restraining order for the Federal Government and security agencies not to intimidate, harass and freeze Igboho’s bank accounts.\nSuch a conduct, the court held, has a serious potential of killing the victim, and at best constituting a serious threat to the life of the victim.\nBut counsel to second and third respondents, T.A.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Cheating ’ll not make me leave my husband –Imade Osawaru – The Sun Nigeria",
    "summarized_story": "Beautiful and curvy actress/filmmaker, Imade Osawaru may have it all going for her, but she is unfulfilled as she is still single.\nIn an encounter with Saturday Sun, Imade expressed her desire and expectations from her man.\nI am very open to marriage but I have not found the right man yet.\nBut then, Imade confessed that it’s not easy coping on lonely, cold nights.\n“It is not easy coping on these lonely, cold nights, but some things are more important to me right now than sex."
  },
  {
    "headline": "Rev Chris Christian, Founder and Shepherd, Locust Army International: Why i’m still a virgin at 56",
    "summarized_story": "of Locust Army International, a church with many branches in Nigeria, Africa and worldwide, has no property to his name due to an oath.\nReverend Chris Okotie said T.B Joshua wasn’t a genuine man of God, while Prophet Chukwuemeka Ohanaemere, better known as Odumeje or Indaboski denounced Okotie for his unrelenting stand.\nThe parameters they are using to measure who is a man of God in Nigeria are not actually the parameters.\nGod is His Word and there are other principles that should make a genuine man of God.\nBuhari may not be able to do it, but the next president, somebody who loves Nigeria, should bring Nigeria to restructure."
  },
  {
    "headline": "Breaking: Bandits Release 10 Abducted Kaduna Baptist School Students, 21 Still in Captivity",
    "summarized_story": "By John Shiklam in KadunaAnother batch of 10 of the remaining 31 abducted students of the Bethel Baptist High School, Damishi, Kaduna have been released by bandits after spending 75 days in captivity.\nJoseph Hayab confirmed their release in a telephone chat on Saturday evening in Kaduna.\nHayab said, with the release of the 10 students, 21 are still being held by the bandits.\nHe said, “The bandits have released 10 more of our students to us this evening, remaining 21.\nOn July 5, bandits invaded the school located about six kilometers away from Kaduna metropolis and abducted 121 students."
  },
  {
    "headline": "Presidency Lists 15 Major Projects to be Financed With Proposed $4bn Loan",
    "summarized_story": "The President’s request to the Senate listed 15 proposed pipeline projects, the objectives, the implementation period, benefiting States, as well as the implementing Ministries, Departments and Agencies (MDAs).\nA breakdown of the ‘‘Addendum to the Proposed Pipeline Projects for the 2018-2021 Medium Term (rolling) External Borrowing Plan,’’ showed that the World Bank is expected to finance seven projects including the $125million grant for ‘‘Better Education Services for All’’.\nOther projects to be financed by the World Bank are, the State Fiscal, Transparency, Accountability and Sustainability Programme for Results as well as the Agro-Processing, Productivity, Enhancement and Livelihood Improvement Support Project.\nThe World Bank is also funding the Livestock Productivity and Resilience project in no fewer than 19 States and the Federal Capital Territory (FCT).\nThe digital identity project will be co- financed with World Bank and EIB."
  },
  {
    "headline": "Okonjo-Iweala’s Brother, Ogwashi-Uku Monarch’s Convoy Attacked",
    "summarized_story": "Several vehicles were reportedly damaged during the incident but THISDAY learnt that HRM Ifechukwude and a number of his palace chiefs escaped unhurt.\nThe sight of one of their colleague’s blood reportedly infuriated the protesting youths, who then launched attack on vehicles in the Monarch’s convoy with two of them burnt and several others damaged.\nPrince Greg Okwumbu, the spokesman of the monarch said in the statement, “Obi and members of the Council of Ogwashi-Uku visited Otulu Ogwashi-Uku Friday, September 17, 2021.\n“The visit was largely successful and the Obi met members of the community, prayed with them and discussed with them about some issues.\n“The thugs also attempted to forcefully seize a gun belonging to a law enforcement member who escorted the Obi on the visit."
  },
  {
    "headline": "Buhari Departs Abuja Sunday for New York to Attend UN General Assembly",
    "summarized_story": "Addresses Assembly on FridayReturns to Nigeria next SundayBy Deji ElumoyePresident Muhammadu Buhari is expected to depart Abuja Sunday for New York, United States of America, to participate in the 76th Session of the United Nations General Assembly (UNGA76).\nPresident Buhari, according to a release issued on Saturday by his Media Adviser, Femi Adesina, will address the Assembly during the General Debates on Friday, September 24 when he will speak on the theme of the conference and other global issues.\nThe delegation will also participate in Food Systems Summit; High Level Dialogue on Energy; and The High Level Plenary Meeting to commemorate and promote the International Day for the Total Elimination of Nuclear Weapons.\nThe president will also hold bilateral meetings with a number of other leaders of delegations and heads of international development organisations.\nPresident Buhari is expected back in the country on Sunday, September 26."
  },
  {
    "headline": "Umahi Challenges PDP Govs on Zoning of Presidency to the South",
    "summarized_story": "Umahi, who spoke on a television programme yesterday, alleged the PDP governors at the meeting in Enugu were being dishonest with their claim that they are keen about the 2023 presidency going to the South.\n“The truth remains that a number of us – the Southern Governors – that were in that meeting; that did say that Presidency must come to South, especially PDP, are not being honest.\nLet’s see what they (PDP) come up with in their zoning in the next few weeks.\n“There are a couple of decisions taken at the Southern Governors’ meeting that I know that together, there is sincerity of purpose in them.\nUmahi also opposed the resolution of the Southern Governors’ Forum supporting the collection of the Value Added Tax by states."
  },
  {
    "headline": "BREAKING: Lagos #EndSARS Panel Suspends Sitting Indefinitely",
    "summarized_story": "The Lagos State Judicial Panel Of Inquiry set up to address the issue of police brutality has suspended its sitting until further notice.\nFile PhotoThe panel was expected to conclude its sitting on October 19.\n“EndSARS Panel Being Frustrated; there are attempts to frustrate the EndSARS Judicial Panel from reaching meaningful conclusions on investigations into the Lekki Toll Gate Incident of 20th October 2020.\nThe panel’s sitting ought to have ended on April 19, but was extended by three months till July 19.\nIt was subsequently granted additional three months for hearing of petitions and was expected to conclude its sitting on October 19."
  },
  {
    "headline": "BREAKING: Lagos #EndSARS Panel Suspends Sitting Indefinitely",
    "summarized_story": "The Lagos State Judicial Panel Of Inquiry set up to address the issue of police brutality has suspended its sitting until further notice.\nFile PhotoThe panel was expected to conclude its sitting on October 19.\n“EndSARS Panel Being Frustrated; there are attempts to frustrate the EndSARS Judicial Panel from reaching meaningful conclusions on investigations into the Lekki Toll Gate Incident of 20th October 2020.\nThe panel’s sitting ought to have ended on April 19, but was extended by three months till July 19.\nIt was subsequently granted additional three months for hearing of petitions and was expected to conclude its sitting on October 19."
  },
  {
    "headline": "EXCLUSIVE: N5billion Suit Against Nigerian Government: Nnamdi Kanu’s Family Expose How IPOB Leader Fainted Several Times In Kenya, Smeared With Faeces, Urine",
    "summarized_story": "The N5billion suit filed against the Nigerian government by the detained leader of the Indigenous People of Biafra, Nnamdi Kanu, detailed the extensive torture meted out to the IPOB leader in Kenya as revealed by one of the brothers, Prince Emmanuel Kanu.\nThe suit was filed by Kanu’s lawyer, Aloy Ejimakor, in Umuahia, the Abia State capital before a state High Court on September 7, to press for Kanu’s release to get adequate medical treatments among other rights entitled to him.\nSee Also Breaking News BREAKING: IPOB Leader, Nnamdi Kanu Sues Kenya Government For 'Illegally Detaining, Extraditing' Him To NigeriaThe Affidavit in support of the originating motion was done by Prince Emmanuel Kanu, brother to Nnamdi Kanu.\nThat in the course of the military action, 28 people were killed and several others, including the applicant, were wounded.\nThe high court presided over by Justice K. C. J. Okereke had asked the lawyer to put the respondents on notice."
  },
  {
    "headline": "EXCLUSIVE: N5billion Suit Against Nigerian Government: Nnamdi Kanu’s Family Expose How IPOB Leader Fainted Several Times In Kenya, Smeared With Faeces, Urine",
    "summarized_story": "The N5billion suit filed against the Nigerian government by the detained leader of the Indigenous People of Biafra, Nnamdi Kanu, detailed the extensive torture meted out to the IPOB leader in Kenya as revealed by one of the brothers, Prince Emmanuel Kanu.\nThe suit was filed by Kanu’s lawyer, Aloy Ejimakor, in Umuahia, the Abia State capital before a state High Court on September 7, to press for Kanu’s release to get adequate medical treatments among other rights entitled to him.\nSee Also Breaking News BREAKING: IPOB Leader, Nnamdi Kanu Sues Kenya Government For 'Illegally Detaining, Extraditing' Him To NigeriaThe Affidavit in support of the originating motion was done by Prince Emmanuel Kanu, brother to Nnamdi Kanu.\nThat in the course of the military action, 28 people were killed and several others, including the applicant, were wounded.\nThe high court presided over by Justice K. C. J. Okereke had asked the lawyer to put the respondents on notice."
  },
  {
    "headline": "EXCLUSIVE: N5billion Suit Against Nigerian Government: Nnamdi Kanu’s Family Expose How IPOB Leader Fainted Several Times In Kenya, Smeared With Faeces, Urine",
    "summarized_story": "The N5billion suit filed against the Nigerian government by the detained leader of the Indigenous People of Biafra, Nnamdi Kanu, detailed the extensive torture meted out to the IPOB leader in Kenya as revealed by one of the brothers, Prince Emmanuel Kanu.\nThe suit was filed by Kanu’s lawyer, Aloy Ejimakor, in Umuahia, the Abia State capital before a state High Court on September 7, to press for Kanu’s release to get adequate medical treatments among other rights entitled to him.\nSee Also Breaking News BREAKING: IPOB Leader, Nnamdi Kanu Sues Kenya Government For 'Illegally Detaining, Extraditing' Him To NigeriaThe Affidavit in support of the originating motion was done by Prince Emmanuel Kanu, brother to Nnamdi Kanu.\nThat in the course of the military action, 28 people were killed and several others, including the applicant, were wounded.\nThe high court presided over by Justice K. C. J. Okereke had asked the lawyer to put the respondents on notice."
  },
  {
    "headline": "Bandits release 10 Kaduna Baptist school students -- but 21 still in captivity",
    "summarized_story": "Bandits have released 10 students of Bethel Baptist High School in Damishi, Kaduna state.\nHayab said the released students have reunited with their parents, adding that 21 others are still with their captors.\nHe said: “The bandits have released 10 more of our students to us this evening, remaining 21.\n“It is very painful, but we thank God that 10 students are back.”AdvertisementOn July 5, 2021, bandits invaded the school and abducted 121 students.\nFollowing the release of the 28 students, the bandits were said to have demanded another N80m as ransom for the remaining students."
  },
  {
    "headline": "Bandits release 10 Kaduna Baptist school students -- but 21 still in captivity",
    "summarized_story": "Bandits have released 10 students of Bethel Baptist High School in Damishi, Kaduna state.\nHayab said the released students have reunited with their parents, adding that 21 others are still with their captors.\nHe said: “The bandits have released 10 more of our students to us this evening, remaining 21.\n“It is very painful, but we thank God that 10 students are back.”AdvertisementOn July 5, 2021, bandits invaded the school and abducted 121 students.\nFollowing the release of the 28 students, the bandits were said to have demanded another N80m as ransom for the remaining students."
  },
  {
    "headline": "Presidency lists projects to be financed with fresh $4.9bn loan",
    "summarized_story": "The Muhammadu Buhari administration says the fresh $4.9 billion external loans will finance 15 projects across six geo-political zones.\nThe World Bank is expected to finance seven projects across different sectors, including the $125 million grant for the education sector.\nThe World Bank will also fund livestock productivity and resilience project in 19 states and the federal capital territory (FCT).\nThe presidency further said a loan facility by the German government-owned development bank (KfW IPEX-Bank) will be spent on the construction of the standard gauge rail linking Nigeria with the Niger Republic.\nAdvertisementIt added that the China-Africa Development Fund is expected to provide a loan facility of $325 million for the establishment of three power and renewable energy projects."
  },
  {
    "headline": "Presidency lists projects to be financed with fresh $4.9bn loan",
    "summarized_story": "The Muhammadu Buhari administration says the fresh $4.9 billion external loans will finance 15 projects across six geo-political zones.\nThe World Bank is expected to finance seven projects across different sectors, including the $125 million grant for the education sector.\nThe World Bank will also fund livestock productivity and resilience project in 19 states and the federal capital territory (FCT).\nThe presidency further said a loan facility by the German government-owned development bank (KfW IPEX-Bank) will be spent on the construction of the standard gauge rail linking Nigeria with the Niger Republic.\nAdvertisementIt added that the China-Africa Development Fund is expected to provide a loan facility of $325 million for the establishment of three power and renewable energy projects."
  },
  {
    "headline": "Abdulaziz Ude, elder statesman and ex-Newswatch chairman, is dead",
    "summarized_story": "Abdulaziz Chibuzor Ude, an elder statesman and former acting chairman of the board of directors of Newswatch, is dead.\nAdvertisementThe Anambra state government announced the passing of the culture enthusiast in a statement issued on Saturday.\nDon Adinuba, the state commissioner for information and public enlightenment, said Uze died on Thursday in Lagos state.\n“The Government and people of Anambra State truly mourn the transition of this great Igboman, pan Africanist, publisher and intellectual.\nWe mourn with the Ude family of Abor and the people and government of Enugu State."
  },
  {
    "headline": "A backstory to the tussle between CBN and forex rates platform abokiFX",
    "summarized_story": "abokiFX, a popular mobile and web-based platform that collates the black market foreign exchange rates in Nigeria, on Friday announced it will temporarily suspend the publishing of rates on all its platforms, hours after receiving threats from the Central Bank of Nigeria (CBN).\nWhy Nigeria has different exchange ratesNigeria is Africa’s largest producer of oil, a commodity that brings in more than 90% of the country’s foreign exchange earnings.\nBut rather than an outright devaluation of the naira, the CBN adopted a multiple exchange-rate regime.\nThat left Nigeria with only two rates – the NAFEX rate and the parallel market rate – from almost five different rates as of early 2020.\n“All allegations against our director are yet to be confirmed but we at abokiFX DO NOT trade FX nor do we manipulate parallel market rates,” the statement reads."
  },
  {
    "headline": "Africell exits Ugandan telecom market due to fierce competition",
    "summarized_story": "The remaining 10% is split between three or four other nationwide operators including Africell and Uganda Telecom.\nIt appeared Africell was entering an untapped market and the company bet on data services to eat into the market share of incumbents.\nBut like its predecessors, the company struggled to make a notable impact in a mobile market reputedly hostile to new entrants.\nUganda has over 24 million mobile subscribers with MTN controlling 50% of the market while Airtel Uganda accounts for 43%.\nWhile it struggled to grow its market share, Africell also grappled with high operating costs and debt burden, part of which was inherited from Orange."
  },
  {
    "headline": "iPhone 13 series price in Nigeria, Kenya, and South Africa",
    "summarized_story": "During a virtual event on Tuesday, Apple announced that the iPhone 13 will come in four new models: the iPhone 13, 13 Mini, 13 Pro and 13 Pro Max.\nThe iPhone 13 starts at $829 for 128GB, which is twice the storage the iPhone 12 started with; while the iPhone 13 Mini starts at $729 for 128GB of storage.\nThe iPhone 13 Pro and 13 Pro Max start at $999 and $1,099 respectively, for 128GB storage.\nIPHONE 13 SERIES US PRICES AND STORAGEPhone 128GB storage 256GB storage 512GB storage 1TB storage iPhone 13 Mini $729 $829 $1,029 NA iPhone 13 $829 $929 $1,129 NA iPhone 13 Pro $999 $1,099 $1,299 $1,499 iPhone 13 Pro Max $1,099 $1,199 $1,399 $1,599Why the iPhone 13 series are more expensive in African countriesOver the years, there’s been a noticeable price difference for Apple products in African countries.\nAlthough the store hasn’t revealed the prices, the iPhone 13 Pro 128GB is expected to go for around R23,499 ($1,640), while the iPhone 13 Pro Max 128GB could retail for around R25,999 ($1,815)."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "54gene’s Series B, Vilsquare’s founder’s journey, Techpoint Africa’s Privacy Roundtable",
    "summarized_story": "Share this article:Hello,Today I’m discussing:54gene’s $25 million Series B fundingBuilding a hardware startup through resilienceTechpoint Africa’s Privacy Roundtable54gene raises $25 million Series BOn Thursday, September 16, 2021, African genomics research startup 54gene, announced a $25 million Series B round.\nExisting investors like Adjuvant Capital, KdT Ventures, Plexo Capital, Endeavor Capital, and Ingressive Capital participated in the round.\nTechpoint Africa’s Privacy RoundtableStealing online informationIn January 2021, we conducted a Twitter poll to gauge public opinion on WhatsApp’s planned privacy policy update.\nBecause this is a problem in Africa, Techpoint Africa has launched the Privacy Roundtable, a monthly series focusing on privacy issues and happenings in Africa, with input from experts and non-experts.\nVictoria Fakiya for Techpoint Africa."
  },
  {
    "headline": "Digital commerce solution, OurPass launches app, set to provide users with a one-click checkout solution",
    "summarized_story": "Share this article:OurPass, a digital commerce solution headquartered in Nigeria has announced its launch over a virtual event.\nAdvertisement“OurPass is a mobile app that enables consumers to shop in one click thereby reducing abandoned carts and increasing sales for merchants.\nWith its mobile application, users only input their details once and subsequently, are able to make purchases on the platform.\nBuyers enjoy free delivery, fast, easy and safe checkout across all websites that have OurPass integrated, and can track all their orders and transactions.\n“The coming together of Storemia and OurPass is one of the revolutionary mergers in the Nigerian tech space because both products are very complementary."
  },
  {
    "headline": "Introducing the Privacy Roundtable: A little housekeeping before we begin",
    "summarized_story": "In January 2021, we conducted a Twitter Poll on people’s thoughts about WhatsApp’s intended privacy policy update.\nWhat is data privacy, and how is it different from data protection?\nAdvertisementData privacy or information privacy refers to an individual’s right to authorise access to their data.\nAlthough data privacy can exist without data protection, there would be no need to safeguard data if there is no right to do so.\nOn the other hand, Nigeria published a draft data protection bill in August 2020, but it has yet to be presented."
  },
  {
    "headline": "Presidency lists projects, states to benefit from external loans",
    "summarized_story": "The presidency on Saturday said a total of 15 projects spread across the six geo-political zones of the country, will be financed with the external loans which President Muhammadu Buhari is seeking.\nBuhari had requested the Senate to approve sovereign loans of $4.054bn and €710million as well as grant components of $125m for the proposed projects.\nThe Global Partnership for Education grant is expected to increase equitable access for out-of-school children and improve literacy in focus states.\nThe World Bank is also funding the Livestock Productivity and Resilience project in no fewer than 19 States and the Federal Capital Territory (FCT).\nThe digital identity project will be co-financed with World Bank and EIB."
  },
  {
    "headline": "Nigeria aims to boost communication with two new satellites",
    "summarized_story": "The Nigerian Communication Satellite (NigComSat) Limited is planning to acquire two new satellites as it aims to increase operational capacity.\nThe two satellites would eventually replace the existing satellite NigComSat-1R which is set to deorbit in 2026 when its 15 years lifespan expires.\n“This will not only inspire confidence in our customers and channel partners but also place NigComSat Ltd in the front line of communication satellite operators with a fleet of satellites in orbit,” Alale said.\nNigeria is pushing its satellite capacity as part of measures to connect millions of Nigerians living in rural areas to the internet.\nand the Satellite Broadcasting and Broadband Company (SBBC) to provide satellite downstream services such as broadband internet services, Broadcasting (DTH) services, etc."
  },
  {
    "headline": "Small Business Saturday- September edition",
    "summarized_story": "Despite the significant contribution of SMEs to the Nigerian economy, challenges persist that hinder the growth and development of the sector.\nWe are back with Small Business Saturday, a monthly column that highlights 5 African small businesses a month.\nSmart Money Africa producers of The Smart Money Woman on NetflixArese Ugwu’s bestseller The Smart Money Woman hit the Netflix screens as a series on September 16th.\nWhat makes this more fascinating, is that the premise of the book and series is to teach African women about personal finance and financial literacy.\nIt was a practical and entertaining read filled with financial knowledge and worded in a way every young woman can understand."
  },
  {
    "headline": "Police to prosecute LASG staff for attempted suicide – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLagos – Police timely intervention have saved the life of one Mr Akinlolu Ajayi, 54-years-old staff of Lagos State Government, who attempted to commit suicide by jumping into the lagoon.\nThe Lagos Police Spokesman, CSP Adekunle Ajisebutu, said in a statement on Saturday that the incident happened on Wednesday at about 9.25 a.m.\nHe said the man worked with Lagos State Development and Property Corporate (LSDPC), Town Planning, Ilupeju Lagos.\nThe spokesman said that the suspect had been transferred to the State Criminal Investigation Department for investigation and subsequent prosecution.\nHe further warns that such condemnable act is not only morally wrong but is also criminal,” Ajisebutu quoted the CP as saying."
  },
  {
    "headline": "COVID-19: Edo receives 50,000 more doses of AstraZeneca vaccines – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State at the weekend received 50,000 additional doses of the Oxford AstraZeneca vaccines from the federal government, to boost the state’s efforts at vaccinating more citizens to protect them from COVID-19.\nThe vaccines were received by the Executive Secretary, Edo State Primary Health Care Development Agency (EDSPHCDA), Dr. Mrs. Erhabor Julie, at the Benin Airport.\nSpeaking to journalists shortly after receiving the vaccines, Erhabor charged citizens to avail themselves the opportunity of the availability of the vaccines to get inoculated against the virus.\nAccording to her, “l am calling on all those who have not been inoculated to come and take the vaccines.\nEdo does not have any problem with the supply of vaccines."
  },
  {
    "headline": "Edo Roads Construction: Abudu wants general hospital, Ago-Ogbeide roads listed in next phase. – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Orhionmwon – The General Hospital, and Ago-Ogbeide roads in Abudu, Orhionmwon local government area of Edo state has become a source of worry to inhabitants and others using the routes to their farms and place of work.\nThe (now-abandoned) Nigeria Security and Civil Defence Corps (NSCDC) building, local government education authority office and staff quarters as well as General Hospital Abudu are located along the hospital road.\nThere’s a road we normally pass; that straight (general hospital) road is not passable”, Dr. Alimansuya Emmanuel, Medical Director of the General Hospital told our correspondent in a chatAccording to the inhabitants, the General Hospital and Ago-Ogbeide roads are major routes that link the administrative headquarters to Iru and adjoining communities, and also for those farming in the area.\nThey appealed to Governor Godwin Obaseki to extend his planned rehabilitation of roads across the state, to further fastrack socio-economic development of the area.\nRecall state government recently earmarked 91 roads for repairs and rehabilitation across the three senatorial districts, with none captured in Abudu or other parts of Orhionmwon."
  },
  {
    "headline": "Speak truth to power, Edo Dep Gov charges politicians – Nigerian Observer",
    "summarized_story": "Philip Shaibu has linked the spate of insecurity and banditry being witnessed in the country to refusal of politicians to speak the truth, urging them to be bold and speak truth to power irrespective of their political affiliations so as to make the nation better.\nIf we tell ourselves the truth, we will not have all these crises that are self-inflicted; we are the cause.\n“But I am happy that we now have a forum that we can use in telling ourselves the truth.\nWhen things are bad, say it’s bad and find a way to provide a solution.\nLet us collectively continue to speak truth to power."
  },
  {
    "headline": "How we stopped man from committing suicide – Police",
    "summarized_story": "ADVERTISEMENTThe police in Lagos has said it prevented a middle-aged man from killing himself in the state on Wednesday.\nIn a statement released on Saturday by Adekunle Ajisebutu, the police spokesperson, the incident happened on September 15.\n“The Lagos State Police Command has once again demonstrated its commitment to the protection of lives and property of the citizens as it saved the life of a middle-aged man who attempted to commit suicide in Lagos recently,” the police said in the statement.\nThe victim is a staff of Lagos State Development and Property Corporation (LSDPC) at Town Planning, Ilupeju, Lagos.\nMeanwhile, the police has urged citizens to desist from attempting suicide, saying it is an illegal act."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Anambra State govt mourns passing of Abdulazeez Chivuzor Ude",
    "summarized_story": "The government of Anambra State has expressed sadness over the passing of elder statesman, Alhaji Abdulazeez Chivuzor Ude.\n“There were many persons of Anambra State origin in top management of his enterprises like Gordon and Georgi Umunna who worked on Financial Post.\n“Unknown to most people because of his self-effacing nature, Chief Ude contributed significantly to the creation of Anambra, Enugu, Delta and Ebonyi states.\n“The Government and people of Anambra State truly mourn the transition of this great Igboman, pan Africanist, publisher and intellectual.\nWe mourn with the Ude family of Abor and the people and government of Enugu State."
  },
  {
    "headline": "The Osun Federal Government Road Construction Refunds: The True State Of Affairs, By Bola Oyebamiji",
    "summarized_story": "The total contract sum of all federal road projects embarked upon by the Osun State Government, as approved by the Federal Ministry of Works, is N38billion.\nThis review was duly communicated to the Osun State Government.\nAs at today, Gbongan – Akoda road project is at 36% completion stage, with 8.6km asphalted on both sides of the road.\nIt is a fact that Osun State remains one of the few states paying minimum wage of N30,000 in spite of our precarious and highly geared financial situation.\nBola Oyebamiji is theHonourable commissioner for Finance, Osun State"
  },
  {
    "headline": "Elder statesman, Abdulazeez Chibuzor Udeh is dead",
    "summarized_story": "OBINNA EZUGWUElder statesman and celebrated intellectual, Alhaji Abdulazeez Chibuzor Udeh has passed away, days before his 81th birthday.\nNoted for being a prominent Igbo leader of Muslim faith from Enugu State, Udeh passed away on Thursday after an illness and was subsequently buried on Friday in accordance with Islamic rites.\nBorn September 30, 1940, he was media guru and a distinguished alumnus of the esteemed College of Immaculate Conception (CIC), Enugu, who despite his towering accomplishments shunned the limelight.\nA man of impeccable character, Udeh was educated at Oxford in England and Columbia in the United States.\nAbdulazeez Ude founded Nok Publishers in the United States and Nigeria, undertaking to see radical books from Africa and the Global South in print."
  },
  {
    "headline": "Beyond Aboki: The Ifekaego foreign exchange tutorial, by Kingsley Moghalu",
    "summarized_story": "It’s those reserves, our main defense in a soccer analogy, that determines the value of the Naira.\nSpeculation also affects the naira value, as there are currency traders around the world for whom the weakness of a currency is their very good fortune.\nIf reserves are weak, and demand for dollars massively outstrips supply, currency devaluation is inevitable, and currency traders who mount speculative attacks profit from this devaluation.\nSuch traders will borrow the Naira from Nigerian banks, convert it to, say, dollars, then buy short-interest paying Nigerian bonds.\nThe first is that, because Nigeria has a big, profitable economy and market, dollars will likely swamp the market seeking profits for investors."
  },
  {
    "headline": "$4.9bn Loan: Presidency Lists Projects, Beneficiaries",
    "summarized_story": "A breakdown of the ‘‘Addendum to the Proposed Pipeline Projects for the 2018-2021 Medium Term (rolling) External Borrowing Plan,’’ shows that the World Bank is expected to finance seven projects including the $125million grant for ‘‘Better Education Services for All’’.\nOther projects to be financed by the World Bank are, the state fiscal, transparency, accountability and sustainability programme for results as well as the agro-processing, productivity, enhancement and livelihood improvement support project.\nThe World Bank is also funding the Livestock Productivity and Resilience project in no fewer than 19 States and the Federal Capital Territory (FCT).\nThe French Development Agency will finance two projects, which include the National Digital Identity Management project and the Kaduna Bus Rapid Transport Project.\nThe digital identity project will be co- financed with World Bank and EIB."
  },
  {
    "headline": "$4.9bn Loan: Presidency Lists Projects, Beneficiaries",
    "summarized_story": "A breakdown of the ‘‘Addendum to the Proposed Pipeline Projects for the 2018-2021 Medium Term (rolling) External Borrowing Plan,’’ shows that the World Bank is expected to finance seven projects including the $125million grant for ‘‘Better Education Services for All’’.\nOther projects to be financed by the World Bank are, the state fiscal, transparency, accountability and sustainability programme for results as well as the agro-processing, productivity, enhancement and livelihood improvement support project.\nThe World Bank is also funding the Livestock Productivity and Resilience project in no fewer than 19 States and the Federal Capital Territory (FCT).\nThe French Development Agency will finance two projects, which include the National Digital Identity Management project and the Kaduna Bus Rapid Transport Project.\nThe digital identity project will be co- financed with World Bank and EIB."
  },
  {
    "headline": "JUST-IN: Another 10 Kidnapped Bethel Students Regain Freedom",
    "summarized_story": "Another set of 10 of the remaining 31 abducted students of Bethel Baptist High school, Damishi in Chikun local government area of Kaduna State have regained their freedom.\nKaduna State chairman of the Christian Association of Nigeria (CAN), Rev.\nHayab said the students were released in the evening of Saturday after yet another payment of undisclosed amount of money as ransom and the students have been reunited with their parents.\nADVERTISEMENTMeanwhile, 21 of the students are still in the hands of the kidnappers.\nHayab, therefore, urged for continued prayers until the remaining students are all released unharmed."
  },
  {
    "headline": "JUST-IN: Another 10 Kidnapped Bethel Students Regain Freedom",
    "summarized_story": "Another set of 10 of the remaining 31 abducted students of Bethel Baptist High school, Damishi in Chikun local government area of Kaduna State have regained their freedom.\nKaduna State chairman of the Christian Association of Nigeria (CAN), Rev.\nHayab said the students were released in the evening of Saturday after yet another payment of undisclosed amount of money as ransom and the students have been reunited with their parents.\nADVERTISEMENTMeanwhile, 21 of the students are still in the hands of the kidnappers.\nHayab, therefore, urged for continued prayers until the remaining students are all released unharmed."
  },
  {
    "headline": "JUST-IN: Another 10 Kidnapped Bethel Students Regain Freedom",
    "summarized_story": "Another set of 10 of the remaining 31 abducted students of Bethel Baptist High school, Damishi in Chikun local government area of Kaduna State have regained their freedom.\nKaduna State chairman of the Christian Association of Nigeria (CAN), Rev.\nHayab said the students were released in the evening of Saturday after yet another payment of undisclosed amount of money as ransom and the students have been reunited with their parents.\nADVERTISEMENT65 Bethel Baptist Students Still In Captivity As 15 Regain FreedomMeanwhile, 21 of the students are still in the hands of the kidnappers.\nHayab, therefore, urged for continued prayers until the remaining students are all released unharmed."
  },
  {
    "headline": "VIDEO: HOUSE RAID: WHY COURT ORDERED DSS TO PAY N20BN DAMAGES TO SUNDAY IGBOHO",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "VIDEO: HOUSE RAID: WHY COURT ORDERED DSS TO PAY N20BN DAMAGES TO SUNDAY IGBOHO",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "VIDEO: DELTA MAN ARRESTED FOR ATTEMPTING TO PLUCK OUT MOTHER’S EYES FOR RITUAL",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "VIDEO: DELTA MAN ARRESTED FOR ATTEMPTING TO PLUCK OUT MOTHER’S EYES FOR RITUAL",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "JUST IN: 10 more students of Bethel Baptist school released after ransom paid",
    "summarized_story": "Bandits have released 10 more students of Bethel Baptist Secondary School in Kaduna State.\nThe students were released on Saturday since they were abducted on July 5, 2021 by the bandits.\nBut Kaduna State Chairman of the Christian Association of Nigeria (CAN),Rev.\nHe said the students were released on Saturday night and have been reunited with their parents.\nAccording to him, ransom was paid before the students were released."
  },
  {
    "headline": "Right wing rally in Washington sparsely attended",
    "summarized_story": "The hyped rally by supporters of former President Trump, the people who breached the U.S. Capitol on on Jan. 6, ended a flop Saturday as it was sparsely attended.\nJust about 100 to 200 protesters showed up, some carrying the flags of the right-wing group Three Percenters over their shoulders.\nIt was far fewer than the 700 people organisers had expected and the thousands who brought mayhem to the Capitol on Jan. 6.\nWhile crowds were small, passions rose at times, with sporadic yelling matches breaking out between participants in the rally and counter-demonstrators.\n“If we don’t honor that we don’t honor America,” said Smith, who was carrying a poster board that said “We Want Trump!”"
  },
  {
    "headline": "Bandits Kill One, Abduct Scores In Sokoto",
    "summarized_story": "Unknown gunmen assaulted Tangaza Local Government Area in Sokoto State, killing one person and kidnapping numerous others.\nASP Sunusi Abubakar, the state police command’s spokesperson, confirmed the attack to newsmen on Saturday, saying it happened on Friday evening.\n“We received a report of an attack by unknown gunmen who stormed the headquarters of Tangaza LGA on Friday evening.\n“The bandits killed one of the traders, abducted an unspecified number of persons and also carted away foodstuffs and drinks.\nHe added that three other persons sustained injuries and were currently receiving treatment in a hospital."
  },
  {
    "headline": "Video Exposes Zamfara Governor Matawalle Gifting Bundles Of Cash To Soldiers As Banditry Ravages On",
    "summarized_story": "Governor Bello Matawalle has been seen in a video sharing cash gifts to Nigerian soldiers at a yet-to-be-identified location in banditry-ravaged Zamfara State in a lavish mismanagement of government’s funds.\nWATCH:Meanwhile, human rights’ activist and Amnesty International-designated prisoner of conscience, Omoyele Sowore, among other Nigerians, condemned the sharing of cash gift to the soldiers by the governor.\n“See what the Nigerian military has been reduced to?\nIncompetent morons driving around with public cash have all reduced the military to an “Area Boys Battalion” SAD!\nBello Matabandit of Zamfara state by the way."
  },
  {
    "headline": "BREAKING: 2023 Presidential Aspirant, Bamgbose Is Dead",
    "summarized_story": "Olusegun Bamgbose, Esq., is the national coordinator of Concerned Advocates for Good Governance (CAGG) and the leader of the New Nigerian Peoples Party (NNPP).\nAfter a brief illness, Bamgbose died in the early hours of Friday.\nSteve Ikechi, one of his close friends and business associates, verified the terrible news.\nGod’s Own Chambers, a legal firm situated in Aba, Abia state, with Bamgbose as its senior director.\nHe had also expressed interest in running for president in 2023 under the banner of the NNPP."
  },
  {
    "headline": "Don’t Him Hard Like You Hit FFK, Shehu Sani Begs Nigerians Ahead Of Defection To PDP",
    "summarized_story": "Shehu Sani, a former Nigerian Senator has asked Nigerians not to bash him hard as they did to former minister of Aviation, Femi Fani-Kayode.\nShehu Sani is expected to officially defect to the Peoples Democratic Party, PDP, anytime soon.\nThe former Kaduna senator said Nigerians should remember he’s slim with a flat-pack, unlike Mr. Femi Fani-Kayode who is chubby and muscular.\nFemi Fani-Kayode publicly defected to the All Progressives Congress, APC.\nHe was received by President Muhammadu Buhari in Aso Rock alongside Mai Mala Buni, Chairman of the All Progressives Congress, APC, Caretaker Committee."
  },
  {
    "headline": "Revealed! How 10 dogs pounced, devoured 2-year-old boy inside school compound",
    "summarized_story": "Ten dogs belonging to a private school in Amokpo, Umuanunwa, Nteje, Oyi local government area of Anambra state have pounced and feasted on a two-year-old boy.\nA resident in the community said the child’s parent was perfecting the documentation and registration of the child in the school owned by a UK returnee.\nAt the same time, the victim was said to have strayed away to where the dogs pounced on him.\nThe youths in the community quickly invaded the school compound and shot the entire dogs dead while parents hurriedly withdrew their wards on hearing about the tragic incident.\nConfirming the incident, traditional ruler of Nteje, Igwe Rowland Odegbo, described the act as an abomination in the community, assuring that justice would be served appropriately."
  },
  {
    "headline": "Breaking: Taliban stop girls as schools reopen",
    "summarized_story": "The Taliban have excluded girls from Afghan secondary schools, after they ordered only boys and male teachers to return to the classroom.\nA Taliban spokesman said there were plans to open girls’ schools soon.\nTaliban spokesman Zabihullah Mujahid was later quoted by Afghanistan’s Bakhtar News Agency as saying that girls’ schools would open soon.\nBarring girls from secondary schools would mean none would be able to go on to further education.\n“This is a setback in the education of Afghan women and girls,” said Nororya Nizhat, a former Education Ministry spokesperson."
  },
  {
    "headline": "Zamfara: How we rescued students from bandits’ den – Matawalle",
    "summarized_story": "The Governor of Zamfara State, Bello Matawalle, has said that a repentant bandit led to the rescue of the abducted students of Kaya Maradun from the bandits.\nGovernor Matawalle made the disclosure Saturday morning in a BBC Hausa exclusive programme, “Ganimun hanya.”On September 1, 2021, armed bandits stormed Government day Secondary School Kaya in Governor Matawalle’s Maradun local government area, and abducted 73 students.\nBlueprint reports that last week, the state government announced their rescue and were received by Governor Matawalle at the Government House in Gusau.\nHe said that shutting down communication in the state has helped in securing the abducted students from the bandits.\n“After abducting the children at Kaya in Maradun, we have followed all means to ensure their release but all have failed."
  },
  {
    "headline": "NAF hospital gets ISO 15189: 2012 accreditation Certificate -NigPilot",
    "summarized_story": "The Nigerian Air Force (NAF) , said that the 661 Nigerian Air Force Hospital Laboratory (661 NAFH), Ikeja has again won the International Organization for Standardization (ISO) 15189:2012 accreditation certificate for quality management systems and excellent service delivery, for two consecutive times.\n“The facility was also the first in the entire military to key into ISO 15189 which, as we all know, is the hallmark of quality.\nThe accreditation also indicates that NAF is committed to doing the right thing even when no one is watching, this is commendable,” he said.\nIn his remarks, the CAS said that the NAF appreciates its collaboration with MLSCN especially in the standardization and improvement of NAF laboratories.\n“Very soon, the NAF School of Medical Sciences and Aviation Medicine will admit students for technician courses, including medical laboratory technicians."
  },
  {
    "headline": "JOHESU issues fresh strike notice, gives FG 15-day ultimatum to address demands -NigPilot",
    "summarized_story": "Joint Health Sector Unions, JOHESU , and the Assembly of Healthcare Professional Associations, AHPA, have issued a fresh notice of strike, with another 15-day ultimatum to the federal government to address their demands.\nIt could be recalled that JOHESU had, on September 2, given the federal government a 15-day ultimatum to address its demands.\nAfter deliberations, the federal government had reached an agreement with the unions, after a five-hour meeting on September 7.\nFollowing the expiration of the earlier ultimatum on Friday, JOHESU acting national secretary, Matthew O. Ajorutu, in a communique issued at the end of an expanded national executive council, NEC, emergency meeting, Friday, announced the fresh notice of strike.\nAjorutu said the fresh 15-day ultimatum commences on September 18, 2021, and urged the federal government to speed up efforts to address the demands of the health workers."
  },
  {
    "headline": "VAT war fueled by retrogressive politics – PGF DG -NigPilot",
    "summarized_story": "Lukman stated that if the reason behind the clamor for decentralized control of VAT collection is based on divisive, ethnocentric injustice, then it is retrogressive politics which is a complete departure from the progressive politics which the APC stands for.\nLukman boasted that the APC government led by president Muhammadu has tremendously increased VAT from N759.43 billion in 2015 to N1.531 trillion in 2020, an increase of more than hundred percent.\n“The reality however is that credit must go to the APC led federal government of President Buhari.\nBeing a leading member of PDP, what was responsible for the low VAT records in the country between 1999 and 2015?\nIt is not by accident that VAT collection in the country significantly increased under APC led federal government."
  },
  {
    "headline": "New speaker of Arewa Youth Assembly, Azare petitions DSS, Police, over impeached speaker on plot to attack federal govt institutions -NigPilot",
    "summarized_story": "Newly elected speaker of the Arewa Youth Assembly, Tahir Muhammad Azare has petitioned the president, the director-general of the State Security Service, SSS, and the Inspector General of Police over allegations that the impeached former speaker, Mohammed Salihu Danlami is still going about mobilising to cause mayhem at the headquarters of the Central Bank of Nigeria, CBN.\nIn a copy of the petition already submitted to the relevant institutions and seen by our reporter, Mr. Danlami is alleged to have been funded to mobilise to indefinitely disrupt all activities at the central bank with a goal to leading to a possible collapse of the Nigerian economy.\n“As a result, they are said to be planning to stage violent protests in Abuja to call attention to their unfounded statements about Mr. Emefiele and the Nigerian economy.\nTo achieve this, we further reliably learnt that some people will be moved into the nation’s capital to attack institutions such as the CBN building among others.”The petition called on security agencies to nip the situation in the bud.\n“We are by this letter calling on all relevant security agencies to nip this in the bud by calling Salihu Danlami for questioning with a view to identifying his sponsors and the extent of their plans to pull down the economy of the country,” the petition concluded."
  },
  {
    "headline": "UPDATED: 10 More Bethel Baptist Students Regain Freedom",
    "summarized_story": "Ten more students abducted by bandits from the Bethel Baptist Secondary School in Kaduna State have been released.\nThe students regained their freedom on Saturday, after spending about 75 days in the custody of their abductors.\n21 Students In CaptivityA total of 121 students were forcefully taken away from their hostels when the school came under attack by the assailants.\nThereafter, 15 additional students regained freedom from the captivity of their abductors on August 22.\nMore students were later freed, and the release of the new batch of students on Saturday brings the total number of students who have regained freedom so far to 100."
  },
  {
    "headline": "Woman Who Gave Birth In Bandits’ Camp, 19 Other Victims Regain Freedom",
    "summarized_story": "At least 20 people abducted by bandits from Katoge village in Katsina State have regained their freedom.\nAmong those who spoke with reporters on Saturday at the Katsina Hajj Camp was a nursing mother, Sahura Haruna.\nHe explained that a jet of the Nigerian Air Force flew over the bandits’ camp on Friday night – a development that put the criminals in a panic state.\nFollowing their return, the Secretary to the Katsina State Government, Dr Mustapha Inuwa, handed them over to authorities of Batsari LGA.\nThe bandits later released the students in batches, but 21 others are still in the custody of the bandits."
  },
  {
    "headline": "Lagos Judicial Panel Suspends Sitting Till Further Notice",
    "summarized_story": "The Lagos State Judicial Panel on Restitution for Victims of SARS related abuses and other matters will suspend its sitting until further notice, after Saturday’s session.\nChairman of the panel, Justice Doris Okuwobi, announced this at the resumed sitting of the panel.\n“We cannot continue with the sitting and end the assignment without concluding.\nFollowing the extension of its tenure by another three months, the panel is expected to conclude its sitting by October 19.\nWhen the panel returned, Justice Okuwobi regretted that the panel would not be able to take the witnesses before taking its break."
  },
  {
    "headline": "Buhari To Address World Leaders At UN General Assembly In New York",
    "summarized_story": "President Muhammadu Buhari will travel to the United States of America to participate in the 76th Session of the United Nations General Assembly (UNGA76), the Presidency has said.\nHe revealed that President Buhari would depart Abuja on Sunday for New York where the session is expected to open on Tuesday.\n“President Buhari will address the Assembly during the general debates on Friday, September 24 when he will speak on the theme of the conference and other global issues,” Adesina said.\nPresident Buhari is also expected to hold bilateral meetings with a number of other leaders of delegations and heads of international development organisations while in the U.S.\n“President Buhari is expected back in the country on Sunday, September 26,” Adesina said."
  },
  {
    "headline": "Lekki Shooting: Adegboruwa Raises Alarm Over Plot To Frustrate Probe",
    "summarized_story": "A Senior Advocate of Nigeria (SAN), Mr Ebun-Olu Adegboruwa, has raised an alarm over the investigations into the October 20, 2020 shooting at the Lekki tollgate in Lagos State.\nHe alleged that there was an attempt to frustrate the Lagos State Judicial Panel on Restitution for Victims of SARS-related abuses and other matters, from reaching meaningful conclusions on its probe into the incident.\nAdegboruwa raised the alarm on Saturday in a chat with Channels Television in reaction to the announcement that the panel was suspending its sitting indefinitely.\nAdegboruwa represents the civil society in the panel set up by the state government to probe the excesses of police personnel in the state.\nAdeshina Ogunlana, a lawyer representing some of the #EndSARS protesters, suggested that the panel could take the expert witness by virtual means."
  },
  {
    "headline": "Angry mob killed six suspected bandits in Tangaza",
    "summarized_story": "Six suspected armed bandits have been set ablaze by angry mob in a village in Tangaza local government area in the northern Senatorial District of Sokoto State.\nThe source said the arrested bandits are part of the assailant that visited the village earlier and killed two persons and abducted four persons.\nHe said the bandits were chased after the attack on the village and six of them were apprehended in the near by bushes within the local government .\nThe source told our correspondent that while the police were planning to transport the suspects to the police command headquarters in Sokoto the angry mob overpowered the police and forcefully snatched the suspects from the security personnel.\nThe angry mob pounced on the suspected bandits and in the process killed the six suspects by setting them ablaze."
  },
  {
    "headline": "Police rescue 20 abducted Katsina indigenes in Zamfara",
    "summarized_story": "Twenty kidnap victims have been rescued by troops of the Zamfara State Police command.\nThe victims who are mostly nursing mothers and their babies are indigenes of Katsina state.\nAmong them is a five month old baby abducted alongside his mother while he was two months old.\nReceiving the victims on behalf of the state government, the Speaker of the Zamfara state House of Assembly, Nasiru Mu’azu Magarya said the rescue of the kidnap victims is part of the successes recorded in the ongoing onslaught against bandits.\nHe reiterate the commitment of the state government to end banditry and kidnapping in ZamfaraSome of the rescued victims have been reunited with their families."
  },
  {
    "headline": "Zamfara residents kick against extension of telecoms service suspension -",
    "summarized_story": "Residents of Zamfara state have expressed worry over the extension of the suspension of communication services in the state.\nThis follows the inability of the state and the federal governments to restore telecommunication services at the expiration of the two week suspension.\nZamfara state and the federal government through the Nigerian Communications commission NCC suspended telecommunication services in the state between third to seventeenth September 2021.\nBut some residents especially traders say the measure has pushed them into untold hardship as they have not been making sales.\nThey appealed to the authorities concerned to as a matter of urgency restore telecommunication services and open weekly markets in the state."
  },
  {
    "headline": "Just In: Ten more Bethel Baptist College Students regain freedom -",
    "summarized_story": "At least ten additional student abducted from Bethel Baptist College in Kaduna State have regained their freedom.\nDetails are still sketchy but reliable sources say they were released on Saturday and would be handed over to their Parents.\nThe Kaduna State government and Police authorities are yet to comment on this development as at the time of filling this report.\nTVC News recall that 121 students were abducted at Bethel Baptist College in Chikun local government area of the state, when gunmen invaded the school July 5 2021.\nThe latest development, brings the total number of recovered students to one hundred."
  },
  {
    "headline": "Nigeria: CBN Promises to Deal with Illegal Forex Traders, AbokiFX Suspends Forex Updates",
    "summarized_story": "The CBN governor said: “We found him as a Nigerian who lives in England, and conducts this nefarious and criminal activity on our economy.\n“In which other country will unlicensed single person be the one that sets exchange rate in that country?\nHow come he sets exchange rate of our own country, and why is he not setting exchange rate of the Pound and Dollar or Pound and South African Rands?\nAs regards allegations of fraud levelled against its founder, Olusegun Oniwinde, by the CBN governor, the company said such allegations were not proven.\n“Aboki FX purely provides benchmark parallel rate information which helps guide our users in almost 200 countries across the world."
  },
  {
    "headline": "US Capitol on High Alert as Pro-Trump Demonstrators Converge for Rally",
    "summarized_story": "Those claims have been rejected by multiple courts, state election officials and members of Trump’s own administration.\nNo suspects have yet been identified in the investigation into who planted pipe bombs at the Democratic and Republican parties’ national headquarters near the Capitol on Jan. 5.\nDefense Secretary Lloyd Austin has put 100 National Guard troops on standby to help police protect the Capitol if needed.\nThe National Guard troops, who will be unarmed except for batons, would be used after local, state and federal law enforcement capabilities had been tapped, the spokesman said.\nNational Guard troops were stationed in and around the Capitol from early January through late May, with as many as 5,200 troops in place at the mission’s peak."
  },
  {
    "headline": "Australian Police Clash with Anti-lockdown Protesters, Arrest nearly 270",
    "summarized_story": "Australia’s police arrested 235 people in Melbourne and 32 in Sydney on Saturday at unsanctioned anti-lockdown rallies and several police officers were injured in clashes with protesters.\nAbout 700 people managed to gather in parts of Melbourne, as 2,000 officers made the city centre virtually a no-go zone, setting up checkpoints and barricades.\nIn Sydney, riot squad officers, highway patrol, detectives and general duties police were also deployed to the streets, preventing large gatherings.\nOn Saturday, there were 1,882 new coronavirus cases reported, most of them in Sydney.\nThe vast majority of Australians support vaccinations and the public health measures, but there have been sporadic and sometimes violent protests against the management of the pandemic."
  },
  {
    "headline": "US Admits Kabul Drone Strike Killed Civilians",
    "summarized_story": "The Pentagon has retreated from its defense of a drone strike that killed multiple civilians in Afghanistan last month, announcing that a review revealed that only civilians were killed in the attack, not an Islamic State extremist as first believed.\n“The strike was a tragic mistake,” Marine Gen. Frank McKenzie, head of U.S. Central Command, told a Pentagon news conference Friday.\nFor days after the Aug. 29 strike, Pentagon officials asserted that it had been conducted correctly, despite 10 civilians being killed, including seven children.\nThe evacuation, which began Aug. 14, unfolded under a near-constant threat of attack by the Islamic State group’s Afghanistan affiliate.\n“I am now convinced that as many as 10 civilians, including up to seven children, were tragically killed in that strike,” McKenzie said."
  },
  {
    "headline": "In Escalation Over Submarine Deal, France Recalls Envoys from US and Australia",
    "summarized_story": "France plunged into an unprecedented diplomatic crisis with the United States and Australia on Friday after it recalled its ambassadors from both countries over a trilateral security deal which sank a French-designed submarine contract with Canberra.\nA diplomatic source in France said it was the first time Paris had recalled its own ambassadors in this way.\nAustralia said on Saturday morning it regretted the recall, and that it valued the relationship with France and would keep engaging with Paris on other issues.\nU.S. State Department spokesperson Ned Price said that France was a ‘vital ally’ and that the United States would be engaged in coming days to resolve the differences.\nU.S. Secretary of State Antony Blinken tried on Thursday to calm the French outcry, calling France a vital partner in the region."
  }
]