[
  {
    "headline": "Lawyers seeking SAN rank bemoan difficulties in registration",
    "summarized_story": "Speaking in Benin City, Edo State, a lawyer, Benjamin Okorie, called for the intervention of the Nigerian Bar Association to ensure that deserving legal practitioners were not denied the privilege of the SAN rank.\nLittle did we know that the automation which we all celebrated will make it impossible for some of us who are deserving of the SAN rank.\n“The portal steadily experiences lags, while the filing process was not only difficult but makes it impossible for applicants to complete the registration process.\n“As applicants, we were expected to upload clear and legible copies of supporting documents required by the guidelines for the purpose of the application on the application portal.\nHe stated, “I urge the legal practitioners’ committee in the spirit of fairness to ensure that the date of application is duly extended."
  },
  {
    "headline": "Saraki, Tambuwal, Mohammed move to block zoning, PDP may favour consensus",
    "summarized_story": "To this end, Governor Aminu Tambuwal of Sokoto State, Bala Mohammed of Bauchi State, former Senate President Bukola Saraki; and a former Managing Director of FSB International Bank, Alhaji Mohammed Hayatudeen, visited Delta State Governor, Ifeanyi Okowa.\nOkowa, while commending the four northern aspirants, said consensus would keep the party united.\nThe aspirants also visited Governor Godwin Obaseki of Edo State where they sought his support.\nThe PUNCH learnt that as of Monday evening, there had been no agreement on the zoning arrangement of the party.\n“Definitely, we have nothing against whatever the party will decide, but the zoning will not be against us.”Copyright PUNCH."
  },
  {
    "headline": "NAICOM moves to shut insurance firms over claims failures",
    "summarized_story": "NAICOMBy Rosemary IwunzeThe fate of over ten thousand life policyholders in Niger Insurance Plc and Standard Alliance Insurance Plc are now hanging in the balance as the National Insurance Commission, NAICOM, has issued 30 days’ notice to both companies to close shop over their inability to settle pending claims.\nIt will be recalled that the Nigeria Insurance Association, NIA, the umbrella body of insurance firms in the country, had suspended the two firms from its membership in June last year.\nAccording to NIA, the expulsion became a necessary on the back of their defaults on obligations to policyholders especially on claims payment amongst others.\nREAD ALSO: NAICOM leverages tech for insurance growthMeanwhile, Vanguard investigations show that many policyholders with matured policies have been waiting for more than two years to collect their claims.\nA former staff and customer of Niger Insurance Plc, Alika Lauretta Ronma, has insurance policy No: PO9651 from Niger Insurance Plc with outstanding claims of N374,416.64 since January 2019."
  },
  {
    "headline": "JOHESU accuses hospitals CMDs, MD of sabotaging resident pharmacy training",
    "summarized_story": "“In what was perceived as very bizzare the FMoH recently wrote a memo to the NCE asking for further clarifications on the implementation of the Consultant Cadre circular for Pharmacists.\nFMH/FDS/CSPTH/1/95 of August 2, 2021 while citing precedents in the creation of Cadres in Civil Service, the FMoH CLEARED the mode of application for the implementation of the Consultant Pharmacists Cadre.\n“We sound a note of caution yet again that the CMDs and MDs are employees of the Federal Government who should not be allowed to truncate the rights of other employees.\n“The HOCSF is called upon to uphold the mode of implementation already clearly and unambiguously documented in the circular Ref.\n“This circular clarified the mode of applicability and full implementation of the Consultant Pharmacists Cadre in Nigeria."
  },
  {
    "headline": "DRUUP e-hailing cab business takes off in Kwara",
    "summarized_story": "By Demola Akinyemi, IlorinThe Executive Director of DRUUP, the first indigenously owned cab-hailing company in Kwara State Mr Oluwole Aguda has launched the scheme in Ilorin.\n” We find great opportunities, not just for commercial ends but for social value for the good people of Kwara State.\n“He recalled that “The process of our emergence has been hewn from careful and deliberate thought, intelligent planning, collaborative development and assiduous dedication to the objectives of Drupp in Kwara.\nHe added that, “Drupp is a people-driven business initiative and so we have purposed to provide favourable and fair working conditions for all partners.\nAlso speaking, Mr. Femi Oyetunji, the Company Secretary of Harmony Holdings Limited, the umbrella business outfit of the Kwara state government, said that the scheme guaranteed security and competitiveness in the area of affordable pricing."
  },
  {
    "headline": "2023: No plan to impose candidate in Ogun, APC clarifies",
    "summarized_story": "By James Ogunnaike, AbeokutaChairman of the All Progressives Congress (APC) in Ogun West Senatorial District of Ogun State, Mohammed Azeez, has faulted the claim by some leaders in the district that the party was planning to impose Senator Olamilekan Adeola on them as the Senatorial candidate of the party in the district ahead of the 2023 general elections.\nReacting to the allegation, the Chairman of APC in Ogun West Senatorial District said there was no plan to impose YAYI or any other candidate on the party.\nAzeez described the report as “falsehood which was fictitiously concocted to discredit the party and Tinubu for no just cause”.\nHis words: “As the elected APC Ogun West Senatorial District Chairman, I am not aware of prominent leaders of All Progressives Congress from Ogun West meeting and asking our National Leader, Asiwaju Tinubu not to impose Senator Olamilekan Adeola, on them.\n“The duly elected leadership of APC in Ogun West Senatorial District have equally not received any request to imposed anyone in any position in the race towards 2023."
  },
  {
    "headline": "Ramadan: Buni reviews curfew in Yobe",
    "summarized_story": "By Ndahi Marama, DamaturuGovernor Mai Mala Buni of Yobe state, on Monday, approved a review of the curfew restricting human and vehicular movements across the state.\nHe gave the approval following improvement in the security situation and the ongoing Ramadan.\n“The new curfew time will now commence from 12 midnight, as against the usual 11p.m., to 6a.m.\n“Muslim faithful, who wish to participate in the Tahajud prayer in this holy month of Ramadan, are free to do so.\n“Security agencies are advised to take note and adhere to the change, please,” General Abdulsalam stated."
  },
  {
    "headline": "Ramadan: Government reduces working hours",
    "summarized_story": "Jigawa State Government has approved the reduction of official working hours in the state by two hours.\nThis was contained in a statement signed by the State Head of the Civil Service, Alhaji Hussaini Ali Kila issued to DAILY POST on Monday.\nThe statement said the reduction of the working hours started from Tuesday after the commencement of Ramadan fasting.\nAccording to the statement, “Civil Servants in the State are now to report to the office from 9am and close by 3pm while on Friday are to close by 1pm.”He explained that the reduction of the working hours is aimed at providing more opportunities to civil servants to prepare for their Ramadan break.\nHe, therefore, urged civil servants to use the Ramadan period to pray for God’s guidance and blessings for the state."
  },
  {
    "headline": "I’ve paid price for the voiceless – Sacked Abuja Imam speaks, gets new appointment",
    "summarized_story": "Former Chief Imam of the National Assembly Legislative Quarters Mosque, Sheikh Muhammad Nuru Khalid, says the termination of his appointment was a price he paid for Nigerians who have no voice.\nAccording to him, he is set to lead his new congregation with effect from Friday, April 8.\n“This is the price we pay for aligning with the people and identifying with their sufferings.\n“By the Grace of Almighty Allah, I will be leading my new congregation this Friday, because as clerics we need a platform to operate.\n“There’s a Jum’mat mosque we built behind the Central Bank of Nigeria, CBN Quarters, in Abuja; I will now be leading the congregation there.”"
  },
  {
    "headline": "2023:There’re grand plots by Christians to stop Muslims from voting – Islamic group replies Pastor Adefarasin",
    "summarized_story": "The Muslim Rights Concern, MURIC, has mocked pastor Paul Adafarasin of the House on the Rock of over his recent comment concerning the upcoming general elections.\nAdefarasin on Sunday said there were plans for Christian leaders to get 15 million more voters ahead of the 2023 general election.\n“The founder of the House On the Rock, Pastor Paul Adefarasin has allegedly revealed the plan of Christian leaders to get 15 million more voters ahead of the 2023 general election.\n“There is a grand plot to disenfranchise Muslim voters.\nThe group claimed that Christians in the country had always used their church members as officials of the electoral umpire to stop Muslims from registering and collecting PVC."
  },
  {
    "headline": "You’re a fighter, strong grassroots mobiliser – Tinubu hails Oshiomhole at 70",
    "summarized_story": "Former Lagos State governor, Senator Bola Tinubu, on Monday branded former Edo State governor, Mr Adams Oshiomhole, as a valiant fighter for the masses and a strong grassroots mobiliser.\nIn a statement issued in Lagos today, Tinubu congratulated Oshiomhole for his immense contributions to democracy and the development of an egalitarian society through his fabled advocacy of workers’ rights.\n“Warm congratulations to a former Chairman of All Progressives Congress (APC), Comrade Adams Oshiomhole, on his 70th birthday,” Tinubu’s statement read in part.\n“On this occasion, we pay a special tribute to Oshiomhole for his unwavering commitment to democracy and good governance.\n“A valiant fighter for the masses and strong grassroots mobiliser, Oshiomhole has always worked in the interest of an average person.”Tinubu also prayed to God to grant Oshiomhole, who he described as an ‘intelligent and energetic man’, many more years and increased wisdom."
  },
  {
    "headline": "Elon Musk’s Twitter stake dwarfs Jack Dorsey’s, now largest shareholder",
    "summarized_story": "Business magnate, Elon Musk, now owns a 9.2 per cent stake in Twitter.\nThe U.S. agency confirmed that Musk bought 73,486,938 Twitter shares in March.\nNews of the stake, worth $2.89billion, boosted the company’s shares by about 25% in pre-market trading.\nThe Tesla founder becomes the largest shareholder with more than four times the 2.25 per cent controlled by Twitter founder Jack Dorsey.\nAfter the majority replied ‘no’, Musk asked whether a new networking site was needed, disclosing he was considering starting his own."
  },
  {
    "headline": "Kunle Poly’s murder case transferred to high court",
    "summarized_story": "The Lagos State Directorate of Public Prosecutions (DPP) has recommended the prosecution of a National Union of Road Transport Workers (NURTW) chieftain, Azeez Lawal (aka Kunle Poly), in connection with an alleged murder case.\nLawal, 48, is to be tried at the Lagos State High Court for alleged accessory after the fact to murder.\nShe transferred the case to a high court.\nKunle Poly – the NURTW’s Lagos Island Branch B Chairman – and Wahab were on January 27, remanded for 30 days on a temporary charge of conspiracy to commit murder, murder, and membership of an unlawful society.\nBalogun adjourned till May 11 for a report on the filing of the case at a high court."
  },
  {
    "headline": "Lagos police avert clash as okada man stabs one to death",
    "summarized_story": "A violent protest erupted yesterday in the Ipaja area of Lagos following the murder of a man by a commercial motorcyclist.\nThe motorcyclist, said to be a northerner, allegedly stabbed the man to death with a dagger during an argument.\nThey also went after the suspected killer.\nIt was learnt that the operatives arrested the suspected killer and 41 others.\nPolice spokesman Benjamin Hundeyin said the suspected killer was arrested, adding that calm had been restored."
  },
  {
    "headline": "Rising diesel price forces JAMB to raise mock UTME fee to N1,000",
    "summarized_story": "Joint Admissions and Matriculation Board (JAMB) has said candidates who will participate in the optional mock Unified Tertiary and Matriculation Examination (UTME) will pay N1,000 as service charge to computer-based test (CBT) centres where they will sit for the examination.\nThe examination body said it increased the service charge and that of other consumables from N600 to N1,000 because of the high cost of diesel in the country.\nThe mock examination will hold on April 9 in some select CBT centres.\nJAMB had promised to provide soft-landing for CBT centres due to the hike in the price of diesel.\n“The optional mock examination was introduced by the board to give candidates the opportunity to familiarise themselves with the CBT environment."
  },
  {
    "headline": "JNI queries Fed Govt’s inability to wipe out bandits, terrorists",
    "summarized_story": "The apex Islamic body in the North, Jama’atu Nasril Islam (JNI), under the leadership of the Sultan of Sokoto, Alhaji Muhammadu Sa’ad Abubakar III, has queried Federal Government’s inability to proactively take the battle to terrorists’ hideouts and wipe them off.\nIn its reaction to last week’s terrorists’ attack on the Abuja-Kaduna train, the Islamic body said the essence of government and governance is to protect the five principal cardinal rights of the human race.\nFormer President Olusegun Obasanjo also said the government appeared overwhelmed by the level of insecurity in the land.\nThey urged the Federal Government to take urgent steps to fight the menace to a standstill.\n“We have, however, carefully studied and followed up the unfortunate train blast, especially that another train attack was reported to have occurred on the Lagos-Kano-bound train, near Jaji, Kaduna State, on Thursday, March 31, 2022, which inevitably led to the death of the locomotive operator."
  },
  {
    "headline": "TETfund: $500m required for R&D in Health sector",
    "summarized_story": "The Health sector needs at least $500 million for research and development (R&D), the Nigeria COVID-19 Research Coalition (NCRC) has said.\nIt also said the money would enable the country to generate research evidence for the understanding of COVID-19 pandemic and support for response to the outbreak.\nThis is a model that has four helices: scientists, the government, industry and private sector.\nAs at present, TETfund, which is holding the highest grant portfolio for the country in terms of research, is trending at around $20 million.\n“Therefore, you can actually calculate the gap between the $5 billion that is required for our national economic development, in terms of R&D, and the $20 million that we have."
  },
  {
    "headline": "Nigeria has no big cake to share anymore — Obaseki",
    "summarized_story": "Governor Godwin Obaseki of Edo has said Nigeria no longer has a big cake to share.\nHe said whoever wants to be the next president must be ready to bake a big cake for all Nigerians to share.\n“Forty years ago, we had a big cake to share but today that cake has disappeared.\n“Thanks for providing leadership and trust, God Almighty that has given you the wisdom to make Nigeria the higher goal.\nWe don’t want to dissipate our energy on just trying to get to power, but how to help make Nigeria better."
  },
  {
    "headline": "PDP govs tackle Presidency over state of the nation – The Sun Nigeria",
    "summarized_story": "From Ndubuisi Orji, AbujaThe Peoples Democratic Party (PDP) Governors, yesterday, berated the Presidency over its response to the opposition governor’s recent communique on the state of the nation.\nThe Forum, in a statement by its Director General, CID Maduabum, described the response of the Presidency through Garba Shehu as infantile.\nThe PDP governors noted that their March 23 communique merely stated the facts as it relate to the existential threat confronting the country under the All Progressives Congress (APC)-led administration.\n“The PDP Governors communiqué made a comparative sketch of Nigeria of 2015 under PDP and Nigeria of 2022 under APC.\nThe communiqué reeled out the fact that in almost all sectors, things have gotten worse by over 1000%."
  },
  {
    "headline": "IGP appoints new commissioner for Ekiti, AIG Amadi takes over Research and Planning",
    "summarized_story": "From Molly Kilete, AbujaThe Inspector-General of Police (IGP), Usman Alkali Baba, has announced the appointment of Moronkeji Olusegun Adesina as the new Commissioner of Police for Ekiti State.\nThe IGP has also announced the appointment of Assistant Inspector-General of Police, John Ogbonnaya Amadi, as Acting DIG Department of Research and Planning, Force Headquarters, Abuja, and DIG representing the South East.\nAdejobi’s statement reads:‘The Inspector-General of Police, IGP Usman Alkali Baba, psc(+), NPM, fdc, has ordered the posting of Assistant Inspector-General of Police, AIG John Ogbonnaya Amadi, mni, as Ag.\nDIG Department of Research and Planning, Force Headquarters, Abuja, and DIG representing South-East Geo-political zone.\nThe IGP has equally ordered the posting of CP Moronkeji Olusegun Adesina, psc, as Commissioner of Police in charge of Ekiti State Police Command."
  },
  {
    "headline": "Road to 2023: APC group tips Emefiele as unstoppable successor of Buhari",
    "summarized_story": "From Romanus Ugwu, AbujaAn All Progressives Congress (APC) group, Emefiele Solidarity Vanguard (ESV), has said that Central Bank of Nigeria (CBN) Governor Dr Godwin Emefiele will be an unstoppable aspirant to replace President Muhammadu Buhari if he eventually declares his intention to run in the 2023 presidential election.\nThe leader of the pro-Emefiele group further said that the CBN governor is yet to accept the offer by Nigerians to succeed President Buhari when his tenure ends in 2023.\n‘There is no doubt that Nigerians from all quarters, the North, the South, East and West are calling on the CBN governor to run as President in 2023.\n‘We are convinced that, if he does, he will win, this is the threat where some do or die political office seekers are trying to blackmail him.\n‘We wish to make bold that, the 2023 presidential elections are far beyond an individual as Nigeria belongs to all of us."
  },
  {
    "headline": "Abuja-Kaduna Train attack: 14 missing passengers found alive, 8 dead – NRC",
    "summarized_story": "‘Also, 51 phone numbers on the manifest are either switched off or not reachable since Tuesday morning.\nA total of 35 phone numbers on the manifest are ringing but no response from the other end.\n‘Another 60 phone numbers on the manifest when called respond non-existent.\nA total of 22 persons are reported missing by their relatives while eight persons were confirmed dead.\nThe NRC boss reassured that the corporation would continue to update the general public on the developments to prevent misleading information and falsehood."
  },
  {
    "headline": "Terrorists Attack Zamfara Community, Commissioner’s Son Among those Killed",
    "summarized_story": "By Onuminya InnocentThe Nigeria Police on Monday confirmed terrorists attack on Tsafe local government area of Zamfara State.\nIn the attack on Tsafe town, no fewer than four persons were reportedly killed by the terrorists, including the son of the Zamfara State Commissioner for Internal Security and Home Affairs, DIG Mamman Tsafe (retired).\nSources told THISDAY that the suspected terrorists invaded Tsafe Local Government headquarters in Zamfara State Sunday evening firing gunshots.\nThey killed thr Commissioner’s son, Abba Mamman Tsafe, and also cut his hands.\n“With what just happened they have declared war on government , in Zamfara State now no one is safe”, he said."
  },
  {
    "headline": "Breaking: FG Bars Outgoing Calls on SIM Cards not Linked to NIN",
    "summarized_story": "Emma OkonjiThe federal government has barred all outgoing calls on every SIM card that is not linked to the National Identification Number (NIN) of the SIM card owner.\n“As of date, over 125 Million SIMs have had their NINs submitted for immediate linkage, verification and authentication.\nSimilarly, the National Identity Management Commission (NIMC) has issued over 78 million unique NINs till date,” Pantami said.\nConsequently, the Federal Government has directed all Telcos to strictly enforce the Policy on all SIMs issued (existing and new) in Nigeria.\nOutgoing calls will subsequently be barred for telephone lines that have not complied with the NIN-SIM linkage Policy from the 4th of April, 2022."
  },
  {
    "headline": "Obasanjo: Buhari is Overwhelmed, Nigeria in Serious Situation",
    "summarized_story": "The former president said the present government was overwhelmed by the situation, cautioning, however, that Nigerians must not allow the problem to overcome the country.\n“A situation where you are not safe on the road, you are not safe on the train, you are not safe at the airport, shows a very serious situation.\n“For, hiring the services of foreign mercenary is certainly beyond the power of any state governor, according to the Constitution of the Federal Republic of Nigeria.\n“There are dangers in bringing in foreign mercenaries by these governors, because their antecedents in the recent past do not give us reasons to trust them.\nPDP told El-Rufai that his suggestion or threats to import foreign mercenaries was counter-productive and capable of compounding the already dire security situation in the country."
  },
  {
    "headline": "FG Banks on Shell, TotalEnergies’ Projects to Add 800,000 Barrels to Daily Production",
    "summarized_story": "Discovered in 2003, Preowei has a subsea tank with over 150 million barrels of oil and gas equivalent and is expected to pump about 50,000 barrels of oil per day at peak.\nShell’s Bonga South West FPSO, with the capacity to pump 150,000 barrels per day, is another project government is relying on to boost daily oil production by 800,000 barrels.\nNigeria has been grossly underperforming in oil production, with Africa’s largest oil producer failing to meet its production quota by the Organisation of Petroleum Exporting Countries (OPEC) for many months running.\nAfter its meeting last week, the cartel raised Nigeria’s production quota from April’s 1.735 million barrels per day to 1.753 million barrels per day in May, even though the country has been struggling to meet lower production allocations.\nThe Biden administration’s giant oil release contrasts sharply with OPEC+, which on Thursday ratified a planned, modest production increase of about 430,000 barrels a day."
  },
  {
    "headline": "Uzo Uwani Indigenes Allege Marginalisation, Seek Ugwuanyi’s Intervention",
    "summarized_story": "“Enugu state as it is today was created out of Anambra state in 1991.\n“In 1996, Abakaliki zone of Enugu state was carved out to fuse with Afikpo zone of Abia state to become Ebonyi state.\nThis left, in Enugu state, Nsukka zone and Enugu zone.\nSince the return of democracy in 1999, Enugu zone has produced all the Ministers from Enugu state.\nOn the basis that Enugu zone did 16 years, we ask that Nsukka zone be allowed to complete its 16 years as governor."
  },
  {
    "headline": "Insecurity: Buhari Doesn’t Deserve To Be Nigerian President, Says Sultan-led Jama’atu Nasril Islam Council",
    "summarized_story": "The Jama’atu Nasril Islam (JNI) has said any government incapable of protecting its citizens has lost the moral justification for being in power.\nJNI, which is the umbrella body of northern Muslims, is headed by Sa’ad Abubakar III, the Sultan of Sokoto.\nSaharaReporters had reported how terrorists bombed the Abuja-Kaduna train en route Rigasa destination with hundreds of passengers on-board.\nDuring the attack, many passengers were kidnapped, others shot dead and unascertained number of the passengers also sustained various degrees of injury.\n“In fact, terrorists do what they wish knowing that there is no gun power or authority that will defy them."
  },
  {
    "headline": "Insecurity: Buhari Doesn’t Deserve To Be Nigerian President, Says Sultan-led Jama’atu Nasril Islam Council",
    "summarized_story": "The Jama’atu Nasril Islam (JNI) has said any government incapable of protecting its citizens has lost the moral justification for being in power.\nJNI, which is the umbrella body of northern Muslims, is headed by Sa’ad Abubakar III, the Sultan of Sokoto.\nSaharaReporters had reported how terrorists bombed the Abuja-Kaduna train en route Rigasa destination with hundreds of passengers on-board.\nDuring the attack, many passengers were kidnapped, others shot dead and unascertained number of the passengers also sustained various degrees of injury.\n“In fact, terrorists do what they wish knowing that there is no gun power or authority that will defy them."
  },
  {
    "headline": "Insecurity: Buhari Doesn’t Deserve To Be Nigerian President, Says Sultan-led Jama’atu Nasril Islam Council",
    "summarized_story": "The Jama’atu Nasril Islam (JNI) has said any government incapable of protecting its citizens has lost the moral justification for being in power.\nJNI, which is the umbrella body of northern Muslims, is headed by Sa’ad Abubakar III, the Sultan of Sokoto.\nSaharaReporters had reported how terrorists bombed the Abuja-Kaduna train en route Rigasa destination with hundreds of passengers on-board.\nDuring the attack, many passengers were kidnapped, others shot dead and unascertained number of the passengers also sustained various degrees of injury.\n“In fact, terrorists do what they wish knowing that there is no gun power or authority that will defy them."
  },
  {
    "headline": "2023: MKO Abiola’s Daughter, Tundun Lambasts Sister, Hafsat For Using Dad’s Name To Campaign For Yahaya Bello",
    "summarized_story": "Tundun, daughter of the late MKO Abiola, the acclaimed winner of the 1993 general election, has criticised her sister, Hafsat Abiola-Costello for using their father’s name to promote the presidential bid of Yahaya Bello, governor of Kogi State.\nAbiola-Costello, director-general of the Yahaya Bello presidential campaign organisation had on Sunday appeared on Arise TV where she disclosed that the similarities between her father and Bello encouraged her to take the job.\nTundunBut reacting to the development on Monday while co-anchoring Morning Show, a programme on ARISE TV, Tundun said her sister did not have the right to “exploit” their father’s name for Bello’s benefit.\nWATCH: MKO Abiolaâ\u0080\u0099s Daughter, Tundun Lambasts Sister, Hafsat For Using Dadâ\u0080\u0099s Name To Campaign For Yahaya Bello @OfficialGYBKogið\u009f\u008e¥: Arise TV pic.twitter.com/O554EBXEdD — Sahara Reporters (@SaharaReporters) April 4, 2022A visibly angry Tundun added that her half-sister should have focused on elaborating her principal’s plans for Nigeria instead of dragging their father’s name through the mud.\n“I’m referring to my half-sister, Hafsat, who is the DG of the Yahaya Bello campaign and her making comparisons to my dad."
  },
  {
    "headline": "2023: MKO Abiola’s Daughter, Tundun Lambasts Sister, Hafsat For Using Dad’s Name To Campaign For Yahaya Bello",
    "summarized_story": "Tundun, daughter of the late MKO Abiola, the acclaimed winner of the 1993 general election, has criticised her sister, Hafsat Abiola-Costello for using their father’s name to promote the presidential bid of Yahaya Bello, governor of Kogi State.\nAbiola-Costello, director-general of the Yahaya Bello presidential campaign organisation had on Sunday appeared on Arise TV where she disclosed that the similarities between her father and Bello encouraged her to take the job.\nTundunBut reacting to the development on Monday while co-anchoring Morning Show, a programme on ARISE TV, Tundun said her sister did not have the right to “exploit” their father’s name for Bello’s benefit.\nWATCH: MKO Abiolaâ\u0080\u0099s Daughter, Tundun Lambasts Sister, Hafsat For Using Dadâ\u0080\u0099s Name To Campaign For Yahaya Bello @OfficialGYBKogið\u009f\u008e¥: Arise TV pic.twitter.com/O554EBXEdD — Sahara Reporters (@SaharaReporters) April 4, 2022A visibly angry Tundun added that her half-sister should have focused on elaborating her principal’s plans for Nigeria instead of dragging their father’s name through the mud.\n“I’m referring to my half-sister, Hafsat, who is the DG of the Yahaya Bello campaign and her making comparisons to my dad."
  },
  {
    "headline": "Tundun Abiola berates Hafsat for 'exploiting' father's name for Yahaya Bello's campaign",
    "summarized_story": "Tundun, daughter of the late MKO Abiola, the presumed winner of the 1993 election, has criticised her sister, Hafsat, for using their father’s name to promote the presidential bid of Yahaya Bello, governor of Kogi.\nThe Kogi governor’s campaign slogan is ‘Hope 2023’, which is similar to the slogan used by Abiola during the 1993 presidential election campaign.\nBello also appointed Hafsat Abiola-Costello, one of Abiola’s daughters, as the director-general of his presidential campaign organisation.\nAdvertisementSpeaking in an interview on ARISE TV, Hafsat said she accepted the appointment because the Kogi governor shares some qualities with that of her father.\nAdvertisement“I’m referring to my half-sister, Hafsat, who is the DG of the Yahaya Bello campaign and her making comparisons to my dad."
  },
  {
    "headline": "Tundun Abiola berates Hafsat for 'exploiting' father's name for Yahaya Bello's campaign",
    "summarized_story": "Tundun, daughter of the late MKO Abiola, the presumed winner of the 1993 election, has criticised her sister, Hafsat, for using their father’s name to promote the presidential bid of Yahaya Bello, governor of Kogi.\nThe Kogi governor’s campaign slogan is ‘Hope 2023’, which is similar to the slogan used by Abiola during the 1993 presidential election campaign.\nBello also appointed Hafsat Abiola-Costello, one of Abiola’s daughters, as the director-general of his presidential campaign organisation.\nAdvertisementSpeaking in an interview on ARISE TV, Hafsat said she accepted the appointment because the Kogi governor shares some qualities with that of her father.\nAdvertisement“I’m referring to my half-sister, Hafsat, who is the DG of the Yahaya Bello campaign and her making comparisons to my dad."
  },
  {
    "headline": "'You're not remorseful' -- mosque sacks Abuja imam over anti-government sermon",
    "summarized_story": "Sheikh Nuru Khalid has been sacked as the chief imam of the Apo legislative quarters Juma’at mosque in Abuja.\nWe will not go to the polls, since you have nothing to do but vote,” Khalid had said.\nSaidu Muhammed Dansadau, chairman of the mosque committee, said the cleric’s teachings of political apathy are un-Islamic.\nAdvertisementReacting to his suspension, Khalid said only God can give or take power from anyone.\nIn a letter addressed to the Imam on Monday, the mosque committee said he had shown no “remorse” despite his suspension."
  },
  {
    "headline": "'You're not remorseful' -- mosque sacks Abuja imam over anti-government sermon",
    "summarized_story": "Sheikh Nuru Khalid has been sacked as the chief imam of the Apo legislative quarters Juma’at mosque in Abuja.\nWe will not go to the polls, since you have nothing to do but vote,” Khalid had said.\nSaidu Muhammed Dansadau, chairman of the mosque committee, said the cleric’s teachings of political apathy are un-Islamic.\nAdvertisementReacting to his suspension, Khalid said only God can give or take power from anyone.\nIn a letter addressed to the Imam on Monday, the mosque committee said he had shown no “remorse” despite his suspension."
  },
  {
    "headline": "Lai counters Obasanjo, says Buhari administration not overwhelmed by insecurity",
    "summarized_story": "Lai Mohammed, minister of information and culture, says the administration of President Muhammadu Buhari is not overwhelmed by the security challenges of Nigeria.\nOn Saturday, former President Olusegun Obasanjo had said Nigerians are no longer safe anywhere in the country and that the Buhari administration is overwhelmed by insecurity.\nThe government is by no means overwhelmed even if it appears to some that it is overwhelmed,” Mohammed said.\nThat the federal government has been giving the security forces the platforms, an enabling environment to win the war.\nAnd we need the support of everybody, we need the encouragement."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "13 years, $10bn processed. How has Paga evolved over the years?",
    "summarized_story": "After considering several ideas for a couple of months, Oviosu came up with what is now Paga.\nPaga was arguably the first fintech company in Nigeria to popularise mobile money among the unbanked.\nIn 2021, Paga opened up its platform to more businesses through Collect APIs, which more than 200 businesses currently use.\nExpansion“The vision is still the same—to solve payments for individuals and businesses,” Oviosu said.\nTayo Oviosu, Paga co-founder and CEO."
  },
  {
    "headline": "Peace Itimi: From Nigeria to the UK in search of peace",
    "summarized_story": "Peace Itimi has spent 9 months away from Nigeria but doesn’t miss the country.\nShe said university had been one of the most definitive phases of her life because it was where she found God, found herself, and digital marketing.\nFresh from school, she launched a digital marketing agency with a friend in 2016.\nIn 2018, she joined Wild Fusion, another digital marketing agency, where she trained people on digital marketing, branding, Google Ads, and SEO.\nDuring one of her travels for digital marketing training in Accra, she realised that even though she loved travelling, her physical reach was limited."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ever heard of the term, Hope as a Service?\nWell, me neither.\nAt least until last Wednesday when we recorded..."
  },
  {
    "headline": "Stax is levelling the playing field between USSD and bank apps",
    "summarized_story": "According to the Global System for Mobile Communications Association (GSMA), nine in 10 mobile money transactions in sub-Saharan Africa are done through USSD.\nLyon described Stax as an online payment super app for Africa that brings together all USSD based services in one place.\nWhat Stax does is run the USSD in the background and reduce the USSD menus to fewer taps within the app.\nThe Stax app works almost like any bank app, but offline.\nHow Stax makes moneyFree to use, Stax only takes a USSD telco session charge."
  },
  {
    "headline": "King MTN and the tax collector",
    "summarized_story": "Even though I’ve been a football fan for the last 13 years, I’ve never understood the craze behind fantasy football.\nSo imagine my surprise when I heard African football fantasy startup, Eksab had raised $3million in funding on Monday, March 28, 2022.\nWhat’s fantasy football, though?\nBut what does a fantasy football startup raising money mean for the “ecosystem”?\nApart from this, however, is one crucial fact: MTN contributes double-digit percentages to Nigeria’s tax revenue."
  },
  {
    "headline": "NowNow reaffirms commitment to driving financial inclusion in Nigeria",
    "summarized_story": "The company has built an ecosystem that digitises payments and creates access to financial services for Agents, Consumers and Businesses.\nFrom L-R: Chief Strategy and Investment Officer, NowNow, Mr Mathew Francis and Partnership Director, NowNow, Mr Lekan Akinjide, at the NowNow media conference in Lagos.\nLekan Akinjide, the Partnership Director of NowNow Digital Services, said, “We are a leading fintech and financial services enabler.\nNowNow offers more than financial inclusion; we want to educate Nigerians about Financial services by teaching them how to manage their money to help them achieve financial independence.\nFrom L-R: Chief Strategy and Investment Officer, NowNow, Mr Mathew Francis; Head of Marketing & Communications, NowNow, Tasyana Bouran; and Partnership Director, NowNow, Mr Lekan Akinjide, at the NowNow media conference in Lagos."
  },
  {
    "headline": "Vigilante operatives escapes ambush by suspected herdsmen in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEvboesi – Vigilante operatives at Evboesi community in Orhionmwon local government area of Edo state narrowly escape death on Monday after suspected armed herdsmen ambushed their vehicle along the Benin-Abraka road adjacent the railway line.\nThe operatives numbering six were about to park their operational vehicles at their base along the road to commence daily security duties when the armed men opened fire on them.\nAs they were about to pack their vehicles, suddenly the herdsmen starting shooting at the vehicles while my men were still inside.\nA motorist, Benjamin Ebiyemi appealed to the state government to support the vigilante groups operating in the area with the necessary logistics to enable them complement the police.\nIf no dem, nobody fear go let am pass that road; and na im the herdsmen dey vex for them."
  },
  {
    "headline": "Enhancing Anti-Corruption and Social Inclusive Reforms Initiatives in Nigeria: ANEEJ lauded at Inception meeting – Nigerian Observer",
    "summarized_story": "“There are research that have now demonstrated that when there is absence of transparency the tendency is to have accountability impaired.\nIn the past, ANEEJ was known for coming from the confrontational background, throwing stones.\nHaving to associate with ANEEJ we know that we would be able to achieve that at the National Assembly,” she enthused.\n“We thank ANEEJ for including the people with disability in this project, we have never had it so good.\nAccording to Sandra Eguagie, the second indicator to be measured in this project is the total number of anti-corruption commitment and oil commission mandate and policy documents reviewed."
  },
  {
    "headline": "Edo extends internship, apprenticeship programme to youths in Edo North, Central – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government through the state’s skills development agency, EdoJobs has extended its internship and apprenticeship programme to youths in Edo North and Central Senatorial Districts, deploying the youths to different organizations to acquire firsthand knowledge of how organizations operate.\nThe programme is being organised in partnership with the German development agency, the Deutsche Gesellschaft Fur Internationale Zusammenarbeit (GIZ) and the Swiss Agency for Development Cooperation (SDC).\nThe Managing Director, EdoJobs, Ukinebo Dare, who disclosed this to journalists in Benin City, said the extension followed the success of the programme in Edo South.\nShe said the project is an arm of the Rural Youth Employment (RYE) to tackle unemployment in rural areas.\nThe scheme, which began in January and ends in April, is for the youths in Edo North and Edo Central."
  },
  {
    "headline": "Edo begins assessment of workers for promotion – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has commenced the evaluation and assessment exercise for the promotion of workers in the state’s civil and public service.\nThe Edo State Head of Service, Anthony Okungbowa Esq., who disclosed this to journalists, in Benin City, during training/evaluation exercise for the workers, said the government is committed to sustaining reforms in the civil and public service to enhance optimal service delivery.\nOkungbowa said the Governor Godwin Obaseki-led administration will sustain efforts at retooling workers with the right skills and knowledge to provide quality service to Edo people.\nHe further disclosed that Governor Obaseki had earlier granted approval for the 2020 and 2021 promotions in order to ensure that all outstanding promotions are cleared, thereby guaranteeing that promotion in the civil and public service is done as and when due.\nOkungbowa stated that “the Government will always place the welfare of workers as a top priority as every Edo worker is valuable and essential for the programme and policies of Government to effectively strive.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Saving public tertiary education in Nigeria",
    "summarized_story": "For several years now, the public tertiary education space in Nigeria has been afflicted by a rash of industrial actions arising from the displeasure of academics and other stakeholders in the system over the inability of government to honour collective bargaining agreements and give a jolt of life to the sector.\nThe latest experience of this disruption in the academic calendar of public tertiary institutions began in February when the Academic Staff Union of Nigerian Universities, ASUU resumed its warning strike action that it had earlier suspended.\nAnd for the better part of seven weeks, the institutions have in the immediate, remained cold rooms for study purposes.\nThey include the challenge of securing enduring quality for the system in a world where tertiary education is evidently a universal engagement where global best practices are the norm.\nIn the past there have been several suggestions, including one that public office holders be forced to compulsorily educate their children and wards within the countrys public tertiary educational system."
  },
  {
    "headline": "Tension mounts over Lekki Tollgate reopening",
    "summarized_story": "By ADEBAYO OBAJEMUIf not properly handled the proposed reopening of Lekki Toll gate may prove a sticky one for the administration of Babajide Sanwoolu of Lagos State.\nBut that was not before the Lekki Concession Company, operators of the Lekki Toll Gate, where the killings happened, was indicted.\nRecently, the Lagos State Commissioner for Information, Gbenga Omotoso, announced plans by the Lagos State Government to open the Lekki Toll Gate closed for over 18 months since the massacre.\n“For money, reopening Lekki Toll gate without the state paying adequate compensations to victims and publicly apologizing is not the path to go”, said Professor Adeagbo Moritiwon, a political scientist.\nSome Nigerians also took to social media to demand justice for people killed and injured at Lekki Toll Gate during the #EndSars protest."
  },
  {
    "headline": "Soaring diesel cost forces companies to adopt gas power",
    "summarized_story": "The resultant surge in crude prices pushed the cost of diesel, used by most manufacturers to power their generators, to over N400 per litre.\nSome of the manufacturers who spoke with our correspondent in Lagos, said the high cost of diesel has driven up the cost of production.\nWe also expended about N157 million on 33KVA dedicated line to get 23 hours power supply by co-opting other neighbouring companies just to cope with the huge expenses.\n“The rise in the price of diesel means higher production cost for manufacturers because most of us rely on diesel to produce.\n“The direct implication of this trend, as many Nigerians are already feeling the heat, is the reflective high cost of goods in the market owing to the high cost of production”, the MAN DG noted."
  },
  {
    "headline": "PDP betrays Southeast, throws ticket open",
    "summarized_story": "The Southeast may have little hope in the event of open contest, which may be the stimulus for the intervention of Gov.\nFor Governor Wike, what you see is what you get.\nGovernor Wike accepted the nomination form, thanked those who bought it for him, and said he is prepared for the assignment.\nHe said the Independent National Electoral Commission (INEC) should prepared for transparent election, once he gets the PDP presidential ticket.\n“We have been with the South South all the way."
  },
  {
    "headline": "Kaduna Partners Experts On Data Utilisation To Solve Problems",
    "summarized_story": "Kaduna State government has partnered with experts in the development of data digitisation plan aimed at strengthening the coordination in the collection and use of data for evidence-based decision making and problem-solving.\n“Data helps to track productivity,” she stressed in her goodwill message to the finals of the Kaduna Datathon event.\nThe 2022 Kaduna Datathon is currently being implemented by the Kaduna State Bureau of Statistics (KDBS) in partnership with the Bill and Melinda Gates Foundation (BMGF), and the Natview Foundation for Technology Innovation (NFTI) as a follow up activity to the 2021 Click -On Kaduna Data Science Fellowship programme.\nThe NFTI is basically to identify and build the capacity of no fewer than 100 young persons on data management to contribute to policy development cycle and programme planning.\nADVERTISEMENTSpeaking at the 2022 Kaduna Datathon final where data hackers from across Nigeria convened and pitched their solutions, the executive director, NFTI, Nuradeen Maidoki said Kaduna State government took a unique approach to solve the state’s numerous challenges in evidence-based decision making."
  },
  {
    "headline": "Soludo Orders One-day Prayer To Counter Monday Sit-at-Home",
    "summarized_story": "Anambra State governor, Prof. Chukwuma Soludo, has directed the people of the state to observe a one-day prayer to counter what he called the “evil” effect of the Monday sit-at-home order in the State.\nThe governor, who gave the order on Saturday, said the prayer session will work against the activities of the gunmen terrorising the state and the South-East region.\nThe prayer session would hold on Monday, April 4, 2022, in churches and other religious worship centres across the state.\nThe sit-at-home order was to protest against the arrest and detention of IPOB leader, Nnamdi Kanu.\nHowever, after a while it scrapped the directive in the South-East region, saying the development was to embrace peaceful negotiations."
  },
  {
    "headline": "Tompolo’s Vessel Under EFCC Custody Sinks In Lagos",
    "summarized_story": "A boat seized by the Economic and Financial Crimes Commission (EFCC) and owned by Niger-Delta warlord, Government Ekpemupolo, also known as Tompolo, has sank in Lagos waters.\nThough christened NIMASA Barugu, Osagie said the boat and its management have been a subject of litigation while its crew doesn’t report to NIMASA anymore.\nAccording to him, the boats and its management have remained a subject of litigation and under the custody of the EFCC for years.\n“Collectively, the boats and their management have remained a subject of litigation and under the custody of the Economic and Financial Crimes Commission (EFCC) for years.\nThe crew onboard does not report to NIMASA but to Global West management, its owners."
  },
  {
    "headline": "Tompolo’s Vessel Under EFCC Custody Sinks In Lagos",
    "summarized_story": "A boat seized by the Economic and Financial Crimes Commission (EFCC) and owned by Niger-Delta warlord, Government Ekpemupolo, also known as Tompolo, has sank in Lagos waters.\nThough christened NIMASA Barugu, Osagie said the boat and its management have been a subject of litigation while its crew doesn’t report to NIMASA anymore.\nAccording to him, the boats and its management have remained a subject of litigation and under the custody of the EFCC for years.\n“Collectively, the boats and their management have remained a subject of litigation and under the custody of the Economic and Financial Crimes Commission (EFCC) for years.\nThe crew onboard does not report to NIMASA but to Global West management, its owners."
  },
  {
    "headline": "2023: I Will Be Your Voice If Given The Mandate, Okai Tells Bassa PDP Delegates",
    "summarized_story": "The leading House of Representatives aspirant also disclosed that it will not be business as usual particularly for the good people of Bassa local government area if he assumes the legislative seat on their behalf.\nOkai made this known while addressing the PDP delegates in Oguma, the headquarters of Bassa LGA of the State.\nLEADERSHIP reports that Dekina/Bassa federal constituency is one of the three federal constituencies in Kogi East senatorial district of Kogi State.\nHe lamented the fact that Bassa local government is the only being recognised during the elections and not being remembered for dividends of democracy.\n“A lawmaker must has a lobbying power and negotiating capacity to attract job opportunities for his constituency and a sound voice to speak on their behalf,” Okai stated."
  },
  {
    "headline": "Moment Wike led 3 governors to meet IBB, Abdulsalami in Minna (Photos)",
    "summarized_story": "Also at the meeting were former Benue State Governor, Senator Gabriel Sasuwan, Senator Kasim Imam, Senator Suleiman Nafsir and former Senator Lekenwo from River State.\nThe Rivers Governor few days ago declared his interest to contest the 2023 presidency, under the banner of PDP.\nHe will have to slug it out with former Vice President, Atiku Abubakar; former Senate President, Dr. Bukola Saraki and several others at the primaries for the PDP’s ticket."
  },
  {
    "headline": "IGP Alkali appoints Amadi acting DIG",
    "summarized_story": "The Inspector-General of Police, IGP Usman Alkali Baba, has ordered the posting of Assistant Inspector-General of Police, AIG John Ogbonaya Amadi, as acting DIG Department of Research and Planning, Force Headquarters, Abuja, and DIG representing South-East Geo-political zone.\nThe IGP has equally ordered the posting of CP Moronkeji Olusegun Adesina, as Commissioner of Police in charge of Ekiti State Police Command.\nThis is contained in a statement issued by Acting Force Public Relations Officer, CSP Muyiwa Adejobi on Monday.\nDIG John Ogbonaya Amadi, who hails from Ebonyi State, is a versatile police officer, with a Bachelor’s degree in Education (Biology) and a Master’s Degree in Education both from the prestigious University of Lagos.\nPrior to his posting as CP Ekiti, he was the CP General Investigations, Force Criminal Investigations Department, Abuja."
  },
  {
    "headline": "I’ve paid price for the voiceless – Sacked Abuja Imam speaks, gets new appointment",
    "summarized_story": "I’ve paid price for the voiceless – Sacked Abuja Imam speaks, gets new appointmentFormer Chief Imam of the National Assembly Legislative Quarters Mosque, Sheikh Muhammad Nuru Khalid, says the termination of his appointment was a price he paid for Nigerians who have no voice.\nAccording to him, he is set to lead his new congregation with effect from Friday, April 8.\n“This is the price we pay for aligning with the people and identifying with their sufferings.\n“By the Grace of Almighty Allah, I will be leading my new congregation this Friday, because as clerics we need a platform to operate.\n“There’s a Jum’mat mosque we built behind the Central Bank of Nigeria, CBN Quarters, in Abuja; I will now be leading the congregation there.”"
  },
  {
    "headline": "“It is the audacity for me” Nigerians drag Mercy Aigbe for celebrating her step daughter’s birthday",
    "summarized_story": "“It is the audacity for me” Nigerians drag Mercy Aigbe for celebrating her step daughter’s birthdayNollywood actress, Mercy Aigbe has received a stray bullet for wishing her husband’s daughter a happy birthday.\nKazim’s daughter, Aliyah with first wife, Funsho Adeoti clocked a new age today, April 4th and received a sweet birthday message from her father’s second wife.\nMercy Aigbe took to Kazim’s comment section to drop a sweet birthday message for his daughter which he appreciated.\nMercy Aigbe commented “Happy Birthday Aliyah”.\nitygirl : You collect papa Aliyah and u dey wish Aliyah happy birthday u be mumu."
  },
  {
    "headline": "JUST IN: One Killed As Okada Riders, Hoodlums Clash In Lagos",
    "summarized_story": "JUST IN: One Killed As Okada Riders, Hoodlums Clash In LagosOne person was killed on Monday when Okada riders clashed with hoodlums in the Baruwa-Gate area of Ipaja, Lagos State.\nThe cause of the fight could not be ascertained as of the time of filing this report.\nThe Lagos State Police Command’s spokesperson, Benjamin Hundeyin, confirmed the incident to The PUNCH.\nIn an update, the Rapid Response Squad of the Lagos State Police Command said, “Our officers responded to the violent fights that broke out in Baruwa/Gate area of Ipaja this morning.\n“The killer and other suspects have been arrested while intensive patrols of the area is going on."
  },
  {
    "headline": "Buhari Govt Not Overwhelmed By Insecurity – Lai Mohammed Replies Obasanjo",
    "summarized_story": "On Monday, Lai Mohammed, the Minister of Information and Culture, stated that the Muhammadu Buhari administration is not overwhelmed by the country’s security concerns.\nRecall that former President Olusegun Obasanjo remarked on Sunday that President Muhammadu Buhari’s administration is beset by insecurity.\nHe urged for a determined effort to reverse Nigeria’s tide of insecurity, lamenting the fact that the Buhari administration had been overwhelmed by the situation.\nAccording to him, the government is moving quickly to put various security devices on railway tracks to ensure proper surveillance.\n“But also on the Lagos-Ibadan and Warri-Itakpe rail tracks to ensure that at any given time we will be able to monitor from the control room,’’ he said."
  },
  {
    "headline": "Train attack: The humanity in us slowly being eroded – JNI – Blueprint Newspapers Limited",
    "summarized_story": "It also expressed worry that the tragic train attack may have indicated the nation was heading towards an unknown destination of chaos.\nJNI Secretary-General Dr. Khalid Abubakar Aliyu made the group’s position known Monday in a statement issued to journalists in Kaduna.\nTitled ‘Passengers’ bound train attack along Abuja-Kaduna rail track’, the statement said: “To say the least Jama’atu Nasril Islam (JNI) is agonised and short of words to express her-self over the gory incident of the infamous train attack which happened on Monday, 28th March, 2022.\nThe mind boggling train attack of Monday, 28th March, 2022, the kidnap and sporadic shootings that ensued thereafter the train en-route Kaduna needs to be seriously investigated and punitive measures taken.\nAlthough, without doubt, the security men have exhibited capacity, resilience, determination and dexterity during the rescue operation of the same ill-fated train attack."
  },
  {
    "headline": "2023: Ortom-led PDP zoning committee set to meet",
    "summarized_story": "The race to the Presidential Villa in 2023 is getting more intense in the Peoples Democratic Party (PDP) as the party’s 37-man zoning committee meets to take a decisive position.\nThe source, a high ranking member of the party and also a member of the committee who did not want his name in print said, “the zoning committee has met twice since inauguration.\n“The previous meetings ended inconclusively as members of the committee were advancing arguments to favour their zone.\nOthers who have obtained the PDP presidential nomination form include, Sokoto state Governor Aminu Tambuwal, Bauchi state Governor Bala Mohammed; Akwa Ibom state Governor Udom Emmanuel; former Senate President Abubakar Bukola Saraki; Oliver Diana Teriela, Nwachukwu Anakwenze, Ovation Publisher, Dele Mohammed, Sam Ohuabunwa and Mohammed Hayatu-Deen.\nDokpesi hopeful on AtikuIn a related development, the chairman, Technical Committee, Atiku Presidential Project, High Chief Raymond Dokpesi, has expressed confidence that the PDP zoning would not affect the former VP."
  },
  {
    "headline": "Breaking: Crystal Palace shock Arsenal, peg back Gunners’ Premier League top 4 hope",
    "summarized_story": "Arsenal missed the chance to move back into the Premier League’s top four and strengthen their hopes of Champions League football as they were stunned by Crystal Palace at Selhurst Park.\nThe Gunners would have moved above Tottenham with victory but fell behind early on through Jean-Philippe Mateta’s header following a free-kick.\nThings got worse for the visitors a few minutes later when Jordan Ayew got away from two Arsenal defenders and bent a shot beyond Aaron Ramsdale.\nArsenal were outfought and outworked in the first half, their only shot on target a Gabriel header at Palace goalkeeper Vicente Guaita.\nBut they never got going against a tenacious Palace side as they lacked the same level of aggression as their hosts."
  },
  {
    "headline": "Social Media Marketing for Franchises is Meant for Women",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nI think I’d go mad if I didn’t have a place to escape to."
  },
  {
    "headline": "Radio Air Time Marketing: A New Strategy for the Economy",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nI think I’d go mad if I didn’t have a place to escape to."
  },
  {
    "headline": "Shop The Best Street Style From Paris Fashion Week Shows",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nFashion moves so quickly that, unless you have a strong point of view, you can lose integrity."
  },
  {
    "headline": "Style Spy: Fashion Model Goes Casual in Faux Furr and Plaid",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nFashion moves so quickly that, unless you have a strong point of view, you can lose integrity."
  },
  {
    "headline": "Now Is the Time to Think About Your Small-Business Success",
    "summarized_story": "After gathering ourselves and our packs, we headed down to our homestay family’s small dining room for breakfast.\nRefreshingly, what was expected of her was the same thing that was expected of Lara Stone: to take a beautiful picture.\nI had low expectations about Sofia as a city, but after the walking tour I absolutely loved the place.\nThis was an easy city to navigate, and it was a beautiful city – despite its ugly, staunch and stolid communist-built surrounds.\nI think I’d go mad if I didn’t have a place to escape to."
  },
  {
    "headline": "11 Feared Abducted As Bandits Attack Kaduna Village",
    "summarized_story": "No fewer than eleven people have been reportedly abducted and one injured by bandits who attacked Angwar Maji community at Jere town in Kagarko Local Government Area of Kaduna state.\nThe community is located close to the Abuja-Kaduna highway and Kaduna- Bwari Road.\nRead Also: At Least 13 Killed In Fresh Bandit Attack On Zamfara VillagesThe source said the bandits, who were in large numbers, invaded the community at about 11 pm and immediately opened fire before moving from house to house to kidnap the residents.\nAccording to the locals, some women whose husbands were about to be taken away attempted to resist the attackers, and in the process, one of the women was injured.\nFour of the victims were said to have escaped from the kidnappers and later returned to the town Monday."
  },
  {
    "headline": "Mock-UTME: Diesel Price, Others Force JAMB To Increase Service Charge",
    "summarized_story": "The Joint Admissions and Matriculations Board (JAMB) has announced an increase in the service charge for this year’s mock Unified Tertiary Matriculation Examination (UTME).\nLess than a week to the optional examination, the board disclosed that the service charge has been increased by N400.\nIt stated that while the examination would be conducted freely at its centres, JAMB said candidates willing to take part would have to pay N1,000 to their Computer-Based Test (CBT) centres as a service charge.\nIt explained that the mock examination was introduced to give candidates the opportunity to familiarise themselves with the CBT environment.\n“However, candidates assigned to JAMB owned centres would not be required to pay for the use of the centres."
  },
  {
    "headline": "Elon Musk Becomes Largest Shareholder In Twitter",
    "summarized_story": "Elon Musk has taken a major stake in Twitter, regulatory filings showed Monday, sending the social media network’s stock soaring and igniting speculation he could seek an active role in its operations.\nAccording to a document filed with the US Securities and Exchange Commission (SEC), the South African-born billionaire acquired nearly 73.5 million Twitter shares — a 9.2 per cent stake in the company.\nMusk launched a poll on Twitter on March 25, saying “free speech is essential to a functioning democracy.\nMusk, Twitter and controversyMusk has wielded Twitter polls to conduct business before: in November last year, he offloaded $5 billion in Tesla shares days after asking fellow social media users if he should sell 10 per cent of his stake.\nThen in early March, Musk asked a New York judge to overturn the agreement with the stock market watchdog on his tweets."
  },
  {
    "headline": "NIN: Millions At Risk As FG Orders Telcos To Bar Outgoing Calls On Unlinked SIMs",
    "summarized_story": "The Federal Government has directed telecommunication companies in the country to bar all outgoing calls on unlinked lines from Monday, April 4, 2022.\nUnlinked lines are Subscriber Identity Modules (SIMS) not yet registered and linked with the National Identification Number (NIN) by users.\nOver 125 million SIMs, according to the statement, have had their NINs submitted for linkage, verification, and authentication and NIMC has issued over 78 million unique NINs to date.\nREAD ALSO: FG Urges Nigerians To Complete NIN-SIM Linkage ‘Without Delay’The government explained that NIN-SIM linkage had been extended on multiple occasions to allow Nigerians to freely comply with the policy.\nAccording to the NCC, at least 72.8 million subscribers risk being disconnected from telecommunication services following the latest directive."
  },
  {
    "headline": "2023: PDP Governors Visit Babangida In Minna",
    "summarized_story": "Governors of the Peoples Democratic Party on Monday met with former military president Ibrahim Babangida in Minna, Niger State.\nGovernors in attendance include Nyesom Wike of Rivers State, Seyi Makinde of Oyo State, Ifeanyi Ugwuanyi of Enugu State and Okezie Ikpeazu of Abia State.\nOther dignitaries in attendance at the meeting include former Head of State General Abdulsalami Abubakar, Senator Gabriel Suswam, Senator Sulaiman Nazif and Senator Olaka Nwogu.\n“I have come with my colleagues, the Governor of Rivers, Governor of Enugu, Governor of Oyo, some members of the National Assembly and other stakeholders,” he said.\n“First, to consult with the former Head of State and discuss national issues: economic development, security, and unity of our country."
  },
  {
    "headline": "Sam Ohuabunwa Backs Consensus for PDP Presidential Candidate -",
    "summarized_story": "One of the presidential aspirants of the Peoples Democratic Party, Mazi Sam Ohuabunwa says he will only support a consensus candidate for the party if the best aspirant is chosen.\nAddressing journalists at the Kwara state PDP secretariat in Ilorin, presidential aspirant observes that it is only one who doesn’t want good for Nigeria that will refuse an opportunity to produce the best candidate through consensus.\nThree PDP presidential aspirants, former President of the Senate, Bukola Saraki, Sokoto state governor, Aminu Tambuwal and his Bauchi state counterpart, Bala Mohammed have been lobbying for the emergence of a consensus candidate.\nMazi Ohuabunwa says it will be unreasonable to go against consensus but insists that the best must emerge for the party to have a chance of winning the 2023 presidential election.\nHe also promises to make Nigeria an investment destination, create employment opportunities and wipe out poverty if elected as president."
  },
  {
    "headline": "Why I'm leading Yahaya Bello's campaign organisation",
    "summarized_story": "The Director-General of the Yahaya Bello Presidential Campaign Organisation, Hafsat Abiola, has told Nigerians that she is leading the campaign efforts of Governor Yahaya Bello because she has studied the aspirant and has seen in him the qualities needed to take Nigeria to its right destination.\nThis, she said, was responsible for the persecution the Governor had faced by different interests and the controversies around his administration.\n“These are the same qualities I have seen in Governor Bello.\n“Yahaya Bello is the best man for the job.\nThousands of Nigerians from all walks of life had stormed the Eagle Square at the nation’s capital on Saturday to witness the official acceptance of Governor Yahaya Bello to vie for the 2023 Presidency."
  },
  {
    "headline": "APC Leadership has not been fair to Zamfara",
    "summarized_story": "Senator Kabiru Marafa says the All Progressives Congress has not been fair and just to the people of Zamfara StateHe says he and other party chieftains in the state are among the founding fathers of the APC but the party under the Mai Mala Buni led administration was not fair to them.\nSenator Kabiru Marafa stated this while speaking to Newsmen in Gusau, the Zamfara State CapitalThe former two term red Chamber lawmaker adds that he and former Abdul’azeez Yari remain in the APC to prove that they are card carrying and duly registered members of the party as against the stories making the round that they are notSenator Marafa further says if the people of Zamfara State decided not to continue to support the ruling APC is vase in the fact that they were not treated fairlyOver Seven hundred and fifty thousand APC Members according to him were registered before the registration was cancelled"
  },
  {
    "headline": "Gunmen attack Ondo lawmaker, Olugbenga Omole",
    "summarized_story": "Unknown gunmen have attacked the chairman, Ondo State House of assembly Committee on Information, Olugbenga Omole on Thursday.\nOmole who is representing Akoko Southwest Constituency 1, narrowly escaped assassination attempt on his life .\nHe escaped multiple gunshots were fired at his car by unknown gunmen in the heart of Akure, the state capital.\nThe lawmaker confirmed the incident to journalists."
  },
  {
    "headline": "‘NNPP will not fail like APC or PDP’- Senator Rabiu Kwankwaso",
    "summarized_story": "It is no longer news that Senator Rabiu Musa Kwankwaso has left the People’s Democratic Party – the PDP – the party, which provided him the platform to become the Governor of Kano State, Minister of Defence and a Senator.\nKwankwaso, who emerged on Wednesday, last week in Abuja, as the new national leader of the New Nigeria People’s Party (NNPP), commands a large number of supporters since 2011 when he was re-elected as governor of the state.\nCould it be that the senator is out for mischief against the PDP in Kano state, considering that he is not only a stakeholder but also a brand in his own right?\nOr is it about contesting the 2023 presidential election on the platform of the NNPP?\nTo address all these issues, is SENATOR RABIU MUSA KWANKWASO, National Leader of the New Nigeria People’s Party, Former Governor of Kano State and Former Nigerian Minister of Defence."
  },
  {
    "headline": "Soludo Offers Amnesty To Agitators + Imam Suspended For Criticising Buhari- Trending With Ojy Okpe",
    "summarized_story": "Nigerians have reacted to the Suspension of ‘Nuru Khalid’ a chief Imam who last Friday, criticised the federal government’s handling of the security challenges in the country.\nThe Imam during his sermon accused President Mohammadu Buhari of failure in leadership.\nIn another development, the Governor of Anambra State Charles Soludo announced on Sunday that his administration has offered amnesty to agitators in the state.\nFinally, Pictures of campaign vehicles of the central bank Governor Godwin Emiefele surfaced online over the weekend."
  },
  {
    "headline": "Netherlands Coach Louis van Gaal Reveals He Has Prostate Cancer",
    "summarized_story": "Netherlands head coach and former Manchester United boss Louis van Gaal has revealed he’s being treated for prostate cancer.\nThe 70-year-old made the admission on a television show in the Netherlands called Humberto on Sunday evening while promoting a new documentary about his life.\nI thought that should also be in the film.”Van Gaal took charge as Netherlands boss for a third time in August 2021 having previously led them to a third-placed finish at the 2014 World Cup.\nBefore returning to the dugout with Netherlands, Van Gaal was in charge at Manchester United between 2014 and 2016.\nUnited posted a message of support on their Twitter feed that said: “Everybody at Manchester United is fully behind our former manager, Louis van Gaal, in his battle against cancer."
  },
  {
    "headline": "California Police Search for Shooters Who Killed 6, Hurt 12",
    "summarized_story": "In a matter of seconds, the latest U.S. mass shooting had left six people dead and 12 wounded.\nOf the 12 wounded, at least four had critical injuries, according to the Sacramento Fire Department.\nAnd it was the second mass shooting in Sacramento in the last five weeks.\n“Today, America once again mourns for another community devastated by gun violence,” Biden said.\nThe crime scene Sunday sprawled across two city blocks, closing off a large swath of the city’s downtown."
  },
  {
    "headline": "Nigeria Bars Outgoing Calls on SIM Cards not Linked to National Identification Number",
    "summarized_story": "Nigeria’s federal government has barred all outgoing calls on every SIM card that is not linked to the National Identification Number (NIN) of the SIM card owner.\n“As of date, over 125 Million SIMs have had their NINs submitted for immediate linkage, verification and authentication.\nSimilarly, the National Identity Management Commission (NIMC) has issued over 78 million unique NINs till date,” Pantami said.\nConsequently, the Federal Government has directed all Telcos to strictly enforce the Policy on all SIMs issued (existing and new) in Nigeria.\nOutgoing calls will subsequently be barred for telephone lines that have not complied with the NIN-SIM linkage Policy from the 4th of April, 2022."
  }
]