[
  {
    "headline": "Abia doctors suspend industrial action over kidnapped colleague",
    "summarized_story": "Sunday NwakanmaThe Nigerian Medical Association, Abia State Branch, on Friday, suspended the industrial action they embarked upon over their kidnapped colleague, Prof Uwadinachi Iweha.\nThis resolution came after an Emergency General Meeting of the State Officers Committee to review the efforts put in by the Abia State Government and security agencies geared towards rescuing Prof. Iweha.\nProf. Iweha was kidnapped on June 6 and on Monday, June 14, the doctors embarked on strike over the matter.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "Abia doctors suspend industrial action over kidnapped colleague",
    "summarized_story": "Sunday NwakanmaThe Nigerian Medical Association, Abia State Branch, on Friday, suspended the industrial action they embarked upon over their kidnapped colleague, Prof Uwadinachi Iweha.\nThis resolution came after an Emergency General Meeting of the State Officers Committee to review the efforts put in by the Abia State Government and security agencies geared towards rescuing Prof. Iweha.\nProf. Iweha was kidnapped on June 6 and on Monday, June 14, the doctors embarked on strike over the matter.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "Buhari restates Nigeria’s commitment to safer, healthier global climate",
    "summarized_story": "Buhari said that an updated NDC to the UN Framework Convention on Climate Change had been submitted to replace the interim contribution of May 27, 2021.\n“Also, 50 per cent reduction in the fraction of crop residues burnt by 2030 and implementation of forest programmes.\nThe president also thanked other members of the Major Economies Forum for Energy and Climate Change for their commitment to climate action.\n“These developments reinforce Nigeria’s commitment to the United Nations Framework Convention on Climate Change.\nBuhari said he had already signed the Nigerian Climate Change Bill on Nov. 18, 2021, in fulfillment of Nigeria’s commitment to the Glasgow Climate Pact."
  },
  {
    "headline": "Buhari restates Nigeria’s commitment to safer, healthier global climate",
    "summarized_story": "Buhari said that an updated NDC to the UN Framework Convention on Climate Change had been submitted to replace the interim contribution of May 27, 2021.\n“Also, 50 per cent reduction in the fraction of crop residues burnt by 2030 and implementation of forest programmes.\nThe president also thanked other members of the Major Economies Forum for Energy and Climate Change for their commitment to climate action.\n“These developments reinforce Nigeria’s commitment to the United Nations Framework Convention on Climate Change.\nBuhari said he had already signed the Nigerian Climate Change Bill on Nov. 18, 2021, in fulfillment of Nigeria’s commitment to the Glasgow Climate Pact."
  },
  {
    "headline": "Soludo inaugurates construction of drug market",
    "summarized_story": "Governor Charles Soludo of Anambra State, on Friday, inaugurated the construction of the Coordinated Wholesale Centre for Pharmaceutical and Allied Products in Oba, Idemili South Local Government Area of the state.\nSoludo at the ceremony said that all open drugs markets in the state would relocate to Oba when the centre is completed.\nAccording to him, the construction of the centre is in accordance with the National Drug Distribution Guidelines.\n“The Oba International drug market will be revived to help form the ecosystem for a new technology driven smart city in Oba.\n“It will also provide offices for the National Agency for Food and Drug Administration and Control, the Pharmacists Council of Nigeria and other regulatory bodies."
  },
  {
    "headline": "Ekiti 2022: Massive votes buying most likely — Group",
    "summarized_story": "By Dayo Johnson, Ado EkitiA Non-Governmental Organisation-the Kimpact Development Initiative KDI, has raised the alarm of massive vote buying in the Saturday governorship election in Ekiti State.\nThe Executive Director of the organization, Mr Bukola Idowu raised the alarm while speaking with newsmen in Ado Ekiti , Ekiti State capital.\nIdowu pointed out that vote buying was not ethical but the rate things were going in the state , there would be vote buying particularly in Ekiti Central Senatorial District of the state.\n“ KDI is predicting a ridiculous widespread of vote buying during the Saturday election.\nApart from vote buying, the organization, said that unprofessional conduct of security agents and bias media report might characterise the election today."
  },
  {
    "headline": "2023 polls: No PVC, no salary – IPMAN tell members",
    "summarized_story": "By Bashir Bello, KANOThe Independent Petroleum Marketers Association of Nigeria, IPMAN, has declared a no Permanent Voter Card, PVC, no salary for its members across the country.\nThe Chairman, IPMAN Kano chapter, Alhaji Bashir Danmalam gave the directive in a statement issued to newsmen in Kano on Friday.\nAccording to him, “The association had resolved and directed its members not to give salary to any staff working under them until such staff present their PVC.\n“We are not saying our members should vote for a particular candidate or political party but our concern is our members should obtain the PVC because without it one cannot vote.\nThe IPMAN Chairman, therefore, urged their members to make the best use of the opportunity to register before the expiration of the deadline."
  },
  {
    "headline": "We recorded low compliance on implementation of ACJL in Kano — C’ttee",
    "summarized_story": "By Bashir Bello, KANOThe Administration of Criminal Justice Monitoring Committee in Kano State, ACJMC says it has recorded low compliance among actors saddled with responsibility to ensure implementation of the law in the state.\nAccording to him, “the mandate of our committee is to act as custodians to the Law in ensuring the effective implementation of the ACJL in Kano.\nBut administration of criminal justice starts with the police if not nothing will work out smoothly.\n“So the level of compliance is low but with more enlightenment we are receiving some level of cooperation and compliance.\nThe ACJL was adopted in Kano in 2019 while the Monitoring committee to ensure the compliance of the law was established in 2021."
  },
  {
    "headline": "Despite inflation, building homes in Nigeria very easy – CEO",
    "summarized_story": "By Cynthia AloA real estate entrepreneur and businessman, Adekunle Ibrahim, has stated that it is very easy to become a homeowner in Nigeria.\nIn a statement made available to Vanguard, the Chief Executive Officer of Evermark Homes and Properties, a growing real estate firm said, “Despite hyperinflation ravaging the country, it is very easy to become a homeowner in Nigeria.\n“The major challenge we have in Nigeria at the moment is hyperinflation rates which have led to a cut-throat cost of building materials.\n“The first step is identifying a trusted real estate company like Evermark Homes.\nSecondly, affordable and flexible payment plans in real estate avail everyone the opportunity to navigate the cost of owning one."
  },
  {
    "headline": "Climate change: Buhari lists measures as Nigeria scales down on emissions",
    "summarized_story": "President Muhammadu Buhari has restated Nigeria’s commitment for a safer and healthier global climate.\nHe said measures include the elimination of kerosene lighting by 2030, increase in use of buses for public transport and reduction in burning of crop residues.\nBuhari said it covers the waste sector which would contribute to the reduction of Nigeria’s Greenhouse Gas emissions.\nThe President further mentioned ratification of the Kigali Amendment to the Montreal Protocol to phase out Hydro-fluoro-carbon emissions.\n“The Clean Energy Transport Scheme in major Nigerian cities involves the introduction of compressed natural gas for buses in public transport."
  },
  {
    "headline": "Viral video: Uniformed men entering Lagos are army recruits – Police",
    "summarized_story": "The Lagos State Police Command has debunked claims of “Fulani boys in army uniform” making their way into the state.\nThe Public Relations Officer, Benjamin Hundeyin, reacted to the viral video Friday night.\nThe PRO said the military unit confirmed that the young men recorded are newly passed out recruits from Army Depot, Zaria posted to Lagos.\n“They are currently in the premises of 9 Brigade, Nigerian Army, Ikeja.\n“Lagosians are urged to disregard the videos and its accompanying message as a piece of fake news”, he added."
  },
  {
    "headline": "Bandits attack Bauchi communities, kill four people, injure three",
    "summarized_story": "Bandits on Thursday night attacked some communities in Alkaleri Local Government Area of Bauchi State, killing four persons and leaving three others severely injured.\nDAILY POST gathered that the bandits attacked Tudun Wadan Jada, old Jamari, Sabuwa Garin Jauro Bano communities.\nIt was gathered that the gunmen were in the communities to abduct someone, who raised the alarm upon their arrival.\nConfirming the attack to journalists in Bauchi on Friday, the chairman, Alkaleri LGA, Yusuf Garba, said four persons were killed by the bandits.\nHe revealed that he held a security council with the head of security agencies in the state and the Secretary to the Bauchi State Government."
  },
  {
    "headline": "Abiodun appoints Akin-Akinsanya, Lawal Consultants on Religious Matters",
    "summarized_story": "Ogun State governor, Dapo Abiodun has appointed two clerics as Consultants on Religious Matters.\nAccording to a statement by the Chief Press Secretary to the governor, Kunle Somorin, the consultants are Bishop Tunde Akin-Akinsanya for the Christian faith and Sheikh Iskeel Lawal, better known as Sugar for the Islamic religion.\nTheir appointments, “is also in recognition of the role of religion in ensuring the social welfare and wellbeing of the citizens as encapsulated in the “Building of Future Together” Agenda of the present Administration in Ogun State”, the statement added.\nThe governor noted that though Ogun has been known for religious harmony and tolerance, the two Consultants are expected to work together to further deepen and enhance inter faith harmony in the state.\nAbiodun, in the statement, charged the appointees to bring their wide spiritual experience to bear on their new assignment, expressing confidence that their appointment will further put the state on global map of religious harmony and collaboration."
  },
  {
    "headline": "Abiodun commiserates with This Day publisher, Obaigbena over mum’s death",
    "summarized_story": "Ogun State governor, Dapo Abiodun, has commiserated with the publisher of This Day Newspapers and Chairman of the Arise Television, Nduka Obaigbena, over the demise of his mother, Princess Margaret Obaigbena.\nThe Royal Obaigbena Family of Owa Kingdom, Delta State announced her passing on Friday.\nHe noted that Madam Obaigbena contributed immensely to the development of her immediate community and Delta state, through her profession and passion for development of womenfolk.\nAbiodun, however, urged the Obaigbena Family, particularly, Nduka, to take solace in the fact that their mother lived an examplary life worthy of emulation.\nHe also prayed that God will give the Obaigbena’s Family members the fortitude to bear the irreparable loss."
  },
  {
    "headline": "Presidency assures youths of credible elections The Nation Newspaper",
    "summarized_story": "The Senior Special Adviser (SSA) to President Muhammadu Buhari on Youths and Student Affairs, Nasir Adhama, has assured Nigerian youths that the President will ensure an election without interference in the coming General elections of 2023.\nHe said the President wants to leave behind his best legacies which would include the non interference and electoral reforms before his departure from office.\nAdhama said this at the democracy day lecture, held in Abuja by the Nigerian Youth Congress (NYC) titled, ‘Election and Governance: Youth as watchmen against electoral violence.’Adhama who was represented by his technical assistant, Dr. Aminu Kyaku said, “We all know that this country is blessed with a huge population and the youths make up a bulk of the population so basically there can’t be an election without the involvement of the youths, it is the youths vote that the politicians target to win elections.\n“The unrest in the country has also largely distracted the power players to an extent that good governance is nearly becoming the impossible in all strata of government.\nWhereas experience teaches that the most critical moment for bad governments is the one which witnesses their first steps toward reform."
  },
  {
    "headline": "IPMAN warns employees The Nation Newspaper",
    "summarized_story": "Employees of the Independent Petroleum Marketers Association of Nigeria (IPMAN) will not get their salaries until they obtain the Permanent Voter Card (PVC).\nDanmallam stated that the decision was reached at a meeting with Mr. Okoronkwo who mandated him to issue the statement.\n“The association found It necessary to take the measure to ensure that all its eligible members obtain the PVC to enable them to exercise their civic responsibility at the 2023 general elections.\nThey are at liberty to vote for candidates of their choice irrespective of which party affiliations,” Danmallam stated.\nDanmallam urged IPMAN members to make the best use of the opportunity to register before the expiration of the deadline."
  },
  {
    "headline": "Lawan, Akpabio make list of senatorial candidates as INEC deadline expires The Nation Newspaper",
    "summarized_story": "Yesterday was the deadline set by INEC for all parties to turn in the names of all their candidates in the 2023 presidential and national assembly polls.\nThe duo had sought the APC presidential ticket.\nHe asked the party APC to correct the omission of his name, saying: “In the list sent to INEC, my name was found to be misrepresented.\nFor the avoidance of doubt, I remain the candidate duly elected to the APC Yobe North zone C senatorial zone.\nThis is a confidence reposed on me by the electorate in my senatorial district and this is the most minimal challenge I will face to defend their right.”Below is part of the APC senatorial candidates list:ABIA STATEChief Hon."
  },
  {
    "headline": "APC, SDP in verbal war as Ekiti elects governor The Nation Newspaper",
    "summarized_story": "The All Progressives Congress (APC) governorship candidate in Ekiti State, Mr. Biodun Oyebanji, and his Social Democratic Party (SDP) counterpart, Engr.\nThis, according to him, was a breach of the peace agreement initiated by the Gen. Abdulsalam Abubakar-led National Peace Commission.\nPolice Inspector General Usman Akali Baba said the show of force was meant to alert residents to the security agencies’ readiness for the election.\n“This is the number that will vote during this governorship election.\n“We have a total of 2,445 polling units that will be used for this election, but we have deployed a total of 3,346 BVAS to Ekiti State."
  },
  {
    "headline": "2023: I’m Peter Obi's running mate- Okupe The Nation Newspaper",
    "summarized_story": "Director-General of the Peter Obi Campaign Organisation, Dr Doyin Okupe, has declared he is the running mate of the Labour Party (LP) presidential candidate, Peter Obi.\nThe former Special Assistant on Media and Publicity to former President Olusegun Obasanjo revealed this on Politics Today of Channels Television.\n“I’m standing in as the vice-presidential candidate of the party.\n“Labour party has submitted my name as the VP of the party,” Okupe said.\nThe development follows Obi’s emergence as the presidential candidate of the LP after his resignation from the Peoples Democratic Party (PDP) on grounds of irregularities."
  },
  {
    "headline": "PDP: The coup that gave Okowa VP slot – The Sun Nigeria",
    "summarized_story": "This is even as the crack in the Peoples Democratic Party (PDP) Governors Forum has widened since the emergence of Atiku as the standard bearer of the party.\nThe source listed the crises in PDP state chapters in Edo, Cross River, Ebonyi, Delta and Anambra as allegedly sponsored by Wike.\nPDP NWC members settled for Wike.\nThat leaves the South South and some parts of the South West for the PDP to battle.\nIn fact, almost all members of NWC, beside the chairman, are loyal to the state governors."
  },
  {
    "headline": "I’m very single and ready to mingle –Inem Peter – The Sun Nigeria",
    "summarized_story": "Delectable actress and Instagram sensation, Joy Peter Uboh popularly known as Inem Peter, is tired of waiting for a husband.\nAccording to the lover girl, she’s single and ready to mingle.\nLove is patient and kind; love does not envy or boast; it is not arrogant or rude.\nI love to love.\nRight now, I am very single and ready to mingle.”But what kind of man does Inem Peter want to settle down with?"
  },
  {
    "headline": "Insecurity: Why we petitioned UN, other global bodies –Gani Adams",
    "summarized_story": "Aareonakakanfo of Yoruba land, Iba Gani Abiodun Ige Adams on Thursday sought the urgent intervention of the United Nations and other relevant international organisations on the raging spate of insecurity rampaging virtually all parts of Nigeria, especially the South-West.\nThe Yoruba Generalissimo said the letter was the second in two years, insisting that Nigeria is in precarious situation capable of destroying the entire country.\nAdams noted in the letter: “As you, and hundreds of millions of people globally, are aware, things are no longer normal in Nigeria.\nPitiably, terrorists moving from Northern Nigeria to the South are being embraced, encouraged and empowered by powers that be in Nigeria.\nNow, they are gradually moving down South and the danger is that people in the South are already determined to engage them."
  },
  {
    "headline": "Supreme Court: Muslim students can wear hijab in Lagos schools",
    "summarized_story": "From Godwin Tsa and Fred Ezeh, AbujaThe Supreme Court has ruled that Muslim female students in Lagos State can wear hijab to school.\nIn a split decision of five to two of a seven-member panel, the Supreme Court affirmed the July 21, 2016 judgment of the Court of Appeal, Lagos, which set aside the October 17, 2014 judgment by Justice Grace Onyeabo of the High Court of Lagos State, which upheld the hijab restriction.\nThe Lagos High Court had in October 2014, ruled against the use of hijabs in schools, a judgment that was upturned by an appeal court in July 2016.\nIn a unanimous judgment, the appeal court noted that the ban was discriminatory against Muslim pupils in Lagos State.\nDissatisfied with the appellate court’s judgment, the state government took the case to the Supreme Court."
  },
  {
    "headline": "2023: Mbaka apologises, prays for Peter Obi",
    "summarized_story": "Ejike Mbaka has apologised to the presidential candidate of Labour Party, Mr. Peter Obi and his supporters over his comments on Wednesday.\n“My intention is not to fight or malign Mr. Peter Obi.\n“The followers of Peter Obi are the same youths I am praying for, sacrificing for, fighting for, speaking for, and working for their integral well-being.\nAnd to Peter Obi himself, I ask God to bless him and manifest his will in his life.\nAnd when God says No, who can say Yes?”“I bless Peter Obi and pray for him."
  },
  {
    "headline": "Buhari Mourns Margaret Obaigbena, Mother of Chairman THISDAY/Arise Group",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari has sympathised with the Royal Palace of the Obi of Owa Kingdom in Delta State on the passing of a most treasured daughter, Princess Margaret Obaigbena, nee Usifoh, at the age of 88.\nCommiserating with members of the family, and Prince Nduka Obaigbena, Chairman of THISDAY/Arise Group, President Buhari, in a release issued Friday by his Media Adviser, Femi Adesina, described the late Princess Margaret as a pillar of strength for the family, an accomplished mother and revered community leader, whose absence will be felt far beyond her immediate environment.\nNoting that the death of Princess Margaret Obaigbena will create a great vacuum in the community, the President urged the family to take solace in the understanding that she lived her passion by caring for the distressed and disadvantaged.\nHe also eulogised her steadfast disposition to servicing mankind, beginning early in life and reaching the peak of the nursing profession, channelling her energy and resources to the realisation of lofty convictions.\nThe President prayed that God Almighty grants her soul eternal rest."
  },
  {
    "headline": "PDP Governors, Others Hail as Atiku Names Okowa Running Mate",
    "summarized_story": "In these consultations, I made clear that my running mate would have the potential to succeed me at a moment’s notice, that is, a President-in-waiting.\nThus, my running mate will be a person, who will stand by me as I confront the frightening level of insecurity in our land.\nMy running mate has to be ready to start working with me, from day one, in addressing our country’s challenges.\n“That is why I promised the governors of our party that my running mate will come from among them.\nLet me, therefore, start this momentous journey with a crucial decision about who, among the eminently qualified shortlist, would be my running mate."
  },
  {
    "headline": "It’s Official: Okowa is Atiku’s Running-mate",
    "summarized_story": "Delta State Governor, Dr. Ifeanyi Arthur Okowa, has emerged as the vice presidential candidate of the Peoples Democratic Party.\nThe announcement was made ahead of INEC’s Friday 6pm deadline for the submission of names of vice presidential candidates by political parties.\nBorn in Owa-Alero in Ika North-East Local Government Area of Delta State, Okowa attended the famous Edo College, from where he proceeded to the University of Ibadan where he obtained his degree in Medicine and Surgery.\nOkowa, a founding member of PDP, served at various times as Delta State commissioner for Agriculture and Natural Resources, Water Resources Development, and Health.\nHe was later elected governor of Delta State on the platform of PDP in 2015 and reelected for a second term in 2019."
  },
  {
    "headline": "Tragedy Averted, as Engine of Overland Airways Flight Catches Fire Shortly Before Landing at Lagos Airport",
    "summarized_story": "*Passengers unhurtChinedu EzePassengers on board Overland Airways Flight, OF 1188 from Ilorin to Lagos on Wednesday confirmed that one of the two engines of the aircraft caught fire before it landed at the international runway (R18R) of the Murtala Muhammed Airport (MMIA), Lagos.\nBut no passenger was hurt, as the 33 persons and crew onboard the aircraft disembarked safely on landing.\n“Overland Airways wishes to inform the general public that its flight OF1188 from Ilorin to Lagos experienced an unusual high turbine temperature on one of its engines today, Wednesday June 15, 2022 around 7:50pm.\n“This occurred in the approach phase of flight and the aircraft landed very safely as the Crew skillfully implemented their standard procedures for such abnormal situations.\n“Overland Airways regrets any inconvenience to its passengers and assures the travelling public of its full commitment to safety of its services and passengers,” the statement also said."
  },
  {
    "headline": "To Beat INEC’s Deadline, Tinubu Quietly Submits Forms, Includes ‘Place Holder’ as Running Mate",
    "summarized_story": "At the same time, the leadership of the Peoples Democratic Party (PDP), has constituted a 12-man committee-led by Chief Tom Ikimi, to screen the presidential nominees of the party.\n“The name of the running mate submitted would be changed for another northern politician in the next few weeks.\n“The candidate is still widely consulting, because the issues around the choice of running mate are many and he is yet to address them all.\nSo, he is still asking for more time to look into it all – whether he is running a Muslim-Muslim or a Muslim-Christian ticket.\nThe party said the screening exercise would hold at the National Working Committee (NWC) Hall, PDP National Secretariat, Wadata Plaza, Abuja, today, June 16, 2022. at 10am."
  },
  {
    "headline": "Tinubu Appointed Katsina Governor, Masari’s Younger Brother As Running Mate – APC Chieftain",
    "summarized_story": "The presidential candidate of the All Progressives Congress, Bola Tinubu, submitted the name of Ibrahim Kabir Masari to the Independent National Electoral Commission as the vice-presidential candidate, an APC chieftain has revealed.\nThe APC chieftain, Kabiru Faskari, confirmed this during an interview on Channels Television’s Politics Today.\nEarlier, SaharaReporters reported that the APC Presidential Candidate did not disclose the name of his running mate.\nTinubu on Wednesday said his running mate would be a Christian and would be from the North-East region of the country.\nWhile speaking with journalists on Tuesday at the APC rally in Ekiti State, the APC National leader had said, “The VP slot belongs to the Northeastern region and particularly the Christians, but consultations are yet ongoing as to who will beTinubu Appointed Katsina Governor, Masari’s Younger Brother As Running Mate – APC Chieftain decided.”"
  },
  {
    "headline": "Tinubu Appointed Katsina Governor, Masari’s Younger Brother As Running Mate – APC Chieftain",
    "summarized_story": "The presidential candidate of the All Progressives Congress, Bola Tinubu, submitted the name of Ibrahim Kabir Masari to the Independent National Electoral Commission as the vice-presidential candidate, an APC chieftain has revealed.\nThe APC chieftain, Kabiru Faskari, confirmed this during an interview on Channels Television’s Politics Today.\nEarlier, SaharaReporters reported that the APC Presidential Candidate did not disclose the name of his running mate.\nTinubu on Wednesday said his running mate would be a Christian and would be from the North-East region of the country.\nWhile speaking with journalists on Tuesday at the APC rally in Ekiti State, the APC National leader had said, “The VP slot belongs to the Northeastern region and particularly the Christians, but consultations are yet ongoing as to who will beTinubu Appointed Katsina Governor, Masari’s Younger Brother As Running Mate – APC Chieftain decided.”"
  },
  {
    "headline": "Tinubu Appointed Katsina Governor, Masari’s Younger Brother As Running Mate – APC Chieftain",
    "summarized_story": "The presidential candidate of the All Progressives Congress, Bola Tinubu, submitted the name of Ibrahim Kabir Masari to the Independent National Electoral Commission as the vice-presidential candidate, an APC chieftain has revealed.\nThe APC chieftain, Kabiru Faskari, confirmed this during an interview on Channels Television’s Politics Today.\nEarlier, SaharaReporters reported that the APC Presidential Candidate did not disclose the name of his running mate.\nTinubu on Wednesday said his running mate would be a Christian and would be from the North-East region of the country.\nWhile speaking with journalists on Tuesday at the APC rally in Ekiti State, the APC National leader had said, “The VP slot belongs to the Northeastern region and particularly the Christians, but consultations are yet ongoing as to who will beTinubu Appointed Katsina Governor, Masari’s Younger Brother As Running Mate – APC Chieftain decided.”"
  },
  {
    "headline": "I’m Standing In As Peter Obi’s Running Mate In Labour Party – Doyin Okupe",
    "summarized_story": "Dr Doyin Okupe, the former Special Assistant on Media and Publicity to former President Olusegun Obasanjo, on Friday, said he is the running mate of the Labour Party’s presidential candidate, Peter Obi.\nOkupe said, “I’m standing in as the vice-presidential candidate of the party.\nLabour party has submitted my name as the VP of the party.\nThe choosing of VP candidate is an electoral process which does not stop until the process ends.\nWe believe that the Labour Party coming to rule Nigeria is essentially going to be about young Nigerians."
  },
  {
    "headline": "I’m Standing In As Peter Obi’s Running Mate In Labour Party – Doyin Okupe",
    "summarized_story": "Dr Doyin Okupe, the former Special Assistant on Media and Publicity to former President Olusegun Obasanjo, on Friday, said he is the running mate of the Labour Party’s presidential candidate, Peter Obi.\nOkupe said, “I’m standing in as the vice-presidential candidate of the party.\nLabour party has submitted my name as the VP of the party.\nThe choosing of VP candidate is an electoral process which does not stop until the process ends.\nWe believe that the Labour Party coming to rule Nigeria is essentially going to be about young Nigerians."
  },
  {
    "headline": "Kabir Masari is Tinubu's running mate, says APC chieftain",
    "summarized_story": "Kabiru Faskari, a chieftain of the All Progressives Congress (APC) says Kabir Masari is the running mate to Bola Tinubu, presidential candidate of the party, for the 2023 elections.\nMasari was the party’s welfare secretary when Adams Oshiomhole, former Edo governor, was national chairman of the party.\nHe was the welfare secretary of the APC under Oshiomhole.\nHis name has been submitted,” the APC chieftain said.\nHe represents the youths and grounded in politics because he was even a national official of the APC and he is quite close with the presidential candidate."
  },
  {
    "headline": "Kabir Masari is Tinubu's running mate, says APC chieftain",
    "summarized_story": "Kabiru Faskari, a chieftain of the All Progressives Congress (APC) says Kabir Masari is the running mate to Bola Tinubu, presidential candidate of the party, for the 2023 elections.\nMasari was the party’s welfare secretary when Adams Oshiomhole, former Edo governor, was national chairman of the party.\nHe was the welfare secretary of the APC under Oshiomhole.\nHis name has been submitted,” the APC chieftain said.\nHe represents the youths and grounded in politics because he was even a national official of the APC and he is quite close with the presidential candidate."
  },
  {
    "headline": "Doyin Okupe named Obi's running mate",
    "summarized_story": "Doyin Okupe, a former senior special assistant on public affairs to ex-president Goodluck Jonathan, says his name has been submitted as the vice-presidential candidate of the Labour Party.\nOkupe confirmed the development to TheCable on Friday.\nSpeaking further in an interview with Channels Television on Friday night, the former presidential aide said he will be “standing in” as the running mate to Peter Obi, vice-presidential candidate of the party.\n“Naturally, we comply with the electoral body and in doing so, we believe that choosing the vice-presidential candidate is part of the electoral process.\nAnd you will understand that Mr. Peter Obi came into the Labour Party on the 29th of May, which is exactly three weeks ago,” he said."
  },
  {
    "headline": "Doyin Okupe named Obi's running mate",
    "summarized_story": "Doyin Okupe, a former senior special assistant on public affairs to ex-president Goodluck Jonathan, says his name has been submitted as the vice-presidential candidate of the Labour Party.\nOkupe confirmed the development to TheCable on Friday.\nSpeaking further in an interview with Channels Television on Friday night, the former presidential aide said he will be “standing in” as the running mate to Peter Obi, vice-presidential candidate of the party.\n“Naturally, we comply with the electoral body and in doing so, we believe that choosing the vice-presidential candidate is part of the electoral process.\nAnd you will understand that Mr. Peter Obi came into the Labour Party on the 29th of May, which is exactly three weeks ago,” he said."
  },
  {
    "headline": "'Forgive me' -- Mbaka apologises for calling Peter Obi 'stingy man'",
    "summarized_story": "Ejike Mbaka, spiritual director of Adoration Ministries, Enugu, Nigeria (AMEN), has apologised over the remarks he made about Peter Obi, presidential candidate of the Labour Party (LP).\nAdvertisement“In this vein, I give my blessings to the supporters of His Excellency Peter Obi.\n“The followers of Peter Obi are the same youths I am praying for, sacrificing for, fighting for, speaking for and working for their integral well-being.\nIt is for this reason that I yearn for good governance and worthy leaders that will take care of them.\n“I am not in any political party but I support good people and good governance."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Abena, a voice assistant wants to preserve African languages",
    "summarized_story": "But these voice technologies support only Western languages and are unavailable in African languages because of the low-revenue opportunities in African markets.\n“Working on voice tech for African languages has been a completely different ball game.\nHe spent 6 years building Abena AI, and released it in the Google Play Store this April as a Mobobi product.\nAbena AI works with smart lights, smart plugs, and other smart home devices.\n“The feedback from a few people who tried Abena AI out before it was released kept us going."
  },
  {
    "headline": "Meet 11 female founders making strides in Africa",
    "summarized_story": "This article aims to recognize some African female founders making great strides across various industries and sectors on the continent.\nMeet 11 African female founders we are rooting:Sethebe Manake – Botswana 🇧🇼Image source: Sethebe ManakeMy name is Sethebe Manake (she/her) and I am a real-estate expert turned tech entrepreneur who enjoys dancing and game nights.\nLinkedIn: Neema IyerTao Laine Boyle – South Africa 🇿🇦Image source: Tao BoyleMy name is Tao Boyle (she/her).\nThato Schermer – South Africa 🇿🇦Image source: Thato SchermerMy Name is Thato Schermer (she/her) and I’m the Founder of Zoie Health Technologies.\nI graduated from the University of Cape Town (South Africa) and the University of California (Los Angeles) with a triple major in computer science, genetics, and biochemistry."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Fire Wreaks Havoc In Ekpoma, Destroys Goods Worth Millions Of Naira – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEKPOMA – Goods worth millions of naira were yesterday destroyed by ‘strange’ fire on Akere Lane, Alli Square in the university town of Ekpoma, Esan West Local Government Area of Edo State.\nOver 10 stores affected by the inferno, include electronic shops, interior decoration shop, cyber café, Photo Studio, generator sales and repair shop, building materials stores, among others.\nIt was gathered that one of the shops destroyed by the inferno was a photo Studio, with state of the art equipments, commissioned less than week before the incident.\nThe NIGERIAN OBSERVER gathered that the fire began from an electronic sales shop, at about10pm on Thursday, before spreading to other affected shops.\nAs at the time of this report there were still billows of smoke from the affected shops, while sympathizers gathered at the scene to catch a glimpse of the damages."
  },
  {
    "headline": "Ease of doing business: Edo trains 50 persons on Alternative Dispute Resolution – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Poised to improve the business operating environment in the state and provide an alternative to litigation through the Multi-Door Court House, the Edo State Government has commenced another training of 50 persons in Alternative Dispute Resolution (ADR).\nThe training is sponsored by the German Agency for International Development in the Pro-poor Growth and Promotion of Employment in Nigeria (GIZ-SEDEN) in collaboration with the Edo State Judiciary.\nDeclaring the training open, the Chief Judge of Edo State and Chairman Governing Council of the Edo State Multi-Door Court House, Hon.\nAcha, who was represented by the Acting Director of the Edo State Multi-Door Court House, Mrs. E.O.\nFacilitators at the training include the Coordinator of GIZ-SEDIN in Edo State, Ms."
  },
  {
    "headline": "Law Week Ends With Call For Financial Autonomy, ICT Use – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Nigerian Judiciary has been told to leverage on its use of information communication technology (ICT) to help it fast track on filing and documentation processes even as it continues the fight for financial autonomy.\nPeter Efosa Osakue hailed the Judiciary and its use of soft copies during the filing process which he noted was a new innovation.\nHe nonetheless called lawyers to be computer literate to cut down on turning in blank documents CD’s to judges.\nGoing further, he called on the executives arm of government to grant financial autonomy to the judiciary to make it independent.\nNBA Chairman, Pius Oiwor while speaking on irregularities bedeviling the judiciary touched on the issue of financial autonomy, which he said was guaranteed by the constitution."
  },
  {
    "headline": "Edo tax credit scheme: Obaseki inspects ongoing construction of 3.6km road, agric projects, others in Ologbo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Friday, inspected the ongoing construction of a 3.6km road and an integrated agricultural project in Ologbo, Ikpoba-Okha Local Government Area of the state.\nThe projects are being financed via tax credit granted to SaroAfrica Group of Companies, as part of efforts by the government to fast-track development across the state.\nThe federal government does tax credit for big, large corporate organizations but here, we, as a state, have been able to attract an investor and used his tax credit to enhance infrastructural development in the state.\nChief Executive Officer of Saro Group of Companies, Mr. Rasheed Sarumi said the integrated agricultural project is a joint venture between Saroafrica and Mohinani Group under the Green Hills Agric Projects.\n“This is an integrated agricultural project."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Obi submits Okupe’s name as running mate to INEC",
    "summarized_story": "A former senior special assistant on public affairs to ex-president Goodluck Jonathan, Doyin Okupe, has been selected as the vice-presidential candidate of the Labour Party (LP).\nOkupe confirmed the development on Friday.\nAccording to the former presidential spokesperson, he will be standing in as the VP candidate in order to meet up with the June 17 deadline issued by the Independent National Electoral Commission (INEC) for parties to submit the list of their candidates for the 2023 general polls.\nDetails later…."
  },
  {
    "headline": "I’ve submitted name of my running mate to INEC – Tinubu",
    "summarized_story": "Bola Tinubu, presidential candidate of the ruling All Progressives Congress (APC), says he has submitted the name of his running mate to the Independent National Electoral Commission (INEC).\nHe didn’t, however, disclose the name of his running mate, but said he had submitted “duly completed nomination forms to INEC”.\nThe forms are incomplete without the name of the running mate of a presidential candidate.\nTinubu had reportedly picked Alhaji Kabir Ibrahim Masari, a Katsina politician, as a placeholder for his running mate so as to meet up with INEC deadline.\n“We wish to reiterate that HE Asíwájú Tinubu stands ready to contest the February 25, 2023 presidential election to deliver progressive good governance to our people"
  },
  {
    "headline": "Lawan survives Machina’s scare, named APC candidate for Yobe North",
    "summarized_story": "Senate President Ahmad Lawan’s name has been submitted to the Independent National Electoral Commission (INEC) by the All Progressives Congress (APC) as the party’s candidate for the Yobe North Senatorial District National Assembly elections.\nIt would be recalled that Bashir Machina, who won the APC primary for the senatorial, had on Wednesday insisted that he would not step down for Lawan.\nThe senate president had contested the APC presidential ticket and hours before the primary commenced, he was announced by Abdullahi Adamu, the APC national chairman, as the consensus candidate of the party.\nTimetables were set, guidelines were produced by the parties, and eventually elections were held,” Machina had said.\nHowever, based on the signed list of candidates sent to INEC seen on Friday, Lawan is listed as the party’s candidate for Yobe North."
  },
  {
    "headline": "Osun 2022: Iwo federal constituency monarchs back Oyetola",
    "summarized_story": "This is just as they reassured him of their commitments to ensure his return for second term.\nThe monarchs said the re-election of Oyetola remains their collective project and is non-negotiable, hence the need to vote massively to ensure his re-election.\nSpeaking in his palace, Oluwo of Iwo Oba Abdul-Rasheed Adewale Akanbi, said the performance of the governor within the three and a half years was enough reason to get him re-elected.\nI want to appeal to other traditional rulers in Iwo Federal Constituency to continue to remain resolute and support the progressive government.\nHe said: “I see your visit as a formality because you have done excellently well to earn second term."
  },
  {
    "headline": "NGX, CIS, NGCL to host stakeholders to drive sustainable initiatives across ETDs market",
    "summarized_story": "Nigerian Exchange Limited (NGX) in collaboration with the Chartered Institute of Stockbrokers (CIS) and NG Clearing (NGCL) is set to host a webinar to deepen the knowledge of the investing public on the recently launched NGX Derivatives Market.\nThis event builds on the Exchange’s market leading initiatives to drive the derivatives market in Nigeria following the launch of the NGX Exchange Traded Derivatives (ETD) Market which was accompanied by the listing of two Equity Index Futures Contracts, NGX 30 Index Futures and NGX Pension Index Futures.\nTo promote clearing efficiency, stability, and confidence, The NGX ETD market was launched in collaboration with the premier Central Counterparty (CCP) in Nigeria, NG Clearing Limited, to provide the clearing infrastructure for NGX Derivatives Market and its clearing members.\nThe webinar will focus on the intricacies of derivatives futures contracts, including how the contract is traded and settled on a day-to-day basis, the margining process, and risk management issues.\nSpeaking on the webinar event, Mr. Jude Chiemeka, Divisional Head, Capital Market, NGX explained that the webinar will serve as a platform to further sensitize market participants on The Exchange’s effort and commitment to developing a thriving derivatives market in Nigeria."
  },
  {
    "headline": "Yobe North: Machina Threatens Legal Action Over Substitution Of Name With Lawan",
    "summarized_story": "Senatorial candidate of the All Progressives Congres (APC) for Yobe North senatorial district of Yobe State, Hon.\nADVERTISEMENTLEADERSHIP reports that Machina contested the Yobe North primary election on the platform of APC was duly returned elected in an exercise monitored by INEC and security agencies.\nBut Lawan, who contested the presidential primary of the party and lost to Asiwaju Bola Ahmed Tinubu did not participate in the party’s senatorial primary in Yobe North senatorial district.\nBut APC had written INEC, informing the electoral body that the Senate president will be its nominee for the Yobe North senatorial seat, which Lawan currently represents.\nFor the avoidance of doubt, I remain the candidate duly elected of the APC Yobe North zone C senatorial zone."
  },
  {
    "headline": "Yobe North: Machina Threatens Legal Action Over Substitution Of Name With Lawan",
    "summarized_story": "Senatorial candidate of the All Progressives Congres (APC) for Yobe North senatorial district of Yobe State, Hon.\nADVERTISEMENTLEADERSHIP reports that Machina contested the Yobe North primary election on the platform of APC was duly returned elected in an exercise monitored by INEC and security agencies.\nBut Lawan, who contested the presidential primary of the party and lost to Asiwaju Bola Ahmed Tinubu did not participate in the party’s senatorial primary in Yobe North senatorial district.\nBut APC had written INEC, informing the electoral body that the Senate president will be its nominee for the Yobe North senatorial seat, which Lawan currently represents.\nFor the avoidance of doubt, I remain the candidate duly elected of the APC Yobe North zone C senatorial zone."
  },
  {
    "headline": "I’m A ‘Place Holder’ For Labour Party Vice Presidential Candidate – Okupe",
    "summarized_story": "Former presidential spokesperson, Dr. Doyin Okupe, on Friday, said he is ‘standing in’ as vice presidential candidate of the Labour Party (LP).\nADVERTISEMENTBy implication, Okupe might be replaced with a final VP candidate, who will run alongside the presidential candidate of the party, Peter Obi, in the 2023 presidential election.\nThe development might not be unconnected with the move to beat INEC’s deadline for the submission of the name of a vice presidential candidate, which ends this Friday.\n“Choosing the vice presidential candidate is an electoral process and it does not stop until the process and schedule ends.\n“So the present situation is that we believe that this Labour party government that is essentially going to be about young Nigerians."
  },
  {
    "headline": "I’m A ‘Place Holder’ For Labour Party Vice Presidential Candidate – Okupe",
    "summarized_story": "Former presidential spokesperson, Dr. Doyin Okupe, on Friday, said he is ‘standing in’ as vice presidential candidate of the Labour Party (LP).\nADVERTISEMENTBy implication, Okupe might be replaced with a final VP candidate, who will run alongside the presidential candidate of the party, Peter Obi, in the 2023 presidential election.\nThe development might not be unconnected with the move to beat INEC’s deadline for the submission of the name of a vice presidential candidate, which ends this Friday.\n“Choosing the vice presidential candidate is an electoral process and it does not stop until the process and schedule ends.\n“So the present situation is that we believe that this Labour party government that is essentially going to be about young Nigerians."
  },
  {
    "headline": "Mbaka Apologises To Peter Obi, Supporters Over ‘Stingy’ Comment",
    "summarized_story": "Ejike Mbaka, has apologised to the Labour Party (LP) presidential candidate, Mr. Peter Obi, and his supporters over his Thursday’s outburst against the former Anambra State governor.\n“In any way, the supporters of Mr. Peter Obi feel offended by my utterances or however I was misunderstood by them, I ask for their understanding and forgiveness.\n“My intention is not to fight or malign Mr. Peter Obi.\n“The followers of Peter Obi are the same youths I am praying for, sacrificing for, fighting for, speaking for, and working for their integral well-being.\n“I bless Peter Obi and pray for him."
  },
  {
    "headline": "Vice Presidential Candidate: Tinubu Has Named Kabiru Masari As Running Mate – Faskari",
    "summarized_story": "The All Progressives Congress (APC) presidential candidate Bola Tinubu has named Kabiru Masari as his running mate for the 2023 elections.\nA chieftain of the party Kabiru Faskari said this during an interview on Channels Television’s Politics Today.\n“Ibrahim Kabiru Masari is our vice presidential nominee.\nHe is quite close to the presidential candidate and has been with him for a very long time,” he explained.\n“I think what it is is that it was the decision of the presidential candidate after due diligence,” the APC chieftain added."
  },
  {
    "headline": "BREAKING: 2023: Tinubu submits name of running mate to beat INEC deadline",
    "summarized_story": "BREAKING: 2023: Tinubu submits name of running mate to beat INEC deadlineThe presidential candidate of the All Progressives Congress (APC), Asiwaju Bola Tinubu, has submitted the name of his running mate to the Independent National Electoral Commission (INEC).\nThis was confirmed by Bashir Ahmaad, a former media aide to President Muhammadu Buhari, via his verified Twitter handle.\nAhmaad, however, did not disclose the identity of Tinubu’s running mate.\nHe simply wrote: “Our presidential candidate, Asiwaju Bola Tinubu has submitted the name of his running mate to INEC, his media office has confirmed.”The Independent National Electoral Commission (INEC) had fixed Friday, June 17, as deadline for parties to send in names of their vice-presidential candidates."
  },
  {
    "headline": "BREAKING: I’m vice presidential candidate of Labour Party – Doyin Okupe",
    "summarized_story": "The Special Assistant on Media and Publicity to former President Olusegun Obasanjo, Dr Doyin okupe has said that he is the vice presidential candidate of Labour Party, LP.\n“I stand in as the vice presidential candidate of the party.\n“Labour party has submitted my name as the VP of the party”, he said.\nRecall that Friday June 17 is the deadline for the submission of names of vice presidential candidate of all political party involved in the general elections.\nHowever, Okupe with his statement would be the running mate of the Presidential candidate of Labour Party, LP and Former Governor of Anambra state, Mr Peter Obi."
  },
  {
    "headline": "Breaking: IPMAN orders closure of filling stations in Oyo",
    "summarized_story": "Following the resurgence of fuel scarcity in Oyo State, the leadership of the Independent Petroleum Marketers Association of Nigeria (IPMAN), in the state, has on Friday ordered a total closure of all filling stations across the state until further notice over alleged harassment and intimidation by officers of the IGP Monitoring Squad.\nSpeaking with journalists at the IPMAN Headquarters in Ibadan, Chairman of the association, Alhaji Bukola Mutiu, linked the ongoing fuel scarcity across the state to high cost of diesel as well as inability of the state based petroleum marketers to load fuel directly from Ibadan depot.\nMutiu noted that the leadership of the association has been managing the crises for a very long time before the matter became unbearable due to hike in the price of diesel as well as the Premium Motor Spirit (PMS) otherwise known as Petrol.\nAs of the time of filing this report, most of the filling stations visited were shut, while motorists were sighted waiting with in vehicles on queues with the hope of getting the PMS.\nSome of the motorists who spoke with Sunday Vanguard within Ibadan metropolis revealed their sufferings and however pleaded with the government at all levels to find a lasting solution to the issue before it is too late."
  },
  {
    "headline": "Breaking: Tinubu, Obi get running mates for 2023 presidential election, beat INEC deadline",
    "summarized_story": "The Presidential Candidate of the All Progressive Congress (APC), Bola Ahmed Tinubu, has picked and submitted the name of Katsina State born Kabir Ibrahim Masari as his running mateMasari who is a member of the Board of Trustees (BOT) of the party was named as running mate to beat the deadline set by the Independent National Electoral Commission (INEC) scheduled for Friday June 17, 2022.\nTinubu, had despite initial hurdles, on Wednesday, June 8, clinched the presidential ticket of the All Progressives Congress (APC) for the 2023 presidential election.\n23 aspirants picked forms for the contest, while 22 participated.\nOne of the aspirants, Emeka Nwajiuba, did not participate.\nAlso, Labour Party with former Anambra state governor Peter Obi as presidential candidate, on Friday submitted the name Doyin Okupe, former presidential spokesman and former presidential aspirant on the platform of the Peoples Democratic Party (PDP), as the running mate for next year’s presidential election."
  },
  {
    "headline": "Tight security, uncertainty as Ekiti goes to poll",
    "summarized_story": "“This governorship election is the first election to be conducted following the enactment of a new electoral law.\nThus, expectations are high, especially with regards to early deployment of poll officials and materials, logistics, election security and inclusivity, amongst others.\nAccordingly, the Situation Room, therefore, outlines its expectations for Ekiti state governorship,” Ugochukwu said.\n“Given that Ekiti state does not have any difficult terrain, Situation Room 3 expects an early deployment of materials and officials on election day.\n“These assurances are particularly uplifting following the noticeable shortcomings of the devices during the Anambra state governorship election and recently conducted FCT area councils’ elections."
  },
  {
    "headline": "Breaking: Amidst public backlash, Mbaka bows, tenders apology to Peter Obi, supporters",
    "summarized_story": "“I am a servant of God and my intention is not to malign His Excellency, Peter Obi’s image, but to pray for him.\nIn this vein, I give my blessings to the supporters of His Excellency Peter Obi.\nMay God bless him and his good supporters.\nAnd to Peter Obi himself, I ask God to bless him and manifest his will in his life.\nI bless Peter Obi and pray for him."
  },
  {
    "headline": "ACCI Appoints Former NNPC, DPR Executive, Chairperson Women-in-Business Trade Group",
    "summarized_story": "Abuja Chamber of Commerce and Industry (ACCI) has appointed former Nigerian National Petroleum Corporation (NNPC) and the Department of Petroleum Resources (DPR) Executive, Mrs Chioma Nonyerem Njoku, as the Chairperson of the Women-in-Business Trade Group of the Chamber.\nIn a letter signed by the Director General ACCI, Victoria Akai on Tuesday, the DG stated that the Trade Group is one of the working organs of the Chamber and its roles include promoting activities of Women in Business by providing necessary support, activities and opportunities for members in the Trade Group to succeed in their ventures.\nMrs Njoku, an oil industry expert who would bring to bear over 40 years of experience of working in the oil sector to the Women – in – Business Trade Group, before this appointment has held several positions at the NNPC and DPR, including as Acting Director of Petroleum Resources.\nShe had served as the Senior Special Assistant/Adviser on Petroleum, to the Imo State Governor and as the Secretary of the Bureau of Oil and Gas Matters.\nFurthermore, she attended various Executive Management Courses including the prestigious Harvard Business School program for Leadership and General Management."
  },
  {
    "headline": "NIHOTOUR to unveil mobile training kitchens",
    "summarized_story": "… As key players gear up for 2022 Sustainable Gastronomy Day CelebrationBy Palma IleyeNational Institute for Hospitality and Tourism, NIHOTOUR, has stated that it was set to unveil mobile training kitchens at the 2022 World Sustainable Gastronomy Day Celebration which is expected to attract high level attendance by critical stakeholders of the industry at the event which opens on Saturday, 18th June 2022 at the International Conference Centre, Abuja.\nDisclosing this to newsmen at the headquarters of the Institute in Abuja, Director General and Chief Executive Officer of NIHOTOUR, Nura Sani Kangiwa, said the institute has acquired the mobile kitchens in order to up its skill acquisition and training outreach programs to Nigerian youths in the nooks and crannies of the country.\nKangiwa noted that the Sustainable Gastronomy Day celebration for this year recognizes the practices and principles associated with sustainable food consumption combined with the art of collecting, preparing and consuming the food we eat, stating further that the observances of the day acknowledges the social, cultural and artistic expression related to gastronomy that defines the three dimensions of sustainable development which are; people, planet and profit (benefits).\nHe noted that gastronomy was a cultural expression of nations through their food choices, sources of ingredients and types of cuisines which thrives in culturally rich destinations and Nigeria being one of the most competitive Gastronomy tourist destination in Africa because of its corresponding unique foods culture and enticing cuisines of international repute.\nThe NIHOTUR boss also noted that the occasion will also feature the presentation of a paper to mark the observance Day to be delivered by Olufemi Falebita titled ‘Marketing Nigerian Foods Abroad’The United Nations General Assembly proclaimed World Sustainable Gastronomy Day in December, 2016 and first celebrated it in 2017."
  },
  {
    "headline": "PenCom says only five states, Kaduna, Lagos, Delta 2 others pay pensions",
    "summarized_story": "It has been reported that only five states are paying pensions under the Contributory Pension Scheme as more workers retired by the end of the first quarter of 2022, findings have revealed.\nPenCom listed the states that were funding the accrued rights of the retirees and paying pensions under the CPS to be Lagos, FCT, Osun, Kaduna and Delta.\nData obtained from PenCom on ‘Status of implementation of the CPS by states’ showed that 25 states had enacted laws on the CPS and that out of them, 15 had pension bureaux and boards in line with the CPS.\nThe data revealed that the 25 states are Lagos, FCT, Osun, Kaduna, Delta, Ekiti, Ondo, Edo, Benue, Kebbi, Niger, Rivers, Ogun, Bayelsa, Kogi, Anambra, Abia, Taraba, Imo, Sokoto, Adamawa, Ebonyi, Nasarawa, Enugu and Oyo.\nPenCom data showed that states with other pension schemes were Jigawa, Kano, Gombe and Zanfara."
  },
  {
    "headline": "Adegbite woos investors with huge gold, lead-zinc, iron-ore deposits",
    "summarized_story": "By Palma IleyeIn continued efforts to grow the economy through the mining sector, the Minister of Mines and Steel Development, Arc Olamilekan Adegbite, Thursday, has wooed investors abroad with huge gold, lead-zinc, iron-ore and barite deposits in Nigeria.\n“Target minerals under the first phase include Gold, Lead-Zinc, Iron Ore, and the Battery Minerals, among others.\n“These include Thor Exploration Limited’s Segilola Gold Mine Project, in Osun State, which has an initial production capacity of 80,000 ounces of gold annually, representing the first large-scale Gold Mine in Nigeria.In June last year, we commissioned the Dukia Gold & Precious Metals Refinery, DGPMR, Project.\nIts potential impact on the gold sector is nothing short of revolutionary.\n“From the revenue drive perspective, the Nigerian Mining Sector has demonstrated a marked improvement despite the challenges of the pandemic."
  },
  {
    "headline": "Safety Engineers call for establishment of Safety Commission",
    "summarized_story": "Emeka Samuel,UYOThe National Chairman of the Nigerian Institution of Safety Engineers (NISafetyE), Engr.\nAkaninyene Ekong has called on the States’ Houses of Assembly to enact a law for the establishment of Safety Commissions across all states in Nigeria.\nEkong made this call yesterday during the 2022 Annual Public Lecture on “Advancing Safety Engineering for Sustainable Development” organized for the Investiture of Engr.\nThe chairman tasked Safety practitioners and professional bodies to woo and lobby the political class in order to engender a robust and better safety culture in Nigeria through legislation in line wiith ILO guidelines.\nThe chairman called for synergy with the practitioners and developers in the building and environment industry, the political class and particularly, the legislators for the rebirth of a serene safety culture in Nigeria through the use of qualified Engineers in projects and the establishment of a safety regulatory agency, otherwise known as Safety Commission."
  },
  {
    "headline": "Vice Presidential Candidate: Tinubu Has Named Kabiru Masari As Running Mate – Faskari",
    "summarized_story": "The All Progressives Congress (APC) presidential candidate Bola Tinubu has named Kabiru Masari as his running mate for the 2023 elections.\nA chieftain of the party Kabiru Faskari said this during an interview on Channels Television’s Politics Today.\n“Ibrahim Kabiru Masari is our vice presidential nominee.\nHe is quite close to the presidential candidate and has been with him for a very long time,” he explained.\n“I think what it is is that it was the decision of the presidential candidate after due diligence,” the APC chieftain added."
  },
  {
    "headline": "I Am ‘Standing In’ As Vice Presidential Candidate Of Labour Party – Doyin Okupe",
    "summarized_story": "Former presidential spokesperson Dr Doyin Okupe on Friday said he is ‘standing in’ as vice presidential candidate of the Labour party.\nHowever, Dr Okupe might be a placeholder to beat INEC’s deadline for the submission of the name of a vice presidential candidate.\n“INEC allows you to present a candidate and later on, if you want to substitute, you may do so, if necessary.\n“So the present situation is that we believe that this Labour party government that is essentially going to be about young Nigerians.\n“I am willing to put down my back, so that young people can stand and come to the top.”"
  },
  {
    "headline": "2023: Clark, Adebanjo, Others Blast ‘Traitor’ Okowa For Accepting VP Nomination",
    "summarized_story": "Presidential candidate of the Peoples Democratic Party (PDP), Atiku Abubakar, on Thursday had announced Okowa as his running mate.\nAnd this very Governor Okowa was the host of that historic meeting.\nIt is, therefore, most unfortunate that the Governor of Delta State, Senator Ifeanyi Okowa who should know better, accepted his appointment as running mate to Alhaji Atiku Abubakar.\nSadly, it is also now common knowledge that he spent resources belonging to the government and people of Delta state, to lobby for the position, extensively.\nGovernor Okowa has, by his action, betrayed the trust reposed on him by his colleagues; the southern governors, the entire good people of southern Nigeria and all well-meaning Nigerians."
  },
  {
    "headline": "Catholic Church Holds Funeral Mass For Members Killed In Owo",
    "summarized_story": "It’s a solemn day in Owo, Ondo State as the victims of the deadly attack on St. Francis Catholic Church are laid to rest in the town.\nThis followed a funeral mass held on Friday in honour of the victims whose remains had been deposited at the morgue of the Saint Louis Catholic Hospital in Owo.\nAfter the funeral mass is completed at the Mydas Event Centre in Owo, families of the victims will take the remains of their loved ones for burial in the town.\nOndo State Governor, Oluwarotimi Akeredolu, and a former governor of the state, Olusegun Mimiko, were among the dignitaries present at the mass.\nSome clergymen, including Bishop Jude Arogundade of Ondo Catholic Diocese and Bishop Matthew Kukah of the Catholic Diocese of Sokoto, were also in attendance."
  },
  {
    "headline": "Police Arrest Two Kidnappers, Release Victim In Benue",
    "summarized_story": "Police in Benue State have apprehended two suspected kidnappers and rescued an abducted from the abductors’ den.\nSpokesperson to the Benue command, SP Anene Sewuese, disclosed this in a brief report on Friday.\nConsequently, two of the suspects named Abdulahi Mohammed and Yusuf Saidu were arrested while the other suspects escaped with gunshot injuries.\nFollowing the arrest, ten rounds of AK47 ammunition were recovered from the kidnapers’ dungeon.\nSP Sewuese said investigations are still ongoing, adding that the force will not rest on its oars till the suspects at large are apprehended."
  },
  {
    "headline": "2023: Shaibu hails Okowa as Atiku's running mate",
    "summarized_story": "Deputy Governor of Edo State, Philip Shaibu has hailed Governor Ifeanyi Okowa over his emergence as the running mate of the People’s Democratic Party, (PDP) presidential candidate, Atiku Abubakar.\nAs a Governor, Okowa has positioned himself as a moral compass for government.\nShaibu in his congratulatory message, described Governor Okowa as a goal-getter and achiever who is driven by faithfulness to God and patriotism to humanity.\nHe will surely engage his astute brilliance and dogged determination in adding value to the efforts of rescuing the nation.\nThe deputy Governor, Philip Shaibu appealed to Nigerians not to write off the country but be patient and support Atiku and Okowa in rewriting our story and in putting Nigeria in a proper perspective."
  },
  {
    "headline": "APC Presidential candidate, Tinubu meets Governor Uzodinma -",
    "summarized_story": "Presidential candidate of the All Progressive Congress, Asiwaju Bola Tinubu said his visit to the Governor of Imo State, Hope Uzodinma is to discuss plans for the party’s presidential campaign ahead of the 2023 Elections.\nAsiwaju Tinubu who has been mending fences with other presidential aspirants and meeting with some leaders of the party to seek their support, believes the party needs to be united to secure victory at the polls.\nHe admits that the closed door meeting with Governor Uzodinma is inline with plans to ensure that all hands are on deck for APC to retain power at the federal.\nThe Imo State Governor expressed optimism that Asiwaju Tinubu will win the presidential election."
  },
  {
    "headline": "Flawed Leadership to blame for abandoned Constituency Projects -",
    "summarized_story": "Some National Assembly members say Nigeria’s flawed leadership recruitment process is the reason behind the ineffectiveness of the Zonal Intervention Projects otherwise called constituency Projects.\nThey spoke at a National dialogue on Constituency Projects and Election campaigns for Legislative positions.\nIts goal is to set an agenda for eventual winners of the forthcoming parliamentary elections into the 10th National Assembly.\nSince 2004 when the ZIP was conceived, trillions of naira have been earmarked for constituency projects which are barely visible.\nIn 2015 when the Buhari administration came on board, there were over 6000 Constituency projects littered over the lenght and Breadth of Nigeria mostly uncompleted, abandoned or never initiated after payment of mobilisation fees to contractors."
  },
  {
    "headline": "Mixed feelings as INEC releases lists of ad hoc staff for Ekiti poll -",
    "summarized_story": "Mixed reactions have continued to trail the lists of ad hoc staff released by the Independent National Electoral Commission for the Ekiti governorship election.\nIn Ado Local government, Corps members and volunteers were seen checking the list pasted at different locations at the local government secretariat.\nWhile some were seen with cheerful faces, others who are not so lucky questioned the rationale for excluding their names after attending three-day training for the same purpose.\nResidents of Ekiti will on Saturday (June 18) vote to elect the governor and his deputy for another four years after the expiration of governor Kayode Fayemi’s administration."
  },
  {
    "headline": "Linus Okorie: It Requires Leadership to Guarantee The Future of Nigeria",
    "summarized_story": "Founder & CEO, GOTNI Leadership Centre, Linus Okorie, emphasis on the need for Africa as a continent to place investment in leadership development in Africa, to safeguard the future of Africa."
  },
  {
    "headline": "Peter Obi Is Stingy Says Mbaka, Bianca Disagrees – Trending With Ojy Okpe",
    "summarized_story": "The Spiritual Director of the Adoration Ministry in Enugu State Rev.\nFather Ejike Mbaka made headlines on Thursday after stating during a sermon that the Labour Party presidential candidate Peter Obi will not win the 2023 presidential election because he lacks the spirit of generosity.\nThe Catholic diocese of Enugu has dissociated itself from the Reverend Father’s comment stating that they are a clear violation of the provisions of the canon law which forbids priests from engaging in partisan politics.\nIn another development, Bianca Ojukwu, a former ambassador and widow of Chukwuemeka Ojukwu, the late Biafra leader reacted to Father Ejike Mbaka’s comment where he referred to Peter Obi As a Stingy Man In a post on her Facebook page on Thursday, stating that Peter Obi’s prudence with his resources is something that Nigeria needs for a more “humane” society.\nThen, a video showing a group of South Eastern Catholic Priests Showing Off their permanent voters cards in readiness for the 2023 general election while advocating for voters registration is making the rounds on social mediaFinally, Afrobeats Musician #Davido in his latest interview with Comedian #TrevorNoah on The Daily Show, spoke about how he raised N200M Naira in 72 hours after sharing his account details on social media for his 29th birthday in 2021."
  },
  {
    "headline": "Placeholder: Labour Party’s Peter Obi Names Campaign DG Doyin Okupe VP Candidate",
    "summarized_story": "Nigeria’s Labour Party has named Doyin Okupe as the Vice Presidential candidate to Peter Obi who is the presidential candidate of the party but in a placeholder capacity to beat the Friday deadline set by the Independent National Electoral Commission.\nA top leader of the Labour Party who confirmed this to ARISE News said the party is still making wide consultations for a suitable vice presidential candidate to Obi but that Okupe’s name was temporarily submitted.\nDr. Doyin Okupe is the current Director General of the Peter Obi Presidential Campaign Council.\nIn the 2023 general elections timetable released by INEC in February, the deadline for the substitution of Presidential or Vice Presidential candidates is July 15th 2022 and some political parties are currently taking advantage of this window including the APC to name placeholder running mates."
  },
  {
    "headline": "President Buhari Condoles with Nduka Obaigbena Over Loss of Mother, Princess Margaret",
    "summarized_story": "President Muhammadu Buhari has conveyed his heartfelt sympathies to the Royal Palace of the Obi of Owa Kingdom in Delta State on the passing of a most treasured daughter, Princess Margaret Obaigbena, nee Usifoh, at the age of 88.\nIn a stateman signed by media aide Femi Adesina, President Buhari ommiserated with members of the family, and Prince Nduka Obaigbena, Chairman of Thisday and described the late Princess Margaret as a pillar of strength for the family, an accomplished mother and revered community leader, whose absence will be felt far beyond her immediate environment.\nPresident Buhari also condoled with the government and people of Edo and Delta States on the loss of the illustrious citizen who contributed immensely to the development of the two states.\nHer role as Special Adviser to three Governors of Delta State will remain indelible in the annals of the State, he said.\nBuhari prayed that God Almighty will grant her soul eternal rest."
  },
  {
    "headline": "Nigeria: VP Candidate Okowa Will Add Electoral Value to PDP, Ohanaeze Says",
    "summarized_story": "The Igbo apex body stated this on Friday in a statement signed by its National Publicity Secretary, Dr Alex Ogbonnia, titled “Ohanaeze Ndigbo congratulates Okowa as vice-presidential candidate”.\nOgbonnia said that Professor George Obiozor led Ohanaeze Ndigbo worldwide is proud of him.\n“The life of Sen. Ifeanyi Okowa is a veritable tribute to humility, sincerity, simplicity, hard work, perseverance and centrality of morals in the dynamics of power.\nAs a governor, Okowa had a clear vision which he pursued with incandescent passion, valour, candour, honour and unassailable accomplishments.\n“The Ohanaeze Ndigbo Worlwide led by Ambassador Professor George Obiozor is very proud of you."
  }
]