[
  {
    "headline": "Nwobodo restates preference for Nkanu East governorship in 2023",
    "summarized_story": "A former Governor of Old Anambra State and elder statesman, Sen Jim Nwobodo has reportedly told the member representing Enugu South/Enugu North Federal Constituency, Ofor Chukwuegbo, that he would not support his governorship ambition.\nChukwuegbo was reported to have led a delegation of his Awkunanaw kinsmen to Nwobodo’s house to seek his blessings and clarify his position on the governorship seat of the state ahead of the 2023 elections.\nThe lawmaker was said to have lobbied the elder statesman to change his position on micro-zoning of the governorship position within the Enugu East Senatorial District.\nAs an elderly man, I gave my blessings to him because I have the right to say no.\n“But I told them clearly that I have not changed my position on Nkanu East and I don’t have the intention to reconsider my position on that."
  },
  {
    "headline": "Stop attacking Emmanuel, gov revealed God’s mind –Commissioner",
    "summarized_story": "THE Akwa Ibom State Commissioner of Information and Strategy, Ini Ememobong, on Tuesday defended Governor Udom Emmanuel’s choice of Pastor Umo Eno as the preferred candidate for the 2023 governorship elections, saying that the governor only acted as a medium of God’s revelation.\nCriticisms from different groups have continued to trail the choice of Eno as the preferred candidate for the 2023 governorship election in Akwa Ibom State.\nHe called on the media to stop vilifying the governor whom he described as humane enough to reveal to the people who God wants to succeed him in office.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "Noise pollution: Lagos bans use of sound amplifiers at motor garages, parks",
    "summarized_story": "By Olasunkanmi AkoniLagos State Government, Tuesday, placed a ban on the use of sound amplifiers, microphone and other formmof sound systems at motor garages and parks across the aimed at curtailing noise pollution as well as ensure noiseless, healthy environment.\nThe Special Adviser to Governor on Transportation, Oluwatoyin Fayinka, announced this yesterday, at a joint-press briefing organised by the Lagos State Ministry of the Environment through the Lagos State Environmental Protection Agency, LASEPA and the Ministry of Transportation, at Alausa, Lagos.\nPermanent Secretary, Ministry of Transportation, Dr. Gaji Tajudeen, said that noise pollution is the most prevalent of the complaints received annually, accounting for 75 per cent of total complaints.\nAccording to him, “noise pollution which is an unwanted sound in excess of the permissible limits has become very prevalent in Lagos environment.\n“Noise pollution is the major leading public complaints received at the Agency, ranging from the transport sector, religious, commercial and entertainment industry, domestic animals, and power generators among others."
  },
  {
    "headline": "Impact of 2023 General Election on Nigerian Capital Market",
    "summarized_story": "READ ALSO:No diversion of funds meant for 2019 Hajj airlift — Medview’s Muneer BankoleThis is why investors should be concerned about the possible impact of the 2023 general election in Nigeria on their portfolios and the capital market.\nConsidering how General Babangida brazenly truncated the most credible election in Nigeria’s history in 1993, the 1999 general election conducted by the military was viewed with skepticism.\nEvidence, therefore, shows that the 1999 general election had a bearish impact on the capital market before inauguration in May 1999.\nTherefore, it can be concluded that election risk had minimal impact on the capital market in 2002 / 2003.\nTherefore, economic factors impacted the capital market more in the 2011 general election."
  },
  {
    "headline": "Queens College commissions Guardiance and Counselling building as PTA donates school bus",
    "summarized_story": "By Funmilayo AjidahunA foremost girls’ college in Lagos, Queens College, Yaba has commissioned the Guidance and Counselling building, on Tuesday, 8th of February 2022.\nThe Director/Principal of Queens College, Dr T F O Yakubu Oyinloye, at the commissioning, stated that the structures are in place to help the students get the best education.\nThe biology laboratory which is now renovated has curbed the rate at which students make mistakes while trying to construct biology tables.\nThe Director/Principal also commissioned the Bus donated to the school by the parent-teacher association (PTA), as a way to ensure the Student transport with ease.\nThe newly renovated technical laboratory, agriculture and biology laboratory were also commissioned which are expected to give the student quality education."
  },
  {
    "headline": "Rescue universities from total collapse, ASUU FUPRE tells FG",
    "summarized_story": "By Ochuko AkuophaUGHELLI – ACADEMIC Staff Union of Universities, ASUU, Federal University of Petroleum Resources, Effurun, FUPRE, Delta State, chapter, has urged the Federal Government to implement the Renegotiated 2009 Agreement with university lecturers and rescue the “nation`s Ivory Towers” from total collapse.\nAgbalagba and Secretary, Dr. Jerry Osokpor on its position on the impending nationwide strike by the union,decried what it described as the continuous ugly neglect of public tertiary institutions by government.\n“It is imperative that the Nigerian public be aware that the deployment of the IPPIS in the University System by the government, is breach and violation of the University Miscellaneous Act.\nIt has become clear that the Government by its policies and poor financial interventions, is poised to abandoning the Education Sector.\n“The Union calls on well-meaning individuals, private, corporate and the civil society to prevail on Government in order to prevent the imminent industrial action by the Academic Staff Union of Universities (ASUU) that may lead to a total collapse of public university in the country.”"
  },
  {
    "headline": "Tambuwal shut down Kebbi as PDP State Exco backs his Presidential ambition",
    "summarized_story": "Idowu BankoleThe Kebbi State chapter of the Peoples Democratic Party, PDP, has endorsed the Presidential Ambition of Sokoto state Governor, Aminu Waziri Tambuwal.\nSpeaking on the purpose of his visit, Governor Tambuwal said he is in Kebbi to consult with the leaders in the state for his Presidential aspiration adding that with the level of reception he received by the entire Kebbi PDP exos and structure, he is convinced that PDP is back in Kebbi state.\nTambuwal was received by the entire Kebbi PDP state exco led by the party chairman, Alhaji Usman Bello Suru as well as former minister of Special Duties Kabiru Tanimu Turaki, General Ishaya Bamayi, General Bello Siyaki.\nIn his remarks, the state PDP chairman, Usman Bello Suru, said the Kebbi state PDP is fully in support of Governor Tambuwal’s ambition.\nTo demonstrate this, he asked all delegates, Kebbi state PDP local government chairmen and state exco to identify themselves."
  },
  {
    "headline": "Rising crime: Fintiri restricts tricycles’ movements in parts of Adamawa",
    "summarized_story": "Governor Ahmadu Fintiri has restricted movement of commercial motorcycles better known as Keke NAPEP in some parts of Adamawa State.\nThe governor in a statement released Tuesday evening, noted that the restriction was meant to curb rising crimes in affected communities.\nThe statement, signed by Humwashi Wonosikou, Press Secretary to the Governor, said the restriction covers some communities in municipal local government areas of Girei and Yola South.\n“Governor Ahmadu Umaru Fintiri of Adamawa State has issued an Executive Order banning the use of motorcycles in Mbamba, Yolde Pate and Ngurore communities of Yola South Local Government Area, as well as Viniklang and Federal Housing Estate in Girei Local Government Area from 5:00pm to 5:00, am henceforth,” the statement said.\n“The Executive Order prescribes a penalty of six months imprisonment with an option of N100,000 fine or both, in addition to forfeiting the motorcycle to the government if found guilty for violation of the order,” the government warned."
  },
  {
    "headline": "Group asks Bauchi govt to compensate victims of Gonto memorial anniversary violence",
    "summarized_story": "A group, Zauren Baba Gonto, from Tafawa Balewa/Bogoro Local Government Areas of Bauchi State, on Tuesday, asked the state government to compensate victims of the December 31, 2021 violence that erupted in the area over the 21st memorial anniversary of Sayawa’s leader, Baba Peter Gonto.\nAccording to him, the violence, which started from Tafawa Balewa on December 29 and continued till December 31, 2021, was avoidable.\n“We wish to condemn in strong terms the ugly and unfortunate violent attack by thugs, arsonists and anarchists that abruptly ended the Baba Peter Gonto 21st memorial and official launching of the Peter Gonto Foundation that happened on the 31st December, 2021 in Bogoro.\nHe informed that the incident led to the death of a son of the legendary Gonto, Baba Aralla Peter Gonto, urging people of the areas to ensure peace reigned as the deceased was yet to be buried.\n“This ugly incident led to the untimely death of Baba Aralla Peter Gonto, who happens to be an illustrious son and liberator of our land, Baba Peter Gonto."
  },
  {
    "headline": "Bauchi: Fear grips Bogoro residents as gunmen abduct woman, baby",
    "summarized_story": "Fear has gripped residents of Bogoro Local Government Area of Bauchi State following Monday night’s abduction of a 40-year-old woman, Hajiya Kadijah Audu Ardo of Tsamiya village in Boi area of the local government.\n“At about 12 hours, villagers reported to our office the abduction of one Kadijah Audu Ardo by heavily armed gunmen.\nAs of now, we are doing everything possible to secure the life of the woman and her baby,” the statement read in part.\nA resident of Tsamiya village in the area, Mr. Joel Tuta, told journalists that people in the area now live in fear following the abduction.\nHe then appealed to the abductors to release his wife and baby, saying that they are both innocent."
  },
  {
    "headline": "Oyo: Makinde moves to rename LAUTECH",
    "summarized_story": "Governor Seyi Makinde of Oyo State has commenced the process of renaming the Ladoke Akintola University of Technology (LAUTECH), Ogbomoso.\nDAILY POST recalls that the university was founded by the old Oyo State Government in the 90s.\nThe university was jointly owned by Oyo and Osun States until 2020, when the university was ceded to the former.\nMakinde has, however, begun moves to rename the institution.\nMakinde said that in his efforts to make the university a conventional university, he has approved a bill entitled 2022 LAUTECH Amendment Bill, to be forwarded to the Oyo State House of Assembly."
  },
  {
    "headline": "NLC warns Nigerian govt over plan to remove labour from Exclusive Legislative List",
    "summarized_story": "The Nigeria Labour Congress, NLC, on Tuesday, warned the Federal Government to desist from its plan to deregulate labour to states by removing it from the Exclusive Legislative List.\nThis was contained in a statement by the President of NLC, Ayuba Wabba.\nHe explained that the nation-states legislation on labour is driven substantially from the International Labour Organisation conventions, protocols and recommendations and other instruments domesticated through the Acts of parliament.\nHe said a corpus of labour legislation across the 36 states and FCT will almost certainly create a judicial nightmare.\n“In the light of this, we will strongly advocate against removing labour from the Exclusive Legislative List."
  },
  {
    "headline": "Fuel scarcity conspiracy to remove subsidy- Wabba",
    "summarized_story": "President of the Nigeria Labour Congress, Ayuba Wabba has alleged that the emergence of queues in filling stations are part of conspiracy theories to force subsidy down the throat of Nigerians.\nThe NLC had directed its affiliates to mobilise for nationwide protests following the proposed plan by the Federal Government to remove fuel subsidy.\nHowever, following the decision of the government to drop the subsidy removal plans, the NLC rescind its decisions on January 25, 2022.\nWe have seen that queues are surfacing which means that there is a conspiracy theory to force the policy of removal of fuel subsidy down the throat of Nigerians.\nAccording to him, labour, including trade unions, industrial relations; conditions, safety and welfare of labour; industrial disputes; prescribing a national minimum wage for the federation or any part thereof; and industrial arbitration."
  },
  {
    "headline": "One dead, soldier shot as Gombe community boils again",
    "summarized_story": "At least one person has been reported dead in a fresh outbreak of violence in the sleepy community of Nyuwar in Balanga Local Government area of Gombe State on Tuesday.\nNyuwar is about two hours drive from Gombe the capital of Gombe State.\nSeveral houses were said to have been torched while women, children and the aged were forced to escape to neighbouring communities for refuge.\nTension is mounting in Jessu, a neighbouring community to Nyuwar as panicky residents hurriedly trooped out of the town for safety.\nThe accord however suffered a setback with the fresh attack on the Nyuwar community."
  },
  {
    "headline": "Contractors shut NDDC office over unpaid debts",
    "summarized_story": "Indigenous contractors have barricaded the corporate headquarters of the Niger Delta Development Commission (NDDC) in Port Harcourt Rivers State, following failures of the commission to pay their debts.\nThe contractors, under the auspices of the NDDC Indigenous Contractors Association, seized the premises of the commission six days ago for the protest.\nThey carried placards with inscriptions such as: “NDDC pay us our money,” “NDDC, Akwa pay Contractors please”; ” NDDC Contractors are dying”.\nIjegbai said it was painful that the contractors used their money to execute the projects, saying that despite inaugurating the projects, NDDC had refused to pay them.\nBefore once you earn your IPC you will be paid but we don’t know what is happening since the inception of this present board."
  },
  {
    "headline": "JUST IN: Bandits kill 13, abduct Katsina village head",
    "summarized_story": "Terrorists on Tuesday morning killed 13 residents and abducted a village head during an attack on three communities of Dukawa village in Bakori and Funtua Local Government Areas of Katsina State.\nThey later attacked two other communities in Funtua Local Government Area where they murdered 10 residents and abducted the village head, Alhaji Umar.\nIt was learnt the terrorists also looted shops and houses in the three communities and stole personal effects and money.\n- Advertisement -Eldest son of the village head, Abdullahi Umar, said: “When they came, they started shooting sporadically to scare people away.\n“The bandits returned with him into the house and looted the house before they left with him and others.”The slain victims were buried on Tuesday afternoon."
  },
  {
    "headline": "One soldier shot, several injured as Gombe community boils again",
    "summarized_story": "One soldier shot, several injured as Gombe community boils againAt least one soldier has been reportedly shot and several persons injured in fresh outbreak of violence in Nyuwar, a remote border community between Gombe and Adamawa States.\nEyewitnesses said the soldier was injured while trying to repel attacks on Nyuwar Community by neighbouring Waja community, which carried out a similar attack on Nyuwar and Jessu last April.\nRead Also: Bandit kills eight in ImoSeveral houses were also said to have been torched while women, children and the aged were forced to escape to neighbouring communities for refuge.\n- Advertisement -Tension is mounting in Jessu, a neighbouring community to Nyuwar as panicking residents hurriedly troop out of the town for safety.\nNyuwar and Jessu, the two Lunguda communities were attacked last April by the Wajas, forcing many residents to relocate to neighbouring communities for safety."
  },
  {
    "headline": "Supreme Court hits back at AGF over delays in high profile cases",
    "summarized_story": "From Godwin Tsa, AbujaThe Supreme Court, yesterday, hit back at the Attorney General of the Federation (AGF) and Minister of Justice, Abubakar Malami (SAN) for indicting the nation’s judiciary for tdelays in the trial and delivery of judgments involving high profile corruption cases.\nWhile faulting the position of the AGF, the apex court said it was wrong for the Federal Government cannot blame the judiciary for the delays.\n“The Administration of Criminal Justice Act (2015) under reference is infected with sores in some parts, making speeding adjudications improbable in some instances, in addition to high volume of cases, limited number of judges, poor infrastructure or archaic equipment.\nEach Court and judicial body has a budget unit, the account department, internal audit, Due Process Unit, as well as Departmental Tenders Board.\n“These layers of control were established by the Judiciary to ensure transparency, accountability and effective budget implementation."
  },
  {
    "headline": "Unpaid jobs: Contractors shut down NDDC office in Rivers",
    "summarized_story": "From Tony John, Port HarcourtIndigenous contractors, yesterday, paralysed business activities at the headquarters of the Niger Delta Development Commission (NDDC) in Port Harcourt, Rivers State, over the failure of the commission to pay their debts.\nThe protesters, under the umbrella of NDDC Indigenous Contractors Association, had in the past six days taken over the premises of the commission in protest, grounding business activities of the office.\nThe contractors, who are of Niger Delta origin with placard bearing different inscriptions like, “NDDC pay us our money,”; “NDDC, Akwa pay contractors please,” and “NDDC contractors are dying,” among others, noted that attempts to get their pay had proven abortive.\nIjegbai said it was painful that the contractors used their money to execute the projects, regretting that such projects have been commissioned and put to use, whereas the money invested by the contractors have not been paid back.\nHe said: “We are here because we have done jobs for NDDC for the past four years."
  },
  {
    "headline": "Edo: Gunmen abduct IPMAN chairman, kill driver",
    "summarized_story": "From Tony Osauzo, BeninA petroleum products marketer and member of the Edo State chapter of the Independent Petroleum Marketers Association of Nigeria (IPMAN), Alhaji Abdul-Hamid Egele, has been reportedly abducted by gunmen who shot his driver dead in the process.\n“The gunmen ambushed the IPMAN chairman with two vehicles without plate number and fired at his jeep and killed his driver.\n“The IPMAN chairman was later taken away after the security attached to him were overpowered by the gunmen who injured the security operatives”, an eyewitness said.\n‎But the Edo State Police Command said it was yet to get the report of the incident.\nI will find out from the Divisional Police Officer (DPO) of Jattu,” he added."
  },
  {
    "headline": "Niger: 11 sentenced to death by hanging",
    "summarized_story": "From John Adams, MinnaA Minna High Court has sentenced 11 persons to death by hanging for their involvement in the gruesome murder of seven villagers over a land dispute in Lavun Local Government Area of Niger State.\nThose sentenced to death included Mohammed Mohammed, Baba Mohammed, Mohammed Isa, Abubakar Saba Adamu Babaminin, and Ibrahim Emigi.\nOthers to also die by hanging included Haruna Mohammed, isah Madu, Ndama Sheshi Isah Mohammed and Mohammed Ndabida.\nThe presiding Judge, Justice Maimuna Talatu Abubakar, in her judgment held that the prosecutor proved beyond reasonable doubt the charges against the accused persons.\nShe however acquitted 15 other accused persons for lack of convincing evidence."
  },
  {
    "headline": "MOUAU ASUU alerts Nigerians on strike",
    "summarized_story": "From Okey Sampson, UmuahiaThe Academic Staff Union of Universities (ASUU), Michael Okpara University of Agriculture, Umudike (MOUAU) branch, has alerted Nigerians that the union would embark on an indefinite industrial action, in protest to the federal government’s failure to keep to agreement reached with them.\nIssuing the alert in Umuahia on Tuesday during a press briefing organised to sensitise and mobilise members of the union for the looming strike, Prof Choke Ugwuene, chairman, ASUU, MOUAU branch, said the action had become necessary in response to federal government’s failure to honour the 2009 agreement it entered with ASUU.\nHe said academic staff of Nigerian Universities have have been earning the same salary for the past 13 years since 2009.\nThe union also decried the imposition of IPPIS system on ASUU members by the federal government, noting that the University Transparency and Accountability Solution (UTAS) developed by ASUU, which was tested and proved in results, would save the ASUU members from shortcomings of the IPPIS.\nIt informed Nigerians to get set for the indefinite strike, as all patience had been exhausted by ASUU, even as it vowed that the strike when embarked upon would only be suspended when all their demands are met."
  },
  {
    "headline": "2023: Tambuwal in Kebbi, Tells PDP to Prepare for New Members",
    "summarized_story": "Tambuwal spoke on Tuesday during his visit to , Birnin Kebbi, Kebbi State.in continuation of his consultations on his presidential bid.\n“All political watchers in the country on Saturday witnessed the political sagacity of the state PDP, which is united.\n“The PDP in Kebbi state is united.\nThe PDP in Kebbi state is compact and strong.\nIn his remarks, the Kebbi state PDP Chairman, Alhaji Bello Usman Suru, said: “historically we in Kebbi are one with the people of Sokoto."
  },
  {
    "headline": "APC Leaders in Search of Consensus Candidate at Convention to Unite Party",
    "summarized_story": "These three prospective candidates were allegedly mentioned repeatedly by many of the major stakeholders of the party as suitable to lead the APC to a successful election in 2023.\nFollowing media reports that APC was considering fielding former President Goodluck Jonathan as its presidential candidate in 2023, the ruling party said defectors to the party, including Jonathan, would be given waiver to contest.\nMustapha was Deputy National Chairman of the defunct Congress for Progressive change (CPC), Buhari’s legacy party before the merger that birthed APC.\nAccording to the source, the security profiling was discretely undertaken to avoid any embarrassment to the ruling party.\nMeanwhile, following media reports and on-going permutations that APC was considering fielding Jonathan as its presidential candidate in 2023, the ruling party reiterated that defectors to the party would be given waiver to contest."
  },
  {
    "headline": "With Withdrawal of Wrong Fuel from Circulation, Queues Return to Abuja, Lagos, Others",
    "summarized_story": "The Independent Petroleum Marketers Association of Nigeria (IPMAN) blamed the shortage of supply on issues surrounding the presence of bad fuel in the market as well as undersupply from the national oil company.\nThe IPMAN official assured that the issue of bad fuel in circulation was already being investigated, stating that Managing Director of PPMC, Mr Isiaku Abdullahi, was intervening in the matter.\n“Also, we witnessed the issue of bad product and I must use this opportunity to tell the masses that it is not from our members.\n“As I am telling you, we have run into millions of naira in losses as a result of this bad product.\nHe pointed out, “The situation is not too good because of non-availability of this product, coupled with this bad product that came in the last two weeks."
  },
  {
    "headline": "NFF Dumps Peseiro, Retains Eguavoen as Interim Technical Adviser",
    "summarized_story": "*Drafts Amuneke into technical crew as Head CoachDuro IkhazuagbeThe Nigeria Football Federation (NFF) on Monday officially put in the cooler negotiations with Portuguese Coach, Jose Peseiro, to take over the Super Eagles job from sacked Gernot Rohr.\nInstead, the federation announced a reconstituted technical crew of the Super Eagles with Augustine Eguavoen retained as Interim Technical Adviser.\nTo reinforce the technical bench ahead of next month’s 2022 World Cup playoff against Ghana’s Black Stars, NFF also drafted former Nigeria World Cup star and former U20 Boys’ Head Coach, Emmanuel Amuneke as immediate assistant to Eguavoen.\nHe is a Member of both the FIFA and CAF Technical Study Groups.\n“The NFF Board has approved a recommendation of the Technical and Development Committee retaining Augustine Eguavoen as Technical Director/Technical Adviser (interim) while Emmanuel Amuneke becomes the Chief Coach of the Super Eagles."
  },
  {
    "headline": "Amended Electoral Bill Bars Ministers, Commissioners from Contesting in Primaries",
    "summarized_story": "What this therefore, means is that ministers, commissioners and other political appointees are expected to resign ahead of their parties’ primaries in order to be eligible to contest in the primaries.\nBut the fear being expressed by many is that, with a clause that clearly breaches the provision of the constitution, the president might be forced to veto the electoral act amendment bill again.\nThe National Assembly had recently transmitted the new Electoral Act (Amendment) Bill to Buhari for assent, through the Clerk of the National Assembly, Olatunde Ojo.\nBefore the latest transmission, Buhari had in December 2021, vetoed the former amendment bill, leading to a recommittal by the National Assembly.\nBuhari had declined assent to the first amendment bill over the provision of direct primary as the only mode of choosing candidates by political parties."
  },
  {
    "headline": "'FG files more charges than it can prove' -- CJN speaks on delay in high-profile cases",
    "summarized_story": "Ibrahim Muhammad, chief justice of Nigeria (CJN), says the federal government files more charges than it can prove in court.\nThe CJN said this in reaction to the claim by Abubakar Malami, attorney-general of the federation, that the judiciary is to blame for delays in prosecuting high-profile cases.\n“As far as the present administration is concerned, delay of cases does not arise.\nEach court and judicial body has a budget unit, the account department, internal audit, due process unit, as well as departmental tenders board.\nIf the federal audit raises a query on any transaction and it is not well defended, it sends such to the public account committees of the national assembly."
  },
  {
    "headline": "'FG files more charges than it can prove' -- CJN speaks on delay in high-profile cases",
    "summarized_story": "Ibrahim Muhammad, chief justice of Nigeria (CJN), says the federal government files more charges than it can prove in court.\nThe CJN said this in reaction to the claim by Abubakar Malami, attorney-general of the federation, that the judiciary is to blame for delays in prosecuting high-profile cases.\n“As far as the present administration is concerned, delay of cases does not arise.\nEach court and judicial body has a budget unit, the account department, internal audit, due process unit, as well as departmental tenders board.\nIf the federal audit raises a query on any transaction and it is not well defended, it sends such to the public account committees of the national assembly."
  },
  {
    "headline": "PHOTOS: Osinbajo pays condolence visit to Hanifa's family in Kano",
    "summarized_story": "Vice-President Yemi Osinbajo, on Tuesday, paid a condolence visit to the parents of Hanifa, the five-year-old girl that was found murdered in Kano.\nAdvertisementOsinbajo visited Hanifa’s family after attending the 53rd conference of the National Association of Law Teachers, held in Kano.\nAccording to a statement by Laolu Akande, spokesperson to the vice-president, Osinbajo expressed condolences to the family on behalf of himself and President Muhammadu Buhari.\nOn his part, Abubakar Abdulsalam, father of the slain schoolgirl, expressed appreciation to the vice-president for the visit.\nThe only thing I will say is to pray for him and the entire nation that peace will reign.”See photos below."
  },
  {
    "headline": "PHOTOS: Osinbajo pays condolence visit to Hanifa's family in Kano",
    "summarized_story": "Vice-President Yemi Osinbajo, on Tuesday, paid a condolence visit to the parents of Hanifa, the five-year-old girl that was found murdered in Kano.\nAdvertisementOsinbajo visited Hanifa’s family after attending the 53rd conference of the National Association of Law Teachers, held in Kano.\nAccording to a statement by Laolu Akande, spokesperson to the vice-president, Osinbajo expressed condolences to the family on behalf of himself and President Muhammadu Buhari.\nOn his part, Abubakar Abdulsalam, father of the slain schoolgirl, expressed appreciation to the vice-president for the visit.\nThe only thing I will say is to pray for him and the entire nation that peace will reign.”See photos below."
  },
  {
    "headline": "Over N11bn paid for losses suffered during #EndSARS protests, says insurers association",
    "summarized_story": "The Nigerian Insurers Association (NIA) says insurers paid over N11 billion as claims for losses suffered during the 2020 #EndSARS protests.\n“As of January, insurers have paid over N11 billion as claims that arose from the #EndSARS protests of 2020,” Musa said.\nAs of October 2021, the NIA had said insurance companies paid over N9 billion as claims for about N20 billion estimated losses suffered during the protests.\nAdvertisementAccording to Musa, an additional N2 billion was paid between October 2021 and January 2022.\nThe association put the number of insured businesses affected during the protests across the country at about 2,000."
  },
  {
    "headline": "Meta quietly shuts down its low-cost internet program across Africa",
    "summarized_story": "Notably, in countries like Kenya, Express Wi-Fi has been unavailable since mid-December 2020.\nSimilar to this announcement, about a year ago, Google shut down project Loon, one of it’s low-cost internet projects active in Kenya.\nLaunched in 2016, Express Wi-Fi program was designed as an improvement to Meta’s earlier failed Free Basics program.\nCurrently about 28% of sub-Saharan Africa’s population is connected to mobile internet according to the 2021 GSMA mobile economy report.\nThe end of Express Wi-Fi program signals a change in Meta’s approach to delivering low-cost internet across Africa."
  },
  {
    "headline": "Asa joins Spotify EQUAL Music Programme as ambassador of the month",
    "summarized_story": "Paris-born Nigerian singer, Asa, was recently announced the Spotify EQUAL Global Music Programme ambassador for the month of February.\nIn April 2021, months after it expanded to 38 African countries, Spotify launched the Spotify EQUAL Music Programme in commemoration of International Women’s Day.\nThis research helped fuel the drive for its EQUAL Global Music Programme.\nMayana already has over 560,000 streams on Spotify, and the addition to EQUAL playlists will boost it further.\nSpeaking about her selection, the singer said, “I’m honoured to be the Spotify EQUAL ambassador of the month."
  },
  {
    "headline": "What’s it like building in unpopular sectors?",
    "summarized_story": "Building a successful business in an unpopular sector is difficult globally, especially in Africa.\nBut, regardless of how difficult it is to build in Africa, some people have done it and are still doing it.\nImisi 3D, an Extended Reality (XR) creation lab that focuses on building the African XR ecosystem in Nigeria and beyond, was founded in 2017 in Lagos, Nigeria.\nRegardless of which sector one’s building, the early days are usually lonely and filled with trial and errors in product iterations and product-market fit.\nToday, there’s a massive acceptance of the XR sector owning to the numerous conversation around blockchain and the metaverse, which is essentially a digital world powered by virtual reality."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "Kalibotics is using robotics to revamp edtech, agritech, e-waste management",
    "summarized_story": "Kalibotics smart classroomThe seemingly discouraging outcomes of these two endeavours opened their eyes to something bigger.\nThe result was the birth of robotics startup, Kalibotics, coined from two words: Kali, a Swahili term for ‘energetic’, and Robotics.\nLeading up to KaliboticsBefore Kalibotics, the duo has come a long way in building tech products and running businesses.\nOlugbenga asserts that Kalibotics’ products are targeted majorly at large businesses and the government for obvious reasons.\nWe have what is called Kalibotics Project Alpha, which is B2C."
  },
  {
    "headline": "Why are artistes interested in African startups?",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge funding rounds.\nToday on Techpoint Digest, I decided to explore artistes’ interests in African startups, a scenario that has become more noticeable recently.\nAdvertisementAfrican startups X ArtistesLast week, Nigerian startup, AltSchool, raised a $1m pre-seed to provide alternative schools for Africans.\nAs a founder himself, he runs a VC company, Africa Music Fund (AMF), that invests in African music talents.\nHe also set up a syndicate fund, Zagadat Capital, to invest in African startups."
  },
  {
    "headline": "Who’s competing with fintechs?",
    "summarized_story": "AdvertisementMeanwhile, in Today’s Digest, we’d be discussingThe competition fintechs may not see coming, andThe tech/Afrobeats comboWho’s competing with fintechs?\nBut these fintechs might soon find themselves facing some stiff competition they might not have expected.\nAdvertisementIn this part of the world, streaming music didn’t become a thing until platforms like Soundcloud, Boomplay, and others burst onto the scene.\nNow, platforms like Spotify, YouTube Music, and Apple Music are currently trying to take a huge piece of the African pie.\nThey’ve also helped catapult Afrobeats — one of Africa’s most prominent exports on the music scene — to the world stage faster."
  },
  {
    "headline": "#EndSARS claims top N11bn as insurance awareness grows",
    "summarized_story": "With about N11 billion so far paid as claims from the 2020 #EndSARS destructions, consumers, particularly small and medium scale enterprises (SMEs) are showing increased appetite for insurance protection.\nRead also: EndSARS white paper: Lagos complied with the law – Attorney-generalHe said the industry expects that the EndSARS claims would be about N20 billion when concluded, stating that some unsettled and pending claims were being investigated and processed.\nAccording to him, out of the N508 billion premium generated in 2020, claims on matured risks amounted to N224 billion.\nA further breakdown on the EndSARS released earlier by the NIA showed that 99 claims were settled on malicious damage; 8 claims on business interruption; 455 claims on burglary attacks and 912 claims on fire and burnt sites.\nFollowing huge losses suffered by businesses during #EndSARS, NIA said that the insurance industry, in line with its role of providing financial intermediation and restoring businesses, quickly moved in to provide the necessary cushion for those that have insurance covers."
  },
  {
    "headline": "In break with tradition, Nigeria’s external reserves fall as oil prices rise",
    "summarized_story": "The rally in oil prices is not translating to more dollars in Nigeria’s reserves for only the fifth time in at least two decades, as a growing petrol subsidy bill and low oil production shut Africa’s largest oil producer from the gains of higher oil prices.\nNigeria’s external reserves and excess crude account tend to see accretion in periods of higher oil prices.\nWhile oil prices have soared, the external reserves have however declined by 1.3 percent in the same period.\nNigeria’s oil revenues have tanked for two reasons.\nBen Akabueze, head of the country’s Budget Office, said oil revenue had been affected negatively by subsidy costs and low oil production despite rising oil prices."
  },
  {
    "headline": "Pension assets under management grows to N13trn but FG bonds still hold sway at 63%",
    "summarized_story": "Nigeria’s total assets under management has risen to more than thirteen trillion naira, a growth of near ten per cent year on year to October 2021.\nAccording to PenCom’s latest monthly report for Oct ’21, the assets which came in at N13.2trn, grew by about one per cent month on month.\nWith respect to equities, Nigerian PFAs have adopted a cautious approach, having taken some losses during the stock market meltdown of 2008 to 2009.\nAnother noteworthy point is that despite the Nigerian Stock Exchange’s market capitalisation of over USD60bn, selecting high-quality, liquid shares that fit the investment criteria of PFAs is extremely challenging.\nIn comparison, yields on FGN bonds retraced by well over 500bps across the curve between Q4 ’20 and Q3 ’21."
  },
  {
    "headline": "Delta Cult Clash: Police Arrest Eleven Suspects, Recover Arms – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – At least five persons have been reportedly killed, following a fierce cult clash between the Eiye and Black axe confraternity in Agbarho, Ughelli North LGA on the 6/2/2022.\nTo this end, the Delta State Police Command has arrested eleven persons connected to the mayhem.\n“The situation has been brought under control and more patrol teams have been deployed to forestall any further breakdown of law and order in the Community.\nManhunt for the other fleeing suspected cultists is ongoing.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Obaseki swears-in eight new commissioners tomorrow – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, will tomorrow, Wednesday, February 9, 2022, swear-in eight new Commissioners confirmed by the Edo State House of Assembly.\nIn a statement, Secretary to the State Government, Osarodion Ogie Esq., said the ceremony will be held at the New Festival Hall at the Government House, Benin City.\nOgie noted, “It is hereby announced for the information of the general public that the eight (8) commissioner-nominees confirmed by the Edo State House of Assembly on Monday, February 7, 2022, will be sworn into office by His Excellency, the Edo State Governor, Mr. Godwin Nogheghase Obaseki, on Wednesday, February 9, 2022.”The commissioner-nominees cleared by the State House of Assembly are Chris Nehikhare, Omololu Ojehomon, Afishetu Braimoh, and Stephen Idehenre.\nOthers are Osasere Evbuomwan, Donald Ojemeh, Okojie Newton and Jonathan Lawani.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo NEWMAP inspects ongoing flood control projects, assures speedy completion – Nigerian Observer",
    "summarized_story": "Obaseki stated that the need to adhere to quality and guidelines informed the inspection exercise.\nHe reassured that the government will sustain efforts at tackling the problem of flooding and erosion across all Edo communities.\nResidents of Igbei, who spoke to journalists during the inspection, hailed the governor for putting the people at the forefront of his administration’s programmes and policies.\n“But the Governor Obaseki-led government through Edo State NEWMAP intervention has however changed this narrative with the near completion of this flood alleviation work in our community.\nThe stone-based road is the outcome of the underground drainage work done along the road, which now necessitated the asphalting of the road."
  },
  {
    "headline": "Group Urges Akhabue To Run For Edo Central Senatorial Seat – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAn Esan social cultural group — Esankugbe, with membership across the entire Edo Centre, has called on Ehia Olu Akhabue to join the Senate race for Edo Central Senatorial District.\n“ We are aware that someone like Senator Ordia once fought to frustrate Senator Ugbesia’s third term gambit.\nThe most honorable thing for him to do now is to back down and allow a fresh blood.\nWe know he has done his best these past 8 years and we appreciate him” the statement concluded.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "FG confirms importation of contaminated fuel",
    "summarized_story": "Nigeria’s Federal Government has said fuel with methanol quantities above the country’s specification, was discovered in the supply chain.\nThe government confirmed this through the Nigerian Midstream and Downstream Petroleum Regulatory Authority, in a statement on Tuesday.\nThe statement said the supplier had been identified and appropriate sanction would apply.\nIt also said oil marketers had been directed to ensure sufficient supply of petrol in all outlets in the country.\nQueues had surfaced in filling stations in parts of the country, particularly Abuja and Lagos, on Monday stretching into Tuesday."
  },
  {
    "headline": "NIRSAL calls for repayment of Covid-19 loans",
    "summarized_story": "Overall, NIRSAL disbursed loans valued at over N503 billion to over 881,000 Nigerians and businesses to cushion the effects of Covid-19.\nThey were made up of 612,321 households that received loans ranging from N250,000 to N1 million totaling N240.\nAlso, 103,185 Small and Medium Enterprises received loans valued at N104.\n023 billion between 2020 and December 2021Households that are Non-Interest Beneficiaries (NIB) of the NIRSAL MFB loans numbering 21,027 also secured facilities amounting to N9.091 billion.\nAlso, 105,244 Anchor Borrowers’ Programme (ABP) successful applicants received loans amounting to N31."
  },
  {
    "headline": "FirstBank Rewards Customers in its Visa Gold Cashback Campaign",
    "summarized_story": "In furtherance of its appreciation of customers, whilst promoting the adoption of mobile payment solutions in the country, FirstBank is rewarding holders and customers of its branded Visa Gold card in its ongoing Visa Gold card.\nThe promo which will have over 300 Visa Gold cardholders rewarded during the promo is scheduled to end on 25 March 2022.\nThe maximum transaction value for purchase cashback is $500.\nFirstBank Visa Gold card is an international premium credit card issued in partnership with Visa International.\n“Appreciating our customers for their patronage is very important to us as we encourage the increased adoption of the Visa Gold card”, said Mr Chuma Ezirim, the bank’s Group Executive, e-Business and Retail products."
  },
  {
    "headline": "Seplat, Belema, First E&P behind worst gas flare rate per output",
    "summarized_story": "According to latest gas output data for November 2021, the above mentioned companies flared between 90 per cent and 100 per cent of their respective gas output in the month under review.\nIn contrast , Nigeria recorded total gas output of 156.529 billion SCF in the month of October 2021, even as the volume of gas flared in the same month was 12.819 billion SCF, representing 8.19 per cent of total gas output.\nAddax and Aiteo followed flaring 55.76 per cent and 39.31 per cent of their total gas outputs of 1.641 billion SCF and 854 million SCF respectively.\nWhen we talk in volume terms, Shell Nigeria flared the most gas in the country in the month under review, with 2.242 billion SCF of gas from its gas output of 46.217 billion SCF; while Mobil flared 2.157 billion SCF of gas out of its total output of 24.645 billion SCF.\nThe percentage of gas flared compared to their output was 4.85 per cent, 8.75 per cent and 17.38 per cent, respectively, for Shell, Mobil and Star Deepwater – Agbami FPSO."
  },
  {
    "headline": "Defection: APC Hails Court’s Ruling Affirming Matawalle As Zamfara Gov",
    "summarized_story": "The All Progressives Congress (APC) has hailed Monday’s Federal High Court judgement affirming Muhammad Bello Matawalle as the Governor of Zamfara State.\nBello Muhammad Matawalle as the Governor of Zamfara State.\nA Federal High Court in Gusau, the Zamfara State capital, had on Monday dismissed the suit challenging Matawalle’s governorship of Zamfara State upon his defection from the Peoples Democratic Party (PDP) to the APC, saying the whole case was “devoid of merit”.\n“That Governor Bello Muhammad Matawalle has the right to assembly and association with respect to joining or belonging to a political party.\n“The APC congratulates Governor Bello Muhammad Matawalle on his affirmation by the High Court."
  },
  {
    "headline": "JAMB Postpones 2022 UTME, DE Registrations To Feb 19",
    "summarized_story": "The commencement of the 2022 Unified Tertiary Matriculation Examination (UTME) and Direct Entry (DE) registrations earlier scheduled for Saturday, February 12, 2022, has now been postponed to Saturday, February 19, 2022.\nThe head, public affairs and protocol of JAMB, Dr Fabian Benjamin, said the one-week postponement was to allow for more fine-tuning of the upgraded and more user-friendly procedures for candidates’ registration.\nADVERTISEMENT“The Board wishes the general public to note that the Board is ever-ready to provide world-class services to Nigerians.\n“Further to the above, the new and improved procedures for the 2022 UTME Registration would be made available on the Board’s website, its weekly bulletin as well as other media outlets on Monday, 14th February, 2022,” he said.\nThe JAMB spokesman, therefore, urged candidates to follow keenly the procedures for registration as would be announced by the Board."
  },
  {
    "headline": "JAMB Postpones 2022 UTME, DE Registrations To Feb 19",
    "summarized_story": "The commencement of the 2022 Unified Tertiary Matriculation Examination (UTME) and Direct Entry (DE) registrations earlier scheduled for Saturday, February 12, 2022, has now been postponed to Saturday, February 19, 2022.\nThe head, public affairs and protocol of JAMB, Dr Fabian Benjamin, said the one-week postponement was to allow for more fine-tuning of the upgraded and more user-friendly procedures for candidates’ registration.\nADVERTISEMENT“The Board wishes the general public to note that the Board is ever-ready to provide world-class services to Nigerians.\n“Further to the above, the new and improved procedures for the 2022 UTME Registration would be made available on the Board’s website, its weekly bulletin as well as other media outlets on Monday, 14th February, 2022,” he said.\nThe JAMB spokesman, therefore, urged candidates to follow keenly the procedures for registration as would be announced by the Board."
  },
  {
    "headline": "2023: Adamawa Women Declare Support For Namdas",
    "summarized_story": "Adamawa women under the auspices of Women For Namdas group, have declared their support for a governorship aspirant of the All Progressives Congress (APC), Hon.\nAccording to her, Namdas pledged to invest in girl-child education, women and youth empowerment, healthcare especially the reduction of maternal and infant mortality in Adamawa State.\nWhen he decided that he wants to contest for the governorship of Adamawa State, the first group of people he met was women.\nADVERTISEMENT“He mentioned a lot of things that Adamawa women need as mothers, as small scale entrepreneurs, he talked about education for the girl-child and the protection of women and girls.\nHe spoke about securing Adamawa State because when there are security problems women and girls are most affected."
  },
  {
    "headline": "2023: Adamawa Women Declare Support For Namdas",
    "summarized_story": "Adamawa women under the auspices of Women For Namdas group, have declared their support for a governorship aspirant of the All Progressives Congress (APC), Hon.\nAccording to her, Namdas pledged to invest in girl-child education, women and youth empowerment, healthcare especially the reduction of maternal and infant mortality in Adamawa State.\nWhen he decided that he wants to contest for the governorship of Adamawa State, the first group of people he met was women.\nADVERTISEMENT“He mentioned a lot of things that Adamawa women need as mothers, as small scale entrepreneurs, he talked about education for the girl-child and the protection of women and girls.\nHe spoke about securing Adamawa State because when there are security problems women and girls are most affected."
  },
  {
    "headline": "Nigerian Govt Withdraws Adulterated PMS From Market",
    "summarized_story": "In view of public outcry on the proliferation of adulterated Petroleum Motor Spirit (PMS) in circulation, the Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA), said the flawed product has been withdrawn from the market.\nIt said the product call back included trucks in transit.\nThe Authority in a statement issued on Tuesday confirmed that the methanol content in the withdrawn products was above Nigeria’s specification.\nIt explained that Methanol is a regular additive in Petrol and is usually blended in an acceptable quantity.\n“Meanwhile, NNPC has intensified efforts at increasing the supply of Petrol into the market in order to bridge any unforeseen supply gap”, it added."
  },
  {
    "headline": "2023: Atiku, Others At Risk As House Of Reps Move To Raise Candidates’ Minimum Education Qualification",
    "summarized_story": "2023: Atiku, Others At Risk As House Of Reps Move To Raise Candidates’ Minimum Education QualificationThe House of Representatives has passed, for second reading, a bill to bar people without university degrees from contesting the presidential position.\nTo contest for federal and state legislature and governorship seats, a candidate will need a minimum of a university degree.\nFormer Vice President and candidate of the Peoples Democratic Party at the last general election, Atiku Abubakar, presented a Diploma as his highest qualification.\nIt is not only Mr Atiku that presented less than a university degree or equivalent.\nOn Tuesday, the House debated the general principle of the bill and passed it for second reading."
  },
  {
    "headline": "JAMB Releases New Date For Commencement Of UTME, DE Registration",
    "summarized_story": "The Joint Admission and Matriculations Board, JAMB, has announced that registration for the 2022/23 Unified Tertiary Matriculation Examination (UTME) and Direct Entry (DE) will begin on Saturday, February 19th and end on March 26th, 2022.\nHowever, in a notice on Tuesday, JAMB said the postponement was to enable “more fine-tuning of the upgraded and user-friendly procedures for candidates’ registration.\nIt said the fine-tuning process will be concluded within the one-week extension period given before the commencement of registration.\n“Further to the above, the new and improved procedures for the 2022/23 UTME Registration would be made available on the Board’s website, its weekly bulletin as well as other media outlets on Monday, 14th February 2022.\n“The candidates are, by this notice, urged to follow keenly the procedures for registration as would be announced by the Board”."
  },
  {
    "headline": "Tambuwal Shut down Kebbi as PDP State Exco Backs His Presidential Ambition",
    "summarized_story": "The Kebbi State chapter of the Peoples Democratic Party, PDP, has endorsed the Presidential Ambition of Sokoto state Governor, Aminu Waziri Tambuwal.\nSpeaking on the purpose of his visit, Governor Tambuwal said he is in Kebbi to consult with the leaders in the state for his Presidential aspiration adding that with level of reception he received by the entire Kebbi PDP exos and structure, he is convinced that PDP is back in Kebbi state.\nTambuwal was received by the entire Kebbi PDP state exco led by the party chairman, Alhaji Usman Bello Suru as well as former minister of Special Duties Kabiru Tanimu Turaki, General Ishaya Bamayi, General Bello Siyaki.\nIn his remarks, the state PDP chairman, Usman Bello Suru, said the Kebbi state PDP is fully in support of Governor Tambuwal’s ambition.\nTo demonstrate this, he asked all delegates, Kebbi state PDP local government chairmen and state excos to identify themselves."
  },
  {
    "headline": "Reps move to okay 1st degree as minimum qualification for president, govs, others",
    "summarized_story": "“Honourable Colleagues, all the political offices affected by this amendment are very strategic in their own right.\nThe State legislators are important for making laws to govern the State in the interest of the people, the office of the Governor is the highest political office in the State.\nThe Federal legislators are important for making laws in the interest of the nation, the Office of the President is the highest political office in the land.\n“As we have begun to see, the race for elective offices at both State and national levels have become increasingly competitive.\nInvariably, by leaving the qualification of this political offices to remain at School Certificate level, we are implying that the NYSC is not a requirement to hold political offices but it is a requirement to secure a job in the Public Sector."
  },
  {
    "headline": "FCT polls: INEC set to deliver sensitive materials, accredits 2,242 observers, 340 journalists",
    "summarized_story": "He said accredited 58 observer groups (53 domestic and 5 foreign) that are deploying a total of 2,242 field observers.\nThe INEC chairman called on the media and observers to operate within the context of the code of conduct for election observation and media coverage.\nWe have similarly accredited 45 media organisations deploying 340 journalists to cover the election.\n“We will work with the security agencies to ensure that observers and the media are granted unimpeded access to voting and collation locations.\nI call upon the media and observers to operate within the context of the code of conduct for election observation and media coverage."
  },
  {
    "headline": "Pictures: Residents groan as fuel scarcity worsens in Abuja",
    "summarized_story": "Residents of Abuja, Nigeria’s capital are lamenting following continuous fuel scarcity in days.\nThere have long queues at few filling stations especially on Monday and Tuesday February 7 and 8, 2022 where Blueprint correspondent visited.\nBlueprint further learnt that as a result of the scarcity, workers waiting for commercial vehicles to board after work were stranded on the road on Monday.\nFew days ago, the management of the Nigeria National Petroleum Corporation (NNPC) while attributing the situation to panic buying assured that the country has adequate supply on ground."
  },
  {
    "headline": "Petrol Supply With Excess Methanol Cause Of Fuel Scarcity, Says FG",
    "summarized_story": "Mr Ahmed said while the quality control agencies of the government have swung into the action, NNPC Limited and oil marketers have been directed to ensure robust supply of petroleum products.\n“To ensure vehicular and equipment safety, the limited quantity of the impacted product has been isolated from the market, including those loaded in trucks.\n“The NNPC Limited and all marketing companies have been directed to sustain sufficient distribution of petrol products in all retail outlets nationwide to avoid any scarcity.\n“Meanwhile, the NNPC has intensified efforts at increasing the supply of petroleum products in the market in order to bridge any unforeseen supply gap.”Fuel anxietyFuel queues had emerged on Tuesday morning in Lagos.\nSome fuel stations were locked while a few open ones had long queues of motorists waiting to buy fuel."
  },
  {
    "headline": "Buhari Confers National Honour On Three Scholars",
    "summarized_story": "President Muhammadu Buhari on Tuesday conferred the Nigerian National Order of Merit (NNOM) for years 2020 and 2021 on three Nigerian scholars.\nThe scholars had distinguished themselves in the field of medicine and science.\nThe scholars include Dr. Oluyinka Olurotimi Olutoye, Medicine (2020); the late Professor Charles Ejike Chidume, Science (2020) and Professor Godwin O. Samuel Ekhaguere, Science (2021).\nAbridged citation of recipientsProf Olutoye, recipient of the 2020 NNOM Award for science, is credited to have led a team which performed ground-breaking surgical procedures on foetuses before they are born.\nProf Ekhaguere, recipient of the 2021 NNOM Award for science, is a professor of Mathematical Physics."
  },
  {
    "headline": "CJN To Malami: Judiciary Can’t Be Blamed For Delay In High-Profile Cases",
    "summarized_story": "The Chief Justice of Nigeria (CJN), Tanko Muhammad, on Tuesday, absolved the judiciary of delay in the handling of high-profile corruption cases.\nMalami had during an interview on Channels Television’s Politics Today on Monday, blamed the judiciary for the protracted trial of high-profile corruption cases.\nBut barely 24 hours, the CJN said Malami’s criticism of the judiciary for the delays suffered in court by high-profile corruption cases, was one-sided.\nThe CJN explained that the lapses on the part of the executive arm of government contributed to the delays in cases.\n“These layers of control were established by the Judiciary to ensure transparency, accountability and effective budget implementation."
  },
  {
    "headline": "Democracy Cannot Endure Without Social Justice, Says Osinbajo In Kano",
    "summarized_story": "Vice President Yemi Osinbajo on Tuesday said democracy and social justice are vital structures required for nation building, because the pursuit of justice lies at the heart of the quest for a better society.\nHowever, democracy cannot endure without social justice,” he said, noting that “the pursuit of justice lies at the heart of the quest for the good of society.”He continued, “This makes the legal profession one of the cardinal vocations upon which civilization rests.\nIndeed, law is an instrument of pacific social engineering, the end of which is justice.\nThe Vice President added that “while INEC continues to improve its capacity to conduct credible elections, particularly through the deployment of technology; we recognize that democracy is about much more than voting.\nWhere social and economic rights are unsecured, people are unable to fully maximize their civil and political rights.”"
  },
  {
    "headline": "Ex-Pope Benedict XVI Asks For Forgiveness Over Sex Abuse Scandal",
    "summarized_story": "Ex-pope Benedict XVI asked for forgiveness Tuesday for clerical child sex abuse committed on his watch, but aides rejected allegations of a cover-up while he was archbishop of Munich.\nHowever, organisations representing abuse victims criticised the lack of specifics in his comments.\n“In none of the cases analysed by the expert report was Joseph Ratzinger aware of sexual abuse committed or suspicion of sexual abuse committed by priests.\nFrancis has said nothing in public although the Vatican defended Benedict last month, noting his meetings with abuse victims and introduction of laws to combat paedophilia.\nFear and TremblingBefore becoming pope, Benedict led the Vatican’s doctrinal congregation, giving him ultimate responsibility to investigate abuse cases."
  },
  {
    "headline": "Any party that field northern candidate will lose- Akeredolu -",
    "summarized_story": "Chairman of the Southern Governors’ Forum and Ondo State Governor, Rotimi Akeredolu has warned that any party that fields a northern candidate in the 2023 Presidential election will lose.\nGovernor Akeredolu disclosed that Governors in the Southern part of the country under the auspices of the Southern Governors Forum are determined to ensure that next President comes from the south.\nGovernor Akeredolu said: “In about two or three meetings, we have come out and declared that power must move to the south.\nAdvertisement“Only a party that is determined to lose will field a northern candidate.\nWhat we stand for is fair and equitable power rotation."
  },
  {
    "headline": "Ondo former deputy governor, Ali Olanusi loses wife",
    "summarized_story": "The wife of a former deputy governor of Ondo State, Alhaja Bejide Olanusi is dead.\nShe died in Akure, having complained of stress and was taken to an hospital.\nAdvertisementIn the meantime time, the Ondo State chapter of the All Progressives Congress (APC) has commiserated with the family of former deputy governor in the State, Alhaji Ali Olanusi, over the death of his wife, Alhaja (Chief) Bejide.\nState Chairman of the party, Ade Adetimehin, described sad development as ill-timed, shocking and unfortunate.\nHe said Alhaja was a strong pillar behind the husband’s political success story."
  },
  {
    "headline": "Move to impeach Deputy Gov. Mahdi Aliyu constitutional",
    "summarized_story": "The Zamfara State House of Assembly said it’s move to impeach the state Deputy Governor Mahdi Aliyu Gusau is Constitutional.\nThe assembly said the deputy governor has bridged the constitution.\nAdvertisementAddressing newsmen, the Chairman House committee on Information, Shamsudeen Bosko said the speaker has dully served the Deputy Governor through the Secretary to the State Government the impeachment notice.\nThe Zamfara House of Assembly is accusing the state Deputy Governor of abuse of office which includes constitutional breached of section 190 and 193 (1), (2) (a)(b)(c), of the Constitution of the Federal Republic of Nigeria 1999 (as amended).\nAdvertisementThe Zamfara State House of Assembly had been at logger head with the deputy governor over plans to Impeach himA federal high court in Abuja had last restrained the House from making any move to Impeach the Deputy Governor."
  },
  {
    "headline": "Governor Wike visits former Governor Makarfi in Kaduna -",
    "summarized_story": "Rivers State Governor Nyesom WIke says Nigeria is bleeding and the Peoples Democratic Party (PDP) will be disappointing Nigerians if they don’t reunite to rescue the country and chart a new way forward.\nHe stated this in Kaduna state when he led a delegation of PDP stalwarts to visit the leader of the party and former Governor of Kaduna state after his return from a medical tour to the United Kingdom.\nAdvertisementAhmed Makarfi, who was glad to recieve the Rivers Governor was full of appreciation and commended him for his contribution towards the Successful conduct of the the Partys’ nation convention."
  },
  {
    "headline": "UNICEF keen on Abolition of Genital Mutilation – What’s Trending",
    "summarized_story": "The 2030 Agenda for Sustainable Development pushes to eliminate the practice and has UNICEF urging world leaders to begin acting on this commitment made in 2015 to abolish genital mutilation practices on women and girls in Africa, Nigeria included.\nThe UN also set February 6th as ‘International Day of Zero Tolerance for Female Genital Mutilation’ in solidarity and to raise awareness on the impacts of the traditional practice.\nThe production of sachet water, otherwise known as “pure water” is seen in a viral video that raises further concern on the hygienic safety of the water and ‘brand’."
  },
  {
    "headline": "Queues Return to Lagos, Abuja, PH as Wrong Fuel Is Withdrawn from Circulation",
    "summarized_story": "This has affected the lifting of the products to, especially Abuja and other parts of the north from Lagos, THISDAY gathered.\nThe IPMAN official assured that the issue of bad fuel in circulation was already being investigated, stating that Managing Director of PPMC, Mr Isiaku Abdullahi, was intervening in the matter.\n“Also, we witnessed the issue of bad product and I must use this opportunity to tell the masses that it is not from our members.\n“As I am telling you, we have run into millions of naira in losses as a result of this bad product.\nHe pointed out, “The situation is not too good because of non-availability of this product, coupled with this bad product that came in the last two weeks."
  },
  {
    "headline": "Nigeria: APC Leaders in Search of Consensus Candidate at Convention",
    "summarized_story": "Following media reports that APC was considering fielding former President Goodluck Jonathan as its presidential candidate in 2023, the ruling party said defectors to the party, including Jonathan, would be given waiver to contest.\nMustapha was Deputy National Chairman of the defunct Congress for Progressive change (CPC), Buhari’s legacy party before the merger that birthed APC.\nTHISDAY was told that the stakeholders might have drafted the three names for possible security screening to avoid selecting anyone with the baggage of controversies as national chairman.\nAccording to the source, the security profiling was discretely undertaken to avoid any embarrassment to the ruling party.\nMeanwhile, following media reports and on-going permutations that APC was considering fielding Jonathan as its presidential candidate in 2023, the ruling party reiterated that defectors to the party would be given waiver to contest."
  },
  {
    "headline": "Hushpuppi: Nigeria AGF Malami Says Suspended Cop Kyari May Be Extradited to US – Arise News",
    "summarized_story": "Malami, who spoke during an interview on Channels Television, noted that multiple jurisdictions were involved in the matter, including the United Arab Emirates, America, and Nigeria.\nMalami explained, “There are lots of considerations that are on-going, including the possibility of extradition and that is why the collaboration element comes in.\n“As far as I am concerned, parties are discussing; we are collaborating and there are exchanges of correspondence.\nReasonable ground of suspicion has been established and that will eventually translate into prosecution and eventual conviction.\nHe said before the President Muhammadu Buhari administration, Nigeria had only about 103 convictions in corruption cases between 2013 and 2014."
  },
  {
    "headline": "UK PM Johnson Says Sanctions Will Be Ready If Russia Attacks Ukraine",
    "summarized_story": "British Prime Minister Boris Johnson said sanctions and other measures will be ready in the event of a Russian attack on Ukraine, and his government will ask parliament for sanctions on Russian individuals and companies.\nHis comments come as officials in the United States say an attack by Russia on Ukraine could occur within days or weeks.\nOn Monday, U.S. President Joe Biden said after meeting German Chancellor Olaf Scholz that the Nord Stream 2 gas pipeline would be halted if Russia invades Ukraine.\nScholz said the pair had the same approach to Ukraine, to Russia and to sanctions, but did not directly confirm the Nord Stream 2 plans.\nread moreEurope’s most divisive energy project, Nord Stream 2 is designed to double the amount of gas flowing from Russia straight to Germany, bypassing Ukraine."
  }
]