[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "Is celebrity fame and political weight same thing?",
    "summarized_story": "But a celebrity can make the needed electoral impact, when such a celebrity understudy in a political party first before delving into the space.\nThis is why some political parties need to wake up and do what has to be done.\nWith the recent push by political parties handing celebrities tickets instead of its loyalty party members or statesmen, the political parties are derailing and are also moving towards the wrong directions — certain defeat.\nThe question is, is celebrity fame and political fame the same?\nAre some political parties getting it wrong?"
  },
  {
    "headline": "How electorate can rescue Nigeria — Adebayo, SDP presidential candidate",
    "summarized_story": "It is in doing that, Adebayo believes, that the greatness of the country can be achieved.\n“If you want to kick poverty and insecurity, you will need to kick corruption and the only way you can kick corruption is kick the corrupt people out of office,” he said.\nRead Also: Adebayo, SDP presidential candidate, preaches African culture in USAdebayo said this as a guest of the Voice of America, VOA, USA, where he had gone on the invitation of the USA Commission for International Religious Freedom.\nNigeria as a people, he said, aren’t bad, the government is: “Nigeria is synonymous with many good things.\nWe know that Nigerians’ problems are man-made."
  },
  {
    "headline": "Irish court jails impotent Nigerian man for attacking ex-girlfriend over his erectile dysfunction",
    "summarized_story": "By Biodun BusariAn Irish court, Belfast Crown Court has sentenced a 52-year-old Nigerian man, Rotimi Adeyemo to eight years imprisonment for attacking and accusing girlfriend of causing his erectile dysfunction.\nFowler, in his ruling said Adeyemo wrongly accused his ex-partner for casting spell on him, thus attacking her in her residence.\nHe appeared at Belfast Crown Court via a videolink with Maghaberry, where his sentence was divided equally between prison and supervised licence.\nThe aftermath of the attack was captured on police body-worn footage and was described as “harrowing” by Mr Justice Fowler.\nThe judge revealed that the incident had made the woman stop going out and had become isolated, installed security cameras so she could feel safe in her own home and now suffered from nightmares."
  },
  {
    "headline": "Axion can guarantee quality building, road construction in Nigeria, says expert",
    "summarized_story": "The incessant building collapses and the non-durability of Nigerian roads have been attributed to a lack of knowledge about cutting-edge technological products such as Axion tuffcrete and liquid polymer, solid base stabilizer, and bitumen booster, among other products created by Axion Express Engineering Limited, a subsidiary of Axion Canada.\nThis was disclosed on Thursday by the National Sales Manager of the company, Engineer Emmanuel Amedu, adding that the company is the leader in the development, distribution and application of organic liquid monomer formulations for road and building construction industry.\nHe added that the product excellently complies with all the strict requirements on durability and chemical resistance, also offering high mechanical strength on materials used in construction.\nAmedu lamented that most Nigerians build their own houses and when it rains, they become helpless when parts of the building is infiltrated by water or washed away by the flood.\nHis words: “The scarcity of standard building and road structures in Nigeria are often due to lack of knowledge about construction materials, improper mix proportions, poor site supervision because of the hesitation to use project management systems, poor labour workmanship, which is often unseen because of the absence of essential construction trackers and less quality materials, amongst others."
  },
  {
    "headline": "Osun polls: Utomi, Awolowo, others warn FG, INEC against rigging, vote-buying",
    "summarized_story": "The CSOs disclosed that as election observers on ground to monitor the just-concluded Ekiti gubernatorial election, it could clearly confirm that the poll was marked with massive fraudulent practices.\nThey added that vote-buying and technical manipulations of the voting process by INEC officials was rampart.\n“CISCAES is taking the responsibility to alert the generality of Nigerians and the international community that unless proactive preventive measures are adopted to forestall fraudulent practices, it has become predictable that the Osun 2022 poll will inevitably be rigged just like that of Ekiti.\n“In such a case, the worse hit would be the 2023 general elections, which will then be exposed vulnerably to the dangers of massive rigging.\n“Consequently, Nigerians, both home and in the Diaspora, as well as members of the international community must kick-start a thorough monitoring of the electoral process of the Osun 2022 governorship election.”"
  },
  {
    "headline": "Sallah: IGP orders police commissioners to boost security, approves stop-and-search",
    "summarized_story": "Baba directed Commissioners of Police to increase security in states and the Federal Capital Territory (FCT).\nIn a statement by Force Public Relations Officers, Muyiwa Adejobi, the IGP assured of continued efforts aimed to decimate crimes and criminality.\nThe IGP charged the Tactical Commanders, CPs and their supervisory Assistant Inspectors General of Police (AIGs) to beef-up security ahead of Eid-el-Kabir.\nThe IGP advised commands to engage in critical assessment of threat prone areas, thorough stop-and-search, raids on black spots and other anti-crime strategies.\nThe IGP, while congratulating the Muslim faithful on the occasion of the year 2022 Eid-el-Kabir celebration, enjoined them to be security conscious."
  },
  {
    "headline": "NYSC sanctions 22 corps members in Ondo",
    "summarized_story": "Twenty-two corps members who served in Ondo State have received sanctions from the National Youth Service Corps, NYSC, for committing different infractions and breaking the rules governing the program during their service year.\nDuring the passing out ceremony for the 2021 batch “B” (Stream one) corps members conducted in Akure, the state capital, Mrs. Victoria Ani, the state’s NYSC coordinator, disclosed this.\nEight corps members would have their service extended, while 14 members who skipped out on duty would have to repeat it, according to Mrs. Ani, subject to Directorate Headquarters’ permission in Abuja.\nHowever, the NYSC coordinator said that two corps members who stood out above and beyond had received State Honours Awards.\nShe advised the corps members to refrain from being impolite because rudeness would get them nowhere but politeness would open doors that their degree or credentials could be able to open for them."
  },
  {
    "headline": "Two corps members die, 3 to repeat service year in Niger",
    "summarized_story": "As corps members perform their passing out parades across the states, the Niger State Coordinator of the National Youth Service Corps (NYSC), Hassan M. Taura has disclosed that two corps members of the 2021 Batch ‘B’ Stream 1 lost their lives within the service year.\nHowever, details of the affected corps members were not given including the cause of their deaths.\nA total of 926 corps members successfully completed the one year mandatory national service and three out of them were found wanting because they absconded from place of primary assignment and are to repeat the national service.\nMeanwhile, Niger state government has tasked the out-gone corps members to put into positive use all the skills acquired during the service year for self development and their immediate environment.\nRecall that year in, year out, the Nigerian government engages millions of fresh graduates in the mandatory service to their fatherland before they can go scouting for jobs and other human endeavours."
  },
  {
    "headline": "Odumeje: Apostle Johnson Suleman sends message to Anambra Governor, Soludo",
    "summarized_story": "Apostle Johnson Suleman of Omega Fire Ministries, Auchi, Edo State, on Thursday, sent a clear message to Governor Charles Soludo of Anambra State, urging him to condemn the manhandling of Pastor Chukwuemeka Ohanaemere, popularly known as Odumeje, by members of the Anambra State taskforce.\nSuleman also said that the viral video of Pastor Odumeje being assaulted by the operatives was very primitive and uncalled for, adding that they overstepped their boundaries.\nIn a tweet via his Twitter handle, the cleric said, “I just saw a video of pastor Odumeje being assaulted by operatives.\n“Those operatives over stepped their boundaries and I expect Governor Soludo to condemn it.\nhighly!.”DAILY POST reports had earlier reported that the Anambra State Government had demolished Odumeje’s church, the Mountain of Holy Ghost Intervention and Deliverance Ministry, located in the Onitsha area of the state."
  },
  {
    "headline": "16,800 school pupils to be captured in mass deworming exercise in FCT",
    "summarized_story": "No fewer than 16,800 school pupils drawn from the Kwali Area Council in Abuja, are to be captured in a deworming exercise sponsored by a pharmaceutical firm.\nThe exercise, which targets children between the ages of two to five years, will also be extended to 12 states of the federation.\nSpeaking at an event to flag off the deworming exercise, organised by the FCT Primary Healthcare Board in Kwali on Thursday, the marketing manager of Biomedical, Watson Olojo said the deworming exercise for rural children will contribute to their brain development.\nThere is a particular age group that is being targeted and that is between two to five years of school based pupils.\nwe appreciate this support because we are looking for partners to support the FCT primary health care in this intervention."
  },
  {
    "headline": "WAFCON 2022: Super Falcons beat Botswana 2",
    "summarized_story": "After Monday’s disappointing start against the Bayana Bayana of South Africa, the Super Falcons are back on track at the ongoing Women’s Africa Cup of Nations in Morocco.\nThe Super Falcons on Thursday night, defeated Botswana with two goals at the Prince Moulay Al-Hassan Stadium.\nThe Super Falcons will face Burundi on Sunday.\nIt is now a back-to-back victory for South Africa who opened the tournament with a win against champions Super Falcons of Nigeria.\nSouth Africa will face Botswana on Sunday."
  },
  {
    "headline": "DMO lists $1. 25b Eurobond on NGX The Nation Newspaper",
    "summarized_story": "The Debt Management Office (DMO) has listed the $1.\n250 billion Federal Republic of Nigeria Eurobond on the Nigeria Exchange Limited and the FMDQ Securities Exchange Limited.\nThe decision to list the Eurobond on the Nigerian Exchange Limited and the FMDQ Securities Exchange Limited, the DMO said is a demonstration of its commitment “to boosting the domestic capital market activities, as well as, creating opportunities for local players’.\nAccording to the DMO: “The Eurobond which was originally listed on the London Stock Exchange, was issued on approvals in this year’s Appropriation Act and subsequent approvals received from the Federal Executive council and the National Assembly’.\nThe DMO said the proceeds of the Eurobond were “used in financing capital projects in the Appropriation Act, and the proceeds contributed to an increase in Nigeria’s external reserves.”"
  },
  {
    "headline": "IPOB seeks transfer of Kanu to Southeast prison The Nation Newspaper",
    "summarized_story": "The Indigenous People of Biafra (IPOB) has asked Federal Government to transfer its leader, Nnamdi Kanu to a prison in the Southeast.\nThe call followed Tuesday’s attack on the Kuje prison.\nIn a statement by its Media and Publicity Secretary, Emma Powerful, IPOB alleged the Kuje attack was planned with certain security operatives to kill IPOB detainees in the prison.\n“Kuje prison attack was pre-planned with full knowledge of the decutity agencies.\nThe impostor president is aware of what happened in katsina and Kuje prison ."
  },
  {
    "headline": "I’m no longer Peter Obi’s running mate, says Doyin Okupe The Nation Newspaper",
    "summarized_story": "Former presidential aide, Doyin Okupe, has withdrawn as running mate to the presidential candidate of the Labour Party (LP) Peter Obi.\nOkupe’s name was submitted by the LP to meet up with the June 17 deadline fixed by INEC.\nAnnouncing his withdrawal, Okupe, in a Twitter post on Thursday, said he had tendered his withdrawal letter to the Independent National Electoral Commission (INEC) and told Nigerians to await his party’s decision on replacement.\nHe tweeted: “This afternoon I submitted my withdrawal letter from the position of the vice presidential candidate of the Labour Party, LP, to INEC (Independent National Electoral Commission).\nI feel greatly blessed to have been part of the foundation of success for the LP.”"
  },
  {
    "headline": "Northern Elders: politicians holding Nigeria hostage with ethnicity, religion The Nation Newspaper",
    "summarized_story": "The Northern Elders Forum (NEF) has expressed worry over the level politician play up religion and ethnicity in choosing their candidates.\n“Our politics now operates outside safe and tolerable boundaries, and the nation will pay dearly for the desperation and limitations of those who ought to show leadership and responsibility among our politicians.\n“Politicians are desperately shepherding Nigerians into two irreconcilable religious divides, all in a bid to garner undeserved advantages at the expense of religious tolerance and co-existence.\n“The ransom that will be paid to free our democratic process may be such that the nation cannot afford it.\n“Our politics has become an additional burden on the Nigerian citizen, even dwarfing the spreading insecurity, poverty and cynicism over the prospects of our survival as one nation."
  },
  {
    "headline": "Sultan seeks divine intervention to end rising security challenge",
    "summarized_story": "He said with 2023 general elections approaching, there was need to seek Allah’s intervention for stability, security, peace and development of the country.\n“Similarly, with 2023 general election fast approaching, we need to also seek Allah’s apt intervention for stability, security, peace and development of Nigeria.\n“The willingness to buy rams for Sallah is there.\nHe also identified security challenges, especially on the roads, as another factor contributing to the rising cost of transportation.\n“On the issue of security, many remote northern villages that we buy rams from have been invaded."
  },
  {
    "headline": "Senate fumes over Kuje Prisons terrorists’ attack",
    "summarized_story": "From Fred Itua, AbujaThe Senate has said Tuesday’s attack on the Kuje Medium Security Custodial Centre by terrorists speaks volumes about the failure of the country’s security architecture.\nAccording to the Senate President, an attack on the Kuje Medium Security Custodial Centre could only have been possible with the collaboration of insiders within the nation’s correctional system.\nHe faulted the Nigerian Correctional Service for not providing Closed Circuit Television (CCTV) at the Kuje facility and others across the country.\nSpeaking after an assessment of the correctional facility, Lawan said: “The attack on this correctional facility is symptomatic of the failure of security failure.\n“This is a medium security custodial center, how on earth in the FCT facility of this magnitude we don’t have CCTV?"
  },
  {
    "headline": "2023: Okupe withdraws as Obi’s running mate",
    "summarized_story": "By Chinelo ObogoFormer presidential spokesperson, Doyin Okupe, yesterday, disclosed he has submitted a withdrawal letter as running mate to Labour Party (LP) presidential candidate, Peter Obi.\nOkupe, in a post on his Twitter handle, said he submitted a withdrawal letter to the Independent National Electoral Commission (INEC) and that the LP national chairman would soon announce whom Obi’s running mate would be.\n“This afternoon, I submitted my withdrawal letter from the position of the vice presidential candidate of LP to INEC.\nThe former governor of Anambra State had previously submitted Okupe’s name to the electoral commission as his running mate to beat the June 17 deadline set by INEC.\nOkupe had earlier said his name has been submitted to INEC in Obi’s form but like the presidential candidate of the All Progressives Congress (APC), Bola Tinubu, he might be replaced later."
  },
  {
    "headline": "Anambra govt explains demolition of Prophet Odumeje’s church in Onitsha",
    "summarized_story": "From Jeff Amechi Agbodo, OnitshaThe Anambra State Government has explained yesterday’s demolition of illegal structures by its task force in parts of Onitsha, the commercial hub of the State.\nAffected by yesterday’s demolition exercise were some structures attached to the church building of controversial Prophet Chukwuemeka Ohanemere, popularly known as Odumeje.\n“The exercise, which is being carried out by a joint government task force, commenced from Bida Road by Modebe Avenue, Fegge Onitsha.\nThe structures were marked since April, 2022, and all developers and building owners were served notice to remove such illegal structures.\n“The exercise, which is being carried out by a joint government task force, commenced from Bida Road, by Modebe Avenue, Fegge Onitsha."
  },
  {
    "headline": "Bleak Sallah: Nigerians groan as fuel scarcity, high cost of rams hobble celebration",
    "summarized_story": "By Adewale SanyaoluThere are strong indications that this year’s Muslim Sallah celebration may be blighted by acute fuel scarcity, insecurity and the astronmic cost of rams across many states of the country.\nSome transport operators who spoke to Daily Sun in separate interviews lamented the high cost of Premium Motor Spirit, popularly called petrol.\nMeanwhile, the cost of rams across various markets have skyrocketed as sellers lamented about low patronage.\nFor his part, a popular ram seller at Kara market, Alhaji Yisa Kabiru, blamed the high cost of diesel for the high cost of rams.\nHe said transporters of ram from various parts of the North have increased what they hitherto charged for transportation cost."
  },
  {
    "headline": "NNL: Bendel Insurance Move Seven Points Clear, – THISDAYLIVE",
    "summarized_story": "Insurance took charge of the game early as they were awarded a penalty in the 5th minute.\nEcheter Deputy got the fourth goal for Bendel Insurance in the 78th minute from outside the 22m box.\n“Bendel Insurance actually do no belong to NNL, and we are happy we are going to join our mates (in terms of football) like Rangers and Kano Pillars.\nOn future plans when Bendel Insurance eventually qualify to play in the NPFL, Shaibu noted that “our players are good and good enough for the NPFL.\nAnd you can see today, four of our Bendel Insurance feeder team players featured in this match.”"
  },
  {
    "headline": "2nd MFM Women’s Basketball Championship Begins in Lagos – THISDAYLIVE",
    "summarized_story": "The second edition of the Dr & Dr (Mrs) D. K Olukoya Women’s Basketball Championship is scheduled to kick off in Lagos today with 12 teams in attendance battling for top prizes.\nThe 12 women’s basketball teams to feature in this pan Nigeria championship at the indoor sports hall of the National Stadium in Surulere, Lagos include; First Bank of Lagos, Air Warriors of Abuja, Inspector General of Police Queens of Abuja, Sunshine Angels of Akure, Mountain of Fire and Miracles Ministries Queens of Lagos, Achievers Queens from Bayelsa State amongst others.\nMinister of Youth and Sports Development, Sunday Dare and wife of Lagos State Governor, Dr Ibijoke Sanyo-Olu will lead other prominent Nigerians that includes the President of Nigeria Basketball Federation (NBBF), Engineer Musa Kida to the event sponsored by MFM General Overseer, Dr Daniel Olukoya.\nThe annual event is one of his many youth empowerment programmes from his famous 70 Points Youth Repositioning Agenda.\nThis Special edition to end next week Friday is being used to celebrate Dr Olukoya and his wife, Dr Folashade’s birthday born same date of July 15."
  },
  {
    "headline": "NOC Optimistic of Good Outing for Team Nigeria – THISDAYLIVE",
    "summarized_story": "President of the Nigeria Olympic Committee (NOC), Engr.\nHabu Ahmed Gumel, dropped this hint in Lagos while interacting with sports journalists during the 2022 Olympic Day Celebration held at the National Stadium Surulere Lagos.\nThese include travelling documents for their trip to the United Kingdom and that of accompanying officials.\nBesides the Commonwealth Games, Gumel also revealed that Nigeria will also be featuring at the Islamic Games holding from August 9to 18 in Konya, Turkey.\n‘I’m indeed optimistic that Nigeria will put up an excellent performance at both Games”, Gumel concluded."
  },
  {
    "headline": "Abdominal Injury Forces Nadal to Skip S’final Clash with Kyrgios – THISDAYLIVE",
    "summarized_story": "Rafael Nadal has withdrawn from his Wimbledon semi-final against Nick Kyrgios with an abdominal injury.\n“I have tried a lot of times in my career to keep going but it is obvious the injury will get worse,” he said.\nNadal confirmed he has a tear in his abdominal muscle which means he would not be able to be competitive over two matches.\nThe 22-time Grand Slam champion had practised at Wimbledon away from the media earlier on Thursday but then called a news conference.\nThe two-time Wimbledon champion had been on course for a calendar Grand Slam, having won the Australian and French Opens already this year."
  },
  {
    "headline": "National Sports Festival to be Expanded Soon, Says Dare – THISDAYLIVE",
    "summarized_story": "*Okowa showers praises on minister, marketerThere are strong indications that the National Sports Festival will be expanded in future with about 10 countries from various parts of Africa participating.\nOver 16,000 athletes from across the country will converge on Delta State to compete for medals in 40 sports from November 2to 15, 2022.\nIt is our own mini-Olympics.”Also speaking during the unveiling ceremony, the Governor of Delta State, Dr Ifeanyi Okowa, showered encomiums on Dare for his commitment to sports development in Nigeria.\nGovernor Okowa congratulated the sports minister for the giant strides made in sports so far for the country.\nHe has brought a high level of commitment to sports development in Nigeria yet he remains so humble in his approach."
  },
  {
    "headline": "ISWAP Terrorists Threaten To Attack More Prisons In Nigeria, Other Countries",
    "summarized_story": "The Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād, has vowed to attack more prisons in Nigeria and other parts of the world.\nThe group had earlier claimed responsibility for the attack on Kuje Prison in Abuja.\nISWAP SoldiersSaharaReporters on Tuesday reported that the facility was under attack by gunmen.\nThe first group stayed at the prison gate, the second one raiding the prison facility while the last one was tasked with blocking the nearby roads.\nISWAP added that its fighters would continue attacking prisons in different parts of the world."
  },
  {
    "headline": "ISWAP Terrorists Threaten To Attack More Prisons In Nigeria, Other Countries",
    "summarized_story": "The Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād, has vowed to attack more prisons in Nigeria and other parts of the world.\nThe group had earlier claimed responsibility for the attack on Kuje Prison in Abuja.\nISWAP SoldiersSaharaReporters on Tuesday reported that the facility was under attack by gunmen.\nThe first group stayed at the prison gate, the second one raiding the prison facility while the last one was tasked with blocking the nearby roads.\nISWAP added that its fighters would continue attacking prisons in different parts of the world."
  },
  {
    "headline": "Khalid al-Barnawi, Boko Haram Leader Behind UN Building Bombing, Among 64 Inmates Who Escaped From Kuje Prison",
    "summarized_story": "Offon Khalid al-Barnawi, Ansaru factional leader who bombed the United Nations Headquarters, Abuja, has been revealed as one of the 64 Boko Haram inmates set free by terrorists from the Kuje Prison on Tuesday.\nThe Ansaru leader, factional Islamic terrorists, Khalid al-Barnawi, who masterminded the bombing of the UN Headquarters in Abuja in 2011, was among the inmates which the terrorists released.\nSources added that he was regarded as one of the most valuable assets of the Boko Haram terrorists’ sect.\nThe release of Al-Barnawi may signal a significant increase in Boko Haram terrorist activities in Nigeria.\nSee Also Sahara Reporters Kuje Prison Attack: US, UK Advice Citizens To Avoid Abuja Airport Road Over Likely Crime Increase, Kidnap ThreatThe Minister of Defence, Bashir Magashi, had on Wednesday said the 64 Boko Haram suspects who escaped from the Kuje Prison after the Tuesday’s night attack were still at large."
  },
  {
    "headline": "Khalid al-Barnawi, Boko Haram Leader Behind UN Building Bombing, Among 64 Inmates Who Escaped From Kuje Prison",
    "summarized_story": "Offon Khalid al-Barnawi, Ansaru factional leader who bombed the United Nations Headquarters, Abuja, has been revealed as one of the 64 Boko Haram inmates set free by terrorists from the Kuje Prison on Tuesday.\nThe Ansaru leader, factional Islamic terrorists, Khalid al-Barnawi, who masterminded the bombing of the UN Headquarters in Abuja in 2011, was among the inmates which the terrorists released.\nSources added that he was regarded as one of the most valuable assets of the Boko Haram terrorists’ sect.\nThe release of Al-Barnawi may signal a significant increase in Boko Haram terrorist activities in Nigeria.\nSee Also Sahara Reporters Kuje Prison Attack: US, UK Advice Citizens To Avoid Abuja Airport Road Over Likely Crime Increase, Kidnap ThreatThe Minister of Defence, Bashir Magashi, had on Wednesday said the 64 Boko Haram suspects who escaped from the Kuje Prison after the Tuesday’s night attack were still at large."
  },
  {
    "headline": "Sunday Dare’s Monumental Disaster As Sports Minister (Part 1), By Sylvanus Ofekun",
    "summarized_story": "It is now an open secret that the reign of Mr. Sunday Akin Dare (SAD), as Minister of Sports is a monumental disaster, a miserable adventure and an embarrassment to the Federal Republic of Nigeria.\nThe highly venerated office of a Minister is being treated with disdain, no thanks to SAD’s pettiness and incompetency.\nThe Minister did set up a parallel AFN, and disregarded the constitutionally recognized AFN board, despite two concurrent courts judgments.\nI will agree with those speculating the Minister (Dare) is on a vendetta for the girls exposing the crises of honesty rocking the issue of their money which was applied and approval gotten by me.\"\nOnly recently, the Minister recruited some mediators to plead with some adversaries, especially those who petitioned him to anti graft agencies."
  },
  {
    "headline": "'One killed, 13 injured' as NAF airstrike 'hits residents' in Katsina community",
    "summarized_story": "Thirteen residents of Kunkuna village in Safana LGA of Katsina state have been reportedly injured following an air strike conducted by the Nigerian Air Force (NAF).\nHaruna said 13 people were injured and are currently receiving medical attention at the Katsina Teaching Hospital and Dutsinma General Hospital.\nAccording to him, gunmen invaded the community on the same day, and killed 12 residents, while several others sustained injuries.\nEfforts to reach Edward Gabkwet, NAF spokesman, were unsuccessful as he didn’t respond to calls or text messages.\nAdvertisementMeanwhile, the development comes weeks after a NAF fighter jet targeting insurgents reportedly killed six children in Kurebe area of Shiroro LGA in Niger state."
  },
  {
    "headline": "'One killed, 13 injured' as NAF airstrike 'hits residents' in Katsina community",
    "summarized_story": "Thirteen residents of Kunkuna village in Safana LGA of Katsina state have been reportedly injured following an air strike conducted by the Nigerian Air Force (NAF).\nHaruna said 13 people were injured and are currently receiving medical attention at the Katsina Teaching Hospital and Dutsinma General Hospital.\nAccording to him, gunmen invaded the community on the same day, and killed 12 residents, while several others sustained injuries.\nEfforts to reach Edward Gabkwet, NAF spokesman, were unsuccessful as he didn’t respond to calls or text messages.\nAdvertisementMeanwhile, the development comes weeks after a NAF fighter jet targeting insurgents reportedly killed six children in Kurebe area of Shiroro LGA in Niger state."
  },
  {
    "headline": "'How on earth is there no CCTV?' -- Lawan fumes over Kuje prison attack",
    "summarized_story": "Senate President Ahmad Lawan has expressed reservations over the security setup at the Kuje correctional facility in the federal capital territory (FCT).\n“The attack on this correctional facility is symptomatic of the failure of security failure.\nThe attack is only a culmination of the failure,” Lawan said, according to a statement by Ezrel Tabiowo, his media aide.\nAdvertisement“This is a medium security custodial center.\nIt means we can say that all other medium security centers across the country do not have CCTV."
  },
  {
    "headline": "'How on earth is there no CCTV?' -- Lawan fumes over Kuje prison attack",
    "summarized_story": "Senate President Ahmad Lawan has expressed reservations over the security setup at the Kuje correctional facility in the federal capital territory (FCT).\n“The attack on this correctional facility is symptomatic of the failure of security failure.\nThe attack is only a culmination of the failure,” Lawan said, according to a statement by Ezrel Tabiowo, his media aide.\nAdvertisement“This is a medium security custodial center.\nIt means we can say that all other medium security centers across the country do not have CCTV."
  },
  {
    "headline": "Kuje attack: I'm disappointed in Nigeria's leaders... Buhari should take responsibility, says Ndume",
    "summarized_story": "Ali Ndume, lawmaker representing Borno south senatorial district, says he is “disappointed” in the response of leaders regarding the attack on a correctional facility in Kuje council area of the federal capital territory (FCT).\nAdvertisement“I’m really disappointed with the response of so many leaders.\nAnd it’s our responsibility; the responsibility of the government is the security and welfare of its citizens.\n“And you have leaders respond as if it’s a casual thing; as if it’s not their responsibility.\nI feel pained to be called a senator and I’m almost like helpless.”He added that President Muhammadu Buhari should do more on efforts to tackle insecurity."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "These founders are closing delivery gaps in Rwanda’s capital",
    "summarized_story": "During the 2020 lockdown, Anselme Mucunguzi, 30, noticed a gap in the technology needed to service last mile delivery in Kigali, the Rwandan capital.\nSo, in January 2021, he founded Nisawa, a last-mile delivery service.\nBirori had wanted Nisawa to transition to an online marketplace while Mucunguzi insisted on remaining in the last-mile delivery line.\nAll a seller needs to do to initiate a delivery is supply the receiver’s phone number on the Vanoma website.\nNairobi, he explains, already has plenty of delivery products—Uber and Bolt, for example—so Vanoma will not be expanding there just yet."
  },
  {
    "headline": "How Nigerian startups can build healthier cultures",
    "summarized_story": "Earlier in May, TechCabal asked 5 employees at different startups what was important to them when considering a job offer.\nBut they ranked something else even higher: company culture.\nTurnover costs startups up to 20% of an employee’s annual salary, and for managerial roles, the costs will go up.\nBucknor uses the 70–20–10 model to explain why it’s important that startups learn how to give constructive feedback.\nThe way you address those needs impact your relationship with the children.”The right incentives, according to Samson-Grace, can boost a startup’s culture."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "CSO charges INEC chair, Edo REC on improved voters’ registration in Edo North – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestA civil society organisation, the Network of Civil Society Organisations of Nigeria (NOCSON) has urged the Independent National Electoral Commission (INEC) to deploy more registration machines to Edo North Senatorial District to address the insufficiency in human and material resources in the wake of the surge in registrations in the senatorial district.\nAccording to him, “It has come to the attention of NUCSON that the Edo North Senatorial District is lagging behind in the Continuous Voter Registration (CVR).\nThis is evident from the feeders from our foot soldiers and members, signifying strongly that the ongoing INEC registration exercise in the country is not being pursued vigorously in the district.\n“The statistical distribution across the six local government areas of the district reveals that the data from the district is deplorably disproportionate relative to other districts in the state.\nOur findings reveal that there are not enough registration centres, INEC registration machines and personnel available in the district, thereby limiting access for potential voters to register.”“This scenario portends both disenfranchisement of Edo North voters willing to vote in the 2023 general elections and undermining their electoral rights."
  },
  {
    "headline": "Obaseki celebrates Okowa at 63, lauds contributions to national devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has congratulated his Delta State counterpart, Dr. Ifeanyi Okowa, on his 63rd birthday, lauding his contribution to the development of Delta State and Nigeria.\nObaseki said: “On behalf of the Government and people of Edo State, I congratulate my dear brother and friend, Governor Ifeanyi Okowa, as he celebrates his 63rd birthday.\n“Governor Okowa has demonstrated commitment to the betterment of his people and continues to serve as a democrat who believes in the unity and progress of Nigeria.”He added, “As we prepare for the 2023 Presidential election, I am confident that as Vice Presidential candidate of our great party, the Peoples Democratic Party (PDP), Governor Okowa will have the opportunity to extend his impactful programmes across Nigeria.\nI wish you excellent health and God’s continued guidance as we all work to rescue Nigeria.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Okowa Has Redefined Governance In Delta State – BELLO – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAsaba – The Financial Secretary of the Peoples Democratic Party ( PDP) in Delta State, Hon.\nCollins Bello, has said that Governor Ifeanyi Okowa had redefined governance in the state.\nAccording to him, “Governor Okowa has fulfilled his promise to Deltans through massive developmental and transformational strides across the state.\n“The Governor of Delta state and Vice-Presidential candidate of the PDP has given us the enablement to give back to our constituents.\nTwo aides to the Delta Governor , Hon."
  },
  {
    "headline": "CMPG Berates FG Over Refusal To Sign Agreement, Adopt UTAS – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAsaba – Coalition for Media Politics and Governance, CMPG, has berated President Mohammadu Buhari and the federal government over wilful and deliberate refusal to sign the recent agreement reached with the Academic Staff Union of Universities, ASUU, describing it as gross disservice to the nation.\nAccording to the group, It has become crystal clear that President Buhari and APC national government does not recognise education as an integral part of national development, urging Mr President to honourably resign over his abysmal performance in office.\n“CMPG recalls Buhari’s campaign promises in 2015, wherein he and the All Progressives Congress, APC, promised to develop and transform the educational sector under the CHANGE mantra.\nOur students are in tiers, demoralised, confused and frustrated with little or no hope for the future.\n“CMPG calls on all well meaning Nigerians and the international community to prevail on President Buhari and APC national government to have mercy on the helpless and frustrated millions of Nigerian students by adopting the credible UTAS payment system, and to also sign agreement reached with ASUU."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "‘NGX remains the preferred listing platform for capital raising’",
    "summarized_story": "Capital market stakeholders have commended NGX for providing a vibrant listing platform for government and corporates to meet their business objectives.\nThis was stated during the NGX CEO Roundtable held on Thursday, 7 July 2022.\nThe event, themed, “Creating the Enabling Ecosystem for Accessing Capital from the Nigerian Capital Markets” brought together key stakeholders in the capital market ecosystem to address and proffer solutions to the challenges faced by issuers in raising capital in the market.\nHe mentioned that NGX’s corporate governance requirements and strong guidance provide credibility around the capital market and grant access to the wider public.\nNGX CEO Roundtable is a platform that ensures continuous dialogue with key stakeholders and provides strategic solutions to economic issues for follow-up implementation by The Exchange in its capital market advocacy role."
  },
  {
    "headline": "Ardova reports N63 billion revenue for Q1 2022",
    "summarized_story": "Ardova Plc has released its 2021 Audited Financial Statements and Q1 2022 Unaudited Financial Results.\nThe group posted 49.89% growth in revenue to N62.934 billion for the first quarter ended March 2022 as against N41.986 billion in 2021.\nThe company also posted a profit of N1.54 billion in the year ended 31 December 2021.\nThe company noted that in Q1 2022, AP’s performance shows significant improvements as yields from investments made in 2021 contribute to growth in revenue, sales volume, and profits.\nArdova won a license to operate an Oil Marginal Field following a successful bid in the 2020 round, thereby increasing the company’s potential for foreign currency revenue generation."
  },
  {
    "headline": "Updated: Labour Party to unveil Datti Baba-Ahmed as Peter Obi’s running mate",
    "summarized_story": "Labour Party is set to unveil Kaduna born politician, businessman and philanthropist, Yusuf Datti Baba-Ahmed as running mate to its presidential candidate, Mr. Peter Obi.\nBaba-Ahmed will be unveiled by the party’s national chairman on Friday, according to sources.\nDr. Doyin Okupe, the party’s placeholder vice presidential candidate had earlier announced his withdrawal from the position, noting that the substantial candidate would be announced soon.\nMore to follow.."
  },
  {
    "headline": "Kidney Failure: Eedris Abdulkareem speaks from hospital bed [VIDEO]",
    "summarized_story": "Eedris Abdulkareem, Nigerian pop star battling kidney failure has shared a video of himself at a hospital undergoing his weekly dialysis.\nThe singer on Wednesday disclosed that he was battling kidney failure and will have a surgical operation at the end of July.\n”I sincerely want to thank and appreciate those who have reached out to me and my family in support.\n” Your assistance, kind gestures, get well soon wishes and prayers are highly appreciated and therapeutic, to say the least.\nThank you so much and God Bless you!”"
  },
  {
    "headline": "Eid-el-Kabir: FG declares Monday, Tuesday as public holidays",
    "summarized_story": "Nigeria’s federal government has declared July 11 and 12 (Monday and Tuesday) as public holidays to mark this year’s Eid-el-Kabir celebration.\nAregbesola congratulated all Muslims and Nigerians both at home and in the Diaspora on the occasion.\n“As soon as you ‘See Something Do N-Alerts’, most especially during this festival,” he noted.\nHe also enjoined Nigerians to be vigilant and observant of intruders in their communities: “We must all take responsibility for the security of lives and properties as we celebrate this year’s festival.\nHe assured Nigerians of government’s protection of all under the law, maintenance of law and order and keeping the peace in all situations."
  },
  {
    "headline": "State Of The Nation: NUJ Declares Worsening Insecurity Unacceptable",
    "summarized_story": "Nigeria Union Of Journalists (NUJ) has decried the geometric rate of attacks by terrorists/bandits in different parts of the country, describing the unfortunate development as unacceptable.\nAddressing a press conference yesterday in Abuja on the “State of the Nation”, president, NUJ, Comrade Chris Isiguzo said the security agencies must rise to the occasion across the nation, especially in Imo state where some arrests have been reportedly made with suspects making mind-boggling revelations.\nThe Correctional Facility was breached for hours without any reinforcement being sent after the Soldiers and other guards were overpowered.\n“This is the frightening dimension of security challenges in the Country today.\nIsiguzo lamented the ethnic dimensions the campaigns ahead of INEC approved timetable and support for candidates are assuming."
  },
  {
    "headline": "State Of The Nation: NUJ Declares Worsening Insecurity Unacceptable",
    "summarized_story": "Nigeria Union Of Journalists (NUJ) has decried the geometric rate of attacks by terrorists/bandits in different parts of the country, describing the unfortunate development as unacceptable.\nAddressing a press conference yesterday in Abuja on the “State of the Nation”, president, NUJ, Comrade Chris Isiguzo said the security agencies must rise to the occasion across the nation, especially in Imo state where some arrests have been reportedly made with suspects making mind-boggling revelations.\nThe Correctional Facility was breached for hours without any reinforcement being sent after the Soldiers and other guards were overpowered.\n“This is the frightening dimension of security challenges in the Country today.\nIsiguzo lamented the ethnic dimensions the campaigns ahead of INEC approved timetable and support for candidates are assuming."
  },
  {
    "headline": "JUST-IN: Troops Kill Terrorist Commanders, Others In Borno",
    "summarized_story": "Troops of Operation Hadin Kai in continuation of a subsidiary operation Desert Sanity, have neutralised top Boko Haram Terrorists/Islamic State West Africa Province (ISWAP) fighters including their top commanders in Borno State.\nThe Nigerian Army on its official social media handle said the feat was recorded on Thursday, July 7, 2022 along Dikwa-Gamboru highway in the State.\nThe troops also captured several weapons and ammunitions from the terrorists.\nThe Nigerian Army headquarters wrote: “Operation Desert Sanity records another success today 7 July 2022 as troops neutralized several ISWAP/BokoHaram terrorists including top commanders during an aggressive clearance operation around Dikwa-Gamboru highway in Borno State.\n“Several weapons and ammunition were captured.”"
  },
  {
    "headline": "JUST-IN: Troops Kill Terrorist Commanders, Others In Borno",
    "summarized_story": "Troops of Operation Hadin Kai in continuation of a subsidiary operation Desert Sanity, have neutralised top Boko Haram Terrorists/Islamic State West Africa Province (ISWAP) fighters including their top commanders in Borno State.\nThe Nigerian Army on its official social media handle said the feat was recorded on Thursday, July 7, 2022 along Dikwa-Gamboru highway in the State.\nThe troops also captured several weapons and ammunitions from the terrorists.\nThe Nigerian Army headquarters wrote: “Operation Desert Sanity records another success today 7 July 2022 as troops neutralized several ISWAP/BokoHaram terrorists including top commanders during an aggressive clearance operation around Dikwa-Gamboru highway in Borno State.\n“Several weapons and ammunition were captured.”"
  },
  {
    "headline": "Gov Sanwo-Olu Suspends Lagos Abortion Guidelines",
    "summarized_story": "The Lagos State governor, Babajide Sanwo-Olu, has directed the suspension of the state’s guidelines on safe termination of pregnancy.\nThe release of the state guidelines on abortion on June 28 had generated lots of heated debates and controversies, with religious bodies calling for its withdrawal.\nAbayomi noted that the guidelines focus was on creating the opportunity to reduce maternal mortality in line with existing laws.\nThe 40-page document titled, “Lagos State Guidelines on Safe Termination of Pregnancy for Legal Indications,” was issued by the ministry’s Directorate of Family Health and Nutrition.\nThe document released on June 28 sets out guidelines for safe termination of pregnancy within the ambit of the criminal law of Lagos State."
  },
  {
    "headline": "Baba-Ahmed, Obi's new running mate: Facts about him",
    "summarized_story": "Labour Party (LP) is reportedly set to unveil Senator Yusuf Datti Baba-Ahmed as the Vice Presidential (VP) running mate of its presidential candidate, Dr. Peter Obi.\nIt was gathered that LP will officially announce Baba-Ahmed as Obi’s running mate on Friday.\nObi’s supporters on Twitter have been jubilating over the catch by their idol, as they lavished praises on him.\nBaba-Ahmed is from the prominent Baba-Ahmed family of Zaria and graduated from the University of Maiduguri.\nBaba-Ahmed was popular for his principled activism.During the administration of President Olusegun Obasanjo, he was among lawmakers who opposed letting Obasanjo run for a third term."
  },
  {
    "headline": "30 suspects arrested over Edo cult clashes",
    "summarized_story": "By Jethro IbilekeThirty suspects, including seven females, were on Thursday paraded by the Edo state police command, over alleged involvement in the recent cult-related clashes that claimed several in Benin metropolis.\nIt was gathered the suspects were arrested on July 6 during police raid on criminals hideouts at Siloko, Ogbiyokho and Lawani and New Benin axis .\nThe command’s spokesman, SP Chidi Nwabuzor, who paraded the suspects, said they were arrested following the recent cult related clashes in the state.\n“During the raid, 30 suspects comprising 23 males and seven females were arrested.\nThe suspects confessed to being members of various cult groups in the state,” he said."
  },
  {
    "headline": "Notorious kidnap kingpin, Wadume among escapees after Kuje Prison attack",
    "summarized_story": "It was gathered that Wadume, who has been in custody at Kuje prison since 2020, has not been found and was not among prisoners recaptured or those who voluntarily returned after the attack on the Kune Prison facility.\nHamisu Wadume was arrested by IRT operatives in Takum, Taraba State, for terrorising people of the state with his criminal activities.\nThe soldiers, who also rescued Wadume from the IRT operatives, were said to have carried out the operations on the orders of their Commanding Officer.\nAfter his rescue by the soldiers, Wadume took to his heels and escaped from Taraba State, eliciting public outrage.\nHe was later rearrested by the IRT operatives at Kano, brought to Abuja and charged to court, where he was remanded in prison custody."
  },
  {
    "headline": "Delta Gov Poll: Court disqualifies PDP candidate, Oborevwori",
    "summarized_story": "The Federal High Court sitting in Abuja, on Thursday, disqualified the candidate of the Peoples Democratic Party, PDP, Sherrif Oborevwori, from contesting the 2023 governorship election in Delta State.\nThe court, in a judgement that was delivered by Justice Taiwo Taiwo, held that Oborevwori lacked the legal competence to participate in the election.\nThe verdict followed a suit that was brought before the court by an aggreived member of the party, Mr. Olorogun Edevbie.\nHe told the court that PDP violated both its constitution and the Electoral Guidelines, during its state congress that produced Oborevwori as its flagbearer for the forthcoming gubernatorial election.\nMore so, the Plaintiff, sought an order to restrain Oborevwori from parading or carrying himself as the governorship candidate of the PDP in the state."
  },
  {
    "headline": "BREAKING: Gov. Soludo Demolish Prophet Odumeje’s Church In Anambra(Video)",
    "summarized_story": "The Anambra state government on Thursday has demolished a church owned by the general overseer of the Mountain of Holy Ghost Intervention Deliverance Ministry World Miracle Center, prophet Chukwuemeka Ohanemere, also known as odumejeOdumeje was equally beaten up by officials of Anambra state government for obstructing the demolition process.\nIt would be recalled that the ministry located at no 88B Bida Road, Fegge, Onitsha, was marked by the Anambra State government for demolition in April.\nThe church building is reportedly sitting on a huge canal and obstructing waterways, prompting the government to order its removal as an illegal building in line with Soludo’s plan to demolish over 200 buildings in Onitsha blocking the drainage linking the River Niger.\nIn the video obtained by NEWS DIRECT on Thursday, government officials were seen hitting the pastor who was later bundled out of the church premises.\nWATCH VIDEO BELOW:"
  },
  {
    "headline": "Eid-El Kabir: FG Declares July 11th And 12th As Public Holidays",
    "summarized_story": "The Federal Government has declared Monday 11th and Tuesday 12th July, 2022, as public holidays to mark this year’s Eid-el-Kabir celebration.\nThe Minister of Interior, Ogbeni Rauf Aregbesola, who made the declaration on behalf of the Federal Government on Thursday, congratulated all Muslims and Nigerians both at home and in the Diaspora on this occasion.\nHe also enjoined all Nigerians to be vigilant and observant of intruders in their communities.\n“We must all take responsibility for the security of lives and property as we celebrate this year’s festival,” he admonished.\nAregbesola craved the indulgence of every Nigerians “to come together, put heads, hearts and all we have together, in order to achieve relative peace for harmonious coexistence and put an end to insecurities in Nigeria”."
  },
  {
    "headline": "[Breaking] WAFCON 2022: Super Falcons bounce back, beat Botswana",
    "summarized_story": "After succumbing to South African defeat, Nigeria’s Super Falcons on Thursday bounced back and beat Botswana 2-0 in the Women African Cup of Nations (WAFCON 2022) taking place in Morocco.\nThe team coached by Waldrum did miss Asisat Oshoala who has been ruled out of the tournament due to injury.\nThe Nigerian team are now second place in Group C behind soar-away leaders South Africa.\nBotswana, 4-2 winners over Burundi on the opening day, were stuck in second place following the Super Falcons’ 1-2 reverse against the Banyana Banyana.\nThe Super Falcons will on Sunday come up against their counterparts from Burundi, with a win certain to guarantee a place in the quarter-finals of the championship."
  },
  {
    "headline": "2023: Why Peter Obi prefer young northerner as running mate – Official",
    "summarized_story": "Presidential candidate of the Labour Party, Peter Obi has picked a Northerner as his running mate ahead of the 2023 general election.\nPeter Obi picked Senator Yusuf Datti Baba-Ahmed as his running mate.\nThe LP chairman made this known on Thursday, saying that the party will unveil Baba-Ahmed as the vice-presidential candidate on Friday.\nHe revealed that the unveiling was scheduled for July 7, but was postponed to July 8, because Obi, who was scheduled to return to Abuja from Maiduguri on Thursday afternoon, was delayed due to a flight cancellationShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Breaking: Peter Obi set to unveil presidential running mate ahead 2023 general election",
    "summarized_story": "Labour Party presidential candidate Peter Obi will on Friday disclosed a substantive running mate.\nThis is after Doyin Okupe, the placeholder vice-presidential candidate of the party announced his withdrawal from the race in 2023.\nHe wrote: “This afternoon I submitted my withdrawal letter from the position of the Vice Presidential candidate of the Labour Party to INEC.\n“A replacement will be announced by the national chairman of the party shortly.\nI feel greatly blessed to have been part of the foundation of success for the Labour Party.“Share this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "FG to secure Nigeria ownership of maritime industry",
    "summarized_story": "By Naomi DouglasFederal Government is set to sack jobs in the shipping industry dominated by foreigners that own several shipping lines operating in Nigeria.\nIn its bid to rid the industry of this feat, the FG has reaffirmed Commitment to establish a national shipping line.\nHighlights of the event was hinged on the importance of Nigerian ownership of shipping activities within the country in order to reap the full economic benefits of the maritime sector.\nRepresented by the Director of Procurement, Useni Adamu, Saraki emphasised the need for capacity building in the maritime industry.\n“The present administration is looking into ways of encouraging the establishment of a private sector-driven national shipping line to ensure maximum exploitation of the potentials in our maritime industry."
  },
  {
    "headline": "Nigeria’s Economic Diversification: Value addition in solid minerals sector will spur industrialization- DG NSRMEA",
    "summarized_story": "By Palma IleyeDirector General, National Steel Raw Materials Exploration Agency, NSRMEA, Engr, Dr. Umar Albarka Hassan, has said that value addition in iron and steel production was not only for the purpose of revenue generation but will also spur industrialization and investment rates in the country.\nWhen you talk about steel production it is actually extracting iron ore and converting it into steel which is also value addition.\nAnd our mandate is to source for materials for iron and steel production and ofcourse adding value.\nWhen you talk about other minerals that are exploited example gold and other minerals we have established smelting companies to create value addition to such minerals.\nAlso we have established Manganese resources located in Cross River and Kogi State we have also established and earmarked local sources deposits in Zamfara State,” he added."
  },
  {
    "headline": "NGSA, NMCO, AG Vision others top The Truth’s most impactful mining sector entities of 2022",
    "summarized_story": "By Palma IleyeNigerian Geological Survey Agency, NGSA, the Nigeria Mining Cadastre Office, NMCO, AG Vision and seven others have emerged as Truth-Afrique 2022 impactful companies contributing to the growth of Nigeria mining sector.\nThe organisation however said that no state government met the criteria for inclusion in the list.\nKadiri said state governments were not doing enough in the quest to jointly pursue the realisation of the Roadmap for Growth and Development of the Nigerian mining sector.\nAccording to him, “None of the 36 State governments satisfied the criteria for organisation ten most impactful mining sector entities of 2022.\nHe therefore congratulated the entities that made the list and urged them to continue to contribute to the growth and development of the Mining and Mineral sector of Nigeria."
  },
  {
    "headline": "MMSD task staff on dedication to duty for improved productivity",
    "summarized_story": "has called on Civil Servants to be dedicated to duty for improved productivity.\nAdegbite made the call during the celebration organized by the ministry to commemorate the 2022 African Public Service Day in Abuja.\nShe told the workers that the occasion also affords the opportunity to specially acknowledge members of staff that have distinguished themselves through outstanding performance.\nUmar Adamu Tsoho who was honoured with the “Presidential Public Service Award” by the OHCSF for outstanding service.\nIt is indeed a noble achievement to successfully exit the Federal Civil Service through retirement."
  },
  {
    "headline": "Economy Diversification: Why Nigeria’s mining sector offers robust economic potential- Adegbite",
    "summarized_story": "“Let me emphasis that, investment in the minerals and mining sector by stakeholders is a patriotic duty of every citizen who believe in the Nigerian Project.\nThe Federal government is developing a well governed mining sector with sustainable capacity and has also articulated a roadmap to address some of the identified challenges in the mining sector.\nThe initiatives and strategies outlined in the roadmap are designed largely to make the mining and minerals sector an irresistible destination for global capital.\nIn addition, developmental plans should take into cognizance the overall development aspirations of the State alongside the prospects and challenges of mining activities“The Mining sector to significantly contribute to Nigeria’s economy cannot be over-emphasized.\nKey programs of relevance to the sector must be critically and more robustly assessed by qualified professionals in the mix of our national development."
  },
  {
    "headline": "Insecurity: Buhari Should Be Talking To Nigerians, Not Issuing Statements – Ali Ndume",
    "summarized_story": "﻿Borno State Senator and a chieftain of the All Progressives Congress, Ali Ndume, on Thursday said President Muhammadu Buhari should directly address the nation on the matter of insecurity, rather than issuing statements through his media advisers.\nThe Senator made the comment while responding to questions on Channels Television’s Politics Today.\n“When it comes to issues like these, it is the President himself that is supposed to be talking to Nigerians, not some press adviser.\nREAD ALSO: ‘Disappointed’ Lawan Says No CCTV In Kuje Prison“The President, of course, should be taking responsibility .\nPresident Muhammadu Buhari visited the custodial centre on Wednesday, expressing regret over the attack."
  },
  {
    "headline": "‘Disappointed’ Lawan Says No CCTV In Kuje Prison",
    "summarized_story": "﻿Senate President Ahmad Lawan on Thursday said he was disappointed that there were no Closed-circuit television (CCTV) devices at the Kuje medium-security custodial centre in Abuja.\n“Now this is a medium security custodial centre.\nIt means we can say that all other medium security custodial centres across the country do not have CCTV.\nSenate President, Ahmad Lawan paid a visit to the Nigeria Correctional Services facility in Kuje on Thursday.\nTerrorists stormed the Kuje facility on Tuesday night, allowing hundreds of prisoners to escape, including Boko Haram members."
  },
  {
    "headline": "Ekweremadu: Kidney Donor Not Underage, Says UK Court",
    "summarized_story": "﻿The Westminster Magistrates Court, the United Kingdom on Thursday accepted that the kidney donor in the case of former Deputy Senate President, Ike Ekweremadu and his wife, Beatrice is not a minor.\nEkweremadu and his wife were arrested by the British police on June 23 on allegations of human trafficking and organ harvesting that violate the country’s Modern Slavery Act.\nREAD ALSO: Alleged Organ Harvesting: Ekweremadu, Wife Plead Not Guilty To ChargesThe police authorities had accused the lawmaker of conspiring to bring a child to the United Kingdom for organ harvesting, saying the victim was a 15-year-old boy.\nDuring the continuation of the case, the prosecution accepted that he is 21 years old, contrary to earlier claims that he is 15 years old.\nGiving an update from the court’s premises on Thursday, Channels Television’s correspondent, Juliana Olayinka, said the court accepted that the kidney donor in Ekweremadu’s case is not a minor."
  },
  {
    "headline": "Boris Johnson Agrees To Resign As Prime Minister",
    "summarized_story": "﻿British Prime Minister, Boris Johnson, on Thursday finally agreed to step down as Britain’s prime minister.\nThe Tory leader announced his resignation this afternoon at 10, Downing Street, London.\n“It is clear now the will of the parliamentary Conservative Party that there should be a new leader of that party and therefore a new prime minister,” Mr Johnson announced.\nA Conservative leadership race will hold this summer and a new PM will be in place in time for the Tory party conference in October.\nThe Prime Minister also asserted that he tried to persuade his colleagues that it would be “eccentric” to change government when such a mandate is at hand, adding, however, that he regrets not being successful in those arguments."
  },
  {
    "headline": "Ekiti Election: SDP’s Segun Oni Challenges APC’s Victory At Tribunal",
    "summarized_story": "The candidate of the Social Democratic Party, SDP, in the June 18 governorship election in Ekiti State, Mr. Segun Oni, has submitted his petition against the outcome of the election at the Election Petitions Tribunal in Ado the Ekiti state capital.\nOni was accompanied to the secretariat of the Election Petitions Tribunal Thursday evening by his legal team and SDP state Chairman and chieftains to submit the over 1,000-page petition.\nREAD ALSO: Why Segun Oni Won’t Accept Outcome Of Ekiti Election – SpokesmanThe SDP candidate did not speak to the content of the petition but simply said that the move is to defend the sanctity of the system.\nBut the leader of his legal team said the petition will challenge the eligibility of the Governor-elect, Mr Oyebanji to contest the election and question the actual victory attributed to him in the poll."
  },
  {
    "headline": "Updated: Segun Oni petitions Tribunal over Ekiti Guber result",
    "summarized_story": "The Candidate of the Social Democratic Party at the June 18 Governorship Poll, Segun Oni Has filed a Petition Challenging the result of the Poll which was announced in favour of the All progressives Congress Candidate (APC), Biodun Abayomi Oyebanji.Submitting his Petition at the State High Court, the Former Governor says he is of the believe that he won the election and his petition will prove sameHead of the Legal Team, Obafemi Adewale says the Candidate is challenging the result based on irregularities before and during the election and Questions specifically the Legality of the announced Candidate.\nAdvertisementIt could be recalled that Segun Oni was the runner up at the Election where he polled a total of 82,211 votes against the Winner, Biodun Oyebanji of the APC as announced by INECAdvertisement"
  },
  {
    "headline": "Ekiti 2022: Oni files suit against Oyebanji's victory",
    "summarized_story": "The Candidate of the Social Democratic Party at the June 18 Governorship poll, Segun Oni has filed a petition challenging the result of the Poll which was announced in favour of the All progressives Congress Candidate (APC), Biodun Abayomi Oyebanji.\nDetails shortlyAdvertisementAdvertisement"
  },
  {
    "headline": "Ondo youths movement drums support for NNPP Assembly Candidate, Kolawole Oluwaseyi -",
    "summarized_story": "AdvertisementAlabi said Akoko North-West youths are backing his candidacy, because of his antecedents and love for development of the youths.\nThe communique reads in part, “Many aspire to lead, even when they don’t have what it takes to lead.\nThe group added that it is time to support a personality with a vision and mission to redefine development in the constituency.\nAdvertisementIt also called on all stakeholders in Akoko North-West beyond party affiliations to support aspiration of Oluwaseyi, so that the constituency can move forward.\n“His antecedents in diverse professions are clear pointers that he is more fit than any other person to lead the constituency”, the group stressed."
  },
  {
    "headline": "Chief Whip dismisses Rumoured Defection of 8 PDP Oyo Lawmakers -",
    "summarized_story": "Hon Adedibu, who is also the Chief Whip of the House debunked the rumor during Wednesday’s plenary under personal explanation.\nAdvertisementHe explained that though he and the other seven members will not be returning to the House in 2023, there is no plan by them to leave the ruling Peoples Democratic Party, PDP in Oyo State.\nHon Adedibu urged members of the public to disregard the unfounded rumour.\n” On behalf of other seven members, i Hon Hakeem Adedibu wish to state categorically that there was never a plan by me or any of the other seven members of the PDP to defect to another party .\n” Hon Hakeem Adedibu."
  },
  {
    "headline": "Okupe Withdraws as Peter Obi’s Running Mate, Paves Way for Substantive VP Candidate",
    "summarized_story": "Former presidential aide, Doyin Okupe, has withdrawn from his position as running mate to the presidential candidate of the Labour Party (LP), Peter Obi.\n“This afternoon I submitted my withdrawal letter from the position of the Vice Presidential candidate of the Labour Party to INEC.\nI feel greatly blessed to have been part of the foundation of success for the Labour Party,” he announced.\n“Those discussions about merger, alliance and all that—was led by me from our side, and it is dead,” Mr Okupe announced on Tuesday.\nWith his withdrawal finally announced, the LP is expected to announce Mr Obi’s substantive vice-presidential candidate between Thursday and Friday."
  },
  {
    "headline": "Ekweremadu Update: ‘Organ Donor’ Admitting He’s 21 Doesn’t Change Criminal Charge (VIDEO) – Arise News",
    "summarized_story": "ARISE International Correspondent Adefemi Akinsanya reports from Westminster Magistrate Court on the outcome of the hearing involving Sen. Ike Ekweremadu and his wife Beatrice, arraigned on allegations of organ harvesting."
  },
  {
    "headline": "Nigeria: All Security Agencies Sent After Kuje Prison Attackers, Fleeing Inmates, Says Interior Minister",
    "summarized_story": "Rauf Aregbesola, Nigeria’s Minister of Interior, has said all the nation’s security apparatuses have been sent after the attackers and fleeing escapees of the Kuje Prison attack.\n“As we speak, security personnel are combing the whole area, up to a distance of 100 kilometres radius, looking for them.\nHe recalled that the security officers on duty fiercely engaged them and inflicted a heavy casualty on them, but regrettably, given their unprecedented number, they overpowered the officers on duty.\nOne of the security personnel that engaged the attackers was unfortunately killed.\nHe revealed that the Minister has directed that all correctional facilities in the country be fortified; that all personnel be vigilant and alert, to avoid recurrence."
  },
  {
    "headline": "Eid-El-Kabir: Nigeria Declares Monday 11th, Tuesday 12th as Public Holidays",
    "summarized_story": "Nigeria’s Federal Government has declared Monday 11th and Tuesday 12th July, 2022, as public holidays to mark this year’s Eid-el-Kabir celebration.\nThe Minister of Interior, Ogbeni RaufAregbesola, while making the declaration on behalf of the Federal Government on Thursday, congratulated all Muslims and Nigerians both at home and in the Diaspora on the occasion.\nHe also enjoined all Nigerians to be vigilant and observant of intruders in their communities.\n“We must all take responsibility for the security of lives and property as we celebrate this year’s festival” he said.\nMichael Olugbode in Abuja"
  },
  {
    "headline": "Boris Johnson Resigns, Remains UK Prime Minister for Now",
    "summarized_story": "British Prime Minister Boris Johnson resigned on Thursday.\nJohnson had been hanging onto power despite the resignation of a string of his top ministers.\nOn Thursday the man he appointed as finance minister less than 48 hours earlier publicly urged Johnson to quit.\nDefence Secretary Ben Wallace also called on Johnson to quit but said he would stay in his role to protect national security.\nJohnson plans to carry on as prime minister until a new leader is chosen later in the summer, a task that can take up to two months."
  }
]