[
  {
    "headline": "2022 budget: Senate may review of $57 crude oil price benchmark",
    "summarized_story": "The Senate has said the $57 crude oil price benchmark it adopted for the 2022 national budget is still subject to a review before the eventual passage of the Appropriation Bill which the President, Major General Muhammadu Buhari (retd.\nThe red chamber had on Wednesday retained the oil benchmark proposed by Buhari in the 2022-2024 Medium Term Expenditure and Fiscal Strategy Paper.\nInvestigation by our correspondent during the week had revealed that the joint panels, in their report, increased the $57 benchmark proposed by Buhari to $60.\nHe, however, said the $57 oil benchmark could still be reviewed before the fiscal document would be eventually passed if there was further improvement in the global price of the commodity.\n“We cannot go contrary to the oil quota which the OPEC gave us."
  },
  {
    "headline": "World’s largest container ship arrives UK",
    "summarized_story": "A container ship said to be the largest in the world has arrived in the UK on its maiden voyage.\nAccording to inews, the Ever Ace, built in 2020 for Taiwan-based shipping company Evergreen Marine, docked in Felixstowe, Suffolk.\nEver Ace, which has a capacity of 23,992 containers, sets sail for Rotterdam on Wednesday, before crossing the Suez Canal.\nShipping giant, Evergreen Marine, plans to build 11 more supersised container ships.\nIn 2020, the Ever Given was freed after being stuck in the Suez Canal for six days on its way to Felixstowe."
  },
  {
    "headline": "Buhari decries illicit arms trade, solicits debt cancellation for Nigeria, others at UN",
    "summarized_story": "“It is on this note that my delegation calls for the worldwide application of the Arms Trade Treaty to codify accountability in the conventional arms trade, which is critical to the security of nations.\nHe said, ‘‘Nigeria reaffirms that international trade is an engine for development and sustained economic growth, as well as the global eradication of poverty.\n‘‘Fair and equitable trade would eventually eliminate the need for aid.\n‘‘No reform of the United Nations system is more urgent than that of the Security Council.\nAdesina’s statement quoted Guterres as saying this in a meeting on the sidelines of the 76th Session of the United Nations General Assembly."
  },
  {
    "headline": "A’Ibom @ 34: Gov Emmanuel inaugurates 9.81 km roads to mark anniversary",
    "summarized_story": "…Swears in new President General, Akwa Ibom State Traditional Rulers Council, orsAkwa Ibom State Governor, Mr Udom Emmanuel on Thursday commissioned four interconnected roads of 3.4Km, in Shelter Afrique, one Akwa Ibom’s high profile estate as part of activities to mark the State’s 34th anniversary.\nEnoidem Avenue, David Lawrence Crescent, and Nicholas Ekarika Avenue, bringing the total number of internal roads constructed by Governor Udom Emmanuel led administration in the estate to sixteen.\nPerforming the inauguration, the Governor said the projects symbolized a signature of his administration’s infrastructure drive in the estate, as done across the state.\nIf you check the strength of the road and the bridge, you’ll understand what I mean”.\nThe Governor also swore into office the President General, Akwa Ibom State Traditional Rulers Council, His Eminence Ntenyin (Dr.) Solomon Etuk (JP) and Paramount Rulers Elect of Urue offong/Oruko and Ikono Local Government Areas."
  },
  {
    "headline": "We’ll open up maritime sector to huge investment opportunities – Amaechi",
    "summarized_story": "The Minister of Transportation, Mr Chibuike Amaechi, has said that the maritime sector was being opened up for great investment opportunities given the ongoing removal of wrecks.\nHe also commended Dr Bashir Jamoh, the Director General of the Nigerian Maritime Administration and Safety Agency (NIMASA), for the initiative.\nHe also cited the launch of the wreck removal exercise as another milestone in the incremental achievement of the Triple S strategy of the current Management of NIMASA, anchored on Maritime Safety, Maritime Security, and Shipping Development.\nDignitaries in attendance included the President, Ship Owners Association of Nigeria, Dr MkGeorge Onyung, Executive Director, Finance and Administration, NIMASA, Mr Chudi Offodile and the Executive Director, Operations, Mr Shehu Ahmed.\nThe Executive Director, Maritime Labour and Cabotage Services, Mr Victor Ochei was also in attendance."
  },
  {
    "headline": "We’ll open up maritime sector to huge investment opportunities – Amaechi",
    "summarized_story": "The Minister of Transportation, Mr Chibuike Amaechi, has said that the maritime sector was being opened up for great investment opportunities given the ongoing removal of wrecks.\nHe also commended Dr Bashir Jamoh, the Director General of the Nigerian Maritime Administration and Safety Agency (NIMASA), for the initiative.\nAmaechi said the exercise would tremendously enhance the Federal Government’s economic diversification drive and enhance Nigeria’s standing in the global maritime community.\nDignitaries in attendance included the President, Ship Owners Association of Nigeria, Dr MkGeorge Onyung, Executive Director, Finance and Administration, NIMASA, Mr Chudi Offodile and the Executive Director, Operations, Mr Shehu Ahmed.\nThe Executive Director, Maritime Labour and Cabotage Services, Mr Victor Ochei was also in attendance."
  },
  {
    "headline": "Gana’s 2nd in command, Azonto, arrested in joint security operation",
    "summarized_story": "By Peter Duru – MakurdiThe wanted second in command of the slain militia leader, Terwase Agwaza alias Gana, Aondofa Kefas also known as Azonto has been arrested in a joint security operation around the Benue/Taraba state border axis.\nThe deadly gang led by the militia leader was known to run the underworld in that axis, kidnapping, robbing, raping and killing their victims some of who were declared missing till date.\nA military source who spoke on condition of anonymity disclosed in Makurdi that Azonto was arrested on Thursday following a tip off after several months of search for him.\nHe said the arrest of the militia leader was a major breakthrough for security operatives in the fight against banditry and violent crimes in that part of the state.\n“The arrest was actually made in Taraba state but the militia leader had been on our watch, he has been terrorising communities around Ukum Local Government Area of Benue State."
  },
  {
    "headline": "UN Secretary-General lauds Buhari’s role in stablizing West Africa",
    "summarized_story": "President Muhammadu BuhariBy Johnbosco AgbakwuruThe Secretary General of the United Nations, UN, Antonio Guterres, has commended President Muhammadu Buhari for his leadership roles in Africa as well as stabilization of the West African sub-region.\nThe Secretary General spoke in a meeting with the Nigerian President at the sidelines of the 76th Session of the United Nations General Assembly taking place in New York.\nPresident Buhari applauded Mr Gutterres for his global leadership and the success of the 76th Session.\nHe assured the Secretary General that Nigeria had achieved appreciable successes in tackling the insecurity caused by terrorists and bandits.\nHe further said that Nigeria was ready to support and work closely with the United Nations towards achieving the Sustainable Development Goals."
  },
  {
    "headline": "Buhari asks G20 to cancel Nigeria’s debt after fresh $4bn, €710m loan request",
    "summarized_story": "President Muhammadu Buhari has urged G20 to extend debt suspension initiatives to Nigeria and other developing/least developed countries.\nOthers include Saudi Arabia, South Africa, South Korea, Turkey, the United Kingdom, and the United States.\nBuhari requested outright debt cancellation for countries facing the most severe challenges occasioned by COVID-19.\nThe Nigerian leader recalled developing countries faced unsustainable debt burdens even before coronavirus outbreak.\nThe Buhari administration is being criticized for demanding that the Nigerian Senate approve fresh $4.054bn and €710million credit."
  },
  {
    "headline": "Motorists stranded as protesting trailer, tanker drivers block Minna-Suleja road",
    "summarized_story": "Motorists have decried the obstruction of traffic flow on the Minna-Suleja road by trailer and tanker drivers on protest at Lambata in Gurara Local Government Area of the state.\nThey urged the Niger State Government to urgently step in to ensure easy vehicular movement on the road.\n“I left Minna heading to Abuja to attend to some issues concerning my business only to be stranded before Lambata for hours.\nAnother commuter, Abu Omar, said, “Niger State Government needs to intervene in the problem.\nWhy will these drivers just block the road like that and make things further difficult for the poor masses?"
  },
  {
    "headline": "Gov Abiodun told to release Ogun EndSARS panel’s report in seven days",
    "summarized_story": "Governor Dapo Abiodun of Ogun State has been asked to release or publish the recommendations of the Ogun State judicial panel on police brutality, otherwise known as EndSARS panel, within seven days.\n“We commend Your Excellency for swiftly acceding to the demands of millions of youths to set up the ENDSARS Panel.\n“The EndSARS panel was a public hearing, not a private hearing.\n“Since it was a public hearing, recommendations should be made public.\nThe counsel threatened to approach the court if Gov Abiodun failed to release the panel’s report in accordance with the FOI Act in seven days."
  },
  {
    "headline": "Ezeiruaku Fidelia: Tallen vows to seek justice for female corps member dehumanized by soldier",
    "summarized_story": "Dame Pauline Tallen, Minister of Women Affairs, has reiterated her commitment to ensure justice for the female corps member, Ezeiruaku Ifenyinwa Fidelia, that was recently alleged to have been dehumanized by a female army officer.\nThe minister in a statement on Friday frowned at the way and manner the corps member was dehumanized by a fellow woman.\nShe assured Nigerians of her readiness to tread extra legitimate miles to ensure justice for the corps member in question.\n”Soliciting for calm from Nigerians, her ministry, as made known by her, will continue to engage with the leadership of the Nigeria Army to forestall such reoccurrence.\nOhanaeze condemns Army officer’s dehumanization of NYSC member"
  },
  {
    "headline": "Don’t let Nigeria become another Afghanistan – Governor Yahaya tasks security chiefs, experts",
    "summarized_story": "Gombe State Governor, Muhammadu Inuwa Yahaya, on Friday, said the unfolding events in Afghanistan and other countries demand that authorities in Nigeria take proactive measures to stem any grave repercussions.\nAccording to him, the discussion centred on the Security Situation in Afghanistan: Implications for Nigeria and Africa, organized by Alumni Association of the National Defence College in the Nation’s capital.\nThe governor, who described the event as apt and timely, noted that Nigeria and Afghanistan share a lot of characteristics, hence what affects the South Asian country has consequences in Nigeria and Africa in general.\nGovernor Inuwa Yahaya observed that presentation of papers and holding of roundtable discussions are not enough but implementing the outcomes of the deliberations is what matters most.\nGovernor Inuwa Yahaya, however, remarked that prior to taking over as Governor, he set up a security transition committee that was saddled with the responsibility of analysing the security situation with a view to providing a roadmap on how to manage the security architecture in the state."
  },
  {
    "headline": "#EndSARS: Lagos panel awards N19.25m to six police brutality victims",
    "summarized_story": "By Robert EgbeThe Lagos State Judicial Panel of Inquiry and Restitution for SARS-related abuses and other matters has awarded N19,250,000 as compensation to six victims of police brutality.\nThe recipients are: Akinmade Akinrolabu (N1.5 million); Sanusi Oluwakemi (N750, 000); Patrick Michael (N3 million); Ayomide Oyewunmi (N1 million); Adeshina Adeosun (N10 million) and Oluwatosin Odebode (N3 million).\nHis father, Taiwo Oyewunmi, had told the panel that the police officers invaded his residence and handcuffed his son.\nAlso, a relative of the late Adeshina Adeosun received N10 million compensation on behalf of their family.\nThe panel was set up by the Lagos government in the wake of the #EndSARS protest in October 2020, to probe cases of police brutality in the state."
  },
  {
    "headline": "Sowore slams Ondo varsity over ‘insane memo’",
    "summarized_story": "·He should go to court – RegistrarBy Damola Kola-DareSahara Reporters Publisher and ex-presidential candidate, Omoyele Sowore has berated authorities at Adekunle Ajasin University Akungba-Akoko, over a recent memo released to warn students to desist from the indecent dressing.\nHowever, Sowore on his Facebook page condemned the move describing the memo as ‘insane’.\nHe wrote: “This bizarre, backward and belligerently insane memo emanated from a Nigerian University, to be specific, this nonsense, was released from Adekunle Ajasin University in Ondo State.\n“Every member of that University Senate who signed up to this rubbish should be fired for indecent reasoning!\n“It is the decision of the Senate to introduce such a stiff penalty since the students refused to heed repeated warnings."
  },
  {
    "headline": "Widow asks court to exclude ex-Miss Nigeria from husband’s estate",
    "summarized_story": "They are seeking an order that the widow and Dr Ajayi’s children (including Helen Prest’s daughter, Tomisin Ajayi) are the only ones entitled to share in the deceased’s estate.\nThey prayed the court to, among others, hold that Mrs Ajayi is entitled to one-third and the children to two-thirds of the estate.\nRelatedly, they are also asking the Court for an order of perpetual injunction restraining Helen Prest and anyone acting on her behalf from interfering with the estate.\nAccording to the suit, filed by Prest, Dr Ajayi was married to Oluwayemisi and they had children.\nPreston averred that the couple were separated before Dr Ajayi’s demise."
  },
  {
    "headline": "Buhari at UN calls for term limits for African leaders",
    "summarized_story": "From Juliana Taiwo-Obalonye, New YorkPresident Muhammadu Buhari has told world leaders at the 76th Session of the high-level General Debate of the UN General Assembly at the UN headquarters in New York on Friday, to set term limits especially for African leaders.\nPresident Buhari stressed that the recent trend of unconstitutional takeover of power on the continent must not be tolerated by the international community.\n“This will facilitate the achievement of the 2030 Agenda for Sustainable Development and the African Union Agenda 2063.\n“Nigeria fully supports the efforts by ECOWAS to address this growing challenge and appreciates the support of both the African Union and the United Nations.\n“In this regard, I would like to reiterate that as leaders of our individual member-states we need to adhere to the constitutional provisions of our countries, particularly on term limits."
  },
  {
    "headline": "Achike Udenwa: If you kill Nnamdi Kanu, another will rise",
    "summarized_story": "Former Imo State governor, Chief Achike Udenwa has said only a political solution could resolve the IPOB and Nnamdi Kanu issue, noting that legal options wouldn’t go anywhere.\nHow do we tackle this Nnamdi Kanu phenomenon because it is what gave birth to this sit-at-home and other things happening in the South-East.\nCuriously, South-East governors are behind, while South-West and South-South are the ones driving it.\nThese are basic issues, so why our governors don’t want to get involved is what I cannot say.\nThey have held three meetings and we have South-East governors who have not attended any."
  },
  {
    "headline": "Anti-open grazing: Southern groups attack El-Rufai",
    "summarized_story": "Gov El Rufai talked about open grazing no longer being sustainable and said he is constructing ranches and at the same time he is saying that the anti-open grazing law signed by his southern counterparts is not implementable.\nThe Southern governors have come together against him and his co-traitors in the country and that is what matters.\nPresident of the Middle Belt Forum (MBF), Dr Bitrus Pogu said the submission of Gov El Rufai on the anti-open grazing law was unfounded.\nHe said: “Enforcement of the anti-open grazing law is based on determination.\nIf Gov Samuel Ortom is able to implement anti-open grazing law in Benue State, then it is implementable."
  },
  {
    "headline": "Kumuyi: How I started Deeper Life with 15 persons in 1973",
    "summarized_story": "Before that time, all I was doing was trying to live a good and righteous life, an upright life above board and reproach.\nSo on that day, the 5th of April, 1964, I said “Lord, You have sent our Lord Jesus Christ not only to save humanity but to save me.\nSo I gave my life over to the Lord Jesus.\nSo, I took up the challenge and we started the ministry in 1973 August 3rd, with only 15 truth seekers.\n•Kumuyi, General Superintendent of Deeper Christian Life Ministry, spoke at the public presentation of his biography, Kumuyi:Defender of the Faith, in Lagos last week."
  },
  {
    "headline": "Kalu extols Ladoja’s virtues, as ex-Oyo gov turns 77",
    "summarized_story": "Former Governor of Abia State and Chief Whip of the Senate, Dr Orji Kalu has described former Governor of Oyo State, Senator Rashidi Ladoja as a consummate politician and patriotic statesman.\nExtolling the virtues of the shipping magnate turned politician, Kalu acknowledged the contributions of the former governor to the social, economic and political development of Oyo State and Nigeria in general.\nHe said: “As the former Governor of Oyo State, Senator Rashidi Ladoja clocks 77, I join his family, political and business associates in celebrating the robust accomplishments of the celebrant in all facets of life.\nThe former governor has over the years sustained his pedigree by embracing democratic virtues in his political pursuits.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "UN Secretary General Urges Buhari to Ensure Stability Of West Africa",
    "summarized_story": "He also flayed the recent reversal of democratic fortunes in some West African nations including Guinea, Mali and Chad.\nIn a statement issued by the Media Adviser to the President, Femi Adesina, the UN scribe commended President Buhari for his leadership roles in Africa as well as stabilization of the West African sub-region.\nThe Secretary General spoke Friday at a meeting with the Nigerian President at the sidelines of the 76th Session of the United Nations General Assembly taking place in New York.\nIn his remarks, President Buhari applauded Gutterres for his global leadership and the success of the 76th Session.\nPresident Buhari added that Nigeria was ready to support and work closely with the United Nations towards achieving the Sustainable Development Goals."
  },
  {
    "headline": "Buhari Approves Redeployment of Five Permanent Secretaries",
    "summarized_story": "Olawale Ajimotokan in AbujaPresident Muhammadu Buhari has approved the redeployment of five Permanent Secretaries.\nThe affected Permanent Secretaries and details of the new portfolios are as follows:William Nwankwo Alo of the Federal Ministry of Power now redeployed to Police Service Commission.\nAbel Olumuyiwa Enitan of the Federal Ministry of Environment now redeployed to the Federal Ministry of Aviation.\nHassan Musa of the Federal Ministry of Aviation is redeployed to the Federal Ministry Environment, while Nebeolisa Anako of the Federal Ministry of Youth and Sports Development is redeployed to the Federal Ministry of Power.\nIsmaila Abubakar of the Police Service Commission is redeployed to the Federal Ministry of Youth and Sports Development."
  },
  {
    "headline": "News in Photographs: Buhari in New York for UN General Assembly",
    "summarized_story": "In New York, President Muhammadu Buhari participated at the opening session of the 76th United Nations General Assembly on Tuesday.\nHe held several bilateral meetings and attended summits on the sidelines of the UN General Assembly.\nEarlier on Monday, President Buhari received briefings from senior government officials ahead of his participation at the UN General Assembly.\nBuhari also met with Director General of the World Trade Organization, Dr. Ngozi Okonjo-Iweala.\nOn Friday, President Buhari delivered is Statement to the 76th UN General Assembly and held bilateral meeting with UN Secretary General, António Guterres."
  },
  {
    "headline": "At UNGA, Buhari Asks World Leaders to Unite Against Unconstitutional Takeover of Power",
    "summarized_story": "Warns coup eroding democratic gains in West AfricaBy Deji ElumoyePresident Muhammadu Buhari has called on world leaders to unite against unconstitutional take over of governments in some parts of the world.\nBuhari, who addressed the 76th Session of the United Nations General Assembly in New York, United States of America on Friday, declared that the recent trend of unconstitutional takeover of power must not be tolerated by the international community.\nHe warned that democratic gains of the past decades in West Africa ‘‘are now being eroded’’ due to these negative trends.\nThe President affirmed Nigeria’s support to efforts by ECOWAS, AU and the UN to address this growing challenge, saying: ‘‘As leaders of our individual Member-States we need to adhere to the constitutional provisions of our countries, particularly on term limits.\nThis is one area that generates crisis and political tension in our sub-region.’’Details later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "For the Record: Buhari’s Address at UN General Assembly (Full Text)",
    "summarized_story": "By Muhammadu BuhariMr. President,Let me, on behalf of the government and people of Nigeria, congratulate you on your well-deserved election as President of the 76th Session of the United Nations General Assembly.\nNigeria fully supports the efforts by ECOWAS to address this growing challenge and appreciates the support of both the African Union and the United Nations.\nClimate change and unpredictable shocks, such as the current global pandemic, further exacerbate vulnerabilities in the global food system, requiring the UN’s urgent attention.\nNo reform of the United Nations system is more urgent than that of the Security Council.\nADDRESS BY HIS EXCELLENCY, MUHAMMADU BUHARI, PRESIDENT OF THE FEDERAL REPUBLIC OF NIGERIA AT THE GENERAL DEBATE OF THE 76TH SESSION OF UNITED NATIONS GENERAL ASSEMBLY Friday, 24TH SEPTEMBER, 2021 NEW YORK, USAShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EXPOSED: How Nigerian Government Gave Indicted Cocaine Trafficker Multi-million Dollar Contract To Supply Passports To Citizens",
    "summarized_story": "This report exposes the rot, racketeering, ethnic nepotism, complete failure of due diligence, and how an indicted cocaine trafficker has come to control the supply of passports to Nigerian citizens.\n“We acknowledge and apologise for the challenges faced in the past few weeks regarding passport booklets availability.\nFrom when he made these pronouncements until his retirement earlier this month, passport booklets continued to be a scarce and expensive commodity in Nigeria.\nHe didn’t really care about fixing any systemic issues like staff motivation or the ISTL contract.\nISTL does not actually produce passport booklets, but sub-contracts production to the Malaysian firm Iris Corp."
  },
  {
    "headline": "EXPOSED: How Nigerian Government Gave Indicted Cocaine Trafficker Multi-million Dollar Contract To Supply Passports To Citizens",
    "summarized_story": "This report exposes the rot, racketeering, ethnic nepotism, complete failure of due diligence, and how an indicted cocaine trafficker has come to control the supply of passports to Nigerian citizens.\n“We acknowledge and apologise for the challenges faced in the past few weeks regarding passport booklets availability.\nFrom when he made these pronouncements until his retirement earlier this month, passport booklets continued to be a scarce and expensive commodity in Nigeria.\nHe didn’t really care about fixing any systemic issues like staff motivation or the ISTL contract.\nISTL does not actually produce passport booklets, but sub-contracts production to the Malaysian firm Iris Corp."
  },
  {
    "headline": "BUSTED: How Nigeria’s Attorney-General Malami Released Over 300 ‘Powerful’ Boko Haram Sponsors After Collecting Bribes, Left Only Foot Soldiers In Detention",
    "summarized_story": "Over 300 suspects arrested by the Nigerian government for funding Boko Haram terrorists have been released, SaharaReporters has gathered.\nMalami was reacting to public criticism over the secrecy surrounding the identities of the alleged financiers of Boko Haram as Buhari’s government has shunned all calls to name the terror sponsors.\n“Ongoing investigation revealed that the suspects have links with the Boko Haram Terrorist Group.\nThese are all the strategies being used by Malami who has already left the big terror financiers off the hook.\n“The 45 persons are insignificant foot soldiers of terror financiers."
  },
  {
    "headline": "BUSTED: How Nigeria’s Attorney-General Malami Released Over 300 ‘Powerful’ Boko Haram Sponsors After Collecting Bribes, Left Only Foot Soldiers In Detention",
    "summarized_story": "Over 300 suspects arrested by the Nigerian government for funding Boko Haram terrorists have been released, SaharaReporters has gathered.\nMalami was reacting to public criticism over the secrecy surrounding the identities of the alleged financiers of Boko Haram as Buhari’s government has shunned all calls to name the terror sponsors.\n“Ongoing investigation revealed that the suspects have links with the Boko Haram Terrorist Group.\nThese are all the strategies being used by Malami who has already left the big terror financiers off the hook.\n“The 45 persons are insignificant foot soldiers of terror financiers."
  },
  {
    "headline": "BUSTED: How Nigeria’s Attorney-General Malami Released Over 300 ‘Powerful’ Boko Haram Sponsors After Collecting Bribes, Left Only Foot Soldiers In Detention",
    "summarized_story": "Over 300 suspects arrested by the Nigerian government for funding Boko Haram terrorists have been released, SaharaReporters has gathered.\nMalami was reacting to public criticism over the secrecy surrounding the identities of the alleged financiers of Boko Haram as Buhari’s government has shunned all calls to name the terror sponsors.\n“Ongoing investigation revealed that the suspects have links with the Boko Haram Terrorist Group.\nThese are all the strategies being used by Malami who has already left the big terror financiers off the hook.\n“The 45 persons are insignificant foot soldiers of terror financiers."
  },
  {
    "headline": "Malami: States have no valid claim on VAT collection... it's on exclusive legislative list",
    "summarized_story": "Abubakar Malami, attorney-general of the federation, says no state has the power to lay claim to the collection of value-added tax (VAT) in the country.\nIn recent weeks, the Federal Inland Revenue Service (FIRS) has been in a legal tussle over with Rivers and Lagos state governments over VAT collection.\nSpeaking on the development, Malami said the collection of VAT in the country is under the exclusive legislative list, adding that only the national assembly has the power to make laws on VAT.\nOne, generally speaking, as you rightly know, the issue of the value-added tax is an issue on the exclusive legislative list,” Malami said.\nAdvertisement“And the implication of being in exclusive legislative list matter is that only the national assembly can legislate on it."
  },
  {
    "headline": "Malami: States have no valid claim on VAT collection... it's on exclusive legislative list",
    "summarized_story": "Abubakar Malami, attorney-general of the federation, says no state has the power to lay claim to the collection of value-added tax (VAT) in the country.\nIn recent weeks, the Federal Inland Revenue Service (FIRS) has been in a legal tussle over with Rivers and Lagos state governments over VAT collection.\nSpeaking on the development, Malami said the collection of VAT in the country is under the exclusive legislative list, adding that only the national assembly has the power to make laws on VAT.\nOne, generally speaking, as you rightly know, the issue of the value-added tax is an issue on the exclusive legislative list,” Malami said.\nAdvertisement“And the implication of being in exclusive legislative list matter is that only the national assembly can legislate on it."
  },
  {
    "headline": "Report: Former BP staff claims oil contracts bribe used to fund Nigeria's 2019 elections",
    "summarized_story": "Jonathon Zarembok, a former BP staff member, alleges that bribery for oil contracts from Nigerian National Petroleum Corporation (NNPC) was used to support the 2019 general elections.\nZarembok, who led the company’s West Africa desk, told the court that cargo allocations by the NNPC could have contributed to preparations for general elections in 2019.\nThe 2019 presidential election was keenly contested between President Muhammadu Buhari and ex-vice president Atiku Abubakar.\nAdvertisementAccording to Bloomberg, Zarembok said in the suit he suspected that fees paid by the U.K. energy giant to obtain NNPC contracts would go toward the 2019 elections.\nSpokespersons for the NNPC and the Buhari-led federal government were said to have ignored calls and emails seeking clarifications."
  },
  {
    "headline": "Report: Former BP staff claims oil contracts bribe used to fund Nigeria's 2019 elections",
    "summarized_story": "Jonathon Zarembok, a former BP staff member, alleges that bribery for oil contracts from Nigerian National Petroleum Corporation (NNPC) was used to support the 2019 general elections.\nZarembok, who led the company’s West Africa desk, told the court that cargo allocations by the NNPC could have contributed to preparations for general elections in 2019.\nThe 2019 presidential election was keenly contested between President Muhammadu Buhari and ex-vice president Atiku Abubakar.\nAdvertisementAccording to Bloomberg, Zarembok said in the suit he suspected that fees paid by the U.K. energy giant to obtain NNPC contracts would go toward the 2019 elections.\nSpokespersons for the NNPC and the Buhari-led federal government were said to have ignored calls and emails seeking clarifications."
  },
  {
    "headline": "Use your position to stabilise West Africa, UN secretary-general tells Buhari",
    "summarized_story": "Antonio Guterres, secretary-general of the United Nations, has urged President Muhammadu Buhari to use his leadership position to ensure stability in West Africa, in terms of democracy and good governance.\nAdvertisementAccording to a statement by Femi Adesina, spokesperson to the president, the UN secretary-general said this at a meeting with Buhari on Friday, at the 76th session of the United Nations general assembly (UNGA) taking place in New York.\n“He, therefore, urged President Buhari to continue to show leadership as he looks up to Nigeria to help stabilise the sub-region in terms of democracy and good governance.\n“President Buhari applauded Mr Gutterres for his global leadership and the success of the 76th session.\nHe assured the secretary-general that Nigeria had achieved appreciable successes in tackling the insecurity caused by terrorists and bandits."
  },
  {
    "headline": "ChatBots Africa, Fashtracker win pitch sessions at TechCabal’s ‘Future of Commerce’",
    "summarized_story": "ChatBots Africa and Fashtracker have been announced as winners of the partnership and investment pitch sessions, respectively, organised by TechCabal as part of the ‘Future of Commerce’ conference.\nHeld on Friday, 24th of September, the partnership pitch session saw a total of three growth-stage startups pitch to corporate organizations for potential partnerships while the investment version involved four early-stage startups pitching to potential investors.\n“For my team and I, winning at the pitching session validates our vision for the future of e-commerce in Africa, that is, conversational and social commerce,” Ronald Tagoe, Founder of ChatBots Africa, told TechCabal.\nNigeria-based Fashtracker connects trusted and sustainable African fashion brands to people within and outside the continent through its online platform.\n“Especially during such tough times in Nigeria – economic prosperity is key.”A screenshot of ChatBots Africa website."
  },
  {
    "headline": "What will commerce look like in Africa over the next decade?",
    "summarized_story": "With Covid-19 restrictions forcing more people to shop online, e-commerce companies and platforms on the continent have enjoyed a surge in activity.\nThis is provided e-commerce platforms continue to solve problems consumers face and offer more suites of offerings.\nAccording to Nkebet Mesele, Senior Director for Solutions Management in sub-Saharan Africa at Visa, that entails making commerce in Africa “mobile-led”.\n“For commerce to grow across Africa, the building blocks that have to be in place are first, it has to be mobile-led.\n“But it starts with building solutions for people on the ground.”If you enjoyed reading this article, please share it in your WhatsApp groups and Telegram channels."
  },
  {
    "headline": "Phishing scams are becoming more prevalent in African countries",
    "summarized_story": "Phishing is one of the oldest internet scams, dating back to the ‘90s, and perhaps remains one of the most prevalent cybercrimes.\nBut one thing phishing emails have in common with other forms of cyberattack is that every phishing email comes with a call to action that prompts recipients to download a link or file.\nPhishing attacks are prevalent in the continents and individuals and businesses across Africa have fallen victims to phishing scams.\nOver a million phishing attacks were recorded in South Africa in the first half of 2021.\nThat’s a combination of over two million attacks in the first half of the year from the three biggest African markets."
  },
  {
    "headline": "ARM collaborates with TechCabal on the Future of Commerce partnership pitch session",
    "summarized_story": "As part of the sessions, TechCabal will organize two strategic workshops – a partnership pitch session where growth-stage startups can pitch to corporate organizations for potential partnerships, and an investment pitch session where early-stage startups can pitch to potential investors.\nAsset & Resource Management Holding Company Limited (ARM), a provider of global asset management services across a wide range of traditional and alternative investment options, has partnered with TechCabal on the partnership pitch session.\nIna Alogwu, Group Director of Digital Transformation at ARM Group will be speaking at the session.\nAt ARM, he oversees the execution of the Group’s digital transformation strategy, helping the seven subsidiary companies in the Group drive their digital initiatives.\nSpeaking about the event, Olanrewaju Odunowo, Head of TechCabal Insights said, “The COVID-19 pandemic has changed the face of commerce."
  },
  {
    "headline": "Obaseki felicitates with Ogie on birthday – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has felicitated with the Secretary to the State Government, Osarodion Ogie Esq., on his birthday.\nThe governor, in a statement, described Ogie as a kindhearted, meek and trustworthy brother and friend, who has distinguished himself in life and his chosen career path as a lawyer.\nAccording to him, “I felicitate with Secretary to the State Government, Osarodion Ogie Esq., as he adds another year today.\n“He is a true brother and friend, who has shown uncommon commitment to the development and progress of our state.\n“As you add another year today, I wish you many more years in good health."
  },
  {
    "headline": "Eschew Provocative Utterances, Okonjo-Iweala’s Brother Tells Ogwashi-Uku Indigenes – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – The Obi of Ogwashi-Uku Kingdom, HRM Obi Ifechukwude Aninshi Okonjo II, Aniocha South Local Government Area of Delta State, has sued for peace and neighborliness among Ogwashi-Uku Indigenes.\nThe Obi appealed to his neighbouring communities to eschew provocative utterances and misrepresentation of facts over which kingdom Otulu community belongs.\n“So, from a historical, geographic and political point of view, Otulu Ogwashi-Uku is and will remain part of Ogwashi-Uku Kingdom.\n“We are aware that some communities are rushing to make claims about Otulu Ogwashi-Uku in light of the unfortunate incident which happened last week.\n“We know the history and relationship between our Azagba Ogwashi-Uku Community and Issele Azagba."
  },
  {
    "headline": "Edo Jailbreak: Fugitive bathe PUWOV officials with faeces, arrested in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOfficials of the Public Works Volunteers (PUWOV) in Edo State, headed Mukhtar Yusuf-Osagie, in collaboration with other security agencies in the state have arrested one Chinedu Ogu, a fugitive who escaped from maximum-security prison at Oko, Benin City, during the #EndSARS protest that rocked the country last year.\nOgu, who was in prison for murder charges, was among the 1,993 inmates who escaped from the two correctional centres in the state on October 19, 2020.\nNarrating the incident, the coordinator stated: “The officials of PUWOV accosted a commercial motorist who contravened the law, and in a bid to resist arrest and incite passersby against the officials, he went nude at the scene of offence.\nHe passed out faeces and used the faeces to bathe the PUWOV officials at the scene.\n“Luckily, PUWOV officials apprehended him and in the process, it was discovered that he is a fugitive."
  },
  {
    "headline": "COVID-19 3rd wave: Edo urges vaccination as mortalities reach 71, infections climb to 1,423 – Nigerian Observer",
    "summarized_story": "Head of the State’s COVID-19 Case Management, Dr. Ebomwonyi Osagie, gave the charge while addressing journalists during the daily briefing on COVID-19, at the Government House in Benin City.\nHe said the state recorded one more death of an unvaccinated person, with seven new COVID-19 cases, urging residents to get vaccinated in order to stay protected against the virus.\nAccording to him, “Edo State, in the last 24 hours, recorded one more death of an unvaccinated person, seven new COVID-19 cases, 11 recoveries, with 720 active cases that are being managed at various treatment and isolation facilities in the state.\n“The casualty; a 68-year-old unvaccinated male, was reported from Stella Obasanjo Hospital.\nWhile applauding their turnout for the ongoing massive vaccination exercise in the state, Irowa urged citizens who are yet to be inoculated to come out to get vaccinated in order to get protection against the virus."
  },
  {
    "headline": "Naira hits all-time low at official market",
    "summarized_story": "ADVERTISEMENTNaira weakened significantly against the U.S. dollar at the official market Friday, reaching its lowest rate in that market, even as foreign exchange supply rose marginally.\nThe currency’s performance on Friday represents N1.22 or 0.30 per cent devaluation from N413.68 it exchanged on Thursday.\nNaira staged an intraday high of N400.00 and a low of N415.20 before closing at N414.90 per $1 on Friday.\nThe central bank initially stopped sales of forex to Bureaux De change operators and last week forced abokiFX to stop publishing black market rates.\nAt the black market in Abuja on Friday, dealers said naira exchanged as low as 570 in the morning, but later rose to 568 per a dollar in the evening as demand reduced."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Top Banker, UK Eke wins Year 2020 Zik Prize",
    "summarized_story": "By Okey OnyenweakuAce banker and Group Managing Director of FBN Holdings, Urum Kalu Eke (UK Eke), has emerged winner of the prestigious Zik Prize in Professional Leadership Award for the year 2020 in recognition of his strides in the banking industry.\nAnd as GMD of FBN Holding’s, he has made his mark.\nAt FBN Holdings, he has continued to prove his mettle.\nIn 2020, however, the impact of the pandemic caused a marginal 1.9 percent drop in the earnings to N579.4 billion.\nFBN Holdings profit grew from N12.24billion in 2016 to N37.7billion in 2017, N58.23billion in 2018, N73.66billion in 2019 and N89.7 billion in 2020."
  },
  {
    "headline": "Fidelity Bank to develop SMEs capacity in non-oil exports sector",
    "summarized_story": "OBINNA EZUGWUTop Nigerian lender, Fidelity Bank Plc, in furtherance of its resolve to help Nigerian businesses build sustainable export capabilities, leading Nigerian lender, says it is set to host the 11th and 12th editions of its highly acclaimed Export Management Programme (EMP).\nLaunched in 2016, the EMP is targeted at preparing participants for real-time experiences in the international non-oil export markets and the broader export market at large.\nThe session typically covers a wide range of topics including Export documentation, Selection and Implementation of Supply Chain Management for Exports, Application of Export Development Business Processes amongst others.\nThe sessions would be facilitated by leading faculty from LBS, Nigerian Export Promotion Council (NEPC) staff as well as experts in financial management and exports.\nFidelity Bank has over the years demonstrated its resolve to grow the non-oil export side of the economy through strategic initiatives and partnerships."
  },
  {
    "headline": "United States boosts Nigeria’s public health emergency preparedness and response",
    "summarized_story": "The Consul General spoke on Friday at the closing and graduation ceremony after a two-week capacity-building exercise on public health emergency management.\nAbout 40 participants drawn from the NCDC, state-level ministries of health, Nigeria Port Health Services, and the Nigerian military were certified in the first cohort of the intermediate-level Public Health Emergency Management Professional Certification Program (PHEM PC) adapted from the US-CDC was delivered by Georgetown University, a leader in Public Health Emergency Management training.\nThe PHEM PC Program equipped emergency managers, incident managers, state epidemiologists, first responders, watch managers, and other public health experts with specialized training in crisis and emergency risk communication, public health emergency management functions, and operations.\nThe knowledge, competencies, and skill set taught in the course will help officials coordinate public health emergencies.\nFinally, following lessons learned from this pilot implementation, USG will continue to support NCDC to advance Public Health Emergency Management interventions in Nigeria at all levels."
  },
  {
    "headline": "Uko invites EFCC to investigate contractors, govt officials as Southeast roads collapse",
    "summarized_story": "We think it’s time to investigate why roads suddenly collapse, split in two, break in the middle or suddenly turn into craters and huge potholes.\n“But we wonder how come, same EFCC finds it difficult to investigate failed road projects.\nThere’s need for a thorough investigation into the causes of many failed roads.\nWhen will EFCC look into the cases of contracts awarded and jobs either poorly executed or not done at all.\n“These terribly failed roads were done by humans who believe they are untouchable."
  },
  {
    "headline": "FG Spent Over N8.9trn On Infrastructure In 6 Years – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo revealed yesterday that the federal government under President Muhammadu Buhari voted over N8.9trillion on infrastructural development across the country in the last six years.\nSpeaking at a ceremony to mark the 34 years of the creation of Akwa Ibom State in Uyo, the state capital, the vice president explained that the amount had been committed to series of infrastructural development in the country.\nOsinbajo who was in Uyo on the invitation of state governor, Udom Emmanuel, commissioned the multi-billion naira 21 storey smart\\intelligent at the Udo Udoma Banking Layout.\nHe said part of the cash had been deployed into railways, roads and other physical projects in the country.\nHe said his administration had to commit billions of funds accruable to the state in erecting the facility as IOCs had hinged their relocation to Akwa Ibom on accommodation and other enablers including security."
  },
  {
    "headline": "FG Spent Over N8.9trn On Infrastructure In 6 Years – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo revealed yesterday that the federal government under President Muhammadu Buhari voted over N8.9trillion on infrastructural development across the country in the last six years.\nSpeaking at a ceremony to mark the 34 years of the creation of Akwa Ibom State in Uyo, the state capital, the vice president explained that the amount had been committed to series of infrastructural development in the country.\nOsinbajo who was in Uyo on the invitation of state governor, Udom Emmanuel, commissioned the multi-billion naira 21 storey smart\\intelligent at the Udo Udoma Banking Layout.\nHe said part of the cash had been deployed into railways, roads and other physical projects in the country.\nHe said his administration had to commit billions of funds accruable to the state in erecting the facility as IOCs had hinged their relocation to Akwa Ibom on accommodation and other enablers including security."
  },
  {
    "headline": "Buhari Seeks Debt Forgiveness For Nigeria, Others At UNGA",
    "summarized_story": "‘‘Nigeria reaffirms that international trade is an engine for development and sustained economic growth, as well as the global eradication of poverty.\nPresident Buhari also expressed deep concerns at the devastating effects of small arms and weapons, calling for accountability in conventional arms trade.\nHe, therefore, urged President Buhari to continue to show leadership as he looks up to Nigeria to help stabilise the sub-region in terms of democracy and good governance.\nPresident Buhari applauded Mr Gutterres for his global leadership and the success of the 76th Session.\nPresident Buhari added that Nigeria was ready to support and work closely with the United Nations towards achieving the Sustainable Development Goals."
  },
  {
    "headline": "Buhari Seeks Debt Forgiveness For Nigeria, Others At UNGA",
    "summarized_story": "‘‘Nigeria reaffirms that international trade is an engine for development and sustained economic growth, as well as the global eradication of poverty.\nPresident Buhari also expressed deep concerns at the devastating effects of small arms and weapons, calling for accountability in conventional arms trade.\nHe, therefore, urged President Buhari to continue to show leadership as he looks up to Nigeria to help stabilise the sub-region in terms of democracy and good governance.\nPresident Buhari applauded Mr Gutterres for his global leadership and the success of the 76th Session.\nPresident Buhari added that Nigeria was ready to support and work closely with the United Nations towards achieving the Sustainable Development Goals."
  },
  {
    "headline": "Experts Explain How VAT Collection By States Will Work",
    "summarized_story": "Except for the few challenges identified in the possibility of states’ collection of VAT, the experts said it would be better for the states to be in charge of tax collection for developmental purposes.\nThey, however, raised concern that allowing states to collect VAT would have a negative impact on ease of doing business.\nThe law states that when a transaction involves two states, only the federal government has the power to make law on it.\nOjo said the two levels of government should not allow the VAT collection matter to create tension in the country.\nThe Southern Governors Forum, at a meeting in Enugu State last week, also took a joint position to support VAT collection by states."
  },
  {
    "headline": "Burna Boy shows off mansion to US magazine",
    "summarized_story": "Grammy-winning singer, Burna Boy has accorded the world a sneak peek into his home located in one of the high breed areas in Lagos State.\nThe paintings were done by little sister, Nissi, shout out to her.\nHere man, so this is my favourite room, the Burna room.\n“Here’s the first floor, my little sister Romi’s room, she has this weird ass ceiling.\nWith this development, Burna Boy becomes the first Nigerian entertainment personality to be featured on Architectural Digest’s Open Door series."
  },
  {
    "headline": "Burna Boy shows off mansion to US magazine",
    "summarized_story": "Grammy-winning singer, Burna Boy has accorded the world a sneak peek into his home located in one of the high breed areas in Lagos State.\nThe paintings were done by little sister, Nissi, shout out to her.\nHere man, so this is my favourite room, the Burna room.\n“Here’s the first floor, my little sister Romi’s room, she has this weird ass ceiling.\nWith this development, Burna Boy becomes the first Nigerian entertainment personality to be featured on Architectural Digest’s Open Door series."
  },
  {
    "headline": "Alleged fraud: ICPC docks PRODA DG, Charles Agulanna",
    "summarized_story": "By TONY ADAMSThe Independent Corrupt Practices and other Related Offences Commission (ICPC) has arraigned the Director-General of Project Development Institute (PRODA) Enugu, Engr.\nDr. Charles Agulanna before Hon.\nJustice Buba Ibrahim of the Federal High Court sitting in Enugu, for allegedly committing procurement fraud.\nOchigbo did not oppose the bail, but said the court should grant him bail with stringent conditions.\nThe Presiding Judge, Justice Buba Ibrahim therefore, granted bail to the defendant in the sum of N5m and two reliable sureties in the like sum."
  },
  {
    "headline": "Anger as Abia Poly students protest rape of three colleagues by Police RRS",
    "summarized_story": "Academic activities were put on hold Thursday as students of Abia State Polytechnic, Aba, blocked the Aba/Owerri Road axis leading to the school in protest against what they called failure of the school management to accredit the entire Engineering Department.\nA student of Civil Engineering who spoke with our Correspondent stated that the protest was necessitated by the failure of the school management to accredit the entire Engineering Department.\nMeanwhile, addressing the students in the company of armed military personnel, the rector of the polytechnic, Prof. Kalu Osonwa, said that he received messages that men of the Rapid Response Squad were assaulting the students.\nHe promised to look into the issues raised, including that of the accreditation of the Engineering Department, among others.\nMeanwhile, the Governor of Abia State, Okezie Ikpeazu, has condemned in the strongest of terms, the shooting by some Police officers on Thursday at the Abia State Polytechnic Aba during a protest by students of the institution."
  },
  {
    "headline": "Updated: Hawker Salle will be Nigeria's new music star [Videos]",
    "summarized_story": "A 17 year-old Nigerian girl simply called Salle will be Nigeria’s next music star.\nShe said she has written hundreds of songs in her diary and “would love to come with an Ep!!\nSo confident in her voice”, wrote Nigerian singer Johnny Drille on her page.\nSalle meanwhile is in Lagos, as a video of a photoshoot, shows her completely transformed.\nShe wrote: Good news on the way”, while thanking all those who have made her transformation possible."
  },
  {
    "headline": "D'Tigress book Afrobasket championship final, beat Senegal",
    "summarized_story": "By Muhyideen JimohD’Tigress, Nigeria’s senior women basketball team, on Friday in Yaounde defeated their Senegalese counterparts 73-63 to book a place in the final of the 2021 FIBA Women’s AfroBasket Championship.\nD’ Tigress who are defending champions had beaten Senegal in 2005, 2017 and 2019 to lift the women’s Afrobasket trophy, thereby making Friday’s encounter more titanic.\nThe Otis Hughley-tutored Nigerian ladies started the game in impressive fashion, taking the first quarter 22-11 and second quarter 23-20 to head into the break.\nNigeria will now meet Mali in the final on Sunday, Mali had earlier beaten host Cameroon in the first semi-final match.\nNigeria is seeking to become only the second nation to win three straight AfroBasket crowns since Senegal did it in 1970s"
  },
  {
    "headline": "Gov Abiodun Told To Release Ogun EndSARS Panel’s Report In Seven Days",
    "summarized_story": "Governor Dapo Abiodun of Ogun State has been asked to release or publish the recommendations of the Ogun State judicial panel on police brutality, otherwise known as EndSARS panel, within seven days.\n“We commend Your Excellency for swiftly acceding to the demands of millions of youths to set up the ENDSARS Panel.\n“The EndSARS panel was a public hearing, not a private hearing.\n“Since it was a public hearing, recommendations should be made public.\nThe counsel threatened to approach the court if Gov Abiodun failed to release the panel’s report in accordance with the FOI Act in seven days"
  },
  {
    "headline": "Constitution Amendment: Delays, Intrigues, Distrust As Nigerians Await New Law",
    "summarized_story": "Senator Ike Ekweremadu, the Deputy Senate President, was the Chairman of the Senate Committee on the Constitution Amendment at the time.\nDespite Ekweremadu’s legal competence and experience as a fifth-time member of the red Chamber, the Constitution amendment failed.\nHe said: “Nigerians who still express doubt that the Constitution amendment will not be passed are reminded of the PIB which was passed into law after 21 years.\nHe said the ongoing Constitution amendment provided ample opportunity for a working document to be produced to enable citizens take ownership of their own country.\n“Aside from the 9th Senate that is battling with the Constitution amendment, all other sessions, from first to the 8th have been running up and down trying to amend the Constitution, yet it didn’t work."
  },
  {
    "headline": "BREAKING: [Full Speech] Buhari Speaks At United Nations General Assembly",
    "summarized_story": "Nigeria’s President Muhammadu Buhari has addressed the 76th session of the United Nations General Assembly in New York, USA.\nIn his speech, President Muhammadu Buhari spoke on COVID-19, Terrorism, Corruption, global food system, human rights amongst other issues.\nMr. President,Let me, on behalf of the government and people of Nigeria, congratulate you on your well-deserved election as President of the 76th Session of the United Nations General Assembly.\nClimate change and unpredictable shocks, such as the current global pandemic, further exacerbate vulnerabilities in the global food system, requiring the UN’s urgent attention.\nNo reform of the United Nations system is more urgent than that of the Security Council."
  },
  {
    "headline": "BREAKING: FG Bans SSS1, SSS2 Students From Taking External WASSCE, NECO, NABTEB",
    "summarized_story": "Students in Senior Secondary School one and two are no longer allowed to apply for and take the external West African Senior School Certificate Examination, the National Examination Council, or the National Business and Technical Examinations Board.\nThis was stated in a circular sent to federal unity school principals by the Federal Ministry of Education.\nThe circular read, “The ministry’s attention has been drawn to the flagrant disregard to its directive on (the) writing of external examinations such as NABTEB (NTC and NBC), WASSCE, NECO (SSCE) by SS1 and SS2 students.\nAll students must write these examinations after they have been duly registered for the examination by the college.\n“All students of Federal Unity College should adhere strictly to the content of this circular."
  },
  {
    "headline": "Breaking: Nigeria’s D’Tigress subdue Senegal, set up Mail Afrobasket 2021 final clash",
    "summarized_story": "Nigeria’s D’Tigresses on Friday defeated their Senegalese counterparts 73-63 and landed in the final of 2021 Afrobasket final.\nThe Nigerian girls will now battle Mali in the final of the competition.\nMali had narrowly beat host Cameroon 52-51 at the end of their semifinal berth.\nDetails loading…"
  },
  {
    "headline": "Ailing economy: Nigerians bemused over NNPC’s audit declaration",
    "summarized_story": "According to them, over the years, the Corporation seems to have been managed only to record losses; BENJAMIN UMUTEME reports.\n“I am pleased to announce the declaration of profit after tax of N287 billion in 2020 by the Nigerian National Petroleum Corporation.\n“The NNPC losses were reduced from N803 billion in 2018 to N1.7 billion in 2019 and the eventual declaration of net profit in 2020 for the first time in its 44-year history.\nKyari said, “What we did to arrive at this (N287 billion profit), I think it is a continuous process.\nPeterside noted further that the Corporation dipped its fingers into the federation account to announce the N287 billion profits."
  },
  {
    "headline": "Right of VAT collection remains with FIRS, AGF Malami insists",
    "summarized_story": "The chief law officer of the federation explained that the ruling of the Court of Appeal that FIRS and the Rivers Government maintain status quo favoured FIRS.\n“So with that in mind, the Federal Government has succeeded in obtaining an order that establishes the sustenance of the status quo, which status quo is that the Federal Inland Revenue Service should continue collection.\n“This is pending the determination of the cases that were instituted by states, particularly the Rivers State Government and the Lagos State government.\nA three-member panel of the Court of Appeal headed by Haruna Tsammani, issued the order being challenged at the Supreme Court by the Rivers government.\n“And we are taking steps to consider the possibility of instituting an action before the Supreme Court for the purpose of having this matter determined once and for all,’’ Malami said."
  },
  {
    "headline": "NAFDAC warn Nigerians against use of carbide on fruits -NigPilot",
    "summarized_story": "The officials of the National Agency for Food and Drug Administration and Control (NAFDAC) are currently on surveillance in all nooks and crannies of the country to track and arrest anyone found using carbide to ripen fruits.\nThe Director-General of NAFDAC, Prof. Mojisola Christianah Adeyeye, who disclosed this at a sensitization campaign in Onitsha, Enugu state, warned sellers of fruits including oranges, banana, plantain and many others to desist from using carbide or risk being arrested.\nRepresented by the Director of Public Affairs of the agency, Dr Abubakar Jimoh, the NAFDAC Director-General, however, appealed to Nigerians to be on the alert and report anyone found using carbide to ripen fruits to the nearest NAFDAC office or the law enforcement officials.\nShe lamented that those who engage in such sharp practices at the altar of public health is a great disservice and that they are undermining the health system in Nigeria.\nBut now people just want to make quick gain at the detriment of public health."
  },
  {
    "headline": "Ethnic youth leaders to Secondus, PDP: Your call for CBN gov’s resignation baseless, sign of weak NWC -NigPilot",
    "summarized_story": "Nigerian Ethnic Youth Leaders Council, NEYLC, is alarmed over the call made by the Peoples Democratic Party, PDP, that the governor of the Central Bank of Nigeria, CBN, Godwin Emefiele, should resign.\nThe council, which is made up of the Arewa Consultative Youth Movement, Ohanaeze Ndi Igbo Youth Movement, Oduduwa Youths and Middle Belt Youths, is of the strong view that the call is baseless considering the monumental strides of the apex bank under Emefiele’s leadership.\n“The call is laughable and a sign of a weak National Working Committee, NWC, of an opposition party which is ready to play politics with everything, no matter how unreasonable.\n“We pity Ologbondiyan and Secondus because they are like the proverbial drowning men that are desperately looking for a straw to hold on it.\n“We’re really dismayed at the level that which ambition can push people to,” the council noted."
  },
  {
    "headline": "Ortom accuses Buhari of dividing Nigeria -NigPilot",
    "summarized_story": "BENUE State Governor, Samuel Ortom has accused President Muhammadu Buhari of jettisoning the vision of the nation’s founding fathers which was hinged on unity and oneness and instead is pursuing an ethnic agenda.\nOrtom said instead of bringing Nigeria together, the president had succeeded in dividing the country with intimidation and marginalization.\nOrtom said for Nigeria to move in the path of unity and oneness, the people of Eastern Nigeria should be provided with adequate infrastructure.\nOrtom said whereas former President Goodluck Jonathan never threatened or intimidated anybody, under President Buhari, intimidation of dissenting voices in a democracy has been the order of the day.\nOrtom, however, pleaded with Ndigbo not to destroy infrastructure in their place since what they are destroying belongs to them."
  },
  {
    "headline": "NYSC: Army apologies to victim of rights abuse -NigPilot",
    "summarized_story": "He however assured that the rights of the citizenry is sacrosanct and must be respected by all personnel of the Nigerian Army, as any form of infraction will be severely dealt with.\n“It is against this premise that the NA condemns this unimaginable level of infraction by a personnel in its ranks.\nThe Army spokesperson said that the officer’s actions has undoubtedly caused the NA monumental embarrassment and is highly regrettable.\nHe added that the unfortunate act of indiscipline does not in anyway represent the NA and will not be condoned in its entirety.\nThe Service enjoined the public to continue to report such infractions, as Human Rights Desks in all formations of the NA are emplaced to deal decisively with such erring personnel."
  },
  {
    "headline": "What Buhari Told World Leaders At UN General Assembly",
    "summarized_story": "President Muhammadu Buhari spoke on a long list of critical issues on Friday as he addressed world leaders at the 76th Session of the United Nations General Assembly (UNGA76).\nHe took to the podium to address the world leaders after President Nicos Anastasiades of Cyprus at the General Debate of the session at the UN Headquarters in New York, the United States.\nHe reiterated that leaders of individual member-states must adhere to the constitutional provisions of their countries, particularly on term limits.\nNigeria will continue to play its part fully in supporting United Nations peacekeeping operations within Africa and beyond.\nMr. President,55 No reform of the United Nations system is more urgent than that of the Security Council."
  },
  {
    "headline": "Foreign Debts Not For Recurrent Expenditure – Lai",
    "summarized_story": "The Federal Government has clarified that the debts being taken are not for funding recurrent expenditures but for implementing capital projects which previous administrations failed to carry out.\nThese critics are very insincere; we do not borrow for recurrent expenditure neither do we borrow to pay salaries.\nWe are borrowing to build world-class infrastructures that will benefit generations of Nigerians and we have a lot to show from the loans we have taken.” Mohammed stated.\nAccording to him, the Federal Government has over 13,000 kilometers of federal roads under repair, rehabilitation and reconstruction.\n“For example, in their time they claimed to have spent billions of naira in building infrastructure but as one can see their infrastructure projects are only on the pages of newspapers."
  },
  {
    "headline": "FG, States, LGs Share N696.965bn As VAT Revenue Hits N166.228bn",
    "summarized_story": "This comes as the nation records a significant increase in the collection of Value Added Tax (VAT) and import duty, amid the lingering controversy over whose responsibility it is to collect VAT.\nThe communique issued at the end of the meeting indicated that the gross revenue available from the Value Added Tax (VAT) for August was N166.228 billion.\nAccording to it, the Federal Government got N24.934 billion of the revenue generated from VAT, while the states and local government councils (LGCs) received N83.114 billion and N58.180 billion respectively.\nThe communique indicated that total revenue distributable for the month included gross statutory revenue of N477.504 billion, VAT of N166.228 billion, exchange gain of N2.830 billion, excess bank charges recovered of N0.403 billion, and N50 billion from non-oil revenue.\nThis brings the total distributable revenue to N696.965 billion for the month of August."
  },
  {
    "headline": "Buhari’s Address At UN General Assembly [FULL SPEECH]",
    "summarized_story": "President Muhammadu Buhari on Friday addressed world leaders at the 76th Session of the United Nations General Assembly (UNGA76).\nHe gave the speech at the high-level General Debate of the summit ongoing at the UN Headquarters in New York, the United States.\nNigeria fully supports the efforts by ECOWAS to address this growing challenge and appreciates the support of both the African Union and the United Nations.\nClimate change and unpredictable shocks, such as the current global pandemic, further exacerbate vulnerabilities in the global food system, requiring the UN’s urgent attention.\nMr. President,55 No reform of the United Nations system is more urgent than that of the Security Council."
  },
  {
    "headline": "‘This Song Belongs To Us’: Young Taliban Dancing To A Different Tune",
    "summarized_story": "As the setting sun turns the Arghandab river violet, seven young Taliban turn in a circle on the bank, singing and dancing in traditional Afghan style.\nSince the group’s return to power in mid-August, even its leaders seem to have relaxed slightly on the topic — at least in larger cities, where people are not being punished for listening to music.\nThe young Taliban under the bridge have come here to relax before they head back to Kandahar, the group’s spiritual birthplace, just 10 kilometres (six miles) away.\n“This song belongs to us, it belongs to our country,” says Hafiz Mudasir, a dancer in his twenties.\nHe tells AFP such violence is the price the Taliban pay to “spread Islam in the region”."
  },
  {
    "headline": "Call off your strike now, Sultan appeals to striking doctors",
    "summarized_story": "The Sultan of Sokoto Muhammad Sa’ad Abubakar has appealed to the striking National Association of Resident Doctors to call off their ongoing industrial action and embrace dialogue.\nSultan Abubakar made the call during the opening ceremony of the the 20th conference of the Pediatric Surgeons of Nigeria holding in Sokoto.\nHe said the striking doctor should also respect the court order that asked them to call off the strike.\nHe advised the striking doctors to engage elders, traditional rulers and other stakeholders to engage the government in dialogue.\nHe said at least the government can establish one specialised children hospital in each of the six geopolitical regions in the country."
  },
  {
    "headline": "Just In: Reps Committee on Ecological Funds visits erosion site in Agbor -",
    "summarized_story": "House of Representatives Committee on Ecological Funds has visited the one kilometre erosion site at UBE Road, Off Uromi Junction, Agbor, Ika South Local Government Area of the state with a pledge to intervene urgently.\nChairman of the Committee, Ibrahim Ayokunle Isiaka who led members of the Committee said that they were at the site to assess the impact of the ecological disaster in the area."
  },
  {
    "headline": "BREAKING: Chief Magistrate remands dismissed officer for killing Monsurat Ojuade -",
    "summarized_story": "The alleged killer of 18-year old Monsurat Ojuade, Sergeant Samuel Philips, has been brought before Chief Magistrate, Adeola Adedayo, of the Yaba Magistrates’ Court.\nThe officer who has now been dismissed from the Nigeria Police Force, following the conclusion of his orderly room trial, is to be tried for shooting Miss Ojuade in the Ijeshatedo area of Surulere, On September 11th.\nFurther hearing was adjourned to October 25.\nThe defendant was represented by Doyin Shobiye, while lawyer for the Ojuade Family, Israel Mbaebie, was also present in court.\nMr Mbaebie Urged the police to change its “stray bullet” narrative as to how the deceased died."
  },
  {
    "headline": "We're committed to fight against cholera outbreak",
    "summarized_story": "The Oyo state government has assured residents of the state of its preparedness towards fighting cholera outbreak in the state.\nThe Permanent Secretary of Oyo state ministry of Health, Ayoola Adebisi gave the assurance while speaking at a press conference in Ibadan.\nThe permanent secretary said proactive measures are being put in place to ensure prevention of the outbreak through sensitisation of health workers across the 33 local governments of the state.\nAccording to him, the state hereby wishes to assure the populace of effective preparedness for prevention of outbreak of cholera and wish to implore the populace to properly dispose of their faeces and refuse and improve on their personal hygiene.\nHe said areas where cases of the outbreak have been recorded have been put the check."
  },
  {
    "headline": "Yoruba Group Accuses FG Of Sponsoring Pro-Buhari Protesters at the UN – Trending with Ojy Okpe",
    "summarized_story": "Meanwhile, a viral video that has now caught the attention of the Nigerian Army shows a female officer identified as Lieutenant Chika Anele pouring muddy water on a youth corps member, who she had accused of flouting an order.\nIn the video, the youth Corp member, who goes by the name Ezeiruaku Fidelia, was seen kneeling before Lt. Chika while the muddy water was being used to dehumanize her.\nPrecious Chikwendu, the estranged wife of Nigeria’s ex-minister of Aviation Femi Fani-Kayode, is seeking the enforcement of her fundamental human rights.\nPrecious is claiming the sum of N800 million Naria in damages for the roles they played in intimidating and harassing her during the pendency of her custody suit.\nFollowing the large-scale expulsions of Haitian migrants to their homeland in the past week, the Biden administration’s special envoy to Haiti Daniel Foote, resigned in protest on Thursday."
  },
  {
    "headline": "Kim’s Sister Says North Korea Ready End War with South If Conditions Met",
    "summarized_story": "Kim Yo-jong was responding to a renewed call from the South to officially declare an end to the Korean War.\nThe idea was initially dismissed by a top North Korean minister as “premature”.\nSouth Korea earlier this month tested its first submarine-launched ballistic missile, just hours after the North tested their own weapon.\nNorth Korea in turn has called for crippling economic sanctions to be lifted first.\nBut the US has repeatedly said that North Korea must abandon its nuclear weapons first before any sanctions can be lifted."
  },
  {
    "headline": "Executions Will Return to Afghanistan, Says Senior Taliban Official",
    "summarized_story": "The Taliban’s notorious former head of religious police has said extreme punishments such as executions and amputations will resume in Afghanistan.\nHe said these punishments may not be meted out in public, as they were under previous Taliban rule in the 1990s.\nBut he dismissed outrage over their past public executions: “No-one will tell us what our laws should be.”Since taking power in Afghanistan on 15 August the Taliban have been promising a milder form of rule than in their previous tenure.\nAmnesty’s Secretary-General Agnès Callamard said at the time that the “cold-blooded brutality” of the killings was “a reminder of the Taliban’s past record, and a horrifying indicator of what Taliban rule may bring”.\nAt the time Turabi was justice minister and head of the Ministry of Propagation of Virtue and Prevention of Vice – the Taliban’s religious police."
  },
  {
    "headline": "Catalan Separatist Carles Puigdemont Arrested in Italy",
    "summarized_story": "Exiled Catalan separatist leader Carles Puigdemont has been detained in Italy on a Spanish arrest warrant.\nHe lives there and sits as a member of the European Parliament.\nMr Puigdemont had travelled to the Mediterranean island for a Catalan folklore festival, his lawyer said.\nAfter Mr Puigdemont and two ministerial colleagues fled, Spain jailed nine other Catalan leaders for sedition for their role in the breakaway vote.\nCatalonia’s new president Pere Aragones – also a separatist – condemned what he called the “persecution” of Mr Puigdemont."
  },
  {
    "headline": "African Leaders Highlight Vaccine Inequity in UN General Assembly Speeches",
    "summarized_story": "The inequity of COVID-19 vaccine distribution came into sharper focus on Thursday as many leaders of African countries, whose populations have little to no access to the life-saving shots, stepped to the podium to speak at the United Nations General Assembly.\nAlready, the struggle to contain the coronavirus pandemic has featured prominently in world leaders’ speeches during the past few days – many of them delivered remotely because of the coronavirus itself.\n“It is, therefore, a great concern that the global community has not sustained the principles of solidarity and cooperation in securing equitable access to COVID-19 vaccines,” he said.\nZimbabwe’s President Emmerson Mnangagwa called on the international community to exercise “enhanced multilateralism and a unity of purpose’ in vaccine distribution.\n“Vaccine nationalism is self-defeating and contrary to the mantra that no one is safe until everyone is safe,” added Mnangagwa."
  }
]