[
  {
    "headline": "Better stay in Nigeria to study than face war, racism overseas – Shehu Sani",
    "summarized_story": "Immediate past Senator representing the Kaduna Central Senatorial District, Shehu Sani, has advised Nigerians to settle for studying in government-owned universities, rather than face war and racism in their quest for education abroad.\nHe stated via his Twitter page that students “dying to study abroad” should instead “stay at home” and cope with incessant strikes by the Academic Staff Union of Universities.\n“Those who are dying to study abroad, stay at home and get into federal or state university.\nIt’s better to hustle with ASUU than war and racism,” he tweeted.\nSani’s tweet comes amid the reports of Nigerian students stranded in Ukraine which is facing an ongoing war with Russia."
  },
  {
    "headline": "China vows cooperation with North Korea under ‘new situation’ – Report",
    "summarized_story": "North Korea, officially known as the DPRK, carried out an unprecedented seven weapon tests in January — including its most powerful missile since 2017 — with negotiations with the United States at a standstill.\nIt paused testing during the Beijing Winter Olympics, with analysts saying the decision could have been made out of deference to China.\nIn his message to North Korean leader Kim Jong Un, Xi said Beijing was ready to “develop the China-DPRK relations of friendship and cooperation” under a “new situation”, the official Korean Central News Agency reported.\nNorth Korea is reeling economically from a self-imposed coronavirus blockade, and restarted cross-border trade with Beijing last month.\nSome experts have warned that with the eyes of the world focussed on the Russian invasion of Ukraine, North Korea might take the opportunity to test-fire long-range missiles."
  },
  {
    "headline": "Imo Bye-Election: Early voting begins, as APC, PDP battle soul of Ngor Okpala",
    "summarized_story": ",The Bye-Election to fill the vacant Ngor Okpala State Constituency seat at the Imo State House of Assembly began as scheduled at 8 am across the constituency.\nThe early voting is credited to the early arrival of election materials by the Independent National Electoral Commission (INEC).\nAs of 7 am Wazobia Politics observed the arrival of materials across most polling units with INEC staff setting up polling booths for the most anticipated election of the year in Imo State.\nThe main contestants in today’s Bye-Election are Amajirionwu Blyden Okanni of the All Progressives Congress (APC), Emeka Nwachukwu of the Peoples Democratic Party (PDP) and Christopher Nwaiwu of the All Progressives Grand Alliance (APGA).\nThe outcome of the endorsement will be seen at the end of today’s election."
  },
  {
    "headline": "C’River bye-elections: Massive voter turnout as voting begins",
    "summarized_story": "..it’s a peaceful exercise … Ayade’s aideBy Ike Uchechukwu,OgojaThere is a massive voter turnout turn at Mbumbe west, ward II,007 with 820 registered voters on the list.\nVoting started at exactly 8: 48a.m at the polling station located at Christ The King Primary School Odajie-Mbube, Ogoja LGA, Cross River state.\nAccording to Joseph Bullem who was the first to cast a vote at the Polling Unit, he said he believes it would be an all-around peaceful exercise as everything is working perfectly.\n“We believe more people will come out to exercise their right by voting their preferred candidate today.\nOjie also expressed happiness over the massive turnout of voters to participate in the exercise he said he knows there was still about 5 hours before the close of the exercise and believes more people will come to exercise their franchise."
  },
  {
    "headline": "Gov Emmanuel inspects legacy projects",
    "summarized_story": "…Says timely completion non-negotiableAll major projects undertaken by the Akwa Ibom State Government by the present administration will be completed on time and commissioned, Governor Udom Emmanuel has assured.\n“I’m impressed with the standard, the pace and then the quality of delivery.\nWe had some expectations but as we can see here, they have gone beyond the standards we set for them.\n“Everything you’re seeing here right now apart from passing through the ring road III and then taking it to the outfall station.\nIf you check what we’ve buried under the ground, it goes beyond normal politics to get this done."
  },
  {
    "headline": "APC National Convention: Senator Sani Musa visits Governor el-Rufai",
    "summarized_story": "I will give you all my Support, Continue with your consultation drive, reach out to all the governors and other stakeholders, El- Rufai tells MusaBy Henry UmoruAHEAD of March 26 National Convention of the All Progressives Congress, APC, Chairman, Senate Services Committee, Senator Sani Musa, APC, Niger East has paid a courtesy visit to the Kaduna State Governor, Mallam Nasir El- Rufai.\nSenator Musa, a frontline national chairmanship aspirant of the APC for next month’s National Convention of the party was in Kaduna alongside members of his campaign team.\nMusa said, ” I visited my brother, the Kaduna State governor, Mallam Nasir El- Rufai with my campaign team where I reiterated my aspiration to become the next National Chairman of our party, the ruling APC.\n“I also told the Governor of my plans to initiate and manage national, zonal and states websites under one roof and rebrand the APC to a world-class political institution in line with international best practices.\nIt is unique and cost-effective means with features ranging from conflict resolutions to management of constituents, Supporters, Volunteers, Workers, members, Voters and Constituencies."
  },
  {
    "headline": "Electoral Act: It’ll bring us closer to free, fair elections — CSOs, Foundation commend Buhari",
    "summarized_story": "By Gabriel Ewepu, ABUJACIVIL Society Organisations, CSOs, and One Love Foundation, OLF, yesterday, commended President Muhammadu Buhari, over the signing of the Electoral Act Amendment Bill into law.\nThe statement reads in part, “We of the above organisation and being a joint CSO, wish to commend President Muhammadu Buhari for finally signing the Electoral Act Amendment Bill into law.\nAlso Read:2023: I’m fit to rule Nigeria — Tinubu“We also commend the National Assembly, Civil Society Organisations, and all Nigerians that insisted that we deserve a new law that will guarantee fairer elections in 2023 and beyond.\n“For too long, the old electoral law had been part of the problem.\nWe can now seek to elect our leaders having in mind the current challenges facing our country.”Vanguard News Nigeria"
  },
  {
    "headline": "2023: Youths should compete with elders if they want to rule – Atiku",
    "summarized_story": "Former Vice President Atiku Abubakar has challenged Nigerian youths to compete with the elders if they want to rule the nation.\nAtiku spoke with newsmen after a closed-door meeting with former President Olusegun Obasanjo in Abeokuta, the Ogun State capital.\nAsked to react to calls on older politicians to leave the stage for the youths, Atiku said the youths should also contest.\n“Let the youth compete.\nAtiku later met with the Alake and Paramount Ruler of Egbaland, Oba Adedotun Gbadebo in his palace."
  },
  {
    "headline": "Controversy, tension over Zamfara deputy Governor’s impeachment",
    "summarized_story": "There is serious tension and controversy over the impeachment of former Zamfara State Deputy Governor, Barrister Mahdi Aliyu Gusau by the State House of Assembly.\nThe PDP had stated that after extensive review of the impeachment, Barrister Mahdi Aliyu Gusau still remains intact as the Deputy Governor of the State.\nReacting swiftly over the impeachment of the deputy Governor, the State legal Adviser of the Peoples Democratic Party, (PDP), Barrister Bashir Abubakar Masama had also described the impeachment as illegal.\nAlso, in a press statement signed by the principal private secretary to the former Deputy Governor, Mr. Aminu Umar, he said since the deputy Governor refused to defect to APC with the Governor last year, the monthly allocation of N30 million naira to his office had been stopped.\n“Both the House of Assembly and the 7 man judicial panel did not give the deputy Governor a fair hearing at all."
  },
  {
    "headline": "Russia-Ukraine crisis: What Poland said about stopping Nigerians from entering their country – Oby Ezekwesili",
    "summarized_story": "Nigeria’s former Minister of Education, Dr Oby Ezekwesili has said that she has gotten answers to reports that Poland is not allowing Nigerians fleeing Ukraine to enter their country.\nNigerians and nationals of other countries are now entering Poland and other neighbouring nations for safety.\nHowever, the Nigerian Government on Thursday expressed concern over Poland‘s refusal to allow Nigerians fleeing Ukraine into the country.\n“I went in search of *Answers* to disturbing news we’ve been reading about Nigerians seeking entry into Poland,” she tweeted.\n“Once you cross the border from Ukraine into Poland, please shout out to be located."
  },
  {
    "headline": "Anyaoku, Anambra elders lament worsening insecurity, proffer solutions",
    "summarized_story": "Anambra State Elders’ Council has decried the worsening insecurity in the State, while also condemning incessant crimes by young and unknown persons.\nIn a meeting of the council, which held at the Governor’s lodge, Awka, the council which consists of eminent personalities, said empowerment of youths can stem youth involvement in crimes.\nThe council enjoined traditional rulers and Presidents-General of communities and other stakeholders, to ensure their youths imbibed the right values and avoid destructive vices, like violence and drug abuse.\n“The meeting acknowledged that the Citizens of Anambra State successfully and transparently voted in the gubernatorial elections held on Nov. 6, 2021.\n“The meeting also congratulated the Governor-elect Prof. Chukwuma Soludo on his outstanding electoral victory."
  },
  {
    "headline": "Russian-Ukraine war: I’m prepared to fight, sacrifice my life – Klitschko",
    "summarized_story": "Retired Ukrainian boxer, Vitali Klitschko has announced plans and preparation to fight for his country against Russia following the attack sanctioned by President Vladimir Putin.\nHe pledged to lay his life for his country as he joined the army in fighting the Russian troops.\nWhen Klitschko was asked if he would join forces with the Ukrainians to fight the Russians, he said it was an obligation for himself.\nI believe in Ukraine, I believe in my country and I believe in my people,” Klitschko said.\nRecall that Putin had declared war on Ukraine and warned the United States and allies in the west not to interfere, else they will face severe consequences."
  },
  {
    "headline": "W/Cup qualifer: Poland to boycott Russia match over invasion of Ukraine",
    "summarized_story": "Poland will refuse to play their forthcoming World Cup play-offs with Russia in March following the country’s invasion of Ukraine.\nThe Polish FA has also offered to host all Ukraine home matches while Ukraine are unable to play in their own country.\nDue to the escalation of the aggression of the Russian Federation towards Ukraine, the Polish national team does not intend to play the play-off match against Russia.\nI can’t imagine playing a match with the Russian National Team in a situation when armed aggression in Ukraine continues.\nBut there is a widespread feeling among officials displays of support for Ukraine should not be judged in this light."
  },
  {
    "headline": "Imo Bye-election: Voting begins in Ngor-Okpala",
    "summarized_story": "Voting has begun in various polling units at Ngor-Okpala Local Council Area of Imo for the vacant State constituency seat of the area.\nSome of the places The Nation visited include Logara/Umuohiagu ward where voting already began at Ndiuhu Umuokoada Logara village square (PU 002), Primary School, Umuorisha Umuohiagu (PU 008) and Umuchoko junction, Umuohiagu (PU 012).\nOther polling units visited in the ward are Umuohiagu town hall (PU 011) and Umuoro village square, Umuohiagu (PU 007).\nAlso, voting has begun in the following polling units at Ohelekem Nnorie ward: Central School Nnorie (PU 004), Umuedi Nnorie hall (PU 008) and Ekeukwu Nnorie market square (PU 006).\nIn Umuhu ward, voting has begun at Umueme Village Hall (PU 005), Umuota village hall (PU 003) and Union Primary School, Egbelu (PU 001)."
  },
  {
    "headline": "Russia-Ukraine conflict: NATO activates force for ‘first time’ in history",
    "summarized_story": "The NATO Response Force (NRF) has been activated as a defensive measure in response to Russia’s ongoing invasion of Ukraine.\nThis is the first time the Response Force will be activated since it was formed in 2002 at the Prague summit.\nAll 30 members of NATO must agree to activate the force, which they had earlier agreed on Thursday.\nThe NATO Response Force, which consists of about 40,000 troops, is a highly ready and technologically advanced multinational force made up of land, air, maritime and Special Operations Forces (SOF) components that the Alliance can deploy quickly, wherever needed.\nThe activation of the response troops does not mean that any US or NATO troops will go into Ukraine, which is not a member."
  },
  {
    "headline": "Fire guts shops at Ladipo market",
    "summarized_story": "Fire has engulfed some buildings of the spare parts stores at Ladipo market in Mushin, Lagos State.\nSeveral shops situated at a section of the market called – Aguiyi Ironsi International Trade Center, Paramo, Ladipo Market were razed during the incident.\nPresident-General, Ladipo Central Executive Auto Dealers Association (LCEADA), Jude Nwankwo in a Facebook live on his page monitored by The Nation, called for support and prayer.\n“I’m reporting live at the scene, this is Ladipo President speaking, I don’t know what the cause of this fire is, all the time, we need your intervention.\nEmergency responders comprising LASEMA Response Team, (LRT), LASEMA Response Unit Fire, (LRU fire), Lagos State and Federal Fire services were also at the scene making concerted efforts to subdue the inferno as at time of report."
  },
  {
    "headline": "Edo bank robbery: Speaker blames lack of intelligence by security agencies",
    "summarized_story": "Speaker of Edo State House of Assembly, Marcus Onobun, has blamed Thursday’s armed robbery incident at Uromi, Esan Northeast Local Government Area of the state on lack of intelligence by security agencies and the porous nature of the ancient town.\nOnobun, an Esan man, yesterday, while speaking on a national television, which was monitored in Benin, condemned the armed robbery, which was carried out by no fewer than 20 gunmen who operated for over two hours.\nOnobun said: “What happened at Uromi on Thursday came to us as a rude shock.\nSo, this is part of the investigations that the security agencies have to carry out.\nWe also need to know how the criminals got into Uromi, that the security agencies were unable to pick on them, and they drove freely.”"
  },
  {
    "headline": "Buhari finally signs Electoral Act Amendment Bill into law",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari at exactly 12:27 signed the long-awaited Electoral Act Amendment Bill 2021 into law.\nOur sister publication, Daily Sun, had correctly reported yesterday that President Muhammadu Buhari would about noon on Friday (today) assent to the long-awaited Electoral Act Amendment Bill 2021.\n“It is gratifying to note that the current Bill comes with a great deal of improvement from the previous Electoral Bill 2021.\nPresident Buhari noted that the National Assembly forwarded the Electoral Bill for Presidential Assent, via a letter dated 31st January 2022.\nThe Senate President, Dr Ahmed Lawan, commended Buhari for signing the bill into law despite his reservations on 84(12) of the Electoral Bill, 2022."
  },
  {
    "headline": "Ten things to know about new Electoral Act 2022",
    "summarized_story": "By Fred ItuahAs promised, President Muhammadu Buhari on Friday signed the Electoral Act Amendment Bill into law.\nThe new legal framework for Nigeria’s elections contains key provisions aimed at improving the quality and credibility of elections and addresses certain deficiencies in the previous Electoral Act.\nSection 47 gives legislative backing for smart card readers and any other voter accreditation technology that the Independent National Electoral Commission (INEC) deploy.\nSection 50 gives INEC the legal backing for electronic transmission of election results.\nMeanwhile, an extraordinary meeting of the Independent National Electoral Commission is billed for Saturday, February 26, 2022 after which a statement would be issued."
  },
  {
    "headline": "Money, not love, will determine who I’ll marry – Ebun Hodo",
    "summarized_story": "For budding actress and fashion entrepreneur, Ebun Hodo, money overrides love.\nAccording to the fair-complexioned script interpreter, money, not love will determine whom she’ll marry.\nI can marry for money.\nI love money and if my love for money will make you find me unattractive, then let it be.\nMoney overrides love."
  },
  {
    "headline": "Five years after, Evans, 2 others bag life jail for kidnapping",
    "summarized_story": "By Lukman OlabiyiA Lagos State High Court, Ikeja has convicted and sentenced notorious kidnap kingpin, Chukuwuememe Onwuamadike, otherwise known as Evans, to life imprisonment for kidnapping.\nJustice Hakeem Oshodi of the Lagos State High Court found Evans guilty of a two-count charge bordering on conspiracy and kidnapping of the Managing Director of Maydon Pharmaceuticals Limited, Donatus Dunu.\nApart from Evans, other two other members of his gang were also found guilty by the court for same offence.\nEvans was arrested on June 10 2017 in Lagos by the police.\nEvans is also facing similar charges before Justice Oluwatoyin Taiwo and Justice Adedayo Akintoye of the same court."
  },
  {
    "headline": "Biafra: My pact with Ojukwu -Uwazuruike",
    "summarized_story": "Founder and leader of Biafra Independent Movement/ Movement for the Actualization of the Sovereign State of Biafra (BIM/MASSOB), Chief Ralph Uwazuruike says he has not wavered in his commitment to the Biafra cause.\nThey are the ones who would come to say Uwazuruike has been settled, that Uwazuruike has collected money.\nEven if I start a party today, they will be the ones to sabotage it.\nThere are only two parties in Nigeria today: the PDP and the APC that can contest for the presidency in the real sense.\nThey cannot use what they have to get what they want because they hate Uwazuruike and they are afraid to be associated with Biafra."
  },
  {
    "headline": "Relief as Buhari Signs Electoral Act, Demands Alteration of Clause Banning Political Appointees",
    "summarized_story": "The Independent National Electoral Commission (INEC) was jolted into action by the signing and summoned an extraordinary meeting of the Commission for today in Abuja, to discuss how to swiftly implement the Electoral Act 2022.\nHe, however, stressed the need to amend section 84 (12), which contravenes the rights of political office holders to vote or be voted for in political party conventions and congresses.\nHe said: “It is gratifying to note that the current Bill comes with a great deal of improvement from the previous Electoral Bill 2021.\nINEC Holds Emergency MeetingMeanwhile, INEC will hold a meeting today over the implementation of the Electoral Act 2022.\n“The nation now has the Electoral Act 2022 which replaces the Electoral Act 2010 (as amended)."
  },
  {
    "headline": "Race to $200bn: CBN Unveils Incentives to Boost FX Repatriation",
    "summarized_story": "*Offers N65 for every $1 repatriated and sold at I&E window for third party useJames Emejo in AbujaThe Central Bank of Nigeria (CBN) yesterday released guidelines for the implementation of the RT200 (Race to US$200 billion in FX Repatriation) Non-oil Export Rebate Scheme with immediate effect.\nThis was contained in the CBN circular titled, Operating Guidelines for RT200 Non-oil Export Rebate Scheme, signed by Director, Trade and Exchange Department, Dr. O.S.\nCBN Governor, Mr. Godwin Emefiele, had earlier this month announced a new programme to stimulate the country’s non-oil exports segment and achieve $200 billion repatriation of proceeds between three and five years.\nEmefiele said the scheme, code-named, “Race to US$200 billion in FX Repatriation (RT200 FX Programme)”, which takes immediate effect, consisted of a set of policies, plans and programmes for non-oil exports which would help the country attain its goal of $200 billion in FX repatriation, exclusively from non-oil exports transactions over the next three to five years.\nThe rebate scheme is designed to incentivise exporters in the non-oil export sector to encourage repatriation and sale of export proceeds into the FX market."
  },
  {
    "headline": "Russian Troops Enter Ukraine’s Capital, Kyiv, as Putin Calls on Military to Seize Power from Embattled Zelenskyy",
    "summarized_story": "Reports yesterday afternoon indicated that the Russian forces entered the Obolon district in the north of the city, just a few miles from the centre of Kyiv.\nAccording to the BBC, the Russian forces in Kyiv massed around the northern district of Obolon.\nAlso, the Ukrainian forces reportedly pushed the Russian forces back, having blown up the city bridge to stop their advancement.\nPutin Tells Ukrainian Military to Seize PowerPutin has called on the Ukrainian military to seize power in their country.\n“We support every effort being made to stop the aggression and Russian troops to return to Russia,” Onyeama said."
  },
  {
    "headline": "Breaking: Court Freezes Katsina LGs Joint Account",
    "summarized_story": "Francis Sardauna in KatsinaA Federal High Court sitting in Abuja has ordered the freezing of the Katsina State Local Governments Joint Account following the inability of the state government to pay the entitlements of the dissolved local government chairmen and councillors.\nThe court, presided over by Justice Emeka Nwite, in a suit number FHC/ABJ/CS/122/2022, ordered that the state’s local government joint account should remain frozen till March 21, 2022.\nMajigiri explained that the Federal High Court, in a garnishing order issued on 16th February, has frozen the joint account of the state local governments till March 21, 2022.\nHe said: “When Aminu Masari refused to comply with the judgment of the Supreme Court, we decided to go and seek a garnishing order from the Federal High Court and the garnishing order has been granted by the court.\nHe added that the state government would present all evidence of payment before the Federal High Court on the next adjournment date of March 21, 2022."
  },
  {
    "headline": "In Signing Electoral Law, Buhari Asks N’Assembly to Amend Section that Bars Political Appointees from Participating in Party Primaries",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari on Friday signed into law the reworked Electoral Act Amendment Bill transmitted to him by the National Assembly on January 31 with a call on the legislative arm to delete Section 84(12) of the Act which bars political office holders from participating in their parties’ primaries.\nHe, however, stressed the need to amend section 84(12), which contravenes the rights of political office holders to vote, or be voted for in political party conventions and congresses.\nHis words: “Distinguished Senators and Honourable Members of the National Assembly, from the review it is my perspective that the substance of the Bill is both reformative and progressive.\nI am making this bold declaration because I foresee the great potentials of the Bill.\nWorthy of note include the democratic efficacy of the Bill with particular reference to sections 3, 9(2), 34, 41, 47, 84(9), (10) and (11) among others."
  },
  {
    "headline": "EXCLUSIVE: President Buhari's Government Plots To Add Office Of Chief Justice, Attorney-General, Others To List Of Political Leaders With Immunity",
    "summarized_story": "It was gathered that the cabals wanted the House of Representatives Committee on Constitution Review to include the Chief Justice of the Federation, the Attorney-General, the Senate President and Speaker.\nThis include the Chief Justice of the Federation, the AGF, the Senate President and Speaker.\nSee Also Politics National Assembly Rejects Absolute Immunity For Senate President, Speaker, Other Principal Officers“It is really unconventional all over the world for judicial officers and presiding officers (of legislature) to have immunity.\nThe presiding officers of the legislative houses in Nigeria are the Senate President, Deputy Senate President, Speaker and Deputy Speaker of the House of the Representatives and Speaker and Deputy Speakers of the state Houses of Assembly.\nOnly the President, Vice President, governors and their deputies currently enjoy immunity under Section 308 of the 1999 constitution (as amended)."
  },
  {
    "headline": "EXCLUSIVE: President Buhari's Government Plots To Add Office Of Chief Justice, Attorney-General, Others To List Of Political Leaders With Immunity",
    "summarized_story": "It was gathered that the cabals wanted the House of Representatives Committee on Constitution Review to include the Chief Justice of the Federation, the Attorney-General, the Senate President and Speaker.\nThis include the Chief Justice of the Federation, the AGF, the Senate President and Speaker.\nSee Also Politics National Assembly Rejects Absolute Immunity For Senate President, Speaker, Other Principal Officers“It is really unconventional all over the world for judicial officers and presiding officers (of legislature) to have immunity.\nThe presiding officers of the legislative houses in Nigeria are the Senate President, Deputy Senate President, Speaker and Deputy Speaker of the House of the Representatives and Speaker and Deputy Speakers of the state Houses of Assembly.\nOnly the President, Vice President, governors and their deputies currently enjoy immunity under Section 308 of the 1999 constitution (as amended)."
  },
  {
    "headline": "BREAKING: Court Sentences Billionaire Kidnapper, Evans, Two Others To Life Imprisonment",
    "summarized_story": "Chukwudimeme Onwuamadike, aka Evans, and two others, have been declared guilty of kidnapping and sentenced to life imprisonment by a Lagos High Court, sitting in Ikeja.\nJustice Hakeem Oshodi of the Lagos High Court in Ikeja on Friday sentenced the man popularly known as billionaire kidnapper or Evans, and his accomplices – Uche Amadi and Okwuchukwu Nwachukwu to life imprisonment.\nThe Ikeja High Court premises in Lagos were under tight security as the judge gave the verdict.\nThe judge, however, discharged and acquitted the other co-defendants: Ogechi Uchechukwu, Chilaka Ifeanyi, formerly a soldier; and Victor Aduba, also an ex-soldier.\nThe court said there was no evidence linking them to the crimes."
  },
  {
    "headline": "BREAKING: Court Sentences Billionaire Kidnapper, Evans, Two Others To Life Imprisonment",
    "summarized_story": "Chukwudimeme Onwuamadike, aka Evans, and two others, have been declared guilty of kidnapping and sentenced to life imprisonment by a Lagos High Court, sitting in Ikeja.\nJustice Hakeem Oshodi of the Lagos High Court in Ikeja on Friday sentenced the man popularly known as billionaire kidnapper or Evans, and his accomplices – Uche Amadi and Okwuchukwu Nwachukwu to life imprisonment.\nThe Ikeja High Court premises in Lagos were under tight security as the judge gave the verdict.\nThe judge, however, discharged and acquitted the other co-defendants: Ogechi Uchechukwu, Chilaka Ifeanyi, formerly a soldier; and Victor Aduba, also an ex-soldier.\nThe court said there was no evidence linking them to the crimes."
  },
  {
    "headline": "Russia-Ukraine Conflict: NATO Activates Force For ‘First Time’ In History, Okays 40,000 Troops",
    "summarized_story": "The NATO Response Force has been activated as a defensive measure in response to Russia’s ongoing invasion of Ukraine.\nThis is the first time the Response Force will be activated since it was formed in 2002 at the Prague summit.\nAll 30 members of NATO must agree to activate the force, which they had earlier done on Thursday.\nThe NATO Response Force, which consists of about 40,000 troops, is a highly ready and technologically advanced multinational force made up of land, air, maritime and Special Operations Forces components that the alliance can deploy quickly, wherever needed.\nThe activation of the response troops does not mean that any US or NATO troops will go into Ukraine, which is not a member."
  },
  {
    "headline": "Kaycee Madu, Nigerian-born attorney, cleared of misconduct -- but removed as justice minister",
    "summarized_story": "Kaycee Madu, Nigerian-born former minister of justice and solicitor-general of Alberta, a province in Western Canada, has been cleared of wrongdoing.\nBut on Friday, Madu was cleared of misconduct and transferred to the ministry of labour and immigration.\nAdvertisementJason Kenney, premier of Alberta, said Madu will now lead “important reforms to the Alberta advantage immigration programme” as labour minister.\n“The report concludes that Minister Madu did not interfere in the administration of justice but that the phone call could create a reasonable perception of interference,” the premier said in a statement.\n“He will help to deliver on the Alberta Work Initiative, a key part of Budget 2022’s plan to connect unemployed Albertans with available jobs through expanded training programmes.”"
  },
  {
    "headline": "Kaycee Madu, Nigerian-born attorney, cleared of misconduct -- but removed as justice minister",
    "summarized_story": "Kaycee Madu, Nigerian-born former minister of justice and solicitor-general of Alberta, a province in Western Canada, has been cleared of wrongdoing.\nBut on Friday, Madu was cleared of misconduct and transferred to the ministry of labour and immigration.\nAdvertisementJason Kenney, premier of Alberta, said Madu will now lead “important reforms to the Alberta advantage immigration programme” as labour minister.\n“The report concludes that Minister Madu did not interfere in the administration of justice but that the phone call could create a reasonable perception of interference,” the premier said in a statement.\n“He will help to deliver on the Alberta Work Initiative, a key part of Budget 2022’s plan to connect unemployed Albertans with available jobs through expanded training programmes.”"
  },
  {
    "headline": "FACT CHECK: Did supreme court bar Aondoakaa from holding public office?",
    "summarized_story": "A statement issued on February 24 by Terngu Obed, director of media in Mike Aondoakaa’s campaign organisation, said the supreme court did not bar the senior advocate of Nigeria (SAN) from holding public office.\nSome media platforms had published news stories, claiming Aondoakaa was barred by the apex court from holding public positions.\nOr maybe they didn’t read the supreme court Judgement,” he told The Nation.\nThe court further restrained Aondoakaa from holding any public office.\nBut Aondoakaa’s lawyer, in arguing his case, submitted that the learned trial judge restrained the appellant from holding public office instead of limiting himself to the prayer restraining him from holding office as the attorney-general."
  },
  {
    "headline": "FACT CHECK: Did supreme court bar Aondoakaa from holding public office?",
    "summarized_story": "A statement issued on February 24 by Terngu Obed, director of media in Mike Aondoakaa’s campaign organisation, said the supreme court did not bar the senior advocate of Nigeria (SAN) from holding public office.\nSome media platforms had published news stories, claiming Aondoakaa was barred by the apex court from holding public positions.\nOr maybe they didn’t read the supreme court Judgement,” he told The Nation.\nThe court further restrained Aondoakaa from holding any public office.\nBut Aondoakaa’s lawyer, in arguing his case, submitted that the learned trial judge restrained the appellant from holding public office instead of limiting himself to the prayer restraining him from holding office as the attorney-general."
  },
  {
    "headline": "Igbo group: We've filed suit to make parties zone presidential ticket to south-east",
    "summarized_story": "A group known as the Igbo Leadership Development Foundation (ILDF) says it approached a court to compel all political parties to zone their presidential ticket to the south-east ahead of the 2023 polls.\nAddressing a press conference in Abuja on Friday, Godwin Udibe, ILFD chairman, particularly asked the All Progressives Congress (APC) and the Peoples Democratic Party (PDP) to zone their tickets to the south-east.\n“The PDP particularly needs not to be reminded that they wrote the principle of rotation of presidential power between north and south Nigeria into their constitution since 2009 and must obey their own rule to avoid litigation.\n“We will not end this press conference without advising and appealing to his Excellency Alhaji Atiku Abubakar to forget his perennial presidential ambition and support the south-east that have supported him,” he said.\nAdvertisement“We extend the same appeal to His Excellency Asiwaju Ahmed Bola Tinubu, the Jagaban, and to any other aspirant from the southern part of the country, to also shelve their presidential ambition for the sake of southern solidarity and to support the south-east that has always supported them.”"
  },
  {
    "headline": "Development finance institutions are looking to Africa’s digital frontier for impact and returns",
    "summarized_story": "Development finance institutions have long funded traditional finance and infrastructure projects in Africa; now they’re increasingly backing Africa’s digital future.\nIt can mean more opportunities unlocked as DFI money de-risks investment in high risk but critical business models.\nAfrica’s telecoms infrastructure, the backbone of its digital growth today, is an example of DFI money doing good while making returns.\nIn a perfect world, DFI and MFB activity in Africa’s fairly young venture space should be led (not nominally) by African development finance institutions.\nThat should help these institutions gain more financial clout and firepower to direct African technology to the areas of greatest need."
  },
  {
    "headline": "Payroll tech heats up in Africa, on the heels of a booming fintech sector",
    "summarized_story": "Amid the fintech boom, new frontiers are being explored by African entrepreneurs in the sector, one of which is payroll and corporate benefits management.\nThrough web portals or mobile self-service apps, companies can track time, process a locally compliant payroll, and pay their employees.\nZuberi is a Ghana-based earned wage access platform.\nIt’s easy to see why investors are backing payroll fintechs or broadly tech startups digitising the administrative stack for companies.\nAnd to increase chances of repayment, Bento Africa requires employees that apply for its loans to take unemployment and health insurance covers."
  },
  {
    "headline": "Kenyan influencers were paid $10 to $15 to discredit controversial bills on Twitter",
    "summarized_story": "The bills are the Reproductive Healthcare Bill and the Assisted Reproductive Technology Bill, also known as the Surrogacy Bill.\nThe Mozilla report reveals that CitizenGO paid the owner of these accounts or “disinformation influencers” around $10 to $15 to make tailored tweets that discredited the bills.\nIn response to this report, Twitter has permanently suspended 240 accounts connected to this disinformation campaign for violating its platform manipulation and spam policy.\nHeightening Twitter Trend’s criticismTwitter’s Trends section helps users identify the most discussed topics on the platform and also help them find popular information or discussion.\nLast year, a Buzzfeed investigation revealed that Nigerian influencers paid to tweet in a coordinated manner successfully manipulated Twitter Trends in order to sway public opinion and court judgement in favour of Venezuelan politician, Alex Saab."
  },
  {
    "headline": "Meet the 19 year old Nigerian building his own blockchain empire",
    "summarized_story": "Born to an engineer father and a school teacher mother, Njoku was a mathematics whiz.\nThis, his engineer father could live with.\nIn April 2020, a month after he started working at Kwivar, he got another offer as a blockchain developer at Project Hydro, a blockchain company based in the British Virgin Islands.\nAt Xend Finance, he had to step in when the lead blockchain engineer was unavailable, and that accelerated his blockchain knowledge.\nNjoku isn’t Zukerberg and may never be, but he’s building his own empire in the blockchain world."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "What Flutterwave’s fintech as a service means for the African tech ecosystem",
    "summarized_story": "In addition to its payment infrastructure, the startup unveiled the addition of Apple and Google Pay, Grow (its SME financing service), and fintech as a service (FaaS).\nAkurateco, a Dutch software provider, defines fintech as a service as offering financial technology as a service.\nAdvertisementFlutterwave founder and CEO, Olugbenga AgboolaAfrican API fintech startups have gained more attention in recent years, but they often focus on a few services.\nBy enabling other companies to integrate financial services to existing offerings, they allow the businesses to expand already existing offers.\nOutsourcing the provision of their fintech services could, therefore, leave startups at the mercy of the service provider as they often lose control over the quality and security of their fintech service."
  },
  {
    "headline": "Can Russia-Ukraine tensions spark World War III?",
    "summarized_story": "While tensions between Russia and Ukraine, a former Soviet republic, had existed for some time, the situation began to spiral out of control in early 2021.\nAdvertisementUkrainian president, Volodymyr Zelenskyy, urged US president, Joe Biden, to allow Ukraine to join NATO in January of last year.\nSadly, 14,000 people have died in Ukraine since 2014; I’m sure many more will perish if caution is not exercised.\nPlus, I think this conflict has the potential to spark World War III.\nAccording to CoinGlass data, $462.91 million in cryptocurrency has been ‘rekt’ – financially lost – since two nights ago, Wednesday, February 23, 2022."
  },
  {
    "headline": "Space Universe Africa launches new technology-enabled R&D lab to power next layers of human advancements from Africa",
    "summarized_story": "Also, a significant product of Space Universe Africa known as the School of Ground Truth embodies this principle.\nSpace Universe Africa is solving problems on many fronts, and here are some of their products that are doing just that.\nWith Awamaridi, Space Universe Africa plans to take a bold step into space and chart the unknown to make life better for humans while creating a healthy environment.\nCurrently serving companies across verticals like media and gaming, the company is furthering its vision to build the continent of our dreams through its innovative Space Universe Africa R&D lab.\nTo learn more about this lab and what Space Universe Africa represents, visit https://spaceuniverse.africa/."
  },
  {
    "headline": "Gunmen Abduct another Plateau Monarch – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestJOS – Mangu Local Government Area of Plateau State was yesterday thrown into confusion following the abduction of a traditional ruler, Diket Gupiya, by gunmen.\nPushit District, where Gupiya is the traditional ruler is the country home of the State Deputy Governor, Sonny Tyoden.\nGupiya’s abduction is coming barely two months after Charles Mato, the Sum Pyem, and traditional ruler in the neighbouring Gindiri District was kidnapped and later released after ransom was reportedly paid.\nThe Nigerian OBSERVER gathered that the Monarch was abducted at his palace in Pushit on Thursday night.\nAccording to the report, the district head was in his palace watching television around 9pm when the gunmen attacked his house and whisked him away to an unknown destination."
  },
  {
    "headline": "Buhari signs Electoral Act Amendment Bill into law – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – President of the Federal Republic of Nigeria, President Muhammadu Buhari has signed the Electoral Act Amendment Bill 2021 into law.\nThe signing ceremony took place inside the Council Chambers of the Presidential Villa, Abuja at about 12:30 pm yesterday.\nAmong the dignitaries present to witness the signing ceremony include the Chairman of the Independent National Electoral Commission INEC, Mahmood Yakubu; President of the Senate, Ahmed Lawan and a host of others..\nThe assent is coming a few days after a coalition of Civil Society Organizations staged a protest to compel the President to assent to the amended document.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo, Udacity commence training of 800 women in web development, data analytics, others – Nigerian Observer",
    "summarized_story": "Through the partnership, over 800 women will receive training on high-demand tech skills including web development, data analytics and digital marketing.\nThe EdoWorX program is being managed by the Edo State Skills Development Agency (EdoJobs).\n“EdoWorx initiative offers scholarships to train Edo State women on in-demand tech skills in the following fields such as Web Development, Data Analytics and Digital Marketing.\nThe Managing Director further stated, “Today officially marks the virtual on-boarding of 800 women into the EdoWorx program after the successful completion of the registration and assessment processes.\nThe courses are taught online and can be completed at your own pace when and where it’s convenient for you.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo arrests fake PUWOV official over extortion, impersonation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Officials of the Edo State Public Works Volunteers have apprehended one Mr. Festus Okosun, a suspected impersonator of the scheme, who is in the business of extorting and molesting residents around the Oba Ovonranmwen Square within the Benin metropolis.\nThe PUWOV State Commander, Mukhtar Yusuf-Osagie, who disclosed this to journalists in Benin City, said the suspect has been extorting and impounding vehicles of unsuspecting members of the public while posing as an official of PUWOV.\nAccording to him, the suspect was apprehended at Ibiwe junction by Ring Road, Benin City, and has been handed over to the Oba Market Police Division for further investigation and prosecution.\nThe PUWOV Coordinator noted, “Officials of the Edo State Public Works Volunteers has apprehended one Mr. Festus Okosun, a suspected impersonator of PUWOV who has been extorting and molesting residents of Oba Ovonranmwen Square within the Benin metropolis, in collaboration with some law enforcement officers.\n“The two uniformed law enforcement officers have been duly reported to their agencies for further investigation and prosecution, in accordance with the law."
  },
  {
    "headline": "Osun: Timi of Ede, Oba Lawal Raises Alarm As Hoodlums Take Over Town",
    "summarized_story": "By Sunday OguntuyiThe Timi of Ede in Osun State, Oba Munirudeen lawal, has raised an alarm over the spate of killings by hoodlums in the town, calling for urgent government intervention.\nAddressing a news conference at his place in Ede on Thursday, Oba Lawal said that the security situation in the town was pathetic and unbearable.\nThe traditional ruler said that members of Oodua People Congress(OPC) and cultists were those currently terrorising the town.\nAccording to him, though insecurity is a global phenomenon, but it is very alien to Ede people until the recent past.\n“But now, the community members are being threatened physically, psychologically, emotionally and economically."
  },
  {
    "headline": "Nigeria to rebase GDP by year end – Harry",
    "summarized_story": "Mr. Simon Harry, the Statistician-General of the Federation, has disclosed that processes are ongoing to rebase Nigeria’s consumer price index (CPI), which measures inflation rate by the end of 2022.\nAccording to him, the statistical processes were already ongoing for the rebasing of the Gross Domestic Product (GDP), which measures the size of economic activities in 2023.\nHe said the NBS had come up with a four-year Corporate Strategy 2022 to 2025, which aligns with the National Development Plan (NDP).\n“Now, if you are talking about national development, the key indices or the key indicators are all about statistics.\nAccording to him, synergy is necessary for both agencies to establish comprehensive data for national development."
  },
  {
    "headline": "Osogbo Progressive Splits Over Leadership Crisis",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsogbo Progressive Union, the umbrella association of indigenes of Osogbo, has been battling with leadership crisis which has made the body moribund for some years now.\nIt was also gathered that the leadership crisis had resulted in litigations most of which have not been disposed off despite that pleas by some elders of the community to settle out of court.\nIn January 2021 some prominent elders intervened which brought relative peace to the union asking the union to settle out of the court.\nJustice Kunle Adeigbe while others are Alhaji Gasali Kasmo, Alhaji Akeem Woleola, Mr. Suleiman Bodunrin, Bashir Gbodupe and Barrister Bode Babalola among others.\nHowever, efforts to get across to Justice Adeigbe was unsuccessful as calls put across to him were not picked."
  },
  {
    "headline": "U.S. Consulate Supports Mentoring Program for 125 Young Nigerian Leaders",
    "summarized_story": "The Mandela Washington Fellowship Alumni Association (MWFAAN) launched a mentoring program for 125 Young African Leaders Initiative (YALI) Network members at the American Corner in Ikeja with support from the U.S Consulate General in Lagos.\nDuring the three-month program, the YALI Network members will gain new skills and knowledge from their mentors who are alumni of the Mandela Washington Fellowship.\n“Some of the features of this program include a job and career fair to bolster the impact of the YALI Learns program.\nThe Mandela Washington Fellowship is the flagship program of the U.S. Government’s Young African Leaders Initiative.\nEstablished in 2014, the Mandela Washington Fellowship has brought nearly 5,100 young leaders from every country in Sub-Saharan Africa to the United States for academic and leadership training."
  },
  {
    "headline": "Regional Bodies, CSOs, Parties Demand Commitment On Enforcement Of Law",
    "summarized_story": "After weeks of anticipation and outright suspense, the president eventually appended his assented to the electoral bill.\nADVERTISEMENTPresident Buhari commended the National Assembly for their commitment and dedication to improving the previous Electoral Bill 2021.\n“It is gratifying to note that the current Bill comes with a great deal of improvement from the previous Electoral Bill 2021.\nRafsanjani said that President Buhari has fulfilled his obligations by upholding the values of democracy and assenting the electoral bill.\nAlso, reacting to the development, regional bodies, political parties and CSOs urged INEC and other relevant authorities to ensure enforcement of the law."
  },
  {
    "headline": "Trapped Nigerians Can’t Be Evacuated Until Airport Reopens – Federal Govt",
    "summarized_story": "Until the airports in Ukraine are opened, Nigerians trapped in the country may not have an easy exit, the federal government has been told by the authorities of Ukraine.\nOn the question about the evacuation of Nigerians from Ukraine, the minister said the issue can only come up when the airports open.\nOn his part, the Ukrainian envoy expressed gratitude to the government and people of Nigeria for their support.\n“Right now, we are in a very difficult situation, but we are fighting against the aggression and we believe that we will all win,” the Ukrainian envoy said.\nIsopi told Onyeama that the European Union was ready to assist Ukraine with help, including financial and humanitarian assistance."
  },
  {
    "headline": "Recruitment: VIPs Lose Out In NSCDC’s 5,000 Jobs",
    "summarized_story": "The recruitment process started in 2019 and lasted till this year when the incumbent minister of interior, Ogbeni Rauf Aregbsola and the commandant-general of the corps, Dr. Abubakar Ahmed Audi, concluded it.\nSometime in 2022, the figure was again reduced to 6,500 before the final screening which arrived at the targeted 5,000.\nHowever, Aregbesola and Audi stepped on every toe imaginable to achieve the goal of selecting only the most qualified 5,000 candidates.\nAlready, the Bauchi State House of Assembly has rejected the outcome of the recent recruitment process as it relates to the state, declaring it as a scam.\nHis words, “The major problem is the recruitment process, those being recruited into Nigerian Army, police, and other security agencies are job seekers, many of them are there because they don’t have a job."
  },
  {
    "headline": "Court Sentences EvansTo Life Imprisonment For Kidnapping Bizman",
    "summarized_story": "Justice Hakeem Oshodi of the Lagos State High Court in Ikeja yesterday convicted and sentenced kidnap kingpin, Chukwudimeme Onwuamadike, also known as, Evans and two others to life imprisonment for conspiracy and kidnapping.\nThe judge held that the prosecution had succeeded in proving the charge against the three convicts beyond a reasonable doubt.\nJustice Oshodi said, “He was seen freely laughing and willingly answered questions.\nJustice Oshodi, therefore, held that the law must be applied to send the right message to the public that crime does not pay.\nEvans is also facing similar charges before Justice Oluwatoyin Taiwo and Justice Adedayo Akintoye of the same court."
  },
  {
    "headline": "Agony Of Borno Student Whose Throat Was Slit For Refusing Errand",
    "summarized_story": "LEADERSHIP Weekend gathered that a senior colleague, from SS2 Class had sent Ramadan on an errand, but he refused to go.\nBut we later learnt that it was one of our seniors who wounded him for refusing his errand.\n“One student Ahmad Umar Goni of SS2A for an unknown reason partially cut the throat of one student, Jubril Sadi Mato of Pre-JSS.\nThe school management too has kept silent.\nHe said the UMTH management has been dribbling them whenever the request is made by the family."
  },
  {
    "headline": "Obasanjo, Atiku in ‘closed door’ meeting over 2023 presidency (Photos)",
    "summarized_story": "By Adejoke AdeleyeFormer Vice President, Atiku Abubakar has stormed Abeokuta, Ogun State for a crucial meeting with former President Olusegun Obasanjo.\nThe meeting is not unconnected with plans by Atiku to stage a comeback to contest next year’s presidency.\nHe lost to President Muhammadu Buhari in 2019.\nAtiku arrived Obasanjo’s residence in Abeokuta around 10:10am and after the usual taking of photographs, the duo entered into a closed door meeting.\nThe former Vice President is aspiring to become president of Nigeria next year."
  },
  {
    "headline": "Harrison Ezekiel jailed 6 months for stealing",
    "summarized_story": "By Paul IyoghojieAn Apapa Magistrate’s Court sitting at Ajegunle, Lagos has sentenced Harrison Ezekiel, 27, to six months imprisonment for stealing.\nEzekiel was handed the jail term for stealing one Itel and Gionee handsets valued at N65,000 and a laptop valued at N60,000, all valued at N125,000 inside a shop at Agric market, Odunade, Amukoko, Apapa, Lagos.\nNemesis, however, caught up with him when he went back to the shop again in February 2022 to steal.\nThe complainant recognized him and raised the alarm which attracted other traders who assisted him to apprehend the convict.\nWhen the Police Counsel, Adega Twonyiman presented the facts of the case before the Court, the convict also pleaded guilty to the allegations and Magistrate A.O Olorunfemi subsequently sentenced the convict to six-month imprisonment without on option of fine."
  },
  {
    "headline": "Explosion Rocks Niger State As Boko Haram Launches Attacks",
    "summarized_story": "Galadima Kogo, Shiroro Local Government Area, Niger State, was hit by an improvised explosive device.\nSani Abubakar Yusuf Kokki, co-convener of the Concerned Shiroro Youths of Niger State, verified this in a statement on Friday.\nThe detonation occurred just a few days after the world’s first bombing, which occurred at the same Galadima Kogo on Monday.\nThe number of casualties has yet to be determined, according to the statement, because the impacted areas are not yet accessible due to the threat of more explosions.\nHowever, preliminary findings do not indicate any loss, according to Kokki."
  },
  {
    "headline": "JUST IN: “Withdraw Your Troops From Ukraine” — Buhari Govt Orders Russia",
    "summarized_story": "The Federal Government has called on the Russian government to withdraw its troops in Ukraine and stop the approach of aggression in the country.\nHe said Nigeria does not condone the approach of aggression by Russia, calling on Russia to pull back.\nWe support every effort being made to stop the aggression and Russian troops to return to Russia,” Onyeama said.\nSpeaking to journalists after the closed-door meeting, German Ambassador to Nigeria, Birgitt Ory, who is also chair of the G7 Group, appreciated the African Union on its statement on the situation.\nThe German envoy commended Nigeria for putting in its weight, said Nigeria is a very important voice that the world needed to hear."
  },
  {
    "headline": "2023: I Don’t Need Physical Strength To Be President — Tinubu",
    "summarized_story": "Bola Tinubu, the National Leader of the All Progressives Congress (APC), has stated that he will require more psychological strength than physical strength to be president in 2023.\nHe said this on Friday when he went to the palace of Osogbo’s Ataoja, Jimoh Olanipekun, to inform him of his political ambitions.\nFollowing his recent medical vacation to the United Kingdom, onlookers have expressed concern over Tinubu’s health.\nHowever, Tinubu said: “I am not applying for the job of bricklaying or grave digging.\n“I am applying for a thinking job and I will do it right."
  },
  {
    "headline": "BREAKING: N35m Recovered From Robbers Who Raided Edo Banks",
    "summarized_story": "A total of N35 million has been recovered one day after armed robbers invaded four banks in Uromi, the capital of Edo State’s Esan North-East Local Government Area, carrying away large sums of money in bags.\nBello Kotongs, Police Public relations Officer in Edo, confirmed this to Daily Trust on Friday night.\nHe said the money was currently in custody of the police.\nIt reported how the armed gang broke into Zenith, UBA, First and Union Banks in the community, gunning down seven person, including two security personnel."
  },
  {
    "headline": "Pictures: Goods destroyed as fire razes shops at Ladipo market in Lagos",
    "summarized_story": "A Fire outbreak on Friday night broke out at Ladipo market in Lagos destroying goods worth millions of naira.\nSeveral shops situated at a section of the market called – Aguiyi Ironsi International Trade Center, Paramo, Ladipo Market were razed during the incident.\nPresident-General, Ladipo Central Executive Auto Dealers Association (LCEADA), Jude Nwankwo in a Facebook live on his page, called for support and prayer.\nNo casualty has been recorded so far but it was learnt several accessories, items worth millions of naira have been gutted by fire.\nShop owners were at the scene to battle the outbreak, and also carry away few properties."
  },
  {
    "headline": "Breaking: Missile hits Kyiv apartment building as Ukrainian President turns down US offer",
    "summarized_story": "More images have now emerged of the apartment building near Kyiv’s Zhuliany airport that was struck by a missile earlier on Saturday.\nThe pictures show a hole covering at least five floors that were blasted into the side.\nMeanwhile, Ukrainian President Volodymyr Zelensky turned down an offer by Washington to help evacuate him from Ukraine, US media outlets say.\nThe Washington Post had also quoted US and Ukrainian officials who said that the US government was prepared to help Mr Zelensky.\nMr Zelensky has been widely praised on social media for his response to the Russian invasion."
  },
  {
    "headline": "Huge relief as Buhari signs Electoral Act 2022, asks NASS to amend Section 84",
    "summarized_story": "The president made the call before assenting to the Electoral Act at the Council Chambers of the Presidential Villa in Abuja.\n“It is gratifying to note that the current Bill comes with a great deal of improvement from the previous Electoral Bill 2021.\nINEC’s declarationsMeanwhile, the Independent National Electoral Commission (INEC) has stated that it fully appreciates the importance of proceeding with the implementation of the newly signed 2022 Electoral Act in earnest.\n“This is historic, being the fourth time since the restoration of democracy in Nigeria in 1999 that the Electoral Act is repealed and re-enacted.\n“The nation now has the Electoral Act 2022 which replaces the Electoral Act 2010 (as amended)."
  },
  {
    "headline": "We Urge Russia To ‘Pull Back’ On Ukraine Attacks – FG",
    "summarized_story": "The Federal Government has called on the Russian troops to ‘pull back’ from its ‘aggressive’ attacks on Ukraine.\nThe Minister had earlier met with the envoys from various countries including the United Kingdom and the United States.\nHe said the Nigerian government during the meeting called for peace and the use of diplomacy in resolving differences between Russia and Ukraine.\n“We support every effort being made to stop the aggression and that the Russian troops return to Russia.\n“We recognise the sovereignty of Ukraine and the territorial integrity of Ukraine,” Onyeama said."
  },
  {
    "headline": "LIVE UPDATE: INEC Holds Bye-Election In Ondo, Plateau, Imo And Cross-Rivers",
    "summarized_story": "Welcome to our live update on the bye-election being conducted today by the Independent National Electoral Commission (INEC) in Ondo, Plateau, Imo, and Cross Rivers States.\nIn Ondo State, the bye-election is holding in Akure North/Akure South Federal Constituency while in Plateau State voters in Pankshin South State Constituency and Jos North/Bass Federal Constituency are voting new representatives.\nThe election is also being held in Ogoja/Yala Federal Constituency and Akpabuyo State Constituency both in Cross River State.\nAlso, Ngor Okpala State Constituency in Imo State will be voting new representative.\n10:32am: The non-functional Bimodal Voter Accreditation System (BVAS) is causing a delay at the post office polling unit in Jos, Plateau State."
  },
  {
    "headline": "Again, Explosion Rocks Niger Community",
    "summarized_story": "An Improvised Explosive Device (IEDs) has exploded at Galadima Kogo, Shiroro Local Government Area, Niger State.\nThis was confirmed in a statement by co-convener, Concerned Shiroro Youths of Niger State, Sani Abubakar Yusuf Kokki on Friday.\nRead Also: Katsina APC Reacts As Court Freezes Local Government Council’s AccountThe explosion comes a few days after the first-ever bomb blast occurred at the same Galadima Kogo, on Monday.\nAccording to the statement, the number of casualties is yet to be ascertained as the affected areas are not yet accessible due to fear of further possible explosions.\nKokki noted that preliminary reports are, however, not suggestive of any loss."
  },
  {
    "headline": "‘We Are All Here,’ Ukraine’s Zelensky Says In Video From Kyiv",
    "summarized_story": "Ukrainian President Volodymyr Zelensky released a self-shot video from central Kyiv on Friday vowing alongside key aides to stay and defend the capital against the Russian invasion.\nWe’re all here defending our independence, our country, and it will stay this way,” Zelensky said, standing outside the presidency building.\nREAD ALSO: US-Russia Tensions Spill Into Space, But ISS Safe — For NowRussian troops clashed briefly with Ukrainian forces for the first time within Kyiv itself on Friday.\nZelensky has received support from many Western leaders for his determination to resist Putin’s invasion, and European Union chief Charles Michel embedded the Ukrainian leader’s video in a tweet.\nBut Kyiv has been pushing EU and NATO members to do more, in particular through supplying advanced weaponry and excluding Russia from world financial networks."
  },
  {
    "headline": "‘It Was A Well-Organised Attack,’ Edo Deputy Gov Laments During Visit To Uromi Robbery Scene",
    "summarized_story": "﻿Edo State Deputy Governor, Philip Shaibu, on Friday, led a team of government officials for an on-the-spot assessment of the robbery scene in Uromi, the administrative headquarters of Esan North East Local Government Area (LGA) of the state.\nShaibu who was representing the state governor Godwin Obaseki during the assessment lamented that the robbery was well-organised.\nWe are here on behalf of the governor to find out what happened and know the extent of the damage.\n“I am here with all the security chiefs and have seen the damage and beefed-up security in the area,” the deputy governor said.\nThe governor also visited the palace of the Ojuromi of Uromi, HRH Anslem Odaloighe Eidenojie Il."
  },
  {
    "headline": "Accreditation, voting ongoing in Jos north/Bassa House of Reps by-election -",
    "summarized_story": "Accreditation and voting are ongoing simultaneously in the Jos north ,Bassa Federal House of representatives by-election in Plateau State north central Nigeria.\nINEC officials arrived various polling units as at 8am and set for the exercise.\nAdvertisementResidents within the affected areas are complying with the state government movement restriction, as only essential workers are visible within the State capital.\n11 political parties are participating in the polls within the two council areas in the State .\nAdvertisement"
  },
  {
    "headline": "Ondo by-election: PDP candidate laments late arrival of voting materials -",
    "summarized_story": "The People’s Democratic Party candidate in the Akure North and South Federal constituency, Olumuyiwa Adu by election in Ondo state has lamented the late arrival of voting materials in some polling units in Akure metropolis.\nSpeaking with reporters after voting, Mr. Adu noted that he has received information from some polling units that INEC adhoc staff have not arrived.\nAdvertisementAlthough, he commended early arrival in some centres, he urged the electoral body to look into the issues raisedAdvertisementAdvertisement"
  },
  {
    "headline": "Ondo by-election: PDP candidate laments late arrival of voting materials",
    "summarized_story": "The People’s Democratic Party candidate in the Akure North and South Federal constituency, Olumuyiwa Adu by election in Ondo state has lamented the late arrival of voting materials in some polling units in Akure metropolis.Speaking with reporters after voting, Mr. Adu noted that he has received information from some polling units that INEC adhoc staff have not arrived.\nAlthough, he commended early arrival in some centres, he urged the electoral body to look into the issues raised"
  },
  {
    "headline": "Accreditation, voting ongoing in Imo Assembly by-election",
    "summarized_story": "Accreditation and voting have commenced at Upe polling unit 001 and 014 of Imerienwe in Ngor Okpala local government area for the Saturday’s scheduled State House of Assembly Election.\nSo far there has not been any record of violence as voters are still coming out to cast their ballot.\nAdvertisementThe Adhoc staff of the independent national electoral Commission arrived polling units within the stipulated time by Commission to commence election."
  },
  {
    "headline": "Nigeria, Benin Republic Meet Over Boundary Issues",
    "summarized_story": "Governments of both Nigeria and the Republic of Benin on Friday met over boundary related issues.\nThe two neighbouring countries were led to the meeting by the ministers of foreign affairs, Geoffrey Onyema (Nigeria) and Aurélien Agbénonci (Republic of Benin).\nSpeaking after the meeting, Onyeama said both countries had very positive and fruitful deliberations on three areas.\nAlso speaking, Agbénonci said both countries met to find solutions to issues relating to the borders between Nigeria and the Republic of Benin.\nHe said: “Benin and Nigeria cannot be in any confrontation concerning the borders."
  },
  {
    "headline": "Buhari to Commission More Projects in Kaduna in May",
    "summarized_story": "President Muhammadu Buhari is expected to commission more projects executed by the Kaduna state government in May 2022.\nThe Managing Director of the Kaduna Roads Agency (KADRA), Habiba Buhari disclosed this on Friday while inspecting the multi-billion naira bridge across River Kaduna, connecting Kabala to Barnawa areas within Kaduna metropolis.\nThe President had during his two-day working visit to Kaduna, in January 20, 2022, commissioned road projects under the Urban Renewal Programme initiated by the Kaduna state government.\nAlso speaking, the team leader supervising the project, Mr. Makarfi said the bridge is a dual carriage way and it is very important because it crosses over River Kaduna, connecting Kabala Constain with Barnawa areas in Kaduna metropolis.\n“This particular project is one of the projects slated for presidential commissioning in May."
  },
  {
    "headline": "Russia to Restrict Facebook Access for ‘Censoring’ Its Media",
    "summarized_story": "Russia said on Friday it was partially limiting access to Meta Platforms Inc’s Facebook, accusing it of “censoring” Russian media, the latest in a series of steps against U.S. social media giants.\nThe state communications regulator said that Facebook had ignored its demands to lift restricts on four Russian media outlets on its platform – RIA news agency, the defence ministry’s Zvezda TV and websites gazeta.ru and lenta.ru.\nIt was not immediately clear what Russia’s restrictions on Facebook would involve.\n“In accordance with the decision of the General Prosecutor’s Office, starting from Feb. 25, partial access restrictions are being imposed by Roskomnadzor on the Facebook social network,” the regulator, Roskomnadzor, said in a statement.\nMoscow routinely fines the company small sums for what it says is a failure to delete illegal content quickly enough."
  },
  {
    "headline": "Nigerians Stranded In Ukraine, As FG Works On Evacuation Plan – Trending With Ojy Okpe",
    "summarized_story": "The minister of foreign affairs Geoffrey Onyeama announced on Thursday, that the federal government is working on arranging a special flight to evacuate Nigerians currently in Ukraine once airports reopen.\nReactions trail on social media as Super Falcons faced delay for over 3 hours and subjected to traumatic experiences at the Nnamdi Azikiwe International Airport, in Abuja, due to some unclear COVID-19 protocols in the early hours of Thursday.\nOn Thursday, a group of armed men attacked four banks and a police station in Edo State leaving two police officers and five civilians dead.\nA video now making the rounds on social media, shows the moment one of the banks exploded as civilians took to their heels.\nA video showing men clad in military uniform alleged to be soldiers of the Nigerian army taking cover as the gunmen attacked the bank in edo state has gone viral."
  },
  {
    "headline": "NIgeria: Finally, President Buhari Signs Electoral Act Amendment Bill",
    "summarized_story": "Nigeria’s President Muhammadu Buhari Friday signed Electoral Act Amendment Bill into law, about a month after the National Assembly sent the bill to him.\nThe signing ceremony was held at the Council Chamber of the Presidential Villa in Abuja.\n1 of 6 - +Among those present at the ceremony which began at about midday are the Vice President, Professor Yemi Osinbajo; President of the Senate, Ahmed Lawan, and Speaker of the House of Representatives, Femi Gbajabiamila.\nDetails later…"
  }
]