[
  {
    "headline": "UK hopeful Buhari’ll sign electoral bill",
    "summarized_story": "The United Kingdom has said it hoped that the President, Major General Muhammadu Buhari (retd.\n), will assent to the Electoral Act 2010 (Amendment) Bill transmitted to him by the Federal Government.\n), has promised Nigerians and the international community that his regime will ensure free and fair elections in the 2023 general elections.\nHe spoke on Friday at a Virtual Summit for Democracy organised by President Joe Biden of the United States.\nAccording to him, necessary mechanisms will be strengthened to ensure that Nigeria witnesses another peaceful transfer of power."
  },
  {
    "headline": "Insecurity: Buhari dispatches NSA, IGP others to Sokoto, Katsina",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), on Friday afternoon dispatched a high-level delegation, consisting of heads of the nation’s intelligence and security services to Sokoto and Katsina states.\nSenior Special Assistant to the President Media and Publicity, Garba Shehu, disclosed this in a statement titled ‘President Buhari sends security, intelligence heads to Sokoto, Katsina’.\nThe delegation led by the National Security Adviser, Major General Babagana Monguno (retd.\n), is made up of the Inspector-General of Police, Usman Baba, the Director-General of the DSS, Yusuf Bichi, the Director-General, National Intelligence Agency, Ahmed Abubakar and the Chief of Defence Intelligence, Major General Samuel Adebayo."
  },
  {
    "headline": "How I secured release of 100 inmates from Kuje prisons-Sen. Orji Uzo Kalu",
    "summarized_story": "says many languishing in detention for not fullfiling requirements of law…set to build new cellsBy Levinus Nwabughiogu-AbujaSenate Minority Leader, Dr. Orji Uzo Kalu said yesterday that God used him to secure the release of over 100 inmates from Kuje prisons.\nOn an emotional note, Kalu recounted two separate incidents in his left that had brought tears to his eyes.\nIn December 2019, Kalu was pronounced guilty by a court and sent to Kuje prisons in Abuja to serve a 12 year jail term.\n“The second was when I was at the Nigerian Correctional Service Medial Security Custodial Centre, Kuje, Abuja.\n“As I visited the Nigerian Correctional Service Medial Security Custodial Centre, Kuje today in compliments of the season, I ate, drank and shared jokes with a few."
  },
  {
    "headline": "Nasarawa confirms 2 cases of Lassa fever",
    "summarized_story": "Lassa feverThe Nasarawa State Government has confirmed two cases of Lassa fever since the beginning of the dry season in the state.\nDr Janet Angbazo, Permanent Secretary, Ministry of Health made the disclosure at a news conference in Lafia on Friday.\nShe pointed out that the symptoms of Lassa fever usually manifest one to three weeks after the patient comes in contact with the virus.\nThe permanent secretary urged members of the public with symptoms such as slight fever, general malaise, weakness and headache to avail themselves for Lassa fever testing.\nShe charged the public to always maintain high environmental hygiene in order to keep rodents – the vector of Lassa fever, away from food."
  },
  {
    "headline": "Elections: BVAS has come to stay – INEC",
    "summarized_story": "The Independent National Electoral Commission (INEC) on Friday said that the use of Bimodal Voter Accreditation System (BVAS) for accreditation during elections has come to stay.\nINEC National Commissioner and Chairman, Information and Voter Education Committee, Mr Festus Okoye, said this at the one-day Implementation meeting for the FCT Area Council Election on Friday in Abuja.\nOkoye said that INEC would continue to come up with innovations to check electoral malpractices and strengthen democratic governance in the country.\nOkoye said that BVAS would be used for FCT area council elections, as it had assisted the commission to conduct credible and well accepted election in the Anambra governorship election.\nThe Chief Press Secretary to the INEC Chairman, Mr Rotimi Oyekanmi, commended INEC Staff for their commitment towards deepening democracy in the country."
  },
  {
    "headline": "Court threatens to freeze Adamawa govt’s salary accounts over N84m debt",
    "summarized_story": "Justice Inyang Ekwo, in a ruling, gave the state government until Jan. 11, 2022, to settle the issue with AMCON.\n“This adjournment is at the instance of the defendant and a gracious adjournment to allow them pay the staff for Christmas.\nAlso Joined in the suit include the Commissioner of Health, Permanent Secretary of Ministry of Health, and the Ministry of Health as 3rd to 5th defendants respectively.\nHe told the court that despite several demands by the bank, the facility and the accrued interest had remained unpaid.\nThliza, however, begged the court to give her client more time to engage in the terms of settlement."
  },
  {
    "headline": "Abia Speaker congratulates Chief John Kalu on new chieftaincy title as Nwandugbom Abiriba",
    "summarized_story": "The Speaker of Abia State House of Assembly, Rt Hon Chinedum Enyinnaya Orji has congratulated the Abia State Commissioner for Trade and Investment, Chief John Okiyi Kalu on his conferment with the chieftaincy title, Nwandugbom Abiriba by the Enachioken-in-Council, tomorrow, Saturday, 11th December, 2021.\nThe Speaker who described Chief John Okiyi Kalu as “one of the best”, said he has over time demonstrated competence, loyalty and astute excellence in every duty under his mandate, and that the chieftaincy title conferred on him is a testament to his virtues.\nConcluding the Abia Speaker said he trusts the title recipient not to rest on his laurels but to continue exhibiting those virtues that have endeared him to the people.\nVanguard News Nigeria"
  },
  {
    "headline": "Insecurity: Nigerians urged to complement security agencies’ efforts",
    "summarized_story": "Amid growing security challenges in the country, the Commandant-General of the Nigeria Security and Civil Defence Corps, NSCDC, Dr Ahmed Abubakar Audi, has appealed to well-meaning individuals and Nigerians not to abandon security matters in the hands of the security agencies alone.\nDr. Audi made the appeal at Edidi town in Isin Local Government Area of Kwara State, where he urged well-meaning individuals to assist security agencies in the provision of necessary equipment and logistics.\n“I will seize the opportunity to reiterate the fact that government and the security agencies are always ready to partner with any well-meaning individuals and corporate organizations determined to assist in combating security challenges that we are facing in the country,” the NSCDC CG disclosed.\nPresent at the occasion were the NSCDC Commandant in Kwara State, Iskilu Ayinla Makinde, the donor Dr Tayo Abikoye, Isin LG TIC chairman Hon.\nTunde Fadipe, Eledidi of Edidi land Oba Gabriel Kolawole Aboyeji, representatives of sister security agencies and community leaders among others."
  },
  {
    "headline": "Nigeria will overcome challenges when citizens show love, unity – Prophet Alo",
    "summarized_story": "Nigerians have been urged to be united and show love to one another for the country to overcome its myriad of challenges.\nThe Coordinator, CAC Joseph Ayo Babalola Memorial Miracle Camp, Ikeji, Osun State, Prophet Sam Olu Alo attributed a lack of genuine love to numerous problems the country is facing.\n“There must be genuine love among Nigerians.\n“We must seek for love, if there is no genuine love it will be difficult for us to experience perfect peace and rest in our land”.\nHe, however, urged Nigerians to work hard to become somebody in order to be a source of blessing to others."
  },
  {
    "headline": "IPOB clears air on ESN kidnapping two Chinese in Imo",
    "summarized_story": "The Indigenous People of Biafra, IPOB, on Friday, distanced its members from the abduction of two Chinese nationals in Owerri, Imo State.\nIPOB’s spokesman, Emma Powerful, said IPOB members and the Eastern Security Network, ESN, have no hand in the abduction of the Chinese nationals in Owerri.\n“We want to make it abundantly clear to the public that IPOB and ESN security outfit have no hands in the said abduction.\nWe are peaceful agitators for Biafra restoration.”Powerful accused detractors of linking IPOB and ESN to criminalities.\nThis is another propaganda by our enemies to disrepute us, and it must be disregarded.”Gunmen storm Ogun, abduct two Chinese nationals"
  },
  {
    "headline": "We won’t accept pleas to shelve strike – ASUU",
    "summarized_story": "Members of the Academic Staff Union of Universities (ASUU) around the Yola zone, Adamawa State, have said they will not accept any plea from Nigerians to shelve an impending strike.\nIn a press conference at the NUJ secretariat in Yola on Friday, the Yola Zone said Nigerians should blame the Federal Government for its failure to comply with the renegotiation of the 2009 agreement.\nMembers of the ASUU, Yola chapter, comprising those at Adamawa State University (ADSU) Mubi, Federal University Gashua (FUGA), Modibbo Adama University (MAU) Yola, Taraba State University (TSU) Jalingo, University of Maiduguri (UNIMAID), and Yobe State University (YSU) Damaturu, said their decision is in the best interest of Nigerian universities.\nReuben said ASUU was displeased with nonchalant attitudes displayed by government functionaries even after countless calls to address the issues in dispute.\nSince then, nothing has been done by the Government to address the issues besides propaganda and blackmail."
  },
  {
    "headline": "NUC granted Uzodinma licence for KO Mbadiwe varsity, not Eastern Palm University – Okorocha",
    "summarized_story": "The former Governor of Imo State, Senator Rochas Okorocha, has accused his successor, Hope Uzodinma, of trying to score a cheap political goal with bloated claims on Eastern Palm University and advertising the photographs he took at the office of the National Universities Commission (NUC) in Abuja.\nThe ex-governor made the accusation in a statement signed by his spokesperson, Sam Onwuemeodo, in Owerri, the state capital, on Friday.\nOkorocha said the truth is that the university cannot exist within another university, with each having recognition and operational licence from the same source.\nThe statement read in part, “Governor Uzodinma, for almost two years, has been talking and dealing with Okorocha’s achievements and also celebrating Okorocha, without his knowing it.\n“For the sake of emphasis, the lmo State Governor, for reasons best known to him, has made the Eastern Palm University part of his anti-Okorocha politics and had claimed to have changed the Eastern Palm University to Kingsley Ozumba Mbadiwe University."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "‘Allow Oduduwa varsity founder access to healthcare’",
    "summarized_story": "A Federal High Court in Abuja has ordered the Inspector General of Police to allow detained founder of Oduduwa University, Ile-Ife, Dr. Ramon Adegoke Adedoyin access quality medical facility of his choice.\nJustice Inyang Ekwo gave the order yesterday in a ruling on a motion filed by Adedoyin through his lawyer, Kunle Adegoke (SAN).\nThe IGP, who is the sole respondent, was not represented in court.\nIn a supporting affidavit, Chief Segun Aworinde, who described himself as Adedoyin’s younger brother, said despite being informed that Adedoyin was hypertensive and diabetic, the police has refused to release him or allow him access quality health facility since he was arrested on November 15.\nJustice Ekwo ruled that Adedoyin be allowed access to health care of his choice."
  },
  {
    "headline": "Sule nominates 28-yr-old, 14 others as commissioners",
    "summarized_story": "Nasarawa State Governor Abdullahi Sule has nominated a 28-year-old Abimiku Hanatu Bala, a lawyer from Lafia Local Government Area as a commissioner-nominee in Nasarawa State.\nGovernor Sule equally nominated a nephew of the former Governor of Nasarawa State, Senator Umaru Tanko Al-Makura, Alhaji Mohammed Tanimu also from Lafia as a commissioner-nominee.\nSpeaker of the Assembly, Balarabe Abdullahi read out the list of the 15 commissioner-nominees sent in by Governor Sule on the floor of the Assembly yesterday in Lafia.\nAlso, yesterday Governor Sule presented 2022 budget proposal of N109.801, 524,879.49 billion to the House of Assembly for consideration and approval.\n- Advertisement -The Speaker Ibrahim Balarabe Abdullahi assured Governor Sule of speedy passage."
  },
  {
    "headline": "Rich countries are to blame for omicron",
    "summarized_story": "The problem has been one of distribution — or, to put it bluntly, of the rich world hoarding vaccines at the expense of the poor.\nBut rich countries have been stingy about actually making donations.\nChina has recently increased its pledge to 850 million doses, up from 100 million, and has delivered about 89 million.\n- Advertisement -Vaccinating the world would be good for the world economy — meaning mostly the rich countries that dominate it.\nThey are being felt by the poorest in the world and will hurt the working classes in rich countries the most."
  },
  {
    "headline": "ACF advises Southeast to lobby for president",
    "summarized_story": "By AbdulGafar Alabelewe, Kaduna and Damian Duruiheoma, EnuguThe Arewa Consultative Forum (ACF) has advised the Southeast to lobby Nigerians for the 2023 presidential slot.\nBut the ACF warned Nigerians against making wrong choices of candidates for the general elections.\n- Advertisement -Ogbe said the ACF was in support of the declaration of bandits as terrorists.\nThe Southeast should put up their team, move around and lobby.\n“Another 20 years after, the Igbo supported President Olusegun Obasanjo, and thereafter, we supported Umaru Yar’adua and later Dr. Goodluck Jonathan."
  },
  {
    "headline": "Buhari lays keel of two warships to be built in Lagos",
    "summarized_story": "BY PHILIP NWOSUPresident Muhammadu Buhari on Thursday laid the keel for two warship to be built at the Naval Dockyard in Lagos by Nigerian Navy engineers.\nThe laying of the keel came on heel of the commissioning of the third Seaward Defence Boat (SDB) christened NNS OJI, built by naval engineers at the Naval Dockyard Limited.\nSpeaking at the event, , President Buhari said the new inductions to the Naval fleet would boost the force’s capability in securing Nigeria’s maritime domain.\n‘‘Let me assure you that the Government will continue to support the ideals of the Nigerian Navy in the performance of its constitutional duties.\nGod bless the Nigerian Navy, God bless the Federal Republic of Nigeria."
  },
  {
    "headline": "UNILAG releases 2021/2022 admission cut off marks",
    "summarized_story": "By Gabriel DikeAuthorities of the University of Lagos (UNILAG), Akoka, has released the admission cut off marks for the 2021/2022 academic session.\nThe cut off marks were released on Friday, December 10th, 2021.\nAside, the merit cut off marks, UNILAG came out with catchment cut off marks for six states, which includes Ekiti, Lagos, Ogun, Ondo, Osun and Oyo States.\nA breakdown revealed that Medicine and Surgery has the highest cut off marks of 80.8, followed by Computer Engineering 79.3, Electrical and Electronic Engineering 78.125, Dentistry 77.4, Law 76.5, Pharmacy 76.125, Systems Engineering 76.475, Chemical and Petroleum Engineering and Computer Engineering 79.3.\nIn Faculty of Science, Computer Science 77.875, Biochemistry 71.625, Cell Biology and Genetics 70.15, Mathematics 69.925, Statistics 69.465 and Industrial Mathematics 69.075."
  },
  {
    "headline": "Mass protest rocks north over insecurity",
    "summarized_story": "The Convener, Rahama Abdulmajid, told Saturday Sun that they have kept quiet enough about the ongoing “armed war” in northern Nigeria, hence their decision to raise local and global attention to the insecurity in the north.\nShe said: “We are out this time to raise global attention on the level of human carnage going on in northern Nigeria.\nToday (Friday), the protest was successfully held simultaneously across four northern states of Katsina, Bauchi, Kano and Abuja.\nIn no distant time, we, the 19 northern states, would all assemble for joint protest.\nShe said: “People have been afraid to speak truth to the government on the level of daily unreported or underreported killings in northern Nigeria."
  },
  {
    "headline": "Tension in Imo as gunmen kill abducted monarch",
    "summarized_story": "From Stanley Uzoaru, OwerriAtta community in Njaba Local Government Area of Imo state is gripped by fear, following the murder of the traditional ruler of the community, Eze Edwin Azike by gunmen suspected to be assassins.\nAccording to the source, four persons from the community also lost their lives during the abduction of the monarch.\n“Traditional rulers are not politicians, we are only custodians of the culture of our people.\nI don’t know why traditional rulers are being hunted like this.\nRecall that same Thursday another traditional ruler, Damian Nwaigwe of Mbutu in Aboh Mbaise council area of the State was abducted in his palace."
  },
  {
    "headline": "Insecurity: Bandits’ve turned north to killing field, says Sultan",
    "summarized_story": "From Fred Ezeh, AbujaSultan of Sokoto, Muhammadu Sa’ad Abubakar, yesterday, raised the alarm that the north is turning to killing field by bandits and other terrorists operating in the region.\nThe Sultan, who noted that bandits were holding the region, especially North West, spellbound, expressed concerned that most of the killings were not being reported or underreported.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nWe need to come up with possible solutions to the problems of Nigeria, particularly as regards rising insecurity.\n“We have to be careful in the way we handle, say and do things as religious leaders."
  },
  {
    "headline": "Emirates Suspends Flights to Nigeria",
    "summarized_story": "Chinedu EzeIn reaction to federal government’s withdrawal of its flight frequencies, except one, to Nigeria, Emirates Airlines has announced that it has suspended operations to the country till further notice.\nEmirates on its website Friday announced that it would suspend its flights to Nigeria from December 13, 2021 until two countries reach amicable resolution on the matter.\nThe statement said, “With the recently imposed directive limiting Emirates to operate one flight per week to Nigeria via Abuja, Emirates will be suspending its flights between Nigeria and Dubai from 13 December 2021, until the UAE and Nigerian authorities work on a solution to the ongoing issue.\nNuhu explained that the Minister of Aviation, Senator Hadi Sirika, had graciously granted Emirates Airlines 21 frequencies weekly to two major airports in Nigeria; Lagos, 14 and Abuja, seven.\nThe airline wants to operate 14 weekly flights to Lagos and another seven weekly to Abuja airports."
  },
  {
    "headline": "Buhari: We will Hand over to Winners of Free, Fair Polls in 2023",
    "summarized_story": "“Since assuming office in 2015, we have been able to introduce mechanisms to ensure free, fair and credible elections.\n“We, therefore, must remain resolute and enhance cooperation so that together, we build back better democratic institutions and sustainable democratic values,’’ the president said.\nHe also noted that the summit was taking place at a time when democratic institutions around the world were facing several challenges.\n“Nevertheless, we have witnessed the resilience of democratic institutions in many countries that have held free, fair and transparent democratic elections under very challenging conditions,” he said.\nWhile pledging Nigeria’s support for democratic governance in West Africa, President Buhari, however, expressed concern in the threat of undemocratic takeover of government in the sub region."
  },
  {
    "headline": "NCAA: Why Nigeria Reduced Emirates’ Flights from 21 to One Weekly",
    "summarized_story": "UAE reduced Air Peace request for three times weekly flight to one, claiming it did not have enough slots for the airline.\nHe regretted that despite this approval, the GCAA refused to grant Air Peace three weekly frequencies to Sharjah, which the airline requested for, but rather approved just one frequency weekly.\nThe airline wants to operate 14 weekly flights to Lagos and another seven weekly to Abuja airports.\n“However, Air Peace only requested for three weekly flights to Sharjah, not even Dubai airport, but the CAA refused the airline.\nThe DG NCAA notified The Country Manager of Emirates Airlines and DG GCAA of the new approved weekly passenger flight schedule."
  },
  {
    "headline": "Akande: Buhari Promised to Pick Tinubu as Running Mate in 2015, Then Reneged",
    "summarized_story": "‘How could he be talking of a running mate when he had not secured the ticket?” I mused.\n“He said it was from this list that Buhari would choose a running mate.\n‘General, where are you choosing your running mate from?’ He answered, ‘The South-west.’ ‘Oh!\n‘If indeed you promised to make Asiwaju your running mate, it would not be fair to renege,’ he said.\n“We were registered in July 2013, and he called me to prevail on Tinubu to be his running mate in April 2014."
  },
  {
    "headline": "‘Grouse Against’ Incorrect",
    "summarized_story": "DAILY INDEPENDENT of November 29 carried a kindergarten goof: “…the issue of cost and fees are bound to come up.” The issue…is (not are) bound to come up!\n“Bayelsa, Adamawa: PDP playing double standards” (DAILY TRUST Inside Politics, November 29) Trust is a burden: double standard.\nThe next two headline blunders are from DAILY INDEPENDENT of November 29: “MTN trains media practitioners” Nobody practises media—what we have are media professionals.\nBy the way, one of my professorial friends pointed out last week that, indeed, some nouns (accountancy profession/highway patrol, etc.)\n“You better get down on your knees and do what I am doing right now.” The end of illusions as we put the expression right: You had better get down on your knees and do what I am doing right now."
  },
  {
    "headline": "BREAKING: Angry Youths Barricade Highways In Northern Nigeria, Protest Against Killings In Region, Buhari's Failure",
    "summarized_story": "Some angry youths have blocked some major highways in the Northern part of the country to protest against incessant attacks by armed bandits in the region.\nThe protest followed the killing of 45 travellers by bandits in Sokoto.\nThe protesters, displaying placards depicting their anger at the situation, have been sighted in Kano, Bauchi, Zamfara and Sokoto states.\nHe said: “I am very distressed at the manner of death visited on these hapless citizens who were undertaking a legitimate journey to another part of the country.\n“It shows that the evil this administration is confronting requires the support and involvement of all Nigerians."
  },
  {
    "headline": "BREAKING: Angry Youths Barricade Highways In Northern Nigeria, Protest Against Killings In Region, Buhari's Failure",
    "summarized_story": "Some angry youths have blocked some major highways in the Northern part of the country to protest against incessant attacks by armed bandits in the region.\nThe protest followed the killing of 45 travellers by bandits in Sokoto.\nThe protesters, displaying placards depicting their anger at the situation, have been sighted in Kano, Bauchi, Zamfara and Sokoto states.\nHe said: “I am very distressed at the manner of death visited on these hapless citizens who were undertaking a legitimate journey to another part of the country.\n“It shows that the evil this administration is confronting requires the support and involvement of all Nigerians."
  },
  {
    "headline": "BREAKING: N69.4bn Debt: Jimoh Ibrahim Loses Appeal Against Asset Management Agency, AMCON To Recover Seized Assets",
    "summarized_story": "The appellate court upheld the November 18, 2020 order of Justice Rilwan Aikawa of the Federal High Court, Lagos which authorised AMCON to take over Mr Ibrahim's assets.\nAMCON, following Justice Aikawa's order, took effective possession of all 12 properties through its Debt Recovery Agent – Pinheiro Legal Partners.\nOther properties are the building of Abuja International Hotels Limited located at No.\n3, Hospital Road, Lagos; another Property at Plot 242, Muhammadu Buhari Way, Abuja; the former Allied Bank Building on Mile 2, Oshodi Express Way, Apapa Road, Lagos; Energy House located on No.\n94, Awolowo Road, Ikoyi, Lagos; NICON Building at No."
  },
  {
    "headline": "BREAKING: N69.4bn Debt: Jimoh Ibrahim Loses Appeal Against Asset Management Agency, AMCON To Recover Seized Assets",
    "summarized_story": "The appellate court upheld the November 18, 2020 order of Justice Rilwan Aikawa of the Federal High Court, Lagos which authorised AMCON to take over Mr Ibrahim's assets.\nAMCON, following Justice Aikawa's order, took effective possession of all 12 properties through its Debt Recovery Agent – Pinheiro Legal Partners.\nOther properties are the building of Abuja International Hotels Limited located at No.\n3, Hospital Road, Lagos; another Property at Plot 242, Muhammadu Buhari Way, Abuja; the former Allied Bank Building on Mile 2, Oshodi Express Way, Apapa Road, Lagos; Energy House located on No.\n94, Awolowo Road, Ikoyi, Lagos; NICON Building at No."
  },
  {
    "headline": "Nigerian Army Lied, Didn’t Rescue 20 Policemen As Claimed – Yobe Police Command",
    "summarized_story": "The Yobe State Police Command has said troops of the Nigerian Army didn’t rescue 20 Nigerian Police Force personnel as claimed by the military.\nThe Acting Director, Defence Media Operations, Brig Gen Bernard Onyeuko, had in a statement on Thursday said troops of Operation Hadin Kai rescued the 20 policemen allegedly abducted by suspected terrorists.\nIt’s equally important that the actual facts and circumstances surrounding the incident must be brought to light, for the sake of the families of police personnel serving in Yobe State.\nArea of the state and burnt down the structures, but there was neither any loss of life, nor was any Police personnel kidnapped, or declared missing.\nThe absence of all these vital information in the publication means that the story is nothing but false, misleading and a misinformation."
  },
  {
    "headline": "'Until UAE, Nigeria solve ongoing issue' -- Emirates Airline suspends flight operations",
    "summarized_story": "Less than a week after the resumption of flights, Emirates Airline has announced the suspension of operations between Nigeria and Dubai.\nAdvertisementIn a travel notice on its website on Friday evening, the United Arab Emirates (UAE) flag carrier said the suspension will start on Monday until when Nigeria and the Arab nation “solve the ongoing issue”.\nOn Thursday, the Nigerian Civil Aviation Authority (NCAA) reduced Emirates’ flight operations into the country.\nAdvertisementIn its statement, Emirates said it is committed to its operations in Nigeria and will be ready to reinstate services once UAE and Nigerian authorities work on a solution to the ongoing issue.\nAdvertisementWith the new issue bordering on Bilateral Air Services Agreement (BASA), Nigeria and UAE authorities have resumed another round of diplomatic row that will see Emirates and Air Peace losing huge revenue."
  },
  {
    "headline": "'Until UAE, Nigeria solve ongoing issue' -- Emirates Airline suspends flight operations",
    "summarized_story": "Less than a week after the resumption of flights, Emirates Airline has announced the suspension of operations between Nigeria and Dubai.\nAdvertisementIn a travel notice on its website on Friday evening, the United Arab Emirates (UAE) flag carrier said the suspension will start on Monday until when Nigeria and the Arab nation “solve the ongoing issue”.\nOn Thursday, the Nigerian Civil Aviation Authority (NCAA) reduced Emirates’ flight operations into the country.\nAdvertisementIn its statement, Emirates said it is committed to its operations in Nigeria and will be ready to reinstate services once UAE and Nigerian authorities work on a solution to the ongoing issue.\nAdvertisementWith the new issue bordering on Bilateral Air Services Agreement (BASA), Nigeria and UAE authorities have resumed another round of diplomatic row that will see Emirates and Air Peace losing huge revenue."
  },
  {
    "headline": "Atiku: Parents should be forced to send kids to school... it will address insecurity",
    "summarized_story": "Atiku Abubakar, former vice-president, says parents should be forced to send their children to school.\nCountries that value education and make the necessary investments in it also tend to have more control over their affairs.\nWhy do we seem reluctant to the idea of providing good quality basic education for all our people?\nAdvertisement“We persuade parents to vaccinate their children against infectious diseases because vaccination is a good thing.\nParents should be persuaded, even forced, to send their children to school so they, at least, acquire basic education."
  },
  {
    "headline": "Atiku: Parents should be forced to send kids to school... it will address insecurity",
    "summarized_story": "Atiku Abubakar, former vice-president, says parents should be forced to send their children to school.\nCountries that value education and make the necessary investments in it also tend to have more control over their affairs.\nWhy do we seem reluctant to the idea of providing good quality basic education for all our people?\nAdvertisement“We persuade parents to vaccinate their children against infectious diseases because vaccination is a good thing.\nParents should be persuaded, even forced, to send their children to school so they, at least, acquire basic education."
  },
  {
    "headline": "2022: Prepare for possible increase in security threats, army chief tells troops",
    "summarized_story": "Faruk Yahaya, the chief of army staff (COAS), has directed commanders to prepare for a “possible increase” in the activities of “violent state actors” in 2022.\nHe also directed commanders to train troops on night operations and anti-ambush drill.\nSpeaking at the conference, Yahaya said the event provided the needed direction towards building the capacity of the army to accomplish assigned missions in defence of the country.\n“Furthermore, commanders must ensure that their troops master the art of night operations and anti-ambush drills by engaging in effective night operations and anti-ambush drill training.\nHe added that commanders must also look at the possibilities of conducting a wide range of operations against bandits and insurgents."
  },
  {
    "headline": "This may be African languages’ best bet against extinction",
    "summarized_story": "How can this be avoided, especially for African languages?\nGet the best African tech newsletters in your inboxMandla, a Zulu and Xhosa word that means power, is an innovative e-learning language app created for those who seek to strengthen their connection with their African roots.\nA diverse team building a diverse productAs the duo built, they realised they needed more diverse hands.\nThe third Apiou raised is about niche: their product focuses on Africa and African languages and culture.\nUnlike other language learning apps that are including African languages just to check a diversity-and-inclusion box, Mandla’s mission is deeper than educational or entertainment purposes; it’s really about cultural preservation."
  },
  {
    "headline": "Could Africa ditch cash?",
    "summarized_story": "The era of cash could be drawing to an end as central bank-backed digital currencies (CBDC”s) takes root in Africa.\nSo far, it’s only Nigeria that has launched an official, state-backed digital currency – christened the eNaira – on the continent as more countries continue to express interest.\nThe Baobab Network has traced at least 60 cryptocurrency companies in Africa, with the majority (43 percent) of them headquartered in Nigeria, followed by South Africa (18 percent) and Kenya (11 percent).\nThis is affirmed by another comparative study by GSMA published in March 2021 showing more than half of 310 live mobile money services in 2020 across the globe were found in Africa.\nWith over 55 percent of the world’s mobile money services recorded in Africa and a significant population turning to e-wallets and cryptocurrency, the question now becomes whether the continent might ditch paper money altogether."
  },
  {
    "headline": "CinetPay gets $2.4m seed to digitise payments in francophone Africa",
    "summarized_story": "CinetPay, an Ivory Coast-based startup that enables merchants in francophone Africa to accept and make electronic payments online or via mobile Point of Sale (PoS) devices, on Wednesday said it has raised $2.4 million seed funding.\nOn CinetPay’s mobile and web-based platform, businesses can sign up to process payments from over 130 different payment operators—including MTN mobile money, M-Pesa, Orange Money, Visa, Mastercard, etc—via a single interface.\nCinetPay thus simplifies the process of accepting payments, eliminating the need for merchants to integrate with different systems for managing sales and revenues.\nSimilarly, up to 80% of the population in the French-speaking African region have a mobile money account and less than 20% bank accounts.\nWalter Baddoo, co-founder and General Partner at 4DX Ventures reveals that the VC firm has been “tracking the francophone Africa market” for some time now and is impressed by CinetPay’s ambitious goal to digitise payments across the region."
  },
  {
    "headline": "Equinix in talks to acquire West African digital infrastructure firm MainOne",
    "summarized_story": "The company owns and operates an extensive submarine network extending 7,000 kilometers from Portugal to Lagos, Accra, and along the West African coast, with landing stations in Nigeria, Ghana, and Côte d’Ivoire.\nThese provide connectivity to and from Europe, West African countries, and the major business communities in Nigeria.\nMainOne also owns digital infrastructure assets that include three operational data centers, with an additional facility under construction expected to open in Q1 2022.\nGiven the huge supply gap in digital infrastructure in sub-Saharan Africa, Ayobami Omole, a Lagos-based telecom analyst at Tellimer, expects more of such transactions in the coming years.\nWhen completed, the acquisition will extend Platform Equinix into West Africa."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "Enterprise Hotel is democratising real estate investments for regular Africans",
    "summarized_story": "AdvertisementFractional investment startup, Enterprise Hotel, hopes to change this by offering Africans the opportunity to invest in commercial real estate with as little as ₦30,000 ($52).\nHow Enterprise Hotel makes moneyEnterprise Hotel makes money in two ways.\nHis time working in real estate showed him that only a handful of people could afford to buy or own real estate.\nThen we can start talking to investors.”Aside from helping more people gain access to real estate investments, Enterprise Hotel indirectly solves another problem.\nFor Enterprise Hotel, operating in the real estate industry with its high financial requirements poses a significant hurdle."
  },
  {
    "headline": "Open banking and its progenitor, nominees, Techpoint Awards 2021, and some exciting news out of Africa",
    "summarized_story": "However, the open banking system is arguably one of his most significant achievements.\nOluwanifemi Kolawole had a chat with the finance expert, and he dished about his career, life, and the open banking system.\nRead: Adedeji Olowe is building a global reputation as Africa’s open banking leaderAnd the nominees are…By now, I’m sure you’ve heard about the biggest tech event in West Africa — Techpoint Build 2021.\nNominees for Techpoint Awards (Nigerian edition) are out!\nTo check if your favourite Nigerian startup made the list, click here: Techpoint Awards 2021: And the nominees are…Some exciting newsCinetPay Founders."
  },
  {
    "headline": "Road to super app? GIGM adds e-wallet, bill payment features",
    "summarized_story": "Share this article:Nigeria-based mobility giant, GIGM, has launched a payment service for its users.\nSource: SuppliedThe super app model has gained popularity in emerging economies following the successes of WeChat and Alipay in China.\nFor GIGM, this could be building on its tech-enabled transportation platform to offer payment services to its users.\nNigeria’s fragmented transportation services mean that users cannot travel comfortably over short distances.\nWith its position as a leading transportation service provider and the addition of a payment option, the company looks to be on the right path."
  },
  {
    "headline": "Again, Emirates suspends flights to Nigeria over UAE-Nigeria diplomatic row",
    "summarized_story": "The United Arab Emirates (UAE) has rejected the directive from Nigeria that puts on hold Emirates flights suspension while restricting the carrier to one weekly light to Abuja.\nThe carrier, in a statement, said Emirates will be completely suspending its flights between Nigeria and Dubai until the Civil Aviation Authorities from both countries find a solution to the current ongoing issue.\nAccording to the carrier, “With the recently imposed directive limiting Emirates to operate one flight per week to Nigeria via Abuja, Emirates will be completely suspending its flights between Nigeria and Dubai, until the Civil Aviation Authorities from both countries find a solution to the current ongoing issue.\n“We regret the inconvenience caused, and customers can contact their travel agent or booking office to make alternative arrangements.\nNuhu explained that Hadi Sirika, the Minister of Aviation had graciously granted Emirates Airlines 21 frequencies weekly to two major airports in Nigeria; Lagos, 14 and Abuja, seven."
  },
  {
    "headline": "Access Bank to seek shareholders’ approval for HoldCo structure",
    "summarized_story": "At N9.20 per share which Access Bank closed on December 9, it represents +8.9percent return year-to-date (YtD), outperforming the market’s benchmark index at +3.51 percent same day.\nAccess Bank Holdings Plc would have 100percent ownership in Access Bank and relevant non-banking subsidiaries.\nAccess Bank Plc is a leading full-service commercial bank operating through a network of more than 600 branches and service outlets across 12 countries.\nAccess Holdings Plc will become the listed parent entity of the bank and related group companies.\nThe banking subsidiaries of Access Bank are Access Bank (Gambia) Limited; Access Bank (Sierra Leone) Limited; Access Bank (Rwanda) Plc; Access Bank (Zambia) Limited; Access Bank (R.D Congo) S.A.R.L; Access Bank (Ghana) Plc; Access Bank (Guinea) S.A; The Access Bank (UK )Limited; Access Bank (Mozambique) S.A; Access Bank Kenya Plc; Access Bank (South Africa) Limited; and African Banking Corporation of Botswana Limited."
  },
  {
    "headline": "A 13 -year old girl has been raped to death in Issele Uku, Aniocha Local Government Area of Delta – Nigerian Observer",
    "summarized_story": "A 13 -year old girl has been raped to death in Issele Uku, Aniocha Local Government Area of DeltaShare FacebookTwitterStumbleuponLinkedInPinterestWARRI – A rights activist, Henry Gwanimshu, had earlier posted the incident on Facebook.\nHe had said that the teenager was hypnotized and raped on Tuesday night by a married man, whose name was given as Mr. Nwosu Chuka.\n“Sadly, she died few hours ago at El Comfort Hospital Bonsaac Asaba.\n“Before her death, she told her sister that Chuka Nwosu took her to Vatonic hotel Issele Uku where she was raped and then used a white tissue paper to wipe blood from her private part.\nHe described the incident as second so far recorded at Issele Uku."
  },
  {
    "headline": "Obaseki swears in five SSAs, 10 SAs in Ovia South-West LGA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Thursday, swore in five Senior Special Assistants (SSAs) and 10 Special Assistants (SAs) in Ovia South-West Local Government Area (LGA) of the state.\nObaseki, who swore in the new appointees at Iguobazuwa, the administrative headquarters of Ovia South-West LGA, urged leaders and members of the party in the council to encourage more women into politics.\nObaseki noted, “When we campaigned during our election, you went with us and saw the challenges facing our people.\nHe said, “The e-registration in Ovia South West is not as encouraging and impressive as it ought to be.\nIn Orhionmwon, new members are over 52,000; Ikpoba-Okha 61,000, and Akoko-Edo 31,000, but here in Ovia South-West, it’s 2,510."
  },
  {
    "headline": "Obaseki inspects ongoing revamp of Edo College of Agric, expresses satisfaction with pace, quality of work – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Thursday, led other top government officials to inspect the ongoing rebuilding of the Edo State College of Agriculture and Natural Resources, Iguoriakhi in Ovia North-East Local Government Area, expressing satisfaction with the pace and quality of work.\nAccording to him, “I promised that we were going to build a world-class college of agriculture in Edo.\nI said we will have a College of Agriculture with three campuses, with the headquarters in Iguoriakhi and the other two campuses in Uromi and Agenebode.\nI am quite impressed with the quality and speed of work.\nNoting that the government is prioritizing agriculture to diversify the state’s economy, Obaseki stated, “Even when you don’t have money, the little you have will be channeled, while priority will be given to some key projects, and agriculture is one of them."
  },
  {
    "headline": "Yuletide: NAPTIP places Edo Residents on red alert against human trafficking – Nigerian Observer",
    "summarized_story": "Ebere added that it is now a serious offense punishable by law for anyone below 12 years to be employed as house help, stressing that Nigerians should report any form of human trafficking to the relevant authorities to reduce its menace.\n“Now, the children can go back to their community to prevent human trafficking and also respond when they get information about trafficking and they will over and over again say no to it.\nThe Edo State coordinator, Anti-Human Trafficking, Mr. Lawal Abdul-Sabur, said women and girl-child are more vulnerable to human trafficking and that at the end of the event, respite will be able to come their way.\nHe said five schools drawn from the community would participate in the symposium and various topics to test their knowledge as to who and how to curb human trafficking would be discussed by them.\nHe noted that government and individuals in the society must work in synergy to end human trafficking in the country just as he said it should not be left alone for one person or group."
  },
  {
    "headline": "The Nigerian Capital Market Celebrates Emergence of Its First Central Counterparty",
    "summarized_story": "The Nigerian Capital Market on Thursday, witnessed a monumental milestone as NG Clearing limited, the first Central Counterparty in West Africa, formally launched her operations.\nThe launch of NG Clearing as a CCP means that exchange-traded derivatives are now a possibility in the Nigerian Capital market.\nAs a Financial Market Infrastructure (FMI), NG Clearing facilitates the clearing and settlement of exchange-traded derivatives, management of counterparty risk, reduction of systemic risk, and promotion of the safety and integrity of Nigeria’s capital market.\nThis opens new and clear opportunities for investors, stakeholders, and other players in Nigeria’s capital market.\nThe establishment of NG Clearing will position the Nigerian capital market as a leader amongst emerging markets by facilitating greater market transparency, increase trading volumes, and overall improvement of the efficiency and competitiveness of the Nigerian capital market."
  },
  {
    "headline": "Jimoh Ibrahim loses appeal challenging seizure of properties by AMCON over N69.4bn debt",
    "summarized_story": "An Appeal Court sitting in Lagos has dismissed an appeal by the Chairman of Global Fleet Group, Barr Jimoh Ibrahim, challenging seizure of his properties by the Asset Management Corporation of Nigeria (AMCON).\nNwauzor said AMCON, enforcing Justice Aikawa’s order, took effective possession of all 12 properties through its Debt Recovery Agent – Pinheiro Legal Partners.\nThe assets include the building of NICON Investment Limited at Plot 242, Muhammadu Buhari Way, Central Business District, Abuja; NICON Hotels Limited building at Plot 557, Port-Harcourt Crescent, off Gimbiya Street, Abuja, and the building of NICON Lekki Limited also at No.\n94, Awolowo Road, Ikoyi, Lagos; NICON Building at No.\nAs a follow up to that decision, both sets of Applicants filed independent appeals in the Court of Appeal, Lagos division."
  },
  {
    "headline": "NCAA explains withdrawal of frequencies approval for Emirates Airlines",
    "summarized_story": "The Nigerian Civil Aviation Authority (NCAA) has given reasons for its withdrawal of the ministerial approval granted to Emirates Airlines by the Ministry of Aviation.\nAn airline frequency refers to how many services an airline may provide within a set period, usually on shorter routes between two large urban destinations.\nNuhu explained that the aviation minister, Sen. Hadi Sirika had granted Emirates Airlines 21 frequencies weekly to two major airports in Nigeria; Lagos, 14 and Abuja, seven.\nHe, however, explained that despite the approval, the GCAA refused to grant Air Peace three weekly frequencies to Sharjah, which the airline requested for, but rather approved just one frequency weekly.\nThe withdrawal is expected to take effect from December 12, allowing Emirates Airlines to fly into Abuja just once weekly on Thursdays, while its Lagos flight has been suspended."
  },
  {
    "headline": "NGX: Capital Market Set for Launch of Derivatives",
    "summarized_story": "All ducks now appear to be in a row for the launch of Exchange Traded Derivatives (ETDs) in the Nigerian capital market.\nAs a multi-asset Exchange, NGX recognises the importance of a well-developed Derivatives market, and we have worked hard to put the right regulatory and technology framework in place to support the launch of a standardized Exchange Traded Derivatives (ETDs) market.\nAmong the different commonly used financial instruments, index derivatives have raised a great deal of attention in researchers around the world.\nIndex derivatives exist for all asset classes, and over time their use has grown exponentially for a variety of purposes.\nIt would be recalled that NGX recently received approval for seven derivatives contracts from the SEC including the Access Bank Plc Stock Futures, Dangote Cement Plc Stock Futures, Guaranty Trust Bank Plc Stock Futures, MTN Nigeria Communications Plc Stock Futures, Zenith Bank Plc Stock Futures, NGX 30 Index Futures and NGX Pension Index Futures."
  },
  {
    "headline": "I Want To Offer Nigerians Affordable, Quality Homes – Oghenejobo",
    "summarized_story": "A Delta State-born estate developer, Jason Oghenejobo, has said his cardinal objective in his career is to support in the efforts to give Nigerians within the low and middle class quality and affordable homes.\nAccording to Oghenejobo, home is essential for any living creature, particularly humans, noting that the sector requires a human face especially among developers.\nHe remarked that with the expansion of his office to Turkey, there has been an accelerated progress.\nOghenejobo also said he hopes to expand his partnership with various developers new projects from across the world.\nEven as an undergraduate, he started off with phones and devices in computer village, before he later moved his capital into real estate."
  },
  {
    "headline": "I Want To Offer Nigerians Affordable, Quality Homes – Oghenejobo",
    "summarized_story": "A Delta State-born estate developer, Jason Oghenejobo, has said his cardinal objective in his career is to support in the efforts to give Nigerians within the low and middle class quality and affordable homes.\nAccording to Oghenejobo, home is essential for any living creature, particularly humans, noting that the sector requires a human face especially among developers.\nHe remarked that with the expansion of his office to Turkey, there has been an accelerated progress.\nOghenejobo also said he hopes to expand his partnership with various developers new projects from across the world.\nEven as an undergraduate, he started off with phones and devices in computer village, before he later moved his capital into real estate."
  },
  {
    "headline": "Nigeria Loses IMO Council Election For 5th Time",
    "summarized_story": "Nigeria has for the fifth time lost its bid to return to the Category ‘C’ of the International Maritime Organisation (IMO) in an election held on Friday in the United Kingdom.\nLEADERSHIP reports that Nigeria had lost consecutively in 2009, 2011, and 2017.\nThe preparation for 2021 IMO Council election had been on since the beginning of this year with many strategies and campaign mechanism targeted at clinching that seat, but unfortunately Nigeria lost the election again for the fifth consecutive time.\nThis development, would again deny Nigeria the pivotal role of contributing in taking key decisions in the global maritime space.\nCategory C comprises countries, which have special interest in maritime transportation or navigation, and whose election to the IMO council will ensure the representation of all major geographic areas of the world."
  },
  {
    "headline": "Nigeria Loses IMO Council Election For 5th Time",
    "summarized_story": "Nigeria has for the fifth time lost its bid to return to the Category ‘C’ of the International Maritime Organisation (IMO) in an election held on Friday in the United Kingdom.\nLEADERSHIP reports that Nigeria had lost consecutively in 2009, 2011, and 2017.\nThe preparation for 2021 IMO Council election had been on since the beginning of this year with many strategies and campaign mechanism targeted at clinching that seat, but unfortunately Nigeria lost the election again for the fifth consecutive time.\nThis development, would again deny Nigeria the pivotal role of contributing in taking key decisions in the global maritime space.\nCategory C comprises countries, which have special interest in maritime transportation or navigation, and whose election to the IMO council will ensure the representation of all major geographic areas of the world."
  },
  {
    "headline": "Again, Buhari Restates Commitment To Free, Fair Election, Transfer Of Power",
    "summarized_story": "President Muhammadu Buhari has assured Nigerians and the international community of free and fair 2023 general elections, and peaceful transfer of power.\n“Since assuming office in 2015, we have been able to introduce mechanisms to ensure free, fair and credible elections.\n“We, therefore, must remain resolute and enhance cooperation, so that together, we build back better democratic institutions and sustainable democratic values,’’ the President added.\nPresident Buhari noted that the summit was taking place at a time when democratic institutions around the world were facing several challenges.\n“Nevertheless, we have witnessed the resilience of democratic institutions in many countries that have held free, fair and transparent democratic elections under very challenging conditions,’’ he stated."
  },
  {
    "headline": "Alleged Sexual Dysfunction: Fani-Kayode is a lion, does his job well at night — Lady defends ex-minister",
    "summarized_story": "Reacting however, the lawyer with the Twitter handle @lindaoghogho claimed that the former minister is “a horse power” and that is “why many women are attracted to him”.\nHer words; “Forget what that Precious is saying, FFK na horse power raised to power 6.\nThey just can’t stop talking about him.\nI swear.”Forget what that Precious is saying, FFK na horse power raised to power 6.\nThey just can’t stop talking about him."
  },
  {
    "headline": "Alleged Sexual Dysfunction: Fani-Kayode is a lion, does his job well at night — Lady defends ex-minister",
    "summarized_story": "Reacting however, the lawyer with the Twitter handle @lindaoghogho claimed that the former minister is “a horse power” and that is “why many women are attracted to him”.\nHer words; “Forget what that Precious is saying, FFK na horse power raised to power 6.\nThey just can’t stop talking about him.\nI swear.”Forget what that Precious is saying, FFK na horse power raised to power 6.\nThey just can’t stop talking about him."
  },
  {
    "headline": "COVID-19: Ugwuanyi flags off mass vaccination campaign in Enugu",
    "summarized_story": "Governor Ifeanyi Ugwuanyi of Enugu State yesterday flagged off Coronavirus Disease (COVID-19) mass vaccination campaign in the state.\nIt has also created vaccination sites in all our secondary and tertiary healthcare facilities in addition to 24 new mass vaccination centres, 36 mobile vaccination vans and some selected private healthcare facilities designated as vaccination sites”.\nUgwuanyi for his unprecedented support to the agency, stating that “the target for this vaccination phase (mass vaccination campaign) is to get at least, 1,265,013 persons in Enugu State vaccinated by January 5th, 2022”.\nEnugu State currently leads in the Southeast and joins other few states that met all their set targets in COVID-19 vaccination rollout in the country.\nSam Ngene (House Committee Chairman on Health); State Commissioner for Health, Dr. Emmanuel Obi represented by the Director of Public Health, SMOH, Dr. Boniface Okolo; Hon."
  },
  {
    "headline": "COVID-19: Ugwuanyi flags off mass vaccination campaign in Enugu",
    "summarized_story": "Governor Ifeanyi Ugwuanyi of Enugu State yesterday flagged off Coronavirus Disease (COVID-19) mass vaccination campaign in the state.\nIt has also created vaccination sites in all our secondary and tertiary healthcare facilities in addition to 24 new mass vaccination centres, 36 mobile vaccination vans and some selected private healthcare facilities designated as vaccination sites”.\nUgwuanyi for his unprecedented support to the agency, stating that “the target for this vaccination phase (mass vaccination campaign) is to get at least, 1,265,013 persons in Enugu State vaccinated by January 5th, 2022”.\nEnugu State currently leads in the Southeast and joins other few states that met all their set targets in COVID-19 vaccination rollout in the country.\nSam Ngene (House Committee Chairman on Health); State Commissioner for Health, Dr. Emmanuel Obi represented by the Director of Public Health, SMOH, Dr. Boniface Okolo; Hon."
  },
  {
    "headline": "Why Buhari dropped Tinubu as running mate in 2015",
    "summarized_story": "Former Interim National Chairman of the All Progressives Congress, APC, Chief Bisi Akande has revealed why President Muhammadu Buhari dropped Asiwaju Bola Tinubu as his running mate in 2015.\nAkande, in his autobiography titled: “My Participations,” unveiled on Thursday in Lagos said Buhari stated that he was pressurised by northern governors to drop Tinubu as his running mate in 2015 to avert a Muslim-Muslim ticket.\n“So, when Buhari tabled the matter, I cautioned them that this must not get out beyond the four of us.\n‘How could he be talking of a running mate when he had not secured the ticket?\nI thanked Buhari for thinking so highly of our friend,” he said."
  },
  {
    "headline": "Insecurity: Northern group asks Buhari to resign",
    "summarized_story": "The Northern Youth Council of Nigeria has asked President Muhammadu Buhari to resign from office over his inability to tackle the security challenges confronting the country.\nThe group added that it is embarrassing that President Buhari is idly watching the terrorist elements reigning supreme in our country, imposing taxes on his supposed citizens, stopping them yet, he is unperturbed.\nThese are the clear characteristics of a leader that has run out of steam.\n“It is embarrassing that President Buhari is idly watching the terrorist elements reigning supreme in our Country, imposing taxes on his supposed citizens, stopping them yet, he is unperturbed.\nThese are the clear characteristics of a leader that has run out of steam."
  },
  {
    "headline": "2023: We’ll Guarantee A Free, Fair Elections, Transfer Of Power To Winners —Buhari",
    "summarized_story": "has guaranteed Nigerians and the international community that the general elections in 2023 will be free and fair, with a peaceful transfer of power.\n“Since assuming office in 2015, we have been able to introduce mechanisms to ensure free, fair and credible elections.\n“We, therefore, must remain resolute and enhance cooperation, so that together, we build back better democratic institutions and sustainable democratic values,’’ he added.\nBuhari noted that the Summit was taking place at a time when democratic institutions around the world were facing several challenges.\n“Nevertheless, we have witnessed the resilience of democratic institutions in many countries that have held free, fair and transparent democratic elections under very challenging conditions.’’"
  },
  {
    "headline": "BREAKING: Assassinated Katsina Commissioner, Rabe Nasir, Laid To Rest",
    "summarized_story": "Dr Rabe Nasir, the Katsina state Commissioner of Science and Technology who was assassinated on Wednesday, has been buried.\nLate Nasir was brutally murdered in his residence in Fatima Shema Estate, Katsina metropolis by yet-to-be-identified assailants.\nFederal Government’s delegation visits KatsinaMonguno said the delegation was sent by the President to condole with the Katsina State government and the family of late Nasir.\nNasir’s murder a different scenario – MasariMasari, said despite the banditry challenges that bedevil the state, the way and manner Dr Nasir was murdered is totally different.\n“But I know an investigation by security agencies would reveal what really happened."
  },
  {
    "headline": "BREAKING: Protest Rocks Beninese Consulate General’s Office In Lagos As Igboho’s Supporters Demand His Release",
    "summarized_story": "Some followers of Yoruba separatist leader, Sunday Adeyemo, alias Sunday Igboho have stormed the office of the Consulate General of Benin Republic on Victoria Island, Lagos, to protest against his incarceration.\nThe protesters also requested that Igboho be released from detention in the Benin Republic.\nThey stormed the office of the Consulate General with posters declaring their demands and called on Yoruba leaders and other Nigerians to ensure Igboho’s release.\nThey had accused Igboho of hoarding guns to fight the Nigerian state in his movement for a separate Yoruba Nation.\nHowever, he has since been held in Benin Republic as the Nigerian government pushes the authorities of the adjoining West African country to have Igboho repatriated."
  },
  {
    "headline": "BREAKING: Gunmen Murder Kidnapped Imo Monarch, Dump His Corpse At Market Square",
    "summarized_story": "Edwin Azike, the traditional king of Atta Ancient Kingdom in the Njaba Local Government Area of Imo State, was brutally murdered by unknown gunmen.\nHe was kidnapped on Thursday and his body was discovered on Friday morning in the community’s market square.\n“The traditional ruler of Atta Ancient Kingdom in the Njaba LGA, Eze Edwin Azike, has been murdered.\nHe said, “We have got the sad news about the killing of Eze Edwin Azike.\nI don’t know why traditional rulers are being hunted like this."
  },
  {
    "headline": "VIDEO: Watch as Wife slaps husband during live radio show",
    "summarized_story": "A Ghanaian woman has slapped her husband in front of a shocked presenter during a radio interview on Kumasi-based Nhyira FM in the Ashanti region of Ghana.\nShe assaulted her husband in front of the stunned radio presenter, their landlady, and other guests present in the studio.\nHe disclosed that his wife has been keeping faeces and urine in their room, although they have a toilet and a bathroom.\nThe distraught man further mentioned that his wife has not been washing their children’s clothes.\nThe woman noted that her husband was disgracing her on live radio."
  },
  {
    "headline": "Despair, anger as petrol price increase looms",
    "summarized_story": "Many Nigerians continue to wonder why the strong interest in petrol subsidy when subsidy for gas and kerosene has long been removed.\n“In the 2020 budget, we made a provision to assume that at the maximum by the end of June, we must exit the petroleum subsidy.\nThey wondered why the government would stop subsidies on petrol and pay N5, 000 to 40 million Nigerians.\nQuestioning the methodology for selecting the 40 million, the LCCI said the method of selecting the beneficiaries is faulty.\nSo, we have to have a landing as to the exact number between 20 to 40 million."
  },
  {
    "headline": "Cost of 2023 polls yet to be determined – Yakubu",
    "summarized_story": "Chairman Independent National Electoral Commission (INEC) Professor Mahmood Yakubu has disclosed that the electoral umpire was yet to determine the cost of the 2023 general elections.\nAlso on the possible cost of direct and indirect primaries, Yakubu said the commission “did not come up with any cost for the conduct of primaries per political parties by direct method.\nBuhari had written the INEC chairman for his comment on the controversial Electoral ACT Amendment Bill awaiting his assent.\n“He said the responsibility lies with all the political parties.\nHe said party primaries is the role of political parties and not INEC."
  },
  {
    "headline": "Emirates To Suspend Nigeria Flights From December 13",
    "summarized_story": "Emirates Airline on Friday said it was suspending all its flights between Nigeria and Dubai from December 13.\nThe airline’s decision comes after the Nigerian Civil Aviation Authority (NCAA) limited its flight activities in Nigeria.\nThe NCAA had accused UAE authorities of not granting equal rights to the sole Nigerian carrier, Air Peace, flying to Dubai via Sharjah.\nREAD ALSO: Why We Withdrew Frequencies Approval For Emirates Airlines – NCAA“With the recently imposed directive limiting Emirates to operate one flight per week to Nigeria via Abuja, Emirates will be suspending its flights between Nigeria and Dubai from 13 December 2021, until the UAE and Nigerian authorities work on a solution to the ongoing issue,” a statement from Emirates said on Friday.\nCustomers can simply hold on to their Emirates ticket and when flights resume, get in touch with their travel agent or booking office to make new travel plans."
  },
  {
    "headline": "ASUU Threatens To Go On Strike, Asks Nigerians To Blame Govt",
    "summarized_story": "Members of the Academic Staff Union of Universities (ASUU) have threatened to embark on another industrial action following a three-week ultimatum issued by the union last month.\nThey, however, called on well-meaning Nigerians to prevail on the Federal Government to honour the agreement reached with the union.\nHe explained that the union was planning another strike because of the failure to fully implement the MoA.\nHe accused the government of demonstrating an intention to embarrass the collective resolve to save university education from total collapse.\n“We, therefore, call on the general public and concerned citizens to save public universities by compelling the government to honour its agreements,” said Jonathan."
  },
  {
    "headline": "Buhari Pledges Credible Elections In 2023, Peaceful Transfer Of Power To Winners",
    "summarized_story": "President Muhammadu Buhari has assured Nigerians and the international community of free and fair elections when citizens go to the polls to elect a new leader in 2023.\n“Since assuming office in 2015, we have been able to introduce mechanisms to ensure free, fair, and credible elections,” he told the summit.\n“We, therefore, must remain resolute and enhance cooperation, so that together, we build back better democratic institutions and sustainable democratic values,” President Buhari stated.\nAccording to him, the summit is taking place at a time when democratic institutions around the world were facing several challenges.\n“Nevertheless, we have witnessed the resilience of democratic institutions in many countries that have held free, fair, and transparent democratic elections under very challenging conditions,” he said."
  },
  {
    "headline": "FG Begins Administration Of COVID-19 Booster Shots",
    "summarized_story": "Nigeria on Friday started the administration of COVID-19 booster shots, days after the Federal Government approved the decision.\nDonates 2.5 Million Doses Of Pfizer COVID-19 Vaccines To NigeriaAustralia Halts Border Reopening As WHO Warns On New VariantFG Approves COVID-19 Booster Shots Amid Omicron VariantAt the event held in Abuja on Thursday, the NPHCDA boss also explained that the eligibility criteria for the booster jabs.\n“Eligibility for the booster dose includes being 18 years and above, fully vaccinated with either two doses of AstraZeneca, Moderna or Pfizer Bio-N-Tech or a single dose of the Johnson and Johnson vaccine,” he noted.\n“The time interval before the booster dose is at least six months for these vaccines, except the Johnson and Johnson which is at least two months.\n“Today, Thursday, December 9th, 2021, 7,361,810 Nigerians have received the first dose of the COVID-19 vaccine and this represents 6.6% of the eligible population,” Faisal said."
  },
  {
    "headline": "VIDEO: PDP Inaugurates New National Chairman, 20 NWC Members",
    "summarized_story": "﻿Nigeria’s main opposition party, the Peoples Democratic Party has sworn in a new National Working Committee (NWC) to pilot the affairs of the party for the next four years.\nPDP National Chairman, Iyorchia Ayu, and 20 other members of the NWC were sworn in on Friday at a ceremony held at the International Conference Centre in Abuja.\nThey include Deputy National Chairman (North) – Umar Damagum, Deputy National Chairman (South) – Taofeek Arapaja, National Secretary – Samuel Anyanwu, National Treasurer – Ahmed Mohammed, National Organising Secretary – Umar Bature, National Financial Secretary – Daniel Woyegikuro, National Women’s Leader – Professor Stella Effah-Attoe, National Youth Leader – Muhammed Suleiman, and National Legal Adviser – Kamaldeen Ajibade.\nOthers are National Publicity Secretary – Debo Ologunagba, National Auditor – Okechuckwu Daniel, Deputy National Secretary – Setoji Kosheodo, Deputy National Treasurer – Ndubisi David, Deputy National Publicity Secretary – Ibrahim Abdullahi, Deputy National Organising Secretary – Ighoyota Amori, Deputy National Financial Secretary – Adamu Kamale, Deputy National Women’s Leader – Hajara Wanka, Deputy National Youth Leader – Timothy Osadolor, Deputy National Legal Adviser – Okechukwu Osuoha, and Deputy National Auditor – Abdulrahman Mohammed.\nThe event was well attended by party leaders including serving and former governors, National Assembly members, and two former vice presidents, Atiku Abubakar and Namadi Sambo."
  },
  {
    "headline": "ECOWAS council considers two-term limits for presidents in the region",
    "summarized_story": "ECOWAS council considers two-term limits for presidents in the region"
  },
  {
    "headline": "Akeredolu's aide accuses Federal Fire Service of damaging his vehicle -",
    "summarized_story": "A Special Assistant to the Ondo state Governor, Oluwarotimi Akeredolu on Multimedia, Olugbenga Asade, has accused the Federal Fire Service Corps (Ondo State) of damaging his vehicle.\nHe noted that two months after damaging his vehicle, nothing has been done to fix it by the fire fighters.\nThey declined my request to see the driver that crashed my vehicle.\nHe therefore requested, that the Federal Fire Service Corps should provide the truck driver that crashed his vehicle with an apology for absconding and as well, take responsibility of fixing his damaged vehicle.\nAccording to him, the Federal Fire service in the state has continued to turn deaf ears to his plea."
  },
  {
    "headline": "[WATCH] Bisi Akande unveils Autobiography entitled 'My Participations'",
    "summarized_story": ""
  },
  {
    "headline": "Updated: 28-year-old female lawyer nominated commissioner in Nasarawa -",
    "summarized_story": "A 28 year old female lawyer, Hannah Bala, has been nominated as a Commissioner by the Nasarawa State Governor, Abdullahi Sule.\nThe nomination of the female lawyer was announced at the state House of Assembly by the Speaker, Ibrahim Balarabe.\nThis follows the presentation of fifteen commissioner nominees to the assembly for consideration.\nSpeaking on her nomination, the Nasarawa State governor, Abdullahi Sule through his Chief Press Secretary, said the decision is to encourage and ensure active participation of the youths in governance.\nHannah graduated from the Nasarawa State University Keffi in 2016 and proceeded to the Nigerian law school where she graduated in 2018."
  },
  {
    "headline": "Nigerian Magnate Otedola Acquires Additional Stake in First Bank Holdings, Consolidates Largest Shareholder Status",
    "summarized_story": "Mr Otedola acquired at least 2.5 per cent additional interest in the company, bringing his total stake to 7.57 per cent.\nMr Otedola previously made piecemeal acquisitions summing up to 5.07 per cent.\nThe purchase will formally consolidate his position as the single biggest shareholder of FBN Holdings, placing him well ahead of his closest rival Tunde Hassan-Odukale, FirstBank’s chairman, whom he has come in contention with since the news of his share acquisitions broke into the open late October.\nDays after, the board of FBN Holdings issued a letter seen by PREMIUM TIMES to the Corporate Affairs Commission, notifying Hassan-Odukale’s “5.36 per cent” cumulative stake and other related details.\nThat technically puts Hassan-Odukale’s interest in the entity at 4.31 per cent after deducting the controversial stake."
  },
  {
    "headline": "Nigeria Reciprocates By Limiting Emirates’ Flights – Trending with Ojy Okpe",
    "summarized_story": "Nigeria’s federal government on Thursday withdrew the approval granted to Emirates Airlines for their Winter Schedule.\nMeanwhile, a video now making the rounds on social media shows a man, being assaulted by a naval officer.\nThe man in the video claimed that the naval officer broke his windscreen with his gun because he refused to park his car after the officer asked him to pull over for driving too fast.\nIn an interesting development, Pope Francis’ has declared that lust is not the worst of the seven deadly sins.\nAccording to the Pontiff who made the declaration on December 6th, there are worse indiscretions than sex outside of marriage."
  },
  {
    "headline": "Actor Jussie Smollett Found Guilty of Staging Fake Hate Crime",
    "summarized_story": "Actor Jussie Smollett, one-time star of the TV drama “Empire,” was found guilty on Thursday of staging a hate crime against himself in what prosecutors said was a bid to gain sympathy and boost his career.\nThe actor faces a maximum sentence of three years in prison for each count when he is sentenced, although he could be given probation.\nThe Cook County Circuit Court jury, which deliberated for nine hours, found Smollett, 39, guilty of five of the six felony disorderly conduct counts he faced, one for each time he was accused of lying to police.\nDescribing Smollett’s account of what happened as “ridiculous,” special prosecutor Dan Webb told reporters following the verdict that “Mr.\nCook County Judge James Linn did not set a date for sentencing, but scheduled a presentencing hearing for Jan. 27."
  },
  {
    "headline": "In Reciprocal Action, Nigeria Reduces Emirates Flights to Once Weekly",
    "summarized_story": "In a move signalling reciprocity of action, Nigeria’s government, on Thursday reduced Emirates flights to the country, both Lagos and Abuja, from daily to once weekly which would be only on Thursdays.\nThe action followed the decision of the government of the United Arabs Emirates (UAE) to cut Nigeria’s Air Peace flight operations to Sharjah to once a week.\n“Please, kindly note, henceforth Emirates Airlines is granted approval to operate only one weekly passenger frequency to Abuja on Thursdays.\nOn the other hand, a letter seen by THISDAY that was addressed to Air Peace on the matter stated: “Greetings from Sharjah Airport.\nThey refused to give Air Peace slot allocation but Nigeria allows Emirates to operate to Dubai and Lagos daily,” an industry source told THISDAY."
  },
  {
    "headline": "Buhari Promised to Pick Tinubu as Running Mate in 2015, Ex-Party Chairman Akande Reveals",
    "summarized_story": "‘How could he be talking of a running mate when he had not secured the ticket?” I mused.\n“He said it was from this list that Buhari would choose a running mate.\n‘General, where are you choosing your running mate from?’ He answered, ‘The South-west.’ ‘Oh!\n‘If indeed you promised to make Asiwaju your running mate, it would not be fair to renege,’ he said.\n“We were registered in July 2013, and he called me to prevail on Tinubu to be his running mate in April 2014."
  }
]